[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang yang menentang agama yang haq dan mengingkarinya, maka harta dan benda dan anak-anak mereka tidak bermanfaat sedikitpun untuk menyingkirkan siksaan Allah jika siksaan itu menimpa mereka di dunia, begitu juga tidak akan dapat menolak siksaan itu dari mereka di akhirat, dan mereka itu merupakan bahan bakar neraka pada hari kaiamat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Sesungguhnya orang-orang yang ingkar kepada Allah dan Rasul-Nya tidak akan bisa dilindungi oleh harta dan anak-anak mereka dari azab Allah, baik di dunia maupun di akhirat. Orang-orang semacam itu adalah bahan bakar neraka Jahanam yang akan dinyalakan pada hari kiamat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "10. orang-orang yang mendustakan Allah tidak akan dapat ditolong dari azab-Nya oleh harta dan keturunan mereka. Mereka adalah orang-orang yang jauh dari kebenaran yang akan menjadi bahan bakar neraka di hari kiamat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. إِنَّ الَّذِينَ كَفَرُوا۟ لَن تُغْنِىَ عَنْهُمْ أَمْوٰلُهُمْ وَلَآ أَوْلٰدُهُم مِّنَ اللهِ شَيْـًٔا ۖ ( Sesungguhnya orang-orang yang kafir, harta benda dan anak-anak mereka, sedikitpun tidak dapat menolak (siksa) Allah dari mereka) Yakni tidak akan bermanfaat bagi mereka di sisi Allah dan tidak akan menyelamatkan mereka dari azab-Nya. وَأُو۟لٰٓئِكَ هُمْ وَقُودُ النَّارِ (Dan mereka itu adalah bahan bakar api neraka ) Yakni menjadi bahan bakar yang dipakai untuk menyalakan naraka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10. Sesungguhnya orang-orang yang ingkar kepada Allah dan para rasulNy yang di antaranya itu adalah nabi Muhammad SAW itu harta-harta dan anak-anaknya tidak akan berguna bagi mereka untuk berlindung dari azab Allah. Dan mereka itu adalah kayu bakar yang digunakan untuk menyalakan neraka Jahanam"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang yang kafir, tidak akan berguna} tidak akan membantu {bagi mereka sedikit pun harta benda dan anak-anak mereka dari (azab) Allah} dari azab Allah {Mereka itulah bahan bakar api neraka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "10-11. Setelah Allah menyebutkan tentang Hari Kiamat, Allah memberitakan tentang semua orang-orang yang mengingkari Allah dan mendustakan para Rasul Allah, bahwa mereka pasti akan masuk ke dalam neraka dan tersiksa di dalamnya, dan bahwa harta dan anak-anak mereka tidak berguna lagi bagi mereka sama sekali dari siksa Allah, dan bahwasanya Allah akan menimpakan atas mereka hukuman-hukuman dan siksaan-siksaan di dunia sebagaimana yang ditimpakan kepada Firaun dan seluruh umat yang mendustakan ayat-ayat Allah. “karena itu Allah menyiksa mereka disebabkan dosa-dosa mereka.” Dan Allah menyegerakan atas mereka siksaan-siksaan dunia yang berlanjut hingga siksaan-siksaan akhirat, “Dan Allah sangat keras siksaNYa.” Maka janganlah kalian meremehkan siksaan Allah hingga kalian akan merasa biasa hidup di atas kekufuran dan sikap mendustakan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 10: Sesungguhnya orang-orang yang kafir itu, harta-harta mereka dan anak-anak mereka, tidak akan dapat melepaskan mereka daripada (hukuman) Allah sedikit jua pun; dan mereka itu ialah bakaran neraka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Anak dan harta tidaklah bermanfaat bagi seorang hamba, yang bermanfaat hanyalah iman dan amal shalih."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 10",
    "description": "Sesungguhnya orang-orang yang kafir, yang menutupi tanda-tanda keesaan dan kebesaran Allah serta mengingkari petunjuk-petunjuknya, bagi mereka tidak akan berguna sedikit pun harta benda yang Allah berikan kepada mereka walau sebanyak apa pun, dan demikian pula anak-anak mereka walau sebanyak dan sehebat apa pun, terhadap azab Allah di dunia. Mereka juga tidak dapat menolak siksa-Nya di akhirat kelak, dan bahkan mereka itu menjadi bahan bakar api nerakakeadaan mereka yang selalu mendustakan agama Allah dan azab yang diturunkan kepada mereka seperti keadaan pengikut firaun dan orang-orang kafir yang hidup sebelum mereka. Mereka semua mendustakan ayat-ayat kami yang tertulis dalam kitab suci dan/atau yang terbentang di alam raya. Mereka mendustakan ayat-ayat Allah, maka Allah menyiksa mereka disebabkan dosa-dosanya. Allah sangat berat hukuman-Nya."
  }
]