[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang yang beriman kepada Allah dan RasulNya dan mengerjakan ajaran syariat Nya, jika kalian menaati sekelompok Yahudi dan Nasrani dari orang-orang yang telah Allah berikan kepada mereka Kitab Taurat dan Injil, niscaya mereka akan menyesatkan kalian dan melemparkan berbagi syubhat kepada kalian terkait agama kalian, supaya kalian kembali mengingkari kebenaran itu sesudah kalian mengimaninya. Maka janganlah kalian merasa aman dari tipu daya mereka terhadap agama kalian, dan jangan kalian menerima pendapat atau usulan dari mereka sama sekali."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "100. Wahai orang-orang yang beriman kepada Allah dan mengikuti Rasul-Nya, jika kalian mematuhi sekelompok Ahli Kitab dari kalangan Yahudi dan Nasrani terkait apa yang mereka ucapkan, dan kalian menerima pendapat mereka tentang apa yang mereka sampaikan, niscaya mereka akan mengembalikan kalian kepada kekafiran setelah beriman. Hal itu karena mereka menyembunyikan kedengkian dan kesesatan dari jalan yang benar."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "100. Allah memperingatkan orang-orang beriman dari mentaati sekelompok orang Yahudi dan Nasrani yang suka membuat tipudaya, mereka sangat ingin kalian tersesat dan kembali kepada kekafiran setelah beriman."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "100. إِن تُطِيعُوا۟ فَرِيقًا مِّنَ الَّذِينَ أُوتُوا۟ الْكِتٰبَ (jika kamu mengikuti sebahagian dari orang-orang yang diberi Al Kitab) Yakni apabila kalian mendengarkan dan mentaati tipu daya mereka dan condong kepada perkataan mereka niscaya mereka akan menjadikan kalian seperti apa yang mereka harapkan yang berupa يَرُدُّوكُم بَعْدَ إِيمٰنِكُمْ كٰفِرِينَ(mengembalikan kamu menjadi orang kafir sesudah kamu beriman)"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "100 Hai orang-orang yang beriman, jika kalian mengikuti sebagian orang-orang Yahudi dengan mendengarkan perkataan mereka, niscaya mereka akan mengembalikan kamu menjadi orang kafir sesudah kamu beriman. Ayat ini turun seperti ayat sebelumnya yaitu ketika orang Yahudi berusaha menyebar fitnah antara suku Aus dan Khazraj."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, jika kalian mengikuti segolongan} satu golongan {dari orang yang diberi Al-kitab, maka mereka akan mengembalikan kalian} mengembalikan kalian {menjadi orang-orang kafir setelah beriman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "100-101. Ketika Allah telah menegakkan hujjah atas ahli kitab dan menjelek-jelekan mereka karena kekufuran dan kedurhakaan mereka,maka Allah mengingatkan kaum Mukminin agar tidak terpedaya oleh mereka. Dan Allah menjelaskan kepada mereka bahwa di antara kelompok ini ada yang selalu bersemangat dalam membahayakan kalian dan mengmbalikan kalian pada kekufuran setelah keimanan. Akan tetapi segala puji hanya milik Allah, kalian semua wahai sekalian kaum Muminin, setelah Allah mengaruniakan kalian dengan agama ini dan kalian telah menyaksikan ayat-ayat Allah, kebaikanya, keramahaNya, dan keutamaan-utamaanNya, sementara Rasulluloh ada di tengah kalian yang akan memberikan kalian petunjuk pada segala perkara yangn bermanfaat untuk kalian, dan kalian berpegang teguh kepada Allah dan kepada tali agamaNya, niscaya mustahil mereka bisa mengembalikan kalian dari agama kalian. Karena agama yang di bangun atas dasar-dasar dan tongkak-tongkak yang kokoh seperti ini, yang cahayanya sangat terang menyinari, bisa menarik hati manusia, dan menyatukan semua hati manusia, serta menyampaikan hamba ke tempat yang paling mulia dan keingininan yang paling utama. “Barang siapa yang berpegang teguh kepada agama Allah,” maksudnya, bertawakal kepadaNya dan berlindung di bawah perlindungaNya, ”maka sesungguhnya dia telah di beri petunjuk kepada jalan yang lurus.” Demikianlah, dimana terdapat anjuran untuk berpegang taguh kepada agama Allah dan bahwa hal itu adalah jalan menuju keselamatan dan petunjuk."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 100: Hai orang-orang yang beriman! Jika kamu taat kepada segolongan dari (kafir-kafir) yang diberi Kitab itu, niscaya mereka kembalikan kamu jadi kafir-kafir sesudah kamu beriman."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini turun ketika sebagian orang-orang Yahudi melewati kabilah Aus dan Khazraj. Bersatunya mereka membuat orang-orang Yahudi menjadi jengkel, maka mereka pun mengingatkan masa lalu kabilah Aus dan Khazraj di zaman jahiliyyah. Akibatnya, dua kabilah itu saling bertengkar dan hampir saja terjadi peperangan. Di ayat ini, Allah Subhaanahu wa Ta'aala mengingatkan hamba-hamba-Nya agar tidak termakan oleh tipu daya mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 100",
    "description": "Setelah ayat sebelumnya mengecam ahli kitab, maka ayat ini ditujukan kepada orang-orang yang beriman. Wahai orang-orang yang beriman! jika kamu mengikuti sebagian dari orang yang diberi kitab, yaitu yahudi dan nasrani, niscaya mereka akan mengembalikan dan memalingkan kamu dari agama kamu agar kembali menjadi orang kafir yang kukuh kekafirannya setelah kamu beriman kepada nabi Muhammad. Dan bagaimana kamu sampai menjadi murtad dan kembali kafir, padahal ayat-ayat Allah dibacakan kepada kamu, dan rasul-Nya pun berada di tengah-tengah kamu dan telah nyata kebenaran dakwah risalahnya' maka berpegangteguhlah kepada agama Allah. Barang siapa berpegang teguh kepada agama Allah, maka sungguh, dia diberi petunjuk kepada jalan lebar dan mudah dilalui yang lurus, berupa keimanan yang kuat dan akan diberi kebahagiaan di dunia dan akhirat. Ayat ini mengisyaratkan bahwa orang yang beriman akan selalu mendapatkan cobaan. Walau begitu, barang siapa menjadikan agama Allah sebagai pegangan dan Allah sebagai tempat kembali serta memperbanyak ibadah, maka dia akan selamat dari cobaan tersebut"
  }
]