[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Bagaiman mungki kalian kafir kepada Allah (wahai kaum mukminin), sedang ayat-ayat Al-quran dibacakan kepada kalian, dan di tengah kalian terdapat Rasulullah, Muhammad , yang menyampaikannya kepada kalian? Barangsiapa bertawakal kepada Allah dan berpegang teguh dengan Al-quran dan as-Sunnah, maka sungguh dia telah diberi taufik menuju jalan terang dan manhaj yang lurus."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "101. Bagaimana mungkin kalian ingkar kepada Allah setelah beriman kepada-Nya, sedangkan kalian mempunyai alasan terbesar untuk mempertahankan iman?! Ayat-ayat Allah selalu dibacakan kepada kalian, dan Rasul-Nya Muhammad -ṣallallāhu 'alaihi wa sallam- senantiasa menjelaskannya kepada kalian. Barangsiapa yang berpegang teguh pada kitab Allah dan Sunah Rasul-Nya, maka Allah telah membimbingnya ke jalan lurus, yang tidak ada penyimpangan di dalamnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "101. Kemudian Allah mendorong mereka untuk tetap teguh di atas keimanan dan menjauhi kekafiran: “bagaimana kalian mengingkari Allah, sedangkan ayat-ayat al-Qur’an dibacakan kepada kalian dan sunnah Rasulullah ada pada kalian? Barangsiapa yang berpegang teguh pada Islam maka ia telah diberi taufik menuju jalan yang benar.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "101. وَكَيْفَ تَكْفُرُونَ وَأَنتُمْ تُتْلَىٰ عَلَيْكُمْ ءَايٰتُ اللهِ (Bagaimanakah kamu (sampai) menjadi kafir, padahal ayat-ayat Allah dibacakan kepada kamu) Maka bacalah dan berpegang teguhlah padanya agar kalian mengetahui apa yang diinginkan orang-orang Yahudi atas kalian. وَفِيكُمْ رَسُولُهُۥ ۗ (dan Rasul-Nya pun berada di tengah-tengah kamu) Maka kembalilah kepadanya dan serahkanlah urusan kalian padanya untuk menggagalkan tipu daya mereka. Dan hal ini berlaku pada masa Rasulullah masih hidup dan setelah Beliau wafat, karena sunnah-sunnahnya dan al-Qur’an yang beliau datangkan semuanya masih ada diantara kita -dan para ulama mengetahui hal ini- sehingga seakan-akan Rasulullah masih berada diantara kita. Dan dengan ini apabila kita berpegang teguh dan kembali kepadanya maka itu akan menjadi pelindung kita dari tipu daya dan fitnah-fitnah mereka. وَمَن يَعْتَصِم بِاللهِ (Barangsiapa yang berpegang teguh kepada (agama) Allah) Yakni yang diberi petunjuk untuk berpegang teguh kepada-Nya dan meninggalkan kecondongan kepada musuh-musuh-Nya pasti hidayah akan tetap ada pada mereka dan membersihkan mereka dari kesesatan yang diinginkan oleh para musuh tersebut."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Ayat ini menjadi bukti akan kemampuan para shabat Rasulullah, dan bahwasanya bagi mereka ada penghalang dari kesesatan, diantaranya : mereka mendengarkan al-qur'an langsung dari Rasul yang diwahyukan kepadanya, mereka menyaksikan langsung keberadaan dan kenabian Rasulullah, dan sesungguhnya keberadaan beliau adalah keteguhan para sahabat dari kesesatan. Qatadah pernah bertutur : \"adapun Rasulullah telah pergi menjemput rahmat Allah, sedangkan kitab Allah akan tetap berjaya sepanjang masa\""
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "101 Bagaimanakah kamu bisa menjadi kafir dan membangkang wahai orang-orang mukmin, dan kembali kepada kesesatan Jahiliyyah? Padahal ayat-ayat Allah telah dibacakan kepada kamu yang memerintahkan untuk menyatukan barisan, saling mencintai dan menjauhi perpecahan? Apalagi Rasul-Nya pun berada di tengah-tengah kamu yang menunjukkan jalan kebenaran dan menuntun kalian keluar dari kesesatan dan kejahatan jahiliyyah? Maka kembalilah kalian pada Rasul, kemudian juga kepada Al-quran. Barangsiapa yang berpegang teguh kepada kitab dan agama Allah, maka sesungguhnya ia telah diberi petunjuk kepada jalan yang lurus yaitu Islam"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bagaimana kalian menjadi kafir, padahal ayat-ayat Allah dibacakan kepada kalian dan ada RasulNya berada di tengah-tengah kalian} nabi Muhammad SAW {Siapa saja yang berpegang teguh pada Allah} berpegang teguh kepada agama Allah {sungguh dia telah diberi petunjuk} tuntunan {ke jalan yang lurus"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "100-101. Ketika Allah telah menegakkan hujjah atas ahli kitab dan menjelek-jelekan mereka karena kekufuran dan kedurhakaan mereka,maka Allah mengingatkan kaum Mukminin agar tidak terpedaya oleh mereka. Dan Allah menjelaskan kepada mereka bahwa di antara kelompok ini ada yang selalu bersemangat dalam membahayakan kalian dan mengmbalikan kalian pada kekufuran setelah keimanan. Akan tetapi segala puji hanya milik Allah, kalian semua wahai sekalian kaum Muminin, setelah Allah mengaruniakan kalian dengan agama ini dan kalian telah menyaksikan ayat-ayat Allah, kebaikanya, keramahaNya, dan keutamaan-utamaanNya, sementara Rasulluloh ada di tengah kalian yang akan memberikan kalian petunjuk pada segala perkara yangn bermanfaat untuk kalian, dan kalian berpegang teguh kepada Allah dan kepada tali agamaNya, niscaya mustahil mereka bisa mengembalikan kalian dari agama kalian. Karena agama yang di bangun atas dasar-dasar dan tongkak-tongkak yang kokoh seperti ini, yang cahayanya sangat terang menyinari, bisa menarik hati manusia, dan menyatukan semua hati manusia, serta menyampaikan hamba ke tempat yang paling mulia dan keingininan yang paling utama. “Barang siapa yang berpegang teguh kepada agama Allah,” maksudnya, bertawakal kepadaNya dan berlindung di bawah perlindungaNya, ”maka sesungguhnya dia telah di beri petunjuk kepada jalan yang lurus.” Demikianlah, dimana terdapat anjuran untuk berpegang taguh kepada agama Allah dan bahwa hal itu adalah jalan menuju keselamatan dan petunjuk."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 101: Dan bagaimana kamu akan kufur padahal akan dibacakan kepada kamu firman-firman Allah dan ada di antara kamu Rasul-Nya? Dan barangsiapa berpegang dengan Allah, maka sesungguhnya akan dipimpin dia ke jalan yang lurus."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dalam ayat ini, Allah Subhaanahu wa Ta'aala menyebutkan sebab terbesar yang menjadikan kaum mukmin dapat tetap kokoh di atas keimanan mereka dan tidak goyah, yaitu dengan seringnya dibacakan kepada mereka ayat-ayat-Nya sebagaimana yang biasa mereka dengarkan dari Rasulullah shallallahu 'alaihi wa sallam ketika shalat maupun pada beberapa kesempatan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 101",
    "description": "Dan bagaimana kamu sampai menjadi murtad dan kembali kafir, padahal ayat-ayat Allah dibacakan kepada kamu, dan rasul-Nya pun berada di tengah-tengah kamu dan telah nyata kebenaran dakwah risalahnya' maka berpegangteguhlah kepada agama Allah. Barang siapa berpegang teguh kepada agama Allah, maka sungguh, dia diberi petunjuk kepada jalan lebar dan mudah dilalui yang lurus, berupa keimanan yang kuat dan akan diberi kebahagiaan di dunia dan akhirat. Ayat ini mengisyaratkan bahwa orang yang beriman akan selalu mendapatkan cobaan. Walau begitu, barang siapa menjadikan agama Allah sebagai pegangan dan Allah sebagai tempat kembali serta memperbanyak ibadah, maka dia akan selamat dari cobaan tersebut supaya kamu memperoleh keimanan yang kuat dan tidak goyah ketika terjadi cobaan, maka wahai orang-orang yang beriman! bertakwalah kepada Allah sebenar-benar takwa kepada-Nya sesuai kebesaran, keagungan, dan kasih sayang-Nya kepada kamu. Bukti ketakwaan tersebut adalah menaati Allah dan tidak sekalipun durhaka, mengingat-Nya dan tidak sesaat pun melupakan-Nya, serta mensyukuri nikmat-Nya tanpa sekalipun dan sekecil apa pun mengingkarinya sampai batas akhir kemampuan kamu, dan janganlah kamu mati kecuali dalam keadaan muslim, berserah diri kepada Allah dengan tetap memeluk agama yang diridai, yaitu islam. Karena tidak seorang pun mengetahui kapan datangnya kematian, maka berusahalah sekuat tenaga untuk selalu berada di jalan Allah, karena Allah akan menganugerahi hamba sesuai usaha yang dilakukannya."
  }
]