[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang yang beriman kepada Allah dan RasullNya dan melaksanakan syariat Nya, takutlah kalian kepada Allah dengan sebenar-benarnya, yaitu dengan cara menaatiNya dan tidak bermaksia kepadaNya, mensyukuriNya dan tidak mengingkari nikmatnya, serta mengingat-ingatNya dan tidak melupakanNya. Dan teruslah kalian berpegang teguh dengan keislaman kalian hingga akhir hayat kalian, supaya kalian menjumpai Allah, sedang kalian dalam keadaan tersebut."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "102. Wahai orang-orang yang beriman kepada Allah dan mengikuti Rasul-Nya! takutlah kalian kepada Rabb kalian dengan sebenar-benarnya takut, yaitu dengan mengikuti perintah-perintah-Nya, menjauhi larangan-larangan-Nya dan mensyukuri nikmat-nikmat-Nya. Dan berpegang-teguhlah kalian pada agama kalian sampai maut menjemput ketika kalian dalam keadaan seperti itu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "102. Hai orang-orang beriman, percayalah kepada Allah dan rasul-Nya, dan takutlah kepada Allah sebenar-benarnya dengan menjalankan perintah-Nya dan menjauhi larangan-Nya, serta tetaplah teguh dengan Islam sampai akhir hayat kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "102. اتَّقُوا۟ اللهَ حَقَّ تُقَاتِهِۦ (bertakwalah kepada Allah sebenar-benar takwa kepada-Nya) Yakni takwa yang sebenarnya, yang dengan tidak meninggalkan apa yang diwajibkan syariat atas mereka dalam mengerjakannya, dan tidak melakukan apa yang diwajibkan untuk meninggalkannya dengan mengerahkan segala kemampuan dan usaha untuk melaksanakan hal itu. Para ahli tafsir menyebutkan bahwa ketika ayat ini turun, orang-orang mukmin berkata: wahai Rasulullah siapa yang mampu melakukan hal ini? Karena hal itu memberatkan mereka. Maka turunlah ayat فاتقوا الله ما استطعتم (bertakwalah kepada Allah dengan apa yang kalian mampu) untuk menasakh ayat ini. Dan pendapat lain mengatakan makna ayat ini adalah bertakwalah kepada Allah sebenar-benarnya takwa sesuai dengan kemampuan kalian. وَلَا تَمُوتُنَّ إِلَّا وَأَنتُم مُّسْلِمُونَ(dan janganlah sekali-kali kamu mati melainkan dalam keadaan beragama Islam) Yakni janganlah kalian dalam suatu keadaan kecuali dalam keadaan Islam sehingga apabila datang kematian yang datang secara tiba-tiba maka kalian dalam keadaan Islam."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "102 Hai orang-orang yang beriman, bertakwalah kepada Allah sebenar-benar takwa kepada-Nya dengan tidak melakukan kemaksiatan. Bersyukurlah kepada-Nya dan tidak mengingkari anugerah nikmat-Nya. Ingat-ingatlah dan jangan kalian lupakan. Jagalah benar-benar sebelum ajal secara tiba-tiba mendatangi kalian. Para ahli tafsir menyebutkan bahwa ketika ayat ini turun, mereka berkata: Wahai Rasulullah, siapa yang kuasa atas ini?” Lantas mereka tidak kuasa, hingga Allah menurunkan ayat ini: Bertakwalah kalian sekuat tenaga kalian. (At-taghabun:16)"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, bertakwalah kepada Allah dengan sebenar-benar takwa kepadaNya} Takutlah kepada Allah dengan takut yang sebenarnya dengan mengikuti perintahNya, menjauhi laranganNya, dan mensyukuri nikmatNya {dan janganlah kalian mati kecuali dalam keadaan muslim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "102-105. Ayat-ayat ini mengandung anjuran Allah kepada hamba-hambaNya, kaum Mukminin agar mendirikan syukur atas nikmat-nikmatNya yang besar yaitu dengan bertakwa kepadaNya dengan sebenar-benar takwa, dan agar mereka menaatiNya dan meninggalkan kemaksiatan terhadapNya secara tulus ikhlas untukNya, dan agar mereka menegakkan agama mereka dan berpegang teguh kepada tali itu (yaitu agama dan kitabNya) sebagai sebab antara mereka denganNya, serta bersatu dengan berpedoman pada agama dan kitabNya dan tidak saling bercerai berai, dan agar mereka selalu konsisten atas hal itu hingga mereka meninggal. Lalu Allah menyebutkan kondisi mereka yang dahulu sebelum adanya nikmat tersebut, yaitu bahwasanya mereka dahulu saling bermusuhan dan bercerai berai. Kemudian Allah menyatukan mereka dengan agama ini dan merekatkan hati-hati mereka, serta menjadikan mereka sebagai saudara. Padahal mereka dahulu berada di pinggir jurang api neraka, lalu Allah menyelamatkan mereka dari kesengsaraan, dan memberikan jalan kebahagiaan bagi mereka. “Demikianlah Allah menerangkan ayat-ayatNya kepadamu, agar kamu mendapat petunjuk” untuk bersyukur kepada Allah dan berpegang teguh kepada tali agamaNya. Dan Allah memerintahkan mereka untuk menyempurnakan kondisi seperti ini, dan sebab terkuat yang membantu mereka menegakkan agama mereka adalah keberadaan sekelompok dari mereka yang bergerak dengan jumlah yang cukup, “yang menyeru kepada kebajikan,” yaitu berupa pokok-pokok agama, cabang-cabang, dan syariat-syariatnya, “menyuruh kepada yang ma’ruf,” yaitu sesuatu yang diketahui nilai buruknya secara syariat maupun akal, “dan mencegah dari yang mungkar,” yaitu sesuatu yang diketahui nilai buruknya secara syariat maupun akal, “dan merekalah orang-orang yang beruntung,” orang-orang yang mendapatkan segala yang diinginkan dan selamat dari segala yang dikhawatirkan. Termasuk dalam kelompok tersebut adalah para ulama dan para pendidik, orang-orang yang bergerak dengan berkhutbah, berceramah, dan memberikan nasihat kepada manusia secara umum ataupun khusus serta orang-orang yang mengingatkan orang lain, yang bertugas mengontrol manusia dalam pelaksanaan shalat lima waktu, penunaian zakat dan penegakan syariat-syariat agama, serta melarang mereka dari segala kemungkaran. Oleh karena itu, setiap orang yang menyeru manusia kepada kebaikan secara umum atau secara khusus, atau dia memberikan nasihat kepada masyarakat umum atau kelompok khusus, maka dia termasuk dalam ayat yang mulia tersebut. Kemudian Allah melarang mereka dari menempuh jalan orang-orang yang bercerai berai yang mana agama dan keterangan-keterangan yang jelas telah mendatangi mereka yang mengharuskan mereka untuk melaksnakannya dan bersatu karenanya, namun mereka bercerai berai dan berselisih, hingga mereka menjadi kelompok-kelompok, dan itu tidaklah muncul akibat dari kebodohan maupun kesesatan, akan tetapi muncul dari pengetahuan dan tujuan yang buruk, serta kesewenang-wenangan sebagian mereka atas sebagian yang lain. Karena itulah Allah berfirman, “Dan mereka itulah orang-orang yang mendapat siksa yang berat.” Kemudian Allah menjelaskan tentang kapan terjadinya siksaan yang berat tersebut dan (kapan) mereka merasakan siksaan yang pedih tersebut seraya berfirman,"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 102: Hai orang-orang yang beriman? Berbaktilah kepada Allah dengan ebenar-benar kebaktian, dan janganlah kamu mati melainkan dalam keadaan kamu (sebagai) Muslimin."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dalam tafsir Al Jalaalain disebutkan, bahwa ketika turun ayat ini, ada yang merasa keberatan, maka dimansukhlah dengan ayat \"fattaqullah mas tatha'tum\" (Maka bertakwalah kepada Allah semampu kamu) surat At Taghabun: 16, wallahu a'lam. Di dalam hadits, Rasulullah shallallahu 'alaihi wa sallam bersabda: مَا نَهَيْتُكُمْ عَنْهُ فَاجْتَنِبُوْهُ، وَمَا أَمَرْتُكُمْ بِهِ فَأْتُوا مِنْهُ مَا اسْتَطَعْتُمْ، فَإِنَّمَا أَهْلَكَ الَّذِيْنَ مَنْ قَبْلَكُمْ كَثْرَةُ مَسَائِلِهِمْ وَاخْتِلاَفُهُمْ عَلَى أَنْبِيَائِهِمْ \"Apa yang aku larang, hendaklah kalian menjauhinya dan apa yang aku perintahkan maka hendaklah kalian melaksanakannya semampu kalian. Sesungguhnya binasanya orang-orang sebelum kalian adalah karena mereka banyak bertanya dan karena penentangan mereka terhadap nabi-nabi mereka.\" (HR. Bukhari dan Muslim) Syaikh As Sa'diy berkata tentang tafsir ayat ini, \"Ini merupakan perintah Allah kepada hamba-hamba-Nya yang mukmin agar mereka bertakwa kepada-Nya dengan sebenar-benarnya, tetap berada di atasnya dan istiqamah hingga akhir hayat. Hal itu, karena orang yang terbiasa hidup di atas sesuatu, niscaya ia akan meninggal di atasnya. Barang siapa di saat sehat, semangat dan berkemampuan tetap menjaga ketakwaan kepada Tuhannya dan mentaati-Nya serta senantiasa kembali kepada-Nya, maka Allah akan meneguhkannya ketika wafat serta mengaruniakan husnul khatimah. Bertakwa kepada Allah dengan sebenar-benar takwa sebagaimana dikatakan Ibnu Mas'ud adalah, \"Dengan ditaati tidak dimaksiati, disyukuri tidak dikufuri dan diingat tidak dilupakan.\" Ayat ini merupakan penjelasan terhadap hak Allah Ta'ala dalam takwa, adapun yang diwajibkan bagi hamba dari ketakwaan itu adalah sebagaimana yang difirmankan Allah Ta'ala, \"fattaqullah mas tatha'tum\" (Maka bertakwalah kepada Allah semampu kamu). Rincian ketakwaan yang terkait dengan hati dan anggota badan sangat banyak sekali, namun terhimpun dalam \"mengerjakan semua yang diperintahkan Allah dan meninggalkan semua yang dilarang-Nya\". Kemudian Allah Ta'ala memerintahkan mereka melakukan hal yang membantu ketakwaan, yaitu bersatu dan berpegang teguh dengan agama Allah, di samping itu perkataan kaum mukmin adalah sama sambil bersatu tidak berpecah belah. Bersatunya kaum muslimin di atas agama mereka serta bersamanya hati dapat memperbaiki agama dan dunia mereka. Dengan bersatu, mereka bisa melakukan perkara apa pun, demikian juga mereka akan memperoleh maslahat yang banyak yang hanya bisa dilakukan secara bersama, seperti tolong-menolong di atas kebaikan dan takwa, sebagaimana dalam berpecah dan bermusuhan menjadikan kesatuannya retak, ikatannya terputus, dan masing-masing hanya bekerja dan berusaha untuk kepentingan pribadinya meskipun mengakibatkan bahaya yang merata.\""
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 102",
    "description": "Supaya kamu memperoleh keimanan yang kuat dan tidak goyah ketika terjadi cobaan, maka wahai orang-orang yang beriman! bertakwalah kepada Allah sebenar-benar takwa kepada-Nya sesuai kebesaran, keagungan, dan kasih sayang-Nya kepada kamu. Bukti ketakwaan tersebut adalah menaati Allah dan tidak sekalipun durhaka, mengingat-Nya dan tidak sesaat pun melupakan-Nya, serta mensyukuri nikmat-Nya tanpa sekalipun dan sekecil apa pun mengingkarinya sampai batas akhir kemampuan kamu, dan janganlah kamu mati kecuali dalam keadaan muslim, berserah diri kepada Allah dengan tetap memeluk agama yang diridai, yaitu islam. Karena tidak seorang pun mengetahui kapan datangnya kematian, maka berusahalah sekuat tenaga untuk selalu berada di jalan Allah, karena Allah akan menganugerahi hamba sesuai usaha yang dilakukannyapada ayat ini Allah memerintah kaum mukmin menjaga persatuan dan kesatuan. Dan berpegangteguhlah serta berusahalah sekuat tenaga agar kamu semuanya bantu-membantu untuk menyatu pada tali (agama) Allah agar kamu tidak tergelincir dari agama tersebut. Dan janganlah kamu bercerai berai, saling bermusuhan dan mendengki, karena semua itu akan menjadikan kamu lemah dan mudah dihancurkan."
  }
]