[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan berpegang teguhlah kalian semua kepada kitab suci Tuhan kalian dan petunjuk Nabi kalian, dan jangan melakukan hal-hal yang mendorong kalian kepada perpecahan. Dan ingatlah nikmat besar yang telah Allah limpahkan pada kalian, tatkala kalian di masa dahulu (wahai kaum mukminin), sebelum islam, saling bermusuhan. Kemudian Allah menyatukan hati kalian di atas cinta kepadaNya dan cinta kepada RasulNya, dan meletakkan pada hati kalian rasa saling mencintai sebagian kalian kepada sebagian yang lain, sehingga kalian dengan karunia Allah menjadi orang-orang bersaudara yang saling mencintai. Padahal dahulu kalian sudah berada di tepi jurang Neraka Jahanam, lalu Allah memberi kalian hidayah kepada islam dan menyelamatkan kalian dari neraka. Dan sebagaimana Allah telah menjelaskan kepada kalian simbol-simbol iman yang benar, maka begitu juga Dia telah menjelaskan kepada kalian segala yang mendatangkan kemaslahatan bagi kalian, agar kalian mendapat hidayah menuju jalan yang lurus dan menapakinya, sehingga kalian pun tidak tersesat darinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "103. Dan berpeganglah kalian -wahai orang-orang mukmin- pada Al-Kitab (Al-Qur`ān) dan Sunah. Janganlah kalian melakukan sesuatu yang dapat menjerumuskan kalian ke dalam perpecahan. Ingatlah karunia yang Allah berikan ketika kalian dahulu saling bermusuhan sebelum Islam hingga berperang karena sebab yang sangat sepele. Kemudian Allah menyatukan hati kalian dengan Islam, sehingga berkat anugerah-Nya kalian bisa menjadi saudara seagama, saling mengasihi dan saling menasihati. Padahal sebelum itu kalian hampir saja masuk ke dalam neraka disebabkan kekafiran kalian. Kemudian Allah menyelamatkan kalian melalui agama Islam dan membimbing kalian menuju iman. Dan sebagaimana Allah menjelaskan hal ini kepada kalian, maka Dia juga menjelaskan apa yang dapat memperbaiki keadaan kalian di dunia dan di akhirat, agar kalian menemukan jalan yang benar dan mengikuti jalan yang lurus."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "103. dan berpeganglah kalian semua pada al-Qur’an, jauhilah perpecahan dan perselisihan, dan bersyukurlah kepada Allah atas kenikmatan yang telah Dia berikan berupa persatuan dan kasih saying di antara kalian, setelah kalian saling berselisih pada masa jahiliyah; kemudian dengan karunia Allah kalian menjadi saling bersaudara dan menyayangi. Dan sebelumnya kalian hampir jatuh ke jurang neraka Jahannam kemudian Islam menyelamatkan kalian. Dengan penjelasan yang jelas ini Allah terangkan kepada kalian ayat-ayat yang menuntun kepada kebaikan, agar kalian mendapat petunjuk ke jalan yang benar. Nafi’ berkata: Abdullah bin Umar datang kepada Abdullah bin Muthi’ ketika terjadi peristiwa al-Harrah pada zaman Yazid bin Muawiyah. Abdullah bin Muthi’ berkata: \"Berilah Abu Abdurrahman (Abdullah bin Umar) bantal.\" Maka Abu Abdurrahman berkata: \"Aku datang kepadamu tidak untuk duduk, aku datang kepadamu untuk menceritakan kepadamu suatu hadits yang pernah kudengar dari Rasulullah shallallahu ‘alaihi wasallam. Aku mendengar Rasulullah shallallahu ‘alaihi wasallam bersabda: مَنْ خَلَعَ يَدًا مِنْ طَاعَةٍ لَقِيَ اللَّهَ يَوْمَ الْقِيَامَةِ لَا حُجَّةَ لَهُ وَمَنْ مَاتَ وَلَيْسَ فِي عُنُقِهِ بَيْعَةٌ مَاتَ مِيتَةً جَاهِلِيَّةً \"Barangsiapa melepas tangannya dari ketaatan, maka ia akan menemui Allah di hari Kiamat dalam keadaan tidak memiliki hujjah, dan barang siapa mati sedang dipundaknya tidak ada bai’at, maka ia mati seperti mati jahiliyyah.\" (hadits dikeluarkan oleh Muslim dalam as-Shahih 3/1478 no. 1851, kitab imarah, bab kewajiban berpegang pada kesatuan kaum muslimin saat terjadi perpecahan)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "103. وَاعْتَصِمُوا۟ بِحَبْلِ اللهِ جَمِيعًا (103 Dan berpeganglah kamu semuanya kepada tali (agama) Allah) Allah memerintahkan mereka (orang-orang Islam) agar senantiasa berkumpul dalam berpegang teguh dengan agama Islam dan al-Qur’an, dan melarang mereka dari berpecah belah yang timbul dari perbedaan dalam agama. إِذْ كُنتُمْ أَعْدَآءً(dan ingatlah akan nikmat Allah kepadamu ketika kamu dahulu (masa Jahiliyah) bermusuh-musuhan) Yakni saling membunuh satu sama lain, dan merampas harta satu sama lain, yang kemudian karena nikmat ini kalian menjadi saudara. عَلَىٰ شَفَا حُفْرَةٍ مِّنَ النَّارِ (dan kamu telah berada di tepi jurang neraka) Yakni karena kekufuran mereka dahulu, kemudian Allah menyelamatkan mereka dari jurang ini dengan Islam. Dikatakan: kalian dulu berada di tepi jungan neraka barangsiapa dari kalian yang meninggal dalam keadaan itu maka akan masuk ke neraka, kemudian Allah mengutus Nabi Muhammad untuk menolong kalian dari jurang tersebut.` Dalam hadist disebutkan: “Kitabullah adalah tali Allah yang menjulur dari langit menuju ke bumi”."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "103-104 Allah ta'ala berfirman : { وَكُنْتُمْ عَلَىٰ شَفَا حُفْرَةٍ مِنَ النَّارِ فَأَنْقَذَكُمْ مِنْهَا } \"dan kamu telah berada di tepi jurang neraka, lalu Allah menyelamatkan kamu dari padanya\" , kemudian pada ayat selanjutnya Allah mengatakan : { وَلْتَكُنْ مِنْكُمْ أُمَّةٌ يَدْعُونَ إِلَى الْخَيْرِ } \"Dan hendaklah ada di antara kamu segolongan umat yang menyeru kepada kebajikan\" yakni : sebagaimana yang kamu ketahui bahwa kenikmatan dan kesempurnaan akan datang setelah hilangnya kesengsaraan, maka hal yang lebih baik setelah itu adalah berusaha dengan segala keteguhan hati untuk kamu menyelamatkan orang lain dari keburukan yang mereka alami menuju kebaikan yang kamu jalani saat ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "103 Berpegang teguhlah kamu semuanya kepada Alquran dan tali agama Allah yaitu Islam, dan janganlah kamu bercerai berai seperti saat zaman Jahiliyyah, seperti memusuhi sesama kalian. Jangan bercerai-berai dalam hal agama. Ingatlah wahai suku Aus dan Khazraj atas anugerah nikmat Allah kepada kalian berupa kerja sama dan persatuan dalam kalimat Islam, padahal kalian sebelumnya pada masa Jahiliyyah adalah saling bermusuhan. Kalian saling merampok dan membunuh satu sama lain, hingga sekarang kalian menjadi saudara yang saling mencintai karena Allah. Bersama-sama taat dan beribadah kepada Allah. Padahal kalian telah berada di tepi jurang neraka Jahannam, kalian akan berada di dalamnya jika kalian mati dalam keadaan kafir, lalu Allah menyelamatkan kamu dari jurang neraka Jahannam dengan anugerah keimanan atau Islam dan diutusnya nabi Muhammad. Juga berbagai penjelasan dan bukti serta tanda dari Allah yang menunjukkan kebaikan dan persatuan, dan peringatan dari tipu daya orang-orang Yahudi. Itu semua agar kalian mendapat petunjuk menuju jalan kebenaran untuk selamanya. Sehingga tidak kembali lagi kepada kesesatan Jahiliyyah berupa perpecahan dan permusuhan, serta penyembahan berhala"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Berpegang teguhlah kalian semuanya pada tali Allah} berpegang teguhlah kepada agama Allah {janganlah bercerai berai, dan ingatlah nikmat Allah kepada kalian ketika kalian dahulu bermusuhan, lalu Allah mempersatukan} menyatukan {hati kalian sehingga dengan karuniaNya kalian menjadi bersaudara} lalu dengan rahmatNya kalian menjadi saudara dalam agama {kalian berada di tepi} tepi { jurang neraka lalu Allah menyelamatkan kalian dari sana. Demikianlah Allah menerangkan ayat-ayatNya kepada kalian agar kamu mendapat petunjuk"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "102-105. Ayat-ayat ini mengandung anjuran Allah kepada hamba-hambaNya, kaum Mukminin agar mendirikan syukur atas nikmat-nikmatNya yang besar yaitu dengan bertakwa kepadaNya dengan sebenar-benar takwa, dan agar mereka menaatiNya dan meninggalkan kemaksiatan terhadapNya secara tulus ikhlas untukNya, dan agar mereka menegakkan agama mereka dan berpegang teguh kepada tali itu (yaitu agama dan kitabNya) sebagai sebab antara mereka denganNya, serta bersatu dengan berpedoman pada agama dan kitabNya dan tidak saling bercerai berai, dan agar mereka selalu konsisten atas hal itu hingga mereka meninggal. Lalu Allah menyebutkan kondisi mereka yang dahulu sebelum adanya nikmat tersebut, yaitu bahwasanya mereka dahulu saling bermusuhan dan bercerai berai. Kemudian Allah menyatukan mereka dengan agama ini dan merekatkan hati-hati mereka, serta menjadikan mereka sebagai saudara. Padahal mereka dahulu berada di pinggir jurang api neraka, lalu Allah menyelamatkan mereka dari kesengsaraan, dan memberikan jalan kebahagiaan bagi mereka. “Demikianlah Allah menerangkan ayat-ayatNya kepadamu, agar kamu mendapat petunjuk” untuk bersyukur kepada Allah dan berpegang teguh kepada tali agamaNya. Dan Allah memerintahkan mereka untuk menyempurnakan kondisi seperti ini, dan sebab terkuat yang membantu mereka menegakkan agama mereka adalah keberadaan sekelompok dari mereka yang bergerak dengan jumlah yang cukup, “yang menyeru kepada kebajikan,” yaitu berupa pokok-pokok agama, cabang-cabang, dan syariat-syariatnya, “menyuruh kepada yang ma’ruf,” yaitu sesuatu yang diketahui nilai buruknya secara syariat maupun akal, “dan mencegah dari yang mungkar,” yaitu sesuatu yang diketahui nilai buruknya secara syariat maupun akal, “dan merekalah orang-orang yang beruntung,” orang-orang yang mendapatkan segala yang diinginkan dan selamat dari segala yang dikhawatirkan. Termasuk dalam kelompok tersebut adalah para ulama dan para pendidik, orang-orang yang bergerak dengan berkhutbah, berceramah, dan memberikan nasihat kepada manusia secara umum ataupun khusus serta orang-orang yang mengingatkan orang lain, yang bertugas mengontrol manusia dalam pelaksanaan shalat lima waktu, penunaian zakat dan penegakan syariat-syariat agama, serta melarang mereka dari segala kemungkaran. Oleh karena itu, setiap orang yang menyeru manusia kepada kebaikan secara umum atau secara khusus, atau dia memberikan nasihat kepada masyarakat umum atau kelompok khusus, maka dia termasuk dalam ayat yang mulia tersebut. Kemudian Allah melarang mereka dari menempuh jalan orang-orang yang bercerai berai yang mana agama dan keterangan-keterangan yang jelas telah mendatangi mereka yang mengharuskan mereka untuk melaksnakannya dan bersatu karenanya, namun mereka bercerai berai dan berselisih, hingga mereka menjadi kelompok-kelompok, dan itu tidaklah muncul akibat dari kebodohan maupun kesesatan, akan tetapi muncul dari pengetahuan dan tujuan yang buruk, serta kesewenang-wenangan sebagian mereka atas sebagian yang lain. Karena itulah Allah berfirman, “Dan mereka itulah orang-orang yang mendapat siksa yang berat.” Kemudian Allah menjelaskan tentang kapan terjadinya siksaan yang berat tersebut dan (kapan) mereka merasakan siksaan yang pedih tersebut seraya berfirman,"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 103: Dan berpeganglah kamu sekalian dengan tali Allah, dan jangan kamu berpisah-pisah, dan ingatlah nikmat Allah atas kamu, tatkala kamu bermusuh-musuhan, lalu la jinakkan antara hati-hati kamu, lantas dengan nikmat Allah, kamu jadi bersaudaraan, padahal, dahuluya, kamu di pinggir lobang dari neraka, tetapi la selamatkan kamu daripadanya; begitulah Allah terangkan kepada kamu tanda-tanda-Nya supaya kamu dapat petunjuk."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah menjadi muslim. Di mana ketika itu tidak ada penghalang antara kalian dengan neraka selain kematian. Dengan beriman kepada Nabi Muhammad shallallahu 'alaihi wa sallam. Yakni dapat mengetahui yang hak serta dapat mengamalkannya. Ayat ini menunjukkan, bahwa Allah menyukai hamba-hamba-Nya yang mengingat nikmat-Nya baik dengan hati maupun lisan agar bertambah syukur dan cinta mereka kepada-Nya dan agar Dia mengaruniakan kepada mereka karunia dan ihsan-Nya. Demikian juga menunjukkan bahwa nikmat besar yang layak sekali diingat adalah nikmat beragama Islam, mengikuti Rasulullah shallallahu 'alaihi wa sallam serta bersatunya kaum muslimin dan tidak berpecah belah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 103",
    "description": "Pada ayat ini Allah memerintah kaum mukmin menjaga persatuan dan kesatuan. Dan berpegangteguhlah serta berusahalah sekuat tenaga agar kamu semuanya bantu-membantu untuk menyatu pada tali (agama) Allah agar kamu tidak tergelincir dari agama tersebut. Dan janganlah kamu bercerai berai, saling bermusuhan dan mendengki, karena semua itu akan menjadikan kamu lemah dan mudah dihancurkan. Pada ayat ini Allah memerintahkan orang mukmin agar mengajak manusia kepada kebaikan, menyuruh perbuatan makruf, dan mencegah perbuatan mungkar. Dan hendaklah di antara kamu, orang mukmin, ada segolongan orang yang secara terus-menerus menyeru kepada kebajikan yaitu petunjuk-petunjuk Allah, menyuruh (berbuat) yang makruf yaitu akhlak, perilaku dan nilai-nilai luhur dan adat istiadat yang berkembang di masyarakat yang tidak bertentangan dengan nilai-nilai agama, dan mencegah dari yang mungkar, yaitu sesuatu yang dipandang buruk dan diingkari oleh akal sehat. Sungguh mereka yang menjalankan ketiga hal tersebut mempunyai kedudukan tinggi di hadapan Allah dan mereka itulah orang-orang yang beruntung karena mendapatkan keselamatan di dunia dan akhirat."
  }
]