[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan hendaklah di antara kalian (wahai kaum Mukminin), ada segolongan orang yang mengajak kepada kebaikan dan memerintahkan kepada yang ma’ruf, yaitu sesuatu yang telah diketahui kebaikannya menurut syariat dan akal, dan melarang dari kemungkaran, yaitu apa-apa yang diketahui keburukannya dari segi syariat maupun akal. Mereka itu adalah orang-orang yang beruntung menggapai surga yang penuh kenikmatan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "104. Dan hendaklah ada di antara kalian -wahai orang-orang mukmin- satu kelompok yang mengajak kepada setiap kebajikan yang dicintai Allah, menyuruh berbuat baik yang ditunjukkan oleh syarak dan dinilai baik oleh akal sehat, dan mencegah perbuatan mungkar yang dilarang oleh syarak dan dinilai buruk oleh akal sehat. Orang-orang semacam itulah yang akan mendapatkan kemenangan yang sempurna di dunia dan akhirat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "104. Allah menekankan kewajiban keberadaan segolongan kaum muslimin yang menyeru kepada Islam, mengajak kepada ketaatan dan melarang kemaksiatan. Orang-orang yang mendapat derajat yang tinggi yang melakukan amalan ini adalah orang-orang yang akan meraih surga."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "104. وَلْتَكُن مِّنكُمْ أُمَّةٌ (Dan hendaklah ada di antara kamu segolongan umat) Yakni hendaklah segolongan diantara kalian yang senantiasa mendirikan kewajiban berdakwah, memerintah kebajikan, dan melarang keburukan. Dan pendapat lain mengatakan yang dimaksud adalah hendaklah kalian semua menjalankan kewajiban dakwah, memerintah kebajikan, dan melarang keburukan. Namun pendapat pertama lebih dekat kepada kebenaran. يَدْعُونَ إِلَى الْخَيْرِ (yang menyeru kepada kebajikan) Yakni dengan mengajarkannya, memberi nasehat dan petunjuk. وَيَأْمُرُونَ بِالْمَعْرُوفِ وَيَنْهَوْنَ عَنِ الْمُنكَرِ ۚ (menyuruh kepada yang ma’ruf dan mencegah dari yang munkar) Yakni dengan tangan atau lisan. Dan menyuruh kepada kebaikan dan melarang kepada yang mungkar adalah bagian dari fardhu kifayah, yang dikhususkan bagi pemilik ilmu yang mengetahui perihal apa yang diajarkannya dan apa yang dilarangnya. Dan kewajiban menyuruh kepada kebaikan dan melarang kepada yang mungkar ini berdasarkan apa yang termaktub dalam al-qur’an dan as-sunnah, dan ia merupakan salah satu kewajiban yang paling mulia yang ada dalam syariat yang suci ini dan juga merupakan asas penting dari asas-asas syariat, karena dengannya sempurnalah aturan-aturannya, karena pemeluk setiap agama telah melenceng sebagian mereka dari agamanya disebabkan kebodohan mereka tentang agama atau karena mengikuti hawa nafsu mereka. Atau mungkin karena lalai dalam menjalankan kewajiban mereka, atau mungkin saling menzalimi diantara mereka, maka apabila tidak ada orang yang membenarkan jalan mereka, menunjukkan petunjuk kepada yang tersesat, menasehati yang lalai, dan menghentikan tangan zalim, maka kesesatan akan semakin banyak dan semakin besar hingga agama akan dilupakan dan akan berubah Batasan-batasannya. Dan Allah telah mempringati kita agar tidak seperti apa yang terjadi pada Bani Israil. Yang Allah telah melaknat mereka karena meninggalkan amar ma’ruf nahi mungkar lewat firman-Nya: ذٰلِكَ بِمَا عَصَوا۟ وَّكَانُوا۟ يَعْتَدُونَ. كَانُوا۟ لَا يَتَنَاهَوْنَ عَن مُّنكَرٍ فَعَلُوهُ ۚ لَبِئْسَ مَا كَانُوا۟ يَفْعَلُونَ Yang demikian itu, disebabkan mereka durhaka dan selalu melampaui batas. Mereka satu sama lain selalu tidak melarang tindakan munkar yang mereka perbuat. Sesungguhnya amat buruklah apa yang selalu mereka perbuat itu. (al-Maidah: 78-79) وَأُو۟لٰٓئِكَ(Mereka itulah) Yakni golongan yang menjalankan apa yang disebutkan. هُمُ الْمُفْلِحُونَ(orang-orang yang beruntung) Yakni orang-orang yang mendapat kekhususan dengan keberuntungan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "103-104 Allah ta'ala berfirman : { وَكُنْتُمْ عَلَىٰ شَفَا حُفْرَةٍ مِنَ النَّارِ فَأَنْقَذَكُمْ مِنْهَا } \"dan kamu telah berada di tepi jurang neraka, lalu Allah menyelamatkan kamu dari padanya\" , kemudian pada ayat selanjutnya Allah mengatakan : { وَلْتَكُنْ مِنْكُمْ أُمَّةٌ يَدْعُونَ إِلَى الْخَيْرِ } \"Dan hendaklah ada di antara kamu segolongan umat yang menyeru kepada kebajikan\" yakni : sebagaimana yang kamu ketahui bahwa kenikmatan dan kesempurnaan akan datang setelah hilangnya kesengsaraan, maka hal yang lebih baik setelah itu adalah berusaha dengan segala keteguhan hati untuk kamu menyelamatkan orang lain dari keburukan yang mereka alami menuju kebaikan yang kamu jalani saat ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "104 Dan hendaklah ada di antara kalian wahai orang-orang mukmin, segolongan umat yang menyeru kepada kebajikan dengan mengajarkan kebaikan dan menyuruh kepada kebaikan. Kebaikan adalah segala yang berkaitan dengan kebaikan di dunia dan akhirat. Serta menyeru untuk berbuat ma’ruf: kebaikan yang sesuai dengan syariat dan akal sehat. Serta mencegah perbuatan munkar: yaitu segala yang dianggap tidak baik oleh syariat dan akal sehat. Mereka yang menyeru kepada kebaikan itu samua merekalah orang-orang yang beruntung yang akan mendapatkan ridho Allah dan surga-Nya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Hendaklah ada di antara kalian umat} kumpulan {yang menyeru kepada kebajikan, menyuruh yang makruf, dan mencegah dari yang mungkar. Mereka itulah orang-orang yang beruntung"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "102-105. Ayat-ayat ini mengandung anjuran Allah kepada hamba-hambaNya, kaum Mukminin agar mendirikan syukur atas nikmat-nikmatNya yang besar yaitu dengan bertakwa kepadaNya dengan sebenar-benar takwa, dan agar mereka menaatiNya dan meninggalkan kemaksiatan terhadapNya secara tulus ikhlas untukNya, dan agar mereka menegakkan agama mereka dan berpegang teguh kepada tali itu (yaitu agama dan kitabNya) sebagai sebab antara mereka denganNya, serta bersatu dengan berpedoman pada agama dan kitabNya dan tidak saling bercerai berai, dan agar mereka selalu konsisten atas hal itu hingga mereka meninggal. Lalu Allah menyebutkan kondisi mereka yang dahulu sebelum adanya nikmat tersebut, yaitu bahwasanya mereka dahulu saling bermusuhan dan bercerai berai. Kemudian Allah menyatukan mereka dengan agama ini dan merekatkan hati-hati mereka, serta menjadikan mereka sebagai saudara. Padahal mereka dahulu berada di pinggir jurang api neraka, lalu Allah menyelamatkan mereka dari kesengsaraan, dan memberikan jalan kebahagiaan bagi mereka. “Demikianlah Allah menerangkan ayat-ayatNya kepadamu, agar kamu mendapat petunjuk” untuk bersyukur kepada Allah dan berpegang teguh kepada tali agamaNya. Dan Allah memerintahkan mereka untuk menyempurnakan kondisi seperti ini, dan sebab terkuat yang membantu mereka menegakkan agama mereka adalah keberadaan sekelompok dari mereka yang bergerak dengan jumlah yang cukup, “yang menyeru kepada kebajikan,” yaitu berupa pokok-pokok agama, cabang-cabang, dan syariat-syariatnya, “menyuruh kepada yang ma’ruf,” yaitu sesuatu yang diketahui nilai buruknya secara syariat maupun akal, “dan mencegah dari yang mungkar,” yaitu sesuatu yang diketahui nilai buruknya secara syariat maupun akal, “dan merekalah orang-orang yang beruntung,” orang-orang yang mendapatkan segala yang diinginkan dan selamat dari segala yang dikhawatirkan. Termasuk dalam kelompok tersebut adalah para ulama dan para pendidik, orang-orang yang bergerak dengan berkhutbah, berceramah, dan memberikan nasihat kepada manusia secara umum ataupun khusus serta orang-orang yang mengingatkan orang lain, yang bertugas mengontrol manusia dalam pelaksanaan shalat lima waktu, penunaian zakat dan penegakan syariat-syariat agama, serta melarang mereka dari segala kemungkaran. Oleh karena itu, setiap orang yang menyeru manusia kepada kebaikan secara umum atau secara khusus, atau dia memberikan nasihat kepada masyarakat umum atau kelompok khusus, maka dia termasuk dalam ayat yang mulia tersebut. Kemudian Allah melarang mereka dari menempuh jalan orang-orang yang bercerai berai yang mana agama dan keterangan-keterangan yang jelas telah mendatangi mereka yang mengharuskan mereka untuk melaksnakannya dan bersatu karenanya, namun mereka bercerai berai dan berselisih, hingga mereka menjadi kelompok-kelompok, dan itu tidaklah muncul akibat dari kebodohan maupun kesesatan, akan tetapi muncul dari pengetahuan dan tujuan yang buruk, serta kesewenang-wenangan sebagian mereka atas sebagian yang lain. Karena itulah Allah berfirman, “Dan mereka itulah orang-orang yang mendapat siksa yang berat.” Kemudian Allah menjelaskan tentang kapan terjadinya siksaan yang berat tersebut dan (kapan) mereka merasakan siksaan yang pedih tersebut seraya berfirman,"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 104: Dan hendaklah ada dari antara kamu, satu golongan yang mengajak (manusia) kepada bakti, dan menyuruh (mereka berbuat) kebaikan, dan melarang (mereka) dari kejahatan; dan mereka itu, ialah orang-orang yang dapat kejayaan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Rasulullah shallallahu 'alaihi wa sallam bersabda: وَالَّذِيْ نَفْسِي بِيَدِهِ، لَتَأْمُرُنَّ بِالْمَعْرُوْفِ، وَلَتَنْهَوُنَّ عَنِ الْمُنْكَرِ، أَوْ لَيُوْشِكُنَّ اللهُ يَبْعَثُ عَلَيْكُمْ عِقَابًا مِنْهُ، ثُمَّ تَدْعُوْنَهُ فَلاَ يَسْتَجِيْبُ لَكُمْ \"Demi Allah yang jiwaku berada di Tangan-Nya. Kamu harus melakukan amar ma'ruf dan nahi munkar, atau jika tidak, Allah bisa segera menimpakan azab dari sisi-Nya dan ketika kamu berdo'a tidak dikabulkan-Nya.\" (HR. Ahmad dan Tirmidzi, dihasankan oleh Al Albani dalam Shahihul Jami' no. 7070) Kebajikan (al khair) adalah segala sesuatu yang mendekatkan manusia kepada Allah dan menjauhkannya dari kemurkaan-Nya. Ma'ruf: segala perintah Allah atau yang dianggap baik oleh syara' dan akal, sedangkan munkar adalah segala yang dilarang Allah atau yang dianggap buruk oleh syara' dan akal. Ayat ini merupakan petunjuk dari Allah kepada kaum mukmin, yakni hendaknya di antara mereka ada segolongan orang yang mau berdakwah dan mengajak manusia ke dalam agama-Nya. Termasuk ke dalamnya adalah para ulama yang mengajarkan agama, para penasehat yang mengajak orang-orang non muslim ke dalam Islam, orang yang mengajak orang-orang yang menyimpang agar dapat beristiqamah, orang-orang yang berjihad fi sabilillah, dewan hisbah (lembaga amr ma'ruf dan nahi munkar) yang ditunjuk pemerintah untuk memperhatikan keadaan manusia dan mengajak manusia mengikuti syara' seperti mengajak mereka mendirikan shalat lima waktu, berzakat, berpuasa, berhaji bagi yang mampu dan mengajak kepada syari'at Islam lainnya, demikian juga memperhatikan pasar, bagaimana timbangan dan takaran yang mereka gunakan apakah terjadi pengurangan atau tidak, serta melarang mereka melakukan kecurangan dalam bermu'amalah. Semua ini hukumnya fardhu kifayah. Bahkan tidak hanya itu, segala sarana yang menjadikan sempurna amr ma'ruf dan nahi munkar, sama diperintahkan, misalnya menyediakan perlengkapan jihad untuk dapat mengalahkan musuh, mempelajari ilmu agar dapat mengajak manusia kepada kebajikan, menuliskan buku-buku yang berisikan ajaran Islam, membangun madrasah untuk mengajarkan agama, membantu pihak berwenang (dewan hisbah) mewujudkan syari'at, dsb. Mereka inilah orang-orang yang beruntung, yakni memperoleh apa yang mereka inginkan dan selamat dari hal yang mereka khawatirkan. Pada ayat selanjutnya, Allah Subhaanahu wa Ta'aala melarang mereka bertasyabbuh (menyerupai) Ahli Kitab yang berpecah belah dalam beragama, terlebih perpecahan mereka terjadi setelah datang keterangan yang jelas."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 104",
    "description": "Pada ayat ini Allah memerintahkan orang mukmin agar mengajak manusia kepada kebaikan, menyuruh perbuatan makruf, dan mencegah perbuatan mungkar. Dan hendaklah di antara kamu, orang mukmin, ada segolongan orang yang secara terus-menerus menyeru kepada kebajikan yaitu petunjuk-petunjuk Allah, menyuruh (berbuat) yang makruf yaitu akhlak, perilaku dan nilai-nilai luhur dan adat istiadat yang berkembang di masyarakat yang tidak bertentangan dengan nilai-nilai agama, dan mencegah dari yang mungkar, yaitu sesuatu yang dipandang buruk dan diingkari oleh akal sehat. Sungguh mereka yang menjalankan ketiga hal tersebut mempunyai kedudukan tinggi di hadapan Allah dan mereka itulah orang-orang yang beruntung karena mendapatkan keselamatan di dunia dan akhirat. Dan janganlah kamu, wahai orang mukmin, menjadi seperti orangorang yang berkelompok-kelompok, seperti orang yahudi dan nasrani yang bercerai berai dan berselisih dalam urusan agama dan kemaslahatan umat, karena masing-masing mengutamakan kepentingan kelompoknya. Betapa buruk apa yang terjadi pada mereka, karena berselisih secara sadar dan sengaja setelah sampai kepada mereka keterangan yang jelas, yaitu diutusnya para rasul dan diturunkannya kitab-kitab. Mereka yang berkelompok dan berselisih itulah orang-orang yang celaka dan mereka itulah orang-orang yang mendapat azab yang berat kelak di hari kiamat."
  }
]