[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan janganlah kalian wahai kaum Mukminin, bersikap seperti ahli kitab yang saling bermusuhan dan membenci di antara mereka sendiri, lalu mereka pun berpecah belah menjadi berbagai kelompok dan golongan, sehingga mereka berselisih dalam perkara pokok-pokok ajaran agama mereka sesudah jelasnya kebenaran bagi mereka. Mereka itu orang-orang yang berhak mendapat siksaan yang besar lagi pedih."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "105. Dan janganlah kalian -wahai orang-orang mukmin- seperti orang-orang Ahli Kitab yang berpecah-belah hingga menjadi beberapa kelompok dan beberapa golongan. Mereka berselisih paham tentang agama mereka setelah ayat-ayat yang sangat jelas datang kepada mereka dari sisi Allah -Ta'ālā-. Orang-orang tersebut akan mendapatkan azab yang besar dari Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "105. Allah melarang orang-orang beriman dari perpecahan dan permusuhan, sebagaimana orang-orang Yahudi dan Nasrani terpecah belah setelah datang kepada mereka ayat-ayat yang jelas, mereka adalah orang-orang yang jauh dari rahmat Allah dan akan mendapat azab yang berat dan pedih."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "105. وَلَا تَكُونُوا۟ كَالَّذِينَ تَفَرَّقُوا۟ (Dan janganlah kamu menyerupai orang-orang yang bercerai-berai) Mereka adalah orang-orang Yahudi dan Nasrani yang telah dilarang Allah agar tidak bercerai berai dan dilarang agar tidak berselisih dalam apa yang datang pada mereka berupa kererangan-keterangan. الْبَيِّنٰتُ ۚ (keterangan) Yakni ayat-ayat yang jelas dan nyata akan kebenarannya, yang mewajibkan agar tidak berselisih. Dan pendapat lain mengatakan bahwa yang berpecah-belah adalah orang-orang ahli bid’ah dari umat ini dan firqah-firqah yang menyelisihi apa yang menjadi azas-azas agama."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Larangan bercerai-berai setelah penjelasan tentang amar ma'ruf dan nahyu 'anilmungkar, adalah isyarat bahwa salah satu penyebab tercerai berainya umat islam adalah meninggalkan perintah tersebut. 2 ). Kehadiran ayat ini setelah firman Allah : { لْتَكُنْ مِنْكُمْ أُمَّةٌ يَدْعُونَ إِلَى الْخَيْرِ وَيَأْمُرُونَ بِالْمَعْرُوفِ وَيَنْهَوْنَ عَنِ الْمُنْكَرِ } adalah isyarat bahwa diantara dakwah kepada kebaikan yang paling agung adalah : memberikan kelapangan dan kesejukan dalam hati orang lain, dan sebaik-baiknya ajakan kepada kebaikan ialah : mengajak kepada keteguhan diatas tali Allah, dan sebaik-baiknya larangan dari kemungkaran adalah : melarang dari perselisihan, maka apakah orang-orang berilmu tidak memperhitungan dan mengikuti generasi terbaik dari orang-orang saling berbeda pendapat itu, agar dapat mewujudkan tujuan yang mulia : berpegang teguh diatas tali Allah dan mencampakkan perselisihan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "105 Janganlah kalian wahai orang-orang muslim menyerupai orang-orang yang bercerai-berai dari kebenaran, seperti terpecahnya Yahudi dan Nasrani. Dan janganlah kalian berselisih sebagaimana mereka berselisih dalam hal agama mereka, sesudah datang keterangan yang menjelaskan kebenaran kepada mereka. Dan juga perintah untuk bersatu dan menghindari perpecahan. Mereka yang bercerai-berai dan saling berselisih itulah orang-orang yang mendapat siksa yang pedih dan berat pada hari kiamat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Janganlah kalian menjadi seperti orang-orang yang bercerai-berai dan berselisih setelah sampai kepada mereka keterangan yang jelas} ayat yang jelas {Mereka itulah orang-orang yang mendapat azab yang sangat berat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "102-105. Ayat-ayat ini mengandung anjuran Allah kepada hamba-hambaNya, kaum Mukminin agar mendirikan syukur atas nikmat-nikmatNya yang besar yaitu dengan bertakwa kepadaNya dengan sebenar-benar takwa, dan agar mereka menaatiNya dan meninggalkan kemaksiatan terhadapNya secara tulus ikhlas untukNya, dan agar mereka menegakkan agama mereka dan berpegang teguh kepada tali itu (yaitu agama dan kitabNya) sebagai sebab antara mereka denganNya, serta bersatu dengan berpedoman pada agama dan kitabNya dan tidak saling bercerai berai, dan agar mereka selalu konsisten atas hal itu hingga mereka meninggal. Lalu Allah menyebutkan kondisi mereka yang dahulu sebelum adanya nikmat tersebut, yaitu bahwasanya mereka dahulu saling bermusuhan dan bercerai berai. Kemudian Allah menyatukan mereka dengan agama ini dan merekatkan hati-hati mereka, serta menjadikan mereka sebagai saudara. Padahal mereka dahulu berada di pinggir jurang api neraka, lalu Allah menyelamatkan mereka dari kesengsaraan, dan memberikan jalan kebahagiaan bagi mereka. “Demikianlah Allah menerangkan ayat-ayatNya kepadamu, agar kamu mendapat petunjuk” untuk bersyukur kepada Allah dan berpegang teguh kepada tali agamaNya. Dan Allah memerintahkan mereka untuk menyempurnakan kondisi seperti ini, dan sebab terkuat yang membantu mereka menegakkan agama mereka adalah keberadaan sekelompok dari mereka yang bergerak dengan jumlah yang cukup, “yang menyeru kepada kebajikan,” yaitu berupa pokok-pokok agama, cabang-cabang, dan syariat-syariatnya, “menyuruh kepada yang ma’ruf,” yaitu sesuatu yang diketahui nilai buruknya secara syariat maupun akal, “dan mencegah dari yang mungkar,” yaitu sesuatu yang diketahui nilai buruknya secara syariat maupun akal, “dan merekalah orang-orang yang beruntung,” orang-orang yang mendapatkan segala yang diinginkan dan selamat dari segala yang dikhawatirkan. Termasuk dalam kelompok tersebut adalah para ulama dan para pendidik, orang-orang yang bergerak dengan berkhutbah, berceramah, dan memberikan nasihat kepada manusia secara umum ataupun khusus serta orang-orang yang mengingatkan orang lain, yang bertugas mengontrol manusia dalam pelaksanaan shalat lima waktu, penunaian zakat dan penegakan syariat-syariat agama, serta melarang mereka dari segala kemungkaran. Oleh karena itu, setiap orang yang menyeru manusia kepada kebaikan secara umum atau secara khusus, atau dia memberikan nasihat kepada masyarakat umum atau kelompok khusus, maka dia termasuk dalam ayat yang mulia tersebut. Kemudian Allah melarang mereka dari menempuh jalan orang-orang yang bercerai berai yang mana agama dan keterangan-keterangan yang jelas telah mendatangi mereka yang mengharuskan mereka untuk melaksnakannya dan bersatu karenanya, namun mereka bercerai berai dan berselisih, hingga mereka menjadi kelompok-kelompok, dan itu tidaklah muncul akibat dari kebodohan maupun kesesatan, akan tetapi muncul dari pengetahuan dan tujuan yang buruk, serta kesewenang-wenangan sebagian mereka atas sebagian yang lain. Karena itulah Allah berfirman, “Dan mereka itulah orang-orang yang mendapat siksa yang berat.” Kemudian Allah menjelaskan tentang kapan terjadinya siksaan yang berat tersebut dan (kapan) mereka merasakan siksaan yang pedih tersebut seraya berfirman,"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 105: Dan janganlah kamu jadi seperti mereka yang telah berpecah-belah dan berselisihan sesudah da-datang kepada mereka keterangan-keterangan; dan mereka itu akan mendapat siksa yang besar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni seterah mengetahui bahwa sikap mereka menyelisihi perintah Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 105",
    "description": "Dan janganlah kamu, wahai orang mukmin, menjadi seperti orangorang yang berkelompok-kelompok, seperti orang yahudi dan nasrani yang bercerai berai dan berselisih dalam urusan agama dan kemaslahatan umat, karena masing-masing mengutamakan kepentingan kelompoknya. Betapa buruk apa yang terjadi pada mereka, karena berselisih secara sadar dan sengaja setelah sampai kepada mereka keterangan yang jelas, yaitu diutusnya para rasul dan diturunkannya kitab-kitab. Mereka yang berkelompok dan berselisih itulah orang-orang yang celaka dan mereka itulah orang-orang yang mendapat azab yang berat kelak di hari kiamatayat ini menggambarkan perbedaan keadaan orang yang beriman dan orang kafir pada hari kiamat. Pada hari itu ada wajah yang putih berseri dan tampak sinar kebahagiaan dan kesenangan mereka karena pahala dari amal kebajikan mereka selama hidup di dunia; itulah wajah orang-orang yang beriman kepada Allah dan rasul-rasul-Nya, dan ada pula wajah yang hitam muram dan tampak rasa kesedihan, penyesalan dan kehinaan; itulah wajah orang-orang kafir dan mendustakan rasulrasul-Nya. Adapun orang-orang yang berwajah hitam muram, kepada mereka dikatakan, mengapa kamu kafir, murtad, setelah beriman, yaitu setelah datang penjelasan yang nyata, baik melalui rasul maupun kitab yang diturunkan Allah dan juga tanda-tanda kebesaran Allah di alam raya' karena itu, rasakanlah azab yang pedih disebabkan dosa kekafiranmu itu."
  }
]