[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Pada Hari Kiamat, putih berseri-seri wajah orang-orang berbahagia, yaitu orang-orang yang beriman kepada Allah dan RasulNya serta melaksanakan perintahNya, dan menghitam wajah orang-orang celaka, yaitu orang-orang yang mendustakan RasullNya dan melanggar perintahNya. Adapun orang-orang yang hitam wajahnya, maka dikatakan kepada mereka sebagai penghinaan, “Apakah kalian telah kafir sesudah beriman, lalu kalian lebih memilih kekufuran ketimbang keimanan? Maka rasakanlah siksaan akibat kekufuran kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "106. Azab yang besar itu akan menimpa mereka kelak di hari kiamat. Yaitu ketika wajah orang-orang beriman tampak putih bersih karena kegembiraan dan kebahagiaan yang mereka rasakan, dan wajah orang-orang kafir menghitam karena kesedihan dan kesempitan. Dan kepada orang-orang yang wajahnya menghitam pada hari yang besar itu akan dikatakan, “Apakah kalian mengingkari perintah untuk mengesakan Allah dan melanggar janji-Nya yang Dia ambil dari kalian agar kalian tidak menyekutukan-Nya dengan sesuatu apapun, setelah kalian membenarkan dan mengakuinya? Maka rasakanlah azab Allah yang telah Dia persiapkan untuk kalian disebabkan kekafiran kalian.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "106-107. Para makhluk akan berbeda-beda nasibnya pada hari kiamat kelak; orang-orang beriman akan cerah wajah mereka karena amal ketaatan yang mereka perbuat, sedangkan orang-orang kafir akan gelap dan hitam wajah mereka akibat kemaksiatan yang mereka lakukan. Orang-orang yang wajahnya menjadi hitam akan diolok: “Apakah kalian mendustakan kebenaran setelah kalian mengetahuinya lewat bukti-bukti yang jelas? Sekarang rasakanlah azab ini akibat pendustaan kalian. Sedangkan orang-orang yang cerah wajahnya akan dimasukkan ke dalam surga selamanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "106. يَوْمَ تَبْيَضُّ وُجُوهٌ وَتَسْوَدُّ وُجُوهٌ ۚ (pada hari yang di waktu itu ada muka yang putih berseri, dan ada pula muka yang hitam muram) Yakni mereka (orang-orang kafir) akan mendapatkan azab yang besar di hari kiamat saat mereka dibangkitkan dari kubur mereka. Adapun wajah orang-orang beriman akan berseri-seri dan wajah orang-orang kafir muram. أَكَفَرْتُم (Kenapa kamu kafir) Yakni akan dikatakan kepada mereka (orang-orang kafir): mengapa kalian kafir. pendapat lain mengatakan mereka adalah ahli kitab. Dan pendapat lain: orang-orang yang murtad. Dan pendapat lain: orang-orang munafik. Dan pendapat lain: orang-orang pelaku bid’ah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "106 Pada hari itu mereka mendapatkan azab yang besar, saat wajah orang-orang mukmin putih berseri karena gembira. Adapun wajah orang-orang kafir hitam karena kesedihan dan kemurungan. Adapun orang-orang yang hitam muram mukanya, mereka dihina dengan perkataan: “Kenapa kamu kafir kepada Rasul sesudah kamu beriman? Juga setelah kalian membenarkan pengutusannya? Juga telah mengetahui tanda dan sifatnya? Karena itu rasakanlah azab disebabkan kekafiranmu ketika di dunia”."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Pada hari ketika ada wajah yang putih berseri dan ada pula wajah yang hitam kusam. Adapun orang-orang yang berwajah hitam kusam, “Mengapa kalian kafir setelah beriman Maka rasakanlah azab yang disebabkan kekafiran kalian.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "106-107. Allah memberitakan tentang perbedaan tingkatan para makhluk pada Hari Kiamat dalam kebahagiaan dan kesengsaraan, dan bahwasanya wajah-wajah penghuni kebahagiaan akan memutih yaitu orang-orang yang beriman kepada Allah, membenarkan rasul-rasulNya, menaati perintahNya, menjauhi laranganNya, dan bahwasanya Allah memasukkan mereka ke dalam surga, dan akan melimpahkan segala kebaikan atas mereka, dan mereka akan kekal selamanya (di dalam surga). Sebaliknya wajah-wajah para penghuni kesengsaraan akan menghitam (muram) yaitu orang-orang yang mendustai para rasulNya, bermaksiat pada perintahNya dan memecah belah agama mereka menjadi beberapa kelompok, dan bahwa mereka akan dijelek-jelekkan sehingga dikatakan kepada mereka, “kenapa kamu kafir sesudah kamu beriman?” bagaimana mungkin kalian memilih kekufuran atas keimanan? “Karena itu rasakanlah azab disebabkan kekafiranmu itu.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 106: Di hari yang akan putih beberapa muka dan akan hitam beberapa muka. Adapun orang-orang yang hitam mukanya (akan dikatakan): \"Bukankah kamu telah kufur sesudah kamu beriman? Maka rasalah adaab dengan sebab kamu telah kufur\"."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dalam ayat ini, Allah Subhaanahu wa Ta'aala memberitakan tentang keadaan pada hari kiamat dan atsar (pengaruh) dari balasan yang adil atau lebih baik, di mana di dalamnya terdapat targhib (dorongan) dan tarhib (ancaman) agar seseorang memiliki rasa takut dan harap. Yakni hari kiamat. Mereka adalah orang-orang kafir. Ketika mereka dilemparkan ke dalam neraka. Maksudnya: \"Bagaimana kamu lebih mengutamakan kekafiran dan kesesatan daripada keimanan dan petunjuk?\""
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 106",
    "description": "Ayat ini menggambarkan perbedaan keadaan orang yang beriman dan orang kafir pada hari kiamat. Pada hari itu ada wajah yang putih berseri dan tampak sinar kebahagiaan dan kesenangan mereka karena pahala dari amal kebajikan mereka selama hidup di dunia; itulah wajah orang-orang yang beriman kepada Allah dan rasul-rasul-Nya, dan ada pula wajah yang hitam muram dan tampak rasa kesedihan, penyesalan dan kehinaan; itulah wajah orang-orang kafir dan mendustakan rasulrasul-Nya. Adapun orang-orang yang berwajah hitam muram, kepada mereka dikatakan, mengapa kamu kafir, murtad, setelah beriman, yaitu setelah datang penjelasan yang nyata, baik melalui rasul maupun kitab yang diturunkan Allah dan juga tanda-tanda kebesaran Allah di alam raya' karena itu, rasakanlah azab yang pedih disebabkan dosa kekafiranmu itu. Ayat ini menggambarkan kegembiraan ahli surga atas rahmat Allah yang mereka terima. Dan adapun orang-orang yang beriman dan ahli ibadah, mereka mendapatkan kebahagiaan dan berwajah putih berseri, mereka berada dalam rahmat Allah di surga, dengan berbagai kesenangan, keindahan, dan kedamaian; mereka kekal di dalamnya. Itulah karunia Allah bagi mereka yang beriman dan menaati-Nya."
  }
]