[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ada pun orang-orang yang wajahnya putih berseri-seri karena kenikmatan yang menyenangkan dan kabar gembira yang disampaikan kepada mereka dari kebaikan, mereka berada di dalam surga Allah dengan segala kenikmatannya, mereka abadi di dalamnya, dan tidak keluar darinya selamanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "107. Sedangkan orang-orang yang wajahnya putih bersih, tempat mereka di dalam surga Na'īm. Mereka kekal di dalamnya untuk selama-lamanya dalam kenikmatan yang tidak akan hilang dan tidak akan berubah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "107. فَفِى رَحْمَةِ اللهِ (maka mereka berada dalam rahmat Allah) Yakni dalam surga-Nya dan negeri kemuliaan-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "107 Adapun orang-orang yang wajahnya putih berseri karena cahaya iman, maka mereka berada dalam rahmat Allah dan tempat kemuliaan penuh dengan rahmat Allah yaitu surga; mereka kekal di dalamnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Adapun orang-orang yang berwajah putih berseri, mereka berada dalam rahmat Allah. Mereka kekal di dalamnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "106-107. Allah memberitakan tentang perbedaan tingkatan para makhluk pada Hari Kiamat dalam kebahagiaan dan kesengsaraan, dan bahwasanya wajah-wajah penghuni kebahagiaan akan memutih yaitu orang-orang yang beriman kepada Allah, membenarkan rasul-rasulNya, menaati perintahNya, menjauhi laranganNya, dan bahwasanya Allah memasukkan mereka ke dalam surga, dan akan melimpahkan segala kebaikan atas mereka, dan mereka akan kekal selamanya (di dalam surga). Sebaliknya wajah-wajah para penghuni kesengsaraan akan menghitam (muram) yaitu orang-orang yang mendustai para rasulNya, bermaksiat pada perintahNya dan memecah belah agama mereka menjadi beberapa kelompok, dan bahwa mereka akan dijelek-jelekkan sehingga dikatakan kepada mereka, “kenapa kamu kafir sesudah kamu beriman?” bagaimana mungkin kalian memilih kekufuran atas keimanan? “Karena itu rasakanlah azab disebabkan kekafiranmu itu.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 107: Dan adapun orang-orang mukanya itu akan berdiam di dalam rahmat Allah yang mereka akan kekal padanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mereka adalah orang-orang mukmin."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 107",
    "description": "Ayat ini menggambarkan kegembiraan ahli surga atas rahmat Allah yang mereka terima. Dan adapun orang-orang yang beriman dan ahli ibadah, mereka mendapatkan kebahagiaan dan berwajah putih berseri, mereka berada dalam rahmat Allah di surga, dengan berbagai kesenangan, keindahan, dan kedamaian; mereka kekal di dalamnya. Itulah karunia Allah bagi mereka yang beriman dan menaati-Nya setelah pada ayat-ayat sebelumnya Allah menguraikan tanda-tanda kekuasaan Allah, kecaman terhadap orang yang murtad dan kafir, petunjuk kepada orang yang beriman yaitu keharusan mati dalam keadaan islam, pentingnya persatuan dan kesatuan, serta perbedaan nasib orang kafir dan orang mukmin di akhirat, lalu dalam ayat ini Allah menutup penjelasan tersebut dengan menegaskan bahwa itulah ayat-ayat Allah, ketetapan suatu kebenaran yang tidak boleh diragukan yang kami bacakan melalui malaikat jibril kepada kamu dengan benar wahai nabi Muhammad, dan kamu harus berpegang teguh kepada Al-Qur'an dengan mengikuti petunjuk berupa perintah dan larangan agar mendapat kebahagiaan di dunia dan akhirat. Dengan perintah dan larangan tersebut Allah tidaklah berkehendak menzalimi siapa pun di seluruh alam, tetapi orang-orang kafir itulah yang menganiaya diri mereka sendiri dengan berpecah belah dan berselisih tentang kebenaran ajaran agama, sehingga mereka pantas mendapat siksaan yang pedih."
  }
]