[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ini adalah ayat-ayat Allah dan bukti-buktinya yang amat terang, Kami membacakan dan mengisahkannya kepadamu (wahai Rasul), dengan benar dan yakin. Dan Allah tidak mendzhalimi seorang pun dari makhlukNya dan tidak mengurangi sedikitpun dari amal-amal perbuatan mereka; karena Dia adalah hakim yang Maha adil yang tidak berbuat kecurangan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "108. Ayat-ayat yang berisi janji dan ancaman Allah itu kami bacakan kepadamu -wahai Nabi- dengan benar dalam hal beritanya, dan adil dalam ketentuan hukumnya. Dan Allah tidak menghendaki kezaliman terhadap siapapun yang ada di alam semesta ini, bahkan Allah tidak akan menyiksa seseorang kecuali berdasarkan apa yang diperbuat oleh tangannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "108. Hai Muhammad, ayat-ayat yang mulia dan hujjah-hujjah yang agung itu Kami sampaikan kepadamu dengan sebenar-benarnya. Allah tidak hendak menzalimi seorang makhlukpun."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "108. نَتْلُوهَا عَلَيْكَ بِالْحَقِّ ۗ (Kami bacakan ayat-ayat itu kepadamu dengan benar) Yakni dengan bacaan yang benar yang berupa keadialan. وَمَا اللَّـهُ يُرِيدُ ظُلْمًا لِّلْعٰلَمِين(; dan tiadalah Allah berkehendak untuk menganiaya hamba-hamba-Nya) Yakni sebab azab yang ditimpakan kepada meraka tidak lain karena mereka berhak mendapatkannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "108 Itulah ayat-ayat Al-quran yang Kami bacakan kepadamu yang diliputi kebenaran yaitu keadilan; sebagai penetap tentang sesuatu yang benar. Allah tidak berkehendak untuk menganiaya hamba-hamba-Nya di seluruh alam sedikitpun: yaitu manusia dan jin dengan mengazab mereka tanpa suatu dosa."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Itulah ayat-ayat Allah yang Kami bacakan} kami bacakan {kepadamu dengan benar dan tidaklah Allah berkehendak melakukan kezaliman pada semesta alam"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "108. Allah memuji atas sesuatu yang telah Dia ceritakan kepada NabiNya, berupa ayat-ayatNya yang menjadi pembeda antara yang benar dengan yang batil, antara wali-wali Allah dengan musuh-musuhNya, dan sesuatu yang Allah siapkan untuk mereka berupa pahala dan untuk selain mereka berupa hukuman, dan bahwa hal tersebut adalah tuntutan karunia, keadilan, dan hikmahNya. Dan bahwasanya Allah tidaklah menzhalimi hamba-hambaNya, tidak mengurangi (pahala) dari amlalan-amalan mereka atau menyiksa seseorang tanpa ada dosa, atau memikulkan seseorang dengan dosa orang lain. Dan ketika Allah memberitahukan bahwa kepunyaan Allah-lah segala urusan dan syariat, maka Allah juga menyebutkan bahwa kepunyaanNYa-lah kesempurnaan kekuasaan, tindakan, dan kerajaanNya seraya berfirman,"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 108: Yang demikian itu ayat-ayat Allah; Kami bacakan dia kepadamu dengan sebenarnya; dan Allah itu tidak maksudkan kezhaliman bagi makhluk."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Misalnya menyiksa mereka tanpa ada kesalahan atau dosa dan mengurangi kebaikan yang mereka lakukan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 108",
    "description": "Setelah pada ayat-ayat sebelumnya Allah menguraikan tanda-tanda kekuasaan Allah, kecaman terhadap orang yang murtad dan kafir, petunjuk kepada orang yang beriman yaitu keharusan mati dalam keadaan islam, pentingnya persatuan dan kesatuan, serta perbedaan nasib orang kafir dan orang mukmin di akhirat, lalu dalam ayat ini Allah menutup penjelasan tersebut dengan menegaskan bahwa itulah ayat-ayat Allah, ketetapan suatu kebenaran yang tidak boleh diragukan yang kami bacakan melalui malaikat jibril kepada kamu dengan benar wahai nabi Muhammad, dan kamu harus berpegang teguh kepada Al-Qur'an dengan mengikuti petunjuk berupa perintah dan larangan agar mendapat kebahagiaan di dunia dan akhirat. Dengan perintah dan larangan tersebut Allah tidaklah berkehendak menzalimi siapa pun di seluruh alam, tetapi orang-orang kafir itulah yang menganiaya diri mereka sendiri dengan berpecah belah dan berselisih tentang kebenaran ajaran agama, sehingga mereka pantas mendapat siksaan yang pedih. Mahasuci Allah dari perbuatan aniaya karena milik Allah-lah apa yang ada di langit dan apa yang ada di bumi. Allah mahasempurna, mahakaya, dan tidak memerlukan apa pun dari hamba-Nya, dan hanya kepada Allah segala urusan dikembalikan. Kemudian dia akan mengadakan perhitungan dan memberi pahala kepada orang yang taat dan menghukum orang yang zalim."
  }
]