[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan milik Allah apa-apa yang ada di langit dan apa-apa yang ada di bumi, merupakan milikNya semata, baik dari sisi penciptaan maupun pengaturanNya, dan tempat kembali semua makhluk adalah kepadaNya semata, kemudian Dia akan memberi balasan kepada tiap-tiap makhluk sesuai dengan balasan yang pantas diterimanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "109. Hanya milik Allah -Ta'ālā- sajalah apa yang ada di langit dan apa yang ada di bumi dalam konteks penciptaan dan hak memberikan perintah. Dan hanya kepada-Nya lah mereka akan dikembalikan kelak pada hari kiamat. Kemudian Dia akan memberi mereka balasan yang setimpal dengan amal perbuatan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "109. Hanya Allah yang memiliki kerajaan langit dan bumi. Kepada-Nya para makhluk akan dikembalikan untuk mendapat balasan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "109. مَا فِى السَّمٰوٰتِ وَمَا فِى الْأَرْضِ ۚ (segala yang ada di langit dan di bumi) Yakni milik mereka segala hal itu yang bertindak padanya sesuai dengan kehendak-Nya dan atas keinginan-Nya; adapun jauhnya Dia dari sifat zalim adalah kerana apa yang ada di langit dan di bumi berada dalam genggamannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "109 Kepunyaan Allah-lah segala yang ada di langit dan di bumi Yang berhak melakukan apapun yang Dia kehendaki. Segala seuatu ada pada kekuasaan-Nya dan kepada Allahlah tempat kembali segala urusan. Yang Maha Memberi balasan kebaikan kepada pembuat kebaikan dan Membalas Keburukan kepada pembuat keburukan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Milik Allahlah apa yang ada di langit dan apa yang ada di bumi dan hanya kepada Allah segala urusan dikembalikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "109. “Kepunyaan Allah-lah segala yang ada di langit dan dibumi; dan kepada Allah-lah segala urusan dikembalikan,” maka Allah akan membalas orang-orang yang berbuat kebajikan dengan kebaikan mereka dan orang-orang yang berbuat kejelekan dengan kemaksiatan mereka. Sering sekali Allah menyebutkan hukum-hukumNya yang tiga itu secara bersamaan, yang mana Allah menjelaskan kepada hamba-hambaNya bahwa Dia-lah Pemutus perkara yang mutlak, milikNya-lah ketentuan-ketentuan takdir, ketentuan-ketentuan syariat, dan ketentuan-ketentuan pembalasan. Maka Allah-lah hakim di antara hamba-hambaNya di dunia dan akhirat, sedangkan selain diriNya dari para makhluk adalah orang-orang yang terkenal ketentuan hukum atasnya yang tidak memiliki hak sedikitpun."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 109: Dan kepunyaan Allah lah apa apa yang ada di langit dan apa-apa yang ada di bumi; dan kepada Allah-lah akan dikem balikan urusan-urusan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni milik-Nya, ciptaan-Nya dan hamba-Nya. Allah-lah yang memiliki segala yang ada di langit dan di bumi, Dia-lah yang menciptakan mereka, memberi rezki kepada mereka dan mengatur mereka dengan qadar-Nya, syari'at-Nya dan perintah-Nya. Semua akan kembali kepada-Nya pada hari kiamat, dan Dia akan memberikan balasan amal mereka yang baik maupun yang buruk."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 109",
    "description": "Mahasuci Allah dari perbuatan aniaya karena milik Allah-lah apa yang ada di langit dan apa yang ada di bumi. Allah mahasempurna, mahakaya, dan tidak memerlukan apa pun dari hamba-Nya, dan hanya kepada Allah segala urusan dikembalikan. Kemudian dia akan mengadakan perhitungan dan memberi pahala kepada orang yang taat dan menghukum orang yang zalim. Setelah Allah menjelaskan kewajiban berdakwah bagi umat islam dan menjaga persatuan dan kesatuan, maka dalam ayat ini dijelaskan bahwa kewajiban tersebut dikarenakan kamu (umat islam) adalah umat terbaik dan paling utama di sisi Allah yang dilahirkan, yaitu ditampakkan untuk seluruh umat manusia hingga akhir zaman, karena kamu menyuruh berbuat yang makruf, dan mencegah dari yang mungkar dan beriman kepada Allah dengan iman yang benar, sehingga kalian menjalankan perintah-Nya dan menjauhi larangan-Nya serta beriman kepada rasul-rasul-Nya. Itulah tiga faktor yang menjadi sebab umat islam mendapat julukan umat terbaik. Sekiranya ahli kitab beriman sebagaimana umat islam beriman, menyuruh yang makruf dan mencegah yang mungkar serta tidak bercerai berai dan berselisih tentang kebenaran ajaran agama Allah, tentulah itu lebih baik bagi mereka. Kenyataannya di antara mereka ada yang beriman sebagaimana imannya umat islam, sehingga sebagian kecil dari mereka ini pantas mendapat julukan sebaik-baik umat, namun kebanyakan mereka adalah orang-orang fasik, tidak mau mengikuti petunjuk dan tidak taat kepada Allah serta mengingkari syariat-Nya."
  }
]