[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Karakter orang orang kafir dalam sikap mendustakan (kebenaran) yang mereka perbuat dan hukuman yang menimpa mereka, persis seperti keadaan kamu fir’aun dan orang orang kafir sebelum mereka, yang mengingkari ayat-ayat Allah yang amat jelas, maka Allahmenyegerakan siksaan bagi mereka dikarenakan sikap pendustaan yang mereka lakukan dan pembangkangan mereka. Dan Allah sangat keras siksaanNYA bagi orang-orang yang kafir kepadaNYA dan mendustakan rasul-rasulNYA."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Kondisi orang-orang kafir itu sama seperti pengikut Fir'aun dan orang-orang sebelum mereka yang ingkar kepada Allah dan mendustakan ayat-ayat-Nya, maka Allah menimpakan azab kepada mereka disebabkan dosa-dosa mereka. Harta benda dan anak-anak tidak berguna bagi mereka. Dan Allah Mahakeras hukuman-Nya bagi orang-orang yang ingkar kepada-Nya dan mendustakan ayat-ayat-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "11. Keadaan orang-orang kafir dalam mendustakan ayat-ayat Allah seperti keadaan kaum Fir’aun dan orang-orang kafir sebelumnya seperti kaum nabi Nuh, Hud, dan Shalih yang mendustakan ayat-ayat-Nya. Allah menyiksa mereka akibat pendustaan mereka. Allah Maha Keras siksaan-Nya dan pedih azab-Nya. Ibnu ‘Asyur berkata: firman Allah {كدأب ءال فرعون} huruf kaf yang berguna untuk menyerupakan dalam ayat ini menempati posisi khabar dari mubtada’ mahdzuf yang dapat diketahui dari musyabbah bihi, sehingga dapat bermakna: keadaan mereka dalam hal ini seperti keadaan para kaum Fir’aun. (at-Tahrir wa at-Tanwir 3/33)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "11. كَدَأْبِ ءَالِ فِرْعَوْن (sebagaimana keadaan kaum Fir’aun) Yakni seperti kebiasaan dan keadaan pengikut Fir’aun dalam menghadapi Musa. Yakni harta dan anak mereka tidak akan memberi mereka manfaat sebagaimana harta dan anak-anak para pengikut Fir’aun tidak dapat memberi manfaat untuk mereka. وَالَّذِينَ مِن قَبْلِهِمْ ۚ( dan orang-orang yang sebelumnya) Yakni umat-umat yang kafir sebelumnya. كَذَّبُوا۟ بِـَٔايٰتِنَا فَأَخَذَهُمُ اللهُ (mereka mendustakan ayat-ayat Kami; karena itu Allah menyiksa mereka ) Yakni Allah menyiksa mereka dengan siksaan yang membinasakan. بِذُنُوبِهِمْ ۗ (disebabkan dosa-dosa mereka ) Yang secara umum adalah dosa pendustaan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Keadaan biasanya orang-orang kafir itu seperti keadaan kaum Fir’aun yang hidup bersama Musa dan umat-umat kafir sebelumnya seperti kaum ‘Aad dan kaum Luth. Harta dan anak-anak mereka tidak berguna sedikit pun, karena mereka mendustakan ayat-ayat Allah yang dibawa oleh para rasul. Lalu Allah menghukum mereka karena dosa-dosa mereka di antaranya adalah mendustakan para rasul. Dan Allah itu Maha Dahsyat hukumanNya bagi setiap orang yang ingkar dan berdusta"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Seperti keadaan} seperti keadaan {pengikut Fir‘aun dan orang-orang sebelum mereka. Mereka mendustakan ayat-ayat Kami. Allah menyiksa mereka} Lalu Allah menyiksa mereka {karena dosa-dosa mereka. Allah sangat keras hukumanNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "10-11. Setelah Allah menyebutkan tentang Hari Kiamat, Allah memberitakan tentang semua orang-orang yang mengingkari Allah dan mendustakan para Rasul Allah, bahwa mereka pasti akan masuk ke dalam neraka dan tersiksa di dalamnya, dan bahwa harta dan anak-anak mereka tidak berguna lagi bagi mereka sama sekali dari siksa Allah, dan bahwasanya Allah akan menimpakan atas mereka hukuman-hukuman dan siksaan-siksaan di dunia sebagaimana yang ditimpakan kepada Firaun dan seluruh umat yang mendustakan ayat-ayat Allah. “karena itu Allah menyiksa mereka disebabkan dosa-dosa mereka.” Dan Allah menyegerakan atas mereka siksaan-siksaan dunia yang berlanjut hingga siksaan-siksaan akhirat, “Dan Allah sangat keras siksaNYa.” Maka janganlah kalian meremehkan siksaan Allah hingga kalian akan merasa biasa hidup di atas kekufuran dan sikap mendustakan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 11: (Yaitu) sebagaimana hal kaum Fir'aun dan orang-orang yang dahulu daripada mereka itu. Mereka telah dustakan keterangan-keterangan Kami, maka Allah akan siksa mereka dengan sebab dosa-dosa mereka; dan Allah itu pedih siksaNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Bagi orang yang mendatangi sebab-sebab mendapat siksa, yaitu kekafiran dan kemaksiatan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 11",
    "description": "Keadaan mereka yang selalu mendustakan agama Allah dan azab yang diturunkan kepada mereka seperti keadaan pengikut firaun dan orang-orang kafir yang hidup sebelum mereka. Mereka semua mendustakan ayat-ayat kami yang tertulis dalam kitab suci dan/atau yang terbentang di alam raya. Mereka mendustakan ayat-ayat Allah, maka Allah menyiksa mereka disebabkan dosa-dosanya. Allah sangat berat hukuman-Nya. Jika fir'aun dan rezimnya yang sangat berkuasa dan gagah perkasa saja dapat dikalahkan dan mendapat siksa duniawi dan ukhrawi, apa-lagi orang yang tidak mencapai tingkat keperkasaan semacam itu. Karena itu, katakanlah, wahai nabi Muhammad, kepada orang-orang yang kafir dari kalangan yahudi dan lainnya yang memandang kemenanganmu di perang badar dengan sebelah mata, kamu pasti akan dikalahkan di dunia dan mati dalam keadaan kafir, kemudian digiring ke dalam neraka jahanam sebagai tempat tinggal kamu. Dan itulah seburuk-buruk tempat tinggal."
  }
]