[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang yang fasik dari Golongan ahli kitab itu tidak akan memudaratkan, kecuali (hanya) dalam bentuk (celaan-celaan) yang menyakitkan pendengaran kalian saja, seperti ucapan-ucapan syirik dan kekafiran ,serta yang lainnya. Dan apabila mereka memerangi kalian, pasti mereka akan terkalahkan, danmereka akan kabur, berbalik, lari tunggang-langgang, kemudian tidak mendapatkan pertolongan untuk mengalahkan kalian dalam keadaan apa pun."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "111. Betapapun mereka menunjukkan sikap permusuhan kepada kalian -wahai orang-orang mukmin-, mereka tidak akan dapat menimpakan mudarat kepada agama maupun diri kalian, kecuali berupa ucapan yang menyakiti hati kalian, menjelek-jelekkan agama, mengolok-olok kalian dan sebagainya. Dan jika mereka memerangi kalian niscaya mereka akan lari tunggang langgang di hadapan kalian, dan mereka tidak akan menang melawan kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "111. Para orang fasik dari kalangan Ahli Kitab tidak akan mampu membahayakan kalian kecuali hanya sekedar ucapan buruk mereka. Jika mereka memerangi kalian niscaya mereka akan kalah dan terbirit-birit melarikan diri, kemudian mereka akan menjadi hina dan tidak ada penolong bagi mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "111. لَن يَضُرُّوكُمْ إِلَّآ أَذًى ۖ (Mereka sekali-kali tidak akan dapat membuat mudharat kepada kamu, selain dari gangguan-gangguan celaan saja) Yakni mereka tidak akan memberi kalian madharat dengan suatu bahaya apapun kecuali dengan gangguan-gangguan berupa kebohongan, pengubahan, dan tuduhan; dan mereka tidak mampu memberikan bahaya yang sesungguhnya dengan peperangan, perampasan harta, dan lainnya. وَإِن يُقٰتِلُوكُمْ يُوَلُّوكُمُ الْأَدْبَارَ (dan jika mereka berperang dengan kamu, pastilah mereka berbalik melarikan diri ke belakang) Yakni mereka akan menerima kekalahan dan tidak mampu menghadapi kalian lalu bagaimana mereka akan memberimu bahaya. ثُمَّ لَا يُنصَرُونَ(Kemudian mereka tidak mendapat pertolongan) Akan tetapi keadaan mereka terhina selama mereka tetap dalam hal itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "111 Mereka orang-orang fasik sekali-kali tidak akan dapat membuat mudharat apapun kepada kamu wahai orang-orang mukmin, kecuali hanya dengan cacian berupa sindiran, tikaman dalam agama dan menyampaikan sesuatu yang syubhat. Jika mereka berperang dengan kamu, pastilah mereka berbalik melarikan diri ke belakang (kalah). Kemudian mereka tidak mendapat pertolongan selama kalian tetap beriman dalam kebenaran dengan iman yang sungguh-sungguh. Ayat ini turun ketika para petinggi Yahudi membaptis golongan mukmin dari mereka yaitu Abdullah bin Salam beserta para sahabatnya, mereka mencela keislaman mereka. Kemudian turunlah ayat ini."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka tidak akan membahayakanmu, kecuali gangguan-gangguan kecil saja} mudharat ringan melalui lisan seperti celaan dan ancaman. {Jika mereka memerangi kalian, niscaya mereka berbalik ke belakang} mereka melarikan diri karena kalah {kemudian mereka tidak mendapat pertolongan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "110-111. Hal ini adalah keutamaan yang diberikan Allah pada umat ini dengan sebab-sebab tersebut, yang menjadikan mereka istimewa karenanya dan mereka unggul di atas seluruh umat. Mereka adalah sebaik-baik manusia untuk manusia dalam nasihat dan cinta kepada kebaikan, dakwah, pengajaran, bimbingan, perintah kepada kebaikan dan larangan dari kemungkaran, menyatukan kesempurnaan akhlak dan usaha dalam memberikan manfaat kepada kebaikan dan larangan dari kemungkaran, menyatukan kesempurnaan akhlak dan usaha dalam memberikan manfaat kepada mereka sesuai dengan kemampuan, dan antara penyempurnaan jiwa dengan beriman kepada Allah dan menunaikan segala hak-hak keimanan. Dan bahwa Ahli Kitab jika mereka beriman seperti kalian beriman kepadaNya, niscaya mereka akan mendapatkan petunjuk, dan itulah yang baik buat mereka. Akan tetapi yang beriman di antara mereka hanya sedikit, dan mayoritasnya adalah orang-orang yang fasik yang keluar dari ketaatan kepada Allah dan RasulNya, memerangi kaum Mukminin, dan berusaha dalam memudaratkan mereka dengan segala kemampuan mereka. Tetapi walaupun demikian, mereka tidak akan mampu memudaratkan kaum Mukminin kecuali ejekan lisan saja, dan jika tidak demikian, sekiranya kaum Mukminin memerangi mereka, pastilah mereka akan melarikan diri dan mereka tidak akan ditolong. Dan apa yang dikabarkan oleh Allah tersebut benar-benar telah terjadi, yaitu ketika mereka memerangi kaum Mukminin, maka mereka malah berpaling dan melarikan diri, lalu Allah menolong kaum Mukminin dalam memerangi mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 111: Mereka tidak akan dapat membahayakan kamu kecuali menyakitkan (sedikit) dan jika mereka memerangi kamu, mereka akan hadapkan belakang-belakang mereka kepada kamu dan sesudah itu mereka tidak akan dimenangkan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya: orang-orang Yahudi. Maksudnya: sebatas gangguan di lisan saja, seperti mecaci, mengancam dsb."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 111",
    "description": "Meskipun kebanyakan ahli kitab adalah fasik, tetapi mereka tidak akan membahayakan kamu, karena Allah akan menjaga kamu selama kamu menjalankan tiga faktor yang disebut dalam ayat sebelumnya. Tidak ada yang bisa mereka lakukan kecuali gangguan-gangguan kecil saja, seperti cemoohan, ancaman, dan cercaan. Dan jika suatu ketika mereka memerangi kamu, niscaya Allah akan menolong orang-orang yang beriman, sehingga mereka mundur berbalik ke belakang karena kalah. Selanjutnya mereka tidak mendapat pertolongan dari siapapun. Tidak saja menderita kekalahan, mereka selalu diliputi kehinaan dan tidak ada lagi kebanggaan akibat kekalahan itu di mana saja mereka berada, kecuali jika mereka berpegang pada dua hal, yaitu tali ajaran agama Allah dan tali perjanjian dengan manusia di mana mereka akan aman selama perjanjian itu berlaku. Tetapi mereka melanggar, sehingga mendapat murka dari Allah dan selalu diliputi kesengsaraan. Murka Allah kepada mereka yang demikian itu, karena mereka mengingkari ayat-ayat Allah dan membunuh para nabi tanpa hak, padahal tidak ada alasan yang menyebabkan nabi pantas dibunuh. Yang demikian itu, yaitu kekufuran dan pembunuhan yang terjadi, karena mereka terus-menerus durhaka dan melampaui batas, banyak berbuat maksiat, memuja dunia, serta mengubah isi kitab suci mereka."
  }
]