[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah menjadikan kehinaan dan kenistaan sebagai suatu kenicscayaan yang tidak pernah terpisah dari kaum Yahudi. Karena itu, mereka adalah kaum terhina lagi ternistakan di mana pun mereka berada, kecuali dengan adanya janji dari Allah dan perjanjian dari manusia, maka barulah mereka merasakan aman pada jiwa dan harta mereka. Itu merupakan perjanjian bagi ahli dzimmah atas mereka dan keharusan bagi mereka untuk menjalankan hukum-hukum islam. Dan mereka kembali dengan ditimpa kemurkaan Allah yang layak mereka dapatkan. Dan mereka ditimpa oleh kehinaan dan kerendahan. Maka tidaklah kamu melihat orang Yahudi kecuali pada dirinya terpancar rasa takut dan gentar terhadap orang-orang beriman. Itulah yang telah Allah jadikan untuk mereka disebabkan kekafiran mereka kepada Allah dan kelakuan melampaui batas yang mereka perbuat terhadap batas-batas Allah, juga karena mereka membunuh para nabi secara zhaliman dan melampaui batas. Dan tidak ada yang membuat mereka lancang untuk melakukan itu kecuali karena mereka melakukan berbagai maksiat dan melanggar batasan-baatasan Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "112. Orang-orang Yahudi senantiasa terkepung oleh kehinaan dan kenistaan di manapun mereka berada. Mereka tidak akan mendapatkan jaminan keamanan kecuali dengan perjanjian atau jaminan keamanan dari Allah -Ta'ālā- atau dari manusia, dan mereka pulang dengan membawa murka dari Allah. Dan mereka juga akan ditimpa kemiskinan dan kemelaratan. Hal itu disebabkan oleh sikap mereka yang mengingkari ayat-ayat Allah dan membunuh para nabi secara semena-mena. Dan hal itu juga disebabkan oleh kedurhakaan dan perbuatan mereka yang suka melanggar batas-batas Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "112. orang-orang kafir dari kalangan Ahli kitab akan terus terhina dimanapun mereka berada, kecuali dengan perjanjian dengan Allah dan dengan manusia untuk mendapatkan keamanan pada diri dan harta mereka. Kemudian mereka kembali berhak mendapat kemurkaan Allah yang menjadikan mereka kembali terhina dan miskin akibat kedustaan mereka terhadap ayat-ayat Allah dan terus menerus membunuh para nabi secara zalim. Siksaan itu akibat kemaksiatan mereka dan pelanggaran mereka terhadap perintah-perintah Allah. syeikh Ibnu Taimiyah berkata tentang ayat 112 ini: “Allah menjelaskan bahwa mereka akan terhina dimanapun mereka berada kecuali dengan berpegang pada perjanjian. Maka dari sini diketahui bahwa barangsiapa yang berpegang pada perjanjian tidak akan terhina, meski tetap hidup miskin, dan kemiskinan belum tentu menjadikan seseorang menjadi hina.” (as-Sharim al-Maslul 27)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "112. ضُرِبَتْ عَلَيْهِمُ الذِّلَّةُ (Mereka diliputi kehinaan) Sehingga kehinaan mengelilingi mereka dalam keadaan apapun. أَيْنَ مَا ثُقِفُوٓا۟ (di mana saja mereka berada) Dimanapun kalian mendapatkan mereka dan mendapat kesempatan atas mereka. إِلَّا بِحَبْلٍ مِّنَ اللهِ(kecuali jika mereka berpegang kepada tali (agama) Allah) Baik itu dengan dzimmah (perlindungan) Allah atau dengan kitab-Nya. وَحَبْلٍ مِّنَ النَّاسِ (dan tali (perjanjian) dengan manusia) Dengan dzimmah dari manusia atau kaum muslimin atau dengan pertolongan dari selain mereka. وَبَآءُو (dan mereka kembali) Yakni mereka kembali. بِغَضَبٍ مِّنَ اللهِ (mendapat kemurkaan dari Allah) Yakni kemurkaan dari Allah senantiasa meliputi mereka karena mereka berhak mendapatkan itu. وَضُرِبَتْ عَلَيْهِمُ الْمَسْكَنَةُ ۚ (dan mereka diliputi kerendahan) Yakni kehinaan diri. Dan makna (الضرب عليهم) dalam hal ini adalah apa yang selalu meliputi mereka dari setiap sisi, berupa kemurkaan, kehinaan, dan kerendahan. Dan mereka dibawah kemiskinan yang berat dan kerendahan yang sangat kecuali beberapa orang diantara mereka. ذٰلِكَ (Yang demikian itu) Yakni kehinaan dan kerendahan yang meliputi mereka dan mereka yang kembali dengan kemurkaan Allah karena mereka kafir dengan ayat-ayat Allah, pembunuhan nabi-nabi mereka, kemaksiatan, dan permusuhan mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ) Diantara kebodohan orang-orang Yahudi : { ضُرِبَتْ عَلَيْهِمُ الذِّلَّةُ أَيْنَ مَا ثُقِفُوا إِلَّا بِحَبْلٍ مِنَ اللَّهِ وَحَبْلٍ مِنَ النَّاسِ } \"Mereka diliputi kehinaan di mana saja mereka berada, kecuali jika mereka berpegang kepada tali (agama) Allah dan tali (perjanjian) dengan manusia\" mereka tidak akan menang dengan sendirinya, tanpa bantuan dari orang-orang selainnya, baik itu kalangan Arab ataupun selain dari mereka, bahkan mereka melalukan peperangan bersama kaum mereka sendiri sebelum datangnya islam, akan tetapi kehinaan meliputi mereka tatkala al-Masih diutus kepada mereka lalu mereka mendustakannya. 2 ). Kaum Yahudi memang memiliki segala macam persenjataan yang canggih, akan tetapi hal yang hilang dari mereka adalah keteguhan, { ضُرِبَتْ عَلَيْهِمُ الذِّلَّةُ أَيْنَ مَا ثُقِفُوا } \"Mereka diliputi kehinaan di mana saja mereka berada\" . Dan sungguh kaum Yahudi itu tidak akan pernah memiliki akal yang sehat dantidak pula mereka meraih petunjuk sebagai pedoman, dan strategi yang mereka miliki hanyalah fitnah, perang, dan pengrusakan, tetapi mereka tidak menyadari bahwa Allah selalu mengintai dan mengawasi apapun yang mereka perbuat, perhatikan ayat berikut : { كُلَّمَا أَوْقَدُوا نَارًا لِلْحَرْبِ أَطْفَأَهَا اللَّهُ ۚ وَيَسْعَوْنَ فِي الْأَرْضِ فَسَادًا ۚ وَاللَّهُ لَا يُحِبُّ الْمُفْسِدِينَ } \"Setiap mereka menyalakan api peperangan Allah memadamkannya dan mereka berbuat kerusakan dimuka bumi dan Allah tidak menyukai orang-orang yang membuat kerusakan\" [ al-Ma'idah : 64 ]."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "112 Mereka diliputi kehinaan di mana saja mereka berada, kecuali jika mereka berpegang kepada tali agama Allah dan tali perjanjian dengan manusia untuk tidak melakukan peperangan. Dan mereka kembali mendapat kemurkaan dari Allah dan mereka diliputi kerendahan dari segala arah. Kemurkaan dan segala kehinaan itu karena mereka kafir kepada ayat-ayat Allah berupa Taurat dan Al-quran, serta membunuh para nabi tanpa alasan yang benar dan permusuhan. Siksa bagi mereka itu disebabkan mereka durhaka atas perintah Allah pelanggaran-pelanggaran mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kehinaan ditimpakan kepada mereka} mereka ditimpa kehinaan dan kekurangan {di mana saja mereka berada} dimana pun mereka berada {kecuali jika berpegang pada pada tali} pada janji {Allah dan tali dengan manusia. Mereka kembali} kembali {kepada murka Allah dan ditimpakan kepada mereka kesengsaraan} kefakiran {Yang demikian itu karena mereka mengingkari ayat-ayat Allah dan membunuh para nabi tanpa hak. Yang demikian itu karena mereka durhaka dan melampaui batas"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "112. Ini merupakan kabar dari Allah bahwa kaum Yahudi itu diliputi oleh kehinaan sehingga mereka selalu takut di mana pun mereka berada, tidak ada yang dapat menenangkan mereka kecuali perjanjian damai dan suatu sebab yang bisa membuat mereka tenang, mereka tunduk di bawah hukum-hukum Islam dan mereka membayar jizyah, atau dengan tali perjanjian “dengan manusia,” maksudnya, apabila mereka di bawah kekuasaan selain mereka dan pengawasan bangsa lain, sebagaimana telah terlihat dari kondisi mereka dahulu maupun yang akan datang, dimana mereka pada masa terakhir ini tidak mampu menguasai secara temporal di Palestina kecuali dengan bantuan negara-negara kuat dan penyediaan prasarana mereka untuk mereka dalam segala hal. “Dan mereka kembali mendapat kemurkaan dari Allah,” maksudnya, sungguh Allah murka atas mereka dan menghukum mereka dengan kehinaan dan kerendahan. Sebab-sebabnya adalah kekufuran mereka terhadap para Nabi “tanpa alasan yang benar.” Maksudnya, hal tersebut tidaklah atas dasar kesewenang-wenangan dan kedurhakaan. Hukuman yang bermacam-macam yang menimpa mereka, “disebabkan mereka durhaka dan melampaui batas.” Allah tidak menzhalimi mereka dan menyiksa mereka tanpa adanya dosa, akan tetapi yang Allah timpakan atas mereka disebabkan oleh kesewenang-wenangan, permusuhan, kukufuran, pendustaan, dan kejahatan mereka yang besar itu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 112: Dikenakan atas mereka kehinaan di mana saja mereka ada,kecuali (kalau mereka berpegang) dengan tali dari Allah dan tali dari manusia; dan pantaslah mereka dapat kemurkaan dari Allah dan dikenakan atas mereka kerendahan.Yang demikian itu, lantaran mereka kufur kepada perintah-perintah Allah, dan mereka bunuh nabi-nabi dengan tidak benar. Yang demikian itu, lantaran mereka durhaka dan adalah mereka melewati batas."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Berpegang dengan \"Tali Allah\" maksudnya perlindungan yang ditetapkan Allah dalam Al Quran, yaitu akad dzimmah yang menghendaki mereka membayar jizyah (pajak) kepada pemerintah Islam dan mau mengikuti hukum-hukum agama. Sedangkan \"tali perjanjian dengan manusia\" yakni kemananan dari mereka, misalnya dengan adanya hudnah (genjatan senjata), mengadakan perjanjian (mu'ahad), maupun sebagai tawanan yang diamankan oleh seorang kaum muslimin meskipun wanita maupun budak –budak pun boleh mengamankan menurut sebagian ulama-. Yakni: ditimpa kehinaan, kerendahan, dan kemurkaan dari Allah. Mereka membalas kebaikan para nabi dengan keburukan, bagai air susu dibalas dengan air tuba. Yakni: kafir kepada ayat-ayat Allah dan membunuh para nabi. Dari yang halal beralih kepada yang haram."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 112",
    "description": "Tidak saja menderita kekalahan, mereka selalu diliputi kehinaan dan tidak ada lagi kebanggaan akibat kekalahan itu di mana saja mereka berada, kecuali jika mereka berpegang pada dua hal, yaitu tali ajaran agama Allah dan tali perjanjian dengan manusia di mana mereka akan aman selama perjanjian itu berlaku. Tetapi mereka melanggar, sehingga mendapat murka dari Allah dan selalu diliputi kesengsaraan. Murka Allah kepada mereka yang demikian itu, karena mereka mengingkari ayat-ayat Allah dan membunuh para nabi tanpa hak, padahal tidak ada alasan yang menyebabkan nabi pantas dibunuh. Yang demikian itu, yaitu kekufuran dan pembunuhan yang terjadi, karena mereka terus-menerus durhaka dan melampaui batas, banyak berbuat maksiat, memuja dunia, serta mengubah isi kitab suci mereka pada ayat sebelumnya dijelaskan bahwa ahli kitab diliputi rasa kehinaan karena kalah perang, maka dalam ayat ini dijelaskan bahwa mereka itu tidak seluruhnya sama dalam hal ingkar kepada Allah dan jahat terhadap sesama manusia. Di antara ahli kitab ada golongan yang jujur, lurus, melaksanakan tuntunan nabi mereka, beriman kepada Allah dan kerasulan Muhammad. Hal ini dikarenakan mereka membaca ayat-ayat Allah pada sebagian malam hari, dan mereka juga tunduk kepada Allah dengan bersujud, yaitu tunduk dan patuh dan mendirikan salat."
  }
]