[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidaklah semua Ahli kitab sama semuanya. Diantara mereka ada golongan yang lurus di atas perintah Allah dan beriman kepada RasulNya, Muhammad . Mereka juga menghidupkan malam dengan membaca ayat-ayat Al-Quran al-Karim, fokus menghadap untuk bermunajat kepada Allah dalam shalat-shalat mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "113. Kondisi orang-orang Ahli Kitab itu tidaklah sama. Ada sekelompok orang mereka yang mengikuti agama Allah secara konsisten (istikamah). Mereka mematuhi perintah-perintah Allah dan larangan-larangan-Nya. Mereka membaca ayat-ayat Allah di waktu-waktu malam ketika mereka sedang melaksanakan salat malam karena Allah. Golongan ini ada sebelum kenabian Muhammad -'alaihiṣ ṣalātu was salām-. Dan sisa-sisa mereka yang menjumpai masa kenabian Muhammad menyatakan masuk Islam."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "113-114. Tidak semua Ahli kitab memiliki sifat yang sama; sebagian mereka taat kepada Allah, membaca al-Qur’an dalam shalat tahajjud mereka, senantiasa berzikir kepada Allah dengan khusyu’, beriman kepada Allah dan hari kebangkitan, memerintahkan kepada kebaikan yang diperintahkan Allah dan melarang keburukan yang dilarang-Nya, dan berlomba-lomba dalam melakukan kebaikan. Orang-orang yang mendapat derajat yang tinggi yang memiliki sifat-sifat ini adalah hamba-hamba Allah yang shalih."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "113. لَيْسُوا۟ سَوَآءً ۗ (Mereka itu tidak sama) Yakni Para ahli kitab tidak semua dalam keadaan yang tercela sebagaimana telah disebutkan. أُمَّةٌ قَآئِمَةٌ (ada golongan yang berlaku lurus) Akan tetapi dari mereka ada segolongan yang lurus dan berlaku adil يَتْلُونَ ءَايٰتِ اللهِ (mereka membaca ayat-ayat Allah) Yakni yang membaca ayat-ayat al-qur’an pada shalat malam. ءَانَآءَ الَّيْلِ (pada beberapa waktu di malam hari) Yakni masa-masa dalam malam tersebut. وهم يسجدون (dan mereka dalam keadaan bersujud) Yakni mengerjakan shalat, Allah menyebutkan kata sujud untuk mengibaratkan shalat karena didalamnya terdapat kepatuhan, ketundukan, dan pendekatan kepada Allah."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Dari ayat ini isyarat bahwa setiap pembaca qur'an agar lebih mementingkan bacaannya untuk malam hari, Allah berfirman : { مِنْ أَهْلِ الْكِتَابِ أُمَّةٌ قَائِمَةٌ يَتْلُونَ آيَاتِ اللَّهِ آنَاءَ اللَّيْلِ وَهُمْ يَسْجُدُونَ } \"di antara Ahli Kitab itu ada golongan yang berlaku lurus, mereka membaca ayat-ayat Allah pada beberapa waktu di malam hari, sedang mereka juga bersujud (sembahyang)\", adapun maksud diutamakannya waktu malam dalam ayat ini, karena waktu malam menjadikan hati lebih tenang dan terhindar dari kesibukan-kesibukan dunia, serta menjadikan seseorang yang beribadah lebih terjaga dari sifat riya'."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "113 Sifat para ahli kitab itu tidak sama; di antara Ahli Kitab itu ada golongan yang beriman dan membaca Al-quran saat shalat malam. Mereka melakukan ibadah sholat hanya karena Allah dengan penuh kekhusyuan dan merendahkan diri. Ayat ini turun ketika Abdullah bin Salam dan para sahabatnya beriman. Para pendeta Yahudi berkata: Tidak akan ada yang beriman kepada Muhammad kecuali orang-orang di antara kami yang memang hina. Kalau benar-benar mereka adalah orang kami mereka tidak akan meninggalkan agama para pendahulu kami sehingga berpindah pada agama lain. Maka Allah menurunkan ayat ini."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka tidak sama} Tidak semua Ahlul kitab itu sama {Di antara Ahlul kitab ada golongan yang lurus} golongan yang lurus dan tetap pada kebenaran {Mereka membaca ayat-ayat Allah pada malam hari} di waktu malam {dalam keadaan bersujud"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "113-114. Tatkala Allah menyebutkan tentang orang-orang yang menyimpang dari Ahli Kitab, maka Allah juga menjelaskan tentang orang-orang yang istiqamah dari mereka dan bahwa ada di antara mereka sekelompok orang yang menegakkan dasar-dasar agama dan cabang-cabangnya, “Mereka beriman kepada Allah dan Hari Penghabisan, mereka menyuruh kepada yang ma’ruf,” yaitu segala kebaikan, dan mereka melarang dari yang mungkar, yaitu segala macam kejelekan, sebagaimana Allah berfirman : \"Dan di antara kaum Musa itu terdapat suatu umat yang memberi petunjuk (kepada manusia) dengan hak dan dengan yang hak itulah mereka menjalankan keadilan.\" -Al-A’raf:159- “Dan bersegera kepada (mengerjakan) pelbagai kebajikan.” Bersegera melakukan pelbagai kebajikan merupakan nilai tambah daripada sekedar melakukannya. Itu adalah ciri mereka dalam mengamalkan kebajikan dan bersegera melakukannya, serta menyempurnakannya dengan segala hal yang melengkapinya, berupa perkara wajib maupun Sunnah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 113: Mereka itu tidak sama; dari antara Ahli Kitab itu ada golongan yang lurus yang membaca firman-firman Allah di waktu-waktu malam, padahal mereka merendah diri."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Imam Ahmad meriwayatkan dari Ibnu Mas'ud ia berkata: Rasulullah shallallahu 'alaihi wa sallam pernah menunda shalat Isya, lalu keluar ke masjid, ternyata para sahabat sedang menunggu shalat, maka Beliau bersabda, \"Adapun, tidak ada seorang pun penganut agama ini yang mengingat Allah di waktu ini selain kamu.\" Maka Allah menurunkan beberapa ayat\", yakni dari ayat 113 s/d 115. Hadits ini hasan sebagaimana dikatakan Imam Syaukani menukil dari As Suyuthi, karena 'Ashim terdapat sesuatu dalam hapalannya. Al Haitsami dalam Majma'uz Zawa'id berkata, \"Para perawi Ahmad adalah tsiqah selain 'Ashim bin Abinnujud, ia diperselisihkan dalam hal berhujjah dengannya.\" Haitsami dalam Majma'uz Zawa'id menyebutkan hadits lain tentang sebab turunnya ayat di atas, dari Ibnu Abbas, ia berkata: Ketika Abdullah bin Salam, Tsa'labah bin Sa'yah, Asad bin Ubaid serta beberapa orang Yahudi yang masuk Islam lainnya beriman, membenarkan dan semakin cinta dengan Islam. Para ulama yahudi yang kafir berkata, \"Tidak ada yang beriman kepada Muhammad dan mengikutinya selain orang-orang buruk di antara kami. Jika mereka termasuk orang-orang yang baik, tentu mereka tidak akan meninggalkan agama nenek moyang mereka,\" maka Allah Azza wa Jalla menurunkan ayat, \"Laisuu sawaa'aa…dst. sampai \"Minash shaalihiin\". (HR. Thabrani, namun dalam sanadnya terdapat Muhammad bin Abu Muhammad seorang yang majhul, dengan demikian hhadits ini dha'if). Oleh karena itu, Ibnu Jarir memilih hadits pertama sebagai sebab turunnya ayat, ia berkata, \"Hanya saja yang lebih tepat dalam menafsirkan ayat tersebut adalah pendapat yang mengatakan bahwa maksudnya bacaan Al Qur'an di shalat Isya, karena ia adalah shalat yang tidak dilakukan seorang pun di antara Ahli Kitab, maka Allah menyifati umat Nabi Muhammad shallallahu 'alaihi wa sallam, bahwa mereka melakukan shalat pada waktu itu, tidak Ahli Kitab yang kafir kepada Allah dan Rasul-Nya.\" Yakni: golongan ahli kitab yang telah memeluk agama Islam. Ayat ini menerangkan tentang ibadah mereka di malam hari, lamanya tahajjud mereka dan membaca kitab Allah serta perhatian mereka yang tinggi untuk tunduk, ruku' dan sujud kepada-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 113",
    "description": "Pada ayat sebelumnya dijelaskan bahwa ahli kitab diliputi rasa kehinaan karena kalah perang, maka dalam ayat ini dijelaskan bahwa mereka itu tidak seluruhnya sama dalam hal ingkar kepada Allah dan jahat terhadap sesama manusia. Di antara ahli kitab ada golongan yang jujur, lurus, melaksanakan tuntunan nabi mereka, beriman kepada Allah dan kerasulan Muhammad. Hal ini dikarenakan mereka membaca ayat-ayat Allah pada sebagian malam hari, dan mereka juga tunduk kepada Allah dengan bersujud, yaitu tunduk dan patuh dan mendirikan salatmereka beriman kepada Allah dan hari akhir dengan iman yang benar, sehingga tampak pada perilaku mereka, menyuruh berbuat yang makruf dan mencegah dari yang mungkar dan bersegera serta tidak menunda-nunda mengerjakan berbagai kebajikan. Mereka termasuk orang-orang saleh, yaitu orang yang baik dan mengajak orang lain untuk berbuat baik. Mereka itulah orang-orang yang beruntung dan mendapat rida Allah."
  }
]