[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka juga beriman kepada Allah dan Hari Akhir, memerintahkan kepada kebajikan seluruhnya, dan melarang dari keburukan semuanya, serta mereka bersegera mengerjakan kebaikan-kebaikan. Dan mereka itu termasuk hamba-hamba Allah yang shalih."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "114. Mereka beriman kepada Allah dan Hari Akhir dengan keimanan yang mantap. Mereka menyuruh berbuat yang makruf dan baik, melarang berbuat yang mungkar dan buruk, giat dalam melakukan kebajikan, dan selalu memanfaatkan waktu-waktu ibadah (untuk menabung kebajikan). Mereka itu adalah hamba-hamba Allah yang memiliki niat dan amal perbuatan yang baik."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "114. يُؤْمِنُونَ بِاللهِ وَالْيَوْمِ الْاٰخِرِ (Mereka beriman kepada Allah dan hari penghabisan) Yakni hari kiamat. وَيَأْمُرُونَ بِالْمَعْرُوفِ وَيَنْهَوْنَ عَنِ الْمُنكَرِ (mereka menyuruh kepada yang ma’ruf, dan mencegah dari yang munkar) Yakni meliputi segala hal. Dan pendapat lain mengatakan yang dimaksud dengan amar ma’ruf adalah memerintahkan untuk mengikuti Nabi Muhammad, sedangkan maksud dari mencegah dari yang mungkar adalah dengan melarang menyelisihi Nabi Muhammad. وَيُسٰرِعُونَ فِى الْخَيْرٰتِ (dan bersegera kepada (mengerjakan) pelbagai kebajikan) Yakni yang bergegas menjalankan itu tanpa ada rasa berat karena mereka mengetahui besarnya pahala dari amal tersebut. وَأُو۟لٰٓئِكَ مِنَ الصّٰلِحِينَ(mereka itu termasuk orang-orang yang saleh) Yakni bersama dengan orang-orang yang shaleh, dan mereka adalah para sahabat sehingga mereka termasuk umat yang menjadi sebaik-baik umat yang dilahirkan untuk manusia sebagaimana telah disebutkan sebelumnya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Seorang da'i yang sukses ialah da'i yang tidak akan mundur dari jalan dakwahnya, bahkan ia mampu dan memliki semangat dakwah yang tinggi dan selalu terdepan dalam menjalankan amanhnya, menjawab panggilan ummat adalah hal utama yang selalu dikerjakan, itulah diantara-sifat orang beriman, yang dengannya mereka akan meraih balasan terbaik dari sang Maha bijaksana."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "114 Mereka beriman kepada Allah dan hari penghabisan, mereka menyuruh kepada yang ma’ruf: yaitu mengikuti perintah Allah. Serta mencegah dari perbuatan munkar: yaitu segala perkataan atau perbuatan yang bertentangan dengan syariat. Serta bersegera mengerjakan berbagai kebajikan; mereka itu termasuk orang-orang yang saleh dan mereka adalah para sahabat Nabi."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka beriman kepada Allah dan hari akhir, menyuruh yang ma'ruf, mencegah dari yang mungkar, dan bersegera dalam berbagai kebajikan} mereka bersegera dalam berbuat kebaikan {Mereka itu termasuk orang-orang shalih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "113-114. Tatkala Allah menyebutkan tentang orang-orang yang menyimpang dari Ahli Kitab, maka Allah juga menjelaskan tentang orang-orang yang istiqamah dari mereka dan bahwa ada di antara mereka sekelompok orang yang menegakkan dasar-dasar agama dan cabang-cabangnya, “Mereka beriman kepada Allah dan Hari Penghabisan, mereka menyuruh kepada yang ma’ruf,” yaitu segala kebaikan, dan mereka melarang dari yang mungkar, yaitu segala macam kejelekan, sebagaimana Allah berfirman : \"Dan di antara kaum Musa itu terdapat suatu umat yang memberi petunjuk (kepada manusia) dengan hak dan dengan yang hak itulah mereka menjalankan keadilan.\" -Al-A’raf:159- “Dan bersegera kepada (mengerjakan) pelbagai kebajikan.” Bersegera melakukan pelbagai kebajikan merupakan nilai tambah daripada sekedar melakukannya. Itu adalah ciri mereka dalam mengamalkan kebajikan dan bersegera melakukannya, serta menyempurnakannya dengan segala hal yang melengkapinya, berupa perkara wajib maupun Sunnah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 114: Mereka beriman kepada Allah dan hari kemudian, dan mereka menyuruh berbuat kebaikan dan melarang daripada kejahatan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sebagaimana kaum mukmin beriman, mereka beriman kepada semua nabi yang diutus dan semua kitab yang diturunkan, termasuk beriman kepada Nabi Muhammad shallallahu 'alaihi wa sallam dan kitab yang diberikan kepada-Nya, yaitu Al Qur'an. Sering sekali disebutkan \"beriman kepada hari akhir\", karena beriman kepadanya dapat mendorong orang mukmin untuk mendekatkan diri kepada Allah, mengharap pahala di hari itu dan menjauhkan diri dari segala yang mendatangkan siksa di hari itu. Mereka memanfaatkan kesempatan yang ada untuk menambah kebaikan dan melakukannya segera, misalnya di awal waktu. Hal ini tidak lain karena rasa cintanya mereka kepada kebaikan dan mengetahui manfaat-manfaatnya. Yakni yang memiliki sifat-sifat itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 114",
    "description": "Mereka beriman kepada Allah dan hari akhir dengan iman yang benar, sehingga tampak pada perilaku mereka, menyuruh berbuat yang makruf dan mencegah dari yang mungkar dan bersegera serta tidak menunda-nunda mengerjakan berbagai kebajikan. Mereka termasuk orang-orang saleh, yaitu orang yang baik dan mengajak orang lain untuk berbuat baik. Mereka itulah orang-orang yang beruntung dan mendapat rida Allahuntuk menyenangkan hati mereka, maka Allah memberitahu bahwa amal saleh dan kebajikan apa pun yang mereka kerjakan, baik yang tersembunyi maupun yang tampak, tidak ada yang mengingkarinya dan pasti akan diberi pahala dari Allah. Dan Allah maha mengetahui orangorang yang benar-benar beriman dan bertakwa yang berbuat baik hanya untuk mencari rida-Nya."
  }
]