[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang yang kufur kepada ayat-ayat Allah, dan mendustakan Rasul-rosulNya, tidak akan dapat menolak sedikitpun harta benda mereka dan anak-anak mereka dari siksaan Allah dari mereka di dunia dan akhirat. Dan mereka itu merupakan para penghuni neraka yang akan tinggal terus di dalamya, dan tidak keluar darinya selamanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "116. Sesungguhnya orang-orang yang kafir kepada Allah dan Rasul-Nya itu tidak akan mendapatkan manfaat dari harta benda dan anak-anak mereka untuk melindungi diri mereka dari hukuman Allah. Harta benda dan anak-anak mereka tidak akan dapat menolak azab Allah dan tidak akan dapat mendatangkan rahmat-Nya. Bahkan sebaliknya akan menambah penderitaan dan penyesalan mereka. Dan mereka itu adalah penduduk neraka yang akan menetap di sana."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "116. Orang-orang yang mendustakan Allah dan rasul-Nya tidak akan mendapat manfaat sedikitpun dari harta dan keturunan mereka agar dapat selamat dari azab Allah. Mereka adalah orang-orang yang jauh dari rahmat Allah dan kekal di dalam neraka selama-lamanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "116. إِنَّ الَّذِينَ كَفَرُوا۟ (Sesungguhnya orang-orang yang kafir) Pendapat mengatakan mereka adalah Bani Quraidhah dan Bani Nadhir. Setelah Allah menyebutkan orang-orang mukmin dari Ahli kitab kemudian Allah menyebutkan orang-orang kafir dari mereka dalam ayat ini. لَن تُغْنِىَ عَنْهُمْ(sekali-kali tidak dapat menolak mereka) Yakni tidak akan dapat membela mereka. أَمْوٰلُهُمْ وَلَآ أَوْلٰدُهُم مِّنَ اللهِ شَيْـًٔا ۖ( harta mereka maupun anak-anak mereka dari azab Allah sedikitpun) Yakni dari apa yang dikehendaki Allah bahwa Dia akan menimpakan kepada mereka kekalahan dan siksaan. Dan Allah mengkhususkan penyebutan anak-anak karena mereka adalah kerabat yang paling dicintai seseorang dan yang paling memungkinkan untuk membela mereka dari apa yang menimpa mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "116 Sesungguhnya orang-orang yang kafir itu, harta maupun anak-anak mereka itu tidak akan bermanfaat bagi mereka sama sekali, serta tidak akan dapat menolak azab Allah dari mereka sedikitpun. Dan mereka adalah penghuni neraka; mereka kekal di dalamnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang yang kafir tidak akan berguna} melindungi { mereka baik harta maupun anak-anaknya, sedikit pun dari (azab) Allah} dari azab Allah {Mereka itu penghuni neraka. Mereka kekal di dalamnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "116-117. Allah menerangkan bahwa orang-orang kafir yang mengingkari ayat-ayat Allah dan mendustakan para rasulNya tidak aka nada penyelamat yang menyelamatkan mereka dari siksa Allah dan tidak pula ada pemberi syafaat kepada mereka di sisi Allah. Dan bahwasanya harta dan anak-anak mereka yang disiapkan untuk menghadapi kesulitan dan bencana tidak akan berguna bagi mereka sama sekali. Infak yang mereka keluarkan di dunia untuk membela kebatilan mereka akan lenyap, dan bahwa perumpamaannya “adalah seperti perumpamaan” tanaman yang ditimpa “angin” kencang, “yang mengandung hawa yang sangat dingin,” maksudnya, hawa dingin yang menusuk atau panas yang membakar, lalu menghancurkan tanaman tersebut, dan hal tersebut adalah akibat dari kezhaliman mereka, maka Allah tidak menzhalimi mereka dan menyiksa mereka tanpa suatu dosa, akan tetapi merekalah yang telah menzhalimi diri mereka sendiri. Ini sebagaimana Firman Allah : \"Sesungguhnya orang-orang yang kafir menafkahkan harta mereka untuk menghalangi (orang) dari jalan Allah. Mereka akan menafkahkan harta itu, kemudian menjadi sesalan bagi mereka, dan mereka akan dikalahkan. Dan ke dalam Jahannamlah orang-orang yang kafir itu dikumpulkan,\" –Al-Anfal:36-"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 116: Sesungguhnya yang kufur itu, harta-harta mereka dan anak-anak mereka tidak akan dapat menolak dari mereka sebarang satu (siksa) dari Allah; dan mereka yang mereka akan kekal padanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Disebutkan \"harta dan anak\", karena biasanya manusia menebus dirinya dengan harta dan terkadang dengan meminta bantuan kepada anak."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 116",
    "description": "Jika amal perbuatan orang yang beriman akan mendapatkan balasan kebaikan dari Allah, maka pada ayat ini Allah menjelaskan bahwa ketentuan itu tidak berlaku bagi orang kafir. Sesungguhnya tidak akan berguna bagi orang-orang kafir, baik harta yang dikumpulkan dan dipuja maupun anak-anak mereka yang selalu dibangga-banggakan, sedikit pun tidak dapat memberi manfaat untuk menolak azab dan siksa yang sudah ditetapkan Allah baik di dunia maupun di akhirat. Mereka itu penghuni neraka sebagai hukuman atas kedurhakaan mereka selama hidup di dunia, dan mereka kekal di dalamnya. Perumpamaan harta yang mereka infakkan baik secara ikhlas tapi tanpa dilandasi iman yang benar atau karena mencari popularitas di mata manusia di dalam kehidupan dunia ini, adalah ibarat angin yang mengandung hawa yang sangat dingin, yang menimpa tanaman yang siap dipanen, milik suatu kaum yang menzalimi diri sendiri, karena tidak beriman kepada Allah dan hari akhir, lalu angin itu merusaknya, sehingga tanaman yang siap dipanen tersebut seolah hangus terbakar dan pemiliknya tidak sedikit pun mendapatkan hasil. Karena tujuan infak mereka adalah popularitas, maka itulah yang mereka dapatkan. Dengan demikian Allah tidak menzalimi mereka, tetapi mereka yang menzalimi diri sendiri karena mereka hanya memburu kehidupan duniawi dan tidak percaya kepada kehidupan ukhrawi."
  }
]