[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Perumpamaan apa yang diinfakan oleh orang-orang kafir dalam berbagai jenis kebajikan di kehidupan dunia ini dan apa yang mereka harap-harapkan dari pahala, adalah seperti angin yang membawa hawa dingin menusuk yang bertiup menerjang tanaman-tanaman satu kaum yang mereka itu mengharap hasil panen baiknya, dan disebabkan dosa-dosa yang mereka perbuat, maka angin itu tidak menyisakan sedikitpun dari tanaman itu. Orang-orang kafir itu tidak menjumpai pahala di akhirat. Dan Allah tidak mendzhalimi mereka dengan kejadian itu, akan tetapi mereka sendiri yang telah mendzhalimi diri mereka sendiri dengan tindakan kekufuran dan maksiat mereka tersebut."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "117. Perumpamaan harta yang dibelanjakan oleh orang-orang kafir itu untuk kepentingan sosial dan ganjaran yang mereka harapkan adalah seperti angin sangat dingin yang menerpa lahan pertanian orang-orang yang menganiaya diri mereka dengan perbuatan-perbuatan maksiat dan lain-lain, kemudian angin tersebut merusak tanaman mereka, padahal mereka benar-benar mengharapkan hasil yang banyak sekali darinya. Maka sebagaimana angin yang merusak tanaman tersebut sehingga tidak bisa dimanfaatkan hasilnya, kekafiran juga akan membatalkan ganjaran amal yang sangat mereka harapkan. Dan Allah tidak akan menzalimi mereka -Mahasuci Allah dari tindakan itu-, tetapi mereka sendiri lah yang menganiaya diri mereka karena kafir kepada Allah dan mendustakan Rasul-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "117. Allah mengumpamakan orang-orang yang mendustakan Allah dan rasul-Nya saat bersedekah di dunia untuk kebaikan seperti angin yang sangat dingin yang menimpa perkebunan suatu kaum yang kafir sehingga angin itu merusaknya. Allah tidak menzalimi mereka dengan melenyapkan pahala amalan mereka, namun mereka menzalimi diri mereka sendiri dengan kekafiran mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "117. مَثَلُ مَا يُنفِقُونَ (Perumpamaan harta yang mereka nafkahkan) Ini adalah penjelasan bahwa harta yang dulu menopang mereka tidak berguna lagi, karena mereka menginfakkannya untuk melawan Allah dan Rasul-Nya dan memerangai agama Islam. كَمَثَلِ رِيحٍ فِيهَا صِرٌّ(seperti perumpamaan angin yang mengandung hawa yang sangat dingin) Makna (الصر) adalah hawa yang sangat dingin, sehingga makna dari ayat ini adalah bahwa perumpamaan infak orang-orang kafir di jalan memerangi Allah dan Rasul-Nya dalam hal kesia-siaan dan tidak adanya manfaatnya adalah sebagaimana kebun yang tertimpa angin yang dingin lalu terbakar atau binasa olehnya sehingga kebun tersebut tidak bermanfaat apapun bagi pemiliknya, padahal sebelumnya ia sangat mengharapkan manfaat dari kebun tersebut dan harta yang ia keluarkan untuk kebun tersebut juga sirna. Dan pendapat lain mengatakan bahwa perumpamaan ini adalah karena mereka mengerjakan kebajikan dengan harta mereka akan tetapi mereka dalam kekafiran kemudian mereka datang pada hari kiamat mendapati buah dari perbuatan mereka terhapus. وَلٰكِنْ أَنفُسَهُمْ يَظْلِمُونَ (, akan tetapi merekalah yang menganiaya diri mereka sendiri) Yakni dengan menyia-nyiakan harta mereka dalam melawan Allah yang tak akan terkalahkan, sebagaimana kebun tersebut apabila ditanami oleh kaum yang zalim kemudian kebun itu ditimpa oleh hawa dingin lalu binasa, seperti itulah apa yang mereka infakkan yang kemudian dibinasakan oleh kesyirikan mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Yunus al-makky menceritakan : suatu ketika ada seorang petani dari penduduk Thaif bercocok tanam disebuah kebun, sampai ketika tanaman itu mencapai waktu panen, tiba-tiba tanaman itu diserang oleh wabah ayng menyebabkan tanaman itu mati dan tidak memberikan hasil yang diharapkan, kemudian kami menghampiri petani itu untuk menyampaikan beberapa wasiat sebagai penghibur baginya tetapi petani itu tiba-tiba menangis, dan berkata : demi Allah aku tidak menangis karena wasiat itu, tetapi aku mendengar firman Allah : { كَمَثَلِ رِيحٍ فِيهَا صِرٌّ أَصَابَتْ حَرْثَ قَوْمٍ ظَلَمُوا أَنْفُسَهُمْ فَأَهْلَكَتْهُ } \"seperti perumpamaan angin yang mengandung hawa yang sangat dingin, yang menimpa tanaman kaum yang menganiaya diri sendiri, lalu angin itu merusaknya\" aku merasa takut jika termasuk diantara sifat-sifat itu, dan itulah yang membuatku menangis, tutur sang petani."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "117 Perumpamaan harta yang orang-orang kafir keluarkan untuk memerangi Rasul di dalam kehidupan dunia ini dalam hal lenyap dan batalnya adalah seperti perumpamaan angin yang mengandung hawa yang sangat dingin, yang menimpa tanaman kaum yang menganiaya diri sendiri dengan kekufuran, lalu angin itu merusaknya. Allah sekali-kali tidak menganiaya mereka dengan menyia-nyiakan ganjaran mereka, akan tetapi merekalah yang menganiaya diri mereka sendiri dengan menyia-nyiakan harta mereka untuk memerangi agama Allah yang tidak akan pernah terkalahkan. Ini adalah ungkapan tasybih murakkab."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Perumpamaan harta yang mereka infakkan} keadaan infak orang-orang kafir yang dibatalkan, dan dihilangkan manfaatnya {di dalam kehidupan dunia ini adalah ibarat angin yang mengandung hawa sangat dingin} sangat dingin {yang menimpa tanaman} tanaman {suatu kaum yang menzalimi diri sendiri} dengan kekufuran, kemaksiatan dan menolak kebenaran Allah SWT {lalu angin itu merusaknya} merusaknya {Allah tidak menzalimi mereka, tetapi mereka yang menzalimi diri sendiri"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "116-117. Allah menerangkan bahwa orang-orang kafir yang mengingkari ayat-ayat Allah dan mendustakan para rasulNya tidak aka nada penyelamat yang menyelamatkan mereka dari siksa Allah dan tidak pula ada pemberi syafaat kepada mereka di sisi Allah. Dan bahwasanya harta dan anak-anak mereka yang disiapkan untuk menghadapi kesulitan dan bencana tidak akan berguna bagi mereka sama sekali. Infak yang mereka keluarkan di dunia untuk membela kebatilan mereka akan lenyap, dan bahwa perumpamaannya “adalah seperti perumpamaan” tanaman yang ditimpa “angin” kencang, “yang mengandung hawa yang sangat dingin,” maksudnya, hawa dingin yang menusuk atau panas yang membakar, lalu menghancurkan tanaman tersebut, dan hal tersebut adalah akibat dari kezhaliman mereka, maka Allah tidak menzhalimi mereka dan menyiksa mereka tanpa suatu dosa, akan tetapi merekalah yang telah menzhalimi diri mereka sendiri. Ini sebagaimana Firman Allah : \"Sesungguhnya orang-orang yang kafir menafkahkan harta mereka untuk menghalangi (orang) dari jalan Allah. Mereka akan menafkahkan harta itu, kemudian menjadi sesalan bagi mereka, dan mereka akan dikalahkan. Dan ke dalam Jahannamlah orang-orang yang kafir itu dikumpulkan,\" –Al-Anfal:36-"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 117: Bandingan sesuatu yang me-lreka belanjakan di penghidupan du-lnia ini, adalah seperti angin, beserta dingin keras, mengenai tanaman-tanaman kaum yang telah menganiaya diri sendiri, lalu angin itu mem-binasakan dia, dan Allah tidak menganiaya mereka, tetapi mereka menganiaya diri mereka sendiri."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni orang-orang kafir. Untuk menghalangi manusia dari jalan Allah dan memadamkan cahaya Allah . Dengan kekafiran dan kemaksiatan. Sehingga tanaman itu tidak dapat diambil manfaatnya. Demikian juga harta yang mereka keluarkan tersebut akan sia-sia tidak ada manfaatnya. Mereka hanya memperoleh kelelahan, kerugian dan kekecewaan. Dengan menjadikan infak mereka sia-sia. Dengan kekafiran yang menjadikannya sia-sia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 117",
    "description": "Perumpamaan harta yang mereka infakkan baik secara ikhlas tapi tanpa dilandasi iman yang benar atau karena mencari popularitas di mata manusia di dalam kehidupan dunia ini, adalah ibarat angin yang mengandung hawa yang sangat dingin, yang menimpa tanaman yang siap dipanen, milik suatu kaum yang menzalimi diri sendiri, karena tidak beriman kepada Allah dan hari akhir, lalu angin itu merusaknya, sehingga tanaman yang siap dipanen tersebut seolah hangus terbakar dan pemiliknya tidak sedikit pun mendapatkan hasil. Karena tujuan infak mereka adalah popularitas, maka itulah yang mereka dapatkan. Dengan demikian Allah tidak menzalimi mereka, tetapi mereka yang menzalimi diri sendiri karena mereka hanya memburu kehidupan duniawi dan tidak percaya kepada kehidupan ukhrawi. Setelah pada ayat sebelumnya Allah menjelaskan bahwa amal perbuatan orang kafir tidak akan mendatangkan kebaikan karena tidak dilandasi keimanan, maka pada ayat ini Allah memperingatkan umat islam agar tidak menjadikan orang kafir sebagai orang kepercayaan, karena mereka akan berkhianat. Wahai orang-orang yang beriman! janganlah kamu menjadikan orang-orang yang di luar kalanganmu, yaitu orang-orang yang tidak beriman atau beriman tidak secara benar seperti orang-orang munafik, sebagai teman kepercayaanmu, sehingga kamu membocorkan rahasiamu, karena mereka tidak henti-hentinya menyusahkan dan menimbulkan kemudaratan atas kamu. Mereka berbuat itu karena mengharapkan kehancuranmu yang diawali dengan perpecahan dan bercerai-berai."
  }
]