[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang beriman kepada Allah dan mengikuti RasulNya serta melaksanakan SyariatNya, janganlah kalian mengangkat orang-orang kafir sebagai orang-orang yang kalian berikan loyalitas selain kaum Mukminin, yang kalian bocorkan kepada mereka rahasia-rahasia kalian. Orang-orang itu tidak pernah kendur semangat untuk merusak keadaan kalian, dan mereka amat senang apa yang menimpa kalian berupa keburukan dan kekalahan. Dan sesungguhnya besarnya kebencian mereka sudah tampak dalam bahasa lisan mereka, dan apa yang dirahasiakan hati-hati mereka berupa api permusuhan lebih besar dan lebih parah. Dan sungguh Allah telah menjelskan kepada kalian bukti-bukti nyata dan hujjah-hujjah agar kalian memperoleh nasihat dan bersikap waspada bila kalian memang orang-orang yang memahami nasihat-nasihat dari Allah, perintah dan larangan Nya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "118. Wahai orang-orang yang beriman, janganlah kalian menjadikan orang-orang yang tidak beriman sebagai kawan dekat atau teman setia yang kalian beritahu perihal rahasia-rahasia dan urusan-urusan pribadi kalian. Karena mereka tidak pernah berhenti mengupayakan kehancuran dan kerusakan perkara kalian. Mereka senantiasa mengharapkan terjadinya sesuatu yang merugikan dan menyulitkan kalian. Rasa benci dan permusuhan terlihat jelas melalui ucapan-ucapan mereka yang menjelek-jelekkan agama kalian, mengadu domba kalian, dan menyebarkan rahasia-rahasia kalian. Tetapi kebencian yang mereka sembunyikan di dalam dada mereka jauh lebih besar. Kami telah menjelaskan kepada kalian -wahai orang-orang mukmin bukti-bukti nyata yang menunjukkan kemaslahatan kalian di dunia dan di akhirat, jika kalian memahami apa yang Rabb kalian turunkan kepada kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "118. Allah menyeru dan memperingatkan orang-orang beriman: “Janganlah kalian menjadikan orang-orang yang tidak beriman sebagai teman dan sahabat yang kalian percayakan kepada mereka rahasia kalian; sebab mereka tidak pernah menyerah untuk merusak urusan kalian, mereka sangat ingin membahayakan kalian, telah nampak dari lidah mereka tanda-tanda kebencian, dan kebencian yang mereka sembunyikan dalam hati mereka lebih besar lagi. Kami telah menjelaskan kepada kalian berbagai hujjah jika kalian memahami perintah dan anjuran Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "118. لَا تَتَّخِذُوا۟ بِطَانَةً (janganlah kamu ambil menjadi teman kepercayaanmu) Makna (البطانة) adalah orang kepercayaan yang dijadikan tempat untuk menyimpan rahasianya sehingga dapat mengetahui rahasianya dan perihal urusannya. مِّن دُونِكُمْ (orang-orang yang, di luar kalanganmu) Yakni yang selain orang Islam, yaitu orang-orang kafir. لَا يَأْلُونَكُمْ خَبَالًا (mereka tidak henti-hentinya (menimbulkan) kemudharatan bagimu) Yakni mereka tidak lalai sedikitpun dalam menjalankan apa yang dapat merusak kalian. Dan makna (الخبال) adalah kerusakan dalam perbuatan, badan, dan akal. وَدُّوا۟ مَا عَنِتُّمْ (Mereka menyukai apa yang menyusahkan kamu) Yakni menyukai untuk kalian apa yang terdapat didalamnya kesusahan dan mara bahaya bagi kalian. قَدْ بَدَتِ الْبَغْضَآءُ (Telah nyata kebencian) Makna (البغضاء) yakni kemurkaan yang sangat, dan ini telah terlihat dari perkataan mereka karena besarnya kedengkian mereka. Dan lisan mereka menunjukkan apa yang ada dalam hati mereka maka mereka tidak melakukan taqiyyah dan secara terus terang melakukan pendustaan. Dan terlihat dari kesalahan bicara mereka apa yang menyingkap kebusukan batin mereka. وَمَا تُخْفِى صُدُورُهُمْ أَكْبَرُ ۚ (dan apa yang disembunyikan oleh hati mereka adalah lebih besar lagi) Yakni salah ucap yang keluar dari lisan mereka sangatlah ringan jika dibandingkan dengan apa yang ada dalam hati mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Orang-orang munafiq malu dan menyembunyikan kebencian dan tipu daya mereka terhadap kaum muslimin, tetapi ketergelinciran lisan mereka yang mengungkapkan, dan apa yang nampak dari diri mereka sendiri, dan pada diri mereka tidak ada ketaqwaan dan kesabaran yang dapat melindungi dari gunjingan dan keusilan mereka : { وَإِنْ تَصْبِرُوا وَتَتَّقُوا لَا يَضُرُّكُمْ كَيْدُهُمْ شَيْئًا } \"Jika kamu bersabar dan bertakwa, niscaya tipu daya mereka sedikitpun tidak mendatangkan kemudharatan kepadamu\" [Ali-Imran : 120]."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "118 Hai orang-orang yang beriman, janganlah orang-orang di luar Islam kamu jadikan teman kepercayaanmu. Sebab mereka tidak henti-hentinya menimbulkan kemudharatan bagimu. Khabal adalah kerusakan akal, badan dan kelakuan. Bahkan mereka ingin menyakiti kalian dengan sungguh-sungguh. Mereka menyukai segala yang dapat menyusahkan kamu. Telah nyata kebencian dari mulut mereka dengan memusuhi kalian dan menyebarkan rahasia kalian. Dan apa yang disembunyikan oleh hati mereka berupa kedengkian dan permusuhan adalah lebih besar lagi. Permusuhan yang mereka sembunyikan lebih mengerikan daripada yang mereka tampakkan. Sungguh telah Kami terangkan kepadamu ayat-ayat Kami yang menunjukkan permusuhan mereka kepada kalian, jika kalian mau memahami dan mengambil pelajaran darinya. Ibnu Abbas berkata: Ada sekelompok orang muslim yang berteman dengan sekelompok orang Yahudi. Di antara mereka telah ada sumpah dan hubungan kedekatan pada masa Jahiliyyah. Kemudian Allah menurunkan ayat ini untuk mereka, sebagai pencegahan kepada mereka untuk menjadikan mereka teman kepercayaan dengan dasar menjauhi fitnah dari mereka: Wahai orang-orang yang beriman janganlah kalian menjadikan orang-orang di luar kalian sebagai teman kepercayaan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, janganlah kalian mengambil teman kepercayaan dari orang-orang di luar kalian} pelindung dan teman selain orang-orang muslim yang mana kalian bisa menunjukkan rahasia-rahasia kalian {mereka tidak henti-hentinya (mendatangkan) kemudaratan bagi kalian} mereka tidak berhenti menghancurkan keadaan kalian {Mereka menginginkan apa yang menyusahkan kalian} mereka mengharapkan sesuatu yang bisa menghancurkan kalian {Sungguh telah nyata kebencian} tampak permusuhan {dari mulut mereka dan apa yang mereka sembunyikan dalam hati itu lebih besar} lebih besar {Sungguh Kami telah menerangkan kepada kalian ayat-ayat, jika kalian berpikir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "118-119. Ini adalah peringatan Allah untuk hamba-hambaNya dari tindakan mengangkat orang-orang kafir sebagai pemimpin mereka, menjadikan mereka sahabat-sahabat terpercaya, dan teman-teman dekat, menampakkan dan membuka rahasia-rahasia kaum Mukminin kepada mereka. Lalu Allah menjelaskan kepada hamba-hambaNya yang beriman tentang perkara-perkara yang mengharuskan mereka berlepas diri dari tindakan menjadikan orang-orang kafir itu sebagai sahabat terpercaya, karena mereka “tidak henti-hentinya (menimbulkan) kemudaratan bagimu.” Mereka berusaha tanpa pernah lelah, dalam mengakibatkan kebencian dari perkataan dan ketergelinciran lisan mereka. Kebencian dan permusuhan yang disembunyikan oleh hati mereka “adalah lebih besar lagi” daripada sesuatu yang dinampakkan oleh mereka berupa perkataan maupun perbuatan mereka. Bila kalian mempunyai pemahaman dan akal pikiran, maka sungguh Allah telah menjelaskan bagi kalian perkara mereka. Lalu apa faktor yang mengharuskan untuk mencintai mereka dan menjadikan mereka sebagai pemimpin-pemimpin atau teman-teman terpercaya, padahal kalian mengetahui adanya penyimpangan agama yang besar pada mereka dan juga pada balasan kebaikan kalian terhadap mereka? Kalian itu adalah orang-orang yang istiqamah berpegang teguh pada agama-agama para rasul. Kalian beriman kepada semua rasul yang diutus oleh Allah dan kepada setiap kitab yang diturunkan olehNya, sedang mereka mengingkari kitab yang diturunkan olehNYa, sedang mereka mengingkari kitab yang paling utama dan Rasul yang paling mulia. Kalian memberikan mereka (semua) cinta dan kasih sayang yang sama sekali mereka tidak memberikan imbalan minimal yang setimpal untuk kalian. Lalu bagaimana bisa kalian mencintai mereka sedang mereka tidak mencintai kalian? Dan bila mereka menjumpai kalian, “mereka berkata, ‘Kami beriman,’ dan apabila mereka menyendiri” bersama fdengan kelompok mereka sendiri, “mereka mengigit ujung jari” disebabkan karena kemarahan yang besar dan kebencian mereka terhadap kalian dan agama kalian. Allah berfirman, “katakanlah (kepada mereka), ‘Matilah kamu karena kemarahan itu’.” Maksudnya, kalian akan menyaksikan kemuliaan Islam dan kehinaan kufur yang akan membuat kalian mendapatkan keburukan, dan kalian meninggal disebabkan amarah kalian sehingga kalian tidak mendapatkan penawar untuknya seperti yang kalian inginkan. “sesungguhnya Allah mengetahui segala isi hati.” Karena itu allah menjelaskan kepada hamba-hambaNya yang Mukmin apa yang dikandung oleh hati musuh-musuh agama dari orang-orang kafir dan munafik."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 118: Hai orang-orang yang beriman! Janganlah kamu anggap seba-gai sahabat karib lain daripada (golongan) kamu; mereka tidak putus-putus (berikhtiar) menarik kecelakaan atas kamu; mereka suka apa-apa yang menyusahkan kamu; sesungguhnya ke bencian telah terbit dari mulut mereka; tetapi apa yang disembunyikan oleh hati mereka, ada lebih besar. Kami telah terangkan tanda-tanda kepada kamu, jika kamu (mau) berfikir."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Seperti orang-orang Yahudi, Nasrani dan kaum munafik. Demikian juga dilarang memberikan jabatan kepada mereka dalam urusan kaum muslimin. Pernah dikatakan kepada Umar bin Khaththab, \"Sesungguhnya di sini ada seorang pemuda dari penduduk Hirah yang sanggup menjaga dan mampu menulis\", maka Umar berkata, \"Kalau demikian, maka saya sama saja telah mengambil teman kepercayaan selain orang mukmin.\" Dengan membicarakan mereka dan menyampaikan rahasia mereka kepada kaum musyrikin. Berupa permusuhan. Yang di sana terdapat hal yang bermaslahat bagi kamu baik bagi agama maupun dunia kamu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 118",
    "description": "Setelah pada ayat sebelumnya Allah menjelaskan bahwa amal perbuatan orang kafir tidak akan mendatangkan kebaikan karena tidak dilandasi keimanan, maka pada ayat ini Allah memperingatkan umat islam agar tidak menjadikan orang kafir sebagai orang kepercayaan, karena mereka akan berkhianat. Wahai orang-orang yang beriman! janganlah kamu menjadikan orang-orang yang di luar kalanganmu, yaitu orang-orang yang tidak beriman atau beriman tidak secara benar seperti orang-orang munafik, sebagai teman kepercayaanmu, sehingga kamu membocorkan rahasiamu, karena mereka tidak henti-hentinya menyusahkan dan menimbulkan kemudaratan atas kamu. Mereka berbuat itu karena mengharapkan kehancuranmu yang diawali dengan perpecahan dan bercerai-berai. Beginilah kamu, wahai umat islam! kamu salah telah menyukai mereka lantaran sikap manis mereka yang pura-pura, padahal mereka tidak menyukaimu karena agama dan pandangan hidupmu tidak sama dengan mereka, dan kamu beriman kepada semua kitab termasuk kitab yang diturunkan kepada nabi mereka, padahal mereka beriman hanya kepada sebagian isi kitab yang diturunkan kepada nabi mereka dan mengingkari kerasulan nabi Muhammad dan kebenaran Al-Qur'an. Apabila sebagian dari mereka berjumpa kamu, mereka berkata, kami beriman, padahal ucapan itu hanya untuk menipu kamu. Hal tersebut terbukti apabila mereka menyendiri berada di belakangmu dan jauh dari kamu, mereka menggigit ujung jari karena marah yang mencapai puncaknya dan disertai rasa benci kepadamu karena kamu beriman kepada Allah dan kerasulan nabi Muhammad. Mereka berharap agar nikmat iman itu lenyap dari kamu. Katakanlah kepada mereka, matilah kamu karena kemarahanmu itu, yaitu marahlah dan bencilah kami sampai kamu mati! sungguh, Allah maha mengetahui segala isi hati, mengetahui kebencianmu, kemarahanmu, kedengkianmu dan kebohonganmu kepada kami."
  }
]