[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Itulah bukti nyata yang menunjukan kesalahan kalian dalam mencintai mereka. Kalian mencintai dan berbuat baik pada mereka, sedangkan mereka itu tidak mencintai kalian dan justru membawa rasa permusuhan dan kebencian terhadap kalian; kalian mengimani semua kitab suci yang diturunkan, termasuk kitab suci mereka; sedangkan mereka tidak mengimani kitab suci kalian, maka bagaimana mungkin kalian menyukai mereka?! Apabila berjumpa dengan kalian mereka berkata dengan segala kemunafikan mereka, “Kami beriman dan membenarkan.” Apabaila mereka saling menyendiri dengan sebagian yang lain, maka tampak dari mereka kegelisahan dan kesedihan, lalu mereka pun menggigit ujung-ujung jari mereka karena kebencian, disebabkan mereka melihat keakraban kaum muslimin dan kepaduan persatuan mereka, kekokohan islam dan kehinaan mereka dengan islam. Katakanlah oleh mu (wahai Rasul) kepada mereka, “Matilah kalian dengan kegelisahan dan kesedihan kalian.” Sesungguhnya Allah mengetahui apa yang disembunyikan oleh hati sanubari (kalian), dan akan memberikan balasan kepada masing-masing orang terhadap apa yang mereka usahakan, yang baik ataupun yang buruk."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "119. Sedangkan kalian -wahai orang-orang mukmin- mencintai orang-orang (yang tidak beriman) dan berharap kebaikan untuk mereka, tetapi mereka tidak mencintai kalian dan tidak berharap kebaikan untuk kalian, bahkan mereka membenci kalian. Dan kalian beriman kepada semua kitab suci yang ada -termasuk kitab suci mereka-, sedangkan mereka tidak beriman kepada kitab suci yang Allah turunkan kepada Nabi kalian. Apabila mereka berjumpa dengan kalian, mereka mengatakan dengan lisan mereka, “Kami percaya”. Tetapi apabila mereka berkumpul dengan sesama mereka, mereka menggigit ujung jari karena kesal dan geram melihat kesatuan dan persatuan kalian dan menyaksikan kejayaan Islam, sedangkan mereka berada di dalam kehinaan dan kekalahan. Katakanlah -wahai Nabi- kepada orang-orang tersebut, “Bertahanlah dengan keadaan kalian itu sampai kalian mati karena kesal dan marah. Sesungguhnya Allah Maha Mengetahui apa yang tersimpan di dalam dada, baik berupa keimanan maupun kekafiran, kebaikan maupun keburukan”."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "119. Allah memperingatkan orang-orang beriman yang terjerumus dalam persahabatan dengan orang-orang munafik yang menampakkan keimanan sehingga orang-orang beriman mencintai mereka, namun mereka tidak mencintai orang-orang beriman: Hai orang-orang beriman, kalian beriman kepada seluruh kitab yang diturunkan Allah, namun mereka tidak beriman kepada kitab yang diturunkan kepada kalian, jika mereka bertemu dengan kalian maka mereka menyatakan keimanan dengan lidah mereka; namun jika mereka berkumpul sesama mereka, mereka menyesal dan menggigit ujung jari jemari mereka karena kedengkian dan kemurkaan akibat melihat kekuatan kaum muslimin. Kemudian Allah memerintahkan Rasulullah agar berdoa untuk kebinasaan mereka akibat kedengkian yang mereka alami. Sungguh Allah Maha Mengetahui apa yang mereka sembunyikan dalam dada."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "119. هٰٓأَنتُمْ أُو۟لَآءِ (Beginilah kamu) Yakni Hai orang-orang yang menjadikan mereka orang-orang terpercaya bagi kalian. تُحِبُّونَهُمْ (kamu menyukai mereka) Yakni kalian menyukai mereka. وَلَا يُحِبُّونَكُمْ (padahal mereka tidak menyukai kamu) Yakni disebabkan kebencian dan kedengkian yang telah mengusai hati mereka. وَتُؤْمِنُونَ بِالْكِتٰبِ كُلِّهِۦ (dan kamu beriman kepada kitab-kitab semuanya) Yakni padahal kalian beriman kepada semua kitab Allah yang termasuk didalamnya adalah kitab yang diturunkan kepada mereka, lalu mengapa kalian mencintai mereka padahal mereka tidak beriman kepada kitab kalian. وَإِذَا لَقُوكُمْ قَالُوٓا۟ ءَامَنَّا (Apabila mereka menjumpai kamu, mereka berkata “Kami beriman”) Yakni sebagai bentuk taqiyyah dan kemunafikan. وَإِذَا خَلَوْا۟ عَضُّوا۟ عَلَيْكُمُ الْأَنَامِلَ مِنَ الْغَيْظِ ۚ (dan apabila mereka menyendiri, mereka menggigit ujung jari antaran marah bercampur benci terhadap kamu) Yakni sebagai bentuk penyesalan karena mereka gagal untuk membalas dendam dari kalian. قُلْ مُوتُوا۟ بِغَيْظِكُمْ ۗ (Katakanlah (kepada mereka): “Matilah kamu karena kemarahanmu itu”) Yakni sesungguhnya Allah menyempurnakan kenikmatan atas orang-orang beriman dan memenangkan agama-Nya, maka tambahlah kebencian kalian hingga kalian mati karenanya. إِنَّ اللهَ عَلِيمٌۢ بِذَاتِ الصُّدُورِ (Sesungguhnya Allah mengetahui segala isi hati) Yakni segala besitan yang ada di dalam hati."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Orang-orang yang dengki terhadapmu akan terus bertamba seiring dengan bertambahnya kebaikan yang kamu persembahkan untuk kaummu, yaitu berupa kenikmatan yang dikaruniakan oleh Allah kepadamu, maka janganlah kamu bersedih, karena sesungguhnya persitiwa itu merupakan ketentuan yang akan terus berlanjut { أَمْ يَحْسُدُونَ النَّاسَ عَلَىٰ مَا آتَاهُمُ اللَّهُ مِنْ فَضْلِهِ } \"ataukah mereka dengki kepada manusia (Muhammad) lantaran karunia yang Allah telah berikan kepadanya? \" [an-Nisa : 54 ], dan hal yang paling besar yang akan memuat hati mereka marah dan benci terhadapmu, adalah ketika kamu tetap berjalan di atas jalan yang kamu yakini tanpa kamu menoleh kepada mereka sedikitpun, dan sesungguhnya Allah akan memeliharamu dari mereka : { قُلْ مُوتُوا بِغَيْظِكُمْ ۗ إِنَّ اللَّهَ عَلِيمٌ بِذَاتِ الصُّدُورِ , إِنْ تَمْسَسْكُمْ حَسَنَةٌ تَسُؤْهُمْ وَإِنْ تُصِبْكُمْ سَيِّئَةٌ يَفْرَحُوا بِهَا ۖ وَإِنْ تَصْبِرُوا وَتَتَّقُوا لَا يَضُرُّكُمْ كَيْدُهُمْ شَيْئًا ۗ إِنَّ اللَّهَ بِمَا يَعْمَلُونَ مُحِيطٌ } \"Katakanlah (kepada mereka): “Matilah kamu karena kemarahanmu itu”. Sesungguhnya Allah mengetahui segala isi hati , Jika kamu memperoleh kebaikan, niscaya mereka bersedih hati, tetapi Jika kamu mendapat bencana, mereka bergembira karenanya. Jika kamu bersabar dan bertakwa, niscaya tipu daya mereka sedikitpun tidak mendatangkan kemudharatan kepadamu. Sesungguhnya Allah mengetahui segala apa yang mereka kerjaka\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "119 Wahai orang-orang beriman yang menjadikan orang di luar kalian sebagai teman kepercayaan. Kalian sungguh menyukai dan mencintai mereka, padahal mereka tidak menyukai dan juga tidak mencintai kalian. Bahkan mereka memendam permusuhan kepada kalian. Padahal kamu beriman kepada kitab-kitab Allah yang diturunkan kepada para nabi-Nya. Di antara kitab-kitab itu adalah kitab yang diturunkan kepada mereka, namun mereka kafir kepada kitab yang diturunkan kepada kalian. Apabila mereka menjumpai kamu, mereka berkata kepada kalian dengan penuh kemunafikan “Kami beriman kepada risalah nabi kalian” , dan apabila mereka bersama golongan mereka menggigit semua jari mereka, yaitu sebagai ungkapan kinayah atas besarnya raasa benci mereka terhadap kekuatan dan persatuan orang mukmin. Juga rasa saling mengerti dan maaf antara orang mukmin, sehingga sulit sekali untuk menikam kalian. Katakanlah kepada mereka mereka wahai Nabi: “Matilah kamu karena kemarahanmu itu, atau begitulah sampai kalian mati”. Sesungguhnya Allah mengetahui segala isi hati yang penuh dengan keburukan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Begitulah kalian} wahai orang-orang mukmin {kalian menyukai mereka, padahal mereka tidak menyukai kaliab, dan kalian beriman pada semua kitab} dengan semua kitab {Apabila mereka berjumpa dengan kalian, mereka berkata, “Kami beriman.” Apabila mereka menyendiri} menyendiri dengan sebagian dari mereka {mereka menggigit ujung jari} ujung jari-jari {karena murka. Katakanlah, “Matilah kalian karena kemurkaan kalian itu”} tetaplah kalian dalam kemurkaan kalian sampai kalian mati {Sesungguhnya Allah Maha Mengetahui segala isi hati"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "118-119. Ini adalah peringatan Allah untuk hamba-hambaNya dari tindakan mengangkat orang-orang kafir sebagai pemimpin mereka, menjadikan mereka sahabat-sahabat terpercaya, dan teman-teman dekat, menampakkan dan membuka rahasia-rahasia kaum Mukminin kepada mereka. Lalu Allah menjelaskan kepada hamba-hambaNya yang beriman tentang perkara-perkara yang mengharuskan mereka berlepas diri dari tindakan menjadikan orang-orang kafir itu sebagai sahabat terpercaya, karena mereka “tidak henti-hentinya (menimbulkan) kemudaratan bagimu.” Mereka berusaha tanpa pernah lelah, dalam mengakibatkan kebencian dari perkataan dan ketergelinciran lisan mereka. Kebencian dan permusuhan yang disembunyikan oleh hati mereka “adalah lebih besar lagi” daripada sesuatu yang dinampakkan oleh mereka berupa perkataan maupun perbuatan mereka. Bila kalian mempunyai pemahaman dan akal pikiran, maka sungguh Allah telah menjelaskan bagi kalian perkara mereka. Lalu apa faktor yang mengharuskan untuk mencintai mereka dan menjadikan mereka sebagai pemimpin-pemimpin atau teman-teman terpercaya, padahal kalian mengetahui adanya penyimpangan agama yang besar pada mereka dan juga pada balasan kebaikan kalian terhadap mereka? Kalian itu adalah orang-orang yang istiqamah berpegang teguh pada agama-agama para rasul. Kalian beriman kepada semua rasul yang diutus oleh Allah dan kepada setiap kitab yang diturunkan olehNya, sedang mereka mengingkari kitab yang diturunkan olehNYa, sedang mereka mengingkari kitab yang paling utama dan Rasul yang paling mulia. Kalian memberikan mereka (semua) cinta dan kasih sayang yang sama sekali mereka tidak memberikan imbalan minimal yang setimpal untuk kalian. Lalu bagaimana bisa kalian mencintai mereka sedang mereka tidak mencintai kalian? Dan bila mereka menjumpai kalian, “mereka berkata, ‘Kami beriman,’ dan apabila mereka menyendiri” bersama fdengan kelompok mereka sendiri, “mereka mengigit ujung jari” disebabkan karena kemarahan yang besar dan kebencian mereka terhadap kalian dan agama kalian. Allah berfirman, “katakanlah (kepada mereka), ‘Matilah kamu karena kemarahan itu’.” Maksudnya, kalian akan menyaksikan kemuliaan Islam dan kehinaan kufur yang akan membuat kalian mendapatkan keburukan, dan kalian meninggal disebabkan amarah kalian sehingga kalian tidak mendapatkan penawar untuknya seperti yang kalian inginkan. “sesungguhnya Allah mengetahui segala isi hati.” Karena itu allah menjelaskan kepada hamba-hambaNya yang Mukmin apa yang dikandung oleh hati musuh-musuh agama dari orang-orang kafir dan munafik."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 119: Kamu ini ialah orang-orang yang kasih kepada mereka, padahal mereka tidak kasih kepada kamu; dan kamu beriman kepada (isi) Kitab itu, apabila bertemu kamu, nya, padahal mereka berkata: \"Kami telah tetapi apabila mereka beriman berpisah (dari kamu), mereka mengajari lantaran geram bercampur benci kepada kamu. Katakan: \"Maalah dengan kegeraman kamu yang bercampur kebencian itu,\" sesungguhnya Allah amat Mengetahui apa-apa yang ada di dada-dada"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Karena hubungan kerabat dan kawan. Karena mereka menyelisihi agama kamu. Sedangkan mereka tidak beriman kepada kitabmu. Karena melihat persatuan kamu. Dalam ayat ini terdapat berita gembira bagi kaum mukmin, bahwa mereka yang hendak menimpakan bahaya kepada kaum mukmin sebenarnya hanya menimpakan bahaya kepada diri mereka sendiri, kemarahan mereka tidak dapat mereka wujudklan, bahkan mereka senantiasa tertekan karena kemarahan tersebut yang dapat membawa mereka kepada kematian, sehingga mereka berpindah dari kesengsaraan dunia menuju kesengsaraan akhirat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 119",
    "description": "Beginilah kamu, wahai umat islam! kamu salah telah menyukai mereka lantaran sikap manis mereka yang pura-pura, padahal mereka tidak menyukaimu karena agama dan pandangan hidupmu tidak sama dengan mereka, dan kamu beriman kepada semua kitab termasuk kitab yang diturunkan kepada nabi mereka, padahal mereka beriman hanya kepada sebagian isi kitab yang diturunkan kepada nabi mereka dan mengingkari kerasulan nabi Muhammad dan kebenaran Al-Qur'an. Apabila sebagian dari mereka berjumpa kamu, mereka berkata, kami beriman, padahal ucapan itu hanya untuk menipu kamu. Hal tersebut terbukti apabila mereka menyendiri berada di belakangmu dan jauh dari kamu, mereka menggigit ujung jari karena marah yang mencapai puncaknya dan disertai rasa benci kepadamu karena kamu beriman kepada Allah dan kerasulan nabi Muhammad. Mereka berharap agar nikmat iman itu lenyap dari kamu. Katakanlah kepada mereka, matilah kamu karena kemarahanmu itu, yaitu marahlah dan bencilah kami sampai kamu mati! sungguh, Allah maha mengetahui segala isi hati, mengetahui kebencianmu, kemarahanmu, kedengkianmu dan kebohonganmu kepada kami. Jika mereka yang berhati dengki itu melihat kamu memperoleh kebaikan, kemenangan perang, rezeki yang melimpah, kesehatan dan kemuliaan, niscaya mereka bersedih hati bahkan hal tersebut membuat mereka marah, tetapi jika kamu tertimpa bencana, seperti sakit, kemiskinan atau kalah perang, maka mereka bergembira karenanya. Allah memberi umat islam tuntunan agar tetap bersabar dan bertakwa kepada Allah ketika menghadapi orang yang bersifat demikian. Karena jika kamu bersabar tidak terbawa hawa nafsu untuk membalasnya dengan perbuatan jahat, dan bertakwa kepada Allah dengan tetap istikamah dalam bersabar, maka tipu daya mereka tidak akan menyusahkan dan mendatangkan bahaya bagi kamu sedikit pun. Sungguh, Allah maha meliputi segala apa yang mereka kerjakan dan maha mengetahui tipu daya yang mereka rahasiakan."
  }
]