[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah oleh mu (wahai rasul), kepada orang-orang yang kafir dari golongan yahudi dan kaum lainnya, serta orang-orang yang enggan untuk membelamu (dalam perang badar), “sesungguhnya kalian akan disiksa di dunia dan akan dimatikan dalam kekufuran dan akan dikumpulkan ke neraka jahanam, agar mereka itu menjadi tempat tinggal bagi kalian selama lamanya, dan itu adalah seburuk-buruk tempat tinggal.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Katakanlah -wahai Rasul- kepada orang-orang kafir -apapun agama mereka-, “Kalian akan dikalahkan oleh orang-orang mukmin. Kalian akan mati dalam kekafiran, dan kalian akan dikumpulkan oleh Allah di dalam neraka Jahanam yang merupakan tempat berbaring terburuk bagi kalian.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "12. Allah memberi kabar gembira bagi Muhammad dan memberi ancaman bagi orang-orang kafir: katakanlah kepada mereka hai Muhammad: “kalian akan dikalahkan di dunia, kemudian dikumpulkan dan digiring menuju neraka Jahannam yang menjadi tempat tinggal kalian, sungguh itu adalah seburuk-buruk tempat tinggal."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "12. قُل لِّلَّذِينَ كَفَرُوا۟ (Katakanlah kepada orang-orang yang kafir ) Ada pendapat mengatakan mereka adalah orang-orang Yahudi. Dan pendapat lain mengatakan mereka adalah orang-orang musyrik Makkah. سَتُغْلَبُونَ ( Kamu pasti akan dikalahkan) Dan Allah telah menepati janjinya ini dengan dibinasakannya Bani Qiraidhah dan diusirnya Bani Nadhir, ditakhlukkannya Khaibar dan diusirnya penghuninya dan para Ahli kitab yang lain dari Jazirah Arab, dan diwajibkannya membayar jizyah atas orang-orang Yahudi lainnya. Segala puji bagi Allah. وَتُحْشَرُونَ إِلَىٰ جَهَنَّمَ ۚ وَبِئْسَ الْمِهَادُ (dan akan digiring ke dalam neraka Jahannam, Dan itulah tempat yang seburuk-buruknya) Yakni seburuk-buruk tempat menetap bagi mereka adalah neraka Jahannam."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12. Wahai nabi, katakanlah kepada orang-orang kafir dari golongan orang Yahudi, orang-orang musyrik Mekah, dan kaum lainnya bahwa mereka akan dikalahkan di dunia, dan pada hari kiamat mereka akan dikumpulkan dalam neraka Jahanam. Amat buruk tempat tinggal yang mereka datangi itu. Ayat ini dan setelahnya diturunkan untuk orang Yahudi setelah berakhirnya perang badar ketika mereka berkata: “Wahai Muhammad, jangan sekali-kali dirimu terperdaya karena berhasil membunuh beberapa orang Quraisy yang mana mereka tidak ahli dan tidak mengerti cara berperang. Demi Allah, sesungguhnya jika kamu membunuh kami, maka kamu akan mengerti bahwa kami adalah manusia biasa dan kamu tidak akan pernah bertemu dengan manusia seperti kami”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah kepada orang-orang yang kafir, “Kalian akan dikalahkan} akan dihancurkan {dan digiring} dikumpulkan {ke dalam neraka Jahanam. Itulah seburuk-buruk tempat tinggal”} tempat peristirahatan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "12-13. Ayat ini merupakan informasi dan kabar gembira bagi kaum Mukminin, dan ancaman bagi orang-orang kafir, yakni bahwasanya mereka akan dikalahkan di dunia ini. Dan terbukti benar telah terjadi sesuai dengan yang Allah kabarkan, di mana mereka telah dikalahkan dengan kekalahan yang tidak ada tandingan dan tidak ada yang setara dengannya. Allah menjadikan apa yang terjadi dalam peperangan Badar sebagai tanda-tandaNYa yang menunjukkan atas kebenaran RasulNya, dan bahwa beliau berada di atas kebenaran sedangkan sedangkan musuh-musuhnya berada di atas kebatilan, di mana kedua pasukan bertemu dengan jumlah pasukan kaum Muslimin yang hanya mencapai tiga ratus sekian belas orang ditambah dengan peralatan yang sedikit, dan pasukan kaum kafir yang mencapai seribu orang ditambah dengan persiapan mereka yang sempurna dalam persenjataan dan lain-lainnya. Namun Allah membela kaum Mukminin dengan pertolonganNya hingga mereka mampu mengalahkan kaum kafir dengan izin Allah. Ayat ini mengandung pelajaran bagi orang-orang yang memiliki mata hati, bahwa sekiranya ini bukan kebenaran yang apabila menghadapi kebatilan pasti akan melenyapkan dan merendahkannya, maka pastilah, jika diukur dari sebab-sebab yang kongkret, kenyataannya akan terbalik."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 12: Katakanlah kepada orang-orang kafir itu: \"Kamu akan dikalahkan bahkan ke jahannam; dan (yaitu) sejahat-jahat tempat yang disediakan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini turun ketika Nabi Muhammad shallallahu 'alaihi wa sallam memerintahkan orang-orang Yahudi masuk Islam sepulang Beliau dari peperangan Badar, lalu mereka mengatakan, \"Janganlah sekali-kali membuat anda terpedaya karena berhasil membunuh beberapa orang Quraisy yang tidak ahli dan tidak mengenal taktik perang\". Baik dengan dibunuh, ditawan maupun dengan ditetapkan membayar jizyah (pajak), dan hal itu telah terjadi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 12",
    "description": "Jika fir'aun dan rezimnya yang sangat berkuasa dan gagah perkasa saja dapat dikalahkan dan mendapat siksa duniawi dan ukhrawi, apa-lagi orang yang tidak mencapai tingkat keperkasaan semacam itu. Karena itu, katakanlah, wahai nabi Muhammad, kepada orang-orang yang kafir dari kalangan yahudi dan lainnya yang memandang kemenanganmu di perang badar dengan sebelah mata, kamu pasti akan dikalahkan di dunia dan mati dalam keadaan kafir, kemudian digiring ke dalam neraka jahanam sebagai tempat tinggal kamu. Dan itulah seburuk-buruk tempat tinggal. Kamu pasti akan dikalahkan! salah satu buktinya adalah apa yang diuraikan oleh ayat ini, yaitu sungguh, telah ada tanda bagi kamu pada dua golongan yang berhadap-hadapan, yakni bertempur di dalam perang badar pada tahun kedua hijriah. Yang pertama, satu golongan mukmin berperang di jalan Allah, yaitu nabi Muhammad dan para sahabatnya, dan yang lain golongan kafir yang berperang di jalan kebatilan yang melihat dengan mata kepala, bahwa jumlah pasukan mereka, yakni golongan muslim, dua kali lipat mereka, sehingga hati mereka menjadi gentar. Ini menjadi faktor penyebab kemenangan kaum muslim. Allah menguatkan dengan pertolongan-Nya bagi siapa yang dia kehendaki. Sungguh, pada yang demikian itu terdapat pelajaran yang berharga bagi orang-orang yang mempunyai penglihatan mata hati yang dapat menangkap hikmah di balik setiap peristiwa."
  }
]