[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Di antara bentuk permusuhan mereka bahwa sesungguhnya kalian (wahai orang-orang mukmin), jika terjadi kepada kalian peristiwa yang baik, seperti kemenangan dan memperoleh harta rampasan, maka tampak jelas pada mereka duka-lara dan kesedihan. Dan apabila terjadi hal-hal buruk pada kalian, berupa kekalahan, berkurangnya harta benda, jiwa dan hasil panen buah-buahan, maka mereka bergembira ria dengan hal tersebut. Apabila kalian sabar terhadap apa yang menimpa kalian dan kalian bertakwa kepada Allah dalam perkara yang Allah memerintahkan kalian untuk melakukannya dan perkara yang Allah larang kalian darinya, maka gangguan dari makar mereka tidak akan memudaratkan kalian. Dan Allah meliputi seluruh kerusakan yang diperbuat oleh orang-orang kafir dan akan membalas mereka atas hal itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "120. Apabila kalian -wahai orang-orang mukmin- mendapatkan suatu nikmat, baik berupa kemenangan atas musuh maupun bertambahnya harta dan anak, mereka (orang-orang kafir) akan merasa gundah dan sedih. Dan apabila kalian mendapatkan musibah, seperti dikalahkan oleh musuh, atau berkurangnya harta dan anak, mereka akan merasa gembira dan mencaci maki kalian. Jika kalian sabar terhadap perintah-perintah dan ketentuan-ketentuan-Nya, dan berusaha menghindari murka-Nya kepada kalian, maka kalian akan terhindar dari tipu daya dan gangguan mereka. Sesungguhnya Allah Maha Mengetahui segala macam tipu daya mereka dan akan menggagalkannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "120. Hai orang-orang beriman, bagian dari cobaan mereka adalah jika kalian mendapat kebaikan mereka akan bersedih, namun jika kalian mendapat musibah mereka menjadi gembira. Jika kalian bersabar atas gangguan mereka dan segala musibah serta bertakwa kepada Allah, maka permusuhan mereka tidak akan berbahaya bagi kalian sedikitpun. Ilmu Allah meliputi segala kerusakan yang mereka buat, dan Dia akan membalas perbuatan mereka itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "120. إِن تَمْسَسْكُمْ حَسَنَةٌ (Jika kamu memperoleh kebaikan) Yang berupa pertolongan, kekuatan, dan yang lainnya meski itu sedikit. تَسُؤْهُمْ (niscaya mereka bersedih hati) Maka siapa saja yang memiliki sifat seperti ini maka ia tidak pantas untuk dijadikan orang terpercaya. وَإِن تَصْبِرُوا۟ (Jika kamu bersabar) Yakni atas permusuhan mereka atau atas beban berat dalam memerangi mereka. وَتَتَّقُوا۟( dan bertakwa) Yakni menghindari untuk menjadikan mereka teman dekat. لَا يَضُرُّكُمْ كَيْدُهُمْ (niscaya tipu daya mereka sedikitpun tidak mendatangkan kemudharatan kepadamu) Yakni berupa keburukan rencana mereka bagi kalian dan agama kalian. إِنَّ اللهَ بِمَا يَعْمَلُونَ مُحِيطٌ (Sesungguhnya Allah mengetahui segala apa yang mereka kerjakan) Yakni yang Maha melihat mereka dan Maha berkuasa atas penghapusan amalan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "120 Jika kamu memperoleh kenikmatan berupa pertolongan, atau ghanimah, atau kekuatan, niscaya mereka akan bersedih hati dan gundah. Namun jika kamu mendapat bencana berupa kekalahan atau kekeringan, mereka akan bergembira karenanya sebab kebencian mereka. Jika kamu bersabar atas perlakuan dan permusuhan mereka dan bertakwa kepada Allah dan tidak menjadikan mereka sebagai teman kepercayaan, niscaya tipu daya mereka sedikitpun tidak akan mendatangkan kemudharatan kepadamu. Sebab kalian berada dalam perlindungan Allah. Sesungguhnya Allah mengetahui segala apa yang mereka kerjakan dan Maha Kuasa menjadikan mereka frustasi."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika kalian memperoleh} mendapat {kebaikan} kenikmatan seperti pertolongan, awan mendung, dan kesuburan {maka itu membuat mereka sedih} membuat mereka sedih. {Adapun jika kalian ditimpa bencana} musibah seperti kehancuran dan kekeringan{mereka bergembira karenanya. Jika kalian bersabar dan bertakwa, tidaklah tipu daya mereka akan menyusahkan kalian sedikit pun. Sesungguhnya Allah Maha Meliputi segala yang mereka kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "120. “Jika kamu memperoleh kebaikan;” kemuliaan, kemenangan, keselamatan, dan kebaikan, “niscaya mereka bersedih hati, tetapi jika kamu mendapatkan bencana” berupa penguasaan musuh atau terjadinya beberapa musibah duniawi, “niscaya mereka bergembira karenanya.” Ini adalah sifat dari musuh yang sangat sengit sekali permusuhannya. Ketika Allah menerangkan tentang permusuhan mereka yang begitu keras dan menjelaskan tentang sifat keji yang ada pada mereka, maka Allah memerintahkan hamba-hambaNya yang Mukmin untuk bersabar dan konsisten terhadap ketakwaan, dan bahwa bila mereka menegakkan hal itu, niscaya tipu daya musuh mereka tidak akan memudaratkan mereka sedikit pun. Sesungguhnya Allah meliputi mereka semua, perbuatan-perbuatan mereka, tipu daya mereka yang mereka gencarkan terhadap kalian, dan sungguh Allah telah berjanji kepada kalian ketika kalian menegakkan ketakwaan, bahwa mereka tidak akan memudaratkan kalian sedikit pun, maka janganlah kalian bersedih dengan terjadinya hal tersebut."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 120: Jika kebaikan mengenai kamu, mereka susah; dan jika bahaya hinggapi kamu, mereka suka; dan kamu sabar dan berbakti, maka tipu daya mereka tidak akan menyusahkan kamu sedikit jua pun;sesungguhnya Allah Mengepung apa-apa yang mereka kerjakan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Seperti kemenangan dan harta rampasan perang (ghanimah). Seperti kekalahan dan musibah. Hal ini menunjukkan bahwa mereka senantiasa memusuhi kita dan tidak memberikan kesetiaan kepada kita. Oleh karena itu, janganlah kita berwala' kepada mereka. Inilah sebab kemenangan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 120",
    "description": "Jika mereka yang berhati dengki itu melihat kamu memperoleh kebaikan, kemenangan perang, rezeki yang melimpah, kesehatan dan kemuliaan, niscaya mereka bersedih hati bahkan hal tersebut membuat mereka marah, tetapi jika kamu tertimpa bencana, seperti sakit, kemiskinan atau kalah perang, maka mereka bergembira karenanya. Allah memberi umat islam tuntunan agar tetap bersabar dan bertakwa kepada Allah ketika menghadapi orang yang bersifat demikian. Karena jika kamu bersabar tidak terbawa hawa nafsu untuk membalasnya dengan perbuatan jahat, dan bertakwa kepada Allah dengan tetap istikamah dalam bersabar, maka tipu daya mereka tidak akan menyusahkan dan mendatangkan bahaya bagi kamu sedikit pun. Sungguh, Allah maha meliputi segala apa yang mereka kerjakan dan maha mengetahui tipu daya yang mereka rahasiakan. Pada ayat ini Allah mengingatkan umat islam akan kisah perang uhud. Dan ingatlah, ketika engkau wahai nabi Muhammad, berangkat pada pagi hari jum'at, meninggalkan keluargamu, yaitu istrimu aisyah untuk mengatur strategi perang, dan pada hari sabtu kamu menempatkan orang-orang beriman pada pos-pos strategis untuk pertempuran. Allah maha mendengar pembicaraan lagi maha mengetahui isi hati semua orang."
  }
]