[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ingatlah (wahai Rasul), ketika kamu keluar dari rumahmu dengan mengenakan perlengkapan perang, mengatur barisan sahabat-sahabatmu, dan menempatkan masing-masing pada posisinya untuk menghadapi kaum musyrikin pada perang uhud. Dan Allah Maha Mendengar ucapan-ucapan kalian, lagi Maha Mengetahui perbuatan-perbuatan kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "121. Dan ingatlah -wahai Nabi- tatkala kamu keluar dari Madinah di pagi hari untuk berperang melawan orang-orang musyrik dalam perang Uhud, di mana engkau telah menempatkan orang-orang mukmin pada posisi mereka di medan perang, lalu engkau jelaskan kepada mereka posisi mereka masing-masing. Dan Allah Maha Mendengar ucapanmu lagi Maha Melihat perbuatanmu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "121. Hai Rasulullah, ingatlah perang Uhud, ketika kamu keluar dari rumahmu di pagi hari kemudian kamu mengatur barisan dan penempatan pasukan perang yang ikut pada peperangan ini. Allah Maha Mendengar segala perkataan dan Maha Mengetahui segala perbuatan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "121. وَإِذْ غَدَوْتَ مِنْ أَهْلِكَ (Dan (ingatlah), ketika kamu berangkat pada pagi hari dari (rumah) keluargamu) Mengganti pembahasan menuju penyebutan tentang peperangan melawan kaum Quraisy di perang Badar dan Uhud agar orang-orang Yahudi mengambil pelajaran dan mengetahui bagaimana nasib mereka apabila kaum muslimin memerangi mereka. Dan makna ayat ini adalah Ingatlah ketika engkau (Muhammad) keluar dari rumahmu tempat keluargamu berada. Ayat ini turun dalam urusan perang Uhud. تُبَوِّئُ الْمُؤْمِنِينَ مَقٰعِدَ لِلْقِتَالِ ۗ (menempatkan para mukmin pada beberapa tempat untuk berperang) Yakni mengatur barisan mereka sebagai persiapan untuk menghadapi musuh mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Diantara makna ayat ini adalah : keutamaan bersegera untuk mengerjakan amalan baik dengan memulainya sejak permulaan hari, dan : perlunya berpamitan kepada keluarga saat akan melakukan perjalanan, dan : kewajiban menunaikan haq Allah diatas haq-haq siapapun selain-Nya; maka sekalipun seorang hamba mengeluarkan seseorang yang paling ia sukai dari dirinya, menjadi orang yang paling ia benci, dengan maksud mengutamakan kecintaannya kepada Allah di atas kecintaan-Nya kepada selain Allah, adalah lebih baik jika ia melakukannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "121 Dan ingatlah wahai nabi, ketika kamu berangkat pada pagi hari dari rumah keluargamu, dan akan menempatkan para mukmin pada beberapa tempat untuk berperang dalam medan peperangan Badr dan Uhud untuk memberi pelajaran kepada orang-orang Yahudi dan mereka akan tahu tempat tinggal mereka ketika orang-orang muslim memerangi mereka Ayat ini turun mengenai kisah orang-orang mukmin pada perang Uhud, ayat ini dan ayat selanjutnya sekitar 60 ayat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "(Ingatlah) ketika kamu berangkat pada pagi hari meninggalkan keluargamu} ingatlah ketika kamu keluar di permulaan siang dari rumah keluargamu {untuk mengatur} mendatangi {orang-orang mukmin pada pos-pos} tempat-tempat {peperangan. Allah Maha Mendengar lagi Maha Mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "121. Itu adalah pada perang Uhud ketika Nabi pergi bersama kaum Muslimin, di saat kaum musyrikin dengan kelompok mereka telah sampai pada tempat yang dekat dari uhud, lalu beliau menempatkan mereka pada posisi mereka masing-masing, mengatur mereka secara tertib pada kedudukan mereka dengan suatu pengaturan yang sangat cemerlang, yang menunjukkan akan kematangan pikirannya dan kemahirannya yang sempurna dalam urusan siasat perang, sebagaimana beliau sempurna dalam segala tindakan, “dan Allah Maha Mendengar lagi Maha Mengetahui”, maksudnya tidak ada sesuatu pun dari urusan kalian yang tersembunyi dariNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 121: Dan (ingatlah) tatkala engkau keluar pagi-pagi dari rumah ahlimu, (untuk) menetapkan bagi Mu'minin tempat-tempat kedudukan (masing-masing untuk peperangan; dan Allah itu Mendengar, Mengetahui."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Hikmah disebutkan kisah perang Uhud dan perang Badar adalah karena Allah Subhaanahu wa Ta'aala telah menjanjikan kemenangan kepada kaum mukminin jika mereka bersabar dan bertakwa serta akan menghindarkan tipu daya musuh. Hal ini adalah janji yang umum, di mana janji tersebut tidak akan meleset jika kaum mukmin mengerjakan syaratnya. Allah Subhaanahu wa Ta'aala memberikan contoh dengan perang Badar, saat mereka bersabar dan bertakwa, Allah memberikan kemenangan, namun ketika mereka kurang memperhatikan kesabaran dan ketakwaan, mereka pun kalah. Di antara hikmah disebutkan bersamaan kisah perang Badar dan Uhud adalah bahwa Allah menyukai hamba-Nya apabila mereka tertimpa musibah yang tidak mereka sukai segera mengingat hal yang mereka cintai, sehingga musibah menjadi ringan dan membuat mereka bersyukur kepada Allah atas nikmat yang besar itu. Hal ini menunjukkan kecemerlangan pendapat Beliau dan menunjukkan keberaniannya, di mana Beliau yang langsung mengatur posisi kaum mukmin dalam peperangan. Peristiwa ini terjadi pada perang Uhud yang menurut ahli sejarah terjadi pada tahun ke 3 H. Pada waktu itu, Beliau keluar membawa 1.000 orang pasukan atau kurang lima puluh (950 pasukan), sedangkan kaum musyrikin berjumlah 3.000 orang. Tetapi baru saja Beliau berangkat, keluarlah dari barisan segolongan kaum munafik yang dipimpin Abdullah bin Ubay, jumlahnya 300 orang. Laskar yang masih setia kepada Nabi Muhammad shallalllahu 'alaihi wa sallam terus berangkat bersama Beliau shallalllahu 'alaihi wa sallam, jumlahnya 700 orang. Beliau menempati kaki gunung, dan menjadikan gunung Uhud di belakang Beliau, saat itu Beliau mengatur barisan dan menempatkan pasukan pemanah di perbukitan yang dipimpin Abdullah bin Jubair dan berpesan kepada mereka agar tidak meninggalkan posisinya, baik Beliau menang atau kalah. Awalnya kaum muslimin menguasai jalan pertempuran itu, akan tetapi karena ada di antara mereka yang tidak disiplin, maka berubahlah keadaannya; regu pemanah banyak yang turun dari bukit meninggalkan posisinya, karena melihat ghanimah sudah di depan mata. Ketika regu pemanah sudah turun, pasukan musyrikin kembali berputar dari arah lain dipimpin oleh Khalid bin Walid yang ketika itu masih kafir, akibatnya kaum muslimin terkepung dari depan maupun belakang, pasukan kaum muslimin pun terpecah belah. Di akhirnya, kaum muslimin berkumpul kembali ke hadapan Nabi Muhammad shallalllahu 'alaihi wa sallam setelah terpecah belah, lalu Beliau menarik pasukan ke celah bukit."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 121",
    "description": "Pada ayat ini Allah mengingatkan umat islam akan kisah perang uhud. Dan ingatlah, ketika engkau wahai nabi Muhammad, berangkat pada pagi hari jum'at, meninggalkan keluargamu, yaitu istrimu aisyah untuk mengatur strategi perang, dan pada hari sabtu kamu menempatkan orang-orang beriman pada pos-pos strategis untuk pertempuran. Allah maha mendengar pembicaraan lagi maha mengetahui isi hati semua orang ketika itu ada dua golongan dari pihak kamu, yakni bani salamah dari suku khazraj dan bani hariÅ¡ah dari suku aus, ingin mundur dan membatalkan niatnya untuk ikut berperang karena takut mati, setelah mengetahui orang-orang munafik yang dipimpin 'abdulla'h bin ubay yang jumlahnya sepertiga dari pasukan islam telah batal berangkat berperang, padahal Allah adalah penolong mereka, yaitu kedua suku tersebut. Karena itu, hendaklah kepada Allah saja orang-orang mukmin bertawakal, tidak mengandalkan jumlah prajurit dan perlengkapan perang."
  }
]