[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ingatlah (wahai Rasul), apa yang telah berlalu dari perkara Bani Salamah dan Bani Haritsah ketika diri mereka sendiri berkata kepada mereka supaya pulang bersama pemimpin mereka sang tokoh munafik, Abdullah bin Ubay, karena takut menghadapi musuh. Akan tetapi, Allah menjaga kaum mukminin dan melindungi mereka, lalu mereka tetap berjalan menyertai kamu dengan bertawakal kepada Allah. Dan hanya kepada Allah semata hendaknya orang-orang mukmin bertawakal."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "122. Ingatlah -wahai Nabi- apa yang terjadi pada dua kelompok orang-orang mukmin dari Bani Salimah dan Bani Ḥariṡah tatkala mereka menjadi lemah dan berniat pulang (ke Madinah) ketika orang-orang munafik pulang (ke sana), sedangkan Allah menolong orang-orang mukmin itu dengan cara meneguhkan hati mereka untuk terus berperang dan memalingkan mereka dari keinginan untuk pulang. Dan hanya kepadaNya-lah hendaknya orang-orang mukmin bersandar dalam segala hal."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "122. Hai Rasulullah, ingatlah ketika setan menggoda kaum dari Bani Salamah dan Bani Haritsah, saat terlintas dalam fikiran mereka untuk mundur dari perang Uhud; namun Allah menghilangkan bisikan setan ini dari mereka. Dan hanya kepada Allah hendaklah orang-orang bertawakkal dan memohon pertolongan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "122. إِذْ هَمَّت طَّآئِفَتَانِ مِنكُمْ أَن تَفْشَلَا (ketika dua golongan dari padamu ingin (mundur) karena takut) Adapun dua golongan tersebut adalah Bani Salamah dari suku Khazraj dan Bani Haritsah dari bani Aus, yang keduanya adalah sayap dari pasukan di perang Uhud. Mereka ingin mundur dari peperangan bersama Rasulullah setelah melihat banyaknya orang-orang munafik yang mundur di hari itu. Maka Allah menjaga hati orang-orang beriman sehingga mereka tidak jadi mundur. وَاللهُ وَلِيُّهُمَا ۗ( padahal Allah adalah penolong bagi kedua golongan itu) Yakni sehingga Allah menyelamatkan mereka dari kegagalan dengan tidak ikut mundur ketika orang-orang munafik mundur."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "122 Ingatlah ketika ada dua golongan dari kelompokmu yang ingin mundur pada perang Uhud karena takut, yaitu Bani Salamah dari suku Khazraj dan Bani Haritsah dari suku Aus. Padahal Allah adalah penolong bagi kedua golongan itu. Karena itu hendaklah kepada Allah saja orang-orang mukmin bertawakkal."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika dua golongan dari pihak kalian yang ragu} dua golongan dari kaum Anshar yaitu Bani Salamah dari Khazraj dan Bani Harisah dari Aus {keduanya gagal} keduanya pengecut dan takut pada peperangan {padahal Allah adalah penolong mereka.} penolong mereka {Dan hendaklah kepada Allah saja orang-orang mukmin bertawakal"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "122. “Ketika dua golongan darimu ingin (mundur) karena takut,” mereka itu adalah Bani Salimah dan Bani Haritsah, akan tetapi Allah menolong mereka disebabkan kasih sayangNya, perlindunganNya, dan bimbinganNya. “Oleh karena itu, hendaklah kepada Allah saja orang-orang Mukmin bertawakal”, karena bila mereka bertawakal kepadaNya, niscaya Allah akan mencukupi, menolong mereka, dan melindungi mereka dari tertimpa oleh sesuatu yang dapat memudaratkan bagi agama dan dunia mereka. Dalam ayat ini dan yang semisalnya mengandung hukum kewajiban bertawakal dan bahwa sebesar keimanan seseorang maka sebesar itu pulalah tawakalnya. Dan tawakal itu adalah bersandarnya seorang hamba kepada Rabbnya dalam memperoleh manfaat dan menolak mudarat dari dirinya. Dan tatkala Allah menyebutkan tentang keadaan mereka dalalm perang Uhud dana pa yang terjadi pada mereka berupa musibah, maka Allah juga menyebutkan pertolongan Allah dan nikmatNya atas mereka pada perang Badar, agar mereka bersyukur kepada Rabb mereka dan agar hal itu dapat meringankan kejadian pada perang Uhud tersebut. Lalu Allah berfirman,"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 122: (Ingatlah) tatkala dua golongan dari kamu hendak jadi lemah, tetapi Allah jadi Pengurus mereka, clan kepada Allah-lah henda knya Mu'minin berserah diri mereka"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Imam Bukhari meriwayatkan dari Jabir, ia berkata: Ayat ini, \"Idz hammat thaa'ifataani…dst.\" turun berkenaan dengan kami Bani Salamah dan Bani Haritsah, saya ingin ayat tersebut tidak turun, tetapi Allah berfirman, \"Padahal Allah penolong mereka.\" Maksud kata-kata Jabir, \"Saya ingin ayat tersebut tidak turun, tetapi Allah berfirman, \"Padahal Allah penolong mereka\" adalah bahwa zhahirnya ayat tersebut merendahkan mereka, tetapi di akhir ayat sebenarnya terdapat kemuliaan bagi mereka. Yakni: Bani Salamah dari suku Khazraj dan Bani Haritsah dari suku Aus, keduanya dari barisan kaum muslimin. Kedua kabilah itu ingin mundur melihat Abdullah bin Ubay dan kawan-kawannya mundur, lalu Allah meneguhkan pendirian mereka sehingga tidak jadi mundur. Dia memberikan taufiq hamba-hamba-Nya kepada hal yang terbaik bagi mereka dan melindungi mereka dari hal yang membahayakan mereka. Di antaranya adalah dengan meneguhkan pendirian mereka, ketika mereka hampir mundur dan meninggalkan Rasulullah shallallahu 'alaihi wa sallam karena iman yang ada dalam hati mereka. Terlebih dalam keadaan mencekam atau dalam peperangan, mereka butuh bertawakkal, meminta pertolongan dan bantuan Kepada Tuhannya, serta berlepas dari kemampuan mereka dan bersandar kepada kekuatan Allah Azza wa Jalla. Dengan itulah, mereka bisa menang dan dapat mengatasi berbagai cobaan dan ujian."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 122",
    "description": "Ketika itu ada dua golongan dari pihak kamu, yakni bani salamah dari suku khazraj dan bani hariÅ¡ah dari suku aus, ingin mundur dan membatalkan niatnya untuk ikut berperang karena takut mati, setelah mengetahui orang-orang munafik yang dipimpin 'abdulla'h bin ubay yang jumlahnya sepertiga dari pasukan islam telah batal berangkat berperang, padahal Allah adalah penolong mereka, yaitu kedua suku tersebut. Karena itu, hendaklah kepada Allah saja orang-orang mukmin bertawakal, tidak mengandalkan jumlah prajurit dan perlengkapan perang. Kejadian dalam perang uhud membuat sebagian orang mukmin ragu akan kepastian pertolongan Allah, oleh karena itu Allah meyakinkan mereka dan menegaskan bahwasannya sungguh, Allah telah menolong kamu dalam perang badar yang terjadi pada tanggal 17 ramadan tahun kedua hijriah, padahal ketika itu kamu dalam keadaan lemah, karena jumlah kamu sedikit dan perlengkapan perang kamu sangat sederhana. Karena kamu meyakini datangnya pertolongan Allah, maka kamu mendapat kemenangan. Karena itu bertakwalah kepada Allah dalam segala urusan, agar dengannya kamu mensyukuri semua anugerah-Nya."
  }
]