[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sungguh Allah telah menolong kalian (wahai kaum mukminin), pada perang badar mengalahkan musuh-musuh kalian, kaum musyrikin, walaupun jumlah dan perlengkapan kalian sedikit, maka takutlah kepada Allah dengan menjalankan perintah-perintahNya dan menjauhi larangan-laranganNya, mudah-mudahan kalian bersyukur kepadaNya atas nikmat-nikmatNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "123. Dan sungguh Allah telah menolong kalian untuk mengalahkan orang-orang musyrik dalam perang Badar, meskipun jumlah personil dan peralatan perang kalian sedikit. Maka takutlah kalian kepada Allah agar kalian mensyukuri nikmat-nikmat-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "123. Hai orang-orang beriman, sungguh Allah telah menolong kalian dalam menghadapi orang-orang Musyrik pada perang Badar -Badar adalah tempat yang terletak di 160 km ke selatan dari kota Madinah-, padahal jumlah kalian saat itu sedikit (300 dan beberapa puluh pasukan saja). Maka bertakwalah kepada Allah dengan mentaati-Nya agar kalian mencapai derajat orang-orang yang bersyukur atas nikmat-nikmat-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "123. وَلَقَدْ نَصَرَكُمُ اللهُ بِبَدْرٍ (Sungguh Allah telah menolong kamu dalam peperangan Badar) Ini adalah pembahasan baru yang digunakan untuk memberikan kesabaran bagi mereka dengan meningatkan apa yang menjadi hasil dari kesabaran dalam menunggu datangnya pertolongan. وَأَنتُمْ أَذِلَّةٌ ۖ (padahal kamu adalah (ketika itu) orang-orang yang lemah) Yakni orang-orang yang lemah karena jumlah mereka yang sedikit dan bukan karena kepengecutan mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Sebagian ulama salaf mengatakan : Syukur adalah taqwa kepada Allah, perhatikanlah firman Allah : { وَلَقَدْ نَصَرَكُمُ اللَّهُ بِبَدْرٍ وَأَنْتُمْ أَذِلَّةٌ ۖ فَاتَّقُوا اللَّهَ لَعَلَّكُمْ تَشْكُرُونَ } \"Sungguh Allah telah menolong kamu dalam peperangan Badar, padahal kamu adalah (ketika itu) orang-orang yang lemah. Karena itu bertakwalah kepada Allah, supaya kamu mensyukuri-Nya\" , maka orang yang bertawa (dalam ayat ini) adalah dia yang mensyukuri nikmat Allah, maka barangsiapa yang belum bertaqwa belum dikatakan bahwa dia telah menjadi orang yang bersyukur."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "123 Sungguh Allah telah menolong kalian wahai orang-orang mukmin dalam peperangan Badar: tempat di antara Madinah dan Jeddah. Padahal kamu ketika itu termasuk orang-orang yang lemah karena jumlah pasukan dan senjata kalian sedikit jika dibandingkan musuh kalian. Karena itu bertakwalah kepada Allah dan teguh bersama rasul-Nya, supaya kamu mensyukuri nikmat pertolongan-Nya. Ini adalah pengingat atas peperangan Badar, agar diketahui bahwa pertolongan Allah adalah untuk orang-orang yang senantiasa sabar."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh, Allah benar-benar telah menolong kalian dalam Perang Badar, padahal kalian adalah orang-orang lemah.} sedikit jumlah dan persiapannya {Maka bertakwalah kepada Allah agar kalian bersyukur"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "123. Dan ingatlah ketika “Allah telah menolongmu dalam perang Badar, padahal kamu (ketika itu) orang-orang yang lemah” dari segi jumlah dan perlengkapan kalian. Saat itu kaum Muslimin berjumlah tiga ratus sekian belas dengan kuda yang sedikit dan senjata yang using, padahal musuh mereka hampir mencapai seribu pasukan, dengan perlengkapan senjata yang mumpuni, “Karena itu bertakwalah kepada Allah, supaya kamu menyukuriNya”, Yang telah memberikan karuniaNya atas kalian dengan pertolonganNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 123: Dan sesungguhnya Allah telah tolong kamu di (peperan gan) Badr, padahal kamu sedikit; lantaran itu, takutlah kepada Allah Supaya kamu (bisa) menerima kasih."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini turun ketika kaum muslimin mengalami kekalahan dalam perang Uhud untuk mengingatkan mereka nikmat-Nya di perang Badar. Perang Badar terjadi pada tahun ke-2 hijriah. Ketika itu, Nabi shallallahu 'alaihi wa sallam keluar bersama tiga ratus orang pasukan dengan maksud mengejar kafilah Quraisy yang pulang dari Syam. Namun berita ini didengar oleh kaum musyrik, maka mereka segera bersiap-siap untuk mengadakan perlawanan demi menyelamatkan kafilah mereka. Saat itu, kaum kafir Quraisy keluar dengan pasukan berjumlah 1.000 orang lengkap dengan peralatan perang, senjata dan kuda yang banyak. Maka bertempurlah kaum muslim dengan kaum musyrik di mata air yang bernama \"Badar\" yang terletak antara Makkah dan Madinah. Saat itu, Allah memenangkan kaum muslimin, tujuh puluh orang kaum musyrik terbunuh dan tujuh puluh lagi tertawan. Keadaan kaum muslimin lemah karena jumlah mereka sedikit dan perlengkapan mereka kurang mencukupi. Ayat ini menunjukkan bahwa barang siapa yang tidak bertakwa kepada Allah, maka sama saja ia tidak bersyukur kepada Tuhannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 123",
    "description": "Kejadian dalam perang uhud membuat sebagian orang mukmin ragu akan kepastian pertolongan Allah, oleh karena itu Allah meyakinkan mereka dan menegaskan bahwasannya sungguh, Allah telah menolong kamu dalam perang badar yang terjadi pada tanggal 17 ramadan tahun kedua hijriah, padahal ketika itu kamu dalam keadaan lemah, karena jumlah kamu sedikit dan perlengkapan perang kamu sangat sederhana. Karena kamu meyakini datangnya pertolongan Allah, maka kamu mendapat kemenangan. Karena itu bertakwalah kepada Allah dalam segala urusan, agar dengannya kamu mensyukuri semua anugerah-Nya ayat ini menggambarkan upaya rasulullah sebagai pemimpin untuk menyemangati umat islam yang akan ikut perang uhud. Ingatlah, ketika engkau, wahai nabi Muhammad, mengatakan kepada orangorang beriman, apakah tidak cukup bagimu bahwa Allah membantu kamu dengan bantuan yang tidak tampak, yaitu tiga ribu malaikat yang diturunkan dari langit'."
  }
]