[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ingatlah oleh mu (wahai nabi), apa yang terjadi kepada para sahabatmu dalam perang badar, ketika terasa berat bagi mereka dengan kedatangan bala bantuan kaum musyrikin. Maka kami mewahyukan kepadamu untuk mengatakan kepada mereka, “ Tidakkah sudah mencukupi pertolongan Tuhan kalian dengan menguatkan kalian dengan tiga ribu malaikat yang diturunkan dari langit menuju medan peperangan itu, mereka meneguhkan kalian dan berperang bersama kalian?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "124. Ingatlah -wahai Nabi- ketika engkau berkata kepada orang-orang mukmin untuk meneguhkan hati mereka dalam perang Badar setelah mereka mendengar adanya bala bantuan yang datang untuk orang-orang musyrik, “Tidak cukupkah bagi kalian bila Allah membantu kalian dengan tiga ribu Malaikat yang turun dari sisi-Nya untuk memperkuat pasukan kalian di medan perang?”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "124. Hai Rasulullah, ingatlah ketika kamu menenangkan hati pasukan yang berjumlah sedikit ini dan memberi mereka kabar gembira berupa bala bantuan dari Allah: “Tidakkah cukup bagi kalian bala bantuan dari Allah sebanyak 3.000 malaikat yang turun dari langit?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "124. إِذْ تَقُولُ ((Ingatlah), ketika kamu mengatakan) Yakni ingatlah ketika kamu mengatakan kepada orang orang beriman di hari Perang Badar. أَلَن يَكْفِيَكُمْ (Apakah tidak cukup bagi kamu) Sebagai bentuk pengingkaran darinya kepada orang-orang beriman karena merasa kurang dengan bala bantuan dari malaikat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "124 Ingatlah wahai Nabi, ketika kamu mengatakan kepada orang mukmin, ketika mereka sedang merendahkan diri kepada Allah agar mereka diberi pertolongan untuk menghadapi musuh mereka: “Apakah tidak cukup Allah bagi kamu sebagai Yang membantu kamu dengan tiga ribu malaikat yang diturunkan dari langit untuk membantu kalian?”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika kamu berkata kepada orang-orang mukmin,“Apakah tidak cukup bagi kalian bahwa Tuhan kalian membantu kalian} membantu kalian {dengan tiga ribu malaikat yang diturunkan”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "124. “(Ingatlah), ketika kamu mengatakan” seraya memberikan kabar gembira “kepada kaum Mukminin” demi meneguhkan hati mereka, “Apakah tidak cukup bagimu Allah membantumu dengan tiga ribu malaikat yang diturunkan (dari langit)?”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 124: (Ingatlah) tatkala engkau berkata kepada Mu'minin: \"Tidakkan Cukup bagi kamu, bahwa Tuhan kamu akan membantu kamu dengan tiga ribu malaikat yang diturunkan?1"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Untuk menenteramkan hati mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 124",
    "description": "Ayat ini menggambarkan upaya rasulullah sebagai pemimpin untuk menyemangati umat islam yang akan ikut perang uhud. Ingatlah, ketika engkau, wahai nabi Muhammad, mengatakan kepada orangorang beriman, apakah tidak cukup bagimu bahwa Allah membantu kamu dengan bantuan yang tidak tampak, yaitu tiga ribu malaikat yang diturunkan dari langit' ya cukup. Meskipun jumlah tersebut sudah cukup, tetapi jika kamu bersabar menghadapi lawan dan bertakwa dengan melaksanakan perintah Allah dan rasul-Nya, ketika mereka, orang-orang kafir, datang menyerang kamu dengan tiba-tiba, niscaya Allah menolongmu dengan pertolongan yang tampak berupa lima ribu malaikat yang memakai tanda, yaitu malaikat yang akan terlibat langsung dalam peperangan sesuai cara dan ketentuan Allah. Para malaikat tersebut digambarkan seperti para pemberani dalam peperangan yang lazimnya menggunakan tanda-tanda khusus."
  }
]