[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tentu, jumlah itu sudah mencukupi bagi kalian. Dan kabar gembira lainnya bagi kalian, bila kalian bersabar menghadapi musuh dan bertakwa kepada Allah dengan menjalankan perkara yang diperintahkanNya kepada kalian dan menjauhi apa-apa yang Dia larang kalian untuk melakukannya, dan orang-orang kafir Makkah datang dengan seketika menyergap dengan cepat untuk menyerang kalian, mereka menyangka akan dapat menghabisi kalian sampai ke akar-akarnya; maka sesungguhnya Allah memperkuat kalian dengan lima ribu malaikat yang datang dengan menggunakan tanda. Maksudnya, mereka memberitahukan diri-diri mereka dan kuda-kuda mereka dengan tanda pengenal yang jelas."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "125. Tentu. Sesungguhnya bantuan itu cukup bagi kalian. Dan kalian juga akan mendapatkan bantuan lain dari Allah, jika kalian bertahan di medan perang dan takut kepada Allah, kemudian datang bala bantuan untuk musuh-musuh kalian yang bergerak cepat ke arah kalian. Maka jika hal itu terjadi, Rabb kalian akan membantu dengan lima ribu Malaikat yang memiliki tanda yang jelas di tubuh dan di kuda mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "125. “Ya, itu cukup bagi kalian. Dan kabar gembira kedua bagi kalian adalah jika kalian gigih dalam melawan musuh, bertakwa kepada Allah, dan orang-orang kafir Makkah menyerang kalian saat ini juga, maka Tuhan kalian akan mengirim bala bantuan sebanyak 5.000 malaikat yang memiliki tanda yang akan kalian kenali.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "125. بَلَىٰٓ ۚ إِن تَصْبِرُوا۟ (Ya (cukup), jika kamu bersabar) Yakni atas beratnya peperangan dan tetap kokoh saat perang itu terjadi. وَتَتَّقُوا۟ وَيَأْتُوكُم مِّن فَوْرِهِمْ هٰذَا (dan bersiap-siaga, dan mereka datang menyerang kamu dengan seketika itu juga) Yakni apabila musuh mendatangi kalian saat itu juga. يُمْدِدْكُمْ رَبُّكُم (niscaya Allah menolong kamu) Dengan malaikat ketika musuh mendatangi kalian dan tidak telat daripada itu. مُسَوِّمِينَ (yang memakai tanda) Yakni mereka menandai diri mereka dengan tanda-tanda tertentu. Dan dahulu para pemilik keberanian dan kekuatan menandai diri mereka dengan ikat kepala berwarna merah atau tanda yang lain agar tempat mereka diketahui. ada pendapat mengatakan bahwa malaikat pada perang Badar memakai imamah putih, dan pendapat lain mengatakan merah dan yang lain mengatakan hijau dan yang lain mengatakan kuning. Dan mereka pada waktu itu mengendarai kuda yang berwarna putih hitam."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "125 Itu semua sangat cukup. Jika kamu bersabar dan bersiap-siaga dalam menghadapi musuh dan senantiasa takut kepada Allah dan tidak bermaksiat kepada-Nya. Dan mereka orang-orang musyrik datang menyerang kamu dengan seketika itu juga, niscaya Allah menolong kamu dengan lima ribu Malaikat yang dapat diketahui dengan berbagai tanda, sebagaimana tentara-tentara yang pemberani dengan ikat kepala merah, agar diketahui tempat mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "“tentu saja”} itu cukup bagi kalian {Jika kalian bersabar dan bertakwa, lalu mereka datang menyerang kalian} orang-orang musyrik dating untuk menyerang kalian {dengan tiba-tiba} saat itu juga {niscaya Allah menolong kalian dengan lima ribu malaikat yang memakai tanda} diberi tanda pada diri mereka, dan bayangan mereka itu dengan tanda yang jelas"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "125. “Ya (cukup), jika kamu bersabar dan bertakwa, dan mereka datang menyerangmu dengan seketika itu juga”, maksudnya, turunnya mereka (para malaikat tersebut) adalah dalam kondisi seperti ini, “niscaya Allah menolongmu dengan lima ribu malaikat yang memakai tanda,” yaitu, mengajarkan tanda-tanda para pemberani. Para ulama berbeda pendapat tentang pertolongan itu, apakah dengan para malaikat secara langsung ikut berperang sebagaimana yang dikatakan oleh sebagian ulama, atau pertolongan itu berupa peneguhan dari Allah bagi hamba-hambaNya yang Mukmin, dan menjatuhkan rasa takut pada hati kaum musyrikin sebagaimana yang dikatakan oleh sebagian besar ahli tafsir, yang dapat menjadi dasarnya adalah Firman Allah,"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 125: Bahkan! Jika kamu sabar dan taat walaupun mereka itu datang kepada kamu dengan segera sekarang ini juga, Tuhan mu akan bantu kamu dengan lima ribu malaikat yang menyerbu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dalam surat Al Anfal disebutkan, bahwa Allah memberikan bantuan dengan 1.000 malaikat. Bantuan dengan 1.000 malaikat adalah bantuan yang pertama, kemudian bertambah menjadi 3.000 malaikat. Saat bertempur dengan musuh."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 125",
    "description": "Ya cukup. Meskipun jumlah tersebut sudah cukup, tetapi jika kamu bersabar menghadapi lawan dan bertakwa dengan melaksanakan perintah Allah dan rasul-Nya, ketika mereka, orang-orang kafir, datang menyerang kamu dengan tiba-tiba, niscaya Allah menolongmu dengan pertolongan yang tampak berupa lima ribu malaikat yang memakai tanda, yaitu malaikat yang akan terlibat langsung dalam peperangan sesuai cara dan ketentuan Allah. Para malaikat tersebut digambarkan seperti para pemberani dalam peperangan yang lazimnya menggunakan tanda-tanda khusus. Dan Allah tidak menjadikannya, yakni pemberian bala-bantuan itu melainkan sebagai kabar gembira bagi kemenanganmu, dan agar hatimu tenang karenanya. Dan tidak ada kemenangan itu, selain dari Allah yang mahaperkasa, tidak bisa dikalahkan oleh siapa pun, mahabijaksana dalam setiap anugerah-Nya, baik berupa kemenangan maupun kekalahan. Ayat ini menegaskan bahwa kemenangan itu datang dari Allah dan atas kehendak-Nya, dengan perantaraan malaikat yang diturunkan Allah untuk membantu mereka. Bantuan akan diberikan jika manusia bertakwa kepada Allah dan bersabar dalam ketakwaan tersebut."
  }
]