[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Allah tidak menjadikan pertolongan dengan kedatangan malaikat, kecuali sebagai kabar gembira bagi kalian yang Allah menggembirakan kalian dengannya dan agar hati-hati kalian menjadi tentram dan nyaman dengan janji Allah kepada kalian. Dan tidaklah kemenangan itu, kecuali datang dari sisi Allah yang Maha Perkasa yang tidak terkalahkan, juga Mahabijaksana dalam pengaturan dan perbuatanNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "126. Dan tidaklah Allah menjadikan pemberian bantuan dan pengiriman Malaikat itu melainkan sebagai kabar gembira untuk menenangkan hati kalian. Jika tidak, sesungguhnya kemenangan itu sejatinya tidak bisa dicapai hanya dengan upaya-upaya lahiriah semacam itu. Tetapi, kemenangan itu sejatinya berasal dari sisi Allah Yang Maha Perkasa, yang tidak terkalahkan oleh siapapun, lagi Maha Bijaksana dalam menetapkan ketentuan dan syariat-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "126-127. Allah mengirim bala bantuan bagi kalian sebagai kabar gembira dan agar hati kalian menjadi tenang. Pertolongan ini hanya dari Allah semata yang Maha Perkasa dalam kekuasaan-Nya dan Maha Bijaksana dalam pengaturan-Nya. Allah mengatur semua ini agar segolongan orang-orang kafir binasa atau agar mereka murka dan terhina sehingga mereka kembali ke Makkah dalam keadaan kalah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "126. وَمَا جَعَلَهُ اللهُ إِلَّا بُشْرَىٰ لَكُمْ (Dan Allah tidak menjadikan pemberian bala bantuan itu melainkan sebagai khabar gembira bagi (kemenangan)mu) Yakni melainkan agar kalian mendapat kabar gembira bahwa kalian akan mendapat pertolongan. وَلِتَطْمَئِنَّ قُلُوبُكُم بِهِۦ ۗ (dan agar tenteram hatimu karenanya) Yakni karena bala bantuan tersebut. وَمَا النَّصْرُ إِلَّا مِنْ عِندِ اللهِ (Dan kemenanganmu itu hanyalah dari Allah) Yang tidak datang dari selain-Nya, maka tidak bermanfaat banyaknya pasukan perang atau adanya perbekalan kecuali dengan pertolongan, penguatan, dan taufik dari Allah, dan seandainya Allah menghendaki untuk menghancurkan mereka dan menolong agama-Nya tanpa berperang dengan kalian dan usaha mengatur urusan perang; akan tetapi untuk menguji keimanan dan kesabaran kalian maka Allah mensyariatkan atas kalian peperangan. Sebagaimana dalam ayat yang lain: ذٰلِكَ وَلَوْ يَشَآءُ اللهُ لَانتَصَرَ مِنْهُمْ وَلٰكِن لِّيَبْلُوَا۟ بَعْضَكُم بِبَعْضٍ \"Demikianlah apabila Allah menghendaki niscaya Allah akan membinasakan mereka tetapi Allah hendak menguji sebahagian kamu dengan sebahagian yang lain”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "126 Dan Allah tidak menjadikan pemberian bala bantuan itu melainkan sebagai kabar gembira bagi kemenanganmu dengan pertolongannya, dan agar hatimu menjadi tentram karenanya, dan jangan ragu. Kemenanganmu itu hanyalah dari Allah, bukan dari selain Dia. Dialah Yang Maha Perkasa Yang Mengalahkan para musuh lagi Maha Bijaksana dalam segala perbuatan-Nya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Allah tidak menjadikannya} Allah tidak menjadikan pertolongan dengan malaikat itu {kecuali hanya sebagai kabar gembira} kabar gembira {bagi kalian dan agar hati kalian tenang karenanya} agar hati kalian tenang dengan adanya pertolongan itu {Tidak ada pertolongan selain dari sisi Allah Yang Maha perkasa lagi Maha bijaksana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "126. ”Dan Allah tidak menjadikan pemberian bala bantuan itu melainkan sebagai kabar gembira bagi (kemenanganmu), dan agar tentaram hatimu karenanya. Dan tidaklah kemenaganmu itu melainkan dari Allah Yang MAha Perkasa Lagi Maha bijaksana.” Dalam hal ini, seorang hamba tidak boleh bersandar kepada sebab-sebab, akan tetapi dia harus bersandar kepada Allah, sedangkan terjadinya sebab-sebab itu semata-mata ketenangan bagi hati dan keteguhan atas kebaikan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 126: Dan Allah tidak akan jadikan (yang demikian) itu melainkan sebagai kabar yang menggemarkan bagi kamu, dan supaya tetap hati kamu, tetapi kemenangan itu tidak ada melainkan dari fihak AllahYang Gagah,Yang Bijaksana,"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sehingga kamu tidak khawatir dengan jumlah musuh yang banyak dan sedikitnya jumlah kamu. Yakni yang menempatkan sesuatu pada tempatnya dan bertindak tepat. Allah memiliki hikmah mengapa orang-orang kafir terkadang memperoleh kemenangan. Allah berfirman: \"Dan masa (kejayaan dan kehancuran) itu Kami pergilirkan di antara manusia (agar mereka mendapat pelajaran); dan supaya Allah membedakan orang-orang yang beriman (dengan orang-orang kafir) supaya sebagian kamu dijadikan-Nya (gugur sebagai) syuhada'. Dan Allah tidak menyukai orang-orang yang zalim,\" (Terj. Ali Imran: 140) \"Demikianlah, apabila Allah menghendaki niscaya Allah akan membinasakan mereka tetapi Allah hendak menguji sebagian kamu dengan sebagian yang lain. Dan orang-orang yang syahid pada jalan Allah, maka Allah tidak akan menyia-nyiakan amal mereka.\" (Terj. Muhammad: 4)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 126",
    "description": "Dan Allah tidak menjadikannya, yakni pemberian bala-bantuan itu melainkan sebagai kabar gembira bagi kemenanganmu, dan agar hatimu tenang karenanya. Dan tidak ada kemenangan itu, selain dari Allah yang mahaperkasa, tidak bisa dikalahkan oleh siapa pun, mahabijaksana dalam setiap anugerah-Nya, baik berupa kemenangan maupun kekalahan. Ayat ini menegaskan bahwa kemenangan itu datang dari Allah dan atas kehendak-Nya, dengan perantaraan malaikat yang diturunkan Allah untuk membantu mereka. Bantuan akan diberikan jika manusia bertakwa kepada Allah dan bersabar dalam ketakwaan tersebut. Pertolongan dan bantuan Allah kepada kamu dalam perang badar adalah untuk membinasakan segolongan orang kafir dengan terbunuhnya tujuh puluh pemimpin mereka, antara lain abu jahal, atau untuk menjadikan mereka hina dengan tertawannya tujuh puluh personel mereka selain yang terbunuh, sehingga mereka kembali tanpa memperoleh apa pun dari yang mereka harapkan, yaitu menghancurkan islam dan membunuh nabi Muhammad."
  }
]