[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan pertolongan Allah untuk kalian dalam perang badar adalah untuk membinasakan segolongan dari orang-orang kafir dengan membunuh mereka. Dan orang yang selamat dari mereka dari pembunuhan, akan kembali dengan dirundung kesedihan, jiwanya sesak, tampak padanya kehinaan dan kerendahan diri."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "127. Kemenangan yang kalian capai dalam perang Badar itu hendak dijadikan oleh Allah sebagai sarana untuk membinasakan sebagian orang kafir dengan cara membunuh mereka, dan menghinakan sebagian lainnya serta membuat mereka kecewa dengan kekalahan sehingga mereka kembali dengan membawa kegagalan dan kehinaan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "127. لِيَقْطَعَ طَرَفًا مِّنَ الَّذِينَ كَفَرُوٓا۟ (untuk membinasakan segolongan orang-orang yang kafir) Yakni Allah menolong kalian di perang Badar untuk membinasakan segolongan orang kafir, dan mereka adalah orang-orang yang terbunuh di perang itu, mereka merupakan para pemimpin kekufuran dan panglima orang-orang musyrik, seperti Abu Jahal dan yang bersama mereka. يَكْبِتَهُمْ (atau untuk menjadikan mereka hina) Yakni memberi mereka kesedihan, mempersulit urusan mereka, dan menghentikan sifat melebih-lebihkan mereka. فَيَنقَلِبُوا۟ خَآئِبِينَ (lalu mereka kembali dengan tiada memperoleh apa-apa) Yakni tidak berhasil mendapatkan apa yang mereaka inginkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "127 Allah menolong kamu dalam perang Badar dan memberi bala bantuan itu untuk membinasakan segolongan orang-orang yang kafir, mereka adalah orang-orang yang terbunuh dalam perang Badar. Atau untuk menjadikan mereka hina, lalu mereka kembali dengan tidak memperoleh apa yang mereka inginkan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Untuk membinasakan segolongan orang yang kafir} untuk menghancurkan satu golongan dari orang-orang kafir dalam perang {atau untuk menjadikan mereka hina} membuat mereka hina dan marah karena kehancuran {sehingga mereka kembali tanpa memperoleh apa pun} mereka kembali dengan angan-angan yang sia-sia"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "127. ”(Allah menolongmu dalam perang badar dan memberi bala bantuan itu), untuk membinasakakn segolongan orang-orang kafir, untuk menjadikan mereka hina lalu mereka kembali dengan tiada memperoleh apa-apa”, maksudnya, pembelaan Allah terhadap hamba-hambaNya yang Mukmin tidaklah melebihi batas dari membinasakan sekelompok dari kaum kafir atau mereka kembali dengan kemarahan dari hati mereka dalam keadaan tidak mendapatkan kebaikan, sebagaiman Allah memulangkan mereka pada perang Khandaq setelah mereka datang dengan niat bulat dan kekuatan, lalu Allah mengembalikan mereka dengan kemarahan di hati mereka dan kesi-siaan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 127: Karena la hendak binasakan sebagian daripada orang-orang yang kufur atau mendukacitakan mereka, supaya mereka kembali dengan hampa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan dibunuh atau ditawan. Yakni kalah. Syaikh As Sa'diy berkata, \"Jika anda memperhatikan kenyataan, niscaya anda akan melihat bahwa pertolongan Allah kepada hamba-hamba-Nya yang mukmin antara dua macam ini; tidak lepas daripadanya, yaitu memberikan kemenangan atau membuat kecewa usaha mereka (orang-orang kafir).\""
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 127",
    "description": "Pertolongan dan bantuan Allah kepada kamu dalam perang badar adalah untuk membinasakan segolongan orang kafir dengan terbunuhnya tujuh puluh pemimpin mereka, antara lain abu jahal, atau untuk menjadikan mereka hina dengan tertawannya tujuh puluh personel mereka selain yang terbunuh, sehingga mereka kembali tanpa memperoleh apa pun dari yang mereka harapkan, yaitu menghancurkan islam dan membunuh nabi Muhammad. Kejadian yang menimpa umat islam dalam perang uhud membuat nabi sangat terpukul. Hamzah bin abdul muthalib, paman nabi, gugur, dibelah perutnya dan dikeluarkan hatinya lalu dikunyah oleh hind binti utbah bin rabiah. Rasulullah juga terluka, gigi taringnya patah dan wajahnya berlumuran darah. Rasulullah lalu berdoa kepada Allah agar menghukum sebagian orang kafir, maka Allah menegaskan bahwa hal itu bukan menjadi urusanmu nabi Muhammad, apakah Allah berkehendak mengilhamkan penyesalan bagi mereka lalu mereka bertobat dan Allah menerima tobat mereka, atau mengazabnya atas kekafiran dan kejahatan mereka, karena sesungguhnya mereka orang-orang zalim yang pantas mendapatkan azab."
  }
]