[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidak ada wewenang sedikit pun bagi mu (wahai Rasul), terkait dengan nasib-nasib para hamba. Akan tetapi, seluruh perkara semuanya tergantung kepada Allah semata, tidak ada sekutu bagiNya. Mungkin saja sebagian orang yang memerangi kalian, hati mereka akan terbuka untuk menerima islam, lalu mereka memeluk islam, maka Allah menerima taubat mereka. Dan barang siapa yang tetap bertahan di atas kekufurannya, niscaya Allah akan menyiksa mereka di dunia dan di akhirat disebabkan oleh kezhalimannya dan perbuatan aniayanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "128. Tatkala Rasulullah mendoakan agar para pemimpin orang-orang musyrik binasa setelah apa yang mereka lakukan dalam perang Uhud, Allah berfirman kepadanya, “Engkau tidak berhak mengatur urusan mereka, karena itu adalah urusan Allah. Maka bersabarlah sampai Allah memberikan keputusan di antara kalian, atau membimbing mereka untuk bertaubat dan memeluk agama Islam, atau mereka terus mempertahankan kekafiran sehingga Allah menimpakan azab kepada mereka, karena mereka adalah orang-orang zalim yang pantas mendapatkan azab.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "128. Hai Rasulullah, kamu tidak memiliki kuasa dalam urusan para makhluk melainkan untuk melaksanakan perintahku terhadap mereka. Segala urusan mereka berada di tangan Allah, bisa jadi Allah menerima taubat mereka yang bertaubat, atau menyiksa mereka akibat kekafiran yang mereka perbuat sebab mereka adalah orang-orang yang zalim."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "128. لَيْسَ لَكَ مِنَ الْأَمْرِ شَىْءٌ (Tak ada sedikitpun campur tanganmu dalam urusan mereka itu) Dikeluarkan oleh Imam Bukhari dan Muslim bahwa gigi seri Rasulullah pecah pada perang Uhud, dan terluka di wajahnya hingga mengalir darah darinya. Lalu Beliau bersabda: bagaimana mungkin sebuah kaum akan beruntung jika mereka melakukan hal ini kepada Nabi mereka padahal dia menyeru kepada Tuhan mereka. Maka turunlah ayat ini. Dan dari Imam Bukhari dan Muslim juga dari Ibnu Umar ia berkata: Rasulullah bersabda pada perang Uhud: “Ya Allah laknatlah Abu Sufyan, Ya Allah laknatlah Harist Bin Hisyam, Ya Allah laknatlah Suhail bin Amr”. Lalu turunlah ayat ini. Dan kemudian urusan mereka telah berubah menjadi Islam. Alhamdulillah. Makna dari ayat ini adalah bahwa Allah lah pemilik urusan mereka, Dia memperlakukan mereka dengan apa yang dikehendaki-Nya baik itu membinasakan mereka, membuat mereka kalah, menerima taubat mereka bila masuk Islam, atau mengazab mereka. أَوْ يَتُوبَ عَلَيْهِمْ أَوْ يُعَذِّبَهُمْ(atau Allah menerima taubat mereka, atau mengazab mereka) Dalam potongan ayat ini terdapat isyarat bahwa kaum Quraisy akan menjadi kaum yang beriman."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "128 Tak ada sedikitpun campur tanganmu dalam urusan mereka itu wahai Nabi, semua ada pada kehendak Allah. Allah membinasakan mereka atau Allah menerima taubat mereka, atau mengazab mereka karena atas kekufuran mereka dengan kehendak-Nya. Sesungguhnya mereka itu berhak menerika siksa jika mereka tidak mau beriman. Ini adalah sindiran atas keimanan suku Quraisy. Anas berkata sesungguhnya Nabi terluka seperempat tubuhnya, kepalanya terluka sampai darah mengalir di wajahnya. Maka nabi berkata: Bagaimana suatu kaum bisa menang dengan melakukan seperti ini kepada Nabi mereka, seraya Nabi berdoa untuk mereka kepada Allah. Maka Allah menurunkan ayat ini."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Hal itu sama sekali bukan menjadi urusanmu atau apakah Allah menerima taubat mereka atau mengazab mereka karena sesungguhnya mereka adalah orang-orang zalim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "128. Ketika Nabi tertimpa musibah pada perang Uhud hingga gigi depan beliau patah, kepala beliau terluka, belau berkata, ”Bagaimana mungkin akan beruntung suatu kaum yang telah melukai wajah nabi mereka dan memecahkan giginya..” Maka Allah menurunkan ayat di atas, dan menjelaskan bahwa segala urusan itu milik Allah dan bahwa Rasululloh tidak memiliki wewenang sedikitpun, karena beliau hanyalah seorang hamba dari hamba-hamba Allah, sedang mereka semua sedang berada di bawah penghambaan Rabb, mereka itu adalah yang diatur, bukan yang mengatur. Dan mereka yang telah engkau doakan keburukan wahai Rasul, atau yang telah engkau mustahilkan mendapat petunjuk dan keberuntungan, bila Allah menghendaki, niscaya Dia mengampuni mereka dan memberi mereka taufik ke dalam islam, dan itu telah dilakukan olehnya, diapun akan menyiksa mereka karena mereka adalah orang-orang yang zhalim yang berhak mendapatkan hukuman dan siksaan dari Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 128: Engkau tidak mempunyai hak sedikit jua pun dari urusan itu; Allah beri taubat atas maupun mereka ataupun la siksa mereka, lantaran mereka itu orang-orang yang zhalim.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini turun ketika perang Uhud Nabi Muhammad shallallahu 'alaihi wa sallam terluka, gigi Beliau pecah dan wajah Beliau terluka, maka Beliau berkata, \"Bagaimana suatu kaum yang melukai wajah nabi mereka dan memecahkan giginya akan beruntung?\" (sebagaimana dalam Shahih Muslim). Beliau kemudian mendoakan kebinasaan kepada tokoh-tokoh orang musyrik seperti Abu Sufyan bin Harb, Shafwan bin Umayyah, Suhail bin 'Amr dan Harits bin Hisyam, maka turunlah ayat ini yang melarang Beliau mendoakan laknat kepada mereka dan dijauhkan dari rahmat Allah. Menurut hadits Anas yang diriwayatkan oleh Muslim, bahwa Rasulullah shallallahu 'alaihi wa sallam mendoakan keburukan selama tiga puluh hari di waktu Subuh kepada mereka yang membunuh beberapa orang di Bi'ruma'unah. Beliau mendoakan keburukan kepada suku Ri'il, Dzakwan, Lihyan, dan 'Ushayyah yang bermaksiat kepada Allah dan Rasul-Nya. Anas berkata, \"Allah Azza wa Jalla menurunkan ayat yang kami baca berkenaan mereka yang membunuh beberapa orang di Bi'ruma'unah, kemudian dimansukh setelahnya. Mereka (yang mati syahid) menyampaikan, \"Sampaikanlah kepada kaum kami, bahwa kami telah bertemu Tuhan kami, Dia ridha kepada kami dan kami pun ridha kepada-Nya.\" Ayat di atas bisa turun berkenaan semua itu karena mungkin turunnya tidak segera, dan antara masing-masing kisah tidak berjauhan terjadinya sehingga mencakup semua itu. Kewajibanmu hanyalah menyampaikan, membimbing manusia dan memberitahukan hal yang bermaslahat bagi mereka. Adapun yang demikian adalah urusan Allah, oleh karena itu bersabarlah. Jika hikmah (kebijaksanaan) Allah dan rahmat-Nya menghendaki, bisa saja Dia menerima tobat mereka dan menjadikan mereka masuk Islam, dan jika hikmah-Nya menghendaki, bisa saja membiarkan mereka di atas kekafiran sehingga mereka akan mendapat siksa. Hal ini menunjukkan keadilan Allah dan kebijaksanaan-Nya, di mana Dia meletakkan hukuman pada tempatnya, Dia tidak menzalimi hamba-Nya, tetapi hamba itulah yang menzalimi dirinya sendiri."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 128",
    "description": "Kejadian yang menimpa umat islam dalam perang uhud membuat nabi sangat terpukul. Hamzah bin abdul muthalib, paman nabi, gugur, dibelah perutnya dan dikeluarkan hatinya lalu dikunyah oleh hind binti utbah bin rabiah. Rasulullah juga terluka, gigi taringnya patah dan wajahnya berlumuran darah. Rasulullah lalu berdoa kepada Allah agar menghukum sebagian orang kafir, maka Allah menegaskan bahwa hal itu bukan menjadi urusanmu nabi Muhammad, apakah Allah berkehendak mengilhamkan penyesalan bagi mereka lalu mereka bertobat dan Allah menerima tobat mereka, atau mengazabnya atas kekafiran dan kejahatan mereka, karena sesungguhnya mereka orang-orang zalim yang pantas mendapatkan azab. Segala urusan haruslah dikembalikan kepada Allah, karena milik Allah-lah apa yang ada di langit dan apa yang ada di bumi. Dia mengampuni dosa dan merahmati siapa yang dia kehendaki, dan mengazab siapa yang dia kehendaki yang memang wajar diazab karena perbuatan jahat mereka. Dan Allah maha pengampun bagi orang yang bertobat dan maha penyayang dengan memaafkan dosa orang yang bertobat kepada-Nya."
  }
]