[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan milik Allah semata apa-apa yang ada di langit dan apa-apa yang ada di bumi. Dia mengampuni siapa saja yang Dia kehendaki dari hamba-hambaNya karena sifat rahmatNya, dan menyiksa siapa saja yang Dia kehendaki karena sifat adilNya. Dan Allah Maha Pengampun terhadap dosa-dosa hamba-hambaNya, juga Maha Penyayang terhadap mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "129. Kepunyaan Allah-lah apa yang ada di langit dan apa yang ada di bumi dalam hal penciptaan dan pengaturan. Dia mengampuni dosa-dosa orang yang dikehendaki-Nya dengan kasih sayang-Nya, dan menyiksa orang yang dikehendaki-Nya dengan keadilan-Nya. Dan Allah Maha Pengampun bagi orang yang bertaubat lagi Maha Penyayang kepada mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "129. Hanya milik Allah segala yang ada di langit dan di bumi. Dia berbuat dalam kekuasaan-Nya sesuai kehendak-Nya, mengampuni hamba-Nya yang Dia kehendaki dengan rahmat-Nya, dan menyiksa hamba-Nya yang Dia kehendaki dengan keadilan-Nya. Dan Allah Maha Mengampuni dosa hamba-hamba-Nya dan Maha Menyayangi mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "129. وَلِلَّـهِ مَا فِى السَّمٰوٰتِ وَمَا فِى الْأَرْضِ ۚ (Kepunyaan Allah apa yang ada di langit dan yang ada di bumi) Yakni untuk menjelaskan luasnya kekuasaannya. يَغْفِرُ لِمَن يَشَآءُ(. Dia memberi ampun kepada siapa yang Dia kehendaki) Yakni yang Dia kehendaki untuk diampuni. وَيُعَذِّبُ مَن يَشَآءُ ۚ( Dia menyiksa siapa yang Dia kehendaki) Yakni yang Dia kehendaki utuk diazab, Dia memperlakukan kekuasaan-Nya apa yang dikehendaki-Nya, dan menghukum apa yang Dia kehendaki. وَاللهُ غَفُورٌ رَّحِيمٌ (, dan Allah Maha Pengampun lagi Maha Penyayang) Sebagai isyarat bahwa rahmat-Nya mendahului kemurkaan-Nya, dan seruan untuk kaum Quraisy agar melihat kembali sikap mereka terhadap Islam; juga isyarat bahwa sebagian mereka akan memeluk Islam."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "129 Kemudian Allah membangun keluasan kerajaan-Nya. Ingatlah bahwa kepunyaan Allah-lah apa yang ada di langit dan yang ada di bumi serta segala makhluk yang ada di antara keduanya. Dia memberi ampunan kepada siapa saja yang Dia kehendaki dengan karunia-Nya; Dia menyiksa siapa yang Dia kehendaki dengan keadilan-Nya, dan Allah Maha Pengampun lagi Maha Penyayang kepada orang yang meminta ampun. Ini adalah isyarat bahwa rahmat Allah itu lebih luas daripada kemurkaan-Nya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Milik Allahlah segala yang ada di langit dan di bumi. Dia mengampuni siapa saja yang Dia kehendaki dan mengazab siapa saja yang Dia kehendaki. Allah Maha Pengampun lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "129. Allah mengabarkan bahwa dialah yang mengatur segala alam yang di langit maupun yang di bumi. Dan bahwasanya Allah memberi taubat kapada siapa yang di kehendakiNya lalu mengampuninya, dan menghinakan siapa yang di kehendakiNya sehingga dia menyiksanya. Dan Allah Mahapengampun Lagi Maha Penyayang, ”Maka diantara sipatnya yang pasti adalah kesempurnaan ampunan dan kasih sayang, dan adanya tuntunan dari kesempurnaan itu, maka dia mengampuni orang-orang yang bertaubat dan memberikan kasih sayangNya kepada orang yang melaksanakan sebab-sebab yang mengharuskanya mendapat kasih sayang, Allah berfirman: Dan taatilah Allah dan Rasul, supaya kamu diberi rahmat (Ali-imron:132)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 129: Dan kepunyaan Allah-lah apa yang di langit dan apa yang di bumi; Ia akan mengampuni siapa yang Ia kehendaki; menyiksa siapa yang ia kehendaki dan Allah itu pengampun, penyayang."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah disebutkan di ayat sebelumnya bahwa Rasulullah shallallahu 'alaihi wa sallam tidak memiliki hak campur tangan dalam urusan mereka, Allah menetapkan bahwa yang demikian adalah urusan Allah, milik-Nya dan ciptaan-Nya apa yang ada di langit dan apa yang ada di bumi. Jika demikian, maka makhluk-Nya itu bisa diampuni-Nya dan bisa diberi-Nya azab. Dia mengampuni siapa yang Dia kehendaki dengan memberinya hidayah Islam sehingga dosa syirknya diampuni dan mengaruniakan kepadanya meninggalkan maksiat sehingga dosanya diampuni. Dia juga mengazab siapa yang Dia kehendaki, dengan menyerahkan urusannya kepada dirinya yang jahil (bodoh) dan zalim sehingga mengerjakan perbuatan buruk dan akan memperoleh azab-Nya. Di akhir ayat, Allah menutup dengan dua nama-Nya yang mulia \"Al Ghafur & Ar Rahim\" yang menunjukkan luasnya rahmat, ampunan dan ihsan (kebaikan)-Nya. Diakhirinya dengan dua nama itu menunjukkan bahwa rahmat-Nya mengalahkan kemurkaan-Nya dan ampunan-Nya mengalahkan siksa-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 129",
    "description": "Segala urusan haruslah dikembalikan kepada Allah, karena milik Allah-lah apa yang ada di langit dan apa yang ada di bumi. Dia mengampuni dosa dan merahmati siapa yang dia kehendaki, dan mengazab siapa yang dia kehendaki yang memang wajar diazab karena perbuatan jahat mereka. Dan Allah maha pengampun bagi orang yang bertobat dan maha penyayang dengan memaafkan dosa orang yang bertobat kepada-Nyakaum kafir membiayai perang, termasuk perang uhud, dengan harta yang mereka peroleh dengan cara riba. Oleh karena itu Allah mengingatkan, wahai orang-orang yang beriman! janganlah kamu memakan riba, yaitu mengambil nilai tambah dari pihak yang berutang dengan berlipat ganda sebagaimana yang terjadi pada masyarakat jahiliah, maupun penambahan dari pokok harta walau tidak berlipat ganda, dan bertakwalah kepada Allah, antara lain dengan meninggalkan riba, agar kamu beruntung di dunia dan di akhirat (lihat: surah al-baqarah/2: 279)."
  }
]