[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang yang beriman kepada Allah dan RasulNya serta melaksanakan syariatNya, jauhilah riba dengan segala jenisnya, dan janganlah kalian mengambil tambahan dalam pinjaman kalian melebihi jumlah modal harta kalian, meskipun sedikit, apalagi bila tambahan itu berjumlah banyak, menjadi berlipat ganda tiap kali jatuhnya tempo pembayaran hutang. Dan bertakwalah kepada Allah dengan komitmen dengan ajaran syariatNya, supaya kalian mendapatkan keberuntungan di dunia dan akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "130. Wahai orang-orang yang beriman kepada Allah dan mengikuti Rasul-Nya, hindarilah mengambil riba sebagai tambahan yang berlipat ganda atas modal yang kalian pinjamkan, seperti yang dilakukan oleh orang-orang jahiliyah. Dan takutlah kalian kepada Allah dengan cara menjalankan perintah-perintah-Nya dan menjauhi larangan-larangan-Nya, agar kalian mendapatkan kebaikan dunia dan akhirat yang kalian inginkan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "130-131. Allah melarang orang-orang beriman dari berinteraksi dengan riba saat berutang piutang -dengan meminta tambahan atas hutang pokok- baik itu sedikit maupun banyak, sebab riba itu akan terus bertambah seiring dengan bertambahnya tenggang waktu. Takutlah kalian kepada Allah dalam menjalankan hukum-hukum-Nya agar kalian dapat meraih surga. Kemudian Allah menekankan hal itu dengan mengancamkan neraka Jahannam yang telah disiapkan bagi orang-orang kafir. Lihat: surat al-Baqarah: 24."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "130. أَضْعٰفًا مُّضٰعَفَةً ۖ (dengan berlipat ganda) Kalimat ini merupakan selingan yang diselipkan diantara pengkisahan perang Uhud. Mereka diperintahkan untuk meninggalkan riba dan menginfakkan harta mereka di jalan Allah dan mempersiapkan diri untuk menyebarkan Islam. Dan sebagaimana diketahui bahwa haramnya diba berlaku dalam keadaan apapun, akan tetapi ia disebutkan disini untuk mengingatkan apa yang mereka dahulu lakukan; dahulu mereka melakukan riba dengan memberi batas waktu tertentu dan apabila telah habis batas waktu tersebut mereka menambahnya lagi dan begitu seterusnya sampai berulang-ulang sehingga orang yang mengambil riba mendapatkan berkali-kali lipat dari hutang yang ia berikan pada kali pertama."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "130 Kemudian disebutkan dalam kisah perang Uhud tentang perintah untuk meninggalkan riba dan menyedekahkan harta untuk berjuang di jalan Allah. Allah berfirman: Janganlah kamu memakan riba dengan berlipat ganda sebagaimana yang kalian lakukan pada masa Jahiliyyah dan bertakwalah kamu kepada siksa Allah dari memakan riba supaya kamu mendapat keberuntungan di dunia dan akhirat. Mereka membeli dengan tempo, jika jatuh tempo maka mereka mengambil tambahan dan temponya bertambah. Maka turunlah ayat ini."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, janganlah kalian memakan riba dengan berlipat ganda dan bertakwalah kepada Allah agar kalian beruntung."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "130. telah berlalu pada mukadimah tafsir ini bahwa seorang hamba seyogyanya memperhatikan perintah dan larangan pada dirinya dan orang lain. Dan bahwasanya Allah apabila memerintahkan kepadanya suatu perintah, maka dia wajib mengetahui pertama batasanya dan apa yang di perintahkan tersebut agar dia mampu menaati hal tersebut, dan apabila dia telah mengetahui hal itu, maka hendaklah berusaha dan meminta pertolongan kepada Allah untuk menaatinya dan pada dirinya maupun pada orang lain sesuai dengan kemampuanya dan kapasitasnya. Demikian pula bila dilarang dari sesuatu, dia mengetahui batasnya dan hal-hal yang termasuk di dalamnya dan yang tidak termasuk, kemudian dia berusaha meminta pertolangan dari Rabbnya dalam meninggalkanya, dan bahwasanya hal ini wajib untuk di perhatikan dalam segala perintah Allah dan larangaNya. Ayat-ayat yang mulia ini terkandung di dalamnya berbagai perintah dan perkara dari perkara-perkara kebaikan. Allah memerintahkan kepadanya dan menganjurkan untuk mengamalkannya, lalu Allah mengabarkan tentang balasan pelakunya, dan mengabarkan larangan-larangan yang dianjurkan untuk ditinggalkan. Barangkali hikmah -walahu alam- dalam memasukan ayat-ayat ini di dalam kisah perang uhud adalah seperti yang di jelaskan bahwasanya Allah telah berjanji kepada hamba-hambanya yang Mukmin yaitu apabila mereka bersabar dan bertakwa niscaya Allah akan membela mereka dalam mengahadapi musuh-musuh mereka dan menghinakan musuh untuk mereka, sebagaiman pada firman Allah, \"Jika kamu bersabar dan bertakwa, niscaya tipu daya mereka sedikitpun tidak mendatangkan kemudharatan kepadamu. Sesungguhnya Allah mengetahui segala apa yang mereka kerjakan.\" -(Ali-imran:120) \"Ya (cukup), jika kamu bersabar dan bersiap-siaga, dan mereka datang menyerang kamu dengan seketika itu juga, niscaya Allah menolong kamu dengan lima ribu Malaikat yang memakai tanda.\" (Ali imron: 125). Seakan-akan jiwa merindukan pengetahuan akan sipat-sipat ketakwaan yang akan mengakibatkan adanya pertolongan, kemenangan, dan kebahagiaan, maka Alllah menyebutkan dalam ayat-ayat ini sipat-sipat ketakwaan yang terpenting yang mana bila seorang hamba menunaikannya, niscaya pelaksanaannya pada hal yang lain lebih utama dan lebih patut. Dan dasar dari pernytaaan yang telah kami katakan, adalah bahwa Allah telah menyebutkan lafadz takwa pada ayat-ayat ini sebanyak tiga kali, sekali berbentuk mutlak yaitu firmanNya, “Yang disediakan untuk orang-orang yang bertakwa,” dan dua kali berbentuk muqayyad dalam firmanNya, “bertakwalah kepada Allah,” dan “Dan peliharalah dirimu dari api neraka.” Dan firman Allah, ”Hai orang-orang yang beriman,” setiap berupa yang ada di alqur’an berupa firman Allah ”Hai orang-orang yang beriman, lakukan ini atau tinggalkanlah ini,” menunjukan bahwa keimanan itu adalah penyebab yang mendorong untuk menjalani perintah atau menjauhi larangan tersebut, karena keimanan itu adalah keyakinan yang total kepada perkara yang memang wajib di yakini yang menuntut terwujudnya perbuatan anggota tubuh. Maka Allah melarang mereka dari memakan riba dengan berlipat-lipat ganda, di mana perkara itu adalah perkara yang biasa di lakukan oleh orang-orang jahiliyyah dan orang-orang yang tidak mempedulikan perkara-perkara syari’at, yaitu bila jatuh tempo hutang atas seorang yang sedang kesulitan sementara ia tidak memiliki apa-apa untuk menunaikanya, maka mereka berkata kepadanya “Kamu harus menunaikan hutangmu atau kami menambah tempo atas hutangmu itu dengan menambah bunga hutung dalam tanggunganmu.” Maka orang kafir terpaksa harus membayar kepada pemilik hutang, dan konsisten terhadap hal itu demi meraih ketenangan hati yang bersipat sementara hingga bertambahlah hutang yang harus di lunasinya dengan berlipat-lipat ganda tanpa ada manfaat dan pemanfaataannya. Maka dalam firmanNya, ”Dengan Berlipat Ganda,” terdapat peringatan terhadap kekejian yang besar di sebabkan banyaknya dan peringatan terhadap hikmah di balik pengahramanya,dan bahwasanya hikmah di balik pengharaman riba adalah bahwa Allah melarang dari hal tersebutkarena mengandung kezhaliman.Hal tersebut karena Allah mewajibkan untuk menagguhkan orang yang sedang dalam kondisi sulit dan membiarkan hutang tersebut seperti semula tanpa ada tambahan. Maka mengharuskan pembayaran hutang dengan yang lebih dari itu merupakan tindakan kezhaliman yang berlipat-lipat. Oleh karena itu, wajiblah atas seorang Mukmin yang bertakwa meninggalkan hal itu dan tidak mendekat kepadanya,karena meninggalkan hal tersebut merupakan konsekuensi ketakwaan, dan keberuntungan itu tergantung dengan ketakwaan. karena itu Allah berfirman,”bertakwalah kamu kepada Allah supaya kamu mendapat keberuntungan.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 130: Hai orang-orang yang beriman! Janganlah kamu memakan riba berganda-ganda; dan takutlah kepada Allah supaya kamu dapat kejayaan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Menurut Syaikh As Sa'diy, bahwa hikhmah –dan Allah yang lebih mengetahui- dimasukkan ayat ini di sela-sela kisah perang Uhud adalah karena sebelumnya Allah telah menjanjikan, jika mereka bersabar dan bertakwa, maka Dia akan memenangkan mereka dan mengalahkan musuh mereka, dan nampaknya jiwa menjadi rindu untuk mengetahui lebih dalam tentang perkara-perkara takwa yang menjadi sebab kemenangan, keberuntungan dan kebahagiaan, maka disebutkanlah lafaz takwa tiga kali, yaitu di ayat 130, 131dan 133. Ditujukan kepada orang-orang yang beriman, karena hanya orang-orang yang beriman yang dapat melakukan perintah-perintah Allah dan menjauhi larangan-Nya, di mana iman itu adalah pembenaran yang sempurna terhadap sesuatu yang wajib dibenarkan dan menghendaki adanya amal dari anggota badan. Hal ini menunjukkan bahwa iman, tidak hanya ucapan saja, bahkan disertai amal. Oleh karena itu, para ulama mengatakan bahwa \"Al Iman qaul wa 'amal\" (Iman adalah ucapan yang didukung oleh hati dan adanya amal). Menurut sebagian besar ulama adalah bahwa riba itu selamanya haram, walaupun tidak berlipat ganda. Riba yang dimaksud dalam ayat ini adalah Riba nasiah yang umum terjadi dalam masyarakat Arab zaman jahiliyah, yaitu ketika orang yang berhutang sudah jatuh tempo harus membayar, namun ia belum mampu, orang yang memberi pinjaman berkata, \"Kamu mau membayar hutangmu atau saya tambah lagi waktunya namun hutangmu juga bertambah\"."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 130",
    "description": "Kaum kafir membiayai perang, termasuk perang uhud, dengan harta yang mereka peroleh dengan cara riba. Oleh karena itu Allah mengingatkan, wahai orang-orang yang beriman! janganlah kamu memakan riba, yaitu mengambil nilai tambah dari pihak yang berutang dengan berlipat ganda sebagaimana yang terjadi pada masyarakat jahiliah, maupun penambahan dari pokok harta walau tidak berlipat ganda, dan bertakwalah kepada Allah, antara lain dengan meninggalkan riba, agar kamu beruntung di dunia dan di akhirat (lihat: surah al-baqarah/2: 279)dan peliharalah dirimu dari api neraka, lantaran kamu menghalalkan, mempraktikkan, dan memakan riba, yang mengantarkan kamu kepada siksa api neraka yang disediakan bagi orang-orang kafir. Karena praktik riba dapat menghancurkan sistem ekonomi maka pelaku riba ditempatkan dalam tempat yang sama dengan orang-orang kafir."
  }
]