[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan jadikanlah untuk diri kalian pelindung antara diri kalian dengan neraka yang disediakan bagi orang-orang kafir."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "131. Dan buatlah pelindung antara diri kalian dan api neraka yang Allah siapkan bagi orang-orang kafir. Yaitu dengan cara mengerjakan amal perbuatan yang saleh dan meninggalkan perbuatan yang diharamkan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "131. وَاتَّقُوا۟ النَّارَ الَّتِىٓ أُعِدَّتْ لِلْكٰفِرِينَ (Dan peliharalah dirimu dari api neraka, yang disediakan untuk orang-orang yang kafir) Dalam ayat ini terdapat petunjuk agar menjauhi apa yang dilakukan orang-orang kafir dalam muamalat mereka. Makna ayat ini adalah bahwa memakan harta riba adalah perbuatan orang-orang kafir, maka jauhilah riba yang dapat mencabut iman dari kalian sehingga kalian berhak mendapatkan neraka sebagaimana orang-orang kafir."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "131 Dan peliharalah dirimu dari api neraka Jahannam yang telah disiapkan untuk orang kafir wahai orang mukmin, maksudnya adalah bahwa memakan harta riba adalah kebiasaan orang kafir, bukan orang mukmin."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan waspadalah kepada api neraka yang disediakan bagi orang-orang kafir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "131. “Dan peliharalah dirimu dari api neraka, yang di sediakan untuk orang-orang yang kafir,” dengan cara meninggalkan hal-hal yang akan menjerumuskan ke dalamnya, berupa kekufuran dan kemaksiatan dengan perbedaan tingkatannya, karena seluruh kemaksiatan, khususnya kemaksiatan yang besar, akan menyeret kapada kekufuran, bahkan ia merupakan sipat dari kekufuran yang telah Allah telah siapkan bagi para pelaku-pelakunya. Maka meninggalkan kemaksiatan akan menjauhkan dari apa neraka dan menjaga diri dari kemurkaan yang maha kuasa. sedang perbuatan-perbuatan baik dan ketaatan akan mendapatkan ridho Allah, masuk ke dalam syurga dan mendapat rahmat, Oleh karena itu Allah berfirman,"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 131: Dan hendaklah kamu takut kepada neraka untuk kafirin,yang disediakan Dan taatlah ke pada Allah dan Rasul"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni dengan meninggalkan segala perbuatan yang menyebabkan kita masuk neraka berupa kekufuran dan kemaksiatan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 131",
    "description": "Dan peliharalah dirimu dari api neraka, lantaran kamu menghalalkan, mempraktikkan, dan memakan riba, yang mengantarkan kamu kepada siksa api neraka yang disediakan bagi orang-orang kafir. Karena praktik riba dapat menghancurkan sistem ekonomi maka pelaku riba ditempatkan dalam tempat yang sama dengan orang-orang kafirsetelah Allah menjelaskan kejahatan dan hukuman bagi pelaku riba, pada ayat ini Allah mengemukakan tuntunan umum tentang kewajiban taat kepada Allah dan rasulullah. Dan taatlah kepada Allah dan rasul Muhammad, agar kamu diberi rahmat oleh Allah (lihat: surah annisa''/4: 59)."
  }
]