[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan bersegeralah dengan ketaatan kalian kepada Allah dan rosulNya supaya kalian bisa meraih ampunan yang agung dari tuhan kalian dan surga yang luas, luasnya seluas langit dan bumi, Allah menyiapkannya untuk orang-orang yang bertaqwa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "133. Segeralah berbuat kebajikan dan mendekatkan diri kepada Allah dengan melaksanakan beragam jenis ibadah, agar kalian mendapatkan ampunan yang besar dari Allah dan masuk ke dalam surga yang luasnya seluas langit dan bumi, yang Allah siapkan bagi hamba-hamba-Nya yang bertakwa."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "133. Hai orang-orang beriman, berlomba-lombalah kalian dalam beramal shalih agar kalian dapat meraih ampunan dari Tuhan atas dosa-dosa kalian, dan masuk surga yang luasnya seluas langit dan bumi yang Allah siapkan bagi orang-orang yang mentaati perintah dan menjauhi larangan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "133. وَسَارِعُوٓا۟ إِلَىٰ مَغْفِرَةٍ (Dan bersegeralah kamu kepada ampunan) Ini merupakan perintah bagi orang-orang beriman untuk bergegas dalam menjalankan kebaikan dan tidak menunda-nunda. عَرْضُهَا السَّمٰوٰتُ وَالْأَرْضُ (yang luasnya seluas langit dan bumi) Keduanya adalah makhluk Allah yang terluas berdasarkan apa yang diketahui hamba-Nya. Lalu bagaimana kalian melakukan perbuatan yang menjadikan kalian diharamkan untuk memasuki surga dengan keluasannya, Padahal surga itu disiapkan untuk orang-orang bertakwa. Lalu kalian memakan harta riba kemudian masuk neraka yang disiapkan untuk orang-orang kafir."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Tatkala Allah memotifasi hamba-Nya dengan syurga-Nya, Dia berfirman : { وَسَارِعُوا إِلَىٰ مَغْفِرَةٍ مِنْ رَبِّكُمْ وَجَنَّةٍ } \"Dan bersegeralah kamu kepada ampunan dari Tuhanmu dan kepada surga\" , tetapi tatkala Dia membolehkan mereka mencari kekayaan dunia, Allah berfirman : { فَامْشُوا فِي مَنَاكِبِهَا } \"maka berjalanlah di segala penjurunya\" [al-Mulk : 15], maka tidak seharusnya kedua perkara ini terjadi yang sebaliknya, sehingga ketika mengejar dunia manusia berlomba-loba mengejarnya, dan kepada akhirat mereka bermalas-malasan!"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "133 Dan bersegeralah kamu kepada sebab diberikannya ampunan dari Tuhanmu dengan melakukan taubat dan ketaatan juga bersegera kepada apa yang menjadikan Allah ridho dan kepada surga yang luasnya seluas langit dan bumi yang disediakan untuk orang-orang yang bertakwa: yaitu orang-orang yang menjauhi maksiat dan maksiat yang besar yaitu riba."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bersegeralah menuju ampunan} bersegeralah kalian menuju amal yang mendapatkan ampunan {dari Tuhan kalian dan surga yang luasnya itu seperti langit dan bumi yang disediakan bagi orang-orang yang bertakwa,"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "133. Kemudian Allah memerintahkan mereka untuk segera menuju ampunaNYa dan menggapai syurgaNya yang luasnya seluas langit dan bumi, lalu bagaimana dengan kadar panjangnya yang disiapkan bagi orang-orang yang bertakwa? Mereka itu adalah penghuni-penghuninya dan perbuatan-perbutan ketakwaanlah yang akan menyampaikan kepadanya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 133: Dan berlomba-lombalah kepada keampunan dari Tuhan kamu dan surga yang lebarnya (seluas) langit dan bumi, yang disediakan untuk orang-orang yang berbakti."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 133",
    "description": "Setelah diperintahkan taat kepada Allah dan nabi Muhammad, umat islam diperintahkan juga untuk berlomba meningkatkan kualitas ketakwaan. Dan bersegeralah kamu dengan saling mendahului untuk mencari ampunan dari tuhanmu dengan menyadari kesalahan dan tidak mengulangi kesalahan yang sama, dan mengerjakan amalan-amalan yang diridai Allah untuk mendapatkan surga yang luasnya seluas langit dan bumi, yang disediakan bagi orang-orang yang bertakwa, yang taat menjalankan perintah dan menjauhi larangan-Nya. Mereka adalah orang yang terus-menerus berinfak di jalan Allah, baik di waktu lapang, mempunyai kelebihan harta setelah kebutuhannya terpenuhi, maupun sempit, yaitu tidak memiliki kelebihan, dan orangorang yang menahan amarahnya akibat faktor apa pun yang memancing kemarahan dan memaafkan kesalahan orang lain. Dan akan sangat terpuji orang yang mampu berbuat baik terhadap orang yang pernah berbuat salah atau jahat kepadanya, karena Allah mencintai, melimpahkan rahmat-Nya tiada henti kepada orang yang berbuat kebaikan. Pesan-pesan yang mirip dengan kandungan ayat ini disampaikan pula melalui surah an-nahl/16: 126; asy-syura'/42: 40 dan 43."
  }
]