[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang yang menginfakkan harta mereka dalam keadaan mudah dan susah, dan orang-orang yang menahan apa yang ada dalam diri mereka berupa amarah dengan cara bersabar, dan apa bila mereka mampu memaafkan orang yang menzolimi mereka, dan ini merupakan kebaikan yang Allah cintai pemiliknya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "134. Orang-orang yang bertakwa ialah orang-orang yang membelanjakan hartanya di jalan Allah dalam keadaan mudah maupun susah, yang menahan amarahnya meskipun sebenarnya mampu melampiaskannya, dan yang memaafkan orang yang berbuat zalim kepadanya. Dan Allah menyukai orang-orang yang berbuat baik yang memiliki perangai semacam itu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "134-135. Sifat orang yang bertakwa adalah senantiasa menginfakkan hartanya baik itu di saat kaya maupun susah, menahan kemarahannya dengan bersabar, dan memaafkan orang yang bersalah terhadapnya. Allah mencintai orang-orang yang baik dalam berinteraksi, memohon ampunan kepada-Nya jika berbuat dosa kecil atau besar, dan yakin tidak ada yang dapat mengampuni dosa melainkan Allah, serta tidak terus menerus melakukan kemaksiatannya, mereka mengetahui betapa buruknya kemaksiatan, namun jika mereka bertaubat niscaya Allah akan menerima taubat mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "134. الَّذِينَ يُنفِقُونَ فِى السَّرَّآءِ ((yaitu) orang-orang yang menafkahkan (hartanya), baik di waktu lapang) Yakni dalam keadaan lapang dan makmur. وَالضَّرَّآءِ (maupun sempit) Yakni dalam keadaan susah dan miskin. وَالْكٰظِمِينَ الْغَيْظَ (dan orang-orang yang menahan amarahnya) Yakni yang menyembunyikan kemarahan mereka dan menahannya dalam hati mereka, sehingga tidak berbuat zalim kepada seorangpun sebab kemarahan mereka. Dikatakan (كظم غيظه) apabila ia mendiamkannya dan tidak memperlihatkannya. وَالْعَافِينَ عَنِ النَّاسِ ۗ (dan memaafkan (kesalahan) orang) Yakni tidak membalas kesalahan yang dilakukan orang lain kepada mereka padahal ia berhak untuk mendapat balasan. Dan ini apabila mereka sebenarnya mampu untuk membalas. وَاللهُ يُحِبُّ الْمُحْسِنِينَ (Allah menyukai orang-orang yang berbuat kebajikan) Yakni dengan memberi maaf dan perbuatan baik lainnya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Manasik haji itu bagaikan sebuah lahan taqwa yang luas : di dalamnya ada anjuran infaq dan sedekah, melatih pengontrolan diri, dan peluang yang besar untuk saling memberi maaf, dan berbuat baik kepada semua umat manusia, perhatikan firman Allah : { أُعِدَّتْ لِلْمُتَّقِينَ , الَّذِينَ يُنْفِقُونَ فِي السَّرَّاءِ وَالضَّرَّاءِ وَالْكَاظِمِينَ الْغَيْظَ وَالْعَافِينَ عَنِ النَّاسِ ۗ وَاللَّهُ يُحِبُّ الْمُحْسِنِينَ } \"Allah menyiapkannya untuk orang-orang yang bertaqwa , (yaitu) orang-orang yang menafkahkan (hartanya), baik di waktu lapang maupun sempit, dan orang-orang yang menahan amarahnya dan memaafkan (kesalahan) orang. Allah menyukai orang-orang yang berbuat kebajikan\". 2 ). Dalam penjelasan sifat-sifat orang bertaqwa, yang mereka adalah orang-orang yang dijanjikan surga oleh Allah , ayat ini dimulai dengan : { الَّذِينَ يُنْفِقُونَ فِي السَّرَّاءِ وَالضَّرَّاءِ } \"(yaitu) orang-orang yang menafkahkan (hartanya), baik di waktu lapang maupun sempit\", dan sejatinya kalimat yang lebih utama untuk mengawali ayat ini adalah perkara meninggalkan kemaksiatan sebagaimana yang juga disebutkan dalam ayat ini, atau dengan menjelaskan tentang amalan yang mulia yaitu shalat, dan hikmahnya adalah tatkala Allah menjelaskan larangan-Nya memakan harta riba pada ayat sebelumnya melalui firman-Nya : { يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَأْكُلُوا الرِّبَا أَضْعَافًا مُضَاعَفَةً } \"Hai orang-orang yang beriman, janganlah kamu memakan riba dengan berlipat ganda\" , Allah kemudian menyebutkan lawan katanya pada ayat selanjutnya dengan (yakni lawan kata dari riba) yaitu infaq : { يُنْفِقُونَ فِي السَّرَّاءِ وَالضَّرَّاءِ }. 3 ). Alkisah, suatu ketika seseorang vertamu di rumah Maimun bin Mahram, dengan sesegera mungkin pembantu yang bekerja di rumah beliau datang melayani Maimun dan tamunya membawakan semangkuk gulai, tiba-tiba kakinya tergelincir dan kuah gulai itupun tumpah menyiram tubuh Maimun hingga basah. Dengan gerakan spontan, Maimun hendak memukulnya, namun pembantunya segera mengingatkan Maimun, seraya berkata, \"Wahai Tuanku, sampai sejauh mana engkau melaksanakan firman Allah Swt. yang berbunyi : { وَالْكَاظِمِينَ الْغَيْظَ } \"... dan orang-orang yang mengekang amarahnya.\". \"Itu sudah kulaksanakan,\" jawab Maimun. Kemudian pembantunya itu berkata kembali, \"Bagaimana dengan ayat berikutnya : { وَالْعَافِينَ عَنِ النَّاسِ } \"...dan saling memaafkan kesalahan orang lain\". \"Ya, sekarang kumaafkan kekhilafanmu itu\" ucap Maimun. Namun, pembantunya itu kembali berkata, melanjutkan ayat tersebut : { وَاللَّهُ يُحِبُّ الْمُحْسِنِينَ } \"Sesungguhnya Allah mencintai orang-orang yang berbuat kebaikan\". Atas kejadian seperti itu, akhirnya Maimun berkata, \"Kini aku berbuat baik kepadamu, dengan membebaskan (memerdekakanmu) dirimu, semata-mata hanya karena Allah Swt.\" 4 ). { وَالْعَافِينَ عَنِ النَّاسِ } \"\"...dan saling memaafkan kesalahan orang lain\" Dan tidak hanya kepada kaum muslimin, dan diantara balasan yang paling cepat dirasakan oleh orang yang memberi maaf adalah kebahagiaan dan kelezatan serta keselamatan hati, Ibrahim عليه السلام tidak sekalipun pernah mendoakan keburukan kepada orang lain, dan Allah telah bersaksi untuknya : { إِذْ جَاءَ رَبَّهُ بِقَلْبٍ سَلِيمٍ } \"(lngatlah) ketika ia (Ibrahim) datang kepada Tuhannya dengan hati yang suci\" [ash-shaffat : 84], juga Nabi kita Muhammad tidak pernah mengharap balas dendam atas kesalahan orang lain, dan Allah mensucikan dirinyab : { وَإِنَّكَ لَعَلَىٰ خُلُقٍ عَظِيمٍ } \"Dan sesungguhnya kamu benar-benar berbudi pekerti yang agung\" [al-qalam : 4]."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "134 Di antara contoh sifat orang yang bertakwa adalah orang-orang yang menafkahkan hartanya untuk mencari ridho Allah, dan orang-orang yang menahan amarahnya dengan bersabar sesuai kemampuan mereka untuk menampakkannya. Sehingga tidak ada satu pun yang terzalimi.. Allah menyukai orang-orang yang berbuat kebajikan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "(yaitu) orang-orang yang selalu berinfak, baik di waktu lapang maupun sempit} waktu mudah dan waktu susah {orang-orang yang mengendalikan kemurkaannya} orang-orang yang menahan amarahnya keluar meskipun dan bisa mengendalikannya {dan orang-orang yang memaafkan orang lain} orang-orang yang membiarkan orang-orang yang menzaliminya dan pantas mendapatkan hukuman {Allah mencintai orang-orang yang berbuat kebaikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "134. Kemudian Allah menjelaskan tentang sipat-sipat orang yang bertakwa dan perbuatan-perbuatan mereka seraya berfirman, ”yaitu orang-orang yang menafkahkan hartanya, baik di waktu lapang maupun sempit, ”yaitu, pada saat kondisi mereka saat sulit atau kondisi mereka sedang lapang. Bila mereka sedang lapang, maka mereka akan mempernanyak infak, dan bila mereka sedang kesulitan, maka mereka tidak menganggap remah suatu kebaikan walau hanya sedikit saja. “Dan orang-orang menahan amarahnya, ”yaitu, bila terjadi dari orang lain tindakan yang menyakitkan terhadapnyayang menimbulkan kemarahan yaitu hati yang oenuh dengan kedongkalan yang akan menimbulkan balas dendam dengan perkataan maupun perbuatan.Mereka itu tidaklah bertindak menurut tabiat kemanusiaanya, akan tetapi mereka menahan apa yang ada di dalam hati mereka di sebabkan kemarahan, dan menghadapi orang yang berbuat jelek kepadanya itu dengan kesabaran. “Dam memaafkan kesalahan orang.”termasuk dalam tindakan memaafkan orang adalah memaaafkan segala hal yang terjadidari orang yang telah berbuat jelek kepada kita dengan perkataan maupun perbuatan.Memaafkan itu sekedar lebih baik dari pada menhahn amarah, karena memaafkan itu tindakan meninggalkan balas dendam di sertai dengan bentuk kelapang dadaan terhadap orang yang berbuat jelek.itu hanya dapat terjadi pada orang-orang yang menghiasi dirinyadengan ahklak yang terpuji dan jauh daru akhlak yang tercela, dan dari orang-orang yang bertransaksi dengan Allah dan memaafkan hamba-hamba Allah merupakan kasih sayang terhadap mereka dan tindakan baik terhadap mereka, benci dari keburukan yang menimpa merekaagar Allah mengampuni dirinya sehinggga dia mendapatkan pahala di sisi Allah yang maha mulia, dan bukan dari hamba yang miskin, sebagaiman Allah berfirman, \"maka barang siapa memaafkan dan berbuat baik maka pahalanya atas (tanggungan) Allah.\" (Asy-Syuara:40) Kemudian Allah menyebutkan kondisi yang lebih umum daripada yang lainya dan lebih baik, lebih tinggi dan lebih utama, yaitu berbuat kebaikan Allah berfirman, ”Allah menyukai orang –orang yang berbuat kebaikan.” Kebaikan itu ada dua macam: berbuat baik pada perkara ibadah kepada sang pencipta dan berbuat baik kepada para mahluk. Dan ihsan kepada perkara ibadah kepada sang pencipta telah di tafsirkan oleh NAbi dengan sadbanya, ”Engkau menyembah Allah seaka-akan engakau melihatNya, dan bila engkau tidak melihatnya, maka sesungguhnya dia melihatmu.” Adapun berbuat baik kepada para makhluk yaitu memberikan manfaat yang bersipat agama maupun duniawi kepada mereka sehingga termasuk dalam kategori itu adalah memerintahkan mereka kepada yang ma'rup dan melarang mereka dari yang mungkar, mengajarkan orang yang bodoh di antara mereka, menasehati masyarakat umum maupun khusus, berusaha menyatukan kalimat mereka, menyalurkan segala macam sedekah, infak yang wajib maupun yang Sunnah kepada mereka dengan perbedaan berbagai kondisi dan karakter mereka. Termasuk juga dalam hal itu adalah mengerahkan kedermawanan hati, menolak keburukan dan bersabar atas ganguan, sebagaimana Allah menjelaskan sipat-sipat orang-orang yang bertakwa dalam ayat ini. Maka barangsiapa yang melaksanakan perkara-perkara tersebut, ia telah menegakkan hak-hak Allah dan hak-hak hambaNya. kemudian Allah menyebutkan tentang alasan mereka kepada Tuhan mereka dari kejahatan dan dosa-dosa mereka, seraya berfirman,"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 134: Yang menderma di waktu senang dan sudah, dan menahan marah, dan memaafkan manusia; dan Allah itu kasih kepada mereka yang berbuat kebajikan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni ketika mereka lapang, mereka banyak berinfak, namun ketika susah mereka tidak meremehkan perkara ma'ruf meskipun kecil. Padahal mampu melampiaskan amarahnya dan bersabar dari membalas orang yang berbuat buruk kepada mereka. Dengan tidak membalas. Untuk dapat memahami ayat ini kami bawakan kisah berikut –terlepas apakah kisah ini sahih atau tidak- hanya saja kita dapat mengambilnya sebagai pelajaran. Kisah ini disebutkan dalam kitab Minhajul Muslim ketika menerangkan tentang ihsan: Dahulu seorang majikan pernah dibuat marah oleh budaknya, majikannya pun marah dan hendak menghukumnya, maka budaknya membacakan ayat, “Wal kaazhimiinal ghaizh” (Dan orang-orang yang menahan marahnya), maka majikannya berkata, “Ya, saya tahan marah saya.” Budaknya membacakan ayat lagi, “Wal ‘aafiina ‘anin naas” (serta memaafkan orang lain), maka majikannya berkata, “Ya, kamu saya maafkan.” Budaknya lalu membacakan lagi, “Wallahu yuhibbul muhsininiin” (Dan Allah mencintai orang-orang yang berbuat ihsan), maka majikannya berkata, “Sudah pergi sana, kamu merdeka karena Allah Ta’ala.” Inilah contoh menahan marah, memaafkan orang lain dan berbuat ihsan. Ihsan terbagi menjadi dua: Ihsan dalam beribadah. Ihsan dalam beribadah ditafsirkan oleh Nabi shallallahu 'alaihi wa sallam dalam sabdanya, yaitu, \"Kamu beribadah kepada Allah seakan-akan kamu melihat-Nya. Jika kamu tidak merasa melihat-Nya, maka sesungguhnya Dia melihatmu.\" (HR. Muslim) 2. Ihsan kepada makhluk Sedangkan ihsan kepada makhluk adalah memberikan manfaat baik yang bersifat agama maupun dunia kepada makhluk serta menghindarkan keburukan dari mereka. Termasuk ke dalamnya beramr ma'ruf dan bernahi munkar, mengajarkan orang yang tidak tahu, menasehati orang yang lalai, memberikan sikap nasihat (tulus) kepada manusia secara umum maupun khusus, berusaha menyatukan mereka, memberikan sedekah dan nafkah yang wajib maupun sunat sesuai keadaan mereka dan sifatnya, memberikan kedermawanan, menghindarkan gangguan dan siap memikul gangguan yang menyakitkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 134",
    "description": "Mereka adalah orang yang terus-menerus berinfak di jalan Allah, baik di waktu lapang, mempunyai kelebihan harta setelah kebutuhannya terpenuhi, maupun sempit, yaitu tidak memiliki kelebihan, dan orangorang yang menahan amarahnya akibat faktor apa pun yang memancing kemarahan dan memaafkan kesalahan orang lain. Dan akan sangat terpuji orang yang mampu berbuat baik terhadap orang yang pernah berbuat salah atau jahat kepadanya, karena Allah mencintai, melimpahkan rahmat-Nya tiada henti kepada orang yang berbuat kebaikan. Pesan-pesan yang mirip dengan kandungan ayat ini disampaikan pula melalui surah an-nahl/16: 126; asy-syura'/42: 40 dan 43setelah Allah menjelaskan sikap penghuni surga ketika menghadapi orang lain, maka dia menjelaskan sikap mereka terhadap diri sendiri. Mereka adalah orang-orang yang apabila mengerjakan perbuatan keji, yaitu dosa besar yang akibatnya tidak hanya menimpa diri sendiri tetapi juga orang lain, seperti zina, pembunuhan, dan riba, atau menzalimi diri sendiri dalam bentuk pelanggaran apa pun yang akibatnya hanya pada pelaku saja, baik dosa tersebut dilakukan dengan sengaja atau tidak, maka segera mengingat Allah dan bertobat, lalu memohon ampunan atas dosa-dosanya. Sungguh Allah maha pengampun, dan siapa lagi yang dapat mengampuni dosa-dosa selain Allah' dan setelah bertobat mereka tidak meneruskan atau mengulangi perbuatan dosa itu, sedang mereka mengetahui dan menyadari akibat buruk dari perbuatan dosa dan menyadarkan mereka untuk segera bertobat."
  }
]