[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka yang memiliki sifat-sifat yang agung itu maka balasan mereka adalah Allah akan menutup dosa-dosa mereka, dan bagi mereka surga-surga yang mengalir di bawah pohon-pohonnya dan istina-istananya air yang tawar, mereka kekal di dalamnya tidak akan keluar lagi dari dalamnya selama-lamanya. Dan sebaik-baik pahala orang-orang yang beramal adalah ampunan dan surga."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "136. Orang-orang yang memiliki sifat dan perangai yang terpuji tersebut itu akan diganjar oleh Allah dengan menutupi dosa-dosa mereka dan mengampuninya. Dan di akhirat kelak mereka akan mendapatkan surga-surga yang ada sungai-sungai mengalir dari bawah istana-istananya. Mereka tinggal di sana untuk selama-lamanya. Itu adalah sebaik-baik balasan bagi orang-orang yang menjalankan ketaatan kepada Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "136. Orang-orang yang memiliki sifat-sifat tersebut akan mendapat derajat yang tinggi di sisi Tuhan mereka, berupa ampunan atas dosa-dosa mereka dan surga-surga yang di bawah pepohonannya terdapat sungai-sungai yang mengalir, mereka kekal di dalamnya. Dan surga adalah sebaik-baik balasan bagi orang-orang yang menjalankan hukum-hukum Allah. Lihat: surat al-Baqarah: 25."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "136. جَزَآؤُهُم مَّغْفِرَةٌ مِّن رَّبِّهِمْ (balasannya ialah ampunan dari Tuhan mereka) Yakni pahala atas amal kebaikan yang telah disebutkan tadi adalah dihapusnya dosa mereka dan dimasukkannya ia kedalam surga. Dari Abu Bakar ia berkata: aku mendengar Rasulullah bersabda: :tidak ada seorangpun yang melakukan perbuatan dosa kemudian ketika ia mengingat akan dosanya ia berdiri dan mengambil air wudlu, lalu ia melakukan shalat dua rakaat kemudian memohon ampun kepada Allah atas dosanya itu kecuali Allah pasti mengampuninya”. Lalu Rasulullah membaca ayat ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "136 Mereka orang-orang yang bertakwa dengan gambaran sifat itu balasannya ialah ampunan dari Tuhan mereka dan surga/kebun-kebun yang di dalamnya mengalir sungai-sungai, sedang mereka kekal di dalamnya; dan itulah sebaik-baik pahala orang-orang yang beramal yaitu surga."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka itu balasannya adalah ampunan dari Tuhan mereka dan surga-surga yang mengalir di bawahnya sungai-sungai. Mereka kekal di dalamnya. Sebaik-baik pahala bagi orang-orang yang beramal shalih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "136. “mereka itu,” yaitu, orang-orang yang bersipat dengan sipat tersebut, ” balasannya ialah ampunan dari Rabb mereka” yang menghapus dari mereka segala yang dikhawatirkan, “dan surga-surga yang di bawahnya mengalir sungai-sungai,” di dalamnya tersimpan kenikmatan yang abadi, kebahagiaan, kesenangan, kemuliaan, kebaikan, ketenangan, istana-istana, dan rumah yang indah lagi tinggi, pepohonan yang berubah menjadi ranum, sungai-sungai yang mengalir pada kedamaian-kedamaian yang baik tersebut. “Mereka kekal di dalamnya, ” mereka tidak akan keluar darinya dan tidak pula mencari penggantinya serta kenikmatan yang mereka rasakan di dalamnya tidak akan di rubah, ”dan itulah sebaik-baik pahala orang-orang yang beramal.” Mereka beramal karena Allah hanya sedikit, namun di berikan ganjaran yang banyak. Di subuh hari, orang-orang yang dermawan bertahmid kepada Allah atas apa yang di berikan mereka pada malam hari. Dan pada hari pembalasan, seseorang yang beramal akan mendapatkan ganjarannya secara penuh dan sempurna. Ayat-ayat yang mulia ini menjadi dalil bagi para Ahlusunnah wal jamah bahwa perbuatan itu termasuk iman, berbeda dengan golongan murjiah. Dan sisi penujukan ayat tersebut hanya bisa sempurna dengan disertai penyebutan ayat 21 dalam surat Al-Hadid, patner ayat ini, yaitu firmanya, \"Berlomba-lombalah kamu kepada (mendapatkan) ampunan dari Tuhanmu dan surga yang luasnya seluas langit dan bumi, yang disediakan bagi orang-orang yang beriman kepada Allah dan Rasul-rasul-Nya. Itulah karunia Allah, diberikan-Nya kepada siapa yang dikehendaki-Nya. Dan Allah mempunyai karunia yang besar.\" (Al-Hadid:21). Dalam ayat ini tidak di sebutkan kecuali kata iman kepada Allah dan kepada RasulNya sementara dal surat Ali-imran ini disebutkan, “Yang disediakan untuk orang-orang yang bertakwa.” Kemudian Allah menjelaskan dengan sipat-sipat mereka dan amalan-amalan yang bersipat badan maupun harta, sehingga menujukan bahwa orang-orang yang beriman itu adalah, ”orang-orang yang disipati dengan sipat-sipat tersebut, ” dan mereka itulah orang-orang yang beriman."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 136: Mereka itu balasannya adalah ampunan dari Tuhan mereka dan surga-surga yang mengalir padanya sungai-sungai, yang mereka akan kekal padanya; dan alangkah baik balasan bagi orang-orang yang beramal."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 136",
    "description": "Balasan bagi mereka ialah ampunan dari tuhan mereka dan surgasurga dengan penuh kenikmatan, keindahan dan kedamaian. Salah satu gambaran keindahan surga ialah di bawahnya mengalir sungai-sungai, mereka kekal di dalamnya. Dan itulah sebaik-baik pahala bagi orang-orang yang beramal saleh. Setelah Allah meminta manusia tidak mengulangi dan larut dalam dosa, ayat ini meminta mereka memerhatikan keadaan umat terdahulu dan kesudahan mereka. Sungguh, telah berlalu sebelum kamu sunah-sunah Allah, yaitu hukum-hukum kemasyarakatan yang tidak mengalami perubahan, yaitu barang siapa melanggar perintah Allah dan rasulnya akan merugi, dan yang menegakkannya akan sukses. Karena itu berjalanlah kamu ke segenap penjuru bumi dan perhatikanlah bukti-bukti sejarah yang ada, untuk dijadikan pelajaran bagaimana kesudahan dan akibat buruk yang dialami orang yang mendustakan para rasul."
  }
]