[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah menyeru orang-orang yang beriman ketika mereka ditimpa musibah pada perang uhud dengan ta’ziyah bagi mereka, bahwasanya telah berlalu sebelum kalian umat-umat, telah diuji orang-orang mukmin diantara mereka dengan penyerangan orang-orang kafir maka mereka menderita kekalahan, maka berjalanlah dimuka bumi dengan mengambil pelajaran atas nikmat yang diberikan kepada mereka, mereka itulah orang-orang yang mendustakan Allah dan RosulNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "137. Tatkala orang-orang mukmin diuji dengan kekalahan yang mereka alami dalam perang Uhud, Allah menghibur mereka seraya berfirman, “Telah berlalu sebelum kalian sunah-sunah ilahiyah dalam membinasakan orang-orang kafir dan menjadikan akhir yang baik untuk orang-orang mukmin setelah mereka mendapatkan ujian dan cobaan. Maka berjalanlah di muka bumi dan lihatlah seraya mengambil pelajaran bagaimana nasib orang-orang yang mendustakan Allah dan Rasul-Nya. Tempat tinggal mereka hancur dan kerajaan mereka hilang.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "137. Hai orang-orang yang beriman, telah berlalu sebelum kalian ketetapan-ketetapan Allah dalam menghukum umat-umat yang zalim dengan membinasakan mereka. Maka berjalanlah di muka bumi agar kalian dapat mengambil pelajaran, dan lihatlah bagaimana kesudahan orang-orang yang mendustaka Allah dan rasul-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "137. قَدْ خَلَتْ مِن قَبْلِكُمْ سُنَنٌ (Sesungguhnya telah berlalu sebelum kamu sunnah-sunnah Allah) Yakni kejadian-kejadian yang dijadikan sunnatullah atas kaum-kaum yang mendustakan. فَسِيرُوا۟ فِى الْأَرْضِ (Karena itu berjalanlah kamu di muka bumi) Yakni perjalanlah diatasnya dengan tujuan mengambil ibrah dan pelajaran. Dan maksud ayat itu adalah apabila kalian ragu maka berjalanlah dimuka bumi. فَانظُرُوا۟ كَيْفَ كَانَ عٰقِبَةُ الْمُكَذِّبِينَ (dan perhatikanlah bagaimana akibat orang-orang yang mendustakan) Dan melihat bagaimana akibat umat-umat yang dibinasakan memiliki efek yang jelas pada diri seseorang, maka dari itu Allah memerintahkan kita untuk berjalan dan memperhatikan apa yang ada di muka bumi"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "137 Sesungguhnya telah berlalu sebelum kamu wahai para manusia sunnah-sunnah Allah dalam menyiksa orang-orang zalim dengan membinasakan mereka karena dusta mereka terhadap nabinya; dan di sisi lain pertolongan untuk kaum mukmin. Jika kalian ragu maka berjalanlah di atas bumi untuk mencari pelajaran, dan perhatikanlah bagaimana akibat dan bekas orang-orang terdahulu yang mendustakan rasul-rasul."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh telah berlalu} berlalu {sebelum kalian sunatullah} kejadian-kejadian tentang sunnatullah terhadap umat-umat yang berdusta {Maka berjalanlah di bumi dan perhatikanlah bagaimana konsekuensi bagi para pendusta"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "137. Ayat-ayat yang mulia ini dan yang setelahnya yang menyebutkan kisah tentang perang uhud, Allah menghibur dengannya hamba-hambaNya yang beriman yang menegakkan hati mereka. Kemudian Allah mengabarkan kepada mereka bahwasanya telah berlalu umat dan kaum yang silih berganti, yang telah diberikan ujian, dan kaum Mukminin dari mereka dberi ujian dan memerangi kaum kafir. Dan mereka terus senantiasa dalam peperangan dan pertempuran hingga Allah memberi akibat yang baik itu bagi orang-orang yang bertakwa dan kemenangan bagi orang-orang yang beriman. Dan pada akhirnya, orang-orang yang berdusta mengalami kekalahandan Allah menghinakan mereka dengan membela para RasulNya, beserta para pengikut mereka. “Karena itu berjalanlah kamu di muka bumi, ” dengan tubuh dan hati kalian, “dan perhatikanlah akibat orang-orang yang mendustakan rasul-rasul.” Kalian tidak akan menemukan mereka kecuali dalam keadaan mereka di siksa dengan hukuman dunia, negri mereka hancur, kerugian mereka sangatlah jelas oleh setiap orang, keagungan dan kekuasaan mereka telah hilang, dan kegagahan dan kesombangan mereka telah lenyap. bukankah dalam fakta itu ada dalil yang paling besar dan bukti yang paling akurat atas syariat yang di bawa oelh seluruh rasul dan hikmah dalam menguji hamba-hambaNya, agar terlihat jelas dan terang orang-orang yang benar dari orang-orang yang dusta? Karena itulah Allah berfirman,"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 137: Sesungguhnya telah lalu dari kamu dahulu beberapa contoh-contoh, oleh karena itu hendaklah kamu berjalan di bumi dan lihat akibat bagi mereka yang mendustakan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini turun setelah perang Uhud untuk menghibur kaum mukmin. Di dalamnya terdapat perintah bagi kaum mukmin agar memperhatikan kesudahan yang dialami oleh orang-orang yang mendustakan rasul agar mereka tidak bersedih karena kekalahan mereka di perang Uhud dan bahwa kesudahan yang baik (seperti kemenangan) akan didapatkan oleh orang-orang yang bertakwa. Yang dimaksud dengan sunnah Allah di sini ialah hukuman-hukuman Allah yang berupa malapetaka, bencana yang ditimpakan kepada orang-orang yang mendustakan rasul."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 137",
    "description": "Setelah Allah meminta manusia tidak mengulangi dan larut dalam dosa, ayat ini meminta mereka memerhatikan keadaan umat terdahulu dan kesudahan mereka. Sungguh, telah berlalu sebelum kamu sunah-sunah Allah, yaitu hukum-hukum kemasyarakatan yang tidak mengalami perubahan, yaitu barang siapa melanggar perintah Allah dan rasulnya akan merugi, dan yang menegakkannya akan sukses. Karena itu berjalanlah kamu ke segenap penjuru bumi dan perhatikanlah bukti-bukti sejarah yang ada, untuk dijadikan pelajaran bagaimana kesudahan dan akibat buruk yang dialami orang yang mendustakan para rasul setelah Allah meminta manusia tidak mengulangi dan larut dalam dosa, ayat ini meminta mereka memerhatikan keadaan umat terdahulu dan kesudahan mereka. Sungguh, telah berlalu sebelum kamu sunah-sunah Allah, yaitu hukum-hukum kemasyarakatan yang tidak mengalami perubahan, yaitu barang siapa melanggar perintah Allah dan rasulnya akan merugi, dan yang menegakkannya akan sukses. Karena itu berjalanlah kamu ke segenap penjuru bumi dan perhatikanlah bukti-bukti sejarah yang ada, untuk dijadikan pelajaran bagaimana kesudahan dan akibat buruk yang dialami orang yang mendustakan para rasul."
  }
]