[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Al-quran ini adalah penjelasan dan petunjuk ke jalan yang benar, dan pengingat yang membuat hati-hati orang beriman khusyuk kepada Allah. Dan mereka takut kepada Allah, dan tunduk kepadaNya dengan itu, karena mereka mengambil manfaat dengannya tidak seperti orang-orang selain mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "138. Al-Qur`ān al-Karim ini adalah penjelasan bagi kebenaran dan peringatan daripada kebatilan untuk seluruh umat manusia. Al-Qur`ān adalah petunjuk ke jalan yang benar dan pengingat bagi orang-orang yang bertakwa. Karena merekalah yang akan mendapatkan manfaat dari petunjuk dan bimbingan yang ada di dalamnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "138. Al-Qur’an yang agung ini mengandung penjelasan yang lengkap bagi manusia secara umum, dan mengandung hidayah dan pelajaran bagi orang-orang bertakwa secara khusus."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "138. هٰذَا (ini) Yakni perintah untuk berjalan di muka bumi dan melihat bagaimana akibat dari orang-orang zalim yang telah dibinasakan dan negeri mereka telah dihancurkan ini. بَيَانٌ لِّلنَّاس(adalah penerangan bagi seluruh manusia) Yakni bagi orang-orang yang mendustakan dan yang lainnya. وَهُدًى وَمَوْعِظَةٌ (dan petunjuk serta pelajaran) Yakni hal ini sebagai penerangan bagi seluruh manusia baik itu yang beriman maupun yang kafir, dan sebagai petunjuk serta pelajaran bagi orang yang bertakwa saja."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Setelah Allah menyebutkan satu hal dari perincian peristiwa perang Uhud dalam surah Ali Imran, Allah kemudian berfirman : { هَٰذَا بَيَانٌ لِلنَّاسِ وَهُدًى وَمَوْعِظَةٌ لِلْمُتَّقِينَ } \"(Al Quran) ini adalah penerangan bagi seluruh manusia, dan petunjuk serta pelajaran bagi orang-orang yang bertakwah\" , karena sesungguhnya hidayah itu tidak akan disambut baik kecuali dengan hati seorang mukmin yang siap menerima hidayah, dan nasihat yang baik tidak akan berguna kecuali oleh hati yang bertaqwa."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "138 Yang disebutkan dalam Al Quran ini adalah pembelajaran dari kisah umat-umat yang zalim sebagai penerangan bagi orang-orang yang dusta dan lainnya, dan petunjuk dari kesesatan, tuntunan kepada kebaikan serta pelajaran hanya bagi orang-orang yang bertakwa agar dapat mengambil pelajaran."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Inilah} Al-Qur’an {suatu keterangan yang jelas bagi semua manusia, petunjuk, dan pelajaran} peringatan {bagi orang-orang yang bertakwa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "138. “Ini adalah penerangan bagi seluruh manusia,” indikasi yang jelas yang telah menjelaskan kepada manusia kebenaran dari kebathilan, orang-orang yang bahagia dari orang-orang yang sengsara. Itu merupakan petunjuk azab dari Allah yang telah di timpakan oleh Allah kepada orang-orang yang mendustakan rasul. “Dan petunjuk serta pelajaran bagi orang-orang yang bertakwa,” karena mereka itulah yang memanfaatkan ayat-ayat tersebut hingga mengarahkan kepada jalan yang lurus dan memberi nasihat serta menjauhkan mereka dari jalan kebathilan. Adapun bagi orang-orang yang selain mereka, maka hal tersebut merupakan penjelasan yang akan menjadi hujjah atas keburukan mereka dari Allah hingga celakalah orang-orang yang celaka setelah ketarangan yang jelas. Isyarat dalam ayat, “ini adalah penerangan bagi seluruh manusia, ” mengandung kemungkinan tertuju kepada Al-quran itu adalah penjelasan bagi manusia secara umum, petunjuk, dan pemberi nasihat bagi orang-orang yang bertakwa secara khusus, dan kedua makna tersebut adalah benar."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 138: (Qur'an) ini satu penerangan bagi manusia, dan satu pimpinan, dan satu nasihat untuk mereka yang berbakti."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ada yang menafsirkan kata \"ini\" di ayat ini dengan kebinasaan yang dialami oleh orang-orang yang mendustakan para rasul. Maksudnya, bahwa binasanya orang-orang yang menentang rasul itu terdapat dalil yang jelas siapa yang benar dan siapa yang salah, siapa yang beruntung dan siapa yang sengsara sekaligus sebagai penegakkan hujjah bagi manusia. Demikian juga di dalamnya terdapat petunjuk dan pelajaran bagi orang-orang yang bertakwa, di mana semua itu menjadikan mereka menempuh jalan yang lurus dan menghindari jalan yang sesat setelah menyaksikan perstiwa yang dialami oleh mereka yang menentang rasul."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 138",
    "description": "Setelah Allah meminta manusia tidak mengulangi dan larut dalam dosa, ayat ini meminta mereka memerhatikan keadaan umat terdahulu dan kesudahan mereka. Sungguh, telah berlalu sebelum kamu sunah-sunah Allah, yaitu hukum-hukum kemasyarakatan yang tidak mengalami perubahan, yaitu barang siapa melanggar perintah Allah dan rasulnya akan merugi, dan yang menegakkannya akan sukses. Karena itu berjalanlah kamu ke segenap penjuru bumi dan perhatikanlah bukti-bukti sejarah yang ada, untuk dijadikan pelajaran bagaimana kesudahan dan akibat buruk yang dialami orang yang mendustakan para rasul setelah menjelaskan sunatullah dan bagaimana kesudahan orangorang yang melanggar sunatullah tersebut, pada ayat ini Allah memberi motivasi agar kesedihan akibat kegagalan dalam perang uhud tidak berkepanjangan. Dan janganlah kamu merasa lemah menghadapi musuh, dan jangan pula bersedih hati karena kekalahan dalam perang uhud, sebab kamu paling tinggi derajatnya di sisi Allah, jika kamu orang beriman dengan sebenar-benarnya."
  }
]