[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan jangalah kalian menjadi lemah (wahai orang-orang yang beriman) dari memerangi musuh-musuh kalian, dan janganlah bersedih atas apa yang telah menimpa kalian pada perang uhud, sedangkan kalian meraih kemenangan dan mereka menderita kekalahan jika kalian beriman kepada Allah dan rosul-Nya, dan mengikuti syariat-syariatNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "139. Janganlah kalian -wahai orang-orang mukmin- menjadi lemah dan bersedih hati atas apa yang menimpa kalian dalam perang Uhud. Tidak sepatutnya kalian bersikap seperti itu. Karena kalian adalah orang-orang yang paling mulia dengan keimanan kalian, dan paling terhormat dengan adanya bantuan Allah dan harapan akan datangnya pertolongan dari-Nya, jika kalian beriman kepada Allah dan percaya akan janji-Nya bagi hamba-hamba-Nya yang bertakwa."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "139. Allah menghibur para sahabat atas luka dan kematian yang mereka dapatkan di parang Uhud: “Janganlah kalian bersikap lemah dalam memerangi musuh kalian, dan merasa ragu terhadap janji Allah untuk menolong agama-Nya meski kalian dikalahkan, dan janganlah meratapi apa yang telah menimpa kalian, kalian akan mengalahkan mereka jika kalian beriman kepada Rasulullah atas janjinya kepada kalian. Syeikh Ibnu Taimiyah berkata: Mereka lebih unggul jika mereka beriman meskipun mereka telah dikalahkan. Ka’ab bin Zuhair menyifati para sahabat: Bukanlah suatu kebahagiaan jika tombak-tombak mereka mengenai sasaran pada suatu hari, Bukan pula suatu kesedihan jika mereka yang terkena sasaran."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "139. وَلَا تَهِنُوا۟ وَلَا تَحْزَنُوا۟ (Janganlah kamu bersikap lemah, dan janganlah (pula) kamu bersedih hati) Makna (الوهن) adalah kelemahan, ketidakmampuan, ketidaksiapan, dan kebosanan dalam menapaki sebab-sebab kekuatan. Allah menghibur mereka atas apa yang menimpa mereka di perang Uhud yang terbunuh dan terlukanya sebagian mereka, dan menganjurkan mereka untuk tetap memerangi musuh dan melarang mereka dari kelemahan dan ketidakmampuan. الْأَعْلَوْنَ (padahal kamulah orang-orang yang paling tinggi (derajatnya)) Yakni Allah menjelaskan kepada mereka bahwa mereka lebih tinggi derajatnya dari pada musuh mereka dalam hal pertolongan dan kemenangan setelah kekalahan ini. إِن كُنتُم مُّؤْمِنِينَ (jika kamu orang-orang yang beriman) Yakni jika kalian adalah orang-orang beriman maka janganlah kalian bersikap lemah dan jangan pula bersedih hati. Atau yang dimaksud adalah jika kalian orang-orang yang beriman maka kalian adalah orang-orang yang paling tinggi derajatnya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Kalian adalah orang-orang yang paling tinggi derajatnya terhadap apa yang kalian perjuangkan, maka sesungguhnya kalian tengah berada dalam kebenaran, sedangkan mereka sedang berada dalam kebathilan, kalian adalah orang-orang yang paling tinggi derajatnya disisi dzat yang kalian perjuangkan nama-Nya : maka peperangan yang kalian ikuti adalah untuk Allah, sedangkan peperangan mefreka untuk syaithon, kalian adalah orang-orang yang paling tinggi derajatnya di tempat yang paling bagi kalian : maka peperangan yang kalian perjaungkan akan terbalas dengan syurga Allah, sedangkan usaha mereka hanya akan dibalas dengan api neraka. 2 ). DIkatakan kepada orang-orang beriman setelah mereka ditimpa oleh kekalahan dan kerugian pada perang Uhud : { وَأَنْتُمُ الْأَعْلَوْنَ إِنْ كُنْتُمْ مُؤْمِنِينَ } \"padahal kamulah orang-orang yang paling tinggi (derajatnya), jika kamu orang-orang yang beriman\" , oleh karena itu sekalipun keterbelakangan kita pada perkara dunia, tetapi sesungguhnya kira adalah orang-rang yang paling tinggi derajatnya dengan keimanan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "139 Janganlah kamu bersikap lemah dalam memerangi orang kafir, dan janganlah pula kamu bersedih hati atas pembunuhan dan luka pada perang Uhud, sesungguhnya kamulah orang-orang yang paling tinggi derajatnya. Yang mendapatlkan pertolongan dari musuh kalian. Jika kalian orang-orang yang benar-benar beriman kepada Allah dan rasul-Nya. Ayat ini turun sebagai pelipur lara Nabi dan orang-orang mukmin atas apa yang telah menimpa mereka pada perang Uhud."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Janganlah kalian merasa lemah} merasa lemah {dan jangan bersedih hati, padahal kalian lebih tinggi} orang-orang yang lebih unggul {jika kalian adalah orang-orang mukmin"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "139. Allah berfirman untuk menyemangatkan hamba-hambaNya yang beriman dan menguatkan tekad mereka serta membangkitkan keinganan mereka, “Janganlah kamu bersikap lemah, dan janganlah (pula) kamu bersedih hati, ” maksudnya, janganlah kalian lemah semangat dan lemah pada tubuh kalian, dan janganlah kalian bersedih hati ketika kalian tertimpa oleh suatu musibah dan diuji dengan ujian seperti ini. Karena kesedihan dalam hati dan dan kelemahan pada pada tubuh (justru) akan menambah musibah pada diri kalian, dan akan menjadi faktor pembangkit (kemenangan) bagi musuh kalian atas diri kalian; akan tetapi kuatkanlah hati kalian dan tegarkan, lalu buanglah kesedihan darinya hingga kalian kuat dalam memerangi musuh kalian. Allah telah menyebutkan bahwa tidaklah patut bagi mereka untuk lemah dan bersedih padahal mereka itu paling tinggi kedudukannya dalam keimanan dan mereka mengharap pertolongan Allah dan pahalaNya. Karena itu seorang Mukmin yang mengharapkan sesuatu yang telah dijanjikan oleh Allah berupa balasan duniawi dan ukhrawi tidaklah patut baginya hal tersebut. Oleh karena itu, Allah berfirman, “padahal kamulah orang-orang yang paling tinggi (derajatnya), jika kamu orang-orang yang beriman.” Kemudian Allah menghibur mereka karena mereka telah menderita kekalahan, dan Allah menjelaskan tentang hikmah-hikmah yang agung yang berkaitan dengan hal tersebut seraya berfirman,"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 139: Dan janganlah kamu lemah dan janganlah kamu berduka-cita, karena kamulah orang-orang yang paling tinggi jika kamu (memang) orang-orang yang beriman."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Di ayat ini, Allah membangkitkan semangat kaum mukmin. Dalam berjihad melawan orang-orang kafir. Karena kekalahanmu di perang Uhud. Hal itu, padahal merasa lemah dan bersedih akan menambah musibah bagi kamu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 139",
    "description": "Setelah menjelaskan sunatullah dan bagaimana kesudahan orangorang yang melanggar sunatullah tersebut, pada ayat ini Allah memberi motivasi agar kesedihan akibat kegagalan dalam perang uhud tidak berkepanjangan. Dan janganlah kamu merasa lemah menghadapi musuh, dan jangan pula bersedih hati karena kekalahan dalam perang uhud, sebab kamu paling tinggi derajatnya di sisi Allah, jika kamu orang beriman dengan sebenar-benarnya. Jika kamu pada perang uhud mendapat luka, maka mereka pun pada perang badar mendapat luka yang serupa. Dan masa kejayaan dan kehancuran, kemenangan dan kekalahan itu, kami pergilirkan di antara manusia agar mereka mendapat pelajaran bahwa Allah pengatur segalanya, dan agar Allah membedakan orang-orang yang beriman dengan orangorang kafir dan agar sebagian kamu dijadikan-Nya gugur sebagai syuhada, yaitu orang-orang yang disaksikan keagungannya atau menjadi saksi kebenaran. Dan Allah tidak menyukai orang-orang zalim sehingga tidak menjadikan mereka syuhada."
  }
]