[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dijadikan indah bagi manusia untuk mencintai apa saja yang mereka sukai, berupa wanita, anak-anak, kekayaan yang melimpah seperi emas, perak dan kuda-kuda yang baik, dan binatang-binatang ternak semisal unta,sapi dan kambing, serta tanah yang di jadikan untuk bercocok tanam dan berladang. Semua itu adalah pesona kehidupan dunia dan perhiasannya yang akan sirna. Dan Allah di sisiNYA terdapat tempat kembali dan pahala yang baik, yaitu surga."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Allah -Ta'ālā- menyampaikan bahwasanya Dia telah menghiasi hidup manusia -sebagai ujian bagi mereka- dengan kecintaan pada kesenangan-kesenangan duniawi, seperti wanita, anak laki-laki, harta yang banyak dan berlimpah berupa emas dan perak, kuda yang bertanda lagi bagus, binatang ternak berupa unta, sapi dan kambing, dan pertanian. Itu adalah kesenangan hidup di dunia yang bisa dinikmati dalam jangka waktu tertentu kemudian hilang. Maka tidak sepatutnya seorang mukmin menggantungkan hidupnya pada kesenangan tersebut. Hanya Allah saja yang memiliki tempat kembali yang baik, yaitu surga yang luasnya seluas langit dan bumi."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "14.Dijadikan indah bagi manusia kecintaan terhadap wanita, dan diciptakan dengan tabiat mencintai banyak keturunan, harta berupa emas dan perak yang bertumpuk-tumpuk, kuda pilihan yang terlatih, hewan ternak berupa unta, sapi, dan kambing, dan sawah ladang yang produktif. Demikianlah kenikmatan yang ada di dunia yang fana, sedangkan di sisi Allah terdapat tempat kembali yang baik berupa surga."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "14. زُيِّنَ لِلنَّاسِ (Dijadikan indah pada (pandangan) manusia ) Yakni Allah menghiasai hal-hal ini dihadapan pandangan manusia. حُبُّ الشَّهَوٰتِ ( kecintaan kepada apa-apa yang diingini) Yakni hal-hal yang yang menyenangkan hati yang didalamnya terdapat kenikmatan. مِنَ النِّسَآءِ ( wanita-wanita) Allah memulai dengan wanita-wanita karena besarnya kerinduan jiwa kepada mereka. وَالْبَنِينَ ( anak-anak) Dan Allah mengkhususkan penyebutan anak laki-laki tanpa menyebutkan anak perempuan karena tidak semua orang menyukai anak perempuan. وَالْقَنٰطِيرِ (harta yang banyak ) kata jamak dari (القنطار) yakni ukuran seratus Rathl Rathl (sekitar 3,81 kg menurut madzhab Syafi’i). dan pendapat lain mengatakan ini adalah sebutan bagi harta yang banyak. الْمُقَنطَرَةِ (yang melimpah ruah) Yakni yang berlipat ganda. وَالْخَيْلِ الْمُسَوَّمَةِ (dan kuda pilihan ) Yakni kuda gembalaan yang digembala di padang rumput. Dan pendapat lain mengatakan yakni kuda yang diberi tanda dengan tanda yang membedakannya dengan yang lain karena kualitas, kemurnian, dan kebagusan sifat-sifatnya. وَالْأَنْعٰمِ ( binatang-binatang ternak) Yakni unta, sapi, dan kambing. وَالْحَرْثِ ۗ ( dan sawah ladang) Yakni ladang dan apa yang ada didalamnya seperti tanah, pohon-pohon, dan tanaman. ذٰلِكَ مَتٰعُ الْحَيَوٰةِ الدُّنْيَا ۖ ( Itulah kesenangan hidup di dunia) Yakni hal-hal yang telah disebutkan tersebut adalah dari apa yang dinikmati di kehidupan ini yang kemudian akan pergi tak tersisa. وَاللهُ عِندَهُۥ حُسْنُ الْمَـَٔابِ(dan di sisi Allah-lah tempat kembali yang baik ) Yakni tempat kembali yang baik bagi orang-orang mukmin berupa surga dan apa yang ada didalamnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14. Syahwat yang menyenangkan hati itu dibuat menjadi sesuatu yang dicintai oleh manusia, yaitu wanita yang untuk dinikmati dan membuat keturunan, anak laki-laki, harta melimpah yang telah terkumpul atau berlipat-lipat mencapai jumlah yang sangat banyak berupa emas, perak, kuda dari keturunan yang baik dan istimewa yang memiliki beberapa tanda, hewan-hewan ternak (unta, sapi, dan kambing) dan hasil pertanian. Semua yang disebutkan itu adalah sesuatu yang hanya dinikmati di dunia, kemudian menghilang. Dan di sisi Allah itu tempat kembali yang lebih baik bagi orang-orang yang bertakwa"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dihiasi} diperindah {bagi manusia yang mencintai syahwatnya berupa perempuan, anak-anak, harta benda yang bertimbun tak terhingga} dan harta terkumpul sangat banyak {berupa emas, perak, kuda pilihan} yang memiliki tanda yang indah {binatang ternak, dan sawah ladang} ladang {Itulah kesenangan kehidupan dunia dan di sisi Allahlah tempat kembali yang baik} tempat kembali"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "14. Allah mengabarkan dalam dua ayat ini tentang kondisi manusia ketika mendahulukan dunia atas akhirat, lalu antara kedua alam tersebut, di mana Allah mengabarkan bahwa manusia dihiasi dengan perkara-perkara tersebut hingga mereka meliriknya dengan mata mereka, dan mereka ilusikan manisnya dalam hati mereka, jiwa-jiwa mereka terbuai dalam kenikmatan-kenikmatannya. Dan setiap kelompok dari manusia itu condong kepada salah satu jenis dari jenis-jenis kenikmatan tersebut, yang sebenarnya mereka telah menjadikannya sebagai cita-cita terbesar mereka dan puncak dari pengetahuan mereka. Padahal itu semua hanya kenikmatan yang sedikit yang akan lenyap dalam waktu yang sekejap, maka itulah “kesenangan hidup di dunia, dan di sisi Allah lah tempat kembali yang baik (surga).”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 14: Telah dihiasi (hati) manusia (dengan) kesukaan barang-barang yang diingini) yaitu perempuan-perempuan dan anak cucu dan emas dan perak yang berpikul-pikul dan kuda-kuda (kenaikan) yang bagus-bagus dan binatang-binatang ternak dan sawah ladang; yang demikian itu perhiasan hidup di dunia; tetapi di sisi Allah ada tempat kembali yang baik,"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Hewan-hewan yang termasuk jenis unta, sapi, kambing dan biri-biri. Manusia dalam menyikapi hal-hal di atas terbagi menjadi dua golongan: Golongan pertama, golongan yang menjadikan semua itu sebagai tujuan. Oleh karena itu, pikiran, hati dan perbuatan mereka tertuju kepadanya sehingga membuat mereka lupa terhadap sesuatu yang karenanya mereka diciptakan, yaitu ibadah. Mereka tidak ubahnya seperti binatang yang hanya mengejar kesenangan. Mereka tidak peduli bagaimana cara memperoleh kesenangan itu, ke arah mana mereka salurkan dan keluarkan. Semua yang mereka kejar ini sesungguhnya bekal mereka ke negeri tempat kesengsaraan. Golongan kedua, mereka mengetahui maksud dari semua itu, dan bahwa Allah menjadikannya sebaga ujian dan cobaan bagi hamba-hamba-Nya agar diketahui siapa yang lebih mendahulukan ketaatan dan keridhaan Allah daripada kesenangan itu, oleh karenanya mereka menjadikan semua itu sebagai sarana menuju akhirat. Mereka gunakan kesenangan itu untuk dapat membantu memperoleh keridhaan-Nya. Memang mereka memegang semua itu, namun hati mereka tidak memegangnya, dan mereka tahu bahwa semua itu merupakan kesenangan kehidupan dunia. Dalam ayat ini terdapat hiburan bagi kaum fakir yang tidak memperoleh kesenangan itu, ancaman bagi orang-orang yang terpedaya oleh kesenangan tesebut dan membuat zuhud orang-orang yang berakal."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 14",
    "description": "Ada beberapa hal yang dapat menghalangi seseorang mengambil pelajaran dari peristiwa di atas, yaitu dijadikan terasa indah dalam pandangan manusia cinta terhadap apa yang diinginkan dan sulit untuk dibendung, berupa perempuan-perempuan, anak-anak, harta benda yang bertumpuk dalam bentuk emas dan perak, kuda pilihan yang bagus dan terlatih, hewan ternak, dan sawah ladang, atau simbol-simbol kemewahan duniawi lainnya. Itulah kesenangan hidup di dunia yang bersifat sementara dan akan hilang cepat atau lambat, dan di sisi Allah-lah tempat kembali yang baik, yaitu surga dengan segala keindahan dan kenikmatannya. Hal-hal yang disebut di atas adalah baik dan sesuai dengan naluri manusia, tetapi ada yang lebih baik dari itu semua. Maka katakanlah, wahai nabi Muhammad, kepada orang-orang yang terlalu mencintai dunia dan kepada siapa pun juga, maukah aku kabarkan kepadamu apa yang lebih baik dari yang demikian itu' bagi orang-orang yang bertakwa tersedia di sisi tuhan yang mendidik dan memelihara mereka surga-surga yang mengalir di bawahnya sungai-sungai, sehingga mereka tidak perlu lagi bersusah payah mengairi-Nya. Selain tempat tinggal yang nyaman itu, mereka hidup kekal di dalamnya, dan mereka juga dianugerahi pasangan-pasangan yang suci dari segala macam kekotoran jasmani dan rohani seperti haid, nifas, dan perangai buruk, serta kenikmatan rohani yang tidak ada taranya, yaitu rida Allah yang amat besar. Dan anu-gerah tersebut wajar karena Allah maha melihat hamba-hamba-Nya, mengetahui segala keadaan mereka dan memberikan balasan yang terbaik."
  }
]