[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Jika kalian ditimpa (wahai orang-orang yang beriman) luka-luka atau terbunuh dalam perang uhud maka kalian bersedih atas hal itu, maka sungguh telah menimpa kepada orang-orang musyrik luka-luka dan terbenuh yang sama seperti itu pada perang badar, dan hari-hari itu Allah pergantikan diantara manusia, sesekali kemenangan dan dilain kali kekalahan, karena ada hikmah dala hal itu sehingga Nampak apa yang telah Allah ketahui sejak zaman ajali, supaya Allah dapat membedakan orang-orang mukmin yang sebenarnya dari selain mereka, dan memuliakan kaum-kaum dari kalian dengan kesyahidan. Dan Allah tidak mencintai orang-orang yang dzolim terhadap diri mereka sendiri dan duduk tidak ikut berperang di jalan Nya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "140. Jika kalian -wahai orang-orang mukmin- mengalami luka-luka dan terbunuh dalam perang Uhud, sesungguhnya orang-orang kafir juga pernah mengalami luka-luka dan terbunuh seperti kalian. Dan hari-hari itu Allah putar di antara manusia yang beriman dan kafir dengan kemenangan dan kekalahan yang dikehendaki-Nya karena hikmah-hikmah yang sangat mulia, di antaranya untuk membedakan mana orang-orang yang benar-benar beriman dan mana orang-orang yang munafik; untuk memuliakan orang yang Allah kehendaki menjadi syahid di jalan-Nya. Dan Allah tidak menyukai orang-orang yang menzalimi dirinya sendiri dengan meninggalkan jihad di jalan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "140. Jika kalian terluka atau 70 orang dari kalian terbunuh pada perang Uhud, maka orang-orang kafirpun terluka dan terbunuh pada perang Badar. Demikianlah Allah mempergilirkan kemenangan dan kekalahan antara kaum muslimin dan musyrikin untuk menguji mereka, sehingga terlihat siapa yang beriman dengan sebenar-benarnya, dan untuk memilih sebagian kalian untuk mendapatkan kesyahidan di jalan Allah. Allah tidak menyukai orang-orang yang zalim, Dia akan mengazab mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "140. إِن يَمْسَسْكُمْ قَرْحٌ (Jika kamu mendapat luka) Makna (القرح) yakni luka. Dan yang dimakasud adalah jika mereka menjadikan kalian terluka di perang Uhud maka sesungguhnya kalian telah membuat mereka terluka di perang Badar. وَتِلْكَ الْأَيَّامُ (Dan masa (kejayaan dan kehancuran) itu) Yakni kemenangan dan kekalahan dalam peperangan yang terjadi antara umat-umat yang ada berlaku sunnatullah bahwa Allah akan menjadikannya silih berganti, kadang kala satu kelompok menang atas kelompok yang lain dan kadangkala sebaliknya; sebagaimana apa yang terjadi pada kalian wahai kaum muslimin di perang Badar dan perang Uhud. وَلِيَعْلَمَ اللهُ الَّذِينَ ءَامَنُوا۟ (dan supaya Allah membedakan orang-orang yang beriman) Yakni dengan kesabaran mereka yang akan dibalas dengan pahala berdasarkan ilmu-Nya sebagaimana Allah telah mengetahui hal tersebut dalam ilmu azali. وَيَتَّخِذَ مِنكُمْ شُهَدَآءَ ۗ (supaya sebagian kamu dijadikan-Nya (gugur sebagai) syuhada’) Yakni memuliakan kalian dengan menjadikan kalian mati syahid. Dan dinamakan syuhada’ karena mereka terbunuh di jalan dakwah kepada Allah, sehingga mereka bersaksi di sisi-Nya atas orang yang membunuh mereka bahwa ia membunuh mereka dengan kezaliman dan permusuhan. Dan pendapat lain mengatakan karena mereka dipersaksikan bahwa mereka akan mendapatkan surga."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Dunia ini dipenuhi dengan perkara dan peristiwa yang tidak pernah menetap : terkadang sesuatu menjadi tinggi derajatnya dan terkadang pula ia akan jatuh, kekayaan seketika bisa berubah menjadi kemiskinan, begitupun sebaliknya, sesuatu yang tinggi tidak akan pernah tinggal selamanya diatas, tidak satupun di dunia ini akan menetap keadaannya : { وَتِلْكَ الْأَيَّامُ نُدَاوِلُهَا بَيْنَ النَّاسِ } \"Dan masa (kejayaan dan kehancuran) itu Kami pergilirkan diantara manusia (agar mereka mendapat pelajaran)\" 2 ). Bertahun-tahun telah terlewatkan dan peristiwa-peristiwa telah terjadi di dalamnya, dengan keadaan ini seorang mukmin harus senantiasa mengingat firman Allah : { وَتِلْكَ الْأَيَّامُ نُدَاوِلُهَا بَيْنَ النَّاسِ وَلِيَعْلَمَ اللَّهُ الَّذِينَ آمَنُوا وَيَتَّخِذَ مِنْكُمْ شُهَدَاءَ ۗ وَاللَّهُ لَا يُحِبُّ الظَّالِمِينَ } \"an masa (kejayaan dan kehancuran) itu Kami pergilirkan diantara manusia (agar mereka mendapat pelajaran); dan supaya Allah membedakan orang-orang yang beriman (dengan orang-orang kafir) supaya sebagian kamu dijadikan-Nya (gugur sebagai) syuhada'. Dan Allah tidak menyukai orang-orang yang zalim\""
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "140 Jika kamu mendapat luka dan pembunuhan pada perang Uhud, maka sesungguhnya kaum kafir itupun juga mendapat luka yang serupa pada perang Badar. Artinya jika kalian mendapat kekalahan pada perang Uhud, maka sesungguhnya kalian mendapat kemenangan pada perang Badar. Dan masa kejayaan dan kehancuran itu Kami pergilirkan diantara manusia, satu hari untuk golongan ini dan satu hari untuk lainnya agar mereka mendapat pelajaran; dan supaya Allah membedakan orang-orang yang beriman dengan orang-orang kafir. Serta menguji tingkat keimanan dan kesabaran atas kesempitan. Seta memuliakan sebagian kamu dengan dijadikan-Nya gugur sebagai syuhada’ yang memerangi orang-orang yang berbuat zalim. Dan Allah akan menyiksa orang-orang yang zalim lagi kafir, ayat ini turun ketika seorang perempuan berkata kepada dua orang laki-laki setelah perang Uhud: Apa yang terjadi pada Rasul? Dua laki-laki berkata: Beliau masih hidup. Wanita itu menjawab: Aku tidak peduli, Allah telah menjadikan hambanya sebagai syuhada’. Turunlah ayat Al-quran yang wanita itu katakan: Allah menjadikan sebagian kalian sebagai syuhada’."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika kalian mendapatkan} menerima {luka} luka dan kematian {maka mereka pun mendapat luka yang serupa} orang-orang kafir Quraisy juga menerima luka dan kematidan pada Perang Badar {Waktu itu Kami pergilirkan di antara manusia} membelokkan di antara manusia, yaitu kami menggilir bagi mereka sekali dan kepada yang lainnya sekali {dan Allah mengetahui} dan sungguh Allah melihat di dunia apa yang telah Dia tetapkan atas mereka sebelum penciptaan mereka {orang-orang yang beriman dan menjadikan sebagian kalian para syahid} dan untuk memuliakan orang-orang di antar kalian dengan mati syahid {Allah tidak menyukai orang-orang zalim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "140. “Jika kamu (pada perang Uhud) mendapat luka, maka sesungguhnya kaum (kafir) itu pun (pada perang Badar) mendapat luka yang serupa.” Kalian dan mereka sungguh sama-sama menderita luka, akan tetapi kalian mengharap dari Allah apa yang tidak mereka harapkan, sebagaimana Allah berfirman, \"Jika kamu menderita kesakitan, maka sesungguhnya merekapun menderita kesakitan (pula), sebagaimana kamu menderitanya, sedang kamu mengharap dari pada Allah apa yang tidak mereka harapkan.\" -An-Nisa:104- Dan di antara hikmah lain adalah bahwa dunia ini telah Allah berikan kepada orang yang beriman dan orang kafir, orang baik dan orang jahat. Begitulah Allah menggilir hari (masa kejayaan dan keruntuhan) di antara manusia, hari ini untuk kelompok itu dan hari yang lain untuk kelompok lainnya, karena negeri dunia ini musnah dan fana, hal ini tentunya berbeda dengan negeri akhirat, karena negeri itu khusus bagi orang-orang yang beriman. “Dan supaya Allah membedakan orang-orang yang beriman (dengan orang-orang kafir).” Ini juga di antara hikmah-hikmahnya, yaitu bahwa Allah menguji hamba-hambaNya dengan kekalahan dan musibah, agar Nampak jelas antara Mukmin dan munafik. Karena bila kemenangan itu selalu bersama kaum Mukminin dalam seluruh peperangannya, niscaya akan masuk ke dalam Islam orang-orang yang tidak menginginkannya, namun apabila terjadi beberapa bentuk cobaan pada beberapa peperangan mereka, niscaya akan jelaslah seorang Mukmin hakiki yang menghendaki Islam, baik dalam kondisi susah dan senang, sulit dan lapang dari orang yang tidak demikian, “dan supaya sebagian kamu dijadikanNya (gugur sebagai) syuhada (orang-orang yang mati syahid).” Hal ini juga merupakan hikmah, Karena syahid di sisi Allah adalah termasuk derajat yang paling tinggi, dan tidak ada jalan untuk memperolehnya kecuali dengan memperoleh sebab-sebabnya. Ini merupakan rahmatNya bagi hamba-hambaNya yang beriman, yaitu dengan membuat untuk mereka sebab-sebab yang dibenci oleh jiwa agar Dia memberikan kepada mereka sesuatu yang mereka sukai dari derajat yang tinggi dan kenikmatan yang abadi. “Dan Allah tidak menyukai orang-orang yang zhalim, ” yaitu orang-orang yang menzhalimi diri mereka sendiri dan meninggalkan peperangan di jalanNya. Ayat ini menggambarkan sebuah sindiran dengan mencela kaum munafik dan bahwa mereka itu dibenci oleh Allah. Oleh karena itu, Allah membuat mereka meninggalkan peperangan di jalanNya. Dan sekiranya mereka hendak ikut pergi, pastilah mereka akan mengadakan persiapan itu, akan tetapi Allah membenci keikutsertaan mereka hingga Allah membuat mereka meninggalkannya dan agar dikatakan kepada mereka, “Tinggallah bersama orang-orang yang tinggal (tidak ikut berperang).”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 140: Jika kamu disentuh luka, maka kaum itu pun disentuhi luka seperti itu; dan hari-hari yang demikian, Kami edarkan di antara manusia, dan karena Allah hendak membuktikan mereka yang beriman dan hendak menjadikan dari antara kamu, penyampai-penyampai dan Allah tidak kasih kepada orang-orang yang zhalim."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Lihat pula surat An Nisaa': 104. Di antara hikmahnya pula adalah karena dunia ini diberikan Allah untuk orang mukmin dan orang kafir, orang baik dan orang jahat. Berbeda dengan di akhirat, maka kebahagiaan hanya diperuntukkan kepada orang-orang mukmin. Ini pun termasuk hikmah Allah menguji hamba-hamba-Nya dengan kekalahan, yakni agar diketahui siapa yang mukmin dan siapa yang munafik. Hal itu, karena jika kemenangan selalu didapatkan oleh kaum mukmin, tentu saja akan masuk Islam orang-orang yang sebenarnya tidak menginginkannya. Berbeda, jika terkadang menang dan terkadang kalah, maka akan diketahui dengan jelas orang yang mukmin, orang yang memang menginginkan Islam baik pada saat sempit maupun lapang, saat susah maupun mudah, saat senang maupun tidak. Syuhada' di sini ialah orang-orang Islam yang gugur di dalam peperangan untuk menegakkan agama Allah. Sebagian ahli tafsir ada yang mengartikannya dengan menjadi saksi atas manusia sebagaimana tersebut dalam ayat 143 surat Al Baqarah. Mati sebagai syuhada' merupakan derajat yang sangat tinggi di sisi Allah, dan dengan adanya kekalahan itu orang-orang akan memperoleh derajat yang tinggi tersebut serta kenikmatan yang kekal. Shadaqallah (Maha Benar Allah). Nampaknya kata-kata ini tertuju kepada kaum munafik sebagai celaan bagi mereka dan bahwa mereka dibenci Allah, oleh karenanya Allah menjadikan mereka mundur. Allah berfirman: \"Dan jika mereka mau berangkat, tentulah mereka menyiapkan persiapan untuk keberangkatan itu, tetapi Allah tidak menyukai keberangkatan mereka, Maka Allah melemahkan keinginan mereka. dan dikatakan kepada mereka: \"Tinggallah kamu bersama orang-orang yang tinggal itu.\" (Terj. At Taubah: 46)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 140",
    "description": "Jika kamu pada perang uhud mendapat luka, maka mereka pun pada perang badar mendapat luka yang serupa. Dan masa kejayaan dan kehancuran, kemenangan dan kekalahan itu, kami pergilirkan di antara manusia agar mereka mendapat pelajaran bahwa Allah pengatur segalanya, dan agar Allah membedakan orang-orang yang beriman dengan orangorang kafir dan agar sebagian kamu dijadikan-Nya gugur sebagai syuhada, yaitu orang-orang yang disaksikan keagungannya atau menjadi saksi kebenaran. Dan Allah tidak menyukai orang-orang zalim sehingga tidak menjadikan mereka syuhadadan kegagalan umat islam dalam perang uhud adalah agar Allah membersihkan orang-orang yang beriman dari dosa dan kesalahan mereka, dan membinasakan, mengurangi sedikit demi sedikit jumlah orang-orang kafir."
  }
]