[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kekalahan ini yang terjadi pada Perang uhud merupakan ujian dan penyucian diri bagi kaum mukminin,dan pembersihan bagi mereka dari orang-orang munafik dan sebagai kebinasaan bagi orang-orang kafir."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "141. Salah satu hikmahnya ialah membersihkan dosa-dosa orang-orang mukmin, membersihkan barisan mereka dari orang-orang munafik, dan membinasakan serta menyingkirkan orang-orang kafir."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "141. Dan agar Allah menguji orang-orang beriman dengan musibah yang menimpa mereka, sehingga terbedakan dari orang-orang munafik dan untuk mengurangi dan menghancurkan orang-orang kafir."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "141. وَلِيُمَحِّصَ اللهُ الَّذِينَ ءَامَنُوا۟ (Dan agar Allah membersihkan orang-orang yang beriman) Yakni agar Allah membersihkan orang-orang beriman dari dosa-dosa mereka, sehingga catatan amal mereka tetap bersih tidak tertulis didalamnya kecuali kebaikan. وَيَمْحَقَ الْكٰفِرِينَ (dan membinasakan orang-orang yang kafir) Yakni menghabiskan mereka dengan kebinasaan. Dalam ayat ini terdapat penjelasan hikmah dari kemenangan orang-orang kafir di perang Uhud, diantarannya adalah keutamaan orang yang beriman dan bersabar, sebagian orang-orang beriman meraih kesyahidan, dan kezaliman orang-orang kafir yang mengantarkan mereka pada kehancuran dan kebinasaan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "141 Dan agar Allah membersihkan orang-orang yang beriman dari dosa mereka dan membinasakan orang-orang yang kafir atas pembangkangan mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Agar Allah membersihkan} menyucikan {orang-orang yang beriman dan membinasakan} menghancurkan {orang-orang kafir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "141. “Dan agar Allah membersihkan orang-orang yang beriman dari dosa-dosa mereka.” Ini juga termasuk hikmah lainya yaitu bahwa Allah membersihkan kaum Mukminin dengan adanya cobaan itu dengan dosa-dosa dan kekurangan mereka. ini menunjukan bahwa syahid dan berperang di jalan Allahitu menghilangkan dosa dan menutupi aib, dan juga Allah membersihkan kaum Mukminin dengan sekalian merekadari kalangan munafikin, hingga kaum Mukminin berlepas dari mereka dan mereka mengetahui siapa yang Mukmin dan siapa yang munafik. Dan di antara hikamhnya juga adalah bahwa Allah menetapkan hal itu untuk membinasakan orang-orang kafir, maksudnya, agar menjadi faktor penyebab mereka binasadan berhak mendapatkan hukuman. Karena bila mereka menang, niscaya mereka akan berbuat zhalim dan kesesatan akan bertambah di atas kesesatan mereka di atas kezhaliman itu mereka berhak di segerakan hukumanya sebagai suatu rahmat bagi hamba-hambaNya yang beriman kemudian Allah berfirman,"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 141: Dan karena Allah hendak menyaring mereka yang beriman dan hendak menghapuskan kafir."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini menunjukkan bahwa gugur sebagai syahid dan berperang di jalan Allah merupakan sebab terhapusnya dosa. Yakni sebagai sebab dibinasakan orang-orang kafir. Kalau pun mereka menang, lalu bertambah kekafirannya, maka mereka berhak mendapatkan hukuman yang disegerakan karena sayangnya Allah kepada kaum mukmin."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 141",
    "description": "Dan kegagalan umat islam dalam perang uhud adalah agar Allah membersihkan orang-orang yang beriman dari dosa dan kesalahan mereka, dan membinasakan, mengurangi sedikit demi sedikit jumlah orang-orang kafir. Setelah menjelaskan beberapa hal yang berkaitan dengan perang uhud, maka pada ayat ini Allah jelaskan prinsip umum perjuangan untuk mendapatkan surga. Apakah kamu mengira bahwa kamu akan masuk surga, sebagai anugerah dari Allah, padahal belum nyata bagi Allah orang-orang yang berjihad, yaitu: berperang untuk menegakkan islam dan melindungi orang islam; memerangi hawa nafsu; mendermakan harta benda untuk kebaikan islam dan umat islam; atau memberantas kejahatan dan menegakkan kebenaran, di antara kamu, dan belum nyata orang-orang yang sabar dalam berjihad, sedangkan kesabaran adalah syarat keberhasilan dalam berjihad."
  }
]