[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sungguh keadaan kalian (wahai orang-orang Mukmin),sebelum Perang Uhud kalian mengharap-harapkan berjumpa dengan musuh agar kalian dapat memperoleh kemuliaan berjihad dan mati syahid di jalan Allah yang telah dialami oleh saudara-saudara kalian di Perang badar. Maka sekarang sungguh telah terjadi pada kalian yang kalian harapkan dan kalian cari-cari. Ambillah kesempatan itu oleh kalian. Maka berperanglah dan bersabarlah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "143. Kalian -wahai orang-orang mukmin- pernah berharap untuk bertemu dengan orang-orang kafir supaya kalian bisa menjadi syahid di jalan Allah seperti saudara-saudara kalian yang gugur dalam perang Badar, sebelum kalian bertemu dengan situasi yang memaksa kalian bertaruh nyawa. Nah, dalam perang Uhud ini kalian benar-benar bertemu dengan apa yang kalian harapkan, dan kalian melihatnya secara nyata."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "143. Dahulu kalian berharap dapat menjadi syahid di jalan Allah sebelum perang Uhud, dan kini apa yang kalian inginkan telah terjadi, maka tetaplah berjaga di perbatasan, berperang, dan bersabar."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "143. وَلَقَدْ كُنتُمْ تَمَنَّوْنَ الْمَوْتَ (Sesungguhnya kamu mengharapkan mati (syahid)) Yakni mereka sebelumnya mengharapkan suatu hari nanti akan disyariatkan perang, namun pada perang Uhud mereka mundur padahal mereka sebelumnya bersikeras agar Rasulullah pergi berperang bersama mereka, dan mereka tidak bersabar kecuali sekelompok kecil yang diantaranya adalah Anas bin Nadhar paman dari Anas bin Malik. مِن قَبْلِ أَن تَلْقَوْهُ (sebelum kamu menghadapinya) Yakni menghadapi peperangan. Dan harapan orang-orang beriman untuk mati yakni untuk mati dalam keadaan syahid. فَقَدْ رَأَيْتُمُوهُ (sungguh kamu telah melihatnya) Yakni melihat kematian. وَأَنتُمْ تَنظُرُونَ (dan kamu menyaksikannya) Yakni menyaksikan kematian tersebut saat terbunuhnya orang yang terbunuh diantara kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "143 Sesungguhnya kamu wahai orang-orang beriman mengharapkan mati syahid di jalan Allah sebelum kamu menghadapi hiruk pikuk perang Uhud; sekarang sungguh kamu telah melihat sebab kematian telah dekat dan kamu menyaksikannya. Lalu mengapa kalian mundur? Dari Ibnu Abbas: Ada sekelompok laki-laki dari golongan sahabat yang berkata: Seandainya kami terbunuh sebagaimana para ahli Badar, kemudian Allah menjadikan mereka sebagai Syahid Uhud, Tidak ada yang tertinggal kecuali yang Allah kehendaki. Maka turunlah ayat ini."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh kalian benar-benar mengharapkan mati} kalian mengharapkan bertemu musuh supaya kalian bisa mendapatkan mati syahid {sebelum kalian menghadapinya} kalian memandangnya sebagai kematian {Maka kalian sungguh telah melihatnya} kalian menyaksikannya di dalam kilauan pedang {dan menyaksikannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "143, “Sungguh kamu mengahrapkan mati syahid sebelum kamu menghadapinya.”hal tersebut karena banyak di antara para sahabat yang tida ikut berperang di mana mereka mengerahkan segala kemampuanya kepada mereka. Allah berfirman kepada mereka, ”sekarang sungguh kamu telah melihatnya, ” maksudnya kalian telah menyaksikan dengan mata kalian apa yang kalian cita-citakan, ”dan kamu menyaksikannya, ” lalu mengapa kalian tidak bersabar? Kondisi seperti itu tidaklah patut dan tidak baik, khususnya bagi orang-orang yang bercita-cita ikut berperang dan mengahrapkan apa yang dicita-citakanya itu.seharusnya merka mengerahkan kemampuan dan kekuatanya dalam hal tersebut. Ayat-ayat ini menunjukan bolehnya bercita-cita syahid. dan hal itu atas dasar bahwa Allah mengakui cita-cita mereka dan tidak mengingkarinya. Allah hanyalah mengingkari tindakan berpangku tangan, dan tidak beramal dengan sesuai dengan tuntunan cita-cita tersebut, dan Allah Maha Mengetahui."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 143: Dan sesungguhnya kamu pernah harap mati sebelum kamu menghadapinya. Maka sesungguhnya (sekarang) kamu telah ketahui dan kamu sedang melihat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya: sebelum perang Uhud banyak para sahabat terutama yang tidak ikut perang Badar menganjurkan agar Nabi Muhammad shallallahu 'alaihi wa sallam keluar dari kota Madinah memerangi orang-orang kafir. Yakni mengapa kalian kemudian tidak bersabar ketika menghadapinya. Dalam ayat ini terdapat dalil bahwa tidak makruh menginginkan mati syahid, hal ini diketahui karena Allah mengakui sikap mereka dan tidak mengingkarinya, yang Allah ingkari hanyalah ketika mereka tidak mengamalkan konsekwensinya, wallahu a'lam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 143",
    "description": "Ayat ini mengkritik orang-orang yang meninggalkan medan perang uhud padahal mereka telah berjanji siap mati syahid sebagaimana syuhada badar. Dan kamu benar-benar mengharapkan mati syahid sebelum kamu menghadapinya dalam perang uhud; maka sekarang kamu sungguh telah melihatnya, yakni apa yang kamu harapkan itu, dan kamu menyaksikannya, yakni kematian itu dengan mata kepala kamuketika beredar berita bahwa nabi gugur dalam perang uhud, pasukan muslim yang imannya lemah meninggalkan medan perang bahkan ada yang kembali kafir dan minta perlindungan abu sufya'n, pemimpin pasukan kafir. Allah kemudian mengingatkan bahwa nabi Muhammad hanyalah seorang rasul yang suatu saat pasti akan meninggal dunia sebagaimana sebelumnya telah berlalu, yakni telah meninggal dunia, beberapa rasul baik karena terbunuh atau sakit biasa. Apakah jika dia wafat atau dibunuh lalu kamu berbalik ke belakang meninggalkan islam dan menjadi murtad' barang siapa berbalik ke belakang, maka ia tidak akan merugikan Allah sedikit pun, tetapi ia sendiri yang akan rugi dan celaka karena kembali kepada kesesatan. Allah akan memberi balasan kepada orang yang bersyukur, yang tetap mempertahankan iman dan melaksanakan tugas dengan baik dalam situasi terancam sekalipun."
  }
]