[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan tidaklah Muhammad sholallohu alaihi wasallam itu kecuali seorang rasul yang sama dengan rasul-rasul yang telah datang sebelumnya,yang menyampaikan risalah dari tuhannya. Maka apakah jika dia meninggal dunia karena telah berahir ajalnya,atau terbunuh sebagaimana diisukan oleh para musuh,kalian akan murtad dari agama kalian, dan kalian akan meninggalkan risalah yang dibawa oleh Nabi kalian? Dan barangsiapa yang kembali dari agamanya,maka dia tidaklah mendatangkan kemudaratan bagi Allah sedikit pun. Dia hanyalah mencelakai dirinya sendiri saja dengan kemudaratan yang amat besar. Dan Adapun orang yang teguh di atas keimanan dan bersyukur kepada Tuhannya atas kenikmatan islam,maka sesungguhnya Allah memberikan balasan kepadanya dengan balasan terbaik."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "144. Muhammad itu tidak lain hanyalah seorang Rasul sebagaimana rasul-rasul sebelumnya yang telah meninggal dunia atau terbunuh. Apakah jika dia meninggal atau terbunuh maka kalian akan keluar dari agama kalian dan meninggalkan jihad?! Barangsiapa di antara kalian yang keluar dari agamanya, maka ia tidak akan menimpakan mudarat sedikitpun kepada Allah, karena Dia Mahakuat lagi Maha Perkasa. Tetapi ia akan mendatangkan mudarat bagi dirinya sendiri dengan menjerumuskan dirinya ke dalam kerugian dunia dan akhirat. Dan Allah akan memberikan balasan yang terbaik kepada orang-orang yang bersyukur kepada-Nya, yaitu dengan meneguhkan hati mereka untuk memegang teguh agama-Nya dan melanjutkan jihad mereka di jalan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "144. Allah mengingkari orang-orang yang hendak murtad saat dikabarkan terbunuhnya Nabi pada perang Uhud: “Muhammad tidak lain hanyalah seorang rasul, dan sebelumnya telah berlalu para rasul, sebagian mereka meninggal dan sebagian lainnya terbunuh. Apakah jika dia meninggal karena ajalnya telah datang atau dibunuh oleh orang-orang kafir kalian menjadi murtad dari agama kalian? Barangsiapa yang murtad, tidak akan memberi mudharat kepada Allah sedikitpun; dan Allah akan memberi pahala orang-orang yang bersyukur dengan ucapan dan perbuatan serta teguh dalam agama.” Syeikh as-Syinqithi berkata: “Dalam ayat ini Allah mengingkari orang yang mengira akan masuk surga tanpa diuji terlebih dahulu dengan berbagai kewajiban yang dapat membedakan siapa yang sabar dan ikhlas dalam beragama dari yang selainnya. Dan Allah menjelaskan hal ini dalam berbagai ayat, seperti dalam surat al-Baqarah ayat 214: أَمْ حَسِبْتُمْ أَنْ تَدْخُلُوا الْجَنَّةَ وَلَمَّا يَأْتِكُمْ مَثَلُ الَّذِينَ خَلَوْا مِنْ قَبْلِكُمْ ۖ مَسَّتْهُمُ الْبَأْسَاءُ وَالضَّرَّاءُ وَزُلْزِلُوا حَتَّىٰ يَقُولَ الرَّسُولُ وَالَّذِينَ آمَنُوا مَعَهُ مَتَىٰ نَصْرُ اللَّهِ ۗ أَلَا إِنَّ نَصْرَ اللَّهِ قَرِيبٌ Apakah kamu mengira bahwa kamu akan masuk surga, padahal belum datang kepadamu (cobaan) sebagaimana halnya orang-orang terdahulu sebelum kamu? Mereka ditimpa oleh malapetaka dan kesengsaraan, serta digoncangkan (dengan bermacam-macam cobaan) sehingga berkatalah Rasul dan orang-orang yang beriman bersamanya: \"Bilakah datangnya pertolongan Allah?\" Ingatlah, sesungguhnya pertolongan Allah itu amat dekat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "144. وَمَا مُحَمَّدٌ إِلَّا رَسُولٌ (Muhammad itu tidak lain hanyalah seorang rasul) Ketika Rasulullah mengalami luka di perang Uhud, syaitan berteriak sambil berkata: Muhammad telah terbunuh, sehingga sebagian orang beriman merasa lemah sampai berkata diantara mereka: Nabi Muhammad telah terbunuh maka serahkanlah saja tangan-tangan kalian karena sesungguhnya mereka adalah saudara kalian, dan sebagian yang lain berkata: seandainya dia adalah Rasul utusan Allah niscaya dia tidak akan terbunuh. قَدْ خَلَتْ مِن قَبْلِهِ الرُّسُلُ ۚ (sungguh telah berlalu sebelumnya beberapa orang rasul) Yakni Nabi Muhammad juga akan meninggal sebagaimana rasul-rasul sebelumnya telah meninggal, dan mungkin juga akan dibunuh sebagaimana rasul-rasul lain juga dibunuh. أَفَإِي۟ن مَّاتَ أَوْ قُتِلَ انقَلَبْتُمْ عَلَىٰٓ أَعْقٰبِكُمْ ۚ (Apakah Jika dia wafat atau dibunuh kamu berbalik ke belakang (murtad)?) Yakni mengapa kalian akan murtad dan meninggalkan agamanya jika dia meninggal atau terbunuh, padahal kalian mengetahui bahwa rasul-rasul sebelumnya telah pergi dan para pengikutnya senantiasa berpegang teguh pada agama mereka meski mereka ditinggal rasul mereka dengan kematian atau pembunuhan. وَمَن يَنقَلِبْ عَلَىٰ عَقِبَيْهِ (Barangsiapa yang berbalik ke belakang) Yakni dengan mundur dari peperangan atau dengan murtad dari agama Islam. فَلَن يَضُرَّ اللهَ شَيْـًٔا ۗ (maka ia tidak dapat mendatangkan mudharat kepada Allah sedikitpun) Akan tetapi ia hanya mendatangkan mudharat bagi dirinya sendiri. وَسَيَجْزِى اللهُ الشّٰكِرِينَ (dan Allah akan memberi balasan kepada orang-orang yang bersyukur) Yakni orang-orang yang bersabar, berperang, dan mati syahid; karena dengan itu mereka telah bersyukur kepada Allah atas nikmat keislaman."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "144 Muhammad itu tidak lain hanyalah seorang rasul seperti rasul lain dari golongan manusia. Sungguh telah berlalu sebelum Muhammad kisah beberapa orang rasul yang telah wafat. Apakah Jika dia wafat atau dibunuh kamu berbalik ke belakang untuk murtad setelah kalian beriman? Barangsiapa yang berbalik ke belakang murtad dari agamanya, maka ia tidak dapat mendatangkan mudharat kepada Allah sedikitpun, akan tetapi justru memudhoroti diri mereka sendiri dan Allah akan memberi balasan kepada orang-orang yang bersyukur dengan balasan yang baik atas ketetapan mereka dalam beragama. Ayat ini turun ketika orang-orang muslim kalah dalam perang Uhud, dan terdengar kabar bahwa Nabi terbunuh. Berkatalah seseorang: Muhammad telah terbunuh, maka berikanlah dengan tangan kalian, sesungguhnya mereka juga saudara kalian. Dan Umar melihat orang-orang berbalik badan. Kemudian turunlah ayat: Tidak lain Muhammad hanyalah seorang rasul."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Nabi Muhammad hanyalah seorang rasul. Sebelumnya telah berlalu} berlalu {beberapa rasul. Apakah jika dia wafat atau dibunuh, kalian berbalik ke belakang} kalian murtad dari agama kalian {Siapa saja yang berbalik ke belakang} salah satu diantara kalian murtad dari agamanya {maka ia tidak akan mendatangkan mudarat kepada Allah sedikit pun. Allah akan memberi balasan kepada orang-orang yang bersyukur"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "144. Allah berfirman, “Muhammad itu bukanlah lain hanya seorang Rasul, sungguh telah berlalu sebelumnya beberapa Rasul.” Maksudnya, beliau bukan rasul yang pertama, bahkan beliau adalah termasuk jenis para Rasul yang telah ada sebelum beliau, di mana tugas mereka adalah menyampaikan misi Rabb mereka dan melaksanakan perintah-perintahNya, dan mereka itu tidaklah kekal. kekekalan mereka bukanlah suatu syarat dari penataan dari perintah-perintah Allah. Yang wajib atas seluruh umat adalah beribadah kepada Rabb mereka pada setiap waktu dan kondisi. Karena itu Allah berfirman, “Apakah jika dia wafat atau di bunuh, kamu berbali kebalakang (murtad)” dengan meninggalkan sesuatu yang telah datang kepada kalian berupa keimanan dan syariat jihad, atau selainya? Allah berfirman, “barang siapa yang berbalik kebalakang, maka dia tidak adapat mendatangkan mudharat kapada Allah sedikitpun, ” dia hanya akan mendatangkan mudharat kepada dirinya sendiri, dan sekirany tidak demikian, maka Allah tidak butuh kepadanya, dan Allah pasti akan mengakan agamanya serta memuliakan hamba-hambaNya yang beriman. Ketika Alllah mencela orang-orang yang berbalik kebelakang, maka Allah menguji orang-orang yang tegar bersam RasulNya dan mentaati perintah tuhanya seraya berfirman, “Dan Allah akan memberi balasan kepada orang-orang yang bersyukur. ”Bersyukur itu tidaklah ada kecuali dengan menegakan pengahambaan kepada Allah dalam segala kondisi. Di dalam ayat yang mulia ini terkandung petunjuk dari Allah segala hal dalam setiap urusan agama dengan mempersiapkan beberapa orang yang mumpuni dalam hal itu. Apabila salah seorang meninggal, maka digantikan oleh lainya, dan agar seluruh kaum mukminin bertujuan menegakan agama Allah dan berjihad menurut kemampuanya, dan agar jangan sampai mereka memiliki tujuan bersama suatu pemimpin tanpa pemimpin lainya, maka dengan kondisi ini niscaya urusan mereka akan lancar dan berjalan baik. Di dalam ini juga terkandung sebuah dalil atas keutamaan kejujuran tungkat tinggi dari Abu Bakar As-Shidik dan para sahabatnya yang memerangi orang-orang murtad setelah Rosululloh karena mereka adalah pemimpin orang-orang yang bersyukur."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 144: Dan Muhammad itu tidak lain melainkan seorang Rasul yang telah lalu dahulu daripadanya beberapa rasul; apakah jika ia mati atau terbunuh, kamu akan berpaling atas tumit-tumit kamu? Padahal barangsiapa berpaling atas dua tumitnya, maka tidak akan ia menyusahkan Allah sedikit jua pun; dan Allah akan balas mereka yang menerima kasih"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Nabi Nabi Muhammad shallallahu 'alaihi wa sallam adalah seorang manusia yang diangkat Allah menjadi rasul. Rasul-rasul sebelumnya telah wafat. Ada yang wafat karena terbunuh dan ada pula yang karena sakit biasa. Karena itu Nabi Muhammad shallallahu 'alaihi wa sallam juga akan wafat seperti halnya rasul-rasul yang terdahulu itu. Di waktu berkecamuknya perang Uhud tersiarlah berita bahwa Nabi Muhammad shallallahu 'alaihi wa sallam mati terbunuh. Berita ini mengacaukan kaum muslimin, sehingga ada yang bermaksud meminta perlindungan kepada Abu Sufyan (pemimpin kaum Quraisy). Sementara itu orang-orang munafik mengatakan bahwa kalau Nabi Muhammad itu seorang Nabi tentulah dia tidak akan mati terbunuh. Maka Allah menurunkan ayat ini untuk menenteramkan hati kaum muslimin dan membantah kata-kata orang-orang munafik itu. (Sahih Bukhari bab Jihad). Abu Bakar radhiyallahu 'anhu iuga membacakan ayat ini ketika terjadi kegelisahan di kalangan para sahabat di hari wafatnya Nabi Muhammad shallallahu 'alaihi wa sallam untuk menenteramkan Umar Ibnul Khaththab radhiyallahu 'anhu. dan sahabat-sahabat yang tidak percaya tentang wafatnya Nabi itu. (Sahih Bukhari bab Ketakwaan Sahabat). Di dalam kisah ini terdapat dalil keutamaan Abu Bakr Ash Shiddiq radhiyallahu 'anhu. Bahkan hanya merugikan dirinya sendiri. Hal itu, karena Allah tidak butuh kepadanya dan akan tetap menegakkan agama-Nya serta menguatkan hamba-hamba-Nya yang mukmin. Yakni orang-orang yang tetap teguh pendirian."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 144",
    "description": "Ketika beredar berita bahwa nabi gugur dalam perang uhud, pasukan muslim yang imannya lemah meninggalkan medan perang bahkan ada yang kembali kafir dan minta perlindungan abu sufya'n, pemimpin pasukan kafir. Allah kemudian mengingatkan bahwa nabi Muhammad hanyalah seorang rasul yang suatu saat pasti akan meninggal dunia sebagaimana sebelumnya telah berlalu, yakni telah meninggal dunia, beberapa rasul baik karena terbunuh atau sakit biasa. Apakah jika dia wafat atau dibunuh lalu kamu berbalik ke belakang meninggalkan islam dan menjadi murtad' barang siapa berbalik ke belakang, maka ia tidak akan merugikan Allah sedikit pun, tetapi ia sendiri yang akan rugi dan celaka karena kembali kepada kesesatan. Allah akan memberi balasan kepada orang yang bersyukur, yang tetap mempertahankan iman dan melaksanakan tugas dengan baik dalam situasi terancam sekalipun. Sebagian pasukan muslim lari dari medan perang uhud karena takut mati. Mereka lupa bahwa setiap yang bernyawa tidak akan mati dengan sebab apa pun kecuali dengan izin Allah, sebagai ketetapan yang telah ditentukan waktunya sehingga tidak bisa disegerakan dengan tetap bertahan dalam medan pertempuran atau ditunda dengan meninggalkan medan perang. Barang siapa berperang dan berusaha karena menghendaki pahala dunia, niscaya kami berikan kepadanya sebagian pahala dunia itu bagi siapa yang kami kehendaki, dan barang siapa menghendaki pahala akhirat, kami berikan pula kepadanya pahala akhirat itu sebagai anugerah kami atas syukur mereka yang telah menggunakan nikmat kami sebagaimana seharusnya, dan pasti kami akan memberi balasan kebaikan kepada orang-orang yang bersyukur (lihat: surah al-isra''/17: 18-19)."
  }
]