[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Seseorang tidak akan meninggal dunia kecuali dengan izin Allah dan takdirNya dan sampai dia menghabiskan masa hidup yang Allah tentukan baginya sebagai bentuk ketetapan yang pasti. Dan barangsiapa mencari kesenangan dunia dengan amal shalihnya,maka Kami akan memberikan kepadanya rizki yang telah Kami tentukan bagiannya bagi dirinya,dan tidak ada bagian pahala baginya di akhirat kelak. Dan barangsiapa mencari pahala dari Allah di akhirat dengan amal perbuatannya,maka Kami akan menganugerahinya apa yang ia inginkan,dan Kami akan berikan balasan kepadanya dengan sempurna,selain rizki yang menjadi bagiannya di dunia ini. Orang ini telah bersyukur kepada Kami dengan ketaatan dan jihadnya. Dan kami akan membalas orang-orang yang bersukur dengan kebaikan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "145. Setiap jiwa tidak akan mati kecuali dengan ketentuan Allah setelah memenuhi jangka waktu yang telah ditetapkan oleh Allah dan Dia jadikan sebagai ajal baginya, tidak lebih dan tidak kurang. Barangsiapa menghendaki ganjaran di dunia dengan amal perbuatannya, Kami akan memberikanya menurut kadar yang telah ditetapkan untuknya, dan tidak ada bagian untuknya di akhirat. Dan barangsiapa menghendaki ganjaran Allah di akhirat, Kami akan memberikannya. Dan Kami akan memberikan balasan yang sangat besar bagi orang-orang yang bersyukur kepada Rabb mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "145. Seseorang tidak akan mati kecuali dengan qadha dan takdir dari Allah. Allah telah menulis ajal setiap jiwa dalam kitab dengan waktu yang telah ditentukan. Barangsiapa yang berhadap dari amalnya balasan dunia niscaya Kami akan memberinya, namun di akhirat ia tidak akan mendapat bagian pahalanya. Dan barangsiapa yang berharap balasan akhirat niscaya Kami akan memberinya balasan secara sempurna beserta bagian dunia yang telah Kami tetapkan. Dan Kami akan memberi pahala orang-orang yang bersyukur yang mengagungkan Allah dengan perkataan dan perbuatan. Ayat ini terikat dengan kehendak Allah yang disebutkan dalam firman-Nya: مَنْ كَانَ يُرِيدُ الْعَاجِلَةَ عَجَّلْنَا لَهُ فِيهَا مَا نَشَاءُ لِمَنْ Barangsiapa menghendaki kehidupan sekarang (duniawi), maka Kami segerakan baginya di dunia itu apa yang kami kehendaki bagi orang yang kami kehendaki. (al-Isra: 18)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "145. وَمَا كَانَ لِنَفْسٍ أَن تَمُوتَ إِلَّا بِإِذْنِ اللهِ (Sesuatu yang bernyawa tidak akan mati melainkan dengan izin Allah) Yakni dengan qadha dan qadar dari Allah. كِتٰبًا مُّؤَجَّلًا ۗ (sebagai ketetapan yang telah ditentukan waktunya) Yakni Allah telah menuliskan kematian atas seluruh jiwa dengan batas waktu yang tidak dapat dipercepat maupun diundur. وَمَن يُرِدْ (Barang siapa menghendaki) Yakni dengan beramal untuk itu. ثَوَابَ الدُّنْيَا (pahala dunia) Seperti ghanimah (rampasan perang) dan yang lainnya. نُؤْتِهِۦ مِنْهَا (niscaya Kami berikan kepadanya pahala dunia itu) Yakni dari pahala tersebut. وَمَن يُرِدْ (dan barang siapa menghendaki) Yakni dengan beramal untuk itu. ثَوَابَ الْاٰخِرَةِ (pahala akhirat) Yakni berupa surga. Maka Kami akan berikan pula pahala tersebut, bahkan kami akan melipat gandakan kebaikannya dengan kelipatan yang banyak. وَسَنَجْزِى الشّٰكِرِينَ(Dan kami akan memberi balasan kepada orang-orang yang bersyukur) Yakni bersyukur dengan menjalankan apa yang Kami perintahkan seperti pergi berperang dan bersabar. Dari Ali bin Abi Thalib ia berkata: orang-orang yang bersyukur yang senantiasa teguh diatas agama mereka adalah Abu Bakar Ash Shiddiq dan para sahabatnya. Dan Ali bin Abi Thalib juga berkata: Abu Bakar adalah pemimpin orang-orang yang bersyukur, yakni karena keteguhan diatas agamanya setelah wafatnya Rasulullah dan karena ia memerangi orang-orang yang murtad."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "145 Sesuatu yang bernyawa tidak akan mati melainkan dengan izin dan ketetapan Allah, sebagai ketetapan yang telah ditentukan waktunya. Barang siapa menghendaki pahala dunia seperti ghanimah dan lainnya, niscaya Kami berikan kepadanya pahala dunia itu, dan barang siapa menghendaki pahala akhirat, yaitu surga maka Kami berikan (pula) kepadanya pahala akhirat itu dengan berlipat-lipat kebaikannya. Dan kami akan memberi balasan yang melimpah kepada orang-orang yang bersyukur. Yaitu orang-orang yang tetap teguh dalam agama mereka dan taat kepada perintah Tuhan-nya dengan berperang dan sabar."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Seseorang tidak akan mati} tidak mungkin bagi seseorang untuk mati {kecuali dengan izin Allah} kecuali dengan keputusan dan kuasa Allah {sebagai ketetapan yang telah ditentukan waktunya} Dia menetapkan kematian dengan ketetapan yang ditentukan waktunya, waktu yang sudah ditentukan tidak bisa dimajukan tidak pula diakhirkan {Siapa saja yang menghendaki pahala dunia, maka Kami berikan} berikan {kepadanya pahala itu dan siapa yang menghendaki pahala akhirat, maka Kami berikan (pula) kepadanya pahala itu. Kami akan memberi balasan kepada orang-orang yang bersyukur"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "145. kemudian Allah memberitakan bahwasanya seluruh jiwa terkait dengan ajal yang telah ditentukan untuknya dengan izin Allah, qadha dan qadarNya. karena itu, barang siapa yang ditentukan qadhanya untuk meninggal, niscaya mereka akan meninggal, walaupun tanpa ada sebabnya. Dan barang siapa yang di kehendaki hidup walaupun tertimpa oleh sebab-sebab yang memudaratkan jiwanya, niscaya tidak akan membinasakannya sebelum ajalnya tiba. itu karena Allah telah menetapkan qadha dan qadar dan menulisnya hingga waktu yang ditentukan. \"Apabila ajal mereka telah tiba, niscaya tidak dapat di tunda sesaatpun dan tidak pula di majukan.\" Kemudian Allah memberitakan bahwasanya Dia memberikan pahala dunia dan akhirat kepada manusia selama keinginan mereka tertuju kepada hal itu seraya berfirman, “Barangsiapa menghendaki pahala dunia, niscaya Kami berikan kepadanya pahala dunia itu, dan barangsiapa menghendaki pahala akhirat, niscaya Kami berikan (pula) kepadanya pahala akhirat itu.” Allah berfirman, \"Kepada masing-masing golongan baik golongan ini maupun golongan itu Kami berikan bantuan dari kemurahan Tuhanmu. Dan kemurahan Tuhanmu tidak dapat dihalangi. Perhatikanlah bagaimana Kami lebihkan sebagian dari mereka atas sebagian (yang lain). Dan pasti kehidupan akhirat lebih tinggi tingkatnya dan lebih besar keutamaannya.\" -Al-Isra:20-21- “Dan Kami akan memberi balasan kepada orang-orang yang bersyukur.” Allah tidak menyebutkan “balasan mereka, ” hal ini menunjukkan atas banyak dan agungnya balasan itu, dan agar diketahui bahwa balasan itu menurut kadar syukur yang dilakukan; sedikit-banyaknya maupun mutunya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 145: Dan tidak ada satu pun jiwa yang mati melainkan dengan izin Allah tulisan yang ditentukan temponya; dan barangsiapa mau ganjaran dunia, Kami akan beri kepadanya daripada (ganjaran dunia) itu; dan barangsiapa mau ganjaran Akhirat, Kami akan beri kepadanya daripada (ganjaran Akhirat) itu; dan Kami akan balas mereka yang bersyukur."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni dengan qadhaa'-Nya. Tidak maju dan tidak mundur. Oleh karena itu, mengapa kalian malah mundur? Padahal mundur tidak menolak kematian dan tetapnya kalian (bersabar) pun tidak mengakhiri kehidupan. Dengan demikian, kalau seseorang ditaqdirkan akan mati, maka ia akan mati walau pun tanpa sebab dan kalau pun seseorang diancam mati atau ada usaha dari orang lain untuk membunuhnya, maka dia tidak akan mati sampai tiba ajalnya. Tidak disebutkan balasannya karena banyak dan besarnya balasan, dan bahwa balasan akan diberikan sesuai tingkat syukur seseorang; sedikit atau banyak."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 145",
    "description": "Sebagian pasukan muslim lari dari medan perang uhud karena takut mati. Mereka lupa bahwa setiap yang bernyawa tidak akan mati dengan sebab apa pun kecuali dengan izin Allah, sebagai ketetapan yang telah ditentukan waktunya sehingga tidak bisa disegerakan dengan tetap bertahan dalam medan pertempuran atau ditunda dengan meninggalkan medan perang. Barang siapa berperang dan berusaha karena menghendaki pahala dunia, niscaya kami berikan kepadanya sebagian pahala dunia itu bagi siapa yang kami kehendaki, dan barang siapa menghendaki pahala akhirat, kami berikan pula kepadanya pahala akhirat itu sebagai anugerah kami atas syukur mereka yang telah menggunakan nikmat kami sebagaimana seharusnya, dan pasti kami akan memberi balasan kebaikan kepada orang-orang yang bersyukur (lihat: surah al-isra''/17: 18-19) ayat ini masih berisi kritikan terhadap pasukan islam yang tidak taat kepada perintah rasulullah dalam perang uhud dengan memaparkan keadaan nabi dan umat terdahulu. Dan betapa banyak nabi yang berperang didampingi sejumlah besar dari pengikutnya yang bertakwa juga terluka dan terbunuh. Tetapi mereka, yakni para pengikut nabi tersebut, tidak menjadi lemah kondisi fisiknya karena bencana kekalahan yang menimpanya di jalan Allah, tidak patah semangat dan tidak pula menyerah kepada musuh dengan meminta perlindungan kepada mereka. Dan Allah mencintai, serta memberi anugerah kepada orang-orang yang sabar dalam menjalankan kewajiban dan menghadapi musuh."
  }
]