[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan tidak ada ucapan orang-orang yang bersabar itu selain mengatakan, “Wahai Tuhan kami,ampunilah dosa-dosa kami dan apa yang terjadi pada hidup kami berupa tindakan berlebihan yang kami perbuat dalam urusan agama kami,dan teguhkanlah kaki-kaki kami sehingga kami tidak melarikan diri dari melawan musuh kami, dan tolonglah kami menghadapi orang-orang yang mengingkari keesaan Mu dan kenabian para nabiMu.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "147. Tidak ada yang diucapkan oleh orang-orang yang sabar itu tatkala mereka ditimpa ujian kecuali doa mereka, “Ya Rabb kami, ampunilah dosa-dosa kami dan kelancangan kami dalam melanggar batas-batas urusan kami. Teguhkanlah hati kami ketika kami berjumpa dengan musuh kami. Dan tolonglah kami untuk mengalahkan orang-orang yang kafir kepada-Mu.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "147. Orang-orang yang bersabar itu senantiasa berdoa mengharap ampunan dari Allah atas dosa-dosa dan kesalahan mereka, dan meminta agar diteguhkan kaki mereka ketika dalam peperangan dan agar dimenangkan saat melawan orang-orang yang mendustakan Allah dan rasul-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "147. وَمَا كَانَ قَوْلَهُمْ (Tidak ada doa mereka) Yakni doa mereka yang bersama para nabi saat bertemu dengan musuh mereka. ذُنُوبَنَا (dosa-dosa kami) Pendapat mengatakan yang dimaksud adalah dosa-dosa kecil mereka. وَإِسْرَافَنَا فِىٓ أَمْرِنَا (dan tindakan-tindakan kami yang berlebih-lebihan dalam urusan kami) Pendapat mengatakan yakni dosa-dosa besar. Dan makna (الإسراف) adalah apa yang didalamnya terdapat sikap melampaui batas. Mereka berdo’a dengan doa ini padahal mereka adalah pada rabbany sebagai bentuk kerendahan hati mereka. وَثَبِّتْ أَقْدَامَنَا (dan tetapkanlah pendirian kami) Yakni pada saat dalam peperangan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Para sahabat telah berjuang bersama Rasulullah, mereka terus mengorbankan jiwa dan raga mereka di jalan Allah, sekalipun mereka tidak pernah puas dan tertipu dengan amalan yang mereka kerjakan, bahkan mereka selalu merasakan ada kelalaian dalam beribadah sekalipun mereka terus berusaha dan istiqomah dalam menjalankannya, dan inilah kedudukan yang paling tinggi dalam penghambaan seseorang kepada tuhannya, maka barangsiapa yang senantiasa mengkoreksi bahwa dalam dirinya ada kelalaian dalam beribadah maka hendaklah ia memperbanyak ketaatan, dan patutlah mereka dalam derajat ketaatan dan taqwa terus meningkat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "147 Tidak ada doa mereka yang bersama Nabi ketika berhadapan dengan musuh mereka selain ucapan: “Ya Tuhan kami, ampunilah dosa-dosa kecil kami serta dosa-dosa besar kami yang melampaui batasan-Mu dan tetapkanlah pendirian kami dalam berperang, dan perkuatlah hati kami untuk berjuang hingga tidak sampai terkalahkan, dan tolonglah kami dari kaum yang kafir dengan pertolongan yang dapat menolong agama-Mu”."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidak lain ucapan mereka kecuali doa, “Ya Tuhan kami, ampunilah dosa-dosa kami dan tindakan-tindakan kami yang berlebihan} tindakan kami yang melampaui batas} dalam urusan kami, tetapkanlah pendirian kami, dan tolonglah kami terhadap kaum yang kafir”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "147. Kemudian Allah menyebutkan tentang perkataan dan permohonan bantuan mereka kepada Rabb mereka seraya berfirman, “Tidaklah doa mereka”, yaitu pada kondisi dan kesempatan yang sulit itu, “kecuali ucapan, ‘Ya Tuhan kami, ampunilah dosa-dosa kami dan tindakan-tindakan kami yang berlebih-lebihan dalalm urusan kami’.” Berlebih-lebihan itu adalah melampaui batas menuju kepada yang haram. Mereka mengetahui bahwa dosa-dosa dan sikap berlebih-lebihan itu merupakan faktor paling besar dalam kehinaan, dan bahwa menjauh dari hal itu merupakan faktor terbesar mendapatkan kemenangan. Maka mereka memohon kepada Rabb mereka agar mengampuni dosa-dosa dari sikap berlebih-lebihan mereka tersebut. Kemudian mereka tidak hanya bersandar pada kesabaran yang telah mereka kerahkan, akan tetapi mereka bersandar pada Allah dan memohon kepadaNya agar meneguhkan kaki mereka ketika menghadapi musuh kaum kafir, dan agar Allah membela mereka atas kaum kafir tersebut. Mereka menyatukan antara kesabaran dan meninggalkan hal-hal yang bertentangan dengannya, bertaubat, memohon ampunan, dan memohon pertolongan kepada Tuhan mereka. Maka tidaklah meragukan lagi bahwa Allah membela mereka dan menjadikan akibat yang baik bagi mereka di dunia dan di akhirat. Karen aitu Allah berfirman,"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 147: Dan tidak ada ucapan mereka melainkan perkataan : “Hai Tuhan kami! Ampunkanlah dosa-dosa kami dan perliwatan batas kami dalam urusan kami dan tetapkanlah kaki kami dan tolonglah kami atas (mengalahkan) kaum kafirin.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu melampaui batas-batas hukum yang telah ditetapkan Allah Subhaanahu wa Ta'aala. Mereka mengetahui bahwa dosa-dosa dan sikap melampaui batas merupakan penyebab kekalahan dan bahwa melepaskan diri dari dosa-dosa merupakan sebab kemenangan, maka mereka meminta kepada Allah agar dosa-dosa itu diampuni. Mereka tidak bersandar dengan kemampuan mereka, bahkan mereka bersandar dan bertawakkal kepada Allah. Mereka meminta kepada-Nya agar diberi keteguhan saat menghadapi musuh. Mereka menggabung antara sabar, tobat, istighfar dan meminta pertolongan kepada Allah, sudah pasti Allah akan menolong mereka dan menjadikan kesudahan yang baik untuk mereka di dunia dan akhirat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 147",
    "description": "Setelah pada ayat sebelumnya Allah menjelaskan kondisi fisik dan semangat pantang menyerah pengikut nabi terdahulu, lalu dalam ayat ini dia menjelaskan situasi batin mereka yang tercermin pada ungkapan mereka. Dan tidak lain ucapan mereka hanyalah doa, ya tuhan kami, ampunilah dosa-dosa kami dan tindakan-tindakan kami yang berlebihan dan melampaui batas hukum yang ditetapkan Allah dalam urusan kami berkaitan dengan persiapan perang, dan tetapkanlah pendirian kami supaya tidak berubah niat dan tujuan kami, dan tolonglah, anugerahkan kemenangan kepada kami atas orang-orang kafir. Maka Allah mengabulkan doa mereka dan memberi mereka pahala di dunia berupa kemenangan, memperoleh harta rampasan perang, nama baik dan kehormatan, dan pahala yang baik di akhirat, yaitu surga dan keridaan Allah. Dan Allah mencintai, memberi anugrah kepada orang-orang yang berbuat kebaikan."
  }
]