[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka Allah memberikan kepada orang-orang yang sabar itu balasan mereka di dunia dalam bentuk kemenangan atas musuh-musuh mereka dan dengan kekuasaan penuh bagi mereka di muka bumi dan dengan balasan yang baik lagi agung di akhirat,yaitu surga-surga yang penuh kenikmatan. Dan Allah menyukai tiap-tiap orang yang memperbagus ibadahnya kepada Tuhannya dan muamalahnya kepada sesama makhlukNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "148. Maka Allah memberi mereka ganjaran dunia dengan memberikan kemenangan dan kejayaan. Dan juga memberi mereka ganjaran yang baik di akhirat dengan meridai mereka dan melimpahkan kenikmatan yang tiada tara di dalam surga yang penuh kenikmatan. Dan Allah menyukai orang-orang yang berbuat baik dalam ibadah dan muamalah mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "148. Maka Allah mengabulkan doa mereka dan memuliakan mereka dengan kemenangan dan kejayaan di dunia dan meraih surga di akhirat. Allah mencintai orang yang baik dalam beramal dan berucap."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "148. فَـَٔاتَىٰهُمُ اللهُ (Karena itu Allah memberikan kepada mereka) Yakni karena doa mereka. ثَوَابَ الدُّنْيَا (pahala di dunia) Berupa kemenangan, harta rampasan, kemuliaan, dan lainnya. وَحُسْنَ ثَوَابِ الْاٰخِرَةِ ۗ( dan pahala yang baik di akhirat) Yakni berupa kenikmatan di surga. وَاللهُ يُحِبُّ الْمُحْسِنِينَ(Dan Allah menyukai orang-orang yang berbuat kebaikan) Yakni kebaikan dalam urusan perang dan lainnya, sehingga Allah membaikkan pahala mereka di dunia dan di akhirat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "148 Karena kesungguhan dan kesabaran mereka Allah memberikan kepada mereka pahala di dunia berupa pertolongan dan ghanimah. Dan pahala yang baik di akhirat yaitu surga dan berbagai kenikmatannya. Dan Allah menyukai orang-orang yang berbuat kebaikan dengan ikhlas hanya karena Allah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lalu Allah menganugerahi mereka} memberi mereka {pahala dunia dan pahala yang baik di akhirat} pahala akhirat yang baik yaitu surge {Allah mencintai orang-orang yang berbuat kebaikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "148. “Karena itu Allah memberikan kepada mereka pahala di dunia, ” berupa pembelaan dan kemenangan serta harta rampasan perang, “dan pahala yang baik di akhirat”, yaitu kemenangan dengan mendapatkan keridhaan Rabb mereka dan kenikmatan yang abadi yang terlepas dari segala rintangan. Tidaklah mereka memperoleh itu semua melainkan karena mereka telah berbuat amalan yang baik untukNya hingga Dia memberikan balasan untuk mereka dengan balasan yang terbaik. Karena itu Allah berfirman, “Dan Allah menyukai orang-orang yang berbuat kebaikan” dalam beribadah kepada Sang Pencipta dan bermuamalah dengan makhluk. Dan termasuk berbuat baik itu adalah dia melakukan sesuatu dalam memerangi musuh sebagaimana yang dilakukan oleh orang-orang yang beriman tersebut. Kemudian Allah berfirman,"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 148: Maka Allah beri kepada mereka ganjaran dunia dan ganjaran akhirat yang baik; dan Allah itu kasih kepada orang-orang yang berbuat kebaikan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Pahala dunia dapat berupa kemenangan, memperoleh harta rampasan, pujian-pujian dan lain-lain. Berupa mendapatkan surga dan keridhaan Allah. Baik dalam beribadah kepada Allah maupun dalam bermu'amalah kepada sesama manusia. Termasuk ihsan pula adalah melakukan hal yang serupa dengan generasi sebelum mereka dalam berjihad melawan musuh."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 148",
    "description": "Maka Allah mengabulkan doa mereka dan memberi mereka pahala di dunia berupa kemenangan, memperoleh harta rampasan perang, nama baik dan kehormatan, dan pahala yang baik di akhirat, yaitu surga dan keridaan Allah. Dan Allah mencintai, memberi anugrah kepada orang-orang yang berbuat kebaikansetelah dijelaskan bahwa orang yang berbuat kebaikan akan mendapatkan anugerah di dunia maupun akhirat, ayat ini mengingatkan bahwa mengikuti orang-orang kafir akan mengakibatkan kerugian bahkan kegagalan. Wahai orang-orang yang beriman! jika kamu menaati dan tunduk pada saran orang-orang yang kafir yang bertentangan dengan tuntunan Allah dan rasul-Nya, niscaya mereka akan mengembalikan kamu ke belakang, yaitu murtad. Jika hal itu kamu lakukan maka kamu akan kembali menjadi orang yang rugi di dunia dan akhirat."
  }
]