[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang yang beriman kepada Allah dan RosulNya serta melaksanakan syariatNya,jika kalian mengikuti orang-orang yang mengingkari ketuhananku dan tidak beriman kepada Rosul-rosulKu,dari kalangan Yahudi,Nasrani,orang-orang munafik,dan orang-orang musyrik dalam perkara yang mereka perintahkan kepada kalian dan perkara yang mereka larang bagi kalian, niscaya mereka akan menyesatkan kalian dari jalan kebenaran dan membuat kalian murtad dari agama kalian,sehingga kalian kembali dengan memikul kerugian yang nyata dan kebinasaan yang pasti."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "149. Wahai orang-orang yang beriman kepada Allah dan mengikuti Rasul-Nya, jika kalian patuh kepada orang-orang kafir dari kalangan Yahudi, Nasrani dan musyrik dalam mengikuti jalan yang sesat, niscaya mereka akan membuat kalian kembali kepada kekafiran setelah kalian beriman. Maka kalian akan kembali dengan membawa kerugian besar di dunia dan di akhirat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "149-150. Allah memperingatkan orang-orang beriman agar tidak mentaati orang-orang yang mendustakan Allah dan rasul-Nya, sebab mereka sangat ingin menyesatkan kalian dari kebenaran agar kalian murtad dari agama, sehingga kalian mendapat kerugian di dunia dan di akhirat. Mereka bukanlah penolong kalian yang layak ditaati, namun Allah-lah penolong kalian, Dialah sebaik-baik penolong. Lihat: ayat 28 surat Ali Imran. Adapun ayat 150 dijelaskan dalam ayat 160: إِنْ يَنْصُرْكُمُ اللَّهُ فَلَا غَالِبَ لَكُمْ ۖ وَإِنْ يَخْذُلْكُمْ فَمَنْ ذَا الَّذِي يَنْصُرُكُمْ مِنْ بَعْدِهِ ۗ وَعَلَى اللَّهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُونَ Jika Allah menolong kamu, maka tak adalah orang yang dapat mengalahkan kamu; jika Allah membiarkan kamu (tidak memberi pertolongan), maka siapakah gerangan yang dapat menolong kamu (selain) dari Allah sesudah itu? Karena itu hendaklah kepada Allah saja orang-orang mukmin bertawakkal."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "149. يٰٓأَيُّهَا الَّذِينَ ءَامَنُوٓا۟ إِن تُطِيعُوا۟ الَّذِينَ كَفَرُوا۟ (Hai orang-orang yang beriman, jika kamu mentaati orang-orang yang kafir itu) Ini seakan-akan adalah bantahan bagi orang-orang yang menyeru untuk menyerahkan diri di perang Uhud setelah kekalahan mereka dan berharap orang-orang musyrik akan memperlakukan mereka dengan baik. يَرُدُّوكُمْ عَلَىٰٓ أَعْقٰبِكُمْ(niscaya mereka mengembalikan kamu ke belakang) Yakni mengeluarkan kalian dari agama Islam menuju kekufuran. فَتَنقَلِبُوا۟ خٰسِرِينَ(lalu jadilah kamu orang-orang yang rugi) Yakni kembali dalam keadaan merugi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "149 Hai orang-orang yang beriman, jika kamu mentaati orang-orang yang kafir itu dengan meninggalkan berjuang dan justru menyerahkan diri kepada musuh, niscaya mereka akan mengembalikan kamu kepada kekafiran setelah Islam, lalu jadilah kamu orang-orang yang rugi di dunia, dan diazab di akhirat. Imam Ali ra berkata: Ayat ini turun untuk perkataan orang-orang munafik kepada orang mukmin saat perang Uhud: Pulanglan kalian kepada saudara kalian, dan masuklah kepada agama mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, jika kalian menaati orang-orang kafir, niscaya mereka akan mengembalikan kamu ke belakang.} mengembalikan kalian kepada perkara awal kalian yaitu syirik kepada Allah {sehingga kalian akan kembali} kembali {dalam keadaan merugi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "149. Ini adalah larangan dari Allah untuk kaum Mukminin, yaitu mereka tidak boleh menaati kaum kafir dari kalangan kaum munafik dan kaum musyrikin. Karena bila mereka menaati orang-orang tersebut, maka tidaklah kaum itu menghendaki untuk mereka melainkan keburukan, sedangkan tujuan orang-orang itu adalah mengembalikan mereka (kaum Mukminin) kepada kekufuran yang berakibat kepada kesia-siaan dan kerugian."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 149: Hai orang-orang yang beriman! Jika kamu taat kepada mereka yang kafir itu, niscaya mereka palingkan kamu atas tumit-tumit kamu, maka kamu akan terpaling di dalam keadaan rugi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Hal itu, karena tidak ada yang mereka inginkan terhadap kita selain keburukan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 149",
    "description": "Setelah dijelaskan bahwa orang yang berbuat kebaikan akan mendapatkan anugerah di dunia maupun akhirat, ayat ini mengingatkan bahwa mengikuti orang-orang kafir akan mengakibatkan kerugian bahkan kegagalan. Wahai orang-orang yang beriman! jika kamu menaati dan tunduk pada saran orang-orang yang kafir yang bertentangan dengan tuntunan Allah dan rasul-Nya, niscaya mereka akan mengembalikan kamu ke belakang, yaitu murtad. Jika hal itu kamu lakukan maka kamu akan kembali menjadi orang yang rugi di dunia dan akhiratjangan kamu ikuti saran orang-orang kafir, tetapi ikutilah aturan Allah, karena hanya Allah-lah pelindungmu, dan dia penolong yang terbaik."
  }
]