[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai rasul), ”maukah aku kabarkan kepada kalian tentang sesuatu yang lebih baik dari apa yang dijadikan indah bagi manusia di kehidupan dunia ini?” bagi siap saja yang senantiasa merasa diawasi oleh Allah dan takut azab Nya, tersedia surge-surga yang di bawah istana-istana dan pepohonannya mengalir sungai-sungai, mereka kekal di dalamnya. Dan bagi mereka istri-istri yang bersih dari haid, nifas, dan akhlak yang buruk. Dan bagi mereka karunia yang lebih agung dari itu, yaitu menggapai keridhaan dari Allah. Dan Allah Maha mengetahui keadaan-keadaan mereka, dan dia akan memberikan balasan kepada mereka atas semua itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Katakanlah -wahai Rasul-, “Maukah kuberitahukan kepada kalian sesuatu yang lebih baik dari kesenangan-kesenangan duniawi? Orang-orang yang bertakwa kepada Allah dengan menaati-Nya dan meninggalkan kemaksiatan kepada-Nya akan mendapatkan surga-surga yang mengalir sungai-sungai di bawah bangunan-bangunan istana dan pepohonannya, mereka kekal di dalamnya. Tidak ada kematian dan kebinasaan yang menjemput mereka. Di dalamnya mereka memiliki istri-istri yang suci dari segala macam keburukan, baik fisik maupun mental. Disamping itu mereka akan mendapatkan rida dari Allah, sehingga Allah tidak akan murka kepada mereka selama-lamanya. Dan Alla Maha Melihat keadaan hamba-hamba-Nya. Tidak ada sesuatu pun yang luput dari pengawasan-Nya. Dan Dia akan memberi mereka balasan yang setimpal."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "15. Allah memerintahkan nabi Muhammad untuk memberi kabar gembira bagi orang-orang beriman berupa surga: “Apakah mau aku kabarkan kepada kalian sesuatu yang lebih baik dari segala kenikmatan dunia ini? Bagi orang-orang yang takut kepada Allah surga-surga yang mengalir di bawah istana-istana dan pepohonannya sungai-sungai air tawar, mereka akan kekal di dalamnya, terdapat pula pasangan yang suci dari segala kekurangan laki-laki maupun perempuan -kesucian jiwa dan raga bagi kedua jenis kelamin-, dan bagi mereka keridhaan Allah yang selalu tercurah. Allah Maha Mengetahui keadaan para hamba-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15. قُلْ أَؤُنَبِّئُكُم بِخَيْرٍ مِّن ذٰلِكُمْ ۚ (Katakanlah: “Inginkah aku kabarkan kepadamu apa yang lebih baik dari yang demikian itu?”) Yakni apakah kalian ingin aku beri tahu apa yang lebih baik dari kenikmatan-kenikmatan tersebut? Kemudian Allah menjelaskannya dengan kalimat setelahnya. لِلَّذِينَ اتَّقَوْا۟ عِندَ رَبِّهِمْ (Untuk orang-orang yang bertakwa, maka pada sisi Tuhan mereka) Allah mengkhususkan orang-orang yang bertakwa karena merekalah yang mendapat manfaat dari ketakwaan itu surga-surga. جَنّٰتٌ تَجْرِى مِن تَحْتِهَا الْأَنْهٰرُ خٰلِدِينَ فِيهَا ( ada surga yang mengalir dibawahnya sungai-sungai; mereka kekal didalamnya) Yakni kekal tanpa didatangi kematian. وَأَزْوٰجٌ مُّطَهَّرَةٌ ( Dan (mereka dikaruniai) isteri-isteri yang disucikan) Yakni istri-istri yang tidak mendapatkan apa yang didapatkan oleh istri-istri di dunia seperti haidh, nifas, dan lainnya. وَرِضْوٰنٌ مِّنَ اللهِ ۗ ( serta keridhaan Allah) Dan hal ini berlaku secara terus menerus dan mereka merasa aman dari perubahan kenikmatan yang mereka rasakan karena Allah telah menurunkan keridhaan-Nya kepada mereka sehingga Dia tidak akan murka kepada mereka selama-lamanya. وَاللهُ بَصِيرٌۢ بِالْعِبَاد (Dan Allah Maha Melihat akan hamba-hamba-Nya ) Maka Allah membalas dengan sesuatu yang pantas bagi masing-masing mereka sesuai dengan keimanan dan amalannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "15. Wahai Nabi, katakanlah: “Apakah kalian ingin aku kabarkan tentang sesuatu yang lebih baik dari syahwat-syahwat itu, yaitu sesuatu yang dijanjikan Allah kepada orang-orang yang bertakwa yang taat dan menjalankan perintah Allah, serta menjauhi laranganNya, berupa surga-surga yang dibawah pepohonan dan rumah-rumahnya itu mengalir sungai-sungai. Mereka tinggal di sana selama-lamanya. Dan bagi mereka itu istri-istri yang disucikan dari kecacatan wanita di dunia seperti haid dan nifas. Keridhaan abadi dari Allah SWT (bagi mereka), tidak ada kemurkaan setelah itu. Dan Allah itu Mengawasi urusan-urusan hambaNya, tidak ada satupun yang luput dariNya, sehingga Dia akan membalas setiap perbuatan dengan sesuatu yang layak”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Katakanlah,“Maukah kalian aku beri tahu} maukah kalian aku beri kabar {sesuatu yang lebih baik daripada yang demikian itu” Untuk orang-orang yang bertakwa, di sisi Tuhan mereka ada surga-surga yang mengalir di bawahnya sungai-sungai. Mereka kekal di dalamnya dan pasangan yang disucikan serta ridha Allah. Allah Maha Melihat hamba-hambaNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "15. Kemudian Allah memberitakan tentang hal itu yaitu bahwasanya orang-orang yang bertakwa kepada Allah yang menegakkan penghambaan hanya kepadaNya, maka bagi mereka kesenangan yang lebih baik dari semua kenikmatan itu. Mereka akan mendapatkan berbagai bentuk kebaikan dan kenikmatan yang abadi yang belum pernah dilihat oleh mata, tidak pernah di dengar oleh telinga dan tidak pernah terlintas dalam benak seorang manusia pun. Dan bagi mereka keridhaan Allah yang merupakan perkara yang paling agung dari segala sesuatu, bagi mereka istri-istri yang suci dari segala kekurangan dan cacat, akhlak mereka baik, bentuk mereka sangat sempurna, karena peniadaan itu berkonsekuensi kepada hal yang bertentangan dengannya, oleh karena itu kesuciannya dari kekurangan menunjukkan kepada kesempurnaannya. “Dan Allah Maha Melihat akan hamba-hambaNya,” maka Allah memudahkan setiap orang itu kepada apa yang telah diciptakan untuknya. Orang-orang yang bahagia, Allah memudahkan mereka dalam beramal untuk negeri yang abadi tersebut dan mereka menjadikan kehidupan dunia ini dan segala hal yang ada padanya untuk membantunya dalam beribadah kepada Allah dan taat kepadaNya. Sedangkan orang-orang yang sengsara dan yang berpaling, Allah membiarkan mereka melakukan perbuatan orang-orang yang sengsara dan mereka ridha terhadap kehidupan dunia, senang padanya, serta mereka menjadikannya sebagai tempat menetap mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 15: Katakanlah: \"Maukah aku khabarkan kepada kamu lebih baik daripada yang demikian di sisi Tuhan mereka, untuk orang-orang yang berbakti? (Yaitu) surga-surga yang mengalir padanya sungai-sungai yang mereka akan kekal padanya, dan isteri-isteri yang suci,dan keridlaan dari Allah;\" dan Allah itu amat Melihat akan hamba-hamba-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Baik dari haidh, nifas dan akhlak yang buruk. Sehingga Dia akan memberikan balasan terhadap amal mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 15",
    "description": "Hal-hal yang disebut di atas adalah baik dan sesuai dengan naluri manusia, tetapi ada yang lebih baik dari itu semua. Maka katakanlah, wahai nabi Muhammad, kepada orang-orang yang terlalu mencintai dunia dan kepada siapa pun juga, maukah aku kabarkan kepadamu apa yang lebih baik dari yang demikian itu' bagi orang-orang yang bertakwa tersedia di sisi tuhan yang mendidik dan memelihara mereka surga-surga yang mengalir di bawahnya sungai-sungai, sehingga mereka tidak perlu lagi bersusah payah mengairi-Nya. Selain tempat tinggal yang nyaman itu, mereka hidup kekal di dalamnya, dan mereka juga dianugerahi pasangan-pasangan yang suci dari segala macam kekotoran jasmani dan rohani seperti haid, nifas, dan perangai buruk, serta kenikmatan rohani yang tidak ada taranya, yaitu rida Allah yang amat besar. Dan anu-gerah tersebut wajar karena Allah maha melihat hamba-hamba-Nya, mengetahui segala keadaan mereka dan memberikan balasan yang terbaiksetelah ayat sebelumnya menjelaskan bahwa Allah mengetahui siapa yang berhak memperoleh keberuntungan besar, yakni orangorang bertakwa, maka ayat ini menjelaskan ciri-cirinya. Yaitu orangorang yang berdoa, ya tuhan kami, kami benar-benar beriman terhadap apa yang engkau serukan kepada kami, maka ampunilah dosa-dosa kami atas ketidakmampuan kami untuk me-ngendalikan hawa nafsu kami, sehingga kurang menghiraukan seruan-Mu, baik yang disengaja maupun yang tidak disengaja, dan lindungilah kami, dengan segala kekurangan dan dosa-dosa kami, dari azab neraka."
  }
]