[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya mereka itu tidak akan menolong kalian,tetapi Allah-lah penolong kalian,dan Dia adalah sebaik-baik penolong,maka tidak dibutuhkan bersama Allah pertolongan dari orang lain."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "150. Orang-orang kafir itu tetap tidak akan menolong meskipun kalian patuh kepada mereka. Tetapi Allah lah yang akan menolong kalian untuk mengalahkan musuh-musuh kalilan. Maka patuhlah kalian kepada-Nya, karena Dia adalah sebaik-baik penolong, sehingga kalian tidak membutuhkan pertolongan siapapun setelah mendapatkan pertolongan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "150. بَلِ اللهُ مَوْلَىٰكُمْ ۖ (Tetapi (ikutilah Allah), Allahlah Pelindungmu) Yakni maka janganlah kalian kembali kepada orang-orang musyrik dan janganlah menjadikan mereka sebagai pelindung; akan tetapi jadilah termasuk dalam pasukan Allah untuk memerangi musuh-musuh-Nya; karena Allah adalah pelindung kalian dan bukan mereka, mereka tidak akan menolong kalian akan tetapi Allah lah yang akan menolong kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "150 Tetapi Allahlah Pengatur urusan dan penolongmu, Yang tidak butuh pertolongan siapapun. Maka janganlah berpaling kepada orang-orang musyrik dan jangan meminta tolong kepada mereka. Berpegang teguhlah kepada Allah dan Dialah sebaik-baik Penolong dan Maha Kuasa untuk mengalahkan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Namun Allahlah pelindung kalian} penolong kalian {dan Dialah sebaik-baik penolong"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "150. Kemudian Allah memberitahukan bahwasanya Dia adalah Penolong dan Pembela mereka. Di dalam ayat ini terkandung kabar buat mereka tentang hal itu dan suatu berita gembira; yaitu bahwa Allah mengatur urusan mereka dengan kelembutanNya dan melindungi mereka dari segala bentuk kejahatan. Dan termasuk dalam kategori itu adalah anjuran buat mereka, agar mereka menjadikan Allah semata sebagai Penolong dan Pembela, tanpa selainNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 150: Bahkan Allah itu Pengawal kamu, dan Ia sebaik-baik Penolong."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dalam ayat ini terdapat berita gembira bagi kaum mukmin bawa Allah-lah Pelindung mereka, Dia yang mengatur urusan mereka dengan kelembutan-Nya dan memelihara mereka dari segala keburukan. Di dalamnya juga terdapat dorongan agar mereka menjadikan Allah sebagai wali dan Penolong mereka satu-satunya. Pada ayat selanjutnya disebutkan contoh perlindungan-Nya kepada kaum mukmin, yaitu dengan menimpakan rasa takut dalam hati musuh-musuh mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 150",
    "description": "Jangan kamu ikuti saran orang-orang kafir, tetapi ikutilah aturan Allah, karena hanya Allah-lah pelindungmu, dan dia penolong yang terbaiksetelah ditegaskan bahwa Allah adalah penolong yang terbaik, di sini dijelaskan salah satu bentuk pertolongan dimaksud. Yaitu akan kami lindungi dan tolong kamu dengan masukkan rasa takut ke dalam hati orang-orang kafir, untuk menyerang kaum muslim, hal itu karena mereka mempersekutukan Allah dengan sesuatu yang Allah tidak menurunkan keterangan tentang itu. Dan tempat kembali mereka setelah meninggal dunia ialah neraka. Dan itulah seburuk-buruk tempat tinggal yang abadi bagi orang-orang zalim."
  }
]