[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kami akan masukan ke dalam hati orang-orang kafir rasa takut dan kecemasan yang sangat besar dikarenakan mereka menyekutukan Allah dengan tuhan palsu, yang mereka itu tidak mempunyai dalil atau bukti nyata akan keberhakannya untuk disembah bersama Allah. Maka keadaan mereka di dunia adalah mereka diliputi rasa takut dan hati ciut terhadap kaum Mukminin. Dan adapun tempat mereka di akhirat yang menjadi tempat tinggal mereka,yaitu neraka. Itu disebabkan oleh tindakan kezhaliman mereka dan permusuhan mereka. Dan amatlah buruk tempat ini sebagai tempat tinggal bagi mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "151. Kami akan memasukkan ketakutan yang luar biasa ke dalam hati orang-orang yang kafir kepada Allah, sehingga mereka tidak sanggup berperang melawan kalian, karena mereka telah menyekutukan Allah dengan tuhan-tuhan yang mereka sembah menurut hawa nafsu mereka sendiri, tanpa didasari hujjah yang diturunkan kepada mereka. Dan tempat tinggal yang akan menjadi tempat kembali mereka di akhirat kelak ialah neraka. Dan seburuk-buruk tempat tinggal bagi orang-orang yang zalim ialah neraka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "151. Dan salah satu bentuk pertolongan Allah bagi orang-orang beriman adalah dengan memasukkan rasa takut ke dalam hati orang-orang kafir akibat mereka menyekutukan Allah dan menyembah berhala tanpa memiliki hujjah dan alasan yang benar. Tempat kembali mereka adalah neraka, itulah seburuk-buruk tempat bagi orang-orang yang zalim."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "151. سَنُلْقِى (Akan Kami masukkan) Yakn Kami akan memenuhi hati mereka dengan rasa takut dan risau. بِمَآ أَشْرَكُوا۟ بِاللهِ مَا لَمْ يُنَزِّلْ بِهِۦ سُلْطٰنًا ۖ (disebabkan mereka mempersekutukan Allah dengan sesuatu yang Allah sendiri tidak menurunkan keterangan tentang itu) Yakni karena mereka menjadikan sesembahan-sesembahan untuk menyekutukan Allah dalam peribadatan, padahal Allah tidak pernah menurunkan seorangpun untuk menjadi sekutu-Nya sebagai hujjah, penjelas, dan bukti. وَمَأْوَىٰهُمُ النَّارُ ۚ وَبِئْسَ مَثْوَى الظّٰلِمِينَ (Tempat kembali mereka ialah neraka) Maka bagaimana kalian akan menjadikan mereka pelindung kalian; jika kalian menjadikan mereka sebagai pelindung maka kalian akan bersama mereka di neraka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Orang musyrik yang takut kepada makhluq dan selalu berharap dari mereka hanya akan merasakan ketakutan dan kegelisahan, sedangkan orang yang senantiasa ikhlas beribadah kepada Allah dan terbebas dari kesyirikan selalu merasakan ketenangan dan keamanan, Allah berfirman : { الَّذِينَ آمَنُوا وَلَمْ يَلْبِسُوا إِيمَانَهُمْ بِظُلْمٍ أُولَٰئِكَ لَهُمُ الْأَمْنُ وَهُمْ مُهْتَدُونَ } \"Orang-orang yang beriman dan tidak mencampuradukkan iman mereka dengan kezaliman (syirik), mereka itulah yang mendapat keamanan dan mereka itu adalah orang-orang yang mendapat petunjuk\" [al-an'am : 82]."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "151 Akan Kami penuhi hati orang-orang kafir itu dengan rasa takut, sekalipun mereka menang, disebabkan mereka mempersekutukan Allah dengan sesuatu yang Allah sendiri tidak menurunkan keterangan tentang itu. Kami akan menempatkan mereka di akhirat dalam neraka Jahannam; dan itulah seburuk-buruk tempat tinggal orang-orang yang kafir. Ayat ini turun ketika orang-orang musyrik pimpinan Abu Sufyan telah berniat untuk menyerang orang muslim setelah perang Uhud. Ketika itu Allah memasukkan ketakutan dalam hati mereka, sehingga mereka berpaling dari niatan mereka. Maka Allah menurunkan ayat ini."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami akan memasukkan} memasukkan {ke dalam hati orang-orang yang kafir rasa takut} rasa takut yang berlebihan {karena mereka mempersekutukan Allah dengan sesuatu yang Allah tidak menurunkan keterangan tentangnya} bukti dan keterangan {Tempat kembali mereka} tempat istirahat mereka, dan tempat terakhir mereka {adalah neraka. Seburuk-buruk tempat tinggal (bagi) orang-orang zalim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "151. Di antara pertolongan dan pembelaanNya bagi mereka adalah bahwa Dia berjanji untuk meletakkan ketakutan pada hati orang-orang kafir, yaitu kekhawatiran yang kuat yang menghalangi mereka dari sebagian besar tujuan mereka, dan sungguh Allah telah melakukannya, yang demikian itu karena kaum musyrikin ketika berpaling dari peperangan Uhud mereka bermusyawarah, mereka berkata, “Bagaimana bisa kita pulang setelah kita membunuh orang-orang yang telah kita bunuh dari kalangan mereka dan telah kita kalahkan mereka, padahal kita belum memberantas mereka?” lalu mereka hendak melakukan itu, namun Allah menjatuhkan ketakutan pada hati mereka hingga mereka berpaling pulang dengan sia-sia. Tidak diragukan bahwa hal ini merupakan pertolongan yang paling besar, karena sebagaimana yang telah dijelaskan bahwa pertolongan Allah kepada hamba-hambaNya yang beriman itu tidaklah akan keluar dari dua kemungkinan; pertama, membasmi sekelompok dari kaum kafir. Kedua, mendesak mereka hingga mereka pulang dengan sia-sia. Kisah ini termasuk kategori kedua. kemudian Allah menyebutkan sebab-sebab yang mengakibatkan Allah me njatuhkan ketakutan itu pada hati orang-orang kafir seraya berfirman, “Disebabkan mereka mempersekutukan Allah dengan sesuatu yang Allah sendiri tidak menurunkan keterangan tentang itu.” Maksudnya, hal tersebut disebabkan karena tindakan mereka mengambil sekutu selainNya berupa tandingan-tandingan dan patung-patung yang telah mereka sembah menurut hawa nafsu dan keinginan mereka yang batil, tanpa ada alasan dan keterangan sedikit pun. Maka terputuslah mereka dari pertolongan Allah Yang Maha Esa lagi Maha Penyayang. Itulah sebabnya orang musyrik takut dari (bahaya) kaum Mukminin yang mana orang musyrik itu tidak bersandar pada sebuah pegangan yang kokoh, dan tidak pula memiliki sandaran pada setiap kesulitan dan kesempitan. Ini adalah kondisinya di dunia, sedangkan di akhirat kondisinya akan lebih dahsyat dan lebih besar lagi. Karena itu, Allah berfirman, “Tempat kembali mereka adalah neraka”, yaitu tempat menetap mereka yang menjadi tempat kembali mereka, di mana mereka tidak akan keluar darinya, “dan itulah seburuk-buruk tempat tinggal orang-orang yang zhalim,” dikarenakan kezhaliman dan permusuhan mereka, sehingga neraka menjadi tempat kembali mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 151: Kami akan letakkan ketakutan di hati mereka yang kufur, lantaran mereka sekutukan dengan Allah sesuatu yang Ia tidak turunkan keterangan untuknya; 50) dan tempat kembali mereka ialah api (neraka); dan ia itu sejahat-jahat tempat kembali bagi orang-orang yang zhalim."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Oleh karena itu, sepulangnya mereka dari perang Uhud dan berkeinginan untuk kembali menghabiskan kaum muslimin, maka mereka tidak jadi karena takut."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 151",
    "description": "Setelah ditegaskan bahwa Allah adalah penolong yang terbaik, di sini dijelaskan salah satu bentuk pertolongan dimaksud. Yaitu akan kami lindungi dan tolong kamu dengan masukkan rasa takut ke dalam hati orang-orang kafir, untuk menyerang kaum muslim, hal itu karena mereka mempersekutukan Allah dengan sesuatu yang Allah tidak menurunkan keterangan tentang itu. Dan tempat kembali mereka setelah meninggal dunia ialah neraka. Dan itulah seburuk-buruk tempat tinggal yang abadi bagi orang-orang zalim. Setelah rasulullah dan para sahabat kembali dari perang uhud, timbul pertanyaan antara mereka mengenai sebab kegagalan dalam perang uhud, padahal Allah sudah menjanjikan kemenangan. Dan sungguh, Allah telah memenuhi janji-Nya kepadamu sebagaimana yang terjadi pada saat awal perang uhud, yaitu ketika kamu membunuh pemegang panji mereka, orang kafir dan tujuh orang lainnya dengan izin-Nya, sampai pada saat kamu lemah, dan takut karena ada sebagian pasukan yang lari dari medan perang, sehingga mendahulukan meraih harta rampasan perang atas ketaatan kepada rasulullah Muhammad dan berselisih dalam urusan berebut harta rampasan perang itu dan mengabaikan perintah rasul agar regu pemanah tetap bertahan pada tempat yang telah ditetapkan, walau dalam situasi bagaimanapun. Peristiwa tersebut terjadi setelah Allah memperlihatkan kepadamu apa yang kamu sukai, yaitu kemenangan dan harta rampasan perang. Di antara kamu ada orang yang menghendaki dunia berupa harta rampasan perang dan di antara kamu ada pula orang yang menghendaki akhirat dengan menaati perintah rasulullah, seperti komandan pasukan pemanah, yaitu abdullah bin jubair. Kemudian Allah memalingkan kamu dari mereka dengan menggagalkan kemenangan yang sudah hampir diraih untuk mengujimu siapa yang kuat imannya dan siapa yang lemah. Tetapi ketahuilah dia benar-benar telah memaafkan kesalahan kamu dalam perang uhud. Dan Allah mempunyai karunia yang banyak yang diberikan kepada orang-orang mukmin yang beriman dengan sebenar-benarnya."
  }
]