[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sungguh Allah telah membuktikan bagi kalian apa yang telah Dia janjikan bagi kalian berupa kemenangan,ketika kalian berhasil membunuh orang-orang kafir di Perang Uhud dengan izin Allah ta’ala,sampai akhirnya kalian menjadi pengecut dan semangat mengendur untuk mengarungi laga peperangan dan kalian berselisih pandangan, apakah bertahan pada posisi-posisi kalian atau meninggalkannya untuk ikut mengumpulkan harta rampasan perang bersama dengan orang-orang yang mengumpulkannya? Dan kalian melanggar perintah Rosul kalian tatkala memerintahkan kalian untuk tidak meninggalkan tempat-tempat kalian dalam keadaan apapun, maka menimpalah kepada kalian kekalahan setelah sebelumnya Allah memperlihatkan kepada kalian apa yang kalian senangi,yaitu kemenangan. Dan menjadi jelas bahwa di antara kalian sesungguhnya ada orang yang menginginkan harta rampasan dan sesungguhnya ada juga yang menghendaki akhirat dan pahala nya. Kemudian Allah memalingkan wajah-wajah kalian dari musuh kalian untuk menguji kalian. Dan sesungghnya Allah mengetahui penyesalan dan taubat kalian,lalu Dia memaafkan kalian. Dan Allah itu mempunyai karunia besar bagi kaum Mukminin."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "152. Dan sungguh Allah benar-benar menepati apa yang dijanjikan-Nya kepada kalian, yaitu menolong kalian untuk mengalahkan musuh dalam perang Uhud ketika kalian berperang melawan mereka dengan peperangan yang sengit dengan izin Allah -Ta'ālā-. Sampai ketika kalian lemah dan tidak mau memegang teguh apa yang Rasul perintahkan kepada kalian, dan kalian berselisih paham antara tetap bertahan di posisi kalian masing-masing ataukah meninggalkan posisi itu dan bergerak untuk mengumpulkan ganimah. Dan kalian telah durhaka kepada Rasul yang memerintahkan kalian bertahan di posisi masing-masing dalam kondisi apapun. Hal itu terjadi setelah Allah memperlihatkan kepada kalian kemenangan atas musuh-musuh kalian. Sebagian dari kalian menginginkan harta rampasan perang dunia, yaitu orang-orang yang meninggalkan posisi mereka. Dan sebagian dari kalian menginginkan ganjaran akhirat, yaitu orang-orang yang bertahan di posisinya masing-masing karena mematuhi perintah Rasul. Kemudian Allah memalingkan kalian dari mereka dan membuat mereka mampu mengalahkan kalian untuk menguji kalian. Maka jelaslah siapa yang benar-benar beriman dan bersabar terhadap cobaan dan siapa yang tergelincir kakinya dan lemah jiwanya. Dan Allah telah mengampuni perbuatan kalian yang telah melanggar perintah Rasul-Nya. Dan Allah memiliki anugerah yang sangat besar bagi orang-orang yang beriman, karena Dia telah membimbing mereka kepada iman. Dia juga telah memaafkan kesalahan mereka dan memberi ganjaran atas musibah yang menimpa mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "152. Hai orang-orang beriman, sungguh Allah telah memenuhi janji-Nya kepada kalian, berupa kemenangan atas musuh kalian saat kalian mulai memerangi kalian di perang Urud dengan kehendak Allah. Sampai saat segolongan kalian merasa takut dan melanggar perintah Allah dan menyelisihi Rasulullah dengan meninggalkan bukit Rumaah setelah Aku menampakkan kemenangan yang kalian inginkan atas orang-orang musyrik. Sebab perselisihannya adalah sebagian kalian meninginkan harta ghanimah, sedangkan sebagian yang lain menginginkan surga; maka Allah menjadikan kalian kalah menghadapi orang-orang kafir setelah kalian hampir menang sebagai ujian bagi kalian. Allah telah mengampuni kalian setelah kalian menyesali apa yang telah kalian perbuat. Allah memiliki karunia bagi kalian berupa ampunan dan pelajaran."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "152. وَلَقَدْ صَدَقَكُمُ اللهُ وَعْدَهُۥٓ (Dan sesungguhnya Allah telah memenuhi janji-Nya kepada kamu) Ayat ini turun ketika sebagian kaum muslimin berkata: “bagaimana ini bisa terjadi? Padahal Allah telah menjanjikan kepada kita kemenangan”. Hal ini mereka katakan karena pada mulanya kaum muslimin meraih kemenangan atas orang-orang musyrik di perang Uhud, bahkan mereka berhasil membunuh pemegang bendera sebagai pemimpin pasukan mereka dan Sembilan orang penggantinya. Namun ketika kaum muslimin sibuk dengan harta rampasan perang, dan pasukan pemanah meninggalkan tempat mereka untuk mengumpulkan harta rampasan, mereka akhirnya menjadi sebab kekalahan kaum muslimin. إِذْ تَحُسُّونَهُم (ketika kamu membunuh mereka) Yakni saat kalian membunuh dan menghabisi mereka. حَتَّىٰٓ إِذَا فَشِلْتُمْ وَتَنٰزَعْتُمْ (sampai pada saat kamu lemah dan berselisih dalam urusan itu) Yakni perselisihan yang terjadi diantara pasukan pemanah; sebagian mereka berkata: mari kita menyusul yang lain untuk mengumpulkan rampasan perang, dan sebagian lainnya mengatakan: tidak, kita harus tetap di tempat kita ini. مِّنۢ بَعْدِ مَآ أَرَىٰكُم مَّا تُحِبُّونَ ۚ (sesudah Allah memperlihatkan kepadamu apa yang kamu sukai) Yakni setelah kemenangan yang terjadi di awal perang Uhud. مِنكُم مَّن يُرِيدُ الدُّنْيَا (Di antaramu ada orang yang menghendaki dunia) Yakni harta rampasan perang. وَمِنكُم مَّن يُرِيدُ الْاٰخِرَةَ ۚ (dan diantara kamu ada orang yang menghendaki akhirat) Yakni berupa pahala dengan tetap teguh di tempat mereka sebagai bentuk ketaatan pada perintah Rasulullah. ثُمَّ صَرَفَكُمْ عَنْهُمْ لِيَبْتَلِيَكُمْ ۖ (Kemudian Allah memalingkan kamu dari mereka untuk menguji kamu) Yakni Allah membalikkan keadaan kalian atas mereka dengan kekalahan setelah kalian unggul atas mereka sebagai cobaan bagi kalian. وَلَقَدْ عَفَا عَنكُمْ ۗ (dan sesunguhnya Allah telah memaafkan kamu) Yakni setelah penyesalan kalian, sehingga Allah tidak membinasakan kalian setelah berbuat kemaksiatan. Dan kemaksiatan tersebut adalah bahwa Rasulullah telah menempatkan pasukan pemanah pada suatu tempat untuk melindungi sisi belakang pasukan muslimin lainnya. Beliau berkata kepada mereka: “jika kalian melihat kami terbunuh maka jangan kalian tolong kami, dan jika kalian melihat kami menang dan mengambil rampasan perang maka jangan kalian ikuti kami”. Akan tetapi mereka meninggalkan tempat mereka ketika melihat kaum musyrikin telah terkalahkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "152 Dan sesungguhnya Allah telah memenuhi janji-Nya kepada kamu dengan memberi pertolongan pada perang Uhud, ketika kamu membunuh dan melawan mereka dengan kemudahan dan izin-Nya sampai pada saat kamu lemah dalam berperang dan para pemanah berselisih di atas gunung untuk tetap dalam tempat kalian. Mereka memilih mengambil ghanimah dan mendurhakai perintah Rasul sesudah Allah memperlihatkan kepadamu apa yang kamu sukai berupa pertolongan untuk mengalahkan orang-orang musyrik. Sebab perselisihan mereka adalah sebagian dari kalian menghendaki ghanimah, dan diantara kamu ada orang yang menghendaki akhirat dengan tetap teguh dalam pos kalian. Kemudian Allah memalingkan kamu dari mereka untuk menguji kamu setelah kalian mengalahkan mereka, serta untuk menguji iman kalian atau untuk ujian bagi orang-orang yang diuji, agar tamoak siapa yang munafik dan siapa yang jujur. Sesunguhnya Allah telah memaafkan kamu setelah kalian menyesal telah membangkang perintah Nabi. Dan Allah mempunyai karunia yang dilimpahkan atas orang orang yang beriman dengan mengampuni mereka dan tidak adanya penyerangan kepada mereka. Ayat ini turun ketika sebagian muslim pada waktu perang Uhud berkata: Bagaimana bisa kami kalah, padahal Allah telah menjanjikan pertolongan-Nya? Maka Allah menurunkan ayat ini. Ini terjadi karena mereka mendapat pertolongan pada awal perang, kemudian mereka berpaling dan lebih fokus pada ghanimah, dan meninggalkan tugas memanah pada pos mereka di atas gunung hanya untuk mengambil ghanimah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh Allah benar-benar telah memenuhi} menepati {janjiNya kepada kalian ketika kalian membunuh mereka} membunuh mereka dengan sangat banyak {dengan izinNya} sesuai ketetapanNya {sampai pada saat kalian gagal} menjadi takut dan lemah untuk berperang {berselisih} berselisih {dalam urusan itu dan melakukan maksiat} mengingkari perintah Rasulullah SAW {setelah Allah memperlihatkan kepada kalian apa yang kalian sukai. Di antara kalian ada orang yang menghendaki dunia dan di antara kamu ada (pula) orang yang menghendaki akhirat. Kemudian, Allah memalingkan kalian dari mereka} memalingkan kalian dari orang-orang musyrik dengan kekalahan {untuk menguji kalian} menguji kalian.{ Sungguh Dia benar-benar telah memaafkan kalian. Allah mempunyai karunia kepada orang-orang mukmin"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "152. Maksudnya, “Dan sungguh Allah telah memenuhi janjiNya kepadamu” dengan pertolongan lalu Allah menolong kalian atas ancaman mereka hingga membuat kalian dapat menguasai mereka dan mampu membunuh mereka, tapi akhirnya kalian menjadi penyebab kehancuran bagi diri kalian sendiri dan penolong bagi musuh kalian atas keburukan diri kalian, dan ketika kalian menderita kegagalan, yaitu kelemahan dan lesu, “dan berselisih dalam urusan itu”, yang di dalam perkara tersebut terdapat suatu tindakan meninggalkan perintah Allah untuk bersatu dan tidak berselisih; namun kalian berselisih. Ada yang berkata agar kita tetap pada posisi kita yang telah ditetapkan oleh Nabi untuk kita, ada juga yang berkata kita tidak perlu tetap di sana, karena musuh telah kalah dan tidak ada lagi yang dikhawatirkan, maka kalian bermaksiat kepada Rasul dengan meninggalkan perintahnya setelah Allah memperlihatkan kepada kalian sesuatu yang kalian sukai, yaitu terhinanya musuh kalian. Karena kewajiban atas orang yang telah diberikan nikmat oleh Allah dengan sesuatu yang dicintainya adalah lebih besar daripada selainnya. Maka yang wajib dalam kondisi seperti ini secara khusus, dan pada kondisi lainnya secara umum adalah melaksanakan perintah Allah dan RasulNya. “Di antara kalian ada orang menghendaki dunia,” mereka itu adalah orang-orang yang dipalingkanoleh harta rampasan dari posisi yang di wajibkan atas mereka,”dan di antar kalian ada yang menghendaki akhirat,”mereka itu adalah orang yang tetap melaksanakan perintah Rasululoh dan tergar menurut apa yang di perintahkan kepada mereka.”Kemudian Allah memalingkan kalian dari mereka”, maksudnya setelah terjadi perkara tersebut dari kalian,maka Allah memalingkan wajah kalian dari mereka ,hingga keunggulan menjadi milik musuh kalian sebgai ujian dan cobaan dari Allah bagi kalian,agar jelas orang-orang Mukmin dari orang kafir,orang yang taat dari orang yang durhaka,dan gara Allah mengugurkan kalian dengan musibah ini dosa yang telah kalian perbuat. Karena itu Allah berfirman, “dan sungguh Allah telah memaafkan kalian.dan Allah mempunyai karunia yang dilimpahkan atas orang-orang yang beriman,” Maksudnya dia memiliki karunia yang besar terhadap mereka,dimana Allah telah memberikan karuniaNya atas mereka dengan islam,menujukan kapada mereka syariatNya,mengampuni keburukan-keburukan mereka,dan memberikan ganjaran atas musibah-musibah mereka. Dan diantara karuniaNya kepada kaum Mukminin adalah tidaklah Allah menetapkan untuk mereka suatu kebaikanmaupun musibah melainkan pasti hal itu kabaikan untuk mereka.Apabila mereka tertimpa hal yang menyenangkanlalu mereka mensyukuriNya,niscaya Allah akan membalasnya balasan orang-orang yang bersyukur,dan apabila mereka tertimpa hal yang menyakitkan lalu mereka bersabar,niscaya Allah membalasnya dengan balasan orang-orang yang bersabar."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 152: Dan sesungguhnya Allah telah tunaikan perjanjian-Nya kepada kamu ketika kamu bunuh mereka sungguh-sungguh dengan izin Allah; hingga apabila kamu jadi lemah dan kamu berbantahan di dalam urusan itu dan kamu tidak taat sesudah Ia unjukkan kepada kamu apa yang kamu sukai, (yaitu) sebagian daripada kamu mau kepada dunia dan sebagian daripada kamu maukan Akhirat, (maka Allah murka atas kamu) kemudian la palingkan kamu daripada (mengalahkan)mereka, untuk memberi percobaan kepada kamu, tetapi sesungguhnya ia telah ampunkan kamu karena Allah itu mempunyai budi atas Mu'minin."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Takut untuk berperang. Yakni urusan pelaksanaan perintah Nabi Muhammad shallallahu 'alaihi wa sallam agar regu pemanah tetap bertahan pada tempat yang telah ditunjukkan oleh beliau dalam keadaan bagaimanapun. Agar tetap berada di tempat yang ditetapkan Rasulullah shallallahu 'alaihi wa sallam. Yaitu kemenangan dan harta rampasan. Meninggalkan posisinya dan lebih mengutamakan ghanimah. Tetap di tempat, seperti Abdullah bin Jubair dan kawan-kawannya. Kaum muslimin tidak berhasil mengalahkan mereka. Yaitu dengan memberikan nikmat beragama Islam kepada mereka, menunjukkan mereka kepada syari'at-Nya, memaafkan kesalahan mereka dan memberi pahala terhadap musibah yang menimpa mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 152",
    "description": "Setelah rasulullah dan para sahabat kembali dari perang uhud, timbul pertanyaan antara mereka mengenai sebab kegagalan dalam perang uhud, padahal Allah sudah menjanjikan kemenangan. Dan sungguh, Allah telah memenuhi janji-Nya kepadamu sebagaimana yang terjadi pada saat awal perang uhud, yaitu ketika kamu membunuh pemegang panji mereka, orang kafir dan tujuh orang lainnya dengan izin-Nya, sampai pada saat kamu lemah, dan takut karena ada sebagian pasukan yang lari dari medan perang, sehingga mendahulukan meraih harta rampasan perang atas ketaatan kepada rasulullah Muhammad dan berselisih dalam urusan berebut harta rampasan perang itu dan mengabaikan perintah rasul agar regu pemanah tetap bertahan pada tempat yang telah ditetapkan, walau dalam situasi bagaimanapun. Peristiwa tersebut terjadi setelah Allah memperlihatkan kepadamu apa yang kamu sukai, yaitu kemenangan dan harta rampasan perang. Di antara kamu ada orang yang menghendaki dunia berupa harta rampasan perang dan di antara kamu ada pula orang yang menghendaki akhirat dengan menaati perintah rasulullah, seperti komandan pasukan pemanah, yaitu abdullah bin jubair. Kemudian Allah memalingkan kamu dari mereka dengan menggagalkan kemenangan yang sudah hampir diraih untuk mengujimu siapa yang kuat imannya dan siapa yang lemah. Tetapi ketahuilah dia benar-benar telah memaafkan kesalahan kamu dalam perang uhud. Dan Allah mempunyai karunia yang banyak yang diberikan kepada orang-orang mukmin yang beriman dengan sebenar-benarnya setelah dijelaskan bahwa Allah memaafkan kesalahan mereka dalam perang uhud, lalu disebutkan kesalahan yang dimaksud. Ingatlah ketika sebagian kamu lari meninggalkan pertempuran dan tidak menoleh kepada siapa pun akibat rasa takut yang berlebihan, sedang rasul yang berada di antara kawan-kawan-Mu yang lain bertahan di medan perang memanggil kamu, karena itu Allah menimpakan kepadamu kesedihan demi kesedihan, yaitu kabar wafatnya rasulullah, luka kamu, gugurnya sahabat-sahabat kamu, dan kegagalan meraih kemenangan dalam perang, agar kamu tidak bersedih hati lagi terhadap apa yang luput dari kamu, yaitu kemenangan dan harta rampasan perang, dan terhadap apa yang menimpamu, yakni luka kamu dan gugurnya sahabat-sahabat kamu. Dan Allah mahateliti atas apa yang kamu kerjakan."
  }
]