[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ingatlah oleh kalian (wahai sahabt-sahabat Muhammad sholallohu alaihi wasallam) tentang keadaan kalian ketika kalian mulai mendaki gunung untuk melarikan diri dari musuh-musuh kalian,dan kalian tidak menoleh kepada seorang pun lantaran dahsyatnya suasana,rasa takut dan gentar yang meliputi kalian,sedang Rosululloh tetap bertahan di tengah medan laga,memanggil-manggil kalian dari belakang kalian dengan meneriakkan, “Kembalilah kepadaku wahai hamba-hamba Allah,” sedang kalian tidak mau mendengar dan tidak melihat. Maka balasan bagi kalian adalah Allah menimpakan pada kalian duka-lara,kegetiran dan kesedihan, supaya kalian tidak bersedih hati terhadap kemenangan dan harta rampasan yang luput dari kalian,dan tidak juga terhadap apa yang menimpa kalian berupa ketakutan dan kekalahan. Dan Allah Maha Mengetahui seluruh amal perbuatan kalian,tidak ada satupun dari itu yang tersembunyi bagiNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "153. Ingatlah -wahai orang-orang beriman- ketika kalian melarikan diri dalam perang Uhud, tatkala kalian mengalami kegagalan karena telah melanggar perintah Rasulullah, dan sebagian dari kalian tidak melihat sebagian yang lain, sementara Rasulullah memanggil kalian dari belakang, di antara kalian dan orang-orang musyrik seraya bersabda, “Kemarilah wahai hamba-hamba Allah! Kemarilah wahai hamba-hamba Allah!” Kemudian Allah membalas perbuatan kalian itu dengan kepedihan dan kesulitan karena hilangnya kesempatan untuk mendapatkan kemenangan dan rampasan perang; yang diikuti dengan kepediahan dan kesulitan lainnya karena beredarnya kabar tentang terbunuhnya Nabi. Allah melakukan hal ini supaya kalian tidak bersedih hati karena kehilangan kesempatan untuk mendapatkan kemenangan dan rampasan perang, dan tidak berduka karena terbunuh dan mengalami luka-luka, setelah kalian tahu bahwa Nabi tidak terbunuh. Karena semua musibah dan penderitaan terasa ringan (setelah tahu bahwa Nabi masih hidup). Dan Allah Maha Mengetahui apa yang kalian perbuat. Tidak ada sesuatupun yang luput dari pengetahuan-Nya perihal kondisi hati dan perbuatan anggota badan kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "153. Ingatlah ketika kalian menaiki bukit tanpa menoleh kepada siapapun, sedangkan Rasulullah memanggil kalian dari belakang agar kalian kembali ke posisi masing-masing, namun kalian tidak menghiraukannya; maka Allah menghukum kalian dengan korban luka dan terbunuh pada perang itu, dan dengan berita bahwa Rasulullah juga terbunuh. Hal ini agar kalian tidak bersedih atas kemenangan dan harta ghanimah yang lenyap dari kalian, dan atas korban luka dan terbunuh. Allah Maha Mengetahui segala amalan kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "153. إِذْ تُصْعِدُونَ ((Ingatlah) ketika kamu lari) Yakni ketika kalian lari kearah depan sedang kalian dicegah untuk tidak kabur dari peperangan dan berjalan menjauh. وَلَا تَلْوُۥنَ (dan tidak menoleh) Yakni sebagian kalian tidak menoleh ke sebagian yang lain agar bisa berlari kabur. عَلَىٰٓ أَحَدٍ (kepada seseorangpun) Yakni kepada seseorang diantara kalian. Dan pendapat lain mengatakan kepada Rasulullah وَالرَّسُولُ يَدْعُوكُمْ فِىٓ أُخْرَىٰكُمْ (sedang Rasul yang berada di antara kawan-kawanmu yang lain memanggil kamu) Yakni berada di kelompok bagian belakang. Dan panggilan Rasulullah ketika itu adalah: Wahai hamba-hamba Allah, kembalilah! فَأَثٰبَكُمْ (karena itu Allah menimpakan atas kamu) Yakni Allah kemudian menimpakan atas kalian kedukaan ketika Allah membalikkan keadaan kalian karena kedukaan Rasulullah yang disebabkan kemaksiatan kalian. لِّكَيْلَا تَحْزَنُوا۟ عَلَىٰ مَا فَاتَكُمْ (supaya kamu jangan bersedih hati terhadap apa yang luput dari pada kamu) Yakni berupa harta rampasan perang. وَلَا مَآ أَصٰبَكُمْ ۗ (dan terhadap apa yang menimpa kamu) Yakni berupa kekalahan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "153 Ingatlah ketika kamu lari ke arah wadi meninggalkan peperangan dan tidak menoleh kepada seseorangpun diantara kalian dengan rasa takut, sedang Rasul yang berada di antara kawan-kawanmu yang lain memanggil kamu: Kemarilah wahai hamba Allah. Mereka memanggil kalian agar kalian kembali, namun kalian tidak menjawabnya. Karena itu Allah menimpakan atas kamu kesedihan atas kesedihan, supaya kamu jangan bersedih hati terhadap apa yang luput dari pada kamu dan terhadap apa yang menimpa kamu. Sebab kalian telah membangkang kepada perintah Nabi dan sebab maksiat kalian. Agar kalian tidak bersedih atas pelajaran kehilangan pertolongan dan ghanimah, dan bukan karena kekalahan, luka, pembunuhan dan berpaling. Allah Maha Mengetahui apa yang kamu kerjakan dan Maha memberi balasan yang sesuai."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika kalian lari} kalian menjauhi bumi dengan berlari {dan tidak menoleh kepada siapa pun} dan tidak menoleh kepada siapa pun {sedangkan Rasul memanggil kalian dari belakang kalian} di barisan belakang kalian seraya bersabda,”kesinilah wahai hamba-hamba Allah, kesinilah wahai hamba-hamba Allah” {Lalu Allah menimpakan kepada kalian kesedihan demi kesedihan} lalu Allah memberi balasan kepada kalian dengan kesedihan dalam peperangan dan luka, lalu kesedihan ketika menyebar kabar bahwa nabi Muhammad SAW terbunuh {agar kalian tidak bersedih hati terhadap apa yang luput dari kalian dan terhadap apa yang menimpa kalian. Allah Maha Mengetahui terhadap apa yang kalian kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "153. Allah mengingatkan kondisi mereka saat kalah perang,dan Allah mencela mereka tersebut dengan berfirman, “ingatlah ketika kamu lari”,yaitu kabur dari perang,”dan tidak menoleh kapada seorang pun,” maksudnya, tak soerang pun dari kalian menoleh kapada yang laindan tidak melihatnya,bahkan kalian tidak memiliki kinginan keciali lari dan selamat dari peperangan padahal tidak ada bahaya besar atas kaliankarena kalian itu bukanlah manusia yang terakhiryang menghadapi musuh dan merasakan kedasyatan perang,akan tetapi,”Rasul yang ada di antara kawan-kawanmu yang lain memanggilmu,”maksudnya beliaulah yang berada di belakang kalian seraya berkata,”Datanglah kepada wahai hamba-hamba Allah,” namun kalian tidak menoleh kepadanya dan tidak pula kalian berpaling kapadanya. Padahal melarikan diri dari perang itu adalah tindakan yang patut di cela,dan mengabaikan seruan Rasul yang wajib di dahulukan atas keselamatan jiwa sendiri adalah lebih besar celaanya. “Karena itu Allah menimpakan atas kamu,” maksudnya, Allah membalas perbuatan kalian dengan, ”kesedihan di atas kesedihan,” maksudnya, kesedihan yang di ikuti dengan kesedihan lain, kesedihan dengan lenyapnya kemenangan dan ghanimah, dan kesedihan atas kekalahan kalian, serta kesedihan yang mebuat kalian patah semangat saat kalian mendengar bahwa Muhammad telah terbunuh. Akan tetapi Allah dengan kasih sayangNya dan bagusnya pandangaNya bagi hamba-hambaNya, menjadikan terkumpulkan perkara-perkara tersebut bagi hamba-hambaNya yang beriman sebagai suatu kebaikan bagi mereka. Allah berfirman, ”supaya kamu tidak bersedih hati terhadap apa yang luput darimu,” berupa kemenangan dan keberhasilan,” dan terhadap apa yang menimpamu”, berupa kekalahan, kematian dan menderita luka; ketika terbukti kepada kalian bahwa Rasul itu tidak terbunuh maka terasa kecilah bagi kalian musibah-musibah tersebut. Kalian berbahagia dengan keadaanya yang menjadi segala penghibur dari segala ujian dan cobaan, dan hanya Allah saja yang mengetahui segala rahasia dan hikmah yang terkandung dalam ujian dan cobaanya saja. Semua itu bersumber dari ilmu pengetahuannya terhadap perbuatan-perbuatan, penampilan-penampilan lahir maupun batin kalian. karena itu Allah berfirman, “Dan Allah Maha Mengetahui apa yang kamu kerjakan. Dan mengandung kemungkinan bahwa firmanya, ”supaya kamu jangan bersedih hati apa yang luput darimu dan terhadap apa yang menimpamu,” bahwasanya Allah telah menetapkan musibah tersebut atas kalian agar jiwa kalian tegar dan terlatih di atas kesabaran terhadap segala musibah yang menjadi rintangan bagi kalian untuk mengahadapi segala bentuk kesulitan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 153: (Ingatlah) waktu kamu lari dan kamu tidak berpaling kepadasiapa pun, padahal Rasul itu memanggil kamu dari belakang kamu, lalu Ia kenakan kepada kamu satu kesusahan hati dengan sebab satu keresahan hati, supaya kamu tidak berdukacita atas (keuntungan) yang telah luput dari kamu dan tidak (pula atas bahaya) yang telah mengenai kamu; dan Allah itu amat mengetahui apa-apa yang kamu kerjakan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Rasulullah shallallahu 'alaihi wa sallam bersama beberapa orang sahabat berada dekat dengan musuh dan memanggil para sahabat yang lari, \"Kemarilah wahai hamba-hamba Allah!\". Kesedihan kaum muslimin disebabkan mereka tidak menaati perintah Rasul yang mengakibatkan kekalahan bagi mereka. Kesedihan tersebut adalah tidak memperoleh kemenangan, tidak memperoleh ghanimah, mengalami kekalahan dan kesedihan mendengar suara bahwa Nabi Muhammad shallallahu 'alaihi wa sallam mati terbunuh, padahal tidak. Allah menjadikan semua itu baik bagi mereka. Firman-Nya \" agar kamu tidak bersedih hati lagi terhadap apa yang luput dari kamu dan terhadap apa yang menimpamu\" bisa juga maksudnya agar kalian terlatih untuk bersabar dan segala beban dan kesulitan menjadi ringan. Seperti harta rampasan perang. Seperti terbunuh dan mengalami kekalahan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 153",
    "description": "Setelah dijelaskan bahwa Allah memaafkan kesalahan mereka dalam perang uhud, lalu disebutkan kesalahan yang dimaksud. Ingatlah ketika sebagian kamu lari meninggalkan pertempuran dan tidak menoleh kepada siapa pun akibat rasa takut yang berlebihan, sedang rasul yang berada di antara kawan-kawan-Mu yang lain bertahan di medan perang memanggil kamu, karena itu Allah menimpakan kepadamu kesedihan demi kesedihan, yaitu kabar wafatnya rasulullah, luka kamu, gugurnya sahabat-sahabat kamu, dan kegagalan meraih kemenangan dalam perang, agar kamu tidak bersedih hati lagi terhadap apa yang luput dari kamu, yaitu kemenangan dan harta rampasan perang, dan terhadap apa yang menimpamu, yakni luka kamu dan gugurnya sahabat-sahabat kamu. Dan Allah mahateliti atas apa yang kamu kerjakan. Usai menjelaskan ampunan Allah atas kesalahan pasukan pemanah yang meninggalkan posisinya pada perang uhud, Allah lalu beralih menjelaskan pertolongan-Nya kepada pasukan muslim berupa kantuk walau dalam suasana duka. Kemudian setelah kamu ditimpa kesedihan, dia menurunkan rasa aman kepadamu berupa kantuk yang bisa menghilangkan kepenatan yang meliputi segolongan dari kamu yang kuat imannya, sedangkan segolongan lagi, yang imannya tidak kuat, telah dicemaskan oleh diri mereka sendiri; mereka menyangka yang tidak benar terhadap Allah seperti sangkaan jahiliah, bahwa kalau nabi Muhammad itu benar-benar nabi dan rasul Allah, tentu dia tidak akan kalah dalam peperangan. Mereka berkata, adakah sesuatu yang dapat kita perbuat, yakni campur tangan kita, dalam urusan ini' mereka berkata demikian karena ingin lepas tanggung jawab dari kegagalan dalam perang uhud. Katakanlah wahai nabi Muhammad, sesungguhnya segala urusan itu di tangan Allah. Dia yang menetapkan kemenangan atau kekalahan berdasarkan hukum kemasyarakatan yang berlaku."
  }
]