[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian dengan rahmat Allah kepada kaum Mukminin yang ikhlas,Allah meleparkan ke dalam hati mereka setelah kecemasan dan kesedihan menimpa mereka berupa ketenangan dan kepercayaan terhadap janji Allah. dan di antara pengaruhnya,rasa kantuk memenuhi sebagian golongan dari mereka,yaitu orang-orang yang ikhlas dan diliputi keyakinan,dan segolongan lain dicemaskan hanya oleh keselamatan diri mereka sendiri dan melemahnya tekad mereka dan sibuk dengan (keselamatan) jiwa mereka sendiri,serta berburuk sangka kepada tuhan mereka,agama dan RosulNya. Dan mereka berprasangka bahwa sesungguhnya Allah tidak akan menyempurnakan urusan RosulNya dan bahwa sesungguhnya Islam tidak akan memiliki kekuatan untuk tegak berdiri. Oleh karena itu,kamu bisa melihat mereka itu menyesali keluarnya mereka (dari medan berperang),dimana sebagian mereka berkata kepada sebagian yang lain, “Apakah ada pilihan bagi kami untuk keluar ikut berperang?” maka katakanlah olehmu (wahai Rosul) kepada mereka, “Sesungguhnya urusan itu semuanya tergantung Allah. Dia-lah Dzat yang menetapkan keluarnya kalian (ke dalam peperangan) dan apa yang terjadi pada kalian.” Dan mereka itu menyembunyikan di dalam diri mereka apa yang tidak mereka tampakkan kepadamu dari penyesalan kerena keikutsertaan mereka dalam peperangan. Mereka mengatakan, “Seumpama kami memiliki hak pilih yang kecil sekalipun,niscaya kami tidak terbunuh (terkalahkan) di sini.” Katakanlah kepada mereka”Sesungguhnya ajal-ajal itu berada di Tangan Allah. Seumpama kalian berada di dalam rumah-rumah kalian sekalipun,dan Allah menakdirkan kalian akan mati,pastilah akan keluar orang-orang yang Allah telah menulis takdir kematian pada mereka menuju tempat mereka akan terbunuh.” Dan tidaklah Allah mengadakan kejadian tersebut itu,kecuali demi menguji apa yang ada di dalam hati kalian yang berisi keraguan dan kemunafikan dan untuk memisahkan hal-hal yang buruk dari yang baik-baik,serta supaya Nampak hakikat orang Mukmin daripada orang munafik di hadapan manusia dalam ucapan-ucapan dan perbuatan-perbuatan. Dan Allah Maha mengetahui semua yang ada di dalam hati makhluk-makhlukNya,tidak tersembunyi bagiNya apa pun dari urusan-urusan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "154. Kemudian setelah kepedihan dan kesulitan itu, Allah turunkan kepada kalian ketentraman dan ketenangan hati. Tiba-tiba satu golongan dari kalian -yaitu orang-orang yang percaya akan janji Allah- mengantuk berat karena hati mereka merasa aman dan damai. Namun golongan lainnya tidak merasakan kedamaian dan tidak mengantuk. Mereka ini adalah orang-orang munafik yang pikirannya tidak lain hanyalah keselamatan diri mereka sendiri. Mereka itu senantiasa merasakan kegelisahan dan ketakutan. Mereka berprasangka buruk kepada Allah, bahwa Allah tidak akan menolong utusan-Nya dan tidak akan membantu hamba-hamba-Nya. Sama seperti anggapan orang-orang jahiliah yang tidak menghargai Allah dengan semestinya. Orang-orang munafik yang tidak mengenal Allah dengan baik itu berkata, “Kami tidak mempunyai hak untuk menyatakan pendapat apapun tentang urusan pergi ke medan perang. Sekiranya kami mempunyai hak (untuk menyatakan pendapat tentang masalah itu) niscaya kami tidak akan pergi (ke medan perang).” Katakanlah -wahai Nabi- untuk menjawab ucapan mereka, “Sesungguhnya urusan itu sepenuhnya milik Allah. Dia lah yang menetapkan apa yang Dia kehendaki dan memutuskan apa yang Dia inginkan. Dia lah yang memutuskan kepergian kalian.” Orang-orang munafik itu menyembunyikan kebimbangan dan prasangka buruk di dalam hati mereka dan tidak mereka perlihatkan kepada kalian. Di mana mereka mengatakan, “Sekiranya kami mempunyai hak untuk menyatakan pendapat tentang kepergian (ke medan perang) ini, niscaya kami tidak akan terbunuh di tempat ini.” Katakanlah -wahai Nabi- untuk menjawab ucapan mereka, “Seandainya kalian berada di rumah kalian yang jauh dari medan perang dan kematian, niscaya siapapun di antara kalian yang telah ditetapkan oleh Allah akan terbunuh akan pergi ke tempat di mana ia akan dibunuh. Dan tidaklah Allah menetapkan kewajiban itu melainkan untuk menguji niat dan tujuan yang ada di dalam dada kalian, dan membedakan antara keimanan dan kemunafikan yang ada di dalamnya. Allah Maha Mengetahui apa yang tersimpan di dada hamba-hamba-Nya. Tidak ada sesuatupun yang luput dari pengetahuan-Nya.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "154. Hai orang-orang beriman, kemudian Allah menurunkan rasa aman kepada kalian setelah kegundahan ini dengan rasa kantuk yang menyelimuti golongan yang beriman. Adapun golongan orang munafik hanya memikirkan keselamatan diri mereka dan berburuk sangka terhadap Tuhan mereka bahwa Allah tidak akan menolong nabi-Nya saat mereka berkata: “Apakah kami memiliki pilihan dalam keikutsertaan berperang?” Hai Rasulullah, katakanlah kepada mereka: “Segala urusan dan ajal ada di tangan Allah.” Namun mereka menyembunyikan sesuatu dan tidak menampakkannya kepadamu, mereka berkata: “Andai saja kami dapat memilih untuk tidak berperang niscaya kami tidak akan terbunuh di sini.” Katakanlah kepada mereka: “Andai kalian berada dalam rumah kalian, niscaya yang ditetapkan Allah untuk terbunuh akan keluar dari rumahnya menuju tempat ia terbunuh. Allah hendak menguji apa yang ada dalam hati kalian, sehingga nampak siapa yang beriman dan siapa yang munafik. Allah Maha Mengetahui apa yang disembunyikan dalam dada hamba-hamba-Nya.” Anas bin Malik berkata, bahwa Abu Thalhah berkata: “Kami diliputi rasa kantuk saat kami masih dalam barisan pada perang Uhud, sehingga pedangku terjatuh dari genggamanku lalu aku mengambilnya, kemudian terjatuh lagi dan aku mengambilnya.” (as-shahih 8/76 no. 4562, kitab tafsir, surat ‘ali Imran). Ibnu Abi Hatim mengeluarkan hadits dengan sanad hasan, dari Ibnu Abbas ia berkata, Mu’attib adalah orang yang berkata di perang Uhud: ““Andai saja kami dapat memilih untuk tidak berperang niscaya kami tidak akan terbunuh di sini.” Maka Allah menurunkan firman-Nya: {وطائفة قد أهمتهم أنفسهم يظنون بالله.....} sampai akhir kisah. (at-Tafsir as-Shahih 2/89)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "154. ثُمَّ أَنزَلَ عَلَيْكُم مِّنۢ بَعْدِ الْغَمِّ أَمَنَةً (Kemudian setelah kamu berdukacita, Allah menurunkan kepada kamu keamanan) Makna (الأمنة) adalah rasa aman meski terdapat hal-hal yang menyebabkan ketakutan. نُّعَاسًا ((berupa) kantuk) Dari Zubair bin Awwam ia berkata: aku mengangkat kepalaku ketika perang Uhud kemudian aku melihat tidak ada seorangpun dari mereka kecuali mereka bersandar dibawah tameng mereka akibat rasa kantuk. Dan dikeluarkan oleh Imam Bukhari dan lainnya dari Abu Thalhah ia berkata: kami diliputi rasa kantuk pada perang Uhud sampai-sampai pedangku terjatuh lalu aku memungutnya kemudian jatuh lagi lalu aku memungutnya. يَغْشَىٰ طَآئِفَةً مِّنكُمْ ۖ( yang meliputi segolongan dari pada kamu) Mereka adalah orang orang beriman yang keluar menuju peperangan dengan mengharap pahala dari Allah, lalu mereka diliputi rasa kantuk sebagai pengokoh jiwa mereka. Adapun golongan yang lain adalah Mu’attib bin Qusyair dan para sahabatnya dari kalangan orang-orang munafik, mereka keluar berperang untuk mencari harta rampasan perang, mereka pun saling mengeluh bahkan merasa bimbang untuk ikut berperang dan mulai mengatakan perkataan yang tidak benar. أَهَمَّتْهُمْ أَنفُسُهُمْ (telah dicemaskan oleh diri mereka sendiri) Yakni kecemasan mereka tidak ada kecuali hanya pada diri mereka. يَظُنُّونَ بِاللهِ غَيْرَ الْحَقِّ (mereka menyangka yang tidak benar terhadap Allah) Mereka menyangka bahwa perintah Rasulullah salah dan menyangka bahwa ia tidak akan ditolong dan seruan yang ia bawa tidak akan menjadi sempurna. يَقُولُونَ (Mereka berkata) Yakni berkata kepada Rasulullah. هَل لَّنَا مِنَ الْأَمْرِ مِن شَىْءٍ ۗ( “Apakah ada bagi kita barang sesuatu (hak campur tangan) dalam urusan ini?”) Yakni dalam hal pertolongan dan kemenangan atas musuh agar kita mendapatkan harta rampasan. Dan pendapat lain mengatakan yang dimaksud adalah urusan keluar untuk berperang di hari itu. Mereka berkata: kami keluar menuju Uhud padahal kami tidak sepakat untuk keluar. Dan diriwayatkan bahwa orang-orang munafik berkata kepada Abdullah bin Ubay: Bani Khazraj akan binasa hari ini. Kemudian ia menjawab: Apakah ada bagi kita campur tangan dalam urusan ini? قُلْ إِنَّ الْأَمْرَ كُلَّهُۥ لِلَّـهِ ۗ (Katakanlah: “Sesungguhnya urusan itu seluruhnya di tangan Allah”) Yakni bukan ditangan kalian dan bukan pula ditangan musuh kalian sedikit pun, karena pertolongan dan kemenangan ada ditangan-Nya. يُخْفُونَ فِىٓ أَنفُسِهِم (Mereka menyembunyikan dalam hati mereka) Yakni berupa kemunafikan yang tidak mereka tunjukkan kepadamu. Bahkan mereka bertanya kepadamu perihal orang-orang yang mendapat petunjuk. يَقُولُونَ (mereka berkata) Seakan-akan dikatakan apakah yang disembunyikan dalam hati mereka? Maka dijawab: mereka mengatakan itu diantara mereka saja atau dalam hati mereka saja. لَوْ كَانَ لَنَا مِنَ الْأَمْرِ شَىْءٌ مَّا قُتِلْنَا هٰهُنَا ۗ (“Sekiranya ada bagi kita barang sesuatu (hak campur tangan) dalam urusan ini, niscaya kita tidak akan dibunuh (dikalahkan) di sini”) Yakni sebenarnya tidak akan terbunuh orang terbunuh diantara kita dalam perang ini. لَبَرَزَ الَّذِينَ كُتِبَ عَلَيْهِمُ الْقَتْلُ إِلَىٰ مَضَاجِعِهِمْ (niscaya orang-orang yang telah ditakdirkan akan mati terbunuh itu keluar (juga) ke tempat mereka terbunuh) Yakni orang yang telah tertulis bahwa ia akan terbunuh pasti akan keluar ke tempat mereka mati karena qadha yang Allah tetapkan tidak bisa ditolak. وَلِيَبْتَلِىَ اللهُ مَا فِى صُدُورِكُمْ (Dan Allah (berbuat demikian) untuk menguji apa yang ada dalam dadamu) Untuk menguji keikhlasan yang ada di dada kalian. Dan membersihkan was-was dari syaitan yang ada dalam hati kalian."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Ketika anda mengetahui bahwa ini adalah hari ketika Allah menyelamatkan Musa عليه السلام, dan pada hari itu juga cucu Rasulullah Husain dibunuh sebagaimana pada hari itu juga Allah menenggelamkan Fir'aun dan bala tentaranya, anda akan yakin bahwa { الْأَمْرَ كُلَّهُ لِلَّ } \"urusan itu seluruhnya di tangan Allah\", dan sesungguhnya tidak satupun dari makhluq-Nya berkuasa atas itu, maka tiada lagi yang tersisa kecuali hanya bersyukur atas keselamatan para Nabi dan kebinasaan para musuh-musuh Allah, dan bersabar atas segala musibah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "154 Kemudian setelah kamu berduka cita, Allah menurunkan kepada kamu keamanan, maka hilanglah rasa takut pada kalian. Allah menganugerahkan rasa kantuk yang meliputi segolongan dari pada kamu agar mengembalikan kekuatan dan keteguhan sebagai rahmat atas kalian. Mereka yang terserang kantuk adalah mereka yang benar-benar pergi untuk berperang dengan mengharap pahala. Sedang segolongan lagi mereka adalah orang-orang munafik, mereka telah dicemaskan oleh diri mereka sendiri, mereka menyangka sesuatu yang tidak benar terhadap Allah seperti sangkaan jahiliyah. Bahwa Allah tidak akan menolong Nabi-Nya dan para para sahabat Mereka orang-orang munafik berkata: “Apakah ada bagi kita barang sesuatu hak campur tangan dalam urusan ghanimah ini?”. Katakanlah wahai rasul: “Sesungguhnya pertolongan itu seluruhnya di tangan Allah”. Mereka menyembunyikan dalam hati mereka kemunafikan dan kekufuran, perkataan dan niat yang tidak mereka tunjukkan kepadamu; mereka berkata pada diri mereka sendiri: “Sekiranya ada hak campur tangan dalam urusan ini untuk dapat memilih, niscaya kita tidak akan dibunuh (dikalahkan) di sini. Namun kami merasa tidak nyaman”. Katakanlah wahai Nabi: “Sekiranya kamu berada di rumahmu, niscaya orang-orang yang telah ditakdirkan akan mati terbunuh itu tetap akan keluar juga ke tempat mereka terbunuh”. Sebab ketentuan Allah tidak akan dapat terhalangi, dan ajal ketetapan itu pasti. Dan Allah berbuat demikian untuk menguji keikhlasan yang ada dalam dadamu dan menunjukkannya kepada manusia dan untuk membersihkan kemunafikan yang ada dalam hatimu dengan keimanan. Allah Maha Mengetahui isi hati dan rahasia jiwa. Tidak ada yang bisa tersembunyi dari-Nya. Ayat ini turun ketika orang-orang mukmin sangat takut dalam peperangan Uhud, kemudian mereka tertidur. Sebagian orang munafik berkata: Jika kami punya hak campur tangan, mungkin kita tidak akan terbunuh di sini. Kemudian Allah menurunkan ayat: kemudian Allah menurunkan setelah kesedihan ... hingga akhir ayat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Setelah ditimpa kesedihan, kemudian Dia menurunkan rasa aman kepadamu} rasa aman {yaitu kantuk yang meliputi segolongan dari kalian, sedangkan segolongan lagi telah mencemaskan diri mereka sendiri.} mereka membuat diri mereka sendiri khawatir {Mereka berprasangka yang tidak benar terhadap Allah} mereka berprasangka kepada Allah dengan prasangka yang tidak semestinya mereka lakukan {seperti sangkaan jahiliyah.} seperti prasangka orang jahiliyah bahwa Allah tidak menolong nabi Muhammad dan para sahabatnya {Mereka berkata, “Adakah sesuatu yang dapat kita perbuat dalam urusan ini”} tidak ada jalan keluar yang bisa kami perbuat, selain keluar dengan terpaksa {Katakanlah, “Sesungguhnya segala urusan itu milik Allah.” Mereka menyembunyikan dalam diri mereka apa yang tidak mereka terangkan} tampakkan {kepadamu. Mereka berkata, “Seandainya ada sesuatu yang dapat kami perbuat dalam urusan ini} jika kami bisa membuat rencana dan memberi pendapat dalam hal ini {niscaya kami tidak akan dibunuh di sini.”} tidak akan dibunuh sebagian dari kita di pertempuran ini {Katakanlah,“Seandainya kalian ada di rumah kalian, niscaya akan keluar} keluar {orang-orang yang telah ditetapkan} ditetapkan {akan mati terbunuh ke tempat mereka terbunuh.”} tempat pertempuran yang telah ditakdirkan Allah untuk membuat mereka mati di sana {supaya Allah bisa memberi cobaan} menguji {apa yang ada dalam dada kalian dan untuk membersihkan} membersihkan {apa yang ada dalam hati kalian. Allah Maha Mengetahui segala isi hati"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "154.”Kemudian setelah kamu berduka cita, Allah menurunkan kepadamu,” yaitu duka cita yang telah menimpa kalian, “keamanan (berupa) kantuk yang meliputi segolongan darimu.” Tidak diragukan bahwa ini merupakan suatu rahmat atas mereka, kebaikan dan penetapan bagi hati mereka, serta tambahan ketenangan. Karena seorang yang takut, tidak akan dihinggapi oleh kantuk disebabkan kekhawatiran yang ada di dalam hatinya. Apabila ketakutan itu telah hilang dari hati, maka kantuk itu baru bisa datang kepadanya. Kelompok ini yang dikaruniakan kantuk oleh Allah adalah mereka yang beriman yang tidak memiliki tujuan kecuali menegakkan agama Allah, mengharap keridhaan Allah dan RasulNya serta kemaslahatan saudara-saudaranya yang Muslim. Adapun kelompok lain yang “telah dicemaskan oleh diri mereka sendiri,” maka mereka tidak cemas pada selain (keselamatan) dirinya disebabkan kemunafikan mereka atau kelemahan iman mereka. Oleh karena itulah, mereka tidak terserang kantuk sebagaimana yang menyerang selain mereka. “Mereka berkata, ‘Apakah ada bagi kita barang sesuatu (hak campur tangan) dalam urusan ini?’” ini merupakan pertanyaan penolakan, maksudnya kita tidak punya urusan dalam perkara itu, yaitu perkara kemenangan dan keberhasilan barang sedikit pun, lalu mereka berprasangka buruk terhadap Rabb mereka, agamaNya, dan NabiNya. Mereka mengira bahwa Allah tidak menyempurnakan urusan RasulNya, dan bahwa kekalahan itu adalah momentum dan penentuan hancurnya agama Allah. Allah berfirman dan menjawab mereka, “Katakanlah, ‘Sesungguhnya urusan itu seluruhnya adalah hak Allah’ . “ urusan itu meliputi perkara takdir maupun perkara syariat, maka seluruh perkara adalah karena Qadha’ dan Qadar Allah. Hasilnya adalah kemenangan dan keberhasilan bagi wali-wali Allah dan orang-orang yang taat kepadaNya, meskipun terjadi sesuatu yang telah terjadi pada mereka. “Mereka menyembunyikan”, maksudnya orang-orang munafik “dalam hati mereka apa yang tidak mereka terangkan kepadamu.” Kemudian Allah menjelaskan perkara yang disembunykan oleh mereka seraya berfirman, “Mereka berkata, ‘Sekiranya ada bagi kita barang sesuatu (hak campur tangan) dalam urusan ini’ ,” maksudnya, sekiranya kita memiliki hak sedikit campur tangan dalam kejadian itu berupa pendapat maupun ikut bermusyawarah, “niscaya kita tidak akan dibunuh (dikalahkan) di sini.” Ini adalah pengingkaran mereka dan sebuah pendustaan terhadap ketentuan Allah, serta menganggap bodoh pandangan Rasulullah dan para sahabat, juga suatu penyucian diri bagi mereka sendiri. Maka Allah membantah mereka dengan FirmanNya, “Katakanlah, ‘Sekiranya kamu berada di rumahmu’,“ yang merupakan tempat yang paling jauh dari tempat yang diperkirakan sebagai tempat kematian, “niscaya orang-orang yang telah ditakdirkan akan mati terbunuh itu keluar (juga) ke tempat mereka terbunuh.” Sebab-sebab kematian itu walaupun besar hanya akan berguna bila tidak bertentangan dengan Qadha’ dan Qadar Allah, maka apabila bertentangan dengan Qadha’ dan Qadar, tidaklah akan memiliki akibat apa-apa. Akan tetapi pastilah Allah akan menjalankan apa yang telah ditulis olehNya di Lauhul Mahfuzh berupa kematian dan kehidupan. “Dan Allah (berbuat demikian) untuk menguji apa yang ada padanya berupa kemunafikan, keimanan, dan kelemahan iman. “Dan untuk membersihkan apa yang ada dalam hatimu” berupa godaan-godaan setan dan pengaruh yang timbul karenanya dari sifat-sifat yang tidak terpuji. “Dan Allah Maha Mengetahui isi hati,” yaitu segala yang ada padanya dana pa yang disembunyikannya. Maka ilmu dan hikmahNya menuntut bahwa Dia menetapkan sebab-sebab yang dapat menyingkap segala yang tersembunyi pada hati dan rahasia-rahasia segala perkara."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 154: Kemudian la turunkan atas kamu, sesudah kesusahan hati itu, satu keamanan, (yaitu) ngantuk yang mengenai segolongan daripada kamu, sedang segolongan (lain) sesungguhnya telah pentingkan diri sendiri; mereka menyangka-nyangka terhadap Allah (sangkaan) yang tidak benar, sangkaan Jahiliyah, (yaitu) mereka berkata: \"Bukankah kita tidak berkuasa apa-apa di tentang urusan itu?\" Katakanlah: \"Sesungguhnya urusan-urusan itu semuanya kepunyaan Allah.\" Mereka sembunyikan di hati mereka apa yang mereka tidak sebutkan kepadamu, (yaitu) mereka berka ta (diantara mereka): \"Kalau kita ada berfikiran di urusan itu, tentu tidak terbunuh (kaum kita) di sini.\"Katakanlah: \"\"Walaupun kamu tinggal tetap di rumah-rumah kamu, niscaya keluar orang-orang yang telah ditakdirkan akan terbunuh itu ke tempat-tempat mati mereka. Tetapi Allah hendak menguji apa-apa yang ada di dada-dada kamu, dan la hendak saring apa-apa yang di hati kamu; dan Allah itu amat mengetahui apa-apa yang ada di dada-dada."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Imam Tirmidzi meriwayatkan dari Anas bin Abi Thalhah ia berkata: Aku berusaha mengangkat kepalaku (setelah selesai perang) pada peperangan Uhud, maka aku melihat tidak ada seorang pun ketika itu kecuali terkulai lemas di bawah perisainya karena ngantuk. Itulah maksud firman Allah, ta'ala, \"Tsumma anzala 'alakum mim ba'dil ghammi amanatan nu'aasaa.\" (Hadits ini hasan shahih) Ibnu Rahawaih meriwayatkan dari Zubair, ia berkata, \"Sungguh, kamu melihat aku bersama Rasulullah shallallahu 'alaihi wa sallam pada peperangan Uhud ketika kami merasakan ketakutan yang sangat, maka Allah membuat kami tertidur. Ketika itu, tidak ada seorang pun di antara kami kecuali dagunya menempel ke dadanya. Demi Allah, sesungguhnya aku benar-benar pendengar ucapan Mu'tab bin Qusyair seperti mimpi, \"Sekiranya ada hak campur tangan bagi kita dalam urusan ini, niscaya kita tidak akan dibunuh (dikalahkan) di sini,\" dan aku mengingatnya, kemudian Allah Tabaaraka wa Ta'aala menurunkan ayat tentang itu, \"Tsumma anzala 'alaikum mim ba'dil ghammi amanatan nu'aasaa…sampai firman Allah, \"Maa qutilnaa haahunaa.\" Terhadap kata-kata Mu'tab bin Qusyair. Allah berfirman, \"Law quntum fii buyuutikum… sampai ayat, 'Aliimum bidzaatish shuduur.\" Habiburrahman Al A'zhamiy berkata, \"Al Buwshiri mendiamkan, namun isnadnya jayyid.\" Orang-orang Islam yang kuat keyakinannya. Mereka adalah kaum mukmin, di mana tidak ada yang mereka inginkan selain tegaknya agama Allah, mencari ridha Allah serta dapat memberikan sesuatu yang bermaslahat bagi saudara mereka kaum muslimin. Orang-orang Islam yang masih ragu-ragu. Ada pula yang mengatakan bahwa mereka ini adalah orang-orang munafik. Sangkaan bahwa kalau Muhammad shallallahu 'alaihi wa sallam itu benar-benar Nabi dan Rasul Allah, tentu dia tidak akan dikalahkan dalam peperangan. Atau sangkaan bawa Allah tidak menyempurnakan agama-Nya dan bahwa kekalahan itu merupakan kesempatan terakhir bagi agama-Nya. Mencakup urusan taqdir dan urusan syari'at-Nya. Semuanya mengikuti qadha' Allah dan qadar-Nya, dan bahwa kesudahan yang baik akan diperoleh wali-wali-Nya meskipun terkadang mereka mengalami kekalahan. Yakni diberikan kesempatan berpendapat dan memberikan usulan. Hal ini merupakan penolakan mereka terhadap qadar Allah, menganggap Rasulullah shallallahu 'alaihi wa sallam dan para sahabatnya kurang pintar dan menganggap diri mereka lebih pandai. Oleh karena itu, semua sebab meskipun telah diusahakan, maka hanyalah bermanfaat jika tidak berbenturan dengan qadar Allah. Jika berbenturan, maka tidak akan bermanfaat, bahkan yang berlaku hanyalah ketetapan Allah dalam Al Lauhul Mahfuzh. Menguji apakah ada nifak atau lebih dominan keimanan atau bahkan imannya lemah. Berupa bisikan dari setan dan sifat-sifat tercela yang timbul daripadanya. Oleh karena itu, ujian yang dilakukan-Nya untuk memperlihatkan secara jelas apa yang disembunyikan dalam hatinya. Ilmu dan hikmah (kebijaksanaan)-Nya menghendaki untuk mengadakan sebab yang dapat menampakkan.apa yang disembunyikan dalam hati."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 154",
    "description": "Usai menjelaskan ampunan Allah atas kesalahan pasukan pemanah yang meninggalkan posisinya pada perang uhud, Allah lalu beralih menjelaskan pertolongan-Nya kepada pasukan muslim berupa kantuk walau dalam suasana duka. Kemudian setelah kamu ditimpa kesedihan, dia menurunkan rasa aman kepadamu berupa kantuk yang bisa menghilangkan kepenatan yang meliputi segolongan dari kamu yang kuat imannya, sedangkan segolongan lagi, yang imannya tidak kuat, telah dicemaskan oleh diri mereka sendiri; mereka menyangka yang tidak benar terhadap Allah seperti sangkaan jahiliah, bahwa kalau nabi Muhammad itu benar-benar nabi dan rasul Allah, tentu dia tidak akan kalah dalam peperangan. Mereka berkata, adakah sesuatu yang dapat kita perbuat, yakni campur tangan kita, dalam urusan ini' mereka berkata demikian karena ingin lepas tanggung jawab dari kegagalan dalam perang uhud. Katakanlah wahai nabi Muhammad, sesungguhnya segala urusan itu di tangan Allah. Dia yang menetapkan kemenangan atau kekalahan berdasarkan hukum kemasyarakatan yang berlaku. Sesungguhnya orang-orang yang berpaling di antara kamu, tidak ikut berperang atau lari dari medan perang, ketika terjadi pertemuan, yaitu pertempuran, antara dua pasukan itu, yakni pasukan mukmin dan pasukan kafir dalam perang uhud, sesungguhnya mereka digelincirkan oleh setan, disebabkan sebagian kesalahan, dosa, yang telah mereka perbuat, pada masa lampau, tetapi Allah benar-benar telah memaafkan mereka. Sungguh, Allah maha pengampun atas segala dosa, maha penyantun tidak segera menghukum orang yang berbuat maksiat."
  }
]