[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang yang lari di antara kalian (wahai sahabat-sahabat Muhammad sholallohu alaihi wasallam), dari peperangan ketika bertemunya pasukan Mukminin dengan kaum musyrikin pada Perang Uhud, sesungguhnya setan menjerumuskan mereka pada dosa itu dikarenakan sebagian dosa yang mereka perbuat. Dan sesungguhnya Allah telah memaafkan itu dari mereka,sehingga tidak menghukum mereka. Sesungguhnya Allah maha pengampun kepada orang-orang yang berbuat dosa yang mau bertaubat,juga Maha penyantun,tidak menyegerakan pada orang yang berbuat maksiat kepadaNya dengan siksaan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "155. Sesungguhnya orang-orang yang kalah di antara kamu -wahai sahabat-sahabat Muhammad -ṣallallāhu 'alaihi wa sallam- pada waktu pertemuan antara golongan musyrik dengan kaum muslimin di Uhud, sesungguhnya setan lah yang mendorong mereka untuk tergelincir akibat perbuatan maksiat yang mereka lakukan. Dan sungguh Allah telah memaafkan mereka dan tidak menghukum mereka sebagai wujud kemurahan dan kasih sayang-Nya. Sesungguhnya Allah Maha Pengampun bagi orang yang bertaubat lagi Maha Penyantun, tidak tergesa-gesa menjatuhkan hukuman kepada orang yang berbuat dosa."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "155. kaum muslimin yang kalah dalam menghadapi pasukan kafir pada perang Uhud disebabkan setan yang menjerumuskan mereka ke dalam kesalahan yang menyebabkan kekalahan, yaitu menyelisihi perintah Rasulullah. Namun Allah telah mengampuni mereka dan tidak menyiksa mereka. Allah Maha Pengampun orang-orang yang berdosa, Maha Lembut kepada mereka sehingga tidak segera menyiksa mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "155. إِنَّ الَّذِينَ تَوَلَّوْا۟ مِنكُمْ يَوْمَ الْتَقَى الْجَمْعَانِ (Sesungguhnya orang-orang yang berpaling di antaramu pada hari bertemu dua pasukan itu) Yakni orang-orang yang kabur pada perang Uhud. إِنَّمَا اسْتَزَلَّهُمُ الشَّيْطٰنُ (hanya saja mereka digelincirkan oleh syaitan) Yakni dijerumuskan dalam kesalahan berupa berpaling disebabkan sebagian dosa-dosa yang telah mereka perbuat. وَلَقَدْ عَفَا اللهُ عَنْهُمْ ۗ (dan sesungguhnya Allah telah memberi maaf kepada mereka) Karena taubat dan permohonan maaf mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Jika seorang hamba selalu mendekati dosa, dan tidak bersegera bertaubat kepada Allah, maka tidak akan aman baginya jika Allah akan membuat syaithon berkuasa atasnya, dan membuatnya tersesat menuju kesesatan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "155 Sesungguhnya orang-orang di antaramu yang berpaling pada perang Uhud, pada hari bertemunya dua pasukan mukmin dan musyrik itu, hanya saja mereka digelincirkan oleh syaitan dalam kesalahan yaitu berpaling dari perang, disebabkan sebagian kesalahan/dosa yang telah mereka perbuat di masa lampau yaitu mebantah perintah Nabi. Sesungguhnya Allah telah memberi maaf kepada mereka karena taubat mereka. Sesungguhnya Allah Maha Luas ampunan-Nya bagi mereka yang bertaubat lagi Maha Penyantun dengan tidak menyiksa hamba tanpa adanya dosa."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang yang berpaling} lari dan berpaling dari jihad {di antara kalian pada hari ketika dua pasukan bertemu,} pasukan muslim dan pasukan musyrik pada hari perang Uhud {sesungguhnya mereka hanyalah digelincirkan oleh setan} setan membuat mereka tergelincir {karena sebagian kesalahan yang telah mereka perbuat. Allah benar-benar telah memaafkan mereka. Sesungguhnya Allah Maha Pengampun lagi Maha Penyantun"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "155. Allah memberitahukan tentang keadaan orang-orang yang kalah pada peperangan Uhud, dan sebab yang menjadikan mereka melarikan diri dari peperangan dan bahwa hal itu adalah bujukan setan, dan bahwa setan telah menguasai mereka karena beberapa dosa mereka. Merekalah yang telah memasukkan setan pada diri mereka sendiri dan menempatkannya padanya dengan cara melakukan beberapa kemaksiatan, karena kemaksiatan itu adalah kendaraan dan pintu (masuknya setan). Sekiranya mereka itu berpegang teguh dengan melakukan ketaatan kepada Rabb mereka, niscaya setan itu tidaklah memiliki kekuasaan atas mereka. Allah berfirman, \"Sesungguhnya hamba-hamba-Ku, kamu tidak dapat berkuasa atas mereka. Dan cukuplah Tuhan-mu sebagai Penjaga”.\"-Al-Isra:65- Kemudian Allah memberitahukan bahwasanya Dia telah memaafkan mereka setelah melakukan hal-hal yang mengharuskan hukuman, dan bila tidak demikian, sekiranya Allah menghukum mereka, niscaya Allah akan membinasakan mereka. “Sesungguhnya Allah Maha Pengampun” bagi orang-orang yang berdosa dan orang-orang yang berbuat kesalahan (dilebur) dengan sesuatu yang dapat memberi mereka taufik kepadaNya berupa taubat, istighfar, dan musibah-musibah yang menggugurkan, “lagi Maha Penyantun.” Allah tidak menyegerakan hukuman orang yang bermaksiat kepadaNya, akan tetapi menangguhkannya dan mengajaknya kembali kepadaNya, dan berserah diri kepadaNya, kemudian bila dia bertaubat dan kembali, niscaya akan diterima lalu membuatnya seperti tidak terjadi dosa darinya dan tidak muncul darinya kekurangan. Akhirnya segala puji hanya milik Allah atas kebaikanNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 155: Sesungguhnya yang telah berpaling dari antara kamu pada hari pertemuan dua tentara itu, tidak lain melainkan mereka digelincir kan oleh syaitan dengan sebab sebagian daripada (kesalahan) yang mereka telah kerjakan; tetapi sesungguhnya Allah telah ampunkan mereka, karena sesungguhnya Allah itu Pengampun, Penyabar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dari peperangan. Dua pasukan itu ialah pasukan kaum muslimin dan pasukan kaum musyrikin dalam perang Uhud. Dengan bisikannya. Yakni sikap-sikap menyelisihi perintah Nabi shallallahu 'alaihi wa sallam. Karena sebab inilah setan berhasil menguasai mereka. Kalau sekiranya mereka menaati Allah dan rasul-Nya, tentu setan tidak akan dapat menguasai hati mereka. Allah berfirman, \"Sesungguhnya hamba-hamba-Ku tidak ada kekuasaan bagimu terhadap mereka, kecuali orang-orang yang mengikut kamu, yaitu orang-orang yang sesat. (Terj. Al Hijr: 42) Dengan memberikan taufiq kepada mereka untuk beristighfar dan bertobat, serta dengan musibah-musibah yang menghapuskan dosa. Dia tidak segera menghukum para pelaku maksiat, bahkan menundanya dan mengajak untuk kembali kepada-Nya. Jika ia mau bertobat dan kembali, maka Dia menerimanya dan menjadikannya seolah-olah tidak pernah berbuat dosa, maka segala puji bagi Allah atas ihsan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 155",
    "description": "Sesungguhnya orang-orang yang berpaling di antara kamu, tidak ikut berperang atau lari dari medan perang, ketika terjadi pertemuan, yaitu pertempuran, antara dua pasukan itu, yakni pasukan mukmin dan pasukan kafir dalam perang uhud, sesungguhnya mereka digelincirkan oleh setan, disebabkan sebagian kesalahan, dosa, yang telah mereka perbuat, pada masa lampau, tetapi Allah benar-benar telah memaafkan mereka. Sungguh, Allah maha pengampun atas segala dosa, maha penyantun tidak segera menghukum orang yang berbuat maksiat usai menjelaskan peristiwa perang uhud, Allah lalu menjabarkan tuntunan yang harus diikuti oleh orang yang beriman. Wahai orangorang yang beriman! janganlah kamu seperti orang-orang kafir, yakni orang munafik yang mengatakan kepada saudara-saudaranya seketurunan maupun seiman, apabila mereka mengadakan perjalanan di bumi atau pergi berperang, sekiranya mereka tetap bersama kita, tidak ikut berperang, tentulah mereka tidak mati dan tidak terbunuh. Akibat perkataan yang demikian itu, Allah hendak menimbulkan rasa penyesalan yang besar di hati mereka. Allah menghidupkan dan mematikan siapa yang dikehendaki-Nya sesuai dengan ketetapan-Nya, dan Allah maha melihat apa yang kamu kerjakan, yang kamu tampakkan maupun yang kamu sembunyikan."
  }
]