[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang yang beriman kepada Allah dan RosulNya dan melaksanakan ajaran syariatNya,janganlah kalian menyerupai orang-orang kafir yang tidak beriman kepada tuhan mereka. Mereka berkata kepada saudara-saudara mereka dari kalangan orang-orang kafir,bila mereka ikut keluar mencari penghidupan di muka bumi Allah,atau mereka bersama prajurit-prajurit yang terjun dalam peperangan lalu mereka tewas atau terbunuh,”Seandainya mereka tidak keluar dan tidak maju berperang,serta tinggal bersama kita,pastilah mereka tidak mati dan tidak terbunuh.” Pernyataan ini menambah kesakiyan, kesedihan dan penyesalan yang tertancap mendalam pada hati-hati mereka. Adapun orang-orang mukmin,maka sesungguhnya mereka mengetahui bahwa itu terjadi sesuai ketetapan takdir Allah. Lalu Allah memberikan hidayah kepada hati-hati mereka,dan meringankan dari mereka beban musibah. Dan Allah menghidupkan siapa saja yang ditakdirkanNya tetap hidup, (meskipun dia tengah berada dalam perjalanan jauh atau berperang),dan mematikan orang yang telah berakhir ajalnya,meskipun ia berada di kampong halaman sendiri. Dan Allah Maha mengetahui apa yang kalian perbuat,lalu Dia memberikan balasan kepada kalian menurut amal perbuatan tersebut."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "156. Wahai orang-orang yang beriman dengan Allah dan mengikuti Rasul-Nya, janganlah kalian menjadi seperti orang kafir dari golongan munafik. Mereka mengatakan kepada sanak kerabat mereka yang bepergian untuk mencari rezeki atau berperang kemudian meninggal atau terbunuh, “Seandainya mereka berada di sisi kami dan tidak pergi ke sana, niscaya mereka tidak akan mati dan tidak akan terbunuh.” Allah meletakkan keyakinan ini di dalam hati mereka agar penyesalan mereka semakin kuat. Hanya Allah sajalah yang dapat menghidupkan dan mematikan menurut kehendak-Nya. Takdir Allah tidak dapat dihalang-halangi oleh duduknya seseorang di rumahnya, dan tidak dapat dipercepat oleh keberangkatannya ke medan perang. Allah Maha Melihat apa yang kalian perbuat. Tidak ada satupun perbuatan kalian yang luput dari pengawasan-Nya. Dan Dia akan memberi kalian balasan yang setimpal dengannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "156. Allah memperingatkan orang-orang beriman agar tidak mengikuti orang-orang munafik dalam berucap kepada orang-orang kafir apabila pergi untuk berdagang atau berperang kemudian meninggal dunia. Mereka berucap: “Seandainya mereka tetap tinggal bersama kami dan tidak pergi niscaya dia tidak akan mati atau terbunuh”. Allah menjadikan ucapan ini untuk memberikan mereka rasa sakit dan sedih. Allah akan membiarkan hidup orang yang telah ditakdirkan tetap hidup meski dia berada di tengah-tengah peperangan, dan akan mematikan orang yang telah habis ajalnya meski dia berada di dalam benteng yang kokoh. Allah Maha Melihat segala yang kalian perbuat, dan akan membalas perbuatan tersebut. Syeikh as-Syinqithi berkata: “Dalam ayat ini disebutkan bahwa orang-orang munafik jika seseorang diantara mereka meninggal, mereka akan berucap: ‘Andai dia mendengar saran kami, dan tidak pergi berperang niscaya dia tidak akan terbunuh’; namun Allah tidak menjelaskan dalam ayat ini apakah mereka mengatakan ini sebelum ia pergi berperang agar menghilangkan semangatnya pergi berperang atau setelah ia pergi? Demikian pula dengan ayat 168 pada surat ini. Akan tetapi Allah menjelaskan hal ini pada ayat-ayat lain, bahwa mereka mengatakan ini sebelum ia pergi berperang agar menghilangkan semangatnya pergi berperang, seperti: وَقَالُوا لَا تَنْفِرُوا فِي الْحَرِّ …Dan mereka berkata: \"Janganlah kamu berangkat (pergi berperang) dalam panas terik ini\"… (at-Taubah: 81) قَدْ يَعْلَمُ اللَّهُ الْمُعَوِّقِينَ مِنْكُمْ وَالْقَائِلِينَ لِإِخْوَانِهِمْ هَلُمَّ إِلَيْنَا Sesungguhnya Allah mengetahui orang-orang yang menghalang-halangi di antara kamu dan orang-orang yang berkata kepada saudara-saudaranya: \"Marilah kepada kami\"… (al-Ahzab: 18) وَإِنَّ مِنْكُمْ لَمَنْ لَيُبَطِّئَنَّ Dan sesungguhnya di antara kamu ada orang yang sangat berlambat-lambat (ke medan pertempuran)… (an-Nisa: 72)"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "156. يٰٓأَيُّهَا الَّذِينَ ءَامَنُوا۟ لَا تَكُونُوا۟ كَالَّذِينَ كَفَرُوا۟ وَقَالُوا۟ لِإِخْوٰنِهِمْ (Hai orang-orang yang beriman, janganlah kamu seperti orang-orang kafir (orang-orang munafik) itu, yang mengatakan kepada saudara-saudara mereka) Yakni saudara dalam kekafiran atau dalam keturunan atau rasa cinta. إِذَا ضَرَبُوا۟ فِى الْأَرْضِ (apabila mereka mengadakan perjalanan di muka bumi) Yakni perjalanan untuk perniagaan atau yang lainnya. أَوْ كَانُوا۟ غُزًّى(atau mereka berperang) Atau yang keluar berperang lalu mereka meninggal dalam perjalanan, atau terbunuh di medan perang. Allah menjelaskan bagaimana orang-orang kafir dan munafik apabila ada saudara atau orang yang mereka kasihi dari mereka meninggal pada saat safar, perdagangan, atau peperangan mereka mengatakan perkataan ini. لَّوْ كَانُوا۟ عِندَنَا مَا مَاتُوا۟ وَمَا قُتِلُوا۟( Kalau mereka tetap bersama-sama kita tentulah mereka tidak mati dan tidak dibunuh) Mereka mengatakan ini karena mereka tidak beriman kepada qadha dan qadar yang Allah tetapkan. لِيَجْعَلَ اللهُ ذٰلِكَ حَسْرَةً فِى قُلُوبِهِمْ ۗ (Akibat yang demikian itu, Allah menimbulkan rasa penyesalan yang sangat di dalam hati mereka) Yakni mereka menyangka bahwa apabila mereka tidak keluar untuk itu mereka tidak akan terbunuh atau mati, sehingga itu menambah rasa sesal dihati mereka. وَاللهُ يُحْىِۦ وَيُمِيتُ ۗ (Allah menghidupkan dan mematikan) Yakni dimanapun dan kapanpun Dia kehendaki."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "156 Hai orang-orang yang beriman, janganlah kamu seperti orang-orang munafik seperti Abdullah bin Ubay yang kafir kepada Allah, yang mengatakan kepada saudara-saudara mereka dalam kekufuran. Apabila mereka mengadakan perjalanan di muka bumi untuk berdagang atau untuk berperang kemudian mereka mati dalam perjalanan atau terbunuh dalam peperangan: “Kalau mereka tetap berada dalam rumah mereka dan tidak keluar tentulah mereka tidak mati dan tidak dibunuh” sebab tidak adanya iman mereka atas ketentuan takdir. Agar Allah menjadikan perkataan itu sebagai akibat dari penyesalan dalam hati mereka. Allah Maha menghidupkan dan mematikan pada perjalanan maupun pada peperangan atau pada lainnya. Maka janganlah kalian meratapi atas golongan kalian yang meminta persaksian, bersabarlah sesungguhnya kematian ada di tangan Allah dan kekuasaan-Nya. Dan Allah melihat apa yang kamu kerjakan dan akan memberi balasan atasnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, janganlah kalian seperti orang-orang kafir dan berbicara tentang saudara-saudaranya, apabila mereka mengadakan perjalanan di bumi} melakukan perjalanan di bumi untuk berdagang dan hal semacamnya {atau berperang} berperang {“Seandainya mereka tetap bersama kami, tentulah mereka tidak mati dan tidak terbunuh.”} tidak mati dalam perjalanan dan tidak terbunuh dalam peperangan (Allah mejadikan hal tersebut sebagai penyesalan} penyesalan {di hati mereka. Allah menghidupkan dan mematikan. Allah Maha Melihat apa yang kalian kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "156. Allah melarang hamba-hambaNya yang beriman untuk menyerupai orang-orang kafir yang tidak beriman kepada Rabb mereka, tidak pula kepada Qadha’ dan QadarNya, dari kalangan munafik dan selainnya. Allah melarang mereka dari menyerupai orang-orang tersebut dalam segala hal, dan khususnya pada perkara ini, di mana mereka berkata kepada saudara-saudara mereka seagama atau sedarah, “apabila mereka mengadakan perjalanan di muka bumi,” maksudnya, bepergian untuk berdagang, “atau mereka berperang,” maksudnya, melakukan perjalanan perang, kemudian di antara mereka ada yang terbunuh atau mati, maka mereka menentang Qadar dan berkata, “ kalau mereka tetap bersama-sama kita, tentulah mereka tidak mati dan tidak dibunuh.” Ini merpakan dusta dari mereka, karena Allah telah berfirman, \"Katakanlah: “Sekiranya kamu berada di rumahmu, niscaya orang-orang yang telah ditakdirkan akan mati terbunuh itu keluar (juga) ke tempat mereka terbunuh”.\"-Ali Imran : 154- Akan tetapi pendustaan ini tidaklah berguna bagi mereka, hanya saja Allah menjadikan perkataan dan keyakinan tersebut sebagai suatu ungkapan penyesalan dalam hati mereka, yang akhirnya justru menambah musibah mereka. Sedangkan kaum Mukminin, mereka mengetahui bahwa itu semua adalah ketentuan Allah, sehingga mereka meyakininya dan menerimanya lalu Allah memberikan petunjuk bagi hati mereka, meneguhkannya, dan meringankan bagi mereka musibah tersebut. Allah berfirman menjawab mereka, “Allah menghidupkan dan mematikan,” maksudnya, Dia-lah yang Esa dalam hal tersebut sehingga suatu tindakan kewaspadaan tidak akan berguna di hadapan takdir. “Dan Allah melihat apa yang kamu kerjakan,” maka Allah akan membalas kalian atas perbuatan dan pendustaan kalian."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 156: Hai orang-orang yang beriman! Janganlah kamu jadi seperti mereka yang kafir dan berkata tentang saudara-saudara mereka apabila (saudara-sau dara) mereka itu berpelayaran di bumi atau jadi tentara: \"Kalau mereka tinggal bersama kita, tentu mereka tidak mati dan tidak terbunuh.\" (Yang demikian ialah) karena Allah hendak jadikan yang tersebut itu satu duka cita di hati mereka dan Allah itu menghidupkan dan mematikan; dan Allah amat Melihat apa yang kamu kerjakan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang tidak beriman kepada qadha' dan qadar-Nya. Lalu meninggal. Lalu terbunuh. Sehingga bertambahlah musibah mereka. Adapun orang-orang mukmin, mereka mengetahui bahwa hal itu terjadi dengan taqdir Allah, sehingga Allah memberikan hidayah dan meneguhkan hati mereka serta meringankan musibah tersebut. Oleh karena itu, diam di tempat tidaklah dapat menolak kematian."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 156",
    "description": "Usai menjelaskan peristiwa perang uhud, Allah lalu menjabarkan tuntunan yang harus diikuti oleh orang yang beriman. Wahai orangorang yang beriman! janganlah kamu seperti orang-orang kafir, yakni orang munafik yang mengatakan kepada saudara-saudaranya seketurunan maupun seiman, apabila mereka mengadakan perjalanan di bumi atau pergi berperang, sekiranya mereka tetap bersama kita, tidak ikut berperang, tentulah mereka tidak mati dan tidak terbunuh. Akibat perkataan yang demikian itu, Allah hendak menimbulkan rasa penyesalan yang besar di hati mereka. Allah menghidupkan dan mematikan siapa yang dikehendaki-Nya sesuai dengan ketetapan-Nya, dan Allah maha melihat apa yang kamu kerjakan, yang kamu tampakkan maupun yang kamu sembunyikansetelah diberikan tuntunan secara umum, ayat ini memberikan penegasaan kepada orang-orang yang beriman, dan sungguh, sekiranya kamu gugur di jalan Allah atau mati dengan sebab apa pun, sungguh, pastilah ampunan Allah dan rahmat-Nya lebih baik bagimu daripada apa, yakni harta rampasan, yang mereka, orang-orang kafir kumpulkan."
  }
]