[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan jika kalian terbunuh (wahai kaum Mukminin), sedangkan kalian tengah berjihad di jalan Allah atau kalian meninggal di tengah peperangan,pastilah Allah akan mengampuni dosa-dosa kalian dan merahmati kalian dengan rahmat di sisiNya,seingga kalian pun menggapai keberuntungan dengan memperoleh surga-surga yang penuh kenikmatan. Dan Itu lebih baik daripada dunia dan apa yang dikumpulkan oleh para penghuninya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "157. Dan sungguh jika kalian -wahai orang-orang mukmin- terbunuh atau meninggal dunia di jalan Allah, niscaya Allah akan memberikan ampunan yang sangat besar bagi kalian, dan akan melimpahkan kasih sayang-Nya kepada kalian. Dan itu lebih baik bagi kalian dibanding dunia ini beserta seluruh kenikmatan sementara yang bisa dikumpulkan oleh para penduduknya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "157. Allah menegaskan: “Jika kalian terbunuh di jalan Allah atau datang kepada kalian kematian sedangkan kalian berniat untuk berperang, maka Allah akan mengampuni dan mengasihi kalian, sehingga kalian akan meraih surga. Dan ia lebih baik daripada kenikmatan dunia yang dikumpulkan manusia.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "157. وَلَئِن قُتِلْتُمْ (Dan sungguh kalau kamu gugur) Yakni dalam berjihad. أَوْ مُتُّمْ (atau meninggal) Yakni dalam safar atau yang lain. لَمَغْفِرَةٌ مِّنَ اللهِ وَرَحْمَةٌ خَيْرٌ مِّمَّا يَجْمَعُونَ (tentulah ampunan Allah dan rahmat-Nya lebih baik (bagimu) dari harta rampasan yang mereka kumpulkan) Yakni keutamaan mati atau terbunuh di jalan Allah dan kelebihan keduanya dalam mengundang ampunan dan rahmat Allah lebih baik dari pada apa yang dikumpulkan orang-orang yang berupa harta dunia dan kenikmatannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "157 Dan sungguh kalau kamu gugur di jalan Allah atau meninggal wahai orang mukmin atau dalam perjalanan atau lainnya, tentulah ampunan Allah atas dosa-dosa kalian dan rahmat-Nya untuk memasukkan kalian dalam surga lebih baik bagimu daripada harta rampasan dunia beserta kenikmatannya yang mereka kumpulkan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh, jika kalian terbunuh di jalan Allah atau mati, sungguh ampunan Allah dan rahmatNya lebih baik daripada apa yang mereka kumpulkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "157. Kemudian Allah mengabarkan bahwa terbunuh di jalanNya atau mati padaNya, bukanlah suatu kekurangan maupun sesuatu yang harus dikhawatirkan, namun hal itu adalah suatu perkara yang seharusnya menjadi sesuatu yang diperlombakan oleh orang-orang yang berlomba, karena merupakan sebab yang menghasilkan dan menyampaikan kepada ampunan Allah dan rahmatNya. Dan hal itu adalah lebih baik daripada sesuatu yang dikumpulkan oleh penghuni dunia berupa harta dunia."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 157: Dan sesungguhnya jika kamu terbunuh di jalan Allah atau kamu mati, maka keampunan dari Allah dan rahmat itu lebih baik daripada apa yang mereka kumpulkan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dalam ayat ini dan ayat setelahnya, Allah Subhaanahu wa Ta'aala memberitakan bahwa terbunuh dalam jihad atau di jalan Allah lainnya bukanlah merupakan kekurangan dan sesuatu yang ditakuti, karena hal itu menjadi sebab yang menyampaikan seseorang kepada ampunan Allah dan rahmat-Nya, dan yang demikian lebih baik dari harta yang dikejar-kejar dan dikumpulkan oleh manusia pada umumnya. Demikian juga bahwa manusia apabila mereka mati atau terbunuh, maka ia akan dikembalikan kepada Allah bagaimana pun keadaannya, lalu Dia akan memberikan balasan kepada mereka. Oleh karena itu, tidak ada jalan keluar selain kepada Allah, dan tidak ada perlindungan bagi makhluk kecuali perlindungan Allah Azza wa Jalla. Maksudnya: meninggal di jalan Allah bukan karena peperangan. Yakni harta dunia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 157",
    "description": "Setelah diberikan tuntunan secara umum, ayat ini memberikan penegasaan kepada orang-orang yang beriman, dan sungguh, sekiranya kamu gugur di jalan Allah atau mati dengan sebab apa pun, sungguh, pastilah ampunan Allah dan rahmat-Nya lebih baik bagimu daripada apa, yakni harta rampasan, yang mereka, orang-orang kafir kumpulkan. Dan sungguh, sekiranya kamu mati di rumah atau di mana pun, atau gugur dalam peperangan, pastilah kepada Allah kamu dikumpulkan untuk diberi balasan sesuai amal yang kamu kerjakan."
  }
]