[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan jika telah selesai ajal-ajal kalian di kehidupan dunia ini, lalu kalian meninggal di atas ranjang-ranjang kalian,atau kalian terbunuh di medan peperangan,pastilah hanya kepada Allah semata kalian akan dikumpulkan,lalu DIA membalas kalian menurut amal-amal kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "158. Dan sungguh jika kalian mati dalam kondisi apapun atau terbunuh, maka kepada Allah kalian semua akan dikembalikan untuk diberi balasan yang setimpal dengan amal perbuatan kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "158. Sungguh jika kalian mati atau berbunuh di jalan Allah, maka Dia tidak akan menyia-nyiakan amalan kalian. Kalian akan dikumpulkan kepada-Nya untuk mendapat balasan atas amalan kalian. Lihat: surat Ali Imran:169-171 dan surat al-Baqarah: 154."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "158. وَلَئِن مُّتُّمْ أَوْ قُتِلْتُمْ (Dan sungguh jika kamu meninggal atau gugur) Yakni dalam keadaan apapun. لَإِلَى اللهِ تُحْشَرُونَ(tentulah kepada Allah saja kamu dikumpulkan) Yang dimaksud adalah bukan kematian saudara-saudara kalian yang meninggal kemudian kalian berpisah tanpa ada pertemuan kembali, namun kalian akan di kumpulkan di hadapan Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "158 Dan sungguh jika kamu meninggal atau gugur di dalam perjalanan atau dalam berjuang di jalan Allah atau lainnya, tentulah kepada Allah saja kamu dikumpulkan di akhirat untuk di timbang dan diberi balasan, atau bahwa kematian sebagian saudara kalian tidak menghalangi kalian untuk tetap bertemu di akhirat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh, jika kalian mati atau gugur, pastilah kepada Allah kalian dikumpulkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "158. Dan bahwa makhluk itu, bila meninggal atau terbunuh dengan kondisi apa pun itu, maka sesungguhnya tempat kembali mereka hanyalah kepada Allah dan tempat bersandar mereka hanyalah kepadaNya. Lalu Allah akan membalas setiap orang menurut perbuatannya, maka kemana pun pelarian itu, kecuali pasti kepada Allah saja. Dan tidaklah ada tempat berpegang bagi makhluk kecuali dengan berpegang teguh dengan tali agama Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 158: Dan sesungguhnya jika kamu mati atau terbunuh, maka kepada Allah-lah akan dikumpulkan kamu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 158",
    "description": "Dan sungguh, sekiranya kamu mati di rumah atau di mana pun, atau gugur dalam peperangan, pastilah kepada Allah kamu dikumpulkan untuk diberi balasan sesuai amal yang kamu kerjakansetelah memberi kaum mukmin tuntunan secara umum, Allah lalu memberi tuntunan secara khusus dengan menyebutkan karunianya kepada nabi Muhammad. Maka berkat rahmat yang besar dari Allah, engkau berlaku lemah lembut terhadap mereka yang melakukan pelanggaran dalam perang uhud. Sekiranya engkau bersikap keras, buruk perangai, dan berhati kasar, tidak toleran dan tidak peka terhadap kondisi dan situasi orang lain, tentulah mereka menjauhkan diri dari sekitarmu. Karena itu maafkanlah, hapuslah kesalahan-kesalahan mereka dan mohonkanlah ampunan kepada Allah untuk mereka, dan bermusyawarahlah dengan mereka dalam urusan itu, yakni urusan peperangan dan hal-hal duniawi lainnya, seperti urusan politik, ekonomi, dan kemasyarakatan. Kemudian, apabila engkau telah membulatkan tekad untuk melaksanakan hasil musyawarah, maka bertawakAllah kepada Allah, dan akuilah kelemahan dirimu di hadapan Allah setelah melakukan usaha secara maksimal. Sungguh, Allah mencintai orang yang bertawakal."
  }
]