[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka dengan rahmat dari Allah kepadamu dan kepada para sahabatmu (wahai Nabi), Allah melimpahkan karuniaNYA padamu,sehingga kamu menjadi seorang yang lembut terhadap mereka. Seandainya kamu orang yang berperilaku buruk,dan berhati keras,pastilah akan menjauh sahabat-sahabatmu dari sekelilingmu.Maka janganlah kamu hukum mereka atas tindakan yang muncul dari mereka pada perang uhud.Dan mintakanlah kepada Allah (wahai nabi), supaya mengampuni mereka.Dan bermusyawarahlah dengan mereka dalam perkara-perkara yang kamu membutuhkan adanya musyawarah.Kemudian apabila kamu telah membulatkan tekad untuk menjalankan satu urusan dari urusan-urusan,(setelah bermusyawarah),maka jalankanlah dengan bergantung kepada Allah semata. Sesungguhnya Allah menyukai orang-orang yang bertawakal kepadaNYA."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "159. Maka disebabkan oleh rahmat yang besar dari Allah-lah akhlak kamu -wahai Nabi- menjadi lunak kepada sahabat-sahabatmu. Seandainya engkau menunjukkan sikap kasar dalam ucapan dan tindakanmu, serta mempunyai hati yang keras, niscaya mereka akan pergi meninggalkanmu. Oleh karena itu maafkanlah kekurangan mereka dalam bersikap kepadamu. Mohonkanlah ampunan untuk mereka dan Allah. Bermusyawarahlah dengan mereka untuk membahas masalah-masalah yang perlu dimusyawarahkan. Kemudian apabila kamu sudah bertekad melakukan sebuah keputusan setelah bermusyawarah, maka kerjakanlah dan berserah dirilah kepada Allah. Sesungguhnya Allah menyukai orang-orang yang berserah diri kepada-Nya, dan Dia memberikan bimbingan serta dukungan-Nya kepada mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "159. Hai Rasulullah, karena rahmat dari Allah yang Dia jadikan dalam hatimu, kamu menjadi lembut dan pemaaf kepada para sahabatmu. Andai kamu adalah orang yang kasar tabiatnya dan keras hatinya niscaya mereka akan menghindar darimu. Maafkanlah kesalahan mereka pada perang Uhud, dan mintakanlah mereka ampunan dari Allah, serta bermusyawarahlah dengan mereka dalam masalah-masalah penting. Jika kamu telah bertekat melakukan sesuatu setelah bermusyawarah, maka lakukanlah itu dengan penuh tawakkal kepada Allah. Allah menyukai orang-orang yang bertawakkal, Dia akan mencukupkan segala kebutuhan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "159. فَبِمَا رَحْمَةٍ مِّنَ اللهِ (Maka disebabkan rahmat dari Allah-lah) Yakni rahmat untuk kalian dan untuk mereka (orang-orang beriman). لِنتَ لَهُمْ ۖ( kamu berlaku lemah lembut terhadap mereka) Yakni kamu bersikap lembut terhadap mereka. Dan yang dimaksud adalah kelembutan dari Rasulullah terhadap mereka adalah kerena rahmat Allah yang begitu agung yang diberikan untuk membantu Rasulullah sebagai penyatu hati para sahabatnya dan pelurus urusan agama. فَظًّا (bersikap keras) Makna (الفظ) adalah keras lagi bengis dan akhlak yang dibenci. غَلِيظَ الْقَلْبِ (lagi berhati kasar) Yakni hati yang kasar, tanpa rasa kasihan dan tak memiliki kemauan berbaik hati. لَانفَضُّوا۟ مِنْ حَوْلِكَ ۖ( tentulah mereka menjauhkan diri dari sekelilingmu) Yakni menjauh darimu dan berpencar. فَاعْفُ عَنْهُمْ(Karena itu maafkanlah mereka) Dalam hal yang berurusan dengan hak-hakmu. وَاسْتَغْفِرْ لَهُمْ(mohonkanlah ampun bagi mereka) Yakni kepada Allah dalam hal yang berurusan dengan hak Allah. وَشَاوِرْهُمْ فِى الْأَمْرِ ۖ (dan bermusyawaratlah dengan mereka dalam urusan itu) Yakni mereka yang mendatangimu dalam urusan yang layak untuk kamu musyawarahkan atau dalam urusan perang, karena itu memperbaiki fikiran mereka dan menarik kecintaan mereka serta sebagai pengajaran bagi umat setelahmu tentang disyariatkannya bermusyawarah. Yang dimaksud dengan musyawarah adalah bukan dalam urusan yang syariat yang telah jelas didalamnya. Hal ini mewajibkan bagi para pemimpin agar bermusyawarah dengan para ulama dalam hal yang belum mereka ketahui dan yang mereka bingungkan dalam urusan agama, dan bermusyawarah dengan para panglima perang dalam hal yang berhubungan dengan peperangan, dan dengan para pemuka masyarakat dalam hal kemaslahatan masyarakat, dan dengan para sekertaris, pegawai, dan Menteri dalam hal yang berhubungan dengan kemaslahatan dan pemakmuran negara. Imam Qurthuby menyebutkan bahwa tidak ada perselisihan diantara para ulama tentang wajibnya mencopot pemimpin yang tidak bermusyawarah dengan para alim ulama. فإذا عزمت فتوكل على الله (maka apabila kamu telah memantapkan hatimu maka bertawakkal-lah kepada Allah) Yakni dalam menjalankan hal itu."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). { فَبِمَا رَحْمَةٍ مِنَ اللَّهِ لِنْتَ لَهُمْ } Ayat ini menunjukkan bahwa kelemah lembutan Rasulullah kepada orang-orang yang melanggar perintahnya dan berpaling dari peperangan; sesungguhnya itu hanyalah rahmat dari Allah, dan patutlah Allah mendapat pujian dari Nabi-Nya atas keridhoan-Nya kepada beliau dengan memberikan kebaikan dari kelembutan Nabi kepada orang-orang beriman, dan Allah juga pantas mendapat pujian dari orang-orang beriman, dan sesungguhnya kelembutan Rasulullah tidak lain adalah pengaruh dari kasih sayang Allah. 2 ). Ibnu 'Aqil mengatakan tentang ayat ini : { وَلَوْ كُنْتَ فَظًّا غَلِيظَ الْقَلْبِ لَانْفَضُّوا مِنْ حَوْلِكَ } Inilah Rasulullah, pada kebenaran dapat dilihat maka seandainya saja bukan karena akhlaq karimah yang ada pada dirinya, sungguh mereka akan menjauh darinya, maka tidaklah baik jika seseorang hanya puas dengan ilmu yang ada pada dirinya, tanpa menghiasinya dengan akhlaq yang baik, sebagaimana yang dicontohkan oleh Rasulullah. 3 ). Apakah pantas bagi seorang mukmin kepada Allah dan Rasul-Nya, dan mengaku ikut kepada beliau, berlaku buruk kepada orang-orang beriman, berperilaku kejam, berhati keras, dan berucap yang tidak terpuji ?! 4 ). Hasan al-Bashri berkata : Allah memerintahkan nabi-Nya untuk bermusyawarah, demi Allah tidaklah Nabi ketika bermusyawarah melainkan Allah memberinya petunjuk yang lebih baik dari apa yang dihadirkan oleh hatinya. 5 ). { وشاورهم في الأمر } Allah memerintahkan Nabi-Nya (dan beliau adalah manusia yang paling sempurna akalnya) agar beliau bermusyawarah, karena sesungguhnya manusia, sekalipun dia telah mencapai derajat akal yang yang paling tinggi, sesungguhnya mereka masih butuh dengan ide-ide orang lain, karena akal manusia terkadang ia jenius dalam satu hal, tetapi terkadang pula ia buntuh pada pemecahan perkara ian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "159 Wahai rasul, sesungguhnya kemudahan dan kelapangan dada dalam berinteraksi dengan kaummu tidak lain disebabkan rahmat dari Allah yang ditanamkan dalam hatimu. Agar kamu berlaku lemah lembut terhadap mereka dalam menyebarkan agama. Sekiranya kamu bersikap keras lagi berhati kasar atau buruk perangai, keras hati, tentulah mereka menjauhkan diri dari sekelilingmu. Karena itu maafkanlah mereka, mohonkanlah ampun bagi mereka, dan bermusyawarahlah dengan mereka dalam urusan agama dan dunia tentang segala yang tidak bertentangan dengan syariat atau yang belum diturunkan dalam wahyu. Kemudian apabila kamu telah membulatkan tekad setelah bermusyawarah, maka bertawakkallah dengan menyerahkan semua urusan kepada Allah. Sesungguhnya Allah menyukai orang-orang yang bertawakkal dan menyerahkan urusannya kepada-Nya. Tawakkal adalah menyerahkan segala urusan kepada Allah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka berkat rahmat} sebab rahmat {dari Allah kamu berlaku lemah lembut terhadap mereka} kamu berlaku lemah lembuh kepada mereka {Seandainya kamu bersikap kasar} kasar perkataaannya {dan berhati keras} berhati keras {tentulah mereka akan menjauh} mereka akan menghindar {dari sekitarmu. Jadi maafkanlah mereka} biarkanlah mereka {mohonkanlah ampunan untuk mereka, dan bermusyawarahlah dengan mereka dalam segala urusan. Kemudian, apabila kamu telah membulatkan tekad, bertawakallah kepada Allah. Sesungguhnya Allah mencintai orang-orang yang bertawakal"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "159. Maksudnya, disebabkan rahmat Allah kepadamu dan kepada para saahabatmu, maka Allah telah memberikan karuniaNya atasmu agar engkau berlaku lemah lembut dan bersikap sopan santun kepada mereka, mengasihi mereka, berakhlak baik pada mereka, hingga mereka berkumpul di sekelilingmu, mencintaimu, dan menaati perintahmu. “Sekiranya kamu bersikap keras, ” maksudnya, berahklak buruk, ”lagi berhati keras, ”tentulah mereka menjauh dari diri dari sekelilingmu, ” karena sikap seperti ini membuat mereka lari dan benci kepada orang orang yang memiliki akhlak yang jelek. Ahklak yang baik merupakan pokok ajaran dalam agama yang akan menarik menusia kepada agama Allah dan membuat mereka senang kepadanya, disamping ada yang diadapatkan oleh pelakunya berupa pujian dan pahala yang khusus. Dan sebaliknya, akhlak yang bruk merupakan masalah yang pokok dalam agama yang menjauh kan manusia dalam agama dan membuat mereka benci kepadanya di samping oleh apa yang di peroleh para pelakuanya celaan dan hukuman yang khusus. Maka Rasul yang ma'sum ini Allah telah firmankan kepadanya seperti itu lalu bagaimana dengan selainya? Bukankah menjadi sesuatu yang wajib dan paling penting dalan mencontoh akhlak-akhlak beliau yang mulia, dan bermuamalah dengan menusia sebagaimana Rasululloh bermuamalah dengan mereka dengan cara yang lembut, dengan akhlak yang yang baik dan penyatuan hati, sebagai suatu sikap taat kepada perintah Allah dan daya tarik bagi hamba-hamba Allah kepada agama Allah? Kemudian Allah memerintahkan NabiNya untuk memaafkan mereka dari kelalaian yang terjadi pada mereka terhadap hak-hak beliau dan agar beliau memohonkan ampunan bagi mereka atas kelalaian merreka kepada hak-hak Allah, hingga Nabi menyatukan para pemberi maaf dan berbuat baik. “Dan bermusyawarahlah dengan mereka dalam urusan itu, ” yaitu perkara-perkara yang membutukan bermusayawarah, tukar pikiran dan pendapat. Karena di dalam musyawarah itu terdapat faidah yang banyak dalam maslahat agama maupun dunia yang tidak mungkin di batasi, di antaranya; 1. Bahwasanya musyawarah itu termasuk ibadah-ibadah untuk mendekatkan diri kepada Allah. 2. Bahwasanya di dalam permusyawarahan itu terdapat toleransi untuk mencurahkan ide mereka dan menghilangkan ketidak enakan yang ada dalam hati mereka terjadi berbagai peristiwa. orang-orang yang memiliki kekuasaan atas orang lain apabila mengumpulkan para cendikiawan dan tokoh masyarakat, niscaya hati mereka akan tenang dan mereka akan mencintainya dan kemudian mereka mengetahui bahwa dia tidak berbuat sewenang-wenang kepada mereka, akan tetapi dia memandang kepada kemaslahatan umum bagi seluruh masyarakat. 3. Dalam bermusyawarah terdapat pencerahan pikiran, di sebabkan pengaktipan akal pada objek peruntukannya hingga menjadi suatu tambahan bagi objek akal. 4. Apa yang diahasilkan dari musyawarah adalah dari pikiran yang matang, karena seorang yang bermusyawarah hampir-hampir tidak membuat salah dalam pelaksanaanya, dan apabila terjadi kesalahan atau tidak sempurna sebagaimana yang di inginkan, maka ia tidak akan dicela. Maka apabila Allah memerintahkan kepada rosul (padahal rosul adalah orang yang paling sempurna akalanya) dengan perintah \"dan bermusyawarahla dalam segala urusan\", maka bagaimana dengan selain rosul? Kemudian Allah berfirman, ”Kemudian apabila kamu telah membulatkan tekad, ” yaitu suatu perkara atas bermusyawarah padanya, apabila di butuhkan, ”maka bertakwalah kepada Allah, ” maksudnya bersandar kepada upaya Allah dan keutamaanya, dan berlepas dirilah dari memampuan dan kekuatan dirimu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 159: Maka dengan rahmat dari Allahlah engkau telah berlaku lembut kepada mereka, karena jika engkau kasar, keras hati, niscaya mereka berpecah dari sekelilingmu; lantaran itu, ampunkanlah mereka, dan mintakanlah ampun untuk mereka, dan ajaklah mereka bermusyawarah di dalam urusan itu, lantas apabila engkau telah teguh hati, maka bertawakkallah kepada Allah, karena sesungguhnya Allah itu cinta kepada mereka yang bertawakal"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Berdasarkan ayat ini, maka di antara sarana dakwah yang ampuh, yang dapat menarik manusia ke dalam agama Allah adalah akhlak mulia, di samping adanya pujian dan pahala yang istimewa bagi pelakunya. Karena tidak sempurna memenuhi hak Beliau shallallahu 'alaihi wa sallam. Hal ini merupakan sikap ihsan. Oleh karena itu, Beliau menggabung antara sikap memaafkan dan sikap ihsan. Maksudnya: dalam urusan yang butuh adanya musyawarah, pemikiran yang matang dan pandangan yang tajam. Misalnya dalam urusan peperangan dan hal-hal duniawiyah lainnya, seperti urusan politik, ekonomi, kemasyarakatan dan lain-lain. Musyawarah memiliki banyak faedah dan maslahat duniawi maupun agama, antara lain: - Musyawarah termasuk ibadah yang mendekatkan diri seseorang kepada Allah. - Di dalamnya terdapat sikap menghargai pendapat orang lain, sehingga mereka menjadi senang kepada kita. - Dapat menyatukan visi dan misi. - Menerangi akal-fikiran. - Menutupi kekurangan yang ada pada orang lain. - Membuahkan keputusan yang bijak, tepat dan benar. Hal itu, karena hampir tidak ditemukan ada keputusan yang salah dalam musyawarah. Setelah bermusyawarah. Bersandarlah dengan kemampuan dan kekuatan Allah; tidak mengandalkan kemampuan kamu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 159",
    "description": "Setelah memberi kaum mukmin tuntunan secara umum, Allah lalu memberi tuntunan secara khusus dengan menyebutkan karunianya kepada nabi Muhammad. Maka berkat rahmat yang besar dari Allah, engkau berlaku lemah lembut terhadap mereka yang melakukan pelanggaran dalam perang uhud. Sekiranya engkau bersikap keras, buruk perangai, dan berhati kasar, tidak toleran dan tidak peka terhadap kondisi dan situasi orang lain, tentulah mereka menjauhkan diri dari sekitarmu. Karena itu maafkanlah, hapuslah kesalahan-kesalahan mereka dan mohonkanlah ampunan kepada Allah untuk mereka, dan bermusyawarahlah dengan mereka dalam urusan itu, yakni urusan peperangan dan hal-hal duniawi lainnya, seperti urusan politik, ekonomi, dan kemasyarakatan. Kemudian, apabila engkau telah membulatkan tekad untuk melaksanakan hasil musyawarah, maka bertawakAllah kepada Allah, dan akuilah kelemahan dirimu di hadapan Allah setelah melakukan usaha secara maksimal. Sungguh, Allah mencintai orang yang bertawakal ayat sebelumnya diakhiri dengan perintah bertawakal kepada Allah, satu-satunya penentu keberhasilan dan kegagalan. Jika Allah menolong kamu, maka tidak ada siapa pun dan apa pun yang dapat mengalahkanmu, tetapi jika Allah membiarkan kamu, tidak memberi pertolongan, maka siapa yang dapat menolongmu setelah itu' pasti tidak ada. Karena itu, hendaklah kepada Allah saja orang-orang mukmin bertawakal, mengakui kelemahan diri di hadapan Allah setelah melakukan usaha secara maksimal."
  }
]