[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka hamba-hamba Allah yang bertakwa mengatakan: “Sesungguhnya kami telah beriman kepada Mu dan mengikuti Rasul Mu Muhammad , maka hapuslah dari kami dosa-dosa yang telah kami perbuat dan selamatkanlah kami dari siksa neraka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Penghuni surga itu ialah orang-orang yang memanjatkan doa kepada Rabb mereka, “Ya Rabb kami, sesungguhnya kami beriman kepada-Mu dan kepada apa yang Engkau turunkan kepada rasul-rasul-Mu, serta mengikuti syariat-Mu, maka ampunilah dosa-dosa yang telah kami perbuat dan hindarkanlah kami dari azab neraka.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "16-17. termasuk dari sifat orang-orang yang bertakwa adalah senantiasa berdoa kepada Allah: “Wahai Tuhan kami, kami beriman kepada-Mu, maka janganlah Engkau menyiksa kami akibat dosa-dosa kami, dan selamatkanlah kami dari azab neraka”. Dan orang-orang yang bertakwa ini selalu sabar atas cobaan yang ada, jujur dalam perkataan dan perbuatannya, mentaati Allah, menginfakkan harta mereka secara terang-terangan dan sembunyi-sembunyi, dan memohon ampunan dari Tuhan mereka pada waktu sahur di akhir malam."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16 Sifat-sifat orang yang bertakwa adalah adalah mereka yang beriman kepada Allah dan rasul-Nya, meminta ampunan atas dosa-dosa mereka dan meminta untuk dijauhkan dari azab neraka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang berdoa, “Wahai Tuhan kami, sesungguhnya kami benar-benar telah beriman. Maka ampunilah dosa-dosa kami dan selamatkanlah kami dari azab neraka.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "16. Maksudnya, orang-orang yang ilmunya mendalam itu adalah ulama dan ahli iman, di mana mereka bertawasul dengan keimanan mereka itu kepada TUhan mereka demi meraih ampunan atas dosa-dosa mereka dan pemeliharaan mereka dari siksa neraka. Hal-hal yang seperti ini adalah di antara sarana yang dicintai oleh Allah dari seorang hamba yang bertawasul kepada Tuhannya dengan apa yang telah Dia karuniakan kepada hamba tersebut berupa keimanan dan amal-amal shalih hingga penyempurnaan kenikmatan atas dirinya yaitu dengan memperoleh pahala yang sempurna dan penghindaran dari siksaan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 16: Yaitu orang-orang yang berkata: Hai Tuhan Kami! Sesungguhnya kami telah beriman. Lantaran itu , ampunkanlah dosa-dosa kami dan peliharakanlah kami daripada siksa neraka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Baik kepada Engkau maupun kepada Rasul-Mu. Hal ini termasuk tawassul (memakai sarana) yang disyari'atkan dalam berdo'a, yaitu dengan menyebutkan iman dan amal shalih. Termasuk tawassul yang disyari'atkan adalah bertawassul dengan menyebut Asmaa'ul Husna, misalnya \"Yaa Ghaffaar (Maha Pengampun), ampunilah kami\"."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 16",
    "description": "Setelah ayat sebelumnya menjelaskan bahwa Allah mengetahui siapa yang berhak memperoleh keberuntungan besar, yakni orangorang bertakwa, maka ayat ini menjelaskan ciri-cirinya. Yaitu orangorang yang berdoa, ya tuhan kami, kami benar-benar beriman terhadap apa yang engkau serukan kepada kami, maka ampunilah dosa-dosa kami atas ketidakmampuan kami untuk me-ngendalikan hawa nafsu kami, sehingga kurang menghiraukan seruan-Mu, baik yang disengaja maupun yang tidak disengaja, dan lindungilah kami, dengan segala kekurangan dan dosa-dosa kami, dari azab neraka. Mereka itu adalah orang-orang yang sabar, baik dalam menjalankan ketaatan, di saat tertimpa musibah, maupun dalam meninggalkan larangan, orang-orang yang benar dalam sikap dan perkataannya, orangorang yang senantiasa dalam ke-taat-an secara khusyuk, orang-orang yang selalu menginfakkan harta mereka, baik pada saat lapang maupun sempit (lihat: surah a'li imra'n/3: 134) dan orang-orang yang senantiasa memohon ampunan terutama pada waktu sebelum fajar yakni masuknya waktu subuh."
  }
]