[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Jika Allah menolong kalian dengan kemenangan dan pertolonganNYA,maka tidak ada seorangpun yang dapat mengalahkan kalian.Dan jka DIA mengabaikan kalian,maka siapakah gerangan yang mampu untuk menolong kalian setelah DIA membiarkan kalian? Dan hanya kepada Allah saja,hendaknya orang-orang mukmin bertawakal."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "160. Apabila Allah mendukung kalian dengan memberikan bantuan dan pertolongan-Nya, maka tidak ada seorang pun yang dapat mengalahkan kalian, sekalipun seluruh penduduk bumi bergabung untuk melawan kalian. Dan apabila Dia tidak menolong kalian dan menyerahkan urusan kalian kepada diri kalian sendiri, maka tidak ada seorang pun yang dapat menolong kalian selain Allah. Karena kemenangan ada di tangan Allah semata, maka hanya kepada Allah-lah hendaknya orang-orang yang beriman bersandar, bukan kepada yang lain."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "160. Hai orang-orang beriman, jika Allah membela kalian dengan pertolongan-Nya dalam melawan musuh maka tidak akan ada yang mampu mengalahkan kalian. Namun jika Allah membiarkan kalian tanpa pertolongan-Nya maka kalian tidak akan mendapatkan orang yang dapat menolong kalian. Dan kepada Allah-lah orang-orang beriman bersandar."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "160. إِن يَنصُرْكُمُ اللهُ فَلَا غَالِبَ لَكُمْ ۖ (Jika Allah menolong kamu, maka tak adalah orang yang dapat mengalahkan kamu) Maka berlindung dan tawakkal-lah kepada-Nya dan percayakan urusan kalian kepada-Nya. وَإِن يَخْذُلْكُمْ(jika Allah membiarkan kamu) Yakni dengan membiarkan tidak menolong kalian atas musuh-musuh kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "160 Jika Allah menolong kamu dengan pertolongan-Nya seperti pada perang Badar, maka tak ada orang yang dapat mengalahkan kamu. Bertawakkallah kalian dan teguhlah. Jika Allah membiarkan kamu dengan tidak memberi pertolongan sebagaimana dalam perang Uhud, maka siapakah gerangan yang dapat menolong kamu selain Allah sesudah itu? Karena itu hendaklah kepada Allah saja orang-orang mukmin bertawakkal dan menyandarkan segala urusannya. Allah adalah sumber pertolongan setelah melakukan sebab dan persiapan serta usaha yang lazim."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika Allah menolong kalian} menyelamatkan kalian {tidak ada yang dapat mengalahkan kalian} tidak ada satupun yang bisa menaklukkan kalian {dan jika Dia membiarkan kalian} tidak menolong kalian {maka siapa yang dapat menolong kalian setelah itu} setelah pembiaranNya kepada kalian {Jadi hanya kepada Allahlah orang-orang mukmin bertawakal"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "160. Maksudnya apabila Allah membantu kalian dengan pembelaan dan pertolonganya, ”maka tidak ada orang yang dapat mengalahkanmu, ” walaupun orang yang ada di setiap penjuru berkumpul untuk mengalahkan kalian dengan segala sesuatu yang mereka miliki berupa jumlah pasukan dan perlengkapan, karena tidak ada orang yang dapat mengalahkannya. Allah telah menguasai hamba-hambaNya dan telah mengandalikan hidup mereka, dan tidaklah ada seekor hewan melatapun yang bergerak melainkan atas izinNya dan tidak pula diam melainkan dengan izinNya. “jika Allah membiarkanmu tidak memberi pertolongan, ” maksudnya membuat diri kalian bersandar pada diri kalian sendiri, ”maka siapakah gerangan yang dapat menolongmu dalam keadan itu, ” Maka pastilah kalian akan terlantar walaupun seluruh makhluk menolong kalian. Dalam ayat ini terkandung perintah untuk meminta pertolongan dan bergantung hanya kepada Allah, dan berlepas diri dari segala daya upaya dan kekuatan diri. Kerenanya Allah berfirman \"dan kepada Allahlah bertawakkal orang-orang yang beriman\", didahulukan ma'mulnya sebagai Batasan bahwa hanya kepada Allah saja bertawakkal, tidak kepada selainNya. Karena sudah pada tahu bahwa hanya Dialah satu-satunya sang penolong, maka bergantung kepadanya adalah bukti tauhid yang dituju, dan bergantung kepada selainNya adalah perbuatan syirik yang tidak mendatangkan manfaat bagi pelakunya bahkan mendatang madhorot baginya. Ayat ini mengandung perintah untuk bertawakal kepada Allah semata, dan bahwasanya sebesar kadar keimanan seoranb hamba, maka sebesar itulah kadar tawakalnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 160: Jika Allah mau menolong kamu, maka tidak ada siapa pun yang bisa mengalahkan kamu; dan jika la mau mengalahkan kamu, maka siapakah yang akan menolong kamu selain dari pada-Nya? Dan kepada Allah-lah hendaknya Mu'minin berserah diri!"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ketika menghadapi musuhmu, seperti dalam Perang Badar. Meskipun semua musuh berkumpul dengan jumlah yang besar lengkap dengan persenjataan. Menyerahkan kamu kepada dirimu sendiri. Yakni tidak ada lagi penolong bagimu. Dalam ayat ini terdapat perintah meminta pertolongan kepada Allah, bersandar kepada-Nya dan berlepas diri dari kekuatan dan kemampuan dirinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 160",
    "description": "Ayat sebelumnya diakhiri dengan perintah bertawakal kepada Allah, satu-satunya penentu keberhasilan dan kegagalan. Jika Allah menolong kamu, maka tidak ada siapa pun dan apa pun yang dapat mengalahkanmu, tetapi jika Allah membiarkan kamu, tidak memberi pertolongan, maka siapa yang dapat menolongmu setelah itu' pasti tidak ada. Karena itu, hendaklah kepada Allah saja orang-orang mukmin bertawakal, mengakui kelemahan diri di hadapan Allah setelah melakukan usaha secara maksimal ketika pasukan pemanah dalam perang uhud melihat ganimah yang ditinggalkan oleh pasukan kafir, mereka bergegas turun dari bukit untuk mengambilnya. Sebagian mereka mengira dan khawatir nabi muhammmad tidak membagikan ganimah kepada mereka. Lalu Allah menegaskan bahwa tidak mungkin seorang nabi berkhianat dalam urusan harta rampasan perang atau yang lainnya. Barang siapa berkhianat, dalam urusan apa pun, niscaya pada hari kiamat dia akan datang membawa dosa apa yang dikhianatkannya itu, dia akan sangat tersiksa karenanya. Kemudian setiap orang akan diberi balasan yang sempurna sesuai dengan apa yang dilakukannya ketika di dunia, dan mereka tidak dizalimi walau sedikit pun."
  }
]