[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan tidak pantas seorang nabi mengkhianati sahabat-sahabatnya dengan mengambil bagian dari harta rampasan selain apa yang Allah khususkan baginya. Dan barangsiapa melakukannya dari kalian,niscaya dia akan datang pada hari kiamat dengan memikul apa yang diambilnya itu,untuk dipermalukan dengan hal itu di tempat yang disaksikan seluruh makhluk. Kemudian tiap-tiap jiwa akan diberi balasan atas apa yang diusahakannya dengan penuh tanpa dikurangi dan dizhalimi."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "161. Tidak pantas bagi seorang Nabi berkhianat dengan cara mengambil ganimah (harta rampasan perang) selain apa yang Allah tetapkan baginya. Maka siapa saja di antara kalian yang berkhianat dengan cara mengambil sesuatu dari ganimah (secara ilegal), ia akan dihukum dan dipermalukan di muka umum kelak pada hari Kiamat. Ia akan datang dengan memikul apa yang diambilnya dari harta ganimah di depan mata semua makhluk. Kemudian setiap orang akan diberi balasan yang setimpal dengan apa yang telah diperbuatnya secara penuh, tanpa dikurangi sedikit pun. Mereka tidak akan dizalimi dengan cara ditambah keburukannya atau dikurangi kebaikannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "161. Allah menyucikan nabi-Nya dari sifat khianat dalam urusan harta ghanimah, beliau tidak akan mengambil selain yang Allah tetapkan baginya. Barangsiapa yang berkhianat dalam urusan harta ghanimah niscaya ia akan datang di hari kiamat terbelenggu oleh harta itu, kemudian setiap jiwa akan mendapat balasan atas amalannya dengan sempurna tanpa ada pengurangan sedikitpun. ‘Adiy bin ‘Umairah al-Kindi berkata, aku mendengar Rasulullah bersabda: “Barangsiapa yang kami pekerjakan dalam suatu pekerjaan kemudian ia menyembunyikan dari kami satu jarum atau lebih dari itu, maka ia akan membelenggunya pada hari kiamat.” ‘Adiy berkata, maka orang yang berkulit hitam dari kaum Anshar berdiri seakan-akan aku melihatnya sekarang sambil berkata: “Wahai Rasulullah, terimalah pekerjaan dariku.” Rasulullah menjawab: “Ada apa denganmu?” Lelaki itu berkata: “Aku pernah mendengarmu berkata begini dan begitu.” Beliau bersabda: “Dan aku sekarangpun mengatakan, Barangsiapa di antara kalian yang kami angkat untuk melakukan suatu pekerjaan, maka hendaklah ia mengerjakan pekerjaan itu, baik itu hal besarnya maupun hal kecilnya. Dan apa yang diberikan kepadanya makai a boleh mengambilnya, dan apa yang tidak boleh ia ambil hendaklah ia tidak mengambilnya. (as-shahih 3/1465 no. 1866, kitab al-imarah, bab keharaman hadiah untuk pekerja)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "161. وَمَا كَانَ لِنَبِىٍّ أَن يَغُلَّ ۚ (Tidak mungkin seorang nabi berkhianat dalam urusan harta rampasan perang) Tidak benar bahwa seorang nabi akan berkhianat dalam urusan harta rampasan perang kemudian mengambilnya untuk dirinya sendiri tanpa sepengetahuan para sahabatnya. Ada pendapat mengatakan bahwa ayat ini turun ketika ada salah satu harta rampasan berupa selendang merah yang hilang kemudian diantara mereka berkata: mungkin Rasulullah mengambilnya. Dalam ayat ini terdapat pensucian terhadap para nabi dari pengkhianatan dalam harta perang. Dan makna ghulul (الغلول) yakni apabila seseorang mengambil sesuatu dari harta kaum muslimin untuk dirinya sendiri, baik itu berupa harta rampasan, sedekah, atau hadiah padahal orang tersebut tidak memiliki hak didalamnya. Dan perbuatan ini haram dilakukan berdasarkan ayat ini. Suatu hari Rasulullah mencabut bulu dari punggung unta rampasan perang kemudian berkata: aku tidak mempunyai hak atas ini kecuali sebagaimana hak kalian atasnya. Janganlah kalian berbuat ghulul karena ia akan menjadi penghina baginya di hari kiamat. Tunaikanlah hak meski sebesar jarum dan benang atau yang diatas itu. وَمَن يَغْلُلْ يَأْتِ بِمَا غَلَّ يَوْمَ الْقِيٰمَةِ ۚ( Barangsiapa yang berkhianat dalam urusan rampasan perang itu, maka pada hari kiamat ia akan datang membawa apa yang dikhianatkannya itu) Potongan ayat ini terkandung didalamnya pengharaman ghulul dan peringatan darinya karena ia adalah dosa yang pelakunya akan dihukum secara terang-terangan dengan cara didatangkan di hari kiamat membawa apa yang dia berkhianat didalamnya sebelum dia dihisab dan disiksa. ثُمَّ تُوَفَّىٰ كُلُّ نَفْسٍ مَّا كَسَبَتْ (kemudian tiap-tiap diri akan diberi pembalasan tentang apa yang ia kerjakan dengan (pembalasan) setimpal) Yakni diberikan pahala apa yang dikerjakan secara sempurna baik itu yang baik atau yang buruk."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "161 Tidak mungkin seorang nabi berkhianat dalam urusan harta rampasan perang dengan mengambil bagian sebelum membaginya. Barangsiapa yang berkhianat dalam urusan rampasan perang itu, maka pada hari kiamat ia akan datang membawa apa yang dikhianatkannya itu untuk dihisab, kemudian tiap-tiap diri akan diberi pembalasan tentang apa yang ia kerjakan dengan pembalasan yang setimpal, sedang mereka tidak dianiaya sedikitpun berupa pengurangan pahala maupun penambahan siksa. Ibnu Abbas berkata bahwa ayat ini turun tentang Quthaifah Hamra, yang hilang ketika perang Badar, sebagian orang berkata bahwa mungkin rasul lah yang telah mengambilnya. Maka turunlah ayat ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidak layak seorang nabi menyelewengkan} berkhianat dengan mengambil sedikit dari harta rampasan dengan sembunyi-sembunyi {Siapa saja yang menyelewengkannya} berkhianat,{niscaya pada hari Kiamat dia akan datang membawa apa yang diselewengkannya} datang dengan sesuatu yang diambilnya itu dengan diletakkan di punggungnya {Kemudian setiap orang akan diberi balasan sesuai apa yang mereka usahakan dan mereka tidak dizalimi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "161. Berkhianat adalah menyembunyikan harta ghanimah dan berhianat kepada setiap harta yang di pegang oleh seseorang, ghulul ini dalah haram menurut ijma bahkan ia termasuk dalam dosa besar, sebagai mana yang di tunjukan oleh ayat yang mulia tersebut dan ayat-ayat lainnya dari nash-nash yang ada. Allah mengabarkan bahwasanya tidaklah patut dan tidak mungkin seorang Nabi itu melakukan khianat, karena berhianat itu sebagaimana yang telah anda ketahui termasuk dosa-dosa yang besar dan sejahat-jahatnya Aib. Sungguh Allah telah memleihara para nabinya dari segala hal yang mengotori dan menjatuhkan mereka, dan dia menjadikan mereka orang-orang yang terbaik akhlaknya di seluruh alam dan orang yang paling bersih jiwanya. Allah membersihkan, membaikan, dan menyucikan mereka sebagai tempat risalahnya dan kandungan hikmahnya \"Allah lebih mengetahui di mana Dia menempatkan tugas kerasulan\" -Al an’am : 124- Seorang hamba itu hanya cukup dengan mengetahui salah seorang dari mereka para nabi. niscaya dia akan memastikan keselamatan mereka dari setiap hal yang membuat mereka tercela, dan tidaklah di butuhkan dalil bantahan atas celaan yang dikatakan mereka dari musuh-musuh mereka. Karena pengetahuanya tentang kenabian mereka menuntut harusnya ada penolakan terhadap hal itu.Kemudian Allah membuat ancaman bagi orang yang berbuat khianat dalam firmanya, ”Barangsiapa bekhianat dalam urusan barang rampasan itu, maka pada hari kiamat dia akan datang dengan membawa sesuatu yang dikhianatkanya itu Maksudnya pembawa ghanimah itu membawanya dengan cara memikulnya di atas punggungnya, baik harta itu berupa hewan maupun barang atau selainya, dimana ia akan disiksa denganya pada hari kiamat. “Kemudian tiap-tiap diri akan di beri pembalasan tentang apa yang dia kerjakan pembalsan setimpal,” seorang yang berkhianat atau orang lain, masing-masing akan di berikan ganjaran atas dosanya, seukuran apa yang dikerjakanya, ”sedang mereka tidak dianiaya\" maksudnya, tidak di tambah kejelekan mereka dan tidak pula mengurang sedikitpun kebaikan mereka. Simaklah dengan baik perlindungan proteksi yang terkandung dalam ayat yang mulia tersebut, ketika Allah menyebutkan hukuman bagi orang-orang yang berkhianat, dan bahwa dia akan datang pada hari kiamat dengan membawa harta yang dikhianatinya itu, dan ketika Allah akan menyebutkan tentang balasannya. Tindakan Allah membatasi kepada pelaku ghulul mengisyaratkan bahwa selain orang tersebut dari berbagai pelaku kejahatan lainya, terkadang tidak di penuhi balasannya, maka Allah menyebutkanya dengan lafadz yang umum yang meliputi semua orang yang bekhianat dan selainya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 161: Dan menipu itu bukan (pekerjaan) seorang nabi, karena barangsiapa menipu, niscaya ia akan membawa apa yang ia tipu itu di hari Kiamat. Kemudian akan disempurnakan bagi tiap-tiap seorang apa yang telah ia kerjakan; dan mereka tidak akan dianiaya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Al Bazzar meriwayatkan dari Ibnu Abbas, tentang ayat di atas, ia berkata, \"Tidak pantas bagi para sahabat menuduh Beliau begitu (yakni berbuat ghulul).\" (Hadits ini dalam sanadnya Harun bin Musa Al Azdiy seorang ahli qira'at, ia ditsiqahkan oleh Ibnu Ma'in dan lainnya sebagaimana dalam Tahdzibuttahdzib). Karena khianat dalam urusan harta rampasan perang adalah haram, bahkan termasuk dosa besar. Tidak mungkinnya seorang nabi berbuat itu adalah karena Allah Subhaanahu wa Ta'aala telah menjaga para nabi-Nya dari segala cacat yang menodai kepribadiannya, menjadikan mereka manusia yang paling utama akhlaknya, paling bersih jiwanya. Oleh karenanya, Allah Subhaanahu wa Ta'aala mengangkatnya sebagai rasul-Nya. Di atas punggungnya. Baik orang yang berkhianat maupun lainnya akan diberi pahala atau dosa sesuai amal yang dikerjakannya. Keburukannya tidak ditambah dan kebaikannya tidak dikurangi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 161",
    "description": "Ketika pasukan pemanah dalam perang uhud melihat ganimah yang ditinggalkan oleh pasukan kafir, mereka bergegas turun dari bukit untuk mengambilnya. Sebagian mereka mengira dan khawatir nabi muhammmad tidak membagikan ganimah kepada mereka. Lalu Allah menegaskan bahwa tidak mungkin seorang nabi berkhianat dalam urusan harta rampasan perang atau yang lainnya. Barang siapa berkhianat, dalam urusan apa pun, niscaya pada hari kiamat dia akan datang membawa dosa apa yang dikhianatkannya itu, dia akan sangat tersiksa karenanya. Kemudian setiap orang akan diberi balasan yang sempurna sesuai dengan apa yang dilakukannya ketika di dunia, dan mereka tidak dizalimi walau sedikit pun. Di akhirat tidak ada sedikit pun perbuatan aniaya. Semua akan mendapat balasan amal perbuatannya secara adil. Maka adakah orang yang mengikuti keridaan Allah, sungguh-sungguh menjalankan perintahnya dan menjauhi larangan-Nya, sama dengan orang yang kembali dengan membawa kemurkaan besar dari Allah dan tempatnya di neraka jahanam' pasti tidak sama. Neraka jahanam itulah seburuk-buruk tempat kembali."
  }
]