[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidaklah sama orang yang keadaan niatnya adalah mencari keridahaan Allah dengan orang yang berkecimpung di dalam maksiat-maksiat yang membuat murka tuhannya,lalu dia berhak kerena itu umtuk tinggal di neraka Jahannam.Dan itulah seburuk-buruk tempat kembali."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "162. Tidaklah sama di sisi Allah status orang yang melakukan perbuatan yang mengundang rida Allah, yaitu iman serta amal saleh dan orang yang kafir kepada Allah serta berbuat buruk. Karena orang kafir akan mendapatkan murka Allah yang dahsyat dan tempat tinggalnya adalah neraka Jahanam. Dan neraka Jahanam itu adalah tempat kembali dan tempat tinggal yang paling buruk."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "162-163. tidak sama antara orang yang berusaha mencari keridhaan Allah sehingga mendapatkan surga, dengan orang yang berbuat dosa dan membuat Tuhannya murka, ia akan masuk ke neraka Jahannam, dan neraka adalah seburuk-buruk tempat kembali. Tempat tinggal mereka berdua berbeda, penghuni surga berada di derajat yang tinggi, sedangkan penghuni neraka berada di kerak neraka. Dari Abu Hurairah, Rasulullah bersabda: “Barangsiapa beriman pada Allah dan Rasul-Nya, menegakkan sholat, dan berpuasa Ramadhan, maka menjadi kewajiban Allah untuk memasukkannya ke dalam surga, baik dia itu berjihad di jalan Allah ataupun duduk di negrinya tempat kelahirannya.” Mereka berkata: Wahai Rasulullah, apakah tidak sebaiknya kami mengabari orang-orang dengan berita gembira ini?” Beliau bersabda: “Sesungguhnya di surga ada seratus derajat yang Allah sediakan untuk para mujahidin di jalan Allah, jarak antara dua derajat bagaikan antara langit dan bumi. Maka jika kalian minta pada Allah, mintalah pada-Nya Firdaus, karena sungguh dia itu pertengahan Jannah dan yang tertingginya.” –aku kira beliau bersabda:- “atapnya adalah ‘Arsy Ar-Rahman. Dan dari sana memancarnya sungai-sungai surga.” Muhammad bin Falih berkata, dari ayahnya: “Dan di atas surga firdaus adalah ‘Arsy ar-Rahman.” (shahih Bukhari, kitab jihad, bab derajat para mujahid di jalan Allah, no. 2790)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "162. أَفَمَنِ اتَّبَعَ رِضْوٰنَ اللهِ كَمَنۢ بَآءَ بِسَخَطٍ مِّنَ اللهِ (Apakah orang yang mengikuti keridhaan Allah sama dengan orang yang kembali membawa kemurkaan (yang besar) dari Allah) Yakni tidaklah orang yang mengikuti keridhaan Allah dalam perintah dan larangan-Nya --semisal para Nabi yang penuh bakti yang disucikan dari mengambil apa yang diharamkan Allah dengan sengaja- seperti orang yang melakukan ghulul dan kemaksiatan yang kembali kepada Allah dengan kemurkaan dari-Nya karena mereka melanggar apa yang diperintahkan dan apa yang dilarang -semisal melakukan ghulul-."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "162 Apakah orang yang mengikuti keridhaan Allah dengan melaksanakan perintah-Nya, menjauhi larangan-Nya dan mentaati Allah dan para Nabi itu sama dengan orang yang berpaling dan maksiat dan kembali membawa kemurkaan yang besar dari Allah dan tempatnya adalah Jahannam? Dan itulah seburuk-buruk tempat kembali yang telah menunggu mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah orang yang mengikuti ridha Allah sama dengan orang yang kembali} kembali {dengan membawa kemurkaan} dengan kemurkaan yang besar {dari Allah dan tempatnya adalah neraka Jahanam? Itulah seburuk-buruk tempat kembali"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "162-163. Allah memberitahukan bahwasanya tidaklah sama orang tujuan keridoaan RabbNya dan berbuat dengan amalan yang membuat RabbNya ridho, dengan orang tidak seperti itu dari kalangan orang-orang yang senang berbuat kemaksiatan dan hal-hal yang membuat tuhanNya murka. kedua orang seperti itu tidaklah sama hukumnya dihadapan Allah dan hikmahnya serta pada fitrah hamba-hamba Allah. \"Apakah orang-orang beriman itu sama dengan orang-orang yang fasik? Mereka tidak sama.\" –As-sajdah:18 – Krena itu Allah berfirman di sini, ”kedudukan mereka itu bertingkat-tingkat disisi Allah,” maksudnya, mereka itu berbeda-beda dalam setiap derajat yang tinggi, kedudukan, dan istana-istana, maka Allah memberikan kepada mereka karuniaNya dan kemuliaanNya menurut kadar mereka. sedangkan orang-orang yang mengikuti membuat Allah murka berusaha untuk turun ke kerak paling bawah neraka, maka setiap orang mendapatkan amal apa yang diperbuatNya. Dan Allah maha Melihat amal perbuatan mereka, tidak ada sesuatupun yang tersembunyi di hadapaNya, bahkan Allah telah mengetahuinya dan telah menetapkannya di lauhul mahfudz, dan dia menugaskan kepada para malaikatnya yang mulia lagi terpercaya menuliskannya, menyimpannya serta memeliharanya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 162: Apakah orang yang menurut keridlaan Allah itu serupa orang yang kembali dengan kemurkaan dari Allah, padahal tempat kembalinya itu jahanam, sedang ia itu sejahat-jahat tempat kembali?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Orang yang niatnya mencari keridaan Allah dan mengerjakan amalan yang mendatangkan keridaan-Nya. Karena maksiat dan berkhianat. Tentu tidak sama baik menurut hukum Allah, hikmah (kebijaksanaan) Allah maupun fitrah yang ada dalam diri manusia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 162",
    "description": "Di akhirat tidak ada sedikit pun perbuatan aniaya. Semua akan mendapat balasan amal perbuatannya secara adil. Maka adakah orang yang mengikuti keridaan Allah, sungguh-sungguh menjalankan perintahnya dan menjauhi larangan-Nya, sama dengan orang yang kembali dengan membawa kemurkaan besar dari Allah dan tempatnya di neraka jahanam' pasti tidak sama. Neraka jahanam itulah seburuk-buruk tempat kembali kedudukan mereka itu, yakni orang yang mengikuti keridaan Allah dan menghuni surga bertingkat-tingkat di sisi Allah, sesuai dengan tingkat ketakwaan mereka, dan Allah maha melihat apa yang mereka kerjakan, ucapkan, dan sembunyikan."
  }
]