[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Para penghuni surga yang mengikuti semua yang mendatangkan keridhaan Allah memiliki tingkatan-tingkatan derajat, Sedangkan para penduduk neraka yang mengikuti hal-hal yang menyebabkan ke murkaan Allah,mereka berada di tingkat dasar yang berbeda-beda.Mereka tidak sama.Dan Allah maha melihat perbuatan-perbuatan mereka,tidak ada sesuatupun yang tersembunyi bagiNYA."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "163. Derajat mereka di sisi Allah di dunia dan akhirat berbeda-beda. Dan Allah Maha Mengetahui apa yang mereka perbuat. Tidak ada sesuatupun yang luput dari pengetahuan-Nya. Dan Dia akan memberikan balasan kepada setiap orang menurut amal perbuatannya masing-masing."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "163. هُمْ دَرَجٰتٌ عِندَ اللهِ ۗ ((Kedudukan) mereka itu bertingkat-tingkat di sisi Allah) Yakni derajat orang yang mengikuti keridhaan Allah tidak seperti derajat orang yang kembali kepada Allah dengan kemurkaan dari-Nya, karena golongan yang pertama berada di derajat yang paling tinggi adapun golongan kedua berada di derajat yang paling rendah."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Berlomba-lomba dalam meraih derajat tertinggi dalam ujian, dan pemanfaatan waktu yang baik, serta memwujudkan segala tujuan dalam meraih tingkatan paling tinggi, harus menjadi pendukung untuk menggapai hasil yang paling baik bukan sekedar kesaksian di atas kertas, begitupun ketika seseorang mengharap kebaikan dari Allah, ia harus mendambakan syurganya yang luasnya seluas langit dan bumi, bahkan tidakalah impian seseorang yang paling tinggi kecuali mengharap Jannah Firdaus dari tuhannya, perhatikanlah ayat ini : { هم درجات عند الله } 2 ). Seorang wanita yang baru saja memeluk islam, tentang ayat al-Qur’an yang menjadi penyebab utama ia yakni dengan keislamannya, dia kemudian berkata : surah Ali ‘imran ayat 163 : { هُمْ دَرَجَاتٌ عِنْدَ اللَّهِ ۗ وَاللَّهُ بَصِيرٌ بِمَا يَعْمَلُونَ } semoga Allah membalas kita dengan kebaikan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "163 Kedudukan mereka di akhirat itu bertingkat-tingkat di sisi Allah berdasarkan amal mereka, derajat orang yang mendapatkan keridhaan tidak sama dengan mereka yang mendapatkan kemurkaan Allah. Dan Allah Maha Melihat atas apa yang mereka kerjakan dan akan memberi balasan baik atau buruk"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka memiliki beberapa tingkat} mereka memiliki beberapa tingkat yang berbeda {di sisi Allah. Allah Maha Melihat apa yang mereka kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "162-163. Allah memberitahukan bahwasanya tidaklah sama orang tujuan keridoaan RabbNya dan berbuat dengan amalan yang membuat RabbNya ridho, dengan orang tidak seperti itu dari kalangan orang-orang yang senang berbuat kemaksiatan dan hal-hal yang membuat tuhanNya murka. kedua orang seperti itu tidaklah sama hukumnya dihadapan Allah dan hikmahnya serta pada fitrah hamba-hamba Allah. \"Apakah orang-orang beriman itu sama dengan orang-orang yang fasik? Mereka tidak sama.\" –As-sajdah:18 – Krena itu Allah berfirman di sini, ”kedudukan mereka itu bertingkat-tingkat disisi Allah,” maksudnya, mereka itu berbeda-beda dalam setiap derajat yang tinggi, kedudukan, dan istana-istana, maka Allah memberikan kepada mereka karuniaNya dan kemuliaanNya menurut kadar mereka. sedangkan orang-orang yang mengikuti membuat Allah murka berusaha untuk turun ke kerak paling bawah neraka, maka setiap orang mendapatkan amal apa yang diperbuatNya. Dan Allah maha Melihat amal perbuatan mereka, tidak ada sesuatupun yang tersembunyi di hadapaNya, bahkan Allah telah mengetahuinya dan telah menetapkannya di lauhul mahfudz, dan dia menugaskan kepada para malaikatnya yang mulia lagi terpercaya menuliskannya, menyimpannya serta memeliharanya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 163: Mereka itu (terbagi) beberapa derajat pada sisi Allah, karena Allah itu Melihat apa-apa yang mereka kerjakan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sesuai amal yang mereka kerjakan. Orang yang mencari keridaan Allah berusaha menggapai derajat dan kedudukan yang tinggi, sehingga Allah memberikannya kepada mereka karena karunia dan kepemurahan-Nya sesuai amal yang mereka kerjakan. Adapun orang-orang yang mengerjakan amalan yang mendatangkan kemurkaan Allah, maka sesungguhnya mereka berlomba-lomba untuk turun ke bawah sampai ke bagian yang paling bawah sesuai amalnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 163",
    "description": "Kedudukan mereka itu, yakni orang yang mengikuti keridaan Allah dan menghuni surga bertingkat-tingkat di sisi Allah, sesuai dengan tingkat ketakwaan mereka, dan Allah maha melihat apa yang mereka kerjakan, ucapkan, dan sembunyikan. Usai menjelaskan anugerah-Nya berupa tingkatan penghuni surga, dalam ayat ini Allah menyebut anugerah-Nya kepada kaum mukmin di dunia. Sungguh, Allah telah memberi karunia kepada orang-orang beriman ketika Allah mengutus seorang rasul di tengah-tengah mereka dari kalangan mereka sendiri, yakni dari jenis manusia dan dari bangsa arab; dialah nabi Muhammad yang membacakan kepada mereka ayat-ayat-Nya, baik dalam bentuk wahyu yang diturunkan maupun yang terbentang di alam raya, menyucikan jiwa mereka dari berbagai penyakit hati, dan mengajarkan kepada mereka kitab Al-Qur'an dan hikmah, yakni sunah atau kemahiran melakukan hal yang bermanfaat dan menolak mudarat, meskipun sebelumnya, yakni sebelum pengutusan nabi Muhammad, mereka benar-benar dalam kesesatan yang nyata, yakni dalam kekafiran."
  }
]