[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ataukah ketika kalian (wahai kaum mukminin), ditimpa musibah, yaitu apa yang menimpa kalian berupa kekalahan di perang uhud,sungguh kalian tela menimpakan kekalahan dua kali lipat terhadap kaum musyrikin pada perang badar, kalian berkata dengan penuh keheranan, ”Bagaimana (kekalahan) ini bisa terjadi,padahal kami adalah kaum muslimin dan rasulullah bersama kami,sedangkan mereka adalah orang-orang musyrik?.” Katakanlah kepada mereka (wahai nabi), ”apa yang menimpa kalian itu datang dari diri kalian sendiri,disebabkan pelanggaran kalian terhadap perintah rasul kalian dan ketertarikan kalian untuk mengumpulkan harta rampasan.Sesungguhnya Allah melakukan apa yang DIA kehendaki dan menetapkan apa saja yang DIA inginkan.Tidak ada satupun yang sanggup menggagalkan ketetapanNYA."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "165. Apabila kalian -wahai orang-orang mukmin- ditimpa musibah, ketika kalian mengalami kekalahan dalam perang Uhud dan sebagian dari kalian tebunuh dalam perang tersebut, sesungguhnya kalian telah mendapatkan dua kali lipat dari musuh kalian, dalam hal jumlah korban tewas dan tawanan perang dalam perang Badar. Lalu kalian berkata, “Dari mana datangnya musibah (kekalahan) ini, sedangkan kita adalah orang-orang beriman, dan Nabiyyullāh berada di tengah-tengah kita?” Katakanlah -wahai Nabi-, “Musibah (kekalahan) itu datang dari diri kamu sendiri. Yaitu tatkala kalian berselisih paham dan tidak patuh pada perintah Rasulullah. Sesungguhnya Allah Mahakuasa atas segala sesuatu. Dia menolong siapa saja yang Dia kehendaki, dan dapat menelantarkan siapa saja yang Dia kehendaki."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "165. Apakah kalian menjadi gelisah ketika kalian mendapat musibah terbunuhnya 70 pasukan pada perang Uhud, padahal kalian pada perang Badar dapat membunuh 70 musuh dan menawan 70 orang lainnya. Mengapa kalian merasa heran dan bertanya: “Mengapa kita mengalami kekalahan ini?” Jawablah pertanyaan mereka hai Rasulullah: “Musibah itu berasal dari kalian sendiri karena melanggar perintah Rasulullah. Allah Maha Kuasa atas segalanya, Dia melakukan apa yang Dia kehendaki.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "165. أَوَلَمَّآ أَصٰبَتْكُم مُّصِيبَةٌ (Dan mengapa ketika kamu ditimpa musibah (pada peperangan Uhud)) Yakni kekalahan dan pembunuhan yang menimpa mereka di perang Uhud. قَدْ أَصَبْتُم مِّثْلَيْهَا(padahal kamu telah menimpakan kekalahan dua kali lipat kepada musuh-musuhmu) Yakni pada perang Badar; pada saat perang Uhud kaum muslimin yang terbunuh sebanyak 70 orang, dan pada perang Badar kaum musyrikin yang terbunuh 70 orang dan yang disandera sebanyak 70 orang. أَنَّىٰ هٰذَا ۖ (“Darimana datangnya (kekalahan) ini?”) Yakni darimana datangnya kekalahan dan pembunuhan yang menimpa kita ini, padahal kita berperang di jalan Allah dan Rasulullah bersama kita, dan Allah telah menjanjikan kepada kita kemenangan atas orang-orang kafir. قُلْ هُوَ مِنْ عِندِ أَنفُسِكُمْ ۗ (Katakanlah: “Itu dari (kesalahan) dirimu sendiri”) Yakni karena pelanggaran yang dilakukan pasukan pemanah atas perintah Nabi agar tetap pada tempat yang telah ditentukan untuk mereka dan tidak meninggalkan tempat itu bagaimanapun keadaannya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Banyak yang salah memahami dan menyikapi keimanan mereka kepada qada’ dan qadar, maka ketika mereka tertimpa musibah mereka berkata “ini adalah qada’ dan qadar” sehingga mereka lalai dari sebab-sebab yang menjadikan musibah itu terjadi, sedangkan manhaj qur’an mengajarkan bagaimana kita melihat kepada sebab-sebab kejadian itu agar kita mampu terhindar dari musibah, Bersama dengannya keimanan kepada qada’ dan qadar tetap terjamin, Allah berfirman : { أَوَلَمَّا أَصَابَتْكُمْ مُصِيبَةٌ قَدْ أَصَبْتُمْ مِثْلَيْهَا قُلْتُمْ أَنَّىٰ هَٰذَا ۖ قُلْ هُوَ مِنْ عِنْدِ أَنْفُسِكُمْ ۗ إِنَّ اللَّهَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ } . 2 ). Jika kita melihat bagaimana Yahudi menguasai bangsa arab saat ini, kita akan menemukan dari diri mereka sendiri jawaban seperti yang dikatakan kepada kaum muslimin yang ikut serta dalam perang uhud : { قل هو من عند أنفسكم }, dan jika kita melihat kepada keadaan bangsa arab saat ini, kita akan menemukan bahwa sebab kerugian dan keterpurukan mereka adalah diri mereka sendiri; diantara mereka ada yang memohon dan meminta kepada selain Allah, dan diantara mereka juga ada yang tidak mendirikan shalat dan tidak pula megeluarkan zakat, diantara mereka orang-orang yang tidak lagi mengamalkan syari’at ini, maka jika satu maksiat saja yang menjadi sebabt kehancuran itu lalu bagaimana dengan maraknya kemaksiatan di negara-negara arab saat ini ? 3 ). { قل هو من عند أنفسكم } Ayat ini (dengan cepatnya) membatalkan teori konspirasi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "165 Atau ketika kalian ditimpa musibah pada perang Uhud dengan terbunuhnya 70 orang darimu, padahal kamu telah menimpakan kekalahan dua kali lipat kepada musuh-musuhmu pada peperangan Badar. Kalian berkata: “Darimana datangnya kekalahan ini? Dan rasul juga bersama kami” Katakanlah kepada mereka wahai Nabi: “Itu bersumber dari kesalahan dirimu sendiri yaitu karena tidak taat dan membangkang perintah”. Sesungguhnya Allah Maha Kuasa atas segala sesuatu ataupun segala keadaan. Ayat ini turun sebagai akibat dari orang-orang muslim atas perbuatan mereka pada perang Uhud, para pemanah meninggalkan pos mereka di atas gunung dan membangkang atas perintah pemimpin perang yaitu Nabi,"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apakah ketika} apakah ketika {kalian ditimpa musibah} pada perang Uhud dengan terbunuhnya 70 orang di antara kalian {padahal kalian telah memperoleh (kemenangan) dua kali lipatnya hal itu} pada Perang Badar dengan membunuh 70 dan menawan 70 di antara mereka, {kalian berkata, “Dari mana datangnya ini?”} bagaimana hal ini bisa menimpa kita, sedangkan kita adalah orang-orang muslim dan Rasulullah bersama kita {Katakanlah, “Itu berasal dari diri kalian sendiri.” Sesungguhnya Allah Maha kuasa atas segala sesuatu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "165. Ini merupakan hiburan dari Allah bagi hamba-hambaNya yang beriman ketika mereka menderita kekalahan yang telah mereka rasakan pada perang Uhud, dan telah terbunuh dari mereka kira-kira tujuh puluh orang, lalu Allah berfirman, “Kamu telah menimpakan” terhadap kaum musyrikin, “(kekalahan) dua kali lipat” pada perang Badar. Kalian membunuh sekitar tujuh puluh orang dari pembesar-pembesar mereka dan menawan tujuh puluh lagi dari mereka. Maka hendaklah peristiwa itu menjadi terasa enteng dan musibah tersebut menjadi ringan atas kalian. Dan bersama itu kalian tidaklah sama dengan mereka, karena orang-orang yang terbunuh dari kalian itu berada di surga, sedang mereka di neraka. “Kamu berkata, ‘Darimana datangnya (kekalahan) ini?” maksudnya, darimana datangnya derita yang telah kita rasakan itu dan darimana kita dikalahkan? “Katakanlah, ‘Itu dari (kesalahan) dirimu sendiri’ , “ ketika kalian berselisih dan bermaksiat setelah Allah memperlihatkan kepada kalian sesuatu yang kalian sukai. Maka kembalikanlah celaan itu pada diri kalian sendiri dan waspadalah dari sebab-sebab yang menghancurkan. “Sesungguhnya Allah Mahakuasa atas segala sesuatu.” Janganlah kalian berburuk sangka kepada Allah, karena Allah Mahakuasa untuk menolong kalian. Akan tetapi Dia memiliki hikmah yang paling sempurna dalam ujian dan musibah kalian tersebut, \"dan sekiranya Allah menghendaki, niscaya Allah dapat membalas mereka, akan tetapi hal itu agar Allah menguji sebagian kalian dengan sebagian lainnya.\""
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 165: Apakah di waktu kamu kena satu kecelakaan telah dapat kemenangan dua kali itu kamu berkata: \"Dari mana ini?'\" Katakanlah: \"Yang demikian itu dari diri-diri kamu sendiri.\" Sesungguhnya Allah itu Berkuasa atas tiap-tiap suatu. padahal kamu telah dapat kemenangan dua kali."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini merupakan hiburan dari Allah kepada hamba-hamba-Nya yang mukmin, ketika mereka tertimpa musibah kekalahan dalam Perang Uhud. Imam Ahmad meriwayatkan dari Umar bin Khaththab radhiyallahu 'anhu ia berkata, \"Ketika akan terjadi perang Badar, Nabi shallallahu 'alaihi wa sallam memperhatikan para sahabatnya yang jumlahnya tiga ratus orang lebih, dan memperhatikan kaum musyrik yang jumlahnya seribu orang lebih. Maka Nabi shallallahu 'alaihi wa sallam menghadap ke kiblat dan mengangkat tangannya yang ketika itu selendang dan kain berada di pundaknya, Beliau berdoa, \"Ya Allah, manakah janji yang Engkau janjikan. Ya Allah, penuhilah janji Engkau kepadaku. Ya Allah, sesungguhnya jika Engkau membinasakan rombongan kaum muslimin ini, maka Engkau tidak akan disembah lagi di bumi.\" Beliau senantiasa memohon kepada Tuhannya Azza wa Jalla dan berdoa sampai selendangnya jatuh, lalu Abu Bakar datang dan mengambilkan selendangnya kemudian menaruh kembali, lalu memeluknya dari belakang. Kemudian Abu Bakar berkata, \"Wahai Nabi Allah, cukuplah permohonanmu kepada Tuhanmu, Dia akan memenuhi janji-Nya kepadamu.\" Ketika itulah Allah menurunkan ayat, \"(Ingatlah), ketika kamu memohon pertolongan kepada Tuhanmu, lalu diperkenankan-Nya bagimu: \"Sesungguhnya Aku akan mendatangkan bala bantuan kepada kamu dengan seribu Malaikat yang datang berturut-turut.\" (Al Anfaal: 9) Ketika pasukan bertemu, maka Allah mengalahkan kaum musyrik. Tujuh puluh orang di antara mereka terbunuh, sedangkan tujuh puluh orang lagi tertawan. Maka Rasulullah shallallahu 'alaihi wa sallam bermusyawarah dengan Abu Bakar, Ali dan Umar radhiyallahu 'anhum, lalu Abu Bakar berkata, \"Wahai Rasulullah, mereka adalah putera-putera pamanmu, keluarga dan saudara. Menurutku, Engkau ambil saja tebusan dari mereka, sehingga apa yang kita ambil dapat memperkuat kita melawan orang-orang kafir, dan mudah-mudahan Allah memberi mereka hidayah sehingga mereka menjadi penolong kita.\" Rasulullah shallallahu 'alaihi wa sallam kemudian berkata, \"Apa pendapatmu wahai Ibnul Khaththab, \" Aku (Umar) menjawab, \"Demi Allah, pendapatku tidak seperti pendapat Abu Bakar. Menurutku, Engkau serahkan fulan yang menjadi kerabat Umar, lalu aku penggal lehernya. Engkau serahkan kepada Ali si 'Uqail, agar Ali memenggal lehernya, dan Engkau serahkan fulan yang menjadi saudara Hamzah kepada Hamzah agar ia memenggal lehernya, agar Allah mengetahui bahwa tidak ada lagi dalam hati kita sikap lembut kepada kaum musyrik. Mereka adalah pahlawan, tokoh dan pemimpin mereka (kaum musyrik).\" Nampaknya Rasulullah shallallahu 'alaihi wa sallam lebih suka pendapat Abu Bakar radhiyallahu 'anhu dan tidak suka pendapatku, maka Beliau mengambil tebusan dari mereka. Pada esok harinya, Umar berkata, \"Aku pergi mendatangi Rasulullah shallallahu 'alaihi wa sallam, ternyata Beliau sedang duduk, demikian pula Abu Bakar radhiyallahu 'anhu, dan ternyata keduanya menangis. Aku pun berkata, \"Wahai Rasulullah, beritahukanlah kepadaku apa yang membuat Engkau dan kawanmu menangis. Jika aku menemukan sebab menangis, maka aku akan menangis, tetapi jika aku tidak temukan, maka aku akan memaksakan diri menangis karena engkau berdua menangis.\" Nabi shallallahu 'alaihi wa sallam bersabda, \"Orang yang menawarkan tebusan kepada tawananmu, sesungguhnya telah menawarkan untuk diazab yang lebih dekat dari pohon ini kepada pehon terdekatnya.\" Allah Azza wa Jalla menurunkan ayat, \"Tidak patut, bagi seorang Nabi mempunyai tawanan sebelum ia dapat melumpuhkan musuhnya di muka bumi. …sampai ayat, \"Kalau sekiranya tidak ada ketetapan yang telah terdahulu dari Allah, niscaya kamu ditimpa siksaan yang besar karena apa yang kamu ambil.\" (Terj. Al Anfaal: 67-68) Yakni berupa tebusan. Setelah itu, Allah menghalalkan ghanimah kepada mereka. Di tahun depan, yaitu pada peperangan Uhud, mereka mendapat hukuman karena perbuatannya pada peperangan Badar, yaitu karena mengambil tebusan. Oleh karena itu, tujuh puluh di antara mereka terbunuh, dan para sahabat Nabi shallallahu 'alaihi wa sallam melarikan diri dari Nabi shallallahu 'alaihi wa sallam, sedangkan gigi Beliau pecah, demikian pula penutup kepala Beliau, serta mengalir darah pada wajah Beliau, maka Allah menurunkan ayat, \"Dan mengapa kamu (heran) ketika ditimpa musibah (kekalahan pada Perang Uhud), padahal kamu telah menimpakan musibah dua kali lipat \" Yakni dengan mengambil pula tebusan. (Hadits ini para perawinya adalah para perawi kitab shahih, Ibnu Katsir dan As Suyuthi menyandarkannya kepada Ibnu Abi Hatim, namun menyebutkan secara secara ringkas.\") Dengan terbunuhnya 70 orang di kalangan kamu. Dengan membunuh 70 orang dan menawan 70 orang dari kalangan mereka. Di samping itu, orang-orang yang terbunuh dari kalangan tempatnya di surga, sedangkan orang-orang yang terbunuh dari kalangan mereka tempatnya di neraka. Oleh karena itu, jauhilah bersangka buruk kepada Allah, karena Dia sesungguhnya mampu menolong kamu, akan tetapi Dia memiliki hikmah mengapa menguji kamu dan menimpakan musibah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 165",
    "description": "Setelah dijelaskan bahwa diutusnya nabi Muhammad adalah karunia Allah yang sangat besar bagi umat manusia, lalu dijelaskan tentang adanya kemenangan dan kekalahan dalam peperangan sesuai dengan ketaatan terhadap hukum kemasyarakatan. Dan mengapa kamu heran ketika ditimpa musibah kegagalan pada perang uhud dengan gugurnya 70 orang dari pasukan mukmin, padahal kamu telah menimpakan musibah dua kali lipat kepada musuh-Musuhmu pada perang badar, kini kamu berkata, dari mana datangnya kekalahan ini' katakanlah, itu dari kesalahan dirimu sendiri karena kamu meninggalkan tuntunan rasulullah agar pasukan pemanah tidak meninggalkan tempat hingga peperangan selesai. Sungguh, Allah mahakuasa atas segala sesuatu. Selain kelalaian yang membuat umat islam terpukul mundur pada perang uhud, masih ada faktor lain yang menyebabkannya. Dan apa yang menimpa kamu berupa kekalahan ketika terjadi pertemuan antara dua pasukan yaitu kaum muslim dengan kaum musyrik pada perang uhud, semua itu adalah dengan izin atau takdir Allah, sebagai ujian bagi umat islam dan agar Allah menguji siapa orang yang benar-benar beriman dan tulus dalam berjuang di jalan Allah, dan siapa di antara mereka yang tidak tulus dalam berjuang."
  }
]