[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apa yang terjadi pada kalian berupa luka dan terbunuh pada perang uhud pada hari bertemunya golongan mukminin dan golongan musyrikin, lalu pada awalnya kemenangan menjadi milik kaum mukminin,dan kemudian pada akhirnya menjadi milik kaum musyrikin, maka semua itu terjadi sesuai ketetapan Allah dan takdirNYA, dan supaya menjadi tampak jelas apa yang telah diketahui Allah sejak azali, supaya bias memisahkan orang orang yang jujur (keimannanya) diantara kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "166. Pembunuhan, luka-luka, dan kekalahan yang menimpa kalian dalam perang Uhud tatkala pasukan kalian bertemu dengan pasukan orang-orang musyrik, itu terjadi dengan izin dan ketentuan Allah, untuk sebuah hikmah yang sangat penting, sehingga terlihat jelas siapakah orang-orang yang beriman dengan sungguh-sungguh."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "166-167. Allah menjelaskan beberapa hikmah yang didapat dari kekalahan pada perang Uhud: “Korban luka dan terbunuh dari pasukan kalian adalah ketetapan dan takdir Allah untuk membedakan antara orang yang benar-benat mukmin dengan orang yang munafik.” Terbongkarlah aib orang-orang munafik ketika orang-orang beriman berkata kepada mereka: “Kemarilah pergi berjihad di jalan Allah, dan tambahlah jumlah pasukan muslimin.” Mereka menjawab: “Andai kami tau kalian memerangi musuh niscaya kami akan berangkat berperang dengan kalian.” Ketika mereka mengatakan ini hati mereka lebih dekat kepada kekafiran daripada kepada keimanan, sebab mereka hanya menampakkan keimanan di lidah mereka dan menyembunyikan kekafiran dalam hati mereka. Dan Allah Maha Mengetahui apa yang mereka sembunyikan dalam hati. Yang dimaksud di sini adalah pada perang Uhud. Lihat: Ali Imran: 172-174."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "166. يَوْمَ الْتَقَى الْجَمْعَانِ (pada hari bertemunya dua pasukan) Yakni apa yang menimpa kalian di perang uhud berupa korban jiwa, luka-luka, dan kekalahan. فَبِإِذْنِ اللهِ (maka (kekalahan) itu adalah dengan izin Allah) Yakni dengan qadha dan qadar yang telah ditentukan Allah. Dan pendapat lain mengatakan yakni dengan Allah membiarkan kalian berperang dengan mereka tanpa memberi pertolongan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "166. Dan apa yang kalian terima berupa kematian, luka dan kekalahan pada hari bertemunya pasukan mukmin dan musyrik di perang Uhud adalah dengan ketentuan dan takdir Allah, supaya Dia bisa menunjukkan kepada kalian tentang orang-orang mukmin yang benar-benar beriman dan bersabar"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apa yang menimpa kalian} apa yang terjadi pada kalian berupa kematian, luka, dan kekalahan {pada hari ketika dua pasukan bertemu} pasukan muslim dan pasukan musyrik pada hari perang Uhud {itu atas izin Allah dan agar Dia mengetahui siapa orang beriman} supaya Allah bisa memberi pengetahuan orang-orang yang beriman di dunia tentang pemberian balasan sebagaimana Dia telah mengetahui secara ghaib sebelum Dia memberi beban kepada mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "166-167. Kemudian Allah mengabarkan bahwasanya yang menimpa mereka saat bertemunya kedua pasukan; pasukan kaum Muslimin dan pasukan kaum musyrikin di Uhud berupa kematian dan kekalahan, adalah dengan izinNYa, Qadha’ dan QadarNYa; tidak ada tempat pelarian baginya, dan itu pasti terjadi. Perkara takdir apabila telah terlaksana, maka tidak ada lagi cara kecuali (hanya) menerimanya dan bahwa Allah menetapkan hal itu atas dasar hikmah yang agung dan faidah yang besar, dan bahwa dengan hal itu akan jelas orang Mukmin dari orang munafik, yaitu orang-orang yang bila diperintah untuk ikut berperang, “dan kepada mereka dikatakan, ‘ Marilah berperang di jalan Allah’ ,” yaitu, demi membela agama Allah dan melindunginya serta mengharap keridhaan Allah, “atau pertahankanlah (dirimu),” kehormatan dan negeri kalian apabila kalian tidak memiliki niat yang shalih, maka mereka enggan ikut berperang dan membuat alasan. “Mereka berkata, ‘Sekiranya kami mengetahui akan terjadi peperangan, tentulah kami mengikutimu’ ,” maksudnya, sekiranya kami mengetahui bahwasanya akan terjadi peperangan antara kalian dan mereka, niscaya kami akan mengikuti kalian berperang. Tetapi sebenarnya mereka pendusta dalam hal itu. Sungguh mereka telah yakin dan paham, dan setiap orang mengetahui bahwa kaum musyrikin telah dipenuhi oleh dengki dan kebencian terhadap kaum Muslimin, dan bahwa mereka telah mengerahkan harta benda mereka, dan mereka telah mengumpulkan pasukan sekuat tenaga untuk menghancurkan kaum Muslimin di negeri mereka dengan semangat yang menyala-nyala untuk memerangi mereka. Barangsiapa yang kondisinya seperti ini, bagaimana bisa tidak tergambar bahwa tidak akan terjadi perang antara mereka dengan kaum Mukminin? Khususnya (alasan) bahwa kaum Muslimin telah (terlanjur) keluar dari Madinah (meninggalkan mereka), dan menghadapi mereka (kafir Quraisy). Ini merupakan suatu alasan yang mustahil, akan tetapi orang-orang munafik menyangka bahwa alasan tersebut melegakkan kaum MUkminin. Allah berfirman, “Mereka pada hari itu kepada kekafiran” yaitu pada saat mereka tidak berjihad bersama kaum Mukminin, “lebih dekat kepada kekafiran daripada keimanan. Mereka mengatakan dengan mulut mereka perkataan yang tidak terkandung dalam hati mereka.” Ini adalah ciri khas orang-orang munafik, mereka tampakkan pada lisan dan perbuatan mereka apa yang bertentangan dengan yang ada dalam hati dan dada mereka. Di antaranya adalah perkataan mereka, “Sekiranya kami mengetahui akan terjadi peperangan, tentulah kami mengikuti kamu.” Sesungguhnya mereka sebenarnya telah mengetahui akan terjadinya peperangan. Ayat ini menjadi dalil atas sebuah kaidah “melakukan kemudaratan yang lebih kecil dari dua kemudaratan,” untuk menolak kemudaratan yang lebih besar dan melakukan kemaslahatan yang lebih kecil dari dua kemaslahatan karena ketidakmampuan melakukan kemaslahatan yang lebih besar, karena kaum munafik itu telah diperintahkan untuk berperang demi agama, dan bila mereka tidak melakukannya maka diperintahkan untuk mempertahankan keluarga dan negeri. “Dan Allah lebih mengetahui apa yang mereka sembunyikan,” maka Allah tampakkan semua itu bagi hamba-hambaNya yang beriman, lalu Allah menghukum mereka atas hal tersebut."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 166: Dan apa yang telah mengenai kamu pada hari bertemu dua tentara itu, adalah dengan izin Allah, dan karena Allah hendak buktikan (iman) orang-orang Mu'min."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Berupa kekalahan dan terbunuh. Yakni pada Perang Uhud. Taqdir jika berjalan, maka tidak ada yang dapat menolaknya, sikap yang harus dilakukan adalah tunduk dan menerima. Apalagi, Allah tidaklah menaqdirkan sesuatu kecuali karena hikmah dan faedah yang besar. Di antara hikmahnya adalah dengan ketetapan itu, nampak jelaslah siapa orang mukmin dan siapa orang munafik."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 166",
    "description": "Selain kelalaian yang membuat umat islam terpukul mundur pada perang uhud, masih ada faktor lain yang menyebabkannya. Dan apa yang menimpa kamu berupa kekalahan ketika terjadi pertemuan antara dua pasukan yaitu kaum muslim dengan kaum musyrik pada perang uhud, semua itu adalah dengan izin atau takdir Allah, sebagai ujian bagi umat islam dan agar Allah menguji siapa orang yang benar-benar beriman dan tulus dalam berjuang di jalan Allah, dan siapa di antara mereka yang tidak tulus dalam berjuang. Dan panggilan untuk berjuang itu selain untuk menguji keimanan umat islam, juga untuk menguji orang-orang yang munafik sehingga dapat diketahui kemunafikannya dengan nyata. Kepada mereka dikatakan, marilah berperang di jalan Allah atau pertahankanlah dirimu, keluargamu, dan harta kekayaanmu serta negerimu. Mereka berkata dengan nada mengejek nabi dan orang-orang mukmin yang ikut berjuang, sekiranya kami mengetahui bagaimana cara berperang menghadapi musuh yang cukup banyak dengan pasukan yang banyak pula, sehingga dengan jumlah itu kita dapat mengalahkan mereka, tentulah kami mengikuti kamu. Tetapi jika jumlah kita lebih sedikit, itu berarti kita membinasakan diri sendiri, karena itu sebaiknya kita mundur. Mereka pada hari itu lebih dekat kepada kekafiran daripada keimanan karena tujuan mereka berperang semata-mata hanya ingin mendapatkan ganimah, bukan untuk mengharap imbalan dari Allah. Mereka mengatakan dengan mulutnya apa yang tidak sesuai dengan isi hatinya. Dan Allah lebih mengetahui apa yang mereka sembunyikan dalam hati mereka secara rinci dan detail tentang kemunafikan mereka."
  }
]