[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan supaya DIA mengetahui orang-orang munafik yang telah Allah buka tabir yang ada di dalam hati mereka ketika kaum mukminin berkata kepada mereka,”kemarilah berperang bersama kami di jalan Allah,atau jadilah kalian penolong kami dengan memperbanyak jumlah personel kami.” Mereka malah menjawab, ”seandainya kami tahu kalian akan memerangi seseorang,pastilah kami akan bersama kalian untuk mengahadapi mereka.” Pada hari tersebut,mereka itu lebih dekat kepada kekafiran daripada kepada keimanan. Karena sesungguhnya mereka itu mengatakan dengan mulut mereka sesuatu yang bukan berada dalam hati mereka. Dan Allah lebih mengetahui apa yang mereka sembunyikan di dalam hati mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "167. Dan supaya terlihat jelas siapakah orang-orang munafik ketika dikatakan kepada mereka, “Berperanglah kalian di jalan Allah, atau bertahanlah untuk memperbanyak jumlah kaum muslimin!” Mereka berkata, “Seandainya kami tahu bahwa kegiatan kalian ini adalah perang sebagaimana perang yang semestinya, tentu kami akan mengikuti kalian. Akan tetapi kami tidak melihat akan terjadi perang antara kalian dengan mereka.” Kondisi mereka ketika itu lebih menunjukkan kedekatan mereka kepada kekafiran daripada keimanan. Lisan mereka mengatakan sesuatu yang tidak ada di dalam hati mereka. Allah Maha Mengetahui apa yang mereka sembunyikan di dalam hati mereka. Dan Dia akan menghukum mereka atas perbuatan tersebut."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "167. وَلِيَعْلَمَ الَّذِينَ نَافَقُوا۟ ۚ (Dan supaya Allah mengetahui siapa orang-orang yang munafik) Yang dimaksud dengan mengetahui disini adalah membedakan dan menunjukkan. Dan yang dimaksud dengan orang-orang munafik disini adalah Abdullah bin Ubay bin Salul dan para sahabatnya. Dari Ibnu Shuhaib dan lainnya mengatakan: Rasulullah keluar menuju perang Uhud dengan seribu pasukan dari para sahabatnya, pada saat mereka sampai pada Syauth, tempat antara Uhud dan Madinah, Abdullah bin Ubay mengelabuhi sepertiga pasukan dengan perkataan: dia menuruti mereka dan menyelisihiku padahal demi Allah aku tidak tahu untuk apa kita membunuh diri kita di tempat ini? Lalu dia kembali dengan pengikutnya yang merupakan orang-orang munafik dan orang-orang yang memiliki keraguan. تَعَالَوْا۟ قٰتِلُوا۟ فِى سَبِيلِ اللهِ (Marilah berperang di jalan Allah) Yakni jika kalian termasuk orang yang beriman kepada Allah dan hari akhir. أَوِ ادْفَعُوا۟ ۖ( atau pertahankanlah) Yakni pertahankanlah diri, keluarga, dan tempat tinggal kalian jika kalian tidak beriman kepada Allah dan hari akhir. Pendapat lain mengatakan yang dimaksud adalah pertahankanlah dari belakang kami dan jangan kalian pergi berperang. Dan pendapat lainnya mengatakan yakni perbanyaklah pasukan kami. Namun mereka enggan melakukan hal-hal tersebut. قَالُوا۟ لَوْ نَعْلَمُ(Mereka berkata: “Sekiranya kami mengetahui) Yakni mengetahui akan adanya peperangan لَّاتَّبَعْنٰكُمْ ۗ (tentulah kami mengikuti kamu) Dan kami akan berperang bersama kalian, akan tetapi tidak ada peperangan disana yang bisa kami ikuti. Pendapat lain mengatakan yakni seandainya kami mampu dan mahir dalam berperang pasti kami akan mengikuti kalian pergi berperang. هُمْ لِلْكُفْرِ يَوْمَئِذٍ (Mereka pada hari itu kepada kekafiran) Yakni di hari mereka berlepas diri dari kalian dan mengatakan perkataan tersebut. أَقْرَبُ مِنْهُمْ لِلْإِيمٰنِ ۚ (lebih dekat dari pada keimanan) Yakni bagi yang menyangka bahwa mereka orang-orang Islam. يَقُولُونَ بِأَفْوٰهِهِم مَّا لَيْسَ فِى قُلُوبِهِمْ ۗ (Mereka mengatakan dengan mulutnya apa yang tidak terkandung dalam hatinya) Yakni mereka menunujukkan keimanan dan menyembunyikan kekafiran mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "167. Di antara manfaat musibah itu adalah, Allah memisahkan orang-orang munafik, yaitu Abdullah bin Ubay dan para sahabatnya, serta orang-orang yang dikatakan kepada mereka: “Ayo berperang untuk meninggikan kalimat Allah, jika kalian memang benar-benar beriman” atau lindungilah diri, harta benda, dan rumah kalian jika tidak bisa mau berperang di jalan Allah, dan tidak beriman kepadaNya dan hari kiamat” Mereka berkata: “Jika saja kami tahu bahwa akan terjadi perang, maka sungguh kami akan berangkat dan berperang bersama kalian” Namun kami tahu bahwa kalian tidak berperang karena tidak ada kesepakatan antara 2 belah pihak. Sesungguhnya mereka pada hari mengatakan ucapan itu ada yang lebih dekat dengan kekufuran dan ada yang lebih dekat dengan keimanan. Dan Allah lebih tahu tentang kemunafikan yang mereka sembunyikan. Az-Zuhriy dan lainnya berkata: “Rasulullah SAW menuju perang Uhud bersama 1000 sahabatnya. Ketika di tengah perjalanan antara jabal Uhud dan Madinah, Abdullah bin Ubay dengan sepertiga orang berjalan dengan berat dan berkata: “Apakah kalian akan mengikuti mereka (orang mukmin) atau mengingkariku, namun demi Allah, aku tidak tahu kenapa kita harus bunuh diri di sini?!” Lalu dia kembali bersama orang yang mengikutinya”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan mengetahui orang-orang yang munafik. Dikatakan kepada mereka, “Marilah berperang di jalan Allah atau bertahanlah”} perbanyaklah mencaci orang-orang muslim {Mereka menjawab, “Seandainya kami mengetahui berperang tentulah kami mengikuti kalian} Jika kami mengetahui bahwa kalian akan berperang, sungguh kami akan mendatangi kalian, akan tetapi dia tidak ada peperangan di sana {”Mereka pada hari itu lebih dekat pada kekufuran} pada kekufuran {daripada keimanan} kepada keimanan {Mereka mengatakan dengan mulutnya sesuatu yang tidak ada dalam hatinya. Allah lebih mengetahui segala sesuatu yang mereka sembunyikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "166-167. Kemudian Allah mengabarkan bahwasanya yang menimpa mereka saat bertemunya kedua pasukan; pasukan kaum Muslimin dan pasukan kaum musyrikin di Uhud berupa kematian dan kekalahan, adalah dengan izinNYa, Qadha’ dan QadarNYa; tidak ada tempat pelarian baginya, dan itu pasti terjadi. Perkara takdir apabila telah terlaksana, maka tidak ada lagi cara kecuali (hanya) menerimanya dan bahwa Allah menetapkan hal itu atas dasar hikmah yang agung dan faidah yang besar, dan bahwa dengan hal itu akan jelas orang Mukmin dari orang munafik, yaitu orang-orang yang bila diperintah untuk ikut berperang, “dan kepada mereka dikatakan, ‘ Marilah berperang di jalan Allah’ ,” yaitu, demi membela agama Allah dan melindunginya serta mengharap keridhaan Allah, “atau pertahankanlah (dirimu),” kehormatan dan negeri kalian apabila kalian tidak memiliki niat yang shalih, maka mereka enggan ikut berperang dan membuat alasan. “Mereka berkata, ‘Sekiranya kami mengetahui akan terjadi peperangan, tentulah kami mengikutimu’ ,” maksudnya, sekiranya kami mengetahui bahwasanya akan terjadi peperangan antara kalian dan mereka, niscaya kami akan mengikuti kalian berperang. Tetapi sebenarnya mereka pendusta dalam hal itu. Sungguh mereka telah yakin dan paham, dan setiap orang mengetahui bahwa kaum musyrikin telah dipenuhi oleh dengki dan kebencian terhadap kaum Muslimin, dan bahwa mereka telah mengerahkan harta benda mereka, dan mereka telah mengumpulkan pasukan sekuat tenaga untuk menghancurkan kaum Muslimin di negeri mereka dengan semangat yang menyala-nyala untuk memerangi mereka. Barangsiapa yang kondisinya seperti ini, bagaimana bisa tidak tergambar bahwa tidak akan terjadi perang antara mereka dengan kaum Mukminin? Khususnya (alasan) bahwa kaum Muslimin telah (terlanjur) keluar dari Madinah (meninggalkan mereka), dan menghadapi mereka (kafir Quraisy). Ini merupakan suatu alasan yang mustahil, akan tetapi orang-orang munafik menyangka bahwa alasan tersebut melegakkan kaum MUkminin. Allah berfirman, “Mereka pada hari itu kepada kekafiran” yaitu pada saat mereka tidak berjihad bersama kaum Mukminin, “lebih dekat kepada kekafiran daripada keimanan. Mereka mengatakan dengan mulut mereka perkataan yang tidak terkandung dalam hati mereka.” Ini adalah ciri khas orang-orang munafik, mereka tampakkan pada lisan dan perbuatan mereka apa yang bertentangan dengan yang ada dalam hati dan dada mereka. Di antaranya adalah perkataan mereka, “Sekiranya kami mengetahui akan terjadi peperangan, tentulah kami mengikuti kamu.” Sesungguhnya mereka sebenarnya telah mengetahui akan terjadinya peperangan. Ayat ini menjadi dalil atas sebuah kaidah “melakukan kemudaratan yang lebih kecil dari dua kemudaratan,” untuk menolak kemudaratan yang lebih besar dan melakukan kemaslahatan yang lebih kecil dari dua kemaslahatan karena ketidakmampuan melakukan kemaslahatan yang lebih besar, karena kaum munafik itu telah diperintahkan untuk berperang demi agama, dan bila mereka tidak melakukannya maka diperintahkan untuk mempertahankan keluarga dan negeri. “Dan Allah lebih mengetahui apa yang mereka sembunyikan,” maka Allah tampakkan semua itu bagi hamba-hambaNya yang beriman, lalu Allah menghukum mereka atas hal tersebut."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 167: Dan Ia hendak membuktıkan orang-orang yang munafik. Dan (ketika) dikata kepada mereka: \"Marilah berperang di jalan Allah, atau belalah diri-diri kamu.\" Mereka jawab: \"Kalau kami tahu berperang, niscaya kami sudah turut kamu (berperang)\". Mereka itu, pada hari yang tersebut, lebih hampir kepada kufur daripada (kehampiran) mereka kepada iman. Mereka berkata dengan mulut mereka apa yang tidak ada di hati mereka. Dan Allah lebih Mengetahui apa-apa yang mereka sembunyikan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ketika mereka pulang tidak jadi berperang. Mereka ini adalah kaum munafik yang dipimpin Abdullah bin Ubay. Yakni jagalah kampung halamanmu. Dari perkataan ini muncul kaidah, \" ارتكاب اخف المفسدتين لدفع أعلاهما وفعل أدنى المصلحتين للعجز عن أعلاهما \"Mengerjakan mafsadat yang paling ringan untuk menolak mafsadat yang lebih besar dan melakukan maslahat ringan karena tidak sanggup mengambil maslahat besar.\" Hal itu, karena kaum munafik diajak berperang, namun mereka menolaknya, maka mereka diajak kepada perkara yang ringan, yaitu melindungi keluarga dan kampung halaman. Ucapan ini ditujukan kepada Nabi shallallahu 'alaihi wa sallam dan para sahabatnya sebagai ejekan, karena mereka memandang bahwa Nabi shallallahu 'alaihi wa sallam tidak tahu taktik berperang, sebab beliau melakukan peperangan ketika jumlah kaum muslimin sedikit. Ucapan ini digunakan untuk mengelakkan celaan yang ditujukan kepada diri orang-orang munafik sendiri. Karena memperlihatkan sikap membiarkan kaum mukmin, tidak menolong mereka. Kalau pun mereka mengetahui bagaimana cara berperang, mereka juga tidak akan mengikuti kamu. Berupa kemunafikan. Oleh karena itu, Allah menampakkannya kepada hamba-hamba-Nya yang mukmin dan menghukum mereka (kaum munafik) karenanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 167",
    "description": "Dan panggilan untuk berjuang itu selain untuk menguji keimanan umat islam, juga untuk menguji orang-orang yang munafik sehingga dapat diketahui kemunafikannya dengan nyata. Kepada mereka dikatakan, marilah berperang di jalan Allah atau pertahankanlah dirimu, keluargamu, dan harta kekayaanmu serta negerimu. Mereka berkata dengan nada mengejek nabi dan orang-orang mukmin yang ikut berjuang, sekiranya kami mengetahui bagaimana cara berperang menghadapi musuh yang cukup banyak dengan pasukan yang banyak pula, sehingga dengan jumlah itu kita dapat mengalahkan mereka, tentulah kami mengikuti kamu. Tetapi jika jumlah kita lebih sedikit, itu berarti kita membinasakan diri sendiri, karena itu sebaiknya kita mundur. Mereka pada hari itu lebih dekat kepada kekafiran daripada keimanan karena tujuan mereka berperang semata-mata hanya ingin mendapatkan ganimah, bukan untuk mengharap imbalan dari Allah. Mereka mengatakan dengan mulutnya apa yang tidak sesuai dengan isi hatinya. Dan Allah lebih mengetahui apa yang mereka sembunyikan dalam hati mereka secara rinci dan detail tentang kemunafikan mereka bukan hanya iman yang tidak berbekas dalam hati, solidaritas pun lenyap dari hati kaum munafik itu. Mereka itu adalah orang-orang yang berkata kepada saudara-saudaranya dari kaum muslim maupun golongan munafik lainnya, dan mereka tidak turut pergi berperang, sekiranya mereka mengikuti kita dan mendengarkan saran kita untuk tidak berperang, tentulah mereka tidak terbunuh dalam pertempuran itu. Katakanlah, wahai nabi Muhammad, kepada mereka yang menganggap mampu menampik kematian, cegahlah kematian itu dari diri kamu sehingga dia tidak datang menjemput kalian, jika kamu orang yang benar sanggup menolak datangnya kematian atau menunda kematian seseorang. Ketika orang-orang munafik tidak mampu menolak dan menunda datangnya kematian, Allah menegaskan tentang posisi kaum muslim yang gugur dalam peperangan sebagai syuhada. '"
  }
]