[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang munafik itu, merekalah orang-orang yang duduk-duduk, dan mereka berkata kepada saudara-saudara mereka yang menjadi korban bersama kaum muslimin dalam peperangan mereka melawan kaum musyrikin pada perang uhud, ”sekiranya mereka itu taat kepada kami, pastilah mereka tidak akan terbunuh.” Katakanlah kepada mereka (wahai rasul), ”maka tolaklah kematian dari diri-diri kalian,jika kalian orang-orang yang benar dalam pengakuan kalian bahwa sanya mereka itu seandainya menuruti kalian tidak akan terbunuh dan sesungguhnya kalian selamat dari terbunuh gara-gara tidak beranjak pergi menuju medan peperangan.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "168. Mereka adalah orang-orang yang tidak pergi ke medan perang dan berkata kepada kerabat mereka yang mendapat musibah dalam perang Uhud, “Seandainya mereka patuh kepada kami dan tidak pergi ke medan perang, pasti mereka tidak akan terbunuh.” Katakanlah -wahai Nabi- untuk menjawab ucapan mereka, “Kalau begitu lindungilah diri kalian sendiri dari kematian apabila kematian itu datang menjemput kalian, jika ucapan kalian benar yaitu anggapan kalian bahwa seandainya mereka patuh kepada kalian niscaya mereka tidak terbunuh, dan penyebab keselamatan kalian dari kematian tersebut adalah karena tidak pergi berjihad di jalan Allah.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "168. Orang-orang munafik yang tidak ikut dalam perang Uhud mengomentari keadaan saudara mereka sedarah yang terbunuh dalam perang: “Andai saja mereka mendengarkan kita agar tidak mengikuti perang, niscaya mereka tidak akan terbunuh.” Maka Allah memerintahkan Rasulullah untuk membalas mereka, katakanlah: “Tolaklah kematian dari diri kalian, jika kalian benar dalam ucapan kalian.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "168. الَّذِينَ قَالُوا۟ لِإِخْوٰنِهِمْ (Orang-orang yang mengatakan kepada saudara-saudaranya) Yakni yang membicarakan tentang kerabat mereka dari orang-orang beriman yang terbunuh di perang Uhud, dan mereka yang berkata ini adalah mereka yang tidak mengikuti peperangan. لَوْ أَطَاعُونَا (Sekiranya mereka mengikuti kita) Yakni dengan tidak ikut keluar dari Madinah niscaya mereka tidak akan terbunuh. قُلْ فَادْرَءُوا۟ عَنْ أَنفُسِكُمُ الْمَوْتَ إِن كُنتُمْ صٰدِقِينَ (Katakanlah: “Tolaklah kematian itu dari dirimu, jika kamu orang-orang yang benar”) Yakni tidak akan bermanfaat peringatan dari kalian untuk menolak qadar Allah, karena orang yang terbunuh sebanarnya terbunuh karena telah datang ajalnya, dan tidak ada tempat berlari bagi siapapun dari kematian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "168. Orang-orang munafik yang tidak ikut orang mukmin memerangi orang musyrik di perang Uhud akan berkata kepada saudaranya dengan penuh kemunafikan: “Jika saja di perang Uhud mereka mengikuti kami dengan tidak keluar Madinah, niscaya pada hari itu mereka tidak akan terbunuh” Katakanlah kepada mereka wahai Nabi: “Lindungilah diri kalian dari kematian saat ajal kalian telah datang, jika tindakan mundur dan berdiam diri kalian itu bisa menyelamatkan kalian dari kematian.” Maknanya kalian tidak bisa menghindari takdir. Sesungguhnya orang yang terbunuh itu mati karena ajalnya telah tiba"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang berbicara tentang saudara-saudaranya, sedangkan mereka menghindar} dari jihad {Seandainya mereka mengikuti kami} dengan keluar dari Madinah {tentulah mereka tidak terbunuh.” Katakanlah, “Cegahlah} jagalah {diri kalian dari kematian jika kalian orang-orang benar.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "168. Kemudian Allah berfirman, “Orang-orang yang mengatakan kepada saudara-saudaranya dan mereka tidak turut pergi berperang, ‘Sekiranya mereka mengikuti kita, tentulah mereka tidak terbunuh’ .” maksudnya, mereka (orang-orang munafik itu) menyatukan tindakan antara tidak ikut berjihad dengan menentang dan mendustakan Qadha’ dan Qadar Allah. Allah berfirman membantah mereka, “Katakanlah, ‘Tolaklah’ ,” maksudnya, hindarkanlah, “kematian itu dari dirimu, jika kamu orang-orang yang benar.” (Buktikan) bahwa mereka bila menaati kalian maka tidaklah mereka akan terbunuh, kalian tidak akan mampu melakukan itu dan tidak akan bisa. Dalam ayat-ayat ini terdapat dalil bahwa seorang hamba terkadang memiliki ciri-ciri kekufuran dan keimanan, dan terkadang lebih dekat kepada salah satu daripada kepada lainnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 168: (Ialah) mereka yang berkata kepada saudara-saudaranya sambil mundur; \"Kalau mereka itu taat kepada kita, tentu tidak mereka \"Kalau begitu, tolaklah kematian dari diri-diri kamu jika memang kamu itu orang-orang yang benar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mereka menggabung antara sikap tidak ikut berperang dengan sikap protes dan mendustakan qadha' Allah dan qadar-Nya. Dari ayat di atas kita mengetahui, bahwa seseorang kadang terdapat perkara kufur dan perkara iman, dan terkadang ia lebih cenderung ke salah satunya. Para syuhada' Uhud."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 168",
    "description": "Bukan hanya iman yang tidak berbekas dalam hati, solidaritas pun lenyap dari hati kaum munafik itu. Mereka itu adalah orang-orang yang berkata kepada saudara-saudaranya dari kaum muslim maupun golongan munafik lainnya, dan mereka tidak turut pergi berperang, sekiranya mereka mengikuti kita dan mendengarkan saran kita untuk tidak berperang, tentulah mereka tidak terbunuh dalam pertempuran itu. Katakanlah, wahai nabi Muhammad, kepada mereka yang menganggap mampu menampik kematian, cegahlah kematian itu dari diri kamu sehingga dia tidak datang menjemput kalian, jika kamu orang yang benar sanggup menolak datangnya kematian atau menunda kematian seseorang. Ketika orang-orang munafik tidak mampu menolak dan menunda datangnya kematian, Allah menegaskan tentang posisi kaum muslim yang gugur dalam peperangan sebagai syuhada. ' dan jangan sekali-kali kamu sekalian mengira bahwa orang-orang yang gugur sebagai syuhada di jalan Allah itu mati dalam arti tidak dapat bergerak kesana kemari dan tidak tahu keadaan orang yang ditinggalkan. Tetapi sebenarnya mereka itu hidup dengan kehidupan lain di sisi tuhannya di alam barzakh, bahkan dapat bergerak dan mengetahui keadaan orang yang ditinggalkan. Mereka mendapat rezeki berupa kehidupan istimewa yang penuh dengan kenikmatan di dalamnya dan kedudukan mulia dari sisi Allah."
  }
]