[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan jangan sekali-kali kamu (wahai nabi),menyangka bahwa orang-orang yang terbunuh di jalan Allah itu mati,yang tidak merasakan sesuatupun. Justru sebaliknya,mereka itu hidup dalam kehidupan alam barzakh dalam perlindungan tuhan mereka yang mereka itu berjihad karenaNYA dan mereka mati di jalanNYA, kaakan mengalir bagi mereka rezeki dari surga, dan mereka dilimpahi kenikmatan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "169. Janganlah kamu -wahai Nabi- mengira bahwa orang-orang yang terbunuh dalam berjihad di jalan Allah itu mati. Sesungguhnya mereka itu hidup secara khusus di sisi Rabb mereka di tempat kehormatan-Nya. Mereka diberi rezeki dari beragam kenikmatan yang hanya diketahui oleh Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "169-170. Allah memberi kabar gembira kepada Rasulullah dan orang-orang beriman tentang nasib orang-orang yang mati syahid dan kedudukan mereka di sisi Allah: “Janganlah kalian mengira orang-orang yang terbunuh di jalan Allah pada perang Uhud itu adalah orang-orang mati yang tidak dapat merasakan apapun; mereka hidup dalam kedudukan yang mulia di sisi tuhan mereka, mereka bahagia karena mendapatkan karunia yang banyak dari Allah.” Mereka memberi kabar gembira kepada saudara-saudara mereka mujahid yang masih hidup di dunia tentang kebaikan yang menunggu mereka di akhirat, mereka tidak akan takut terhadap apa yang mereka dapatkan di akhirat, dan tidak akan bersedih atas kenikmatan dunia yang meninggalkan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "169. وَلَا تَحْسَبَنَّ الَّذِينَ قُتِلُوا۟ (Janganlah kamu mengira bahwa orang-orang yang gugur) Yakni dari golongan orang-orang beriman yang gugur di perang Uhud, dan bergitu pula bagi yang gugur dipeperangan lainnya. فِى سَبِيلِ اللهِ (di jalan Allah) Yakni untuk meninggikan kalimat Allah dan untuk menolong agama-Nya. أَمْوٰتًۢا ۚ (mati) Yakni janganlah kalian kira bahwa orang yang gugur secara syahid itu mati. بَلْ أَحْيَآءٌ(bahkan mereka itu hidup) Yakni dengan kehidupan yang sebenarnya. Disebutkan bahwa ruh mereka berada di dalam perut burung hijau. Dan mereka didalam surga mendapat rezeki dan menikmati makanan, dan itu bukanlah hal yang tidak mungkin karena dalam pandangan kita mereka mati namun mereka hidup di kehidupan barzakh yang merupakan sesuatu yang ghaib. عِندَ رَبِّهِمْ (disisi Tuhannya) Yakni di dekat-Nya dalam negeri kemuliaan. يُرْزَقُونَ (dengan mendapat rezeki) Yakni mereka mendapat rezeki dari Allah berupa makanan dan minuman."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "169. Wahai Nabi dan setiap orang yang mendengar, jangan sampai kamu mengira bahwa orang-orang yang mati syahid di perang Uhud dan perang lainnya itu mati, melainkan mereka itu hidup di alam khusus, yang mana tidak ada yang mengetahui kehidupan di alam itu kecuali Allah SWT. Hal ini disebutkan dalam hadits bahwa ruh para syuhada berada di atas sungai yang berkilau di pintu surga di kubah berwarna hijau. Sesungguhnya mereka di surga itu diberi rejeki dan makan. Nabi mengabarkan hal itu untuk para syuhada Uhud, lalu Allah menurunkan ayat ini {Wa laa tahsabanna ladziina qutiluu …}"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jangan sekali-kali kamu mengira} jangan sekali-kali kamu berprasangka {bahwa orang-orang yang gugur di jalan Allah itu mati. Sebenarnya, mereka itu hidup dan di sisi Tuhannya, mereka itu diberi rejeki"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "169. Ayat-ayat yang mulia ini mengandung penjelasan tentang keutamaan para syuhada dan karamah mereka, dan segala kebaikan yang dikaruniakan oleh Allah buat mereka berupa anugerah dan kebaikanNya. Termasuk di dalamnya adalah hiburan bagi orang-orang yang masih hidup karena ditinggal mati saudara mereka, belasungkawa bagi mereka dan memberikan semangat bagi mereka untuk berperang di jalan Allah dan mencari mati syahid. “Janganlah kamu mengira bahwa orang-orang yang gugur di jalan Allah,” maksudnya, dalam memerangi musuh-musuh agama dengan tujuan meninggikan kalimat Allah, “mati.” Maksudnya, janganlah sampai terlintas di benak kalian dan dalam perhitungan kalian bahwa mereka itu mati dan lenyap, serta hilang dari mereka kenikmatan hidup dunia dan menikmati bunga-bunganya, (namun) yang (seharusnya) dikhawatirkan hilang adalah takut berperang dan tidak mendapatkan mati syahid. “bahkan” sesungguhnya mereka telah memperoleh yang lebih besar daripada sesuatu yang diperebutkan oleh orang-orang yang saling bersaing, di mana “mereka itu hidup di sisi Rabbnya,” dalam surgaNya. Kata “di sisi Rabbnya” menunjukkan tingginya derajat mereka dan begitu dekatnya mereka dengan Rabb mereka, “dengan mendapat rizki” berupa berbagai macam kenikmatan yang tidak diketahui bentuknya kecuali oleh DZat yang telah memberikan kenikmatan tersebut atas mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 169: Dan janganlah engkau sangka orang-orang yang terbunuh di jalan Allah itu mati, bahkan (mereka itu) hidup di sisi Tuhan mereka, diberi rezeki."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini turun tentang keadaan para syuhada'. Di dalamnya terdapat keutamaan para syuhada' dan keistimewaan mereka serta karunia dan ihsan Allah yang diberikan kepada mereka. Dalam ayat ini, terdapat hiburan bagi orang-orang yang masih hidup agar tidak bersedih terhadap kawan-kawan mereka yang telah meninggal, dan menyemangatkan mereka untuk berperang di jalan Allah serta siap untuk syahid. Imam Ahmad meriwayatkan dari Ibnu Abbas, ia berkata: Rasulullah shallallahu 'alaihi wa sallam bersabda, \"Ketika saudara kamu tertimpa musibah di perang Uhud, Allah Azza wa Jalla menjadikan ruh mereka dalam tembolok burung hijau yang mendatangi sungai-sungai surga yang memakan buahnya, dan pergi menuju beberapa lampu emas yang berada di bawah naungan 'Arsy. Ketika mereka mendapatkan nikmatnya minuman, makanan dan nikmatnya tempat pulang mereka, mereka berkata, \"Seandainya saudara-saudara kita mengetahui apa yang diberikan Allah kepada kita agar mereka tidak benci kepada jihad dan tidak mundur dari peperangan.\" Allah Azza wa Jalla berfirman, \"Aku akan menyampaikan kepada mereka perihal kalian.\" Maka Allah menurunkan beberapa ayat kepada Rasul-Nya, \"Janganlah kamu mengira bahwa orang-orang yang gugur di jalan Allah itu mati, sebenarnya mereka itu hidup.\" Hakim meriwayatkan dari Ibnu Abbas, \"Bahwa ayat di atas turun berkenaan dengan Hamzah dan kawan-kawannya.\" Hakim berkata, \"Shahih sesuai syarat Bukhari-Muslim, namun keduanya tidak menyebutkan, dan didiamkan oleh Adz Dzahabi.\" Thabari meriwayatkan dari Anas bin Malik tentang para sahabat yang dikirim Nabi shallallahu 'alaihi wa sallam ke penduduk Bi'ruma'unah (sumur Ma'unah), ia berkata, \"Saya tidak mengetahui apakah jumlah mereka 40 atau 70 orang. Di dekat sumur tersebut ada 'Amir bin Thufail Al Ja'fariy, maka datanglah beberapa orang sahabat Nabi shallallahu 'alaihi wa sallam ke gua yang mengarah kepada sumur tersebut, lalu mereka duduk di sana dan sebagian mereka bertanya kepada yang lain, \"Siapakah di antara kamu yang mau menyampaikan risalah Rasulullah shallallahu 'alaihi wa sallam kepada penduduk sumur ini?\" Di antara mereka ada yang mengusulkan, \"Menurut saya adalah Abu Milhaan Al Anshaariy.\" (Ia berkata), \"Saya akan menyampaikan risalah Rasulullah shallallahu 'alaihi wa sallam.\" Maka Abu Milhan keluar dan mendatangi salah satu suku mereka lalu mendekati rumah-rumah mereka dan berkata, \"Wahai penduduk Bi'ruma'unah! Sesungguhnya aku adalah utusan Rasulullah shallallahu 'alaihi wa sallam, aku bersaksi bahwa tidak ada tuhan yang berhak disembah selain Allah dan bahwa Muhammad adalah hamba-Nya dan utusan-Nya, maka berimanlah kepada Allah dan Rasul-Nya.\" Lalu keluarlah seorang laki-laki dari pinggir rumah dengan membawa tombaknya, kemudian ia tusukkan tombak itu ke pinggir badannya hingga menembus ke pinggirnya lagi. Ia (Abu Milhan) berkata, \"Allahu akbar! Aku beruntung, demi Tuhan pemilik ka'bah.\" Maka penduduk Bi'ruma'unah mengikuti jejaknya sehingga bertemu dengan para sahabat Abu Milhan, lalu 'Amir bin Thufail membunuh mereka semua. Ishaq (perawi hadits ini) berkata, \"Telah menceritakan kepadaku Anas bin Malik, bahwa Allah Ta'ala menurunkan Al Qur'an berkenaaan dengan mereka yang diangkat setelah kami baca beberapa waktu, dan Allah menurunkan ayat, \"Wa laa tahsabannalladziina qutiluu fii sabilillahi amwaataa bal ahyaaa'un 'inda rabbihim yurzaquun.\" (Hadits ini disebutkan Ibnu Jarir dalam At Tarikh juz 3 hal. 36, dalam hadits tersebut diterangkan bahwa sebab turunnya ayat tersebut adalah berkenaan dengan orang-orang yang dibunuh di Bi'ruma'unah.) Imam Syaukani berkata, \"Bagaimana pun keadaannya, ayat tersebut berdasarkan keumumannya mengena kepada setiap orang yang mati syahid.\" Dengan maksud meninggikan kalimatullah. Yakni janganlah ada anggapan dalam hatimu bahwa mereka itu mati, hilang kenikmatan hidup di dunia, bahkan mereka mendapatkan kenikmatan yang lebih besar lagi daripada kenikmatan hidup di dunia. Yaitu hidup dalam alam yang lain yang bukan alam kita ini, di mana mereka mendapat kenikmatan-kenikmatan di sisi Allah, dan hanya Allah sajalah yang mengetahui bagaimana keadaan hidup itu. Di dalam hadits disebutkan bahwa ruh para syuhada berada dalam tembolok burung hijau yang berterbangan di surga sesuai yang mereka inginkan dan memakan buah-buahan surga. Dalam kata-kata \"di sisi Tuhannya\" menunjukkan tingginya derajat mereka dan dekatnya mereka dengan Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 169",
    "description": "Dan jangan sekali-kali kamu sekalian mengira bahwa orang-orang yang gugur sebagai syuhada di jalan Allah itu mati dalam arti tidak dapat bergerak kesana kemari dan tidak tahu keadaan orang yang ditinggalkan. Tetapi sebenarnya mereka itu hidup dengan kehidupan lain di sisi tuhannya di alam barzakh, bahkan dapat bergerak dan mengetahui keadaan orang yang ditinggalkan. Mereka mendapat rezeki berupa kehidupan istimewa yang penuh dengan kenikmatan di dalamnya dan kedudukan mulia dari sisi Allah. Mereka yang gugur sebagai syuhada bergembira dengan karunia yang diberikan Allah kepadanya berupa kenikmatan surga, dan mereka bergirang hati terhadap orang yang masih tinggal di belakang melanjutkan perjuangan, yang belum menyusul mereka sebagai syuhada. Mereka pun berharap agar kaum muslim yang masih hidup juga memperoleh kedudukan mulia di sisi Allah. Diberitakan bahwa tidak ada kekhawatiran pada mereka sedikit pun tentang huru-hara hari kiamat dan mereka tidak bersedih hati akibat dosa-dosa yang dahulu pernah mereka khawatirkan, sebab Allah telah mengampuni kesalahan mereka."
  }
]