[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka itu adalah orang-orang yang bersifat sabar dalam menjalankan ketaatan kepada Allah, dan menjauhi berbagai macam maksiat, dan dalam menghadapi musibah yang menimpa mereka dari takdir Allah yang menyakitkan, dan dengan sifat jujur dalam ucapan-ucapan dan perbuatan-perbuatan, memiliki ketaatan yang sempurna, berinfak dengan sembunyi-sembunyi maupun terang-terangan, dan mengucapkan istighfar di akhir malam, karena waktu tersebut merupakan waktu besarnya kesempatan diterima dan dikabulkannya doa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Mereka adalah orang-orang yang sabar dalam melaksanakan ketaatan dan meninggalkan keburukan serta sabar dalam menghadapi cobaan yang menimpa mereka. Mereka senantiasa jujur di dalam ucapan dan tindakan mereka. Mereka taat sepenuhnya kepada Allah. Mereka menginfakkan harta mereka di jalan Allah. Dan mereka adalah orang-orang yang rajin memohon ampun kepada Allah di penghujung malam, karena doa yang dipanjatkan pada waktu itu mudah dikabulkan, dan pada waktu itu hati manusia masih kosong dari kesibukan-kesibukan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "17. الصّٰبِرِينَ ((yaitu) orang-orang yang sabar ) Yakni yang bersabar diatas ketaatan kepada Allah dan dari apa yang diharamkan-Nya. وَالصّٰدِقِينَ (yang benar ) Yakni yang benar niat-niat mereka dan istiqamah hati dan lisan mereka baik saat sendiri maupun saat berada di keramaian. وَالْقٰنِتِينَ ( yang tetap taat) Yakni orang-orang yang taat kepada Allah dan memiliki hati yang khusyu’. وَالْمُسْتَغْفِرِينَ بِالْأَسْحَارِ ( dan yang memohon ampun di waktu sahur) Yakni yang meminta ampunan pada waktu sahur. Dan pendapat lain mengatakan mereka adalah orang-orang yang menegakkan shalat subuh atau shalat di akhir malam. Dan waktu sahur adalah waktu yang dimulai saat malam akan segera berakhir sampai terbitnya fajar."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Allah menyuruh hamba-hambaNya agar mereka menutup setiap amalan-amalan shalih mereka dengan istighfar, oleh karena itu Rasulullah jika beliau salam dari shlatnya selalu mengucapkan istigfar sebanyak tiga kali, dan Allah tekah berfirman : { وَالْمُسْتَغْفِرِينَ بِالْأَسْحَارِ } , Allah memerintahlan agar mereka mendirikan shalat dimalam hari kemudia mereka beristighfar di waktu sahur, dan sebagaimana yang tercantum di akhir surah al-muzzammil : { وَاسْتَغْفِرُوا اللَّهَ ۖ إِنَّ اللَّهَ غَفُورٌ رَحِيمٌ } \"Dan mohonlah ampunan kepada Allah; sesungguhnya Allah Maha Pengampun lagi Maha Penyayang\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17 Allah mengkhususkan untuk memuji orang-orang yang sabar dalam melakukan ketaatan kepada Allah dan sabar untuk menjauhi larangan-Nya. Serta memuji orang-orang yang benar dalam iman, perkataan, perbuatan dan interaksi mereka dengan manusia. Dan juga memuji orang-orang yang senantiasa taat kepada Allah, berhati khusyuk, yang menafkahkan hartanya di jalan Allah, dan yang memohon ampun di waktu sahur: yang memohon ampunan di akhir malam atau sebelum terbit fajar, yaitu sepertiga malam yang terakhir, sebab doa pada waktu tersebut adalah doa yang mustajab."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang sabar, benar, taat} taat kepada Allah {dan berinfak, serta memohon ampunan pada akhir malam} di akhir malam"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17. Lalu Allah menyifati mereka dengan sebaik-baik sifat yaitu, dengan kesabaran, yang artinya adalah pengendalian diri berdasarkan perkara yang dicintai oleh Allah demi mengharap keridhaanNya, mereka bersabar atas ketaatan kepada Allah, bersabar dalam meninggalkan maksiat kepadaNya dan bersabar atas takdir-takdir Allah yang menyakitkan, dan bersabar dengan sifat jujur dalam segala perkataan maupun kondisi yaitu kesesuaian antara lahir maupun batin, tekad yang benar dalam menempuh jalan yang lurus, dan dengan sifat patuh yang artinya ketaatan yang terus menerus disertai dengan kekhusyuan dan ketundukan, juga dengan memberi nafkah pada jalan-jalan kebajikan, kepada para fakir miskin dan orang-orang yang membutuhkan, dan dengan permohonan ampunan khususnya di waktu sepertiga malam yang terakhir, karena mereka memanjangkan shalat mereka hingga waktu sahur lalu mereka tetap dalam hal itu seraya memohon ampun kepada Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 17: Yaitu orang-orang yang sabar dan yang benar dan yang taat sungguh-sungguh dan yang membelanjakan (harta) dan yang meminta ampun di waktu-waktu malam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni sabar dalam menjalankan ketaatan, sabar dalam menjauhi kemaksiatan dan sabar terhadap taqdir Allah yang menyakitkan. Sahur: waktu sebelum fajar menyingsing mendekati subuh. Waktu sahur adalah waktu dikabulkannya do'a. Keadaan mereka yang berada dalam sifat-sifat mulia, dari mulai sifat sabar, benar, taat dan suka berinfak, namun tetap merasakan kekurangan sehingga mereka meminta ampunan kepada Allah di waktu sahur, dan hal ini merupakan tanda kebahagiaan. Ayat di atas (dari ayat 14-17) menerangkan kepada kita beberapa hal: - Keadaan manusia di dunia dan bahwa kesenangan dunia hanya sementara. - Keadaan surga dan kenikmatan yang ada di dalamnya, serta kelebihan surga di atas kenikmatan dunia untuk mengingatkan kita agar lebih mengedepankannya dan beramal untuknya. - Sifat penghuni surga, yakni orang-orang yang bertakwa. - Perincian perkara-perkara takwa, seperti sabar, benar, taat, suka berinfak dan beristighfar di waktu sahur. Dengan perkara-perkara ini, seorang hamba dapat menimbang dirinya, apakah dia termasuk penghuni surga ataukah tidak?"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 17",
    "description": "Mereka itu adalah orang-orang yang sabar, baik dalam menjalankan ketaatan, di saat tertimpa musibah, maupun dalam meninggalkan larangan, orang-orang yang benar dalam sikap dan perkataannya, orangorang yang senantiasa dalam ke-taat-an secara khusyuk, orang-orang yang selalu menginfakkan harta mereka, baik pada saat lapang maupun sempit (lihat: surah a'li imra'n/3: 134) dan orang-orang yang senantiasa memohon ampunan terutama pada waktu sebelum fajar yakni masuknya waktu subuh setelah Allah memberi pujian kepada kaum mukmin, ayat ini menegaskan bahwa dalil-dalil yang bisa menguatkan keimanan sudah begitu jelas. Allah menyatakan, yakni menjelaskan kepada seluruh makhluk bahwa tidak ada tuhan yang berhak disembah selain dia, dan tidak ada sekutu bagi-Nya. Demikian pula para malaikat dan orang-orang berilmu juga menyaksikan atas keesaan-Nya. Bahkan, semuanya menyaksikan bahwa Allah tampil secara utuh untuk menegakkan keadilan, melalui dalil-dalil yang kuat. Allah adalah satu-satunya penguasa dan pengatur alam raya ini, tidak ada tuhan yang berhak disembah selain dia, yang mahaperkasa, mahabijaksana dalam pengaturan dan penetapan hukumhukum-Nya."
  }
]