[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "sungguh telah meliputi mereka Kegembiraan ketika Allah melimpahkan karunia kepada mereka, dimana DIA memberikan kepada mereka dari keagungan dermaNYA dan luasnya kemurahanNYA dari kenikmatan dan keridhaan yang menyebabkan pandangan mereka sejuk. Dan mereka bergembira bersama saudara-saudara mereka yang berjihad yang telah mereka tinggalkan dalam keadaan hidup, supaya orang-orang (yang masih hidup itu) memperoleh keberuntungan sebagaimana yang sudah mereka dapatkan,karena mereka mengetahui bahwa sesungguhnya mereka akan menggapai kebaikan yang telah mereka dapatkan.Jika mereka mati syahid di jalan Allah dengan ikhlas karenaNYA dan tidak ada rasa takut pada mereka terkait dengan apa-apa yang akan mereka hadapi,dari perkara-perkara akhirat, dan merekapun tidak bersedih hati terhadap apa yang luput bagi mereka dari kesenangan-kesenangan dunia"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "170. Sungguh kebahagiaan telah menyelimuti jiwa mereka dan kegembiraan telah melingkupi hati mereka berkat anugerah yang Allah limpahkan kepada mereka. Mereka terus berharap dan menunggu saudara-saudara mereka yang masih ada di dunia akan menyusul mereka. Karena jika mereka terbunuh di medan jihad, mereka akan mendapatkan anugerah seperti mereka. Tidak ada kecemasan terhadap mereka dalam menghadapi urusan Akhirat yang akan mereka hadapi. Dan mereka tidak bersedih hati atas kekayaan duniawi yang luput dari mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "170. فَرِحِينَ بِمَآ ءَاتَىٰهُمُ اللهُ (Mereka dalam keadaan gembira disebabkan apa yang diberikan-Nya kepada mereka) Yakni disebabkan apa yang Allah kirimkan berupa kemuliaan mendapatkan kesyahidan dan kehidupan mereka yang hakiki serta rezeki yang sampai kepada mereka dari Allah. وَيَسْتَبْشِرُونَ بِالَّذِينَ لَمْ يَلْحَقُوا۟ بِهِم (dan mereka bergirang hati terhadap orang-orang yang masih tinggal di belakang yang belum menyusul mereka) Yakni para saudara mereka dari kalangan orang-orang beriman yang belum gugur ketika itu. أَلَّا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ (bahwa tidak ada kekhawatiran terhadap mereka dan tidak (pula) mereka bersedih hati) Yakni mereka bergembira pada orang setelah mereka yang gugur di jalan Allah atau yang meninggal dalam keadaan beriman bahwa bagi mereka tidak ada kekhawatiran dan tidak pula rasa sedih hati."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "170. Para syuhada’ itu di sisi Allah merasa bahagia atas pemberianNya berupa pahala dan kemuliaan, dan bergembira dengan apa yang akan diterima para saudara mujahid mereka yang masih hidup setelah mereka, yang mana mereka itu tidak akan khawatir tentang musibah yang menimpa mereka, dan tidak bersedih atas kesenangan dunia yang terlewatkan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka bergembira dengan karunia yang Allah anugerahkan kepada mereka dan senang atas orang-orang yang berada di belakang yang belum menyusul mereka, yaitu bahwa tidak ada rasa takut pada mereka dan mereka tidak bersedih hati."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "170. Di samping itu, “mereka dalam keadaan gembira disebabkan karunia Allah yang diberikanNya kepada mereka,” maksudnya mereka bahagia dengan hal tersebut, di mana mereka menjadi tenang dan jiwa mereka menjadi senang. Yang demikian itu disebabkan karena banyaknya, baiknya, keagungannya, dan kesempurnaan kenikmatan dalam memperolehnya tanpa ada kesusahan. Allah telah menyatukan bagi mereka antara kenikmatan jasmani dengan adanya rizki dan kenikmatan hati dan ruh dengan kesenangan dan kebahagiaan atas apa yang telah Allah berikan kepada mereka dari karuniaNya, sehingga sempurnalah kenikmatan dan kebahagiaan mereka. “Mereka bergirang hati tentang orang-orang yang masih tinggal di belakang yang belum menyusul mereka,” maksudnya sebagian mereka memberikan kabar gembira kepada sebagian lainnya tentang akan menyusulnya saudara-saudara mereka yang belum menyusul mereka dan bahwa mereka akan mendapatkan apa yang telah mereka dapatkan; “bahwa tidak ada kekhawatiran terhadap mereka dan tidak (pula) mereka bersedih hati,” maksudnya, mereka memberikan kabar gembira dengan hilangnya hal-hal yang dikhawatirkan dari mereka dan dari saudara-saudara mereka yang melazimkan kesempurnaan kebahagiaan mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 170: (Dalam keadaan) bersukacita dengan apa yang Allah telah untuk- kan bagi mereka dari kurnia-Nya, dan mereka bergirang hati untuk orang-orang yang di belakang mereka yang belum berhubung dengan mereka, (yaitu) bahwa tidak ada ketakutan atas mereka dan tidak akan mereka dukacita."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mereka memperoleh kenikmatan yang sempurna, baik bagi badan mereka berupa rezeki, maupun bagi hati dan ruh mereka berupa kegembiraan. Maksudnya ialah kawan-kawannya yang masih hidup dan tetap berjihad di jalan Allah Subhaanahu wa Ta'aala. Kawan-kawan mereka akan memperoleh seperti yang mereka peroleh."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 170",
    "description": "Mereka yang gugur sebagai syuhada bergembira dengan karunia yang diberikan Allah kepadanya berupa kenikmatan surga, dan mereka bergirang hati terhadap orang yang masih tinggal di belakang melanjutkan perjuangan, yang belum menyusul mereka sebagai syuhada. Mereka pun berharap agar kaum muslim yang masih hidup juga memperoleh kedudukan mulia di sisi Allah. Diberitakan bahwa tidak ada kekhawatiran pada mereka sedikit pun tentang huru-hara hari kiamat dan mereka tidak bersedih hati akibat dosa-dosa yang dahulu pernah mereka khawatirkan, sebab Allah telah mengampuni kesalahan mereka bahkan mereka, para syuhada, bergirang hati dengan nikmat dan karunia dari Allah berupa kebahagiaan hakiki, ketenangan jiwa, kehidupan yang menyenangkan dan abadi. Dan sungguh, Allah tidak menyia-nyiakan pahala orang-orang yang beriman, karena Allah tidak menggugurkan atau mengurangi amal perbuatan seseorang, selama dia benar-benar beriman dan ikhlas dalam beramal."
  }
]