[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sesungguhnya mereka berada dalam kegembiraan mendalam dikarenakan apa yang telah mereka dapatkan berupa kenikmatan-kenikmatan Allah dan besarnya pemberianNYA, dan sesungguhnya Allah tidak menyia-nyiakan pahala orang-orang yang beriman kepadaNYA, bahkan DIA akan mengembangkannya dan menambahnya dari karuniaNYA."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "171. Di samping itu mereka akan bersuka cita dengan pahala besar yang menanti mereka dari Allah dan tambahan yang sangat besar atas pahala tersebut. Dan Allah -Ta'ālā- tidak akan membatalkan ganjaran orang-orang mukmin, melainkan akan memberikan ganjaran mereka secara penuh dan ditambah dengan ganjaran-ganjaran tambahan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "171. mereka berbahagia atas kenikmatan besar yang Allah karuniakan kepada mereka. Sungguh Allah tidak akan menyia-nyiakan pahala orang-orang yang beriman kepada Allah dan rasul-Nya. Syeikh as-Syinqithi berkata: “Dalam ayat ini Allah melarang untuk meanggap orang yang mati syahid itu mati. Dia menjelaskan bahwa mereka hidup dan mendapat rezeki di sisi Tuhan mereka, mereka berbahagia atas kenikmatan besar yang Allah karuniakan, mereka memberi kabar gembira kepada saudara-saudara mereka mujahid yang masih hidup di dunia agar mereka tidak merasa takut dan bersedih. Namun Allah tidak menjelaskan dalam ayat ini apakah kehidupan mereka dapat diketahui hakikatnya oleh manusia yang hidup di dunia? Dalam hal ini Allah menjelaskannya dalam surat al-Baqarah bahwa mereka tidak dapat mengetahui hakikatnya, Allah berfirman: وَلَا تَقُولُوا لِمَنْ يُقْتَلُ فِي سَبِيلِ اللَّهِ أَمْوَاتٌ ۚ بَلْ أَحْيَاءٌ وَلَٰكِنْ لَا تَشْعُرُونَ Dan janganlah kamu mengatakan terhadap orang-orang yang gugur di jalan Allah, (bahwa mereka itu) mati; bahkan (sebenarnya) mereka itu hidup, tetapi kamu tidak menyadarinya. (al-Baqarah: 154). Dan kalimat ‘tidak menyadari’ menunjukkan bahwa kita juga tidak mengetahuinya.” Dari Abdullah bin Murrah, dari Masruq ia berkata: “Kami bertanya kepada Abdullah bin Mas’ud tentang ayat ini -Ali Imran: 169-. Maka ia menjawab: “Kami -para sahabat- juga menanyakan hal ini -kepada Rasulullah-, dan beliau menjawab: \"Sesungguhnya ruh-ruh para syuhada’ itu ada di dalam tembolok burung hijau. Baginya ada lentera-lentera yang tergantung di 'Arsy. Mereka (bersama burung) bebas menikmati surga sekehendak mereka, kemudian singgah pada lentera-lentera itu. Kemudian Rabb mereka memperlihatkan diri kepada mereka dengan jelas, lalu bertanya: “Apakah kalian menginginkan sesuatu?” Mereka menjawab: “Apalagi yang kami inginkan sedangkan kami bisa menikmati surga dengan sekehendak kami?” Rabb mereka bertanya seperti itu sebanyak tiga kali. Maka tatkala mereka merasa bahwasanya mereka harus minta sesuatu, mereka berkata, “Wahai Rabb kami! kami ingin ruh kami dikembalikan ke jasad-jasad kami sehingga kami dapat berperang di jalan-Mu sekali lagi. “Maka tatkala Dia melihat bahwasanya mereka tidak mempunyai keinginan lagi, mereka ditinggalkan.” (as-Shahih 3/1503 no. 1887, kitab Imarah, bab penjelasan ruh-ruh orang yang mati syahid di surga)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "171. يَسْتَبْشِرُونَ (Mereka dalam keadaan gembira) Yakni kepada saudara-saudara mereka orang-orang yang beriman dan berjihad atas apa yang telah mereka lihat dari Allah bagi mereka berupa surga dan keridhaan-Nya. وَأَنَّ اللهَ لَا يُضِيعُ أَجْرَ الْمُؤْمِنِينَ (dan bahwa Allah tidak menyia-nyiakan pahala orang-orang yang beriman) Yakni mereka juga telah mengetahui bahwa Allah tidak menyia-yiakan pahala orang yang mengerjakan amal kebaikan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "171. Mereka gembira dengan nikmat dan kemuliaan yang diberikan Allah, dan bahagia dengan surga dan keridhaan yang akan diterima saudara mukmin mereka yang ikut berjihad. Sesungguhnya Allah tidak akan menghilangkan pahala orang mukmin atas amal shalihnya, bahkan akan menambahkan karuniaNya untuk mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka senang} senang {dengan nikmat} pahala yang besar {dan karunia dari Allah} penambahan karunia yang agung {dan sesungguhnya} mereka senang bahwa {Allah tidak menyia-nyiakan pahala orang-orang mukmin"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "171. “Mereka bergirang hati dengan nikmat dan karunia yang besar dari Allah,” maksudnya, sebagian mereka memberikan ucapan selamat kepada sebagian lainnya dengan ucapan selamat yang paling agung, yaitu nikmat Rabb mereka dan karuniaNya serta kebaikanNya. “Dan bahwa Allah tidak menyia-nyiakan pahala orang-orang yang beriman,” bahkan Allah mengembangkan dan memberikan balasan, serta menambahkan karuniaNya itu hingga mencapai derajat yang tidak mungkin dapat diraih oleh usaha mereka sendiri. Ayat-ayat ini menunjukkan Shahihnya kenikmatan di alam barzakh, dan bahwasanya orang-orang yang syahid berada pada tempat yang paling tinggi di sisi Rabb mereka. Di dalamnya terkandung adanya pertemuan antara ruh-ruh orang-orang yang shalih, ziarahnya sebagian mereka kepada sebagian lain, serta saling memberikan kabar gembira."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 171: Mereka bergirang hati dengan sebab (mendapat) nikmat dan kurnia dari Allah, sebab) Allah tidak menyia-nyiakan ganjaran Mu'minin. dan (dengan) sebab Allah tidak menyia-nyiakan ganjaran mukmin."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni pahala. Tambahan terhadap pahala. Bahkan akan memberinya pahala dan menambahnya. Dalam ayat ini terdapat penetapan adanya nikmat di alam barzakh, dan bahwa para syuhada berada di tempat yang sangat tinggi di sisi Tuhan mereka, di sana ruh-ruh orang-orang yang berbuat kebaikan saling bertemu, saling menziarahi dan menyampaikan berita gembira."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 171",
    "description": "Bahkan mereka, para syuhada, bergirang hati dengan nikmat dan karunia dari Allah berupa kebahagiaan hakiki, ketenangan jiwa, kehidupan yang menyenangkan dan abadi. Dan sungguh, Allah tidak menyia-nyiakan pahala orang-orang yang beriman, karena Allah tidak menggugurkan atau mengurangi amal perbuatan seseorang, selama dia benar-benar beriman dan ikhlas dalam beramalorang-orang yang betul-betul disebut pejuang yaitu orang-orang yang menaati perintah Allah dan rasul dengan sepenuh hati, bahkan setelah mereka mendapat luka dalam perang uhud berupa bencana dan musibah kekalahan, mereka tetap teguh pendirian dan tidak surut dalam melaksanakan perintah Allah. Orang-orang yang berbuat kebajikan dengan selalu memenuhi perintah Allah dan rasul-Nya dan bertakwa di antara mereka mendapat pahala yang besar berupa kenikmatan dan kebahagiaan abadi, dan diangkat derajatnya di sisi Allah."
  }
]