[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Yaitu orang-orang yang menyambut panggilan Allah dan rasulNYA, dan mereka keluar untuk membalas kaum musyrikin sampai daerah hamra’al-asad,setelah kekalahan mereka pada perang uhud,serta kondisi yang menimpa mereka berupa rasa sakit dan luka-luka,dan mereka tetap mengeluarkan puncak kesungguhan upaya mereka dan tetap berkomitmen dengan petunjuk nabi mereka. Bagi orang-orang yang berbuat baik dan orang-orang yang bertakwa dari mereka ada pahala yang besar."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "172. Orang-orang yang menjawab perintah Allah dan rasul-Nya ketika mereka diajak untuk pergi ke medan perang di jalan Allah dan berperang melawan orang-orang musyrik dalam perang ḥamrā`ul asad yang terjadi pasca perang Uhud, setelah mereka mengalami luka-luka dalam perang Uhud, tetapi hal itu tidak menghalangi mereka untuk menjawab seruan jihad dari Allah dan rasul-Nya, maka bagi orang-orang yang berbuat baik dalam amal perbuatan mereka dan bertakwa kepada Allah dengan menjalankan perintah-perintah-Nya dan menjauhi larangan-larangan-Nya itu ada ganjaran yang sangat besar dari Allah, yaitu Surga."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "172. Orang-orang yang mentaati Allah dan rasul-Nya serta mengikuti perang Uhud untuk mengejar orang-orang musyrik menuju Hamra’ul asad -desa sejauh 20 km dari Madinah di bagian selatan- setelah mendapat kekalahan dan mengalami luka parah, maka balasan bagi mereka yang berbuat baik dan bertakwa kepada Allah adalah surga. Disebutkan dari Aisyah tentang ayat 172 ini, ia berkata kepada ‘Urwah: Hai keponakanku, ketika itu dua ayahmu termasuk dari mereka, yaitu Zubair dan Abu Bakar. Ketika Rasulullah mendapatkan kekalahan di perang Uhud, kemudian orang-orang musrik meninggalkan Uhud karena takut kaum muslimin akan kembali.” Rasulullah bertanya: “Siapa yang mengejar hendak mereka?” maka 70 orang bersukarela untuk mengejar mereka. Rasulullah bersabda: “Di antara mereka terdapat Abu Bakar dan Zubair.” (shahih Bukhari 7/432 no. 4077, kitab peperangan-peperangan Rasulullah, bab {الذين استجابوا لله والرسول...})."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "172. الَّذِينَ اسْتَجَابُوا۟ لِلَّـهِ وَالرَّسُولِ (Yaitu) orang-orang yang mentaati perintah Allah dan Rasul-Nya) Yakni ketika Allah dan Rasul-Nya menyeru mereka untuk menghadapi Abu Sufyan dan tantara kafir Quraisy setelah mereka kembali dari perang Uhud. مِنۢ بَعْدِ مَآ أَصَابَهُمُ الْقَرْحُ ۚ (sesudah mereka mendapat luka (dalam peperangan Uhud)) Yakni luka dan kerasnya peperangan. لِلَّذِينَ أَحْسَنُوا۟ مِنْهُمْ وَاتَّقَوْا۟ أَجْرٌ عَظِيمٌ(Bagi orang-orang yang berbuat kebaikan diantara mereka dan yang bertakwa ada pahala yang besar) Dari Aisyah bahwa ia berkata kepada Urwah bin Zubair: wahai anak saudariku, kedua ayahmu Zubair dan Abu Bakar adalah termasuk dari mereka (orang-orang dimaksud dari ayat ini)"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "172. (Yaitu) orang-orang yang menaati Allah dan rasulNya saat berangkat berperang setelah mereka menerima luka di perang Uhud. Bagi orang-orang yang memperbaiki amal mereka dengan berbuat ketaatan dan berjihad itu pahala yang melimpah. Ayat ini turun ketika Nabi SAW memerintahkan para sahabat agar memburu pasukan Abu Sufyan bersama beliau setelah perang Uhud. Lalu mereka turun di lembah sempit sedangkan jumlah mereka 70 orang. Mereka berlari mencari Abu Sufyan sehingga sampai di padang pasir, lalu Allah menurunkan ayat: {Alladziinastajaabuu}"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang memenuhi seruan Allah dan Rasul setelah mereka menderita luka-luka} luka yang mereka terima. {bagi Orang-orang yang berbuat kebaikan dan bertakwa di antara mereka itu pahala yang sangat besar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "172-173. Ketika Nabi kembali dari Uhud menuju ke Madinah dan mendengar bahwa Abu Sufyan beserta orang-orang yang bersamanya dari kaum musyrikin hendak kembali menyerang Madinah, maka beliau menyeru kembali para sahabatnya untuk bersiap perang. Maka mereka berangkat dengan kondisi masih terluka, demi memunuhi panggilan Allah dan RasulNya, dan menaati Allah dan rasulNya, hingga akhirnya sampailah mereka pada suatu tempat yang bernama Hamra’ al-Asad. Lalu datanglah seseorang kepada mereka seraya berkata, “Sesungguhnya manusia telah mengumpulkan pasukan untuk menyerangmu,” mereka bertekad untuk menghancurkan kalian, sebagai suatu tindakan menakuti dan menggentarkan mereka. Akan tetapi hal itu tidaklah menambah bagi mereka kecuali iman kepada Allah dan bertawakal kepadaNya, “dan mereka menjawab, ‘Cukuplah Allah menjadi penolong kami’, “ maksudnya, cukuplah Dia dari segala hal yang mengkhawatirkan kita, “dan Allah adalah sebaik-baik Pelindung,” yaitu Dzat yang diserahkan kepadaNya urusan hamba-hambaNya dan yang memenuhi kemaslahatan bagi mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 172: Orang-orang yang memperkenankan ajakan Allah dan Rasul, sesudah mendapat luka besar, adalah bagi yang berbuat kebaikan dari mereka dan yang berbakti, satu ganjaran yang besar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu surga."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 172",
    "description": "Orang-orang yang betul-betul disebut pejuang yaitu orang-orang yang menaati perintah Allah dan rasul dengan sepenuh hati, bahkan setelah mereka mendapat luka dalam perang uhud berupa bencana dan musibah kekalahan, mereka tetap teguh pendirian dan tidak surut dalam melaksanakan perintah Allah. Orang-orang yang berbuat kebajikan dengan selalu memenuhi perintah Allah dan rasul-Nya dan bertakwa di antara mereka mendapat pahala yang besar berupa kenikmatan dan kebahagiaan abadi, dan diangkat derajatnya di sisi Allah. Orang-orang yang mendapat pahala besar adalah orang-orang yang menaati Allah dan rasul. Mereka memenuhi perintah Allah untuk berjuang yang ketika ada sekelompok orang-orang munafik yang loyal kepada kaum musyrikin mengatakan kepadanya dengan nada mengejek dan meniupkan rasa ketakutan terhadap orang-orang mukmin, orangorang quraisy telah mengumpulkan pasukan untuk menyerang kamu dengan jumlah pasukan yang lebih besar dan persiapan lebih matang, karena itu takutlah kepada mereka. Ternyata ucapan mereka itu tidak membuat orang-orang mukmin gentar dan takut, justru menambah kuat iman mereka dan mereka menjawab dengan teguh dan mantap, cukuplah Allah menjadi penolong bagi kami dalam melawan setiap musuh dan dia sebaik-baik pelindung yang selalu melindungi dari setiap penyerang, dan membela dari setiap penyerbu, karena kami adalah tentara Allah."
  }
]