[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan mereka itu adalah orang-orang yang sebagian kaum musyrikin berkata kepada mereka, ”sesungguhnya Abu sufyan dan orang-orang yang bersamanya telah membulatkan tekad mereka untuk kembali menyerang kalian untuk memusnahkan kalian, maka wasapadalah kepada mereka dan takutlah terhadap mereka, karena tidak ada kekuatan dari kalian untuk menahan mereka.” Namun intimidasi itu justru meningkat keyakinan dan kepercayaan mereka terhadap apa yang Allah janjikan kepada mereka,dan tidak membelokkan mereka dari tekad mereka. Maka mereka berjalan menuju apa yang dikehendaki Allah, dan berkata, ”hasbunallah”,artinya cukuplah Allah sebagai penolong kami. Dan dia sebaik-baik pelindung,yang di serahkan kepadaNYA pengaturan urusan hamba-hambaNYA."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "173. Yaitu orang-orang yang diberitahu oleh sebagian orang musyrik bahwa orang-orang Quraisy di bawah komando Abu Sufyan telah menghimpun pasukan yang sangat besar untuk menyerang dan menghabisi kalian, maka berhati-hatilah dan takutlah kalian dalam menghadapi mereka,” maka ucapan dan peringatan itu justru menambah kepercayaan mereka kepada Allah dan keyakinan mereka akan kebenaran janji-Nya. Maka mereka pun berangkat untuk menghadapi orang-orang musyrik tersebut seraya berkata, “Allah -Ta'ālā- yang akan melindungi kami. Dan Dia adalah sebaik-baik Żat yang kami serahkan urusan kami kepada-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "173. orang-orang yang taat kepada Allah dan rasul-Nya adalah mereka yang ketika ditakut-takuti bahwa Quraisy telah menyiapkan pasukan yang besar untuk memerangi kalian, mereka bertambah keteguhan dan keimanannya kepada janji Allah bagi mereka, dan menunaikan kewajiban mereka, kemudian berkata: “Allah akan mencukupkan dan menjaga kami. Dia adalah sebaik-baik penolong bagi para kekasih-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "173. الَّذِينَ قَالَ لَهُمُ النَّاسُ إِنَّ النَّاسَ ((Yaitu) orang-orang (yang mentaati Allah dan Rasul) yang kepada mereka ada orang-orang mengatakan: “Sesungguhnya manusia) Yang dimaksud orang-orang disini adalah seorang Arab badui yang diutus Abu Sufyan. قَدْ جَمَعُوا۟ لَكُمْ (telah mengumpulkan pasukan untuk menyerang kamu) Yakni Abu Sufyan dan para sahabatnya. فَزَادَهُمْ (maka itu menambah mereka) Yakni perkataan itu menambah keimanan mereka dan tidak mempengaruhi mereka dengan ketakutan. وقالوا حسبنا الله ونعم الوكيل (dan mereka menjawab: “Cukuplah Allah menjadi Penolong kami dan Allah adalah sebaik-baik Pelindung”.) Yakni cukuplah Allah yang menghentikan kejahatan mereka dan kepada-Nya kami bertawakkal dan menyandarkan urusan kami. وَقَالُوا۟ حَسْبُنَا اللهُ وَنِعْمَ الْوَكِيلُ(dan mereka menjawab: “Cukuplah Allah menjadi Penolong kami dan Allah adalah sebaik-baik Pelindung”)"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "173. Yaitu orang-orang yang diberitahu orang lain (orang Baduwi yang diutus Abu Sufyan) di perang Hamraul Asad setelah perang Uhud: “Sesungguhnya orang-orang (musyrik Mekah) telah mengumpulkan banyak orang untuk memerangi kalian, maka waspadailah mereka” Perkataan itu menambah keimanan mereka kepada Allah dan berkata: “Cukuplah Allah yang Kami serahi perkara tentang mereka, dan Dialah sebaik-baik Dzat yang diserahi suatu perkara.” Lalu mereka berangkat sehingga sampai pada sisi lembah. Lalu Allah memberikan ketakutan dalam hati Abu Sufyan dan para sahabatnya, sehingga mereka tidak jadi datang. Dan Nabi SAW bersabda: “Demi Dzat yang memegang takdirku, sungguh aku akan tetap berangkat meskipun sendirian”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka yang ketika manusia berkata kepada mereka, “Sesungguhnya orang-orang telah berkumpul untuk (menyerang) kalian. maka takutlah kepada mereka,”} maka waspadailah mereka {dan itu menambah} ucapan dan ancaman itu {iman mereka} keimanan dan keyakinan kepada Allah {mereka menjawab, “Cukuplah bagi kami} cukuplah bagi kami {Allah dan Dia sebaik-baik pelindung.”} Dzat yang diserahi segala perkara"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "172-173. Ketika Nabi kembali dari Uhud menuju ke Madinah dan mendengar bahwa Abu Sufyan beserta orang-orang yang bersamanya dari kaum musyrikin hendak kembali menyerang Madinah, maka beliau menyeru kembali para sahabatnya untuk bersiap perang. Maka mereka berangkat dengan kondisi masih terluka, demi memunuhi panggilan Allah dan RasulNya, dan menaati Allah dan rasulNya, hingga akhirnya sampailah mereka pada suatu tempat yang bernama Hamra’ al-Asad. Lalu datanglah seseorang kepada mereka seraya berkata, “Sesungguhnya manusia telah mengumpulkan pasukan untuk menyerangmu,” mereka bertekad untuk menghancurkan kalian, sebagai suatu tindakan menakuti dan menggentarkan mereka. Akan tetapi hal itu tidaklah menambah bagi mereka kecuali iman kepada Allah dan bertawakal kepadaNya, “dan mereka menjawab, ‘Cukuplah Allah menjadi penolong kami’, “ maksudnya, cukuplah Dia dari segala hal yang mengkhawatirkan kita, “dan Allah adalah sebaik-baik Pelindung,” yaitu Dzat yang diserahkan kepadaNya urusan hamba-hambaNya dan yang memenuhi kemaslahatan bagi mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 173: (Ialah) mereka yang orang-orang hadapkan perkataan: \"Sesungguhnya kaum (Quraisy) itu telah kumpulkan (tentara) buat (memerangi) kamu. Lantaran itu, hendaklah kamu takut kepada mereka itu.\" Maka (perkataan itu) menambah iman mereka dan mereka berkata: \"Allah cukup buat kami, dan Ia sebaik-baik Penjaga."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya: orang-orang Quraisy."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 173",
    "description": "Orang-orang yang mendapat pahala besar adalah orang-orang yang menaati Allah dan rasul. Mereka memenuhi perintah Allah untuk berjuang yang ketika ada sekelompok orang-orang munafik yang loyal kepada kaum musyrikin mengatakan kepadanya dengan nada mengejek dan meniupkan rasa ketakutan terhadap orang-orang mukmin, orangorang quraisy telah mengumpulkan pasukan untuk menyerang kamu dengan jumlah pasukan yang lebih besar dan persiapan lebih matang, karena itu takutlah kepada mereka. Ternyata ucapan mereka itu tidak membuat orang-orang mukmin gentar dan takut, justru menambah kuat iman mereka dan mereka menjawab dengan teguh dan mantap, cukuplah Allah menjadi penolong bagi kami dalam melawan setiap musuh dan dia sebaik-baik pelindung yang selalu melindungi dari setiap penyerang, dan membela dari setiap penyerbu, karena kami adalah tentara Allah. Maka dengan bekal keimanan dan tekad yang kuat itu akhirnya mereka kembali pulang dengan nikmat dan karunia yang besar dari Allah berupa pahala kebaikan, kesejahteraan, dan kemuliaan, mereka tidak ditimpa suatu bencana atau suatu hal yang tidak mereka sukai, dan tidak berjumpa dengan seorang musuh dan mereka mengikuti keridaan Allah dengan mengikuti perintah-Nya. Allah mempunyai karunia yang besar yang diperuntukkan bagi orang-orang yang berjuang di jalan Allah, baik di dunia berupa kemenangan, maupun di akhirat kelak berupa kebahagiaan abadi."
  }
]