[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka mereka kembali dari hamra’al-asad menuju Madinah dengan meperoleh kenikmatan dari Allah berupa pahala yang besar dan keutamaan dariNYA berupa kedudukan yang tinggi. Dan sesungguhnya mereka telah bertambah keimanan dan keyakinan serta juga berhasil menghinakan musuh-musuh Allah dan beruntung dengan memperoleh keselamatan dari terbunuh dan peperangan, serta mereka mengikuti keridahaan Allah dengan ketaatan mereka kepadaNYA dan kepada rasulNYA. Dan Allah memiliki kebaiakan dan pemberian yang banyak yang meliputi mereka dan orang selain mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "174. Maka setelah mereka kembali dari pertempuran ḥamrā`ul asad, mereka mendapatkan pahala yang sangat besar dari Allah dan mendapatkan derajat, serta selamat dari musuh, tidak ada yang terbunuh dan tidak ada yang terluka. Dan mereka melakukan apa yang mengundang rida Allah kepada mereka, yakni senantiasa patuh dan tidak durhaka kepada-Nya. Dan Allah memiliki anugerah yang sangat besar bagi hamba-hamba-Nya yang beriman."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "174. ketika orang-orang Musyrik melihat tekat yang besar dari orang-orang beriman untuk melanjutkan jihad, mereka menjadi takut menghadapi mereka. Maka orang-orang beriman kembali dengan kenikmatan dan keselamatan tanpa terkena sesuatu yang membahayakan, dan dengan demikian mereka telah menitih jalan keridhaan Allah. Allah memiliki karunia yang besar bagi mereka dan bagi orang-orang beriman pada umumnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "174. فَانقَلَبُوا۟ (Maka mereka kembali) Yakni maka mereka keluar dibelakang tantara kafir Quraisy. بِنِعْمَةٍ مِّنَ اللهِ (dengan nikmat dari Allah) Yakni keselamatan dari musuh mereka serta kesejahteraan.. وَفَضْلٍ (dan karunia (yang besar)) Yakni berupa pahala yang Allah karuniakan kepada mereka. Dan pendapat lain mengatakan yang dimaksud adalah keuntungan dalam perniagaan. وَاتَّبَعُوا۟ رِضْوٰنَ اللهِ ۗ (mereka mengikuti keridhaan Allah) Yakni dalam apa yang mereka lakukan atau tinggalkan, dan salah satunya adalah ketaatan mereka untuk keluar pada peperangan ini."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Pendekatan Al-Quran dalam membangun optimisme diri di hati orang beriman, membangun kekebalan yang kuat tanpa memburuknya kekalahan psikologis, dan dampak negatifnya pada individu dan bangsa, dan ayat-ayat yang membahas tentang itu sangat banyak, contohnya : { الَّذِينَ قَالَ لَهُمُ النَّاسُ إِنَّ النَّاسَ قَدْ جَمَعُوا لَكُمْ فَاخْشَوْهُمْ فَزَادَهُمْ إِيمَانًا } \"(Yaitu) orang-orang (yang mentaati Allah dan Rasul) yang kepada mereka ada orang-orang yang mengatakan: “Sesungguhnya manusia telah mengumpulkan pasukan untuk menyerang kamu, karena itu takutlah kepada mereka”, maka perkataan itu menambah keimanan mereka\". 2 ). Diantara sifat-sifat mukmin sejati adalah : senantiasa berbaik sangka kepada Allah, oleh karena itu tatkala mereka melihat kepada peristiwa-peristiwa yang terjadi mereka melihatnya dengan penuh optimis sekalipun nampak darinya tekanan yang amat besar, bersama dengannya mereka bersegera mengambil langkah terbaik dalam menyikapi sebab-sebab yang berkaitan dengan peristiwa itu, sehingga mereka dapat mempelajari setiap hikmah dari peristiwa itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "174. Mereka yang berangkat untuk perang Uhud itu kembali dengan selamat dari pasukan Quraisy. Allah melimpahkan pahala yang agung. Mereka tidak mendapatkan penderitaan dan musibah berupa kematian dan luka, karena mengabaikan musuh yang hendak menyerang. Melalui tindakan tersebut, mereka mengikuti keridhaan Allah yang diberikan untuk mereka, yaitu keridhaan yang melimpah. Dan Allah itu pemilik karunia yang agung atas hamba-hambaNya yang taat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka kembali} kembali {dengan nikmat dan karunia dari Allah. Mereka tidak ditimpa suatu bencana dan mereka mengikuti ridha Allah. Allah mempunyai karunia yang besar."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "174. “Maka mereka kembali,” maksudnya, mereka pulang, ”dengan nikmat dan karunia yang besar dari Allah, mereka tida mendapatkan bencana apa-apa, ” kabar itu sampai kepada kaum Musyirikin, bahwasanya Rasulloluh dan para sahabatnya telah bersiap memerangi kalian, serta orang-orang yang tidak ikut serta menyesal. Lalu Allah menjatuhkan rasa takut kepada mereka hingga akhirnya mereka terus kembali ke Mekkah. Kaum Mukminin juga kembali ke Madinah dengan kenikmatan dari Allah dan karuniaNya, dimana Allah telah memberikan karunia kepada mereka dengan bimbingan untuk bersiap berperang dalam kondisi seperti itu dan bertawakal kepada Rabb mereka. Kemudian Allah menetapkan pahala bagi mereka dengan pahala para pejuang sempurna, lalu karena kewajiban mereka untuk mentaati Tuhan mereka dan ketakwaan mereka dari bermaksiat kepadaNya, maka mereka mendapatkan pahala yang besar, dan ini merupakan karunia Allah atas mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 174: Maka kembalilah mereka\" itu dengan ni'mat dan kurnia dari Allah, dalam keadaan tidak mengenai mereka satu pun bahaya lantaran Allah, karena Allah itu mempunyai kurnia yang besar. mereka mencari keridlaan Allah, karena Allah mempunyai karunia yang besar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat 172, 173, dan 174, di atas membicarakan tentang Peristiwa perang Badar Shughra (Badar kecil) yang terjadi setahun setelah Perang Uhud. Sewaktu meninggalkan perang Uhud itu, Abu Sufyan pemimpin orang Quraisy menantang Nabi shallallahu 'alaihi wa sallam dan para sahabatnya bahwa dia bersedia bertemu kembali dengan kaum muslimin pada tahun berikutnya di Badar. Tetapi karena tahun itu (4 H) musim paceklik dan Abu Sufyan sendiri merasa takut, maka dia beserta tentaranya tidak jadi meneruskan perjalanan ke Badar, lalu dia menyuruh Nu'aim bin Mas'ud dan kawan-kawan pergi ke Madinah untuk menakut-nakuti kaum muslimin dengan menyebarkan kabar bohong, seperti yang disebutkan dalam ayat 173. Namun demikian, Nabi shallallahu 'alaihi wa sallam beserta para sahabat tetap maju ke Badar. Oleh karena tidak terjadi perang, dan pada waktu itu di Badar sedang musim pasar, maka kaum muslimin melakukan perdagangan dan memperoleh laba yang besar. Keuntungan ini mereka bawa pulang ke Madinah seperti yang disebutkan pada ayat 174."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 174",
    "description": "Maka dengan bekal keimanan dan tekad yang kuat itu akhirnya mereka kembali pulang dengan nikmat dan karunia yang besar dari Allah berupa pahala kebaikan, kesejahteraan, dan kemuliaan, mereka tidak ditimpa suatu bencana atau suatu hal yang tidak mereka sukai, dan tidak berjumpa dengan seorang musuh dan mereka mengikuti keridaan Allah dengan mengikuti perintah-Nya. Allah mempunyai karunia yang besar yang diperuntukkan bagi orang-orang yang berjuang di jalan Allah, baik di dunia berupa kemenangan, maupun di akhirat kelak berupa kebahagiaan abadi. Ketahuilah, wahai kaum mukmin, sesungguhnya mereka hanyalah setan yang berusaha untuk menakut-nakuti kamu dengan teman-teman setianya menebarkan rasa takut dalam hati orang-orang beriman, karena itu janganlah kalian takut kepada mereka dan terpengaruh oleh ucapan mereka, tetapi takutlah kepada-ku yang mahakuasa lagi mahaperkasa, yang memiliki kekuatan tak terkalahkan, jika kamu orang-orang beriman dan yakin akan pertolongan-ku."
  }
]