[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya pihak yang melemahkan semangat kalian dalam hal itu hanyalah setan yang datang kepada kalian untuk menakut-nakuti kalian terhadap para pengikutnya, maka janganlah kalian takut terhadap kaum musyrikin, karena sesungguhnya mereka itu manusia-manusia lemah yang tidak memiliki satupun penolong bagi mereka. Dan takutlah kalian hanya kepadaKU dengan melaksanakan ketaatan kepadaKU, bila kalian memang orang-orang yang beriman kepadaKU dan mengikuti rasulKU."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "175. Sesungguhnya yang menakut-nakuti kalian itu hanyalah setan. Dia menakut-nakuti kalian melalui para pendukung dan kawan-kawannya. Oleh karena itu, janganlah kalian takut kepada mereka. Karena mereka tidak mempunyai daya dan upaya sedikitpun. Tetapi takutlah kalian kepada Allah saja dengan senantiasa patuh kepada-Nya, jika kalian benar-benar beriman kepada-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "175. Allah memperingatkan orang-orang beriman dari orang-orang yang manakut-nakuti mereka dari para musuh -kaum musyrikin- agar menjadi takut. Mereka itu tidak lain hanyalah para penolong setan, maka janganlah kalian takut dari orang-orang musyrik, namun takutlah kalian hanya kepada Allah jika kalian beriman kepada-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "175. إِنَّمَا ذٰلِكُمُ (Sesungguhnya mereka itu) Yakni yang selalu menghalangi kalian wahai orang-orang yang beriman. الشَّيْطٰنُ يُخَوِّفُ أَوْلِيَآءَهُۥ (lain hanyalah syaitan yang menakut-nakuti (kamu) dengan kawan-kawannya) Maknanya adalah bahwa syaitan menakut-nakuti orang beriman dari para kawannya yaitu orang-orang kafir. Akan tetapi maksud dari kawan-kawannya adalah dari golongan syaitan itu sendiri jika dilihat dari sisi was-was yang timbul darinya. Dan pendapat lain mengatakan yang dimaksud dalam ayat adalah orang Arab badui yang menyampaikan kepada orang orang beriman ancaman dari Abu Sufyan. فَلَا تَخَافُوهُمْ (karena itu janganlah kamu takut kepada mereka) Yakni jangan takut kepada orang-orang kafir karena mereka termasuk kawan-kawan syaitan. Allah malarang mereka dari ketakutan dari orang-orang kafir agar tidak pengecut ketika melawan mereka dan enggan untuk keluar berperang. وَخَافُونِ (tetapi takutlah kepada-Ku) Yakni maka lakukanlah apa yang Aku perintahkan kepada kalian dan tinggalkan apa yang Aku larang. Dan Aku yang lebih berhak untuk ditakuti dan diperhatikan perintah dan larangan-Nya karena kebaikan dan keburukan berada di tangan-Ku."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "175. Wahai orang-orang mukmin, sesungguhnya orang yang menakut-nakuti kalian dengan berkata: “Sesungguhnya orang-orang musyrik” itu adalah setan yang menakut-nakuti orang mukmin dengan para penolongnya yang musyrik supaya kalian melarikan diri dari mereka, yaitu setan itu menakut-nakuti kalian dengan para penolongnya. Maka janganlah takut dengan orang-orang kafir, sesungguhnya mereka adalah para penolong setan yang hanya memberi petunjuk kepada kebathilan, namun takutlah kepadaKu dengan menjalankan perintahKu dan jangan sampai mengingkarinya, serta tingalkanlah perkara yang Aku larang, jika kalian benar-benar orang mukmin."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya mereka} sesungguhnya yang menakut-nakuti kalian {itu setan yang menakut-nakuti dengan teman-teman setianya.} menakuti kalian dengan para teman-temannya yang kafir {Maka janganlah takut kepada mereka, tetapi takutlah kepadaKu, jika kalian orang-orang mukmin"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "175. Kemudian Allah berfirman, ”sesungguhnya mereka itu tidaklah lain hanyalah setan yang menakut-nakuti kamu dengan kawan-kawanya orang-orang qurais,” maksudnya, sesungguhnya ancaman seseorang dari kaum musyrikin bahwa mereka, ”telah mengumpulkan pasukan untuk menyerangmu, ” adalah salah seorang penyeru setan, dimana para wali setan itu menakut-nakuti orang-orang yang tidak memiliki iman dihati mereka atau iman mereka lemah. “Karena itu janganlah kamu takut kepad mereka, tetapi takutlah kepadaku, jika kamu benar-benar orang-orang yang beriman,” maksudnya, janganlah kalian takut kepada kaum Musyrikin yang merupakan wali-wali setan, karena sesungguhnya nasib-nasib mereka ada di tangan Allah, dimana mereka tidak mampu untuk bertindak kecuali dengan takdirNya, akan tetapi takutlah kepada Allah yang akan membela wali-waliNya yang takut kepadaNya dan memenuhi panggilanNya. Dalam Ayat ini mewujibkan takut kepada Allah semata dan bahwa takut itu adalah konsekuensi iman. Karena setinggi tingkat kadar keimanan seorang hamba maka setinggi itu pulalah kadar takutnya kepada Allah. takut yang terpuji adalah dapat menghalangi seorang hamba dari hal-hal yang di haramkan oleh Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 175: Yang demikian, tidak lain melainkan setan hendak menakut-nakuti pengikut-pengikutnya. Lantaran itu, janganlah kamu takut kepada mereka, tetapi takutlah kepada-Ku, jika memang kamu itu orang-orang yang beriman."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dalam ayat ini terdapat perintah untuk takut hanya kepada-Nya saja dan bahwa hal itu termasuk konsekwensi keimanan. Takutnya seorang hamba kepada Allah sejauh mana keimanannya dan takut yang terpuji adalah takut yang menghalangi hamba dari berbuat maksiat kepada Allah Azza wa Jalla."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 175",
    "description": "Ketahuilah, wahai kaum mukmin, sesungguhnya mereka hanyalah setan yang berusaha untuk menakut-nakuti kamu dengan teman-teman setianya menebarkan rasa takut dalam hati orang-orang beriman, karena itu janganlah kalian takut kepada mereka dan terpengaruh oleh ucapan mereka, tetapi takutlah kepada-ku yang mahakuasa lagi mahaperkasa, yang memiliki kekuatan tak terkalahkan, jika kamu orang-orang beriman dan yakin akan pertolongan-ku setelah menjelaskan pujian kepada orang-orang mukmin yang giat memenuhi panggilan rasul, pada ayat ini Allah mengecam tindakan orang-orang munafik yang bergegas dalam kekufuran sehingga menimbulkan rasa cemas di hati rasulullah. Karenanya Allah menghibur nabi. Dan janganlah engkau, wahai nabi Muhammad, dirisaukan oleh tingkah laku orang-orang yang dengan mudah kembali menjadi kafir, yang tenggelam dalam kesesatan dan terus-menerus dalam penyimpangan. Sesungguhnya sedikit pun mereka tidak merugikan Allah, akan tetapi tindakan mereka pada hakikatnya merugikan diri mereka sendiri. Allah tidak akan memberi bagian pahala kepada mereka di akhirat berupa kenikmatan dan surga, dan mereka akan mendapat azab yang besar berupa siksa yang pedih di akhirat sebagai balasan atas kejahatan yang mereka lakukan."
  }
]