[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Janganlah sampai orang-orang kafir itu memasukan rasa kesedihan ke dalam hatimu (wahai rasul), dengan begitu cepatnya mereka dalam pengingkaran dan kesesatan. Sesungguhnya dengan sikap itu,mereka tidak akan dapat memberi kemudaratan kepada Allah dengan sesuatupun. Mereka itu sesungguhnya hanyalah memudaratkan diri mereka sendiri dengan mengahalangi diri mereka dari manisnya iman dan agungnya pahala. Allah menghendaki agar tidak memberikan pahala bagi mereka di akhirat,di karenakan mereka telah berpaling dari seruan kebenaran.Dan bagi mereka siksaan yang dahsyat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "176. Janganlah kamu -wahai Nabi- dibuat sedih oleh orang-orang yang bersegera menjadi kafir. Yaitu orang-orang munafik yang murtad. Karena mereka tidak akan dapat merugikan Allah sedikit pun. Mereka hanya merugikan diri mereka sendiri dengan sikap mereka yang menjauhi keimanan dan ketaatan kepada Allah. Allah ingin menelantarkan dan tidak memberi petunjuk kepada mereka itu, sehingga mereka tidak mendapatkan bagian dari kenikmatan Akhirat. Dan mereka akan mendapatkan azab yang besar di dalam Neraka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "176. Hai Rasulullah, janganlah kamu bersedih akibat orang-orang munafik dan kafir yang bersegera mendustakan Allah dan meragukan agama. Mereka dengan melakukan itu tidak akan memberi mudharat kepada Allah sedikitpun. Namun Allah menghendaki agar mereka tidak mendapat bagian pahala di akhirat, namun mereka mendapat azab yang keras dan menyakitkan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "176. وَلَا يَحْزُنكَ الَّذِينَ يُسٰرِعُونَ فِى الْكُفْرِ ۚ (Janganlah kamu disedihkan oleh orang-orang yang segera menjadi kafir) Ada pendapat mengatakan mereka adalah kaum yang murtad lalu itu menjadikan Rasulullah bersedih hati, maka Allah menghiburnya dan melarangnya dari bersedih hati. Dan pendapat lain mengatakan: dahulu Rasulullah terlalu berlebihan dalam kesedihan atas kekafiran kaumnya, maka Allah melarangnya untuk berlebihan dalam merasa sedih karena hal itu sebagaimana firman-Nya: فلا تذهب نفسك عليهم حسرات إِنَّهُمْ لَن يَضُرُّوا۟ اللهَ شَيْـًٔا ۗ( sesungguhnya mereka tidak sekali-kali dapat memberi mudharat kepada Allah sedikitpun) Yakni kakafiran mereka tidak akan mengurangi kekuasaan Allah sedikitpun. Pendapat lain mengatakan yakni mereka tidak akan mampu memberi mudharat atas agama Allah yang disyariatkan atas hamba-hamba-Nya. يُرِيدُ اللهُ أَلَّا يَجْعَلَ لَهُمْ حَظًّا(Allah berkehendak tidak akan memberi sesuatu bahagian (dari pahala) kepada mereka) Yakni bagian jatah kenikmatan di surga atau bagian jatah pahala. وَلَهُمْ عَذَابٌ عَظِيمٌ (dan bagi mereka azab yang besar) yang disebabkan karena mereka bersegera dalam hal kekafiran sehingga mudharat kekafiran itu kembali kepada mereka dan mengakibatkan mereka tidak mendapat bagian pahala di akhirat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "176. Wahai Nabi, janganlah orang-orang yang keluar dari Islam setelah perang Uhud, yaitu orang-orang munafik itu membuatmu sedih dan terganggu. Sesungguhnya mereka itu tidak akan bisa memberi mudharat kepada Allah sedikitpun dengan kekufuran mereka. Kekufuran mereka itu tidak akan mengurangi kekuasaan Allah sedikitpun. Allah tidak akan memberikan sedikitpun pahala, surga atau rahmatNya bagi mereka, melainkan azab yang agung akibat ketergesa-gesaan mereka untuk berbuat kufur dan murtad."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Janganlah kamu dirisaukan oleh orang-orang yang dengan cepat melakukan kekufuran} orang-orang munafik berhenti pada kekufuran dengan cepat, karena keinginan dan kecintaan mereka terhadap kekufuran itu {Sesungguhnya sedikit pun mereka tidak merugikan Allah. Allah tidak akan memberi mereka bagian} bagian pahala {di akhirat dan bagi mereka itu azab yang sangat besar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "176. Nabi sangatlah semangat berbuat baik kepada makhluk dan berusaha memberikan petunjuk kepada mereka. beliau sedih hati apabila mereka mereka tidak mendapatkan petunjuk Allah berfirman, ”janganlah kamu disedihkan oelh oaring-orang yang segara menjadi kafir,” karena keinginan mereka yang begitu besar padanya dan anutias mereka padanya. “Sesungguhnya mereka sekali-kali tidak memberikan mudharat kepada Allah sedikitpun,” Allah adalah pembela agamaNya, penolong RasulNya dan penberlaku urusanya tanpa mereka. Allah menghinakan mereka dan tidak memberikan bimbingan kepada mereka sebagaimana Allah memberikan bimbingan itu kepada wali-waliNya, dan barang siapa yang dikehendaki oleh Allah baik, sebagai suatu keadilan baginya atau suatu hikmah, niscaya Allah akan memberi tahunya bahwa mereka itu tidaklah suci untuk mendapatkan petunjuk dan tidak pula mereka menerima jalan yang lurus disebabkan akhlak mereka rusak dan tujuan mereka buruk."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 176: Dan janganlah mendukacitakanmu orang-orang yang bersegera kepada kekufuran, karena mereka itu tidak dapat menyusahkan Allah sedikit jua pun, membikin mereka tidak dapat bagian (baik) di Akhirat; dan adalah bagi mereka adzab yang besar. Allah hendak membuat mereka tidak memiliki bagian di akhirat; dan bagi mereka adzab yang besar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Nabi Muhammad shallallahu 'alaihi wa sallam sangat perhatian kepada manusia, Beliau bersungguh-sungguh agar mereka mendapatkan hidayah dan bersedih jika mereka tidak memperolehnya. Orang-orang kafir Mekah atau orang-orang munafik yang selalu merongrong agama Islam. Allah akan tetap memenangkan agama-Nya, membela rasul-Nya dan mewujudkan ketetapan-Nya tanpa membutuhkan mereka. Bahkan mereka hanyalah merugikan diri mereka sendiri. Yakni surga. Oleh karena itu, Allah membiarkan mereka; tidak memberi mereka taufiq sebagaimana wali-wali-Nya yang diberi taufiq sebagai keadilan dan hikmah-Nya, karena Dia mengetahui bahwa mereka tidak mau menerima petunjuk disebabkan akhlak dan niat mereka yang buruk."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 176",
    "description": "Setelah menjelaskan pujian kepada orang-orang mukmin yang giat memenuhi panggilan rasul, pada ayat ini Allah mengecam tindakan orang-orang munafik yang bergegas dalam kekufuran sehingga menimbulkan rasa cemas di hati rasulullah. Karenanya Allah menghibur nabi. Dan janganlah engkau, wahai nabi Muhammad, dirisaukan oleh tingkah laku orang-orang yang dengan mudah kembali menjadi kafir, yang tenggelam dalam kesesatan dan terus-menerus dalam penyimpangan. Sesungguhnya sedikit pun mereka tidak merugikan Allah, akan tetapi tindakan mereka pada hakikatnya merugikan diri mereka sendiri. Allah tidak akan memberi bagian pahala kepada mereka di akhirat berupa kenikmatan dan surga, dan mereka akan mendapat azab yang besar berupa siksa yang pedih di akhirat sebagai balasan atas kejahatan yang mereka lakukansesungguhnya orang-orang munafik yang membeli kekafiran dengan iman, tindakan buruk mereka sedikit pun tidak merugikan Allah melainkan dampak buruknya kembali kepada mereka sendiri, dan mereka akan mendapat azab yang pedih akibat kemunafikan dan kekafiran yang mereka perbuat."
  }
]