[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang yang menukarkan keimanan dengan kekafiran,mereka itu sekali-kali tidak akan dapat memberikan mudarat kepada Allah sedikitpun. Bahkan kemadorotan dari perbuatan mereka itu kembali kepada mereka sendiri.Dan bagi mereka di akhirat kelak siksaan yang pedih."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "177. Sesungguhnya orang-orang yang menukar iman dengan kekafiran itu tidak akan merugikan Allah sedikit pun. Karena Dia adalah Rabb Yang Mahakaya lagi Maha Perkasa. Sesungguhnya mereka hanya merugikan diri mereka sendiri. Dan mereka akan mendapatkan azab yang sangat pedih di Akhirat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "177. Orang-orang yang lebih memilih kekafiran daripada keimanan tidak akan memberi mudharat kepada Allah sedikitpun. Dan bagi mereka azab yang pedih."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "177. إِنَّ الَّذِينَ اشْتَرَوُا۟ الْكُفْرَ بِالْإِيمٰنِ (Sesungguhnya orang-orang yang menukar iman dengan kekafiran) Yakni mengganti keimanan dengan kekafiran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "177. Sesungguhnya orang-orang yang memilih kekufuran dan membuatnya sebagai pengganti iman, maka kemurtadan mereka itu tidak akan memberi mudharat kepada Allah sedikit pun. Dan bagi mereka itu azab yang pedih di akhirat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang yang membeli} menukar {kekufuran dengan iman sedikit pun tidak merugikan Allah dan akan mendapat azab yang sangat pedih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "177. Kemudian Allah mengabarkan bahwa orang-orang telah memilih kekufuran daripada keimanan dan suka terhadapnya sebagaiman sukanya orang-orang siap mengerahkan segala hartanya untuk mendapatkan barang yang disukainya, ”sekali-kali mereka tidak dapat memberi mudhrat kepada Allah sedikitpun, ” akan tetapi dari perbuatan mereka itu akan kembali kepada mereka sendiri. Karena itu Allah berfirman, ”dan mereka mendapatkan azab yang pedih.” lalu bagaimanakah mereka dapat memberikan mudharat kepada Allah? sedangkan mereka telah sangat jauh dari keimanan dan sangat menyukai kekururan kepada yang Maha Penyayang, makalah Allah tidaklah butuh kepada mereka. Allah telah memiliki dari hamba-hambaNya yang baik dan bersih yang lebih baik dari orang-orang kafir itu bagi agamaNya, dan menyiapkan untuk agamanya orang-orang yang diridoinya untuyk membelanya dari orang-orang yang memiliki hati yang mantap dan akal yang cemerlang, dan orang-orang yang cerdik dari orang yang hebat. Allah berfirman : \"Katakanlah: “Berimanlah kamu kepadanya atau tidak usah beriman (sama saja bagi Allah). Sesungguhnya orang-orang yang diberi pengetahuan sebelumnya apabila Al Quran dibacakan kepada mereka, mereka menyungkur atas muka mereka sambil bersujud,\" –Al-isra:107-."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 177: Sesungguhnya orang membeli kekufuran dengan (harga) iman itu tidak akan bisa menyusahkan Allah sedikit jua pun, tetapi adalah bagi mereka siksa yang pedih."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 177",
    "description": "Sesungguhnya orang-orang munafik yang membeli kekafiran dengan iman, tindakan buruk mereka sedikit pun tidak merugikan Allah melainkan dampak buruknya kembali kepada mereka sendiri, dan mereka akan mendapat azab yang pedih akibat kemunafikan dan kekafiran yang mereka perbuat dan jangan sekali-kali orang-orang kafir itu mengira bahwa tenggang waktu yang kami berikan kepada mereka dengan memperpanjang umur dan tidak segera memberi hukuman atau menimpakan malapetaka kepada mereka, itu lebih baik baginya. Jika mereka mengerjakan amal saleh yang akan menyucikan dan membersihkan mereka dari sifat-sifat yang jelek, hal itulah yang akan bermanfaat bagi mereka. Akan tetapi, sesungguhnya tenggang waktu yang kami berikan kepada mereka dengan penundaan siksaan dan memberi tempo kepada mereka hanyalah agar dosa mereka semakin bertambah lantaran mereka belum sadar dan sehingga dengan demikian di akhirat mereka akan mendapat azab yang menghinakan di dalam neraka jahanam."
  }
]