[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan janganlah menyangka orang-orang yang ingkar bahwa sesungguhnya kami bila kami memanjangkan umur mereka dan memberikan kesenangan kepada mereka dengan berbagai kesenangan dunia, sedang kami belumlah menyiksa mereka akibat kekafiran dan dosa-dosa mereka, bahwa mereka itu telah memperoleh kebaikan denan hal itu bagi diri mereka, sesungguhnya kami hanyalah menunda siksaan mereka dan ajal mereka, agar mereka kian bertambah zhalim dan melampaui batas. Dan bagi mereka siksaan yang menghinakan dan menistakan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "178. Dan jangan sekali-kali orang-orang yang ingkar kepada Rabb mereka dan menolak syariat-Nya, menyangka bahwa penangguhan waktu dan umur panjang yang diberikan kepada mereka yang masih berstatus kafir lebih baik bagi diri mereka. Permasalahannya tidak seperti yang mereka sangka, karena sesungguhnya Kami memberikan penangguhan waktu kepada mereka itu semata-mata agar dosa-dosa mereka semakin bertambah dengan banyaknya perbuatan maksiat yang mereka lakukan. Dan mereka akan mendapatkan azab yang menghinakan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "178. Dan janganlah sekali-kali orang-orang kafir mengira Kami membiarkan mereka tanpa azab, Kami hanya mengakhirkan waktu azab mereka agar semakin banyak kemaksiatan yang mereka lakukan, sehingga dosa mereka semakin banyak dan siksaan bagi mereka semakin berat berupa azab yang menghinakan. Syeikh as-Syinqithi berkata: “Dalam ayat ini disebutkan bahwa Allah mengundur azab mereka agar dosa mereka bertambah dan siksaan mereka semakin berat. Dan dalam ayat lain dijelaskan bahwa Allah tidak membiarkan mereka penuh kenikmatan melainkan setelah mereka ditimpa kesempitan dan penderitaan, jika mereka tidak pula tunduk maka Allah akan membiarkan mereka bersenang-senang sampai Dia menurunkan azab secara tiba-tiba. Allah berfirman dalam surat al-A’raf: 94-95: وَمَا أَرْسَلْنَا فِي قَرْيَةٍ مِنْ نَبِيٍّ إِلَّا أَخَذْنَا أَهْلَهَا بِالْبَأْسَاءِ وَالضَّرَّاءِ لَعَلَّهُمْ يَضَّرَّعُونَ Kami tidaklah mengutus seseorang nabipun kepada sesuatu negeri, (lalu penduduknya mendustakan nabi itu), melainkan Kami timpakan kepada penduduknya kesempitan dan penderitaan supaya mereka tunduk dengan merendahkan diri. ثُمَّ بَدَّلْنَا مَكَانَ السَّيِّئَةِ الْحَسَنَةَ حَتَّىٰ عَفَوْا وَقَالُوا قَدْ مَسَّ آبَاءَنَا الضَّرَّاءُ وَالسَّرَّاءُ فَأَخَذْنَاهُمْ بَغْتَةً وَهُمْ لَا يَشْعُرُونَ Kemudian Kami ganti kesusahan itu dengan kesenangan hingga keturunan dan harta mereka bertambah banyak, dan mereka berkata: \"Sesungguhnya nenek moyang kamipun telah merasai penderitaan dan kesenangan\", maka Kami timpakan siksaan atas mereka dengan sekonyong-konyong sedang mereka tidak menyadarinya. Dan Allah menjelaskan dalam ayat lain bahwa pembiaran itu merupakan bagian dari tipu daya yang kuat dari Allah, Dia berfirman dalam surat al-Qalam: 44-45: .... سَنَسْتَدْرِجُهُمْ مِنْ حَيْثُ لَا يَعْلَمُونَ Maka serahkanlah (ya Muhammad) kepada-Ku (urusan) orang-orang yang mendustakan perkataan ini (Al Quran). Nanti Kami akan menarik mereka dengan berangsur-angsur (ke arah kebinasaan) dari arah yang tidak mereka ketahui, وَأُمْلِي لَهُمْ ۚ إِنَّ كَيْدِي مَتِينٌ Dan Aku memberi tangguh kepada mereka. Sesungguhnya rencana-Ku amat tangguh."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "178. وَلَا يَحْسَبَنَّ الَّذِينَ كَفَرُوٓا۟ أَنَّمَا نُمْلِى لَهُمْ (Dan janganlah sekali-kali orang-orang kafir menyangka, bahwa pemberian tangguh Kami kepada mereka) Yakni dengan memperpanjang umur dan memakmurkan kehidupan mereka atau dengan kemenangan di perang Uhud. خَيْرٌ لِّأَنفُسِهِمْ ۚ (adalah lebih baik bagi mereka) Akan tetapi hal itu tidaklah demikian. إِنَّمَا نُمْلِى لَهُمْ لِيَزْدَادُوٓا۟ إِثْمًا ۚ وَلَهُمْ عَذَابٌ مُّهِينٌ (Sesungguhnya Kami memberi tangguh kepada mereka hanyalah supaya bertambah-tambah dosa mereka; dan bagi mereka azab yang menghinakan) Allah mengabarkan bahwa Dia memanjangkan umur dan memakmurkan kehidupan mereka tidak lain adalah untuk menambah dosa-dosa mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Panjangnya usia seseorang tidak menjamin kebaikan bagi dirinya kecuali amalan baik yang ia kerjakan, karena terkadang panjangnya umur menjadi keburukan dan kerusakan bagi dirinya, maka orang-orang kafir yang Allah panjangkan bagi mereka usia dan kelapangan rezeki dan kesihatan tetapi semuanya itu bukanlah kebaikan bagi mereka, bahkan semuanya adalah keburukan, karena dengan semua itu mereka akan memperbanyak dosa.."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "178. Jangan sekali-sekali orang-orang kafir itu mengira bahwa Kami akan mememberi mereka panjang umur dan kesejahteraan hidup itu sebagai kebaikan bagi diri mereka, namun Kami memberi mereka tenggang waktu dan menunda ajal mereka supaya hukuman mereka bertambah akibat banyak bermaksiat. Dan bagi mereka itu azab yang rendah dan hina pada hari kiamat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jangan sekali-kali orang-orang kafir mengira} berprasangka {bahwa Kami memberi tanggang waktu bagi mereka} Kami memberi waktu mereka dengan umur panjang {itu baik bagi diri mereka. Sesungguhnya Kami memberi mereka tenggang waktu} memberi tenggang waktu {hanya agar dosa mereka makin bertambah dan mereka akan mendapat azab yang menghinakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "178. Maksudnya janganlah orang-orang kafir itu berprasangkan kepada Rabb mereka, lalu mereka mencampakan agamanya, dan memerangi RasulNya, bahwa kami membiarkan mereka dalam dunia ini dan tidak menghancurkan mereka itu adalah baik bagi diri mereka dan merupakan kecintaan kami kepada mereka. Semua itu tidak yang seperti mereka sangka, tapi semua itu disebabkan keburukan yang dikehendaki Allah kepada mereka dan tambahaan siksaan dan hukuman di samping siksaan tersebut. Karena itu Allah berfirman, ”sesungguhnya kami memberi tangguhnya kepada mereka hanyalah supaya bertambah-tambah dosa mereka dan supaya mereka menndapat yang menghinakan.” Allah menangguhkan bagi seorang yang zhalim hingga bertambahlah kezhalimanya dan di ikuti oleh kekufurannya hingga bila Allah menghukumnya, maka dia menghukumnya dengan hukuman yang Maha Perkasa Lagi Maha Kuasa, maka waspadalah orang-orang yang zhalim dari penanguhan tersebut, dan agar mereka tidak mengira bahwa Dzat yang Maha Besar Lagi Maha tinggi melupakan mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 178: Dan janganlah orang-orang kafir itu menyangka, bahwa Kami biarkan mereka itu, baik buat diri mereka. Kami tidak biarkan mereka melainkan supaya mereka bertambah dosa; dan adalah bagi mereka adzab yang menghina."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan memperpanjang umur mereka dan membiarkan mereka berbuat dosa sesuka hatinya. Oleh karena itu, hendaknya orang yang zalim waspada dengan diberikan tenggang waktu dan janganlah ia mengira bahwa dirinya lolos dari pantauan Allah Yang Maha Besar lagi Maha Tinggi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 178",
    "description": "Dan jangan sekali-kali orang-orang kafir itu mengira bahwa tenggang waktu yang kami berikan kepada mereka dengan memperpanjang umur dan tidak segera memberi hukuman atau menimpakan malapetaka kepada mereka, itu lebih baik baginya. Jika mereka mengerjakan amal saleh yang akan menyucikan dan membersihkan mereka dari sifat-sifat yang jelek, hal itulah yang akan bermanfaat bagi mereka. Akan tetapi, sesungguhnya tenggang waktu yang kami berikan kepada mereka dengan penundaan siksaan dan memberi tempo kepada mereka hanyalah agar dosa mereka semakin bertambah lantaran mereka belum sadar dan sehingga dengan demikian di akhirat mereka akan mendapat azab yang menghinakan di dalam neraka jahanam. Salah satu sunatullah bagi hamba-Nya ialah bahwa dia tidak membiarkan orang-orang mukmin tetap di dalam kesulitan sebagaimana halnya pada perang uhud Allah tidak akan membiarkan orang-orang yang beriman dengan keimanan yang mantap dan tulus sebagaimana dalam keadaan kamu sekarang ini, bercampur baur antara orang-orang mukmin yang betul-betul ikhlas dan jujur dengan orang munafik sehingga dia membedakan yang buruk dari yang baik melalui wahyu yang diturunkan kepada nabi Muhammad. Allah tidak akan memperlihatkan kepadamu hal-hal yang gaib, tetapi Allah memilih siapa yang dia kehendaki di antara rasul-rasul-Nya dengan diberi pengetahuan mampu melihat isi hati manusia, sehingga dapat mengetahui siapa orang-orang yang betul-betul beriman dan siapa di antara mereka yang munafik atau kafir. Karena itu, berimanlah kepada Allah dan rasul-rasul-Nya dengan menaati perintah rasulullah dan berjuang di jalan Allah. Jika kamu beriman dan bertakwa kepada-Nya dengan melaksanakan perintah dan meninggalkan larangan, maka kamu akan mendapat pahala yang besar dari sisi-Nya bersama para kekasih Allah di dalam surga yang penuh kenikmatan."
  }
]