[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah sekali-kali tidak akan membiarkan kalian wahai orang-orang yang beriman kepada Allah dan rasulNYA serta melaksanakan syari’atNYA, dalam kondisi kalian ini, dari bercampurnya orang mukmin dari kalian bersama dengan orang munafik, sehingga DIA memisahkan yang buruk (orang munafik) dari yang baik(orang mukmin), sehingga orang munafik dapat diketahui jati dirinya dari orang mukmin yang benar.Dan dikarenakan hikmah Allah, DIA tidak akan memperlihatkan kepada kalian (wahai kaum mukminin), perkara ghaib yang DIA ketahui dari perkara hamba-hambaNYA, sehingga kalian bisa langsung mengenal siapa orang mukmin dan siapa orang munafik dari mereka. Akan tetapi,DIA memisahkan antara mereka melalui cobaan-cobaan dan bencana. Hanya saja Allah telah memilih dari rasul-rasulNYA yang DIA kehendaki,lalu DIA memberitahukan kepadanya beberapa dari isi hati sebagian mereka melalui wahyu dariNYA. Maka berimanlah kepada Allah dan rasulNYA. Dan jika kalian beriman dengan keimanan yang benar dan kalian bertakwa kepada tuhan kalian dengan menjalankan amal ketaatan kepadaNYA, niscaya kalian akan mendapatkan pahala agung disisi Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "179. Tidaklah bijaksana bilamana Allah membiarkan kalian -wahai orang-orang mukmin- dalam kondisi bercampur baur dengan orang-orang munafik dan tidak ada perbedaan yang jelas di antara kalian, serta tidak ada kejelasan tentang orang-orang yang beriman dengan sungguh-sungguh, sampai Dia memisahkan kalian melalui berbagai macam kewajiban dan cobaan agar terlihat jelas siapa sosok mukmin yang baik dan siapa sosok munafik yang buruk. Dan tidaklah bijaksana bilamana Allah memberitahukan kepada kalian perkara yang gaib sehingga kalian bisa membedakan siapa yang mukmin dan siapa yang munafik. Akan tetapi Allah memilih orang yang Dia kehendaki di antara rasul-rasul-Nya untuk diberitahu sebagian dari perkara yang gaib. Sebagaimana Dia memberitahu Nabi Muhammad -Ṣallallāhu 'alaihi wa sallam- perihal kondisi orang-orang munafik. Maka berimanlah kalian kepada Allah dan rasul-Nya dengan sungguh-sungguh. Jika kalian beriman dengan sungguh-sungguh dan bertakwa kepada Allah dengan menjalankan perintah-perintah-Nya dan menjauhi larangan-larangan-Nya, niscaya kalian akan mendapatkan pahala yang sangat besar di sisi Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "179. Hai orang-orang beriman, Allah tidak akan membiarkan kalian tercampur dengan orang-orang munafik, sehingga Dia akan membedakan kalian dari mereka. Dan bukan merupakan hikmah Allah untuk menampakkan kepada kalian hal yang ghaib, namun Allah memilih dari para rasul-Nya yang Dia kehendaki untuk menampakkan kepadanya hal ghaib yang Dia kehendaki. Maka berimanlah kalian kepada Allah dan para rasul-Nya. Dan jika kalian beriman dan bertakwa kepada Allah maka balasan bagi kalian adalah surga."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "179. مَّا كَانَ اللهُ لِيَذَرَ الْمُؤْمِنِينَ عَلَىٰ مَآ أَنتُمْ عَلَيْهِ (Allah sekali-kali tidak akan membiarkan orang-orang yang beriman dalam keadaan kamu sekarang ini) Wahai orang-orang munafik, Allah sekali-kali tidak akan membiarkan orang-orang yang beriman dalam keadaan kamu sekarang ini; akan tetapi Dia menyuruh untuk mengambil wasilah dan sebab seperti perintah berjihad dan berhijrah. حَتَّىٰ يَمِيزَ الْخَبِيثَ (sehingga Dia menyisihkan yang buruk) Yakni yang munafik dan ahli maksiat. مِنَ الطَّيِّبِ ۗ (dari yang baik) Yakni yang mukmin dan yang suci. Pendapat lain mengatakan bahwa kaliamat ini ditujukan kepada orang orang beriman yakni Hai orang-orang beriman Allah tidak akan membiarkan kalian dalam keadaan kalian ini berupa bercampur baur dengan orang-orang munafik akan tetapi Allah akan membedakan kalain. وَمَا كَانَ اللهُ لِيُطْلِعَكُمْ عَلَى الْغَيْبِ(Dan Allah sekali-kali tidak akan memperlihatkan kepada kamu hal-hal yang ghaib) Sampai Dia membedakan antara yang baik dengan yang buruk. Karena hal yang ghaib hanya Allah yang mengetahuinya dan tidak akan ada yang mengetahuinya kecuali Dia. وَلٰكِنَّ اللهَ يَجْتَبِى مِن رُّسُلِهِۦ مَن يَشَآءُ ۖ (akan tetapi Allah memilih siapa yang dikehendaki-Nya di antara rasul-rasul-Nya) Yakni dengan memilihnya lalu menunjukkan kepadanya bagian dari hal ghaib untuk membedakan kalian. Sebagaimana yang terjadi pada Rasulullah yang menyebutkan nama-nama orang munafik, adapun selain nabi maka dapat mengetahui siapa orang munafik dengan melihat banyaknya kemaksiatan seseorang, keburukan agamanya, dan lewat tanda-tanda yang muncul dari mereka sebagaimana firman Allah: ولتعرفنهم في لحن القول \"Dan kamu benar-benar akan mengenal mereka dari kiasan-kiasan perkataan mereka\""
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Ummat ini telah melewati berbagai peristiwa-peristiwa yang sangat menakjubkan, dan dari peristiwa-peristiwa tersebut orang-orang pilihan tengah menunggu perkataan baik dari sosok-sosok yang mereka ikuti, akan tetapi sebagian dari mereka justru menjadi penghalang bagi mereka!! sehingga kegelisahan dan kesedihan terus bertambah dalam diri umat manusia, dan jika mereka mencoba untuk mentadabburi ayat ini, niscaya mereka akan mengetahui bahwa sesungguhnya kebaikan itu jauh lebih banyak dibandingkan ujian dan cobaan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "179. Allah tidak akan membiarkan orang-orang mukmin bercampur dengan orang-orang munafik, sehingga pada saat perang Uhud, Dia memisahkan keburukan (orang munafik dan orang yang berbuat kemaksiatan) dan kebaikan (orang mukmin dan orang yang tidak bersalah) dengan memberikan cobaan. Dan Allah tidak memperlihatkan kepada kalian hal-hal yang ghaib, wahai orang-orang mukmin sehingga kalian bisa orang munafik dengan pandanganNya. Akan tetapi Allah memilih salah satu utusanNya, dan menunjukkan kepadanya hal yang ghaib itu lalu memisahkan antara kalian dan orang munafik. Maka berimanlah kepada Allah dan rasulNya dengan benar dan ikhlas. Jika kalian benar-benar beriman dan menghindari apa yang dimurkai Allah berupa kemunafikan dan semacamnya, maka bagi kalian itu pahala yang agung pada hari kiamat. Ayat ini turun ketika orang-orang munafik berkata: “Muhammad mengira bahwa dia tahu siapa yang beriman dan yang mengingkarinya. Namun kita bersamanya dan dia tidak menyadarinya” Lalu Allah SWT menurunkan ayat ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah tidak akan membiarkan} membiarkan {orang-orang mukmin dalam keadaan sebagaimana kalian sekarang ini,} dalam keadaan yang kalian jalani sekarang bercampur dengan orang-orang munafik {sehingga Dia membedakan yang buruk} orang munafik {dari yang baik.} orang mukmin {Allah tidak akan memperlihatkan kepada kalian hal-hal yang ghaib, tetapi Allah memilih} memilih {siapa yang Dia kehendaki di antara rasul-rasulNya. Maka berimanlah kepada Allah dan rasul-rasulNya. Jika kalian beriman dan bertakwa, maka bagi kalian itu pahala yang sangat besar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "179. Maksudnya, bukanlah merupakan hikmah Allah bahwa Dia membiarkan kaum Mukminin berada dalam kondisi seperti yang kalian alami berupa campur-baur dan tidak ada pembedaan, hingga Allah memilah orang yang buruk dari yang baik, orang Mukmin dari orang munafik, orang yang benar dari orang yang dusta. Dan bukan merupakan hikmahNya juga bahwa hamba-hambaNya mengetahui hal ghaib yang Dia ketahui pada hambaNya, maka hikmah Allah yang agung menghendaki agar Allah menguji para hambaNya dan memberikan cobaan kepada mereka dengan perkara yang dapat membedakan antara yang buruk dari yang baik dengan beberapa bentuk ujian dan cobaan. Maka Allah mengutus para RasulNya dan memerintahkan mereka untuk taat, patuh, dan beriman kepada mereka. Lalu Allah menjanjikan kepada mereka atas keimanan dan ketakwaan itu dengan pahala yang besar. Maka terpecahlah manusia dari segi keikutsertaannya kepada Rasul menjadi dua bagian; orang-orang yang taat dan orang-orang yang durhaka, orang-orang yang Mukmin dan orang-orang yang munafik, dan orang-orang Muslim dan orang-orang yang kafir; agar hal itu mengakibatkan adanya pahala dan hukuman, dan agar tampaklah keadilan, kemuliaan, dan hikmahNya kepada makhlukNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 179: Allah tidak akan biarkan Mu'minin atas keadaan yang kamu ada padanya, yang jelek dari yang baik; dan Allah tidak akan tunjukkan kepada kamu perkara ghaib, tetapi Allah memilih dari rasul-rasulNya siapa yang la kehendaki. oleh karena itu, berimanlah kepada Allah dan rasul-rasul-Nya, karena jika kamu beriman dan kamu berbakti, maka adalah bagi kamu ganjaran yang besar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Keadaan di mana kaum muslimin bercampur baur dengan kaum munafik. Yakni dengan adanya beban-beban berat atau ujian yang dapat memperlihatkan keadaan hatinya. Seperti yang terjadi pada Perang Uhud, di mana hampir sepertiga pasukan memisahkan diri pulang ke Madinah. Mereka adalah orang-orang munafik. Sehingga kamu dapat menentukan siapa orang munafik dan siapa orang mukmin. Akan tetapi, setelah dibedakan oleh Allah, kamu pun dapat mengetahuinya. Di antara rasul-rasul, Nabi Muhammad shallallahu 'alaihi wa sallam dipilih oleh Allah dengan memberi keistimewaan kepada beliau berupa pengetahuan untuk menanggapi isi hati manusia, sehingga beliau dapat menentukan siapa di antara mereka yang betul-betul beriman dan siapa pula yang munafik atau kafir. Ada yang mengartikan dengan \"takut terhadap nifak\"."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 179",
    "description": "Salah satu sunatullah bagi hamba-Nya ialah bahwa dia tidak membiarkan orang-orang mukmin tetap di dalam kesulitan sebagaimana halnya pada perang uhud Allah tidak akan membiarkan orang-orang yang beriman dengan keimanan yang mantap dan tulus sebagaimana dalam keadaan kamu sekarang ini, bercampur baur antara orang-orang mukmin yang betul-betul ikhlas dan jujur dengan orang munafik sehingga dia membedakan yang buruk dari yang baik melalui wahyu yang diturunkan kepada nabi Muhammad. Allah tidak akan memperlihatkan kepadamu hal-hal yang gaib, tetapi Allah memilih siapa yang dia kehendaki di antara rasul-rasul-Nya dengan diberi pengetahuan mampu melihat isi hati manusia, sehingga dapat mengetahui siapa orang-orang yang betul-betul beriman dan siapa di antara mereka yang munafik atau kafir. Karena itu, berimanlah kepada Allah dan rasul-rasul-Nya dengan menaati perintah rasulullah dan berjuang di jalan Allah. Jika kamu beriman dan bertakwa kepada-Nya dengan melaksanakan perintah dan meninggalkan larangan, maka kamu akan mendapat pahala yang besar dari sisi-Nya bersama para kekasih Allah di dalam surga yang penuh kenikmatansetelah pada ayat-ayat yang lalu Allah mendorong untuk berkorban jiwa, maka pada ayat ini Allah memerintahkan agar berkorban harta benda untuk perjuangan. Ketika mendapat panggilan untuk berjuang di jalan Allah dengan jiwa raga dan harta, sebagian golongan ada yang tidak mau menerima panggilan tersebut, kemudian Allah mengecam tindakan mereka. Dan jangan sekali-kali orang-orang kaya dan berkecukupan yang kikir dengan apa yang diberikan Allah kepada mereka dari karunia-Nya enggan menginfakkan hartanya di jalan Allah, atau untuk kepentingan sosial mengira bahwa kikir itu baik bagi mereka lantaran harta yang tidak mereka sumbangkan itu dapat mereka gunakan untuk melindungi mereka dari bencana, padahal kikir itu buruk bagi mereka karena dapat menghapus keberkahan rezeki dan membuat hati menjadi keras sehingga sulit menerima nasihat. Harta yang mereka kikirkan itu akan dikalungkan di lehernya pada hari kiamat sebagai azab dan siksaan yang selalu menyertainya di akhirat akibat kekikirannya. Sesungguhnya milik Allah-lah warisan yang ada di langit dan di bumi dari seluruh harta kekayaan yang dilimpahkan kepada hamba-Nya. Dia tidak membutuhkan infak dan sedekah mereka karena dia adalah pemilik seluruh isi langit dan bumi. Allah mahateliti apa yang kamu kerjakan sehingga tidak keliru dalam memberi imbalan atas perbuatan mereka."
  }
]