[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah mempersaksikan bahwa Dia satu-satunya zat yang berhak diibadahi,dan menyandingkan persaksian Nya dengan persaksian para malaikat, para ahli ilmu dalam perkara paling Agung yang dipersaksikan, yaitu keesaan Allah dan tegaknya Allah dalam menegakkan keadilan, tidak ada sesembahan yang berhak diibadahi kecuali Dia yang maha perkasa yang tidak ada sesuatupun yang dikehendakinya kecuali pasti terjadi, juga Maha bijaksana dalam firman-firman dan perbuatan-perbuatannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Allah bersaksi bahwasanya tidak ada tuhan yang berhak disembah selain Dia, tidak ada yang lain. Hal itu didasarkan pada ayat-ayat syar'iyah dan ayat-ayat kauniyah yang menunjukkan ketuhanan-Nya. Kesaksian itu juga diberikan oleh para Malaikat. Dan kesaksian itu juga diberikan oleh orang-orang yang berilmu dengan cara memberikan penjelasan tentang keesaan Allah (Tauhid) dan menyerukannya kepada masyarakat. Mereka memberikan kesaksian terbesar, yaitu kesaksian tentang keesaan Allah -Ta'ālā- dan keadilan-Nya dalam menciptakan makhluk-Nya dan menetapkan syariat-Nya. Tidak ada tuhan yang berhak disembah selain Dia Yang Maha Perkasa, yang tidak terkalahkan oleh siapapun, lagi Maha Bijaksana dalam menciptakan makhluk-Nya, mengaturnya dan menetapkan syariat-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "18. Allah bersaksi dengan kesaksian agung bahwa Dia adalah satu-satunya yang berhak disembah, bersaksi pula para malaikat dan para ulama yang menegakkan keadilan bahwa hanya Allah yang berhak disembah, Dia Maha Perkasa dalam kuasa-Nya dan Maha Bijaksana dalam mengatur makhluk-Nya. Syeikh Islam Ibnu Taimiyah berkata: “kesaksian, penjelasan, dan pengabaran Allah dapat berupa firman-Nya atau perbuatan-Nya… adapun kesaksian dengan perbuatan-Nya berupa bukti-bukti yang Allah jadikan sebagai petunjuk keesaan-Nya yang dapat diketahui dengan akal.” (Majmu’ al-Fatawa 17/168)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "18. شَهِدَ اللهُ ( Allah menyatakan) Yakni menjelaskan dan mengabarkan. أَنَّهُۥ لَآ إِلٰهَ إِلَّا هُوَ ( bahwasanya tidak ada Tuhan melainkan Dia) Dan Allah telah menunjukkan kepada kita ke-esaan-Nya lewat penjelasan-Nya dan lewat apa yang diciptakan-Nya. وَالْمَلٰٓئِكَةُ (Para Malaikat) Dan kesaksian mereka adalah pengakuan bahwa tidak ada Tuhan yang berhak disembah kecuali Allah. وَأُو۟لُوا۟ الْعِلْمِ (dan orang-orang yang berilmu) Dan kesaksian mereka berupa keimanan mereka dan apa yang mereka jelaskan kepada manusia lewat lisan mereka. Dan hal ini merupakan keutamaan yang besar dan kebanggaan yang mulia bagi orang yang berilmu yang telah disandingkan oleh Allah dengan nama-Nya dan nama malaikat dalam ayat ini. قَآئِمًۢا بِالْقِسْطِ ۚ (menegakkan keadilan) Yakni yang menegakkan keadilan dalam segala urusan-Nya, Dialah Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "18 Allah menyatakan sebuah kabar yang didukung dengan ilmu, penjelasan, bukti-bukti kuat dan juga berbagai mukjizat yang menunjukkan bahwasanya tidak ada Tuhan Yang berhak disembah melainkan Dia. Para malaikat bersaksi bahwa tidak ada Tuhan Yang berhak disembah kecuali Allah. Dan orang-orang yang berilmu dari golongan Nabi, ulama dan orang-orang mukmin bersaksi dengan keimanan dan ikrar lisan bahwa tidak ada Tuhan selain Allah. Semua bersaksi bahwa Allah Maha Adil kepada para makhluk-Nya serta segala urusan mereka. Tidak ada Tuhan Yang berhak disembah kecuali Dia, Yang Maha Mengalahkan dan Tidak terkalahkan. Maha Bijaksana dalam segala perbuatan dan tindakan-Nya. Ayat ini turun ketika ada dua orang pendeta Syam berkata setelah nabi hijrah: Katakan kepada kami suatu persaksian yang paling agung dalam kitab Allah. Kemudian Allah menurunkan ayat ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Allah bersaksi bahwa tidak ada tuhan selain Dia, para malaikat dan orang berilmu, Dzat yang menegakkan keadilan} keadilan {Tidak ada tuhan selain Dia Yang Maha perkasa lagi Maha bijaksana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "18. Ini adalah persaksian paling mulia yang bersumber dari Raja Yang mahaagung, dan dari para malaikat serta orang-orang yang berilmu, atas suatu perkara yang paling mulia yang disaksikan yaitu pengesaan Allah dan penegakanNya akan keadilan. Itu semua mengandung persaksian atas seluruh syariat dan seluruh hukum-hukum pembalasan, karena syariat dan ajaran itu dasar dan pondasinya adalah tauhidullah dan pengesaanNya dalam sifat-sifat keagungan, kesombongan, kebesaran, keperkasaan, kuasa dan kemuliaan, juga dengan sifat kedermawanan, kebajikan, kasih sayang, perbuatan baik, keindahan, dan dengan kesempurnaanNya yang mutlak yang tidak dapat dihitung oleh seorang pun dari makhluk untuk meliputi sedikit pun darinya atau mereka mencapainya atau mereka sampai kepada sanjungan atasNya. Dan ibadah-ibadah yang syari dan muamalah serta hal-hal yang mengikutinya, perintah maupun larangan, semua itu adalah keadilan yang tidak ada kezhaliman padanya, tidak ada kesewenang-wenangan dalam keadaan apa pun, sebaliknya semua itu berada pada puncak dari hikmah dan kepastian, serta balasan terhadap amalan-amalan shalih maupun buruk, semua itu adalah keadilan, \"Katakanlah: “Siapakah yang lebih kuat persaksiannya?” Katakanlah: “Allah”. Dia menjadi saksi antara aku dan kamu.\" QS -Al-An’am :19- Maka tauhidullah, AgamaNya dan pembalasanNYa telah tetap dengan ketetapan yang kuat yang tidak ada keraguan padanya dan ia merupakan hakikat yang paling agung dan paling jelas, Dan Allah telah menegakan hal itu dengan bukti-bukti nyata dan dalil-dalil yang tidak mungkin lagi di hitung dan di jumlah. Dalam ayat ini terdapat keutamaan ilmu dan ulama, karena Allah mengkhususkan mereka dalam penyebutan tanpa menyertakan menusia lainya. Allah menyandingkan kesaksian mereka dengan kekasihNya, agamaNya, dan pembalasan laiNya. Seorang yang mukallaf wajib menerima kesaksian yang adil lagi benar tersebut, dan termasuk diantara kandungannya adalah membenarkan mereka, bahwa para makhluk mengikuti mereka adalah para pemimpin yang diikuti. Dalam poin terdapat keutamaan, kemuliaan, dan kedudukan yang tinggi dan tidak dapat diukur kadarnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 18: Allah telah terangkan bahwasanya tidak ada Tuhan melainkan Dia Yang berdiri dengan keadilan, dan (disaksikan) oleh malaikat dan ahli-ahli ilmu, bahwasanya tidak ada Tuhan melainkan Dia, Yang Amat Berkuasa, Yang Bijaksana."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini menunjukkan keutamaan orang-orang yang berilmu. Mereka adalah para nabi dan orang-orang berilmu lainnya dari kalangan orang-orang mukmin. Pengangkatan saksi dari kalangan orang-orang berilmu menngandung tazkiyah (rekomendasi) dan ta'dil (penyebutan sebagai orang adil) dari Allah Subhaanahu wa Ta'aala, dan bahwa mereka merupakan orang-orang yang terpercaya. Perlu diketahui, bahwa kebenaran tauhid dan batilnya syirk didukung oleh dalil-dalil naqli (wahyu) maupun 'aqli (akal), sehingga kebenarannya bagi orang-orang yang memiliki mata hati lebih jelas dan terang daripada matahari. Adapun dalil-dalil naqlinya adalah seluruh isi Al Qur'an dan As Sunnah terdapat perintah mentauhidkan Allah dan menguatkannya, mencintai orang-orang yang bertauhid, mencela syirk dan membenci orang-orang yang berbuat syirk. Sedangkan dalil 'aqli di antaranya: - Pengakuan manusia terhadap rububiyyah Allah, yakni Allah adalah Pencipta, Penguasa dan Pengatur alam semesta. Hal ini menghendaki agar hanya Allah saja yang disembah. - Semua nikmat yang diperoleh seorang hamba berasal dari Allah, demikian juga dengan perlindungan-Nya dari bahaya. Karena semua nikmat berasal dari Allah, maka hanya Dia saja yang berhak disembah. - Keadaan sesembahan yang disembah selain Allah sangat lemah, tidak bisa memberi manfaat dan menghindarkan bahaya, dan keadaannya yang tidak bisa mendengar, melihat, menolong yang lain dsb. Menolong dirinya sendiri ketika ada bahaya yang menghampirinya tidak bisa, lalu bagaimana mungkin ia dapat menolong yang lain, seperti inilah keadaan yang kita saksikan pada berhala-berhala dan patung-patung. Berbeda dengan Allah, yang memiliki sifat-sifat sempurna, Al Hayyu dan Al Qayyum (Maha Hidup dan mampu mengurus makhluk-Nya), Maha Perkasa, Maha Kuasa, Maha Mendengar lagi Maha Melihat dan sifat-sifat sempurna lainnya. - Kemenangan ahli tauhid dan binasanya orang-orang musyrik, seperti pada kisah-kisah para rasul terdahulu bersama umatnya, di mana orang-orang yang bertauhid diselamatkan Allah, sedangkan orang-orang yang berbuat syirk dibinasakan, setelah itu diakhiri dengan ayat \"Inna fii dzaalika la'ibrah\" (sesungguhnya pada yang demikian itu ada pelajaran). - Dan dalil-dalil lainnya yang menunjukkan kebenaran tauhid dan batilnya syirk. Di samping itu, yang menyatakan tauhid adalah Allah Rabbul 'alamin, malaikat dan orang-orang yang berilmu, di mana pernyataan masing-masingnya diterima, lalu bagaimana jika semuanya menyatakan demikian, maka lebih diterima lagi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 18",
    "description": "Setelah Allah memberi pujian kepada kaum mukmin, ayat ini menegaskan bahwa dalil-dalil yang bisa menguatkan keimanan sudah begitu jelas. Allah menyatakan, yakni menjelaskan kepada seluruh makhluk bahwa tidak ada tuhan yang berhak disembah selain dia, dan tidak ada sekutu bagi-Nya. Demikian pula para malaikat dan orang-orang berilmu juga menyaksikan atas keesaan-Nya. Bahkan, semuanya menyaksikan bahwa Allah tampil secara utuh untuk menegakkan keadilan, melalui dalil-dalil yang kuat. Allah adalah satu-satunya penguasa dan pengatur alam raya ini, tidak ada tuhan yang berhak disembah selain dia, yang mahaperkasa, mahabijaksana dalam pengaturan dan penetapan hukumhukum-Nya. Setelah ayat sebelumnya menjelaskan tentang keesaan Allah, maka ayat ini menegaskan tentang kebenaran islam yang inti ajarannya adalah tauhid. Sesungguhnya agama yang benar dan diridai di sisi Allah ialah islam, yang inti ajarannya adalah tauhid. Tidaklah berselisih orangorang yang telah diberi kitab, yakni para penganut yahudi dan nasrani, terhadap kebenaran islam, kecuali atau justru setelah mereka memperoleh pengetahuan tentang hal itu, bukan karena ketidaktahuan. Demikian ini, karena adanya rasa kedengkian di antara mereka terhadap karunia yang diberikan kepada nabi Muhammad sebagai rasul terakhir. Padahal, barangsiapa ingkar terhadap ayat-ayat Allah, baik yang tertulis maupun yang tak tertulis, maka sungguh, Allah sangat cepat perhitungan-Nya terhadap amal-amal hamba-Nya."
  }
]