[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan janganlah sekali-kali orang-orang yang kikir dengan apa yang telah Allah limpahkan kepada mereka sebagai keutamaan dariNYA mengira bahwa sesungguhnya sifat kikir itu lebih baik bagi mereka, bahkan sebaliknya sikap itu amat buruk bagi mereka,sebab sesungguhnya harta benda yang mereka kumpulkan itu akan menjadi beban pikulan yang dikalungkan di pundak-pundak mereka pada hari kiamat. Dan Allah ,DIA lah pemilik seluruh kerajaan dan DZat yang tetap kekal setelah kehancuran seluruh makhlukNYA. DIA maha mengetahui amal perbuatan kalian semuanya dan akan membalas tiap-tiap orang sesuai dengan ukuran yang berhak dia dapatkan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "180. Jangan sekali-kali orang-orang yang kikir dengan kenikmatan yang Allah berikan kepada mereka, hingga mereka enggan memberikan hak Allah yang ada pada harta tersebut, mengira bahwa hal itu baik bagi mereka. Sebaliknya, hal itu buruk sekali bagi mereka. Karena apa yang mereka pertahankan dengan kekikiran itu akan menjadi kalung yang melingkar di leher mereka kelak pada hari Kiamat sebagai hukuman atas mereka. Hanya milik Allah sajalah segala sesuatu yang ada di langit dan bumi. Dia lah Yang Mahahidup setelah semua makhluk binasa. Dan Allah Maha Mengetahui kebaikan dan keburukan yang kalian perbuat, dan Dia akan memberi kalian balasan yang setimpal dengannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "180. Dan janganlah sekali-kali orang-orang yang berbuat kikir menyangka bahwa berbuat kikir terhadap kenikmatan yang Allah berikan kepada mereka merupakan perbuatan yang baik bagi mereka, namun itu buruk bagi mereka; sebab harta yang mereka kumpulkan itu akan menjadi belenggu api yang mengikat leher mereka pada hari kiamat. Dan milik Allah-lah segala yang diwariskan oleh para penghuni langit dan bumi. Allah Maha Mengetahui segala yang kalian perbuat, tidak ada yang tersembunyi dari-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "180. وَلَا يَحْسَبَنَّ الَّذِينَ يَبْخَلُونَ بِمَآ ءَاتَىٰهُمُ اللهُ مِن فَضْلِهِۦ هُوَ خَيْرًا لَّهُم ۖ (Sekali-kali janganlah orang-orang yang bakhil dengan harta yang Allah berikan kepada mereka dari karunia-Nya menyangka, bahwa kebakhilan itu baik bagi mereka) Yakni janganlah orang-orang yang bakhil dari berinfak di jalan Allah itu menganggap bahwa hal itu baik bagi mereka. سَيُطَوَّقُونَ مَا بَخِلُوا۟ بِهِۦ (Harta yang mereka bakhilkan itu akan dikalungkan kelak di lehernya) Yakni apa yang mereka bakhilkan itu akan menjadi kalung dari api neraka di leher mereka. Dan kebakhilan adalah apabila seseorang menahan kewajiban atasnya dan meninggalkan infak pada saat infak itu seharusnya dilakukan. وَلِلَّـهِ مِيرٰثُ السَّمٰوٰتِ وَالْأَرْضِ ۗ (Dan kepunyaan Allah-lah segala warisan (yang ada) di langit dan di bumi) Yakni milik-Nya apa ada dikeduanya lalu mengapa mereka bakhil terhadap hal itu padahal apa yang ada pada mereka hanyalah pinjaman yang kelak harus dikembalikan. Dari Abu Hurairah ia berkata: Rasulullah bersabda: barangsiapa yang diberi Allah harta kemudian ia tidak menunaikan zakatnya maka akan dijadikan baginya ular besar yang sangat berbisa kemudian dililitkan di lehernya lalu menggigit rahangnya seraya berkata: aku adalah hartamu di dunia, aku adalah harta yang kau simpan di dunia. Kemudian Rasulullah melantunkan ayat ini."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Banyak dari orang-orang yang mencoba memahami ayat ini hanya membatasi makna ayat ini pada perkara kikir dengan harta, padahal makna ayat ini bisa menjadi lebih luas dan mencakup hal-hal yang lebih umum, diantaranya adalah kikir dengan ilmu, kehormatan, dan kikir dengan kenikmatan yang Allah khususkan bagi mereka. Dan mereka menyangka bahwa mereka telah melakukan kebaikan bagi diri mereka, tetapi sesungguhnya tidaklah mereka berbuat melainkan hanyalah keburukan dan musibah bagi diri mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "180. Dan jangan sampai orang-orang yang bakhil dengan karunia Allah, sehingga tidak mau membelanjakannya di jalan Allah dan tidak mau membayar zakat itu mengira bahwa kebakhilan itu baik bagi mereka di akhirat. hal itu tidak lain adalah keburukan yang terus menyebar. Harta yang mereka simpan itu akan menjadi tali yang terbuat dari api yang mengikat leher mereka pada hari kiamat, dan mereka akan dihukum dengan tali tersebut. Dan milik Allah itu segala sesuatu yang diterima oleh penduduk langit dan bumi, berupa harta dan semacamnya. Lalu apa manfaat dari kebakhilan mereka dengan hal itu? Dan Allah itu Maha Mehetahui lagi Maha Memberitahu perbuatan kalian, dan akan memberi balasan kebaikan bagi orang yang baik dan keburukan bagi orang yang buruk. Menurut kebanyakan penafsir, ayat ini turun untuk orang yang tidak mau membayar zakat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jangan sekali-kali orang-orang yang kikir mengira} berprasangka {dengan karunia yang dianugerahkan Allah kepada mereka itu baik bagi mereka. Sebaliknya, kekikiran itu buruk bagi mereka. mereka akan dikalungi dengan sesuatu mereka tahan} harta yang mereka tahan akan dijadikan kalung dari api pada leher mereka {pada hari kiamat, Milik Allahlah warisan langit dan bumi. Allah Maha Mengetahui apa yang kalian kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "180. Maksudnya, janganlah orang-orang yang bakhil itu menyangka, yaitu orang yang menahan sesuatu yang mereka miliki dari sesuatu yang telah diberikan oleh Allah kepada mereka berupa karuniaNya seperti harta, kedudukan, ilmu dan sebagainya, yang telah Allah berikan dan Allah anugerahkan kepada mereka, dan Allah memerintahkan kepada mereka untuk mendermakan harta yang tidak akan memudaratkan mereka disebabkannya kepada hamba-hambaNya yang lain, namun mereka bakhil akan hal tersebut, mereka menahannya dari hamba-hamba Allah, dan mereka berpikir bahwa itu lebih baik buat mereka. Akan tetapi itu justru lebih buruk buat mereka dalam agama dan dunia mereka, sekarang maupun nanti. “Harta yang mereka bakhilkan itu kelak akan dikalungkan di lehernya pada Hari Kiamat.” Maksudnya, Allah akan menjadikan harta yang mereka bakhilkan itu sebagai kalung pada leher-leher mereka seraya mereka disiksa dengannya sebagaimana tercantum dalam hadits shohih \"bahwasanya orang yang bakhil hartanya akan berubah menjadi ular \"syuja'ul Aqro\" pada hari kiamat, dia punya dua taring dia akan melilit orang itu dan berkata kepadanya 'aku adalah hartamu, aku adalah simpananmu'. Lalu Rasulullah membaca ayat ini untuk membenarkannya. Orang-orang bakhil itu menyangka bahwa kebakhilan mereka berguna bagi mereka dan akan menyelamatkan mereka, namun ternyata perkaranya terbalik secara total, bahkan kebakhilan mereka itu menjadi mudarat paling besar bagi mereka dan penyebab bagi siksaan atas mereka. “Dan kepunyaan Allah-lah segala warisan (yang ada) di langit dan bumi, ” maksudnya, Allah adalah Raja atas segala raja, dan seluruh raja-raja kembali kepada pemiliknya, dan hamba-hamba akan kembali dari dunia dengan tidak membawa apa-apa dari dirham dan dinar, dan tidak juga harta lainnya. Allah berfirman, \"Sesungguhnya Kami mewarisi bumi dan semua orang-orang yang ada di atasnya, dan hanya kepada Kamilah mereka dikembalikan.\" -Maryam:40-. Perhatikanlah bagaimana Allah menyebutan sebab awal dan sebab akhir, di mana kedua sebab itu mengharuskan seorang hamba tidak bakhil dengan harta yang telah Allah berikan kepadanya. Pertama, Allah mengabarkan tentang sesuatu yang ada pada hamba dan miliknya itu merupakan karunia dari Allah dan nikmatNya dan bukan milik hamba tersebut, bahkan sekiranya bukan karena karunia Allah atasnya dan kebaikanNya, niscaya tidak akan ada sama sekali pada dirinya sesuatu pun dari padanya. Maka tindakan bakhilnya itu menghalangi karunia Allah dan kebaikanNYa. Karena kebaikanNya itu mengharuskan ia berbuat kebaikan juga kepada hamba-hambaNya, sebagaimana Allah berfirman, \"dan berbuat baiklah (kepada orang lain) sebagaimana Allah telah berbuat baik, kepadamu, dan janganlah kamu berbuat kerusakan di (muka) bumi. Sesungguhnya Allah tidak menyukai orang-orang yang berbuat kerusakan.\" -Al-Qashash:77- Barangsiapa yang meneliti (dengan seksama) bahwa apa yang ada padanya itu merupakan karunia dari Allah, niscaya dia tidak akan menahan karunia itu, yang tidak akan memudaratkannya, akan tetapi justru berguna bagi dirinya; pada hatinya, hartanya, dan bertambahnya iman, serta terpelihara dari bencana. Kemudian kedua, Allah menyebutkan bahwa apa yang ada pada tangan hamba-hamba itu semuanya kembali kepada Allah dan diwarisi oleh Allah, dan Allah adalah sebaik-baik Pewaris, maka tidak ada artinya bersikap bakhil pada sesuatu yang akan hilang darimu dan akan berpindah kepada selain dirimu. Kemudian ketiga, Allah menyebutkan sebab balasan, seraya berfirman, “Dan Allah mengetahui apa yang kamu kerjakan.” Apabila Allah itu Maha Mengetahui pada perbuatan-perbuatan kalian seluruhnya –dan hal itu mengharuskan adanya balasan yang baik bagi kebaikan, dan hukuman atas kejahatan- niscaya tidaklah akan terlambat seseorang yang dalam hatinya ada iman walau seberat biji sawi untuk berinfak, di mana dia akan memperoleh balasan, dan dia tidak akan bahagia dengan menahan infak yang akan membuat dirinya mendapat hukuman."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 180: Dan janganlah orang-orang yang bakhil dengan apa yang Allah telah berikan kepada mereka, dari kurnia-Nya itu, menyangka (bahwa) ia itu baik buat mereka, bahkan ia itu jahat buat mereka. Apa yang mereka bakhilkan itu akan digantungkan di leher-leher mereka pada hari Kiamat; dan bagi Allah lah warisan langit dan bumi; Allah itu amat Mengetahui apa yang kamu kerjakan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Baik berupa harta, kedudukan, ilmu maupun lainnya. Baik bagi agama maupun dunia mereka. Mereka mengira bahwa kekikiran mereka memberi manfaat dan kemuliaan bagi mereka, namun ternyata tidak, bahkan menjadi penyebab ruginya mereka dan mendapatkan siksa. Untuk menyiksa mereka. Di dalam hadits disebutkan: إِنَّ الَّذِيْ لاَ يُؤَدِّيْ زَكَاةَ مَالِهِ يُمَثَّلُ إِلَيْهِ مَالُهُ يَوْمَ الْقِيَامَةِ شُجَاعًا أَقْرَعُ لَهُ زَبِيْبَتَانِ فَيَلْزِمُهُ أَوْ يُطَوَّقُهُ يَقُوْلُ : أَنَا كَنْزُكَ َنَا كَنْزُكَ \"Sesungguhnya orang yang tidak menunaikan zakat, maka hartanya pada hari kiamat akan dibuat seperti ular yang kuat yang memiliki dua titik hitam, lalu melilitnya atau akan dilkalungkan kepadanya sambil berkata, \"Saya adalah harta simpananmu, saya adalah harta simpananmu.\" (HR. Ahmad dan Nasa'i, dishahihkan oleh Syaikh Al Albani dalam Shahihul Jami' no. 1690) Semuanya dikembalikan kepada Allah, dan manusia dikembalikan tanpa membawa sepeser harta pun. Allah Ta'ala berfirman: \"Sesungguhnya Kami mewarisi bumi dan semua orang-orang yang ada di atasnya, dan hanya kepada Kamilah mereka dikembalikan.\" (Terj. Maryam: 40) Perhatikanlah ayat di atas, bagaimana Allah Subhaanahu wa Ta'aala menyebutkan beberapa sebab, di mana sebab-sebab itu menghendaki agar manusia tidak kikir terhadap pemberian Allah. Sebab pertama, adalah bahwa apa yang ada di tangan manusia merupakan karunia dan nikmat Allah, kalau sekiranya Allah tidak melimpahkan karunia dan ihsan-Nya tentu tidak akan sampai kepadanya nikmat itu. Hal ini menghendaki agar dia berbuat ihsan kepada hamba-hamba Allah lainnya, sebagaimana firman Allah: \"Dan berbuat baiklah (kepada orang lain) sebagaimana Allah telah berbuat baik kepadamu.\" (Terj. Al Qashas: 77) Barang siapa yang yakin bahwa apa yang ada di tangannya sekarang adalah karunia Allah, tentu dia tidak akan menahan kelebihan hartanya itu yang sebenarnya tidak merugikannya, bahkan memberinya manfaat baik bagi hatinya, hartanya, menambah keimanannya dan menjaganya dari musibah. Sebab kedua, bahwa apa yang ada di tangan hamba sekarang ini semuanya akan kembali kepada Allah dan Dia yang mewarisinya. Oleh karena itu, tidak ada gunanya berbuat kikir terhadap sesuatu yang akan hilang berpindah kepada yang lain. Sebab ketiga, yakni sebab jaza'i (adanya balasan), yaitu firman-Nya, \"Allah Mahateliti apa yang kamu kerjakan\" Jika Dia mengetahui amal yang kamu kerjakan, di mana hal ini menghendaki adanya balasan yang baik terhadap kebaikan dan balasan berupa siksa terhadap keburukan, maka tidak ada seorang pun yang memiliki iman -meskipun sseberat dzarrah (debu halus)- enggan berinfak padahal akan diberikan pahala, serta tidak akan ridha dengan sikap kikir yang mendatangkan siksa. Sehingga Dia akan memberikan balasan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 180",
    "description": "Setelah pada ayat-ayat yang lalu Allah mendorong untuk berkorban jiwa, maka pada ayat ini Allah memerintahkan agar berkorban harta benda untuk perjuangan. Ketika mendapat panggilan untuk berjuang di jalan Allah dengan jiwa raga dan harta, sebagian golongan ada yang tidak mau menerima panggilan tersebut, kemudian Allah mengecam tindakan mereka. Dan jangan sekali-kali orang-orang kaya dan berkecukupan yang kikir dengan apa yang diberikan Allah kepada mereka dari karunia-Nya enggan menginfakkan hartanya di jalan Allah, atau untuk kepentingan sosial mengira bahwa kikir itu baik bagi mereka lantaran harta yang tidak mereka sumbangkan itu dapat mereka gunakan untuk melindungi mereka dari bencana, padahal kikir itu buruk bagi mereka karena dapat menghapus keberkahan rezeki dan membuat hati menjadi keras sehingga sulit menerima nasihat. Harta yang mereka kikirkan itu akan dikalungkan di lehernya pada hari kiamat sebagai azab dan siksaan yang selalu menyertainya di akhirat akibat kekikirannya. Sesungguhnya milik Allah-lah warisan yang ada di langit dan di bumi dari seluruh harta kekayaan yang dilimpahkan kepada hamba-Nya. Dia tidak membutuhkan infak dan sedekah mereka karena dia adalah pemilik seluruh isi langit dan bumi. Allah mahateliti apa yang kamu kerjakan sehingga tidak keliru dalam memberi imbalan atas perbuatan mereka. Sungguh, Allah telah mendengar perkataan orang-orang yahudi yang mengatakan, sesungguhnya Allah itu miskin dan kami kaya. Orang-orang yahudi beranggapan bahwa perintah berinfak di jalan Allah atau bersedekah untuk kepentingan sosial menunjukkan bahwa Allah miskin sehingga butuh pinjaman harta dari manusia. Seandainya Allah kaya, menurut mereka, niscaya Allah tidak menyuruh untuk berinfak dan bersedekah. Ucapan mereka kemudian dijawab oleh Allah. Kami akan mencatat perkataan mereka yang sangat buruk dengan berbagai tuduhan yang dilontarkan kepada Allah dan perbuatan mereka membunuh nabinabi tanpa hak alasan yang benar lantaran para utusan Allah tersebut menyampaikan ajaran-ajaran Allah, dan kami akan mengatakan kepada mereka, rasakanlah olehmu azab yang membakar! itu adalah akibat harta yang mereka timbun untuk kepentingan diri sendiri dan tidak mereka sedekahkan."
  }
]