[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya Allah telah mendengar ucapan orang-orang yahudi yang mengatakan, ”sesungguhnya Allah itu membutuhkan kami, meminta dari kami untuk meminjamkan harta benda kepadaNYA, sedang kami orang-orang kaya.” Kami akan mencatat perkataan yang mereka ucapkan itu dan kami juga akan mencatat bahwa sesungguhnya mereka itu rela dengan pembunuhan yang dilakukan nenek moyang mereka terhadap nabi-nabi Allah secara zhalim dan penuh permusuhan. Dan Kami akan menyiksa mereka karena perbuatan tersebut di akhirat kelak. Dan kami akan berkata kepada mereka disaat mereka sudah berada di dalam neraka, ”Rasakanlah siksaan neraka yang membakar.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "181. Sungguh Allah telah mendengar ucapan orang-orang Yahudi tatkala mereka berkata, “Sesungguhnya Allah itu miskin, karena Dia meminta pinjaman (hutang) kepada kita. Sedangkan kita adalah orang-orang kaya dengan harta benda yang kita punya.” Kami akan mencatat ucapan kebohongan mereka yang sangat keji atas nama Rabb dan perbuatan yang tidak dibenarkan berupa pembunuhan terhadap nabi-nabi mereka. Dan Kami akan berfirman kepada mereka semua, “Rasakanlah azab yang membakar di Neraka.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "181. Allah membeberkan aib orang-orang Yahudi yang kafir dengan menegaskan bahwa Dia mendengar perkataan buruk mereka: “Allah itu miskin, sedangkan kami kaya”. Kami akan menulis perkataan ini di buku catatan amal mereka. Mereka juga membolehkan membunuh para nabi tanpa alasan yang benar, Kami akan menyiksa dan menghinakan mereka atas perbuatan itu, dan Kami akan katakan kepada mereka ketika mereka sedang dalam azab: “Rasakanlah azab neraka Jahannam yang membakar.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "181. لَّقَدْ سَمِعَ اللهُ قَوْلَ الَّذِينَ قَالُوٓا۟ إِنَّ اللهَ فَقِيرٌ (Sesungguhnya Allah telah mendengar perkatan orang-orang yang mengatakan: “Sesunguhnya Allah miskin) Segolongan orang Yahudi mengatakan perkataan ini sebagai bentuk kesombongan mereka karena mereka memiliki kekayaan yang banyak dan kebodohan mereka tentang qadar Allah. Dan pendapat lain mengatakan mereka mengatakan tersebut karena ingin menunjukkan jika memang yang dikatakan Rasulullah itu benar bahwa Allah meminta pinjaman kepada kami berarti Allah miskin, hal ini mereka katakan untuk memberi keraguan tentang agama Islam. Ibnu Abbas berkata: orang-orang Yahudi mendatangi Rasulullah ketika Allah menurunkan ayat (من ذا الذي يقرض الله قرضا حسنا) “Siapakah yang mau memberi pinjaman kepada Allah dengan pinjaman yang baik”. Lalu mereka berkata: Hai Muhammad apakah Tuhanmu itu miskin sampai meminta hamba-Nya pinjaman?. Maka Allah menurunkan ayat: سَنَكْتُبُ مَا قَالُوا۟ (Kami akan mencatat perkataan mereka itu) Yakni Kami akan menulisnya dicatatan amal yang ada pada malaikat, kemudian Kami akan menyimpannya lalu membalas atasnya. وَقَتْلَهُمُ الْأَنۢبِيَآءَ (dan perbuatan mereka membunuh nabi-nabi) Yakni juga menulis perbuatan mereka membunuh para Nabi. Allah menyandingkan perkataan mereka dengan pembunuhan para nabi yang mereka lakukan sebagai peringatan akan besarnya dosa dan buruknya perkataan tersebut. وَنَقُولُ (dan Kami akan mengatakan) Yakni membalas mereka dengan perkataan ini, yakni mengatakan kepada mereka bahwa mereka akan memasuki neraka. Makna (الحريق) adalah salah satu dari neraka yang menyala-nyala. Sebat turunnya ayat ini adalah bahwa seorang Yahudi bernama Fanhas berkata kepada Abu Bakar: kami tidak membutuhkan Allah dan Allah-lah yang membutuhkan kami, kami tidak tunduk kepada-Nya tapi Allah tunduk kepada kami, kami kaya tanpa-Nya dan seandainya Dia memang kaya pasti tidak meminta kepada kami pinjaman sebagaimana yang dikatakan sahabatmu (Muhammad) itu. Maka ayat ini turun."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Perhatikanlah bagaimana sikap toleransi Allah tentang ayat ini : { لَقَدْ سَمِعَ اللَّهُ قَوْلَ الَّذِينَ قَالُوا إِنَّ اللَّهَ فَقِيرٌ وَنَحْنُ أَغْنِيَاءُ } \"Sesungguhnya Allah telah mendengar perkatan orang-orang yang mengatakan: \"Sesunguhnya Allah miskin dan kami kaya\", dari ayat ini kita memahami betapa buruknya perkataan mereka dan kebusukan keyakinan yang mereka pegang sedangkan Allah belum menurunkan siksaan-Nya kepada mereka berupa kemiskinan, bahkan Yahudi merupakan ummat yang paling kaya, dan Allah memilih menagguhkan azab-Nya bagi mereka sampai hari akhir, alangkan indahnya toleransi yang Allah berikan dan sekali-kali keagungan dan kekuasaan-Nya tidak akan pernah habis. 2 ). Seorang mutaddabir berkata : suatu ketika aku bersama anak perempuanku yang berusia 7 tahun, seketika kami mendengar seorang qori' membaca satu ayat melaui salah satu siaran radio : { لَقَدْ سَمِعَ اللَّهُ قَوْلَ الَّذِينَ قَالُوا إِنَّ اللَّهَ فَقِيرٌ وَنَحْنُ أَغْنِيَاءُ } , kemudian anak itu bertanya dengan penuh harap akan tahu tentang perkara ini : \"jika saja Allah miskin dan mereka adalah kaya, lalu siapa yang menjadikan mereka kaya raya ?!\" 3 ) Ibnu 'Utsaimin dalam tafsirnya berkata : lihatlah bagaimana Allah berfirman : { سَنَكْتُبُ مَا قَالُوا } \"Kami akan mencatat perkataan mereka itu\" tatkala mereka menganggap adanya kekurangan pada keesaan Allah, sebelum Allah mengatakan : { وَقَتْلَهُمُ الْأَنْبِيَاءَ } \"dan perbuatan mereka membunuh nabi-nabi\" , hal ini menandakan bahwa anggapan adanya kekurangan yang dimiliki oleh Allah adalah perkara yang lebih berbahaya daripada membunuh para Nabi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "181. Sungguh Allah mendengar perkataan orang-orang Yahudi yang berkata: “Sesungguhnya Allah itu fakir, dan kamilah yang kaya.” Kami akan mencatat perkataan ini di dalam catatan amal mereka supaya Kami bisa membalas mereka atas perkataan tersebut. Kami juga akan mencatat tindakan pembunuhan mereka terhadap para nabi dengan penuh kezaliman dan kesengajaan. Pengumpulan dua hal ini adalah sebagai pemberian perhatian atas tindakan keji (mereka). Di neraka, Kami akan berkata kepada mereka: “Rasakanlah azab neraka Jahanam yang menyala-nyala dan menyakitkan” Al-Hariq adalah api yang menyala-nyala. Ayat ini turun untuk orang Yahudi yang bernama Finhash yang berkata kepada Abu Bakar: “Kami tidak butuh kepada Allah. Bagi Kami Dia itu miskin. Kami tidak akan tunduk kepadaNya sebagaimana Dia merendah kepada Kami. Sesungguhnya Kami adalah orang-orang kaya. Jika saja Dia kaya, maka tidak akan meminta pinjaman kepada kami sebagaimana yang dianggapkan oleh sahabat kalian.” Hal itu terjadi ketika ayat {Man dzallai Yuqridhullaha ardhan hasanan fayudha’ifuhu lahu Adh’aafan katsiraah} [surah Al-Baqarah ayat 245]"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh Allah benar-benar telah mendengar perkataan orang-orang yang mengatakan bahwa sesungguhnya Allah itu miskin dan kami kaya. Kami akan mencatat perkataan mereka dan pembunuhan terhadap para nabi yang mereka lakukan tanpa hak. Kami akan mengatakan, “Rasakanlah azab yang membakar”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "181. Allah mengabarkan tentang perkataan orang-orang yang durhaka yang telah berucap dengan perkataan yang paling buruk, paling keji dan paling busuk, lalu Allah mengabarkan bahwasanya Dia telah mendengar apa yang mereka katakan, dan bahwa Dia akan menulis dan menjaga (catatan) itu bersama perbuatan-perbuatan mereka yang sangat keji yaitu membunuh para nabi yang berdakwah. Dan bahwa Allah akan menghukum mereka atas perbuatan itu dengan seberat-berat hukuman, dan bahwa akan dikatakan kepada mereka sebagai ganti apa yang telah mereka katakan yaitu “Allah itu fakir dan kamilah yang kaya” “Rasakanlah olehmu azab yang membakar”, yang menghanguskan lagi menghujam dari badan hingga ke hati. Siksaan mereka itu bukanlah suatu penganiayaan dari Allah bagi mereka, karena sesungguhnya Allah \"sekali-kali tidak menganiaya hamba-hamba-Nya.\" –Ali Imran: 182-. Karena Allah Mahasuci dari hal tersebut."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 181: Sesungguhnya Allah mendengar perkataan orang-orang yang berkata: \"Allah miskin dan kami kaya. Kami akan tulis apa yang mereka telah katakan, dan (juga) pembunuhan mereka akan nabi-nabi dengan tidak patut, dan Kami akan berkata: \"Rasakanlah siksa bakar ini.\""
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mereka mengatakan kata-kata keji itu saat turun ayat, \"Barang siapa yang meminjami Allah pinjaman yang baik (menafkahkan hartanya di jalan Allah), maka Allah akan melipatgandakan ganti kepadanya dengan banyak …dst.\" (Terj. Al Baqarah: 245) Mereka mengatakan, \"Jika sekiranya Allah kaya, tentu Dia tidak akan meminta pinjaman kepada kita.\" Dalam catatan amal untuk diberikan balasan beserta perbuatan mereka membunuh para nabi. Yang membakar badan dan menembus sampai ke hati."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 181",
    "description": "Sungguh, Allah telah mendengar perkataan orang-orang yahudi yang mengatakan, sesungguhnya Allah itu miskin dan kami kaya. Orang-orang yahudi beranggapan bahwa perintah berinfak di jalan Allah atau bersedekah untuk kepentingan sosial menunjukkan bahwa Allah miskin sehingga butuh pinjaman harta dari manusia. Seandainya Allah kaya, menurut mereka, niscaya Allah tidak menyuruh untuk berinfak dan bersedekah. Ucapan mereka kemudian dijawab oleh Allah. Kami akan mencatat perkataan mereka yang sangat buruk dengan berbagai tuduhan yang dilontarkan kepada Allah dan perbuatan mereka membunuh nabinabi tanpa hak alasan yang benar lantaran para utusan Allah tersebut menyampaikan ajaran-ajaran Allah, dan kami akan mengatakan kepada mereka, rasakanlah olehmu azab yang membakar! itu adalah akibat harta yang mereka timbun untuk kepentingan diri sendiri dan tidak mereka sedekahkan. Azab yang menimpa orang-orang fasik dan munafik dari kalangan yahudi dan semisal mereka, yang demikian itu menurut Allah disebabkan oleh perbuatan tanganmu sendiri membunuh para nabi, melanggar janji, kikir, memakan yang haram, berkata bohong, mengambil suap dan sebagainya, dan sesungguhnya Allah tidak menzalimi hamba-hamba-Nya. Mereka yang beramal saleh dan memenuhi perintah Allah serta menjauhi larangan-Nya akan menerima imbalan berupa kebahagiaan di surga, dan mereka yang ingkar akan menerima balasan siksa yang amat pedih di neraka."
  }
]