[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Siksaan yang keras itu dikarenakan apa yang telah kalian perbuat sebelumnya dikehidupan dunia kalian berupa perbuatan-perbuatan maksiat, baik berupa ucapan, perbuatan dan keyakinan. Dan sesungguhnya Allah tidaklah menganiaya hamba-hambaNYA."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "182. Azab itu disebabkan oleh perbuatan kalian sendiri -wahai orang-orang Yahudi- berupa perbuatan maksiat dan perilaku yang memalukan. Dan Allah tidak akan menzalimi siapapun dari hamba-hamba-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "182. Azab yang keras tersebut akibat berbagai kejahatan dan dosa besar yang mereka perbuat. Allah Maha Adil dalam menghukum, tidak menzalimi seorangpun hamba-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "182. ذٰلِكَ بِمَا قَدَّمَتْ أَيْدِيكُمْ وَأَنَّ اللهَ لَيْسَ بِظَلَّامٍ لِّلْعَبِيدِ (yang demikian itu adalah disebabkan perbuatan tanganmu sendiri dan bahwasanya Allah sekali-kali tidak menganiaya hamba-hamba-Nya) Yakni Allah mengazab mereka dengan azab neraka yang menyala karena dosa mereka, sehingga balasan mereka karena perbuatan mereka dan bukan atas dasar kezaliman."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "182. Azab yang akan kalian rasakan di akhirat itu karena dosa-dosa yang telah kalian kerjakan (diumpamakan dengan tangan manusia) Dan Allah itu tidak menzalimi siapapun, melainkan azabNya itu akibat dosa yang dilaakukan manusia, dan azab itu adalah balasan atas perbuatannya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Yang demikian itu disebabkan oleh perbuatan tangan kalian dan sesungguhnya Allah tidak menzalimi hamba-hambaNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "182. Sesungguhnya “(azab) yang demikian itu adalah disebabkan” oleh tangan-tangan mereka berupa perbuatan hina dan keburukan yang mengharuskan mereka berhak mendapatkan azab dan jauh dari pahala. Para ahli tafsir telah menyebutkan bahwasanya ayat ini turun pada suatu kaum dari Yahudi yang telah berbicara dengan perkataan (busuk) tersebut. Para ahli tafsir menyebutkan bahwa di antara kaum Yahudi itu adalah Finhash bi ‘Azura’ , salah seorang pemimpin ulama Yahudi di Madinah, dan bahwa ketika dia mendengar Firman Allah \"Siapakah yang mau memberi pinjaman kepada Allah, pinjaman yang baik (menafkahkan hartanya di jalan Allah),\"–Al-Baqarah:245- dan \"dan berikanlah pinjaman kepada Allah pinjaman yang baik\" Al-Muzammil:20-, dia berkata dengan nada sombong dan congkak perkataan tersebut. Semoga Allah menghukumnya. Maka Allah menyebutkan perkataan itu dari mereka, dan Allah mengabarkan bahwa itu bukanlah suatu hal yang baru dari kekejian mereka, bahkan sebenarnya telah berlalu dari mereka kekejian-kekejian lain yang serupa dengan hal tersebut, yaitu pembunuhan nabi-nabi Allah tanpa alasan yang benar. Pembatasan ini dimaksudkan bahwa mereka itu lancang membunuh para nabi padahal mereka mengetahui akan kekejian perbuatan itu, bukan atas dasar kebodohan dan kesesatan, akan tetapi atas dasar pembangkangan dan kedurhakaan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 182: \"Yang demikian itu lantaran (dosa-dosa) yang telah dilakukan oleh diri-diri kamu, karena sesungguhnya Allah itu tidak menganiaya hamba-hamba-Nya. Orang-orang yang berkata: \"Sesungguhnya Allah telah pesan kepada kami, bahwa tidak boleh kami beriman kepada seorang rasul kecuali kalau ia bawakan kepada kami satu qurban yang dimakan api,\" Katakanlah: \"Sesungguhnya telah datang beberapa rasul dahulu daripadaku dengan beberapa keterangan dan dengan (qurban) yang kamu katakan itu, tetapi mengapakah kamu bunuh mereka, jika memang kamu itu orang-orang yang benar?\""
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Perkataan ini diucapkan kepada mereka ketika mereka telah dimasukkan ke dalam neraka. Dipakai kata \"tangan\", karena kebanyakan tindakan manusia menggunakan tangannya. Tidak akan menyiksa mereka tanpa dosa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 182",
    "description": "Azab yang menimpa orang-orang fasik dan munafik dari kalangan yahudi dan semisal mereka, yang demikian itu menurut Allah disebabkan oleh perbuatan tanganmu sendiri membunuh para nabi, melanggar janji, kikir, memakan yang haram, berkata bohong, mengambil suap dan sebagainya, dan sesungguhnya Allah tidak menzalimi hamba-hamba-Nya. Mereka yang beramal saleh dan memenuhi perintah Allah serta menjauhi larangan-Nya akan menerima imbalan berupa kebahagiaan di surga, dan mereka yang ingkar akan menerima balasan siksa yang amat pedih di neraka. Orang-orang yang mendapat laknat dan murka Allah yaitu orangorang yahudi yang mengatakan, dengan melontarkan perkataan bohong diatasnamakan Allah, sesungguhnya Allah telah memerintahkan kepada kami, agar kami tidak beriman kepada seorang rasul sebelum dia mendatangkan kepada kami kurban yang dimakan api sebagai tanda diterimanya kurban seseorang. Katakanlah, wahai nabi Muhammad, sungguh, beberapa orang rasul sebelumku telah datang kepadamu, dengan membawa bukti-bukti yang nyata dan membawa apa yang kamu sebutkan, tetapi kamu tetap mendustakan mereka dan mengingkari semua yang diturunkan kepada mereka. Bahkan mengapa kamu membunuhnya jika kamu orangorang yang benar. Padahal, kamu sebenarnya hanya mengada-ada terhadap Allah, berbohong atas nama agama-Nya, dan tidak taat pada perintah-Nya."
  }
]