[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang yahudi ketika diajak untuk memeluk islam, mereka menjawab, ”sesungguhnya Allah telah berwasiat kepada kami di dalam taurat untuk tidak mengimani siapa saja yang datang kepada kami yang mengatkan,’sesungguhnya dia adalah utusan Allah,’ sampai dia membawakan kepada kami sedekah yang dia jadikan qurban (mendekatkan diri) dengan itu kepada Allah, lalu datanglah api dari langit yang membakarnya.” Katakanlah kepada mereka (wahai rasul), ”kalian berdusta dalam ucapan kalian,karena sesungguhnya telah datang kepada bapak-bapak kalian beberapa rasul-rosul sebelumku dengan membawa mukjizat-mukjizat dan bukti-bukti nyata yang menunjukan kebenaran mereka, dan dengan membawa apa yang kalian katakan tadi dengan membawa kurban yang di makan oleh api, lalu mengapa bapak-bapak kalian membunuh nabi-nabi tersebut, jika kalian orang-orang yang benar dalam pengakuan kalian?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "183. Dan mereka adalah orang-orang yang berkata -secara dusta dan mengada-ada-, “Sesungguhnya Allah telah berpesan kepada kami di dalam kitab-kitab suci-Nya dan melalui lisan nabi-nabi-Nya bahwa kami tidak perlu beriman kepada seorang rasul pun sebelum ia memberi kami bukti yang membenarkan ucapannya. Yaitu dengan takarub kepada Allah melalui sedekah yang disambar oleh api yang turun dari langit.” Mereka berdusta atas nama Allah tentang pesan tersebut. Dan berdusta juga tentang kriteria pembuktian kebenaran seorang rasul yang mereka sebutkan itu. Oleh karena itu, Allah memerintahkan kepada Nabi-Nya, Muhammad -ṣallallāhu 'alaihi wa sallam- agar berkata kepada mereka, “Telah datang kepada kalian rasul-rasul sebelum aku dengan membawa bukti-bukti nyata yang menunjukkan kebenaran mereka, dan juga membawa penjelasan tentang sedekah yang disambar oleh api dari langit itu, tetapi mengapa kalian mendustakan dan membunuh mereka, jika kalian sungguh-sungguh dengan ucapan kamu itu?.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "183-184. Orang-orang Yahudi yang berkata: “Allah memerintahkan kami untuk tidak beriman kepada seorang rasul sampai mendatangkan kurban kepada kami kemudian turun api dari langit yang membakar kurban itu.” Maka Allah memerintahkan nabi Muhammad untuk membantah perkataan mereka: “Para rasul telah mendatangi para pendahulu kalian dengan membawa berbagai mukijzat dan kurban yang kalian katakan; namun mengapa kalian tetap mendustakan dan membunuh mereka jika kalian jujur dalam apa yang kalian katakan?” Jika mereka mendustakanmu maka janganlah bersedih, sebab itulah cara mereka memperlakukan para rasul sebelummu jika datang membawa mukjizat yang besar dan kitab-kitab yang jelas."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "183. الَّذِينَ قَالُوٓا۟ إِنَّ اللهَ عَهِدَ إِلَيْنَآ ((Yaitu) orang-orang (Yahudi) yang mengatakan: “Sesungguhnya Allah telah memerintahkan kepada kami) Salah satu syariat di Bani Israil adalah mengadakan sesembahan, nabi mereka akan berdiri didepan mereka dan berdoa, lalu akan datang api dari langit yang membakar sesembahan tersebut. Akan tetapi hal ini tidak dilakukan seluruh nabi mereka sebagai cara beribadah tidak pula dijadikan sebagai bukti kebenaran kenabian seseorang; akan tetapi mereka mengklaim bahwa mereka mempunyai perjanjian dengan Allah dalam hal itu sebagai cara untuk membedakan mana yang mengaku-ngaku sebagai nabi dan mana nabi yang sebenarnya. Sehingga Allah membantah mereka dengan firman-Nya: قُلْ قَدْ جَآءَكُمْ رُسُلٌ مِّن قَبْلِى بِالْبَيِّنٰتِ وَبِالَّذِى قُلْتُمْ (Katakanlah: “Sesungguhnya telah datang kepada kamu beberapa orang rasul sebelumku membawa keterangan-keterangan yang nyata dan membawa apa yang kamu sebutkan) وَبِالَّذِى قُلْتُمْ (dan membawa apa yang kamu sebutkan) Yakni upacara sesembahan فَلِمَ قَتَلْتُمُوهُمْ إِن كُنتُمْ صٰدِقِينَ(maka mengapa kamu membunuh mereka jika kamu adalah orang-orang yang benar) Seperti Nabi Yahya bin Zakariya, Nabi Asy’iya, dan Nabi-Nabi yang lain yang mereka bunuh. Dan makna (القربان) adalah apa yang mereka persembahkan untuk Allah sebagai bentuk mendekatkan diri kepada-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "183. Sesungguhnya orang-orang Yahudi adalah mereka yang berkata: “Sesungguhnya Allah memerintahkan kami dalam Taurat untuk tidak mempercayai seorang rasul sampai dia membawakan untuk kami kurban yang dibakar oleh api, yaitu sesuatu untuk yang digunakan untuk mendekatkan diri kepada Allah. Kemudian turunlah api dari langit dan membakar kurban itu” Wahai rasulullah, katakanlah kepada mereka: “Sungguh telah datang kepada para pendahulu kalian para rasul sebelumku dengan membawa mukjizat dan dalil yang menunjukkan kepada kebenaran risalah mereka seperti Zakaria AS, Yahya AS, dan Yeyasa AS. Mereka telah membawakan kurban-kurban yang kalian minta, namun kenapa kalian malah membunuh mereka, jika anggapan kalian itu benar?!”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang mengatakan,“Sesungguhnya Allah telah memerintahkan kepada kami} menasehati kami dalam kitab-kitabNya {agar kami tidak beriman kepada seorang rasul sebelum dia mendatangkan kepada kami kurban yang dimakan api.} dengan sedekah yang dibakar oleh api yang turun dari langit. {Katakanlah, “Sungguh, beberapa rasul sebelumku telah datang kepada kalian dengan bukti-bukti yang nyata} keterangan-keterangan dan bukti-bukti {dan membawa apa yang kalian sebutkan.} dan membawa apa yang kalian minta berupa kurban yang dimakan oleh api {Tapi mengapa kalian membunuh mereka jika kalian adalah orang-orang yang benar”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "183. Allah mengabarkan tentang kondisi orang-orang yang membuat kebohongan yang berkata, “sesungguhnya Allah telah memerintahkan kepada kami,” maksudnya, Allah datang kepada kami dan Allah mewasiatkan bahwa janganlah kami beriman kepada seorang rasul hingga dia datang kepada kami dengan membawa kurban yang telah dimakan api. Mereka menyatukan antara kebohongan atas nama Allah dan membatasi tanda-tanda para rasul dengan apa yang mereka katakana berupa kedustaan yang nyata tersebut, dan bahwasanya mereka bila tidak beriman kepada seorang rasul yang tidak membawa kurban yang dimakan api, maka mereka dalam hal itu telah taat kepada Tuhan mereka dan konsisten terhadap perintahNya. Dan sungguh telah diketahui bahwa setiap rasul yang diutus oleh Allah pasti Dia perkuat dengan ayat-ayat dan bukti-bukti nyata tertentu yang menurut semisalnya (biasa) diimani oleh manusia, dan Allah tidak membatasinya dengan apa yang mereka katakan itu. Namun bersama itu semua, mereka telah membuat kebohongan yang tidak mereka pegang teguh dan kebatilan yang tidak mereka lakukan. Karena itu Allah memerintahkan kepada RasulNya untuk berkata kepada mereka, “Sesungguhnya telah datang kepadamu beberapa orang rasul sebelumku dengan membawa keterangan-keterangan yang nyata” yang menunjukkan kepada kebenaran mereka, “dan membawa apa yang kamu sebutkan” yaitu dia membawa kepada kalian kurban yang dimakan oleh api, “maka mengapa kamu membunuh mereka jika kamu adalah orang-orang yang benar?” maksudnya, (kalian benar) dalam pengakuan kalian bahwa kalian beriman kepada seorang rasul yang membawa kurban yang dimakan api (lalu kenapa kalian tetap membunuh para rasul itu); maka dengan hal ini jelaslah kebohongan, kedurhakaan, dan penentanga mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 183: Orang-orang yang berkata: \"Sesungguhnya Allah telah pesan kepada kami, bahwa tidak boleh kami beriman kepada seorang rasul kecuali kalau ia bawakan kepada kami satu qurban yang dimakan api.\"sungguhnya telah datang beberapa rasul dahulu daripadaku dengan beberapa keterangan dan dengan (qurban) yang kamu katakan itu, tetapi mengapakah kamu bunuh mereka, jika memang kamu itu orang-orang yang benar?\""
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni kenikmatan atau lainnya yang dikurbankan. Jika kurban itu diterima, maka akan datang api putih dari langit yang membakarnya, namun jika tidak diterima, maka kurban itu tetap seperti sedia kala, dan hal ini telah disampaikan kepada Bani Israil selain pada Nabi Isa 'alaihis salam dan Nabi Muhammad shallallahu 'alaihi wa sallam, maka tidak disyaratkan seperti itu. Yang menunjukkan kebenaran mereka, yaitu berupa mukjizat. Seperti Nabi Zakariyya dan Nabi Yahya 'alaihimas salam lalu kalian malah membunuhnya. Khithab (pembicaraan) ini ditujukan kepada mereka (orang-orang Yahudi di zaman Nabi Muhammad shallallahu 'alaihi wa sallam), meskipun yang melakukan adalah nenek moyang mereka, namun mereka meridhainya. Yakni betul-betul mengikuti yang hak dan taat kepada para rasul."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 183",
    "description": "Orang-orang yang mendapat laknat dan murka Allah yaitu orangorang yahudi yang mengatakan, dengan melontarkan perkataan bohong diatasnamakan Allah, sesungguhnya Allah telah memerintahkan kepada kami, agar kami tidak beriman kepada seorang rasul sebelum dia mendatangkan kepada kami kurban yang dimakan api sebagai tanda diterimanya kurban seseorang. Katakanlah, wahai nabi Muhammad, sungguh, beberapa orang rasul sebelumku telah datang kepadamu, dengan membawa bukti-bukti yang nyata dan membawa apa yang kamu sebutkan, tetapi kamu tetap mendustakan mereka dan mengingkari semua yang diturunkan kepada mereka. Bahkan mengapa kamu membunuhnya jika kamu orangorang yang benar. Padahal, kamu sebenarnya hanya mengada-ada terhadap Allah, berbohong atas nama agama-Nya, dan tidak taat pada perintah-Nyamaka jika mereka mendustakan dan menolak risalah engkau, wahai nabi Muhammad, serta berpaling dari agama, maka ketahuilah bahwa rasul-rasul sebelum engkau pun telah didustaka pula, mereka membawa mukjizat-Mukjizat atau bukti-bukti yang nyata, zubur kitab samawi yang berisi hikmah-hikmah yang terang serta nasihat-nasihat yang memikat, dan kitab samawi lainnya; taurat, injil, dan Al-Qur'an, yang memberi penjelasan yang sempurna tentang hukum-hukum syariat."
  }
]