[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka apabila orang-orang yahudi dan selain mereka dari kalangan orang-orang kafir mendustakan dirimu (wahai rasul), maka sesungguhnya orang-orang yang berada di jalan kebatilan telah banyak mendustakan rasul-rasul sebelummu. Mereka datang kepada kaum-kaum mereka dengan membawa mukjizat-mukjizat yang luar biasa dan hujjah-hujjah yang nyata serta kitab-kitab suci dari langit yang merupakan cahaya yang menyingkap kegelapan-kegelapan, dan kitab yang nyata lagi jelas keterangannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "184. Apabila mereka mendustakanmu -wahai Nabi- maka janganlah kamu bersedih hati, karena itu adalah adat kebiasaan orang-orang kafir. Karena telah banyak rasul sebelum kamu yang didustakan. Padahal mereka datang dengan membawa bukti-bukti yang nyata, kitab-kitab yang berisi peringatan dan nasihat pelembut hati, serta kitab suci yang berisi ketentuan-ketentuan hukum dan syariat-syariat agama."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "184. فَإِن كَذَّبُوكَ فَقَدْ كُذِّبَ رُسُلٌ مِّن قَبْلِكَ جَآءُو بِالْبَيِّنٰتِ وَالزُّبُرِ (Jika mereka mendustakan kamu, maka sesungguhnya rasul-rasul sebelum kamupun telah didustakan (pula), mereka membawa mukjizat-mukjizat yang nyata dan Zabur) Yakni dengan membawa apa yang yang kamu datangkan berupa mukjizat dan bukti-bukti, tapi mereka mendustainya. Maka dari itu bersabarlah atas perkataan mereka dan berjihadlah melawan mereka. Kata (الزبر) adalah be ntuk jamak dari (الزبور) yakni kitab."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "184. Wahai Muhammad, jika mereka mendustakanmu, maka kamu juga sama (dengan nabi lainnya). Sungguh para rasul terdahulu telah didustakan juga. Mereka membawa sesuatu yang sama dengan yang kamu bawa, yaitu dalil-dalil, mukjizat dan kitab samawi (zabur) seperti shuhuf Ibrahim, dan kitab yang memberikan pencerahan seperti Taurat dan Injil. Zabur adalah kitab kitab yang mengandung nasehat, yaitu kitabnya Dawud AS. Al-Munir adalah pemberi keterangan menuju jalan kebenaran."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka jika mereka mendustakanmu, sungguh rasul-rasul sebelummu pun telah didustakan. Mereka datang dengan mukjizat-mukjizat yang nyata, zubur} kitab-kitab yang mengandung pelajaraan, hikmah, dan kelemah lembutan {dan kitab yang memberi petunjuk} yang memberi petunjuk dengan syariat dan hikmah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "184. Kemudian Allah menghibur RasulNya seraya berfirman, “JIka mereka mendustakanmu, maka sungguh rasul-rasul sebelum kamu pun telah didustakan (pula).” Maksudnya, ini adalah kebiasaan orang-orang yang zhalim dan jalan mereka yaitu kufur kepada Allah dan mendustkan para rasul Allah. Pendustaan mereka kepada para rasul Allah itu bukan karena suatu keterbatasan syariat yang datang kepada mereka atau tidak jelasnya hujjah bagi mereka, bahkan sungguh “Mereka membawa mukjizat-mukjizat yang nyata” yaitu, hujjah-hujjah logika dan bukti-bukti nyata naqliyah, “dan Zubur,” yaitu, kitab-kitab yang ditulis dan diturunkan dari langit yang tidak mungkin dibawa oleh selain para rasul, “dan kitab yang memberi penjelasan yang sempurna” tentang hukum-hukum syariat dan penjelasan tentang berbagai masalah yang mencakup keindahan-keindahan logika, dan juga penjelasan tentang kabar-kabar yang benar. Apabila ini adalah kebiasaan mereka dalam ketidakberimanan kepada para rasul yang mana inilah gambaran mereka, maka janganlah engkau bersedih karena hal mereka tersebut, dan janganlah sekali-kali perkara mereka menyibukanmu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 184: Lantaran itu, jika mereka dustakanmu, maka telah didusta- kan beberapa rasul dahulu dari- padamu, padahal mereka telah membawa keterangan-keterangan dan beberapa macam kitab dan kitab yang menerangi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Oleh karena itu, janganlah kamu bersedih atau dibuat risau oleh mereka. Zubur ialah lembaran-lembaran yang berisi wahyu yang diberikan kepada nabi-nabi sebelum Nabi Muhammad shallallahu 'alaihi wa sallam yang isinya mengandung hikmah-hikmah. Yakni: Kitab-Kitab yang diturunkan kepada nabi-nabi yang berisi hukum syari'at seperti Taurat, Injil dan Zabur."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 184",
    "description": "Maka jika mereka mendustakan dan menolak risalah engkau, wahai nabi Muhammad, serta berpaling dari agama, maka ketahuilah bahwa rasul-rasul sebelum engkau pun telah didustaka pula, mereka membawa mukjizat-Mukjizat atau bukti-bukti yang nyata, zubur kitab samawi yang berisi hikmah-hikmah yang terang serta nasihat-nasihat yang memikat, dan kitab samawi lainnya; taurat, injil, dan Al-Qur'an, yang memberi penjelasan yang sempurna tentang hukum-hukum syariatpada ayat lalu dijelaskan sikap orang-orang munafik yang menduga bahwa mereka dapat menghindar dari kematian. Pada ayat ini Allah menegaskan bahwa kematian dialami oleh setiap makhluk dan bisa terjadi kapan saja. Setiap yang bernyawa akan merasakan mati tanpa terkecuali. Dan hanya pada hari kiamat sajalah diberikan dengan sempurna balasan kamu dari amal perbuatan baik dan buruk yang kamu lakukan selama di dunia. Barang siapa dijauhkan dari neraka dan dimasukkan ke dalam surga, sungguh, dia memperoleh kemenangan. Kebahagiaan hakiki bukanlah berupa kedudukan dan pangkat yang tinggi, harta yang melimpah, rumah dan istana yang mewah. Semua itu akan musnah. Karena itu, jangan jadikan seluruh perhatian kamu pada kehidupan kini dan sekarang, karena kehidupan dunia hanyalah kesenangan yang memperdaya setiap orang yang hanya mementingkan kebahagiaan sementara."
  }
]