[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Setiap jiwa pasti akan merasakan kematian. Dan dengan kejadian itu,seluruh makhluk akan kembali kepada tuhan mereka untuk memperhitungkan amal perbuatan mereka. Dan sesungguhnya kalian akan memperoleh balasan sempurna atas amal perbuatan kalian secara penuh, tanpa ada pengurangan pada hari kiamat. Maka barangsiapa telah dimuliakan oleh tuhannya dan Dia telah menyelamatkannya dari neraka, serta masukkannya ke dalam surga, sesungguhnya dia telah menggapai puncak apa yang diinginkannya. Dan tidaklah kehidupan dunia itu,melainkan kesenangan yang akan sirna, maka janganlah kalian tertipu dengannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "185. Setiap jiwa, siapa pun ia pasti akan merasakan kematian. Maka hendaknya setiap makhluk tidak terlena dengan dunia ini. Dan kelak di hari Kiamat mereka akan diberi balasan atas amal perbuatan mereka masing-masing secara penuh, tanpa ada pengurangan. Barangsiapa yang Allah jauhkan dari api Neraka dan Dia masukkan ke dalam Surga, sungguh dia benar-benar telah mendapatkan kebaikan yang ia harapkan dan selamat dari keburukan yang ia takutkan. Kehidupan dunia ini tidak lain hanyalah kesenangan sementara yang hanya diminati oleh orang-orang yang tertipu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "185. Allah mengabarkan bahwa setiap jiwa akan mengalami kematian, kemudian akan dibangkitkan pada hari kiamat untuk mendapat balasan amalannya dengan sempurna. Barangsiapa yang dijauhkan dari neraka dan dimasukkan surga maka ia telah beruntung. Dan dunia tidak lain hanyalah kenikmatan fana yang dihiasi oleh setan agar dapat menipu manusia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "185. كُلُّ نَفْسٍ ذَآئِقَةُ الْمَوْتِ ۗ (Tiap-tiap yang berjiwa akan merasakan mati) Ayat ini mengandung kabar gembira sekaligus ancaman bagi orang yang membenarkan dan yang mendustakan. Karena Allah menjadikan kematian adalah akhir dari setiap makhluk hidup baik itu manusia, malaikat, jin, atau hewan; tidak ada seorang pun yang dapat lolos untuk tidak merasakan kematian. وَإِنَّمَا تُوَفَّوْنَ أُجُورَكُمْ يَوْمَ الْقِيٰمَةِ ۖ (Dan sesungguhnya pada hari kiamat sajalah disempurnakan pahalamu) Yakni penyempurnaan balasan hanya pada hari itu, adapun balasan yang diberikan di dunia atau di alam barzakh maka itu hanyalah sebagian balasannya saja. فَمَن زُحْزِحَ (Barangsiapa dijauhkan) Yakni digeserkan dan dijauhkan. فَقَدْ فَازَ ۗ (maka sungguh ia telah beruntung) Yakni berhasil mendapatkan apa yang ia mau dan selamat dari apa yang ia takuti, karena segala keberhasilan atas tercapainya segala keinginan jika tanpa mendapatkan surga maka itu tidaklah berarti apa-apa. Dan segala keselamatan dari mara bahaya bukanlah keselamatan hakiki apa bila orang tersebut tidak selamat dari api neraka. Makna (المتاع) yakni apa yang dinikmati manusia dan diambil manfaatnya yang kemudian hilang dan habis tak tersisa. الْغُرُورِ (memperdayakan) Yakni yang memperdayakan dengan angan-angan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). { كُلُّ نَفْسٍ ذَآئِقَةُ الْمَوْتِ } Setiap mereka pasti akan merasakannya : orang baik dan buruk, kaya dan miskin, orang sombong dan yang merendah diri.. maka jika inilah akhir seluruh kehidupan makhluq, sungguh beruntunglah mereka-mereka yang menyempatkan dirinya untuk bertaqwa kepada Allah, dan mengajak manusia kepada penghambaan hanya kepada-Nya. 2 ). Diantara sajian ramadhan yang paling berharga adalah : ketika waktu diijabahnya do'a berpihak kepada seorang hamba, dan ketika itu ia sedang memohon kepada tuhannya syurga dan perlindungan dari api neraka, maka kemudian permintaan itu diijabah oleh sang Maha kuasa, sehingga ia menjadi orang yang beruntung dan berbahagia selamanya, Allah berfirman : { فَمَنْ زُحْزِحَ عَنِ النَّارِ وَأُدْخِلَ الْجَنَّةَ فَقَدْ فَازَ } \"Barangsiapa dijauhkan dari neraka dan dimasukkan ke dalam surga, maka sungguh ia telah beruntung\". 3 ). Jalan untuk menggapai syurga pada awalnya memang berat dan sulit, tetapi jika kamu bersabar diatas kesulitan itu, niscaya kamu akan sampai pada kenikmatan yang tiada bandinganya di dunia. Sedangkan jalan menuju neraka kelihatannya memang mudah dan indah, tetapi jika keindahan itu telah menenggelamkanmu kedalam jurang, sungguh kebinasaan dan kehancurang yang paling dahsyat akan menghampirimu, dan sekali-kali kamu tidak akan bisa lari darinya { فَمَنْ زُحْزِحَ عَنِ النَّارِ وَأُدْخِلَ الْجَنَّةَ فَقَدْ فَازَ } \"Barangsiapa dijauhkan dari neraka dan dimasukkan ke dalam surga, maka sungguh ia telah beruntung\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "185. Ayat ini mengandung janji dan peringatan bagi orang yang beriman dan berdusta. Isinya yaitu bahwa setiap jiwa akan mati. Sesungguhnya kalian akan diberi balasan atas amal baik dan buruk kalian secara sempurna pada hari kiamat. Barangsiapa yang dijauhkan dari neraka dan dimasukkan ke dalam surga, maka sungguh dia telah selamat dari ketakutan dan mendapatkan apa yang diinginkan. Dan kehidupan dunia itu tidak lain hanya tipuan belaka. Al-Mata’ adalah sesuatu yang dinikmati dan dimanfaatkan manusia lalu hilang dan lenyap. Al-Ghurur adalah tipuan, yaitu sesuatu yang menipu agar orang sibuk dengannya sehingga tidak memperhatikan marabahaya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Setiap yang bernyawa akan merasakan mati. Kalian akan diberi balasan} kalian akan diberi balasan atas amal kalian {pada hari kiamat. Siapa yang dijauhkan} dijauhkan {dari neraka dan dimasukkan ke dalam surga, sungguh dia memperoleh kemenangan.} memenangkan apa yang dia harapkan dan selamat dari yang dia takutkan {Kehidupan dunia tidak lain hanyalah kesenangan yang memperdaya} tipuan yang mengaburkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "185. Ayat yang mulia ini mengandung penjelasan tentang zuhud dari dunia karena bersifat fana dan tidak kekal, dan bahwa dunia itu adalah perhiasan yang menipu, membuat fitnah fdengan keindahannya, menipu dengan kecantikan dan kemolekannya. Kemudian dunia itu akan berpindah dan ditinggalkan menuju ke negeri abadi, di mana jiwa-jiwa manusia akan diberikan balasan amal yang telah diperbuatnya di dunia ini berupa kebaikan maupun kejelekan. “Maka barangsiapa dijauhkan,” maksudnya, dikeluarkan “dari neraka dan dimasukkan ke dalam surga, maka sungguh dia telah beruntung” maksudnya, dia memperoleh kemenangan yang besar dengan selamat dari siksa yang pedih dan sampai kepada surga yang penuh nikmat, yang berisikan segala keindahan yang tak pernah dilihat mata, tak pernah didengar telinga, dan tidak pernah terlintas pada benak dan hati seseorang. Pemahaman terbalik ayat ini, adalah bahwa barangsiapa yang tidak dikeluarkan dari neraka dan tidak masuk dalamm surga, maka dia tidaklah beruntung, bahkan dia celaka dengan kesengsaraan yang abadi dan disiksa dengan hukuman yang kekal. Ayat ini mengandung isyarat akan adanya kenikmatan alam barzakh maupun siksaannya, dan bahwa orang-orang yang beramal akan diberikan balasan di dalamnya dengan beberapa balasan dari amal yang telah mereka lakukan, dan disuguhkan kepada mereka beberapa contoh dari orang-orang yang mendahuluinya. Ini dapat dipahami dari FirmanNya, “Dan sesungguhnya pada Hari Kiamat sajalah disempurnakan pahalamu,” masksudnya, penyempurnaan balasan perbuatan secara total hanya terjadi pada Hari KIamat, sedangkan selain itu maka terjadi di alam barzakh, bahkan bisa jadi dapat terjadi sebelum itu (di dunia), seperti Firman Allah –As-Sajdah:21-."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 185: Tiap-tiap yang berjiwa akan merasai mati; dan tidak akan disempurnakan balasan kamu melainkan pada hari Kiamat. Lantaran itu, barangsiapa dijauhkan daripada neraka dan dimasukkan ke surga maka selamatlah ia, karena penghidupan yang rendah ini tidak lain melainkan menipu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dalam ayat yang mulia ini terdapat dorongan untuk bersikap zuhud terhadap dunia, di mana ia tidak kekal dan akan fana, dunia juga merupakan kesenangan yang memperdaya; nampak indah dan menyilaukan, namun sesungguhnya ia akan binasa dan berpindah ke negeri yang kekal, negeri di mana amal manusia akan diberi balasan secara sempurna. Kesenangan yang sebentar kemudian akan binasa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 185",
    "description": "Pada ayat lalu dijelaskan sikap orang-orang munafik yang menduga bahwa mereka dapat menghindar dari kematian. Pada ayat ini Allah menegaskan bahwa kematian dialami oleh setiap makhluk dan bisa terjadi kapan saja. Setiap yang bernyawa akan merasakan mati tanpa terkecuali. Dan hanya pada hari kiamat sajalah diberikan dengan sempurna balasan kamu dari amal perbuatan baik dan buruk yang kamu lakukan selama di dunia. Barang siapa dijauhkan dari neraka dan dimasukkan ke dalam surga, sungguh, dia memperoleh kemenangan. Kebahagiaan hakiki bukanlah berupa kedudukan dan pangkat yang tinggi, harta yang melimpah, rumah dan istana yang mewah. Semua itu akan musnah. Karena itu, jangan jadikan seluruh perhatian kamu pada kehidupan kini dan sekarang, karena kehidupan dunia hanyalah kesenangan yang memperdaya setiap orang yang hanya mementingkan kebahagiaan sementarakamu pasti akan diuji dengan hartamu dan dirimu dengan berbagai cobaan, ujian, dan musibah seperti kekurangan harta, malapetaka, dan lain-lain. Karena itu Allah menguji siapa pun di antara mereka yang tetap sabar dan istikamah dalam menjalankan perintah Allah, dan mereka yang tidak menerima dengan hati lapang dan sabar. Dan pasti kamu akan mendengar banyak hal yang sangat menyakitkan hati dari orang-orang yang diberi kitab sebelum kamu dan dari orang-orang musyrik berupa ejekan, pendustaan, penghalangan dalam beragama, perlawanan, dan pengkhianatan. Jika kamu bersabar dan bertakwa dalam menghadapi tindakan-tindakan mereka dan tetap teguh melaksanakan perintah Allah dan menjauhi larangan-Nya, maka sesungguhnya yang demikian itu termasuk urusan yang patut diutamakan. Hal itu karena orang-orang yang sabar, bertakwa, dan berbesar hati menerima setiap takdir yang berlaku akan meraih kemenangan yang gemilang atas tipu daya musuh."
  }
]