[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kalian pasti akan diuji (Wahai orang-orang beriman), dalam harta kekayaan kalian dengan perintah mengeluarkan infak yang wajib maupun Sunnah dan dengan bencana-bencana yang menimpanya, dan dalam diri kalian dengan apa yang wajib kepada kalian berupa ketaatan-ketaatan, dana pa yang menimpa kalian berupa luka-luka dan kehilangan nyawa, serta kehilangan orang-orang tercinta. Hal itu bertujuan supaya memisahkan antara orang mukmin yang benar dan yang bukan. Dan kalian benar-benar akan mendengarkan dari kaum yahudi,Nasrani,dan kaum musyrikin omongan-omongan yang menyakitkan pendengaran kalian, berupa ucapan-ucapan syirik dan celaan terhadap agama kalian. Dan apabila kalian mau bersabar (wahai kaum mukminin), menghadapi itu semua,dan bertakwa kepada Allah dengan konsisten untuk taat kepadaNYA dan menjauhi maksiat-maksiat kepadaNYA, maka sesungguhnya itu termasuk sikap-sikap yang patut dibulatkan tekad untuk dilakukan dan berlomba-lomba di dalamnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "186. Sungguh kalian -wahai orang-orang mukmin- benar-benar akan mendapatkan ujian di dalam harta benda kalian seperti menunaikan hak-hak yang wajib pada harta tersebut, musibah-musibah yang menimpa, dan kalian juga benar-benar akan diuji di dalam diri kalian dalam bentuk kewajiban menjalankan tugas-tugas syariat dan aneka cobaan yang menimpa kalian. Dan sungguh kalian benar-benar akan mendengar banyak hal yang menyakitkan hati dari lisan orang-orang yang diberi Kitab sebelum kalian dan dari orang-orang musyrik. Yaitu ucapan-ucapan yang menjelek-jelekkan diri kalian dan agama kalian. Dan jika kalian bersabar atas berbagai musibah dan cobaan yang menimpa dan senantiasa bertakwa kepada Allah dengan menjalankan perintah-Nya dan meninggalkan larangan-Nya, sesungguhnya hal itu termasuk perkara yang membutuhkan tekad yang bulat dan yang diperebutkan oleh orang-orang yang berlomba-lomba."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "186. Allah menyingkap hal ghaib kepada orang-orang beriman yang ditegaskan dengan sumpah, hal ghaib ini akan terjadi di masa mendatang: “Akan datang kepada kalian ujian berupa kekurangan harta, musibah-musibah yang dapat merenggut nyawa, dan kalian akan mendengar dari orang-orang Yahudi, Nasrani, dan orang-orang musyrik berita-berita bohong dan perkataan yang buruk; jika kalian bersabar atas semua itu dan bertakwa kepada Allah dengan senantiasa mentaati-Nya, maka itu merupakan hal yang baik yang harus dilaksanakan.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "186. لَتُبْلَوُنَّ فِىٓ أَمْوٰلِكُمْ وَأَنفُسِكُمْ (Kamu sungguh-sungguh akan diuji terhadap hartamu dan dirimu) Kalimat ini ditujukan bagi Rasulullah dan umatnya sebagai penghibur bagi mereka atas apa yang akan mereka dapat dari orang-orang kafir dan fasik, agar mereka dapat meneguhkan diri mereka dan agar tetap sabar dalam menghadapi apa yang tidak mereka sukai. Makna dari ayat ini adalah kalian akan benar-benar diuji terhadap harta kalian dengan berbagai musibah, berbagai infak yang wajib kalian tunaikan, dan segala tuntutan Syariat yang berhubungan dengan harta; dan akan diuji diri kalian dengan kematian, penyakit, kehilangan orang yang disayangi, dan terbunuh di jalan Allah. الَّذِينَ أُوتُوا۟ الْكِتٰبَ مِن قَبْلِكُمْ (orang-orang yang diberi kitab sebelum kamu) Yakni orang-orang Yahudi dan Nasrani. وَمِنَ الَّذِينَ أَشْرَكُوٓا۟ (dan dari orang-orang yang mempersekutukan Allah) Yakni seluruh golongan orang-orang kafir selain ahli kitab. أَذًى كَثِيرًا ۚ(gangguan yang banyak) Yang meliputi tuduhan atas agama kalian dan kehormatan kalian. فَإِنَّ ذٰلِكَ (maka sesungguhnya yang demikian itu) Yakni kesabaran dan ketakwaan. مِنْ عَزْمِ الْأُمُورِ(termasuk urusan yang patut diutamakan) Yakni yang wajib kalian lakukan adalah tetap berazam dan berpegang teguh diatas urusan-urusan agama. Dikatakan (عزمت الأمر) yakni aku berpegang teguh diatas urusan ini dan senantiasa memperbaikinya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Penghinaan-penghinaan yang dilontarkan oleh orang-orang nashrani dan semacamnya kepada Rasulullah serta penganiayaan yang mereka perbuat, pada hakikatnya telah dijelaskan dalam al-qur'an : { وَلَتَسْمَعُنَّ مِنَ الَّذِينَ أُوتُوا الْكِتَابَ مِنْ قَبْلِكُمْ وَمِنَ الَّذِينَ أَشْرَكُوا أَذًى كَثِيرًا } \"Dan (juga) kamu sungguh-sungguh akan mendengar dari orang-orang yang diberi kitab sebelum kamu dan dari orang-orang yang mempersekutukan Allah, gangguan yang banyak yang menyakitkan hati\" kemudian Allah melalui al-qur'an mendatangkan solusi atas masalah ini : { وَإِنْ تَصْبِرُوا وَتَتَّقُوا فَإِنَّ ذَٰلِكَ مِنْ عَزْمِ الْأُمُورِ } \"Jika kamu bersabar dan bertakwa, maka sesungguhnya yang demikian itu termasuk urusan yang patut diutamakan\". 2 ). Sesungguhnya guncangan jiwa yang dirasakan oleh seseorang dihadapan pengrusakan media oleh musuh-musuh islam, adalah merupakan dampak dari lemahnya keimanan dan ketidakpastian keyakinan; karena hakikat dari kebenanran yang mapan adalah : { وَإِنْ تَصْبِرُوا وَتَتَّقُوا لَا يَضُرُّكُمْ كَيْدُهُمْ شَيْئًا } \"Jika kamu bersabar dan bertakwa, niscaya tipu daya mereka sedikitpun tidak mendatangkan kemudharatan kepadamu\" [ali-imran : 120]."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "186. Wahai orang-orang mukmin, sungguh Kalian akan diuji dengan musibah-musibah yang menimpa harta dan jiwa kalian, supaya kalian bisa berinteraksi dengan ujian itu, supaya hakikat keadaan kalian menjadi tampak. Ujian dalam harta itu dengan berzakat, bersedekah, dan tanggungan-tanggungan lainnya yang berhubungan dengan harta, serta diuji dalam diri itu dengan kematian, penyakit, dan kehilangan anak dan orang tercinta di jalan Allah. Dan sungguh kalian akan mendengar banyak gangguan seperti kutukan, cacian dan makian atas kehormatan dan agama kalian dari orang-orang Yahudi, nasrani, dan orang-orang musyrik selain ahli kitab. Jika kalian bersabar atas gangguan itu dan bertakwa kepada Allah dengan menjalankan perintahNya dan menjauhi laranganNya. Maka kesabaran dan ketakwaan itu adalah sesuatu yang harus diputuskan, yaitu sesuatu yang harus kalian putuskan. Ayat ini diturunkan untuk Finhash, seorang yahudi yang berkata {Innallah Faqiirun Wa nahnu agniyaa’} [surah Ali Imran 181] dan untuk Ka’b bin Asyraf yang mengecam Nabi SAW dengan syair. Dia didukung oleh para kafir Quraisy dalam membuat syair itu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kalian pasti akan diuji} akan diuji {dalam harta dan diri kalian. Kalian pasti akan mendengar dari orang-orang yang diberi kitab sebelum kalian dan dari orang-orang musyrik banyak hal yang sangat menyakitkan hati. Jika kalian bersabar dan bertakwa, sesungguhnya yang demikian itu termasuk urusan yang diutamakan} termasuk perkara yang wajib diutamakan dan harus dilewati"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "186. Allah mengabarkan dan mengarahkan pembicaraan kepada kaum Mukminin bahwasanya mereka akan diuji pada harta mereka berupa infak-infak yang wajib dan Sunnah, dan berupa kemungkinan menjadi habis di jalan Allah, dan (diuji) pada diri mereka berupa pembebanan dengan berbagai beban yang berat di atas sebagian besar manusia lain, seperti jihad di jalan Allah dan kemungkinan adanya kelelahan, pembunuhan dan tertawan atau terluka. Atau seperti penyakit yang menimpa pada dirinya atau pada orang yang dicintainya. Dan pastilah kalian akan mendengar dari orang-orang yang diberi al-Kitab dan kaum musyrikin, “gangguan yang banyak” yang menyakitkan hati berupa tuduhan pada diri kalian, pada agama kalian, dan kitab kalian serta Rasul kalian. Kabar dari Allah kepada hamba-hambaNya yang beriman itu tentang hal tersebut menyimpan beberapa faidah di antaranya; ~ Bahwa hikmah Allah menuntut hal tersebut agar terbedakan seorang Mukimin yang benar dari selainnya. ~ Bahwa Allah menakdirkan atas mereka perkara-perkara tersebut, disebabkan Allah menghendaki bagi mereka kebaikan, agar derajat mereka semakin tinggi dan kesalahan-kesalahan mereka terhapus, dan agar iman mereka bertambah dan keyakinan mereka akan semakin sempurna. Apabila Allah mengabarkan hal tersebut kepada mereka, maka hal itu pasti akan terjadi sebagaimana yang dikabarkanNYa. –Al-Ahzab:22- ~ Bahwa Allah mengabarkan kepada mereka tentang hal itu agar jiwa mereka tegar menghadapi kejadian tersebut dan bersabar atasnya apabila terjadi. Karena mereka telah bersiap-siap menghadapi kejadian tersebut, maka menjadi mudahlah bagi mereka untuk memikulnya dan ringan bagi mereka pengorbanan biayanya, dan mereka bersandar kepada sabar dan takwa. Karena itu Allah berfirman, “JIka kamu bersabar dan bertakwa,” maksudnya, apabila kalian bersabar atas apa yang kalian dapatkan pada harta dan jiwa kalian berupa ujian dan cobaan dan gangguan orang-orang yang zhalim, dan kalian bertakwa kepada Allah dalam kesabaran tersebut, dengan meniatkan (hanya) mengharapkan Wajah Allah dan mendekatkan diri kepadaNya dan kalian tidak melampaui batas-batas syariat dalam kesabaran kalian tersebut dengan bersabar pada suatu tempat yang tidak halal bagi kalian bersabar padanya, bahkan sebaliknya tugas kalian padanya adalah membalas musuh-musuh Allah. “Maka sesungguhnya yang demikian itu termasuk urusan yang patut diutamakan.” Maksudnya ia termasuk perkara-perkara yang patut ditekadkan dalam menempuhnya dan berlomba-lomba meraihnya dan tidaklah akan diberi taufik kepadanya kecuali orang-orang yang memiliki tekad dan bercita-cita tinggi, sebagaimana Allah berfirman, \"Sifat-sifat yang baik itu tidak dianugerahkan melainkan kepada orang-orang yang sabar dan tidak dianugerahkan melainkan kepada orang-orang yang mempunyai keuntungan yang besar.\" -Fushilat:35-."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 186: Sesungguhnya kamu dikenakan percobaan di harta-harta kamu dan di diri-diri kamu, dan sesungguhnya kamu akan dengar pencelaan yang banyak dari orang-orang yang diberi Kitab dahulu daripada kamu dan dari orang-orang yang menyekutukan Allah; tetapi jika kamu sabar dan kamu ber bakti, maka sesungguhnya yang demikian itu sebaik-baik perkara."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan adanya nafkah wajib dan sunat, dengan adanya musibah atau dengan siap habis di jalan Allah . Dengan ibadah, bala' (cobaan) atau beban-beban berat, seperti berjihad fii sabilillah, siap mendapatkan kelelahan, terbunuh, tertawan dan terluka, atau terkena penyakit yang menimpa dirinya atau menimpa orang yang dicintainya. Seperti celaan dan cercaan. Ada beberapa faedah mengapa diberitakan hal seperti ini, di antaranya: - Hikmah (kebijaksanaan) Allah Ta'ala menghendaki demikian, untuk membedakan siapa orang mukmin yang sebenarnya dan siapa yang tidak. - Allah menaqdirkan seperti itu karena keinginan-Nya memberikan kebaikan kepada mereka, berupa meninggikan derajat mereka, menghapuskan kesalahan, menambahkan keimanan, dan menyempurnakan keyakinan mereka. Hal itu, karena jika mereka diberitakan akan terjadi seperti itu dan kemudian terjadi, maka orang-orang mukmin akan menghadapinya dengan sikap yang menunjukkan keimanan mereka, seperti yang terjadi dalam perang Azab, di mana kaum mukmin mengatakan, \"Inilah yang dijanjikan Allah dan Rasul-Nya kepada kami, dan benarlah Allah dan Rasul-Nya.\" Yang demikian tidaklah menambah kepada mereka selain keimanan dan ketundukan. (lihat surat Al Ahzab: 22). - Allah mengabarkan demikian agar jiwa merasa siap dan mampu bersabar. Sehingga hal itu menjadi mudah dipikul, bebannya menjadi ringan dan mereka bisa menghadapinya dengan sikap sabar dan takwa. Abu Dawud meriwayatkan dari Abdurrahman bin Abdullah bin Ka'ab bin Malik dari bapaknya, bahwa Ka'ab bin Al Asyraf mencela Nabi shallallahu 'alaihi wa sallam dan diberi dukungan oleh orang-orang kafir Quraisy. Ketika Nabi shallallahu 'alaihi wa sallam tiba di Madinah, sedangkan penduduknya beraneka ragam; ada yang muslim, musyrik yang menyembah berhala dan ada orang-orang Yahudi. Mereka menyakiti Nabi shallallahu 'alaihi wa sallam dan para sahabatnya, maka Allah Azza wa Jalla memerintahkan Nabi-Nya bersabar dan memaafkan. Tentang mereka turunlah ayat, \"Dan pasti kamu akan mendengar banyak hal yang sangat menyakitkan hati…dst,\"(lih. ayat di atas). Ketika Ka'ab bin Al Asyraf enggan berhenti menyakiti Nabi shallallahu 'alaihi wa sallam, maka Nabi shallallahu 'alaihi wa sallam memerintahkan Sa'ad bin Mu'adz mengirimkan beberapa orang untuk membunuhnya, maka dikirimlah Muhammad bin Maslamah, dan disebutkan di sana kisah pembunuhannya. Setelah mereka berhasil membunuhnya, orang-orang Yahudi dan musyrik kaget, mereka pun mendatangi Nabi shallallahu 'alaihi wa sallam dan berkata, \"Di malam hari kawan kami didatangi seseorang lalu dibunuh.\" Maka Nabi shallallahu 'alaihi wa sallam menyebutkan kepada mereka ucapan Ka'ab Al Asyraf, dan Beliau mengajak mereka untuk membuat tulisan berisi aturan yang harus dipenuhi. Maka Nabi shallallahu 'alaihi wa sallam membuat tulisan antara Beliau beserta kaum muslimin dengan mereka sebuah lembaran…dst.\" (Al Mundziri berkata, \"Kata-katanya 'dari bapaknya' perlu ditinjau ulang, karena bapaknya, yakni Abdullah bin Ka'ab bukan sahabat dan bukan salah satu dari tiga orang yang diterima tobatnya (ketika tidak berangkat jihad), dengan demikian hadits ini menjadi mursal. Namun masih mengandung kemungkinan bahwa bapaknya di sini adalah kakeknya, yaitu Ka'ab bin Malik sehingga hadits ini bersambung sanadnya, karena bisa saja Abdurrahman mendengar dari kakeknya, yaitu Ka'ab bin Malik, sedangkan Ka'ab adalah salah satu dari tiga orang yang diterima tobatnya, dan telah terjadi seperti ini di beberapa sanad, dan tidak pada satu tempat.\") Yakni jika kamu bersabar terhadap cobaan yang menimpa harta dan diri kamu atau terhadap gangguan orang-orang zalim, dan kamu bertakwa, yakni mengharapkan keridaan Allah dan menjadikannya sebagai sarana untuk mendekatkan diri kepada-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 186",
    "description": "Kamu pasti akan diuji dengan hartamu dan dirimu dengan berbagai cobaan, ujian, dan musibah seperti kekurangan harta, malapetaka, dan lain-lain. Karena itu Allah menguji siapa pun di antara mereka yang tetap sabar dan istikamah dalam menjalankan perintah Allah, dan mereka yang tidak menerima dengan hati lapang dan sabar. Dan pasti kamu akan mendengar banyak hal yang sangat menyakitkan hati dari orang-orang yang diberi kitab sebelum kamu dan dari orang-orang musyrik berupa ejekan, pendustaan, penghalangan dalam beragama, perlawanan, dan pengkhianatan. Jika kamu bersabar dan bertakwa dalam menghadapi tindakan-tindakan mereka dan tetap teguh melaksanakan perintah Allah dan menjauhi larangan-Nya, maka sesungguhnya yang demikian itu termasuk urusan yang patut diutamakan. Hal itu karena orang-orang yang sabar, bertakwa, dan berbesar hati menerima setiap takdir yang berlaku akan meraih kemenangan yang gemilang atas tipu daya musuh pada ayat lalu dijelaskan gangguan dan tipu daya orang-orang yahudi terhadap nabi, pada ayat ini Allah menjelaskan kelengahan dan pengabaian mereka terhadap ajaran taurat. Dan ingatlah ketika Allah mengambil janji yang kuat berupa aturan-aturan dari orang-orang yahudi dan nasrani yang telah diberi kitab, berupa perintah, hendaklah kamu benar-benar menerangkannya, yakni isi kitab itu, kepada manusia, tentang amar makruf nahi mungkar, halal dan haram sebagaimana termaktub dalam kitab suci yang diturunkan dari Allah. Dan diperintahkan pula janganlah kamu menyembunyikannya, yakni isi kandungan kitab suci tersebut, seperti berita kedatangan nabi Muhammad, dan hukum-hukum syariat tentang halal dan haram. Lalu mereka melemparkan janji itu ke belakang punggung mereka dengan tidak mengindahkan perintahperintah Allah serta mengabaikan aturan-aturan yang telah ditetapkan dan bahkan mereka menjualnya dengan harga murah. Mereka mengubah ketentuan hukum yang telah ditetapkan Allah untuk kepentingan sekelompok orang berpengaruh demi mendapatkan imbalan duniawi. Maka itu seburuk-buruk jual-beli yang mereka lakukan karena mereka rela menukar kemuliaan ilmu, agama, pujian di sisi Allah serta mahluk-Nya, dan kekekalan di surga yang penuh nikmat, dengan kesenangan duniawi yang fana"
  }
]