[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ingatlah (wahai rasul), ketika Allah mengambil janji yang di kukuhkan dari orang-orang yang telah Allah berikan kitab kepada mereka dari kalangan yahudi dan nasrani, maka bagi golongan yahudi kitab taurat dan bagi golongan Nasrani kitab injil, yaitu supaya mereka mengamalkan kandungannya dan menjelaskan kepada sekalian manusia apa yang terkandung di dalamnya, serta tidak menyembuyikan dan menutup-nutupinya. Akan tetapi,kemudian mereka meninggalkan janji tersebut dan tidak berpegang padanya, dan mengambil harga imbalan yang sedikit sebagai imbalan menutupi kebenaran dan mengubah-ubah kitab tersebut. Alangkah buruk apa yang mereka perjualbelikan, dengan menyia-nyiakan perjanjian dan menukarkan kitab tersebut dengannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "187. Dan ingatlah -wahai Nabi- tatkala Allah mengambil perjanjian yang kuat dari para ulama ahli Kitab dari kalangan Yahudi dan Nasrani, bahwa kalian benar-benar akan menerangkan Kitab Allah kepada manusia dan tidak menyembunyikan petunjuk yang ada di dalamnya, dan tidak menutup-nutupi keterangan yang menjelaskan perihal kenabian Muhammad -Ṣallallāhu 'alaihi wa sallam-. Namun mereka justru mencampakkan perjanjian itu dan tidak menghiraukannya. Maka mereka pun menyembunyikan kebenaran dan memperlihatkan kebatilan. Mereka menukar perjanjian Allah itu dengan imbalan yang sangat sedikit dalam bentuk jabatan dan kekayaan yang bisa mereka dapatkan. Sungguh buruk harga yang mereka tukar dengan janji Allah tersebut."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "187. Allah mengingatkan orang-orang beriman tentang orang-orang Yahudi dan Nasrani yang melanggar perjanjian. Ketika Allah mengambil perjanjian dari mereka untuk menjelaskan kepada manusia hukum-hukum yang ada di dalam Taurat dan Injil, dan tidak menyembunyikannya; namun mereka melanggar perjanjian ini, mereka merubah apa yang ada dalam kitab mereka dan menukarnya dengan sedikit kesenangan dunia yang fana. Sungguh itu adalah seburuk-buruk perniagaan yang merugikan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "187. لَتُبَيِّنُنَّهُۥ (Hendaklah kamu menerangkan isi kitab itu) Yakni Allah telah mengambil perjanjian dari orang-orang Yahudi dan nasrani bahwa mereka akan menjelaskan kepada manusia apa yang ada dalam kitab mereka, diantaranya adalah menjelaskan kenabian Nabi Muhammad. فَنَبَذُوهُ وَرَآءَ ظُهُورِهِمْ (lalu mereka melemparkan janji itu ke belakang punggung mereka) Yakni bentuk hiperbola dalam pengungkapan sikap mereka dalam melempar (meninggalkan) perjanjian tersebut. وَاشْتَرَوْا۟ بِهِۦ ثَمَنًا قَلِيلًا ۖ (dan mereka menukarnya dengan harga yang sedikit) Yakni dengan kenikmatan dunia yang sedikit dan hina."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). { وَإِذْ أَخَذَ اللَّهُ مِيثَاقَ الَّذِينَ أُوتُوا الْكِتَابَ لَتُبَيِّنُنَّهُ لِلنَّاسِ وَلَا تَكْتُمُونَهُ } \"Dan (ingatlah), ketika Allah mengambil janji dari orang-orang yang telah diberi kitab (yaitu): \"Hendaklah kamu menerangkan isi kitab itu kepada manusia, dan jangan kamu menyembunyikannya\", seusungguhnya tugas para ulama adalah menjadikan diri mereka penghalang dihadapan para musuh-musuh islam dari aqidah-aqidah yang menyimpang, jiwa-jiwa yang memiliki kekuatan jauh lebih berbahaya daripada kekuatan bala tentara, seakan-akan jalur yang mereka pakai tidak dapat dihalau oleh musuh, masuk kedalam hati para insan dengan mudah, ketika ia datang bagaikan wujudnya seorang tamu yang tidak dipungkiri sang tuan rumah akan menolaknya. 2 ). Ibnu 'aqil berkata : jauhilah oleh kalian lupa akan adab dan peliharalah adab yang baik itu, dan tidak yang aku hawatirkan pada kalian ketika di rumah kalian terdapat mushaf tetapi kalian tetap terjerumus ke dalam jurang kemaksiatan sehingga kalian masuk dalam maksud ayat : { فَنَبَذُوهُ وَرَآءَ ظُهُورِهِمْ } \"lalu mereka melemparkan janji itu ke belakang punggung mereka\""
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "187. Wahai Nabi, ingatlah ketika Allah mengambil janji atas orang Yahudi dan Nasrani melalui para nabi mereka agar mereka menampakkan seluruh isi kitab mereka berupa hukum dan berita-beritanya kepada manusia dan tidak sedikitpun menyembunyikannya, lalu mereka mengingkari janji itu, lalu menggantinya dengan sesuatu yang hina dan murah berupa kenikmatan dunia. Sungguh amat buruk apa yang mereka gunakan untuk membeli dan mengganti"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{(Ingatlah) ketika Allah membuat perjanjian dengan orang-orang yang telah diberi, “Hendaklah kalian benar-benar menerangkan} menampakkan seluruh hal yang terkandung di dalamnya berupa hikmah dan berita {kepada manusia dan janganlah kalian menyembunyikannya.” Lalu, mereka melemparkannya} mereka melemparkan janji itu {ke belakang punggung mereka dan menukarnya} menukarnya {dengan harga yang murah. Itulah seburuk-buruk jual beli yang mereka lakukan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "187. Al-Mitsaq adalah sebuah janji yang berat lagi dikuatkan (dengan sesuatu). Janji tersebut diambil oleh Alah dari setiap orang yang telah Allah berikan kepadanya kitab, dan telah Allah ajarkan kepadanya ilmu, yaitu agar dia menjelaskan apa yang telah Allah ajarkan itu kepada manusia apa yang mereka butuhkan dan tidak menyembunyikannya dan bakhil dengannya kepada mereka, khusunya bila mereka bertanya kepadanya atau terjadi suatu kondisi yang mengharuskan hal tersebut. Karena setiap orang yang memiliki ilmu, maka pada saat itu wajib atasnya menjelaskan dan menerangkan kebenaran dari kebatilan. Orang-orang yang diberi taufik oleh Allah, niscaya mereka akan menunaikan dan menyempurnakan kewajiban tersebut dan mereka mengajarkan manusia apa yang telah Allah ajarkan kepadanya dengan maksud memperoleh keridhaan Rabb mereka dan sebagai rasa kasih terhadap makhluk serta rasa takut dari dosa menyembunyikan ilmu. Sedangkan orang-orang yang telah diberikan kepada mereka al-KItab dari kaum Yahudi dan Nasrani dan orang-orang yang seperti mereka, maka mereka telah melemparkan perjanjian dan ikatan-ikatan tersebut di belakang punggung mereka dan mereka tidak mempedulikannya. Mereka menyembunyikan kebenaran dan menampakkan kebatilan sebagai sikap lancang terhadap hal-hal yang diharamkan oleh Allah serta meremehkan hak-hak Allah dan hak-hak makhluk. Dan dengan penyembunyian itu mereka menukarnya “dengan harga yang sedikit,” yaitu sesuatu yang mereka dapatkan jika mendapatkannya berupa sedikit kedudukan, harta yang hina dari orang-orang yang rendah, yang mengikuti hawa nafsu mereka dan mendahulukan syahwat mereka daripada kebenaran. “Amatlah buruk tukaran yang mereka terima” karena hal itu adalah imbalan yang paling rendah. Sedangkan sesuatu yang mereka benci, yaitu menjelaskn kebenaran yang mengandung kebahagiaan yang abadi dan manfaat agama maupun dunia adalah harapan dan cita-cita yang paling tinggi dan paling mulia; dan tidaklah mereka memilih yang rendah lagi hina dan meninggalkan yang tinggi lagi mahal, melainkan karena buruknya bagian mereka, kehinaan mereka dan kondisi mereka yang tidak baik bagi selain tujuan untuk apa mereka diciptakan. Kemudian Allah berfirman,"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 187: Dan (inga tlah) tatkala Allah mengambil perjanjian mereka yang diberi Kitab (yaitu) sesungguhnya hendaklah kamu terangkan (Kitab) itu kepada manusia dan janganlah kamu sembunyikan dia, Tetapi mereka buang (perjanjian) itu ke belakang mereka dan mereka tukarkan dia dengan harga yang sedikit, maka alangkah jahat barang yang mereka tukar!"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Di antara keterangan yang disembunyikan itu ialah tentang kedatangan Nabi Muhammad shallallahu 'alaihi wa sallam. Yakni tidak mengamalkannya. Yakni dengan kesenangan dunia, seperti menginginkan kedudukannya diangkat atau memperoleh harta. Sehingga mereka berani menyembunyikan ilmu yang mereka ketahui."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 187",
    "description": "Pada ayat lalu dijelaskan gangguan dan tipu daya orang-orang yahudi terhadap nabi, pada ayat ini Allah menjelaskan kelengahan dan pengabaian mereka terhadap ajaran taurat. Dan ingatlah ketika Allah mengambil janji yang kuat berupa aturan-aturan dari orang-orang yahudi dan nasrani yang telah diberi kitab, berupa perintah, hendaklah kamu benar-benar menerangkannya, yakni isi kitab itu, kepada manusia, tentang amar makruf nahi mungkar, halal dan haram sebagaimana termaktub dalam kitab suci yang diturunkan dari Allah. Dan diperintahkan pula janganlah kamu menyembunyikannya, yakni isi kandungan kitab suci tersebut, seperti berita kedatangan nabi Muhammad, dan hukum-hukum syariat tentang halal dan haram. Lalu mereka melemparkan janji itu ke belakang punggung mereka dengan tidak mengindahkan perintahperintah Allah serta mengabaikan aturan-aturan yang telah ditetapkan dan bahkan mereka menjualnya dengan harga murah. Mereka mengubah ketentuan hukum yang telah ditetapkan Allah untuk kepentingan sekelompok orang berpengaruh demi mendapatkan imbalan duniawi. Maka itu seburuk-buruk jual-beli yang mereka lakukan karena mereka rela menukar kemuliaan ilmu, agama, pujian di sisi Allah serta mahluk-Nya, dan kekekalan di surga yang penuh nikmat, dengan kesenangan duniawi yang fana jangan sekali-kali kamu, wahai rasulullah, meyakini dan mengira bahwa orang yang gembira dengan apa yang telah mereka kerjakan meskipun yang mereka lakukan itu perbuatan dosa atau maksiat sekali pun dan mereka suka dipuji dengan membanggakan diri atas perbuatan yang tidak mereka lakukan. Mereka, yakni orang-orang yahudi, menutupi berita yang disampaikan nabi, kemudian mereka menyampaikan berita itu kepada orang lain dengan mengatasnamakan dirinya, sehingga di mata orang lain merekalah yang paling paham tentang isi kitab suci. Apa yang mereka lakukan tersebut adalah demi mengharapkan pangkat dan kedudukan di tengah masyarakat. Oleh karena itu, jangan sekalikali kamu mengira bahwa mereka akan lolos dari azab lantaran Allah telah menghapus pahala dari hasil usahanya dan membatalkan amalnya, karena mereka telah berbuat bohong. Mereka akan mendapat azab yang pedih akibat perbuatan dosa yang mereka lakukan."
  }
]