[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan janganlah kamu sekali-kali menyangka bahwa orang-orang yang bergembira dengan apa yang telah mereka perbuat berupa perbuatan-perbuatan buruk,seperti kaum yahudi,orang-orang munafik dan lain-lain,dan mereka suka pujian orang-orang kepada mereka dengan sesuatu yang tidak mereka lakukan, maka janganlah sekali-kali kamu menduga bahwa mereka itu akan selamat dari siksaan Allah di dunia, dan di akhirat kelak mereka akan mendapat siksaan yang pedih. Dalam ayat ini terkandung ancaman besar terhadap setiap orang yang mendatangi keburukan yang kagum dengan perbuatannya itu, dan terhadap setiap orang yang berbangga dengan sesuatu yang tidak mereka perbuat supaya mendapat sanjungan orang-orang dan memujinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "188. Janganlah kamu menyangka -wahai Nabi- bahwa orang-orang yang gembira dengan keburukan-keburukan yang mereka lakukan dan senang dipuji orang dengan sesuatu (kebajikan) yang tidak pernah mereka lakukan itu akan selamat dari azab. Karena tempat mereka adalah Neraka. Dan mereka akan mendapatkan azab yang menyakitkan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "188. Hai Muhammad, orang-orang yang merasa senang kerena menyembunyikan kebenaran dan sebagainya serta menyukai pujian dari manusia atas sesuatu yang tidak mereka lakukan, janganlah kamu mengira mereka akan selamat dari azab neraka; mereka akan mendapatkan azab yang pedih. Dari Marwan ia berkata kepada ajudannya: “Hai Rafi’ pergilah kepada Ibnu Abbas dan katakan kepadanya: ‘Jika setiap orang dari kita senang dengan apa yang dia lakukan dan senang dengan pujian atas sesuatu yang tidak kita lakukan akan diazab, tentu setiap kita akan diazab semua’.” Ibnu Abbas menjawab: “Ada apa kalian dengan ayat ini? Sebenarnya ayat ini diturunkan untuk para Ahli kitab.” Kemudian Ibnu Abbas membaca ayat 187-188: وَإِذْ أَخَذَ اللَّهُ مِيثَاقَ الَّذِينَ أُوتُوا الْكِتَابَ لَتُبَيِّنُنَّهُ لِلنَّاسِ وَلَا تَكْتُمُونَهُ... Dan (ingatlah), ketika Allah mengambil janji dari orang-orang yang telah diberi kitab (yaitu): \"Hendaklah kamu menerangkan isi kitab itu kepada manusia, dan jangan kamu menyembunyikannya,\" لَا تَحْسَبَنَّ الَّذِينَ يَفْرَحُونَ بِمَا أَتَوْا وَيُحِبُّونَ أَنْ يُحْمَدُوا بِمَا لَمْ يَفْعَلُوا... Janganlah sekali-kali kamu menyangka, hahwa orang-orang yang gembira dengan apa yang telah mereka kerjakan dan mereka suka supaya dipuji terhadap perbuatan yang belum mereka kerjakan... Kemudian Ibnu Abbas menjelaskan: “Para Ahli kitab ditanya oleh Nabi Muhammad tentang sesuatu -dalam kitab mereka- namun mereka menyembunyikan kebenarannya dan menjawabnya dengan jawaban lain. Kemudian mereka keluar dari majelis beliau dan merasa mereka telah menjawab pertanyaannya dengan sebenarnya, dan mengharap pujian atas hal ini. Mereka senang telah menyembunyikan kebenaran darinya tentang jawaban dari pertanyaan tersebut.” (shahih Muslim 4/2143 no. 2778, kitab sifat-sifat munafikin dan hukum-hukum bagi mereka. Shahih Bukhari, tafsir, bab {لَا تَحْسَبَنَّ الَّذِينَ يَفْرَحُونَ بِمَا أَتَوْا})."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "188. لَا تَحْسَبَنَّ الَّذِينَ يَفْرَحُونَ (Janganlah sekali-kali kamu menyangka, hahwa orang-orang yang gembira) Yakni barangsiapa yang senang dengan apa yang ia lakukan dan suka dipuji atas apa yang tidak ia lakukan maka janganlah kalian sangka itu menjadi penyelamatnya dari azab. Dikeluarkan oleh Imam Bukhari dan Muslim dan lainnya bahwa Khalifah Marwan berkata dengan penjaga pintu istananya: Hai Rafi’ pergilah kepada Ibnu Abbas lalu katakan kepadanya: seandainya semua orang dari kita merasa senang dengan yang ia lakukan dan suka dipuji atas apa yang tidak ia lakukan itu mendapat azab, maka kita semua pasti akan mendapat azab? Ibnu Abbas menjawab: apa urusan kalian dengan ayat ini? Sesungguhnya ayat ini turun untuk ahli kitab, mereka ditanya oleh Rasulullah tentang sesuatu lalu mereka menyembunyikan jawaban sebenarnya dan menjawabnya dengan jawaban yang lain. Kemudian mereka keluar darinya dan merasa mereka telah menjawab pertanyaannya dan mengharap pujian darinya atas yang mereka lakukan, dan mereka merasa senang dengan menyembunyikan jawaban apa yang Rasulullah tanyakan kepada mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "188. Wahai Nabi, jangan sampai kamu mengira orang yang bergembira dengan perbuatan mereka berupa menyesatkan manusia, mencoba memalingkan mereka dari Islam, dan senang bila manusia memuji mereka atas perbuatan yang belum mereka kerjakan, yaitu berpegang pada kebenaran. Mereka itu berada dalam kesesatan. Maka janganlah kamu menyangka mereka itu akan selamat dari siksa di neraka Jahanam. Dan bagi mereka itu azab yang pedih disana. Imam Bukhari, Imam Muslim, dan lainnya meriwayatkan dari Ibnu ‘Auf bahwa Marwan berkata kepada pelayannya: “Wahai Rafi’, temuilah Ibnu Abbas dan tanyakanlah hal sebagai berikut, “Jika setiap orang yang pernah merasa gembira dengan apa yang dimilikinya dan suka untuk dipuji terhadap hal yang tidak pernah dia lakukan akan diazab (kelak di akhirat), niscaya tidak akan ada seorang pun dari kita yang selamat dari azab?” Ibnu Abbas menjawab: “Kalian tidak termasuk dalam (ancaman) ayat ini. Sesungguhnya ayat ini diturunkan untuk ahli kitab, yang mana mereka ditanya Nabi SAW tentang sesuatu, lalu mereka menyembunyikan jawabannya dari Nabi, dan memberitahu hal lain. Lalu mereka pergi dan beranggapan bahwa mereka telah memberikan jawaban yang benar, dan berharap mendapatkan pujian atas jawaban tersebut, dan merasa senang dengan tindakan menyembunyikan jawaban itu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jangan sekali-kali kamu mengira} jangan berprasangka {bahwa orang yang gembira dengan apa yang telah mereka kerjakan} perbuatan buruk yang mereka lakukan {dan suka dipuji atas perbuatan yang tidak mereka lakukan, jangan sekali-kali kamu mengira bahwa mereka dengan keberuntungan mereka} keberhasilan mereka {akan lolos dari azab. Bagi mereka itu azab yang sangat pedih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "188. “Janganlah sekali-kali kamu menyangka, bahwa orang-orang yang gembira dengan apa yang telah mereka kerjakan,” yaitu berupa keburukan dan kebatilan perkataan maupun perbuatan, “dan mereka suka supaya dipuji terhadap perbuatan yang belum mereka kerajakan,” maksudnya, (dipuji) dengan kebaikan yang tidak mereka kerjakan dan kebenaran yang belum mereka katakan. Mereka telah menyatukan antara perbuatan buruk dan perkataan buruk, serta gembira akan hal tersebut dan suka akan pujian terhadap perbuatan baik yang belum mereka kerjakan. “Janganlah kamu menyangka bahwa mereka terlepas dari siksa,” maksudnya, berposisi selamat dan bebas, akan tetapi mereka berhak mendapat siksa, dan mereka akan menuju kepadanya. Karena itu Allah berfirman, “Dan mereka mendapatkan siksa yang pedih.” Termasuk dalam ayat yang mulia ini adalah ahli Kitab yang bergembira dengan sesuatu yang ada pada mereka berupa ilmu, namun mereka tidak tunduk kepada Rasul, dan mereka menyangka bahwa merekalah yang benar dalam kondisi riil dan pandangan hidup mereka. Demikian juga setiap orang yang berbuat bid’ah, baik perkataan maupun perbuatan, dan senang dengannya, lalu mengajak orang kepadanya, dan menyangka bahwa dia benar dan selainnya batil, sebagaimana umumnya terjadi pada ahli-ahli bid’ah. Ayat ini dengan pemahamannya menunjukkan bahwa barangsiapa yang suka dipuji dan disanjung dengan apa yang telah diperbuatnya berupa kebaikan dan mengikuti kebenaran, apabila tujuannya bukanlah ingin dilihat (riya’) dan didengar (sum’ah), maka hal tersebut tidaklah tercela. Bahkan hal ini termasuk perkara yang dianjurkan, yang telah Allah kabarkan bahwa Allah akan memberikan balasan bagi orang-orang yang berbuat kebaikan dalam perkataan maupun perbuatan, dan bahwa Allah akan memberikan balasan terhadap hamba-hambaNya yang dicintaiNya, dan mereka memohon hal itu kepadaNya; seperti perkataan Ibrahim, \"dan jadikanlah aku buah tutur yang baik bagi orang-orang (yang datang) kemudian,\" -Asy-Syuara:84- Dan Allah berfirman “Kesejahteraan dilimpahkan atas Nuh di seluruh alam” Sesungguhnya demikianlah Kami memberi balasan kepada orang-orang yang berbuat baik.\" -Ash-Shaffat:79-80- Hamba-hamba dari Yang Maha Rahman berkata,\" dan jadikanlah kami imam bagi orang-orang yang bertakwa.\" -Al-Furqan:74- Itu semua adalah nikmat Sang Pencipta atas hamba-hambaNya, di mana itu semua membutuhkan sikap syukur."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 188: Janganlah sekali-kali engkau menyangka orang-orang yang sangat suka dengan apa yang mereka telah lakukan dan suka dipuji atas sesuatu yang mereka tidak kerjakan itu janganlah sekali-kali akan engkau sangka mereka terlepas daripada siksaan tetapi adalah bagi mereka adzab yang pedih."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Imam Bukhari meriwayatkan dari Abu Sa'id Al Khudri radhiyallahu 'anhu, bahwa beberapa orang munafik di zaman Rasulullah shallallahu 'alaihi wa sallam, ketika Rasulullah shallallahu 'alaihi wa sallam keluar berperang, mereka tidak ikut dan merasa senang tidak berangkat meninggalkan Rasulullah shallallahu 'alaihi wa sallam. Ketika Rasulullah shallallahu 'alaihi wa sallam pulang, mereka mengemukakan alasan dan mereka senang jika dipuji terhadap hal yang tidak mereka lakukan, maka turunlah ayat, \"Laa tahsabannalladziina yafrahuuna…dst.\" Imam Bukhari meriwayatkan dari 'Alqamah bin Waqqas, bahwa Marwan berkata kepada penjaga pintunya, \"Pergilah wahai Raafi' kepada Ibnu Abbas, katakan kepadanya, \"Jika setiap orang senang dengan apa yang diberikan dan senang dipuji dalam hal yang tidak dilakukannya akan diazab, tentu kita semua akan diazab.\" Ibnu Abbas berkata, \"Apa hubungan kamu dengan ayat ini! Sesungguhnya Nabi shallallahu 'alaihi wa sallam pernah mengajak orang-orang Yahudi dan menanyakan kepada mereka tentang sesuatu, lalu mereka menyembunyikannya, dan mereka memberitakan dengan yang selainnya, lalu saya melihat mereka ingin dipuji terhadap berita yang mereka sampaikan dan mereka senang dengan sikap mereka menyembunyikan.\" Lalu Ibnu Abbas membacakan ayat, \"Wa idz akhadzallahu miitsaaqalladziina utul kitaab….\" Sampai \"Yafrahuuna bimaa atau wa yuhibbuuuna ay yuhmaduu bimaa lam yaf'aluu…\" (Ali Imran: 187-188) Berupa menyesatkan manusia, atau mengerjakan perbuatan dan perkataan buruk. Padahal mereka tidak mengerjakan kebaikan dan tidak menegakkan kebenaran. Dengan demikian, mereka menggabung antara mengerjakan keburukan, senang terhadapnya dan suka dipuji terhadap sesuatu yang mereka tidak melakukannya. Termasuk ke dalam ayat ini adalah Ahli Kitab yang bergembira dengan ilmu yang ada pada mereka, namun mereka tidak mengikuti rasul dan menyangka bahwa sikap mereka benar. Demikian juga orang yang mengadakan bid'ah baik berupa ucapan maupun perbuatan, lalu ia bergembira dengannya dan mengajak manusia kepada perbuatan bid'ah itu serta menyangka bahwa diri mereka benar, sedangkan yang lain salah. Ayat di atas juga menunjukkan bahwa orang yang senang mendapat pujian karena kebaikannya dan mengikuti yang hak, jika maksudnya bukan riya' dan sum'ah, maka tidaklah tercela. Oleh karena itu, Nabi Ibrahim 'alaihis salam pernah berdoa, \"Dan Jadikanlah aku buah tutur yang baik bagi orang-orang (yang datang) kemudian.\" (Terj. Asy Syu'araa: 84)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 188",
    "description": "Jangan sekali-kali kamu, wahai rasulullah, meyakini dan mengira bahwa orang yang gembira dengan apa yang telah mereka kerjakan meskipun yang mereka lakukan itu perbuatan dosa atau maksiat sekali pun dan mereka suka dipuji dengan membanggakan diri atas perbuatan yang tidak mereka lakukan. Mereka, yakni orang-orang yahudi, menutupi berita yang disampaikan nabi, kemudian mereka menyampaikan berita itu kepada orang lain dengan mengatasnamakan dirinya, sehingga di mata orang lain merekalah yang paling paham tentang isi kitab suci. Apa yang mereka lakukan tersebut adalah demi mengharapkan pangkat dan kedudukan di tengah masyarakat. Oleh karena itu, jangan sekalikali kamu mengira bahwa mereka akan lolos dari azab lantaran Allah telah menghapus pahala dari hasil usahanya dan membatalkan amalnya, karena mereka telah berbuat bohong. Mereka akan mendapat azab yang pedih akibat perbuatan dosa yang mereka lakukandan milik Allah-lah seluruh kerajaan langit dan bumi dengan segala isinya, dan Allah mahakuasa atas segala sesuatu terhadap ciptaan-Nya dengan memberinya kehidupan dan rezeki, mengatur, mematikan, membalas, dan menghitung setiap amal perbuatan manusia."
  }
]