[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan milik Allah saja kerajaan langit dan bumi dan segala yang terdapat pada keduanya. Dan Allah maha kuasa atas segala sesuatu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "189. Hanya Allah satu-satunya pemilik kerajaan langit dan bumi beserta isinya. Dia lah yang menciptakan dan mengaturnya. Dan Allah Mahakuasa atas segala sesuatu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "189. Hanya milik Allah segala perbendaharaan langit, bumi, dan seisinya. Hanya Allah yang Maha Kuasa atas segalanya. Dan barangsiapa yang berada dalam kekuasaan-Nya maka ia berada dalam genggaman-Nya. Lihat: surat al-Baqarah: 117."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "189. Dan Allah adalah Dzat yang Maha Merajai seluruh langit dan bumi, Dia mengatur segala isinya sesuai kehendakNya. Dan Allah itu Maha Kuasa atas segala sesuatu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Milik Allah itu kerajaan langit dan bumi. Allah Maha kuasa atas segala sesuatu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "189. Maksudnya, Dia-lah Pemilik langit dan bumi dan sesuatu yang ada pada keduanya berupa seluruh macam makhluk, Yang bertindak pada mereka dengan kesempurnaan kuasa dan keindahan ciptaan, dan Dia tidak terhalang oleh seseorang pun dari mereka, dan tidak ada seorang pun yang melemahkanNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 189: Bagi Allah-lah kerajaan langit dan bumi, dan Allah amat Berkuasa atas tiap-tiap suatu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dia bertindak terhadap semua yang ada di langit dan di bumi dengan kuasa-Nya yang sempurna, sehingga tidak ada satu pun makhluk yang dapat menolak ketetapan-Nya dan tidak ada satu pun makhluk yang dapat melemahkan-Nya. Di antara kekuasaan-Nya juga adalah dengan menyiksa orang-orang kafir dan menyelamatkan orang-orang mukmin."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 189",
    "description": "Dan milik Allah-lah seluruh kerajaan langit dan bumi dengan segala isinya, dan Allah mahakuasa atas segala sesuatu terhadap ciptaan-Nya dengan memberinya kehidupan dan rezeki, mengatur, mematikan, membalas, dan menghitung setiap amal perbuatan manusia. Setelah menjelaskan keburukan-keburukan orang yahudi dan menegaskan bahwa langit dan bumi milik Allah, pada ayat ini Allah menganjurkan untuk mengenal keagungan, kemuliaan, dan kebesarannya. Sesungguhnya dalam penciptaan benda-benda angkasa, matahari, bulan, beserta planet-planet lainnya dan gugusan bintang-bintang yang terdapat di langit dan perputaran bumi pada porosnya yang terhampar luas untuk manusia, dan pergantian malam dan siang, pada semua fenomena alam tersebut terdapat tanda-tanda kebesaran Allah bagi orang yang berakal yakni orang yang memiliki akal murni yang tidak diselubungi oleh kabut ide yang dapat melahirkan kerancuan."
  }
]