[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya agama yang diridhoi Allah bagi makhlukNya dan Dia mengutus rasul-rasul Nya dengan agama itu, serta tidak menerima selainnya, adalah agama Islam. Yaitu kepatuhan kepada Allah semata dengan beribadah berserah diri kepada-Nya, dan mengikuti rasul-rasul dalam ajaran-ajaran yang mengutus mereka dengannya dalam setiap masa sampai ditutup dengan Nabi Muhammad , yang Allah tidak menerima dari siapapun sepeninggal beliau agama selain Islam yang beliau diutus dengannya. Dan tidaklah terjadi perselisihan di antara golongan ahli kitab Yahudi dan Nasrani, lalu mereka berpecah-belah menjadi golongan-golongan dan berkelompok-kelompok, kecuali setelah hujjah tegak terhadap mereka dengan diutusnya para Rasul dan diturunkannya kitab-kitab suci, lantaran dorongan permusuhan, kedengkian dan hasrat meraih dunia. Dan barangsiapa mengingkari ayat-ayat Allah yang diturunkan dan tanda-tanda petunjuknya yang mengindikasikan Rububiyyah dan Uluhiyyahnya, maka sesungguhnya Allah sangat cepat perhitungan Nya dan Dia memberikan balasan kepada mereka sesuai dengan apa yang telah mereka perbuat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Sesungguhnya agama yang diterima di sisi Allah ialah Islam. Yaitu ketundukan kepada Allah semata dengan menunjukkan ketaatan dan kepasrahan kepada-Nya melalui ibadah dan keimanan kepada semua Rasul hingga Rasul penutup, Muhammad -ṣallallāhu 'alaihi wa sallam- yang menjadi penutup risalah, sehingga tidak ada syariat yang bisa diterima kecuali syariatnya. Dan tidaklah orang-orang Yahudi dan Nasrani itu berselisih paham dan berpecah belah tentang agama mereka kecuali setelah mereka mendapatkan pengetahuan tentang hal itu, karena dorongan rasa dengki dan rakus terhadap kekayaan duniawi. Barangsiapa yang ingkar kepada ayat-ayat Allah yang diturunkan kepada Rasul-Nya, sesungguhnya Allah Mahacepat Penghitungan-Nya bagi orang yang ingkar kepada-Nya dan mendustakan rasul-rasul-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "19. Allah mengabarkan tidak ada agama yang Dia terima dari seseorang selain agama Islam, yaitu dengan mengikuti para rasul yang diutus Allah pada setiap zaman yang ditutup dengan pengutusan Nabi Muhammad. Orang-orang Yahudi dan Nasrani tidak berselisih melainkan setelah datang kepada mereka ilmu tentang pengutusan nabi Muhammad dalam Taurat dan Injil, mereka mengingkari hal ini karena kedengkian mereka, kemudian mereka saling menzalimi. Dan barangsiapa yang mendustakan bukti-bukti Allah atas keesaan-Nya maka ketahuilah Dia sungguh cepat pembalasan-Nya bagi hamba-hamba-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "19. إِنَّ الدِّينَ عِندَ اللهِ الْإِسْلٰمُ ۗ (Sesungguhnya agama (yang diridhai) disisi Allah hanyalah Islam ) Yakni tidak meneriman dari siapapun agama selainnya. Dan Islam disini mencakup iman karena yang dimaksud dengan Islam disini adalah pembenaran, perkataan, dan perbuatan. وَمَا اخْتَلَفَ الَّذِينَ أُوتُوا۟ الْكِتٰبَ(Tiada berselisih orang-orang yang telah diberi Al Kitab ) Yakni orang-orang Yahudi saling berselisih sesama mereka, dan orang-orang Nasrani saling berselisih sesama mereka, dan orang-orang Yuhudi dan Nasrani saling berselisih pula. إِلَّا مِنۢ بَعْدِ مَا جَآءَهُمُ الْعِلْمُ ( kecuali sesudah datang pengetahuan kepada mereka) Yakni apa yang ada dalam dua kitab yang diturunkan Allah, dan pengetahuan ini sangat jelas bagi mereka berupa kewajiban untuk mentauhidkan Sang Pencipta dan mentaati-Nya, dan menyerahkan kepada-Nya segala urusan. بَغْيًۢا بَيْنَهُمْ ۗ (karena kedengkian (yang ada) di antara mereka ) Terdapat pemberitahuan dari ayat ini bahwa perselisihan orang-orang Yahudi dan Nasrani selama ini hanyalah disebabkan kedengkian mereka. Dan yang dimaksud adalah perselisihan mereka dalam masalah Rasulullah apakah dia adalah seorang Rasul atau bukan, dan perselisihan dalam masalah kenabian Nabi Isa, dan perselisihan yang berasal dari urusan diantara mereka sendiri; sampai-sampai mereka mengatakan: وَقَالَتِ الْيَهُودُ لَيْسَتِ النَّصَارَىٰ عَلَىٰ شَيْءٍ وَقَالَتِ النَّصَارَىٰ لَيْسَتِ الْيَهُودُ عَلَىٰ شَيْءٍ (Dan orang-orang Yahudi berkata: “Orang-orang Nasrani itu tidak mempunyai suatu pegangan”, dan orang-orang Nasrani berkata: “Orang-orang Yahudi tidak mempunyai sesuatu pegangan”) Semua hal ini disebabkan oleh kedengkian dan jauhnya mereka dari kebenaran karena kesombongan dan tinggi hati."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19 Sesungguhnya agama yang diridhai di sisi Allah hanyalah Islam yang mencakup keimanan. Orang-orang Yahudi dan Nasrani tidak berselisih kecuali setelah datang ilmu dalam Taurat dan Injil yang mewajibkan untuk mengesakan Allah, menyembah-Nya dan taat kepada-Nya. Perselisihan diantara mereka sudah melewati batas wajar, menerjang kebenaran dan keadilan karena kedengkian yang ada di antara mereka. Barangsiapa yang kafir terhadap ayat-ayat Allah yang menunjukkan keesaan-Nya, maka sesungguhnya Allah sangat cepat pembalasan-Nya atas perbuatan mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya agama} agama yang diridhai dan benar {di sisi Allah ialah Islam. tidak berselisih orang-orang yang telah diberi kitab} orang-orang Yahudi dan Nasrani {kecuali setelah datang pengetahuan kepada mereka karena kedengkian di antara mereka} kedengkian dan keinginan untuk mencari keberuntungan dunia {Siapa saja yang mengingkari ayat-ayat Allah, sesungguhnya Allah sangat cepat perhitunganNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "19. Allah memeberitakan, ”Sesungguhnya agama (yang di ridhai) di sisi Allah,” maksudnya, agama yang mana Allah tidak memiliki agama selainnya dan tidak diterima selainya adalah, ”Islam,” yang artinya, ketundukan kepada Allah semata, secara batin maupun lahir dengan apa yang di syariatkanNya melalui lisan Rasul-rasulNya, Allah berfirman : \"Barangsiapa mencari agama selain agama Islam, maka sekali-kali tidaklah akan diterima (agama itu)daripadanya, dan dia di akhirat termasuk orang-orang yang rugi.\" QS-Ali Imran: 85 maka barangsiapa yang beragama selain agama islam, maka hakikatnya dia tidak beragama untuk Allah. Karena ia tidak menempuh jalan yang di syariatkaNya melalui lisan rasul-rasulNya. Kemudian Allah memberitakan bahwasanya ahli kitab mengetahui hal itu, dan mereka berselisih dan menyimpang darinya hanya kerena keras kepala dan kedengkian, dan jika bukan kerena itu, maka sesungguhnya telah datang kepada mereka ilmu, yang mengharuskan tidak terjadinya perselisihan bahkan mengharuskan mereka memasuki agama islam yang sebenarnya. Kemudian setelah datang Nabi Muhammad kepada mereka, maka mereka mengetahui dengan sebanar-benarNya, akan tetapi kedengakian, zhalim, dan kekufuran kepada ayat-ayat Allah telah mengahalangi mereka dari mengikuti kebanaran, ”Barang siapa yang kafir terhadap ayat-ayat Allah, maka sesungguhnya Allah sangat cepat hisabNya,” Maksudnya,hendaklah mereka menunggu hal tersebut,karena itu semua pasti akan tiba, dan Allah akan membalas mereka semua menurut apa yang telah mereka semua kerjakan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 19: Sesungguhnya agama (yang sah) di sisi Allah ialah Islam, tetapi orang-orang (kafir) yang diberi Kitab itu tidak berselisihan,lantaran ketama'an antara mereka,melainkan sesudah datang pengetahuan kepada mereka; dan barangsiapa tidak percaya kepada keterangan-keterangan Allah, maka sesungguhnya Allah itu Penghitung Yang Cepat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu agama yang memerintahkan untuk menyerahkan diri kepada Allah dengan mentauhidkan-Nya, tunduk kepada-Nya dengan mentaati-Nya, berlepas dari syirk dan pelakunya serta mengikuti rasul yang diutus Allah Subhaanahu wa Ta'aala, yang diakhiri oleh Nabi Muhammad shallallahu 'alaihi wa sallam. Ada pula yang mengartikan Islam dengan \"syari'at yang dibawa para rasul, yang dasarnya adalah tauhid\". Orang yang mencari agama selain agama yang dibawa Nabi Muhammad shallallahu 'alaihi wa sallam (agama Islam), maka agama itu tidak akan diterima, dan di akhirat dia termasuk orang-orang yang rugi. Sebagiannya beriman dan sebagian lagi kafir. Maksudnya ialah Kitab-Kitab yang diturunkan sebelum Al Quran, seperti orang-orang Yahudi dan Nasrani. Yakni setelah tegak hujjah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 19",
    "description": "Setelah ayat sebelumnya menjelaskan tentang keesaan Allah, maka ayat ini menegaskan tentang kebenaran islam yang inti ajarannya adalah tauhid. Sesungguhnya agama yang benar dan diridai di sisi Allah ialah islam, yang inti ajarannya adalah tauhid. Tidaklah berselisih orangorang yang telah diberi kitab, yakni para penganut yahudi dan nasrani, terhadap kebenaran islam, kecuali atau justru setelah mereka memperoleh pengetahuan tentang hal itu, bukan karena ketidaktahuan. Demikian ini, karena adanya rasa kedengkian di antara mereka terhadap karunia yang diberikan kepada nabi Muhammad sebagai rasul terakhir. Padahal, barangsiapa ingkar terhadap ayat-ayat Allah, baik yang tertulis maupun yang tak tertulis, maka sungguh, Allah sangat cepat perhitungan-Nya terhadap amal-amal hamba-Nya. Lalu jika mereka membantahmu, wahai nabi Muhammad, tentang kebenaran islam, maka jelaskan dengan diperkuat dalil-dalil. Namun, jika mereka tetap menolak, maka katakanlah, aku berserah diri kepada Allah dan tidak bertanggung jawab atas pengingkaran kalian; demikian pula orang-orang yang mengikutiku. Dan katakanlah kepada orang-orang yang telah diberi kitab, yahudi dan nasrani dan kepada orang-orang buta huruf, yaitu orang-orang musyrik arab yang tidak memiliki kitab suci, sudahkah kamu masuk islam' jika mereka masuk islam dengan sebenarbenarnya, berarti mereka telah mendapat petunjuk jalan yang benar, yang menyelamatkan mereka di dunia dan akhirat, tetapi jika mereka berpaling dari islam, maka kewajibanmu, wahai nabi Muhammad, hanyalah menyampaikan. Dan Allah maha melihat seluruh amal perbuatan hambahamba-Nya, siapa yang taat dan siapa yang membangkang."
  }
]