[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya dalam penciptaan langit dan bumi yang tanpa ada contoh sebelumnya dan dalam pergantian malam dan siang dan perbedaan waktu keduanya dengan memanjang dan memendek benar-benar merupakan petunjuk-petunjuk dan bukti-bukti yang agung atas keesaan Allah bagi orang-orang yang mempunyai akal-akal yang selamat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "190. Sesungguhnya di dalam penciptaan langit dan bumi, dari tidak ada menjadi ada serta tanpa ada contoh sebelumnya, dan di dalam pergantian malam dan siang serta perbedaan panjang dan pendeknya waktu, benar-benar terdapat bukti-bukti nyata bagi orang-orang yang berakal sehat yang menunjukkan mereka kepada Sang Maha Pencipta alam semesta, hanya Dia Yang berhak disembah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "190. Sungguh dalam penciptaan langit dan bumi, pergantian siang dan malam dengan teratur merupakan bukti-bukti yang jelas atas keesaan dan keagungan-Nya bagi orang-orang yang memiliki akal yang sehat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "190.وَاخْتِلٰفِ الَّيْلِ وَالنَّهَارِ (dan silih bergantinya malam dan siang) Yakni pada pergantian keduanya dengan datang setelah kepergian salah satunya, dan perbedaan panjang pendek waktu keduanya, dan panas dinginnya, dan lain sebagainya. لَاٰيٰتٍ (terdapat tanda-tanda) Yakni tanda-tanda yang jelas dan bukti yang nyata atas Sang Pencipta. لِّأُو۟لِى الْأَلْبٰبِ (bagi orang-orang yang berakal) Yakni akal yang bersih dari kekurangan apapun. Karena hanya dengan memikirkan apa yang Allah sebutkan pada ayat ini cukup bagi orang yang berakal untuk menyampaikkannya pada keimanan yang tidak dapat digoncangakan oleh syubhat dan tidak terhalang oleh keraguan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Dalam hal penciptaan langit dan bumi terdapat ayat-ayat yang menjelaskan tentangnya, begitupun dengan pergantian siang dan malam : seperti panjang dan pendek waktunya, panas dan dinginnya suhu dan cuaca, rasa aman dan takut yang dirasakan oleh setiap manusia pada kedua waktu itu, kerasnya kehidupan dan kesejahteraan yang terdapat pada keduanya, dan sebagainya yang menjadi ciri perbedaan dan pergantian kedua waktu tersebut, semua ada ayat secara khusus menjelaskan yang kemudian adalah bukti atas keagungan dan kekuasaan sang pencipta, dan bahwasanya penciptaan dan pengaturan secara mutlaq adalah milik dan hak Allah semata. 2 ). Demi Allah hati ini tidak akan tercerahkan kecuali dengan bertafakkur, yang juga merupakan ibadah para nabi dan auliya' dari setiap zaman, Amir bin 'Abdu Qois berkata : aku mendengar lebih dari satu orang sahabat Nabi mereka berkata : \"sesungguhnya cahaya iman itu pada bagaimana kita bertafaku\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "190. Sesungguhnya dalam penciptaan dan pembuatan langit dan bumi, pergantian malam dan siang hari dengan sangat rinci, pergantian keduanya dalam waktu yang lama maupun singkat, panas dan dingin, serta peristiwa lainnya itu mengandung dalil yang jelas atas keberadaan, kuasa dan keesaan Allah bagi orang-orang yang berakal sehat. Ayat ini diturunkan ketika suku uraisy meminta Nabi SAW dengan berkata: “Bedoalah kepada Tuhanmu untuk menjadikan bukit Shafa menjadi emas” Lalu beliau berdoa kepada Tuhan. Kemudian turunlah ayat ini {Inna fii khalqissamaawaati}, Maka sebaiknya kalian memikirkan hal tersebut."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya dalam penciptaan langit dan bumi serta pergantian} pergantian {malam dan siang terdapat tanda-tanda} petunjuk yang jelas {bagi orang yang berakal"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "190. Allah memberitakan, “SEsungguhnya dalam penciptaan langit dan bumi, dan silih bergantinya malam dan siang terdapat tanda-tanda bagi orang-orang yang berakal.” Termasuk di dalamnya adalah anjuran pada hamba untuk memikirkan ciptaanNya, memperhatikan dengan seksama tanda-tandanya dan merenungkan proses penciptaannya. Allah menyebut secara umum FirmanNya, “Tanda-tanda”, dan tidak berfirman menurut kepentingan (sempit) bagi seseorang sebagai isyarat kepada banyaknya dan keumumannya. Yang demikian itu karena di dalamnya mengandung tanda-tanda yang menakjubkan yang membuat decak kagum orang-orang yang memandangnya dan memuaskan orang-orang yang memikirkannya, menarik hati orang-orang yang jujur, membangunkan akal yang jernih terhadap tuntutan-tuntutan ilahiyah. Adapun perincian perkara yang dikandung olehnya, maka tidaklah mungkin makhluk dapat menghinggakan dan meliputi sebagiannya. Secara global segala sesuatu yang ada padanya berupa keagungan, keluasan, keberaturan peredaran dan gerakannya, menunjukkan kepada keagungan Penciptanya, agungnya kekuasaanNya dan keuniversalan KuasaNya, dan semua yang ada di dalamnya berupa keteraturan dan kedetailan, serta keindahan dan kelembutan perbuatan. Semua perbuatan (dan karya) itu menunjukkan kebijaksanaan Allah yang meletakkan segala sesuatu pada tempat yang tepat dan begitu luasnya ilmuNya. Dan apa pun yang dikandungnya berupa manfaat bagi makhluk menunjukkan akan keluasan rahmat Allah, umumnya karuniaNya, kebaikanNya yang menyeluruh dan kewajiban bersyukur kepadaNya. Semua itu menunjukkan ketergantungan hati kepada Pencipta dan Pembuatnya, dan mengerahkan segala upaya dalam memperoleh keridhaanNya, dan agar Allah tidak disekutukan dengan sesuatu pun, dari orang yang tidak memiliki sebesar biji atom sekalipun untuk dirinya maupun untuk orang lain, di bumi dan tidak pula di langit. Allah mengkhususkan tanda-tanda itu kepada orang-orang yang berakal, karena mereka adalah orang-orang yang memiliki akal pikiran, dan merekalah orang-orang yang dapat mengambil manfaat darinya yang memperhatikan dengan akal pikiran mereka, dan bukan dengan (hanya) pandangan mereka saja."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 190: Sesungguhnya di tentang kejadian langit dan bumi dan perlisihan malam dan siang itu, ada beberapa tanda-tanda bagi orang-orang yang mempunyai fikiran."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Demikian juga keajaiban-keajaiban yang ada pada keduanya, seperti besarnya, luasnya, teraturnya peredaran benda yang beredar dan lain sebagainya. Semua ini menunjukkan keagungan Allah, keagungan kerajaan-Nya dan menyeluruhnya kekuasaan-Nya. Tertib dan teraturnya ciptaan Allah, demikian juga rapi dan indahnya menunjukkan kebijaksanaan Allah dan tepat-Nya serta luas ilmu-Nya. Terlebih dengan manfaat bagi makhluk yang ada di dalamnya terdapat dalil yang menunjukkan keluasan rahmat-Nya, meratanya karunia dan kebaikan-Nya, dan semua itu menghendaki untuk disyukuri. Semua itu juga menunjukkan butuhnya makhluk kepada khaliqnya dan tidak pantas Penciptanya disekutukan. Di dalam ayat ini terdapat anjuran untuk memikirkan alam semesta, memperhatikan ayat-ayat-Nya dan merenungkan ciptaan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 190",
    "description": "Setelah menjelaskan keburukan-keburukan orang yahudi dan menegaskan bahwa langit dan bumi milik Allah, pada ayat ini Allah menganjurkan untuk mengenal keagungan, kemuliaan, dan kebesarannya. Sesungguhnya dalam penciptaan benda-benda angkasa, matahari, bulan, beserta planet-planet lainnya dan gugusan bintang-bintang yang terdapat di langit dan perputaran bumi pada porosnya yang terhampar luas untuk manusia, dan pergantian malam dan siang, pada semua fenomena alam tersebut terdapat tanda-tanda kebesaran Allah bagi orang yang berakal yakni orang yang memiliki akal murni yang tidak diselubungi oleh kabut ide yang dapat melahirkan kerancuanorang-orang berakal yaitu orang-orang yang senantiasa memikirkan ciptaan Allah, merenungkan keindahan ciptaan-Nya, kemudian dapat mengambil manfaat dari ayat-ayat kauniyah yang terbentang di jagat raya ini, seraya berzikir kepada Allah dengan hati, lisan, dan anggota tubuh. Mereka mengingat Allah sambil berdiri dan berjalan dengan melakukan aktivitas kehidupan. Mereka berzikir kepada-Nya seraya duduk di majelis-majelis zikir atau masjid, atau berzikir kepada-Nya dalam keadaan berbaring menjelang tidur dan saat istirahat setelah beraktivitas, dan mereka memikirkan tentang penciptaan langit dan bumi sebagai bukti kekuasaan Allah yang mahaagung seraya berkata, ya tuhan kami! kami bersaksi bahwa tidaklah engkau menciptakan semua ini sia-sia melainkan mempunyai hikmah dan tujuan di balik ciptaan itu semua. Mahasuci engkau, kami bersaksi tiada sekutu bagi-Mu. Kami mohon kiranya engkau melimpahkan taufik agar kami mampu beramal saleh dalam rangka menjalankan perintah-Mu, dan lindungilah kami dari murka-Mu sehingga kami selamat dari azab neraka."
  }
]