[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Yaitu orang-orang yang mengingat Allah dalam semua kondisi mereka, baik berdiri,duduk dan dalam keadaan mereka berbaring. Mereka mentadaburi dalam penciptaan langit dan bumi seraya berkata, ”wahai tuhan kami, Engkau tidaklah menciptakan makhluk ciptaan ini dengan sia-sia. Dan Engkah Maha suci dari hal itu. Maka jauhkanlah dari kami siksaan neraka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "191. Mereka adalah orang-orang yang senantiasa mengingat Allah dalam kondisi apapun. Baik dalam kondisi berdiri, duduk maupun berbaring. Dan mereka juga senantiasa menggunakan akal pikiran mereka untuk memikirkan penciptaan langit dan bumi. Mereka pun berkata, “Wahai Rabb, Engkau tidak menciptakan makhluk yang sangat besar ini untuk bersenda gurau. Mahasuci Engkau dari senda gurau. Maka jauhkanlah kami dari azab Neraka, dengan cara Engkau bimbing kami kepada perbuatan-perbuatan yang baik dan Engkau lindungi kami dari perbuatan-perbuatan yang buruk."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "191. Dan beberapa sifat orang-orang berakal sehat ini adalah banyak berzikir kepada Allah dalam segala keadaan, menegakkan shalat baik itu dengan berdiri, duduk, maupun berbaring, senantiasa merenungi proses penciptaan langit dan bumi, serta senantiasa berdoa: “Ya Tuhan kami, Tidaklah Engkau menciptakan makhluk-makhluk ini untuk sesuatu yang sia-sia dan tanpa hikmah, Maha Suci Engkau, jauhkanlah kami dari siksa neraka.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "191. الَّذِينَ يَذْكُرُونَ اللهَ قِيٰمًا وَقُعُودًا وَعَلَىٰ جُنُوبِهِمْ (yaitu) orang-orang yang mengingat Allah sambil berdiri atau duduk atau dalam keadan berbaring) Yakni mereka senantiasa berzikir kepada Allah dalam setiap keadaan. Dan dulu Rasulullah senantiasa berzikir kepada Allah di setiap waktu. Pendapat lain mengatakan yang dimaksud dari kata zikir disini adalah shalat, yakni mereka tidak melalaikannya dalam keadaan apapun, sehingga mereka senantiasa melakukan shalat baik dengan berdiri ketika tidak ada uzur dan halangan atau dengan duduk atau berbaring ketika terhalang untuk berdiri. وَيَتَفَكَّرُونَ فِى خَلْقِ السَّمٰوٰتِ وَالْأَرْضِ (dan mereka memikirkan tentang penciptaan langit dan bumi) Yakni tentang kehebetan dan kedetailan penciptaan keduanya padahal ukurannya sangat besar. رَبَّنَا مَا خَلَقْتَ هٰذَا بٰطِلًا ((seraya berkata): “Ya Tuhan kami, tiadalah Engkau menciptakan ini dengan sia-sia) Yakni Engkau tidak menciptakan ini dengan sia-sia atau main-main akan tetapi Engkau menciptakannya sebagai bukti atas hikmah dan kekuasaan-Mu, dan untuk Engkau jadikan bumi sebagai tempat menguji hamba-hamba-Mu agar terlihat siapa diantara mereka yang mentaati-Mu dan siapa yang bermaksiat kepada-Mu. سُبْحٰنَكَ (Maha Suci Engkau) Yakni Engkau Maha Suci dari apa yang tidak layak untuk-Mu."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Pada ayat ini dalil bahwasanya dianjurkannya berdzikir dalam segala keadaan, maka dapat difahami bahwa diperbolehkan bagi wanita haid untuk membaca al-qur’an, dan pendapat ini adalah pendapat madzhab Malik, dan perkataan dalam madzhab imam Ahmad dan Syafi’i, serta banyak lagi dari kalangan muhaqqiq, adapun hadits : (( لا تقرأ الحائض ولا الجنب شيئاً من القرآن )) “Hendaknya wanita haid dan orang yang junub tidak membaca Al-Quran sedikitpun” adalah hadits lemah berdasarkan kesepakatan para ahli hadits, dan jika pelarangan membaca al-qur’an untuk keduanya secara muthlaq menjadi penghalang bagi mereka dari banyaknya kebaikan. 2 ). { الَّذِينَ يَذْكُرُونَ اللَّهَ قِيَامًا وَقُعُودًا وَعَلَىٰ جُنُوبِهِمْ } Dan jika ayat ini saja menerangkan tentang dzikir dalam semua keadaan dianjurkan, maka maka lebih utama lagi jika berfatwa dalam keadaan duduk ataupun berbaring demi mashlahat ummat. 3 ). { وَيَتَفَكَّرُونَ فِي خَلْقِ السَّمَاوَاتِ وَالْأَرْضِ رَبَّنَا مَا خَلَقْتَ هَٰذَا بَاطِلًا سُبْحَانَكَ فَقِنَا عَذَابَ النَّارِ } Ayat ini menjadi dalil bahwasanya tawasul dengan perbuatan sang pencipta dan dengan rububiyah-Nya adalah salah satu sebab diterimaya doa; hal itu dapat difahami dari ayat yang datang setelahnya : { فَاسْتَجَابَ لَهُمْ رَبُّهُمْ } “Maka Tuhan mereka memperkenankan permohonannya”. 4 ). Berpikir adalah permulaan dari setiap perbuatan, karena hampir setiap orang akan mengerjakan sesuatu setelah ia mematangkan pikirannya, dan melihat apa yang akan ia perbuat, kemudian barulah ia bergetrak dan mempersembahkan apa yang dapat ia lakukan : { وَيَتَفَكَّرُونَ فِي خَلْقِ السَّمَاوَاتِ وَالْأَرْضِ رَبَّنَا مَا خَلَقْتَ هَٰذَا بَاطِلًا سُبْحَانَكَ فَقِنَا عَذَابَ النَّارِ } , maka dalam ayat ini dijelaskan bahwa orang-orang beriman itu setelah mereka berpikir, mereka kemudian berbuat sesuatu yang bermanfaat, kemudian mereka memohon kepada Allah jannah-Nya, dan mereka juga memohon perlindungan dari siksaan api neraka. 5 ). Dalam ayat ini Allah mengatakan : { مَا خَلَقْتَ هَٰذَا بَاطِلًا } , dan tidak dengan lafazh : ماخلقت ( هذه \\ هؤلا) ; karena maksud Allah tertuju kepada hamba-Nya yang dilangit dan dibumi, hal itu diisyaratkan oleh firman-Nya : { سُبْحَانَكَ فَقِنَا عَذَابَ النَّارِ } “Maha Suci Engkau, maka peliharalah kami dari siksa neraka”. 6 ). Dalam firman Allah : { رَبَّنَا مَا خَلَقْتَ هَٰذَا بَاطِلًا سُبْحَانَكَ فَقِنَا عَذَابَ النَّارِ } adalah pembelajaran bagi setiap hamba bagaimana mereka berdoa dan bagaimana adab-adab yang mesti mereka indahkan ketika berdoa, diantaranya adalah mempersembahkan pujian kepada Allah tatkala mengucapkan doa, kemudia barulah mengucapkan doanya, sebagaimana yang dicontohkan oleh ayat ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "191. Orang-orang yang selalu mengingat Allah dalam segala kondisinya, yaitu dalam keadaan berdiri ketika shalat, duduk di masjlis mereka, dan bersandar ketika dalam keadaan junub. Mereka berpikir tentang kehebatan penciptaan langit, bumi dan meyakininya. Mereka berkata: “Wahai Tuhan Kami, Engkau tidak menciptakan hal ini sia-sia dan hanya sebagai hiburan, namun Engkau menciptakannya sebagai petunjuk atas kuasa dan hikmahMu. Kami menyucikanmu dari segala sesuatu yang tidak sesuai denganMu dan dari kesia-siaan. Maka jadikanlah ketaatan kami kepadaMu itu sebagai pelindung dari neraka”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "(yaitu) orang-orang yang mengingat Allah sambil berdiri, duduk} dalam keadaan berdiri dan duduk {atau dalam keadaan berbaring} dan dalam keadaan berbaring {dan memikirkan tentang penciptaan langit dan bumi (dan berkata), “Ya Tuhan kami, tidaklah Engkau menciptakan semua ini sia-sia} sia-sia {Maha suci Engkau} Maha suci Engkau dengan hal itu {Lindungilah kami} jauhkanlah kami {dari azab neraka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "191. Kemudian Allah menjelaskan sipat-sipat orang-orang yang berakal itu,bahwa mereka adalah,”orang-orang yang mengingat Allah” pada segala kondisi mereka,”ambil berdiri atau duduk atau dalam keadaan berbaring,” Ini mencakup segala perkataan dzikir dan hati,dan termasuk hal itu adalah shahat dalam keadaan berdiri,bila tidak mamapu,maka dengan,duduk,dan bila tidak mampu, maka dengan berbaring,dan bahwa mereka”memikirkan tantang penciptaan langit dan bumi.”maksudnya,agar mereka menjadikanya sebagai dalil atas meksud darinya. Ini menujukan bahwa berpikir adalah ibdah dan merupakan salah satu sipat dari sipat-sipat wali Allah yang berilmuApabila mereka memikirkanya, niscaya mereka mngetahui bahwa Allah tidaklah menciptakan mereka dengan sia-sia.Maka mereka berkata”Ya Tuhan Kami,tiadalah Engkau menciptakan ini dengan sia-sia,MahaSuci Engkau”dari segalah hal yang tidak patut bagu keagungnganMu dengan kebenaran karena kebenaran.akan tetapi engkau menciptakan semua itu dengan mengandung kebenaran,”maka periharalah kami dari siksa neraka,” dengan melindungi kami dari keburukan-keburukan dan engkau bimbing kami kepada amalan-amalan shalihhingga dengan itu semua kami memperoleh keselamatan dari api nereka.Dan hal itu mengandung permohonan masuk syurga, karena bila Allah memelihara mereka dari siksa nereka, niscaya mereka memperolwh syurga. Tetapi pada saat rasa takut muncul pada hati mereka,niscaya mereka memohon kepada Allah dengan perkara-perkara yang paling penting bagi mereka;"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 191: Yang mengingat Allah sambil berdiri dan sambil duduk dan sambil berbaring, dan memikirkan tentang kejadian langit dan bumi (sambil berkata): \"Hai Tuhan kami! Engkau tidak jadikan ini (semua) dengan sia-sia! Maha Suci Engkau! Lantaran itu, (daripada) siksa neraka,\" peliharalah kami."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni dalam setiap keadaan. Menurut Ibnu Abbas, bahwa maksudnya mereka melakukan shalat sesuai kemampuan, yakni jika tidak sanggup berdiri, maka sambil duduk dst. Namun demikian, ayat ini mencakup semua dzikr lainnya dengan lisan maupun hati. Memikirkan kekuasaan Penciptanya atau memikirkan maksudnya. Ayat ini menunjukkan bawa berpikir merupakan ibadah dan termasuk sifat wali-wali Allah yang mengenal-Nya. Setelah mereka memikirkannya, mereka pun tahu bawa Allah tidak menciptakannya sia-sia. Bahkan di sana terdapat dalil sempurnanya kekuasaan-Mu. Yakni dari menciptakan sesuatu secara main-main. Termasuk juga di dalamnya meminta surga, karena ketika mereka meminta dilindungi dari neraka, maka secara langsung mereka juga meminta surga, akan tetapi karena besarnya rasa takut dalam hati mereka, maka mereka menyebut sesuatu yang paling merisaukan mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 191",
    "description": "Orang-orang berakal yaitu orang-orang yang senantiasa memikirkan ciptaan Allah, merenungkan keindahan ciptaan-Nya, kemudian dapat mengambil manfaat dari ayat-ayat kauniyah yang terbentang di jagat raya ini, seraya berzikir kepada Allah dengan hati, lisan, dan anggota tubuh. Mereka mengingat Allah sambil berdiri dan berjalan dengan melakukan aktivitas kehidupan. Mereka berzikir kepada-Nya seraya duduk di majelis-majelis zikir atau masjid, atau berzikir kepada-Nya dalam keadaan berbaring menjelang tidur dan saat istirahat setelah beraktivitas, dan mereka memikirkan tentang penciptaan langit dan bumi sebagai bukti kekuasaan Allah yang mahaagung seraya berkata, ya tuhan kami! kami bersaksi bahwa tidaklah engkau menciptakan semua ini sia-sia melainkan mempunyai hikmah dan tujuan di balik ciptaan itu semua. Mahasuci engkau, kami bersaksi tiada sekutu bagi-Mu. Kami mohon kiranya engkau melimpahkan taufik agar kami mampu beramal saleh dalam rangka menjalankan perintah-Mu, dan lindungilah kami dari murka-Mu sehingga kami selamat dari azab nerakamereka berdoa kepada Allah sang pencipta yang menghidupkan dan mematikan. Ya tuhan kami, sesungguhnya orang yang engkau masukkan ke dalam neraka karena menyekutukan-Mu dan akibat keangkuhannya, maka sungguh, engkau telah menghinakannya dengan menimpakan azab yang pedih, dan tidak ada seorang penolong pun yang dapat memberikan pertolongan bagi orang yang zalim. Karena orang-orang zalim pantas mendapatkan murka dan siksaan dari Allah."
  }
]