[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai tuhan kami,selamatkanlah kami dari neraka, karena sesungguhnya Engakau (ya Allah),barangsiapa yang Engkau masukan kedalam neraka karena dosa-dosanya, maka sungguh Engkau telah mempermalukan dan menghinakannya. Dan tidak ada bagi orang-orang yang berbuat dosa lagi berbuat kezhaliman terhadap diri mereka seorangpun yang dapat mencegah dari mereka siksaan Allah pada hari kiamat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "192. Karena sesungguhnya orang yang Engkau masukkan ke dalam Neraka adalah orang yang Engkau hinakan dan Engkau permalukan. Dan orang-orang yang zalim itu kelak di hari Kiamat tidak akan mendapatkan penolong yang dapat melindungi mereka dari azab dan hukuman Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "192-194. Allah mengajarkan orang-orang beriman cara berdoa kepada-Nya: “Wahai Pencipta kami, Barangsiapa dari hamba-Mu yang Engkau masukkan ke dalam neraka maka sungguh ia telah Engkau hinakan, dan orang-orang yang zalim tidak akan terlepas dari azab. Wahai Tuhan kami, kami telah mendengar seseorang yang menyeru kepada keimanan yang bernama Muhammad, ‘Berimanlah kepada Pencipta kalian’, maka kami menyambut seruan itu dan kami telah beriman, maka janganlah Engkau siksa kami akibat dosa-dosa kami dan ampunilah perbuatan maksiat kami serta ambillah nyawa kami bersama orang-orang shalih. Wahai Tuhan kami, realisasikanlah apa yang Engkau janjikan kepada kami melalui lisan para rasul-Mu berupa kemenangan dan rahmat, dan janganlah Engkau hinakan kami pada hari ditampakkan amal kami kepada-Mu. Sungguh kami mengetahui Engkau tidak akan mengingkari janji.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "192. رَبَّنَآ إِنَّكَ مَن تُدْخِلِ النَّارَ فَقَدْ أَخْزَيْتَهُۥ ۖ (Ya Tuhan kami, sesungguhnya barangsiapa yang Engkau masukkan ke dalam neraka, maka sungguh telah Engkau hinakan ia) Yakni Engkau hinakan dan rendahkan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Bukanlah suatu kehinaan ketika Anda menyampaikan dakwah kepada ummat atau menyeru mereka kepada kebaikan dan melarang mereka dari kemungkaran, kemudian Anda ditolak dengan dengan kemuliaan ini, atau Anda dihinakan dihadapan orang banyak, tetapi kehianaan yang sesungguhnya adalah kemarahan yang engkau terima dari sang Maha agung, dan sisksaan yang amat sangat pedih, dihadapan seluruh ummat dari awal zaman sampai akhirnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "192. Wahai Tuhan kami, Sesungguhnya hambaMu yang Engkau masukkan ke dalam neraka, maka sungguh dia telah Engkau hinakan dan rendahkan. Dan tidaklah bagi orang-orang zalim terhadap diri sendiri itu penolong yang melindungi mereka dari azabMu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ya Tuhan kami, sesungguhnya orang yang Engkau masukkan ke dalam neraka, benar-benar Engkau hinakan} menghinakan dia {dan tidak ada seorang penolong pun bagi orang-orang yang zalim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "192. “Ya Tuhan Kami,sesunggunya barang siapa yang engbkau masukan ke dalam neraka,maka sungguh telah engkau hinakan dia,”yaitu karena dia telah memperoleh murka dari Allah,para malaikatNya,para waliaNya,dan terjadinya kehinaan yang tidak ada keselamatan dan pelarian darinya. Itulah sebabnya Allah berfitman,”dan tida ada bagi orang-orang yang zhalim seorang penolong pun,”yang menyelamatkan mereka dari siksanya.ayat ini menunjukan bahwa mereka masuk neraka disebabkan kezhaliman mereka sendiri."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 192: \"Hai Tuhan kami! Sesungguhnya siapa-siapa yang Engkau masukkan neraka, sesungguhnya Engkau telah celakakan dia; dan tidak ada pembantu-pembantu bagi orang-orang yang menganiaya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Karena ia mendapatkan kemurkaan dari Allah, malaikat-Nya, wali-wali-Nya dan mendapatkan aib yang tidak dapat lolos daripadanya. Yang menolong mereka dari azab. Ayat ini menunjukkan bahwa mereka masuk ke dalam neraka karena kezaliman mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 192",
    "description": "Mereka berdoa kepada Allah sang pencipta yang menghidupkan dan mematikan. Ya tuhan kami, sesungguhnya orang yang engkau masukkan ke dalam neraka karena menyekutukan-Mu dan akibat keangkuhannya, maka sungguh, engkau telah menghinakannya dengan menimpakan azab yang pedih, dan tidak ada seorang penolong pun yang dapat memberikan pertolongan bagi orang yang zalim. Karena orang-orang zalim pantas mendapatkan murka dan siksaan dari Allah lalu mereka memohon lagi. Ya tuhan kami, pencipta dan pemberi karunia! sesungguhnya kami mendengar orang yang menyeru kepada iman, yaitu nabi Muhammad dengan Al-Qur'an, mengajak seluruh umat untuk mengesakan-Mu, menaati perintah-Mu, dan menjauhi laranganmu, seraya menyeru, berimanlah kamu kepada tuhanmu, pencipta alam semesta, dan pemberi karunia kepada seluruh hamba-Nya, maka kami pun beriman dan mematuhi petunjuknya dan mengikuti jalannya. Oleh karena itu, ya tuhan kami, kiranya engkau tutupi aib kami, ampunilah dosa-dosa kami dan hapuskanlah kesalahan-kesalahan kami, yang telah kami lakukan akibat kelalaian kami, dan matikanlah kami dalam kebaikan, tetapkanlah kami pada kebenaran beserta orang-orang yang berbakti yaitu para pengikut rasul-rasul-Mu, di bawah naungan rida-Mu dalam keadaan memeluk agama islam."
  }
]