[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai tuhan kami, sesungguhnya kami telah mendengar seorang penyeru, (yaitu nabiMU, Muhammad sholallohu alaihi wasallam), yang menyeru sekalian manusia untuk beriman kepadaMU dan mengakui keesaanMU, serta beramal mengerjakan syariatMU, lalu kami memenuhi seruan dakwahnya dan kami Imani risalahnya, maka ampunilah dosa-dosa kami dan tutupilah aib-aib kami dan kumpulkanlah kami bersama orang-orang shalih."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "193. Wahai Rabb kami, sesungguhnya kami telah mendengar orang (yaitu nabi-Mu Muhammad -Ṣallallāhu 'alaihi wa sallam) yang menyerukan keimanan seraya berkata, “Berimanlah kamu kepada Allah, Rabb kalian, sebagai Tuhan Yang Maha Esa.” Kemudian kami beriman kepada apa yang diserukannya dan mengikuti syariatnya. Maka tutupilah dosa-dosa kami dan janganlah Engkau permalukan kami. Ampunilah keburukan-keburukan kami dan janganlah Engkau menghukum kami karenanya. Dan wafatkanlah kami bersama orang-orang yang saleh dengan Engkau bimbing kami untuk mengerjakan perbuatan-perbuatan yang baik dan meninggalkan perbuatan-perbuatan yang buruk."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "193. سَمِعْنَا مُنَادِيًا يُنَادِى لِلْإِيمٰنِ (kami mendengar (seruan) yang menyeru kepada iman) Orang yang menyeru itu adalah Rasulullah. Dan pendapat lain mengatakan itu adalah al-Qur’an. فَـَٔامَنَّا ۚ (maka kamipun beriman) Yakni kami menjawab apa yang diperintahkan orang yang menyeru ini berupa keimanan. رَبَّنَا(Ya Tuhan kami) Pengulangan panggilan ini untuk menunjukkan ketundukan dan ketaatan kepada-Nya. الْأَبْرَارِ (orang-orang yang banyak berbakti) Yakni yang berbakti dan senantiasa sibuk dalam ketaatan kepada Allah. Dan pendapat lain mengatakan mereka adalah para Nabi."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Ayat ini memberikan faidah begitu banyak, diantaranya : - Iman kepada para Rasul, dan kepada kebanaran yang mereka sampaikan. - Rekomendasi bagi para Rasul bahwasanya apa yang mereka sampaikan adalah datangnya dari Allah. - Rububiyah Allah adalah sebab ‘aqli kewajiban beriman kepada-Nya. - Tawassul kepada Allah dengan amalan shalih, dan amalan yang paling besar adalah : Iman kepada-Nya, dan hakikatnya itu adalah adab dalam berdoa. - Sesungguhnya hal yang paling utama dalam doa seorang hamba adalah : permohonan pengampunan dosa dari tuhannya. 2 ). Adalah seruan kepada rahmat sang Maha kuasa : { رَبَّنَا إِنَّنَا سَمِعْنَا مُنَادِيًا يُنَادِي لِلْإِيمَانِ أَنْ آمِنُوا بِرَبِّكُمْ فَآمَنَّا } maka apakah ada seruan lain yang lebih indah seruannya selain seruan dari sang Maha kuasa, atau jalan yang lebih mulia jalan-Nya ? 3 ). Diantara kutamaan dan keistimewaan al-qur’an adalah bahwasanya dia sebagai penyeru kepada keimanan, Muhammad bin Ka’b berkata : “tidak semua ummat Muhammad dapat melihat beliau, tetapi al-qur’an adalah penyeru kepada iman yang dapat disaksikan oleh seluruh ummatnya”. 4 ). Suatu ketika Hasan al-Bashry ditanya : siapakah mereka yang disebut (al-abror) ? beliau kemudian menjawab : “mereka yang tidak berbuat aniaya kepada semut kecil”."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "193. Wahai tuhan Kami, sesungguhnya Kami mendengarkan penyeru, yaitu Nabi dan Al-Qur’an yang menyeru agar kami beriman kepadaMu. Lalu Kami beriman kepadaMu wahai Tuhan yang Maha Esa, tiada tuhan selain Engkau. Wahai Tuhan kami, tutuplah kemaksiatan kami, dan matikanlah kami bersama orang-orang terpilih yang memperbaiki amal mereka, yaitu para nabi yang shalih. Adz-dzunub adalah sesuatu yang timbul akibat kelalaian dalam ibadah. As-sayyiat adala sesuatu yang menyalahi hak-hak para hamba"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ya Tuhan kami, sesungguhnya kami mendengar orang yang menyeru} penyeru, yaitu nabi Muhammad SAW {pada keimanan} kepada keimanan {yaitu \"Berimanlah kalian kepada Tuhan kalian” maka kami pun beriman. Ya Tuhan kami, ampunilah dosa-dosa kami, hapuskanlah} hapuslah {kesalahan-kesalahan kami, dan wafatkanlah kami beserta orang-orang yang selalu berbuat kebaikan} orang-orang shalih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "193. ”Ya Tuhan Kami,sesungguhnya kami mendengar (seruan) yang mengajak kami kepada iman,” yaitu Muhammad. Maksudnya beliau menyeru manusia kepada iman, menganjurkan mereka menempuhnya pada asas-asasnya maupun cabang-cabangnya. “Maka kamipun beriman,” maksudnya,kami memenuhi seruanya dengan segera dan kami cepat-cepat kepadanya. Ayat ini adalah kabar dari mereka atas karunia Allahatas mereka, rasa bangga akan nikmatNya dan bertawashul kepada Allah agar Allah mengampuni dosa-dosa mereka dan mengugurkan keburukan-keburukan mereka,karena kebaikan itu akan menghapus kaburukan,dan orang-oramng yang dikaruniai iman oleh Allah,niscaya Allah akan mengaruniakan kepada mereka rasa man yang sempurna. “Dan wafatkanlah kami beserta orang-orang yang berbakti,” dan ini mengandung taufik untuk berbuat kebaikan dan meninggalkan keburukan,di mana dengan itulah seorang hamba termasuk ke dalam orang-orang yang berbakti,konsisten dan teguh terhadapnya hingga maut menjemput."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 193: Sesungguhnya kami telah mendengar seorang penyeru yang menyeru kepada iman, (katanya): \"Bahwa berimanlah kepada Tuhan maka kami pun telah beriman. Hai Tuhan kami! Lantaran itu, ampunkanlah dosa-dosa kami dan hilangkanlah kejahatan-kejahatan kami dan terimalah kami di golongan orang-orang yang berbakti\",."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu Nabi Muhammad shallallahu 'alaihi wa sallam. Dalam ayat ini terdapat dalil bagi tawassul yang disyari'atkan, yaitu tawassul dengan iman atau amal salih yang dikerjakan. Dalam doa ini terdapat permintaan taufiq agar dapat menjalankan kebaikan dan meninggalkan keburukan, di mana yang demikian dapat menjadikannya tergolong sebagai orang-orang yang berbakti dan beristiqamah di atasnya sampai wafat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 193",
    "description": "Lalu mereka memohon lagi. Ya tuhan kami, pencipta dan pemberi karunia! sesungguhnya kami mendengar orang yang menyeru kepada iman, yaitu nabi Muhammad dengan Al-Qur'an, mengajak seluruh umat untuk mengesakan-Mu, menaati perintah-Mu, dan menjauhi laranganmu, seraya menyeru, berimanlah kamu kepada tuhanmu, pencipta alam semesta, dan pemberi karunia kepada seluruh hamba-Nya, maka kami pun beriman dan mematuhi petunjuknya dan mengikuti jalannya. Oleh karena itu, ya tuhan kami, kiranya engkau tutupi aib kami, ampunilah dosa-dosa kami dan hapuskanlah kesalahan-kesalahan kami, yang telah kami lakukan akibat kelalaian kami, dan matikanlah kami dalam kebaikan, tetapkanlah kami pada kebenaran beserta orang-orang yang berbakti yaitu para pengikut rasul-rasul-Mu, di bawah naungan rida-Mu dalam keadaan memeluk agama islam mereka pun berdoa lagi. Ya tuhan kami yang mahabijaksana! kami memohon kepada-Mu, berilah kami karunia sebagaimana apa yang telah engkau janjikan kepada kami melalui rasul-rasul-Mu berupa pahala, ampunan, dan berada di dekat-Mu di surga yang penuh kenikmatan. Dan janganlah engkau hinakan kami pada hari kiamat di hadapan semua saksi pada hari berkumpulnya seluruh umat manusia dari setiap generasi. Sungguh, engkau tidak pernah mengingkari janji. Tidak ada ucapan yang lebih baik daripada ucapan-Mu. Kami menunggu apa yang telah engkau janjikan dan kabarkan, sebagaimana yang telah engkau sebutkan dalam kitab suci-Mu yang diturunkan melalui utusan-Mu."
  }
]