[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai tuahan kami, berikanlah kepada kami apa yang telah Enkau janjikan melalui lisan-lisan rasul-rasulMU berupa kemenangan, kekuasaan, taufik dan hidayah, dan janganlah Engkau permalukan kami dengan sebab dosa-dosa kami pada hari kiamat, karena sesungguhnya Engkau maha mulia, tidak mengingkari janji yang telah Engakau janjikan hal itu kepada hamba-hambaMu.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "194. Wahai Rabb kami, dan berikanlah apa yang telah Engkau janjikan kepada kami melalui lisan para rasul-Mu, yaitu petunjuk dan pertolongan-Mu di dunia ini. Dan janganlah Engkau permalukan kami di hari Kiamat dengan memasukkan kami ke dalam Neraka. Sesungguhnya Engkau -wahai Rabb kami- adalah Tuhan Yang Maha Pemurah dan Engkau tidak akan mengingkari janji-Mu.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "194. رَبَّنَا وَءَاتِنَا مَا وَعَدتَّنَا عَلَىٰ رُسُلِكَ (Ya Tuhan kami, berilah kami apa yang telah Engkau janjikan kepada kami dengan perantaraan rasul-rasul Engkau) Yakni yang dijanjikan lewat para Rasul adalah pahala yang Allah janjikan kepada orang-orang yang taat kepada-Nya. وَلَا تُخْزِنَا يَوْمَ الْقِيٰمَةِ ۗ (Dan janganlah Engkau hinakan kami di hari kiamat) Yakni jangan buka aib kami sehingga menjadikan itu kehinaan bagi kami. الْمِيعَادَ (janji) Yakni perjanjian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "194. Wahai tuhan Kami, berilah Kami sesuatu yang Engkau janjikan kepada kami melalui lisan rasulMu berupa rahmat dan karunia. Dan janganlah Engkau membongkar dosa-dosa kami pada hari kiamat sehingga kami menjadi rendah dan hina. Sesungguhnya Engkau tidak akan mengingkari janji yang telah Engkau janjikan kepada hamba-hambaMu, berupa ampunan bagi mereka yang berhak, dan kelembutan bagi orang yang berbuat buruk."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Ya Tuhan kami, anugerahilah kami} berilah kami {apa yang telah Engkau janjikan kepada kami melalui rasul-rasulMu} melalui lisan rasul-rasulMu {dan janganlah Engkau hinakan kami} janganlah Engkau hinakan kami {pada hari Kiamat. Sesungguhnya Engkau tidak pernah mengingkari janji.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "194. Dan ketika merekam menyebutkan taufik Allah untuk mereka kepada keimanan dan tawashulnya mereka dengan hal itu kepada kesempurnaan nikmat,maka mereka memohon kepada Allah pahalaNyaatas hal tersebut dan agar Allah merealisasikan janjiNya kepada mereka yang di ucapkan melalui lisan RasulNya dengan keridhoan Allah dan syurgaNya di akhirat, karena sesungguhnya Allah tidaklah menyalahi janjinya.maka Allah memenuhi doa mereka dan menerima ibadah mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 194: 194-195. \"Hai Tuhan kami! berilah kepada kami apa yang Engkau telah janjikan kepada kami dengan perantaraan rasul-rasul-Mu, dan janganlah Engkau hinakan kami di hari Kiamat, karena sesungguhnya Engkau tidak akan memungkiri perjanjian. Maka Tuhan mereka telah perkenankan \"Bahwasanya Aku tidak akan siakan-siakan 'amalan orang yang beramal di antara Kami dari laki-laki atau, perempuan (karena) sebagian daripada kamu, (jadi) dari sebagian, Tetapi orang-orang yang berhijrah dari negeri-negerinya, dan disakiti dan dikeluarkan di jalan Ku, dan berperang, dan terbunuh itu, sesungguhnya Aku akan hilangkan kesalahan-kesalahan mereka dan sesungguhnya Aku akan masukkan mereka di surga-surga yang mengalir padanya sungai-sungai, sebagai ganjaran dari Allah, karena Allah itu, di sisiNya ada ganjaran yang baik."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Permintaan mereka agar diberikan janji Allah yang disampaikan oleh para rasul meskipun Allah tidak pernah mengingkari janji-Nya adalah agar mereka digolongkan ke dalam orang-orang yang berhak menerimanya, karena mereka belum yakin termasuk orang-orang yang menerimanya, dan diulanginya kata \"Ya Tuhan kami\" berkali-kali menunjukkan sikap tadharru' (perendahan diri yang dalam) mereka. Janji Allah kepada Rasul-Nya di antaranya adalah mendapatkan kemenangan di dunia dan mendapatkan keridaan Allah dan surga-Nya di akhirat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 194",
    "description": "Mereka pun berdoa lagi. Ya tuhan kami yang mahabijaksana! kami memohon kepada-Mu, berilah kami karunia sebagaimana apa yang telah engkau janjikan kepada kami melalui rasul-rasul-Mu berupa pahala, ampunan, dan berada di dekat-Mu di surga yang penuh kenikmatan. Dan janganlah engkau hinakan kami pada hari kiamat di hadapan semua saksi pada hari berkumpulnya seluruh umat manusia dari setiap generasi. Sungguh, engkau tidak pernah mengingkari janji. Tidak ada ucapan yang lebih baik daripada ucapan-Mu. Kami menunggu apa yang telah engkau janjikan dan kabarkan, sebagaimana yang telah engkau sebutkan dalam kitab suci-Mu yang diturunkan melalui utusan-Mu setelah mereka (ulul albab) memanjatkan pujian dan doa kepada Allah dengan tulus dan penuh harapan, maka tuhan mereka memperkenankan permohonannya dan mewujudkan harapannya dengan berfirman, sesungguhnya aku tidak menyia-nyiakan amal perbuatan atau usaha orang yang beramal serta pahala orang-orang yang berbuat kebajikan di antara kamu, baik laki-laki maupun perempuan. Keduanya memperoleh imbalan yang sama; tidak ada perbedaan antara keduanya, karena sebagian kamu adalah keturunan dari sebagian yang lain, sehingga kalian adalah bersaudara. Karenanya tidak ada kelebihan yang satu dari yang lain tentang penilaian iman dan amalnya di sisi Allah (lihat surah an-nahl/16: 97). Maka orang yang berhijrah meninggalkan negeri, keluarga, dan harta kekayaan mereka, yang karena mempertahankan keimanannya mereka diusir dari kampung halamannya, dan mereka yang disakiti lantaran berjuang pada jalan-ku, mereka yang berperang atau berjuang dan yang terbunuh dalam perjuangan membela agamaku pasti akan aku hapus atau ampuni kesalahan mereka dan pasti aku masukkan mereka ke dalam surga-surga yang mengalir di bawahnya sungaisungai. Ampunan serta kenikmatan-kenikmatan yang mereka peroleh adalah sebagai pahala atau imbalan dari Allah yang maha pemurah. Dan di sisi Allah ada pahala yang baik yang menyenangkan serta anugerah yang teragung."
  }
]