[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka Allah mengabulkan doa-doa mereka dan bahwasanya Dia tidak menyia-nyiakan usaha orang yang mengerjakan amal shalih dari mereka,baik lelaki maupun perempuan. Dan mereka dalam hubungan persaudaraan agama dan diterimanya amal serta pembalasannya setara. Maka orang-orang yang berhijrah karena mengharapkan keridhaan Allah , dan di usir dari kampung halaman mereka, serta menghadapi gangguan dalam taat kepada tuhan mereka dan beribadah kepadaNYA, dan berperang serta terbunuh di jalanNYA demi meninggikan kalimatNYA, pastilah Allah akan menutupi bagi mereka apa yang telah mereka pernuat dari maksiat-maksiat,sebagaimana DIA telah menutupinya atas mereka di dunia. Maka Dia tidak mengadakan perhitugan dengan mereka atasnya, dan DIA benar-benar akan memasukkan mereka ke dalam surga-surga yang mengalir di bawah istana-istana dan pepohonannya sungai-sungai sebagai balasan pahala dari sisi Allah. Dan Allah pada sisiNYA terdapat balasan pahala yang baik."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "195. Kemudian Rabb mereka menjawab doa mereka dengan mengatakan, “Sesungguhnya Aku tidak akan menyia-nyiakan pahala amal perbuatan kalian, sedikit atau banyak. Baik dilakukan oleh laki-laki maupun wanita. Karena hukum untuk kalian dalam agama adalah satu (berlaku untuk semua). Sehingga pahala laki-laki tidak akan ditambah dan pahala wanita tidak akan dikurangi. Maka orang-orang yang berhijrah di jalan Allah, diusir dari rumahnya oleh orang-orang kafir, merasakan penderitaan dalam rangka mempertahankan ketaatannya kepada Rabb, serta berperang di jalan Allah dan terbunuh dalam rangka menjunjung tinggi kalimah Allah, sungguh Aku benar-benar akan mengampuni keburukan-keburukannya kelak di hari Kiamat. Aku akan memaafkan kesalahan-kesalahan mereka dan memasukkan mereka ke dalam surga-surga yang di bawah istana-istananya mengalir sungai-sungai, sebagai balasan dari Allah. Dan Allah memiliki balasan terbaik yang tiada banding.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "195. Kemudian Allah mengabulkan doa orang-orang yang berdoa tersebut: “Aku tidak akan menyia-nyiakan usaha orang yang beramal shalih, baik itu dia seorang laki-laki maupun perempuan, sebab laki-laki dari seorang perempuan dan perempuan dari seorang laki-laki, mereka semua bersaudara, saling tolong menolong. Adapun orang-orang yang berhijrah meninggalkan negerinya dan diusir orang-orang kafir dari rumahnya, mendapatkan gangguan dari mereka karena berjuang di jalan-Ku, memerangi musuh-musuh-Ku dan terbunuh di jalan-Ku akan Aku hapus dosa-dosa mereka dan akan Aku masukkan mereka ke surga-surga yang di bawah pepohonannya mengalir sungai-sungai yang tawar airnya, ini merupakan balasan yang mulia dari karunia Allah. Hanya Allah yang memiliki sebaik-baik balasan berupa surga."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "195. فَاسْتَجَابَ لَهُمْ (Maka Tuhan mereka memperkenankan permohonannya) Yakni doa mereka dikabulkan sebagaimana yang dijanjikan. أَنِّى لَآ أُضِيعُ عَمَلَ عٰمِلٍ مِّنكُم (Sesungguhnya Aku tidak menyia-nyiakan amal orang-orang yang beramal di antara kamu) Yakni dengan tidak memberi pahala. مِّن ذَكَرٍ أَوْ أُنثَىٰ ۖ (baik laki-laki atau perempuan) Allah menyebutkan para wanita untuk membungahkan hati mereka. Karena seandainya tanpa disebutkan pun mereka akan masuk dalam cakupan kalimat orang-orang yang beriman dan beramal shaleh. dan bagian dari maksud ayat ini adalah sebagai penyemangat bagi para wanita agar ikut dalam berdakwah dan apa yang mungkin menjadi konsekuensinya seperti berhijrah dan berjihad. بَعْضُكُم مِّنۢ بَعْضٍ ۖ (sebagian kamu adalah turunan dari sebagian yang lain) Yakni laki-laki dari kalian sebagaimana perempuan dari kalian dalam ketaatan, begitu pula perempuan dari kalian sebagaimana laki-laki dari kalian dalam hal tersebut, karena keduanya berasal dari satu keturunan, keduanya berasal dari keturunan Adam dan Hawa, dan kedua jenis itu sama-sama mempunyai tanggungan untuk beribadah. فَالَّذِينَ هَاجَرُوا۟ (Maka orang-orang yang berhijrah) Dari jenis laki-laki dan perempuan berhijrah dari negeri mereka menuju Rasulullah. وَأُخْرِجُوا۟ مِن دِيٰرِهِمْ (yang diusir dari kampung halamannya) Disebabkan ketaatannya kepada Allah. وَأُوذُوا۟ فِى سَبِيلِى (yang disakiti pada jalan-Ku) Yakni siksaan yang mereka dapatkan dari kaum musyrik disebabkan keimanan meraka kepada Allah untuk mengeluarkan mereka dari agama mereka, namun hal tersebut tidak menambah mereka kecuali keteguhan diatas agama mereka. Ayat ini juga mencakup setiap orang yang mendapat siksaan karena keteguhannya dalam berpegang dengan agama Allah. وَقٰتَلُوا۟ (yang berperang) Yakni melawan musuh-musuh Allah. وَقُتِلُوا۟(dan yang dibunuh) Yakni sebagian mereka yang dibunuh di jalan Allah. لَأُكَفِّرَنَّ عَنْهُمْ سَيِّـَٔاتِهِمْ (pastilah akan Ku-hapuskan kesalahan-kesalahan mereka) Karena berhijrah di jalan Allah menghapus dosa-dosa yang telah lalu. Begitu juga berjihad di jalan Allah dan mati syahid di jalan-Nya menghapus segala dosa, sebagaimana disebutkan dalam hadist, kecuali hutang. وَاللهُ عِندَهُۥ حُسْنُ الثَّوَابِ (Dan Allah pada sisi-Nya pahala yang baik) Yakni pahala yang baik. Dan yang dimaksud dengan pahala adalah balasan yang kembali kepada pelaku atas apa yang dilakukannya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Ayat ini datang setelah mereka (orang-orang beriman) memohon kepada tuhan mereka sebanyak lima permohonan yang agung, Hasan berkata : “mereka terus berkata wahai Tuhan kami.. wahai Tuhan kami; sampai akhirnya permohonan mereka diperkenankan” , maka alangkah meruginya orang-orang yang melalaikan doa, begitupun dengan mereka kerap mengharap doa mereka dikabulkan secepatnya?! Dan sungguh mereka yang senantiasa isitiqomah berdoa memohon kepada Allah telah menggapai keuntungan dan kemenangan yang besar. 2 ). Perhatikan ayat ini : { فَالَّذِينَ هَاجَرُوا وَأُخْرِجُوا مِنْ دِيَارِهِمْ وَأُوذُوا فِي سَبِيلِي وَقَاتَلُوا وَقُتِلُوا لَأُكَفِّرَنَّ عَنْهُمْ سَيِّئَاتِهِمْ } Allahu akbar! Semua amalan ini adalah amalan yang agung : hijrah, penggusuran dari kampung halaman, jihad, dan mengikuti peperangan, kemudian Allah memberi kabar kembira kepada mereka : { أُكَفِّرَنَّ عَنْهُمْ سَيِّئَاتِهِمْ } “pastilah akan Ku-hapuskan kesalahan-kesalahan mereka” , tetapi betapa banyaknya orang-orang pada zaman ini secara terpaksa menarik diri mereka untuk mendirikan shalat fardhu, lalu ia menganggap telah mencapai derajat orang-orang sodhiq!. 3 ). { ثَوَابًا مِنْ عِنْدِ اللَّ } “sebagai pahala di sisi Alla” Allah menisbatkan pahala kepada diri-Nya adalah sebagai isyarat akan keagungan-Nya; karena sesungguhnya sang Maha agung dan Maha bijaksana tidak akan memberi kecuali pemberian yang berlimpah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "195. Lalu Allah memperkenankan doa mereka, sesungguhnya Aku pasti akan memberi pahala orang-orang yang beramal, baik laki-laki maupun perempuan, yaitu dua jenis yang sama dan tidak ada yang saling unggul antara keduanya dalam pahala ketaatan dan hukuman atas kemaksiatannya. Dan keduanya tidak berbeda kecuali dalam amal shalihnya. Maka orang-orang yang berhijrah dari negeri mereka untuk menolong agama mereka, dan mereka itu diusir oleh orang-orang kafir dan musyrik dari tanah air mereka, serta mau bersusah payah di jalan Allah karena keimanan mereka kepadaNya agar Dia meneguhkan mereka atas agama mereka, dan mereka melaan musuh untuk meninggikan kalimat Allah. Lalu mereka terbunuh dan mati syahid di jalanNya, maka sungguh Aku akan menghapus dosa-dosa dan kesalahan mereka dengan memberi ampunan. Dan sungguh Aku akan memasukkan mereka ke dalam surga yang di dalamnya mengalir sungai-sungai dari bawah pepohonan dan bilik-biliknya, sebagai balasan Tuhan atas amal baik mereka. Dan di sisi Allah itu balasan baik (bagi mereka) yang itu sesuatu yang dikembalikan kepada orang yang beramal. Ummu Salamah berkata: “Wahai rasulallah, aku tidak mendengarkan sedikitpun Allah menyebut wanita dalam hijrah” Lalu Allah menurunkan ayat {Fastajaaba lahum}"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lalu Tuhan mereka memperkenankan permohonan mereka, “Sesungguhnya Aku tidak menyia-nyiakan perbuatan orang yang beramal di antara kalian, baik laki-laki maupun perempuan, sebagian kalian adalah dari sebagian yang lain} ketetapan bagi kalian semua dalam perkaara pahala itu satu (sama) {Lalu orang-orang yang berhijrah, diusir dari kampung halaman mereka, disakiti di jalanKu} di agamaKu {berperang, dan terbunuh, pasti akan Aku hapus} pasti akan Aku hapus {kesalahan mereka dan sungguh akan Aku masukkan mereka ke dalam surga-surga yang mengalir di bawahnya sungai-sungai sebagai pahala dari sisi Allah. Di sisi Allahlah pahala yang baik.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "195. Maksudnya Allah memenuhi doa mereka berupa doa ibadah maupun doa permohonan seraya berfirman, ”sesungguhnya Aku tidak menyia-nyiakan amalorang-orang yang beramal dari kalian, baik laki-laki maupun perempuan. ”Semua orang akan menerima amal perbuatanya masing-masing secara penuh dan sempurna. Artinya, setiap kalian menurut batasan yang sama dalam pahala maupun siksa, ”maka orang-orang yang berhijrah, yang diusir dari kampung halamanya, yang disakiti pada jalanku, yang berperang dan yang di bunuh, ” mereka menyatukan antara keimanan, hijrah, dan meninggalkan hal-hal yang dicintai berupa negeri dan harta demi untuk mencari keridhoan mereka dan mereka berjihad di jalan Allah, ”pastilah Aku akan hapuskan kesalahan-kesalahan mereka, dan pastilah aku akan memasukan mereka ke dalam syurga yang mengalir di bawahnya sungai-sungai, sebagai pahala di sisi Allah, ”Yang memberikan kepada hambaNya pahala yang melimpah untuk perbuatan yang sedikit. “Dan Allah pada sisinya pahala yang baik dari hal-hal yang tidak terlihat oleh mata, dan tidak pernah didengar oleh telinga dan tidak pernah terlintas dalam benak manusia pun. Dan barangsiapa mengharapkan hal itu, maka mohonlah kepada Allah dengan cara taat kepadaNya, dan mendekatkan diri kapadanya menurut kemampuan hamba."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 195: 194-195. \"Hai Tuhan kami! berilah kepada kami apa yang Engkau telah janjikan kepada kami dengan perantaraan rasul-rasul-Mu, dan janganlah Engkau hinakan kami di hari Kiamat, karena sesungguhnya Engkau tidak akan memungkiri perjanjian. Maka Tuhan mereka telah perkenankan \"Bahwasanya Aku tidak akan siakan-siakan 'amalan orang yang beramal di antara Kami dari laki-laki atau, perempuan (karena) sebagian daripada kamu, (jadi) dari sebagian, Tetapi orang-orang yang berhijrah dari negeri-negerinya, dan disakiti dan dikeluarkan di jalan Ku, dan berperang, dan terbunuh itu, sesungguhnya Aku akan hilangkan kesalahan-kesalahan mereka dan sesungguhnya Aku akan masukkan mereka di surga-surga yang mengalir padanya sungai-sungai, sebagai ganjaran dari Allah, karena Allah itu, di sisiNya ada ganjaran yang baik."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni semuanya akan mendapatkan pahala secara sempurna. Maksudnya sebagaimana laki-laki berasal dari laki-laki dan perempuan, maka demikian pula halnya perempuan berasal dari laki-laki dan perempuan. Kedua-duanya sama-sama manusia, tidak ada kelebihan yang satu dari yang lain tentang penilaian iman dan amalnya. Mereka beriman, berhijrah, meninggalkan segala yang mereka cintai seperti tempat tinggal dan harta demi mencari ridha Allah serta berjihad di jalan-Nya. Yang memberikan balasan yang banyak terdapat amal yang sedikit. Berupa surga yang belum pernah dilihat oleh mata, belum pernah didengar oleh telinga dan belum pernah terlintas di hati manusia. Oleh karena itu, barang siapa yang menginginkannya, maka mintalah kepada Allah dengan mentaati-Nya dan mendekatkan diri kepada-Nya semampunya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 195",
    "description": "Setelah mereka (ulul albab) memanjatkan pujian dan doa kepada Allah dengan tulus dan penuh harapan, maka tuhan mereka memperkenankan permohonannya dan mewujudkan harapannya dengan berfirman, sesungguhnya aku tidak menyia-nyiakan amal perbuatan atau usaha orang yang beramal serta pahala orang-orang yang berbuat kebajikan di antara kamu, baik laki-laki maupun perempuan. Keduanya memperoleh imbalan yang sama; tidak ada perbedaan antara keduanya, karena sebagian kamu adalah keturunan dari sebagian yang lain, sehingga kalian adalah bersaudara. Karenanya tidak ada kelebihan yang satu dari yang lain tentang penilaian iman dan amalnya di sisi Allah (lihat surah an-nahl/16: 97). Maka orang yang berhijrah meninggalkan negeri, keluarga, dan harta kekayaan mereka, yang karena mempertahankan keimanannya mereka diusir dari kampung halamannya, dan mereka yang disakiti lantaran berjuang pada jalan-ku, mereka yang berperang atau berjuang dan yang terbunuh dalam perjuangan membela agamaku pasti akan aku hapus atau ampuni kesalahan mereka dan pasti aku masukkan mereka ke dalam surga-surga yang mengalir di bawahnya sungaisungai. Ampunan serta kenikmatan-kenikmatan yang mereka peroleh adalah sebagai pahala atau imbalan dari Allah yang maha pemurah. Dan di sisi Allah ada pahala yang baik yang menyenangkan serta anugerah yang teragung. Jangan sekali-kali kamu, wahai rasul, teperdaya atau tertipu oleh kegiatan orang-orang kafir yang bergerak dengan bebas kesana kemari di seluruh negeri dengan mengiming-imingi pangkat, harta, dan kenikmatan-kenikmatan sementara yang cepat sirna."
  }
]