[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Janganlah kamu (wahai rasul) tertipu dengan apa yang terjadi kepada orang-orang yang kafir kepada Allah, dimana mereka mendapatkan kenyamanan dalam hidup dan keluasan dalam rizki, seta perpindahan mereka dari satu tempat ke tempat lain untuk berbagai macam perniagaan, mencari keuntungan dan kekayaan, karena sebentar lagi semua itu akan lenyap dari mereka. Dan kelak mereka akan tergadai oleh perbuatan-perbuatan buruk mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "196. Jangan sekali-kali kamu -wahai Nabi- merasa risau dan sedih dengan pergerakan orang-orang kafir di negeri-negeri itu, penguasaan mereka atas negeri-negeri itu, kemajuan bisnis mereka dan luasnya rezeki mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "196-197. Janganlah kamu tertipu oleh orang-orang kafir yang bersenang-senang dengan kenikmatan dunia dan kebebasan mereka menjelajahi negeri; sebab mereka akan menikmati itu sebentar saja, dan dunia akan sirna dari mereka, kemudian mereka akan menuju neraka Jahannam. Dan seburuk-buruk tempat adalah neraka Jahannam."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "196. لَا يَغُرَّنَّكَ تَقَلُّبُ الَّذِينَ كَفَرُوا۟ فِى الْبِلٰدِ (Janganlah sekali-kali kamu terperdaya oleh kebebasan orang-orang kafir bergerak di dalam negeri) Dengan melakukan perjalanan untuk berdagang untuk memperlapang kehidupan mereka, karena itu merupakan kenikmatan yang sedikit yang mereka nikmati di dunia ini dan kemudian tempat kembali mereka adalah neraka Jahannam. Ikrimah berkata: yang dimaksud adalah pergerakan mereka di siang dan malam hari dan segala kenikmatan yang berlaku bagi mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "196-197 1 ). Dalam al-qur’an Allah menjelaskan keadaan orang-orang kafir ketika di dunia : { لَا يَغُرَّنَّكَ تَقَلُّبُ الَّذِينَ كَفَرُوا فِي الْبِلَادِ , مَتَاعٌ قَلِيلٌ } “Janganlah sekali-kali kamu terperdaya oleh kebebasan orang-orang kafir bergerak di dalam negeri , Itu hanyalah kesenangan sementar” Dan tempat kembali mereka di akhirat adalah : { مَّ مَأْوَاهُمْ جَهَنَّمُ ۚ وَبِئْسَ الْمِهَادُ } “kemudian tempat kembali mereka pada hari kiamat menuju neraka. Dan itu adalah seburuk-buruk tempat yang ditinggal” kemudian setelahnya Allah menyebutkan keadaan yang berbeda bagi orang beriman : { لَٰكِنِ الَّذِينَ اتَّقَوْا رَبَّهُمْ لَهُمْ جَنَّاتٌ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا نُزُلًا مِنْ عِنْدِ اللَّهِ ۗ وَمَا عِنْدَ اللَّهِ خَيْرٌ لِلْأَبْرَارِ } “Akan tetapi orang-orang yang bertakwa kepada Tuhannya, bagi mereka surga yang mengalir sungai-sungai di dalamnya, sedang mereka kekal di dalamnya sebagai tempat tinggal (anugerah) dari sisi Allah. Dan apa yang di sisi Allah adalah lebih baik bagi orang-orang yang berbakti” agar kamu memilih jalan yang baik dari keduanya. 2 ). Jika kamu melihat tipuan ekonomi orang-orang kafir yang lalu dan kepanikan mereka atas krisis yang mereka hadapi saat ini ingatlah firman Allah : { لَا يَغُرَّنَّكَ تَقَلُّبُ الَّذِينَ كَفَرُوا فِي الْبِلَادِ , مَتَاعٌ قَلِيلٌ } “Janganlah sekali-kali kamu terperdaya oleh kebebasan orang-orang kafir bergerak di dalam negeri , Itu hanyalah kesenangan sementar” . As-Sa’di mengatakan : Maksud dari ayat ini adalah sebagai hiburan tentang apa yang dicapai oleh orang-orang kafir dari kenikmatan dunia ini, dan keasyikan mereka di dalamnya, juga kesenangan mereka ketika berkunjung ke berbagai negara untuk urusan bisnis, sesungguhnya semua itu hanyalah sedikit. Sungguh tidak akada balasan bagi mereka dan kekayaan mereka tidak akan bertahal lama, mereka menikmati kekayaan yang amat sangat sedikit itu, akan tetapi mereka akan mendapat siksaan yang jauh lebih panjang masanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "196-197. Wahai Nabi, jangan sampai kamu terperdaya atas perpindahan orang-orang kafir dalam bepergian untuk berdagang dan berusaha. Dan keuntungan yang mereka terima itu hanyalah sedikit kenikmatan yang murah yang dinikmati di dunia, lalu tempat kembali mereka adalah ke dalam neraka Jahanam. Sungguh amat buruk tempat yang mereka datangi. Ayat ini turun untuk orang-orang musyrik Mekah. Mereka berada dalam kesejahteraan dan kenyamanan hidup. Mereka berdagang dan bersenang. Lalu sebagian orang-orang mukmin berkata: “Yang kita lihat, musuh-musuh Allah itu berada dalam kebaikan, sedangkan kita binasa dalam kehausan dan kepayahan” Lalu turunlah ayat ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jangan sampai menipumu} jangan sampai menipumu {perubahan} perubahan dan perpindahan {perjalanan orang-orang yang kafir di seluruh negeri"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "196. Maksudnya ayat ini adalah hiburan bagi Nabi Muhammad tentang apa yang di rasakan oleh orang-orang kafir berupa perhiasan dunia dan kenikmatan di dalamnya, pulang perginya mereka diseluruh negri dengan berbagai perdagangan, mata pencaharian, kesenangan, berbagai macam kemenangan dan kemuliaan pada sebagian kesempatan. sesungguhnya ini semua,"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 196: Janganlah engkau ditipu oleh kebebasan mereka yang kafir di negeri-negeri (-nya)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dalam tafsir Al Jalaalain disebutkan, bahwa ayat ini turun ketika kaum muslimin mengatakan, \"Musuh-musuh Allah sepengetahuan kami berada dalam kenikmatan, sedangkan kami berada dalam kesulitan.\" Maksud ayat ini adalah menghibur kaum mukmin agar tidak terpedaya oleh kesenangan dunia yang diperoleh orang-orang kafir dan bebasnya mereka bergerak di seluruh negeri melakukan berbagai perdagangan, lancarnya usaha mereka, dapat bersenang-senang dan menikmati berbagai kesenangan. Semua ini sebagaimana disebutkan pada ayat selanjutnya adalah kesenangan sementara, mereka hanya menikmati sebentar dan akan dilanjutkan dengan azab yang lama."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 196",
    "description": "Jangan sekali-kali kamu, wahai rasul, teperdaya atau tertipu oleh kegiatan orang-orang kafir yang bergerak dengan bebas kesana kemari di seluruh negeri dengan mengiming-imingi pangkat, harta, dan kenikmatan-kenikmatan sementara yang cepat sirnasemua yang ditawarkan orang-orang kafir berupa pangkat, harta benda, dan kemewahan itu hanyalah kesenangan sementara yang tidak bernilai jika dibanding dengan pahala Allah di surga kelak yang penuh kenikmatan dan abadi. Kemudian Allah menetapkan bagi orang-orang kafir tersebut tempat kembali mereka setelah mati, ialah neraka jahanam agar mereka merasakan azab Allah. Neraka jahanam itu adalah seburuk buruk tempat tinggal bagi orang-orang kafir dan mereka yang melakukan perbuatan keji selama di dunia."
  }
]