[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Itu hanyalah kesenangan yang sedikit lagi akan sirna, kemudian tempat kembali mereka pada hari kiamat menuju neraka. Dan itu adalah seburuk-buruk tempat yang ditinggali."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "197. Karena dunia ini adalah kesenangan yang sedikit dan tidak kekal. Setelah itu nasib mereka di اari Kiamat kelak akan berakhir di neraka Jahanam. Dan seburuk-buruk tempat tinggal mereka adalah api neraka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "197. مَتٰعٌ قَلِيلٌ (Itu hanyalah kesenangan sementara) Yakni itu semua tidak ada bandingannya dengan pahala dari Allah. ثُمَّ مَأْوَىٰهُمْ جَهَنَّمُ ۚ (kemudian tempat tinggal mereka ialah Jahannam) Yakni apa yang mereka jadikan sebagai tempat tinggal. وَبِئْسَ الْمِهَادُ(tempat yang seburuk-buruknya) Yakni apa yang mereka persiapkan untuk diri mereka di Jahannam karena kekafiran mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Dalam al-qur’an Allah menjelaskan keadaan orang-orang kafir ketika di dunia : { لَا يَغُرَّنَّكَ تَقَلُّبُ الَّذِينَ كَفَرُوا فِي الْبِلَادِ , مَتَاعٌ قَلِيلٌ } “Janganlah sekali-kali kamu terperdaya oleh kebebasan orang-orang kafir bergerak di dalam negeri , Itu hanyalah kesenangan sementar” dan tempat kembali mereka di akhirat adalah : { مَّ مَأْوَاهُمْ جَهَنَّمُ ۚ وَبِئْسَ الْمِهَادُ } “kemudian tempat kembali mereka pada hari kiamat menuju neraka. Dan itu adalah seburuk-buruk tempat yang ditinggal” kemudian setelahnya Allah menyebutkan keadaan yang berbeda bagi orang beriman : { لَٰكِنِ الَّذِينَ اتَّقَوْا رَبَّهُمْ لَهُمْ جَنَّاتٌ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا نُزُلًا مِنْ عِنْدِ اللَّهِ ۗ وَمَا عِنْدَ اللَّهِ خَيْرٌ لِلْأَبْرَارِ } “Akan tetapi orang-orang yang bertakwa kepada Tuhannya, bagi mereka surga yang mengalir sungai-sungai di dalamnya, sedang mereka kekal di dalamnya sebagai tempat tinggal (anugerah) dari sisi Allah. Dan apa yang di sisi Allah adalah lebih baik bagi orang-orang yang berbakti” agar kamu memilih jalan yang baik dari keduanya. 2 ). Jika kamu melihat tipuan ekonomi orang-orang kafir yang lalu dan kepanikan mereka atas krisis yang mereka hadapi saat ini ingatlah firman Allah : { لَا يَغُرَّنَّكَ تَقَلُّبُ الَّذِينَ كَفَرُوا فِي الْبِلَادِ , مَتَاعٌ قَلِيلٌ } “Janganlah sekali-kali kamu terperdaya oleh kebebasan orang-orang kafir bergerak di dalam negeri , Itu hanyalah kesenangan sementar” . As-Sa’di mengatakan : Maksud dari ayat ini adalah sebagai hiburan tentang apa yang dicapai oleh orang-orang kafir dari kenikmatan dunia ini, dan keasyikan mereka di dalamnya, juga kesenangan mereka ketika berkunjung ke berbagai negara untuk urusan bisnis, sesungguhnya semua itu hanyalah sedikit. Sungguh tidak akada balasan bagi mereka dan kekayaan mereka tidak akan bertahal lama, mereka menikmati kekayaan yang amat sangat sedikit itu, akan tetapi mereka akan mendapat siksaan yang jauh lebih panjang masanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "196-197. Wahai Nabi, jangan sampai kamu terperdaya atas perpindahan orang-orang kafir dalam bepergian untuk berdagang dan berusaha. Dan keuntungan yang mereka terima itu hanyalah sedikit kenikmatan yang murah yang dinikmati di dunia, lalu tempat kembali mereka adalah ke dalam neraka Jahanam. Sungguh amat buruk tempat yang mereka datangi. Ayat ini turun untuk orang-orang musyrik Mekah. Mereka berada dalam kesejahteraan dan kenyamanan hidup. Mereka berdagang dan bersenang. Lalu sebagian orang-orang mukmin berkata: “Yang kita lihat, musuh-musuh Allah itu berada dalam kebaikan, sedangkan kita binasa dalam kehausan dan kepayahan” Lalu turunlah ayat ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "(Itu) kesenangan sementara, kemudian tempat kembali mereka} tempat kembali mereka {ialah neraka Jahanam. Itulah seburuk-buruk tempat tinggal} tempat peristirahatan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "197. “hanyalah kesenangan sementara, ”yang tidak akan tetap dan tidak akan kekal. akan tetapi mereka menikmatanya sebantar dan akan disiksa karenanya selamanya. Ini merupakan kondisi kanikmatan yang paling tinggi bagi orang-orang kafir, dan sungguh kamu telah melihat kondisi apa yang akan kembali kapadanya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 197: (Yaitu) kesenangan yang sedikit, kemudian, tempat kembali mereka itu jahannam, dan alangkah jelek tempat ketetapan (itu)!"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 197",
    "description": "Semua yang ditawarkan orang-orang kafir berupa pangkat, harta benda, dan kemewahan itu hanyalah kesenangan sementara yang tidak bernilai jika dibanding dengan pahala Allah di surga kelak yang penuh kenikmatan dan abadi. Kemudian Allah menetapkan bagi orang-orang kafir tersebut tempat kembali mereka setelah mati, ialah neraka jahanam agar mereka merasakan azab Allah. Neraka jahanam itu adalah seburuk buruk tempat tinggal bagi orang-orang kafir dan mereka yang melakukan perbuatan keji selama di duniasetelah menjelaskan imbalan bagi orang-orang kafir, berikutnya Allah menjelaskan imbalan yang diberikan kepada orang-orang yang bertakwa. Tetapi orang-orang yang bertakwa kepada tuhannya dengan melakukan amal perbuatan yang disukai-Nya dan meninggalkan yang dibenci-Nya, niscaya mereka akan mendapat tempat tinggal yang nyaman dan penuh kenikmatan, yaitu surga-surga yang mengalir di bawahnya sungai-sungai yang begitu jernih, indah, dan sedap dipandang mata. Keindahan dan kenikmatan surga tersebut belum pernah mereka lihat dan belum pernah mereka rasakan sebelumnya. Mereka kekal di dalamnya dan mereka tidak merasa takut atau khawatir, karena hati mereka selalu diliputi kegembiraan. Itu semua adalah sebagai karunia dari Allah yang disediakan untuk mereka. Dan apa yang di sisi Allah berupa pahala dan anugerah yang abadi adalah lebih baik bagi orang-orang yang berbakti daripada kekayaan, kebanggaan diri, dan ke."
  }
]