[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Akan tetapi,orang-orang yang takut kepada tuhan mereka, dan melaksanakan perintah-perintahNya dan menjauhi larangan-laranganNYA, sungguh Allah telah menyediakan bagi mereka surga-surga yang mengalir di bawah istana-istananya dan pohon-pohonnya sungai-sungai. Itulah tempat tinggal mereka yang abadi,mereka tidak keluar darinya. Dan apa yang ada di sisi Allah itu lebih agung dan lebih utama bagi orang-orang yang taat daripada apa yang kaum kafir bergelimang hidup dengannya dari nikmat dunia."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "198. Akan tetapi orang-orang yang bertakwa kepada Rabb mereka dengan menjalankan perintah-perintah-Nya dan menjauhi larangan-larangan-Nya, mereka akan mendapatkan surga-surga yang di bawah istana-istananya mengalir sungai-sungai. Mereka akan tinggal di dalamnya untuk selama-lamanya. Itu adalah balasan yang disiapkan untuk mereka dari Allah -Ta'ālā-. Dan apa yang Allah siapkan untuk hamba-hamba-Nya yang saleh itu lebih baik dan lebih utama dibanding kesenangan duniawi yang dinikmati oleh orang-orang kafir."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "198. itulah balasan bagi orang-orang kafir. Adapun orang-orang yang bertakwa kepada Allah dengan mentaati-Nya maka balasan bagi mereka adalah surga-surga yang di bawah pepohonannya mengalir sungai-sungai yang tawar airnya, mereka akan kekal di dalamnya dan dimuliakan dengan karunia dari Allah. Dan balasan bagi orang-orang yang taat lebih baik dan lebih mulia dari apa yang dinikmati orang-orang kafir di dunia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "198. لٰكِنِ الَّذِينَ اتَّقَوْا۟ رَبَّهُمْ (Akan tetapi orang-orang yang bertakwa kepada Tuhannya) Yakni bagi mereka -ditambah apa yang mereka dapatkan dari manfaat abadi- نُزُلًا (tempat tinggal) Makna (النزل) adalah apa yang disiapkan bagi tamu atau tempat tinggal sebagai tempat berlindung didalamnya. Dan ini sebagai bandingan Jahannam tempat orang kafir. وَمَا عِندَ اللهِ (Dan apa yang di sisi Allah) Berupa apa yang disiapkan Allah bagi orang yang mentaati-Nya. خَيْرٌ لِّلْأَبْرَارِ (lebih baik bagi orang-orang yang berbakti) Daripada apa yang didapatkan orang-orang kafir dari keuntungan yang mereka dapatkan dari perjalanan yang mereka lakukan dalam negeri."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "198. Inilah keadaan orang-orang kafir. Adapun keadan orang-orang mukmin yang bertakwa dengan mengerjakan perintah dan menjauhi larangan, maka bagi mereka itu surga yang penuh kenikmatan dengan penggambaran yang sebelumnya. Mereka itu tinggal di dalamnya selamanya, dimuliakan dan diberi tempat yang baik di sisi Allah. Dan pahala, karunia, dan keridhaan di sisi Allah itu lebih baik bagi orang-orang yang baik, lagi taat daripada apa yang didapatkan orang-orang kafir di dunia berupa keuntungan dan kesejahteraan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Akan tetapi orang-orang yang bertakwa kepada Tuhannya, bagi mereka itu surga-surga yang mengalir di bawahnya sungai-sungai dan mereka kekal di dalamnya sebagai karunia} sebagai balasan yang dijanjikan {dari sisi Allah. Apa yang di sisi Allah itu lebih baik bagi orang-orang yang selalu berbuat baik"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "198. Adapun orang-orang yang bertakwa kepada Rabb mereka yang beriman kepadanya disamping apa yang mereka peroleh berupa kenikmatan dunia dan kenikmatanya, “mereka mendapatkan syurga yang mengalir sungai-sungai di bawahnya, sedang mereka kekal di dalamnya. ” Sekiranya mereka di tetapkan di dunia mendapatkan segala macam kesulitan, kesempitan, dan segala macam kesusahan, niscaya bila hal itu (bila) dinisbatkan kepada kenikmatan yang abadi, kehidupan yang selamat, kebahagiaan, kesenangan, dan kegembiraan adalah suatu remeh kecil dan karunia dalam bentuk ujian. karena itu Allah berfirman, ”Dan apa yang di sisi Allah adalah lebih baik bagi orang-orang yang berbakti, ” mereka itu adalah orang-orang yang hatinya baik hingga lisan dan perbuatan mereka pun baik, sehingga Allah yang Maha Baik Lagi Maha Penyayang memberikan balasan yang baik bagi mereka dengan kebaikaNya sebagai pahala yang besar dan pemberian yang agung, serta kemenangan yang abadi."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 198: Tetapi mereka yang berbakti kepada Tuhan mereka, adalah bagi mereka surga yang padanya mengalir sungai-sungai, hal keadaan mereka kekal padanya, satu pemberian dari sisi Allah, karena sesuatu yang di sisi Allah itu lebih baik buat mereka yang berbakti."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni tempat tinggal beserta perlengkapan-perlengkapannya seperti makanan, minuman dan lain-lain. Kalau pun orang-orang mukmin di dunia ini ditaqdirkan mengalami kesengsaraan, kesusahan dan kesulitan, namun jika dibandingkan dengan kenikmatan surga yang kekal, maka kesusahan itu sangat ringan sekali. Dunia memang menjadi surga bagi orang kafir, namun surga mereka (dunia ini) adalah surga yang sementara, terbatas dan tidak sempurna. Di dunia ada hidup dan ada mati, ada senang dan ada sedih, ada masa muda dan ada masa tua, ada sehat dan ada sakit serta keterbatasan lainnya. Maksudnya ialah penghargaan dari Allah disamping tempat tinggal beserta perlengkapan-perlengkapannya itu, adalah lebih baik daripada kesenangan duniawi yang dinikmati orang-orang kafir itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 198",
    "description": "Setelah menjelaskan imbalan bagi orang-orang kafir, berikutnya Allah menjelaskan imbalan yang diberikan kepada orang-orang yang bertakwa. Tetapi orang-orang yang bertakwa kepada tuhannya dengan melakukan amal perbuatan yang disukai-Nya dan meninggalkan yang dibenci-Nya, niscaya mereka akan mendapat tempat tinggal yang nyaman dan penuh kenikmatan, yaitu surga-surga yang mengalir di bawahnya sungai-sungai yang begitu jernih, indah, dan sedap dipandang mata. Keindahan dan kenikmatan surga tersebut belum pernah mereka lihat dan belum pernah mereka rasakan sebelumnya. Mereka kekal di dalamnya dan mereka tidak merasa takut atau khawatir, karena hati mereka selalu diliputi kegembiraan. Itu semua adalah sebagai karunia dari Allah yang disediakan untuk mereka. Dan apa yang di sisi Allah berupa pahala dan anugerah yang abadi adalah lebih baik bagi orang-orang yang berbakti daripada kekayaan, kebanggaan diri, dan ke setelah menjelaskan w yang diberikan Allah kepada orang-orang mukmin, kemudian Allah menjelaskan golongan mukmin lain-Nya yang mendapat imbalan yang sama. Dan sesungguhnya di antara ahli kitab dari golongan yahudi dan nasrani ada kelompok orang-orang yang beriman kepada Allah dengan tulus, dan beriman kepada apa yang diturunkan kepada kamu yaitu kitab suci Al-Qur'an dan beriman kepada apa yang diturunkan kepada mereka, yaitu kitab taurat dan injil. Mereka menghimpun antara keimanan kepada nabi-nabi mereka sendiri dan keimanan kepada nabi Muhammad serta ajaran-ajaran yang dibawa para nabi dalam keadaan berendah hati kepada Allah dengan tunduk dan patuh mengamalkan syariat-Nya, dan mereka tidak memperjualbelikan ayat-ayat Allah dengan harga murah, demi meraih kekayaan materi dan kemewahan, serta kedudukan yang sifatnya sementara. Mereka yang tunduk dan patuh mengamalkan syariat-Nya kelak akan memperoleh pahala di sisi tuhannya sebagai imbalan atas amal perbuatan yang telah mereka lakukan dengan tulus di dunia. Sungguh, Allah sangat cepat perhitungan-Nya, mampu menghitung jumlah yang banyak dalam waktu singkat."
  }
]