[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sesungguhnya sebagian dari ahli kitab benar-benar ada yang meyakini Allah sebagai tuhan yang maha Esa lagi sembahan yang berhak diibadahi dan juga mengimani apa yang diturunkan kepada kalian berupa al-qur’an, dan apa yang diturunkan kepada mereka berupa serta taurat dan injil,dengan penuh kerendahan diri kepada Allah dan ketundukan kepadaNYA.Mereka tidak menjual ayat-ayat Allah dengan secuil harga dari kekayaan dunia yang semu dan tidak menyembunyikan apa yang diturunkan oleh Allah dan tidak mengubah-ubahnya,layaknya para penganut ahli kitab selain mereka. Mereka itu memperoleh pahala besar disisiNYA pada hari berjumpa denganNYA. Lalu DIA memberikan balasan itu kepada mereka dengan sempurna tanpa ada kekurangan.Sesungguhnya Allah sangat cepat perhitunganNYA. tidaklah menyulitkanNYA Perhitungan amal perbuatan mereka dan proses hisabnya"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "199. Orang-orang ahli Kitab itu tidaklah sama. Karena di antara mereka ada golongan yang beriman kepada Allah dan beriman kepada kebenaran dan petunjuk yang diturunkan kepada kalian, serta beriman kepada apa yang diturunkan kepada mereka di dalam kitab-kitab suci mereka, tidak membedakan para rasul Allah, tunduk dan patuh kepada Allah demi mengharapkan sesuatu yang ada di sisi-Nya, dan tidak menukar ayat-ayat Allah dengan imbalan yang sedikit dari kesenangan dunia. Orang-orang yang memiliki sifat-sifat tersebut akan mendapatkan pahala yang sangat besar di sisi Rabb mereka. Sesungguhnya Allah Mahacepat penghitungan-Nya atas amal perbuatan manusia dan Mahacepat balasan-Nya atas amal tersebut."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "199. Allah memuji segolongan orang-orang Yahudi dan Nasrani yang beriman kepada Allah, al-Qur’an, Taurat, dan Injil; mereka tunduk kepada Allah, tidak mengubah suatu hukum atau menyembunyikan suatu ilmu demi mendapat sedikit kenikmatan dunia. Mereka akan mendapat derajat yang mulia dan pahala yang besar dari Tuhan mereka. Sungguh Allah Maha Cepat perhitungan-Nya terhadap seluruh manusia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "199. وَإِنَّ مِنْ أَهْلِ الْكِتٰبِ لَمَن يُؤْمِنُ بِاللهِ (Dan sesungguhnya diantara ahli kitab ada orang yang beriman kepada Allah) Yakni sebagian ahli kitab mempunyai nilai keagamaan tidak seperti yang lain yang mempunyai berbagai keburukan sebagaimana yang telah Allah beberkan sebelumnya. Dan ssebagian orang tersebut memadukan keimanan dan ketundukan kepada Allah dan apa yang diturunkan kepada Nabi Muhammad serta apa yang diturunkan kepada Nabi-Nabi mereka. لَا يَشْتَرُونَ بِـَٔايٰتِ اللهِ ثَمَنًا قَلِيلًا ۗ (dan mereka tidak menukarkan ayat-ayat Allah dengan harga yang sedikit) Yakni mereka tidak meninggalkan ketaatan kepada Nabi Muhammad demi mendapatkan jabatan atau derajat. لَهُمْ أَجْرُهُمْ (. Mereka memperoleh pahala) Yakni pahala dua kali lipat, sebagaimana akan disebutkan di surat al-Qashash: 53."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "199. Sesungguhnya sebagian ahli kitab itu mengimani Allah sebagai Tuhan yang Maha Esa dengan benar, mengimani Al-Qur’an, Taurat dan Injil, tunduk kepada Allah dengan melakukan ketaatan, dan tidak mengganti sedikitpun ayat-ayat Allah dengan kenikmatan dunia karena rakus terhadap harta dan jabatan. Sesungguhnya mereka memelihara wahyu sebagaimana mestinya, tanpa menyembunyikan sedikitpun isinya seperti kabar gembira tentang nabi Muhammad SAW, dan tanpa menyimpang dan menggantinya. Maka bagi mereka itu pahala di sisi Tuhan mereka sebanyak dua kali atas amal dan ketaatan mereka. Sesungguhnya Allah itu maha cepat hisabnya, yang mana Dia menghisab seluruh manusia dalam waktu yang singkat. Ayat ini turun terkait perintah Nabi SAW untuk menyalathi orang Najasyi ketika dia mati."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya di antara Ahlul kitab ada yang beriman kepada Allah dan pada apa yang diturunkan kepada kalian dan yang diturunkan kepada mereka. Mereka berendah hati} mereka tunduk dan merendah {kepada Allah dan tidak menukarkan} tidak menukar {ayat-ayat Allah dengan harga murah. Bagi mereka itu pahala} pahala {di sisi Tuhan mereka. Sesungguhnya Allah Maha cepat perhitunganNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "199. Maksudnya, ”Dan sungguh diantara ahli kitab,” ada suatu kelompok yang di bimbing kepada kebaikan, mereka beriman kepada Allah dan mereka beriman kepada sesuatu ”yang diturunkan kepadamu dan yang diturunkan kepada mereka,” keimanan yang berguna ini tidaklah seperti orang yang beriman kepada sebagian Rasul dan kitab, dan kafir kepada sebagian lainya. Oleh karena itu , ketika kaimanan mereka menyeluruh dan bersipat hakiki, maka menjadi suatu yang berguna hingga menimbulkan rasa takut bagi mereka kepada Allah dan ketundukan mereka di bawah kemuliaanya yang mengharuskan ketundukan kepada perintah dan larangaNya, serta tidak melampui batas-batasNya. \"Sesungguhnya yang takut kepada Allah di antara hamba-hamba-Nya, hanyalah ulama. Sesungguhnya Allah Maha Perkasa lagi Maha Pengampun.-Fathir:28- Dan termasuk rasa takut mereka kepada Allah adalah bahwa mereka”tidak menukarkan ayat-ayat Allah dengan harga yang sedikit, ”mereka tidak mendahulukan dunia daripada agama sebagaiman yang dilakukan orang-orang yang menyimpang, yang menyembunyikan apa yang telah Allah turunkan dan mereka tukarkan dengan harga yang sedikit. Adapun mereka adalah orang yang mengetahui kebenaran yang hakiki dan mereka mengetahui bahwa termasuk kerugian yang besar ketika meridoi dunia tanpa agama/akhirat. Dan berdiri mengikuti keinginan nafsu yang hina dan meninggalkan kewajiban yang bias mendatangkan kemenangan dunia dan akhirat, maka mereka menerima kebenaran dan menjelaskannyam lalu mendakwahkannya, dan mereka memperingatkan dari kebatilan. Maka Allah memberi pahala kepada mereka atas perbuatan itu dengan pahala yang besar dan ganjaran yang indah dan Allah memberitahu mereka bahwasanya \"Dia sangat cepat penghitungannya\" maka tida ada yang lambat menerima apa yang Allah janjikan, karena sesungguhnya apa uang dating itulah yang pasti akan diterima, dan itu begitu dekat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 199: Dan sesungguhnya sebagian dari pada ahli Kitab ada yang beriman kepada Allah dan (kepada) apa yang telah diturunkan kepada kamu dan apa yang telah disurukan kepada mereka, sedang mereka merendah diri kepada Aliak, tidak menjual ayat-ayat Allah dengan harga yang sedikit, Adalah bagi mereka ganjeran mereke di sisi Tuhan mereka karena sesungguhnya Allah itu Pengira yang cepat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Abu Bakar Al Bazzar meriwayatkan dari Anas, bahwa Nabi shallallahu 'alaihi wa sallam pernah menyalatkan raja Najasyi ketika diberitakan bahwa ia telah wafat, lalu ada yang mengatakan, \"Wahai Rasulullah, apakah Engkau akan menyalatkan seorang budak Habasyah?\" Maka Allah Azza wa Jalla menurunkan ayat, \"Wa inna min ahlil kitaab…dst.\" (Hadits ini memiliki banyak jalur yang menjadikannya shahih). Seperti Abdullah bin Salam, kawan-kawannya dan Raja Najasyi. Yaitu Al Qur'an. Yaitu Taurat dan Injil. Inilah iman yang bermanfaat, yakni mengimani semua rasul dan semua kitab. Adapun jika hanya beriman kepada sebagian rasul atau sebagian kitab, maka iman tersebut tidak bermanfaat. Mereka inilah Ahli Kitab dan ahli ilmu yang sesungguhnya, di mana hanya orang-orang yang berilmu sajalah yang takut kepada Allah. Kepada mereka diberikan rasa takut kepada Allah, tunduk kepada keagungan-Nya yang menjadikan mereka mengerjakan perintah dan menjauhi larangan serta berjalan di atas batasan-Nya. Di antara sempurnanya rasa takut mereka adalah mereka tidak menukarkan ayat-ayat Allah dengan harga yang murah. Yang ada pada mereka di dalam Taurat dan Injil seperti tentang diutusnya Nabi Muhammad shallallahu 'alaihi wa sallam. Yaitu dunia, dengan menyembunyikan ayat itu karena mengkhawatirkan kedudukannya di tengah-tengah kaumnya seperti yang dilakukan orang-orang Yahudi. Mereka tidak mengedepankan dunia di atas agama, mereka mengetahui bahwa kerugian yang sesungguhnya adalah ketika lebih ridha dengan kehinaan daripada kemuliaan, meengedepankan kepentingan pribadi dan meninggalkan kebenaran yang merupakan kemenangan di dunia dan di akhirat. Mereka mendapatkan pahala dua kali karena beriman kepada Taurat, Injil dan Al Qur'an (lihat Al Qashash: 54)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 199",
    "description": "Setelah menjelaskan w yang diberikan Allah kepada orang-orang mukmin, kemudian Allah menjelaskan golongan mukmin lain-Nya yang mendapat imbalan yang sama. Dan sesungguhnya di antara ahli kitab dari golongan yahudi dan nasrani ada kelompok orang-orang yang beriman kepada Allah dengan tulus, dan beriman kepada apa yang diturunkan kepada kamu yaitu kitab suci Al-Qur'an dan beriman kepada apa yang diturunkan kepada mereka, yaitu kitab taurat dan injil. Mereka menghimpun antara keimanan kepada nabi-nabi mereka sendiri dan keimanan kepada nabi Muhammad serta ajaran-ajaran yang dibawa para nabi dalam keadaan berendah hati kepada Allah dengan tunduk dan patuh mengamalkan syariat-Nya, dan mereka tidak memperjualbelikan ayat-ayat Allah dengan harga murah, demi meraih kekayaan materi dan kemewahan, serta kedudukan yang sifatnya sementara. Mereka yang tunduk dan patuh mengamalkan syariat-Nya kelak akan memperoleh pahala di sisi tuhannya sebagai imbalan atas amal perbuatan yang telah mereka lakukan dengan tulus di dunia. Sungguh, Allah sangat cepat perhitungan-Nya, mampu menghitung jumlah yang banyak dalam waktu singkatwahai orang-orang yang beriman! bersabarlah kamu semua dalam taat kepada Allah dengan meninggalkan perbuatan maksiat dan segala larangan dengan cara menjauhinya serta bertobatlah, dan kuatkanlah kesabaranmu terhadap musibah yang menimpamu maupun tingkah laku orang yang mungkin terasa menyakitkan. Dan tetaplah bersiap siaga dalam menghadapi musuh-Musuh di perbatasan negerimu dengan selalu komitmen di jalan Allah, dan bertakwalah kepada Allah dengan menaati perintah-Nya dan menjauhi larangan-Nya agar kamu termasuk orang-orang yang beruntung, yakni mendapatkan imbalan yang besar dan abadi, atas ketaatan dan kesabaran kalian. Pada akhir ayat ini Allah memperingatkan orang mukmin dengan empat perintah, yaitu bersabar, memperteguh kesabaran, komitmen di jalan Allah, dan bertakwa. Empat hal ini akan mengantarkan seseorang memperoleh keberuntungan."
  }
]