[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dia lah Allah, tidak ada sesembahan yang berhak diibadahi kecuali Dia,yang memiliki sifat kehidupan yang sempurna,sesuai keagunganNYA,yang menangani segala sesuatu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Allah, tidak ada tuhan yang berhak disembah melainkan Dia saja, tidak ada yang lain, Yang Mahahidup dengan kehidupan yang sempurna, tanpa kematian dan kekurangan, Yang Maha Mengurus, yang berdiri sendiri, sehingga tidak membutuhkan semua makhluk-Nya, dan Dia lah yang menjadi tumpuan seluruh makhluk-Nya, sehingga mereka senantiasa membutuhkan-Nya dalam kondisi apapun."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "2. Allah, tidak ada sesembahan yang hak kecuali Dia, Maha Hidup yang memiliki kesempurnaan sifat hidup sesuai keagungan-Nya, Maha Mengatur segalanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. اللهُ لَآ إِلٰهَ إِلَّا هُوَ الْحَىُّ الْقَيُّومُ ( Allah, tidak ada Tuhan (yang berhak disembah) melainkan Dia. Yang hidup kekal lagi terus menerus mengurus makhluk-Nya) Telah disebutkan pula tafsir dari dua nama Allah ini pada surat al-baqarah: 255."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Allah, yang tidak ada tuhan yang berhak disembah selain Dia, Dzat yang abadi, dan berkuasa atas setiap sesuatu di langit dan bumi dengan menjaga dan memeliharanya. Ayat ini sampai beberapa ayat setelahnya dan 80 ayat dari pertengahan surah Ali Imran itu turun untuk utusan Nasrani najran yang menantang debat Rasulullah SAW terkait Isa AS. Mereka berkata: “Siapakah ayahnya Isa?” Kemudian sesekali menggambarkannya sebagai Tuhan, sesekali sebagai anak Allah, dan sesekali sebagai salah satu Tuhan Trinitas"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah, tidak ada tuhan selain Dia, Yang Mahahidup lagi Maha Mengurus secara terus-menerus} Dzat yang mengurus segala sesuatu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2. Allah memberitahukan bahwa dia ”Hidup kekal” yakni hidup yang sempurna, ”terus menerus mengurus mahluknya, ” yang melakukanya sendiri dan mengurus kondisi mahluknya, dimana Allah telah mengurus kondisi agama, kondisi dunia, dan kondisi takdir-takdir mereka, lalu Allah menurunkan kepada Rasulnya Muhammad al-kitab dengan kebenaran, yang tidak ada keraguan padanya, dan kitab itu mencakup kebenaran."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 2: Allah itu, tidak ada Tuhan melainkan Dia, Yang hidup, Yang berdiri dengan sendiri-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sifat ini menghendaki semua sifat-sifat lain yang menyempurnakannya, seperti sifat mendengar, melihat, berkuasa, kuat, agung, kekal, perkasa dsb. Maksudnya: Allah berdiri sendiri tanpa memerlukan bantuan makhluk-Nya, Dia mengatur dan mengurus makhluk-Nya sehingga semua makhluk membutuhkannya. Temasuk mengurus makhluk-Nya juga adalah menurunkan kitab agar menjadi pedoman bagi manusia dalam meniti hidup ini."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 2",
    "description": "Dialah Allah, tidak ada tuhan yang pantas disembah selain dia, yang mahahidup dengan segala kesempurnaan yang sesuai dengan keagungan-Nya, yang terus-menerus secara sempurna dan berkesinambungan mengurus dan memenuhi kebutuhan makhluk-Nya. Dia menurunkan kitab Al-Qur'an secara berangsur-angsur kepadamu, wahai nabi Muhammad, yang mengandung kebenaran dan dalam keadaan hak, baik kandungan, cara menurunkan, yang membawanya turun, maupun yang menerimanya. Kandungan Al-Qur'an itu membenarkan wahyu-wahyu Allah dalam kitab-kitab suci sebelumnya yang pernah diwahyukan kepada para nabi dan rasul, yakni yang berkaitan dengan pokok-pokok akidah, syariah dan akhlak. Dan Allah juga menurunkan sekaligus, tidak berangsur-angsur, kepada nabi musa kitab taurat dan kepada nabi isa kitab injil sebelum turun-Nya Al-Qur'an. Ketiga kitab suci tersebut berfungsi sebagai petunjuk bagi manusia. Dan dia menurunkan ketiga kitab suci tersebut sebagai al-furqa'n yang berfungsi membedakan antara yang hak dan yang batil. Sungguh, orang-orang yang ingkar terhadap ayat-ayat Allah dengan menutupi tanda-tanda keesaannya, baik yang terbentang di alam raya, melalui kitab suci maupun fitrah yang melekat pada diri setiap insan, akan memperoleh azab yang berat. Allah mahaperkasa yang tidak seorang pun dapat mengalahkannya, lagi mempunyai hukuman bagi orang yang mengingkari bukti-bukti keesaan dan kekuasaan-Nya."
  }
]