[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apabila ahli kitab mendebatmu (wahai Rasul) tentang Tauhid setelah engkau menegakkan hujjah kepada mereka, bacakanlah kepada mereka, “Sesungguhnya aku ikhlas untuk Allah semata sehingga aku tidak akan menyekutukan seorangpun pada Nya, begitu pula orang-orang yang mengikutiku dari orang-orang Mukmin, mereka ikhlas kepada Allah dan tunduk kepada Nya”. Dan katakanlah kepada mereka dan kaum musyrikin dari bangsa Arab dan lainnya, “sesungguhnya jika kalian masuk Islam, maka kalian berada di atas jalan yang lurus (Hidayah) dan kebenaran. Dan jika kalian berpaling maka perhitungan amal perbuatan kalian terserah kepada Allah, aku tidak berkewajiban selain menyampaikan saja sedangkan aku telah menjelaskan kepada kalian dan sudah aku tegakkan hujah-hujah kepada kalian, dan Allah mengetahui hamba-hamba Nya, tidak ada satupun dari keadaan mereka yang samar bagi Nya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "20. Apabila mereka mendebatmu -wahai Rasul- tentang kebenaran yang diturunkan kepadamu, maka jawablah mereka dengan mengatakan, “Aku dan orang-orang mukmin yang mengikutiku berserah diri kepada Allah -Ta'ālā-.” Dan katakanlah wahai Rasul kepada orang-orang ahli kitab dan orang-orang musyrik, “Apakah kalian mau berserah diri kepada Allah secara ikhlas dan mau mengikuti agama yang kubawa?” Jika mereka mau berserah diri kepada Allah dan mengikuti syariatmu, berarti mereka telah mengikuti jalan yang benar. Tetapi jika mereka berpaling dari Islam, tugasmu hanyalah menyampaikan risalah yang engkau bawa, dan urusan mereka dikembalikan kepada Allah. Dia Maha Melihat kondisi hamba-hamba-Nya dan akan memberikan balasan kepada setiap orang menurut perbuatannya masing-masing."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "20. Allah mengajarkan Nabi Muhammad cara untuk mendebat para Ahli Kitab: “Jika mereka mendebatmu dalam urusan agama maka katakanlah kepada mereka: ‘Aku mengikhlaskan ibadahku hanya kepada Allah semata, begitu pula dengan orang-orang beriman yang menjadi pengikutku’. Dan katakanlah kepada para Ahli Kitab dan orang-orang musrik arab: ‘apakah kalian mau masuk Islam?’ jika mereka masuk Islam maka mereka telah mendapat petunjuk menuju jalan yang lurus, namun jika mereka menolak maka sesungguhnya tugasmu hanyalah menyampaikan apa yang diturunkan kepadamu. Allah Maha Mengetahui siapa yang berhak mendapat hidayah, dan siapa yang berhak mendapat kesesatan, tidak ada yang tersembunyi dari-Nya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "20. فَإِنْ حَآجُّوكَ ( jika mereka mendebat kamu) Yakni para orang Nasrani apabila mendebatmu dengan syubhat yang bathil dan perkataan yang sesat, maka katakanlah: أَسْلَمْتُ وَجْهِىَ لِلَّـهِ أَسْلَمْتُ وَجْهِىَ لِلَّـهِ (“Aku menyerahkan diriku kepada Allah ) Yakni aku menyerahkan agamaku dan ibadahku untuk Allah. وَمَنِ اتَّبَعَنِ ۗ( dan (demikian pula) orang-orang yang mengikutiku) Yakni begitu pula orang-orang muslim yang mengikutiku menyerahkan ibadah mereka. وَالْأُمِّيِّۦنَ (dan kepada orang-orang yang ummi ) Yang dimaksud dengan Ummi adalah kaum musyrikin Arab yang tidak memiliki kitab-kitab (dari Allah) untuk mereka pelajari. ءَأَسْلَمْتُمْ ۚ ( Apakah kamu (mau) masuk Islam) Yakni telah datang kepadamu bukti-bukti yang membuktikan kebenaran Islam, maka apakah kalian akan menerima Islam dan mengamalkan apa yang menjadi konsekuensi dari hal itu atau tidak? فَقَدِ اهْتَدَوا۟ ۖ ( sesungguhnya mereka telah mendapat petunjuk) Yakni yang beruntung dengan mendapatkan petunjuk yang merupakan keberuntungan yang terbesar dan mendapatkan kemenangan berupa kebaikan dunia dan akhirat. وَّإِن تَوَلَّوْا۟ ( dan jika mereka berpaling) Yakni menolak untuk menerima hujjah. فَإِنَّمَا عَلَيْكَ الْبَلٰغُ ۗ ( maka kewajiban kamu hanyalah menyampaikan) Yakni kewajibanmu wahai Muhammad hanyalah menyampaikan apa yang diturunkan kepadamu, dan kamu tidak memiliki kuasa atas mereka, maka janganlah biarkan dirimu binasa karena kesedihan terhadap mereka. وَاللهُ بَصِيرٌۢ بِالْعِبَادِ (Dan Allah Maha Melihat akan hamba-hamba-Nya ) Yakni Allah mengetahui segala keadaan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20 Kemudian jika mereka mendebat kamu tentang kebenaran Islam dengan bathil dan perkataan yang bermaksud merubah dan juga berdasar lemah dalam hal tauhid dan agama dalam, maka katakanlah kepada mereka wahai Nabi: “Aku menyerahkan diriku dengan tulus akan agama dan ibadahku kepada Allah dan aku merendahkan seluruh jiwa ragaku, aku tidak menyekutukan-Nya dengan suatu apapun. Demikian pula orang-orang yang mengikutiku juga beragama dan beribadah dengan sepenuh hati”. Dan katakanlah kepada orang-orang Yahudi dan Nasrani dan para Ummiyin yaitu orang-orang musyrik Arab: “Apakah kamu mau masuk Islam dan bersedia menjalankan kewajiban, atau kalian akan tetap dalam kekufuran?”. Jika mereka masuk Islam, sesungguhnya mereka telah mendapat petunjuk kepada kebenaran dan meninggalkan kesesatan. Dan jika mereka berpaling dari Islam dan tetap dalam kekufuran, maka kewajiban kamu hanyalah menyampaikan ayat-ayat Allah, tidak lebih. Dan Allah Maha Melihat akan hamba-hamba-Nya dan Maha Membalas segala amal perbuatan mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika mereka mendebatmu} mendebatmu {katakanlah, “Aku berserah diri kepada Allah} aku hanya berserah diri kepada Allah {dan orang-orang yang mengikutiku”} dan orang yang mengikutiku berserah diri seperti aku {Katakanlah kepada orang-orang yang telah diberi Kitab dan kepada orang-orang yang umiy} orang-orang yang tidak memiliki kitab yaitu orang-orang musyrik Arab {“Sudahkah kalian masuk Islam?” Jika mereka telah masuk Islam, sungguh mereka telah mendapat petunjuk. Tapi jika mereka berpaling} berpaling dari Islam {sesungguhnya kewajibanmu hanyalah menyampaikan. Allah Maha Melihat hamba-hambaNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "20. Ketika Allah menjelaskan bahwa agama yang benar di sisiNya hanya islam, dan ahli kitab itu berdialog dengan nabi dengan perdebatan, dan hujjah telah tegak atas mereka, tetapi mereka membangkan terhadapnya, maka Allah memerintahkan kepada NabiNya pada kondisi itu untuk berkata dan memberitakan bahwasanya ia telah berserah dari lahir maupun batin kepada Allah, dan bahwa orang-orang yang mengikutinya juga tetap sepakat dengannya ketundukan yang tulus. Dan agar beliau berkata kepada manusia seluruhnya, dari ahli kitab dan orang-orang yang ummi (orang-orang yang tidak memiliki kitab dari bangsa Arab dan selain mereka) bahwa mereka berserah diri, maka mereka berda dalam jalan yang lurus, petunjuk dan kebenaran. Dan apabila kalian berpaling, maka perhitungan kalian hanya pada Allah, sedang saya tidak memiliki tugas kecuali menyampaikan saja, dan telah saya sapaikan kepada kalian dan telah saya tegakkan hujjah atas kalian."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 20: Oleh sebab itu, jika mereka membantahmu, maka katalah: \"Aku telah serahkan diriku kepada Allah, begitu juga orang-orang yang menurutku\", dan tanyalah orang-orang (kafir) yang diberi Kitab dan orang-orang yang ummi : \"Sudahkah kamu masuk Islam?\" Jika mereka telah masuk Islam, sesungguhnya terpimpinlah mereka; dan jika mereka berpaling, maka tidak ada kewajiban atasmu melainkan menyampaikan (saja); dan Allah itu amat Melihat akan hamba-hambaNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dalam kata-kata ini terdapat ta'yis (menjadikan putus asa) orang-orang yang coba-coba memurtadkan kita dari agama Islam dengan perdebatan yang dilakukannya dan menguatkan agama ketika datang syubhat. Ummi artinya ialah orang yang tidak tahu tulis baca. Menurut sebagian ahli tafsir yang dimaksud dengan Ummi ialah orang musyrik Arab yang tidak tahu tulis baca. Sedangkan menurut sebagian yang lain ialah orang-orang yang tidak diberi Al Kitab."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 20",
    "description": "Lalu jika mereka membantahmu, wahai nabi Muhammad, tentang kebenaran islam, maka jelaskan dengan diperkuat dalil-dalil. Namun, jika mereka tetap menolak, maka katakanlah, aku berserah diri kepada Allah dan tidak bertanggung jawab atas pengingkaran kalian; demikian pula orang-orang yang mengikutiku. Dan katakanlah kepada orang-orang yang telah diberi kitab, yahudi dan nasrani dan kepada orang-orang buta huruf, yaitu orang-orang musyrik arab yang tidak memiliki kitab suci, sudahkah kamu masuk islam' jika mereka masuk islam dengan sebenarbenarnya, berarti mereka telah mendapat petunjuk jalan yang benar, yang menyelamatkan mereka di dunia dan akhirat, tetapi jika mereka berpaling dari islam, maka kewajibanmu, wahai nabi Muhammad, hanyalah menyampaikan. Dan Allah maha melihat seluruh amal perbuatan hambahamba-Nya, siapa yang taat dan siapa yang membangkang. Setelah ayat sebelumnya menjelaskan penolakan yahudi yang didasarkan atas kedengkian, maka ayat ini menunjukkan sebagian perilaku buruk mereka. Sesungguhnya orang-orang yang mengingkari ayat-ayat Allah, dari kaum yahudi, baik yang tertulis maupun yang tidak tertulis berupa alam raya, dan membunuh para nabi tanpa dalih sedikit pun yang bisa dianggap hak atau benar, dan juga membunuh orang-orang yang menyuruh manusia berbuat adil, maka sampaikanlah kepada mereka kabar gembira, sebagai bentuk penghinaan, yaitu azab yang pedih di akhirat kelak."
  }
]