[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang yang beriman kepada Allah dan rasulNYA dan melaksanakan syariatNYA, bersabarlah diatas ketaatan kepada tuhan kalian dan terhadap apa yang menimpa kalian berupa kemadorotan dan bencana, dan teguhkanlah kesabaran kalian untuk menghadapi musuh-musuh kalian sehingga mereka tidak lebih bersabar di bandingkan kalian, dan tegaklah untuk memerangi musuhKU dan musuh kalian serta takutlah kepada Allah dalam seluruh keadaan kalian, semoga kalian memperoleh keberuntungan berupa ridhaNYA di dunia dan di akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "200. Wahai orang-orang yang beriman kepada Allah dan mengikuti rasul-Nya, bersabarlah kalian terhadap beban-beban syariat (agama) serta musibah-musibah dunia yang menimpa kalian. Dan kalahkanlah orang-orang kafir dalam hal kesabaran. Jangan sampai mereka lebih sabar dari kalian. Tegakkanlah jihad di jalan Allah. Dan takutlah kalian kepada Allah dengan cara menjalankan perintah-perintah-Nya dan menjauhi larangan-larangan-Nya, supaya kalian mendapatkan apa yang kalian harapkan. Yaitu selamat dari Neraka dan masuk ke dalam Surga."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "200. Allah menyeru orang-orang beriman, “Bersabarlah dalam menjalankan ketaatan dan menjauhi kemungkaran, kalahkanlah musuh-musuh kalian dengan kesabaran ketika dalam kecamuk perang, jagalah perbatasan negeri kalian untuk menjaganya dari serangan musuh, dan bertakwalah kepada Allah, agar kalian dapat meraih kemenangan di dunia berupa kehidupan yang baik, dan di akhirat berupa surga yang besar. Dari Abu Hurairah, Rasulullah bersabda: “Apakah kalian mau aku tunjukkan sesuatu yang dengannya Allah menghapuskan dosa-dosa dan meningkatkan derajat?” Mereka berkata: “Tentu wahai Rasulullah”. Beliau menjawab: “Sempurnakanlah wudhu walaupun dalam kondisi tidak menyenangkan, memperbanyak langkah menuju masjid dan menunggu shalat setelah shalat, maka itu adalah ribath, itu adalah ribath(berjaga-jaga di daerah perbatasan musuh).” (as-Shahih 1/219 no. 251, kitab thaharah, bab keutamaan berwudhu pada kondisi tidak menyenangkan)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "200. يٰٓأَيُّهَا الَّذِينَ ءَامَنُوا۟ اصْبِرُوا۟ (Hai orang-orang yang beriman, bersabarlah kamu) Ayat ini sebagai himbauan untuk senantiasa bersabar diatas ketaatan dan dari syahwat. وَصَابِرُوا۟ (dan kuatkanlah kesabaranmu) Yakni dalam menghadapi musuh. Dan hal ini lebih berat dari pada sabar. وَرَابِطُوا۟(dan tetaplah bersiap siaga (di perbatasan negerimu)) Yakni bersiagalah di perbatasan negeri dan ikatlah kuda-kuda kalian disana. Dan termasuk dari Ribath adalah menunggu shalat di masjid. Dan makna ribath adalah melazimi perbatasan dan melazimi masjid. Disebutkan dalam Shahih Bukhari dan lainnya sabda dari Rasulullah: “maukah kalian aku tunjukkan pada amalan yang dengannya Allah menghapus kesalahan-kesalahan dan dengannya mengangkat derajat-derajat: menyempurnakan wudhu saat suasana yang tidak disukai, memperbanyak langkah menuju masjid-masjid, dan menunggu didirikannya shalat selanjutnya setelah mengerjakan shalat, maka itulah Ribath, maka itulah ribath, maka itulah ribath. Dan banyak diriwayatkan berbagai hadist yang menyebutkan keutamaan ribath di jalan Allah dengan membelakangi negeri kaum muslimin dan menghadap negeri musuh, diantaranya sabda Nabi yang dikeluarkan Imam Bukhari: Ribath selama satu hari di jalan Allah lebih baik daripada dunia dan seisinya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "200. Wahai orang-orang mukmin, bersabarlah untuk berbuat data dan menahan syahwat, dan kuatkanlah kesabaran kalian, Unggulilah musuh dengan bersabar atas derita peperangan, dan jadilah orang yang lebih bersabar daripada mereka. Berdirilah di ujung-ujung negeri yang akan disusupi musuh dengan mengikat kuda-kuda kalian disana seraya dan mempersiapkan diri untuk berjihad. Bertakwalah kepada Allah dalam keadaan sembunyi maupun terang-terangan agar kalian mendapatkan keridhaan dan surga Allah. Ar-Ribath adalah menunggu shalat di masjid. Abu Salamah bin Abdurrahman berkata: “Di zaman nabi SAW belum ada ujung tempat yang dijaga/dibentengi” Namun ayat ini turun terkait tindakan menunggu shalat di belakang orang yang shalat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, bersabarlah, kuatkanlah kesabaran kalian} kalahkanlah musuh kalian dengan bersabar melewati beratnya peperangan {bersiap siagalah} dan berdirilah untuk berjihad di jalan Allah {dan bertakwalah kepada Allah agar kalian beruntung}"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "200. Kemudian Allah menganjurkan kaum Mukminin kepada sesutau yang dapat menyampaikan mereka kepada kemenangan, yaitu keberhasilan dengan memperoleh kebahagiaandan kesuksesan, dan bahwa jalan yang dapat menyampaikan kepada hal itu adalah konsisten terhadap kesabaran, yaitu menahan diri dari hal-hal yang dibenci berupa meninggalkan kemaksiatan, dan bersabar atas musibah dan terhadap perkara-perkara yang berat bagi jiwa. Allah memerintahkan untuk bersabar atas semua itu. Al-muhsabarah (memaksa diri untuk bersabar)adalah konsisten dan kontinu dalam hal itu secara terus menerus, danmenghadapi musuh dalam segala kondisi, sedangkan Al-murabhatah (siap siaga)adalah berjaga disuatu temapat yang di takutkan musuh akan masuk melaluainya, dan mengamati musuh mereka agar tidak berhasil memperoleh tujuan-tujuan mereka. Semoga mereka beruntung yaitu mereka berhasil dengan hal yang di sukai, baik agama maupun dinia serta akhirat, dan mereka selamat dari hal-hal yang di benci. Dari sini diketahui bahwasanya tidak ada jalan menuju kamenangan tanpa ada kesabaran dan memaksa diri dalam kesabaran tersebut, serta siaga dalam menghadapi musuh seperti yang telah disebutkan. Karena itulah tidak akan beruntung orang yang beruntung itu kecuali dengan hal-hal tersebut, dan tidaklah akan luput keberhasilah itu dari seseorang kecuali dengan luputnya seseorang dari hal-hal tersebut atau sebagainya. Allah permberi taufik, dan tiada daya dan upaya kecuali dengan pertolongan Allah. Telah selesai tafsir surat Ali-imran, segala puji hany milik Allah atas nikmatNya, dan kita memohon kepadaNya kesempurnaan nikmatNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 200: Hai orang-orang yang beriman! Sabarlah dan lawanlah dengan sabar dan bersedialah dan berbaktilah kepada Allah supaya kamu dapat kejayaan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dalam ayat ini, Allah mendorong kaum mukmin kepada sesuatu yang menyampaikan mereka kepada keberuntungan, yaitu sabar; sikap menahan diri memikul hal yang tidak mengenakkan. Di atas ketaatan, ketika tertimpa musibah dan dalam menjauhi maksiat. Yakni berjihadlah. Dalam semua keadaan kamu. Mendapatkan surga dan terhindar dari neraka. Hubungan surat Ali Imran dengan surat An Nisaa': 1. Surat Ali 'Imran diakhiri dengan perintah bertakwa, sesuai dengan permulaan surat An Nisaa'. 2. Dalam surat Ali Imran terdapat kisah penciptaan Nabi Isa 'alaihis salam tanpa bapak dan agar hilang syubhat, maka disebutkan penciptaan Nabi Adam 'alaihis salam. Dalam kisah tersebut terdapat pembelaan terhadap ibu Nabi Isa 'alaihis salam dari tuduhan zina oleh orang-orang Yahudi dan penetapan bahwa Nabi Isa ''alaihis salam adalah seorang hamba sebagai bantahan terhadap orang-orang Nasrani. Sedangkan dalam surat An Nisaa' disebutkan bantahan terhadap kedua belah pihak; Yahudi (lihat ayat 156) dan Nasrani (171-172). 3. Dalam surat Ali Imran disebutkan, bahwa Nabi Isa 'alaihis salam diangkat ke langit, dan dalam surat An Nisaa' disebutkan bantahan terhadap anggapan orang-orang Yahudi yang mengaku telah membunuhnya. 4. Dalam surat Ali Imran disebutkan sikap orang-orang yang dalam ilmunya tentang ayat-ayat mutasyabihat (lihat ayat 7), sedangkan di dalam surat An Nisaa' disebutkan lebih lanjut keadaan orang-orang yang dalam ilmunya (lihat ayat 162). 5. Dalam surat Ali 'Imran disebutkan peperangan Badar dan Uhud secara lengkap, dan sebagiannya diulangi lagi dalam surat An Nisaa'. 6. Dalam surat Ali 'Imran disebutkan bahwa banyak yang gugur di kalangan kaum muslimin sebagai Syuhada', yang berarti mereka meninggalkan anak-anak dan isteri-isteri mereka, maka pada bagian awal surat An Nisaa' disebutkan perintah memelihara anak yatim serta pembagian harta pusaka. Selesai tafsir surat Ali Imran dengan pertolongan Allah dan taufiq-Nya, wal hamdulillah 'alaa ni'matih wa nas'aluhu tamaaman ni'mah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 200",
    "description": "Wahai orang-orang yang beriman! bersabarlah kamu semua dalam taat kepada Allah dengan meninggalkan perbuatan maksiat dan segala larangan dengan cara menjauhinya serta bertobatlah, dan kuatkanlah kesabaranmu terhadap musibah yang menimpamu maupun tingkah laku orang yang mungkin terasa menyakitkan. Dan tetaplah bersiap siaga dalam menghadapi musuh-Musuh di perbatasan negerimu dengan selalu komitmen di jalan Allah, dan bertakwalah kepada Allah dengan menaati perintah-Nya dan menjauhi larangan-Nya agar kamu termasuk orang-orang yang beruntung, yakni mendapatkan imbalan yang besar dan abadi, atas ketaatan dan kesabaran kalian. Pada akhir ayat ini Allah memperingatkan orang mukmin dengan empat perintah, yaitu bersabar, memperteguh kesabaran, komitmen di jalan Allah, dan bertakwa. Empat hal ini akan mengantarkan seseorang memperoleh keberuntungan setelah pada surah sebelumnya Allah menjelaskan bahwa kitab suci merupakan petunjuk jalan menuju kebahagiaan dan bahwa inti seluruh kegiatan adalah tauhid, pada surah ini Allah menjelaskan bahwa untuk meraih tujuan tersebut manusia perlu menjalin persatuan dan kesatuan, serta menanamkan kasih sayang antara sesama. Wahai manusia! bertakwalah kepada tuhanmu dengan menaati perintah-Nya dan menjauhi larangan-Nya, mensyukuri karunia dan tidak mengkufuri nikmat-Nya. Dialah Allah yang telah menciptakan kamu dari diri yang satu yaitu adam, dan Allah menciptakan pasangannya yaitu hawa dari diri-Nya yakni dari jenis yang sama dengan adam; dan dari keduanya, pasangan adam dan hawa, Allah memperkembangbiakkan menjadi beberapa keturunan dari jenis laki-laki dan perempuan yang banyak kemudian mereka berpasang-pasangan sehingga berkembang menjadi beberapa suku bangsa yang berlainan warna kulit dan bahasa (lihat: surah arrum/30: 22). Oleh karena itu, bertakwalah kepada Allah yang dengan nama-Nya kamu saling meminta pertolongan antar sesama, dengan saling membantu, dan juga peliharalah hubungan kekeluargaan dengan tidak memutuskan tali silaturahmi. Sesungguhnya Allah selalu menjaga dan mengawasimu karena setiap tindakan dan perilaku kamu tidak ada yang samar sedikit pun dalam pandangan Allah. Menjalin persatuan dan menjaga ikatan kekeluargaan adalah dasar ketakwaan yang dapat mengantarkan manusia ke tingkat kesempurnaan."
  }
]