[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang yang mengingkari bukti-bukti kebenaran yang sudah jelas dan risalah yang dibawa oleh para rasul, dan membunuh para nabi Allah dengan zalim tanpa ada alasan yang membenarkan hal itu, dan membunihi orang-orang yang memerintahkan penegakan keadilan dan mengikuti jalan para nabi, maka berilah mereka kabar gembira dengan siksaan yang sedih"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Sesungguhnya orang-orang yang ingkar kepada ayat-ayat Allah yang menunjukkan sifat rububiyah-Nya dan uluhiyah-Nya, dan membunuh nabi-nabi mereka tanpa hak, yakni secara kejam dan semena-mena, dan membunuh orang-orang yang menyerukan keadilan, yang melakukan amar makruf dan nahi mungkar, berikanlah kabar gembira kepada orang-orang kafir yang haus darah itu akan adanya azab yang pedih."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "21-22. kabarkanlah kepada orang-orang yang mendustakan bukti-bukti kebenaran, membunuh para nabi dengan zalim, dan membunuh orang-orang yang menyuruh melakukan keadilan bahwa mereka akan mendapat azab yang pedih. Mereka orang-orang yang jauh dari rahmat Allah, amal kebaikan mereka akan lenyap di dunia dan di akhirat, dan tidak ada penolong bagi mereka dari azab Allah. Ibnu ‘Asyur berkata: “firman Allah {بغير حق} merupakan dharaf yang berada di posisi hal muakkadah bagi kandungan kalimat {ويقتلون النبيين} sebab tidak ada pembunuhan nabi melainkan merupakan kezaliman, dan yang dimaksud adalah untuk menekankan betapa buruknya perbuatan tersebut.” (at-Tahrir wa at-Tanwir: 3/62)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "21. وَيَقْتُلُونَ النَّبِيِّۦنَ بِغَيْرِ حَقٍّ (dan membunuh para nabi yang memang tak dibenarkan ) Yakni orang-orang Yahudi yang membunuh para Nabi. وَيَقْتُلُونَ الَّذِينَ يَأْمُرُونَ بِالْقِسْطِ مِنَ النَّاسِ ( dan membunuh orang-orang yang menyuruh manusia berbuat adil) Yakni mereka yang memerintahkan kepada kebaikan dan melarang kemungkaran dan melarang orang zalim berbuat kezaliman. Al-Mubarrid berkata: dahulu para Nabi mendatangi sekelompok manusia dari bani Israil menyeru mereka kepada Allah, lalu mereka membunuh para Nabi tersebut. Lalu datanglah orang-orang setelah mereka orang-orang mukmin yang menyuruh mereka untuk memeluk Islam, lalu mereka membunuh orang-orang mukmin tersebut."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Ayat ini merupakan diantara dalil-dalil yang menjelaskan tingginya kedudukan ulama yang menyerukan kepada kebaikan, hal itu karena Allah menyandingkan kematian (pembununah) mereka dengan kematian para Nabi yang terbunuh, karena sesungguhnya ulama adalah warisan para Nabi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "21 Sesungguhnya orang-orang yang kafir kepada ayat-ayat Allah yang menunjukkan keesaan-Nya dan kebenaran para nabi-Nya, juga orang-orang yang membunuh para nabi dengan zalim dan tidak dibenarkan, mereka adalah orang-orang Yahudi. Mereka yang membunuh para pengajak kepada kebaikan, yang mengajak kepada kema’rufan, dan yang mengajak untuk meninggalkan kemungkaran. Maka peringatkanlah mereka dengan azab yang pedih dan menyakitkan. Mubarrid berkata: Ada kumpulan orang dari bani Israil, yang didatangi oleh para Nabi yang mengajak untuk menyembah Allah. Kemudian segolongan orang mukmin dari mereka berdiri kemudian meminta mereka untuk masuk Islam, namun orang-orang bani Israil itu membunuh mereka. Maka ayat ini turun untuk mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang yang mengingkari ayat-ayat Allah, membunuh para nabi tanpa hak, dan membunuh manusia yang memerintahkan keadilan} keadilan {sampaikanlah kepada mereka kabar tentang azab yang pedih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21-22. Maksudnya, orang-orang yang mengumpulkan kejahatan ini; kufur kepada ayat-ayat Allah, mendustakan Rasul-Rasul Allah, dan kejahatan terbesar kepada makhluk, yaitu para Rasul dan para pemimpin petunjuk, yang memerintahkan manusia dengan keadilan yang disepakati oleh agama dan akal, mereka itu telah ”lenyap (pahala) amal-amalnya di dunia dan akhirat;” dan mereka berhak menerima siksaan yang pedih, dan mereka tidak memiliki penolong dari siksaan Allah dan tidak pula memiliki penyelamat dari hukumanNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 21: Sesungguhnya meréka yang kufur kepada perintah-perintah Allah, dan membunuh nabi-nabi dengan tidak sebenarnya, dan membunuh orang-orang yang menyuruh (manusia melakukan) keadilan,maka berilah ancaman kepada mereka itu dengan siksaan yang pedih."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Seperti yang dilakukan orang-orang Yahudi. Yakni orang-orang yang beramr ma'ruf dan bernahi munkar, yang pada hakikatnya adalah berbuat ihsan kepada orang itu serta menasehatinya. Namun malah dibalas dengan perbuatan buruk"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 21",
    "description": "Setelah ayat sebelumnya menjelaskan penolakan yahudi yang didasarkan atas kedengkian, maka ayat ini menunjukkan sebagian perilaku buruk mereka. Sesungguhnya orang-orang yang mengingkari ayat-ayat Allah, dari kaum yahudi, baik yang tertulis maupun yang tidak tertulis berupa alam raya, dan membunuh para nabi tanpa dalih sedikit pun yang bisa dianggap hak atau benar, dan juga membunuh orang-orang yang menyuruh manusia berbuat adil, maka sampaikanlah kepada mereka kabar gembira, sebagai bentuk penghinaan, yaitu azab yang pedih di akhirat kelak. Jika demikian, maka mereka itulah orang-orang yang sia-sia pekerjaannya, tidak memberi manfaat sedikit pun, di dunia dan di akhirat, dan mereka juga tidak memperoleh penolong dari azab Allah di akhirat kelak."
  }
]