[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka itu adalah orang-orang yang telah gugur amal-amal mereka di dunia dan akhirat, maka tidak diterima dari mereka suatu amal kebajikan pun, dan mereka tidak memiliki penolong yang menolong mereka dari siksaan Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "22. Orang-orang semacam itu telah menggugurkan (pahala) amalnya. Maka mereka tidak akan mendapatkan manfaatnya, baik di dunia maupun di akhirat, karena mereka tidak beriman kepada Allah. Dan mereka tidak akan mendapatkan penolong yang dapat melindungi mereka dari azab Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "22. أُو۟لٰٓئِكَ الَّذِينَ حَبِطَتْ أَعْمٰلُهُمْ (Mereka itu adalah orang-orang yang lenyap (pahala) amal-amalnya) Tidak tersisa dari kebaikan-kebaikan mereka di dunia untuk diperlakukan seperti perlakuan terhadap orang yang berbuat kebaikan. Sehingga mereka pun mendapat laknat dan diturunkan kepada mereka kehinaan dan kerendahan. Dan bagi mereka azab neraka di akhirat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "22 Mereka yang membunuh para Nabi serta para pengajak kepada kebaikan itu adalah orang-orang yang lenyap pahala amal-amalnya di dunia dan akhirat, tidak ada yang dapat diterima dari mereka. Mereka sekali-kali tidak akan mendapati penolong dari azab."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka itulah orang-orang yang sia-sia} batal {amal-amalnya di dunia dan di akhirat dan tidak ada bagi mereka satu penolong pun"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21-22. Maksudnya, orang-orang yang mengumpulkan kejahatan ini; kufur kepada ayat-ayat Allah, mendustakan Rasul-Rasul Allah, dan kejahatan terbesar kepada makhluk, yaitu para Rasul dan para pemimpin petunjuk, yang memerintahkan manusia dengan keadilan yang disepakati oleh agama dan akal, mereka itu telah ”lenyap (pahala) amal-amalnya di dunia dan akhirat;” dan mereka berhak menerima siksaan yang pedih, dan mereka tidak memiliki penolong dari siksaan Allah dan tidak pula memiliki penyelamat dari hukumanNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 22: Mereka itu ialah orang-orang yang gugur amal-amalnya di dunia dan di akhirat dan tidak ada penolong-penolong bagi mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Pekerjaannya yang baik menjadi sia-sia, seperti sedekah dan silaturrahim. Yang menolong mereka dari azab."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 22",
    "description": "Jika demikian, maka mereka itulah orang-orang yang sia-sia pekerjaannya, tidak memberi manfaat sedikit pun, di dunia dan di akhirat, dan mereka juga tidak memperoleh penolong dari azab Allah di akhirat kelaksetelah pada ayat sebelumnya dijelaskan beberapa perilaku buruk kaum yahudi, ayat ini kembali menjelaskan perilaku buruk mereka lainnya. Tidakkah engkau memperhatikan bagaimana sikap dan respons orang-orang yang telah diberi bagian kitab taurat' mereka diajak berpegang pada kitab Allah, baik yang tertera pada Al-Qur'an maupun kitab mereka sendiri, taurat, untuk memutuskan perkara yang diperselisihkan di antara mereka sendiri, kemudian sebagian dari mereka berpaling seraya menolak kebenaran tersebut, disebabkan oleh kedengkian dan permusuhan."
  }
]