[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah kamu sudah melihat (wahai Rasul) suatu yang lebih mengherankan dari keadaan orang Yahudi yang telah Allah berikan kepada mereka kitab (Taurat), lalu mereka mengetahui bahwa apa yang kamu bawa adalah merupakan kebenaran, mereka diseru kepada ayat-ayat yang ada di dalam kitabullah (yaitu al-qur'an) supaya memutuskan perkara yang mereka perselisihkan, maka jika tidak sesuai dengan keinginan hawa nafsu mereka, kebanyakan dari mereka menolak hukum-hukum Allah, sebab sudah kebiasaan mereka berpaling dari kebenaran?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "23. Tidakkah engkau wahai Nabi melihat keadaan orang-orang Yahudi yang Allah berikan bagian dari ilmu melalui kitab Taurat yang memuat kabar tentang kenabianmu? Mereka diajak kembali kepada kitab Allah, Taurat, untuk mencari dalil yang dapat memutuskan apa yang mereka perselisihkan. Kemudian sebagian dari ulama dan pemimpin mereka menolak dan berpaling dari ketentuan hukumnya karena tidak sejalan dengan selera hawa nafsu mereka. Seharusnya -ketika mereka mengaku mengikuti kitab suci Taurat- mereka menjadi orang-orang yang paling bersemangat untuk mencari kepastian hukum padanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "23. Allah berfirman kepada nabi Muhammad untuk mengingkari perbuatan orang-orang Yahudi dan Nasrani: “tidakkah kamu merasa heran dari orang-orang yang menyeru kepada kebenaran yang dikandung Taurat dan Injil agar dapat menyelesaikan perselisihan yang terjadi diantara mereka, namun sebagian mereka menolak seruan itu dan enggan mendengarkannya?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "23. أَلَمْ تَرَ إِلَى الَّذِينَ أُوتُوا۟ نَصِيبًا مِّنَ الْكِتٰبِ (Tidakkah kamu memperhatikan orang-orang yang telah diberi bahagian yaitu Al Kitab ) Yakni para pemuka agama Yahudi. يُدْعَوْنَ إِلَىٰ كِتٰبِ اللهِ ( mereka diseru kepada kitab Allah) Mereka mendapat bagian dari kitab Allah yaitu kitab Taurat. لِيَحْكُمَ بَيْنَهُمْ ثُمَّ يَتَوَلَّىٰ فَرِيقٌ مِّنْهُمْ (supaya kitab itu menetapkan hukum diantara mereka; kemudian sebahagian dari mereka berpaling ) Yakni berpaling dari menerima apa yang diseru kepada mereka, padahal mereka mengetahui dan mengakui kewajiban untuk menerima hal itu."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Disebutkan dalam ayat : { فَرِيقٌ مِنْهُمْ } \"sebahagian dari mereka\" ; karena perkara yang dimaksud dalam ayat ini tidak mencakup seluruh anggota dari mereka, tetapi sebagian dari mereka ada yang memberi petunjuk (kepada manusia) dengan hak dan dengan yang hak itulah mereka menjalankan keadilan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "23 Wahai Nabi, tidakkah kamu memperhatikan orang-orang yang telah diberi bagian dari kitab Taurat? Mereka adalah para pendeta Yahudi. Mereka diseru untuk menjalankan perintah Taurat dan menetapkan hukum tentang apa yang mereka perselisihkan. Dalam Taurat terkandung hukum untuk menyelesaikan perselisihan mereka. Namun sebagian dari mereka berpaling dari seruan yang ditujukan kepada mereka, padahal mereka tahu bahwa seruan itu benar. Mereka enggan untuk mendengarkan. Mereka telah keliru dengan menganggap bahwa mereka hanya akan merasakan sedikit siksa neraka saja. Ayat ini turun ketika orang-orang Yahudi mengklaim bahwa Nabi Ibrahim adalah Yahudi. Maka Rasul menjawab : Kemarilah, lihatlah kembali pada Taurat, Taurat telah ada di tangan kami dan juga kalian, Kemudian Allah menurukan ayat ini dari awal hingga akhir ayat berikutnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidakkah kamu memperhatikan} mengetahui {orang-orang yang telah diberi bagian kitab?} orang-orang Yahudi yang diberi yang diberi bagian dari kitab Taurat {Mereka diajak pada kitab Allah untuk memutuskan} untuk memutuskan perkara {di antara mereka, kemudian segolongan dari mereka berpaling} berpaling {dan mereka adalah orang-orang yang menolak"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "23-25. Maksudnya, tidakkah anda perhatikan dan heran terhadap mereka, “orang-orang yang telah diberi bagian yaitu al-Kitab (Taurat)”, dan “mereka diseru kepada kitab Allah” yang membenarkan apa yang diturunkan Allah kepada Rasul-rasulNya, “kemudian sebagian dari mereka berpaling, dan mereka selalu membelakangi” dari mengikuti kebenaran. Seolah-olah dikatakan, apa pendorong mereka berpaling seperti itu, padahal mereka adalah orang-orang yang paling berhak untuk mengikuti dan paling mengetahui hakikat dari apa yang dibawa oleh nabi Muhammad? Lalu Allah menyebutkan dua sebab dari hal itu: Pertama, rasa aman dan persaksian mereka yang batil lagi diri mereka sendiri akan keselamatan dan bahwa neraka itu tidaklah akan menyentuk mereka kecuali hanya beberapa waktu saja yang mereka tentukan menurut hawa nafsu mereka sendiri yang rusak. Seolah-olah pengaturan kepemilikan kembali kepada mereka, di mana mereka berkata, \"Dan mereka (Yahudi dan Nasrani) berkata: “Sekali-kali tidak akan masuk surga kecuali orang-orang (yang beragama) Yahudi atau Nasrani”. QS- Al-Baqarah: 111- Telah diketahui bahwa hal ini merupakan angan-angan kosong yang batil secara syari maupun akal. Kedua, bahwasanya mereka ketika mendustakan ayat-ayat Allah dan membuat kebohongan atasnya, setan menghiasi perbuatan-perbuatan mereka yang buruk, dan mereka terpedaya oleh hal tersebut, hingga Nampak oleh mereka bahwa itu merupakan sesuatu yang benar, (dan itu adalah) sebagai suatu hukuman atas keberpalingan mereka dari kebenaran, oleh karena itu, bagaimanakah kondisi mereka ketika Allah mengumpulkan mereka pada Hari Kiamat nanti? Di mana Allah akan memberikan balasan akan perbuatan manusia dan berlakulah keadilan Allah terhadap hamba-hambaNya. Saat itu tidaklah perlu ditanya lagi tentang siksaan yang akan mereka rasakan, kebaikan dan pahala tidak mungkin didapatkan. Dan itu adalah karena tindakan yang diperbuat oleh tangan mereka sendiri, dan tidaklah Tuhanmu itu berlaku zhalim terhadap hamba-hambaNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 23: Tidakkah engkau fikirkan (kejahatan) orang-orang yang diberi sebagian daripada Kitab? Diajak mereka kepada kitab Allah, supaya (Kitab) itu memberi keputusan antara mereka, kemudian, sebagian daripada mereka berpaling, padahal mereka membelakangi (kebenaran)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala mengabarkan tentang keadaan ahlul kitab yang telah mendapatkan nikmat-Nya berupa kitab-Nya, di mana hal tersebut mengharuskan mereka menjadi manusia yang paling lurus dan lebih mudah tunduk kepada hukum-hukum-Nya, namun kenyataannya saat mereka diajak mengikuti hukum yang ada dalam kitab Allah, mereka malah berpaling badannya dan berpaling pula hatinya. Dalam ayat ini, terdapat peringatan agar kita tidak berbuat seperti yang mereka lakukan sehingga kita mendapat celaan seperti halnya mereka dan mendapatkan siksa seperti mereka. Bahkan yang wajib dilakukan oleh setiap orang saat dipanggil kepada Allah dan rasul-Nya adalah mendengar, taat dan tunduk atau \"sami'naa wa atha'naa\". Kemudian pada ayat setelahnya diterangkan sebab yang membuat mereka seperti itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 23",
    "description": "Setelah pada ayat sebelumnya dijelaskan beberapa perilaku buruk kaum yahudi, ayat ini kembali menjelaskan perilaku buruk mereka lainnya. Tidakkah engkau memperhatikan bagaimana sikap dan respons orang-orang yang telah diberi bagian kitab taurat' mereka diajak berpegang pada kitab Allah, baik yang tertera pada Al-Qur'an maupun kitab mereka sendiri, taurat, untuk memutuskan perkara yang diperselisihkan di antara mereka sendiri, kemudian sebagian dari mereka berpaling seraya menolak kebenaran tersebut, disebabkan oleh kedengkian dan permusuhan mereka berani melakukan hal itu adalah karena mereka berkata dengan penuh keyakinan, api neraka tidak akan menyentuh kami kecuali beberapa hari saja yang selanjutnya akan diganti oleh orang islam. Mereka, kaum yahudi, telah terpedaya oleh keyakinan mereka dalam memahami ajaran agama mereka, oleh apa yang se-cara sengaja mereka ada-adakan sendiri dengan menyimpangkan ajaran yang sebenarnya."
  }
]