[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Menyimpangnya mereka dari kebenaran sebabnya adalah adanya keyakinan rusak pada diri ahli kitab bahwa sesungguhnya mereka tidak akan disiksa kecuali beberapa hari yang sebentar saja, dan keyakinan ini mendorong mereka untuk bersikap lancang kepada Allah dan menghinakan agamaNya, dan terus menerus pada ajaran agama mereka yang batil yang dengannya mereka menipu diri mereka sendiri."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. Penolakan dan keengganan menerima kebenaran itu terjadi karena mereka merasa bahwa api neraka tidak akan menyentuh mereka kelak pada hari kiamat kecuali beberapa hari saja, kemudian mereka akan masuk ke dalam surga. Perasaan semacam itu -yang mereka buat-buat secara dusta- mendorong mereka untuk berani menentang Allah dan agama-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "24-25. keberpalingan mereka dari kebenaran akibat klaim mereka bahwa mereka tidak akan diazab kecuali beberapa hari saja. Sungguh mereka telah menipu diri mereka sendiri dengan kedustaan ini. Bagaimana keadaan mereka di hari kebangkitan yang kejadiannya tidak diragukan, di saat setiap jiwa telah mendapat balasan yang adil atas perbuatannya tanpa dizalimi sedikitpun? Ibnu ‘Asyur berkata: “kata {كيف} di sini merupakan khabar dari mubtada’ mahdzuf yang jenisnya dapat diketahui dari konteks kalimatnya. Dan {إذا} merupakan dharaf nashab dengan amal pada madzrufnya, yaitu yang ada pada {كيف} yang bermakna pertanyaan hinaan, sebagaimana pada kalimat: “bagaimana jika kamu bertemu dengan musuh?” (at-Tahrir wa at-Tanwir: 3/66). Abu Hurairah berkata: “Setelah Khaibar ditakhlukkan, Rasulullah mendapat hadiah daging kambing yang telah diberi racun, maka Rasulullah bersabda: “kumpulkanlah orang-orang Yahudi yang tadi di sini.” Maka dikumpulkanlah mereka, lalu Rasulullah bersabda: “Aku akan bertanya kepada kalian, apakah kalian akan menjawabnya dengan jujur?” Mereka berkata: “Ya”. Rasulullah bertanya: “Siapa ayah kalian?” Mereka menjawab: “si anu” Rasulullah menanggapi: “Kalian bohong, ayah kalian adalah si anu.” Mereka menjawab: “Kau benar”. Rasulullah bertanya kembali: “Apakah kalian akan menjawab dengan jujur jika aku bertanya sesuatu?” Mereka menjawab: “Ya wahai Abu al-Qasim, jika kami bohong kamu dapat mengetahui kebohongan kami, sebagaimana mengetahui kebohongan kami saat menjawab nama ayah kami”. Rasulullah bertanya kepada mereka: “Siapakah penghuni neraka?” Mereka menjawab: “Kami akan masuk neraka sebentar, kemudian kalian akan menggantikan kami di neraka.” Maka Rasulullah bersabda: “Tetaplah kalian di dalamnya, demi Allah kami tidak akan menggantikan kalian di neraka.” Kemudian Beliau kembali bertanya: ““Apakah kalian akan menjawab dengan jujur jika aku bertanya sesuatu?” Mereka menjawab: “Ya wahai Abu al-Qasim.” Beliau bertanya: “Apakah kalian telah meletakkan racun pada daging kambing ini?” Mereka menjawab: “Ya.” Rasulullah bertanya: “Apa yang mendorong kalian berbuat hal ini?” Mereka menjawab: “Jika kau adalah pembohong -yang mengaku sebagai nabi maka kau akan memakannya- sehingga kami akan terlepas dari kebohonganmu, dan jika kau benar seorang nabi maka racun itu tidak akan membahayakanmu.” (Shahih no. 3169, jizyah dan muwada’ah, bab jika orang-orang musyrik membuat tipudaya terhadap orang-orang beriman apakah mereka dimaafkan?)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "24. ذٰلِكَ ( Hal itu) Yakni menolak untuk menerima hukum Allah adalah disebabkan mereka berkata : قَالُوا۟ لَن تَمَسَّنَا النَّارُ إِلَّآ أَيَّامًا مَّعْدُودٰتٍ ۖ ( mereka mengaku: “Kami tidak akan disentuh oleh api neraka kecuali beberapa hari yang dapat dihitung) Dan ini adalah lama mereka dalam menyembah anak lembu. وَغَرَّهُمْ فِى دِينِهِم مَّا كَانُوا۟ يَفْتَرُونَ (Mereka diperdayakan dalam agama mereka oleh apa yang selalu mereka ada-adakan ) Yakni yang berupa kebohongan-kebohongan yang termasuh diantaranya adalah perkataan ini -mereka tidak masuk neraka kecuali beberapa hari-, dan misal lainnya adalah perkataan mereka ‘kita adalah anak-anak Allah dan orang-orang terkasih-Nya’. Mereka pun mempercayai kebohongan-kobohongan yang mereka buat dan para pengikut mereka juga mempercayainya sehingga menjerumuskan mereka kedalam kemurkaan Allah."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Ayat ini menceritakan keadaan dari kebanyakan ahli bathil, mereka mengada-adakan kebathilan itu dari diri mereka sendiri kemudian mereka juga yang membenarkannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "24 Klaim penolakan atas ketetapan Allah itu adalah karena kekeliruan pengakuan mereka: “Kami tidak akan disentuh oleh api neraka kecuali hanya selama beberapa hari yang dapat dihitung, yaitu 40 hari saja. Hitungan hari ketika mereka menyembah anak sapi”. Hari dimana mereka telah mengkhianati dan mendustakan agama mereka, diantaranya adalah perkataan mereka: Kami adalah putera-putera dan kekasih Allah, sehingga kami tidak akan disiksa kecuali hanya sedikit."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Demikian itu disebabkan mereka berkata, “Kami tak akan tersentuh api neraka, kecuali beberapa hitungan hari saja.” Mereka teperdaya} tertipu {dalam agama mereka oleh apa yang selalu mereka ada-adakan} mereka berselisih tentang dusta terhadap Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "23-25. Maksudnya, tidakkah anda perhatikan dan heran terhadap mereka, “orang-orang yang telah diberi bagian yaitu al-Kitab (Taurat)”, dan “mereka diseru kepada kitab Allah” yang membenarkan apa yang diturunkan Allah kepada Rasul-rasulNya, “kemudian sebagian dari mereka berpaling, dan mereka selalu membelakangi” dari mengikuti kebenaran. Seolah-olah dikatakan, apa pendorong mereka berpaling seperti itu, padahal mereka adalah orang-orang yang paling berhak untuk mengikuti dan paling mengetahui hakikat dari apa yang dibawa oleh nabi Muhammad? Lalu Allah menyebutkan dua sebab dari hal itu: Pertama, rasa aman dan persaksian mereka yang batil lagi diri mereka sendiri akan keselamatan dan bahwa neraka itu tidaklah akan menyentuk mereka kecuali hanya beberapa waktu saja yang mereka tentukan menurut hawa nafsu mereka sendiri yang rusak. Seolah-olah pengaturan kepemilikan kembali kepada mereka, di mana mereka berkata, \"Dan mereka (Yahudi dan Nasrani) berkata: “Sekali-kali tidak akan masuk surga kecuali orang-orang (yang beragama) Yahudi atau Nasrani”. QS- Al-Baqarah: 111- Telah diketahui bahwa hal ini merupakan angan-angan kosong yang batil secara syari maupun akal. Kedua, bahwasanya mereka ketika mendustakan ayat-ayat Allah dan membuat kebohongan atasnya, setan menghiasi perbuatan-perbuatan mereka yang buruk, dan mereka terpedaya oleh hal tersebut, hingga Nampak oleh mereka bahwa itu merupakan sesuatu yang benar, (dan itu adalah) sebagai suatu hukuman atas keberpalingan mereka dari kebenaran, oleh karena itu, bagaimanakah kondisi mereka ketika Allah mengumpulkan mereka pada Hari Kiamat nanti? Di mana Allah akan memberikan balasan akan perbuatan manusia dan berlakulah keadilan Allah terhadap hamba-hambaNya. Saat itu tidaklah perlu ditanya lagi tentang siksaan yang akan mereka rasakan, kebaikan dan pahala tidak mungkin didapatkan. Dan itu adalah karena tindakan yang diperbuat oleh tangan mereka sendiri, dan tidaklah Tuhanmu itu berlaku zhalim terhadap hamba-hambaNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 24: Yang demikian itu lantaran mereka berkata: \"Kami tidak akan disentuh oleh api melainkan beberapa hari saja\", karena mereka telah ditipu di dalam (urusan) agama mereka, oleh (khabar) yang (ketua-ketua) mereka adakan sendiri."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sebab mereka berpaling dari kebenaran, berani menentang Allah dan meremehkan agama-Nya adalah karena perkataan mereka yang disebutkan di atas."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 24",
    "description": "Mereka berani melakukan hal itu adalah karena mereka berkata dengan penuh keyakinan, api neraka tidak akan menyentuh kami kecuali beberapa hari saja yang selanjutnya akan diganti oleh orang islam. Mereka, kaum yahudi, telah terpedaya oleh keyakinan mereka dalam memahami ajaran agama mereka, oleh apa yang se-cara sengaja mereka ada-adakan sendiri dengan menyimpangkan ajaran yang sebenarnya. Pada ayat sebelumnya disebutkan bahwa kaum yahudi berani menyepelekan azab Allah dengan mengingkari kebenaran yang dibawa rasulullah, barangkali karena mereka masih hidup di dunia, maka bagaimana jika nanti mereka, kaum yahudi itu, kami kumpulkan pada hari kiamat yang tidak diragukan terjadinya, dan pada hari itu juga kepada setiap jiwa diberi balasan yang sempurna atau setimpal sesuai dengan apa yang telah dikerjakannya, jika baik akan mendapatkan pahala dan jika buruk akan memperloleh siksa, dan mereka tidak akan dizalimi, yakni dirugikan atau dikurangi sedikit pun dari balasannya'."
  }
]