[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ucapkanlah olehmu (wahai nabi) sambil menghadap kepada Tuhanmu dengan mengucapkan doa berikut “wahai Dzat yang memiliki seluruh kerajaan,Engkau yang memberikan kerajaan, harta dan kekuasaan di bumi bagi orang-orang yang Engkau kehendaki dari hamba-hamba Mu, dan Engkau pula yang mengambil kerajaan dari orang-orang yang Engkau kehendaki, dan Engkau memberikan kemuliaan di dunia dan di akhirat bagi siapa saja yang Engkau kehendaki, dan Engkau menjadikan kehinaan kepada orang yang Engkau kehendaki, di tangan Mu lah segala kebaikan, Sesungguhnya Engkau lah satu-satunya Dzat yang maha kuasa atas segala sesuatu. Pada ayat ini terdapat penetapan sifat tangan bagi Allah sesuai dengan keagungan Allah"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "26. Ucapkanlah -wahai Rasul- untuk memuji dan mengagungkan Rabbmu, “Ya Allah, Engkaulah pemilik semua kerajaan yang ada di dunia dan di akhirat. Engkau memberikan kerajaan kepada siapa saja yang Engkau kehendaki, dan mencabutnya dari siapa saja yang Engkau kehendaki. Engkau memuliakan siapa saja yang Engkau kehendaki, dan menghinakan siapa saja yang Engkau kehendaki. Semua itu berdasarkan kebijaksanaan dan keadilan-Mu. Hanya di tangan-Mu lah seluruh kebajikan. Dan Engkau Mahakuasa atas segala sesuatu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "26-27. Allah menunjukkan kepada Rasulullah dan orang-orang beriman cara berdoa dan mengagungkan-Nya, kemudian mereka bermunajat: “Ya Allah, Wahai pemilik segala kekuasaan, Engkau mengaruniakan kekuasaan dan harta kepada hamba-Mu yang Engkau kehendaki dan Engkau yang mengambilnya, Engkau mengangkat dan menurunkan derajat hamba-Mu yang Engkau kehendaki. Di tangan-Mu semata segala kebaikan, Engkau mampu melakukan segalanya, tidak ada selain-Mu yang mampu melakukannya. Engkau mengurangi waktu malam dengan memanjangkan waktu siang, dan mengurangi waktu siang dengan memanjangkan waktu malam. Engkau mengeluarkan makhluk hidup dari sesuatu yang mati seperti mengeluarkan tanaman hijau dari biji yang kering, dan Engkau mengeluarkan sesuatu yang mati dari makhluk hidup seperti mengeluarkan biji yang kering dari tanaman hijau. Dan Engkau mengaruniakan harta yang tak terhingga kepada yang Engkau kehendaki."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "26. قُلِ اللَّـهُمَّ مٰلِكَ الْمُلْكِ ( Katakanlah: “Wahai Tuhan Yang mempunyai kerajaan) Yakni Ya Allah yang memiliki kerajaan seluruhnya, تُؤْتِى الْمُلْكَ مَن تَشَآءُ (Engkau berikan kerajaan kepada orang yang Engkau kehendaki ) Yakni yang Engkau kehendaki untuk Engkau beri. وَتَنزِعُ الْمُلْكَ مِمَّن تَشَآءُ (dan Engkau cabut kerajaan dari orang yang Engkau kehendaki ) Yakni mencabut kerajaan tersebut darinya. وَتُعِزُّ مَن تَشَآءُ ( Engkau muliakan orang yang Engkau kehendaki) Yakni Engkau berikan kemenangan dan kekuasaan kepada yang Engkau kehendaki. وَتُذِلُّ مَن تَشَآءُ ۖ ( dan Engkau hinakan orang yang Engkau kehendaki) Yakni yang Engkau jadikan menyerah atas paksaan. بِيَدِكَ الْخَيْرُ ۖ( Di tangan Engkaulah segala kebajikan) Dan bukan ditangan yang selain-Mu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "26 Katakanlah wahai Nabi: “Wahai Tuhan Yang mempunyai kerajaan di dunia dan akhirat, Engkau berikan kerajaan kepada hamba-Mu yang Engkau kehendaki dan Engkau cabut kerajaan dari hamba yang Engkau kehendaki. Engkau muliakan orang yang Engkau kehendaki dan Engkau hinakan orang yang Engkau kehendaki. Di tangan Engkaulah segala kebajikan, bukan di tangan selain Engkau. Sesungguhnya Engkau Maha Kuasa atas segala sesuatu. Qatadah berkata: DIceritakan kepada kami bahwa Rasul berdoa agar Allah menjadikan kerajaan Persia dan Romawi menjadi umatnya. Kemudian Allah menurunkan ayat ini."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah, “Wahai Allah, Pemilik kekuasaan, Engkau memberi} memberi {kekuasaan kepada siapa pun yang Engkau kehendaki dan Engkau cabut} merenggut {kekuasaan dari siapa yang Engkau kehendaki. Engkau muliakan siapa saja yang Engkau kehendaki dan Engkau hinakan siapa saja yang Engkau kehendaki. Di tanganMulah segala kebajikan. Sesungguhnya Engkau Maha kuasa atas segala sesuatu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "26-27. Pada dasarnya Allah memerintahkan kepada NabiNya dan orang lain yang mengikuti (beliau) agar menyampaikan dari Tuhannya secara tegas akan keesaan Nya dalam mengatur segala perkara, mengontrol seluruh alam, baik langit maupun bumi, dan juga tentang hakNya untuk dikhususkan dengan kekuasaan yang mutlak dan pengaturan yang bijaksana, dan bahwasanya Dia memberikan kekuasaan kepada siapa yang Dia kehendaki, dan mencabut kekuasaan itu dari siapa yang Dia kehendaki, Dia memuliakan siapa yang dikehendakiNya dan menghinakan siapa yang dikehendakiNya. Dan itu tidak berdasarkan angan-angan ahli kitab atau selain mereka, namun perkara itu semuanya adalah di Tangan Allah, dan pengaturan berada di bawah kekuasaanNya. Maka tidak ada yang dapat menolaknya dalam pengaturanNya tersebut, tidak pula ada penolong untukNya dalam ketetapan takdirNya. Dan bahwasanya sebagaimana Dia adalah Pengatur perputaran hari (kemenangan) di antara manusia, Dia pun Pengatur akan masa itu sendiri, di mana Dia memasukkan siang ke dalam malam dan memasukkan malam kedalam siang. Artinya Allah memasukkan yang ini kedalam yang itu dan yang ini menempati posisi yang itu, Dia menambah yang ini apa yang kurang dari yang itu agar dengan hal itu semua tegaklah kemaslahatan makhluk-makhlukNya. Dia mengeluarkan yang hidup dari yang mati sebagaimana Dia mengeluarkan tumbuh-tumbuhan, pepohonan yang bermacam-macam dari biji-biji benih, orang Mukmin dari orang kafir, orang hidup dari yang mati, sebagaimana juga Allah mengeluarkan biji-bijian, benih, tanaman, pepohonan dan telur dari burung. Dia-lah yang mengeluarkan segala bentuk benda-benda yang berlawanan sebagiannya dari sebagian yang lain, dan sesungguhya seluruh unsur-unsur yang ada di alam ini patuh terhadapNya. Dan FirmanNya, “Di TanganMu-lah segala kebaikan,” artinya segala kebajikan itu berasal dariMu dan tidaklah ada yang mendatangkan kebaikan dan karunia kecuali Allah. Sedangkan keburukan tidaklah dinisbatkan kepada Allah, baik secara sifat maupun nama dan tidak pula perbuatan, akan tetapi termasuk dalam tindakan-tindakan makhlukNYa dan di bawah ketetapan dan takdirNya. Kebaikan dan keburukan termasuk dalam Qadha dan Qadar. Dan tidak ada sesuatu pun yang terjadi dalam kerajaanNYa kecuali yang Dia kehendaki. Akan tetapi hal yang buruk itu tidaklah dinisbatkan kepada Allah, maka tidaklah dikatakan, “di TanganMu-lah segala kebaikan dan keburukan,” namun seharusnya dikatakan, di TanganMu lah segala kebaikan sebagaimana yang telah dikatakan oleh Allah dan oleh RasulNya. Adapun kesimpulan temuan yang dikatakan oleh sebagian ahli tafsir, di mana mereka berkata, “Demikian pula keburukan, berada di TanganNya,” maka itu adalah sebuah kesalahan yang murni. Pandangan mereka di dalam penyebutan itu meniadakan Qadha dan QadarNya yang umum. Dan bantahan terhadap pandangan ini, adalah apa yang telah kami jelaskan secara rinci. Dan FirmanNYa, “Dan Engkau beri rizki siapa yang Engkau kehendaki tanpa hisab (batas).” Allah telah menyebutkan pada ayat yang lain sebab-sebab yang mengakibatkan datangnya rizki Allah, seperti FirmanNya, \"Barangsiapa bertakwa kepada Allah niscaya Dia akan mengadakan baginya jalan keluar. Dan memberinya rezeki dari arah yang tiada disangka-sangkanya. Dan barangsiapa yang bertawakkal kepada Allah niscaya Allah akan mencukupkan (keperluan)nya\" QS-Ath-Thalaq: 2-3 Karena itu wajib atas manusia agar tidak memohon rizki kecuali dari Allah, lalu mereka berusaha meraihnya dengan melakukan sebab-sebabnya yang telah dimudahkan oleh Allah dan dibolehkanNYa."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 26: Katakanlah: \"Hai Tuhan yang memiliki (sekalian) kekuasaan! Engkau beri kerajaan kepada siapa yang Engkau kehendaki, dan Engkau cabut kerajaan dari siapa yangengkau kehendaki dan Engkau muliakan siapa yang Engkau kehendaki dan Engkau hinakan siapa yang Engkau kchendaki. DitanganMu-lah ada (sekalian) kebaikan karena sesungguhnya Engkau berkuasa atas tiap-tiap suatu.\""
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Di dalam ayat ini terdapat isyarat bahwa Allah Subhaanahu wa Ta'aala akan mencabut kekuasaan para kisra dan kaisar serta kekuasaan orang-orang yang mengikuti jejak mereka, dan akan memberikan kekuasaan itu kepada umat Rasulullah shallallahu 'alaihi wa sallam, dan hal itu telah terjadi falillahil hamd. Oleh karena itu, memperoleh kekuasaan atau tercabutnya kekuasaan mengikuti kehendak Allah Subhaanahu wa Ta'aala. Namun yang demikian, tidaklah menafikan sunnatullah, berupa sebab-sebab kauniyyah (di alam semesta) dan diniyyah (agama) yang menjadi sebab tetapnya kerajaan, memperolehnya kerajaan atau sebab hilangnya kerajaan. Semua itu terjadi dengan kehendak Allah, sebab tidaklah mewujudkan apa-apa secara sendiri, bahkan semua sebab mengikuti qadha' dan qadar Allah. Di antara sebab yang dijadikan Allah sebagai sebab memperoleh kekuasaan adalah iman dan amal shalih, bersatunya kaum muslimin, mereka memiliki persiapan yang mereka sanggupi, sabar dan tidak bertengkar (lihat surat An Nur: 55, Al Anfal: 45-46 dan 62-63). Oleh karena itu, sebab utama runtuhnya negara Islam adalah meninggalkan agamanya dan berpecah belah. Karena mentaati-Mu. Karena bermaksiat kepada-Mu. Di dalam ayat ini menetapkan sifat Tangan sesuai yang layak bagi Allah Subhaanahu wa Ta'aala. Di antara bukti kekuasaan-Nya adalah apa yang disebutkan pada ayat setelahnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 26",
    "description": "Setelah ayat-ayat sebelumnya menjelaskan tentang ketidakmampuan seseorang untuk menghindar dari keniscayaan hari akhir sebagai hari pembalasan, hari tersingkapnya rahasia, hari terkuaknya segala kebohongan, maka ayat berikut menjelaskan tentang kemahakuasaan Allah yang lain di dunia. Katakanlah, wahai nabi Muhammad, wahai tuhan pemilik kekuasaan, engkau berikan kekuasaan kepada siapa pun yang engkau kehendaki, dan engkau cabut kekuasaan dari siapa pun yang engkau kehendaki. Engkau muliakan siapa pun yang engkau kehendaki dan engkau hinakan siapa pun yang engkau kehendaki. Di tangan engkaulah segala kebajikan. Sungguh, engkau mahakuasa atas segala sesuatu. Tidak seorang pun mampu mengangkat derajat orang lain dan memuliakannya kecuali atas izin-Nya, dan tidak seorang pun mampu menjatuhkan kekuasaan orang lain dan menghinakannya kecuali atas izin-Nya. Ayat berikut ini juga bukti kekuasaan Allah yang lain. Engkau masukkan malam ke dalam siang sehingga siang menjadi lebih panjang daripada malam, dan engkau masukkan siang ke dalam malam sehingga malam lebih panjang daripada siang. Dan engkau keluarkan yang hidup dari yang mati seperti ayam dari telur, tumbuh-tumbuhan dari biji-bijian, dan engkau keluarkan yang mati dari yang hidup seperti keluarnya telur dari ayam dan biji-bijian. Inilah siklus kehidupan yang engkau atur sedemikian rupa sesuai dengan kekuasaan-Mu. Dan dengan kekuasaanmu juga, engkau berikan rezeki kepada siapa yang engkau kehendaki baik yang taat maupun yang tidak taat, baik yang mukmin maupun yang kafir, tanpa perhitungan. Jika demikian, maka tidak seorang pun yang mampu mempertanyakan karunia yang diberikan kepada siapa pun, baik berupa kekuasaan, kekayaan, kemudahan mencari rezeki, dan lain-lain."
  }
]