[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan diantara bukti-bukti kuasa Mu adalah bahwa sesungguhnya engkau memasukkan malam kedalam siang, dan memasukkan siang kedalam malam, Maka menjadikan yang ini lebih lama dan yang lain menjadi lebih pendek, dan Dia mengeluarkan yang hidup dari benda mati yang tidak ada unsur kehidupan sama sekali padanya, seperti mengeluarkan tanaman dari biji, dan dilahirkannya orang mukmin dari orang kafir, dan Dia mengeluarkan yang mati dari yang hidup, seperti mengeluarkan telur dari seekor ayam, dan Engkau memberikan rezeki kepada siapa saja yang Engkau kehendaki dari makhluk Mu tanpa hitungan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "27. Salah satu wujud kekuasaan-Mu ialah Engkau memasukkan malam ke dalam siang sehingga waktunya menjadi panjang, dan memasukkan siang ke dalam malam sehingga waktunya menjadi panjang. Engkau mengeluarkan sesuatu yang hidup dari sesuatu yang mati. Seperti mengeluarkan orang mukmin dari orang kafir dan mengeluarkan tanaman dari biji. Dan Engkau mengeluarkan sesuatu yang mati dari sesuatu yang hidup. Seperti mengeluarkan orang kafir dari orang mukmin, dan mengeluarkan telur dari induk ayam. Dan Engkau memberikan rezeki yang luas kepada siapa saja yang Engkau kehendaki tanpa perkiraan dan hitungan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "27. تُولِجُ الَّيْلَ فِى النَّهَارِ وَتُولِجُ النَّهَارَ فِى الَّيْلِ ۖ ( Engkau masukkan malam ke dalam siang dan Engkau masukkan siang ke dalam malam) Yakni Engkau memasukkan kekurangan dari salah satunya kedalam yang lain, yakni dengan perbedaan panjang pendek waktu malam dan siang tergantung musim dan keadaan. Sehingga apabila salah satunya berkurang maka yang lainnya akan bertambah, dan lama waktu keduanya adalah 24 jam tak ada perbedaan di musim apapun dan di tempat manapun. وَتُخْرِجُ الْحَىَّ مِنَ الْمَيِّتِ وَتُخْرِجُ الْمَيِّتَ مِنَ الْحَىِّ ۖ ( Engkau keluarkan yang hidup dari yang mati, dan Engkau keluarkan yang mati dari yang hidup) Yakni Allah mengeluarkan seseorang yang hidup dari air mani yang mati, kemudian mengeluarkan air mani yang mati dari seseorang yang hidup, lalu mengeluarkan seseorang yang hidup dari air mani yang mati dan begitu seterusnya. Dan Allah mengeluarkan seekor ayam dari telur dan telur dari ayam, begitu juga pohon kurma dari bijinya dan biji kurma dari pohonnya. Dan pendapat lain mengatakan makna dari ayat ini adalah mengeluarkan orang mukmin dari orang kafir dan orang kafir dari orang mukmin. Ibnu Jarir meriwayatkan bahwa seorang wanita shalihah mendatangi Rasulullah, maka beliau bertanya: siapakah ini? Wanita ini menjawab: Saya Khalidah binti Aswad. Maka Rasulullah bersabda: “Maha Suci Allah yang telah mengeluarkan yang hidup dari yang mati”. Dan ayah dari wanita ini dulunya adalah kafir."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "27 Engkau masukkan sebagaian malam ke dalam siang sehingga malam menjadi pendek dan siang menjadi panjang. Dan Engkau masukkan sebagian siang ke dalam malam sehingga malam menjadi panjang dan siang menjadi pendek. Dan juga cuaca dan musim yang menaungi, jumlah siang dan malam yang mencapai 24 jam. Engkau keluarkan yang hidup dari yang mati seperti tumbuhan dan hewan dari debu, pepohonan dari biji-bijian, atau juga Engkau keluarkan orang alim dari orang bodoh, atau juga mukmin dari kafir., Engkau keluarkan yang mati dari yang hidup, seperti biji-bjian dari pepohonan, susu dari hewan, kebodohan dari orang-orang alim atau kekufuran dari orang beriman. Dan Engkau beri rezeki siapapun yang Engkau kehendaki tanpa perhitungan dan batas”."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Engkau masukkan} masukkan {malam ke dalam siang dan Engkau masukkan siang ke dalam malam. Engkau keluarkan yang hidup dari yang mati dan Engkau keluarkan yang mati dari yang hidup. Engkau berikan rezeki kepada siapa yang Engkau kehendaki tanpa perhitungan.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "26-27. Pada dasarnya Allah memerintahkan kepada NabiNya dan orang lain yang mengikuti (beliau) agar menyampaikan dari Tuhannya secara tegas akan keesaan Nya dalam mengatur segala perkara, mengontrol seluruh alam, baik langit maupun bumi, dan juga tentang hakNya untuk dikhususkan dengan kekuasaan yang mutlak dan pengaturan yang bijaksana, dan bahwasanya Dia memberikan kekuasaan kepada siapa yang Dia kehendaki, dan mencabut kekuasaan itu dari siapa yang Dia kehendaki, Dia memuliakan siapa yang dikehendakiNya dan menghinakan siapa yang dikehendakiNya. Dan itu tidak berdasarkan angan-angan ahli kitab atau selain mereka, namun perkara itu semuanya adalah di Tangan Allah, dan pengaturan berada di bawah kekuasaanNya. Maka tidak ada yang dapat menolaknya dalam pengaturanNya tersebut, tidak pula ada penolong untukNya dalam ketetapan takdirNya. Dan bahwasanya sebagaimana Dia adalah Pengatur perputaran hari (kemenangan) di antara manusia, Dia pun Pengatur akan masa itu sendiri, di mana Dia memasukkan siang ke dalam malam dan memasukkan malam kedalam siang. Artinya Allah memasukkan yang ini kedalam yang itu dan yang ini menempati posisi yang itu, Dia menambah yang ini apa yang kurang dari yang itu agar dengan hal itu semua tegaklah kemaslahatan makhluk-makhlukNya. Dia mengeluarkan yang hidup dari yang mati sebagaimana Dia mengeluarkan tumbuh-tumbuhan, pepohonan yang bermacam-macam dari biji-biji benih, orang Mukmin dari orang kafir, orang hidup dari yang mati, sebagaimana juga Allah mengeluarkan biji-bijian, benih, tanaman, pepohonan dan telur dari burung. Dia-lah yang mengeluarkan segala bentuk benda-benda yang berlawanan sebagiannya dari sebagian yang lain, dan sesungguhya seluruh unsur-unsur yang ada di alam ini patuh terhadapNya. Dan FirmanNya, “Di TanganMu-lah segala kebaikan,” artinya segala kebajikan itu berasal dariMu dan tidaklah ada yang mendatangkan kebaikan dan karunia kecuali Allah. Sedangkan keburukan tidaklah dinisbatkan kepada Allah, baik secara sifat maupun nama dan tidak pula perbuatan, akan tetapi termasuk dalam tindakan-tindakan makhlukNYa dan di bawah ketetapan dan takdirNya. Kebaikan dan keburukan termasuk dalam Qadha dan Qadar. Dan tidak ada sesuatu pun yang terjadi dalam kerajaanNYa kecuali yang Dia kehendaki. Akan tetapi hal yang buruk itu tidaklah dinisbatkan kepada Allah, maka tidaklah dikatakan, “di TanganMu-lah segala kebaikan dan keburukan,” namun seharusnya dikatakan, di TanganMu lah segala kebaikan sebagaimana yang telah dikatakan oleh Allah dan oleh RasulNya. Adapun kesimpulan temuan yang dikatakan oleh sebagian ahli tafsir, di mana mereka berkata, “Demikian pula keburukan, berada di TanganNya,” maka itu adalah sebuah kesalahan yang murni. Pandangan mereka di dalam penyebutan itu meniadakan Qadha dan QadarNya yang umum. Dan bantahan terhadap pandangan ini, adalah apa yang telah kami jelaskan secara rinci. Dan FirmanNYa, “Dan Engkau beri rizki siapa yang Engkau kehendaki tanpa hisab (batas).” Allah telah menyebutkan pada ayat yang lain sebab-sebab yang mengakibatkan datangnya rizki Allah, seperti FirmanNya, \"Barangsiapa bertakwa kepada Allah niscaya Dia akan mengadakan baginya jalan keluar. Dan memberinya rezeki dari arah yang tiada disangka-sangkanya. Dan barangsiapa yang bertawakkal kepada Allah niscaya Allah akan mencukupkan (keperluan)nya\" QS-Ath-Thalaq: 2-3 Karena itu wajib atas manusia agar tidak memohon rizki kecuali dari Allah, lalu mereka berusaha meraihnya dengan melakukan sebab-sebabnya yang telah dimudahkan oleh Allah dan dibolehkanNYa."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 27: \"Engkau masukkan malam pada siang, dan Engkau masukkan siang pada malam dan Engkau mengeluarkan yang hidup dari yang mati, dan Engkau mengeluarkan yang mati dari yang hidup dan Engkau memberi rezeki kepada siapa yang Engkau kehendaki dengan tidak berkira.\""
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Seperti keluarnya tumbuhan dari biji, munculnya manusia dari mani atau keluarnya anak ayam dari telur. Misalnya keluarnya telur dari ayam. Ada pula yang mengartikan bahwa pergiliran kekuasaan di antara bangsa-bangsa dan timbul tenggelamnya sesuatu umat adalah menurut hukum Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 27",
    "description": "Ayat berikut ini juga bukti kekuasaan Allah yang lain. Engkau masukkan malam ke dalam siang sehingga siang menjadi lebih panjang daripada malam, dan engkau masukkan siang ke dalam malam sehingga malam lebih panjang daripada siang. Dan engkau keluarkan yang hidup dari yang mati seperti ayam dari telur, tumbuh-tumbuhan dari biji-bijian, dan engkau keluarkan yang mati dari yang hidup seperti keluarnya telur dari ayam dan biji-bijian. Inilah siklus kehidupan yang engkau atur sedemikian rupa sesuai dengan kekuasaan-Mu. Dan dengan kekuasaanmu juga, engkau berikan rezeki kepada siapa yang engkau kehendaki baik yang taat maupun yang tidak taat, baik yang mukmin maupun yang kafir, tanpa perhitungan. Jika demikian, maka tidak seorang pun yang mampu mempertanyakan karunia yang diberikan kepada siapa pun, baik berupa kekuasaan, kekayaan, kemudahan mencari rezeki, dan lain-lain. Setelah ayat sebelumnya menjelaskan kekuasaan Allah yang tak terbatas, yang salah satunya memberi rezeki tanpa perhitungan, maka ayat ini melarang kaum mukmin untuk menjadikan orang kafir sebagai wali. Janganlah orang-orang beriman dengan sebenar-benarnya menjadikan orang kafir, baik kafir secara akidah maupun orang yang bergelimang dalam kedurhakaan, sebagai wali, yaitu orang terdekat yang menjadi tempat menyimpan rahasia yang menyangkut kemaslahatan umum, melainkan orang-orang beriman. Barang siapa berbuat demikian, yaitu menjadikan orang kafir sebagai wali, niscaya dia tidak akan memperoleh perlindungan dan pertolongan apa pun dari Allah, kecuali apabila yang kamu lakukan itu karena untuk siasat menjaga diri dari sesuatu yang kamu takuti dari mereka, terkait dengan keselamatan dirimu dan kaum muslim. Dan Allah memperingatkan kamu akan diri, yakni siksa-Nya, dan hanya kepada Allah tempat kembali semua makhluk-Nya."
  }
]