[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah melarang kaum mukminin mengangkat kaum kafir sebagai orang-orang yang diutmakan dalam memberikan kecintaan dan pertolongan kepada mereka dengan tidak mempedulikan kaum Mukminin, barangsiapa menjadikan mereka sebagai orang-orang yang dijadikan loyalitas maka sungguh dia telah berlepas diri terhadap Allah, dan Allah juga berlepas diri terhadapnya, kecuali bila kalian berada dalam keadaan lemah lagi takut, maka sesungguhnya Allah memberikan kelonggaran bagi kalian untuk menjalin perdamaian dengan mereka untuk menghindari keburukan mereka, sampai pertahanan kalian menjadi kuat, dan Allah memperingatkan kalian dari diri Nya, maka bertakwalah kepeda Nya dan takut kepada Nya, Dan hanya kepada Allah lah tempat kembali semua makhluk untuk menghadapi perhitungan amal dan pembalasannya"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "28. Janganlah kamu -wahai orang-orang mukmin- menjadikan orang-orang kafir sebagai pemimpin-pemimpin yang kalian cintai dan kalian bela dengan meninggalkan orang-orang mukmin. Barangsiapa yang melakukan hal itu, maka ia telah berlepas diri dari Allah dan Allah pun telah berlepas diri darinya. Kecuali jika kalian berada di wilayah kekuasaan mereka sehingga kalian mencemaskan keselamatan diri kalian, maka tidak ada salahnya apabila kalian menghindari kejahatan mereka dengan menunjukkan kelembutan dalam berbicara dan keramahan dalam bersikap, dengan tetap menyimpan rasa permusuhan dengan mereka. Allah memperingatkan kalian agar takut kepada-Nya. Dan janganlah kalian menjerumuskan diri kalian ke dalam murka-Nya dengan cara melakukan perbuatan maksiat. Hanya kepada Allah sajalah tempat kembalinya seluruh makhluk di hari kiamat untuk menerima balasan atas amal perbuatan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "28. Hai orang-orang beriman, janganlah kalian menjadikan orang-orang kafir sebagai pelindung dan penolong. Barangsiapa yang menjadikan mereka demikian maka dia telah berlepas diri dari Allah, dan Allah telah berlepas diri darinya; kecuali jika kalian berada di bawah kuasa mereka sehingga kalian takut akan keselamatan kalian, maka tunjukkanlah kepada mereka kesetiaan dengan lisan kalian, dan pendamlah permusuhan terhadap mereka dalam hati, jika kalian melakukan ini maka tidak mengapa. Allah memperingatkan kalian dari-Nya agar kalian tidak melanggar perintah-Nya. Dan hanya kepada-Nya kalian kembali dan mendapat perhitungan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "28. لَّا يَتَّخِذِ الْمُؤْمِنُونَ الْكٰفِرِينَ أَوْلِيَآءَ مِن دُونِ الْمُؤْمِنِينَ ۖ (Janganlah orang-orang mukmin mengambil orang-orang kafir menjadi wali dengan meninggalkan orang-orang mukmin) Yakni dengan mencintai dan berlemah lembut kepada mereka, dan mencondongkan hati untuk memberi pertolongan kepada mereka.. وَمَن يَفْعَلْ ذٰلِكَ( Barang siapa berbuat demikian) Yakni yang menjadikan orang-orang kafir sebagai wali dan mengesampingkan orang-orang mukmin. فَلَيْسَ مِنَ اللهِ فِى شَىْءٍ (niscaya lepaslah ia dari pertolongan Allah ) Bahkan Allah meninggalkannya dalam keadaan apapun karena Allah telah berlepas diri darinya. إِلَّآ أَن تَتَّقُوا۟ مِنْهُمْ تُقَىٰةً ۗ (kecuali karena (siasat) memelihara diri dari sesuatu yang ditakuti dari mereka) Yakni kecuali memperlihatkan kecenderungan kepada mereka dengan lisan kalian akan tetapi hati kalian membanci hal itu. Dan ini dilakukan ketika kalian dalam keadaan lemah dihadapan mereka. Dari Ibnu Abbas ia berkata: Allah melarang kaum mukmin untuk berlemah lembut kepada orang-orang kafir dan menjadikan mereka orang terkhusus bagi kalian dan mencampakkan kaum mukmin, kecuali apabila orang-orang kafir berkuasa atas mereka. Maka mereka boleh menunjukkan kelembutan kepada mereka akan tetapi tetap menyelisihi mereka dalam urusan agama. Dia juga berkata: Taqiyyah dengan lisan, yakni seseorang yang dipaksa untuk mengucapkan sesuatu kemaksiatan kepada Allah lalu ia mengucapkannya karena takut keburukan dari orang tersebut, akan tetapi hatinya tetap mantap dalam keimanan, maka hal itu tidak mengapa baginya. Karena taqiyyah itu hanya di lisan. maka tidak boleh menjulurkan tangannya untuk membunuh atau melakukan dosa karena ia tidak diberi uzur untuk itu. وَيُحَذِّرُكُمُ اللهُ نَفْسَهُۥ ۗ ( Dan Allah memperingatkan kamu terhadap diri (siksa)-Nya) Yakni Allah memerintahkan agar kalian takut terhadap Dzat-Nya yang suci jika kalian"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "28 Janganlah orang-orang mukmin menjadikan orang-orang kafir sebagai penolong, dengan mencintai dan mengunggulkan mereka daripada orang-orang mukmin. Barang siapa berbuat demikian, maka hal itu jauh dari agama Allah. Sehingga lepaslah ia dari rahmat Allah, kecuali karena siasat memelihara diri dari sesuatu yang ditakuti dari mereka seperti dalam peperangan. Maka kalian boleh menjadikan mereka sebagai penolong kalian sebagai siasat untuk menghindarkan diri dari bahaya dari mereka. Dan Allah memperingatkan kamu terhadap siksa-Nya jika kalian tetap menjadikan mereka sebagai penolong kalian zahir dan batin. Dan hanya kepada Allah lah tempat kembalimu, dan akan dibalas segala amal perbuatanmu. Ayat ini turun untuk Ubadah bin Shamit yang menghendaki untuk meminta pertolongan lima ratus orang Yahudi untuk melawan musuh. Sehingga Allah memurunkan ayat ini."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Janganlah orang-orang mukmin menjadikan orang kafir sebagai para wali dengan mengesampingkan orang-orang mukmin. Siapa saja yang melakukan itu, maka hal itu sama sekali bukan dari Allah} tidak sedikit pun dari Allah {kecuali kalian takut terhadap mereka} kecuali kalian takut terhadap mereka {Allah memperingatkan kalian} memperingatkan kalian {tentang diriNya. Hanya kepada Allah tempat kembali"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "28. Ini adalah larangan Allah dan peringatan bagi kaum Mukminin agar tidak menjadikan orang-orang kafir sebagai wali-wali (pemimpin-pemimpin) mereka selain kaum Mukminin. Karena kaum Mukminin itu sebagian mereka adalah wali bagi sebagian lainnya. Dan Allah adalah wali bagi mereka. “Barangsiapa berbuat demikian”, yakni menjadikan orang-orang kafir sebagai pemimpin (pelindung dan penolong), “niscaya lepaslah ia dari pertolongan Allah,” artinya, niscaya ia terlepas dari Allah dan Allah juga berlepas diri (bara’) darinya, sebagaimana Firman Allah, \"Barangsiapa diantara kamu mengambil mereka menjadi pemimpin, maka sesungguhnya orang itu termasuk golongan mereka.\" QS -Al-Maidah:51- Dan Firman Allah, “Kecuali karena (siasat) memelihara diri dari sesuatu yang ditakuti dari mereka,” yakni, kecuali bila kalian khawatir akan diri kalian dalam memulai permusuhan terhadap kaum kafir, maka kalian mendapatkan keringanan, dalam kondisi seperti itu, untuk mengadakan perjanjian dan perdamaian, bukan dalam kapasitas memberi loyalitas (wala’) yang merupakan bentuk kecintaan hati lalu diikuti oleh pembelaan. “Dan Allah memperingatkan kamu terhadap Diri (siksa) Nya.” Maksudnya, takutlah kalian dariNya, khawatirlah terhadapNya, dan dahulukanlah rasa takut kepadaNya itu dari rasa takut kalian terhadap manusia, dan Dia-lah yang mengendalikan (menguasai) diri mereka, dan kepadaNya-lah mereka akan kembali dan pulang. Kemudian Dia akan membalas orang-orang yang mendahulukan rasa takutnya terhadapNya dan rasa harapnya kepadaNya atas selainNya dengan pahala yang melimpah, dan menyiksa orang-orang kafir dan orang-orang yang menjadikan mereka pemimpin dengan siksaan yang menghinakan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 28: Janganlah Mu’minun mengambil kafirin sebagai sahabat lebih daripada Mu'minin; dan barangsiapa berbuat begitu, maka tidaklah ia (mendapat penjagaan) dari Allah di sesuatu (apapun); tetapi hendaklah kamu menjaga (diri) dari mereka (dengan) satu penjagaan (yang betul); dan Allah ancam kamu (dengan siksaan dari) diri-Nya, dan kepada Allah-lah tempat datang (kamu)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Wali jamaknya auliyaa, yang berarti teman yang akrab, pemimpin, pelindung atau penolong. Termasuk juga mencintai dan membela orang-orang kafir meninggalkan kaum mukmin. Semua ini dilarang. Dalam ayat ini terdapat larangan mengadakan pendekatan dengan orang-orang kafir, berteman akrab dengan mereka, cenderung kepada mereka, memberikan mereka jabatan serta meminta bantuan mereka untuk perkara yang terdapat maslahat bagi kaum muslimin. Misalnya dengan mengadakan hudnah (genjatan senjata), atau menampakkan seakan-akan berwala' dengan mereka di lisan, namun hati tidak setuju. Hal ini dilakukan sebelum Islam berjaya, dan diperuntukkan bagi orang yang tinggal di sebuah negeri sedangkan dia tidak memiliki kekuatan di sana. Oleh karena itu, janganlah mengerjakan perbuatan yang mendatangkan kemurkaan-Nya seperti dengan bermaksiat dan berwala' kepada orang-orang kafir tanpa alasan menjaga diri dari sesuatu yang kamu takuti. Semua makhluk akan kembali kepada Allah untuk dihisab dan diberi pembalasan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 28",
    "description": "Setelah ayat sebelumnya menjelaskan kekuasaan Allah yang tak terbatas, yang salah satunya memberi rezeki tanpa perhitungan, maka ayat ini melarang kaum mukmin untuk menjadikan orang kafir sebagai wali. Janganlah orang-orang beriman dengan sebenar-benarnya menjadikan orang kafir, baik kafir secara akidah maupun orang yang bergelimang dalam kedurhakaan, sebagai wali, yaitu orang terdekat yang menjadi tempat menyimpan rahasia yang menyangkut kemaslahatan umum, melainkan orang-orang beriman. Barang siapa berbuat demikian, yaitu menjadikan orang kafir sebagai wali, niscaya dia tidak akan memperoleh perlindungan dan pertolongan apa pun dari Allah, kecuali apabila yang kamu lakukan itu karena untuk siasat menjaga diri dari sesuatu yang kamu takuti dari mereka, terkait dengan keselamatan dirimu dan kaum muslim. Dan Allah memperingatkan kamu akan diri, yakni siksa-Nya, dan hanya kepada Allah tempat kembali semua makhluk-Nya. Ayat ini mengingatkan agar tidak seorang pun bersembunyi di balik kata-kata bohongnya untuk mengambil keuntungan pribadi, sebab semua pasti akan terungkap. Katakanlah, wahai nabi Muhammad, jika kamu sembunyikan apa yang ada dalam hatimu atau kamu nyatakan, baik berupa ucapan maupun perbuatan, Allah pasti mengetahuinya dan akan membalasnya sesuai dengan apa yang dikatakan dan dilakukannya. Demikian, karena dia mengetahui apa yang ada di langit dan apa yang ada di bumi, baik yang tampak maupun yang tersembunyi. Allah mahakuasa atas segala sesuatu, sehingga dengan kekuasaan-Nya itu Allah mampu mengungkap rahasia hamba-Nya dan membalas segala perbuatannya dengan seadil-adilnya."
  }
]