[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah olehmu (wahai nabi), kepada kaum mukmin, ”jika kalian menyembunyikan perasaan yang telah menetap dalam hati kalian berupa kecintaan kepada kaum kafir dan membela mereka, atau kalian menampakkan hal itu,maka tidak ada sesuatu pun dari hal itu yang tersembunyi bagi Allah. Sesungguhnya ilmu Allah meliputi semua yang ada di langit dan dibumi, dan Dia memiliki kekuasaan yang sempurna atas segala sesuatu.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "29. Katakanlah -wahai Nabi-, “Jika kalian menyembunyikan sesuatu yang dilarang oleh Allah di dalam dadamu, seperti berteman setia dengan orang-orang kafir, atau memperlihatkannya, niscaya Allah mengetahuinya. Tidak ada sesuatu pun yang luput dari pengetahuan-Nya. Dia mengetahui apa saja yang ada di langit dan di bumi. Dan Allah Mahakuasa atas segala sesuatu, tidak ada sesuatu pun yang tidak dapat dilakukan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "29. Allah memerintahkan kepada Rasulullah agar mengabarkan kepada orang-orang beriman: “Jika kalian menyembunyikan atau menampakkan apa yang ada dalam hati kalian maka sesungguhnya Allah telah mengetahuinya. Allah mengetahui segala yang ada di langit dan bumi, dan Dia Maha Kuasa atas segalanya, apa yang Dia kehendaki pasti akan terjadi."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "29. قُلْ إِن تُخْفُوا۟ مَا فِى صُدُورِكُمْ ( Katakanlah: “Jika kamu menyembunyikan apa yang ada dalam hatimu) Yakni berupa menjadikan orang-orang kafir sebagai wali atau berupa hal lainnya yang tidak diridhai Allah. يَعْلَمْهُ اللهُ ۗ ( pasti Allah mengetahui) Sehingga Allah akan membalas kalian atas hal itu. وَيَعْلَمُ مَا فِى السَّمٰوٰتِ وَمَا فِى الْأَرْضِ ۗ( Allah mengetahui apa-apa yang ada di langit dan apa-apa yang ada di bumi) Yakni Dia mengetahui apa yang lebih besar dari apa yang kalian sembunyikan atau tampakkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "29 Katakanlah kepada mereka wahai Rasul: “Jika kamu merahasiakan permintaan pertolongan kepada musuh ataupun menyatakannya secara terang sungguh Allah Maha mengetahui. Sehingga Allah akan memberi balasan kepada kalian. Tidak ada yang dapat tersembunyi dari Allah segala yang ada di langit dan di bumi. Dan Allah Maha Kuasa untuk memberi hukuman kepada kalian atas segala keadaan kalian."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah, “Jika kalian menyembunyikan apa yang ada dalam hati kalian atau kalian menampakkannya} menampakkannya {Allah pasti mengetahuinya.” Dia mengetahui apa yang ada di langit dan apa yang ada di bumi. Allah Maha kuasa atas segala sesuatu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "29-30. Allah memberitakan tentang ilmuNya yang meliputi apa yang ada dalam dada, baik yang disembunyikan oleh manusia atau yang ditampakannya. Sebagaimana ilmuNya itu meliputi segala yang ada di langit dan di bumi, dan tidak ada sesuatu pun yang tersembunyi dariNYa. Di samping ilmuNya yang meliputi segala hal itu Dia juga Mahaagung lagi Mahakuasa atas segala sesuatu yang tidak ada sesuatu apa pun yang ada (di ala mini) dapat menolak kehendakNya. Dan setelah Allah menyebutkan tentang keagunganNya dan luasnya sifat-sifatNya yang mengharuskan manusia agar merasa diawasi olehNya dalam segala keadaan mereka, Allah menyebutkan juga bagi mereka pendorong lain untuk merasakan pengawasan Allah atasnya dan rasa takut kepadaNya, yaitu bahwa mereka semua akan kembali kepadaNya dana mal perbuatan mereka saat itu dari yang baik maupun yang buruk akan dihadirkan. Di saat itu kaum Mukminin merasa kurang terhadap apa yang telah mereka lakukan bagi diri mereka berupa kebajikan, sedang orang-orang kafir akan menyesal ketika perbuatan-perbuatan mereka dihadirkan, dan mereka berharap agar antara mereka dengan hari itu masih panjang jaraknya. Maka apabila seorang hamba mengetahui bahwasanya ia berjalan menuju Rabbnya dan berjuang di dunia ini, dan bahwasanya pastilah ia akan menjumpai Rabbnya dan melihat usahanya, niscaya hal itu mengharuskan dirinya mengambil sikap hati-hati dan waspada dari perbuatan-perbuatan yang mengharuskannya dipermalukan dan disiksa, dan bersiap-siap dengan amal-amal shalih yang mendatangkan kebahagiaan dan pahala. Itulah sebabnya Allah berfirman, “Dan Allah memperingatkan kamu terhadap Diri (siksa) Nya,” yang demikian itu dengan Allah memperlihatkan buat kalian sifat-sifat keagunganNya, kesempurnaan keadilanNya, dan kerasnya siksaNya. Dan di samping pedihnya hukumanNya, Allah juga Maha Penyantun lagi Maha Penyayang. Dan di antara santun dan kasih sayangNya adalaha bahwa Dia menakut-nakuti hamba-hambaNya dan mengingatkan mereka dari kezhaliman dan pengrusakan, sebagaimana Allah berfirman ketika menyebutkan hukumanNYa, \"Demikianlah Allah mempertakuti hamba-hamba-Nya dengan azab itu. Maka bertakwalah kepada-Ku hai hamba-hamba-Ku.\" QS -Az-Zumar:16- Belas kasih dan sayang Allah telah memudahkan bagi mereka berjalan memperoleh kebaikan-kebaikan, dan kasih sayangNya telah menghindarkan mereka dari jalan-jalan yang menjerumuskan mereka ke dalam hal-hal yang tidak disukai. Karena itu, kita memohon kepada Allah agar menyempurnakan kebaikanNya atas kita dengan menempuh jalan yang lurus, dan keselamatan dari jalan-jalan yang menghantarkan orang yang menempuhnya kepada Neraka Jahim."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 29: Katakanlah: \"Jika kamu sembunyikan apa yang ada di dada-dada kamu atau kamu nyatakan- dia pasti diketahui oleh Allah; dan Ia mengetahui dan apa yang di bumi, dan Allah itu Berkuasa atas tiap-tiap suatu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Seperti berwala' kepada mereka. Termasuk di antaranya berkuasa menyiksa orang-orang yang berwala' kepada orang-orang kafir. Dalam ayat ini terdapat petunjuk untuk membersihkan hati dan menghadirkan pengetahuan Allah di setiap waktu, sehingga seorang hamba malu kepada Tuhannya jika sampai hatinya dipenuhi pikiran rusak, bahkan seharusnya ia menyibukkan pikirannya untuk hal-hal yang mendekatkan diri kepada Allah seperti mentadabburi ayat-ayat-Nya, mentadabburi hadits Rasulullah shallallahu 'alaihi wa sallam, mengkaji suatu ilmu yang bermanfaat, memikirkan makhluk ciptaan Allah atau menasehati hamba-hamba Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 29",
    "description": "Ayat ini mengingatkan agar tidak seorang pun bersembunyi di balik kata-kata bohongnya untuk mengambil keuntungan pribadi, sebab semua pasti akan terungkap. Katakanlah, wahai nabi Muhammad, jika kamu sembunyikan apa yang ada dalam hatimu atau kamu nyatakan, baik berupa ucapan maupun perbuatan, Allah pasti mengetahuinya dan akan membalasnya sesuai dengan apa yang dikatakan dan dilakukannya. Demikian, karena dia mengetahui apa yang ada di langit dan apa yang ada di bumi, baik yang tampak maupun yang tersembunyi. Allah mahakuasa atas segala sesuatu, sehingga dengan kekuasaan-Nya itu Allah mampu mengungkap rahasia hamba-Nya dan membalas segala perbuatannya dengan seadil-adilnyapada hari kiamat, setiap jiwa yang sudah dewasa dan layak diberi beban agama akan mendapatkan balasan atau ganjaran atas kebajikan yang telah dikerjakan dan akan dihadapkan atau dihadirkan kepadanya, begitu juga balasan atas kejahatan yang telah dia kerjakan juga akan dihadirkan di hadapannya. Maka, pada saat itulah dia yang perbuatannya buruk berharap sekiranya ada jarak yang jauh antara dia dengan segala keburukannya dengan hari itu. Dan Allah memperingatkan kamu akan diri yakni siksa-Nya. Allah maha penyayang terhadap hamba-hamba-Nya dengan memberinya perlindungan pada hari ketika tidak ada perlindungan kecuali dari-Nya. Ini menunjukkan betapa takut orangorang yang mati dengan membawa dosa serta betapa sulitnya hari itu kecuali bagi mereka yang memperoleh rahmat-n."
  }
]