[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "3-4. Dia menurunkan al-qur’an kepadamu (wahai rasul) ,dengan membawa kebenaran yang tidak ada unsur keraguan padanya sedikitpun, membenarkan kitab-kitab dan rasul-rasul sebelumnya. Dan Dia menurunkan taurat kepada Musa alaihi salam dan juga injil kepada Isa alaihi salam sebelum turunnya al-qur'an. Dan Dia menurunkan taurat kepada Musa alaihi salam dan juga injil kepada Isa alaihi salam sebelum turunnya al-qur;an, supaya menunjukan jalan bagi orang orang yang bertakwa menuju keimanan dan kebaikan agama dan dunia mereka, dan Dia menurunkan kitab yang membedakan antara kebenaran dan kebatilan. Dan orang-orang yang mengingkari ayat-ayat Allah yang diturunkan akan mendapatkan siksaan yang berat. Dan Allah Maha Perkasa, tidak terkalahkan, mempunyai balasan (azab) kepada orang-orang yang mengingkari hujjah-hujjah dan bukti bukti (dari) NYA,serta keesaanNYA sebagai tuhan yang berhak disembah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3-4. Dia menurunkan Al-Qur`ān kepadamu -wahai Nabi- dengan benar dalam menyampaikan berita dan adil dalam menetapkan hukum, serta sesuai dengan kitab-kitab suci sebelumnya, sehingga tidak ada pertentangan di antara kitab-kitab suci tersebut. Dia telah menurunkan Taurat kepada Musa dan Injil kepada Isa -'alaihima as-salām- sebelum menurunkan Al-Qur`ān kepadamu. Kitab-kitab suci itu semuanya adalah petunjuk dan pembimbing manusia kepada kebaikan agama dan dunia mereka. Dan Dia menurunkan Al-Furqān yang digunakan untuk membedakan antara yang hak dan yang batil, dan membedakan yang mengikuti petunjuk dan yang tersesat. Dan orang-orang yang ingkar kepada ayat-ayat yang Allah turunkan kepadamu akan mendapatkan azab yang berat. Dan Allah Maha Perkasa, tidak ada sesuatupun yang dapat mengalahkan-Nya, lagi Maha Menghukum terhadap orang-orang yang mendustakan rasul-rasul-Nya dan melanggar perintah-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "3-4. Hai Rasulullah, telah diturunkan kepadamu al-Qur’an dengan sebenar-benarnya yang tidak mengandung keraguan, ia sesuai dengan kitab-kitab yang diturunkan kepada para rasul sebelumnya. Allah menurunkan Taurat kepada Musa dan Injil kepada Isa sebelum diturunkannya al-Qur’an sebagai petunjuk manusia kepada Islam. Dan Allah menurunkan sesuatu yang dapat membedakan antara kebenaran dan kebatilan. Orang-orang yang mendustakan ayat-ayat Allah yang dijelaskan dalam al-Qur’an dan lainnya akan mendapatkan azab yang besar dan menyakitkan. Allah Maha Perkasa dalam kekuasaan-Nya, dan memiliki pembalasan bagi orang yang mendustakan ayat-ayat-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. نَزَّلَ عَلَيْكَ الْكِتٰبَ (Dia menurunkan Al Kitab kepadamu) Yakni al-Qur’an. بِالْحَقِّ (dengan sebenarnya) Yakni dengan kebenaran dan dalil yang kuat. مُصَدِّقًا (membenarkan) Yakni sesuai. لِّمَا بَيْنَ يَدَيْهِ( kitab yang telah diturunkan sebelumnya) Yakni kitab-kitab yang diturunkan sebelumnya. وَأَنزَلَ التَّوْرَىٰةَ وَالْإِنجِيلَ( dan menurunkan Taurat dan Injil) Kepada Nabi Musa dan Nabi Isa."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3-4. Wahai Rasulullah, Allah menurunkan Al-Qur’an kepadamu dengan penuh kebenaran dan hujjah yang jelas sesuai dengan kitab-kitab samawi sebelumnya. Dia juga menurunkan Taurat dan Injil sebelum Al-Qur’an kepada Musa AS dan Isa AS untuk memberi petunjuk kepada manusia. Dia menurunkan Al-Furqan yaitu kitab pemisah antara yang haq dengan yang bathil, yaitu Al-Qur’an, kitab-kitab dan shuhuf-shuhuf lainnya. Ini adalah penyebutan sesuatu yang umum untuk menyebut beberapa bagiannya. Sesungguhnya orang-orang yang mengingkari ayat-ayat Allah dalam Al-Qur’an dan kitab lainnya yang menunjukkan kepada keesaan dan kesucianNya dari sesuatu yang tidak pantas bagiNya, bagi mereka itu azab yang dahsyat pada hari kiamat. Allah itu Maha Kuat lagi Maha Kuasa atas perintahNya. Dia akan menghukum orang yang mendustakan ayat-ayatNya dan menentang para rasulNya yang mulia. Intiqam adalah hukuman akibat dosa yang telah lalu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia menurunkan kepadamu Kitab dengan benar} Al-Qur’an dengan benar {membenarkan kitab-kitab sebelumnya} menyelaraskan kitab-kitab yang diturunkan sebelumnya {serta telah menurunkan Taurat dan Injil"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3-4. “Membenarkan kitab yang telah di turunkan sebelumnya” dari kitab-kitab suci, artinya, kitab ini mempersaksikan apa yang di sasikan oleh kitab-kitab tersebut, dan membenarkan para Rasul yang membawa kitab tersebut. demikian juga, ”dan menuturkan taurat dan injil sebelum Al-qur’an,” yakni kitab Allah ini ”menjadi petunjuk bagi manusia,” dan Allah menyempurnakan risalah dan menutupnya dengan nabi Muhammad dan kitabnya yang agung, yang dengannya Allah memberikan petunjukNya pada makhluk dari kesesatan dan menyelamatkan mereka dari kebodohan, dan dengannya Allah memisahkan antara yang benar dan kebhatilan, kebahagiaan dan kesengsaraan, jalan yang lurus ke syurga dan jalan ke neraka. Maka orang-orang yang beriman kepadanya dan mengambil petunjuk niscaya mereka akan mendapatkan kebaikan yang melimpah dan pahala yang melimpah yang segara maupun yang tertunda, dan ”orang-orang yang kafir terhadap Allah” yang telah di jelaskan oleh Allah dalam kitabnya dan melalui lisan rasulNya, ”akan memperoleh siksa yang berat; dan Allah maha perkasa lagi maha maha mempunyai pembalasan siksa” bagi orang-orang yang maksiat kepadanya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 3: La turunkan kitab kepadamu dengan (membawa) kebenaran, padahal menyetujui (isi kitab-kitab) yang ada di hadapannya dan la turunkan Taurat dan Injil."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Oleh karena itu, Al Qur'an adalah pentazkiyah (yang merekomendasi) kitab-kitab sebelumnya, apa saja berita yang dibenarkannya maka berita itu diterima dan apa saja berita yang ditolaknya, maka berita itu tertolak. Kitab tersebut sejalan dengan kitab-kitab sebelumnya dalam semua tuntutan yang disepakati para rasul. Oleh karena itu, orang-orang Ahlul kitab tidak dapat membenarkan kitab-kitab mereka jika mereka tidak beriman kepada kitab Al Qur'an. Hal itu, karena kafir kepada kitab tersebut membatalkan keimanan mereka kepada kitab-kitab mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 3",
    "description": "Dia menurunkan kitab Al-Qur'an secara berangsur-angsur kepadamu, wahai nabi Muhammad, yang mengandung kebenaran dan dalam keadaan hak, baik kandungan, cara menurunkan, yang membawanya turun, maupun yang menerimanya. Kandungan Al-Qur'an itu membenarkan wahyu-wahyu Allah dalam kitab-kitab suci sebelumnya yang pernah diwahyukan kepada para nabi dan rasul, yakni yang berkaitan dengan pokok-pokok akidah, syariah dan akhlak. Dan Allah juga menurunkan sekaligus, tidak berangsur-angsur, kepada nabi musa kitab taurat dan kepada nabi isa kitab injil sebelum turun-Nya Al-Qur'an. Ketiga kitab suci tersebut berfungsi sebagai petunjuk bagi manusia. Dan dia menurunkan ketiga kitab suci tersebut sebagai al-furqa'n yang berfungsi membedakan antara yang hak dan yang batil. Sungguh, orang-orang yang ingkar terhadap ayat-ayat Allah dengan menutupi tanda-tanda keesaannya, baik yang terbentang di alam raya, melalui kitab suci maupun fitrah yang melekat pada diri setiap insan, akan memperoleh azab yang berat. Allah mahaperkasa yang tidak seorang pun dapat mengalahkannya, lagi mempunyai hukuman bagi orang yang mengingkari bukti-bukti keesaan dan kekuasaan-Nya. Dia menurunkan kitab Al-Qur'an secara berangsur-angsur kepadamu, wahai nabi Muhammad, yang mengandung kebenaran dan dalam keadaan hak, baik kandungan, cara menurunkan, yang membawanya turun, maupun yang menerimanya. Dan dia menurunkan ketiga kitab suci tersebut sebagai al-furqa' n yang berfungsi membedakan antara yang hak dan yang batil"
  }
]