[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan pada hari kiamat hari pembalasan amal, setiap jiwa akan mendapati semua yang telah diperbuatnya dari perbuatan yang baik sedang menunggunya dalam keadaan sempurna supaya dia diberi balasan karenanya, dana pa yang telah diperbat dari Dan keburukan juga ia jumpai tengah menunggunya, dan dia berhara-harap sekiranya antara dirinya dan perbuatan-perbuatan itu ada masa yang sangat panjang. Maka bersiaplah untuk menghadapi hari itu, dan takutlah kalian terhadap siksaan Allah Yang maha memaksa. Dan bersama siksaanNYA yang sangat keras itu ,seungguhnya DIA memiliki sifat yang maha penyayang kepada hamba-hambaNYA."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "30. Pada hari kiamat nanti setiap orang akan menemukan kebaikan yang pernah dikerjakannya secara nyata tanpa ada yang dikurangi sedikitpun. Dan setiap orang yang melakukan keburukan berandai-andai sekiranya ada masa yang panjang antara dirinya dengan keburukannya tersebut. Tetapi mana mungkin ia bisa mendapatkan apa yang diandai-andaikannya itu. Dan Allah memperingatkan kalian agar takut kepada-Nya. Maka janganlah kalian menjerumuskan diri kalian ke dalam murka-Nya dengan melakukan perbuatan dosa. Dan Allah Maha Penyantun bagi hamba-hamba-Nya. Oleh karena itulah Dia memperingatkan dan menakut-nakuti mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "30. Hendaklah orang-orang yang menyelisihi perintah Allah takut dari hari kiamat, ketika setiap insan mendapati setiap amalan baiknya di depan matanya, baik itu amalan kecil maupun besar; dan mendapati dosa yang pernah ia lakukan, sehingga ia berharap dapat menjauh dari amal buruk itu sejauh-jauhnya karena takut dari perhitungan Allah. Dan Allah memperingatkan kalian dari diri-Nya supaya tidak memurkai kalian akibat perbuatan maksiat yang kalian lakukan. Dan Allah Maha Lembut terhadap hamba-hamba-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "30. وَمَا عَمِلَتْ مِن سُوٓءٍ ( begitu (juga) kejahatan yang telah dikerjakannya) Yakni dan kamu akan mendapatkan keburukan yang kamu lakukan itu didatangkan. تَوَدُّ لَوْ أَنَّ بَيْنَهَا وَبَيْنَهُۥٓ أَمَدًۢا بَعِيدًا ۗ( ia ingin kalau kiranya antara ia dengan hari itu ada masa yang jauh) Dari Hasan al-Bashri ia berkata: setiap mereka mengingikan agar tidak bertemu dengan amalan mereka sama sekali, dan itu menjadi harapan mereka. Adapun di dunia mereka begitu menikmati dosa yang ia perbuat. وَيُحَذِّرُكُمُ اللهُ نَفْسَهُۥ ۗ (dan Allah memperingatkan kamu terhadap siksa-Nya ) Allah mengulangi firman-Nya ini sebagai bentuk penekanan agar menjadi ancaman besar yang selalu mereka ingat. وَاللهُ رَءُوفٌۢ بِالْعِبَادِ ( Dan Allah sangat Penyayang kepada hamba-hamba-Nya) Peringatan keras ini dibarengi dengan kasih sayang dari Allah untuk hamba-hamba-Nya sebagai bentuk kelembutan dengan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "30 Pada hari dimana di akhirat setiap jiwa mendapati pahala atas segala kebajikan yang dilakukan di dunia di depannya meskipun hanya sedikit. Begitu juga mendapati balasan atas segala keburukan yang telah dikerjakannya di depannya matanya. Ia ingin kalau kiranya antara ia dengan hari itu ada jarak waktu yang jauh untuk dapat terhindar dari akibat perbuatannya. Dan Allah memperingatkan kamu terhadap siksa-Nya, sehingga tidak menyegerakan azab untuk mereka. Namun memberi waktu kepada mereka untuk taubat dan memperbarui perbuatan saleh. Peringatan dari Allah itu berhubungan erat dengan sifat Maha Penyayang Allah kepada manusia"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Pada hari setiap jiwa mendapatkan atas kebajikan yang telah dikerjakannya dihadirkan, juga atas kejahatan yang telah dia kerjakan. Dia berharap seandainya ada jarak antara dia dan hari itu} jangka waktu {yang jauh. Allah memperingatkan kalian akan siksaNya. Allah Maha Penyayang terhadap hamba-hambaNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "29-30. Allah memberitakan tentang ilmuNya yang meliputi apa yang ada dalam dada, baik yang disembunyikan oleh manusia atau yang ditampakannya. Sebagaimana ilmuNya itu meliputi segala yang ada di langit dan di bumi, dan tidak ada sesuatu pun yang tersembunyi dariNYa. Di samping ilmuNya yang meliputi segala hal itu Dia juga Mahaagung lagi Mahakuasa atas segala sesuatu yang tidak ada sesuatu apa pun yang ada (di ala mini) dapat menolak kehendakNya. Dan setelah Allah menyebutkan tentang keagunganNya dan luasnya sifat-sifatNya yang mengharuskan manusia agar merasa diawasi olehNya dalam segala keadaan mereka, Allah menyebutkan juga bagi mereka pendorong lain untuk merasakan pengawasan Allah atasnya dan rasa takut kepadaNya, yaitu bahwa mereka semua akan kembali kepadaNya dana mal perbuatan mereka saat itu dari yang baik maupun yang buruk akan dihadirkan. Di saat itu kaum Mukminin merasa kurang terhadap apa yang telah mereka lakukan bagi diri mereka berupa kebajikan, sedang orang-orang kafir akan menyesal ketika perbuatan-perbuatan mereka dihadirkan, dan mereka berharap agar antara mereka dengan hari itu masih panjang jaraknya. Maka apabila seorang hamba mengetahui bahwasanya ia berjalan menuju Rabbnya dan berjuang di dunia ini, dan bahwasanya pastilah ia akan menjumpai Rabbnya dan melihat usahanya, niscaya hal itu mengharuskan dirinya mengambil sikap hati-hati dan waspada dari perbuatan-perbuatan yang mengharuskannya dipermalukan dan disiksa, dan bersiap-siap dengan amal-amal shalih yang mendatangkan kebahagiaan dan pahala. Itulah sebabnya Allah berfirman, “Dan Allah memperingatkan kamu terhadap Diri (siksa) Nya,” yang demikian itu dengan Allah memperlihatkan buat kalian sifat-sifat keagunganNya, kesempurnaan keadilanNya, dan kerasnya siksaNya. Dan di samping pedihnya hukumanNya, Allah juga Maha Penyantun lagi Maha Penyayang. Dan di antara santun dan kasih sayangNya adalaha bahwa Dia menakut-nakuti hamba-hambaNya dan mengingatkan mereka dari kezhaliman dan pengrusakan, sebagaimana Allah berfirman ketika menyebutkan hukumanNYa, \"Demikianlah Allah mempertakuti hamba-hamba-Nya dengan azab itu. Maka bertakwalah kepada-Ku hai hamba-hamba-Ku.\" QS -Az-Zumar:16- Belas kasih dan sayang Allah telah memudahkan bagi mereka berjalan memperoleh kebaikan-kebaikan, dan kasih sayangNya telah menghindarkan mereka dari jalan-jalan yang menjerumuskan mereka ke dalam hal-hal yang tidak disukai. Karena itu, kita memohon kepada Allah agar menyempurnakan kebaikanNya atas kita dengan menempuh jalan yang lurus, dan keselamatan dari jalan-jalan yang menghantarkan orang yang menempuhnya kepada Neraka Jahim."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 30: Takutlah kepada hari yang tiap-tiap seorang akan dapati (ganjaran) 'amal kebaikannya sedia (dihadapannya); dan apa-apa kejahat ia telah kerjakan itu, yang ingin ia kalau di antara (balasannya) dan antara-dia ada satu masa yang jauh; dan Allah ancam kamu (dengan siksaan dari) diri-Nya; dan Allah itu amat sayang akan hamba-hamba-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kebajikan atau dalam bahasa Arab disebut Al Khair, adalah nama untuk semua perbuatan yang mendekatkan diri kepada Allah, berupa amal-amal shalih baik berupa perkataan maupun perbuatan, yang besar maupun yang kecil. Untuk diberikan balasan. Hal ini disebabkan penyesalan dan kesedihan yang mendalam. Ayat ini sama seperti ayat-ayat berikut: \"Supaya tidak ada ada orang yang mengatakan, \"Amat besar penyesalanku atas kelalaianku dalam (menunaikan kewajiban) terhadap Allah….dst.\" (Terj. Az Zumar: 56) \"Di hari itu orang-orang kafir dan orang-orang yang mendurhakai rasul, ingin supaya mereka disamaratakan dengan tanah.\" (Terj. An Nisaa': 42) Dan (ingatlah) hari (ketika itu) orang yang zalim menggigit dua tangannya, seraya berkata: \"Aduhai kiranya (dulu) aku mengambil jalan bersama Rasul\".---Kecelakaan besarlah bagiku; sekiranya aku (dulu) tidak menjadikan si fulan itu teman akrab(ku). (Terj. Al Furqan: 27-28) \"Sehingga apabila orang-orang yang berpaling itu datang kepada Kami (di hari kiamat) dia berkata: \"Aduhai, semoga (jarak) antaraku dan kamu seperti jarak antara timur dan barat \". (Terj. Az Zukhruf: 38) Jika seseorang mengetahui hal seperti ini, tentu ia akan meninggalkan syahwat dan hawa nafsunya di dunia ini meskipun berat meninggalkannya daripada merasakan kesukaran-kesukaran dan menanggung penderitaan yang sangat berat dipikul pada hari itu. Akan tetapi, karena kezaliman dan kebodohan dalam dirinya, ia tidak melihat selain perkara yang dilihatnya langsung, ia tidak memiliki akal yang sempurna untuk memperhatikan akibat di belakang, sehingga dirinya berani berani berbuat maksiat dan meninggalkan perintah. Ya Allah, bimbinglah kami dalam meniti hidup ini agar tetap istiqamah di atas jalan-Mu. Allah Subhaanahu wa Ta'aala mengulangi lagi peringatan ini karena sayang kepada kita, agar masa yang panjang tidak membuat hati kita keras dan agar kita memiliki rasa raja' (berharap) dengan beramal shalih serta khauf (takut) sehingga meninggalkan maksiat. Kita meminta kepada Allah agar Dia mengaruniakan kepada kita rasa takut kepada siksa-Nya terus menerus, agar kita tidak melakukan perbuatan yang mendatangkan murka-Nya dan meminta kepada-Nya agar mengaruniakan kepada kita rasa raja' agar kita tidak berputus asas dari rahmat-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 30",
    "description": "Pada hari kiamat, setiap jiwa yang sudah dewasa dan layak diberi beban agama akan mendapatkan balasan atau ganjaran atas kebajikan yang telah dikerjakan dan akan dihadapkan atau dihadirkan kepadanya, begitu juga balasan atas kejahatan yang telah dia kerjakan juga akan dihadirkan di hadapannya. Maka, pada saat itulah dia yang perbuatannya buruk berharap sekiranya ada jarak yang jauh antara dia dengan segala keburukannya dengan hari itu. Dan Allah memperingatkan kamu akan diri yakni siksa-Nya. Allah maha penyayang terhadap hamba-hamba-Nya dengan memberinya perlindungan pada hari ketika tidak ada perlindungan kecuali dari-Nya. Ini menunjukkan betapa takut orangorang yang mati dengan membawa dosa serta betapa sulitnya hari itu kecuali bagi mereka yang memperoleh rahmat-n katakanlah, wahai nabi Muhammad, kepada mereka yang merasa mencintai Allah, jika kalian mencintai Allah, ikutilah aku, dengan melaksanakan segala perintah Allah dan menjauhi segala larang-an-Nya yang disyariatkan melalui aku, juga ditambah dengan melaksanakan sunahsunahku, niscaya Allah mencintai kalian dan mengampuni dosa-dosa kalian. Allah maha pengampun, maha penyayang terhadap siapa pun yang mengikuti perintah rasul-Nya dan meninggalkan larangannya."
  }
]