[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah olehmu (wahai rasul), ”ta’atlah kepada Allah dengan mengikuti kitabNYA, dan taatilah rasul dengan mengikuti sunnahnya saat beliau masih hidup dan sepeninggal beliau.” Maka apabila mereka berpaling darimu dan terus menerus pada apa yang ada pada mereka dari kekafiran dan kesesatan ,maka mereka bukanlah orang yang pantas mendapat cinta Allah, karena sesungguhnya Allah tidak mencintai orang-orang kafir."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "32. Katakanlah -wahai Rasul-, “Taatlah kalian kepada Allah dan taatlah kalian kepada Rasul-Nya dengan cara menjalankan perintah-perintah-Nya dan menjauhi larangan-larangan-Nya.” Apabila mereka berpaling dari hal itu, sesungguhnya Allah tidak menyukai orang-orang kafir yang melanggar perintah-Nya dan perintah Rasul-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "32. قُلْ أَطِيعُوا۟ اللهَ وَالرَّسُولَ ۖ (Katakanlah: “Taatilah Allah dan Rasul-Nya) Yakni dalam seluruh perintah dan larangan. فَإِن تَوَلَّوْا۟ (jika kamu berpaling) Yakni jika kalian menolak untuk mentaati Allah dan rasul-Nya dan mencintai keduanya, maka Allah tidak akan mencintai kalian. فَإِنَّ اللهَ لَا يُحِبُّ الْكٰفِرِينَ (maka sesungguhnya Allah tidak menyukai orang-orang kafir) Sebagai bentuk isyarat atas kemarahan dan kemurkaan-Nya kepada mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "32 Katakanlah kepada mereka wahai Muhammad: “Taatlah kepada Allah dan Rasul-Nya dalam segala perintah dan larangan-Nya. Jika kamu berpaling dari ketaatan kepada Allah dan rasul-Nya, maka sesungguhnya Allah tidak menyukai kalian dan murka kepada orang-orang kafir yang membangkang dari kebenaran”."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah.“Taatilah Allah dan taatilah Rasul. Jika kalian berpaling} berpaling dari ketaatan kepada Allah dan Rasulullah {sesungguhnya Allah tidak menyukai orang-orang kafir.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "31-32. Ayat ini merupakan patokan dimana dengannya kita dapat membedakan orang yang mencintai Allah dengan sebenar-benarnya dengan orang yang hanya sekedar mengaku-ngaku semata. Tanda-tanda kecintaan kepada Allah adalah mengikuti Rasulullah, Muhammad dimana Allah menjadikan tindakan mencontohi rasulullah sholallohu alaihi wasallam dan mengikuti segala yang diserukan beliau sebagai jalan kecintaan kepadaNya dan keridhanNya. Oleh karena itu tidak akan diperoleh kecintaan Allah dan keridhaanNya serta pahalaNya kecuali dengan membenarkan apa yang dibawa oleh Muhammad sholallohu alaihi wasallam berupa al-quran dan as-Sunnah dan menaati perintah keduanya dan menjauhi larangan keduanya. Maka barangsiapa yang melakukan hal itu, niscaya Allah akan mencintainya lalu membalasnya dengan balasan orang-orang yang dicintai, mengampuni dosa-dosanya dan menutupi aib-aibnya. Kemudian seolah-olah dikatakan “dan bersama itu semua, maka apakah sebenarnya hakikat mengikuti rasul dan tata caranya?’ Maka Allah menjawab dengan firmanNya, ”katakanlah taatilah Allah dan RasulNya,” yaitu dengan menaati perintah dan menjauhi larangan serta mempercayai kabar berita.”jika kamu berpaling” dari hal itu, maka inilah kekufuran, dan Allah “tidak menyukai orang-orang kafir.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 32: Katakanlah: \"Hendaklah kamu ta'at kepada Allah dan Sesudah itu, jika kamu berpaling, Rasul. maka Allah tidak cinta kepada orang-orang yang kafir\"."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Seperti melaksanakan perintahnya, yaitu mentauhidkan Allah. Jika mereka berpaling, maka tidak ada yang mereka ikuti selain kekufuran dan mentaati setan. Allah Subhaanahu wa Ta'aala berfirman: \"Telah ditetapkan terhadap setan itu, bahwa barang siapa yang berkawan dengannya, tentu dia akan menyesatkannya, dan membawanya ke azab neraka.\" (Terj. Al Hajj: 4) Oleh karena Dia tidak mencintai mereka, maka Dia akan menghukum mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 32",
    "description": "Sebagai bukti kecintaan kepada Allah, maka katakanlah, wahai nabi Muhammad, kepada mereka yang telah mencintai Allah, taatilah Allah dan rasul baik dalam perintah maupun larangan-Nya. Sebab, jika kalian berpaling dari menaati Allah dan rasul-Nya sementara kalian mengaku telah mencintai-Nya, maka ketahuilah bahwa Allah tidak menyukai orang-orang kafir, baik dari segi akidah maupun mereka yang bergelimang dalam kedurhakaan. Setelah Allah menunjukkan siapa yang berhak memperoleh cintanya, maka ayat berikut menjelaskan beberapa sosok yang telah memperoleh cinta Allah. Sesungguhnya Allah dengan pengetahuan-Nya yang bersifat azali telah memilih adam sebagai khalifah-Nya, nuh sebagai penerima syariat pertama, keluarga ibrahim, yaitu ismail, ishak dan keturunannya yang banyak menjadi nabi dan rasul, dan keluarga imran yaitu maryam yang melahirkan anak tanpa bapak, dan isa sebagai rasul bagi bani israil melebihi segala umat pada masa masing-masing."
  }
]