[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya Allah itu pengetahuannya meliputi seluruh makhlukNYA, tidak ada sesuatu pun yang tersembunyi bagiNYA, baik di bumi maupun di langit, sedikit ataupun banyak."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Sesungguhnya tidak ada sesuatu pun yang tersembunyi bagi Allah, baik di bumi maupun di langit. Pengetahuan-Nya meliputi segala sesuatu, baik lahir maupun batin."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "5-6. Allah Maha Mengetahui segalanya, baik itu yang nampak maupun yang tersembunyi, yang di bumi maupun yang di langit. Hanya Dialah yang menciptakan kalian dalam rahim sesuai kehendak-Nya, baik itu menjadikan kalian laki-laki atau perempuan, bahagia maupun sengsara. Tidak ada Tuhan yang hak selain-Nya, Dia Maha Perkasa dan Maha Bijaksana."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Sesungguhnya tidak ada yang luput dari Allah baik sesuatu yang kecil atau yang besar, yang tampak atau yang tersembunyi di bumi dan langit."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya bagi Allah tidak ada sesuatu pun yang tersembunyi di bumi dan tidak pula di langit"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5-6. Dan di antara kesempurnaan pengurusan-Nya terhadap hamba-hamba-Nya bahwa ilmuNya meliputi seluruh makhluk, ”bagi Allah tidak ada satupun yang tersembunyi di bumi dan tidak pula di langit, ” hingga apa yang ada di dalam perut wanita-wanita hamil Allah-lah ”yang membentuk kamu dalam Rahim sebagaimana kehendaknya, ’ berupa laki-laki, wanita, bentuk yang sempurna, bentuk yang cacat, yang selalu berganti tahapan pembentukanya dan keindahan hikmahnya. Oleh karena Dia-lah Dzat yang seperti ini terhadap hamba-hambanya dan perhatiannya yang besar terhadap kondisi mereka dari pemulaan dia sekutu baginya dalam semua itu, maka menjadi jelaslah tidak ada yang diibadahi kecuali dia, ”tidak ada tuhan yang berhak di sembah melainkan dia yang maha perkasa, ”yang menguasai segala makhluk dengan kekuatanya, dan perkasa dari sipat kekurangan atau dari sipat tercela, ”lagi maha bijaksana, ” dalam penciptaan dan syari’atNya,"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 5: Sesungguhnya Allah itu, tidak tersembunyi atas-Nya sesuatu apapun (tidak) di bumi dan tidak di langit."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Disebutkan hanya bumi dan langit, karena penglihatan manusia tidak dapat melebihinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 5",
    "description": "Dia mengurus semua makhluk-Nya, maka bagi Allah tidak ada sesuatu pun yang tersembunyi, baik makhluk yang berada di bumi dan yang di langit, baik kecil maupun besar. Pengetahuan-Nya meliputi segala sesuatu. Hanya dialah yang membentuk kamu dalam rahim ibumu menurut yang dia kehendaki; laki-laki atau perempuan, baik atau buruk, bahagia atau sengsara. Tidak ada tuhan yang pantas disembah selain dia, yang mahaperkasa dan tidak terkalahkan, mahabijaksana dalam menetapkan dan mengelola segala sesuatu."
  }
]