[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka adapun orang-orang yang kufur kepada Al-masih (Isa ) dari kaum yahudi atau berlebih-lebihan kepadanya dari kaum Nashrani, maka aku akan menyiksa mereka dengan siksaan yang keras di dunia dengan cara dibunuh dan diambil harta-harta dan dihilangkan kerajaan, dan di akhirat dengan api nereka, dan tidak ada bagi mereka seorang penolong yang akan menolong mereka dan mencegah dari mereka siksaan Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "56. Adapun orang-orang yang kafir terhadapmu dan terhadap kebenaran yang engkau bawa kepada mereka, maka Aku akan menyiksa mereka dengan siksa yang berat di dunia dalam pembunuhan, penawanan dan penistaan, dan di akhirat dalam bentuk bentuk azab neraka. Dan mereka tidak memiliki penolong yang dapat melindungi mereka dari azab tersebut."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "56. Adapun orang-orang yang mendustakan Allah dan rasul-Nya akan Aku azab mereka dengan azab yang pedih di dunia dengan berbagai siksaan dan di akhirat dengan neraka Jahannam, dan mereka tidak akan memiliki penolong yang dapat menyelamatkan mereka dari azab neraka Jahannam."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "56 Adapun orang-orang yang kafir, maka akan Kusiksa di dunia dengan berbagai azab. Adapun di akhirat dengan neraka Jahannam dan murka Allah, dan mereka tidak mempunyai penolong yang dapat menyelamatkan mereka dari azab"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Adapun orang-orang yang kafir akan Aku azab dengan azab yang sangat keras di dunia dan di akhirat dan sekali-kali tidak ada penolong bagi mereka.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "56-57. Balasan dalam ayat ini bersifat umum atas semua orang yang bersifat seperti itu dari seluruh pemeluk agama-agama dahulu. Kemudian ketika diutusnya penghulu para Rasul dan penutup para nabi di mana syariatnya menghapus seluruh syariat terdahulu dan agamanya menghapus seluruh agama-agama terdahulu, maka barangsiapa yang berpegang pada selain agama tersebut, maka ia termasuk orang-orang yang celaka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 56: Maka adapun mereka yang kufur itu Aku akan siksa mereka satu siksaan yang keras di dunia dan Akhirat; dan tidak akan mereka dapat pembantu-pembantu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni orang-orang yang kafir kepada Nabi Isa 'alaihis salam seperti orang-orang Yahudi dan orang-orang yang bersikap ghuluw (berlebihan) kepada Beliau sampai menuhankan. Baik dengan musibah, diperangi, ditawan, dirampas harta dan kepemilikan maupun dikenakan jizyah (pajak)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 56",
    "description": "Allah memberi ancaman bagi orang yang kafir kepada nabi isa dan pahala bagi orang yang beriman kepadanya. Maka adapun orang-orang yang kafir kepada nabi isa, maka akan aku azab mereka dengan azab yang sangat keras di dunia, berupa kehinaan dan terusir dari daerahnya dan di akhirat berupa siksa yang kekal, sedang mereka tidak memperoleh penolong sedikit pun dari azab Allah di akhirat kelak. Adapun orang yang beriman kepada Allah dengan mengikuti ajaran utusan-Nya, termasuk nabi isa, dan diwujudkan dengan melakukan kebajikan, maka dia akan memberikan pahala kepada mereka dengan sempurna di akhirat berupa surga. Allah tidak menyukai orang zalim yaitu mereka yang melanggar batas-batas kebenaran yang telah Allah tetapkan, antara lain menganggap nabi isa sebagai tuhan atau anak tuhan."
  }
]