[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan adapun orang-orang yang beriman kepada Allah dan rosul-rosul Nya dan mengerjakan amal sholeh, maka Allah akan memberi mereka pahala amal-amal mereka secara sempurna tanpa pengurangan. Dan Allah tidak mencintai orang-orang yang zalim dengan berbuat syirik dan kekufuran."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "57. Sedangkan orang-orang yang beriman kepadamu dan kepada kebenaran yang engkau bawa kepada mereka, dan mereka mau melaksanakan amal saleh, seperti salat, zakat, puasa, menjalin persaudaraan dan lain-lain, maka Allah akan memberi mereka ganjaran atas amal perbuatan itu secara sempurna, tanpa ada pengurangan sedikitpun. Pembicaraan tentang para pengikut Isa Al-Masih ini adalah pengutusan Nabi Muhammad -ṣallallāhu 'alaihi wa sallam- yang telah dikabarkan sendiri oleh Al-Masih. Dan Allah tidak menyukai orang-orang yang zalim. Salah satu kezaliman yang paling besar ialah menyekutukan Allah -Ta'ālā- dan mendustakan Rasul-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "57. Sedangkan orang-orang beriman yang mengerjakan amal-amal shalih, maka Allah akan memberi mereka pahala yang sempurna. Dia tidak menyukai orang-orang yang zalim dan menyelisihi perintah-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "57. فَيُوَفِّيهِمْ أُجُورَهُمْ ۗ ( maka Allah akan memberikan kepada mereka dengan sempurna pahala amalan-amalan mereka) Yakni Allah akan membalas pahala mereka secara penuh dan sempurna. وَاللهُ لَا يُحِبُّ الظّٰلِمِينَ ( dan Allah tidak menyukai orang-orang yang zalim) Yakni sebagai bentuk sindiran akan kemurkaan atas mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "57 Adapun orang-orang yang beriman dan mengerjakan amalan-amalan yang saleh yang diperintahkan Allah, maka Allah akan memberikan kepada mereka dengan sempurna pahala dari amalan-amalan mereka; dan Allah tidak menyukai orang-orang yang zalim kepada diri mereka sendiri yang kafir kepada Allah dan rasul-Nya dan membangkang atas perintah tuhannya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sedangkan orang-orang yang beriman dan beramal shalih akan Dia berikan pahala mereka dengan sempurna} maka Dia akan memberikan pahala amal mereka dengan sempurna {Allah tidak menyukai orang-orang zalim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "56-57. Balasan dalam ayat ini bersifat umum atas semua orang yang bersifat seperti itu dari seluruh pemeluk agama-agama dahulu. Kemudian ketika diutusnya penghulu para Rasul dan penutup para nabi di mana syariatnya menghapus seluruh syariat terdahulu dan agamanya menghapus seluruh agama-agama terdahulu, maka barangsiapa yang berpegang pada selain agama tersebut, maka ia termasuk orang-orang yang celaka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 57: Dan adapun mereka yang beriman serta beramal shalih, maka Ia akan sempumakan bagi mereka ganjaran mereka, karena Allah itu tidak cinta kepada orang-orang yang menganiaya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Baik amal shalih yang terkait dengan hati, lisan maupun anggota badan yang diajarkan rasul, dan mereka melakukannya dengan niat mencari ridha Allah Rabbul 'alamin. Ayat ini pun menunjukkan bahwa di dunia mereka akan mendapatkan pahala terhadap amal mereka, baik dengan dimuliakan, ditolong dan mendapatkan kehidupan yang bahagia, hanya saja pahala secara sempurna akan diberikan pada hari kiamat, di mana mereka akan mendapatkan kebaikan yang mereka kerjakan semuanya ada di hadapan, lalu diberikan balasannya dan diberikan tambahan oleh Allah dari karunia dan kepemurahan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 57",
    "description": "Adapun orang yang beriman kepada Allah dengan mengikuti ajaran utusan-Nya, termasuk nabi isa, dan diwujudkan dengan melakukan kebajikan, maka dia akan memberikan pahala kepada mereka dengan sempurna di akhirat berupa surga. Allah tidak menyukai orang zalim yaitu mereka yang melanggar batas-batas kebenaran yang telah Allah tetapkan, antara lain menganggap nabi isa sebagai tuhan atau anak tuhandemikianlah, kami bacakan kepadamu, wahai nabi Muhammad, sebagian ayat-ayat atau bukti-bukti kebenaran risalahmu melalui kisahkisah umat terdahulu, antara lain, kisah nabi isa bin maryam dan nabi zakaria, dan peringatan yang penuh hikmah; itulah Al-Qur'an."
  }
]