[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Itulah yang kami kisahkan kepadamu tentang perkara Isa, diantara dalil-dalil yang jelas atas kebenaran risalahmu, dan kebenaran al-quran al-hakim yang membedakan antara kebenaran dan kebatilan, maka tidak ada keraguan pedanya dan tidak ada kebohongan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "58. Kisah tentang Isa yang telah Kami bacakan kepadamu itu adalah bagian dari tanda-tanda nyata yang menunjukkan kebenaran wahyu (Al-Qur`ān) yang diturunkan kepadamu. Dan (Al-Qur`ān) itu adalah peringatan bagi orang-orang yang bertakwa dan merupakan sesuatu yang muhkam (pasti) yang tidak disusupi kebatilan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "58. Hai Muhammad, kisah agung yang Kami bacakan kepadamu dengan perantara Jibril merupakan bagian dari bukti yang jelas atas kebenaran kenabianmu dan kebenaran al-Qur’an yang mengandung hikmah yang membedakan antara kebenaran dan kebatilan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "58. ذٰلِكَ ( Demikianlah) Sebagai isyarat yang ditujukan kepada apa yang telah belalu, berupa berita Nabi Isa dan yang lainnya. مِنَ الْاٰيٰتِ وَالذِّكْرِ الْحَكِيمِ ( sebagian dari bukti-bukti dan peringatan yang penuh hikmah) Yakni yang terkandung didalamnya hikmah-hikmah, atau sesuatu yang tertata yang tidak ada kekurangan didalamnya; dan yang dimaksud disini adalah al-qur’an."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "58 Cerita tentang kisah Isa dan Maryam itu Kami kisahkan kepada kamu wahai Nabi Allah sebagi salah satu bukti kebenaran kerasulanmu dan dari Al Quran yang penuh hikmah. Hasan Al bashri berkata: Datang seorang rahib dan dua orang tukang kayu, salah satu dari mereka berkata: Siapa ayah Isa? Maka rasul Allah tidak panik, sampai diperintahkan oleh tuhannya, maka turunlah kepadanya ayat ini dari awal hingga akhir ayat 60."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Itulah yang Kami bacakan kepadamu sebagian bukti-bukti} tanda-tanda yang menunjukkan kenabianmu {dan peringatan yang penuh hikmah} yang penuh hikmah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "58. maksudnya, al-Quran yang agung ini yang di dalamnya terdapat kisah orang-orang terdahulu dan yang datang belakangan, para nabi dan rasul merupakan ayat-ayat Allah yang jelas. Dan al-quran selalu mengingatkan manusia pada setiap perbuatan mereka, Dia adalah pemutus perkara yang bijaksana dan kisah-kisah yang benar, serta hukum-hukum yang baik."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 58: Yang demikian itu (yang) Kami bacakan-dia kepada-mu (adalah) sebahagian daripada tanda-tanda dan (sebahagian daripada) peringatan yang terpelihara."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 58",
    "description": "Demikianlah, kami bacakan kepadamu, wahai nabi Muhammad, sebagian ayat-ayat atau bukti-bukti kebenaran risalahmu melalui kisahkisah umat terdahulu, antara lain, kisah nabi isa bin maryam dan nabi zakaria, dan peringatan yang penuh hikmah; itulah Al-Qur'an. Setelah Al-Qur'an menjelaskan tentang bukti-bukti kemuliaan isa bin maryam serta sikap pro dan kontra dari kaumnya, maka ayat ini menunjukkan kekeliruan mereka yang menganggap isa sebagai anak tuhan karena terlahir tanpa bapak. Sesungguhnya perumpamaan penciptaan nabi isa tanpa bapak bagi Allah bukanlah sesuatu yang mustahil, seperti penciptaan adam yang terlahir tanpa bapak dan ibu. Dia menciptakannya, nabi isa, sebagaimana adam, dari tanah, kemudian dia berkata kepadanya, jadilah! maka jadilah sesuatu itu. Allah mahakuasa. Tidak ada yang mustahil bagi-Nya. Apa pun yang dikehendaki-Nya pasti akan terwujud dan tidak ada seorang pun yang mampu menghalangi-Nya"
  }
]