[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya penciptaan Allah kepada Isa tanpa bapak, perumpamaannya seperti penciptaan adam tanpa bapak dan tanpa ibu, ketika Allah menciptakannya dari tanah bumi, kemudian Dia berkata kepadanya “jadilah manusia” maka jadilah. Maka adapun pengakuan ketuhanan Isa karena dia diciptakan tanpa bapak merupakan pengakuan yang batil. Maka Adam diciptakan tanpa bapak dan tanpa ibu, dan semua bersepakat bahwa dia adalah sorang hamba dari hamba-hamba Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "59. Sesungguhnya penciptaan Isa -'alaihissalām- itu bagi Allah sama seperti penciptaan Adam yang diciptakan dari tanah, tanpa ayah dan tanpa ibu. Allah hanya berfirman kepadanya, “Jadilah kamu manusia!” maka jadilah ia seperti apa yang dikehendaki-Nya. Jadi, bagaimana mungkin kamu menganggap dia (Isa) sebagai tuhan dengan alasan bahwa dia diciptakan tanpa ayah, sementara mereka mengakui bahwa Adam adalah manusia biasa, padahal Adam diciptakan tanpa ayah dan tanpa ibu?!"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "59. Perumpaman Isa yang diciptakan tanpa seorang ayah seperti penciptaan Adam dari tanah kemudian Allah membuatnya ada dengan firman-Nya ‘jadilah’."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "59. إِنَّ مَثَلَ عِيسَىٰ عِندَ اللهِ كَمَثَلِ ءَادَمَ ۖ ( Sesungguhnya misal (penciptaan) Isa di sisi AllAh, adalah seperti (penciptaan) Adam) Yakni dalam hal bahwa ia diciptakan tanpa adanya bapak sebagaimana Adam, bahkan Adam lebih menakjubkan lagi karena ia diciptakan tanpa adanya bapak dan ibu. خَلَقَهُۥ مِن تُرَابٍ(Allah menciptakan Adam dari tanah ) Lalu mengapa kalian menjadikan Isa sebagai Tuhan? Padahal kalian mengakui bahwa Adam adalah manusia yang diciptakan dan bukan Tuhan. Maka seperti itulah Isa, bahkan Isa lebih utama untuk kalian jadikan makhluk. ثُمَّ قَالَ لَهُۥ كُن فَيَكُونُ( kemudian Allah berfirman kepadanya: “Jadilah”, maka jadilah dia) Yakni jadilah manusia, maka jadilah ia sebagai manusia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "59 Sesungguhnya permisalan penciptaan Isa di sisi Allah, adalah seperti penciptaan Adam. Allah menciptakan Adam dari tanah, kemudian Allah berfirman kepadanya: “Jadilah seorang manusia! Maka jadilah dia. Namun kondisi penciptaan Adam adalah lebih tidak seperti biasanya sebab dia ada tanpa ayah dan ibu, yang diciptakan dari tanah. Seorang dari dua tukang kayu berkata kepada Nabi: Apa gerangan engkau menyumpahi teman kami? Nabi menjawab: Apa yang aku katakan? Mereka menjawab: Kamu berkata bahwa dia adalah seorang hamba. Nabi berkata: Ya, dia adalah hamba Allah, rasul Allah dan kalimat Allah yang diciptakan kepada adzra’ dan batul. Kemudian mereka marah dan berkata: Apakah engkau mengetahui manusia yang lahir tanpa peran ayah? Jika kamu memang benar maka tunjukkan kami permisalah seperti itu. Maka Allah menurunkan ayat ini."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya perumpamaan Isa di sisi Allah itu seperti Adam. Dia menciptakannya dari tanah kemudian berfirman kepadanya, “Jadilah!” Maka, jadilah sesuatu itu."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "59-62. Ketika Allah memberitakan tentang kisah Maryam dan Nabi Isa, dan berita tersebut adalah suatu kebenaran, dan bahwasanya beliau adalah seorang hamba yang telah diberikan oleh Allah karunia atasnya, dan bahwa barangsiapa yang menduga bahwa ada suatu sifat ketuhanan padanya, ia telah mendustai seluruh nabi-nabiNya dan mendustai Isa. Sesungguhnya syubhat yang terjangkit pada orang yang menjadikan beliau itu sebagai tuhan adalah syubhat yang sangat batil. Sekiranya ada sedikit saja kebenaran dalam hal itu, maka pastilah Nabi adam lebih berhak dikultuskan sebagai tuhan, karena beliau diciptakan tanpa ayah dan ibu. Tapi sekalipun demikian, seluruh manusia bersepakat bahwasanya beliau itu adalah seorang hamba di antara hamba-hamba Allah, maka klaim ketuhanan Isa yang didasari oleh penciptaannya hanya dengan seorang ibu tanpa ayah merupakan klaim yang paling batil dari tuduhan-tuduhan yang ada. Inilah yang haq, yang tidak ada keraguan padanya yaitu bahwa Isa itu adalah sebagaimana yang beliau sendiri katakan tentang dirinya. \"Aku tidak pernah mengatakan kepada mereka kecuali apa yang Engkau perintahkan kepadaku (mengatakan)nya yaitu: “Sembahlah Allah, Tuhanku dan Tuhanmu”, dan adalah aku menjadi saksi terhadap mereka, selama aku berada di antara mereka. Maka setelah Engkau wafatkan aku, Engkau-lah yang mengawasi mereka. Dan Engkau adalah Maha Menyaksikan atas segala sesuatu\" QS –Al- Maidah: 117- Pernah Datang kepada Nabi delegasi kaum Nasrani daerah Najran di mana mereka bersikeras dalam kebatilan mereka setelah Nabi menegakkan atas mereka hujjah-hujjah dan keterangan yang jelas bahwasanya Isa itu adalah seorang hamba Allah dan RasulNya dimana mereka meyakini ketuhanannya. Sikap keras kepala mereka telah sampai pada titik dimana Allah memerintahkan kepada beliau agar menantang mereka untuk bermubahalah karena sesungguhnya kebenaran itu telah jelas bagi mereka, akan tetapi kedurhakaan dan fanatisme telah menghalangi mereka dari menerima kebenaran tersebut. Maka Rasulullah menantang mereka untuk bermubahalah di mana mereka menghadirkan keluarga dan anak-anak mereka dan beliau pun menghadirkan keluarga dan anak-anak beliau kemudian mereka semua berdoa kepada Allah agar menurunkan siksa dan laknatNya atas orang-orang yang berdusta. Kemudian mereka mengadakan musyawarah dahulu apakah mereka menerima tantangan itu, dan akhirnya keputusan mereka sepakat untuk tidak akan meladeni tantangan tersebut karena mereka yakin bahwa beliau itu benar-benar Nabi Allah dan bahwa apabila mereka menerima tantangan itu, pastilah mereka beserta keluarga dan anak-anak mereka akan celaka, maka akhirnya mereka meminta perjanjian damai dengan beliau dengan memberikan kepada beliau bayaran jizyah, lalu Rasulullah menerima keputusan mereka tersebut dan tidak mengusir mereka, karena maksud yang diinginkan telah terpenuhi yaitu jelasnya kebenaran. Tampak jelaslah kedurhakaan mereka di mana mereka bersikeras untuk tidak menerima tantangan tersebut, dan hal itu menjelaskan bahwa mereka itu adalah orang-orang yang zhalim. Oleh karena itu Allah berfirman, “Sesungguhnya ini adalah kisah yang benar,” yaitu kisah yang tidak ada keraguan padanya. “Dan sesungguhnya Allah, Dia-lah yang Mahaperkasa,” yakni, yang dengan kekuasaan dan kekuatanNya menguasai seluruh makhluk yang tunduk patuh kepadaNya dari penghuni langit dan bumi. Dan bersama itu, Dia “mahabijaksana” Yang meletakkan segala sesuatu pada tempatnya dan menempatkannya pada posisinya yang tepat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 59: Sesungguhnya perbandingan 'Isa di sisi Allah adalah seperti adam; la jadikan dia dari tanah, kemudian la berkata kepadanya: \"Jadilah\" lalu jadilah la."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Adam 'alaihis salam diciptakan tanpa bapak dan ibu. Oleh karena itu, dakwaan bahwa Nabi Isa adalah tuhan karena diciptakan tanpa bapak merupakan dakwaan yang batil. Nabi Adam 'alaihis salam diciptakan tanpa bapak dan ibu, dan semua sepakat bahwa dia adalah hamba Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 59",
    "description": "Setelah Al-Qur'an menjelaskan tentang bukti-bukti kemuliaan isa bin maryam serta sikap pro dan kontra dari kaumnya, maka ayat ini menunjukkan kekeliruan mereka yang menganggap isa sebagai anak tuhan karena terlahir tanpa bapak. Sesungguhnya perumpamaan penciptaan nabi isa tanpa bapak bagi Allah bukanlah sesuatu yang mustahil, seperti penciptaan adam yang terlahir tanpa bapak dan ibu. Dia menciptakannya, nabi isa, sebagaimana adam, dari tanah, kemudian dia berkata kepadanya, jadilah! maka jadilah sesuatu itu. Allah mahakuasa. Tidak ada yang mustahil bagi-Nya. Apa pun yang dikehendaki-Nya pasti akan terwujud dan tidak ada seorang pun yang mampu menghalangi-Nya demikian itu, karena kebenaran itu dari tuhanmu, karena itu janganlah engkau, wahai nabi Muhammad, termasuk orang-orang yang ragu terhadap proses penciptaan nabi isa bin maryam."
  }
]