[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dialah satu satuNYA dzat yang menciptakan kalian dalam rahim-rahim ibu-ibu kalian sebagaimna yang dikehendakiNYA, apakah kalian menjadi laki-laki atau perempuan, bersifat baik atau buruk, celaka atau bahagia. Tidak ada tuhan sesembahan yang patut di ibadahi kecual DIA. DIA maha perkasa yang tidak terkalahkan, juga maha bijaksana dalam penetapan perintah dan pengaturanNYA."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Dia lah yang menciptakan kalian dalam beragam bentuk di dalam perut ibu kalian menurut kehendak-Nya, baik berupa laki-laki maupun wanita, cantik maupun jelek, putih maupun hitam. Tidak ada yang berhak disembah dengan penuh cinta dan rasa hormat selain Dia, Yang Maha Perkasa, Yang tidak ada yang dapat mengalahkan-Nya, lagi Maha Bijaksana dalam penciptaan-Nya, pengaturan-Nya dan penetapan syariat-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. هُوَ الَّذِى يُصَوِّرُكُمْ فِى الْأَرْحَامِ كَيْفَ يَشَآءُ ۚ (Dialah yang membentuk kamu dalam rahim sebagaimana dikehendaki-Nya) Yakni menjadikannya laki-laki atau perempuan, berparas bagus atau jelek, hitam atau putih, dan tinggi atau pendek; dan juga membentuk organ tubuh mereka seperti, mata, telinga, hidung, kedua tangan dan kaki, dan yang lainnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Dialah Dzat yang menciptakan kalian dalam rahim-rahim (ibu) sesuai kehendakNya baik laki-laki maupun perempuan, bagus atau jelek, dan sifat yang lainnya, Tiada Tuhan selain Dia. Dialah Dzat Yang Maha Kuat dalam kerajaanNya lagi Maha Bijaksana dalam tindakan dan aturanNya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dialah yang membentuk kalian} menciptakan bentuk kalian yang bermacam-macam {dalam rahim sebagaimana yang Dia kehendaki. Tidak ada tuhan selain Dia, Yang Maha perkasa lagi Maha bijaksana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5-6. Dan di antara kesempurnaan pengurusan-Nya terhadap hamba-hamba-Nya bahwa ilmuNya meliputi seluruh makhluk, ”bagi Allah tidak ada satupun yang tersembunyi di bumi dan tidak pula di langit, ” hingga apa yang ada di dalam perut wanita-wanita hamil Allah-lah ”yang membentuk kamu dalam Rahim sebagaimana kehendaknya, ’ berupa laki-laki, wanita, bentuk yang sempurna, bentuk yang cacat, yang selalu berganti tahapan pembentukanya dan keindahan hikmahnya. Oleh karena Dia-lah Dzat yang seperti ini terhadap hamba-hambanya dan perhatiannya yang besar terhadap kondisi mereka dari pemulaan dia sekutu baginya dalam semua itu, maka menjadi jelaslah tidak ada yang diibadahi kecuali dia, ”tidak ada tuhan yang berhak di sembah melainkan dia yang maha perkasa, ”yang menguasai segala makhluk dengan kekuatanya, dan perkasa dari sipat kekurangan atau dari sipat tercela, ”lagi maha bijaksana, ” dalam penciptaan dan syari’atNya,"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 6: Ialah (Tuhan) yang merupakan kamu di dalam kandungan-kandungan sebagaimana Ia kehendaki, Tidak ada Tuhan melain kan Dia, Yang Maha Kuasa, Maha Bijaksana."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Misalnya dibentuk laki-laki atau perempuan, berkulit putih atau berkulit hitam. Ayat-ayat di atas mengandung taqrir (pernyataan) terhadap keesaan Allah dan keberhakan-Nya untuk diibadati tidak selain-Nya, membatalkan sesembahan-sesembahan yang disembah selain-Nya, membantah keyakinan orang-orang Nasrani yang menyangka bahwa Nabi Isa 'alaihis salam berhak disembah. Demikian juga menunjukkan bahwa Allah Maha Hidup dan Maha Mengurus (Qayyumiyyah Tammah) yang mencakup semua sifat suci bagi-Nya, menerangkan syari'at-syari'at yang besar dan bahwa syari'at tersebut merupakan rahmat dan hidayah bagi manusia, menerangkan hukuman bagi mereka yang tidak mau mengambil syari'at yang diturunkan-Nya dan menyatakan luasnya ilmu Allah, terlaksananya apa yang Dia kehendaki dan menerangkan pula tentang hikmah(kebijaksanaan)-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 6",
    "description": "Hanya dialah yang membentuk kamu dalam rahim ibumu menurut yang dia kehendaki; laki-laki atau perempuan, baik atau buruk, bahagia atau sengsara. Tidak ada tuhan yang pantas disembah selain dia, yang mahaperkasa dan tidak terkalahkan, mahabijaksana dalam menetapkan dan mengelola segala sesuatu hanya dialah yang menurunkan kitab Al-Qur'an kepadamu, wahai nabi Muhammad, untuk engkau sampaikan dan jelaskan maksudnya kepada seluruh umat manusia. Apa yang diturunkan itu terdiri atas dua kelompok, di antaranya ada ayat-ayat yang muhkama't, yakni yang kandungannya sangat jelas, sehingga hampir-hampir tidak lagi dibutuhkan penjelasan tambahan untuknya, atau yang tidak mengandung makna selain yang terlintas pertama kali dalam benak. Ayat-ayat muhkama't itulah pokok-pokok kitab suci Al-Qur'an. Dan kelompok ayat-ayat yang lain dalam Al-Qur'an yaitu mutasyabihat, yakni ayat-ayat yang mengandung beberapa pengertian, samar artinya dan sulit dipahami kecuali setelah merujuk kepada yang muhkam, atau hanya Allah yang mengetahui maknanya. Adapun orang-orang yang dalam hatinya condong pada kesesatan, mereka mengikuti dengan sungguh-sungguh yang mutasya'biha't, dengan berpegang teguh kepada ayat-ayat itu semata-mata dan tidak menjadikan ayatayat muhkamat sebagai rujukan dalam memahami atau menetapkan artinya. Tujuan mereka melakukan itu adalah untuk mencari-cari fitnah, yakni kekacauan dan kerancuan berpikir serta keraguan di kalangan orang-orang beriman, dan untuk mencari-cari dengan sungguh-sungguh takwilnya yang sejalan dengan kesesatan mereka. Mereka melakukan itu padahal tidak ada yang mengetahui takwilnya kecuali Allah. Dan sikap mereka itu bertentangan dengan sikap ar-ra'sikhain faal-'ilm, yakni orang orang yang ilmunya mendalam dan imannya mantap. Atau, seperti dalam salah satu bacaan (qira'at) yang mutawa'tir, takwil ayat-ayat mutasyabihat itu juga dapat diketahui oleh ar-ra'sikhain fa al-'ilm. Dengan demikian, ayat-ayat mutasyabihat itu diturunkan untuk memotivasi para ulama agar giat melakukan studi, menalar, berpikir, teliti dalam berijtihad dan menangkap pesan-pesan agama. Orang-orang yang mendalam ilmunya dan mantap imannya itu berkata, kami beriman kepadanya, yakni Al-Qur'an, semuanya, yakni yang mutasyabihat dan muhkamat, berasal dari sisi tuhan kami. Tidak ada yang dapat mengambil pelajaran dan memahami maknanya dengan baik dan benar kecuali orang yang berakal, yaitu orang-orang yang memiliki akal sehat yang tidak mengikuti keinginan hawa nafsu."
  }
]