[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": ". Kebenaran yang tida ada keraguan di dalamnya tentang Isa adalah yang datang kepadamu (wahai rosul) dari tuhanmu, maka teruslah di atas keyakinanmu, dan tetaplah di atas apa yang kamu ada padanya dari meninggalkan perkara yang diada-ada, dan janganlah kamu menjadi golongan orang-orang yang ragu. Dan dalam ayat ini terdapat ketetapan dan ketenangan bagi rosul"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "60. Fakta yang tidak diragukan kebenarannya tentang Isa ialah keterangan yang turun kepadamu dari Rabbmu. Maka janganlah kamu termasuk orang-orang yang bimbang dan ragu-ragu. Engkau harus teguh pendirian terhadap kebenaran yang engkau yakini."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "60-61. Hai Rasulullah, inilah kebenaran yang datang dari Tuhan-Mu dalam perkara Isa, maka tetaplah dalam keyakinanmu, dan jangan menjadi termasuk orang-orang yang ragu terhadap kesalahan orang-orang Yahudi dalam kepercayaan mereka tentang Isa. Dan barangsiapa yang membantahmu tentang Isa setelah jelas kebenaran bagimu yang datang dari wahyu, maka katakanlah kepada mereka: “kemarilah berkumpul dan panggillah anak-anak dan istri-istri kita, kemudian bermunajat kepada Allah agar Dia menurunkan siksaan dan laknat-Nya kepada orang yang berdusta tentang Isa."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "60. فَلَا تَكُن مِّنَ الْمُمْتَرِينَ ( karena itu janganlah kamu termasuk orang-orang yang ragu-ragu) Perkataan ini ditujukan kepada semua yang mendengarkannya; yakni janganlah salah satu dari kalian ragu terhadap berita dari Allah tentang Isa. Atau perkataan dan larangan ini ditujukan kepada Rasulullah untuk menambah keteguhannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "60 Wahyu yang telah Kami ceritakan itu, itulah yang benar dari Tuhanmu wahai Nabi, karena itu janganlah kamu termasuk orang-orang yang ragu-ragu. Pencegahan kepada rasul adalah untuk menambahkan penekanan dan untuk setiap pendengar."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kebenaran itu dari Tuhanmu. Maka janganlah kamu termasuk orang-orang yang ragu} orang-orang yang ragu tentang itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "59-62. Ketika Allah memberitakan tentang kisah Maryam dan Nabi Isa, dan berita tersebut adalah suatu kebenaran, dan bahwasanya beliau adalah seorang hamba yang telah diberikan oleh Allah karunia atasnya, dan bahwa barangsiapa yang menduga bahwa ada suatu sifat ketuhanan padanya, ia telah mendustai seluruh nabi-nabiNya dan mendustai Isa. Sesungguhnya syubhat yang terjangkit pada orang yang menjadikan beliau itu sebagai tuhan adalah syubhat yang sangat batil. Sekiranya ada sedikit saja kebenaran dalam hal itu, maka pastilah Nabi adam lebih berhak dikultuskan sebagai tuhan, karena beliau diciptakan tanpa ayah dan ibu. Tapi sekalipun demikian, seluruh manusia bersepakat bahwasanya beliau itu adalah seorang hamba di antara hamba-hamba Allah, maka klaim ketuhanan Isa yang didasari oleh penciptaannya hanya dengan seorang ibu tanpa ayah merupakan klaim yang paling batil dari tuduhan-tuduhan yang ada. Inilah yang haq, yang tidak ada keraguan padanya yaitu bahwa Isa itu adalah sebagaimana yang beliau sendiri katakan tentang dirinya. \"Aku tidak pernah mengatakan kepada mereka kecuali apa yang Engkau perintahkan kepadaku (mengatakan)nya yaitu: “Sembahlah Allah, Tuhanku dan Tuhanmu”, dan adalah aku menjadi saksi terhadap mereka, selama aku berada di antara mereka. Maka setelah Engkau wafatkan aku, Engkau-lah yang mengawasi mereka. Dan Engkau adalah Maha Menyaksikan atas segala sesuatu\" QS –Al- Maidah: 117- Pernah Datang kepada Nabi delegasi kaum Nasrani daerah Najran di mana mereka bersikeras dalam kebatilan mereka setelah Nabi menegakkan atas mereka hujjah-hujjah dan keterangan yang jelas bahwasanya Isa itu adalah seorang hamba Allah dan RasulNya dimana mereka meyakini ketuhanannya. Sikap keras kepala mereka telah sampai pada titik dimana Allah memerintahkan kepada beliau agar menantang mereka untuk bermubahalah karena sesungguhnya kebenaran itu telah jelas bagi mereka, akan tetapi kedurhakaan dan fanatisme telah menghalangi mereka dari menerima kebenaran tersebut. Maka Rasulullah menantang mereka untuk bermubahalah di mana mereka menghadirkan keluarga dan anak-anak mereka dan beliau pun menghadirkan keluarga dan anak-anak beliau kemudian mereka semua berdoa kepada Allah agar menurunkan siksa dan laknatNya atas orang-orang yang berdusta. Kemudian mereka mengadakan musyawarah dahulu apakah mereka menerima tantangan itu, dan akhirnya keputusan mereka sepakat untuk tidak akan meladeni tantangan tersebut karena mereka yakin bahwa beliau itu benar-benar Nabi Allah dan bahwa apabila mereka menerima tantangan itu, pastilah mereka beserta keluarga dan anak-anak mereka akan celaka, maka akhirnya mereka meminta perjanjian damai dengan beliau dengan memberikan kepada beliau bayaran jizyah, lalu Rasulullah menerima keputusan mereka tersebut dan tidak mengusir mereka, karena maksud yang diinginkan telah terpenuhi yaitu jelasnya kebenaran. Tampak jelaslah kedurhakaan mereka di mana mereka bersikeras untuk tidak menerima tantangan tersebut, dan hal itu menjelaskan bahwa mereka itu adalah orang-orang yang zhalim. Oleh karena itu Allah berfirman, “Sesungguhnya ini adalah kisah yang benar,” yaitu kisah yang tidak ada keraguan padanya. “Dan sesungguhnya Allah, Dia-lah yang Mahaperkasa,” yakni, yang dengan kekuasaan dan kekuatanNya menguasai seluruh makhluk yang tunduk patuh kepadaNya dari penghuni langit dan bumi. Dan bersama itu, Dia “mahabijaksana” Yang meletakkan segala sesuatu pada tempatnya dan menempatkannya pada posisinya yang tepat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 60: Sesungguhnya perbandingan sisi Allah, adalah seperti lantaran itu, janganlah engkau jadi seorang daripada orang-orang yang ragu-ragu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dalam ayat ini terdapat peneguhan dan penenteraman hati Rasulullah shallallahu 'alaihi wa sallam. Dari ayat ini diambil sebuah prinsip, bahwa perkara yang ditegaskan oleh dalil-dalil bahwa hal itu adalah hak (benar) dan meyakinkan hamba baik terkait dengan masalah 'aqidah maupun lainnya, maka wajib diyakini bahwa selain itu adalah batil, dan bahwa semua syubhat yang datang kepadanya adalah fasid (rusak), baik hamba tersebut sanggup menolak syubhat itu maupun tidak. Dengan prinsip ini, semua kemusykilan yang dilontarkan oleh ahli kalam dan ahli mantiq dapat tersingkirkan, kalau pun seseorang hendak membantah, maka hal itu merupakan kerelaan menambah amalan. Kalau pun tidak membantah, maka tugasnya adalah menerangkan kebenaran dengan dalil-dalilnya dan berdakwah kepadanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 60",
    "description": "Demikian itu, karena kebenaran itu dari tuhanmu, karena itu janganlah engkau, wahai nabi Muhammad, termasuk orang-orang yang ragu terhadap proses penciptaan nabi isa bin maryam. Setelah beberapa ayat sebelumnya dipaparkan kekeliruan anggapan kaum nasrani bahwa Allah mempunyai anak, sekaligus menunjukkan bukti-bukti kekeliruannya, namun mereka tetap menolaknya, maka sebagai jalan terakhir untuk membuktikan siapa yang paling benar antara mereka yang menganggap isa sebagai anak tuhan atau isa sebagai rasul Allah, dilakukanlah doa muba'halah. Siapa yang membantahmu dalam hal ini, yaitu keberadaan isa sebagai manusia biasa dan sebagai utusan Allah, setelah engkau memperoleh ilmu atau pengetahuan tentang hal itu, maka katakanlah, wahai nabi Muhammad, marilah kita panggil anak-anak kami dan anak-anak kalian, istri-istri kami dan istri-istri kalian, kami sendiri dan kalian juga, kemudian marilah kita ber-Mubahalah, yaitu masing-masing pihak yang berbeda pendapat berdoa kepada tuhan dengan sungguh-sungguh, agar laknat Allah ditimpakan kepada orangorang yang dusta. Hanya saja, peristiwa mubahalah ini pada akhirnya tidak terjadi, sebab orang-orang nasrani najran tidak berani datang, karena dalam hati mereka sejatinya memang membenarkan kerasulan nabi Muhammad."
  }
]