[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": ". Sesungguhnya berita yang Aku beritahukan kepadamu ini (wahai rosul), dari perkara Isa adalah sungguh berita yang benar yang tidak ada keraguan padanya. Dan tidak ada sembahan yang berhak disembah kecuali Allah saja, dan sesungguhnya Allah sungguh Dia Maha perkasa dalam kerajaan Nya, Maha Bijaksana dalam pengaturan Nya dan perbuatan Nya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "62. Sesungguhnya apa yang Kami ceritakan tentang Isa -'alaihissalām- ini adalah berita yang benar, tidak ada kebohongan dan keraguan terhadapnya. Tidak ada sesembahan yang berhak disembah selain Allah semata. Dan sesungguhnya Allah lah Yang Maha Perkasa di dalam kerajaan-Nya lagi Maha Bijaksana dalam pengaturan dan perintah-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "62. Allah menegaskan: “kisah Isa yang Aku kisahkan kepadamu adalah kenyataan yang sebenarnya. Dan tidak ada sesembahan yang berhak disembah selain Allah, Dia Maha Perkasa dalam kekuasaan-Nya dan Maha Bijaksana dalam firman dan perbuatan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "62. إِنَّ هٰذَا (Sesungguhnya ini ) Yakni yang dikisahkan Allah kepada Rasulullah tentang kisah Nabi Isa. لَهُوَ الْقَصَصُ الْحَقُّ ۚ (adalah kisah yang benar ) Yakni kisah yang sesuai dengan kejadian yang sesungguhnya tentang kelahiran Nabi Isa dan masa pertumbuhannya dan apa yang dikatakan dan diserukannya; dan bukan apa yang dibesar-besarkan orang-orang Nasrani dalam hal ini. Dari Ibnu Abbas ia berkata: bahwa sekelompok penduduk Najran datang kepada Nabi Muhammad, dan diantara mereka adalah pemimpin dan penasehat mereka. Mereka berkata: apa urusanmu menyebut sahabat kami? Rasulullah berkata: siapa yang kalian maksud? Mereka menjawab: yakni Isa, kamu menganggapnya sebagai hamba Allah, apakah kamu pernah melihat orang yang sepertinya atau kamu diceritakan tentangnya? Kemudian mereka pergi. Lalu datanglah malaikat Jibril dan berkata: katakanlah kepada mereka apabila mereka mendatangimu: ( Sesungguhnya misal (penciptaan) Isa di sisi AllAh, adalah seperti (penciptaan) Adam…...sampai akhir ayat) Dan dalam hadist Imam Bukhari dan Muslim: (…maka Rasulullah ingin melaknat (bermubahalah) mereka berdua (pemimpin dan penasehat mereka). Maka salah satu dari mereka berkata kepada temanya itu: jangan kita melaknatnya, demi Allah jika benar ia seorang nabi kemudian melaknat kita, pasti kita dan orang setelah kita tidak akan beruntung selamanya. Kemudian mereka berkata kepada Nabi Muhammad: kami akan memberimu apa yang kau minta, maka utuslah bersama kami seorang yang terpercaya. Lalu Rasulullah berkata: berdirilah wahai Abu Ubaidah. Setelah ia berdiri Rasulullah berkata: lelaki ini adalah orang terpercaya umat ini). وَإِنَّ اللهَ لَهُوَ الْعَزِيزُ الْحَكِيمُ ( dan sesungguhnya Allah, Dialah Yang Maha Perkasa lagi Maha Bijaksana) Yakni tidak ada yang berhak disembah selain Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "62 Sesungguhnya kisah Isa ini adalah kisah yang benar-benar terjadi tentang kelahirannya serta keadaan dan manhaj seruannya. Dan tak ada Tuhan yang berhak disembah selain Allah semata; dan sesungguhnya Allah Dia lah Yang mencitakan segala sesuatu, Dialah Yang Maha Perkasa Yang menguasai semua ini lagi Maha Bijaksana dalam segala perbuatan-Nya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya ini benar-benar kisah} kabar {yang benar. Tidak ada tuhan selain Allah, dan sesungguhnya Allahlah yang benar-benar Maha perkasa lagi Maha bijaksana."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 62: Yang Maha Benar; dan tidak ada Tuhan melainkan Allah; dan sesungguhnya Allah itu Ialah Yang Gagah, Yang Bijaksana."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 62",
    "description": "Ayat selanjutnya menegaskan tentang kebenaran kisah-kisah dalam Al-Qur'an. Sungguh, kisah isa bin maryam yang berakhir dengan doa muba'halah ini dan juga kisah-kisah lain dalam Al-Qur'an adalah kisah atau kumpulan informasi yang memberi petunjuk kepada agama yang benar dan membawanya kepada kebenaran hakiki, sekaligus bukti keesaan Allah yang tidak ada tuhan selain Allah, dan sungguh, Allah bukan saja mahakuasa tetapi juga mahaperkasa sehingga tidak ada seorang pun yang mampu mengalahkan-Nya, mahabijaksana dalam setiap pengaturan-Nya. Kemudian jika mereka tetap berpaling meski sudah diberikan buktibukti kemahakuasaan, kemahaperkasaan, dan kemahaesaan Allah, maka ketahuilah bahwa Allah maha mengetahui orang-orang yang berbuat kerusakan, baik melalui perkataan, perbuatan maupun keyakinannya."
  }
]