[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan jika mereka berpaling dari membenarkanmu dan mengikutimu maka mereka adalah orang-orang yang berbuat kerusakan, dan Allah Maha Mengetahui atas perbuatan mereka dan akan membalas mereka atas perbuatan tersebut"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "63. Apabila mereka berpaling dari agama yang engkau bawa dan tidak mau mengikutimu, itu adalah bagian dari kerusakan mereka. Allah Maha Mengetahui orang-orang yang berbuat kerusakan di muka bumi dan akan membalas mereka dengan balasan yang setimpal."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "63. Jika mereka berpaling dari kebenaran ini maka itu merupakan kerusakan, dan Allah Maha Mengetahui orang-orang yang berbuat kerusakan dan akan menghukum mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "63. فَإِن تَوَلَّوْا۟ فَإِنَّ اللهَ عَلِيمٌۢ بِالْمُفْسِدِينَ ( Kemudian jika mereka berpaling (dari kebenaran), maka sesunguhnya Allah Maha Mengetahui orang-orang yang berbuat kerusakan) Yakni jika mereka menolak kebenaran yang jelas ini maka itu merupakan perbuatan merusak di muka bumi yang sebenarnya karena itu berarti kembali kepada kesyirikan dan kekufuran. Dan Allah Maha Mengetahui orang-orang yang berbuat kerusakan dan Allah akan menyiksa atas perbuatan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "63 Kemudian jika mereka berpaling dari kebenaran yang jelas ini yaitu akidah pengesaan Allah yang diserukan kepada seluruh Nabi maka ini adalah kerusakan yang nyata, sebab itu adalah suatu kesyirikan dan kekufuran. Sesunguhnya Allah Maha Mengetahui orang-orang yang berbuat kerusakan dan akan mengazab mereka atas kerusakan yang mereka perbuat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika mereka berpaling} berpaling dari penjelasan tentang apa yang datang kepadamu {sesungguhnya Allah Maha Mengetahui orang-orang yang berbuat kerusakan"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 63: Sesungguhnya inilah kisah Lantaran itu, jika mereka berpaling belakang, maka sesungguhnya Allah mengetahui orang-orang yang berbuat rusuh."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sehingga nanti Allah akan memberikan hukuman kepada mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 63",
    "description": "Kemudian jika mereka tetap berpaling meski sudah diberikan buktibukti kemahakuasaan, kemahaperkasaan, dan kemahaesaan Allah, maka ketahuilah bahwa Allah maha mengetahui orang-orang yang berbuat kerusakan, baik melalui perkataan, perbuatan maupun keyakinannya. Tatkala mereka tidak berani ber-Muba'halah, sehingga tampaklah kebohongan dan kelemahan mereka, maka ayat ini mengajak mereka kepada tauhid dengan cara yang lebih lunak dan santun. Katakanlah, hai nabi Muhammad, wahai ahli kitab! jika kalian tetap menolak kebenaran hujjah tentang isa bin maryam padahal kalian mengetahuinya, maka marilah kita menuju kepada satu kalimat, pegangan yang sama yang memberi keputusan secara adil antara kami dan kamu, yaitu kitab taurat dan kitab-kitab lainnya, termasuk injil dan Al-Qur'an, bahwa di dalam kitab-kitab tersebut kita tidak diperbolehkan menyembah selain Allah dan kita tidak diperbolehkan mempersekutukan-Nya dengan sesuatu pun, dan jika cara ini juga tidak membawa hasil untuk mengajak mereka, maka yang terpenting bahwa kita tidak menjadikan satu sama lain tuhan-tuhan selain Allah untuk diikuti dan dituruti perintahnya padahal perintah itu keliru. Jika mereka tetap berpaling dari kebenaran setelah terpenuhi bukti-bukti, maka katakanlah kepada mereka, saksikanlah, bahwa kami adalah orang muslim, yaitu orang-orang yang benar-benar berserah diri kepada Allah dan semata-mata beribadah kepada-Nya."
  }
]