[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai rosul) kepada ahli kitab dari kaum Yahudi dan Nasroni; “kemarilah kalian kepada kalimat adil dan benar yang kita berpegang teguh kepadanya secara bersama-sama” yaitu kita menghususkan Allah satu-satunya dalam beribadah, dan kita tidak mengambil sekutu apapun bersama Nya, dari berhala atau patung atau salib atau toghut atau selain itu, dan tidak beragama sebagian dari kita kepada sebagian yang lain dengan ketaatan kepada selain Allah. Maka jika mereka berpaling dari ajakan yang baik ini, maka katakanlah kepada mereka (wahai orang-orang yang beriman) “persaksikanlah atas kami bahwa kami adalah orang-orang muslim yang melaksanakan ketaatan kepada tuhan kami dengan ibadah dan ikhlas. Dan ajakan kepada kalimat yang sama itu, sebagaimana ditujukan kepada orang-orang Yahudi dan Nashroni, ditujukan juga kepada orang-orang yang berbuat seperti perbuatan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "64. Katakanlah -wahai Rasul-, “Wahai Ahli Kitab dari kalangan Yahudi dan Nasrani, marilah kita bersatu pada kalimat keadilan yang sama-sama kita yakini bersama. Yaitu kita memurnikan pengabdian hanya kepada Allah; kita tidak perlu menyembah yang lain selain Dia, betapapun tingginya kedudukan dan pangkatnya; dan janganlah sebagian dari kita menjadikan sebagian yang lain sebagai tuhan-tuhan yang disembah dan ditaati selain Allah.” Jika mereka berpaling dari seruanmu untuk mengikuti kebenaran dan keadilan itu, maka katakanlah -wahai orang-orang mukmin- kepada mereka, “Saksikanlah bahwa kami adalah orang-orang yang tunduk dan berserah diri kepada Allah dengan menaati-Nya.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "64. Allah memerintahkan nabi Muhammad untuk mengajak orang-orang Yahudi dan Nasrani kepada kalimat yang benar, bahwa tidak ada Tuhan selain Allah dan kemudian kita berpegang teguh kepadanya, tidak menyembah selain Dia, dan tidak saling mentaati dalam menyembah selain-Nya. Jika mereka berpaling dari apa yang kau seru ini maka katakanlah kepada mereka: “saksikanlah bahwa kami adalah orang-orang yang berserah diri dan taat kepada Allah.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "64. قُلْ يٰٓأَهْلَ الْكِتٰبِ تَعَالَوْا۟ إِلَىٰ كَلِمَةٍ سَوَآءٍۭ (Katakanlah: “Hai Ahli Kitab, marilah (berpegang) kepada suatu kalimat (ketetapan) yang tidak ada perselisihan antara kami dan kamu ) Yakni serulah orang-orang Yahudi dan Nasrani sambil berkata: marilah bersepakat satu kata dalam wahyu yang diturunkan kepada kami dan wahyu yang diturunkan kepada kalian. Dan ini terkandung dalam firman-Nya -lanjutan dari ayat ini-. أَلَّا نَعْبُدَ إِلَّا اللهَ وَلَا نُشْرِكَ بِهِۦ شَيْـًٔا ( bahwa tidak kita sembah kecuali Allah dan tidak kita persekutukan Dia dengan sesuatupun). Yakni tidak kita jadikan suatu makhluk sebagai Tuhan salain Sang Pencipta Allah Ta’ala. وَلَا يَتَّخِذَ بَعْضُنَا بَعْضًا أَرْبَابًا ( dan tidak (pula) sebagian kita menjadikan sebagian yang lain sebagai tuhan) Yakni seperti orang yang meyakini ketuhanan al-Masih dan Uzair. Tidak ada diantara kita yang bersujud kepada yang lain namun kita semuanya bersujud hanya kepada Allah Tuhan semerta alam. فَإِن تَوَلَّوْا۟ (Jika mereka berpaling ) Yakni berpaling dari apa yang diserukan kepada mereka. فَقُولُوا۟ اشْهَدُوا۟ بِأَنَّا مُسْلِمُونَ ( maka katakanlah kepada mereka: “Saksikanlah, bahwa kami adalah orang-orang yang berserah diri) Yakni yang taat kepada hukum-hukum-Nya, ridha atasnya, dan mengakui kenikmatan yang dikaruniakan Allah kepada kita berupa agama yang lurus. Dari Ibnu Abbas ia berkata: Abu Sufyan meriwayatkan kepadaku bahwa Hirqal meminta untuk didatangkan kepadanya surat dari Rasulullah kemudian ia membacanya, dan isinya adalah: Bismillahirrahmanirrahim, dari Muhammad utusan Allah untuk Hirqal penguasa negeri Ruum, keselamatan atas orang yang mengikuti hidayah, amma ba’du: Sesungguhnya aku menyerumu dengan seruan Islam, masuklah Islam agar kamu selamat dan Allah akan memberimu pahala dua kali lipat; namun apabila kamu menolak maka bagimu dosa orang-orang Arisiyyin. Dan (Hai Ahli Kitab, marilah (berpegang) kepada suatu kalimat (ketetapan) yang tidak ada perselisihan antara kami dan kamu….-sampai pada firman-Nya- Saksikanlah, bahwa kami adalah orang-orang yang berserah diri (kepada Allah) (ali Imran:64)."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "64 Katakanlah wahai rasul: “Hai Ahli Kitab, marilah berpegang teguh kepada suatu ketetapan yang tidak ada perselisihan antara kami dan kamu. Kalimat yang adil yang diturunkan kepadaku dan kepada kalian. Yang sudah ada penjelasannya di semua kitab yang benar, yaitu dari suhuf Ibrahim, Taurat, Injil dan Al-quran. Bahwa agar kita tidak menyembah kecuali Allah dan tidak kita persekutukan Dia dengan sesuatupun dalam hal penciptaan, raja, rizki ataupun hak untuk disembah. Dan sebagian kita tidak pula menjadikan sesembahan selain Allah”. Seperti keyakinan bahwa Uzair dan Isa sebagai tuhan dalam penghalalan maupun pengharaman dan kita tidak bersujud kecuali hanya kepada Allah semata. Jika mereka berpaling maka katakanlah kepada mereka: “Saksikanlah, bahwa kami adalah orang-orang yang berserah diri kepada Allah dan hukum-hukum-Nya”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah, “Wahai Ahlul kitab, marilah menuju pada satu kalimat yang sama} yang adil {antara kami dan kamu, kita tidak menyembah selain Allah, kita tidak mempersekutukanNya dengan sesuatu apa pun, dan tidak sebagian kita menjadikan sebagian yang lain sebagai tuhan-tuhan selain Allah.” Jika mereka berpaling, katakanlah, “Saksikanlah bahwa sesungguhnya kami adalah orang-orang muslim.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "64. Ayat yang mulia ini adalah ayat yang ditulis oleh Nabi untuk dikirim kepada raja-raja Ahli Kitab. Beliau kadang membacanya pada rakaat pertama shalat Sunnah fajar. قُولُوا آمَنَّا بِاللَّهِ وَمَا أُنْزِلَ إِلَيْنَا وَمَا أُنْزِلَ إِلَىٰ إِبْرَاهِيمَ وَإِسْمَاعِيلَ وَإِسْحَاقَ وَيَعْقُوبَ وَالْأَسْبَاطِ وَمَا أُوتِيَ مُوسَىٰ وَعِيسَىٰ وَمَا أُوتِيَ النَّبِيُّونَ مِنْ رَبِّهِمْ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْهُمْ وَنَحْنُ لَهُ مُسْلِمُونَ – Al-Baqarah:136- Dan beliau membaca ayat tadi pada rakaat terakhir dari shalat Sunnah Shubuh; karena mengandung dakwah kepada satu agama, yang telah disepakati oleh para Nabi dan Rasul. Ayat itu juga mengandung tauhid uluhiyah yang berasaskan ibadah kepada Allah semata yang tidak ada sekutu bagiNya. Dan agar diyakini bahwa manusia dan seluruh makhluk dalam kapasitas kemanusiaan, salah seorang di antara mereka tidak berhak sedikit pun memiliki sifat-sifat keuluhiyahan. Bila ahli Kitab dan selain mereka patuh terhadap hal itu, maka mereka telah mendapat petunjuk dan “jika mereka berpaling, maka katakanlah kepada mereka, ‘Saksikanlah, bahwa kami adalah orang-orang yang berserah diri (kepada Allah)’.” Ini persis seperti Firman Allah, \"Katakanlah: “Hai orang-orang kafir, Aku tidak akan menyembah apa yang kamu sembah. Dan kamu bukan penyembah Tuhan yang aku sembah. Dan aku tidak pernah menjadi penyembah apa yang kamu sembah, dan kamu tidak pernah (pula) menjadi penyembah Tuhan yang aku sembah. Untukmu agamamu, dan untukkulah, agamaku”.\" QS -Al-Kafirun:1-6-"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 64: Katakanlah: '\"Hai Ahli Kitab! Marilah kepada kalimah yang adil antara kami dan kamu, yaitu janganlah kita menyembah melainkan Allah, dan janganlah kita menyekutukan sesuatu dengan Dia, dan janganlah sebagian daripada kita jadikan se bagian sebagai tuhan-tuhan selain dari Allah.\" Jika mereka berpaling belakang, hendaklah kamu berkata: \"Saksikanlah, bahwa sesungguhnya kami (ini) orang-orang Islam\""
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kalimat ini merupakan kalimat yang disepakati oleh para nabi dan rasul, dan tidak ada yang menyelisihinya selain orang yang keras kepala dan sesat. Kalimat tersebut bukanlah kalimat yang khusus bagi pihak tertentu, bahkan semua juga harus memilikinya. Hal ini merupakan sikap adil dalam berbicara dan inshaf dalam berdebat. Kalimat tersebut adalah kalimat Laailaahaillallah sebagaimana yang diterangkan pada kalimat selanjutnya. Baik dengan nabi, malaikat, patung, berhala, salib, hewan maupun benda mati. Seperti menjadikan rahib dan orang alim mereka sebagai tuhan, dengan mentaati apa yang mereka perintahkan meskipun menyalahi perintah Allah, misalnya ketika mereka menghalalkan apa yang Allah haramkan, mereka mengikutinya, dan ketika mereka mengharamkan apa yang Allah halalkan, mereka pun mengikutinya. Dalam ayat ini terdapat perintah agar kita hanya taat mutlak kepada Allah dan Rasul-Nya dan tidak taat kepada makhluk saat mereka bermaksiat kepada Allah. Faedah mengatakan kata-kata ini kepada mereka (ahlul kitab) untuk menegakkan hujjah kepada mereka. Di samping itu, jika kita telah tunduk dan beriman, maka Allah tidak peduli dengan orang-orang yang tidak mau masuk Islam karena memang niat mereka yang buruk, sebagaimana firman Allah Ta'ala: Katakanlah: \"Berimanlah kamu kepadanya atau tidak usah beriman (sama saja bagi Allah). Sesungguhnya orang-orang yang diberi pengetahuan sebelumnya apabila Al Quran dibacakan kepada mereka, mereka menyungkur atas muka mereka sambil bersujud, (Al Israa': 107) Demikian juga menunjukkan, bahwa ketika datang syubhat kepada seorang muslim, hendaknya mereka memperbaharui imannya dan menampakkan keislamannya sebagai pemberitahuan terhadap keimanannya dan tanda syukur terhadap nikmat Tuhannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 64",
    "description": "Tatkala mereka tidak berani ber-Muba'halah, sehingga tampaklah kebohongan dan kelemahan mereka, maka ayat ini mengajak mereka kepada tauhid dengan cara yang lebih lunak dan santun. Katakanlah, hai nabi Muhammad, wahai ahli kitab! jika kalian tetap menolak kebenaran hujjah tentang isa bin maryam padahal kalian mengetahuinya, maka marilah kita menuju kepada satu kalimat, pegangan yang sama yang memberi keputusan secara adil antara kami dan kamu, yaitu kitab taurat dan kitab-kitab lainnya, termasuk injil dan Al-Qur'an, bahwa di dalam kitab-kitab tersebut kita tidak diperbolehkan menyembah selain Allah dan kita tidak diperbolehkan mempersekutukan-Nya dengan sesuatu pun, dan jika cara ini juga tidak membawa hasil untuk mengajak mereka, maka yang terpenting bahwa kita tidak menjadikan satu sama lain tuhan-tuhan selain Allah untuk diikuti dan dituruti perintahnya padahal perintah itu keliru. Jika mereka tetap berpaling dari kebenaran setelah terpenuhi bukti-bukti, maka katakanlah kepada mereka, saksikanlah, bahwa kami adalah orang muslim, yaitu orang-orang yang benar-benar berserah diri kepada Allah dan semata-mata beribadah kepada-Nya. Mereka bukannya mengikuti ajaran tauhid, sebagai inti ajaran (millah) nabi ibrahim, akan tetapi mereka justru saling berbantah tentang siapa nabi ibrahim. Masing-masing mereka mengaku bahwa nabi ibrahim adalah pengikut mereka. Wahai ahli kitab, yahudi dan nasrani! mengapa kamu berbantah-bantahan tentang ibrahim, di mana masingmasing dari kalian menganggap nabi ibrahim itu dari golongan kalian, padahal taurat dan injil diturunkan setelah dia dengan jarak waktu yang sangat panjang. Allah menutup ayat ini dengan redaksi apakah kalian tidak mengerti atau pura-pura tidak mengerti bahwa yang datang lebih dahulu tidak mungkin mengikuti yang datang belakangan. Bukti sejarah ini sekaligus meruntuhkan klaim mereka tentang nabi ibrahim sebagai ahli kitab."
  }
]