[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai pemilik kitab yang diturunkan dari langit dari kaum Yahudi dan Nashrani, bagaimana setiap kalian mendebat tentang bahwasanya Ibrahim ada dalam agamanya, padahal tidaklah diturunkan taurot dan injil kecuali setelah dia? Apakah kalian tidak paham kesalahan ucapan kalian ; bahwasanya Ibrahim adalah orang Yahudi atau Nasrani, dan sungguh kalian telah mengetahui bahwa keyahudian dan kenasranian itu baru ada setelah wafatnya Ibrahim beberapa saat?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "65. Wahai Ahli Kitab, mengapa kamu berdebat tentang agama Ibrahim -'alaihissalām-? Orang Yahudi mengklaim bahwa Ibrahim adalah seorang penganut Yahudi. Dan orang Nasrani mengklaim bahwa Ibrahim adalah seorang penganut Nasrani. Sedangkan kamu tahu bahwa agama Yahudi dan Nasrani baru muncul jauh setelah Ibrahim meninggal dunia. Tidakkah kalian berpikir tentang kelirunya ucapan kalian dan salahnya anggapan kalian?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "65. Allah mengolok-olok kaum Yahudi dan Nasrani yang berkata: “Ibrahim dahulu berada dalam agama kami”. Maka Dia berfirman: “Mengapa kalian memeperselisihkan hal ini, padahal Taurat dan Injil diturunkan setelah masa Ibrahim? Apakah kalian tidak menyadari kesalahan perkataan kalian itu?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "65. لِمَ تُحَآجُّونَ فِىٓ إِبْرٰهِيمَ (mengapa kamu bantah membantah tentang hal Ibrahim ) Orang-orang Yahudi dan Nasrani masing-masing mengklaim bahwa Nabi Ibrahim berada diatas agama mereka. Maka Allah membantah mereka hal itu dengan menjelaskan bahwa agama Yahudi ada setelah Nabi Musa dengan Taurat sebagai kitabnya, dan agama Nasrani ada setelah Nabi Isa dengan Injil sebagai kitabnya. Adapun Nabi Ibrahim ada pada masa yang jauh sebelum itu, lalu bagaimana ia bisa menjadi seorang yahudi atau Nasrani?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "65 Hai Ahli Kitab Yahudi dan Nasrani, mengapa kamu bantah membantah agama Ibrahim. Sebagian Yahudi menyebut Ibrahim adalah Yahudi, begitu pula sebagian Nasrani menyebut bahwa ia adalah Nasrani. Padahal Taurat dan Injil tidak diturunkan melainkan sesudah Ibrahim. Bagaimana bisa Ibrahim menjadi Yahudi atau Nasrani? Apakah kamu tidak tahu rusaknya perkataan dan kesalahanmu? Ibnu Abbas berkata: Tukang kayu dan pendeta-pendeta Yahudi berkumpul dekat rasul, kemudian berkata kepada Nabi. Bahwa Ibrahim adalah Yahudi. Orang Nasrani berkata Ibrahim adalah Nasrani. Maka Allah menurunkan ayat ini hingga akhir ayat 67."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai Ahlul kitab, mengapa kamu berdebat tentang Ibrahim} kenapa kalian berdebat tentang agama Ibrahim {Taurat dan Injil tidak diturunkan, kecuali setelah dianya. Apakah kalian tidak berpikir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "65-68. Seluruh agama dari Yahudi, Nasrani, kaum musyrikin demikian juga Islam mengaku bahwa mereka mengikuti ajaran Nabi Ibrahim. Allah memberitakan bahwa manusia yang paling berhak atasnya adalah Nabi Muhammad beserta pengikut beliau serta pengikut al-Khalil (Nabi Ibrahim sendiri) sebelum Muhammad. Adapun orang-orang Yahudi, nasrani, dan kaum musyrikin, sesungguhnya Ibrahim berlepas diri dari mereka dan dari menjadi pembela mereka, oleh karena agama beliau adalah yang hanif dan membawa kemudahan yang mengandung keimanan kepada seluruh Rasul dan seluruh kitab-kitab (suci), dan ini adalah keistimewaan kaum Muslimin. Adapun klaim Yahudi dan Nasrani bahwa mereka berada di atas ajaran Ibrahim, maka telah diketahui bahwa agama Yahudi dan Nasrani yang mengaku menganut ajaran tersebut belum dibentuk kecuali setelah Ibrahim, lalu bagaimanakah mereka dapat membantah perkara ini yang telah diketahui padanya kebohongan dan dusta mereka? Taruhlah andaikan mereka mendebat tentang suatu hal yang mereka memiliki ilmu tentangnya namun bagaimana dalam kondisi seperti ini? Hal ini sebelum diperhatikan pendapat mereka yang penuh dengan kebohongan yang dapat diketahui akan batilnya klaimnya tersebut. Ayat ini juga merupakan sebuah dalil bahwa tidaklah halal bagi seorang manusia berkata atau berdebat tentang sesuatu yang tidak ia miliki ilmunya. Dan FirmanNya, “Dan Allah adalah pelindung semua orang-orang yang beriman.” Maka semakin kuat iman seorang manusia, niscaya Allah akan melindungiNya dengan kelembutanNya, memudahkannya dengan segala kemudahan, dan menjauhkannya dari kesulitan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 65: Kamu berbantah-bantah tentang Ibrahim, padahal tidak diturunkan Taurat dan Injil melainkan sesudahnya: apakah kamu tidak berfikir?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini turun ketika orang-orang Yahudi mengatakan bahwa Nabi Ibrahim beragama Yahudi, sedangkan orang-orang Nasrani mengatakan bahwa Nabi Ibrahim beragama Nasrani. Maka Allah membantah mereka dengan tiga alasan: Pertama, perdebatan mereka tentang Nabi Ibrahim 'alaihis salam merupakan perdebatan yang tidak memiliki ilmu tentangnya. Kedua, Taurat dan Injil tidaklah diturunkan kecuali setelah Nabi Ibrahim 'alaihis salam, sehingga bagaimana mungkin Nabi Ibrahim menisbatkan diri kepada mereka, sedangkan Beliau datang sebelum mereka. Ketiga, Allah Ta'ala menyucikan Beliau dari orang-orang Yahudi, Nasrani dan orang-orang musyrik, serta menjadikan Beliau sebagai seorang yang hanif lagi muslim. Di samping itu, agama Yahudi dan Nasrani muncul jauh setelah Beliau."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 65",
    "description": "Mereka bukannya mengikuti ajaran tauhid, sebagai inti ajaran (millah) nabi ibrahim, akan tetapi mereka justru saling berbantah tentang siapa nabi ibrahim. Masing-masing mereka mengaku bahwa nabi ibrahim adalah pengikut mereka. Wahai ahli kitab, yahudi dan nasrani! mengapa kamu berbantah-bantahan tentang ibrahim, di mana masingmasing dari kalian menganggap nabi ibrahim itu dari golongan kalian, padahal taurat dan injil diturunkan setelah dia dengan jarak waktu yang sangat panjang. Allah menutup ayat ini dengan redaksi apakah kalian tidak mengerti atau pura-pura tidak mengerti bahwa yang datang lebih dahulu tidak mungkin mengikuti yang datang belakangan. Bukti sejarah ini sekaligus meruntuhkan klaim mereka tentang nabi ibrahim sebagai ahli kitab. Selanjutnya Allah memberi isyarat tentang ketidakbenaran anggapan mereka sekaligus kebodohan mereka tentang nabi ibrahim. Begitulah kenyataan yang terjadi di antara kamu! kamu bukan saja berbantahbantahan tentang apa yang kamu ketahui, yaitu tentang nabi musa, nabi isa, dan nabi Muhammad, tetapi kamu juga berbantah-bantahan tentang apa yang tidak kamu ketahui, yaitu tentang nabi ibrahim' padahal Allah mengetahui sejarah masing-masing, lalu dia menginformasikan kepada kalian melalui rasul-Nya yang terakhir, nabi Muhammad, sedang kamu tidak mengetahui melainkan hanya dugaan semata yang tidak memiliki alasan yang kuat."
  }
]