[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apa yang kalian debatkan kepada rosululloh Muhammad dalam sesuatu yang kalian ketahui dari urusan agama kalian, dari apa yang kalian yakini kebenarannya dalam kitab-kitab kalian, lalu kenapa kalian mendebat sesuatu yang tidak ada pengetahuan pada diri kalian tentang itu dari perkara Ibrahim? Dan Allah mengetahui urusan-urusan sampai yang tersembunyi nya sedangkan kalian tidak mengetahui."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "66. Hai kalian -kaum Ahli Kitab- kalian (boleh) berdebat dengan Nabi -ṣallallāhu 'alaihi wa sallam- tentang sesuatu yang kamu ketahui menyangkut urusan agamamu dan apa yang diturunkan kepadamu. Lalu mengapa kamu berdebat dengannya tentang sesuatu yang tidak kamu ketahui menyangkut urusan Ibrahim dan agamanya, sedangkan masalah itu tidak tertulis di dalam Kitab-kitab sucimu dan tidak pernah disampaikan oleh nabi-nabimu? Allah mengetahui hakikat segala sesuatu dan rahasia yang ada di baliknya, sedangkan kalian tidak mengetahuinya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "66. Allah memperingatkan dan mengolok-olok para Ahli kitab karena mendebat Nabi Muhammad tentang sesuatu yang mereka ketahui dari Taurat dan Injil, maka kenapa mereka berdebat pula tentang hal yang tidak mereka ketahui? Yaitu tentang pengakuan bahwa Ibrahim dahulu berada dalam agama mereka. Allah Maha Mengetahui kebanaran, sedangkan kalian tidak mengetahuinya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "66. هٰٓأَنتُمْ هٰٓؤُلَآءِ حٰجَجْتُمْ فِيمَا لَكُم بِهِۦ عِلْمٌ ( Beginilah kamu, kamu ini (sewajarnya) bantah membantah tentang hal yang kamu ketahui) Dan yang dimaksud dengan apa yang mereka ketahui adalah apa yang ada dalam kitab Taurat yang meliputi halal dan haram, dan jenis-jenis ibadah meski mereka menyelisihi konsekuensi dari ilmu tersebut dan membantahnya dengan cara yang bathil. Adapun apa yang tidak mereka ketahui adalah pengakuan mereka bahwa Nabi Ibrahim diatas agama mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Di dalam al-qur'an Allah mencela empat macam bantahan : 1- Membantah tanpa didasari dengan pengetahuan : { هَا أَنْتُمْ هَٰؤُلَاءِ حَاجَجْتُمْ فِيمَا لَكُمْ بِهِ عِلْمٌ فَلِمَ تُحَاجُّونَ فِيمَا لَيْسَ لَكُمْ بِهِ عِلْمٌ ۚ } \"Beginilah kamu, kamu ini (sewajarnya) bantah membantah tentang hal yang kamu ketahui, maka kenapa kamu bantah membantah tentang hal yang tidak kamu ketahui ?\" 2- Membantah suatu kebenaran yang telah nyata : { يُجَادِلُونَكَ فِي الْحَقِّ بَعْدَمَا تَبَيَّنَ } \"mereka membantahmu tentang kebenaran sesudah nyata (bahwa mereka pasti menang)\" [al-anfal : 6] 3- Membantah dengan cara yang bathil : { وَجَادَلُوا بِالْبَاطِلِ لِيُدْحِضُوا بِهِ الْحَقَّ } \"dan mereka membantah dengan (alasan) yang batil untuk melenyapkan kebenaran dengan yang batil itu\" [ghafir : 5] 4- Membantah ayat-ayat Allah : { مَا يُجَادِلُ فِي آيَاتِ اللَّهِ إِلَّا الَّذِينَ كَفَرُوا } \"Tidak ada yang memperdebatkan tentang ayat-ayat Allah, kecuali orang-orang yang kafir\" [ghafir : 5]"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "66 Wahai Yahudi dan Nasrani, kamu telah membantah tentang hal yang kamu ketahui dan ada dalam kitab kalian Taurat, baik tentang halal dan haram dan mecam ibadah maka kenapa kamu bantah membantah tentang hal yang tidak kamu ketahui? Yaitu klaim tentang Ibrahim sebagai penganut agama kalian. Allah mengetahui tentang yang benar, sedang kamu tidak mengetahui."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Begitulah kalian. Kalian beradu argumen} kalian berdebat {tentang apa yang kalian ketahui, tetapi mengapa kalian berdebat juga tentang apa yang tidak kalian ketahui Allah mengetahui, sedangkan kalian tidak mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "65-68. Seluruh agama dari Yahudi, Nasrani, kaum musyrikin demikian juga Islam mengaku bahwa mereka mengikuti ajaran Nabi Ibrahim. Allah memberitakan bahwa manusia yang paling berhak atasnya adalah Nabi Muhammad beserta pengikut beliau serta pengikut al-Khalil (Nabi Ibrahim sendiri) sebelum Muhammad. Adapun orang-orang Yahudi, nasrani, dan kaum musyrikin, sesungguhnya Ibrahim berlepas diri dari mereka dan dari menjadi pembela mereka, oleh karena agama beliau adalah yang hanif dan membawa kemudahan yang mengandung keimanan kepada seluruh Rasul dan seluruh kitab-kitab (suci), dan ini adalah keistimewaan kaum Muslimin. Adapun klaim Yahudi dan Nasrani bahwa mereka berada di atas ajaran Ibrahim, maka telah diketahui bahwa agama Yahudi dan Nasrani yang mengaku menganut ajaran tersebut belum dibentuk kecuali setelah Ibrahim, lalu bagaimanakah mereka dapat membantah perkara ini yang telah diketahui padanya kebohongan dan dusta mereka? Taruhlah andaikan mereka mendebat tentang suatu hal yang mereka memiliki ilmu tentangnya namun bagaimana dalam kondisi seperti ini? Hal ini sebelum diperhatikan pendapat mereka yang penuh dengan kebohongan yang dapat diketahui akan batilnya klaimnya tersebut. Ayat ini juga merupakan sebuah dalil bahwa tidaklah halal bagi seorang manusia berkata atau berdebat tentang sesuatu yang tidak ia miliki ilmunya. Dan FirmanNya, “Dan Allah adalah pelindung semua orang-orang yang beriman.” Maka semakin kuat iman seorang manusia, niscaya Allah akan melindungiNya dengan kelembutanNya, memudahkannya dengan segala kemudahan, dan menjauhkannya dari kesulitan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 66: Ingat! Kamu ini orang-orang yang pernah berbantahan tentang urusan yang kamu mempunyai pengetahuan padanya, tetapi mengapalah kamu berbantahan tentang urusan tidak mempunyai pengetahuan padanya? Dan Allah itu mengetahui dan kamu tidak mengetahui."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni tentang Nabi Musa 'alaihis salam, Nabi Isa 'alaihis salam dan Nabi Muhammad shallallahu 'alaihi wa sallam. Yakni tentang Nabi Ibrahim 'alaihis salam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 66",
    "description": "Selanjutnya Allah memberi isyarat tentang ketidakbenaran anggapan mereka sekaligus kebodohan mereka tentang nabi ibrahim. Begitulah kenyataan yang terjadi di antara kamu! kamu bukan saja berbantahbantahan tentang apa yang kamu ketahui, yaitu tentang nabi musa, nabi isa, dan nabi Muhammad, tetapi kamu juga berbantah-bantahan tentang apa yang tidak kamu ketahui, yaitu tentang nabi ibrahim' padahal Allah mengetahui sejarah masing-masing, lalu dia menginformasikan kepada kalian melalui rasul-Nya yang terakhir, nabi Muhammad, sedang kamu tidak mengetahui melainkan hanya dugaan semata yang tidak memiliki alasan yang kuatsetelah ayat sebelumnya menjelaskan ketidakbenaran anggapan ahli kitab tentang nabi ibrahim, lalu Allah membantah anggapan mereka sekaligus menjelaskan sosok nabi ibrahim sebenarnya. Nabi ibrahim bukanlah seorang yahudi dan bukan pula seorang nasrani, tetapi dia adalah seorang yang lurus, yaitu jauh dari syirik atau mempersekutukan Allah dan jauh dari kesesatan, sekaligus muslim yaitu seorang yang berserah diri kepada Allah semata dan dia tidaklah termasuk orang-orang musyrik sebagaimana orang yahudi dan nasrani yang meyakini uzair dan nabi isa sebagai anak tuhan."
  }
]