[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bukanlah Ibrahim itu seorang Yahudi dan bukan juga seorang Nasrani, karena tidak ada yahudi dan nasrani kecuali setelahnya, akan tetapi dia mengikuti perintah Allah dan taat kepada Nya serta berserah diri kepada tuhannya, dan tidak termasuk orang-orang yang Musyrik."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "67. Ibrahim -'alaihissalām- tidak pernah menganut agama Yahudi maupun Nasrani, tetapi dia cenderung menjauhi agama-agama yang batil dan memilih berserah diri kepada Allah -Ta'ālā- seraya mengesakan-Nya. Dan dia juga tidak termasuk orang-orang yang menyekutukan Allah dengan sesuatu sebagaimana anggapan orang-orang musyrik Arab yang mengklaim bahwa mereka adalah penganut agama Ibrahim."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "67-68. Allah mengingkari klaim orang-orang yang mengaku Ibrahim berada dalam agama mereka. Ibrahim adalah orang yang mengikuti perintah Allah dan tunduk kepada-Nya, dia tidak pernah menyekutukan-Nya. Dan manusia yang paling berhak atas Ibrahim adalah orang-orang yang mengikuti agamanya, yaitu nabi Muhammad beserta orang-orang yang beriman kepadanya. Allah adalah penolong orang-orang yang beriman kepada Allah dan rasul-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "67. وَلٰكِن كَانَ حَنِيفًا ( akan tetapi dia adalah seorang yang lurus) Yakni yang tidak condong kepada agama-agama lain, melainkan condong kepada tauhid. مُّسْلِمًا ( lagi berserah diri) Yakni taat kepada Allah dan senantiasa beribadah kepada-Nya, dan beragama Islam."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "67 Ibrahim bukan seorang Yahudi dan bukan pula seorang Nasrani, sebab dia lebih dulu ada daripada dua agama yang berbeda ini. Adapun semua agama yang ada adalah mengesakan Allah dan menjunjung kebenaran. Dia taat kepada Allah dan sekali-kali bukanlah dia termasuk golongan orang-orang musyrik yang menyembah tuhan lain selain Allah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ibrahim bukanlah seorang Yahudi, bukan pula seorang Nasrani, melainkan dia adalah seorang yang hanif} terhindar dari agama-agama yang bathil {dan berserah diri. Dia bukan termasuk orang-orang musyrik"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "65-68. Seluruh agama dari Yahudi, Nasrani, kaum musyrikin demikian juga Islam mengaku bahwa mereka mengikuti ajaran Nabi Ibrahim. Allah memberitakan bahwa manusia yang paling berhak atasnya adalah Nabi Muhammad beserta pengikut beliau serta pengikut al-Khalil (Nabi Ibrahim sendiri) sebelum Muhammad. Adapun orang-orang Yahudi, nasrani, dan kaum musyrikin, sesungguhnya Ibrahim berlepas diri dari mereka dan dari menjadi pembela mereka, oleh karena agama beliau adalah yang hanif dan membawa kemudahan yang mengandung keimanan kepada seluruh Rasul dan seluruh kitab-kitab (suci), dan ini adalah keistimewaan kaum Muslimin. Adapun klaim Yahudi dan Nasrani bahwa mereka berada di atas ajaran Ibrahim, maka telah diketahui bahwa agama Yahudi dan Nasrani yang mengaku menganut ajaran tersebut belum dibentuk kecuali setelah Ibrahim, lalu bagaimanakah mereka dapat membantah perkara ini yang telah diketahui padanya kebohongan dan dusta mereka? Taruhlah andaikan mereka mendebat tentang suatu hal yang mereka memiliki ilmu tentangnya namun bagaimana dalam kondisi seperti ini? Hal ini sebelum diperhatikan pendapat mereka yang penuh dengan kebohongan yang dapat diketahui akan batilnya klaimnya tersebut. Ayat ini juga merupakan sebuah dalil bahwa tidaklah halal bagi seorang manusia berkata atau berdebat tentang sesuatu yang tidak ia miliki ilmunya. Dan FirmanNya, “Dan Allah adalah pelindung semua orang-orang yang beriman.” Maka semakin kuat iman seorang manusia, niscaya Allah akan melindungiNya dengan kelembutanNya, memudahkannya dengan segala kemudahan, dan menjauhkannya dari kesulitan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 67: Bukanlah Ibrahim itu seorang yang Yahudi dan bukan seorang Nasrani; tetapi adalah ia seorang yang jauh daripada kesesatan, ia seorang Muslim dan bukanlah (pula) ia seorang daripada musyrikin."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Lurus berarti jauh dari syirik (mempersekutukan Allah) dan jauh dari kesesatan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 67",
    "description": "Setelah ayat sebelumnya menjelaskan ketidakbenaran anggapan ahli kitab tentang nabi ibrahim, lalu Allah membantah anggapan mereka sekaligus menjelaskan sosok nabi ibrahim sebenarnya. Nabi ibrahim bukanlah seorang yahudi dan bukan pula seorang nasrani, tetapi dia adalah seorang yang lurus, yaitu jauh dari syirik atau mempersekutukan Allah dan jauh dari kesesatan, sekaligus muslim yaitu seorang yang berserah diri kepada Allah semata dan dia tidaklah termasuk orang-orang musyrik sebagaimana orang yahudi dan nasrani yang meyakini uzair dan nabi isa sebagai anak tuhan. Jika demikian, orang yang paling dekat atau yang paling berhak dinisbatkan kepada ibrahim dan ajaran yang dianutnya ialah orang yang mengikutinya, yaitu yang menjawab ajakan nabi ibrahim kepada tauhid, begitu juga nabi ini, Muhammad, dan orang-orang yang beriman yakni para pengikut agama tauhid secara konsisten dan sunggung-sungguh. Allah adalah pelindung orang-orang yang beriman dengan senantiasa memberi pertolongan di dunia dan memberi balasan surga di akhirat kelak."
  }
]