[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang yang paling berhak terhadap Ibrahim dan yang paling husus dengannya adalah orang-orang yang beriman kepadanya dan membenarkan risalahnya dan mengikutinya diatas agamanya, dan itu adalah Nabi Muhammada dan orang-orang yang beriman kepadanya. Dan Allah penolong orang-orang yang beriman kepada Nya dan mengikuti syariat Nya,"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "68. Sesungguhnya orang yang paling berhak menisbahkan dirinya kepada Ibrahim ialah orang-orang yang mengikuti agama yang dibawanya pada zamannya. Dan yang juga paling berhak melakukan hal itu ialah Nabi Muhammad -ṣallallāhu 'alaihi wa sallam- dan orang-orang yang beriman kepadanya di antara umat ini. Dan Allah adalah Penolong dan Pelindung bagi orang-orang yang beriman kepadanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "68. إِنَّ أَوْلَى النَّاسِ بِإِبْرٰهِيمَ ( Sesungguhnya orang yang paling dekat kepada Ibrahim) Yakni yang paling berhak dan dekat dengan Nabi Ibrahim. لَلَّذِينَ اتَّبَعُوهُ ( ialah orang-orang yang mengikutinya) Yakni yang beriman dan mentaatinya dari golongan sahabat-sahabatnya dan pengikut agamanya. وَهٰذَا النَّبِىُّ ( dan Nabi ini) Yakni Nabi Muhammad, dan ia lebih berhak atas Nabi Ibrahim dilihat dari sisi bahwa ia merupakan keturunan dari Nabi Ibrahim, dan dari sisi kecocokan agamanya dalam banyak syariat dengan agama yang dibawa Nabi Muhammad. وَالَّذِينَ ءَامَنُوا۟ ۗ ( beserta orang-orang yang beriman) Yakni dari umat Nabi Muhammad. وَاللهُ وَلِىُّ الْمُؤْمِنِينَ ( dan Allah adalah Pelindung semua orang-orang yang beriman) Yakni pelindung seluruhnya dengan pertolongan dan bantuan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Dikatakan dalam ayat ini : { وَاللَّهُ وَلِيُّ الْمُؤْمِنِينَ } \"dan Allah adalah Pelindung semua orang-orang yang beriman\" , adapun Allah tidak mengatakan : ( وليهم ) \"pelindung mereka\" adalah sebagai peringatan bahwasanya perlindungan Allah hanya akan diraih dengan keimanan kepada-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "68 Sesungguhnya orang yang paling dekat kepada Ibrahim ialah orang-orang yang mengikuti jalannya yang lurus dan mengikuti Nabi ini (Muhammad) sebagai keturunannya, yang membawa ajaran yang lurus untuk mengesakan Allah. Sesungguhnya Allah adalah Pelindung semua orang-orang yang beriman. Orang-orang Yahudi bertanya kepada Nabi: Wahai Muhammad, engkau tahu bahwa kami adalah lebih dahulu mengikuti agama Ibrahim daripada kalian, menurut keyakinan kami bahwa ia adalah Yahudi. Engkau hanya iri kepada kami. Kemudian Allah menurunkan ayat ini."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang yang paling utama} paling berhak {dengan Ibrahim adalah orang-orang yang mengikutinya} orang-orang yang mengikuti agamanya pada waktu itu {dan nabi ini} Muhammad SAW {dan orang-orang yang beriman. Allah adalah pelindung} penlolong {orang-orang mukmin"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "65-68. Seluruh agama dari Yahudi, Nasrani, kaum musyrikin demikian juga Islam mengaku bahwa mereka mengikuti ajaran Nabi Ibrahim. Allah memberitakan bahwa manusia yang paling berhak atasnya adalah Nabi Muhammad beserta pengikut beliau serta pengikut al-Khalil (Nabi Ibrahim sendiri) sebelum Muhammad. Adapun orang-orang Yahudi, nasrani, dan kaum musyrikin, sesungguhnya Ibrahim berlepas diri dari mereka dan dari menjadi pembela mereka, oleh karena agama beliau adalah yang hanif dan membawa kemudahan yang mengandung keimanan kepada seluruh Rasul dan seluruh kitab-kitab (suci), dan ini adalah keistimewaan kaum Muslimin. Adapun klaim Yahudi dan Nasrani bahwa mereka berada di atas ajaran Ibrahim, maka telah diketahui bahwa agama Yahudi dan Nasrani yang mengaku menganut ajaran tersebut belum dibentuk kecuali setelah Ibrahim, lalu bagaimanakah mereka dapat membantah perkara ini yang telah diketahui padanya kebohongan dan dusta mereka? Taruhlah andaikan mereka mendebat tentang suatu hal yang mereka memiliki ilmu tentangnya namun bagaimana dalam kondisi seperti ini? Hal ini sebelum diperhatikan pendapat mereka yang penuh dengan kebohongan yang dapat diketahui akan batilnya klaimnya tersebut. Ayat ini juga merupakan sebuah dalil bahwa tidaklah halal bagi seorang manusia berkata atau berdebat tentang sesuatu yang tidak ia miliki ilmunya. Dan FirmanNya, “Dan Allah adalah pelindung semua orang-orang yang beriman.” Maka semakin kuat iman seorang manusia, niscaya Allah akan melindungiNya dengan kelembutanNya, memudahkannya dengan segala kemudahan, dan menjauhkannya dari kesulitan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 68: Sesungguhnya manusia yang paling hampir kepada Ibrahim ialah mereka yang menurut dia dan Nabi ini dan orang-orang yang beriman dan Allah itu Pemimpin kaum Mu'minin."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya: Paling berhak dengan Nabi Ibrahim 'alaihis salam. Karena kebanyakan syari'at Beliau sama dengan syari'at Nabi Ibrahim 'alaihis salam. Nabi shallallahu 'alaihi wa sallam dan orang-orang yang beriman inilah yang lebih cocok mengatakan bahwa mereka di atas agama Nabi Ibrahim 'alaihis salam. Adapun orang-orang yang membuang agamanya ke belakang punggungnya seperti orang-orang Yahudi, Nasrani dan orang-orang musyrik, bukanlah di atas agama Nabi Ibrahim 'alaihis salam, dan Beliau berlepas diri dari mereka. Dari ayat 65-68 dapat diambil beberapa kesimpulan, di antaranya: - Larangan berdebat dalam hal yang kita tidak memiliki ilmu tentangnya. - Anjuran untuk mengetahui tarikh (sejarah), dan bahwa mengetahui tarikh dapat digunakan untuk membantah perkataan-perkataan yang batil dan dakwaan yang menyalahi sejarah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 68",
    "description": "Jika demikian, orang yang paling dekat atau yang paling berhak dinisbatkan kepada ibrahim dan ajaran yang dianutnya ialah orang yang mengikutinya, yaitu yang menjawab ajakan nabi ibrahim kepada tauhid, begitu juga nabi ini, Muhammad, dan orang-orang yang beriman yakni para pengikut agama tauhid secara konsisten dan sunggung-sungguh. Allah adalah pelindung orang-orang yang beriman dengan senantiasa memberi pertolongan di dunia dan memberi balasan surga di akhirat kelaksetelah ayat sebelumnya menjelaskan tentang nabi ibrahim sebagai penganut agama tauhid, begitu juga nabi Muhammad dan umat islam, maka ayat ini menginformasikan ketidaksukaan sebagian ahli kitab dan upaya penyesatan mereka terhadap umat islam. Segolongan ahli kitab ingin menyesatkan kamu, wahai umat islam, dengan berbagai macam cara. Padahal, sesungguhnya mereka tidak menyesatkan siapa pun melainkan akibatnya akan menimpa diri mereka sendiri, tetapi mereka tidak menyadari. Ayat ini merupakan puncak pencelaan dan penghinaan terhadap mereka sekaligus menunjukkan buruknya sifat dan perilaku mereka."
  }
]