[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sekelompok orang-orang Yahudi dan nasrani berangan-angan untuk menyesatkan kalian (wahai orang-orang muslim) dari islam, dan mereka tidak akan menyesatkan kecuali diri mereka sendiri dan para pengikutnya, dan mereka tidak menyadari dan tidak mengetahui hal itu,"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "69. Para ulama dari kalangan Ahli Kitab, baik Yahudi maupun Nasrani ingin sekali menyesatkan kalian -wahai orang-orang mukmin- dari kebenaran yang Allah tunjukkan kepada kalian. Namun mereka tidak menyesatkan siapapun selain diri mereka sendiri. Karena usaha mereka untuk menyesatkan orang-orang mukmin itu justru menambah kesesatan mereka sendiri, dan mereka tidak mengetahui akibat dari perbuatan mereka tersebut."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "69. Allah mengabarkan tentang kedengkian sekelompok orang Yahudi, mereka berharap dapat menghalangi kaum muslimin dari agamanya sehingga dapat menghancurkan mereka. Namun tidak ada yang dapat mereka hancurkan dengan perbuatan mereka melainkan diri mereka sendiri dan para pengikut mereka, akan tetapi mereka tidak menyadarinya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "69. وَدَّت طَّآئِفَةٌ مِّنْ أَهْلِ الْكِتٰبِ لَوْ يُضِلُّونَكُمْ ( Segolongan dari Ahli Kitab ingin menyesatkan kamu) Ayat ini turun untuk Bani Nadhir, Bani Quraidhah, dan Bani Qainuqa’ saat menyeru sekelompok umat Islam untuk masuk agama mereka. Yakni mereka menginginkan dan keinginan itu melekat dalam hati mereka agar orang-orang Islam tersebut tersesat dari kebenaran dengan mengikuti apa yang mereka serukan. وَمَا يُضِلُّونَ إِلَّآ أَنفُسَهُمْ ( padahal mereka (sebenarnya) tidak menyesatkan melainkan dirinya sendiri) Yakni karena keteguhan kaki-kaki orang mukmin diatas keimanan, sehingga bahaya cobaan itu hanya akan kembali kepada orang yang ingin menguji mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "69 Segolongan dari Ahli Kitab ingin menyesatkan kamu dari agamamu, padahal mereka sebenarnya hanya dirinya sendiri, sebab orang-orang mukmin teguh dalam keimanan. Siksaan yang berlipat adalah untuk orang-orang kafir, namun mereka tidak menyadarinya. Ayat ini turun untuk orang-orang Yahudi di Madinah ketika mereka menyeru kumpulan orang muslim untuk mengikuti agama mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Segolongan dari Ahlul kitab ingin} satu golongan ingin {menyesatkan kamu. Mereka tidak menyesatkan siapa pun, kecuali diri mereka sendiri. Namun mereka tidak sadar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "69-74. Ini merupakan karunia Allah atas umat ini dimana memberitakan kepada mereka tentang tipu daya musuh-musuh mereka dari Ahli KItab, dan bahwa diantara usaha keras mereka dalam menyesatkan kaum Mukminin adalah mereka memakai berbagai cara dalam perbuatan munkar mereka yang busuk. Sekelompok diantara mereka berkata, “Perlihatkanlah (seolah-olah) kamu beriman kepada apa yang diturunkan kepada orang-orang beriman (sahabat-sahabat Rasul) pada permulaan siang,” yakni, di awal hari dan berpalinglah dari agama mereka kembali pada petang hari, dan bila mereka melihat kalian berpaling sedang mereka yakin kalian memiliki ilmu, itu akan membuat mereka ragu terhadap agama mereka, lalu mereka akan berkata, “Sekiranya mereka tidak melihat dalam agama ini apa yang tidak menarik bagi mereka dan tidak sesuai dengan kitab-kitab terdahulu, niscaya mereka pasti tidak akan berpaling. Ini adalah tipu daya mereka. Dan Allah yang memberikan petunjuk kepada siapa yang dikehendakiNya, hanya di TanganNya segala karunia yang Dia khususkan buat siapa yang dikehendakiNya, lalu Allah mengkhususkan kalian wahai umat ini dengan sesuatu yang tidak Dia khususkan bagi umat selain kalian. Dan orang-orang yang berbuat tipu daya itu tidak mengetahui bahwa agama Allah itu adalah haq, yang apabila hakikatnya sampai kepada hati tidaklah akan bertambah waktubagi orang tersebut kecuali akan semakin bertambah pula keimanan dan keyakinan, dan syubhat-syubhat yang ada justru itu menambah kuatnya mereka berpegang teguh pada agamanya dan semakin bersyukur kepada Allah serta memujiNya, di mana Dia telah melimpahkan karuniaNya itu atasnya. Dan perkataan mereka, “Dan (janganlah kamu percaya) bahwa akan diberikan kepada seseorang seperti apa yang diberikan kepadamu, dan (jangan pula kamu percaya) bahwa mereka akan mengalahkan hujjahmu di sisi Rabbmu,” artinya, bahwa yang menyebabkan mereka melakukan perbuatan-perbuatan kemungkaran adalah hasad, dengki, dan ketakutan akan dikalahkan dalam berdebat, sebagaimana Allah berfirman, \"Sebahagian besar Ahli Kitab menginginkan agar mereka dapat mengembalikan kamu kepada kekafiran setelah kamu beriman, karena dengki yang (timbul) dari diri mereka sendiri, setelah nyata bagi mereka kebenaran. Maka maafkanlah dan biarkanlah mereka, sampai Allah mendatangkan perintah-Nya. Sesungguhnya Allah Maha Kuasa atas segala sesuatu.\" QS-Al-Baqarah:109-"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 69: Segolongan dari ahli kitab suka hendak menyesatkan kamu, padahal tidak bakal mereka sesatkan melainkan diri mereka sendiri, sedang mereka tidak sadar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini sama seperti firman Allah Ta'ala: \"Sebagian besar ahli kitab menginginkan agar mereka dapat mengembalikan kamu kepada kekafiran setelah kamu beriman, karena dengki yang (timbul) dari diri mereka sendiri, setelah nyata bagi mereka kebenaran…dst.\" (Terj. Al Baqarah: 109) Usaha mereka menyesatkan kaum mukmin, tidaklah menimpa selain kepada diri mereka sendiri, membuat mereka semakin sesat dan bertambah azabnya. Allah Ta'ala berfirman: \"Orang-orang yang kafir dan menghalangi (manusia) dari jalan Allah, Kami tambahkan kepada mereka siksaan di atas siksaan disebabkan mereka selalu berbuat kerusakan.\" (Terj. An Nahl: 88)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 69",
    "description": "Setelah ayat sebelumnya menjelaskan tentang nabi ibrahim sebagai penganut agama tauhid, begitu juga nabi Muhammad dan umat islam, maka ayat ini menginformasikan ketidaksukaan sebagian ahli kitab dan upaya penyesatan mereka terhadap umat islam. Segolongan ahli kitab ingin menyesatkan kamu, wahai umat islam, dengan berbagai macam cara. Padahal, sesungguhnya mereka tidak menyesatkan siapa pun melainkan akibatnya akan menimpa diri mereka sendiri, tetapi mereka tidak menyadari. Ayat ini merupakan puncak pencelaan dan penghinaan terhadap mereka sekaligus menunjukkan buruknya sifat dan perilaku mereka. Sebagai pelengkap penghinaan terhadap mereka, ayat ini menyeru kepada ahli kitab. Wahai ahli kitab! mengapa kamu mengingkari ayatayat Allah yang diturunkan kepada nabi Muhammad, padahal kamu mengetahui kebenarannya melalui kitab kalian sendiri'."
  }
]