[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dia lah satu-satunya dzat yang menurunkan al-qur’an kepadamu. Dintara isi al-quram itu ada ayat-ayat yang jelas makna dan kandungannya, itulah pokok-pokok ajaran al-qur’an yang menjadi rujukan dalam persoalan-persoalan yang masih samar, dan hal-hal yang bertentangan dikembalikan padanya, dan diantaranya ada ayat-ayat yang lain yang mutasyabihat yang menghimpun beberapa pengertian yang berbeda, yang tidak tampak jelas maksudnya kecuali dengan dipadukan dengan ayat-ayat muhkam. maka adapun orang-orang yang hatinya sakit lagi menyimpang dikarenakan buruknya tujuan hati mereka, mereka mengikuti ayat-ayat mutasyabihat saja, supaya meniupkan subhat-subhat di tengah manusia sehingga dapat menyesatkan orang-orang tersebut dan agar menafsirkankan ayat-ayat tersebut diatas madzhab mereka yang batil. Dan tidak ada yang mengetahui hakikat makna-makan ayat ini selain Allah. sedang orang-orang yang mendalam ilmunya mengatakan “kami beriman kepada al-qur’an, semuanya datang kepada kami dari sisi tuhan kami, melalui lisan rasulNYA, Muhammad shalallohu alaihi wasallam.” Dan mereka membalikan ayat mutasyabihat kepada ayat-ayat muhkamnya, dan orang yang dapat memaham, mencerna dan menyelami makna-makna nya dengan pemahaman yang lurus adalah orang orang yang berakal lurus."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Dia lah yang menurunkan Al-Qur`ān kepadamu, -wahai Nabi-. Di dalamnya terdapat ayat-ayat yang jelas sekali maknanya, tidak ada kesulitan sama sekali untuk memahaminya. Ini adalah bagian yang utama dan mayoritas di dalamnya. Dan ini merupakan rujukan utama ketika terjadi perbedaan pendapat. Dan ada sebagian ayat-ayatnya yang mengandung lebih dari satu makna (multi tafsir) dan sulit dimengerti maknanya oleh kebanyakan orang. Adapun orang-orang yang hatinya melenceng dari kebenaran, mereka meninggalkan ayat-ayat yang jelas sekali maknanya (muhkam) dan mengambil ayat-ayat yang sulit dimengerti maknanya (mutasyabih) dan multi tafsir. Mereka ingin membangkitkan keragu-raguan dan menyesatkan orang dari jalan yang benar. Mereka ingin menafsirkan ayat-ayat tersebut menurut selera mereka yang sejalan dengan mazhab mereka yang sesat. Tidak ada yang mengetahui makna yang sesungguhnya dari ayat-ayat semacam itu dan bagaimana kenyataan yang sebenarnya kecuali Allah. Sedangkan orang-orang yang berilmu tinggi dan dalam mengatakan, “Kami percaya kepada Al-Qur`ān secara keseluruhan, karena semuanya berasal dari sisi Rabb kami.” Dan mereka menafsirkan ayat-ayat yang mutasyabih dengan ayat-ayat yang muhkam. Dan tidak ada yang bisa mendapatkan pelajaran dan peringatan kecuali orang-orang yang berakal sehat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "7. Hai Muhammad, Allah-lah yang menurunkan kepadamu al-Qur’an; di dalamnya terkandung ayat-ayat muhkam yang jelas maksudnya, yang merupakan inti dari kitab tersebut yang membahas tentang tiang-tiang agama, kewajiban-kewajiban, dan hukum-hukum; terkandung pula ayat-ayat mutasyabihat yang penjelasannya sulit difahami oleh sebagian besar orang. Orang yang dalam hatinya terdapat keraguan dan kecenderungan menyimpang dari kebenaran akan menggunakan ayat-ayat mutasyabihat untuk menjadikannya sebagai dalil atas niat buruk mereka dan menjelaskannya sesuai dengan madzhab batil yang mereka anut untuk menyesatkan orang banyak. Padahal tidak ada yang mengetahui penjelasan ayat-ayat mutasyabihat secara pasti kecuali Allah. Sedangkan para ulama yang memiliki ilmu yang mendalam akan mengimani ayat-ayat muhkam dan mutasyabihat, sebab semuanya datang dari Allah. Dan tidak ada yang mengambil pelajaran dan merenungi makna ayat-ayat ini dengan cara yang benar kecuali orang-orang yang memiliki akal yang mendapat hidayah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. الْكِتٰبَ ( Al Kitab) Yakn al Qur’an. مِنْهُ ءَايٰتٌ مُّحْكَمٰتٌ (Di antara (isi)nya ada ayat-ayat yang muhkamaat ) Makna (المحكم) yakni ayat yang tidak memiliki tafsiran lebih dari satu, sehingga tidak mungkin untuk diubah atau diganti dari makna ayat yang sebenarnya. Adapun makna (المتشابه) yakni ayat yang ada kemungkinan untuk diubah, diganti, atau ditakwilkan dari makna yang sebenarnya. Dan ayat yang mempunyai makna yang tersembunyi, tidak jelas, menimbulkan kemungkinan-kemingkinan, atau terdapat keraguan menjadikan ayat ini termasuk dalam ayat mutasyabih. هُنَّ أُمُّ الْكِتٰبِ( itulah pokok-pokok isi Al qur’an) Yakni ayat muhkamat ini adalah pokok yang menjadi landasan dan kepadanya dikembalikan makna yang menyelisihinya. فَأَمَّا الَّذِينَ فِى قُلُوبِهِمْ زَيْغٌ ( Adapun orang-orang yang dalam hatinya condong kepada kesesatan) Makna (الزيغ) yakni berbelok dari kebenaran. فَيَتَّبِعُونَ مَا تَشٰبَهَ مِنْهُ (maka mereka mengikuti sebahagian ayat-ayat yang mutasyaabihaat daripadanya) Yakni terpaut hati mereka dengan ayat-ayat mutasyabih untuk memberi keraguan kepada orang-orang beriman dan menjadikannya sebagai dalil atas bid’ah yang mereka lakukan. ابْتِغَآءَ الْفِتْنَةِ (untuk menimbulkan fitnah ) Yakni untuk menimbulkan cobaan pada manusia atas agama mereka dan keraguan kepada mereka. وَابْتِغَآءَ تَأْوِيلِهِۦ ۗ ( dan untuk mencari-cari ta’wilnya) Yakni untuk dapat mentakwilkan ayat tersebut sesuai dengan apa yang mereka ingingkan dan sesuai dengan jalan mereka yang sesat. وَمَا يَعْلَمُ تَأْوِيلَهُۥٓ إِلَّا اللهُ ۗ وَالرّٰسِخُونَ فِى الْعِلْمِ ( padahal tidak ada yang mengetahui ta’wilnya melainkan Allah, dan orang-orang yang ilmunya mendalam) Ibnu Abbas berkata: Aku termasuk orang yang mengetahui takwilnya. Dan maknanya adalah orang yang memiliki ilmu yang dalam (Rasikhuun) mengetahui takwil dari ayat-ayat ini, yang senantiasa mengatakan (آمنا به). ءَامَنَّا بِهِۦ ( Kami beriman kepadanya) Yakni beriman kepada seluruh ayat-ayat al-Qur’an baik itu yang muhkam maupun yang mutasyabih, karena seluruhnya berasal dari Allah maka tidak terdapat perbedaan diantaranya, maka kami mengembalikan ayat mutasyabih yang memiliki kemungkinan kebenaran dan kebathilan kepada ayat yang muhkam yang tidak memiliki kemungkinan kecuali kebenaran sehingga dengan itu jelaslah maksud dari ayat mutasyabih tersebut. Ayat ini turun untuk orang-orang Nasrani Najran yang berkata: sesungguhnya Allah berkata tentang dirinya dalam al-Qur’an dengan kata ‘Kami’ dan ‘Aku’ dan itu adalah kata ganti jamak maka Allah adalah satu dari yang tiga. -Maha Tinggi Allah-. Maka Rasulullah meminta mereka untuk mengembalikan ayat ini kepada ayat yang muhkam seperti (قل هو الله أحد) dan (إنما الله إله واحد). Dan pendapat lain mengatakan bahwa orang-orang yang memiliki ilmu yang dalam (Rasikhun) juga tidak mengetahui takwil ayat mutasyabihat. Dan yang dimaksud dengan mutasyabih adalah seperti waktu terjadinya hari kiamat, hakikat dari arwah, dan lainnya yang tidak diketahui oleh manusia."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Tidaklah yang aku takuti atas ummat ini dari seorang mukmin yang dijauhkan dari imannya, dan dari seorang fasiq yang jelas kefasikannya, tetapi yang aku takuti atas ummat ini adalah seseorang ketika membaca al-qur'an dengan lisannya, kemudian dia mentakwil isinya dengan takwil yang tidak benar!"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Allah adalah Dzat yang menurunkan Al-Qur’an kepadamu wahai nabi Muhammad. Di antaranya ada ayat-ayat muhkamat, yaitu ayat yang hanya memiliki satu sudut pandang penafsiran seperti ayat {Wa laa Taqrabuz zinaa} [surah Al-Isra’ 17/32] ayat-ayat tersebut merupakan sumber dalam Al-Qur’an yang digunakan sebagai pedoman. Di antaranya juga ada ayat mutasyabihat, yaitu ayat-ayat yang mengandung banyak makna seperti ayat {Ar-Rahman ‘alal ‘arsyistawa} [surah Thaha 20/5] dan ayat {Yadullahi fauqa aidiihim} [Surah Al-fath 48/10], juga janji tentang terjadinya kiamat, hakikat ruh dan lain-lain. Adapun orang-orang yang di dalam hatinya itu berpaling dari yang haq menuju yang bathil, maka mereka lebih terikat dengan ayat mutasyabihah, mereka menafsirkannya dengan cara yang membingungkan dengan maksud untuk memfitnah manusia tentang agama yang benar dan menta’wilkannya sesauai tujuan mereka. Tidak ada yang mengetahui tafsir dan hakikat ayat mutasyabihah kecuali Allah. Orang yang mahir dalam keilmuan berkata: “Kami beriman kepada seluruhnya, bahwa setiap ayat muhkamat dan mutasyabihat itu dari sisi Tuhan Kami,” Ayat-ayat itu tidak saling tumpang tindih, sehingga ayat-ayat sifat menolak ayat-ayat tentang kesucian yang mutlak, begitu juga ayat-ayat tentang penggambaran tentang Isa dengan diberi kalimat dan ruh yang bertentangan dengan ayat-ayat tauhid yang sudah mutlak. Dan tidak ada yang mengambil pelajaran dari ayat-ayat ini kecuali orang-orang yang memiliki akal sehat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dialah yang menurunkan Kitab kepadamu. Di antara ayat-ayatnya ada yang muhkamat} yang jelas memberi petunjuk, tidak ada kerancuan di dalamnya {itulah pokok-pokok isi Kitab} pokok-pokok kitan yang dijadikan rujukan ketika terjadi keraguan {dan yang lain} ayat-ayat lain {mutasyabihat mengandung beberapa makna {Adapun orang-orang yang dalam hatinya ada kecenderungan pada kesesatan} menyimpang dari kebenaran {mereka mengikuti ayat-ayat yang mutasyabihat untuk menimbulkan fitnah} mencari keraguan dan kerancuan pada manusia {dan untuk mencari-cari takwilnya} mencari tafsirnya sesuai perangai mereka yang tersesat {Padahal tidak ada yang mengetahui takwilnya, kecuali Allah. Orang-orang yang ilmunya mendalam berkata} orang-orang yang teguh dan ahli {“Kami beriman kepadanya, semuanya dari Tuhan kami” Tidak ada yang dapat mengambil pelajaran} tidak ada yang mengambil pelajaran {kecuali orang-orang yang berakal}. Orang yang berakal sehat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7. Allah memberitakan tentang keagunganya dan kesempurnaan pengaturaNya, yakani bahwa dia-lah yang esa yang menurunkan kitab yang agung ini, yang tidak akan di temukan dan tidak akan ditemukan tandinganya dan semisalnya dalam petunjuk, keindahan Bahasa, kemukzijatan, dan kebaikan bagi makhluk. Dan bahwasanya kitab ini mencakup yang muhkam, yakni jelas sekali artinya, yang terang, yang tidak samar tentangnya, dan juga mencakup ayat-ayat mustasyabihat yang mengandung beberapa arti yang tidak ada satupun dari arti-arti itu yang lebih kuat kalau hanya berpegang dengan ayat tersebut hingga di satukan kepada ayat yang muhkam. orang-orang yang dalam hatinya ada penyakit, penyimpangan dan penyelewengan tersebut. Mereka mengambilnya sebagai dalil demi memperkuat tulisan-tulisan mereka yang bahtil dan pemikiran-pemikiran mereka yang palsu hanya untuk mengobarkan fitnah dan menyimpang terhadap kitabullah serta menjadikanya sebagai tafsiran untuknya sesuai dengan jalan yang madzhab mereka yang akhirnya mereka itu tersesat dan menyesatkan orang lain. Adapun orang yang berilmu dan mendalam yang ilmunya dan keyakinanya telah mencapai hati mereka, lalu membuahkan bagi mereka perbuatan dan pengetahuan, maka mereka ini mengahui bahwa al qur’an itusemuanya dari sisi Allah, dan bahwa semua yang ada di dalamnya adalah haq, baik yang muthasyibah maupun yang muhkam, dan bahwasanya yang haq itu tidak akan saling bertentanggan dan saling berbeda. Dan mereka akan mengatahui dengan jelas bahwa ayat-ayat muhkam mengandung makna yang jelas dan tegas, maka mereka mengembalikan ayat-ayat mutasyabih yang sering menimbulkan kebingungan bagi orang-orang yang kurang ilmu dan pengetahuan kepada yang muhkam mereka mengembalikan ayat-ayat yang metasyabih kepada ayat-ayat yang muhkam hingga seluruhnya menjadi muhkam dan mereka berkata, ”kami beriman kepada ayat-ayat yang mutasyabihat, semua itu dari sisi tuahn kami. “Dan tidak dapat mengambil pelajaran, dari padanya” yang mendalam ”melainkan orang-orang yang berakal yakni orang-orang yang memiliki akal cerdas. dalam ayat ini terdapat dalil yang menunjukan bahwa sikap ini adalah orang orang yang berakal, dan bahwa mengikuti ayat-ayat yang mutasibih adalah sipat orang yang pemikirannya sakit, akalnya rendah, dan tujuan-tujuanya buruk. Dan firmanya, ” padahal tidak ada yang mengetahui takwilnya melainkan Allah, ” apabila yang di maksud itu adalah pengetahuan tentang akibat suatu perkara, hasilnya, serta mengarah kepadanya, maka berwajibanlah berpatokan dengan, ” melainkan Allah, ” dimana hanya Allah saja yang melakukan takwil dengan makna tersebut. Namun apabila takwil tersebut dimaksudkan dengan makna tafsir dan ilmu tentang arti dari perkataan tersebut, maka yang lebih baik adalah menyambung dengan kalimat sebalumnya, hingga hal ini menjadi sebuah pujian terhadap orang-orang yang ilmunya mendalam, yaitu bahwasanya mereka mengetahui bagaimana menempatkan nash-nash Al-quran dan assunah, baik yang muhkamnya maupun yang mutasyabihnya. Dan ketika konteksnya adalah tetang perpecahan orang-orang (sehingga) ada yang menyimpan dan ada yang istiqomah, maka mereka berdoa kepada Allah agar menetapkan mereka di atas keimanan seraya berkata,"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 7: Ialah Yang telah turunkan Kitab kepadamu, Sebagian daripadanya adalah Ayat-ayat yang muhkam yaitu asas bagi Kitab, dan yang (sebagian) lain adalah (Ayat-ayat) yang mutasyabih. Adapun orang-orang yang di hati-hatinya ada kesesatan, mencari-cari apa yang mutasyabih dari padanya,karena hendak membikin fitnah dan karena hendak menta'wil akan ia, padahal tidak mengetahui ta'wilya melainkan Allah; dan orang-orang yang jejak di dalam ilmu berkata: \"Kami beriman kepada-Nya,(karena) semua itu dari Tuhan kami, lain kan orang-orang yang mempunyai fikiran, dan tidak mengerti) melainkan orang-orang yang mempunyai fikiran."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat yang muhkamaat ialah ayat-ayat yang jelas maksudnya, dapat dipahami dengan mudah. Yang dirujuk ketika terjadi kesamaran dan mengembalikan kepadanya paham yang menyelisihinya, atau maksudnya bisa juga \"Yang dijadikan pegangan dalam hukum\". Termasuk dalam pengertian ayat-ayat mutasyaabihaat: ayat-ayat yang mengandung beberapa pengertian dan tidak dapat ditentukan arti mana yang dimaksud kecuali setelah diteliti secara mendalam atau dipadukan dengan ayat yang muhkamat; atau ayat-ayat yang pengertiannya hanya Allah yang mengetahui seperti ayat-ayat yang berhubungan dengan yang ghaib misalnya ayat-ayat mengenai hari kiamat, surga, neraka dan lain-lain. Ada pula yang menggolongan beberapa huruf di awal surat sebagai mutasyabihat, seperti alif laam miim, dsb. wallahu a'lam. Adapun Syaikh As Sa'diy, ia menafsirkan ayat di atas sebagai berikut: Al Qur'anul 'Azhim semuanya adalah muhkam (jelas maksudnya), sebagaimana firman Allah Ta'ala: \"(Inilah) suatu kitab yang ayat-ayat-Nya disusun dengan rapi serta dijelaskan secara terperinci, yang diturunkan dari sisi (Allah) yang Maha Bijaksana lagi Mahatahu,\" (Terj. Huud: 1) Al Qur'an tersusun rapi, mengandung keadilan dan ihsan, \"Dan (hukum) siapakah yang lebih baik daripada (hukum) Allah bagi orang-orang yang yakin?\" (Terj. Al Maa'idah: 50) Semuanya mengandung mutasyabih (kemiripan) dalam hal indah, kefasihan, saling membenarkan yang satu dengan lainnya, lafaz dan maknanya sesuai. Adapun muhkamat dan mutasyabihat yang disebutkan di ayat ini, maka Al Qur'an itu sebagaimana disebutkan Allah, ada ayat-ayat yang muhkamat, yakni jelas maksudnya, tidak ada kesamaran dan sesuatu yang belum jelas. Inilah pokok-pokok isi kitab, yakni pokok yang dikembalikan kepadanya segala yang masih samar, dan ayat-ayat muhkamat inilah yang paling banyak (dalam Al Qur'an). Ada pula ayat-ayat yang mutasyabihat, yakni maknanya masih samar di pikiran, karena kandungannya yang masih ijmal (global) atau mengarah kepada pemahaman tertentu, padahal bukan itu maksudnya. Al hasil, di antara ayat-ayat Al Qur'an ada ayat-ayat yang jelas bagi setiap orang, dan inilah ayat yang paling banyak, dan dipakai rujukan. Di antaranya ada pula ayat-ayat yang masih musykil bagi sebagian manusia, maka yang wajib dalam masalah ini adalah mengembalikan yang mutasyabihat kepada yang muhkamat, yang masih samar kepada yang jelas. Dengan cara seperti ini, satu sama lain saling membenarkan dan tidak terjadi pertentangan. Akan tetapi, orang-orang (dalam hal ini) terbagi menjadi dua golongan: orang-orang yang dalam hatinya ada penyimpangan, yakni menyimpang dari jalan istiqamah, di mana niat mereka rusak, bahkan yang mereka cari adalah kesesatan, dan hati mereka menyimpang dari jalan yang lurus dan dari petunjuk, mereka mencari yang mutasyabihat, mereka meninggalkan yang jelas dan beralih kepada yang mutasyabihat, bahkan mereka berbuat sebaliknya, yang muhkam mereka bawa kepada yang yang mutasyabihat….dst.\" (lihat Tafsir As Sa'diy) Orang-orang yang berpenyakit hati karena niatnya yang buruk berusaha mencari ayat-ayat yang mutasyabihat untuk menimbulkan syubhat di tengah manusia agar dapat menyesatkan mereka, di samping itu, mereka menta'wil ayat-ayat mutasyabihat untuk menguatkan pemahaman mereka yang batil. Imam Bukhari dan Muslim meriwayatkan dari Aisyah, bahwa Rasulullah shallallahu 'alaihi wa sallam pernah membacakan ayat di atas, Dan bersabda, فَإِذَا رَأَيْتُمُ الَّذِيْنَ يَتَّبِعُوْنَ مَا تَشَابَهَ مِنْهُ فَأولَئِكَ الَّذِيْنَ سَمَّى اللهُ فَاحْذَرُوْهًمْ \"Apabila kalian melihat orang-orang yang mencari ayat-ayat mutasyabihat, mereka itulah orang-orang yang disebut Allah, maka berhati-hatilah.\" Jumhur (mayoritas) mufassir mewaqfkan (memberhentikan) sampai ayat ini, namun yang lain menyambung dengan kata-kata \"wa raasikhuun…dst.\" Kedua-duanya masih mengandung kemungkinan benar, jika maksud \"ta'wil\" di sini adalah mengetahui hakikatnya, maka yang benar adalah waqf sampai \"illallah\", karena yang mengetahui hakikatnya adalah Allah saja. Misalnya hakikat sifat Allah, hakikat sifat-sifat yang terjadi pada hari akhir dsb. Hal ini, tidak ada yang mengetahuinya selain Allah, tidak boleh bagi seseorang memberanikan diri mengkaifiyatkannya. Oleh karena itu, Imam Malik rahimahullah pernah ditanya tentang firman Alllah \"Ar Rahmaanu 'alal 'arsyis tawaa\" (Allah bersemayam di atas 'Arsy) bagaimana bersemayam-Nya?\" Maka ia menjawab, \"Bersemayam adalah kata yang sudah diketahui, bagaimananya adalah majhul (tidak diketahui), mengimaninya wajib dan menanyakannya bid'ah.\" Demikianlah yang harus dikatakan dalam ayat-ayat sifat, yakni bahwa sifat tersebut diketahui, namun kaifiyatnya majhul. Orang-orang yang ilmunya mendalam, mengimaninya dan menyerahkan hakikatnya kepada Allah. Adapun jika arti \"ta'wil\" di ayat ini adalah tafsir, penjelasan lebih dalam, maka yang benar adalah menyambung kata-kata Ar Raasikhuun (orang-orang yang ilmunya mendalam) dengan Allah; tidak diwaqfkan. Sehingga tafsir ayat-ayat yang mutasyabihat, pengembalian kepada ayat-ayat yang muhkamat serta penyingkiran kesamaran yang ada dalam ayat-ayat mutasyabihat, tidak ada yang mengetahuinya selain Allah Ta'ala dan orang-orang yang ilmunya mendalam. Oleh karena semua ayat tersebut berasal dari sisi Allah, maka tidak akan terjadi pertentangan, bahkan isinya sama, yang satu dengan yang lain saling membenarkan dan menguatkan. Hanya orang-orang yang berakal saja yang dapat memahami dan mengerti maknanya secara benar."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 7",
    "description": "Hanya dialah yang menurunkan kitab Al-Qur'an kepadamu, wahai nabi Muhammad, untuk engkau sampaikan dan jelaskan maksudnya kepada seluruh umat manusia. Apa yang diturunkan itu terdiri atas dua kelompok, di antaranya ada ayat-ayat yang muhkama't, yakni yang kandungannya sangat jelas, sehingga hampir-hampir tidak lagi dibutuhkan penjelasan tambahan untuknya, atau yang tidak mengandung makna selain yang terlintas pertama kali dalam benak. Ayat-ayat muhkama't itulah pokok-pokok kitab suci Al-Qur'an. Dan kelompok ayat-ayat yang lain dalam Al-Qur'an yaitu mutasyabihat, yakni ayat-ayat yang mengandung beberapa pengertian, samar artinya dan sulit dipahami kecuali setelah merujuk kepada yang muhkam, atau hanya Allah yang mengetahui maknanya. Adapun orang-orang yang dalam hatinya condong pada kesesatan, mereka mengikuti dengan sungguh-sungguh yang mutasya'biha't, dengan berpegang teguh kepada ayat-ayat itu semata-mata dan tidak menjadikan ayatayat muhkamat sebagai rujukan dalam memahami atau menetapkan artinya. Tujuan mereka melakukan itu adalah untuk mencari-cari fitnah, yakni kekacauan dan kerancuan berpikir serta keraguan di kalangan orang-orang beriman, dan untuk mencari-cari dengan sungguh-sungguh takwilnya yang sejalan dengan kesesatan mereka. Mereka melakukan itu padahal tidak ada yang mengetahui takwilnya kecuali Allah. Dan sikap mereka itu bertentangan dengan sikap ar-ra'sikhain faal-'ilm, yakni orang orang yang ilmunya mendalam dan imannya mantap. Atau, seperti dalam salah satu bacaan (qira'at) yang mutawa'tir, takwil ayat-ayat mutasyabihat itu juga dapat diketahui oleh ar-ra'sikhain fa al-'ilm. Dengan demikian, ayat-ayat mutasyabihat itu diturunkan untuk memotivasi para ulama agar giat melakukan studi, menalar, berpikir, teliti dalam berijtihad dan menangkap pesan-pesan agama. Orang-orang yang mendalam ilmunya dan mantap imannya itu berkata, kami beriman kepadanya, yakni Al-Qur'an, semuanya, yakni yang mutasyabihat dan muhkamat, berasal dari sisi tuhan kami. Tidak ada yang dapat mengambil pelajaran dan memahami maknanya dengan baik dan benar kecuali orang yang berakal, yaitu orang-orang yang memiliki akal sehat yang tidak mengikuti keinginan hawa nafsu. Menggunakan akal semata akan membuat seseorang mudah tergelincir. Oleh karenanya, orang-orang yang mendalam ilmunya dan mantap imannya selalu berdoa, ya tuhan kami, janganlah engkau condongkan hati kami kepada kesesatan sebagaimana halnya mereka yang mencaricari takwil ayat-ayat mutasyabih untuk menimbulkan keraguan, setelah engkau berikan petunjuk kepada kami, dan karuniakanlah kepada kami rahmat yang mencakup segala jenis dan macamnya, antara lain berupa kemantapan iman, ketenangan batin, kemudahan dalam menjalankan perintah dan menjauhi larangan. Rahmat itu bersumber dan langsung dari sisi-Mu, turun secara berkesinambungan dan tanpa mengharap imbalan apa pun, sebab sesungguhnya engkau maha pemberi."
  }
]