[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai ahli taurot dan injil kenapa kalian mengingkari ayat-ayat Allah yang telah Dia turunkan kepada rosul-rosul Nya dalam kitab-kitab kalian, dan di dalamnya disebutkan bahwasanya Muhammad adalah rosul yang ditunggu. Dan apa yang dia bawa kepada kalian adalah kebenaran, dan kalian mempersaksikan hal itu? Akan tetapi kalian mengingkariya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "70. Wahai orang-orang Ahli Kitab dari kalangan Yahudi dan Nasrani, mengapa kalian mengingkari ayat-ayat Allah yang diturunkan pada kalian dan isi kandungannya yang menunjukkan adanya kenabian Muhammad -ṣallallāhu 'alaihi wa sallam-, sedangkan kalian tahu bahwa hal itu adalah kebenaran yang ditunjukkan oleh Kitab-kitab suci kalian?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "70. Allah mengingkari orang-orang Yahudi dan Nasrani: “Mengapa kalian mendustakan al-Qur’an dan berbagai mukjizat yang diturunkan kepada Muhammad, padahal kalian mengetahui bahwa itu semua adalah benar?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "70. بِـَٔايٰتِ اللهِ ( ayat-ayat Allah) Yakni apa yang ada dalam kitab-kitab kalian berupa bukti-bukti kenabian Muhammad. وَأَنتُمْ تَشْهَدُونَ ( padahal kamu menyaksikannya) Yakni atas apa yang ada dalam kitab-kitab kalian tentang hal itu, dan kalian mengetahui bahwa itu adalah kebenaran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "70 Hai Ahli Kitab, mengapa kamu mengingkari ayat-ayat Allah yang turun kepada Muhammad, yang juga turun pada kitab kalian yang membenarkan kenabiannya, padahal kamu mengetahui kebenarannya bahwa dia Rasul dan Al-quran itu benar."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai Ahlul kitab, mengapa kalian mengingkari ayat-ayat Allah, padahal kalian mengetahuinya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "69-74. Ini merupakan karunia Allah atas umat ini dimana memberitakan kepada mereka tentang tipu daya musuh-musuh mereka dari Ahli KItab, dan bahwa diantara usaha keras mereka dalam menyesatkan kaum Mukminin adalah mereka memakai berbagai cara dalam perbuatan munkar mereka yang busuk. Sekelompok diantara mereka berkata, “Perlihatkanlah (seolah-olah) kamu beriman kepada apa yang diturunkan kepada orang-orang beriman (sahabat-sahabat Rasul) pada permulaan siang,” yakni, di awal hari dan berpalinglah dari agama mereka kembali pada petang hari, dan bila mereka melihat kalian berpaling sedang mereka yakin kalian memiliki ilmu, itu akan membuat mereka ragu terhadap agama mereka, lalu mereka akan berkata, “Sekiranya mereka tidak melihat dalam agama ini apa yang tidak menarik bagi mereka dan tidak sesuai dengan kitab-kitab terdahulu, niscaya mereka pasti tidak akan berpaling. Ini adalah tipu daya mereka. Dan Allah yang memberikan petunjuk kepada siapa yang dikehendakiNya, hanya di TanganNya segala karunia yang Dia khususkan buat siapa yang dikehendakiNya, lalu Allah mengkhususkan kalian wahai umat ini dengan sesuatu yang tidak Dia khususkan bagi umat selain kalian. Dan orang-orang yang berbuat tipu daya itu tidak mengetahui bahwa agama Allah itu adalah haq, yang apabila hakikatnya sampai kepada hati tidaklah akan bertambah waktubagi orang tersebut kecuali akan semakin bertambah pula keimanan dan keyakinan, dan syubhat-syubhat yang ada justru itu menambah kuatnya mereka berpegang teguh pada agamanya dan semakin bersyukur kepada Allah serta memujiNya, di mana Dia telah melimpahkan karuniaNya itu atasnya. Dan perkataan mereka, “Dan (janganlah kamu percaya) bahwa akan diberikan kepada seseorang seperti apa yang diberikan kepadamu, dan (jangan pula kamu percaya) bahwa mereka akan mengalahkan hujjahmu di sisi Rabbmu,” artinya, bahwa yang menyebabkan mereka melakukan perbuatan-perbuatan kemungkaran adalah hasad, dengki, dan ketakutan akan dikalahkan dalam berdebat, sebagaimana Allah berfirman, \"Sebahagian besar Ahli Kitab menginginkan agar mereka dapat mengembalikan kamu kepada kekafiran setelah kamu beriman, karena dengki yang (timbul) dari diri mereka sendiri, setelah nyata bagi mereka kebenaran. Maka maafkanlah dan biarkanlah mereka, sampai Allah mendatangkan perintah-Nya. Sesungguhnya Allah Maha Kuasa atas segala sesuatu.\" QS-Al-Baqarah:109-"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 70: Hai Ahli Kitab! Mengapakah kamu kufur kepada ayat-ayat Allah, padahal kamu saksikan?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni ayat-ayat Allah yang diturunkan kepada Nabi Muhammad shallallahu 'alaihi wa sallam. Maksudnya: Apa yang menyebabkan kamu wahai Ahli Kitab, berbuat kafir kepada ayat-ayat Allah padahal kamu mengetahui bahwa pendirian kamu adalah batil, dan yang dibawa oleh Nabi Muhammad shallallahu 'alaihi wa sallam itulah yang benar?. Ayat ini merupakan larangan kepada mereka untuk menyesatkan diri mereka sendiri, dan pada ayat selanjutnya tedapat larangan bagi mereka menyesatkan orang lain."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 70",
    "description": "Sebagai pelengkap penghinaan terhadap mereka, ayat ini menyeru kepada ahli kitab. Wahai ahli kitab! mengapa kamu mengingkari ayatayat Allah yang diturunkan kepada nabi Muhammad, padahal kamu mengetahui kebenarannya melalui kitab kalian sendiri' setelah ayat sebelumnya menjelaskan sikap penolakan ahli kitab terhadap kebenaran yang dibawa rasulullah, maka ayat ini kembali menjelaskan perilaku buruk mereka yang lainnya, antara lain upaya penyesatan terhadap kaum muslim. Wahai ahli kitab, yahudi dan nasrani! mengapa kamu mencampuradukkan kebenaran yang dibawa oleh para nabi dan rasul dengan kebatilan, yaitu dengan menutup-nutupi beberapa firman Allah yang termaktub di dalam taurat dan injil dengan perkataan-perkataan yang dibuat-buat oleh mereka sendiri, dan kamu menyembunyikan kebenaran tentang kenabian Muhammad yang tersebut dalam taurat dan injil, padahal kamu mengetahui tentang kebenaran itu serta akibatnya, yakni siksa yang sangat pedih'"
  }
]