[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang yang dikaruniai taurat dan injil, mengapa kalian mencampur adukkan antara kebenaran yang terkandung di dalam kitab-kitab suci kalian dengan perubahan-perubahan yang apa yang kalian tulis dari kebatilan-kebatilan dengan tangan-tangan kalian, dan kalian menyembunyikan apa yang ada di dalam kitab suci itu terkait sifat-sifat Muhammad dan bahwa agamanya adalah agama yang benar,sedang kalian mengetahui hal itu?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "71. Wahai orang-orang Ahli Kitab, mengapa kalian mencampur kebenaran yang diturunkan di dalam kitab-kitab suci kalian dengan kebatilan yang berasal dari diri kalian sendiri, dan menyembunyikan kebenaran dan petunjuk yang ada di dalamnya, termasuk mengenai kebenaran kenabian Muhammad -ṣallallāhu 'alaihi wa sallam-, padahal kalian tahu mana yang hak dan mana yang batil, mana yang benar dan mana yang sesat?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "71. kemudian Allah mengolok-olok mereka dengan firman-Nya: “Mengapa kalian mencampuradukkan antara kebenaran yang diturunkan dalam kitab-kitab samawi dengan kebatilan akibat kalian mengubah kitab-kitab itu; dan kalian menyembunyikan kebenaran, diantaranya tentang ciri-ciri Muhammad, padahal kalian meyakini kebenarannya?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "71. تَلْبِسُونَ الْحَقَّ بِالْبٰطِلِ ( mengapa kamu mencampur adukkan yang haq dengan yang bathil) Yakni mencampuradukkan itu dengan perubahan kitab yang mereka sengaja dan dengan apa yang mereka masukkan kedalam agama padahal itu bukan termasuk daripadanya untuk membingungkan manusia dan menyesatkan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "71 Hai Ahli Kitab, mengapa kamu mencampur adukkan yang haq dengan yang bathil dalam kitab yang diturunkan Allah dengan merubahnya sesuai hawa nafsu, dan menyembunyikan kebenaran yang telah teguh dalam kitabmu tentang ciri-ciri Muhammad dan kebenaran risalahnya, padahal kamu meyakinin dan mengetahuinya dalam hati kamu?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai Ahlul kitab, mengapa kalian mencampuradukkan} mencampur {yang benar dengan yang batil dan kalian menyembunyikan} menyembunyikan {kebenaran, padahal kamu mengetahuinya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "69-74. Ini merupakan karunia Allah atas umat ini dimana memberitakan kepada mereka tentang tipu daya musuh-musuh mereka dari Ahli KItab, dan bahwa diantara usaha keras mereka dalam menyesatkan kaum Mukminin adalah mereka memakai berbagai cara dalam perbuatan munkar mereka yang busuk. Sekelompok diantara mereka berkata, “Perlihatkanlah (seolah-olah) kamu beriman kepada apa yang diturunkan kepada orang-orang beriman (sahabat-sahabat Rasul) pada permulaan siang,” yakni, di awal hari dan berpalinglah dari agama mereka kembali pada petang hari, dan bila mereka melihat kalian berpaling sedang mereka yakin kalian memiliki ilmu, itu akan membuat mereka ragu terhadap agama mereka, lalu mereka akan berkata, “Sekiranya mereka tidak melihat dalam agama ini apa yang tidak menarik bagi mereka dan tidak sesuai dengan kitab-kitab terdahulu, niscaya mereka pasti tidak akan berpaling. Ini adalah tipu daya mereka. Dan Allah yang memberikan petunjuk kepada siapa yang dikehendakiNya, hanya di TanganNya segala karunia yang Dia khususkan buat siapa yang dikehendakiNya, lalu Allah mengkhususkan kalian wahai umat ini dengan sesuatu yang tidak Dia khususkan bagi umat selain kalian. Dan orang-orang yang berbuat tipu daya itu tidak mengetahui bahwa agama Allah itu adalah haq, yang apabila hakikatnya sampai kepada hati tidaklah akan bertambah waktubagi orang tersebut kecuali akan semakin bertambah pula keimanan dan keyakinan, dan syubhat-syubhat yang ada justru itu menambah kuatnya mereka berpegang teguh pada agamanya dan semakin bersyukur kepada Allah serta memujiNya, di mana Dia telah melimpahkan karuniaNya itu atasnya. Dan perkataan mereka, “Dan (janganlah kamu percaya) bahwa akan diberikan kepada seseorang seperti apa yang diberikan kepadamu, dan (jangan pula kamu percaya) bahwa mereka akan mengalahkan hujjahmu di sisi Rabbmu,” artinya, bahwa yang menyebabkan mereka melakukan perbuatan-perbuatan kemungkaran adalah hasad, dengki, dan ketakutan akan dikalahkan dalam berdebat, sebagaimana Allah berfirman, \"Sebahagian besar Ahli Kitab menginginkan agar mereka dapat mengembalikan kamu kepada kekafiran setelah kamu beriman, karena dengki yang (timbul) dari diri mereka sendiri, setelah nyata bagi mereka kebenaran. Maka maafkanlah dan biarkanlah mereka, sampai Allah mendatangkan perintah-Nya. Sesungguhnya Allah Maha Kuasa atas segala sesuatu.\" QS-Al-Baqarah:109-"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 71: Hai Ahli Kitab! Mengapakah kamu samarkan kebenaran itu dengan kepalsuan dan kamu sembunyikan kebenaran, padahal kamu tahu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu menutupi firman-firman Allah yang tertulis dalam Taurat dan Injil dan mengganti dengan perkataan yang dibuat-buat mereka (Ahli Kitab). Orang-orang berilmu yang mencampuradukkan yang hak dengan yang batil dan menyembunyikan kebenaran membuat kebenaran menjadi samar dan kebatilan menjadi dianggap benar, akibatnya orang-orang awam tidak dapat mengambil petunjuk. Padahal yang diinginkan dari ahli ilmu adalah menerangkan kebenaran kepada manusia, memilah mana yang hak dan mana yang batil, mana yang halal dan mana yang haram, mana aqidah yang benar dan mana aqidah yang salah agar manusia dapat mengambil petunjuk dan hujjah menjadi tegak bagi orang-orang yang tetap mengingkari. Oleh karena itu, mereka yang menyembunyikan yang hak memperoleh laknat dari Allah, malaikat dan manusia semuanya sebagaimana disebutkan dalam surat Al Baqarah: 159. Di samping itu, Allah Subhaanahu wa Ta'aala juga telah mengambil perjanjian dari mereka agar mereka menyampaikan kebenaran kepada manusia dan tidak menyembunyikannya sebagaimana dalam surat Ali Imran: 187. Maksudnya: kebenaran tentang kenabian Muhammad shallallahu 'alaihi wa sallam atau sifat-sifat Beliau yang disebutkan dalam Taurat dan Injil."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 71",
    "description": "Setelah ayat sebelumnya menjelaskan sikap penolakan ahli kitab terhadap kebenaran yang dibawa rasulullah, maka ayat ini kembali menjelaskan perilaku buruk mereka yang lainnya, antara lain upaya penyesatan terhadap kaum muslim. Wahai ahli kitab, yahudi dan nasrani! mengapa kamu mencampuradukkan kebenaran yang dibawa oleh para nabi dan rasul dengan kebatilan, yaitu dengan menutup-nutupi beberapa firman Allah yang termaktub di dalam taurat dan injil dengan perkataan-perkataan yang dibuat-buat oleh mereka sendiri, dan kamu menyembunyikan kebenaran tentang kenabian Muhammad yang tersebut dalam taurat dan injil, padahal kamu mengetahui tentang kebenaran itu serta akibatnya, yakni siksa yang sangat pedih' seharusnya mereka mengimani kebenaran yang dibawa oleh rasulullah secara tulus, namun justru mereka menularkan sifat kemunafikannya kepada orang lain untuk menyesatkan kaum muslim. Segolongan ahli kitab berkata kepada sesamanya dan kepada orang-orang munafik, berimanlah kamu kepada apa yang diturunkan kepada orangorang beriman, yakni Al-Qur'an pada awal siang, misalnya, dengan melaksanakan salat subuh bersama mereka dan ingkarilah atau murtadlah di akhir siang-Nya, agar mereka, yakni orang-orang islam yang lemah imannya dan yang tidak memiliki pemahaman yang benar terhadap agamanya, akan kembali kepada kekafiran."
  }
]