[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sekelompok ahlu kitab dari orang yahudi berkata, ”imanilah oleh kalian apa yang diturunkan kepada kaum mukminin pada awal harinya,dan ingkarilah oleh kalian hal itu dipenghujung harinya, supaya kaum mukminin itu mengalami keraguan terhadap ajaran agama mereka dan akhirnya meninggalkannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "72. Sekelompok ulama Yahudi (yang lain) mengatakan, “Berimanlah kalian secara lahir kepada Al-Qur`ān yang diturunkan kepada orang-orang mukmin di pagi hari, dan ingkarlah kepadanya di sore hari, agar mereka menjadi ragu terhadap agama mereka karena kalian ingkar kepadanya setelah kalian beriman kepadanya, kemudian mereka akan meninggalkan agama mereka sembari berkata, “Mereka (orang-orang Ahli Kitab) lebih tahu daripada kami tentang kitab-kitab Allah, dan mereka sudah meninggalkannya”.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "72-73. Para pendeta Yahudi yang sesat berkata kepada para pengikut mereka: “Berimanlah kepada al-Qur’an di pagi hari, kemudian ingkarilah ia pada sore harinya, agar kaum muslimin ikut keluar dari agama mereka; dan janganlah kalian percaya kecuali kepada orang Yahudi.” Kemudian Allah memerintahkan Nabi Muhammad untuk membantah mereka, katakanlah: “Hidayah untuk menerima kebenaran bukan di tangan kalian, namun hidayah adalah milik Allah, Dia memberi hidayah kepada kebenaran bagi siapa yang Dia kehendaki.” Kemudian Allah menyebutkan kedengkian orang-orang Yahudi yang mengakatakan: “Janganlah kalian menunjukkan ilmu kalian kepada kaum muslimin sehingga mereka dapat belajar, dan ilmu kalian dan mereka menjadi sama. Maka Allah membalas mereka, katakanlah hai Muhammad: “Hidayah dan karunia berada di tangan Allah dan di bawah kehendak-Nya, Dia mengaruniakan kepada siapa yang Dia kehendaki. Allah Maha Luas pemberian-Nya dan Maha Mengetahui siapa yang layak mendapat pemberian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "72. وَقَالَت طَّآئِفَةٌ مِّنْ أَهْلِ الْكِتٰبِ ( Segolongan (lain) dari Ahli Kitab berkata) Mereka adalah para pemimpin dan orang-orang yang dimuliakan diantara mereka. Mereka mengatakan perkataan ini kepada orang-orang rendahan dari kaum mereka. وَجْهَ النَّهَارِ (pada permulaan siang ) Yakni awal siang. وَاكْفُرُوٓا۟ ءَاخِرَهُۥ ( dan ingkarilah ia pada akhirnya) Yakni memerintahkan mereka untuk murtad dengan waktu yang singkat. لَعَلَّهُمْ يَرْجِعُونَ( supaya mereka (orang-orang mukmin) kembali (kepada kekafiran)) Yakni agar keraguan masuk kedalam diri orang-orang mukmin dan agar sebagian mereka tergoda, sehingga mereka bisa mengatakan: mereka tidaklah meninggalkan Islam setelah mereka memeluknya pada pagi hari ini kecuali karena mereka telah menyingkap kebathilan yang ada dalam Islam. Dengan begitu mereka akan ragu dan mempermudah pemurtadan orang yang sebelumnya susah untuk melakukan itu karena mereka telah melihat orang yang murtad sebelumnya. Dan tipu daya dari orang-orang yang mendapat kemurkaan Allah ini tidak memberikan hasil, dan mereka tidak mengetahui bahwa Allah telah meneguhkan hati orang-orang mukmin dan telah mengokohkan kaki-kaki mereka sehingga mereka tidak terguncang dengan berita-berita bohong dari para musuh Allah, dan tidak menggoyahkan mereka tiupan angin para menentang."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Merencanakan pengrusakan terhadap agama adalah kebiasaan orang-orang Yahudi dan para pengikutnya sepanjang masa."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "72 Segolongan pembesar Ahli Kitab berkata kepada para pengikutnya: “Perlihatkanlah seolah-olah kamu beriman kepada Alquran yang diturunkan kepada orang muslim pada permulaan siang dan ingkarilah pada akhir siang, maksudnya adalah ingkar dengan cepat supaya mereka orang-orang mukmin kembali kepada kekafiran karena ragu. Hal itu adalah pemahaman keliru padahal orang mukmin memiliki iman yang teguh. Sekelompok Yahudi berkata kepada sesama mereka: Berimanlah kepada Alquran yang diturunkan kepada Muhammad dan sahabatnya pada permulaan siang dan kufurlah pada akhir siang, agar mereka ragu kepada agama mereka, agar mereka berbuat sebagaimana perbuatan kita, dan kembali kepada agama mereka. Ayat ini diturunkan untuk mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Segolongan Ahlul kitab berkata, “Berimanlah kalian pada apa yang diturunkan kepada orang-orang yang beriman pada awal siang} di awal siang {dan ingkarlah pada akhir siang agar mereka kembali"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "69-74. Ini merupakan karunia Allah atas umat ini dimana memberitakan kepada mereka tentang tipu daya musuh-musuh mereka dari Ahli KItab, dan bahwa diantara usaha keras mereka dalam menyesatkan kaum Mukminin adalah mereka memakai berbagai cara dalam perbuatan munkar mereka yang busuk. Sekelompok diantara mereka berkata, “Perlihatkanlah (seolah-olah) kamu beriman kepada apa yang diturunkan kepada orang-orang beriman (sahabat-sahabat Rasul) pada permulaan siang,” yakni, di awal hari dan berpalinglah dari agama mereka kembali pada petang hari, dan bila mereka melihat kalian berpaling sedang mereka yakin kalian memiliki ilmu, itu akan membuat mereka ragu terhadap agama mereka, lalu mereka akan berkata, “Sekiranya mereka tidak melihat dalam agama ini apa yang tidak menarik bagi mereka dan tidak sesuai dengan kitab-kitab terdahulu, niscaya mereka pasti tidak akan berpaling. Ini adalah tipu daya mereka. Dan Allah yang memberikan petunjuk kepada siapa yang dikehendakiNya, hanya di TanganNya segala karunia yang Dia khususkan buat siapa yang dikehendakiNya, lalu Allah mengkhususkan kalian wahai umat ini dengan sesuatu yang tidak Dia khususkan bagi umat selain kalian. Dan orang-orang yang berbuat tipu daya itu tidak mengetahui bahwa agama Allah itu adalah haq, yang apabila hakikatnya sampai kepada hati tidaklah akan bertambah waktubagi orang tersebut kecuali akan semakin bertambah pula keimanan dan keyakinan, dan syubhat-syubhat yang ada justru itu menambah kuatnya mereka berpegang teguh pada agamanya dan semakin bersyukur kepada Allah serta memujiNya, di mana Dia telah melimpahkan karuniaNya itu atasnya. Dan perkataan mereka, “Dan (janganlah kamu percaya) bahwa akan diberikan kepada seseorang seperti apa yang diberikan kepadamu, dan (jangan pula kamu percaya) bahwa mereka akan mengalahkan hujjahmu di sisi Rabbmu,” artinya, bahwa yang menyebabkan mereka melakukan perbuatan-perbuatan kemungkaran adalah hasad, dengki, dan ketakutan akan dikalahkan dalam berdebat, sebagaimana Allah berfirman, \"Sebahagian besar Ahli Kitab menginginkan agar mereka dapat mengembalikan kamu kepada kekafiran setelah kamu beriman, karena dengki yang (timbul) dari diri mereka sendiri, setelah nyata bagi mereka kebenaran. Maka maafkanlah dan biarkanlah mereka, sampai Allah mendatangkan perintah-Nya. Sesungguhnya Allah Maha Kuasa atas segala sesuatu.\" QS-Al-Baqarah:109-"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 72: Dan segolongan dari Ahli Kitab telah berkata: \"Berimanlah kepada apa-apa yang diturunkan kepada orang-orang yang beriman itu pada siang hari, dan kufurlah kepadanya pada waktu petang supaya mereka kembali."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni orang-orang Yahudi. Yakni agar kaum mukmin meragukan kebenaran agama mereka, sehingga mereka mengatakan \"Jika memang agama ini benar, tentu mereka tidak akan murtad daripadanya\", akhirnya mereka mau kembali kafir."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 72",
    "description": "Seharusnya mereka mengimani kebenaran yang dibawa oleh rasulullah secara tulus, namun justru mereka menularkan sifat kemunafikannya kepada orang lain untuk menyesatkan kaum muslim. Segolongan ahli kitab berkata kepada sesamanya dan kepada orang-orang munafik, berimanlah kamu kepada apa yang diturunkan kepada orangorang beriman, yakni Al-Qur'an pada awal siang, misalnya, dengan melaksanakan salat subuh bersama mereka dan ingkarilah atau murtadlah di akhir siang-Nya, agar mereka, yakni orang-orang islam yang lemah imannya dan yang tidak memiliki pemahaman yang benar terhadap agamanya, akan kembali kepada kekafiran. Mereka, ahli kitab, bahkan berusaha meyakinkan kepada sesamanya bahwa predikat rasul terakhir adalah hak mereka. Karena itu, janganlah kamu, wahai ahli kitab, percaya selain kepada orang yang mengikuti agama kalian. Dengan begitu, mereka tidak jadi masuk islam. Atau, jangan percaya kepada orang-orang yang masuk islam, yang dulunya berasal dari agama kamu, agar iman mereka menjadi guncang dan kembali kepada kekafiran. Katakanlah, wahai nabi Muhammad, sesungguhnya petunjuk itu, hanyalah petunjuk Allah dan akan diberikan kepada siapa saja yang dipilih-Nya sesuai dengan hukum-hukum yang telah dia tetapkan. Kamu juga jangan percaya bahwa seseorang akan diberi seperti apa yang diberikan kepada kamu, atau bahwa mereka akan menyanggah kamu di hadapan tuhanmu. Katakanlah, wahai nabi Muhammad, sesungguhnya karunia itu di tangan Allah, dia memberikannya kepada siapa yang dia kehendaki dari hamba-hamba-Nya. Allah mahaluas karunianya, maha mengetahui kepada siapa karunia tersebut harus diberikan."
  }
]