[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan janganlah kalian membenarkan dengan sebenarnya, kecuali orang yang mengikuti agama kalian yang menjadi seorang penganut yahudi,” katakanlah kepada mereka olehmu (wahai rasul) ”sesungguhnya hidayah dan taufik itu adalah hidayah dan taufik dari Allah menuju keimanan yang benar.” dan mereka juga mengatakan, ”janganlah kalian tampakkan pengetahuan yang kalian miliki kepada kaum muslimin, lalu mereka nanti akan belajar kepada kalian sehingga mereka setara dengan kalian dalam ilmu itu, sehingga mereka memiliki keunggulan di atas kalian atau akan menjadikan pengetahuan itu sebagai hujjah di sisi tuhan kalian yang mereka kelak akan mengalahkan kalian dengannya.” katakanlah oleh mu (wahai rasul), ”sesungguhnya karunia, pemberian dan segala perkara itu seluruhnya ada ditangan Allah dan dibawah kendaliNYA.Dia memberikannya kepada siapa saja yang dikehendakiNYA dari orang-orang yang telah beriman kepadaNYA dan rasulNYA. Dan Allah maha luas karuniaNYA lagi maha mengetahui. Yang meliputi dengan Ilmu dan anugrah Nya kepada seluruh makhlukNYA yang berhak mendapatkan karunia dan kenikmatanNYA.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "73. Mereka juga mengatakan, “Janganlah kalian percaya dan mengikuti kecuali orang Yahudi yang memeluk agama kalian.” Katakanlah -wahai Rasul-, “Sesungguhnya petunjuk kepada kebenaran itu adalah petunjuk Allah, bukan pendustaan dan pengingkaran yang kalian lakukan karena khawatir akan ada seseorang yang diberikan anugerah seperti yang pernah diberikan kepada kalian, atau karena khawatir mereka akan mengalahkan hujjah kalian di sisi Rabb kalian jika kalian mengakui apa yang diturunkan kepada mereka.” Katakanlah -wahai Rasul-, “Sesungguhnya karunia itu ada di tangan Allah. Dia berhak memberikannya kepada siapa saja yang Dia kehendaki di antara hamba-hamba-Nya. Anugerah-Nya tidak hanya diberikan kepada umat tertentu saja, sedangkan umat yang lain tidak diberi. Dan Allah Mahaluas anugerah-Nya lagi Maha Mengetahui siapa yang berhak menerimanya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "73. وَلَا تُؤْمِنُوٓا۟ إِلَّا لِمَن تَبِعَ دِينَكُمْ ( Dan janganlah kamu percaya melainkan kepada orang yang mengikuti agamamu) Ini adalah bagian dari perkataan orang-orang Yahudi diantara mereka. Yakni para pemimpin berkata kepada para bawahannya: janganlah kalian beriman dengan iman yang benar kecuali kepada orang yang mengikuti agama yang kalian anut, adapun selain mereka yang telah masuk Islam maka tunjukkanlah kepada mereka keimanan itu untuk sekedar menipu saja. قُلْ إِنَّ الْهُدَىٰ هُدَى اللهِ( Katakanlah: “Sesungguhnya petunjuk (yang harus diikuti) ialah petunjuk Allah) Yakni ditangan-Nya lah petunjuk. Dan apabila kalian tidak mengikuti petunjuk tersebut wahai kaum Yahudi maka sebenarnya kalian telah mengetahui kebenaran, meski begitu hal itu tidak membuat kalian beriman. أَن يُؤْتَىٰٓ أَحَدٌ مِّثْلَ مَآ أُوتِيتُمْ أَوْ يُحَآجُّوكُمْ عِندَ رَبِّكُمْ ۗ ( dan (janganlah kamu percaya) bahwa akan diberikan kepada seseorang seperti apa yang diberikan kepadamu, dan (jangan pula kamu percaya) bahwa mereka akan mengalahkan hujjahmu di sisi Tuhanmu) Ini juga adalah bagian dari perkataan orang-orang Yahudi diantara mereka. Mereka berkata: sebenarnya yang membuat kita menjalankan langkah ini adalah karena kita dengki terhadap orang-orang mukmin atas kenabian dan kitab yang kini berada diantara mereka sebagaimana hal itu dulunya berada diantara kita. Dan agar orang-orang mukmin tidak mendebat kita di hari kiamat di hadapan Allah bahwa kita dahulu telah mengetahui kebenaran namun tidak kita ikuti, atau mereka mendebat kita dengan berimannya sebagian dari kita dan teguh dalam keimanannya. قُلْ إِنَّ الْفَضْلَ بِيَدِ اللهِ ( Katakanlah: “Sesungguhnya karunia itu di tangan Allah( Dan bagian dari karunia-Nya adalah kenabian dan agama Islam. يُؤْتِيهِ مَن يَشَآءُ ۗ ( Allah memberikan karunia-Nya kepada siapa yang dikehendaki-Nya) Yakni tidak ada yang mampu menolak karunia-Nya dan tidak ada pula yang mampu mengatur kepada siapa karunia itu diberikan. Dan Allah telah berkehendak untuk mengistimewakan Nabi Muhammad dan umatnya dengan agama ini."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). { قُلْ إِنَّ الْهُدَىٰ هُدَى اللهِ } \"Katakanlah: “Sesungguhnya petunjuk (yang harus diikuti) ialah petunjuk Allah\" Ayat ini dan ayat-ayat semacamnya menunjukkan bahwasanya barangsiapa yang meminta pentunjuk dan jalan yang benar selain dari kitab Allah dan sunnah Rasul-Nya pasti akan tersesat, karena sesungguhnya petunjuk (hidayah) hanya akan diperoleh dari petunjuk yang Allah turunkan melalui Rasulul-Nya. 2 ). Kenapa sebagian besar ummat manusia berbangga diri dengan segala yang ia miliki, padahal jika Allah tidak menurunkan kepada pertolongan ia akan hina ? dan jika saja Allah tidak menutup aibnya niscaya kelemahanya akan terungkap, dan jika sebagian orang memiliki kecerdasan dan kekayaan maka dari mana ia datangkan ? { قُلْ إِنَّ الْفَضْلَ بِيَدِ اللهِ } \"Katakanlah: “Sesungguhnya karunia itu di tangan Allah\" , dan jika seandainya Allah mengentikan semua pemberian-Nya itu, sungguh orang-orang cerdas itu akan berpindah ke rumah sakit jiwa !"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "73 Para pembesar Yahudi juga berkata kepada para pengikutnya: Janganlah kamu percaya melainkan kepada orang yang mengikuti agamamu. Katakanlah kepada mereka wahai Nabi: “Sesungguhnya petunjuk itu adalah di tangan Allah. Kemudian mereka berkata: Jangan percaya bahwa Allah memberikan kitab juga kenabian selain kepada orang Yahudi. Dan jangan pula kamu percaya bahwa mereka akan mengalahkan hujjahmu di sisi Tuhanmu pada hari kiamat”. Katakanlah wahai Nabi: “Sesungguhnya karunia itu di tangan Allah, diantara karunia-Nya adalah anugerah kenabian dan Islam, Allah memberikan karunia-Nya kepada siapa yang dikehendaki-Nya; dan Allah Maha Luas karunia-Nya lagi Maha Mengetahui kepada mereka yang akan menerimanya.” Allah telah mengkhususkan Muhammad dan ummatnya dalam Alquran. Para pendeta Yahudi berkata kepada orang-orang di luar mereka; Jangan kalian beriman kecuali kepada orang-orang yang mengikuti agama kalian. Kemudian Allah menurunkan ayat: Sesungguhnya petunjuk adalah petunjuk Allah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Janganlah percaya} janganlah kalian mempercayai {selain kepada orang yang mengikuti agama kalian. Katakanlah, “Sesungguhnya petunjuk itu hanyalah petunjuk Allah. bahwa seseorang akan diberi} diberi {seperti apa yang diberikan kepada kalian atau mereka akan menyanggah kalian di sisi Tuhan kaliaan.” Katakanlah, “Sesungguhnya karunia itu di tangan Allah. Dia menganugerahkannya kepada siapa saja yang Dia kehendaki. Allah Maha luas lagi Maha Mengetahui.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "69-74. Ini merupakan karunia Allah atas umat ini dimana memberitakan kepada mereka tentang tipu daya musuh-musuh mereka dari Ahli KItab, dan bahwa diantara usaha keras mereka dalam menyesatkan kaum Mukminin adalah mereka memakai berbagai cara dalam perbuatan munkar mereka yang busuk. Sekelompok diantara mereka berkata, “Perlihatkanlah (seolah-olah) kamu beriman kepada apa yang diturunkan kepada orang-orang beriman (sahabat-sahabat Rasul) pada permulaan siang,” yakni, di awal hari dan berpalinglah dari agama mereka kembali pada petang hari, dan bila mereka melihat kalian berpaling sedang mereka yakin kalian memiliki ilmu, itu akan membuat mereka ragu terhadap agama mereka, lalu mereka akan berkata, “Sekiranya mereka tidak melihat dalam agama ini apa yang tidak menarik bagi mereka dan tidak sesuai dengan kitab-kitab terdahulu, niscaya mereka pasti tidak akan berpaling. Ini adalah tipu daya mereka. Dan Allah yang memberikan petunjuk kepada siapa yang dikehendakiNya, hanya di TanganNya segala karunia yang Dia khususkan buat siapa yang dikehendakiNya, lalu Allah mengkhususkan kalian wahai umat ini dengan sesuatu yang tidak Dia khususkan bagi umat selain kalian. Dan orang-orang yang berbuat tipu daya itu tidak mengetahui bahwa agama Allah itu adalah haq, yang apabila hakikatnya sampai kepada hati tidaklah akan bertambah waktubagi orang tersebut kecuali akan semakin bertambah pula keimanan dan keyakinan, dan syubhat-syubhat yang ada justru itu menambah kuatnya mereka berpegang teguh pada agamanya dan semakin bersyukur kepada Allah serta memujiNya, di mana Dia telah melimpahkan karuniaNya itu atasnya. Dan perkataan mereka, “Dan (janganlah kamu percaya) bahwa akan diberikan kepada seseorang seperti apa yang diberikan kepadamu, dan (jangan pula kamu percaya) bahwa mereka akan mengalahkan hujjahmu di sisi Rabbmu,” artinya, bahwa yang menyebabkan mereka melakukan perbuatan-perbuatan kemungkaran adalah hasad, dengki, dan ketakutan akan dikalahkan dalam berdebat, sebagaimana Allah berfirman, \"Sebahagian besar Ahli Kitab menginginkan agar mereka dapat mengembalikan kamu kepada kekafiran setelah kamu beriman, karena dengki yang (timbul) dari diri mereka sendiri, setelah nyata bagi mereka kebenaran. Maka maafkanlah dan biarkanlah mereka, sampai Allah mendatangkan perintah-Nya. Sesungguhnya Allah Maha Kuasa atas segala sesuatu.\" QS-Al-Baqarah:109-"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 73: \"Dan janganlah kamu percaya melainkan kepada orang yang menurut agama kamu\" katakanlah: \"Sesungguhnya petunjuk (yang sebenarnya) itu, ialah petunjuk allah yang akan diberi kepada siapa saja sebagaimana pemberian yang diberikan kepada kamu, atau (akan ada siapa saja) menggugat kamu di sisi Tuhan kamu, Katakanlah: \"Sesungguhnya keutamaan itu di tangan Allah. Ia berikan kepada siapa-siapa yang la kehendaki; dan Allah itu luas (pemberian-Nya), amat Mengetahui."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya: Jangan kamu percayakan dan menyampaikan rahasia selain kepada orang yang seagama dengan kamu (Yahudi/Nasrani) agar orang lain tidak jadi masuk Islam. Hal ini karena jika mereka menyampaikan pengetahuan yang sebenarnya kepada selain mereka, nantinya orang lain memiliki ilmu tentang kebenaran risalah Muhammad shallallahu 'alaihi wa sallam sebagaimana yang dimiliki mereka sehingga masuk Islam, orang itu pun akan mengalahkan hujjah mereka di hadapan Allah pada hari kiamat, bersaksi bahwa hujjah telah tegak kepada mereka di dunia dan petunjuk telah jelas, namun mereka tidak mau mengikuti. Sebagai jawaban terhadap anggapan mereka bahwa pengetahuan tentang kebenaran hanya dimiliki mereka saja. Petunjuk itu berasal dari Allah. Petunjuk itu bisa berupa mengetahui kebenaran maupun mengamalkan kebenaran itu (memperoleh taufiq), dan tidak ada yang memperoleh taufiq selain orang yang diberi taufiq oleh Allah. Orang-orang Ahli Kitab tidaklah diberi pengetahuan kecuali sedikit, sedangkan taufiq untuk beramal, maka telah hilang dari mereka karena busuknya niat dan buruknya tujuan mereka. Adapun umat ini, maka mereka memperoleh hidayah dan taufiq (yakni ilmu dan amal), sehingga wal hamdulillah umat ini karena hidayah dari Allah memperoleh berbagai cabang ilmu dan pengetahuan dengan dibarengi amal, mereka pun memperoleh ketinggian, menjadi orang-orang yang menunjukkan jalan yang lurus dengan perintah Allah. Hal ini merupakan karunia Allah dan ihsan-Nya yang besar kepada mereka. Yakni orang selain kamu. Berupa pengetahuan tentang kebenaran. Yakni mengetahui siapa yang berhak memperoleh karunia itu dan siapa yang tidak."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 73",
    "description": "Mereka, ahli kitab, bahkan berusaha meyakinkan kepada sesamanya bahwa predikat rasul terakhir adalah hak mereka. Karena itu, janganlah kamu, wahai ahli kitab, percaya selain kepada orang yang mengikuti agama kalian. Dengan begitu, mereka tidak jadi masuk islam. Atau, jangan percaya kepada orang-orang yang masuk islam, yang dulunya berasal dari agama kamu, agar iman mereka menjadi guncang dan kembali kepada kekafiran. Katakanlah, wahai nabi Muhammad, sesungguhnya petunjuk itu, hanyalah petunjuk Allah dan akan diberikan kepada siapa saja yang dipilih-Nya sesuai dengan hukum-hukum yang telah dia tetapkan. Kamu juga jangan percaya bahwa seseorang akan diberi seperti apa yang diberikan kepada kamu, atau bahwa mereka akan menyanggah kamu di hadapan tuhanmu. Katakanlah, wahai nabi Muhammad, sesungguhnya karunia itu di tangan Allah, dia memberikannya kepada siapa yang dia kehendaki dari hamba-hamba-Nya. Allah mahaluas karunianya, maha mengetahui kepada siapa karunia tersebut harus diberikan. Dia juga menentukan rahmat-Nya, yakni kenabian dan risalah, kepada siapa yang dia kehendaki. Allah memiliki karunia yang besar, tidak seorang pun bisa melawan-Nya dan menghalangi-Nya kepada siapa karunia itu akan diberikan. Rangkaian ayat-ayat ini mengajari manusia agar tidak dengki atas karunia yang Allah berikan kepada orang lain, sebab hal itu hanya akan mendorong seseorang melakukan perilaku buruk lainnya."
  }
]