[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya Allah mengkhususkan dari hamba-hambaNYA siapa yang dia kehendaki dengan kenabian dan hidayah menuju ajaran syariat paling sempurna. Dan Allah mempunyai kebaikan dan pemberian yang banyak lagi luas."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "74. Allah mengkhususkan rahmat-Nya kepada orang yang Dia kehendaki di antara makhluk-Nya. Maka Allah menganugerahi orang tersebut dengan hidayah, kenabian dan beragam pemberian lainnya. Dan Allah adalah Żat yang memiliki anugerah yang sangat besar dan tidak terbatas."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "74. Allah memberi kabar gembira kepada orang-orang beriman bahwa Dia mengistimewakan siapa yang Dia kehendaki dengan kenabian dan petunjuk kepada keimanan. Allah pemilik karunia yang besar bagi hamba-hamba-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "74. يَخْتَصُّ بِرَحْمَتِهِۦ ( Allah menentukan rahmat-Nya kepada siapa yang dikehendaki-Nya) Dikatakan bahwa yang dimaksud adalah kenabian dan keimanan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "74 Allah menentukan rahmat kenabian kepada siapa yang dikehendaki-Nya, serta menentukan rahmat-Nya kepada orang mukmin seperti aoa yang dikehendaki-Nya dan Allah Maha luas karunia-Nya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia menentukan rahmatNya kepada siapa saja yang Dia kehendaki dan Allah memiliki karunia yang besar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "69-74. Ini merupakan karunia Allah atas umat ini dimana memberitakan kepada mereka tentang tipu daya musuh-musuh mereka dari Ahli KItab, dan bahwa diantara usaha keras mereka dalam menyesatkan kaum Mukminin adalah mereka memakai berbagai cara dalam perbuatan munkar mereka yang busuk. Sekelompok diantara mereka berkata, “Perlihatkanlah (seolah-olah) kamu beriman kepada apa yang diturunkan kepada orang-orang beriman (sahabat-sahabat Rasul) pada permulaan siang,” yakni, di awal hari dan berpalinglah dari agama mereka kembali pada petang hari, dan bila mereka melihat kalian berpaling sedang mereka yakin kalian memiliki ilmu, itu akan membuat mereka ragu terhadap agama mereka, lalu mereka akan berkata, “Sekiranya mereka tidak melihat dalam agama ini apa yang tidak menarik bagi mereka dan tidak sesuai dengan kitab-kitab terdahulu, niscaya mereka pasti tidak akan berpaling. Ini adalah tipu daya mereka. Dan Allah yang memberikan petunjuk kepada siapa yang dikehendakiNya, hanya di TanganNya segala karunia yang Dia khususkan buat siapa yang dikehendakiNya, lalu Allah mengkhususkan kalian wahai umat ini dengan sesuatu yang tidak Dia khususkan bagi umat selain kalian. Dan orang-orang yang berbuat tipu daya itu tidak mengetahui bahwa agama Allah itu adalah haq, yang apabila hakikatnya sampai kepada hati tidaklah akan bertambah waktubagi orang tersebut kecuali akan semakin bertambah pula keimanan dan keyakinan, dan syubhat-syubhat yang ada justru itu menambah kuatnya mereka berpegang teguh pada agamanya dan semakin bersyukur kepada Allah serta memujiNya, di mana Dia telah melimpahkan karuniaNya itu atasnya. Dan perkataan mereka, “Dan (janganlah kamu percaya) bahwa akan diberikan kepada seseorang seperti apa yang diberikan kepadamu, dan (jangan pula kamu percaya) bahwa mereka akan mengalahkan hujjahmu di sisi Rabbmu,” artinya, bahwa yang menyebabkan mereka melakukan perbuatan-perbuatan kemungkaran adalah hasad, dengki, dan ketakutan akan dikalahkan dalam berdebat, sebagaimana Allah berfirman, \"Sebahagian besar Ahli Kitab menginginkan agar mereka dapat mengembalikan kamu kepada kekafiran setelah kamu beriman, karena dengki yang (timbul) dari diri mereka sendiri, setelah nyata bagi mereka kebenaran. Maka maafkanlah dan biarkanlah mereka, sampai Allah mendatangkan perintah-Nya. Sesungguhnya Allah Maha Kuasa atas segala sesuatu.\" QS-Al-Baqarah:109-"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 74: \"Ia menentukan rahmat-Nya kepada siapa-siapa yang Ia kehendaki; dan Allah itu mempunyai karunia yang besar.\""
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya: Kenabian dan hidayah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 74",
    "description": "Dia juga menentukan rahmat-Nya, yakni kenabian dan risalah, kepada siapa yang dia kehendaki. Allah memiliki karunia yang besar, tidak seorang pun bisa melawan-Nya dan menghalangi-Nya kepada siapa karunia itu akan diberikan. Rangkaian ayat-ayat ini mengajari manusia agar tidak dengki atas karunia yang Allah berikan kepada orang lain, sebab hal itu hanya akan mendorong seseorang melakukan perilaku buruk lainnyaayat sebelumnya menjelaskan perilaku buruk ahli kitab terhadap kaum muslim yang disebabkan oleh rasa kedengkian atas karunia yang diberikan kepada mereka, maka ayat ini menginformasikan bahwa di antara ahli kitab ada juga yang baik. Di antara ahli kitab ada yang jika engkau percayakan kepadanya harta yang banyak, niscaya dia mengembalikan semua-Nya kepadamu dan tidak berkurang sedikit pun. Tetapi ada pula di antara mereka yang jika engkau percayakan kepadanya satu dinar, yakni harta yang sedikit, dia justru tidak mengembalikannya kepadamu, kecuali jika engkau selalu menagihnya. Yang demikian itu disebabkan adanya keyakinan mereka bahwa orang-orang selain mereka memang layak untuk dizalimi, dibohongi, dan dikhianati. Karena itu mereka berani melanggar hukum Allah seraya berkata, tidak ada dosa bagi kami terhadap orang-orang buta huruf, yakni selain golongan ahli kitab. Mereka dengan sengaja mengatakan hal yang dusta terhadap Allah, padahal mereka mengetahui kalau hal itu adalah dosa besar."
  }
]