[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan diantara ahlu kitab dari golongan yahudi ada orang yang kamu percayakan kepadanya harta yang banyak dan dia akan menyerahkan itu kembali kepadamu tanpa mengkhianatinya. Dan diantara mereka juga ada orang yang bila kamu mempercayakan kepadanya satu dinar saja,dia tidak mengembalkannya kepadamu, kecuali kamu telah mengeluarkan segala upaya untuk memintanya. Dan sebab dari semua itu adalah keyakinan rusak yang menyebabkan mereka menghalalkan harta orang-orang arab dengan cara-cara batil, dan mereka mengatakan, ”tidak ada dosa dan kesalahan atas kami ketika memakan harta mereka, karena Allah menghalalkannya bagi kami.” Dan ini merupakan kedustaan kepada Allah, mereka mengatakan hal itu dengan bibir-bibir mereka, sedang mereka sendiri mengetahui bahwa sesungguhnya mereka itu benar-benar berdusta."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "75. Sebagian orang Ahli Kitab apabila kamu menitipkan kepadanya suatu amanah berupa harta yang banyak, maka ia akan menyerahkan amanah itu kepadamu. Tetapi sebagian dari mereka apabila kamu menitipkan kepadanya sebuah amanah berupa harta yang sedikit, maka ia tidak akan mengembalikan amanah itu kepadamu kecuali jika kamu terus-menerus mendesaknya agar memberikannya dengan cara mengajukan tuntutan dan tagihan. Hal itu disebabkan oleh adanya ucapan dan anggapan mereka yang sesat, “Kami tidak berdosa bila kami memakan harta orang-orang Arab (secara ilegal), karena Allah telah memperbolehkannya untuk kami.” Mereka melontarkan kebohongan itu, padahal mereka tahu bahwa mereka telah berkata dusta atas nama Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "75. Allah mengabarkan tentang para Ahli Kitab, bahwa di antara mereka terdapat sekelompok orang yang dapat menjaga amanah, jika kamu amanahkan harta yang banyak kepada mereka niscaya mereka akan menjalankannya dengan baik. Namun terdapat pula sekelompok orang yang jika kamu amanahkan kepada mereka satu dinar atau kurang dari itu niscaya mereka tidak akan mengembalikannya kepadamu kecuali jika kamu terus menerus menagihnya; hal ini karena buruknya keyakinan mereka, mereka menganggap kezaliman kepada orang arab dan orang lain selain Yahudi tidak berdosa, mereka menganggap halal harta mereka. Keyakinan ini merupakan pendustaan terhadap Allah, dan mereka mengetahui bahwa mereka adalah para pendusta."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "75. وَمِنْ أَهْلِ الْكِتٰبِ مَنْ إِن تَأْمَنْهُ بِقِنطَارٍ ( Di antara Ahli kitab ada orang yang jika kamu mempercayakan kepadanya harta yang banyak) Yakni ‘se-qinthar’ emas dan ia seukuran 100 Rathl (sekitar 3,81 kg menurut madzhab Syafi’i) hal ini untuk mengistilahkan banyaknya harta yang dipercayakan kepadanya. وَمِنْهُم مَّنْ إِن تَأْمَنْهُ بِدِينَارٍ ( dan di antara mereka ada orang yang jika kamu mempercayakan kepadanya satu dinar) Untuk mengungkapkan betapa sedikitnya harta yang dipercayakan kepadanya dan betapa besar ketamakannya. Yakni bahwa diantara Ahli kitab terdapat orang yang dapat dipercaya yang menunaikan amanah yang dipercayakan kepadanya meski harta itu banyak; dan sebagian lainnya terdapat orang yang suka berkhianat yang tidak menunaikan amanah meski harta itu kecil dan remeh. Barangsiapa dapat dipercaya untuk harta yang banyak maka terlebih lagi ia dapat dipercaya untuk harta yang sedikit. Dan barangsiapa yang suka berkhianat pada harta yang sedikit maka terlebih lagi pada harta yang banyak. إِلَّا مَا دُمْتَ عَلَيْهِ قَآئِمًا ۗ (kecuali jika kamu selalu menagihnya ) Yakni ia tidak menunaikan amanahnya dalam keadaan apapun kecuali jika kamu selalu menuntutnya dengan membawa bukti untuk hakmu itu, selalu mempersempitnya, dan menagihnya untuk segera mengembalikannya kepadamu. ذٰلِكَ بِأَنَّهُمْ قَالُوا۟ لَيْسَ عَلَيْنَا فِى الْأُمِّيِّۦنَ سَبِيلٌ ( Yang demikian itu lantaran mereka mengatakan: “tidak ada dosa bagi kami terhadap orang-orang ummi) Makna (الأميون) yakni orang-orang arab dan umat lainnya yang bukan termasuk Ahli kitab. Yakni mereka berkata: tidak ada dosa atas kami dalam menzalimi mereka karena mereka menyelisihi agama kami, dan mereka mengklaim bahwa hal itu terdapat dalam kitab mereka. وَيَقُولُونَ عَلَى اللهِ الْكَذِبَ وَهُمْ يَعْلَمُونَ ( Mereka berkata dusta terhadap Allah, padahal mereka mengetahui) Allah mengabarkan bahwa hal itu bukanlah bagian dari agama yang Dia turunkan kepada mereka, akan tetapi itu hanyalah kebohongan yang mereka buat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "75 Di antara Ahli kitab ada orang yang jika kamu mempercayakan harta yang banyak kepadanya, maka dikembalikannya kepadamu; dan di antara mereka ada orang yang jika kamu mempercayakan satu dinar atau lebih sedikit kepadanya, maka tidak dikembalikannya kepadamu sebab ketamakannya kecuali jika kamu selalu menagihnya. Pembangkangan itu lantaran mereka mengatakan: “Tidak ada dosa bagi kami terhadap orang-orang ummi: golongan Arab selain Ahli Kitab. Dan tidak ada dosa dalam memakan harta orang mukmin, sebab agama mereka bertentangan dengan kami orang Yahudi. Allah telah menghalalkan harta mereka untuk kami. Mereka berkata dusta terhadap Allah dengan perkataan ini, padahal mereka mengetahui dengan keyakinan bahwa Allah tidak menghalalkan hal tersebut"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Di antara Ahlul kitab ada orang yang jika kamu percayakan kepadanya harta yang banyak} harta yang banyak {niscaya dia mengembalikannya kepadamu. Di antara mereka juga ada orang yang jika kamu percayakan kepadanya satu dinar, dia tidak mengembalikannya kepadamu, kecuali jika kamu selalu menagihnya} terus menerus menagih hakmu {Yang demikian itu} tipu daya menghalalkan yang haram dan pengkhianatan {disebabkan mereka} karena mereka {berkata, “Tidak ada dosa bagi kami terhadap orang-orang umiy.”} dalam harta orang Arab tidak ada dosa juga kesalahan {Mereka mengatakan hal yang dusta terhadap Allah, padahal mereka mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "75. Allah memberitakan tentang Ahli KItab bahwasanya ada sekelompok dari mereka orang-orang yang terpecaya, dimana bila Anda berikan kepada mereka sejumlah harta yang banyak, niscaya mereka akan menunaikannya dengan amanah kepada Anda. Ada juga sekelompok dari mereka orang-orang yang tidak jujur yang akan selalu berkhianat walaupun hartanya sedikit sekali, dan bersama pengkhianatan yang keji ini, mereka membuat dalih-dalih yang batil dengan berkata, “Tidak ada dosa bagi kami terhadap orang-orang ummi,” (orang-orang Arab), artinya, tidak ada kesalahan atas kami bila mengkhianati mereka dan menghalalkan harta mereka, karena mereka tidak memiliki kehormatan. Allah berfirman, “Mereka berkata dusta terhadap Allah, padahal mereka mengetahui,” artinya, mereka menanggung dosa yang paling dahsyat di mana mereka menyatukan pengkhianatan dengan penghinaan terhadap bangsa Arab dan juga dengan dusta atas nama Allah, dan mereka mengetahui hal tersebut, bahwa mereka bukan seperti orang-orang yang melakukan hal semacam itu atas dasar tidak mengerti dan tersesat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 75: Dan sebagian daripada Ahli Kitab ada orang yang, kalau engkau percayai dia amanah, ia akan tunaikan kepadamu; dan sebagian daripada mereka, ada orang yang, kalau engkau percayai dia satu dinar, ia tidak akan tunaikan kepadamu, kecuali kalau tetap engkau menuntut dia. Yang demikian itu lantaran mereka berkata: tidak ada dosa atas kita tentang (memakan hak) orang-orang bodoh itu dan mereka berdusta atas nama Allah padahal mereka tahu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala dalam ayat ini menerangkan keadaan Ahli Kitab dalam hal amanah dan khianat pada harta, setelah menyebutkan khianatnya mereka dalam agama, makar yang mereka lakukan dan sikap mereka menyembunyikan kebenaran. Dengan tidak berkhianat sebagaimana yang dilakukan Abdullah bin Salam dan kawan-kawannya. Jika mereka tidak berkhianat terhadap harta yang banyak, maka terhadap harta yang sedikit tentu lebih tidak berkhianat lagi. Yakni karena sifat khianatnya sebagaimana yang dilakukan Ka'ab bin Al Asyraf dan kawan-kawannya. Jika terhadap harta yang sedikit saja berani berkhianat apalagi terhadap harta yang banyak. Pernyataan ini merupakan anggapan halal dari mereka terhadap harta orang-orang Arab atau anggapan halal dari mereka berbuat zhalim kepada orang-orang yang tidak seagama dengan mereka. Mereka melihat rendah kepada orang-orang selain mereka, dan memandang besar diri mereka, oleh karena itu mereka menganggap bahwa orang-orang ummi tidak perlu dihargai dan dihormati. Mereka menggabung antara memakan harta yang haram dan meyakini sebagai sesuatu yang halal, mereka menyandarkan anggapan itu kepada Allah Subhaanahu wa Ta'aala, padahal berdusta terhadap Allah lebih besar dosanya dibanding berkata tentang Allah tanpa ilmu. Yang mereka maksud dengan orang-orang Ummi dalam ayat ini adalah orang-orang Arab."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 75",
    "description": "Ayat sebelumnya menjelaskan perilaku buruk ahli kitab terhadap kaum muslim yang disebabkan oleh rasa kedengkian atas karunia yang diberikan kepada mereka, maka ayat ini menginformasikan bahwa di antara ahli kitab ada juga yang baik. Di antara ahli kitab ada yang jika engkau percayakan kepadanya harta yang banyak, niscaya dia mengembalikan semua-Nya kepadamu dan tidak berkurang sedikit pun. Tetapi ada pula di antara mereka yang jika engkau percayakan kepadanya satu dinar, yakni harta yang sedikit, dia justru tidak mengembalikannya kepadamu, kecuali jika engkau selalu menagihnya. Yang demikian itu disebabkan adanya keyakinan mereka bahwa orang-orang selain mereka memang layak untuk dizalimi, dibohongi, dan dikhianati. Karena itu mereka berani melanggar hukum Allah seraya berkata, tidak ada dosa bagi kami terhadap orang-orang buta huruf, yakni selain golongan ahli kitab. Mereka dengan sengaja mengatakan hal yang dusta terhadap Allah, padahal mereka mengetahui kalau hal itu adalah dosa besarpadahal, yang benar adalah bahwa mereka tetap berdosa karena khianat. Sebab, sebenarnya barangsiapa menepati janji dengan mengembalikan hak orang lain sesuai dengan waktu yang telah ditentukan dan bertakwa, maka sungguh dengan takwa itu ia akan memperoleh cinta Allah, karena Allah senantiasa mencintai orang-orang yang bertakwa. Ini menunjukkan bahwa menepati janji atau tidak khianat menjadi salah satu kriteria ketakwaan."
  }
]