[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bukanlah urusan ini seperti yang dikira oleh orang-orang yang berdusta itu. Maka sesungguhnya orang yang bertakwa dengan sebenarnya ialah orang yang memenuhi janji yang sudah diadakan oleh Allah padanya berupa melaksanakan amanat, beriman kepada Nya dan rasul-rasul NYA serta berpegang teguh dengan petunjuk dan ajaran syari’atNYA, dan takut kepada Allah lalu dia menjalankan perintahNYA dan berhenti dari apa yang telah dilarangNYA. Dan Allah mencintai orang-orang yang bertakwa yang menghindarkan diri mereka dari syirik dan perbuatan-perbuatan maksiat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "76. Masalah yang sebenarnya tidaklah seperti anggapan mereka. Mereka tetap berdosa. Tetapi siapa yang mau menepati janjinya kepada Allah dengan menyatakan beriman kepada-Nya dan kepada Rasul-Nya, dan menepati janjinya kepada sesama manusia dengan cara memberikan amanahnya, serta takut kepada Allah dengan menjalankan perintah-perintah-Nya dan menjauhi larangan-larangan-Nya, sesungguhnya Allah mencintai orang-orang yang bertakwa dan akan memberi mereka balasan yang sebaik-baiknya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "76. Sungguh, mereka telah membuat kedustaan terhadap Allah.. Namun orang yang memenuhi janji dengan Allah untuk menunaikan hak-Nya dan hak orang lain serta takut kepada Allah dengan menjalankan perintah dan menjauhi larangan-Nya, maka Allah mencintai orang-orang yang takut kepada-Nya dan menunaikan hak-hak yang Allah berikan kepada mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "76. بَلَىٰ (Bukan demikian ) Yakni mereka tidak diperbolehkan dalam kebohongan mereka dan penghalalan harta orang-orang arab, dan bagi mereka dosa apabila memakan harta seseorang dengan cara yang bathil meski orang tersebut kafir atau menyelisihi agama mereka. مَنْ أَوْفَىٰ بِعَهْدِهِۦ ( siapa yang menepati janji (yang dibuat)nya) Yakni janji dengan Allah, kemudian mentaati-Nya dan mengamalkan syari’at-Nya. وَاتَّقَىٰ ( dan bertakwa) Sehingga ia tidak memakan harta orang lain dengan cara yang bathil, dan ia menunaikan hak dan amanah kepada pemiliknya maka sesungguhnya Allah menyukai orang-orang yang bertakwa."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "76 Bukan demikian, sebenarnya siapa yang berdosa sebab dusta dan menghalalkan harta orang Arab dan lainnya dan memakannya dengan bathil. Juga siapa sebenarnya yang menepati janji yang dibuat, dan menyampaikan amanah yang dipercayakan, serta takut kepada Allah. Kemudian dari itu tidak berdusta dan tidak menghalalkan yang diharamkan, maka sesungguhnya mereka akan mendapatkan ridha Allah. Sesungguhnya Allah ridha kepada orang-orang yang bertakwa yang taat kepada perintah-Nya dan menjauhi larangan-Nya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bukan begitu!} tidak seperti yang mereka katakana, tetapi bagi mereka itu dosa dan kesalahan {Siapa saja yang menepati janji} tetapi siapa saja yang menepati janji Allah yang telah dijanjikan dalm Taurat berupa keimanan kepada nabi Muhammad SAW, Al-Qur’an dan menunaikan amanat {dan bertakwa, sesungguhnya Allah mencintai orang-orang yang bertakwa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "76. Kemudian Allah berfirman, “Bukan demikian” artinya, tidaklah perkara itu seperti yang mereka katakan. “Sebenarnya siapa yang menepati janji (yang dibuat) nya dan bertakwa,” yaitu yang menunaikan hak-hak Allah dan hak-hak makhlukNya, maka orang seperti inilah yang bertakwa, dimana Allah mencintainya. Artinya barangsiapa yang bertentangan dengan hal itu yakni tidak memenuhi janjinya antara ia dengan sesamanya dan tidak pula menunaikan ketakwaan kepada Allah, maka sesungguhnya Allah akan memurkai dan akan membalasnya atas perbuatannya itu dengan siksaan yang berat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 76: Bahkan! Barangsiapa menyempurnakan janjinya dan berbakti, maka sesungguhnya Allah kasih orang-orang yang berbakti."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni anggapan tidak ada dosa bagi kalian mengambil harta orang-orang ummi adalah salah, bahkan kalian mendapatkan dosa yang besar karena anggapan dan perbuatan itu. Yakni janji yang telah dibuat seseorang baik terhadap Allah maupun sesama manusia, seperti menunaikan amanah dsb. Maksud bertakwa di sini adalah menjauhi maksiat yang terjadi antara dirinya dengan Allah maupun antara dirinya dengan orang lain."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 76",
    "description": "Padahal, yang benar adalah bahwa mereka tetap berdosa karena khianat. Sebab, sebenarnya barangsiapa menepati janji dengan mengembalikan hak orang lain sesuai dengan waktu yang telah ditentukan dan bertakwa, maka sungguh dengan takwa itu ia akan memperoleh cinta Allah, karena Allah senantiasa mencintai orang-orang yang bertakwa. Ini menunjukkan bahwa menepati janji atau tidak khianat menjadi salah satu kriteria ketakwaan. Ayat ini mengancam kepada siapa saja yang berkhianat, dan menukarnya dengan hal-hal yang bersifat duniawi yang tidak ada nilainya di hadapan Allah. Sesungguhnya orang-orang yang memperjualbelikan atau menukar janji yang dikuatkan dengan nama Allah untuk ditepati, dan sumpah-sumpah mereka dengan hal-hal yang bersifat duniawi; itu sama saja mereka menukarnya dengan harga murah atau nilai yang rendah dibanding balasan yang kelak diterimanya di akhirat jika mereka jujur, mereka justru tidak memperoleh bagian sama sekali di akhirat. Bukan itu saja, Allah juga tidak akan menyapa mereka, tidak akan memperhatikan mereka dengan pandangan rahmat pada hari kiamat, dan tidak akan menyucikan atau mengampuni dosa-dosa mereka. Bagi mereka azab yang pedih di neraka, dan mereka kekal di dalamnya."
  }
]