[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang yang menukar janji Allah dan wasiat Nya yang sudah ia sampaikan hal itu di dalam kitab-kitab yang Dia turunkan kepada nabi-nabi mereka, dengan pengganti dan imbalan sepele dari harta duniawi dan kenikmatannya ,mereka itu adalah orang orang yang tidak memiliki bagian dari pahala di akhirat. Dan Allah juga tidak akan berbicara dengan mereka dengan hal-hal yang menyenangkan mereka, dan Dia tidak akan melihat kepada mereka pada hari kiamat dengan pandangan kasih sayang, serta tidak akan membersihkan mereka dari kotoran dosa-dosa dan kekafiran.Dan bagi mereka siksaan yang pedih."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "77. Sesungguhnya orang-orang yang menukar wasiat Allah kepada mereka agar mereka mengikuti apa yang Dia turunkan di dalam kitab suci-Nya dan dibawa oleh para Rasul-Nya, serta melaksanakan sumpah mereka untuk menepati janji mereka kepada Allah, (ditukar) dengan sedikit kesenangan dunia, mereka itu tidak akan mendapatkan bagian dari ganjaran akhirat. Allah tidak akan berbicara kepada mereka dengan sesuatu yang menyenangkan hati mereka. Allah juga tidak akan memandangnya dengan pandangan kasih sayang di hari kiamat. Dan mereka akan mendapatkan azab yang sangat pedih."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "77. orang-orang yang menukar janji dan perintah yang Allah berikan kepada mereka dengan kenikmatan dunia yang sedikit maka mereka tidak mendapat bagian kenikmatan di akhirat, tidak difirmankan kepada mereka sesuatu yang menyenangkan mereka, tidak dipandang Allah dengan pandangan rahmat, tidak disucikan dari dosa-dosa, dan mereka akan mendapat azab yang pedih."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "77. إِنَّ الَّذِينَ يَشْتَرُونَ بِعَهْدِ اللهِ وَأَيْمٰنِهِمْ ثَمَنًا قَلِيلًا ( Sesungguhnya orang-orang yang menukar janji (nya dengan) Allah dan sumpah-sumpah mereka dengan harga yang sedikit) Mereka adalah orang-orang Yahudi dan semisalnya, apabila memakan harta dan hak-hak orang lain mereka mengingkari hal itu, dan apabila mereka diminta untuk bersumpah atas kebenaran keingkaran mereka, mereka pun berani bersumpah. أُو۟لٰٓئِكَ (mereka itu ) Yakni mereka yang memiliki sifat tersebut. لَا خَلٰقَ لَهُمْ فِى الْاٰخِرَةِ(tidak mendapat bahagian di akhirat ) Yakni tidak memiliki bagian pahala di akhirat. وَلَا يُكَلِّمُهُمُ اللهُ ( dan Allah tidak akan berkata-kata dengan mereka) Sepatah kata pun. Atau Allah tidak berkata-kata dengan apa yang menyenangkan mereka. وَلَا يَنظُرُ إِلَيْهِمْ يَوْمَ الْقِيٰمَةِ (mereka dan tidak akan melihat kepada mereka pada hari kiamat) Yakni dengan penglihatan kasih sayang, akan tetapi murka kepada mereka dan mengazab mereka sebab dosa-dosa mereka. Dikeluarkan Imam Bukhari dari Ibnu Mas’ud ia berkata: Rasulullah bersabda: barangsiapa yang bersumpah dengan nama Allah sedangkan ia bermaksud untuk mengambil harta dari hak seorang muslim maka ia akan bertemu dengan Allah sedangkan Allah murka kepadanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "77 Sesungguhnya orang-orang yang menukar janjinya dengan janji Allah: yaitu untuk beriman dan menyampaikan amanah yang diturunkan-Nya dalam kitab-Nya dan sumpah-sumpah dusta mereka, yang mereka tukar dengan dunia, atau suap. Sesungguhnya itu semua hakikatnya adalah sedikit meskipun terlihat banyak, sebab tidak ada keberkahan di dalamnya. Mereka itu tidak mendapat bagian pahala di akhirat, dan Allah tidak akan berkata-kata dengan mereka dengan perkataan yang penuh kasih sayang, namun Allah murka kepada mereka, dan tidak akan melihat kepada mereka pada hari kiamat dengan pandangan rahmat dan tidak pula akan mensucikan mereka dari dosa. Bagi mereka azab yang pedih. Diriwayatkan dari Bukhari Muslim dan lainnya bahwa Al Asy’at berkata: Antara aku dan seorang yahudi ada sebidang tanah, namun dia mengelak, sehingga aku laporkan kepada Nabi. Kemudian Nabi berkata: apakah engkau punya bukti? Aku menjawab: tidak. Kemudian Yahudi itu ditanya: Bersumpahlah. Kemudian aku berkata: Wahai Rasul, setelah dia bersumpah, maka hartaku hilang. Kemudian Allah menurunkan ayat ini."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang yang memperjual belikan} menukarkan {janji Allah} perintah Allah kepada mereka berupa iman kepada Rasulallah SAW dan menepati janji {dan sumpah-sumpah mereka} dan sumpah-sumpah mereka untuk berdusta {dengan harga murah, mereka itu tidak memperoleh bagian} bagian {di akhirat, Allah tidak akan menyapa mereka, tidak akan memperhatikan mereka pada hari Kiamat, dan tidak akan menyucikan mereka.} tidak memberi mereka keindahan dan tidak menyucikan mereka dari dosa {Bagi mereka azab yang pedih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "77. Maksudnya, sesungguhnya orang-orang yang menukar Agama dengan dunia lalu mereka lebih memilih kenikmatan yang sedikit dari dunia dan mereka memakai cara dalam mendapatkannya dengan sumpah-sumpah dan janji-janji palsu yang tidak mereka penuhi, maka mereka itu adalah orang-orang yang “Allah tidak akan berbicara kepada mereka dan tidak akan melihat kepada mereka pada Hari Kiamat dan tidak (pula) akan menyucikan mereka, serta bagi mereka azab yang pedih.” Artinya, mereka telah berhak mendapatkan murka Allah dan menjalani siksa dariNya, jauh dari pahalaNya, terhalang dari penyucian yaitu pembersihan diri, bahkan mereka pada Hari Kiamat kelak akan bangkit dengan bergelimang kejahatan dan dikotori oleh dosa-dosa besar."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 77: Sesungguhnya mereka yang membeli (mendapat) benda yang sedikit dengan (menggunakan) perjanjian (atas nama) Allah dan (dengan) sumpah-sumpah mereka itu, ialah orang-orang yang tidak ada bagi mereka bagian (baik) di Akhirat, dan Allah tidak akan mengajak bicara kepada mereka, dan tidak akan melihat kepada mereka, pada hari Kiamat, dan tidak akan membersihkan mereks; dan adalah bagi mereka adzab yang pedih."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini turun berkenaan dengan orang-orang Yahudi ketika mereka merubah sifat Nabi Muhammad shallallahu 'alaihi wa sallam dan pesan Allah kepada mereka dalam Taurat. Demikian juga berkenaan dengan orang-orang yang bersumpah dusta baik dalam berdakwa maupun dalam menjual barang dagangan. Imam Bukhari meriwayatkan dari Abdullah, bahwa Nabi shallallahu 'alaihi wa sallam bersabda, « مَنْ حَلَفَ عَلَى يَمِينٍ يَقْتَطِعُ بِهَا مَالَ امْرِئٍ ، هُوَ عَلَيْهَا فَاجِرٌ ، لَقِىَ اللَّهَ وَهْوَ عَلَيْهِ غَضْبَانُ \"Barang siapa bersumpah untuk mengambil harta seseorang, padahal sumpahnya dusta, maka ia akan menghadap kepada Allah dalam keadaan Allah murka kepadanya.\" Maka Allah menurunkan ayat, \"Innalladziina yasytaruuna bi'ahdillah…dst.\" Imam Bukhari juga meriwayatkan dari Abdullah bin Abi Aufa radhiyallahu 'anhu bahwa ada seorang yang menjajakkan barang dagangan di pasar, ia bersumpah bahwa barang dagangannya telah dihargai sekian namun ia menolak untuk, dengan maksud agar dibeli oleh seseorang dari kaum muslimin, maka turunlah ayat, \"Innalladziina yasytaruuna bi'ahdillah…dst. Termasuk ke dalamnya orang yang mengambil upah terhadap hak Allah yang ditinggalkannya maupun hak manusia yang tidak dipenuhinya. Demikian juga orang yang bersumpah untuk mengambil harta orang yang terpelihara hartanya. Karena murka dan marah kepada mereka yang mendahulukan hawa nafsu daripada keridhaan Tuhannya. Baik pedih bagi hati maupun badan, yaitu mendapatkan kemurkaan Allah dan dihijab (ditutupi) dari-Nya serta mendapat azab neraka jahannam, nas'alullahal 'aafiyah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 77",
    "description": "Ayat ini mengancam kepada siapa saja yang berkhianat, dan menukarnya dengan hal-hal yang bersifat duniawi yang tidak ada nilainya di hadapan Allah. Sesungguhnya orang-orang yang memperjualbelikan atau menukar janji yang dikuatkan dengan nama Allah untuk ditepati, dan sumpah-sumpah mereka dengan hal-hal yang bersifat duniawi; itu sama saja mereka menukarnya dengan harga murah atau nilai yang rendah dibanding balasan yang kelak diterimanya di akhirat jika mereka jujur, mereka justru tidak memperoleh bagian sama sekali di akhirat. Bukan itu saja, Allah juga tidak akan menyapa mereka, tidak akan memperhatikan mereka dengan pandangan rahmat pada hari kiamat, dan tidak akan menyucikan atau mengampuni dosa-dosa mereka. Bagi mereka azab yang pedih di neraka, dan mereka kekal di dalamnya ayat ini bahkan secara khusus menerangkan perilaku buruk kaum yahudi, terutama tokoh-tokohnya. Sungguh, di antara mereka ada segolongan, di antaranya ada tokoh-tokoh agama, yang memutarbalikkan lidahnya membaca kitab taurat, yakni dengan cara menyembunyikan informasi yang benar, mengubah maksud yang sebenarnya, atau menggantinya dengan redaksi lain lalu membacanya layaknya mereka membaca taurat, agar kalian menyangka yang mereka baca itu benarbenar sebagian dari kitab taurat, padahal itu bukan dari kitab taurat, tetapi rekayasa semata. Dan untuk menguatkan kebohongannya mereka berkata, itu dari Allah, padahal itu bukan dari Allah. Mereka benarbenar tidak punya rasa malu bahkan berani mengatakan hal yang dusta terhadap Allah, padahal mereka mengetahui secara pasti kalau hal itu dusta. Ayat ini juga menjadi bukti adanya tahrif (perubahan) dalam kitab taurat."
  }
]