[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan diantara kaum yahudi benar-benar terdapat banyak orang-orang yang mengubah-ubah perkataan dari tempat semestinya, dan mereka mengganti kalamullah; supaya mereka dapat mengesankan kepada orang lain bahwa itu termasuk wahyu yang diturunkan, yaitu taurat padahal itu semua bukan bagian darinya sama sekali. Dan mereka mengatakan,”ini berasal dari sisi Allah, Aallah mewahyukannya kepada nabiNYA musa ,” padahal itu bukan dari Allah. Dan mereka demi meraih dunia,mereka berkata dusta atas nama Allah, sedang mereka mengetahui bahwa mereka itu berkata dusta."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "78. Sesungguhnya di antara orang-orang Yahudi itu ada golongan yang suka membelokkan lidah mereka ketika membaca kitab Taurat yang diturunkan dari sisi, supaya kalian mengira bahwa mereka sedang membaca Taurat, padahal yang mereka baca itu bukan dari Taurat, melainkan dari kebohongan yang mereka buat atas nama Allah. Dan mereka mengatakan, “Apa yang kami baca ini diturunkan dari sisi Allah.” Padahal sebenarnya bukan berasal dari sisi Allah. Mereka berdusta atas nama Allah. Padahal mereka mengetahui bahwa mereka berdusta atas nama Allah dan Rasul-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "78. Allah memperingatkan dari orang-orang Yahudi yang mengubah kitab Taurat, mereka mengucapkan sesuatu yang bukan dari bagian Taurat agar dapat menipu orang lain dan mengatakan itu adalah bagian dari firman Allah, padahal itu bukan dari Allah. Mereka membuat kedustaan terhadap Allah, dan mereka sadar mereka adalah orang-orang yang berdusta."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "78. يَلْوُۥنَ أَلْسِنَتَهُم بِالْكِتٰبِ ( yang memutar-mutar lidahnya) Yakni apa yang mereka tambahkan dan mereka ubah dalam kitab Allah, lalu mereka membacanya dengan tartil seakan-akan itu adalah bagian dari kitab Allah. لِتَحْسَبُوهُ ( supaya kamu menyangka yang dibacanya itu) Yakni agar kalian mengira bahwa itu merupakan bagian dari apa yang diturunkan Allah padahal tidak demikian. وَيَقُولُونَ عَلَى اللهِ الْكَذِبَ وَهُمْ يَعْلَمُونَ ( Mereka berkata dusta terhadap Allah sedang mereka mengetahui) Dan ini temasuk dosa yang paling besar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "78 Sesungguhnya diantara mereka ada segolongan yang memutar-mutar lidahnya, dan merubah Taurat, dan mengganti sebagaimana apa yang mereka kehendaki, supaya kamu menyangka yang dibacanya itu sebagian dari Taurat, padahal ia bukan dari Taurat yang diturunkan Allah dan mereka mengatakan perkataan yang mereka ubah: “Perkataan yang dibaca itu datang dari sisi Allah”, padahal ia bukan dari sisi Allah, itu hanyalah dusta. Mereka berkata dusta terhadap Allah sedang mereka mengetahui bahwa sebenarnya mereka sedang berdusta. Itu adalah dosa yang sangat besar. Ibnu Abbas berkata tentang orang-orang yang membuat fitnah itu: Mereka orang-orang Yahudi adalah orang-orang yang berkata kepada Ka’ab bin Asyraf, mereka telah merubah Taurat, dan mengganti bagian yang menjelaskan sifat-sifat Nabi Muhammad kemudian diambil oleh Bani Quraidhoh dan menulisnya. Kemudian mereka mencampuraduknya dengan kitab mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya di antara mereka ada segolongan} sesungguhnya di antara orang-orang Yahudi ada satu golongan {yang memutar-mutar} memiringkan {lidahnya terhadap Al-kitab agar kamu menyangka itu} sehingga kalian menyangka hal itu {sebagian dari Al-kitab. Padahal itu bukan dari Al-kitab. Mereka berkata,“Itu dari Allah.” Padahal itu bukan dari Allah. Mereka mengatakan hal yang dusta terhadap Allah, sedangkan mereka mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "78. Maksudnya, diantara Ahli Kitab ada suatu kelompok yang merubah isi Kitabullah, “yang memutar-mutar lidahnya membaca al-Kitab, supaya kamu menyangka yang dibacanya itu sebagian dari al-Kitab.” Ini adalah pemutarbalikan lafazh dan maknanya. Kemudian disamping penyimpangan yang sangat keji itu, mereka membuat hal itu seolah-olah dari al-KItab, padahal mereka adalah orang-orang yang berdusta dalam hal tersebut, mereka menampakkan kedustaan terhadap Allah, padahal mereka mengetahui keadaan mereka dan buruknya akibatnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 78: Dan sesungguhnya di antara mereka, ada segolongan yang memutar lidah pada Kitab (mereka), supaya kamu menyangka dia sebagian daripada kitab (mereka) padahal bukan daripada kitab itu ; dan berkata bahwa kitab ini (adalah) dari sisi Allah. dan mereka berdusta atas (nama) Allah padahal mereka tahu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Merubah lafaz maupun maknanya seperti mengalihkan dari maksudnya. Mereka menghilangkan makna yang hak dan menetapkannya dengan makna yang batil, serta membawa lafaz yang menunjukkan yang hak kepada makna yang rusak padahal mereka mengetahuinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 78",
    "description": "Ayat ini bahkan secara khusus menerangkan perilaku buruk kaum yahudi, terutama tokoh-tokohnya. Sungguh, di antara mereka ada segolongan, di antaranya ada tokoh-tokoh agama, yang memutarbalikkan lidahnya membaca kitab taurat, yakni dengan cara menyembunyikan informasi yang benar, mengubah maksud yang sebenarnya, atau menggantinya dengan redaksi lain lalu membacanya layaknya mereka membaca taurat, agar kalian menyangka yang mereka baca itu benarbenar sebagian dari kitab taurat, padahal itu bukan dari kitab taurat, tetapi rekayasa semata. Dan untuk menguatkan kebohongannya mereka berkata, itu dari Allah, padahal itu bukan dari Allah. Mereka benarbenar tidak punya rasa malu bahkan berani mengatakan hal yang dusta terhadap Allah, padahal mereka mengetahui secara pasti kalau hal itu dusta. Ayat ini juga menjadi bukti adanya tahrif (perubahan) dalam kitab taurat. Setelah ayat sebelumnya menjelaskan tentang upaya tahraf (perubahan) ahli kitab terhadap kitab suci mereka, ayat ini kembali menginformasikan keburukan mereka, yakni dengan cara menuduh bahwa rasul menginginkan agar disembah oleh para pengikutnya. Tidak mungkin bagi seseorang yakni seorang rasul yang telah diberi kitab oleh Allah, serta hikmah, yaitu pemahaman terhadap agama serta pengetahuan tentang rahasia-rahasia syariat, dan kenabian, kemudian dia berkata kepada manusia, jadilah kamu penyembahku, bukan penyembah Allah. Tuduhan syirik ini jelas tidak benar dan tidak mungkin dilakukan oleh seorang rasul. Tetapi, yang benar, rasul itu berkata, jadilah kamu pengabdi-pengabdi Allah yang istikamah. Demikian ini, karena kamu mengajarkan kitab dan karena kamu mempelajarinya, sehingga kamu bisa menunjukkan sikap ketaatan yang sempurna dan menjauhi sikap syirik!"
  }
]