[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidak selayaknya bagi seorang dari kalangan manusia yang Allah menurunkan kitabNYA pada orang tersebut dan menjadiknnya sebagai sumber hukum di tengah makhlukNYA serta memilihnya sebagai nabi, kemudian dia berkata kepada sekalian manusia, ”sembahlah aku selain Allah,” akan tetapi dia mesti mengatakan, ”jadilah kalian orang-orang yang bijaksana, ahli fikih lagi orang yang berilmu melalui apa yang kalian ajarkan kepada orang selain kalian dari wahyu Allah, dan apa yang kalian pelajari darinya dalam bentuk hapalan, pengetahuan ,dan pemahaman,”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "79. Tidak sepatutnya bagi seorang manusia biasa yang Allah beri kitab suci yang diturunkan dari sisi-Nya dan diberi-Nya pengetahuan dan pemahaman, serta dipilih-Nya menjadi seorang Nabi, kemudian dia berkata kepada manusia, “Jadilah kalian penyembah-penyambahku, bukan penyembah Allah.” Tetapi dia harus mengatakan, “Jadilah kalian ulama-ulama yang mengamalkan ilmunya dengan cara mengajarkannya kepada orang lain dan mempelajarinya dengan cara menghafalnya dan memahaminya.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "79-80. Allah membantah para pendeta Yahudi dan Nasrani yang diseur oleh Rasulullah, namun mereka menjawabnya dengan tipudaya dan keangkuhan: “Apa kamu ingin agar kami menyembahmu?” Maka Allah membantah mereka: “Tidak berhak bagi manusia yang diturunkan kepadanya kitab Allah, diberikan kekuasaan, dan dijadikan nabi untuk memerintahkan manusia lain untuk menyembah dirinya; namun hendaklah ia memerintahkan orang lain untuk menjadi orang yang bijaksana, berilmu, dan mengamalkan apa yang diturunkan kepadanya dan apa yang ia pelajari. Ia juga tidak berhak memerintahkan untuk menjadikan para malaikat dan para rasul sebagai tuhan selain Allah. Apakah masuk akal ia memerintahkan kalian untuk mengingkari Allah setelah kalian telah tunduk kepada-Nya?” Ibnu ‘Asyur berkata: “firman Allah {ما كان لبشر} merupakan kalimat pengingkaran hak seseorang mengucapkan kalimat tersebut, dan huruf lam untuk istihqaq.” (at-Tahrir wa at-Tanwir)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "79. مَا كَانَ لِبَشَرٍ ( Tidak wajar bagi seseorang manusia) Yakni ini tidak layak dan bukan sesuatu yang benar, karena para Nabi dipilih oleh Allah dan dikhususkan dengan wahyu, dan memiliki pemahaman yang benar dan keikhlasan kepada Allah; maka tidak akan keluar dari seorang Nabi seruan kepada manusia menuju kekufuran dengan memerintahkan agar menyembah dirinya sebagai tandingan Allah. Hal ini menyelisihi tabiat segala sesuatu. Ayat ini turun untuk orang-orang Nasrani yang menuduh atas Nabi Isa apa yang tidak benar adanya, dan apa yang tidak layak untuk diucapkannya atau diucapakan saudara-saudaranya dari kalangan para Nabi. وَلٰكِن (Akan tetapi ) Yakni akan tetapi yang dikatakan Nabi كُونُوا۟ رَبّٰنِيِّۦنَ ( Hendaklah kamu menjadi orang-orang rabbani) Makna (الرباني) adalah orang yang mengetahui agama Tuhan, yang memiliki keteguhan dalam perpegang dengan ketaatan Allah, serta memiliki pemahaman, kelembutan, dan hikmah. بِمَا كُنتُمْ تُعَلِّمُونَ الْكِتٰبَ وَبِمَا كُنتُمْ تَدْرُسُونَ ( karena kamu selalu mengajarkan Al Kitab dan disebabkan kamu tetap mempelajarinya) Yakni Nabi berkata: dengan ilmu kalian itu jadilah orang yang berpegang teguh dengan ketaatan kepada Tuhan, karena kalian mempelajari kitab-kitab-Nya dan mengajarkannya kepada manusia, dan memerintahkan mereka untuk berpegang teguh dengannya. Dan orang yang mengajarkan kebenaran dan kebaikan kepada orang lain wajib baginya untuk berpegang teguh dengannya lebih kuat dari yang lain."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Ayat ini mengajarkan bahwa diraihnya ilmu dan berlangsungnya ta'lim dan pengajaran mengharuskan setiap orang menjadi \"insan robbani\", maka barangsiapa yang menyibukkan dirinya dengan hal itu tetapi tidak dengan maksud untuk meraih gelar itu maka segala usaha dan upaya yang ia keluarkan akan sia-sia, dan akan berakhir dengan kerugian dan celaka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "79 Tidak wajar bagi seorang manusia Allah berikan kitab kepadanya, dan mengajarkan hikmah berupa syariat dan ilmu yang bermanfaat dan menganugerahkan kenabian dan risalah, lalu dia menyuruh kepada manusia untuk menyembahnya selain dari Allah. Namun Nabi berkata kepada pengikutnya : “Hendaklah kamu menjadi orang-orang yang berilmu dan faham dengan mengamalkan perintah Allah, taat kepada Allah dengan maksimal, karena kamu selalu mengajarkan kitab Allah kepada manusia dan disebabkan kamu tetap mempelajari syariat berupa hukum-hukum dan nasihat. Ayat ini turun untuk orang-orang Nasrani, yang membuat fitnah atas Isa, dan tidak layak bagi mereka untuk mengatakan itu, dan tidak ada seorang pun dari temannya yang dianugerahi kenabian"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidak sepatutnya} tidak selayaknya {seseorang yang diberi Al-kitab, hukum} pemahaman dan ilmu {dan kenabian oleh Allah, kemudian dia berkata kepada manusia, “Jadilah kalian para hamba-hambaku, bukan Allah,” tetapi hendaknya, “Jadilah kalian para pengabdi} orang-orang yang mengerti lagi beramal {sesuai apa kalian ajarkan pada kitab dan mempelajarinya”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "79-80. Maksudnya, tidak akan terjadi dan bahkan sangat mustahil sekali bagi seorang manusia yang telah dikaruniakan wahyu oleh Allah, al-Kitab dan Kenabian dan memberikan kepadanya hukum-hukum syariat, untuk menyuruh manusia untuk beribadah kepada dirinya dan kepada para Nabi dan malaikat serta menjadikan mereka sebagai tuhan-tuhan lain. Karena semua itu adalah kekufuran, bagaimana mungkin, padahal ia telah diutus dengan Islam yang memberantas kekufuran dengan segala bentuknya, lalu bagaimana ia menyeru kepada hal yang berlawanan dengan itu. Ini adalah diantara perkara yang tidak mungkin terjadi, dan apa yang dibawa olehnya dan semua yang telah Allah karuniakan ubudiyah yang total dan ketundukan yang sempurna kepada Allah yang Esa lagi Mahaperkasa. Ini merupakan jawaban atas delegasi Nasrani negeri Najran ketika mereka bersikeras dengan keterpedayaaan mereka hingga keadaan mereka semakin jauh, dan mereka berkata dengan kesombongannya,” Apakah engkau menyeru kami wahai MUhammd untuk menyembahmu? Ketika beliau memerintahkan mrereka untuk beribadah hanya kepada Allah dan taat kepadaNya. Lalu Allah menjelaskan tentang kesalahan perkataan mereka dan bahwasanya perkataan mereka dan perkataan selain mereka yang seperti itu sangat batil."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 79: Tidak bisa jadi, seorang manusia yang Allah beri kepadanya Kitab (agama) dan hukum dan kenabian, kemudian ia berkata kepada manusia: \"Jadilah hamba-hambaku, bukan (hamba-hamba) Allah,\" tetapi (ia berkata): \"Jadilah orang-orang yang bersandar kepada Tuhan (semata-mata) dengan sebab kamu mengajarkan Kitab (agama) dan dengan sebab kamumembacanya.\""
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini turun ketika orang-orang Nasrani Najran mengatakan bahwa Nabi Isa memerintahkan mereka untuk menjadikan Beliau sebagai tuhan dan ketika sebagian kaum muslimin meminta kepada Nabi Muhammad shallallahu 'alaihi wa sallam agar diizinkan sujud kepada Beliau. Ada pula yang mengatakan, bahwa ayat ini turun sebagai bantahan kepada orang-orang Ahli Kitab yang berkata kepada Nabi shallallahu 'alaihi wa sallam saat Beliau memerintahkan mereka beriman kepadanya dan mengajak mereka untuk mentaatinya, \"Apakah kamu wahai Muhammad menginginkan agar kami menyembahmu?\" Yakni kepahaman terhadap syari'at. Rabbani ialah orang yang sempurna ilmu dan takwanya kepada Allah Subhaanahu wa Ta'aala. Ada pula yang mengartikan sebagai ulama, hukama' (orang-orang bijak), dan hulama' (orang-orang yang sabar) yang mengajarkan kebaikan kepada manusia dari mulai ilmu yang kecil hingga besar sambil mengamalkannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 79",
    "description": "Setelah ayat sebelumnya menjelaskan tentang upaya tahraf (perubahan) ahli kitab terhadap kitab suci mereka, ayat ini kembali menginformasikan keburukan mereka, yakni dengan cara menuduh bahwa rasul menginginkan agar disembah oleh para pengikutnya. Tidak mungkin bagi seseorang yakni seorang rasul yang telah diberi kitab oleh Allah, serta hikmah, yaitu pemahaman terhadap agama serta pengetahuan tentang rahasia-rahasia syariat, dan kenabian, kemudian dia berkata kepada manusia, jadilah kamu penyembahku, bukan penyembah Allah. Tuduhan syirik ini jelas tidak benar dan tidak mungkin dilakukan oleh seorang rasul. Tetapi, yang benar, rasul itu berkata, jadilah kamu pengabdi-pengabdi Allah yang istikamah. Demikian ini, karena kamu mengajarkan kitab dan karena kamu mempelajarinya, sehingga kamu bisa menunjukkan sikap ketaatan yang sempurna dan menjauhi sikap syirik! begitu juga, tidak mungkin bagi seorang rasul menyuruh kalian menjadikan para malaikat dan para nabi sebagai tuhan. Apakah patut dia menyuruh kamu menjadi kafir setelah kamu menjadi muslim, pemeluk islam yang inti ajarannya adalah tauhid' ini menunjukkan sifat utama para rasul'juga mereka yang melanjutkan dakwah para rasul'yaitu al-amin, atau bisa dipercaya dalam segala hal, terutama dalam melaksanakan tugas dakwah."
  }
]