[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan tidak sepantasnya bagi salah sorang dari mereka memerintahkan kalian untuk menjadikan malaikat dan nabi-nabi sebagai tuhan-tuhan tandingan yang kalian sembah selain Allah. Apakah masuk di akal (wahai sekalian manusia),dia memerintahkan kalian untuk kafir kepada Allah setelah kalian tunduk patuh kepada perintahNYA?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "80. Dan juga tidak sepatutnya dia memerintahkan kepada kalian untuk menjadikan para Malaikat dan para Nabi sebagai tuhan-tuhan yang kalian sembah selain Allah. Bolehkah dia memerintahkan kepada kalian untuk ingkar kepada Allah setelah kalian tunduk dan berserah diri kepada-Nya?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "80. وَلَا يَأْمُرَكُمْ أَن تَتَّخِذُوا۟ الْمَلٰٓئِكَةَ وَالنَّبِيِّۦنَ أَرْبَابًا ۗ ( dan (tidak wajar pula baginya) menyuruhmu menjadikan malaikat dan para nabi sebagai tuhan) Yakni tidak ada hak bagi seorang nabi baik itu Isa atau yang lain untuk menyembah dirinya setelah diberi Allah ilmu dan petunjuk, tidak pula untuk menjadikan malaikat dan para nabi sebagai Tuhan-Tuhan yang disembah selain Allah; akan tetapi para Nabi adalah yang melarang itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "80 Dan tidak wajar pula bagi nabi untuk menyuruhmu menjadikan malaikat dan para nabi sebagai tuhan selain Allah, namun seharusnya dia melarangmu. Apakah masuk akal jika dia menyuruhmu berbuat kekafiran di waktu kamu sudah menganut agama Islam dan berpegang teguh kepada ajaran Allah?”."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidak (sepatutnya) dia menyuruh kalian} tidaklah pantas baginya untuk memerintahkan kalian {menjadikan para malaikat dan para nabi sebagai tuhan. Apakah dia menyuruh kalian berbuat ingkar setelah kalian menjadi muslim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "79-80. Maksudnya, tidak akan terjadi dan bahkan sangat mustahil sekali bagi seorang manusia yang telah dikaruniakan wahyu oleh Allah, al-Kitab dan Kenabian dan memberikan kepadanya hukum-hukum syariat, untuk menyuruh manusia untuk beribadah kepada dirinya dan kepada para Nabi dan malaikat serta menjadikan mereka sebagai tuhan-tuhan lain. Karena semua itu adalah kekufuran, bagaimana mungkin, padahal ia telah diutus dengan Islam yang memberantas kekufuran dengan segala bentuknya, lalu bagaimana ia menyeru kepada hal yang berlawanan dengan itu. Ini adalah diantara perkara yang tidak mungkin terjadi, dan apa yang dibawa olehnya dan semua yang telah Allah karuniakan ubudiyah yang total dan ketundukan yang sempurna kepada Allah yang Esa lagi Mahaperkasa. Ini merupakan jawaban atas delegasi Nasrani negeri Najran ketika mereka bersikeras dengan keterpedayaaan mereka hingga keadaan mereka semakin jauh, dan mereka berkata dengan kesombongannya,” Apakah engkau menyeru kami wahai MUhammd untuk menyembahmu? Ketika beliau memerintahkan mrereka untuk beribadah hanya kepada Allah dan taat kepadaNya. Lalu Allah menjelaskan tentang kesalahan perkataan mereka dan bahwasanya perkataan mereka dan perkataan selain mereka yang seperti itu sangat batil."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 80: Dan tidak ia menyuruh kamu menganggap malaikat-malaikat dan nabi-nabi sebagai Tuhan-tuhan. Apakah (bisa jadi) ia menyuruh kamu kufur sesudah kamu (jadi) Muslimin."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sebagaimana orang-orang shabi'in menjadikan malaikat sebagai tuhan, orang-orang Yahudi menjadikan Uzair sebagai tuhan dan orang-orang Nasrani menjadikan Isa sebagai tuhan. Yakni tidak patut bagi seorang nabi menyuruh demikian."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 80",
    "description": "Begitu juga, tidak mungkin bagi seorang rasul menyuruh kalian menjadikan para malaikat dan para nabi sebagai tuhan. Apakah patut dia menyuruh kamu menjadi kafir setelah kamu menjadi muslim, pemeluk islam yang inti ajarannya adalah tauhid' ini menunjukkan sifat utama para rasul'juga mereka yang melanjutkan dakwah para rasul'yaitu al-amin, atau bisa dipercaya dalam segala hal, terutama dalam melaksanakan tugas dakwah. Setelah ayat sebelumnya menginformasikan tuduhan-tuduhan tidak benar yang ditujukan kepada para nabi dan rasul, maka ayat ini menegaskan bahwa para nabi dan rasul itu telah diambil sumpah janjinya oleh Allah untuk membenarkan Muhammad sebagai nabi dan rasul terakhir. Ingatlah ketika Allah mengambil perjanjian dari para nabi dan rasul, manakala aku memberikan kitab dan hikmah yaitu ilmu yang bermanfaat dan kemampuan untuk mengamalkannya, kepada kamu, lalu datang kepada kamu seorang rasul, yakni nabi Muhammad, yang membenarkan apa yang ada pada kamu berupa ajaran tauhid yang tercantum dalam kitab-kitab mereka, niscaya kamu akan sungguh-sungguh beriman kepadanya dan menolong agama-Nya. Allah berfirman, apakah kamu setuju dan menerima perjanjian dengan-ku atas yang demikian itu, yakni membenarkan Muhammad sebagai nabi dan rasul terakhir' mereka menjawab, kami setuju. Allah berfirman, kalau begitu bersaksilah kamu, wahai para nabi, dan aku menjadi saksi bersama kamu bahwa nabi Muhammad adalah rasul dan nabi terakhir. Ayat ini juga menjadi bukti bahwa manusia itu cenderung lalai terhadap aturan ilahi, sehingga perlu diturunkan nabi dan rasul secara berkesinambungan yang berakhir pada nabi Muhammad, saat ini dilanjutkan oleh para pewaris beliau, yaitu para ulama."
  }
]