[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ingatlah (wahai rasul), ketika Allah mengambil perjanjian tegas dari seluruh nabi, ”sungguh jika Aku membawakan kepada kalian dari kitab dan hikmah, dan kemudian datang kepada kalian rasul dari sisi Ku, yang membenarkan apa yang kalian miliki, maka kalian harus sunguh-sungguh beriman kepadanya dan membelanya. Lalu apakah kalian menyetujui dan mengakui hal itu serta menerima perjanjian tegas itu?”. Mereka menjawab “kami mengakui hal itu”. Allah berfirman, “maka bersaksilah sebagian dari kalian dihadapan sebagian yang lain, dan persaksikanlah hal itu di hadapan umat-umat kalian, dan Aku bersama kalian termasuk diantara mereka yang bersaksi atas kalian dan atas mereka,”. Dalam ayat ini,sesungguhnya Allah telah mengambil perjanjian dari setiap nabi, untuk beriman kepada Muhammad dan mengambil janji-janji dari umat-umat para nabi itu dengan hal itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "81. Dan ingatlah -wahai Rasul- ketika Allah mengambil janji yang kokoh dari para Nabi seraya berfirman kepada mereka, “Sungguh jika Aku memberi kalian kitab suci yang Aku turunkan kepada kalian dan hikmah yang Aku ajarkan kepada kalian, dan salah satu di antara kalian mencapai tempat dan kedudukan tertentu, kemudian datang kepada kalian seorang Rasul dari sisi-Ku yang membenarkan kitab suci dan hikmah yang ada pada kalian, maka kalian benar-benar akan beriman kepada ajaran yang dibawanya, dan kalian benar-benar akan menolongnya dengan menjadi pengikutnya. Apakah kalian -wahai para Nabi- mengakui hal itu dan mengambil janji-Ku yang sangat kokoh terkait hal tersebut?” Mereka menjawab, “Kami mengakuinya.” Maka Allah berfirman, “Bersaksilah terhadap diri kalian sendiri dan umat-umat kalian. Dan Aku bersama kalian termasuk orang yang bersaksi atas diri kalian dan diri mereka.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "81. Allah mengingatkan nabi Muhammad kisah ketika Dia mengambil perjanjian tegas dari para nabi ahli kitab: “Bersumpahlah, jika Aku memberi kalian kitab dan hikmah kemudian datang kepada kalian seorang rasul yang tidak menyelisihi kitab dan hikmah yang ada pada kalian, maka wajib bagi kalian beriman kepadanya dan menolongnya dengan sebenar-benarnya. Apakah kalian setuju dan mengakuinya serta memegang janji dari-Ku ini?” Maka para nabi ini menjawab: “Kami setuju dan berjanji”. Kemudian Allah memerintahkan mereka untuk saling bersaksi, dan Dia menjadi saksi atas pernyataan dan persaksian mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "81. وَإِذْ أَخَذَ اللهُ مِيثٰقَ النَّبِيِّۦنَ ( Dan (ingatlah), ketika Allah mengambil perjanjian dari para nabi) Setelah Allah menjelaskan bahwa para nabi memerintahkan untuk mentauhidkan Allah dan mengikhlaskan diri kepada-Nya, maka Allah disini menjelaskan bahwa mereka membenarkan risalah dan memerintahkannya untuk membenarkannya. Dan Allah telah mengambil janji dari para nabi untuk saling membenarkan keimanan diantara mereka, saling menyuruh melakukan hal itu diantara mereka, dan menyuruh umat mereka hal itu. لَمَآ ءَاتَيْتُكُم مِّن كِتٰبٍ وَحِكْمَةٍ ( Sungguh, apa saja yang Aku berikan kepadamu berupa kitab dan hikmah) Yakni apabila Aku memberikan sesuatu dari hal-hal itu. ثُمَّ جَآءَكُمْ رَسُولٌ مُّصَدِّقٌ لِّمَا مَعَكُمْ ( kemudian datang kepadamu seorang rasul yang membenarkan apa yang ada padamu) Yakni menyepakati apa yang akan Aku berikan kepada kalian. لَتُؤْمِنُنَّ بِهِۦ ( niscaya kamu akan sungguh-sungguh beriman kepadanya) Ini merupakan isi dari sumpah dalam pengambilan janji ini. Dan ini memiliki makna permintaan sumpah dari mereka. Dari Ali bin Abi Thalib ia berkata: tidaklah Allah mengutus seorang nabi mulai dari Nabi Adam dan setelahnya kecuali Allah mengambil dari mereka perjanjian tentang Nabi Muhammad, apabila Nabi Muhammad diutus sedangkan mereka masih dalam keadaan hidup maka mereka harus beriman kepadanya dan menolongnya, dan menyuruh kaumnya melakukan itu dengan mengambil perjanjian kepada kaumnya tersebut. إِصْرِى ۖ ( perjanjian-Ku) Perjanjian disebut sebagai إصري karena didalamnya terdapat keteguhan yang kuat. قَالَ فَاشْهَدُوا۟ ( Allah berfirman: “Kalau begitu saksikanlah) Yakni Allah berfirman: “maka bersaksilah”, yakni agar sebagian kalian bersaksi atas persetujuan sebagian lainnya. وَأَنَا۠ مَعَكُم مِّنَ الشّٰهِدِينَ ( dan Aku menjadi saksi (pula) bersama kamu) Yakni dan Aku atas persetujuan kalian dan menjadi saksi sebagian kalian atas sebagian yang lain."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "81 Dan ingatlah wahai Ahli Kitab, ketika Allah mengambil perjanjian yang teguh dari para nabi: “Sungguh, apa saja yang Aku berikan kepadamu berupa kitab dan hikmah (pemahaman atas rahasia syariat) kemudian datang kepadamu seorang rasul yang membenarkan apa yang ada padamu, niscaya kamu akan sungguh-sungguh beriman kepadanya dan menolongnya. Dan kalian ambil perjanjianku yang teguh itu yang untuk dipenuhi. Mereka para nabi menjawab: “Kami mengakui”. Allah berfirman: “Kalau begitu saksikanlah hai para nabi dan sampaikanlah kepada manusia dan Aku menjadi saksi pula bersama kamu”."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika Allah mengambil janji} janji {dari para nabi,“Ketika Aku memberi kalian} bagaimanapun Aku telah memberi kalian {kitab dan hikmah, lalu datang kepada kalian seorang rasul yang membenarkan apa yang ada pada kalian, sungguh kalian akan benar-benar beriman kepadanya dan menolongnya.” Allah berfirman, “Apakah kalian mengakui dan menerima} menerima {perjanjian denganKu atas yang demikian itu”} janjiKu yang berat itu {Mereka menjawab, “Kami mengakui.” Allah berfirman, “Kalau begitu, bersaksilah kalian dan Aku menjadi saksi bersama kalian”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "81-82. Ini adalah berita dari Allah bahwa Dia telah mengambil janji dari para nabi dan ikatan sumpah pada mereka semuanya yang disebabkan oleh apa yang telah Allah karuniakan kepada mereka dan karena semua yang telah Dia berikan untuk mereka berupa al-Kitab dan al-Hikmah yang berkonsekuensi wajibnya menegakkan hak-hak Allah dan menunaikannya dengan sebaik-baiknya; bahwa apabila datang kepada mereka seorang rasul yang membenarkan apa yang ada pada mereka, yang diutus untuk menyampaikan ketauhidan, kebenaran, keadilan dan prinsip-prinsip dasar yang disepakati oleh seluruh syariat, maka mereka akan beriman kepadanya dan membelanya. Mereka pun menyetujui hal tersebut, mengakuinya, konsisten terhadapnya, mempersaksikan mereka, dan ia bersaksi atas mereka, serta mengancam orang-orang yang menyalahi perjanjian tersebut. Ini merupakan perintah yang bersifat umum diantara para Nabi, bahwasanya jalan mereka adalah satu, dan bahwa dakwah dari setiap Nabi di antara mereka telah mereka sepakati dan telah mereka setujui bersama, keumuman itu adalah bahwa Allah mengambil janji dari mereka untuk beriman dan membela Nabi Muhammad sholallohu alaihi wasallam. Karena itu, barangsiapa yang mengaku bahwa ia adalah pengikut salah seorang dari mereka, maka ini adalah agama mereka yang telah diambil oleh Allah perjanjian dari mereka lalu mereka menyetujui dan mengakuinya. Maka barangsiapa yang berpaling dari mengikuti Nabi Muhammad dari orang-orang yang menyangka bahwasanya mereka termasuk pengikut Nabi-Nabi tersebut, maka ia adalah fasik yang keluar dari ketaatan kepada Allah dan mendustakan Rasul yang diakuinya bahwa ia termasuk pengikutnya padahal ia menyimpang dari jalannya. Ini merupakan penegakkan hujjah dan keterangan yang kuat atas setiap orang yang tidak beriman kepada Nabi Muhammad sholallohu alaihi wasallam dari ahli kitab dan agama-agama lainnya, dan tidaklah mungkin mereka beriman kepada Rasul-rasul mereka dimana mereka mengakui sebagai pengikut-pengikut mereka hingga mereka beriman kepada pemimpin dari rasul-rasul tadi dan penutup mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 81: Dan (ingatlah) tatkala Allah adakan perjanjian (dengan) nabi-nabi: \"Jika datang kepada kamu Kitab dan Hikmah, kemudian datang kepada kamu seorang rasul yang membenarkan apa-apa yang ada pada kamu, (hendaklah) kamu percaya sungguh-sungguh kepadanya, dan menolong sungguh-sungguh akan dia.\" Ia bertanya: \"Sudahkah kamu sanggupi dan kamu terima perjanjian-Ku demikian?\" Mereka jawab: \"Kami telah sanggup,\" Ia berkata: \"Saksikanlah dan Aku bersama kamu adalah dari golongan mereka yang menyaksikan.\""
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Para nabi berjanji kepada Allah Subhaanahu wa Ta'aala bahwa apabila datang seorang Rasul bernama Muhammad, maka mereka akan beriman kepadanya dan menolongnya. Perjanjian nabi-nabi ini mengikat pula para umatnya. Ayat ini termasuk dalil tingginya kedudukan Nabi Muhammad shallallahu 'alaihi wa sallam, dan bahwa Beliau adalah nabi yang paling utama dan pemimpin mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 81",
    "description": "Setelah ayat sebelumnya menginformasikan tuduhan-tuduhan tidak benar yang ditujukan kepada para nabi dan rasul, maka ayat ini menegaskan bahwa para nabi dan rasul itu telah diambil sumpah janjinya oleh Allah untuk membenarkan Muhammad sebagai nabi dan rasul terakhir. Ingatlah ketika Allah mengambil perjanjian dari para nabi dan rasul, manakala aku memberikan kitab dan hikmah yaitu ilmu yang bermanfaat dan kemampuan untuk mengamalkannya, kepada kamu, lalu datang kepada kamu seorang rasul, yakni nabi Muhammad, yang membenarkan apa yang ada pada kamu berupa ajaran tauhid yang tercantum dalam kitab-kitab mereka, niscaya kamu akan sungguh-sungguh beriman kepadanya dan menolong agama-Nya. Allah berfirman, apakah kamu setuju dan menerima perjanjian dengan-ku atas yang demikian itu, yakni membenarkan Muhammad sebagai nabi dan rasul terakhir' mereka menjawab, kami setuju. Allah berfirman, kalau begitu bersaksilah kamu, wahai para nabi, dan aku menjadi saksi bersama kamu bahwa nabi Muhammad adalah rasul dan nabi terakhir. Ayat ini juga menjadi bukti bahwa manusia itu cenderung lalai terhadap aturan ilahi, sehingga perlu diturunkan nabi dan rasul secara berkesinambungan yang berakhir pada nabi Muhammad, saat ini dilanjutkan oleh para pewaris beliau, yaitu para ulama. Perjanjian di atas bukan saja dilakukan oleh para nabi tetapi juga mengikat para kaumnya. Maka barang siapa berpaling dari mengimani nabi Muhammad, setelah itu, yaitu setelah diperkuat dengan sumpah, maka mereka itulah orang yang fasik, yaitu orang yang keluar dari syariat Allah."
  }
]