[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka barang siapa yang berpaling dari seruan islam setelah penjelasan ini dan perjanjian ini yang Allah telah mengambilnya dari para nabiNYA, maka mereka itu adalah orang-orang yang keluar dari agama Allah dan ketaatan kepada tuhan mereka"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "82. Barangsiapa berpaling setelah ada janji yang diperkuat dengan kesaksian dari Allah dan para rasul-Nya, mereka itulah orang-orang yang keluar dari agama Allah dan keluar dari ketaatan kepada-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "82. Barangsiapa yang enggan beriman setelah pernjanjian ini maka ia adalah orang yang jauh dari rahmat Allah dan keluar dari ketaatan kepada-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "82. فَمَن تَوَلَّىٰ ( Barang siapa yang berpaling) Yakni yang menolak setelah perjanjian ini tentang kamu Hai Muhammad yang diambil dari seluruh umat. فَأُو۟لٰٓئِكَ هُمُ الْفٰسِقُونَ (maka mereka itulah orang-orang yang fasik ) Yakni yang keluar dari ketaatan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "82 Barang siapa yang berpaling sesudah beriman dan perjanjian yang diambil atas seluruh umat itu, maka mereka itulah orang-orang yang keluar dari ketaatan dan batasan Allah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Siapa yang berpaling setelah itu} berpaling setelah perjanjian dan pengukuhan dengan ikrar dan kesaksian itu {maka mereka itulah orang-orang fasik} orang-orang yang keluar dari ketaatan kepada Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "81-82. Ini adalah berita dari Allah bahwa Dia telah mengambil janji dari para nabi dan ikatan sumpah pada mereka semuanya yang disebabkan oleh apa yang telah Allah karuniakan kepada mereka dan karena semua yang telah Dia berikan untuk mereka berupa al-Kitab dan al-Hikmah yang berkonsekuensi wajibnya menegakkan hak-hak Allah dan menunaikannya dengan sebaik-baiknya; bahwa apabila datang kepada mereka seorang rasul yang membenarkan apa yang ada pada mereka, yang diutus untuk menyampaikan ketauhidan, kebenaran, keadilan dan prinsip-prinsip dasar yang disepakati oleh seluruh syariat, maka mereka akan beriman kepadanya dan membelanya. Mereka pun menyetujui hal tersebut, mengakuinya, konsisten terhadapnya, mempersaksikan mereka, dan ia bersaksi atas mereka, serta mengancam orang-orang yang menyalahi perjanjian tersebut. Ini merupakan perintah yang bersifat umum diantara para Nabi, bahwasanya jalan mereka adalah satu, dan bahwa dakwah dari setiap Nabi di antara mereka telah mereka sepakati dan telah mereka setujui bersama, keumuman itu adalah bahwa Allah mengambil janji dari mereka untuk beriman dan membela Nabi Muhammad sholallohu alaihi wasallam. Karena itu, barangsiapa yang mengaku bahwa ia adalah pengikut salah seorang dari mereka, maka ini adalah agama mereka yang telah diambil oleh Allah perjanjian dari mereka lalu mereka menyetujui dan mengakuinya. Maka barangsiapa yang berpaling dari mengikuti Nabi Muhammad dari orang-orang yang menyangka bahwasanya mereka termasuk pengikut Nabi-Nabi tersebut, maka ia adalah fasik yang keluar dari ketaatan kepada Allah dan mendustakan Rasul yang diakuinya bahwa ia termasuk pengikutnya padahal ia menyimpang dari jalannya. Ini merupakan penegakkan hujjah dan keterangan yang kuat atas setiap orang yang tidak beriman kepada Nabi Muhammad sholallohu alaihi wasallam dari ahli kitab dan agama-agama lainnya, dan tidaklah mungkin mereka beriman kepada Rasul-rasul mereka dimana mereka mengakui sebagai pengikut-pengikut mereka hingga mereka beriman kepada pemimpin dari rasul-rasul tadi dan penutup mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 82: Lantaran demikian, barangsiapa berpaling belakang sesudah itu, maka merekalah orang-orang yang fasik."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Fasik ialah orang yang tidak memperhatikan perintah Allah Subhaanahu wa Ta'aala. Berdasarkan ayat ini, barang siapa mengaku sebagai pengikut para nabi –seperti halnya orang-orang Yahudi dan Nasrani- namun tidak mau mengikuti Nabi Muhammad shallallahu 'alaihi wa sallam, maka sesungguhnya mereka telah berpaling dari perjanjian tersebut, mereka adalah orang-orang fasik dan akan masuk neraka dengan kekal."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 82",
    "description": "Perjanjian di atas bukan saja dilakukan oleh para nabi tetapi juga mengikat para kaumnya. Maka barang siapa berpaling dari mengimani nabi Muhammad, setelah itu, yaitu setelah diperkuat dengan sumpah, maka mereka itulah orang yang fasik, yaitu orang yang keluar dari syariat Allah. Jika memang agama itu hakikatnya satu dan inti semua risalah juga sama yaitu tauhid, maka mengapa mereka berpaling dari agama yang benar yang dibawa oleh nabi Muhammad dengan mencari agama yang lain selain agama Allah, yaitu agama islam' padahal, apa, yakni semua makhluk, yang di langit dan di bumi berserah diri dengan senantiasa tunduk dan patuh kepada hukum dan kehendak-Nya, baik dengan suka yaitu secara tulus ikhlas karena melihat bukti-bukti kebenaran, maupun terpaksa setelah melihat azab. Dan hanya kepada-Nya mereka dikembalikan, lalu mereka akan mendapat balasan yang setimpal."
  }
]