[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah orang orang fasik dari para ahli kitab itu menginginkan selain agama,yaitu islam yang Allah telah mengutus Muhammad dengannya? Padahal seluruh yang berada di langit dan bumi, berserah diri dan patuh serta tunduk kepada Allah baik secara tulus (seperi kaum mukminin) maupun secara terpaksa ketika musibah-musibah melanda, saat hal itu tidak bermanfaat bagi mereka yaitu orang orang kafir, sebagaimana telah tunduk kepadaNYA seluruh makhluk yang ada. DAN kepadanya lah mereka akan kembali pada hari kiamat, lalu Dia akan memberikan balasan kepada masing-masing sesuai dengan amal perbuatananya. Dan ini merupakan peringatan dari Allah terhadap makhlukNYA supaya seorang dari mereka kembali kepadanya dengan agama selain Islam."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "83. Apakah orang-orang yang keluar dari agama Allah dan keluar dari ketaatan kepada-Nya itu hendak mencari agama lain selain agama yang Allah pilihkan untuk para hamba-Nya (yaitu Islam)? Padahal hanya kepada Allah -Subḥānahu- semua makhluk yang ada di langit dan bumi ini tunduk dan berserah diri, baik secara sukarela seperti orang-orang mukmin, maupun karena terpaksa seperti orang-orang kafir. Kemudian hanya kepada-Nya lah semua makhluk akan dikembalikan pada hari kiamat untuk menjalani penghitungan amal dan menerima balasannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "83. Allah mengingkari orang-orang fasik: “Apakah mereka menginginkan agama selain Islam, sedangkan segala yang ada di langit dan bumi tunduk kepada Allah, baik itu secara suka rela seperti orang-orang mukmin atau secara terpaksa seperti orang-orang kafir?” Dan hanya kepada Allah semua makhluk dikembalikan pada hari perhitungan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "83. أَفَغَيْرَ دِينِ اللهِ يَبْغُونَ (Maka apakah mereka mencari agama yang lain dari agama Allah ) Yakni apakah seseorang mencari agama selain agama Allah Sang Pencipta segala sesuatu yang berupa ketaatan, ibadah, berserah diri kepada-Nya. وَلَهُۥٓ أَسْلَمَ مَن فِى السَّمٰوٰتِ ( padahal kepada-Nya-lah menyerahkan diri segala apa yang di langit) Yakni para malaikat. وَالْأَرْضِ (dan di bumi ) Yakni seluruh makhluk yang ada di bumi. وَكَرْهًا ( maupun terpaksa) Pendapat mengatakan yang dimaksud adalah yakni tawanan yang didatangkan dalam keadaan terikat rantai dan belenggu yang digiring menuju surga sedang mereka merasa terpaksa. Dan pendapat lain mengatakan bahwa segala yang ada di langit dan di bumi sampai hewan-hewan dan benda mati berserah diri kepada Allah, bahkan orang kafir pun berserah diri kepada Allah dengan rasa terpaksa meski hati dan lisannya kafir."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "83 Maka apakah mereka mencari agama yang lain selain agama Allah Sang Pencipta? Padahal kepada-Nya-lah segala apa yang di langit dan di bumi menyerahkan diri, baik dengan suka maupun terpaksa. Mereka adalah para malaikat, jin dan manusia dan hanya kepada Allahlah mereka dikembalikan kemudian diberi balasan atas segala perbuatannya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mengapa selain agama Allah yang mereka cari} cari {hanya kepadaNyalah berserah diri} berserah diri dan tunduk {apa yang ada di langit dan di bumi, baik dengan suka maupun terpaksa} taat dan terpaksa {dan hanya kepadaNya mereka dikembalikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "83-85. Telah berlalu pada surat al-Baqarah bahwa dasar-dasar ini yang merupakan pokok-pokok keimanan yang diperintahkan oleh Allah kepada umat ini telah disepakati oleh kitab-kitab dan Rasul-rasul. Itulah tujuan asasi yang ditujukan kepada setiap orang, dan bahwasanya itu adalah agama dan Islam yang hakiki. Dan bahwa orang yang mencari selainnya dan beramal dengannya, maka perbuatannya itu tertolak hingga ia tidak memiliki ajaran yang ia kembali kepadanya. Barangsiapa yang tidak membutuhkan dan membencinya, maka kemanakah ia akan pergi? Kepada penyembahan pohon, batu atau api? Atau kepada penyembahan rahib, pendeta atau salib? Atau kepada peniadaan Rabb semesta alam? Atau kepada agama-agama yang batil yang merupakan wahyu dari setan? Mereka semua itu di akhirat nanti termasuk orang-orang yang merugi."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 83: Apakah yang lain dari agama Allah mereka maukan, padahal apa-apa yang di langit dan (di) bumi telah menyerah diri kepada-Nya dengan suka dan dengan terpaksa, dan kepada-Nyalah mereka akan dikembalikan?."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Hal ini sangat tidak patut sekali, karena tidak ada agama yang paling baik selain agama Allah. Sebagaimana orang-orang mukmin yang tunduk beribadah kepada Allah. Yaitu seluruh makhluk, termasuk orang-orang kafir, mereka mengikuti qadha dan qadar Allah Subhaanahu wa Ta'aala dan tidak bisa keluar dari ketetapan-Nya. Semua makhluk akan kembali kepada-Nya, nanti Dia akan memutuskan masalah mereka dan memberikan balasan dengan hukum-Nya yang berjalan antara memberikan karunia dan berbuat adil."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 83",
    "description": "Jika memang agama itu hakikatnya satu dan inti semua risalah juga sama yaitu tauhid, maka mengapa mereka berpaling dari agama yang benar yang dibawa oleh nabi Muhammad dengan mencari agama yang lain selain agama Allah, yaitu agama islam' padahal, apa, yakni semua makhluk, yang di langit dan di bumi berserah diri dengan senantiasa tunduk dan patuh kepada hukum dan kehendak-Nya, baik dengan suka yaitu secara tulus ikhlas karena melihat bukti-bukti kebenaran, maupun terpaksa setelah melihat azab. Dan hanya kepada-Nya mereka dikembalikan, lalu mereka akan mendapat balasan yang setimpal setelah ayat sebelumnya memaparkan bahwa para rasul diambil sumpah janjinya untuk mengimani kerasulan nabi Muhammad dan menolong agamanya, maka melalui ayat ini, Allah hendak menguatkan kesamaan tuhan dan risalah di antara rasul-rasul-Nya, yaitu dengan memerintahkan nabi Muhammad untuk mengimani semua rasul dan kitab-kitab yang dibawanya. Katakanlah, wahai nabi Muhammad, kami beriman kepada Allah dan kepada apa yang diturunkan kepada kami, Al-Qur'an, dan yang diturunkan kepada ibrahim, ismail, ishak, yakub, dan anak cucunya, yang ada dua belas, di mana mereka beriman kepada Allah dan semua rasul tanpa membeda-bedakannya, tidak seperti yang dilakukan sebagian ahli kitab, dan apa yang diberikan kepada musa, taurat, isa, injil, dan para nabi lainnya dari tuhan mereka yang tidak diketahui kisah-kisahnya. Kami juga tidak membeda-bedakan seorang pun di antara mereka dalam mengimaninya, sebab mengingkari seorang rasul berarti mengingkari semuanya, dan hanya kepada-Nya kami berserah diri."
  }
]