[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah kepada mereka (wahai rosul); “kami beriman kepada Allah dan kami taat, maka tidak ada robb bagi kami selain Dia, dan tidak ada yang berhak disembah bagi kami selain Dia, dan kami beriman dengan wahyu yang Allah turunkan kepada kami, dan yang Dia turunkan kepada Ibrahim kekasih Allah, dan dua anaknya Ismail dan Ishaq dan cucu nya Ya’kub anaknya Ishak, dan yang Dia turunkan kepada asbath (yaitu para nabi yang mereka berada pada kabilah-kabilah Bani Israil yang 12 dari anak-anak Ya’kub), dan apa yang diberikan kepada Musa dan Isa dari taurot dan injil, dan apa yang Allah turunkan kepada para nabi Nya, kami beriman kepada itu semua, dan kami tidak membedakan antara seorangpun dari mereka, dan kami kepada Allah semata tunduk dengan ketaatan, kami mengakui bagi Nya rububiyyah dan uluhiyyah dan ibadah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "84. Katakanlah -wahai Rasul-, “Kami beriman kepada Allah sebagai Rabb yang berhak disembah. Kami taat kepada-Nya dengan cara menjalankan perintah-Nya. Dan kami beriman kepada wahyu yang Dia turunkan kepada kami, wahyu yang Dia turunkan kepada Ibrahim, Ismail, Ishak dan Ya'qūb, wahyu yang Dia turunkan kepada para nabi dari keturunan Ya'qūb, dan beriman kepada apa yang yang diberikan kepada Musa, Isa, dan semua nabi lainnya, yaitu kitab-kitab suci dan mukjizat-mukjizat yang berasal dari Rabb mereka, tanpa membeda-bedakan di antara mereka dengan beriman kepada Nabi yang satu dan ingkar kepada Nabi yang lain. Kami tunduk dan berserah diri kepada Allah -Ta'ālā-.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "84. Allah menegaskan betapa pentingnya keimanan dengan memerintahkan Rasulullah dan umatnya untuk mengikrarkan keimanan mereka yang sempurna, yaitu dengan beriman kepada Allah, al-Qur’an, firman-firman yang diturunkan kepada Ibrahim, Ismail, Ishaq, Ya’qub dan keturunannya, dan Taurat dan Injil yang diturunkan kepada Musa dan Isa, serta apa yang diberikan kepada para nabi yang lain. Kami tidak membedakan mereka seorangpun dari yang lain, dan kami tunduk dan taat kepada Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "84. قُلْ ءَامَنَّا ( Katakanlah: “Kami beriman) Rasulullah diperintahkan untuk mengatakan kalimat ini sebagai pemberitahuan tentang dirinya dan keteguhan dalam keimanan yang terperinci ini, dan umatnya diperintahkan untuk mengikutinya dalam hal ini. وَالْأَسْبَاطِ ( dan anak-anaknya) Yakni kabilah-kabilah dari bani Israil yang beriman kepada Nabi Musa. لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِّنْهُمْ ( Kami tidak membeda-bedakan seorangpun di antara mereka) Sebagaimana orang-orang Yahudi dan Nasrani membeda-bedakan mereka dengan beriman kepada sebagian dari mereka dan kafir kepada sebagian lainnya. Dan tafsir serupa telah disebutkan di surat al-Baqarah: 136."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "84 Katakanlah kepada seluruh umat wahai Nabi: “Kami beriman kepada Allah semata yang tidak ada sekutu baginya dan beriman kepada Al-quran yang diturunkan kepada kami dan beriman kepada shuhuf yang diturunkan kepada Ibrahim, dan beriman kepada ayat-ayat yang diturunkan kepada putera Ibrahim yaitu Ismail, Ishaq. Juga beriman kepada Ya’qub bin Ishaq dan Asbath: anak perempuan Ya’qub yang berjumlah 10 orang. Kami tidak membeda-bedakan mereka sebagaimana yang dilakukan orang Yahudi dan Nashrani, tapi kami mengimani mereka semua, hanya kepada-Nya-lah kami menyerahkan diri, berpegang teguh dan ikhlas"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah, “Kami beriman kepada Allah dan pada apa yang diturunkan kepada kami dan yang diturunkan kepada Ibrahim, Ismail, Ishaq, Ya‘qub beserta anak cucuny} nabi-nabi dari keturunan Ya’kub {dan apa yang diberikan kepada Musa, Isa, serta para nabi dari Tuhan mereka. Kami tidak membeda-bedakan seorang pun di antara mereka dan hanya kepadaNya kami berserah diri”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "83-85. Telah berlalu pada surat al-Baqarah bahwa dasar-dasar ini yang merupakan pokok-pokok keimanan yang diperintahkan oleh Allah kepada umat ini telah disepakati oleh kitab-kitab dan Rasul-rasul. Itulah tujuan asasi yang ditujukan kepada setiap orang, dan bahwasanya itu adalah agama dan Islam yang hakiki. Dan bahwa orang yang mencari selainnya dan beramal dengannya, maka perbuatannya itu tertolak hingga ia tidak memiliki ajaran yang ia kembali kepadanya. Barangsiapa yang tidak membutuhkan dan membencinya, maka kemanakah ia akan pergi? Kepada penyembahan pohon, batu atau api? Atau kepada penyembahan rahib, pendeta atau salib? Atau kepada peniadaan Rabb semesta alam? Atau kepada agama-agama yang batil yang merupakan wahyu dari setan? Mereka semua itu di akhirat nanti termasuk orang-orang yang merugi."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 84: Katakanlah: \"Kami telah beriman kepada Allah, dan (kepada) apa yang telah diturunkan kepadakami, dan (kepada) apa yang telah diturunkan kepada Ibrahim dan ismail dan Ishaq dan Ya'qub dan anak cucu (nya), dan (kepada) apa yang telah diberikan kepada Musa dan Ia dan (kepada) nabi-nabi dari Tuhan mereka; kami tidak membedakan antara seorang pun dari mereka itu; dan kepada Nya lah kami berserah diri.\""
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan beriman kepada sebagian dan mendustakan sebagian yang lain. Mengikhlaskan beribadah kepada-Nya. Tafsir ayat ini lebih rincinya sudah disebutkan dalam surat Al Baqarah: 136."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 84",
    "description": "Setelah ayat sebelumnya memaparkan bahwa para rasul diambil sumpah janjinya untuk mengimani kerasulan nabi Muhammad dan menolong agamanya, maka melalui ayat ini, Allah hendak menguatkan kesamaan tuhan dan risalah di antara rasul-rasul-Nya, yaitu dengan memerintahkan nabi Muhammad untuk mengimani semua rasul dan kitab-kitab yang dibawanya. Katakanlah, wahai nabi Muhammad, kami beriman kepada Allah dan kepada apa yang diturunkan kepada kami, Al-Qur'an, dan yang diturunkan kepada ibrahim, ismail, ishak, yakub, dan anak cucunya, yang ada dua belas, di mana mereka beriman kepada Allah dan semua rasul tanpa membeda-bedakannya, tidak seperti yang dilakukan sebagian ahli kitab, dan apa yang diberikan kepada musa, taurat, isa, injil, dan para nabi lainnya dari tuhan mereka yang tidak diketahui kisah-kisahnya. Kami juga tidak membeda-bedakan seorang pun di antara mereka dalam mengimaninya, sebab mengingkari seorang rasul berarti mengingkari semuanya, dan hanya kepada-Nya kami berserah diri. Jika agama yang dibawa oleh nabi Muhammad adalah sama dengan inti ajaran nabi-nabi sebelumnya, yakni tauhid, maka barangsiapa mencari agama selain islam setelah terutusnya nabi Muhammad dia tidak akan diterima karena Allah tidak meridainya, dan di akhirat dia termasuk orang yang rugi, karena ia berhak atas siksa-Nya."
  }
]