[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan barang siapa yang mencari agama selain agama islam yang itu merupakan kepasrahan kepada Allah dengan tauhid dan melaksanakan dengan ketaatan dan ibadah, dan kepada rosul Nya nabi yang menjadi penutup, Muhammad dengan beriman kepadanya dan mengikutinya serta mencintainya secara lahir maupun batin, maka tidak akan diterima darinya hal tersebut, dan dia di akhirat termasuk orang-orang yang merugi yang menghinakan diri mereka oleh perbuata-perbuatan mereka sendiri."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "85. Barangsiapa yang mencari agama lain di luar agama yang diridai Allah, yaitu agama Islam, maka agamanya itu tidak akan diterima oleh Allah, dan kelak di akhirat ia akan termasuk golongan orang-orang yang merugikan diri sendiri, karena mereka dimasukkan ke dalam neraka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "85. barangsiapa yang menempuh jalan selain jalan agama yang disyariatkan Allah maka Dia tidak akan menerimanya. Hal ini berlaku bagi orang-orang terdahulu dan setelahnya. Mereka akan mendapat siksaan di hari kiamat dan menjadi orang-orang yang merugi. Ibnu Taimiyah berkata: “Allah menjelaskan bahwa agama yang Dia terima dan ridhai adalah Islam, dan agama tidak akan diterima dan diridhai melainkan jika keimanan beriringan dengan amal.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "85. دِينًا ( agama) Yakni mencari untuk mengikuti agama yang bukan islam. فَلَن يُقْبَلَ مِنْهُ وَهُوَ فِى الْاٰخِرَةِ مِنَ الْخٰسِرِينَ ( maka sekali-kali tidaklah akan diterima (agama itu)daripadanya, dan dia di akhirat termasuk orang-orang yang rugi) Maka tidak ada agama setelah diutusnya Nabi Muhammad kecuali agamanya, dan tidak ada keselamatan di hari kiamat bagi seorangpun yang tidak beragama dengan agama Islam. Dari Abu Hurairah ia berkata: Rasulullah bersabda: dihadirkan amalan-amalan pada hari kiamat, maka didatangkanlah amalan shalat lalu ia berkata: Ya Rabb, aku adalah shalat, maka Allah berfirman: kamu dalam keadaan baik. Lalu didatangkan amalan puasa lalu ia berkata: Ya Rabb, aku adalah puasa, maka Allah berfirman: kamu dalam keadaan baik. Lalu didatangkan amalan-amalan lainnya dan kepada semuanya Allah berfirman: kamu dalam keadaan baik. Lalu didatangkan amalan Islam lalu ia berkata: Ya Rabb, Engkau adalah as-Salam dan aku adalah Islam. maka Allah berfirman: kamu dalam keadaan baik, hari ini denganmu Aku akan mengambil dan denganmu Aku memberi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "85 Barangsiapa mencari agama selain agama Islam, maka sekali-kali tidaklah akan diterima agama itu, dan dia di akhirat termasuk orang-orang yang rugi dan berhak atas azab. Ayat ini turun untuk Haris bin Suwaid Al Anshori yang murtad dari Islam beserta 12 orang lainnya dan di temui di Makkah dalam keadaan kafir. Kemudian turunlah ayat ini, kemudian dia datang kepada saudaranya untuk bertaubat, dan Islam kembali."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Siapa saja yang mencari} memeluk {agama selain Islam, maka tidak akan diterima darinya dan di akhirat dia termasuk orang-orang yang rugi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "83-85. Telah berlalu pada surat al-Baqarah bahwa dasar-dasar ini yang merupakan pokok-pokok keimanan yang diperintahkan oleh Allah kepada umat ini telah disepakati oleh kitab-kitab dan Rasul-rasul. Itulah tujuan asasi yang ditujukan kepada setiap orang, dan bahwasanya itu adalah agama dan Islam yang hakiki. Dan bahwa orang yang mencari selainnya dan beramal dengannya, maka perbuatannya itu tertolak hingga ia tidak memiliki ajaran yang ia kembali kepadanya. Barangsiapa yang tidak membutuhkan dan membencinya, maka kemanakah ia akan pergi? Kepada penyembahan pohon, batu atau api? Atau kepada penyembahan rahib, pendeta atau salib? Atau kepada peniadaan Rabb semesta alam? Atau kepada agama-agama yang batil yang merupakan wahyu dari setan? Mereka semua itu di akhirat nanti termasuk orang-orang yang merugi."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 85: Dan barangsiapa cari0a) satu agama lain daripada Islam, maka tidak ada akan diterima (agama itu) daripadanya sedang ia di Akhirat (adalah) seorang daripada me-reka yang rugi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini turun berkenaan dengan orang-orang yang murtad dan bergabung dengan orang-orang kafir. Amal shalihnya tertolak; tidak diterima. Karena kembalinya ke neraka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 85",
    "description": "Jika agama yang dibawa oleh nabi Muhammad adalah sama dengan inti ajaran nabi-nabi sebelumnya, yakni tauhid, maka barangsiapa mencari agama selain islam setelah terutusnya nabi Muhammad dia tidak akan diterima karena Allah tidak meridainya, dan di akhirat dia termasuk orang yang rugi, karena ia berhak atas siksa-Nyasetelah ayat sebelumnya menerangkan sikap penolakan yahudi terhadap kebenaran nabi Muhammad dan agama islam, maka ayat ini menerangkan bahwa sikap tersebut mengakibatkan mereka tidak memperoleh hidayah. Bagaimana mungkin Allah akan memberi petunjuk kepada suatu kaum yang kafir setelah mereka melihat bukti-bukti kebenaran yang memungkinkan mereka beriman, serta mengakui bahwa rasul, Muhammad, itu benar-benar rasul, dan disertai bukti-bukti yang jelas tentang hal itu, telah sampai kepada mereka seperti Al-Qur'an dan kitab-kitab suci lainnya yang menginformasikan tentang kebenaran Muhammad sebagai nabi terakhir' sungguh, sikap semacam itu adalah wujud kezaliman, dan Allah tidak memberi petunjuk kepada orang zalim yaitu orang yang tahu kebenaran tetapi melanggar dan mengingkarinya, bahkan menentangnya."
  }
]