[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bagaimana Allah akan memberikan taufik untuk beriman kepada-Nya dan kepada RasulNya kepada kaum yang mengingkari kenabian Muhammad setelah keimanan mereka kepadanya, dan mereka sudah bersaksi bahwa sesungguhnya Muhammad adalah haq dan risalah yang dibawanya adalah kebenaran, dan telah datang kepada mereka hujjah-hujjah dari sisi Allah dan bukti-bukti kebenaran tentang itu? Dan Allah tidaklah memberikan taufik menuju al-haq dan kebenaran kepada golongan yang berbuat kezhaliman. Mereka adalah orang-orang yang berbelok dari kebenaran menuju kebatilan, lalu lebih memilih kekafiran daripada keimanan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "86. Bagaimana mungkin Allah menunjukkan jalan iman kepada-Nya dan kepada Rasul-Nya bagi orang-orang yang kafir setelah beriman kepada Allah dan bersaksi bahwa apa yang dibawa oleh Rasulullah Muhammad -ṣallallāhu 'alaihi wa sallam- adalah hak, dan telah datang kepada mereka bukti-bukti nyata yang menunjukkan kebenaran hal itu?! Allah tidak akan menunjukkan jalan iman kepada-Nya bagi orang-orang zalim yang sengaja memilih jalan yang sesat daripada jalan yang benar."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "86. Bagaimana Allah akan memberi petunjuk menuju kebenaran dan keimanan kepada kaum yang murtad kemudian mengingkari kenabian Muhammad setelah mengimani dan berikrar bahwa dia Rasulullah serta meyakini bahwa bukti-bukti yang telah ada merupakan tanda kebenaran kenabiannya? Allah tidak akan memberi taufik menuju kebenaran kepada orang-orang yang zalim."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "86. كَيْفَ يَهْدِى اللهُ قَوْمًا كَفَرُوا۟ بَعْدَ إِيمٰنِهِمْ (Bagaimana Allah akan memberi petunjuk suatu kaum yang kafir sesudah mereka beriman ) Makna ayat ini adalah sebagai bentuk ketidakmungkinan bahwa Allah akan memberi petunjuk suatu kaum kepada kebenaran sedangkan mereka menjadi kafir setelah keimanan mereka, setelah mereka bersaksi bahwa Rasulullah berada dalam kebenaran, dan setelah datang kepada mereka bukti-bukti dari kitab Allah dan mukjuzat Rasulullah sehingga mereka mengakuinya kemudian mengamalkannya dan beriman kepadanya. وَاللهُ لَا يَهْدِى الْقَوْمَ الظّٰلِمِينَ ( Allah tidak menunjuki orang-orang yang zalim) Dan diantara mereka adalah orang-orang murtad. Dan tidak diragukan lagi bahwa dosa orang yang murtad lebih besar daripada dosa orang yang tetap dalam kekafirannya yang belum pernah masuk Islam, karena orang yang murtad telah mengetahui kebenaran kemudian berpaling karena kebebalan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "86 Allah tidak akan menunjuki suatu kaum yang kafir sesudah mereka beriman, mereka adalah Yahudi dan Nashrani. Mereka kufur kepada Muhammad setelah mereka mengimani sesuai sifat yang telah disebutkan di Taurat. Mereka bersaksi bahwa Rasul adalah benar-benar utusan Allah. dan keterangan-keteranganpun telah datang kepada mereka untuk membuktikan kebenaran kenabiannya. Allah tidak menunjuki orang-orang yang kufur setelah beriman. Ayat ini turun untuk Yahudi dan Nashrani yang telah melihat sifat-sifat Nabi Muhammad pada kitab Taurat, kemudian mengimaninya, dan bersaksi bahwa itu benar. Kemudian mereka membuka rahasia itu kepada kaum musyrik. Ketika nabi yang diutus bukan dari golongan mereka dan iri dengki kepada orang Arab atas kenabian itu, dan mengingkari serta kufur kepadanya setelah mengimaninya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bagaimana (mungkin) Allah memberi petunjuk} menuntun {suatu kaum yang ingkar setelah mereka beriman dan mengakui bahwa Rasul itu benar dan bukti-bukti yang jelas telah sampai kepada mereka?} dalil-dalil dan bukti-bukti nyata {Allah tidak memberi petunjuk kepada kaum yang zalim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "86-88. Maksudnya, bahwa sangatlah tidak mungkin Allah memberikan petunjukNya kepada suatu kaum yang telah mengenal keimanan, lalu masuk ke dalamnya dan bersaksi bahwasanya Rasul itu adalah haq kemudian mereka keluar kembali kepada kondisi mereka dahulu, berbalik dan berkhianat; karena mereka telah mengetahui kebenaran lalu mereka menolaknya. Dan karena kondisi seperti itulah yang menyebabkan Allah menghukum mereka dengan terjerembab kembali dan terbaliknya hati mereka sebagai suatu balasan buat mereka, di mana mereka telah mengetahui kebenaran namun meninggalkannya, dan kebatilan namun lebih memilihnya, hingga Allah memalingkannya kepada apa yang dia sendiri memalingkan dirinya kepadanya. Mereka itulah yang mana, “laknat Allah ditimpakan kepada mereka, (demikian pula) laknat para malaikat dan manusia seluruhnya.” Mereka kekal dalam laknat dan azab tersebut. “Tidak diringankan siksa dari mereka, dan tidak (pula) mereka ditangguhkan,” karena telah datang ketentuan Allah, karena Allah telah memanjangkan usia mereka di mana mereka mengingat apa yang harus diingat dan telah datang kepada mereka seorang pemberi peringatan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 86: Bagaimanakah Allah akan memberi petunjuk ke.pada satu kaum yang kufur sesudah beriman,serta sudah mengaku bahwa Rasul itu benar, dan telah datang keterangan-keterangan kepada mereka? Dan Allah tidak akan memberi petunjuk kepada kaum yang zhalim."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ibnu Jarir meriwayatkan dari Ibnu Abbas ia berkata: Ada seorang Anshar yang masuk Islam, lalu murtad dan melakukan kemusyrikan lagi, kemudian ia menyesal, maka ia mengirim seseorang kepada kaumnya yang isinya menyuruh kaumnya mengirimkan seseorang kepada Rasulullah shallallahu 'alaihi wa sallam, memberitahukan apakah masih diterima tobatnya? Maka turunlah ayat, \"Kaifa yahdillahu qauman….dst. sampai ayat 89. (Hadits ini para perawinya adalah para perawi kitab shahih, Ibnu Jarir menyebutkan hadits tersebut secara mursal dan maushul, dan diriwayatkan oleh Ibnu Hibban dalam Shahihnya, Thahawi dalam Musykilul Atsar, dan Hakim. Hakim berkata, \"Shahih isnadnya, namun keduanya (Bukhari dan Muslim) tidak meriwayatkan,\" dan didiamkan oleh Adz Dzahabi.) Yakni termasuk hal yang ba'id (jauh), tidak mungkin dsb. Mereka adalah orang-orang zhalim, meninggalkan yang hak setelah mengetahuinya, mengikuti yang batil padahal mereka mengetahui kebatilannya karena zhalim dan mengikuti hawa nafsu. Mereka ini, tidak mungkin diberi taufiq untuk mengikuti hidayah. Hal itu, karena orang yang diharapkan mendapat petunjuk adalah orang yang tidak mengetahui yang hak, namun dia ingin mencariinya. Terhadap orang ini, Allah akan memudahkan sebab-sebab memperoleh hidayah dan menjaganya dari sebab-sebab kesesatan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 86",
    "description": "Setelah ayat sebelumnya menerangkan sikap penolakan yahudi terhadap kebenaran nabi Muhammad dan agama islam, maka ayat ini menerangkan bahwa sikap tersebut mengakibatkan mereka tidak memperoleh hidayah. Bagaimana mungkin Allah akan memberi petunjuk kepada suatu kaum yang kafir setelah mereka melihat bukti-bukti kebenaran yang memungkinkan mereka beriman, serta mengakui bahwa rasul, Muhammad, itu benar-benar rasul, dan disertai bukti-bukti yang jelas tentang hal itu, telah sampai kepada mereka seperti Al-Qur'an dan kitab-kitab suci lainnya yang menginformasikan tentang kebenaran Muhammad sebagai nabi terakhir' sungguh, sikap semacam itu adalah wujud kezaliman, dan Allah tidak memberi petunjuk kepada orang zalim yaitu orang yang tahu kebenaran tetapi melanggar dan mengingkarinya, bahkan menentangnya. Jika mereka tetap kafir dan tidak mau bertobat, maka mereka itu, balasannya ialah ditimpa laknat Allah, yakni dijauhkan dari rahmat-Nya. Selama mereka mendapat laknat Allah, maka para malaikat akan berulang-ulang melaknatnya, dan bahkan manusia seluruhnya juga melaknatnya, yakni melihatnya dengan pandangan hina."
  }
]