[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka akan menetap di neraka, tidak akan diangkat dari mereka siksaan walau sedikit untuk mereka bisa beristirahat, dan tidak akan diakhirkan dari mereka kerena permohonan yang mereka ajukan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "88. Mereka kekal di dalam neraka, tidak akan keluar darinya, dan tidak akan diringankan siksanya. Dan mereka tidak akan diberi tenggang waktu untuk bertaubat maupun meminta maaf."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "88. وَلَا هُمْ يُنظَرُونَ ( dan tidak (pula) mereka diberi tangguh) Yakni tidak diakhirkan dan tidak ditunda-tunda. Kemudian Allah mengecualikan orang-orang yang bertaubat dengan firman-Nya -di ayat setelahnya-"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "88 Mereka kekal di dalam neraka selamanya, tidak diringankan siksa mereka, dan tidak pula mereka diberi waktu penangguhan untuk bertaubat atau meminta ampunan. Kemudian orang yang bertaubat mendapatkan pengecualian dalam ayat selanjutnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka kekal di dalamnya. Tidak akan diringankan azab dari mereka, dan mereka tidak diberi penangguhan} diberi tenggang waktu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "86-88. Maksudnya, bahwa sangatlah tidak mungkin Allah memberikan petunjukNya kepada suatu kaum yang telah mengenal keimanan, lalu masuk ke dalamnya dan bersaksi bahwasanya Rasul itu adalah haq kemudian mereka keluar kembali kepada kondisi mereka dahulu, berbalik dan berkhianat; karena mereka telah mengetahui kebenaran lalu mereka menolaknya. Dan karena kondisi seperti itulah yang menyebabkan Allah menghukum mereka dengan terjerembab kembali dan terbaliknya hati mereka sebagai suatu balasan buat mereka, di mana mereka telah mengetahui kebenaran namun meninggalkannya, dan kebatilan namun lebih memilihnya, hingga Allah memalingkannya kepada apa yang dia sendiri memalingkan dirinya kepadanya. Mereka itulah yang mana, “laknat Allah ditimpakan kepada mereka, (demikian pula) laknat para malaikat dan manusia seluruhnya.” Mereka kekal dalam laknat dan azab tersebut. “Tidak diringankan siksa dari mereka, dan tidak (pula) mereka ditangguhkan,” karena telah datang ketentuan Allah, karena Allah telah memanjangkan usia mereka di mana mereka mengingat apa yang harus diingat dan telah datang kepada mereka seorang pemberi peringatan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 88: Padahal mereka akan kekal padanya, tidak akan diringan kan adzab dari mereka, dan tidak pula mereka diberi tempo."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Di dalam laknat atau neraka. Baik dengan dihilangkan sejenak azab itu, maupun dihilangkan sebagian azab itu. Hal itu, karena masa penangguhan sudah berlalu, yaitu dunia. Allah telah memberikan udzur mereka dan memanjangkan umurnya di mana seharusnya orang yang berpikir sadar. Jika seandainya dalam diri mereka terdapat kebaikan, tentu akan ditemukan. Dan sekiranya mereka dikembalikan ke dunia, niscaya mereka akan mengulangi perbuatan yang dilarang itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 88",
    "description": "Sementara di akhirat, mereka akan dimasukkan ke dalam neraka dan kekal di dalamnya. Mereka juga tidak akan diringankan azabnya, dan mereka tidak diberi penangguhan sedikit pun yang memungkinkan mereka mengajukan alasan. Mereka akan tetap terlaknat, kecuali orang-orang yang bertobat setelah itu, dengan menghentikan sama sekali perilaku kafirnya, dan melakukan perbaikan, yaitu menghilangkan hal-hal yang bisa merusak akidah dan amal perbuatannya, maka sungguh, Allah akan menerima tobatnya, karena dia maha pengampun, maha penyayang kepada semua hamba-Nya yang mau bertobat dengan tulus, dengan memenuhi tiga kriteria, yaitu menghentikan sama sekali perbuatan dosanya, menyesali perbuatannya, dan berjanji untuk tidak mengulanginya lagi."
  }
]