[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai tuhan kami, sesungguhnya kami mengakui dan bersaksi bahwa Engkau akan mengumpulkan seluruh manusia pada hari yang tidak ada keraguan sama sekali tentangnya, yaitu hari kiamat,sesungguhnya Engkau tidak memungkiri janji yang Engkau sampaikan kepada hamba-hambaMU."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Ya Rabb kami, sesungguhnya Engkau akan mengembalikan semua manusia kepada-Mu untuk memperhitungkan amal mereka pada hari yang tidak ada keraguan terhadapnya. Karena hari itu pasti akan datang, tidak mungkin tidak. Sesungguhnya Engkau -wahai Rabb kami- tidak akan ingkar janji.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. رَبَّنَآ إِنَّكَ جَامِعُ النَّاسِ (Ya Tuhan kami, sesungguhnya Engkau mengumpulkan manusia) Yakni yang membangkitkan dan menghidupkan mereka. لِيَوْمٍ ((pada) hari) Yakni pada hari kiamat untuk melakukan hisab dihari yang tak ada keraguan padanya. لَّا رَيْبَ فِيهِ ۚ ( yang tak ada keraguan padanya) Yakni yang tidak ada keraguan atas kejadiannya dan kejadian yang ada didalamnya seperti hisab dan pembalasan. Yakni memenuhi janji bagi tuhan adalah sesuatu yang tidak ada keraguan didalamnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9. Wahai Tuhan Kami, Sesungguhnya Engkau akan mengumpulkan, membangkitkan, dan menghidupkan manusia untuk dibalas pada hari dimana tiada keraguan di dalamnya, yaitu hari kiamat. Sesungguhnya Allah tidak akan mengingkari janjiNya untuk membangkitkan dan menghisab."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai Tuhan kami, sesungguhnya Engkaulah yang mengumpulkan manusia pada hari yang tidak ada keraguan di dalamnya.”} tidak ada keraguan tentangnya {Sesungguhnya Allah tidak mungkin mengingkari janji"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9. Ayat ini adalah penyempurna perkataan orang-orang yang mendalam ilmunya, yaitu mengandung kepercayaan terhadap kebangkitan, pembalasan dan keyakinan yang sempurna, dan bahwasanya Allah pasti menunaikan janjiNya. Dan itu semua mengharuskan adanya amal dan persiapan untuk menghadapi hari tersebut, karena beriman kepada Hari Kebangkitan adalah asas dari kebaikan hati, dasar dari keinginan kepada kebaikan dan kekhawatiran dari kejahatan, di mana kedua hal itu adalah pondasi dari segala kebajikan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 9: \"Hai Tuhan kami! Sesungguhnya Engkaulah Pengumpul manusia di hari yang tidak ada syak padanya , sesungguhnya Allah itu tidak menyalahi janji."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Tujuan dari do'a ini adalah menjelaskan bahwa hati mereka tertuju kepada akhirat. Oleh karena itu, mereka meminta keteguhan di atas hidayah agar memperoleh pahalanya. Pada beberapa ayat di atas, Allah Subhaanahu wa Ta'aala memuji orang-orang yang ilmunya mendalam dengan tujuh sifat yang merupakan tanda kebahagiaan: 1. Ilmu, sebagai sarana yang menyampaikan mereka kepada Allah. 2. Ilmunya yang mendalam. 3. Beriman kepada semua kitab dan mengembalikan ayat yang mutasyabihat kepada ayat yang muhkamat. 4. Meminta kepada Allah ampunan dan keselamatan dari musibah yang menimpa orang-orang yang tersesat. 5. Mereka mengakui nikmat hidayah yang diberikan Allah. 6. Mereka meminta kepada Allah rahmat-Nya yang mengandung keberhasilan memperoleh kebaikan dan terhindar dari keburukan. Mereka bertawassul dengan nama-Nya Al Wahhab. 7. Keimanan dan keyakinan mereka yang mendalam kepada hari kiamat dan rasa takut mereka kepada hari itu sehingga membuahkan amal."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 9",
    "description": "Mereka tidak hanya mengajukan permohonan yang berkaitan dengan kehidupan di dunia, tetapi juga menegaskan keyakinan tentang keniscayaan hari akhir. Ya tuhan kami, engkaulah yang mengumpulkan manusia pada hari yang tidak ada keraguan padanya, yaitu pada hari kiamat. Sungguh, Allah tidak menyalahi janji. Sesungguhnya orang-orang yang kafir, yang menutupi tanda-tanda keesaan dan kebesaran Allah serta mengingkari petunjuk-petunjuknya, bagi mereka tidak akan berguna sedikit pun harta benda yang Allah berikan kepada mereka walau sebanyak apa pun, dan demikian pula anak-anak mereka walau sebanyak dan sehebat apa pun, terhadap azab Allah di dunia. Mereka juga tidak dapat menolak siksa-Nya di akhirat kelak, dan bahkan mereka itu menjadi bahan bakar api neraka."
  }
]