[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang kafir setelah keimanan mereka dan mereka terus menerus diatas kekufuran sampai mati, tidak akan diterima taubat mereka ketika kematian datang, dan mereka adalah orang-orang yang tersesat jalan, maka mereka menyalahi manhaj Nya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "90. Sesungguhnya orang-orang yang kafir sesudah beriman dan larut dalam kekafirannya sampai mereka melihat kematian, maka taubat mereka tidak akan diterima ketika maut datang menjemput, karena kesempatannya sudah habis. Mereka itulah orang-orang yang tersesat dari jalan yang lurus menuju Allah -Ta'ālā-."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "90-91. Allah mengancam orang-orang yang murtad kemudian kekafirannya bertambah dengan memusuhi orang-orang beriman, bahwa Allah tidak akan menerima taubatnya, sebab mereka telah sesat dan bersikeras dalam kesesatannya. Demikian pula dengan orang yang mengingkari kenabian Muhammad dan mati dalam keadaan tersebut, Allah tidak akan menerima dari mereka emas sepenuh bumi untuk menebus diri mereka dari azab; mereka akan mendapat azab yang pedih, dan mereka tidak akan mendapat penolong yang dapat membebaskan mereka darinya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "90. ثُمَّ ازْدَادُوا۟ كُفْرًا ( kemudian bertambah kekafirannya) Yakni dengan keteguhannya dalam kekafiran dan bertambahnya tipu daya mereka atas Islam dan pemeluknya. Dan pendapat lain mengatakan ayat ini untuk orang-orang Yahudi yang kafir terhadap Nabi Isa, dan ketika datang kepada mereka Nabi Muhammad mereka kafir terhadapnya pula. لَّن تُقْبَلَ تَوْبَتُهُمْ ( sekali-kali tidak akan diterima taubatnya) Yakni ketika kematiannya. Sebagaimana firman Allah: وَلَيْسَتِ التَّوْبَةُ لِلَّذِينَ يَعْمَلُونَ السَّيِّـَٔاتِ حَتَّىٰٓ إِذَا حَضَرَ أَحَدَهُمُ الْمَوْتُ قَالَ إِنِّى تُبْتُ الْـٰٔنَ Dan tidaklah taubat itu diterima Allah dari orang-orang yang mengerjakan kejahatan (yang) hingga apabila datang ajal kepada seseorang di antara mereka, (barulah) ia mengatakan : \"Sesungguhnya saya bertaubat sekarang\". وَأُو۟لٰٓئِكَ هُمُ الضَّآلُّونَ ( dan mereka itulah orang-orang yang sesat) Yakni orang-orang yang tidak mendapat petujuk menuju apa yang terdapat kesalamatan bagi mereka didalamnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "90 Sesungguhnya orang-orang yang kafir kepada Muhammad sesudah mereka beriman kepada sifat-sifatnya sebagaimana yang dijelaskan ayat sebelumnya, kemudian bertambah kekafirannya dengan memerangi, menyakiti dan membuat berbagai tipu daya kepada para pemeluk Islam, sekali-kali tidak akan diterima taubatnya jika mereka masih kufur atau mati dalam keadaan kufur; dan mereka itulah orang-orang yang sesat dan melampaui batas keimanan dan kebenaran dari jalan keselamatan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang yang ingkar setelah beriman, kemudian bertambah kekufurannya} mereka melanjutkan kekufurannya sehingga mereka hancur karenanya {tidak akan diterima taubatnya dan mereka itulah orang-orang sesat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "89-91. Kemudian Allah membuat pengecualian dari ancaman tersebut, yaitu orang-orang yang bertaubat dari kekufuran dan dosa-dosa mereka lalu mereka memperbaiki kekurangan-kekurangan mereka itu; maka Allah mengampuni mereka dari apa yang telah mereka lakukan dan memaafkan mereka dari segala hal yang telah lalu. Akan tetapi bagi mereka yang kufur dan tetap memilih kekufuran bertambah hingga ia meninggal dalalm kekufurannya tersebut, maka mereka itulah orang-orang yang tersesat dari jalan petunjuk dan mereka menempuh jalan kesengsaraan, dan dengan demikian mereka telah berhak mendapatkan siksaan yang pedih, dan mereka tidak memiliki penolong dari siksaan Allah walaupun mereka mengerahkan segala isi bumi berupa emas agar dapat menebus diri mereka darinya itu, tidak akan berguna bagi mereka sama sekali. Kepada Allah kita berlindung dari kekufuran dan segala macam bentuknya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 90: Sesungguhnya mereka yang kufur sesudah beriman, kemudian bertambah kufur mereka, tidak akan diterima taubat mereka; dan mereka itu ialah orang-orang yang sesat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Menurut pengarang Tafsir Al Jalaalain, ayat ini turun berkenaan dengan orang-orang Yahudi. Namun menurut riwayat Al Bazzar dari Ibnu Abbas, bahwa ayat ini turun berkenaan beberapa orang yang masuk Islam, kemudian murtad, lalu masuk Islam lagi, kemudian murtad lagi (riwayat ini isnadnya jayyid). Yakni kafir kepada Nabi Isa 'alaihis salam. Setelah beriman kepada Nabi Musa 'alaihis salam. Yakni kepada Nabi Muhammad shallallahu 'alaihi wa sallam. Yakni ketika ajal telah di kerongkongan atau ketika mereka meninggal dalam keadaan kafir. Ada pula yang mengartikan bahwa Allah tidak memberi taufiq kepada mereka untuk bertobat. Hal ini disebabkan mereka tidak beriman ketika bukti kebenaran telah datang, Allah Subhaanahu wa Ta'aala berfirman: Dan (begitu pula) Kami memalingkan hati dan penglihatan mereka seperti pertama kali mereka tidak beriman kepadanya (Al Quran), dan Kami biarkan mereka bingung dalam kesesatan. (terj. Al An'aam: 110)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 90",
    "description": "Sungguh syarat diterimanya tobat adalah terus menerus dalam keimanan, karena itu, orang-orang yang kafir setelah beriman yaitu setelah melihat bukti-bukti kebenaran, bahkan kemudian bertambah kekafirannya dengan murtad, membuat kerusakan, dan menyakiti orang-orang islam, maka mereka tidak akan diterima tobatnya, karena tidak mungkin mereka bersikap tulus dan mereka itu adalah orang-orang yang sesat serta semakin jauh dari kebenaran. Sungguh, orang-orang yang kafir dan terus-menerus dalam kekafirannya hingga mereka mati dalam kekafiran, maka tidak akan diterima tebusan dari seseorang di antara mereka sekalipun berupa emas sepenuh bumi, sekiranya dia hendak menebus diri-Nya dari azab Allah dengan harta tebusan-Nya itu. Sebab, mereka itulah orang-orang yang mendapat azab yang pedih dan tidak memperoleh penolong, karena saat itu hanya Allah yang bisa menolong. Ayat ini memberi pemahaman bahwa sebanyak apa pun infak seseorang itu tidak akan diterima jika perbuatan yang dilakukan tersebut justru akan menghapus pahala dari amal itu sendiri, seperti syirik."
  }
]