[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang yang mengingari kenabian Muhammad , dan mereka mati di atas kekufuran kepada Allah dan rosul Nya, maka tidak akan diterima dari salah sorang dari mereka pada hari kiamat emas sepenuh bumi yang mereka jadikan penebus dengan itu untuk diri nya dari siksa Allah, walaupun benar-benar terjadi menebus dirinya dengan itu. Mereka itu akan mendapatkan siksa yang pedih, dan tidak ada seorangpun bagi mereka yang menyelamatkan mereka dari siksa Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "91. Sesungguhnya orang-orang yang kafir dan mati dalam kekafiran mereka, maka tidak ada satupun dari mereka yang akan diterima darinya emas seberat bumi untuk menebus dirinya dari jeratan Neraka. Mereka itulah orang-orang yang akan mendapatkan azab yang pedih. Dan mereka tidak akan memiliki penolong yang dapat melindungi mereka dari azab di hari kiamat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "91. إِنَّ الَّذِينَ كَفَرُوا۟ وَمَاتُوا۟ وَهُمْ كُفَّارٌ ( Sesungguhnya orang-orang yang kafir dan mati sedang mereka tetap dalam kekafirannya) Yakni baik itu orang kafir asli maupun orang yang murtad. وَلَوِ افْتَدَىٰ بِهِۦٓ ۗ ( walaupun dia menebus diri dengan emas (yang sebanyak) itu) Yakni meski datang di hari kiamat dengan emas sepenuh bumi lalu diberikan kepada Allah agar selamat dari azab neraka maka itu tidak akan diterima. وَمَا لَهُم مِّن نّٰصِرِينَ ( dan sekali-kali mereka tidak memperoleh penolong) Yakni tidak ada seorang pun yang menyelamatkan mereka dari api Allah di hari kiamat. Dan dalam hadist disebutkan: didatangkan seorang lelaki dari penghuni surga, lalu Allah bertanya kepadanya: apakah kamu akan menebus dirimu dariKu dengan emas sepenuh bumi? Maka ia menjawab: Iya. Lalu Allah berfirman: kau berbohong, Aku telah mengambil janji atasmu agar tidak menyekutukan-Ku dengan sesuatu apapun tapi kamu enggan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Jika saja orang kafir membawa segala kekayaannya sebesar bumi ini; agar bisa selamat dari api neraka sungguh upaya itu tidak akan diterima dan sia-sia, sedang datang seorang muslim dari kalangan orang yang paling miskin melewati segala fitnah dunia, niscaya tempat kembalinya adalah syurga. maka apakah kita termasuk orang-orang yang mendapatkan keagungan nikmat dari Allah dengan petunjuk-Nya untuk berislam ?!"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "91 Sesungguhnya orang-orang yang kafir dan mati sedang mereka tetap dalam keadaan kafir asli ataupun kafir setelah beriman, maka tidaklah akan diterima tebusan dari mereka meskipun seisi bumi penuh dengan emas untuk menyelamatkannya dari azab neraka. Sehingga walaupun mereka pada hari itu memiliki emas seperti itu. Bagi mereka itulah siksa yang pedih pada hari kiamat dan sekali-kali mereka tidak memperoleh penolong dari azab Allah. Diterangkan dalam hadis shahih dari Bukhori Muslim: Ketika hari kiamat telah datang kepada orang-orang kafir, maka dikatakan kepada mereka: Apakah kalau kalian punya emas seisi bumi lalu kalian akan bisa terbebas dari neraka? Maka dia menjawab: Ya. Kemudian dikatakan kepada mereka: Engkau telah meminta sesuatu yang lebih mudah dari pembebasan dari azab itu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang yang ingkar dan mati sebagai orang-orang kafir tidak akan diterima dari seseorang di antara mereka sekalipun emas sepenuh bumi, sekiranya dia hendak menebus diri dengannya. Mereka itulah orang-orang yang mendapat azab yang pedih dan tidak ada penolong bagi mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "89-91. Kemudian Allah membuat pengecualian dari ancaman tersebut, yaitu orang-orang yang bertaubat dari kekufuran dan dosa-dosa mereka lalu mereka memperbaiki kekurangan-kekurangan mereka itu; maka Allah mengampuni mereka dari apa yang telah mereka lakukan dan memaafkan mereka dari segala hal yang telah lalu. Akan tetapi bagi mereka yang kufur dan tetap memilih kekufuran bertambah hingga ia meninggal dalalm kekufurannya tersebut, maka mereka itulah orang-orang yang tersesat dari jalan petunjuk dan mereka menempuh jalan kesengsaraan, dan dengan demikian mereka telah berhak mendapatkan siksaan yang pedih, dan mereka tidak memiliki penolong dari siksaan Allah walaupun mereka mengerahkan segala isi bumi berupa emas agar dapat menebus diri mereka darinya itu, tidak akan berguna bagi mereka sama sekali. Kepada Allah kita berlindung dari kekufuran dan segala macam bentuknya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 91: Sesungguhnya mereka yang kufur, lalu mati, padahal mereka tetap kafir itu, tidak akan diterima dari seseorang dari mereka emas sepenuh bumi, walaupun ia (hendak) menebus diri dengan itu. Mereka itu akan mendapat adzab yang pedih; dan mereka tidak akan mendapat pembantu-pembantu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Rasulullah shallallahu 'alaihi wa sallam bersabda: « أَنَّ اللَّهَ يَقُولُ لأَهْوَنِ أَهْلِ النَّارِ عَذَاباً : لَوْ أَنَّ لَكَ مَا فِى الأَرْضِ مِنْ شَىْءٍ كُنْتَ تَفْتَدِى بِهِ ؟ قَالَ : نَعَمْ . قَالَ : فَقَدْ سَأَلْتُكَ مَا هُوَ أَهْوَنُ مِنْ هَذَا وَأَنْتَ فِى صُلْبِ آدَمَ : أَنْ لاَ تُشْرِكَ بِى . فَأَبَيْتَ إِلاَّ الشِّرْكَ » . Allah akan berkata kepada penghuni neraka yang paling ringan siksanya, \"Bagaimana jika sekiranya kamu memiliki segala sesuatu yang ada di bumi, maukah kamu menebus dirimu denganya?\" Ia menjawab, \"Ya\", Allah berfirman, \"Sesungguhnya Aku telah menawarkan kepadamu yang lebih ringan dari itu ketika kamu dalam tulang shulbi Adam, yaitu agar kamu tidak menyekutukan Aku, namun kamu menolaknya dan malah berbuat syirk.\" (HR. Bukhari)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 91",
    "description": "Sungguh, orang-orang yang kafir dan terus-menerus dalam kekafirannya hingga mereka mati dalam kekafiran, maka tidak akan diterima tebusan dari seseorang di antara mereka sekalipun berupa emas sepenuh bumi, sekiranya dia hendak menebus diri-Nya dari azab Allah dengan harta tebusan-Nya itu. Sebab, mereka itulah orang-orang yang mendapat azab yang pedih dan tidak memperoleh penolong, karena saat itu hanya Allah yang bisa menolong. Ayat ini memberi pemahaman bahwa sebanyak apa pun infak seseorang itu tidak akan diterima jika perbuatan yang dilakukan tersebut justru akan menghapus pahala dari amal itu sendiri, seperti syirik pada ayat sebelumnya dijelaskan bahwa orang yang meninggal dalam kekufuran, maka sebesar apa pun harta dan infak yang mereka keluarkan, tidak akan bisa dijadikan tebusan agar mereka bebas dari azab Allah. Pada ayat ini dijelaskan tentang harta dan infak yang bermanfaat hendaknya harta yang dicintai, karena kamu tidak akan memperoleh kebajikan yang paling utama dan sempurna sebelum kamu menginfakkan, dengan cara yang baik dan tujuan yang benar, sebagian harta yang kamu cintai, yang paling bagus dari apa yang kamu miliki. Dan apa pun yang kamu infakkan, tentang hal itu sungguh, Allah maha mengetahui niat dan tujuan kamu berinfak, apakah karena ingin dipuji atau dilihat orang (riya'), ingin dipuji orang yang mendengar (sum'ah), atau semata-mata karena Allah. Jika infak dilaksanakan hanya karena Allah maka Allah akan membalasnya dengan kebaikan di dunia maupun akhirat."
  }
]