[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Seluruh makanan yang baik-baik, hukumnya halal bagi anak keturunan Ya’kub , kecuali apa yang diharamkan sendiri oleh Ya’kub atas dirinya karena penyakit yang menimpanya. Dan itu terjadi sebelum turunnya taurat. Kemudian setelah turunnya taurat, Allah mengharamkan atas Bani Israil beberapa jenis makanan yang sebelumnya halal bagi mereka, hal itu disebabkan oleh perbuatan zhalim dan sikap mereka yang melampaui batas. Katakanlah kepada mereka (wahai Rasul), “Datangkanlah taurat ke sini dan bacakanlah apa yang dikandungannya, bila kalian orang-orang yang benar dalam pengakuan kalian bahwa sesungguhnya Allah itu menurunkan ayat tentang pengharaman hal-hal yang diharamkan oleh Ya’kub atas dirinya sendiri, sehingga kalian mengetahui kebenaran yang dibawa Al-quran bahwa Allah tidak mengharamkan atas Bani Israil sesuatu pun sebelum turunnya taurat, kecuali apa yang diharamkan sendiri oleh Ya’kkub atas dirinya tersebut.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "93. Dahulu, semua makanan yang baik adalah halal bagi Bani Israil. Tidak ada makanan yang diharamkan kecuali yang diharamkan oleh Ya'qūb (Israil) atas dirinya sendiri sebelum kitab Taurat diturunkan, tidak seperti anggapan orang-orang Yahudi yang mengklaim bahwa pengharaman itu terdapat di dalam Kitab Taurat. Katakanlah -wahai Nabi- kepada mereka, “Datangkanlah kitab Taurat dan bacalah, jika kalian benar terkait klaim kalian itu.” Mereka semua bungkam dan tidak mau mendatangkan Taurat. Ini adalah contoh yang menunjukkan kebohongan yang dibuat oleh orang-orang Yahudi atas nama Taurat dan bagaimana mereka melakukan perubahan terhadap isi kandungan kitab Taurat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "93. Dahulu semua makanan halal bagi keturunan nabi Ya’qub kecuali apa yang diharamkan Ya’qub sendiri atas dirinya seperti daging unta dan susunya; ia bernazar untuk tidak memakannya ketika terkena penyakit, sebelum Taurat diturunkan kepada Musa. Kemudian keturunan Ya’qub mengharamkannya pula karena mengikuti bapak mereka. Maka Allah memerintahkan nabi Muhammad untuk membantah mereka: “Datangkanlah Taurat kemudian bacalah, jika kalian benar dalam anggapan kalian mengenai pengharaman daging dan susu unta.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "93. إِلَّا مَا حَرَّمَ إِسْرٰٓءِيلُ عَلَىٰ نَفْسِهِۦ (melainkan makanan yang diharamkan oleh Israil (Ya’qub) untuk dirinya sendiri) Ada pendapat mengatakan bahwa Nbi Ya’kub mengharamkan atas dirinya daging dan susu unta. Dan pendapat lain mengatakan bahwa ia mengaharamkan segala daging hewan yang memiliki urat pembuluh darah. من قبل أن تنزل التوراة (sebelum diturukannya Taurat) Yakni sebelum diturunkan dalam Taurat pengharaman apa yang apa yang diharamkannya makanan-makanan yang baik atas mereka dikarenakan kezaliman mereka. قُلْ فَأْتُوا۟ بِالتَّوْرَىٰةِ فَاتْلُوهَآ إِن كُنتُمْ صٰدِقِينَ (Katakanlah: “maka bawalah Taurat itu, lalu bacalah dia jika kamu orang-orang yang benar”) Yakni sampai kalian menyadari kebenaran apa yang dikisahkan Allah dalam Al-Qur’an bahwa Ya’qub tidak mengharamkan sesuatupun atas Bani Israil sebelum turunnya Taurat kecuali apa yang Ya’qub haramkan atas dirinya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "93 Semua makanan halal bagi Bani Israil, kecuali makanan yang diharamkan oleh Israil yaitu Nabi Ya’qub bin Ishaq untuk dirinya sendiri, ketika ia sakit. Kemudian ia bernadzar jika Allah memberi ampunan kepadanya maka ia bernadzar tidak akan memakan daging unta juga tidak akan meminum susu unta, sebelum Taurat diturunkan kepada Musa. Katakanlah wahai Nabi: “Jika kamu memang benar mengatakan ada makanan yang diharamkan sebelum turun Taurat, maka bawalah Taurat itu, lalu bacalah dia jika kamu orang-orang yang benar atas klaim kalian bahwa daging unta dan susunya itu diharamkan dalam syariat kalian.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Setiap makanan halal} halal {bagi Bani Israil, kecuali makanan yang diharamkan oleh Israil} Ya‘qub AS {atas dirinya sebelum Taurat diturunkan. Katakanlah (Nabi Muhammad), “Bawalah Taurat lalu bacalah, jika kalian orang-orang yang benar”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "93-94. Dari sejumlah perkara yang dituduhkan oleh kaum yahudi sebagai suatu masalah dalam kenabian Nabi Isa dan Nabi Muhammad, yaitu mereka meyakini bahwasanya nasakh itu bathil, dan bahwa seorang nabi yang akan datang tidaklah mungkin menyalahi Nabi sebelumnya. Maka Allah mendustakan mereka dengan suatu perkara yang mereka ketahui, yaitu bahwa mereka mengetahui semua makanan sebalum turunya Taurat adalah halal bagi bani israil kecuali beberapa jenis saja yang di haramkan oleh Isra’il (Nabi Ya’kub) atas dirinya dan hal itu ia lakukan karena suatu penyakit yang di deritanya. Kemudian dalam Taurat ada beberapa perkara yang di haramkan yang menasakh apa yang sebelumnya halal, dan hal ini banyak terjadi. Katakan kepada mereka apabila mereka mengingkari hal itu, ”maka bawalah taurat itu, lalu bacalah ia jika kamu orang-orangyang benar” dengan keyakinan kalian bahwa tidak ada nasakh, tidak pula ada penghalalan dan pengaharaman. Ini merupakan hujjah yang paling tegas yakni seseorang digugat dengan sesuatu yang ia ketahui sendiri dan tidak ia ingkari. Apabila ia patuh terhadap kebenaran itu, maka itulah yang seharusnya terjadi, namun apabila ia enggan dan tidak patuh setelah keterangan tersebut, maka jelaslah kebohongan, fitnah, kezhaliman bathilnya apa yang ia yakini dan itulah realita kaum Yahudi."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 93: Semua makanan dahulunya adalah halal bagi Bani Israil, kecuali apa-apa yang Israil haramkan (sendiri) atas dirinya sebelum diturunkan Tarat. Katakan: \"Kalau begitu,) bawalah Taurat dan bacalah akan dia, jika memang kamu itu orang-orang yang benar,\""
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dalam tafsir Al Jalalain diterangkan, bahwa ayat ini turun ketika orang-orang Yahudi berkata, \"Sesungguhnya kamu mengaku berada di atas agama Nabi Ibrahim, padahal ia tidak memakan daging unta dan susunya.\" Syaikh As Sa'diy dalam Tafsirnya menerangkan, bahwa ayat ini merupakan bantahan terhadap orang-orang Yahudi yang menyangka bahwa penghapusan hukum tidak boleh terjadi, oleh karenanya mereka kafir kepada Nabi Isa 'alaihis salam dan Nabi Muhammad shallallahu 'alaihi wa sallam, di mana keduanya datang dengan membawa hukum yang sebagiannya berbeda dengan hukum yang ada pada Taurat dalam hal yang halal dan yang haram. Yaitu daging unta dan susunya karena nadzarnya ketika ia menderita sakit 'irqun nasaa (semacam encok), di mana apabila ia sembuh, niscaya ia tidak akan memakan makanan yang paling disukainya, yaitu daging unta, demikian pula susunya. Kemudian keturunan Nabi Ya'qub pun mengikutinya, dan hal itu terjadi sebelum Taurat diturunkan. Yakni setelah Nabi Ibrahim 'alaihis salam, namun pada masa Beliau makanan tersebut tidak diharamkan. Setelah Taurat diturunkan, ada beberapa makanan yang diharamkan bagi mereka sebagai hukuman. Nama-nama makanan itu disebut di dalamnya. Selanjutnya lihat surat An Nisa' ayat 160 dan surat Al An'aam ayat 146."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 93",
    "description": "Setelah ayat sebelumnya Allah menjelaskan harta dan infak yang bermanfaat, maka pada ayat ini Allah menjelaskan makanan yang halal atau haram bagi bani israil. Semua makanan itu pada dasarnya halal bagi bani israil sebagaimana halal juga bagi selain mereka, kecuali makanan yang diharamkan oleh israil (yakub) atas dirinya sendiri sebelum taurat diturunkan dalam rangka meraih kebajikan dan mendekatkan diri kepada Allah. Makanan tersebut adalah daging dan susu unta. Ada satu riwayat menyebutkan bahwa nabi yakub pernah sakit dan bernazar kalau Allah memberinya kesembuhan, maka dia tidak akan makan daging unta dan tidak minum susunya, meskipun kedua makanan tersebut sangat disukainya. Pengharaman nabi yakub atas kedua jenis makanan tersebut lalu diikuti oleh keturunannya. Setelah taurat diturunkan ada beberapa makanan yang diharamkan bagi mereka sebagai hukuman atas pelanggaran yang mereka lakukan (lihat: surah an-nisa''/4: 160 dan al-ana'm/6: 146), tetapi kaum yahudi membuat kebohongan dengan mengatakan bahwa ada makanan yang diharamkan Allah untuk mereka sebelum kitab taurat diturunkan. Oleh karena itu Allah menjawab, katakanlah, wahai nabi Muhammad, jika kamu berkata demikian, maka bawalah taurat lalu bacalah, dan tunjukkan kepada kami keterangan taurat tentang pengharaman makanan itu jika kamu orang-orang yang benar. Ternyata tidak seorang pun di antara mereka mampu menunjukkkan ayat taurat yang mendukung kebohongan mereka karena tidak seorang pun dari mereka mampu menunjukkan dalil atau ayat taurat tentang pengharaman makanan sebagaimana yang mereka katakan, maka jelas bahwa mereka berbohong, dan barang siapa mengada-adakan kebohongan terhadap Allah menyangkut makanan atau hal lainnya setelah datang penjelasan tentang itu, maka mereka itulah orang-orang zalim. Mereka itulah orang-orang yang jauh dari kebenaran dan akan mendapat siksaan yang pedih akibat kezaliman tersebut."
  }
]