[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka barang siapa yang berdusta atas Nama Allah setelah membaca taurat dan jelasnya kebenaran, maka mereka itu adalah orang-orang zhalim yang mengatakan kebatilan atas Nama Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "94. Barangsiapa membuat kebohongan atas nama Allah setelah adanya hujjah yang nyata, bahwa apa yang diharamkan oleh Ya'qūb (Israil) itu semata-mata dia haramkan atas dirinya sendiri, tanpa ada pengharaman dari Allah, maka mereka itulah orang-orang yang menganiaya diri mereka sendiri. Karena mereka telah meninggalkan kebenaran setelah adanya hujjah yang nyata bagi kebenaran tersebut."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "94. Barangsiapa yang membuat kedustaan terhadap Allah setelah penjelasan tentang kebenaran dalam Taurat maka mereka adalah orang-orang yang jauh dari rahmat Allah dan menjadi orang-orang yang zalim akibat perkataan batil mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "94. فَمَنِ افْتَرَىٰ عَلَى اللهِ الْكَذِبَ مِنۢ بَعْدِ ذٰلِكَ (Maka barangsiapa mengada-adakan dusta terhadap Allah sesudah itu) Yakni sesudah didatangkannya dan dibacakannya Taurat, atau sesudah tantangan untuk mereka untuk mendatangkan dalil dari kitab mereka. فَأُو۟لٰٓئِكَ هُمُ الظّٰلِمُون (maka merekalah orang-orang yang zalim) Yakni tidak ada orang yang lebih zalim daripada orang yang diajak untuk merujuk pada kitab mereka dan apa yang mereka yakini dari syariat mereka yang benar kemudian mereka membantah setelah itu karena mengada-adakan kedustaan terhadap Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "94 Maka barangsiapa mengada-adakan dusta terhadap Allah sesudah membaca Taurat dan menelaahnya, maka merekalah orang-orang yang zalim atas diri mereka sendiri, sebab mereka membantah dengan sesuatu yang keliru"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka siapa saja yang mengada-adakan kebohongan terhadap Allah setelah itu, mereka itulah orang-orang zalim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "93-94. Dari sejumlah perkara yang dituduhkan oleh kaum yahudi sebagai suatu masalah dalam kenabian Nabi Isa dan Nabi Muhammad, yaitu mereka meyakini bahwasanya nasakh itu bathil, dan bahwa seorang nabi yang akan datang tidaklah mungkin menyalahi Nabi sebelumnya. Maka Allah mendustakan mereka dengan suatu perkara yang mereka ketahui, yaitu bahwa mereka mengetahui semua makanan sebalum turunya Taurat adalah halal bagi bani israil kecuali beberapa jenis saja yang di haramkan oleh Isra’il (Nabi Ya’kub) atas dirinya dan hal itu ia lakukan karena suatu penyakit yang di deritanya. Kemudian dalam Taurat ada beberapa perkara yang di haramkan yang menasakh apa yang sebelumnya halal, dan hal ini banyak terjadi. Katakan kepada mereka apabila mereka mengingkari hal itu, ”maka bawalah taurat itu, lalu bacalah ia jika kamu orang-orangyang benar” dengan keyakinan kalian bahwa tidak ada nasakh, tidak pula ada penghalalan dan pengaharaman. Ini merupakan hujjah yang paling tegas yakni seseorang digugat dengan sesuatu yang ia ketahui sendiri dan tidak ia ingkari. Apabila ia patuh terhadap kebenaran itu, maka itulah yang seharusnya terjadi, namun apabila ia enggan dan tidak patuh setelah keterangan tersebut, maka jelaslah kebohongan, fitnah, kezhaliman bathilnya apa yang ia yakini dan itulah realita kaum Yahudi."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 94: Oleh sebab itu, barangsiapa berdusta atas nama Allah sesudah demikian,) maka mereka itu ialah orang-orang yang zhalim."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dusta terhadap Allah ialah dengan mengatakan bahwa sebelum Taurat diturunkan, Allah telah mengharamkan beberapa makanan kepada Bani Israil. Yakni setelah jelas hujjah, bahwa pengharaman tersebut hanya dari diri Nabi Ya'qub 'alaihis salam saja, tidak dari masa Nabi Ibrahim 'alaihis salam. Kezaliman apa yang lebih besar daripada kezaliman orang yang diajak untuk menggunakan kitabnya, lalu menolaknya dengan sombong dan bersikeras di atas pendiriannya. Ayat ini termasuk bukti kebenaran kenabian Muhammad shallallahu 'alaihi wa sallam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 94",
    "description": "Karena tidak seorang pun dari mereka mampu menunjukkan dalil atau ayat taurat tentang pengharaman makanan sebagaimana yang mereka katakan, maka jelas bahwa mereka berbohong, dan barang siapa mengada-adakan kebohongan terhadap Allah menyangkut makanan atau hal lainnya setelah datang penjelasan tentang itu, maka mereka itulah orang-orang zalim. Mereka itulah orang-orang yang jauh dari kebenaran dan akan mendapat siksaan yang pedih akibat kezaliman tersebutsetelah nyata kebohongan orang-orang yahudi, maka Allah memerintahkan kepada nabi Muhammad, katakanlah, benarlah segala yang difirmankan Allah dan ketetapan-Nya tentang makanan. Maka ikutilah agama ibrahim yang lurus, yaitu penyerahan diri kepada Allah secara tulus tanpa sedikit pun keraguan, dan tidak menyekutukan Allah dengan apa pun dan siapa pun, karena dia, ibrahim, tidaklah termasuk orang musyrik. Dia sangat dihormati orang yahudi dan nasrani dan dia pantas menjadi teladan umat manusia."
  }
]