[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": ". Sesungguhnya rumah pertama yang dibangun untuk peribadahan kepada Allah di muka bumi ialah Baitullah Al- Haram yang berada di Makkah. Rumah ini rumah penuh berkah, di mana kebaikan dilipatgandakan di dalamnya dan limpahan rahmat turun di sana. Dan dalam menghadap kepadanya ketika shalat dan mendatanginya untuk pelaksanaan haji dan umrah terdapat kebaikan dan hidayah bagi manusia seseluruhnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "96. Sesungguhnya rumah pertama yang dibangun di muka bumi untuk seluruh umat manusia sebagai tempat beribadah kepada Allah ialah Baitullah (Kakbah) yang ada di Makkah. Itu adalah rumah yang diberkahi, memiliki banyak manfaat dari segi agama dan duniawi, dan mengandung petunjuk bagi segenap alam semesta."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "96-97. Allah mengabarkan keagungan Baitul Haram, ia adalah bangunan pertama yng dibangun di bumi untuk beribadah kepada Allah yang terletak di Makkah, di sana terdapat keberkahan dan hidayah bagi seluruh manusia dan terdapat pula tanda-tanda kekuasaan Allah, diantaranya adalah maqam Ibrahim -yaitu batu yang digunakan Ibrahim untuk berpijak saat membangun Ka’bah, dan di sana terdapat keamanan, barangsiapa yang masuk maka dirinya akan aman. Allah mewajibkan orang yang mampu berhaji untuk melaksanakannya, dan barangsiapa yang mengingkari kewajiban haji maka sungguh Allah tidak membutuhkannya dan tidak membutuhkan seluruh manusia. Abu Dzar berkata, aku pernah bertanya kepada Rasulullah: “Hai Rasulullah, masjid apa yang didirikan pertama kali?” Beliau menjawab: “Masjidil Haram”. Aku bertanya lagi: “Kemudian masjid apa?” Beliau menjawab: “Masjidil Aqsha”. Aku bertanya: “berapa lama selisih waktu antara pembangunan keduanya?” Beliau menjawab: “empat puluh”. Dan beliau menambahkan: “Dimanapun kamu memasuki waktu shalat, maka shalatlah. Dan bumi seluruhnya adalah masjid.” (Shahih 6/458 no. 3425, kitab hadits-hadits para nabi, bab firman Allah {ووهبنا لداود سليمان})."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "96. إِنَّ أَوَّلَ بَيْتٍ وُضِعَ لِلنَّاسِ (Sesungguhnya rumah yang mula-mula dibangun untuk manusia) Yakni untuk beribadah kepada Allah di atas muka bumi. لَلَّذِى بِبَكَّةَ(ialah Baitullah yang di Bakkah (Mekah)) Yakni Baitullah Ka’bah. Allah mengisyaratkan bahwa Ka’bah adalah tempat ibadah yang pertama kali dibangun yang menjadikan itu adalah tempat paling mulia daripada yang lain, dan yang pertama kali yang membangunnya adalah Nabi Ibrahim. Adapun maksud dari Bakkah yakni kota Makkah. مُبَارَكًا(yang diberkahi) Makna (البركة) disini adalah kebaikan yang banyak yang dapat didapatkan oleh orang yang bermukim didalamnya atau yang menziarahinya yang disebabkan oleh banyaknya kebaikan yang dikumpulkan padanya dan disebabkan pahala yang dilipat gandakan. وَهُدًى لِّلْعٰلَمِينَ(dan menjadi petunjuk bagi semua manusia) Hal ini bisa jadi karena didalamnya didirikan ketauhidan untuk Allah, dan penyebutan untuk-Nya dalam masya’ir-masya’ir, dan penghidupan sunnah dua kekasih-Nya, Nabi Muhammad dan Nabi Ibrahim."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "96 Sesungguhnya rumah pertama yang dibangun untuk tempat beribadah kepada Allah di bumi adalah yang dibangun oleh Ibrahim di Bakkah (Makkah) yaitu Ka’bah yang diberkahi dan menjadi petunjuk bagi semua manusia sebagai kiblat dan pusat pengesaan Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya rumah ibadah pertama yang dibangun} dibangun {untuk manusia adalah yang di Bakkah} Mekkah {yang diberkahi dan menjadi petunjuk bagi seluruh alam"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "96-97. Allah memberitakan tentang keagungan Baitul Al-Haram, bahwa itu adalah rumah yang pertama di bangun oleh Allah di bumi untuk beribadah kepadanya dan menegakan dzikr kepadaNya. Di dalamnya ada keberkahan, berbagai bentuk hidayah, berbagai macam kemaslahatan dan manfaat yang begitu besar untuk alam semesta dan keutamaan yang melimpah. Di sana juga ada tanda-tanda yang jelas yang mengingatkan kepada maqam-maqam Ibrahim al-khilal dan perpindahanya dalam melaksanakan haji dan setelahnya, mengingatkan kepada maqam-maqam penghulu para rasul dan pemimpin mereka, dan padanya ada ketenangan dimana bila seseorang memasukinya, niscaya akan merasa aman lagi tentram, serta beriman secara syariat maupun agama. Ketika Baitulah al-haram mengandung segala kebaikan yang di sebut secara umum ini dan akan banyak perincian-perinciannya, maka Allah mewajibkan para hamba yang mukalaf yang mampu melakukan perjalanan kepdanya untuk menunaikan haji. yaitu orang-orang yang mampu sampai ke Baitulah dengan mengendarai kendaraan apa pun yang sesuai denganya dan perbekalan yang harus disiapkannya. Karena itulah Allah berfirman dengan lafadz tersebut yang memungkinkannya untuk mengendarai segala bentuk kendaraan yang modern yang akan muncul di kemudian hari. Inilah ayat-ayat Al-Qur’an, dimana hukum-hukumya relavan untuk setiap waktu dan kondisi yang mana tanpanya suatu perkara tidak akan baik secara sempurna. Barang siapa yang tunduk patuh kepadanya dan menunaikanya, maka dia termasuk di antara orang-orang yang diberi petunjuk lagi beriman. Dan barang siapa yang ingkar terhadapnya dan tidak menuaikan haji ke Baitulah, maka dia telah keluar dari agama. ”dan barang siapa yang mengingkari kewajiban haji, maka sesungguhnya Allah Maha Kaya (tidak memerlukan sesuatu) dari semesta alam.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 96: Sesungguhnya pertama rumah yang didirikan untuk (ibadat) manusia ialah yang di Bakkah) sebagai (rumah) yang berkat dan petunjuk bagi manusia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini turun ketika Ahli Kitab mengatakan, bahwa kiblat mereka lebih dulu dibangun sebelum kiblat kaum muslimin. Maka Allah membantahnya, yakni bahwa rumah ibadah yang pertama kali dibangun adalah Ka'bah, baru kemudian Al Aqsha. Jarak antara keduanya sebagaimana dalam hadits adalah 40 tahun. Yakni kiblat mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 96",
    "description": "Dalam ayat ini Allah menjelaskan kedudukan masjidilharam dan kakbah yang nabi ibrahim terlibat dalam pembangunannya. Allah menegaskan bahwa sesungguhnya rumah tempat ibadah yang pertama dibangun untuk manusia, ialah baitullah yang di bakkah yakni mekah yang diberkahi dengan banyak kebajikan duniawi maupun ukhrawi secara berkesinambungan dan tiada terputus, dan menjadi petunjuk, yaitu sebagai kiblat dan pusat kegiataan beribadah kepada Allah serta harapan untuk mengunjunginya bagi seluruh alam di masa lampau, sekarang, maupun yang akan datang (lihat: surah ibrahim/14: 37). Di sana, di masjidilharam, terdapat tanda-tanda yang jelas tentang keutamaan dan kemuliaannya diantaranya maqam ibrahim, yaitu bekas telapak kaki nabi ibrahim tempat beliau berdiri waktu membangun kakbah; hajar aswad, hijir ismail dan yang lainnya (lihat: surah albaqarah/2: 125). Barang siapa memasukinya, menjadi amanlah dia dari gangguan-gangguan. Dan di antara kewajiban manusia terhadap Allah adalah melaksanakan ibadah haji ke baitullah, yaitu bagi orang-orang islam yang sudah akil balig yang mampu mengadakan perjalanan ke sana, mempunyai bekal yang cukup untuk dirinya dan keluarga yang ditinggalkan, kemampuan fisik, ada sarana pengangkutan dan aman dalam perjalanan. Barang siapa mengingkari kewajiban haji, maka dia adalah kafir, karena tidak percaya pada ajaran islam. Ketahuilah bahwa Allah mahakaya (tidak memerlukan sesuatu) apapun dari seluruh alam, baik yang taat dan menjalankan ibadah haji, yang durhaka, maupun yang kafir."
  }
]