[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah oleh mu (wahai Rasul), kepada ahli kitab dari bangsa Yahudi dan Nasrani, “Mengapa kalian mengingkari hujjah-hujjah Allah yang menunjukkan bahwa agama Allah itu adalah islam, dan mengingkari isi yang terkandung dalam kitab-kitab suci kalian, berupa petunjuk-petunjuk dan bukti-bukti nyata yang menunjukkan hal itu, sedang kalian itu mengetahuinya? Dan Allah menjadi saksi atas perbuatan kalian itu,“ Di sini terkandung peringatan keras dan ancaman terhadap mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "98. Katakanlah -wahai Nabi-, “Wahai orang-orang Ahli Kitab dari kalangan Yahudi dan Nasrani, mengapa kalian mengingkari bukti-bukti yang menunjukkan kebenaran Nabi -ṣallallāhu 'alaihi wa sallam-. Salah satunya ialah bukti-bukti yang dikemukakan oleh kitab Taurat dan Injil?! Dan Allah senantiasa mengawasi dan menyaksikan amal perbuatan kalian, dan akan memberi kalian balasan yang setimpal.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "98-99. Allah mengingkari orang-orang Yahudi dan Nasrani dengan memerintahkan nabi Muhammad untuk berkata kepada mereka: “Mengapa kalian mengingkari ayat-ayat Allah yang menunjukkan kebenaran kerasulan Muhammad, padahal Allah menyaksikan segala perbuatan kalian?” Dan Allah mengingkari mereka pula: “Mengapa kalian menghalangi orang-orang beriman dari agama Allah dan nabi-Nya dengan berbagai syubhat, cobaan, dan pengubahan kitab; padahal kalian mengetahui bahwa orang-orang beriman ini berada dalam kebenaran? Dan Allah tidak lengah terhadap perbuatan kalian.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "98. قُلْ يٰٓأَهْلَ الْكِتٰبِ لِمَ تَكْفُرُونَ بِـَٔايٰتِ اللهِ وَاللهُ شَهِيدٌ عَلَىٰ مَا تَعْمَلُونَ (Katakanlah: “Hai Ahli Kitab, mengapa kamu ingkari ayat-ayat Allah, padahal Allah Maha menyaksikan apa yang kamu kerjakan?”) Yakni menyaksikan kalian ketika kalian mengucapkan kalimat kekufuran dan melakukan pengingkaran terhadap dalil-dalil yang benar dan mukjizat kenabian. Atau yang dimaksud adalah kufur terhadap ayat-ayat Taurat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "98 Katakanlah: “Hai orang-orang Yahudi dan Nasrani, mengapa kamu ingkari ayat-ayat Allah yang menunjukkan bukti tentang kebenaran kenabian Muhammad? Sesungguhnya Allah Maha menyaksikan ketika kalian menjadi kufur atas Al-quran dan bukti-bukti kebenaran?”. Ayat ini turun ketika orang Yahudi menghasut sekelompok orang dari suku Aus dan Khazraj dalam perkumpulan mereka supaya mereka saling membunuh atau berperang satu sama lain"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah, “Wahai Ahlul kitab, mengapa kalian mengingkari ayat-ayat Allah, padahal Allah Maha Menyaksikan apa yang kalian kerjakan”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "98-99. Dan ketika hujjah-hujjah telah tegak atas ahli kitab, sebagaimana yang telah lewat, padahal mereka sebelum itu mengenal Nabi sebagai pengetahuan mereka kepda anak-anak mereka, maka Allah menjelek-jelekan dari kalangan mereka orang-orang yang bersikeras menolak karena telah ingkar terhadap ayat-ayat Allah, dan tindakan mereka menghalang-halangi hamba-hamba Allah dari jalan Allah, karena masyrakat awam mengikuti para ulama mereka. Dan Allah Mengetahui keadaan mereka dan akan membalas semua itu dengan pembalasan yang setimpal dan penuh."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 98: Tanyalah: \"Hai Ahli Kitab!. Mengapakah kamu kufur kepada perintah-perintah Allah Melihat apa-apa yang kamu kerjakan?\""
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 98",
    "description": "Setelah jelas dalil dan penjelasan yang diberikan kepada ahli kitab atas kebohongan mereka, tetapi mereka tetap ingkar, maka Allah memerintahkan kepada nabi Muhammad, katakanlah wahai ahli kitab! mengapa kamu mengingkari ayat-ayat Allah, mendustakan Al-Qur'an dan mengingkari kerasulanku, padahal Allah maha menyaksikan apa yang kamu kerjakan' tidak ada kedustaan dan perbuatan kalian yang samar bagi Allah walaupun kalian berusaha menyembunyikannya. Dia akan membalas keburukan perbuatan kalian kelak di hari kiamatkatakanlah, wahai nabi Muhammad, wahai ahli kitab! setelah kamu kufur, mengapa kamu terus menghalang-halangi dan berusaha memalingkan orang-orang yang beriman dari jalan Allah, kamu menghendakinya (jalan Allah) yang lurus menjadi bengkok, padahal kamu menyaksikan, yaitu mengetahui bahwa apa yang disampaikan oleh nabi Muhammad adalah benar' dan Allah tidak lengah terhadap apa yang kamu kerjakan secara terang-terangan maupun sembunyi-sembunyi, baik di masa lampau, sekarang, maupun yang akan datang. Sesungguhnya kalian telah sesat dan menyesatkan '"
  }
]