[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai Rasul), kepada kaum Yahudi dan Nasrani, “ Mengapa kalian menghalang-halangi dari islam orang yang hendak masuk ke dalamnya, dan kalian mencari-cari cara untuk menyesatkan dan membelokannya dari tujuan dan istiqamah, padahal kalian tahu bahwa risalah yang aku bawa adalah merupakan kebenaran?” Dan Allah tidak lalai terhadap apa yang kalian perbuat dan akan memberikan balasan kepada kalian atas perbuatan tersebut."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "99. Katakanlah -wahai Nabi-, “Wahai orang-orang Ahli Kitab dari kalangan Yahudi dan Nasrani, mengapa kalian menghalang-halangi orang-orang yang telah beriman kepada Allah dari agama-Nya karena kalian menginginkan agama Allah itu menyimpang dari kebenaran menuju kebatilan, dan para penganutnya tersesat dari jalan yang benar, sedangkan kalian menyaksikan bahwa agama (Islam) ini adalah kebenaran, yang membenarkan apa yang tertera di dalam kitab-kitab suci kalian?! Allah tidak akan lalai terhadap perbuatan kalian yang ingkar kepada-Nya dan mengahalangi-halangi jalan-Nya. Dan Dia akan memberikan balasan yang setimpal kepada kalian.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "99. لِمَ تَصُدُّونَ عَن سَبِيلِ اللهِ مَنْ ءَامَنَ (mengapa kamu menghalang-halangi dari jalan Allah orang-orang yang telah beriman) Yakni dengan merencanakan tipu daya untuk menyebarkan fitnah diantara kaum muslimin, dan berusaha memberi penghalang antara manusia dan keimanan kepada Allah. تَبْغُونَهَا عِوَجًا (kamu menghendakinya menjadi bengkok) Yakni mengharapkan kebengkokan jalan Allah dan menjauhkan dari tujuan dan keistiqamahan dengan memberi syubhat-syubhat kepada manusia agar menyangka bahwa jalan itu memang bengkok dan klaim-klaim sesat mereka adalah benar. وَأَنتُمْ شُهَدَآءُ ۗ (padahal kamu menyaksikan?) Yakni bagaimana kalian mengharapakan tipu daya itu bagi agama Islam, padahal kalian telah bersaksi bahwa Islam adalah agama Allah yang mana Allah tidak menerima selainnya sebagaimana yang kalian ketahui dari kitab-kitab kalian yang diturunkan lewat nabi-nabi kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "99 Katakanlah: “Hai orang-orang Yahudi dan Nasrani, mengapa kamu menghalang-halangi manusia dari agama Allah? Mengapa kalian menyampaikan sesuatu yang samar dalam hal keimanan kepada Allah? Kalian menyampaikan fitnah di antara orang-orang Islam orang-orang yang telah beriman, kalian menghendaki suatu bahwa jalan Allah menjadi bengkok dari kebenaran dan kelurusan, Kalian bermaksud untuk memecah manusia menjadi golongan-golongan. Padahal kalian bersaksi bahwa ini adalah agama Allah yang benar. Sebagaimana dijelaskan dalam kitab kalian”. Allah sekali-kali tidak lalai dari apa yang kamu kerjakan dan akan membalasnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah, “Wahai Ahlul kitab, mengapa kalian menghalang-halangi orang-orang yang beriman dari jalan Allah} kalian merintangi dari jalan Allah {Kalian menghendakinya menjadi bengkok} kalian menghendakinya menyimpang dari kebenaran {sedangkan kalian menyaksikan. Allah tidak lengah terhadap apa yang kalian kerjakan.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "98-99. Dan ketika hujjah-hujjah telah tegak atas ahli kitab, sebagaimana yang telah lewat, padahal mereka sebelum itu mengenal Nabi sebagai pengetahuan mereka kepda anak-anak mereka, maka Allah menjelek-jelekan dari kalangan mereka orang-orang yang bersikeras menolak karena telah ingkar terhadap ayat-ayat Allah, dan tindakan mereka menghalang-halangi hamba-hamba Allah dari jalan Allah, karena masyrakat awam mengikuti para ulama mereka. Dan Allah Mengetahui keadaan mereka dan akan membalas semua itu dengan pembalasan yang setimpal dan penuh."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ali ‘Imran ayat 99: Tanyalah: \"Hai Ahli Kitab! Mengapa kamu memalingkan dari jalan Allah akan orang-orang yang telah hendak menunjukkan bahwa jalan Allah itu bengkok, padahal kamu menyaksikan (kebenarannya)? dan Allah tidak lalai dari apa yang kamu kerjakan?\""
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni dari agama-Nya, dengan mendustakan Nabi Muhammad shallallahu 'alaihi wa sallam dan menyembunyikan nikmat yang diberikan kepadanya. Menyaksikan maksudnya mengetahui bahwa agama yang diridhai Allah adalah agama Islam sebagaimana yang ada dalam kitab mereka. Bahkan Allah meliputi amal mereka, niat mereka dan rencana jahat mereka dan akan memberikan balasan terhadap pekerjaan mereka. Pekerjaan mereka misalnya kafir, mendustakan dan menghalangi manusia dari jalan Allah. Di ayat 98-99, Allah Subhaanahu wa Ta'aala mencela orang-orang Yahudi dan Nasrani karena kekafiran mereka kepada ayat-ayat-Nya yang diturunkan kepada Rasul-Nya, padahal ayat tersebut Allah jadikan sebagai rahmat bagi hamba-hamba-Nya agar mereka dapat mengambilnya sebagai petunjuk. Namun mereka (Ahli Kitab) malah mengingkarinya, bahkan tidak hanya itu, mereka juga menghalangi manusia dari jalan Allah dan menginginkannya menjadi bengkok."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ali ‘Imran Ayat 99",
    "description": "Katakanlah, wahai nabi Muhammad, wahai ahli kitab! setelah kamu kufur, mengapa kamu terus menghalang-halangi dan berusaha memalingkan orang-orang yang beriman dari jalan Allah, kamu menghendakinya (jalan Allah) yang lurus menjadi bengkok, padahal kamu menyaksikan, yaitu mengetahui bahwa apa yang disampaikan oleh nabi Muhammad adalah benar' dan Allah tidak lengah terhadap apa yang kamu kerjakan secara terang-terangan maupun sembunyi-sembunyi, baik di masa lampau, sekarang, maupun yang akan datang. Sesungguhnya kalian telah sesat dan menyesatkan ' setelah ayat sebelumnya mengecam ahli kitab, maka ayat ini ditujukan kepada orang-orang yang beriman. Wahai orang-orang yang beriman! jika kamu mengikuti sebagian dari orang yang diberi kitab, yaitu yahudi dan nasrani, niscaya mereka akan mengembalikan dan memalingkan kamu dari agama kamu agar kembali menjadi orang kafir yang kukuh kekafirannya setelah kamu beriman kepada nabi Muhammad."
  }
]