[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Amat agung keberkahan-keberkahan Allah, sangat banyak kebaikan-kebaikanNya, dan sempurna sifat-sifatNya serta MahaTinggi Dzat Yang telah menurunkan al-Qur’an yang memisahkan antara kebenaran dan kebatilan kepada hambaNya, Muhammad agar menjadi seorang utusan (Allah) bagi bangsa manusia dan jin, yang memperingatkan mereka dari siksaan Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Sungguh Maha Agung dan begitu banyak kebaikan Allah yang telah menurunkan Kitab Al-Qur`ān sebagai pembeda (furqan) antara yang hak dan yang batil kepada hamba dan Rasul-Nya Muhammad -ṣallallāhu 'alaihi wa sallam-, agar dia menjadi Rasul kepada dua jenis makhluk; jin dan manusia, dan menjadi pemberi peringatan kepada mereka tentang azab Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1-2. Maha Suci dan Maha Agung kedudukan Allah dan sangat banyak kebaikan-Nya, Dia menurunkan al-Qur’an sebagai pemisah antara kebenaran dan kebatilan kepada hamba-Nya, Muhammad agar dia menjadi seorang rasul bagi jin dan manusia, dia akan memperingatkan mereka dari azab neraka dan memberi mereka kabar gembira berupa surga yang penuh kenikmatan. Allah yang memiliki kerajaan tujuh langit dan bumi, Dia tidak mempunyai anak dan tidak memiliki sekutu dalam kerajaan-Nya. Allah adalah pencipta segala sesuatu, Dia menyempurnakan setiap ciptaan-Nya dan menyiapkan kemaslahatan baginya, tidak ada kekurangan dan perbedaan dalam hal itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. تَبَارَكَ الَّذِى نَزَّلَ الْفُرْقَانَ (Maha suci Allah yang telah menurunkan Al Furqaan) Makna (البركة) adalah kebaikan yang sangat banyak. Al-Farra’ berkata bahwa kata (تبارك) dan (تقدس) memiliki makna yang sama, yakni bermakna keagungan. Sedangkan yang dimaksud dengan (الفرقان) adalah al-Qur’an yang menjadi pembeda antara kebenaran dan kebatilan, petunjuk dan kesesatan, serta halal dan haram. Al-Qur’an diturunkan dengan berangsur-angsur dan berturut-turut sesuai dengan kejadian yang menjadi sebab turunnya agar penjelasannya lebih mudah dipahami dan lebih besar pengaruhnya. عَلَىٰ عَبْدِهِۦ(kepada hamba-Nya) Yang dimaksud adalah Nabi Muhammad. Beliau disebut sebagai hamba-Nya untuk memuliakan dan mengagungkannya sebagai bentuk karunai yang diberikan kepadanya dengan turunnya al-Qur’an. لِيَكُونَ لِلْعٰلَمِينَ نَذِيرًا(agar dia menjadi pemberi peringatan kepada seluruh alam) Yakni agar Muhammad menjadi pemberi peringatan bagi seluruh manusia dan jin mengenai kebangkitan mereka setelah kematian dan hari mereka dikumpulkan kepada Allah untuk membalas amal perbuatan mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1-2 Bagaimana keagungan al-Qur'an bisa tertanam dalam diri anda? Syaikh Farid al-Anshari pernah berkata, di sela tadabburnya tentang surat al-Furqan: Sesungguhnya pengakuan seorang mukmin akan keagungan al-Qur'an dapat dibuktikan ketika ia telah mengakui keagungan dzat yang berkata dalam al-Qur'an itu, Yakni Allah ta'ala Tuhan semesta alam; karena nilai suatu ucapan merupakan bagian dari nilai siapa yang mengatakannya, jika hal ini dapat kamu perhatikan dengan baik, maka kamu telah menemukan kekayaan al-Qur'an yang sesungguhnya. Oleh karena itu Allah kemudian mengatakan pada ayat selanjutnya sebagai pengenalan tentang siapa yang menurunkan ayat-ayat ini: { ٱلَّذِى لَهُۥ مُلْكُ ٱلسَّمَٰوَٰتِ وَٱلْأَرْضِ وَلَمْ يَتَّخِذْ وَلَدًا وَلَمْ يَكُن لَّهُۥ شَرِيكٌ فِى ٱلْمُلْكِ وَخَلَقَ كُلَّ شَىْءٍ فَقَدَّرَهُۥ تَقْدِيرًا } \"Yang kepunyaan-Nya-lah kerajaan langit dan bumi, dan Dia tidak mempunyai anak, dan tidak ada sekutu bagi-Nya dalam kekuasaan(Nya), dan dia telah menciptakan segala sesuatu, dan Dia menetapkan ukuran-ukurannya dengan serapi-rapinya\". Seakan-akan pada ayat pertama: { تَبَارَكَ ٱلَّذِى نَزَّلَ ٱلْفُرْقَانَ } \"Maha suci Allah yang telah menurunkan Al Furqaan (Al Quran)\" ditanyakan, siapakah yang menurunkannya? maka kemudian dijawab dengan sifat-sifat Nya yang agung dan mulia yang meninggikan sifat Rububiyyah-Nya secara muthlaq."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "1. Maha Agung kekuasaan Allah, Maha Banyak kebaikanNya, dan Bertambahlah kesucianNya dari setiap sekurangan, Dzat yang menurunkan Al-Qur’an secara berangsur-angsur yang membedakan antara yang haq dan yang bathil kepada hambaNya, Muhammad SAW, supaya dia bisa menjadi pemberi peringatan kepada manusia dan jin tentang azab Allah, jika mereka tidak mengimani keesaanNya. Tabaraka dan Taqaddasa itu memiliki satu makna sama. Dan Nabi digambarkan dengan sifat sebagai hamba Allah itu untuk memuliakannya dan memberi penghormatan kepadanya yang berada di tingkat kehambaan tertinggi."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maha agung Dzat} Dzat yang agung keberkahanNya {yang telah menurunkan Al-Furqan} Al-Qur’an yang memisahkan antara yang benar dan yang bathil {kepada hambaNya agar dia menjadi pemberi peringatan kepada seluruh alam"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1 ini adalah penjelasan tentang keagunganNya yang sempurna dan kemanunggalanNYa di dalam keesaan dari segala sisi, banyaknya kebaikan dan karuniaNYa, seraya berfirman, ”Mahaberkah,” maksudnya, Mahaagung, Mahasempurna sifat-sifatNya dan Mahabanyak kebaikanNya, yang di antara karunia dan nikmatNya yang terbesar adalah bahwa Dia telah menurunkan al-qur’an ini, yang membedakan antara yang halal dengan yang haram, antara petunjuk dengan kesesatan, antara orang-orang yang berbahagia dengan orang-orang yang sengsara, “kepada hambaNya,” yaitu Muhammad yang telah menyempurnakan urutan udubiyah dan menggungguli seluruh rasul; “agar ia menjadi,” maksudnya penurunan al-furqan kepada hambaNYa itu agar menjadi “pemberi peringatan kepada seluruh alam,” yang memberikan mereka peringatan akan siksa Allah dan azabNya, menjelaskan kepada mereka letak-letak keridhaanNya dari kemurkaanNya, sehingga siapa saja yang menerima peringatannya dan mengamalkannya, niscaya (menjadi) termasuk orang-orang yang selamat di dunia dan akhirat, yaitu orang-orang yang meraih kebahagiaan abadi dan kerajaan nan kekal. Apakah ada sesuatu lagi diatas nikmat, karunia dan ihsan ini? Maka Maha luhur Allah yang mana ini merupakan sebagian dari karunia dan berkahNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Furqan ayat 1: Ayat ini menerangkan tentang keagungan Allah, keesaan-Nya dan banyaknya kebaikan serta ihsan-Nya. Yakni Mahaagung, sempurna sifat-sifat-Nya dan banyak kebaikannya yang di antara kebaikan dan nikmat-Nya yang terbesar adalah menurunkan Al Qur’an. Al Qur’an disebut Al Furqan, karena ia membedakan antara yang hak dengan yang batil, yang halal dengan yang haram, petunjuk dengan kesesatan, dan orang yang bahagia dengan orang yang sengsara. Yang telah sempurna martabat kehambaan, dan kedudukannya di atas para rasul yang lain. Menakuti mereka dengan azab Allah dan menerangkan jalan yang diridhai Allah dan jalan yang dimurkai-Nya, sehingga barang siapa yang menerimanya dan mengamalkannya, maka ia termasuk orang yang selamat di dunia dan akhirat, yang memperoleh kebahagiaan yang kekal. Adakah nikmat dan karunia yang lebih besar daripada ini?"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Furqan Ayat 1",
    "description": "Mahasuci Allah yang telah menurunkan furq'n, yaitu Al-Qur'an yang menjelaskan dengan gamblang perbedaan antara hak dan batil. Dia menurunkannya kepada hamba-Nya, nabi Muhammad, agar dia menjadi pemberi peringatan kepada seluruh alam, baik jin maupun manusia, dan tidak dikhususkan bagi kelompok tertentu. 2. Allah yang menurunkan 'furq'n' itu adalah dia yang memiliki ke-rajaan langit dan bumi. Kekuasaan-Nya begitu sempurna dan kemampuan-Nya tidak berbatas dalam mengurus keduanya. Dia tidak mempunyai anak karena dia tidak membutuhkannya, dan tidak pula ada sekutu bagi-Nya dalam kekuasaan-Nya karena dia mahakuasa sehingga tidak memerlukan bantuan, dan dia menciptakan segala sesuatu lalu menetapkan ukuran-ukurannya dengan tepat, teliti, dan penuh hikmah."
  }
]