[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Amat agung keberkahan-keberkahan Allah dan sangat banyak kebaikan-kebaikanNya yang jika Dia menghendaki, niscaya Dia akan menjadikan bagimu (wahai Rasul) keadaan yang lebih baik dari apa yang mereka pikirkan bagimu. Maka Dia menjadikan bagimu di dunia kebun-kebun yang banyak yang disibak oleh sungai-sungai, dan menjadikan bagimu di dalamnya istana-istana yang besar."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Maha Suci Allah yang jika Dia menghendaki, niscaya Dia jadikan bagimu yang lebih baik dari apa yang mereka usulkan kepadamu, yaitu dengan menjadikan untukmu di dunia ini; kebun-kebun yang mengalir sungai-sungai di bawah istana-istana dan pepohonannya, dan engkau memakan buah-buahannya, serta menjadikan untukmu istana-istana yang engkau tempati dengan nyaman."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "10. Maha Suci dan Maha Agung kedudukan Allah dan sangat banyak kebaikan-Nya, jika Dia berkehendak niscaya akan memberimu sesuatu yang lebih baik daripada yang mereka usulkan, yaitu berupa kebun-kebun yang di aliri sungai-sungai dan memberimu istana-istana yang megah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. تَبَارَكَ الَّذِىٓ إِن شَآءَ جَعَلَ لَكَ خَيْرًا مِّن ذٰلِكَ (Maha Suci (Allah) yang jika Dia menghendaki, niscaya dijadikan-Nya bagimu yang lebih baik dari yang demikian) Yakni lebih baik dari yang kalian usulkan itu. جَنّٰتٍ تَجْرِى مِن تَحْتِهَا الْأَنْهٰرُ وَيَجْعَل لَّكَ قُصُورًۢا(yaitu) surga-surga yang mengalir sungai-sungai di bawahnya, dan dijadikan-Nya (pula) untukmu istana-istana) Makna (القصر) adalah rumah yang terbuat dari batu dan tanah; ini merupakan sifat rumah di dunia, adapun rumah di akhirat maka tidak ada yang mengetahui sifatnya kecuali Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10. Maha Agung dan Maha Suci Allah atas segala sesuatu, Dzat yang jika berkehendak, Dia akan menciptakan kebaikan untukmu daripada apa yang mereka tawarkan, yaitu kebun-kebun yang di bawahnya mengalir sungai-sungai, dan menjadikan untukmu istana-istana yang dikokohkan dengan bebatuan dan tanah. Ayat ini diturunkan ketika para pemimpin Quraisy seperti Abu Sufyan dan Nadhr bin Harits yang menawarkan harta, kekuasaan, kemuliaan, dan kehormatan kepada Nabi SAW agar dia menghentikan dakwahnya, lalu dia menolak itu semua dan berkata: “Aku tidak diutus kepada kalian untuk hal ini, namun Allah mengutusku sebagai pembawa kabar gembira dan pemberi peringatan” Lalu Allah menurunkan ayat ini."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maha agung Dzat yang jika Dia menghendaki, niscaya Dia menjadikan bagimu yang lebih baik daripada itu, (yaitu) surge-surga yang mengalir di bawahnya sungai-sungai. Dia menjadikan untukmu istana-istana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "10 maka dari itu, Allah menginformasikan bahwasannya Dia mahakuasa memberimu kebaikan yang berlimpah ruah di dunia, seraya berfirman, ”Mahasuci Dzat yang jika Dia kehendaki, niscaya dijadikanNya bagimu yang lebih baik drai yang demikian,” maksudnya, yang lebih baik dari apa yang telah mereka katakan. Kemudian Allah menafsirkannya dengan firmanNya, “(yaitu) surga-surga yang mengalir sungai-sungai di bawahnya, dan dijadikanNya (pula) untukmu istana-istana” yang menjulang tinggi penuh hiasan. Jadi, kekuasaan dan kehendakNya tidak terbatas pada masalah itu. Akan tetapi, ketika dunia di sisi Allah benar-benar sangat jauh dan hina, maka Allah mengaruniakan kepada para waliNya dan para RasulNya sebagian drainya sesuai dengan tuntutan kebijaksanaanNya. Sedangkan usulan musuh-musuh mereka, yaitu kenapa para rasul tidak diberi karunia rizki dunia yang banyak adalah kezhaliman dan kelancangan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Furqan ayat 10: Tabaaraka juga bisa diartikan, Mahabanyak kebaikan-Nya. Dari apa yang mereka katakan, berupa harta kekayaan yang banyak dan kebun. Di dunia, namun Dia menghendaki untuk memberikan surga di akhirat karena keadaan dunia yang di sisi-Nya sangat rendah dan hina. Maksudnya, kalau Allah menghendaki niscaya dijadikan-Nya untuk Muhammad shallallahu 'alaihi wa sallam surga-surga dan istana-istana seperti yang akan diperolehnya di akhirat. tetapi Allah tidak menghendaki yang demikian agar manusia itu tunduk dan beriman kepada Allah, tidak terpengaruh oleh benda, tetapi berdasarkan kepada bukti-bukti dan dalil-dalil yang nyata."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Furqan Ayat 10",
    "description": "Mahasuci Allah yang jika dia menghendaki, niscaya dia jadikan atau anugerahkan secara khusus bagimu sesuatu yang lebih baik daripada apa yang mereka usulkan itu, yaitu kebun-kebun atau surga-surga yang mengalir di bawahnya sungai-sungai, sehingga kebun itu tidak akan mengalami kekeringan, dan dia jadikan pula istana-istana yang besar dan megah untukmu. 11. Sebetulnya bukan alasan-alasan terdahulu itu yang menjadikan kaum kafir menolak risalah nabi Muhammad. Yang paling memotivasi mereka untuk menolak risalah beliau adalah karena mereka mendustakan hari kiamat. Dan kami telah menyediakan neraka yang menyala-Nyala bagi siapa yang mendustakan hari kiamat sebagai balasan atas perbuatan mereka."
  }
]