[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apabila neraka melihat orang-orang yang mendustakan Hari Kiamat itu dari tempat yang jauh, mereka mendengar suara gelegar dan gaduhannya lantaran besarnya kemurkaannya terhadap mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Apabila Neraka itu melihat orang-orang kafir dari tempat yang jauh sedang mereka digiring ke arahnya, mereka mendengar suara gelegak dan suara kobaran nyalanya yang dahsyat, lantaran kegeramannya kepada orang-orang kafir itu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "12. Allah menjelaskan api neraka Jahannam; jika api itu telah terlihat oleh orang-orang yang mendustakan dari jarak yang jauh maka mereka akan mendengar suara kobarannya, seperti suara kegeraman dan hembusan nafas dari orang yang marah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "12. إِذَا رَأَتْهُم مِّن مَّكَانٍۭ بَعِيدٍ سَمِعُوا۟ لَهَا تَغَيُّظًا وَزَفِيرًا (Apabila neraka itu melihat mereka dari tempat yang jauh, mereka mendengar kegeramannya dan suara nyalanya) Makna (التغيظ) adalah bahwa neraka itu memiliki suara yang menunjukkan kemurkaannya terhadap orang-orang kafir. Makna (الزفير) adalah suara yang terdengar yang berasal dari tenggorokan akibat cekikan di leher yang sangat kuat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12. Ketika neraka itu terlihat oleh mereka dari tempat yang jauh, maka mereka akan mendengar suara yang mengandung kemarahan yang sangat dahsyat dan (suara seperti) hembusan yang terdengar keluar dari perut ketika mendapatkan suatu rangsangan. Maknanya adalah mereka mendengar dari neraka itu suara air mendidih dan meletup-letup. Dan seperti hembusan itu karena kedahsyatan aktifitas (di dalamnya). Az-Zafir adalah hembusan nafas yang keluar dengan kencang."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apabila neraka itu melihat mereka} neraka itu melihat orang-orang kafit itu {dari tempat yang jauh, mereka mendengar darinya suara gemuruh} suara mengembung yang sangat dahsyat {dan suara nafas} suara hembusan karena sangat murka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "12 “apabila mereka itu melihat mereka dari tempat yang jauh,” yakni, sebelum mereka sampai kepadanya dan sebelum neraka itu sampai kepada mereka, “mereka mendengar kegeramannya,” terhadap mereka “dan suara nyalanya” menyebabkan dada mereka berdebar dan hati mereka remuk, dan hampir saja setiap orang drai mereka mati karena ketakutan terhadpnya. Neraka itu sangat murka kepada mereka karena murka Allah sang Penciptanya; dan kobarannya pun makin menjulang tinggi karena beratnya kekufuran dan kejahatan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Furqan ayat 12: Zahir ayat ini menunjukkan bahwa neraka itu dapat melihat, dan ini mungkin terjadi dengan kekuasaan Allah, atau ayat ini menggambarkan bagaimana dahsyat dan seramnya neraka itu agar setiap orang takut terhadap azab Allah sehingga mereka mau bertakwa. Sebelum sampai kepada mereka. Hati mereka merinding ketakutan kepadanya, bahkan hampir mati karena rasa takut yang demikian hebat, di mana neraka telah marah karena kemarahan Penciptanya dan bertambah gejolaknya karena bertambah kafir dan buruknya mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Furqan Ayat 12",
    "description": "Neraka yang Allah sediakan bagi para pendusta hari kiamat amat mengerikan. Apabila neraka melihat para pendurhaka dari tempat yang jauh, meski para pendurhaka itu tidak melihatnya, mereka mendengar suaranya yang gemuruh bagai air mendidih yang siap menyambut me-reka karena kemarahannya yang meluap-luap. 13-14. Dan apabila mereka, yakni orang-orang kafir itu, dilemparkan dengan kasar dan hina ke tempat yang sempit di neraka dengan dibelenggu tangan dan lehernya, mereka di sana berteriak mengharapkan datangnya kebinasaan yang akan mengakhiri pedihnya siksa yang mereka terima. Ketika itu dikatakan kepada mereka, 'janganlah kamu berteriak meng-harapkan pada hari ini satu kebinasaan saja, melainkan harapkanlah kebi-nasaan yang banyak dan berulang-ulang. Berharaplah demikian karena tiap kali binasa, kamu akan dihidupkan kembali untuk merasakan kebinasaan yang lain lagi. ' pada akhirnya, harapan akan datangnya kebinasaan yang benar-benar mengakhiri azab mereka di neraka tidak akan pernah mereka peroleh."
  }
]