[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apabila mereka dilemparkan kedalam tempat yang sangat sempit di Jahanam (dalam keadaan tangan-tangan mereka telah dibelenggu dengan rantai hingga leher-leher mereka) mereka berdoa buruk memohon kebinasaan bagi diri mereka agar dapat terbebaskan darinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "13. Dan apabila orang-orang kafir itu dilemparkan ke tempat yang sempit di neraka Jahanam dalam kondisi tangan terbelenggu ke leher dengan rantai-rantai, mereka pun mendoakan diri mereka sendiri supaya binasa dengan harapan mereka lepas dari azab tersebut."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "13-14. Jika mereka dilempar ke tampat yang sempit di neraka itu dalam keadaan terikat rantai, maka mereka akan berteriak memohon agar dapat binasa. Sehingga akan dikatakan kepada mereka: “Pada hari ini janganlah kalian meminta kebinasaan sekali saja, namun mintalah berkali-kali karena tetap saja permintaan kalian tidak akan berguna.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "13. وَإِذَآ أُلْقُوا۟ مِنْهَا مَكَانًا ضَيِّقًا (Dan apabila mereka dilemparkan ke tempat yang sempit di neraka itu) Allah menyebutkan neraka sebagai tempat yang sempit untuk menunjukkan siksaan yang sangat berat dan kesengsaraan yang tiada habisnya. مُّقَرَّنِينَ (dengan dibelenggu) Tangan mereka terikat ke leher mereka dengan belenggu dari besi. دَعَوْا۟ هُنَالِكَ (mereka di sana mengharapkan) Yakni di tempat sempit itu. ثُبُورًا (kebinasaan) Di sana mereka mengharap kebinasaan bagi diri mereka, mereka meneriakkan kebinasaan itu akibat siksaan yang menimpa mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13. Dan ketika mereka dilemparkan di tempat yang sempit dari bagian neraka itu (digambarkan seperti itu untuk menambahkan azab mereka) dengan keadaan diikat dengan rantai. Dalam tempat sempit itu mereka memanggil-manggil: “Hancurlah, hancurlah” maknanya mereka mengharapkan kehancuran bagi diri mereka supaya mereka bisa terbebas dari azab yang sangat dahsyat itu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apabila mereka dilemparkan dari neraka} dari neraka {ke tempat yang sempit dalam keadaan dibelenggu} dibelenggu, sunggguh dikalungkan tangan mereka ke leher mereka menggunakan rantai {mereka berteriak di sana mengharapkan kebinasaan} ketika itu mereka menginginkan kematian dan kehancuran untuk diri mereka karena takut dengan azab neraka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "13 “dan apabila mereka dilemparkan ke tempat yang sempit di neraka itu dengan dibelenggu,” maksudnya, saat mereka di azab, sedang mereka berada di tenga-tengah neraka berkumpul disuatu tempat, antara kesempitan tempat itu dan berdesak-desaknya para penghuni, dalam keadaan mereka dibelenggu dangan rantai dan belenggu. Lalu ketika mereka telah tiba ke tempat yang mencelakakan itu dan mereka ditawan dalam penawanan yang terburuk maka, “mereka disana mengharapkan kebinasaan,” maksudnya, mereka mendoakan kebinasaan, kehinaan dan kekejian terhadap diri mereka sendiri, dan mereka menyadari bahwasannya mereka adalah manusia zhalim lagi melampaui batas. Allah telah berlaku adil terhadap mereka di mana Dia telah mendapatkan mereka berdasarkan amal perbuatan mereka pada tempat (yang sangat menghinakan ini)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Furqan ayat 13: Tangan ke leher mereka dengan rantai dan belenggu. Maksudnya, mereka mengharapkan kebinasaan, agar terlepas dari siksaan yang sangat besar, yaitu azab di neraka yang sangat panas dengan dibelenggu, di tempat yang sempit pula, sebagaimana yang dilukiskan itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Furqan Ayat 13",
    "description": "13-14. Dan apabila mereka, yakni orang-orang kafir itu, dilemparkan dengan kasar dan hina ke tempat yang sempit di neraka dengan dibelenggu tangan dan lehernya, mereka di sana berteriak mengharapkan datangnya kebinasaan yang akan mengakhiri pedihnya siksa yang mereka terima. Ketika itu dikatakan kepada mereka, 'janganlah kamu berteriak meng-harapkan pada hari ini satu kebinasaan saja, melainkan harapkanlah kebi-nasaan yang banyak dan berulang-ulang. Berharaplah demikian karena tiap kali binasa, kamu akan dihidupkan kembali untuk merasakan kebinasaan yang lain lagi. ' pada akhirnya, harapan akan datangnya kebinasaan yang benar-benar mengakhiri azab mereka di neraka tidak akan pernah mereka peroleh"
  }
]