[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai Rasul), kepada mereka, “Apakah neraka ini yang diceritakan karakternya kepada kalian lebih baik daripada Surga Na’im yang abadi yang dijanjikan kepada orang-orang yang takut terhadap siksa Tuhan mereka, yang nantinya menjadi ganjaran bagi mereka atas amal perbuatan mereka dan menjadi tempat kembali mereka di akhirat?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Katakanlah kepada mereka -wahai Rasul-, \"Apakah azab yang disebutkan pada kalian itu lebih baik bagi kalian, ataukah Surga kekal yang kenikmatannya tiada henti selamanya? Itulah tempat yang telah dijanjikan Allah bagi orang-orang yang bertakwa sebagai ganjaran pahala dan tempat kembali bagi mereka\"."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "15-16. Hai Rasulullah, katakanlah kepada mereka -sebagai olokan bagi mereka-: “Apakah azab neraka itu lebih baik daripada surga yang kekal yang penuh dengan kebaikan yang Allah janjika bagi orang-orang bertakwa? dan itu adalah janji Allah bagi mereka sebagai balasan yang mulia dan tempat yang baik.” Bagi mereka segala kenikmatan yang mereka inginkan di dalam surga. Mereka masuk surga sebagai janji yang benar dari Tuhanmu yang diminta oleh orang-orang bertakwa, dan Allah tidak akan mengingkari janji."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15. قُلْ أَذٰلِكَ خَيْرٌ أَمْ جَنَّةُ الْخُلْدِ الَّتِى وُعِدَ الْمُتَّقُونَ ۚ (Katakanlah: “Apa (azab) yang demikian itukah yang baik, atau surga yang kekal yang telah dijanjikan kepada orang-orang yang bertakwa?”) Yakni apakah azab neraka yang menyala-nyala yang kekal sebagaimana disebutkan itu lebih baik dari surga yang memiliki kenikmatan yang kekal tidak ada habisnya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ قُلْ أَذَٰلِكَ خَيْرٌ أَمْ جَنَّةُ ٱلْخُلْدِ ٱلَّتِى وُعِدَ ٱلْمُتَّقُونَ ۚ } \"Katakanlah: \"Apa (azab) yang demikian itukah yang baik, atau surga yang kekal yang telah dijanjikan kepada orang-orang yang bertakwa?\" Seseorang yang mentadaburi ayat ini dengan baik akan menyimpulkan satu kebenaran yang besar, yaitu bahwasanya ketaqwaan sebaik-baiknya bekal yang seharusnya setiap muslim mepersapkannya untuk menghadapi kehidupan akhirat, dan bahwasanya seseorang yang berakal adalah dia yang meringankan beban orang lain yang sedang berusaha menggapai kebenaran ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "15. Wahai Nabi, katakanlah kepada orang-orang musyrik itu untuk berpikir dan membandingkan: “Apakah yang disebutkan itu berupa macam-macam azab dan penggambaran neraka yang abadi itu lebih baik ataukah surga yang kenikmatannya abadi selama-lamanya yang dijanjikan oleh Allah untuk orang-orang yang bertakwa dan bagi mereka dalam hukum Allah itu suatu balasan dan tempat kembali yang baik.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Apakah yang demikian itu yang lebih baik atau surga yang kekal yang dijanjikan kepada orang-orang yang bertakwa. Surga itu adalah balasan bagi mereka} pahala {dan tempat kembali”} tempat kembali"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "15 maksudnya, katakan kepada mereka untuk menjelaskan kepicikan pikiran mereka dan pilihan mereka terhadap yang berbahaya daripada yang bermanfat, ”apakah (azab) yang demikan itu” yakni, azab yang telah Aku rincikan kepada kalian itu, “yang lebih baik, atau surga yang kekal yang dijanjikan kepada orang-orang yang bertakwa?” yang perbekalannya adalah takwa kepada Allah. Siapa saja yang bertakwa, maka Allah telah menjanjikan surga kepadanya, “sebagai balasan bagi mereka,” atas ketakwaan mereka “dan tempat kembali” yaitu tempat berlindung mereka. Mereka tinggal menetap di sana, dan mereka kekal selama-lamanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Furqan ayat 15: Kepada mereka menerangkan kebodohan mereka karena memilih yang berbahaya daripada yang bermanfaat. Lagi kekal di sana."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Furqan Ayat 15",
    "description": "Usai menguraikan kebinasaan yang menanti para pendurhaka, Allah memerintahkan nabi Muhammad untuk menyampaikan pesan kepada mereka. 'katakanlah kepada para pendurhaka, 'apakah azab seperti itu yang baik, atau surga yang kekal yang dijanjikan oleh Allah yang maha menepati janji kepada orang-orang yang bertakwa dengan sesungguhnya takwa'\" surga itu Allah janjikan sebagai balasan dan tempat kembali yang baik dan nyaman bagi mereka''16. Bagi orang-orang yang bertakwa itu segala yang mereka kehendaki ada di dalam surga tersebut. Di sana tersedia kenikmatan abadi dan berbagai kelezatan. Mereka kekal di dalamnya dan mereka pun enggan ber-anjak darinya. Itulah janji pasti dari tuhanmu yang pantas dimohonkan kepada-Nya."
  }
]