[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bagi orang-orang yang taat Di dalam surga akan mendapatkan segala yang mereka inginkan dari berbagai macam kenikmatan yang enak. Kesenangan mereka di dalamnya bersifat abadi. Masuknya mereka ke dalam surga sudah merupakan janji atas Tuhanmu (wahai rosul) yang pantas dimohon, yang dimohon oleh para hamba Allah yang bertakwa. Dan Allah tidak memungkiri janjiNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Bagi mereka di dalam Surga itu segala apa yang mereka kehendaki, sedang mereka kekal di dalamnya. Sungguh inilah janji dari Tuhanmu yang senantiasa dimohon oleh orang-orang yang bertakwa kepada-Nya, dan janji Allah pasti terwujud, sebab Dia tidak pernah menyalahi janji."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "16. لَّهُمْ فِيهَا مَا يَشَآءُونَ (Bagi mereka di dalam surga itu apa yang mereka kehendaki) Yakni berbagai kenikmatan dan perlindungan. كَانَ عَلَىٰ رَبِّكَ وَعْدًا مَّسْـُٔولًا ((Hal itu) adalah janji dari Tuhanmu yang patut dimohonkan (kepada-Nya)) Mereka meminta kepada-Nya apa yang telah dijanjikan kepada mereka, dan Allah akan mengabulkannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16. Bagi mereka di dalam suga itu sesuatu yang mereka kehendaki berupa kenikmatan yang menetap dan berbagai jenis kelezatan. Itu adalah sesuatu yang dijanjikan, layak untuk diminta dan balasan yang diinginkan. Ini adalah dalil tentang perwujudan segala sesuatu yang diinginkan di surga. Dan sesungguhnya janji itu pasti dipenuhi."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Bagi mereka di dalamnya segala yang mereka kehendaki. Mereka kekal. Itulah janji Tuhanmu yang pantas dimohonkan} yang wajib, sehingga pasti terjadi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "16 “bagi mereka di dalam surga itu apa yang mereka kehendaki,” maksudnya mereka mencari dan menggantungkan angan-angan dan kehendak padanya, berupa berbagai makanan dan minuman yang lezat, pakaian mewah, wanita-wanita cantik, istana-istana pencakar langit, kebun-kebun dan taman-taman yang luas lagi lapang, serta buah-buahan yang menyenangkan orang yang memandang dan akan memakannya karena baiknya, aneka macamnya dan berbagai jenis-jenisnya, dan sungai-sungai yang mengalir di dalam surga dan kebun-kebunnya, kapan dan bagaimana saja mereka suka menggunakannya, dan mereka mengalirkannya sebagai sungai-sungai yang tidak berubah rasa dan warnanya berupa air susu yang tidak akan pernah berubah rasanya, sungai-sungai air khamar yang lezat bagi orang-orang yang meminumnya, dan sungai-sungai madu yang bersih, berbagai aroma harum, tempat-tempat tinggal yang indah, suara-suara merdu yang keindahannya menyentuh kalbu, saling mengunjungi saudara, kenikmatan berjumpa dengan orang-orang yang dicintai. Dan yang lebih tinggi dari itu semua ialah kenikmatan memandang wajah Allah yang Maha pemurah, mendengar pembicaraanNya, melangkah mendekat kepadaNya, dan bahagia mendapat keridhaanNya, aman dari murkaNya, serta kontinyuitas dan keabadian dari kenimatan yang abadi tersebut dan selalu bertambah sepanjang waktu dan setiap berganti masa. “ia adalah” masuk dan mencapai kesurga itu adalah “janji dari Rabbmu yang patut dimohonkan (kepadaNya),” dimohon oleh hamba-hambaNya yang bertakwa dengan lisan mereka dan dengan bahasa tingkah laku mereka. Lalu, negeri mana dari kedua negeri (yang disebutkan tadi) yang lebih pantas diutamakan? Orang-orang beramal yang mana yang merupakan orang-orang yang beramal untuk negeri kesengsaraan atau orang-orang yang beramal untuk negeri kebahagiaan yang lebih pantas dengan keutamaan, akal sehat dan kebanggan, wahai orang-orang yang berakal? Sesungguhnya kebenaran sudah menjadi jelas dan jalan menjadi terang, hingga tidak ada satu alasan pun yang tersisa bagi orang yang berlebihan (melampaui batas) untuk mengabaikan dalil (bukti). Maka kami memohon kepadaMu, wahai tuhan yang telah menetapkan kesengsaraan terhadap kelompok-kelompok manusia, dan kebahagiaan terhadap kelompok-kelompok manusia yang lain, (agar) berkenan menjadikan kami termasuk orang-orang yang Engkau catat sebagai al-husna (pahala yang agung) dan surga. Kami memohon kesalamatan kepadaMu, ya Allah dari kondisi orang-orang yang binasa, dan kami memohon kepadaMu selamat darinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Furqan ayat 16: Baik makanan dan minuman yang enak, pakaian yang indah, wanita yang cantik, istana yang tinggi, kebun-kebun yang luas dan buah-buahan, sungai-sungai yang mengalir di kebun-kebun dan mereka dapat mengarahkan sungai itu ke arah yang mereka kehendaki, di mana mereka memancarkannya dari air yang tidak berubah rasa dan baunya, dari air susu yang tidak berubah rasanya, dari khamar yang lezat rasanya bagi peminumnya dan dari madu yang disaring. Demikian pula mereka memperoleh tempat tinggal yang indah, mendengarkan suara yang menarik, dapat mengunjungi saudara, bergembira karena bertemu para kekasih, dan kekalnya nikmat-nikmat tersebut serta selalu bertambah, dan nikmat yang paling besarnya adalah kenikmatan memandang wajah Allah Subhaanahu wa Ta'aala, mendengarkan firman-Nya, dekat dengan-Nya, bahagia dengan memperoleh keridhaan-Nya dan aman dari kemurkaan-Nya. Allahumma innaa nas’alukal jannah wa na’uudzu bika minan naar, Allahumma innaa nas’alukal jannah wa na’uudzu bika minan naar, Allahumma innaa nas’alukal jannah wa na’uudzu bika minan naar. Sebagaimana yang dimohonkan kaum mukmin (lihat surah Ali Imran: 194) dan yang dimohonkan para malaikat untuk kaum mukmin (lihat surah Al Mu’min: 8). Oleh karena itu, negeri manakah yang lebih utama dan lebih layak didahulukan; dunia atau surga? Sungguh jalan ke arah surga begitu jelas, dan kesempatan untuk menempuhnya masih ada selama kita masih hidup di dunia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Furqan Ayat 16",
    "description": "Bagi orang-orang yang bertakwa itu segala yang mereka kehendaki ada di dalam surga tersebut. Di sana tersedia kenikmatan abadi dan berbagai kelezatan. Mereka kekal di dalamnya dan mereka pun enggan ber-anjak darinya. Itulah janji pasti dari tuhanmu yang pantas dimohonkan kepada-Nya. 17. Setelah menjelaskan kesudahan yang sangat kontras bagi kaum kafir dan kaum mukmin, pada ayat ini Allah menjelaskan kesudahan sesembahan kaum kafir. Dan ingatlah pula pada hari ketika Allah mengumpulkan kaum musyrik bersama apa yang mereka sembah selain Allah, baik malaikat, jin, manusia, maupun makhluk tak bernyawa seperti berhala, lalu dia berfirman kepada sesembahan itu, 'apakah kamu yang menyesatkan hamba-hamba-ku itu dengan paksaan dan tipu daya kamu, atau mereka sendirikah yang sesat dan menyimpang dari jalan yang benar''"
  }
]