[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Pada Hari KIamat, Allah akan menghimpun kaum Musyrikin dan apa saja yang dahulu mereka sembah selain Allah. Kemudian Dia berfirman kepada sesembahan-sesembahan itu, “Apakah benar kalian telah menyimpangkan hamba-hambaKu dari jalan kebenaran dan kalian perintahkan mereka untuk menyembah kalian ataukah mereka sendiri yang tersesat jalan, mereka menyembah kalian atas keinginan mereka sendiri?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Dan ingatlah hari ketika Allah menghimpun orang-orang musyrik yang mendustakan-Nya, beserta apa yang mereka sembah selain Allah, lalu Allah berfirman kepada yang disembah sebagai cibiran untuk para penyembah mereka, \"Apakah kalian yang menyesatkan hamba-hamba-Ku itu dengan memerintahkan mereka agar menyembah kalian? atau apakah mereka sendiri yang sesat dari jalan yang benar?\"."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "17. Dan pada hari kiamat Allah akan mengumpulkan orang-orang musyrik dan apa yang mereka sembah selain Allah, seperti Isa al-Masih, ‘Uzair, dan lainnya. Kemudian Allah akan bertanya kepada apa yang mereka sembah itu: “Apakah kalian telah menyesatkan orang-orang musyrik, atau mereka sendiri yang ingin menyembah kalian?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "17. وَيَوْمَ يَحْشُرُهُمْ وَمَا يَعْبُدُونَ مِن دُونِ اللهِ (Dan (ingatlah) suatu hari (ketika) Allah menghimpunkan mereka beserta apa yang mereka sembah selain Allah) Berupa patung, berhala, malaikat, jin, Isa al-Masih, dan Uzair. Namun pendapat lain mengatakan yang dimaksud adalah patung-patung saja. فَيَقُولُ ءَأَنتُمْ أَضْلَلْتُمْ عِبَادِى هٰٓؤُلَآءِ أَمْ هُمْ ضَلُّوا۟ السَّبِيلَ (lalu Allah berkata (kepada yang disembah); “Apakah kamu yang menyesatkan hamba-hamba-Ku itu, atau mereka sendirikah yang sesat dari jalan (yang benar)?) Yakni apakah kesesatan mereka adalah karena ajakan kalian kepada mereka untuk menyembah kalian, atau mereka tersesat dari jalan yang benar dan menyembah kalian dengan sendirinya?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17. Dan ingatlah hari dimana Allah mengumpulkan orang-orang musyrik dan sesembahan-sesembahan mereka yang disembah selain Allah berupa berhala, malaikat, jin dan Isa Al-Masih dan Uzair pada hari kiamat. Lalu Allah berfirman kepada yang disembah itu: “Apakah kalian menyesatkan mereka itu dengan mengajak mereka untuk menyembah kalian ataukah mereka tersesat atau menyimpang dari kebenaran dengan sendirinya?!” Pertanyaan itu untuk mencaci dan mencela para penyembah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{(Ingatlah) hari (ketika) Allah mengumpulkan mereka bersama dengan apa yang mereka sembah selain Allah. Lalu Dia berfirman,“Apakah kalian yang menyesatkan hamba-hambaKu itu ataukah mereka sendiri yang sesat dari jalan} Menyimpang dari jalan kebenaran karena diri mereka sendiri"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17 Allah mengabarkan tentang keadaan kaum Musyrikin dan sekutu-sekutu mereka pada hari kiamat kelak, pernyataan sekutu itu untuk berlepas diri dari mereka serta kebatilan semua usaha mereka, seraya berfirman, ”dan suatu hari Allah menghimpunkan mereka,” yakni orang-orang musyrik yang mendustakan “beserta sesuatu yang mereka sembah selaian Allah, lalu Allah berkata, ”yakni kepada yang disembah dengan nada mencela terhadap orang-orang telah menyembah mereka,”apakah kamu yang telah menyesatkan hamba-hambaKu itu atau mereka sendirikah yang sesat dari jalan?” apakah kalian yang menyuruh mereka untuk menyembah kalian, dan kalian yang membuat perbuatan itu indah bagi mereka, ataukah hal itu berasal dari kemauan diri mereka sendiri?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Furqan ayat 17: Allah Subhaanahu wa Ta'aala memberitakan keadaan orang-orang musyrik dan para sekutu mereka pada hari kiamat, dan bahwa para sekutu itu akan berlepas diri dari mereka. Yani orang-orang musyrik. Dengan menyuruh mereka menyembah kamu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Furqan Ayat 17",
    "description": "Setelah menjelaskan kesudahan yang sangat kontras bagi kaum kafir dan kaum mukmin, pada ayat ini Allah menjelaskan kesudahan sesembahan kaum kafir. Dan ingatlah pula pada hari ketika Allah mengumpulkan kaum musyrik bersama apa yang mereka sembah selain Allah, baik malaikat, jin, manusia, maupun makhluk tak bernyawa seperti berhala, lalu dia berfirman kepada sesembahan itu, 'apakah kamu yang menyesatkan hamba-hamba-ku itu dengan paksaan dan tipu daya kamu, atau mereka sendirikah yang sesat dan menyimpang dari jalan yang benar'' 18. Mereka, yakni sesembahan itu, menjawab dengan bahasa masing-masing, 'mahasuci engkau dari segala kekurangan dan sifat buruk. Tidaklah pantas bagi kami mengambil pelindung selain engkau. Maka, mustahil bagi kami memaksa mereka menyembah kami, tetapi mereka sen-dirilah yang sesat dan tidak tahu berterima kasih. Engkau telah memberi mereka dan nenek moyang mereka kenikmatan hidup, namun mereka lena karenanya sehingga mereka melupakan peringatan dari-Mu; dan mereka adalah kaum yang benar-benar binasa dan pantas mendapat siksa. '."
  }
]