[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesembahan-sesembahan selain Allah menjawab, “Mahasuci Engkau, wahai Tuhan kami, dari apa yang mereka perbuat. Tidak benar kami mengambil penolong-penolong selain Engkau yang kami bela. Akan tetapi, Engkau telah memberikan kepada kaum Musyrikin dan nenek moyang mereka kekayaan dan keselamatan dari mara bahaya di dunia, sampai akhirnya mereka lupa untuk mengingatMu, sehingga kemudian mereka menyekutukan (sembahan-sembahan) lain denganMu. Mereka adalah kaum yang binasa. Celaka dan jauh dari hidayah telah menguasai mereka.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Mereka yang disembah itu menjawab, \"Maha Suci Engkau wahai Tuhan kami, tidaklah patut bagi Engkau memiliki sekutu, dan tidak patut bagi kami untuk mengambil pelindung-pelindung selain Engkau, lalu bagaimana bisa kami memerintahkan hamba-hamba-Mu untuk menyembah kami atau selain-Mu? Akan tetapi Engkau telah memberi orang-orang musyrik itu dan bapak-bapak mereka sebelumnya; kenikmatan hidup dunia, sebagai bentuk istidraj (penangguhan agar mereka terus tenggelam dalam nikmat yang menyebabkan bertambahnya dosa dan azab mereka) sampai mereka lupa mengingat Engkau, sehingga mereka pun menyembah selain Engkau, dan kemudian mereka menjadi kaum yang binasa lantaran kedurhakaan mereka\"."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "18. Para sesembahan mereka menjawab dengan penuh pengagungan kepada Allah: “Kami tidak berhak begitu pula dengan seluruh makhluk untuk menyembah selain Engkau, dan menyekutukan Engkau dengan yang lain. Akan tetapi Engkau memberi mereka kenikmatan yang banyak di dunia sehingga mereka sibuk dengan kenikmatan tersebut, sehingga mereka berpaling dari mengingat dan mensyukuri Engkau; sungguh mereka adalah kaum yang akan binasa.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "18. قَالُوا۟ سُبْحٰنَكَ (Mereka (yang disembah itu) menjawab: “Maha Suci Engkau) Ini merupakan keheranan mereka atas perkataan yang ditujukan kepada mereka tadi, karena mereka adalah para malaikat, para nabi, atau benda-benda mati yang tidak berakal. مَا كَانَ يَنۢبَغِى لَنَآ أَن نَّتَّخِذَ مِن دُونِكَ مِنْ أَوْلِيَآءَ(tidaklah patut bagi kami mengambil selain engkau (untuk jadi) pelindung) Yakni tidak pantas bagi kami menjadikan pelindung selain Engkau untuk kami sembah, maka tidak pantas bagi kami menyeru hamba-hamba-Mu agar menyembah kami dan agar mereka tidak menyembah-Mu, sedangkan kami tidak menyembah melainkan kepada Engkau. وَلٰكِن مَّتَّعْتَهُمْ وَءَابَآءَهُمْ حَتَّىٰ نَسُوا۟ الذِّكْرَ(akan tetapi Engkau telah memberi mereka dan bapak-bapak mereka kenikmatan hidup, sampai mereka lupa mengingati (Engkau)) Yakni namun Engkau memberi mereka dan nenek moyang mereka berbagai kenikmatan sehingga mereka lalai dari mengingat-Mu, melupakan nasehat-Mu, dan tidak mentadabburi kitab-Mu, serta tidak memperhatikan kehebatan ciptaan-ciptaan-Mu. وَكَانُوا۟ قَوْمًۢا بُورًا (dan mereka adalah kaum yang binasa) Yakni akibat kelalaian mereka dari mengingat-Mu, mereka menjadi binasa."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "18. Karena terkejut dengan pertanyaan itu, mereka yang disembah berkata: “Maha Suci Engkau dari sesuatu yang tidak sesuai denganMu berupa mengambil anak atau sekutu. Tidak benar dan tidak pantas bagi kami untuk mengambil para penolong selain Engkau” Maknanya tidak pernah terbayang bagi kami untuk mengajak seorang pun untuk menyembah kami, karena kami mencegah hal itu tejadi dan tidak mampu menduduki posisi tersebut. Tapi Wahai Tuhan, Engkau telah memberi mereka dan leluhur mereka berbagai jenis kenikmatan, melebarkan rejeki mereka dan memanjangkan umur mereka sehingga mereka lupa mengingatmu dan membicarakan nikmatmu, dan mereka menjadi kaum yang dihancurkan karena lupa mengingatMu. Yang dimaksud dengan Adz-Dzikru di sini adalah Al-Qur’an dan syari’at"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka menjawab} Mereka yang disembah selain Allah berkata {“Mahasuci Engkau} Maha suci Tuhan Kami dari hal itu {Tidaklah pantas} tidak pantas {bagi kami mengambil pelindung selain Engkau, tetapi Engkau telah memberi mereka dan nenek moyang mereka kenikmatan hidup sehingga mereka melupakan peringatan dan mereka kaum yang binasa”} hancur karena penderitaan dan kegagalan menimpa mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "18 “mereka yang disembah itu menjawab, ’maha suci Engkau,’” mereka menyucikan Allah dari kesyirikan kaum musyrikin dan menyatakan kebebasan diri mereka dari semua itu. “tidaklah patut bagi kami,” maksudnya tidak layak bagi kami dan tidak baik bagi kami menjadikan selain Engkau sebagai pelindung yang mana kami menyembah, beribadah dan berdoa kepada mereka. Lalu apabila kami sangat membutuhkan untuk beribadah kepadaMu dan berlepas diri dari peribadahan kepada selainMu, maka bagaimana mungkin kami akan menyuruh seseorang agar menyembah kami? Ini tidak mungkin! Atau: Mahasuci Engkau, kalau kami menjadikan, “selain Engkau sebagai pelindung.” Ini seperti ucapan Nabi Isa alaihi salam : \"Dan (ingatlah) ketika Allah berfirman: \"Hai Isa putra Maryam, adakah kamu mengatakan kepada manusia: \"Jadikanlah aku dan ibuku dua orang tuhan selain Allah?\" Isa menjawab: \"Maha Suci Engkau, tidaklah patut bagiku mengatakan apa yang bukan hakku (mengatakannya). Jika aku pernah mengatakannya maka tentulah Engkau telah mengetahuinya. Engkau mengetahui apa yang ada pada diriku dan aku tidak mengetahui apa yang ada pada diri Engkau. Sesungguhnya Engkau Maha Mengetahui perkara yang gaib-gaib\".Aku tidak pernah mengatakan kepada mereka kecuali apa yang Engkau perintahkan kepadaku (mengatakan) nya yaitu: \"Sembahlah Allah, Tuhanku dan Tuhanmu\", dan adalah aku menjadi saksi terhadap mereka, selama aku berada di antara mereka. Maka setelah Engkau wafatkan (angkat) aku, Engkau-lah yang mengawasi mereka. Dan Engkau adalah Maha Menyaksikan atas segala sesuatu.\" (QS. Al-Maidah : 116-117) Dan Allah berfirman : \"Dan (ingatlah) hari (yang di waktu itu) Allah mengumpulkan mereka semuanya kemudian Allah berfirman kepada malaikat: \"Apakah mereka ini dahulu menyembah kamu?\". Malaikat-malaikat itu menjawab: \"Maha Suci Engkau. Engkaulah pelindung kami, bukan mereka: bahkan mereka telah menyembah jin; kebanyakan mereka beriman kepada jin itu\". (QS. Saba : 40-41) “dan apabila manusia dikumpulkan pada Hari kiamat niscaya sembahan-sembahan mereka itu menjadi musuh mereka dan mengingkari pemujaan-pemujaan mereka,” (QS. al-ahqaf:6) Setelah mereka menyatakan kebebasan diri mereka dari ajakan untuk beribadah kepada selain Allah, atau dari keberadaan mereka sebagai makhluk yang menyesatkan mereka, maka mereka menyebutkan sebab yang mengakibatkan kesesatan kaum musyrikin, seraya berkata, ”akan tetapi Engkau telah memberi mereka bapak-bapak mereka kenikmatan hidup,” di dalam kelezatan dunia dan syahwat dan berbagai tuntutannya yang bersifar biologis, “sampai mereka lupa kepada dzikir,” karena sibuk dengan kelezatan dunia dan tenggelam dalam gemerlapnya, sehingga mereka hanya menjaga harta benda mereka dan menyia-nyiakan agama mereka, “dan mereka adalah kaum yang binasa,” yakni orang-orang yang busuk, tidak ada kebaikannya, tidak bisa menjadi shalih dan tidak cocok kecuali untuk dibinasakan dan dihancurkan. Jadi, mereka menjelaskan penghalang yang telah menghalangi mereka untuk mengikuti kebenaran, yaitu berfoya-foya dalam kehidupan dunia, yang telah memalingkan mereka dari petunjuk dan dari segala jalan menuju petunjuk, dan bahwasannya mereka sama sekali tidak memiliki kebaikan. Lalu ketika petunjuk kebenaran telah hilang dan penghalangnya muncul, maka tidak ada suatu keburukan dan kebinasaan yang kamu kehendaki melainkan pasti kamu temukan ada pada mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Furqan ayat 18: Dari perbuatan syrik orang-orang musyrik. Maksudnya, setelah mereka dikumpulkan bersama apa yang mereka sembah, yaitu malaikat, Uzair, Nabi Isa ‘alaihis salam dan berhala-berhala, dan setelah Allah menanyakan kepada yang disembah itu, apakah mereka yang menyesatkan orang-orang itu ataukah orang-orang itu yang sesat sendiri? Maka yang disembah itu menjawab bahwa tidaklah patut bagi mereka untuk menyembah selain Allah, apalagi untuk menyuruh orang lain menyembah selain Allah Subhaanahu wa Ta'aala. Lihat surah Al Maa’idah: 116, di sana diterangkan jawaban Nabi Isa ‘alaihis salam ketika ditanya oleh Allah –dan Dia lebih mengetahui- apakah Beliau menyuruh manusia menyembah dirinya? Demikian pula lihat jawaban sesembahan yang mereka sembah di surah Saba’: 40-41, dan bahwa sesembahan itu akan menjadi musuh bagi mereka sebagaimana di surah Al Ahqaaf: 6. Setelah mereka menyatakan bahwa diri mereka tidak mengajak manusia menyembah selain Allah atau menyesatkan mereka, maka mereka sebutkan sebab yang menjadikan orang-orang musyrik tersesat. Yaitu panjang umur dan rezeki yang luas. Karena sibuk dengan kesenangan dunia dan mendatangi syahwatnya, mereka jaga dunia mereka, tetapi agama mereka, mereka telantarkan. Inilah yang membuat mereka terhalang dari petunjuk. Maksudnya, tidak ada kebaikannya dan tidak cocok untuk hal yang baik, bahkan cocok untuk binasa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Furqan Ayat 18",
    "description": "Mereka, yakni sesembahan itu, menjawab dengan bahasa masing-masing, 'mahasuci engkau dari segala kekurangan dan sifat buruk. Tidaklah pantas bagi kami mengambil pelindung selain engkau. Maka, mustahil bagi kami memaksa mereka menyembah kami, tetapi mereka sen-dirilah yang sesat dan tidak tahu berterima kasih. Engkau telah memberi mereka dan nenek moyang mereka kenikmatan hidup, namun mereka lena karenanya sehingga mereka melupakan peringatan dari-Mu; dan mereka adalah kaum yang benar-benar binasa dan pantas mendapat siksa. '19. Allah menegaskan kepada kaum musyrik yang berdalih bahwa ke-sesatan mereka disebabkan oleh ajakan dan tipu daya sesembahan me-reka, maka sungguh kamu telah berbohong! tuhan-tuhan yang kamu sembah itu telah mengingkari apa yang kamu katakan, maka kamu tidak akan dapat menolak azab akibat perbuatan kamu sendiri, dan tidak dapat pula menolong dirimu. Dan barang siapa di antara kamu berbuat zalim, utamanya syirik, niscaya kami timpakan kepadanya rasa azab yang besar."
  }
]