[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian dikatakan kepada kaum musyrikin, “Sesungguhnya sesembahan-sesembahan yang dahulu kalian sembah mendustakan kalian dalam klaim kalian terhadap mereka. Kalian sekarang sendirian, tidak dapat menghalau siksaan dari diri kalian sendiri dan tidak bisa memberikan pertolongan bagi diri kalian sendiri. Dan barangsiapa menyekutukan Allah, menganiaya diri sendiri dan menyembah selain Allah, dan mati dalam keadaan itu, niscaya Allah akan menyiksanya dengan siksaan yang keras"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Maka sesungguhnya mereka yang kalian sembah selain Allah itu -wahai orang-orang musyrik- telah mendustakan kalian tentang apa yang kalian klaim atas mereka, maka kalian tidak akan dapat menolak azab dari diri kalian dan tidak pula menolong diri kalian sendiri lantaran lemahnya kalian. Siapa di antara kalian -wahai orang-orang mukmin- berbuat zalim dengan melakukan kesyirikan kepada Allah, niscaya Kami rasakan kepadanya azab yang besar seperti yang Kami rasakan kepada kaum yang disebutkan sebelumnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "19. Kemudian Allah menyampaikan kepada orang-orang musyrik: Yang kalian sembah telah berlepas diri dari perbuatan kalian dan mendustakan kalian yang berkata bahwa mereka adalah tuhan-tuhan. Kalian tidak dapat mengelak dari azab atau menolong diri kalian dari siksaan. Dan barangsiapa yang menyekutukan Allah maka dia telah menzalimi dirinya sendiri dan berhak dimasukkan ke dalam neraka Jahannam dengan siksaannya yang sangat pedih."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "19. فَقَدْ كَذَّبُوكُم بِمَا تَقُولُونَ (maka sesungguhnya mereka (yang disembah itu) telah mendustakan kamu tentang apa yang kamu katakan) Setelah yang disembah itu berlepas diri dari para penyembahnya, Allah berkata kepada orang-orang musyrik yang menyembah selain-Nya: “lihatlah, mereka yang kalian sembah itu telah mengingkari kalian yang mengatakan mereka adalah Tuhan-Tuhan.” فَمَا تَسْتَطِيعُونَ صَرْفًا(maka kamu tidak akan dapat menolak (azab)) Yakni setelah yang disembah itu mengingkari orang-orang kafir itu, maka mereka tidak dapat menghindar dari azab yang ditimpakan Allah kepada mereka. وَلَا نَصْرًا ۚ( dan tidak (pula) menolong (dirimu)) Dan mereka tidak memiliki seorangpun penolong yang menyelamatkan mereka dari azab Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19. Setelah berlepas dari mereka yang disembah, Allah berfirman kepada orang-orang musyrik: “Sungguh mereka yang disembah itu telah mendustakan kalian dalam anggapan kalian bahwa mereka adalah tuhan. Dan barangsiapa di antara kalian yang menzalimi diri sendiri dengan berpegang teguh atas kesyirikan tanpa bertaubat, maka Kami akan membuatnya merasakan azab yang sangat menakutkan di akhirat, yaitu neraka”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sungguh mereka telah mengingkari kalian} yang disembah itu mengingkari kalian {terkait apa yang kalian katakan. Sehingga kalian tidak bisa menolak} menolak azab {dan tidak dapat menolong. Siapa saja di antara kalian yang berbuat zalim} berbuat musyrik {niscaya Kami membuatnya merasakan azab yang besar."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "19 setelah sembahan-sembahan itu berlepas diri dari mereka Allah berfirman dengan nada mencerca dan memojokkan orang-orang yang berkeras kepala itu, “maka sungguh mereka (yang disembah itu) telah mendustakan kalian tentang apa yang kalian katakan,” yaitu bahwa sesungguhnya mereka telah memerintahkan kalian untuk menyembahnya, dan mereka rela dengan perbuatan kalian, dan sesungguhnya mereka adalah para pemberi syafaat bagi kalian di sisi tuhan kalian. Mereka telah mendustakan kalian dalam klaim itu. Mereka telah menjadi musuh utama kalian. Maka sangatlah pantas kalian mendapat azab. “maka kalian tidak akan dapat menolak,” azab dari kalian dengan perbuatan kalian atau dengan suatu tebusan atau lain-lainnya, “dan tidak pula menolong (diri kalian),” karena kerapuhan kalian dan tidak adanya penolong kalian. Inilah hukuman bagi orang-orang yang sesat, bodoh nan bertaklid buta, sebagaimana anda ketahui, ia adalah seburuk-buruk hukuman dan neraka adalah sejelek-jeleknya tempat tinggal. Adapun orang yang menentang (keras kepala) dari mereka, yaitu orang yang telah mengetahui kebenaran namun berpaling darinya, maka Allah berfirman, ”dan barangsiapa dari kalian yang berbuat zhalim,” sengaja meninggalkan kebenaran secara zhalim dan keras kepala, “niscaya kami rasakan kepadanya azab yang besar,” tidak dapat diukur besarnya dan tidak bisa dibayangkan keadaannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Furqan ayat 19: Setelah sesembahan itu menyatakan berlepas diri dari penyembahnya, maka Allah Subhaanahu wa Ta'aala berfirman kepada para penyembahnya sambil mencelanya. Yakni bahwa mereka memerintahkan kamu menyembahnya dan mereka ridha dengan perbuatan kamu menyembah mereka. Karena lemahnya dirimu dan tidak ada yang menolongmu. Inilah balasan untuk orang-orang yang sesat, ikut-ikutan lagi jahil (bodoh), adapun orang yang menentang, yakni yang mengetahui yang hak tetapi berpaling darinya, maka balasannya disebutkan pada lanjutan ayatnya. Yakni berbuat syirk, atau meninggalkan yang hak karena zalim dan menentang."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Furqan Ayat 19",
    "description": "Allah menegaskan kepada kaum musyrik yang berdalih bahwa ke-sesatan mereka disebabkan oleh ajakan dan tipu daya sesembahan me-reka, maka sungguh kamu telah berbohong! tuhan-tuhan yang kamu sembah itu telah mengingkari apa yang kamu katakan, maka kamu tidak akan dapat menolak azab akibat perbuatan kamu sendiri, dan tidak dapat pula menolong dirimu. Dan barang siapa di antara kamu berbuat zalim, utamanya syirik, niscaya kami timpakan kepadanya rasa azab yang besar. 20. Ayat ini kembali menegaskan sisi kemanusiaan seorang rasul un-tuk membantah keberatan kaum musyrik. Dan kami tidak mengutus rasul-rasul sebelummu, wahai nabi Muhammad, melainkan mereka adalah manusia-manusia juga sepertimu, dan karenanya mereka pasti memakan makanan dan berjalan di pasar-pasar seperti halnya manusia pada umumnya. Demikianlah keadaan semua nabi dan rasul. Dan ingatlah wahai manusia, kami sengaja menjadikan keadaan rasul-rasul seperti itu karena telah menjadi ketetapan kami bahwa sebagian kamu akan menjadi cobaan bagi sebagian yang lain. Nabi menjadi cobaan bagi umatnya, demikian juga sebaliknya; orang kaya menjadi cobaan bagi orang miskin, begitupun sebaliknya; kaum musyrik menjadi cobaan bagi kaum mukmin, demikian sebaliknya, dan begitulah seterusnya. Maukah kamu bersabar dalam menghadapi cobaan itu' dan ingatlah juga wahai manusia, tuhanmu maha melihat lagi maha mengetahui segala sesuatu. []."
  }
]