[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Yang memiliki kerajaan langit dan bumi, dan Dia tidak mengambil anak, dan Dia tidak mengambil sekutu dalam kerajaanNya, dan Dia-lah Yang menciptakan segala sesuatu dan menyempurnakannya sesuai dengan bentuk ciptaan yang tepat dengan tuntutan hikmahNya tanpa adanya kekurangan dan kekeliruan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Hanya Dia yang memiliki kerajaan langit dan bumi, Dia tidak beranak, dan tidak pula memiliki sekutu dalam kekuasaan-Nya. Dia menciptakan segala sesuatu, dan Dia menetapkan takdir dan ukuran penciptaan mahkluk-Nya sesuai kehendak ilmu dan kebijaksanaan-Nya, yang masing-masingnya cocok dengan itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. الَّذِى لَهُۥ مُلْكُ السَّمٰوٰتِ وَالْأَرْضِ (yang kepunyaan-Nya-lah kerajaan langit dan bumi) Hanya Dia-lah pemilik keduanya dan Dia yang mengaturnya, seluruh makhluk bergantung kepadanya dalam kehidupannya. وَلَمْ يَتَّخِذْ وَلَدًا(dan Dia tidak mempunyai anak) Dalam potongan ayat ini terdapat bantahan bagi orang-orang Nasrani dan Yahudi. وَلَمْ يَكُن لَّهُۥ شَرِيكٌ فِى الْمُلْكِ (dan tidak ada sekutu bagi-Nya dalam kekuasaan(Nya)) Dalam potongan ayat ini terdapat bantahan bagi sebagian golongan orang-orang musyrik penyembah berhala atau penyembah cahaya dan kegelapan serta para pelaku syirik yang tersembunyi. وَخَلَقَ كُلَّ شَىْء(dan dia telah menciptakan segala sesuatu) Yakni segala sesuatu yang ada. فَقَدَّرَهُۥ تَقْدِيرًا(dan Dia menetapkan ukuran-ukurannya dengan serapi-rapinya) Dengan hikmah yang Dia kehendaki; Allah mengaturnya sesuai dengan kemaslahatannya dan menentukan ajal dan rezeki dengan sempurna, sehingga segala ketentuan berlaku sesuai yang telah Allah tetapkan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1-2 Bagaimana keagungan al-Qur'an bisa tertanam dalam diri anda? Syaikh Farid al-Anshari pernah berkata, di sela tadabburnya tentang surat al-Furqan: Sesungguhnya pengakuan seorang mukmin akan keagungan al-Qur'an dapat dibuktikan ketika ia telah mengakui keagungan dzat yang berkata dalam al-Qur'an itu, Yakni Allah ta'ala Tuhan semesta alam; karena nilai suatu ucapan merupakan bagian dari nilai siapa yang mengatakannya, jika hal ini dapat kamu perhatikan dengan baik, maka kamu telah menemukan kekayaan al-Qur'an yang sesungguhnya. Oleh karena itu Allah kemudian mengatakan pada ayat selanjutnya sebagai pengenalan tentang siapa yang menurunkan ayat-ayat ini: { ٱلَّذِى لَهُۥ مُلْكُ ٱلسَّمَٰوَٰتِ وَٱلْأَرْضِ وَلَمْ يَتَّخِذْ وَلَدًا وَلَمْ يَكُن لَّهُۥ شَرِيكٌ فِى ٱلْمُلْكِ وَخَلَقَ كُلَّ شَىْءٍ فَقَدَّرَهُۥ تَقْدِيرًا } \"Yang kepunyaan-Nya-lah kerajaan langit dan bumi, dan Dia tidak mempunyai anak, dan tidak ada sekutu bagi-Nya dalam kekuasaan(Nya), dan dia telah menciptakan segala sesuatu, dan Dia menetapkan ukuran-ukurannya dengan serapi-rapinya\". Seakan-akan pada ayat pertama: { تَبَارَكَ ٱلَّذِى نَزَّلَ ٱلْفُرْقَانَ } \"Maha suci Allah yang telah menurunkan Al Furqaan (Al Quran)\" ditanyakan, siapakah yang menurunkannya? maka kemudian dijawab dengan sifat-sifat Nya yang agung dan mulia yang meninggikan sifat Rububiyyah-Nya secara muthlaq."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Allah adalah Dzat yang memiliki kerajaan langit dan bumi. MilikNya juga otoritas penuh dan kekuasaan yang utuh dalam mengatur sesuatu yang ada di dalam keduanya. Dia tidak mengambil anak karena tidak membutuhkannya. Dan tidak ada sekutu bagiNya dalam kerajaan itu karena tidak memerlukannya. Dia juga menciptakan setiap sesuatu, yaitu makhluk-makhluk yang ada, lalu menentukan takdirnya dengan terperinci dan penuh hikmah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dzat yang memiliki kerajaan langit dan bumi, Dia tidak mempunyai anak, dan tidak ada satu sekutu pun dalam kekuasaanNya. Dia telah menciptakan segala sesuatu, lalu menetapkan ukuran-ukurannya dengan tepat} lalu menyesuaikan ukurannya sesuai dengan apa yang baik baginya tanpa adanya kecacatan dan ketidak seimbangan di dalamnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2 “yang kepunyaanNya-lah kerajaan langit dan bumi,” maksudnya kepunyaanNya semata hak pengendalian pada keduanya, apa saja yang ada pada keduanya adalah hamba dan budak bagiNya, tunduk kepada keagunganNYa lagi patuh kepada rububiyahNya, dan mereka sangat butuh kepada belas kasihNya; yang mana “Dia tidak mempunyai anak, dan tidak ada sekutu bayiNya dalam kekuasaan(Nya),” bagaimana mungkin Dia akan mempunyai anak atau sekutu, sedangkan Dia adalah yang Maha Raja (kuasa) sedangkan selain Dia adalah budak-budakNya; dan Dia-lah yang Mhaperkasa, sedangkan selain Dia adalah di bawah keperkasaanNya; dan Dia-lah Yang Mahakaya dengan DzatNya drai segala sisi, sedangkan semua makhluk sangat tergantung [butuh]kepadaNya secara otomatis dari segala sisi? Dan bagaimana mungkin Dia akan mempunyai sekutu dalam kerajaan (kekuasaanNya), sedangkan ubun-ubun semua (makhluk) ada ditanganNYa. Mereka tidak bergerak atau diam dan tidak pula berbuat kecuali denagn izinNya. Maka Mahasuci Allah dari semua itu dengan sesuci-suciNya. Sungguh orang yang mengatakan demikian sama sekali tidak menaruh hormat kepada Allah dengan penghormatan yang sebenar-benarnya. Maka dari itu Dia berfirman, ”dan Dia telah menciptakan segala sesuatu,” meliputi alam atas dan alam bawah, yang berupa hewan, tumbuh-tumbuhan dan benda-benda mati, “lalu Dia menetapkan ukuran-ukuranNYa dengan serapi-rapinya,” maksudnya, Dia telah memberikan kepada setiap makhluk (ciptaan) itu segala sesuatu yang pantas dan sesuai dengannya sebagai ciptaan, dan sesuai dengan tuntunan kebijaksanaanNya dalam semua itu; sehingga setiap makhluk (ciptaanNya) menjadi sangat tidak masuk akal sehat kalau terbentuk berbeda dengan bentuk dan rupanya yang tampak, bahkan setiap bagian dan anggota dari suatu makhluk (ciptaan) tidak akan cocok baginya selain tempat yang telah ditetapkan untuknya. Allah berfirman, ”sucikanlah nama Rabbmu yang Paling Tinggi, yang menciptakan dan meneyempurnakan (penciptaanNya), dan yang menentukan kadar (masing-masing) lalu memberi petunjuk.” (QS. al-a’la:1-3) Dan Dia berfirman, ”Rabb kami ialah (Rabb) yang telah memberikan kepada tiap-tiap sesuatu bentuk kejadiannya, kemudian memberinya petunjuk,” (QS. thaha:50) Setelah Allah menjelaskan kesempurnaanNya, keagungan dan berlimpahnya karuniaNYa, dan hal itu mengharuskan agar (hanya) Dia semata yang pantas dicintai, diibadahi (disembah), diagungkan, diesakan dengan tulus, tidak ada sekutu bagiNya, maka sangat tepat untuk dijelaskan kebatilan beribadah (menyembah) kepada selainNya"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Furqan ayat 2: Dia yang mengaturnya sendiri, dan semua yang ada di dalamnya adalah milik-Nya dan hamba-Nya, tunduk kepada rububiyyah-Nya dan butuh kepada rahmat-Nya. Bagaimana mungkin Dia mempunyai anak dan sekutu, padahal Dia yang memiliki alam semesta, sedangkan selain-Nya dimiliki, Dia berkuasa, sedangkan selain-Nya dikuasai, Dia Mahakaya dari segala sisi, sedangkan selain-Nya butuh kepada-Nya dari segala sisi, dan bagaimana mungkin Dia memiliki sekutu dalam kerajaan-Nya, padahal semua makhluk di bawah ketetapan-Nya, di mana mereka tidak bertindak kecuali dengan izin-Nya, maka Mahatinggi Allah dari memiliki anak dan sekutu dengan ketinggian yang setinggi-tingginya, dan orang yang mengatakan demikian berarti tidak mengagungkan-Nya dengan pengagungan yang semestinya. Baik alam bagian atas maupun alam bagian bawah, baik manusia, jin, malaikat, hewan, tumbuhan, benda mati, dan lain-lain. Maksudnya, segala sesuatu yang diciptakan Allah diberi-Nya perlengkapan-perlengkapan dan persiapan-persiapan, sesuai dengan naluri, sifat-sifat dan fungsinya masing-masing dalam hidup."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Furqan Ayat 2",
    "description": "Allah yang menurunkan 'furq'n' itu adalah dia yang memiliki ke-rajaan langit dan bumi. Kekuasaan-Nya begitu sempurna dan kemampuan-Nya tidak berbatas dalam mengurus keduanya. Dia tidak mempunyai anak karena dia tidak membutuhkannya, dan tidak pula ada sekutu bagi-Nya dalam kekuasaan-Nya karena dia mahakuasa sehingga tidak memerlukan bantuan, dan dia menciptakan segala sesuatu lalu menetapkan ukuran-ukurannya dengan tepat, teliti, dan penuh hikmah. 3. Tanda-tanda kekuasaan Allah begitu nyata, sehingga keengganan kaum kafir untuk bertauhid amat mengherankan. Dan mereka mengambil tuhan-tuhan selain Allah untuk disembah, padahal tuhan-tuhan itu tidak dapat menciptakan apa pun, bahkan tuhan-tuhan itu sendiri diciptakan dan juga sangat lemah sehingga tidak kuasa untuk menolak bahaya terhadap dirinya sendiri dan tidak pula dapat mendatangkan manfaat, serta tidak kuasa mematikan apa pun, menghidupkan apa pun, dan tidak dapat pula membangkitkan sesuatu yang telah mati."
  }
]