[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Kami tidak mengutus sebelum kamu, (wahai Rasul) seseorang dari rasul-rasul Kami kecuali mereka itu bangsa manusia, yang memakan makanan dan berjalan di pasar-pasar. Dan Kami jadikan sebagian kalian (wahai manusia) cobaan dan ujian bagi sebagian lainnya, melalui hidayah dan kesesatan, kekayaan dan kemiskinan, sehat dan sakit; apakah kalian bersabar sehingga kalian menjalankan kewajiban yang Allah tetapkan atas kalian dan mensyukuriNya dan kemudian Penguasa kalian memberi balasan bagi kalian, atau kalian tidak bersabar sehingga mengakibatkan kalian pantas ditimpa musibah? Dan Tuhanmu (wahai Rasul) Maha Melihat orang yang berkeluh kesah atau bersabar, dan orang yang ingkar atau orang yang bersyukur."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "20. \"Dan tidaklah Kami mengutus para rasul sebelummu -wahai Rasul- melainkan dari jenis manusia, mereka juga memakan makanan dan berjalan di pasar-pasar, dan engkau bukan Rasul pertama yang melakukan itu. Kami jadikan sebagian kalian -wahai manusia- sebagai cobaan bagi sebagian yang lain dalam hal kekayaan, kemiskinan, sehat dan sakit, maka maukah kalian bersabar dengan cobaan ini sehingga kalian diberikan ganjaran pahala atas kesabaran itu? dan adalah Tuhanmu Maha Melihat siapa saja yang bersabar dan yang tidak bersabar, juga siapa saja yang taat dan yang bermaksiat kepada-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "20. Hai Rasulullah, dan Kami tidak mengutus para rasul sebelummu melainkan mereka dari golongan manusia, mereka memakan makanan sebagaimana kamu makan, dan pulang pergi ke pasar untuk mencari penghidupan. Dan Kami menguji sebagian kalian dengan sebagian lainnya; Kami menguji orang miskin dengan orang kaya, dan juga sebaliknya; agar Kami dapat menguji kesabaran kalian, apakah kalian akan bersyukur atau ingkar? Dan Tuhanmu Maha Melihat orang-orang yang bersyukur dan orang-orang yang ingkar."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "20. وَمَآ أَرْسَلْنَا قَبْلَكَ مِنَ الْمُرْسَلِينَ إِلَّآ إِنَّهُمْ لَيَأْكُلُونَ الطَّعَامَ وَيَمْشُونَ فِى الْأَسْوَاقِ ۗ (Dan Kami tidak mengutus rasul-rasul sebelummu, melainkan mereka sungguh memakan makanan dan berjalan di pasar-pasar) Sebab mereka adalah manusia biasa yang tidak dapat lepas dari kebutuhan-kebutuhan yang menunjang kehidupan manusia, dan demikian pula kamu hai Muhammad, hal itu tidak menghalangimu untuk menjadi rasul yang diutus oleh Allah; jadi untuk apa mereka berkata: “mengapa rasul ini memakan makanan dan masuk ke pasar-pasar?” وَجَعَلْنَا بَعْضَكُمْ لِبَعْضٍ فِتْنَةً(Dan kami jadikan sebahagian kamu cobaan bagi sebahagian yang lain) Dahulu jika ada orang terpandang yang akan masuk Islam namun ia melihat orang rendahan yang telah masuk Islam sebelumnya, ia menjadi enggan untuk masuk Islam sambil berkata “aku tidak akan masuk Islam setelahnya, karena itu akan membuatnya lebih utama dan mulia dariku,” maka ia akhirnya tetap dalam kekafirannya. أَتَصْبِرُونَ ۗ( Maukah kamu bersabar?) Yakni apakah kalian akan tetap bersabar di atas kebenaran yang penuh dengan cobaan dan kesulitan sebagaimana yang kalian lihat. وَكَانَ رَبُّكَ بَصِيرًا(dan adalah Tuhanmu maha Melihat) Yakni melihat kepada setiap orang yang bersabar maupun yang tidak bersabar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20. Menanggapi keraguan terhadap nabi sebagai seorang manusia, Allah berfirman: “Wahai Rasulallah, Kami tidak mengutus satupun rasul sebelum kamu kecuali mereka itu adalah seorang manusia. Mereka memakan makanan sebagaimana yang kamu makan dan seringkali di pasar untuk mencari biaya hidup sebagaimana yang kamu kerjakan, dan Kami menjadikan sebagian kalian ujian dan cobaan untuk sebagian lainnya. Kami uji yang kaya dengan yang fakir, yang sehad dengan yang sakit, dan yang mulia dengan yang rendah untuk mengetahui tingkat keteguhannya untuk beriman. Apakah kalian akan bersabar atas kebenaran dan musibah? Dan Tuanmu Maha Mengamati orang yang sabar dan tidak sabar.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami tidak mengutus rasul-rasul sebelummu melainkan mereka menyantap makanan dan berjalan di pasar. Kami menjadikan sebagian kalian sebagai cobaan} cobaan dan ujian {bagi sebagian yang lain. Apakah kalian akan bersabar. Dan Tuhanmu Maha Melihat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "20 kemudian Allah berfirman sebagai jawaban terhadap perkataan kaum yang mendustakan,-“kenapa rasul ini memakan makan dan berjalan di pasar-pasar?”- “dan kami tidak mengutus rasul-rasul sebelummu, melainkan mereka pasti memakan makanan dan berjalan di pasar-pasar,” kami sekali-kali tidak menjadikan mereka jasad yang tidak memakan makan-makanan, dan kamipun tidak menjadikan mereka sebagai malaikat, sehingga kamu dapat menjadikannya sebagai suri tauladan. Adapun masalah kaya atau fakir, ini semua dalah ujian dan kebijakan dari Allah, sebagaimana difirmankanNya, ”dan kami jadikan sebagian kalian cobaan bagi yang lain.” Jadi, seorang rasul itu adalah ujian bagi umatnya dan cobaan bagi orang-orang yang taat dari orang-orang yang durhaka. Para rasul itu sendiri, kami menguji mereka dengan dakwah (menyeru) manusia, orang yang kaya adalah cobaan bagi orang yang fakir, dan yang fakir adalah cobaan bagi yang kaya. Demikian pula berbagai jenis makhluk di dalam negeri ini, yaitu negeri cobaan, bala dan ujian. Dan tujuan dari cobaan itu adalah “sanggupkah kalian bersabar,” sehingga kalian tetap melaksanakan apa yang menjadi tugas wajib kalian, kemudian Allah membalas kalian. Ataukah kalian tidak sanggup bersabar sehingga berhak mendapat hukuman? “dan Rabbmu adalah MahaMelihat,” Dia mengetahui semua kondisi kalian, dan Dia memilih orang yang Dia ketahui layak dan pantas untuk mengemban risalahNya, dan Dia mengistimewakannya dengan memberinya keutamaan, dan Dia mengetahui semua perbuatan kalian, dan kelak Dia akan memberikan balasan yang setimpal atasnya. Jika baik, maka dibalas dengan kebaikan dan jika buruk, maka di balas dengan keburukan pula."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Furqan ayat 20: Kemudian Allah Subhaanahu wa Ta'aala berfirman menjawab orang-orang yang mendustakan, yang mengatakan seperti yang disebutkan pada ayat 7 surah ini. Allah Subhaanahu wa Ta'aala tidak menjadikan mereka malaikat agar mereka dapat ditiru dan dijadikan teladan. Adapun masalah kaya dan miskin, maka yang demikian adalah cobaan dan hikmah (kebijaksanaan) Allah sebagaimana dijelaskan pada lanjutan ayat. Manusia diuji dengan rasul, apakah mereka akan taat atau tidak? Rasul diuji dengan mendakwahkan manusia, orang miskin diuji dengan orang kaya, orang sakit diuji dengan orang sehat, dan orang rendah diuji dengan orang terhormat, sehingga mereka berkata, “Mengapa aku tidak seperti dia yang kaya, yang sehat atau yang terhormat?” Oleh karena itu, tempat yang kita huni ini adalah tempat ujian, bukan tempat tujuan. Pertanyaan ini maksudnya perintah untuk bersabar, yakni maukah kamu untuk bersabar dengan melaksanakan kewajiban kamu? Yaitu tetap taat dan tetap meninggalkan maksiat, serta bersabar terhadap musibah dengan tidak keluh kesah. Siapa yang bersabar dan siapa yang berkeluh kesah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Furqan Ayat 20",
    "description": "Ayat ini kembali menegaskan sisi kemanusiaan seorang rasul un-tuk membantah keberatan kaum musyrik. Dan kami tidak mengutus rasul-rasul sebelummu, wahai nabi Muhammad, melainkan mereka adalah manusia-manusia juga sepertimu, dan karenanya mereka pasti memakan makanan dan berjalan di pasar-pasar seperti halnya manusia pada umumnya. Demikianlah keadaan semua nabi dan rasul. Dan ingatlah wahai manusia, kami sengaja menjadikan keadaan rasul-rasul seperti itu karena telah menjadi ketetapan kami bahwa sebagian kamu akan menjadi cobaan bagi sebagian yang lain. Nabi menjadi cobaan bagi umatnya, demikian juga sebaliknya; orang kaya menjadi cobaan bagi orang miskin, begitupun sebaliknya; kaum musyrik menjadi cobaan bagi kaum mukmin, demikian sebaliknya, dan begitulah seterusnya. Maukah kamu bersabar dalam menghadapi cobaan itu' dan ingatlah juga wahai manusia, tuhanmu maha melihat lagi maha mengetahui segala sesuatu. []21. Ayat ini menjelaskan tentang alasan lainnya yang dibuat-buat kaum musyrik mekah karena keengganan mereka beriman kepada nabi Muhammad. Dan orang-orang yang tidak mengharapkan pertemuan dengan kami di akhirat karena keingkaran mereka terhadap adanya hari akhir, atau karena ketidaktakutan mereka terhadapnya, mereka berkata, 'mengapa bukan para malaikat yang diturunkan kepada kita dalam wujudnya yang nyata, yang memberitahukan tentang kebenaran nabi Muhammad, atau mengapa kita tidak melihat tuhan kita' dengan mata kepala kita yang juga memberitahukan tentang kebenaran nabi Muhammad. \" permintaan-permintaan tersebut jelas mengada-ada, sama dengan apa yang dilakukan bani israil dahulu. Hal itu jelas muncul dari hati mereka yang penuh kedengkian. Sungguh, mereka telah me-nyombongkan diri mereka karena terbujuk oleh hawa nafsu. Mereka meng-anggap bahwa merekalah yang lebih mulia, baik karena kekayaan atau kedudukan mereka di masyarakat. Dan mereka benar-benar telah melampaui batas dalam melakukan kezaliman. Demikianlah jika hati telah tertutup oleh kekafiran, semua kebenaran yang ada di hadapan, walau sudah terang benderang, tidak diacuhkan sama sekali."
  }
]