[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan berkatalah orang-orang yang tidak berharap perjumpaan dengan tuhan mereka setelah kematian mereka, didorong rasa pengingkaran terhadapnya, “Mengapa tidak diturunkan kepada kami malaikat untuk memberitahukan kepada kami bahwa sesungguhnya Muhammad adalah orang yang jujur, atau kami dapat menyaksikan Tuhan kami dengan mata kepala kami, lalu Dia memberitahukan kepada kami tentang kebenarannya dalam mengemban risalahNya?” sungguh, mereka telah bangga memandang diri mereka dan mereka sombong, lantaran berani melontarkan ucapan tersebut dan bertindak melampaui batas dalam penentangan dan kekafiran mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Orang-orang kafir yang tidak berharap adanya pertemuan dengan Kami dan tidak pula takut akan azab Kami mengatakan, \"Mengapakah Allah tidak menurunkan Malaikat agar ia mengabarkan kepada kami tentang kebenaran Muhammad, atau mengapa kami tidak melihat Tuhan kami secara nyata agar Dia mengabarkan tentang kebenaran Muhammad?\" Sesungguhnya rasa angkuh telah membesar sekali dalam diri mereka hingga menghalangi mereka dari keimanan, dan dengan perkataan mereka ini, mereka benar-benar telah melampaui batas dalam melakukan kekafiran dan kedurhakaan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "21. Dan orang-orang yang tidak mengharap dan tidak meyakini perjumpaan dengan Allah pada hari kiamat berkata: “Mengapa malaikat tidak turun kepada kami dan menyampaikan kebenaran Muhammad, atau mengapa kami tidak dapat melihat Allah dengan mata kepala kami.” Sungguh mereka dalam diri mereka terdapat kesombongan terhadap dakwah Nabi Muhammad dan mereka telah berbuat semena-mena."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "21. وَقَالَ الَّذِينَ لَا يَرْجُونَ لِقَآءَنَا (Berkatalah orang-orang yang tidak menanti-nanti pertemuan(nya) dengan Kami) Yakni orang-orang yang tidak mengharapkan pahala yang telah Kami janjikan sebagai balasan ketaatan. لَوْلَآ أُنزِلَ عَلَيْنَا الْمَلٰٓئِكَةُ(Mengapakah tidak diturunkan kepada kita malaikat) Kemudian malaikat itu mengatakan kepada kami bahwa Muhammad adalah orang yang benar. Atau maksudnya adalah mengapa tidak diturunkan kepada kami rasul-rasul yang diutus Allah. أَوْ نَرَىٰ رَبَّنَا ۗ( atau (mengapa) kita (tidak) melihat Tuhan kita) Yakni melihat Tuhan secara langsung, yang mengatakan kepada Kami bahwa Muhammad adalah rasul yang Dia utus. لَقَدِ اسْتَكْبَرُوا۟ فِىٓ أَنفُسِهِمْ وَعَتَوْ عُتُوًّا كَبِيرًا (Sesungguhnya mereka memandang besar tentang diri mereka dan mereka benar-benar telah melampaui batas(dalam melakukan) kezaliman) Yakni mereka menyimpan keangkuhan dan kedurhakaan dalam hati mereka terhadap kebenaran. Mereka tidak puas dengan manusia yang diutus kepada mereka sehingga meminta untuk diutus malaikat kepada mereka, bahkan lebih dari itu, mereka juga memberikan pilihan antara diutusnya malaikat kepada mereka atau mereka dapat melihat dan berbicara dengan Allah di dunia tanpa perantara."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "21. Orang-orang yang mengingkari hari kebangkitan yang tidak menantikan pertemuan dengan Allah di akhirat berkata: ”Kenapa Allah tidak menurunkan malaikat kepada kami untuk mengabarkan tentang kebenaran Muhammad atau (mengapa) kami tidak bisa melihat Tuhan kami dengan mata kepala kami sehingga Dia bisa memberitahu kami bahwa Muhammad adalah rasul yang Dia utus.” Sungguh mereka sangat menyombongkan diri sendiri sehingga ingin dihormati sebagai wujud keagungan. Mereka juga melampaui batas dalam berbuat kezaliman dan kesewenang-wenangan dengan meminta pengutusan malaikat dan melihat Allah di dunia"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang tidak mengharapkan pertemuan dengan Kami} tidak menginginkan untuk bertemu dengan Tuhan mereka {berkata,“Mengapa tidak} mengapa tidak {diturunkan kepada kita malaikat atau kita melihat Tuhan kita” Sungguh mereka benar-benar telah menyombongkan diri dan melampaui batas} melampaui batas dalam kezaliman {yang sangat besar} melampaui batas yang sangat jauh"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21 orang-orang yang mendustakan rasul, yaitu yang mendustakan janji Allah dan ancamanNya, yang di dalam hati mereka tidak ada rasa takut terhadap ancaman dan tidak mengharap pertemuan dengan sang Pencipta berkata, ”mengapakah tidak diturunkan kepada kita malaikat, atau kita melihat Rabb kita,” maksudnya mengapa para malaikat tidak turun untuk memberikan kesaksian bagimu atas kerasulanmu dan memberikan dukungan kepadamu atasnya, atau mereka turun sebagai rasul-rasul khusus, atau kita langsung melihat Tuhan, agar Dia berbicara kepada kita dan mengatakan, ’ini adalah utusanKu, maka ikutilah dia!” ini adalah tindakan menentang rasul dengan sesuatu yang bukan penentang, akan tetapi ia merupakan kesombongan, keangkuhan, dan kecongkakan. “sungguh mereka menganggap besar diri mereka,” di mana mereka mengajukan usulan ini dan telah lancang melakukan tindakan yang sangat tidak sopan ini. Siapa kalian wahai si kaum fakir, wahai si kaum hina, hingga kalian (berani-beraninya) meminta melihat Allah dan kalian beranggapan bahwa kebenaran dan kepastian kerasulan itu sangat tergantung kepada hal yang demikian? Sungguh, kesombongan apalagi yang lebih besar dari ini? “dan mereka benar-benar sangat melampaui batas,” maksudnya, mereka bersikap keras hati dan beku terhadap kebenaran dengan sekeras-kerasnya. Hati mereka lebih keras daripada batu, atau lebih liat daripada besi, sama sekali tidak mau lunak terhadap kebenaran dan tidak mau mendengar (nasihat) orang-orang yang memberi nasihat. Maka dari itu nasihat dan peringatan sama sekali tidak membekas pada mereka, dan mereka tidak mau mengikuti kebenaran ketika seorang pemberi peringatan datang kepada mereka, bahkan mereka menghadapi manusia yang paling jujur dan paling tulus, dan ayat-ayat Allah yang sangat jelas dengan sikap berplaing dan mendustakan [serta menentang]. Keangkuhan apalagi yang lebih besar daripada keangkuhan semacam ini? Maka dari itu, amal perbuatan mereka batal (hangus) dan sirna, dan mereka merugi dengan kerugian yang paling besar [dan terhalang sepenuhnya dari kebaikan]."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Furqan ayat 21: Maksudnya, orang-orang yang mendustakan janji dan ancaman Allah, di mana dalam hati mereka tidak ada rasa takut terhadap ancaman Allah dan tidak berharap bertemu dengan Allah. Sebagai rasul. Lalu Dia memberitahu kami bahwa Muhammad adalah Rasul-Nya. Karena permintaan mereka untuk melihat Allah di dunia. Nampaknya mereka tidak berkaca terhadap diri mereka, memangnya mereka siapa sampai meminta untuk melihat Allah dan mengira bahwa kerasulan Muhammad shallallahu 'alaihi wa sallam benar tidaknya tergantung atas hal itu? Kesombongan apalagi yang lebih besar daripada ini. Hati mereka lebih keras daripada batu, bahkan lebih keras daripada besi sehingga nasehat dan peringatan tidak bermanfaat, dan mereka tidak mau mengikuti kebenaran ketika pemberi peringatan datang kepada mereka, bahkan mereka menyikapi orang yang paling jujur dan paling tulus kepada orang lain dan menyikapi ayat-ayat Allah dengan berpaling, mendustakan dan menentangnya. Sungguh kelewatan sekali sikap mereka. Oleh karena itu amal-amal mereka akan batal dan mereka akan rugi serugi-ruginya sebagaimana diterangkan dalam ayat 23."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Furqan Ayat 21",
    "description": "Ayat ini menjelaskan tentang alasan lainnya yang dibuat-buat kaum musyrik mekah karena keengganan mereka beriman kepada nabi Muhammad. Dan orang-orang yang tidak mengharapkan pertemuan dengan kami di akhirat karena keingkaran mereka terhadap adanya hari akhir, atau karena ketidaktakutan mereka terhadapnya, mereka berkata, 'mengapa bukan para malaikat yang diturunkan kepada kita dalam wujudnya yang nyata, yang memberitahukan tentang kebenaran nabi Muhammad, atau mengapa kita tidak melihat tuhan kita' dengan mata kepala kita yang juga memberitahukan tentang kebenaran nabi Muhammad. \" permintaan-permintaan tersebut jelas mengada-ada, sama dengan apa yang dilakukan bani israil dahulu. Hal itu jelas muncul dari hati mereka yang penuh kedengkian. Sungguh, mereka telah me-nyombongkan diri mereka karena terbujuk oleh hawa nafsu. Mereka meng-anggap bahwa merekalah yang lebih mulia, baik karena kekayaan atau kedudukan mereka di masyarakat. Dan mereka benar-benar telah melampaui batas dalam melakukan kezaliman. Demikianlah jika hati telah tertutup oleh kekafiran, semua kebenaran yang ada di hadapan, walau sudah terang benderang, tidak diacuhkan sama sekali. 22. Ingatlah pada hari ketika mereka melihat para malaikat, yang dahulu mereka mintakan kepada nabi Muhammad didatangkan, ternyata yang datang kepada mereka adalah malaikat penyiksa. Pada hari itu tidak ada kabar gembira bagi orang-orang yang berdosa sementara kaum mukmin mendapatkan kabar gembira itu dari para malaikat bahwa dosa-dosa mereka diampuni oleh Allah, dan mereka akan dimasukkan ke dalam surga. Dan mereka para malaikat itu berkata, kepada orang kafir 'hijran mahjura. ' artinya: terlarang bagi kalian mendapatkan berita gembira itu."
  }
]