[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Hari mereka akan menyaksikan malaikat adalah saat sakaratul maut, di dalam kubur dan Pada Hari Kiamat bukan dalam bentuk sebagaimana mereka minta sebelumnya, bukan untuk memberi kabar gembira kepada mereka dengan surga, akan tetapi untuk berkata kepada mereka, “Allah menjadikan surga tempat yang haram untuk kalian tempati.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "22. Pada hari orang-orang kafir itu melihat Malaikat pada saat kematian mereka, ketika berada di alam barzakh, tatkala hari kebangkitan, ketika mereka digiring menuju tempat hisab, dan tatkala mereka masuk ke dalam Neraka, sungguh di semua keadaan ini tidak ada kabar gembira bagi mereka, berbeda dengan orang-orang yang beriman. Para Malaikat berkata kepada mereka (kaum kafir), “Haram lagi diharamkan atas kalian adanya kabar gembira dari Allah.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "22. Paha hari mereka melihat malaikat ketika kematian mereka dan pada hari kiamat, orang-orang penuh dosa itu tidak akan mendapat kabar yang menggembirakan mereka, namun malaikat akan berkata kepada mereka bahwa mereka tidak mungkin dapat masuk surga."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "22. يَوْمَ يَرَوْنَ الْمَلٰٓئِكَةَ (Pada hari mereka melihat malaikat) Yakni mereka akan melihat malaikat namun bukan dalam keadaan yang mereka harapkan dan yang mereka usulkan, tapi dalam keadaan lain, yaitu ketika malaikat muncul kepada mereka saat kematian mereka atau di hari mereka dikumpulkan. لَا بُشْرَىٰ يَوْمَئِذٍ لِّلْمُجْرِمِينَ(dihari itu tidak ada kabar gembira bagi orang-orang yang berdosa) Allah mengabarkan bahwa waktu mereka melihat malaikat adalah saat kematian mereka atau saat hari kiamat, Allah mengharamkan bagi mereka kabar gembira pada saat itu. وَيَقُولُونَ حِجْرًا مَّحْجُورًا(mereka berkata: “Hijraan mahjuuraa) Kalimat ini biasa mereka ucapkan ketika mereka sedang berperang atau ketika diserang musuh, mereka mengucapkan ini untuk mengharap perlindungan dengan kalimat itu. Yakni mereka tidak mengharap untuk melihat malaikat melainkan seperti mereka mengharap untuk disegerakan azab bagi mereka seandainya mereka mengetahui hal itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "22. Pada hari mereka bisa melihat malaikat saat mati atau saat hari kiamat. Sungguh mereka dicegah untuk mendapatkan kabar gembira. Para malaikat berkata kepada mereka: “Tidak boleh dan haram bagi kalian untuk menerima kabar gembira tentang ampunan atau surga sebagaimana yang dikabarkan kepada orang-orang yang bertakwa”. Bangsa Arab berkata tentang dua kata itu (Hijran Mahjuuran), (kata pertama) yaitu saat mereka melihat sesuatu yang membuat mereka takut seperti bertemu musuh atau sesuatu menimpa mereka, seraya mereka akan menginginkan perlindungan dari keburukan, dan kata kedua adalah sebagai penegasan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{(Ingatlah) hari (ketika) mereka melihat para malaikat. Pada hari itu tidak ada kabar gembira bagi para pendosa dan mereka berkata,“Sungguh terlarang} para malaikat berkata kepada mereka,”Itu terlarang bagi kalian yaitu menyampaikan kabar gembira dari Allah kepada kalian”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "22 “pada hari mereka melihat malaikat,” [yang mereka usulkan kedatangannya], “di hari itu tidak ada kabar gembira bagi orang-orang yang berdosa,” sebab, tidaklah mereka melihatnya (beserta bergelimangnya dosa dan keras kepala) melainkan (pasti) untuk menyiksa mereka dan menimpakan azab terhadap mereka. Yang paling awal adalah pada saat kematian, di mana saat itu para malaikat turun kepada mereka. Allah berfirman, “alangkah dahsyatnya sekiranya kamu melihat diwaktu orang-orang yang zhalim berada dalam tekanan-tekanan sakaratul maut, sedang para malaikat memukul dengan tangannya (sambil berkata), ‘keluarkanlah nyawamu. Di hari ini kamu dibalas dengan siksaan yang menghinakan, karena kamu selalu mengatakan terhadap Allah (perkataan) yang tidak benar, dan (karena) kamu selalu menyombongkan diri terhadap ayat-ayatNya,” (al-an’am:93). Kemudian di dalam kubur, di saat munkar dan nakir mendatangi mereka, lalu menanyakan kepada mereka tentang tuhan, nabi, dan agama mereka. Maka pada saat itu mereka tidak bisa memberikan jawaban yang dapat menyelamatkan mereka, sehingga azab pun menimpa mereka dan rahmat Allah sirna dari mereka. Kemudian pada Hari Kiamat kelak, saat mereka digiring oleh para malaikat ke neraka, kemudian menyerahkannya kepada para malaikat petugas jahanam yang bertugas menyiksa mereka dan langsung menghukum mereka. Inilah yang dahulu mereka usulkan, dan inilah yang dahulu mereka minta, jika mereka tetap dalam kejahatan (dosa), mereka pasti melihatnya dan menjumpainya, maka barulah saat itu mereka mencari perlindungan dari azab malaikat dan lari, namun mereka sama sekali tidak menemukan tempat pelarian. ”dan mereka berkata, ’hijran mahjura’.” “hai jamaah jin dan manusia, jika kamu sanggup menembus (melintasi) penjuru langit dan bumi, maka lintasilah, kamu tidak dapat menembusnya kecuali dengan kekuatan,” (ar-rahman:33)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Furqan ayat 22: Yang sebelumnya mereka minta agar diturunkan. Awal mereka melihat malaikat adalah pada saat mereka mati, yaitu ketika malaikat turun hendak mencabut nyawa mereka. Allah Subhaanahu wa Ta'aala berfirman, “Alangkah dahsyatnya sekiranya kamu melihat di waktu orang-orang yang zalim berada dalam tekanan sakratul maut, sedang para malaikat memukul dengan tangannya, (sambil berkata), \"Keluarkanlah nyawamu,\" Di hari ini kamu dibalas dengan siksa yang sangat menghinakan, karena kamu selalu mengatakan terhadap Allah (perkataan) yang tidak benar dan (karena) kamu selalu menyombongkan diri terhadap ayat-ayat-Nya.” (Terj. Al An’aam: 93) Setelah itu, ketika mereka dikubur, di mana mereka akan didatangi malaikat Munkar dan Nakir, lalu malaikat itu akan bertanya kepada mereka tentang Tuhan mereka, nabi mereka dan agama mereka. Mereka pun tidak bisa menjawab dengan jawaban yang menyelamatkan mereka, sehingga mereka akan disiksa, dan tidak memperoleh rahmat, kemudian pada hari Kiamat ketika para malaikat menggiring mereka ke neraka lalu menyerahkan kepada para penjaga neraka yang akan menyiksa mereka. Inilah sesungguhnya yang mereka usulkan dan yang mereka minta. Oleh karena itu, jika mereka tetap di atas perbuatan itu, maka mereka akan melihat dan menemui malaikat, dan ketika itu mereka malah berlindung dari malaikat serta berlari, namun tidak ada tempat berlari lagi. Yakni orang-orang kafir, berbeda dengan orang-orang mukmin yang mendapat kabar gembira dengan surga. Ini suatu ungkapan yang biasa disebut orang Arab di waktu menemui musuh yang tidak dapat dielakkan lagi atau ditimpa suatu bencana yang tidak dapat dihindari. Ungkapan ini berarti, \"Semoga Allah menghindari bahaya ini dari saya\", ada pula yang mengartikan, “Haram lagi diharamkan.” Yakni orang kafir haram mendapatkan kabar gembira, diampuni dosa atau masuk ke surga pada hari itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Furqan Ayat 22",
    "description": "Ingatlah pada hari ketika mereka melihat para malaikat, yang dahulu mereka mintakan kepada nabi Muhammad didatangkan, ternyata yang datang kepada mereka adalah malaikat penyiksa. Pada hari itu tidak ada kabar gembira bagi orang-orang yang berdosa sementara kaum mukmin mendapatkan kabar gembira itu dari para malaikat bahwa dosa-dosa mereka diampuni oleh Allah, dan mereka akan dimasukkan ke dalam surga. Dan mereka para malaikat itu berkata, kepada orang kafir 'hijran mahjura. ' artinya: terlarang bagi kalian mendapatkan berita gembira itu. 23. Kemudian Allah menjelaskan tentang nasib dari amal kebajikan yang telah diperbuat oleh orang kafir di akhirat nanti. Dan kami akan perlihatkan segala amal kebajikan yang mereka kerjakan, seperti membantu orang miskin dan amal sosial lainnya. Lalu kami akan jadikan amal itu bagaikan debu yang beterbangan. Sebab, perbuatan baik tidak akan diterima Allah jika pelakunya kafir. Hasil dari kebajikan itu hanya bermanfaat di dunia saja seperti mendapat pujian dan penghargaan dari masyarakat."
  }
]