[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Kami mendatangi segala apa yang mereka perbuat dari kebaikan dan kebajikan yang tampak secara zahir, kemudian Kami menjadikannya tidak berguna dan tidak berarti, tidak memberikan manfaat kepada mereka, bagaikan debu yang beterbangan, yaitu debu-debu ringan yang terlihat pada pancaran sinar matahari. Yang demikian itu karena amal sudah berguna di akhirat, kecuali apabila terpenuhi pada pemiliknya: iman kepada Allah; berikut ikhlas untukNya dan mengikuti RasulNya, Muhammad."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "23. Dan kami perlihatkan segala amal kebaikan yang dilakukan oleh orang-orang kafir semasa di dunia, lalu kami jadikan amal itu sia-sia dan tak memberi manfaat sama sekali lantaran kekafiran mereka. Amalan mereka itu laksana debu beterbangan yang bisa dilihat oleh seseorang dalam cahaya matahari yang masuk melalui jendela."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "23. Dan Kami mendatangi amalan orang-orang kafir yang mereka sangka sebagai amalan kebaikan, kemudian Kami menjadikannya sebagai amalan yang batil yang tidak dapat bermanfaat bagi mereka seperti debu yang bertebaran di udara."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "23. وَقَدِمْنَآ إِلَىٰ مَا عَمِلُوا۟ مِنْ عَمَلٍ فَجَعَلْنٰهُ هَبَآءً مَّنثُورًا (Dan kami hadapi segala amal yang mereka kerjakan, lalu kami jadikan amal itu (bagaikan) debu yang berterbangan) Mereka dahulu berbuat amalan-amalan yang terlihat baik seperti bersilaturrahim, menolong orang yang butuh pertolongan, memberi makan, dan lain sebagainya, namun Allah menghapus amalan-amalan mereka disebabkan kekafiran dan kesyirikan yang mereka lakukan, sehingga amalan-amalan itu hanya seperti debu yang berterbangan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Tanyakan pada dirimu: amalan apa yang kamu anggap ada keikhlasan padanya di hadapan Allah? tidak ada sum'ah dan juga riya' meskipun sedikit! tidak kah kamu takut dkatakan kepadamu kamu juga: kamu telah berdusta! bertaqwalah kepada Allah dengan amalanmu, dan jagalah agamamu sebelum waktu itu berlalu! 2 ). Pada hari kiamat ada dua debu dijelaskan oleh al-Qur'an: disifatkan pada gunung-gunung, dimana Allah berfirman: { فَكَانَتْ هَبَآءً مُّنۢبَثًّا } \"maka jadilah ia debu yang beterbangan\" [al-Waqi'ah: 6], dan debu yang disfatkan untuk perbuatan-perbuatan orang kafir pembangkang, Allah berfirman : { وَقَدِمْنَآ إِلَىٰ مَا عَمِلُوا۟ مِنْ عَمَلٍ فَجَعَلْنَٰهُ هَبَآءً مَّنثُورًا } \"Dan kami hadapi segala amal yang mereka kerjakan, lalu kami jadikan amal itu (bagaikan) debu yang berterbangan\" [al-Furqan: 23]. sungguh kerugian yang menghampiri ketika amalan-amalan yang pernah dibuat disangka adalah kebaikan, namun ternyata ia tidak berarti apa-apa!"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "23. Dan Kami hadapkan Iradah dan tujuan Kami kepada apa yang mereka kerjakan di dunia berupa amal baik seperti silaturahmi, lalu Kami jadikan amal itu sia-sia, terbuang dan tidak mengandung manfaat di dalamnya karena amal itu dalam keadaan kufur dan ditujukan kepada selain Allah SWT."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kami perlihatkan} Kami hadapkan {amal yang mereka kerjakan, lalu Kami menjadikan amal itu debu yang beterbangan} debu yang bertebaran di udara karena kerendahan dan ketidak bergunaannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "23 “dan kami hadapi segala amal yang mereka kerjakan,” maksudnya, (kami bersengaja kepada) amal perbuatan mereka yang mereka harapkan menjadi kebaikan dan mereka telah bersusah payah mengerjakannya, “lalu kami jadikan amal itu bagaikan debu yang berterbangan,” maksudnya, batal lagi sirna. Mereka telah merugi dan tidak mendapatkan pahalanya (bahkan) mereka disiksa karenanya. Hal yang demikian itu karena amal tersebut tidak ada nilai imannya dan karena bersumber dari seorang yang mendustakan Allah dan para RasulNya. Sebab, amal kebaikan yang diterima Allah adalah yang bersumber dari seorang Mukmin nan tulus lagi membenarkan para rasul dan mengikuti mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Furqan ayat 23: Yang dimaksud dengan amal mereka di sini ialah amal-amal yang mereka harapkan kebaikannya dan mereka bersusah payah melakukannya, yaitu amal mereka yang baik-baik yang mereka kerjakan di dunia seperti silaturrahim, menjamu tamu, menolong orang yang kesulitan sewaktu di dunia. Amal-amal itu tidak dibalas oleh Allah karena mereka tidak beriman. Yaitu seperti debu yang berhamburan yang terlihat dari lubang dinding ketika terkena sinar matahari. Diumpamakan seperti itu dalam hal tidak ada pahalanya karena tidak ada syarat untuk diterima, yaitu iman dan karena mereka telah diberi balasan ketika di dunia. Rasulullah shallallahu 'alaihi wa sallam bersabda: إِنَّ الكَافِرَ إِذَا عَمِلَ حَسَنَةً ، أُطعِمَ بِهَا طُعمَةً مِنَ الدُّنيَا ، وَأَمَّا المُؤمِنُ ، فَإِنَّ اللَّه تعـالى يَدَّخِرُ لَهُ حَسَنَاتِهِ في الآخِرَةِ ، وَيُعْقِبُهُ رِزْقاً في الدُّنْيَا عَلى طَاعَتِهِ “Sesungguhnya orang kafir, apabila mengerjakan amal yang baik, maka akan diberi makanan karenanya di dunia. Adapun orang mukmin, maka Allah Ta’ala akan menyimpan kebaikannya di akhirat dan akan mengaruniakan rezeki di dunia karena ketaatannya.” (HR. Muslim)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Furqan Ayat 23",
    "description": "Kemudian Allah menjelaskan tentang nasib dari amal kebajikan yang telah diperbuat oleh orang kafir di akhirat nanti. Dan kami akan perlihatkan segala amal kebajikan yang mereka kerjakan, seperti membantu orang miskin dan amal sosial lainnya. Lalu kami akan jadikan amal itu bagaikan debu yang beterbangan. Sebab, perbuatan baik tidak akan diterima Allah jika pelakunya kafir. Hasil dari kebajikan itu hanya bermanfaat di dunia saja seperti mendapat pujian dan penghargaan dari masyarakat. 24. Sementara itu, penghuni-penghuni surga, yaitu orang yang ketika di dunia beriman kepada Allah dan beramal salih, pada hari itu yaitu pada hari kiamat, merekalah yang paling baik tempat tinggalnya dan paling indah tempat istirahatnya, yang sulit digambarkan dengan kata-kata. Mereka berada di surga yang sangat indah, yang di bawahnya mengalir sungai-sungai dan berbagai hidangan yang beraneka macam rasanya. Mereka mendapatkan kebahagiaan abadi. Dan pada puncaknya, adalah mereka memandang wajah Allah dengan penuh ketakjuban, tuhan yang maha pengasih dan maha penyayang."
  }
]