[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Penghuni-penghuni surga pada Hari Kiamat jauh lebih baik tempat tinggal mereka ketimbang penghuni neraka, dan jauh lebih indah hunian mereka di surga. Kenyamanan mereka sempurna dan kenikmatan mereka tidak terkotori oleh kekeruhan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. Orang-orang mukmin yang menjadi penghuni Surga lebih baik kedudukannya, dan lebih bagus tempat istirahat siangnya ketika dunia daripada kondisi orang-orang kafir pada hari itu (kiamat), hal ini lantaran keimanan mereka kepada Allah dan amal saleh mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "24. Pada hari kiamat para penduduk surga memiliki tempat yang paling baik untuk ditinggali dan untuk beristirahat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "24. أَصْحٰبُ الْجَنَّةِ يَوْمَئِذٍ خَيْرٌ مُّسْتَقَرًّا (Penghuni-penghuni surga pada hari itu palig baik tempat tinggalnya) Yakni mereka di surga pada derajat yang paling baik. وَأَحْسَنُ مَقِيلًا(dan paling indah tempat istirahatnya) Makna (القيلولة) adalah istirahat di tengah hari hari ketika cuaca memanas meski tidak dibarengi dengan tidur. Sedangkan maksud dari (المقيل) adalah tempat mereka merebahkan diri di surga."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Dahulu para orang-orang shalih ketika mereka kembali dari melaksanakan shalat Jum'at saat teriknya panas di siang hari, mereka menyebut bagaimana beranjaknya manusia meninggalkan masjid seperti keadaan manusia meninggalkan tempat perhitugan amalan menuju surga atau neraka; sebagaimana disebutkan bahwa kiamat akan terjadi pada hari jum'at, dan siang hari tidak akan sampai pertengahan hingga para penghuni surga masuk ke dalam surga, dan penghuni neraka memasuki tempatnya juga, sebagaimana dikatakan oleh Ibnu Mas'ud, kemudian membaca ayat firman Allah: { أَصْحَٰبُ ٱلْجَنَّةِ يَوْمَئِذٍ خَيْرٌ مُّسْتَقَرًّا وَأَحْسَنُ مَقِيلًا } \"Penghuni-penghuni surga pada hari itu palig baik tempat tinggalnya dan paling indah tempat istirahatnya\". 2 ). Sebagian Ulama menyimpulkan dari ayat ini bahwa: bahwasanya hisab penghuni surga adalah ringan, dan bahwasanya akan berakhir pada pertengahan siang hari, dan pendapat ini dinisbatkan kepada ayat ini pada lafadz: { مَقِيلًا } yakni : tempat qoilulah, yaitu istirahat ringan pada pertengahan siang hari."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "24. Para penduduk surga pada hari kiamat itu paling utama rumah dan tempat tinggalnya serta paling baik tempatnya untuk beristirahat dan tidur sejenak."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Para penghuni surga pada hari itu paling baik tempat tinggalnya} tempat tinggalnya {dan paling indah tempat istirahatnya} tempat untuk istirahat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "24 maksudnya, pada hari yang sangat menakutkan itu banyak sekali kekacauannya. “penghuni-penghuni surga,” yaitu orang-orang yang telah beriman kepada Allah dan beramal shalih serta bertakwa kepada Rabbnya ”paling baik tempat tinggalnya,” daripada penghuni neraka, “dan paling indah tempat istirahatnya,” maksudnya, tempat tinggal mereka di surga, dan istirahat mereka adalah tidur di siang hari. Itulah tempat istirahat yang berguna dan istirahat yang sempurna, karena meliputi segala kelengkapan kenikmatan yang sama sekali dengan para penghuni neraka, karena tempat tinggal mereka adalah jahanam yang merupakan seburuk-buruk tempat istirahat dan tempat tinggal. Ini merupakan salah satu bentuk penggunaan af'al tafdhil (superlative) dalam kalimat yang pada bagian lain tidak ada sedikitpun darinya. Sebab, sama seklai tidak ada kebaikan di dalam tempat tinggal penghuni neraka dan tempat istirahat mereka. Sama dengan ungkapan dalam Firman Allah, “apakah Allah yang lebih baik, atau sesuatu yang mereeka persekutukan?”(an-naml:59)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Furqan ayat 24: Yaitu mereka yang beriman kepada Allah dan beramal saleh. Daripada tempat tinggal orang-orang kafir ketika di dunia dan ketika di akhirat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Furqan Ayat 24",
    "description": "Sementara itu, penghuni-penghuni surga, yaitu orang yang ketika di dunia beriman kepada Allah dan beramal salih, pada hari itu yaitu pada hari kiamat, merekalah yang paling baik tempat tinggalnya dan paling indah tempat istirahatnya, yang sulit digambarkan dengan kata-kata. Mereka berada di surga yang sangat indah, yang di bawahnya mengalir sungai-sungai dan berbagai hidangan yang beraneka macam rasanya. Mereka mendapatkan kebahagiaan abadi. Dan pada puncaknya, adalah mereka memandang wajah Allah dengan penuh ketakjuban, tuhan yang maha pengasih dan maha penyayang. 25. Pada ayat ini, Allah mengingatkan kepada nabi Muhammad akan kedahsyatan hari kiamat, dan ingatlah wahai nabi Muhammad pada saat datangnya hari kiamat, yaitu ketika langit pecah dan benda-benda langit pun saling bertabrakan dengan sangat dahsyatnya, sehingga mengeluarkan kabut putih semuanya menjadi debu yang beterbangan dan akhirnya menghilang. Dan ketika itu para malaikat pun diturunkan secara bergelombang dalam jumlah yang sangat banyak. Mereka membawa catatan amal setiap manusia. Merekalah yang menjadi saksi atas semua tindakan manusia di dunia."
  }
]