[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ingatlah (wahai Rasul) perihal hari ketika itu langit terpecah belah dan tampak melalui celah-celahnya awan putih lembut. Dan Allah menurunkan malaikat langit pada hari itu, lalu mereka mengelilingi semua makhluk di padang mahsyar, dan Allah datang untuk memutuskan putusan di antara para hamba, dengan kedatangan yang layak dengan keagunganNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "25. Dan ingatlah -wahai Rasul- hari ketika langit terbelah mengeluarkan kabut putih yang tipis dan Malaikat diturunkan secara bergelombang ke padang mahsyar lantaran jumlah mereka yang banyak."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "25. Pada hari kiamat langit akan terpecah belah, dan dari belahan-belahannya terlihat awan, lalu para malaikat turun dengan berkelompok-kelompok."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "25. وَيَوْمَ تَشَقَّقُ السَّمَآءُ بِالْغَمٰمِ (Dan (ingatlah) hari (ketika) langit pecah belah mengeluarkan kabut putih) Pada hari kiamat langit akan terpecah belah dan diliputi oleh awan. Terdapat pendapat mengatakan bahwa langit terbelah kerena pada malaikat yang turun pada saat itu. وَنُزِّلَ الْمَلٰٓئِكَةُ تَنزِيلًا (dan diturunkanlah malaikat bergelombang-gelombang) Kelompok malaikat diturunkan setelah kelompok lainnya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "25-26 Az-Zarkasyi mengatakan: aku dikejutkan pada suatu hari oleh firman Allah: { وَيَوْمَ تَشَقَّقُ ٱلسَّمَآءُ بِٱلْغَمَٰمِ وَنُزِّلَ ٱلْمَلَٰٓئِكَةُ تَنزِيلًا } \"Dan (ingatlah) hari (ketika) langit pecah belah mengeluarkan kabut putih dan diturunkanlah malaikat bergelombang-gelombang\", { ٱلْمُلْكُ يَوْمَئِذٍ ٱلْحَقُّ لِلرَّحْمَٰنِ } \"Kerajaan yang hak pada hari itu adalah kepunyaan Tuhan Yang Maha Pemurah\" lalu aku berkata: Wahai engkau dzat yng maha lembut! engkau mengetahui bahwa hati para waliMu yang tampaknya memiliki kengerian tidak menahan diri; namun Engkau tetap lembut pada mereka dengan menambahkan kata ((الملك)) kepada nama yang paling umum dari sifat rahmatMu, engkau berfirman: { لِلرَّحْمَٰنِ }; dan jika saja gantinya adalah nama lain seperti al-Aziz dan al-Jabbar; niscaya hati-hati akan hancur."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "25. Dan pada hari langit terbelah mengeluarkan awan, dan malaikat diturunkan berkelompok-kelompok dari setiap bagian langit, bersiap-siap untuk melaksanakan perintah-perintah Allah pada hari pemisahan dengan membawa catatan-catatan amal para hamba. Demikian itulah hari kiamat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{(Ingatlah) hari (ketika) langit pecah} pecah {mengeluarkan kabut putih} awan-awan putih tebal {dan malaikat diturunkan secara bergelombang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "25-26 Allah mengabarkan tentang kedahsyatan, kesengsaraan dan kesulitan pada hari kiamat serta hal-hal yang menakutkan hati, seraya berfirman, ”dan hari ketika langit pecah belah mengeluarkan kabut,” dan kabut itu adalah kabut yang didalamnya Allah turun; Dia turun dari atas langit, hingga langit terbelah dan pecah karenanya, dan turun pula [malaikat-malaikat] pada tiap-tiap langit, kemudian mereka berdiri dengan berbaris, baik satu baris yang mengelilingi semua makhluk (manusia), atau setiap satu langit mereka membentuk satu baris, lalu langit berikutnya satu baris. Dan demikianlah maksudnya, yaitu bahwa para malaikat dengan sebegitu banyak dan kuatnya turun seraya meliputi manusia, mereka tunduk kepada perintah Rabbnya, tidak seorangpun dari mereka yang berbicara kecuali dengan izin dari Allah. Lalu bagaimana menurutmu dengan seorang manusia yang sangat lemah, terutama yang telah melawan Allah Sang Pemilik dengan berbagai dosa besar dan telah lancang melakukan hal-hal yang mengundang murkaNya, lalu dia datang menghadapNya dengan dosa-dosa dan kesalahan-kesalahan dan belum sempat bertaubat? Kemudian Sang Maha Raja lagi pencipta memberikan keputusan untuknya dengan keputusan yang di situ Dia tidak berbuat curang dan tidak pula zhalim sebesar biji sawi pun. Oleh karenanya, Dia berfirman ”dan hari itu adalah hari yang penuh kesukaran bagi orang-orang yang kafir,” karena kesulitannya yang sangat dan susahnya segala urusan baginya. Berbeda halnya dengan orang Mukmin, Karena hari itu mudah baginya dan ringan ditanggung. “(ingatlah) hati (ketika) kami mengumpulkan orang-orang yang bertakwa kepada Yang Maha pemurah sebagai utusan yang terhormat,dan kami akan menghalau orang-orang yang durhaka ke Neraka jahanam dalam keadaan dahaga.” (Maryam:85-86). Dan FirmanNya, ”dan kekuasaan pada hari itu.” yakni pada hari kiamat, “yang haq adalah milik yang Mahapemurah,” tidak ada kekuasaan bagi seorang manusia pun saat itu, dan tidak pula gambaran kekuasaan, sebagaimana adanya dahulu di dunia. Bahkan para raja dan rakyatnya, orang-orang yang merdeka dan budak-budak, orang-orang yang terhormat dan lain-lain pada hari itu menjadi sama. Diantara hal yang melegakan hati dan menentramkan jiwa serta melapangkan dada adalah bahwa Dia menyadarkan “kekuasaan,” saat pada hari kiamat itu kepada namaNya,”ar-rahman” yang rahmatNya meliputi segala Sesutu, mencakup segala yang hidup, memenuhi alam semesta, dan dengannya dunia dan akhirat menjadi makmur, dan dengannya pula segala yang kurang menjadi sempurna,dan setiap kekurangan menjadi habis; dan nama-nama yang menunjukan kepadanya mengalahkan nama-nama yang menunjukkan kepada kemurkaan, dan rahmatNya mendahului dan mengalahkan murkaNya. Maka miliknya-lah keunggulan dan kemenangan. Dan Dia telah menciptakan manusia nan rapuh ini, lalu memuliakan dan menghormatinya untuk menyempurnakan nikmatNya terhadap manusia dan untuk meliputinya dengan rahmatNya. Mereka hadir dalam kondisi terhina, tunduk, dan tenang dihadapanNya. Mereka menunggu apa yang akan diputuskan dan apa yang akan dilakukan terhadap mereka. Sementara Dia lebih sayang kepada mereka daripada diri mereka sendiri dan kedua orang tua mereka. Lalu bagaimana menururtmu dengan perlakuanNya terhadap mereka? Tidak binasa di hadapan Allah selain orang yang binasa, dan tidak akan keluar dari rahamatNya kecuali orang yang telah dikuasai oleh kesengsaraan dan ketetapan azab sudah ditetapkan atasnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Furqan ayat 25: Allah Subhaanahu wa Ta'aala memberitakan tentang dahsyatnya hari Kiamat, derita dan hal yang menegangkan hati ketika itu. Awan ini adalah awan yang Allah turun di situ (lihat tafsir As Sa’diy), Dia turun dari atas langit lalu langit terbelah dan para malaikat dari setiap langit turun bergelombang, lalu mereka berdiri berbaris-baris mengelilingi makhluk, wallahu a’lam. Ibnu Katsir berkata, “Allah Subhaanahu wa Ta'aala memberitahukan tentang kedahsyatan hari Kiamat dan perkara-perkara dahsyat yang terjadi di sana, di antaranya terbelahnya langit dan terpecahnya serta mengeluarkan awan, yakni naungan cahaya yang besar yang menyilaukan penglihatan, turunnya malaikat dari langit-langit pada hari itu, lalu mengepung makhluk di padang mahsyar, kemudian Allah Tabaaraka wa Ta'aala datang untuk memberikan keputusan. Mujahid berkata, “Hal ini sama seperti firman Allah Ta’ala, “Tidak ada yang mereka nanti-nantikan melainkan datangnya Allah dan Malaikat (pada hari kiamat) dalam naungan awan…dst.” (Terj. Al Baqarah: 210) Ibnu Abbas berkata, “Langit dunia terbelah, lalu turun penghuninya yang lebih banyak dari penghuni bumi dari kalangan jin dan manusia, kemudian langit kedua terbelah, lalu turun penghuninya yang lebih banyak dari penghuni bumi dari kalangan jin dan manusia, kemudian seterusnya sampai langit ketujuh terbelah, dan penghuni setiap langit lebih banyak lagi daripada penghuni langit sebelumnya, kemudian malaikat Karrubiiyin turun, lalu para malaikat pemikul ‘Arsy.” Malaikat karena jumlahnya yang banyak dan kuatnya mereka, mereka turun mengelilingi makhluk sambil tunduk kepada perintah Tuhan mereka. Ketika itu, tidak ada seorang pun yang berani berbicara kecuali dengan izin Allah, lalu bagaimana menurutmu tentang manusia yang lemah, khususnya mereka yang berani berhadapan dengan Tuhan mereka dengan perkara-perkara besar yang menunjukkan beraninya mereka terhadap Allah, yang mengerjakan perbuatan yang mendatangkan kemurkaan-Nya, mengerjakan dosa dan tidak bertobat daripadanya. Ketika itulah, Allah Yang Maha Pengasih memberikan keputusan yang tidak ada kezaliman meskipun seberat dzarrah (debu). Oleh karena itulah hari itu adalah hari yang sangat sulit bagi orang-orang kafir, berbeda dengan orang mukmin yang diringankan bebannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Furqan Ayat 25",
    "description": "Pada ayat ini, Allah mengingatkan kepada nabi Muhammad akan kedahsyatan hari kiamat, dan ingatlah wahai nabi Muhammad pada saat datangnya hari kiamat, yaitu ketika langit pecah dan benda-benda langit pun saling bertabrakan dengan sangat dahsyatnya, sehingga mengeluarkan kabut putih semuanya menjadi debu yang beterbangan dan akhirnya menghilang. Dan ketika itu para malaikat pun diturunkan secara bergelombang dalam jumlah yang sangat banyak. Mereka membawa catatan amal setiap manusia. Merekalah yang menjadi saksi atas semua tindakan manusia di dunia. 26. Pada saat itu semua kekuasaan yang mutlak hanya berada di tangan Allah. Kerajaan yang hak pada hari itu adalah hanya milik tuhan yang maha pengasih. Kekuasaan itu kini berada dalam genggaman-Nya. Dialah yang menentukan nasib setiap manusia dengan seadil-adilnya, karena dialah yang maha rahman. Dan itulah hari yang sulit bagi orang-orang kafir. Tidak lagi bermanfaat atas mereka harta benda, anak-anak dan lainnya. Mereka akan menghadapi satu pengadilan yang sebenar-benarnya. Mereka tidak lagi didampingi oleh penolong, pelindung, sebagaimana ketika di dunia."
  }
]