[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kerajaan yang haq pada hari ini hanya milik Tuhan Yang Maha Pengasih, bukan yang lain. Dan hari itu merupakan suatu hari yang sulit lagi berat bagi orang-orang kafir, karena mereka ditimpa hukuman dan siksaan yang pedih."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "26. Kerajaan yang hak lagi tetap berdiri pada hari Kiamat kelak adalah kepunyaan Rabb Yang Maha Pemurah. Dan hari itu menjadi hari yang sangat susah bagi orang-orang kafir, berbeda dengan orang-orang mukmin yang merasakan kemudahan pada hari itu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "26-29. Seluruh kerajaan yang hakiki pada hari kiamat hanya milik Allah. Hari itu adalah hari yang sangat sulit dan panjang bagi orang-orang kafir. Dan setiap orang zalim akan menggigit kedua tangannya akibat penyesalan mereka seraya berkata: “Aduhai, seandainya dahulu aku mengikuti petunjuk Rasulullah; sungguh besar penyesalanku dan inilah kebinasaanku. Duhai aku dahulu tidak menjadikan si fulan yang kafir itu sebagai sahabatku; sungguh dia telah menjauhkanku dari al-Qur’an ketika ada orang yang menunjukkanku kepadanya.” Dan setan dari golongan jin dan manusia sangat tidak peduli terhadap manusia sehingga dia tidak mau menolongnya, namun malah dia menjerumuskannya ke dalam azab dan berlepas diri darinya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "26. الْمُلْكُ يَوْمَئِذٍ الْحَقُّ لِلرَّحْمٰنِ ۚ (Kerajaan yang hak pada hari itu adalah kepunyaan Tuhan Yang Maha Pemurah) Adapun ketika di dunia, selain Allah memiliki kerajaan meski tidak pada hakikat sebenarnya. وَكَانَ يَوْمًا عَلَى الْكٰفِرِينَ عَسِيرًا(Dan adalah (hari itu), satu hari penuh kesukaran bagi orang-orang kafir) Sebab siksaan yang mereka dapatkan pada hari itu setelah mereka di hisab. Adapun orang-orang mukmin ketika itu mendapat kemudahan kerena kehormatan dan kabar gembira yang mereka dapatkan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "25-26 Az-Zarkasyi mengatakan: aku dikejutkan pada suatu hari oleh firman Allah: { وَيَوْمَ تَشَقَّقُ ٱلسَّمَآءُ بِٱلْغَمَٰمِ وَنُزِّلَ ٱلْمَلَٰٓئِكَةُ تَنزِيلًا } \"Dan (ingatlah) hari (ketika) langit pecah belah mengeluarkan kabut putih dan diturunkanlah malaikat bergelombang-gelombang\", { ٱلْمُلْكُ يَوْمَئِذٍ ٱلْحَقُّ لِلرَّحْمَٰنِ } \"Kerajaan yang hak pada hari itu adalah kepunyaan Tuhan Yang Maha Pemurah\" lalu aku berkata: Wahai engkau dzat yng maha lembut! engkau mengetahui bahwa hati para waliMu yang tampaknya memiliki kengerian tidak menahan diri; namun Engkau tetap lembut pada mereka dengan menambahkan kata ((الملك)) kepada nama yang paling umum dari sifat rahmatMu, engkau berfirman: { لِلرَّحْمَٰنِ }; dan jika saja gantinya adalah nama lain seperti al-Aziz dan al-Jabbar; niscaya hati-hati akan hancur."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "26. Kekuasaan mutlak pada hari kiamat itu hanya milik Allah SWT. Dan hari itu merupakan hari yang sulit dan keras bagi orang-orang kafir, berbanding terbalik dengan orang-orang mukmin."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kerajaan yang sebenarnya pada hari itu adalah milik Dzat Yang Maha Pengasih. Hari itu bagi orang-orang kafir adalah sesuatu yang sulit} sangat sulit"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "25-26 Allah mengabarkan tentang kedahsyatan, kesengsaraan dan kesulitan pada hari kiamat serta hal-hal yang menakutkan hati, seraya berfirman, ”dan hari ketika langit pecah belah mengeluarkan kabut,” dan kabut itu adalah kabut yang didalamnya Allah turun; Dia turun dari atas langit, hingga langit terbelah dan pecah karenanya, dan turun pula [malaikat-malaikat] pada tiap-tiap langit, kemudian mereka berdiri dengan berbaris, baik satu baris yang mengelilingi semua makhluk (manusia), atau setiap satu langit mereka membentuk satu baris, lalu langit berikutnya satu baris. Dan demikianlah maksudnya, yaitu bahwa para malaikat dengan sebegitu banyak dan kuatnya turun seraya meliputi manusia, mereka tunduk kepada perintah Rabbnya, tidak seorangpun dari mereka yang berbicara kecuali dengan izin dari Allah. Lalu bagaimana menurutmu dengan seorang manusia yang sangat lemah, terutama yang telah melawan Allah Sang Pemilik dengan berbagai dosa besar dan telah lancang melakukan hal-hal yang mengundang murkaNya, lalu dia datang menghadapNya dengan dosa-dosa dan kesalahan-kesalahan dan belum sempat bertaubat? Kemudian Sang Maha Raja lagi pencipta memberikan keputusan untuknya dengan keputusan yang di situ Dia tidak berbuat curang dan tidak pula zhalim sebesar biji sawi pun. Oleh karenanya, Dia berfirman ”dan hari itu adalah hari yang penuh kesukaran bagi orang-orang yang kafir,” karena kesulitannya yang sangat dan susahnya segala urusan baginya. Berbeda halnya dengan orang Mukmin, Karena hari itu mudah baginya dan ringan ditanggung. “(ingatlah) hati (ketika) kami mengumpulkan orang-orang yang bertakwa kepada Yang Maha pemurah sebagai utusan yang terhormat,dan kami akan menghalau orang-orang yang durhaka ke Neraka jahanam dalam keadaan dahaga.” (Maryam:85-86). Dan FirmanNya, ”dan kekuasaan pada hari itu.” yakni pada hari kiamat, “yang haq adalah milik yang Mahapemurah,” tidak ada kekuasaan bagi seorang manusia pun saat itu, dan tidak pula gambaran kekuasaan, sebagaimana adanya dahulu di dunia. Bahkan para raja dan rakyatnya, orang-orang yang merdeka dan budak-budak, orang-orang yang terhormat dan lain-lain pada hari itu menjadi sama. Diantara hal yang melegakan hati dan menentramkan jiwa serta melapangkan dada adalah bahwa Dia menyadarkan “kekuasaan,” saat pada hari kiamat itu kepada namaNya,”ar-rahman” yang rahmatNya meliputi segala Sesutu, mencakup segala yang hidup, memenuhi alam semesta, dan dengannya dunia dan akhirat menjadi makmur, dan dengannya pula segala yang kurang menjadi sempurna,dan setiap kekurangan menjadi habis; dan nama-nama yang menunjukan kepadanya mengalahkan nama-nama yang menunjukkan kepada kemurkaan, dan rahmatNya mendahului dan mengalahkan murkaNya. Maka miliknya-lah keunggulan dan kemenangan. Dan Dia telah menciptakan manusia nan rapuh ini, lalu memuliakan dan menghormatinya untuk menyempurnakan nikmatNya terhadap manusia dan untuk meliputinya dengan rahmatNya. Mereka hadir dalam kondisi terhina, tunduk, dan tenang dihadapanNya. Mereka menunggu apa yang akan diputuskan dan apa yang akan dilakukan terhadap mereka. Sementara Dia lebih sayang kepada mereka daripada diri mereka sendiri dan kedua orang tua mereka. Lalu bagaimana menururtmu dengan perlakuanNya terhadap mereka? Tidak binasa di hadapan Allah selain orang yang binasa, dan tidak akan keluar dari rahamatNya kecuali orang yang telah dikuasai oleh kesengsaraan dan ketetapan azab sudah ditetapkan atasnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Furqan ayat 26: Yang dimaksud dengan kerajaan yang hak ialah kekuasaan yang mutlak yang tidak disekutui oleh siapa pun juga. Tidak ada seorang pun yang bersekutu dalam kerajaan itu. Ketika itu, raja-raja di dunia dengan rakyatnya adalah sama, orang merdeka dengan budak adalah sama, orang-orang terhormat dan orang-orang rendah adalah sama. Dan termasuk yang menenangkan hati dan menenteramkan dada adalah ketika Dia menyandarkan kerajaan-Nya dengan nama-Nya Ar Rahman yang rahmat-Nya mengena kepada segala sesuatu, di mana dengan rahmat-Nya dunia dan akhirat menjadi makmur, dengannya yang kurang menjadi sempurna dan semua kekurangan pun hilang, dan bahwa rahmat-Nya mengalahkan kemurkaan-Nya. Saat itu, semua makhluk telah hadir di tempat yang luas dalam keadaan tunduk, hina dan menunggu keputusan Allah apa yang Dia putuskan kepada mereka, sedangkan Dia Maha Pengasih, yang lebih pengasih daripada diri mereka dan daripada ibu-bapak mereka. Jika demikian, menurutmu apa yang dilakukan-Nya kepada mereka? Ketika itu, tidak ada yang celaka di hadapan-Nya kecuali orang yang memang celaka dan tidak ada orang yang keluar dari rahmat-Nya kecuali orang yang dikuasai oleh kecelakaannya dan sudah pantas menerima azab."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Furqan Ayat 26",
    "description": "Pada saat itu semua kekuasaan yang mutlak hanya berada di tangan Allah. Kerajaan yang hak pada hari itu adalah hanya milik tuhan yang maha pengasih. Kekuasaan itu kini berada dalam genggaman-Nya. Dialah yang menentukan nasib setiap manusia dengan seadil-adilnya, karena dialah yang maha rahman. Dan itulah hari yang sulit bagi orang-orang kafir. Tidak lagi bermanfaat atas mereka harta benda, anak-anak dan lainnya. Mereka akan menghadapi satu pengadilan yang sebenar-benarnya. Mereka tidak lagi didampingi oleh penolong, pelindung, sebagaimana ketika di dunia. 27. Kekecewaan itu tergambarkan dalam sikap fisik dan gumaman mereka. Dan ingatlah pada hari ketika orang-orang zalim kepada diri sendiri, seperti melakukan kemusyrikan dan kekafiran, menggigit dua jarinya, sebagai tanda bahwa mereka menyesali perbuatannya seraya berkata, 'wahai! sekiranya (dulu) ketika aku masih di dunia aku mengambil jalan bersama rasul, dengan mengimaninya, mengikuti semua perintahnya dan menjauhi semua larangannya. \" namun penyesalan itu sudah tak bermanfaat lagi. Nasi sudah menjadi bubur."
  }
]