[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "27-29. Dan ingatlah (wahai Rasul) pada hari orang yang berbuat kezhaliman terhadap dirinya akan menggigit dua tangannya lantaran penyesalan dan kekecewaan, sembari berkata, “Celaka aku, seandainya aku dulu mau mendampingi Rasulullah Muhammad dan mengikutinya untuk menjadikan Islam sebagai jalan menuju surga.”. Dan ia merasakan penyesalan mendalam seraya berkata,”Sekiranya aku dulu tidak menjadikan orang kafir si Fulan itu sebagai teman dekat yang aku ikuti dan aku cintai. Sesungguhnya teman akrab itu telah menyimpangkan diriku dari al-Qur’an setelah datang kepadaku. Dan setan yang terlaknat itu adalah makhluk yang selalu tidak mau menolong manusia.” Dalam ayat-ayat ini terkandung satu peringatan dari menjalin persahabatan dengan teman yang buruk, karena sesungguhnya dia bisa menjadi penyebab teman dekatnya masuk neraka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "28. Dengan penuh penyesalan ia berkata seraya mendoakan kebinasaan untuk dirinya, \"Duhai celaka besar diriku; kiranya aku dulu tidak menjadikan si fulan yang kafir itu sebagai teman akrabku."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "28. يٰوَيْلَتَىٰ لَيْتَنِى لَمْ أَتَّخِذْ فُلَانًا خَلِيلًا (Kecelakaan besarlah bagiku; kiranya aku (dulu) tidak menjadikan sifulan itu teman akrab(ku)) Mereka berdoa bagi diri mereka agar mendapatkan kebinasaan akibat berteman dengan orang kafir yang telah menyesatkannya di dunia."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Cukuplah Allah sebagai bekal bagi orang yang beraqwa kepada-Nya tanpa keraguan, adapun bagi mereka yang mengandalkan keridhoan manusia, maka ini tidak sepenuhnya akan menjadi jaminan baginya kecuali bahkan mereka akan ridho kepadanya jika ia memberikan banyak bantuan, namun jika nampak darinya kesalahan suatu saat, manusia akan menjauh darinya. Maka barangsiapa yang mengarapkan keridhoan manusia di atas kemarahan Allah, maka manusia itu tidak akan cukup baginya selain Allah, bagaikan seorang yang zholim menggigit tangannya sendiri sambil mengatakan: { يَٰلَيْتَنِى ٱتَّخَذْتُ مَعَ ٱلرَّسُولِ سَبِيلًا , يَٰوَيْلَتَىٰ لَيْتَنِى لَمْ أَتَّخِذْ فُلَانًا خَلِيلًا } \"Aduhai kiranya (dulu) aku mengambil jalan bersama-sama Rasul , Kecelakaan besarlah bagiku; kiranya aku (dulu) tidak menjadikan sifulan itu teman akrab(ku)\". 2 ). Ayat ini sebagai bentuk penyesalan, seperti orang yang mengerang kesakitan, dan ini juga surat teguran dari tuhan, dan sebagai ayat-ayat yang memberikan kesempatan terakhir bagi mereka yang tidak menjemput peluang emas pada masa hidupnya di dunia, ayat ini dibentangkan bagimu dari sang pencipta untuk menjelaskan hakikat penyesalan yang panjang ketika seseorang melewatkan kesempatan, dan sekarang bagimu ayat ini telah sampai sebelum waktu itu lewat, kesempatan emas bagimu untuk mengambilnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "28. Kecelakaanlah aku, hancurlah aku (dimaksudkan sebagai penyesalan karena mengikuti keburukan). Andai saja aku tidak menjadikan fulan sebagai sahabat dan teman."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Celakalah aku, Seandainya aku tidak menjadikan fulan sebagai teman setia"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "28 “kecelakaan besarlah bagiku; kiranya aku (dulu) tidak menjadikan si fulan,” yaitu setan dari bangsa manusia atau bangsa jin “sebagai teman akrab,” yakni kekasih yang dicintai. Aku telah memusuhi manusia yang plaing tulus kepadaku, manusia yang paling baik kepadaku dan manusia yang paling sayang kepadaku, dan aku telah setia kepada musuh yang paling memusuhiku, yang kesetiaanku kepadanya samasekali tidak berguna bagiku kecuali kesengsaraan, kerugian, kehinaan, dan kebinasaan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Furqan ayat 28: Yang dimaksud dengan si fulan, adalah setan atau orang yang telah menyesatkannya di dunia. Yakni mengapa aku malah memusuhi manusia yang paling tulus kepadaku, paling baik dan paling lembut kepadaku (Nabi Muhammad shallallahu 'alaihi wa sallam), dan aku malah berteman dengan musuhku yang tidak memberiku manfaat apa-apa selain kecelakaan, kerugian, kehinaan dan kebinasaan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Furqan Ayat 28",
    "description": "\"wahai, celaka aku! sekiranya dulu ketika di dunia aku tidak menjadikan si fulan itu teman akrab-ku, temanku itulah yang ikut mempengaruhiku, sehingga aku menjadi pendosa dengan kekafiran dan kemusyrikan. \"29. \"sungguh, dia si fulan tadi, telah menyesatkan aku dari peringatan Al-Qur'an ketika Al-Qur'an itu telah datang kepadaku. Semestinya aku tersadar, beriman, membacanya, menghayatinya dan mengamalkannya, tapi aku lalai dan terkesima dengan kehidupan duniaku. Dan setan memang pengkhianat manusia. ' dia berusaha dengan tipu muslihat yang sangat halus untuk menyingkirkan manusia dari jalan yang benar."
  }
]