[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "27-29. Dan ingatlah (wahai Rasul) pada hari orang yang berbuat kezhaliman terhadap dirinya akan menggigit dua tangannya lantaran penyesalan dan kekecewaan, sembari berkata, “Celaka aku, seandainya aku dulu mau mendampingi Rasulullah Muhammad dan mengikutinya untuk menjadikan Islam sebagai jalan menuju surga.”. Dan ia merasakan penyesalan mendalam seraya berkata,”Sekiranya aku dulu tidak menjadikan orang kafir si Fulan itu sebagai teman dekat yang aku ikuti dan aku cintai. Sesungguhnya teman akrab itu telah menyimpangkan diriku dari al-Qur’an setelah datang kepadaku. Dan setan yang terlaknat itu adalah makhluk yang selalu tidak mau menolong manusia.” Dalam ayat-ayat ini terkandung satu peringatan dari menjalin persahabatan dengan teman yang buruk, karena sesungguhnya dia bisa menjadi penyebab teman dekatnya masuk neraka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "29. Sesungguhnya teman akrabku yang kafir ini telah menyesatkanku dari Al-Qur`ān setelah ia sampai kepadaku lewat perantaraan Rasul.” Sesungguhna setan sangat menghinakan manusia, apabila manusia ditimpa kesengsaraan maka ia pun berlepas diri darinya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "29. لَّقَدْ أَضَلَّنِى عَنِ الذِّكْرِ بعْدَ إِذْ جَآءَنِى ۗ (Sesungguhnya dia telah menyesatkan aku dari Al Quran ketika Al Quran itu telah datang kepadaku) Orang yang aku jadikan teman ini telah menyesatkan aku dari al-Qur’an ketika al-Qur’an itu datang kepadaku dan memungkinkanku untuk beriman. وَكَانَ الشَّيْطٰنُ لِلْإِنسٰنِ خَذُولًا(Dan adalah syaitan itu tidak mau menolong manusia) Ia menyebut temannya sebagai setan karena telah menyesatkannya; atau yang dimaksud dengan setan di sini adalah Iblis, sebab dialah yang menjerumuskannya untuk berteman dengan orang-orang yang menyesatkan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Begitulah syaithon setiap kali melakukan tipu daya kepada manusia; sampai ketika sudah dipastikan kebinasaannya, ia akan berpaling darinya dan melanggar janjinya yang dusta, dan sesungguhnya hal itu merupakan suatu yang pasti dalam perangkap Iblis, sebagaimana al-Qur'an mengakatan: { وَكَانَ ٱلشَّيْطَٰنُ لِلْإِنسَٰنِ خَذُولًا } \"Dan adalah syaitan itu tidak mau menolong manusia\". Maka sungguh aneh seseorang yang mempertaruhkan tempat kembalinya di akhirat! dan masa depannya yang benar-benar akan nyata! menjadikannya taruhan untuk menjadi pengikut syaithon dan tipuannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "29. Sungguh sahabat ini menjauhkanku untuk beriman kepada Allah, dan mengingat Allah dan Al-Qur’an, setelah datangnya orang yang menunjukkanku kepada hal itu. Dan setan itu banyak membiarkan orang yang menaatinya dan menelantarkan setiap orang yang mengikutinya sampai menuju kehancuran."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh dia benar-benar telah menyesatkanku dari peringatan} dari Al-Qur’an {ketika telah datang kepadaku. Setan itu adalah (makhluk) yang menelantarkan manusia} berlebihan dalam menelantarkan, dia mengantarkan manusia menuju kehancuran lalu meninggalkannya dan berlepas diri darinya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "29 “sungguh dia telah menyesatkanku dari al-qur’an ketika al-qur’an telah datang kepadaku,” di mana dia telah membuat kesesatannya menjadi indah baginya dengan tipudaya dan bujuk rayuannya. “dan setan itu tidak akan menolong manusia,” maksudnya, setan itu menjadikan yang batil menjadi indah baginya dan memburukkan yang haq baginya, bahkan dia menjanjikkan berbagai angan-angan manis, kemudian setan meninggalkannya dan berlepas diri darinya. Sebagaimana dia mengatakan kepada seluruh pengikutnya ketika semua perkara telah diputuskan dan setelah Allah selesai memeriksa (amal perbuatan) seluruh manusia. Maka hendaknya setiap orang memperhatikan dirinya di waktu senggang dan membenahi apa yang bisa dibenahi sebelum dia kelak tidak dapat membenahi diri, dan hendaklah dia berloyalitas kepada orang yang di dalam loyalitas (kesetiaan) kepadanya terdapat kebahagiaan bagi dirinya, dan hendaknya memusuhi orang yang permusuhan terhadapnya menguntungkan dirinya dan persahabatan dengannya membahayakannya. Wallahul muwafiq."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Furqan ayat 29: Yaitu menghalangiku beriman kepadanya dengan menghias kesesatan dan memperjelek kebenaran dengan tipuan dan bujukannya. Yakni yang menelantarkannya ketika manusia sedang kesulitan. Hal ini sebagaimana yang pidato setan kepada semua pengikutnya ketika urusan telah diselesaikan dan Allah telah menghisab makhluk-Nya: Dan berkatalah setan ketika perkara (hisab) telah diselesaikan, \"Sesungguhnya Allah telah menjanjikan kepadamu janji yang benar, dan aku pun telah menjanjikan kepadamu tetapi aku menyalahinya. Sekali-kali tidak ada kekuasaan bagiku terhadapmu, melainkan (sekedar) aku menyeru kamu lalu kamu mematuhi seruanku, oleh sebab itu janganlah kamu mencerca aku akan tetapi cercalah dirimu sendiri. Aku sekali-kali tidak dapat menolongmu dan kamu pun sekali-kali tidak dapat menolongku. Sesungguhnya aku tidak membenarkan perbuatanmu mempersekutukan aku (dengan Allah) sejak dahulu.” Sesungguhnya orang-orang yang zalim itu mendapat siksaan yang pedih.” (Terj. Ibrahim: 22) Oleh karena itu, hendaknya seorang hamba memperhatikan dirinya, apakah tertipu oleh setan atau tidak? Demikian pula memanfaatkan kesempatan hidup di dunia, mengisinya dengan iman dan amal saleh sebelum tiba hari di mana tidak ada lagi kesempatan, yang ada adalah pembalasan terhadap amal."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Furqan Ayat 29",
    "description": "\"sungguh, dia si fulan tadi, telah menyesatkan aku dari peringatan Al-Qur'an ketika Al-Qur'an itu telah datang kepadaku. Semestinya aku tersadar, beriman, membacanya, menghayatinya dan mengamalkannya, tapi aku lalai dan terkesima dengan kehidupan duniaku. Dan setan memang pengkhianat manusia. ' dia berusaha dengan tipu muslihat yang sangat halus untuk menyingkirkan manusia dari jalan yang benar. 30. Nabi Muhammad sendiri mengeluhkan lingkungan masyarakat quraisy yang buruk. Mereka lalai terhadap kitab suci Al-Qur'an yang berisi peringatan-peringatan. Dan rasul Muhammad berkata, dengan segala keluh kesahnya 'ya tuhanku yang maha rahman dan rahim! sesungguhnya kaumku telah menjadikan Al-Qur'an ini diabaikan. Mereka tidak mau mendengarkan, apalagi mengamalkannya. \" ayat ini meng-isyarahkan bahwa lingkungan ikut mempengaruhi jalan hidup se-seorang. Allah lalu ingin menenangkan hati nabi Muhammad, bahwa setiap nabi dari masa lalu adalah sama. Selalu saja berhadapan dengan para pengingkar."
  }
]