[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang Musyrik Arab telah mengambil sesembahan-sesembahan selain Allah yang tidak dapat menciptakan apapun, padahal Allah-lah Yang menciptakan sesembahan-sesembahan itu dan menciptakan mereka; mereka tidak memiliki kemampuan menolak mara bahaya dan mendatangkan kebaikan bagi diri mereka, dan tidak dapat mematikan apa yang hidup dan menghidupkan apa yang mati atau membangkitkan seseorang dari orang-orang yang telah mati dalam keadaan hidup dari kuburnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Orang-orang musyrik itu menjadikan tuhan-tuhan selain Allah untuk disembah, tuhan-tuhan tersebut tidak bisa menciptakan apapun, baik yang besar maupun yang kecil, bahkan mereka sendiri diciptakan. Allah yang menciptakan mereka dari asalnya yang tidak ada, dan mereka tidak kuasa untuk menolak sesuatu mudarat dari diri mereka dan tidak pula kuasa untuk mendatangkan suatu manfaat, mereka juga tidak kuasa mematikan makhluk hidup, menghidupkan makhluk mati dan tidak pula membangkitkan orang-orang mati dari kuburnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "3. Allah mengolok orang-orang kafir yang menyembah berhala-berhala yang tidak mampu menciptakan apapun, tidak dapat menjauhkan bahaya dan tidak dapat mendatangkan kebaikan bagi diri mereka, tidak mampu menghidupkan dan mematikan seorangpun, dan tidak mampu membangkitkannya dari kubur ketika di akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. وَاتَّخَذُوا۟ مِن دُونِهِۦٓ ءَالِهَةً (Kemudian mereka mengambil tuhan-tuhan selain daripada-Nya) Yakni orang-orang musyrik membuat tuhan-tuhan selain Allah bagi diri mereka. لَّا يَخْلُقُونَ شَيْـًٔا(yang tuhan-tuhan itu tidak menciptakan apapun) Yakni tidak mampu menciptakan sesuatu apapun. وَهُمْ يُخْلَقُونَ (bahkan mereka sendiri diciptakan) Yakni Allah menciptakan mereka. وَلَا يَمْلِكُونَ لِأَنفُسِهِمْ ضَرًّا وَلَا نَفْعًا (dan tidak kuasa untuk (menolak) sesuatu kemudharatan dari dirinya dan tidak (pula untuk mengambil) suatu kemanfaatanpun) Maka bagaimana mereka akan dapat memberi manfaat dan mudharat bagi orang-orang yang menyembah mereka. وَلَا يَمْلِكُونَ مَوْتًا وَلَا حَيَوٰةً وَلَا نُشُورًا(dan (juga) tidak kuasa mematikan, menghidupkan dan tidak (pula) membangkitkan) Yakni mereka tidak mampu mematikan makhluk yang hidup atau menghidupkan makhluk yang mati dan tidak pula mampu membangkitkannya dari kubur."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Dan orang-orang musyrik itu mengambil tuhan-tuhan selain Allah, yaitu berhala-berhala yang mereka sembah, meskipun mereka tidak bisa menciptakan sesuatu, sedangkan Allah yang menciptakan mereka. Mereka juga tidak memiliki kemahdharatan dan kemanfaatan bagi diri sendiri ataupun orang lain. Tidak pula memiliki kemampuan untuk mematikan, menghidupkan dan membangkitkan seseorang dari kuburnya di alam akhirat. An-Nusyur adalah proses penghidupan setelah mati untuk dihisab."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka mengambil tuhan selain Dia} selain Allah {padahal tuhan-tuhan itu tidak dapat menciptakan apa pun. Bahkan mereka sendiri diciptakan dan tidak mampu untuk (menolak) bahaya terhadap dirinya, tidak dapat (mendatangkan) manfaat} menolak mudharat dan mendatangkan manfaat {serta tidak mempunyai kuasa atas kematian dan kehidupan} mematikan yang hidup dan menghidupkan yang mati {dan tidak (pula) membangkitkan} membangkitkan setelah mati"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3 maksudnya, di antara yang sangat aneh dan bukti yang paling pasti atas kedunguan mereka dan kepicikan akal mereka, bahkan paling menunjukkan kepada kezhaliman dan kelancangan mereka kepada Rabb mereka adalah mereka mengangkat sembahan-sembahan yang sifatnya benar-benar berada pada puncak ketidakberdayaan, yaitu mereka (sembahan-sembahan itu) sama sekali tidak mampu menciptakan sesuatu apapun, bahkan mereka sendiri adalah makhluk ciptaan, bahkan sebagian di antara sembahan-sembahan itu ada yang dibuat oleh tangan mereka (para penyembah itu)! “dan tidak kuasa untuk (menolak) sesuatu kemudaratan dari dirinya dan tidak (pula untuk mengambil) sesuatu kemanfaatan,” yakni kemanfaatan sedikit maupun banyak. Sebab kata (dharran dan naf’an. Pent) berbentuk nakirah (indefinite noun) dalam bentuk nafi (kalimat negative). “dan tidak kuasa mematikan.” Maksudnya, menghidupkan kembali sesudah kematian. Maka ketetapan akal sehat yang paling mendasar menyatakan kebatilan dan kerusakan ketuhanan dari sembahan-sembahan tersebut, dan kerusakan akal orang-orang yang menjadikannya sebagai sembahan dan sekutu bagi Sang Pencipta semua makhluk tanpa persekutuan bagiNya dalam menciptakannya, yaitu (pencipta) yang ditanganNya-lah manfaat, bahaya, pemberian (sesuatu) dan pencegahan(nya), yang menghidupkan, mematikan dan membangkitkan kembali orang-orang yang ada di dalam kubur serta menghimpun mereka pada Hari kebangkitan. Sesungguhnya Dia telah menciptakan bagi mereka dua tempat tinggal : tempat kesengsaraan, kehinaan dan hukuman bagi siapa saja yang menyembah sembahan selain Allah, dan tempat kemenangan, kebahagiaan dan kenikmatan abadi untuk siapa saja yang (hanya) menjadikan Allah semata sebagai sembahannya. Setelah Allah memutuskan dengan dalil (argument) yang pasti lagi sangat jelas kebenaran tauhid dan kebatilan lawannya (syirik), maka Allah menegaskan kebenaran kerasulan (Nabi Muhammad Saw.) dan kebatilan perkataan orang yang menentang dan membangkang terhadapnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Furqan ayat 3: Setelah Allah Subhaanahu wa Ta'aala menerangkan kesempurnaan-Nya, keagungan-Nya dan banyaknya kebaikan-Nya, maka yang demikian menghendaki agar Dia yang dicintai, disembah dan diagungkan, maka Dia menerangkan batilnya menyembah selain-Nya. Sungguh sangat aneh sekali dan sangat membuktikan sekali terhadap kebodohan mereka, kurangnya akal mereka, bahkan membuktikan kezaliman dan beraninya mereka terhadap Tuhan yang menciptakan mereka, yaitu sikap mereka mengambil tuhan yang keadaannya seperti yang disebutkan, yakni tidak dapat menciptakan, bahkan dicipta, yang tidak dapat menghidupkan, mematikan mapun membangkitkan. Sedikit maupun banyak."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Furqan Ayat 3",
    "description": "Tanda-tanda kekuasaan Allah begitu nyata, sehingga keengganan kaum kafir untuk bertauhid amat mengherankan. Dan mereka mengambil tuhan-tuhan selain Allah untuk disembah, padahal tuhan-tuhan itu tidak dapat menciptakan apa pun, bahkan tuhan-tuhan itu sendiri diciptakan dan juga sangat lemah sehingga tidak kuasa untuk menolak bahaya terhadap dirinya sendiri dan tidak pula dapat mendatangkan manfaat, serta tidak kuasa mematikan apa pun, menghidupkan apa pun, dan tidak dapat pula membangkitkan sesuatu yang telah mati. 4. Tidak hanya menolak keesaan Allah, kaum kafir juga melecehkan Al-Qur'an. Dan orang-orang kafir berkata dengan nada menghina, 'Al-Qur'an ini tidak lain hanyalah kebohongan yang diada-adakan secara sengaja oleh Muhammad, dan dalam menciptakannya dia dibantu oleh orang-orang lain yang memiliki kemampuan untuk itu. ' menanggapi tuduhan ini Allah menegaskan, 'sungguh, mereka telah berbuat zalim dan dusta yang besar, yang menjauhkan mereka dari kebenaran. \"."
  }
]