[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Rasul berkata untuk mengadukan apa yang diperbuat oleh kaumnya, “Wahai Tuhanku, sesungguhnya kaumku meninggalkan al-Qur’an ini dan mengasingkannya, dengan terus menerus berpaling darinya, mengabaikan untuk mentadabburi, mengamalkan,dan menyampaikannya.” Pada ayat ini terkandung satu ancaman besar bagi orang yang mengacuhkan al-Qur’an dan tidak mengamalkannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "30. Pada hari itu, Rasul mengeluhkan kondisi kaumnya dengan mengatakan, \"Wahai Rabbku! Sesungguhnya kaumku yang Engkau utus aku kepada mereka, telah meninggalkan Al-Qur`ān ini dan berpaling darinya.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "30-31. Rasulullah mengadu kepada Allah: “Ya Tuhanku, kaumku mendustakan a-Qur’an dan berpaling darinya.” Hai Rasulullah, Kami menciptakan musuh bagimu dari kalangan orang-orang kafir sebagaimana Kami juga menciptakan musuh dari kalangan orang-orang kafir bagi setiap nabi sebelummu. Cukup Tuhanmu yang memberi petunjuk kepada kebenara, dan sebagai penolongmu dalam menghadapi musuh."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "30. اتَّخَذُوا۟ هٰذَا الْقُرْءَانَ مَهْجُورًا (menjadikan Al Quran itu sesuatu yang tidak diacuhkan) Yakni dicampakkan mereka karena tidak beriman kepadanya dan tidak menerimanya sedikitpun. Pendapat lain mengatakan maknanya adalah bahwa mereka menganggap al-Qur’an adalah الهُجر (perkataan yang batil dan buruk)."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Bagaimana jika ditakdirkan bagimu mendengarkan keluhan ini dari Rasulullah: { يَٰرَبِّ إِنَّ قَوْمِى ٱتَّخَذُوا۟ هَٰذَا ٱلْقُرْءَانَ مَهْجُورًا } \"Ya Tuhanku, sesungguhnya kaumku menjadikan Al Quran itu sesuatu yang tidak diacuhkan\"? Maka Ibnu Katsir berkata dalam tafsirnya: \"dan meninggalkan tadabbur ayat-ayatnya dan memahami isinya termasuk meninggalkan al-Qur'an\". 2 ). Hendaknya bagi setiap Muslim senantiasa mengamati ayat yang mulia ini, dan menaruh pandangannya yang begitu dalam berkali-kali; untuk membukakan bagi dirinya jalan keluar dari jalan yang buntu ini, dan bencana yang besar ini, yang telah menyebar luas ke berbagai wilayah kaum muslimin, yaitu musibah meninggalkan al-Qur'an. 3 ). Syaikh bin Baz pernah berkata: ada sejumlah kelompok yang besar dan jumlah yang begitu banyak mereka menisbatkan Islam pada diri mereka. Namun dihalau dari menerapkan isi al-Qur'an ini dengan benar dan apa yang datang dari Raulullah, dan aku khawatir mereka itulah yang dimaksud oleh firman Allah: { وَقَالَ ٱلرَّسُولُ يَٰرَبِّ إِنَّ قَوْمِى ٱتَّخَذُوا۟ هَٰذَا ٱلْقُرْءَانَ مَهْجُورًا } \"Ya Tuhanku, sesungguhnya kaumku menjadikan Al Quran itu sesuatu yang tidak diacuhkan.\" 4 ). Menjauh dari al-Qur'an benar-benar akan mengakibatkan kerasnya hati, persis sama dengan kerasnya tanah kering yang lama tidak tersiram air, sehingga ia tidak dapat dimanfaatkan kecuali hanya sedikit darinya; sampai-sampai dirinya mengarah kepada syahwat yang terlarang, dan itulah permulaan ia akan berpaling dari agama ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "30. Di dunia, Rasulallah Muhammad SAW berkeluh kesah kepada Tuhannya: “Wahai Tuhanku, sesungguhnya kaumku menjadikan Al-Qur’an terabaikan dan terlantar”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Rasul berkata,“Wahai Tuhanku, sesungguhnya kaumku telah menjadikan Al-Qur’an ini (sebagai) sesuatu yang diabaikan”} yang diabaikan, dan ditinggalkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "30 “berkatalah Rasul,” seraya menyeru kepada Rabbnya, mengadukan sikap kaumnya yang berpaling dari ajaran yang dibawanya serta sedih atas sikap yang mereka perlihatkan itu, “ya Rabbku, sesungguhnya kaumku,” yang kepada mereka Engkau mengutusku untuk memberi petunjuk dan menyampaikan , “telah menjadikan al-qur’an ini sesuatu yang diabaikan,” maksudnya, mereka telah berpaling darinya, mengabaikan dan meninggalkannya, padahal yang menjadi kewajiban mereka adalah patuh kepada hukumnya dan menerima aturan-ataurannya serta mengikutinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Furqan ayat 30: Berdoa dan mengeluhkan kepada Tuhannya serta menyayangkan tentang sikap kaumnya yang malah berpaling dari Al Qur’an ini. Yakni yang Engkau utus aku untuk menerangkan petunjuk dan menyampaikan risalah kepada mereka. Mereka meninggalkan dan mengabaikannya, padahal yang wajib bagi mereka adalah tunduk kepadanya, mendatangi hukum-hukumnya, dan berjalan mengikutinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Furqan Ayat 30",
    "description": "Nabi Muhammad sendiri mengeluhkan lingkungan masyarakat quraisy yang buruk. Mereka lalai terhadap kitab suci Al-Qur'an yang berisi peringatan-peringatan. Dan rasul Muhammad berkata, dengan segala keluh kesahnya 'ya tuhanku yang maha rahman dan rahim! sesungguhnya kaumku telah menjadikan Al-Qur'an ini diabaikan. Mereka tidak mau mendengarkan, apalagi mengamalkannya. \" ayat ini meng-isyarahkan bahwa lingkungan ikut mempengaruhi jalan hidup se-seorang. Allah lalu ingin menenangkan hati nabi Muhammad, bahwa setiap nabi dari masa lalu adalah sama. Selalu saja berhadapan dengan para pengingkar. 31. Begitulah, bagi setiap nabi, semenjak masa lalu, telah kami adakan musuh dari orang-orang yang berdosa, baik dari kalangan jin atau manusia (lihat: al-an'am/7: 112). Manusia gampang terpedaya oleh rayuan setan. Dengan itu Allah ingin mengetahui siapa di antara mereka yang taat kepada-Nya dan mana yang tidak. Tetapi cukuplah tuhanmu menjadi pemberi petunjuk dan penolong bagi siapa yang dikehendaki-Nya yaitu mereka yang ikhlas berada di jalan yang benar."
  }
]