[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sebagaimana Kami mengadakan bagimu (wahai Rasul) musuh-musuh dari orang-orang jahat dari kaummu, Kami telah mengadakan bagi tiap-tiap nabi musuh-musuh dari orang-orang jahat dari kaumnya. Maka bersabarlah sebagaimana mereka telah bersabar. Dan cukuplah Tuhanmu menjadi Pemberi Petunjuk, Yang mengarahkan, dan Penolong Yang menolongmu menghadapi musuh-musuhmu. Dalam ayat ini terkandung satu hiburan bagi Nabi kita, Muhammad."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "31. Dan seperti yang engkau dapati -wahai Rasul- berupa hinaan dan rintangan dari kaummu terhadap jalanmu, demikianlah pula Kami adakan bagi tiap-tiap nabi sebelum engkau musuh dari orang-orang yang berdosa di antara kaumnya. Dan cukuplah Rabbmu menjadi Pemberi petunjuk pada kebenaran, dan Penolong yang menolong engkau dari musuh-musuhmu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "31. وَكَذٰلِكَ جَعَلْنَا لِكُلِّ نَبِىٍّ عَدُوًّا مِّنَ الْمُجْرِمِينَ (Dan seperti itulah, telah Kami adakan bagi tiap-tiap nabi, musuh dari orang-orang yang berdosa) Yakni orang-orang berdosa dari kaumnya. Maka janganlah kamu resah wahai Muhammad karena ini sudah menjadi jalan bagi para nabi sebelummu dan bersabarlah sebagaimana mereka bersabar. وَكَفَىٰ بِرَبِّكَ هَادِيًا وَنَصِيرًا(Dan cukuplah Tuhanmu menjadi Pemberi petunjuk dan Penolong) Allah memberi petunjuk bagi hamba-hamba-Nya kepada kebaikan agama dan dunia, dan Allah akan menolong mereka atas musuh-musuh mereka; demikian pula Allah akan memperlakukanmu."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Perhatikan pada ayat ini tentang sunnah pembelaan; serukan dakwah kepada manusia yang lain, namun jangan membayagkan dunia akan ikut dengan seruanmu, demi Allah sekalipun seseorang berada di ujung sebuah gunung dimana ia melakukan seruan dakwah yang sama Allah akan mengrimkan kepadanya seseorag untuk memeranginya. 2 ). Betapa ayat ini menjadi penghibur dan penguat bagi kaum mukminin; sebab musuh-musuh mereka di dunia akan berhadapan dengan penolong dari langit. { وَكَذَٰلِكَ جَعَلْنَا لِكُلِّ نَبِىٍّ عَدُوًّا مِّنَ ٱلْمُجْرِمِينَ ۗ وَكَفَىٰ بِرَبِّكَ هَادِيًا وَنَصِيرًا } \"Dan seperti itulah, telah Kami adakan bagi tiap-tiap nabi, musuh dari orang-orang yang berdosa. Dan cukuplah Tuhanmu menjadi Pemberi petunjuk dan Penolong.\" 3 ). { وَكَفَىٰ بِرَبِّكَ هَادِيًا وَنَصِيرًا } musuh-musuh pada nabi menempu dua macam jalan untuk membatalkan dakwah para nabi: pertama jalan untuk menyesatkan dan tawaran yang bathil di setiap zaman dan tempat, kedua jalan peperangan; oleh karena disebutkan dalam ayat : { هَادِيًا } sebagai perlawanan untuk jalan pertama tadi, dan disebutkan pula: { وَنَصِيرًا } sebagai perlawanan untuk jalan kedua yaitu dalam peperangan senjata."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "31. Wahai Nabi, sebagaimana Kami menjadikan bagimu musuh dari golongan orang musyrik kaummu, Kami juga menjadikan bagi setiap nabi sebelummu musuh dari golongan orang kafir kaumnya. Dan cukup Tuhanmulah yang menjadi Pemberi Petunjuk bagimu menuju kebenaran dan kebaikan, dan Penolong dari musuh-musuhmu. Al-Mujrimun adalah orang-orang yang kerusakannya sudah keterlaluan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Begitulah, Kami telah menjadikan untuk setiap nabi musuh dari golongan orang-orang yang berdosa. Cukuplah Tuhanmu menjadi pemberi petunjuk dan penolong"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "31 Allah berfirman kepada RasulNya untuk menghibur dan mengabarkan kepadanya, “dan seperti itulah, telah kami adakan bagi tiap-tiap nabi, musuh dari (kalangan) orang-orang yang berdosa,” yaitu dari golongan orang-orang yang tidak laik untuk kebaikan dan mereka tidak membersihkan diri dengannya; mereka menentang para rasul, menolak dan mendebat mereka dengan yang batil. Diantara sebagian manfaatnya adalah kebenaran menjadi unggul di atas kebatilan, kebenaran menjadi jelas dan menjadi sangat nyata. Sebab, perlawan kebatilan terhadap kebenaran menjadikannya makin jelas, nyata dan penuh bukti, dan kita makin lebih mengetahui apa yang dilakukan Allah terhadap ahlul haq, berupa karamah (kemuliaan) dan terhadap ahlul batil, berupa azab. Maka jangan bersedih terhadap merek, dan janganlah kamu menyesal karena sikap mereka. Dan cukuplah Rabbmu menjadi pemberi petunjuk,” yang memberi petunjuk kepadamu hingga kamu mendapatkan keinginanmu dan kebaikan agama serta duniamu, “dan penolong,” yang menolongmu melawan musuh-musuhmu, mencegah darimu segala hal yang dibenci dalam perkara agama dan dunia. Maka bergantung dan berserah dirilah kepadaNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Furqan ayat 31: Allah Subhaanahu wa Ta'aala menghibur Rasul-Nya dan memberitahukan, bahwa mereka punya pendahulu yang perbuatannya sama dengan mereka. Yakni sebagaimana telah Kami adakan untukmu musuh dari kaum musyrik Quraisy. Di antara faedah diadakan musuh bagi setiap nabi adalah agar hak berada di atas kebatilan dan kebenaran semakin jelas, karena dengan adanya penentangan yang batil terhadap yang hak dapat menambah kebenaran semakin jelas, dan semakin jelas keistimewaan yang diberikan Allah kepada orang-orang yang berada di atas yang hak dan hukuman yang diberikan-Nya kepada orang-orang yang berada di atas kebatilan. Oleh karena itu, bersabarlah sebagaimana mereka (para nabi) bersabar dan janganlah kamu bersedih dan dirimu binasa karena kesedihan terhadap mereka. Yakni yang menunjukimu sehingga apa yang kamu harapkan tercapai, demikian pula maslahat agama maupun dunia. Terhadap musuh-musuhmu. Oleh karena itu, bertawakkallah kepada-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Furqan Ayat 31",
    "description": "Begitulah, bagi setiap nabi, semenjak masa lalu, telah kami adakan musuh dari orang-orang yang berdosa, baik dari kalangan jin atau manusia (lihat: al-an'am/7: 112). Manusia gampang terpedaya oleh rayuan setan. Dengan itu Allah ingin mengetahui siapa di antara mereka yang taat kepada-Nya dan mana yang tidak. Tetapi cukuplah tuhanmu menjadi pemberi petunjuk dan penolong bagi siapa yang dikehendaki-Nya yaitu mereka yang ikhlas berada di jalan yang benar. 32. Pada ayat berikut diceritakan lagi permintaan lainnya yang mengada-ada yang dikemukakan oleh orang kafir kepada nabi Muhammad. Dan orang-orang kafir berkata, 'mengapa Al-Qur'an itu tidak diturunkan kepadanya sekaligus sebagaimana kitab-kitab samawi dulu se-perti kitab taurat, zabur, dan injil, bukan berangsur-angsur sebagaimana Al-Qur'an'\" demikianlah, kami turunkan Al-Qur'an secara ber-angsur-angsur agar kami memperteguh hatimu Muhammad dengannya karena setiap kali ayat Al-Qur'an turun, nabi merasa tenang karena Allah selalu menyertainya dalam suka maupun duka dan kami membacakannya secara tartil berangsur-angsur, perlahan dan benar, selama kurang lebih 23 tahun. Membaca Al-Qur'an dengan tartil, sangat di dianjurkan. Diturunkannya Al-Qur'an secara berangsur, agar mudah dihafal, dihayati, dan diamalkan sedikit demi sedikit."
  }
]