[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang kafir berkata, “Menagapa al-Qur’an tidak diturunkan kepada Muhammad sekaligus saja, seperti Taurat, Injil, dan Zabur?” Allah berfirman, “Demikianlah, Kami menurunkannya secara berangsur-angsur supaya Kami memperkuat kalbumu dan menambah ketenanganmu dengannya dan kamu dapat memahami dan mengembannya. Dan Kami menjelaskannya dengan teliti dan perlahan-lahan.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "32. Orang-orang yang kafir kepada Allah berkata, \"Mengapa Al-Qur`ān itu tidak diturunkan kepada Rasul sekaligus saja, dan tidak diturunkan secara berangsur-angsur?\" Kami menurunkannya secara berangsur-angsur supaya Kami perkuat hatimu dengannya wahai Rasul, dan Kami menurunkannya sedikit demi sedikit agar mudah dibaca dan dipahami."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "32. Orang-orang kafir yang membangkang berkata: “Mengapa al-Qur’an tidak diturunkan kepada Muhammad sekali penurunan?” Maka Allah berfirman: “Demikianlah Kami menurunkannya secara bertahap untuk menguatkan hatimu dan memudahkanmu untuk menghafal, membaca, dan menjelaskannya dengan perlahan dan teliti.” Ibnu Abbas berkata: “al-Qur’an dipisahkan dari lauhul mahfudz kemudian diletakkan di Baitul Izzah yang ada di langit dunia, lalu Jibril menurunkannya kepada Nabi Muhammad darinya dan membacakannya kepada beliau dengan tartil.” (Diriwayatkan oleh Imam Hakim dalam al-Mustadrak 2/223, kitab tafsir; dishahihkan dan disepakati oleh Imam ad-Dzahabi, dan dishahihkan pula oleh al-Hafizh Ibnu Hajar sebagaimana telah disebutkan pada tafsir surat al-Isra’: 106)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "32. كَذٰلِكَ لِنُثَبِّتَ بِهِۦ فُؤَادَكَ ۖ (demikianlah supaya Kami perkuat hatimu dengannya) Yakni Kami turunkan al-Qur’an dengan berangsur-angsur sesuai dengan kejadian yang terjadi untuk menguatkan hatimu dengan al-Qur’an itu, sebab turunnya al-Qur’an dengan berangsur-angsur sesuai kejadian yang terjadi lebih dapat menguatkan hatimu dalam menghadapi kejadian itu yang kadang berasal dari tipu daya dan makar dari kaummu sehingga kamu tidak ragu atau mundur saat menghadapi mereka. Itu juga menjadikanmu lebih mudah menghafalnya dan memahami maknanya, sebab ketika mereka bertanya kepadamu tentang sesuatu pasti mereka akan diberi jawabannya. وَرَتَّلْنٰهُ تَرْتِيلًا(dan Kami membacanya secara tartil (teratur dan benar)) Yakni Kami membacakannya ayat per ayat dengan penuh ketelitian dan kejelasan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Jika engkau mendapatkan dalam hatimu perpecahan; maka kembalilah kepada al-Qur'an { لِنُثَبِّتَ بِهِۦ فُؤَادَكَ } \"supaya Kami perkuat hatimu dengannya\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "32. Orang-orang kafir itu berkata: “Mengapa Al-Qur’an tidak diturunkan kepada Muhammad sekaligus sebagaimana Taurat diturunkan kepada Musa?!”Lalu Allah membalas mereka: “Kami menurunkannya kepadamu secara terpisah. Dan melalui cara ini, sungguh Kami akan menguatkan hatimu dan memudahkanmu dalam menjaga dan memahaminya. Kami juga membacakannya melalui lisan Jibril dengan sangat bagus dan perlahan-lahan” Dari Ibnu Abbas: “Orang-orang musyrik berkata: “Jika Muhammad adalah nabi sebagaimana yang diakuinya, pasti Tuhannya tidak menghukumnya sehingga menurunkannya satu ayat dan dua ayat saja. Kenapa Dia tidak menurunkan Al-Qur’an sekaligus saja?” Lalu Allah menurunkan ayat ini”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang kafir berkata,“Mengapa Al-Qur’an itu tidak} Mengapa tidak {diturunkan kepadanya dalam satu jumlah} sekaligus {”Demikianlah, agar Kami memperteguh} menguatkan {hatimu dengannya, dan Kami membacakannya secara tartil} dan Kami memisah-misahnya, ayat demi ayat, agar mudah dipahami dan dijaga"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "32 “ini sebagian dari sederet usulan-usulan kaum kafir yang dibisikkan oleh jiwa mereka, maka mereka berkata, ”mengapa al-qur’an itu tidak diturunkan kepadanya sekali turun saja?” maksudnya, sebagaimana kitab-kitab suci sebelum diturunkan. Apa salahnya kalau ia diturunkan seperti itu? Bahkan turunnya (secara bertahap) seperti itu lebih sempurna dan lebih baik. Maka dari itu Allah berfirman,” demikianlah,” kami menurunkannya secara berangsur-angsur, “suapaya kami memperkuat hatimu dengannya,” sebab setiap kali bagian dari al-qur’an turun kepadanya, maka dia makin bertambah tenang dan kokoh pendiriannya, terutama di saat adanya faktor-faktor penyebab kegelisahan. Karena sesungguhnya turunnya al-qur’an pada saat terjadinya moment (penting) itu menjadi penawar yang sangat luar biasa dan menjadi peneguh hati yang sangat efektif daripada kalau ia telah diturunkan sebelumnya, kemudian mengingatnya ketika terjadi asbab nuzulnya. “dan kami membacakannya secara tartil,” maksudnya, kami menurunkannya kepadamu dengan pelan dan secara bertahap. Ini semua menunjukkan pada perhatian Allah terhadap kitabNya, yaitu al-qur’an dan terhadap RasulNya, yaitu Muhammad Saw, di mana Dia menjadikan penurunan kitabNya sesuai dengan kondisi Rasulullah dan kemaslahatan agama."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Furqan ayat 32: Perkataan ini termasuk di antara usulan orang-orang kafir. Seperti Taurat, Injil dan Zabur. Al Qur’an diturunkan tidak secara sekaligus. Maksudnya, Al Quran itu tidak diturunkan sekaligus, tetapi diturunkan secara berangsur-angsur agar dengan begitu hati Nabi Muhammad shallallahu 'alaihi wa sallam menjadi kuat, tenang dan teguh. Terutama, ketika ada sebab-sebab gelisah, maka dengan turunnya Al Qur’an dapat menenteramkannya. Agar mudah dipahami dan dihapal. Hal ini menunjukkan perhatian Allah terhadap kitab-Nya dan terhadap Rasul-Nya, di mana Dia menurunkan kitab-Nya sesuai keadaan rasul dan maslahat agamanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Furqan Ayat 32",
    "description": "Pada ayat berikut diceritakan lagi permintaan lainnya yang mengada-ada yang dikemukakan oleh orang kafir kepada nabi Muhammad. Dan orang-orang kafir berkata, 'mengapa Al-Qur'an itu tidak diturunkan kepadanya sekaligus sebagaimana kitab-kitab samawi dulu se-perti kitab taurat, zabur, dan injil, bukan berangsur-angsur sebagaimana Al-Qur'an'\" demikianlah, kami turunkan Al-Qur'an secara ber-angsur-angsur agar kami memperteguh hatimu Muhammad dengannya karena setiap kali ayat Al-Qur'an turun, nabi merasa tenang karena Allah selalu menyertainya dalam suka maupun duka dan kami membacakannya secara tartil berangsur-angsur, perlahan dan benar, selama kurang lebih 23 tahun. Membaca Al-Qur'an dengan tartil, sangat di dianjurkan. Diturunkannya Al-Qur'an secara berangsur, agar mudah dihafal, dihayati, dan diamalkan sedikit demi sedikit. 33. Kemudian Allah menghibur nabi Muhammad agar beliau bertambah semangat dalam berdakwah, dan tidak peduli dengan semua permintaan orang musyrik yang mengada-ada itu. Dan mereka (orang-orang kafir itu) tidak datang kepadamu (membawa) sesuatu yang aneh, seperti permintaan mereka yang mengada-ada, dengan tujuan mencederai kenabianmu. Melainkan kami datangkan kepadamu suatu jawaban yang benar dan tepat, akan melemahkan anggahan-sanggahan mereka yang batil dan penjelasan yang paling baik, sehingga akan jelas mana yang benar dan mana yang salah."
  }
]