[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan tidaklah kaum musyrikin datang kepadamu (wahai Rasul) dengan membawa hujjah atau syubhat kecuali Kami mendatangkan kepadamu jawaban yang haq dan dengan penjelasan terbaik baginya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "33. Tidaklah orang-orang musyrik itu datang kepadamu -wahai Rasul- dengan membawa usulan yang mereka katakan, melainkan Kami datangkan kepadamu suatu jawaban yang benar lagi tegas dan yang paling baik penjelasannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "33-34. Hai Rasulullah, Tidaklah orang-orang kafir mendatangimu dengan hujjah atau syubhat untuk melawan dakwahmu melainkan Kami akan mendatangkan kepadamu jawaban yang kuat yang tidak ada yang lebih kuat darinya dan lebih jelas penjelasannya. Orang-orang kafir itu pada hari kebangkitan akan berjalan di atas wajah mereka menuju neraka Jahannam. Orang-orang yang jauh dari rahmat Allah itu memiliki kedudukan yang paling buruk dan paling jauh dari kebenaran."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "33. وَلَا يَأْتُونَكَ بِمَثَلٍ إِلَّا جِئْنٰكَ بِالْحَقِّ (Tidaklah orang-orang kafir itu datang kepadamu (membawa) sesuatu yang ganjil, melainkan Kami datangkan kepadamu suatu yang benar) Yakni Hai Muhammad, tidaklah orang-orang musyrik membuat perumpamaan atau permintaan yang aneh seperti usulan-usulan mereka itu melainkan Kami akan mendatangkan kepadamu jawaban yang hak untuk menjawab dan menghadapi hal itu. وَأَحْسَنَ تَفْسِيرًا(dan yang paling baik penjelasannya) Yakni penjelasan yang paling baik dalam menyelesaikan perkara yang mereka bawa."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "33. Wahai Muhammad, Tidaklah orang-orang musyrik mendatangimu dengan membawa sesuatu yang ganjil untuk menggagalkan dakwahmu kecuali Kami memberimu jawaban pasti yang dapat menggagalkan sesuatu yang mereka bawa dan memiliki penjelasan dan keterangan lebih baik bagi mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka tidak datang kepadamu dengan sesuatu yang aneh} sesuatu yang samar dan suatu usulan {kecuali Kami mendatangkan kepadamu kebenaran dan penjelasan yang terbaik} penjelasan dan keterangan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "33 oleh karena itu, Dia berfirman,”tidaklah orang-orang kafir itu datang kepadamu (membawa) suatu perumpamaan,” yang dengannya mereka menentang kebenaran dan dengannya mereka menolak kerasulanmu, “melainkan (pasti) kami mendatangkan kepadamu sesuatu yang benar dan yang paling baik penjelasannya,” maksudnya kami turunkan kepadamu al-qur’an yang mengandung kebenaran di dalam makna-maknanya, kejelasan dan penjelasan yang sempurna pada lafazh-lafazhnya. Maka makna-makna (yang dikandungnya) semuanya hak dan benar, tidak dicemari oleh satu kebatilan ataupun satu syubhat (kerancuan) dari sisi manapun; lafazh-lafazhnya dan batasan-batasannya terhadap segala sesuatu merupakan lafazh-lafazh yang paling jelas dan paling baik penjelasannya, menjelaskan makna-maknanya dengan penjelasan yang sempurna. Di dalam ayat di atas terdapat satu dalil (bukti) bahwa sepantasnya bagi orang yang membicarakan ilmu, apakah dia sebagai muhaddits, pengajar, maupun penceramah, sepantasnya dia meneladani Rabbnya di dalam mengatur kondisi RasulNya. Demikian pula seorang alim mengatur permasalahan masyarakat. Setiap kali ada kesempatan atau datang suatu musim, maka hendakNya dia membawakan ayat-ayat al-qur’an, hadits-hadits Nabi dan nasihat-nasihat yang sesuai dengan musim tersebut. Ini juga mengandung bantahan terhadap orang-orang yang berlebihan, seperti kaum jahmiyah dan semisal mereka yang berpendapat bahwa kebanyakan nash-nash al-qur’an mengandung makna bukan literalnya (makna tersuratnya), dan ia mempunyai makna-makna selain dari maknanya yang dipahami secara lahir (literal). Jadi, berdasarkan pendapat mereka, alqur’an itu tidak lebih baik penjelasannya dari pada yang lainnya. Dan yang lebih baik, menurut klaim mereka, adalah penafsiran mereka yang merubah makna-makna al-qur’an dengan sejauh-jauhnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Furqan ayat 33: Untuk membatalkan perkaramu. Maksudnya, setiap kali mereka datang kepada Nabi Muhammad shallallahu 'alaihi wa sallam membawa suatu hal yang aneh berupa usul dan kecaman, Allah menolaknya dengan sesuatu yang benar dan nyata. Al Qur’an penuh dengan kebenaran dan kejelasan. Kandungannya hak (benar) dan tidak dicampuri kebatilan dan syubhat, sedangkan lafaz-lafaznya begitu jelas. Dalam ayat ini terdapat dalil, bahwa sepatutnya bagi orang yang berbicara tentang ilmu, baik yang menyampaikan hadits, pengajar dan penasehat mengikuti Tuhannya dalam menyesuaikan ayat-ayat-Nya dengan keadaan rasul-Nya, oleh karenanya ia membawakan ayat-ayat, hadits-hadits dan nasehat yang sesuai yang sesuai dengan kondisi. Dalam ayat ini juga terdapat bantahan terhadap kaum Jahmiyyah dan yang semisal mereka yang memandang bahwa nash-nash Al Qur’an harus dibawa kepada selain zhahirnya, dan bahwa ia memiliki makna selain yang dipahami darinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Furqan Ayat 33",
    "description": "Kemudian Allah menghibur nabi Muhammad agar beliau bertambah semangat dalam berdakwah, dan tidak peduli dengan semua permintaan orang musyrik yang mengada-ada itu. Dan mereka (orang-orang kafir itu) tidak datang kepadamu (membawa) sesuatu yang aneh, seperti permintaan mereka yang mengada-ada, dengan tujuan mencederai kenabianmu. Melainkan kami datangkan kepadamu suatu jawaban yang benar dan tepat, akan melemahkan anggahan-sanggahan mereka yang batil dan penjelasan yang paling baik, sehingga akan jelas mana yang benar dan mana yang salah. 34. Ayat berikut ini berisi peringatan keras kepada orang kafir tentang nasib mereka di akhirat nanti. Orang-orang yang dikumpulkan ke nera-ka jahanam dengan diseret wajahnya secara hakiki. Wajah adalah ang-gota badan yang paling mulia. Pada hari kiamat diputarbalikan oleh Allah sehingga berada di bawah dan dengan kondisi seperti itu mereka berjalan, sebagai balasan atas dosa-dosa mereka. Mereka itulah yang paling buruk tempatnya dibanding dengan tempat mana pun dan paling sesat jalannya. Kemudian Allah kembali menghibur nabi dengan menceritakan nasib kaum yang durhaka di masa lalu."
  }
]