[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang kafir itulah yang akan diseret dengan muka-muka mereka ke Neraka Jahannam. Dan mereka itu adalah manusia yang paling buruk tempat tinggalnya dan paling jauh menyimpang dari kebenaran."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "34. Orang-orang yang pada hari Kiamat kelak dihimpunkan dan digiring ke neraka Jahanam dengan diseret atas wajah mereka, mereka itulah orang yang paling buruk tempatnya; karena tempat mereka adalah Jahanam, dan paling sesat jalannya dari kebenaran; karena jalan yang mereka tempuh adalah jalan kekafiran dan kesesatan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "34. الَّذِينَ يُحْشَرُونَ عَلَىٰ وُجُوهِهِمْ إِلَىٰ جَهَنَّمَ أُو۟لٰٓئِكَ شَرٌّ مَّكَانًا (Orang-orang yang dihimpunkan ke neraka Jahannam dengan diseret atas muka-muka mereka, mereka itulah orang yang paling buruk tempatnya) Yakni paling buruk tempat tinggal dan tempat kembalinya. وَأَضَلُّ سَبِيلًا(dan paling sesat jalannya) Ini merupakan olokan bagi mereka karena telah menganggap Rasulullah sebagai orang yang sesat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "34. Orang-orang yang dikumpulkan dan diseret di atas wajahnya menuju neraka Jahanam, yaitu dalam keadaan terbalik. Mereka adalah yang paling buruk tempat tinggalnya yaitu neraka Jahanam dan paling sesat jalannya daripada selain mereka, yaitu kekufuran mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Orang-orang yang dikumpulkan ke neraka Jahanam dengan diseret wajahnya} digiring dalam keadaan diseret di atas wajahnya {itulah yang paling buruk tempatnya dan paling sesat jalannya} dan paling jauh jalannya dari kebenaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "34 Allah mengabarkan tentang keadaan kaum musyrikin yang mendustakan RasulNya dan (betapa) buruknya tempat akhir mereka, dan bahwa mereka “akan dihimpunkan dengan diseret di atas mukanya,” dalam pemandangan yang paling buruk dan penglihatan yang paling keji; mereka diseret dan digelandang oleh para malaikat azab “ke Neraka Jahanam,” yang penuh dengan semua bentuk azab dan hukuman. “Mereka itulah,” orang-orang yang sedemikian keadaannya itu adalah “orang-orang yang paling buruk tempatnya,” daripada orang yang beriman kepada Allah dan membenarkan RasulNya, “dan paling sesat jalannya.” Ini termasuk kategori menggunakan af'al tafdhil (superlative) pada kalimat yang pada bagian lain tidak ada sesuatupun darinya. Sebab, sesungguhnya orang-orang Mukmin itu terbaik tempat tinggaldan tempat peristirahatanya, dan mereka di dunia telah menelusuri petunjuk jalan yang lurus, sedangkan di akhirat dapat mencapai surga, negeri kenikmatan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Furqan ayat 34: Yang menghimpun semua azab dan hukuman. Oleh para malaikat yang akan mengazab."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Furqan Ayat 34",
    "description": "Ayat berikut ini berisi peringatan keras kepada orang kafir tentang nasib mereka di akhirat nanti. Orang-orang yang dikumpulkan ke nera-ka jahanam dengan diseret wajahnya secara hakiki. Wajah adalah ang-gota badan yang paling mulia. Pada hari kiamat diputarbalikan oleh Allah sehingga berada di bawah dan dengan kondisi seperti itu mereka berjalan, sebagai balasan atas dosa-dosa mereka. Mereka itulah yang paling buruk tempatnya dibanding dengan tempat mana pun dan paling sesat jalannya. Kemudian Allah kembali menghibur nabi dengan menceritakan nasib kaum yang durhaka di masa lalu. 35. Dan sungguh, kami telah memberikan kitab taurat kepada musa bin imran, salah satu nabi dari ulul 'azmi, sebagai pembimbing bagi kaumnya bani israil dan kami telah menjadikan harun saudaranya, sebagai anugerah yang kami berikan kepadanya atas permintaannya. Harun kami angkat juga sebagai nabi dan menyertai dia sebagai wazir, yaitu pembantu yang ikut memperkuat kedudukannya dan menjadi juru bicaranya di hadapan raja fir'aun."
  }
]