[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "35-36. Dan sungguh telah Kami anugrahkan Taurat kepada Musa, dan Kami menjadikan saudaranya, Harun sebagai penolong baginya. Lalu Kami berkata kepada mereka berdua, “Pergilah kalian berdua kepada Fir’aun dan kaumnya yang telah mendustakan bukti-bukti rububiyah dan uluhiyah Kami.” Kemudian mereka berdua bertolak menuju mereka dan menyeru mereka untuk beriman kepada Allah dan taat kepadaNya, serta tidak menyekutukanNya. Akan tetapi, mereka mendustakan mereka berdua, sehingga Allah membinasakan mereka dengan kebinasaan yang besar."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "36. Kemudian Kami berfirman kepada keduanya, \"Pergilah kalian berdua kepada Fir'aun dan kaumnya yang mendustakan ayat-ayat Kami.” Mereka berdua pun melaksanakan perintah Kami. Keduanya mendatangi mereka lalu mengajak mereka agar mengesakan Allah, namun ternyata mereka mendustakan keduanya sehingga Kami pun membinasakan mereka dengan kebinasaan yang parah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "36. فَقُلْنَا اذْهَبَآ إِلَى الْقَوْمِ الَّذِينَ كَذَّبُوا۟ بِـَٔايٰتِنَا (Kemudian Kami berfirman kepada keduanya: “Pergilah kamu berdua kepada kaum yang mendustakan ayat-ayat Kami) Mereka adalah Fir’aun dan kaumnya. Dan yang dimaksud dengan ayat-ayat adalah sembilan mukjizat yang telah disebutkan sebelumnya. Mereka belum mendustakan Musa dan Harun ketika keduanya diperintahkan untuk mendatangi mereka, namun mereka mendustakan keduanya setelah itu; dan maksud dari ayat ini adalah pergilah kepada kaum yang pada akhirnya akan mendustakan. فَدَمَّرْنٰهُمْ تَدْمِيرًا (Maka Kami membinasakan mereka sehancur-hancurnya) Yakni kemudian Musa dan Harun pergi kepada Fir’aun dan kaumnya, namun mereka mendustakan keduanya, maka Kami binasakan mereka setelah itu dengan kebinasaan yang besar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "36. Lalu Kami berfirman kepada keduanya: “Berangkatlah kalian kepada Fir’aun dan kaumnya yang mendustakan ayat Kami (mukjizat) yang berjumlah Sembilan”. Penyebutan ayat-ayat tersebut disajikan dalam surah Al-A’raf dan surah lainnya. Maknanya, kecenderungan mereka adalah menuju pendustaan. Lalu Kami hancurkan mereka sehancur-hancurnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kemudian Kami berfirman,“Pergilah kepada kaum yang mendustakan ayat-ayat Kami.” Lalu Kami menghancurkan mereka dengan sehancur-hancurnya} lalu Kami menghancurkan mereka dengan kehancuran yang sangat besar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "35-40 Allah mengisyaratkan kepada kisah-kisah ini, dan Dia telah menguraikannya di dalam ayat-ayat yang lain, untuk mengingatkan orang-orang yang di ajak biacara (mukhatabin) supaya waspada diri dari tenggelam dalam mendustakan Rasul mereka, sehingga mereka bisa ditimpa azab sebagimana yang telah menimpa umat-umat yang telah berlalu yang dekat dengan masa sebelum mereka, sedangkan mereka sendiri mengetahui cerita umat-umat tersebut karena sangat terkenal dan popular di kalangan mereka. Di anatra mereka ada yang telah melihat jejak-jejak (artefak) mereka dengan mata kepala, seperti kaum Nabi Shaleh di al-hijr, dan seperti negeri yang diguyur hujan buruk rupa batu sijjil; mereka melaluinya di pagi dan malam hari saat bepergian jauh. Sebab umat-umat tersebut tidaklah lebih jahat daripada mereka, dan para rasul merekapun tidaklah lebih baik daripada rasul kaum musyrikin itu; “apakah orang-orang kafirmu (hai kuam musyrikin) lebih baik daripada mereka itu, atau apakah kamu telah mempunyai jaminan kebebasan (dari azab) dalam kitab-kitab yang dahulu?” (al-qamar:43) Akan tetapi yang telah menghalangi mereka untuk beriman, meskipun mereka telah menyaksikan tanda-tanda, adalah bahwa mereka tidak mengharapkan kebangkitan dan kehidupan kembali setelah mati. Mereka sama sekali tidak mengharapkan perjumpaan dengan Rabb mereka, dan mereka tidak takut kepada ancamanNya. Maka dari itu mereka terus dalam sikap menentang. Sebab, jika tidak, maka sesungguhnya bukti-bukti telah sampai kepada mereka hingga tidak ada keraguan, tidak ada syubhat, tidak ada suatu kerancuan dan tidak ada kebimbangan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Furqan ayat 36: Yaitu kaum Qibth (bangsa Mesir), mereka ini adalah Fir’aun dan kaumnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Furqan Ayat 36",
    "description": "Kemudian kami berfirman kepada keduanya, 'pergilah kamu berdua kepada raja fir'aun di mesir yang mengaku dirinya sebagai tuhan dan kepada kaumnya yaitu kaum yang mendustakan ayat-ayat kami. ' berupa mukjizat-Mukjizat yang kami berikan kepada musa. Mereka bahkan menganggap nabi musa dan harun sebagai pesihir yang ulung lalu kami hancurkan mereka dengan sehancur-hancurnya. Kami tenggelamkan mereka di laut qalzum (laut merah), sebagai balasan atas dosa-dosa mereka. 37. Allah juga menceritakan nasib dari kaumnya nabi nuh. Dan telah kami binasakan kaum nuh ketika mereka mendustakan nabi nuh yang telah berdakwah kepada mereka selama 950 tahun, namun yang beriman kepadanya hanya sebagian kecil saja. Mendustakan satu rasul berarti sama saja dengan mendustakan para rasul. Karena para utusan Allah adalah satu kesatuan yang tidak bisa terpisahkan. Kami tenggelamkam mereka setelah kami genangi bumi mereka dengan banjir besar melebihi tingginya gunung-gunung mereka, dan kami jadikan cerita mereka itu pelajaran bagi manusia. Azab Allah akan turun kembali dalam bentuk lain, jika ada kaum yang kembali mendustakan para nabi mereka. Dan kami telah sediakan bagi orang-orang zalim azab yang pedih; melebihi dari pada apa yang mereka duga."
  }
]