[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Kami juga telah menenggelamkan kaum Nuh dengan banjir bandang ketika mereka mendustakannya. Dan siapa saja yang mendustakan seorang Rasul, maka sesungguhya dia telah mendustakan seluruh rasul. Dan Kami menjadikan penenggelaman mereka sebagai pelajaran bagi umat manusia, dan Kami menjadikan bagi mereka dan orang-orang yang menuruti jalan mereka dalam mendustakan rasul siksaan yang pedih di Hari Kiamat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "37. Dan juga kaum Nuh tatkala mereka mendustakan para rasul karena mendustakan Nabi -'alaihissalām-. Mereka Kami tenggelamkan ke dalam lautan, dan Kami jadikan kisah kebinasaan mereka itu sebagai bukti bagi manusia tentang kekuasaan Kami dalam membinasakan orang-orang yang berbuat zalim. Dan Kami telah menyediakan azab yang pedih bagi orang-orang zalim pada hari Kiamat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "37. Dan ketika kaum Nuh mendustakan para rasul dengan mendustakan nabi mereka, maka Kami menenggelamkan mereka dalam banjir bandang. Dan Kami jadikan kisah mereka sebagai pelajaran bagi hamba yang lain. Dan Kami telah menyiapkan azab yang pedih bagi orang-orang kafir."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "37. وَقَوْمَ نُوحٍ لَّمَّا كَذَّبُوا۟ الرُّسُلَ أَغْرَقْنٰهُمْ (Dan (telah Kami binasakan) kaum Nuh tatkala mereka mendustakan rasul-rasul. Kami tenggelamkan mereka) Yakni mereka mendustai Nabi Nuh, dan barangsiapa yang mendustakan seorang Nabi sama saja ia mendustakan seluruh Nabi. Mereka ditenggelamkan dengan banjir bandang sebagaimana disebutkan pada surat Hud. وَجَعَلْنٰهُمْ لِلنَّاسِ ءَايَةً ۖ( dan kami jadikan (cerita) mereka itu pelajaran bagi manusia) Yakni Kami jadikan tenggelamnya mereka atau kisah mereka sebagai pelajaran bagi seluruh manusia. وَأَعْتَدْنَا لِلظّٰلِمِينَ(Dan Kami telah menyediakan bagi orang-orang zalim) Yakni bagi kaum Nabi Nuh dan orang-orang yang mendustakan Nabi seperti mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "37. Kami juga menenggelamkan kaum Nuh dengan banjir bandang ketika mereka mendustakan Nuh yang merupakan rasul mereka. Satu rasul disampaikan menggunakan kata “rusul” (banyak utusan) karena siapa yang mendustakan seorang rasul, maka sungguh dia telah mendustakan seluruh rasul. Dan Kami jadikan peristiwa penenggelaman mereka sebagai pelajaran dan nasehat bagi setiap manusia. Dan kami siapkan azab yang pedih bagi orang-orang kafir di akhirat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dan kaum Nuh ketika mereka mendustakan para rasul. Kami menenggelamkan mereka dan menjadikannya sebagai tanda} tanda atas kekuasaan Kami {bagi manusia. Kami telah menyediakan} menyediakan {bagi orang-orang zalim azab yang sangat pedih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "35-40 Allah mengisyaratkan kepada kisah-kisah ini, dan Dia telah menguraikannya di dalam ayat-ayat yang lain, untuk mengingatkan orang-orang yang di ajak biacara (mukhatabin) supaya waspada diri dari tenggelam dalam mendustakan Rasul mereka, sehingga mereka bisa ditimpa azab sebagimana yang telah menimpa umat-umat yang telah berlalu yang dekat dengan masa sebelum mereka, sedangkan mereka sendiri mengetahui cerita umat-umat tersebut karena sangat terkenal dan popular di kalangan mereka. Di anatra mereka ada yang telah melihat jejak-jejak (artefak) mereka dengan mata kepala, seperti kaum Nabi Shaleh di al-hijr, dan seperti negeri yang diguyur hujan buruk rupa batu sijjil; mereka melaluinya di pagi dan malam hari saat bepergian jauh. Sebab umat-umat tersebut tidaklah lebih jahat daripada mereka, dan para rasul merekapun tidaklah lebih baik daripada rasul kaum musyrikin itu; “apakah orang-orang kafirmu (hai kuam musyrikin) lebih baik daripada mereka itu, atau apakah kamu telah mempunyai jaminan kebebasan (dari azab) dalam kitab-kitab yang dahulu?” (al-qamar:43) Akan tetapi yang telah menghalangi mereka untuk beriman, meskipun mereka telah menyaksikan tanda-tanda, adalah bahwa mereka tidak mengharapkan kebangkitan dan kehidupan kembali setelah mati. Mereka sama sekali tidak mengharapkan perjumpaan dengan Rabb mereka, dan mereka tidak takut kepada ancamanNya. Maka dari itu mereka terus dalam sikap menentang. Sebab, jika tidak, maka sesungguhnya bukti-bukti telah sampai kepada mereka hingga tidak ada keraguan, tidak ada syubhat, tidak ada suatu kerancuan dan tidak ada kebimbangan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Furqan ayat 37: Kaum Nuh dikatakan mendustakan para rasul, padahal yang diutus kepada mereka hanya Nabi Nuh ‘alaihis salam, karena barang siapa yang mendustakan seorang rasul, sama saja mendustakan semua rasul, karena yang dibawa para rasul adalah sama dalam hal ushulnya (pokok-pokok agamanya) meskipun syrariatnya berbeda-beda sesuai kondisi masing-masing. Di samping yang telah menimpa mereka di dunia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Furqan Ayat 37",
    "description": "Allah juga menceritakan nasib dari kaumnya nabi nuh. Dan telah kami binasakan kaum nuh ketika mereka mendustakan nabi nuh yang telah berdakwah kepada mereka selama 950 tahun, namun yang beriman kepadanya hanya sebagian kecil saja. Mendustakan satu rasul berarti sama saja dengan mendustakan para rasul. Karena para utusan Allah adalah satu kesatuan yang tidak bisa terpisahkan. Kami tenggelamkam mereka setelah kami genangi bumi mereka dengan banjir besar melebihi tingginya gunung-gunung mereka, dan kami jadikan cerita mereka itu pelajaran bagi manusia. Azab Allah akan turun kembali dalam bentuk lain, jika ada kaum yang kembali mendustakan para nabi mereka. Dan kami telah sediakan bagi orang-orang zalim azab yang pedih; melebihi dari pada apa yang mereka duga. 38. Dan telah kami binasakan kaum 'ad yaitu kaumnya nabi hud di kawasan yaman dan Samud yaitu kaum nabi saleh di mada'in dan penduduk rass yaitu penduduk sumur tempat seorang nabi di buang di dalamnya, atau pengikut nabi isa yang dimasukkan ke dalam parit lalu dibakar oleh raja yang musyrik serta banyak lagi generasi di antara kaum-kaum itu yang telah dibinasakan oleh Allah karena dosa-dosa mereka."
  }
]