[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Kami telah menghancurkan bangsa Ad kaum Hud, bangsa Tsamud kaum Shaleh, para penduduk ar-Rass, dan umat-umat lain yang berjumlah banyak yang hidup antara (masa) kaum Nuh, bangsa Ad, bangsa Tsamud dan para penduduk ar-Rass itu. Tidak ada yang mengetahui mereka selain Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "38. Dan Kami telah binasakan penduduk 'Ād yang merupakan kaum Nabi Hūd, penduduk Ṡamūd yang merupakan kaum Nabi saleh, dan (penduduk Rass) pemilik sumur, serta Kami juga telah binasakan banyak umat yang hidup di antara ketiga kaum tersebut."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "38-39. Dan Kami binasakan kaum ‘Ad dengan angin kencang, kaum Tsamud dengan suara keras, dan juga penduduk Rass, serta banyak umat yang lain. Kami telah menjelaskan kepada mereka berbagai hujjah dengan jelas namun mereka mendustakannya, maka Kami hancurkan mereka sehancur-hancurnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "38. وَأَصْحٰبَ الرَّسِّ (dan penduduk Rass) Kata (الرس) dalam bahasa arab berarti sumur yang tidak di tembok. Terdapat pendapat mengatakan yang dimaksud adalah sumur yang terdapat di kota Antakya; sekelompok kaum membunuh Habib an-Najjar pada sumur tersebut, sehingga mereka dinisbatkan pada sumur tersebut. وَقُرُونًۢا بَيْنَ ذٰلِكَ كَثِيرًا(dan banyak (lagi) generasi-generasi di antara kaum-kaum tersebut) Yakni umat-umat yang lain selain umat-umat yang telah disebutkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "38. Dan sungguh Kami hancurkan juga kaum ‘Aad yang mendustakan rasul mereka, Hud dengan angin yang bersuara sangat kencang, serta kaum Tsamud yang mendustakan rasul mereka, Shalih dengan suara teriakan. Kami juga menghancurkan penduduk Rass, yaitu telaga yang tidak curam dan bisa digunakan untuk tinggal. Menurut pandangan sebagian lainnya, mereka adalah penduduk parit. Mereka adalah para penyembah berhala. Kami hancurkan mereka dengan reruntuhan, yaitu merobohkan rumah-rumah mereka atas diri mereka. Kami juga telah menghancurkan banyak kaum antara generasi kaum ‘Aad sampai penduduk Rass akibat kekufuran dan pendustaan mereka terhadap utusan mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan kaum ‘Ad, kaum Tsamud} Kami juga membianasakan kaum ‘Ad dan Tsamud {penduduk Rass} Penduduk pemilik sumur {dan banyak generasi} dan Kami binasakan umat-umat {di antara kaum itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "35-40 Allah mengisyaratkan kepada kisah-kisah ini, dan Dia telah menguraikannya di dalam ayat-ayat yang lain, untuk mengingatkan orang-orang yang di ajak biacara (mukhatabin) supaya waspada diri dari tenggelam dalam mendustakan Rasul mereka, sehingga mereka bisa ditimpa azab sebagimana yang telah menimpa umat-umat yang telah berlalu yang dekat dengan masa sebelum mereka, sedangkan mereka sendiri mengetahui cerita umat-umat tersebut karena sangat terkenal dan popular di kalangan mereka. Di anatra mereka ada yang telah melihat jejak-jejak (artefak) mereka dengan mata kepala, seperti kaum Nabi Shaleh di al-hijr, dan seperti negeri yang diguyur hujan buruk rupa batu sijjil; mereka melaluinya di pagi dan malam hari saat bepergian jauh. Sebab umat-umat tersebut tidaklah lebih jahat daripada mereka, dan para rasul merekapun tidaklah lebih baik daripada rasul kaum musyrikin itu; “apakah orang-orang kafirmu (hai kuam musyrikin) lebih baik daripada mereka itu, atau apakah kamu telah mempunyai jaminan kebebasan (dari azab) dalam kitab-kitab yang dahulu?” (al-qamar:43) Akan tetapi yang telah menghalangi mereka untuk beriman, meskipun mereka telah menyaksikan tanda-tanda, adalah bahwa mereka tidak mengharapkan kebangkitan dan kehidupan kembali setelah mati. Mereka sama sekali tidak mengharapkan perjumpaan dengan Rabb mereka, dan mereka tidak takut kepada ancamanNya. Maka dari itu mereka terus dalam sikap menentang. Sebab, jika tidak, maka sesungguhnya bukti-bukti telah sampai kepada mereka hingga tidak ada keraguan, tidak ada syubhat, tidak ada suatu kerancuan dan tidak ada kebimbangan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Furqan ayat 38: Rass adalah telaga yang sudah kering airnya. kemudian dijadikan nama suatu kaum, yaitu kaum Rass. Mereka menyembah patung, lalu Allah mengutus seorang nabi kepada mereka. Ada yang berpendapat, bahwa nabi tersebut adaah Syu’aib, dan ada yang berpendapat selain Nabi Syu’aib, wallahu a’lam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Furqan Ayat 38",
    "description": "Dan telah kami binasakan kaum 'ad yaitu kaumnya nabi hud di kawasan yaman dan Samud yaitu kaum nabi saleh di mada'in dan penduduk rass yaitu penduduk sumur tempat seorang nabi di buang di dalamnya, atau pengikut nabi isa yang dimasukkan ke dalam parit lalu dibakar oleh raja yang musyrik serta banyak lagi generasi di antara kaum-kaum itu yang telah dibinasakan oleh Allah karena dosa-dosa mereka. 39. Dan masing-masing telah kami jadikan perumpamaan bagi yang lain. Kami telah jelaskan kepada mereka akan kebenaran para rasul kami dengan dalil yang sangat jelas dan masing-masing telah kami hancurkan sehancur-hancurnya dengan cara kami sendiri, baik dengan air bah, angin kencang yang panas, hujan batu, suara yang menggelegar, bumi yang ambles, penjungkirbalikan bumi, dan lain sebagainya."
  }
]