[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kepada tiap-tiap umat, Kami telah menerangkan kepada mereka hujjah-hujjah dan Kami telah menjelaskan kepada mereka bukti-bukti kebenaran, serta Kami patahkan udzur-udzur mereka. Meskipun demikian, mereka tetaop tidak beriman. Maka Kami pun benar-benar membinasakan mereka dengan kebinasaan yang besar."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "39. Dan setiap kaum yang dibinasakan, Kami sampaikan padanya tentang kebinasaan umat-umat sebelum mereka beserta faktor penyebab kebinasaannya, agar mereka bisa mengambil pelajaran darinya, dan mereka semua telah Kami hancurkan dengan sehancur-hancurnya lantaran kekafiran dan pembangkangan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "39. وَكُلًّا ضَرَبْنَا لَهُ الْأَمْثٰلَ ۖ (Dan Kami jadikan bagi masing-masing mereka perumpamaan) Yakni Kami telah memberikan mereka ketakutan dan mengisahkan kepada mereka kisah-kisah kaum yang mendustakan para Rasul. وَكُلًّا تَبَّرْنَا تَتْبِيرًا(dan masing-masing mereka itu benar benar telah Kami binasakan dengan sehancur-hancurnya) Yakni Kami benar-benar membinasakan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "39. Setiap kaum yang telah dihancurkan itu telah Kami beri peringatan dengan berita-berita tentang para pendusta. Dan setiap kaum itu telah Kami hancurkan sehancur-hancurnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Masing-masing telah Kami jelaskan} jelaskan {kepadanya, perumpamaan-perumpamaan} bukti-bukti dan dalil-dalil {dan masing-masing telah Kami menghancurkan sehancur-hancurnya} Kami telah menghancurkan dengan kehancuran yang sangat besar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "35-40 Allah mengisyaratkan kepada kisah-kisah ini, dan Dia telah menguraikannya di dalam ayat-ayat yang lain, untuk mengingatkan orang-orang yang di ajak biacara (mukhatabin) supaya waspada diri dari tenggelam dalam mendustakan Rasul mereka, sehingga mereka bisa ditimpa azab sebagimana yang telah menimpa umat-umat yang telah berlalu yang dekat dengan masa sebelum mereka, sedangkan mereka sendiri mengetahui cerita umat-umat tersebut karena sangat terkenal dan popular di kalangan mereka. Di anatra mereka ada yang telah melihat jejak-jejak (artefak) mereka dengan mata kepala, seperti kaum Nabi Shaleh di al-hijr, dan seperti negeri yang diguyur hujan buruk rupa batu sijjil; mereka melaluinya di pagi dan malam hari saat bepergian jauh. Sebab umat-umat tersebut tidaklah lebih jahat daripada mereka, dan para rasul merekapun tidaklah lebih baik daripada rasul kaum musyrikin itu; “apakah orang-orang kafirmu (hai kuam musyrikin) lebih baik daripada mereka itu, atau apakah kamu telah mempunyai jaminan kebebasan (dari azab) dalam kitab-kitab yang dahulu?” (al-qamar:43) Akan tetapi yang telah menghalangi mereka untuk beriman, meskipun mereka telah menyaksikan tanda-tanda, adalah bahwa mereka tidak mengharapkan kebangkitan dan kehidupan kembali setelah mati. Mereka sama sekali tidak mengharapkan perjumpaan dengan Rabb mereka, dan mereka tidak takut kepada ancamanNya. Maka dari itu mereka terus dalam sikap menentang. Sebab, jika tidak, maka sesungguhnya bukti-bukti telah sampai kepada mereka hingga tidak ada keraguan, tidak ada syubhat, tidak ada suatu kerancuan dan tidak ada kebimbangan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Furqan ayat 39: Dalam hal menegakkan hujjah kepada mereka, di mana mereka tidak dibinasakan kecuali setelah diberi peringatan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Furqan Ayat 39",
    "description": "Dan masing-masing telah kami jadikan perumpamaan bagi yang lain. Kami telah jelaskan kepada mereka akan kebenaran para rasul kami dengan dalil yang sangat jelas dan masing-masing telah kami hancurkan sehancur-hancurnya dengan cara kami sendiri, baik dengan air bah, angin kencang yang panas, hujan batu, suara yang menggelegar, bumi yang ambles, penjungkirbalikan bumi, dan lain sebagainya. 40. Dan sungguh, mereka, yaitu kaum musyrik mekah pada saat me-reka berniaga ke tanah syam telah melalui negeri kaum nabi lut, yakni sodom yang dulu karena perbuatan mereka yang diluar batas, yaitu melakukan sodomi, dijatuhi hujan batu yang buruk. Negeri mereka dijungkirbalikkan. Tidakkah mereka menyaksikannya' mereka pasti melalui negeri itu. Bahkan mereka itu sebenarnya tidak mengharapkan hari kebangkitan. Mereka menganggap bahwa hari kebangkitan adalah omong kosong belaka."
  }
]