[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang yang kafir kepada Allah berkata, “Al-Qur’an ini tiada lain hanyalah kebohongan dan kedustaan belaka, yang dibuat-buat oleh Muhammad, dan beberapa orang telah membantunya untuk itu.” Sesungguhnya mereka telah melakukan perbuatan kezhaliman parah dan mengadakan kedustaan yang amat buruk. Al-Qur’an termasuk sesuatu yang tidak mungkin bagi seorang manusia pun untuk mengadakannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. \"Dan orang-orang yang kafir kepada Allah dan Rasul-Nya berkata, 'Al-Qur`ān ini tidak lain hanyalah kebohongan yang diada-adakan oleh Muhammad, lalu disandarkan secara dusta kepada Allah, dan dalam pembuatannya dia dibantu oleh kaum yang lain.' Sesungguhnya orang-orang kafir itu telah membuat-buat perkataan dusta lagi batil. Al-Qur`ān adalah firman Allah. Bangsa manusia maupun jin tidak mungkin bisa mendatangkan kitab yang sepertinya.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "4-5. Orang-orang kafir itu membuat tuduhan bohong terhadap al-Qur’an dan Rasulullah dengan berkata: “Al-Qur’an ini hanyalah kedustaan yang dibuat Muhammad, dia dibantu oleh sekelompok orang Yahudi.” Sungguh mereka telah melakukan kezaliman yang besar dan membuat kedustaan yang keji karena telah mengatakan bahwa al-Qur’an adalah khurafat-khurafat umat terdahulu yang Muhammad perintahkan untuk ditulis dan dibacakan kepadanya setiap pagi dan petang agar dia dapat menghafalnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. وَقَالَ الَّذِينَ كَفَرُوٓا۟ إِنْ هٰذَآ إِلَّآ إِفْكٌ افْتَرَىٰهُ (Dan orang-orang kafir berkata: “Al Quran ini tidak lain hanyalah kebohongan yang diada-adakan oleh Muhammad) Yakni mereka mengatakan al-Qur’an ini tidak lain hanyalah kebohongan yang dibuat oleh Muhammad. وَأَعَانَهُۥ عَلَيْهِ(dan dia dibantu) Yakni dibantu untuk membuat kebohongan ini. قَوْمٌ ءَاخَرُونَ ۖ( oleh kaum yang lain”) Yang mereka maksud adalah sebagian orang Yahudi dan Nasrani. فَقَدْ جَآءُو ظُلْمًا وَزُورًا(maka sesungguhnya mereka telah berbuat suatu kezaliman dan dusta yang besar) Yakni mereka telah mengatakan suatu kezaliman yang besar dan kebohongan yang nyata."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Orang-orang kafir berkata: “Al-Qur’an ini tidak lain hanyalah kebohongan dan rekayasa yang dibuat-buat oleh Muhammad sendiri dan dibantu oleh kaum lain, yaitu orang yang masuk Islam dari kaum Yahudi dan Nasrani dalam mengumpulkannya” Sungguh mereka telah mengatakan kezaliman yang besar. Azh-zhulmu adalah meletakkan sesuatu tidak pada tempatnya. Mereka telah mengatakan kebohongan yang mutlak dan jauh dari kebenaran. Ayat ini diturunkan untuk Nadhr bin Harits yang mengatakan perkataan ini setelah 3 orang ahli kitab masuk Islam"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Orang-orang kafir berkata,“Ini tidak lain} Al-Qur’an ini tidak lain {hanyalah kebohongan yang diada-adakan olehnya} kebohongan yang dibuat-buat Muhammad dari dirinya sendiri {dan dibantu oleh kaum lain” Sungguh, mereka telah berbuat zalim dan dusta yang besar} membuat kebohongan besar yang di dalamnya terdapat pembenaran terhadap sesuatu yang bathil dan tabir pada suatu perkataan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4 maksudnya, dan orang-orang yang kafir kepada Allah, yang kekafiran mereka telah memastikan mereka untuk mengatakan tentang al-qur’an dan Rasulullah, ”sesungguhnya al-qur’an ini adalah kedustaan yang di buat-buat oleh Muhammad, dan kebohongan yang diada-adakannya atas Nama Allah, dan dia ditolong oleh orang-orang lain untuk semua ini,” lalu Allah membantah mereka atas ungkapan itu, bahwa semua itu adalah sikap pembangkangan mereka dan kelancangan mereka melakukan kezhaliman dan kedustaan besar yang tidak mungkin bisa masuk kepada akal sehat seseorang. Sebab, mereka adalah orang-orang yang sangat mengetahui kondisi Rasulullah Saw, kesempurnaan kejujurannya, amanahnya dan budi pekertinya yang sangat sempurna; dan bahwa tidak mungkin bagi Muhammad dan seluruh manusia membuat al-qur’an yang merupakan perkataan yang paling mulia lagi paling tinggi; dan bahwa dia sama sekali tidak pernah berkumpul dengan siapapun yang menolongnya untuk hal ini. ”maka sesungguhnya mereka telah berbuat,” dengan perkataan seperti itu dengan “suatu kezhaliman dan dusta yang besar,”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Furqan ayat 4: Setelah Allah Subhaanahu wa Ta'aala menetapkan kebenaran tauhid dengan dalil yang qath’i (pasti) lagi jelas dan batilnya syirk (mengadakan tandingan bagi Allah), Dia menetapkan kebenaran risalah Nabi Muhammad shallallahu 'alaihi wa sallam dan batilnya orang yang menolaknya dan menentangnya. Yang dimaksud dengan orang-orang yang lain itu adalah orang-orang Ahli Kitab. Allah membantah mereka dengan menerangkan, bahwa mereka telah bersikap sombong, zalim dan berdusta besar. Padahal mereka mengetahui pribadi orang yang membawanya, terkenal kejujurannya, amanahnya, dan akhlaknya yang mulia, dan lagi tidak mungkin bagi Beliau bahkan semua makhluk untuk mendatangkan Al Qur’an yang isinya begitu agung, indah, dan bijaksana, bahkan terdapat berita-berita orang terdahulu yang benar, yang tidak diketahui kecuali oleh Allah Subhaanahu wa Ta'aala."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Furqan Ayat 4",
    "description": "Tidak hanya menolak keesaan Allah, kaum kafir juga melecehkan Al-Qur'an. Dan orang-orang kafir berkata dengan nada menghina, 'Al-Qur'an ini tidak lain hanyalah kebohongan yang diada-adakan secara sengaja oleh Muhammad, dan dalam menciptakannya dia dibantu oleh orang-orang lain yang memiliki kemampuan untuk itu. ' menanggapi tuduhan ini Allah menegaskan, 'sungguh, mereka telah berbuat zalim dan dusta yang besar, yang menjauhkan mereka dari kebenaran. \"5. Dan mereka juga berkata, 'Al-Qur'an itu hanya dongeng-dongeng orang-orang terdahulu, yang diminta agar dituliskan secara sungguh-sungguh, lalu dibacakanlah dongeng itu kepada nabi Muhammad setiap pagi dan petang, yakni secara terus-menerus."
  }
]