[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sesungguhnya orang-orang musyrik Makkah melewati perkampungan kaum Luth dalam perjalanan-perjalanan mereka, yaitu negeri Sodom yang telah dihancurkan dengan hujan batu dari langit, namun mereka enggan mengambil pelajaran dengannya. Mereka justru tidak mengharapkan kembali hidup pada Hari Kiamat untuk memperoleh pembalasan disana."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "40. Dan sesungguhnya orang-orang yang mendustakanmu dari kalangan kaummu -ketika mereka pergi ke negeri Syam- telah melewati negeri kaum Lūṭ yang dulu dihujani dengan batu sebagai hukuman perbuatan keji mereka, agar mereka (kaum musyrikin itu) bisa mengambil pelajaran darinya. Maka apakah mereka buta terhadap reruntuhan negeri itu sehingga tidak menyaksikannya? Sungguh tidak demikian, tetapi mereka itu tidak mengharapkan datangnya Hari Kebangkitan yang di dalamnya amal perbuatan mereka akan dihisab."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "40. Sungguh kaum Quraisy ketika pergi berdagang telah melewati negeri Sodom yang telah Allah binasakan penduduknya yang merupakan kaum Nabi Luth, Allah membinasakan mereka dengan batu dari tanah yang keras. Dan Kami menjadikan negeri itu terbalik; tanah bagian atas menjadi bagian bawahnya, sebagaimana dijelaskan pada surat al-Hijr: 74. Sungguh mengherankan kebebalan mereka itu, apakah mereka tidak melihat apa yang telah menimpa negeri itu sehingga mereka dapat mengambil pelajaran? Mereka adalah orang-orang kafir yang mengingkari hari kebangkitan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "40. وَلَقَدْ أَتَوْا۟ عَلَى الْقَرْيَةِ الَّتِىٓ أُمْطِرَتْ مَطَرَ السَّوْءِ ۚ (Dan sesungguhnya mereka telah melalui sebuah negeri yang (dulu) dihujani dengan hujan yang buruk (hujan batu)) Yakni orang-orang musyrik Makkah telah mendatangi negeri kaum Luth yang dibinasakan dengan hujan batu. أَفَلَمْ يَكُونُوا۟ يَرَوْنَهَا ۚ( Maka apakah mereka tidak menyaksikan runtuhan itu) Mereka melalui negeri itu ketika mereka pergi ke negeri Syam untuk berdagang. بَلْ كَانُوا۟ لَا يَرْجُونَ نُشُورًا(bahkan adalah mereka itu tidak mengharapkan akan kebangkitan) Yakni sebenarnya mereka tidak takut terhadap hari kebangkitan untuk membalas perbuatan mereka sehingga mereka tidak mau mengambil pelajaran dari kebinasaan negeri itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "40. Dan sungguh di tengah perdagangan mereka menuju Syam, orang-orang kafir Mekah itu telah melewati kota kaum Luth yaitu Sodom dan kota-kota setelahnya yang dihancuran dengan bebatuan yang dilemparkan kepadanya. Apakah mereka tidak melihat kota-kota itu di tengah perjalanan mereka menuju Syam sehingga mereka bisa mengambil pelajaran dari sisa-sisa azab Tuhan itu?! Bahkan mereka tidak berharap dibangkitkan dari kubur."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sungguh mereka telah melalui} orang-orang kafir Mekkah dalam perjalanannya melewati {negeri} negeri kaum Luth {yang dihujani dengan sesuatu yang buruk} dibinasakan dengan (hujan) batu {Tidakkah mereka menyaksikannya. Bahkan mereka itu sebenarnya tidak mengharapkan adanya kebangkitan} tidak mengharapkan kebangkitan setelah mati"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "35-40 Allah mengisyaratkan kepada kisah-kisah ini, dan Dia telah menguraikannya di dalam ayat-ayat yang lain, untuk mengingatkan orang-orang yang di ajak biacara (mukhatabin) supaya waspada diri dari tenggelam dalam mendustakan Rasul mereka, sehingga mereka bisa ditimpa azab sebagimana yang telah menimpa umat-umat yang telah berlalu yang dekat dengan masa sebelum mereka, sedangkan mereka sendiri mengetahui cerita umat-umat tersebut karena sangat terkenal dan popular di kalangan mereka. Di anatra mereka ada yang telah melihat jejak-jejak (artefak) mereka dengan mata kepala, seperti kaum Nabi Shaleh di al-hijr, dan seperti negeri yang diguyur hujan buruk rupa batu sijjil; mereka melaluinya di pagi dan malam hari saat bepergian jauh. Sebab umat-umat tersebut tidaklah lebih jahat daripada mereka, dan para rasul merekapun tidaklah lebih baik daripada rasul kaum musyrikin itu; “apakah orang-orang kafirmu (hai kuam musyrikin) lebih baik daripada mereka itu, atau apakah kamu telah mempunyai jaminan kebebasan (dari azab) dalam kitab-kitab yang dahulu?” (al-qamar:43) Akan tetapi yang telah menghalangi mereka untuk beriman, meskipun mereka telah menyaksikan tanda-tanda, adalah bahwa mereka tidak mengharapkan kebangkitan dan kehidupan kembali setelah mati. Mereka sama sekali tidak mengharapkan perjumpaan dengan Rabb mereka, dan mereka tidak takut kepada ancamanNya. Maka dari itu mereka terus dalam sikap menentang. Sebab, jika tidak, maka sesungguhnya bukti-bukti telah sampai kepada mereka hingga tidak ada keraguan, tidak ada syubhat, tidak ada suatu kerancuan dan tidak ada kebimbangan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Furqan ayat 40: Dalam safar mereka ke Syam. Yakni tidak takut kepadanya sehingga mereka tidak beriman."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Furqan Ayat 40",
    "description": "40. Dan sungguh, mereka, yaitu kaum musyrik mekah pada saat me-reka berniaga ke tanah syam telah melalui negeri kaum nabi lut, yakni sodom yang dulu karena perbuatan mereka yang diluar batas, yaitu melakukan sodomi, dijatuhi hujan batu yang buruk. Negeri mereka dijungkirbalikkan. Tidakkah mereka menyaksikannya' mereka pasti melalui negeri itu. Bahkan mereka itu sebenarnya tidak mengharapkan hari kebangkitan. Mereka menganggap bahwa hari kebangkitan adalah omong kosong belaka. 41. Pada ayat selanjutnya dijelaskan tentang sikap orang musyrik terhadap nabi Muhammad. Dan apabila mereka melihat engkau Muhammad, karena kedengkian mereka, mereka hanyalah menjadikan engkau sebagai ejekan dengan berbagai cara. Ada yang menuduhnya sebagai orang gila, tukang tenung, penyair. Mereka terus mengejek nabi (dengan me-ngatakan), 'inikah orangnya yang diutus Allah sebagai rasul'"
  }
]