[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "41-42. Dan apabila orang-orang yang mendustakan melihatmu (wahai Rasul) mereka mengolok-olok dirimu dengan berkata, “Apakah orang ini yang mengaku-aku bahwa sesungguhnya Allah mengutusnya sebagai utusan kepada kita? Sesungguhnya hampir saja dia memalingkan kita dari penyembahan kepada berhala-berhala kita dengan kekautan hujjah dan penjelasannya, seandainya kita tidak teguh untuk menyembahnya.” Dan mereka itu kelak akan mengetahui tatkala mereka menyaksikan siksaan yang akan mereka peroleh: siapakah orang yang sesat ajaran agamanya; mereka ataukah Muhammad?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "41. Dan apabila orang-orang yang mendustakanmu itu melihat dirimu wahai Rasul, mereka menjadikan engkau sebagai bahan ejekan dengan mengatakan hinaan dan pengingkaran, \"Inikah orangnya yang diutus Allah sebagai Rasul kepada kita semua?”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "41-42. Hai Rasulullah, jika orang-orang musyrik melihatmu maka mereka akan menghinamu dan merendahkanmu: “Apakah ini orang yang Allah utus sebagai rasul bagi kita? Sungguh dia hampir memalingkan kita dari menyembah tuhan-tuhan kita dengan hujjahnya yang kuat dan mukjizatnya yang besar, kalaulah bukan karena keteguhan kita dalam menyembah tuhan-tuhan itu.” Mereka akan mengetahui dengan pasti saat mereka menyaksikan azab, siapa yang lebih jauh dari kebenaran, apakah mereka atau orang-orang beriman?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "41. وَإِذَا رَأَوْكَ إِن يَتَّخِذُونَكَ إِلَّا هُزُوًا (Dan apabila mereka melihat kamu (Muhammad), mereka hanyalah menjadikan kamu sebagai ejekan) Yakni bukannya mereka beriman kepadamu dan memahami risalah yang kamu bawa, mereka malah mengolok-olokmu dengan mengatakan:أَهٰذَا الَّذِى بَعَثَ اللهُ رَسُولًا “Inikah orangnya yang di utus Allah sebagai Rasul?”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "41. Dan ketika orang-orang musyrik itu melihatmu wahai Nabi, maka mereka hanya menjadikanmu tempat olok-olok dan ejekan. Mereka tidak melihatmu kecuali dengan pandangan ini dan berkata: “Inikah orang yang diutus Allah sebagai rasul sebagaimana anggapannya?” Ayat ini diturunkan untuk Abu Jahal. Sesungguhnya dia ketika bertemu Rasulallah SAW bersama sahabatnya, dia berkata dengan mengejek: {Inikah orang yang…}"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apabila mereka melihatmu, mereka tidak menjadikanmu} mereka tidak menjadikanmu {selain sebagai bahan ejekan} untuk diejek {“Inikah orangnya yang diutus Allah sebagai rasul"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "41 maksudnya, “dan apabila mereka melihat kamu,” wahai Muhammad, mereka yang mendustakanmu, para penentang ayat-ayat Allah, yang menyombongkan diri di muka bumi, mereka memperolok-olokanmu, menghinamu dan mengatakan dengan nada menghina dan menyepelekan, “inikah orang yang diutus Allah sebagai Rasul,?” maksudnya, tidak pantas dan tidak layak kalau Allah mengutus si lelaki ini! Ini semua karena sangat memuncaknya kezhaliman dan keras kepala mereka. Mereka memutar balikan kenyataan. Sebab perkataan mereka tersebut memberikan pengertian bahwa Rasululah, -dan ini tidak mungkin-, berada dalam jurang kehinaan dan kenistaan, dan bahwa kalau saja kerasulan itu diberikan kepada selainnya,maka yang demikian itu lebih cocok. “dan mereka berkata, ’mengapa al-qur’an ini tidak diturunkan kepada seorang besar dari salah satu dua negeri (Makkah dan tha’if) ini.” (az-zukhruf:31) Perkataan ini tidak akan keluar kecuali dari (mulut) manusia yang paling bodoh, paling sesat atau paling keras kepala, dan dia berpura-pura bodoh yang tujuannya adalah mempropagandakan kebatilan yang dibawanya dengan mendiskriditkan (mencemoohkan) kebenaran dan orang yang membawanya. Kalau tidak demikian, maka siapa saja yang memperhatikan perihal keadaan Muhammad bin Abdillah, niscaya dia menjumpainya sebagai sosok manusia alim, unggul di dalam kecerdasan akal, ilmu, kepribadian, ketangguhan, akhlak mulia, budi pekerti luhur, kehormatan diri, keberanian, kemurahan hati, dan segala akhlak mulia; sementara orang yang menghina dan mencercanya adalah orang yang penuh dengan sifat kedunguan, kebodohan, kesesatan, kontradiksi, zhalim dan melampaui batas yang tidak ada bandingannya. Cukup (untuk mewakili) kebodohan dan kesesatannya adalah sikapnya yang selalu mencemoohkan Rasul yang agung ini, rasul yang penuh semangat dan mulia. Tujuan cemoohan dan ejekan mereka terhadapnya adalah sikap keras mereka (berpegang teguh) pada kebatilan dan untuk memperdaya orang-orang yang kurang berakal."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Furqan ayat 41: Yang mendustakanmu dan menentang ayat-ayat Allah lagi bersikap sombong di bumi. Sambil merendahkannya. Hal ini disebabkan sikap zalim dan pembangkangan mereka yang sungguh keras serta hendak memutarbalikkan fakta. Dari ucapan mereka ini dapat dipahami bahwa Nabi Muhammad shallallahu 'alaihi wa sallam menurut mereka rendah, dan bahwa seandainya risalah itu diberikan kepada selainnya, maka lebih tepat. Ucapan ini tidaklah muncul kecuali dari orang yang paling bodoh dan paling sesat atau orang yang paling membangkang padahal tahu keadaan yang sebenarnya, di mana maksud ucapan itu adalah untuk menguatkan kebatilannya dengan cara mengkritik kebenaran dan orang yang membawanya. Padahal barang siapa yang memperhatikan keadaan Nabi Muhammad shallallahu 'alaihi wa sallam tentu dia akan mendapatkan bahwa Beliau orang yang cocok memegang kepemimpinan lagi orang yang paling cerdas di antara mereka, memiliki ilmu, ketenangan, akhlak yang mulia, ‘iffah (kesucian diri), keberanian, kedermawanan dan semua akhlak utama, sehingga orang yang menghinanya dan membencinya telah menggabung antara kebodohan, kesesatan, pertentangan, kezaliman dan sikap kelewatan. Cukuplah dia sebagai orang yang bodoh lagi sesat jika mencacatkan Rasul yang utama ini dan ksatria yang mulia ini."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Furqan Ayat 41",
    "description": "Pada ayat selanjutnya dijelaskan tentang sikap orang musyrik terhadap nabi Muhammad. Dan apabila mereka melihat engkau Muhammad, karena kedengkian mereka, mereka hanyalah menjadikan engkau sebagai ejekan dengan berbagai cara. Ada yang menuduhnya sebagai orang gila, tukang tenung, penyair. Mereka terus mengejek nabi (dengan me-ngatakan), 'inikah orangnya yang diutus Allah sebagai rasul' 42. Padahal mereka tahu bahwa nabi Muhammad tidaklah pernah berdusta. Mereka merasa bahwa nabi Muhammad telah melakukan upaya maksimal dalam berdakwah, sehingga di antara mereka saling berbisik: sungguh, hampir saja dia yakni nabi Muhammad, menyesatkan, membelokkan kita dari sesembahan kita, seandainya kita tidak tetap bertahan menyembah nya. ' walaupun dengan dalih yang dibuat-buat, mengelabui orang lain atau dengan jalan menakut nakuti. Dan kelak mereka akan mengetahui pada saat mereka melihat azab, baik di dunia maupun di akhirat siapa yang paling sesat jalannya, apakah nabi Muhammad yang berada pada jalur kebenaran atau mereka sendiri. Pada waktu perang badar, hal tersebut terbukti."
  }
]