[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "41-42. Dan apabila orang-orang yang mendustakan melihatmu (wahai Rasul) mereka mengolok-olok dirimu dengan berkata, “Apakah orang ini yang mengaku-aku bahwa sesungguhnya Allah mengutusnya sebagai utusan kepada kita? Sesungguhnya hampir saja dia memalingkan kita dari penyembahan kepada berhala-berhala kita dengan kekautan hujjah dan penjelasannya, seandainya kita tidak teguh untuk menyembahnya.” Dan mereka itu kelak akan mengetahui tatkala mereka menyaksikan siksaan yang akan mereka peroleh: siapakah orang yang sesat ajaran agamanya; mereka ataukah Muhammad?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "42. Sesungguhnya hampir saja ia menyesatkan dan memalingkan kita dari penyembahan terhadap tuhan-tuhan kita, seandainya kita tidak sabar dan teguh menyembahnya, niscaya ia (Rasul) pasti memalingkan kita darinya dengan argumen dan bukti yang ia bawa.\" Dan mereka kelak akan tahu, di saat mereka melihat azab dalam kubur dan pada hari Kiamat, siapa yang paling sesat jalannya, mereka ataukah Rasul? Saat itulah mereka pasti akan tahu siapa yang lebih sesat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "42. إِن كَادَ لَيُضِلُّنَا عَنْ ءَالِهَتِنَا (Sesungguhnya hampirlah ia menyesatkan kita dari sembahan-sembahan kita) Yakni ia hampir saja memalingkan kita dari tuhan-tuhan kita agar kita tidak menyembah mereka lagi. لَوْلَآ أَن صَبَرْنَا عَلَيْهَا ۚ( seandainya kita tidak sabar(menyembah)nya”) Yakni kita menahan diri untuk terus menyembah mereka, dan kita tidak mentaatinya untuk menjauhi mereka. وَسَوْفَ يَعْلَمُونَ حِينَ يَرَوْنَ الْعَذَابَ(dan mereka kelak akan mengetahui di saat mereka melihat aza) Yakni azab yang layak mereka dapatkan akibat kekafiran mereka. مَنْ أَضَلُّ سَبِيلًا (siapa yang paling sesat jalannya) Yakni siapa yang paling jauh dari jalan kebenaran dan hidayah, mereka atau orang-orang beriman?"
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ إِن كَادَ لَيُضِلُّنَا عَنْ ءَالِهَتِنَا لَوْلَآ أَن صَبَرْنَا عَلَيْهَا ۚ } \"Sesungguhnya hampirlah ia menyesatkan kita dari sembahan-sembahan kita, seandainya kita tidak sabar(menyembah)nya\" { وَٱنطَلَقَ ٱلْمَلَأُ مِنْهُمْ أَنِ ٱمْشُوا۟ وَٱصْبِرُوا۟ عَلَىٰٓ ءَالِهَتِكُمْ } \"وَٱنطَلَقَ ٱلْمَلَأُ مِنْهُمْ أَنِ ٱمْشُوا۟ وَٱصْبِرُوا۟ عَلَىٰٓ ءَالِهَتِكُم\" [Shad : 6] Lihatlah bagaimana ahli bathil mereka bersabar di atas kebathilan mereka! maka bagaimana keadaan ahli haq ketika mereka tidak bersabar di atas kebenaran yang mereka yakini?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "42. Sungguh kalau tidak karena kemantaban dan keteguhan kita dalam beribadah, dia hampir mengalihkan kita dari menyembah tuhan-tuhan kita dengan kemahirannya dalam membuktikan keesaan (Allah). Mereka akan mengetahui dengan yakin tentang siapa yang lebih jauh dari kebenaran saat menyaksikan azab yang menimpa mereka, apakah mereka atau orang-orang mukmin?!"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya hampir saja dia menyesatkan kita dari tuhan-tuhan kita} sungguh dia hampir memalingkan dan mengalihkan kita dari menyembah berhala-berhala kami {seandainya kita tidak bertahan (menyembah)nya” Kelak mereka akan mengetahui ketika melihat azab, siapa yang paling sesat jalannya} jalannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "42 maka dari itu, mereka mengatakan “sesungguhnya hampirlah ia menyesatkan kita dari sembahan-sembahan kita,” [si lelaki ini] dengan menjadikan sembahan-sembahan itu hanya satu sembahan saja, “seandainya kita tidak sabar (menyembah)nya,” tentu dia telah menyesatkan kita. Mereka beranggapan, -semoga Allah memperburuk mereka-, bahwa kesesatan itu adalah tauhid, dan bahwa petunjuk (kebenaran) itu adalah kesyirikan yang mereka anut. Maka dari itu mereka saling mengingatkan agar selalu sabar dalam kesyirikan itu, “dan pergilah pemimpin-pemimpin mereka (seraya berkata),’pergilah kamu dan tetaplah (menyembah) ilah-ilahmu’.” (shad:6) Dan di sini mereka mengatakan, “seandainya kita tidak sabar (menyembahnya),” sabar itu terpuji dalam segala kondisi, kecuali dalam kondisi seperti ini. Sebab kondisi yang satu ini adalah sabar atas sebab kausalitas yang dapat menimbulkan murka, dan sabar atas perbuatan menumpuk kayu bakar Neraka Jahanam. Sedangkan orang-orang beriman, mereka seperti yang diFirmankan oleh Allah tentang mereka, ”nasihat menasihatilah supaya menaati kebenaran dan nasihat menasihatilah supaya menetapi kesabaran,” (al-ashr:3) Ketika ini merupakan klaim mereka bahwa merekalah orang-orang yang mendapat petunjuk, sedangkan Rasulullah adalah sesat, padahal sudah pasti bahwa mereka sudah tidak mempunyai alasan lagi, maka Allah mengancam mereka dengan azab, dan Dia informasikan bahwa mereka pada saat itu “di saat mereka melihat azab,” mereka akan mengetahui dengan pengetahuan yang hakiki “siapa,” dia “yang paling sesat jalannya.” “dan (ingatlah) hari (ketika) orang yang zhalim itu menggigit dua tangannya, seraya berkata, ’aduhai kiranya (dulu) aku mengambil jalan bersama Rasul’.” (al-furqan:27)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Furqan ayat 42: Maksud mereka mencacatkan Beliau dan menghinanya adalah agar mereka tetap istiqamah di atas kebatilan dan menipu orang-orang yang kurang akal. Dengan menyembah hanya satu Tuhan. Mereka mengira bahwa tauhid adalah kesesatan, dan bahwa syirk adalah petunjuk, oleh karenanya mereka saling berwasiat untuk bersabar di atas syirk. Sabar di semua keadaan adalah terpuji selain pada keadaan ini, maka dalam keadaan ini, sabar tersebut adalah sabar tercela, karena sabar untuk tetap di neraka. Dengan mata kepala mereka di akhirat. Mereka atau kaum mukmin."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Furqan Ayat 42",
    "description": "Padahal mereka tahu bahwa nabi Muhammad tidaklah pernah berdusta. Mereka merasa bahwa nabi Muhammad telah melakukan upaya maksimal dalam berdakwah, sehingga di antara mereka saling berbisik: sungguh, hampir saja dia yakni nabi Muhammad, menyesatkan, membelokkan kita dari sesembahan kita, seandainya kita tidak tetap bertahan menyembah nya. ' walaupun dengan dalih yang dibuat-buat, mengelabui orang lain atau dengan jalan menakut nakuti. Dan kelak mereka akan mengetahui pada saat mereka melihat azab, baik di dunia maupun di akhirat siapa yang paling sesat jalannya, apakah nabi Muhammad yang berada pada jalur kebenaran atau mereka sendiri. Pada waktu perang badar, hal tersebut terbukti. 43. Sudahkah engkau, wahai rasul melihat orang yang menjadikan keinginannya sebagai tuhannya, dengan selalu mengikuti hawa nafsunya. Orang-orang jahiliah, seperti dituturkan oleh ibnu abbas, selalu berganti sesembahan. Manakala ada sesembahan yang dipandang lebih baik, mereka akan mengganti sesembahan yang lama dengan yang baru. Apakah engkau akan menjadi pelindungnya' engkau, wahai rasul, tidak akan bisa menahan mereka dari kesesatan, karena tugas kamu adalah menyampaikan ajaran."
  }
]