[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Lihatlah (wahai Rasul) dengan penuh keheranan, kepada orang yang menaati hawa nafsunya seperti layaknya dia menaati Allah. Apakah kamu akan menjadi pelindung bagi orang itu hingga mengembalikannya kepada keimanan?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "43. Tidakkah engkau perhatikan -wahai Rasul- orang yang menjadikan hawa nafsunya sebagai tuhannya yang selalu ia taati. Maka apakah kamu dapat menjadi pemelihara atasnya dengan mengembalikannya kepada keimanan dan menghalanginya dari kekafiran?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "43. Hai Nabi, lihat dan terheranlah dari orang yang mentaati hawa nafsunya seperti ketika mentaati Allah. Apakah kamu akan menjadi pelindung bagi orang yang mengikuti hawa nafsunya?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "43. أَرَءَيْتَ مَنِ اتَّخَذَ إِلٰهَهُۥ هَوَىٰهُ (Terangkanlah kepadaku tentang orang yang menjadikan hawa nafsunya sebagai tuhannya) Yakni orang yang mentaati hawa nafsunya seperti ketaatan kepada Tuhan, hawa nafsunya tidak menginginkan sesuatu kecuali ia pasti menurutinya. أَفَأَنتَ تَكُونُ عَلَيْهِ وَكِيلًا (Maka apakah kamu dapat menjadi pemelihara atasnya?) Yakni apakah kamu adalah penjaga dan menanggung nasibnya sehingga kamu harus menjadikannya beriman dan mengeluarkannya dari kekafiran, kamu tidak akan mampu melakukannya dan tugasmu hanyalah menyampaikan risalah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "43. Beritahulah aku tentang orang yang menjadikan hawa nafsunya sebagai tuhannya, Dia menaati hawa nafsunya layaknya menaati Tuhan. Apakah kamu bisa menjadi pelindung yang mencegahnya untuk mengikuti hawa nafsunya?! Ini adalah istifham inkary. Dan istifham pertama itu untuk penyampaian keterangan dan keterkejutan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apakah kamu telah melihat orang yang menjadikan hawa nafsunya sebagai tuhannya. Apakah kamu akan menjadi pelindungnya} penjaga yang mengembalikannya kepada keimanan dan menjaganya dari kekufuran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "43 apakah ada kesesatan yang lebih tinggi daripada orang yang menjadikan hawa nafsunya sebagai sembahannya, keinginannya selalu diaplikasikan? Maka dari itu Allah berfirman, ”terangkanlah kepadaku tentang orang yang menjadikan hawa nafsunya sebagai tuhannya.” Tidaklah kamu heran kepada keadaan orang itu, dan kamu perhatikan kesesatan yang ada padanya, sedangkan dia menilai dirinya dengan kedudukan-kedudukan tinggi, “maka apakah kamu dapat menjadi pemelihara atasnya?” maksudnya, kamu bukanlah orang yang menguasainya, akan tetapi kamu adalah seorang pemberi peringatan, dan kamu telah melakukan tugasmu, sedangkan perkara orang itu di serahkan kepada Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Furqan ayat 43: Apa yang diinginkan hawa nafsunya dia kerjakan. Yakni tidakkah engkau heran terhadap keadaannya dan melihat kesesatan yang ada pada dirinya, namun menurutnya ia berada dalam keadaan yang terbaik. Yang menjaganya dari mengikuti hawa nafsunya. Yakni Engkau (Muhammad) tidak berkuasa terhadapnya, engkau hanyalah pemberi peringatan dan engkau telah melakukan tugasmu, adapun hisabnya maka diserahkan kepada Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Furqan Ayat 43",
    "description": "Sudahkah engkau, wahai rasul melihat orang yang menjadikan keinginannya sebagai tuhannya, dengan selalu mengikuti hawa nafsunya. Orang-orang jahiliah, seperti dituturkan oleh ibnu abbas, selalu berganti sesembahan. Manakala ada sesembahan yang dipandang lebih baik, mereka akan mengganti sesembahan yang lama dengan yang baru. Apakah engkau akan menjadi pelindungnya' engkau, wahai rasul, tidak akan bisa menahan mereka dari kesesatan, karena tugas kamu adalah menyampaikan ajaran. 44. Atau apakah engkau, wahai rasul, mengira bahwa kebanyakan mere-ka itu mendengar apa yang engkau katakan kepada mereka berupa petunjuk ke jalan yang benar' atau memahami maksud dari apa yang kau katakan, dengan pemahaman yang benar, dan dari hati sanubari mereka, sehingga mereka bersedia melakukan apa yang kau katakan' mereka itu hanyalah seperti hewan ternak, bahkan lebih sesat jalannya. Bahkan hewan ternak lebih baik lagi, karena hewan akan loyal kepada yang berbuat baik kepadanya. Sementara kaum musyrik sama sekali tidak tahu diri terhadap zat yang memberikan kehidupan dan rezeki kepada mereka."
  }
]