[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Atau apakah kamu akan menyangka bahwa kebanyakan mereka akan mendengarkan ayat-ayat Allah dengan penuh penghayatan ataukah (berusaha) memahami isi kandungannya? Mereka itu tiada lain kecuali seperti binatang-binatang ternak, dalam tinjauan tidak memperoleh manfaat dari apa yang mereka dengar. Bahkan mereka jauh lebih sesat daripada binatang-binatang itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "44. Bahkan apakah engkau mengira -wahai Rasul- bahwa kebanyakan mereka yang engkau dakwahi untuk pengesaan Allah dan ketaatan-Nya itu mendengar atau memahami argumen dan bukti-bukti kebenaran yang engkau bawa?! Mereka itu tidak lain, hanyalah seperti binatang ternak dari segi mendengar, berpikir dan memahami, bahkan mereka lebih sesat jalannya dari binatang ternak."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "44. Apakah kamu mengira mayoritas orang kafir akan mendengar apa yang bermanfaat bagi mereka atau akan mengikuti kebenaran? Mereka tidak lain hanya seperti hewan ternak yang tidak dapat berfikir, bahkan mereka lebih sesat jalannya dari hewan ternak."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "44. إِنْ هُمْ إِلَّا كَالْأَنْعٰمِ ۖ (Mereka itu tidak lain, hanyalah seperti binatang ternak) Yakni seperti binatang yang tidak memiliki akal; maka janganlah kamu terlalu berharap pada mereka. بَلْ هُمْ أَضَلُّ سَبِيلًا (bahkan mereka lebih sesat jalannya) Yakni lebih sesat jalannya dari hewan ternak, sebab hewan ternak mengetahui dan mematuhi pemiliknya dan mengetahui jalan menuju tempat gembalaannya; sedangkan orang-orang kafir itu tidak mentaati dan mengetahui tuhan mereka yang telah menciptakan dan memberi rezeki. Dan hewan ternak meskipun tidak memahami kebenaran tauhid dan kenabian namun hewan itu tidak menganggapnya sebagai hal yang batil, berbeda dengan orang-orang kafir yang menganggap tauhid dan kenabian adalah hal yang batil disebabkan kedurhakaan dan kesombongan mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Sejenak berhenti pada ayat ini untuk mentadabburi dan mengamati apa yang dikatakan; agar dapat ditemukan celah yang terdapat pada upaya-upaya untuk mengukur keadaan manusia, dan bahwasanya Al-Qur'an adalah satu-satunya timbangan yang dipercaya untuk mengukur tingkat kekuatan dan kelemahan akal manusia, dan sesungguhnya semua itu tergantung bagaimana iltizam seseorang pada syari'at dan mendengarkan kebenarannya, akan diketahui bagaimana sempurna dan kurangnya akal."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "44. Ataukah kamu beranggapan bahwa mereka mendengarkan dengan seksama dan memikirkan apa yang kamu katakan kepada mereka sehingga ayat-ayat dan bukti-bukti itu berguna bagi mereka, wahai Nabi? Mereka itu tidak lain seperti binatang yang tidak memiliki pemahaman dan kesadaran atau bahkan mereka lebih sesat jalannya daripada binatang ternak."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Atau apakah kamu mengira} atu apakah kamu mengira {bahwa kebanyakan mereka itu mendengar atau memahami. Mereka tidak} Mereka tidak {lebih kecuali seperti hewan ternak. Bahkan mereka lebih sesat jalannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "44 kemudian Allah mencatat kesesatan mereka yang sangat jauh itu dengan menanggalkan akal dan pendengaran mereka; dan Allah juga menyamakan mereka di dalam kesesatan dengan binatang-binatang ternak yang sedang berkeliaran di padang rumput, yang tidak mendengar kecuali seruan dan panggilan, “mereka tuli, bisu, dan buta, maka mereka tidak mengerti.” (al-baqarah:171) Bahkan mereka lebih sesat daripada hewan ternak. Sebab binatang ternak digiring oleh sang pengembalanya lalu hewan-hewan itu menurut, dan mengetahui jalan kebinasaannya, maka ia menghindarinya. Dan hewan-hewan ternak itu juga lebih selamat akhir urusannya daripada mereka. Dengan demikian sudah jelas bahwa orang yang mencakup Rasulullah Saw dengan keseatan lebih berhak mendapat cap tersebut, dan bahwa setiap hewan ternak lebih mendapat petunjuk daripadanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Furqan ayat 44: Kemudian Allah menghukumi mereka, bahwa mereka tidak dapat mendengar dan memahami. Demikian juga Dia menyamakan mereka dengan hewan ternak yang tidak mendengar apa-apa selain suara panggilan dan teriakan saja, mereka tuli, bisu dan buta, bahkan keadaannya lebih sesat daripada binatang ternak, karena binatang ternak itu apabila diarahkan oleh penggembalanya akan menurut dan apabila mengetahui jalan yang menjurus kepada kebinasaan, ia segera menjauhinya. Binatang ternak tersebut lebih pandai daripada mereka itu. Oleh karena itulah, bahwa orang yang menuduh Rasulullah shallallahu 'alaihi wa sallam tersesat layak memperoleh sifat itu dan bahwa hewan ternak justru lebih lurus jalannya daripada orang tersebut. Apa yang engkau sampaikan kepada mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Furqan Ayat 44",
    "description": "Atau apakah engkau, wahai rasul, mengira bahwa kebanyakan mere-ka itu mendengar apa yang engkau katakan kepada mereka berupa petunjuk ke jalan yang benar' atau memahami maksud dari apa yang kau katakan, dengan pemahaman yang benar, dan dari hati sanubari mereka, sehingga mereka bersedia melakukan apa yang kau katakan' mereka itu hanyalah seperti hewan ternak, bahkan lebih sesat jalannya. Bahkan hewan ternak lebih baik lagi, karena hewan akan loyal kepada yang berbuat baik kepadanya. Sementara kaum musyrik sama sekali tidak tahu diri terhadap zat yang memberikan kehidupan dan rezeki kepada mereka. 45. Pada ayat-ayat di bawah ini dijelaskan enam fenomena alam seluruh sebagai bukti kekuasaan dan anugerah Allah. Ke enam fenomena tersebut adalah suasana teduh, terjadinya malam dan siang, kisaran angin, turunnya hujan, tidak bercampurnya air tawar dan air asin, dan terciptanya manusia dari air mani. Tidakkah engkau, wahai rasul, memperhatikan penciptaan tuhanmu, dengan mata kepalamu atau dengan pikiranmu, akan besarnya kekuasaan tuhanmu dan anugerah-Nya yang demikian besar kepada makhluk-Nya, bagaimana dia memanjangkan dan memendekkan bayang-bayang atau keteduhan yaitu situasi antara terang benderang dan gelap, hal itu terjadi setelah terbit fajar sampai terbit matahari, dan waktu setelah matahari terbenam sebelum gelapnya malam. Dan sekiranya dia Allah menghendaki untuk melakukan sebaliknya, niscaya dia jadikannya bayang-bayang dan suasana teduh itu tetap, tidak bergeser dari tempatnya. Jika hal itu terjadi, semua makhluk akan menderita. Jika matahari terus menerus menyoroti bumi, manusia dan makhluk lainnya akan terbakar. Kemudian kami jadikan matahari sebagai petunjuk akan adanya bayang-bayang dan situasi teduh tersebut. Jika tidak ada matahari, tidak akan terjadi bayang-bayang di bumi. Inilah fenomena alam yang harus direnungkan oleh manusia, bahwa dibelakang semua gerakan alam seluruh ada zat yang sangat berkuasa yaitu Allah."
  }
]