[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "45-46. Apakah kamu memperhatikan bagaimana Allah memanjangkan bayangan dari terbitnya fajar hingga terbit matahari? Sekiranya Allah menghendaki, pastilah Dia akan menjadikan bayang-bayang itu bertahan dan tetap ada, tidak lenyapkan oleh (sinar) matahari. Kemudian Kami menjadikan matahari sebagai pertanda dengan keadaan-keadaanya atas keadaan-keadaan bayang-bayang itu. Lalu ia akan mengecil sedikit demi sedikit. Tiap kali bertambah ketinggian matahari, maka ia akan kian berkurang besarnya. Itu termasuk bukti Kuasa Allah dan keagunganNya, dan sesungguhnya Dia-lah yang berhak diibadahi, bukan yang lain."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "46. kemudian Kami menarik bayang-bayang itu agar memendek dengan tarikan yang perlahan-lahan, sedikit demi sedikit, sesuai tingginya matahari."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "46. ثُمَّ قَبَضْنٰهُ إِلَيْنَا (kemudian Kami menarik bayang-bayang itu kepada kami) Apabila apabila matahari mulai meninggi, bayangan itu mulai menyusut dan diganti oleh cahaya matahari. قَبْضًا يَسِيرًا (dengan tarikan yang perlahan-lahan) Yakni menyusut sedikit demi sedikit sesuai dengan posisi matahari."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "46. Kemudian Kami sempitkan bayang-bayang yang memanjang itu secara bertahap menuju arah yang Kami kehendaki sesuai ketinggian matahari. Maknanya yaitu Kami hapus bayangan itu perlahan-lahan sesuai rotasi bumi yang menghadap matahari. Dan kata {Ilaina} itu berhubungan dengan penghapusan bayang-bayang sesuai kehendak Allah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kemudian Kami menariknya} Kami bayang-bayang yang dipanjangkan itu {kepada Kami perlahan} sedikit demi sedikit"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "45-46 maksudnya, tidaklah kamu menyaksikan dengan pandangan mata dan pandangan mata hatimu kesempurnaan kekuasaan Rabbmu dan keluasan rahmatNya, yaitu bahwasannya Dia telah memanjangkan bayang-bayang mengikuti manusia. Yaitu sebelum matahari terbit, “kemudian kami jadikan matahari atasnya,” maksudnya, atas bayang-bayang itu, ”sebagai petunjuk,” kalau saja bukan karena adanya matahari, tentu bayang-bayang tidak diketahui. Sebab lawan itu hanya dapat diketahui dengan lawannya pula. “kemudian kami menarik bayang-bayang itu kepada Kami dengan tarikan yang perlahan-lahan,” semakin tinggi matahari, semakin hilangnya bayang-bayang itu sedikit demi sedikit hingga akhirnya habis secara total. Sehingga bayang-bayang dan matahari saling bergantian menerpa manusia, yang mereka saksikan dengan mata kepala mereka. Perbedaan siang dan malam yang menjadi akibatnya, lalu silih bergantinya siang dan malam, perubahan musim, serta terjadinya berbagai kemaslahatan yang disebabkannya adalah merupakan dalil yang kuat yang membuktikan kekuasaan Allah dan keagunganNya, kesempurnaan rahmatNya, perhatianNya terhadap hamba-hambaNya, dan bahwa hanya Dia semata sembahan yang dipuji, dicintai, diagungkan, pemilik keagungan dan kemuliaan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Furqan ayat 46: Maksudnya, bayang-bayang itu Allah hapuskan dengan perlahan-lahan sesuai dengan naiknya matahari sedikit demi sedikit sehingga hilang secara keseluruhan.Yang demikian terdapat dalil sempurnanya kekuasaan Allah dan keagungan-Nya, sempurnanya rahmat dan perhatian-Nya kepada hamba-hamba-Nya, dan bahwa Dia saja yang satu-satunya berhak disembah lagi berhak mendapat seluruh pujian, yang berhak dicintai dan diagungkan, Pemilik kebesaran dan kemuliaan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Furqan Ayat 46",
    "description": "Lalu Allah menjelaskan fenomena alam berikutnya yaitu: kemudian kami menariknya bayang-bayang itu, kepada kami sesuai dengan kebijakan kami, sedikit demi sedikit, tidak sekaligus sesuai dengan kecepatan gerakan matahari yang demikian cermat dan terukur. Suasana teduh di pagi hari digantikan oleh terangnya cahaya matahari. Kemudian pada saat sore hari, diwaktu matahari bergerak ke ufuk barat, sedikit demi sedikit, sorot matahari digantikan oleh suasana redup dan teduh kembali dalam rentang waktu yang sangat pendek, sampai datang waktu malam yang gelap gulita. 47. Dan dialah yang menjadikan malam yang gelap gulita untukmu wahai sekalian manusia, sebagai pakaian yang sama-sama menutupi badanmu, dan dia menjadikan tidur untuk istirahat mu dari semua kegiatan, agar jika kamu bangun di pagi hari, badanmu kembali segar bugar. Dan dia juga menjadikan siang terang benderang untuk bangkit berusaha mencari rezeki buat kehidupanmu dan keluargamu. Terciptanya siang dan malam karena perputaran bumi mengitari matahari, demikian pula matahari yang terus berputar dan berjalan pada garis edarnya. Semua keajaiban alam seluruh ini tidak ada yang sanggup melakukannya kecuali Allah."
  }
]