[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Allah, Dia-lah yang menjadikan malam sebagai penutup bagi kalian dengan kegelapannya, sebagaimana pakaian menutupi kalian. Dan Dia menjadikan tidur sebagai istirahat bagi tubuh-tubuh kalian, dalam tidur itu kalian bisa menjadi tenang dan tentram. dan menjadikan siang bagi kalian untuk bertebaran di muka bumi dan mencari penghidupan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "47. Dia lah Allah yang menjadikan waktu malam untuk kalian seperti halnya pakaian yang menutupi kalian dan menutupi berbagai hal, Dia lah yang menjadikan tidur untuk kalian sebagai waktu istirahat dari berbagai kesibukan, dan Dia pula lah yang menjadikan siang bagi kalian sebagai waktu untuk berangkat kerja."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "47-49. Allah yang telah menciptakan bagi kalian malam seperti pakaian yang menutupi kalian dengan kegelapannya, dan menjadikan tidur sebagai istirahat bagi badan, serta menjadikan siang sebagai waktu manusia menyebar untuk mencari penghidupan. Dan Allah yang mengirim angin kepada kalian sebagai tanda turunnya hujan dan rahmat dari-Nya. Kami menurunkan dari awan air yang suci dan menyucikan, dan dengan air itu Kami menghidupkan tanah yang tandus dan sebagai minuman bagi hewan dan manusia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "47. وَهُوَ الَّذِى جَعَلَ لَكُمُ الَّيْلَ لِبَاسًا (Dialah yang menjadikan untukmu malam (sebagai) pakaian) Yakni malam menutupi segala sesuatu. وَالنَّوْمَ سُبَاتًا(dan tidur untuk istirahat) Karena kalian ketika itu berhenti dari kesibukan dan menyempurnakan istirahat. وَجَعَلَ النَّهَارَ نُشُورًا (dan Dia menjadikan siang untuk bangun berusaha) Allah menyerupakan bangun tidur dengan kebangkitan setelah mati dan menyerupakan tidur dengan kematian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "47. Allah adalah Dzat yang menciptakan untuk kalian malam sebagai penutup segala sesuatu dengan kegelapannya, dan untuk tidur sebagai waktu jeda pekerjaan kalian dan waktu istirahat tubuh kalian. Dia juga menciptakan siang sebagai waktu bangkit supaya manusia bisa bertebaran di dalamnya untuk bekerja dan mencari rejeki. Istilah “As-Subaat” digunakan karena tidur itu menyerupai mati. Dan istilah “An-Nusyur” digunakan karena bangun tidur itu menyerupai hidup."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dialah Dzat yang menjadikan untuk kalian malam (sebagai) pakaian} penutup dengan kegelapannya {dan (waktu) tidur untuk istirahat} istirahat untuk badan, dan waktu berhenti untuk bergerak {Dia menjadikan siang untuk bangkit} waktu untuk bangkit dan berusaha mencari rezeki"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "47 maksudnya, diantara rahmatNya terhadap kalian dan kelembutanNya adalah Dia menjadikan malam untuk kalian laksana pakaian yang menutupi kalian hingga kalian dapat beristirahat di dalamnya dan merasa hangat dengan tidur serta mobilitas kalian menjadi terhenti, maksudnya, gerakan kalian terhenti saat tidur. Kalau saja tidak ada malam, niscaya manusia tidak akan bisa tenang, dan niscaya mereka terus dalam aktivitasnya, lalu pada akhirnya hal itu sangat membahayakan mereka. Dan kalu terjadi malam terus, tanpa berhenti, maka kehidupan dan berbagai kepentingan mereka terabaikan. Akan tetapi Allah menjadikan siang hari sabagai kehidupan kembali, padanya mereka dapat bertebaran untuk perniagaan, bepergian jauh dan pekerjaan mereka, sehingga dengan begitu terciptalah berbagai maslahat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Furqan ayat 47: Jika tidak ada malam tentu manusia tidak dapat merasakan ketenangan dan tentu mereka akan terus berbuat sehingga fisik mereka sakit, dan jika malam terus menerus, tentu mereka akan kesulitan mencari penghidupan, oleh karenanya karena rahmat-Nya Dia adakan siang untuk bangkit berusaha, bekerja, dll. sehingga banyak maslahat yang dapat tegak."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Furqan Ayat 47",
    "description": "Dan dialah yang menjadikan malam yang gelap gulita untukmu wahai sekalian manusia, sebagai pakaian yang sama-sama menutupi badanmu, dan dia menjadikan tidur untuk istirahat mu dari semua kegiatan, agar jika kamu bangun di pagi hari, badanmu kembali segar bugar. Dan dia juga menjadikan siang terang benderang untuk bangkit berusaha mencari rezeki buat kehidupanmu dan keluargamu. Terciptanya siang dan malam karena perputaran bumi mengitari matahari, demikian pula matahari yang terus berputar dan berjalan pada garis edarnya. Semua keajaiban alam seluruh ini tidak ada yang sanggup melakukannya kecuali Allah. 48. Dan dialah Allah yang memerintahkan para malaikat-Nya untuk meniupkan angin menggiring awan dari berbagai penjuru, sebagai pembawa kabar gembira bagi segenap manusia sebelum kedatangan rahmat-Nya berupa hujan sebagai kasih sayang kepada makhluk-Nya, dan kami turunkan dari langit yang sudah dipenuhi uap air, air yang sangat bersih, yang bisa dipergunakan untuk berbagai macam keperluan hidup."
  }
]