[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan mereka berkata tentang al-Qur’an, “Ia adalah kisah-kisah dongeng orang-orang terdahulu yang tercatat di buku-buku mereka. Muhammad meminta disalinkan, maka dibacakan kepadanya tiap pagi dan sore hari.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Dan orang-orang yang mendustakan Al-Qur`ān itu berkata, \"Al-Qur`ān hanyalah dongeng-dongeng batil orang-orang dahulu, yang diminta oleh Muhammad supaya dituliskan, dan dongeng itu dibacakan kepadanya setiap pagi dan petang\"."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. وَقَالُوٓا۟ أَسٰطِيرُ الْأَوَّلِينَ (Dan mereka berkata: “Dongengan-dongengan orang-orang dahulu) Yakni mereka mengatakan al-Qur’an ini adalah cerita dan dongeng yang dikisahkan oleh orang-orang terdahulu. اكْتَتَبَهَا(dimintanya supaya dituliskan) Yakni ia meminta orang lain untuk menulisnya. Atau ia menulisnya sendiri. فَهِىَ تُمْلَىٰ عَلَيْهِ(maka dibacakanlah dongengan itu kepadanya) Yakni dongeng-dongeng itu dibacakan kepadanya setelah dituliskan agar ia dapat menghafalnya lewat bacaan orang-orang yang telah membantunya untuk membaca sebab ia adalah seorang ummi yang tidak dapat membaca tulisan itu. بُكْرَةً وَأَصِيلًا(setiap pagi dan petang) Seakan-akan mereka mengatakan orang-orang itu mengajari Muhammad pada pagi dan sore hari. Pendapat lain mengatakan yang dimaksud adalah di setiap waktu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Mereka juga berkata: “Al-Qur’an ini adalah kebohongan-kebohongan orang-orang terdahulu yang mereka tulis, yang diminta untuk menulisnya dan dibacakan untuknya supaya dia (Muhammad) bisa menghafalnya, karena sesungguhnya dia itu seorang buta huruf yang tidak bisa membacanya. Kebohongan-kebohongan itu dibacakan untuknya pagi dan sore, atau terus-menerus”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka berkata,“Dongeng-dongeng} perkataan-perkataan dan hal-hal palsu {orang-orang dahulu yang diminta untuk dituliskan} yang diminta untuk dinasakh untuk dirinya {Lalu dibacakanlah dongeng itu kepadanya} dibacakan kepadanya agar dia bisa menghafalnya {setiap pagi dan petang”} permulaan dan akhir siang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5 diantara bagian drai perkataan mereka berkenaan dengan hal diatas adalah, mereka mengatakan, ’yang dibawa oleh Muhammad ini adalah “dongengan-dongengan orang-orang dahulu, dimintanya supaya dituliskan,” maksudnya, ini adalah cerita orang-orang dahulu dan dongeng mereka yang diterima dari mulut ke mulut dan dituturkan oleh setiap orang, lalu Muhammad minta supaya disalin; “maka dongengan itu dibacakanlah kepadanya setiap pagi dan petang,” perkataan mereka ini mencakup sejumlah dosa besar, yaitu:  Tuduhan mereka terhadap Rasulullah (yang merupakan manusia paling mulia lagi jujur di tengah-tengah mereka), dengan tuduhan dusta dan kebohongan besar.  Pemberitaan yang mereka lakukan tentang al-qur’an yang merupakan perkatan yang paling benar, paling agung lagi paling mulia ini, bahwasannya al-qur’an adalah kedustaan dan kebohongan.  Sesungguhnya dalam perkataan mereka tersirat ungkapan bahwa mereka mampu mendatangkan (perkataan) yang semisal al-qur’an, dan bahwa makhluk yang sangat lemah dari segala sisinya mampu menyaingi Allah, Sang Pencipta nan Mahasempurna dari seluruh sisi, dengan salah satu sifatNya, yaitu kalam.  Sesungguhnya jati diri Rasulullah telah diketahui, dan mereka sangat mengetahui akan hal itu, yaitu bhawa dia tidak bisa menulis dan tidak pernah berkumpul dengan orang yang akan menuliskan untuknya, namun mereka telah mengklaim hal itu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Furqan ayat 5: Yang disampaikan dari mulut ke mulut dan disalin oleh Beliau. Agar Beliau hapal. Dalam ucapan mereka ini terdapat kesalahan besar dan menunjukkan kedustaan mereka: - Tuduhan mereka kepada Rasulullah shallallahu 'alaihi wa sallam manusia yang paling baik dan paling jujur lisannya dengan tuduhan berdusta. - Perkataan mereka, bahwa Al Qur’an adalah dusta dan buatan Nabi Muhammad shallallahu 'alaihi wa sallam. - Perkataan mereka itu sesungguhnya menunjukkan bahwa mereka mengaku mampu mendatangkan yang seperti Al Qur’an dan menyamakan antara ucapan makhluk yang memiliki kekurangan dari berbagai sisi dengan Al Khaaliq yang Mahasempurna dari berbagai sisi. - Kedaaan Rasulullah shallallahu 'alaihi wa sallam telah mereka ketahui, yaitu bahwa Beliau tidak sanggup menulis."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Furqan Ayat 5",
    "description": "Dan mereka juga berkata, 'Al-Qur'an itu hanya dongeng-dongeng orang-orang terdahulu, yang diminta agar dituliskan secara sungguh-sungguh, lalu dibacakanlah dongeng itu kepada nabi Muhammad setiap pagi dan petang, yakni secara terus-menerus. 6. Mengajari nabi Muhammad untuk menjawab tuduhan kaum kafir itu, Allah berfirman, 'katakanlah, wahai nabi Muhammad, kepada mereka bahwa Al-Qur'an itu diturunkan oleh Allah yang mengetahui segala rahasia di langit dan di bumi. \" sungguh, dia maha pengampun, maha penyayang, sehingga dia menunda turunnya azab kepada manusia yang durhaka."
  }
]