[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sungguh Kami telah menurunkan hujan pada suatu tempat tertentu dan tidak pada tempat yang lain, agar orang-orang yang Kami turunkan kepada mereka hujan tersebut mengingat-ingat nikmat Allah atas mereka, lalu mereka bersyukur kepada Nya dan orang-orang yang tidak mendapatkan guyurannya mengingat-ingat apa yang tidak diturunkan pada mereka, lalu bersegera untuk bertaubat kepada Allah supaya kemudian Dia merahmati mereka dan menurunkan hujan bagi mereka. Namun, kebanyakan manusia menolak kecuali sikap pengingkaran terhadap nikmat-nikmat Kami yang tercurahkan kepada mereka, sebagaiman perkataan mereka, “Kami dicurahi hujan karena rasi bintang anu dan anu.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "50. Dan sesungguhnya Kami telah menjelaskan dan menyebutkan berbagai jenis hujah dan dalil dalam Al-Qur`ān supaya mereka mengambil pelajaran darinya; namun kebanyakan manusia tidak mau kecuali kafir dan mengingkari kebenaran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "50. Sungguh Kami telah membagi turunnya hujan di antara manusia, agar mereka mengambil pelajaran dari kekuasaan Allah menghidupkan bumi yang mati bahwa Dia berkuasa untuk menghidupkan orang yang telah mati, dan agar mereka mensyukuri segala kenikmatan dari-Nya. akan tetapi mayoritas manusia mengingkari kenikmatan-kenikmatan itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "50. وَلَقَدْ صَرَّفْنٰهُ بَيْنَهُمْ لِيَذَّكَّرُوا۟ (Dan sesungguhnya Kami telah mempergilirkan hujan itu diantara manusia supaya mereka mengambil pelajaran) Kami ulangi berkali-kali dalam al-Qur’an penyebutan bayangan-bayangan, penciptaan awan, penurunan air hujan agar kalian berfikir dan mengambil pelajaran. Pendapat lain mengatakan maknanya adalah Kami pergilirkan penurunan air hujan bagi kalian di negeri yang berbeda-beda, di sebagian negeri Kami perbanyak turunnya hujan dan di sebagian negeri lainnya Kami kurangi agar mereka mengambil pelajaran dari hal itu. فَأَبَىٰٓ أَكْثَرُ النَّاسِ إِلَّا كُفُورًا(maka kebanyakan manusia itu tidak mau kecuali mengingkari (nikmat)) Yakni mereka menolak untuk mengakui kenikmatan yang Allah berikan kepada mereka berupa turunnya air hujan sehingga mereka tidak bersyukur kepada-Nya; bahkan mereka menganggap kenikmatan itu dari berhala-berhala dan bintang-bintang, mereka mengatakan “hujan ini diturunkan kepada kami karena bintang ini” dan mereka tidak mengatakan “hujan ini diturunkan kepada kami karena karunia dan rahmat Allah.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "50. Dan sungguh Kami bagikan hujan ke sejumlah tempat dan waktu yang berbeda dengan kuantitas yang berbeda di antara makhluk bumi supaya mereka mengingat Allah, lalu bersyukur dan mengambil pelajaran dalam hal itu. Namun kebanyakan manusia tidak mau melakukannya, kecuali malah menyangkal nikmat itu dan kurang mempedulikannya. Bangsa Arab menghubungkan turunnya hujan dengan jatuhnya bintang di arah barat yang disertai dengan munculnya fajar di arah timur setiap 13 hari"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh Kami telah membuat hujan itu bergilir di antara mereka} Kami membagi hujan itu di antara mereka, sekali di negeri ini, dan sekali di negeri lain {agar mereka mengambil pelajaran} agar mereka berpikir dan mengambil pelajaran {Namun kebanyakan manusia enggan, melainkan mereka mengingkarinya} menyangkal"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "50 setelah Allah menjelaskan ayat-ayat yang nampak dan kasat mata ini, dan mencurahkannya kepada manusia agar mereka mengenalNya, bersyukur (berterima kasih) kepadaNya dan selalu mengingatNya; namun demikian “kebanyakan manusia itu tidak mau kecuali mengingkari,” (nikmat Allah tersebut) karena akhlak dan tabiat mereka telah rusak."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Furqan ayat 50: Setelah Allah Subhaanahu wa Ta'aala menyebutkan nikmat-nikmat-Nya kepada manusia agar manusia mengenalinya, bersyukur dan mengingat-Nya, namun kenyataannya manusia enggan bersyukur karena sudah rusaknya akhlak dan tabi’at mereka. Bisa juga diartikan, “Agar mereka mengingat nikmat Allah.” Mereka tidak mengatakan perkataan yang benar, yaitu, “Kita diberi hujan karena karunia Allah dan rahmat-Nya,” tetapi malah mengatakan, “Kita diberi hujan karena bintang ini dan itu.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Furqan Ayat 50",
    "description": "Dan sungguh, kami telah mempergilirkan hujan itu di antara mereka pada waktu-waktu tertentu, dan di beberapa tempat, sesuai dengan kebijakan kami, agar mereka mengambil pelajaran dari perkisaran tersebut. Tetapi kebanyakan manusia tidak mau bersyukur kepada kami dengan hati, ucapan dan tindakan, bahkan mereka mengingkari nikmat-nikmat kami yang tak terhitung banyaknya. Sifat takabur, sombong, angkuh, menyebabkan mereka lupa atas semua anugerah-Nya itu. 51. Ayat-ayat berikut ini menjelaskan anugerah Allah yang besar kepada nabi Muhammad yang diutus untuk seluruh manusia. Dan sekiranya kami menghendaki, untuk mengutus banyak utusan, niscaya kami utus seorang pemberi peringatan pada setiap negeri. Tapi kebijakan kami pada akhir zaman, adalah mengutus seorang rasul untuk seluruh ne-geri, agar beban nabi Muhammad bertambah, dan dengan begitu akan bertambah derajatnya di sisi Allah."
  }
]