[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "51-52. Seandainya Kami menghendaki, pastilah Kami akan mengutus kepada setiap negeri seorang pemberi peringatan, yang menyeru mereka kepada Allah dan memperingatkan mereka terhadap siksaanNya. Akan tetapi, Kami menjadikanmu (wahai Rasul) diutus kepada seluruh penduduk muka bumi, dan Kami memerintahkanmu untuk menyampaikan al-Qur’an ini kepada mereka. Maka janganlah kamu mengikuti orang-orang kafir untuk meninggalkan sesuatu yang dengannya kamu mengikuti diutus. Bahkan, kerahkan semua dayamu dalam menyampaikan risalah tersebut, dan berjihadlah terhadap orang-orang kafir dengan al-Qur’an ini dengan jihad yang besar, yang tidak tercampuri kelesuan semangat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "51. Andaikata Kami menghendaki, Kami benar-benar utus pada setiap negeri seorang Rasul yang memberi peringatan dan ancaman terhadap mereka dari azab Allah, namun Kami tidak menghendaki hal itu, tetapi Kami telah utus Muhammad -ṣallallāhu 'alaihi wa sallam- sebagai Rasul kepada seluruh umat manusia."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "51-52. Seandainya Kami menghendaki niscaya Kami akan mengutus seorang nabi kepada setiap negeri untuk memberi mereka peringatan, akan tetapi Kami mengutusmu -hai Rasulullah- kepada seluruh manusia dengan al-Qur’an ini. Maka janganlah kamu menuruti orang-orang kafir dalam setiap perkara yang menyelisihi risalahmu, dan berjihadlah melawan mereka dengan al-Qur’an dengan jihad yang kuat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "51. وَلَوْ شِئْنَا لَبَعَثْنَا فِى كُلِّ قَرْيَةٍ نَّذِيرًا (Dan andaikata Kami menghendaki benar-benarlah Kami utus pada tiap-tiap negeri seorang yang memberi peringatan) Yakni seandainya Kami menghendaki niscaya Kami akan kirim pada tiap-tiap negeri seorang pemberi peringatan yang memperingatkan mereka sebagaimana Kami membagikan kepada mereka air hujan, namun Kami tidak melakukan hal itu dan Kami hanya menjadikan pemberi peringatan seorang saja, yaitu kamu wahai Muhammad."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "51. Jika berkehendak, sungguh Allah akan mengutus rasul di setiap negeri untuk memperingatkan mereka layaknya pembagian hujan di antara mereka, namun Kami mengutusmu sebagai pemberi peringatan secara umum (bagi mereka) wahai Nabi."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Jika berkehendak, niscaya Kami mengutus pada setiap negeri seorang pemberi peringatan} utusan yang memberi peringatan kepada mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "51 Allah mengabarkan tentang terlaksananya kehendakNya, dan kalau saja Dia berkehendak, niscaya Dia utus seorang pemberi peringatan pada tiap negeri. Yakni, seorang rasul yang memberi peringatan kepada mereka dan mewanti-wanti. Jadi, kehendak (masyi’ah) Allah itu tidak terbatas pada hal-hal itu saja. Akan tetapi kebijaksanaanNYa dan rahmatNya kepadamu dan kepada manusia mengharuskanmu, wahai Muhammad untuk mengutusmu kepada seluruh mereka, yang berkulit merah dan hitam, Arab dan bukan Arab, manusia dan jin."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Furqan ayat 51: Allah Subhaanahu wa Ta'aala memberitahukan tentang berlakunya masyi’ah (kehendak)-Nya, dan bahwa jika Dia menghendaki tentu Dia kirim seorang rasul di setiap kota untuk memberi peringatan, akan tetapi hikmah dan rahmat-Nya kepada Nabi Muhammad shallallahu 'alaihi wa sallam dan kepada manusia menghendaki untuk mengutus Beliau kepada semua manusia; baik yang berkulit putih, hitam, coklat maupun yang berkulit merah, baik bangsa Arab maupun selainnya, manusia dan jinnya. Di antara hikmahnya adalah agar pahala Beliau semakin besar."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Furqan Ayat 51",
    "description": "Ayat-ayat berikut ini menjelaskan anugerah Allah yang besar kepada nabi Muhammad yang diutus untuk seluruh manusia. Dan sekiranya kami menghendaki, untuk mengutus banyak utusan, niscaya kami utus seorang pemberi peringatan pada setiap negeri. Tapi kebijakan kami pada akhir zaman, adalah mengutus seorang rasul untuk seluruh ne-geri, agar beban nabi Muhammad bertambah, dan dengan begitu akan bertambah derajatnya di sisi Allah. 52. Betapa pun beratnya beban itu, nabi dilarang untuk tunduk kepada kemauan orang kafir. Maka janganlah engkau, wahai rasul, taati orang-orang kafir akan kemauan mereka, karena mereka berada pada jalur kehidupan yang salah, dan berjuanglah terhadap mereka dengannya yaitu Al-Qur'an, dengan membacanya, menghayatinya, mengamalkannya dan menjelaskan isinya kepada mereka, dengan semangat perjuangan yang besar. Hadapilah mereka dengan ketegasan dengan kesungguhan hati. Bantahlah ucapan-ucapan mereka dengan dalil-dalil yang kuat. Engkau berhadapan dengan manusia yang sangat angkuh. Jangan engkau berhenti dari berjuang di jalan Allah, karena, walaupun hal itu menjadikan kamu lelah, tapi akan menambah derajatmu di sisi tuhanmu dan akan bisa memberikan kemanfaatan yang sangat besar bagi kehidupan di alam seluruh."
  }
]