[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "51-52. Seandainya Kami menghendaki, pastilah Kami akan mengutus kepada setiap negeri seorang pemberi peringatan, yang menyeru mereka kepada Allah dan memperingatkan mereka terhadap siksaanNya. Akan tetapi, Kami menjadikanmu (wahai Rasul) diutus kepada seluruh penduduk muka bumi, dan Kami memerintahkanmu untuk menyampaikan al-Qur’an ini kepada mereka. Maka janganlah kamu mengikuti orang-orang kafir untuk meninggalkan sesuatu yang dengannya kamu mengikuti diutus. Bahkan, kerahkan semua dayamu dalam menyampaikan risalah tersebut, dan berjihadlah terhadap orang-orang kafir dengan al-Qur’an ini dengan jihad yang besar, yang tidak tercampuri kelesuan semangat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "52. Maka janganlah engkau mengikuti orang-orang kafir dalam perkara yang mereka minta dan yang mereka usulkan kepadamu. Berjihadlah terhadap mereka dengan Al-Qur`ān yang diturunkan kepadamu dengan jihad yang besar berupa kesabaran atas gangguan mereka, serta tegar menghadapi kesulitan dalam mendakwahi mereka ke jalan Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "52. فَلَا تُطِعِ الْكٰفِرِينَ (Maka janganlah kamu mengikuti orang-orang kafir) Namun bersungguh-sungguhlah dalam menyampaikan risalah dan tetaplah beristiqamah di atasnya. وَجٰهِدْهُم بِهِۦ جِهَادًا كَبِيرًا(dan berjihadlah terhadap mereka dengan Al Quran dengan jihad yang besar) Dan bacakanlah kepada mereka ayat-ayatnya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Ayat ini terdapat pada surah Al-Furqan, yang merupakan surah Makkiyyah, yang pada zaman di turunkannya belum ada syari'at Jihad dengan pedang. Hal ini menunjukkan bahwa menuntut ilmu juga bagian dari jihad di jalan Allah; karena dengannya islam akan kuat sebagamana juga dengan jihad islam akan semakin kuat, maka ketahuilah bahwasanya kekuatan islam itu ada pada ilmu dan jihad. 2 ). Kepada mereka yang mencari-cari medan jihad, inilah medan yang tidak terhenti pada jihad peperangan saja ibadah tersebut selama di bumi ini masih ada haq dan bathil, ia adalah jihad melawan ahli bathil dengan Al-Qur'an. 3 ). Hakikat jihad tidak hanya dengan badan dan harta saja, namun sebenarnya jihad dengan lisan adalah diantara jihad yang agung, Allah berfirman : { وَجَٰهِدْهُم بِهِۦ جِهَادًا كَبِيرًا } \"dan berjihadlah terhadap mereka dengan Al Quran dengan jihad yang besar.\" yakni : perangilah orang-orang musyrik dengan Al-Qur'an."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "52. Bersungguh-sungguhlah dalam dakwahmu dan jangan taati hawa nafsu dan kepalsuan-kepalsuan orang-orang kafir. Berjihadlah dengan jihad yang besar terhadap mereka menggunakan Al-Qur’an, karena sesungguhnya jihad menggunakan hujjah dan bukti-bukti kebenaran itu lebih besar daripada berjihad menggunakan pedang."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka janganlah menaati orang-orang kafir dan berjihadlah menghadapi mereka dengannya} dengan Al-Qur’an {dengan jihad yang besar} yang besar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "52 “maka janganlah kamu mengikuti orang-orang kafir,” di dalam mengabaikan sedikitpun dari ajaran yang dengannya kamu diutus, bahkan kerahkanlah segenap kemampuanmu dalam rangka menyampaikan ajaran yang karenanya kamu diutus, “dan berjihadlah kepada mereka,” dengan al-qur’an, “dengan jihad yang besar.” Maksudnya, jangan engkau sisakan dari kemampuanmu dalam membela kebenaran dan memendamkan kebatilan, melainkan engkau telah mengerahkannya sekalipun kamu melihat bagaimanapun pendustaan dan kelancangan mereka. Maka kerahkanlah kemampuanmu dan curahkanlah segenap tenagamu, dan jangan berputus asa untuk memberi mereka petunjuk, dan janganlah kamu meninggalkan tugas menyampaikan risalah kepada mereka karena hawa nafsu mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Furqan ayat 52: Agar engkau meninggalkan tugasmu, bahkan berjihadlah melawan mereka dengan ilmu (Al Qur’an). Jika engkau melihat di antara mereka bersikap mendustakan dan berani terhadapmu, maka kerahkanlah kemampuanmu dan tidak berputus asa menunjuki mereka serta tidak meninggalkan dakwah karena keinginan mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Furqan Ayat 52",
    "description": "Betapa pun beratnya beban itu, nabi dilarang untuk tunduk kepada kemauan orang kafir. Maka janganlah engkau, wahai rasul, taati orang-orang kafir akan kemauan mereka, karena mereka berada pada jalur kehidupan yang salah, dan berjuanglah terhadap mereka dengannya yaitu Al-Qur'an, dengan membacanya, menghayatinya, mengamalkannya dan menjelaskan isinya kepada mereka, dengan semangat perjuangan yang besar. Hadapilah mereka dengan ketegasan dengan kesungguhan hati. Bantahlah ucapan-ucapan mereka dengan dalil-dalil yang kuat. Engkau berhadapan dengan manusia yang sangat angkuh. Jangan engkau berhenti dari berjuang di jalan Allah, karena, walaupun hal itu menjadikan kamu lelah, tapi akan menambah derajatmu di sisi tuhanmu dan akan bisa memberikan kemanfaatan yang sangat besar bagi kehidupan di alam seluruh. 53. Kemudian Allah menampilkan kembali kemahakuasa-Nya di alam seluruh agar manusia merenungkannya. Dan dialah yang membiarkan dua laut yaitu air sungai dan laut, mengalir berdampingan; yang ini tawar dan segar enak untuk diminum dan yang lain sangat asin lagi pahit yang sangat berguna bagi hewan-hewan di laut dan kehidupan manusia lainnya. Dan dia jadikan antara keduanya dinding yang demikian lentur dan canggih dan batas yang tidak tembus. Dengan adanya dinding itu kedua air tersebut tidak akan pernah bercampur. Masing-masing masih membawa sifat-sifat dirinya. Inilah fenomena alam yang luar biasa."
  }
]