[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Allah, Dia-lah Yang mencampurkan dua lautan, yang berair tawar lagi segar untuk minuman dan yang berair asin yang sangat pekat, dan menjadikan antara keduanya pembatas yang menghalangi masing-masing dari keduanya untuk merusak yang lain, dan penghalang yang menghambat sampainya salah satu (air) laut itu kepada yang lain."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "53. Dan Dia lah Allah yang mempertemukan antara dua laut yang mengalir berdampingan; Dia mencampurkan antara yang tawar lagi segar dengan yang asin; dan Dia jadikan antara keduanya dinding dan batas yang menghalangi bersatunya dua lautan itu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "53. Dan Allah yang mengalirkan dua laut yang saling bertemu; salah satunya sangat tawar dan yang lain sangat asin. Kami menjadikan di antara keduanya penghalang yang menghalangi keduanya saling bercampur. Masing-masing memiliki arusnya; air yang tawar berada di atas air yang asin."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "53. وَهُوَ الَّذِى مَرَجَ الْبَحْرَيْنِ (Dan Dialah yang membiarkan dua laut yang mengalir (berdampingan)) Yakni Dia yang mengalirkannya dan menimpakan sebagiannya kepada sebagian yang lain. هٰذَا عَذْبٌ فُرَاتٌ(yang ini tawar lagi segar) Makna (الفرات) adalah air yang sangat tawar. وَهٰذَا مِلْحٌ أُجَاجٌ (dan yang lain asin lagi pahit) Yakni sangat pahit. وَجَعَلَ بَيْنَهُمَا بَرْزَخًا (dan Dia jadikan antara keduanya dinding) Makna (البرزخ) adalah penghalang yang Allah jadikan dengan kuasa-Nya untuk memisahkan keduanya agar tidak saling tercampur. وَحِجْرًا مَّحْجُورًا(dan batas yang menghalangi) Yakni pembatas yang menghalangi keduanya tercampur, sehingga air yang tawar tidak menjadi asin atau air yang asin menjadi tawar. Dan mungkin yang dimaksud dengan penghalang itu adalah bahwa air yang menguap dari air laut yang asin adalah air tawar, sedangkan zat garam yang ada di laut tidak ikut naik; kemudian air yang menguap itu diturunkan sebagai air hujan di tempat yang Allah inginkan yang kemudian akan diserap oleh tanaman-tanaman dan diminum hewan-hewan dan manusia serta sebagiannya menjadi sungai-sungai dan mata air."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Berkata Al-Allamah asy-Syanqithi : dan diantara tempat yang terjadi fenomena ini adalah : sungai senegal yang terletak di bagian selatan Kota San Luis, saya pernah mengunjunginya pada tahun 1366 H, saya mandi di sungai senegal satu kalli dan di samudra atlantik juga satu kali, namun saya tidak menemui pertemuan ke dua air itu, tetapi saya diberitahu oleh guide yang dipercaya bahwasanya itu pernah terjadi, suatu ketika salah satu dari mereka duduk mengambil satu gayung air dengan tangannya dan memastikan bahwa air itu rasanya asin dan di sebelahnya tawar, dan keduanya mengalir dalam satu jalur, tidak bercampaur satu sama lainnya, maha suci Allah dan betapa agungNya, dan betapa sempurna penciptaanNya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "53. Allah adalah Dzat yang mengalirkan dua lautan dan menjadikan keduanya mengalir berdampingan tanpa bercampur satu sama lain. Laut ini (laut pertama) tawar (tidak asin) dan sangat segar, sedangkan laut ini (laut kedua) sangat asin. Dan Dia membuat sekat pemisah dan dinding penghalang yang mencegah percampuran antara satu laut dengan yang lainnya. Masing-masing laut itu masih terpisah satu sama lain dan berada dalam arus khusus sesuai ketentuan Allah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dialah Dzat yang mengalirkan} membuat berdampingan {dua laut; yang ini tawar serta segar} sangat segar {dan yang ini sangat asin lagi pahit} sangat asin {dan Dia jadikan antara keduanya dinding} penghalang {dan batas yang tidak ditembus} tabir penghalang yang mencegah salah satunya bercampur dengan yang lain"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "53 maksudnya, “dan Dia-lah,” semata, “yang membiarkan dua laut mengalir.” Keduanya bertemu lautan yang tawar, yaitu sungai-sungai yang bertebaran di muka bumi, dan lautan yang asin, dan Dia menjadikan manfaat masing-masing sebagai kemaslahatan manusia. “dan Dia menjadikan antara keduanya dinding,” yakni, pembatas yang mencegah percampuran yang satu dengan yang lain, sehingga bisa hilanglah fungsi yang diinginkan darinya, “dan batas yang menghalangi,” pembatas yang membentengi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Furqan ayat 53: Ada yang menafsirkan, bahwa laut yang segar dan tidak asin itu adalah sungai yang mengalir ke daratan, air sumur dan mata air. sedangkan laut yang asin lagi pahit adalah laut itu sendiri dan samudera. Allah menjadikannya masing-masing bermanfaat dan bermaslahat bagi manusia. Ada pula yang menafsirkan, bahwa memang ada dua air yang berdampingan, namun tidak menyatu seperti yang disebutkan dalam ayat tersebut karena Allah adakan dinding dan batas sehingga tidak tembus. Hal ini termasuk kekuasaan Allah Subhaanahu wa Ta'aala. Seperti yang terjadi pada sungai Sinegal yang menyatu dengan samudera atlantik di samping kota Sanlois. Syaikh Asy Syinqithi rahimahullah berkata, “Saya pernah berkunjung ke kota Sanlois pada tahun 1363 H. Pernah sekali, saya mandi di sungai Sinegal dan sesekali di lautan itu, namun saya tidak mendatangi tempat bersatunya (kedua air itu), akan tetapi sebagian teman saya yang terpercaya memberitahukan saya, bahwa dia pernah datang ke tempat bersatunya air itu. Ia duduk (di sana), ia ciduk dengan salah satu tangannya air yang rasanya tawar lagi segar dan ia ciduk air yang satunya lagi, ternyata asin lagi pahit, namun salah satunya tidak bercampur dengan yang lain. Maka Mahasuci Allah Jalla wa ‘Alaa alangkah agung dan sempurna kekuasaan-Nya.” Agar tidak menyatu sehingga manfaat yang diharapkan tidak tercapai."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Furqan Ayat 53",
    "description": "Kemudian Allah menampilkan kembali kemahakuasa-Nya di alam seluruh agar manusia merenungkannya. Dan dialah yang membiarkan dua laut yaitu air sungai dan laut, mengalir berdampingan; yang ini tawar dan segar enak untuk diminum dan yang lain sangat asin lagi pahit yang sangat berguna bagi hewan-hewan di laut dan kehidupan manusia lainnya. Dan dia jadikan antara keduanya dinding yang demikian lentur dan canggih dan batas yang tidak tembus. Dengan adanya dinding itu kedua air tersebut tidak akan pernah bercampur. Masing-masing masih membawa sifat-sifat dirinya. Inilah fenomena alam yang luar biasa. 54. Fenomena kekuasaan Allah lainnya adalah terciptanya manusia dari air mani. Dan dia (pula) yang menciptakan manusia dari air mani seorang lelaki yang bercampur dengan indung telur perempuan, lalu setelah melewati masa-masa tertentu dia jadikan manusia itu mempunyai keturunan beranak-pinak dengan cara yang sama. Ada keturunan yang lelaki yang kelak menjadi garis keturunan bagi anak-anaknya dan ada pula keturunan perempuan yang kelak terjadi persemendaan atau mushaharah semua keluarga pihak perempuan menjadi bagian yang tak terpisahkan dengan suaminya dan tuhanmu adalah mahakuasa. Dialah yang menentukan jenis anak-anak yang lahir, apakah lelaki atau perempuan dari air mani tersebut. Allah menjadikan air mani kaum lelaki terdiri dari ratusan juta sel yang mempunyai dua unsur kelelakian dan keperempuanan, yang akan menjadi cikal bakal manusia. Semuanya itu menjadi tanda atas kebesaran Allah."
  }
]