[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Dia-lah Yang menciptakan dari air mani lelaki dan perempuan anak-anak keturunan, yang lelaki dan perempuan. Dari situ, lalu tumbuhlah hubungan kekerabatan melalui nasab dan mushaharah (pernikahan).dan Tuhanmu Mahakuasa untuk menciptakan segala sesuatu yang di kehendakiNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "54. Dan Dia pula yang menciptakan seorang manusia dari air mani laki-laki dan perempuan, lalu Dia jadikan manusia itu memiliki hubungan kekerabatan dan muṣāharah (pernikahan). Dan Tuhanmu -wahai Rasul- Mahakuasa, tidak dilemahkan oleh sesuatupun, dan di antara kekuasaan-Nya adalah penciptaan manusia dari air mani laki-laki dan perempuan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "54. Dan Allah menciptakan Adam dari air yang dicampur dengan tanah, dan menciptakan keturunannya dari air mani laki-laki dan air mani perempuan; dan menjadikan dalam keturunan ini terdapat orangtua, anak, saudara, dan perbesanan dengan kerabat pasangan. Tuhanmu memiliki kekuasaan yang besar untuk menciptakan makhluk sesuai dengan kehendak-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "54. وَهُوَ الَّذِى خَلَقَ مِنَ الْمَآءِ بَشَرًا (Dan Dia (pula) yang menciptakan manusia dari air) Allah menciptakan manusia dari air mani. فَجَعَلَهُۥ نَسَبًا وَصِهْرًا ۗ( lalu dia jadikan manusia itu (punya) keturunan dan perbesanan) Makna (النسب) adalah hubungan kelahiran dan hubungan-hubungan yang terbentuk darinya seperti hubungan dengan ayah, ibu, kekek, anak, saudara, paman dan keturunannya. Adapun makna (الصهر) adalah hubungan antara suami dan keluarga istrinya yang terbentuk dari pernikahan serta hubungan antara istri dan keluarga suamunya, dan juga hubungan antara keluarga suami dan keluarga istri. Kerabat istri disebut dengan (الأختان), sedangkan kerabat suami disebut dengan (الأحماء), dan keduanya termasuk dari perbesanan. وَكَانَ رَبُّكَ قَدِيرًا(dan adalah Tuhanmu Maha Kuasa) Dan termasuk dari kuasa-Nya adalah Allah menciptakan manusia dan membaginya menjadi dua jenis, laki-laki dan perempuan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "54. Dan Allah adalah Dzat yang menciptakan manusia dari air mani, kemudian menjadikannya memiliki keturunan dan keluarga. Nasab adalah hubungan keluarga yang berkembang dari proses kelahiran, seperti hubungan anak, ayah, saudara dan paman. Sedangkan Mushaharah adalah hubungan yang berkembang antara suami dengan keluarga istrinya dan antara istri dengan suaminya. Dan Tuhanmu memiliki kekuasaan penuh atas segala sesuatu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dialah Dzat yang menciptakan manusia dari air} air mani laki-laki dan perempuan {Lalu Dia menjadikannya} lalu Dia menjadikan manusia {memiliki nasab dan hubungan pernikahan} memiliki nasab dan hubungan pernikahan {dan Tuhanmu adalah Dzat Yang Maha kuasa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "54 maksudnya, Dia-lah Allah semata, tiada sekutu bagiNya, yang telah menciptakan manusia dari air hina, kemudian darinya dikembangbiakan anak keturunan yang banyak, dan menjadikan mereka bernasab dan berbesanan, berpisah-pisah dan berkelompok. Dan materi semua itu adalah berasal dari air yang hina. Ini semua menunjukan kesempurnaan kekuasaanNya, karena Allah berfirman, ”dan Rabbmu adalah MahaKuasa,” dan menunjukkan peribadahan kepada Allah adalah benar, sedangkan peribadahan kepada selainNya adalah batil."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Furqan ayat 54: Allah-lah yang menciptakan manusia dari air yang hina (mani), lalu Dia menyebarkan daripadanya keturunan yang banyak, Dia menjadikan mereka berketurunan dan menjalin hubungan kekeluargaan, semua itu berasal dari satu materi, yaitu air yang hina itu. Hal ini menunjukkan sempurnanya kekuasaan Allah Subhaanahu wa Ta'aala dan menunjukkan bahwa beribadah kepada-Nyalah yang hak, sedangkan beribadah kepada selain-Nya adalah batil. Mushaharah artinya hubungan kekeluargaan yang berasal dari perkawinan, seperti menantu, ipar, mertua dan sebagainya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Furqan Ayat 54",
    "description": "Fenomena kekuasaan Allah lainnya adalah terciptanya manusia dari air mani. Dan dia (pula) yang menciptakan manusia dari air mani seorang lelaki yang bercampur dengan indung telur perempuan, lalu setelah melewati masa-masa tertentu dia jadikan manusia itu mempunyai keturunan beranak-pinak dengan cara yang sama. Ada keturunan yang lelaki yang kelak menjadi garis keturunan bagi anak-anaknya dan ada pula keturunan perempuan yang kelak terjadi persemendaan atau mushaharah semua keluarga pihak perempuan menjadi bagian yang tak terpisahkan dengan suaminya dan tuhanmu adalah mahakuasa. Dialah yang menentukan jenis anak-anak yang lahir, apakah lelaki atau perempuan dari air mani tersebut. Allah menjadikan air mani kaum lelaki terdiri dari ratusan juta sel yang mempunyai dua unsur kelelakian dan keperempuanan, yang akan menjadi cikal bakal manusia. Semuanya itu menjadi tanda atas kebesaran Allah. 55. Betapa pun demikian, masih banyak orang-orang yang tak mau menyembah Allah, tapi menyembah sesuatu yang tidak mempunyai kekuasaan apa pun. Dan mereka orang-orang kafir itu menyembah benda-benda selain Allah, baik berupa patung-patung dan lainnya apa yang tidak memberi manfaat kepada mereka baik di dunia, seperti mendatangkan rezeki, menurunkan hujan, dan lain-lainnya, apalagi di akhirat, dan tidak pula mendatangkan bencana kepada mereka jika mereka tidak menyembah patung-patung itu, seperti kematian, kelaparan dan lainnya. Orang-orang kafir adalah penolong bagi setan untuk berbuat durhaka terhadap tuhannya dengan menyekutukan-Nya dalam beribadah. Padahal tuhannya yang telah memberikan kepadanya kehidupan, rezeki, dan anugerah lainnya yang demikian besar. Inilah bentuk kezaliman yang sangat besar."
  }
]