[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kendatipun dikemukakan bukti-bukti Kuasa Allah dan curahan nikmatNya pada makhlukNya, orang-orang kafir menyembah sesembahan selain Allah, obyek yang tidak dapat memberikan manfaat bagi mereka ketika mereka menyembahnya dan tidak dapat mencelakai mereka bila mereka meninggalkan penyembahannya. Dan orang yang ingkar itu menjadi penolong bagi setan untuk menentang TuhanNya dengan perbuatan syirik dalam peribadahan kepada Allah, mendukungnya untuk maksiat kepadaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "55. Dan orang-orang kafir menyembah patung-patung selain Allah, yang tidak memberi manfaat meskipun mereka menaatinya, dan tidak pula memberi mudarat meskipun mereka menentangnya. Orang kafir itu pengikut setan untuk melakukan apa yang mendatangkan kemurkaan Allah -Subḥānahu-."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "55. Orang-orang kafir menyembah selain Allah, berupa berhala-berhala yang tidak dapat memberi manfaat bagi mereka jika mereka menyembahnya dan tidak dapat mendatangkan mudharat kepada mereka jika mereka tidak menyembahnya. Dan orang kafir adalah penolong setan untuk menentang Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "55. وَيَعْبُدُونَ مِن دُونِ اللهِ مَا لَا يَنفَعُهُمْ (Dan mereka menyembah selain Allah apa yang tidak memberi manfaat kepada mereka) Jika mereka menyembahnya. وَلَا يَضُرُّهُمْ ۗ( dan tidak (pula) memberi mudharat kepada mereka) Jika mereka tidak menyembahnya. وَكَانَ الْكَافِرُ عَلَىٰ رَبِّهِۦ ظَهِيرًا(dan orang-orang kafir itu penolong (syaitan untuk berbuat durhaka) terhadap Tuhannya) Yakni mereka mengikuti setan musuh Allah dan membantunya untuk bermaksiat kepada Allah."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ وَكَانَ ٱلْكَافِرُ عَلَىٰ رَبِّهِۦ ظَهِيرًا } \"Adalah orang-orang kafir itu penolong (syaitan untuk berbuat durhaka) terhadap Tuhannya.\" Inilah diantara khitab al-Qur'an yang paling indah maknanya, seorang mukmin senantiasa bersama Allah untuk memusuhi dirinya sendiri, dan hawa nafsunya, dan syaithon dirinya, dan musuh tuhannya, dapat diartikan bahwa seorang mukmin merupakan tentara Allah dan juga wali Allah, sedangkan orang-orang kafir bersama syaithon-syaithonnya dan dirinya memusuhi Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "55. Dan orang-orang kafir itu menyembah kepada selain Allah seperti berhala dan patung yang tidak memberi manfaat saat disembah dan tidak memberi bahaya saat ditinggalkan. Dan mereka membantu setan dalam bermaksiat kepada Allah SWT dengan berbuat syirik dan permusuhan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka menyembah kepada selain Allah sesuatu yang tidak memberikan manfaat dan tidak mendatangkan mudharat kepada mereka. Orang kafir adalah penolong (setan) terhadap Tuhannya} Orang kafir adalah pembantu setan untuk durhaka kepada Tuhannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "55 maksudnya, mereka menyembah patung-patung dan orang-orang mati yang tidak (dapat) membahayakan dan tidak pula memberi manfaat, dan mereka menjadikannya sebagai sekutu-sekutu bagi Maha pemilik manfaat dan bahaya, (pemilik) pemberian dan pencegahan; padahal yang wajib atas mereka adalah agar mereka menjadi orang-orang yang mengikuti petunjuk dan arahan Rabb mereka, serta membela agamaNya, namun mereka menyalahi perintah itu. “orang-orang kafir itu penolong (setan untuk durhaka) terhadap RabbNya.” Jadi kebatilan itu adalah berhala-berhala dan sekutu-sekutunya yang menjadi musuh Allah. Orang kafir menolong dan membelanya melawan Rabbnya, dan ia menjadi musuh bagi Rabbnya dan menentangNya dalam permusuhan dan perang. Dia-lah Allah yang telah menciptakannya, memberinya rizki dan melimpahkan kepadanya berbagai nikmat yang nampak dan yang tidak nampak, sedangkan ia ntidak keluar dari kekuasaan, kerajaan dan gengagmanNya, dan Allah tidak pernah memutus kebaikan dan karuniaNya darinya, sedangkan dia dengan kebodohannya terus melakukan permusuhan dan penentangan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Furqan ayat 55: Jika menyembahnya. Jika meninggalkannya. Itulah patung dan berhala. Yaitu dengan menaatinya. Berhala, patung dan setan sudah jelas batil, namun orang-orang kafir malah membantunya dengan menyembahnya dan menaati setan sehingga sama saja membantunya berbuat durhaka kepada Tuhannya dan menjadikan musuh-Nya, padahal Allah yang telah menciptakan mereka dan memberinya rezeki serta mengaruniakan berbagai nikmat, kebaikan dan ihsan-Nya tidak berhenti diberikan kepada mereka, namun mereka dengan kebodohannya membalasnya dengan sikap kufur dan menentang Tuhan mereka; tidak bersyukur dan tunduk kepada-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Furqan Ayat 55",
    "description": "Betapa pun demikian, masih banyak orang-orang yang tak mau menyembah Allah, tapi menyembah sesuatu yang tidak mempunyai kekuasaan apa pun. Dan mereka orang-orang kafir itu menyembah benda-benda selain Allah, baik berupa patung-patung dan lainnya apa yang tidak memberi manfaat kepada mereka baik di dunia, seperti mendatangkan rezeki, menurunkan hujan, dan lain-lainnya, apalagi di akhirat, dan tidak pula mendatangkan bencana kepada mereka jika mereka tidak menyembah patung-patung itu, seperti kematian, kelaparan dan lainnya. Orang-orang kafir adalah penolong bagi setan untuk berbuat durhaka terhadap tuhannya dengan menyekutukan-Nya dalam beribadah. Padahal tuhannya yang telah memberikan kepadanya kehidupan, rezeki, dan anugerah lainnya yang demikian besar. Inilah bentuk kezaliman yang sangat besar. 56. Dan tidaklah kami mengutus engkau, wahai rasul-ku, melainkan hanya sebagai pembawa kabar gembira bagi mereka yang beriman dan beramal saleh, bahwa mereka akan mendapatkan pahala dan mereka akan masuk surga dan pemberi peringatan kepada mereka yang ingkar terhadap Allah dan rasul-Nya, bahwa mereka akan mendapatkan siksaan dari Allah, mereka akan masuk neraka. Bukan merupakan tugas rasul, memaksa mereka untuk beriman kepada Allah."
  }
]