[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Kami tidaklah mengutusmu (wahai Rasul) kecuali sebagai pembawa kabar gembira bagi kaum Mukminin dengan surga, dan pemberi peringatan terhadap orang-orang kafir dengan neraka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "56. Dan tidaklah Kami mengutus engkau -wahai Rasul- melainkan sebagai pembawa kabar gembira bagi orang-orang yang taat kepada Allah dengan beriman dan beramal saleh, dan pemberi peringatan kepada orang-orang yang bermaksiat kepada-Nya dengan melakukan kekafiran dan maksiat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "56-57. Hai Rasulullah, Kami tidak mengutusmu melainkan sebagai pemberi kabar gembira bagi orang-orang beriman berupa surga dan pemberi peringatan bagi orang-orang kafir berupa neraka. Dan katakanlah kepada orang-orang kafir: “Aku tidak meminta upah dari kalian atas risalah yang aku sampaikan, dan barangsiapa yang ingin mendapat petunjuk dan memilih jalan yang benar maka hendaklah dia melakukannya.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "56. Wahai Nabi, Kami tidak mengutusmu kecuali sebagai pembawa kabar gembira tentang surga bagi orang yang menaatimu dan pemberi peringatan tentang neraka kepada orang yang bermaksiat kepadamu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kami tidak mengutusmu kecuali sebagai pembawa kabar gembira dan pemberi peringatan} pemberi peringatan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "56 Allah memberitakan bahwasanya Dia tidaklah mengutus Muhammad sebagai penguasa atas manusia, dan tidak pula menjadikannya sebagai raja, dan tidak pula ia mempunyai perbendaharaan segala sesuaatu; melainkan Dia mengutusnya sebagai “pembawa berita gembira,” yang menyampaikan kegembiraan kepada siapa saja yang taat kepada Allah dengan balasan pahala di dunia dan akhirat. “dan sebagai pemberi peringatan,” mengingatkan siapa saja yang durhaka terhadap Allah akan ditimpa siksaan di dunia dan akhirat. Dan yang demikian itu mengharuskan untuk menjelaskan apa yang dengannya menjadi berita gembira, dan tercapainya peringatan, berupa perintah dan larangan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Furqan ayat 56: Allah Subhaanahu wa Ta'aala memberitahukan bahwa Dia tidaklah mengutus Rasul-Nya Muhammad shallallahu 'alaihi wa sallam untuk berkuasa terhadap manusia, dan tidak menjadikannya malaikat serta tidak menjadikannya memiliki harta kekayaan yang banyak, akan tetapi Dia mengutus sebagai pemberi kabar gembir bagi orang yang taat dengan pahala Allah di dunia dan akhirat, serta pemberi peringatan kepada orang yang durhaka kepada Allah dengan hukuman segera atau lambat, dan hal ini menghendaki Beliau untuk menerangkan perbuatan yang dapat mendatangkan kabar gembira berupa perintah-perintah agama, dan menerangkan perbuatan yang mendatangkan ancaman berupa larangan. Dengan surga. Terhadap neraka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Furqan Ayat 56",
    "description": "Dan tidaklah kami mengutus engkau, wahai rasul-ku, melainkan hanya sebagai pembawa kabar gembira bagi mereka yang beriman dan beramal saleh, bahwa mereka akan mendapatkan pahala dan mereka akan masuk surga dan pemberi peringatan kepada mereka yang ingkar terhadap Allah dan rasul-Nya, bahwa mereka akan mendapatkan siksaan dari Allah, mereka akan masuk neraka. Bukan merupakan tugas rasul, memaksa mereka untuk beriman kepada Allah. 57. Allah kemudian memberikan arahan kepada nabi-Nya. Katakanlah, wahai rasul-ku kepada orang-orang kafir itu: 'aku tidak meminta imbalan apa pun dari kamu baik berupa materi atau manfaat lainnya, dalam menyampaikan risalah itu, melainkan mengharap agar orang-orang mau mengambil jalan kepada tuhannya dengan berinfak pada jalan Allah dan amalan saleh lainnya. Jika mereka mau melakukan hal itu, lakukanlah. \" keimanan dan amal saleh mereka, sudah cukup bagi rasul sebagai imbalan atas tugasnya sebagai seorang rasul."
  }
]