[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah kepada mereka, “Aku tidak meminta bayaran apa pun dari kalian atas penyampaian risalah ini. Akan tetapi, siapa saja yang berharap memperoleh hidayah, berjalan di atas jalan kebenaran menuju Tuhannya dan berinfak untuk mencari ridhaNya, maka aku tidak memaksa mereka untuk itu, akan tetapi itu merupakan kebaikan bagi diri kalian sendiri.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "57. Katakanlah -wahai Rasul-, \"Aku tidak meminta upah sedikitpun kepada kalian dalam menyampaikan risalah ini, kecuali bila di antara kalian ada orang-orang yang mau menempuh jalan menuju rida Allah dengan cara berinfak, maka hendaknya ia melakukannya.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "57. قُلْ مَآ أَسْـَٔلُكُمْ عَلَيْهِ مِنْ أَجْرٍ (Katakanlah: “Aku tidak meminta upah sedikitpun kepada kamu dalam menyampaikan risalah itu) Hai Muhammad, katakanlah kepada mereka, aku tidak memintamu upah dalam membacakan al-Qur’an atau dalam menyampaikan risalah. إِلَّا مَن شَآءَ أَن يَتَّخِذَ إِلَىٰ رَبِّهِۦ سَبِيلًا(melainkan (mengharapkan kepatuhan) orang-orang yang mau mengambil jalan kepada Tuhan nya) Yakni barangsiapa yang hendak mengambil jalan kepada Tuhannya maka hendaklah ia melakukannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "57. Wahai Nabi, katakanlah kepada mereka: “Aku tidak mencari upah dari kalian atas penyampaian Al-Qur’an dan risalah Allah, namun barangsiapa yang ingin mengambil jalan Tuhannya agar mendapatkan ridhaNya, maka sebaiknya kerjakanlah (perintah Allah)”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Katakanlah,“Aku tidak meminta kalian imbalan atas hal ini} atas penyampaian wahyu ini {kecuali agar orang mau mengambil jalan kepada Tuhannya”} tetapi agar orang mau mengambil jalan yang mendekatkannya kepada Allah dengan berinfak di jalanNya, maka hendaklah dia melakukannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "57 sesungguhnya engkau wahai Muhammad, jangan meminta upah kepada mereka dalam menyampaikan al-qur’an dan hidayah, agar hal itu tidak menghalangi mereka untuk mengikutimu dan mereka merasa terbebani dengan hutang, ”melainkan (mengharapkan kepatuhan) orang-orang yang mau mengambil jalan kepada Rabbnya,” maksudnya melainkan (mengharapkan kepatuhan) orang yang mau memberikan suatu infak dalam mencari keridhaan Rabb dan jalanNYa. Yang demikian ini, sekalipun aku menyarankan kalian, namun aku tidak memaksa kalian untuk itu. Dan bukan juga upah untukku menjadi kewajiban atas kalian. Sebenarnya itu semua kembali kepada kemaslahatan kalian dan upaya kalian untuk menempuh jalan yanag dapat mengantarkan kalian kepada Rabb kalian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Furqan ayat 57: Sehingga tidak ada alasan bagi mereka untuk tidak mengikutinya, karena Beliau tidak meminta upah. Seperti dengan menginfakkan hartanya untuk mencari keridhaan-Nya jika mereka mau, dan Beliau tidak akan mencegahnya. Beliau tidak memaksa mereka untuknya dan tidak pula menanggung mereka mengupah Beliau, bahkan semua itu maslahatnya kembali kepada mereka dan dapat menyampaikan mereka kepada Tuhan mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Furqan Ayat 57",
    "description": "Allah kemudian memberikan arahan kepada nabi-Nya. Katakanlah, wahai rasul-ku kepada orang-orang kafir itu: 'aku tidak meminta imbalan apa pun dari kamu baik berupa materi atau manfaat lainnya, dalam menyampaikan risalah itu, melainkan mengharap agar orang-orang mau mengambil jalan kepada tuhannya dengan berinfak pada jalan Allah dan amalan saleh lainnya. Jika mereka mau melakukan hal itu, lakukanlah. \" keimanan dan amal saleh mereka, sudah cukup bagi rasul sebagai imbalan atas tugasnya sebagai seorang rasul. 58. Wahai rasul-ku, teruskan dakwahmu dan bertawakAllah dengan menyerahkan segala keputusan akhir kepada Allah yang mahahidup, yang tidak mati, jangan kepada yang selain-Nya! dan bertasbihlah dengan menjauhkan-Nya dari semua sifat kekurangan dan memuji-Nya karena hanya dialah yang berhak dipuji, karena kesempurnaan zat-Nya dan sifatnya. Dan jika ada hamba-Nya yang berbuat dosa, maka cukuplah dia yang maha mengetahui dosa hamba-hamba-Nya."
  }
]