[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan bertawakallah kepada Allah, Yang berkumpul padanya segala makna kehidupan yang sesuai dengan keagunganNya, yang tidak mati, dan sucikanlah Dia dari sifat-sifat kekurangan. Dan cukuplah Allah Mengetahui dosa-dosa makhlukNya. Tidak ada sesuatu pun dari dosa-dosa itu yang tersembunyi bagiNya, dan Dia akan memperhitungkan kalian dan memberi balasan bagi kalian karenanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "58. Dan bertawakallah -wahai Rasul- dalam segala urusanmu kepada Allah yang Maha Hidup, Mahakekal Yang tidak mati selamanya, dan bertasbihlah dengan memuji-Nya. Dan cukuplah Dia Maha Mengetahui dosa-dosa para hamba-Nya, tiada satu dosapun yang tersembunyi bagi-Nya, dan Dia pasti akan memberikan mereka balasan atasnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "58-59. Sandarkanlah urusanmu kepada Allah Yang Maha Hidup yang memiliki seluruh hakikat kehidupan yang sempurna dan tidak akan mati; sucikanlah Dia dari segala kekurangan, dan pujilah Dia atas segala kenikmatan dari-Nya. Allah Maha Mengetahui seluruh dosa hamba-hamba-Nya. Dia yang menciptakan tujuh langit dan bumi dan apa yang di antara keduanya selama tujuh hari, kemudian Dia bersemayam di atas arsy yang merupakan makhluk yang paling besar dengan persemayaman yang sesuai dengan kebesaran dan keagungan-Nya. Dia Maha Pengasih kepada hamba-hamba-Nya. Dan tanyakanlah tentang siapa yang mengetahui segala sesuatu, kepada orang yang mengetahui sifat-sifat yang layak bagi-Nya, dan tidak ada manusia yang lebih mengetahui daripada Nabi Muhammad."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "58. وَتَوَكَّلْ عَلَى الْحَىِّ الَّذِى لَا يَمُوتُ (Dan bertawakkallah kepada Allah yang hidup (kekal) Yang tidak mati) الحي adalah sebagai Dzat untuk bersandar dalam mengharap segala kebaikan yang tidak ada Dzat yang hidup kekal kecuali Dia. وَسَبِّحْ بِحَمْدِهِۦ ۚ( dan bertasbihlah dengan memuji-Nya) Yakni sucikanlah Dia dari segala kekurangan. وَكَفَىٰ بِهِۦ بِذُنُوبِ عِبَادِهِۦ خَبِيرًا(Dan cukuplah Dia Maha Mengetahui dosa-dosa hamba-hamba-Nya) Dia-lah yang Maha Mengetahui segala urusan, tidak ada yang tersembunyi dari-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "58. Wahai Nabi, berserah dirilah dan bersandarlah kepada Tuhanmu yang kekal, tidak mati dan disandari untuk memenuhi kebutuhan dan kebaikan. Sucikanlah Dia dari setiap sifat yang kurang disertai dengan rasa syukur kepadaNya atas nikmat yang diberikan. Dan cukuplah Allah SWT yang Maha Mengamati dosa hamba-hambaNya sehingga tidak ada satupun yang luput dariNya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Bertawakallah kepada Dzat Yang Maha hidup yang tidak akan mati dan bertasbihlah dengan memujiNya. Cukuplah Dia Maha Mengetahui dosa hamba-hambaNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "58 kemudian Allah memerintahkannya untuk bertawakal kepadaNya dan meminta pertolongan kepadaNya seraya berfirman, \"dan bertawakallah kepada Allah yang hidup,” Dzat yang memiliki kehidupan sempurna lagi absolut, “yang tidak mati, dan bertasbihlah dengan memujiNya,” maksudnya, sembahlah Dia dan bertawakallah kepadaNya dalam segala perkara yang berhubungan denganmu dan berhubungan dengan manusia. “dan cukuplah Dia Maha Mengetahui dosa-dosa hamba-hambaNya.” Dia mengetahuinya dan akan memberikan balasannya. Jadi, engkau sama sekali tidak berkewajiban sedikit pun untuk memberi mereka hidayah, dan engkau juga tidak dibebani memelihara amal perbuatan mereka. Sesungguhnya semua itu di tangan Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Furqan ayat 58: Kemudian Allah memerintahkan Beliau untuk bertawakkal dan meminta pertolongan-Nya dalam semua urusan. Yakni dengan mengucapkan Subhaanallahi wal hamdulillah atau dengan melaksanakan ibadah seperti shalat sebagai rasa syukur terhadap nikmat-Nya. Dan Dia akan membalasnya. Adapun Beliau, maka bukan kewajibannya menjadikan mereka mengikuti petunjuk dan bukan kewajibannya menjaga amal mereka. Semua itu hanyalah di Tangan Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Furqan Ayat 58",
    "description": "Wahai rasul-ku, teruskan dakwahmu dan bertawakAllah dengan menyerahkan segala keputusan akhir kepada Allah yang mahahidup, yang tidak mati, jangan kepada yang selain-Nya! dan bertasbihlah dengan menjauhkan-Nya dari semua sifat kekurangan dan memuji-Nya karena hanya dialah yang berhak dipuji, karena kesempurnaan zat-Nya dan sifatnya. Dan jika ada hamba-Nya yang berbuat dosa, maka cukuplah dia yang maha mengetahui dosa hamba-hamba-Nya. 59. Dialah tuhan yang menciptakan langit yang tujuh beserta benda-benda angkasa lainnya dan bumi dan apa yang ada di antara keduanya yaitu segala benda yang kita tidak mengetahui secara pasti dalam enam masa, yaitu dua masa pertama untuk menciptakan badan bumi, dua masa berikutnya untuk menciptakan langit dan dua masa terakhir untuk mengisi bumi dengan segala kandungannya kemudian dia bersemayam dengan cara yang sesuai dengan sifat keagungan-Nya di atas singgasana-Nya yaitu 'arsy. Dialah yang maha pengasih yang demikian besar dan luas sehingga tercurahkan kepada seluruh makhluknya tanpa kecuali. Maka tanyakanlah olehmu wahai nabi tentang ciptaan Allah yang disebutkan di atas, kepada yang lebih mengetahui yaitu Allah sendiri. Dialah yang paling tahu tentang ciptaan-Nya."
  }
]