[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Yang menciptakan langit dan bumi dan apa yang ada di antara keduanya dalam jangka enam hari. Kemudian Dia bersemayam di atas Arasy (maksudnya, tinggi dan jauh di atas sana) bersemayam yang sesuai dengan keagunganNya. Dia-lah ar-Rahman (YangMaha Pengasih), maka tanyakanlah (wahai nabi) tentang Dia kepada Yang Maha Mengetahui, yaitu Allah Yang Mahamulia sendiri. Dia-lah yang mengetahui sifat-sifatNya, kebesaran, dan keagunganNya. Dan tidak seorang pun yang lebih mengetahui tentang Allah dan lebih teliti tentangNya selain hamba dan rasulNya, Muhammad."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "59. Yang menciptakan langit dan bumi serta apa yang ada antara keduanya dalam enam hari, kemudian dia bersemayam di atas Arasy dengan semayam yang sesuai keagungan dan kemuliaan-Nya. Dia lah Yang Maha Pemurah, maka tanyakanlah -wahai Rasul- tentang hal tersebut (penciptaan-Nya) kepada yang lebih mengetahuinya (Allah), sebab Dia sendiri lah yang mengetahui segala sesuatu, tidak ada sesuatupun yang tersembunyi bagi-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "59. ثُمَّ اسْتَوَىٰ عَلَى الْعَرْشِ ۚ (kemudian dia bersemayam di atas ‘Arsy) Yakni menaiki ‘arsy. الرَّحْمٰنُ فَسْـَٔلْ بِهِۦ خَبِيرًا ((Dialah) Yang Maha Pemurah, maka tanyakanlah (tentang Allah) kepada yang lebih mengetahui (Muhammad) tentang Dia) Yakni Dialah Yang Maha Pengasih, maka tanyalah Dia tentang penjelasan dari ayat-ayat yang telah Kami sebutkan kepadamu secara umum, yaitu ayat-ayat yang menyebutkan penciptaan langit dan bumi, dan bersemayamnya Allah di atas Arsy."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "59. Dialah Pencipta langit, bumi dan makhluk-makhluk hidup di antara keduanya selama enam hari sesuai hitungan hari di dunia. Jika berkehendak, sungguh Dia akan menciptakan semua itu sekaligus. Kemudian Dia bersemayam di atas Arsy sesuai dengan keagungan dan keluhuranNya. Dialah Dzat Maha Pemurah yang kasih sayangNya diberikan kepada setiap sesuatu. Maka tanyakanlah tentangNya dan hal-hal yang berhubunga denganNya kepada pemberi kabar yaitu orang-orang yang memiliki ilmu tentang kitab Tuhan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dzat yang menciptakan langit dan bumi serta apa yang ada di antara keduanya dalam enam masa. Kemudian Dia bersemayam di atas ʻArsy} Naik dan meninggi di atas Arsy, bersemayam yang sesuai dengan keagunganNya {Dzat Yang Maha Pengasih. Tanyakanlah tentang Dia kepada Dzat Yang Maha Mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "59 “yang menciptakan langit dan bumi dan segala sesuatu yang ada antara keduanya dalam enam masa, kemudian Dia bersemayam,” sesudah itu “di atas Arasy,” yang merupakan atap seluruh makhluk, dan yang paling tinggi, paling luas dan yang paling indah. “yang Maha pemurah,” bersemayam di atas ArasyNya yang luasnya meliputi seluruh langit dan bumi dengan namaNya ar-rahman yang rahmatNya meliputi segala sesuatu. Dia bersemayam di atas makhluk terluas dengan sifatNya yang terluas. Melalui ayat ini Dia telah menetapkan (sifat) menciptaNya terhadap seluruh makhluk dan (sifat) mengetahuiNya yang nampak dan yang tidak nampak, dan (menetapkan pula) ketinggianNya di atas Arasy dan (sifat) kejelasanNya tentang mereka. “maka tanyakanlah tentang Allah kepada yang lebih mengetahui (Muhammad),” yang dimaksud adalah menanyakan DiriNya yang mulia (kepada Rasulullah). Allah-lah yang mengetahui sifat-sifat, keagungan dan kemuliaanNya. Dan sungguh Dia telah memberikan penjelasan(nya) kepada kalian tentang hal itu dan telah menjelasakan kepada kalian bagian dari keagungan yang dengannya kalian bisa [berbahagia] karena mengenalNya, sehingga diketahui oleh orang-orang yang mengetahui (al-arifun) dan mereka tunduk kepada keagunganNya, dan orang-orang kafir enggan untuk beribadah kepadaNya dan tidak menyukainya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Furqan ayat 59: Jika Dia menghendaki, Dia mampu menciptakannya dalam sekejap, akan tetapi untuk mengajarkan sikap pelan-pelan (tidak tergsa-gesa) kepada makhluk, demikian pula untuk menghubungkan akibat dengan sebabnya sebagaimana yang dikehendaki oleh hikmah (kebijaksanaan)-Nya. Bersemayam di atas 'Arsy ialah satu sifat Allah yang wajib kita imani, sesuai dengan kebesaran Allah dan keagungan-Nya. Hal ini menandakan sempurnanya kerajaan Allah dan kekuasaan-Nya. Arsy artinya singgasana, ia adalah atap semua makhluk. Makhluk Allah yang paling tinggi, paling besar dan luas serta paling indah. Yang rahmat-Nya mengena kepada segala sesuatu. Ayat ini menetapkan penciptaan-Nya terhadap semua makhluk, pengetahuan-Nya terhadap zahir dan batin mereka, tingginya Dia di atas ‘Arsy dan terpisahnya Dia dari mereka. Yang lebih mengetahui tentang Allah adalah Allah Subhaanahu wa Ta'aala sendiri, Dialah yang mengetahui sifat-sifat-Nya, keagungan-Nya dan kebesaran-Nya, dan Dia telah memberitahukannya kepada kamu serta menerangkannya, sehingga membantu kamu untuk dapat mengenal-Nya dan tunduk kepada keagungan-Nya. Ada pula yang menafsirkannya dengan Nabi Muhammad shallallahu 'alaihi wa sallam, karena Beliau mengenal tentang Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Furqan Ayat 59",
    "description": "Dialah tuhan yang menciptakan langit yang tujuh beserta benda-benda angkasa lainnya dan bumi dan apa yang ada di antara keduanya yaitu segala benda yang kita tidak mengetahui secara pasti dalam enam masa, yaitu dua masa pertama untuk menciptakan badan bumi, dua masa berikutnya untuk menciptakan langit dan dua masa terakhir untuk mengisi bumi dengan segala kandungannya kemudian dia bersemayam dengan cara yang sesuai dengan sifat keagungan-Nya di atas singgasana-Nya yaitu 'arsy. Dialah yang maha pengasih yang demikian besar dan luas sehingga tercurahkan kepada seluruh makhluknya tanpa kecuali. Maka tanyakanlah olehmu wahai nabi tentang ciptaan Allah yang disebutkan di atas, kepada yang lebih mengetahui yaitu Allah sendiri. Dialah yang paling tahu tentang ciptaan-Nya. 60. Kemudian Allah menjelaskan tentang sikap orang kafir yang terus ingkar terhadap Allah. Dan apabila dikatakan kepada mereka, yakni kepada orang-orang kafir itu, 'sujudlah dan tunduklah kamu kepada tuhan yang maha pengasih', mereka menjawab, dengan sinis 'siapakah yang maha pengasih itu' apakah kami harus sujud kepada Allah yang engkau, wahai Muhammad, perintahkan kepada kami bersujud kepada-Nya padahal kami tidak mengetahui dan mengenal-Nya'\" mereka sangat angkuh dan mereka makin jauh lari dari kebenaran. Hati mereka sudah terkunci rapat oleh kedengkian, kesombongan, dan kekafiran."
  }
]