[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai Rasul) kepada orang-orang kafir itu, “Sesungguhnya yang menurunkan al-Qur’an, Dia adalah Allah yang pengetahuanNya meliputi segala yang ada di langit dan di bumi. Sesungguhnya Dia Maha pengampun bagi orang yang bertaubat dari dosa-dosanya dan maksiat-maksiat, juga Maha Pemurah terhadap mereka karena tidak segera menimpakan siksaan pada mereka ."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Katakanlah -wahai Rasul- kepada orang-orang yang mendustakan tersebut, \"Al-Qur`ān itu diturunkan oleh Allah yang mengetahui segala sesuatu di langit dan di bumi, dan bukanlah kitab yang diada-adakan oleh Muhammad sebagaimana yang kalian tuduhkan.\" Lalu Allah berfirman mendorong mereka untuk bertobat, \"Sesungguhnya Allah Maha Pengampun lagi Maha Penyayang terhadap hamba-hamba-Nya yang bertobat kepada-Nya\"."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "6. Allah membantah mereka: Hai Rasulullah, katakanlah kepada mereka, “Allah-lah yang telah menurunkan al-Qur’an, tidak ada sesuatu yang ada di tujuh langit dan bumi yang tersembunyi dari-Nya. Dia Maha Mengampuni hamba-hamba-Nya yang bertaubat dan Maha Mengasihi mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. قُلْ أَنزَلَهُ الَّذِى يَعْلَمُ السِّرَّ فِى السَّمٰوٰتِ وَالْأَرْضِ ۚ (Katakanlah: “Al Quran itu diturunkan oleh (Allah) yang mengetahui rahasia di langit dan di bumi) Yakni al-Qur’an itu bukanlah cerita-cerita bohong atau dongeng-dongeng orang terdahulu yang dibuat dengan bantuan suatu kaum dan dan ditulis oleh orang lain, namun ini adalah kabar dari langit yang diturunkan oleh Dzat yang mengetahui segalanya, tidak ada sesuatupun yang tidak Dia ketahui; oleh sebab itu kalian tidak mampu menandinginya dan kalian belum bisa mendatangkan satu surat yang semisalnya. إِنَّهُۥ كَانَ غَفُورًا رَّحِيمًا(Sesungguhnya Dia adalah Maha Pengampun lagi Maha Penyayang) Dia tidak menyegerakan siksaan bagi kalian, sebab Dia Maha pengampun dan penyayang."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Katakanlah wahai Nabi: “Al-Qur’an ini bukanlah sesuatu yang direkayasa. Sesungguhnya yang menurunkannya adalah Dzat yang Maha Mengetahui rahasia-rahasia dan misteri-misteri di langit dan bumi, yaitu merupakan perkara langit. Sesungguhnya Dia Maha Pengampun lagi Maha Penyayang, sehingga tidak mempercepat hukuman bagi kalian”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Katakanlah,“Itu diturunkan} Alqur’an diturunkan {oleh Dzat yang mengetahui rahasia} hal ghaib {di langit dan di bumi. Sesungguhnya Dia Maha Pengampun lagi Maha Penyayang”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6 maka dari itu Allah membantah mereka dengan FirmanNya, ”katakanlah, ’al-qur’an itu diturunkan oleh (Allah) yang mengetahui segala rahasia di langit dan dibumi.” Maksudnya, al-qur’an itu diturunkan oleh Allah yang pengetahuanNya meliputi semua apa yang ada di langit dan bumi, dari yang tidak tampak dan yang Nampak, dari yang jelas dan yang tersembunyi. (ini) seperti FirmanNya, ”dan sesungguhnya al-qur’an ini benar-benar diturunkan oleh Rabb semesta alam, dia dibawa turun oleh ar-Ruh al-amin (jibril), kedalam hatimu (muhammad) agar kamu menjadi salah seorang di antara orang-orang yang memberi peringatan,” (QS. asy-syua’ra:192-194) Sisi penegakan hujjah terhadap mereka adalah bahwa yang telah menurunkan al-qur’an ini adalah (tuhan) yang ilmuNya meliputi segala sesuatu. Maka mustahil dan tidak masuk akal kalau seorang makluk mengatakan atau mengada-adakan al-qur’an ini, lalu mengatakan, “ini berasal dari sisi Allah” padahal ia bukan drai sisiNya, lalu dia menghalalkan darah dan harta siapa saja yang menyalahinya, dan beranggapan bahwa Allah telah mengatakan hal itu kepadanya. Allah mengetahui segala sesuatu, maka dari itu Dia memberikan dukungan dan pertolongan kepadanya (Muhammad) dalam melawan musuh-musuhNya, serta menjadikannya dapat menguasai mereka dan negerinya. Maka tidak mungkin seseorang akan mengingkari al-qur’an ini kecuali setelah dia mengingkari (luasnya) pengetahuan Allah. Ini sama seklai tidak pernah dikatakn oleh sekelompok anak cucu adam, kecuali kaum filsafat atheism!. Dan juga, sesungguhnya penjelasan tentang ilmu Allah yang meliputi segala sesuatu mengingatkan dan mendorong mereka untuk merenungkan al-qur’an; dan bahwa kalau saja mereka merenungkannya, tentu mereka akan melihat ilmu dan hukum-hukumNya yang membuktikan dengan jelas lagi pasti bahwasannya al-qur’an ini tidak mungkin ada kecuali berasal dari Dzat yang Mengetahui yang Ghaib dan yang nampak. Sekalipun mereka mengingkari tauhid dan kerasulan, namun karena kelembutan Allah terhadap mereka, maka Dia tidak membiarkan mereka dan tidak membiarkan kezhaliman mereka, bahkan Dia menyeru dan mengajak mereka bertaubat dan berinabah (kembali) kepadaNya; dan Dia menjanjikan ampunan dan rahmat (kasih sayang) kepada mereka jika mereka bertaubat, dan kembali kepada Allah. Seraya berfirman, ”sesungguhnya Dia Mahapengampun,” maksudnya, sifatNya adalah memberikan ampunan kepada para pelaku kemaksiatan dan dosa apabila mereka melakukan sebab kausalitas ampunanNya, yaitu meninggalkan kedurhakaan dan bertaubat darinya; “lagi Mahapenyayang,” terhadap mereka, di mana Dia tidak segera menimpakan hukumanNYa terhadap mereka, padahal mereka telah melakukan perbuatan yang semestinya dibalas dengan hukuman; dan di mana pula Dia menerima taubat mereka setelah sebelumnya mereka berbuta maksiat; dan di mana pula Dia menghapus dosa-dosa mereka yang telah lalu, serta menerima kebaikan-kebaikan mereka, dan di mana pula Dia mengembalikan orang yang kembali kepadaNya setelah dia terlantar, dan orang yang menghadap kepadaNya setelah sebelumnya dia berpaling dariNya kepada kondisi orang-orang yang patuh dan berinabah kepadaNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Furqan ayat 6: Allah Subhaanahu wa Ta'aala berfirman membantah mereka. Yakni hal gaib. Sisi tegaknya hujjah kepada mereka adalah, bahwa yang menurunkannya adalah Tuhan yang ilmu-Nya meliputi segala sesuatu, termasuk mengetahui pula orang yang membawa Al Qur’an (Nabi Muhammad shallallahu 'alaihi wa sallam) dan mengatakan bahwa ia turun dari sisi Allah. Jika memang Al Qur’an bukan dari Allah, tentu Allah segera membinasakannya, namun kenyataannya Allah menguatkannya dan memenangkannya terhadap musuh-musuhnya. Di samping itu, disebutkan ilmu-Nya yang menyeluruh adalah untuk mengingatkan mereka dan mendorong mereka untuk mentadabburi Al Qur’an, di mana jika mereka mau mentadaburinya, tentu mereka akan melihat di antara ilmu-Nya dan hukum-hukum-Nya yang menunjukkan bahwa Al Qur’an turun dari Yang Maha Mengetahui yang gaib dan yang tampak. Meskipun mereka mengingkari tauhid dan kerasulan Nabi Muhammad shallallahu 'alaihi wa sallam, namun Allah bersikap lembut kepada mereka, Dia tidak segera menghukum mereka, bahkan mengajak mereka dengan lembut untuk bertobat dan kembali kepadanya, Dia berfirman di akhir ayat, “Sungguh, Dia Maha Pengampun lagi Maha Penyayang.\" Agar mereka tidak berputus asa. Sifat-Nya mengampuni bagi pelaku dosa dan maksiat apabila mereka mengerjakan sebab-sebab untuk diampuni, yaitu berhenti dari maksiat dan bertobat. Dia tidak segera menghukum mereka, padahal mereka telah melakukan perbuatan yang menghendaki untuk disiksa, Dia mengutus Rasul-Nya untuk kebaikan mereka, tetapi Rasul tersebut mereka sakiti baik dengan lisan maupun dengan perbuatan, bahkan Dia mengajak mereka bertobat dan siap menerima tobat mereka, menghapuskan kesalahan mereka dan menerima kebaikan mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Furqan Ayat 6",
    "description": "Mengajari nabi Muhammad untuk menjawab tuduhan kaum kafir itu, Allah berfirman, 'katakanlah, wahai nabi Muhammad, kepada mereka bahwa Al-Qur'an itu diturunkan oleh Allah yang mengetahui segala rahasia di langit dan di bumi. \" sungguh, dia maha pengampun, maha penyayang, sehingga dia menunda turunnya azab kepada manusia yang durhaka. 7. Dan orang-orang kafir tidak merasa cukup dengan menuduh Al-Qur'an sebagai hasil karya nabi Muhammad. Mereka juga berkata, 'mengapa pria yang mengaku rasul ini memakan makanan dan berjalan di pasar-pasar untuk mencari rezeki seperti halnya kita' kalaulah rasul itu manusia, mengapa malaikat tidak diturunkan kepadanya agar malaikat itu memberikan peringatan bersama dia sehingga kita mengetahui kebenaran perkataannya, ."
  }
]