[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apabila dikatakan kepada orang-orang kafir, “Bersujudlah kepada ar-Rahman (Tuhan Yang Maha pengasih) dan beribadahlah kepadaNya”, mereka menjawab, “Kami tidak mengenal ar-Rahman. Apakah kami akan bersujud terhadap Dzat yang kamu perintahkan kami bersujud kepadaNya sebagai bentuk ketaatan kami kepada perintahmu?” dan seruan kepada mereka untuk bersujud kepada ar-Rahman kian menambah mereka jauh dari keimanan dan lari darinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "60. Dan apabila dikatakan kepada orang-orang kafir, \"Sujudlah kalian kepada Ar-Raḥmān (Yang Maha Penyayang),” mereka menjawab, \"Kami tidak akan sujud kepada-Nya, siapakah Ar-Raḥmān itu? Sungguh kami tidak mengenal dan meyakini-Nya. Apakah kami akan sujud kepada Tuhan Yang kamu perintahkan kami bersujud kepada-Nya sedangkan kami tidak meyakini dan tidak mengenal-Nya?\" Dan perintah sujud itu menambah kejauhan mereka dari keimanan kepada Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "60. Dan jika dikatakan kepada orang-orang kafir: “Sembahlah ar-Rahman dan tunduk sujudlah kepada-Nya.” Maka mereka akan bertanya dengan heran: “Siapa itu ar-Rahman? Apakah kami harus bersujud karena mentaati perintahmu?” Dan itu akan menambah keberpalingan mereka sebagaimana keledai yang lari dari singa."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "60. وَإِذَا قِيلَ لَهُمُ اسْجُدُوا۟ لِلرَّحْمٰنِ قَالُوا۟ وَمَا الرَّحْمٰنُ (Dan apabila dikatakan kepada mereka: “Sujudlah kamu sekalian kepada yang Maha Penyayang” mereka menjawab: “Siapakah yang Maha Penyayang itu?) Mereka menjawab: kami tidak mengenal ar-Rahman kecuali Rahman dari Yamamah, yaitu Musailamah. Yakni ketika mereka mendengar perkataan Rasulullah mereka mengingkarinya dan menjawab: kami tidak mengenal ar-Rahman. أَنَسْجُدُ لِمَا تَأْمُرُنَا(Apakah kami akan sujud kepada Tuhan Yang kamu perintahkan kami(bersujud kepada-Nya)?) Yakni apakah kami akan bersujud kepada ar-Rahman seperti yang kamu perintahkan? وَزَادَهُمْ نُفُورًا(dan (perintah sujud itu) menambah mereka jauh (dari iman)) Yakni perintah untuk bersujud itu hanya menambah jauh dan enggan dari agama."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "60-61 Pada akhir-akhir surah al-Furqan Allah berfirman : { وَإِذَا قِيلَ لَهُمُ ٱسْجُدُوا۟ لِلرَّحْمَٰنِ } \"Dan apabila dikatakan kepada mereka: \"Sujudlah kamu sekalian kepada yang Maha Penyayang\" kemudian pada ayat selanjutnya dikatakan : { تَبَارَكَ ٱلَّذِى جَعَلَ فِى ٱلسَّمَآءِ بُرُوجًا } \"Maha Suci Allah yang menjadikan di langit gugusan-gugusan bintang\" Kecocokan kedua ayat ini adalah: bahwasanya tatkala orang-orang musyrik bodoh tentang Allah yang Maha penyayang, mereka menyombongkan diri untuk tidak bersujud kepada Allah. Al-Qur'an kemudian mengenalkan kepada mereka tentang Dzat yang maha penyayang itu: bagaimana penciptaanNya, pengaturanNya dan nikmatNya, kemudian al-Qur'an juga memberitahu kepada mereka tentang hamba-hamba yang diberitahukan kepada mereka tentang itu, dan mereka beriman kepadaNya, dan tunduk kepadaNya, maka bagi mereka adalah kemuliaan yang besar, dan kesedihan bagi orang-orang yang sengaja tidak ingin tahu dan menyombongkan diri."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "60. Dan saat dikatakan kepada orang-orang kafir Mekah (Yang berkata adalah Rasulallah SAW): “Sujudlah kepada Tuhan yang Maha Pemurah, bukan kepada berhala dan patung.” Mereka menjawab: “Siapa itu yang Maha Pemurah? Kami hanya mengenal Rahman Al-Yamamah, yaitu Musailamah. Apakah kamu akan memerintahkan kami untuk bersujud kepada tuhan yang tidak kami kenal.” Perintah sujud itu menjadikan mereka semakin menolak keimanan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apabila dikatakan kepada mereka,“Sujudlah kepada Dzat Yang Maha Pengasih.” Mereka menjawab,“Siapakah Dzat Yang Maha Pengasih itu? Apakah kami bersujud kepada yang kamu perintahkan kepada kami” Hal itu menambah mereka jauh} jauh dari keimanan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "60 oleh karenanya Dia berfirman, ”dan apabila dikatakan kepada mereka, ’sujudlah kamu sekalian kepada Yang Maha Penyayang’,” yaitu (kepada Yang Maha Penyayang) semata yang telah mengaruniakan kepada kalian seluruh kenikmatan dan mencegah seluruh bencana dari kalian, ”mereka menjawab,” dengan sikap ingkar dan kufur, ”siapakah Yang Maha Penyayang itu,” dengan anggapan mereka yang rusak, bahwa mereka tidak mengenal ”Yang Maha Pemurah,” dan mereka menjadikan bagian dari cemoohan mereka terhadap rasul adalah ucapan mereka, ”Dia melarang kita menyembah sembahan-sembahan lain bersamaNya dengan mengatakan, ’Ya Rahman! Dan lain-lain,” sebagaimana di firmankan oleh Allah, ”katakanlah, ’serulah Allah atau serulah ar-rahman. Dengan nama yang mana saja kamu seru, Dia mempunyai Asma’ul HUsna (nama-nama yang terbaik).” (al-isra’:10) Jadi, nama-nama Allah itu banyak, karena banyaknya sifat-sifatNya, dan kuantitas jumlah kesempurnaanNYa, dan setiap masing-masing menunjukkan kepada sifat kesempurnaanNya. “apakah kami akan sujud kepada Rabb Yang kamu memerintahkan kami (bersujud kepadaNYa),” maksudnya, hanya karena perintahmu kepada kami. Ungkapan ini berdasarkan atas pendustaan mereka terhadap Rasul dan keenganan mereka untuk menaatinya. “dan (perintah sujud) menambah mereka,” maksudnya, ajakanmu untuk bersujud kepada ar-rahman membuat mereka bertambah “lari (dari iman),” maksudnya lari dari kebenaran menuju kebatilan dan bertambah kafir dan sengasara. Allah berulang-ulang menyebutkan kata “Mahasuci Allah,” dalam surat yang mulia ini sebanyak tiga kali, karena maknanya adalah, sebagaimana telah disebutkan di muka, bahwasannya kata ini menunjukan kepada keagungan Sang pencipta dan banyaknya sifat-sifat dan kebaikan serta karuniaNya. Surat ini mengandung sebagian dari pengambilan dalil akan keagunganNya, luasnya kerajaanNya, luar biasa kehendakNYa, keuniversalan ilmu pengetahuanNya, kekuasaanNya, cakupan kerajaanNya dalam berbagai hukum perintah dan hukum-hukum balasan serta kesempurnaan kebijaksanaanNYa. Dan di dalamnya terdapat bukti atas keluasan rahmatNya, keluasan kemuraahanNya dan banyaknya kebaikanNya yang bersifat agama dan duniawi, hingga menjadi tuntutan untuk mengulang-ulang kata “sifat yang sangat indah” ini."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Furqan ayat 60: Yang mengaruniakan kepadamu semua nikmat dan menghindarkan bahaya. Dengan sikap ingkar. Dengan persangkaan mereka yang rusak, bahwa mereka tidak mengenal Ar Rahman dan menjadikannya di antara sekian cara mengkritik Rasulullah shallallahu 'alaihi wa sallam, mereka berkata, “Bagaimana dia melarang kita mengambil sesembahan-sesembahan selain Allah, sedangkan dia sendiri menyembah tuhan selain-Nya, dia berdoa, “Ya Rahmaan”, dsb. Padahal Ar Rahman adalah salah satu di antara nama-nama Allah, di mana seseorang boleh menyeru-Nya dengan menyebut Allah maupun Ar Rahman atau nama-nama-Nya yang lain. Nama-nama-Nya banyak karena banyak sifat-Nya dan banyak kesempurnaan-Nya, di mana masing-masingnya menunjukkan sifat sempurna. Maksudnya, “Apakah kami akan sujud hanya karena perintahmu semata?” Hal ini didasari atas pendustaan mereka terhadap Rasulullah shallallahu 'alaihi wa sallam dan sombong dari menaatinya. Yakni ajakan kepada mereka untuk sujud kepada Ar Rahman. Yakni lari dari kebenaran kepada kebatilan, serta bertambah kafir dan celaka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Furqan Ayat 60",
    "description": "Kemudian Allah menjelaskan tentang sikap orang kafir yang terus ingkar terhadap Allah. Dan apabila dikatakan kepada mereka, yakni kepada orang-orang kafir itu, 'sujudlah dan tunduklah kamu kepada tuhan yang maha pengasih', mereka menjawab, dengan sinis 'siapakah yang maha pengasih itu' apakah kami harus sujud kepada Allah yang engkau, wahai Muhammad, perintahkan kepada kami bersujud kepada-Nya padahal kami tidak mengetahui dan mengenal-Nya'\" mereka sangat angkuh dan mereka makin jauh lari dari kebenaran. Hati mereka sudah terkunci rapat oleh kedengkian, kesombongan, dan kekafiran. 61. Padahal jika mereka mengetahui kekuasaan Allah di alam seluruh, mereka pasti bersujud kepada-Nya. Mahasuci Allah dan maha banyak kebaikan-Nya kepada makhluk-Nya, yang menjadikan di langit gugusan bintang-bintang dalam jumlah milyaran. Semuanya berjalan secara ter-atur, tak pernah ada benturan antara satu dengan lainnya. Dan dia juga menjadikan padanya matahari dan bulan yang bersinar. Matahari mem-punyai energi panas yang luar biasa besarnya yang terus menyala-Nyala sehingga bisa bersinar dengan kekuatannya sendiri. Sementara bulan bersinar dengan sinar yang lembut dan redup, karena mendapatkan pancaran dari cahaya matahari. Matahari dan bulan memberikan man-faat yang luar biasa kepada manusia."
  }
]