[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Amat agung keberkahan-keberkahan Tuhan Yang Maha Pengasih itu dan sangat banyak kebaikan-kebaikanNya, Yang menjadikan di langit bintang-bintang yang besar dengan poros-porosnya, dan menjadikan di dalamnya matahari yang bersinar dan bulan yang bercahaya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "61. Mahasuci Allah yang menjadikan gugusan-gugusan tempat orbit planet dan bintang-bintang yang berjalan di langit. Dia juga menjadikan di langit itu matahari yang memancarkan cahaya terang, dan juga menjadikan bulan yang bercahaya menerangi bumi lewat pantulan cahaya matahari kepadanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "61-62. Maha Suci dan Maha Agung kedudukan Allah dan sangat banyak kebaikan-Nya, Dia menciptakan bintang-bintang yang besar di langit dunia pada porosnya; di antaranya matahari yang bersinar terang dan bulan yang bercahaya. Dia menjadikan siang dan malam silih berganti, yang satu menggantikan yang lain, bagi orang yang hendak mengambil pelajaran dari dua tanda keagungan kekuasaan Allah yang besar ini dan bagi orang yang hendak bersyukur kepada Allah atas berbagai kenikmatan yang tidak dapat terpisah dari kehidupan manusia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "61. تَبَارَكَ الَّذِى جَعَلَ فِى السَّمَآءِ بُرُوجًا (Maha Suci Allah yang menjadikan di langit gugusan-gugusan bintang) Yakni gugusan-gugusan bintang yang berjumlah dua belas. Dinamakan dengan (البروج) yang berarti istana-istana yang tinggi, karena bintang-bintang membentuk seperti istana-istana yang tinggi bagi penghuninya. وَجَعَلَ فِيهَا سِرٰجًا (dan Dia menjadikan juga padanya matahari) Yakni matahari yang menyala-nyala. وَقَمَرًا مُّنِيرًا (dan bulan yang bercahaya) Yakni yang menyinari bumi jika sedang nampak, namun ia tidak dapat menyala."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "60-61 Pada akhir-akhir surah al-Furqan Allah berfirman : { وَإِذَا قِيلَ لَهُمُ ٱسْجُدُوا۟ لِلرَّحْمَٰنِ } \"Dan apabila dikatakan kepada mereka: \"Sujudlah kamu sekalian kepada yang Maha Penyayang\" kemudian pada ayat selanjutnya dikatakan : { تَبَارَكَ ٱلَّذِى جَعَلَ فِى ٱلسَّمَآءِ بُرُوجًا } \"Maha Suci Allah yang menjadikan di langit gugusan-gugusan bintang\" Kecocokan kedua ayat ini adalah: bahwasanya tatkala orang-orang musyrik bodoh tentang Allah yang Maha penyayang, mereka menyombongkan diri untuk tidak bersujud kepada Allah. Al-Qur'an kemudian mengenalkan kepada mereka tentang Dzat yang maha penyayang itu: bagaimana penciptaanNya, pengaturanNya dan nikmatNya, kemudian al-Qur'an juga memberitahu kepada mereka tentang hamba-hamba yang diberitahukan kepada mereka tentang itu, dan mereka beriman kepadaNya, dan tunduk kepadaNya, maka bagi mereka adalah kemuliaan yang besar, dan kesedihan bagi orang-orang yang sengaja tidak ingin tahu dan menyombongkan diri."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "61. Maha Agung, Maha Bersih dan Maha Suci Dzat yang Maha Pemurah yang menciptakan di langit rasi-rasi bintang yang tinggi dan tempat perputarannya. Hal ini sebagaimana yang diriwayatkan dari Ibnu Abbas tentang 12 rasi yaitu Al-Hamal, Ats-Tsaur, Al-Jauza’, As-Sarathan, Al-Asad, Al-Mizan, Al-‘Aqrab, Al-Qaus, Al-Jadyu, Ad-Dalwu dan Al-Hut. Dikatakan bahwa Al-Buruj adalah planet-planet yang besar. Dan Dia menjadikan di langit itu matahari yang bersinar di siang hari dan bulan yang berkilau di malam hari tanpa menyala-nyala."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maha memberkahi Dzat yang menjadikan di langit gugusan bintang} tempat-tempat untuk planet-planet dan bintang-bintang {dan menjadikan pada langit itu pelita} matahari {dan bulan yang bercahaya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "61 “Mahasuci Allah yang menjadikan di langit gugusan-gugusan bintang,” maksudnya, adalah bintang-bintang dan keseluruhannya, atau letak-letak grais orbit matahari dan bulan yang dilaluinya satu demi satu. Ia laksana bangunan tinggi dan benteng bagi perkotaan di dalam melindunginya. Demikian pula halnya bintang-bintang, laksana benteng-benteng menjulang tinggi yang dibuat untuk penjagaan. Karena sesungguhnya bintang-bintang itu adalah alat pelempar untuk setan-setan. “dan Dia menjadikan juga padanya matahari,” padanya terkandung cahaya dan panas yaitu matahari, “dan bulan yang bercahaya,” di dalamnya ada cahaya yang tidak panas. Dan ini termasuk salah satu bukti keagunganNya dan betapa banyak ihsan (kebaikan) Nya, disebabkan penciptaan yang luar biasa yang terkandung di dalamnya, pengaturan yang rapih dan keindahan yang agung yang menunjukkan kepada keagungan penciptanya di dalam seluruh sifat-sifatNya, dan berbagai kemaslahatan yang terdapat di dalamnya bagi manusia dan berbagai manfaat yang merupakan bukti atau betapa banyaknya kebaikan dan karuniaNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Furqan ayat 61: Dalam surah ini Allah Subhaanahu wa Ta'aala mengulangi kata-kata, “Tabaaraka” yang maknanya menunjukkan keagungan Allah, banyak sifat-Nya, banyak kebaikan-Nya dan ihsan-Nya. Surah ini, di dalamnya terdapat dalil terhadap keagungan-Nya, luasnya kekuasaan-Nya, berlakunya kehendak-Nya, ilmu dan kekuasaan-Nya yang menyeluruh, kerajaan dan kekuasaan-Nya yang meliputi baik dalam hukum syar’i maupun dalam hukum jaza’i serta sempurnanya hikmah (kebijaksanan)-Nya. Di dalamnya juga terdapat dalil yang menunjukkan luasnya rahmat-Nya, luasnya kemurahan-Nya, banyak kebaikan-Nya baik yang terkait dengan agama maupun dunia, di mana itu semua menghendaki diulang-ulangnya sifat yang mulia ini “Tabaaraka.” Ada yang menafsirkan dengan bintang secara umum atau garis tempat perjalanan matahari dan bulan, di mana ia menduduki posisi benteng bagi kota, demikian pula bintang-bintang ibarat benteng yang dijadikan sebagai pertahanan, karena ia alat pelemper setan. Matahari disebut siraj, karena cahaya dan panas yang ada di dalamnya. Bulan disebut munir, karena hanya cahaya saja tanpa ada panas. Ini semua termasuk di antara dalil keagungan-Nya dan banyak kebaikan-Nya, karena ciptaan yang begitu menarik, pengaturan yang begitu tertib dan pemandangan yang indah menunjukkan keagungan Penciptanya dalam semua sifat-Nya, dan berbagai maslahat serta manfaat yang diperoleh makhluk yang ada di dalamnya menunjukkan banyak kebaikan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Furqan Ayat 61",
    "description": "Padahal jika mereka mengetahui kekuasaan Allah di alam seluruh, mereka pasti bersujud kepada-Nya. Mahasuci Allah dan maha banyak kebaikan-Nya kepada makhluk-Nya, yang menjadikan di langit gugusan bintang-bintang dalam jumlah milyaran. Semuanya berjalan secara ter-atur, tak pernah ada benturan antara satu dengan lainnya. Dan dia juga menjadikan padanya matahari dan bulan yang bersinar. Matahari mem-punyai energi panas yang luar biasa besarnya yang terus menyala-Nyala sehingga bisa bersinar dengan kekuatannya sendiri. Sementara bulan bersinar dengan sinar yang lembut dan redup, karena mendapatkan pancaran dari cahaya matahari. Matahari dan bulan memberikan man-faat yang luar biasa kepada manusia. 62. Dan bentuk kekuasaan Allah lainnya adalah bahwa dia pula yang menjadikan malam dan siang silih berganti sesuai dengan perputaran bumi mengelilingi matahari. Siang dan malam saling berkejaran. Kejadian alam seluruh ini haruslah menjadi bahan renungan bagi orang yang ingin mengambil pelajaran bahwa semua ciptaan Allah pasti mempunyai hikmah yang besar bagi makhluk-Nya, atau bagi yang ingin bersyukur dengan hati, lisan dan anggota badannya untuk mencari rida Allah."
  }
]