[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan hamba-hamba Tuhan Yang Maha Pengasih yang shalih berjalan di muka bumi dengan tenang dan penuh kerendahan hati. Apabila orang-orang jahil lagi bodoh menyapa mereka dengan melancarkan gangguan, mereka menjawab orang-orang itu dengan ucapan yang baik-baik, dan membalas omongan mereka dengan ucapan-ucapan yang di dalamnya tidak terkandung unsur dosa dan tidak merespon orang jahil dengan tindakan jahilnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "63. \"Dan hamba-hamba Ar-Raḥmān (Allah yang Maha Penyayang) yang beriman ialah orang-orang yang berjalan di atas bumi dengan rendah hati dan penuh ketenangan. Apabila orang-orang jahil menyapa mereka dengan keburukan, mereka tidak membalasnya dengan kata-kata yang semisalnya, bahkan mereka hanya mengucapkan kata-kata baik yang dikenal oleh orang-orang jahil tersebut."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "63-64. Allah menjelaskan sifat-sifat hamba-Nya yang shalih dan memuji mereka sebagaimana yang disebutkan dalam 14 ayat ini: Mereka berjalan di muka bumi dengan tenang dan rendah hati, dan jika orang-orang fasik berlaku buruk terhadap mereka maka mereka akan berkata dengan perkataan yang jauh dari dosa karena mereka memiliki kesabaran. Dan mereka adalah orang-orang yang melewati malam mereka dengan shalat, berdiri dan sujud untuk Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "63. وَعِبَادُ الرَّحْمٰنِ الَّذِينَ يَمْشُونَ عَلَى الْأَرْضِ هَوْنًا (Dan hamba-hamba Tuhan yang Maha Penyayang itu (ialah) orang-orang yang berjalan di atas bumi dengan rendah hati) Makna (هون) adalah kelembutan dan ketenangan seseorang tanpa disertai kesombongan sedikitpun. وَإِذَا خَاطَبَهُمُ الْجٰهِلُونَ قَالُوا۟ سَلٰمًا(dan apabila orang-orang jahil menyapa mereka, mereka mengucapkan kata-kata (yang mengandung) keselamatan) Mereka bersabar atas gangguan yang mereka dapatkan dari orang-orang jahil dan kurang akal, sehingga mereka tidak ikut terjerumus dalam kebodohan orang-orang tersebut; serta mereka mengucapkan salam, namun bukan salam penghormatan, melainkan salam perpisahan yang tidak mengandung doa kebaikan atau keburukan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Dahulu al-Hasan al-Bashri tatkala membaca ayat : { ٱلَّذِينَ يَمْشُونَ عَلَى ٱلْأَرْضِ هَوْنًا } \"orang-orang yang berjalan di atas bumi dengan rendah hati\" beliau berkata : ini pujian di siang hari mereka, dan tatkala membaca : { وَٱلَّذِينَ يَبِيتُونَ لِرَبِّهِمْ سُجَّدًا وَقِيَٰمًا } \"Dan orang yang melalui malam hari dengan bersujud dan berdiri untuk Tuhan mereka.\" beliau berkata : ini pujian malam hari mereka. 2 ). Ketergelinciran ada dua macam : ketergelinciran kaki, dan ketergelinciran lisan, namun ada kecocokan diantara keduanya yang disebutkan dalam ayat : { وَعِبَادُ ٱلرَّحْمَٰنِ ٱلَّذِينَ يَمْشُونَ عَلَى ٱلْأَرْضِ هَوْنًا وَإِذَا خَاطَبَهُمُ ٱلْجَٰهِلُونَ قَالُوا۟ سَلَٰمًا } \"Dan hamba-hamba Tuhan yang Maha Penyayang itu (ialah) orang-orang yang berjalan di atas bumi dengan rendah hati dan apabila orang-orang jahil menyapa mereka, mereka mengucapkan kata-kata (yang mengandung) keselamatan.\""
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "63. Dan para hamba Allah itu adalah orang-orang yang berjalan di atas bumi dengan tenang dan mantab tanpa bersikap angkuh. Dan ketika orang-orang bodoh berbicara kepada mereka tentang sesuatu yang menyakiti mereka (hamba Allah), maka mereka akan berkata: “Semoga keselamatan (atasmu)”. itu adalah salam perpisahan yang tidak mengandung kebaikan dan keburukan, serta bukan salam penghormatan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Hamba-hamba Dzat Yang Maha Pengasih itu adalah orang-orang yang berjalan di atas bumi dengan rendah hati} dengan tenang, khidmat dan tunduk {dan apabila orang-orang bodoh menyapa mereka, mereka mengucapkan salam} membalas perkataan itu dengan perkataan yang tidak mengandung ucapan yang menyakiti dan dosa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "63 penghambaan kepada Allah itu ada dua; pertama, penghambaan kepada rububiyahNYa. Yang ini dimilki oleh semua manusia, baik yang Muslim maupun yang kafir, yang shalih dan yang jahat. Jadi mereka semua adalah hamba Allah yang diciptakan dan diatur; “tidak ada seorangpun di langit dan di bumi, melainkan pasti akan datang kepada Yang Maha pemurah sebagai seorang hamba,” (Maryam:93) Yang kedua, penghambaan kepada uluhiyahNya, peribadatan kepadaNYa dan rahmatNya. Ini adalah penghambaan para Nabi dan para waliNYa. Inilah yang dimaksud disini. Oleh karena itu, Allah mengimbuhkannya kepada namaNya,’ar-rahman,” sebagai isyarat bahwa mereka telah mencapai kepada kedudukan ini disebabkan rahmatNya. Kemudian Dia menjelaskan [bahwa] sifat-sifat mereka merupakan sifat yang paling sempurna dan karakter-karakter mereka merupakan karakter yang paling utama. Allah menyifati mereka (dengan ungkapan) bahwasannya mereka “berjalan di atas bumi dengan rendah hati,” maksudnya dengan tenang, merendahkan diri kepada Allah dan kepada manusia. Ini adalah pernyataan untuk sifat mereka, yaitu hikmat, tenang dan tawadhu’ (merendahkan diri) kepada Allah dan kepada hamba-hambaNya. “dan apabila orang-orang jahil menyapa mereka,” dengan sapaan jahil; ini berdasrkan bukti pengimbuhan kata kerja dan penyandarannya kepada sifat tersebut, “niscaya mereka mengucapkan kata-kata yang mengandung keselamatan,” maksudnya mereka menjawab sapaan mereka dengan sapaan yang selamat dari dosa didalamnya, dan mereka selamat dari balasan orang jahil dengan kejahilanya. Ini adalah pujian untuk mereka karena sikap santun mereka yang luar biasa, dan membalas orang yang jahat dengan kebaikan dan pemberian maaf terhadap si jahil, dan kematangan akal mereka yang telah mengantar mereka kepada tingkatan ini."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Furqan ayat 63: Selanjutnya Allah Subhaanahu wa Ta'aala menyebutkan banyaknya kebaikan-Nya, nikmat-Nya kepada hamba-hamba-Nya serta taufiq-Nya kepada mereka untuk beramal saleh sehingga mereka berusaha mencapai tempat-tempat tinggi di kamar-kamar surga. Ubudiyyah (penghambaan) terbagi menjadi dua: - Ubudiyyah kepada rububiyyah Allah, maka dalam hal ini semua manusia ikut di dalamnya, baik yang muslim maupun yang kafir, yang baik maupun yang jahat, semuanya adalah hamba Allah yang diatur-Nya. Allah Subhaanahu wa Ta'aala berfirman, “Tidak ada seorang pun di langit dan di bumi, kecuali akan datang kepada Tuhan yang Maha Pemurah selaku seorang hamba.” (Terj. Maryam: 93) - Ubudiyyah kepada uluhiyyah Allah, yaitu ibadah yang dilakukan para nabi dan para wali-Nya, dan penghambaan kepada uluhiyyah inilah yang dimaksud dalam ayat di atas. Oleh karena itulah, Allah hubungkan kata ‘ibaad” (hamba-hamba) kepada Ar Rahman sebagai isyarat bagi mereka, bahwa mereka memperoleh keadaan ini disebabkan rahmat-Nya. Dalam ayat ini dan selanjutnya, Allah Subhaanahu wa Ta'aala menyebutkan sifat-sifat mereka yang merupakan sifat yang sangat utama. Dia bertawadhu’ (berendah diri) kepada Allah dan berendah hati kepada makhluk-Nya. Ayat ini menerangkan sifat mereka, yaitu sopan, tenang, dan bertawadhu’. Yakni ucapan yang bersih dari dosa. Mereka memaafkan orang yang bodoh dan tidak mengucapkan kecuali yang baik. Mereka santun dan tidak membalas keburukan dengan keburukan, tetapi membalasnya dengan kebaikan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Furqan Ayat 63",
    "description": "Jika pada ayat-ayat yang lalu disebutkan sifat-sifat orang kafir yang tidak mau bersujud kepada Allah, pada ayat berikut ini disebutkan ciri dan sifat 'ib'durrahm'n atau para pengabdi Allah. Adapun hamba-hamba tuhan yang maha pengasih itu adalah orang-orang yang berjalan di bumi dengan rendah hati tidak dibuat-buat, tapi berjalan secara wajar, tidak menyombongkan diri, dalam sikap dan tindakan, karena dia tahu bahwa sikap itu tidak terpuji, akan mengakibatkan hal-hal yang negatif dalam pergaulan. Dan apabila orang-orang bodoh yang tidak tahu nilai-nilai sosial kemasyarakatan menyapa mereka dengan kata-kata yang menghina, atau kasar, mereka tidak membalasnya dengan ucapan yang semisal, namun dengan penuh sopan dan rendah hati mereka mengucapkan 'sal'm, ' yang berarti mudah-Mudahan kita berada dalam keselamatan, damai, dan sejahtera. Nabi Muhammad telah memberikan contoh sendiri, bahwa semakin dikasari, beliau semakin santun, arif dan bijaksana. 64. Sifat 'ib'durahman berikutnya adalah senantiasa salat malam, dan orang-orang yang menghabiskan atau menggunakan sebagian waktu malamnya terutama waktu sepertiga malam terakhir, untuk beribadah mendekatkan diri kepada tuhan mereka yang telah memelihara mereka dengan bersujud dan berdiri. Beribadah pada saat itu betul-betul mencerminkan keikhlasan, hati lebih khusyuk, lebih konsentrasi kepada sang khalik."
  }
]