[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan juga orang-orang yang banyak mengerjakan shalat malam dengan ikhlas kepada Tuhan mereka di dalamnya dan merendahkan diri kepadaNya dengan sujud dan berdiri."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "64. Dan (mereka itu) adalah orang yang melalui malam hari dalam keadaan bersujud dengan dahi-dahi mereka dan berdiri di atas kaki-kaki mereka untuk salat menyembah Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "64. وَالَّذِينَ يَبِيتُونَ لِرَبِّهِمْ سُجَّدًا وَقِيٰمًا (Dan orang yang melalui malam hari dengan bersujud dan berdiri untuk Tuhan mereka) Yakni mereka menjalani malam mereka dengan bersujud serta berdiri dalam shalat dan tahajjud mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "64. Dan orang-orang yang menghabiskan malamnya dengan bersujud kepada Allah dan mendirikan shalat tahajjud karena ibadah saat itu paling jauh dari riya’ dan membuat lebih khusyu’"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dan orang-orang yang bermalam untuk beribadah kepada Tuhan mereka} shalat kepada Tuhannya pada malam hari {dengan bersujud dan berdiri"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "64 “dan orang-orang yang melalui malam hari dengan bersujud dan berdiri untuk Rabb mereka,” maksudnya, mereka banyak melakukan shalat malam dengan ikhlas kepada Allah, menghinakan diri kepadaNYa, sebagaimana Allah berfirman, “lambung mereka jauh dari tempat tidurnya, sedang mereka berdoa kepada Rabbnya dengan rasa takut dan harap, dan mereka menafkahkan sebagian dari rizki yang Kami berikan kepada mereka. Seorangpun tidak mengetahui apa yang disembunyikan untuk mereka yaitu (bermacam-macam nikmat) yang menyedapkan pandangan mata sebagai balasan terhadap apa yang telah mereka kerjakan,”(as-sajdah:16-17)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Furqan ayat 64: Maksudnya orang-orang yang shalat tahajjud di malam hari semata-mata karena Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Furqan Ayat 64",
    "description": "Sifat 'ib'durahman berikutnya adalah senantiasa salat malam, dan orang-orang yang menghabiskan atau menggunakan sebagian waktu malamnya terutama waktu sepertiga malam terakhir, untuk beribadah mendekatkan diri kepada tuhan mereka yang telah memelihara mereka dengan bersujud dan berdiri. Beribadah pada saat itu betul-betul mencerminkan keikhlasan, hati lebih khusyuk, lebih konsentrasi kepada sang khalik. 65-66. Sifat berikutnya adalah takut akan siksaan api neraka: dan orang-orang yang berkata, 'ya tuhan kami, jauhkanlah azab jahanam yang sangat pedih itu dari kami, kami sangat takut, karena sesungguhnya azabnya itu membuat kebinasaan yang kekal. ' inilah kerugian yang sangat besar bagi kami. Apalah arti kehidupan ini jika pada akhirnya kami tersiksa, karena dosa-dosa kami. Sungguh, jahanam itu seburuk-buruk tempat menetap dan tempat kediaman. \"."
  }
]