[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "65-66. Dan juga orang-orang yang meskipun sudah bersungguh-sungguh dalam ibadah, mereka takut kepada Allah, lalu memohon kepadaNya agar menyelamatkan mereka dari siksaan Jahanam. Sesungguhnya siksaannya itu akan mengitari orang yang berhak mendapatkannya. Dan sesungguhnya Jahanam itu adalah seburuk-buruk tempat menetap dan tempat tinggal."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "66. Sesungguhnya Jahanam itu seburuk-buruk tempat menetap bagi yang menempatinya, dan sejelek-jelek tempat kediaman bagi yang mendiaminya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "66. إِنَّهَا سَآءَتْ مُسْتَقَرًّا وَمُقَامًا (Sesungguhnya jahannam itu seburuk-buruk tempat menetap dan tempat kediaman) Yakni seburuk-buruk tempat tinggal adalah neraka. Na’udzubillah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "66. Sesungguhnya neraka Jahannam adalah sejelek-jelek dan seburuk-buruk tempat tinggal. Kalimat tersebut adalah penjelas bagi doa sebelumnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya itu adalah tempat menetap dan kediaman yang paling buruk} tempat tinggal dan menetap"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "66 “sesungguhnya jahaman itu seburuk-buruknya tempat menetap dan tempat kediaman,” ini adalah ungkapan doa dari mereka dengan nada mengemis kepada Allah, sebagai penjelasan betapa butuhnya mereka kepadaNya, dan pernyataan bahwa mereka tidak mempunyai kemampuan untuk menanggung azab tersebut; dan agar mereka bisa mengingat kembali karunia Allah yang telah dilimpahkan kepada mereka. Sebab, sesungguhnya tindakan (Allah) menghilangkan kedahsyatan azab sesuai dengan (kadar) kedahsyatan dan kehebatannya sangatlah menyentuh (kalbu) dan rasa gembira meluap bila kedahsyatan azab itu dijauhkan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Furqan ayat 66: Ucapan ini mereka ucapkan karena tadharru’ (merendahkan diri) kepada Tuhan mereka, menjelaskan butuhnya mereka kepada Allah, dan bahwa mereka tidak sanggup memikul azab Allah serta agar mereka dapat mengingat nikmat-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Furqan Ayat 66",
    "description": "65-66. Sifat berikutnya adalah takut akan siksaan api neraka: dan orang-orang yang berkata, 'ya tuhan kami, jauhkanlah azab jahanam yang sangat pedih itu dari kami, kami sangat takut, karena sesungguhnya azabnya itu membuat kebinasaan yang kekal. ' inilah kerugian yang sangat besar bagi kami. Apalah arti kehidupan ini jika pada akhirnya kami tersiksa, karena dosa-dosa kami. Sungguh, jahanam itu seburuk-buruk tempat menetap dan tempat kediaman. \"67. Sifat berikutnya adalah tidak berlebih-lebihan dalam berinfak. Dan di antara sifat hamba-hamba tuhan yang maha pengasih adalah orang-orang yang apabila menginfakkan harta, mereka tidak berlebihan dengan menghambur-hamburkannya, karena perilaku seperti inilah yang dikehendaki setan dan tidak pula kikir yang menyebabkan dibenci oleh masyarakat, di antara keduanya secara wajar, inilah agama yang pertengah-an, moderat, seimbang antara kepentingan individu dan masyarakat."
  }
]