[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan juga orang-orang yang jika menginfakan sebagian dari kekayaan mereka, mereka tidak melampaui batas dalam memberi dan tidak kurang dalam infak itu. Infak mereka ditengah-tengah antara pemborosan dan kikir."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "67. Dan (mereka itu) orang-orang yang apabila membelanjakan harta, mereka tidak sampai mengeluarkannya secara berlebihan, dan tidak pula kikir saat membelajakannya dalam perkara wajib baik untuk diri mereka sendiri ataupun orang lain, maka pembelanjaan itu tengah-tengah antara sikap berlebihan dan kikir."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "67. وَالَّذِينَ إِذَآ أَنفَقُوا۟ لَمْ يُسْرِفُوا۟ وَلَمْ يَقْتُرُوا۟ (Dan orang-orang yang apabila membelanjakan (harta), mereka tidak berlebihan, dan tidak (pula) kikir) Makna (الإسراف) adalah melampaui batas akibat mengeluarkan harta terlalu banyak, meskipun ia mengeluarkan hartanya untuk hal yang dibolehkan. Makna (الإقتار) adalah sangat pelit dalam membelanjakan hartanya. وَكَانَ بَيْنَ ذٰلِكَ قَوَامًا (dan adalah (pembelanjaan itu) di tengah-tengah antara yang demikian) Makna (القوام) adalah pembelanjaan harta dengan kadar yang sesuai, yaitu dengan tidak membiarkan dirinya dan keluarganya kelaparan dan tidak memiliki pakaian dan sampai tercukupi kebutuhan pokoknya, dan ia dapat menambah dari hal itu jika Allah lebih meluaskan rezekinya, ia juga berinfak dan bersedekah, namun tetap menabung sebagian hartanya untuk kebutuhan mendadak."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "67. Dan orang-orang yang apabila membelanjakan harta, mereka tidak berlaku boros (boros adalah banyak berbelanja melebihi batas normal) dan tidak pelit (pelit adalah kikir dan terlalu membatasi belanja). Pembelanjaan mereka itu sedang-sedang saja, tidak lebih dan tidak kurang."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dan orang-orang yang apabila berinfak tidak berlebihan} tidak melampaui batas dalam berinfak sampai berbuat mubazir{dan tidak kikir} dan tidak mengurangi (jumlah) infak dari jumlah yang seharusnya dia berikan {pertengahan antara keduanya} seimbang dan pertengahan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "67 “dan orang-orang yang apabila membelanjakan,” yaitu nafkah yang wajib dan yang Sunnah, ”mereka tidak berlebih-lebihan,” tidak melebihi batas, sehingga akan berakibat akan termasuk dalam perbuatan tabdzir (menghambur-hambur), “dan tidak (pula) kikir,” sehingga mengakibatkan mereka bisa terjerumus kedalam sifat kikir dan pelit serta mengabaikan hak-hak yang wajib, “dan ia adalah,” maksudnya pembelanjaan itu, “antara yang demikian,” antara sikap yang berlebih-lebihan dengan sikap kikir, “di tengah-tengah,” mereka mengeluarkannya dalam hal-hal yang wajib, seperti zakat, kaffarat (bayar denda) dan berbagai belanja wajib dan dalam hal-hal yang pantas, dengan cara yang pantas pula tanpa menimbulkan bahaya bagi diri sendiri dan orang lain. Ini merupakan sikap keseimbangan dan kesedrhanaan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Furqan ayat 67: Baik nafkah wajib maupun sunat. Sampai melewati batas sehingga jatuh ke dalam pemborosan dan meremehkan hak yang wajib. Sehingga jatih ke dalam kebakhilan dan kekikiran. Mereka mengeluarkan dalam hal yang wajib, seperti zakat, kaffarat dan nafkah yang wajib dan dalam hal yang patut dikeluarkan namun tidak sampai menimbulkan madharrat baik bagi diri maupun orang lain. Ayat ini terdapat dalil yang memerintahkan untuk hidup hemat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Furqan Ayat 67",
    "description": "Sifat berikutnya adalah tidak berlebih-lebihan dalam berinfak. Dan di antara sifat hamba-hamba tuhan yang maha pengasih adalah orang-orang yang apabila menginfakkan harta, mereka tidak berlebihan dengan menghambur-hamburkannya, karena perilaku seperti inilah yang dikehendaki setan dan tidak pula kikir yang menyebabkan dibenci oleh masyarakat, di antara keduanya secara wajar, inilah agama yang pertengah-an, moderat, seimbang antara kepentingan individu dan masyarakat. 68. Sifat berikutnya adalah menghindarkan diri dari dosa-dosa besar. Dan orang-orang yang tidak mempersekutukan Allah dengan sembahan lain apa pun itu dan tidak membunuh orang yang diharamkan Allah, karena kehidupan itu sangatlah mahal, hanya Allah saja yang berhak mengakhiri kehidupan seseorang. Kecuali dengan alasan yang dibenar kan oleh syariat, seperti karena membunuh lagi, atau murtad atau berzina padahal dia sudah menikah, dan tidak berzina karena akan membawa dampak negatif yang sangat serius dalam kehidupan; dan barangsiapa melakukan demikian tigal hal itu, yaitu syirik, membunuh dan berzina niscaya dia mendapat hukuman yang berat. Hal itu karena sesuai dengan besarnya dampak yang ditimbulkan dari perilaku jelek tersebut."
  }
]