[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "7-8. Dan orang-orang Musyrik berkata, “Mengapa orang-orang ini yang mengaku-aku sebagai utusan Allah (maksud mereka adalah Muhammad) memakan makanan seperti kita dan berjalan-jalan dipasar untuk mencari penghidupan? Mengapa Allah tidak mengutus bersamanya satu malaikat yang mempersaksikan kebenarannya, atau turun kepadanya perbendaharaan harta dari langit atau ia memiliki kebun yang besar yang dia dapat makan dari buah-buahannya?” orang-orang zhalim yang mendustakan berkata, “Kalian, wahai kaum Mukminin, tidaklah mengikuti kecuali orang yang terkena pengaruh sihir yang merasuki akalnya. “"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Dan orang-orang musyrik yang mendustakan Nabi -ṣallallāhu 'alaihi wa sallam- itu berkata, \"Mengapa orang yang mengaku sebagai Rasul dari sisi Allah itu memakan makanan sebagaimana manusia lainnya, dan berjalan di pasar-pasar untuk mencari rezeki? Mengapa Allah tidak menurunkan bersamanya seorang Malaikat untuk menjadi pendampingnya, menemani dan menolongnya dalam memberikan peringatan?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "7-8. Orang-orang musyrik mengingkari kerasulan Rasulullah dengan berkata: “Mengapa rasul ini memakan makanan seperti kami dan pulang pergi ke pasar untuk memenuhi keburuhannya? Mengapa Allah tidak mengutus bersamanya seorang malaikat untuk memberi peringatan terhadap azab-Nya, atau dia mendapat harta yang melimpah dari langit, atau juga memiliki kebun yang dapat dia makan hasil panennya.” Dan orang-orang zalim itu juga berkata: “Tidaklah orang yang kalian ikuti itu melainkan orang yang akalnya telah terpengaruh sihir.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. وَقَالُوا۟ مَالِ هٰذَا الرَّسُولِ (Dan mereka berkata: “Mengapa rasul itu) Mereka memanggilnya dengan ‘rasul’ sebagai olokan dan ejekan baginya, sebab mereka sebenarnya mengingkari kerasulannya. يَأْكُلُ الطَّعَامَ وَيَمْشِى فِى الْأَسْوَاقِ ۙ( memakan makanan dan berjalan di pasar-pasar?) Yakni mengapa ia memakan makanan serta masuk ke pasar-pasar untuk mencari penghidupan seperti kami? Mereka menganggap rasul yang sebenarnya harus dari golongan malaikat yang tidak membutuhkan makanan dan pekerjaan. لَوْلَآ أُنزِلَ إِلَيْهِ مَلَكٌ فَيَكُونَ مَعَهُۥ نَذِيرًا (Mengapa tidak diturunkan kepadanya seorang malaikat agar malaikat itu memberikan peringatan bersamanya) Mereka meminta agar rasul ditemani oleh seorang malaikat yang membantu, membenarkan, dan bersaksi untuknya kerasulannya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Dari ayat ini dapat difahami bahwa metode blokade media sejak dahulu hingga sekarang lebih banyak bertujuan untuk melemahkan lawannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Dengan menyindir dan meremehkan, orang-orang musyrik itu berkata: “Apa yang terjadi dengan Rasul ini? Dia makan makanan sebagaimana yang kami makan dan seringkali ke pasar untuk mencari biaya hidupnya sebagaimana kami. Maka kenapa (Al-Qur’an) tidak untuk malaikat dan kenapa malaikat tidak menemaninya, sehingga bisa menjadi pemberi peringatan tentang azab Allah bersamanya dan membenarkannya? Sehingga kami bisa mengetahui kebenarannya”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata,“Mengapa Rasul ini memakan makanan dan berjalan di pasar-pasar. Mengapa tidak} mengapa tidak {diturunkan malaikat kepadanya sehingga malaikat itu memberikan peringatan bersama dia"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7 ini bagian dari celotehan kaum yang mendustakan Rasulullah, [yang dengannya] mereka mencela risalahnya, yaitu; mereka menolaknya dengan (mengatakan: ) kenapa dia (rasul itu) bukan seorang malaikat, atau seorang raja atau dibantu oleh malaikat, seraya berkata, ”mengapa Rasul ini,” maksudnya mengapa orang yang mengklaim sebagai rasul ini, sebagai ungakapan ejekan dan perolok-olokan mereka, “memakan makanan,” padahal ini adalah salah satu ciri manusia biasa. Kenapa dia bukan seorang malaikat yang tidak makan makanan dan tidak butuh kepada segala sesuatu yang dibutuhkan oleh manusia, “dan berjalan di pasar-pasar,” untuk berjual-beli. Ini semua, menurut klaim mereka tidak pantas terjadi pada orang yang menjadi rasul. Padahal Allah telah berfirman, ”dan kami tidak mengutus rasul-rasul sebelummu, melainkan mereka memakan makanan dan berjalan di pasar-pasar,” (QS. al-furqan:20) “mengapa tidak diturunkan kepadanya seorang malaikat,” maksudnya, kenapa dia tidak diturunkan bersama seorang malaikat yang membantu dan menolongnya, “agar malaikat itu memberi peringatan bersama-samanya,” menurut anggapan mereka, dia tidak cukup (memadai) untuk mengemban kerasulan, dan bukan pada taraf kemampuan dan kekuatannya untuk menjalankan tugas kerasulan itu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Furqan ayat 7: Ini di antara ucapan orang-orang yang mendustakan Rasulullah shallallahu 'alaihi wa sallam, di mana ucapan ini dimaksudkan untuk mengkritik kerasulan Beliau, mereka mengatakan, “Mengapa rasul itu tidak seorang malaikat, atau seorang raja atau ada malaikat yang membantunya?” Ini termasuk sifat-sifat manusia, makan, minum dan butuh seperti yang dibutuhkan manusia lainnya, demikian juga pergi ke pasar untuk berjual-beli. Menurut mereka Rasul tidak pantas seperti itu, padahal Allah berfirman, “Dan Kami tidak mengutus rasul-rasul sebelummu, melainkan mereka sungguh memakan makanan dan berjalan di pasar-pasar, dan Kami jadikan sebagian kamu cobaan bagi sebagian yang lain. maukah kamu bersabar?; Dan Tuhanmu Maha Melihat.” (Terj. Al Furqan: 20) Lagi membenarkannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Furqan Ayat 7",
    "description": "Dan orang-orang kafir tidak merasa cukup dengan menuduh Al-Qur'an sebagai hasil karya nabi Muhammad. Mereka juga berkata, 'mengapa pria yang mengaku rasul ini memakan makanan dan berjalan di pasar-pasar untuk mencari rezeki seperti halnya kita' kalaulah rasul itu manusia, mengapa malaikat tidak diturunkan kepadanya agar malaikat itu memberikan peringatan bersama dia sehingga kita mengetahui kebenaran perkataannya, 8. Atau kalau hal itu pun tidak terpenuhi, mengapa tidak diturunkan kepadanya khazanah dari langit berupa harta kekayaan sehingga dia tidak perlu bersusah payah mencari rezeki, atau mengapa tidak ada kebun baginya sehingga dia dapat makan dari hasil-Nya dan tidak perlu lagi berpayah-payah bekerja'' demikian ucapan mereka yang sangat keterlaluan. Dan orang-orang zalim itu dengan lancangnya berkata, 'kamu, wahai para pengikut Muhammad, hanyalah mengikuti seorang laki-laki yang kena sihir. '."
  }
]