[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "68-71. Dan juga orang-orang yang mengesakan Allah, dan tidak menyeru dan tidak menyembah sesembahan selainNya, dan mereka tidak membunuh jiwa yang diharamkan Allah untuk dibunuh kecuali dengan alasan yang membolehkan jiwa dibunuh, seperti kafir setelah beriman, atau berzina setelah menikah, atau membunuh jiwa secara zhalim. Dan mereka juga tidak berzina, dan bisa menjaga kemaluan mereka kecuali terhadap istri-istri mereka atau budak perempuan yang mereka miliki. Barangsiapa melakukan sebagian dari dosa-dosa besar ini, niscaya akan menjumpai siksaan di akhirat kelak, siksaan dilipat gandakan baginya di akhirat, dan ia akan kekal di dalamnya dalam keadaan hina lagi rendah. (Ancaman kekal ini adalah bagi orang yang melakukan semuanya, atau bagi orang yang melakukan kesyirikan kepada Allah). Akan tetapi, orang yang bertaubat dari dosa-dosa tersebut dengan taubat nasuha (yang sesungguhnya), beriman dengan keimanan yang teguh lagi disertai dengan amal shalih, maka orang-orang itulah yang Allah akan menghapus kesalahan-kesalahan mereka dan menggantikannya dengan kebaikan-kebaikan, lantaran taubat dan penyesalan mereka. Dan Allah itu Maha Pengampun bagi orang yang bertaubat, Maha Pemurah terhadap hamba-hambaNya, karena Allah menyeru mereka untuk bertaubat setelah menentangnya dengan maksiat yang paling besar. Dan barangsiapa bertaubat dari dosa-dosa yang telah diperbuatnya dan beramal shalih, sesungguhnya dengan itu, ia telah kembali kepada Allah dengan cara yang benar, maka Allah menerima taubatnya dan mengugurkan dosa-dosanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "70. Akan tetapi orang-orang yang bertobat kepada Allah, beriman kepada-Nya, dan mengerjakan amal saleh yang menunjukkan kejujuran tobatnya; maka Allah akan mengganti kejahatan yang mereka kerjakan dengan kebajikan. Dan Allah Maha Pengampun atas dosa-dosa orang yang bertobat dari kalangan hamba-hamba-Nya, lagi Maha Penyayang terhadap mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "70. إِلَّا مَن تَابَ وَءَامَنَ وَعَمِلَ عَمَلًا صٰلِحًا (uali orang-orang yang bertaubat, beriman dan mengerjakan amal saleh) Maka mereka tidak mendapatkan azab. فَأُو۟لٰٓئِكَ يُبَدِّلُ اللهُ سَيِّـَٔاتِهِمْ حَسَنٰتٍ ۗ( maka itu kejahatan mereka diganti Allah dengan kebajikan) Ibnu Abbas berkata: mereka adalah orang-orang beriman. Mereka melakukan banyak keburukan sebelum beriman, namun Allah tidak menginginkan itu dari mereka sehingga Dia menuntun mereka kepada kebaikan dan mengganti keburukan mereka menjadi kebaikan. Adapun penggantian itu di dunia adalah bahwa Allah mengganti kemusyrikan mereka dengan keimanan, keraguan dengan keikhlasan, dan menjauhkan mereka dari perbuatan keji, serta memudahkan mereka untuk beramal shaleh dan melakukan taubat yang benar. Ibnu Abbas juga berkata bahwa sebagian orang musyrik telah terbunuh dalam jumlah yang banyak, lalu sebagian mereka mendatangi Nabi Muhammad seraya berkata: sebenarnya apa yang kamu katakan dan kamu serukan adalah hal yang baik, andai saja kamu memberitahu kami bahwa apa yang telah kami lakukan ini terdapat kafarat (penghapus dosa)nya. Maka turunlah ayat والذين لا يدعون....الآية"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "70. Akan tetapi orang yang bertaubat dari dosa-dosanya di dunia, beriman kepada Allah dan rasulNya, dan mengerjakan apa yang diperintahkan Allah dan menjauhi apa yang dilarang, maka mereka itu amal buruknya akan diganti dengan amal shalih di akhirat, dengan dihapus kemaksiatannya dan diganti dengan ketaatan. Allah adalah Dzat yang Maha Pengampun lagi Maha Pengasih bagi hamba-hambaNya yang mau bertaubat dan berbuat baik. Imam Bukhari dan lainnya meriwayatkan dari Ibnu Abbas, Dia berkata: “Saat surah Al-Furqan ayat [68] {Walladziina Laa Uad’uuna …} diturunkan, orang-orang musyrik Mekah berkata: “Sungguh kami telah membunuh orang tanpa alasan yang benar, menyembah tuhan lain selain Allah, dan melakukan perbuatan keji.” Lalu turunlah ayat {Illa Man Taaba}”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kecuali orang yang bertaubat, beriman, dan beramal shalih. Maka Allah mengganti kejahatan mereka dengan kebaikan. Allah Maha Pengampun lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "70 “kecuali orang yang bertaubat,” dari kemaksiatan-kemaksiatan tersebut dan lain-lainnya, dengan cara meninggalkannya sama sekali saat itu juga, menyesali perbuatannya yang telah lalu, dan bertekad dengan sungguh-sungguh untuk tidak akan mengulangi kembali, “dan beriman” kepada Allah dengan iman yang benar yang menuntut untuk meninggalkan segala maksiat dan mengerjakan berbagai ketaatan, “dan mengerjakan amal shalih,” dari amal yang diperintahkan oleh asy-syari’ (Allah dan RasulNYa) bila diniatkan mengharapkan keridhaan Allah. “maka mereka itu kejahatan mereka diganti Allah dengan kebajikan,” maksudnya segala perbuatan dan perkataan mereka yang disiapkan untuk amal keburukan akan diganti, yaitu diganti dengan kebajikan-kebajikan. Maka syirik mereka berubah menjadi iman, kemaksiataan mereka diganti menjadi ketaatan, dan kejahatan-kejahtan yang sama yang pernah mereka lakukan diganti, kemudian ditumbuhkan bagi mereka satu taubat, inabat dan ketaatan untuk setiap dosa dari dosa-dosa tersebut. Yaitu diganti dengan kebajikan-kebajikan, sebagaimana tampak dari zahirnya ayat. Dalam hal ini ada sebuah hadits tentang seorang lelaki yang dihisab oleh Allah Karena sebagian dosa-dosanya, lalu dihitung dihadapannya, kemudian Allah mengganti untuk setiap dosa dengan satu kebajikan. Lalu orang itu berkata, ”Ya Rabbi, sesungguhnya aku mempunyai beberapa dosa lagi yang tidak aku lihat di sini.” Wallahu a’lam. “dan Allah Mahapengampun,” terhadap siapa saja yang bertaubat, Dia selalu mengampuni dosa besar, “lagi Mhapenyayang,” kepada hamba-hambaNya, di mana Dia mengajak mereka bertaubat setelah sebelumnya mereka menentangNya dengan dosa-dosa besar, lalu memberi mereka taufik untuk bertaubat, kemudian menerima taubat mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Furqan ayat 70: Imam Bukhari meriwayatkan dengan sanadnya yang sampai kepada Sa’id bin Jubair, ia berkata, “Abdurrahman bin Abzaa memerintahkan aku dengan mengatakan, “Bertanyalah kepada Ibnu Abbas tentang kedua ayat ini, apa perkara kedua (orang yang disebut dalam ayat tersebut)?” Yaitu ayat, “Dan janganlah kamu membunuh jiwa yang diharamkan Allah (membunuhnya), melainkan dengan suatu (alasan) yang benar…dst.” (Terj. Al Israa’: 33) dan ayat, “Dan barang siapa yang membunuh seorang mukmin dengan sengaja ...dst.” (Terj. An Nisaa’: 93) Maka aku bertanya kepada Ibnu Abbas, ia menjawab, “Ketika turun ayat yang ada dalam surah Al Furqan, orang-orang musyrik Mekah berkata, “Kami telah membunuh jiwa yang diharamkan Allah dan kami telah menyembah selain Allah serta mengerjakan perbuatan-perbuatan keji.” Maka Allah menurunkan ayat, “kecuali orang-orang yang bertobat…dst.” Adapun yang disebutkan dalam surah An Nisaa’ itu adalah seorang yang sudah mengenal Islam dan syariatnya, lalu ia melakukan pembunuhan, maka balasannya adalah neraka Jahanam, ia kekal di dalamnya.” Kemudian aku menyebutkanya kepada Mujahid, ia berkata, “Kecuali orang yang menyesali (perbuatannya).” Dari dosa-dosa tersebut dan lainnya, yaitu dengan berhenti melakukannya pada saat itu juga, menyesali perbuatan itu dan berniat keras untuk tidak mengulangi lagi. Kepada Allah dengan iman yang sahih yang menghendaki untuk meninggalkan maksiat dan mengerjakan ketaatan. Yakni amal yang diperintahkan syari’ (Allah dan Rasul-Nya) dengan ikhlas karena Allah. Dalam hal ini ada dua pendapat: Pendapat pertama, perbuatan mereka yang buruk diganti dengan perbuatan yang baik. Ibnu Abbas radhiyallahu anhuma berkata, “Mereka adalah kaum mukmin, di mana sebelum beriman, mereka berada di atas kejahatan, lalu Allah menjadikan mereka benci kepada kejahatan, maka Allah alihkan mereka kepada kebaikan, sehingga Allah merubah kejahatan mereka dengan kebaikan. Sa’id bin Jubair berkata, “Allah merubah penyembahan mereka kepada berhala menjadi menyembah kepada Ar Rahman, yang sebelumnya memerangi kaum muslimin menjadi memerangi orang-orang musyrik dan Allah merubah mereka yang sebelumnya menikahi wanita musyrikah menjadi menikahi wanita mukminah.” Al Hasan Al Basri berkata, “Allah merubah mereka yang sebelumnya amal buruk menjadi amal saleh, yang sebelumnya syirk menjadi ikhlas dan yang sebelumnya berbuat zina menjadi menikah, dan yang sebelumnya kafir menjadi muslim.” Pendapat kedua, keburukan yang telah berlalu itu berubah karena tobat nashuha, kembali kepada Allah dan ketaatan menjadi kebaikan. Bagi orang yang bertobat. Kepada hamba-hamba-Nya, di mana Dia mengajak mereka bertobat setelah mereka menghadapkan kepada-Nya dosa-dosa besar, lalu Dia memberi mereka taufik untuk bertobat dan menerima tobat itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Furqan Ayat 70",
    "description": "Betapa pun demikian, Allah yang maha pengasih dan penyayang terhadap makhluk-Nya, senantiasa membukakan pintu tobat-Nya. Ke-cuali orang-orang yang ketika masih hidup di dunia bertobat dengan tobat yang benar, dan beriman dan mengerjakan kebajikan, sebagai bukti akan kebenaran tobatnya seperti banyak melaksanakan salat, zikir, membaca Al-Qur'an, bersedekah, membantu mereka yang perlu dibantu dan kebajian lainnya. Maka kejahatan yakni dosa mereka yang telah mereka lakukan akan diganti Allah dengan kebaikan, yaitu dengan gemar melakukan ketaatan dan membeci kemaksiatan. Allah maha pengampun, maha penyayang bagi mereka yang ingin kembali lagi ke jalan yang benar. 71. Dan barangsiapa bertobat dengan hati yang ikhlas dan mengerjakan kebajikan, sebagai bukti pertobatannya, maka sesungguhnya dia bertobat kepada Allah dengan tobat yang sebenar-benarnya. Dia menyesal dengan penyesalan yang mendalam atas perbuatannya, mengakhiri perilaku buruknya dan berjanji tidak akan mengulangi lagi perbuatan itu. Inilah tobat yang akan diterima oleh Allah."
  }
]