[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "68-71. Dan juga orang-orang yang mengesakan Allah, dan tidak menyeru dan tidak menyembah sesembahan selainNya, dan mereka tidak membunuh jiwa yang diharamkan Allah untuk dibunuh kecuali dengan alasan yang membolehkan jiwa dibunuh, seperti kafir setelah beriman, atau berzina setelah menikah, atau membunuh jiwa secara zhalim. Dan mereka juga tidak berzina, dan bisa menjaga kemaluan mereka kecuali terhadap istri-istri mereka atau budak perempuan yang mereka miliki. Barangsiapa melakukan sebagian dari dosa-dosa besar ini, niscaya akan menjumpai siksaan di akhirat kelak, siksaan dilipat gandakan baginya di akhirat, dan ia akan kekal di dalamnya dalam keadaan hina lagi rendah. (Ancaman kekal ini adalah bagi orang yang melakukan semuanya, atau bagi orang yang melakukan kesyirikan kepada Allah). Akan tetapi, orang yang bertaubat dari dosa-dosa tersebut dengan taubat nasuha (yang sesungguhnya), beriman dengan keimanan yang teguh lagi disertai dengan amal shalih, maka orang-orang itulah yang Allah akan menghapus kesalahan-kesalahan mereka dan menggantikannya dengan kebaikan-kebaikan, lantaran taubat dan penyesalan mereka. Dan Allah itu Maha Pengampun bagi orang yang bertaubat, Maha Pemurah terhadap hamba-hambaNya, karena Allah menyeru mereka untuk bertaubat setelah menentangnya dengan maksiat yang paling besar. Dan barangsiapa bertaubat dari dosa-dosa yang telah diperbuatnya dan beramal shalih, sesungguhnya dengan itu, ia telah kembali kepada Allah dengan cara yang benar, maka Allah menerima taubatnya dan mengugurkan dosa-dosanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "71. Dan orang-orang yang bertobat kepada Allah dan membuktikan kejujuran tobatnya dengan mengerjakan amal saleh dan menjauhi maksiat, maka sesungguhnya tobatnya tersebut benar-benar akan diterima."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "71. Dan barangsiapa yang bertaubat dari kemaksiatan, kemudian melakukan amal shalih sebagai bukti taubatnya, maka dia telah bertaubat dengan pertaubatan yang diterima Allah, dan dia benar-benar telah kembali kepada Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "71. وَمَن تَابَ وَعَمِلَ صٰلِحًا فَإِنَّهُۥ يَتُوبُ إِلَى اللهِ مَتَابًا (Dan orang-orang yang bertaubat dan mengerjakan amal saleh, maka sesungguhnya dia bertaubat kepada Allah dengan taubat yang sebenar-benarnya) Yakni barangsiapa yang bertaubat dengan lisannya saja dan tidak menunjukkan bukti taubatnya dengan perbuatan maka taubat itu tidak berguna baginya. Sedangkan orang yang bertaubat dan membuktikan kebenaran taubatnya dengan amalan-amalan shalih maka taubat yang benar itulah yang akan diterima Allah, yaitu taubat yang sebenar-benarnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "71. Dan barangsiapa bertaubat dari perbuatan maksiat dan mengerjakan amal shalih yang diperintah dan menjauhi yang dilarang, maka sesungguhnya taubatnya itu diterima di sisi Allah dan akan kembali kepadaNya dengan benar, sempurna dan diridhai olehNya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Siapa saja yang bertaubat dan beramal shalih sesungguhnya dia bertaubat kepada Allah} kembali kepada Allah {dengan keadaan taubat yang sebenarnya} kembali dengan diridhai di sisi Allah SWT"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "71 “dan barangsiapa yang bertaubat dan mengerjakan amal shalih, maka sesungguhnya dia bertaubat kepada Allah dengan sebenar-benarnya,” maksudnya, maka hendaklah ia mengetahui bahwa taubatnya benar-benar berada pada puncak kesempurnaan, sebab ia merupakan sikap kembali pada jalan yang lurus yang dapat mengantarkan kepada Allah, yang merupakan inti dari kebahagiaan seseorang dan keberuntungannya. Maka hendaklah dia tulus dalam bertaubat, dan hendaklah dia memurnikannya drai segala noda tujuan rusak. Yang dimaksud dari ini semua adalah anjuran untuk menyempurnakan taubat dan melaksanakannya sebaik dan sesempurna mungkin, agar Dia menerima siapa saja yang bertaubat kepadaNya, kemudian membalasnya sesuai dengan kesempurnaan taubatnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Furqan ayat 71: Hendaknya dia mengetahui, bahwa tobatnya telah sempurna, karena ia telah kembali ke jalan yang menghubungkan kepada Allah, di mana jalan itu merupakan jalan kebahagiaan dan keberuntungan. Oleh karena itu, hendaknya ia ikhlas dalam tobat dan membersihkannya dari campuran maksud yang tidak baik. Kesimpulan ayat ini adalah dorongan untuk menyempurnakan tobat, melakukannya dengan cara yang paling utama dan agung agar Allah menyempurnakan pahalanya sesuai tingkat kesempurnaan tobatnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Furqan Ayat 71",
    "description": "Dan barangsiapa bertobat dengan hati yang ikhlas dan mengerjakan kebajikan, sebagai bukti pertobatannya, maka sesungguhnya dia bertobat kepada Allah dengan tobat yang sebenar-benarnya. Dia menyesal dengan penyesalan yang mendalam atas perbuatannya, mengakhiri perilaku buruknya dan berjanji tidak akan mengulangi lagi perbuatan itu. Inilah tobat yang akan diterima oleh Allah. 72. Dan sifat-sifat utama lainnya dari ibadurrahman adalah orang-orang yang tidak memberikan kesaksian palsu, yang sengaja dilakukan seseorang padahal dia tahu bahwa hal itu bohong belaka, dan apabila mereka bertemu, yakni berjumpa, dengan orang-orang yang mengerjakan perbuatan-perbuatan yang tidak berfaedah, baik perkataan ataupun berbuat-an yang sia-sia, mereka berlalu dengan menjaga kehormatan dirinya. Mereka tidak menghiraukannya dan tidak memedulikannya. Sebagai seorang muslim, setiap langkahnya harus membawa kemanfaatan bagi kehi-dupannya yang akan dibawa setelah dia meninggal."
  }
]