[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan juga orang-orang yang tidak memberikan persaksian dusta dan tidak menghadiri tempat-tempatnya, dan mereka apabila dengan tidak sengaja melewati orang-orang yang hanyut dalam kebatilan dan permainan, orang-orang itu melintasi mereka dengan berpaling dan mengingkari, dengan menjaga kehormatan diri dan tidak menyukai itu terjadi pada selain mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "72. Dan orang-orang yang tidak menghadiri hal-hal batil; seperti masuk ke tempat-tempat maksiat dan hiburan yang haram. Apabila mereka bertemu dengan orang-orang yang mengucapkan dan mengerjakan perbuatan yang sia-sia, mereka hanya melewatinya begitu saja sembari menjaga kehormatan diri mereka sendiri yaitu tidak berkumpul dan berbaur dengan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "72. Dan mereka tidak bersaksi dengan kesaksian bohong. Dan jika mereka melewati tempat-tempat orang-orang yang berbuat kebatilan secara tidak sengaja maka mereka menjauhkan diri darinya dan tidak ikut bersama orang-orang tersebut serta mengingkari perbuatan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "72. وَالَّذِينَ لَا يَشْهَدُونَ الزُّورَ (Dan orang-orang yang tidak memberikan persaksian palsu) Yakni mereka tidak memberi persaksian palsu, atau mendatangi dan mendatangi hal yang batil, dan termasuk hal yang batil adalah menghadiri acara-acara bid’ah sebab itu adalah bentuk pendustaan terhadap agama Allah dan bukan bagian dari agama-Nya. وَإِذَا مَرُّوا۟ بِاللَّغْوِ مَرُّوا۟ كِرَامًا (dan apabila mereka bertemu dengan (orang-orang) yang mengerjakan perbuatan-perbuatan yang tidak berfaedah, mereka lalui (saja) dengan menjaga kehormatan dirinya) Yakni mereka berpaling darinya. Makna (اللغو) adalah segala ucapan dan perbuatan yang tidak berguna. Mereka menjauhkan diri dan menghargai diirinya dengan tidak ikut masuk ke dalam hal yang tidak bermanfaat serta tidak berinteraksi dengan para pelakunya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Diantara bukti kematangan ilmu para salaf tentang kitab Allah seperti yang di naskahkan oleh mereka bahwasanya menghadiri hari-hari raya orang kafir termasuk persaksian palsu yang Allah puji hambaNya ketika mereka tidak menghadirinya, sebagaimana firman Allah: { وَالَّذِينَ لَا يَشْهَدُونَ الزُّورَ وَإِذَا مَرُّوا بِاللَّغْوِ مَرُّوا كِرَامًا } \"Dan orang-orang yang tidak memberikan persaksian palsu, dan apabila mereka bertemu dengan (orang-orang) yang mengerjakan perbuatan-perbuatan yang tidak berfaedah, mereka lalui (saja) dengan menjaga kehormatan dirinya.\" karena az-zuur adalah semua yang bathil dari perkataan dan perbuatan, maka apakah disadari oleh orang-orang yang menghadiri (dari kalangan muslim) hari raya orang kafir bahwa perkara itu adalah dosa dan merupakan sebuah kekurangan dalam ibadah mereka? 2 ). Betapa banyak majelis-majelis bathil ketika hari-hari raya itu digelar: Allah memuji hambaNya dalam al-Qur'an : { وَالَّذِينَ لَا يَشْهَدُونَ الزُّورَ } berkata al-'Allamah as-Sa'di tentang ayat ini, yakni : mereka menjauhi semua perkumpulan-perkumpulan yang terkandung di dalamnya perkataan-perkataan haram dan perbuatan-perbuatan haram, dan jika mereka tidak menyaksikannya maka lebih utama lagi jika mereka tidak memberi ucapan dan ikut serta di dalamnya. 3 ). { وَالَّذِينَ لَا يَشْهَدُونَ الزُّورَ } Banyak yang memaknai ayat ini hanya sebatas \"asy-syahadah bi az-zuur\" dan ini merupakan pemahaman yang kurang; karena makna yang terkandung lebih luas dan banyak cakupannya, karena setiap kemungkaran adalah az-Zuur, barangsiapa yang mengetahuinya da belum melaksanakannya tanpa udzur, maka dia telah kehilangan sebagian dari sifat \"hamba Allah yang maha pengasih\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "72. Dan orang-orang yang tidak melakukan saksi palsu dengan sengaja, tidak mendatangi tempat-tempat kebathilan karena menyaksikan itu sama seperti ikut serta, dan ketika bertemu dengan perbuatan sia-sia, yaitu setiap sesuatu yang sia-sia baik dalam ucapan maupun tindakan, maka mereka menjauhinya, maknanya mereka tidak mau mengerjakan perbuatan sia-sia dan ikut serta dengan orang yang mengerjakannya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dan orang-orang yang tidak memberikan kesaksian palsu} tidak bersaksi palsu {serta apabila mereka bertemu dengan (orang) yang berbuat sia-sia} setiap orang yang melakukan kesia-siaan dabik perkataan maupun perbuatan {mereka berlalu dengan menjaga kehormatannya} mereka berpaling darinya untuk menjaga kehormatan dirinya agar tidak terjerumus dan tersesat di dalamnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "72 “dan orang-orang yang tidak memberikan persaksian palsu,” maksudnya mereka tidak menghadiri kepalsuan, yaitu perkataan dan perbuatan yang diharamkan. Mereka menghindari majelis-majelis yang banyak mengandung perkataan-perkataan atau perbuatan-perbuatan yang diharamkan, seperti mempermasalhkan ayat-ayat Allah, dabat batil, menggunjing, memfitnah (adu domba), memaki, menuduh berbuat zina, memperolok-olok, lagu-lagu haram, minum khamar, alas-alas yang terbuat drai kain sutra, gambar-gambar dan lain-lain. Kalaulah mereka tidak menyaksikan kepalsuan, maka lebih utama lagi mereka tidak mengatakannya dan mengerjakannya. Kesaksian palsu masuk kedalam kategori ucapan palsu, dan masuk kedalam maksud ayat ini secara lebih utama. “dan apabila mereka bertemu dengan perbuatan-perbuatan yang tidak berfaidah,” yaitu pembicaraan yang tidak mengandung kebaikan dan faidah religi ataupun duniawi, seperti pembicaraan orang-orang yang dungu dan yang serupa dengannya, “mereka lalui (saja) dengan menjaga kehormatan dirinya,” maksudnya mereka mencegah diri mereka dan memuliakan dirinya dari tindakan ikut serta tenggelam di dalamnya (meskipun tidak mengandung dosa) tetapi ia merupakan tindakan bodoh yang mencemari kemanusiaan dan kewibawaan. Mereka menjaga kesucian diri mereka darinya. Dan pada FirmanNYa, “dan apabila mereka bertemu dengan perbuatan-perbuatan yang tidak berfaidah,” terdapat sebuah isyarat bahwa mereka tidak bermaksud menghadirinya ataupun mendengarkannya, akan tetapi hal itu terjadi saat bertemu secara kebetulan tanpa kesengajaan. Mereka memuliakan diri mereka darinya. 73 “dan orang-orang yang apabila diberi peringatan dengan ayat-ayat Rabb mereka,” yang mana Dia memerintahkan kepada mereka untuk mendengarnya dan menjadikannya sebagai pedoman, “mereka tidaklah menghadapinya sebagai orang-orang yang tuli dan buta,” maksudnya, mereka tidak meresponnya dengan sikap berpaling darinya, bersikap tuli untuk mendengarnya dan mengalihkan perhatian dan hrti drainya, seperti yang dilakukan oleh orang yang tidak beriman dan tidak membenarkannya. Sesungguhnya sikap mereka di saat mendengarnya adalah seperti yang difirmankan oleh Allah, \"Sesungguhnya orang-orang yang beriman dengan ayat-ayat kami, adalah orang-orang yang apabila diperingatkan dengan aayat-ayat (kami), niscaya mereka menyungkur sujud dan bertasbih serta memuji Rabbnya, sedang mereka tidak menyombongkan diri,” (as-sajdah:15) Mereka meresponnya dengan menerima ayat-ayat itu, rasa membutuhkannya, tunduk dan patuh kepadanya. Anda akan menjumpai mereka memiliki telinga yang peka dan hati yang sensitive, hingga iman mereka bertambah karenanya, makin sempurna keyakinannya karennaya, menimbulkan semangat pada diri mereka, dan mereka sangat riang dan berbahagia karenanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Furqan ayat 72: Ada pula yang menafsirkan dengan tidak menghadiri Az Zuur, yakni ucapan dan perbuatan yang haram. Oleh karena itu, mereka menjauhi semua majlis yang di dalamnya penuh dengan ucapan dan perbuatan yang haram, seperti mengolok-olok ayat-ayat Allah, perdebatan yang batil, ghibah (gosip), namimah (mengadu domba), mencaci-maki, qadzaf (menuduh zina), nyanyian yang haram, meminum khamr (arak), menghamparkan sutera, memajang gambar-gambar, dsb. Jika mereka tidak menghadiri Az Zuur, maka tentu mereka tidak mengucapkan dan melakukannya.Termasuk ucapan Az Zuur adalah persaksian palsu. Yakni tanpa ada maksud untuk menemuinya, akan tetapi bertemu secara tiba-tiba. Yakni tidak ada kebaikan atau faedahnya baik bagi agama maupun dunia seperti obrolan orang-orang bodoh. Mereka bersihkan diri mereka dari ikut masuk ke dalamnya meskipun tidak ada dosa di sana, namun hal itu mengurangi kehormatannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Furqan Ayat 72",
    "description": "Dan sifat-sifat utama lainnya dari ibadurrahman adalah orang-orang yang tidak memberikan kesaksian palsu, yang sengaja dilakukan seseorang padahal dia tahu bahwa hal itu bohong belaka, dan apabila mereka bertemu, yakni berjumpa, dengan orang-orang yang mengerjakan perbuatan-perbuatan yang tidak berfaedah, baik perkataan ataupun berbuat-an yang sia-sia, mereka berlalu dengan menjaga kehormatan dirinya. Mereka tidak menghiraukannya dan tidak memedulikannya. Sebagai seorang muslim, setiap langkahnya harus membawa kemanfaatan bagi kehi-dupannya yang akan dibawa setelah dia meninggal. 73. Dan sifat 'ib'durrahm'n berikutnya adalah orang-orang yang apabila diberi peringatan oleh Allah atau nabi-Nya dengan ayat-ayat tuhan mere-ka, mereka tidak bersikap sebagai orang-orang yang tuli dan buta, tapi mereka mendengar peringatan tersebut dengan penuh perhatian dan sikap yang penuh kepedulian."
  }
]