[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan juga orang-orang yang memohon kepada Allah dengan mengatakan, “wahai Tuhan Kami, anugerahkanlah kepada kami dari istri-istri kami dan anak-anak kami apa yang dapat menyejukkan pandangan mata kami yang disitu kami memperoleh kenyamanan hidup dan kebahagiaan, dan jadikanlah kami teladan baik yang diikuti oleh orang-orang yang bertakwa dalam kebaikan.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "74. Dan orang-orang yang berkata dalam berdoa kepada Rabb mereka, \"Wahai Rabb kami, anugerahkanlah kepada kami dari istri-istri dan anak-anak kami orang yang bisa menjadi penyejuk hati kami karena ketakwaan dan keistikamahannya di atas kebenaran, dan jadikanlah kami sebagai imam bagi orang-orang yang bertakwa dalam kebenaran, serta sebagai teladan bagi orang lain."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "74-76. Dan mereka berkata kepada Allah: “Ya Tuhan kami, karuniakanlah kepada kami pasangan dan anak-anak yang menyejukkan pandangan kami, dan jadikanlah kami sebagai teladan dalam kebaikan bagi orang-orang bertakwa.” Orang-orang yang memiliki derajat yang tinggi itu akan mendapat balasan berupa kedudukan yang paling tinggi di surga berkat kesabaran mereka dalam ketaatan dan menjauhi kemaksiatan. Para malaikat akan selalu mengucapkan salam kepada mereka. Mereka akan kekal di dalam kedudukan yang mulia itu, betapa indahnya kedudukan dan tempat mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "74. وَالَّذِينَ يَقُولُونَ رَبَّنَا هَبْ لَنَا مِنْ أَزْوٰجِنَا وَذُرِّيّٰتِنَا قُرَّةَ أَعْيُنٍ (Dan orang orang yang berkata: “Ya Tuhan kami, anugrahkanlah kepada kami isteri-isteri kami dan keturunan kami sebagai penyenang hati (kami)) Yakni jadikanlah mereka sebab kebahagiaan kami dengan taufik yang Engkau berikan kepada kami dan mereka dalam menjalankan ketaatan. وَاجْعَلْنَا لِلْمُتَّقِينَ إِمَامًا (dan jadikanlah kami imam bagi orang-orang yang bertakwa) Yakni jadikanlah kami sebagai suri tauladan dalam kebaikan. Ayat ini menunjukkan bahwa kepemimpinan dalam beragama adalah bagian dari hal yang wajib untuk kita harapkan, namun bukan untuk berbangga diri, akan tetapi agar dapat memberi manfaat yang besar bagi orang lain dan agar mendapatkan pahala yang besar."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Perhatikan isyarat al-Qur'an kepada hamba-hamba dzat yang maha penyayang agar mereka meninggikan cita-cita dalam berdoa, { وَٱجْعَلْنَا لِلْمُتَّقِينَ إِمَامًا } \"dan jadikanlah kami imam bagi orang-orang yang bertakwa.\" kemudian perhatikanlah bagaimana al-Qur'an memuji orang yang mengucapakan kalimat ini dalam doanya! maka bagaimana dengan ia yang benar-benar bertekad dalam meminta keyataan dari doanya ? kemudian sesungguhnya pujian kepada orang yang berdoa dengan kalimat itu adalah dalil bolehnya meminta agar hal itu benar terjadi, semoga ALlah menjadikan kita diantara imam-imam orang yang bertaqwa. 2 ). Jangan berkeinginan untuk hidup pada garis kehidupan; tapi hiduplah pada puncaknya sebagai panutan untuk orang-orang bertawa : { وَٱجْعَلْنَا لِلْمُتَّقِينَ إِمَامًا } \"dan jadikanlah kami imam bagi orang-orang yang bertakwa.\" 3 ). Coba untuk mentadaburi hubungan kalimat ayat ini : { وَٱجْعَلْنَا لِلْمُتَّقِينَ إِمَامًا } dengan kalimat yang sebelumnya; akan jelas terlihat bagimu hal berikut ini: [ 1 ] Bahwasanya baiknya hubungan suami-istri dan keturunannya adalah hal oenting untuk mewujudkan suatu kepemimpinan yang baik, karena mereka merasakan ketangan dan kedamaian; adalah hal yang mengantar terwujudnya cita-cita itu. [ 2 ] Bahwasana diantara sifat-sifat orang yang menjadi imam bagi orang-orang yang bertaqwa adalah : menjadikan istri dan keturunannya sebagai orang yang lebih berhak terhadap kepemimpinannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "74. Dan orang-orang yang berdoa dengan berkata: “Wahai Tuhan kami, anugerahkan kepada kami, isteri-isteri dan anak-anak kami sebagai penyejuk mata kami karena bahagia, atau sebagai penggembira jiwa kami dengan menuntun mereka menuju ketaatan, kebaikan dan keutamaan. Dan jadikanlah kami sebagai teladan dalam kebaikan” Ini adalah dalil tentang hukum memohon kepemimpinan yang berlandaskan agama guna mendirikan kewajiban kepemimpinannya, bukan untuk menyombongkan diri dengan kepemimpinan itu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dan orang-orang yang berkata,“Wahai Tuhan kami, anugerahkanlah kepada kami penyejuk mata dari pasangan dan keturunan kami} mata kami sejuk dengan keberadaan mereka {serta jadikanlah kami sebagai pemimpin bagi orang-orang yang bertakwa”} pemimpin yang bisa kami teladani dalam hal kebaikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "74 “dan orang-orang yang berkata ’Ya Rabb kami, anugerahkanlah kami istri-istri kami,” maksudnya, pendamping-pendamping kami, termasuk para sahabat, orang-orang terdekat, dan istri-istri, “dan keturunan kami sebagai penyenang hati,” maksudnya mata kami menjadi damai. Dan apabila kita meneliti lebih jauh keadaan dan ciri-ciri mereka, maka kita mengetahui bahwa diantara usaha keras mereka dan ketinggian martabat mereka [adalah bahwasannya mereka merasa tidak damai sebelum mata kepala mereka melihat keturunan mereka taat kepada Allah, berilmu lagi beramal. Demikianlah, sebagaimana doa ini adalah doa untuk istri-istri dan anak keturunan mereka. Ia juga merupakan doa untuk diri mereka sendiri, karena manfaatnya kembali kepada diri mereka sendiri. Oleh karenanya mereka menjadikan semua itu sebagai pemberian (anugerah) bagi mereka, seraya mengatakan, ”anugerahkanlah kepada kami.” Bahkan doa mereka kembali kepada manfaat bagi segenap kaum Muslimin. Sebab, dengan keshalihan orang-orang yang disebutkan di dalam doa, akan menjadi sebab bagi keshalihan kebanyakan orang-orang yang berhubungan dengan mereka dan (sebab untuk) mengambil manfaat drai mereka. “dan jadikanlah kami imam bagi orang-orang yang bertakwa.” Maksudnya, sampaikanlah kami, ya Tuhan kami, kepada derajat luhur ini, yaitu derajat orang-orang shadiqin dan derajat orang-orang yang sempurna dari kalangan hamba-hamba Allah yang shalih, yaitu derajat kepemimpinan di dalam agama, dan hingga mereka bisa menjadi teladan bagi orang-orang yang bertakwa dalam ucapan dan perbuatannya. Perbuatan-perbuatan mereka diteladani, ucapan-ucapan mereka menjadi kesejukan hati dan orang-orang shalih berjalan di belakangnya (mengikuti). Mereka memberi petunjuk dan masyarakatpun mendapat petunjuk. Sudah dimaklumi bahwa berdoa untuk mencapai sesuatu adalah merupakan doa untuk mencapai sesuatu yang tidak akan tercapai kecuali dengannya. Derajat kepemimpinan dalam agama ini tidak akan pernah dicapai kecuali dengan sabar dan keyakinan, sebagaimana Allah berfirman, “dan kami jadikan dari kalangan mereka itu pemimpin-pemimpin yang memberi petunjuk dengan perintah kami ketika mereka bersabar. Dan mereka meyakini ayat-ayat kami.” (as-sajdah:24) Doa tersebut mengharuskan adanya amal usaha dan kesabaran dalam menjalankan ketaatan kepada Allah dan dalam menjauhi kemaksiatan terhadapNya serta keputusan takdirNya yang menyakitkan hati, dan juga mengharuskan adanya ilmu yang memadai yang dapat mengantarkan orangnya kepada derajat al-yakin sebagai kebaikan yang sangat banyak dan karunia yang berlimpah, dan mengharuskan merek auntuk berada diatas setinggi mungkin dari derajat manusia lain, di bawah derajat para rasul."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Furqan ayat 74: Termasuk pula kawan-kawan kami. Yakni dengan melihat mereka taat kepada-Mu. Apabila kita memperhatikan keadaan dan sifat-sifat mereka (hamba-hamba Allah Yang Maha Pengasih), maka dapat kita ketahui, bahwa hati mereka tidak senang kecuali ketika melihat pasangan dan anak-anak mereka taat kepada Allah Subhaanahu wa Ta'aala. Doa mereka agar pasangan dan anak-anak mereka menjadi saleh sesungguhnya mendoakan untuk kebaikan mereka, karena manfaatnya kembalinya kepada mereka, bahkan kembalinya untuk manfaat kaum muslimin secara umum, karena dengan salehnya orang-orang yang disebutkan maka akan menjadi sebab salehnya orang yang bergaul dengan mereka dan dapat memperoleh manfaat darinya. Yakni pemimpin dalam kebaikan. Maksudnya, sampaikanlah kami ke derajat yang tinggi ini; derajat para shiddiqin dan insan kamil dari kalangan hamba Allah yang saleh, yaitu derajat imam (pemimpin) dalam agama dan menjadi panutan bagi orang-orang yang bertakwa, baik dalam perkataan maupun perbuatan mereka, di mana orang-orang yang baik berjalan di belakang mereka. Mereka memberi petunjuk lagi mendapat petunjuk. Sudah menjadi maklum, bahwa berdoa agar mencapai sesuatu berarti berdoa meminta agar diadakan sesuatu yang dapat meyempurnakannya, dan derajat imamah fiddin tidak akan sempurna kecuali dengan sabar dan yakin sebagaimana disebutkan dalam surah As Sajdah: 24. Doa agar dijadikan pemimpin bagi orang-orang yang bertakwa adalah doa yang menghendaki amal, bersabar di atas perintah Allah, bersabar menjauhi larangan Allah dan bersabar terhadap taqdir-Nya yang pedih. Demikian juga dibutuhkan ilmu yang sempurna yang dapat menyampaikan seseorang kepada derajat yakin. Dengan sabar dan yakin itulah mereka dapat berada pada derajat yang sangat tinggi setelah para nabi dan rasul. Oleh karena cita-cita mereka begitu tinggi dan tidak sekedar cita-cita, bahkan mereka melakukan sebab-sebabnya sambil berdoa kepada Allah, maka Allah Subhaanahu wa Ta'aala membalas mereka dengan kedudukan yang tinggi (ghurfah) di akhirat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Furqan Ayat 74",
    "description": "Dan sifat 'ib'durrahm'n berikutnya adalah orang-orang yang berkata yakni memanjatkan doa, 'ya tuhan kami, anugerahkanlah kepada kami pasangan kami yang menjadi pendamping kami dalam melaksanakan kehidupan ini dan anugerahkanlah juga kepada keturunan kami yang akan melanjutkan kehidupan diri kami sebagai penyenang hati kami, karena perbuatan mulia mereka, dan jadikanlah kami sebagai pemimpin dan panutan bagi orang-orang lain yang bertakwa. '75. Mereka itu yakni orang-orang yang memiliki sifat di atas, akan diberi balasan dengan tempat yang tinggi dalam surga, yang penuh dengan segala kenikmatan lahir maupun batin atas kesabaran mereka melaksanakan semua perintah Allah. Dan di sana mereka akan disambut oleh para malaikat penjaga surga dengan penghormatan yang agung layaknya pahlawan yang kembali dari medan perang dengan membawa kemenangan yang gilang gemilang dan sebagi penghormatan kepada mereka, para malaikat mengucapkan salam, keselamatan akan selalu bersama kalian, selama-lamanya."
  }
]