[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "75-76. Orang-orang yang memiliki sifat-sifat yang telah dikemukakan dari kalangan hamba-hamba ar-Rahman itu, mereka akan dibalas dengan balasan tempat tinggal tertinggi di surga, dengan rahmat Allah dan dikarenakan kesabaran mereka untuk taat. Dan mereka akan disambut di surga dengan penghormatan dan ucapan salam dari malaikat dan (menjumpai) kehidupan yang baik dan keselamatan dari berbagai gangguan, mereka kekal abadi di dalamnya tanpa ada kematian. Itu adalah sebaik-baik tempat menetap yang mereka diami dan tempat tinggal yang mereka huni. Mereka tidak mengharapkan pindah dari sana."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "75. Mereka yang memiliki karakter yang disebutkan di atas, adalah orang-orang yang dibalasi dengan kamar-kamar yang tinggi dalam surga Firdaus yang tertinggi, karena kesabaran mereka dalam ketaatan, dan di dalamnya mereka disambut oleh para Malaikat dengan penghormatan dan ucapan selamat, dan di dalamnya pula mereka diselamatkan dari berbagai bahaya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "75. أُو۟لٰٓئِكَ يُجْزَوْنَ الْغُرْفَةَ (Mereka itulah orang yang dibalasi dengan martabat yang tinggi (dalam surga)) Makna (الغرفة) adalah kedudukan, yakni kedudukan yang paling tinggi dan paling baik di surga. بِمَا صَبَرُوا۟( karena kesabaran mereka) Yakni berkat kesabaran mereka dalam memikul beratnya menjalankan agama. وَيُلَقَّوْنَ فِيهَا تَحِيَّةً وَسَلٰمًا(dan mereka disambut dengan penghormatan dan ucapan selamat di dalamnya) Yakni mereka saling memberi salam, dan Allah akan melimpahkan salam bagi mereka, begitu pula para malaikat akan memberi mereka salam dan mendoakan mereka agar mendapat keselamatan dari segala mara bahaya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Semua kemenangan yang agung ini, dan semua keberhasilan yang besar itu, menyuarakan tentang lintasan yang suram, dan menyuarakan tentang jarak yang begitu panjang, namun tidaklah apa yang telah dicapai oleh para pemenang itu melainkan apa yang telah mereka lalui { بِمَا صَبَرُوا۟ } \"karena kesabaran mereka\". 2 ). Coba fokuskan pandanganmu kepada akhlak dari sifat-sifat hamba Allah yang maha pengasih, dibuka dengan : { يَمْشُونَ عَلَى ٱلْأَرْضِ هَوْنًا وَإِذَا خَاطَبَهُمُ ٱلْجَٰهِلُونَ قَالُوا۟ سَلَٰمًا } \"berjalan di atas bumi dengan rendah hati dan apabila orang-orang jahil menyapa mereka, mereka mengucapkan kata-kata (yang mengandung) keselamatan.\" kemudian dilanjutkan dengan kebaikan dan keadilan mereka : { وَٱلَّذِينَ إِذَآ أَنفَقُوا۟ لَمْ يُسْرِفُوا۟ وَلَمْ يَقْتُرُوا۟ } \"Dan orang-orang yang apabila membelanjakan (harta), mereka tidak berlebihan, dan tidak (pula) kikir....,\" kemudian dilanjutkan dengan menyebutkan keteguhan mereka pada akhlak yang baik : { وَلَا يَقْتُلُونَ ٱلنَّفْسَ ٱلَّتِى حَرَّمَ ٱللَّهُ إِلَّا بِٱلْحَقِّ وَلَا يَزْنُونَ } \"dan tidak membunuh jiwa yang diharamkan Allah (membunuhnya) kecuali dengan (alasan) yang benar, dan tidak berzina...\" kemudian keselamatn mereka dari menyaksikan tempat-tempat berkumpulnya keburukan : { لَا يَشْهَدُونَ ٱلزُّورَ وَإِذَا مَرُّوا۟ بِٱللَّغْوِ مَرُّوا۟ كِرَامًا } \"tidak memberikan persaksian palsu, dan apabila mereka bertemu dengan (orang-orang) yang mengerjakan perbuatan-perbuatan yang tidak berfaedah, mereka lalui (saja) dengan menjaga kehormatan dirinya.\" mereka mengumpulkan prinsip-prinsip akhlak yang baik; maka mereka berhak atas { ٱلْغُرْفَةَ بِمَا صَبَرُوا۟ } \"martabat yang tinggi (dalam surga) karena kesabaran mereka\""
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "75. Hamba-hamba Allah yang digambarkan dengan sifat-sifat itu akan dibalas dengan setinggi-tinggi tempat di surga dan keutamaan-keutamaan di dalamnya sebagai sebab dari kesabaran mereka dalam menjalani ketaatan dan menjauhi kemaksiatan. Dalam derajat yang tinggi di surga, mereka akan diberi sambutan penghormatan dan ucapan selamat oleh malaikat. As-Salam adalah tafsir dari salam penghormatan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka itu akan diberi balasan} diberi imbalan {dengan tempat yang tinggi} tempat paling tinggi dan paling utama di surga {atas kesabaran mereka serta di sana mereka akan disambut dengan penghormatan dan salam} salam dari setiap penjuru"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "75-76 oleh karena cita-cita luhur dan keinginan-keinginan mereka tinggi (mulia), maka balasannya adalah dari jenis amal itu sendiri. Maka Allah membalas mereka dengan kedudukan-kedudukan tertinggi, seraya berfirman, ”mereka itulah orang yang dibalasi dengan martabat yang tinggi karena kesabaran mereka,” maksudnya, tingkatan-tingkatan yang tinggi dan tempat-tempat tinggal yang sangat unik yang penuh dengan segala hal yang disukai dan sedap dipandang mata. Hal itu disebabkan karena kesabaran mereka, maka mereka meraih apa yang semestinya mereka raih, sebagaimna Allah berfirman, “sedang malaikat-malaikat masuk ketempat-tempat mereka dari semua pintu (sambil mengucapkan),’salam sejahtera atasmu karena kesabaranmu.’ Maka alangkah baiknya tempat kesudahan itu.” (ar-ra’ad:23-24) Oleh Karena itu, di sini Dia berfirman, ”dan mereka disambut dengan penghormatan dan ucapan selamat di dalamnya,” dari tuhan mereka dan dari para malaikatNya yang mulia dan dari segala bagian mereka terhadap sebagian yang lain, dan mereka selamat dari segala yang dapat mencemarkan dan mengotori. Walhasil, sesungguhnya Allah telah menyifati mereka dengan hikmat, tenang, merendahkan diri kepadaNya dan kepada hamba-hambaNya, beretika baik, santun, berakhlak mulia, membalas sikap buruk mereka dengan perbuatan baik, qiyamul lail (shalat malam), ikhlas dalam melakukan qiyamul lail, takut akan api neraka, memohon kepada tuhan mereka agar diselamatkan drainya, mengeluarkan yang wajib dan yang Sunnah dalam nafkah (pembelanjaan harta), serta sederhana dalam membelanjakannya. Dan kalau mereka telah menjadi orang-orang yang sederhana di dalam berinfak, di mana kebiasaan yang berlaku adalah mengabaikan atau berlebihan, maka kesederhanaan mereka dan keseimbangan mereka pada masalah-masalah yang lain tentu lebih utama; dan selamat dari dosa-dosa besar, bersikap ikhlas kepada Allah di dalam beribadah kepadaNya, menjaga diri dari darah (jiwa yang tak berdosa) dan dari kehormatan, dan segera bertaubat di saat terjadinya perbuatan dosa itu, dan mereka tidak menghadiri majelis-majelis kemungkaran, kefasikan yang bersifat perkataan ataupun perbuatan, mereka menjaga diri mereka dari perkataan sia-sia dan perbuatan hina, yang tidak ada kebaikannya padanya. Semua itu mewasiatkan wibawa dan kemanusiaan mereka, kesempurnaan dan kesucian mereka dari segala perkataan dan perbuatan yang tak ternilai. Sesungguhnya mereka serius merespon ayat-ayat Allah dengan menerima dan memahami makna-maknanya, mengamalkannya dan bersungguh-sungguh di dalam menerapkan hukum-hukumnya, dan mereka selalu berdoa kepada Allah dengan doa yang paling sempurna di dalam doa yang sangat berguna bagi mereka dan berguna bagi kaum muslimin, karena keshalihan istri-istri mereka dan anak keturunan mereka. Konsekuensi dari itu semua adalah mereka berupaya keras di dalam mendidik, mengajar, menasihati dan membimbing mereka. Sebab, siapa saja yang serius untuk memperoleh sesuatu, pada dia berdoa kepada Allah untuknya, dia pasti berusaha mendapatkan sebab kualitasnya dan mereka berdoa kepada Allah untuk mencapai derajat tinggi yang mungkin bisa mereka capai, yaitu derajat kepemimpinan dan kejujuran. Sungguh demi Allah, betapa mulianya sifat-sifat tersebut, betapa tingginya cita-cita mereka, betapa agungnya harapan mereka dan betapa sucinya jiwa-jiwa itu, betapa bersihnya hati itu, betapa sucinya manusia-manusia pilihan itu, dan betapa bertakwanya para penghulu itu. Sungguh itu adalah karunia, nikmat, dan rahmat Allah terhadap mereka yang menjadikan mereka mulia, dan kelembutanNya yang telah mengantar mereka kepada derajat tertinggi ini. Sungguh termasuk karunia Allah terhadap hamba-hambaNYa adalah Dia menjelaskan sifat-sifat mereka, dan mengilustrasikan karakteristik mereka. Dia menjelaskan cita-cita luhur mereka dan menjelaskan pula pahala yang diperoleh agar mereka rindu (terpacu) untuk mengamalkan sifat-sifat tersebut, dan agar mereka mencurahkan segenap kemampuan untuk itu, dan agar mereka memohon kepada tuhan yang telah menganugerahkan semua itu kepada mereka dan yang telah memuliakan mereka, yaitu Tuhan yang karuniaNya ada pada setiap masa dan tempat, dan pada setiap saat (hendaklah dia memohon) agar Dia berkenan untuk menbimbing mereka sebagaimana telah membingbing mereka. Ya Allah, segala puji hanya untukMu, kepadaMu-lah tempat mengadu, Engkau-lah tempat meminta, dan kepadaMulah tempat memohon keselamatan; tidak ada daya dan tidak ada kekuatan kecuali dengan pertolonganMu. Kami sama sekali tidak mampu memberikan manfaat atau mudarat kepada diri kami, kami tidak kuasa melakukan kebaikan sebesar biji sawi pun jika Engkau tidak memudahkannya bagi kami, karena sesungguhnya kami sangat lemah lagi rapuh dari segala sisi. Kami bersaksi bahwasannya Engkau, jika Engkau serahkan kami kepada diri kami (walau hanya) sekejap mata, maka berarti Engkau telah menyerahkan kami kepada kelemahan, kerapuhan dan kesalahan. Maka kami tidak yakin, ya Rabb kami kecuali dengan rahamatMu, yang dengannya Engkau menciptakan kami, memberi kami rizki, Engkau karuniakan kami kepada kami berbagai kenikmatan yang nampak dan yang tidak tampak, Engkau jauhkan drai kami berbagai bencana. Maka belas kasihilah kami dengan rahmat yang membuat kami tidak butuh kepada rahmat selainMu. Sesungguhnya tidak akan sia-sia orang yang memohon dan berharap kepadaMu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Furqan ayat 75: Yakni kedudukan yang tinggi dan tempat-tempat yang indah; yang menghimpun semua yang disenangi dan sejuk dipandang oleh mata. Di atas ketaatan kepada Allah. Dari Tuhan mereka, dari para malaikat dan dari sesama mereka. Dalam ayat lain, Allah Subhaanahu wa Ta'aala berfirman, “(Yaitu) surga 'Adn yang mereka masuk ke dalamnya bersama-sama dengan orang-orang yang saleh dari bapak-bapaknya, istri-istrinya dan anak cucunya, sedang malaikat-malaikat masuk ke tempat-tempat mereka dari semua pintu;---(sambil mengucapkan), \"Salamun 'alaikum bima shabartum\" (salam atasmu karena kesabaranmu). Maka alangkah baiknya tempat kesudahan itu.” (Terj. Ar Ra’d: 23-24) Wal hasil, Allah Subhaanahu wa Ta'aala menyifati mereka dengan sikap sopan, tenang, tawadhu’ kepada Allah dan kepada hamba-hamba-Nya, adabnya baik, santun (tidak lekas marah), berakhlak mulia, memaafkan orang-orang yang jahil (bodoh), dan berpaling dari mereka, membalas perbuatan buruk mereka dengan perbuatan baik, melakukan qiyamullail, ikhlas dalam melakukannya, takut kepada neraka, bertadharru’ (merendahkan diri sambil berdoa) kepada Allah agar Dia menyelamatkan mereka darinya, mengeluarkan nafkah yang wajib dan yang sunat, berhemat dalam hal tersebut, selamat dari dosa-dosa besar, ikhlas dalam beribadah, tidak menzalimi darah dan kehormatan orang lain, segera bertobat jika terjadi sikap itu, tidak menghadiri majlis yang munkar dan kefasikan apalagi sampai melakukan, menjauhkan dirinya dari hal yang tidak berguna yang menunjukkan muru’ah (kesopanan) dan sempurnanya pribadi mereka, diri mereka jauh dari ucapan dan perbuatan yang hina, menyikapi ayat-ayat Allah dengan tunduk dan menerima, memahami maknanya dan mengamalkan serta berusaha mewujudkan hukum-hukumnya dan bahwa mereka berdoa dengan doa yang yang paling sempurna, di mana mereka mendapatkan manfaat darinya, demikian pula orang yang bersama mereka, dan kaum muslimin pun mendapatkan manfaat darinya, yaitu doa untuk kesalehan istri dan keturunan mereka, di mana termasuk ke dalamnya adalah berusaha mengajarkan agama kepada mereka dan menasehati mereka, karena orang yang berusaha terhadap sesuatu dan berdoa kepada Allah tentu mengerjakan sebab-sebabnya, dan bahwa mereka berdoa kepada Allah agar mencapai derajat yang tinggi yang mereka mampu, yaitu derajat imamah fiddin (pemimpin dalam agama atau shiddiiqiyyah). Allah mempunyai nikmat yang besar kepada hamba-hamba-Nya, Dia menerangkan sifat-sifat mereka, perbuatan mereka dan cita-cita mereka serta menerangkan pahala yang akan diberikan-Nya kepada mereka agar hamba-hamba-Nya ingin memiliki sifat tersebut, mengerahkan kemampuannya untuk itu, dan agar mereka meminta kepada Allah yang mengaruniakan nikmat tersebut, di mana karunia-Nya ada di setiap waktu dan tempat, Dia menunjuki mereka sebagaimana Dia telah memberi hidayah, serta mendidiknya dengan pendidikan khusus sebagaimana Dia telah mengurus mereka. Ya Allah, untuk-Mulah segala puji, kepada-Mu kami mengadu dan kepada Engkaulah kami meminta pertolongan dan bantuan. Tidak ada daya dan upaya melainkan dengan pertolongan-Mu. Kami tidak kuasa memberi manfaat bagi diri kami, demikian pula menimpakan madharrat, dan kami tidak sanggup melakukan satu kebaikan pun jika Engkau tidak memudahkannya, karena sesungguhnya kami adalah lemah dari berbagai sisi. Kami bersaksi, jika Engkau menyerahkan kami kepada diri kami meskipun sekejap mata, maka sesungguhnya Engkau telah menyerahkan kami kepada kelemahan, kekurangan dan kesalahan. Oleh karena itu, kami tidak percaya selain kepada rahmat-Mu yang dengannya Engkau telah menciptakan kami dan memberi kami rezeki serta mengaruniakan kepada kami berbagai nikmat dan menghindarkan bencana dari kami. Rahmatilah kami dengan rahmat yang mencukupkan kami dari rahmat selain-Mu, sehingga tidak akan kecewa orang yang meminta dan berharap kepada-Mu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Furqan Ayat 75",
    "description": "Mereka itu yakni orang-orang yang memiliki sifat di atas, akan diberi balasan dengan tempat yang tinggi dalam surga, yang penuh dengan segala kenikmatan lahir maupun batin atas kesabaran mereka melaksanakan semua perintah Allah. Dan di sana mereka akan disambut oleh para malaikat penjaga surga dengan penghormatan yang agung layaknya pahlawan yang kembali dari medan perang dengan membawa kemenangan yang gilang gemilang dan sebagi penghormatan kepada mereka, para malaikat mengucapkan salam, keselamatan akan selalu bersama kalian, selama-lamanya. 76. Di dalam surga, mereka kekal di dalamnya selama-lamanya. Surga itu sebaik-baik tempat menetap dan tempat kediaman. Di dalamnya penuh dengan segala kenikmatan lahir dan batin. Inilah penghargaan dari Allah kepada hamba yang taat kepada-Nya ketika hidup di dunia."
  }
]