[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "75-76. Orang-orang yang memiliki sifat-sifat yang telah dikemukakan dari kalangan hamba-hamba ar-Rahman itu, mereka akan dibalas dengan balasan tempat tinggal tertinggi di surga, dengan rahmat Allah dan dikarenakan kesabaran mereka untuk taat. Dan mereka akan disambut di surga dengan penghormatan dan ucapan salam dari malaikat dan (menjumpai) kehidupan yang baik dan keselamatan dari berbagai gangguan, mereka kekal abadi di dalamnya tanpa ada kematian. Itu adalah sebaik-baik tempat menetap yang mereka diami dan tempat tinggal yang mereka huni. Mereka tidak mengharapkan pindah dari sana."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "76. Mereka kekal tinggal di dalamnya. Sungguh Surga itu sebaik-baik tempat tinggal dan tempat kediaman yang mereka tempati."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "76. خٰلِدِينَ فِيهَا ۚ (mereka kekal di dalamnya) Mereka tinggal di dalamnya tanpa pernah mati. حَسُنَتْ مُسْتَقَرًّا وَمُقَامًا (Surga itu sebaik-baik tempat menetap dan tempat kediaman) Yakni tempat di surga itu adalah sebaik-baik tempat untuk ditinggali. Ini merupakan kebalikan dari firman-Nya ساءت مستقرا ومقاما “seburuk-buruk tempat menetap dan tempat kediaman”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "76. Mereka kekal di dalamnya. Surga adalah sebaik-baik tempat tinggal. Sesungguhnya kenikmatan (di surga) itu kekal, tidak akan berkurang sepanjang waktu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka kekal di dalamnya. Sebaik-baik tempat menetap dan kediaman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "75-76 oleh karena cita-cita luhur dan keinginan-keinginan mereka tinggi (mulia), maka balasannya adalah dari jenis amal itu sendiri. Maka Allah membalas mereka dengan kedudukan-kedudukan tertinggi, seraya berfirman, ”mereka itulah orang yang dibalasi dengan martabat yang tinggi karena kesabaran mereka,” maksudnya, tingkatan-tingkatan yang tinggi dan tempat-tempat tinggal yang sangat unik yang penuh dengan segala hal yang disukai dan sedap dipandang mata. Hal itu disebabkan karena kesabaran mereka, maka mereka meraih apa yang semestinya mereka raih, sebagaimna Allah berfirman, “sedang malaikat-malaikat masuk ketempat-tempat mereka dari semua pintu (sambil mengucapkan),’salam sejahtera atasmu karena kesabaranmu.’ Maka alangkah baiknya tempat kesudahan itu.” (ar-ra’ad:23-24) Oleh Karena itu, di sini Dia berfirman, ”dan mereka disambut dengan penghormatan dan ucapan selamat di dalamnya,” dari tuhan mereka dan dari para malaikatNya yang mulia dan dari segala bagian mereka terhadap sebagian yang lain, dan mereka selamat dari segala yang dapat mencemarkan dan mengotori. Walhasil, sesungguhnya Allah telah menyifati mereka dengan hikmat, tenang, merendahkan diri kepadaNya dan kepada hamba-hambaNya, beretika baik, santun, berakhlak mulia, membalas sikap buruk mereka dengan perbuatan baik, qiyamul lail (shalat malam), ikhlas dalam melakukan qiyamul lail, takut akan api neraka, memohon kepada tuhan mereka agar diselamatkan drainya, mengeluarkan yang wajib dan yang Sunnah dalam nafkah (pembelanjaan harta), serta sederhana dalam membelanjakannya. Dan kalau mereka telah menjadi orang-orang yang sederhana di dalam berinfak, di mana kebiasaan yang berlaku adalah mengabaikan atau berlebihan, maka kesederhanaan mereka dan keseimbangan mereka pada masalah-masalah yang lain tentu lebih utama; dan selamat dari dosa-dosa besar, bersikap ikhlas kepada Allah di dalam beribadah kepadaNya, menjaga diri dari darah (jiwa yang tak berdosa) dan dari kehormatan, dan segera bertaubat di saat terjadinya perbuatan dosa itu, dan mereka tidak menghadiri majelis-majelis kemungkaran, kefasikan yang bersifat perkataan ataupun perbuatan, mereka menjaga diri mereka dari perkataan sia-sia dan perbuatan hina, yang tidak ada kebaikannya padanya. Semua itu mewasiatkan wibawa dan kemanusiaan mereka, kesempurnaan dan kesucian mereka dari segala perkataan dan perbuatan yang tak ternilai. Sesungguhnya mereka serius merespon ayat-ayat Allah dengan menerima dan memahami makna-maknanya, mengamalkannya dan bersungguh-sungguh di dalam menerapkan hukum-hukumnya, dan mereka selalu berdoa kepada Allah dengan doa yang paling sempurna di dalam doa yang sangat berguna bagi mereka dan berguna bagi kaum muslimin, karena keshalihan istri-istri mereka dan anak keturunan mereka. Konsekuensi dari itu semua adalah mereka berupaya keras di dalam mendidik, mengajar, menasihati dan membimbing mereka. Sebab, siapa saja yang serius untuk memperoleh sesuatu, pada dia berdoa kepada Allah untuknya, dia pasti berusaha mendapatkan sebab kualitasnya dan mereka berdoa kepada Allah untuk mencapai derajat tinggi yang mungkin bisa mereka capai, yaitu derajat kepemimpinan dan kejujuran. Sungguh demi Allah, betapa mulianya sifat-sifat tersebut, betapa tingginya cita-cita mereka, betapa agungnya harapan mereka dan betapa sucinya jiwa-jiwa itu, betapa bersihnya hati itu, betapa sucinya manusia-manusia pilihan itu, dan betapa bertakwanya para penghulu itu. Sungguh itu adalah karunia, nikmat, dan rahmat Allah terhadap mereka yang menjadikan mereka mulia, dan kelembutanNya yang telah mengantar mereka kepada derajat tertinggi ini. Sungguh termasuk karunia Allah terhadap hamba-hambaNYa adalah Dia menjelaskan sifat-sifat mereka, dan mengilustrasikan karakteristik mereka. Dia menjelaskan cita-cita luhur mereka dan menjelaskan pula pahala yang diperoleh agar mereka rindu (terpacu) untuk mengamalkan sifat-sifat tersebut, dan agar mereka mencurahkan segenap kemampuan untuk itu, dan agar mereka memohon kepada tuhan yang telah menganugerahkan semua itu kepada mereka dan yang telah memuliakan mereka, yaitu Tuhan yang karuniaNya ada pada setiap masa dan tempat, dan pada setiap saat (hendaklah dia memohon) agar Dia berkenan untuk menbimbing mereka sebagaimana telah membingbing mereka. Ya Allah, segala puji hanya untukMu, kepadaMu-lah tempat mengadu, Engkau-lah tempat meminta, dan kepadaMulah tempat memohon keselamatan; tidak ada daya dan tidak ada kekuatan kecuali dengan pertolonganMu. Kami sama sekali tidak mampu memberikan manfaat atau mudarat kepada diri kami, kami tidak kuasa melakukan kebaikan sebesar biji sawi pun jika Engkau tidak memudahkannya bagi kami, karena sesungguhnya kami sangat lemah lagi rapuh dari segala sisi. Kami bersaksi bahwasannya Engkau, jika Engkau serahkan kami kepada diri kami (walau hanya) sekejap mata, maka berarti Engkau telah menyerahkan kami kepada kelemahan, kerapuhan dan kesalahan. Maka kami tidak yakin, ya Rabb kami kecuali dengan rahamatMu, yang dengannya Engkau menciptakan kami, memberi kami rizki, Engkau karuniakan kami kepada kami berbagai kenikmatan yang nampak dan yang tidak tampak, Engkau jauhkan drai kami berbagai bencana. Maka belas kasihilah kami dengan rahmat yang membuat kami tidak butuh kepada rahmat selainMu. Sesungguhnya tidak akan sia-sia orang yang memohon dan berharap kepadaMu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Furqan Ayat 76",
    "description": "Di dalam surga, mereka kekal di dalamnya selama-lamanya. Surga itu sebaik-baik tempat menetap dan tempat kediaman. Di dalamnya penuh dengan segala kenikmatan lahir dan batin. Inilah penghargaan dari Allah kepada hamba yang taat kepada-Nya ketika hidup di dunia. 77. Pada akhir surah ini Allah menjelaskan tentang ke mahabesar dan mahakaya-Nya:katakanlah, wahai rasul, pada orang-orang musyrik itu, 'tuhanku tidak akan mengindahkan dan mempedulikan kamu, kalau tidak karena ibadahmu dan munajatmu kepada-Nya. Tetapi bagaimana kamu beribadah kepada-Nya, padahal sungguh, kamu telah mendustakan-Nya' mendustakan rasul-Nya dan adanya hari akhirat. Karena itu, kelak azab pasti menimpamu. '."
  }
]