[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah mengabarkan bahwa sesungguhnya Dia tidak peduli dan tidak mengindahkan manusia, kalau bukan karena doa mereka kepadaNya, baik doa ibadah maupun doa permohonan. Dan sungguh kalian (wahai orang-orang kafir) sikap mendustakan yang kalian lakukan akan berakibat pada siksaan yang mengikat kalian seperti orang-orang yang memiliki piutang kepada seseorang, dan akan membinasakan kalian di dunia dan akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "77. Katakanlah -wahai Rasul- kepada orang-orang kafir yang terus-menerus berada dalam kekafirannya, \"Rabbku tidaklah peduli pada kalian karena adanya manfaat ketaatan kalian yang kembali kepada-Nya. Kalaulah bukan karena ada hamba-hamba-Nya yang senantiasa berdoa kepada-Nya dengan doa ibadah dan doa permohonan, niscaya Dia tidak akan mengindahkan kalian. Sungguh kalian telah mendustakan Rasul terkait apa yang dia bawa untuk kalian dari sisi Rabb kalian. Karena itu, kelak balasan pendustaan kalian pasti akan senantiasa mengikuti kalian.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "77. Hai Rasulullah, katakanlah: “Tuhanku tidak peduli jika kalian tidak menyembah-Nya, karena kalian telah mendustakannya -hai orang-orang kafir-, kedustaan kalian itu akan selalu menyertai kalian dan menjadi sebab azab dan kebinasaan kalian di dunia dan di akhirat sebagai balasan yang kekal bagi kalian.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "77. قُلْ مَا يَعْبَؤُا۟ بِكُمْ رَبِّى لَوْلَا دُعَآؤُكُمْ ۖ (Katakanlah (kepada orang-orang musyrik): “Tuhanku tidak mengindahkan kamu, melainkan kalau ada ibadatmu) Yakni Allah tidak akan peduli kepada kalian jika saja kalian tidak berdoa dan menyembah kepada-Nya. فَقَدْ كَذَّبْتُمْ (padahal kamu sungguh telah mendustakan-Nya?) Yakni mendustai keesaan Allah. فَسَوْفَ يَكُونُ لِزَامًۢا (karena itu kelak (azab) pasti (menimpamu)”) Yakni balasan atas kedustaan kalian akan selalu menyertai kalian. Yang dimaksud adalah kekalahan orang-orang musyrik di perang badar. Pendapat lain mengatakan yang dimaksud adalah azab di akhirat."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Tatkala surat al-Frurqan ditutup dengan disebukannya beberapa sifat hamba Allah yang maha penyayang; pada muqoddimah dan penutup yang menunjukkan sifat-sifat mereka disebutkan dalam bentuk \"doa\" : { وَٱلَّذِينَ يَقُولُونَ رَبَّنَا ٱصْرِفْ عَنَّا عَذَابَ جَهَنَّمَ } \"Ya Tuhan kami, jauhkan azab jahannam dari kami,\" [al-Fruqon : 65], { رَبَّنَا هَبْ لَنَا مِنْ أَزْوَٰجِنَا وَذُرِّيَّٰتِنَا قُرَّةَ أَعْيُنٍ وَٱجْعَلْنَا لِلْمُتَّقِينَ إِمَامًا } \"Ya Tuhan kami, anugrahkanlah kepada kami isteri-isteri kami dan keturunan kami sebagai penyenang hati (kami), dan jadikanlah kami imam bagi orang-orang yang bertakwa.\" [ al-Furqon : 74 ], kemudian surah ini ditutup dengan menjelaskan keadaan siapa yang meninggalkan doa, dan bahwasanya tuhan tidak memperhatikan dan tidak peduli di lembah mana mereka akan binasa : { قُلْ مَا يَعْبَؤُا۟ بِكُمْ رَبِّى لَوْلَا دُعَآؤُكُمْ } \"Katakanlah (kepada orang-orang musyrik): “Tuhanku tidak mengindahkan kamu, melainkan kalau ada ibadatmu. (Tetapi bagaimana kamu beribadat kepada-Nya)\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "77. Wahai Rasulallah, katakanlah kepada seluruh manusia: “Tuhanku tidak akan memperhatikan kalian kalau bukan karena ibadah dan doa kalian kepadaNya (maksudnya yaitu Dia (Allah) tidak menciptakan mereka kecuali supaya mereka menyembahNya), namun bagaimana Dia akan memperhatikan dan mempedulikan kalian, sedangkan kalian telah mendustakan rasul dan Al-Qur’an? Maka azab dan balasan atas pendustaan kalian akan terus-menerus melekat pada kalian di akhirat.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Tuhanku tidak akan mengindahkan} tidak akan mengabaikan {kalian jika bukan karena ibadah kalian} ibadah dan permintaan kalian kepadaNya {Sungguh kalian telah mendustakanNya. Maka kelak (azab) pasti (menimpa kalian} azab pasti menimpa kalian"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "77 setelah Allah menisbatkan hamba-hamba tersebut kepada rahmatNya dan mengistimewakan mereka dengan (kriteria) ubudiyah karena kemuliaan dan keutamaan mereka, maka boleh jadi orang yang beranggapaan bahwa dirinya dan selain mereka (mendapatkan rahmat), lalu kenapa dia tidak masuk ke dalam kriteria ubudiyah? Maka Allah memberitakan bahwasannya Dia tidak menghiraukan dan tidak peduli kepada selain mereka; dan bahwa kalau saja bukan karena doa kalian kepadaNYa yang berupa doa ibadah dan doa permohonan, tentu Dia tidak menghiraukan kalian dan tentu Dia tidak mencintai kalian, seraya berfirman, ”katakanlah (kepada orang-orang musyrik), ’Rabbku tidak mengindahkanmu, kalau tidak karena ibadahmu (niscaya Dia tidak mengindahkanmu). (tetapi bagaimana kamu beribadah kepadaNya), sementara kamu sungguh telah mendustakanNYa? Karena itu kelak (azab) pasti (menimpamu)’.” Maksudnya, azab pasti menimpa kalian seperti pastinya (kewajiban membayar) bagi orang yang berhutang kepada yang berpiutang. Dan Allah pasti memberikan keputusan diantara kalian dan diantara hamba-hambaNya yang beriman."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Furqan ayat 77: Oleh karena Allah Subhaanahu wa Ta'aala telah menyandarkan sebagian hamba-hamba-Nya kepada rahmat-Nya dan mengkhususkan mereka dengan ibadah karena kemuliaan mereka, mungkin seseorang akan berkata, “Mengapa yang lain tidak dimasukkan pula dalam ubudiyyah seperti mereka?” Maka di ayat ini Allah Subhaanahu wa Ta'aala memberitahukan, bahwa Dia tidak peduli dengan selain mereka, dan bahwa seandainya tidak karena doa mereka kepada-Nya, baik doa ibadah maupun doa masalah, maka Dia tidak peduli dan tidak mencintai mereka. Yakni kepada-Nya di saat sulit, lalu Dia mengabulkannya. Maksudnya, azab di akhirat akan menimpamu setelah sebagiannya menimpamu di dunia (oleh karena itu, 70 orang di antara mereka terbunuh dalam perang Badar), dan Dia akan memberikan keputusan antara kamu dengan hamba-hamba-Nya yang mukmin. Selesai tafsir surah Al Furqan dengan pertolongan Allah dan taufiq-Nya, dan segala puji bagi Allah di awal dan akhirnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Furqan Ayat 77",
    "description": "Pada akhir surah ini Allah menjelaskan tentang ke mahabesar dan mahakaya-Nya:katakanlah, wahai rasul, pada orang-orang musyrik itu, 'tuhanku tidak akan mengindahkan dan mempedulikan kamu, kalau tidak karena ibadahmu dan munajatmu kepada-Nya. Tetapi bagaimana kamu beribadah kepada-Nya, padahal sungguh, kamu telah mendustakan-Nya' mendustakan rasul-Nya dan adanya hari akhirat. Karena itu, kelak azab pasti menimpamu. '1. '' s'n m'm. Nama-nama huruf yang dengannya Al-Qur'an tersusun. Susunan Al-Qur'an tidak mampu disaingi oleh manusia. Inilah yang menjadikan Al-Qur'an menjadi mukjizat sepanjang zaman."
  }
]