[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "7-8. Dan orang-orang Musyrik berkata, “Mengapa orang-orang ini yang mengaku-aku sebagai utusan Allah (maksud mereka adalah Muhammad) memakan makanan seperti kita dan berjalan-jalan dipasar untuk mencari penghidupan? Mengapa Allah tidak mengutus bersamanya satu malaikat yang mempersaksikan kebenarannya, atau turun kepadanya perbendaharaan harta dari langit atau ia memiliki kebun yang besar yang dia dapat makan dari buah-buahannya?” orang-orang zhalim yang mendustakan berkata, “Kalian, wahai kaum Mukminin, tidaklah mengikuti kecuali orang yang terkena pengaruh sihir yang merasuki akalnya. “"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Atau mengapa tidak diturunkan kepadanya perbendaharaan dari langit, atau mengapa dia tidak memiliki kebun yang dia bisa makan dari buah-buahannya, sehingga ia tidak perlu berjalan ke pasar-pasar dan mencari rezeki.\" Dan orang-orang yang zalim itu berkata, \"Kamu sekalian -wahai orang-orang mukmin- tidaklah mengikuti seorang Rasul, yang kalian ikuti itu tidak lain hanyalah seorang lelaki yang tidak waras akalnya karena terkena sihir\"."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. أَوْ يُلْقَىٰٓ إِلَيْهِ كَنزٌ (atau (mengapa tidak) diturunkan kepadanya perbendaharaan) Mereka mengusulkan agar rasul harus memiliki harta yang banyak yang diturunkan baginya dari langit agar ia tidak perlu lagi bekerja. أَوْ تَكُونُ لَهُۥ جَنَّةٌ يَأْكُلُ مِنْهَا ۚ( atau (mengapa tidak) ada kebun baginya, yang dia dapat makan dari (hasil)nya?”) Yakni kebun yang dapat ia makan hasilnya agar itu menjadi keunggulannya atas mereka. وَقَالَ الظّٰلِمُونَ إِن تَتَّبِعُونَ إِلَّا رَجُلًا مَّسْحُورًا (Dan orang-orang yang zalim itu berkata: “Kamu sekalian tidak lain hanyalah mengikuti seorang lelaki yang kena sihir”) Yakni orang yang akalnya terjangkit oleh sihir."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Dari ayat ini dapat difahami bahwa metode blokade media sejak dahulu hingga sekarang lebih banyak bertujuan untuk melemahkan lawannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8. Atau diberikan kepadanya harta dari langit, sehingga dia tidak perlu mencari rejeki, atau dia memiliki kebun-kebun yang dapat dia makan buah-buahannya. Orang-orang kafir juga berkata: “Kalian tidak lain hanya mengikuti seorang laki-laki yang akalnya dipenuhi dengan sihir, atau orang gila.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Atau diturunkan kepadanya harta kekayaan} atau diturunkan kepadanya perbendaharaan dari langit, sehingga dia tidak perlu bingung mencari sumber penghidupan {atau kebun baginya, sehingga dia dapat makan darinya”} kebun yang dia memakan buah-buahnya {Orang-orang zalim berkata,“Kalian tidak lain hanya mengikuti seorang laki-laki yang terkena sihir”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8 “atau (mengapa tidak) diturunkan kepadanya perbendaharaan,” maksudnya, harta yang berlimpah yang diperoleh tanpa susah payah, “ atau (mengapa tidak) ada kebun baginya, yang dia dapat makan dari (hasil)nya,” sehingga dengannya dia tidak perlu pergi ke pasar-pasar untuk mencari rizki. “dan orang-orang yang zhalim itu berkata,” yaitu mereka yang kezhalimannya telah menyeret mereka untuk mengatakan perkataan tersebut, tanpa ada ketidak jelasan kerancuan dari mereka, “kamu sekalian tidak lain hanyalah mengikuti seorang lelaki yang terkenal sihir,” demikian mereka mengatakan, padahal mereka sungguh benar-benar mengetahui kesempurnaan akalnya, indahnya tutur katanya, dan kebersihannya dari semua celaan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Furqan ayat 8: Dari langit sehingga tidak perlu berjalan ke pasar untuk memperoleh penghidupan. Sehingga tidak perlu pergi ke pasar untuk mencari rezeki. Kezaliman mereka membuat mereka mengatakan seperti itu, bukan karena samar. Padahal mereka mengetahui sempurnanya akalnya, baik bicaranya dan pribadinya yang selamat dari cacat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Furqan Ayat 8",
    "description": "Atau kalau hal itu pun tidak terpenuhi, mengapa tidak diturunkan kepadanya khazanah dari langit berupa harta kekayaan sehingga dia tidak perlu bersusah payah mencari rezeki, atau mengapa tidak ada kebun baginya sehingga dia dapat makan dari hasil-Nya dan tidak perlu lagi berpayah-payah bekerja'' demikian ucapan mereka yang sangat keterlaluan. Dan orang-orang zalim itu dengan lancangnya berkata, 'kamu, wahai para pengikut Muhammad, hanyalah mengikuti seorang laki-laki yang kena sihir. '9. Setelah memaparkan kesesatan dan kebodohan kaum kafir, Allah berfirman kepada nabi Muhammad, 'perhatikanlah bagaimana mereka membuat perumpamaan-perumpamaan tentang engkau; mereka menyebutmu penyair, pria yang terkena sihir, pesihir, dan lain-lain, maka se-satlah mereka dari jalan yang benar sehingga mereka tidak mendapatkan satu jalan pun yang masuk akal untuk menentang kerasulanmu."
  }
]