[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Lihatlah (wahai Rasul) bagaimana orang-orang yang mendustakan itu melontarkan ucapan-ucapan aneh tentang dirimu yang menyerupai perumpamaan-perumpamaan dalam keanehannya agar mereka bisa mencapai cara untuk mendustakanmu? Maka dengan itu mereka menjadi jauh dari kebenaran, sehingga tidak mendapatkan jalan menuju kepadanya untuk meluruskan apa yang telah mereka ucapkan tentangmu berupa kedustaan dan kebohongan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Perhatikanlah -wahai Rasul- agar engkau heran terhadap mereka; bagaimana mereka menyifatimu dengan sifat-sifat yang batil dengan menyatakan, engkau penyihir, engkau terkena sihir, engkau gila. Karena itu mereka tidak sanggup menempuh jalan kebenaran, dan tidak pula mendapatkan cara untuk mencela kejujuran dan amanahmu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "9. Hai Rasulullah, lihatlah bagaimana mereka berdusta terhadapmu dengan berbagai permisalan sehingga mereka tersesat dari jalan yang benar, dan tidak dapat mendapatkan jalan menuju hujjah yang benar."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. انظُرْ كَيْفَ ضَرَبُوا۟ لَكَ الْأَمْثٰلَ (Perhatikanlah, bagaimana mereka membuat perbandingan-perbandingan tentang kamu) Agar mereka dapat menggunakannya untuk mendustakanmu. Makna (الأمثال) adalah perkataan dan usulan-usulan yang aneh, dan itu adalah perkataan dan usulan yang telah disebutkan sebelumnya. فَضَلُّوا۟( lalu sesatlah mereka) Yakni sesat dari kebenaran. فَلَا يَسْتَطِيعُونَ سَبِيلًا(mereka tidak sanggup (mendapatkan) jalan) Yakni jalan untuk menentang kenabian rasul yang mulia ini."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ ٱنظُرْ كَيْفَ ضَرَبُوا۟ لَكَ ٱلْأَمْثَٰلَ فَضَلُّوا۟ فَلَا يَسْتَطِيعُونَ سَبِيلً } \"Perhatikanlah, bagaimana mereka membuat perbandingan-perbandingan tentang kamu, lalu sesatlah mereka, mereka tidak sanggup (mendapatkan) jalan (untuk menentang kerasulanmu)\". Yakni jalan hidayah, itu karena siapapun yang keluar dari kebenaran pasti akan tersesat kemanapun menghadap; karena keberanan yang pasti itu hanya satu, dan manhaj yang satu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9. Wahai Nabi, lihatlah orang-orang musyrik itu, bagaimana mereka mmbuat-buat kebohongan untukmu supaya mereka bisa mendustakanmu, lalu menggambarkanmu bahwa kamu adalah seorang penyihir, penyair atau orang gila (Al-Amtsal adalah keadaan dan ucapan yang asing). Kemudian dengan hal itu mereka tersesat dari hidayah dan kebenaran, dan mereka dibingungkan dalam kesesatan mereka sendiri, sehingga mereka tidak mendapatkan cara yang masuk akal untuk menghujat kenabianmu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Perhatikanlah bagaimana mereka membuat perumpamaan-perumpamaan tentangmu} mereka menyamakanmu dengan perumpamaan-perumpamaan, lalu mereka berkata, orang yang terkena sihir, orang yang butuh dan lain-lain {Maka sesatlah mereka. Mereka tidak sanggup (mendapatkan) jalan} sehingga mereka tidak mampu mendapati jalan yang mengantarkan kepada kebenaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9 oleh karena perkataan-perkataan yang berasal dari mereka itu sangat mengherankan sekali, maka Allah berfirman, ”perhatikanlah, bagaimana mereka membuat perumpamaan-perumpamaan tentang kamu,” yaitu: kenapa dia tidak menjadi seorang malaikat dan terhapus drainya semua ciri khas kemanusiaan, atau ada seorang malaikat bersamanya karena dia tidak sanggup menerima apa yang dia katakan, atau diturunkan untuknya harta kekayaan, atau dia diberi sepetak kebun yang mencukupinya hingga tidak perlu pergi kepasar, atau dia adalah seorang yang terkenal sihir. “lalu sesatlah mereka, sehingga mereka tidak sanggup [mendapatkan] jalan.” Mereka mengatakan perkataan-perkataan yang kontradiksi, semua merupakan kebodohan, kesesatan dan kepicikan, tidak ada secuil hidayah pun terkandung di dalamnya, bahkan tidak ada sedikitpun dari sebagian darinya suatu syubhat yang dapat mencemari kerasulan. Hanya dengan sekedar memperhatikan dan merenungkannya saja sudah pasti orang yang berakal memastikan kepalsuannya, dan cukuplah dia yang memberikan sanggahannya. Oleh karena itu, Allah memerintahkan untuk memperhatikan dan mencermatinya dan memikirkan, apakah perkataan mereka itu mengharuskan sikap abstain dari memastikan kerasulan dan kejujuran Rasulullah?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Furqan ayat 9: Yaitu perkataan mereka, “Mengapa rasul itu tidak malaikat, raja yang mempunyai kekayaan, tetapi malah manusia?” Demikian pula perkataan mereka, bahwa Beliau terkena sihir. Ucapan mereka penuh pertentangan, semuanya merupakan kebodohan, kedunguan dan kesesatan, tidak ada satu pun yang ada petunjuknya. Bahkan dengan memperhatikan sebentar saja sudah dapat diketahui kebatilannya dan yang demikian sudah cukup untuk membantahnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Furqan Ayat 9",
    "description": "Setelah memaparkan kesesatan dan kebodohan kaum kafir, Allah berfirman kepada nabi Muhammad, 'perhatikanlah bagaimana mereka membuat perumpamaan-perumpamaan tentang engkau; mereka menyebutmu penyair, pria yang terkena sihir, pesihir, dan lain-lain, maka se-satlah mereka dari jalan yang benar sehingga mereka tidak mendapatkan satu jalan pun yang masuk akal untuk menentang kerasulanmu. 10. Mahasuci Allah yang jika dia menghendaki, niscaya dia jadikan atau anugerahkan secara khusus bagimu sesuatu yang lebih baik daripada apa yang mereka usulkan itu, yaitu kebun-kebun atau surga-surga yang mengalir di bawahnya sungai-sungai, sehingga kebun itu tidak akan mengalami kekeringan, dan dia jadikan pula istana-istana yang besar dan megah untukmu."
  }
]