[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "10. Kami (para jin) tidak tahu apakah Allah hendak menurunkan keburukan kepada penduduk bumi atau Allah hendak menurunkan hidayah dan kebaikan kepada mereka?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Dan sesungguhnya kami tidak mengerti sebab penjagaan yang ketat ini, apakah keburukan yang dikehendaki bagi penduduk bumi ataukah Allah menghendaki kebaikan bagi mereka, kabar langit telah terputus dari kami."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "10. Sebelum kami mendengarkan bacaan al-Qur’an ini, kami tidak mengetahui apa yang menjadi sebab yang menjadi penghalang kami untuk mencuri kabar berita dari langit, sehingga kami menerka-nerka akan terjadinya keburukan bagi penduduk bumi atau terjadinya kebaikan yang Allah kehendaki bagi mereka; oleh sebab itu Allah menyiapkan berbagai sebab yang di antaranya adalah penjagaan ini."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. وَأَنَّا لَا نَدْرِىٓ أَشَرٌّ أُرِيدَ بِمَن فِى الْأَرْضِ (Dan sesungguhnya kami tidak mengetahui (dengan adanya penjagaan itu) apakah keburukan yang dikehendaki bagi orang yang di bumi) Akibat penjagaan di langit ini. أَمْ أَرَادَ بِهِمْ رَبُّهُمْ رَشَدًا (ataukah Tuhan mereka menghendaki kebaikan bagi mereka) Ibnu Zaid mengatakan, yakni Iblis berkata: “kami tidak mengetahui tujuan penjagaan ini apakah Allah akan menurunkan azab bagi penduduk bumi atau akan mengutus seorang rasul."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10.Kami para jin juga tidak mengetahui, apakah dengan adanya penjagaan semacam itu di langit Allah menginginkan keburukan bagi penduduk dunia, ataukah memang Dia menghendaki kebaikan dan kemaslahatan untuk penduduk bumi"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya kami tidak mengetahui apakah keburukan yang dikehendaki terhadap siapa saja yang ada di bumi ataukah Tuhan mereka menghendaki kebaikan terhadap mereka} kebaikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "10. Maksudnya, pasti ini atau itu yang akan terjadi karena mereka melihat adanya perubahan besar. Mereka mengetahui bahwa hal ini dikehendaki dan akan diberlakukan Allah di atas muka bumi dengan kepintaran mereka. Dalam ayat ini terdapat penjelasan tentang etika sopan santun mereka ketika menyandarkan kebaikan kepada Allah, sedangkan mereka tidak menyebutkan subyek keburukan sebagai wujud etika terhadap Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Jin ayat 10: Berkata para jin yang mendengar Al Qur’an : Sesungguhnya kami tidaklah mengetahui apakah penjaga yang tegas dan panah ini (yaitu bagi siapa yang mencoba mendengar berita dari langit), apakah ia adalah adzab yang Allah ingin timpakan kepada penghuni bumi ataukah sebagai tanda diutusnya utusan (Rasul) kepada mereka yang akan memberikan petunjuk dan menunjukkan kebenaran kepada mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni ini (keburukan) atau itu (kebaikan) yang akan terjadi. Hal itu, karena mereka melihat keadaan yang telah berubah yang mereka ingkari, maka mereka mengetahui dengan kecerdasan mereka bahwa perkara ini (kebaikan) adalah yang Allah inginkan untuk penduduk bumi. Dalam ayat ini terdapat penjelasan tentang adab mereka, karena mereka sandarkan kebaikan kepada Allah Subhaanahu wa Ta'aala dan terhadap keburukan, mereka hilangkan fa’ilnya/pelakunya karena beradab terhadap Allah Subhaanahu wa Ta'aala."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Jin Ayat 10",
    "description": "Perubahan yang terjadi sebelum dan sesudah diutusnya nabi Muhammad itu, tidak diketahui persis oleh para jin, maka mereka pun menegas'kan, \"dan sesungguhnya kami jin tidak mengetahui adanya penjagaan yang ketat itu apakah keburukan yang dikehendaki orang yang di bumi ataukah tuhan mereka menghendaki kebaikan baginya. \"11. Lebih jauh para jin itu menguraikan keadaan anggota masyarakat mereka dengan mengatakan, \"dan sesungguhnya di antara kami, kaum jin ada yang saleh yang bertakwa lagi mantap kesalehannya, dan ada pula kebalikannya yang tidak saleh bahkan durhaka dan mengajak kepada kedurhakaan. Kami menempuh jalan yang berbeda-beda akibat perbedaan pandangan dan kecenderungan kami."
  }
]