[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "11. Di antara kami ada jin-jin baik yang bertakwa, dan ada juga jin-jin yang tidak demikian, yaitu jin-jin yang kafir dan fasik. Kami terdiri dari kelompok-kelompok dan madzhab-madzhab yang beragam."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Dan bahwasanya di antara kami -golongan jin- ada yang bertakwa dan baik, dan ada yang kafir dan fasik. Kami terdiri dari golongan-golongan yang bermacam-macam dan mempunyai hasrat yang berbeda-beda."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "11. Sebelum kami mendapat hidayah dari al-Qur’an, kami terpecah belah menjadi banyak golongan; sebagian kami adalah orang yang baik, dan sebagian kami lebih rendah tingkat kebaikannya, dan sebagian lainnya adalah para pelaku dosa, kejahatan, kekafiran, dan kezaliman."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "11. وَأَنَّا مِنَّا الصّٰلِحُونَ (Dan sesungguhnya di antara kami ada orang-orang yang saleh) Sebagian jin berkata kepada sebagian lainnya setelah diseru untuk beriman kepada Muhammad: “setelah kami mendengarkan al-Qur’an, sebagian kami menjadi orang yang shalih. وَمِنَّا دُونَ ذٰلِكَ ۖ( dan di antara kami ada (pula) yang tidak demikian halnya) Yakni tidak mau beriman. كُنَّا طَرَآئِقَ قِدَدًا (kami menempuh jalan yang berbeda-beda) Yakni kami menjadi kelompok yang berbeda-beda dan golongan yang saling bertolak belakang. Said berkata; mereka ada yang Islam, Yahudi, Nasrani, dan Majusi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Sesungguhnya golongan kami para jin pun berbeda-beda dalam memilih jalan. Diantara kami juga ada golongan yang baik/ saleh dan muslim, namun juga ada yang ingkar atau kafir"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya di antara kami ada yang shalih dan di antara kami ada yang tidak demikian. Kami menempuh jalan yang berbeda-beda} kelompok yang berbeda dan keinginan yang bertentangan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11. ”Dan di antara kami ada orang-orang yang shalih dan di antara kami ada (pula) yang tidak demikian halnya,” yaitu jin-jin fasik, keji dan kafir. “kami menempuh jalan yang berbeda-beda dan keinginan yang beraneka ragam. Masing-masing bangga atas kelompoknya sendiri."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Jin ayat 11: Berkata para jin yang mendengar Al Qur’an : Dan di antara kami ada yang disifati dengan keshalihan dan di antara kami ada kaum yang tidak demikian, yaitu kafir dan fasiq. Dan sungguh keadaan kami sebelum turunnya Al Qur’an adalah segolongan yang beraneka ragam yang bermacam-macam. Setiap kaum memiliki cara tersendiri dalam beramal dan berkeyakinan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah mendengarkan Al Qur’an. Yakni yang fasik dan yang kafir. Ada yang muslim dan ada yang kafir."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Jin Ayat 11",
    "description": "Lebih jauh para jin itu menguraikan keadaan anggota masyarakat mereka dengan mengatakan, \"dan sesungguhnya di antara kami, kaum jin ada yang saleh yang bertakwa lagi mantap kesalehannya, dan ada pula kebalikannya yang tidak saleh bahkan durhaka dan mengajak kepada kedurhakaan. Kami menempuh jalan yang berbeda-beda akibat perbedaan pandangan dan kecenderungan kami. 12. \"dan sesungguhnya kami telah menduga dan percaya setelah berpikir dan mendengar ayat-ayat Allah dan menyadari kelemahan kami, bahwa kami tidak akan mampu melepaskan diri dari kekuasaan Allah di bumi dan tidak pula dapat lari melepaskan diri dari segala ketentuan dan ketetapan-Nya. \"."
  }
]