[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "13. Ketika kami mendengar al-Quran, kami beriman kepadanya, kami mengakuinya bahwa ia berasal dari sisi Allah. Maka barangsiapa beriman kepada Tuhannya, dia tidak takut kebaikannya akan dikurangi dan tidak takut kezhaliman dengan ditambahkannya keburukannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "13. Dan bahwasanya kami saat mendengarkan Al-Qur`ān yang menunjukkan kepada jalan yang lurus, kami mengimaninya. Maka barangsiapa beriman kepada Rabbnya niscaya ia tidak khawatir kebaikannya akan dikurangi dan tidak takut ditambahkan kepadanya dosa atas dosa-dosanya yang telah lalu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "13. Dan setelah kami mendengarkan al-Qur’an yang mengajak kepada kebaikan dan petunjuk, maka kami benar-benar beriman kepada Allah, rasul-Nya, dan kitab-Nya. Dan kami mengetahui Allah tidak akan menzalimi seorangpun yang beriman kepada-Nya, dan tidak akan membebani hamba-Nya di luar kemampuannya. Ayat ini menunjukkan bahwa tuntunan agama itu mudah dan semua akan mendapat balasan amalannya secara adil."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "13. فَمَن يُؤْمِنۢ بِرَبِّهِۦ فَلَا يَخَافُ بَخْسًا وَلَا رَهَقًا (Barangsiapa beriman kepada Tuhannya, maka ia tidak takut akan pengurangan pahala dan tidak (takut pula) akan penambahan dosa dan kesalahan) Makna (البخس) yakni pengurangan. Sedangkan (الرهق) yakni kezaliman."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13. Adapun jika kami mendengarkan ayat Alquran, maka kami meyakini dan membenarkan bahwa Alquran adalah kalam Allah. Siapa dari kami yang beriman bahwa Allah Maha Esa, maka mereka tidak akan takut akan berkurang kebaikannya sedikitpun, dan juga tidak akan takut jika kedzaliman ditambahkan bagi mereka. Albukhsu adalah berkurang, dan arrahaqu adalah kedhaliman dan tipu daya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya ketika mendengar petunjuk, kami beriman kepadanya. Maka, siapa yang beriman kepada Tuhannya tidak takut terhadap pengurangan} pengurangan dari kebaikannya {dan tidak (pula) akan kesulitan} tidak dizalimi yaitu tidak ditambah keburukannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "13. “Dan kami tatkala mendengarkan petunjuk (al-Quran) tersebut,” yakni al-Quran yang mulia yang menunjukkan ke jalan yang lurus, kami mengetahui petunjuknya, mempengaruhi hati kami dan kami beriman padanya. Selanjutnya para jin menyebutkan apa yang mendorong orang beriman, “Barangsiapa beriman kepada Rabbnya, maka ia tidak takut akan pengurangan pahala dan tidak (takut pula) akan penambahan dosa dan kesalahan,” yakni siapa pun yang beriman kepadaNya dengan benar, pahalanya tidak akan dikurangi dan tidak akan disakiti oleh apa pun. Ketika selamat dari keburukan, ia mendapatkan kebaikan. Iman adalah faktor yang mendorong untuk mendapatkan berbagai kebaikan dan menafikan segala keburukan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Jin ayat 13: Berkata para jin yang mendengar Al Qur’an : Sungguh kami telah yakin setelah beriman kepada Allah yang Maha Kuasa atas kami, dan bahwasanya kami terikat dengan-Nya dan kerajaan-Nya dimanapun kami berada. Dan tidak mungkin kami lolos dari adzab-Nya dan menyelamatkan diri dimana pun tempat dari tempat di muka bumi. Atau kami lari menuju ke langit jika kami ingin demikian, tapi sama saja (percuma)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya mereka menyebutkan sesuatu yang mendorong manusia melakukannya. Dengan iman yang sebenarnya. Seperti dikurangi kebaikannya. Seperti ditambah keburukannya. Ada pula yang mengartikan ‘rahaqaa’ dengan mendapatkan gangguan dan keburukan. Apabila seseorang selamat dari keburukan, maka ia akan memperoleh kebaikan. Dengan demikian, iman merupakan sebab untuk memperoleh semua kebaikan dan terhindar dari semua keburukan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Jin Ayat 13",
    "description": "Setelah berbicara tentang adanya siksa bagi yang durhaka, maka ayat ini berbicara tentang sekelompok jin yang beriman. \"dan sesungguhnya ketika kami mendengar petunjuk Al-Qur'an, kami beriman kepada-Nya tanpa ragu dan tanpa berpikir panjang, karena petunjuk dalam Al-Qur'an begitu jelas. Maka barang siapa beriman kepada tuhan dan selalu memperbarui keimanannya, maka tidak perlu ia takut rugi karena berkurang amalnya atau berdosa. \"14. Tidak semua jin durhaka begitu juga tidak semuanya beriman. Inilah yang ditegaskan pada ayat ini. \"dan di antara kami ada yang islam yang beriman dan patuh kepada Allah dan ada pula yang menyimpang dari kebenaran yang sangat mantap kedurhakaannya. Siapa yang islam patuh kepada Allah, maka mereka itu telah memilih jalan yang lurus yang akan mengantarkannya kepada kebahagiaan hidup dunia dan akhirat."
  }
]