[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "14-15. Dianta kami ada jin-jin yang tunduk lagi taat kepada Allah, dan ada juga jin-jin zhalim yang menyimpang dari jalan kebenaran. Barangsiapa masuk islam, tunduk dan patuh kepada Allah, maka mereka adalah orang-orang yang berjalan diatas jalan kebenaran dan memilihnya dengan sungguh-sungguh, maka Allah membimbing mereka kepadanya. Adapun orang-orang yang menyimpang dari jalan Islam, mereka adalah bahan bakar Neraka Jahanam’.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Dan di antara kami ada yang pasrah dan tunduk kepada Allah dengan taat, dan di antara kami ada yang melenceng dari jalan lurus. Barangsiapa tunduk kepada Allah dengan taat dan amal saleh maka mereka itulah orang-orang yang menuju petunjuk dan kebenaran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "14-15. Ayat yang mulia ini menunjukkan bahwa setelah dakwah Rasulullah sampai kepada para jin melalui sekelompok jin yang telah mendengar al-Qur’an, mereka terpecah menjadi dua golongan; golongan yang masuk Islam, memenuhi perintah Allah, dan beriman kepada-Nya setelah mereka mencari kebenaran yang dapat menyelamatkan mereka dari azab dan yang menghasilkan pahala jika diikuti. Sedangkan golongan lainnya adalah jin-jin yang berpaling dari kebenaran dan berpegang teguh pada kekafiran. Mereka layak mendapatkan azab atas perbuatan itu; dan mereka akan menjadi bahan bakar api neraka pada hari kiamat, sebagai balasan atas kekafiran dan kesesatan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "14. وَمِنَّا الْقٰسِطُونَ ۖ (dan ada (pula) orang-orang yang menyimpang dari kebenaran) Yakni orang-orang zalim yang melenceng dari kebenaran. فَمَنْ أَسْلَمَ فَأُو۟لٰٓئِكَ تَحَرَّوْا۟ رَشَدًا(Barangsiapa yang yang taat, maka mereka itu benar-benar telah memilih jalan yang lurus) Yakni menghendaki jalan kebenaran dan kebaikan serta bersungguh-sungguh dalam mendapatkannya sehingga mereka diberi taufik untuk itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14. Dari golongan kami ada yang beriman dan Islam yang menjalankan perintah Allah. Namun juga ada yang ingkar dan zalim dengan menyimpang dari jalan kebenaran yaitu jalan iman dan ketaatan. Barang siapa yang mengikuti perintah Allah maka mereka telah menempuh jalan kebenaran dan jalan penuh petunjuk"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya di antara kami ada yang muslim dan ada pula yang menyimpang} kafir {Siapa saja yang (memeluk) Islam maka telah memilih jalan yang benar} maka mereka memilih kebenaran dan kelurusan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "14. “Dan di antara kami ada orang-orang yang taat dan ada (pula) orang-orang yang menyimpang dari kebenaran,” yakni lalim dan menyimpang dari jalan yang haq, “barangsiapa yang taat, maka mereka itu benar-benar telah memilih jalan yang lurus,” artinya mereka menempuh jalan lurus yang menghantarkan mereka ke surga dengan segala kenikmatannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Jin ayat 14: 14-15. Mereka berkata (dari kalangan jin) : Sungguh kaum kami dari kalangan jin setelah mendengar Al Qur’an terbagi menjadi dua golongan, golongan pertama adalah yang masuk islam karena Allah dan tunduk dengan ketaatan pada-Nya, maka mereka adalah yang menempuh jalan yang mengantarkan mereka kepada kebahagiaan, dan mereka memiliki tujuan untuk selamat dari adzab Allah. Adapun (golongan kedua) yaitu yang mereka dzalim dan para pengingkar agama Allah, maka sungguh mereka akan dibakar di dalam neraka. Mereka di bakar di dalamnya, sebagaimana dibakarnya manusia karena sebab kekafirannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang menyampaikan mereka ke surga dan kenikmatannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Jin Ayat 14",
    "description": "Tidak semua jin durhaka begitu juga tidak semuanya beriman. Inilah yang ditegaskan pada ayat ini. \"dan di antara kami ada yang islam yang beriman dan patuh kepada Allah dan ada pula yang menyimpang dari kebenaran yang sangat mantap kedurhakaannya. Siapa yang islam patuh kepada Allah, maka mereka itu telah memilih jalan yang lurus yang akan mengantarkannya kepada kebahagiaan hidup dunia dan akhirat. 15. Jin yang kufur dan tidak bertobat dari kekufurannya maka akan mendapat azab yang pedih. Inilah yang ditegaskan pada ayat ini. \"dan adapun yang menyimpang dari kebenaran, maka mereka menjadi bahan bakar bagi neraka jahanam. '."
  }
]