[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "16-17. Bila orang-orang kafir dari kalangan jin dan manusia berjalan di atas jalan Islam dan tidak menyimpang darinya, niscaya Kami menurunkan kepada mereka hujan yang deras, dan Kami lapangkan rizki bagi mereka di dunia untuk menguji mereka, bagaimana mereka mensyukuri nikmat Allah kepada mereka? Barangsiapa berpaling dari Tuhannya dengan tidak menaatiNya, tidak mendengar dan merenungkan al-Quran, serta tidak mengamalkannya, niscaya Allah memasukannya ke dalam siksa yang besar dan berat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Dan sebagaimana Allah telah mewahyukan kepadaku bahwa sekelompok jin mendengarkanku, maka Allah juga mewahyukan seandainya jin dan manusia berjalan lurus di atas jalan Islam dan menjalankan apa yang ada dalam agama Islam, niscaya Allah memberikan kepada mereka air minum yang banyak dan berbagai macam kenikmatan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "16-17. Allah menyampaikan kepada para makhluk bahwa ketaatan jin dan manusia serta keistiqamahan mereka di atas jalan keimanan merupakan kunci kebaikan, karena Allah akan memberi mereka banyak keberkahan dari langit dan bumi sebagai balasan atas keimanan itu dan sebagai ujian bagi mereka; sehingga akan tampak orang yang benar-benar beriman dan yang hanya mengaku beriman. Adapun orang yang berpaling dari keimanan dan ketaatan kepada Allah, maka dia akan mendapat azab yang menyakitkan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "16. وَأَلَّوِ اسْتَقٰمُوا۟ عَلَى الطَّرِيقَةِ (Dan bahwasanya: jikalau mereka tetap berjalan lurus di atas jalan itu) Yakni dan diwahyukan kepadaku bahwa jika jin dan manusia teguh di atas agama Islam. لَأَسْقَيْنٰهُم مَّآءً غَدَقًا(benar-benar Kami akan memberi minum kepada mereka air yang segar) Yakni niscaya Allah akan memberi mereka minum dengan air yang melimpah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16. Jika sekiranya mereka tetap berpegang teguh dan beriman kepada jalan Islam, Kami (Allah) akan mencukupkan air yang melimpah kepada mereka. Maksudnya akan Kami limpahkan rizki kepada mereka, karena air adalah awal mula segala yang baik. Muqatil berkata bahwa ayat ini diturunkan ketika kaum Quraisy tidak mendapati hujan selama 7 tahun"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Seandainya mereka tetap berjalan lurus di atas jalan itu} jalan Islam {niscaya Kami akan mencurahkan air yang banyak} yang banyak"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "15-17. “Adapun orang-orang yang menyimpang dari kebenaran, maka mereka menjadi kayu (bahan bakar) bagi Neraka Jahanam.” Hal itu sebagai balasan atas amal perbuatan mereka dan bukan kezhaliman Allah, sebab sesungguhnya, “jikalau mereka tetap berjalan lurus di atas jalan itu (agama Islam), benar-benar Kami akan memberi minum kepada mereka air yang segar (rizki yang banyak),” yakni, lezat dan luas (banyak). Tidak ada yang menghalangi mereka dari hal itu selain kezhaliman dan permusuhan mereka. “Untuk Kami beri cobaan kepada mereka padanya,” yakni, agar Kami menguji mereka di dalamnya agar terlihat jelas siapa yang benar dan siapa yang berdusta. “Dan barangsiapa yang berpaling dari peringatan Rabbnya, niscaya akan dimasukkanNya ke dalam azab yang amat berat,” yakni barangsiapa yang berpaling dari peringatan Allah yaitu (yang tertuang dalam) KItabNya dan tidak mengikutinya, justru melalaikannya, niscaya Allah akan memasukkannya ke dalam siksaan yang amat berat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Jin ayat 16: 16-17. Seandainya kalian wahai orang-orang kafir mau istiqamah menempuh jalan yang padanya datang wahyu, maka sungguh Allah akan bukakan pintu-pintu rezeki kepada kalian, dan akan Allah luaskan dunia pada kalian; Untuk menguji kalian dengan nikmat ini dan Allah akan melihat siapa yang mengakui karunianya kemudian ia bersyukur kepada Allah. Dan barangsiapa yang melampaui batas maka di akan jatuh dalam cobaan dan celaka. Kemudian Allah mengabarkan, barangsiapa yang menolak Al Qur’an maka Allah akan timpakan adzab yang pedih. Allah menegaskan akan air dengan menyebutkannya karena air adalah sumber kehidupan yang tidak aka nada kehidupan kecuali dengannya. Allah berfirman : وَجَعَلْنَا مِنَ ٱلْمَآءِ كُلَّ شَىْءٍ حَىٍّ , yang artinya : Dan dari air Kami jadikan segala sesuatu yang hidup. {Al Anbiya : 30}."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": ""
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Jin Ayat 16",
    "description": "Sedangkan yang istikamah pada jalan kebenaran siapa pun dia termasuk para jin pasti akan mendapat balasan nikmat yang sempurna. \"dan sekiranya mereka tetap berjalan lurus di atas jalan itu yakni agama islam, niscaya kami akan mencurahkan kepada mereka air yang cukup dan berbagai rezeki yang melimpah. \"17. Dengan cara itu, tujuan pemberian rezeki adalah bahwa kami hendak menguji mereka, barang siapa lulus dari ujian itu dengan tetap patuh kepada Allah, maka akan mendapat kebahagiaan hidup di dunia dan akhirat. Dan barangsiapa berpaling dari peringatan tuhannya, niscaya akan dimasukkan-Nya ke dalam azab yang sangat berat."
  }
]