[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "18. Masjid-masjid didirikan untuk beribadah kepada Allah semata, maka jangan beribadah padanya kepada selain Allah. Ikhlaskanlah doa dan ibadah hanya untuk Allah, karena masjid tidak dibangun kecuali untuk beribadah kepada Allah semata bukan selainNya. Ayat ini mewajibkan menyucikan masjid dari segala urusan yang menodai keikhlasan kepada Allah dan ittiba’ keapada Rasulullah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Dan bahwasanya masjid-masjid itu hanya milik Allah semata, bukan milik selain-Nya, maka janganlah kalian menyeru seorang pun selain Allah di dalamnya sehingga kalian seperti orang-orang Yahudi dan Nasrani di sinagog dan gereja mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "18. Allah menyampaikan kepada para makhluk bahwa masjid-masjid dibangun untuk beribadah kepada Allah, mengagungkan dan menyebut nama-Nya; dan hendaklah tetap seperti itu, jangan sampai ada manusia yang mengubah tujuan ini, mengagungkan dan menyembah selain Allah, dan memuji para pelaku kebatilan dan dosa di dalamnya, serta para pemimpin yang zalim."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "18. وَأَنَّ الْمَسٰجِدَ لِلَّـهِ (Dan sesungguhnya mesjid-mesjid itu adalah kepunyaan Allah) Yakni dan diwahyukan kepadaku bahwa masjid-masjid hanya bagi Allah, dan bukan bagi berhala-berhala. فَلَا تَدْعُوا۟ مَعَ اللَّـهِ أَحَدًا(Maka janganlah kamu menyembah seseorangpun di dalamnya di samping (menyembah) Allah) Yakni janganlah kalian meminta kepada makhluk sesuatu yang tidak dapat dilakukan kecuali oleh Allah, sebab do’a termasuk ibadah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "18. Sesungguhnya masjid-masjid (tempat sholat) itu dikhususkan untuk menyembah Allah, maka jangan kalian gunakan untuk menyembah selain Allah. Diriwayatkan dari Ibnu Abi Hatim dari Ibnu Abbas, berkata: Jin berkata, wahai Rasul izinkanlah kami, maka kami akan bersaksi bersamamu untuk melaksanakan sholat di masjidmu. Sehingga Allah menurunkan ayat ini."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya masjid-masjid itu milik Allah. Maka janganlah menyembah apa pun bersamaan dengan Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "18. “Dan bahwasanya masjid-masjid itu adalah kepunyaan Allah. Maka janganlah kamu menyembah seseorang pun di dalamnya di samping (menyembah) Allah.” Yakni, tidak doa ibadah dan bukan pula doa permohonan karena masjid-masjid adalah tempat paling agung untuk beribadah yang dibangun di atas keikhlasan karena Allah semata serta tunduk pada keagungan dan keperkasaanNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Jin ayat 18: Allah mengabarkan bahwa masjid-masjid itu tempat untuk shalat dan bangunannya untuk beribadah kepada Allah dan mentauhidkan-Nya; Dan tidaklah di dalamnya di ibadahi selain Allah, dan tidak menyekutukan-Nya di dalamnya dengan sesuatu apapun,karena sebab syirik akbar adalah dosa yang besar, dan kufur kepada Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sebagaimana yang dilakukan orang-orang Yahudi dan Nasrani ketika mereka berada di tempat ibadah mereka, mereka malah menyembah kepada selain-Nya. Hal itu, karena masjid yang merupakan tempat paling agung untuk beribadah dibangun di atas ikhlas dan ketundukan kepada keagungan Allah dan keperkasaan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Jin Ayat 18",
    "description": "Kelompok ayat ini berbicara tentang kenabian, keesaan Allah dan keniscayaan kiamat sebagai kesimpulan uraian kisah jin yang disebut pada ayat-ayat sebelumnya. Dan sesungguhnya masjid-masjid yaitu bangunan khusus yang didirikan sebagai tempat beribadah kepada Allah itu adalah untuk Allah sehingga seluruh aktifitas di dalamnya haruslah difokuskan hanya untuk Allah. Maka janganlah kamu menyembah apa pun di dalamnya selain Allah. 19. Dan sesungguhnya ketika hamba Allah yaitu nabi Muhammad berdiri menyembah-Nya yaitu melaksanakan salat dengan sungguh-sungguh, mereka, jin-jin itu berdesakan mengerumuninya karena merasa takjub dengan apa yang mereka lihat dan dengar."
  }
]