[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "19. Ketika Muhammad berdiri beribadah kepada Tuhannya, para jin berkumpul dalam jumlah besar, sebagian dari mereka di atas sebagian lainnya, mereka berdesak-desakkan untuk mendengar al-Quran darinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Dan bahwasanya tatkala hamba Allah, Muhammad -ṣallallāhu 'alaihi wa sallam- berdiri untuk menyembah Rabbnya di lembah kurma, hampir saja jin-jin itu tumpang tindih di hadapannya karena berdesak-desakan saat mereka mendengar bacaan Al-Qur`ānnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "19. Allah menyampaikan kepada para makhluk bahwa jin-jin yang mendengarkan bacaan ayat-ayat al-Qur’an dari Rasulullah itu hampir-hampir saling bertumpang tindih karena mereka begitu antusias dalam mendengarkannya sehingga mereka ingin mendekat kepada Rasulullah dan berdesak-desakan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "19. وَأَنَّهُۥ لَمَّا قَامَ عَبْدُ اللَّـهِ (Dan bahwasanya tatkala hamba Allah) Yaitu Muhammad. يَدْعُوهُ(berdiri menyembah-Nya) Yakni berdoa dan beribadah kepada Allah, yaitu ketika ia sedang berada di pangkal pohon kurma, sebagaimana telah disebutkan. كَادُوا۟ يَكُونُونَ عَلَيْهِ لِبَدًا(hampir saja jin-jin itu desak mendesak mengerumuninya) Yakni jin-jin itu hampir berdesakan di sekitar Rasulullah untuk mendengarkan al-Qur’an."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19. Kemudian, keiika Nabi Muhammad SAW melaksanakan shalat di dalam kerumunan pohon kurma (masjid), mereka para jin berdesakan mengerumuni Nabi SAW untuk mendengarkan bacaan Al-quran Nabi"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya ketika hamba Allah berdiri menyembahNya} menyembah Tuhanya {mereka itu berdesakan} jin-jin itu berdesakan {mengerumuninya} mereka berkumpul sangat berdesakan karena ingin mendengar Al-Qur'an darinya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "19. “Dan bahwasanya tatkala hamba Allah (Muhammad) berdiri menyembahNya,” memohon dan menyembahNya serta membaca al-Quran, karena terlalu banyaknya mereka, “hampir saja jin-jin itu desak-mendesak mengerumuninya,” yakni saling berdesakan untuk mendengarkan petunjuk yang ada di dalamnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Jin ayat 19: Allah mengabarkan keadaan jin ketika Nabi mengerjakan shalat dan mengeraskan suaranya dan Nabi tidak mengetahui wujud mereka (jin). Dimana mereka para jin datang satu persatu dan hampir-hampir penuh karena sebab hadir secara berjamaah berduyun-duyun yang sungguh saling berdesak-desakan sebagian dari mereka kepada sebagian yang lain, karena semangat mereka untuk mendengar Al Qur’an, untuk memahami apa yang Rasul ﷺ ucapkan (baca)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Untuk mendengarkan Al Qur’an."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Jin Ayat 19",
    "description": "Dan sesungguhnya ketika hamba Allah yaitu nabi Muhammad berdiri menyembah-Nya yaitu melaksanakan salat dengan sungguh-sungguh, mereka, jin-jin itu berdesakan mengerumuninya karena merasa takjub dengan apa yang mereka lihat dan dengar. 20. Katakanlah, wahai nabi Muhammad, kepada yang takjub tersebut bahwa, sesungguhnya aku hanya menyembah tuhanku dan aku tidak mempersekutukan sesuatu pun dengan-Nya baik malaikat, berhala, manusia jin atau makhluk apa pun. '"
  }
]