[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-2. Katakanlah (wahai Rasul) “Allah mewahyukan kepadaku bahwa sekelompok jin telah mendengar tilawah al-Quran yang aku takutkan. Ketika mereka mendengarnya, mereka berkata kepada kaum mereka, ‘Sesungguhnya kami mendengar al-Quran yang sangat bagus dalam balaghoh dan kefasihannya, hikmah-hikmah, hukum-hukum dan berita-beritanya, ia mengajak kepada kebenaran dan hidayah, lalu kami membenarkan al-Quran itu dan mengamalkannya, kami tidak akan menyekutukan Tuhan kami yang telah menciptakan kami dengan siapapun dalam beribadah kepadaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Ucapan yang kami dengar ini menunjukkan kepada keyakinan, ucapan dan perbuatan yang benar, maka kami mengimaninya dan sekali-kali kami tidak akan menyekutukan Rabb kami yang menurunkannya dengan seorang pun."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "2. Perkataan ini mengandung seruan menuju kebenaran dan petunjuk, sehingga kami segera meyakini bahwa itu adalah firman Allah Yang Maha Pencipta. Kami akan tetap beriman dan tidak akan kembali kepada kesyirikan yang dahulu kami lakukan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Al-Quran ini menunjukkan dan membimbing kepada kebenaran dan ma’rifatullah. Maka kami membenarkan Al-Quran bahwa sesungguhnya Al-Qur’an itu dari sisi Allah. Kami tidak akan menyekutukanNya dengan menyembah siapapun dari ciptaanNya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{yang memberi petunjuk pada kebenaran} kebenaran {sehingga kami beriman padanya dan tidak akan menyekutukan Tuhan kami dengan sesuatu apa pun"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2. “(Yang) memberi petunjuk kepada jalan yang benar.” Petunjuk adalah kata umum untuk segala sesuatu yang mengarahkan manusia pada kebaikan dunia dan agama mereka. “Lalu kami beriman kepadanya. Dan kami sekali-kali tidak akan mempersekutukan seorang pun dengan Rabb kami.” Mereka menyatukan antara keimanan yang mencakup seluruh amal baik dengan ketakwaan yang mencakup meninggalkan keburukan. Mereka menjadikan faktor yang mendorong mereka pada keimanan dan segala sesuatu yang berkaitan dengan keimanan yang mereka kerajakan berkat petunjuk-petunjuk al-Quran serta segala sesuatu yang mencakup berbagai kemaslahatan, faidah, dan meninggalkan bahaya. Hal itu merupakan tanda-tanda kebesaran dan hujjah pasti bagi orang yang menjadikannya sebagai cahaya dan petunjuk. Iman yang berguna dan membuahkan berbagai kebaikan ini terbangun di atas hidayah al-Quran. Tidak seperti keimanan pengikut tradisi dan persaudaraan, karena keimanan seperti ini adalah iman ikut-ikutan di bawah bahaya syubhat dan berbagai macam penghalang."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Jin ayat 2: Kemudian berkata para jin yang mendengar Al Qur’an : Inilah Al Qur’an sebagai petunjuk kepada kebenaran dan petunjuk kepada jalan yang lurus; Maka kami membenarkannya dan beriman dengan apa yang terkandung padanya dari dakwah ikhlas menyembah kepada Allah saja, dan kami tidak menyekutukan Rabb kami dan Pencipta kami yang Esa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni yang menunjukkan kepada segala yang bermaslahat bagi manusia baik bagi agama maupun dunia mereka. Inilah arti Ar Rusyd. Setelah ini. Mereka menggabung antara ‘beriman’ yang masuk ke dalamnya semua amal baik, dan antara bertakwa yang mengandung arti meninggalkan keburukan. Sebab yang mendorong mereka beriman dan melakukan pengiringnya adalah apa yang mereka ketahui dari pengarahan Al Qur’an, kandungannya yang terdiri dari maslahat, faedah dan menjauhi bahaya. Hal itu, karena Al Qur’an adalah ayat yang agung, hujjah yang qath’i bagi orang yang mengambil sinar darinya dan mengambil petunjuk darinya. Itulah iman yang bermanfaat yang membuahkan segala kebaikan yang dibangun di atas petunjuk Al Qur’an, berbeda dengan iman karena ikut-ikutan yang berada dalam bahaya syubhat dan berbagai aral yang melintang."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Jin Ayat 2",
    "description": "\"Al-Qur'an yang memberi petunjuk dengan jelas lagi lemah lembut kepada jalan yang benar untuk mengenal Allah, kami yakin itu pasti firman Allah bukan buatan manusia, lalu kami beriman kepadanya. Dan sejak saat itu kami sekali-kali tidak akan mempersekutukan sesuatu pun dengan tuhan kami, karena hal tersebut adalah perbuatan yang sangat dibenci Allah. \" 3. Setelah para jin yang mendengar al qur'an tersebut berjanji tidak akan menyekutukan Allah, mereka kemudian memuji Allah dengan pujian yang tulus. Dan sesungguhnya mahatinggi keagungan tuhan kami sehingga tidak terjangkau oleh siapa pun dan apa pun, dia tidak beristri dan tidak beranak. '."
  }
]