[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "20. Katakanlah (wahai Rasul) kepada orang-orang kafir itu, “Aku hanya menyembah Tuhanku semata, aku tidak menyekutukanNya dengan apau pun dalam beribadah.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "20. Katakan -wahai Rasul- kepada orang-orang musyrik, “Sesungguhnya aku hanya menyembah Rabbku semata dan aku tidak menyekutukan-Nya dengan sesuatu apapun dalam menyembah-Nya.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "20. Hai Nabi yang mulia, katakanlah kepada seluruh makhluk, termasuk orang-orang musyrik yang tidak menerima dakwahmu: “Aku tidak menyembah kecuali kepada Tuhanku yang telah menciptakanku dan mengutusku; aku tidak mungkin menyekutukan-Nya dengan yang lain. Dan aku mengajak kalian untuk mengesakan dan menyembah-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20. Wahai Rasul, katakanlah: “Aku hanya menyembah Allah sebagai Tuhanku, aku tidak menyekutukan-Nya dengan apapun. Ayat ini diturunkan ketika kafir Qurays berkata kepada Nabi SAW: “Sesungguhnya enkau membawa perkara yang agung, namun semua orang telah memusuhimu. Maka tinggalkanlah ini semua, maka kami akan menyelamatkanmu”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Katakanlah,“Sesungguhnya aku hanya menyembah Tuhanku dan aku tidak menyekutukanNya dengan apa pun"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "20. “Katakanlah” kepada mereka wahai rasul, seraya menjelaskan hakikat apa yang kau serukan, “Sesungguhnya aku hanya berdoa kepada Rabbmu dan aku tidak mempersekutukan sesuatu pun denganNya.” Yakni, aku mengesakanNya semata, yang tidak ada sekutu bagiNya. Aku berlepas diri dari segala sekutu dan berhala, serta segala sesuatu yang dijadikan sesembahan oleh kaum musyrikin selain Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Jin ayat 20: 20-23. Katakan wahai Nabi Allah kepada mereka orang-orang kafir : Ketahuilah wahai manusia, sungguh aku hanya beribadah kepada Allah saja, dan aku tidak menyekutukan-Nya dengan apapun. Dan oleh sebab itu Quraisy, mereka menuntut Nabi agar meniadakan dakwahnya untuk menyeru kepada Allah, maka Allah turunkan ayat ini. Katakan olehmu juga : Sesungguhnya aku tidak dapat mencegah dari adzab Allah yang ditimpakan kepada salah satu dari manusia, jika manusia tersebut bermaksiat kepada-Nya., dan tidak ada jalan keluar dan lolos dari adzab Allah. Sesungguhnya Allah saja yang Maha Menguasai dan telah disampaikan kerisalahan dari Allah kepada kalian, dan setelah sampai kerisalahan-Nya, maka ketahuilah barangsiapa yang kafir kepada Allah dan Rasul-Nya dan menolak akan agamanya, maka sungguh balasannya adalah neraka yang tidak akan keluar darinya selamanya. Dan firman-Nya : وَمَن يَعْصِ, yaitu bermaksiat disini maknanya adalah kufur; Karena semata-mata bermaksiat diiringi dengan keimanan, maka tidak akan kekal dalam neraka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sebagai jawaban terhadap ajakan orang-orang kafir untuk meninggalkan menyembah Allah, atau maksudnya perintah Allah kepada Beliau agar menerangkan hakikat ajakan Beliau."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Jin Ayat 20",
    "description": "Katakanlah, wahai nabi Muhammad, kepada yang takjub tersebut bahwa, sesungguhnya aku hanya menyembah tuhanku dan aku tidak mempersekutukan sesuatu pun dengan-Nya baik malaikat, berhala, manusia jin atau makhluk apa pun. ' 21. Allah memerintahkan kepada nabi Muhammad untuk melanjutkan menyampaikan pesan Allah, katakanlah wahai nabi Muhammad, 'aku tidak kuasa menolak mudarat maupun mendatangkan kebaikan kepadamu tanpa izin-Nya. ' tugasku hanyalah menyampaikan apa yang diwahyukannya kepadaku."
  }
]