[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "21-23. Katakanlah (wahai Rasul) kepada orang-orang kafir itu, “ Aku tidak kuasa menolak mudarat dari kalian, tidak pula mendatangkan manfaat bagi kalian. Bila aku mendurhakai Allah, maka tidak ada seorang pun yang bisa menyelamatakanku dari azabNya. Aku tidak menemukan tempat berlindung yang menjagaku dari azabNya. Yang aku bisa lakukan adalah menyampaikan kepada kalian dari Allah apa yang Allah perintahkan kepadaku agar aku menyampaikannya kepada kalian dan risalahNya yang dengannya Allah mengutusku kepada kalian. Barangsiapa durhaka kepada Allah dan RasulNya, serta berpaling dari agama Islam, maka balasannya adalah Neraka Jahanam, dia tidak akan keluar darinya selama-lamanya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Katakan kepada mereka, ”Sesungguhnya aku tidak mampu menolak mudarat yang telah ditakdirkan oleh Allah terjadi pada kalian dan tidak pula mampu mendatangkan manfaat yang telah dihalangi oleh Allah dari kalian.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "21. Dan meskipun aku adalah Rasulullah yang diutus kepada seluruh makhluk, namun aku adalah seorang manusia; aku tidak memiliki kemampuan untuk menurunkan mudharat kepada orang yang memusuhiku, dan untuk memaksa mereka beriman kepadaku. Tugasku hanya menyampaikan risalah, dan setiap jin dan manusia akan menanggung pilihannya masing-masing."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "21. قُلْ إِنِّى لَآ أَمْلِكُ لَكُمْ ضَرًّا وَلَا رَشَدًا (Katakanlah: “Sesungguhnya aku tidak kuasa mendatangkan sesuatu kemudharatanpun kepadamu dan tidak (pula) suatu kemanfaatan”) Yakni aku tidak mampu mencegah kemudharatan dari kalian, tidak pula aku mampu mendatangkan kebaikan kepadamu baik dalam urusan duniawi maupun agama."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "21. Katakanlah kepada kaummu wahai Nabi: “Aku tidak bisa mencegah bencana yang datang kepada kalian, aku pun tidak bisa mendatangkan kebaikan kepada kalian. Maksudnya adalah kesesatan dan hidayah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Sesungguhnya aku tidak mampu (menolak) mudharat dan tidak pula (mendatangkan) kebaikan} manfaat {kepada kalian"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21-22. “Katakanlah, ‘ Sesungguhnya aku tidak kuasa mendatangkan sesuatu kemudaratan pun kepadamu dan tidak (pula) sesuatu kemanfaatan’.” Yakni, aku hanyalah seorang hamba, aku tidak memiliki kuasa untuk mengatur dan bertindak atas segala sesuatu pun. “Katakanlah, ‘Sesungguhnya aku sekali-kali tiada seorang pun yang dapat melindungiku dari (azab) Allah’,” yakni tidak ada seorang pun yang bisa aku mintai perlindungan yang bisa menyelamatkanku dari siksaan Allah. Bila seorang rasul yang merupakan manusia terbaik tidak kuasa menimpakan bahaya dan memberi manfaat serta tidak bisa menangkal suatu keburukan dari Allah jika memang dikehendaki, maka orang yang bukan rasul tentu lebih tidak bisa, “dan sekali-kali tiada akan memperoleh tempat berlindung selain dariNya,” yakni tempat perlindungan dan memohon pertolongan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Jin ayat 21: 20-23. Katakan wahai Nabi Allah kepada mereka orang-orang kafir : Ketahuilah wahai manusia, sungguh aku hanya beribadah kepada Allah saja, dan aku tidak menyekutukan-Nya dengan apapun. Dan oleh sebab itu Quraisy, mereka menuntut Nabi agar meniadakan dakwahnya untuk menyeru kepada Allah, maka Allah turunkan ayat ini. Katakan olehmu juga : Sesungguhnya aku tidak dapat mencegah dari adzab Allah yang ditimpakan kepada salah satu dari manusia, jika manusia tersebut bermaksiat kepada-Nya., dan tidak ada jalan keluar dan lolos dari adzab Allah. Sesungguhnya Allah saja yang Maha Menguasai dan telah disampaikan kerisalahan dari Allah kepada kalian, dan setelah sampai kerisalahan-Nya, maka ketahuilah barangsiapa yang kafir kepada Allah dan Rasul-Nya dan menolak akan agamanya, maka sungguh balasannya adalah neraka yang tidak akan keluar darinya selamanya. Dan firman-Nya : وَمَن يَعْصِ, yaitu bermaksiat disini maknanya adalah kufur; Karena semata-mata bermaksiat diiringi dengan keimanan, maka tidak akan kekal dalam neraka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Karena aku seorang hamba dan tidak berkuasa apa-apa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Jin Ayat 21",
    "description": "Allah memerintahkan kepada nabi Muhammad untuk melanjutkan menyampaikan pesan Allah, katakanlah wahai nabi Muhammad, 'aku tidak kuasa menolak mudarat maupun mendatangkan kebaikan kepadamu tanpa izin-Nya. ' tugasku hanyalah menyampaikan apa yang diwahyukannya kepadaku. 22. Jangankan terhadap orang lain bahkan terhadap diri sendiri nabi pun tidak berkuasa. Inilah yang diisyaratkan pada ayat ini. Katakanlah, wahai nabi Muhammad, 'sesungguhnya tidak ada sesuatu pun yang dapat melindungiku dari azab Allah dan aku tidak akan memperoleh tempat berlindung selain dari-Nya."
  }
]