[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "21-23. Katakanlah (wahai Rasul) kepada orang-orang kafir itu, “ Aku tidak kuasa menolak mudarat dari kalian, tidak pula mendatangkan manfaat bagi kalian. Bila aku mendurhakai Allah, maka tidak ada seorang pun yang bisa menyelamatakanku dari azabNya. Aku tidak menemukan tempat berlindung yang menjagaku dari azabNya. Yang aku bisa lakukan adalah menyampaikan kepada kalian dari Allah apa yang Allah perintahkan kepadaku agar aku menyampaikannya kepada kalian dan risalahNya yang dengannya Allah mengutusku kepada kalian. Barangsiapa durhaka kepada Allah dan RasulNya, serta berpaling dari agama Islam, maka balasannya adalah Neraka Jahanam, dia tidak akan keluar darinya selama-lamanya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "22. Katakan kepada mereka, “Sekali-kali tidak ada seorangpun yang bisa menyelamatkaku dari siksa Allah apabila aku durhaka kepada-Nya dan tidak pula aku mendapatkan tempat yang aku gunakan untuk berlindung selain daripada-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "22-23. Tidak ada yang dapat melindungiku dari azab Allah kecuali jika aku melaksanakan dakwah untuk beriman dan mengesakan Allah yang wajib aku sampaikan, dan jika aku menjalankan agama yang benar yang menjadi risalahku.” Jika demikian yang harus dilakukan Rasulullah yang mulia, maka bagaimana dengan makhluk selain beliau? Dan sungguh Allah telah menyiapkan azab yang pedih di dalam neraka bagi orang tidak yang beriman kepada-Nya dan kepada rasul-Nya yang menyeru kepada kebenaran, serta bagi orang yang menentang perintah-Nya dan perintah rasul-Nya; dan itu adalah azab yang kekal, yang tidak akan terhenti."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "22. وَلَنْ أَجِدَ مِن دُونِهِۦ مُلْتَحَدًا (dan sekali-kali aku tiada akan memperoleh tempat berlindung selain daripada-Nya) Yakni tempat perlindungan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "22. Katakanlah: “Sesungguhnya, jika aku bermaksiat, aku tidak akan pernah bisa selamat dari azab Allah, sehingga azab itu turun kepadaku. Namun aku tidak bisa berlindung kecuali hanya kepada-Nya. Diriwayatkan dari Jarir dari Hadromi yang menyebutkan ada seorang pemuka jin yang menjadi pengikutnya berkata: “Muhammad hanya ingin Allah menyelamatkannya, sehingga aku menyelamatkannya.” Sehingga Allah menurunkan ayat ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Sesungguhnya tidak ada seorang pun yang dapat melindungiku} menjauhkanku {dari (azab) Allah dan aku tidak akan memperoleh tempat berlindung} tempat yang digunakan untuk berlindung {selain Dia"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21-22. “Katakanlah, ‘ Sesungguhnya aku tidak kuasa mendatangkan sesuatu kemudaratan pun kepadamu dan tidak (pula) sesuatu kemanfaatan’.” Yakni, aku hanyalah seorang hamba, aku tidak memiliki kuasa untuk mengatur dan bertindak atas segala sesuatu pun. “Katakanlah, ‘Sesungguhnya aku sekali-kali tiada seorang pun yang dapat melindungiku dari (azab) Allah’,” yakni tidak ada seorang pun yang bisa aku mintai perlindungan yang bisa menyelamatkanku dari siksaan Allah. Bila seorang rasul yang merupakan manusia terbaik tidak kuasa menimpakan bahaya dan memberi manfaat serta tidak bisa menangkal suatu keburukan dari Allah jika memang dikehendaki, maka orang yang bukan rasul tentu lebih tidak bisa, “dan sekali-kali tiada akan memperoleh tempat berlindung selain dariNya,” yakni tempat perlindungan dan memohon pertolongan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Jin ayat 22: 20-23. Katakan wahai Nabi Allah kepada mereka orang-orang kafir : Ketahuilah wahai manusia, sungguh aku hanya beribadah kepada Allah saja, dan aku tidak menyekutukan-Nya dengan apapun. Dan oleh sebab itu Quraisy, mereka menuntut Nabi agar meniadakan dakwahnya untuk menyeru kepada Allah, maka Allah turunkan ayat ini. Katakan olehmu juga : Sesungguhnya aku tidak dapat mencegah dari adzab Allah yang ditimpakan kepada salah satu dari manusia, jika manusia tersebut bermaksiat kepada-Nya., dan tidak ada jalan keluar dan lolos dari adzab Allah. Sesungguhnya Allah saja yang Maha Menguasai dan telah disampaikan kerisalahan dari Allah kepada kalian, dan setelah sampai kerisalahan-Nya, maka ketahuilah barangsiapa yang kafir kepada Allah dan Rasul-Nya dan menolak akan agamanya, maka sungguh balasannya adalah neraka yang tidak akan keluar darinya selamanya. Dan firman-Nya : وَمَن يَعْصِ, yaitu bermaksiat disini maknanya adalah kufur; Karena semata-mata bermaksiat diiringi dengan keimanan, maka tidak akan kekal dalam neraka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Jika aku durhaka kepada-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Jin Ayat 22",
    "description": "Jangankan terhadap orang lain bahkan terhadap diri sendiri nabi pun tidak berkuasa. Inilah yang diisyaratkan pada ayat ini. Katakanlah, wahai nabi Muhammad, 'sesungguhnya tidak ada sesuatu pun yang dapat melindungiku dari azab Allah dan aku tidak akan memperoleh tempat berlindung selain dari-Nya. 23. Bagi yang tetap menolak dakwah nabi Muhammad maka Allah perintahkan untuk menyatakan bahwa aku hanya menyampaikan peringatan dari Allah dan risalah-Nya. Dan barangsiapa mendurhakai Allah dan rasul-Nya setelah disampaikan peringatan tersebut, maka sesungguhnya dia akan mendapat azab neraka jahanam, mereka kekal di dalamnya selama-lamanya."
  }
]