[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "21-23. Katakanlah (wahai Rasul) kepada orang-orang kafir itu, “ Aku tidak kuasa menolak mudarat dari kalian, tidak pula mendatangkan manfaat bagi kalian. Bila aku mendurhakai Allah, maka tidak ada seorang pun yang bisa menyelamatakanku dari azabNya. Aku tidak menemukan tempat berlindung yang menjagaku dari azabNya. Yang aku bisa lakukan adalah menyampaikan kepada kalian dari Allah apa yang Allah perintahkan kepadaku agar aku menyampaikannya kepada kalian dan risalahNya yang dengannya Allah mengutusku kepada kalian. Barangsiapa durhaka kepada Allah dan RasulNya, serta berpaling dari agama Islam, maka balasannya adalah Neraka Jahanam, dia tidak akan keluar darinya selama-lamanya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "23. Akan tetapi yang aku mampu hanyalah menyampaikan kepada kalian apa yang diperintahkan kepadaku untuk menyampaikannya dan risalah-Nya yang aku diutus dengannya kepada kalian. Dan barangsiapa durhaka kepada Allah dan Rasul-Nya maka tempat kembalinya adalah masuk ke dalam Neraka, kekal selamanya di dalamnya, tidak pernah keluar darinya selamanya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "23. إِلَّا بَلٰغًا مِّنَ اللَّـهِ وَرِسٰلٰتِهِۦ ۚ (Akan tetapi (aku hanya) menyampaikan (peringatan) dari Allah dan risalah-Nya) Yakni aku hanya menyampaikan risalah dari Allah dan mengamalkannya, dengan mengajak orang lain mengamalkan risalah itu; jika aku melakukan ini maka aku akan selamat, namun jika tidak maka aku akan binasa."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "23. Aku tidak berkuasa apapun kepada kalian, aku hanya diutus untuk menyampaikan risalah yang telah disampaikan padaku melalui Jibril untuk kalian. Aku akan menyampaikan risalah mengenai garis besar Alquran tentah perintah shalat, zakat, dan haji. Adapun siapapun yang menolak perintah Allah dan Rasul-Nya untuk mengesakan Allah dan menjalankan syariat-Nya, maka akan mendapatkan azab neraka Jahannam. Mereka kekal di dalamnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidak lain kecuali menyampaikan (peringatan) dari Allah} tapi aku hanya mampu menyampaikan apa yang datang dari Allah {dan risalahNya. Siapa saja yang mendurhakai Allah dan RasulNya sesungguhnya akan mendapat neraka Jahanam. Mereka kekal di dalamnya selama-lamanya.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "23. “Akan tetapi (aku hanya) menyampaikan (peringatan) dari Allah dan risalahNya,” aku tidak memiliki keistimewaan atas manusia selain hanya karena Allah mengkhususkanku untuk menyampaikan risalah-risalahNya dan mendakwahi para manusia, yang dengan itu tegaklah hujjah atas manusia. “dan barangsiapa yang mendurhakai Allah dan Rasulnya, maka sesungguhnya baginyalah Neraka Jahanam, mereka kekal di dalamnya selama-lamanya.” Yang dimaskud adalah maksiat kekufuran sebagaimana dibatasi oleh nash-nash tegas lainnya. Sedangkan kemaksiatan saja tidaklah membuat pelakunya kekal di dalam neraka sebagaimana ditunjukkan oleh ayat-ayat al-Quran dan hadits-hadits Nabi, serta berdasarkan ijma’ -Salaf ash-Shalih dan para imam umat ini."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Jin ayat 23: 20-23. Katakan wahai Nabi Allah kepada mereka orang-orang kafir : Ketahuilah wahai manusia, sungguh aku hanya beribadah kepada Allah saja, dan aku tidak menyekutukan-Nya dengan apapun. Dan oleh sebab itu Quraisy, mereka menuntut Nabi agar meniadakan dakwahnya untuk menyeru kepada Allah, maka Allah turunkan ayat ini. Katakan olehmu juga : Sesungguhnya aku tidak dapat mencegah dari adzab Allah yang ditimpakan kepada salah satu dari manusia, jika manusia tersebut bermaksiat kepada-Nya., dan tidak ada jalan keluar dan lolos dari adzab Allah. Sesungguhnya Allah saja yang Maha Menguasai dan telah disampaikan kerisalahan dari Allah kepada kalian, dan setelah sampai kerisalahan-Nya, maka ketahuilah barangsiapa yang kafir kepada Allah dan Rasul-Nya dan menolak akan agamanya, maka sungguh balasannya adalah neraka yang tidak akan keluar darinya selamanya. Dan firman-Nya : وَمَن يَعْصِ, yaitu bermaksiat disini maknanya adalah kufur; Karena semata-mata bermaksiat diiringi dengan keimanan, maka tidak akan kekal dalam neraka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni aku tidak berbeda dengan manusia yang lain, hanyasaja Allah Subhaanahu wa Ta'aala mengistimewakan aku untuk menyampaikan risalah-Nya dan mengajak manusia kepada-Nya, sehingga dengan begitu tegaklah hujjah atas manusia. Dengan melakukan kekafiran sebagaimana diterangkan oleh ayat-ayat yang lain yang muhkam (jelas). Adapun jika sekedar melakukan maksiat yang berada di bawah kekafiran, maka tidaklah membuat kekal di neraka sebagaimana ditunjukkan oleh ayat-ayat Al Qur’an dan hadits-hadits Rasulullah shallallahu 'alaihi wa sallam serta disepakati oleh salaful ummah dan para imam umat ini."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Jin Ayat 23",
    "description": "Bagi yang tetap menolak dakwah nabi Muhammad maka Allah perintahkan untuk menyatakan bahwa aku hanya menyampaikan peringatan dari Allah dan risalah-Nya. Dan barangsiapa mendurhakai Allah dan rasul-Nya setelah disampaikan peringatan tersebut, maka sesungguhnya dia akan mendapat azab neraka jahanam, mereka kekal di dalamnya selama-lamanya. 24. Sikap durhaka manusia terus akan berlanjut dan baru berhenti setelah mereka melihat azab neraka. Inilah yang diisyaratkan oleh ayat ini. Sehingga apabila mereka melihat azab yang diancamkan kepadanya dan itu pasti akan terjadi, maka mereka akan mengetahui siapakah yang lebih lemah penolongnya dan lebih sedikit jumlahnya, apakah nabi Muhammad ataukah para pendurhaka."
  }
]