[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "24. Ketika kaum musyrikin menyaksikan azab yang diancamkan kepada mereka, maka mereka akan tahu siapa yang lebih lemah penolongnya dan lebih sedikit bala tentaranya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. Dan orang-orang kafir tetap saja dalam kekufuran mereka hingga mereka melihat pada hari Kiamat siksa yang dijanjikan kepada mereka di dunia, dan pada saat itu mereka akan mengerti siapa yang lebih lemah penolongnya dan lebih sedikit jumlah penolongnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "24. Orang-orang musyrik itu akan tetap pada kekafiran dan penentangan mereka hingga mereka melihat azab yang dijanjikan; sehingga ketika itu mereka akan mengetahui dengan pasti bahwa mereka berada dalam kesesatan dan tidak ada seorangpun yang dapat menolong dan melindungi mereka dari azab. Ketika itu sebesar apapun kekuatan mereka, pasti akan sirna di depan kekuatan dan keagungan Allah; dan sebanyak apapun jumlah mereka, pasti akan lenyap di depan orang-orang beriman yang dibantu oleh para malaikat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "24. فَسَيَعْلَمُونَ مَنْ أَضْعَفُ نَاصِرًا (maka mereka akan mengetahui siapakah yang lebih lemah penolongnya) Yakni siapa yang lebih lemah tentaranya untuk memberi pertolongan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "24. Sehingga apabila orang kafir itu melihat azab yang telah diancamkan kepada mereka akan tahu siapa yang sebenarnya penolongnya lebih lemah dan lebih sedikit jumlahnya. Orang mukmin ataukah mereka sendiri? Muqatil berkata: Ketika orang-orang musyrik mendengar ayat ini, An-nadhir bin Harits berkata: Kapan hari pembalasan itu akan terjadi? Maka turunlah ayat di bawah ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dengan demikian, apabila melihat apa yang diancamkan kepada mereka, maka mereka akan mengetahui siapakah yang lebih lemah penolongnya dan lebih sedikit jumlahnya penyelamatnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "24. “Sehingga apabila mereka melihat azab yang diancamkan kepada mereka,” yakni menyaksikan dengan mata kepala dan memastikan akan menimpa mereka, “maka mereka akan mengetahui,” pada saat itu dengan sebenar-benarnya, “siapakah yang lebih lemah penolongnya dan lebih sedikit bilangannya,” ketika tidak ditolong oleh yang lain bahkan dirinya sendiri tidak mendapatkan pertolongan kala mereka digiring seorang demi seorang sebagaimana mereka diciptakan pertama kalinya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Jin ayat 24: Ketahuilah wahai Nabo, bahwa mereka kafir tidak akan pernah hilang dari sifat keras kepala akan kekafirannya, dan menyerang Nabi ﷺ dan orang-orang beriman sampai mereka melihat janji Allah kepada mereka dari adzab Allah dengan mata-mata mereka masing-masing. Mereka akan paham pada suatu saat siapa yang paling lemah pertolongannya dan terbatas pasukannya; Dimana sesungguhnya orang-orang kafir di hari kiamat mereka akan menjadi lemah, tertunduk dan hina."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni menyaksikannya dengan mata kepala dan merasa yakin bahwa azab itu pasti menimpa mereka. Yaitu ketika selain mereka tidak bisa memberikan pertolongan dan mereka tidak mampu membela diri; ketika mereka dikumpulkan secara sendiri-sendiri sebagaimana mereka diciptakan pertama kali."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Jin Ayat 24",
    "description": "Sikap durhaka manusia terus akan berlanjut dan baru berhenti setelah mereka melihat azab neraka. Inilah yang diisyaratkan oleh ayat ini. Sehingga apabila mereka melihat azab yang diancamkan kepadanya dan itu pasti akan terjadi, maka mereka akan mengetahui siapakah yang lebih lemah penolongnya dan lebih sedikit jumlahnya, apakah nabi Muhammad ataukah para pendurhaka. 25. Kaum musyrik apabila diancam dengan siksa, seringkali melecehkan dan bertanya untuk tujuan mengejek, kapankah datangnya ancaman itu. Katakanlah wahai nabi Muhammad, 'aku tidak mengetahui, apakah azab yang diancamkan kepadamu itu sudah dekat ataukah tuhanku menetapkan waktunya masih lama, aku tidak diberitahu tentang hal itu. '."
  }
]