[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "25-28. Katakanlah (wahai Rasul) kepada orang-orang kafir itu, “Aku tidak tahu apakah azab yang diancamkan kepada kalian ini sudah dekat masanya ataukah Tuhanku menetapkan masa tenggat yang lama?” Allah mengetahui apa yang ghaib dari pandangan mata, Dia tidak memperlihatkannya kepada seorang pun dari makhlukNya, kecuali siapa yang Dia pilih untuk mengemban risalahNYa dan Dia ridhai, maka Dia membukakan sebagian hal ghaib. Allah mengirimkan para malaikat di depan dan dibelakang Rasul untuk menjaganya dari para jin, agar mereka tidak mengupingnya lalu membisikannya kepada para dukun, agar Rasul tahu bahwa para Rasul sebelumnya sama dengan dirinya, yaitu mereka menyampaikan kebenaran dengan jujur, dan bahwa dia dijaga sebagaimana para rasul dijaga dari jin. Dan bahwa ilmu Allah mencakup segala apa yang ada pada mereka, baik lahir maupun batin, berupa syariat-syariat, hukum-hukum dan lainnya, tidak ada sesuatu pun yang terlewatkan olehNya, dan juga bahwa Allah menghitung jumlah segala sesuatu, tidak ada sesuatu pun yang samar bagi Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "25. Katakan -wahai Rasul- kepada orang-orang musyrik yang mengingkari kebangkitan, “Aku tidak tahu apakah siksa yang dijanjikan kepada kalian itu sudah dekat ataukah siksa itu masih lama, tidak ada yang tahu kecuali Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "25-27. Hai Nabi yang mulia, katakanlah: Aku tidak mengetahui hal ghaib, sehingga aku tidak mengetahui kapan azab akan menimpa kalian; akan tetapi aku mengetahui bahwa azab itu pasti akan terjadi sebagaimana yang Allah sampaikan; hal itu merupakan bagian dari hal ghaib yang hanya Allah yang mengetahuinya, Dia tidak memberitahukannya kepada seorangpun kecuali kepada sebagian rasul-Nya yang Dia beritahu sebagian hal ghaib, agar menjadi mukjizat bagi mereka dan sebagai penegas kebenaran mereka. Dan para rasul yang mendapat sebagian ilmu ghaib dari Allah telah Allah siapkan bagi mereka para malaikat penjaga dari gangguan jin dan manusia, agar mereka dapat menyampaikan risalah dengan sebaik-baiknya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "25. أَمْ يَجْعَلُ لَهُۥ رَبِّىٓ أَمَدًا (ataukah Tuhanku menjadikan bagi (kedatangan) azab itu masa yang panjang) Apakah mereka atau orang-orang beriman?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "25-26. Katakanlah kepada orang-orang musyrik wahai Rasul: “Aku tidak tahu sama sekali, apakah azab yang telah dijanjikan kepada kalian itu dipercepat atau diperlambat. Hanya Allah-lah yang Maha Tahu tentang itu semua. Al-amad adalah masa yang sang sangat jauh. Allah Maha Tahu atas segala sesuatu yang ghoib (rahasia) dari para hamba-Nya, tidak ada seorangpun yang bisa mengetahui rahasia seorang makhluk kecuali Tuhannya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Katakanlah,“Aku tidak mengetahui} aku tidak tahu {apakah yang diancamkan kepada kalian itu} berupa azab {sudah dekat atau Tuhanku menjadikan waktunya masih lama} waktu yang tidak diketahui siapapun kecuali Dia"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "25-26. “katakanlah “ kepada mereka bila mereka bertanya padamu tentang kapankah terjadinya ancaman itu, “Aku tidak mengetahui, apakah azab yang diancamkan kepadamu itu dekat ataukah Rabbku menjadikan bagi (kedatangan) azab itu, masa yang panjang,” yakni, jarak waktu yang panjang. Pengetahuan mengenai hal itu hanya ada di sisi Allah. “(Dia adalah Rabb) Yang Mengetahui yang ghaib, maka Dia tidak memperlihatkan kepada seorang pun tentang yang ghaib itu,” hanya Allah sendiri yang mengetahui isi hati, rahasia dan hal-hal ghaib."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Jin ayat 25: Ketika mereka terburu-buru meminta kepada Nabi adzab, maka Allah memerintahkan Nabi untuk berkata kepada mereka : Ketahuilah wahai kafir, adzab Allah akan diturunkan kepada kalian jika kalian tidak beriman, dan tidak ada keraguan atas hal itu. Akan tetapi aku tidaklah mengetahui akan datangnya adzab ini yang akan dataang dalam waktu dekat atau jauh."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kepada mereka jika mereka bertanya kepadamu, “Kapankah ancaman ini?” Oleh karena itu, pengetahuan terhadap hal itu ada pada sisi Allah Subhaanahu wa Ta'aala."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Jin Ayat 25",
    "description": "Kaum musyrik apabila diancam dengan siksa, seringkali melecehkan dan bertanya untuk tujuan mengejek, kapankah datangnya ancaman itu. Katakanlah wahai nabi Muhammad, 'aku tidak mengetahui, apakah azab yang diancamkan kepadamu itu sudah dekat ataukah tuhanku menetapkan waktunya masih lama, aku tidak diberitahu tentang hal itu. '26. Yang mengetahui secara pasti tentang datangnya azab itu hanyalah Allah, karena dia mengetahui yang gaib, tetapi dia tidak memperlihatkan kepada siapa pun tentang yang gaib itu."
  }
]