[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "25-28. Katakanlah (wahai Rasul) kepada orang-orang kafir itu, “Aku tidak tahu apakah azab yang diancamkan kepada kalian ini sudah dekat masanya ataukah Tuhanku menetapkan masa tenggat yang lama?” Allah mengetahui apa yang ghaib dari pandangan mata, Dia tidak memperlihatkannya kepada seorang pun dari makhlukNya, kecuali siapa yang Dia pilih untuk mengemban risalahNYa dan Dia ridhai, maka Dia membukakan sebagian hal ghaib. Allah mengirimkan para malaikat di depan dan dibelakang Rasul untuk menjaganya dari para jin, agar mereka tidak mengupingnya lalu membisikannya kepada para dukun, agar Rasul tahu bahwa para Rasul sebelumnya sama dengan dirinya, yaitu mereka menyampaikan kebenaran dengan jujur, dan bahwa dia dijaga sebagaimana para rasul dijaga dari jin. Dan bahwa ilmu Allah mencakup segala apa yang ada pada mereka, baik lahir maupun batin, berupa syariat-syariat, hukum-hukum dan lainnya, tidak ada sesuatu pun yang terlewatkan olehNya, dan juga bahwa Allah menghitung jumlah segala sesuatu, tidak ada sesuatu pun yang samar bagi Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "26. Dia lah -Subḥānahu- yang Maha Mengetahui segala yang gaib, tidak ada sesuatu pun dari hal itu yang luput dari Allah, dan Dia tidak menampakkan yang gaib itu kepada seorangpun, tapi tetap menjadikannya khusus di dalam ilmu-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "25-26. Katakanlah kepada orang-orang musyrik wahai Rasul: “Aku tidak tahu sama sekali, apakah azab yang telah dijanjikan kepada kalian itu dipercepat atau diperlambat. Hanya Allah-lah yang Maha Tahu tentang itu semua. Al-amad adalah masa yang sang sangat jauh. Allah Maha Tahu atas segala sesuatu yang ghoib (rahasia) dari para hamba-Nya, tidak ada seorangpun yang bisa mengetahui rahasia seorang makhluk kecuali Tuhannya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia mengetahui yang ghaib. Lalu Dia tidak memperlihatkan} tidak memperlihatkan {yang ghaib itu kepada siapa pun"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "25-26. “katakanlah “ kepada mereka bila mereka bertanya padamu tentang kapankah terjadinya ancaman itu, “Aku tidak mengetahui, apakah azab yang diancamkan kepadamu itu dekat ataukah Rabbku menjadikan bagi (kedatangan) azab itu, masa yang panjang,” yakni, jarak waktu yang panjang. Pengetahuan mengenai hal itu hanya ada di sisi Allah. “(Dia adalah Rabb) Yang Mengetahui yang ghaib, maka Dia tidak memperlihatkan kepada seorang pun tentang yang ghaib itu,” hanya Allah sendiri yang mengetahui isi hati, rahasia dan hal-hal ghaib."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Jin ayat 26: 26-27. Ketahuilah wahai manusia, bahwasanya Allah Maha Mengetahui dari apa yang tidak nampak dari pandangan makhluknya. Dan tidaklah mengetahui dari sesuatu yang ghaib kecuali bagi siapa yang diridhai-Nya, dipilih-Nya, dari para Rasul-Nya. Sungguh Allah menampakkan atas apa yang dikendaki-Nya dengan sebab terkandung kebaikan dalam berdakwah dan yang di dalamnya terkandung hikmah; Agar hal itu menjadi sebuah mukjizat bagi Rasul, kemudian Allah menjaga Rasul dengan malaikat yang menjangkau dari segala penjuru dan menjaganya dari setiap keburukan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Bahkan Dia sendiri yang mengetahui hal yang tersembunyi dan rahasia serta hal-hal gaib."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Jin Ayat 26",
    "description": "Yang mengetahui secara pasti tentang datangnya azab itu hanyalah Allah, karena dia mengetahui yang gaib, tetapi dia tidak memperlihatkan kepada siapa pun tentang yang gaib itu. 27. Kecuali kepada rasul yang diridai-Nya yaitu dari golongan malaikat maupun manusia. Apabila Allah hendak memperlihatkan yang gaib kepada rasul-Nya, maka sesungguhnya dia mengadakan penjaga-penjaga malaikat di depan dan di belakangnya."
  }
]