[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "25-28. Katakanlah (wahai Rasul) kepada orang-orang kafir itu, “Aku tidak tahu apakah azab yang diancamkan kepada kalian ini sudah dekat masanya ataukah Tuhanku menetapkan masa tenggat yang lama?” Allah mengetahui apa yang ghaib dari pandangan mata, Dia tidak memperlihatkannya kepada seorang pun dari makhlukNya, kecuali siapa yang Dia pilih untuk mengemban risalahNYa dan Dia ridhai, maka Dia membukakan sebagian hal ghaib. Allah mengirimkan para malaikat di depan dan dibelakang Rasul untuk menjaganya dari para jin, agar mereka tidak mengupingnya lalu membisikannya kepada para dukun, agar Rasul tahu bahwa para Rasul sebelumnya sama dengan dirinya, yaitu mereka menyampaikan kebenaran dengan jujur, dan bahwa dia dijaga sebagaimana para rasul dijaga dari jin. Dan bahwa ilmu Allah mencakup segala apa yang ada pada mereka, baik lahir maupun batin, berupa syariat-syariat, hukum-hukum dan lainnya, tidak ada sesuatu pun yang terlewatkan olehNya, dan juga bahwa Allah menghitung jumlah segala sesuatu, tidak ada sesuatu pun yang samar bagi Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "27. Kecuali atas Rasul yang diridai-Nya, sesungguhnya Dia menampakkan kepadanya sekehendak-Nya, dan Dia mengirimkan di sekitar Rasul para penjaga dari kalangan Malaikat yang menjaga hal gaib itu sehingga selain Rasul tidak ada yang mengetahuinya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "27. إِلَّا مَنِ ارْتَضَىٰ مِن رَّسُولٍ (Kecuali kepada rasul yang diridhai-Nya) Allah mengecualikan para rasul yang Dia ridhai, Allah memberi sebagian ilmu ghaib kepada mereka yang Dia kehendaki dari ilmu tersebut melalui wahyu, dan menjadikan itu sebagai mukjizat dan bukti atas kebenaran kenabian mereka. Adapun peramal yang menggunakan batu-batu kecil, membaca telapak tangan, atau mengusir burung bukanlah termasuk orang yang diridhai Allah; bahkan ia adalah orang yang kafir dan mengada-ada atas nama Allah dengan tebakan dan kedustaannya. فَإِنَّهُۥ يَسْلُكُ مِنۢ بَيْنِ يَدَيْهِ وَمِنْ خَلْفِهِۦ رَصَدًا (maka sesungguhnya Dia mengadakan penjaga-penjaga (malaikat) di muka dan di belakangnya) Allah memberi penjagaan bagi Rasulullah dengan para malaikat yang ada di depan dan belakangnya, mereka melindunginya dari gangguan setan-setan, karena ia telah mendapat sebagian ilmu ghaib dari Allah, sehingga setan bisa saja mencuri kabar hal ghaib darinya dan mengabarkannya kepada para dukun."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "27. Tidak ada seorangpun yang bisa mengungkap rahasia (perkara ghaib) seorang hamba kecuali para Rasul-Nya yang telah Allah pilih. Allah telah menjadikan dan mengutus malaikat sebagai penjaganya dari gangguan setan baik dari arah depan maupun belakang. Sehingga risalah dan wahyu Allah bisa disampaikan kepada manusia"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kecuali kepada rasul yang diridaiNya. Sesungguhnya Dia menempatkan} mengutus {penjaga-penjaga di depan dan di belakangnya} penjaga dari golongan malaikat yang selalu menjaganya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "27. “Kecuali pada rasul yang diridhaiNya,” Allah memberitahunya sesuai tuntutan hikmahNya untuk memberitahukan, sebab rasul tidak seperti manusia lainnya. Allah meneguhkan mereka dengan penguat yang tidak diberikan kepada orang lain dan Allah wahyu yang disampaikan padanya hingga para rasul bisa menyampaikannya pada manusia dengan sebenarnya tanpa didekati oleh para setan sehingga mereka mengurangi atau menambahi wahyu. Karena itu Allah berfirman, “Maka sesungguhnya Dia mengadakan penjaga-penjaga (malaikat) di muka dan di belakangnya,” menjaganya berdasarkan perintah Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Jin ayat 27: 26-27. Ketahuilah wahai manusia, bahwasanya Allah Maha Mengetahui dari apa yang tidak nampak dari pandangan makhluknya. Dan tidaklah mengetahui dari sesuatu yang ghaib kecuali bagi siapa yang diridhai-Nya, dipilih-Nya, dari para Rasul-Nya. Sungguh Allah menampakkan atas apa yang dikendaki-Nya dengan sebab terkandung kebaikan dalam berdakwah dan yang di dalamnya terkandung hikmah; Agar hal itu menjadi sebuah mukjizat bagi Rasul, kemudian Allah menjaga Rasul dengan malaikat yang menjangkau dari segala penjuru dan menjaganya dari setiap keburukan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maka Dia memberitahukannya sesuai kebijaksanaan-Nya untuk diberitahukan. Hal itu, karena para rasul tidak seperti selain mereka. Mereka dikuatkan oleh Allah dengan mukjizat yang menunjukkan kebenaran mereka dan dengan dijaga wahyu-Nya agar mereka menyampaikannya kepada manusia tanpa didekati oleh para setan sehingga mereka tidak bisa menambah atau menguranginya. Oleh karena itulah, Allah Subhaanahu wa Ta'aala berfirman, “Maka sesungguhnya Dia mengadakan penjaga-penjaga (malaikat) di depan dan di belakangnya.” Mereka akan menjaganya dengan perintah Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Jin Ayat 27",
    "description": "Kecuali kepada rasul yang diridai-Nya yaitu dari golongan malaikat maupun manusia. Apabila Allah hendak memperlihatkan yang gaib kepada rasul-Nya, maka sesungguhnya dia mengadakan penjaga-penjaga malaikat di depan dan di belakangnya. 28. Tujuan Allah melakukan penjagaan itu agar dia mengetahui bahwa rasul-rasul itu sungguh telah menyampaikan risalah tuhannya, sedang sebenarnya dengan ilmu dan kuasa-Nya meliputi secara rinci apa yang ada pada diri mereka, dan dia menghitung segala sesuatu satu persatu dan tidak satu pun yang luput dari pengetahuan-Nya."
  }
]