[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "25-28. Katakanlah (wahai Rasul) kepada orang-orang kafir itu, “Aku tidak tahu apakah azab yang diancamkan kepada kalian ini sudah dekat masanya ataukah Tuhanku menetapkan masa tenggat yang lama?” Allah mengetahui apa yang ghaib dari pandangan mata, Dia tidak memperlihatkannya kepada seorang pun dari makhlukNya, kecuali siapa yang Dia pilih untuk mengemban risalahNYa dan Dia ridhai, maka Dia membukakan sebagian hal ghaib. Allah mengirimkan para malaikat di depan dan dibelakang Rasul untuk menjaganya dari para jin, agar mereka tidak mengupingnya lalu membisikannya kepada para dukun, agar Rasul tahu bahwa para Rasul sebelumnya sama dengan dirinya, yaitu mereka menyampaikan kebenaran dengan jujur, dan bahwa dia dijaga sebagaimana para rasul dijaga dari jin. Dan bahwa ilmu Allah mencakup segala apa yang ada pada mereka, baik lahir maupun batin, berupa syariat-syariat, hukum-hukum dan lainnya, tidak ada sesuatu pun yang terlewatkan olehNya, dan juga bahwa Allah menghitung jumlah segala sesuatu, tidak ada sesuatu pun yang samar bagi Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "28. Dengan tujuan agar Rasul tahu bahwa para Rasul sebelumnya telah menyampaikan risalah-risalah Rabb mereka yang diperintahkan kepada mereka untuk menyampaikannya karena perhatian-Nya meliputi risalah-risalah itu dan ilmu-Nya meliputi apa yang ada pada para Malaikat dan para Rasul, tidak ada sesuatu pun dari hal itu yang luput dari-Nya, dan Allah menghitung jumlah segala sesuatu, tidak ada sesuatu pun dari bilangan itu yang luput dari-Nya -Subḥānahu-."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "28. Allah mengetahui dengan pasti bahwa para rasul terdahulu telah menyampaikan risalah dengan sebaik-baiknya. Dan ilmu Allah meliputi segalanya, termasuk tentang apa yang terjadi antara para rasul dengan kaum mereka, tentang segala hal yang kecil dan yang besar, yang tampak dan yang tersembunyi, yang terdahulu dan yang terkini, dan yang berlaku terus-menerus dan yang terhenti; ilmu Allah meliputi segala hal yang ghaib dan yang terlihat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "28. لِّيَعْلَمَ أَن قَدْ أَبْلَغُوا۟ رِسٰلٰتِ رَبِّهِمْ (Supaya Dia mengetahui, bahwa sesungguhnya rasul-rasul itu telah menyampaikan risalah-risalah Tuhannya) Yakni agar Allah mengetahui bahwa para rasul-Nya telah menyampaikan risalah dari-Nya. yakni dengan mengetahuinya secara nyata, bukan lewat ilmu-Nya. وَأَحَاطَ بِمَا لَدَيْهِمْ (sedang (sebenarnya) ilmu-Nya meliputi apa yang ada pada mereka) Yakni Allah meliputi para malaikat yang menjaga rasul, ata mengetahui para rasul yang menyampaikan risalah-Nya dan mengetahui apa yang terjadi dengan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "28. Agar Allah mengetahui dan menyaksikan bahwa para utusan-Nya telah menyampaikan risalah-Nya. Ilmu Allah meliputi apapun yang telah mereka laksanakan dan Dia menghitung segala sesuatu dengan sangat rinci dan teliti"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{agar Dia mengetahui bahwa (para rasul) benar-benar telah menyampaikan risalah-risalah Tuhan mereka, dan Dia meliputi apa yang ada pada mereka. Dia menghitung bilangan segala sesuatu}"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "28. “Supaya Dia mengetahui” dengan hal itu, “bahwa rasul-rasul itu sungguh telah menyampaikan risalah-risalah Rabbnya,” dengan menjadikan sebab-sebab pada mereka, “sedang (sebenarnya) ilmuNya meliputi apa yang ada pada mereka,” yakni apa saja yang ada pada mereka dan apa pun yang mereka rahasiakan dan tampakkan, “dan Dia menghitung segala sesuatu satu persatu.” Dalam surat ini terdapat beberapa faidah: Pertama : Keberadaan jin dan mereka adalah makhluk mukallaf yang juga diperintah dan dilarang, serta akan diberi balasan atas perbuatan mereka sebagaimana disebutkan secara jelas dalam surat ini dan surat lain. Kedua : Rasulullah juga diutus kepada bangsa jin sebagaimana beliau juga diutus kepada manusia. Allah mengalihkan segolongan jin untuk mendengarkan wahyu yang disampaikan padanya dan agar mereka menyampaikannya pada kaum mereka. Ketiga : Kecerdasan jin serta kemampuan mereka mengetahui kebenaran, dan bahwa yang mendorong mereka untuk beriman adalah petunjuk al-Quran dan etika baik dalam berbicara yang mereka wujudkan. Keempat : Perhatian Allah terhadap RasulNya dan penjagaanNya atas wahyu yang dibawa. Ketika berita kenabian Rasulullah dimulai, langit dijaga oleh bintang-bintang, para setan lari dari tempat mereka dan terhalang untuk mengintai. Dengan al-Quran, Allah merahmati penduduk bumi dengan rahmat yang tidak terkira dan Allah menghendaki petunjuk pada mereka. Allah hendak menampakkan sebagian dari AgamaNYa, syariat dan ma’rifat tentangNya yang dapat menggelorakan hati, yang membuat orang-orang berakal gembira, dan syiar-syiar Islam nampak dan para penyembah patung serta berhala terpuruk. Kelima : Begitu semangatnya para jin untuk mendengarkan al-Quran dari Rasulullah serta berkerumunnya mereka untuk itu. Keenam : Surat ini mencakup perintah bertauhid, larangan menyekutukan Allah, penjelasan tentang kondisi makhluk, tidak seorang pun berhak disembah sekecil apa pun, karena Rasulullah Muhammad sendiri tidak kuasa untuk menolong dan membahayakan seorang pun, bahkan tidak kuasa atas dirinya sendiri, sehingga dapat diketahui bahwa seluruh manusia juga sama. Adalah salah dan zhalim menjadikan orang yang sifatnya seperti ini sebagai sembahan-sembahan lain. Ketujuh : Pengetahuan-pengetahuan ghaib hanya diketahui Allah semata. Tidak ada seorang pun yang mengetahuinya kecuali orang yang diridhai dan dikhususkan untuk mengetahui sebagian darinya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Jin ayat 28: Allah menjelaskan menjaga para Rasul-Nya dengan malaikat, untuk menjamin bahwa kerisalahan dari Rabb mereka telah disampaikan, dengan tanpa tambahan maupun pengurangan, bersamaan dengan itu Allah Maha Mengetahui atas apa yang mereka kerjakan dahulu; Akan tetapi Allah Maha Adil, tidak menghisab seorang hamba kecuali telah dikerjakan perbuatannya. Sebagaimana ilmu Allah juga mencakup atas apa yang di sisi para utusan-Nya, tidaklah tersembunyi bagi-Nya sesuatupun dari urusan mereka. Dan Allah dapat menghitung segala sesuatunya di alam ini dengan perhitungan yang sempurna dan mengetahui secara sempurna."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Di alam nyata. Karena Dia telah mengadakan sebab-sebabnya. Baik yang mereka sembunyikan maupun yang mereka tampakkan. Syaikh As Sa’diy menyebutkan beberapa faedah dalam surah ini yang kesimpulannya sebagai berikut: - Adanya jin, dan bahwa mereka diperintah dan dilarang (diberikan beban atau kewajiban agama sebagaimana manusia), dan akan diberikan balasan. - Rasulullah shallallahu 'alaihi wa sallam juga diutus kepada jin sebagaimana Beliau diutus pula kepada manusia, karena Allah Subhaanahu wa Ta'aala menghadapkan segolongan jin kepada Beliau agar mereka mendengarkan wahyu-Nya dan menyampaikannya kepada kaum mereka. - Kecerdasan jin dan tahunya mereka terhadap kebenaran, dan bahwa yang mendorong mereka beriman adalah ketika mereka mengetahui secara pasti petunjuk Al Qur’an. - Bagusnya adab mereka (jin yang beriman itu) ketika berbicara. - Perhatian Allah kepada Rasul-Nya dan penjagaan-Nya kepada apa yang dibawa Rasul-Nya. Oleh karena itulah, ketika telah mulai pengangkatan kenabian, langit-langit dijaga dengan bintang-bintang (meteor), para setan pergi dari tempat-tempatnya, Allah merahmati bumi dan penduduknya dengan rahmat yang ditentukan-Nya dan Dia menginginkan kebaikan untuk mereka. Dia ingin menampakkan agama-Nya, syariat-Nya dan agar Dia dikenal di bumi sehingga hati pun senang dan cinta kepada-Nya, syiar-syiar agama-Nya pun tampak dan para penyembah berhala serta berhala itu musnah. - Semangatnya jin mendengarkan wahyu dan berdesakannya mereka untuknya. - Ayat ini juga mengandung perintah bertauhid dan larangan berbuat syirk, menerangkan keadaan makhluk dan bahwa seorang pun di antara mereka tidak berhak diibadahi. Hal itu, karena apabila Rasulullah shallallahu 'alaihi wa sallam tidak berkuasa memberikan manfaat dan menolak bahaya bagi seseorang bahkan bagi dirinya sedangkan Beliau adalah manusia paling utama dan paling sempurna, maka apalagi manusia yang lain. Oleh karena itu, merupakan kesalahan yang besar ketika mengambil makhluk sebagai tuhannya di samping Allah. - Hal gaib hanya Allah saja yang mengetahui; tidak ada seorang pun dari makhluk yang mengetahuinya kecuali Rasul yang diridhai-Nya, maka Allah perlihatkan sebagian kecil darinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Jin Ayat 28",
    "description": "Tujuan Allah melakukan penjagaan itu agar dia mengetahui bahwa rasul-rasul itu sungguh telah menyampaikan risalah tuhannya, sedang sebenarnya dengan ilmu dan kuasa-Nya meliputi secara rinci apa yang ada pada diri mereka, dan dia menghitung segala sesuatu satu persatu dan tidak satu pun yang luput dari pengetahuan-Nya. 1-4. Di akhir surah al-jinn dijelaskan tentang keagungan Al-Qur'an dan pemeliharaan Allah atas wahyu yang diturunkannya tersebut, sedangkan di awal surah ini berisi petunjuk kepada nabi Muhammad untuk mempersiapkan diri menghadapi turunnya wahyu yang berat. Wahai orang yang berselimut, yaitu nabi Muhammad! bangunlah untuk mengerjakan salat dan bermunajat kepada Allah pada malam hari, kecuali sebagian kecil dari waktu malammu dapat digunakan untuk istirahat tidur, yaitu separuhnya atau kurang sedikit dari itu, atau lebih dari seperdua itu, dan bacalah Al-Qur'an itu dengan perlahan-lahan dengan bacaan yang baik dan benar."
  }
]