[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "3. Mahatinggi keagungan Tuhan kami, Dia tidak mengambil istri maupun anak."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Dan kami beriman bahwa Dia -Mahatinggi keagungan dan kekuasaan Rabb kami- tidak mempunyai istri maupun anak sebagaimana yang dikatakan oleh orang-orang musyrik."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "3. Ayat ini dan ayat-ayat setelahnya menjelaskan ucapan para jin yang telah mendengarkan al-Qur’an. Mereka berkata kepada kaum mereka: “Setelah kami mendengar firman Allah itu, kami mengetahui bahwa Dia Maha Suci dari memiliki pasangan atau anak, Dia tidak membutuhkan apapun, dan Dia Maha Agung."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. وَأَنَّهُۥ تَعٰلَىٰ جَدُّ رَبِّنَا (dan bahwasanya Maha Tinggi kebesaran Tuhan kami) Yakni Maha Tinggi kebesaran-Nya. pendapat lain mengatakan: yakni kekuasaan-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Sesungguhnya Maha Agung dan Maha Tinggi Tuhan kami dari mengangkat teman perempuan (istri) atau anak sebagaimana yang dikatakan orang-orang kafir yang lemah itu. Al-Jaddu adalah Maha Agung"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya Maha tinggi keagungan Tuhan kami} Maha tinggi Tuhan Kami dan keagunganNya {Dia tidak beristri} istri {dan tidak pula beranak"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3. “Dan bahwasanya Mahatinggi kebesaran Rabb kami,” yakni, luhur keagunganNya dan suci nama-namaNya. “Dia tidak beristri dan tidak (pula) beranak.” Mereka mengetahui kemuliaan dan keagungan Allah yang menunjukkan mereka atas batilnya orang yang mengira bahwa Allah memiliki pendamping (istri) dan anak, karena Allah memiliki keagungan dan keluhuran, setiap sifatNya sempurna. Sedangkan memiliki pasangan dan anak menafikan hal itu, karena bertentangan dengan sempurnanya keesaanNya (yang tidak memerlukan yang lain)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Jin ayat 3: Kemudian berkata para jin yang mendengar Al Qur’an dengan memuji atas Allah : Sesungguhnya Allah Maha Tinggi dan Agung yaitu Tuhan kami, dan Yang Maha Suci Dzat-Nya dan Sifat-Nya dari mengambil istri atau memiliki anak, sebagaimana berkata mereka (yang menisbatkan) Allah memiliki istri dan anak, yaitu perkataan dari mereka manusia dan jin yang dungu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dari apa yang dinisbatkan kepada-Nya. Mereka mengetahui dari keagungan Allah dan kebesaran-Nya, batilnya orang yang mengatakan bahwa Allah punya istri dan anak karena Dia mempunyai keagungan dan kebesaran pada setiap sifat sempurna, sedangkan mempunyai istri atau anak menafikan hal itu karena bertentangan dengan sempurnanya kecukupannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Jin Ayat 3",
    "description": "Setelah para jin yang mendengar al qur'an tersebut berjanji tidak akan menyekutukan Allah, mereka kemudian memuji Allah dengan pujian yang tulus. Dan sesungguhnya mahatinggi keagungan tuhan kami sehingga tidak terjangkau oleh siapa pun dan apa pun, dia tidak beristri dan tidak beranak. '4-5. Jin yang mendengar bacaan Al-Qur'an tersebut melanjutkan testimoninya di hadapan kaumnya dengan menyatakan, \"dan sesungguhnya orang yang bodoh kurang sehat akalnya di antara kami dahulu selalu mengucapkan perkataan yang melampaui batas terhadap Allah yang maha esa, dan sesungguhnya kami mengira, bahwa manusia dan jin itu tidak akan mengatakan perkataan yang dusta terhadap Allah, dengan menasabkan sekutu, istri dan anak kepada-Nya. \"."
  }
]