[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "5. Kami menyangka tidak ada seorang pun yang berdusta atas Nama Allah, tidak dari kalangan manusia, tidak pula dari kalangan jin dengan menisbatkan istri dan anak kepada Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Dan Kami dahulu mengira bahwa orang-orang yang musyrik dari golongan manusia dan jin tidak berkata bohong ketika mereka mengklaim bahwa Allah mempunyai istri dan anak, lalu kami membenarkan ucapannya karena taklid terhadap mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. وَأَنَّا ظَنَنَّآ أَن لَّن تَقُولَ الْإِنسُ وَالْجِنُّ عَلَى اللَّـهِ كَذِبًا (dan sesungguhnya kami mengira, bahwa manusia dan jin sekali-kali tidak akan mengatakan perkataan yang dusta terhadap Allah) Yakni dahulu kami mengira bahwa jin dan manusia tidak melakukan kedustaan terhadap Allah saat mereka mengatakan bahwa Dia memiliki sekutu, pasangan, dan anak; sehingga kami mempercayai ucapan mereka ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Sesungguhnya kami meyakini dan menganggap bahwa manusia dan jin tidak akan berkata dusta terhadap Allah dengan menyekutukanNya dan menghubung-hubungkan bahwa Allah beristri dan beranak"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya kami mengira} Kami mengira {bahwa manusia dan jin itu tidak akan mengatakan perkataan yang dusta terhadap Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5. Maksudnya, kami sebelumnya tertipu. Dan yang menipu kami adalah para penguasa dan pemimpin dari kalangan jin dan manusia. Kami berbaik sangka pada mereka dan kami mengira mereka tidak akan berani berdusta atas nama Allah, karena itulah kami mengikuti mereka sebelumnya. Maka pada hari ini, karena kebenaran telah jelas bagi kami, kami mengikuti Nabi Muhammad kami taat pada beliau dan kami tidak mempedulikan perkataan siapa pun yang bertentangan dengan petunjuk."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Jin ayat 5: Berkata para jin yang mendengar Al Qur’an : Dan sesungguhnya kami tidak pernah berkhayal dan menduga bahwa ada seorangpun didapatu dari manusia dan jin yang mendustakan Allah. Dengan klaim mereka bahwa Allah memiliki teman, anak dan sekutu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni kami tertipu sebelumnya, dan yang membuat kami tertipu adalah para pemimpin kami dari kalangan jin dan manusia, kami terlalu bersangka baik dengan mereka dan mengira bahwa mereka tidak akan berani berdusta terhadap Allah. Oleh karena itulah, kami sebelumnya mengikuti mereka, namun sekarang kebenaran telah jelas bagi kami, kami pun kembali dan tunduk kepadanya dan tidak peduli dengan perkataan siapa pun yang bertentangan dengan petunjuk."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Jin Ayat 5",
    "description": "4-5. Jin yang mendengar bacaan Al-Qur'an tersebut melanjutkan testimoninya di hadapan kaumnya dengan menyatakan, \"dan sesungguhnya orang yang bodoh kurang sehat akalnya di antara kami dahulu selalu mengucapkan perkataan yang melampaui batas terhadap Allah yang maha esa, dan sesungguhnya kami mengira, bahwa manusia dan jin itu tidak akan mengatakan perkataan yang dusta terhadap Allah, dengan menasabkan sekutu, istri dan anak kepada-Nya. \"6. Masih melanjutkan ucapan jin tersebut, \"dan sesungguhnya ada beberapa orang laki-laki dari kalangan manusia di antaranya adalah tokoh-tokoh yang berpengaruh dalam masyarakatnya yang meminta perlindungan kepada beberapa tokoh laki-laki dari jin, tetapi mereka jin tersebut menjadikan mereka manusia bertambah sesat. Ada di antara orang-orang arab apabila mereka melintasi tempat yang sunyi, mereka minta perlindungan kepada jin yang mereka anggap berkuasa di tempat itu."
  }
]