[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "6. Ada beberapa orang manusia yang meminta perlindungan kepada beberapa jin, permintaan bantuan dari manusia kepada jin-jin itu justru membuat jin-jin tersebut menimpakan ketakutan, kecemasan dan kegelisahan yang lebih besar.’ Permohonan perlindungan yang Allah mencela orang-orang Jahiliyah karenanya ini, termasuk syirik akbar yang Allah tidak mengampuninya kecuali teubat nashuha. Ayat ini mengandung peringatan keras terhadap permintaan pertolongan kepada para tukang sihir, dukun, dan orang-orang seperti mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Dan bahwasanya di jaman Jahiliyah ada beberapa laki-laki dari golongan manusia meminta perlindungan kepada sekelompok laki-laki dari golongan jin saat mereka singgah di suatu tempat yang angker. Salah seorang di antara mereka berkata, “Aku berlindung dengan penguasa lembah ini dari kejahatan kaumnya yang bodoh.” Maka hal ini menambah rasa takut segolongan dari manusia terhadap segolongan jin."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "6. Dan kini juga telah jelas bagi kami apa yang dilakukan beberapa manusia yang berupa permohonan kepada para pemimpin jin agar mendapat perlindungan dari jin-jin lainnya. Sungguh permohonan ini membuat para pemimpin jin menjadi takjub, sehingga menjadikan mereka semakin angkuh dan sombong."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. وَأَنَّهُۥ كَانَ رِجَالٌ مِّنَ الْإِنسِ يَعُوذُونَ بِرِجَالٍ مِّنَ الْجِنِّ (Dan bahwasanya ada beberapa orang laki-laki di antara manusia meminta perlindungan kepada beberapa laki-laki di antara jin) Dikatakan bahwa dahulu orang-orang Arab jika terdapat orang yang seseorang yang akan memasuki sebuah lembah dan mengatakan: “aku berlindung kepada jin pengusa menunggu lembah ini dari keburukan para kaumnya yang kurang akal” maka ia akan bermalam dalam lindungan jin penguasa yang menunggu lembah itu hingga pagi. فَزَادُوهُمْ رَهَقًا (maka jin-jin itu menambah bagi mereka dosa dan kesalahan) Yakni jin-jin itu menambah dosa dan kesalahan manusia karena mereka meminta perlindungan kepada jin-jin itu. yakni manusia meminta perlindungan kepada jin dari jin itu sendiri sehingga menambah kelemahan dan ketakutan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Sesungguhnya ada beberapa laki-laki dari golongan manusia meminta perlindungan pada beberapa laki-laki dari golongan jin dalam perjalanan mereka. Kemudian laki-laki dari golongan jin itu menambahkan perlindungan kepada mereka dengan kezaliman, kesombongan, kesembronoan dan dosa. Ada seorang laki-laki Arab yang jatuh dalam lembah berkata: “Aku berlindung pada tuan dari lembah ini dari kejahatan makhluk-makhluk yang lebih lemah darinya” kemudian dia bermalam di situ sampai tiba waktu pagi. Dia (seperti) kumpulan biri-biri yang dipersembahkan untuk pemimpin lembah, sebagaimana ketika seekor serigala menangkap salah satu dari kumpulan biri-biri."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya ada beberapa orang laki-laki dari kalangan manusia yang meminta perlindungan} meminta perlindungan {kepada beberapa laki-laki dari kalangan jin sehingga mereka (jin) menjadikan mereka (manusia) bertambah sesat} dengan ini manusia bertambah takut dan khawatir terhadap jin"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6. Maksudnya, orang-orang bisa meminta perlindungan pada jin ketika merasa takut dan gentar. Mereka menyembahnya sehingga manusia semakin membuat jin bersalah karena melampaui batas dan takabbur ketika jin melihat manusia menyembah dan meminta perlindungan pada mereka. Kemungkinan kata ganti kembali pada “jin”, artinya jin semakin menambah takut manusia ketika melihat manusia meminta perlindungan pada mereka agar mendorong mereka untuk berlindung pada jin dan berpegang teguh di atas cara itu. Itulah sebabnya, dulu bila ada seseorang melintasi lembah yang menakutkan, ia berkata “Aku berlindung pada penguasa lembah ini dari oknum-oknum bodoh dari kaumnya.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Jin ayat 6: Berkata para jin yang mendengar Al Qur’an : Sungguh laki-laki dari kalangan manusia ada yang meminta pertolongan kepada laki-laki dari kalangan jin ketika mereka takut dan ketakutan, maka ketika memandang mereka (manusia) meminta perlindungan kepada jin ketika mereka ketakutan, maka para jin menambah ketakutan dalam hatinya dan menakut-nakuti sampai mereka (manusia) tambah keinginannya meminta perlindungan kepada jin. Dengan itu maka mereka (manusia) nampak ketika turun ke lembah, mereka berkata : Aku berlindung kepada penunggu lembah ini dari kebodohan kaum kami; Mereka menyangka bahwa jin mampu untuk menyelamatkan dan mencelakakan dengan tanpa izin Allah dan takdir-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ada di antara orang-orang Arab apabila mereka melintasi tempat yang sunyi, maka mereka minta perlindungan kepada jin yang mereka anggap berkuasa di tempat itu. Atau bisa maksudnya bertambah takut. Dan bisa juga maksudnya, bahwa perbuatan yang dilakukan manusia itu membuat jin bertambah sombong dan melampaui batas karena melihat manusia menyembah dan meminta perlindungan kepada mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Jin Ayat 6",
    "description": "Masih melanjutkan ucapan jin tersebut, \"dan sesungguhnya ada beberapa orang laki-laki dari kalangan manusia di antaranya adalah tokoh-tokoh yang berpengaruh dalam masyarakatnya yang meminta perlindungan kepada beberapa tokoh laki-laki dari jin, tetapi mereka jin tersebut menjadikan mereka manusia bertambah sesat. Ada di antara orang-orang arab apabila mereka melintasi tempat yang sunyi, mereka minta perlindungan kepada jin yang mereka anggap berkuasa di tempat itu. 7. Dan sesungguhnya mereka jin mengira seperti kamu orang kaum musyrik mekah yang juga mengira bahwa Allah tidak akan membangkitkan kembali siapa pun pada hari kiamat untuk dimintai pertanggungjawaban atas segala perbuatannya."
  }
]