[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "8. Kami (para jin) hendak naik ke langit untuk mencuri-curi dengar pembicaraan penghuninya, tetapi kami melihat langit penuh dengan para malaikat dalam jumlah besar yang menjaganya dan juga bola-bola api yang membakar yang dipakai melempar siapa yang mencoba mendekat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Dan sesungguhnya kami telah mencari kabar langit lalu kami dapati langit itu penuh dengan penjaga-penjaga yang kuat dari golongan Malaikat yang menjaganya dari curi dengar yang kami lakukan, dan dipenuhi dengan panah api yang dilemparkan kepada siapa saja yang mendekatinya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "8-9. Dan ketika kami mendekati langit untuk mencuri pembicaraan sebagaimana yang kami lakukan dahulu, maka sekarang kami terhalang oleh para malaikat penjaga yang sangat kuat, kemudian mereka melemparkan kobaran api kepada siapa saja yang berusaha mendekati langit; tidak ada lagi yang dapat selamat dari kobaran api itu setelah pengutusan Nabi Muhammad, padahal sebelumnya kami naik ke langit untuk mencuri kabar dari sana, dan dari kami masih ada yang dapat selamat dari kobaran api dengan membawa kebar berita ke bumi, lalu kami menyampaikan kabar itu kepada sekutu kami dari golongan manusia dengan mencampur kabar tersebut dengan berbagai macam kebohongan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. وَأَنَّا لَمَسْنَا السَّمَآءَ (dan sesungguhnya kami telah mencoba mengetahui (rahasia) langit) Yakni kami dahulu mencari kabar berita dari langit sebagaimana yang kami lakukan. فَوَجَدْنٰهَا مُلِئَتْ حَرَسًا(maka kami mendapatinya penuh dengan penjagaan) Yakni penjagaan dari para malaikat agar tidak terjadi pencurian kabar berita dari langit. شَدِيدًا (yang kuat) Yakni ketat. وَشُهُبًا (dan panah-panah api) Yakni dengan api yang berasal dari bintang-bintang, sebagaimana dijelaskan dalam tafsir firman Allah (وجعلناها رجوما وشهبا) pada surat al-Mulk. Penjagaan ini ada setelah Allah mengutus Nabi Muhammad, Allah menjaga langit dengan bintang yang terbakar setelah pengutusan Nabi Muhammad."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8. Sesungguhnya kami para jin, telah mencoba mendekati langit untuk mendengar dan menyimak rahasia langit. Namun kami mendapati langit itu penuh dengan penjagaan yang kuat dan bintang-bintang sebagai panah yang membakar.. Malaikat menjaga langit dari para pencuri kabar"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "“Sesungguhnya kami telah mencoba menyentuh langit} mencari kabar langit {Lalu kami mendapatinya penuh dengan penjagaan yang kuat dan panah-panah api} bintang-bintang yang membakar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8-9. “Dan bahwa kami telah mencoba mengetahui (rahasia) langit,” yakni, mendatanginya dan kami mencobanya, “maka kami mendapatinya penuh dengan jagaan yang kuat,” untuk bisa mencapai tepi dan mendekatinya sekalipun, “dan panah-panah api” dilemparkan pada jin yang mencuri pendengaran. Hal ini bertentangan dengan kebiasaan kami sebelumnya. Dulu kami mampu untuk mencapai berita langit, dan “kami dahulu dapat menduduki beberapa tempat di langit itu untuk mendengar-dengarkan (berita-beritanya),” sehingga kami pun banyak menukil berita-berita langit. “Tetapi sekarang barangsiapa yang (mencoba) mendengar-dengarkan (seperti itu), tentu akan menjumpai panah api yang mengintai (untuk membakarnya),” yakni mengintai dan siap untuk membinasakan dan membakarnya. Dan ini merupakan sesuatu yang besar dan berita yang agung. Mereka memastikan bahwa Allah menghendaki suatu kejadian besar di muka bumi, baik kejadian buruk ataupun baik. Karena itu para jin itu berkata,"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Jin ayat 8: Berkata para jin yang mendengar Al Qur’an : Sesungguhnya jin menginginkan sampainya berita dari langit dengan mendengar langsung ucapan penghuni langit, maka didapati setelah turunnya Al Qur’an (di langit) penuh penjaga yang ketat dalam bentuk panah dan malaikat yang menjaga langit yang membuat takut mereka (jin) lain yang mendengarnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Syuhub adalah jama’ syihaab yang artinya panah api atau meteor. Mereka dilimpari syuhub ketika hendak mencuri berita dari langit."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Jin Ayat 8",
    "description": "Setelah berbicara yang berkaitan dengan tidak adanya hari kebangkitan, jin tersebut yang telah sadar tersebut melanjutkan ucapannya, \"dan sesungguhnya kami jin telah mencoba berusaha keras untuk mengetahui rahasia langit, maka kami mendapatinya penuh dengan penjagaan yang kuat dari para malaikat dan panah-panah api yang menghalangi kami dan siapa pun untuk mendekat. \"9. \"dan sesungguhnya kami jin dahulu yaitu sebelum nabi Muhammad diutus Allah seringkali dapat menduduki satu tempat dari beberapa tempat di langit itu untuk mencuri dengar berita-beritanya ketika itu kami dapat mendengar tanpa gangguan apa pun. Tetapi sekarang setelah diutusnya nabi Muhammad siapa pun yang mencoba mencuri dengar seperti itu pasti akan menjumpai panah-panah api yang mengintai untuk membakarnya."
  }
]