[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "9. Sebelum itu kami punya tempat-tempat di langit untuk menguping pembicaraan di sana. Tetapi saat ini siapa yang berusaha mencuri pendengaran, niscaya dia mendapatkan bola api yang disiapkan yang membakar dan menghanguskannya. Dua ayat ini mengandung bantahan terhadap apa yang diklaim oleh para tukang sihir dan dukun yang mengklaim ilmu ghaib, lalu mereka menipu orang-orang lemah akal dengan kebohongan dan bualan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Dan bahwasanya kami dahulu mengambil beberapa tempat di langit untuk mendengarkan apa yang diperbincangkan oleh para Malaikat lalu kami mengabarkan kepada para dukun-dukun yang ada di bumi. Namun sekarang keadaan sudah berubah, maka barangsiapa dari kami sekarang ini yang mencuri dengar, maka ia akan mendapati api membara yang dipersiapkan untuknya. Jika ia mendekat, api tersebut akan dilemparkan kepadanya hingga membakarnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. وَأَنَّا كُنَّا نَقْعُدُ مِنْهَا مَقٰعِدَ لِلسَّمْعِ ۖ (dan sesungguhnya kami dahulu dapat menduduki beberapa tempat di langit itu untuk mendengar-dengarkan (berita-beritanya)) Agar mereka dapat mendengar dari malaikat berita-berita dari langit, sehingga mereka dapat menyampaikannya kepada para dukun. فَمَن يَسْتَمِعِ الْءَانَ يَجِدْ لَهُۥ شِهَابًا رَّصَدًا (Tetapi sekarang barangsiapa yang (mencoba) mendengar-dengarkan (seperti itu) tentu akan menjumpai panah api yang mengintai (untuk membakarnya)) Yakni api yang siap dilemparkan agar mencegah jin yang akan mencuri berita."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9. Dulu, kami para jin bisa menduduki beberapa tempat di penjuru langit untuk mendengarkan, menyimak dan mengamati kabar-kabar dari langit. Namun, setelah nabi akhir zaman Nabi SAW telah diutus, siapa yang mencoba mencuri kabar langit akan diintai oleh panah-panah api untuk mengejar dan membakarnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya kami dahulu selalu menduduki beberapa tempat} Kami menempati beberapa tempat di langit {untuk mencuri dengar. Akan tetapi, sekarang siapa saja yang mencuri dengar pasti akan menjumpai panah api yang mengintai} mengintainya, untuk dilemparkan kepadanya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8-9. “Dan bahwa kami telah mencoba mengetahui (rahasia) langit,” yakni, mendatanginya dan kami mencobanya, “maka kami mendapatinya penuh dengan jagaan yang kuat,” untuk bisa mencapai tepi dan mendekatinya sekalipun, “dan panah-panah api” dilemparkan pada jin yang mencuri pendengaran. Hal ini bertentangan dengan kebiasaan kami sebelumnya. Dulu kami mampu untuk mencapai berita langit, dan “kami dahulu dapat menduduki beberapa tempat di langit itu untuk mendengar-dengarkan (berita-beritanya),” sehingga kami pun banyak menukil berita-berita langit. “Tetapi sekarang barangsiapa yang (mencoba) mendengar-dengarkan (seperti itu), tentu akan menjumpai panah api yang mengintai (untuk membakarnya),” yakni mengintai dan siap untuk membinasakan dan membakarnya. Dan ini merupakan sesuatu yang besar dan berita yang agung. Mereka memastikan bahwa Allah menghendaki suatu kejadian besar di muka bumi, baik kejadian buruk ataupun baik. Karena itu para jin itu berkata,"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Jin ayat 9: Berkata para jin yang mendengar Al Qur’an : Dahulu jin sebelum diutusnya Muhammad ﷺ memiliki tempat di langit untuk mendengarkan berita dari langit dan mengabarkan kabar tersbut kepada para dukun, akan tetapi siapa saja sekarang yang mencoba untuk mendengar kabar dari langit akan ketakutan setelah diturunkannya Al Qur’an karena didapati adanya panah yang siap memanah sampai membakar mereka dan membinasakannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang dimaksud dengan sekarang, ialah waktu setelah Nabi Muhammad shallallahu 'alaihi wa sallam diutus menjadi rasul. Dari sini mereka mengetahui, bahwa Allah Subhaanahu wa Ta'aala hendak mengadakan sesuatu yang besar di bumi; entah sesuatu itu baik atau buruk, sebagaimana yang diterangkan dalam ayat selanjutnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Jin Ayat 9",
    "description": "\"dan sesungguhnya kami jin dahulu yaitu sebelum nabi Muhammad diutus Allah seringkali dapat menduduki satu tempat dari beberapa tempat di langit itu untuk mencuri dengar berita-beritanya ketika itu kami dapat mendengar tanpa gangguan apa pun. Tetapi sekarang setelah diutusnya nabi Muhammad siapa pun yang mencoba mencuri dengar seperti itu pasti akan menjumpai panah-panah api yang mengintai untuk membakarnya. 10. Perubahan yang terjadi sebelum dan sesudah diutusnya nabi Muhammad itu, tidak diketahui persis oleh para jin, maka mereka pun menegas'kan, \"dan sesungguhnya kami jin tidak mengetahui adanya penjagaan yang ketat itu apakah keburukan yang dikehendaki orang yang di bumi ataukah tuhan mereka menghendaki kebaikan baginya. \"."
  }
]