[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sungguh Allah telah mendengar ucapan Khaulah binti Tsa’labah yang mengadu kepadamu tentang suaminya Aus bin ash-Shamit, berkaitan dengan apa yang dilakukan oleh Aus terhadap Khaulah, yaitu menzhiharnya. Dia mengucapkan kepadanya, “Kamu bagiku sudah seperti punggung ibuku”, yakni dalam hal pengharaman pernikahan. Khaulah memohon kepada Allah agar mengangkat kesulitannya. Allah mendengar perbincangan dan pembicaraan kalian berdua. Sesungguhnya Allah Maha Mendengar setiap perkataan, Maha Melihat segala sesuatu, tidak ada sesuatu pun yang samar bagiNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Allah telah mendengar ucapan seorang wanita (yaitu Khaulah binti Ṡa'labah) yang melapor kepadamu -wahai Rasul- tentang kondisi suaminya (yaitu Aus bin Aṣ-Ṣāmit) ketika suaminya menziharnya, dan mengadukan kepada Allah apa yang diperbuat oleh suaminya kepadanya, dan Allah mendengar perbincangan antara kalian berdua, tak ada sesuatu pun darinya yang luput dari Allah, sesungguhnya Allah Maha Mendengar perkataan hamba-hamba-Nya dan Maha Mengetahui segala perbuatan mereka, tidak ada sedikit pun yang luput dari-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1. Hai Rasulullah, sungguh Allah telah mendengar perkataan Khaulah binti Tsa’labah yang berbicara denganmu mengenai suaminya, Aus bin as-Shamit yang men-zhiharnya dengan perkataan, ‘Kamu bagiku seperti ibuku’ -yakni sama-sama haram untuk dinikahi-. Ketika itu Khaulah berharap kepada Allah agar memberi ketetapan tentang perkaranya. Allah Maha Mendengar perkataan kalian berdua dalam peristiwa itu. Dia Maha Mendengar segala perkataan dan Maha Melihat segala kejadian dan perbuatan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. قَدْ سَمِعَ اللهُ قَوْلَ الَّتِى تُجٰدِلُكَ فِى زَوْجِهَا (Sesungguhnya Allah telah mendengar perkataan wanita yang mengajukan gugatan kepada kamu tentang suaminya) Yakni meminta pertimbanganmu kembali dalam urusannya. وَتَشْتَكِىٓ إِلَى اللهِ(dan mengadukan (halnya) kepada Allah) Aisyah berkata: Maha Suci Allah Yang Maha Mendengar segalanya, sungguh aku mendengar perkataan Khaulah binti Tsa’abah namun ia merahasiakan dariku sebagiannya, ketika ia mengadukan suaminya kepada Rasulullah, ia berkata: “hai Rasulullah, suamiku telah menghabiskan masa mudaku, dan perutku menjadi melar demi dirinya; namun ketika umurku telah lanjut dan aku tidak dapat melahirkan lagi, ternyata dia men-dhihar-ku. Ya Allah, aku mengadu kepada-Mu.” Aisyah melanjutkan: “Tidak lama setelah itu Jibril turun dengan ayat-ayat ini: قَدْ سَمِعَ اللهُ قَوْلَ الَّتِى تُجٰدِلُكَ فِى زَوْجِهَ, dan suaminya adalah Aus bin Shamit, salah seorang dari kaum Anshar. وَاللهُ يَسْمَعُ تَحَاوُرَكُمَآ (Dan Allah mendengar soal jawab antara kamu berdua) Yakni Allah mendengar percakapan kalian berdua."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1. Ayat-ayat mulia ini turun berkenaan dengan seseorang dari kalangan Anshar ketika istrinya mengadukan perihalnya kepada Rasulullah yang mengharamkan dirinya setelah sekian bersama dan memiliki banyak anak. Suaminya adalah orang yang sudah tua. Istrinya mengadu perihal kondisinya dan kondisi suaminya kepada Allah dan RasulNya secara berulang-ulang, lalu Allah berfirman, “Sungguh Allah telah mendengar perkataan yang mengajukan gugatan kepada kamu tentang suaminya, dan mengadukan (halnya) kepada Allah. Dan Allah mendengar soal jawab antara kamu berdua.” Yakni, pembicaraan kalian di antara kalian berdua, “Sesungguhnya Allah Maha Mendengar,” semua pembicaraan di seluruh waktu meski dengan keperluan yang diatur rapi, “Lagi Maha Melihat,” yang bisa melihat langkah semut hitam di atas batu hitam pekat di dalam kegelapan malam. Ini merupakan pemberitahuan tentang sempurnanya penglihatan serta pendengaran Allah. Pandangan dan penglihatan Allah meliputi segala hal yang rumit dan besar sekalipun. Di dalam ayat ini juga mencakup isyarat bahwa Allah akan menghapus masalah yang diadukan serta menghilangkan musibahnya. Karena itu Allah menyebutkan hukumnya dan hukum yang lain secara umum seraya berfirman (dalam ayat selanjutnya)"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "1. Allah telah mengabulkan doa dan permohonan seorang istri untuk memberi jalan keluar terhadap permasalahan hidupnya. Perempuan itu mengadukan tentang perilaku suaminya terhadap dirinya kepadamu wahai Nabi. Perempuan itu adalah Khaulah binti Tsa’labah, istri Aus bin Shamit. Allah mendengar pembicaraan kamu berdua, Allah Maha Mendengar segala perkataan dan Maha Melihat atas segala kejadian dan perbuatan. Diriwayatkan dari Al Hakim yang di benarkan dari Aisyah, Aisyah berkata: Maha Suci Allah yang pendengaran-Nya meliputi segala sesuatu. Aku benar-benar telah mendengar perkataan Khaulah binti Tsa’labah yang sedikit dirahasiakan. Dia mengadukan suaminya kepada Rasul SAW, dia berkata: Wahai Rasul, suamiku telah mengisap masa mudaku, aku bentangkan perutku untuknya, dan manakala usiaku sudah tua dan aku tidak bisa mengandung lagi, tiba-tiba dia melakukan dhihar (menyamakannya dengan ibunya si suami) kepadaku. Ya Allah aku mengadu kepada-Mu. Sehingga sebelum Khaulah bangkit pulang, Jibril telah turun membawa ayat ini (ayat 1), dia adalah Aus bin Shamit"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh Allah telah mendengar ucapan wanita yang mengajukan gugatan kepadamu} yang melapor kepadamu, yaitu Khaulah binti Tsa’labah RA {tentang suaminya} yaitu Aus bin Shamit RA {dan mengadukan kepada Allah, dan Allah mendengar percakapan kalian. Sesungguhnya Allah Maha Mendengar lagi Maha Melihat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1. Ayat-ayat mulia ini turun berkenaan dengan seseorang dari kalangan Anshar ketika istrinya mengadukan perihalnya kepada Rasulullah yang mengharamkan dirinya setelah sekian bersama dan memiliki banyak anak. Suaminya adalah orang yang sudah tua. Istrinya mengadu perihal kondisinya dan kondisi suaminya kepada Allah dan RasulNya secara berulang-ulang, lalu Allah berfirman, “Sungguh Allah telah mendengar perkataan yang mengajukan gugatan kepada kamu tentang suaminya, dan mengadukan (halnya) kepada Allah. Dan Allah mendengar soal jawab antara kamu berdua.” Yakni, pembicaraan kalian di antara kalian berdua, “Sesungguhnya Allah Maha Mendengar,” semua pembicaraan di seluruh waktu meski dengan keperluan yang diatur rapi, “Lagi Maha Melihat,” yang bisa melihat langkah semut hitam di atas batu hitam pekat di dalam kegelapan malam. Ini merupakan pemberitahuan tentang sempurnanya penglihatan serta pendengaran Allah. Pandangan dan penglihatan Allah meliputi segala hal yang rumit dan besar sekalipun. Di dalam ayat ini juga mencakup isyarat bahwa Allah akan menghapus masalah yang diadukan serta menghilangkan musibahnya. Karena itu Allah menyebutkan hukumnya dan hukum yang lain secara umum seraya berfirman (dalam ayat selanjutnya)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mujadalah ayat 1: Surat ini diawali dengan kabar dari Nabi ﷺ, bahwa Allah telah mendengar perkataan wanita yang membicarakan urusan suaminya, ia memohon kepada Allah dan menyebut apa yang tidak halal dia sebut, serta sesuatu yang dibenci dan musibah yang menimpanya. Wanita ini bernama Khaulah binti Tsa’labah yang ia datang kepada nabi ﷺ dan berkata : Bahwasanya suaminya yaitu Aus bin Shamit Al Anshari mendziharnya, ia menyebutkan kepada Nabi ﷺ bahwa suaminya telah bersenang-senang dengan (Khaulah) kemudian melahirkan anak, maka ketika anak tersebut telah berumur dewasa, (Aus) medziharnya. Ketahuilah wahai Nabi Allah bahwasanya Allah mendengar apa yang kalian berdua bicarakan, atau mendengar apa yang ia (perempuan) itu katakan kepadamu, dana apa yang kamu katakan kepadanya; Sesungguhnya Allah Maha Mendengar segala jenis suara apapun, Maha Melihat atas segala sesuatu. Oleh sebab ini Allah mendengar percakapanmu dan menurunkan hukum dzihar. Dzihar adalah suami yang berkata kepada istrinya : Engkau (istriku) seperti punggung ibuku atau saudara perempuanku dengan kata lain, engkau haram bagiku, (dan ini merupakan pengamalan yang diamalkan di masa jahiliyyah), maka engkau (istriku) lakukanlah apa yang kamu suka (kehendaki). Maka datang islam dengan mengharamkannya. Maka seseorang yang melakukan hal itu, diberi batasan waktu sampai empat bulan, jika ia rujuk, dan menjima’ istrinya, maka yang tersisa adalah celaan baginya (karena telah melakukan amalan jahiliyyah, dll.). Adapun jika lewat batas waktu empat bulan dan ia tidak rujuk atau menjima’ istrinya, maka hakim akan menghukumi sebagai talak yang sah kepada istrinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Imam Ahmad meriwayatkan dengan sanadnya yang sampai kepada Aisyah radhiyallahu 'anha ia berkata, “Segala puji bagi Allah Yang Pendengaran-Nya meliputi segala sesuatu. Sungguh, ada seorang wanita yang mengajukan gugatan datang kepada Nabi shallallahu 'alaihi wa sallam berbicara dengan Beliau, sedangkan aku berada di pojok rumah, aku tidak mendengar apa yang diucapkannya, maka Allah Subhaanahu wa Ta'aala menurunkan ayat, “Sungguh, Allah telah mendengar ucapan perempuan yang mengajukan gugatan kepadamu (Muhammad) tentang suaminya…dst.” (Hadits ini diriwayatkan pula oleh Bukhari secara mu’allaq, Nasa’i, Ibnu Majah, Ibnu Jarir dan Hakim. Ia berkata, “Shahih isnadnya,“ dan didiamkan oleh Adz Dzahabi) Sebab turunnya ayat ini ialah berhubungan dengan persoalan seorang wanita bernama Khaulah binti Tsa´labah yang telah dizhihar oleh suaminya Aus ibn Shamit, yaitu dengan mengatakan kepada isterinya, “Kamu bagiku seperti punggung ibuku,” dengan maksud dia tidak boleh lagi menggauli isterinya, sebagaimana ia tidak boleh menggauli ibunya. Menurut adat Jahiliyah, kalimat Zhihar seperti itu sama seperti menalak isterinya. Maka Khaulah mengadukan hal itu kepada Rasulullah shallallahu 'alaihi wa sallam. Rasulullah shallallahu 'alaihi wa sallam menjelaskan, bahwa dalam hal ini belum ada keputusan dari Allah. Dalam riwayat yang lain Rasulullah mengatakan, “Engkau telah diharamkan bersetubuh dengannya.” Lalu Khaulah berkata, “Suamiku belum menyebutkan kata-kata thalak.” kemudian Khaulah berulang kali mendesak Rasulullah shallallahu 'alaihi wa sallam agar menetapkan suatu keputusan dalam hal ini, sehingga kemudian turunlah ayat ini dan ayat-ayat berikutnya. Yang menzhiharnya, yakni suaminya berkata kepada istrinya, “Engkau bagiku seperti punggung ibuku.” Atau seperti mahramnya yang lain selain ibunya. Atau mengatakan, “Engkau bagiku adalah haram.” Dalam menzhihar biasanya disebutkan kata, “zhahr” (punggung), oleh karenanya, Allah Subhaanahu wa Ta'aala menamainya dengan zhihar. Tentang kesendiriannya, kefakirannya, dan mengkhawatirkan keadaan anak-anaknya jika diserahkan kepada suaminya, maka mereka akan terlantar atau jika diserahkan kepada dirinya, tentu anak-anaknya kelaparan. Dan lagi suaminya sudah sangat tua. Semua suara di setiap waktu dan dengan beragam kebutuhan. Dia melihat rayapan semut yang hitam di atas batu yang hitam di kegelapan malam. Hal ini merupakan pemberitahuan tentang sempurnanya pendengaran dan penglihatan-Nya dan mengena kepada semua perkara yang besar maupun kecil. Di dalam kata-kata ini terdapat isyarat, bahwa Allah Subhaanahu wa Ta'aala akan menghilangkan keluhannya dan mengangkat musibahnya. Oleh karena itu, pada ayat selanjutnya Dia menyebutkan hukum tentangnya dan hukum selainnya secara umum."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mujadalah Ayat 1",
    "description": "Pada akhir surah al-had'd Allah menyeru orang-orang beriman agar taat kepada rasul-Nya, niscaya Allah akan memberikan cahaya dan mengampuni mereka. Pada ayat ini dijelaskan, sungguh, Allah telah mendengar ucapan perempuan yang mengajukan gugatan kepadamu tentang suaminya, yang telah menzihar dirinya, yaitu menganggap dirinya sama dengan ibu kandungnya sehingga haram digauli, dan dia pun mengadukan keadaan itu kepada Allah agar Allah memberikan kepastian hukum tentang kasus zihar tersebut dan Allah mendengar percakapan di antara kamu berdua bersama perempuan yang bernama khaulah binti 'a'labah yang dizihar suaminya tersebut. Sesungguhnya Allah maha mendengar semua jenis percakapan yang terbuka maupun tertutup, maha melihat yang tampak maupun yang tersembunyi. 2. Orang-orang, yakni para suami, di antara kamu yang menzihar istrinya, yaitu menyamakan status hukum istrinya dengan ibunya, yaitu memandang keduanya sama-sama haram digauli, karena tidak lagi menyukainya. Suami yang memperlakukan istrinya demikian telah berbuat kesalahan yang berat, karena istri mereka itu bukanlah ibunya sehingga tidak haram digauli. Mereka tidak menyadari bahwa ibu-ibu mereka adalah perempuan yang telah melahirkannya. Dan sesungguhnya mereka, para suami yang menzihar istrinya, benar-benar telah mengucapkan suatu perkataan yang mungkar karena ucapan itu hanya alasan bahwa ia tidak lagi menyukai istrinya dan merupakan ucapan dusta, karena tidak sesuai dengan fakta bahwa istri itu berbeda dengan ibu kandungnya. Dan sesungguhnya Allah maha pemaaf kepada siapa saja yang menyadari kesalahannya bahwa ia telah menzihar istrinya; maha pengampun kepada yang bertobat dengan tulus."
  }
]