[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya berbicara secara rahasia dengan sesuatu yang mengandung dosa dan permusuhan adalah dari godaan setan, dialah yang menghiasinya dan yang mendorong kepadanya agar menyusupkan kesedihan kedalam hati orang-orang beriman, walaupun hal itu tidak mengganggu orang-orang beriman sedikit pun kecuali dengan izin Allah dan kehendakNya. Dan hendaknya hanya kepada Allah semata orang-orang Mukmin menyerahkan segala urusan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Sesungguhnya bisik-bisik itu -yang mengandung dosa, permusuhan dan kemaksiatan terhadap Rasul- adalah bagian dari upaya setan untuk memperindah (yang buruk) dan gangguannya terhadap para penolong-penolongnya, untuk memasukkan kesedihan ke hati orang-orang beriman, bahwa mereka tertipu oleh setan. Setan dan upayanya untuk memperindah yang buruk itu sedikitpun tidak bisa menimpakan mudarat kepada orang-orang yang beriman kecuali dengan kehendak dan keinginan Allah. Dan kepada Allah saja hendaknya orang-orang yang beriman bersandar dalam segala urusan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. إِنَّمَا النَّجْوَىٰ (Sesungguhnya pembicaraan rahasia itu) Yakni yang mengandung dosa dan permusuhan serta pelanggaran terhadap Rasulullah. مِنَ الشَّيْطٰنِ(adalah dari syaitan) Yakni akibat setan yang menghiasinya. لِيَحْزُنَ الَّذِينَ ءَامَنُوا۟( supaya orang-orang yang beriman itu berduka cita) Yakni agar dapat menimpakan mereka kesedihan akibat dugaan mereka yang mengira mereka dijadikan sasaran tipu daya. وَلَيْسَ بِضَآرِّهِمْ شَيْـًٔا(sedang pembicaraan itu tiadalah memberi mudharat sedikitpun kepada mereka) Yakni tidaklah setan itu atau pembicaraan yang dihiasi setan itu dapat memberi bahaya sedikitpun bagi orang-orang beriman. إِلَّا بِإِذْنِ اللهِ ۚ( kecuali dengan izin Allah) Yakni dengan kehendak-Nya. وَعَلَى اللهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُونَ(dan kepada Allah-lah hendaknya orang-orang yang beriman bertawakkal) Yakni menyerahkan segala urusan mereka kepada-Nya, dan memohon perlindungan kepada-Nya dari setan, serta tidak menghiraukan pembicaraan rahasia mereka. Imam bukhari, Muslim, dan lainnya mengeluarkan hadits dari Ibnu Mas’ud, ia berkata, Rasulullah bersabda: “Jika kalian sedang bertiga, maka janganlah dua orang diantara kalian itu saling berbisik tanpa menyertakan orang yang ketiga, sebab itu akan menimbulkan kesedihan baginya.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10. Sesungguhnya berbisik dalam hal dosa dan permusuhan adalah bisikan setan bukan dari Allah, yang bertujuan untuk menyibukkan manusia dalam kesedihan. Namun, setan tidak akan mampu mendatangkan bahaya kepada orang mukmin kecuali atas kehendak dan izin Allah. Hanya kepada Allah-lah hendaknya orang mukmin bergantung dan menyerahkan segala urusan. Qatadah berkata bahwa orang-orang munafik saling berbisik diantara mereka, menyombongkan diri dihadapan orang mukmin sehingga yang membuat orang mukmin gusar. Maka turunlah ayat ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya pembicaraan rahasia itu} sesungguhnya percakapan rahasia tentang perbuatan dosa, permusuhan, dan kemaksiatan terhadap Rasul {hanyalah dari setan} penghiasan dari setan {agar orang-orang yang beriman itu bersedih hati, Dan itu tidaklah memberi mudharat sedikit pun kepada mereka, kecuali dengan izin Allah. Hanya kepada Allah hendaknya orang-orang mukmin bertawakal"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "10. Allah berfirman, “Sesungguhnya pembicaraan rahasia itu,” maksudnya pembicaraan rahasia yang dilakukan musuh-musuh kaum Mukminin terhadap orang-orang Mukmin untuk menipu dan mencari-cari kejelekan itu, berasal dari setan yang tipu dayanya lemah dan makarnya tidak berguna, “supaya orang-orang yang beriman itu berduka cita.” Inilah tujuan dan maksud dari makar mereka. “Sedang pembicaraan itu tiadalah memberi mudarat sedikitpun kepada mereka, kecuali dengan izin Allah,” karena Allah menjanjikan penjagaan dan kemenangan untuk orang-orang Mukmin atas musuh-musuh mereka. Allah berfirman, “Rencana yang jahat itu tidak akan menimpa selain orang yang merencanakannya sendiri” -Fathir:43- Para musuh Allah, RasulNya, dan orang-orang Mukmin meski memiliki makar dan rencana buruk, dampak bahayanya akan kembali pada mereka sendiri dan tidak ada sesuatu pun yang membahayakan kaum Mukminin kecuali yang telah ditakdirkan Allah. “dan kepada Allah-lah hendaknya orang-orang beriman bertawakal.” Maksudnya, hendaklah orang-orang yang beriman bergantung pada Allah serta percaya akan janjiNya, sebab siapa saja yang bertawakal kepada Allah akan diberi kecukupan; diberi kecukupan dalam agama dan dunianya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mujadalah ayat 10: Ketahuilah wahai orang-orang yang beriman bahwasanya berbisik-bisik akan dosa, permusuhan dan kemaksiatan kepada utusan-Nya akan menjadikan setan memperindah (percakapan dalam bisikan tersebut) dan tenggelam dalam keburukan; Karena sebab akan jatuhnya perasaan sedih di dalam hati yang telah beriman. Dan bisikan munafik dan yahudi tidak membahayakan orang-orang yang beriman sedikitpun, karena Allah menjanjikan kepada mereka kecukupan, pertolongan akan musuh-musuh mereka. Dan kepada Allah bertawakkal orang-orang yang beriman, dan percaya akan janji-Nya dan memasrahkan segala urusan mereka kepada-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni pada pembicaraan musuh-musuh kaum mukmin terhadap orang-orang mukmin yang isinya makar, tipu saya dan keinginan buruk adalah berasal dari setan yang tipu dayanya lemah. Inilah tujuan dan maksud dari makar itu. Hal itu, karena Allah Subhaanahu wa Ta'aala telah menjanjikan kaum mukmin untuk memberikan kecukupan dan pertolongan-Nya, Dia menjelaskan bahwa makar yang buruk tidaklah menimpa kecuali kepada pelakunya. Oleh karena itu, betapa pun mereka telah berbisik-bisik dan membuat makar, namun bahayanya kembali menimpa mereka dan tidak membayahakan kaum mukmin kecuali sedikit sesuai yang telah ditentukan Allah Subhaanahu wa Ta'aala. Yakni bersandar kepada-Nya dan percaya terhadap janji-Nya, karena barang siapa bertawakkal kepada Allah, maka Allah akan mencukupkannya dan mengurus urusan agama dan dunianya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mujadalah Ayat 10",
    "description": "Orang beriman dilarang mengadakan pembicaraan rahasia karena pembicaraan rahasia itu karakter setan dalam menghasut manusia membangkitkan permusuhan dan kebencian. Sesungguhnya pembicaraan rahasia itu termasuk perbuatan setan dalam membujuk manusia mengikuti strateginya: berpaling dari Allah, mengikuti dorongan rendah dan membawa manusia kepada jurang kemaksiatan agar orang-orang beriman itu setelah tertipu strategi setan menyesal dan bersedih hati, sedang pembicaraan rahasia itu tidaklah memberi bencana sedikit pun kepada mereka, orang-orang beriman, kecuali dengan izin Allah. Dan hanya kepada Allah hendaknya orang-orang yang beriman bertawakal, menyerahkan hidup dan kehidupannya lahir batin setelah merencanakan secara optimal dan berusaha secara maksimal. 11. Pada ayat yang lalu Allah memerintahkan kaum muslim agar menghindarkan diri dari perbuatan berbisik-bisik dan pembicaraan rahasia, karena akan menimbulkan rasa tidak enak bagi muslim lainnya. Pada ayat ini, Allah memerintahkan kaum muslim untuk melakukan perbuatan yang menimbulkan rasa persaudaraan dalam semua pertemuan. Wahai orang-orang yang beriman apabila dikatakan kepadamu, dalam berbagai forum atau kesempatan, 'berilah kelapangan di dalam majelis-majelis, agar orang-orang bisa masuk ke dalam ruangan itu, ' maka lapangkanlah jalan menuju majelis tersebut, niscaya Allah akan memberi kelapangan untukmu dalam berbagai kesempatan, forum, atau majelis. Dan apabila dikatakan kepada kamu dalam berbagai tempat, 'berdirilah kamu untuk memberi penghormatan, ' maka berdirilah sebagai tanda kerendahan hati, niscaya Allah akan mengangkat derajat orang-orang yang beriman di antaramu karena keyakinannya yang benar, dan Allah pun akan mengangkat orang-orang yang diberi ilmu, karena ilmunya menjadi hujah yang menerangi umat, beberapa derajat dibandingkan orang-orang yang tidak berilmu. Dan Allah mahateliti terhadap niat, cara, dan tujuan dari apa yang kamu kerjakan, baik persoalan dunia maupun akhirat."
  }
]