[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang yang membenarkan Allah dan rasulNya serta melaksanakan syariatNya, bila kalian diminta agar sebagian dari kalian melapangkan majelis untuk sebagian yang lain, maka lakukanlah, niscaya Allah akan melapangkan kalian di dunia dan akhirat. Bila kalian (wahai orang-orang yang beriman) diminta agar bangkit dari majelis kalian untuk suatu hajat yang mengandung kebaiukan bagi kalian, maka bangkitlah. Allah akan meninggikan kedudukan orang-orang beriman yang ikhlas di antara kalian. Allah meninggikan derajat ahli ilmu dengan derajat-derajat yang banyak dalam pahala dan derajat meraih keridhaan. Allah Mahateliti terhadap amal-amal kalian, tidak ada sesuatu yang samar bagiNya, dan Dia akan membalas kalian atasnya. Ayat ini menyanjung kedudukan para ulama dan keutamaan mereka, serta ketinggian derajat mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Wahai orang-orang yang beriman kepada Allah dan melaksanakan apa yang disyariatkan kepada mereka, jika dikatakan kepada kalian, “Berlapang-lapanglah kalian di dalam majlis-majlis.” Maka lapangkanlah, niscaya Allah melapangkan bagi kalian kehidupan dunia dan di Akhirat. Dan jika dikatakan kepada kalian, “Bangkitlah dari majlis agar orang yang memiliki keutamaan duduk padanya.” Maka bangkitlah, niscaya Allah -Subḥānahu- mengangkat orang-orang yang beriman di antara kalian dan orang-orang yang diberi ilmu pengetahuan dengan beberapa derajat yang agung. Dan Allah Maha Mengetahui apa yang kalian kerjakan, tidak ada sesuatu pun dari perbuatan kalian yang luput dari-Nya, dan Dia akan membalas kalian atas perbuatan tersebut."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "11. Dan Allah memerintahkan orang-orang beriman agar melapangkan tempat duduk untuk yang lain jika mereka diminta hal itu, dan agar mereka berdiri dari majelis mereka untuk melakukan hal yang bermanfaat. Kemudian Allah menyampaikan kabar gembira bagi orang-orang beriman dan berilmu bahwa mereka akan ditinggikan derajatnya di surga. Allah Maha Mengetahui segala perbuatan mereka, dan Allah akan membalas mereka atas perbuatan tersebut. Ibnu Umat meriwayatkan secara marfu’ bahwa Rasulullah melarang seseorang menyuruh orang lain untuk berdiri dari tempat duduknya agar dia dapat menempati tempat itu. Namun hendaklah mereka saling meluaskan dan melapangkan tempat bagi orang lain. (Shahih al-Bukhari, kitab meminta izin, bab janganlah seseorang menyuruh orang lain untuk berdiri dari tempat duduknya, no. 2670)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "11. يٰٓأَيُّهَا الَّذِينَ ءَامَنُوٓا۟ إِذَا قِيلَ لَكُمْ تَفَسَّحُوا۟ فِى الْمَجٰلِسِ (Hai orang-orang beriman apabila dikatakan kepadamu: “Berlapang-lapanglah dalam majlis”) Allah memerintahkan mereka untuk saling menjaga adab, dengan melapangkan tempat duduk bagi yang lain dalam sebuah majelis. Qatadah dan Mujahid mengatakan: dahulu mereka saling berlomba-lomba untuk dapat mengikuti majelis Rasulullah, maka mereka diperintahkan untuk saling melapangkan tempat bagi orang lain. فَافْسَحُوا۟ يَفْسَحِ اللهُ لَكُمْ ۖ( maka lapangkanlah niscaya Allah akan memberi kelapangan untukmu) Yakni maka lapangkanlah tempat bagi orang lain niscaya Allah akan melapangkan surga kalian. Hal ini berlaku pada setiap majelis tempat berkumpul kaum muslimin yang mengandung kebaikan dan pahala, baik itu dalam membicarakan urusan perang, zikir, atau pada saat khutbah jum’at. Setiap orang lebih berhak terhadap tempat yang lebih dahulu dia tempati, namun dia dianjurkan untuk melapangkan tempat bagi saudaranya yang lain. Rasulullah bersabda: “Dilarang seseorang menyuruh orang lain untuk berpindah dari tempat duduknya kemudian dia duduk di tempatnya. Namun hendaklah saling melapangkan tempat duduk bagi yang lain.” وَإِذَا قِيلَ انشُزُوا۟ فَانشُزُوا۟( Dan apabila dikatakan: “Berdirilah kamu”) Yakni jika sebagian orang yang duduk di majelis itu diminta untuk berdiri dari tempat duduknya agar orang yang dimuliakan dalam agama dan orang yang berilmu dapat duduk di tempat itu maka hendaklah mereka berdiri. يَرْفَعِ اللهُ الَّذِينَ ءَامَنُوا۟ مِنكُمْ وَالَّذِينَ أُوتُوا۟ الْعِلْمَ دَرَجٰتٍ ۚ( Allah akan meninggikan orang-orang yang beriman di antaramu dan orang-orang yang diberi ilmu pengetahuan beberapa derajat) Yakni Allah mengangkat derajat orang yang berilmu diantara kalian dengan kemuliaan di dunia dan pahala di akhirat. Maka barangsiapa yang beriman dan memiliki ilmu maka Allah akan mengangkat derajatnya dengan keimanannya itu dan mengangkat derajatnya dengan ilmunya pula; dan salah satu dari itu adalah Allah mengangkat derajat mereka dalam majelis-majelis."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Wahai orang yang beriman, jika dikatakan kepada kalian: berikan keluasan/kelapangan di dalam tempat duduk (majelis) untuk para pendahulu kalian. Maka Allah akan meluaskan rahmat-Nya berupa keluasan tempat, jiwa, rizki, surga dan sebagainya kepada kalian. Apabila dikatakan kepada kalian: Berdirilah untuk memberi kelapangan kepada para pendahulu kalian dengan cekatan. Maka Allah akan meluaskan tempat kalian di dunia dan di surga. Allah mengangkat derajat para ulama beberapa derajat dalam kemuliaan dan posisi yang tinggi di dunia dan akhirat sebab berpadunya ilmu dan amal mereka. Sesungguhnya Allah Maha mengetahui segala amal kalian. Ini adalah ancaman bagi mereka yang tidak menjalankan perintah-Nya. Qatadah berkata: Pernah ketika ada kelompok orang yang ikut perang Badar baru datang dalam majelis mereka dan kemudian diperintahkan untuk berdiri melapangkan tempat, mereka menunjukkan roman tidak suka kepada perintah rasul SAW. Maka turunlah ayat ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, apabila dikatakan kepada kalian,“Berilah kelapangan} lapangkanlah {di dalam majelis-majelis” lapangkanlah} lapangkanlah {niscaya Allah akan memberi kelapangan kepada kalian} Allah akan memberi kelapangan kepada kalian di dunia dan akhirat {Apabila dikatakan,“Berdirilah”} berdirilah dari sebagian majelis, agar orang yang mempunyai karunia duduk di sana {Maka berdirilah} maka berdirilah dari sana {niscaya Allah akan mengangkat orang-orang yang beriman di antara kalian dan orang-orang yang diberi ilmu beberapa derajat. Allah Maha Mengetahui terhadap apa yang kalian kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11. Ini adalah ajaran dari allah untuk para hambaNya yang beriman ketika mereka berada dalam majelis perkumpulan, yang sebagian dari mereka ada orang yang baru datang meminta agar tempat duduk diperluas. Termasuk bersopan santun dalam hal ini adalah dengan memberikan kelonggaran tempat baginya agar maksudnya bisa terpenuhi, bukan untuk mengganggu orang yang memberi kelonggaran tempat tersebut. Maksud saudaranya pun terpenuhi tanpa harus terganggu. Balasan itu berdasarkan jenis amal. Siapa pun yang memberi kelonggaran, maka akan diberi kelonggaran oleh Allah, siapa pun yang memberi keleluasaan pada saudaranya, maka Allah akan memberinya keleluasaan. “Dan apabila dikatakan, ‘Berdirilah kamu’,” artinya berdirilah dari tempat duduk kalian, karena adanya suatu keperluan mendesak, “maka berdirilah,” maksudnya segeralah berdiri agar kemaslahatan tercapai, karena melaksanakan hal seperti ini termasuk bagian dari ilmu dan iman. Allah akan mengangkat derajat orang yang berilmu dan beriman berdasarkan ilmu dan keimanan yang Allah berikan pada mereka. “Dan Allah Maha Mengetahui apa yang kamu kerjakan.” Masing-masing diberi balasan berdasarkan amalnya. Perbuatan baik akan dibalas baik dan perbuatan buruk akan dibalas buruk. Di dalam ayat ini terdapat penjelasan tentang keutamaan ilmu. Dan keindahan serta buah dari ilmu adalah dengan beradab dengan adab-adab ilmu serta menunaikan tuntutannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mujadalah ayat 11: Wahai orang-orang yang dia beriman kepada Allah dan Rasul-Nya ﷺ jika dikatakan kepada kalian : berlapang-lapanglah dalam majelis kalian, maka lapangkanlah, Allah akan melapangkan kalian di dunia dan akhirat. Dan jika dikatakan kepada kalian juga : Bangkitlah dan berdirilah dari majelis kalian karena sebab di antara sebab; Maka bagi kalian wajib bersegera melaksanakan perintah dan menjawab agar mendapatkan kebaikan secara umum; Ketahuilah bahwasanya Allah akan mengangkat derajat orang-orang yang beriman dan mentauhidkan-Nya, dan yang membenarkan Rasul-Nya ﷺ serta mengikutinya, Allah akan berikan derajat yang tinggi, dan Allah akan berika derajat keilmuan dan keimanan, Allah akan angkat derajat kalian di dunia dan di akhirat. Allah Maha Tahu atas seluruh amalan-amalan kalian, tidak tersembunyi sesuatupun, dan akan dihisab kalian dengan amalan-amalan kalian, dan dibalas dengannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini merupakan pemberian adab dari Allah Subhaanahu wa Ta'aala kepada hamba-hamba-Nya yang mukmin, yaitu apabila mereka berkumpul dalam suatu majlis dan sebagian mereka atau sebagian orang yang datang butuh diberikan tempat duduk agar diberikan kelapangan untuknya. Hal itu, tidaklah merugikan orang yang duduk sedikit pun sehingga tercapai maksud saudaranya tanpa ada kerugian yang diterimanya. Dan balasan disesuaikan dengan jenis amalan, barang siapa yang melapangkan, maka Allah Subhaanahu wa Ta'aala akan memberikan kelapangan untuknya. Di surga. Untuk shalat tahiyyatul masjid, atau untuk melakukan kebaikan lainnya atau karena kebutuhan yang muncul. Agar terwujud maslahat itu, karena berdiri dalam hal seperti ini termasuk ilmu dan iman, dan Allah Subhaanahu wa Ta'aala akan meninggikan orang-orang yang berilmu dan beriman dengan beberapa derajat sesuai yang Allah berikan kepadanya berupa ilmu dan iman. Di surga. Oleh karena itu, Dia akan membalas setiap orang yang beramal dengan amalnya, jika baik maka akan dibalas dengan kebaikan dan jika buruk, maka akan dibalas dengan keburukan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mujadalah Ayat 11",
    "description": "Pada ayat yang lalu Allah memerintahkan kaum muslim agar menghindarkan diri dari perbuatan berbisik-bisik dan pembicaraan rahasia, karena akan menimbulkan rasa tidak enak bagi muslim lainnya. Pada ayat ini, Allah memerintahkan kaum muslim untuk melakukan perbuatan yang menimbulkan rasa persaudaraan dalam semua pertemuan. Wahai orang-orang yang beriman apabila dikatakan kepadamu, dalam berbagai forum atau kesempatan, 'berilah kelapangan di dalam majelis-majelis, agar orang-orang bisa masuk ke dalam ruangan itu, ' maka lapangkanlah jalan menuju majelis tersebut, niscaya Allah akan memberi kelapangan untukmu dalam berbagai kesempatan, forum, atau majelis. Dan apabila dikatakan kepada kamu dalam berbagai tempat, 'berdirilah kamu untuk memberi penghormatan, ' maka berdirilah sebagai tanda kerendahan hati, niscaya Allah akan mengangkat derajat orang-orang yang beriman di antaramu karena keyakinannya yang benar, dan Allah pun akan mengangkat orang-orang yang diberi ilmu, karena ilmunya menjadi hujah yang menerangi umat, beberapa derajat dibandingkan orang-orang yang tidak berilmu. Dan Allah mahateliti terhadap niat, cara, dan tujuan dari apa yang kamu kerjakan, baik persoalan dunia maupun akhirat. 12. Pada ayat sebelumnya Allah memerintahkan agar orang-orang beriman mengembangkan adab yang baik, yaitu saling memberikan tempat dalam pertemuan tanda saling menghormati dan menumbuhkan persaudaraan. Allah pun meninggikan derajat orang yang beriman, berilmu, dan beramal dengan ilmunya itu. Pada ayat ini, Allah menerangkan bahwa para sahabat yang ingin menghadap nabi diperintahkan mengembangkan adab yang baik, yaitu bersedekah terlebih dahulu guna menyucikan dirinya. Wahai orang-orang yang beriman! apabila kamu mengadakan pembicaraan khusus dengan rasul untuk berkonsultasi tentang masalah yang sangat pribadi, hendaklah kamu mengeluarkan sedekah (kepada orang miskin) agar diri kamu menjadi bersih dari penyakit kikir, juga untuk mengurangi beban beliau menerima orang-orang yang tidak berkepentingan, sebelum (melakukan) pembicaraan itu. Yang demikian itu, bersedekah kepada fakir miskin sebelum berkonsultasi dengan nabi, lebih baik bagimu, karena kamu berbagi dan peduli dengan orang-orang kecil dan lebih bersih, karena kamu membuang sifat kikir dan cinta harta yang berlebihan. Tetapi jika kamu tidak memperoleh harta atau uang (yang akan disedekahkan) sebelum bertemu nabi karena kemiskinan, maka sungguh, Allah maha pengampun kepada orang yang hendak bersedekah, tetapi tidak sanggup, maha penyayang kepada hamba yang baik hati."
  }
]