[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang yang membenarkan Allah dan RasulNya serta melaksanakan syariatNya, bila kalian hendak berbicara kepada Rasulullah secara rahasia empat mata, maka sebelum itu berikanlah sedekah kepada orang-orang yang membutuhkan. Ini lebih baik bagi kalian, karena ini mengandung pahala dan lebih bersih bagi hati kalian dari dosa. Namun bila kalian tidak memiliki sesuatu untuk disedekahkan, maka tidak mengapa, karena sesungguhnya Allah Maha Pengampun bagi hamba-hambaNya yang beriman lagi Maha Penyayang kepada mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Ketika banyak sahabat yang mengadakan pembicaraan khusus dengan Nabi -ṣallallāhu 'alaihi wa sallam-, Allah berfirman, “Wahai orang-orang yang beriman, jika kalian menginginkan pembicaraan khusus dengan Rasul, maka hendaknya kalian membayarkan sedekah sebelum pembicaraan itu. Membayarkan sedekah itu lebih baik bagi kalian dan lebih bersih karena mengandung ketaatan kepada Allah yang bisa membersihkan hati. Jika kalian tidak mempunyai apa yang bisa kalian sedekahkan, maka tidak mengapa bagi kalian untuk berbicara khusus dengan Rasul, sesungguhnya Allah Maha Pengampun atas dosa-dosa hamba-Nya dan Maha Penyayang terhadap mereka karena tidak membebani mereka kecuali sebatas kemampuan mereka.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "12-13. Allah mendorong para sahabat untuk memberikan sedekah kepada orang-orang yang membutuhkan, sebelum mereka berbicara dengan Rasulullah secara rahasia. Pendahuluan ini merupakan hal yang lebih baik bagi kalian, karena mengandung pertolongan bagi orang lain dan pahala, serta lebih menyucikan hati kalian. Dan jika kalian tidak memiliki harta yang dapat kalian sedekahkan maka tidak mengapa kalian tidak bersedekah terlebih dahulu, karena Allah Maha Pengampun dan Pengasih bagi hamba-hamba-Nya yang beriman. Kemudian Allah menegaskan hal ini: Hai orang-orang beriman, apakah kalian takut jatuh miskin jika kalian menyedekahkan sebagian harta bagi orang yang membutuhkan sebelum kalian melakukan pembicaraan rahasia dengan Rasulullah? Jika kalian tidak bersedekah terlebih dahulu karena itu memberatkan kalian, dan Allah telah mengampuni kalian dan mengangkat kesulitan kalian dengan membolehkan tidak bersedekah terlebih dahulu, maka senantiasalah mendirikan shalat dan menunaikan zakat, dan taatilah perintah Allah dan rasul-Nya dalam setiap keadaan kalian. Allah Maha Mengetahui segala perbuatan yang kalian lakukan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "12. يٰٓأَيُّهَا الَّذِينَ ءَامَنُوٓا۟ إِذَا نٰجَيْتُمُ الرَّسُولَ فَقَدِّمُوا۟ بَيْنَ يَدَىْ نَجْوَىٰكُمْ صَدَقَةً ۚ (Hai orang-orang beriman, apabila kamu mengadakan pembicaraan khusus dengan Rasul hendaklah kamu mengeluarkan sedekah (kepada orang miskin) sebelum pembicaraan itu) Yakni jika kalian hendak berbicara dengan Raulullah secara khusus tentang suatu urusan kalian maka hendaklah kalian bersedekah sebelum itu. Allah menurunkan ayat ini, sehingga orang-orang jahat tidak lagi berbicara dengan Rasulullah secara khusus karena mereka enggan mengeluarkan sedekah sebelum melakukan pembicaraan, dan orang-orang berimanpun merasa kesulitan karena mereka tidak mampu mengeluarkan sedekah, sehingga mereka tidak dapat melakukan pembicaraan dengan Rasulullah secara khusus; maka Allah memberi keringanan bagi mereka dengan ayat setelah ayat ini. ذٰلِكَ(Yang demikian itu) Yakni melakukan sedekah sebelum melakukan pembicaraan khusus dengan Rasulullah. خَيْرٌ لَّكُمْ وَأَطْهَرُ ۚ( lebih baik bagimu dan lebih bersih) Karena terdapat ketaatan kepada Allah di dalamnya. فَإِن لَّمْ تَجِدُوا۟ فَإِنَّ اللهَ غَفُورٌ رَّحِيمٌ(jika kamu tidak memperoleh (yang akan disedekahkan) maka sesungguhnya Allah Maha Pengampun lagi Maha Penyayang) Yakni barangsiapa yang tidak memiliki sesuatu untuk disedekahkan maka tidak mengapa kalian mengadakan pembicaraan dengan Rasulullah secara khusus tanpa mengeluarkan sedekah terlebih dahulu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12. Wahai orang-orang yang beriman apabila kamu hendak berbicara khusus kepada rasul tentang sesuatu yang rahasia, maka sedekahlah dahulu untuk fakir miskin. Sebagai pengagungan/penghormatan kepada rasul SAW. Sedekah itu adalah baik bagi kalian di sisi Allah. Sedekah itu dapat membersihkan jiwa. Namun apabila kamu tidak mendapati sesuatu untuk disedekahkan, maka tidak apa-apa. Allah Maha Pengampun atas pembicaraanmu, dan Allah Maha Penyayang kepada kalian"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, apabila kalian (ingin) melakukan pembicaraan rahasia dengan Rasul} Kalian berbicara rahasia dengan Rasul {hendaklah kalian mengeluarkan sedekah sebelum pembicaraan itu. Hal itu lebih baik bagi kalian dan lebih bersih. Akan tetapi jika kalian tidak mendapatinya, sesungguhnya Allah Maha Pengampun lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "12. Allah memerintahkan kaum Mukminin untuk bersedekah ketika mengadakan pembicaraan khusus dengan Rasulullah sebagai pengajaran dan pembelajaran bagi mereka serta sebagai pengagungan terhadap Rasulullah. Karena penghormatan ini lebih baik dan lebih suci bagi orang-orang yang beriman. Maksudnya, dengan penghormatan dan pengagungan tersebut, kebaikan dan pahala kalian akan semakin bertambah, sehingga kalian akan memperoleh kesucian dari berbagai kotoran yang di antaranya adalah tidak adanya penghormatan dan sopan santun terhadap Rasulullah karena terlalu banyak membicarakan masalah rahasia dengan Rasulullah yang tidak ada manfaatnya. Ketika berbicara rahasia dengan Rasulullah diperintahkan untuk memberikan sedekah terlebih dahulu, hal ini menjadi ukuran bagi orang yang benar-benar menginginkan ilmu dan kebaikan sehingga tidak peduli seberapa besar sedekah yang dikeluarkan. Dan bagi siapa saja yang tidak menginginkan kebaikan namun hanya bermaksud memperbanyak bicara saja, maka ia bisa menghentikan kebiasaan yang memberatkan Rasulullah. Ketentuan ini berlaku bagi orang yang bisa memberikan sedekah, sedangkan bagi mereka yang tidak bisa memberikan sedekah, Allah tidak mempersempit baginya tapi Allah memberi kelonggaran dan membolehkan mengadakan pembicaraan rahasia dengan Rasulullah tanpa harus memberi sedekah yang tidak mampu diberikan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mujadalah ayat 12: Allah memerintah para sahabat (Rasul ﷺ) yang mulia, jika mereka menginginkan berbicara dengan Rasul ﷺ dari urusan yang tidak boleh semua orang tahu, maka bagi mereka wajib untuk mendahulukan amalan sedekah, yang disedekahkan kepada para faqir dan miskin. Karena itu semua lebih baik bagi mereka, karena di dalam malan tersebut terkandung ketaatan kepada Allah dan pensucian diri. Jika tidak memiliki sesuatu yang dapat disedekahkan, maka Allah memaklumi kalian, karena Allah sungguh memberikan rukhsah kepada kalian dari meminta dengan tanpa mendahulukan sedekah, dan bahwasanya Allah Maha Pengampun bagi hamba-Nya yang bertaubat, mengasihi mereka. Telah disyariatkan syariat sedekah di sini setelah para sahabat banyak bertanya dengan urusan yang tidak ada hubungannya dengan sedekah, maka ditetapkanlah syariat sedekah agar mereka bertanya tentangnya, yang diwajibkan bagi kaum muslimin."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memerintahkan kaum mukmin untuk bersedekah sebelum mengadakan pembicaraan dengan Rasulullah shallallahu 'alaihi wa sallam sebagai pemberian adab dan pengajaran untuk mereka dan untuk memuliakan Rasulullah shallallahu 'alaihi wa sallam. Hal itu, karena memuliakan Rasulullah shallallahu 'alaihi wa sallam lebih baik bagi orang-orang mukmin, yakni lebih memperbanyak kebaikan dan pahala mereka serta lebih menyucikan mereka dari noda dosa yang di antaranya adalah meninggalkan sikap menghormati Rasulullah shallallahu 'alaihi wa sallam dan beradab terhadap Beliau dengan banyak melakukan pembicaraan yang tidak ada manfaatnya. Oleh karena itu, ketika diperintahkan bersedekah sebelum melakukan pembicaraan dengan Beliau, maka yang demikian merupakan mizan (tambangan) bagi orang yang menginginkan kebaikan dan ilmu, sehingga ia pun mau bersedekah, tetapi bagi orang yang tidak memiliki keinginan kepada kebaikan yang maksudnya adalah semata-mata banyak berbicara dengan Beliau, maka ia pun menahan diri -karena ada perintah bersedekah itu- dari berbicara yang tidak ada faedahnya yang memberatkan Rasulullah shallallahu 'alaihi wa sallam. Hal ini tertuju kepada orang yang mampu bersedekah, adapun orang yang tidak mampu bersedekah, maka Allah Subhaanahu wa Ta'aala tidak memberatkannya bahkan memaafkan dan memakluminya dan membolehkan baginya berbincang-bincang tanpa mengeluarkan sedekah terlebih dahulu dimana ia tidak sanggup mengeluarkannya. Selanjutnya, ketika Allah Subhaanahu wa Ta'aala melihat beratnya mereka mengeluarkan sedekah untuk setiap kali pembicaraan, maka Dia memudahkan mereka dan tidak menghukum mereka karena tidak bersedekah sebelumnya, namun memuliakan Beliau dan menghormatinya tidaklah dimansukh (dihapus), karena hal ini termasuk perkara yang disyariatkan karena sebab yang lain, bukan maksud itu sendiri, bahkan maksudnya adalah beradab terhadap Rasulullah shallallahu 'alaihi wa sallam dan memuliakan Beliau, dan Allah Subhaanahu wa Ta'aala memerintahkan mereka beberapa perkara besar yang merupakan maksudnya, Dia berfirman, “Tetapi jika kamu tidak melakukannya dan Allah telah memberi ampun kepadamu, maka laksanakanlah shalat, dan tunaikanlah zakat serta taatlah kepada Allah dan Rasul-Nya!” Ayat ini kemudian dimansukh dengan ayat setelahnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mujadalah Ayat 12",
    "description": "Pada ayat sebelumnya Allah memerintahkan agar orang-orang beriman mengembangkan adab yang baik, yaitu saling memberikan tempat dalam pertemuan tanda saling menghormati dan menumbuhkan persaudaraan. Allah pun meninggikan derajat orang yang beriman, berilmu, dan beramal dengan ilmunya itu. Pada ayat ini, Allah menerangkan bahwa para sahabat yang ingin menghadap nabi diperintahkan mengembangkan adab yang baik, yaitu bersedekah terlebih dahulu guna menyucikan dirinya. Wahai orang-orang yang beriman! apabila kamu mengadakan pembicaraan khusus dengan rasul untuk berkonsultasi tentang masalah yang sangat pribadi, hendaklah kamu mengeluarkan sedekah (kepada orang miskin) agar diri kamu menjadi bersih dari penyakit kikir, juga untuk mengurangi beban beliau menerima orang-orang yang tidak berkepentingan, sebelum (melakukan) pembicaraan itu. Yang demikian itu, bersedekah kepada fakir miskin sebelum berkonsultasi dengan nabi, lebih baik bagimu, karena kamu berbagi dan peduli dengan orang-orang kecil dan lebih bersih, karena kamu membuang sifat kikir dan cinta harta yang berlebihan. Tetapi jika kamu tidak memperoleh harta atau uang (yang akan disedekahkan) sebelum bertemu nabi karena kemiskinan, maka sungguh, Allah maha pengampun kepada orang yang hendak bersedekah, tetapi tidak sanggup, maha penyayang kepada hamba yang baik hati. 13. Melalui ayat ini Allah memberi dispensasi kebolehan menghadap rasulullah tanpa bersedekah terlebih dahulu. Allah berfirman, 'apakah kamu takut menjadi miskin karena kamu memberikan sedekah sebelum melakukan pembicaraan khusus dengan rasul' jika kamu tidak mampu melakukannya, yakni bersedekah kepada fakir miskin sebelum berjumpa dengan nabi dan Allah telah memberi ampun kepadamu karena kamu beristigfar dan benar-benar tidak mampu bersedekah, kamu diberikan dispensasi untuk berjumpa dengan beliau tanpa bersedekah terlebih dahulu kepada fakir miskin, maka sebagai kompensasinya, laksanakanlah salat, dan tunaikanlah zakat serta taatlah kepada Allah dan rasul-Nya! karena salat menyempurnakan ketaatan kepada Allah dan menjauhkan kamu dari perbuatan keji dan mungkar, sedangkan zakat menyucikan jiwa dan harta kamu. Dan Allah mahateliti terhadap niat, cara dan tujuan dari apa yang kamu kerjakan, baik persoalan dunia maupun akhirat. '"
  }
]