[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah kalian takut miskin bila kalian memberikan sedekah sebelum kalian berbicara empat mata dengan Rasulullah? Bila kalian tidak melakukan apa yang diperintahkan kepada kalian dan Allah mengampuni kalian, memberikan keringanan kepada kalian dengan membolehkan kalian tidak melakukannya, maka tegakkanlah shalat, berikanlah zakat dengan teguh dan konsisten, serta taatilah Allah dan RasulNya dalam apa yang diperintahkan kepada kalian. Allah Mahateliti terhadap amal-amal kalian dan akan membalas kalian atasnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "13. Apakah kalian khawatir menjadi fakir disebabkan karena mengeluarkan sedekah jika kalian akan mengadakan pembicaraan dengan Rasul? Jika kalian tidak mampu mengerjakan apa yang diperintahkan oleh Allah dalam hal ini dan Allah telah mengampuni kalian dengan memberikan keringanan bagi kalian untuk meninggalkannya, maka kerjakanlah salat dengan sempurna, berikanlah zakat dari hartamu dan taatilah Allah dan Rasul-Nya. Sesungguhnya Allah Maha Mengetahui apa yang kalian kerjakan, tidak ada sesuatu pun dari perbuatan kalian yang luput dari-Nya dan Dia akan membalas kalian atas perbuatan tersebut."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "13. ءَأَشْفَقْتُمْ أَن تُقَدِّمُوا۟ بَيْنَ يَدَىْ نَجْوَىٰكُمْ صَدَقٰتٍ ۚ (Apakah kamu takut akan (menjadi miskin) karena kamu memberikan sedekah sebelum mengadakan pembicaraan dengan Rasul?) Yakni apakah kalian akan menjadi miskin dan kesusahan karena mengeluarkan sedekah untuk itu? Muqatil mengatakan: hukum ini berlaku selama sepuluh malam, kemudian dinasakh setalah itu. فَإِذْ لَمْ تَفْعَلُوا۟( Maka jika kamu tiada memperbuatnya) Yakni melakukan sedekah yang diperintahkan kepada kalian sebelum melakukan pembicaraan itu disebabkan kesulitan kalian. وَتَابَ اللهُ عَلَيْكُمْ(dan Allah telah memberi taubat kepadamu) Dengan memberi keringanan bagi kalian dengan membolehkan untuk tidak bersedekah terlebih dahulu. فَأَقِيمُوا۟ الصَّلَوٰةَ وَءَاتُوا۟ الزَّكَوٰةَ(maka dirikanlah shalat, tunaikanlah zakat) Yakni jika kalian tidak mampu mengeluarkan sedekah sebelum pembicaraan itu maka tetaplah kalian mendirikan shalat, menunaikan zakat, dan mentaati Allah dan Rasul-Nya. وَاللهُ خَبِيرٌۢ بِمَا تَعْمَلُونَ (dan Allah Maha Mengetahui apa yang kamu kerjakan) Dan Allah akan membalas kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13. Apa kalian takut menjadi miskin sebab sedekah kepada orang fakir sebelum melakukan pembicaraan dengan rasul SAW? Jika kalian tidak bersedekah dahulu karena kalian sedang kesulitan, maka Allah akan mengampuni kaliandengan memberikan keringanan dan menghilangkan kesulitan kalian. Maka cukuplah kalian melaksanakan shalat di awal waktu, menunaikan zakat fitrah. Istiqamahlah dalam itu semua, taatlah kepada semua perintah Allah dan rasul-Nya. Allah Maha Mengetahui segala perbuatan kalian baik dhohir maupun batin, dan semua itu akan Allah beri balasan. Ibnu Abbas berkata: Sesungguhnya orang muslim mempunyai banyak pertanyaan kepada rasul SAW sampai rasul kerepotan. Sehingga Allah berkehendak meringankan beban nabi-Nya. Maka turunlah ayat Apabila kalian hendak melakukan pembicaraan khusus dengan nabi.... Ketika turun ayat ini, kebanyakan manusia menjadi menyabarkan diri untuk tidak bertanya kepada nabi. Sehingga setelah itu Allah menurunkan ayat Apakah kamu takut akan menjadi miskin?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Pakah kalian takut miskin} Apakah kalian takut fakir {jika mengeluarkan sedekah sebelum pembicaraan rahasia dengan Rasul. Jika kalian tidak melakukannya dan Allah menerima taubat kalian, maka tegakkanlah shalat, tunaikanlah zakat, serta taatlah kepada Allah dan RasulNya. Allah Maha Mengetahui terhadap apa yang kalian kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "13. Selanjutnya, ketika Allah melihat adanya rasa berat hati kaum Mukminin dan kesulitan bagi mereka untuk memberi sedekah pada setiap kali mengadakan pembicaraan rahasia dengan Rasulullah, maka Allah mempermudah hal itu bagi mereka dengan tidak memberi hukuman bagi yang tidak memberi sedekah ketika mengadakan pembicaraan rahasia di hadapan Rasulullah, namun menghormati dan mengagungkan Rasulullah tetap seperti sediakala, tidak dihapus hukumnya, karena hukum ini adalah sebagai pemberlakukan kepada pemimpin lain setelah beliau, bukan hanya untuk Rasulullah saja. Yang dimaksudkan adalah bersopan santun di hadapan Rasulullah serta menghormati beliau. Allah memerintahkan mereka untuk menunaikan beberapa perintah besar yang dimaksudkan seraya berfirman, “Jika kamu tiada memperbuatnya,”maksudnya tidak ringan bagi kalian untuk memberikan sedekah, hal ini tidak cukup, karena perintah memberikan sedekah sebelum mengadakan pembicaraan rahasia dengan Rasulullah tidak disyaratkan harus ringan bebannya bagi setiap hamba, karena itulah Allah membatasi perintah tersebut dengan FirmanNya, “Dan Allah telah memberi taubat kepadamu,” maksudnya memaafkan kalian dari perintah tersebut, “maka dirikanlah shalat,” dengan rukun, syarat, serta seluruh batasan dan kewajibannya, “dan tunaikanlah zakat,” yang diwajibkan dalam harta kalian untuk diberikan pada yang berhak. Kedua ibadah tersebut merupakan pokok ibadah jasmaniah dan ibadah harta. Siapa pun yang menunaikan keduanya secara sah menurut syariat, maka telah menunaikan hak-hak Allah dan hak-hak sesama manusia, karena itulah Allah berfirman setelahnya, “Dan taatlah kepada Allah dan RasulNya,” ini adalah perintah paling menyeluruh yang mencakup perintah untuk menaati Allah dan RasulNya dengan menunaikan semua perintah keduanya dan menjauhi larangan keduanya serta membenarkan berita yang disampaikan Rasulullah dan berhenti pada batasan-batasan syariat. Patokan dalam menunaikan perintah-perintah syariat adalah keikhlasan dan keihsanan. Karena itulah Allah berfirman, “Dan Allah Maha Mengetahui apa yang kamu kerjakan.” Allah mengetahui seluruh perbuatan kalian. Perbuatan yang bagaimana pun juga pasti akan dibalas sesuai dengan apa yang terjadi, dan Allah akan membalasnya sesuai dengan apa yang ada di dalam hati manusia."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mujadalah ayat 13: Apakah kalian tahut menjadi kurang dan miskin wahai para sahabat yang mulia, jika kalian memberikan hasil bumi untuk sedekah; Maka ketika mereka tidak mampu melaksanakan perintah Allah, mereka bertaubat; Mereka diberikan rukhsah (keringan) untuk bertanya kepada Rasul dengan tanpaa bersedekah. Maka ketahuilah sedekah yang kalian tidak mampu, gantilah dengan menjaga dari istiqamah mengerjakan shalat, mengeluarkan zakat harta kalian dan taat kepada Allah dan Rasul-Nya, dan perintah maupun larangan dari Allah, tidak tersembunyi bagi-Nya (bagi siapa yang mengerjakannya) sesuatu apapun, dan akan Allah balas amalan-amalan kalian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni tidak mudah bagimu mengeluarkan sedekah. Namun tidak cukup sampai di sini, karena tidak menjadi syarat bagi ‘perintah’ harus ringan bagi seorang hamba. Oleh karena itu, Allah Subhaanahu wa Ta'aala membatasinya dengan firman-Nya, “dan Allah telah memberi ampun kepadamu,” yakni memaafkan hal itu untuk kamu. Dengan rukun dan syaratnya serta memperhatikan semua batasannya. Kepada para mustahiknya. Shalat dan zakat merupakan induk ibadah badan dan harta, barang siapa yang mengerjakan keduanya sesuai cara yang disyariatkan, maka ia telah memenuhi hak Allah dan hak hamba-hamba-Nya. Yakni tetaplah berada di atas taat kepada Allah dan Rasul-Nya. Termasuk ke dalam taat kepada Allah dan Rasul-Nya adalah melaksanakan perintah keduanya, menjauhi larangan, membenarkan berita dan berada dalam batasan Allah Subhaanahu wa Ta'aala. Dia mengetahui amal yang kamu kerjakan lalu Dia akan membalas kamu sesuai ilmu-Nya terhadap apa yang ada di hatimu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mujadalah Ayat 13",
    "description": "Melalui ayat ini Allah memberi dispensasi kebolehan menghadap rasulullah tanpa bersedekah terlebih dahulu. Allah berfirman, 'apakah kamu takut menjadi miskin karena kamu memberikan sedekah sebelum melakukan pembicaraan khusus dengan rasul' jika kamu tidak mampu melakukannya, yakni bersedekah kepada fakir miskin sebelum berjumpa dengan nabi dan Allah telah memberi ampun kepadamu karena kamu beristigfar dan benar-benar tidak mampu bersedekah, kamu diberikan dispensasi untuk berjumpa dengan beliau tanpa bersedekah terlebih dahulu kepada fakir miskin, maka sebagai kompensasinya, laksanakanlah salat, dan tunaikanlah zakat serta taatlah kepada Allah dan rasul-Nya! karena salat menyempurnakan ketaatan kepada Allah dan menjauhkan kamu dari perbuatan keji dan mungkar, sedangkan zakat menyucikan jiwa dan harta kamu. Dan Allah mahateliti terhadap niat, cara dan tujuan dari apa yang kamu kerjakan, baik persoalan dunia maupun akhirat. ' 14. Pada ayat sebelumnya diterangkan kebiasaan orang-orang beriman yang akan menghadap rasulullah, yaitu bersedekah kepada kaum duafa sebelum menghadap nabi. Pada ayat ini diterangkan kebiasaan orang-orang munafik yang menyembunyikan kekafiran dalam memperlakukan nabi dan larangan berteman akrab dengan orang-orang yang memusuhi islam. Apakah engkau Muhammad, tidak memperhatikan orang-orang munafik di madinah yang secara lisan menyatakan beriman kepada engkau, tetapi faktanya mereka adalah orang-orang yang menjadikan suatu kaum yang telah dimurkai Allah, yaitu kaum yahudi di madinah, sebagai sahabat' orang-orang munafik itu bukan dari kaum kamu, yakni orang-orang beriman yang benar sebagaimana pengakuan mereka. Orang-orang munafik mengaku beriman untuk mengambil hati orang-orang beriman saja; dan bukan dari kaum mereka, golongan yahudi yang benar. Mereka mengaku yahudi untuk memperoleh perlindungan dari yahudi. Dan mereka, orang-orang munafik itu tidak segan-segan bersumpah dengan menyebut nama Allah bahwa mereka beriman kepada Allah dan rasul-Nya, padahal sumpah mereka itu atas kebohongan, yakni bersumpah beriman, padahal tidak beriman; sedangkan mereka, orang-orang munafik itu, mengetahui kebohongan-Nya."
  }
]