[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah kamu tidak memperhatikan orang-orang munafik yang mengangkat orang-orang Yahudi sebagai teman dan memberikan loyalitasnya kepada mereka? Pada hakikatnya orang-orang munafik tidak termasuk orang-orang beriman dan tidak pula termasuk orang-orang Yahudi. Mereka bersumpah secara dusta bahwa mereka adalah kaum Muslimin dan bahwa kamu adalah Rasulullah, padahal mereka tahu bahwa mereka dusta dalam sumpah mereka tersebut."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Tidaklah kamu melihat -wahai Rasul- kepada orang-orang munafik yang berteman dengan orang-orang Yahudi yang telah dimurkai Allah dikarenakan kekufuran dan kemaksiatan mereka. Orang-orang munafik itu bukan bagian dari orang-orang yang beriman, dan mereka juga bukan bagian dari orang-orang Yahudi, akan tetapi mereka itu dalam keraguan, tidak bersama golongan Mukmin dan tidak pula bersama golongan Yahudi. Dan orang-orang munafik itu bersumpah bahwa mereka adalah orang-orang Muslim, dan bahwa mereka tidak membocorkan berita tentang kaum muslimin kepada orang-orang Yahudi, padahal sungguh mereka berdusta dengan sumpah mereka itu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "14-15. Hai Rasulullah, tidakkah kamu melihat dan terheran dari orang-orang munafik yang menjadikan orang-orang Yahudi sebagai penolong? Orang-orang munafik itu bukanlah termasuk kaum muslimin, dan bukan pula termasuk orang-orang Yahudi; namun mereka bersumpah dengan nama Allah bahwa mereka termasuk kaum muslimin dan mengakui risalah Nabi Muhammad; padahal mereka sadar bahwa mereka sedang berdusta. Allah telah menyiapkan azab yang sangat pedih bagi mereka, sungguh buruk apa yang mereka lakukan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "14. أَلَمْ تَرَ إِلَى الَّذِينَ تَوَلَّوْا۟ قَوْمًا (Tidakkah kamu perhatikan orang-orang yang menjadikan suatu kaum sebagai teman?) Yakni menjadikan mereka sekutu. Yang dimaksud adalah orang-orang munafik yang bersekutu dengan orang-orang Yahudi. غَضِبَ اللهُ عَلَيْهِم(dari kaum yang dimurkai Allah) Yakni orang-orang Yahudi. مَّا هُم مِّنكُمْ وَلَا مِنْهُمْ(orang-orang itu bukan dari golongan kamu dan bukan (pula) dari golongan mereka) Sebagaimana yang Allah firmankan tentang mereka: مذبذبين بين ذلك لا إلى هؤلاء ولا إلى هؤلاء Mereka dalam keadaan ragu-ragu antara yang demikian (iman atau kafir): tidak masuk kepada golongan ini (orang-orang beriman) dan tidak (pula) kepada golongan itu (orang-orang kafir). (An-Nisa':143) Ada kemungkinan bahwa yang dimaksud adalah orang-orang Yahudi, yakni Allah berfirman kepada orang-orang beriman: “orang-orang Yahudi bukan termasuk golongan kalian dan bukan pula golongan orang-orang munafik. Lalu mengapa mereka tidak dijadikan sekutu oleh orang-orang munafik.” وَيَحْلِفُونَ عَلَى الْكَذِبِ(Dan mereka bersumpah untuk menguatkan kebohongan) Yakni mereka bersumpah bahwa mereka adalah orang-orang beriman, atau mereka bersumpah bahwa mereka tidak membocorkan berita kepada orang-orang Yahudi. وَهُمْ يَعْلَمُونَ(sedang mereka mengetahui) Yakni mereka mengetahui kebatilan apa yang mereka sumpahkan, dan mengetahui bahwa hal itu hanyalah kebohongan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14. Wahai Nabi, apakah engkau tidak memperhatikan dan heran terhadap orang-orang munafik itu, Mereka (kaum Yahudi) telah menjadikan kaum yang dibenci Allah, sebagai sahabat mereka. Bukan dari golonganmu, juga bukan dari golongan mereka, namun mereka adalah golongan yang tidak jelas antara golonganmu atau golongan Yahudi. Mereka saling beraliansi dalam kedustaan, yaitu berencana mengagresi Islam dan orang mukmin. Sebenarnya mereka-pun tahu bahwa mereka adalah pendusta dalam kaitannya dengan aliansi yang mereka lakukan. Muqatil dan Siddi berkata: Kami mendapat informasi bahwa ayat ini turun untuk Abdullah bin Nabtal, orang munafik. Sebelumnya dia berbincang dengan Nabi, namun kemudian menyampaikan pembicaraan itu kepada kaum Yahudi. Kemudian rasul memperingatkannya, rasul akan memohon pertolongan Allah atas perbuatannya. Maka turunlah ayat ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah kamu tidak memperhatikan orang-orang yang menjadikan sahabat suatu kaum yang dimurkai Allah} orang-orang munafik yang menjadikan teman orang-orang Yahudi dan menyampaikan kepada mereka tentang rahasia-rahasia orang-orang mukmin {Orang-orang itu bukan dari kalian dan bukan dari mereka. Mereka bersumpah palsu, padahal mereka mengetahuinya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "14-15. Allah mengabarkan tentang kejinya kondisi orang-orang munafik. Mereka adalah orang-orang yang menjadikan orang-orang kafir dari kalangan Yahudi dan Nasrani serta lainnya yang dimurkai Allah sebagai pemimpin, padahal mereka itu mendapatkan laknat Allah secara sempurna; mereka bukan orang yang beriman dan bukan pula orang kafir, “Mereka dalam keadaan ragu-ragu antara yang demikian (iman atau kafir): tidak masuk kepada golongan ini (orang-orang beriman) dan tidak (pula) kepada golongan itu (orang-orang kafir),” -An-Nisa: 143- Mereka bukan orang Mukmin lahir batin, karena secara lahir mereka bersama orang-orang Mukmin, itulah sifat mereka yang disebutkan Allah, padahal sebenarnya mereka bersumpah atas kebalikannya, yaitu mendustakan. Mereka bersumpah sebagai orang Mukmin padahal sebenarnya mereka bukan orang Mukmin. Karena itu, balasan orang-orang penghianat, keji dan pendusta itu adalah siksa keras yang telah disediakan Allah untuk mereka yang ukuran dan sifatnya tidak diketahui (oleh manusia). “Sesungguhnya amat buruklah apa yang telah mereka kerjakan,” karena mereka melakukan perbuatan yang mengundang murka Allah dan mewajibkan mereka mendapatkan siksa dan laknat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mujadalah ayat 14: Bukankah engkau melihat wahai Nabi Allah kepada mereka orang-orang munafiq menjadikan orang-orang kafir yahudi dan nashrani dan selainnya sebagai temannya, yang mereka ini Allah murkai karena sebab kekufuran dan kemaksiatan mereka. Maka ketahuilah bahwa orang-orang munafiq ini bukanlah termasuk bagian dari orang-orang muslim, tidak juga mereka dari yahudi. Allah bersumpah dengan kebohongan mereka bahwasanya mereka telah mengaku sebagai orang islam, dan sunggah engkau adalah Rasul utusan Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan tentang buruknya keadaan kaum munafik yang berwala’ (memberikan sikap cinta dan setia) kepada orang-orang kafir dan menjadikan mereka sebagai sahabat, baik mereka itu orang-orang Yahudi, Nasrani dan yang lainnya yang Allah Subhaanahu wa Ta'aala murkai. Mereka memperoleh laknat Allah dan bersikap ragu-ragu antara beriman atau kafir. Mereka bukan orang-orang mukmin baik zhahir (luar) maupun batin (dalam) karena batin mereka bersama orang-orang kafir, dan bukan pula orang-orang kafir baik zhahir maupun batin karena zhahir mereka bersama kaum mukmin. Inilah sifat mereka yang telah disebutkan Allah Subhaanahu wa Ta'aala, mereka bersumpah dengan sumpah yang berlawanan dengan keadaan mereka, yaitu bahwa mereka adalah orang-orang mukmin, padahal mereka mengetahui bahwa mereka bukan orang-orang mukmin. Maka balasan terhadap mereka yang berkhianat itu yang fasik lagi berdusta adalah Allah siapkan untuk mereka azab yang pedih. Mereka mengerjakan perbuatan yang mendatangkan kemurkaan Allah Subhaanahu wa Ta'aala, mendatangkan hukuman dan laknat-Nya. Yaitu orang-orang Yahudi. Yaitu orang-orang mukmin. Yaitu orang-orang Yahudi. Imam Ahmad di juz 1 hal. 240 meriwayatkan dengan sanadnya yang sampai kepada Ibnu Abbas radhiyallahu 'anhuma ia berkata: Rasulullah shallallahu 'alaihi wa sallam bersabda, “Akan masuk menemui kamu seorang yang melihat dengan satu mata setan atau kedua mata setan.” Lalu ada seorang yang biru matanya dan berkata, “Wahai Muhammad! Atas dasar apa engkau engkau memakiku atau mencelaku.” atau semisalnya. Ibnu Abbas berkata, “Ia pun bersumpah, dan turunlah ayat ini yang ada di surah Al Mujaadilah, “Dan mereka bersumpah atas kebohongan,” dan ayat yang lain. (Haitsami berkata dalam Majma’uz Zawaa’id, “Diriwayatkan oleh Ahmad, Al Bazzar dan para perawi semuanya adalah para perawi hadits shahih, namun di sana disebutkan bahwa Rasulullah shallallahu 'alaihi wa sallam yang berkata kepada orang itu, “Atas dasar apa engkau dan kawanmu memakiku.” Syaikh Muqbil menjelaskan, bahwa inilah yang disebutkan dalam Musnad di halaman 267 dan 350. Hadits tersebut diriwayatkan pula oleh Hakim dalam Mustadrak juz 2 hal. 482, ia berkata, “Hadits ini shahih sesuai syarat Muslim, namun keduanya (Bukhari dan Muslim) tidak menyebutkannya.”). Ibnu Jarir di juz 10 hal. 185 dan Asy Syaukaani di juz 2 hal. 384 menyandarkannya kepada Thabrani, Abusy Syaikh dan Ibnu Mardawaih dari hadits Ibnu Abbas yang sama dengan hadits di atas, namun di sana disebutkan, dan turunlah ayat, “Wa yahlifuuna billahi maa qaaluu…dst” (At Taubah: 74) Syaikh Muqbil menjelaskan, bisa saja kedua ayat itu turun bersamaan karena satu sebab atau bisa juga karena mudhtrarib (goncangnya) Sammak bin Harb, karena ia seorang yang goncang haditsnya terlebih setelah tuanya, wallahu a’lam. Sedangkan ayat yang turun di surah Al Mujaadilah lebih kuat karena yang meriwayatkan darinya adalah Syu’bah, dan ia sudah mendengar sejak lama sebagaimana disebutkan dalam Tahdzibut Tahdzib. Bahwa mereka beriman. Bahwa mereka berdusta dalam ucapan itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mujadalah Ayat 14",
    "description": "Pada ayat sebelumnya diterangkan kebiasaan orang-orang beriman yang akan menghadap rasulullah, yaitu bersedekah kepada kaum duafa sebelum menghadap nabi. Pada ayat ini diterangkan kebiasaan orang-orang munafik yang menyembunyikan kekafiran dalam memperlakukan nabi dan larangan berteman akrab dengan orang-orang yang memusuhi islam. Apakah engkau Muhammad, tidak memperhatikan orang-orang munafik di madinah yang secara lisan menyatakan beriman kepada engkau, tetapi faktanya mereka adalah orang-orang yang menjadikan suatu kaum yang telah dimurkai Allah, yaitu kaum yahudi di madinah, sebagai sahabat' orang-orang munafik itu bukan dari kaum kamu, yakni orang-orang beriman yang benar sebagaimana pengakuan mereka. Orang-orang munafik mengaku beriman untuk mengambil hati orang-orang beriman saja; dan bukan dari kaum mereka, golongan yahudi yang benar. Mereka mengaku yahudi untuk memperoleh perlindungan dari yahudi. Dan mereka, orang-orang munafik itu tidak segan-segan bersumpah dengan menyebut nama Allah bahwa mereka beriman kepada Allah dan rasul-Nya, padahal sumpah mereka itu atas kebohongan, yakni bersumpah beriman, padahal tidak beriman; sedangkan mereka, orang-orang munafik itu, mengetahui kebohongan-Nya. 15. Allah telah menyediakan azab yang sangat keras bagi mereka, orang-orang munafik, yaitu berada di dalam kerak neraka. Sungguh, betapa buruknya apa yang telah mereka kerjakan di dunia, yaitu menipu Allah, rasulullah, dan orang-orang beriman, padahal hakikatnya mereka menipu diri mereka sendiri."
  }
]