[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah menyiapkan bagi orang-orang munafik itu azab yang sangat keras dan menyakitkan. Sesungguhnya kemunafikan dan sumpah dusta yang mereka lakukan adalah seburuk-buruk perbuatan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Allah menyiapkan siksa yang pedih bagi mereka di Akhirat dengan memasukkan mereka ke lapisan Neraka paling bawah. Sungguh amat buruk perbuatan kufur yang mereka kerjakan di dunia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15. أَعَدَّ اللهُ لَهُمْ عَذَابًا شَدِيدًا ۖ( Allah telah menyediakan bagi mereka azab yang sangat keras) Yakni akibat persekutuan mereka dan sumpah dusta yang mereka ucapkan. إِنَّهُمْ سَآءَ مَا كَانُوا۟ يَعْمَلُونَ(sesungguhnya amat buruklah apa yang telah mereka kerjakan) Yakni amal-amal buruk yang telah mereka kerjakan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "15. Allah telah menyediakan azab yang sangat pedih di akhirat kepada mereka atas perbuatan mereka yang sudah dijelaskan pada ayat sebelumnya. Mereka hina atas perbuatan durhaka mereka, yaitu menjadikan musuh sebagai sahabat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah telah menyediakan azab yang sangat keras bagi mereka. Sesungguhnya sangat buruk apa yang selalu mereka kerjakan itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "14-15. Allah mengabarkan tentang kejinya kondisi orang-orang munafik. Mereka adalah orang-orang yang menjadikan orang-orang kafir dari kalangan Yahudi dan Nasrani serta lainnya yang dimurkai Allah sebagai pemimpin, padahal mereka itu mendapatkan laknat Allah secara sempurna; mereka bukan orang yang beriman dan bukan pula orang kafir, “Mereka dalam keadaan ragu-ragu antara yang demikian (iman atau kafir): tidak masuk kepada golongan ini (orang-orang beriman) dan tidak (pula) kepada golongan itu (orang-orang kafir),” -An-Nisa: 143- Mereka bukan orang Mukmin lahir batin, karena secara lahir mereka bersama orang-orang Mukmin, itulah sifat mereka yang disebutkan Allah, padahal sebenarnya mereka bersumpah atas kebalikannya, yaitu mendustakan. Mereka bersumpah sebagai orang Mukmin padahal sebenarnya mereka bukan orang Mukmin. Karena itu, balasan orang-orang penghianat, keji dan pendusta itu adalah siksa keras yang telah disediakan Allah untuk mereka yang ukuran dan sifatnya tidak diketahui (oleh manusia). “Sesungguhnya amat buruklah apa yang telah mereka kerjakan,” karena mereka melakukan perbuatan yang mengundang murka Allah dan mewajibkan mereka mendapatkan siksa dan laknat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mujadalah ayat 15: Allah menjelaskan bahwa balasan mereka para pendosa dan pemohong akhir balasannya adalah adzab yang keras dan menyakitkan. Tempat mereka di jahannam yang paling rendah. Mereka adalah orang-orang yang buruk dalam beramal, dimana mereka beramal dengan amalan yang Allah murkai, maka wajib bagi mereka mendapatkan adzab dan laknat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mujadalah Ayat 15",
    "description": "Allah telah menyediakan azab yang sangat keras bagi mereka, orang-orang munafik, yaitu berada di dalam kerak neraka. Sungguh, betapa buruknya apa yang telah mereka kerjakan di dunia, yaitu menipu Allah, rasulullah, dan orang-orang beriman, padahal hakikatnya mereka menipu diri mereka sendiri. 16. Allah menjelaskan salah satu karakter busuk orang-orang munafik, yaitu: mereka menjadikan sumpah-sumpah mereka, yakni bersumpah dengan nama Allah bahwa mereka beriman kepada Allah dan rasul-Nya dan bersedia berjihad mengharumkan islam, padahal sumpah itu hanyalah sebagai perisai untuk menutupi kekafiran mereka, bahkan untuk menutupi kebencian mereka terhadap islam dan kaum muslim; lalu mereka menghalang-halangi manusia dari jalan Allah, bekerja sama dengan kaum yahudi agar kabilah-kabilah arab itu tidak masuk islam; maka bagi mereka azab yang menghinakan mereka di dalam kerak neraka."
  }
]