[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang munafik itu menjadikan sumpah dusta mereka sebagai tameng yang melindungi mereka dari pembunuhan disebabkan kekafiran mereka, agar kaum Muslimin tidak memerangi mereka dan melawan anak-anak mereka, dengan itu mereka telah menghalang-halangi diri mereka dan orang lain dari jalan Allah, yaitu Islam. Bagi mereka azab yang menghinakan mereka di dalam neraka, karena kesombongan mereka dengan tidak mau beriman kepada Allah dan Rasulullah dan menghalang-halangi (manusia) dari jalan Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Mereka menjadikan sumpah-sumpah yang pernah mereka ikrarkan sebagai perisai dari pembunuhan akibat kekufuran mereka. Dengan sumpah itu, mereka menampakkan keislaman untuk menjaga darah dan harta mereka. Maka mereka mengalihkan manusia dari kebenaran dikarenakan mereka telah berusaha melemahkan dan meruntuhkan tekad kaum muslimin. Maka bagi mereka siksa pedih yang menghinakan dan merendahkan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "16-19. Orang-orang munafik itu menjadikan sumpah dusta mereka sebagai pelindung agar tidak dibunuh, dan mereka menghalangi diri sendiri dan orang lain dari agama Islam. Maka mereka akan mendapatkan azab yang menghinakan di dalam neraka Jahannam; harta dan keturunan mereka tidak akan dapat melindungi mereka sedikitpun dari azab Allah. Orang-orang yang jauh dari rahmat Allah itu merupakan penghuni dan bahan bakar api neraka selamanya. Pada hari kiamat, Allah akan mengeluarkan mereka semua dari kubur, kemudian mereka akan bersumpah dengan nama Allah sebagaimana mereka bersumpah kepada kalian -hai orang-orang beriman- ketika di dunia; dan mereka mengira sumpah itu dapat menyelamatkan mereka. Ketahuilah -hai para hamba- mereka benar-benar pendusta yang telah dikuasai oleh setan; ia menyibukkan mereka dengan berbagai syahwat sehingga mereka melupakan zikir kepada Allah. Orang-orang yang jauh dari kebenaran itu adalah para pengikut setan. Dan ketahuilah -hai para hamba-, para pengikut setan adalah orang-orang yang merugi di dunia dan di akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "16. اتَّخَذُوٓا۟ أَيْمٰنَهُمْ جُنَّةً (Mereka menjadikan sumpah-sumpah mereka sebagai perisai) Yakni sumpah dusta yang mereka ucapkan bahwa mereka termasuk orang-orang beriman, agar mereka dapat terhindar dari hukuman mati karena kekafiran mereka, sehingga mereka menjadikan sumpah ini sebagai pelindung nyawa mereka. Lisan mereka mengucapkan keimanan karena takut mati, padahal hati mereka belum beriman. فَصَدُّوا۟ عَن سَبِيلِ اللهِ(lalu mereka halangi (manusia) dari jalan Allah) Yakni menghalangi orang lain dari agama Islam dengan menganggap remeh dan lemah keadaan orang-orang beriman. فَلَهُمْ عَذَابٌ مُّهِينٌ (karena itu mereka mendapat azab yang menghinakan) Yakni azab yang menghinakan dan merendahkan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16. Orang munafik itu menjadikan sumpah-sumpah mereka sebagai alibi untuk menutupi kemunafikan mereka, mereka mengaku bahwa mereka adalah muslim. Mereka mencegah orang-orang untuk beriman kepada Islam dengan provokasi. Maka bagi mereka siksa yang menghinakan. Ini adalah janji yang kedua dan ancaman terhadap azab"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka menjadikan sumpah-sumpah mereka sebagai perisai} pelindung bagi mereka dari luka {lalu menghalang-halangi dari jalan Allah. Maka bagi mereka azab yang menghinakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "16. “Mereka menjadikan sumpah-sumpah mereka sebagai perisai,” yakni pelindung dan penghalang yang mereka jadikan penghalang dari cercaan Allah, Rasulullah dan kaum Mukminin. Dan karena hal itu, mereka justru mencegah diri mereka sendiri dan orang lain dari jalan Allah, yaitu jalan yang ditempuh oleh orang yang menggiring mereka menuju surga yang penuh kenikamatan, “karena itu mereka mendapat azab yang menghinakan,” karena mereka bersikap sombong untuk beriman kepada Allah dan tunduk pada tanda-tanda kebesaranNya, maka Allah menghinakan mereka dengan azab abadi yang tidak diredakan barang sebentar sekalipun dan tidaklah mereka diberi tangguh."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mujadalah ayat 16: Terhadap diri dan harta mereka. Mereka gunakan sumpah itu agar mereka tidak mendapatkan celaan dari Allah, Rasul-Nya dan kaum mukmin. Yaitu jalan yang menghubungkan ke surga, seperti jihad dan lainnya. Mereka halangi diri mereka dan orang lain dari jalan Allah tersebut. Karena mereka sombong dari beriman kepada Allah dan tunduk kepada ayat-ayat-Nya sehingga Allah Subhaanahu wa Ta'aala menghinakan mereka dengan azab yang kekal yang tidak dikurangi meskipun sebentar dan tidak pula diberi tangguh."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mujadalah Ayat 16",
    "description": "Allah menjelaskan salah satu karakter busuk orang-orang munafik, yaitu: mereka menjadikan sumpah-sumpah mereka, yakni bersumpah dengan nama Allah bahwa mereka beriman kepada Allah dan rasul-Nya dan bersedia berjihad mengharumkan islam, padahal sumpah itu hanyalah sebagai perisai untuk menutupi kekafiran mereka, bahkan untuk menutupi kebencian mereka terhadap islam dan kaum muslim; lalu mereka menghalang-halangi manusia dari jalan Allah, bekerja sama dengan kaum yahudi agar kabilah-kabilah arab itu tidak masuk islam; maka bagi mereka azab yang menghinakan mereka di dalam kerak neraka. 17. Allah menjelaskan bahwa harta dan anak-anak tidak dapat menyelamatkan mereka dari azab yang menghinakan itu. Harta benda yang diperoleh dengan menghalalkan segala cara dan anak-anak mereka yang mendorong mereka mencari harta dengan cara seperti itu, ketika menghadap Allah tidak berguna sedikit pun untuk menolong mereka dari azab Allah, karena yang akan menyelamatkan itu iman dan amal saleh, sedangkan harta dan anak hanya penopang. Mereka itulah penghuni neraka, karena keputusan mereka waktu hidup memilih tidak beriman, mereka kekal di dalamnya tanpa ada harapan keluar dari neraka."
  }
]