[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Harta dan anak-anak orang-orang munafik itu tidak akan bisa melindungi mereka dari azab Allah sedikit pun. Mereka itu adalah para penghuni neraka yang akan memasukinya dan akan kekal di dalamnya, tidak akan keluar darinya. Balasan ini mencakup semua orang yang menghalang-halangi agama Allah dengan ucapan maupun perbuatannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Harta-harta dan anak-anak mereka tidak berguna bagi mereka. Mereka adalah penghuni Neraka yang akan mereka masuki, menetap di dalamnya selamanya, siksa tak ada hentinya atas mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17. Harta dan anak merekapun tidak berguna sama sekali untuk membebaskan mereka dari siksa. Mereka itu orang-orang yang dideskripsikan sebagai penghuni neraka. Mereka kekal di neraka, tidak akan mati dan tidak akan bisa keluar dari neraka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Idak berguna} tidak bisa menolak {harta benda dan tidak pula anak-anak mereka dari (azab) Allah sedikit pun. Mereka itulah penghuni neraka. Mereka kekal di dalamnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17. “Harta benda dan anaka-anak mereka tiada berguna sedikitpun (untuk menolong) mereka dari azab Allah.” Maksudnya, tidak bisa menagkal sedikit pun siksaan terhadap mereka dan tidak bisa memberikan mereka pahala sedikit pun. “Mereka itulah penghuni neraka,” yang kekal di dalamnya dan tidak akan keluar. “Mereka kekal di dalamnya.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mujadalah ayat 17: Allah menjelaskan bahwa harta dan anak-anak orang-orang munafik yang mereka banggakan tidak dapat menghalangi dari adzab Allah sedikitpun; Bahkan mereka orang-orang munafik mereka adalah penghuni neraka; Mereka kekal di dalamnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mereka tidak akan dikeluarkan darinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mujadalah Ayat 17",
    "description": "Allah menjelaskan bahwa harta dan anak-anak tidak dapat menyelamatkan mereka dari azab yang menghinakan itu. Harta benda yang diperoleh dengan menghalalkan segala cara dan anak-anak mereka yang mendorong mereka mencari harta dengan cara seperti itu, ketika menghadap Allah tidak berguna sedikit pun untuk menolong mereka dari azab Allah, karena yang akan menyelamatkan itu iman dan amal saleh, sedangkan harta dan anak hanya penopang. Mereka itulah penghuni neraka, karena keputusan mereka waktu hidup memilih tidak beriman, mereka kekal di dalamnya tanpa ada harapan keluar dari neraka. 18. Pada hari kiamat nanti, ketika mereka semua, orang-orang munafik, dibangkitkan Allah dari alam kubur menuju mahsyar, lalu mereka bersumpah kepada-Nya bahwa mereka orang-orang yang benar-benar beriman kepada Allah dan rasul-Nya, bukan orang-orang kafir, sebagaimana mereka bersumpah kepadamu di dunia bahwa mereka orang-orang yang benar-benar beriman kepada Allah dan rasul-Nya, padahal sumpah mereka itu atas kebohongan, yakni bersumpah beriman, padahal sejatinya tidak beriman; dan mereka menyangka bahwa mereka dengan bersumpah palsu itu akan memperoleh sesuatu manfaat, dikeluarkan dari neraka. Ketahuilah, bahwa mereka orang-orang pendusta baik di dunia di hadapan rasulullah maupun di akhirat di hadapan Allah."
  }
]