[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Pada Hari Kiamat Allah akan membangkitkan orang-orang munafik seluruhnya dari kubur mereka dalam keadaan hidup. Mereka akan bersumpah kepada Allah bahwa mereka adalah orang-orang yang beriman, sebagaimana mereka telah bersumpah kepada kalian (wahai orang-orang beriman) di dunia, mereka meyakini bahwa hal itu bermanfaat bagi mereka di sisi Allah sebagaimana hal itu bermanfaat bagi mereka di dunia. Ketahuilah, bahwa mereka adalah orang-orang yang gemar berdusta, dusta mereka mencapai titik yang tidak dijangkau oleh selain mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Pada hari di mana Allah membangkitkan semua, tidak ada seorangpun yang ketinggalan melainkan dibangkitkan untuk mendapatkan balasan, mereka bersumpah kepada Allah bahwa mereka bukanlah orang-orang kafir dan munafik, akan tetapi mereka adalah orang-orang yang beriman, mengerjakan apa yang diridai Allah. Mereka bersumpah kepada Allah sebagaimana mereka dulu bersumpah kepada kalian -wahai orang-orang yang beriman- di dunia bahwa mereka adalah orang-orang Muslim. Mereka menyangka bahwa dengan sumpah yang mereka ikrarkan kepada Allah ini, mereka mendapatkan suatu manfaat atau selamat dari suatu bahaya. Ketahuilah bahwa mereka adalah orang-orang yang benar-benar pendusta dalam sumpah-sumpah mereka di dunia, maupun di Akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "18. يَوْمَ يَبْعَثُهُمُ اللهُ جَمِيعًا فَيَحْلِفُونَ لَهُۥ كَمَا يَحْلِفُونَ لَكُمْ ۖ ((Ingatlah) hari (ketika) mereka semua dibangkitkan Allah lalu mereka bersumpah kepada-Nya (bahwa mereka bukan musyrikin) sebagaimana mereka bersumpah kepadamu) Yakni pada hari kiamat mereka bersumpah kepada Allah dengan sumpah dusta, sebagaimana mereka dahulu di dunia bersumpah. Mereka berkata: “Demi Allah, Wahai Tuhan kami, kami tidak melakukan hal itu.” ini mereka lakukan karena keburukan mereka, padahal kebenaran telah tersingkap pada hari kiamat, dan segala urusan telah diketahui. وَيَحْسَبُونَ أَنَّهُمْ عَلَىٰ شَىْءٍ ۚ( dan mereka menyangka bahwa mereka akan memperoleh suatu (manfaat)) Yakni mereka mengira dengan keimanan palsu itu, mereka dapat mendapat manfaat darinya atau dapat menjauhkan mereka dari mudharat, sebagaimana mereka menyangka hal itu ketika di dunia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "18. Sampaikan kepada mereka bahwa kelak akan ada hari dimana mereka dibangkittkan kembali dari kubur mereka. Segala perbuatan mereka akan dihitung dan diberi balasan. Allah akan memberlakukan janji-Nya kepada mereka, sebab mereka telah bersumpah di dunia sebagai orang mukmin. Mereka menyangka bahwa sumpah-sumpah yang mereka sampaikan masih bisa membawa manfaat bagi mereka layaknya di dunia. Sesungguhnya tidak lain mereka hanyalah orang-orang pendusta terhadap sumpah dan ucapan mereka. Ibnu Abbas berkata: bahwa ayat ini diturunkan untuk perilaku Ibnu Nabtal yang memanggil para sahabatnya yang mendengar hinaan untuk rasul SAW. Kemudian mereka bersumpah kepadanya terhadap perkataan dan perbuatan mereka. Sehingga Allah menurunkan ayat ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Pada hari (ketika) Allah membangkitkan mereka semuanya. Lalu mereka bersumpah kepadaNya sebagaimana mereka bersumpah kepada kalian. Mereka menyangka} mengira {bahwa mereka akan memperoleh sesuatu. Ketahuilah sesungguhnya mereka adalah para pendusta"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "18. Siapa pun yang hidup di atas sesuatu, ia akan meninggal dunia di atas sesuatu itu. Karena ketika di dunia orang-orang munafik menipu kaum Mukminin dengan bersumpah bahwa mereka adalah orang-orang Mukmin, maka pada Hari Kiamat Allah membangkitkan mereka semua, dan orang-orang munafik pun bersumpah seperti yang mereka lakukan (di dunia) kepada orang-orang Mukmin. Mereka mengira dengan sumpah itu “mereka akan memperoleh suatu (manfaat).” Karena kekufuran, kemunafikan, dan keyakinan-keyakian batil mereka itu menancap di benak mereka sedikit demi sedikit sehingga mereka pun tertipu dan mengira bahwa mereka akan memperoleh suatu manfaat dan pahala. Mereka berdusta dalam hal itu dan sebagaimana diketahui bahwa dusta itu tidak berlaku bagi Allah Yang Mengetahui yang ghaib dan yang nyata."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mujadalah ayat 18: Sebutkan wahai Nabi Allah hari kebangkitan kepada mereka orang-orang munafik, yang mereka akan dibangkitkan dari kubur-kubur mereka untuk dibalas dan dihisab. Mereka bersumpah kepada Allah sebagaiman sumpah mereka di dunia, bahwa mereka adalah orang-orang beriman. Mereka menyakini bahwa keimanan yang mereka sembunyikan ketika di dunia, akan bermanfaat bagi mereka sebagaimana di dunia. Padahal dulu orang-orang beriman telah ada di hadapan mereka (dimana orang munafik tidak mau mengikutinya). Ini adalah adzab bagi mereka, ditambah lagi buruknya hati mereka. Mereka telah lupa bahwa hari kiamat akan menyingkap dan menjelaskan segala urusan. Sumpah mereka akan menambah kemarahan (Allah); Dimana Allah akan menampakkan amalan-amalan buruk dan hina mereka dihadapan mata mereka. Allah menjelaskan bahwa mereka orang-orang munafik telah menerobos batasan yang Allah tentukan, yaitu dari kebohongan mereka yang tidak seorang pun semisal mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Oleh karena orang-orang munafik ketika berada di dunia menipu kaum mukmin, mereka bersumpah bahwa mereka adalah kaum mukmin, maka pada hari Kiamat ketika Allah Subhaanahu wa Ta'aala membangkitkan mereka, mereka akan bersumpah kepada Allah sebagaimana mereka bersumpah kepada kaum mukmin dan mengira bahwa sumpah mereka itu bermanfaat karena kekafiran, kemunafikan dan keyakinan mereka yang batil senantiasa tertancap dalam hati mereka sedikit demi sedikit sehingga membuat mereka tertipu dan membuat mereka menyangka bahwa mereka di atas sesuatu yang dapat diperhitungkan, sedangkan mereka berdusta, dan dusta itu tidaklah laku di hadapan Tuhan yang mengetahui yang gaib dan yang tampak. Hal ini akibat mereka dikuasai oleh setan dan dihias olehnya amalan mereka serta dibuatnya melupakan mengingat Allah, padahal sesungguhnya setan itu adalah musuh yang nyata yang tidak menginginkan untuk mereka selain keburukan, dimana ia tidaklah menyeru pengikutnya selain kepada neraka. Di dunia. Dari sumpah mereka itu di akhirat sebagaimana sumpah itu bermanfaat ketika di dunia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mujadalah Ayat 18",
    "description": "Pada hari kiamat nanti, ketika mereka semua, orang-orang munafik, dibangkitkan Allah dari alam kubur menuju mahsyar, lalu mereka bersumpah kepada-Nya bahwa mereka orang-orang yang benar-benar beriman kepada Allah dan rasul-Nya, bukan orang-orang kafir, sebagaimana mereka bersumpah kepadamu di dunia bahwa mereka orang-orang yang benar-benar beriman kepada Allah dan rasul-Nya, padahal sumpah mereka itu atas kebohongan, yakni bersumpah beriman, padahal sejatinya tidak beriman; dan mereka menyangka bahwa mereka dengan bersumpah palsu itu akan memperoleh sesuatu manfaat, dikeluarkan dari neraka. Ketahuilah, bahwa mereka orang-orang pendusta baik di dunia di hadapan rasulullah maupun di akhirat di hadapan Allah. 19. Orang-orang munafik itu menjadi pendusta karena diri mereka sepenuhnya dikendalikan iblis. Setan telah menguasai diri, pikiran, perasaan, dan ruhani mereka, sehingga cahaya Allah terhalang masuk ke dalam pikiran, perasaan, dan ruhani mereka itu. Lalu setan dengan cerdik menghadang dari depan, belakang, kanan, dan kiri, serta menjadikan mereka lupa mengingat Allah; mereka itulah golongan setan, yaitu manusia yang akal dan nuraninya dikuasai setan. Ketahuilah dengan perenungan yang mendalam bahwa golongan setan itulah golongan yang rugi, karena akal sehat dan nuraninya yang jernih tidak digunakan untuk berpikir secara mendalam, masuk akal dan sistematis dalam menyikapi ajaran Allah sehingga akal dan hati mereka tertutup dari iman."
  }
]