[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Setan mengalahkan dan menguasai mereka hingga mereka meninggalkan perintah-perintah Allah dan tidak taat kepadaNya. Mereka adalah golongan setan dan para pengikutnya. Ketahuilah, bahwa golongan setan adalah orang-orang yang merugi di dunia dan akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Setan telah menguasai mereka dan menjadikan mereka lupa untuk mengingat Allah dengan gangguannya dan tidak mengerjakan amal yang diridai oleh Allah, justru melakukan perbuatan yang menjadikan Allah murka. Orang-orang yang mempunyai sifat-sifat tersebut adalah tentara-tentara iblis dan pengikut-pengikutnya. Ketahuilah bahwa tentara-tentara iblis dan pengikut-pengikutnya adalah orang-orang yang merugi di dunia dan di Akhirat, mereka telah menukar petunjuk dengan kesesatan, menukar Surga dengan Neraka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "19. اسْتَحْوَذَ عَلَيْهِمُ الشَّيْطٰنُ (Syaitan telah menguasai mereka) Yakni menguasai dan meliputi mereka. فَأَنسَىٰهُمْ ذِكْرَ اللهِ ۚ( mereka lalu menjadikan mereka lupa mengingat Allah) Yakni sehingga mereka tidak menjalankan perintah Allah dan ketaatan kepada-Nya. أُو۟لٰٓئِكَ حِزْبُ الشَّيْطٰنِ ۚ( mereka itulah golongan syaitan) Yakni pasukan dan pengikut setan. أَلَآ إِنَّ حِزْبَ الشَّيْطٰنِ هُمُ الْخٰسِرُونَ(Ketahuilah, bahwa sesungguhnya golongan syaitan itulah golongan yang merugi) Sebab mereka menjual surga dengan neraka, mengganti petunjuk dengan kesesatan, dan berdusta terhadap Allah dan rasul-Nya, serta bersumpah dengan sumpah-sumpah palsu, sehingga mereka akan merugi di dunia dan di akhirat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19. Para setan telah menguasai mereka dengan bisikan dan tipudayanya. Sehingga mereka lupa untuk senantiasa berdzikir dan melakukan ketaatan kepada Allah. Merekalah para pengikut dan sekutu setan. Mereka adalah orang yang sangat rugi besar, sebab meninggalkan ketaatan dan keimanan kepada Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Setan telah menguasai} menguasai {mereka, lalu menjadikan mereka lupa mengingat Allah. Mereka itulah golongan setan. Ketahuilah sesungguhnya golongan} bala tentara dan pengikut {setan itulah orang-orang yang merugi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "19. Inilah yang berlaku pada orang-orang munafik, mereka dikuasai oleh setan. Setan menghiasi perbuatan-perbuatan mereka dan membuat mereka lalai dari berdzikir (mengingat dan menyebut) Allah. Setan adalah musuh nyata yang hanya menginginkan keburukan bagi mereka, dan setan menyeru golongannya agar mereka menjadi penghuni neraka. “Mereka itulah golongan setan. Ketahuilah, bahwa sesungguhnya golongan setan itulah golongan yang merugi.” Mereka rugi dari segi agama, dunia, diri, dan keluarga."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mujadalah ayat 19: Allah menjelaskan bahwa mereka orang-orang munafik telah dikuasai oleh setan, mereka ditaklukkan dan dikalahkan oleh setan; Sehingga mereka lupa dari mengingat Allah, lupa akan tauhid dan beramal ketaatan serta menjauhi larangan-larangan-Nya. Ketahuilah bahwa mereka orang-orang munafik adalah prajurit setan dan kelompok setan. Ketahuilah bahwa mereka adalah orang-orang yang merugi yang lemah dungu ketika di dunia dan di akhirat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sehingga mereka selalu menaati setan. Yang merugikan agama mereka, dunia mereka, diri mereka dan keluarga mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mujadalah Ayat 19",
    "description": "Orang-orang munafik itu menjadi pendusta karena diri mereka sepenuhnya dikendalikan iblis. Setan telah menguasai diri, pikiran, perasaan, dan ruhani mereka, sehingga cahaya Allah terhalang masuk ke dalam pikiran, perasaan, dan ruhani mereka itu. Lalu setan dengan cerdik menghadang dari depan, belakang, kanan, dan kiri, serta menjadikan mereka lupa mengingat Allah; mereka itulah golongan setan, yaitu manusia yang akal dan nuraninya dikuasai setan. Ketahuilah dengan perenungan yang mendalam bahwa golongan setan itulah golongan yang rugi, karena akal sehat dan nuraninya yang jernih tidak digunakan untuk berpikir secara mendalam, masuk akal dan sistematis dalam menyikapi ajaran Allah sehingga akal dan hati mereka tertutup dari iman. 20. Pada ayat sebelumnya disebutkan bahwa orang-orang munafik itu membohongi Allah dan rasul-Nya karena dirinya dikuasai setan sehingga termasuk golongan setan. Sementara itu pada ayat ini disebutkan bahwa sesungguhnya orang-orang yang menentang Allah dan rasul-Nya dengan tidak beriman atau bersumpah beriman padahal hatinya penuh dengan kekafiran dan menghalangi orang untuk beriman, mereka termasuk orang-orang yang sangat hina, karena karakternya busuk, hipokrit, tidak sportif, bermuka dua dan berpura-pura."
  }
]