[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang yang menzhihar istri-istri mereka di antara kalian, di mana suami berkata kepada istrinya, “Kamu bagiku sudah seperti punggung ibuku”, yakni, dalam pengharaman pernikahan, maka mereka telah durhaka kepada Allah dan menyelisihi Syariat-Nya. Istri-istri mereka sejatinya bukanlah ibu-ibu mereka, akan tetapi istri-istri mereka. Ibu-ibu mereka adalah wanita-wanita yang melahirkan mereka. Sesungguhnya orang-orang yang melakukan zhihar benar-benar mengatakan sesuatu yang dusta dan buruk, dan tidak benar. Sesungguhnya Allah Maha Pemaaf lagi Pengampun kepada siapa yang melakukan penyimpangan lalu segera bertaubat nashuha."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Orang-orang yang menzihar istri-istri mereka dengan mengatakan salah seorang dari mereka kepada istrinya, “Engkau bagiku seperti punggung ibuku.” Mereka bohong dalam ucapannya ini, karena istri-istri mereka bukanlah ibu-ibu mereka. Tidaklah ibu-ibu mereka melainkan orang-orang yang melahirkan mereka. Dan sesungguhnya saat mereka mengucapkan hal itu, mereka mengucapkan ucapan yang mungkar dan dusta, dan sesungguhnya Allah Maha Pemaaf dan Maha Pengampun, Dia mensyariatkan kaffarat bagi mereka sebagai pelepasan mereka dari dosa."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "2. Hai orang-orang beriman, seseorang dari kalian yang mengharamkan istrinya baginya dengan zhihar seperti yang dilakukan Aus bin ash-Shamit; maka sesungguhnya istri mereka bukanlah ibu mereka, karena ibu mereka yang sebenarnya adalah wanita yang melahirkan mereka. Sungguh orang-orang yang menzhihar telah mengucapkan ucapan dusta. Dan Allah Maha Pengampun dan Pemaaf bagi orang yang bertaubat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. الَّذِينَ يُظٰهِرُونَ مِنكُم مِّن نِّسَآئِهِم (Orang-orang yang menzhihar isterinya di antara kamu, (menganggap isterinya sebagai ibunya)) Zhihar adalah seorang suami yang mengatakan kepada istrinya: “kamu bagiku seperti ibuku.” Tidak ada perbedaan pendapat bahwa ini adalah zhihar. مَّا هُنَّ أُمَّهٰتِهِمْ ۖ(( padahal) tiadalah isteri mereka itu ibu mereka) Yakni istri mereka bukanlah ibu mereka, karena perkataan itu merupakan perkataan dusta. Ini merupakan olokan bagi mereka yang menzhihar. إِنْ أُمَّهٰتُهُمْ إِلَّا الّٰٓـِٔى وَلَدْنَهُمْ ۚ( Ibu-ibu mereka tidak lain hanyalah wanita yang melahirkan mereka) Yakni ibu mereka hanyalah wanita yang melahirkan mereka. وَإِنَّهُمْ لَيَقُولُونَ مُنكَرًا مِّنَ الْقَوْلِ وَزُورًا ۚ( Dan sesungguhnya mereka sungguh-sungguh mengucapkan suatu perkataan mungkar dan dusta) Yakni ucapan zhihar itu adalah ucapan mungkar yang dilarang dalam syariat, karena ia menyerupakan istri yang dia gauli dengan ibunya, dan ini merupakan penghinaan besar bagi ibunya. Makna (الزور) yakni kedustaan. وَإِنَّ اللهَ لَعَفُوٌّ غَفُورٌ(Dan sesungguhnya Allah Maha Pemaaf lagi Maha Pengampun) Yakni Maha pemaaf dan pengampun, karena telah menjadikan kafarat sebagai pelebur dosa orang yang menzhihar dari kemungkaran yang dia lakukan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Orang-orang yang mendhihar istri-istrnya dengan perkataan: Kamu (istri) bagiku seperti punggung ibuku. Maka Khaulah mengharamkan dirinya untuk (digauli) oleh suaminya/ Karena dhihar adalah bentuk talak yang telak dalam tradisi Arab Jahiliyyah. Kamu orang-orang Arab ada yang berkata kepada istrinya, sambil menjauhi istrinya. Hal seperti ini adalah kebiasaan yang tercela. Para istri mereka tidak patut sama sekali disamakan dengan ibu suami mereka. Perkataan itu adalah dusta mereka. Ibu tidak lain adalah orang yang melahirkan mereka. Dengan menyamakan istri mereka dengan ibu mereka sendiri berarti mereka telah melakukan dhihar. Dengan itu, perkataan mereka benar-benar dusta dan mengingkari syariat. Adapun Allah Maha Pengampun dan Pemberi Maaf bagi orang-orang yang bertaubat dan melaksanakan kebaikan sebagai tebusan perbuatan buruk"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang menzhihar istri mereka di antara kalian} mengharamkan istri mereka atas diri mereka, sebagaimana Allah mengharamkan punggung ibu-ibu mereka atas mereka, yaitu mereka berkata kepada istri mereka,”Menurut kami, (punggung) kalian seperti punggung istri-istri kalian” {maka istri mereka itu bukanlah ibu mereka. Ibu-ibu mereka tidak lain} ibu-ibu mereka tidak lain {melainkan perempuan yang melahirkan mereka. Sesungguhnya mereka} sesungguhnya orang-orang yang menzhihar {benar-benar telah mengucapkan suatu perkataan yang mungkar} kasar {dan dusta} dan dusta {Sesungguhnya Allah benar-benar Maha Pemaaf lagi Maha Pengampun"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2. “Orang-orang yang menzhihar istrinya di antara kamu, (menganggap istrinya sebagai ibunya, padahal) tiadalah istri mereka itu ibu-ibu mereka. Ibu-ibu mereka tidak lain hanyalah wanita yang melahirkan mereka.” Menzhihar istri adalah, seorang suami berkata kepada istrinya, “Engkau bagiku seperti punggung ibuku,” atau wanita mahram lain selain ibu, atau dengan mengatakan “Engkau haram bagiku.” Kata-kata yang biasa digunakan ketika menzhihar istri adalah dengan menyebut “punggung”. Karena itulah Allah menyebut zhihar seraya berfirman, “Orang-orang yang menzhihar istrinya di antara kamu, (menganggap istrinya sebagai ibunya).” Maksudnya bagaimana mereka mengucapkan kata-kata yang mereka sendiri tahu tidak ada kenyataannya yang menyamakan istri dengan ibu yang melahirkan mereka? Karena itulah Allah membesarkan masalah ini serta mencelanya seraya berfirman, “Dan sesungguhnya mereka sungguh-sungguh mengucapkan suatu perkataan yang mungkar dan dusta.” Maksudnya, perkataan keji dan dusta. “Dan sesungguhnya Allah Maha Pemaaf lagi Maha Pengampun.” Dari berbagai penentangan yang mereka lakukan kemudian disusul dengan taubat yang sungguh-sungguh."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mujadalah ayat 2: Allah mencela dzihar, dan mengabarkan bahwa mereka yang mendzihar istri-istri mereka dan mengatakan kepada istrinya : Engkau bagiku adalah seperti punggung ibuku atau saudara perempuanku, adalah orang-orang yang berdosa atas apa yang telah mereka katakan. Dan tidaklah istri-istri mereka sama dengan ibu-ibu mereka. Ibunya tidak lain hanyalah yang melahirkan mereka. Allah mengabarkan mereka yang mendzihar bahwa mereka mengatakan perkataan bohong dan buruk; Karena mereka (para suami) menyamakan istri-istri mereka dengan ibu mereka, dan telah dikenal bahwa hubungan istri mereka dengan ibu mereka berbeda, dengan perbedaan yang mencakup keseluruhan jika dibandingkan dengan istri mereka. Maka sungguh Allah Maha Pemaaf dan Pengampun bagi siapa yang bertaubat dan menerima taubat bagi siapa yang terjatuh dalam kesalahan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya, bagaimana mereka mengucapkan kata-kata seperti itu yang sudah maklum tidak ada hakikatnya, mereka samakan istri dengan ibu mereka yang melahirkan mereka. Oleh karena itu, Allah Subhaanahu wa Ta'aala memperbesar masalah itu dan menyebut buruknya dengan firman-Nya, “Dan sesungguhnya mereka benar-benar telah mengucapkan suatu perkataan yang mungkar dan dusta.” Karena zhihar itu. Terhadap orang yang berbuat zhihar dengan membayar kaffarat atau orang yang terjatuh mengerjakan pelanggaran, kemudian ia susul dengan tobat nashuha."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mujadalah Ayat 2",
    "description": "Orang-orang, yakni para suami, di antara kamu yang menzihar istrinya, yaitu menyamakan status hukum istrinya dengan ibunya, yaitu memandang keduanya sama-sama haram digauli, karena tidak lagi menyukainya. Suami yang memperlakukan istrinya demikian telah berbuat kesalahan yang berat, karena istri mereka itu bukanlah ibunya sehingga tidak haram digauli. Mereka tidak menyadari bahwa ibu-ibu mereka adalah perempuan yang telah melahirkannya. Dan sesungguhnya mereka, para suami yang menzihar istrinya, benar-benar telah mengucapkan suatu perkataan yang mungkar karena ucapan itu hanya alasan bahwa ia tidak lagi menyukai istrinya dan merupakan ucapan dusta, karena tidak sesuai dengan fakta bahwa istri itu berbeda dengan ibu kandungnya. Dan sesungguhnya Allah maha pemaaf kepada siapa saja yang menyadari kesalahannya bahwa ia telah menzihar istrinya; maha pengampun kepada yang bertobat dengan tulus. 3. Dan mereka yang menzihar istrinya, lalu menyesali perbuatannya, kemudian segera menarik kembali apa yang telah mereka ucapkan kepada istrinya itu, maka mereka para suami yang telah menzihar istrinya itu diwajibkan membayar kafarat, yakni tebusan dengan memerdekakan seorang budak sebelum suami istri itu bercampur kembali seperti sebelum menziharnya. Demikianlah yang diajarkan Allah kepadamu, kaum muslim tentang hukum zihar dan panduan membayar tebusannya, dan Allah mahateliti terhadap apa yang kamu kerjakan agar orang-orang beriman menyadari kemahatelitian Allah sehingga tidak berbuat curang dalam hidupnya."
  }
]