[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang yang menyelisihi perintah Allah dan RasulNya, adalah termasuk di antara orang-orang yang terhina, kalah, dan rendah di dunia dan akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "20. Sesungguhnya orang-orang yang memusuhi Allah dan memusuhi Rasul-Nya, mereka termasuk bagian dari orang-orang yang dihinakan oleh Allah di dunia dan di akhirat serta direndahkan oleh-Nya termasuk kalangan umat-umat yang kafir."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "20. Orang-orang yang menentang hukum dari Allah dan Rasul-Nya adalah orang-orang yang jauh dari kebenaran; mereka termasuk golongan yang terhina dan jauh dari rahmat Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "20. إِنَّ الَّذِينَ يُحَآدُّونَ اللهَ وَرَسُولَهُۥٓ (Sesungguhnya orang-orang yang menentang Allah dan Rasul-Nya) Telah dijelaskan makna penentangan terhadap Allah dan Rasulullah pada awal surat ini. أُو۟لٰٓئِكَ فِى الْأَذَلِّينَ(mereka termasuk orang-orang yang sangat hina) Yakni termasuk umat-umat yang dihinakan Allah di dunia dan akhirat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20. Sesungguhnya orang-orang yang menentang Allah dengan meninggalkan perintah-Nya adalah golongan orang-orang yang sangat hina"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang yang menentang Allah dan RasulNya, mereka termasuk orang-orang yang sangat hina} orang-orang yang rendah dan dikalahkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "20-21. Ini adalah janji dan sekaligus ancaman. Ancaman bagi siapa saja yang menentang Allah dan rasulNya dengan kekufuran dan berbagai kemaksiatan. Ia akan mendapatkan kerendahan dan kehinaan, dan tidak ada kesudahan baik baginya, serta tidak memperoleh kemenangan. Janji bagi siapa pun yang beriman kepada Allah dan rasulNya serta mengikuti ajaran yang dibawa oleh para rasul. Ia menjadi bagian dari tentara Allah yang mendapatkan keberuntungan. Ia akan mendapatkan kemenangan dan pertolongan di dunia dan akhirat. Ini adalah janji yang tidak akan dipungkiri dan dirubah. Karena janji ini berasal dari Allah Yang Mahabenar, Kuat, Perkasa, yang kehendakNya tidak bisa dikalahkan oleh apa pun."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Mujadalah ayat 20: Ayat ini dan ayat setelahnya merupakan ancaman dan janji. Ancaman terhadap orang yang menentang Allah dan Rasul-Nya dengan berbuat kufur dan maksiat bahwa ia akan ditelantarkan dan dihinakan serta tidak mendapatkan akhir yang baik. Dan terdapat janji bagi orang-orang yang beriman kepada Allah dan rasul-rasul-Nya serta mengikuti para rasul-Nya, bahwa untuk mreka kemenangan dan pertolongan di dunia dan akhirat. Ini merupakan janji yang tidak dapat dipungkiri dan diubah karena Allah Subhaanahu wa Ta'aala Mahabenar, Mahakuat dan Mahaperkasa dimana tidak ada yang dapat menghalangi keinginan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mujadalah Ayat 20",
    "description": "Pada ayat sebelumnya disebutkan bahwa orang-orang munafik itu membohongi Allah dan rasul-Nya karena dirinya dikuasai setan sehingga termasuk golongan setan. Sementara itu pada ayat ini disebutkan bahwa sesungguhnya orang-orang yang menentang Allah dan rasul-Nya dengan tidak beriman atau bersumpah beriman padahal hatinya penuh dengan kekafiran dan menghalangi orang untuk beriman, mereka termasuk orang-orang yang sangat hina, karena karakternya busuk, hipokrit, tidak sportif, bermuka dua dan berpura-pura. 21. Allah mengingatkan manusia tentang sunah-Nya bahwa dia telah menetapkan pada kitab induk di loh mahfuz bahwa 'aku dan rasul-rasul-ku pasti menang' dalam melawan kebatilan. Sungguh, Allah mahakuat, mahaperkasa menghadapi musuh-Musuh-Nya."
  }
]