[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah telah menulis di Lauhul Mahfuzh dan memutuskan bahwa kemenangan adalah milikNya, kitabNya, para utusanNYa dan hamba-hambaNya yang Mukmin. Sesungguhnya Allah Mahakuat, tidak ada sesuatu pun yang melemahkanNya lagi Mahaperkasa atas makhlukNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Allah telah menetapkan berdasarkan ilmu-Nya yang telah lalu, “Sungguh Aku dan Rasul-rasul-Ku benar-benar pasti akan menang terhadap musuh-musuh-Ku dengan hujah dan kekuatan.” Sesungguhnya Allah Mahakuat dalam menolong Rasul-rasul-Nya dan Maha Perkasa dalam membalas musuh-musuh mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "21. Allah telah menetapkan dalam ilmu-Nya bahwa kemenangan adalah milik agama dan para Rasul-Nya. Allah Maha Kuat terhadap musuh-musuh-Nya, dan Maha Perkasa dalam memberi pembalasan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "21. كَتَبَ اللهُ لَأَغْلِبَنَّ أَنَا۠ وَرُسُلِىٓ ۚ (Allah telah menetapkan: “Aku dan rasul-rasul-Ku pasti menang”) Yakni Allah telah meretapkan dalam ilmu-Nya. Yakni Aku dan para Rasul-Ku pasti akan menang dengan hujjah dan kekuasaan-Ku. إِنَّ اللهَ قَوِىٌّ عَزِيزٌ(Sesungguhnya Allah Maha Kuat lagi Maha Perkasa) Yakni berkuasa untuk menolong para kekasih-Nya, dan mengalahkan musuh-musuh-Nya; tidak ada yang mampu mengalahkan-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "21. Allah telah menetapkan dan memutuskan dalam catatan Lauhul Mahfudz: Aku dan rasul-Ku pasti menang terhadap siapun yang memusuhi Kami. Allah Maha Memberi Pertolongan kepada hamba-Nya yang beriman. Allah Maha Perkasa dan Maha Mengalahkan siapapun yang memusuhi-Nya. Ayat ini turun ketika kaum muslim memohon kemenangan dalam menaklukkan negeri Persi dan Rum. Abdullah bin Abb berkata: Apakah kalian maengira bahwa Rum dan Persi itu hanya seperti sebuah desa yang sudah kalian taklukkan sebelumnya? Demi Allah, Rum dan Persi adalah lebih luas dan besar dari apa yang telah kalian kira sebelumnya. Maka turunlah ayat ini."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Allah telah menetapkan} menetapkan {Sungguh Aku dan rasul-rasulKu pasti menang”} pasti menang {Sesungguhnya Allah Maha kuat lagi Maha perkasa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "20-21. Ini adalah janji dan sekaligus ancaman. Ancaman bagi siapa saja yang menentang Allah dan rasulNya dengan kekufuran dan berbagai kemaksiatan. Ia akan mendapatkan kerendahan dan kehinaan, dan tidak ada kesudahan baik baginya, serta tidak memperoleh kemenangan. Janji bagi siapa pun yang beriman kepada Allah dan rasulNya serta mengikuti ajaran yang dibawa oleh para rasul. Ia menjadi bagian dari tentara Allah yang mendapatkan keberuntungan. Ia akan mendapatkan kemenangan dan pertolongan di dunia dan akhirat. Ini adalah janji yang tidak akan dipungkiri dan dirubah. Karena janji ini berasal dari Allah Yang Mahabenar, Kuat, Perkasa, yang kehendakNya tidak bisa dikalahkan oleh apa pun."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mujadalah ayat 21: Allah menjelaskan bahwa Ia menetapkan takdir dimana Allah dan Rasul-Nya serta para pengikutnya pasti menang dengan hujjah dan bukti, dengan pedang dan panah, karena sungguh Allah Maha Kuat, Maha Kuasa atas segala sesuatunya, Maha Gagah yang mengalahkan dan tidak terkalahkan dengan sesuatu apapun."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dalam Lauh Mahfuzh. Dengan hujjah atau pedang."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mujadalah Ayat 21",
    "description": "Allah mengingatkan manusia tentang sunah-Nya bahwa dia telah menetapkan pada kitab induk di loh mahfuz bahwa 'aku dan rasul-rasul-ku pasti menang' dalam melawan kebatilan. Sungguh, Allah mahakuat, mahaperkasa menghadapi musuh-Musuh-Nya. 22. Allah lalu menyatakan, 'engkau, Muhammad, tidak akan mendapatkan suatu kaum yang beriman kepada Allah dan hari akhirat saling berkasih sayang dengan orang-orang yang menentang Allah dan rasul-Nya, sekalipun orang-orang itu bapaknya, anaknya, saudaranya, atau keluarganya. ' mereka itulah orang-orang yang dalam hatinya telah ditanamkan Allah keimanan dan Allah telah menguatkan mereka dengan pertolongan yang datang dari dia berupa kemauan dan kekuatan batin, kebersihan hati, kemenangan terhadap musuh dan lain-lain. Lalu dimasukkan-Nya mereka ke dalam surga yang mengalir di bawahnya sungai-sungai, mereka kekal di dalamnya. Allah rida terhadap mereka dan mereka pun merasa puas terhadap (limpahan rahmat)-Nya. Merekalah golongan Allah. Ingatlah, sesungguhnya golongan Allah itulah yang beruntung."
  }
]