[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kamu (wahai Rasul) tidak akan mendapati suatu kaum yang membenarkan Allah dan Hari Kiamat, serta melaksanakan apa yang disyariatkan, mencintai dan loyal kepada orang-orang yang memusuhi Allah dan RasulNya dan menyelisihi perintah keduanya, sekalipun mereka adalah bapak-bapak, atau anak-anak, atau saudara-saudara, atau para kerabat mereka. Orang-orang yang mencintai dan memusuhi karena Allah, Allah akan meneguhkan iman dalam hati mereka, menguatkan mereka dengan kemenangan dari sisiNya dan dukungan atas musuh-musuh mereka di dunia, memasukkan mereka di akhirat ke dalam surga-surga yang sungai-sungai mengalir didalamnya selamanya, yang tidak akan pernah berakhir. Allah menurunkan ridhaNya kepada mereka sehingga Dia tidak murka kepada mereka, mereka ridha kepada Tuhan mereka dengan apa yang Dia berikan kepada mereka berupa pemuliaan-pemuliaan dan derajat-derajat yang tinggi. Mereka adalah golongan Allah dan wali-waliNya. Mereka adalah orang-orang yang beruntung mendapatkan kebahagiaan dunia dan akhirat"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "22. Kamu tidak akan dapati -wahai Rasul- suatu kaum yang beriman kepada Allah dan beriman kepada hari Kiamat yang mencintai dan loyal kepada orang-orang yang memusuhi Allah dan Rasul-Nya, meskipun musuh-musuh Allah itu adalah bapak-bapak mereka, anak-anak mereka, saudara-saudara mereka dan keluarga tempat mereka bersandar, karena iman itu mencegah dari saling tolong-menolong dengan musuh-musuh Allah dan Rasul-Nya, dan karena ikatan iman itu lebih kuat dari segala ikatan, dan ikatan iman itu harus diprioritaskan apabila terjadi pertentangan. Orang-orang yang tidak menjadikan penolong dari orang-orang yang memusuhi Allah dan Rasul-Nya -meskipun masih kerabat mereka- adalah orang-orang yang telah ditetapkan keimanan di dalam hati mereka sehingga tidak berubah. Allah menguatkan mereka dengan bukti nyata dan cahaya dari-Nya, dan memasukkan mereka pada Hari Kiamat ke dalam Surga-surga ‘Adn yang di bawah istana-istana dan pepohonannya mengalir sungai-sungai. Mereka menetap di dalamnya selamanya, kenikmatannya tidak pernah berhenti dari mereka dan keberadaan mereka di dalam Surga itu pun tidak terhenti. Allah meridai mereka dengan keridaan yang tidak akan dimurkai Allah setelahnya, dan mereka pun meridai-Nya karena Allah telah memberikan kepada mereka kenikmatan yang tidak pernah habis. Di antara kenikmatan itu adalah bisa melihat kepada Allah -Subhānahu-. Orang-orang yang mempunyai kriteria seperti ini adalah tentara Allah yang senantiasa menaati apa yang diperintahkan oleh Allah dan menahan diri dari apa yang dilarang-Nya. Ketahuilah bahwa tentara Allah adalah orang-orang yang menang karena mendapatkan apa yang mereka inginkan dan terhindar dari apa yang mereka takuti di dunia dan di Akhirat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "22. Hai Rasulullah, Kamu tidak akan mendapati kaum yang beriman kepada Allah dan hari akhir yang menjadikan musuh-musuh Allah sebagai penolong dan pelindung, meski musuh-musuh itu adalah para bapak, anak-anak, saudara-saudara, atau kerabat mereka. Orang-orang beriman yang memiliki derajat yang tinggi itu telah Allah tetapkan hati mereka untuk keimanan dan Allah beri pertolongan dalam menghadapi musuh-musuh mereka di dunia; dan Allah akan memuliakan mereka di akhirat dengan memasukkan mereka ke dalam surga-surga yang di bawah istana-istananya terdapat sungai-sungai air tawar yang mengalir; mereka akan tinggal di dalamnya selamanya. Allah menerima amalan dan meridhai mereka, dan mereka mendapat pahala-Nya sehingga mereka ridha atas karunia-Nya. Orang-orang beriman yang memiliki derajat yang tinggi itu merupakan para kekasih dan tentara Allah, mereka berhasil mendapatkan kehidupan yang baik di dunia, dan surga yang penuh kenikmatan di akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "22. لَّا تَجِدُ قَوْمًا يُؤْمِنُونَ بِاللهِ وَالْيَوْمِ الْءَاخِرِ يُوَآدُّونَ مَنْ حَآدَّ اللهَ وَرَسُولَهُۥ (Kamu tak akan mendapati kaum yang beriman pada Allah dan hari akhirat, saling berkasih-sayang dengan orang-orang yang menentang Allah dan Rasul-Nya) Yakni mencintai dan menjadikan sekutu orang yang menentang Allah dan Rasulullah. وَلَوْ كَانُوٓا۟ ءَابَآءَهُمْ أَوْ أَبْنَآءَهُمْ أَوْ إِخْوٰنَهُمْ أَوْ عَشِيرَتَهُمْ ۚ( sekalipun orang-orang itu bapak-bapak, atau anak-anak atau saudara-saudara ataupun keluarga mereka) Yakni meskipun orang yang menentang Allah dan Rasulullah itu adalah bapak-bapak mereka dan seterusnya, sebab keimanan mereka melarang mereka untuk mencintai orang yang menentang Allah dan rasulullah, dan menjaga keimanan lebih utama daripada menjaga hubungan dengan bapak, anak, saudara dan kerabat. أُو۟لٰٓئِكَ(Mereka itulah) Yakni orang-orang yang tidak mencintai orang yang menentang Allah dan Rasulullah. كَتَبَ فِى قُلُوبِهِمُ الْإِيمٰنَ(orang-orang yang telah menanamkan keimanan dalam hati mereka) Yakni keimanannya diteguhkan dalam hatinya, pendapat lain mengatakan yakni Allah akan memberinya keimanan, pendapat lain mengatakan yakni Allah akan mengumpulkan keimanan dalam hatinya. وَأَيَّدَهُم بِرُوحٍ مِّنْهُ ۖ( dan menguatkan mereka dengan pertolongan yang datang daripada-Nya) Yakni menguatkan mereka dengan memberi pertolongan dalam melawan musuh mereka di dunia. Allah menyebutkan pertolongan dari-Nya dengan istilah ‘ruh’ karena dengan pertolongan itu urusan mereka dapat berlanjut. وَيُدْخِلُهُمْ جَنّٰتٍ تَجْرِى مِن تَحْتِهَا الْأَنْهٰرُ خٰلِدِينَ فِيهَا ۚ( Dan dimasukan-Nya mereka ke dalam surga yang mengalir di bawahnya sungai-sungai, mereka kekal di dalamnya) Yakni selama-lamanya. رَضِىَ اللهُ عَنْهُمْ (Allah ridha terhadap mereka) Yakni menerima amalan mereka dan memberi mereka rahmat-Nya di dunia maupun di akhirat. وَرَضُوا۟ عَنْهُ ۚ( dan merekapun merasa puas terhadap (limpahan rahmat)-Nya) Yakni mereka gembira dengan apa yang diberikan Allah kepada mereka baik itu di dunia maupun di akirat. أُو۟لٰٓئِكَ حِزْبُ للهِ ۚ( Mereka itulah golongan Allah) Yakni tentara-Nya yang mentaati perintah-Nya, memerangi musuh-musuh-Nya, dan menolong para kekasih-Nya. أَلَآ إِنَّ حِزْبَ اللهِ هُمُ الْمُفْلِحُونَ (Ketahuilah, bahwa sesungguhnya hizbullah itu adalah golongan yang beruntung) Yakni mereka adalah orang-orang yang meraih kebahagiaan dunia dan akhirat. Ibnu Abi Hatim, Thabrani, dan Hakim meriwayatkan: bahwa ayah Abu Ubaidah pada perang Badar selalu mengincarnya, namun Abu Ubaidah selalu menghindarinya; dan ketika ayahnya terus menerus melakukan itu, Abu Ubaidah kemudian mendatanginya dan membunuhnya. Maka turunlah ayat ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "22. Engkau tidak akan mendapati suatu kaum yang mau beriman kepada Allah dan hari kikamat. Mereka mencintai orang yang memusuhi dan menentang perintah Allah dan rasul-Nya, dan justru menjadikan sahabat bagi mereka. Itu semua sungguh tidak patut untuk mereka lakukan. Engkau tidak akan mendapati sama sekali, meskipun bapak mereka, atau anaknya, atau saudaranya, atau kerabatnya. Artinya walaupun orang-orang yang menentang Allah dan rasul-Nya itu adalah bapak dari orang-orang yang mencintai mereka, dan seterusnya. Karena iman melarang untuk itu. Mereka orang-orang mukmin yang tidak mencintai para pembangkang Allah, akan Allah tanamkan iman yang teguh di dalam hati mereka. Allah akan menancapkan cahaya dalam hati mereka. Allah akan memasukkan mereka dalam surga yang di bawahnya mengalir sungai-sungai. Mereka kekal di dalamnya, Allah meridhoi mereka sebab ketaatan mereka. Allah meridhoi mereka dengan memberi pahala kepada mereka sebagaimana janji-Nya. Mereka adalah tentara Allah dan penolong Agama-Nya. Mereka para penolong agama adalah golongan yang mendapatkan dua kebaikan, yaitu kebaikan dunia dan akhirat. Abdullah bin Syaudzab berkata: Ayat ini diturunkan untuk Abu Ubaidah bin Jaraoh ketika membunuh ayahnya pada perang Badr"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kamu tidak akan mendapati suatu kaum yang beriman kepada Allah dan hari Akhir saling mengasihi} mengasihi dan membantu {dengan orang yang menentang} menentang {Allah dan RasulNya sekalipun mereka itu ayah, anak, saudara, atau kerabat mereka} kerabat mereka {Mereka itulah orang-orang yang telah Allah tetapkan} telah ditetapkan {keimanan di dalam hati mereka dan menguatkan mereka} menguatkan mereka {dengan pertolongan dariNya} dengan cahaya dan bukti dariNya {Dia akan memasukkan mereka ke dalam surga yang mengalir di bawahnya sungai-sungai. Mereka kekal di dalamnya. Allah ridha kepada mereka dan mereka pun ridha kepadaNya. Mereka itulah tentara Allah. Ingatlah sesungguhnya tentara Allah itulah orang-orang yang beruntung}"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "22. Allah berfirman, “Kamu tidak akan mendapati sesuatu kaum yang beriman kepada Allah dan Hari Akhirat, saling berkasih sayang dengan orang-orang yang menentang Allah dan RasulNya,” maksudnya tidaklah menyatu antara orang yang beriman kepada Allah dan RasulNya dengan orang yang menentang Allah dan RasulNya. Tidaklah seorang hamba beriman kepada Allah dan Hari Akhir dengan sebenarnya melainkan pasti melaksanakan tuntutan dan keharusan iman yaitu mencintai dan loyal terhadap orang yang beriman dan membenci orang yang tidak beriman dan yang memusuhinya meski terhadap orang yang dekat sekalipun. Inilah iman yang sebenarnya yang bermanfaat dan yang dimaksudkan. Orang yang memiliki sifat tersebut adalah “orang-orang yang Allah telah menanamkan keimanan dalam hati mereka.” Artinya, keimanan telah ditetapkan, dikokohkan, dan ditanamkan dalam diri mereka secara kuat, yang tidak bisa tergoncang dan terpengaruh oleh berbagai syubhat dan keraguan. Mereka adalah orang-orang yang dikuatkan oleh Allah “dengan pertolongan yang datang dariNya,” yakni dari wahyu, pertolongan, dan bantuan ilahi, serta kebaikan rabbani dan mereka itulah orang-orang yang memiliki kehidupan baik di akhirat. Mereka mendapatkan surga penuh kenikmatan di tempat keabadian. Di dalamnya terdapat semua hal yang diinginkan jiwa dan dinikmati serta dipilih oleh mata. Mereka mendapatkan kenikmatan terbesar dan terbaik, yaitu Allah menghalalkan keridhaanNya bagi mereka. Allah tidak akan murka pada mereka selamanya. Mereka ridha terhadap Rabb mereka atas berbagai macam kemuliaan, pemberian, dan derajat tinggi yang diberikan pada mereka, karena mereka tidak melihat adanya batas di atas pemberian Allah itu dan tidak pula melihat adanya akhiran di bawah pemberian itu. Adapun orang yang mengira bahwa dirinya beriman kepada Allah dan Hari Akhir, namun di samping beriman ia juga mencintai musuh-musuh Allah dan menyukai orang-orang yang membuang keimanan di balik punggungnya, maka keimanannya hanyalah semu, yang tidak ada hakikatnya. Karena setiap hal harus memiliki bukti penguat. Anggapan saja tidak berguna dan orangnya tidak bisa dibenarkan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mujadalah ayat 22: Kemudian Allah memuji atas hambanya yang beriman dan jujur dengan berlepas diri dari kaum munafiqin dan musyrikin. Allah berkata : Ketahuilah wahai Nabi Allah, engkau tidak akan mendapati suatu kaum yang beriman kepada Allah dan Rasul-Nya ﷺ secara haq dan mereka yang mengetaui syariat-Nya; Berkasih sayang dan mencintai orang-orang musyrik yang bermaksiat kepada Allah dan Rasul-Nya ﷺ dan menyimpang dari perintah Allah, meskipun mereka orang-orang yang bermaksiat adalah kerabat; Seperti bapaknya yang wajib seorang anak mentaatinya, atau anak keturunan yang mereka adalah darah dagingnya, atau saudara yang menolong mereka, atau kaum yang diunggulkan setelah saudara; Maka mereka semua yang tidak mencintai musuh-musuh Allah, di dalam hatinya Allah berikan keimanan dan Allah tambah dengan pertolongan-Nya dan Allah kokohkan (keimanan mereka). Dan di antara karunia Allah kepada mereka, Allah akan memasukkan mereka ke dalam kebun-kebun yang luas, yang mengalir dibawahnya sungai-sungai, mereka semua tinggal di dalamnya selama-lamanya. Mereka memiliki sebesar-sebesar kenikmatan dan keutamaan, Allah meridhai mereka dan tidak akan murka kepada mereka selama-lamanya. Keridhaan Allah kepada mereka karena sebab ketaatan mereka yang mendatangkan kemuliaan. Ketahuilah mereka adalah orang-orang yang tidak mencintai musu-musuh Allah, mereka ada pembela Allah dan tentara Allah yang mereka mematuhi perintah-perintah Allah, dan menjauhi larangan-Nya, dan memerangi musuh-musuh-Nya, dan menolong kekasih-kekasih Allah (Rasul, Nabi, dll,); Mereka adalah orang-orang yang menang dengan kebahagiaan di dunia dan akhirat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya, tidak mungkin orang-orang yang beriman itu berkasih sayang kepada orang-orang yang menentang Allah dan Rasul-Nya, karena orang yang beriman kepada Allah dan hari Akhir secara hakiki akan mengamalkan konsekwensi keimanan dan hal yang menyatu dengannya berupa mencintai orang-orang yang beriman dan berwala’ kepada mereka serta membenci orang-orang yang tidak beriman dan memusuhinya meskipun ia adalah orang yang paling dekat hubungan dengannya. Inilah keimanan yang hakiki yang ada buahnya dan maksudnya. Orang-orang yang seperti ini telah Allah tanamkan keimanan dalam hati mereka sehingga syubhat dan keraguan tidak akan berpengaruh lagi terhadapnya. Merekalah orang-orang yang telah dikuatkan Allah dengan ruh dari-Nya, yaitu dengan wahyu dan pertolongan-Nya serta bantuan ilahi serta ihran rabbani seperti kemauan batin, kebersihan hat, kemenangan terhadap musuh dan lain-lain. Merekalah orang yang mendapatkan kehidupan yang baik di dunia ini dan memperoleh surga yang penuh kenikmatan di akhirat; yang di dalamnya terdapat segala yang disenangi jiwa dan indah dipandang mata, dan mereka mendapatkan nikmat yang paling besar dan paling utama, yaitu bahwa Allah Subhaanahu wa Ta'aala akan melimpahkan kepada mereka keridhaan-Nya sehingga Dia tidak akan murka lagi kepada mereka dan mereka pun ridha kepada Tuhan mereka karena pemberian-Nya itu berupa berbagai keistimewaan, berbagai balasan, pemberian yang banyak dan ketinggian derajat dimana mereka tidak melihat ada lagi pemberian yang melebihi itu. Adapun orang yang mengaku bahwa dirinya beriman kepada Allah dan hari Akhir, namun dia mengasihi musuh-musuh Allah; mencintai orang yang membuang iman ke belakang punggungnya, maka iman ini adalah iman pengakuan yang tidak ada hakikatnya, karena segala sesuatu butuh bukti yang membenarkannya. Pengakuan semata tidaklah membuahkan apa-apa dan tidak membenarkan pengakunya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mujadalah Ayat 22",
    "description": "Allah lalu menyatakan, 'engkau, Muhammad, tidak akan mendapatkan suatu kaum yang beriman kepada Allah dan hari akhirat saling berkasih sayang dengan orang-orang yang menentang Allah dan rasul-Nya, sekalipun orang-orang itu bapaknya, anaknya, saudaranya, atau keluarganya. ' mereka itulah orang-orang yang dalam hatinya telah ditanamkan Allah keimanan dan Allah telah menguatkan mereka dengan pertolongan yang datang dari dia berupa kemauan dan kekuatan batin, kebersihan hati, kemenangan terhadap musuh dan lain-lain. Lalu dimasukkan-Nya mereka ke dalam surga yang mengalir di bawahnya sungai-sungai, mereka kekal di dalamnya. Allah rida terhadap mereka dan mereka pun merasa puas terhadap (limpahan rahmat)-Nya. Merekalah golongan Allah. Ingatlah, sesungguhnya golongan Allah itulah yang beruntung. 1. Apa yang ada di langit, bintang, bulan, planet, dan seluruh isi galaksi, dan apa yang ada di bumi, lautan, daratan, gunung, sungai, tumbuh-tumbuhan, hewan, dan lain-lain semuanya bertasbih kepada Allah, menyatakan kemahasucian Allah menurut caranya masing-masing sesuai dengan keadaan dan kejadiannya, sedangkan manusia tidak memahami tasbih makhluk-makhluk tersebut; dan dialah yang mahaperkasa, menciptakan dan menghancurkan jagat raya; mahabijaksana, dalam penciptaan dan pengaturan alam semesta."
  }
]