[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang yang mengharamkan istri-istri mereka atas diri mereka dengan zhihar, kemudian mereka membatalkan ucapan mereka dan hendak menggauli istri-istri mereka, maka suami yang menzhihar dalam keadaan ini harus membayar kafarat pengharaman, yaitu memerdekakan seorang budak laki-laki atau perempuan yang beriman sebelum menggauli istrinya yang dizhahirnya. Itu adalah hukum Allah (untuk siapa yang menzhihar istrinya) dengannya kalian wahai orang-orang beriman dinasehati, agar kalian tidak melakukan zhihar dan berkata dusta, dan kalian bisa membayar kafaratnya bila kalian melakukannya, dan agar kalian tidak mengulanginya. Allah, tidak samar bagiNya sedikit pun dari amal-amal kalian, dan Dia akan membalas kalian atasnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Dan orang-orang yang mengucapkan ucapan yang mungkar ini, kemudian ia ingin bersenggama dengan istri-istri yang telah mereka zihar, maka mereka wajib membayar kafarat dengan membebaskan seorang budak sebelum bersenggama dengannya. Demikianlah hukum yang diperintahkan kepada kalian sebagai peringatan agar kalian tidak melakukan zihar, dan Allah Maha Mengetahui apa yang kalian kerjakan, tidak ada sesuatu pun dari perbuatan kalian yang luput dari-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "3-4. Hukum bagi orang-orang yang mengharamkan istrinya baginya dengan zhihar, kemudian menarik kembali pengharamnya itu dan bertekat akan kembali mempergaulinya adalah: Wajib memerdekakan budak sebelum mempergauli istrinya kembali. Ini merupakan peringatan besar agar kalian mendapat pelajaran darinya. Dan Allah Maha Mengetahui segala yang kalian lakukan, tidak ada yang tersembunyi dari-Nya. Namun juka dia tidak memiliki budak yang bisa dia merdekakan atau tidak memiliki harta untuk membelinya, maka wajib baginya berpuasa selama dua bulan berturut-turut sebelum mempergauli istrinya. Dan jika tidak mampu berpuasa, maka wajib baginya memberi makan enam puluh orang miskin dengan makanan kualitas pertengahan. Rukhshah -keringanan- ini disyariatkan agar kalian beriman kepada Allah dan rasul-Nya dengan menerima hukum-hukum ini. Demikianlah hukum-hukum Allah, maka janganlah kalian melanggarnya. Dan orang-orang yang mendustakan Allah akan mendapat azab yang menyakitkan. Imam ath-Thabari meriwayatkan dengan sanad yang hasan, dari Ali bin Abi Thalhah, dari Ibnu Abbas tentang firman Allah (وَٱلَّذِينَ يُظَٰهِرُونَ مِن نِّسَآئِهِمْ ثُمَّ يَعُودُونَ لِمَا قَالُو) yakni lelaki yang berkata kepada istrinya: “Kamu bagiku seperti ibuku”, jika dia mengatakan itu maka dia haram mempergauli istrinya sebelum menunaikan kafarat ucapannya itu dengan memerdekakan budak. (at-Tafsir ash-Shahih 6/76)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. وَالَّذِينَ يُظٰهِرُونَ مِن نِّسَآئِهِمْ ثُمَّ يَعُودُونَ لِمَا قَالُوا۟ (Orang-orang yang menzhihar isteri mereka, kemudian mereka hendak menarik kembali apa yang mereka ucapkan) Yakni mereka kembali ingin mempergauli istrinya seperti dulu. فَتَحْرِيرُ رَقَبَةٍ(maka (wajib atasnya) memerdekakan seorang budak) Yakni wajib baginya untuk memerdekakan seorang budak baik itu budak laki-laki maupun perempuan sebagai kafarat ucapannya. Pendapat lain mengatakan bahwa yang dimaksud adalah kembali menjadikan wanita itu sebagai istrinya setelah ia zhihar, meski ia mampu untuk menceraikannya. مِّن قَبْلِ أَن يَتَمَآسَّا ۚ( sebelum kedua suami isteri itu bercampur) Yakni sebelum berjima. Yakni mereka berdua dilarang berjima’ sampai suaminya membayar kafarat. ذٰلِكُمْ(Demikianlah) Yakni hukum tersebut. تُوعَظُونَ بِهِۦ ۚ( yang diajarkan kepada kamu) Yakni yang diperintahkan kepadanya, atau yang diperingatkan kepadanya agar tidak melakukan zhihar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Orang-orang yang men-dhihar istrinya, maka mereka diharamkan untuk menyentuh istrinya sebelum menebus perkataan itu dengan memerdekakan satu orang budak, baik budak perempuan atau laki-laki. Inilah hukum yang tertulis dan diberlakukan untuk kalian. Allah Maha Mengetahui atas segala perbuatan kalian, tidak ada yang bisa tersembunyi"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang menzhihar istri-istri mereka kemudian menarik kembali apa yang telah mereka ucapkan} menarik ucapan mereka dan hendak menggauli istri mereka {maka wajib memerdekakan seorang budak} maka wajib memerdekakan budak perempuan {sebelum keduanya berhubungan badan} mereka bersenang-senang dengan berjima’ {Demikianlah yang diajarkan kepada kalian. Allah Maha Mengetahui terhadap apa yang kalian kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3. “Dan orang-orang yang menzhihar istri mereka, kemudian mereka hendak menarik kembali apa yang mereka ucapkan.” Para ulama berbeda pendapat tentang makna “menarik kembali” dalam ayat ini. Ada yang menyatakan maknanya adalah tekad untuk menggauli istri yang dizhihar. Yakni hanya sekedar bertekad harus menebus kaffarat yang disebutkan. Pendapat ini dikuatkan bahwa Allah menyebutkan kaffarat sebelum terjadinya pergaulan suami istri sehingga penebusan kaffarat tersebut terjadi setelah adanya tekad dari suami untuk menggauli istri yang dizhihar. Pendapat lain menyatakan, maknanya adalah pergaulan suami istri yang sebenarnya. Pendapat ini dikuatkan oleh Firman Allah, “Kemudian mereka hendak menarik kembali apa yang mereka ucapkan,” dan yang mereka katakan hanyalah pergaulan suami istri. Berdasarkan masing-masing kedua pendapat di atas, ketika sang suami kembali, maka ia harus menebus kaffarat, yaitu: “memerdekakan seorang budak,” yang beriman sebagaimana yang dibatasi dalam ayat tentang kaffarat pembunuhan, baik lelaki maupun perempuan, dengan syarat tidak memiliki cacat yang mengganggu pekerjaan si budak, “sebelum kedua suami istri itu bercampur.” Maksudnya, suami harus menjauhi istrinya yang dizhihar dan tidak dicampuri sampai membayar kaffarat dengan memerdekakan seorang budak yang beriman. “Demikianlah,” hukum yang Kami jelaskan pada kalian “yang diajarkan kepada kamu,” yakni Allah menjelaskan hukumNya kepada kalian yang disertai dengan ancaman, karena makna nasihat adalah menyebutkan suatu hukum dengan disertai janji dan ancaman. Untuk itu, siapa saja yang ingin menzhihar istrinya jika ingat hukumannya memerdekakan seorang budak, maka akan menahan diri agar tidak melakukannya. “Dan Allah Maha Mengetahui apa yang kamu kerjakan.” Allah akan membalas masing-masing orang berdasarkan amalnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mujadalah ayat 3: Ketahuilah wahai orang-orang beriman bahwa siapa yang terjatuh dalam permasalahan dzihar, kemudian rujuk atas apa yang ia katakan, dan berhasrat ingin menjima’ (menyetubuhi) istrinya, maka baginya kafarah, yang pertama adalah membebaskan budak perempuan yang mukmin sebelum menjima’ istrinya, dan hukum ini diperintahkan (yaitu wajib). Dan Allah Maha Mengetahui atas apa yang kamu kerjakan, tidak tersembunyi sedikitpun dari apa yang kalian niatkan dan amalkan, dan akan dibalas amalan tersebut. Maka barangsiapa yang tidak mampu membebaskan budah perempuan yang beriman atau memiliki kemampuan membeli budak tersebut; Kafahnya adalah berpuasa dua bulan berturut-turut sebelum mendatangi istrinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Para ulama berbeda pendapat tentang makna ‘aud’ (menarik kembali). Ada yang mengatakan, bahwa maknanya adalah berniat untuk menjima’i istrinya yang telah dizhihar, dan bahwa dengan adanya niat untuk kembali, maka ia wajib membayar kaffarat yang disebutkan.” Ada pula yang mengatakan, bahwa ‘aud’ di sini adalah berjima’. Imam Ahmad bin Hanbal berkata, “Maksudnya adalah kembali berjima’ atau berniat untuknya, maka tidak halal baginya sampai ia membayar kaffarat ini.” Al Hasan Al Bashriy berkata, “Maksudnya (haram) menyetubuhi di farjinya.” Menurutnya, tidak mengapa jika seseorang bersenang-senang dengan istrinya namun tidak di farjinya sebelum ia membayar kaffarat. Namun menurut Az Zuhri, ia tidak boleh mencium dan menyentuhnya sebelum membayar kaffarat, wallahu a’lam. Yakni budak yang mukmin, laki-laki atau perempuan dengan syarat harus selamat dari cacat yang dapat merugikan kerjanya. Maksudnya, suami tidak boleh menjima’i istri yang dia zhihar sampai ia membayar kaffarat dengan memerdekakan seorang budak. Yakni itulah nasihat-Nya kepadamu; Dia menerangkan hukum dengan disertai targhib (dorongan) dan tarhib (ancaman). Lalu Dia akan memberikan balasan kepada setiap orang yang beramal."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mujadalah Ayat 3",
    "description": "Dan mereka yang menzihar istrinya, lalu menyesali perbuatannya, kemudian segera menarik kembali apa yang telah mereka ucapkan kepada istrinya itu, maka mereka para suami yang telah menzihar istrinya itu diwajibkan membayar kafarat, yakni tebusan dengan memerdekakan seorang budak sebelum suami istri itu bercampur kembali seperti sebelum menziharnya. Demikianlah yang diajarkan Allah kepadamu, kaum muslim tentang hukum zihar dan panduan membayar tebusannya, dan Allah mahateliti terhadap apa yang kamu kerjakan agar orang-orang beriman menyadari kemahatelitian Allah sehingga tidak berbuat curang dalam hidupnya. 4. Maka barang siapa yang tidak menemukan, tidak memiliki uang untuk memerdekakan hamba sahaya karena harganya mahal, maka dia wajib membayar kafarat zihar dengan berpuasa dua bulan berturut-turut sebelum keduanya bercampur kembali. Barang siapa tidak mampu, membayar kafarat zihar dengan berpuasa dua bulan berturut-turut, maka ia wajib membayar kafarat zihar dengan memberi makan enam puluh orang miskin. Demikianlah, Allah menjelaskan hukum zihar dan kafarat-Nya agar kamu beriman kepada Allah dan rasul-Nya dengan benar-benar berpegang kepada Al-Qur'an dan sunah-Nya dan itulah hukum-hukum Allah tentang zihar dan kafarat-kafaratnya; dan Allah memperingatkan bahwa bagi orang-orang yang mengingkarinya, yakni hukum zihar, akan mendapat azab yang sangat pedih di akhirat, karena mengatakan yang bukan-bukan, mengharamkan menggauli istri yang dihalalkan Allah."
  }
]