[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Barangsiapa tidak mendapatkan budak yang bisa dimerdekakan, wajib atasnya berpuasa dua bulan berturut-turut sebelum menggauli istrinya. Barangsiapa tidak sanggup berpuasa karena udzur syar’I, maka dia memberi makan 60 orang fakir miskin yang tidak memiliki kadar kecukupan dan tidak memiliki apa yang dapat memenuhi hajat mereka. Hukum-hukum zhihar yang Kami jelaskan kepada kalian ini bertujuan supaya kalian membenarkan Allah, mengikuti RasulNya, mengamalkan syariat Allah, dan meninggalkan apa yang kalian lakukan di zaman jahiliyah. Hukum-hukum tersebut adalah perintah-perintah Allah dan batasan-batasanNYa, maka janganlah kalian melanggarnya. Dan orang-orang yang mengingkarinya akan mendapat azab yang menyakitkan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Barangsiapa dari kalian yang tidak mendapatkan budak untuk dimerdekakan, maka dia wajib berpuasa selama dua bulan berturut-turut sebelum menggauli istri yang diziharnya. Dan barangsiapa tidak mampu berpuasa dua bulan berturut-turut maka ia wajib memberi makan enam puluh orang miskin. Hukum yang Kami putuskan itu agar kalian beriman bahwa Allah yang memerintahkannya, sehingga kalian menaati perintah-Nya, dan hukum-hukum yang Kami syariatkan atas kalian itu merupakan hukum-hukum Allah yang diputuskan-Nya untuk hamba-hamba-Nya, maka janganlah kalian melanggarnya. Dan bagi orang-orang kafir terhadap hukum-hukum dan batasan-batasan Allah yang telah diputuskan-Nya, ada siksa yang menyakitkan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. فَمَن لَّمْ يَجِدْ فَصِيَامُ شَهْرَيْنِ مُتَتَابِعَيْنِ مِن قَبْلِ أَن يَتَمَآسَّا ۖ (Barangsiapa yang tidak mendapatkan (budak), maka (wajib atasnya) berpuasa dua bulan berturut-turut sebelum keduanya bercampur) Yakni barangsiapa yang tidak memiliki budak dan tidak mempunyai harta untuk membelinya atau tidak mendapatkan budak yang dapat dibeli, maka ia harus berpuasa selama dua bulan berturut-turut, jika ia tidak berpuasa di antara dua bulan itu tanpa ada uzur maka ia harus mengulanginya dari awal, begitup pula jika ia menjima’ istrinya di siang atau malam hari maka ia harus mengulangi puasanya dari awal. فَمَن لَّمْ يَسْتَطِعْ(Maka siapa yang tidak kuasa) Yakni tidak mampu berpuasa dua bulan berturut-turut. فَإِطْعَامُ سِتِّينَ مِسْكِينًا ۚ(maka (wajib atasnya) memberi makan enam puluh orang miskin) Bagi setiap orang miskin tersebut setelah sha’ gandum, kurma, beras, atau lainnya. Boleh juga memberi makanan siap saji sampai mereka kenyang, atau memberi sesuatu yang dapat mengenyangkan mereka. ذٰلِكَ لِتُؤْمِنُوا۟ بِاللهِ وَرَسُولِهِۦ ۚ( Demikianlah supaya kamu beriman kepada Allah dan Rasul-Nya) Yakni Kami tetapkan hukum ini agar kalian mengimani bahwa Allah memerintahkan dan mensyariatkannya, sehingga kalian berjalan di atas syariatnya dan tidak melanggarnya serta tidak mengulangi zhihar yang merupakan ucapan yang mungkar dan dusta. وَتِلْكَ(Dan itulah) Yakni hukum-hukum tersebut. حُدُودُ اللهِ ۗ( hukum-hukum Allah) Maka janganlah kalian melanggar hukum-hukum yang telah ditetapkan bagi kalian, sebab Allah telah menjelaskan bahwa zhihar adalah suatu kemaksiatan dan kaffarat tersebut dapat mendatangkan ampunan-Nya. وَلِلْكٰفِرِينَ(dan bagi orang kafir) yang enggan menjalankan hukum-hukum Allah. عَذَابٌ أَلِيمٌ(siksaan yang sangat pedih) Yaitu azab neraka Jahannam."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Namun barang siapa yang tidak mendapati budak atau tidak juga harganya, maka dia harus mengganti dengan puasa dua bulan berturut-turut baru diperbolehkan saling bersentuhan suami dan istri. Barang siapa yang tidak mampu puasa karena sudah tua, atau sakit keras misalnya, maka dia harus memberi makan kepada 60 orang miskin. Menurut madzhab Hanafi, setiap orang miskin mendapatkan setengah sha’ beras atau gandum, atau kurma dan sebagaianya. Manurut madzhab Syafi’i, adalah satu mud (675 gram, adapun 1 sha’ = 2751 gram) makanan pokok daerah setempat. Aturan tersebut adalah untuk memberi keringanan, yaitu dengan berderma karena Allah dan rasul-Nya untuk menerima aturan syariat-Nya. Hukum itu adalah batasan Allah, yang tidak boleh dilanggar. Adapun bagi orang kafir yang tidak tahu terimakasih terhadap penetapan hukum itu akan mendapat azab dan siksa yang pedih pada hari kiamat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Siapa yang tidak mendapatkannya, maka berpuasa dua bulan berturut-turut sebelum keduanya berhubungan badan. Dan siapa saja yang tidak mampu, maka memberi makan enam puluh orang miskin. Demikianlah agar kalian beriman kepada Allah dan RasulNya. Itulah ketentuan-ketentuan Allah. Bagi orang-orang kafir itu azab yang pedih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4. “Barangsiapa yang tidak mendapatkan (budak),” yang akan dimerdekakan karena memang tidak punya atau tidak memiliki harta seharga seorang budak, “maka (wajib atasnya) berpuasa dua bulan berturut-turut sebelum keduanya bercampur. Maka siapa yang tidak kuasa,” untuk berpuasa, “(wajiblah atasnya) memberi makan enam puluh orang miskin.” Dengan cara memberikan makanan mereka sesuai makanan lazim secukupnya sebagaimana yang dikatakan oleh kebanyakan ahli tafsir atau dengan memberikan makanan kepada masing-masing orang miskin sebanyak satu mud gandum (mud adalah seukuran dua tangan orang dewasa) atau setengah sha’ untuk selain gandum yang cukup untuk dimakan sebagaimana dikemukakan oleh pendapat lain. “Demikianlah,” hukum yang Kami jelaskan, “supaya kamu beriman kepada Allah dan RasulNya.” Dengan berpegang teguh pada hukum ini dan hukum-hukum lain serta mengamalkannya karena berpegang teguh pada hukum Allah, dan menunaikan termasuk dari keimanan bahkan itulah yang dimaksudkan dari beriman. Dengan menunaikan hukum-hukum Allah, keimanan akan semakin sempurna dan bertambah. “Dan itulah batas-batas hukum Allah,” yang mencegah kalian agar tidak terjatuh padanya. Wajib untuk tidak dilanggar dan dilaksanakan secara seenaknya. “Dan bagi orang kafir ada siksaan yang sangat pedih.” Dalam ayat ini terkandung berbagai hukum-hukum: Pertama: kelembutan dan perhatian Allah terhadap para hambaNya yang mengisahkan pengaduan wanita yang tertimpa musibah tersebut kemudian Allah menghilangkan beban dan musibah yang menimpanya. Lebih dari itu, Allah menghilangkan beban semua orang yang tertimpa kasus serupa berdasarkan hikmahNya yang menyeluruh. Kedua, zhihar khusus untuk pengharaman istri karena Allah berfirman, “Istri-istri mereka,” dan untuk itu hukum ini tidak berlaku jika seseorang menzhihar budak wanitanya, pengharaman terhadap budak wanita tidak disebut zhihar namun hanya pengharaman terhadap hal-hal yang baik seperti halnya makanan dan minuman. Wajib menebus kaffarat sumpah saja. Ketiga, zhihar yang dilakukan terhadap wanita yang belum dinikahi tidaklah sah karena wanita yang dizhihar tersebut belum termasuk istrinya pada saat dizhihar, sebagaimana mentalak wanita yang belum dinikahi juga tidak sah, baik apakah hal itu sudah dilakukan (tanpa syarat) ataupun dengan syarat. Keempat, zhihar hukumnya haram, karena Allah menyebutnya, “Suatu perkataan yang mungkar dan dusta.” Kelima, peringatan Allah atas hukum dan hikmahNya, karena Allah berfirman, “Padahal tiadalah istri mereka itu ibu-ibu mereka.” Keenam, seorang suami dilarang memanggil istrinya dengan panggilan yang diharamkan seperti “Hai ibuku,” “Hai saudariku,” dan lainnya, karena panggilan-panggilan seperti itu menyerupai panggilan pada wanita mahram (haram dinikahi). Ketujuh, kaffarat zhihar wajib dibayar ketika suami menarik kembali ucapan zhiharnya, berdasarkan perbedaan kedua pendapat sebelumnya, dan bukan sekedar karena ucapan zhihar. Kedelapan, pembayaran kaffarat zhihar bisa berupa budak kecil atau dewasa, lelaki atau perempuan; karena ayat menyebutkannya secara mutlak. Kesembilan, kaffarat wajib ditunaikan baik memerdekakan budak atau dengan berpuasa sebelum suami mencampuri istri sebagaimana yang ditentukan oleh Allah, tidak seperti kaffarat yang berupa memberi makanan, suami boleh mencampuri istrinya pada saat pemberian makanan dilakukan. Kesepuluh, sepertinya hikmah wajibnya menunaikan kaffarat sebelum mencampuru istri supaya kaffarat tersebut ditunaikan. Karena seorang suami yang ingin mencampuri istrinya dan ia mengetahui hal itu tidak mungkin kecuali setelah menunaikan kaffarat, ia akan segera membayar kaffarat. Kesebelas, harus memberi makan enam puluh orang miskin, tidak boleh menyatukan jatah makanan enam puluh orang miskin kemudian dibayarkan pada satu orang miskin saja atau lebih dari itu yang kurang dari enam puluh, karena Allah berfirman “Memberi makan enam puluh orang miskin.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mujadalah ayat 4: Allah mengabarkan barangsiapa yang tidak mampu berpuasa dua bulan dan tidak mampu mengerjakannya karena sebab udzur syar’i, maka kafarah dari dziharnya adalah memberikan makan enam puluh orang miskin dari hasil pangan yang dihasilkan oleh negaranya yang mengenyangkan, dan itupun sebelum ia menjima’ istrinya. Ketahuilah, bahwa hukum ini Allah tetapkan agar supaya kalian beriman kepada Allah dan Rasul-Nya ﷺ. Taatilah apa yang Allah perintahkan, dan jauhilah apa yang Allah larang. Ketahuilah juga bahwa hukum-hukum ini (yang Allah sebutkan) memiliki batasan (ketetapan) yang tidak diperbolehkan seorangpun menyelisihinya. Dan bagi orang-orang-orang kafir terdapat adzab yang pedih, yang menyakitkan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Seperti tidak menemukan budak atau tidak memiliki biaya untuk memerdekakan budak. Bisa dengan memberi mereka makan dari makanan pokok daerahnya yang cukup bagi mereka, bisa juga dengan memberikan setiap seorang miskin satu mud gandum atau setengah sha’ dari selain gandum dari makanan pokok sesuai daerah itu. Yakni hukum yang diterangkan-Nya kepada kamu. Yaitu dengan memegang teguh hukum tersebut dan hukum-hukum lainnya dan mengamalkannya, karena berpegang dengan hukum-hukum Allah dan mengamalkannya termasuk bagian dari iman, bahkan yang demikian adalah maksudnya dan menambah keimanan, mengembangkannya dan menyempurnakannya. Yakni batasan-batasan Allah untuk mencegah agar seseorang tidak terjatuh ke dalamnya, sehingga tidak boleh dilampaui dan diremehkan. Syaikh As Sa’diy menerangkan, bahwa dalam ayat ini terdapat sejumlah hukum, di antaranya –kami sebutkan secara ringkas-: - Kelembutan Allah Subhaanahu wa Ta'aala kepada hamba-hamba-Nya dan perhatian-Nya kepada mereka, dimana Dia menyebutkan keluhan perempuan itu, lalu diangkat-Nya dan dihilangkan-Nya, bahkan Dia singkirkan pula dengan hukum-Nya yang umum setiap orang yang tertimpa masalah atau musibah seperti ini. - Zhihar hanya khusus kepada istri. Oleh karena itu, jika seorang menzhihar budaknya, maka itu bukanlah zhihar, bahkan tergolong ke dalam mengharamkan makanan dan minuman yang mubah yang cukup dengan kaffarat sumpah saja. - Zhihar tidaklah sah terhadap wanita yang belum dinikahinya karena waktu menzhiharnya wanita itu belum menjadi istrinya, sebagaimana tidak sah juga menalak wanita yang belum menjadi istrinya. - Zhihar hukumnya haram, karena Allah menamainya sebagai sebuah kemungkaran dan dusta. - Allah Subhaanahu wa Ta'aala dalam ayat tersebut mengingatkan sisi (sebab) hukumnya dan hikmah-Nya. - Dimakruhkan seorang suami memanggil istrinya dan menyebutnya dengan nama salah seorang dari mahramnya, seperti memanggil istrinya, “Umi” (artinya: ibuku), “Ukhti” (Saudariku) dsb. Karena hal itu mirip dengan mahramnya. - Kaffarat hanyalah wajib karena ‘aud (menarik kembali) ucapan yang diucapkan penzhihar sesuai khilaf tentang maksud ‘aud’ yang sudah disebutkan sebelumnya, bukan semata-mata karena zhihar. - Kaffarat wajib dibayarkan jika berupa memerdekakan budak atau berpuasa sebelum berjima’ sebagaimana yang telah Allah batasi dengannya, berbeda dengan kaffarat yang berupa memberi makan, maka boleh menjima’i istri di tengah-tengah memberi makan tersebut. - Mungkin hikmah wajibnya kaffarat sebelum jima’, karena yang demikian dapat mendorong untuk segera membayarkannya, karena ketika ia ingin menjima’i istrinya, maka ia sadar bahwa ia tidak mungkin melakukannya kecuali setelah membayar kaffarat, maka ia pun segera mengeluarkannya atau membayarnya. - Dalam memberi makan harus enam puluh orang miskin. Oleh karena itu, jika dikumpulkan makanan untuk 60 orang miskin, tetapi malah diberikan satu, dua atau tiga orang miskin, maka hal itu tidak sah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mujadalah Ayat 4",
    "description": "Maka barang siapa yang tidak menemukan, tidak memiliki uang untuk memerdekakan hamba sahaya karena harganya mahal, maka dia wajib membayar kafarat zihar dengan berpuasa dua bulan berturut-turut sebelum keduanya bercampur kembali. Barang siapa tidak mampu, membayar kafarat zihar dengan berpuasa dua bulan berturut-turut, maka ia wajib membayar kafarat zihar dengan memberi makan enam puluh orang miskin. Demikianlah, Allah menjelaskan hukum zihar dan kafarat-Nya agar kamu beriman kepada Allah dan rasul-Nya dengan benar-benar berpegang kepada Al-Qur'an dan sunah-Nya dan itulah hukum-hukum Allah tentang zihar dan kafarat-kafaratnya; dan Allah memperingatkan bahwa bagi orang-orang yang mengingkarinya, yakni hukum zihar, akan mendapat azab yang sangat pedih di akhirat, karena mengatakan yang bukan-bukan, mengharamkan menggauli istri yang dihalalkan Allah. 5. Pada ayat di atas Allah menerangkan hukum zihar dan kafarat-kafaratnya. Pada ayat ini dijelaskan bahwa orang yang menentang hukum Allah dan rasul-Nya akan mendapat kehinaan dunia akhirat. Sesungguhnya orang-orang yang menentang Allah dan rasul-Nya dengan menolak dan mengingkari ajaran yang disampaikan rasulullah pasti mendapat kehinaan sebagaimana kehinaan yang telah didapat oleh orang-orang sebelum mereka seperti kaum yahudi yang durhaka kepada nabi musa yang diubah menjadi kera. Dan sungguh, kami telah menurunkan bukti-bukti yang nyata tentang kebenaran agama Allah dan hukum-hukum-Nya dengan mengutus para nabi dan rasul. Dan bagi orang-orang yang mengingkarinya dengan kufur dan merintangi pelaksanaannya akan mendapat azab yang menghinakan di dunia dan di akhirat."
  }
]