[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang yang menentang Allah dan RasulNya, serta menyelisihi perintah keduanya, pasti dicampakkan dan diabaikan sebagaimana dicampakannya orang-orang sebelum mereka dari umat-umat yang menentang Allah dan para RasulNya. Kami telah menurunkan ayat-ayat Kami yang hujjahnya jelas yang menunjukkan bahwa syariat Allah dan batasan-batasanNya adalah haq. Dan orang-orang yang mengingkari ayat-ayat tersebut akan mendapat azab yang menghinakan di Neraka Jahanam."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Sesungguhnya orang-orang yang menentang Allah dan Rasul-Nya akan dihinakan dan direndahkan sebagaimana orang-orang yang menentang-Nya dari umat-umat yang terdahulu juga dihinakan dan direndahkan. Dan Kami telah menurunkan bukti-bukti yang nyata, dan bagi orang-orang yang kafir terhadap Allah, Rasul-Nya dan ayat-ayat-Nya siksa yang menghinakan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "5-6. Orang-orang yang menentang perintah Allah dan rasul-Nya akan terhina, sebagaimana terhinanya umat-umat sebelum mereka yang menentang hukum-hukum Allah. Kami telah menurunkan ayat-ayat yang dijelaskan dengan terperinci, agar dapat dijalankan. Dan orang-orang yang mendustakan hukum-hukum itu akan mendapat azab yang menghinakan di neraka Jahannam. Pada hari kiamat, Allah akan menghidupkan kembali semua orang yang telah mati dan mengumpulkan mereka, kemudian Allah akan mengabarkan kepada mereka tentang apa yang telah mereka perbuat yang telah Allah hitung dan catat dalam lauhul mahfuzh, padahal mereka telah melupakan Allah dan segala dosa yang mereka perbuat. Allah Maha Melihat segalanya, tidak ada yang tersembunyi dari-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. إِنَّ الَّذِينَ يُحَآدُّونَ اللهَ وَرَسُولَهُۥ (Sesungguhnya orang-orang yang yang menentang Allah dan Rasul-Nya) Yakni yang menentang dan menyelisihi. كُبِتُوا۟ كَمَا كُبِتَ الَّذِينَ مِن قَبْلِهِمْ ۚ( pasti mendapat kehinaan sebagaimana orang-orang yang sebelum mereka telah mendapat kehinaan) Yakni akan dihinakan dan direndahkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Sesungguhnya orang-orang yang menentang Allah dan rasul-Nya dengan menentang, mengabaikan dan merendahkan perintah-Nya. Seperti orang-orang sebelum mereka yang mendustakan dan yang merendahkan hukum Allah. Sedangkan Allah terah menurunkan bukti yang sangat jelas, dan bagi orang-orang kafir adalah azab yang menghinakan dan merendahkan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang yang menentang} menentang {Allah dan RasulNya dihinakan} dihinakan dan dipermalukan {sebagaimana telah dihinakan} dihinakan dan dipermalukan {orang-orang sebelum mereka. Sungguh Kami telah menurunkan bukti-bukti nyata. Bagi orang-orang kafir itu azab yang menghinakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5. Menentang Allah dan RasulNya adalah dengan menyelisihi dan bermaksiat terhadap keduanya, khususnya dalam masalah-masalah yang amat buruk seperti menentang Allah dan RasulNya dengan kekufuran serta memusuhi para kekasih Allah. Firman Allah “Sesungguhnya orangt-orang yang menentang Allah dan RasulNya pasti mendapat kehinaan sebagaimana orang-orang yang sebelum mereka telah mendapat kehinaan.” Maksudnya, mereka dilecehkan dan dihinakan sebagaimana yang pernah dilakukan terhadap orang-orang sebelum mereka sebagai balasan serupa, mereka tidak memiliki hujjah yang nyata kepada manusia. Allah telah menurunkan ayat-ayat yang jelas serta bukti-bukti nyata sebagaimana menjelaskan kebenaran dan tujuan-tujuan. Siapa pun yang mengikuti dan mengajarkannya, maka dialah orang yang mendapatkan petunjuk lagi beruntung, sedangkan “bagi orang-orang kafir,” terhadap ayat-ayat Allah “ada siksa yang menghinakan.” Maksudnya, menghina dan merendahkan mereka. Karena mereka bersikap sombong terhadap ayat-ayat Allah, maka Allah pun menghinakan dan merendahkan mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mujadalah ayat 5: Ketahuilah wahai manusia, siapa yang marah kepada Allah dan Rasul-Nya kemudian menyelisihi perintah keduanya, akan diberikan kehinaan dan keburukan sebagaimana ditimpakan kepada umat-umat yang terdahulu karena sebab kekafiran dan keras kepalanya terhadap Rasul-Rasul yang diutus sebelum mereka. Sungguh telah diturunkan kepada kalian bukti yang jelas dan hujjah, dan bagi orang yang kafir yang mereka kufur kepada Allah dan Rasul-Nya serta menolak bukti itu, akan mendapatka adzab yang hina, yang menyakitkan, sebagai balasan atas kesombongan dan kekafiran mereka. Inilah keadaan orang yang ingkar kepada wali-wali Allah. Dan tempat kemabli mereka, sebagaimana keburukan yang mereka lakukan kepada Allah dan Rasul-Nya ﷺ; Allah menimpakan, menghinakan dan merendahkannya. Karena Rasul-Nya adalah orang yang membawa risalah yang datang dari Rabb mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Menentang Allah dan Rasul-Nya adalah menyelisihi dan mendurhakai keduanya, kafir kepada keduanya dan memusuhi para wali Allah. Yang menentang para rasul mereka. Mereka sama sekali tidak memiliki hujjah di hadapan Allah, karena Allah Ta’ala telah menegakkan hujjah-Nya kepada makhluk-Nya, Dia telah menurunkan bukti-bukti yang nyata yang menerangkan hakikat dan menerangkan maksud, barang siapa yang mengikutinya dan mengamalkannya, maka dia tergolong orang-orang yang mendapat petunjuk dan beruntung. Yang menunjukkan kebenaran Rasulullah shallallahu 'alaihi wa sallam. Yaitu bukti-bukti yang nyata itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mujadalah Ayat 5",
    "description": "Pada ayat di atas Allah menerangkan hukum zihar dan kafarat-kafaratnya. Pada ayat ini dijelaskan bahwa orang yang menentang hukum Allah dan rasul-Nya akan mendapat kehinaan dunia akhirat. Sesungguhnya orang-orang yang menentang Allah dan rasul-Nya dengan menolak dan mengingkari ajaran yang disampaikan rasulullah pasti mendapat kehinaan sebagaimana kehinaan yang telah didapat oleh orang-orang sebelum mereka seperti kaum yahudi yang durhaka kepada nabi musa yang diubah menjadi kera. Dan sungguh, kami telah menurunkan bukti-bukti yang nyata tentang kebenaran agama Allah dan hukum-hukum-Nya dengan mengutus para nabi dan rasul. Dan bagi orang-orang yang mengingkarinya dengan kufur dan merintangi pelaksanaannya akan mendapat azab yang menghinakan di dunia dan di akhirat. 6. Kehinaan bagi yang mengingkari hukum Allah yang disebutkan pada ayat di atas akan diberikan pada hari kiamat, yaitu: pada hari itu mereka semuanya dibangkitkan Allah menuju padang mahsyar, tempat berkumpul manusia sejak nabi adam hingga manusia terakhir, lalu diberitakan kepada mereka semua apa yang telah mereka kerjakan dengan lengkap, menyeluruh, dan terinci; Allah menghitungnya dengan akurat semua amal perbuatan mereka itu, meskipun mereka telah melupakannya karena sudah berlangsung lama, tetapi Allah mengetahuinya, ada catatan dua malaikat, ada dokumentasi pada diri manusia (lihat: surah al-isr'/17: 13'14) dan ada kesaksian kedua tangan dan kaki (lihat: surah y's'n/36: 65). Dan Allah maha menyaksikan segala sesuatu yang dilakukan manusia."
  }
]