[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ingatlah (wahai Rasul) akan Hari Kiamat, yaitu hari yang Allah menghidupkan semua orang-orang mati. Allah mengumpulkan orang-orang terdahulu dan orang-orang kemudian di satu tanah lapang, lalu Allah akan mengabarkan kepada mereka tentang apa yang mereka lakukan, baik atau buruk. Allah menghitungnya dan menulisnya dalam Lauhul Mahfuzh, menjaganya bagi mereka pada lembaran-lembaran amal mereka sementara mereka telah melupakannya. Allah Maha Menyaksikan segala sesuatu, tidak ada yang samar bagiNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Pada hari di mana Allah membangkitkan mereka semua, tidak meninggalkan seorang pun dari mereka lalu memberitahukan kepada mereka perbuatan-perbuatan buruk yang pernah mereka lakukan di dunia, Allah mencatatnya untuk mereka, tidak ada yang terlewatkan dari amal perbuatan mereka, padahal mereka telah melupakannya, lalu mereka mendapatinya tertulis di dalam lembaran-lembaran mereka yang tidak meninggalkan perbuatan kecil maupun besar melainkan lembaran-lembaran itu mencatatnya. Dan Allah Maha Menyaksikan segala sesuatu, tidak ada sedikit pun dari amal perbuatan mereka yang luput dariNya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. يَوْمَ يَبْعَثُهُمُ اللهُ جَمِيعًا (Pada hari ketika mereka dibangkitkan Allah semuanya) Yakni mereka semua akan dibangkitkan, tidak akan ada seorangpun yang tertinggal. فَيُنَبِّئُهُم بِمَا عَمِلُوٓا۟ ۚ( lalu diberitakan-Nya kepada mereka apa yang telah mereka kerjakan) Yakni amal buruk yang mereka kerjakan di dunia, pemberitaan ini sebagai penyempurna hujjah atas mereka. أَحْصَىٰهُ اللهُ(Allah mengumpulkan (mencatat) amal perbuatan itu) Allah menghitungnya semua tanpa melalaikan sedikitpun dari amal perbuatan itu. وَنَسُوهُ ۚ( padahal mereka telah melupakannya) Yakni tidak mengingatnya. Ternyata mereka mendapatinya tertulis dalam catatan amal mereka. وَاللهُ عَلَىٰ كُلِّ شَىْءٍ شَهِيدٌ (Dan Allah Maha Menyaksikan segala sesuatu) Yakni Maha Melihat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Pada hari dimana Allah membangkitkan manusia dari kubur mereka, kemudian mereka akan ditunjukkan segala perbuatannya di dunia. Allah mencatat segala perbuatan mereka, namun mereka lupa terhadap perbuatan mereka sendiri sebab terlalu banyak perbuatan buruk mereka. Allah Maha Mengungkapkan segala sesuatu, tidak akan ada yang bisa luput dari pengwasan-Nya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Pada hari itu Allah membangkitkan mereka semua, lalu Dia memberitakan kepada mereka apa yang telah mereka kerjakan. Allah menghitungnya} Allah mencatatnya dalam lembaran-lembaran amal mereka {meskipun mereka telah melupakannya. Allah Maha Menyaksikan segala sesuatu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6. Allah berfirman, “Pada hari ketika mereka semuanya dibangkitkan Allah,” yakni seluruh makhluk, mereka akan bangkit dari kubur dengan cepat, kemudian mereka pun diberi balasan atas amal yang mereka kerjakan. Allah akan memberitahukan semua amal mereka, baik dan buruknya, karena Allah telah mengetahui hal itu dan telah mencatatnya di Lauhil Mahfuzh, dan Allah memerintahkan para malaikat yang mulia untuk mencatatnya. Padahal manusia yang mengerjakan amalan-amalan itu telah melupakannya dan tidak mengetahui bahwa Allah mencatatnya. “Dan Allah Maha Menyaksikan segala sesuatu.” Segala sesuatu yang nampak, yang menjadi rahasia, dan hal-hal yang samar."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mujadalah ayat 6: Ketahuilah wahai manusia, siapa yang marah kepada Allah dan Rasul-Nya kemudian menyelisihi perintah keduanya, akan diberikan kehinaan dan keburukan sebagaimana ditimpakan kepada umat-umat yang terdahulu karena sebab kekafiran dan keras kepalanya terhadap Rasul-Rasul yang diutus sebelum mereka. Sungguh telah diturunkan kepada kalian bukti yang jelas dan hujjah, dan bagi orang yang kafir yang mereka kufur kepada Allah dan Rasul-Nya serta menolak bukti itu, akan mendapatka adzab yang hina, yang menyakitkan, sebagai balasan atas kesombongan dan kekafiran mereka. Inilah keadaan orang yang ingkar kepada wali-wali Allah. Dan tempat kemabli mereka, sebagaimana keburukan yang mereka lakukan kepada Allah dan Rasul-Nya ﷺ; Allah menimpakan, menghinakan dan merendahkannya. Karena Rasul-Nya adalah orang yang membawa risalah yang datang dari Rabb mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Lalu mereka bangun dari kubur dengan segera. Baik atau buruk. Hal itu, karena Dia mengetahuinya dan mencatatnya dalam Lauh Mahfuzh dan memerintahkan para malaikat yang mulia (kiraam kaatibuun) untuk mencatatnya. Baik yang tampak maupun yang tersembunyi. Oleh karena itu pada ayat selanjutnya, Allah Subhaanahu wa Ta'aala memberitahukan tentang luasnya ilmu-Nya dan Dia meliput segala yang ada di langit dan di bumi yang besar maupun yang kecil."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mujadalah Ayat 6",
    "description": "Kehinaan bagi yang mengingkari hukum Allah yang disebutkan pada ayat di atas akan diberikan pada hari kiamat, yaitu: pada hari itu mereka semuanya dibangkitkan Allah menuju padang mahsyar, tempat berkumpul manusia sejak nabi adam hingga manusia terakhir, lalu diberitakan kepada mereka semua apa yang telah mereka kerjakan dengan lengkap, menyeluruh, dan terinci; Allah menghitungnya dengan akurat semua amal perbuatan mereka itu, meskipun mereka telah melupakannya karena sudah berlangsung lama, tetapi Allah mengetahuinya, ada catatan dua malaikat, ada dokumentasi pada diri manusia (lihat: surah al-isr'/17: 13'14) dan ada kesaksian kedua tangan dan kaki (lihat: surah y's'n/36: 65). Dan Allah maha menyaksikan segala sesuatu yang dilakukan manusia. 7. Selain menyaksikan segala sesuatu, Allah juga mengetahui semua pembicaraan rahasia. Tidakkah engkau perhatikan, bahwa Allah mengetahui apa yang ada di langit dan apa yang ada di bumi, karena penglihatan Allah menembus batas-batas ruang dan waktu' oleh sebab itu, bagi Allah, tidak ada pembicaraan rahasia antara tiga orang, melainkan dialah yang keempatnya, karena Allah ada, hadir dan terlibat dalam keseharian hamba-hamba-Nya. Dan tidak ada lima orang yang terlibat dalam pembicaraan rahasia, melainkan dialah yang keenamnya, karena Allah dekat dan terlibat dalam aktivitas manusia. Dan tidak ada yang kurang dari itu atau lebih banyak yang terlibat dalam pembicaraan rahasia, melainkan dia, pasti ada bersama mereka di mana pun mereka berada, meskipun manusia sering tidak merasakan kehadiran Allah bersama mereka, karena kalbunya yang terhijab. Kemudian dia akan memberitakan kepada mereka pada hari kiamat apa yang telah mereka kerjakan dengan menghadirkan catatan yang merekam seluruh jejak hidupnya. Sesungguhnya Allah maha mengetahui segala sesuatu yang dilakukan manusia termasuk pembicaraan rahasia di antara mereka."
  }
]