[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah kamu tidak mengetahui bahwa Allah mengetahui segala sesuatu di langit dan di bumi? Tidak ada tiga orang dari makhluk Allah yang berbisik-bisik di antara mereka tentang sebuah rahasia kecuali Allah bersama mereka dengan ilmu dan pengetahuanNYa, tidak juga lima orang kecuali Allah yang keenam, tidak lebih sedikit, tidak lebih banyak dari angka-angka tersebut kecuali Allah bersama mereka dengan ilmuNya, di tempat manapun mereka berada, tidak ada sesuatu pun dari urusan mereka yang samar bagiNya. Kemudian Allah mengabari mereka pada Hari Kiamat tentang apa yang mereka lakukan berupa kebaikan atau keburukan dan membalas mereka atasnya. Sesungguhnya Allah Maha Mengetahui segala sesuatu, tidak ada sesuatu pun yang samar bagiNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Tidakkah engkau melihat -wahai Rasul- bahwa Allah mengetahui apa yang ada di langit dan apa yang ada di bumi, tidak ada sesuatu pun dari keduanya yang luput dari-Nya. Tiada pembicaraan rahasia antara tiga orang melainkan Dia -Subḥānahu- yang keempat dengan ilmuNya, dan tiada pembicaraan antara lima orang melainkan Dia -Subḥānahu- yang keenam dengan ilmu-Nya, dan tiada pula pembicaraan antara orang yang berjumlah lebih sedikit dari itu atau lebih banyak melainkan Allah bersama mereka dengan ilmu-Nya di mana saja mereka berada, tidak ada sedikitpun dari pembicaraan mereka yang luput darinya, kemudian Allah memberitahukan kepada mereka pada hari Kiamat apa yang mereka kerjakan. Sesungguhnya Allah Maha Mengetahui segala sesuatu, tidak ada sesuatu pun yang luput dari-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "7. Hai para hamba, tidakkah kalian mengetahui bahwa Allah Maha Melihat segala yang ada di tujuh langit dan bumi? Tidaklah ada perbincangan antara tiga orang melainkan Allah adalah yang keempat dari mereka dengan ilmu-Nya, dan tidaklah ada perbincangan antara lima orang melainkan Allah adalah yang keenam dari mereka, serta tidak ada perbincangan antara orang yang lebih banyak atau lebih sedikit dari itu melainkan Allah menyertai mereka dengan ilmu-Nya, di manapun mereka berada. Kemudian pada hari kiamat Allah akan mengabarkan kepada mereka tentang segala yang telah mereka perbuat di dunia. Allah Maha Mengetahui segalanya, tidak ada yang tersembunyi dari-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. أَلَمْ تَرَ أَنَّ اللهَ يَعْلَمُ مَا فِى السَّمٰوٰتِ وَمَا فِى الْأَرْضِ ۖ (Tidakkah kamu perhatikan, bahwa sesungguhnya Allah mengetahui apa yang ada di langit dan di bumi?) Yakni ilmu-Nya meliputi apa yang ada di langit dan bumi. Tidak ada sedikitpun yang tersembunyi dari-Nya. مَا يَكُونُ مِن نَّجْوَىٰ ثَلٰثَةٍ(Tiada pembicaraan rahasia antara tiga orang) Yakni tidak ada tiga orang yang saling berbisik. إِلَّا هُوَ رَابِعُهُمْ(melainkan Dialah keempatnya) Yakni Dia ikut mendengar bisikan itu. وَلَا خَمْسَةٍ إِلَّا هُوَ سَادِسُهُمْ (Dan tiada (pembicaraan antara) lima orang, melainkan Dialah keenamnya) Sebab Allah menyertai siapapun dengan jumlah berapapun, baik itu banyak maupun sedikit; Dia mengetahui yang dirahasiakan maupun yang dinampakkan, tidak ada yang tersembunyi bagi-Nya. وَلَآ أَدْنَىٰ مِن ذٰلِكَ وَلَآ أَكْثَرَ(Dan tiada (pula) pembicaraan antara jumlah yang kurang dari itu atau lebih banyak) Yakni dan tidak ada yang lebih sedikit dari itu, seperti satu atau dua orang; atau yang lebih banyak dari itu, seperti enam atau tujuh orang. إِلَّا هُوَ مَعَهُمْ(melainkan Dia berada bersama mereka) Allah mengetahui apa yang mereka bicarakan, sebab tidak ada sesuatu yang tersembunyi dari-Nya. أَيْنَ مَا كَانُوا۟ ۖ( di manapun mereka berada) Yakni di tempat manapun. ثُمَّ يُنَبِّئُهُم(Kemudian Dia akan memberitahukan kepada mereka) Yakni mengabarkan kepada mereka. بِمَا عَمِلُوا۟ يَوْمَ الْقِيٰمَةِ ۚ( pada hari kiamat apa yang telah mereka kerjakan) Yakni agar mereka mengetahui bahwa pembicaraan mereka itu tidaklah tersembunyi, dan agar orang yang mereka bicarakan dengan pembicaraan yang buruk dapat mengetahuinya sehingga menjadi olokan dan penjelekan bagi mereka serta menjadi hujjah atas mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Apakah engkau tidak tahu wahai Nabi, bahwa Allah Maha Tahu apa yang ada di langit dan bumi. Tidak ada yang samar bagi Allah. Tidak ada 3 orang yang berbisik atau berjalan kecuali Allah menjadi yang ke-4, dan tidak ada orang 5 kecuali Allah menjadi yang ke-6 dan juga bilangan paling sedikit atau paling banyak sekalipun. Tidak ada seseorang yang sendiri kecuali Allah menjadi yang ke-2. Allah Maha Tahu atas segala yang mereka katakan dan segala apapun yang terjadi padanya. Allah Maha Tahu dimanapun mereka berada, sifat Kemahatahuan Allah meliputi segala sesuatu. Allah tidak terbatas pada tempat. Pada hari kiamat Allah akan membuka segala amal mereka sejelas-jelasnya untuk menghinakan mereka. Itu sebagai bukti dari hujjah yang ada, dan penetapan atas balasan yang telah dijanjikan pada hari mereka. Sesungguhnya Allah Maha Tahu atas segala sesuatu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah kamu tidak memperhatikan bahwa Allah mengetahui apa yang ada di langit dan yang ada di bumi. Tidak ada pembicaraan rahasia antara tiga orang} percakapan tiga orang yang tersembunyi {kecuali Dialah yang keempatnya dan tidak ada lima orang, kecuali Dialah yang keenamnya. Tidak kurang dari itu atau lebih banyak, kecuali Dia bersama mereka di mana pun mereka berada. Kemudian Dia memberitakan kepada mereka apa yang telah mereka kerjakan pada hari Kiamat. Sesungguhnya Allah Maha Mengetahui segala sesuatu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7. Karena itulah Allah memberitahukan luasnya pengetahuan dan penglihatanNya atas segala yang ada di langit dan di bumi, besar dan kecilnya. Dan sesungguhnya Allah “tiada pembicaraan rahasia antara tiga orang, melainkan Dia-lah yang keempatnya. Dan tiada (pembicaraan antara) lima orang, melainkan Dia-lah yang keenamnya. Dan tidak (pula) pembicaraan antara (jumlah) yang kurang dari itu atau lebih banyak, melainkan Dia ada bersama mereka dimanapun mereka berada.” Yang dimaksud dengan Allah bersama mereka dalam ayat ini adalah kebersamaan ilmu dan pengetahuan terhadap hal-hal yang diperbincangkan secara diam-diam oleh manusia, karena itu Allah berfirman, “Sesungguhnya Allah Maha Mengetahui segala sesuatu.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mujadalah ayat 7: Tidakkah engkau mengetahui wahai hamba Allah, bahwasanya Allah mengetahui apa yang ada di langit dan bumi. Ini adalah penegasan dari Allah dengan cakupan ilmu-Nya atas segala sesuatunya. Kemudian Allah mengabarkan bahwa tidaklah saling berbisik di antara tiga orang kecuali Allah bersama mereka, Allah mengetahui apa yang mereka katakan dan sembunyikan, tidaklah lima orang berbisik kecuali Allah yang ke-enamnya. Ia mengetahui apa yang mereka bisikkan. Tidaklah sedikit maupun banyak dari jumlah yang telah disebutkan ini kecuali Allah Maha Mengetahuinya di mana pun mereka berada; Meskipun mereka menyembunyikannya dan takut menampakkan, karena mereka semua dibawah pengawasan-Nya dan pendengaran-Nya. Kemudian Allah mengabarkan kondisi mereka pada hari kiamat atas apa yang mereka amalkan dari kebaikan maupun keburukan. Kejelekkan maupun keburukan atau kemuliaan jika amalannya baik. Dan manusia tidak akan mendapati tempat untuk lari kecuali dia harus menghadap kepada Allah. Kemudian Allah akan balas kebaikan kepada mereka jika mereka beramal kebaikan, dan jika beramal keburukan maka dibalas dengan keburukan. Sungguh Allah atas segala sesuatunya Maha Mengetahui, tidak tersembunyi bagi-Nya segala makhluk pun."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ma’iyyah (kebersamaan) Allah Subhaanahu wa Ta'aala di sini adalah ma’iyyah ilmu(pengetahuan)-Nya dan meliputnya Dia terhadap apa yang mereka bisikkan dan apa yang mereka sembunyikan di antara mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mujadalah Ayat 7",
    "description": "Selain menyaksikan segala sesuatu, Allah juga mengetahui semua pembicaraan rahasia. Tidakkah engkau perhatikan, bahwa Allah mengetahui apa yang ada di langit dan apa yang ada di bumi, karena penglihatan Allah menembus batas-batas ruang dan waktu' oleh sebab itu, bagi Allah, tidak ada pembicaraan rahasia antara tiga orang, melainkan dialah yang keempatnya, karena Allah ada, hadir dan terlibat dalam keseharian hamba-hamba-Nya. Dan tidak ada lima orang yang terlibat dalam pembicaraan rahasia, melainkan dialah yang keenamnya, karena Allah dekat dan terlibat dalam aktivitas manusia. Dan tidak ada yang kurang dari itu atau lebih banyak yang terlibat dalam pembicaraan rahasia, melainkan dia, pasti ada bersama mereka di mana pun mereka berada, meskipun manusia sering tidak merasakan kehadiran Allah bersama mereka, karena kalbunya yang terhijab. Kemudian dia akan memberitakan kepada mereka pada hari kiamat apa yang telah mereka kerjakan dengan menghadirkan catatan yang merekam seluruh jejak hidupnya. Sesungguhnya Allah maha mengetahui segala sesuatu yang dilakukan manusia termasuk pembicaraan rahasia di antara mereka. 8. Pada ayat yang lalu disebutkan bahwa tidak satu pun yang tersembunyi bagi Allah, dari bisikan sampai yang diucapkan dengan terang-terangan. Pada ayat ini dijelaskan perjanjian rahasia yang dilakukan orang-orang yahudi di madinah untuk menghancurkan islam, karena mereka tidak menyadari bahwa Allah mengetahui rahasia jahat mereka. Tidakkah engkau, Muhammad, memperhatikan orang-orang, yakni kaum yahudi di madinah, yang telah dilarang mengadakan pembicaraan rahasia untuk memusuhi islam, mencelakakan, dan berusaha membunuh rasulullah, karena mereka telah mengikat perjanjian damai dengan kaum muslim dalam piagam madinah; kemudian mereka kembali mengerjakan larangan itu dengan mengabaikan kesepakatan damai tersebut; dan mereka mengadakan pembicaraan rahasia untuk berbuat dosa, permusuhan, dan durhaka kepada rasul. Mencoba memecah belah persatuan dan kesatuan kaum ansar yang dahulunya bani aus dan khazraj yang suka berperang di antara mereka. Mereka pun memancing-mancing permusuhan dengan cara berbisik-bisik sesama mereka, jika ada seorang muslim yang lewat di hadapan mereka sehingga kaum muslim merasa tidak aman jika berada di perkampungan yahudi. Dan apabila mereka datang kepadamu Muhammad, mereka mengucapkan salam dengan cara yang bukan seperti yang ditentukan Allah untukmu, yaitu dengan ucapan, 'mudah-Mudahan kematian menimpamu wahai abul qasim. 'rasulullah menjawab, 'dan atas kamu juga. ' dan, setelah orang-orang yahudi mengucapkan salam penghinaan kepada rasulullah tersebut, mereka mengatakan pada diri mereka sendiri dengan nada menantang, 'mengapa Allah tidak menyiksa kita atas apa yang kita katakan itu'' kalau benar Muhammad seorang rasul, tentu Allah akan mengabulkan jawaban Muhammad, 'dan atas kamu juga, ' bencana atau kematian. Benar Allah akan mengazab setiap orang yang durhaka kepada-Nya, tetapi kapan datangnya azab itu adalah kewenangan Allah. Dia akan menimpakan azab itu bila dikehendaki-Nya, namun yang pasti adalah cukuplah bagi mereka neraka jahanam yang akan mereka masuki dengan kehinaan dan penderitaan abadi. Maka neraka itu seburuk-buruk tempat kembali di akhirat yang kekal selama-lamanya bagi orang-orang kafir."
  }
]