[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah kamu (wahai Rasul) tidak melihat kepada orang-orang Yahudi yang dilarang berbisik-bisik secara rahasia dengan sesuatu yang menimbulkan kecurigaan pada hati orang-orang beriman, kemudian mereka melakukan kembali apa yang dilarang itu, di mana mereka berbicara secara rahasia dengan pembicaraan yang mengandung dosa, permusuhan, dan penyelisihan terhadap perintah Rasulullah? Bila orang-orang Yahudi itu datang kepadamu (wahai Rasul) untuk satu urusan, mereka mengucapkan penghormatan kepadamu yang tidak Allah jadikan sebagai penghormatan bagimu, yaitu mereka berkata, “As-Samu alaika”, yang berarti, semoga kematian menimpamu. Mereka berkata di antara mereka, “Bila memang Muhammad adalah utusan Allah yang benar, mengapa Allah tidak menghukum kita atas apa yang kita ucapkan kepadanya?” cukuplah Neraka Jahanam bagi mereka yang akan mereka masuki, mereka akan merasakan panasnya, dan itu adalah seburuk-buruk tempat kembali."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Tidakkah engkau melihat -wahai Rasul- kepada orang-orang Yahudi yang saling berbisik-bisik apabila mereka melihat orang Mukmin, lalu Allah melarang mereka dari bisik-bisik, kemudian mereka kembali melakukan apa yang dilarang oleh Allah kepada mereka, dan mereka saling berbisik-bisik di antara mereka dengan sesuatu yang mengandung dosa seperti menggunjing orang-orang yang beriman (gibah), dan hal yang menimbulkan permusuhan terhadap orang-orang yang beriman, serta hal yang merupakan kemaksiatan terhadap Rasul. Jika mereka mendatangimu -wahai Rasul- mereka mengucapkan salam kepadamu dengan salam yang Allah belum pernah mengucapkannya kepadamu, yaitu ucapan mereka, “As-Sāmu 'alaika.” Dan yang mereka maksud adalah kematian. Mereka mengucapkannya sebagai bentuk pendustaan terhadap Nabi -ṣallallāhu 'alaihi wa sallam-, “Kenapa Allah tidak menyiksa kami atas ucapan kami, karena jika dia benar seperti yang diklaimnya bahwa dirinya adalah nabi, tentulah Allah menyiksa kami atas apa yang kami ucapkan.” Cukuplah Jahanam sebagai siksa bagi mereka atas ucapan mereka, mereka merasakan panasnya Neraka, sungguh seburuk-buruk tempat kembali adalah tempat mereka kembali."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "8. Hai Rasulullah, tidakkah kamu melihat kepada orang-orang Yahudi dan orang-orang munafik yang Allah larang untuk berbincang secara rahasia mengenai sesuatu yang dapat menyakiti orang-orang beriman. Akan tetapi kemudian mereka kembali melanggar larangan itu dan mengulangi perkataan haram yang mengandung dosa dan melanggar perintah Rasulullah itu. Jika orang-orang Yahudi itu datang kepadamu, mereka akan menyambutmu dengan sambutan yang zalim, ‘Semoga kematian menimpamu’, dan mereka saling berbisik dengan hinaan, ‘Jika Muhammad benar-benar seorang rasul, mengapa Allah tidak segera mengazab kita akibat perkataan yang kita tujukan kepadanya ini’. Cukuplah bagi mereka neraka Jahannam yang mereka rasakan panasnya. Itulah seburuk-buruk tempat. Aisyah meriwayatkan, bahwa suatu hari orang-orang Yahudi datang kepada Rasulullah dan berkata, “assaamu alaika (Semoga kematian menimpamu)”, maka akupun melaknat mereka. Lalu Rasulullah bersabda, “Ada ada denganmu?” Aisyah menjawab, “Tidakkah engkau mendengar apa yang mereka katakan kepadamu?” Beliau menjawab, “Kamu tidak mendengar apa yang aku katakan kepada mereka ‘Wa’alaikum’ (Dan semoga kalianlah yang ditimpa kematian)”. (Shahih al-Bukhari 6/124-125, kitab jihad, bab mendoakan orang-orang musyrik agar mereka kalah dan tertimpa goncangan, no. 2935). Dan Anas bin Malik meriwayatkan bahwa seorang Yahudi datang kepada Rasulullah dan para sahabatnya dan berkata, “assaamu alaikum (Semoga kematian menimpa kalian)”. Maka para sahabat membalas dengan ucapan yang serupa. Lalu Rasulullah bersabda, “Apakah kalian mengetahui apa yang dikatakan orang ini?” Para sahabat menjawab, “Allah dan Rasul-Nya lebih mengetahui, dia mengucapkan salam wahai Nabiyullah.” Rasulullah menjawab, “Tidak, namun dia berkata ini dan itu; panggillah orang itu kepadaku.” Maka para sahabat mendatangkan orang Yahudi itu, kemudian Rasulullah bertanya kepadanya, “Apakah kamu berkata ‘assaamu alaikum’?” Dia menjawab, “Benar”. Maka ketika itu Rasulullah bersabda, “Jika seorang ahli kitab berkata kepada kalian (seperti ini) maka jawablah mereka dengan berkata, ‘Alaika’ (Semoga kamu yang tertimpa hal itu)”. Lalu Rasulullah membaca ayat: (وَإِذَا جَآءُوكَ حَيَّوْكَ بِمَا لَمْ يُحَيِّكَ بِهِ ٱلله). (Dirawayatkan oleh at-Tirmidzi dalam as-Sunan 5/407, kitab tafsir. Dishahihkan oleh al-Albani dalam Shahih Sunan at-Tirmidzi no. 3301)"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. أَلَمْ تَرَ إِلَى الَّذِينَ نُهُوا۟ عَنِ النَّجْوَىٰ ثُمَّ يَعُودُونَ لِمَا نُهُوا۟ عَنْهُ (kah tidak kamu perhatikan orang-orang yang telah dilarang mengadakan pembicaraan rahasia, kemudian mereka kembali (mengerjakan) larangan itu) Dahulu jika ada orang beriman yang melewati sekelompok orang Yahudi, mereka saling berbisik sehingga orang beriman itu mengira mereka ingin melakukan hal buruk; maka Allah melarang mereka, namun mereka tidak juga berhenti dari perbuatan mereka ini, sehingga Allah menurunkan firman-Nya: وَيَتَنٰجَوْنَ بِالْإِثْمِ(dan mereka mengadakan pembicaraan rahasia untuk berbuat dosa) Yakni dengan untuk mengghibah orang-orang beriman atau menyakiti mereka, atau membuat dusta dan menzalimi mereka. وَالْعُدْوٰنِ(permusuhan) Yakni permusuhan terhadap orang-orang beriman. وَمَعْصِيَتِ الرَّسُولِ(dan durhaka kepada Rasul) Yakni menyelisihi Rasulullah. وَإِذَا جَآءُوكَ حَيَّوْكَ بِمَا لَمْ يُحَيِّكَ بِهِ اللهُ(Dan apabila mereka datang kepadamu, mereka mengucapkan salam kepadamu dengan memberi salam yang bukan sebagai yang ditentukan Allah untukmu) Yang dimaksud adalah orang-orang Yahudi. Mereka jika mendatangi rasulullah mengatakan: “Saam alaika” (kematian bagimu), mereka menampakkan kalimat “salam alaka” namun yang mereka maksud adalah “Saam alaik”; dan Rasulullah hanya menjawab mereka dengan “Alaikum” (namun kematian itu bagi kalian) وَيَقُولُونَ فِىٓ أَنفُسِهِمْ(Dan mereka mengatakan kepada diri mereka sendiri) Yakni mengatakan kepada sesama mereka. لَوْلَا يُعَذِّبُنَا اللهُ بِمَا نَقُولُ ۚ(“Mengapa Allah tidak menyiksa kita disebabkan apa yang kita katakan itu?”) Yakni mereka berkata: “seandainya Muhammad itu adalah seorang Nabi, niscaya Allah telah mengazab kita akibat olokan yang ada dalam ucapan kita kepadanya.” Pendapat lain mengatakan, yakni seandainya Muhammad adalah seorang Nabi, niscaya ucapanya pasti telah dikabulkan karena dia telah mendoakan kita dengan mengatakan “Alaikum” (namun kematian itu bagi kalian), sehingga kita pasti telah binasa saat itu juga. حَسْبُهُمْ جَهَنَّمُ(Cukuplah bagi mereka Jahannam) Yakni cukup bagi mereka azab Jahannam saat kematian telah mendatangi mereka. يَصْلَوْنَهَا ۖ( yang akan mereka masuki) Yakni yang mereka masuki. فَبِئْسَ الْمَصِيرُ (Dan neraka itu adalah seburuk-buruk tempat kembali) Yaitu neraka Jahannam."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8. Apakah engkau tidak memperhatikan dan juga tidak heran wahai Nabi terhadap kondisi orang Yahudi dan orang-orang munafik. Mereka telah dilarang oleh rasul SAW untuk berbisik-bisik dalam rangka rencana menguasai orang mukmin. Kemudian mereka tetap mengulangi perbuatan mereka. Mereka berbisik-bisik tentang hal yang diharamkan Allah, yaitu maksiat dan perbuatan dosa. Mereka berencana mengagresi orang mukmin dan membangkang terhadap rasul. Apabila orang Yahudi datang dan mengucapkan salam kepadamu dengan salam selain assalamu’alaikum tapi dengan ucapan assaamu ‘alaikum yang bermakna kematian dan kehancuran. Mereka saling mengejek dalam kelompok mereka: Apa mungkin hanya karena soal salam, lantas Allah akan mengazab kami, hanya karena bahwa Muhammad itu memang seorang nabi?” Maka azab neraka Jahannam adalah cukup dan sesuai bagi mereka. Mereka akan memasukinya dan Jahannam adalah seburuk-buruk tempat kembali, dan itu adalah tempat mereka. Muqatil bin Hayyan berkata: Pernah suatu ketika antara nabi dan Yahudi ada sebuah salam. Apabila seorang sahabat lewat di depan mereka, mereka kemudian duduk berkupul dan saling berbisik. Sehingga orang mukmin menyangka bahwa mereka berencana untuk membunuhnya atau merencanaka sesuatu yang tidak dia kehendaki. Sehingga rasul SAW melarang perbuatan berbisik itu. Belum mereka selesai dalam perbuatan mereka, Allah telah menurunkan ayat: apakah engkau tidak memperhatikan orang-orang yang melarang berbisik? Aisyah berkata: Sekelompok orang Yahudi mendatangi nabi dengan berkata: Kecelakaan bagimu wahai ayah Qasim. Kemudian aku menjawab: Kecelakan tetap bagi kalian, Allah Maha berbuat atas kalian. Kemudian turunlah ayat: Dan mereka mendatangimu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah kamu tidak memperhatikan orang-orang yang telah dilarang mengadakan pembicaraan rahasia, kemudian mereka kembali (melakukan) apa yang telah dilarang itu. Mereka saling mengadakan pembicaraan rahasia untuk berbuat dosa, permusuhan, dan kemaksiatan kepada Rasul. Apabila datang kepadamu, mereka mengucapkan salam kepadamu dengan cara yang bukan sebagaimana yang ditentukan Allah untukmu} mereka mengucapkan salam kepadamu dengan salam yang bukan dari Allah kepadamu, mereka berkata,”racun atasmu”, yaitu kematian kepadamu {Mereka mengatakan dalam hati mereka, “Mengapa Allah tidak} mengapa tidak {menyiksa kita atas apa yang kita katakan” Cukuplah bagi mereka} cukuplah bagi mereka {neraka Jahanam yang akan mereka masuki. Maka seburuk-buruk tempat kembali} tempat kembali dan tempat berakhir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8-9. “Pembicaraan rahasia” adalah pembicaraan antara dua orang atau lebih yang membahas kebaikan atau keburukan. Allah memerintahkan orang-orang yang beriman agar membicarakan kebaikan ketika berbicara secara rahasia. Kebaikan adalah kata menyeluruh untuk seluruh kebaikan, ketaatan, menunaikan hak-hak Allah, hak-hak sesama manusia, takwa, dan lainnya. Dan yang dimaksud dalam ayat ini dengan penggunaan kata menyeluruh adalah agar menjauhi seluruh keharaman dan dosa. Orang Mukmin pasti menunaikan perintah ilahi ini. Tidaklah anda melihatnya berbisik-bisik atau berbicara kecuali membahas sesuatu yang bisa mendekatkan diri mereka kepada Allah dan menjauhkan mereka dari murkaNya. Adapun orang-orang durjana dan pendosa saling memandang rendah perintah-perintah Allah serta berbisik-bisik dengan dosa dan permusuhan serta mendurhakai Rasulullah, seperti halnya orang-orang munafik. Itulah kebiasaan mereka dan kondisi mereka bersama Rasulullah. Allah berfirman, “Dan apabila mereka datang kepadamu, mereka mengucapkan salam kepadamu dengan memberi salam yang bukan sebagaimana yang ditentukan Allah untukmu.” Maksudnya mereka merahasiakan pembicaraan yang dibeberkan oleh Allah Yang Mengetahui hal yang ghaib dan nyata, yaitu pembicaraan mereka, “Mengapa Allah tidak menyiksa kita disebabkan apa yang kita katakan itu.” Maksudnya mereka meremehkan hal itu dengan berdalih tidak disegerakannya azab dan hukuman untuk mereka dengan alasan pembicaraan mereka itu tidak terlarang. Allah berfirman seraya menjelaskan bahwa Dia memberi tangguh bukan melalaikan, “Cukuplah bagi mereka Neraka Jahanam yang akan mereka masuki. Dan neraka itu adalah seburuk-buruk tempat kembali.” Maksudnya, cukuplah Neraka adalah seburuk-buruk tempat kembali.” Maksudnya cukuplah Neraka Jahanam bagi mereka yang mencakup berbagai macam siksaan dan kesengsaraan untuk mereka; siksaan-siksaan itu meliputi dan menyakitkan mereka, dan neraka itu adalah seburuk-buruk tempat kembali. Mereka yang disinggung tersebut adalah orang-orang munafik yang menampakkan keimanan dan mengungkapkan kata-kata tersebut kepada Rasulullah yang menurut mereka menginginkan kebaikan padahal mereka berdusta. Atau yang dimaksud dalam ayat ini adalah ahli kitab, yaitu orang-orang yang ketika memberi ucapan salam kepada Rasulullah menyatakan, “AsSammu ‘alaika ya Muhammad,” maksudnya adalah “Matilah kau Muahammad!”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mujadalah ayat 8: Allah mengabarkan keadaan orang munafik dan yahudi dimana mereka ketika melihat orang-orang beriman saling berbisik, dan Allah melarang untuk berbisik atas orang yang melihat urusan yang samar, karena akan dicatat sebagai dosa dan keburukan baginya. Kemudian orang-orang munafik dan yahudi kembali mengulangi apa yang telah dilarang bagi mereka. Mereka saling bercengkrama di antara mereka , yang menjadikan dosa bagi diri-diri mereka sendiri, mereka memusuhi kaum muslimin dan saling berwasiat untuk menyelisihi Rasul ﷺ. Kemudian Allah menjelaskan bahwa mereka orang-orang munafik, jika mereka datang kepada Nabi ﷺ mereka mengucapkan salam yang tidak ditetapkan oleh Allah. Ucapan mereka adalah : Semoga kebinasaan bagi engkau atau kematian bagi engkau. Mereka secara dzahir menginginkan salam akan tetapi secara batin mereka menginginkan kematian. Mereka bercengkrama dengan diri mereka masing-masing karena sebab mereka takut akan adzab Allah karena ucapan yang mereka ucapkan, sebab Allah mengetahui apa yang mereka rahasiakan. Allah mengancam mereka dengan berkata : Cukuplah bagi kalian adzab yang kalian akan masuk ke dalam neraka jahannam dan dibakar dengan apinya; Maka seburuk-buruk tempat kembali dan tempat tinggal bagi kalian adalah jahannam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Pembicaraan rahasia di sini adalah pembicaraan rahasia antara dua orang atau lebih, dimana terkadang isi pembicaraannya bisa baik dan bisa buruk. Allah Subhaanahu wa Ta'aala dalam ayat ini memerintahkan kaum mukmin agar membicarakan yang baik saja, yaitu berupa kebaikan dan ketaatan serta memenuhi hak Allah dan hak hamba-Nya. Demikian juga membicarakan ketakwaan, yaitu meninggalkan segala yang haram dan dosa. Oleh karena itu, pembicaraan orang mukmin hanyalah terhadap hal yang mendekatkan mereka kepada Allah, menjauhkan mereka dari kemurkaan-Nya. Adapun orang fasik, maka dia meremehkan perintah Allah, membicarakan dosa, permusuhan dan durhaka kepada Rasulullah shallallahu 'alaihi wa sallam sebagaimana orang-orang munafik yang kebiasaannya seperti itu. Imam Ahmad meriwayatkan dengan sanadnya yang sampai kepada Abdullah bin ‘Amr, bahwa orang-orang Yahudi berkata kepada Rasulullah shallallahu 'alaihi wa sallam, “Saam ‘alaika (Kematian atasmu),” lalu mereka berkata dalam hati mereka, “Mengapa Allah tidak menyiksa kita terhadap apa yang kita ucapkan?” Maka turunlah ayat ini, “Mereka mengucapkan salam dengan cara yang bukan seperti yang ditentukan Allah untukmu….dst.” (Hadits ini menurut Haitsami, diriwayatkan oleh Ahmad, Al Bazzar, dan Thabrani dengan isnad yang jayyid, karena Hammad mendengar dari ‘Atha’ bin As Saa’ib di saat ‘Athaa’ masih sehat.”) Imam Muslim meriwayatkan dengan sanadnya yang sampai kepada Aisyah ia berkata, “Ada beberapa orang dari kalangan Yahudi yang datang kepada Nabi shallallahu 'alaihi wa sallam, lalu mereka berkata, “As Saam ‘alaika (Kematian atamu) wahai Abul Qaasim!” Beliau menjawab, “Wa ‘alaikum (Demikian juga kepada kamu), “ Aisyah berkata, “Bahkan atasmu (wahai orang-orang Yahudi) As Saam (kematian) dan Adz Dzaam (cacat).” Maka Rasulullah shallallahu 'alaihi wa sallam bersabda, “Wahai Aisyah, janganlah kamu menjadi orang yang berbicara keji.” Aisyah berkata, “Apakah engkau tidak mendengar apa yang mereka ucapkan?” Beliau menjawab, “Bukankah aku telah mengembalikan kepada mereka apa yang mereka ucapkan? Aku ucapkan, “Wa ‘alaikum (demikian juga kepadamu).” Yakni mereka beradab buruk ketika mengucapkan salam kepadamu. Hal ini menunjukkan, bahwa mereka meremehkan perkara tersebut dan berdalih dengan tidak diazabnya mereka bahwa ucapan mereka tidak berbahaya, maka Allah Subhaanahu wa Ta'aala menerangkan sebagaimana dalam lanjutan ayat di atas bahwa Dia memberi tangguh, namun tidak membiarkan begitu saja. Yakni cukuplah bagi mereka neraka Jahanam yang menghimpun segala kesengsaraan dan azab, dimana mereka akan diazab di dalamnya. Mereka ini bisa kaum munafik yang menampakkan keimanan yang berbicara dengan Rasulullah shallallahu 'alaihi wa sallam dengan ucapan tersebut dan memberikan kesan bahwa maksud mereka adalah baik, dan bisa juga bahwa mereka ini adalah kaum Ahli Kitab yang mengucapkan salamnya kepada Nabi shallallahu 'alaihi wa sallam dengan ucapan “As Saam” (kematian) tanpa huruf laam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mujadalah Ayat 8",
    "description": "Pada ayat yang lalu disebutkan bahwa tidak satu pun yang tersembunyi bagi Allah, dari bisikan sampai yang diucapkan dengan terang-terangan. Pada ayat ini dijelaskan perjanjian rahasia yang dilakukan orang-orang yahudi di madinah untuk menghancurkan islam, karena mereka tidak menyadari bahwa Allah mengetahui rahasia jahat mereka. Tidakkah engkau, Muhammad, memperhatikan orang-orang, yakni kaum yahudi di madinah, yang telah dilarang mengadakan pembicaraan rahasia untuk memusuhi islam, mencelakakan, dan berusaha membunuh rasulullah, karena mereka telah mengikat perjanjian damai dengan kaum muslim dalam piagam madinah; kemudian mereka kembali mengerjakan larangan itu dengan mengabaikan kesepakatan damai tersebut; dan mereka mengadakan pembicaraan rahasia untuk berbuat dosa, permusuhan, dan durhaka kepada rasul. Mencoba memecah belah persatuan dan kesatuan kaum ansar yang dahulunya bani aus dan khazraj yang suka berperang di antara mereka. Mereka pun memancing-mancing permusuhan dengan cara berbisik-bisik sesama mereka, jika ada seorang muslim yang lewat di hadapan mereka sehingga kaum muslim merasa tidak aman jika berada di perkampungan yahudi. Dan apabila mereka datang kepadamu Muhammad, mereka mengucapkan salam dengan cara yang bukan seperti yang ditentukan Allah untukmu, yaitu dengan ucapan, 'mudah-Mudahan kematian menimpamu wahai abul qasim. 'rasulullah menjawab, 'dan atas kamu juga. ' dan, setelah orang-orang yahudi mengucapkan salam penghinaan kepada rasulullah tersebut, mereka mengatakan pada diri mereka sendiri dengan nada menantang, 'mengapa Allah tidak menyiksa kita atas apa yang kita katakan itu'' kalau benar Muhammad seorang rasul, tentu Allah akan mengabulkan jawaban Muhammad, 'dan atas kamu juga, ' bencana atau kematian. Benar Allah akan mengazab setiap orang yang durhaka kepada-Nya, tetapi kapan datangnya azab itu adalah kewenangan Allah. Dia akan menimpakan azab itu bila dikehendaki-Nya, namun yang pasti adalah cukuplah bagi mereka neraka jahanam yang akan mereka masuki dengan kehinaan dan penderitaan abadi. Maka neraka itu seburuk-buruk tempat kembali di akhirat yang kekal selama-lamanya bagi orang-orang kafir. 9. Allah lalu mengingatkan orang-orang beriman agar tidak mengikuti kebiasaan yahudi mengadakan pembicaraan rahasia kecuali untuk kebaikan. Wahai orang-orang yang beriman! apabila kamu terpaksa mengadakan atau terlibat dalam pembicaraan rahasia, maka perhatikanlah, janganlah kamu membicarakan perbuatan dosa, perencanaan, cara maupun strategi; dan jangan pula membahas permusuhan, kebencian, dan fitnah; dan jangan pula membicarakan perbuatan yang tergolong durhaka kepada rasul, namun, jika terpaksa mengadakan atau terlibat dalam pembicaraan rahasia, maka bicarakanlah tentang perbuatan kebajikan meliputi perdamaian, dan kerukunan hidup beragama, dan penguatan takwa kepada Allah. Dan bertakwalah kepada Allah, wahai seluruh umat dengan menjaga kesinambungan iman dan ibadah, serta amal saleh, yang kepada-Nya kamu akan dikumpulkan kembali pada hari kiamat untuk mempertanggung jawabkan hidup di hadapan Allah."
  }
]