[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang yang membenarkan Allah dan RasulNya serta melaksanakan syariatNya, bila kalian berbisik-bisik secara rahasia di antara kalian, jangan berbisik dengan sesuatu yang mengandung dosa, dalam bentuk pelanggaran terhadap orang lain atau penyelisihan terhadap perintah Rasulullah, sebaliknya berbicaralah sesuatu yang mengandung kebaikan, ketaatan dan keinginan berbuat baik. Dan takutlah kepada Allah dengan melaksanakan perintah-perintahNya dan menjauhi larangan-laranganNya. Hanya kepada Allah semata kalian akan kembali dengan membawa seluruh amal perbuatan dan perkataan kalian yang Dia catat untuk kalian, dan Dia akan membalas kalian atasnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Wahai orang-orang yang beriman kepada Allah dan mengerjakan apa yang disyariatkan kepada mereka! Janganlah kalian berbisik-bisik dengan sesuatu yang mengandung dosa,permusuhan atau maksiat terhadap Rasul, agar kalian tidak seperti orang-orang Yahudi! Dan berbisik-bisiklah kalian dengan sesuatu yang mengandung ketaatan kepada Allah dan berhentilah dari perbuatan maksiat terhadap-Nya. Dan bertakwalah kepada Allah dengan melakukan segala perintah-Nya dan menjauhi segala larangan-Nya, dan hanya kepada Dia semata kalian dikembalikan pada hari Kiamat untuk perhitungan amal dan pembalasan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "9-10. Allah memerintahkan orang-orang beriman jika mereka saling berbincang secara rahasia untuk tidak berbincang dalam perkara yang mengandung dosa, permusuhan dengan orang lain, dan menyelisihi perintah Rasulullah; dan hendaklah mereka berbincang secara rahasia dalam hal kebaikan, ketaatan kepada perintah Allah dan menjauhi larangan-Nya. Kemudian Allah memeintahkan mereka agar takut kepada-Nya karena mereka akan kembali kepada Allah untuk menjalani hisab. Allah menekankan bahwa perbincangan secara rahasia dalam perkara dosa dan permusuhan merupakan salah satu godaan dari setan, agar ia dapat memasukkan rasa sedih ke dalam hari orang-orang beriman, dan hal itu tidak dapat menyakiti mereka sedikitpun melainkan dengan izin Allah. Hendaklah orang-orang yang beriman kepada Allah dan rasul-Nya hanya bersandar kepada-Nya. Abdullah meriwayatkan bahwa Rasulullah bersabda: “Jika kalian sedang bertiga, maka janganlah dua orang di antara mereka saling berbisik tanpa menyertakan orang ketiga.” (Shahih al-Bukhari 11/84, kitab permintaan izin, bab janganlah dua orang saling berbisik tanpa menyertakan orang ketiga, no. 6288. Dan Shahih Muslim 4/1718, no. 2184, kitab ucapan salam, bab keharaman dua orang saling berbisik tanpa menyertakan orang ketiga di antara mereka)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. يٰٓأَيُّهَا الَّذِينَ ءَامَنُوٓا۟ إِذَا تَنٰجَيْتُمْ فَلَا تَتَنٰجَوْا۟ بِالْإِثْمِ وَالْعُدْوٰنِ وَمَعْصِيَتِ الرَّسُولِ (Hai orang-orang beriman, apabila kamu mengadakan pembicaraan rahasia, janganlah kamu membicarakan tentang membuat dosa, permusuhan dan berbuat durhaka kepada Rasul) Sebagaimana yang dilakukan oleh orang-orang Yahudi dan munafik. وَتَنٰجَوْا۟ بِالْبِرِّ وَالتَّقْوَىٰ ۖ( Dan bicarakanlah tentang membuat kebajikan dan takwa) Dengan melakukan ketaatan dan menjauhi kemaksiatan. وَاتَّقُوا۟ اللهَ الَّذِىٓ إِلَيْهِ تُحْشَرُونَ(Dan bertakwalah kepada Allah yang kepada-Nya kamu akan dikembalikan) Sehingga Allah dapat membalas amal perbuatan kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9. Wahai orang-orang yang beriman jika kalian berbisik-bisik tentang sesuatu yang rahasia, maka jangan berbisik tentang suatu hal yang berbau dosa dan maksiat, jangan pula tentang kedhaliman dan permusuhan (agresi). Jangan berbisik untuk mengingkari perintah rasul, seperti yang dillakukan oleh orang-orang munafik. Namun berbisiklah tentang hal yang mengarah pada ketaqwaan, ketaatan dan menjauhi maksiat. Bertaqwalah kepada Allah dengan mengerjakan perintah-Nya dan menjauhi larangan-Nya. Kelak pada hari kiamat kalian akan dikumpulkan di hadapan-Nya berdasarkan amal kalian, dan akan menerima balasan sesuai amal kalian. Al birru adalah segala sesuatu yang di dalamnya ada kebaikan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Wahai orang-orang yang beriman, apabila kalian saling mengadakan pembicaraan rahasia, maka janganlah berbicara tentang perbuatan dosa, permusuhan, dan kemaksiatan kepada Rasul. Tapi berbicaralah tentang perbuatan baik dan takwa. Bertakwalah kepada Allah yang hanya kepadaNyalah kalian akan dikumpulkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8-9. “Pembicaraan rahasia” adalah pembicaraan antara dua orang atau lebih yang membahas kebaikan atau keburukan. Allah memerintahkan orang-orang yang beriman agar membicarakan kebaikan ketika berbicara secara rahasia. Kebaikan adalah kata menyeluruh untuk seluruh kebaikan, ketaatan, menunaikan hak-hak Allah, hak-hak sesama manusia, takwa, dan lainnya. Dan yang dimaksud dalam ayat ini dengan penggunaan kata menyeluruh adalah agar menjauhi seluruh keharaman dan dosa. Orang Mukmin pasti menunaikan perintah ilahi ini. Tidaklah anda melihatnya berbisik-bisik atau berbicara kecuali membahas sesuatu yang bisa mendekatkan diri mereka kepada Allah dan menjauhkan mereka dari murkaNya. Adapun orang-orang durjana dan pendosa saling memandang rendah perintah-perintah Allah serta berbisik-bisik dengan dosa dan permusuhan serta mendurhakai Rasulullah, seperti halnya orang-orang munafik. Itulah kebiasaan mereka dan kondisi mereka bersama Rasulullah. Allah berfirman, “Dan apabila mereka datang kepadamu, mereka mengucapkan salam kepadamu dengan memberi salam yang bukan sebagaimana yang ditentukan Allah untukmu.” Maksudnya mereka merahasiakan pembicaraan yang dibeberkan oleh Allah Yang Mengetahui hal yang ghaib dan nyata, yaitu pembicaraan mereka, “Mengapa Allah tidak menyiksa kita disebabkan apa yang kita katakan itu.” Maksudnya mereka meremehkan hal itu dengan berdalih tidak disegerakannya azab dan hukuman untuk mereka dengan alasan pembicaraan mereka itu tidak terlarang. Allah berfirman seraya menjelaskan bahwa Dia memberi tangguh bukan melalaikan, “Cukuplah bagi mereka Neraka Jahanam yang akan mereka masuki. Dan neraka itu adalah seburuk-buruk tempat kembali.” Maksudnya, cukuplah Neraka adalah seburuk-buruk tempat kembali.” Maksudnya cukuplah Neraka Jahanam bagi mereka yang mencakup berbagai macam siksaan dan kesengsaraan untuk mereka; siksaan-siksaan itu meliputi dan menyakitkan mereka, dan neraka itu adalah seburuk-buruk tempat kembali. Mereka yang disinggung tersebut adalah orang-orang munafik yang menampakkan keimanan dan mengungkapkan kata-kata tersebut kepada Rasulullah yang menurut mereka menginginkan kebaikan padahal mereka berdusta. Atau yang dimaksud dalam ayat ini adalah ahli kitab, yaitu orang-orang yang ketika memberi ucapan salam kepada Rasulullah menyatakan, “AsSammu ‘alaika ya Muhammad,” maksudnya adalah “Matilah kau Muahammad!”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mujadalah ayat 9: Allah memberikan petunjuk kepada orang-orang yang beriman jika di antara mereka ada yang saling berbisik, agar tidak berbisik dengan bisikan yang mengandung dosa dan permusuhan serta kemaksiatan kepada Rasul ﷺ, sebagaimana perbuatan yahudi dan orang-orang munafik. Akan tetapi bagi kalian (orang-orang beriman) untuk berbisik dengan sesuatu yang baik, ketaatan dan kemuliaan. Dan takutlah kepada Allah di dalam apa yang kalian bicarakan, karena tempat kembali kalian adalah kepada Allah. Allah mengabarkan berapa banyak amalan-amalan kalian, ucapan-ucapan kalian yang itu semua dapat kalian hitung, yang semuanya akan dibalas bagi kalian atas amalan-amalan tersebut. Jika baik maka akan dibalas dengan kebaikan, jika buruk maka akan dibalas dengan keburukan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mujadalah Ayat 9",
    "description": "Allah lalu mengingatkan orang-orang beriman agar tidak mengikuti kebiasaan yahudi mengadakan pembicaraan rahasia kecuali untuk kebaikan. Wahai orang-orang yang beriman! apabila kamu terpaksa mengadakan atau terlibat dalam pembicaraan rahasia, maka perhatikanlah, janganlah kamu membicarakan perbuatan dosa, perencanaan, cara maupun strategi; dan jangan pula membahas permusuhan, kebencian, dan fitnah; dan jangan pula membicarakan perbuatan yang tergolong durhaka kepada rasul, namun, jika terpaksa mengadakan atau terlibat dalam pembicaraan rahasia, maka bicarakanlah tentang perbuatan kebajikan meliputi perdamaian, dan kerukunan hidup beragama, dan penguatan takwa kepada Allah. Dan bertakwalah kepada Allah, wahai seluruh umat dengan menjaga kesinambungan iman dan ibadah, serta amal saleh, yang kepada-Nya kamu akan dikumpulkan kembali pada hari kiamat untuk mempertanggung jawabkan hidup di hadapan Allah. 10. Orang beriman dilarang mengadakan pembicaraan rahasia karena pembicaraan rahasia itu karakter setan dalam menghasut manusia membangkitkan permusuhan dan kebencian. Sesungguhnya pembicaraan rahasia itu termasuk perbuatan setan dalam membujuk manusia mengikuti strateginya: berpaling dari Allah, mengikuti dorongan rendah dan membawa manusia kepada jurang kemaksiatan agar orang-orang beriman itu setelah tertipu strategi setan menyesal dan bersedih hati, sedang pembicaraan rahasia itu tidaklah memberi bencana sedikit pun kepada mereka, orang-orang beriman, kecuali dengan izin Allah. Dan hanya kepada Allah hendaknya orang-orang yang beriman bertawakal, menyerahkan hidup dan kehidupannya lahir batin setelah merencanakan secara optimal dan berusaha secara maksimal."
  }
]