[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1. Apabila orang-orang munafik itu mengahadiri majelismu (wahai rasul) mereka berkata dengan lisan mereka, “Kami bersaksi bahwa sesungguhnya kamu adalah utusan Allah” dan Allah bersaksi bahwa orang-orang munafik itu adalah para pendusta dalam kesaksian yang mereka perlihatkan kepadamu dan sumpah mereka dengan lisan mereka, serta apa yang mereka simpan dalam dada mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Jika orang-orang munafik yang menampakkan keislaman dan menyembunyikan kekufuran menghadiri majlismu -wahai Rasul- mereka berkata, “Kami bersaksi bahwa engkau adalah benar-benar utusan Allah.” Dan Allah Maha Tahu bahwa engkau adalah benar-benar utusan-Nya. Allah juga bersaksi bahwasanya orang-orang munafik itu benar-benar berdusta dalam klaim mereka bahwa mereka bersaksi dari dari hati mereka yang terdalam bahwa engkau adalah Rasul-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1. Allah memperingatkan Rasul-Nya dan orang-orang beriman dari kedustaan dan tipu daya orang-orang munafik: Hai Rasulullah, jika orang-orang munafik datang kepadamu dan berkata karena ingin menarik perhatian, “Kami bersaksi bahwa kamu wahai Muhammad benar-benar Rasulullah.” Allah mengetahui bahwa kamu benar-benar Rasulullah, dan Allah bersaksi bahwa orang-orang munafik itu telah berdusta."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. إِذَا جَآءَكَ الْمُنٰفِقُونَ (Apabila orang-orang munafik datang kepadamu) Yakni jika mereka datang dan menghadiri majelismu. قَالُوا۟ نَشْهَدُ إِنَّكَ لَرَسُولُ اللَّـهِ ۗ( mereka berkata, “Kami mengakui, bahwa engkau adalah rasul Allah) Mereka menekankan persaksian mereka agar menampakkan bahwa itu berasal dari lubuk hati mereka dengan penuh ketulusan. Makna (نشهد) yakni kami mengetahui dan bersumpah. وَاللَّـهُ يَعْلَمُ إِنَّكَ لَرَسُولُهُۥ(Dan Allah mengetahui bahwa engkau benar-benar Rasul-Nya) Allah membenarkan perkataan mereka karena mengandung persaksian bagi Nabi Muhammad tentang kebenaran kerasulannya, agar tidak difahami bahwa pendustaan Allah terhadap perkataan mereka yang akan disebutkan dalam kalimat selanjutnya merujuk pada kerasulan Muhammad. وَاللَّـهُ يَشْهَدُ إِنَّ الْمُنٰفِقِينَ لَكٰذِبُونَ(dan Allah menyaksikan bahwa orang-orang munafik itu benar-benar pendusta) Yakni mereka berdusta dalam pengakuan mereka bahwa persaksian mereka bagi Nabi Muhammad tentang kerasulannya adalah dari lubuk hati mereka yang disampaikan dengan penuh ketulusan, bukan berdusta dalam kalimat yang mereka ucapkan, sebab persaksian mereka tentang kerasulan Muhammad adalah suatu kebenaran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "1. Jika datang kepadamu Wahai Nabi para orang munafik, mereka akan berkata: “Kami bersumpah demi Allah bahwa engkau adalah utusanNya” Hal ini diucapkan untuk menjaga diri dan harta benda mereka. Allah mengetahui bahwa sesungguhnya dirimu adalah sebenar-benarnya rasul. Kalimat yang bertentangan ini sebagai wujud penekanan untuk menjaga kedudukan Rasulallah SAW. Allah mengetahui dan bersumpah bahwa sesungguhnya orang-orang munafik itu berbohong atas apa yang mereka serukan berupa keimanan. Orang munafik adalah orang yang menunjukkan keislamannya dan menyembunyikan kekufurannya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apabila orang-orang munafik} oranag-orang yang menampakkan keislaman dan menyembunyikan kekufurannya {datang kepadamu, mereka berkata,“Kami bersaksi bahwa kamu benar-benar utusan Allah” Allah mengetahui bahwa kamu benar-benar utusanNya. Allah pun bersaksi bahwa orang-orang munafik itu benar-benar para pendusta"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1. Ketika Nabi tiba di Madinah, Islam menyebar dan menguat, sekelompok orang dari kalangan suku Aus dan Khazraj menampakkan keimanan dan menyembunyikan kekufuran agar wibawa mereka tetap ada, darah mereka terjaga dan harta mereka aman. Allah menyebutkan sifat-sifat mereka yang dapat diketahui agar semua hamba mewaspadai dan mengetahui mereka secara pasti seraya berfirman, “Apabila orang-orang munafik datang kepadamu, mereka berkata,” seraya mendustakan “Kami bersaksi bahwa sesungguhnya kamu benar-benar Rasul Allah.” Kesaksian orang-orang munafik ini adalah sebagai kedustaan dan kemunafikan padahal mereka tidak perlu bersaksi untuk menegaskan RasulNya karena sesungguhnya Allah “mengetahui bahwa sesungguhnya kamu benar-benar RasulNya; dan Allah mengetahui bahwa sesungguhnya orang-orang munafik itu benar-benar orang pendusta,” dalam perkataan dan pengakuan mereka, serta perkataan yang mereka ucapkan itu bukan yang sebenarnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Munafiqun ayat 1: Ketika orang-orang munafik datang kepada Rasulullah ﷺ di majelis beliau, mereka berkata dengan maksud mendustakan dan menipu : Kami bersaksi wahai Muhammad ﷺ bahwa engkau Rasul yang diutus Allah dengan benar. Dan Allah mengetahui bahwa engkau adalah utusan Allah; Engkau tidak butuh persaksian mereka (orang-orang munafik), yang kemudian mereka berdusta kepada Allah dengan perkataan “kami bersaksi”; Maka Allah berkata : Allah bersaksi bahwa kalian wahai orang-orang munaafik sungguh pendusta; Karena Allah mengetahi bahwa mereka menyembunyikan kedustaan, dan mereka tidak meyakini sebagaimana persaksian mereka kepada Rasul."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Imam Bukhari meriwayatkan dengan sanadnya yang sampai kepada Zaid bin Arqam ia berkata, “Aku berada dalam pasukan perang, lalu aku mendengar Abdullah bin Ubay berkata, “Janganlah kamu berinfak kepada orang-orang yang berada di dekat Rasulullah shallallahu 'alaihi wa sallam sehingga mereka bubar (meninggalkan Rasulullah shallallahu 'alaihi wa sallam). Sungguh, jika kita pulang dari sisi Beliau, pastilah orang yang kuat akan mengusir orang yang lemah dari sana.\" Maka aku ceritakan hal itu kepada pamanku atau ke Umar, lalu dia menceritakannya kepada Nabi shallallahu 'alaihi wa sallam, kemudian Beliau memanggilku dan aku menceritakan kepadanya, maka Rasulullah shallallahu 'alaihi wa sallam mengirimkan orang kepada Abdullah bin Ubay dan kawan-kawannya, lalu mereka bersumpah bahwa mereka tidak berkata demikian, sehingga Rasulullah shallallahu 'alaihi wa sallam menganggapku dusta dan membenarkannya, sehingga aku merasakan kesedihan yang belum pernah aku rasakan sebelumnya. Aku pun duduk di rumah, lalu pamanku berkata kepadaku, “Engkau tidak ingin Rasulullah shallallahu 'alaihi wa sallam mendustakanmu dan membencimu,” maka Allah Ta’ala menurunkan ayat, “Apabila orang-orang munafik datang kepadamu (Muhammad),…dst.” Lalu Nabi shallallahu 'alaihi wa sallam mengirim orang kepadaku untuk membacakan ayat dan berkata, “Sesungguhnya Allah telah membenarkan kamu wahai Zaid.” (HR. Bukhari dan Muslim) Ketika Nabi shallallahu 'alaihi wa sallam tiba di Madinah, jumlah kaum muslimin di Madinah cukup banyak dan Islam pun semakin kuat di sana, maka di antara penduduknya yang belum memeluk Islam menampakkan keimanan di luar dan menyembunyikan kekafiran di batinnya agar kedudukannya tetap terjaga, darahnya tetap terpelihara dan harta mereka dapat terjaga, maka Allah Subhaanahu wa Ta'aala menyebutkan sifat mereka agar diketahui sehingga kaum mukmin dapat bersikap waspada terhadap mereka dan berada di atas pengetahuan. Dengan lisan mereka yang berbeda dengan hatinya. Persaksian dari kaum munafik ini adalah dusta dan nifak, padahal untuk memperkuat Rasul-Nya tidak dibutuhkan persaksian mereka. Dalam ucapan dan dakwaan mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Munafiqun Ayat 1",
    "description": "Apabila orang-orang munafik di madinah datang kepadamu Muhammad, lalu mereka berkata di hadapanmu, 'kami mengakui bahwa engkau adalah rasul Allah, ' untuk menunjukkan bahwa mereka beriman kepada Allah dan rasul-Nya, maka janganlah engkau percaya terhadap ucapan mereka. Dan sebaliknya yakinlah, Allah mengetahui bahwa engkau benar-benar rasul-Nya dengan menurunkan wahyu dan melindungimu; dan Allah menyaksikan dengan menunjukkan bukti kepada kamu bahwa orang-orang munafik itu benar-benar pendusta tentang pengakuannya bahwa mereka beriman kepada Allah dan rasul-Nya. 2. Ayat ini menjelaskan salah satu sifat orang munafik. Mereka menjadikan sumpah-sumpah mereka di hadapan nabi dan orang-orang beriman sebagai perisai, yaitu mereka mengaku beriman hanya untuk menjaga agar diri mereka tidak dibunuh atau ditawan dan harta mereka tidak dirampas, ketika terjadi perang antara orang-orang islam dengan orang-orang kafir. Setelah keadaan aman, lalu mereka menghalang-halangi masyarakat dari jalan Allah, yaitu dari beriman kepada Allah dan rasul-Nya. Sungguh, betapa buruknya apa yang telah mereka kerjakan, pura-pura beriman untuk menyelamatkan diri, tetapi berusaha menghalangi masyarakat agar tidak beriman."
  }
]