[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "10. Infakkanlah (wahai orang-orang yang beriman) kepada Allah dan RasulNya, sebagian dari apa yang Kami berikan kepada kalian di jalan-jalan kebaikan dengan bersegera sebelum salah seorang di antara kalian dijemput oleh kematian, melihat tanda-tanda dan alamat-alamatnya, lalu dia menyesal dan berkata, “Wahai Tuhanku, berikanlah aku kesempatan, tundalah kematianku barang beberapa saat, akau akan menyedekahkan hartaku dan aku akan menjadi orang-orang shalih yang bertakwa.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Dan nafkahkanlah harta yang direzekikan oleh Allah kepada kalian sebelum datang kematian kepada salah seorang di antara kalian, lalu ia berkata kepada Rabbnya, “Wahai Rabbku, kenapa Engkau tidak menunda kematianku sebentar saja, sehingga aku bisa menyedekahkan hartaku di jalan Allah dan aku menjadi bagian dari hamba-hamba Allah yang saleh, yang amal perbuatan mereka baik."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. وَأَنفِقُوا۟ مِن مَّا رَزَقْنٰكُم (Dan infakkanlah sebagian dari apa yang telah Kami berikan kepadamu) Yakni berinfaklah sebagian rezeki yang telah Kami berikan kepadamu dalam jalan kebaikan. Pendapat lain mengatakan yang dimaksud adalah dengan menunaikan zakat yang diwajibkan. مِّن قَبْلِ أَن يَأْتِىَ أَحَدَكُمُ الْمَوْتُ(sebelum kematian datang kepada salah seorang di antara kamu) Dengan datangnya sebab-sebab kematian atau tanda-tandanya. فَيَقُولَ رَبِّ لَوْلَآ أَخَّرْتَنِىٓ إِلَىٰٓ أَجَلٍ قَرِيبٍ(lalu dia berkata, “Ya Tuhanku, sekiranya Engkau berkenan menunda (kematian)ku sedikit waktu lagi) Yakni tidakkah Engkau memberiku kesempatan lagi dan menunda kematianku sebentar saja. فَأَصَّدَّقَ(maka aku dapat bersedekah) Yakni sehingga aku dapat menyedekahkan hartaku. وَأَكُن مِّنَ الصّٰلِحِينَ(dan aku akan termasuk orang-orang yang saleh)"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10. Wahai orang-orang mukmin, nafkahkanlah harta kalian yang kami rejekikan untuk kalian itu kepada jalan kebaikan sebelum tanda-tanda kematian dan petunjuk kematian (datang). Lalu dia berkata: “Ya Tuhan, kenapa tidak Engkau tangguhkan kematianku di waktu yang dekat bukan di waktu yang jauh, maka aku akan menyedekahkan harta bendaku dengan berzakat dan sedekah-sedekah lainnya. Sehingga aku akan termasuk orang-orang yang mengerjakan amal shalih, yaitu orang-orang yang mengerjakan apa yang membuatMu meridhainya seperti haji dan lain-lain.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Infakkanlah sebagian dari apa yang telah Kami anugerahkan kepada kalian sebelum kematian datang kepada salah seorang di antara kalian. Lalu dia berkata,“Ya Tuhanku, sekiranya Engkau menangguhkanku} mengapa Engkau tidak menangguhkanku {sampai waktu yang dekat, aku akan akan bersedekah} aku akan bersedekah {dan aku akan termasuk orang-orang shalih”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "10. Firman Allah, “Dan belanjakanlah sebagian dari apa yang telah Kami berikan kepadamu.” Nafkah ini mencakup nafkah wajib seperti zakat, kaffarat, nafkah untuk istri, budak dan lainnya, serta nafkah sunnah seperti nafkah untuk berbagai kemaslahatan. Allah berfirman, “Sebagian dari apa yang telah Kami berikan kepadamu,” agar hal itu memberitahukan bahwa Allah tidsak membebankan nafkah yang memberatkan hamba-hambaNya. Untuk itu, mereka hendaknya mensyukuri karunia yang didapatkan dengan berbagi kepada saudara-saudaranya yang memerlukan uluran tangan. Segeralah lakukan hal itu sebelum maut datang menjemput, karena ketika kematian datang, manusia tidak mungkin sedikit pun bisa melakukan kebaikan. Karena itu Allah berfirman, “Sebelum datang kematian kepada salah seorang di antara kamu; lalu ia berkata,” seraya menyesali perbuatan yang seharusnya bisa dilakukan di saat-saat masih bisa dilakukan dan hal itu mustahil, “Ya Rabbku, mengapa Engkau tidak menangguhkan (kematian) ku sampai waktu yang dekat,” agar aku bisa melakukan apa yang tidak sempat aku kerjakan, “yang menyebabkan aku dapat bersedekah,” dari hartaku yang bisa menyelamatkanku dari azab dan menyebabkan aku berhak mendapatkan pahala yang besar, “dan aku termasuk orang-orang yang shalih,” dengan mengerjakan perintah-perintah dan menjauhi seluruh larangan, termasuk melakukan haji dan lainnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Munafiqun ayat 10: Allah menganjurkan orang-orang yang beriman untuk berinfak di jalan Allah, Allah berkata : Infakkanlah oleh kalian wahai orang-orang yang beriman karena Allah dan Rasul-Nya sebagian dari harta yang diberikan Allah. Bersyukurlah atas nikmat Allah yang diberikan kepada kalian; Sebelum maut menjemputmu dan didapati tanda-tandanya, maka ketika turun maut kepada kalian, kalian berkata : Wahai Rabbku kenapa Engkau tidak menangguhkan kami dan mengakhirkannya sampai aku bersedekah dengan hartaku dan aku bisa menjadi orang yang bertakwa dan shalih. Dan dapat diambil manfaat dari ayat ini, bahwa sedekah adalah sebab keshalihan dan jujurnya keimanan, sebagaimana maksud dari infak dalam ayat, ia adalah infak dalam kebaikan atas keumumannya; Maka masuk di dalamnya berinfak kepada fakir dan orang yang miskin dan membangun masjid dan mempersiapkan para mujahidin yang berperang di jalan Allah dan mendukung jalan-jalan yang baik dengan berbagai macamnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Termasuk dalam hal ini nafkah/infak yang wajib maupun yang sunat. Yang wajib seperti zakat, kaffarat, nafkah kepada istri, dsb. Sedangkan yang sunat seperti mengorbankan harta untuk segala yang bermaslahat. Hal ini menunjukkan bahwa nafkah yang Allah bebankan agar hamba mengeluarkannya tidaklah menyusahkan mereka, bahkan Allah memerintahkan mereka agar mengeluarkan sebagian dari rezeki yang Allah karuniakan kepada mereka, dimana Dia telah mempermudahnya untuk mereka dan mempermudah sebab-sebabnya. Oleh karena itu, hendaknya mereka bersyukur kepada Allah yang telah memberikan kepada mereka rezeki itu, yaitu dengan membantu saudara-saudara mereka yang memerlukan dan bersegera kepadanya sebelum datang kematian yang jika tiba, maka seorang hamba tidak dapat mengejar lagi amal saleh yang telah dilalaikannya. Meminta agar dikembalikan lagi ke dunia. Agar aku dapat mengejar amal saleh yang telah aku lalaikan seperti zakat ketika hartanya telah mencapai nishab (ukuran wajib zakat) dan haji ketika sudah mampu. Sehingga aku dapat selamat dari azab dan dapat memperoleh banyak pahala. Dengan mengerjakan perkara yang diperintahkan dan menjauhi larangan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Munafiqun Ayat 10",
    "description": "Ayat ini menghimbau orang-orang beriman untuk memfungsikan harta dengan benar. Dan infakkanlah sebagian dari apa yang telah kami berikan kepadamu untuk kepentingan duafa, fasilitas umum, dan fasilitas sosial sebelum kematian datang kepada salah seorang di antara kamu sehingga kamu tak sempat berinfak; lalu dia berkata setelah kematian terjadi, menyesalinya, 'ya tuhanku, sekiranya engkau berkenan menunda kematianku sedikit waktu lagi, maka aku dapat bersedekah dengan hartaku ini dan aku dengan demikian akan termasuk orang-orang yang saleh, karena menjadi dermawan. 11. Dan Allah tidak akan menunda kematian seseorang apabila waktu kematiannya telah datang dengan memperpanjang hidupnya. Dan Allah mahateliti dengan cermat tentang apa yang kamu kerjakan."
  }
]