[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "11. Allah tidak akan menunda kematian satu jiwa bila waktunya sudah tiba dan uisianya habis. Allah Mahateliti terhadap apa yang kalian lakukan, baik kebaikan maupun keburukan, dan akan membalas kalian atasnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Dan Allah -Subhānahu wata'āla- sekali-kali tidak menunda kematian seseorang bila telah tiba masanya dan habis umurnya. Dan Allah Maha mengetahui apa yang kalian lakukan, tidak ada sesuatupun dari perbuatan kalian yang luput dari-Nya, dan Dia akan membalas kalian atas perbuatan tersebut. Jika baik, dibalas dengan kebaikan, jika buruk maka akan dibalas dengan keburukan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "11. Dan Allah tidak akan menunda kematian seorangpun jika ajal yang telah ditentukan baginya telah datang. Dan Allah Maha Mengetahui segala kebaikan atau keburukan yang kalian berbuat, kemudian Allah akan membalas perbuatan itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "11. وَلَن يُؤَخِّرَ اللَّـهُ نَفْسًا إِذَا جَآءَ أَجَلُهَا ۚ (Dan Allah tidak akan menunda (kematian) seseorang apabila waktu kematiannya telah datang) Yakni jika ajalnya telah datang dan umurnya telah habis. وَاللَّـهُ خَبِيرٌۢ بِمَا تَعْمَلُونَ(Dan Allah Mahateliti terhadap apa yang kamu kerjakan) Tidak ada amal yang tersembunyi dari-Nya, kemudian Allah akan membalas kalian sesuai dengan amalan tersebut."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Allah tidak akan menangguhkan kematian seseorang jika ajalnya yang termaktub sudah datang dan umurnya telah berakhir. Allah Maha mengetahui apa yang kalian kerjakan. Tidak ada satupun yang dapat tersembunyi dariNya, maka Dia akan membalas kalian sesuai perbuatan kalian. Tirmidzi dan Ibnu Jarir dari Ibnu Abbas mengatakan bahwa Rasulallah SAW bersabda: “Barangsiapa memiliki harta yang cukup untuk menunaikan ibadah haji ke Baitullah atau menunaikan zakat dan dia belum menggunakannya untuk hal itu, maka dia akan meminta agar dikembailikan kehidupannya (untuk melaksanakan hal itu) ketika kematian (datang)”, lalu seorang laki-laki berkata: “Wahai Ibnu Abbas, bertakwalah kepada Allah, karena sesungguhnya orang yang meminta dikembalikan (hidupnya) itu hanyalah orang kafir” Lalu Ibnu Abbas berkata: ”Aku akan membacakan ayat Al-Qur’an untuk kalian tentang hal itu {Yaa ayyuhalladziina aamanuu laa tulhikum …}[9] Sampai akhir surah”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah tidak akan menunda seseorang apabila waktu kematiannya} waktu kematiannya {telah datang. Allah Maha Mengetahui terhadap apa yang kalian kerjakan}"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11. Ini adalah permintaan dan harapan hampa yang waktunya telah berlalu dan tidak mungkin bisa dilakukan. Karena itu Allah berfirman, “Dan Allah sekali-kali tidak akan menangguhkan (kematian) seseorang apabila datang waktu kematiannya” yang telah dipastikan, “Dan Allah Maha Mengetahui apa yang kamu kerjakan,” yang baik dan yang buruk. Allah akan membalas kalian berdasarkan pengetahuanNya tentang niat dan amal kalian."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Munafiqun ayat 11: Allah menjelaskan dengan ini semua yang ia menginginkan untuk menomor sekiankan Allah, agar jujur (dalam keimanannya). Allah berkata : Ketahuilah dengan yakin bahwa Allah tidak mengakhirkan seorangpun, jika telah datang waktu kematiannya dan telah usai urusannya, kemudian Allah mengabarkan bahwa nampak oleh-Nya atas semua amalan seorang hamba secara dzahir maupun bathin, dan Dia akan membalas mereka dengan balasan yang sempurna. Pada ayat ini terdapay anjuran untuk mempersiapkan amal sebelum datang ajal, dan atas manusia untuk berbekal di hari kiamat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Baik atau buruk, lalu Dia membalasnya sesuai yang Dia ketahui dari kamu, yakni dari niat dan amalmu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Munafiqun Ayat 11",
    "description": "Dan Allah tidak akan menunda kematian seseorang apabila waktu kematiannya telah datang dengan memperpanjang hidupnya. Dan Allah mahateliti dengan cermat tentang apa yang kamu kerjakan. 1. Apa yang ada di langit, bintang, bulan, matahari, dan seluruh planet; dan demikian juga apa yang ada di bumi, daratan, lautan, gunung, lembah, hewan, dan tumbuh-tumbuhan; seluruhnya senantiasa bertasbih kepada Allah dengan cara masing-masing; milik-Nya semua kerajaan, kekuasaan, dan kewenangan yang tiada terbatas, dan bagi-Nya pula segala puji yang sempurna; dan dia mahakuasa atas segala sesuatu dengan kekuasaan yang tak terbatas, tetapi tidak sewenang-wenang."
  }
]