[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "2-3. Orang-orang munafik itu menjadikan sumpah yang mereka ucapkan sebagai tameng dan pelindung bagi mereka dari hukuman dan siksa dunia, mereka menghalang-halangi diri mereka dan orang-orang dari jalan Allah yang lurus. Sesungguhnya apa yang mereka lakukan itu sungguhlah buruk. Hal itu karena mereka mengaku beriman secara lahir kemudian kafir secara batin, maka Allah menutup hati mereka disebabkan kekafiran mereka; sehingga mereka tidak mengerti apa yang mengandung kemaslahatan bagi mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Mereka menjadikan sumpah-sumpah yang mereka ikrarkan untuk menguatkan pengakuan iman mereka sebagai perisai dan penjaga bagi mereka dari pembunuhan dan ditawan, dan mereka mengalihkan manusia dari keimanan dengan cara menghembuskan keraguan dan kabar bohong. Sungguh sangat buruk apa yang mereka kerjakan berupa kemunafikan dan sumpah-sumpah dusta."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "2-3. Orang-orang munafik itu menjadikan sumpah dusta mereka sebagai pelindung agar mereka tidak dibunuh atau ditawan; kemudian mereka menghalangi diri mereka sendiri dan orang lain dari agama Allah. Sungguh buruk kejahatan-kejahatan yang telah mereka lakukan. Keburukan ini karena mereka mengutarakan keimanan dengan lisan mereka saja, akan tetapi hati mereka tetap kafir; maka Allah menutup hati mereka akibat kekafiran itu, sehingga mereka enggan mengikuti kebenaran."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. اتَّخَذُوٓا۟ أَيْمٰنَهُمْ جُنَّةً (Mereka menjadikan sumpah-sumpah mereka sebagai perisai) Yakni mereka ingin menjadikan sumpah mereka itu sebagai perlindungan dari kalian dan sebagai penghalang agar tidak dibunuh atau ditawan. فَصَدُّوا۟ عَن سَبِيلِ اللَّـهِ ۚ( lalu mereka menghalang-halangi (manusia) dari jalan Allah) Yakni mereka melarang orang lain untuk beriman, berjihad, dan menjalankan ketaatan lain dengan menyebarkan keraguan dan tuduhan terhadap kenabian Muhammad. إِنَّهُمْ سَآءَ مَا كَانُوا۟ يَعْمَلُونَ (Sungguh, betapa buruknya apa yang telah mereka kerjakan) Yaitu kemunafikan dan perbuatan mereka menghalangi-halangi orang lain."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Ambillah keimanan palsu mereka untuk mencegah dan menghalangi mereka dari pembunuhan, pengambilan tahanan dan pencurian harta benda. Mereka mencegah manusia untuk masuk Islam. Sesungguhnya mereka mengotori perbuatan mereka sendiri yang berupa kekufuran, pengrusakan, kemunafikan, dan penolakan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka menjadikan sumpah-sumpah mereka sebagai perisai} penghalang dan pelindung bagi mereka dari pembunuhan dan penawanan {lalu mereka menghalang-halangi dari jalan Allah. Sangat buruk} sangat buruk {apa yang selalu mereka kerjakan itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2. “Mereka itu menjadikan sumpah mereka sebagai perisai,” yakni, sebagai tameng yang mereka jadikan sebagai penghalang agar tidak disebut sebagai munafik, mereka menghalangi diri mereka dari jalan Allah dan menghalangi orang lain yang statusnya tidak jelas. “Sesungguhnya amat buruklah apa yang telah mereka kerjakan.” Karena menampakkan keimanan, menyembunyikan kekufuran dan mereka bersumpah atas hal itu serta menyatakan kedustaan mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Munafiqun ayat 2: Ketahuilah wahai Nabi ﷺ, mereka orang-orang munafik menjadikan keimanan mereka dusta, dimana mereka bersumpah dengannya untuk menjaga dan menyembunyikan agar mereka tidak dituduh dengan keburukan, dan agar tidak diadzab. Kemudian mereka melalui keimanan (palsu) ini, mereka menyembunyikan kekufuran mereka, dan mereka mencegah manusia yang menginginkan untuk enggan duduk dengan kaum muslimin untuk masuk islam, dan mencegah manusia yang menginginkan berinfaq di jalan Allah dan mereka juga menginginkan agar manusia ragu akan kerisalahan Nabi ﷺ. Ketahuilah bahwa mereka orang-orang munafik lebih buruk kekafirannya dan kesesatannya dari kafir yang jelas kekafirannya. Oleh karenanya adzab mereka di akhirat di neraka lapisan paling bawah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mereka bersumpah bahwa mereka beriman adalah untuk menjaga diri dan harta mereka agar jangan dibunuh atau ditawan atau dirampas hartanya. Karena menampakkan keimanan dan menyembunyikan kekafiran, bersumpah berada di atas keimanan dan memberikan kesan bahwa mereka benar dalam sumpahnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Munafiqun Ayat 2",
    "description": "Ayat ini menjelaskan salah satu sifat orang munafik. Mereka menjadikan sumpah-sumpah mereka di hadapan nabi dan orang-orang beriman sebagai perisai, yaitu mereka mengaku beriman hanya untuk menjaga agar diri mereka tidak dibunuh atau ditawan dan harta mereka tidak dirampas, ketika terjadi perang antara orang-orang islam dengan orang-orang kafir. Setelah keadaan aman, lalu mereka menghalang-halangi masyarakat dari jalan Allah, yaitu dari beriman kepada Allah dan rasul-Nya. Sungguh, betapa buruknya apa yang telah mereka kerjakan, pura-pura beriman untuk menyelamatkan diri, tetapi berusaha menghalangi masyarakat agar tidak beriman. 3. Orang-orang munafik melakukan perbuatan keji yang demikian itu karena sesungguhnya mereka telah mengaku beriman secara lisan, kemudian menjadi kafir, karena iman mereka hanya di mulut; maka hati mereka dikunci oleh diri mereka sendiri sehingga mereka tidak dapat mengerti pentingnya iman dan iman pun tidak akan pernah masuk ke dalam hati mereka karena terkunci."
  }
]