[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "4. Apabila kamu melihat orang-orang munafik itu, penampilan dan gaya mereka membuatmu kagum, bila mereka berkata-kata, kamu mendengarkan pembicaraan mereka, karena lisan mereka fasih, tetapi karena hati mereka kosong dari iman dan akal mereka kosong dari pemahaman dan ilmu yang berguna, maka mereka seperti kayu yang tersandar di dinding yang tidak punya kehidupan, mereka menyangka setiap suara tinggi diarahkan kepada mereka dan merugikan mereka, karena mereka menyadari hakikat dari keadaan mereka, di samping ketakutan mereka yang luar biasa yang bersamayam di dalam hati mereka. Mereka adalah para musuh sejati dengan permusuhan yang sangat kuat kepadamu dan orang-orang beriman, maka waspadailah mereka. Allah menghinakan dan mengusir mereka dari rahmatNya; bagaimana mereka dipalingkan dari kebenaran kepada kemunafikan dan kesesatan yang mereka pegang?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Jika engkau melihat mereka -wahai orang yang melihat- niscaya kondisi dan bentuk tubuh mereka menjadikan kamu kagum dikarenakan kondisi mereka enak dipandang dan sejahtera. Jika mereka berbicara, niscaya kamu mendengarkan pembicaraan mereka karena mengandung keindahan bahasa. Seakan-akan mereka di dalam majlismu -wahai Rasul- seperti kayu yang tersandar, tidak mengerti apa-apa dan tidak paham. Mereka mengira setiap suara ditujukan kepada mereka dikarenakan rasa takut yang ada pada diri mereka. Mereka itulah musuh yang sesungguhnya maka berhati-hatilah terhadap mereka -wahai Rasul- yang akan menyebarkan rahasiamu dan merencanakan tipu daya terhadapmu. Semoga Allah melaknat mereka, bagaimana mereka terpalingkan dari iman dengan dalil-dalilnya yang jelas dan bukti-buktinya yang terang?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "4. Hai Rasulullah, jika kamu melihat mereka maka kamu akan takjub dengan penampilan mereka; dan jika mereka berbicara, kamu akan mendengar perkataan mereka karena mereka berbicara dengan fasih. Namun mereka seperti kayu yang tersandar di dinding, karena hati mereka kosong dari keimanan dan ilmu yang bermanfaat. Mereka akan mengira setiap suara dan panggilan ditujukan kepada mereka, hal ini karena mereka selalu dalam ketakutan dan kekhawatiran. Mereka benar-benar musuh kalian, maka berhati-hatilah. Semoga Allah menghinakan dan melaknat mereka; bagaimana mereka dapat berpaling dari kebenaran dan berpegang teguh pada kebatilan dan kesesatan?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. وَإِذَا رَأَيْتَهُمْ تُعْجِبُكَ أَجْسَامُهُمْ ۖ (Dan apabila engkau melihat mereka, tubuh mereka mengagumkanmu) Yakni penampilan mereka membuat takjub orang yang melihatnya karena mereka berpenampilan bagus dan rapi. وَإِن يَقُولُوا۟ تَسْمَعْ لِقَوْلِهِمْ ۖ( Dan jika mereka berkata, engkau mendengarkan tutur katanya) Sehingga kalian menyangka perkataan mereka benar karena kefasihan dan kelincahan lisan mereka. Dan Abdullah bin Ubay, pemimpin orang-orang munafik merupakan orang yang fasih, gagah, dan tampan. كَأَنَّهُمْ خُشُبٌ مُّسَنَّدَةٌ ۖ( Mereka seakan-akan kayu yang tersandar) Mereka diserupakan dalam duduk mereka yang bersandar ke dinding di majelis-majelis Rasulullah seperti kayu yang ditancapkan di dinding yang tidak dapat memahami dan tidak mampu mendapatkan ilmu yang bermanfaat. يَحْسَبُونَ كُلَّ صَيْحَةٍ عَلَيْهِمْ ۚ( Mereka mengira bahwa setiap teriakan ditujukan kepada mereka) Dikatakan bahwa orang-orang munafik dalam kekhawatiran dari turunnya ayat al-Qur’an yang membeberkan aib mereka atau ayat yang membolehkan untuk membunuh dan merampas harta mereka. هُمُ الْعَدُوُّ فَاحْذَرْهُمْ ۚ( Mereka itulah musuh (yang sebenarnya), maka waspadalah terhadap mereka) Yakni hati-hatilah jika mereka mendapat kesempatan untuk mencelakakanmu, atau mengetahui rahasiamu; sebab mereka adalah mata-mata musuhmu dari orang-orang kafir. قٰتَلَهُمُ اللَّـهُ ۖ( semoga Allah membinasakan mereka) Yakni semoga Allah melaknat mereka. Atau ini merupakan petunjuk bagi orang-orang beriman agar mengatakan kalimat ini bagi mereka. أَنَّىٰ يُؤْفَكُونَ(Bagaimanakah mereka dapat dipalingkan (dari kebenaran)?) Yakni mengapa mereka berpaling dari kebenaran menuju kekafiran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Jika kamu melihat mereka, kamu akan terkejut dengan badan mereka yang besar dan ketampanan/kecantikan mereka. Jika mereka berbicara dan kamu mendengarkan ucapan mereka, kamu akan terkejut dengan keindahan tata bahasa yang mereka gunakan untuk menunjukkan kefasihan dan kejelasan ucapan mereka, seakan-akan mereka berada (sejajar) di posisi Rasulallah SAW, seperti kayu-kayu yang disandarkan pada dinding, karena mereka tidak memiliki pemahaman dan ilmu yang bermanfaat. Mereka beranggapan bahwa setiap suara yang ditunjukkan kepada mereka itu membuat mereka ciut dan takut. Mereka adalah musuh-musuhmu wahai Nabi dan bagi kaum mukmin (Kata Al-‘Aduwwu digunakan dalam bentuk mufrad dan jamak). Allah melaknat mereka dan mengusir mereka dari rahmatNya. Bagaimana bisa mereka menjauh dari kebenaran dan keimanan setelah bukti-bukti nyata telah ditegakkan (ditunjukkan)?!"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apabila kamu melihat mereka, tubuh mereka akan mengagumkanmu} bentuk mereka akan mengagumkanmu {Jika mereka berkata, kamu mendengarkan perkatannya} kamu mendengarkan perkataan mereka karena kefasihan mereka {Seakan-aakan mereka itu kayu yang tersandar} seakan-akan mereka itu kayu yang disandarkan pada dinding {Mereka mengira} berprasangka {bahwa setiap teriakan itu atas mereka} setiap suarau yang tinggi itu ditujukan atas mereka, karena ketakutan dan kepengecutan mereka {Mereka itulah musuh. Maka waspadalah terhadap mereka. Allah membinasakan mereka} Allah melaknat mereka {Bagaimanakah mereka dapat dipalingkan} bagaimana mereka dipalingkan dari keimanan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4. “Dan apabila kamu melihat mereka, tubuh-tubuh mereka menjadikan kamu kagum,” karena kekar dan kuatnya, “dan jika mereka berkata, kamu mendengarkan perkataan mereka,” maksudnya karena kepandaian mereka dalam berbicara, engkau merasa enak mendengar perkataan mereka. Perkataan dan penampilan tubuh mereka membuat kalian kagum. Tapi di balik itu tidak ada akhlak baik dan petunjuk baik sama sekali, karena itu Allah berfirman, “Mereka seakan-akan kayu yang tersandar,” yang tidak ada manfaatnya dan hanya menimbulkan mudarat. “Mereka mengira bahwa tiap-tiap teriakan yang keras ditujukan kepada mereka.” Hal itu disebabkan karena sifat pengecut, takut, lemah dan ragunya hati mereka, mereka khawatir rahasia mereka terbongkar. Mereka itu adalah “musuh” yang sebenarnya, karena musuh yang nampak dan bisa dibedakan itu lebih ringan daripada musuh yang tidak dapat dirasakan keberadaannya. Musuh semacam ini adalah penipu dan pembuat makar. Ia mengira sebagai penolong padahal ia adalah musuh yang nyata. “Maka waspadalah terhadap mereka, semoga Allah membinasakan mereka. Bagaimanakah mereka sampai dipalingkan (dari kebenaran).” Maksudnya bagaimanakah mereka bisa dipalingkan dari agama Islam setelah bukti-bukti nyata kokoh, setelah tanda-tandanya tegas terhadap kekafiran yang hanya membuahkan kerugian dan kesengsaraan bagi mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Munafiqun ayat 4: Allah mengabarkan kepada Nabi-Nya dan berkata : Maka jika engkau melihat mereka orang-orang munafik, engkau akan takjub dengan kondisi mereka, pandangan mereka dan diri-diri mereka, maka jika engkau berbicara dengan mereka, dengarkan ucapan mereka; Sungguh mereka fasih dan indah apa yang mereka ucapkan, dan hakikatnya diri mereka kosong dari ilmu dan rasa takut kepada Allah, sebagaiman kayu yang disandarkan ke tembok, tidak ada manfaatnya, kemudian engkau tidak akan melihat ketika mereka mendengar suara yang tinggi dan bergabung kepada barisan prajurit, mereka ini orang-orang yang pengecut dan rendahan. Ketahuilah wahai Nabi Allah, bahwa mereka orang-orang munafik mereka hakikatnya adalah musuh bagimu dan bagi orang-orang yang beriman; Maka berhati-hatilah dan peringatkan orang-orang yang beriman dari mereka, Allah melaknat dan menghinakan mereka; Karena sebab jalan mereka dan perbuatan mereka yang buruk, dan sungguh menakjubkan, bagaimana mereka akan melihat kebenaran secara jelas di hadapan mereka dimana mereka kemudian berpaling dari kebenaran menuju kepada kesesatan dan kemunafikan ?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Karena bagusnya kata-kata mereka dan enak didengar. Tubuh dan ucapan mereka mengagumkan, namun di balik itu tidak ada akhlak yang utama dan petunjuk sedikit pun. Mereka diumpamakan seperti ‘kayu yang tersandar’ untuk menyatakan sifat mereka yang buruk meskipun tubuh mereka bagus-bagus dan pandai berbicara, akan tetapi sebenarnya otak mereka adalah kosong tidak dapat memahami kebenaran seakan-akan kayu yang tersandar ke tembok yang tidak ada manfaatnnya. Karena mereka takut turun ayat yang membuka rahasia mereka atau menghalalkan darah dan harta mereka. Mereka takut kalau isi hati mereka terbongkar. Karena musuh yang menampakkan dirinya jauh lebih ringan daripada musuh dalam selimut, yang tidak diketahui sebagai musuh, dimana ia melakukan tipu daya dan membuat makar diam-diam. Karena mereka akan menyebarkan rahasiamu kepada orang-orang kafir. Bisa juga maksudnya, dipalingkan dari beriman setelah tegaknya bukti. Atau maksudnya, bagaimana mereka mereka dapat dipalingkan dari agama Islam setelah tegak bukti dan dalilnya serta jelas rambu-rambunya beralih kepada kekafiran yang tidak memberikan apa-apa kepada mereka selain kerugian dan kesengsaraan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Munafiqun Ayat 4",
    "description": "Dan apabila engkau, nabi Muhammad, melihat mereka secara lahiriah, tubuh mereka akan mengagumkanmu, karena penampilan mereka menarik. Dan jika mereka berkata tentang agama dan kemasyarakatan, engkau akan mendengarkan tutur-katanya baik dan benar seperti orang bijak. Mereka seakan-akan kayu yang tersandar, benda yang memiliki bentuk, tetapi tak bernyawa, penampilan mereka menarik dan pandai berorasi, tetapi otak mereka kosong tidak dapat memahami kebenaran. Mereka mengira bahwa setiap teriakan, yakni ungkapan amar makruf dan nahi mungkar yang diucapkan rasulullah dan para sahabat, ditujukan kepada mereka, karena hati kecil mereka merasa dan menyadari kesalahan mereka. Mereka itulah musuh yang sebenarnya, jika topeng mereka dibuka. Maka waspadalah terhadap mereka, wahai nabi dan orang-orang beriman; Allah membinasakan mereka di dunia melalui tanganmu dan di akhirat dengan dimasukkan ke dalam neraka. Bagaimanakah mereka dapat dipalingkan dari iman, padahal mereka menyaksikan turunnya Al-Qur'an kepada nabi'5. Ayat ini menjelaskan penolakan orang-orang munafik, apabila diajak beriman dan memohon ampun kepada Allah. Dan apabila dikatakan kepada mereka dalam berbagai kesempatan, 'marilah beriman kepada Allah dan rasul-Nya, agar rasulullah memohonkan ampunan bagimu dari segala kesalahan kamu, ' mereka membuang muka, karena keengganan mereka untuk beriman; dan engkau lihat mereka berpaling dari ajakanmu dengan menyombongkan diri, karena merasa dirinya hebat."
  }
]