[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "5. Apabila dikatakan kepada orang-orang munafik itu, “Datanglah dengan bertaubat dan meminta maaf dari apa yang telah kalian lakukan berupa kata-kata buruk dan ucapan rendah, Rasulullah akan meminta ampunan kepada Allah bagi kalian dan maafNya bagi dosa-dosa kalian, mereka memiringkan kepala-kepala mereka dan menggerakannya dengan kesombongan dan penghinaan. Kamu wahai Rasul, melihat mereka berpaling darimu dengan penuh kesombongan dan penolakan untuk melakukan apa yang dituntut kepada mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Dan jika dikatakan kepada orang-orang munafik, “Marilah menghadap kepada Rasulullah sambil meminta maaf atas apa yang telah kalian perbuat agar beliau memohonkan ampunan kepada Allah bagi kalian atas dosa-dosa kalian.” Mereka memalingkan kepala mereka sebagai penghinaan dan cemoohan. Kalian melihat mereka berpaling dari apa yang diperintahkan kepada mereka sambil menyombongkan diri tidak menerima kebenaran dan tidak tunduk kepada kebenaran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "5. Jika para sahabat menganjurkan mereka untuk datang kepada Rasulullah dalam keadaan bertaubat, agar beliau meminta ampunan dari Allah bagi mereka; maka mereka akan meanggukkan kepala mereka sebagai bentuk hinaan dan kebebalan mereka di atas kekafiran, dan kamu akan melihat mereka enggan beristighfar dan bertaubat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. وَإِذَا قِيلَ لَهُمْ تَعَالَوْا۟ يَسْتَغْفِرْ لَكُمْ رَسُولُ اللَّـهِ لَوَّوْا۟ رُءُوسَهُمْ (Dan apabila dikatakan kepada mereka (orang-orang munafik), “Marilah (beriman), agar Rasulullah memohonkan ampunan bagimu.” Mereka membuang muka) Mereka menggelengkan kepala mereka untuk mengolok-olok dan karena mereka tidak ingin dimohonkan ampun. وَرَأَيْتَهُمْ يَصُدُّونَ(dan engkau melihat mereka berpaling) Yakni berpaling dari Rasulullah. وَهُم مُّسْتَكْبِرُونَ(menyombongkan diri) Yakni enggan untuk mendatangi Rasulullah dan meminta untuk dimohonkan ampun karena kesombongan mereka, sebab mereka memandang diri mereka hina jika melakukan itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Ketika dikatakan kepada orang-orang munafik: “Marilah beriman kalian, maka Rasulullah akan memintakan ampun untuk kalian dari apa yang kalian lakukan berupa dosa! Kemudian mereka memalingkan wajah mereka dari pembicaraan dengan sombong. Kamu akan mendapati mereka menolak apa yang kamu bicarakan dan kamu serukan kepada mereka yaitu permohonan ampun (darimu). Mereka adalah orang-orang yang enggan bertaubat. Ibnu Jarir dari Qatadah berkata: “Dikatakan kepada Abdullah anak ayahku: “Jika datang kepadamu Nabi SAW, maka beliau akan memintakan ampun untukmu”, kemudian dia memalingkan kepalanya, lalu turunlah ayat ini pada ketika itu juga”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apabila dikatakan kepada mereka,“Marilah (beriman) agar Rasulullah memohonkan ampunan bagi kalian” mereka membuang muka mereka} mereka memutar kepala mereka untuk mengejek {dan kamu melihat mereka menolak} berpaling dari apa yang diajakkan kepada mereka {sambil menyombongkan diri"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5. “Dan apabila dikatakan kepada mereka, “ kepada orang-orang munafik, “Marilah (beriman), agar Rasulullah memintakan ampunan bagimu,” dari apa pun yang mereka lakukan agar kondisi mereka membaik dan amal mereka dapat diterima, mereka benar-benar enggan untuk itu dan “membuang muka mereka,” karena enggan meminta doa dari Rasulullah “Dan kamu lihat mereka berpaling” dari kebenaran, karena kebencian mereka terhadap kebenaran itu, “sedang mereka menyombongkan diri” untuk mengikutinya disertai dengki dan membangkang. Inilah kondisi mereka ketika diajak untuk meminta didoakan oleh Rasulullah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Munafiqun ayat 5: Jika dikatakan kepada mereka orang-orang munafik : Kemarilah kalian menuju kepada Rasul-Nya ﷺ, semoga kalian diampuni, dan agar Allah memperbaiki hati-hati kalian dan mensucikan kalian; Dan tidaklah mereka orang-orang munafik kecuali hanya tengak-tengok ke kanan dan ke kiri untuk mengejek dan sombong; Bahkan engkau akan melihat wahai Nabi Allah, mereka menolak dari nasihat kepada mereka dengan kesombongan mereka dan kecongkaan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Terhadap hal yang terjadi padamu agar keadaanmu menjadi baik dan amalmu diterima. Mereka menolak meminta doa kepada Rasulullah shallallahu 'alaihi wa sallam. Dari kebenaran sambil membencinya. Inilah keadaan mereka ketika diajak meminta doa Rasulullah shallallahu 'alaihi wa sallam, dan hal ini termasuk kelembutan Allah dan karamah(kemuliaan)-Nya kepada Rasul-Nya yaitu mereka (kaum munafik) tidak mau datang kepada Beliau agar Beliau memintakan ampunan untuk mereka, dan sama saja bagi mereka baik Rasulullah shallallahu 'alaihi wa sallam memintakan ampunan untuk mereka atau tidak, maka Allah Subhaanahu wa Ta'aala tidak akan mengampuni mereka karena mereka adalah orang-orang yang fasik; yang keluar dari ketaatan kepada Allah dan mengutamakan kekafiran daripada keimanan. Oleh karena itu, istighfar dari Rasulullah shallallahu 'alaihi wa sallam tidaklah bermanfaat bagi mereka meskipun melakukan istighfar untuk mereka sebanyak tujuh puluh kali (lihat At Taubah: 80)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Munafiqun Ayat 5",
    "description": "Ayat ini menjelaskan penolakan orang-orang munafik, apabila diajak beriman dan memohon ampun kepada Allah. Dan apabila dikatakan kepada mereka dalam berbagai kesempatan, 'marilah beriman kepada Allah dan rasul-Nya, agar rasulullah memohonkan ampunan bagimu dari segala kesalahan kamu, ' mereka membuang muka, karena keengganan mereka untuk beriman; dan engkau lihat mereka berpaling dari ajakanmu dengan menyombongkan diri, karena merasa dirinya hebat. 6. Allah mengingatkan nabi bahwa sama saja bagi mereka, orang munafik yang tetap dalam kemunafikannya hingga mati, apakah engkau wahai nabi Muhammad memohonkan ampunan untuk mereka, atau engkau tidak memohonkan ampunan bagi mereka, Allah tetap saja tidak akan mengampuni mereka yang mati dalam keadaan munafik; sesungguhnya Allah tidak akan memberi petunjuk kepada orang-orang yang fasik, yaitu orang-orang yang terus menerus berbuat dosa hingga pikiran dan mereka tertutup dari cahaya Allah."
  }
]