[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "6. Sama saja bagi orang-orang munafik itu, apakah kamu (wahai Rasul) meminta ampunan bagi mereka kepada Allah atau tidak, sesungguhnya Allah tidak akan memaafkan dosa-dosa mereka selamanya, karena mereka bersikukuh dalam kefasikan dan bertahan dalam kekafiran. Sesungguhnya Allah tidak akan membimbing kaum yang kafir kepadaNya kepada iman, yang keluar dari ketaatan kepadaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Sama saja -wahai Rasul- kamu memohonkan ampunan untuk dosa-dosa mereka atau kamu tidak memohonkan ampunan, Allah tidak akan mengampuni dosa-dosa mereka. Sesungguhnya Allah tidak memberikan taufik kepada kaum yang keluar dari ketaatan-Nya dan terus menerus melakukan kemaksiatan terhadap Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "6. Hai Muhammad, sama saja bagi orang-orang munafik itu, apakah kamu meminta ampunan bagi mereka atau tidak, karena Allah tidak akan mengampuni mereka akibat kebebalan mereka di atas kemunafikan. Sungguh Allah tidak akan memberi petunjuk menuju jalan kebenaran bagi orang-orang yang berpaling dari ketaatan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. سَوَآءٌ عَلَيْهِمْ أَسْتَغْفَرْتَ لَهُمْ أَمْ لَمْ تَسْتَغْفِرْ لَهُمْ (Sama saja bagi mereka, engkau (Muhammad) memohonkan ampunan untuk mereka atau tidak engkau mohonkan ampunan bagi mereka) Yakni hal itu tidak bermanfaat bagi mereka akibat kemunafikan dan kekafiran yang terus menerus mereka lakukan. لَن يَغْفِرَ اللَّـهُ لَهُمْ ۚ (Allah tidak akan mengampuni mereka) Selama mereka tetap dalam kemunafikan. إِنَّ اللَّـهَ لَا يَهْدِى الْقَوْمَ الْفٰسِقِينَ(sesungguhnya Allah tidak akan memberi petunjuk kepada orang-orang yang fasik) Yakni orang-orang yang benar-benar keluar dari ketaatan dan tenggelam dalam kemaksiatan. Dan orang-orang munafik yang paling layak untuk masuk dalam golongan orang-orang ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Ada atau tidak adanya permohonan ampun bagi orang-orang munafik itu sama saja. Tidak ada gunanya meminta mereka keluar dari kekufuran dan kemunafikan. Sesungguhnya Allah tidak membantu (menunjukkan) orang-orang yang keluar dari ketaatan kepada Allah dan RasulNya kepada kebenaran dan keimanan. Ibnu Jarir dari Urwah berkata: “Saat ayat {Istaghfil lahum aw laa tastaghfir lahum …}[QS At-Taubah 9/80] diturunkan, Nabi SAW bersabda: “Aku akan menambahkan (permohonan maaf untuk mereka) sebanyak 70 kali” kemudian turunlah ayat ini.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sama saja bagi mereka apakah kamu memohonkan ampunan untuk mereka atau tidak memohonkan ampunan kepada mereka, Sesungguhnya Allah tidak akan mengampuni mereka. Sesungguhnya Allah tidak akan memberi petunjuk kepada kaum yang fasik"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6. Inilah di antara kelembutan dan anugrah kehormatan Allah terhadap RasulNya, karena orang-orang munafik tidak mendatangi Rasulullah untuk dimintakan ampunan, karena “sama saja bagi mereka,” apakah engkau memintakan ampunan untuk mereka atau tidak “Allah sekali-kali tidak akan mengampuni mereka.” Hal itu disebabkan karena mereka adalah kaum fasik, keluar dari jalur ketaatan, lebih memilih kekufuran daripada keimanan. Karena itu permintaan ampunan Rasulullah, andai Rasulullah memintakan ampunan untuk mereka, tidak berguna sama sekali. Ini semakna dengan Firman Allah, “Kamu memohonkan ampun bagi mereka atau tidak kamu mohonkan ampun bagi mereka (adalah sama saja). Kendatipun kamu memohonkan ampun bagi mereka tujuh puluh kali, namun Allah sekali-kali tidak akan memberi ampunan kepada mereka. Yang demikian itu adalah karena mereka kafir kepada Allah dan Rasul-Nya. Dan Allah tidak memberi petunjuk kepada kaum yang fasik.” -At-Taubah: 80-"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Munafiqun ayat 6: Ketahuilah wahai Nabi Allah bahwa mereka orang-orang munafik sama saja di sisimu meskipun engkau meminta ampunan untuk mereka maupun tidak memintakan ampun kepada mereka, dan seandainya mereka datang kepada engkau untuk memnta ampunan, Allah tidak akan mengampuni mereka; Karena sebab mereka telah menjadi orang-orang yang berpenyakit dan berada dalam kesesatan, maka Allah tambahkan dalam hati-hati mereka hilangnya keimanan. Dan ketahuilah bahwa Allah tidak menyetujui dan memberi petunjuk kepada kaum yang mengingkari Allah dan ayat-ayat-Nya, yang mereka keluar dari ketaatan-Nya. Pada ayat ini ada pengkabaran dari Allah kepada Nabi-Nya ﷺ dengan ketiadaan kebenaran dan hidayah bagi mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Munafiqun Ayat 6",
    "description": "Allah mengingatkan nabi bahwa sama saja bagi mereka, orang munafik yang tetap dalam kemunafikannya hingga mati, apakah engkau wahai nabi Muhammad memohonkan ampunan untuk mereka, atau engkau tidak memohonkan ampunan bagi mereka, Allah tetap saja tidak akan mengampuni mereka yang mati dalam keadaan munafik; sesungguhnya Allah tidak akan memberi petunjuk kepada orang-orang yang fasik, yaitu orang-orang yang terus menerus berbuat dosa hingga pikiran dan mereka tertutup dari cahaya Allah. 7. Mereka itulah, yakni orang-orang munafik di madinah yang berkata dengan pentuh hasutan kepada orang-orang ansar, 'janganlah kamu bersedekah kepada orang-orang yang ada di sisi rasulullah yaitu kaum muhajirin sampai mereka bubar, meninggalkan rasulullah agar umat islam pecah dan lemah. ' padahal milik Allah-lah perbendaharaan langit dan bumi yang menjamin rezeki setiap orang, tetapi orang-orang munafik itu tidak memahami bahwa rezeki, hidup, dan mati setiap makhluk berada di tangan Allah."
  }
]