[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "7. Orang-orang munafik itu adalah orang-orang yang berkata kepada orang-orang Madinah, ”Jangan membantu para sahabat Rasulullah dari orang-orang Muhajirin, agar mereka meninggalkannya.” Hanya milik Allah semata pembendaharaan langit dan bumi, serta apa yang ada di antara keduanya, tetapi orang-orang munafik itu tidak memahami bahwa rizki adalah dari sisi Allah, karena mereka adalah orang-orang yang jahil tentang Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Mereka adalah orang-orang yang mengatakan, “Janganlah kalian menafkahkan harta kalian kepada orang-orang fakir yang ada di sisi Rasulullah -ṣallallāhu 'alaihi wa sallam- dan orang-orang Badui di sekitar Madinah sehingga mereka meninggalkannya.” Padahal hanya milik Allah semata perbendaharaan langit dan bumi, Dia memberikannya kepada orang yang dikehendaki-Nya dari hamba-hamba-Nya, akan tetapi orang-orang munafik tidak mengerti bahwa perbendaharaan rezeki hanya berada di tangan Allah -Subḥānahu-."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "7. Allah membeberkan keburukan orang-orang munafik; bahwa mereka berkata kepada para penduduk Madinah: “Janganlah kalian berinfak bagi kaum Muhajirin yang merupakan para sahabat Nabi Muhammad, agar mereka meninggalkannya.” Orang yang mengatakan ini secara langsung adalah Abdullah bin Ubay yang merupakan pemimpin orang-orang munafik. Hanya Allah yang memiliki seluruh perbendaharaan tujuh langit dan bumi; Dia memberi rezeki bagi seluruh makhluk. Akan tetapi orang-orang munafik tidak memahami bagaimana Allah mengatur makhluk-makhluk-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. هُمُ الَّذِينَ يَقُولُونَ لَا تُنفِقُوا۟ عَلَىٰ مَنْ عِندَ رَسُولِ اللَّـهِ حَتَّىٰ يَنفَضُّوا۟ ۗ (Mereka yang berkata (kepada orang-orang Anshar), “Janganlah kamu bersedekah kepada orang-orang (Muhajirin) yang ada di sisi Rasulullah sampai mereka bubar) Yang mereka maksud adalah orang-orang fakir dari kaum Muhajirin. وَلِلَّـهِ خَزَآئِنُ السَّمٰوٰتِ وَالْأَرْضِ(Padahal milik Allah-lah perbendaharaan langit dan bumi) Yakni Allah-lah yang akan memberi rezeki pada orang-orang muhajirin tersebut. وَلٰكِنَّ الْمُنٰفِقِينَ لَا يَفْقَهُونَ (tetapi orang-orang munafik itu tidak memahami) Yakni tidak mengerti bahwa rezeki berada di tangan Allah, sehingga mereka mengira Allah tidak akan melapangkan rezeki orang-orang beriman."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Mereka yaitu para pemimpin orang-orang munafik itu berkata kepada sahabat-sahabat anshar mereka di Madinah: “Kalian jangan menafkahkan (harta kalian) kepada orang-orang yang berada di sisi Rasulallah SAW, yaitu orang-orang fakir Muhajirin sampai mereka memisahkan diri dari Rasulallah saat mereka sudah tidak sanggup lagi (mengikutinya)”. Di tangan Allah, kunci-kunci rejeki itu ada. Dialah Dzat yang Maha Memberi Rejeki bagi kaum Muhajirin itu. Akan tetapi karena ketidaktahuan mereka tentang Allah, orang-orang munafik itu tidak mengetahui bahwa gudang-gudang rejeki itu ada di tangan Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka adalah orang-orang yang berkata,“Janganlah berinfak kepada orang-orang yang ada di sisi Rasulullah sampai mereka bubar} meninggalkannya {milik Allahlah perbendaharaan langit dan bumi. Akan tetapi orang-orang munafik itu tidak mengerti"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7. Ini adalah di antara kerasnya permusuhan mereka terhadap Nabi dan kaum Muslimin, ketika mereka melihat persatuan para sahabat dan segeranya mereka melakukan apa pun yang membuat Rasulullah ridha. Mereka berkata dengan dugaan keliru, “Janganlah kamu memberikan infak kepada orang-orang (MUhajirin) yang ada di sisi Rasulullah supaya mereka bubar (meninggalkan Rasulullah),” karena mereka mengira, andai bukan karena harta orang-orang munafik dan dana yang mereka berikan, tentu mereka tidak bersatu padu dalam menolong Agama Allah. Inilah hal paling aneh dari orang-orang munafik. Mereka membuat dugaan seperti itu padahal mereka adalah orang yang paling getol dalam mencela Agama Islam dan menyakiti kaum Muslimin. Dugaan seperti ini hanya diucapkan oleh orang yang tidak mengerti hal sebenarnya. Karena itulah Allah berfirman seraya membantah pernyataan mereka, “Padahal kepunyaan Allah-lah perbendaharaan langit dan bumi.” Allah memberi rizki kepada siapa saja yang dikehendaki, menahan rizki dari siapa saja yang dikehendaki, memudahkan sebab-sebab rizki untuk siapa saja yang dikehendaki dan mempersulit sebab-sebab rizki untuk siapa saja yang dikehendaki. “Tetapi orang-orang munafik itu tidak memahami.” Karena itulah mereka mengucapkan perkataan seperti itu yang pengertiannya adalah perbendaharaan rizki berada di tangan mereka dan di bawah kehendak mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Munafiqun ayat 7: Allah menyebutkan musuh-musuh-Nya yang nampak dan sesuatu yang mereka sembunyikan dari dosanya, dan ini sebelum peperangan Tabuk, Allah mengabarkan bahwa mereka orang-orang munafik berkata kepada orang-orang anshar : Janganlah kalian infakkan hartamu kepada sahabat Muhammad ﷺ dari muhajirin sampai mereka ditimpa kelaparan dan meninggalkan Nabi mereka (di Madinah). Mereka berkata dan menyangka bahwa tanpa infaq kepada mereka muhajirin yang hijrah karena Allah dan untuk menolong Rasul, yang mereka meninggalkan negeri-negeri mereka dan harta mereka, akan menjadikan mereka terpecah belah kemudian meninggalkan Nabi ﷺ, sungguh mereka berdusta, Allah akan mengadzab mereka karena dugaan mereka yang buruk. Allah mengabarkan bahwa perbendaharaan apa yang ada di langit dan di bumi, atau sesungguhnya rezeki wahai orang-orang munafik ada di tangan Allah saja, tidak di tangan-tangan kalian, akan tetapi kalian adalah kaum yang bodoh, yang bahwasanya apa yang ada di sisi Allah adalah rezeki yang sempurna dan besar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Imam Bukhari meriwayatkan dengan sanadnya yang sampai kepada Muhammad bin Ka’ab Al Qurazhiy ia berkata: Aku mendengar Zaid bin Arqam radhiyallahu 'anhu (berkata), “Ketika Abdullah bin Ubay berkata, “Janganlah kamu berinfak kepada orang-orang yang berada di sisi Rasulullah shallallahu 'alaihi wa sallam,” ia juga berkata, “Sungguh, jika kita telah kembali ke Madinah…dst.” Maka aku beritahukan hal itu kepada Nabi shallallahu 'alaihi wa sallam lalu orang-orang Anshar mencelaku, dan Abdullah bersumpah bahwa dia tidak berkata demikian, maka aku pulang ke rumah dan tidur, lalu Rasulullah shallallahu 'alaihi wa sallam memanggilku dan berkata, “Sesungguhnya Allah telah membenarkanmu.” Dan turunlah ayat, “Mereka yang berkata (kepada orang-orang Anshar), \"Janganlah kamu bersedekah…dst.” Ini termasuk kerasnya permusuhan mereka kepada Nabi shallallahu 'alaihi wa sallam dan kaum muslimin ketika mereka melihat kaum muslimin bersatu. Mereka menganggap bahwa tanpa harta dan nafkah mereka (kaum munafik) tentu mereka (kaum muslimin) tidak akan berkumpul membela agama Rasulullah shallallahu 'alaihi wa sallam. Sungguh hal ini merupakan sesuatu yang paling aneh, yaitu karena kaum munafik yang sangat senang agama Islam terlantar dan kaum muslimin tersakiti menyangka demikian, dimana sangkaan ini hanyalah laris di kalangan orang-orang yang tidak mengetahui keadaan yang sebenarnya. Oleh karena itulah dalam lanjutan ayat Allah Subhaanahu wa Ta'aala membantah mereka dengan firman-Nya, “Padahal milik Allah-lah perbendaharaan langit dan bumi.” Yakni Dia yang memberi rezeki kepada siapa yang Dia kehendaki dan menghalangi dari siapa yang Dia kehendaki, memudahkan sebab bagi siapa yang Dia kehendaki dan menyusahkan kepada siapa yang Dia kehendaki. Dia akan memberi rezeki kepada kaum muhajirin dan selain mereka. Sehingga mengatakan demikian yang isinya memberi kesan bahwa perbendaharaan rezeki ada di tangan mereka dan di bawah kehendak mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Munafiqun Ayat 7",
    "description": "Mereka itulah, yakni orang-orang munafik di madinah yang berkata dengan pentuh hasutan kepada orang-orang ansar, 'janganlah kamu bersedekah kepada orang-orang yang ada di sisi rasulullah yaitu kaum muhajirin sampai mereka bubar, meninggalkan rasulullah agar umat islam pecah dan lemah. ' padahal milik Allah-lah perbendaharaan langit dan bumi yang menjamin rezeki setiap orang, tetapi orang-orang munafik itu tidak memahami bahwa rezeki, hidup, dan mati setiap makhluk berada di tangan Allah. 8. Mereka berkata kepada sesama orang munafik, 'sungguh, jika kita kembali ke madinah seusai perang bani mustalik, yaitu perang yang diiikuti orang-orang munafik bersama kaum muslim, pastilah orang yang kuat, yaitu orang-orang munafik akan mengusir orang-orang yang lemah, yakni kaum muslim dari sana, madinah. ' padahal kekuatan itu hakikatnya hanyalah milik Allah, rasul-Nya, dan milik orang-orang mukmin, selama mereka bersatu dan memiliki mental kejuangan, tetapi orang-orang munafik itu tidak mengetahui bahwa yang lemah itu mereka dan yang kuat itu rasulullah bersama para sahabat."
  }
]