[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "8. Orang-orang munafik itu berkata, “Bila kami pulang ke Madinah, niscaya golongan kami yang mulia akan mengusir golongan orang-orang beriman yang terhina.” Padahal kemuliaan itu hanya milik Allah, RasulNya, dan orang-orang yang beriman kepada Allah dan RasulNya, bukan milik selain mereka, akan tetapi orang-orang munafik itu tidak mengetahuinya karena mereka sangat bodoh."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Tokoh mereka, yaitu Abdullah bin Ubay, berkata, “Jika kami telah kembali ke Madinah, pastilah orang-orang yang kuat -yaitu aku dan kaumku- mengusir orang-orang yang lemah -yaitu Muhammad dan para sahabatnya- dari Madinah.” Padahal kekuatan itu hanya milik Allah, Rasul-Nya dan kaum mukminin saja, bukan milik Abdullah bin Ubay dan kawan-kawannya, akan tetapi orang-orang munafik tidak mengetahui bahwa kekuatan itu hanya milik Allah, Rasul-Nya dan kaum mukminin."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "8. Dan salah satu buruknya perkataan pemimpin orang-orang munafik, Abdullah bin Ubay: “Demi Allah, jika kami kembali ke Madinah, maka golongan yang lebih kuat akan mengusir golongan yang lemah dan hina.” Namun kekuatan dan kemuliaan hanya milik Allah, Rasulullah, dan orang-orang yang benar-benar beriman; akan tetapi orang-orang tidak mengetahui hakikat ini."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. هُمُ الَّذِينَ يَقُولُونَ لَا تُنفِقُوا۟ عَلَىٰ مَنْ عِندَ رَسُولِ اللَّـهِ حَتَّىٰ يَنفَضُّوا۟ ۗ (Mereka yang berkata (kepada orang-orang Anshar), “Janganlah kamu bersedekah kepada orang-orang (Muhajirin) yang ada di sisi Rasulullah sampai mereka bubar) Yang mereka maksud adalah orang-orang fakir dari kaum Muhajirin. وَلِلَّـهِ خَزَآئِنُ السَّمٰوٰتِ وَالْأَرْضِ(Padahal milik Allah-lah perbendaharaan langit dan bumi) Yakni Allah-lah yang akan memberi rezeki pada orang-orang muhajirin tersebut. وَلٰكِنَّ الْمُنٰفِقِينَ لَا يَفْقَهُونَ (tetapi orang-orang munafik itu tidak memahami) Yakni tidak mengerti bahwa rezeki berada di tangan Allah, sehingga mereka mengira Allah tidak akan melapangkan rezeki orang-orang beriman."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8. Orang-orang munafik itu berkata: “Sungguh jika kami kembali ke Madinah dari perang melawan Bani Mushthaliq, sungguh orang kuat (maksudnya adalah diri mereka meskipun mereka adalah orang-orang munafik) akan mengeluarkan orang lemah dari kota itu dan mereka menganggap bahwa diri mereka adalah orang-orang yang beriman. Kemuliaan itu hanya milik Allah, Rasulallah, dan orang-orang mukmin, bukan milik mereka. Maknanya adalah kekuatan dan kemenangan itu hanya milik Allah dan orang-orang yang Dia beri (kemuliaan) yaitu orang-orang mukmin. Akan tetapi, orang-orang munafik itu tidak mengetahui bahwa kemuliaan itu hanya milik Allah dan orang-orang syang etia denganNya karena kebodohan dan kesombongan mereka yang sangat besar. Tirmidzi dari Zaid bin Arqam bahwa ada orang Baduwi yang berseteru dengan orang Anshar dalam memperebutkan air. Kemudian orang Baduwi itu memukul kepalanya menggunakan kayu dan mematahkannya, Lalu dia mengeluh kepadaku dengan berkata: “Kalian jangan menfkahkan (harta kalian) kepada orang di sisi Rasulallah sampai mereka membersihkan diri. Ketika kami kembali ke Madinah, maka orang kuat akan mengusir orang lemah, Orang kuat itu adalah aku dan orang lemah itu adalah Rasulallah SAW.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata,“Sungguh jika kita kembali} kembali dari perang Bani Musthaliq {ke Madinah, sungguh orang yang kuat akan mengusir} orang yang lebih kuat yaitu diri mereka sendiri {orang-orang yang lemah} orang yang lebih lemah, yaitu Rasulullah SAW dan orang yang bersamanya {dari sana”. Dan kekuatan itu hanyalah milik Allah} kekuatan dan keunggulan {RasulNya, dan orang-orang mukmin. Akan tetapi orang-orang munafik itu tidak mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8. “Mereka berkata, ‘Sesungguhnya jika kita telah kembali ke Madinah, benar-benar orang yang kuat akan mengusir orang-orang yang lemah darinya’.” Ini terjadi pada saat perang al-Muraisi, ketika beberapa orang dari kalangan Muhajirin dan Anshar terlibat adu mulut yang mengusik perasaan. Saat itu kemunafikan mereka nampak dan jelaslah apa yang tersembunyi di hati mereka. Pemimpin kaum munafik, Abdulllah bin Ubaibin Salul, berkata, “Perumpamaan kami dengan mereka –maksudnya kaum Muhajirin- tidak lain adalah seperti orang yang berkata, Gemukkanlah anjingmu, niscaya ia akan memakanmu.” Dan dia juga berkata, “Sesungguhnya jika kita telah kembali ke Madinah, benar-benar orang yang kuat akan mengusir orang-orang yang lemah darinya,” karena mengira bahwa dia dan teman-temannya dari kalangan munafik adalah orang-orang kuat dan Rasulullah serta orang-orang yang bersamanya adalah kalangan lemah, padahal sebenarnya perkataan si munafik itu terbalik. Karena itu Allah itu berfirman, “Padahal kekuatan itu hanyalah milik Allah, milik RasulNya, dan milik orang-orang Mukmin.” Merekalah yang kuat sedangkan orang-orang munafik serta teman-teman mereka adalah orang-orang lemah. “Tetapi orang-orang munafik itu tiada mengetahui” hal itu. Karena itu mereka mengira bahwa mereka adalah orang-orang kuat dengan kebatilan yang ada pada diri mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Munafiqun ayat 8: Dan sebagian dari perkataan orang-orang munafik yang buruk, yaitu perkataan dedengkot mereka Abdullah bin Ubay; Ketika dekat dengan peperangan ini (yaitu peperangan bani musthaliq) menuju madinah, ia keluar seolah-olah berkekuatan untuk menaklukkan musuh yaitu ia keluar dengan manusia yang bersamanya dan merendahkan Rasul dan yang bersamanya, begitulah bujuk rayu dirinya untuk memikat, dengan mengklaim bahwa dirinya kuat atau tidak mungkin terkalahkan dan mereka terlalu dalam masuk dalam kemaksiatan dan dosa, Abdullah bin Ubay berkata : Tidaklah kami dan Muhammad serta sahabatnya sebagaimana yang dikatakan : Anjing yang gemuk memakan buruannya, adapun demi Allah kami adalah orang yang kembali ke Madinah karena kami terlalu kuat. Maka Allah jawab mereka : Ketahuilah wahai orang-orang munafik, bahwasanya kekuatan dan penaklukan adalah ketentuan Allah dan Rasul-Nya saja dan bagi orang-orang yang beriman, akan tetapi kalian tidak mengetahui bahwa kekuatan dan penaklukan milik kekasih Allah karena sebab kalian orang-orang yang bodoh dan keras kepala."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya, kembali dari perang Bani Musthalik atau perang Muraisi’, ketika ini orang-orang munafik menampakkan kemunafikannya. Tokoh mereka yaitu Abdullah bin Ubay berkata, “Tidak ada perumpamaan antara kita dengan mereka (kaum muhajirin) melainkan seperti yang dikatakan seseorang, “Beri makan anjingmu, nanti dia akan memakanmu.” Ia juga berkata, “Sungguh, jika kita telah kembali ke Madinah, pastilah orang yang kuat akan mengusir orang-orang yang lemah dari sana.\" Yang mereka maksud adalah diri mereka sendiri. Yang mereka maksud adalah orang-orang mukmin. Oleh karena itulah mereka menyangka bahwa mereka adalah orang-orang yang kuat dan mulia karena tertipu dengan kebatilan mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Munafiqun Ayat 8",
    "description": "Mereka berkata kepada sesama orang munafik, 'sungguh, jika kita kembali ke madinah seusai perang bani mustalik, yaitu perang yang diiikuti orang-orang munafik bersama kaum muslim, pastilah orang yang kuat, yaitu orang-orang munafik akan mengusir orang-orang yang lemah, yakni kaum muslim dari sana, madinah. ' padahal kekuatan itu hakikatnya hanyalah milik Allah, rasul-Nya, dan milik orang-orang mukmin, selama mereka bersatu dan memiliki mental kejuangan, tetapi orang-orang munafik itu tidak mengetahui bahwa yang lemah itu mereka dan yang kuat itu rasulullah bersama para sahabat. 9. Pada ayat ini Allah mengingatkan orang-orang beriman agar kesibukan mengurus harta dan memperhatikan urusan anak tidak menghalangi ibadah kepada Allah. Wahai orang-orang yang beriman di mana pun berada! janganlah harta bendamu yang kamu cari dan anak-anakmu yang kamu sayangi, melalaikan kamu dari mengingat Allah, yakni salat lima waktu dan aturan-aturan Allah tentang bekerja, bermasyarakat, dan bernegara. Dan barang siapa berbuat demikian, melalaikan ibadah dan aturan Allah, maka mereka itulah orang-orang yang rugi, karena kebutuhan ruhaninya tidak terpenuhi dan hidupnya tidak seimbang."
  }
]