[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Aku memulai membaca Alquran dengan menyebut nama Allah sambil memohon pertolongan kepada-Nya. Allah adalah merupakan nama Untuk Robb Yang Maha banyak berkahnya lagi Maha Tinggi, zat yang berhak diibadahi yang tidak ada yang lain selain-Nya. Dan ini adalah merupakan nama paling khusus diantara nama-nama Allah ta'ala yang tidak dinamai dengan nama ini selain Allah yang Maha banyak berkahnya lagi Maha Tinggi. الرَّحْمَنِ (yang maha pengasih) yang memiliki Rahmat umum yang meliputi seluruh makhluk, الرَّحِيمِ (yang maha penyayang) yakni kepada orang-orang Mukmin. dan keduanya merupakan dua nama diantara nama Allah ta’ala yang keduanya mencakup penetapan sifat Rahmah (menyayangi) bagi Allah sebagaimana yang layak bagi keagungannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Dengan menyebut nama Allah aku mulai membaca Al-Qur`ān ini. Aku memohon pertolongan Allah -Subḥānahu wa Ta'ālā- dan berharap keberkahan dengan menyebut nama-Nya. Lafal Basmalah mengandung tiga nama Allah yang sangat baik, yaitu: 1. Allāh, Zat yang berhak disembah, dan nama ini merupakan nama khusus hanya berlaku bagi Allah -Ta'ālā-, sehingga siapa pun tidak diperkenankan menyandang nama tersebut selain Dia -Subḥānahu-. 2. Ar-Raḥmān, pemilik rahmat yang luas, Dia Zat yang maha pengasih. 3. Ar-Raḥīm, pemilik rahmat yang menyeluruh. Dia merahmati siapa pun yang dikehendaki-Nya dari makhluk-Nya, dan di antaranya hamba-hamba-Nya yang beriman."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1. Yang dimaksud dengan basmalah yakni aku memulai dengan menyebut nama Allah Ta'ala, Tuhan yang berhak disembah, Yang Mempunyai keluasan rahmat bagi seluruh makhluk di dunia dan bagi orang-orang beriman di dunia dan akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ Para ulama berbeda pendapat dalam basmalah ini, sebagian mereka berpendapat bahwa basmalah adalah ayat yang berdiri sendiri pada setiap awal surat ; pendapat lain berkata bahwa ia termasuk ayat pada setiap surat, dan mungkin adalah termasuk ayat hanya dari surat al-Fatihah; pendapat lain berkata bahwa ia bukan merupakan ayat pada setiap surat dan penulisannya hanya sebagai pembatas diantara dua surat. Akan tetapi para ulama sepakat bahwa ia adalah bagian dari sebuah ayat pada surat an-Naml. اللَّهِ nama yang hanya disematkan untuk Allah Ta’ala, yang berasal dari kata (الإله), yang sebelum penghilangan hamzahnya disematkan untuk segala yang disembah baik itu sesembahan yang haq maupun yang batil, dan kemudian penggunaannya condong kepada sesembahan yang haq. الرَّحْمَٰنِ الرَّحِيمِ keduanya adalah nama yang diambil dari kata rahmat; dan nama Rahman memiliki makna yang lebih dalam daripada nama Rahim, dan nama Rahman tidak disematkan kecuali untuk Allah Azza Wajalla."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "{Bismillaahirrahmaanirrahiim} Aku memulai bacaanku seraya meminta pertolongan dengan menyebut nama Allah dan DzatNya. Dialah Dzat yang penuh rahmat (kasih sayang) dan kebaikan yang dilimpahkan kepada mereka yang diberkahi. Sifat Ar-Rahman cakupannya lebih luas daripada Ar-Rahim. Nama Allah dimunculkan berdasarkan dzat, hakikat dan wujudNya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dengan menyebut nama Allah} Aku mengawali bacaan dengan meminta pertolongan Allah dan meminta keberkahan dengan menyebut namaNya {Yang Maha Pengasih} Pemiliki kasih sayang yang sangat luas {lagi Maha Penyayang} Pemilik kasih sayang yang terus bersambung"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Maknanya “saya memulai dengan setiap nama-nama Allah ta'ala, karena lafaz Ismun adalah kata mufrod (tunggal) yang disandarkan, maka ia mencakup seluruh nama-nama yang baik (Asmaul Husna). Lafaz Allah artinya yang dituhankan dan yang disembah yang berhak diesakan dalam penyembahan, karena Allah memiliki sifat uluhiyyah (ketuhanan) dan itu merupakan sifat yang sempurna. Lafaz arrohman arrohiim merupakan dua nama yang menunjukkan bahwa Allah memiliki Rahmat yang luas dan besar yang mencakup segala sesuatu, rahmat-Nya mencakup bagi seluruh yang hidup. dan Allah menetapkan rahmat-Nya bagi orang-orang yang bertakwa yang mengikuti para Nabi dan Rasul -Nya. Maka bagi mereka akan mendapatkan rahmat yang mutlak. Adapun selain mereka akan mendapatkan bagian yang sedikit dari Rahmat itu. dan ketahuilah diantara kaidah yang disepakati oleh para Salaf umat dan para imamnya bahwasanya iman terhadap nama-nama dan sifat-sifat Allah dan hukum-hukum yang terkandung dalam sifat-Nya. Sebagai contoh, mereka beriman bahwasanya Allah maha pengasih lagi maha penyayang, artinya Allah memiliki Rahmat yang disifati oleh Allah dan berhubungan dengan yang dirahmati nya yaitu hamba-Nya. maka seluruh nikmat adalah bukti dari rahmat Allah. dan demikian juga pada seluruh nama-nama Allah yang lain. contoh yang lain seperti sifat Allah “Maha Mengetahui” artinya Allah Maha Mengetahui yang memiliki ilmu yang dengan ilmu itu Allah mengetahui segala sesuatu. Allah Maha Kuasa yang memiliki kekuasaan yang dengan kekuasaan itu Allah mampu melakukan apapun."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna Kata : Al-Basmalah adalah ketika seorang berucap bismillahirrahmaanirrahiim Al-Ismu adalah lafadz yang menjadi penamaan bagi sesuatu sehingga dapat dikenali dan dibedakan dari yang lainnya. Allah adalah nama bagi dzat Tuhan Yang Maha Tinggi lagi Maha Suci yang biasa dikenal dengan penamaan tersebut. Ar-Rahmaan adalah salah satu dari nama-nama Allah Ta’ala yang merupakan bentuk turunan dari kata rahmat. Menunjukkan bahwa Allah memiliki banyak rahmat untuk hamba-hambaNya. Ar-Rahiim merupakan nama dan sifat Allah Ta’ala, bentuk turunan dari kata rahmat berarti Allah memiliki kasih sayang untuk hamba-hambaNya dan memberikannya untuk mereka di dunia dan di akhirat. Arti Basmalah : Aku memulai bacaanku mengharapkan berkah dengan menyebut nama Allah yang Maha Pengasih lagi Maha Penyayang dan meminta pertolongan kepadaNya. Hukum Membaca Basmalah : Ditekankan dan disyariatkan bagi orang yang akan membaca salah satu surat dalam al-Qur’an, untuk memulainya dengan Basmalah. Kecuali saat membaca surat At-Taubah, maka tidak perlu membaca basmalah. Tetap membaca basmalah secara pelan ketika membaca surat walaupun dalam sholat wajib jahriyah. Disunnahkan untuk membaca bismillah ketika hendak makan dan minum, memakai pakaian, ketika masuk atau keluar dari masjid, ketika mengendarai kendaraan, dan setiap melakukan perkara yang baik. Kemudian diwajibkan untuk mengucapkan bismillahi allahu akbar ketika menyembelih binatang."
  },
  {
    "title": "Al-Mishbahul Munir fi Tahdzib Tafsir Ibnu Katsir / Syaikh Shafiyurrahman al-Mubarakfuri et. al.",
    "description": "NAMA AL-FATIHAH DAN MAKNANYA Surat ini disebut al-Fatihah yang maknanya adalah pembuka kitab secara khat (tulisan mushaf) . Dengan surat inilah dibukanya bacaan dalam shalat-shalat. Surat ini disebut juga Ummul Kitab (induk al-Qur’an) berdasarkan pendapat jumhur ulama. Imam Tirmidzi meriwayatkan sebuah hadits shahih dan beliau juga menshahihkannya, dari Abu Hurairah 4 ia berkata: “Rasulullah saw bersabda: الْحَمْدُ لِلَّهِ أُمُّ الْقُرْآنِ وَأُمُّ الْكِتَابِ وَالسَّبْعُ الْمَثَانِي \"Alhamdulillah adalah induknya al Qur'an, induknya al Kitab, dan As Sab'ul Matsaani (tujuh ayat yang diulang-ulang).\" Surat al-Fatihah disebut juga al-Hamdu dan ash-Sholaah, berdasarkan sabda Rasulullah saw yang baginda meriwayatkan dari Rabbnya, Allah berfirman: قَسَمْتُ الصَّلَاةَ بَيْنِي وَبَيْنَ عَبْدِي نِصْفَيْنِ وَلِعَبْدِي مَا سَأَلَ فَإِذَا قَالَ الْعَبْدُ} الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ {قَالَ اللَّهُ تَعَالَى حَمِدَنِي عَبْدِي. “Aku membagi shalat antara Aku dengan hambaKu setengah-setengah, dan hambaku mendapatkan apa yang dia minta. Apabila seorang hamba membaca; 'Alhamdulillahi rabbil 'alamin.’ Allah menjawab; ‘Hamba-Ku telah memuji-Ku.” Surat al-Fatihah disebut ash-Sholaah karena termasuk syarat sahnya shalat. Surat al-Fatihah disebut juga ar-Ruqyah (pengobat) berdasarkan hadits Abu Sa’id ketika ia meruqyah dengan al-Fatihah seorang laki-laki yang terkena sengatan, maka Rasulullah saw bersabda: وَمَا يُدْرِيكَ أَنَّهَا رُقْيَةٌ “Tidakkah engkau tahu bahwa al-Fatihah itu ruqyah.” Surat ini termasuk surat Makkiyyah (diturunkan sebelum hijrah ke Madinah). Demikian yang dikatakan oleh Ibnu ‘Abbas, Qatadah dan Abul ‘Aliyah, berdasarkan firman Allah : وَلَقَدْ آتَيْنَاكَ سَبْعًا مِنَ الْمَثَانِي وَالْقُرْآنَ الْعَظِيمَ “Dan Sesungguhnya Kami telah berikan kepadamu tujuh ayat yang dibaca berulang-ulang dan Al Quran yang agung.” (QS.al-Hijr:87) JUMLAH AYATNYA Surat ini terdiri dari tujuh ayat tanpa ada perselisihan ulama, dan Basmalah adalah satu ayat yang berdiri sendiri pada awal surat al-Fatihah, sebagaimana pendapat jumhur Qurro’ (ahli Qiro’at) dari Kufah. Juga merupakan pendapat sejumlah Sahabat, Tabi’in dan sebagian ulama Khalaf. JUMLAH KATA DAN HURUFNYA Para ulama mengatakan, “Surat al-Fatihah terdiri dari 25 kata dan 113 huruf.” MENGAPA DINAMAKAN UMMUL KITAAB Imam Bukhari berkata di awal kitab tafsir: “Disebut ummul Kitaab karena al-Fatihah ditulis pada permulaan Mushaf dan dibaca pada permulaan shalat.” Ada yang berpendapat : “Disebut Ummul Kitaab karena seluruh makna al-Qur’an kembali kepada apa yang dikandungnya.” Ibnu Jarir mengatakan: “Orang Arab menyebut kata ‘umm’ untuk semua yang mencakup atau mendahului sesuatu jika ia memiliki perkara-perkara yang mengikutinya dan ia sebagai pemuka baginya. Seperti ummur ra’si adalah sebutan untuk kulit yang meliputi otak. Mereka menyebut bendera dan panji tempat berkumpulnya pasukan di bawahnya dengan sebutan umm.” Ia mengatakan: “Kota Makkah disebut Ummul Quraa karena keberadaannya terlebih dahulu dan ia sebagai penghulu bagi kota-kota lainnya. Ada yang mengatakan: “Disebut Ummul Quraa karena bumi terbentang darinya.” Imam Ahmad meriwayatkan dari Abu Hurairah 4, dari Nabi saw bahwa baginda berkata tentang Ummul Qur’an: هِيَ أُمُّ الْقُرْآنِ وَهِيَ السَّبْعُ الْمَثَانِي وَهِيَ الْقُرْآنُ الْعَظِيمُ \"Ia adalah Ummul Quran, ia adalah as sab'ul matsaniy (tujuh ayat yang dibaca berulang-ulang) dan ia adalah Al Quran Al 'Azhim.\" Abu Jakfar Muhammad bin Jarir ath-Thabari meriwayatkan dari Abu Hurairah 4 dari Rasulullah saw, baginda bersabda: هِيَ أُمُّ الْقُرْآنِ وَهِيَ فَاتِحَةُ الْكِتَاب وَهِيَ السَّبْعُ الْمَثَانِي “Ia adalah Ummul Qur’an, ia adalah Faatihatul Kitab dan ia adalah as-Sab’ul Matsani.” KEUTAMAAN AL-FATIHAH Imam Ahmad bin Hambal meriwayatkan dalam Musnadnya dari Abi Sa’ad bin al-Mu’alla , ia berkata: “Aku pernah mengerjakan shalat, kemudian Rasulullah saw memanggilku, tetapi aku tidak menjawabnya hingga aku menyelesaikan shalat. Setelah itu aku mendatangi baginda, maka baginda bertanya: “Apa yang menghalangimu untuk menjawab: “Wahai Rasulullah, sesungguhnya tadi aku sedang mengerjakan shalat.” Lalu beliau bersabda: “Bukankah Allah berfirman: يَا أَيُّهَا الَّذِينَ آمَنُوا اسْتَجِيبُوا لِلَّهِ وَلِلرَّسُولِ إِذَا دَعَاكُمْ لِمَا يُحْيِيكُمْ “Hai orang-orang yang beriman, penuhilah seruan Allah dan seruan Rasul apabila Rasul menyeru kamu kepada suatu yang memberi kehidupan kepada kamu” (QS. Al-Anfal:24) Setelah itu beliau bersabda: ”Aku akan mengajarkan kepadamu satu surat yang paling agung dalam al-Qur’an sebelum engkau keluar dari masjid.” Maka baginda memegang tanganku dan ketika beliau hendak keluar dari masjid, aku mengatakan: “Wahai Rasulullah, engkau tadi mengatakan akan mengajarkan kepadakku surat yang paling agung dalam al-Qur’an. Baginda menjawab: نعم، الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ هِيَ السَّبْعُ الْمَثَانِي وَالْقُرْآنُ الْعَظِيمُ الَّذِي أُوتِيتُهُ “Benar, alhamdulillahi Rabbil’alaminn adalah termasuk Assabu' Al Matsani (tujuh ayat yang terulang-ulang) dan Al-Qur’an yang agung yang diberikan kepadaku.” Demikian pula diriwayatkan oleh al-Bukhari, Abu Daud, Nasa’i dan Ibnu Majah. Hadits lain, diriwayatkan oleh Imam al-Bukhari dalam Fadha’il al-Qur’an dari Abu Sa’id al-Khudri : “Kami pernah melakukan satu perjalanan, lalu kami singgah. Kemudian datanglah seorang budak wanita seraya berkata: “Sesungguhnya kepala suku kami terkena sengataan, dan kaum lelaki kami sedang tidak ada di tempat. Apakah di antara kalian ada yang bisa meruqyah?” Maka berangkatlah bersamanya seorang laki-laki yang kami tidak pernah menyangka bahwa ia bisa meruqyah. Kemudian ia membacakan ruqyah dan kepala suku itu pun sembuh. Lalu kepala suku itu memerintahkan agar ia diberi tiga puluh ekor kambing dan kami diberi minum susu. Setelah kembali kami bertanya kepadanya: “Apakah engkau pandai meruqyah atau pernah? Maka ia menjawab: “Aku tidak meruqyah kecuali dengan Ummul Kitab (al-Fatihah). Kami katakan:”Jangan lakukan apa pun hingga kita menemui Rasulullah dan menanyakan hal ini kepada beliau. Sesampainya di Madinah kami menceritakan hal itu kepada Nabi saw , maka baginda bersabda: وَمَا يُدْرِيكَ أَنَّهَا رُقْيَةٌ أَصَبْتُمْ اقْسِمُوا وَاضْرِبُوا لِي مَعَكُمْ بِسَهْمٍ \"Apakah kamu tidak tahu bahwa itu adalah ruqyah? Dan kalian telah mendapatkan imbalan darinya, maka bagilah dan berilah bagian untukku.\" (Hadits lain). Diriwayatkan oleh imam Muslim dalam kitab Shahihnya dan an-Nasa’i dalam Sunannya dari Ibnu Abbas ia berkata: “Ketika Rasulullah saw tengah bersama Malaikat Jibril, tiba-tiba terdengar suara keras dari atas. Maka Jibril mengarahkan pandangannya ke langit seraya berkata: “Itu adalah dibukanya sebuah pintu di langit yang belum pernah dibuka sebelumnya.” Ibnu Abbas melanjutkan: “Dari pintu itu turunlah satu Malaikat dan menemui Nabi saw seraya berkata: “Sampaikanlah kabar gembira kepada ummatmu tentang dua cahaya. Kedua cahaya itu telah diberikan kepadamu dan belum pernah diturunkan kepada seorang Nabi pun sebelummu, yaitu Faatihatul Kitaab dan beberapa ayat terakhir surat al-Baqarah. Tidaklah engkau membaca satu huruf darinya melainkan akan diberikan pahala bagimu.” Ini adalah lafazh dalam riwayat an-Nasa’i dan riwayat Muslim senada dengannya. HUKUM MEMBACA AL-FATIHAH DALAM SHALAT (Hadits lain), diriwayatkan oleh Muslim dari Abi Hurairah dari Nabi saw, beliau bersabda: مَنْ صَلَّى صَلَاةً لَمْ يَقْرَأْ فِيهَا بِأُمِّ الْقُرْآنِ فَهِيَ خِدَاجٌ» ثَلَاثًا غَيْرُ تَمَامٍ. فَقِيلَ لِأَبِي هُرَيْرَةَ: إِنَّا نَكُونُ وَرَاءَ الْإِمَامِ؟ فَقَالَ: «اقْرَأْ بِهَا فِي نَفْسِكَ»؛ فإنِّي سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: \" قَالَ اللهُ تَعَالَى: قَسَمْتُ الصَّلَاةَ بَيْنِي وَبَيْنَ عَبْدِي نِصْفَيْنِ، وَلِعَبْدِي مَا سَأَلَ، فَإِذَا قَالَ الْعَبْدُ: {الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ}، قَالَ اللهُ تَعَالَى: حَمِدَنِي عَبْدِي، وَإِذَا قَالَ: {الرَّحْمَنِ الرَّحِيمِ}، قَالَ اللهُ تَعَالَى: أَثْنَى عَلَيَّ عَبْدِي، وَإِذَا قَالَ: {مَالِكِ يَوْمِ الدِّينِ}، قَالَ: مَجَّدَنِي عَبْدِي - وَقَالَ مَرَّةً فَوَّضَ إِلَيَّ عَبْدِي - فَإِذَا قَالَ: {إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ}قَالَ: هَذَا بَيْنِي وَبَيْنَ عَبْدِي، وَلِعَبْدِي مَا سَأَلَ، فَإِذَا قَالَ: {اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ صِرَاطَ الَّذينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ}قَالَ: هَذَا لِعَبْدِي وَلِعَبْدِي مَا سَأَلَ. \"Barangsiapa shalat tanpa membaca Ummul Qur'an, maka shalatnya tidak sempurna, tidak sempurna, tidak sempurna.” Abu Hurairah di Tanya; ‘Bagaimana bila kami berada di belakang imam?’ Dia menjawab; ‘Bacalah Al Fatihah dengan suara lirih, karena aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: “Allah berfirman: 'Aku membagi shalat antara Aku dengan hambaKu setengah-setengah, dan hambaku mendapatkan apa yang dia minta. Apabila seorang hamba membaca; 'Alhamdulillahi rabbil 'alamin.’ Allah menjawab; ‘Hamba-Ku telah memuji-Ku.’ (ketika) seorang hamba membaca; ‘Arrahmaanir rahiim.’ Allah berfirman; ‘Hamba-Ku telah menyanjung-Ku.’ (ketika) seorang hamba membaca; ‘Maaliki yaumid diin.’ Allah berfirman; ‘Hamba-Ku telah mengagungkan-Ku.’ (ketika) seorang hamba membaca; ‘Iyyaaka na'budu wa iyyaka nasta'iin.’ Allah berfirman; ‘Inilah bagian-Ku dan bagian hamba-Ku, sedangkan bagi hamba-Ku apa yang di mintanya.’ (ketika) seorang hamba membaca; ‘Ihdinash shiraathal mustaqiim, shiraathal ladziina an'amta 'alaihim ghairil maghdluubi 'alaihim waladl dllaallliin.’ Allah berfirman; ‘Inilah bagian dari hamba-Ku, dan baginya apa yang di minta.’\" Demikianlah yang diriwayatkan oleh an-Nasa’i, dalam lafazh riwayat Muslim dan an-Nasa’i disebutkan: فنصفها ليى ونصفها لعبدي ولعبدي ما سأل (Setengahnya untuk-Ku dan setengah lagi untk hambaku, dan untuk hamba-Ku apa yang ia minta) PEMBAHASAN TENTANG HADITS INI, KHUSUSNYA BEBERAPA HAL TERKAIT AL-FATIHAH Dalam hadits ini al-Fatihah disebut juga dengan Shalaah maksudnya bacaan. Seperti firman Allah ta’ala: وَلَا تَجْهَرْ بِصَلَاتِكَ وَلَا تُخَافِتْ بِهَا وَابْتَغِ بَيْنَ ذَٰلِكَ سَبِيلًا “Dan janganlah kamu mengeraskan suaramu dalam shalatmu dan janganlah pula merendahkannya dan carilah jalan tengah di antara kedua itu.” (QS.al-Isra’:110). Maksudnya “bacaanmu”, sebagaimana dijelaskan dalam riwayat yang shahih dari Ibnu Abbas. Demikian juga Allah berfirman dalam hadits qudsi ini: “Aku telah membagi Shalah (bacaan al-Fatihah) menjadi dua bagian antara diri-Ku dan hamba-Ku. Separuh untuk diri-Ku dan separuh untuk hamba-Ku, dan bagi hamba-Ku apa yang ia minta.” Kemudian Allah menjelaskan pembagian itu secara rinci dalam bacaan al-Fatihah. Ini menunjukkan agungnya bacaan al-Fatihah dalam shalat dan itu merupakan rukun yang utama. Di sini disebutkan ibadah (shalat) sedang yang dimaksud adalah satu bagian darinya yaitu bacaan shalat. Sebagaimana disebutnya kata qur’aan (bacaan), sedangkan yang dimaksud adalah shalat, seperti dalam firman Allah: وَقُرْآنَ الْفَجْرِ ۖ إِنَّ قُرْآنَ الْفَجْرِ كَانَ مَشْهُودًا “Dan (dirikanlah pula shalat) subuh. Sesungguhnya shalat subuh itu disaksikan (oleh malaikat). Sebagaimana disebutkan secara jelas dalam kitab Shahih al-Bukhari dan Shahih Muslim: “Shalat Subuh itu disaksikan oleh Malaikat malam dan Malaikat siang. WAJIBNYA MEMBACA AL-FATIHAH DALAM SHALAT BAIK SEBAGAI IMAM, MAKMUM ATAUPUN SHALAT SENDIRIAN Seluruh penjelasan di atas menunjukkan bahwa bacaan al-Fatihah dalam shalat merupakan hal wajib menurut kesepakatan para ulama. Hal ini ditunjukkan oleh hadits yang telah disebutkan sebelumnya, yakni sabda Rasulullah saw: Yang dimaksud dengan khidaj adalah kurang, yakni tidak sempurna sebagaimana dijelaskan dalam lanjutan hadits tersebut dengan kata-kata (غير تمام). Disebutkan juga dalam kitab Shahih al-Bukhari dan Shahih Muslim, sebuah hadits dari ‘Ubadah bin ash-Shamit  ia berkata: “Rasulullah saw bersabda: Demikian pula hadits yang tercantum dalam Shahih Ibni Khuzaimah dan Shahih Ibnu Hibban dari Abu Hurairah  ia berkata: Rasulullah saw bersabda: Hadits-hadits dalam bab ini sangatlah banyak. [Maka setiap orang yang shalat wajib membaca Fatihatul Kitaab baik ia sebagai imam, makmum ataupun shalat munfarid (sendirian) dalam setiap shalat dan dalam setiap raka’at, dan itu menjadi suatu kemestian]. TAFSIR AL-ISTI’AADZAH DAN HUKUM-HUKUMNYA Allah  berfirman: خُذِ الْعَفْوَ وَأْمُرْ بِالْعُرْفِ وَأَعْرِضْ عَنِ الْجَاهِلِينَ # وَإِمَّا يَنْزَغَنَّكَ مِنَ الشَّيْطَانِ نَزْغٌ فَاسْتَعِذْ بِاللَّهِ ۚ إِنَّهُ سَمِيعٌ عَلِيمٌ “Jadilah Engkau Pema'af dan suruhlah orang mengerjakan yang ma'ruf, serta berpalinglah dari pada orang-orang yang bodoh. Dan jika kamu ditimpa sesuatu godaan syaitan Maka berlindunglah kepada Allah.” (QS. Al-A’raaf: 199-200). Allah juga berfirman: ادْفَعْ بِالَّتِي هِيَ أَحْسَنُ السَّيِّئَةَ ۚ نَحْنُ أَعْلَمُ بِمَا يَصِفُونَ # وَقُلْ رَبِّ أَعُوذُ بِكَ مِنْ هَمَزَاتِ الشَّيَاطِينِ # وَأَعُوذُ بِكَ رَبِّ أَنْ يَحْضُرُونِ “Tolaklah perbuatan buruk mereka dengan yang lebih baik. Kami lebih mengetahui apa yang mereka sifatkan. Dan Katakanlah: \"Ya Tuhanku aku berlindung kepada Engkau dari bisikan-bisikan syaitan. Dan aku berlindung (pula) kepada Engkau Ya Tuhanku, dari kedatangan mereka kepadaku.\" (QS.Al-Mukminun:96-98). Allah ta’ala berfirman: وَلَا تَسْتَوِي الْحَسَنَةُ وَلَا السَّيِّئَةُ ۚ ادْفَعْ بِالَّتِي هِيَ أَحْسَنُ فَإِذَا الَّذِي بَيْنَكَ وَبَيْنَهُ عَدَاوَةٌ كَأَنَّهُ وَلِيٌّ حَمِيمٌ # وَمَا يُلَقَّاهَا إِلَّا الَّذِينَ صَبَرُوا وَمَا يُلَقَّاهَا إِلَّا ذُو حَظٍّ عَظِيمٍ # وَإِمَّا يَنْزَغَنَّكَ مِنَ الشَّيْطَانِ نَزْغٌ فَاسْتَعِذْ بِاللَّهِ ۖ إِنَّهُ هُوَ السَّمِيعُ الْعَلِيمُ “Dan tidaklah sama kebaikan dan kejahatan. Tolaklah (kejahatan itu) dengan cara yang lebih baik, Maka tiba-tiba orang yang antaramu dan antara Dia ada permusuhan seolah-olah telah menjadi teman yang sangat setia. Sifat-sifat yang baik itu tidak dianugerahkan melainkan kepada orang-orang yang sabar dan tidak dianugerahkan melainkan kepada orang-orang yang mempunyai Keuntungan yang besar. Dan jika syetan mengganggumu dengan suatu gangguan, Maka mohonlah perlindungan kepada Allah. Sesungguhnya Dia-lah yang Maha mendengar lagi Maha mengetahui.” (QS. Fushshilat: 34-36). Tidak ada ayat lain yang memiliki makna seperti tiga ayat di atas. Allah  memerintahkan manusia agar beramah tamah dengan musuh dari kalangan manusia agar dan berbuat baiki kepadanya sehingga bisa mengembalikannya kepada tabi’at asalnya, dalam berteman dan berkasih sayang. Sebaliknya, Allah memerintahkan agar memohon perlindungan kepada-Nya dari syaitan jenis jin dan tidak ada cara selainnnya. Karena dia tidak menerima ramah tamah maupun kebaikan. Ia tidak menghendaki sesuatu pun, kecuali kebinasaan anak Adam. Hal ini disebabkan karena kerasnya permusuhan antara dia dengan anak Adam, sebagaimana firman Allah : يَا بَنِي آدَمَ لَا يَفْتِنَنَّكُمُ الشَّيْطَانُ كَمَا أَخْرَجَ أَبَوَيْكُمْ مِنَ الْجَنَّةِ يَنْزِعُ عَنْهُمَا لِبَاسَهُمَا لِيُرِيَهُمَا سَوْآتِهِمَا ۗ إِنَّهُ يَرَاكُمْ هُوَ وَقَبِيلُهُ مِنْ حَيْثُ لَا تَرَوْنَهُمْ ۗ إِنَّا جَعَلْنَا الشَّيَاطِينَ أَوْلِيَاءَ لِلَّذِينَ لَا يُؤْمِنُونَ “Hai anak Adam, janganlah sekali-kali kamu dapat ditipu oleh syaitan sebagaimana ia telah mengeluarkan kedua ibu bapamu dari surga, ia menanggalkan dari keduanya pakaiannya untuk memperlihatkan kepada keduanya 'auratnya. Sesungguhnya ia dan pengikut-pengikutnya melihat kamu dan suatu tempat yang kamu tidak bisa melihat mereka. Sesungguhnya Kami telah menjadikan syaitan-syaitan itu pemimpin-pemimpim bagi orang-orang yang tidak beriman.” (QS. Al-A’raf:27). Allah juga berfirman: إِنَّ الشَّيْطَانَ لَكُمْ عَدُوٌّ فَاتَّخِذُوهُ عَدُوًّا ۚ إِنَّمَا يَدْعُو حِزْبَهُ لِيَكُونُوا مِنْ أَصْحَابِ السَّعِيرِ “Sesungguhnya syaitan itu adalah musuh bagimu, Maka anggaplah ia musuh(mu), karena Sesungguhnya syaitan-syaitan itu hanya mengajak golongannya supaya mereka menjadi penghuni neraka yang menyala-nyala.” (QS.Fathir: 6). Dan Allah berfirman: وَإِذْ قُلْنَا لِلْمَلَائِكَةِ اسْجُدُوا لِآدَمَ فَسَجَدُوا إِلَّا إِبْلِيسَ كَانَ مِنَ الْجِنِّ فَفَسَقَ عَنْ أَمْرِ رَبِّهِ ۗ أَفَتَتَّخِذُونَهُ وَذُرِّيَّتَهُ أَوْلِيَاءَ مِنْ دُونِي وَهُمْ لَكُمْ عَدُوٌّ ۚ بِئْسَ لِلظَّالِمِينَ بَدَلًا “Dan (ingatlah) ketika Kami berfirman kepada Para Malaikat: \"Sujudlah kamu kepada Adam[884], Maka sujudlah mereka kecuali iblis. Dia adalah dari golongan jin, Maka ia mendurhakai perintah Tuhannya. Patutkah kamu mengambil Dia dan turanan-turunannya sebagai pemimpin selain daripada-Ku, sedang mereka adalah musuhmu? Amat buruklah iblis itu sebagai pengganti (dari Allah) bagi orang-orang yang zalim.” (QS.Al-Kahfi:50) Syaitan telah bersumpah kepada bapak kita Adam  bahwa dia adalah pemberi nasihat baginya, padahal dia berdusta. Lalu bagaimana pula mu’malah syaitan dengan kita? Sementara mereka telah berkata: قَالَ فَبِعِزَّتِكَ لَأُغْوِيَنَّهُمْ أَجْمَعِينَ # إِلَّا عِبَادَكَ مِنْهُمُ الْمُخْلَصِينَ “Iblis menjawab: \"Demi kekuasaan Engkau aku akan menyesatkan mereka semuanya, kecuali hamba-hamba-Mu yang mukhlis di antara mereka.” (QS.Shaad: 82-83). Allah juga berfirman: فَإِذَا قَرَأْتَ الْقُرْآنَ فَاسْتَعِذْ بِاللَّهِ مِنَ الشَّيْطَانِ الرَّجِيمِ # إِنَّهُ لَيْسَ لَهُ سُلْطَانٌ عَلَى الَّذِينَ آمَنُوا وَعَلَىٰ رَبِّهِمْ يَتَوَكَّلُونَ # إِنَّمَا سُلْطَانُهُ عَلَى الَّذِينَ يَتَوَلَّوْنَهُ وَالَّذِينَ هُمْ بِهِ مُشْرِكُونَ “Apabila kamu membaca Al Quran hendaklah kamu meminta perlindungan kepada Allah dari syaitan yang terkutuk. Sesungguhnya syaitan itu tidak ada kekuasaanNya atas orang-orang yang beriman dan bertawakkal kepada Tuhannya. Sesungguhnya kekuasaanNya (syaitan) hanyalah atas orang-orang yang mengambilnya Jadi pemimpin dan atas orang-orang yang mempersekutukannya dengan Allah.” (QS. An-Nahl: 98-100). ISTI’AADZAH SEBELUM MEMBACA AL-QUR’AN Makna firman Allah : فَإِذَا قَرَأْتَ الْقُرْآنَ فَاسْتَعِذْ بِاللَّهِ مِنَ الشَّيْطَانِ الرَّجِيمِ ”Apabila kamu membaca Al Quran hendaklah kamu meminta perlindungan kepada Allah dari syaitan yang terkutuk.” (QS.An-Nahl:98) Yakni jika engkau hendak membaca, (maka sebelumnya bacaalah isti’aadzhah (a’uudzu billah minasy syaithaanir rajiim) sebagaimana firman Allah : يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا قُمْتُمْ إِلَى الصَّلَاةِ فَاغْسِلُوا وُجُوهَكُمْ وَأَيْدِيَكُمْ “Hai orang-orang yang beriman, apabila kamu hendak mengerjakan shalat, Maka basuhlah mukamu dan tanganmu.” (QS.Al-Maidah: 6). Yakni jika engkau mengerjakan shalat, (maka berwudhu’lah terlebih dahulu). Hal ini juga berdasarkan hadits-hadits Nabi saw: Imam Ahmad bin Hambal  meriwayatkan sebuah hadits dari Abu Sa’id al-Khudri , ia berkata: “Apabila Rasulullah saw hendak mengerjakan shalat malam, maka beliau membuka shalatnya dengan bertakbir seraya mengucapkan: سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ، وَتَبَارَكَ اسْمُكَ، وَتَعَالَى جَدُّكَ، وَلَا إِلَهَ غَيْرُكَ “Mahasuci Engkau ya Allah, dan segala puji bagi-Mu. Maha Agung Nama-Mu dan Mahatinggi kemuliaan-Mu. Tidak ada ilah yang berhak diibadahi dengan benar kecuali Engkau.” Kemudian beliau membaca لا إله إلا الله sebanyak tiga kali. Setelah itu beliau mengucapkan: أَعُوذُ بِالله مِنَ الشَّيْطَانِ الرَّجِيمِ مِنْ هَمْزِهِ وَنَفْخِهِ وَنَفْثِهِ “Aku berlindung kepada Allah Yang Maha Mendengar lagi Maha Mengetahui dari syaitan yang terkutuk, dari godaan, tiupan dan hembusannya).” Hadits ini juga diriwayatkan oleh para penulis kitab Sunan yang empat. At-Tirmidzi mengatakan bahwa hadits ini adalah hadits paling masyhur dalam masalah ini. Kata al-hamz ditafsirkan dengan cekikan (yang menyebabkan kematian), kata an-nafkh ditafsirkan dengan kesombongan dan an-nafth dengan sya’ir. Sebagaimana diriwayatkan oleh Abu Daud dan Ibnu Majah dari Jubair bin Muth’im dari ayahnya, ia berkata: “Aku melihat Rasulullah saw ketika mulai mengerjakan shalat, beliau mengucapkan: اللَّهُ أَكْبَرُ كَبِيرًا ثَلَاثَا، وَالْحَمْدُ لِلَّهِ كَثِيرًا ثَلَاثَا، وَسُبْحَانَ اللَّهِ بُكْرَةً وَأَصِيلًا ثَلَاثَا، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الشَّيْطَانِ الرَّجِيمِ، مِنْ هَمْزِهِ وَنَفْخِهِ وَنَفْثِهِ “Allahu Akbar kabiiraa (Allah Mahabesar), sebanyak tiga kali, Alhamdulillaahi kathira (segala puji bagi Allah dengan pujian yang banyak) sebanyak tiga kali dan Subhanallah bukratan wa shiila (Mahasuci Allah di waktu pagi dan petang) sebanyak tiga kali. Ya Allah, sesungguhnya aku berlindung kepada-Mu dari ganguan syaitan yang terkutuk, dari godaan, tiupan dan hembusannya).” ‘Amr berkata: “Makna al-hamz adalah cekikan (yang menyebabkan kematian), an-nafkh adalah kesombongan dan an-nafth adalah sya’ir.” Ibnu Majah meriwayatkan, telah menceritakan kepada kami ‘Ali bin al-Mundzir, telah menceritakan kepada kami Ibnu Fudhail, telah menceritakan kepada kami ‘Atha’ bin as-Sa’ib dari Abu ‘Abdirahman as-Sulami dari Ibnu Mas’ud dari Nabi saw, beliau bersabda: اللهم إنى أَعُوذُ بِك مِنَ الشَّيْطَانِ الرَّجِيمِ مِنْ هَمْزِهِ وَنَفْخِهِ وَنَفْثِهِ “Ya Allah, sesungguhnya aku berlindung kepada-Mu dari (ganguan) syaitan787 Ibnu Majah berkata, “Al-hamz artinya al-mautah (cekikan yang menyebabkan kematian), an-nafkh adalah kesombongan dan an-nafth adalah sya’ir. MEMBACA TA’AWWUDZ KETIKA MARAH Al-Hafiz Abu Ya’la Ahmad bin Ali bin Al-Mutsanna Al Musholi meriwayatkan dalam kitab Musnahnya dari Ubay Bin ka'ab , ia berkata: “ Dua orang laki-laki bertengkar di hadapan Nabi , hidung salah seorang dari keduanya mengembang dan mengempis karena marah. Maka beliau bersabda: “ Sesungguhnya aku mengetahui suatu kalimat yang jika ia mengucapkannya, niscaya akan hilang semua yang ia rasakan. Yaitu ucapan: أعوذ بالله من الشيطان الرجيم “ audzubillahi minas syaiton nirojim (Aku berlindung kepada Allah dari setan yang terkutuk) . ” Demikian yang diriwayatkan oleh an-Nasa’i dalam kitab ‘Amalul Yaum wal Lailah. Al-Bukhari meriwayatkan dari Sulaiman Shurad  ia berkata: “ Ada dua orang laki-laki saling mengejek di hadapan Nabi , sedang kami duduk di hadapan beliau. Salah seorang dari keduanya mengejek yang lainnya dalam keadaan marah dan wajah yang memerah. Maka Rasulullah  bersabda: إِنِّي لَأَعْلَمُ كَلِمَةً لَوْ قَالَهَا ذَهَبَ عَنْهُ مَا يَجِدُ، لَوْ قَالَ: أَعُوذُ بِاللَّهِ مِنَ الشَّيْطَانِ “Sesungguhnya aku mengetahui suatu kalimat yang jika ia mengucapkannya niscaya akan hilang kemarahannya yaitu ucapan: a'udzu billahi minas syaiton nirojim ( Aku berlindung kepada Allah dari syaitan yang terkutuk ).” Maka para sahabat berkata kepada orang itu: “ Tidakkah engkau apa yang disabdakan ya Rasulallah? ” orang itu menjawab: sesungguhnya aku bukanlah orang yang kurang akal.” Hadits ini juga diriwayatkan oleh Muslim, Abu Dawud dan An-Nasa'i. Masih banyak hadits-hadits yang menyebutkan tentang isti'adzah ini yang terlalu panjang pembahasannya jika disebutkan di sini, tempat pembahasannya dalam kitab al-Adzkar (kumpulan dzikir) dan Fadhoil al-A’mal (amalan-amalan yang utama), wallahua’lam. ISTI’AADZAH WAJIB ATAUKAH SUNNAH (MASALAH ) Jumhur ulama berpendapat bahwa isti'adzah itu hukumnya sunnah bukan suatu kewajiban yang jika seseorang meninggalkannya ia berdosa. Imam ar Razi menceritakan dari Atha' bin Abi Rabah tentang wajibnya isti'adzah dalam shalat atau di luar shalat ketika membaca Al-Qur’an. Ar-Razi berhujjah dengan riwayat Atha' dengan makna Zahir ayat ﭽ ﮠﭼ “Maka hendaklah kamu meminta perlindungan.” Ini adalah perintah yang zhahirnya menunjukkan wajib. Juga karena nabi  rutin melakukannya. Juga karena isti'adzah dapat menolak keburukan syaitan. Sedangkan suatu perkara yang tidak sempurna sebuah kewajiban kecuali dengannya, maka perkara itu pun wajib. Disamping itu isti'adzah menunjukkan kehati-hatian. Maka, Jika seorang yang berlindung mengucapkan “Auudzu billaahi minasy syaitonir rojiim, ” maka cukup baginya. SEBAGIAN RAHASIA ISTI’AADZAH Diantara manfa'atnya adalah untuk mensucikan mulut dari kata-kata yang sia-sia dan kotor juga mengharumkan nya dari semua itu. Isti'adzah digunakan untuk membaca firman-firman Allah. Isti'adzah mengandung arti memohon pertolongan kepada Allah, mengakui kekuasaannya sekaligus kelemahan dirinya sebagai seorang hamba dan sebuah pengakuan ketidakberdayaan lawan sejati yang tersembunyi di mana seorang pun tidak mampu menolak & mengusirnya kecuali Allah yang telah menciptakannya. Di mana syaitan tidak bisa diajak berpura-pura juga tidak bisa dipengaruhi dengan kebaikan. Berbeda dengan musuh jenis manusia. Sebagaimana yang telah ditunjukkan tentang hal itu dalam 3 ayat di surat-surat Al-Matsani (yaitu Al A'raf: 200, al-Mu'minun: 97, Fushilat: 35), dan firman Allah ta'ala: إِنَّ عِبَادِي لَيْسَ لَكَ عَلَيْهِمْ سُلْطَانٌ ۚ وَكَفَىٰ بِرَبِّكَ وَكِيلًا “Sesungguhnya hamba-hamba-Ku, kamu tidak dapat berkuasa atas mereka. dan cukuplah Tuhan-mu sebagai Penjaga.” (QS.al-Israa’:65). Malaikat Allah turun untuk memerangi musuh dari kalangan manusia, maka barangsiapa dibunuh oleh musuh dari kalangan manusia yang terlihat ia mati syahid. sebaliknya, barang siapa yang terbunuh oleh musuh tak terlihat (syaitan) maka ia menjadi terusir. Barang siapa yang dikalahkan oleh musuh nyata ia mendapatkan pahala, sebaliknya barang siapa dikalahkan oleh musuh yang tidak terlihat maka tertipu dan menanggung dosa. Ketika syaitan melihat manusia dan manusia tidak bisa melihatnya maka ia meminta pertolongan kepada yang melihat setan dan setan tidak bisa melihatnya (Allah). (Pasal) Isti'adzah artinya memohon perlindungan dan bersandar kepada Allah dari kejahatan segala yang jahat. Kata al-'iyaadzah digunakan untuk mohon pertolongan dalam menolak kejahatan, sedangkan kata al-liyaadz untuk memohon pertolongan dalam meraih kebaikan. MAKNA ISTI’ADZAH Makna Au’dzu billahi minasy syaitonir rojiim adalah aku memohon perlindungan kepada Allah dari syaitan yang terkutuk agar ia tidak membahayakan diriku dalam urusan agama dan duniaku, atau menghalangiku untuk mengerjakan apa yang engkau perintahkan atau menyuruhku untuk mengerjakan apa yang engkau larang. Karena tidak ada yang mampu mencegah godaan syaitan dari manusia kecuali Allah. Oleh karena itu, Allah memerintahkan agar membujuk syaitan dari jenis manusia dan berbuat baik kepadanya agar dapat merubah tabi’at dan kebiasaannya mengganggu. Akan tetapi, Allah memerintahkan berlindung kepadanya dari syaitan bangsa jin, karena ia tidak menerima pemberian dan tidak dapat diberikan iming-iming juga tidak terpengaruh dengan kebaikan. Tabiat mereka jahat dan tidak ada yang dapat mencegahnya kecuali yang telah menciptakannya. Inilah makna yang terkandung dalam tiga ayat al-qur'an di mana saya tidak mengetahui ada ayat ke 4 yang semakna. Yaitu firman Allah dalam surat al-A'raf: خُذِ الْعَفْوَ وَأْمُرْ بِالْعُرْفِ وَأَعْرِضْ عَنِ الْجَاهِلِينَ “Jadilah Engkau Pema'af dan suruhlah orang mengerjakan yang ma'ruf, serta berpalinglah dari pada orang-orang yang bodoh. (QS. Al-A’raaf: 199) Ayat di atas berkenaan dengan mu’amalah terhadap musuh dari kalangan manusia. Dilanjutkan dengan firman-Nya: وَإِمَّا يَنْزَغَنَّكَ مِنَ الشَّيْطَانِ نَزْغٌ فَاسْتَعِذْ بِاللَّهِ ۚ إِنَّهُ سَمِيعٌ عَلِيمٌ ”Dan jika kamu ditimpa sesuatu godaan syaitan Maka berlindunglah kepada Allah.” (QS. Al-A’raaf: 200). Allah berfirman dalam surat al-Mu’minun: ادْفَعْ بِالَّتِي هِيَ أَحْسَنُ السَّيِّئَةَ ۚ نَحْنُ أَعْلَمُ بِمَا يَصِفُونَ # وَقُل رَّبِّ أَعُوذُ بِكَ مِنْ هَمَزَاتِ الشَّيَاطِينِ # وَأَعُوذُ بِكَ رَبِّ أَن يَحْضُرُونِ “Tolaklah perbuatan buruk mereka dengan yang lebih baik. Kami lebih mengetahui apa yang mereka sifatkan. Dan Katakanlah: \"Ya Tuhanku aku berlindung kepada Engkau dari bisikan-bisikan syaitan. Dan aku berlindung (pula) kepada Engkau Ya Tuhanku, dari kedatangan mereka kepadaku.\"(QS.al-Mu’minun: 96-98). Allah berfirman dalam surat Fushshilat: وَلَا تَسْتَوِي الْحَسَنَةُ وَلَا السَّيِّئَةُ ۚ ادْفَعْ بِالَّتِي هِيَ أَحْسَنُ فَإِذَا الَّذِي بَيْنَكَ وَبَيْنَهُ عَدَاوَةٌ كَأَنَّهُ وَلِيٌّ حَمِيمٌ # وَمَا يُلَقَّاهَا إِلَّا الَّذِينَ صَبَرُوا وَمَا يُلَقَّاهَا إِلَّا ذُو حَظٍّ عَظِيمٍ # وَإِمَّا يَنْزَغَنَّكَ مِنَ الشَّيْطَانِ نَزْغٌ فَاسْتَعِذْ بِاللَّهِ ۖ إِنَّهُ هُوَ السَّمِيعُ الْعَلِيمُ Dan tidaklah sama kebaikan dan kejahatan. Tolaklah (kejahatan itu) dengan cara yang lebih baik, Maka tiba-tiba orang yang antaramu dan antara Dia ada permusuhan seolah-olah telah menjadi teman yang sangat setia. Sifat-sifat yang baik itu tidak dianugerahkan melainkan kepada orang-orang yang sabar dan tidak dianugerahkan melainkan kepada orang-orang yang mempunyai Keuntungan yang besar. Dan jika syetan mengganggumu dengan suatu gangguan, Maka mohonlah perlindungan kepada Allah. Sesungguhnya Dia-lah yang Maha mendengar lagi Maha mengetahui. (QS.Fushshilat: 34-36). ASAL PENAMAAN SYAITAN Dalam bahasa Arab, kata syaitan berasal dari شَطَنَ yang berarti jauh, artinya tabiat syaitan beda jauh dari tabi’at manusia. Juga karena jauh dari kebaikan karena sifat fasiqnya. Ada juga yang mengatakan bahwa kata syaitan itu jelaskan berasal dari kata شَاطَ (terbakar), karena ia diciptakan dari api. Ada juga yang mengatakan bahwa kedua makna tersebut benar akan tetapi makna pertama lebih tepat. Menurut Sibawaih, orang Arab mengatakan تَشَيْطَنَ فُلانٌ apabila si fulan itu berbuat seperti perbuatan syaitan. Jika kata syaitan itu berasal dari kataشَاطَ tentunya mereka akan mengatakan تَشَيَّطَ, maka menurut pendapat yang benar, kata syaitan berasal kataشَطَنَ yang berarti jauh. Oleh karena itu mereka menyebut setiap yang durhaka baik dari kalangan jin, manusia maupun hewan dengan sebutan syaitan. Allah  berfirman: وَكَذَٰلِكَ جَعَلْنَا لِكُلِّ نَبِيٍّ عَدُوًّا شَيَاطِينَ الْإِنْسِ وَالْجِنِّ يُوحِي بَعْضُهُمْ إِلَىٰ بَعْضٍ زُخْرُفَ الْقَوْلِ غُرُورًا ۚ وَلَوْ شَاءَ رَبُّكَ مَا فَعَلُوهُ ۖ فَذَرْهُمْ وَمَا يَفْتَرُونَ “Dan Demikianlah Kami jadikan bagi tiap-tiap Nabi itu musuh, Yaitu syaitan-syaitan (dari jenis) manusia dan (dan jenis) jin, sebahagian mereka membisikkan kepada sebahagian yang lain perkataan-perkataan yang indah-indah untuk menipu (manusia). Jikalau Tuhanmu menghendaki, niscaya mereka tidak mengerjakannya, Maka tinggalkanlah mereka dan apa yang mereka ada-adakan.” (QS.al-An’am:112) Dalam Musnad Imam Ahmad disebutkan sebuah hadits dari Abu Dzar , ia berkata: “Rasulullah  bersabda: يَا أَبَا ذَرٍّ تَعَوَّذْ بِاللَّهِ مِنْ شَرِّ شَيَاطِينِ الْإِنْسِ وَالْجِنِّ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ وَلِلْإِنْسِ شَيَاطِينُ قَالَ نَعَمْ \"Wahai Abu Dzar, berlindunglah pada Allah dari gangguan setan manusia dan jin.\" Aku bertanya, \"Wahai Rasulullah, apakah ada setan dari manusia?\" Beliau menjawab: \"Ya.\" Dalam Shahih Muslim diriwayatkan sebuah hadits yang juga dari sahabat Abu Dzar, ia berkata: “Rasulullah  bersabda: يَقْطَعُ صَلَاتَهُ الْحِمَارُ وَالْمَرْأَةُ وَالْكَلْبُ الْأَسْوَدُ قُلْتُ يَا أَبَا ذَرٍّ مَا بَالُ الْكَلْبِ الْأَسْوَدِ مِنْ الْكَلْبِ الْأَحْمَرِ مِنْ الْكَلْبِ الْأَصْفَرِ قَالَ يَا ابْنَ أَخِي سَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَمَا سَأَلْتَنِي فَقَالَ الْكَلْبُ الْأَسْوَدُ شَيْطَانٌ “Shalatnya akan terputus oleh keledai, wanita, dan anjing hitam.' Aku bertanya, 'Wahai Abu Dzarr, apa perbedaan anjing hitam dari anjing merah dan kuning? Dia menjawab, 'Aku pernah pula menanyakan hal itu kepada Rasulullah shallallahu'alaihiwasallam sebagaimana kamu menanyakannya kepadaku, maka jawab beliau, 'Anjing hitam itu syaitan.” Ibnu Jariri  meriwayatkan bahwa sayyidina Umar bin al-Khattab  menaiki kuda besar dan gagah, namun kuda itu berjalan dengan lagak, maka beliau memukulnya, akan tetapi malah bertambah lagak jalannya, sehingga beliau turun dari kuda tersebut. Beliau berkata: “Tidaklah kalian membawakan kepadaku kecuali syaitan. Aku tidak turun darinya hingga aku mengingkari.” MAKNA AR-RAJIIM Ar-rajiim berwazan فعيل (subyek) bermakna مفعول (obyek). Maknanya bahwa syaitan itu dikutuk dan dijauhkan dari segala kebaikan. Sebagaimana firman Allah : وَلَقَدْ زَيَّنَّا السَّمَاءَ الدُّنْيَا بِمَصَابِيحَ وَجَعَلْنَاهَا رُجُومًا لِلشَّيَاطِينِ ۖ وَأَعْتَدْنَا لَهُمْ عَذَابَ السَّعِيرِ “Sesungguhnya Kami telah menghiasi langit yang dekat dengan bintang-bintang, dan Kami jadikan bintang-bintang itu alat-alat pelempar syaitan, dan Kami sediakan bagi mereka siksa neraka yang menyala-nyala.” (QS.al-Mulk:5) Allah  berfirman: إِنَّا زَيَّنَّا السَّمَاءَ الدُّنْيَا بِزِينَةٍ الْكَوَاكِبِ # وَحِفْظًا مِنْ كُلِّ شَيْطَانٍ مَارِدٍ # لَا يَسَّمَّعُونَ إِلَى الْمَلَإِ الْأَعْلَىٰ وَيُقْذَفُونَ مِنْ كُلِّ جَانِبٍ # دُحُورًا ۖ وَلَهُمْ عَذَابٌ وَاصِبٌ # إِلَّا مَنْ خَطِفَ الْخَطْفَةَ فَأَتْبَعَهُ شِهَابٌ ثَاقِبٌ “Sesungguhnya Kami telah menghias langit yang terdekat dengan hiasan, Yaitu bintang-bintang. Dan telah memeliharanya (sebenar-benarnya) dari Setiap syaitan yang sangat durhaka. Syaitan syaitan itu tidak dapat mendengar-dengarkan (pembicaraan) Para Malaikat dan mereka dilempari dari segala penjuru. Untuk mengusir mereka dan bagi mereka siksaan yang kekal. Akan tetapi Barangsiapa (di antara mereka) yang mencuri-curi (pembicaraan); Maka ia dikejar oleh suluh api yang cemerlang.” (QS.Ash-Shaffaat:6-10). Firman Allah : وَلَقَدْ جَعَلْنَا فِي السَّمَاءِ بُرُوجًا وَزَيَّنَّاهَا لِلنَّاظِرِينَ # وَحَفِظْنَاهَا مِنْ كُلِّ شَيْطَانٍ رَجِيمٍ # إِلَّا مَنِ اسْتَرَقَ السَّمْعَ فَأَتْبَعَهُ شِهَابٌ مُبِينٌ “Dan Sesungguhnya Kami telah menciptakan gugusan bintang-bintang (di langit) dan Kami telah menghiasi langit itu bagi orang-orang yang memandang (Nya). Dan Kami menjaganya dari tiap-tiap syaitan yang terkutuk. Kecuali syaitan yang mencuri-curi (berita) yang dapat didengar (dari malaikat) lalu Dia dikejar oleh semburan api yang terang.” (QS. Al-Hijr:16-18) Dan ayat-ayat lainnya. Ada yang berpendapat bahwa kata رجيم bermakna راجم (yang melempar). Karena syaitan melemparkan kepada manusia rasa waswas dan bisikan. Hanya saja makna yang pertama lebih masyhur dan lebih tepat. AL-FATIHAH, AYAT 1 Para Sahabat memulai Kitabullah dengan Basmalah. Para ulama sepakat bahwa بسم الله الرحمن الرحيم merupakan salah satu ayat dari surat an-Naml. Tetapi mereka berbeda pendapat, apakah ia merupakan ayat yang berdiri sendiri pada setiap awal surat, atau merupakan bagian dari awal masing-masing surat yang ditulis pada pembukaannya, atau merupakan salah satu ayat dari setiap surat. Di antara Sahabat yang menyatakan bahwa basmalah adalah ayat dari setiap surat kecuali surat at-Taubah adalah Ibnu ‘Abbas, Ibnu ‘Umar, Ibnu Zubar, Abu Hurairah dan ‘Ali. Sedangkan dari kalangan Tabi’in adalah ‘Atha’, Thawus, Sa’id bin Jubair, Makhul dan az-Zuhri. Hal yang sama juga dikatakan oleh ‘Abdullah Ibnu Mubaral. Imam asy-Syafi’I, Ahmad bin Hambal (menurut satu riwayat), Ishaq bin Rahawaih, dan Abu ‘Ubaid al-Qasim bin Salam. Sedangkan Malik dan Abu Hanifah dan ulama yang sependapat dengannya mengatakan bahwa basmalah tidak termasuk ayat dari surat al-Fatihah, tidak juga surat-surat yang lain. Menurut Daud, basmalah terletak pada awal setiap surat akan tetapi bukan bagian darinya. Demikian pula menurut satu riwayat dari Imam Ahmad bin Hambal. HUKUM JAHR (DIKERASKAN) DAN ISRAAR (DIPELANKAN) BASMALAH KETIKA SHALAT JAHRIYAH Mengenai bacaan basmalah secara jahr, maka yang berpendapat bahwa basmalah itu bukan termasuk ayat surat al-Fatihah, maka membacanya tidak jahr . Demikian juga yang mengatakan bahwa basmalah adalah satu ayat dari awal al-Fatihah. Adapun mereka yang berpendapat bahwa basmalah merupakan bagian pertama dari setiap surat, dalam hal ini mereka berbeda pendapat. Imam Syafi’I  berpendapat bahwa basmalah dibaca secara jahr bersama al-Fatihah dan juga surat-surat lainnya. Inilah mdzhab sekelompok Sahabat, Tabi’in serta pendapat ulama Salaf maupun Khalaf. Di antara Sahabat yang membacanya secara jahr adalah Abu Hurairah, Ibnu ‘Umar, Ibnu Abbas dan Mu’wiyah . Ibnu ‘Abdil Barr dan al-Baihaqi meriwayatkan dari ‘Umar dan ‘Ali. Al-Khatib meriwayatkan termasuk khalifah yang empat yaitu Abu Bakar, ‘Umar, ‘Utsman dan Ali. Akan tetapi riwayat ini ghariib. Sedangkan dari Tabi’in diantaranya Sa’id bin Jubair, ‘Ikrimah, Abu Qilabah, az-Zuhri, Ali bin al-Hasan dan putranya Muhammad bin Ali, Sa’id bin al-Musayyab, ‘Atha’, Thawus, Mujahid, Salim, Muhammad bin Ka’ab al-Quradzi, Abu Bakar bin Muhammad ‘Amr bin Hazm, Abu Wa-il, Ibnu Sirin, Muhammad bin al-Munkadir, ‘Ali bin ‘Abdillah bin ‘Abbas dan anaknya yakni Muhammad, Nafi’ maula Ibnu ‘Umar, Zaid bin Aslam, ‘Umar bin ‘Abdil ‘Aziz, al-Azraq bin Qais, Habib bin Abi Tsabit, Abu asy-Sya’tsa’, Makhul dan ‘Abdullah bin Ma’qil bin Muqrin. Al-Baihaqi menambahkan: ‘Abdullah bin Shafwan dan Muhammad bin al-Hanafiyah. Sementara Ibnu ‘Abdil Barr menambahkan ‘Amr bin Dinar. Adapun dalilny adalah karena basmalah bagian dari al-Fatihah. Maka ia pun dibacar keras seperti ayat-ayat lainnya. Demikian juga telah diriwayatkan oleh an-Nasa’i dalam kitab Sunan, Ibnu Khuzaimah dan Ibnu Hibban dalam kitab Shahih mereka, serta al-Hakim dalam al-Mustadrak dari Abu Hurairah  bahwasanya beliau mengerjakan shalat dan membaca basmalah secara jahr. Setelah selesai beliau mengatakan: “Aku yang paling mirip sholatnya dengan Rasulullah  di banding kalian.” Hadits ini dishahihkan oleh ad-Daaruquthni, al-Khatib, al-Baihaqi dan yang lainnya. Dalam Shahih Bukhari disebutkan sebuah hadits yang diriwayatkan dari Anas bin Malik , bahwa beliau pernah ditanya tentang shalat Rasulullah , maka beliau menjawab: “Bacaan beliau itu sesuai dengan panjang pendeknya.” Kemudian Anas membaca bismillahirahmaanirahiim, dengan memanjangkan kalimat bismillah, lalu ar-Rahmaan dan ar-Rahiim Diriwayatkan dalam Musnad Imam Ahmad, Sunan Abi Daud, Shahih Ibnu Khuzaimah dan Mustadrak al-Hakim dari Ummu Salamah , beliau berkata: “Rasulullah  memutus-mutus bacaan beliau di setiap akhir ayat:”Bismillaahir rahmaanir rahiim. Alhamdulillaahi Rabbil ‘aalamiin. Ar-rahmaanir rahiim. Maaliki yaumiddiin.” Imam al-Daruquthni mengatakan, “Sanad-sanadnya shahih.”Imam Syafi’I dan al-Hakim dalam kitab Mustadraknya meriwayatkan dari Anas, bahwasanya Mu’awiyah mengerjakan shalat di Madinah dan beliau meninggalkan basmalah (tidak mengeraskan bacaannya), maka para Sahabat Muhajirin mengingkarinya. Kemudian Mu’awiyah mengerjakan shalat untuk kedua kalinya dengan membaca basmalah secara jahr.” Semua hadits dan atsar yang kami sebutkan di atas kiranya sudah cukup menjadi hujjah bagi pendapat ini atas pendapat yang menentangnya. Adapun tentang riwayat-riwayat lain yang bertentangan dan asing, tentang jalur-jalurnya, mengetahui kecacatannya, kedhaifannya serta penetapannya dijelaskan pada tempat yang lain. Sebagian ulama yang lain berpendapat bahwa basmalah tidak dibaca jahr dalam shalat. Inilah pendapat yang shahih dari Khalifah yang empat, Abdullah bin Mughaffal, dan beberapa golongan ulama salaf dari kalangan Tabi’in dan ulama khalaf. Ini pula yang menjadi pendapat madzhab Abu Hanifah, ats-Tsauri dan Ahmad bin Hambal. Adapun menurut Imam Malik, basmalah tidak dibaca sama sekali, baik secara jahr maupun sirr. Mereka berdalil dengan hadits yang terdapat dalam Shahih Muslim dari ‘Aisyah , beliau berkata: “Rasulullah  membuka shalat dengan takbir dan bacaan alhamdu lillaahi Rabbil ‘aalamiin.” Diriwayatkan pula dalam Shahih Bukhari dan Shahih Muslim dari Anas bin Malik, ia menceritakan:”Aku pernah shalat di belakang Nabi , Abu Bakar, ‘Umar, dan ‘Utsman. Mereka semua membuka shalat dengan bacaan alhamdu lillaahi Rabbil ‘aalamiin.” Menurut riwayat Muslim:” Mereka tidak menyebutkan “Bismillaahirrrahmaanirahiim” pada awal bacaan dan tidak juga pada akhirnya.” Hal yang sama juga terdapat dalam kitab-kitab Sunan diriwayatkan dari ‘Abdullah bin Mughaffal . Demikianlah dasar-dasar pengambilan pendapat para imam mengenai masalah ini. Pendapat mereka tidaklah jauh berbeda, karena mereka semua sepakat bahwa orang yang shalat, baik membaca basmalah secara jahr maupun secara sirr keduanya adalah sah. Segala puji dan karunia hanyalah milik Allah . Pasal: KEUTAMAAN BASMALAH Imam Ahmad bin Hambal dalam Musnadnya meriwayatkan dari seorang Sahabat yang membonceng Nabi , ia berkata: “ لَا تَقُلْ: تَعِسَ الشَّيْطَانُ، فَإِنَّكَ إِذَا قُلْتَ: تَعِسَ الشَّيْطَانُ، تَعَاظَمَ، وَقَالَ: بِقُوَّتِي صَرَعْتُهُ، وَإِذَا قُلْتَ: بِسْمِ اللهِ، تَصَاغَرَ حَتَّى يَصِيرَ مِثْلَ الذُّبَابِ “Janganlah engkau mengucapkan: ‘Celakalah syaitan.’ Karena jika engkau mengucapkannya, maka ia akan membesar dan berkata dengan kekuatannku, aku akan jatuhkan dia.’ Jika engkau mengucapkan bismillah, maka ia akan menjadi kecil hingga seperti seekor lalat.” An-Nasa’i juga meriwayatkan dalam kitab ‘Amalul Yaum wal Lalilah dan Ibnu Mardawaih dalam kitab tafsirnya dari Usamah bin ‘Umair, ia berkata:”Aku pernah dibonceng oleh Nabi ,” lalu ia menyebutkan kejadiannya, dan Nabi  bersabda: لَا تَقُلْ تَعِسَ الشَّيْطَانُ فَإِنَّهُ يَتعاَظَمُ حَتَّى يَكون كالْبَيْتِ وَيَقُولُ: بِقُوَّتِي صَرَعْتُهُ , وَلَكِنْ قُلْ: بِسْمِ اللهِ فَإِنَّهُ يَصْغُرُ حَتَّى يَكونَ كالذُّبَابَةِ “Jangan mengucapkan itu, karena syaitan akan membesar seperti rumah. Akan tetapi ucapkanlah: ‘Bismillah’, niscaya ia akan menjadi kecil seperti lalat.” Ini merupakan pengaruh dari keberkahan bismillah. DISUNNAHKAN MEMBACA BASMALAH SEBELUM MEMULAI SETIAP PEKERJAAN Oleh karena itu disunnahkan membaca basmalah pada awal setiap ucapanh maupun perbuatan. Disunnahkan juga membacanya pada awal khutbah berdasarkan dalil yang ada. Juga disunnahkan membacanya sebelum masuk ke kamar kecil, berdasarkan hadits dalam masalah ini. Demikian juga sebelum berwudhu’ berdasarkan hadits dalam Musnad Imam Ahmad dan juga dalam kitab-kitab Sunan dari riwayat Abu Hurairah, Sa’id bin Zaid dan Abu Sa’id  secara marfu’, Rasulullah  bersabda: لا وضوءَ لِمَن لم يَذكُرِ اسمَ الله عليه “Tidak sempurna wudhu’ yang tidak menyebut Nama Allah (mengucapkan basmalah) padanya.” Hadits ini hadits hasan. Demikian pula disunnahkan membacanya sebelum makan, berdasarkan hadits dari Shahih Muslim, bahwa Rasulullah  pernah bersabda kepada anak tiri beliau, ‘Umar bin Abi Salamah: قل بسْمَ اللهِ وكُلْ بِيَمِينِكَ، وَكُلْ مِمَّا يَلِيكَ “Ucapkan ‘bismillah’, makanlah dengan tangan kananmu dan makanlah makanan yang dekat darimu.” Disunnahkan juga membacanya ketika hendak berhubungan suami istri, berdasarkan hadits dalam kitab Shahih Bukhari dan Shahih Muslim, dari Ibnu ‘Abbas , bahwa Rasulullah  bersabda: لَوْ أَنَّ أَحَدَهُمْ إِذَا أَرَادَ أَنْ يَأْتِيَ أَهْلَهُ قَالَ: بِاسْمِ اللَّهِ، اللَّهُمَّ جَنِّبْنَا الشَّيْطَانَ، وَجَنِّبِ الشَّيْطَانَ مَا رَزَقْتَنَا، فَإِنَّهُ إِنْ يُقَدَّرْ بَيْنَهُمَا وَلَدٌ فِي ذَلِكَ لَمْ يَضُرَّهُ شَيْطَانٌ أَبَدًا “Seandainya salah seorang dari kalian hendak menggauli isterinya ia membaca: “Bismillah, Allahumma jannibnasy syaithaan wa jannibisy syaitaan maa razaqtanaa (Dengan menyebut Nama Allah, jauhkanlah kami dari syaitan dan jauhkanlah syaitan dari apa yang Engkau anugerahkan kepada kami), maka jika Allah menakdirkan lahirnya anak, maka anak itu tidak akan diganggu oleh syaitan selamanya.” DENGAN PERKATAAN APA LAFADZ ‘BISMILLAH’ BERSANDAR Dari uraian yang telah lalu jelaslah bagi kita bahwa dua pendapat di kalangan ahli Nahwu dalam masalah apa yang dikaitkan dengan huruf ‘ba’ pada ucapan bismillah, apakah ia isim (kata benda) atau kah fi’il (kata kerja), bahwa pendapat keduanya menyerupai. Kedua pendapat tersebut terdapat (landasan) di dalam al-Qur’an. Adapun jika mengaitkannya dengan kata benda, maka taqdir kalimatnya adalah perkataan bismillah ibtidaa’i (dengna menyebut Nama Allah permulaanku melakukan sesuatu perbuatan). Seperti firman Allah : وَقَالَ ارْكَبُوا فِيهَا بِسْمِ اللَّهِ مَجْرَاهَا وَمُرْسَاهَا ۚ إِنَّ رَبِّي لَغَفُورٌ رَحِيمٌ “Dan Nuh berkata: \"Naiklah kamu sekalian ke dalamnya dengan menyebut nama Allah di waktu berlayar dan berlabuhnya.\" Sesungguhnya Tuhanku benar-benar Maha Pengampun lagi Maha Penyayang.” (QS.Huud:41). Adapun mengaitkannya dengan kata kerja, baik bentuk perintah maupun berita, misalnya: ‘ibda’ bismillah (mulailah dengan menyebut Nama Allah) atau ‘ibtada’tu bismillah’ (aku memulai dengan bismillah), maka seperti firman Allah : اقْرَأْ بِاسْمِ رَبِّكَ الَّذِي خَلَقَ “Bacalah dengan (menyebut) nama Tuhanmu yang Menciptakan.” (QS.al-‘Alaq: 1) Keduanya benar, karena fi’il pasti memiliki mashdar (kata dasar). Maka engkau mentaqdirkan fi’il dan mashdarnya. Ia berkaitan dengan fi’il yang engkau sebutkan sebelumnya, seperti kata qiyaman (berdiri), qu’uudan (duduk), aklan (makan), wudhu’an (wudu’), atau shalatan (shalat). Maka yang disyari’atkan adalah menyebut Nama Allah sebelum memulai semua itu, untuk meraih berkah, kebaikan dan pertolongan agar pekerjaan itu sempurana dan dapat diterima. Wallahu a’lam. MAKNA LAFDZUL JALALAH (الله) (Allah) merupakan nama untuk al-Rabb tabaaraka wa ta’aala. Dikatakan bahwa Allah nama yang paling agung, karena nama itu menyandang semua sifat. Sebagaimana Allah berfirman: هُوَ اللَّهُ الَّذِي لَا إِلَٰهَ إِلَّا هُوَ ۖ عَالِمُ الْغَيْبِ وَالشَّهَادَةِ ۖ هُوَ الرَّحْمَٰنُ الرَّحِيمُ # هُوَ اللَّهُ الَّذِي لَا إِلَٰهَ إِلَّا هُوَ الْمَلِكُ الْقُدُّوسُ السَّلَامُ الْمُؤْمِنُ الْمُهَيْمِنُ الْعَزِيزُ الْجَبَّارُ الْمُتَكَبِّرُ ۚ سُبْحَانَ اللَّهِ عَمَّا يُشْرِكُونَ # هُوَ اللَّهُ الْخَالِقُ الْبَارِئُ الْمُصَوِّرُ ۖ لَهُ الْأَسْمَاءُ الْحُسْنَىٰ ۚ يُسَبِّحُ لَهُ مَا فِي السَّمَاوَاتِ وَالْأَرْضِ ۖ وَهُوَ الْعَزِيزُ الْحَكِيمُ “Dialah Allah yang tiada Tuhan selain Dia, yang mengetahui yang ghaib dan yang nyata, Dia-lah yang Maha Pemurah lagi Maha Penyayang.Dialah Allah yang tiada Tuhan selain Dia, Raja, yang Maha Suci, yang Maha Sejahtera, yang Mengaruniakan Keamanan, yang Maha Memelihara, yang Maha perkasa, yang Maha Kuasa, yang memiliki segala Keagungan, Maha suci Allah dari apa yang mereka persekutukan. Dialah Allah yang Menciptakan, yang Mengadakan, yang membentuk Rupa, yang mempunyai asmaaul Husna. bertasbih kepadanya apa yang di langit dan bumi. dan Dialah yang Maha Perkasa lagi Maha Bijaksana.” (QS.al-Hasyr:22-24). Dengan demikian semua Nama-Nama yang baik itu merupakan sifat-Nya, sebagaimana firman Allah : وَلِلَّهِ الْأَسْمَاءُ الْحُسْنَىٰ فَادْعُوهُ بِهَا ۖ وَذَرُوا الَّذِينَ يُلْحِدُونَ فِي أَسْمَائِهِ ۚ سَيُجْزَوْنَ مَا كَانُوا يَعْمَلُونَ “Hanya milik Allah asmaa-ul husna, maka bermohonlah kepada-Nya dengan menyebut Asmaul Husna itu.” (QS.al-A’raf:180). Juga firman Allah: قُلِ ادْعُوا اللَّهَ أَوِ ادْعُوا الرَّحْمَٰنَ ۖ أَيًّا مَا تَدْعُوا فَلَهُ الْأَسْمَاءُ الْحُسْنَىٰ ۚ وَلَا تَجْهَرْ بِصَلَاتِكَ وَلَا تُخَافِتْ بِهَا وَابْتَغِ بَيْنَ ذَٰلِكَ سَبِيلًا “Katakanlah: \"Serulah Allah atau serulah Ar-Rahman. dengan nama yang mana saja kamu seru, Dia mempunyai Al asmaaul husna (nama-nama yang terbaik) dan janganlah kamu mengeraskan suaramu dalam shalatmu dan janganlah pula merendahkannya dan carilah jalan tengah di antara kedua itu\". (QS.al-Isra’:110). Dalam kitab Shahih Bukhari dan Shahih Muslim diriwayatkan sebuah hadits dari Abu Hurairah  bahwa Rasulullah  bersabda: إِنَّ لِلَّهِ تِسْعَةً وَتِسْعِينَ اسْمًا، مِائَةً غَيْرَ وَاحِدٍ، مَنْ أَحْصَاهَا دَخَلَ الْجَنَّةَ “Sesungguhnya Allah memiliki 99 (sembilan puluh sembilan) nama, seratus kurang satu. Barangsiapa menjaganya, niscaya ia masuk Surga.” TAFSIR AR-RAHMAAN AR-RAHIIM Ar-Rahman dan ar-Rahiim meruapakan dua Nama dalam bentuk mubalaghah (bermakna lebih) yang berasal dari asal kata الرحمة, namun kata rahmaan memiliki makna lebih dalam. Dalam pernyataan Ibnu Jarir, dapat difahami adanya kesapakatan mengenai hal itu. Imam al-Qurthubi berkata: “Dalil yang menunjukkan bahwa nama ini musytaq (bukan asli) yang terbentuk dari kata lain adalah hadits yang diriwayatkan oleh at-Tirmidzi dari ‘Abdurrahman bin ‘Auf  bahwasanya ia mendengar Rasulullah  bersabda: قَالَ اللهُ عَزَّ وَجَلَّ: أَنَا الرَّحْمَنُ وَأَنَا خَلَقْتُ الرَّحِمَ، وَشَقَقْتُ لَهَا مِنَ اسْمِي، فَمَنْ وَصَلَهَا وَصَلَهُ اللهُ، وَمَنْ قَطَعَهَا قَطَعْتُه Allah ‘Azza wa Jalla berfirman: “Aku adalah ar-Rahmaan, Aku telah mencipkan rahiim (kekerabatan). Aku telah menjadikan untuknya nama dari Nama-Ku. Barangsiapa menyambungnya, maka Aku akan menyambungnya. Dan barang siapa memutuskannya, maka Aku akan memutusnya. Imam al-Qurthubi berkata: “Ini merupakan nash yang menunjukkan bahwa nama tersebut musytaq. Sedangkan pengingkaran orang-orang Arab terhadap nama ar-Rahman disebabkan kejahilan mereka tentang Allah dan apa yang wajib bagi-Nya.” Beliau melanjutkan, “Kemudian dikatakan, keduanya memiliki satu makna, misalnya kata nadmaan dan nadiim, demikian dikatakan oleh Abu ‘Ubaid. Ada juga yang mengatakan bahwasanya wazan (timbangan kata) فعلان tidak seperti فعيل. Karena kata fa’laan tidak digunakan kecuali pada fi’il yang memiliki makna lebih, seperti ucapanmu rajulun ghodhbaan untuk menyebut seorang laki-laki yang kemarahan sedang memuncak. Adapun fa’iil terkadang bermakna فاعل (subjek) atau مفعول (objek). Abu ‘Ali al-Farisi berkata: “Ar-Rahmaan merupakan nama yang bersifat umum meliputi segala bentuk rahmat, dan dikhususkan bagi Allah semata. Sedangkan ar-Rahiim ditunjukkan bagi orang-orang yang beriman. Allah berfirman: هُوَ الَّذِي يُصَلِّي عَلَيْكُمْ وَمَلَائِكَتُهُ لِيُخْرِجَكُمْ مِنَ الظُّلُمَاتِ إِلَى النُّورِ ۚ وَكَانَ بِالْمُؤْمِنِينَ رَحِيمًا “Dan adalah Dia Maha Penyayang kepada orang-orang yang beriman.” (QS. Al-Ahzab:43). Ibnu ‘Abbas  berkata: “Keduanya adalah dua nama yang mengandung kelembutan. Salah satunya lebih lembut dari yang lainnya, yakni lebih banyak mengandung rahmat.” Ibnu Jarir meriwayatkan: Telah berkata kepada kami as-Sarii bin Yahya at-Tamimi, telah berkata kepada kami ‘Utsman bin Zufar, aku mendengar al-‘Azrami berkata tentang ar-Rahmaan ar-Rahiim, ia berkata: “Ar-Rahmaan untuk seluruh makhluk dan ar-Rahiim untuk orang-orang yang beriman.” Mereka mengatakan: Karena Allah  berfirman: الرَّحْمَٰنُ عَلَى الْعَرْشِ اسْتَوَىٰ “Yang menciptakan langit dan bumi dan apa yang ada antara keduanya dalam enam masa, kemudian Dia bersemayam di atas Arsy. (Dialah) yang Maha pemurah.” (QS.al-Furqon:59). الرَّحْمَٰنُ عَلَى الْعَرْشِ اسْتَوَىٰ “(yaitu) Tuhan yang Maha Pemurah. yang bersemayam di atas 'Arsy.” (QS.Thaha: 5). Allah menyebutkan istiwa’ (bersemayam) dengan Nama ar-Rahmaan untuk meliputi seluruh makhluk dengan rahmat-Nya. (Adapun tentang makna ar-Rahiim) Allah berfirman: هُوَ الَّذِي يُصَلِّي عَلَيْكُمْ وَمَلَائِكَتُهُ لِيُخْرِجَكُمْ مِنَ الظُّلُمَاتِ إِلَى النُّورِ ۚ وَكَانَ بِالْمُؤْمِنِينَ رَحِيمًا “Dan adalah Dia Maha Penyayang kepada orang-orang yang beriman.”(QS. Al-Ahzab: 43). Dalam ayat ini Allah mengkhususkan dengan nama ar-Rahiim, ini menunjukkan bahwa ar-Rahmaan lebih mengandung rahmat karena keumumannya di dunia dan akhirat dan untuk seluruh makhluk-Nya. Adapun ar-Rahiim dikhususkan bagi orang-orang yang beriman. Akan tetapi disebutkan dalam sebuah do’a Rasulullah: “Rahman (pengasih) di dunia dan di akhirat dan Rahiim (penyayang) pada keduanya. Nama ar-Rahman khusus bagi Allah dan tidak boleh diberikan kepada selain-Nya. Sebagaimana firman Allah : قُلِ ادْعُوا اللَّهَ أَوِ ادْعُوا الرَّحْمَٰنَ ۖ أَيًّا مَا تَدْعُوا فَلَهُ الْأَسْمَاءُ الْحُسْنَىٰ ۚ وَلَا تَجْهَرْ بِصَلَاتِكَ وَلَا تُخَافِتْ بِهَا وَابْتَغِ بَيْنَ ذَٰلِكَ سَبِيلًا “Katakanlah: \"Serulah Allah atau serulah Ar-Rahman. dengan nama yang mana saja kamu seru, Dia mempunyai Al asmaaul husna (nama-nama yang terbaik \". (QS.al-Isra’:110). Firman Allah : وَاسْأَلْ مَنْ أَرْسَلْنَا مِن قَبْلِكَ مِن رُّسُلِنَا أَجَعَلْنَا مِن دُونِ الرَّحْمَٰنِ آلِهَةً يُعْبَدُونَ “Dan Tanyakanlah kepada Rasul-rasul Kami yang telah Kami utus sebelum kamu: \"Adakah Kami menentukan tuhan-tuhan untuk disembah selain Allah yang Maha Pemurah?.” (Az-Zhuruf:45) Oleh karena itu ketika Musailamah al-Kadzdzab dengan kesombongnnya menamakan dirinya dengan Rahmaanul Yamamah, maka Allah memakaikan kepadanya pakaian kebohongan dan terkenal dengannya. Dia tidak dipanggil melainkan dengan sebutgan Musailamah si pendusta. Maka jadilah ia lambang kebohongan bagi penduduk kota maupun penduduk desa dari kalangan Arab Badui. Oleh karena itulah didahulukan nama Allah yang tidak bisa penamaan oleh selain-Nya. Menyifatkan Allah terlebih dahulu dengan sifat ar-Rahman yang tidak boleh disandang oleh selain-Nya, sebagaimana firman Allah: قُلِ ادْعُوا اللَّهَ أَوِ ادْعُوا الرَّحْمَٰنَ ۖ أَيًّا مَا تَدْعُوا فَلَهُ الْأَسْمَاءُ الْحُسْنَىٰ ۚ وَلَا تَجْهَرْ بِصَلَاتِكَ وَلَا تُخَافِتْ بِهَا وَابْتَغِ بَيْنَ ذَٰلِكَ سَبِيلًا “Katakanlah: \"Serulah Allah atau serulah Ar-Rahman. dengan nama yang mana saja kamu seru, Dia mempunyai Al asmaaul husna (nama-nama yang terbaik).” (QS.al-Israa’:110). Adapun kepongan Musailamah dengan menamakan dirinya ¬Rahmann al-Yamamah tidak ada yang mengikutinya dalam hal ini kecuali orang yang bersamanya dalam kesesatan. Sementara ar-Rahiim Allah  menyiafatkan juga dengan sifat itu makhluknya. Allah berfirman: لَقَدْ جَاءَكُمْ رَسُولٌ مِنْ أَنْفُسِكُمْ عَزِيزٌ عَلَيْهِ مَا عَنِتُّمْ حَرِيصٌ عَلَيْكُمْ بِالْمُؤْمِنِينَ رَءُوفٌ رَحِيمٌ “Sungguh telah datang kepadamu seorang Rasul dari kaummu sendiri, berat terasa olehnya penderitaanmu, sangat menginginkan (keimanan dan keselamatan) bagimu, Amat belas kasihan lagi Penyayang terhadap orang-orang mukmin.” (QS. At-Taubah: 128). Sebagaimana Allah menyifatkan selain-Nya denga Nama-Nya yang lain. Seperti firman Allah: إِنَّا خَلَقْنَا الْإِنْسَانَ مِنْ نُطْفَةٍ أَمْشَاجٍ نَبْتَلِيهِ فَجَعَلْنَاهُ سَمِيعًا بَصِيرًا “Sesungguhnya Kami telah menciptakan manusia dari setetes mani yang bercampur[1535] yang Kami hendak mengujinya (dengan perintah dan larangan), karena itu Kami jadikan Dia mendengar dan melihat.” (QS. Al-Insaan:2). Dengan demikian dapat diambil kesimpulan bahwa di antara Nama-Nama Allah ada yang boleh diberikan kepada selain-Nya, dan ada juga yang tidak boleh diberikan , seperti ar-Rahmaan, al-Khaaliq, ar-Razzaaq dan lain sebagainya. Oleh karena itulah, Dia memulai dengan Nama-Nya (yang paling terkenal) yaitu Allah dan kemudian menyifatinya dengan ar-Rahmaan, karena ar-Rahmaan lebih khusus dan lebih dikenalo daripada ar-Rahiim. Nama yang disebutkan lebih dulu adalah nama yang paling mulia, oleh karena itu Allah memulai dengan menyebutg Nama-Nya yang lebih khusus dan seterusnya. Telah disebutkan dalam hadits Ummu Salamah bahwa Rasulullah  biasa memutus bacaan beliau huruf demi huruf: Bismillahirrahmaanirrahiim. Alhamdulillaahi Rabbil’aalamin. Arrahmaanirrahiim. Maalikiyaumiddiin. Maka sebagian ulama pun membacanya demikian. Tetapi di antara mereka ada pula yang menyambungnya antara Basmalah dan ayat selanjutnya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Firman Allah Ta’ala: }بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ{ Artinya: “ Dengan menyebut nama Allah Yang Maha Pengasih lagi Maha Penyayang” [بِسْمِ ] Bi ismi adalah susunan kata berupa al-Jaarr dan al-Majruur (sebuah istilah dalam ilmu nahwu) yang terkait dengan suatu kata yang tersembunyi setelahnya. Dan hakikat kata yang tersembunyi tersebut adalah katakerja yang diakhirkan yang cocok. Misalnya jika anda mengucapkan “Bismillaah” sedangkan anda hendak makan maka kata yang tersembunyi di sini adalah Bismillaah saya akan makan. Kita katakan (dalam kaedah bahasa Arab) Jar dan Majrur mesti terkait dengan kata yang tersembunyi sesudahnya, karena keduanya adalah ma’mul, dan setiap ma’mul pasti memiliki ‘amil. Kata yang tersembunyi tersebut kita jadikan terletak setelah nama Allah karena di dalamnya mengandung dua faedah:  Faedah Yang Pertama: Berharap memperoleh berkah dengan mengedepankan nama Allah ‘Azza Wa Jalla.  Faedah Yang Kedua: Pembatasan tujuan, karena meletakkan ‘amil setelah ma’mulnya mengandung pembatasan makna. Seakan-akan anda mengatakan: Saya tidak makan dengan menyebut nama seorang pun dengan mengharap keberkahan dan meminta bantuan kepadanya kecuali hanya dengan menyebut nama Allah ‘Azza wa Jalla. Dan kami jadikan kata tersembunyi tersebut berupa fi’il (kata kerja) karena asal dari ‘amal (dalam ilmu nahwu) adalah fi’il-fi’il (katakerja). Hal ini sudah diketahui oleh pakar nahwu. Oleh kerena itu isim-isim tidak akan menjadi ‘amil melainkan dengan syarat-syarat tertentu. Kami jadikan kata tersembunyi tersebut berupa katakerja yang cocok (dengan perbuatan yang hendak dilakukan) karena ini lebih dapat menunjukan kepada tujuan (diucapnya basmalah). Oleh kerena itu Nabi shallallaahu ‘alaihi wa sallam bersabda: وَمَنْ كَانَ لَمْ يَذْبَحْ فَلْيَذْبَحْ باسم الله(2) أو قال صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :عَلَى اسْمِ اللَّهِ(2) “Dan barang siapa yang belum menyembelih maka sembelihlah dengan menyebut nama Allah ‘Azza Wa Jalla” atau dengan lafaz “atas nama Allah” maka fi’ilnya disitu dikhususkan. Dan الله (Allah) adalah nama bagi Allah, Rabb semesta Alam. Nama yang tidak boleh diberikan kepada selain-Nya, nama ini adalah asal dari nama-nama Allah lainnya. Oleh kerena itu nama-nama Allah yang lainnya selalu mengiringi setelah nama ini. Dan الرَّحْمَنِ maknanya adalah Yang mempunyai kasih sayang (rahmat) yang luas, oleh karenanya nama ini datang dengan wazan فَعْلَان (fa’laan) yang menunjukkan keluasan. Dan الرَّحِيْمِ maknanya adalah yang menyampaikan rahmat kepada siapa pun yang Ia kehendaki dari hamba-hamba-Nya. Oleh kerenanya nama ini datang dengan wazan فَعِيْل (fa’iil) yang menunjukkan tersampaikannya kasih sayang tersebut. Di sini ada dua jenis , kasih sayang berupa sifat Allah yang ditunjukkan oleh nama ar-Rahman dan rahmat berupa perbuatan-Nya yaitu menyampaikan kasih sayang-Nya kepada yang Dia sayangi yang ditunjukkan oleh nama ar-Rahiim. Ar-Rahman dan ar-Rahiim: adalah dua di antara nama-nama Allah yang menunjukkan zat Allah, sifat rahmat dan dampak sifat ini yaitu perkara yang menjadi konsekuensi adanya sifat ini. Dan sifat rahmat (kasih sayang) yang telah Allah tetapkan untuk diri-Nya adalah rahmat sesungguhnya yang didasari oleh dalil wahyu dan bukti akal. Ada pun yang dimaksud dalil wahyu adalah yang bersumber dari al-Quran dan hadits Nabi shallallaahu ‘alaihi wa sallam, berupa penetapan sifat rahmat bagi Allah. Dalil ini sangatlah banyak. Ada pun bukti akal adalah segala yang kita peroleh berupa kenikmatan dari Allah, atau terhindarnya dari mara bahaya. Itu semua adalah di antara dampak dari rahmat Allah. Sebagian orang mengingkari pensifatan Allah Ta’ala dengan sifat rahmat yang sesungguhnya, mereka merubah maknanya dengan pemberian nikmat atau kehendaknya dalam memberinikmat kepada hamba-hamba-Nya; mereka menyangka bahwa tidak masuk akal jika Allah memiliki sifat rahmat. Mereka mengatakan: “Hal itu dikarenakan kasih sayang adalah rasa belas kasih, kelembutan, ketundukan dan kelunakan. Itu semua tidak layak bagi Allah ‘Azza Wa Jalla” Sanggahan untuk mereka bisa diuraikan dalam dua sisi:  Pertama: Kasih sayang tidak mengharuskan adanya ketundukan, menyerah dan kelunakan; karena kita tahu bahwa para raja yang kuat pun memiliki kasih sayang tanpa harus tunduk, lunak dan menyerah  Kedua: Andai hal itu adalah konsekuensi dari kasih sayang, maka sebenarnya itu adalah kasih sayang yang dimiliki oleh makhluk. Ada pun kasih sayang al-Khalik (Allah Sang Maha Pencipta), tentu kasih sayang yang sesuai dengan kebesaran, keagungan, kuasa-Nya dan tidak berkosekuensi hal-hal negatif apa pun. Kemudian kita katakan: “Sesungguhnya akal sehat mengakui adanya kasih sayang hakiki bagi Allah ‘Azza Wa Jalla. Seperti yang kita saksikan berupa kasih sayang yang terdapat pada ciptaan-ciptaan Allah, itu menunjukkan adanya kasih sayang Allah ‘Azza Wa Jalla. Karena sifat menyayangi adalah sifat sempurna, sedangkan Allah adalah yang paling pantas memiliki kesempurnaan. Kita juga menyaksikan kasih sayang yang khusus bagi Allah seperti menurunkan hujan, menghentikan paceklik dan sebagainya yang itu semua menunjukkan kasih sayang Allah.” Anehnya, orang-orang yang mengingkari sifat kasih sayang hakiki bagi Allah dengan beralasan bahwa itu tidak masuk akal, mereka justru menetapkan sifat iradah (berkehendak) dengan hujjah aqliyah (alasan secara akal) yang lebih sulit dipahami dari pada hujjah aqliyah adanya sifat kasih sayang bagi Allah. Mereka beralasan tentang sifat irodah: Kekhususan yang Allah berikan pada ciptaan-Nya yang dapat membedakan ciptaan-Nya yang satu dengan ciptan-Nya yang lain, itu semua menunjukan adanya iradah Allah secara akal. Tidak diragukan lagi bahwa hal ini benar, akan tetapi jika hal ini dibandingkan dengan adanya dampak-dampak sifat kasih sayang Allah maka itu semua jauh lebih samar (sulit dipahami). Karena orang yang mampu memahaminya hanya orang cerdas saja. Ada pun dampak-dampak kasih sayang Allah dapat diketahui banyak orang walau pun orang itu awam. Jika anda bertanya kepada seorang awam tentang hujan yang turun tadi malam (misalnya), ia akan menjawab: “ Hujan turun atas keutamaan dan kasih sayang (rahmat) dari Allah ” Masalah: Apakah basmalah termasuk salah satu ayat surat Al-Fatihah atau bukan? Terdapat perselisihan pendapat di kalangan ulama pada permasalahan ini,di antara mereka ada yang mengatakan: Basmalah adalah termasuk salah satu ayat surat Al-Fatihah, yang dibaca secara keras pada sholat-sholat yang dikeraskan bacaannya, dan mereka berpendapat tidak akan sah sholat kecuali dengan membacanya karena dia termasuk ayat dari surat al-Fatihah. Pendapat lain mengatakan bahwa basmalah tidak termasuk ayat surat al-Fatihah, tetapi dia adalah ayat tersendiri dalam al-Qur’an. Pendapat inilah yang benar. Pendapat ini berdasarkan dalil dan rangkaian surat al-Fatihah. Ada pun dalilnya: Hadits dari Abu Hurairah radhiyallaahu ‘anhu bahwa Nabi Shallallaahu ‘alaihi wa sallam bersabda: قَالَ اللهُ تَعَالَى: قَسَمْتُ الصَّلَاةَ بَيْنِي وَبَيْنَ عَبْدِي نِصْفَيْنِ “Allah ta’ala berfirman, “Aku membagi shalat (Nama lain Al-Fatihah), antara Aku dan hamba-Ku menjadi dua bagian” فَإِذَا قَالَ: {الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ} قَالَ اللهُ تَعَالَى: حَمِدَنِي عَبْدِي، “Maka apabila seorang hamba mengucapkan, “Segala puji bagi Allah Rabb semesta alam” Allah ta’ala berfirman, “Hamba-Ku telah memuji-Ku” وَإِذَا قَالَ: {الرَّحْمَنِ الرَّحِيمِ} قَالَ اللهُ تَعَالَى: أَثْنَى عَلَيَّ عَبْدِي، “Dan apabila hamba itu mengucapkan, “(Allah) Yang Maha Pengasih lagi Maha Penyayang”, Allah berfirman, “Hamba-Ku telah menyanjung-Ku” وَإِذَا قَالَ: {مَالِكِ يَوْمِ الدِّينِ} قَالَ: مَجَّدَنِي عَبْدِي “Dan apabila dia mengucapkan, “(Allah) Yang menguasai hari pembalasan” Allah ta’ala berfirman, “hamba-Ku memuliakan-Ku” فَإِذَا قَالَ: {إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ} قَالَ: هَذَا بَيْنِي وَبَيْنَ عَبْدِي، وَلِعَبْدِي مَا سَأَلَ، “Maka apabila ia mengucapkan, “Hanya kepada Engkaulah kami beribadah dan hanya kepada Engkaulah kami memohon pertolongan”, Allah berfirman, “Ini adalah (Hubungan) antara Aku dan hamba-Ku, dan Aku akan memberi permintaannya” فَإِذَا قَالَ: {اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ صِرَاطَ الَّذينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ} قَالَ: هَذَا لِعَبْدِي وَلِعَبْدِي مَا سَأَلَ “Maka apabila ia mengucapkan, “Tunjukilah kami jalan yang lurus, yaitu jalan orang-orang yang Engkau beri nikmat, bukan jalan orang-orang yang dimurkai, bukan (juga) jalan orang-orang yang tersesat”, Allah berfirman, “(petunjuk) Ini untuk hambaku, dan baginya segala yang ia minta”(3) Hadits di atas adalah dalil bahwa basmalah bukan termasuk ayat surat al-Fatihah. Dalam hadits shahih lainnya dari Anas Bin Malik radhiyallaahu ‘anhu ia menuturkan: “Aku telah shalat di belakang Nabi shallallaahu ‘alaihi wa sallam, Abu Bakar, Umar dan Utsman, mereka semua membuka bacaan shalat dengan Alhamdulillaahi rabbil ‘alamiin” mereka tidak menyebutkan basmalah di awal bacaan tidak juga di akhirnya”(4) Maksud ucapannya ini adalah mereka tidak mengeraskan basmalah, dan dibedakannya antara dilirihkannya basmalah dan dikeraskannya surat al-Fatihah menunjukan bahwa basmalah tidak termasuk al-Fatihah. Adapun jika ditinjau secara makna dari rangkaian surat ini: maka telah disepakati para ulama bahwa al-Fatihah berjumlah tujuh ayat, jika anda hendak membagi ketujuh ayat surat ini maka anda akan dapati pertengahannya adalah ayat {إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ} [hanya kepada Engkaulah kami beribadah dan hanya kepada Engkaulah kami memohon pertolongan]” ini adalah ayat yang Allah berfirman tentangnya: Artinya“Aku membagi shalat antara Aku dan hamba-Ku menjadi dua bagian”. {الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ} bagian pertama, {الرَّحْمَنِ الرَّحِيمِ} bagian kedua, {مَالِكِ يَوْمِ الدِّينِ} bagian ketiga; semua bagian itu adalah hak Allah ‘Azza Wa Jalla. {إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ} bagian keempat; inilah bagian tengah, bagian inilah yang dibagi menjadi dua; satu bagian adalah hak Allah dan satu bagian lagi adalah hak hamba. {اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ} bagian untuk hamba. {صِرَاطَ الَّذينَ أَنْعَمْتَ عَلَيْهِمْ} bagian untuk hamba, dan {غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ} bagian untuk hamba. Maka surat ini terbagi menjadi tiga bagian, bagian pertama adalah tiga ayat pertama untuk Allah ‘Azza Wa Jalla, bagian kedua adalah tiga Ayat terakhir untuk hamba dan bagian ketiga adalah ayat keempat yang tengah-tengah untuk Allah dan hamba. Kemudian jika ditinjau dari rangkaian pada lafaz surat ini, jika kita katakan: Basmalah adalah termasuk ayat surat al-Fatihah maka konsekuensinya adalah ayat yang ketujuh menjadi lebih panjang seukuran panjang dua ayat. Padahal sudah dimaklumi bahwa pada dasarnya ayat-ayat suatu surat dalam hal panjang dan pendeknya hampir seragam satu sama lain. Maka tidak diragukan lagi bahwa basmalah bukanlah termasuk ayat surat al-Fatihah sebagaimana juga basmalah bukanlah termasuk ayat dari surat-surat lainnya. (1) Dikeluarkan Bukhari (985) dan Muslim (1960) dari hadits Jundab Bin Abdullah radhiyallaahu ‘anhu (2) Dikeluarkan Bukhari (5500) dan Muslim (1960) dari hadits Jundab Bin Abdullah radhiyallaahu ‘anhu (3) dikeluarkan Muslim (395) (4) Dikeluarkan Muslim (399)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Fatihah ayat 1: Allah memulai dengan bismillah, Allah berfirman : Bismilahirrahmanirrahim yang maknanya Aku memulai membaca Al Qur’an dengan menyebut nama Allah, memohon pertolongan dari-Nya, karena sebab Allah sajalah yang berhak akan ke uluhiyyahannya dan di ibadahi, Dialah pemiliki kasih sayang yang luas dan agung yang luas akan segala sesuatu dari-Nya dan Allah secara kata adalah sebuah nama yang tidak di gunakan pada selain-Nya. Dan dikatakan, ia adalah nama bagi (Allah) yang teragung. Ar Rahman Ar Rahim adalah dua nama bagi Allah yang kedua nama tersebut mengandung sifat rahmah (penyayang) yang sesuai dengan dzat Allah dengan tanpa tahrif (memalingkan maknanya), ta’thil (meniadakan maknanya), takyif (bertanya bagaimananya) serta tamtsil (penyerupaan kepada makhluk). Dan bahwasanya sebuah nama pastilah mengandung sifat yang sesuai dengan nama tersebut, dan seperti inilah dikatakan kepada seluruh nama-nama Allah yang di sebutkan di dalam Al Qur’an dan As Sunnah. Ar Rahman adalah nama yang menunjukkan keumuman kasih sayang kepada seluruh makhluk-Nya (yang beriman maupun yang kafir), dan Ar Rahim adalah nama yang menunjukkan kasih sayang hanya kepada mereka yang beriman, sebagaimana firman Allah : Dan Allah terhadap orang-orang yang beriman berkasih sayang (Al Ahzab : 43). Yang kuat bahwa bismillah bukanlah termasuk aayat dari al fatihah, akan tetapi ia adalah ayat yang terpisah dari Al Qur’an, oleh karena itu tidak wajib men-jahr kan ketika shalat jahriyyah (yang menyuarakan bacaan)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya adalah \"Saya memulai membaca surat Al-Fatihah ini dengan menyebut nama Allah sambil memohon pertolongan kepada-Nya agar dapat membaca firman-Nya, memahami maknanya dan dapat mengambilnya sebagai petunjuk.\" Setiap pekerjaan yang baik, hendaknya dimulai dengan menyebut asma Allah, seperti makan, minum, menyembelih hewan, menaiki kendaraan, membaca Al Qur'an di awal surat, masuk dan keluar masjid, mengunci pintu, masuk dan keluar rumah, menulis surat, hendak berwudhu' dan sebagainya. Allah ialah nama Zat Yang Mahasuci, yang satu-satunya berhak disembah dengan sebenarnya disertai rasa cinta, takut dan berharap kepada-Nya, Zat yang tidak membutuhkan makhluk-Nya, tetapi makhluk yang membutuhkan-Nya. Ar Rahmaan (Maha Pemurah): salah satu nama Allah yang memberi pengertian bahwa Allah memiliki rahmat (kasih-sayang) yang luas mengena kepada semua makhluk-Nya, sedangkan Ar Rahiim artinya Allah Maha Penyayang kepada orang-orang mukmin. Kepada orang-orang mukmin itu diberikan-Nya rahmat yang mutlak, selain mereka hanya memperperoleh sebagian daripadanya. Ar Rahmaan dan Ar Rahiim merupakan nama Allah yang menetapkan adanya sifat rahmah (sayang) bagi Allah Ta'ala sesuai dengan kebesaran-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Fatihah Ayat 1",
    "description": "Aku memulai bacaan Al-Qur'an dengan menyebut nama Allah, nama teragung bagi satu-satunya tuhan yang patut disembah, yang memiliki seluruh sifat kesempurnaan dan tersucikan dari segala bentuk kekurangan, yang maha pengasih, pemilik dan sumber sifat kasih yang menganugerahkan segala macam karunia, baik besar maupun kecil, kepada seluruh makhluk, maha penyayang yang tiada henti memberi kasih dan kebaikan kepada orang-orang yang beriman. Memulai setiap pekerjaan dengan menyebut nama Allah (basmalah) akan mendatangkan keberkahan, dan dengan mengingat Allah dalam setiap pekerjaan, seseorang akan memiliki kekuatan spiritual untuk melakukan yang terbaik dan menghindar dari keburukan. Segala puji kita persembahkan hanya untuk Allah semata, tuhan pencipta dan pemelihara seluruh alam, yaitu semua jenis makhluk."
  }
]