[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Pujian kepada Allah dengan sifat-sifatnya yang semuanya merupakan sifat-sifat kesempurnaan dan karena nikmat-nikmat nya yang nampak maupun yang tersembunyi, yang bersifat agamawi maupun duniawi, yang didalamnya terkandung perintah bagi para hambanya untuk memuji-Nya karena Dialah satu-satunya yang berhak mendapat pujian. Sebab Dialah yang mengadakan semua makhluk, yang menangani urusan-urusan mereka, yang mengatur seluruh makhlukNya dengan nikmat-nikmat nya dan membimbing para wali-Nya dengan iman dan amal sholeh."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Segala bentuk pujian berupa keagungan dan kesempurnaan hanya bagi Allah semata, karena Dia Tuhan segala sesuatu, Pencipta dan Pengaturnya. \"Al-'Ālamūn\" adalah bentuk plural dari \"Ālam\" yaitu segala sesuatu selain Allah -Ta'ālā-."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "2. Segala pujian dan sanjungan hanya bagi Allah, Tuhan yang berhak disembah. Karena Dia adalah pencipta seluruh makhluk. Seluruh makhluk dengan seluruh macamnya mengucap pujian bagi-Nya di setiap waktu dan tempat, di dunia dan di akhirat, di langit dan bumi serta di antara keduanya. Maka sebab itu, hendaklah seorang mukmin menghayati bahwa seluruh jagat raya ini di setiap waktu dan tempat, semuanya mengucap pujian bagi Allah, agar ia dapat selaras dengan jagat raya yang senantiasa berzikir, serta agar ia dapat sama-sama melantunkan zikir yang agung yang dicintai Allah ini. Yang mana Allah memulai Al-qur'an dengan pujian ini serta memulai surat yang paling agung dalam al-qur'an dengan pujian pula, sehingga menjadi permulaan yang indah dan penuh kekhusyu'an. Allah-lah yang berhak mendapat segala pujian tersebut, karena Dia yang menjadikan seluruh alam semesta ini untuk manusia; dan seluruh makhluk yang ada di dunia mendapat kenikmatan dan rezeki dari keberkahan rahmat-Nya siang dan malam."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "الْحَمْدُ لِلَّهِ (الحمد) merupakan pujian dengan lisan kepada sesuatu yang indah, yang dilakukan kerena kesempurnaan yang ada pada sesuatu yang dipuji meskipun bukan merupakan balasan dari sebuah kenikmatan. Sedangkan (الشكر) merupakan pujian dengan lisan, hati, serta perbuatan yang tidak dilakukan kecuali sebagai bentuk balasan dari sebuah kenikmatan. Sehingga Allah Ta’ala adalah Dzat yang berhak atas (الحمد) dan (الشكر). رَبِّ الْعَالَمِينَ Ar-Rabb merupakan salah satu nama Allah yang tidak disematkan kepada selain-Nya kecuali bila disandangkan dengan kata yang lain, misal: (الرجل رب المنزل) orang ini adalah pemilik rumah. Dan ar-Rabb berarti Pemilik, Tuhan, Pengatur, dan yang Disembah. Sedangkan kata (العالمين) adalah bentuk jamak dari kata (العالم) yang berarti segala sesuatu kecuali Allah Ta’ala; dan menurut pendapat lain berarti makhluk yang berakal yakni manusia, jin, malaikat, dan setan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). \"Al-hamdu\" adalah pujian yang disertai dengan cinta dan pengagungan yang sempurna, dan ini sangat sesuai dengan pensifatan yang datang setelah \"al-Hamdu\" ( pujian ) : ( رب العالمين = الربوبية ) , maka jika Allah tuhan yang mendidik hamba-hamba Nya wajib untuk dicintai, dan jika Dia Allah yang mampu mendidik dan membibing hamba-Nya kepada jalan yang lurus maka wajib bagi setiap hamba untuk mengagungkan-Nya. 2 ). Jika saja tidak ada tugas yang diperintahkan oleh al-Qur'an untuk kita kecuali hanya bersyukur dan memuji pemiliknya dengan pujian yang sempurna; maka cukuplah itu sebagai nikmat yang besar bagi seluruh alam. 3 ). Allah ta'ala mensifati diri-Nya setelah firman-Nya { رَبِّ الْعَالَمِينَ } bahwa Dia adalah { الرَّحْمَٰنِ الرَّحِيمِ }; karena sesungguhnya ketika Allah mensifati diri-Nya dengan { رَبِّ الْعَالَمِينَ } yang merupakan tarhib bagi hamba-Nya; Dia menghubungkan sifat itu dengan { الرَّحْمَٰنِ الرَّحِيمِ } yang di dalamnya mencakup targhib bagi hamba-Nya, maka dalam sifat Allah akan terkumpul didalamnya antara targhib dan tarhib kepada Allah, yang dengannya ketaatan seorang hamba akan lebih sempurna."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Pujian lisan dan hati (tercurah) atas kesempurnaan nikmat Allah. (Dialah) Sebenar-benar Dzat yang disembah, Pengayom alam semesta yang terdiri dari manusia, jin, malaikat, dan setan, sekaligus Raja dan Pengatur urusan-urusan mereka. Dialah Dzat yang paling berhak menerima segala pujian hati maupun lisan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Segala puji} pujian penuh dengan segala jenis pujian berupa sifat-sifat keagungan dan kesempurnaan, {bagi Allah} yang Maha Pencipta, Maha Merajai, Maha Pemberi Rejeki, dan Maha Mengatur segala urusan {Tuhan semesta alam} bentuk plural dari kata “’alam”, yaitu segala sesuatu yang ada selain Allah SWT"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Lafaz Alhamdu lillah (segala puji bagi Allah), ini merupakan Sanjungan bagi Allah dengan sifat-sifatnya yang sempurna, dan perbuatan-perbuatannya yang mencakup antara Fadilah dan keadilan. bagi Allah segala puji yang sempurna dengan segala jenisnya. Lafaz robbil ‘alamin (yang mengurus sekalian alam), Robb artinya yang mengurus seluruh alam (selain Allah) yang telah Allah ciptakan. Allah telah persiapkan untuk mereka sarana-sarana dan Allah memberi nikmat kepada mereka dengan nikmat yang agung yang seandainya Jika mereka kehilangan nikmat itu maka tidak mungkin mereka bisa terus ada bertahan hidup. tidak ada nikmat yang mereka dapatkan kecuali dari Allah ta'ala. Pemeliharaan Allah kepada makhluk ada dua jenis, yaitu: Pertama :pemeliharaan umum yaitu dengan Allah menciptakan makhluk dan memberi mereka rezeki serta Hidayah untuk kemaslahatan mereka yang dengan itu mereka bisa tinggal di dunia. Kedua : pemeliharaan khusus, yaitu pemeliharaan Allah bagi para kekasihnya. maka Allah memberi pemeliharaan kepada mereka dengan iman dan Taufik dan menyempurnakannya bagi mereka dan mencegah mereka dari kejahatan dan segala penghalang antara mereka dengan Allah. Hakikat nya adalah pemeliharaan bimbingan taufik untuk melakukan kebaikan yang menjaga dari segala keburukan. bisa jadi ini merupakan rahasia dari makna lafaz robb sebagaimana terjadi bacaan doa-doa para nabi dengan memakai kalimat \"robb\". permintaan Para nabi masuk di bawah pemeliharaan yang khusus. Maka firman Allah robbil ‘alamiin (Robb sekalian alam) menunjukkan kepada keesaan Allah dalam penciptaan pengaturan pemberi nikmat dan kesempurnaan kekayaannya dan juga kesempurnaan kebutuhan seluruh makhluk kepada Allah dalam segala bentuk dan sudut pandang."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Al-Hamdu adalah Penyifatan kepada Allah berupa keindahan dan pujian untuk Dzat yang Maha Terpuji karena keutamaan dan anugerahNya, seperti bentuk sanjungan dan untaian rasa syukur. Lillahi : Huruf Lam adalah salah satu huruf jar yang memiliki arti kepemilikan, yaitu bahwa Allah satu-satunya yang berhak memiliki segala bentuk pujian. Allah adalah nama bagi Dzat Tuhan yang Maha Tinggi lagi Maha suci. Ar-Rabb artinya adalah Tuhan yang menguasai, merajai, memperbaiki, dan Tuhan yang berhak untuk disembah. Maha Suci Allah. Al-‘Aalamiin merupakan bentuk jamak (plural) dari ‘aalam. Yaitu semua hal selain Allah Ta’ala. Seperti malaikat, jin, manusia, hewan, dan tetumbuhan. Makna ayat : Allah Ta’ala memberitahukan bahwa seluruh sifat yang terpuji lagi suci dan sempurna hanyalah milik Allah satu-satunya tanpa ada yang lain. Karena Allah lah Rabb segala sesuatu, yang Maha mencipta dan menguasainya. Maka wajib bagi kita untuk memuji dan menyanjungnya dengan segala keperkasaanNya."
  },
  {
    "title": "Al-Mishbahul Munir fi Tahdzib Tafsir Ibnu Katsir / Syaikh Shafiyurrahman al-Mubarakfuri et. al.",
    "description": "MAKNA AL-HAMDU Abu Ja’far bin Jarir berkata: “Makna alhamdulillah adalah bersyukur kepada Allah semata dan bukan kepada sesembahan selain-Nya, buka juga kepada makhluk yang telah Dia ciptakan, atas segala nikmat yang telah Dia anugerahkan kepada para hamba-Nya yang tidak terhingga jumlahnya. Kenikmatan dan anugerah berupa kemudahan berbagai sarana untuk manta’ati-Nya, dan anugerah berupa fisik untuk dapat melaksanakan kewajiban-kewajiban dari-Nya. Selain itu Dia telah memberikan rizki kepada mereka di dunia serta melimpahkan berbagai macam kenikmatan dalam hidup mreka, yang sebenarnya mereka sama sekali tidak memiliki jak atas hal itu. pelimpahan nikmat ini disertai dengan peringatan dan seruan kepada mereka agar menggunakan nikmat-nikmat itu sebagai sebab-sebab yang dapat membawa mereka kepada kekekalan hidup di Surga, tempat segala macam kenikmatan yang abadi. Hanya bagi Allah segala puji, di awal maupun di akhir. Ibnu Jarir  mengatakan: “ Alhamdulillah merupakan pujian Allah bagi diri-Nya. Di dalamnya terkandung perintah kepada hamba-hamba-Nya agar mereka memuji-Nya, seolah-olah Dia mengatakan: ‘Ucapkanlah al-hamdulillah.’” Ada yang mengatakan bahwa ucapan alhamdulillah adalah pujian bagi Allah dengan Nama-Nama-Nya yang baik dan sifat-sifat-Nya yang tinggi. Adapun ucapan ¬as-syukru lillaah adalah pujian bagi-Nya atas segala nikmat dan pertolongan-Nya. PERBEDAAN ANTARA AL-HAMDU DAN ASY-SYUKRU Dari hasil kajian menunjukkan bahwa antara keduanya terdapat keumuman dan kekhususan. Al-hamdu lebih umum dari asy-syukru jika dilihat dari objek keduanya, karena al-hamdu ¬bisa dikaitkan dengan sifat-sifat al-laazimah (transitif), dan juga al-muta’addiyah (intransitif) seperti perkataanmu: حَمِدْتُهُ لِفُرُوْسِيَّتِهِ (aku memujinya karena sifatnya yang ksatria) dan bisa juga engkau mengatakan: حَمِدْتُهُ لِكَرَمِه (aku memujinya karena kedermawanannya). Di satu sisi al-hamdu lebih khusus karena ia hanya bisa diungkapkan dalam bentuk ucapan semata. Adapun asy-syukru lebih umum dari al-hamdu karena ia bisa diungkapkan melalui ucapan, perbuatan, ataupun niat. Ia lebih khusus dari al-hamdu karena hanya berkaitan dengan sifat-sifat muta’addiyah. Anda bisa mengucapkan: شَكَرْتُهُ لِفُرُوسِيَّتِه (aku berterima kasih kepadanya karena sifatnya yang ksatria). Namun anda juga bisa mengatakan: شَكَرْتُهُ عَلى كَرَمٍه وَإِحْسَانِه (aku bersyukur kepadanya karena kedermawanan dan kebaikannya kepadaku). Demikianlah yang disimpulkan oleh sebagian ulama muta’akhirin. Wallahu a’lam. Abu Nashr Isma’il bin Hammad al-Jauhari mengatakan: “Al-hamdu adalah lawan dari adz-dzammu (celaan). Engkau mengatakan: ‘Aku memuji seorang laki-laki dengan sebuah pujian’ (hamdan atau mahmadah). Orang yang memuji disebut hamiid dan yang dipuji disebut mahmuud. Kata at-tahmiid lebih dalam maknanya dibanding al-hamdu. Al-hamdu lebih umum dari asy-syukru. Beliau mengatakan bahwa asy-syukru adalah pujian atas orang yang berbuat kebaikan karena kebaikan yang ia lakukan. Dikatakan: Syakartuhu atau syakartu lahu (aku bersyukur kepadanya). Yang menggunakan huruf lam itu lebih fasihh. Adapun perkataan al-madhu lebih umum dari kata al-hamdu, karena al-hamdu bisa ditujukan kepada orang yang masih hidup ataupun sudah mati dan juga kepada benda mati. Sebagaimana al-madhu ditunjukan kepada makanan, tempat dan lain sebagainya. Ia bisa diberikan sebelum mendapat kebaikan ataupun setelahnya atas sifat muta’addi maupun lazim. BEBERAPA PENDAPAT SALAF TENTANG AL-HAMDU Diriwayatkan oleh selain Abu Ma’mar, dari Hafsh ia berkata: “Umar berkata kepada Ali dan para Sahabat berada di sisinya: “Kami telah mengetahui tentang laa ilaaha illallah, subhaanallah dan Allahu Akbar. Lalu apa al-hamdulillah itu?” Maka Ali  menjawab:” Ia adalah kalimat yang disukai Allah ta’ala bagi diri-Nya dan Dia meridhainya bagi diri-Nya serta menyukai kalimat itu diucapkan.” Ibnu Abbas  berkata: “Alhamdulillah adalah kalimat syukur. Apabila seorang hamba mengucapkan alhamdulillah, maka Allah berfirman: “Hamba-Ku telah memuji-Ku.” Diriwayatkan oleh Ibnu Abi Hatim. BEBERAPA KEUTAMAAN AL-HAMDU Imam Ahmad bin Hambal meriwayatkan dari al-Aswad bin Sari’, ia berkata: “Aku berkata kepada Nabi : ‘Wahai Rasulullah, maukah engkau aku puji dengan segala pujiann seperti yang aku berikan kepada Rabb-ku tabaaraka wa ta’aala?” Maka beliau menjawab: “Tidak!. Adapun Rabb-mu sesungguhnya Dia menyukai al-hamdu.” Diriwayatkan juga oleh imam an-Nasa’i. Diriwayatkan oelh Abu ‘Isa al-Hafizh at-Tirmidzi, an-Nasa’i dan Ibnu Majah dari hadits Musa bin Ibrahim bin Katsir, dari Thalhah bin Kharrasy dari Jabir bin Abdillah , ia berkata: “Rasulullah  bersabda: أَفضلُ الذِّكر لا إله إلا الله وأَفْضلُ الدُّعاءِ الحمدُ لله “Sebaik-baik dzikir adalah kalimat laa ilaaha illallaah, dan sebaik-baik do’a adalah al-hamdulillah.” At-Tirmidzi mengatakan hadits ini hasan ghorib. Ibnu Majah meriwayatkan dari Anas bin Malik , ia berkata: “Rasulullah  bersabda: مَا أَنْعَمَ اللهُ على عبدٍ نعمةً فقال: الحمدُ للهِ إلا كَانَ الذي أَعْطَاهُ أَفْضَلَ ممَّا أَخَذَ. “Tidaklah Allah menganugerahkan suatu nikmat kepada seorang hamba, lalu ia mengucapkan ¬al-hamdulillah, melainkan apa yang diberikan-Nya itu lebih baik dari apa yang diambil-Nya.” Di dalam kitab Sunan Ibnu Majah diriwayatkan dari Ibnu Umar  bahwa Rasulullah  bersabda kepada mereka: أَنَّ عَبْدًا مِنْ عِبَادِ اللَّهِ قَالَ: يَا رَبِّ، لَكَ الْحَمْدُ كَمَا يَنْبَغِي لِجَلَالِ وَجْهِكَ وَلِعَظِيمِ سُلْطَانِكَ. فَعَضَّلَتْ بِالْمَلَكَيْنِ، فَلَمْ يَدْرِيَا كَيْفَ يَكْتُبَانِهَا، فَصَعِدَا إِلَى السَّمَاءِ، فقَالَا: يَا رَبَّنَا، إِنَّ عَبْدَكَ قَدْ قَالَ مَقَالَةً لَا نَدْرِي كَيْفَ نَكْتُبُهَا، قَالَ اللَّهُ عَزَّ وَجَلَّ وَهُوَ أَعْلَمُ بِمَا قَالَ عَبْدُهُ: مَاذَا قَالَ عَبْدِي؟ قَالَا: يَا رَبِّ، إِنَّهُ قد قَالَ: يَا رَبِّ، لَكَ الْحَمْدُ كَمَا يَنْبَغِي لِجَلَالِ وَجْهِكَ وَعَظِيمِ سُلْطَانِكَ! فَقَالَ اللَّهُ عَزَّ وَجَلَّ لَهُمَا: اكْتُبَاهَا كَمَا قَالَ عَبْدِي، حَتَّى يَلْقَانِي فَأَجْزِيَهُ بِهَا “Sesungguhnya seorang hamba dari hamba-hamba Allah mengucapkan: ‘ Ya Allah Rabb-ku, segala puji bagi-Mu sebagaimana yang layak bagi kemuliaan wajah-Mu dan keagungan kerajaan-Mu. ‘Maka hal itu membingungkan dua Malaikat, mereka tidak tahu bagaimana mencatatnya, maka keduanya naik ke langit menemui Allah, seraya berkata: “Wahai Rabb kami, sesungguhnya seorang hamba telah mengucapkan sebuah ucapan yang kami tidak tahu bagaimana mencatatnya. ‘Maka Allah bertanya -dan Dia Maha Mengetahui apa yang diucapkan oleh hamba-Nya: ‘Apa yang diucapkan hamba-Ku?’ Kedua Malaikat itu menjawab: ‘Wahai Rabb, dia mengatakan, ‘Bagi-Mu segala puji sebagaimana kemuliaan wajah-Mu dan keagungan kerajaan-Mu. “Maka Allah berfirman: ‘Tulislah sebagaimana yang diucapkan hamb-Ku, hingga ia bertemu dengan-Ku lalu Aku memberinya balasan karenanya.” ALIF LAM PADA KATA AL-HAMDU UNTUK ISTIGHRAQ Alif lam pada kata al-hamdu berfungsi untuk istighraq yaitu mencakup segala jenis dan bentuk pujian hanya bagi Allah semata. Sebagaimana disebutkan dalam hadits: اللهمًّ لكَ الحمدُ كُلُّه ولكَ المُلكُ كلُّه بِيَدِك الخَيرُ كلُّه إليكَ يُرْجَعُ الأَمْرُ كُلُّه “Ya Allah, bagi-Mu segala pujian seluruhnya, dan bagi-Mu seluruh kerajaan. Di tangan-Mu seluruh kebaikan dan kepada-Mu kembali segala urusan.” ARTI AR-RABB Ar-Rabb adalah yang memiliki dan mengatur. Menurut bahasa, kata Rabb ditunjukkan kepada tuan dan kepada siapa yang mengatur untuk memperbaiki. Semua itu benar bagi Allah Ta’ala. Kata ar-Rabb tidak digunakan untuk selain Allah, kecuali jika disambung dengan kata lain setelahnya, misalnya rabbud daar (pemilik rumah). Sedangkan nama ar-Rabb (secara mutlak) hanya boleh digunakan oleh Allah Azza wa jalla. Ada yang mengatakan bahwa itu adalah al-Ismul A’zham (Nama Allah yang paling agung). ARTI AL-‘AALAMIIN Al-‘aalamiin adalah bentuk jamak (banyak) dari ‘aalam yang berarti segala sesuatu yang ada selain Allah . ‘Aalam adalah bentuk jamak yang tidak memiliki betuk mufrod (tunggal). Al-‘aalamin berarti berbagai macam makhluk yang ada di langit, bumi , daratan maupun lautan. Setiap kurun atau generasi juga disebut ‘aalam. Al-Farra’ dan Abu ‘Ubaid mengatakan: “Al-‘aalam adalah sebuah ungkapan bagi sesuatu yang berakal, yakni manusia, jin,malaikat dan syaitan. Sedangkan hewan tidak disebut alam. Diriwayatkan dari Zaid bin Aslam dan Abu Muhaishin: “Al-‘aalam adalah segala sesuatu yang memiliki ruh dan hidup bergerak.” Qatadah berkata: “(Rabbil ‘aalamiin) maka ‘aalamin adalah seluruh bagian alam.” Al-Zajjaaj berkata: “Al-‘aalam adalah segala sesuatu yang diciptakan oleh Allah di dunia maupun di akhirat.” Al-Qurthubi berkata: “Inilah yang benar, karena ia mencakup seluruh alam (dunia dan akhira), sebagaimana firman Allah : قَالَ فِرْعَوْنُ وَمَا رَبُّ الْعَالَمِينَ # قَالَ رَبُّ السَّمَاوَاتِ وَالْأَرْضِ وَمَا بَيْنَهُمَا ۖ إِن كُنتُم مُّوقِنِينَ “Fir'aun bertanya: \"Siapa Tuhan semesta alam itu?” Musa menjawab: \"Tuhan Pencipta langit dan bumi dan apa-apa yang di antara keduanya (Itulah Tuhanmu), jika kamu sekalian (orang-orang) mempercayai-Nya\". (QS. Asy-Syu’araa:23-24) ALASAN PENAMAAN ‘AL-‘AALAM Kata al-‘aalam terbentuk (musytaq) dari kata al-‘allaamah. Saya (Ibn Katsir) katakan: “Sebab, alam merupakan bukti yang menunjukkan adanya Sang Pencipta serta menunjukkan keesaan-Nya.”"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Firman Allah Ta’ala: الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ “Segala puji bagi Allah Rabb semesta Alam” (QS. Al-Fatihah:1) الْحَمْدُ Al-Hamdu: Adalah menyebutkan kesempurnaan kepada yang dipuji disertai rasa cinta dan pengagungan; berupa kesempurnaan secara zatnya, sifatnya dan perbuatannya. Dialah Allah Yang Mahasempurna dalam zat, sifat-sifat dan perbuatan-perbuatan-Nya. Dan pujian kepada-Nya ini harus disertai pengikat, yaitu rasa cinta dan pengagungan. Ulama mengatakan: “ Karena hanya sekedar menyebutnya dengan kesempurnaan tanpa ada rasa cinta dan pengagungan tidaklah disebut al-Hamdu, tapi itu disebut al-Mad-hu”. Oleh karenanya, ada orang yang tidak cinta dengan orang yang ia puji. Dia memuji hanya karena ingin memperoleh sesuatu dari orang itu. Anda dapatkan sebagian pujangga berdiri di hadapan para penguasa, kemudian memuji mereka dengan sebutan-sebutan yang agung bukan atas dasar rasa cinta pada mereka, namun itu dilakukan karena ingin memperoleh harta yang diberikan oleh penguasa pada mereka, atau karena takut. Akan tetapi kita memuji Rabb kita ‘Azza Wa Jalla atas dasar kecintaan dan pengagungan kepada-Nya. Oleh karena itu, al-Hamdu harus disertai pengikat yaitu menyebutkan kesempurnaan yang dipuji disertai rasa cinta dan pengagungan. Dan ( ال ) alif lam pada al-Hamdu adalah alif lam Istighraq yang bermakna pujian yang mencakup semua jenis pujian baik. Firman Allah Ta’ala: لِلَّهِ [lillaah] Lam pada kata tersebut berfungsi sebagai ikhtishash (pengkhususan) dan istihqaaq (yakni hanya Allahlah yang berhak mendapat seluruh pujian-pujian itu) dan اَلله (Allah) adalah nama bagi Rabb kita ‘Azza Wa Jalla, yang tidak boleh dinamai dengan nama itu selain Dia. Makna nama Allah adalah yang disembah yakni yang diibadahi disertai rasa cinta dan pengagungan. Firman Allah: رَبِّ الْعَالَمِينَ [Rabbil ‘aalamiin] “Rabb semesta alam” Ar-Rabb adalah yang terkupul padanya tiga sifat; menciptakan, memiliki dan mengatur; Diala Allah, Maha Pencipta, Maha Memiliki segala sesuatu dan Maha Pengatur segala sesuatu. Firman Allah: الْعَالَمِينَ [Al-‘Aalamiin] Para ulama mengatakan: segala sesuatu selain Allah adalah termasuk alam, semua makhluk disebut alam dikerenakan mereka menjadi tanda keberadaan Pencipta mereka Subhanahu Wa ta’ala. Dan disetiap makhluk pasti ada tanda yang menunjukkan keberadaan Sang Pencipta, baik itu tanda kekuasaan-Nya, kebijaksanaan-Nya, Rahmat-Nya, kebesaran-Nya, dan tanda lainnya berupa makna-makna rububiyah-Nya. Di antara faedah ayat ini adalah: 1. Adanya penetapan pujian yang sempurna bagi Allah ‘Azza Wa Jalla. Ini ditunjukkan oleh ali lam pada firman-Nya al-Hamdu karena alif lam di situ menunjukkan istighraq (yang mengumpulkan segala pujian). 2. Allah Ta’ala adalah yang berhak mendapat kekhususan berupa pujian sempurna dari segala sisi,oleh karena itu, jika Nabi shallallaahu ‘alaihi wa sallam memperoleh kemudahan beliau mengucapkan : الحَمْدُ لِلهِ الَّذِي بِنِعْمَتِهِ تَتِمُّ الصَّالِحَاتُ “Alhamdulillaahillaadzi bini’matihi Tatimmushshaalihaat “ segalapuji bagi Allah yang dengan nikmat-Nya sehingga kebaikan-kebaikan menjadi sempurna” dan jika memperoleh kebalikannya beliau meungcapkan: اَلْحَمْدُ لِلهِ عَلَى كُلِّ حَالٍ Alhamdu lillaahi ‘alaa kulli haalin “ Segala puji bagi Allah atas apapun yang terjadi” (1) 3. Dikedepankannya sifat uluhiyah Allah dari pada rububiyah-Nya, hal ini bisa dikarenakan tiga sebab: bisa jadi ini dikarenakan nama Allah adalah sebutan khusus bagi-Nya dan nama-nama-Nya yang lain mengikuti setelahnya, bisa jadi dikarenakan para rasul diingkari dari sisi uluhiyahnya saja. 4. Luasnya rububiyah Allah Ta’ala meliputi seluruh alam sebagaimana firman-Nya al-‘Aalamiin. (1) Dikeluarkan Ibnu Majah (3803) dari hadits ‘Aisyah radhiyallaahu ‘anhaa, dan dinyatakan shahih oleh al-Albaniy dalam Shahiihul-Jaami’ (4727)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Fatihah ayat 2: Allah mengabarkan bahwasanya Allah memiliki pujian yang sempurna, Dialah yang terpuji atas segala kondisi, Al Hamd adalah pujian bagi Allah dengan lisan serta diyakini. Kita memuji-Nya karena Allah adalah Tuhan semesta alam, yaitu Rabb segala sesuatu serta rajanya dari segala sesuatu. Rabb adalah sebuah nama di antara nama-nama Allah, oleh karena itu dibenarkan berkata Abdur Rabb (hamba Rabb)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Alhamdu artinya segala puji. Memuji dilakukan karena perbuatannya yang baik. Maka memuji Allah berati menyanjung-Nya karena perbuatan-Nya yang baik seperti melimpahkan karunia dan berbuat adil, karena sifat-sifat-Nya yang sempurna dan karena nikmat-nikmat-Nya yang begitu banyak yang dilimpahkan-Nya kepada kita baik nikmat yang berkaitan dengan agama maupun dunia. Syaikh Ibnu 'Utsaimin berkata, \"Al Hamdu adalah menyifati yang dipuji dengan kesempurnaan disertai rasa cinta dan pengagungan; baik kesempurnaan dzaat, sifat maupun perbuatan-Nya.\" Dengan demikian dalam memuji Allah Ta'ala harus disertai rasa cinta dan pengagungan serta ketundukan, karena jika tidak seperti ini bukan merupakan pujian yang sempurna. Kita menghadapkan segala puji bagi Allah ialah karena dari Allah sumber segala kebaikan yang kita peroleh. Di dalam ayat ini mengandung perintah kepada semua hamba agar memuji Allah Ta'ala. Ayat ini juga menunjukkan bahwa Allah Ta'ala berhak mendapatkan pujian sempurna dari segala sisi, oleh karena itu Nabi shallallahu 'alaihi wa sallam ketika mendapatkan hal yang menyenangkan mengucapkan \"Al Hamdulillahilladziy bini'matihi tatimmush shaalihaat\" (segala puji bagi Allah yang dengan nikmat-Nya amal shalih menjadi sempurna), dan ketika Beliau memperoleh selain itu, Beliau tetap mengucapkan \"Al Hamdulillah 'alaa kulli haal\" (segala puji bagi Allah dalam semua keadaan) sebagaimana diriwayatkan oleh Ibnu Majah (3803). Rabb (tuhan) berarti Tuhan yang ditaati yang Memiliki, Mendidik, Mengurus dan Memelihara. Lafal Rabb tidak dapat dipakai selain untuk Allah, kecuali kalau ada sambungannya, seperti rabbul bait (tuan rumah). 'Alamiin (semesta alam) adalah semua yang diciptakan Allah yang terdiri dari berbagai jenis dan macam, seperti: alam manusia, alam hewan, alam tumbuh-tumbuhan, benda-benda mati dan sebagainya. Allah Pencipta semua alam-alam itu, Dia-lah yang menciptakan semua makhluk, yang mengurus urusan mereka, mengurus semua makhluk-Nya dengan nikmat-nikmat-Nya dan mengurus para wali-Nya dengan iman dan amal yang shalih. Dengan demikian, pemeliharaan Allah Ta'ala kepada alam semesta itu ada yang umum dan ada yang khusus. Yang umum adalah diciptakan-Nya mereka, diberi-Nya rezeki, diberi-Nya mereka petunjuk kepada hal-hal yang bermaslahat bagi mereka agar mereka dapat hidup di muka bumi, sedangkan yang khusus adalah dengan dididik-Nya para wali-Nya dengan iman dan amal shalih atau diberi-Nya taufiq kepada setiap kebaikan dan dihindarkan dari semua keburukan. Mungkin inilah rahasia mengapa do'a yang diucapkan para nabi kebanyakan menggunakan lafaz Rabb (seperti Rabbi atau Rabbanaa). Ayat ini menunjukkan bahwa hanya Allah-lah Rabbul 'aalamin; yang menciptakan, mengatur, memberi rezeki, menguasai dan memiliki alam semesta; tidak ada Rabb selain-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Fatihah Ayat 2",
    "description": "Segala puji kita persembahkan hanya untuk Allah semata, tuhan pencipta dan pemelihara seluruh alam, yaitu semua jenis makhluk. Dialah yang maha pengasih, pemilik dan sumber sifat kasih, yang menganugerahkan segala macam karunia, baik besar maupun kecil, kepada seluruh makhluk, maha penyayang yang selalu tiada henti memberi kasih dan kebaikan kepada orang-orang yang beriman."
  }
]