[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "الرَّحْمَنِ (yang maha pengasih) maksudnya yang memiliki Rahmat umum yang mencakup seluruh alam, الرَّحِيمِ (yang maha penyayang) yakni terhadap orang-orang Mukmin. dan keduanya merupakan dua nama diantara nama-nama Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Ini merupakan sanjungan untuk Allah -Ta'ālā- setelah memuji-Nya di ayat sebelumnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "3. Salah satu sifat Allah adalah ar-rahmah (kasih sayang); ar-Rahman (Maha Pengasih) bagi seluruh makhluk dan ar-Rahim (Maha Penyayang) bagi orang-orang yang beriman. ar-Rahmah adalah salah satu sifat agung Allah, sebab seluruh sifat-Nya terhubung dengan sifat rahmat-Nya, karena seluruh sifat merupakan bentuk-bentuk dari sifat rahmat-Nya, dan rahmat-Nya meliputi segalanya. Allah memiliki seratus rahmat, Dia telah menurunkan satu rahmat-Nya di dunia yang menjadikan seluruh makhluk-Nya dapat saling mengasihi. Dan mengakhirkan 99 rahmat-Nya untuk hari kiamat agar dapat meringankan hamba-hamba-Nya sesuai dengan kehendak-Nya. Pengakhiran turunnya rahmat ini merupakan bentuk rahmat-Nya yang Maha Luas."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "الرَّحْمَٰنِ الرَّحِيمِ Tafsir dari kalimat ini telah dijelaskan sebelumnya. Setelah disebutkan bahwa Allah Ta’ala disifati sebagai (رب العالمين) Pemilik semesta alam yang memberi rasa ketakutan dalam hati makhluk-Nya, maka Allah menyandingkan kata (الرحمن الرحيم) yang Maha Pengasih lagi Maha penyayang karena mengandung makna kecintaan. Sehingga terkumpul dalam sifat-sifat-Nya antara sifat untuk takut dari Allah dan cinta kepada-Nya agar lebih memudahkan untuk menjalankan ketaatan kepada-Nya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Ulama mengatakan : Dua nama ini membukakan -bagi siapa yang mengetahuinya- seluas-luasnya pintu mahabbah kepada Allah, dan melimpahkan segala harapan hanya kepada-Nya, adapun penyebutan dua nama ini dengan bentuk yang berbeda -dan pada dasarnya keduanya berasal dari mashdar yang sama yaitu Rahmah- adalah menunjukkan keluasannya, dan dalam sebuah hadits qudsi Allah mengatakan : (( أَناَ عِندَ ظَنِّ عَبْدِي بِي )) \"Aku sesuai anggapan hamba-Ku\" ( HR. Al-Bukhari, no. 7405 dan Muslim, no. 2675 )."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Dzat yang memiliki keluasan dan keabadian rahmat di dunia dan akhirat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Yang Maha Pengasih lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Lafaz arrohman arrohiim merupakan dua nama yang menunjukkan bahwa Allah memiliki Rahmat yang luas dan besar yang mencakup segala sesuatu, rahmat-Nya mencakup bagi seluruh yang hidup. dan Allah menetapkan rahmat-Nya bagi orang-orang yang bertakwa yang mengikuti para Nabi dan Rasul -Nya. maka bagi mereka akan mendapatkan rahmat yang mutlak. Adapun selain mereka akan mendapatkan bagian yang sedikit dari Rahmat itu. dan ketahuilah diantara kaidah yang disepakati oleh para Salaf umat dan para imamnya bahwasanya iman terhadap nama-nama dan sifat-sifat Allah dan hukum-hukum yang terkandung dalam sifat-Nya. Sebagai contoh, mereka beriman bahwasanya Allah maha pengasih lagi maha penyayang, artinya Allah memiliki Rahmat yang disifati oleh Allah dan berhubungan dengan yang dirahmati nya yaitu hamba-Nya. maka seluruh nikmat adalah bukti dari rahmat Allah. dan demikian juga pada seluruh nama-nama Allah yang lain. contoh yang lain seperti sifat Allah “Maha Mengetahui” artinya Allah Maha Mengetahui yang memiliki ilmu yang dengan ilmu itu Allah mengetahui segala sesuatu. Allah Maha Kuasa yang memiliki kekuasaan yang dengan kekuasaan itu Allah mampu melakukan apapun."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Sudah berlalu penjelasan arti dari dua kata ini dalam penjelasan basmalah. Dua kata tersebut adalah dua nama yang digunakan untuk memberikan gambaran sifat bagi nama Allah dalam firmanNya ٱلۡحَمۡدُ لِلَّهِ رَبِّ ٱلۡعَٰلَمِينَ ٢ ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ ٣ yang berarti pujian bagi Allah Ta’ala karena hanya Dia lah yang berhak mendapatkan seluruh bentuk pujian dan sanjungan."
  },
  {
    "title": "Al-Mishbahul Munir fi Tahdzib Tafsir Ibnu Katsir / Syaikh Shafiyurrahman al-Mubarakfuri et. al.",
    "description": "Telah dijelaskan pada pembahasan basmalah, sehingga tidak perlu ada pengulangan kembali. Al-Qurthubi berkata:”Allah menyifati diri-Nya dengan sifat Rahman dan Rahim setelah Rabbul ‘Alamin untuk menggabungkan kabar gembira (targhiib) setelah peringatan (tarhiib). Sebagaimana firman Allah : نَبِّئْ عِبَادِي أَنِّي أَنَا الْغَفُورُ الرَّحِيمُ # وَأَنَّ عَذَابِي هُوَ الْعَذَابُ الْأَلِيمُ “Kabarkanlah kepada hamba-hamba-Ku, bahwa Sesungguhnya Aku-lah yang Maha Pengampun lagi Maha Penyayang. Dan bahwa Sesungguhnya azab-Ku adalah azab yang sangat pedih.” (Al-Hijr:49-50) Juga firman-Nya: إِنَّهُ هُوَ الْغَفُورُ الرَّحِيمُ “ Sesungguhnya Dia Maha Pengampun lagi Maha Penyayang.” (Az-Zumar:53) Selanjutnya imam al-Qurthubi mengatakan: “Ar-Rabb merupakan peringatan, sedangkan ar-Rahmaan dan ar-Rahiim merupakan anjuran.” Dalam Shahih Muslim disebutkan sebuah hadits yang diriwayatkan oleh Abu Hurairah , ia berkata:”Rasulullah  bersabda: لَوْ يَعْلَمُ الْمُؤْمِنُ مَا عِنْدَ اللهِ مِنَ الْعُقُوبَةِ، مَا طَمِعَ بِجَنَّتِهِ أَحَدٌ، وَلَوْ يَعْلَمُ الْكَافِرُ مَا عِنْدَ اللهِ مِنَ الرَّحْمَةِ، مَا قَنَطَ مِنْ جَنَّتِهِ أَحَدٌ “Seandainya seorang mukmin mengetahui siksaan yanga ada di sisi Allah, niscaya tidak ada seorang pun yang bersemangat untuk meraih Surga-Nya. Dan seandainya seorang kafir mengetahui rahmat yang ada di sisi Allah, niscaya tidak ada seorang pun yang berputus asa dari surga-Nya.”"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Firman Allah Ta’ala: }الرَّحْمنِ الرَّحِيمِ{ “Yang Maha Pengasih lagi Maha Penyayang” (QS. Al-Fatihah:2) الرَّحْمنِ (Ar-Rahmaan) adalah sifat bagi lafdzul Jalalah, sedangkan الرَّحِيمِ (Ar-Rahimi) adalah sifat berikutnya. الرَّحْمنِ (Ar-Rahmaan) berarti Allah yang memiliki sifat rahmat yang luas dan الرَّحِيمِ (Ar-Rahiim) berarti Allah memiliki rahmat yang tercurahkan (kepada makhluk-Nya) maka nama الرَّحْمَنِ (Ar-Rahmaan) adalah sifatnya sedangkan الرَّحِيمِ (Ar-Rahiim) adalah perbuatannya. Kalau saja kedua nama ini tidak datang secara berdampingan maka keduanya akan mencakup makna sifat dan perbuatan Allah Ta’ala, akan tetapi jika keduanya berdampingan maka nama ar-Rahman bermakna sifat sedangkan ar-Rahim bermakna perbuatan. Faedah: Di antara faedah ayat ini: 1. Penetapan kedua nama mulia ini “Ar-Rahmaan ar-Rahiim” bagi ‘Azza Wa Jalla dan penetapan adanya segala konsekuensi dari rahmat Allah yang berupa sifat dan rahmat Allah yang berupa perbuatan, 2. Rububiyah Allah dibangun di atas rahmat-Nya yang luas yang tercurahkan kepada makhluk-Nya, karena ketika Allah Ta’ala berfirman “Rabbil ‘aalamiin” seakan-akan ada yang bertanya: Jenis rububiyah yang mana? Apakah rububiyah bermakna azab dan siksa ataukah rububiyah bermakna rahmat dan karunia? Allah Ta’ala menjawab: Ar-Rahmaanir-Rahiim (Yang Maha Pengasih lagi Maha Penyayang)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Fatihah ayat 3: Allah kemudian menjelaskan bahwasanya kami memuji karena sebab Allah maha pengasih dan penyayang, yaitu yang memiliki kasih sayang yang luas lagu agung, dan telah berlalu isyarat akan maknya dari Ar Rahman dan Ar Rahim."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Tentang makna Ar Rahmaan dan Ar Rahiim sudah diterangkan sebelumnya. Disebutkannya ayat ini setelah \"Al Hamdu lillahi Rabbil 'aalamiin\" untuk memberitahukan bahwa Allah Subhaanahu wa Ta'aala mengurus alam semesta ini tidak dengan menyiksa dan memaksa, bahkan atas dasar kasih-sayang-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Fatihah Ayat 3",
    "description": "Dialah yang maha pengasih, pemilik dan sumber sifat kasih, yang menganugerahkan segala macam karunia, baik besar maupun kecil, kepada seluruh makhluk, maha penyayang yang selalu tiada henti memberi kasih dan kebaikan kepada orang-orang yang beriman. Dialah satu-satunya pemilik hari pembalasan dan perhitungan atas segala perbuatan, yaitu hari kiamat. Kepemilikan-Nya pada hari itu bersifat mutlak dan tidak disekutui oleh suatu apa pun."
  }
]