[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dialah Allah Subhanahu Wa Ta'ala Satu-satunya yang memiliki kekuasaan pada hari kiamat, yaitu hari pembalsan atas amal perbuatan. Dalam bacaan seorang muslim terhadap ayat ini dalam setiap rokaat dari shalat-salatnya, terkandung peringatan baginya akan datangnya hari akhir dan juga memberi motivasi kepadanya untuk mempersiapkan diri dengan amal Shalih dan menahan diri dari maksiat-maksiat dan keburukan keburukan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Pengagungan kepada Allah -Ta'ālā- bahwa Dia lah Sang Maha Raja Pemilik segalanya pada hari kiamat, tak satu jiwa pun memiliki kuasa atas jiwa lainnya. \"Yaumuddīn\" berarti hari Pembalasan dan Perhitungan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "4. Dan termasuk rahmat-Nya pula, Allah menjadikan balasan di hari pembalasan sesuai dengan amalan, agar dapat menolong orang yang terzalimi dan membalas hamba-hamba-Nya dengan pahala atau siksa. Pada hari itu Dia berkehendak sesuai kehendak-Nya, mengampuni yang Dia kehendaki dan mengazab yang Dia kehendaki dengan keadilan dan kemurahan-Nya. Dan yang demikian itu menumbuhkan harapan pada rahmat-Nya dan rasa takut dari hari pembalasan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "مَالِكِ يَوْمِ الدِّينِ Ayat ini diriwayatkan dengan dua bacaan (مَلِك) yang berarti raja dan (مالك) yang berarti pemilik sesuatu, ada pendapat mengatakan bahwa kata (مَلِك) lebih luas dan lebih dalam maknanya daripada kata (مالك), karena perintah raja harus dilaksanakan oleh pemilik sesuatu apabila pemilik tersebut berada didaerah kekuasaan sang raja, sehingga perbuatan seorang pemilik harus dibawah aturan sang raja. Sedangkan pendapat yang lain mengatakan bahwa kata (مالك) lebih dalam maknanya daripada kata (مَلِك) karena bisa jadi ia adalah pemilik manusia dan yang lainnya. Adapun sebenarnya perbedaan dari dua sifat tersebut jika dinisbahkan pada Allah Ta’ala adalah bahwa (مَلِك) adalah sifat dari Dzat Allah Ta’ala sedangkan (مالك) adalah sifat dari perbuatan Allah Ta’ala. Sedangkan makna (يوم الدين) adalah hari pembalasan dari Allah Ta’ala kepada hamba-hamba-Nya. Imam Qatadah berkata: (يوم الدين) adalah hari dimana Allah Ta’ala memberi balasan kepada hamba-hambaNya atas perbuatan mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Perhatikanlah bagaimana ayat mencakup poin-poin dibawah ini : 1- Pembuktian hari kiamat. 2- Balasan atas amalan setiap hamba -baik yang baik maupun yang buruk- 3- Allah sebagai tuhan semesta alam menyendirikan diri-Nya dalam pengadilan pada hari kiamat. 4- Keadilah hukum yang ditetapkan oleh Allah ta'ala. 2 ). Sesungguhnya Allah mengatakan : { يَوْمِ الدِّينِ } dan bukan \"مالك الدين\" ; adalah karena memberitahu kita bahwa qiamat telah ditentukan untuknya hari yang spesial dibanding hari-hari yang lain, yaitu pada hari ketika semua pelaku perbuatan menemui amalan dan hasilnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Raja segala urusan pada hari perhitungan dan hari pembalasan; dan Dialah satu-satunya penguasa pada hari itu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Pemilik hari Pembalasan} hari pembalasan dan perhitungan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Lafaz maliki yaumiddin (yang menguasai Hari pembalasan) maksudnya Allah memiliki sifat sebagai seorang raja yang dengan sifat raja tersebut Allah bisa memerintah dan melarang, bisa memberi pahala dan juga memberikan siksa, dan Allah bertindak berkehendak untuk melakukan apapun di wilayah kerajaan. Dia menyandarkan kalimat yang menguasai kepada Hari pembalasan yaitu hari kiamat hari dimana seluruh manusia akan ditagih atas semua perbuatan mereka baik dan buruknya Karena pada hari itu diperlihatkan kepada makhluk secara sempurna kesempurnaan Kerajaan Allah keadilan dan hikmahnya. Dan terputuslah segala kekuasaan makhluk sehingga pada hari itu semuanya menjadi sama derajatnya, baik seseorang raja dan rakyatnya atau seorang hamba sahaya dan orang merdeka. semuanya tertunduk di bawah keagungan Allah dan patuh terhadap kemuliaan Allah mereka menunggu balasan amalan dan mereka berharap pahala dari Allah serta takut terhadap siksa. Karena itulah dikhususkan penyebutan kata “hari pembalasa” di sini karena jika tidak, akan berarti bahwa Allah penguasa Hari pembalasan dan hari- hari selainnya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : Al-Maalik dengan bacaan panjang pada huruf mim adalah Sang Pemilik Kerajaan yang bebas mengatur sesuai dengan kehendakNya. Al-Malik adalah Sang Penguasa yang dapat memerintah dan melarang, yang Maha memberi dan menolak tanpa ada yang mampu turut campur atau melawan-Nya. Yaumid diin adalah hari pembalasan, yaitu hari kiamat ketika Allah membalas seluruh perbuatan masing-masing hamba. Makna ayat : Ini bentuk pengagungan terhadap Allah Ta’ala dimana hanya Dia-lah sang Pemilik seluruhnya pada hari kiamat dimana setiap jiwa tidak berhak atas dirinya sedikitpun. Dan Dia-lah raja yang tidak ada kerajaan pada hari kiamat selain kerajaan-Nya. Pelajaran Dari Ayat : Pada ayat ini ada pelajaran yang dapat diambil, di antaranya adalah sebagai berikut : 1. Bahwasanya Allah Ta’ala menyukai pujian, sehingga Allah memuji dirinya sendiri dan memerintahkan hamba-hambaNya untuk memujiNya. 2. Pujian itu tidaklah muncul kecuali ada sebabnya, kalau tidak ada sebab musababnya hanyalah palsu dan manis di bibir saja. Allah Ta’ala ketika memuji dirinya sendiri menyebutkan alasannya, yaitu karena Allah adalah Rabb semesta alam, yang memiliki sifat Maha pengasih lagi Maha penyayang, dan Dia-lah Penguasa hari pembalasan."
  },
  {
    "title": "Al-Mishbahul Munir fi Tahdzib Tafsir Ibnu Katsir / Syaikh Shafiyurrahman al-Mubarakfuri et. al.",
    "description": "MAKNA PENGKHUSUSAN AL-MAALIK PADA HARI PEMBALASAN Pengkhususan kekuasaan pada hari Pembalasan tidaklah menafikan kekuasaan Allah atas kerajaan lainnya (kerajaan di dunia). Karena telah disampaikan sebelumnya bahwa Dia adalah Rabb semesta alam. Dan kekuasaan-Nya itu umum, baik di dunia maupun di akhirat. Disandarkannya kata al-Maalik kepada kalimat yaumiddin (hari pembalasan), karena pada hari itu tidak ada seorang pun yang dapat mengaku-aku sesuatu dan tidak juga dapat berbicara kecuali dengan izin Allah. Sebagaimana firman Allah : يَوْمَ يَقُومُ الرُّوحُ وَالْمَلَائِكَةُ صَفًّا ۖ لَا يَتَكَلَّمُونَ إِلَّا مَنْ أَذِنَ لَهُ الرَّحْمَٰنُ وَقَالَ صَوَابًا “Pada hari, ketika ruh[1549] dan Para Malaikat berdiri bershaf- shaf, mereka tidak berkata-kata, kecuali siapa yang telah diberi izin kepadanya oleh Tuhan yang Maha Pemurah; dan ia mengucapkan kata yang benar.” (QS.An-Naba: 38). Dan Allah berfirman: يَوْمَئِذٍ يَتَّبِعُونَ الدَّاعِيَ لَا عِوَجَ لَهُ ۖ وَخَشَعَتِ الْأَصْوَاتُ لِلرَّحْمَٰنِ فَلَا تَسْمَعُ إِلَّا هَمْسًا “Dan merendahlah semua suara kepada Tuhan yang Maha pemurah, Maka kamu tidak mendengar kecuali bisikan saja.” (QS. Thaha: 108). Dan Allah berfirman: يَوْمَ يَأْتِ لَا تَكَلَّمُ نَفْسٌ إِلَّا بِإِذْنِهِ ۚ فَمِنْهُمْ شَقِيٌّ وَسَعِيدٌ “Di kala datang hari itu, tidak ada seorangun yang berbicara, melainkan dengan izin-Nya; Maka di antara mereka ada yang celaka dan ada yang berbahagia.” (QS. Hud:105). Ad-Dhahhak meriwayatkan dari Ibnu ‘Abbas tentang Maaliki yaumiddiin, ia berkata:”Pada hari itu hukum hanyalah milik Allah, tidak seperti ketika mereka hidup di dunia.” MAKNA YAUMIDDIIN Ibnu ‘Abbas berkata:”Hari Pembalasan adalah hari Perhitungan bagi semua makhluk, disebut juga hari Kiamat. Mereka diberi balasan sesuai dengan amalnya. Jika amalnya baik, maka balasannya juga baik. Jika amalnya buruk, maka balasannya pun buruk kecuali bagi orang yang diampuni.” Hal serupa juga dikatakan oleh Sahabat lainnya, Tabi’in dan juga para ulama Salaf. Inilah pendapat yang jelas. RAJA DAN RAJA DIRAJA ADALAH ALLAH Raja yang hakiki adalah Allah , Allah berfirman: هُوَ اللَّهُ الَّذِي لَا إِلَٰهَ إِلَّا هُوَ الْمَلِكُ الْقُدُّوسُ السَّلَامُ “Dialah Allah yang tiada Tuhan selain Dia, Raja, yang Maha Suci, yang Maha Sejahtera.” (QS.al-Hasyr: 23) Dalam kitab Shahih Bukhri dan Shahih Muslim diriwayatkan sebuah hadits marfu’ dari Abu Hurairah  bahwa Rasulullah  bersabda: أَخْنَعُ اسمٍ عِندَ اللهِ رَجُلٌ تَسَمَّى بِمَلِكِ الأَمْلاكِ، ولا مَالِكَ إلا اللهُ “Julukan yang paling hina di sisi Allah adalah seorang yang menjuluki dirinya raja diraja, karena tidak ada raja (yang sebenarnya) kecuali Allah.” Imam Bukhari dan Muslim juga meriwayatkan dari Abu Hurairah dari Rasulullah , baginda bersabda: يَقْبِضُ اللَّهُ الأَرْضَ، وَيَطْوِي السَّمَاءَ بِيَمِينِهِ، ثُمَّ يَقُولُ: أَنَا المَلِكُ، أَيْنَ مُلُوكُ الأَرْضِ؟ أينَ الجَبَّارون ؟ أينَ المُتَكَبِّرون ؟ “Allah (pada hari Kiamat) akan menggengam bumi dan melipat langit dengan tangan kanan-Nya, lalu berfirman: “Di manakah raja-raja bumi? Di manakah orang-orang yang merasa perkasa? Di mankah orang-orang yang sombong?.” Dalam al-Qur’an disebutkan: لِمَنِ الْمُلْكُ الْيَوْمَ ۖ لِلَّهِ الْوَاحِدِ الْقَهَّارِ \"Kepunyaan siapakah kerajaan pada hari ini?\" kepunyaan Allah yang Maha Esa lagi Maha Mengalahkan.” (QS.al-Mu’min: 16) Adapun penyebutan raja bagi selain Allah di dunia hanyalah bersifat kiasan, sebagaimana firman Allah : إِنَّ اللَّهَ قَدْ بَعَثَ لَكُمْ طَالُوتَ مَلِكًا \"Sesungguhnya Allah telah mengangkat Thalut menjadi rajamu.\" (QS.al-Baqarah: 247) Juga firman-Nya: وَكَانَ وَرَاءَهُمْ مَلِكٌ يَأْخُذُ كُلَّ سَفِينَةٍ غَصْبًا “Karena di hadapan mereka ada seorang raja yang merampas tiap-tiap bahtera.” (QS.al-Kahfi: 79). Juga firman-Nya: إِذْ جَعَلَ فِيكُمْ أَنْبِيَاءَ “Ketika Dia mengangkat Nabi-Nabi diantaramu.\" (QS.al-Maidah: 20) Dalam kitab Shahih Bukhari dan Shahih Muslim diriwayatkan: مَثَلُ المُلُوكِ على الأَسِرَّةِ “Seperti raja-raja di atas singgasana.” TAFSIR AD-DIIN Kata ad-diin berarti pembalasan dan perhitungan. Allah  berfirman: يَوْمَئِذٍ يُوَفِّيهِمُ اللَّهُ دِينَهُمُ الْحَقَّ “Di hari itu, Allah akan memberi mereka Balasan yag setimpal menurut semestinya. “(QS.an-Nuur:25) Allah juga berfirman: أَإِذَا مِتْنَا وَكُنَّا تُرَابًا وَعِظَامًا أَإِنَّا لَمَدِينُونَ “Apakah Sesungguhnya kita benar-benar (akan dibangkitkan) untuk diberi pembalasan?\" (QS.as-Shaffaat: 53). Dalam sebuah hadits Rasulullah  bersabda: الكَيِّس مَنْ دَانَ نَفْسَه وعَمِلَ لِماَ بَعْد الموتِ “Orang yang cerdik adalah orang yang bermuhasabah diri dan beramal untuk kehidupan setelah kematian.” (HR.Ibnu Majah). Sebagaimana perkataan Umar : حَاسِبُوا أَنْفُسَكُمْ قَبْلَ أَنْ تُحَاسَبُوا وَزِنُوا أَنْفُسَكُمْ قَبْلَ أَنْ تُوزَنُوا وَتَأهِّبوا لِلْعَرْضِ الْأَكْبَرِ على مَنْ لا تَخْفَى عليه أَعْمَالَكم }يَوْمئذٍ تُعْرَضُونَ لَا تَخْفَى مِنْكُمْ خَافِيَةٌ{ “Hisablah diri kalian sendiri sebelum kalian dihisab, timbanglah amal kalian sebelum (amal) kalian ditimbang. Bersiaplah untuk menghadapi hari besar, yaitu hari diperlihatkannya amal seseorang, sementara semua amal kalian tidak ada yang tersembunyi dari-Nya. Pada hari itu kami dihadapkan (kepada Rabb mu), tidak ada sesuatu pun dari keadaanmu yang tersembunyi (bagi Allah).” (Mushanaf Ibnu Abi Syaibah)."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Firman Allah Ta’ala: }مَالِكِ يَوْمِ الدِّينِ{ “Yang menguasai hari pembalasan” (QS. Al-Fatihah:3) Adalah sifat bagi Allah. Dan يَوْمِ الدِّينِ “hari pembalasan” adalah hari kiamat, ad-Diin di sini bermakna pembalasan yakni Allah adalah pemilik hari di mana makhluk-makhluknya dibalas atas perbuatan mereka. Pada hari itu tidak ada raja melainkan Dia. Kata الدِّينِ (Ad-Diin) terkadang bermakna balasan, sebagaimana dalam ayat ini. Dan terkadang bermakna amal perbuatan sebagaimana dalam firman Allah Ta’ala: { لَكُمْ دِينُكُمْ وَلِيَ دِينِ } “Bagimu (amalan) agamamu dan bagiku agamaku” (QS. Al-Kafirun:6) Dikatakan juga: كَمَا تَدِيْنُ تُدَانُ “Kamu akan diperlakukan orang lain sebagaimana perilakumu kepada mereka” maknanya: كَمَا تَعْمَلُ تُجَازَى Anda medapatkan balasan sesuai amal perbuatan anda. Dalam firman Allah Ta’ala “مَالِكِ” terdapat cara baca qiroah sab’ah [7 macam cara baca al-Quran] yang berbeda, مَلِكِ : al-Malik (dengan memendekkan mim) lebih khusus daripada al-Maalik (dengan memanjangkan mim), terdapat faedah yang besar dari mengumpulkan dua jenis bacaan tersebut yaitu bahwa kerajaan-Nya Jalla Wa ‘Ala adalah kerajaan yang hakiki, karena di antara manusia pun ada yang mempunyai kerajaan tapi ia bukanlah pemilik, ada yang bernama Malik namun ia tidak bisa mengatur, dan ada yang menjadi pemilik namun ia bukanlah raja, seperti itulah kondisi semua manusia. Akan tetapi Allah ‘Azza wa Jalla adalah raja pemilik segalanya. Faedah: Di antara fedah ayat ini: 1. Penetapan sifat Maha Raja Allah ‘Azza Wa Jalla dan kerajaan-kerajaan-Nya di hari pembalasan karena pada hari itu semua kerajaan dan semua raja akan sirna. Jika ada orang yang bertanya: Bukankah Allah adalah Raja di hari kebangkitan dan Raja dunia? Jawabannya: Tentu! Tetapi kekuasaan, kerajaan dan kekuatan-Nya akan nampak pada hari itu, karena saat itu Allah akan menyeru: { لِمَنِ الْمُلْكُ الْيَوْمَ } “kepunyaan siapakah kerajaan pada hari ini?” (QS. Al-Mu’min:16) maka tidak akan ada seorang pun yang akan menjawab. Lalu Allah akan mengatakan: { لِلَّهِ الْوَاحِدِ الْقَهَّارِ} “Hanya milik Allah yang Maha Esa lagi Maha Kuasa” (QS. Al-Mu’min:16) Di dunia muncul raja-raja, bahkan bermunculan raja-raja yang diyakini oleh rakyatnya bahwa tidak ada raja kecuali mereka. Misalnya Orang-orang komunis, mereka tidak meyakini adanya penguasa pemilik langit dan bumi, mereka meyakini bahwa kehidupan manusia hanyalah kelahiran dari rahim para ibu kemudian akan ditelan bumi, mereka meyakini bahwa tuhan mereka adalah penguasa mereka. 2. Penetapan adanya kebangkitan dan pembalasan sebagaimana firman-Nya Ta’ala: }مَالِكِ يَوْمِ الدِّينِ{ “ Yang menguasai hari pembalasan ” 3. Anjuran bagi manusia agar melakukan amal kebaikan untuk menyiapkan diri di hari pembalasan bagi yang beramal."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Fatihah ayat 4: Maka Allah menjelaskan bahwasanya kami (sebagai makhluk) memuji-Nya karena sebab Ia adalah raja di hari kiamat, yang hari itu adalah hari pembalasan (hisab)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maalik (yang menguasai) dengan memanjangkan mim, berarti: pemilik. dapat pula dibaca dengan Malik (dengan memendekkan mim), artinya: Raja. Dihubungkannya kepemilikan hari pembalasan kepada-Nya meskipun milik-Nya dunia dan akhirat, karena pada hari itu kelihatan dengan jelas kekuasaan dan kepemilikan-Nya. Pada hari itu antara raja-raja di dunia dengan rakyat sama tidak ada perbedaan, mereka tunduk kepada keagungan-Nya, menunggu pembalasan-Nya, mengharapkan pahala-Nya dan takut terhadap siksa-Nya. Yaumiddin (hari Pembalasan): hari yang di waktu itu masing-masing manusia menerima pembalasan amalannya baik atau buruk. Yaumiddin disebut juga yaumul qiyaamah, yaumul hisaab, yaumul jazaa' dan sebagainya. Dibacanya ayat ini oleh seorang muslim dalam setiap shalat untuk mengingatkannya kepada hari akhir; hari di mana amalan diberikan balasan. Demikian juga mendorong seorang muslim untuk beramal shalih dan menghindari kemaksiatan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Fatihah Ayat 4",
    "description": "Dialah satu-satunya pemilik hari pembalasan dan perhitungan atas segala perbuatan, yaitu hari kiamat. Kepemilikan-Nya pada hari itu bersifat mutlak dan tidak disekutui oleh suatu apa pun. Atas dasar itu semua, hanya kepada engkaulah kami menyembah dan beribadah dengan penuh ketulusan, kekhusyukan, dan tawakal, dan hanya kepada engkaulah kami memohon pertolongan dalam segala urusan dan keadaan kami, sambil kami berusaha keras."
  }
]