[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kami mengkhususkan Engkau dengan ibadah, dankami hanya memohon pertolongan kepada Engkau saja dalam semua urusan kami Sebab semua urusan berada di tangan-Mu, tidak ada seorang pun selain mu yang memiliki sebesar biji sawi sekalipun darinya. Dan dalam ayat ini terkandung petunjuk bahwa seorang hamba tidak boleh melakukan sesuatu pun dari jenis-jenis ibadah seperti berdoa, Istighosah, menyembelih dan thowaf kecuali untuk Allah Semata, dan di dalamnya juga terkandung obat hati dari penyakit berupa bergantung kepada selain Allah, dan dari penyakit Ria, ‘ujub dan sombong."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Kami mempersembahkan segala jenis peribadatan dan ketaatan hanya kepada-Mu, dan kami tidak menyekutukan-Mu dengan siapapun. Hanya dari-Mu saja lah kami meminta pertolongan dalam semua urusan kami, karena di tangan-Mu lah segala macam kebaikan. Dan tidak ada penolong lain selain Engkau."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "5. Kesempurnaan dalam perhitungan, keagungan dalam mengatur, dan keindahan dalam membalas dan memuliakan kekasih-kekasih-Nya membuat Allah berhak diesakan dalam setiap ibadah. Oleh sebab itu, hanya kepada-Nyalah kita memohon pertolongan dan bersandar; sebab Dialah yang mengatur segala urusan makhluk-Nya. Dan termasuk dari pengaturan dan pemuliaan-Nya adalah Dia mengajarkan kepada kita bagaimana cara untuk mengesakannya dalam beribadah, sehingga kita dapat mentaati perintah-Nya dan menjauhi larangan-Nya, serta meminta pertolongan-Nya. Dia juga mengajarkan bagaimana mengikhlaskan ibadah kepada-Nya, sebagaimana dalam firman-Nya: إياك نعبد وإياك نستعين"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ Yakni, kami mengkhususkan ibadah hanya untuk-Mu dan kami mengkhususkan pertolongan hanya kepada-Mu, kami tidak menyembah selain-Mu dan kami tidak meminta pertolongan selain-Mu. Dan makna secara bahasa dari ibadah adalah batas terjauh dari tunduk dan taat; sedangkan makna secara syar’i adalah sesuatu yang terkumpul didalamnya kesempurnaan cinta, tunduk, dan takut. Penggunaan kata ganti “kami” dalam ayat ini (dari sisi kebahasaan bahasa Arab) sebagai ungkapan dari orang yang berdo’a dan orang lain, dan bukan dimaksudkan sebagai penghormatan diri. Sedangkan kata ibadah didahulukan dari kata permintaan pertolongan karena ibadah merupakan wasilah/jalan untuk meminta pertolongan. Diriwayatkan dari Ibnu Abbas terntang tafsir dari ayat ini (إياك نعبد) yakni: Wahai Rabb kami hanya kepada-Mu kami mengesakan dan takut, tak ada selain-Mu. (وإياك نستعين) dan hanya kepada-Mu kami memohon pertolongan dalam menjalankan ketaatan-Mu dan dalam segala urusan kami, tak ada selain-Mu. Dan diriwayatkan dari Qatadah bahwa ia berkata: Allah Ta’ala telah memerintahkan kalian agar ikhlas dalam beribadah kepada-Nya dan agar senantiasa memohon pertolongan dalam segala urusan kalian."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Muhammad bin 'Auf al-Hamshy berkata : \"suatu ketika aku melihat Ahmad bin al-Hawari melaksanakan shalat Isya', dia mengawali shalatnya dengan { الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ } sampai ketika ia membaca { إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ } , aku kemudian keluar menglilingi pembatas, kemudian aku kembali dan ternyata ia masih membaca ayat ini sampai aku tertidur, malam pun lewat sampai aku terbangun, dan ia masih membaca : { إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ } sampai waktu subuh tiba\". 2 ). Ibnu mengatakan : \"Aku mengamati bahwa doa yang paling bermanfaat bagi seorang hamba adalah ketika ia memohon bantuan atas keridhoan Allah ta'ala, kemudian aku melihatnya ada pada surah al-Fatihah : { إيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ }. 3 ). Tidak ada sesuatu yang lebih bermanfaat untuk hati seorang hamba daripada tahuid dan ikhlas dalam beragama untuk Allah, dan tidak ada sesuatu yang lebih berbahaya baginya daripada kesyirikan, maka ketika seorang hamba menemukan hakikat keikhlasan yang itu adalah hakikat daripada : { إيَّاكَ نَعْبُدُ } bersama dengannya hakikat tawakkal yang merupakan hakikat dari : { وَإِيَّاكَ نَسْتَعِينُ } sesungguhnya ia telah menemukan sesuatu yang derajatnya lebih tinggi diatas apapun yang belum ditemukan oleh orang selainnya. 4 ). Diantara manusia banyak yang menyandingkan dua sifat buruk ini dalam diri mereka yakni riya' dan 'ujub; ketika ia berbuat riya' maka ia telah mensekutukan atau menyandingkan sang pencipta dengan selainnya, dan ketika ia berbuat 'ujub maka ia telah menyandingkan sang pencipta dengan dirinya yang lemah, dan keduanya adalah sifat atau keadaan orang-orang yang menyombongkan diri, karena orang yang berbuat riya' tidak mngamalkan firman Allah : { إيَّاكَ نَعْبُدُ } sedangkan orang yang berbuat 'ujub tidak merealisasikan firman Allah : { وَإِيَّاكَ نَسْتَعِينُ }. 5 ). Dalam ayat kata ibadah didahulukan sebelum isiti'anah, hal itu dikarenakan ibadah adalah hak Allah atas hamba-Nya, adapun isti'anah adalah keinginan setiap hamba, dan tabi'at kehidupan adalah seorang hamba mengutamakan apa yang menjadi penyebab diperolehnya ridho tuhannya sebelum memohon kepada-Nya sesuatu, dan itu merupakan sikap rendah diri dihadapan Allah, karena ibadah adalah sebab terkabulnya permintaan seorang hamba. 6 ). Hati manusia dihadapkan dengan dua jenis penyakit yang berbahaya, jika ia tidak mampu mencegah keduanya maka penyakit itu akan menghantarkannya kepada kebinasaan yang pasti, yaitu : riya' dan sombong, dan penawar yang terbaik untuk riya' adalah dengan : { إيَّاكَ نَعْبُدُ }, sedangkan penawar untuk kesombongan adalah dengan : { وَإِيَّاكَ نَسْتَعِينُ }. Sebagaimana yang juga disebutkan oleh Ibnu al-Qoyyim yang diriwayatkan dari gurunya Ibnu Taimiyyah rahimahullah, bahwasanya { إيَّاكَ نَعْبُدُ } menolak sifat riya', dan { وَإِيَّاكَ نَسْتَعِينُ } menolak kesombongan dari hati manusia. 7 ). Seorang hamba butuh memohon pertolongan kepada Allah dalam mengerjakan perintah dan menghindari segala larangan dan sabar atas taqdir yang ditetapkan atasnya, baik ketika ia didunia dan ketika kematian menghampirinya serta apa yang akan terjadi padanya di alam barzakh dan ketika kiamat itu terjadi, dan tidak siapapun yang mampu memberinya pertolongan atas itu semua kecuali Allah, maka barang siapa yang dapat merealisasikan perkara isti'anah ini hanya kepada-Nya, niscaya Allah akan menolongnya. 8 ). Segala upaya yang membatalkan jernihnya keikhlasan seseorang; tidak lain adalah upaya yang membatalkan perjanjian antara hamba dengan Allah, dan merupakan pengkhianatan terhadap-Nya, bagaimana tidak ? ketika kamu memutuskan kesaksian atas dirimu di pagi dan sore hari dengan : { إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ } kemudian kamu berpaling dibelakangan-Nya kepada selain-Nya ! maka siapakah yang dapat melindungimu setelah itu dari azab Allah ? 9 ). Seorang pentadabbur berkata : \"begitu banyak aku shalat dibelakang syaikh Abdurrahman ad-Dausary, dan aku tidak mengetahui berapa kali dia membaca surah al-Fatihah tanpa menangis, khususunya ketika ia membaca : { إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ } . 10 ). Seorang hamba tidak akan mampu mencapai kedudukan taufiq dan kebajikan hanya dengan hasrat, tetapi harus dengan meminta kepada siapa yang mampu mengahantarkannya kepada kedudukan itu, dan selalu merasa bahwa dia perlu dengan pertolongan itu, tetapi permohonann itu harus dengan hati dan lisan yang senantiasa didukung oleh segala warna ubudiyah qolbiyah dan badaniyah : { إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ }."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Kami khususkan kepadaMu, Ya Allah, ibadah dan permohonan pertolongan kami. Kami tidak akan menyembah dan meminta pertolongan kepada selain Engkau"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Hanya kepada Engkaulah kami menyembah} Hanya kepada Engkaulah kami mengkhususkan segala bentuk peribadatan {dan hanya kepada Engkaulah kami memohon pertolongan} dan Hanya kepada Engkaulah kami mencari pertolongan dalam segala hal"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Lafaz iyyaka na’budu wa iyyaka nasta’in (Hanya kepada engkau kami menyembah dan hanya Kami memohon pertolongan) Maksudnya kami menghususkan ibadah dan memohon pertolongan hanya kepada Engkau. dimaknai demikian mendahulukan suatu kata yang menjadi objek menunjukkan suatu pembatasan, yaitu menetapkan hal tersebut bagi yang disebutkan dan meniadakannya dari selainnya. maka seolah-olah berkata, “kami menyembahmu dan tidak menyembah selain dirimu, kami meminta pertolongan kepadamu tidak meminta pertolongan kepada selain diri-Mu”. Dan didahulukannya penyebutan ibadah daripada permintaan akan pertolongan adalah di antara bentuk mendahulukan penyebutan hal yang umum dari hal yang khusus. Serta perhatian dalam mendahulukan hak-hak Allah daripada hak hamba-nya. Ibadah adalah sebuah kata yang mencakup apa saja yang dicintai oleh Allah dan diridhoi-nya berupa perbuatan maupun perkataan baik yang nampak atau yang tersembunyi. dan memohon pertolongan adalah Bersandar kepada Allah dalam mendapatkan kemaslahatan dan menolak kemadorotan diiringi dengan keyakinan yang kuat kepadanya dalam mewujudkan semua itu. Melaksanakan ibadah kepada Allah dan memohon pertolongan kepadanya merupakan jalan bagi sebuah kebahagiaan yang abadi keselamatan dari segala kejahatan. maka tidak ada cara dalam mendapatkan keselamatan kecuali dengan melaksanakan kedua hal tersebut. Sesungguhnya sebuah ibadah itu dianggap sebagai ibadah apabila ibadah tersebut diambil dari contoh Rasulullah Shallallahu Alaihi Wasallam yang dilaksanakan dengan tujuan mencari wajah Allah Semata. Dengan kedua faktor ini jadilah perbuatan tersebut menjadi sebuah ibadah. Disebutkannya “permohonan pertolongan” setelah “ibadah”, padahal sebenarnya memohon pertolongan itu adalah bagian dari ibadah tersebut hal ini karena kebutuhan hamba dalam seluruh ibadah-ibadah mereka kepada meminta pertolongan kepada Allah, sebab bila Allah tidak menolongnya maka tidak akan terwujud untuknya sesuatu yang dikehendakinya dari pelaksanaan perintah maupun menghindari larangan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : Iyyaaka adalah dhomir (kata ganti) dalam posisi nashab, ditujukan untuk mengajak bicara satu orang. Na’budu artinya Kami ta’at kepada Mu dengan seluruh ketundukan, cinta, dan pengagungan. Nasta’iin artinya Kami memohon pertolongan-Mu untuk kami agar dapat menta’atiMu. Makna ayat : Allah Ta’ala mengajari hamba-hambaNya tata cara bertawassul kepada-Nya agar Dia mengabulkan doa hamba-Nya. Yaitu dengan ucapanNya : Pujilah Allah Ta’ala dan sanjunglah serta agungkanlah Dia. Berlakulah konsisten dengan hanya beribadah kepadaNya dan tidak menyekutukanNya. Mintalah pertolongan kepadaNya dan jangan meminta pertolongan kepada selainNya. Pelajaran dari Ayat : 1. Adab dalam berdoa, ketika seseorang akan berdoa hendaklah memulai dengan memuji Allah, menyanjungNya, dan mengagungkanNya. Kemudian ditambah dengan mengucap shalawat atas Nabi shallallahu ‘alaihi wasallam, setelah itu baru meminta apa yang dibutuhkan. Hal itu lebih dekat untuk terkabulnya doa. 2. Jangan menyembah selain Allah Ta’ala dan jangan meminta pertolongan (dalam hal yang hanya mampu dilakukan oleh Allah, pent) kepada selainNya."
  },
  {
    "title": "Al-Mishbahul Munir fi Tahdzib Tafsir Ibnu Katsir / Syaikh Shafiyurrahman al-Mubarakfuri et. al.",
    "description": "MAKNA IBADAH MENURUT BAHASA DAN ISTILAH SYARA’AT Menurut bahasa ibadah bermakna kehinaan. Dikatakan: “Thariqun mu’abbad wa ba’iirun mu’abbad (jalan yang diratakan dan unta yang dijinakkan), maksudnya ditundukkan. Adapun menurut istilah syar’i, ibadah adalah sebuah ibarat bagi terkumpulnya cinta, ketundukan dan rasa takut yang sempurna. FAEDAH DIHAHULUKAN DAN DIULANGI OBJEK SERTA FAEDAH ILTIFAAT (PERPINDAHAN DARI KATA GANTI KE-3 MENJADI KE-2) Didahulukannya objek yaitu kalimat إِيَّاكَ dan setelah itu diulangi lagi, bertujuan untuk memberi perhatian dan pembatasan. Maksudnya: “Kami tidak beribadah kecuali hanya kepada-Mu, dan kami tidak bertawakkal kecuali hanya kepada-Mu.” Inilah puncak kesempurnaan dalam taat. Agama ini secara keseluruhan kembali kepada dua makna di atas. Sebagaimana dikatakan oleh sebagian Salaf, bahwa surat al-Fatihah adalah rahasia al-Qur’an dan rahasia al-Fatihah terletak pada [إياك نعبد وإياك نستعين] “Hanya kepada-Mu kami beribadah dan hanya kepada-Mu kami memohon pertolongan.” Penggalan pertama merupakan pernyataan berlepas diri dari kesyirikan. Sedangkan penggalan kedua merupakan sikap berlepas diri dari upaya dan kekuatan serta berserah diri kepada Allah . Makna seperti ini tidak hanya terdapat dalam satu ayat al-Qur’an saja, dalam ayat lain Allah berfirman: وَلِلَّهِ غَيْبُ السَّمَاوَاتِ وَالْأَرْضِ وَإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ فَاعْبُدْهُ وَتَوَكَّلْ عَلَيْهِ ۚ وَمَا رَبُّكَ بِغَافِلٍ عَمَّا تَعْمَلُونَ “Dan kepunyaan Allah-lah apa yang ghaib di langit dan di bumi dan kepada-Nya-lah dikembalikan urusan-urusan semuanya, Maka sembahlah Dia, dan bertawakkallah kepada-Nya. dan sekali-kali Tuhanmu tidak lalai dari apa yang kamu kerjakan.” (QS.Huud: 123). قُلْ هُوَ الرَّحْمَٰنُ آمَنَّا بِهِ وَعَلَيْهِ تَوَكَّلْنَا ۖ فَسَتَعْلَمُونَ مَنْ هُوَ فِي ضَلَالٍ مُّبِينٍ “Katakanlah: \"Dia-lah Allah yang Maha Penyayang Kami beriman kepada-Nya dan kepada-Nya-lah Kami bertawakkal. kelak kamu akan mengetahui siapakah yang berada dalam kesesatan yang nyata\". (Al-Mulk:29) Juga firman-Nya dalam ayat yang mulia ini, إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ “Hanya Engkaulah yang Kami sembah[6], dan hanya kepada Engkaulah Kami meminta pertolongan.” Adanya perubahan bentuk gari orang ketiga kepada lawan bicara (huruf kaf), karena ketika seseorang memuji Allah maka seolah-olah dia dekat dan hadir di hadapan Allah Ta’ala. Karena itu Allah berfirman: إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ “Hanya Engkaulah yang Kami sembah[6], dan hanya kepada Engkaulah Kami meminta pertolongan.” AL-FATIHAH ADALAH PETUNJUK AGAR KITA MEMUJI ALLAH, MAKA KITA WAJIB MEMBACANYA KETIKA SHALAT Ini merupakan dalil bahwasanya awal-awal surat al-Fatihah merupakan pemberitahuan dari Allah  yang memberikan pujian kepada diri-Nya sendiri dengan berbagai sifat-Nya agar memuji-Nya dengan pujian tersebut. Oleh karena itu tidak sah shalat seseorang yang tidak membaca al-Fatihah di dalamnya, sedangkan ia mampu melakukannya, sebagaimana hadits yang terdapat dalam kitab Shahih Bukhari dan Shahih Muslim dari Ubaidah bin as-Shamit , beliau berkata: “Rasulullah  bersabda: لَا صَلاةَ لِمَنْ لَمْ يَقْرَأْ بِفَاتِحَةِ الكِتَابِ “Tidak sah shalat bagi orang yang tidak membaca al-Fatihah.” Dalam Shahih Muslim diriwayatkan sebuah hadits dari Abu Hurairah , dari Rasulullah , baginda bersabda: قَالَ اللهُ تَعَالَى: قَسَمْتُ الصَّلَاةَ بَيْنِي وَبَيْنَ عَبْدِي نِصْفَيْنِ، وَلِعَبْدِي مَا سَأَلَ، فَإِذَا قَالَ الْعَبْدُ: {الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ}، قَالَ اللهُ تَعَالَى: حَمِدَنِي عَبْدِي، وَإِذَا قَالَ: {الرَّحْمَنِ الرَّحِيمِ}، قَالَ اللهُ تَعَالَى: أَثْنَى عَلَيَّ عَبْدِي، وَإِذَا قَالَ: {مَالِكِ يَوْمِ الدِّينِ}، قَالَ: مَجَّدَنِي عَبْدِي - وَقَالَ مَرَّةً فَوَّضَ إِلَيَّ عَبْدِي - فَإِذَا قَالَ: {إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ}قَالَ: هَذَا بَيْنِي وَبَيْنَ عَبْدِي، وَلِعَبْدِي مَا سَأَلَ، فَإِذَا قَالَ: {اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ صِرَاطَ الَّذينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ}قَالَ: هَذَا لِعَبْدِي وَلِعَبْدِي مَا سَأَلَ. “Allah berfirman: 'Aku membagi shalat antara Aku dengan hambaKu setengah-setengah, dan hambaku mendapatkan apa yang dia minta. Apabila seorang hamba membaca; 'Alhamdulillahi rabbil 'alamin.’ Allah menjawab; ‘Hamba-Ku telah memuji-Ku.’ (ketika) seorang hamba membaca; ‘Arrahmaanir rahiim.’ Allah berfirman; ‘Hamba-Ku telah menyanjung-Ku.’ (ketika) seorang hamba membaca; ‘Maaliki yaumid diin.’ Allah berfirman; ‘Hamba-Ku telah mengagungkan-Ku.’ (ketika) seorang hamba membaca; ‘Iyyaaka na'budu wa iyyaka nasta'iin.’ Allah berfirman; ‘Inilah bagian-Ku dan bagian hamba-Ku, sedangkan bagi hamba-Ku apa yang di mintanya.’ (ketika) seorang hamba membaca; ‘Ihdinash shiraathal mustaqiim, shiraathal ladziina an'amta 'alaihim ghairil maghdluubi 'alaihim waladl dllaallliin.’ Allah berfirman; ‘Inilah bagian dari hamba-Ku, dan baginya apa yang di minta.’\" TAUHID ULUHIYAH Imam ad-Dhahhak meriwayatkan dari Ibnu Abbas , beliau berkata: [إِيَّاكَ نَعْبُدُ] “Hanya kepada-Mu kami beribadah,” maksudnya hanya Engkau semata yang kami esakan, kami takuti dan kami harapkan wahi Rabb kami, bukan selain-Mu.” [وَإيَّاكَ نَسْتَعِيْنُ] ‘Hanya kepada-Mu kami memohon pertolongan,” karena ibadah kepada-Nya merupakan tujuan. Meminta pertolongan merupakan sarana untuk mendapatkannya, dan perkara yang didahulukan adalah perkara yang lebih penting dan seterusnya. Wallahu a’alam. PENYEBUTAN NABI SEBAGAI HAMBA YANG MERUPAKAN KEDUDUKAN TERTINGGI Allah telah menyebut Nabi sebagai hamba-Nya yang merupakan bukti baginda memiliki kedudukan mulia. Allah berfirman: الْحَمْدُ لِلَّهِ الَّذِي أَنزَلَ عَلَىٰ عَبْدِهِ الْكِتَابَ وَلَمْ يَجْعَل لَّهُ عِوَجًا ۜ “segala puji bagi Allah yang telah menurunkan kepada hamba-Nya Al kitab (Al-Quran) dan Dia tidak Mengadakan kebengkokan di dalamnya.” (Al-Kahf:1) Firman-Nya: وَأَنَّهُ لَمَّا قَامَ عَبْدُ اللَّهِ يَدْعُوهُ “Dan bahwasanya tatkala hamba Allah (Muhammad) berdiri menyembah-Nya (mengerjakan ibadat).” (Al-Jinn:19) سُبْحَانَ الَّذِي أَسْرَىٰ بِعَبْدِهِ لَيْلًا “Maha suci Allah, yang telah memperjalankan hamba-Nya pada suatu malam.” (Al-Israa:1) Allah menyebut nabi-Nya dengan sebutan hamba ketika menurunkan kepadanya al-Qur’an, ketika baginda berdakwah dan ketika diperjalankan pada malam Isra’. BIMBINGAN AGAR BERIBADAH KETIKA DADA TERASA SEMPIT Allah membimbing Rasulullah  untuk senantiasa menjalankan ibadah ketika hati merasa sesat akibat pendustaan orang-orang yang menentangnya. Allah  berfirman: وَلَقَدْ نَعْلَمُ أَنَّكَ يَضِيقُ صَدْرُكَ بِمَا يَقُولُونَ # فَسَبِّحْ بِحَمْدِ رَبِّكَ وَكُن مِّنَ السَّاجِدِينَ # وَاعْبُدْ رَبَّكَ حَتَّىٰ يَأْتِيَكَ الْيَقِينُ “Dan Kami sungguh-sungguh mengetahui, bahwa dadamu menjadi sempit disebabkan apa yang mereka ucapkan. Maka bertasbihlah dengan memuji Tuhanmu dan jadilah kamu di antara orang-orang yang bersujud (shalat). Dan sembahlah Tuhanmu sampai datang kepadamu yang diyakini (ajal).” (Al-Hijr:97-99)"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Firman Allah Ta’ala: } إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ{ “Hanya kepada Engkaulah kami menyembah dan hanya kepada Engkaulah kami mohon pertolongan” (QS. Al-Fatihah:4) إِيَّاكَ [Iyaaka] “Hanya kepada Engkau”: Kedudukannya (dalam ilmu nahwu) sebagai maf’ul bih yang dimajukan, Amilnya adalah نَعْبُدُ (na’budu)”Kami menyembah”. Tujuan dikedepankan dari amilnya untuk menghasilkan pembatasan makna, maka dari itu maknanya adalah: Kami tidak menyembah kecuali hanya kepada Engkau. Maf’ul bih di sini dalam bentuk terpisah dengan ‘amilnya karena tidak memungkinkan untuk disambung dengannya. نَعْبُدُ [Na’budu]“Kami menyembah” Maknanya adalah kami tunduk kepada-Mu dengan ketundukan yang sempurna. Oleh karena itu, anda akan mendapati orang-orang yang beriman meletakkan anggota badan yang paling mulia (yakni kepala) di tempat yang setara dengan kaki sebagai bentuk ketundukan kepada Allah ‘Azza Wa Jalla, sujud di atas tanah, bahkan jidat pun menyapu debu, semua itu dilakukan atas dasar ketundukan kepada Allah ‘Azza wa Jalla. Andai ada seseorang yang berkata: Saya akan memberikanmu dunia seluruhnya tapi bersujudlah kepadaku” seorang mukmin tidak akan menurutinya selamanya, karena ketundukan hanyalah ditujukan kepada Allah ‘Azza Wa Jalla saja. Ibadah juga mencakup segala perbuatan yang diperintah oleh Allah, dan meninggalkan segala larangan-Nya karena orang yang belum melaksanakan itu semua maka ia tidak disebut orang yang menyembah, jika ia tidak melakukan perkara yang diperintahkan maka ia belum dikatakan hamba sejati dan jika belum meninggalkan segala larangan ia juga belum dikatakan hamba sejati, Hamba yang sejati adalah yang sesuai dengan keinginan syar’i yang ditentukan oleh Allah (yang ia sembah). Karena ibadah mengharuskan seorang insan menegakkan setiap yang diperintahkan kepadanya dan meninggalkan semua yang dilarang kepadanya, dan semua itu tidak mungkin dapat terlaksana kecuali tanpa bantuan dari Allah, oleh karenanya, Allah Ta’ala berfirman: } وَإِيَّاكَ نَسْتَعِينُ{ “Dan hanya kepada Engkaulah kami mohon pertolongan” (QS. Al-Fatihah:4) Maknanya adalah kami tidak akan memohon pertolongan kecuali hanya kepada Engkau dalam melaksanakan ibadah dan kegiatan lainnya. Sedangkan al-Isti’anah artinya adalah meminta pertolongan, dan Allah ‘Azza Wa Jalla mengumpulkan antara ibadah dan isti’anah atau dengan tawakkal pada beberapa ayat dalam al-Qur’an, karena ibadah yang sempurna tidak akan terlaksana kecuali dengan pertolongan Allah, bersandar, dan bertawakkal kepada-Nya. Faedah: Di antara faedah ayat ini: 1. Pemurnian ibadah hanya kepada Allah, ini sesuai firman-Nya: } إِيَّاكَ نَعْبُدُ{ “Hanya kepada Engkaulah kami menyembah” (QS. Al-Fatihah:4) Ditunjukkan dengan didahulukannya ma’mul dari Amilnya (didahulukannya Iyaka dari na’abudu). 2. Pemurnian isti’anah (permintaan pertolongan) hanya kepada Allah ‘Azza Wa Jalla, ini berdasarkan firman-Nya: } وَإِيَّاكَ نَسْتَعِينُ{ “Dan hanya kepada Engkaulah kami mohon pertolongan” (QS. Al-Fatihah:4) Ditunjukkan dengan didahulukannya ma’mul. Jika ada yang bertanya: Bagaimana bisa dikatakan harus memurnikan isti’anah hanya kepada Allah padahal dalam ayat lainnya Allah Ta’ala berfirman: }وَتَعَاوَنُوا عَلَى الْبِرِّ وَالتَّقْوَى{ “Dan tolong-menolonglah kamu dalam (mengerjakan) kebajikan dan takwa” (QS. Al-Maaidah:2) di dalamnya ada penetapan pertolongan selain dari Allah. Nabi shallallaahu ‘alaihi wa sallam juga bersabda: وَتُعِيْنُ الرَّجُلَ فِي دَابَّتِهِ فَتَحْمِلُهُ عَلَيْهِ أَوْ تَرْفَعُ لَهُ عَلَيْهِ مَتَاعَهُ صَدَقَةٌ “ Engkau membantu seseorang saat menaiki tunggangannya, engkau mengambilkan dan mengangkat perbekalannya untuknya adalah sedekah ” (1) Jawabannya: Meminta bantuan ada dua macam: Pertama: Meminta bantuan dengan bersandar sepenuhnya, maksudnya adalah anda tergantung pada Allah ‘Azza Wa Jalla dan berlepas dari daya dan kekuatan anda. Yang seperti ini khusus untuk Allah ‘Azza Wa Jalla. Kedua: Meminta bantuan yang bermakna ikut serta dalam pekerjaan yang hendak engkau kerjakan, yang seperti ini dibolehkan selama orang yang dimintai bantuan masih hidup dan mampu membantu, karena ini bukanlah ibadah. Oleh karena itu, Allah Ta’ala berfirman: { وَتَعَاوَنُوا عَلَى الْبِرِّ وَالتَّقْوَى } “Dan tolong-menolonglah kamu dalam (mengerjakan) kebajikan dan takwa” (QS. Al-Maaidah:2) Jika ada yang bertanya: Apakah meminta bantuan kepada makhluk dibolehkan dalam kondisi apapun? Jawabannya: Tidak, Meminta bantuan kepada makhluk hanya dibolehkan saat orang yang dibantu mampu membantu. Namun jika ia tidak mampu membantumu, maka anda tidak diperbolehkan meminta bantuan kepadanya, seperti meminta bantuan kepada penghuni kubur, hal ini haram dilakukan, bahkan termasuk syirik akbar. Karena penghuni kubur tidak dapat memenuhi kebutuhannya sendiri sedikit pun. Bagaimana mungkin bisa menolongnya?! Seperti meminta bantuan kepada yang ghaib (tidak hadir) pada perkara yang tidak mampu dilakukan. Misalnya meyakini bahwa ada wali di bagian timur dunia sana mampu membantunya dalam menyelesaikan perkara penting di negeri tempat tinggalnya. Ini juga adalah syirik akbar. Karena yang dimintai bantuan tidak akan mampu membantunya sedangkan ia berada ditempat yang sangat jauh di sana. Jika ada yang bertanya: Bolehkan meminta bantuan sepada manusia pada hal yang diperbolehkan? Jawabannya: Sebaiknya tidak meminta bantuan kecuali jika memang dibutuhkan atau jika ia tahu bahwa yang dimintai bantuan dimudahkan untuk memenuhinya lalu meminta bantuan agar mengantarkan rasa senang kepadanya. Dan hendaknya yang dimintai bantuan bukan dalam perkara dosa dan melampaui batas untuk tidak menerima permintaan itu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Fatihah ayat 5: Ketika dengan keagungan ini, sebagai raja dan memiliki kasih sayang, maka Allah berhak untuk di ibadahi, yaitu mengkhususkan ibadah untuk-Nya dan permohonan dalam setiap urusan mereka (makhluk) dalam urusan keduniaan dan akhirat, dan oleh karena itu tidak diperkenankan untuk beribadah (berpaling) dari segala macam bentuk ibadah seperti doa, istighatsah kepada siapapun selain kepada Allah saja. Begitu juga tidak diperkenankan meminta pertolongan kepada selain Allah dari urusan yang tidak mampu dari selain Allah, begitu juga tidak diperkenankan bersandarnya hati dengan siapapun selain Allah, dan ini semua tidaklah menafikan sebuah sebab (yang harus ditempuh). Telah lalu bahwasanya Allah memerintahk untuk beribadah dengan cara meminta (kepada-Nya) karena pentingnya hal tersebut, dan karena tujuan diciptakannya jin dan manusia adalah karena sebab ibadah, Allah berfirman : Dan tidaklah aku menciptakan jin dan manusia kecuali untuk beribadah kepada-Ku (Adz Dzariyat : 56), berkata Ibnu Taimiyyah : Ibadah adalah sebuah nama bagi seluruh apa yang Allah cintai dan ridhai dari ucapan dan amalan batin mapun yang dzahir. Dan Allah mengulangi kata iyyaka sebagai pengkhususan ibadah dan meminta pertolongan hanya kepada-Nya saja."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Na'budu diambil dari kata 'ibaadah yang artinya kepatuhan dan ketundukkan yang ditimbulkan oleh perasaan terhadap kebesaran Allah, sebagai Tuhan yang disembah, karena keyakinan bahwa Allah mempunyai kekuasaan yang mutlak terhadapnya disertai rasa cinta dan berharap kepada-Nya. Ditambahkan rasa cinta, karena landasan yang harus ada pada seseorang ketika beribadah itu ada tiga: rasa cinta kepada Allah Ta’ala, rasa takut dan tunduk kepada Allah Ta’ala dan rasa berharap. Oleh karena itu, kecintaan saja yang tidak disertai dengan rasa takut dan kepatuhan, seperti cinta terhadap makanan dan harta, tidaklah termasuk ibadah. Demikian pula rasa takut saja tanpa disertai dengan cinta, seperti takut kepada binatang buas, maka itu tidak termasuk ibadah. Tetapi jika suatu perbuatan di dalamnya menyatu rasa takut dan cinta maka itulah ibadah. Dan tidaklah ibadah itu ditujukan kecuali kepada Allah Ta'ala semata. Dalam ayat ini terdapat dalil tidak bolehnya mengarahkan satu pun ibadah (seperti berdo'a, ruku', sujud, thawaf, istighatsah/meminta pertolongan), berkurban dan bertawakkal) kepada selain Allah Ta'ala. Nasta'iin (minta pertolongan), terambil dari kata isti'aanah: mengharapkan bantuan untuk dapat menyelesaikan suatu pekerjaan yang tidak sanggup dikerjakan dengan tenaga sendiri. Dalam ayat ini terdapat obat terhadap penyakit ketergantungan kepada selain Allah Ta'ala, demikian juga obat terhadap penyakit riya', 'ujub (bangga diri) dan sombong. Disebutkannya isti'anah kepada Allah Ta'ala setelah ibadah memberikan pengertian bahwa seseorang tidak dapat menjalankan ibadah secara sempurna kecuali dengan pertolongan Allah Ta'ala dan menyerahkan diri kepada-Nya. Ayat ini menunjukkan lemahnya manusia mengurus dirinya sendiri sehingga diperintahkannya untuk meminta pertolongan kepada-Nya Berdasarkan ayat ini juga bahwa beribadah dan meminta pertolongan kepada-Nya merupakan sarana memperoleh kebahagiaan yang kekal dan terhindar dari keburukan. Perbuatan dikatakan ibadah jika diambil dari Rasulullah shallallahu 'alaihi wa sallam dan diniatkan ikhlas karena Allah Ta'ala. Perlu diketahui bahwa isti'anah (meminta pertolongan) terbagi dua: - Isti’anah tafwidh, meminta pertolongan dengan menampakkan kehinaan, pasrah dan sikap harap, ini hanya boleh kepada Allah saja, syirk hukumnya bila mengarahkan kepada selain Allah. - Isti’anah musyarakah, meminta pertolongan dalam arti meminta keikut-sertaan orang lain untuk turut membantu, maka tidak mengapa kepada makhluk, namun dengan syarat dalam hal yang mereka mampu membantunya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Fatihah Ayat 5",
    "description": "Atas dasar itu semua, hanya kepada engkaulah kami menyembah dan beribadah dengan penuh ketulusan, kekhusyukan, dan tawakal, dan hanya kepada engkaulah kami memohon pertolongan dalam segala urusan dan keadaan kami, sambil kami berusaha keras. Kami memohon, tunjukilah kami jalan yang lurus, dan teguhkanlah kami di jalan itu, yaitu jalan hidup yang benar, yang dapat membuat kami bahagia di dunia dan di akhirat, serta dapat mengantarkan kami menuju keridaan-Mu."
  }
]