[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tunjukilah dan bimbinglah kami serta berilah Taufik bagi kami menuju jalan yang lurus, teguhkanlah kami di atasnya hingga kami bertemu dengan-Mu kelak. Yaitu agama Islam yang merupakan Jalan yang jelas yang menyampaikan kepada keridhoan Allah dan kepada surga-Nya yang telah ditunjukkan oleh penutup para Rosul dan Para Nabi Allah, yaitu Muhammad Shallallahu Alaihi Wasallam. maka tidak ada jalan menuju kebahagiaan bagi seorang hamba kecuali dengan Istiqomah di atas jalan tersebut."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Tunjukilah kami jalan yang lurus, tuntunlah kami ke sana, dan teguhkanlah kami di atasnya serta tambahkanlah hidayah bagi kami. Arti \"aṣ-Ṣirāṭ al-Mustaqīm\" adalah jalan yang terang serta tak berkelok, yaitu Islam yang Allah mengutus Muhammad -ṣallallāhu 'alaihi wa sallam- dengannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "6-7. Karena doa dan harapan termasuk merupakan jalan yang paling agung dalam merealisasikan peribadatan, maka kita diarahkan agar meminta dan memohon kepada-Nya taufiq dan petunjuk menuju jalan yang benar dan agama yang lurus, yaitu agama Islam agar kita dapat mengamalkan hukum-hukum dan hikmah-hikmahnya. Ia adalah agama yang dianut oleh para nabi, shiddiq, dan syuhada; hati mereka damai, mata mereka ridha, dan jiwa mereka tenang dengan agama tersebut, sebab mereka telah merasakan manisnya, mengetahui tingginya nilai, ilmu dan puncaknya, serta menyadari keutamaan dan perbedaannya daripada agama-agama lain yang telah dirubah dan dipalsukan, sebagaimana yang dilakukan oleh orang-orang Yahudi yang dimurkai Allah akibat mereka telah menyekutukan Allah dan mengubah kitab Taurat, serta orang-orang Nasrani yang tersesat dari jalan yang benar akibat menyekutukan Allah dan mengubah kitab Injil. Oleh sebab itulah Allah berfirman: غير المغضوب عليهم ولا الضالين Dalam potongan ayat ini terdapat penegasan terhadap doa sebelumnya serta permohonan agar dijauhkan dari syirik, sesat, dan menyesatkan; dan ini semua setelah permohonan agar mendapat taufik supaya dapat merealisasikan peribadatan dengan menjadi golongan Allah dan para nabi-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ Makna dari (الهداية) adalah petunjuk atau pertolongan untuk menjalankan ketaatan; sedangkan permintaan petunjuk dari yang diungkapkan oleh orang yang telah mendapat petunjuk berarti ia meminta tambahan hidayah dari hidayah yang telah ada. Sebagaimana dalam firman Allah Ta’ala: “Dan orang-orang yang mendapat petunjuk, Allah menambah petunjuk kepada mereka dan memberikan kepada mereka (balasan) ketakwaannya.” (QS. Muhammad : 17) Makna dari (الصراط المستقيم) secara bahasa adalah: jalan yang tidak berbelok; dan yang dimaksud dalam ayat adalah jalan Islam. Dijelaskan dalam hadist yang dikeluarkan oleh Imam Ahmad dan Tirmidzi dari an-Nawwas bin Sam’an dari Rasulullah SAW beliau Bersabda: “Allah memberikan perumpamaan berupa sirath mustaqim (jalan yang lurus). Kemudian di atas kedua sisi jalan itu terdapat dua dinding. Dan pada kedua dinding itu terdapat pintu-pintu yang terbuka lebar. Kemudian di atas setiap pintu terdapat tabir penutup yang tejulur. Dan di atas pintu jalan terdapat penyeru yang berkata, “Wahai sekalian manusia, masuklah kalian semua ke dalam Shirath dan janganlah kalian menoleh kesana kemari!” Sementara di bagian dalam dari Shirath juga terdapat penyeru yang selalu mengajak untuk menapaki Shirath, dan jika seseorang hendak membuka pintu-pintu yang berada di sampingnya, maka ia berkata, “Celaka kau! Janganlah sekali-kali membukanya! Karena jika kau membukanya maka kau akan masuk kedalamnya.” Ash-Shirath itu adalah Al-Islam. Kedua dinding itu merupakan batasan-batasan Allah Ta’ala. Sementara pintu-pintu yang terbuka adalah hal-hal yang diharamkan oleh Allah. Dan adapun penyeru di depan Shirath itu adalah Kitabullah (Al-Qur`an) ‘Azza wa Jalla. Sedangkan penyeru dari atas Shirath adalah penasihat Allah (naluri) yang terdapat pada setiap kalbu seorang mukmin.”"
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Diantara adab berdoa adalah mengawalinya dengan pujian, hal itu dicontohkan oleh firman Allah : { الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ , الرَّحْمَٰنِ الرَّحِيمِ , مَالِكِ يَوْمِ الدِّينِ } adalah pujian, dan ini sesuai untuk menjadi muqoddimah sebelum doa : { اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ }. 2 ). Doa yang paling bermanfaat dan paling agung bagi seorang hamba adalah doa yang ada dalam surah al-Fatihah : { اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ }; karena sesungguhnya jika Allah menolong hamba-Nya dengan jalan yang lurus ini tentunya akan menjadi pendorong baginya dalam meningkatkan ketaatan kepada-Nya, dan menguatkannya dalam menjauhi segala larangan-Nya, sehingga ia tidak akan ditimpa oleh musibah apapun baik di didunia maupun di akhirat. 3 ). Diantara hidayah yang selalu diperbaharui adalah : { اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ } maka barangsiapa yang mengetahui hakikat hidayah dan kebutuhan seorang hamba kepadanya; dia telah memahami bahwasanya apa yang belum ia peroleh dari hidayah itu adalah berlipat banyaknya dari apa yang telah ia peroleh, dan sesungguhnya disetiap waktu ia butuh dengan hidayah yang terus diperbaharui itu. 4 ). Shirat al-Mustaqim : tidak lain adalah jalan orang-orang yakin dengan keagungan Allah serta memiliki keimanan yang sempurna, dan tanpanya seorang hamba tidak akan terbebas dari segala rintangan, maka barangsiapa yang dalam dirinya dapat terwujud perkara yang agung ini sungguh ia telah meraih mahkota kenikmatan, dan kesempurnaan petunjuk, maka dia akan menjadi insan yang lebih baik dan akan mulia dengannya; oleh karena itu harus ada usaha untuk sampai kepadanya di setiap shalat; doa yang akan terus dipanjatkan dan mencakup segala umur. 5 ). Perhatikanlah betapa banyak keajaiban dan rahasia-rahasia agung yang terkandung dalam surah al-Fatihah, khususnya dibawah naungan firman Allah : { اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ } , sungguh ini adalah doa yang mesti dipanjatkan oleh segenap ummat manusia agar mereka meraih petunjuk yang benar, dia adalah sorakan bersama yang menyenandungkan sebuah petunjuk, dan merupakan sikap rendah diri seorang hamba dihapadan Allah dengan meraihnya. 6 ). Hakikat shirot al-Mustaqim adalah : mengetahui kebenaran dan mengamalkannya; karena tatkala Allah menyebut shirot al-Mustaqim ini dalam surah al-Fatihah Dia kemudian menjelaskan siapa yang melenceng dari jalan yang lurus itu dan mereka adalah orang-orang Yahudi yang dimurkai, mereka mengetahui kebenaran tetapi tidak mengamalkannya, dan orang-orang Nashrani yang telah tersesat dari jalan yang benar dan mereka melakukan segala hal yang melenceng dari kebenaran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Tuntunlah kami menuju jalan yang lurus, jelas dan tidak menyimpang, yaitu islam dan iman"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Bimbinglah kami} Bimbinglah kami, tunjukkanlah kepada kami, bantulah kami, dan perjalankanlah kami. {ke jalan yang lurus} jalan lurus yang tidak berliku-liku, yaitu agama Islam yang mana Allah mengutus nabi Muhammad SAW dengan itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Kemudian lafaz ihdinaa shirotol mustaqiim (Tunjukilah kami jalan yang lurus) maksudnya Tuntunlah kami, Bimbinglah kami dan Arahkan kami kepada jalan yang lurus. yaitu jalan yang sangat jelas yang menghantarkan kepada Allah dan kepada surganya. yaitu dengan mengetahui kebenaran dan melaksanakannya. Maka tunjukkanlah kami kepada jalan tersebut dan berikanlah petunjuk kepada kami di jalan tersebut. maka hidayah (petunjuk) kepada jalan adalah bentuk konsisten terhadap agama Islam dan meninggalkan agama agama selain Islam. Hidayah (petunjuk) kepada jalan yang lurus meliputi petunjuk kepada seluruh perincian-perincian agama, baik Ilmu maupun amalannya. oleh karena itu doa ini adalah termasuk doa yang paling lengkap dan paling berguna bagi seorang hamba. dengan demikian maka wajiblah atas manusia untuk berdoa kepada Allah dengan doa itu dalam setiap rakaat salat nya karena kebutuhan yang sangat kepada hal tersebut."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : Ihdinaa artinya adalah berilah petunjukMu kepada kami dan langgengkan petunjuk tersebut. Ash-Shirooth adalah jalan yang mengantarkan kepada keridhoanMu dan surgaMu, yaitu dengan beragama Islam. Al-Mustaqiim artinya yang tidak melenceng dari kebenaran, serta tidak berbelok dari hidayah. Makna ayat : Dengan pengajaran dari Allah, seorang hamba dan saudara-saudaranya yang lain meminta kepada Allah setelah bertawassul kepadaNya dengan pujian, sanjungan, dan pengagungan untukNya, dan setelah berjanji agar tidak menyembah selainNya, dan tidak meminta pertolongan kepada selain Allah, meminta agar hidayah Islam yang didapat akan terus langgeng serta tidak pernah terputus dari keislaman. Pelajaran dari ayat : Motivasi untuk senantiasa berdoa kepada Allah serta menundukkan diri di hadapanNya. Dalam hadits di sebutkan,”Doa adalah ibadah.”"
  },
  {
    "title": "Al-Mishbahul Munir fi Tahdzib Tafsir Ibnu Katsir / Syaikh Shafiyurrahman al-Mubarakfuri et. al.",
    "description": "RAHASIA BERDO’A SETELAH MEMUJI DAN MENYEBUT SIFAT ALLAH Setelah terlebih dahulu memuji yang diminta yaitu Allah ta’ala dan menyatakan hanya kepada-Nya permohonan ditujukan, maka layaklah jika hal itu diiringi dengan permintaan. Sebagaimana firman-Nya (dalam hadits Qudsi): “Setengahnya untuk-Ku dan setengah lainnya untuk hamba-Ku dan bagi hamba-Ku yang ia minta.” Hal itu merupakan keadaan yang sangat sempurna bagi seorang yang mengajukan permintaan. Pertama, ia memuji Rabb yang akan ia mintai dan kemudian memohon keperluan dirinya sendiri dan juga saudaranya dari orang-orang yang beriman, melalui ucapannya: [اهدنا الصراط المستقيم] “Tunjukanlah kami kepada jalan yang lurus.” Karena hal itu lebih dekat kepada pengabulan dan dipenuhinya apa yang ia butuhkan. Karena itulah Allah  membimbing kita untuk senantiasa melakukannya, karena hal itu lebih sempurna. Permintaan itu bisa diajukan dengan cara memberitahukan keadaan dan kebutuhan orang yang mengajukan permintaan tersebut. Sebagaimana yang diucapkan Musa n: إِنِّي لِمَا أَنْزَلْتَ إِلَيَّ مِنْ خَيْرٍ فَقِيرٌ \"Ya Tuhanku Sesungguhnya aku sangat memerlukan sesuatu kebaikan yang Engkau turunkan kepadaku\". (QS.al-Qashash: 24). Permintaan itu bisa dimulai dengan menyebutkan sifat-sifat Rabb yang ia mintai, seperti ucapan Dzun Nun (Nabi Yunus) n: أَنْ لَا إِلَٰهَ إِلَّا أَنْتَ سُبْحَانَكَ إِنِّي كُنْتُ مِنَ الظَّالِمِينَ \"Bahwa tidak ada Tuhan selain Engkau. Maha suci Engkau, Sesungguhnya aku adalah Termasuk orang-orang yang zalim.\" (QS.al-Anbiya: 87). Tetapi terkadang permintaan itu cukup hanya dengan memuji-Nya. Sebagaimana yang diungkapkan oleh seorang penyair: أَأَذْكُرُ حَاجَتِى أَمْ قَدْ كَفَانِى حَيَاؤُكَ إِنَّ شِيْمَتَكَ الْحَيَاءُ إِذَا أَثْنَى عَلَيكَ المَرْءُ يَوْمًا كَفَاهُ مِنْ تَعَرُّضِهِ الثَّنَاءُ Apakah aku harus menyebutkan kebutuhanku, ataukah cukup bagiku rasa malumu Sesungguhnya rasa malu merupakan adat kebiasaanmu. Jika suatu hari menyampaikan pujian kepadamu, niscaya pujian itu mencukupi orang itu karena telah mengemukankannya. MAKNA HIDAYAH Kata hidayah dalam ayat ini berarti bimbingan dan taufik. Terkadang kata hidayah itu mut’addi (membutuhkan objek) tanpa pelu huruf penyambung, sebagaiman firman-Nya: [اهدنا الصراط المستقيم] “Tunjukanlah kepada kami jalan yang lurus.” Ayat ini mengndung arti: berikanlah ilham kepad kami, atau berikanlah taufik kepada kami, berikanlah rizki atau anugrah kepada kami. Juga firman-Nya: [وَهَدَيْنَاهُ النَّجْدَيْنِ] “Dan kami telah menunjukkan kepadanya dua jalan.” (QS.al-Balad:10). Artinya, kami telah menjelaskan kepadanya jalan kebaikan dan jalan keburukan. Selain itu kata hidayah juga bisa muta’addi dengan memakai kata إلى , sebagaimana firman Allah : [اجْتَبَاهُ وَهَدَاه إِلَى صِرَاطٍ مُّسْتَقِيمٍ] “Allah telah memilihnya dan menunjukinya kepada jalan yang lurus.” (QS.an-Nahl: 121). Juga firman-Nya: [فَاهْدُوْهُم إِلى صِراطِ الْجَحِيمِ] “Maka tunjukkanlah kepada mereka jalan ke Neraka.” (QS.ash-Shaffaat: 23). Makna hidayah dalam ayat-ayat di atas adalah bimbingan dan petunjuk. Demikian juga firman-Nya: [وَإِنَّكَ لَتَهْدي إلى صِرَاطٍ مُّسْتَقِيمٍ] “Dan sesungguhnya kamu benar-benar memberi petunjuk kepada jalan yang lurus.” (QS.as-Syuura: 52). Terkadang kata hidayah muta’addi dengan memakai huruf ل sebagaimana ucapan para penghuni Surga: [الَحَمْدُ لِلّهِ الَذِي هَدَانَا لِهَذا] “Segala puji bagi Allah yang telah menunjuki kami keapada (Surga) ini.” (QS. Al-anfal: 43). Artinya, Allah memberikan taufik kepada kami untuk memperoleh Surga ini dan Dia menjadikan kami sebagai penghuninya. MAKNA JALAN YANG LURUS Sedangkan mengenai ash-shiraathal mustaqiim (jalan yang lurus), Imam Abu Ja’far bin Jarir mengatakan: “Seluruh ahli tafsir sepakat bahwa maksud ash-shiraathal mustaqim adalah jalan yang terang dan lurus, tidak ada kebengkokan padanya. Demikian yang dikenal dalam bahasabin seluruh bangsa Arab. Di antaranya adalah perkataan Jarir bin ‘Athiyyah al-Khathfi: أَمِيْرْ المُؤْمِنِيْنَ على صِرَاطٍ إِذَا اعْوَجَّ المَوَارْدُ مُسْتَقِيمٍ Amirul Mu’minin di atas jalan yang lurus Manakala persimpangan-persimpangan mulai bengkok. Ibnu Jarir melanjutkan penuturannya:”Dalil-dalil pendukung bagi makna ini sangat banyak sehingga tidak bisa disebutkan satu persatu. Beliau melanjutkan, “Orang Arab menggunakan kata ash-shirath untuk segala perkataan, perbuatan dan sifat baik yang lurus ataupun yang bengkok, maka ketika engkau mensifatinya dengan lafadz mustaqiim (lurus) karena jalan tersebut lurus dan ketika disifati dengan mu’waj (bengkok) karena kebengkokannya. Yang dimaksud jalan lurus itu adalah Islam. Imam Ahmad meriwayatkan dalam Musnadnya dari an-Nawwas bin Sam’an , dari Rasulullah , baginda bersabda: ضَرَبَ اللهُ مَثَلًا صِرَاطًا مُسْتَقِيمًا، وَعَلَى جَنْبَتَيْ الصِّرَاطِ سُورَانِ، فِيهِمَا أَبْوَابٌ مُفَتَّحَةٌ، وَعَلَى الْأَبْوَابِ سُتُورٌ مُرْخَاةٌ، وَعَلَى بَابِ الصِّرَاطِ دَاعٍ يَقُولُ: أَيُّهَا النَّاسُ، ادْخُلُوا الصِّرَاطَ جَمِيعًا، وَلَا تَتَعَرَّجُوا، وَدَاعٍ يَدْعُو مِنْ فَوْقِ الصِّرَاطِ، فَإِذَا أَرَادَ يَفْتَحُ شَيْئًا مِنْ تِلْكَ الْأَبْوَابِ، قَالَ: وَيْحَكَ لَا تَفْتَحْهُ، فَإِنَّكَ إِنْ تَفْتَحْهُ تَلِجْهُ، وَالصِّرَاطُ الْإِسْلَامُ، وَالسُّورَانِ: حُدُودُ اللهِ، وَالْأَبْوَابُ الْمُفَتَّحَةُ: مَحَارِمُ اللهِ، وَذَلِكَ الدَّاعِي عَلَى رَأْسِ الصِّرَاطِ: كِتَابُ اللهِ، وَالدَّاعِي مِنِ فَوْقَ الصِّرَاطِ: وَاعِظُ اللهِ فِي قَلْبِ كُلِّ مُسْلِمٍ “Allah telah membuat sebuah perumpamaan jalan yang lurus. Di dua sisi jalan terdapat dua pagar. Di pagar tersebut terdapat pintu-pintu yang terbuka. Dan di pintu-pintu itu terdapat tirai-tirai yang terurai. Di depan jalan itu terdapat seseorang yang berseru: ‘Wahai manusia, masuklah kalian semua ke jalan ini dan jangan lah berbelok.’ Di atas itu juga terdapat penyeru yang akan memanggil. Apabila ada seseorang yang ingin membuka pintu-pintu tersebut,penyeru di atas jalan berkata:’Celaka kamu, janganlah engkau membukanya. Jika engkau membukanya, niscaya engkau akan terperosok masuk ke dalamnya.’ Jalan itu adalah Islam. Pagar-pagar itu adalah batasan-batasan Allah. Pintu-pintu yang terbuka itu adalah perkara-perkara yang diharamkan Allah. Penyeru di depan pintu jalan adalah Kitabullah. Penyeru di atas jalan adalah pemberi peringatan dari Allah yang ada di dalam hati setiap muslim.” PERMOHONAN HIDAYAH SEORANG MUKMIN SEDANGKAN IA SUDAH MENDAPAT HIDAYAH ITU Apabila ditanyakan, mengapa seorang mukmin meminta hidayah, baik di waktu mengerjakan shalat maupun di luar shalat, padahal ia sendiri sudah mendapatkannya. Apakah yang demikian itu termasuk usaha mendapatkan sesuatu yang sudah ada atau bukan? Jawabannya, bukan. Sekiranya mereka tidak perlu memohon hidayah siang dan malam, niscaya Allah  tidak akan membimbingnya untuk melakukan hal itu. sebab, seorang hamba senantiasa membutuhkan Allah kapan saja dan bagaimanapun keadaannya, agar diberikan keteguhan, kemantapan, penambahan dan hidayah, karena ia tidak kuasa mendatangkan manfa’at ataupun mudharat kepada dirinya sendiri kecuali atas izin Allah . Oleh karena itu Allah  selalu membimbingnya untuk senantiasa memohon kepada-Nya setiap saat agar Dia memberikan pertolongan, keteguhan dan taufik. Orang yang berbahagia adalah orang yang dieri taufiq oleh Allah untuk senantiasa memohon kepada-Nya. Sebab, Allah telah menjamin akan mengabulkan permohonan seseorang apabila ia memohon kepada-Nya. Terlebih lagi permohonan orang yang berada dalam keadaan terdesak dan membutuhkan bantuan-Nya pada malam dan siang hari. Allah  berfirman: يَا أَيُّهَا الَّذِينَ آمَنُوا آمِنُوا بِاللَّهِ وَرَسُولِهِ وَالْكِتَابِ الَّذِي نَزَّلَ عَلَىٰ رَسُولِهِ وَالْكِتَابِ الَّذِي أَنْزَلَ مِنْ قَبْلُ “Wahai orang-orang yang beriman, tetaplah beriman kepada Allah dan Rasul-Nya dan kepada kitab yang Allah turunkan kepada Rasul-Nya serta kitab yang Allah turunkan sebelumnya.”(QS. An-Nisa’:136) Allah telah memerintahkan orang-orang yang beriman agar tetap dalam iman. Dan hal tersebut bukan meminta sesuatu yang sudah ada, karena maksudnya memohon ketetapan, kelansungan dan kesinambungan amal yang dapat membantu mencapai tujuan tersebut. Wallahu a’lam. Allah  juga memerintahkan hamba-hamba-Nya yang beriman untuk mengucapkan do’a: رَبَّنَا لَا تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا وَهَبْ لَنَا مِنْ لَدُنْكَ رَحْمَةً ۚ إِنَّكَ أَنْتَ الْوَهَّابُ “(mereka berdoa): \"Ya Tuhan Kami, janganlah Engkau jadikan hati Kami condong kepada kesesatan sesudah Engkau beri petunjuk kepada Kami, dan karuniakanlah kepada Kami rahmat dari sisi Engkau; karena Sesungguhnya Engkau-lah Maha pemberi (karunia)\". (QS.Ali Imran: 8). Dengan demikian, makna firman-Nya, [اهْدِنَا الصِّراطَ المُسْتَقِيمَ] adalah: “Semoga Engkau terus berkenan memberikan petunjuk kepada kami jalan yang lurus dan jangan Engkau belokkan dari ke jalan yang lain.”"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Firman Allah Ta’ala: }اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ{ “Tunjukilah kami jalan yang lurus” (QS. Al-Faatihah:5) Ada dua cara membaca pada kata الصِّرَاطَ [ash-shirat], pertama dengan huruf sin السِّرَاط as-siraat kedua dengan huruf shad الصِّرَاطَ ash-Shirath. Yang dimaksud dengan shirat pada ayat ini adalah jalan, dan yang dimaksud dengan petunjuk (pada ihdinashiraath) adalah hidayah berupa petunjuk (kepada jalan yang lurus) dan hidayah berupa taufik (meniti petunjuk jalan itu dengan mengamalkannya). Maka jika anda mengucapkan اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ [Ihdinashshiraathal mustaqiim] hakikatnya anda telah meminta kepada Allah Ta’ala ilmu yang bermanfaat, dan amalan saleh dan maksud الْمُسْتَقِيمَ [Al-Mustaqiim]“Yang lurus” adalah yang tidak belika-liku. Faedah: Di antara faedah dari ayat ini: 1. Bersandarnya manusia kepada Allah ‘Azza Wa Jalla setelah ia memohon pertolongan kepada-Nya dalam beribada agar Allah memberinya hidayah kepada jalan yang lurus, karena ibadah haruslah didasari keikhlasan. Faedah ini berdasarkan firman-Nya: إِيَّاكَ نَعْبُدُ “Hanya kepada Engkaulah kami menyembah”, berupa permohonan pertolongan yang akan menguatkan ibadah, sebagaimana firman-Nya, وَإِيَّاكَ نَسْتَعِينُ “dan hanya kepada Engkaulah kami mohon pertolongan” juga berupa meniti jalan syari’at islam, sebagaimana yang ditunjukan dalam firman-Nya Ta’ala: اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ “Tunjukilah kami jalan yang lurus” karena الصِّرَاطَ الْمُسْتَقِيمَ “jalan yang lurus” adalah syari’at islam yang datang dari Rasulullah shallallahu ‘alaihi wa sallam.. 2. Ketinggian bahasa al-Quran, dengan dihilangkannya huruf jarr pada kalimat “Ihdhina” faedahnya (dalam bahasa Arab), agar permintaan hidayah itu lebih umum mencakup hidayah ilmu (agama) dan hidayah taufiq (mengamalkan ilmu), karena hidayah terbagi dua, pertama hidayah ilmu dan petunjuk kedua hidayah taufiq dan pengamalan ilmu. Hidayah yang pertama: Hidayah yang sifatnya hanya sekedar petunjuk saja. Allah telah memberikan hidayah jenis ini kepada semua orang, sebagaimana firman-Nya: { شَهْرُ رَمَضَانَ الَّذِي أُنْزِلَ فِيهِ الْقُرْآنُ هُدًى لِلنَّاسِ } “Bulan Ramadan, bulan yang di dalamnya diturunkan Al Qur'an sebagai petunjuk bagi manusia” (QS. Al-Baqarah:185) Hidayah yang Kedua: Taufiq untuk mau mengikuti dan meniti jalan syari’at islam, sebagaimana dalam firman-Nya: { ذَلِكَ الْكِتَابُ لَا رَيْبَ فِيهِ هُدًى لِلْمُتَّقِينَ } “Kitab (Al Qur'an) ini tidak ada keraguan padanya; petunjuk bagi mereka yang bertakwa” (QS. Al-Baqarah:2) Hidayah ini tidak diperoleh sebagian orang, sebagaimana dalam firman-Nya: { وَأَمَّا ثَمُودُ فَهَدَيْنَاهُمْ فَاسْتَحَبُّوا الْعَمَى عَلَى الْهُدَى } “Dan adapun kaum Tsamud maka mereka telah Kami beri petunjuk tetapi mereka lebih menyukai buta (kesesatan) dari petunjuk itu” (QS. Fushilat:17) “mereka telah kami beri petunjuk” maknanya adalah kami telah menjelaskan dan menunjukkan kebenaran kepada mereka, namun mereka tidak mendapat taufiq untuk mengikutinya. 3. Jalan terbagi dua: yang lurus dan yang melenceng, jika jalan yang ditempuh sesuai dengan kebenaran maka ini adalah jalan yang lurus sebagaimana firman-Nya: { وَأَنَّ هَذَا صِرَاطِي مُسْتَقِيمًا فَاتَّبِعُوهُ } “Dan bahwa (yang Kami perintahkan) ini adalah jalan-Ku yang lurus, maka ikutilah dia” (QS. Al-An’aam: 153) Dan yang menyelisihi jalan ini maka itulah jalan yang melenceng."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Fatihah ayat 6: Allah menjelaskan sebesar-besar yang dituntut bagi hamba-Nya, yaitu untuk mencari hidayah menuju kepada jalan yang jelas yang mengantarkan menuju ke surga (yaitu jalan islam). Bersama dengan ia yang telah diberikan petunjuk maka islam menganjurkan untuk tetap mencari hidayah agar tetap kokoh di atasnya; Di mana banyak jalan yang bercabang ke kanan dan ke kiri; Maka wajib bagi seorang hamba untuk meminta kepada Allah agar kokoh menepaki jalan petunjuk dan agar tetap di atas shiratal mustaqim."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ihdina (tunjukkanlah kami), dari kata hidayaat yang artinya memberi petunjuk ke suatu jalan yang lurus (irsyad). Yang dimaksud di ayat ini bukan sekedar memberi hidayah saja (yakni tidak hanya hidayah irsyad), tetapi juga meminta diberi taufik (dibantu menempuh jalan yang lurus). Oleh karenanya kata ihdinaa langsung dilanjutkan dengan shiraathal mustaqiim, tidak dipisah dengan kata \"ilaa\" (ke) yang berarti \"tunjukkanlah kami ke …..\" karena ia meminta dua hidayah (irsyad dan taufiq). Oleh karena itu, arti ayat ini adalah \"Tunjukkanlah kami jalan yang lurus dan bantulah kami menempuh jalan itu serta teguhkanlah kami di atasnya sampai kami berjumpa dengan-Mu\". Jalan yang lurus itu adalah Islam; sebagai jalan yang dapat mengarah kepada keridhaan Allah dan surga-Nya, jalan yang telah diterangkan oleh Rasul-Nya Muhammad shallallahu 'alaihi wa sallam, sehingga seseorang tidak dapat bahagia kecuali dengan istiqamah di atasnya. Dengan demikian, di ayat ini kita juga meminta kepada Allah Ta'ala agar dapat istiqamah di atas jalan yang lurus itu sampai akhir hayat mengingat hati yang lemah mudah berbalik dan karena hidup di dunia penuh dengan liku-liku, penuh dengan gelombang cobaan dan fitnah yang begitu dahsyat yang dapat menghanyutkan seorang mukmin. Sungguh berbahagialah orang yang tetap mendirikan shalat karena do'a yang dipanjatkannya ini, berbeda dengan orang yang meninggalkan shalat; yang tidak lagi memanjatkan do'a ini sehingga mudah sekali ia terbawa oleh arus fitnah itu yang membuat dirinya binasa –wal 'iyaadz billah-."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Fatihah Ayat 6",
    "description": "Kami memohon, tunjukilah kami jalan yang lurus, dan teguhkanlah kami di jalan itu, yaitu jalan hidup yang benar, yang dapat membuat kami bahagia di dunia dan di akhirat, serta dapat mengantarkan kami menuju keridaan-Mu. Yaitu jalan orang-orang yang telah engkau beri nikmat kepadanya, berupa keimanan, hidayah, dan rida-Mu. Mereka itu, seperti dijelaskan dalam surah an-nisa''/4: 69, adalah: 1) para nabi yang telah dipilih Allah untuk memperoleh bimbingan sekaligus ditugasi untuk menuntun manusia menuju kebenaran ilahi; 2) shiddiqin, yaitu orang-orang yang selalu benar dan jujur, tidak ternodai oleh kebatilan, tidak pula mengambil sikap yang bertentangan dengan kebenaran; 3) syuhada', yaitu mereka yang bersaksi atas kebenaran dan kebajikan, melalui ucapan dan tindakan mereka, walau harus mengorbankan nyawa sekalipun, atau mereka yang disaksikan kebenaran dan kebajikannya oleh Allah, para malaikat, dan lingkungan mereka; dan 4) salihin, yaitu orang-orang saleh yang tangguh dalam kebajikan dan selalu berusaha mewujudkannya. Jalan yang kami mohon itu bukan jalan mereka yang dimurkai, yang mengetahui kebenaran tetapi tidak mengikuti dan mengamalkannya, bahkan menentangnya, seperti sebagian kelompok yahudi dan yang mengikuti jalan mereka, dan bukan pula jalan mereka yang sesat dari jalan kebenaran dan kebaikan, seperti sebagian kelompok nasrani dan yang sejalan dengan mereka, sebab mereka enggan beriman dan mengikuti petunjuk-Mu."
  }
]