[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "(Yasin). Pembicaraan tentang huruf-huruf terpisah-pisah (di awal surat seperti ini) telah hadir di awal Surat al-baqarah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Yā Sīn. Pembahasan tentang huruf-huruf semacam ini sudah ada di awal surah Al-Baqarah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1-2. Huruf-huruf al-Muqattha’ah yang menjadi pembuka beberapa surat mengandung isyarat pada keagungan dan mukjizat al-Qur’an yang diturunkan dalam bahasa Arab dengan huruf-hurufnya. Dan tantangan untuk mendatangkan sesuatu yang semisal al-Qur’an tetap berlaku hingga sekarang, dan ini menjadi saksi bahwa al-Qur’an adalah kalamullah dan risalah-Nya yang ditujukan bagi manusia. Allah bersumpah dengan firman-Nya yang menjadi kalam yang paling mulia untuk diucapkan dan senantiasa diperdengarkan dengan penuh kekhusu’an. Ia mengandung banyak hikmah dan ilmu; dan ia terlindungi sehingga tidak ada tangan yang mampu merubahnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. يسٓ (Yaa siin) Penjelasan tentang huruf-huruf muqattha’ah seperti ini telah disebutkan pada awal surat al-Baqarah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Keutamaan: Imam Ahmad, Abu Dawud, Ibnu Majah, Ibnu Hibban, dan Imam Hakim dari Muaqqal bin Yasar (itu adalah hadits Hasan) dari Nabi SAW bersabda: “Bacakanlah surah Yasin untuk orang-orang mati kalian, karena di dalamnya ada petunjuk tentang hari kebangkitan, kekuasaan dan keesaan Tuhan dengan menghidupkan bumi yang mati dan penyebutan ayat-ayat kauniyyah. 1. {Yaasiin} : Yaa’ dan Siin. Perumpamaan lainnya berupa huruf-huruf hijaiyyah yang terpisah-pisah di awal-awal surah itu berfungsi untuk memberi perhatian sesuatu setelahnya dan menunjukkan betapa kokohnya Al-Qur’an dan menentang bangsa Arab, karena Al-Qur’an itu tersusun dari huruf-huruf yang membentuk suatu kalam dan mereka ahli dalam menyusunnya. Kelemahan mereka (dalam hal itu) adalah sejelas-jelas hujjah bagi mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Yā Sīn"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 1: Telah berlalu penjelasan dari huruf muqatha'ah di awal surat Al Baqarah. Dan berkata sebagian ahli tafsir: Yasin adalah nama surat, dan berkata Ibnu Abbas: Sesungguhnya maknanya adalah wahai manusia, dengan sebagian lahjah Arobiyah, dan berkata Ibnu Hanifiyyah: Ia adalah nama Nabi Muhammad dengan dalil firman Allah \"Sesungguhnya engkau sebagian dan utusan\"."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 1",
    "description": "Allah memulai surah ini dengan huruf y' s'n. 2. Lalu Allah berfirman, 'aku bersumpah demi Al-Qur'an yang penuh hikmah, yakni pasti benarnya dan tidak ada sedikit pun yang tidak benar di dalamnya."
  }
]