[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Peringantanmu hanya bermanfaat bagi orang-orang yang beriman kepada al-Qur’an dan mengikuti hokum-hukum Allah yang ada didalamnya, takut kepada Allah yang Maha Pengasih, di mana tidak ada yang melihatNya kecuali Allah. Maka sampaikanlah berita gembira kepadanya dengan ampunan Allah terhadap dosa-dosanya dan pahala dari Allah di akhirat atas amal shalihnya, yaitu masuk surga."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Sesungguhnya orang yang benar-benar mengambil manfaat dari peringatanmu adalah orang yang membenarkan Al-Qur`ān ini dan mengikuti isi kandungannya, takut kepada Tuhannya dalam kesendiriannya, di saat tidak ada yang melihatnya kecuali Allah. Maka kabarkanlah kepada orang yang sifat-sifatnya demikian sesuatu yang membahagiakannya, yaitu bahwa Allah menghapus dosa-dosanya dan mengampuninya, dan pahala besar menantikannya di Akhirat, yaitu masuk Surga."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Sesungguhnya yang mengambil manfaat dari peringatanmu adalah orang yang mengikuti Al-Qur’an dan takut dengan hukuman Allah. Maka kabarkanlah berita gembira kepadanya tentang ampunan Allah untuk dosa-dosanya dan pahala yang baik yaitu dia dimasukkan dalam surga"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya kamu hanya memberi peringatan} Sesungguhnya kamu hanya bertugas memberi peringatan {kepada orang-orang yang mau mengikutinya} mengikuti Al-Qur’an {dan yang takut kepada Dzat Yang Maha Pengasih tanpa melihatNya} dengan tanpa diketahui {Berilah mereka kabar gembira dengan ampunan dan pahala yang mulia"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11. Sedangkan golongan yang kedua adalah orang-orang yang menerima peringatan. Allah telah menyebutkan mereka dengan FirmanNya, “Sesungguhnya kamu hanya memberi peringatan,” maksudnya, sesungguhnya peringatanmu hanya akan berguna dan nasihatmu akan diterima oleh “orang-orang yang mau mengikuti peringatan.” Artinya, orang-orang yang niatnya adalah mengikuti yang haq dan apa yang diingatkan kepadanya, “dan takut kepada Yang Maha Pemurah walaupun dia tidak melihatNya,” artinya, yaitu orang mempunyai dua karakter ini, yaitu niat yang baik dalam mencari kebenaran dan takut kepada Allah. Merekalah orang-orang yang bisa mengambil manfaat dari kerasulanmu dan menjadi suci dengan pengajaranmu. Dan orang yang dikaruniai dua perkara (karakter) ini adalah orang yang telah diberi kabar gembira “dengan ampunan” bagi dosa-dosanya “dan pahala yang mulia” bagi amal-amal shalih dan niat baiknya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 11: Allah menjelaskan bahwasanya peringatan nabi akan bermanfaat bagi mereka yang mengimani Al Quran dan apa yang di dalamnya dari hukum-hukum dan petunjuk-petunjuk serta yang takut kepada Allah dalam urusan yang gaib; maka kabarkan kepada mereka wahai nabi Allah atas ampunan bagi dosa-dosa mereka, dan balasan di akhirat atas amalan-amalan yang sholeh. Dan sebesar-besar balasan adalah dimasukannya mereka ke dalam surga."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni peringatan dan nasihatmu hanyalah bermanfaat bagi orang yang mengikuti peringatan, yaitu mereka yang niatnya adalah mengikuti kebenaran. Maksudnya peringatan yang diberikan oleh Nabi Muhammad shallallahu 'alaihi wa sallam hanyalah berguna bagi orang yang mau mengikutinya. Yakni barang siapa yang memiliki kedua sifat ini, yaitu niat yang baik dalam mencari yang hak (benar) dan rasa takut kepada Allah. Orang yang seperti inilah yang dapat mengambil manfaat dari risalah Beliau dan dapat membersihkan dirinya dengan pengajaran Beliau. Oleh karena itu, berikan kabar gembira kepadanya dengan ampunan dan pahala yang mulia terhadap amal mereka yang saleh dan niatnya yang baik."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 11",
    "description": "Untuk meneguhkan hati nabi Muhammad atas penolakan kaum kafir mekah, sesungguhnya engkau hanya memberi peringatan kepada orang-orang yang mau mengikuti peringatan, yakni peringatanmu hanya berguna bagi mereka yang mau mengikuti, yang percaya akan surga, dan yang takut berbuat durhaka kepada tuhan yang maha pengasih karena mereka yakin tuhan selalu mengawasi, walaupun mereka tidak melihat-Nya. Maka, berilah mereka kabar gembira dengan ampunan yang menghapus dosa-dosa mereka dan pahala yang mulia, yaitu surga. 12. Sungguh, kamilah yang menghidupkan kembali orang-orang yang mati, dan kamilah yang mencatat apa yang telah mereka kerjakan selama hidup di dunia, baik atau buruk, kecil atau besar, untuk kami balas secara adil; dan dicatat pula bekas-bekas yang mereka tinggalkan, yakni perbuat-an baik maupun buruk yang mereka kerjakan dan diikuti oleh orang lain atau generasi sesudah mereka. Dan segala sesuatu kami kumpulkan dalam kitab yang jelas, yakni lau' ma'f''."
  }
]