[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya Kami menghidupkan orang-orang mati seluruhnya dengan membangkitkan mereka di Hari Kiamat. Kami mencatat kebaikan dan keburukan yang mereka lakukan dan peninggalan-peninggalan mereka di mana mereka merupakan sebabnya dalam kehidupan mereka dan sesudah kematian mereka dalam bentuk kebaikan, seperti anak yang shalih, ilmu yang bermanfaat dan sedekah jariyah, dan juga menulis keburukan mereka berupa kesyirikan dan kemaksiatan. Segala sesuatu telah Kami catat dalam sebuah kitab yang jelas, yaitu Ummul Kitab yang merupakan induk segala kitab, yaitu Lauhul Mahfuzh. Hendaknya orang yang berakal menghisab (mengevaluasi) dirinya, agar menjadi teladan dalam kebaikan dalam hidup dan sesudah matinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Sesungguhnya Kami yang menghidupkan orang-orang yang mati dan membangkitkan mereka pada hari Kiamat untuk menghadapi hisab. Kami mencatat amal saleh dan amal buruk yang mereka lakukan semasa hidup di dunia. Kami menulis usaha mereka yang ada efeknya setelah kematian mereka berupa saleh seperti sedekah jariah, atau amalan buruk seperti kekufuran. Kami mencatat segala sesuatu dalam satu kitab yang jelas, yaitu Lauḥul Maḥfūẓ."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "12. -Dengan keagungan dan kekuasaan Kami- Kami menghidupkan orang-orang yang telah mati dan membangkitkan mereka dari kubur, mencatat segala kebaikan dan keburukan yang telah mereka lakukan, tindak tanduk mereka, dan hasil perbuatan yang tetap ada setelah kematian mereka, serta segalanya Kami catat dan Kami hitung dalam kitab yang jelas."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "12. إِنَّا نَحْنُ نُحْىِ الْمَوْتَىٰ (Sesungguhnya Kami menghidupkan orang-orang mati) Yakni Kami membangkitkan setelah kematian mereka. Pendapat lain mengatakan, yakni Kami menghidupkan mereka dengan keimanan setelah kekafiran mereka, dan dengan ilmu setelah kebodohan mereka. وَنَكْتُبُ مَا قَدَّمُوا۟( dan Kami menuliskan apa yang telah mereka kerjakan) Yakni amal baik dan buruk yang telah mereka lakukan. وَءَاثٰرَهُمْ ۚ( dan bekas-bekas yang mereka tinggalkan) Yakni kebaikan yang tidak terputus manfaatnya setelah kematian mereka, seperti orang yang mencontohkan perbuatan yang baik. Atau keburukan yang tetap mengalir setelah kematian mereka, seperti orang yang mencontohkan perbuatan buruk. Yang termasuk dari kebaikan yang tetap mengalir pahalanya adalah mengajarkan ilmu dan membukukannya, mewakafkan sumur, dan membangun masjid dan bangunan. Adapun keburukan yang tetap akan mengalir dosanya adalah memulai kezaliman dan membuat sesuatu yang membahayakan manusia kemudian diikuti oleh orang jahat lain. وَكُلَّ شَىْءٍ أَحْصَيْنٰهُ(Dan segala sesuatu Kami kumpulkan) Yakni segala sesuatu baik itu berupa amalan-amalan para hamba maupun lainnya Kami catat. فِىٓ إِمَامٍ مُّبِينٍ(dalam Kitab Induk yang nyata) Yakni kitab yang menjelaskan segala sesuatu. Terdapat pendapat mengatakan yang dimaksud adalah kitab Lauh mahfuzh; dan pendapat lain mengatakan yang dimaksud adalah kitab catatan amal."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12. Sesungguhnya Kami membangkitkan orang-orang mati dari kuburan mereka dalam keadaan hidup. Kami juga mencatat di lauhil mahfudz apa yang telah lalu mereka perbuat di dunia berupa kebaikan ataupun keburukan dan apa yang mereka tinggalkan setelah mati berupa pengaruh amal yang mengandung manfaat dan mahdharat. Dan setiap sesuati itu Kami jaga di lauhil mahfudz. Ayat ini diturunkan untuk Bani Salmah yang tinggal di sisi Madinah dan ingin pindah di dekat masjid"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya Kamilah yang menghidupkan orang-orang yang mati dan Kami pula yang mencatat apa yang telah mereka kerjakan} apa yang mereka kerjakan berupa kebaikan atau keburukan di kehidupan mereka {dan bekas-bekas mereka} dan apa yang tersisa berupa kebiasaan baik atau buruk yang dia kerjakan {Segala sesuatu Kami yang kumpulkan dalam kitab yang nyata} kitab yang jelas, yaitu Lauhil Mahfudz"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "12, “SEsungguhnya Kami menghidupkan orang-orang mati,” yakni, Kami membangkitkan mereka setelah mereka mati untuk memberikan balasan kepada mereka atas perbuatan-perbuatannya, “dan kami menuliskan apa yang telah mereka kerjakan” yang baik dan yang buruk, yaitu amal-amal perbuatan yang telah mereka kerjakan dan mereka laksanakan pada saat mereka masih hidup, “dan bekas-bekas yang mereka tinggalkan,” yaitu, bekas-bekas kebaikan dan bekas-bekas keburukan yang mana mereka menjadi sebab diadakannya saat mereka masih hidup dan sesudah mereka mati. Amal perbuatan tersebut timbul dari perkataan, perbuatan, dan perihal keadaan mereka. Maka setiap kebaikan yang dilakukan oleh salah seorang manusia disebabkan oleh ilmu seorang hamba dan pengajarannya , atau nasihatnya, atau amar ma’rufnya, atau nahi mungkarnya, atau ilmu yang ia simpan pada para pelajar atau pada kitab-kitab yang digunakan pada saat masih hidup dan sesudah mati, atau melakukan kebaikan seperti shalat, zakat, sedekah atau suatu kebaikan yang diikuti oleh orang lain, atau membangun sebuah masjid atau salam satu tempat yang dimanfaatkan oleh masyarakat umum dan yang serupa dengannya, maka sesungguhnya semua itu termasuk bekas-bekas peninggalannya yang akan dicatat untuknya. Dan demikian pula perbuatan buruk. Oleh karena ini, \"barang siapa yang mencontohkan kebiasaan yang baik, maka baginya pahalanya dan pahala orang yang mengamalkannya sampai hari kiamat, dan barangsiapa yang memberi contoh yang buruk, maka bainya dosanya dan dosa orang yang mengerjakannya sampai hari kiamat\" (HR. Muslim nomor 1017) Bagian ini menjelaskan kepada anda betapa tingginya kedudukan berdakwah kepada Allah dan menunjukkan manusia kepada jalan Allah dengan segala sarana dan cara yang dapat mengantarkan ke sana, dan (sebaliknya) betapa rendahnya derajat orang yang menyeru ke sana, dan (sebaliknya) betapa rendahnya derajat orang yang menyeru kepada keburukan dan menjadi pelopor dalam keburukan; dan sesungguhnya dia merupakan manusia yang paling hina, paling durjana, dan paling besar dosanya. “Dan segala sesuatu,” dari amal-amal perbuatan, niat, dan lain-lainnya “Kami kumpulkan dalam KItab yang nyata,” maksudnya, kitab yang merupakan kitab induk, dan ia merupakan rujukan semua kitab-kitab yang ada di tangan para malaikat. Ia adalah al-Lauhil Mahfuzh."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 12: Allah mengagungkan dirinya sendiri dengan dhomir bentuk jamak dengan penekanan bahwasanya Dia sajalah yang maha kuasa untuk menghidupkan yang mati hari kiamat dan menghitung amalan-amalan mereka serta bekas-bekas kesalehan mereka dan keburukan mereka; dan tidak ada yang hanya mampu melakukan demikian kecuali hanya Allah Subhanahu Wa Ta'ala. Kemudian Allah menjelaskan bahwasanya segala sesuatu akan dihitung atas amalan yang kecil maupun yang besar yang tertulis di dalam kitab, dan kitab ini adalah lembaran-lembaran bagi seorang manusia. Semuanya tercantum di dalam Lauhul Mahfudz."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni Kami bangkitkan mereka setelah matinya untuk diberikan balasan terjadap amal mereka. Abu Bakar Al Bazzar berkata: Telah menceritakan kepada kami ‘Abbad bin Ziyad As Saajiy. (Ia berkata): Telah menceritakan kepada kami ‘Utsman bin Umar. (Ia berkata): Telah menceritakan kepada kami Syu’bah dari Al Jaririy dari Abu Nadhrah dari Abu Sa’id radhiyallahu 'anhu ia berkata, “Sesungguhnya Bani Salamah mengeluhkan kepada Rasulullah shallallahu 'alaihi wa sallam jauhnya tempat tinggal mereka dari masjid, maka turunlah ayat, “dan Kamilah yang mencatat apa yang telah mereka kerjakan dan bekas-bekas yang mereka tinggalkan.” Maka akhirnya mereka tetap tinggal di tempat tersebut. Ia (Al Bazzar) juga berkata: Telah menceritakan kepada kami Muhammad bin Al Mutsanna. (Ia berkata): Telah menceritakan kepada kami ‘Abdul A’la. (Ia berkata): Telah menceritakan kepada kami Al Jaririy Sa’id bin Ayas dari Abu Nadhrah dari Abu Sa’id radhiyallahu 'anhu dari Nabi shallallahu 'alaihi wa sallam yang sama seperti itu. Menurut Ibnu Katsir, bahwa di sana terdapat keghariban (keasingan) karena disebutkan turunnya ayat ini, sedangkan surat tersebut semuanya adalah Makkiyyah. Hadits ini para perawinya adalah para perawi hadits shahih kecuali ‘Abbad bin Ziyad, tentang dia terdapat pembicaraan sebagaimana dalam Tahdzibut Tahdzib, akan tetapi hadits ini telah dimutaba’ahkan sebagaimana yang kita lihat. Tirmidzi juga meriwayatkannya di juz 4 hal. 171 dan ia menghasankannya. Hakim di juz 2 hal. 428 juga meriwayatkan dan ia menshahihkannya namun didiamkan oleh Adz Dzahabi dari hadits Abu Sa’id Al Khudriy, akan tetapi di hadits itu dalam riwayat keduanya ada Tharif bin Syihab, sedankan dia adalah dha’if sekali sebagaimana dalam Al Mizan, namun orang tersebut dalam riwayat Hakim adalah Sa’id bin Tharif, mungkin saja sebagian rawi keliru dalam hal ini. Akan tetapi, hadits ini memiliki syahid dalam riwayat Ibnu Jarir rahimahullah dari Ibnu Abbas radhiyallahu 'anhu, ia berkata, “Rumah orang-orang Anshar berjauhan dari masjid, lalu mereka ingin pindah ke dekat masjid, maka turunlah ayat, “Dan Kamilah yang mencatat apa yang telah mereka kerjakan dan bekas-bekas yang mereka tinggalkan.” Hadits ini melalui jalan Simak dari Ikrimah, sedangkan riwayat Simak dari Ikrimah adalah mudhtharib, akan tetapi ia termasuk ke dalam syahid. Syaikh Muqbil berkata, “Adapun ucapan Ibnu Katsir rahimahullah, bahwa di sana terdapat keghariban karena surat terseut semua (ayat)nya adalah Makkiyyah, maka belum jelas arahnya bagiku. Kalau memang ayat ini turun di Mekah, maka tidaklah menghalangi turunnya dua kali, namun jika tidak pasti turunnya di Mekah, maka bisa saja surat ini Makkiyyah selain ayat itu sebagaimana yang sudah biasa, wallahu a’lam.” (Lihat Ash Shahihul Musnad Min Asbaabin Nuzul hal. 193-194 oleh Syaikh Muqbil). Dalam Lauh Mahfuzh. Dalam hidup mereka; perbuatan baik atau buruk untuk diberikan balasan. Baik atau buruk bekas yang mereka tinggalkan, di mana mereka menjadi sebab ada tidaknya perbuatan itu baik di masa hidup mereka maupun setelah mati mereka, demikian pula amalan yang dilakukan karena ucapan, perbuatan dan keadaan mereka. Oleh karena itu, setiap kebaikan yang dikerjakan oleh seseorang disebabkan pengetahuannya, pengajarannya, dan nasihatnya, atau amar ma’ruf dan nahi mungkarnya atau ilmu yang dia tanamkan ke dalam diri siswa atau ia tulis dalam beberapa kitab yang kemudian dimanfaatkan baik pada masa hidupnya maupun setelah matinya, atau mengerjakan kebaikan, seperti shalat, zakat, sedekah dan berbuat ihsan, lalu diikuti oleh orang lain. Atau ia membangun masjid atau membuat suatu tempat yang kemudian dimanfaatkan oleh manusia, dsb. Maka hal itu termasuk bekas peninggalan yang dicatat pula, sebagaimana peninggalan buruk juga dicatat. Oleh karena itu, Rasulullah shallallahu 'alaihi wa sallam bersabda: مَنْ سَنَّ فِى الإِسْلاَمِ سُنَّةً حَسَنَةً فَلَهُ أَجْرُهَا وَأَجْرُ مَنْ عَمِلَ بِهَا بَعْدَهُ مِنْ غَيْرِ أَنْ يَنْقُصَ مِنْ أُجُورِهِمْ شَىْءٌ وَمَنْ سَنَّ فِى الإِسْلاَمِ سُنَّةً سَيِّئَةً كَانَ عَلَيْهِ وِزْرُهَا وَوِزْرُ مَنْ عَمِلَ بِهَا مِنْ بَعْدِهِ مِنْ غَيْرِ أَنْ يَنْقُصَ مِنْ أَوْزَارِهِمْ شَىْءٌ “Barang siapa mencontohkan dalam Islam contoh yang baik, maka ia akan mendapatkan pahalanya dan pahala orang yang mengamalkan setelahnya. Barang siapa yang mencontohkan sunnah yang buruk, maka ia akan menanggung dosanya dan dosa orang yang mengamalkan setelahnya tanpa dikurangi sedikit pun dari dosa-dosa mereka.” (HR. Muslim) Hal ini menunjukkan pula betapa tingginya kedudukan dakwah kepada Alah; membimbing manusia ke jalan-Nya dengan berbagai sarana dan jalan yang dapat mencapai kepadanya, dan menunjukkan rendahnya kediudukan orang yang mengajak kepada keburukan atau menjadi imam dalam hal ini, dan bahwa ia adalah makhluk paling hina, paling besar kejahatan dan dosanya. Baik amal, niat dan selainnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 12",
    "description": "Sungguh, kamilah yang menghidupkan kembali orang-orang yang mati, dan kamilah yang mencatat apa yang telah mereka kerjakan selama hidup di dunia, baik atau buruk, kecil atau besar, untuk kami balas secara adil; dan dicatat pula bekas-bekas yang mereka tinggalkan, yakni perbuat-an baik maupun buruk yang mereka kerjakan dan diikuti oleh orang lain atau generasi sesudah mereka. Dan segala sesuatu kami kumpulkan dalam kitab yang jelas, yakni lau' ma'f''. 13. Keingkaran kaum kafir mekah terhadap kerasulan nabi Muhammad hampir sama dengan keingkaran umat rasul-rasul terdahulu. Karena itu, Allah memerintahkan nabi Muhammad mengubah strategi dakwahnya. 'dan untuk memotivasi mereka supaya beriman, buat dan sampaikan-lah suatu perumpamaan bagi mereka, yaitu keadaan penduduk suatu negeri ketika utusan-utusan kami datang kepada mereka. Menurut suatu riwayat, negeri itu adalah antiokhia, sebuah kota di suriah saat ini."
  }
]