[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "13-14. Dan buatlah (wahai Rasul) sebuah perumpamaan bagi orang-orang musyrik dari kaummu yang menolak dakwahmu, agar mereka bisa mengambil pelajaran darinya, yaitu kisah penduduk sebuah desa, tatkala para utusan datang kepada mereka, yaitu tatkala Kami mengutus dua orang Rasul kepada mereka untuk berdakwah kepada mereka untuk beriman kepada Allah dan meninggalkan ibadah kepada selainNya, maka penduduk desa itu mendustakan kedua utusan tersebut, maka Kami menguatkan keduanya dengan utusan ketiga, maka ketiga utusan tersebut berkata kepada penduduk kampong tersebut, “Wahai kaum, sesungguhnya kami ini diutus kepada kalian.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "13. Buatlah -wahai Rasul- bagi orang-orang kafir yang menentang dan mendustakan itu satu contoh yang mengandung pelajaran bagi mereka, yaitu kisah penduduk suatu negeri manakala rasul-rasul mereka datang kepada mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "13-14. Dan sebutkanlah kepada kaum Quraisy permisalan tentang para penduduk suatu negeri dan pendustaan mereka ketika Allah mengutus para rasul kepada mereka. Bagaimana akibat dari kekafiran dan penentangan mereka ketika itu? Dan sampaikanla kepada mereka ketika Kami mengutus dua orang rasul kepada mereka, namun mereka juga mendustakan mereka berdua; maka Kami menolong dan memperkuat mereka berdua dengan mengutus satu orang rasul lagi, kemudian mereka menyeru kaum tersebut dan menegaskan bahwa mereka merupakan para utusan dari Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "13. وَاضْرِبْ لَهُم مَّثَلًا أَصْحٰبَ الْقَرْيَةِ (Dan buatlah bagi mereka suatu perumpamaan, yaitu penduduk suatu negeri) Yakni katakanlah kepada mereka “aku bukanlah rasul yang pertama, sebab sebelumku telah datang para rasul kepada penduduk suatu negeri dan memberi mereka peringatan sebagaimana aku memberi kalian peringatan, serta menyampaikan tauhid, menakut-nakuti mereka dengan hari kiamat, dan memberi mereka kabar gembira dengan kenikmatan surga. Imam Qurthubi berkata: yang dimaksud dengan negeri tersebut adalah negeri Antakya, menurut para ahli tafsir. إِذْ جَآءَهَا الْمُرْسَلُونَ(ketika utusan-utusan datang kepada mereka) Mereka adalah para sahabat Nabi Isa yang diutus Allah kepada penduduk Antakya untuk berdakwah di jalan Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13. Wahai Rasulallah, buatlah contoh bagi orang-orang musyrik penduduk negeri itu. Menurut pendapat jumhur ulama’, itu adalah negeri Antakya, ketika sahabat-sahabat Isa mendatangi mereka untuk mengajak menyembah Allah dan mengesakanNya. Ibnu Katsir tidak berpendapat bahwa itu adalah Antakya, karena mereka semua beriman kepada Isa."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Buatlah suatu perumpamaan bagi mereka tentang yaitu penduduk suatu negeri} penduduk Antakya {ketika datang kepada mereka para utusan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "13. Maksudnya, buatlah untuk mereka yang mendustakan kerasulanmu, yang menolak seruanmu sebuah perumpamaan yang dapat mereka jadikan pelajaran dan menjadi nasihat bagi mereka jika mereka diberi taufik untuk kebaikan. Perumpamaan itu adalah penduduk suatu negeri dan apa yang terjadi dari perbuatan mereka, yaitu pendustaan terhadap para utusan Allah, serta apa-apa yang menimpa mereka berupa hukuman dan azab dariNya. Menyebutkan secara pasti negeri yang dimaksud, kalau saja ada gunanya tentu Allah menyebutkannya. Maka mencoba menebaknya atau yang serupa dengannya termasuk tindakan ceroboh dan berbicara tanpa dasar pengetahuan. Maka dari itu, apabila ada seseorang yang membicarakan tentang perkara semisal ini, anda akan menjumpainya simpang siur dan berbeda-beda pendapat yang tidak mempunyai kepastian, yang dengan begitu anda tahu bahwa sesungguhnya jalan ilmu yang shahih adalah berhenti pada data-data yang tepat dan tidak menyentuh hal-hal yang tidak ada gunanya. Dan dengan cara seperti ini jiwa akan menjadi bersih dan ilmunya makin bertambah. Sementara, orang yang jahil mengira bahwa bertambahnya ilmu itu dengan cara menyebutkan pendapat-pendapat yang tidak ada dalilnya, tidak ada argumennya dan tidak pula ada faidahnya selain mengacaukan pikiran dan terbiasa dengan perkara-perkara yang masih diragukan kebenarannya. Ringkasnya, negeri tersebut telah dijadikan oleh Allah sebagai perumpamaan bagi para mukhathabin (lawan bicara) “ketika utusan-utusan datang kepada mereka,” dari Allah; memerintah mereka beribadah kepada Allah semata dan menuluskan kepatuhan hanya kepadaNya, dan mencegah mereka dari syirik dan maksiat-maksiat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 13: Allah memerintahkan nabi Muhammad untuk memberikan contoh kepada mereka orang-orang musyrik yang mendustakan, yaitu kaumnya dengan kisah penduduk suatu negeri yang datang kepada mereka utusan yang diutus, ia adalah Isa untuk berdakwah kepada penduduk negeri ini kepada tauhid dan keimanan serta memperingatkan mereka dari kesyirikan. Negeri ini telah dikenal di kalangan ahli ilmu yaitu negeri Inthakiyyah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni buatlah perumpamaan untuk mereka yang mendustakan risalahmu dan menolak dakwahmu agar mereka mengambil pelajaran dan sebagai nasihat bagi mereka jika mereka diberi taufik kepada kebaikan. Perumpamaan itu adalah penduduk suatu negeri, apa yang mereka lakukan berupa sikap mendustakan para utusan dan apa yang terjadi pada mereka berupa ditimpa azab dan hukuman. Ditentukannya negeri itu jika memang ada faedahnya, tentu Allah akan sebutkan, oleh kaena itu menentukan nama negerinya termasuk memberatkan diri dan berbicara tanpa ilmu. Sehingga, apabila seseorang memberanikan diri berbicara tentang masalah seperti ini, tentu kita akan dapati di sisinya kekacauan, prercampuran dan perselisihan yang tidak ada tenangnya, di mana dari sini dapat diketahui, bahwa jalan yang ditempuh dalam ilmu yang benar adalah diam di hadapan hakikat dan tidak mendatangi sesuatu yang tidak ada faedahnya. Dengan begitu, maka jiwa menjadi bersih, ilmu bertambah dari arah yang orang jahil (bodoh) mengira bahwa bertambahnya ilmu dengan menyebutkan pendapat-pendapat yang tidak ada dalilnya, tidak ada hujjahnya dan tidak ada faedah daripadanya selain membingungkan pikiran dan terbiasa dengan perkara yang masih diragukan. Menurut sebagian ahli tafsir, yaitu negeri Anthakiyah. Ada yang berpendapat, bahwa mereka adalah utusan-utusan Nabi Isa ‘alaihis salam dari kalangan hawariyyin (sahabat setia Nabi Isa ‘alaihis salam), ada pula yang berpendapat, bahwa mereka adalah para utusan Allah (para rasul). Utusan-utusan tersebut mengajak penduduk tersebut beribadah kepada Allah Subhaanahu wa Ta'aala, mengikhlaskan ibadah kepada-Nya, dan melarang mereka dari perbuatan syirk dan maksiat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 13",
    "description": "Keingkaran kaum kafir mekah terhadap kerasulan nabi Muhammad hampir sama dengan keingkaran umat rasul-rasul terdahulu. Karena itu, Allah memerintahkan nabi Muhammad mengubah strategi dakwahnya. 'dan untuk memotivasi mereka supaya beriman, buat dan sampaikan-lah suatu perumpamaan bagi mereka, yaitu keadaan penduduk suatu negeri ketika utusan-utusan kami datang kepada mereka. Menurut suatu riwayat, negeri itu adalah antiokhia, sebuah kota di suriah saat ini. 14. Ceritakanlah ketika kami mengutus kepada mereka dua orang utusan untuk menyeru mereka agar bertauhid dan beriman kepada risalah kenabian serta hari kebangkitan, lalu mereka mendustakan keduanya; kemudian kami kuatkan mereka berdua dengan utusan yang ketiga, maka ketiga utusan itu berkata, 'sungguh, kami adalah orang-orang yang diutus kepada kamu. '."
  }
]