[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "13-14. Dan buatlah (wahai Rasul) sebuah perumpamaan bagi orang-orang musyrik dari kaummu yang menolak dakwahmu, agar mereka bisa mengambil pelajaran darinya, yaitu kisah penduduk sebuah desa, tatkala para utusan datang kepada mereka, yaitu tatkala Kami mengutus dua orang Rasul kepada mereka untuk berdakwah kepada mereka untuk beriman kepada Allah dan meninggalkan ibadah kepada selainNya, maka penduduk desa itu mendustakan kedua utusan tersebut, maka Kami menguatkan keduanya dengan utusan ketiga, maka ketiga utusan tersebut berkata kepada penduduk kampong tersebut, “Wahai kaum, sesungguhnya kami ini diutus kepada kalian.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Manakala Kami mengutus pertama kali kepada mereka dua orang rasul untuk mengajak mereka kepada Tauhid dan penyembahan kepada Allah, lalu mereka mendustakan keduanya, lalu Kami mendukung dua rasul itu dengan rasul yang ketiga. Maka ketiga rasul itu berkata kepada penduduk negeri, \"Sesungguhnya kami bertiga ini adalah utusan Allah kepada kalian untuk mengajak kalian agar mentauhidkan Allah dan mengikuti syariat-Nya.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "14. إِذْ أَرْسَلْنَآ إِلَيْهِمُ اثْنَيْنِ ((yaitu) ketika Kami mengutus kepada mereka dua orang utusan) Sebab Isa mengutus mereka berdua atas perintah Allah. فَكَذَّبُوهُمَا(lalu mereka mendustakan keduanya) Yakni mendustakan risalah yang mereka bawa. Dikatakan bahwa mereka memukuli dan memenjarakan keduanya. فَعَزَّزْنَا بِثَالِثٍ(kemudian Kami kuatkan dengan (utusan) yang ketiga) Yakni Kami kuatkan dan kokohkan keduanya dengan urusan ketiga."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14. Ketika Kami mengutus untuk mereka dua orang. Isa mengutus mereka berdua atas perintah Allah, namun mereka mendustakan risalah keduanya. Kemudian Kami menguatkan keduanya dengan utusan ketiga dan mereka berkata kepada penduduk negeri itu: “Sesungguhnya kami diutus oleh Tuhan untuk kalian untuk mengajak kalian mengesakan Allah dan menaatiNya”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "(yaitu) ketika Kami mengutus kepada mereka dua orang utusan, lalu mereka mendustakan keduanya. Kemudian Kami menguatkan dengan yang ketiga} lalu Kami menguatkan keduanya dengan rasul ketiga {Lalu ketiga berkata,“Sesungguhnya kami adalah orang-orang yang diutus kepada kalian”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "14. “Yaitu ketika Kami mengutus kepada mereka dua orang utusan, lalu mereka mendustakan keduanya; kemudian Kami kuatkan dengan ketiga.” Maksudnya, Kami perkuat keduanya dengan orang ketiga, sehingga mereka menjadi tiga orang utusan, sebagai bentuk perhatian Allah kepada mereka dan sebagai penegakkan hujjah dengan berdatangannya para rasul (utusan) itu kepada mereka secara bergantian, “maka mereka berkata,” kepada mereka (orang-orang musyrik itu) “Sesungguhnya kami adalah orang-orang yang diutus kepadamu.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 14: Allah menjelaskan bahwasanya Dia memerintahkan Isa sebagai utusan yang diutus kepada negeri ini, yaitu berdakwah kepada keimanan diketahui ketauhidan. Akan tetapi mereka mendustakan utusan-utusan Allah dan bertambah kesesatan mereka yang diiringi dengan penolakan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ini menunjukkan perhatian besar dari Allah kepada mereka dan penegakkan hujjah dengan berturt-turutnya para utusan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 14",
    "description": "Ceritakanlah ketika kami mengutus kepada mereka dua orang utusan untuk menyeru mereka agar bertauhid dan beriman kepada risalah kenabian serta hari kebangkitan, lalu mereka mendustakan keduanya; kemudian kami kuatkan mereka berdua dengan utusan yang ketiga, maka ketiga utusan itu berkata, 'sungguh, kami adalah orang-orang yang diutus kepada kamu. '15. Penduduk negeri itu mengabaikan dakwah ketiga utusan tersebut. Mereka menjawab, 'kamu bertiga ini hanyalah manusia seperti kami; tidak ada kelebihan apa pun pada diri kamu atas kami, dan Allah yang maha pengasih sama sekali tidak menurunkan sesuatu apa pun berupa perintah maupun larangan; kamu hanyalah pendusta belaka dalam pengakuan kamu sebagai utusan tuhan. '."
  }
]