[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Penduduk desa berkata kepada para rasul, “Kalian hanyalah orang-orang seperti kami dan Allah yang Maha Pengasih tidak menurunkan wahyu apa pun, dan tidaklah kalian sendiri (wahai para utusan) kecuali hanyalah orang-orang yang berdusta.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Penduduk negeri menjawab para rasul, “Kalian ini hanyalah manusia seperti kami, tidak ada keunggulan bagi kalian atas kami, Allah yang Maha Penyayang tidak menurunkan wahyu apa pun kepada kalian, kalian ini hanya berdusta atas nama Allah terkait apa yang kalian katakan.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "15. Akan tetapi orang-orang kafir itu mengingkari jika Allah mengutus manusia kepada mereka. Demikianlah mereka menganggap rendah derajat manusia dan mengingkari ilmu dan pengetahuan yang datang dari manusia. Lalu mereka menegaskan pengingkaran mereka terhadap seluruh risalah dari Allah dan menuduh bahwa para rasul itu telah berdusta."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15. قَالُوا۟ مَآ أَنتُمْ إِلَّا بَشَرٌ مِّثْلُنَا (Mereka menjawab: “Kamu tidak lain hanyalah manusia seperti kami) Yakni seperti kami sebagai manusia, sehingga kalian tidak memiliki kelebihan dan keistimewaan daripada kami. وَمَآ أَنزَلَ الرَّحْمٰنُ مِن شَىْءٍ(dan Allah Yang Maha Pemurah tidak menurunkan sesuatupun) Yakni tidak menurunkan wahyu yang kalian akui itu. إِنْ أَنتُمْ إِلَّا تَكْذِبُونَ(kamu tidak lain hanyalah pendusta belaka) Yakni kalian berdusta dalam pengakuan kalian itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "15. Penduduk negeri itu berkata: “Kalian tidak lain kecuali manusia seperti kami. Kalian tidak lebih istimewa atas kami, sehingga bisa menjadi penyeru yang diutus. Dan Tuhan yang Maha Pengasih tidak menurunkan apapun berupa perintah atau larang kepada para utusan. Kalian itu tidak lain kecuali berdusta atas pengakuan risalah itu”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka menjawab,“Kalian tidak lain hanyalah manusia seperti kami. Dzat Yang Maha Pengasih tidak menurunkan sesuatu apa pun} wahyu {Kalian tidak lain melainkan hanya berdusta”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "15. Lalu mereka menjawab para rasul itu dengan jawaban yang masih tetap popular di kalangan orang-orang yang menolak dakwah para rasul, seraya berkata, “Kamu tidak lain hanyalah manusia seperti kami,” artinya, apa yang membuat kalian merasa lebih utama dan unggul daripada kami? Para rasul berkata kepada umat mereka, Kami tiada lain manusia biasa seperti kalian, akan tetapi Allah memberikan karunia kepada siapa saja yang Dia kehendaki di antara hamba-hambaNya. “Dan Allah yang Maha Pemurah tidak menurunkan sesuatu pun,” artinya, mereka mengingkari keseluruhan kerasulan; lalu mereka juga mengingkari orang-orang yang berbicara kepada mereka (tentang kerasulan tersebut), seraya mengatakan, “Kamu tidak lain hanyalah pendusta belaka.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 15: Berkata penduduk negeri itu kepada utusan utusan Allah dengan kesombongan: Tidaklah kalian kecuali hanyalah manusia biasa sebagaimana kami, kalian bukanlah lebih baik dari kami; kalian dan kami sama saja manusia biasa, dan tidak ada sesuatu apapun yang diturunkan Allah dari wahyu. Kalian adalah pendusta yang menisbatkan diri kepada Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan jawaban yang sudah masyhur dijawab oleh orang-orang yang menolak dakwah para rasul. Yakni apa kelebihanmu di atas kami? Maka para rasul menjawab, “Kami memang manusia seperti kamu, akan tetapi Allah memberikan karunia kepada siapa yang Dia kehendaki di antara hamba-hamba-Nya.” (lihat surah Ibrahim: 11). Mereka mengingkari semua risalah, dan mendustakan para utusan yang menyeru mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 15",
    "description": "Penduduk negeri itu mengabaikan dakwah ketiga utusan tersebut. Mereka menjawab, 'kamu bertiga ini hanyalah manusia seperti kami; tidak ada kelebihan apa pun pada diri kamu atas kami, dan Allah yang maha pengasih sama sekali tidak menurunkan sesuatu apa pun berupa perintah maupun larangan; kamu hanyalah pendusta belaka dalam pengakuan kamu sebagai utusan tuhan. '16-17. Mendapat bantahan dari penduduk negeri tersebut, mereka berkata, 'tuhan kami mengetahui sesungguhnya kami adalah utusan-utusan-Nya kepada kamu. Dan kewajiban kami hanyalah menyampaikan perintah-Nya dengan jelas tanpa sedikit pun keraguan. '."
  }
]