[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "16-17. Para rasul itu berkata untuk menegaskan, “Tuhan kami Yang mengutus kami mengetahui bahwa sesungguhnya kami adalah utusan-utusan kepada kalian, dan tugas kami hanyalah menyampaikan risalah dengan jelas, kami tidak memilki kuasa memberikan hidayah untuk kalian, karena hidayah ada di Tangan Allah semata.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Ketiga Rasul itu menjawab pendustaan penduduk negeri, “Tuhan kami mengetahui sesungguhnya kami adalah utusan dari sisi-Nya kepada kalian wahai penduduk negeri dan hal itu sudah cukup menjadi bukti bagi kami.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "16-17. Para rasul itu menegaskan perkataan mereka dan menjadikan Tuhan mereka sebagai saksi: “Tuhan kami mengetahui bahwa kami merupakan para rasul bagi kalian; Dia yang telah mengutus dan menguatkan kami, dan Dia adalah saksi dan hujjah bagi kami. Bagaimana kalian mengatakan bahwa Allah tidak mengutus seorang rasulpun? Dan tugas kami hanyalah menyampaikan risalah dengan jelas; jika kami adalah manusia maka apakah itu menjadikan kami tidak dapat melakukan hal itu?”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16. Para utusan itu berkata: “Tuhan Kami mengetahui kebenaran kami. Sesungguhnya kami bagi kalian adalah rasul yang diutus untuk menyampaikan dakwah kepada kalian”. Mereka menegaskan jawab dengan qasam (sumpah)"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata,“Tuhan kami mengetahui bahwa sesungguhnya kami benar-benar para utusan untuk kalian"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "16. Rasul yang tiga itu mengatakan, “Rabb kami telah mengetahui bahwa sesungguhnya kami adalah orang yang diutus kepada kamu,” maka jika kami adalah orang-orang pendusta, tentu Allah menampakkan kehinaan kami dan pasti Dia segera menimpakan azabNya terhadap kami."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 16: Para utusan menjawab dengan berkata : Sesungguhnya Tuhan kami adalah yang mengutus kami, dan Dialah yang mengetahui kami sebagai utusan-Nya yang diutus kepada kalian; Kalau seandainya kalian mengingkari, maka Allah akan segera menurunkan azab-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni tiga orang utusan itu. Yakni kalau seandainya kami dusta, tentu Allah Subhaanahu wa Ta'aala akan menghinakan kami dan segera menghukum kami."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 16",
    "description": "16-17. Mendapat bantahan dari penduduk negeri tersebut, mereka berkata, 'tuhan kami mengetahui sesungguhnya kami adalah utusan-utusan-Nya kepada kamu. Dan kewajiban kami hanyalah menyampaikan perintah-Nya dengan jelas tanpa sedikit pun keraguan. '16-17"
  }
]