[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "16-17. Para rasul itu berkata untuk menegaskan, “Tuhan kami Yang mengutus kami mengetahui bahwa sesungguhnya kami adalah utusan-utusan kepada kalian, dan tugas kami hanyalah menyampaikan risalah dengan jelas, kami tidak memilki kuasa memberikan hidayah untuk kalian, karena hidayah ada di Tangan Allah semata.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Tugas kami hanyalah menyampaikan apa yang diperintahkan kepada kami agar kami menyampaikannya kepada kalian dengan jelas, kami tidak memiliki kewenangan memberi kalian hidayah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17. Kewajiban kami tidak lain kecuali menyampaikan risalah Tuhan dengan jelas"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kewajiban kami tidak lain hanya menyampaikan yang jelas”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17. “Dan kewajiban kami tidak lain hanyalah menyampaikan dengan jelas,” yakni menyampaikan dengan jelas yang dengannya perkara-perkara menjadi terjelaskan yang memang dituntut untuk dijelaskan. Adapun selain dari itu berupa ayat-ayat usulan atau minta dipercepatnya azab, maka bukan tugas kami. Tugas kami hanyalah menyampaikan dengan jelas, dan kami telah melaksanakan dan menjelaskannya kepada kalian. Jika kalian menjadikannya sebagai petunjuk, maka itu adalah bagian yang baik dan taufik bagi kalian, namun jika kalian sesat, maka kami sama sekali tidak mempunyai urusan apa pun."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 17: Kemudian berkata mereka yang sebagai utusan Allah : Ketahuilah bahwasanya Allah tidak membebani kami agar kalian mendapatkan petunjuk, akan tetapi Allah membebani kami supaya menyampaikan dengan penyampaian yang jelas."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya, inilah tugas kami, yaitu menerangkan dengan jelas perkara yang dibutuhkan penjelasannya. Adapun selain ini, seperti mendatangkan hal yang luar biasa sebagai bukti (mukjizat), demikian pula disegerakannya azab, maka bukanlah tugas kami. Jika kamu mendapatkan petunjuk, maka itulah keberuntunganmu dan taufik untukmu, namun jika kamu tersesat, maka kami tidak bisa berbuat apa-apa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 17",
    "description": "16-17. Mendapat bantahan dari penduduk negeri tersebut, mereka berkata, 'tuhan kami mengetahui sesungguhnya kami adalah utusan-utusan-Nya kepada kamu. Dan kewajiban kami hanyalah menyampaikan perintah-Nya dengan jelas tanpa sedikit pun keraguan. '18. Ketiga utusan itu tidak berhenti menyampaikan dakwah mereka, hingga mereka, yakni para penduduk negeri itu, menjawab, 'sesungguhnya kami bernasib malang karena kehadiran dan ajaran kamu. Sungguh, jika kamu tidak berhenti menyeru kami untuk beriman kepada Allah dan hari kiamat, niscaya kami rajam dan lempari kamu dengan batu sampai mati, dan kamu pasti akan merasakan siksaan yang pedih dari kami. '."
  }
]