[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Para utusan itu berkata, “Pesimistis kalian dan amal perbuatan kalian berupa syirik dan keburukan adalah karena kalian sendiri dan itu tertolak atas kalian. Apakah bila kalian diingatkan dengan sesuatu yang mengandung kebaikan bagi kalian, kalian merasa pesimis dan kalian mengancam kami dengan rajam dan siksaan? Sebaliknya kalian adalah suatu kaum yang sudah terbiasa melampaui batas dan berbuat maksiat dan mendustakan.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Para Rasul menjawab mereka, “Kesialan selalu menempel pada diri kalian karena kalian kafir kepada Allah dan menolak mengikuti para Rasul-Nya. Apakah kalian merasa sial manakala kami mengingatkan kalian kepada Allah? Justru kalian adalah kaum yang berlebih-lebihan dalam mempraktikkan kekufuran dan kemaksiatan.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "19. Maka para rasul menjawab dengan penuh peringatan: “Kesialan kalian tidak akan terlepas dari diri kalian, karena amal perbuatan kalianlah yang akan menyeret kalian kepada kebinasaan. Apakah seperti ini kalian membalas nasehat dan peringatan?! Sungguh kalian adalah kaum yang tenggelam dalam kemewahan, dan melawan setiap orang yang menghalangi kalian dari hawa nafsu kalian.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "19. قَالُوا۟ طٰٓئِرُكُم مَّعَكُمْ ۚ (Utusan-utusan itu berkata: “Kemalangan kamu adalah karena kamu sendiri) Yakni kesialan kalian adalah karena diri kalian sendiri yang selalu menyertai kalian akibat mendustakan kami, sehingga sebab kesialan itu adalah kalian dan bukan kami. أَئِن ذُكِّرْتُم ۚ( Apakah jika kamu diberi peringatan (kamu bernasib malang)?) Yakni apakah akibat kami ingatkan kalian dengan Allah, kemudian kalian menganggap kami sebagai kesialan bagi kalian? بَلْ أَنتُمْ قَوْمٌ مُّسْرِفُونَ(Sebenarnya kamu adalah kaum yang melampui batas) Yakni sangat keterlaluan dalam melawan kebenaran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19. Para utusan itu berkata: “Kemalangan yang menyertai kalian itu karena kekufuran dan pendustaan kalian. Apakah jika kami mengingatkan kalian tentang Allah, kalian beranggapan bahwa kemalangan akan berlaku atas kalian, lalu kalian mengancam akan membunuh kami?” Yang dimaksud itu adalah pertanyaan ejekan, bahkan kalian adalah kaum yang melampaui batas dalam kesyirikan dan kemaksiatan. {Bal} adalah huruf yang berfungsi untuk berpindah dari satu kalam ke kalam lainnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata,“Kemalangan kalian itu karena kalian sendiri} kesialan kalian itu bersama kalian karena kekufuran kalian dan pendustaan kalian terhadap para rasul {Apakah karena kalian diberi peringatan} karena kalian diberi pelajaran tentang Allah kalian menjadi sial dan kufur {Sebenarnya kalian adalah kaum yang melampaui batas} melampaui batas-batas ketentuan Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "19. Para rasul itu berkata kepada mereka, “Kemalanganmu itu adalah karena kamu sendiri,” yaitu syirik dan kejahatan yang ada pada kalian yang berakibat pada terjadinya hal-hal yang tidak diinginkan, berupa bencana dan dicabutnya hal-hal yang dicintai dan nikmat. “Apakah jika kamu diberi peringatan,” yakni, karena kami mengingatkan kalian kepada apa yang di situ terdapat kebaikan dan nasib baik kalian, maka kalian mengatakan kepada kami apa yang telah kalian katakana? “Sebenarnya kamu adalah kaum yang berlebihan,” melampaui batas dan sombong dalam bicara. Maka seruan mereka (para rasul itu) tidak menambah selain mereka semakin jauh dan semakin sombong."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 19: Para Rasul berkata kepada mereka : Sesungguhnya datangnya kesengsaraan kepada kalian karena sebab kekufuran kalian dan pengingkaran kalian. Apakah kalian menghinakan kami dan mengancam kami karena kami mengingatkan dan memperingatkan kalian?! Sungguh kalian adalah kaum yang sombong, yang melanggar aturan Allah dengan kekufuran dan pengingkaran."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni karena kekafiranmu, perbuatan syirkmu dan karena maksiatmu, di mana perbuatan itu menghendaki datangnya sesuatu yang tidak diinginkan, siksa dan tercabutnya hal yang dicintai dan nikmat. Dengan sesuatu yang terdapat kebaikan bagimu dan keuntungan untukmu. Seruan tiga orang utusan itu tidak menambah mereka selain menambah mereka jauh dan menyombongkan diri."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 19",
    "description": "Mereka, yakni ketiga utusan itu, berkata, 'kemalangan kamu itu adalah karena perbuatan buruk kamu sendiri. Kamu bernasib buruk akibat keengganan kamu menerima ajakan kami. Apakah karena kamu diberi peringatan, lalu kamu menuduh kami sebagai penyebab kemalangan itu' tuduhan kamu sama sekali tidak benar! sebenarnya kamu adalah kaum yang melampaui batas dalam kedurhakaan sehingga mengakibatkan penderitaan yang kamu sebut sebagai nasib sial. '20-21. Berita kedatangan ketiga utusan tersebut menyebar ke pelosok negeri. Dan datanglah dari ujung kota seorang laki-laki yang telah beriman kepada risalah nabi isa, konon bernama 'ab'b bin m's' an-najj'r, dengan bergegas. Dia berkata untuk menasihati penduduk negeri itu, 'wahai kaumku! percaya dan ikutilah utusan-utusan itu karena mereka benar-benar utusan Allah. Ikutilah orang yang tidak meminta imbalan apa pun kepadamu atas dakwah mereka itu; dan mereka adalah orang-orang yang mendapat petunjuk dari Allah. Ayat ini menegaskan pentingnya ketulusan dalam menjalankan setiap aktivitas dan tidak mengharapkan apalagi meminta imbalan materi."
  }
]