[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "20-21. Seorang laki-laki dari sebuah tempat yang jauh di kota datang dengan tegesa-gesa (hal itu saat dia mengetahui bahwa penduduk desa berniat membunuh atau menyiksa para rasul itu), dia berkata, “Wahai kaum, ikutilah para utusan dari Allah kepada kalian ikutilah mereka yang tidak memungut upah harta dari kalian sebagai imbalan dia menyampaikan risalah kepada kalian, mereka juga berada di atas petunjuk dalam apa yang mereka dakwahkan kepada kalian, yaitu beribadah hanya kepada Allah semata.” Dalam Ayat ini mengandung petunjuk tentang keutamaan orang yang berusaha untuk beramar ma’ruf dan bernahi mungkar."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "20. Seorang laki-laki datang bergegas dari belahan negeri yang jauh karena takut atas sikap kaumnya yang mendustakan para rasul, mengancam akan membunuh dan menyakiti mereka. Laki-laki ini berkata, “Wahai kaumku! Ikutilah apa yang dibawa oleh para Rasul itu.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "20-21. Ketika berdebatan sedang berlangsung antara para rasul dengan para penduduk negeri, datanglah seorang lelaki dari ujung kota dengan bergegas. Dan ketika lelaki itu telah sampai di tempat perdebatan itu, dia berseru: “Wahai kaumku, ikutilah para rasul ini karena mereka berada di atas kebenaran dan petunjuk. Ikutilah orang-orang yang tidak meminta upah dari kalian itu, karena itu merupakan bukti kebenaran dakwah mereka, sebab mereka tidak memiliki keserakahan; dan sifat dan kepribadian mereka menjadi bukti akan hal itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "20. وَجَآءَ مِنْ أَقْصَا الْمَدِينَةِ رَجُلٌ يَسْعَىٰ (Dan datanglah dari ujung kota, seorang laki-laki dengan bergegas-gegas) Dia adalah Habib bin Musa an-Najjar. Qatadah berkata: dia biasa menyembah Allah di gua, dan setelah ia mendengar kabar kedatangan para rasul, dia langsung bergesar menuju mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20. Seorang laki-laki mukmin dari tempat yang sangat jauh datang ke kota itu. Dia adalah Habib bin Musa An-Najjar dan telah beriman kepada utusan-utusan Isa. Dia berjalan dengan cepat ketika mendengar tentang kabar utusan-utusan itu. Dia berkata: “Wahai kaumku, ikutilah utusan-utusan yang telah diutus untuk mengajak kalian mengesakan Allah dan menyembahNya”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan telah datang dari ujung kota} dari tempat paling jauh dari kota {seorang laki-laki dengan bergegas} bergegas dengan berjalan {Dia berkata,“Wahai kaumku, ikutilah para rasul itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "20. “Dan datanglah dari ujung kota seorang laki-laki dengan bergegas,” karena sangat bersemangat untuk memberikan nasihat kepada kaumnya ketika ia telah mendengar apa yang diserukan oleh para rasul dan ia beriman kepadanya serta mengetahui penolakan kaumnya terhadap mereka, seraya berkata, “Hai kaumku, ikutilah utusan-utusan itu.” Orang itu memerintah mereka supaya mengikuti para rasul dan menasihatkan hal itu kepada mereka serta memberikan kesaksian akan kerasulan para rasul itu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 20: Maka ketika tersebar ancama penduduk suatu negeri tersebut kepada para Rasul, maka jika ada seorang laki-laki datang dari tempat yang jauh, maka dihampiri oleh seorang laki-laki lain dengan berkata : Wahai kaum, ikutilah mereka para utusan yang mereka diutus oleh Allah untuk berdakwah kepada kalian dan menjauhkan kalian dari neraka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Orang ini telah mendengar seruan rasul dan telah beriman kepadanya, dia ingin menasihati kaumnya ketika mendengar kaumnya malah mendustakan utusan-utusan itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 20",
    "description": "20-21. Berita kedatangan ketiga utusan tersebut menyebar ke pelosok negeri. Dan datanglah dari ujung kota seorang laki-laki yang telah beriman kepada risalah nabi isa, konon bernama 'ab'b bin m's' an-najj'r, dengan bergegas. Dia berkata untuk menasihati penduduk negeri itu, 'wahai kaumku! percaya dan ikutilah utusan-utusan itu karena mereka benar-benar utusan Allah. Ikutilah orang yang tidak meminta imbalan apa pun kepadamu atas dakwah mereka itu; dan mereka adalah orang-orang yang mendapat petunjuk dari Allah. Ayat ini menegaskan pentingnya ketulusan dalam menjalankan setiap aktivitas dan tidak mengharapkan apalagi meminta imbalan materi"
  }
]