[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "20-21. Seorang laki-laki dari sebuah tempat yang jauh di kota datang dengan tegesa-gesa (hal itu saat dia mengetahui bahwa penduduk desa berniat membunuh atau menyiksa para rasul itu), dia berkata, “Wahai kaum, ikutilah para utusan dari Allah kepada kalian ikutilah mereka yang tidak memungut upah harta dari kalian sebagai imbalan dia menyampaikan risalah kepada kalian, mereka juga berada di atas petunjuk dalam apa yang mereka dakwahkan kepada kalian, yaitu beribadah hanya kepada Allah semata.” Dalam Ayat ini mengandung petunjuk tentang keutamaan orang yang berusaha untuk beramar ma’ruf dan bernahi mungkar."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Wahai kaumku! Ikutilah orang yang tidak meminta balasan dari kalian terkait apa yang telah mereka sampaikan kepada kalian. Mereka adalah orang-orang yang mendapatkan hidayah tentang apa yang mereka sampaikan kepada kalian dari Allah, yaitu wahyu-Nya. Barangsiapa yang demikian maka dia harus diikuti."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "21. Ikutilah orang yang tidak mencari upah dari kalian atas nasehat dan petunjuk itu. Mereka adalah kumpulan orang yang diberi petunjuk menuju kebenaran"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ikutilah orang yang tidak meminta imbalan kepada kalian. Mereka adalah orang-orang yang mendapat petunjuk"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21. Kemudian orang itu menjelaskan sebagai dukungan terhadap apa yang dipersaksikannya dan diserukannya, seraya berkata, “Ikutilah orang yang tiada meminta balasan kepadamu.” Ikutilah orang yang menasehati kalian dengan nasihat yang membawa kebaikan kepada kalian, dan ia tidak menginginkan harta ataupun imbalan dari kalian atas nasihat dan bimbingannya kepada kalian. Ini mengharuskan untuk mengikuti orang yang sifatnya seperti itu. Lebih dari itu bisa dikatakan, bisa saja dia mengajak dan tidak mengambil upah, akan tetapi dia tidak berada di atas yang haq? Kemungkinan ini ditolak dengan FirmanNya, “sedangkan mereka adalah orang-orang yang mendapat petunjuk,” karena mereka tidak mengajak kecuali kepada hal-hal yang dikukuhkan oleh akal sehat akan kebaikannya, dan mereka pun tidak mencegah kecuali apa yang dibenarkan oleh akal sehat akan keburukannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 21: Berkata orang yang menasihati juga : Dan wahai kaum, ikutilah mereka yang tidak menuntutu kepada kalian harta kekayaan atas penyampaian kerisalahan mereka. Ketahuilah bahwasanya mereka adalah orang-orang yang diberi petunjuk ata dakwah mereka untuk beribadah kepada Allah saja tanpa menyekutukan-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya orang tersebut menguatkan persaksian dan ajakannya. Yakni mereka tidak meminta harta dan upah terhadap nasihat dan bimbingannya kepada kamu. Orang yang seperti ini jelas layak diikuti. Mungkin timbul pertanyaan, “Memang para utusan itu tidak meminta upah atas ajakannya, namun apakah ajakannya benar atau salah?” Maka dengan kata-kata, “Mereka adalah orang-orang yang mendapat petunjuk.” Semakin jelas keberhakan mereka untuk diikuti. Mereka mendapatkan petunjuk, karena mereka tidaklah mengajak kecuali kepada perbuatan yang dipandang oleh akal sehat sebagai kebaikan, dan tidak melarang kecuali dari perbuatan yang dipandang oleh akal yang sehat sebagai keburukan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 21",
    "description": "20-21. Berita kedatangan ketiga utusan tersebut menyebar ke pelosok negeri. Dan datanglah dari ujung kota seorang laki-laki yang telah beriman kepada risalah nabi isa, konon bernama 'ab'b bin m's' an-najj'r, dengan bergegas. Dia berkata untuk menasihati penduduk negeri itu, 'wahai kaumku! percaya dan ikutilah utusan-utusan itu karena mereka benar-benar utusan Allah. Ikutilah orang yang tidak meminta imbalan apa pun kepadamu atas dakwah mereka itu; dan mereka adalah orang-orang yang mendapat petunjuk dari Allah. Ayat ini menegaskan pentingnya ketulusan dalam menjalankan setiap aktivitas dan tidak mengharapkan apalagi meminta imbalan materi. 22. Dan mengapa kamu enggan menyembah Allah ' tidak ada alasan bagiku dan bagimu untuk tidak menyembah Allah yang telah menciptakanku dan hanya kepada-Nyalah kamu akan dikembalikan untuk mene-rima balasan atas segala amal perbuatan yang dilakukan sewaktu di dunia."
  }
]