[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "“apa yang menghalangiku untuk beribadah kepada Allah yang telah menciptakanku dan hanya kepadaNyalah kalian semua akan kembali?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "22. Laki-laki yang memberikan nasihat tulus ini berkata, “Apa yang menghalangiku untuk menyembah Allah yang telah menciptakanku? Apa yang menghalangi kalian untuk menyembah Rabb yang menciptakan kalian. Hanya kepada-Nya semata kalian dikembalikan untuk dibangkitkan dan diberi balasan.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "22-24. Mengapa aku tidak menyembah Dzat Yang telah menciptakanku dari ketidakadaan dan kepada-Nya kalian akan kembali?” Kemudian dia bertanya dengan penuh keheranan: “Apakah aku akan menyekutukan Allah dan menganggap Dia memiliki sekutu, sedangkan Dia tidak memilikinya? Jika Allah Yang Maha Pengasih menghendaki keburukan bagiku, maka tidak ada yang dapat melindungiku dan ibadahku kepada-Nya tidak akan berguna bagiku, maka bagaimana aku akan menyekutukan-Nya? Sungguh aku telah tenggelam dalam kesesatan yang jelas jika aku menjadikan berhala-berhala itu sebagai tuhan dan mengharap syafaatnya. Aku sampaikan di depan kalian dan aku tegaskan bahwa aku beriman kepada Tuhan kalian yang telah menciptakan dan memberi kalian rezeki serta mengatur urusan kalian. Ikutilah seruanku dan dengarkanlah perkataanku.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "22. وَمَا لِىَ لَآ أَعْبُدُ الَّذِى فَطَرَنِى (Mengapa aku tidak menyembah (Tuhan) yang telah menciptakanku) Yakni apa yang menghalangiku untuk menyembah Allah yang telah menciptakanku? Dan mengapa kalian tidak menyembah Allah yang telah menciptakan kalian? وَإِلَيْهِ تُرْجَعُونَ(dan yang hanya kepada-Nya-lah kamu (semua) akan dikembalikan?) Kemudian kalian akan dihisab atas jawaban kalian saat kami menyeru kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "22. Kaumnya bertanya kepadanya: “Apakah kamu mengikuti agama mereka?” Dia menjawab: “Tentu saja, mana ada orang yang melarangku menyembah Dzat yang menciptakanku. Hanya kepadaNyalah kalian dikembalikan pada hari kiamat, lalu Dia (Allah) menghisab perbuatan kalian dan membalas kalian atas kekufuran kalian”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apa (alasanku) untuk tidak menyembah Dzat yang telah menciptakanku} menciptakanku {dan hanya kepadaNyalah kalian akan dikembalikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "22-25 seolah-olah kaumnya belum juga menerima nasihatnya, bahkan mereka kembali mencelanya karena mengikuti para rasul dan mengikhlaskan kepatuhan hanya kepada Allah semata, maka ia berkata, “mengapa aku tidak menyembah Tuhan yang telah menciptakanku dan yang hanya kepadaNya-lah kamu akan dikembalikan?” artinya, apa yang menghalingiku untuk beribadah kepada Yang berhak untuk diibadahi (disembah), sebab Dia-lah yang telah menjadikan dan menciptakanku serta memberiku rizki dan kepadaNya tempat kembali semua makhluk, lalu Dia akan memberikan balasan kepada mereka menurut amal-amal perbuataan mereka. Maka Tuhan yang di TanganNya penciptaan, rizki, dan keputusan diantara manusia di dunia dan di akhirat, Dia-lah yang berhak disembah, disanjung dan dipuji, bukan yang tidak memilki manfaat, tidak menimpakan bahaya, tidak bisa memberi dan menahan (keburukan), tidak pula memilki hak mematikan, menghidupkan ataupun membangkitkan kembali. maka dari itu Dia berfirman, ”mengapa aku akan menyembah ilah-ilah selainNya? Jika Yang Maha pemurah menghendaki kemudaratan terhadapku, nisacaya syafaat mereka tidak memberi manfaat sedikitpun bagi diriku,” karena tidak ada seorangpun yang dapat memberikan syafaa’at disisi Allah kecuali berdasarkan izin dariNya, maka syafa’at mereka sama sekali tidak bermanfaat bagi mereka, “dan mereka tidak pula dapat menyelamatkanku,” yakni, dari bahaya (mudarat) yang Allah kehendaki menimpaku? “sesungguhnya aku kalau begitu,” artinya, jika aku beribadah kepada sesembahan-sesembahan yang sedemikian rapuh sifat-sifatnya, “pasti (aku) berada dalam kesesatan yang nyata,” di dalam ungkapannya ini orang itu mengkombinasikan antaraa pemberian nasihat kepada mereka, pemberian kesaksian kepada rasul akan kerasulan dan hidayahnya dan pemberian akan dipastikannya ibadah hanya kepada Allah semata serta penyebutan dalil-dalil untuknya, dan bahwa sesungguhnya ibadah kepada selainNya adalah batil. Lalu ia menyebutkan argument-argumen terhadapnya, pemberitaan tentang kesesatan siapa saja yang menyembahnya dan maklumat tentang keimanannya secara terang-terangan, padahal ia sangat takut kalau mereka akan membunuhnya. Ia berkata,”sesungguhnya aku telah beriman kepada Rabbmu; maka dengarkanlah aku,”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 22: Dan dikatakan juga kepada mereka : Apa sebab yang menghalangiku dari beribadah kepada Allah yang menciptakanku ? Dan ucapannya terkandung makna peringatan : Begitu juga dengan kalian apa yang menghalangi kalian untuk beribadah kepada Tuhan kalian yang telah menciptakan kalian, dan kepada-Nya lah kalian kembali dan dihisab atas amalan-amalan kalian!!"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Seakan-akan kaumnya berkata kepadanya, “Apakah kamu di atas agama mereka (para utusan itu)?” Demikian juga bagimu. Karena memang yang menciptakan itulah yang berhak disembah. Setelah mati, lalu Dia akan memberikan balasan kepadamu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 22",
    "description": "Dan mengapa kamu enggan menyembah Allah ' tidak ada alasan bagiku dan bagimu untuk tidak menyembah Allah yang telah menciptakanku dan hanya kepada-Nyalah kamu akan dikembalikan untuk mene-rima balasan atas segala amal perbuatan yang dilakukan sewaktu di dunia. 23. Mengapa aku akan menyembah tuhan-tuhan selain-Nya' padahal me-reka sedikitpun tidak memiliki kekuasaan jika (Allah) yang maha pe-ngasih menghendaki bencana terhadapku, pasti pertolongan mereka yakni tuhan-tuhan yang disembah selain Allah tersebut tidak berguna sama sekali bagi diriku dan mereka juga tidak dapat menyelamatkanku."
  }
]