[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "23-25. Apakah aku menyembah tuhan-tuhan lain selain Allah yang tidak memiliki sedikitpun kesanggupan bila Allah yang maha pengasih menghendaki keburukan terhadapku, maka tuhan-tuhan itu tidak kuasa menolak hal itu atau mencegahnya dan ia juga tidak mampu menyelamatkanku dari apa yang sedang aku hadapi? Sesungguhnya bila aku tetap melakukan hal itu, maka aku benar-benar dalam kesalahan yang sangat nyata. Sesungguhnya aku beriman kepada tuhan kalian, maka dengarkanlah apa yang aku katakan kepada kalian. Taatilah aku engan beriman kepadaNya. Manakala dia berkata demikian kaumnya menggepungnya dan membunuhnya, maka Allah memasukkannya kedalam surga.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "23. Apakah aku mengangkat sesembahan selain Allah? Bila Allah yang Maha Penyayang menghendaki keburukan bagiku, maka sesembahan tersebut tidak akan membantuku sedikit pun, karena mereka tidak memiliki manfaat dan mudarat, tidak mampu menyelamatkanku dari keburukan yang Allah kehendaki terhadapku bila aku mati di atas kekufuran."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "23. ءَأَتَّخِذُ مِن دُونِهِۦٓ ءَالِهَةً (Mengapa aku akan menyembah tuhan-tuhan selain-Nya) Yakni aku tidak akan membuat tuhan-tuhan selain Allah untuk aku sembah dan meninggalkan Allah yang berhak aku sembah karena Dia-lah yang menciptakanku. إِن يُرِدْنِ الرَّحْمٰنُ بِضُرٍّ لَّا تُغْنِ عَنِّى شَفٰعَتُهُمْ شَيْـًٔا(jika (Allah) Yang Maha Pemurah menghendaki kemudharatan terhadapku, niscaya syafa’at mereka tidak memberi manfaat sedikitpun bagi diriku) Yakni tidak memberi suatu manfaat sedikitpun. وَلَا يُنقِذُونِ (dan mereka tidak (pula) dapat menyelamatkanku?) Yakni tidak dapat menyelamatkanku dari kemudharatan, jika Allah menghendaki itu bagiku?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "23. Aku tidak akan menjadikan selain Allah sebagai Tuhan, yaitu para berhala, sehingga aku menyembah mereka dan berhenti menyembah Allah, Penciptaku (Istifham tersebut bermakna nafi). Jika Dzat Yang Maha Pengasih ingin memberikan kemudharatan kepadaku, maka pertolongan berhala itu tidak berguna sedikitpun untukku. Mereka juga tidak bisa menyelamatkanku dari kemudharatan itu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mengapa aku mengambil sembahan-sembahan selain Dia. Jika Dzat Yang Maha Pengasih menghendaki bencana kepadaku} keburukan {maka tidak berguna} tidak bisa melindungi {diriku sama sekali pertolongan mereka dan mereka juga tidak dapat menyelamatkanku"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "22-25 seolah-olah kaumnya belum juga menerima nasihatnya, bahkan mereka kembali mencelanya karena mengikuti para rasul dan mengikhlaskan kepatuhan hanya kepada Allah semata, maka ia berkata, “mengapa aku tidak menyembah Tuhan yang telah menciptakanku dan yang hanya kepadaNya-lah kamu akan dikembalikan?” artinya, apa yang menghalingiku untuk beribadah kepada Yang berhak untuk diibadahi (disembah), sebab Dia-lah yang telah menjadikan dan menciptakanku serta memberiku rizki dan kepadaNya tempat kembali semua makhluk, lalu Dia akan memberikan balasan kepada mereka menurut amal-amal perbuataan mereka. Maka Tuhan yang di TanganNya penciptaan, rizki, dan keputusan diantara manusia di dunia dan di akhirat, Dia-lah yang berhak disembah, disanjung dan dipuji, bukan yang tidak memilki manfaat, tidak menimpakan bahaya, tidak bisa memberi dan menahan (keburukan), tidak pula memilki hak mematikan, menghidupkan ataupun membangkitkan kembali. maka dari itu Dia berfirman, ”mengapa aku akan menyembah ilah-ilah selainNya? Jika Yang Maha pemurah menghendaki kemudaratan terhadapku, nisacaya syafaat mereka tidak memberi manfaat sedikitpun bagi diriku,” karena tidak ada seorangpun yang dapat memberikan syafaa’at disisi Allah kecuali berdasarkan izin dariNya, maka syafa’at mereka sama sekali tidak bermanfaat bagi mereka, “dan mereka tidak pula dapat menyelamatkanku,” yakni, dari bahaya (mudarat) yang Allah kehendaki menimpaku? “sesungguhnya aku kalau begitu,” artinya, jika aku beribadah kepada sesembahan-sesembahan yang sedemikian rapuh sifat-sifatnya, “pasti (aku) berada dalam kesesatan yang nyata,” di dalam ungkapannya ini orang itu mengkombinasikan antaraa pemberian nasihat kepada mereka, pemberian kesaksian kepada rasul akan kerasulan dan hidayahnya dan pemberian akan dipastikannya ibadah hanya kepada Allah semata serta penyebutan dalil-dalil untuknya, dan bahwa sesungguhnya ibadah kepada selainNya adalah batil. Lalu ia menyebutkan argument-argumen terhadapnya, pemberitaan tentang kesesatan siapa saja yang menyembahnya dan maklumat tentang keimanannya secara terang-terangan, padahal ia sangat takut kalau mereka akan membunuhnya. Ia berkata,”sesungguhnya aku telah beriman kepada Rabbmu; maka dengarkanlah aku,”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 23: Berkata juga orang yang menasihati tersebut : Apakah kalian akan meninggalkan beribadah kepada Allah yang menciptakan kita, kemudian menyembah kepada selain Dia yang tuhan-tuhan tersebut tidak membahayakan maupun memberi manfaat?! Maka jika Allah menimpakan azab pada kita maka tuhan -tuhan tersebut tidak dapat menjaga diri kita dari azab Allah, dan tuhan-tuhan tersebut tidak dapat memberikan manfaat sama sekali serta tidak dapat meloloskan diri kita dari azab Allah, maka janganlah menyeru kepada selain Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 23",
    "description": "Mengapa aku akan menyembah tuhan-tuhan selain-Nya' padahal me-reka sedikitpun tidak memiliki kekuasaan jika (Allah) yang maha pe-ngasih menghendaki bencana terhadapku, pasti pertolongan mereka yakni tuhan-tuhan yang disembah selain Allah tersebut tidak berguna sama sekali bagi diriku dan mereka juga tidak dapat menyelamatkanku. 24. Sesungguhnya jika aku (berbuat) begitu yakni menyembah tuhan selain Allah, pasti aku berada dalam kesesatan yang nyata, karena tidak ada yang dapat memberikan manfaat dan menolak mudarat melainkan Allah semata."
  }
]