[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "23-25. Apakah aku menyembah tuhan-tuhan lain selain Allah yang tidak memiliki sedikitpun kesanggupan bila Allah yang maha pengasih menghendaki keburukan terhadapku, maka tuhan-tuhan itu tidak kuasa menolak hal itu atau mencegahnya dan ia juga tidak mampu menyelamatkanku dari apa yang sedang aku hadapi? Sesungguhnya bila aku tetap melakukan hal itu, maka aku benar-benar dalam kesalahan yang sangat nyata. Sesungguhnya aku beriman kepada tuhan kalian, maka dengarkanlah apa yang aku katakan kepada kalian. Taatilah aku engan beriman kepadaNya. Manakala dia berkata demikian kaumnya menggepungnya dan membunuhnya, maka Allah memasukkannya kedalam surga.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. Jika aku mengangkat mereka sebagai sesembahan selain Allah maka aku benar-benar di atas kesalahan yang nyata, karena aku menyembah sesuatu yang tidak berhak disembah dan meninggalkan siapa yang berhak."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "24. إِنِّىٓ إِذًا (Sesungguhnya aku kalau begitu) Jika aku membuat tuhan-tuhan selain Allah. لَّفِى ضَلٰلٍ مُّبِينٍ(pasti berada dalam kesesatan yang nyata) Yakni kesesatan yang jelas. Ini merupakan isyarat darinya bagi mereka. Kemudian dia secara terang-terangan menampakkan keimanannya secara jelas dengan mengatakan: إِنِّىٓ ءَامَنتُ بِرَبِّكُمْ فَاسْمَعُونِ"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "24. Sesungguhnya jika aku menyekutukan Allah dan menjadikan Tuhan lain selain Dia, maka sungguh aku berada dalam penyimpangan yang jelas dari jalan kebenaran"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya aku jika demikian} jika aku mengambil tuhan lain {benar-benar berada dalam kesesatan yang nyata} kesalahan yang nyata"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "22-25 seolah-olah kaumnya belum juga menerima nasihatnya, bahkan mereka kembali mencelanya karena mengikuti para rasul dan mengikhlaskan kepatuhan hanya kepada Allah semata, maka ia berkata, “mengapa aku tidak menyembah Tuhan yang telah menciptakanku dan yang hanya kepadaNya-lah kamu akan dikembalikan?” artinya, apa yang menghalingiku untuk beribadah kepada Yang berhak untuk diibadahi (disembah), sebab Dia-lah yang telah menjadikan dan menciptakanku serta memberiku rizki dan kepadaNya tempat kembali semua makhluk, lalu Dia akan memberikan balasan kepada mereka menurut amal-amal perbuataan mereka. Maka Tuhan yang di TanganNya penciptaan, rizki, dan keputusan diantara manusia di dunia dan di akhirat, Dia-lah yang berhak disembah, disanjung dan dipuji, bukan yang tidak memilki manfaat, tidak menimpakan bahaya, tidak bisa memberi dan menahan (keburukan), tidak pula memilki hak mematikan, menghidupkan ataupun membangkitkan kembali. maka dari itu Dia berfirman, ”mengapa aku akan menyembah ilah-ilah selainNya? Jika Yang Maha pemurah menghendaki kemudaratan terhadapku, nisacaya syafaat mereka tidak memberi manfaat sedikitpun bagi diriku,” karena tidak ada seorangpun yang dapat memberikan syafaa’at disisi Allah kecuali berdasarkan izin dariNya, maka syafa’at mereka sama sekali tidak bermanfaat bagi mereka, “dan mereka tidak pula dapat menyelamatkanku,” yakni, dari bahaya (mudarat) yang Allah kehendaki menimpaku? “sesungguhnya aku kalau begitu,” artinya, jika aku beribadah kepada sesembahan-sesembahan yang sedemikian rapuh sifat-sifatnya, “pasti (aku) berada dalam kesesatan yang nyata,” di dalam ungkapannya ini orang itu mengkombinasikan antaraa pemberian nasihat kepada mereka, pemberian kesaksian kepada rasul akan kerasulan dan hidayahnya dan pemberian akan dipastikannya ibadah hanya kepada Allah semata serta penyebutan dalil-dalil untuknya, dan bahwa sesungguhnya ibadah kepada selainNya adalah batil. Lalu ia menyebutkan argument-argumen terhadapnya, pemberitaan tentang kesesatan siapa saja yang menyembahnya dan maklumat tentang keimanannya secara terang-terangan, padahal ia sangat takut kalau mereka akan membunuhnya. Ia berkata,”sesungguhnya aku telah beriman kepada Rabbmu; maka dengarkanlah aku,”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 24: Kemudian Berkata juga orang yang menasihati tersebut: Dan sekiranya kita melakukan hal itu, sungguh kita menjadi orang-orang yang jauh dari kebenaran, serta jatuh dalam kesesatan yang nyata."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni menyembah selain Allah. Dalam ucapannya ini, dia menggabung antara memberi nasihat kepada mereka, mennjadi saksi atas kebenaran para utusan itu, memberitahukan bahwa Allah yang berhak diibadahi dan menyebutkan dalilnya, yaitu karena Dia Pencipta, demikian pula menerangkan bahwa menyembah selain-Nya adalah batil dan menerangkan buktinya, serta memberitahukan sesatnya orang yang menyembah selain-Nya, serta menampakkan keislamannya secara terang-terangan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 24",
    "description": "Sesungguhnya jika aku (berbuat) begitu yakni menyembah tuhan selain Allah, pasti aku berada dalam kesesatan yang nyata, karena tidak ada yang dapat memberikan manfaat dan menolak mudarat melainkan Allah semata. 25. Sesungguhnya aku telah beriman kepada tuhanmu yaitu Allah, tuhan yang kalian ingkari; maka dengarkanlah (pengakuan keimanan)-ku. '."
  }
]