[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "23-25. Apakah aku menyembah tuhan-tuhan lain selain Allah yang tidak memiliki sedikitpun kesanggupan bila Allah yang maha pengasih menghendaki keburukan terhadapku, maka tuhan-tuhan itu tidak kuasa menolak hal itu atau mencegahnya dan ia juga tidak mampu menyelamatkanku dari apa yang sedang aku hadapi? Sesungguhnya bila aku tetap melakukan hal itu, maka aku benar-benar dalam kesalahan yang sangat nyata. Sesungguhnya aku beriman kepada tuhan kalian, maka dengarkanlah apa yang aku katakan kepada kalian. Taatilah aku engan beriman kepadaNya. Manakala dia berkata demikian kaumnya menggepungnya dan membunuhnya, maka Allah memasukkannya kedalam surga.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "25. Sesungguhnya aku -wahai kaumku- telah beriman kepada Tuhanku dan Tuhan kalian, maka dengarkanlah aku. Aku tidak peduli dengan pembunuhan yang kalian ancamkan kepadaku. Maka kaumnya tidak melakukan apa pun kecuali membunuhnya, kemudian Allah memasukkannya ke dalam Surga."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "25-27. Setelah itu, kisah ini berpindah ke kehidupan di akhirat; lelaki ini telah sampai di kehidupan akhirat. Kemungkinan besar, mereka membunuh orang ini karena mereka marah terhadap perkataannya yang jujur yang disampaikan kepada mereka, sehingga dia meraih kesyahidan dan berpindah ke sisi Allah Yang Maha Pengasih, dan dikatankan kepadanya: “Masuklah ke dalam surga.” Perjalanannya telah selesai dan mengantarkannya menuju surga yang penuh dengan kenikmatan. Meski demikian, lelaki ini masih merasa menginginkan kebaikan bagi kaumnya dan mengharap hidayah bagi mereka, walaupun mereka telah berbuat kejahatan terhadapnya; hal ini dia ungkapkan dengan berkata: “Duh kasihan kaumku, seandainya mereka mengetahui ampunan Tuhanku bagiku.” Kemudian dia berharap agar termasuk hamba-hamba-Nya yang dimuliakan di dalam surga."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "25. إِنِّىٓ ءَامَنتُ بِرَبِّكُمْ فَاسْمَعُونِ (Sesungguhnya aku telah beriman kepada Tuhanmu; maka dengarkanlah aku) Terdapat pendapat mengatakan bahwa dia mengatakan perkataan ini ketika kaumnya hendak membunuhnya sebagai bentuk keteguhannya di atas agama dan kekokohannya dalam kebenaran. Setelah dia mengatakan ini dan menyatakan keimanannya dihadapan kaumnya, mereka kemudian menyerang dan membunuhnya. Dikatakan bahwa mereka menginjaknya dengan kaki-kaki mereka; dan pendapat lain mengatakan bahwa mereka membakarnya; dan pendapat lain mengatakan bahwa mereka memotong-motongnya dengan gergaji."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "25. Sesungguhnya aku beriman kepada Tuhan kalian yang telah menciptakan kalian, maka dengarkanlah pengakuan keimananku, saksikanlah aku atas hal itu dan ketahuilah apa yang aku yakini. Kemudian mereka membunuhnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya aku telah beriman kepada Tuhan kalian. Maka dengarkanlah aku”} maka dengarkanlah keimananku wahai para rasul, dan bersaksilah untukku atas hal itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "22-25 seolah-olah kaumnya belum juga menerima nasihatnya, bahkan mereka kembali mencelanya karena mengikuti para rasul dan mengikhlaskan kepatuhan hanya kepada Allah semata, maka ia berkata, “mengapa aku tidak menyembah Tuhan yang telah menciptakanku dan yang hanya kepadaNya-lah kamu akan dikembalikan?” artinya, apa yang menghalingiku untuk beribadah kepada Yang berhak untuk diibadahi (disembah), sebab Dia-lah yang telah menjadikan dan menciptakanku serta memberiku rizki dan kepadaNya tempat kembali semua makhluk, lalu Dia akan memberikan balasan kepada mereka menurut amal-amal perbuataan mereka. Maka Tuhan yang di TanganNya penciptaan, rizki, dan keputusan diantara manusia di dunia dan di akhirat, Dia-lah yang berhak disembah, disanjung dan dipuji, bukan yang tidak memilki manfaat, tidak menimpakan bahaya, tidak bisa memberi dan menahan (keburukan), tidak pula memilki hak mematikan, menghidupkan ataupun membangkitkan kembali. maka dari itu Dia berfirman, ”mengapa aku akan menyembah ilah-ilah selainNya? Jika Yang Maha pemurah menghendaki kemudaratan terhadapku, nisacaya syafaat mereka tidak memberi manfaat sedikitpun bagi diriku,” karena tidak ada seorangpun yang dapat memberikan syafaa’at disisi Allah kecuali berdasarkan izin dariNya, maka syafa’at mereka sama sekali tidak bermanfaat bagi mereka, “dan mereka tidak pula dapat menyelamatkanku,” yakni, dari bahaya (mudarat) yang Allah kehendaki menimpaku? “sesungguhnya aku kalau begitu,” artinya, jika aku beribadah kepada sesembahan-sesembahan yang sedemikian rapuh sifat-sifatnya, “pasti (aku) berada dalam kesesatan yang nyata,” di dalam ungkapannya ini orang itu mengkombinasikan antaraa pemberian nasihat kepada mereka, pemberian kesaksian kepada rasul akan kerasulan dan hidayahnya dan pemberian akan dipastikannya ibadah hanya kepada Allah semata serta penyebutan dalil-dalil untuknya, dan bahwa sesungguhnya ibadah kepada selainNya adalah batil. Lalu ia menyebutkan argument-argumen terhadapnya, pemberitaan tentang kesesatan siapa saja yang menyembahnya dan maklumat tentang keimanannya secara terang-terangan, padahal ia sangat takut kalau mereka akan membunuhnya. Ia berkata,”sesungguhnya aku telah beriman kepada Rabbmu; maka dengarkanlah aku,”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 25: Kemudian berkata juga orang yang menasihati tersebut: Ketahuilah oleh kalian wahai kaum, sesungguhnya kalian mesti beriman kepada kepada Allah dan dengarkanlah ucapanku, taatilah aku atas apa yang aku seru padamu dari keimanan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 25",
    "description": "Sesungguhnya aku telah beriman kepada tuhanmu yaitu Allah, tuhan yang kalian ingkari; maka dengarkanlah (pengakuan keimanan)-ku. '26. Setelah menyatakan iman di hadapan kaumnya, kaummnya pun membunuhnya. Allah pun memberikan pahala atas imannya yang kokoh itu. Ketika dia meninggal, malaikat turun memberitahukan bahwa Allah telah mengampuni dosanya dan dia akan masuk surga dikatakan kepadanya, 'masuklah ke surga. ' dia laki-laki itu berkata, 'alangkah baiknya sekiranya kaumku mengetahui, ."
  }
]