[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dia berkata saat dalam kenikmatan dan kemuliaan, ”seandainya kaumku mengetahui ampunan tuhanku dan penghormatannya kepadaku disebabkan oleh imanku dan kesabaranku di atas ketaatan kepadaNya dan mengikuti utusan-utusanNya sampai aku dibunuh, sehingga mereka akan beriman kepada Allah lalu mereka masuk surga sepertiku. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "26-27. Untuk memuliakan laki-laki yang telah gugur tersebut maka dikatakan kepadanya, “Masuklah ke dalam Surga”. Manakala dia masuk dan menyaksikan berbagai kenikmatan di dalamnya, maka dia berkata seraya berharap, “Seandainya kaumku yang mendustakanku dan membunuhku mengetahui apa yang aku dapatkan berupa ampunan terhadap dosa-dosaku dan kemuliaan dari Tuhanku kepadaku, niscaya mereka akan beriman sebagaimana aku beriman, lalu mereka mendapatkan balasan seperti apa yang aku dapatkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "27. (Alangkah baiknya) mereka mengetahui apa yang menyebabkan Tuhanku mengampuni dosaku dan menjadikanku termasuk orang-orang yang mulia dengan memasukkanku ke dalam surga. Dia berharap ada keimanan dan kebaikan bagi mereka layaknya keimanannya meskipun mereka membunuh dan menyakitinya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tentang bagaimana Tuhanku mengampuniku dan menjadikanku termasuk orang-orang yang dimuliakan”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "26-27 lalu lelaki ini dibunuh oleh kaumnya sendiri setelah mereka mendengar darinya dan ia berdialog dengan mereka. “dikatakan” kepadanya pada saat itu juga, “masuklah kesurga,” Allah berfirman seraya mengabarkan karamah (kemuliaan) yang diraihnya karena tauhid dan keikhlasannya serta nasihat kepada kaumnya, sesudah wafatnya, sebagaimana dinasihatkannya saat masih hidup, “alangkah baiknya sekiranya kaumku mengetahui; apa yang menyebabkan Rabbku memberikan ampun kepadaku,” maksudnya, disebabkan apa Dia mengampuniku hingga Dia menjauhkan segala bentuk siksaan dariku, “dan menjadikanku termasuk orang-orang yang dimuliakan” dengan berbagai macam pahala dan segala hal yang menyenangkan. Artinya, kalau tidak sekiranya pengetahuan tentang hal ini sampai pada hati mereka, tentu mereka tetap berada dalam kesyirikan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 27: Duhai seandainya mereka mengetahui bahwasanya Allah Maha Pengampun atas dosa dengan ketauhidan dan keimanan padanya, serta membenarkan utusan-utusan Allah. Kemudian Allah menjadikanku manusia yang mulia disisinya, maka andai saja mereka mengetahui keadaanku."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sehingga menyingkirkan berbagai hukuman darinya. Dengan berbagai pahala dan kenikmatan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 27",
    "description": "Duhai seandainya kaumku mengetahui apa yang menyebabkan tuhanku memberi ampun kepadaku dan menjadikan aku termasuk orang-orang yang telah dimuliakan niscaya mereka akan beriman sebagaimana aku beriman. '28. Beralih dari penjelasan perihal 'ab'b an-najj'r yang mati dibunuh dan harapannya agar kaumnya ikut beriman, Allah dalam ayat berikut menjelaskan azab yang akan ditimpakan kepada orang musyrik. Dan setelah dia, yakni 'ab'b an-najj'r dibunuh karena keimanannya, kami tidak menurunkan suatu pasukan malaikat pun dari langit kepada kaumnya untuk menghancurkan mereka. Kami sudah menetapkan siksa bagi mereka berupa teriakan yang sangat keras. Dan karena itu, kami tidak perlu menurunkannya, yakni para malaikat, dalam jumlah banyak."
  }
]