[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Perkaranya tidak membutuhkan diturunkannya pasukan dari langit untuk mengazab mereka setelah mereka membunuh laki-laki shaleh yang menasihati mereka dan pendustaan mereka terhadap utusan-utusan mereka, karena lebih lemah dan lebih hina dari itu dan kami juga tidak menurunkan malaikat kepada umat-umat bila kami membinasakan mereka, akan tetapi kami (cukup) mengirimkan azab yang menghancurkan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "28. Kami tidak memerlukan bala tentara Malaikat yang turun dari langit untuk membinasakan kaumnya yang mendustakannya dan membunuh mereka, karena perkara mereka sangat mudah bagi Kami. Kami telah menetapkan bahwa kebinasaan mereka adalah dengan suara menggelagar dari langit bukan dengan menurunkan Malaikat azab."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "28. Kami tidak menurunkan kepada kaum lelaki shalih yang terbunuh itu tentara dari langit untuk mengazab mereka, sebab mereka tidak layak terlalu remeh untuk diturunkan para malaikat kepada mereka agar membinasakan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "28. وَمَآ أَنزَلْنَا عَلَىٰ قَوْمِهِۦ مِنۢ بَعْدِهِۦ (Dan kami tidak menurunkan kepada kaumnya sesudah dia (meninggal)) Yakni tidak menurunkan kepada kaum Habib al-Najjar setelah mereka membunuhnya. مِن جُندٍ مِّنَ السَّمَآءِ(suatu pasukanpun dari langit) Untuk membinasakan dan membalas mereka. وَمَا كُنَّا مُنزِلِينَ(dan tidak layak Kami menurunkannya) Karena telah Kami tetapkan bahwa pembinasaan mereka adalah dengan suara yang keras, dan bukan dengan menurunkan pasukan. Atau ini adalah penyepelean dan peremehan bagi mereka, sebab mereka tidak layak dibinasakan dengan pasukan yang dikirim dari langit."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "28. Dan Kami tidak menurunkan pasukan malaikat dari langit untuk kaum orang mukmin ini (Habib An-Najjar setelah kematiannya) untuk menghancurkan dan membalas perbuatan mereka. Kami tidak menurunkan malaikat untuk mereka karena didahului oleh ketentuan Kami untuk menghancurkan mereka menggunakan suara yang mengerikan dan menghancurkan. Untuk menghancurkan mereka tidak membutuhkan malaikat, cukup dengan satu suara saja."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami tidak menurunkan kepada kaumnya satu pasukan pun} dari golongan malaikat {dari langit setelahnya dan Kami tidak perlu menurunkannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "28. Allah berfirman tentang siksaan bagi kaumnya, “dan kami tidak menurunkan kepada kaumnya sesudah dia meninggal suatu pasukan dari langit untuk membinasakan mereka, “dan tidak layak kami menurunkannya,” karena tidak ada perlunya untuk itu, karena keagungan kekuasaan Allah dan betapa sangat rapuhnya manusia, sehingga siksaan yang paling ringan saja, sudah cukup buat mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 28: Allah mengabarkan bahwasanya kaum tersebut memiliki dendam kepada laki-laki sholeh setelah membunuhnya, karena sebab mereka adalah orang-orang yang mendustakan para rasul dan membunuh wali -wali Allah yang sholeh, Allah mengabarkan bahwasanya Allah tidak menurunkan atau membutuhkan malaikat untuk membinasakan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala berfirman tentang hukuman untuk kaum itu. Maksudnya, Kami tidak perlu susah-susah membinasakan mereka dengan menurunkan satu pasukan malaikat dari langit untuk membinasakan mereka. Karena tidak ada keperluan untuk itu. Kekuasaan Allah Subhaanahu wa Ta'aala yang demikian hebat, sedangkan manusia begitu lemah cukup dengan menimpakan sedikit azab yang dapat membinasakan mereka. Azab tersebut adalah satu teriakan saja yang dilakukan oleh sebagian malaikat Allah, yaitu malaikat Jibril ‘alahis salam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 28",
    "description": "Beralih dari penjelasan perihal 'ab'b an-najj'r yang mati dibunuh dan harapannya agar kaumnya ikut beriman, Allah dalam ayat berikut menjelaskan azab yang akan ditimpakan kepada orang musyrik. Dan setelah dia, yakni 'ab'b an-najj'r dibunuh karena keimanannya, kami tidak menurunkan suatu pasukan malaikat pun dari langit kepada kaumnya untuk menghancurkan mereka. Kami sudah menetapkan siksa bagi mereka berupa teriakan yang sangat keras. Dan karena itu, kami tidak perlu menurunkannya, yakni para malaikat, dalam jumlah banyak. 29. Dengan demikian, tidak ada siksaan terhadap mereka yang mendus-takan utusan Allah melainkan dengan satu teriakan saja, yaitu teriakan jibril yang sangat keras; maka seketika itu mereka pun mati. Demikianlah balasan di dunia bagi orang yang mendustakan utusan Allah."
  }
]