[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kebinasaaan mereka hanya dengan satu teriakan, dan merekapun bergelimpangan tanpa sesuatupun tersisa dari mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "29. Pembinasaan atas kaumnya hanya dengan satu suara keras yang Kami kirimkan kepada mereka, maka tahu-tahu mereka terkapar tak bernyawa dan tak bersisa, mereka seperti api yang menyala lalu padam seketika, tak meninggalkan bekas."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "29. Kebinasaan mereka hanya dengan suara keras yang dikeluarkan oleh satu malaikat saja, dan merekapun binasa seluruhnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "29. إِن كَانَتْ إِلَّا صَيْحَةً وٰحِدَةً (Tidak ada siksaan atas mereka melainkan satu teriakan suara saja) Malaikat Jibril berteriak kepada mereka sehingga membinasakan mereka semua. فَإِذَا هُمْ خٰمِدُونَ(maka tiba-tiba mereka semuanya mati) Mereka semua mati, tidak terdengar dari mereka rintihan sama sekali, seperti api yang padam dan kembali dingin."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "29. Tidak ada hukuman bagi mereka kecuali hanya suara (suara yang sangat menggelisahkan) yang dikeluarkan oleh Jibril. Lalu suara itu menghancurkan mereka. Ketika sudah mati, mereka semua terdiam dan tidak dapat merasakan apapun. Kata {Idza} untuk menunjukkan betapa cepatnya sesuatu setelahnya itu terjadi"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Hal itu cukup dengan satu teriakan saja. Maka seketika itu mereka mati} mereka mati tidak bergerak"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "29. “tidak ada,” maksudnya, siksaan atas mereka, “melainkan satu teriakan suara saja,” yakni, satu suara saja yang dilontarkan oleh salah seorang malaikat Allah, “maka tiba-tiba mereka semuanya mati,” hati mereka tercabik-cabik (hancur) di dalam rongga tubuh mereka dan mereka terus tersentak karena suara teriakan itu, maka mereapun menjadi mati, tidak bersuara, tidak bergerak dan tidak pula hidup setelah kecongkkan dan kesombongan mereka serta setelah merespon orang-orang yang paling mulia (rasul) dengan perkataan kotor dan sikap semena-mena kepada mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 29: Allah menjelaskan bahwasanya azab untuk orang-orang yang bermaksiat ini adalah dengan membinasakan mereka dengan tanpa suara ataupun gerakan. Inilah akhir balasan bagi mereka di dunia dan di akhirat mereka mendapatkan azab neraka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mereka tidak bersuara dan tidak bergerak lagi setelah sebelumnya bersikap angkuh dan sombong, serta menyikapi makhluk yang mulia (para rasul) dengan sikap yang buruk."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 29",
    "description": "Dengan demikian, tidak ada siksaan terhadap mereka yang mendus-takan utusan Allah melainkan dengan satu teriakan saja, yaitu teriakan jibril yang sangat keras; maka seketika itu mereka pun mati. Demikianlah balasan di dunia bagi orang yang mendustakan utusan Allah. 30. Orang-orang yang mendustakan para rasul akan menyesal pada hari kiamat. Alangkah besar penyesalan terhadap hamba-hamba itu, setiap datang seorang rasul yang menyeru kepada mereka agar beriman kepada Allah dan menempuh jalan yang benar, mereka selalu memperolok-olokkan bahkan membunuh-Nya."
  }
]