[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "2-4. Allah bersumpah dengan al-Qur’an yang muhkam yang di dalamnya terkandung hokum-hukum, hikmah-hikmah dan hujjah-hujjah, bahwa sesungguhnya kamu (wahai Rasul) benar-benar termasuk orang-orang yang diutus oleh Allah dengan wahyuNya kepada hamba-hambaNya, yang berjalan di atas jalan lurus lagi seimbang, yaitu Islam."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Sesungguhnya kamu -wahai Rasul- benar-benar termasuk para rasul yang Allah utus kepada hamba-hamba-Nya untuk memerintahkan mereka mentauhidkan-Nya dan menyembah-Nya semata."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "3-5. Allah bersumpah dengan al-Qur’an atas kebenaran risalah Nabi Muhammad, dan dia merupakan termasuk para utusan yang mulia, serta berada di atas jalan yang lurus. Risalah dan jalan ini merupakan wahyu dari Allah yang diturunkan dengan kemuliaan dan rahmat-Nya. Allah Maha Kuasa melakukan segala sesuatu, Dia menurunkan kitab yang mengandung kemuliaan, kekuatan, kemudahan, dan rahmat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. إِنَّكَ لَمِنَ الْمُرْسَلِينَ (Sesungguhnya kamu salah seorang dari rasul-rasul) Terdapat pendapat mengatakan bahwa ini merupakan bantahan terhadap orang-orang kafir yang mengingkari kerasulannya dengan mengatakan “kamu bukanlah seorang rasul.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Wahai Muhammad, sesungguhnya kamu adalah salah satu dari sejumlah rasul untuk menunjukkan manusia agar beriman dengan benar, menyembah Allah dan menaatiNya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya kamu benar-benar salah seorang dari rasul-rasul"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3. “Sesungguhnya kamu benar-benar salah seorang dari rasul-rasul.” Inilah yang disumpahkan, yaitu kerasulan Muhammad. Dan sesungguhnya engkau wahai Muhammad adalah termasuk golongan para rasul. Jadi, kamu bukan yang pertama dari para rasul. Dan juga, kamu datang dengan membawa apa yang telah dibawa para rasul, yaitu prinsip-prinsip agama. Dan juga, siapa saja yang mencermati hal-ihwal para rasul dan ciri-ciri mereka dan mengetahui perbedaan antara mereka dengan orang-orang selain mereka, niscaya ia mengetahui bahwa engkau termasuk para rasul yang terbaik, karena sifat-sifat yang sempurna dan akhlak yang mulia yang ada padamu. Sudah tidak diragukan lagi adanya hubungan antara yang disumpahkan, yaitu al-Quran yang penuh hikmah dengan yang disumpahkan atasnya, yaitu kerasulan Muhammad. Dan bahwa sesungguhnya, kalau saja tidak ada bukti (dalil) bagi kerasulannya dan tidak ada pula saksi selain al-Quran yang penuh hikmah ini, niscaya al-Quran itu sudah cukup sebagai dalil dan saksi atas kerasulan Muhammad, bahkan, al-Quran yang mulia ini sendiri adalah merupakan dalil yang terkuat dan terus menerus yang menunjukkan kerasulan Rasulullah. Jadi, dalil-dalil al-Quran itu semuanya adalah merupakan dalil-dalil (bukti-bukti) bagi kerasulan Muhammad."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 3: 2-4. Surat ini diawali dengan sumpah Allah terhadap Al Qur’an Al Adziem, yang muhkam atas nasihat, serta syariat-syariat dan adab-adab yang terpuji di dalamnya. Dan dengan kebenaran Al Qur’an ini, maka sunggu engkau wahai Nabi Allah, adalah sebagian dari hamba Allah yang diutus. Engkau adalah termasuk orang yang koko di atas jalan yang terang yaitu jalan islam. Ini adalah persaksian dari Allah atas Muhammad ﷺ atas syariat yang agung."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini sebagai bantahan terhadap orang-orang kafir yang mengatakan kepada Beliau, “Engkau bukan seorang rasul.” Firman-Nya, “Sungguh, engkau (Muhammad) adalah salah seorang dari rasul-rasul,” merupakan isi dari sumpah sebelumnya, yakni Allah bersumpah dengan Al Qur’an, bahwa Muhammad shallallahu 'alaihi wa sallam termasuk para rasul. Oleh karena itu, yang Beliau bawa sama dengan yang dibawa para rasul sebelumnya seperti dalam masalah-masalah ushul/pokok. Di samping itu, barang siapa yang memperhatikan keadaan para rasul dan sifat mereka, maka dia akan mengetahui bahwa Beliau termasuk rasul pilihan karena sifat-sifat sempurna yang Beliau miliki dan akhlak utama. Hal ini tidaklah samar, karena adanya hubungan yang kuat antara yang dipakai untuk bersumpah, yaitu Al Qur’an dan hal yang disumpahkan, yaitu kerasulan Muhammad shallallahu 'alaihi wa sallam, sehingga jika seandainya tidak ada dalil dan saksi terhadap kerasulan Beliau shallallahu 'alaihi wa sallam selain Al Quranul Karim ini, tentu ia sudah cukup sebagai dalil dan saksi terhadap kerasulan Muhammad shallallahu 'alaihi wa sallam, bahkan Al Qur’anul Karim merupakan dalil terkuat yang menunjukkan kerasulan Beliau shallallahu 'alaihi wa sallam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 3",
    "description": "Aku bersumpah bahwa sungguh, engkau adalah salah seorang dari rasul-rasul, wahai nabi Muhammad. Engkau kami utus untuk mengingatkan manusia dan memberi mereka petunjuk guna meraih kebahagiaan di dunia dan akhirat. 4. Sungguh, engkau berada di atas jalan yang lurus, yakni jalan yang dapat mengantarkan manusia menuju kebahagiaan di dunia dan akhirat. Itulah agama islam (lihat juga: asy-sy'r'/42: 52)."
  }
]