[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "apakah orang-orang yang memperolok-olok itu tidak melihat lalu mengambil pelajaran dari orang-orang sebelum mereka dari generasi-generasi yang telah kami binasakan, bahwa mereka tidak lagi kembali kedunia ini?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "31. Apakah orang-orang yang mendustakan para rasul dan merendahkan mereka tidak mengambil pelajaran dari umat-umat sebelum mereka. Mereka telah mati dan tidak akan pernah kembali ke dunia lagi, sebaliknya mereka telah berangkat menuju amalan yang telah mereka lakukan, dan Allah akan membalas mereka atas itu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "31. Tidakkah orang-orang yang menghina dan mendustakan itu mengetahui tentang kebinasaan umat-umat terdahulu yang mendustakan, bahwa mereka tidak dapat kembali ke dunia setelah kebinasaan mereka? Sehingga dengan begitu mereka dapat mengambil pelajaran dan ibrah, agar mereka beriman dan selamat dari kebinasaan di dunia dan azab di akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "31. أَلَمْ يَرَوْا۟ كَمْ أَهْلَكْنَا قَبْلَهُم مِّنَ الْقُرُونِ (Tidakkah mereka mengetahui berapa banyaknya umat-umat sebelum mereka yang telah Kami binasakan) Dari kaum-kaum terdahulu. أَنَّهُمْ إِلَيْهِمْ لَا يَرْجِعُونَ(bahwasanya orang-orang itu tiada kembali kepada mereka) Setelah kebinasaan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "31. Apakah orang-orang musyrik Mekah itu tidak tahu (Istifham yang dimaksud disini adalah istifham taqriry, maknanya adalah akuilah bahwa kalian mengetahuinya) bahwa Kami telah menghancurkan banyak umat-umat terdahulu sebelum mereka mendustakan rasul-rasul mereka. Sungguh Kami telah menentukan bahwa mereka tidak bisa kembali ke dunia setelah dibinasakan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah mereka tidak mengetahui berapa banyak umat} umat {sebelum mereka yang telah Kami binasakan. Mereka tidak ada yang kembali kepada mereka} mereka tidak kembali ke dunia"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "31-32. “tidakkah mereka mengetahui betapa bnayak umat-umat sebelum mereka yang telah Kami binasakan, bahwasannya (orang-orang yang telah kami binasakan) itu tiada kembali kepada mereka. Dan setiap mereka semuanya akan dikumpulkan lagi kepada kami,” Allah menyatakan, tidakkah mereka melihat dan mengambil pelajaran dari orang-orang sebelum mereka, yaitu generasi-generasi yang mendustakan para rasul yang telah dibinasakan oleh Allah dan ditimpa azabNya; dan kelak Allah akan mengembalikannya sebagai makhluk baru, Dia akan menghidupkan kembali sesudah kematian mereka serta akan menghadirkan mereka di hadapanNya untuk diberikan keputusan dengan keputusan yang adil di antara mereka, yang di situ Dia tidak menzhalimi seberat biji sawipun, \"jika kebaikan, maka Dia akan melipatgandakannya dan akan memberikan pahala yang sangat besar dari sisiNya.\""
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 31: Allah berkata : Tidakkah orang-orang kafir mengambil pelajaran karena sebab Kami membinasakan kebanyakan umat-umat yang terdahulu, yang mereka bermaksiat kepada Rasul dan menampak kekufuran mereka; Maka mereka berhak untuk di azab oleh Allah dan telah kalian ketahui bahwasanya Allah mengazab mereka dan mereka tidak akan mungkin dapat kembali ke dunia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni mereka yang mendustakan rasul. Yakni memperhatikan dan mengambil pelajaran dari umat-umat sebelum mereka yang sama-sama mendustakan rasul, di mana Allah Subhaanahu wa Ta'aala membinasakan mereka dan menimpakan azab-Nya. Maksudnya mereka semua binasa dan tidak akan kembali ke dunia. Oleh karena itu, tidakkah mereka mengambil pelajaran."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 31",
    "description": "Dengan berita yang orang-orang musyrik mekah terima dari rasulullah, tidakkah mereka mengetahui berapa banyak umat-umat sebelum mereka yang telah kami binasakan akibat pengingkaran mereka kepada utusan Allah' padahal kami telah menetapkan bahwa orang-orang yang telah kami binasakan itu tidak ada yang kembali lagi kepada mereka. Me-reka tidak akan kembali ke dunia. 32. Dan setiap umat, dari generasi pertama hingga terakhir, semuanya akan dihadapkan oleh malaikat kepada kami untuk diminta pertanggungjawaban atas perbuatan mereka di dunia."
  }
]