[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Semua umat pada abad yang telah berlalu yang telah kami binasakan mereka dan selain mereka , semuanya akan dihadirkan di depan kami di hari kiamat untuk menghadapi perhitungan dan pembalasan amal."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "32. Semua umat tanpa kecuali akan dihadirkan di hadapan Kami pada hari Kiamat sesudah mereka dibangkitkan untuk Kami beri balasan atas amal-amal mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "32. Setiap umat pasti akan didatangkan ke hadapan Allah untuk mendapat balasan; baik itu pahala maupun siksa."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "32. وَإِن كُلٌّ لَّمَّا جَمِيعٌ لَّدَيْنَا مُحْضَرُونَ (Dan setiap mereka semuanya akan dikumpulkan lagi kepada Kami) Tidak lain mereka semuaa pasti akan dikumpulkan kepada Kami untuk menjalankan hisab."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "32. Setiap manusia tidak lain akan dihadirkan di hadapan Allah untuk dihisab. Setelah dibangkitkan, setiap manusia dikumpulkan di tempat perkumpulan pada hari kiamat untuk dihisab dan dibalas. Kata {Jami’} disini bermakna dikumpulkan, dan kata {Makhdhurun} bermakna bahwa para malaikat menghadirkan mereka untuk diazab."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Tidak ada satu pun kecuali} tidak ada satupun kecuali {semuanya akan dihadirkan kepada Kami"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "31-32. “tidakkah mereka mengetahui betapa bnayak umat-umat sebelum mereka yang telah Kami binasakan, bahwasannya (orang-orang yang telah kami binasakan) itu tiada kembali kepada mereka. Dan setiap mereka semuanya akan dikumpulkan lagi kepada kami,” Allah menyatakan, tidakkah mereka melihat dan mengambil pelajaran dari orang-orang sebelum mereka, yaitu generasi-generasi yang mendustakan para rasul yang telah dibinasakan oleh Allah dan ditimpa azabNya; dan kelak Allah akan mengembalikannya sebagai makhluk baru, Dia akan menghidupkan kembali sesudah kematian mereka serta akan menghadirkan mereka di hadapanNya untuk diberikan keputusan dengan keputusan yang adil di antara mereka, yang di situ Dia tidak menzhalimi seberat biji sawipun, \"jika kebaikan, maka Dia akan melipatgandakannya dan akan memberikan pahala yang sangat besar dari sisiNya.\""
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 32: Ketahuilah bahwasanya seluruh dari mereka yang kami binasakan dari umat-umat yang terdahulu dan selain mereka, akan dikumpulkan dan dihadapkan di hadapan Allah pada hari kiamat untuk dibalas dan dihisab."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Di mauqif (padang mahsyar) setelah dibangkitkan untuk dihisab dan diberikan keputusan yang adil yang tidak ada kezaliman sedikit pun. Jika amalnya baik, maka Allah akan melipatgandakannya dan akan memberikan pahala yang besar dari sisi-Nya, dan jika amalnya buruk, maka Dia akan membalas dengan balasan yang sesuai."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 32",
    "description": "Dan setiap umat, dari generasi pertama hingga terakhir, semuanya akan dihadapkan oleh malaikat kepada kami untuk diminta pertanggungjawaban atas perbuatan mereka di dunia. 33. Usai menjelaskan kuasa-Nya membinasakan para pendurhaka, Allah lantas menjelaskan tanda kekuasaan-Nya di bumi. Dan suatu tanda kebesaran dan kekuasaan Allah bagi mereka adalah bumi yang mati atau tandus sehingga tidak bisa ditumbuhi tanaman, lalu kami hidupkan bumi itu dengan air hujan dan kami keluarkan darinya biji-bijian, maka dari biji-bijian itu mereka makan untuk menjamin kelangsungan hidup dan memperoleh kekuatan."
  }
]