[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan petunjuk kepada orang-orang musyrik atas kuasa Allah dalam membangkitkan dan mengumpulkan makhluk adalah bumi yang mati ini yang kosong dari tanaman, lalu Kami menghidupkannya dengan menurunkan hujan dan darinya Kami mengeluarkan berbagai macam bentuk tanaman yang dimakaan oleh manusia dan hewan-hewan. dan siapa yang kuasa menghidupkan bumi dengan tumbuhan, dia juga pasti kuasa menghidupkan manusia setelah kematian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "33. Salah satu bukti bagi orang-orang yang mendustakan kebangkitan bahwa kebangkitan itu adalah hak yaitu bumi yang kering kerontang ini. Kami menurunkan hujan kepadanya dari langit, lalu dengan hujan itu Kami menumbuhkan berbagai macam tanaman, dan darinya Kami mengeluarkan berbagai macam biji-bijian untuk dimakan oleh manusia. Allah yang menghidupkan bumi sesudah menurunkan hujan atasnya dan mengeluarkan tanaman Mahakuasa untuk menghidupkan orang-orang mati dan membangkitkan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "33. Tanah yang kering dan tandus, tidak ditumbuhi tanaman dan rerumputan, Allah hidupkan dengan berbagai tumbuhan dan biji-bijian setelah Allah menurunkan air hujan kepadanya. Ini merupakan perumpamaan yang menunjukkan kekuasaan Allah untuk membangkitkan makhluk setelah kematiannya; ini adalah tanda bagi orang yang mencermati dan mengambil ibrah; Yang Maha Menghidupkan tanah setelah mati, juga berkuasa untuk menghidupkan makhluk setelah kematiannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "33. وَءَايَةٌ لَّهُمُ الْأَرْضُ الْمَيْتَةُ أَحْيَيْنٰهَا وَأَخْرَجْنَا مِنْهَا حَبًّا فَمِنْهُ يَأْكُلُونَ (Dan suatu tanda (kekuasaan Allah yang besar) bagi mereka adalah bumi yang mati. Kami hidupkan bumi itu dan Kami keluarkan dari padanya biji-bijian, maka daripadanya mereka makan) Dan biji-bijian adalah makanan yang paling banyak mereka makan, dan paling banyak menopang kehidupan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "33. Ayat adalah tanda-tanda yang menunjukkan mereka kepada kekuasaan Kami atas pembangkitan (yaitu dalil) berupa bumi yang mati atau gersang yang tidak memiliki tumbuhan apapun lalu kami menghidupkannya dengan air dan menumbuhkannya. Kami juga mengeluarkan biji-bijian yang dapat dimakan seperti gandum, jerawut dan lain-lain. Melalui biji-bijian ini mereka bisa hidup dan makan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Suatu tanda bagi mereka} tanda bagi mereka yang menunjukkan bahwa sesungguhnya Allah membangkitkan orang-orang mati {yaitu bumi yang mati itu Kami menghidupkannya dan mengeluarkan darinya biji-bijian kemudian dari biji-bijian itu mereka makan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "33. maksudnya, “dan suatu tanda bagi mereka,” atas (adanya) kebangkitan, kehidupan sesudah mati dan menghadap kepada Allah untuk menerima pembalasan atas amal-amal perbuatan, adalah “bumi yang mati,” ini, dimana Allah menurunkan hujan kepadanya lalu menghidupkannya kembali sesudah sebelumnya mati, “dan kami keluarkan dari padanya biji-bijian, maka dari padanya mereka makan,” dari seluruh jenis tanaman dan dari seluruh jenis tumbuh-tumbuhan yang dimakan oleh hewan-hewan ternak kalian."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 33: Dan sebagian dari tanda-tanda bagi orang-orang yang mendustakan, yang menunjukkan atas kekuasaan Kami adalah urusan menghidupkan yang mati; Dan bahwasanya bumi ini asalnya adalah mati, maka jika Kami turunkan atasnya air, jadilah ia hidup dengan mengeluarkan tumbuh-tumbuhan, biji-bijian yang dikonsumsi oleh manusia; Maka Allah Maha Kuasa untuk menghidupkan bumi ini dari kematiannya, begitu pula dalam urusan kebangkitan kalian setelah kematian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang menunjukkan benarnya kebangkitan dan akan dihadapkannya manusia di hadapan Allah Ta’ala untuk diberi-Nya balasan terhadap amal mereka. Dengan menurunkan air hujan kepadanya, lalu hiduplah bumi itu setelah matinya. Seperti beras dan gandum."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 33",
    "description": "Usai menjelaskan kuasa-Nya membinasakan para pendurhaka, Allah lantas menjelaskan tanda kekuasaan-Nya di bumi. Dan suatu tanda kebesaran dan kekuasaan Allah bagi mereka adalah bumi yang mati atau tandus sehingga tidak bisa ditumbuhi tanaman, lalu kami hidupkan bumi itu dengan air hujan dan kami keluarkan darinya biji-bijian, maka dari biji-bijian itu mereka makan untuk menjamin kelangsungan hidup dan memperoleh kekuatan. 34. Dan di antara bukti kuasa kami di bumi adalah bahwa kami jadikan padanya kebun-kebun yang dapat ditanami berbagai tanaman penghasil bahan makanan, seperti kurma dan anggur, dan kami pun pancarkan padanya beberapa mata air yang mengalir menjadi sungai-sungai yang sangat diperlukan bagi kehidupan di bumi."
  }
]