[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kami menubuhkan di bumi ini kebun-kebun kurma dan anggur dan Kami mengalirkan mata air yang menyiraminya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "34. Kami menjadikan bumi yang disiram hujan itu menjadi kebun-kebun kurma dan anggur, Kami memancarkan mata air di sana untuk mengairinya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "34-35. Dan di bumi, Allah menciptakan kebun-kebun dari berbagai jenis kurma, anggur, dan lain sebagainya. Dan Allah memancarkan mata air pada kebun-kebun itu untuk menyiraminya, dan agar mereka dapat menikmati buah-buahannya yang lezat. Itu semua merupakan rahmat dan kenikmatan dari Allah bagi mereka; buah-buahan dengan berbagai jenisnya itu tidak muncul dari hasil tangan mereka, maka hendaklah mereka bersyukur kepada Allah dengan memuji dan beriman kepada-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "34. Kami menjadikan kebun-kebun kurma dan anggur. Kami juga membukakan dan memancarkan mata-mata air yang memancar darinya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami menjadikan padanya kebun-kebun} kebun-kebun {kurma dan anggur, serta Kami pancarkan padanya} Kami pancarkan padanya {beberapa mata air"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "34 “dan kami jadikan padanya,” yakni, pada bumi (tanah) yang kering itu, “kebun-kebun,” artinya, kebun-kebun yang penuh dengan banyak pepohonan, terutama pohon kurma dan anggur yang keduanya merupakan pohon yang paling berharga, “dan kami pancarkan padanya,” maksudnya, pada bumi tersebut “beberapa mata air,” lalu kami jadikan beraneka pohon, pohon kurma dan pohon anggur disana."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 34: Kemudian Allah jadikan pada bumi itu setelah diturunkannya air hujan: kebun-kebun kurma dan juga anggur, dan juga padanya terdapat mata air yang dimanfaatkan untuk minum dan untuk bertani."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 34",
    "description": "Dan di antara bukti kuasa kami di bumi adalah bahwa kami jadikan padanya kebun-kebun yang dapat ditanami berbagai tanaman penghasil bahan makanan, seperti kurma dan anggur, dan kami pun pancarkan padanya beberapa mata air yang mengalir menjadi sungai-sungai yang sangat diperlukan bagi kehidupan di bumi. 35. Allah menciptakan dan menganugerahkan semua itu kepada manusia agar mereka dapat makan dari buahnya dan menikmati dari hasil usaha tangan mereka. Maka mengapa mereka tidak bersyukur kepada-Nya' mengingkari nikmat adalah sikap yang tidak pantas bagi orang yang berakal."
  }
]