[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Semua itu adalah agar manusai makan dari buah-bbuahnya, dan hal itu tidak lain kecuali karena rahmat Allah kepada mereka dan bukan karena usaha dan upaya mereka, bukan pula dengan kekuatan dan daya mereka. maka mengapa mereka tidak bersyukur kepada Allah atas nimat-nikmatnya yang dia limpahkan kepada mereka yang tidak terhitung dan tak terhinggga?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "35. Agar manusia makan dari buah kebun-kebun itu apa yang Allah limpahkan kepada mereka sebagai kenikmatan tanpa mereka melakukan usaha yang berarti padanya. Tidakkah mereka mensyukuri Allah yang telah memberi mereka semua itu sebagai karunia dari-Nya dan rahmat kepada mereka dengan menyembah-Nya semata dan beriman kepada rasul-rasul-Nya?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "35. لِيَأْكُلُوا۟ مِن ثَمَرِهِۦ (supaya mereka dapat makan dari buahnya) Yakni buah-buahan dari kebun-kebun dan pohon kurma itu. وَمَا عَمِلَتْهُ أَيْدِيهِمْ ۖ(dan dari apa yang diusahakan oleh tangan mereka) Yakni agar mereka dapat memakan buah dari kebun itu dan dapat makan dari apa yang dihasilkan oleh tangan mereka seperti sari buah, sari kurma, dan lain sebagainya. Pendapat lain mengatakan maknanya adalah agar mereka dapat memakan buah dari kebun itu, padahal mereka tidak mengusahakan apapun, sebab pada hakikatnya yang mengusahakan adalah Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "35. Kami melakukan itu supaya manusia bisa memakan buah-buahan dari tanaman dan pohon-pohon yang ada di kebun-kebun itu. Mereka juga bisa memakan sesuatu yang diproduksi oleh tangan-tangan mereka seperti jus, sirup dan lain.lain. Apakah mereka tidak bersyukur kepada Allah atas nikmat-nikmat ini?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Agar mereka makan dari buahnya, dan apa yang dibuat tangan mereka. Apakah mereka tidak bersyukur"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "35 “supaya mereka dapat makan dari buahnya,” sebagai makanan pokok, buah-buahan, penyedap makanan, dan kelezatan, “dan” sesungguhnya buah-buahan itu “dari apa,” yang diusahakan “oleh tangan mereka,” mereka sama sekali tidak mempunyai andil dalam menciptakan ataupun membuatnya. Itu semua sesungguhnya ciptaan Allah yang Mahabijaksana dan pemberi rizki yang terbaik. Dan juga, tidak dilakukan oleh tangan mereka dalam bentuk memasaknya di atas api atau lainnya, melainkan Allah-lah yang mengadakan buah-buahan itu, yang tidak perlu dimasak atau diapakan saja, melainkan langsung diambil dari pohonnya lalau bisa dimakan saat itu juga. “maka mengapakah mereka tidak bersyukur” kepada yang telah melimpahkan berbagai nikmat ini dan mencurahkan bagian dari kemurahan dan karuniaNYa kepada mereka hingga permasalahan agama dan dunia mereka menjadi baik? Tidakkah yang telah menghidupkan tanah setelah kematiannya (kekeringannya) lalu menumbuhkan padanya berbagai tanaman dan pepohonan, meletakkan pada rasa lezat buah-buahan dan mengeluarkan benih-benih baru di dahan-dahannya serta memancarkan dari tanah yang kering lagi mati beberapa sumber air, maka bukankan itu bukti Allah Kuasa untuk menghidupkan kembali orang-orang yang sudah mati?! Ya, sesungguhnya Dia kuasa atas segala sesuatu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 35: Allah menjelaskan dalam urusan penciptaan kebun-kebun ini, yaitu kebun kurma dan anggur, serta mata air untuk dikonsumsi oleh manusia beserta buah-buahannya, di mana mereka tidaklah menciptakannya; Akan tetapi Allah lah yang menciptakannya, maka selama urusannya demikian, wajib bagi mereka untuk bersyukur atas kenikmatan yang agung."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kata “Maa” di ayat tersebut bisa juga diartikan maa nafiyah yang berarti tidak. Sehingga artinya, “Padahal bukan dari hasil usaha tangan mereka.” Bahkan hal itu merupakan tindakan dari Tuhan Yang Mahabijaksana, tindakan dari sebaik-baik pemberi rezeki. Mereka tidak perlu mematangkan buah-buahan itu, bahkan Allah yang mematangkannya sehingga mereka bisa langsung memakannya. Kepada Tuhan yang memberikan nikmat-nikmat ini kepada mereka, melimpahkan kemurahan dan ihsan-Nya, di mana dengannya urusan agama dan dunia mereka menjadi baik."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 35",
    "description": "Allah menciptakan dan menganugerahkan semua itu kepada manusia agar mereka dapat makan dari buahnya dan menikmati dari hasil usaha tangan mereka. Maka mengapa mereka tidak bersyukur kepada-Nya' mengingkari nikmat adalah sikap yang tidak pantas bagi orang yang berakal. 36. Mahasuci Allah dari sifat yang tidak layak bagi-Nya, dialah yang telah menciptakan semuanya berpasang-pasangan, baik dari apa yang ditumbuhkan oleh bumi dan dari diri mereka sendiri, yaitu keturunan nabi adam dari jenis laki-laki dan perempuan, maupun dari apa yang tidak mereka ketahui dari semua ciptaan Allah yang terbentang di alam semesta."
  }
]