[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maha suci Allah yang maha agung yang telah menciptakan berbagai macam makhluk seluruhnya meliputi berbagai macam tanaman di bumi ini, manusia, baik laki-laki maupun perempuan, dan makhluk-makhluk lainnya yang tidak mereka ketahui hanya Allah yang menciptakan sehinggga tidak patut ada selainnya yang dipersekutukan denganNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "36. Mahasuci Allah lagi Mahatinggi yang telah menciptakan berbagai jenis tanaman dan buah-buahan, yang telah menciptakan manusia laki-laki dan perempuan dan yang telah menciptakan makhluk-makhluk lainnya yang tidak manusia ketahui di darat, laut dan lainnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "36. Maha Suci Allah Yang Esa dalam menciptakan berbagai macam jenis tanaman yang tumbuh di bumi, manusia yang laki-laki dan perempuan, dan makhluk-makhluk lain yang tidak mereka ketahui."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "36. سُبْحٰنَ الَّذِى خَلَقَ الْأَزْوٰجَ كُلَّهَا (Maha Suci Tuhan yang telah menciptakan pasangan-pasangan semuanya) Makna (الأزواج) yakni dari segala jenis, sebab dari setiap jenis seperti kurma memiliki warna, rasa, dan bentuk yang berbeda-beda. Namun pendapat lain mengatakan makna yang benar dari kata (الأزواج) adalah jenis jantan dan betina dari setiap tumbuhan dan hewan. وَمِنْ أَنفُسِهِمْ (dan dari diri mereka) Yakni Allah juga menciptakan pasangan-pasangan dari golongan mereka, yakni laki-laki dan perempuan dari golongan manusia. وَمِمَّا لَا يَعْلَمُونَ (maupun dari apa yang tidak mereka ketahui) Seperti jenis-jenis yang Allah ciptakan yang ada di daratan dan di lautan, di langit maupun di bumi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "36. Maha suci Allah dari sesuatu yang tidak pantas. Dialah Dzat yang menciptakan beraneka ragam jenis sesuatu yang berbeda-beda yang ditumbuhkan kan oleh bumi berupa tanaman dan pohon-pohonan. Dia juga menciptakan pasangan dari diri mereka yaitu golongan laki-laki dan perempuan dari anak cucu Adam dan setiap sesuatu dari berbagai jenis makhluk yang mengagumkan serta ciptaan di daratan maupun lautan, serta di langit maupun bumi."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maha suci Dzat yang telah menciptakan semuanya berpasang-pasangan} beragam {baik dari apa yang ditumbuhkan oleh bumi dan dari diri mereka sendiri maupun dari apa yang tidak mereka ketahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "36. “Mahasuci Allah yang telah menciptakan pasangan-pasangan semuanya,” yakni, semua jenis makhluk. “baik dari apa yang ditumbuhkan oleh bumi,” dimana Dia aneka-ragamkan berbagai jenis tumbuhan, yang sangat sulit untuk bisa dihitung. “dan dari diri mereka,” Dia meragamkannya juga menjadi laki-laki dan perempuan, Dia beda-bedakan bentuk tubuh, perangai, dan sifat-sifat lahiriyah dan batiniyah mereka, “maupun dari apa yang tidak mereka ketahui,” dari berbagai mahkluk yang telah diciptakan dan alpa dari pengetahuan kita, dan juga yang belum diciptakan. Maka Mahasuci Allah dari sekutu, tandingan, penolong, pendukung atau istri, anak atau yang sama denganNya, serupa atau semisal denganNYa dalam sifat-sifat kesempurnaanNya dan sifat-sifat keagunganNYa, atau tidak mampu melakukan sesuatu yang dikehendakiNya. (maha suci Allah dari semua kekurangan itu)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 36: Kemudian Allah memuji atas Dzatnya, Allah Maha Suci dan membersihkan dimana Allah yang menciptakan makhluk semuanya, yang menciptakan segala sesuatu beraneka ragam dan saling berkesesuaian dengan kesempurnaan satu sama lain. Allah menciptakan apa yang tumbuh dari bumi yaitu berupa pepohonan, tumbuh-tumbuhan yang beraneka ragam serta Allah menciptakan manusia berpasang-pasangan laki-laki dan wanita. Allah juga menciptakan kelompok-kelompok yang berbondong-bondong yang banyak, dimana manusia tidak mengetahuinya dan nampak baginya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mahasuci Dia dari adanya sekutu, pembantu, istri, anak, tandingan dan adanya serupa. Sebagaimana yang kita saksikan, beraneka macam dan berpasang-pasangan pepohonan yang tumbuh dari bumi. Seperti laki-laki dan perempuan. Berupa makhluk-makhluk yang menakjubkan dan asing bagi kita."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 36",
    "description": "Mahasuci Allah dari sifat yang tidak layak bagi-Nya, dialah yang telah menciptakan semuanya berpasang-pasangan, baik dari apa yang ditumbuhkan oleh bumi dan dari diri mereka sendiri, yaitu keturunan nabi adam dari jenis laki-laki dan perempuan, maupun dari apa yang tidak mereka ketahui dari semua ciptaan Allah yang terbentang di alam semesta. 37. Dan suatu tanda kebesaran Allah bagi mereka adalah datangnya waktu malam. Ketika malam tiba, kami tanggalkan siang dari malam itu, maka seketika itu mereka berada dalam kegelapan malam."
  }
]