[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tanda yang menunjukan tauhid Allah dan kesempurnaan kuasanya adalah malam darinya kami mencabut siang sehingga manusia berada dalam kegelapan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "37. Bukti bagi manusia terkait keesaan Allah adalah bahwa Kami melenyapkan cahaya dengan perginya siang dan datangnya malam saat Kami menarik siang darinya, Kami mendatangkan kegelapan sesudah kepergian siang, dan kemudian manusia masuk ke dalam kegelapan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "37. Terdapat tanda bagi manusia yang menunjukkan kekuasaan Allah, yaitu malam ketika terlepas dari siang, ketika itu manusia akan berada dalam gelap gulita, agar mereka dapat tidur dan beristirahat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "37. وَءَايَةٌ لَّهُمُ الَّيْلُ نَسْلَخُ مِنْهُ النَّهَارَ (Dan suatu tanda (kekuasaan Allah yang besar) bagi mereka adalah malam; Kami tanggalkan siang dari malam itu) Yakni itu merupakan tanda yang menunjukkan keesaan, kekuasaan, dan ketuhanan Allah. Makna (السلخ) yakni cahaya yang mulai sirna dan datangnya kegelapan. فَإِذَا هُم مُّظْلِمُونَ (maka dengan serta merta mereka berada dalam kegelapan) Yakni mereka memasuki kegelapan dengan tiba-tiba."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "37. Dalil lain tentang kekuasaan dan keesaan Allah adalah bahwa sesungguhnya Kami menanggalkan cahaya siang dari malam. As-Salkhu adalah hilangnya cahaya dan munculnya kegelapan, maka saat itu mereka dengan seketika memasuki kegelapan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan tanda bagi mereka yaitu malam. Kami memisahkan} Kami memisahkan dan membedakannya {siang dari malam. Maka seketika itu mereka (dalam) kegelapan} masuk dalam kegelapan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "37. maksudnya, “dan satu tanda bagi mereka” yang membuktikan terjadinya kehendak Allah, kesempurnaan kuasaNya dan bahwa Dia akan menghidupkan kembali orang-orang yang sudah mati setelah kematian mereka, adalah “malam; dimana kami tinggalkan siang dan malam itu.” Artinya kami hapus cahaya besar yang telah meliputi bumi dan menggantikannya dengan kegelapan, dan menempatkan kegelapan itu pada tempat cahaya, “maka serta mereka dengan kegelapan,”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 37: Allah menjelaskan tanda-tanda lain bagi manusia untuk menunjukkan keesaan-Nya dan kekuasaan-Nya dalam membangkitkan manusia : yaitu malam yang memisahkan antara siangnya yang telah berlalu darinya; maka jika telah datang gelap, maka akan datang pula terang. Maha suci Allah yang menciptakan manusia berpasang-pasangan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni tanda yang menunjukkan berlakunya kehendak Allah, sempurnanya kekuasaan-Nya, dan Dia akan menghidupkan orang-orang yang telah mati. Suasana terang yang mengena kepada sebagian bumi diganti oleh kegelapan. Demikian pula suasana gelap yang mengena sebagian bumi digantikan oleh terang dengan terbitnya matahari, lalu menyinari berbagai penjuru bumi, dan manusia dapat bertebaran untuk mencari penghidupan dan mengerjakan hal yang bermaslahat bagi mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 37",
    "description": "Dan suatu tanda kebesaran Allah bagi mereka adalah datangnya waktu malam. Ketika malam tiba, kami tanggalkan siang dari malam itu, maka seketika itu mereka berada dalam kegelapan malam. 38. Dan di antara tanda kuasa-Nya adalah bahwa matahari berjalan di tempat peredarannya yang telah ditentukan dengan tertib menurut kehendak Allah dan sedikit pun tidak menyimpang. Demikianlah ketetap-an Allah yang mahaperkasa, maha mengetahui dengan ilmu-Nya yang meliputi seluruh makhluk."
  }
]