[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tanda lain bagi mereka adalah matahari yang beredar pada orbitnya, Allah taala telah menetapkannya sehingga ia tidak melampauinya dan tidak menyimpang darinya. yang demikian itu merupakan pengaturan dari Allah yang maha perkasa, yang tidak dikalahkan lagi maha menggetahui yang tidak ada sesuatupun yang samar baginya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "38. Bukti keesaan Allah adalah matahari yang beredar dalam orbit yang Allah ketahui kadarnya, tanpa bisa dilampauinya. Penentuan itu adalah penentuan Allah yang Maha Perkasa yang tidak dikalahkan oleh siapa pun, Maha mengetahui yang tidak ada sesuatu pun yang samar bagi-Nya terkait urusan-urusan makhluk-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "38. Dan tanda lain bagi manusia yang menunjukkan kekuasaan dan ilmu Allah, yaitu matahari yang bergerak pada orbit yang telah Allah tetapkan baginya, ia tidak akan keluar atau menyelisihi orbitnya. Pergerakan matahari yang teratur itu merupakan perhitungan Allah Yang Maha Perkasa yang tidak terkalahkan dalam kuasa-Nya, dan Maha Mengetahui, tidak ada yang tersembunyi dari-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "38. وَالشَّمْسُ تَجْرِى لِمُسْتَقَرٍّ لَّهَا ۚ (dan matahari berjalan ditempat peredarannya) Yakni ini merupakan tanda kekuasaan Allah yang lain. Makna (مستقرها) yakni batas puncak pada musim panas dan batas paling rendah pada musim dingin. Dan pendapat lain mengatakan maknanya adalah tempat berdiamnya adalah di bawah ‘Arsy."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "38. Dan dengan cepat matahari beredar di tempat peredarannya sampai akhir tempat beredarnya di musim panas dan musim dingin. Peredaran itu adalah takdir Dzat yang Maha Kuat, Maha Perkasa dan Maha Mengetahui setiap sesuatu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan matahari yang berjalan di tempat peredarannya. Demikianlah ketetapan Dzat Yang Maha perkasa lagi Maha Mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "38. dan demikian pula kami menghilangkan kegelapan yang telah menutupi dan meliputi mereka, kami terbitkan matahari lalu ia menerangi seluruh penjuru (bumi), dan manusiapun bertebaran untuk kepentingan hidup dan maslahat hidup mereka. Maka dari itu Allah berfirman, “dan matahari berjalan di tempat peredarannya.” Maksudnya, selalu berputar pada pusat orbitnya yang telah ditetapkan oleh Allah, ia tidak akan menyalahinya dan tidak pula menyimpang darinya, dan matahari pun tidak mempunyai kemampuan mengatur dirinya dan tidak pula bisa menolak Kuasa Allah. “demikianlah ketetapan yang Mahaperkasa,” yang dengan keperkasaanNYa, dia mengendalikan semua makhluk yang begitu besar ini dengan pengendalian yang paling sempurna dan aturan yang baik , “lagi Mahamengetahui,” yang dengan ilmu pengetahuanNya Dia menjadikan makhluk agung ini sebagai maslahat bagi hamba-hambaNya dan manfaat bagi mereka dalam urusan agama dan dunia mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 38: Dan sebagian dari tanda-tanda kekuasaan Allah: yaitu matahari yang beredar sesuai dengan aturan Allah. dan ketahuilah bahwasanya ini semua adalah takdir Allah yang mampu atas segala sesuatu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang ditentukan Allah, tidak melewatinya dan tidak kurang darinya. Ia tidak dapat mengatur dirinya dan tidak durhaka kepada perintah Allah. Dengan keperkasaan-Nya Dia mengatur makhluk-makhluk yang besar. Dengan ilmu-Nya, Dia menjadikan matahari untuk maslahat hamba dan manfaat bagi agama mereka dan dunianya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 38",
    "description": "Dan di antara tanda kuasa-Nya adalah bahwa matahari berjalan di tempat peredarannya yang telah ditentukan dengan tertib menurut kehendak Allah dan sedikit pun tidak menyimpang. Demikianlah ketetap-an Allah yang mahaperkasa, maha mengetahui dengan ilmu-Nya yang meliputi seluruh makhluk. 39. Dan telah kami tetapkan pula jarak-jarak tertentu sebagai tempat peredaran bagi bulan, sehingga setiap saat jarak tersebut mengalami perubahan. Sesampainya ke tempat peredaran yang terakhir, kembalilah ia seperti bentuk tandan yang tua. Mula-Mula penampakan bulan muncul dalam keadaan kecil dan cahaya yang lemah, beralih menjadi bulan sabit dengan sinar yang terang, berubah menjadi bulan purnama, kemudian perlahan kembali mengecil dan kembali ke bentuk semula."
  }
]