[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Juga rembulan adalah tanda kebesaran Allah pada makhluknya, Kami menetapkan sebuah manzilla (possi) untuknya setiap malamnya, mulai terlihat dalam bentuk hilal (bulan sabit) yang kecil sehingg ia sempurna membentuk rembulan yang bulat kemudian ia kembali mengecil menjadi seperi tanda kurma yang melengkung yang ketipisan, kelengkung, dan kekuningannya, karena usianya yang tua dan keringnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "39. Bukti yang menunjukkan keesaan Allah adalah rembulan ini yang telah Kami tentukan peredarannya setiap malamnya. Ia mulai terlihat tipis kemudian nampak besar kemudian kembali tipis sehingga ia menjadi seperti tandan kurma tanpa buah yang sudah mengering, dalam keringkihannya, merunduknya, warnanya yang menguning dan usianya yang tua."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "39. Bulan juga merupakan tanda agung lainnya, tentang penciptaan dan posisinya setiap malam; pertama-tama ia muncul dalam bentuk yang kecil, kemudian sedikit demi sedikit ia membesar hingga menjadi bulan yang bulat sempurna, lalu ia kembali menipis dan melengkung seperti tandan kurma yang menua."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "39. وَالْقَمَرَ قَدَّرْنٰهُ مَنَازِلَ (Dan telah Kami tetapkan bagi bulan manzilah-manzilah) Makna (المنازل) adalah dua puluh delapan posisi bulan, setiap malam terdapat posisi tersendiri. Apabila bulan telah mencapai posisinya yang paling akhir maka ia akan kembali kepada posisi pertamanya. حَتَّىٰ عَادَ كَالْعُرْجُونِ الْقَدِيمِ (sehingga (setelah dia sampai ke manzilah yang terakhir) kembalilah dia sebagai bentuk tandan yang tua) Yakni bulan beredar pada posisi-posisinya, dan apabila telah mencapai posisi paling akhir, ia mengecil dan membentuk bulan sabit sehingga berbentuk seperti tandan yang tua. Makna (العرجون) yakni pelepah yang menjadi tempat keluarnya tandan, ia berwarna kuning dan lebar dan dilengkungkan dan dipotong cabang-cabangnya serta dibiarkan di pohon sampai mengering."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "39. Kami juga menetapkan pergerakan bulan di tempat-tempat kemunculannya setiap hari dan setiap malam di tiap bulannya. Tempat-tempat itu sebanyak 28 dan di akhir tempatnya bulan itu berubah seperti seikat asam ketika mengering, membentuk lengkungan dan menguning."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan bulan, Kami menetapkan baginya tempat-tempat peredaran} Kami menetapkan peredarannya pada tempat-tempat dimana dia bisa beredar dari satu tempat ke tempat yang lain {sehingga bulan kembali seperti bentuk tandan yang tua} seperti pelepah kurma yang melengkung lagi kering"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "39. “dan telah Kami tetapkan bagi bulan garis-garis peredaran,” yang ia tempati. Pada setiap malam ia menempati saatu garis darinya, “sehingga,” ia menjadi kecil sekali dan kembalilah dia “sebagai bentuk tandan yang tua,” maksudnya, seperti tandan buah kurma yang karena ketuaannya ia menjadi kering, makin kecil dan melengkung. Kemudian, sesudah itu bulan itu bertambah besar sedikit-sedikit hingga cahayanya sempurna dan sinarnya makin merata."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 39: Dan sebagian dari ayatnya: yaitu bulan yang Allah jadikan sebagai tanda bagi waktu; yang turun pada setiap malam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya, bulan itu pada awalnya kecil berbentuk sabit, kemudian setelah menempati manzilah (posisi)-manzilah, dia menjadi purnama, kemudian pada manzilah terakhir kelihatan seperti tandan kering yang melengkung."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 39",
    "description": "Dan telah kami tetapkan pula jarak-jarak tertentu sebagai tempat peredaran bagi bulan, sehingga setiap saat jarak tersebut mengalami perubahan. Sesampainya ke tempat peredaran yang terakhir, kembalilah ia seperti bentuk tandan yang tua. Mula-Mula penampakan bulan muncul dalam keadaan kecil dan cahaya yang lemah, beralih menjadi bulan sabit dengan sinar yang terang, berubah menjadi bulan purnama, kemudian perlahan kembali mengecil dan kembali ke bentuk semula. 40. Demikianlah sunatullah yang telah dia tetapkan. Tidaklah mungkin bagi matahari mengejar bulan sehingga keduanya bertabrakan, dan malam pun tidak dapat mendahului siang. Masing-masing beredar pada garis edarnya yang telah digariskan untuknya."
  }
]