[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "2-4. Allah bersumpah dengan al-Qur’an yang muhkam yang di dalamnya terkandung hokum-hukum, hikmah-hikmah dan hujjah-hujjah, bahwa sesungguhnya kamu (wahai Rasul) benar-benar termasuk orang-orang yang diutus oleh Allah dengan wahyuNya kepada hamba-hambaNya, yang berjalan di atas jalan lurus lagi seimbang, yaitu Islam."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4-5. Berdasarkan manhaj yang lurus dan syariat yang kokoh. Manhaj yang lurus dan syariat yang kokoh ini diturunkan dari Rabbmu Yang Mahaperkasa, yang tidak seorang pun mengalahkannya, Maha Penyayang kepada hamba-hamba-Nya yang Mukmin."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. عَلَىٰ صِرٰطٍ مُّسْتَقِيمٍ ((yang berada) diatas jalan yang lurus) Yakni jalan yang selalu lurus tak berbelok yang dapat mengantarkan ke tujuan. Yakni kamu hai Muhammad berada di jalan para nabi sebelummu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Di atas jalan lurus yang tidak ada penyimpangan di dalamnya, yaitu jalannya para nabi terdahulu yang membimbing menuju surga dan keberhasilan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "(yang berada) di atas jalan yang lurus} aturan dan agama yang lurus, tidak ada bengkokan di dalamnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4. Kemudian Allah memberitakan tentang sifat Rasulullah paling menonjol yang membuktikan kerasulannya, yaitu bahwasanya dia “di atas jalan yang lurus,” yakni, jalan lurus yang dapat mengantarkan kepada Allah dan kepada negeri kemuliaanNYa. Jalan yang lurus itu meliputi amal-amal, yaitu amal-amal shalih yang dapat memperbaiki hati, badan, dunia dan akhirat, serta akhlak yang utama yang dapat menyucikan jiwa, membersihkan kalbu, dan melipatgandakan pahala. Inilah jalan yang lurus yang merupakan ciri (sifat) Rasulullah dan ciri agama yang dibawanya. Perhatikanlah keagungan al-Quran Suci ini, bagaimana ia memadukan antara sumpah dengan jenis sumpah yang paling mulia dan dengan yang disumpahkan yang juga termulia. Berita dari Allah itu sendiri sudah cukup, akan tetapi Allah menegakkan dalil-dalil yang sangat jelas dan argument-argumen yang konkret pada bahasan ini yang menunjukkan kebenaran (kelegalan) apa yang Dia sumpahkan atasnya, yaitu kerasulan RasulNya, sebagaimana telah kita utarakan dan kita singgung secara sederhana agar dijadikan pegangan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 4: 2-4. Surat ini diawali dengan sumpah Allah terhadap Al Qur’an Al Adziem, yang muhkam atas nasihat, serta syariat-syariat dan adab-adab yang terpuji di dalamnya. Dan dengan kebenaran Al Qur’an ini, maka sunggu engkau wahai Nabi Allah, adalah sebagian dari hamba Allah yang diutus. Engkau adalah termasuk orang yang koko di atas jalan yang terang yaitu jalan islam. Ini adalah persaksian dari Allah atas Muhammad ﷺ atas syariat yang agung."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala memberitahukan sifat yang paling besar bagi Rasulullah shallallahu 'alaihi wa sallam yang menunjukkan kerasulan Beliau, yaitu bahwa Beliau berada di atas jalan yang lurus, yang dapat menyampaikan kepada Allah dan kepada surga-Nya. Jalan yang lurus tersebut mencakup ilmu (pengetahuan terhadap yang hak) dan amal, di mana amal tersebut adalah amal yang saleh; yang memperbaiki hati dan badan, dunia dan akhirat. Termasuk ke dalam amal saleh adalah akhlak yang utama yang membersihkan jiwa dan menyucikan hati serta mengembangkan pahala. Jalan yang lurus merupakan sifat bagi Rasulullah shallallahu 'alaihi wa sallam dan sifat bagi agama yang Beliau bawa. Maka perhatikanlah keagungan Al Qur’an ini, di mana Allah Subhaanahu wa Ta'aala menggabung antara bersumpah dengan sesuatu yang paling mulia dipakai bersumpah dan hal agung yang disumpahkan (yaitu kerasulan Muhammad shallallahu 'alaihi wa sallam). Memang berita Allah saja yang menunjukkan kerasulan Beliau sudah cukup, akan tetapi Dia menegakkan dalil-dalil yang jelas dan bukti-bukti yang nyata di sini untuk menunjukkan kebenaran yang disumpahkan itu serta mengisyaratkan kepada kita untuk mengikuti jalannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 4",
    "description": "Sungguh, engkau berada di atas jalan yang lurus, yakni jalan yang dapat mengantarkan manusia menuju kebahagiaan di dunia dan akhirat. Itulah agama islam (lihat juga: asy-sy'r'/42: 52). 5. Al-qur'an adalah wahyu yang diturunkan oleh Allah yang mahaperkasa, yakni mampu mengalahkan siapa pun dan melaksanakan apa pun yang dia kehendaki; maha penyayang kepada semua hamba-Nya, utamanya kepada mereka yang beriman."
  }
]