[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Masing-masing dari matahari, rembulan, malam dan siang, memiliki waktu yang telah Allah taala tetapkan yang tidak mereka lampaui. Maka tidak mungkin matahari menyusul rembulan lalu ia menghapus cahayanya atau orbit berputarnya berubah. malam juga tidak mungkin mendahului siang, lalu siang masuk ke dalam malam padahal malam belum habis. Masing-masing dari matahari, rembulan, bintang-bintang memiliki garis edar sendiri-sendiri yang padanya mereka berjalan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "40. Bukti-bukti matahari dan rembulan, siang dan malam ditetapkan dengan ketentuan dari Allah, ia tidak akan melampau batas yang sudah ditentukan untuknya. Matahari tidak akan mendahului rembulan untuk merubah perjalanannya atau melenyapkan cahayanya; malam tidak mungkin mengejar siang dan datang sebelum siang selesai. Semua makhluk yang ditundukkan ini dan juga bintang-bintang dan planet-planet lainnya mempunyai orbit edar berdasarkan takdir dan penjagaan dari Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "40. Matahari tidak akan mendapati bulan untuk mengubah peredarannya atau menghilangkan cahayanya, dan malam tidak akan menyusul siang sehingga ia dapat memasukinya sebelum waktunya habis. Matahari, bulan, dan benda langit besar lainnya memiliki orbit yang telah Allah tetapkan, sehingga ia tidak akan keluar atau menyelisihinya. Dengan begitu, alam semesta dan kehidupan menjadi teratur."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "40. لَا الشَّمْسُ يَنۢبَغِى لَهَآ أَن تُدْرِكَ الْقَمَرَ (Tidaklah mungkin bagi matahari mendapatkan bulan) Sebab masing-masing memiliki orbit sendiri, sehingga salah satunya tidak mungkin memasuki orbit yang lain; meski kelihatannya matahari mendahului bulan sekali dalam setiap bulannya. وَلَا الَّيْلُ سَابِقُ النَّهَارِ ۚ( dan malampun tidak dapat mendahului siang) Yakni tidak mendahului dan meninggalkannya, namun ia menggantinya; masing-masing datang pada waktunya dan tidak mungkin mendahului yang lain. وَكُلٌّ(Dan masing-masing) Yakni matahari dan bulan, dan siang dan malam. فِى فَلَكٍ يَسْبَحُونَ(beredar pada garis edarnya) Dan makna (فلك) yakni garis edar yang berbentuk lingkaran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "40. Matahari tidak mungkin mengikuti peredaran bulan sehingga muncul bersama di malam hari. Malam juga tidak bisa mendahului siang sebelum dia berakhir. Matahari, bulan dan bintang masing-masing berada di orbit tertentu yang digunakan untuk beredar dengan mudah saat dilihat oleh mata"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Tidak mungkin bagi matahari untuk mengejar} menyusul {bulan dan tidak pula malam mendahului siang. Masing-masing beredar} beredar {pada garis edarnya} tempat beredar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "40. masing-masing dari matahari, bulan, malam, dan siang telah ditetapkan oleh Allah pada ketetapan yang tidak akan dilampauinya, dan masing-masing mempunyai kekuatan dan waktu tertentu, yang apabila ia ada (muncul) , maka yang lain menjadi tiada. Maka dari itu berfirman, ”tidaklah mungkin bagi matahari mendapatkan bulan,” yaitu yang di dalam kekuasaannya, yaitu malam. Maka tidak mungkin matahari ada di malam hari, “dan malampun tidak dapat mendahului siang,” lalu ia memasukinya sebelum kekuasaannya berakhir, “dan masing-masing,” dari matahari, bulan, dan bintang “beredar pada garis edarnya,” maksudnya, mereka sellau bergerak bolak-balik terus-menerus. Semua ini adalah bukti nyata dan argument yang luar bisa atas keagungan sang pencipta dan keagungan sifat-sifatNya, terutama sifat (kuasa) qudrat, hikmah, dan ilmu pada tempat ini."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 40: Allah menjelaskan keadaan matahari dan bulan dalam semesta dengan berkata: Tidaklah dibenarkan pagi matahari mengikuti bulan begitu juga sebaliknya malam yang mendahului siang. Setiap dari masing-masing beredar sesuai ketetapan dan aturan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sehingga berkumpul bersama dalam satu malam. Sehingga malam tidaklah datang sebelum siang habis. Baik matahari, bulan dan bintang. Ini semua merupakan dalil dan bukti yang nyata yang menunjukkan keagungan Allah Maha Pencipta dan keagungan sifat-sifat-Nya, khususnya sifat kuasa, bijaksana, dan meliputnya pengetahuan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 40",
    "description": "Demikianlah sunatullah yang telah dia tetapkan. Tidaklah mungkin bagi matahari mengejar bulan sehingga keduanya bertabrakan, dan malam pun tidak dapat mendahului siang. Masing-masing beredar pada garis edarnya yang telah digariskan untuknya. 41. Tidak terbatas pada kejadian-kejadian di alam semesta, kekuasaan Allah juga meliputi fenomena di samudera. Dan suatu tanda kebesaran Allah bagi mereka adalah bahwa kami angkut keturunan mereka dan segala macam barang keperluan mereka dalam kapal yang penuh muatan, dari satu kota ke kota lain atau dari satu negeri ke negeri lain."
  }
]