[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dalil dan bukti (lain) bagi mereka yang menunjukan bahwa hanya Allah semata yang berhak disembah yang melimpahkan segala nikmat, adalah bahwa Kami membawa anak-anak adam yang selamat dalam kapal Nuh yang penuh dengan berbagai macam makhluk agar mereka meneruskan kehidupan setelah banjir bandang."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "41. Di antara bukti bagi mereka tentang keesaan Allah dan pemberian nikmat kepada hamba-Nya adalah bahwa Kami mengangkut orang-orang yang selamat dari banjir besar dari anak cucu Adam pada masa Nuh di dalam bahtera yang sarat dengan makhluk-makhluk Allah. Allah mengangkut sepasang makhluk dari setiap jenis di dalam kapal tersebut."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "41. Dan bukti lain bagi manusia yang menunjukkan kekuasaan Allah, bahwa Kami menaikkan orang-orang beriman dari keturunan Nabi Nuh ke atas perahu yang dipenuhi berbagai jenis makhluk hidup. Sehingga Kami menyelamatkan mereka dari banjir besar yang menenggelamkan seluruh permukaan bumi dan membinasakan orang-orang kafir. Itu merupakan kenikmatan, rahmat, dan ibrah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "41. وَءَايَةٌ لَّهُمْ أَنَّا حَمَلْنَا ذُرِّيَّتَهُمْ فِى الْفُلْكِ الْمَشْحُونِ(Dan suatu tanda (kebesaran Allah yang besar) bagi mereka adalah bahwa Kami angkut keturunan mereka dalam bahtera yang penuh muatan) Yakni di atas kapal yang ada di lautan, Allah memberikan kenikmatan ini kepada mereka. Pendapat lain mengatakan maknanya adalah Allah mengangkut nenek moyang mereka di kapal Nabi Nuh."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "41. Dalil lain atas kekuasaan Kami adalah bahwa Kami mengangkut leluhur mereka terdahulu yang merupakan tulang punggung mereka dan anak cucu mereka di atas bahtera yang penuh muatan, yaitu bahtera Nuh AS. Asal Dzurriyah adalah keturunan yang masih kecil, kemudian digunakan untuk keturunan yang kecil maupun besar. Allah juga memberikan nikmat kepada mereka dengan menyebutkan keturunan selain mereka karena sesungguhnya Dialah Dzat yang mengabarkan tentang pemberian nikmat itu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan tanda bagi mereka} tanda bagi mereka {yaitu bahwa Kami mengangkut keturunan mereka} nenek moyang mereka {dalam kapal yang penuh muatan} penuh isi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "41. artinya, dalil untuk mereka dan argument yang membuktikan bahwasannya Allah semata yang berhak disembah adalah karena DIa-lah yang mencurahkan segala nikmat, dan yang Menjauhkan bencana, yang diantara nikmatnya adalah “kami angkut keturunan mereka.” Banyak ahli tafsir mengatakan bahwa yang dimaksud di sini adalah, kakek moyang mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 41: Dan di antara tanda-tanda yang menunjukkan ke-Maha Esaan Allah dan Kuasa-Nya serta rahmat-Nya kepada hamba-Nya : Bahwasanya Allah menyelamatkan anak keturunan Adam agar supaya tidak tenggelam dan membawa mereka ke atas kapal Nuh yang penuh dengan pasang manusia dan hewan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni dalil dan bukti yang menunjukkan bahwa Allah yang berhak diibadahi adalah karena Dia yang mengaruniakan berbagai nikmat kepada manusia dan yang menghindarkan azab, di antaranya adalah apa yang disebutkan dalam ayat di atas. Kata “dzurriyyah”dalam ayat tersebut juga bisa diartikan dengan nenek moyang mereka, yakni Allah Subhaanahu wa Ta'aala yang mengangkut nenek moyang mereka ke dalam kapal Nabi Nuh ‘alaihis salam yang penuh muatan, dan nikmat kepada nenek moyang merupakan nikmat bagi keturunannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 41",
    "description": "Tidak terbatas pada kejadian-kejadian di alam semesta, kekuasaan Allah juga meliputi fenomena di samudera. Dan suatu tanda kebesaran Allah bagi mereka adalah bahwa kami angkut keturunan mereka dan segala macam barang keperluan mereka dalam kapal yang penuh muatan, dari satu kota ke kota lain atau dari satu negeri ke negeri lain. 42. Dan selain itu kami ciptakan juga untuk mereka angkutan lainnya, seperti apa yang mereka kendarai di darat berupa hewan-hewan tung-gangan dan alat-alat angkut pada umumnya (lihat pula: surah an-na'l/16: 8)."
  }
]