[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kami menciptakan untuk orang-orang musyrik itu dan lainnya kapal-kapal seperti kapal nuh dan alat-alat berkendara lainnya yang mereka kendarai dan menyampaikan mereka ke tempat tinggal mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "42. Di antara bukti bagi mereka tentang keesaan Allah dan pemberian nikmat kepada hamba-Nya adalah bahwa Kami menciptakan bagi mereka perahu-perahu seperti bahtera Nuh untuk dinaiki."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "42. Dan Kami menciptakan perahu bagi orang-orang musyrik seperti perahu Nabi Nuh yang diciptakan pertama kali, dan berbagai kendaraan lainnya yang mereka gunakan untuk mengangkut barang mereka dan menjadi alat perpindahan mereka ke tempat lain."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "42. وَخَلَقْنَا لَهُم مِّن مِّثْلِهِۦ مَا يَرْكَبُونَ (dan Kami ciptakan untuk mereka yang akan mereka kendarai seperti bahtera itu) Pendapat mengatakan yang dimaksud adalah unta yang Allah ciptakan bagi mereka untuk mereka tunggangi di daratan, sebagaimana kapal yang mereka kendarai di lautan. Atau ini merupakan isyarat pada mobil, kereta, dan pesawat yang ada sekarang."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "42. Kami juga menciptakan untuk mereka tumpangan serupa yang dapat mereka kendarai yaitu unta, perahu-perahu yang bisa berlayar di lautan, kereta dan pesawat-pesawat modern."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kami menciptakan untuk mereka dari jenis itu} sejenih bahtera nuh {hal lain yang mereka kendarai"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "42. “dan kami ciptakan untuk mereka,” maksudnya, untuk orang-orang yang ada sesudah mereka, “dari yang semisalnya dengannya,” yakni semisal bahtera itu, dalam arti satu jenis dengannya “apa yang mereka kendarai” Di sini Allah mengingatkan akan nikmatNya kepada nenek-nenek moyang, yaitu mereka dimuat di dalam kapal laut. Hal ini adalah karena nikmat yang dikaruniakan kepada mereka, juga merupakan nikmat kepada anak keturunannya kemudian. Masalah ini merupakan permasalahan yang paling rumit bagi saya di dalam ilmu tafsir, karena kebanyakan hal yang dijelaskan oleh para ahli tafsir, yaitu bahwa yang dimaksud “keturunan,” adalah bapak-bapak moyang, dan ini merupakan hal yang tidak biasa di dalam al-qur’an, yaitu mengartikan dzuriyyah (keturunan) dengan bapak-bapak moyang. Sungguh ini mengandung ketidakjelasan dan mengeluarkan kata (kalimat) dari makna asalnya, hal yang sangat dijauhi oleh firman Allah Rabbul ‘Alamin dan kehendakNya untuk memberikan penjelasan dan keterangan kepada hamba-hambaNYa. Ada makna alternative yang lebih baik dari makna diatas, yaitu bahwa yang dimaksud “keturunan” adalah “jenis” dan bahwa mereka adalah diri mereka sendiri, karena mereka berasal dari anak cucu Nabi Adam. Akan tetapi arti semacam ini tidak dibenarkan oleh FirmanNYa, ”dan kami ciptakan untuk mereka semisal apa yang akan mereka kendarai,” jika artinya, dan kami ciptakan dari yang semisal dengan bahtera itu, yakni, untuk mereka yang diajak bicara (mukhatabin) apa yang akan mereka kendarai dari jenis-jenis bahtera. Jika demikian, maka ini adalah pengulangan terhadap makna ayat yang tidak dikehendaki oleh fashahah (kefasihan) al-qur’an. Dan jika arti dari, “dan kami ciptakan untuk mereka yang semisal apa yang mereka kendarai,” adalah unta yang merupakan bahtera darat, maka maknanya menjadi lurus dan jelas; hanya saja masih ada hal lain, yaitu keberadaan ungkapan ini mengandung kerancuan (tasywisy). Sebab, kalau itu yang dimaksud, tentu Allah berfirman, “dan suatu tanda bagi mereka adalah kami angkut mereka dalam bahtera yang penuh muatan, dan kami ciptakan untuk mereka dari yang semisalnya apa yang akan mereka kendarai,” Kalau pada yang pertama disebutkan, “kami angkut keturunan mereka,” sedangkan ini, “kami angkut mereka, maka maknanya tidak jelas kecuali dikatakan; dhamir (kata ganti) “hum” kembali kepada dzurriyah,” dan hanya Allah yang lebih mengetahui akan hakikat yang sebenarnya. Setelah saya sampai pada pembahasan ini dalam penulisan tafsir ini, maka tampak bagi saya suatu makna yang tidak jauh dari maksud Allah, yaitu, bahwa siapa saja yang mengetahui keagungan kitabullah dan uraiannya yang sempurna dari segala sisi tentang perkara-perkara yang sekarang, yang telah lalu dan yang akan datang, dia (menjadi tahu) bahwa sesungguhnya Allah menyebutkan dari setiap maknanya itu yang paling tinggi dan paling sempurna dari keadaannya, sedangkan bahtera merupakan salah satu tanda dan salah satu nikmatNya kepada hamba-hamabNya semenjak Dia mengaruniakannya kepada mereka, dengan mempelajarinya hingga Hari kiamat nanti, dan ia terus ada pada setiap zaman hingga pada zaman orang-orang yang dihadapkan kepada al-qur’an. Setelah Allah berbicara kepada mereka dengan al-qur’an dan menjelaskan perihal bahtera, dan Allah mengetahui bahwa aka nada tanda-tanda (cikal-bakal) bahtera yang lebih besar pada waktu lain selain waktu mereka dan pada zaman lain selain zaman mereka saat Dia mengerjakan kepada mereka cara pembuatan bahtera laut, baik yang menggunakan layar dan mesin, dan bahtera angkasa yang terbang seperti burung diangkasa dan yang serupa dengannya dan berbagai alat-alat transportasi darat, yang merupakan tanda kekuasaan yang besar padanya yang belum pernah ada kecuali pada “keturunan” maka Allah mengingatkan di dalam al-qur’an ini akan salah satu macam yang paling tinggi dari macam-macam tanda-tandanya, seraya berfirman, ”dan suatu tanda bagi mereka adalah kami angkut keturunan mereka dalam bahtera yang penuh muatan,” artinya yang penuh dengan penumpang dan barang bawaan, lalu Allah mengangkut mereka dan menyelamatkan mereka dari musibah karam (tenggelam) dengn cara-cara yang telah diajarkan oleh Allah kepada mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 42: Allah mengabarkan bahwasanya Allah menciptakan bagi siapa yang setelah dari keturunan Adam, semisal dengan keturunan manusia yang menaiki kapal ini di laut, dan Allah ciptakan untuk mereka bumi, unta, kuda, keledai dan transportasi semisal mobil dan pesawat dal selainnya yang dapat dinaiki dan mengantarkan mereka menuju tujuan yang ingin mereka tuju."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni seperti kapal Nabi Nuh, yaitu yang mereka buat dengan tangan mereka berupa kapal yang besar atau yang kecil serta alat pengangkutan umum lainnya dengan pengajaran dari Allah Subhaanahu wa Ta'aala. Dia mengajarkan mereka sebab-sebab tidak tenggelam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 42",
    "description": "Dan selain itu kami ciptakan juga untuk mereka angkutan lainnya, seperti apa yang mereka kendarai di darat berupa hewan-hewan tung-gangan dan alat-alat angkut pada umumnya (lihat pula: surah an-na'l/16: 8). 43. Dan ingatlah, jika kami menghendaki mereka tidak selamat dalam pelayaran laut itu, kami tenggelamkan mereka ke laut dengan datangnya badai atau rusaknya bahtera. Maka ketika itu tidak ada seorang penolong pun bagi mereka dan tidak pula mereka dapat diselamatkan."
  }
]