[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kecuali bila Kami merahmati mereka lalu Kami menyelamatkan mereka dan memberi mereka kenikmatan sampai batas waktu tertentu, dengan harapan mereka kembali dan memperbaiki apa yang mereka lalaikan dahulu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "44. Hanya saja Kami menyayangi mereka dengan menyelamatkan mereka dari penenggelaman agar mereka bisa bersenang-senang hingga masa yang ditentukan, tidak lebih dari itu. Semoga dengan itu mereka mau mengambil pelajaran lalu beriman."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "44. Kecuali jika Kami mengasihi mereka sehingga Kami menyelamatkan mereka dari tenggelam, kemudian Kami memberi mereka kenikmatan hingga waktu tertentu agar mereka dapat kembali kepada Allah dan beriman."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "44. إِلَّا رَحْمَةً مِّنَّا (Tetapi (Kami selamatkan mereka) karena rahmat yang besar dari Kami) Yakni tidak ada yang menyelamatkan mereka, namun terkadang Kami mengizinkan agar mereka dapat diselamatkan sebagai rahmat bagi mereka dari Kami. وَمَتٰعًا(dan untuk memberikan kesenangan hidup) Yakni untuk Kami berikan kenikmatan di kehidupan dunia. إِلَىٰ حِينٍ (sampai kepada suatu zaman) Sampai waktu kematian mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "44. Kecuali jika rahmat Kami menjangkau mereka, maka itu akan menyelamatkan dan menolong serta membuat mereka dapat menikmati kehidupan dengan suka cita sampai waktu tertentu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{kecuali karena rahmat yang besar dari Kami dan kesenangan hidup sampai waktu tertentu} sampai selesai ajal mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "44. “ tetapi karena rahmat yang besar dari kami dan untuk memberikan kesenangan hidup sampai kepada suatu ketika,” yang dimana kami tidak menenggelamkan mereka karena belas-kasih dan untuk memberikan kenikmatan kepada mereka hingga waktu yang telah ditentukan, dengan harapan mereka kembali atau mencari apa-apa yang telah mereka abaikan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 44: Allah menjelaskan bahwa mereka tidak akan mendapati sesuatupun yang dapat menolong mereka selain dari kasih sayang Allah dan kelembutan-Nya kepada mereka dan dengan keadaan mereka, sehingga mereka dapat hidup hingga ajal menjemput mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Agar mereka kembali atau mengejar hal yang telah luput dari mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 44",
    "description": "Mereka tidak akan selamat dari bencana itu melainkan jika kami menghendakinya karena rahmat dan kasih sayang yang besar dari kami dan untuk memberikan kesenangan hidup dengan sarana transportasi tersebut sampai waktu tertentu, selagi mereka tidak melakukan penyimpangan. Ayat ini mengingatkan manusia agar tidak berlaku sombong dan angkuh dalam segala urusan. 45. Meski menyaksikan dengan nyata bukti-bukti kekuasaan Allah dan kemampuan yang Allah berikan kepada manusia untuk membuat sarana transportasi, banyak manusia tetap ingkar dan menyekutukan Allah. Dan apabila dikatakan kepada mereka, 'takutlah kamu akan siksa dunia yang di hadapanmu sebagaimana yang menimpa umat-umat terdahulu, dan azab yang akan datang kelak di akhirat agar kamu mendapat rahmat dari-Nya. '."
  }
]