[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "bila dikatakan kepada orang-orang musyrik ”Takutlah kalian kepada perkara akhirat dan beban-beban beratnya, serta hukuman dan siksa dunia, agar kalian mendapatkan rahmat Allah,” mereka berpaling dan tidak menjawabnya"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "45. Jika dikatakan kepada kaum musyrikin yang menolak untuk beriman, “Berhati-hatilah dengan amalan yang kalian siapkan untuk kehidupan Akhirat beserta kesulitan-kesulitannya yang pasti akan kalian hadapi, berhati-hatilah terhadap dunia yang pergi berlalu, semoga Allah memberikan rahmat-Nya kepada kalian,” mereka tidak mengindahkannya, sebaliknya mereka berpaling tanpa menghiraukan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "45. Dan jika dikatakan kepada orang-orang musyrik yang berpaling itu: “Berhati-hatilah kalian dari siksa dunia dan azab akhirat akibat kekafiran kalian, maka berimanlah kepada Tuhan kalian agar kalian mendapat rahmat dan selamat dari azab,” Maka mereka akan berpaling dan enggan beriman."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "45. وَإِذَا قِيلَ لَهُمُ اتَّقُوا۟ مَا بَيْنَ أَيْدِيكُمْ (Dan apabila dikatakan kepada mereka: “Takutlah kamu akan siksa yang dihadapanmu) Yakni takutlah kalian dari apa yang ada dihadapan kalian berupa bencana dan musibah. وَمَا خَلْفَكُمْ(dan siksa yang akan datang) Dan diantaranya adalah siksa yang ada di akhirat. Yakni jika dikatakan kepada mereka ucapan ini maka mereka akan berpaling."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "45. Jika dikatakan untuk orang-orang musyrik atau kafir itu: “Waspadalah terhadap apa yang ada di depan kalian berupa musibah atau sesuatu yang menimpa umat-umat terdahulu serta sesuatu yang ada di belakang kalian di antaranya adalah sesuatu di akhirat” Maknanya adalah waspadalah terhadap sebab-sebab kehancuran, supaya kalian dikasihi. Jauhilah hal itu. Jawab kata {Idza} dibuang dan sudah dipahami sebagai kalam setelahnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Ketika dikatakan kepada mereka,“Waspadalah terhadap apa yang ada di hadapan kalian} berhati-hatilah terhadap apa yang akan kalian hadapu berupa perkara akhirat, maka bertakwalah {dan apa yang ada di belakang kalian} dan berhati-hatilah terhadap apa yang telah berlalu di belakang kalian berupa perkara dunia, maka jangaanlah meremehkannya {agar kalian mendapat rahmat”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "45. “dan apabila dikatakan kepada mereka, ‘takutlah kamu akan siksa yang dihadapanmu dan siksa yang akan datang,” maksudnya, seperti kondisi di alam barzakh, Hari kiamat dan berbagai hukuman di dunia, “supaya kamu mendapat rahmat,” tapi mereka tetap berpaling darinya, mereka sama sekali tidak peduli, sekalipun berbagai tanda kekuasaan Allah telah datang kepada mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 45: Maka jika dikatakan kepada mereka orang-orang musyrik : Berhati-hatilah kalian dari adzab Allah di dunia dan dari kondisi di akhirat serta hari kiamat; Semoga kalian dirahmati, dan berhasil dari kondisi ini; Mereka berkata : Abaikan ini semua, jangan kalian jawab."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 45",
    "description": "Meski menyaksikan dengan nyata bukti-bukti kekuasaan Allah dan kemampuan yang Allah berikan kepada manusia untuk membuat sarana transportasi, banyak manusia tetap ingkar dan menyekutukan Allah. Dan apabila dikatakan kepada mereka, 'takutlah kamu akan siksa dunia yang di hadapanmu sebagaimana yang menimpa umat-umat terdahulu, dan azab yang akan datang kelak di akhirat agar kamu mendapat rahmat dari-Nya. '46. Dan adapun orang yang ingkar, setiap kali suatu tanda dari tanda-tanda kebesaran dan keesaan tuhan datang kepada mereka melalui para rasul dan ayat Al-Qur'an, mereka selalu berpaling darinya dengan penuh pengingkaran."
  }
]