[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang musyrik itu tidak didatangi sebuah bukti yang nyata dari sisi tuhan mereka untuk membimbing mereka kepada kebenaran dan membuktikan kebenaran rasul, kecuali mereka berpaling darinya dan tidak mengambil manfaat darinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "46. Setiap kali orang-orang musyrikin yang menentang itu didatangi oleh ayat-ayat Allah yang menunjukkan keesaan-Nya dan bahwa hanya Dia yang berhak untuk disembah, mereka selalu berpaling darinya, tidak mengambil pelajaran darinya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "46. Dan tidaklah datang tanda-tanda yang menjelaskan kebenaran bagi mereka dan menunjukkan kepada petunjuk, melainkan mereka akan mengingkari, berpaling, dan tidak mengambil manfaat darinya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "46. إِلَّا كَانُوا۟ عَنْهَا مُعْرِضِينَ (melainkan mereka selalu berpaling daripadanya) Yakni tidaklah datang kepada mereka suatu ayat al-Qur’an melainkan mereka akan berpaling darinya dan tidak mempedulikannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "46. Apa yang disampaikan kepada mereka berupa hujjah dan dalil untuk mengesakan Allah dan membenarkan rasulallah atau ayat Al-qur’an itu (kata min itu untuk menunjukkan keuniversalan sesuatu setelahnya) tidak lain kecuali mereka tolak dengan kasar dan keras."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidak satu pun dari tanda-tanda Tuhan datang kepada mereka, kecuali mereka berpaling darinya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "46. maka dari itu Dia berfirman, ”dan sekali-kali tiada datang kepada mereka suatu tanda dari tanda-tanda (kekuasaan) Rabb mereka, melainkan mereka selalu berpaling darinya,” di dalam penyandaran tanda-tanda (ayat-ayat) kepada Allah terdapat dalil yang menunjukkan kesempurnaan dan kejelasan tanda-tanda tersebut, sebab tidak ada yang lebih hebat darinya. Dan sesungguhnya di antara bentuk pendidikan Allah terhadap hamba-hambaNya adalah Dia menyampaikan kepada mereka tanda-tanda yang dapat mereka jadikan sebagai petunjuk untuk mendapatkan apa-apa yang berguna bagi mereka dalam urusan agama dan dunia mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 46: Telah datang kepada mereka orang-orang musyrik dari tanda-tanda yang menunjukkan atas ke-Maha Esaan Allah, dan telah datang perintah kepada mereka agar mengikuti Rasul ﷺ; Akan tetapi mereka hanyalah menolak dan mendustakan serta mengolok-olok."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Disandarkannya ayat (tanda) kepada Tuhan mereka menunjukkan sempurnanya ayat itu dan jelasnya, karena tidak ada sesuatu yang lebih jelas dari ayat Allah dan lebih agung penjelasannya, dan bahwa termasuk tarbiyah (pengurusan) dari Allah kepada hamba-hamba-Nya adalah Dia menyampaikan kepada mereka ayat-ayat-Nya, di mana dengan ayat-ayat mereka dapat menjadikannya pedoman terhadap hal yang bermanfaat bagi mereka baik pada agama maupun dunia mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 46",
    "description": "Dan adapun orang yang ingkar, setiap kali suatu tanda dari tanda-tanda kebesaran dan keesaan tuhan datang kepada mereka melalui para rasul dan ayat Al-Qur'an, mereka selalu berpaling darinya dengan penuh pengingkaran. 47. Dan salah satu bukti keingkaran mereka adalah bahwa apabila dikatakan kepada mereka, 'infakkanlah sebagian rezeki yang diberikan Allah kepadamu kepada orang yang membutuhkan, ' orang-orang yang kafir itu berkata kepada orang-orang yang beriman dengan nada mengejek, 'apakah pantas kami memberi makan kepada orang-orang yang jika Allah menghendaki, dia akan memberinya makan' sungguh, kamu benar-benar dalam kesesatan yang nyata. ' demikianlah sifat orang kafir. Mereka tidak mau berinfak, bersedekah, dan berzakat padahal semua itu akan kembali manfaatnya kepada diri mereka."
  }
]