[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apabila dikatakan kepada orang-orang kafir, ”infakanlah sebagian rizki yang telah Allah swt berikan kepada kalian. ”mereka berkata membela diri di depan orang-orang mukmin, ”apakah kami harus memberi makan kepada orang-orang yang bila Allah berkehendak Dia yang akan membieri mereka makan? kalian (wahai orang-orang mukmin) benar-benar dalam kejauhan yang sangat jauh dari kebenaran jika kalian memerintahkan hal itu kepada kami. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "47. Bila dikatakan kepada orang-orang yang menentang itu, “Bantulah orang-orang fakir dan miskin dengan harta yang telah Allah berikan kepada kalian!” Maka mereka menjawab penuh pengingkaran kepada orang-orang yang beriman, “Apakah kami harus memberi makan orang-orang yang bila Allah berkehendak memberinya makan maka Dia pasti akan memberinya!? Kami tidak menyelisihi kehendak Allah, kalian itu -wahai orang-orang Mukmin- hanya berada di atas kesalahan yang jelas dan kejauhan dari kebenaran.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "47. Dan jika orang-orang kafir itu dinasehati agar menginfakkan sebagian rezeki yang Allah berikan kepada mereka bagi orang-orang fakir miskin, maka mereka akan membantah orang-orang beriman yang memberi nasehat itu: “Apakah kami harus memberi makan dan rezeki bagi orang yang jika Allah menghendaki niscaya Allah sendiri yang akan memberinya makan?” Sungguh ini merupakan kesesatan, dan kejauhan mereka dari kebenaran, serta kesalahan dalam berfikir dan berbicara."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "47. وَإِذَا قِيلَ لَهُمْ أَنفِقُوا۟ مِمَّا رَزَقَكُمُ اللهُ (Dan apabila dikatakakan kepada mereka: “Nafkahkanlah sebahagian dari reski yang diberikan Allah kepadamu”) Yakni bersedekahlah kepada orang-orang fakir dengan harta kalian. قَالَ الَّذِينَ كَفَرُوا۟ لِلَّذِينَ ءَامَنُوٓا۟( maka orang-orang yang kafir itu berkata kepada orang-orang yang beriman) Dengan maksud mengolok mereka dan menghina perkataan mereka. أَنُطْعِمُ مَن لَّوْ يَشَآءُ اللهُ أَطْعَمَهُۥٓ( Apakah kami akan memberi makan kepada orang-orang yang jika Allah menghendaki tentulah Dia akan memberinya makan) Mereka telah mendengar dari kaum muslimin bahwa Allah Maha Memberi Rezeki, Dia menjadikan seseorang kaya dan miskin sesuai kehendak-Nya. Sepertinya mereka berusaha untuk menyudutkan kaum muslimin dengan mengatakan: “kami mengikuti kehendak Allah, sehingga kami tidak memberi makan siapa yang tidak Allah beri makan.” Padahal perkataan ini tidak benar dan hanya bantahan dengan hal yang batil, sebab Allah menjadikan kaya sebagian orang dan menjadikan miskin sebagian lain serta memerintahkan orang yang kaya untuk memberi makan orang yang miskin, dan Allah mengujinya dengan kewajiban untuk menyedekahkan hartanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "47. Saat orang-orang fakir berkata kepada orang-orang kafir: “Sedekahkanlah sebagian rejeki yang diberikan Allah kepada orang-orang yang membutuhkan”. Maka dengan mengejek dan mengolok-olok mereka akan berkata kepada orang-orang mukmin: “Apakah kami akan memberi makan orang yang akan diberi makan oleh Allah jika Dia berkehendak (Dalam anggapan dan keyakinan kalian). Wahai orang-orang mukmin, tidaklah kalian berpegang pada ucapan kalian: “Sesungguhnya Allah adalah pemberi rejeki kecuali kepada penyimpangan yang nyata”. Dalam frasa {In Antum}, kata In adalah huruf nafi, jadi maknanya adalah tidaklah kalian"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apabila dikatakan kepada mereka,“Infakkanlah sebagian rezeki yang diberikan Allah kepada kalian” orang-orang yang ingkar itu berkata kepada orang-orang yang beriman,“Apakah pantas kami memberi makan kepada orang-orang yang jika Allah menghendaki, Dia akan memberinya makan. Kalian tidak lain melainkan benar-benar dalam kesesatan yang nyata”} kalian tidak lain melainkan dalam kesalahan yang nyata ketika mengikuti Muhammad dan meninggalkan apa yang kami lakukan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "47. “dan apabila dikatakan kepada mereka, ’nafkahkanlah sebagian dari rizki yang diberikan Allah kepadamu,” artinya, dari sebagian rizki yang telah dikaruniakan Allah kepada kalian; yang kalau saja Dia berkehendak , tentu Dia mengambilnya dari kalian, “maka orang-orang yang kafir itu berkata kepada orang-orang yang beriman,” seraya menentang kebenaran sambil beragumen dengan kehendak Allah, “apakah kami akan memberi makan kepada orang-orang yang jika Allah menghendaki, tentulah Dia akan memberinya makan,? Kamu tidak lain!\" wahai Orang-orang yang beriman melainkan benar-benar ada ”dalam kesesatan yang nyata,” yang mana kalian memerintah kami melakukan hal itu. Ini membuktikan kebodohan besar mereka atau sikap pura-pura mereka yang sangat kotor, Karena sesungguhnya kehendak Allah itu sama sekali bukan hujjah (argument, alasan) bagi pelaku maksiat. Sebab, sekalipun apa yang dikehendaki Allah itu pasti terjadi dan apa yang tidak dikehendakiNya tidak akan terjadi, namun Allah telah memberikan kemampuan kepada manusia dan telah memberi mereka kekuatan yang dengannya mereka mampu melakukan perintah dan menjauhi larangan. Apabila mereka sengaja meninggalkan apa-apa yang diperintahkan kepada mereka, maka itu berarti kesengajaan dari mereka, bukan paksaan terhadap mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 47: Jika salah seorang dari orang-orang yang beriman berkata kepada mereka orang-orang musyrik : Berinfakklah kalian kepada orang-orang faqir dan yang membutuhkan sesuatu dari pemberian Allah kepada kalian yang berupa kebaikan dan kenikmatan. Mereka berkata dengan sombong dan merendahkan orang-orang yang beriman : Apakah kami akan memberikan makanan yang jika Dia menghedaki tentulah mereka akan diberikan-Nya makan ? Sungguh kalian wahai orang-orang yang beriman dalam kesesatan yang nyata dalam perintah-perintah kalian kepada kami untuk berinfak atas mereka orang-orang yang membutuhkan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sambil menentang yang hak dan mengolok-oloknya serta berhujjah dengan kehendak Allah. Wahai orang-orang mukmin. Karena memerintahkan demikian. Hal ini menunjukkan kebodohan mereka atau pura-pura bodoh, karena kehendak Allah Subhaanahu wa Ta'aala bukanlah hujjah bagi pelaku maksiat selama-lamanya. Meskipun yang Allah kehendaki akan terjadi, dan yang tidak Dia kehendaki tidak akan terjadi, tetapi Dia telah memberikan kemampuan dan kekuatan kepada hamba, di mana dengan kemampuan itu mereka dapat mengerjakan perintah dan menjauhi larangan. Oleh karena itu, jika mereka meninggalkan hal yang diperintahkan, maka yang demikian atas dasar pilihan mereka sendiri, bukan karena dipaksa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 47",
    "description": "Dan salah satu bukti keingkaran mereka adalah bahwa apabila dikatakan kepada mereka, 'infakkanlah sebagian rezeki yang diberikan Allah kepadamu kepada orang yang membutuhkan, ' orang-orang yang kafir itu berkata kepada orang-orang yang beriman dengan nada mengejek, 'apakah pantas kami memberi makan kepada orang-orang yang jika Allah menghendaki, dia akan memberinya makan' sungguh, kamu benar-benar dalam kesesatan yang nyata. ' demikianlah sifat orang kafir. Mereka tidak mau berinfak, bersedekah, dan berzakat padahal semua itu akan kembali manfaatnya kepada diri mereka. 48. Tidak hanya mengingkari utusan Allah, orang-orang kafir itu juga mengingkari hari kebangkitan. Dan apabila dikatakan bahwa mereka kelak akan dibangkitkan dari kubur, mereka itu pun berkata dengan nada mengejek, 'kapan janji hari kebangkitan itu terjadi jika kamu orang yang benar dalam perkataanmu tentangnya''."
  }
]