[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang kafir itu berkata dalam rangka mendustakan dan meminta disegerakannya azab, ”kapan kiranya kebangkitan bila kalian adalah orang-orang yang benar dalam apa yang kalian katakan itu?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "48. Orang-orang kafir yang mengingkari Kebangkitan berkata dengan penuh pendustaan dan pengingkaran, “Kapan Kebangkitan itu terjadi jika kalian -wahai orang-orang Mukmin- memang benar dalam pernyataan kalian bahwa ia bakal terjadi?”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "48. Orang-orang kafir yang mendustakan dan menghina itu bertanya: “Kapan hari kebangkitan yang kalian yakini itu akan terjadi, jika perkataan kalian itu benar?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "48. وَيَقُولُونَ مَتَىٰ هٰذَا الْوَعْدُ (Dan mereka berkata: “Bilakah (terjadinya) janji ini) Yakni janji yang kalian ancamkan kepada kami berupa azab dan hari kiamat serta menjadi penghuni neraka atau surga. إِن كُنتُمْ صٰدِقِينَ (jika kamu adalah orang-orang yang benar?) Dalam perkataan dan janji kalian. Mereka mengatakan ini untuk menghina dan mengejek orang-orang beriman."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "48. Orang-orang kafir itu juga berkata kepada orang-orang mukmin dengan mengejek: “Kapankah terjadinya peristiwa yang telah dijanjikan ini, yaitu kebangkitan dari kubur, jika kalian memang orang-orang yang benar anggapannya?”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka berkata,“Kapankah janji ini} kebangkitan {jika kalian adalah orang-orang yang benar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "48-49. “dan mereka berkata,” dengan nada mendustakan dan minta agar disegerakan, “bilakah janji ini jika kamu adalah orang-orang yang benar?” Allah mengatakan, jangan kalian menganggap tidak mungkin, sebab ia sudah dekat, “mereka tidak menunggu melainkan satu teriakan saja,” yaitu tiupan sangkakala “yang akan mengambil mereka.” Maksudnya, menimpa mereka, “ketika mereka sedang bertengkar,” yakni, mereka sedang ada dalam keadaan lalai darinya, sama sekali tidak terlintas dalam htai mereka saat mereka bertengkar dan berseteru di antara sesama mereka, yang biasanya tidak ada kecuali pada waktu lalai."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 48: Mereka orang-orang musyrik melanjutkan celaan dan hinaan mereka dengan berkata untuk mendustakan dan mengingkari: Kapan datangnya hari akhir jika kalian memang orang-orang yang jujur atas apa yang kalian dakwahkan!?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sambil mendustakan dan meminta disegerakan azab."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 48",
    "description": "Tidak hanya mengingkari utusan Allah, orang-orang kafir itu juga mengingkari hari kebangkitan. Dan apabila dikatakan bahwa mereka kelak akan dibangkitkan dari kubur, mereka itu pun berkata dengan nada mengejek, 'kapan janji hari kebangkitan itu terjadi jika kamu orang yang benar dalam perkataanmu tentangnya''49. Allah mengingatkan orang-orang kafir itu bahwa mereka tidak akan menunggu lama kedatangan hari kebangkitan, melainkan ha-Nya menunggu satu teriakan saja, yaitu tiupan sangkakala pertama yang menghancurkan alam semesta. Suara sangkakala itu yang akan membinasakan mereka ketika mereka sedang bertengkar karena ia datang secara tiba-tiba (lihat pula: surah az-zukhruf/43: 66)."
  }
]