[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang yang musyrik yang berharap disegerakannya ancaman Allah tersebut tidak menunggu kecuali tiupan al-faza saat kiamat tiba yang menghancurkan mereka sedang sibuk dengan urusan hidup mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "49. Orang-orang yang mendustakan Kebangkitan dan menilainya tidak mungkin itu tidak menunggu kecuali tiupan pertama saat sangkakala ditiup, suaranya mengejutkan mereka padahal saat itu mereka sedang sibuk dengan urusan dunia, jual beli, mengurus kebun, menggembala dan sebagainya dari kesibukan-kesibukan dunia."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "49. Antara mereka dengan apa yang mereka tunggu itu tidak lain hanyalah tiupan kehancuran pada hari kiamat yang membinasakan mereka secara tiba-tiba, saat mereka sedang berselisih pada urusan dunia, sehingga seketika itu juga mereka menjadi mayat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "49. مَا يَنظُرُونَ إِلَّا صَيْحَةً وٰحِدَةً (Mereka tidak menunggu melainkan satu teriakan saja) Yakni tipuan sangkakala oleh malaikat Israfil. تَأْخُذُهُمْ وَهُمْ يَخِصِّمُونَ (yang akan membinasakan mereka ketika mereka sedang bertengkar) Yakni mereka sedang bertengkar dalam jual beli dan urusan dunia lainnya. Kematian ini akan menimpa seluruh makhluk hidup."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "49. Apa yang ditunggu mereka tidak lain kecuali satu suara (suara yang sangat menggelisahkan lagi menghancurkan) yaitu tiupan sangkakala pertama oleh Israfil. Gambarannyaa yaitu tiupan yang mana seluruh makhluk akan mati. Suara itu membinasakan mereka dengan cepat. Mereka saling bertengkar dalam jual-beli dan urusan-urusan dunia."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka tidak hanya menunggu} mereka tidak menunggu {melainkan hanya satu teriakan yang akan membinasakan mereka dan mereka dalam keadaan bertengkar} bertengkar tentang urusan dunia mereka, lalu mereka mati di tempat mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "48-49. “dan mereka berkata,” dengan nada mendustakan dan minta agar disegerakan, “bilakah janji ini jika kamu adalah orang-orang yang benar?” Allah mengatakan, jangan kalian menganggap tidak mungkin, sebab ia sudah dekat, “mereka tidak menunggu melainkan satu teriakan saja,” yaitu tiupan sangkakala “yang akan mengambil mereka.” Maksudnya, menimpa mereka, “ketika mereka sedang bertengkar,” yakni, mereka sedang ada dalam keadaan lalai darinya, sama sekali tidak terlintas dalam htai mereka saat mereka bertengkar dan berseteru di antara sesama mereka, yang biasanya tidak ada kecuali pada waktu lalai."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 49: Allah mengabarkan bahwasanya urusannya adalah mudah; maka tidaklah mereka akan mendengar kecuali sekali teriakan yang akan mematikan mereka, sedangkan mereka sering berselisih dalam urusan kehidupan mereka. Inilah tiupan pertama yang dinamakan dengan tiupan yang mematikan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya, suara tiupan sangkalala pertama yang ditiup oleh malaikat Israfil yang menghancurkan bumi ini. Yakni ketika mereka sedang lalai dan sibuk, baik dengan jual beli, tawar-menawar, makan, minum, dsb."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 49",
    "description": "Allah mengingatkan orang-orang kafir itu bahwa mereka tidak akan menunggu lama kedatangan hari kebangkitan, melainkan ha-Nya menunggu satu teriakan saja, yaitu tiupan sangkakala pertama yang menghancurkan alam semesta. Suara sangkakala itu yang akan membinasakan mereka ketika mereka sedang bertengkar karena ia datang secara tiba-tiba (lihat pula: surah az-zukhruf/43: 66). 50. Tiupan sangkakala yang pertama itu terjadi dengan cepat dan tiba-tiba sehingga mereka tidak mampu membuat suatu wasiat atau pesan kepada keluarganya dan mereka juga tidak dapat kembali berkumpul kepada keluarganya lagi."
  }
]