[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah menurunkan al-Qur’an ini dengan penurunan dari Dzat yang Mahaperkasa dalam membalas orang-orang yang kafir lagi berdosa, namun Dia Maha Penyayang kepada siapa yang bertaubat dari hamba-hambaNya dan beramal shalih."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4-5. Berdasarkan manhaj yang lurus dan syariat yang kokoh. Manhaj yang lurus dan syariat yang kokoh ini diturunkan dari Rabbmu Yang Mahaperkasa, yang tidak seorang pun mengalahkannya, Maha Penyayang kepada hamba-hamba-Nya yang Mukmin."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. تَنزِيلَ الْعَزِيزِ الرَّحِيمِ ((sebagai wahyu) yang diturunkan oleh Yang Maha Perkasa lagi Maha Penyayang) Yakni al-Qur’an diturunkan oleh Allah Yang Maha Perkasa lagi Maha Penyayang."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Sesungguhnya Al-Qur’an ini diturunkan dari sisi Allah yang Maha Kuat, Maha Perkasa dan Maha Kuasa serta Maha Penyayang kepada seluruh makhluknya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{yang diturunkan oleh Dzat Yang Maha perkasa lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5. Jalan yang lurus ini “diturunkan oleh Yang Mahaperkasa lagi Maha Penyayang.” Dia-lah yang menurunkan kitab-kitabNya dan Dia menurunkannya sebagai jalan bagi hamba-hambaNya, yang dapat mengantarkan mereka kepadaNya. Oleh karena itu, Dia melindunginya dengan keperkasaanNYa dari perubahan itu, Dia melindunginya dengan keperkasaanNya dari perubahan itu dan pergantian; dan dengannya Dai mengasihi hamba-hambaNya dengan belas kasih yang sampai kepada mereka hingga mengantarkan mereka kepada negeri rahmat (kasih-sayang) Nya. Maka dari itu Dia menutup ayat ini dengan dua nama yang sangat mulia, yaitu Yang Mahaperkasa lagi Maha Penyayang."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 5: 5-6. Al Qur’an ini wahai Nabi Allah, diturunkan dari sisi Allah agar menjadi peringatan kaummu, quraisy secara khusus dan arab secara umum, yang tidak ada pendahulu mereka, dari nenek moyang mereka , yang datang peringatan dari Allah. Yaitu memperingatkan dari keburukan dosa kesyrikan kepada Allah, oleh karena inilah terputus kerasulan untuk mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Jalan yang lurus itu diturunkan Tuhan Yang Mahaperkasa lagi Maha Penyayang ke dalam kitab-Nya dan diturunkan-Nya sebagai jalan bagi hamba-hamba-Nya. Jalan yang lurus itu dapat menyampaikan mereka kepada-Nya dan kepada surga-Nya. Maka dengan keperkasaan-Nya, Dia menjaga jalan itu dari perubahan dan dengan jalan itu, Dia merahmati hamba-hamba-Nya dengan rahmat yang mengena kepada mereka sehingga dapat menyampaikan mereka ke tempat rahmat-Nya (surga). Oleh karena itulah, Dia tutup ayat ini dengan dua nama-Nya yang mulia; Al ‘Aziz dan Ar Rahiim."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 5",
    "description": "Al-qur'an adalah wahyu yang diturunkan oleh Allah yang mahaperkasa, yakni mampu mengalahkan siapa pun dan melaksanakan apa pun yang dia kehendaki; maha penyayang kepada semua hamba-Nya, utamanya kepada mereka yang beriman. 6. Al-qur'an diturunkan agar engkau, wahai nabi Muhammad, memberi peringatan untuk pertama kali kepada suatu kaum yang nenek moyangnya belum pernah diberi peringatan, tepatnya pada masa kekosongan dari risalah kenabian antara nabi isa dengan nabi Muhammad, karena itu mereka lalai dari iman dan ajaran-ajaran agama yang dibawa oleh rasul sebelumnya."
  }
]