[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Pada saat sangkakala telah ditiup, orang-orang musyrik itu tidak lagi mampu mewasiatkan sesuatu kepada saudaranya dan tidak mampu kembali kepada keluarganya, sebaliknya mereka mati di pasar-pasar dan di tempat-tempat mereka berada"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "50. Saat suara menggelegar sangkakala terdengar, maka sebagian tidak sempat lagi berwasiat kepada sebagian lainnya, mereka juga tidak bisa pulang ke rumah-rumah dan keluarga mereka, karena mereka langsung mati dalam keadaan demikian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "50. Jika suara tiupan itu telah datang tiba-tiba, maka orang-orang yang mendustakan itu tidak akan dapat berbuat apapun, tidak dapat berwasiat kepada siapapun, dan tidak akan mampu kembali kepada keluarga mereka. Mereka seketika itu akan mati di pasar-pasar dan tempat-tempat mereka saat mereka dalam keadaan beraktifitas. Demikianlah keadaan manusia saat terjadi tiupan kehancuran ketika mereka di pasar dan dalam aktifitas masing-masing; hal ini juga dijelaskan dalam hadits: “Sungguh hari kiamat akan terjadi pada saat dua orang sedang membentangkan kain di antara mereka, sehingga mereka tidak sempat menyelesaikan jual beli atau menggulung kain itu kembali. Sungguh hari kiamat akan terjadi pada saat seseorang selesai memerah susu untanya, sehingga dia tidak sempat meminumnya. Sungguh hari kiamat akan terjadi saat seseorang sedang memperbaiki tempat airnya, sehingga dia tidak sempat minum darinya. Dan sungguh hari kiamat akan terjadi saat seseorang sedang mengangkat sesuap makanan ke mulutnya, sehingga dia tidak sempat memakannya.” (Shahih al-Bukhari 5/2386, no. 4359. Dan Shahih Muslim, kitab al-Fitan, bab dekatnya hari kiamat, no. 2954)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "50. فَلَا يَسْتَطِيعُونَ تَوْصِيَةً (lalu mereka tidak kuasa membuat suatu wasiatpun) Yakni seseorang tidak mampu mewasiatkan kepada orang lain hak dan kewajibannya. Atau mewasiatkan untuk bertobat dan berhenti dari kemaksiatan. Mereka akan mati di pasar-pasar dan tempat-tempat mereka saat itu juga. وَلَآ إِلَىٰٓ أَهْلِهِمْ يَرْجِعُونَ (dan tidak (pula) dapat kembali kepada keluarganya) Yakni mereka tidak dapat kembali ke rumah-rumah mereka, bagi orang yang mati di luar rumah. Imam Bukhari, Muslim, dan yang lainnya mengeluarkan hadits dari Abu Hurairah, ia berkata, Rasulullah bersabda: “Sungguh akan datang hari kiamat sedang dua orang telah menghamparkan pakaian keduanya, namun mereka tidak sempat untuk menjualnya atau kembali melipatnya; Sungguh akan datang hari kiamat sedang seseorang telah mengecat kolam airnya namun ia tidak sempat minum darinya; Sungguh akan datang hari kiamat sedang seseorang telah selesai memerah susu, namun ia tidak sempat meminumnya; dan sungguh akan datang hari kiamat sedang seseorang telah mengangkat sesuap makanan ke mulutnya, namun ia tidak sempat memakannya.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "50. Mereka tidak bisa saling mewariskan apa yang mereka miliki dan tanggung. Mereka juga tidak kembali kepada keluarga dan tempat tinggal mereka akibat kesibukan mereka terkait kematian dalam momen tiupan itu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Jadi mereka tidak dapat berwasiat dan tidak dapat kembali kepada keluarganya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "50. apabila aku membinasakan mereka pada saat mereka lalai, maka mereka tidak akan ditangguhkan dan tidak akan ditunda, “lalu mereka tiada kuasa membuat suatu wasiatpun,” sedikitpun ataupun banyak. “dan tidak pula dapat kembali kepada keluarganya,”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 50: Dengan sebab ini yaitu tiupan yang datang kepada mereka, maka sungguh mereka tidak menyadarinya dan mereka tidak dapat kembali pada keluarga mereka serta anak-anak mereka ketika semuanya telah mati."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sedikit atau banyak. Dari pasar dan dari kesibukan mereka, bahkan mereka mati di tempat mereka berbisnis."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 50",
    "description": "Tiupan sangkakala yang pertama itu terjadi dengan cepat dan tiba-tiba sehingga mereka tidak mampu membuat suatu wasiat atau pesan kepada keluarganya dan mereka juga tidak dapat kembali berkumpul kepada keluarganya lagi. 51. Semua makhluk hidup binasa dengan tiupan sangkakala yang pertama, lalu ditiuplah sangkakala yang kedua untuk membangkitkan me-reka dari kematian, maka seketika itu mereka keluar dari kuburnya dalam keadaan hidup dan berjalan menuju kepada tuhannya untuk dihisab dan menerima putusan (lihat pula: surah al-ma''rij/70: 43)."
  }
]