[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sasangkala ditiup untuk kedua kalinya, lalu arwah mereka dikembalikan kepada jasad mereka, dan merekapun keluar dari kubur mereka dengan cepat menuju tuhan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "51. Lalu tiupan sangkakala yang kedua ditiup untuk Kebangkitan, mereka semua pun keluar dari kubur menuju Rabb mereka dengan bergegas untuk menghadapi hisab dan menerima balasan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "51. Malaikat akan meniup sangkakala kedua kalinya, sehingga seluruh manusia akan keluar dari kuburnya setelah dihidupkan kembali dan nyawanya dikembalikan, mereka akan bersegera menuju Tuhan mereka yang akan memberi ketetapan dan balasan bagi mereka atas amal perbuatan yang telah mereka lakukan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "51. وَنُفِخَ فِى الصُّورِ (Dan ditiuplah sangkalala) Ini merupakan tiupan yang membangkitkan mereka dari alam kubur. فَإِذَا هُم مِّنَ الْأَجْدَاثِ(maka tiba-tiba mereka keluar dengan segera dari kuburnya) Yakni dari kubur mereka. إِلَىٰ رَبِّهِمْ يَنسِلُونَ ((menuju) kepada Tuhan mereka) Yakni berjalan dengan cepat kepada Tuhan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "51. Dan ditiuplah sangkakala itu pada tiupan kedua untuk pembangkitan (selang waktu dua tiupan itu adalah 40 tahun), maka seketika para makhluk keluar dari kuburan mereka untuk dihisab di hadapan Tuhan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sangkakala pun ditiup} sangkakala {dan seketika itu mereka dari kubur} kubur {bergerak cepat} keluar dengan cepat {menuju Tuhan mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "51. tiupan sangkakala yang pertama adalah tiupan sentakan (al-faza) dan kematian. Sedangkan yang (disebutkan) ini adalah tiupan kebangkitan dan hidup kembali. Apabila sangkakala telah ditiup (untuk kedua kalinya) maka merekapun keluar “dari ajdast” maksudnya, dari kuburu-kubur ”mereka segera\" menemuai tuhan mereka, yakni mereka bersegera untuk hadir di hadapan Nya dan tidak memungkinkan untuk mereka untuk terlambat dan lelet."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 51: Maka jika telah ditiup sangkakala yang kedua yaitu tiupan untuk kebangkitan pembalasan, mereka akan keluar dari kuburan mereka dengan cepat untuk sampai di hadapan Tuhan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Tiupan ini adalah tiupan sangkalala yang kedua, di mana dengan tiupan ini bangkitlah orang-orang yang berada dalam kubur. Jarak antara tiupan pertama dengan tiupan kedua adalah 40, sebagaimana disebutkan dalam hadits. Wallahu a’lam, apakah 40 tahun, 40 bulan atau 40 hari."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 51",
    "description": "Semua makhluk hidup binasa dengan tiupan sangkakala yang pertama, lalu ditiuplah sangkakala yang kedua untuk membangkitkan me-reka dari kematian, maka seketika itu mereka keluar dari kuburnya dalam keadaan hidup dan berjalan menuju kepada tuhannya untuk dihisab dan menerima putusan (lihat pula: surah al-ma''rij/70: 43). 52. Orang-orang kafir itu kaget dan heran pada saat dibangkitkan. Me-reka berkata, 'celakalah kami! siapakah yang membangkitkan kami dari tempat tidur kami di alam kubur'' mereka berkata demikian karena akan menghadapi kesulitan dan malapetaka yang lebih besar. Adapun orang-orang beriman akan berkata, 'inilah hari kebangkitan yang dijanjikan oleh Allah yang maha pengasih, dan benarlah apa yang disampaikan oleh rasul-rasul-Nya. '."
  }
]