[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kebangkitan dari kubur itu hanyalah hasil dari sekali tiupan sangkakala , lalu tiba-tiba seluruh makhluk menghadap ke hadapan kami untuk menghadapi hisab dan balasan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "53. Kebangkitan dari alam kubur hanyalah akibat dari tiupan sangkakala yang kedua, selanjutnya seluruh makhluk hadir pada hari Kiamat untuk menghadapi hisab."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "53. Peristiwa kebangkitan yang luar biasa ini tidak lain hanyalah hasil dari satu tiupan dari malaikat; seketika itu seluruh makhluk datang menghadap kepada Allah untuk memberi ketetapan di antara mereka. Betapa besar kekuasaan Allah!"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "53. إِن كَانَتْ إِلَّا صَيْحَةً وٰحِدَةً (Tidak adalah teriakan itu selain sekali teriakan saja) Tiupan sangkakala yang dilakukan oleh malaikat Israfil. فَإِذَا هُمْ جَمِيعٌ لَّدَيْنَا مُحْضَرُونَ (maka tiba-tiba mereka semua dikumpulkan kepada Kami) Yakni ternyata mereka telah terkumpul di sisi Kami dengan cepat untuk menjalani hisab dan siksaan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "53. Tiupan itu tidak lain kecuali satu suara tiupan sangkakala Israfil. Lalu seketika mereka semua dikumpulkan di sisi Kami untuk dihisab dan dibalas."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidaklah teriakan itu melainkan hanya sekali saja} tiupan kedua dari Sangkakala {maka seketika itu mereka semua dihadapkan kepada Kami"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "53. “tidak adalah” kebangkitan dari kubur itu “selain sekali teriakan saja,” yang ditiupkan oleh malaikat israfil pada sangkakala, maka semua jasad manusia hidup kembali, “maka tiba-tiba mereka semua dikumpulkan kepada kami,” seluruh manusia generasi pertama hingga yang terkahir, dari bangsa jin dan manusia untuk perhitungan amal mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 53: Allah menjelaskan bahwasanya dibangkitkannya mereka, dikeluarkannya mereka wahai manusia dari kubur kubur mereka, karena sebab suara dan tiupan yang pertama yaitu dari malaikat israfil; yaitu jika telah dikumpulkan seluruh manusia yang berdiri di hadapan Allah untuk dibalas dan dihisab. Dengan ini terdapat petunjuk atas tepatnya kehadiran mereka untuk dihisab dan dibalas dengan tanpa penyelisihan dari mereka satupun."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Manusia dan jinnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 53",
    "description": "Teriakan sebagai pertanda kebangkitan itu hanya sekali saja, maka seketika itu mereka semua dihadapkan kepada kami untuk dihisab. Ayat ini menerangkan betapa mudah bagi Allah untuk membangkitkan seluruh umat manusia (lihat pula: surah an-na'l/16: 77)54. Maka pada hari kebangkitan itu seseorang tidak akan dirugikan sedikit pun dalam menerima imbalan atau balasan dari Allah atas amal perbu-atan mereka, dan kamu tidak akan diberi balasan berupa siksa atau pahala kecuali sesuai dengan apa yang telah kamu kerjakan di dunia."
  }
]