[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya penduduk surga di hari itu sibuk dengan berbagai macam kenikmatan yang mereka rasakan, sehingga mereka tidak menghiraukan orang lain."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "55. Sesungguhnya penghuni Surga pada hari Kiamat sangat sibuk sehingga tidak bisa memikirkan orang lain, karena mereka menyaksikan kenikmatan abadi, kemenangan besar, mereka sedang berbahagia dan bersuka cita."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "55. Pada hari itu para penduduk surga tersibukkan dari selain mereka dengan segala jenis kenikmatan yang mereka rasakan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "55. إِنَّ أَصْحٰبَ الْجَنَّةِ الْيَوْمَ فِى شُغُلٍ (Sesungguhnya penghuni surga pada hari itu dalam kesibukan (mereka)) Dengan segala kenikmatan yang tidak pernah dilihat sebelumnya, tidak pernah didengar oleh telinga, dan tidak pernah terbesit pada hati manusia. Mereka sibuk dengan kenikmatan itu sehingga lalai dari urusan orang-orang kafir dan kesudahan mereka di neraka, walau mereka adalah kerabat mereka. فٰكِهُونَ (untuk bersenang-senang) Yakni menikmatinya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "55. Sesungguhnya penduduk surga itu berada dalam kenyamanan dan kenikmatan ketika hari kiamat yang mana manusia berada dalam kondisi sibuk satu sama lain."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya penghuni surga pada hari itu berada dalam kesibukan} dalam kenikmatan yang agung yang mengalihkan mereka dari orang lain {lagi bersenang-senang} bersenang-senang dan merasa nyaman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "55-56. setelah Allah menjelaskan bahwa setiap orang tidak akan dibalas kecuali menurut apa yang dikerjakannya, Allah lalu menjelaskan balasan kedua golongan itu. Allah memulai dengan menjelaskan balasan untuk para penghuni surga dan Dia mengabarkan bahwa mereka pada hari itu “bersenang-senang dalam kesibukan,” maksudnya, berada dalam kesibukan yang menyenangkan jiwa dan membuatnya merasakan kelezatan akan segala apa yang disuka oleh nafsunya, sedap dipandang mata dan didamba-dambakan oleh orang-orang yang mendambakannya. Diantara kesenangan itu adalah bertebarannya gadis-gadis cantik sebagaimana difirmankanNya “mereka dan istri-istri mereka” dari bidadari-bidadari yang memadukan semua unsur keelokan pada wajah, tubuh, dan akhlak, “berada dalam tempat yang teduh, diatas dipan-dipan,” yakni, dipan-dipan yang dihiasi dengan kain-kain bercorak sangat indah dan menarik, “bertelekan,” di atasnya, yang menunjukan puncak kesenangan, kedamaian dan kelezatan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 55: Allah mengabarkan bahwasanya ahli surga pada hari kiamat menikmati dengan kenikmatan surga, mereka bersenang-senang di dalamnya dengan apa yang tidak pernah dilihat oleh mata, tidak pernah didengar oleh telinga dan tidak pernah terbetik dalam hati manusia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala menyebutkan bahwa setiap orang tidaklah dibalas kecuali sesuai amal yang dia kerjakan, maka Allah Subhaanahu wa Ta'aala menyebutkan balasan untuk kedua golongan (golongan penghuni surga dan golongan penghuni neraka). Allah memulai dengan balasan kepada penghuni surga, bahwa ketika mereka pindah dari beberapa area di hari Kiamat lalu mereka menempati taman-taman surga, mereka berada dalam kesibukan sehingga tidak memperhatikan yang lain karena kenikmatan yang kekal di dalamnya dan keberuntungan yang besar. Al Hasan Al Bashri berkata, “(Mereka) berada dalam kesibukan (sehingga tidak mempedulikan) penduduk neraka yang sedang merasakan azab.” Menurut Mujahid tentang firman Allah Ta’ala, “Bersenang-senang dalam kesibukan (mereka).” Yakni mereka berada dalam kesenangan dan berbangga dengannya. Sedangkan menurut Ibnu Mas’ud, Ibnu Abbas, Al Hasan, dan Qatadah tentang firman Allah tersebut, “Yakni mereka disibukkan dengan memecahkan keperawanan (istri mereka yang cantik).” Meskipun mereka sibuk, namun mereka tidak pernah lelah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 55",
    "description": "Beralih dari penjelasan tentang keniscayaan hari kiamat dan kebangkitan, Allah kemudian menggambarkan kebahagiaan orang mukmin di surga. Sesungguhnya penghuni surga pada hari itu bersenang-senang dalam kesibukan mereka. Mereka merasakan kesenangan dan kenikmatan yang belum pernah mereka temukan, keindahan yang belum pernah mereka lihat, dan suara menyejukkan kalbu yang belum pernah mereka dengar. 56. Orang-orang beriman itu bersenang-senang di surga. Mereka dan pasangan-pasangannya di surga berada dalam tempat yang teduh, bersandar di atas dipan-dipan sambil berbincang dan menikmati berbagai rezeki dari Allah."
  }
]