[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Di dalam surga mereka mendapatkan berbagai macam buah-buahan yang lezat dan mereka mendapatkan berbagai macam kenikmatan yang mereka inginkan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "57. Di Surga mereka menikmati berbagai macam buah-buahan yang lezat, ada anggur, buah tin dan delima, mereka juga mendapatkan segala bentuk kesenangan dan kenikmatan. Apa yang mereka minta akan mereka dapatkan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "57. Bagi para penduduk surga berbagai jenis buah-buahan lezat, dan mereka akan mendapatkan segala kenikmatan yang mereka minta dan inginkan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "57. لَهُمْ فِيهَا فٰكِهَةٌ (Di surga itu mereka memperoleh buah-buahan) Buah-buahan dari segala jenisnya. وَلَهُم مَّا يَدَّعُونَ(dan memperoleh apa yang mereka minta) Dikabulkan segala yang diminta oleh penduduk surga. Pendapat lain mengatakan yakni penduduk surga yang mengakui sesuatu maka itu menjadi miliknya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "57. Disuguhkan buah-buahan yang bermacam-macam untuk mereka. Selain itu, bagi mereka juga segala sesuatu yang mereka dambakan dan inginkan, berupa sesuatu yang diinginkan jiwa dan nikmat dipandang"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bagi mereka di sana ada buah-buahan dan apa saja yang mereka inginkan} yang mereka harapkan dan inginkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "57. “di dalamnya mereka memperoleh buah-buahan,” yang sangat banyak dari berbagai jenis buah-buahan yang sangat lezat, seperti anggur, thin, delima, dan lain-lain. “dan memperoleh apa yang mereka minta,” apa yang mereka cari. Kapan saja mereka mencari dan mendambakannya , maka mereka pasti mendapatkannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 57: Mereka di surga diberikan buah-buahan yang banyak dan lezat, tidak akan terputus kenikmatan di dalamnya selamanya, dan tidak juga mereka terhalang dari memakannya. Mereka di surga juga akan dipenuhi atas segala permintaan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Apa yang mereka inginkan dan mereka cita-citakan ada di hadapan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 57",
    "description": "Di surga itu mereka memperoleh berbagai macam buah-buahan yang segar lagi lezat (lihat pula: surah ad-dukh'n/44: 55) dan memperoleh apa saja yang mereka inginkan dari berbagai macam kebutuhan. 58. Kepada mereka dikatakan, 'salam, ' sebagai ucapan selamat dari tuhan yang maha penyayang. Salam inilah yang sangat mereka harapkan karena merupakan suatu bentuk pemuliaan bagi mereka."
  }
]