[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka mendapatkan nikmat lain yang lebih besar, yaitu saat tuhan mereka berbicara kepada mereka, menyayangi mereka dengan memberi salam kepada mereka. Dan pada saat itulah keselamatan yang sempurna dari segala sisi terwujud bagi mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "58. Lebih dari itu mereka semuanya mendapatkan salam (keselamatan) dari Rabb mereka yang Maha Penyayang. Bila Rabb mereka memberi mereka salam, maka mereka mendapatkan segala bentuk keselamatan dari segala sisi, mereka mendapatkan penghormatan yang tidak ada penghormatan yang melebihinya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "58. Mereka juga akan mendapat kenikmatan lain yang lebih besar, yaitu ketika Allah berbicara dengan mereka dan mereka dapat melihat-Nya, Allah memberi salam bagi mereka sehingga mereka mendapat keselamatan dan kenikmatan yang sempurna serta rahmat dari-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "58. سَلٰمٌ (Salam) Yakni bagi mereka ucapan salam dari Allah. Dan ini merupakan harapan setiap penghuni surga. قَوْلًا مِّن رَّبٍّ رَّحِيمٍ (sebagai ucapan selamat dari Tuhan Yang Maha Penyayang) Yakni yang datang dari-Nya, Allah berfirman kepada mereka: “keselamatan bagi kalian hai penghuni surga.” Pendapat lain mengatakan bahwa para malaikat masuk ke tempat penghuni surga dari setiap pintu seraya berkata: “keselamatan bagi kalian hai penghuni surga dari Tuhan Yang Maha Penyayang.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "58. Dikatakan kepada mereka salam penyambutan bagi kalian, yaitu salam yang disampaikan dari Allah, Tuhan yang Maha Penyayang kepada hamba-hambaNya yang mukmin"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{“Salam” sebagai ucapan dari Tuhan Yang Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "58. dan untuk mereka juga “salam” ini menunjukkan adanya percakapan Allah dengan para penhuni surga, dan ucapan selamat Allah kepada mereka. Lalu dikukuhkannya lagi dengan FirmanNYa, ”sebagai ucapan selamat,” apabila Allah Yang Maha pengasih itu memberikan salam kepada mereka, maka mereka memperoleh keselamatan yang sempurna dari segala sisinya, dan mereka juga memperoleh penghormatan yang tidak ada bentuk penghormatan yang lebih tinggi darinya dan tidak ada pula kenikmatan yang setara dengannya. Lalu bagaimana menurut anda dengan ucapan salam penghormatan dari Maharaja bagi segala raja, Rabb Yang MahaAung, lagi Maha Penyantun dan Mahapenyayang bagi para penghuni negeri karamahNya, yaitu yaitu orang-orang yang telah mendapatkan ridha dariNya. Maka Dia tidak akan pernah memurkai mereka untuk selama-lamanya. Kalau sekiranya bukan karena Allah telah menakdirkan mereka tidak akan mati atau kaki mereka berpindah dari tempat-tempatya karena kegembiraan, kesenangan, dan kebahagiaan, tentu hal itu pasti terjadi. Maka kami berharap kepada Rabb, tuhan kami agar kiranya tidak menghalangi kami untuk mendapatkan nikmat-nikmat tersebut dan menyenangkan kami dengan melihat wajahNYa yang mulia."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 58: Mereka menikmati (yaitu ahli surga) dengan kenikmatan yang besar : Yaitu melihat Allah Al Karim, kemudian Allah memberikan salam kepada mereka serta Allah Ridha kepada mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dalam ayat ini terdapat firman Allah kepada penghuni surga dan salam-Nya kepada mereka. Apabila Allah Subhaanahu wa Ta'aala telah mengucapkan salam kepada mereka, maka mereka mendapatkan keselamatan secara sempurna dari berbagai sisi dan mereka memperoleh penghormatan, di mana tidak ada penghormatan yang lebih tinggi daripada itu, dan tidak ada kenikmatan yang serupa dengannya. Coba bayangkan penghormatan dari Penguasa raja-raja, Tuhan Yang Maha Agung, Yang Maha Pengasih lagi Maha Penyayang kepada penghuni surga, di mana Dia telah melimpahkan keridhaan-Nya kepada mereka, dan tidak akan murka kepada mereka untuk selama-lamanya. Oleh karena itu, kami berharap kepada Engkau wahai Tuhan kami agar tidak menghalangi kami dari kenikmatan itu dan memberikan kesenangan kepada kami dengan melihat Wajah-Mu yang mulia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 58",
    "description": "Kepada mereka dikatakan, 'salam, ' sebagai ucapan selamat dari tuhan yang maha penyayang. Salam inilah yang sangat mereka harapkan karena merupakan suatu bentuk pemuliaan bagi mereka. 59. Usai memaparkan keadaan orang mukmin beserta kenikmatan yang mereka peroleh di surga, Allah dalam ayat ini beralih menjelaskan kondisi orang kafir di akhirat. Dan dikatakan kepada orang kafir, 'berpisahlah kamu pada hari ini dari orang mukmin, wahai orang-orang yang berdosa! masuklah kamu ke neraka, berpisah dari orang mukmin yang akan menuju surga (lihat pula: surah a'-''ff't/37: 22'23)."
  }
]