[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Di hari itu dikatakan kepada orang-orang kafir “menyingkirlah kalian dari orang-orang mukimin dan pisahkanlah diri kalian dari mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "59. Pada hari itu dikatakan kepada kaum musyrikin, Berpisahlah kalian dari orang-orang yang beriman, karena orang-orang yang beriman tidak layak bersama kalian, karena balasan kalian dengan balasan mereka berbeda, sifat kalian dengan sifat mereka juga berbeda.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "59. Setelah pembahasan pahala bagi orang-orang beriman, kemudian datanglah pembahasan siksaan bagi orang-orang kafir. Pada hari itu akan dikatakan kepada mereka: “Menyingkirlah kalian dari orang-orang beriman.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "59. وَامْتٰزُوا۟ الْيَوْمَ أَيُّهَا الْمُجْرِمُونَ (Dan (dikatakan kepada orang-orang kafir): “Berpisahlah kamu (dari orang-orang mukmin) pada hari ini, hai orang-orang yang berbuat jahat) Dan ketika itu dikatakan kepada orang-orang yang berdosa: “berpisahlah kalian dari orang-orang yang shalih; yakni di akhirat. Atau yang dimaksud adalah: orang-orang berdosa berpisah satu sama lain; orang-orang Yahudi menjadi satu golongan, orang-orang Nasrani menjadi satu golongan, orang-orang Majusi menjadi satu golongan, orang-orang shabi’in menjadi satu golongan, dan para penyembah berhala menjadi satu golongan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "59. Maknanya, Wahai orang-orang kafir yang melakukan kejahatan, berpisahlah dari hamba-hambaKu yang mukmin. Ini dikatakan kepada mereka saat berdiri untuk memohon dan saat penduduk surga diperintahkan untuk masuk surga sebagaimana disebutkan oleh Qurthubi"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "“Berpisahlah} berpisahlah dari orang-orang mukmin {pada hari ini, wahai orang-orang yang durhaka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "59. setelah Allah menjelaskan balasan untuk orang-orang yang bertakwa, Allah lalu menjelaskan balasan untuk orang-orang yang berdosa, “dan” sesungguhnya nanti pada Hari Kiamat akan dikatakan kepada mereka, “berpisahlah kamu pada hari ini, hai orang-orang yang berbuat jahat,” maksudnya, berpisahlah kalian dari orang-orang yang beriman dan mereka menjadi kelompok tersendiri untuk dicela dan dihinakan di hadapan segenap manusia yang menyaksikan sebelum Allah memasukkan mereka ke neraka. Dikatakan kepada mereka:"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 59: Adapun orang-orang yang mendustakan, maka balasan bagi mereka pada hari kiamat akan dikatakan kepada mereka: Kalian berbeda (dengan ahli surga) dan kalian sangat jauh dibandingkan dengan orang-orang yang beriman. Kemudian mereka dimasukkan ke dalam neraka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala menyebutkan balasan untuk orang-orang yang bertakwa, Dia menyebutkan balasan-Nya kepada orang-orang yang berdosa. Maka mereka berpisah dari orang-orang mukmin agar Dia menegur mereka dengan keras di hadapan semua manusia sebelum mereka masuk ke dalam neraka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 59",
    "description": "Usai memaparkan keadaan orang mukmin beserta kenikmatan yang mereka peroleh di surga, Allah dalam ayat ini beralih menjelaskan kondisi orang kafir di akhirat. Dan dikatakan kepada orang kafir, 'berpisahlah kamu pada hari ini dari orang mukmin, wahai orang-orang yang berdosa! masuklah kamu ke neraka, berpisah dari orang mukmin yang akan menuju surga (lihat pula: surah a'-''ff't/37: 22'23)60. Dikatakan juga kepada orang kafir itu, 'bukankah aku dahulu telah memerintahkan kepadamu, wahai anak cucu adam, agar kamu sekali-kali tidak menyembah setan' aku bahkan telah mengutus para rasul untuk menyampaikan risalah kepadamu. Sungguh, setan itu musuh yang nyata bagi kamu karena sejak dahulu telah menyesatkan manusia."
  }
]