[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kami menurunkannya kepadamu (wahai Rasul) agar dengannya kamu memperingatkan suatu kaum yang nenek moyang mereka sebelummu belum diberi peringatan, yaitu orang-orang Arab. Mereka adalah orang-orang yang lalai dari iman dan istiqamah di atas amal shalih. Setiap umat yang peringatan terhadapnya terputus, mereka akan terjatuh kedalam kelalaian. Dalam ayat Ini mengandung dalil diwajibkannya dakwah dan memberi peringatan atas para ulama, orang-orang yang mengetahui Allah dan SyariatNya, untuk membangunkan kaum Muslimin dari kelalaian mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Kami menurunkan hal itu kepadamu agar kamu memperingatkan suatu kaum, yaitu orang-orang Arab yang belum pernah didatangi oleh seorang Rasul untuk memperingatkan mereka. Mereka adalah orang-orang yang lengah dari iman dan tauhid. Demikian juga keadaan setiap umat yang telah terputus dari peringatan Allah, mereka memerlukan rasul yang mengingatkan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "6. Kitab ini bertujuan untuk memberi peringatan kepada orang-orang musyrik Arab yang telah lama berada dalam kekafiran dan kesesatan; mereka mewarisi kekafiran dan kesesatan dari generasi ke generasi, hingga Allah menurunkan kitab-Nya yang terakhir dan mengutus rasul-Nya yang terakhir; sebagai bentuk kepedulian Allah kepada mereka. Nabi Muhammad datang kepada mereka agar mereka dapat mengikuti dan mentaatinya, sehingga mereka tersadar dari kelalaian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. لِتُنذِرَ قَوْمًا مَّآ أُنذِرَ ءَابَآؤُهُمْ (Agar kamu memberi peringatan kepada kaum yang bapak-bapak mereka belum pernah diberi peringatan) Yakni Kami menurunkan al-Qur’an kepadamu akan kamu memberi peringatakan kepada kaum yang nenek moyangnya belum pernah diberi peringatan sebelumnya. فَهُمْ غٰفِلُون(karena itu mereka lalai) Yakni lalai dari syari’at-syari’at dan hukum-hukum."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Kami mengutusmu dan menurunkan Al-Qur’an kepadamu agar kamu bisa memberi peringatan tentang azab kepada suatu kaum, yaitu kaum kafir Mekah yang leluhur terdekat mereka di zaman antara nabi Isa dan Muhammad tidak diberi peringatan secara langsung. Mereka adalah orang-orang yang lupa dengan keimanan, bimbingan, syariat dan hukum-hukum (Tuhan)"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Agar kamu memberi peringatan kepada suatu kaum yang nenek moyang mereka belum diberi peringatan, sehingga mereka lalai"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6. Setelah Allah bersumpah atas kerasulan Nabi dan menegakkan dalil-dalil atasnya, Dia menjelaskan betapa sangat mendesaknya kebutuhan kepada kerasulan itu dan betapa sangat diperlukan, seraya berfirman, “Agar kamu memberi peringatan kepada kaum yang bapak-bapak mereka belum pernah diberi peringatan, karena mereka lalai.” Mereka adalah bangsa Arab yang buta huruf, yaitu mereka yang masih kosong dari kitab-kitab, kehilangan para rasul. Mereka telah dilanda oleh kebodohan dan diliputi kesesatan, serta mereka telah membuat akal manusia di jagat raya ini menertawakan mereka karena kedunguan mereka. Maka Allah mengutus kepada mereka seorang rasul dari kalangan mereka sendiri yang menyucikan mereka dan mengajarkan kepada mereka al-Kitab dan hikmah, dan sesungguhnya mereka sebelumnya benar-benar berada dalam kesesatan yang nyata. Maka dia pun memberikan peringatan kepada bangsa Arab yang ummi (buta huruf) dan kepada siapa saja yang dia jumpai dari setiap yang ummi. Dan dia juga mengingatkan para ahli kitab akan kitab-kitab yang ada pada mereka. Maka Nabi menjadi nikmat bagi orang-orang Arab khususnya dan bagi bangsa-bangsa yang lain pada umumnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 6: 5-6. Al Qur’an ini wahai Nabi Allah, diturunkan dari sisi Allah agar menjadi peringatan kaummu, quraisy secara khusus dan arab secara umum, yang tidak ada pendahulu mereka, dari nenek moyang mereka , yang datang peringatan dari Allah. Yaitu memperingatkan dari keburukan dosa kesyrikan kepada Allah, oleh karena inilah terputus kerasulan untuk mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala bersumpah terhadap kerasulan Beliau dan menegakkan dalil terhadapnya, maka Allah menyebutkan tingginya tingkat kebutuhan manusia kepadanya dan sudah sangat mendesak sekali. Yakni berada di zaman fatrah (terputus pengiriman rasul). Dari iman dan petunjuk atau dari tauhid. Mereka ini adalah orang-orang Arab yang ummiy (buta huruf), mereka sebelumnya selalu kosong dari kitab dan rasul, kebodohan dan kesesatan telah merata menimpa mereka, maka Allah Subhaanahu wa Ta'aala mengutus kepada mereka seorang rasul dari kalangan mereka yang menyucikan mereka dan mengajarkan kepada mereka Al Qur’an dan hikmah (As Sunnah), padahal mereka sebelumnya berada dalam kesesatan yang nyata, maka Beliau memberi peringatan kepada orang-orang Arab yang ummi dan orang-orang yang bertemu mereka, serta mengingatkan Ahli Kitab terhadap kitab yang ada pada mereka, maka dengan diutusnya Beliau merupakan nikmat dari Allah kepada bangsa Arab secara khusus dan kepada semua manusia secara umum. Akan tetapi, mereka yang didatangi rasul itu terbagi menjadi dua golongan: (1) Golongan yang menolak apa yang Beliau bawa dan tidak menerima peringatan itu, di mana tentang mereka Allah Subhaanahu wa Ta'aala berfirman, “Sungguh, pasti berlaku perkataan (hukuman) terhadap kebanyakan mereka, kerena mereka tidak beriman.” (2) Golongan yang menerima peringatan sebagaimana yang disebutkan pada ayat 11 dalam surah Yaasiin ini."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 6",
    "description": "Al-qur'an diturunkan agar engkau, wahai nabi Muhammad, memberi peringatan untuk pertama kali kepada suatu kaum yang nenek moyangnya belum pernah diberi peringatan, tepatnya pada masa kekosongan dari risalah kenabian antara nabi isa dengan nabi Muhammad, karena itu mereka lalai dari iman dan ajaran-ajaran agama yang dibawa oleh rasul sebelumnya. 7. Karena kaum kafir mekah menolak ajakan nabi Muhammad, Allah bersumpah bahwa sungguh, pasti berlaku perkataan, yakni hukuman, terhadap kebanyakan mereka, karena mereka tidak beriman dan menolak risalah nabi Muhammad."
  }
]