[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah berfirman kepada mereka (sebagai peringatan dan mencela) “bukankah Aku telah berpesan kepada kalian melalui lisan para rasulKu, agar kalian tidak menyembah setan dan menaatinya? sesungguhnya ia adalah musuh yang nyata bagi kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "60. Bukankah Aku sudah berwasiat kepada kalian wahai Bani Adam dan memerintahkan kalian melalui lisan para rasul-Ku dan Aku berfirman kepada kalian, \"Jangan mengikuti setan dengan melakukan berbagai macam kekufuran dan kemaksiatan, sesungguhnya setan itu adalah musuh yang nyata bagi kalian.\" Bagaimana mungkin orang yang berakal mematuhi musuhnya yang tampak permusuhannya?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "60-61. Dan Allah berkata kepada orang-orang yang mendustakan itu: “Bukankah Aku telah meminta kepada kalian melalui lisan para rasul-Ku dan kitab-kitab-Ku, janganlah kalian menyembah dan mentaati setan, karena dia adalah musuh yang jelas bagi kalian. Namun sembahlah Aku Semata, sebab beribadah dan mentaati-Ku adalah jalan yang dapat mengantarkan kalian menuju keridhaan dan surga-Ku.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "60. أَلَمْ أَعْهَدْ إِلَيْكُمْ يٰبَنِىٓ ءَادَمَ أَن لَّا تَعْبُدُوا۟ الشَّيْطٰنَ ۖ (Bukankah Aku telah memerintahkan kepadamu hai Bani Adam supaya kamu tidak menyembah syaitan?) Yakni bukankah Aku telah sampaikan kepada kalian hai Bani Adam lewat lisan para rasul? Pendapat lain mengatakan yang dimaksud dengan (العهد) di sini adalah perjanjian yang diambil dari mereka ketika mereka dikeluarkan dari tulang sulbi Adam. Dan pendapat lain mengatakan yang dimaksud adalah bukti-bukti yang ada di langit dan bumi yang ditegakkan Allah bagi mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "60. Bukankah Aku telah memerintahkan dan menasehati kalian wahai anak Adam melalui para rasul bahwa jangan menaati setan yang diakui sebagai Tuhan dalam peribadatan. Sesungguhnya setan adalah musuh yang nyata bagi kalian"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bukankah Aku telah membuat janji kepada kalian} Aku berwasiat dan memerintahkan kalian melalui lisan para rasul {“wahai anak cucu Adam, janganlah kalian menyembah} janganlah kalian menaati {setan. Sesungguhnya setan itu musuh yang nyata bagi kalian} yang nyata permusuhannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "60. “bukankah Aku telah memerintahkan kepadamu,” maksudnya, telah memerintahkan dan mewasiatkan kepada kalian melalui lisan para rasulKu, dan aku katakan kepada kalian “hai Bani Adam, supaya kamu tidak menyembah setan,” maksudnya, jangan kalian menaatinya. Cercaan ini termasuk juga di dalamnya cercaan tentang semua jenis kekafiran dan maksiat, karena semuanya merupakan ketaatan kepada setan dan bentuk peribadahan kepadanya. “sesungguhnya setan itu musuh yang nyata bagi kamu,” jadi Aku telah memperingatkan kalian darinya dengan peringatan benar-benar dan Aku pun telah mewanti-wanti kalian untuk tidak mematuhinya, bahkan Akupun telah menginformasikan kepada kalian tentang apa yang dia serukan kepada kalian."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 60: Kemudian Allah menyebutkan hamba-Nya dengan janji yang akan diberikan kepada mereka, Allah berkata: Bukankah aku telah memerintahkan dan berwasiat kepada kalian wahai anak anak Adam, agar jangan kalian beribadah kepada setan dan agar jangan mentaatinya, karena sebab mereka adalah musuh yang nyata."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni melalui lisan para rasul-Ku. Yakni menaati setan. Teguran keras ini mencakup teguran keras terhadap semua kekuran dan kemaksiatan, karena sikap demikian disebabkan karena menaati setan dan menyembahnya. Oleh karena itu, kamu diperingatkan untuk menjauhinya dan tidak menaatinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 60",
    "description": "Dikatakan juga kepada orang kafir itu, 'bukankah aku dahulu telah memerintahkan kepadamu, wahai anak cucu adam, agar kamu sekali-kali tidak menyembah setan' aku bahkan telah mengutus para rasul untuk menyampaikan risalah kepadamu. Sungguh, setan itu musuh yang nyata bagi kamu karena sejak dahulu telah menyesatkan manusia. 61. Dan bukankah telah aku perintahkan juga kepadamu, wahai anak cucu adam, hendaklah kamu menyembah-ku dan menaati perintah-ku. Inilah agama islam, jalan yang lurus yang harus kamu tempuh agar kamu selamat."
  }
]