[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Aku memerintahkan kalian agar hanya menyembah-Ku semata. Beribadah kepadaKu, menaatiKu, serta mendurhakai setan, itu adalah agama yang lurus yang menyampaikan kepada ridha dan surgaKu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "61. Aku telah memerintahkan kalian -wahai Bani Adam- agar menyembah-Ku semata, jangan menyekutukan-Ku dengan apa pun. Ibadah kepada-Ku dan menaati-Ku adalah jalan lurus yang menyampaikan kepada rida-Ku dan Surga-Ku, akan tetapi kalian tidak melakukan apa yang Aku wasiatkan dan perintahkan kepada kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "61. وَأَنِ اعْبُدُونِى ۚ (dan hendaklah kamu menyembah-Ku) Yakni bukankah Aku telah mengambil janji dari kalian untuk tidak menyembah setan dan supaya kalian menyembah-Ku? هٰذَا صِرٰطٌ مُّسْتَقِيمٌ (Inilah jalan yang lurus) Yakni penyembahan kepada Allah merupakan jalan yang lurus."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "61. Aku telah memerintahkan kalian untuk menyembahKu, yaitu mengesakan dan menaatiKu. Ini adalah jalan lurus yang tidak ada penyimpangan di dalamnya. Itu adalah agama Islam"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{sembahlah Aku. Inilah jalan yang lurus”} maka sembahlah aku dengan agama yang lurus"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "61. “dan” Aku telah memerintah kalian untuk beribadah kepadaKu dengan mengerjakan perintah-perintahKu dan meninggalkan larangan-laranganKu. “inilah” maksudnya, beribadah kepadaKu, taat kepadaku, dan mendurhakai setan adalah “jalan yang lurus,” jadi, ilmu-ilmu jalan yang lurus dan amal-amalnya kembali kepada dua perkara ini. Maksudnya, namun kalian tidak memelihara perintahKu dan kalian tidak juga mengerjakan wasiatKu, malah kalian mendukung dan membela musuh kalian sendiri."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 61: Allah berkata: Bukankah Aku memerintahkan kalian wahai anak-anak Adam untuk meng-esakan Aku dalam peribadatan dan Aku telah mengabarkan kepada kalian agar kalian bertauhid dan mengikuti Rasul-Ku, itulah jalan yang lurus yang mengantarkan dari keridhaan-Ku dan kepada surga Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni beribadah hanya kepada-Ku dan menaati-Ku, serta memanfaatkan waktu luangmu untuk beribadah, minimal yang wajib. Yakni namun kamu tidak menjaga perintah-Ku dan tidak mengamalkan wasiat-Ku, dan kamu malah taat kepada setan, sehingga dia menyesatkan sebagian besar di antara kamu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 61",
    "description": "Dan bukankah telah aku perintahkan juga kepadamu, wahai anak cucu adam, hendaklah kamu menyembah-ku dan menaati perintah-ku. Inilah agama islam, jalan yang lurus yang harus kamu tempuh agar kamu selamat. 62. Janganlah kamu menyembah setan. Dan ketahuilah bahwa sungguh, ia telah menyesatkan sebagian besar di antara kamu dengan mendorong mereka untuk ingkar terhadap perintah Allah, bahkan menyekutukan-Nya. Maka, apakah kamu tidak mengerti akibat dari mengikuti langkah setan dan menempuh jalan kesesatan'."
  }
]