[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sungguh setan telah menyesatkan banyak manusia dari kebenaran. Apakah kalian (wahai orang-orang musyrik) tidak mempunyai akal yang mencegah kalian untuk mengikuti setan?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "62. Setan telah menyesatkan banyak orang dari kalian, apakah kalian tidak mempunyai akal yang menuntun kalian untuk menaati Tuhan kalian dan menyembah-Nya semata serta memperingatkan kalian agar tidak menaati setan yang merupakan musuh kalian yang sangat nyata."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "62. “Sungguh setan telah menyesatkan banyak orang dari kalian; tidakkah kalian memiliki akal yang menahan kalian agar tidak mengikuti kesesatan dan godaan setan?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "62. وَلَقَدْ أَضَلَّ مِنكُمْ جِبِلًّا كَثِيرًا ۖ (Sesungguhnya syaitan itu telah menyesatkan sebahagian besar diantaramu) Yakni setan telah menyesatkan banyak makhluk. أَفَلَمْ تَكُونُوا۟ تَعْقِلُونَ (Maka apakah kamu tidak memikirkan?) Yakni tidakkah kalian memikirkan permusuhan setan terhadap kalian sehingga kalian tidak mengikutinya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "62. Sungguh setan telah menggoda sebagian banyak golongan kalian. Apakah kalian tidak berpikir dan tidak sadar tentang permusuhan dan penyesatan setan terhadap kalian"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sungguh dia benar-benar telah menyesatkan sangat banyak orang} orang {di antara kalian. Maka apakah kalian tidak mengerti"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "62. maka dari itu ia telah menyesatkan “sebagian besar diantaramu,” artinya, banyak sekali manusia. “maka apakah kamu tidak memikirkan,” maksudnya apakah kalian tidak mempunyai akal pikiran yang bisa memerintah kalian untuk berloyalitas kepada Rabb kalian, padahal Dia adalah pelindung kalian yang haq, dan Dia melarang kalian menjadikan musuh bubuyutan kalian sebagai pelindung? Kalau sekiranya kalian mempunyai akal yang sehat, tentu kalian tidak melakukan hal itu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 62: Allah berkata: Akan tetapi kalian kufur dan tidak mentaati-Ku, tidak beramal dengan apa yang Aku telah peringatkan kepada kalian dari setan dan kalian tidak menganggap setan itu musuh kalian maka kalian tersesat dengan kesesatan yang banyak, dari jalan yang lurus. Tidakkah kalian diberikan tanda-tanda, agar kalian berfikir dan mengetahui bahwasanya setan adalah musuh kalian?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni tidakkah kamu berpikir, sehingga memilih taat kepada Tuhanmu dan tidak mengikuti setan. Seandainya kamu memiliki akal yang sehat, tentu kamu tidak akan mengikuti setan, karena akibatnya membuat kamu masuk ke dalam neraka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 62",
    "description": "Janganlah kamu menyembah setan. Dan ketahuilah bahwa sungguh, ia telah menyesatkan sebagian besar di antara kamu dengan mendorong mereka untuk ingkar terhadap perintah Allah, bahkan menyekutukan-Nya. Maka, apakah kamu tidak mengerti akibat dari mengikuti langkah setan dan menempuh jalan kesesatan'63. Dikatakan juga kepada orang kafir, 'inilah neraka jahanam, tempat bagi para pendurhaka, yang dahulu telah diperingatkan kepadamu agar kamu menjauhinya. Para rasul telah mengingatkan kamu tentangnya. '."
  }
]