[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Inilah jahanam yang dulu diancamkan kepada kalian di dunia atas kekafiran kalian kepada Allah dan pendustaan kalian terhadap rasul-rasul Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "63. Ini adalah api neraka Jahanam yang pernah diancamkan kepada kalian di dunia karena kekufuran kalian, saat itu kalian tidak melihatnya, adapun hari ini maka kalian menyaksikannya dengan mata kepala kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "63-64. Inilah neraka Jahannam yang dahulu diancamkan kepada kalian di dunia akibat kekafiran kalian kepada Allah dan pendustaan kalian terhadap rasul-rasul-Nya. masuklah kalian ke dalamnya pada hari ini, dan rasakanlah panas dan kesakitannya sebagai balasan atas kekafiran kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "63. هٰذِهِۦ جَهَنَّمُ الَّتِى كُنتُمْ تُوعَدُونَ (Inilah Jahannam yang dahulu kamu diancam (dengannya)) Yakni yang Kami ancamkan di dunia melalui lisan para Rasul."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "63. Inilah neraka Jahanam yang dijanjikan untuk kalian di dunia melalui lisan para rasul"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Inilah neraka Jahanam yang dahulu telah dijanjikan kepada kalian"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "63. apabila kalian telah mematuhi setan, memusuhi Allah yang Mahapengasih, kalian mendustakan perjumpaan denganNya dan kalian meragukan Hari kiamat, Negeri pembalasan, serta ketetapan azab telah pasti terhadap kalian, maka “inilah jahanam yang dahulu diancamkan kepada kamu,” dan kalian mendustakannya. Maka lihatlah dengan mata kepala kalian! Maka saat itulah hati mereka sangat gelisah, mata mereka terbelalak dan terjadilah al-faza’ al-akbar (ketakutan yang besar)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 63: 63-64. Inilah neraka yang telah kalian dustakan bagi Rasul Kami dan kalian mengikuti setan- setan kalian. Masuklah kalian pada hari ini di dalam neraka dan azab, sebagai balasan atas kekufuran kalian serta pengingkaran kalian dan pendustaan kalian kepada para nabi Allah dan rasul-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dikatakan kepada mereka di akhirat. Yakni yang kamu malah mendustakannya, maka sekarang lihatlah dengan mata kepalamu. Ketika itu hati mereka pun gelisah, penuh rasa takut dan pandangannya terpana. Kemudian ditambah lagi dengan diperintahkan untuk dimasukkan ke dalam neraka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 63",
    "description": "Dikatakan juga kepada orang kafir, 'inilah neraka jahanam, tempat bagi para pendurhaka, yang dahulu telah diperingatkan kepadamu agar kamu menjauhinya. Para rasul telah mengingatkan kamu tentangnya. '64. Allah berkata kepada orang-orang kafir, 'masuklah ke dalamnya dan rasakanlah pada hari ini panasnya api neraka karena dahulu kamu mengingkarinya. '."
  }
]