[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "64 Masuklah kedalamnya hari ini, cicipilah panasnya disebabkan kekafiran kalian. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "64. Masuklah kalian ke dalamnya pada hari ini, rasakanlah panasnya, kalian tinggal di sana selama-lamanya karena kekufuran kalian semasa kalian hidup di dunia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "64. اصْلَوْهَا الْيَوْمَ بِمَا كُنتُمْ تَكْفُرُونَ (Masuklah ke dalamnya pada hari ini disebabkan kamu dahulu mengingkarinya) Yakni hari ini rasakanlah panas api neraka dan masuklah ke dalamnya serta rasakanlah berbagai jenis azab di dalamnya akibat kekafiran kalian kepada Allah ketika di dunia dan ketaatan kalian kepada setan serta penyembahan kalian terhadap berhala-berhala."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "64. Masukilah dan terbakarlah olehnya di hari kiamat sebagai balasan bagi kalian atas kekufuran kalian kepada Allah, ketaatan kalian kepada setan dan pendustaan kalian kepada para rasul yang mulia"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Masuklah ke dalamnya} masuklah ke dalamnya dan rasakanlah panasnya {pada hari ini karena dahulu kamu mengingkarinya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "64. kemudian Allah menyempurnakan penjelasan diatas dengan menyuruh mereka masuk neraka. Kepada mereka dikatakan, ”masuklah kamu ke dalamnya pada hari ini disebabkan kamu dahulu mengingkarinya,” maksudnya, masuklah kalian padanya, ia akan membakar kalian dan kalian diliputi oleh panasnya hingga mencapai puncak panasnya disebabkan keingkaran kalian terhadap ayat-ayat Allah dan kalian mendustakan Rasul-RasulNYa."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 64: 63-64. Inilah neraka yang telah kalian dustakan bagi Rasul Kami dan kalian mengikuti setan- setan kalian. Masuklah kalian pada hari ini di dalam neraka dan azab, sebagai balasan atas kekufuran kalian serta pengingkaran kalian dan pendustaan kalian kepada para nabi Allah dan rasul-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 64",
    "description": "Allah berkata kepada orang-orang kafir, 'masuklah ke dalamnya dan rasakanlah pada hari ini panasnya api neraka karena dahulu kamu mengingkarinya. '65. Pada hari ini kami tutup mulut mereka sehingga tidak dapat berkata bohong atau berdalih sedikit pun. Tangan mereka akan berkata kepada kami perihal perbuatan yang mereka lakukan di dunia, dan kaki mereka akan memberi kesaksian terhadap apa yang dahulu mereka kerjakan. De-ngan demikian, mereka tidak mungkin mengelak atas dosa yang telah mereka lakukan (lihat pula: surah fu''ilat/41: 19'20)."
  }
]