[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kalau Kami berkehendak, niscaya Kami menghapus mata-mata mereka dengan menghilangkan penglihatan mereka sebagaimana Kami telah menutup mulut mereka, selanjutnya mereka akan berbondong-bondong menuju titian untuk melintasinya, mana mungkin mereka bisa melewatinya sementara penglihatan mereka telah dibutakan?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "66. Seandainya Kami berkehendak untuk melenyapkan penglihatan mereka, niscaya Kami melenyapkannya sehingga mereka tidak bisa melihat. Kemudian mereka bergegas menuju titian untuk melewatinya menuju Surga, mana mungkin mereka akan menyeberanginya padahal penglihatan mereka telah tiada."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "66. Seandainya Kami menghendaki, niscaya Kami akan menghapus penglihatan mereka, sehingga mereka tidak dapat melihat jalan yang ingin mereka lewati; akan tetapi Kami tidak menghendaki hal itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "66. وَلَوْ نَشَآءُ لَطَمَسْنَا عَلَىٰٓ أَعْيُنِهِمْ (Dan jikalau Kami menghendaki pastilah Kami hapuskan penglihatan mata mereka) Yakni Kami lenyapkan mata mereka dan Kami jadikannya tanpa lubang mata dan alis; Kami biarkan mereka dalam keadaan buta dan kebingungan serta tidak dapat melihat jalan hidayah. فَاسْتَبَقُوا۟ الصِّرٰطَ(lalu mereka berlomba-lomba (mencari) jalan) Yakni saling bersegeralah menyusuri jalan agar kalian segera melampauinya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "66. Jika berkehendak sungguh Kami membutakan mereka. Ketika mereka berlomba-lomba menuju jalan keberhasilan, bagaimana mereka akan melihat sedangkan mereka buta? Maknanya mereka tidak bisa melihat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Seandainya Kami berkehendak, niscaya Kami akan menghapus penglihatan mereka} niscaya Kami akan melenyapkan penglihatan mereka sehingga tidak tampak lubang maupun celah {sehingga mereka berlomba-lomba (mencari) jalan} sehingga mereka saling berlomba mencari jalan, agar mereka bisa menyeberang sampai surga {Maka bagaimana mereka dapat melihat} maka bagaimana mereka bisa melihat jalan, dan sungguh telah dihapus penglihatan mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "66. “dan jikalau kami menghendaki, pastilah kami hapuskan mata mereka,” yaitu dengan cara mengambil penglihatan mereka sebagaimana Kami telah menghapus kemampuan mereka bicara,” lalu mereka berlomba-lomba menuju jalan,” maksudnya, mereka segera menuju kepadanya, Karena ia adalah jalan yang dapat mengantarkan menuju surga.” Maka betapakah mereka dapat melihat?”, sebab, pandangan mata mereka telah dihapus."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 66: Kalau saja Allah mau, Allah cabut penglihatan orang-orang kafir yang mendustakan agar supaya mereka buta; maka jika mereka menginginkan untuk bersegera menuju jalan yang lurus menyeberang menuju surga, mereka tidak akan diberikan petunjuk atasnya, karena sebab mereka tidak melihat jalan yang hilang dari pandangan mata-mata mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mencari keselamatan atau mencari jalan ke surga."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 66",
    "description": "Dan jika kami menghendaki, pastilah kami hapuskan penglihatan mata mereka sehingga dengan demikian mereka berlomba-lomba mencari jalan yang terang. Namun, kami tidak melakukan hal itu karena kasih sa-yang kami agar mereka mencari jalan yang benar dan mensyukuri karunia Allah. Andaikata kami hapus penglihatan mereka maka bagaimana mungkin mereka dapat melihat karunia dan kekuasaan Allah' karena itu, tidak ada alasan bagi mereka berdalih terhadap ketetapan Allah. 67. Dan jika kami menghendaki pula, pastilah kami ubah bentuk me-reka, yakni orang-orang kafir, di tempat mereka berada sehingga mereka tidak sanggup berjalan lagi dan juga tidak sanggup kembali. Namun, hal itu tidak kami lakukan karena kasih sayang kami. Karena rahmat pula, aku masih memberi manusia kesempatan untuk bertobat dan beramal saleh meski mereka telah menyekutukan-ku."
  }
]