[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kalau Kami menghendaki, Kami akan merubah bentuk dan Kami dudukkan mereka di tempat-tempat mereka, sehingga mereka tidak bisa berjalan ke depan dan tidak pula kembali ke belakang."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "67. Seandainya Kami berkehendak untuk merubah bentuk penciptaan mereka dan mendudukkan mereka di atas kaki-kaki mereka, niscaya Kami merubah bentuk penciptaan mereka dan mendudukkan mereka di atas kaki-kaki mereka, sehingga mereka tidak bisa meninggalkan tempat mereka dan tidak bisa maju ke depan atau mundur ke belakang."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "67. Seandainya Kami menghendaki, niscaya Kami akan mengubah penciptaan mereka dan membuat mereka tetap di tempat mereka, sehingga mereka tidak dapat berjalan ke depan dan tidak pula dapat kembali kebelakang, mereka akan tetap di tempat itu tanpa bergerak. Akan tetapi Kami tidak menghendakinya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "67. وَلَوْ نَشَآءُ لَمَسَخْنٰهُمْ عَلَىٰ مَكَانَتِهِمْ (Dan jikalau Kami menghendaki pastilah Kami ubah mereka di tempat mereka berada) Yakni seandainya Kami menghendaki niscaya Kami ganti penciptaan mereka pada tempat mereka berada. Imam al-Hasan berkata: maknanya yakni Kami pasti akan dudukkan mereka sehinnga mereka tidak dapat maju atau mundur. Pendapat lain mengatakan maknanya adalah seandainya Kami menghendaki niscaya Kami akan kutuk mereka di tempat mereka melakukan kemaksiatan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "67. Jika berkehendak, sungguh Kami ubah bentuk mereka menjadi bentuk yang berada di posisi sangat buruk yang diasumsikan bahwa mereka adalah orang-orang kuat pada posisi itu dan melakukan banyak kemaksiatan sehingga mereka tidak bisa lari dan kembali. Maknanya mereka dibinasakan dan dihinakan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Seandainya Kami berkehendak, sungguh Kami akan mengubah bentuk mereka di tempat mereka} sungguh Kami akan mengubah bentuk mereka di tempat mereka berani berbuat maksiat {sehingga mereka tidak sanggup pergi} berjalan ke depan {dan tidak sanggup kembali} dan tidak pula bisa kembali ke belakang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "67. “dan jikalau kami menghendaki, pastilah kami rubah mereka di tempat mereka berada,” maksudnya, pasti Kami hilangkan gerak mereka, “maka mereka tidak sanggup berjalan lagi,” ke depan, “dan tidak pula sanggup kembali,” ke belakang untuk bisa jauh dari neraka. Artinya, mereka, orang-orang kafir itu, telah pasti mendapat ketetapan azab, dan mereka pasti akan disiksa; dan pada saat itu tidak ada tempat lain selain neraka, dan ia telah ditimpakkan, dan tidak ada keselamatan bagi siapa pun selain dengan cara menyebrangi shirath (jembatan diatas jahanam). Dan penyebrangan ini tidak akan mampu dilakukan oleh cahaya mereka sendiri. Adapun orang-orang kafir, maka Allah sama sekali tidak memberikan jaminan untuk bisa selamat drai neraka. Maka jika Dia menghendaki, niscaya Dia hapus penglihatan mereka dan membiarkan mereka bergerak, namun mereka tidak tahu bagaiamana menuju shirath sekalipun mereka berlomba bersegera kepadanya. Dan jika Allah menghendaki, niscaya Dia hilangkan gerak mereka hingga mereka tidak bisa maju dan tidak pula bisa mundur. Artinya, adalah mereka tidak bisa menyebrang, hingga mereka sama sekali tidak mendapat keselamatan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 67: Kalau saja Allah mau, Allah akan gantikan gerak-gerik mereka orang-orang kafir; Sehingga mereka tidak mampu untuk bergerak ke depan maupun ke belakang dan tidak pula mereka mendapatkan kemenangan, serta tempat kembali mereka adalah neraka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Menurut Ibnu Abbas, “(Yakni) Kami binasakan mereka.” Menurut As Suddiy, “Yakni Kami ubah bentuk mereka.” Menurut Abu Shalih, “Kami jadikan mereka batu.” Sedangkan menurut Al Hasan Al Bashri dan Qatadah, “Tentu Aku jadikan mereka duduk di atas kakinya.”Menurut Syaikh As Sa’diy, “Kami hilangkan gerakan mereka.” Ke depan. Ke belakang. Maksud ayat ini adalah, bahwa orang-orang kafir telah mendapatkan ketetapan azab, dan mereka harus disiksa. Di hadapan mereka ada neraka, di mana ia (neraka) telah ditunjukkan kepada orang-orang kafir, dan seseorang tidak ada yang dapat selamat kecuali dengan melintasi jembatan yang dibentangkan di atas neraka, sedangkan yang dapat melintasinya hanyalah orang-orang mukmin, di mana mereka berjalan dengan cahaya mereka. Adapun mereka (orang-orang kafir), tidak memiliki jaminan selamat dari neraka di sisi Allah. Jika Allah menghendaki, Dia menghapuskan penglihatan mereka dan membiarkan gerakan mereka sehingga mereka hanya dapat berjalan tetapi tidak tahu jalan, dan jika Dia menghendaki, maka Dia hilangkan juga gerakan mereka, sehingga mereka tidak dapat maju dan tidak dapat mundur. Dengan demikian, mereka tidak bisa melintasi jembatan dan tidak akan selamat. Wal ‘iyaadz billah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 67",
    "description": "Dan jika kami menghendaki pula, pastilah kami ubah bentuk me-reka, yakni orang-orang kafir, di tempat mereka berada sehingga mereka tidak sanggup berjalan lagi dan juga tidak sanggup kembali. Namun, hal itu tidak kami lakukan karena kasih sayang kami. Karena rahmat pula, aku masih memberi manusia kesempatan untuk bertobat dan beramal saleh meski mereka telah menyekutukan-ku. 68. Dan ingatlah wahai anak cucu adam, barang siapa kami panjangkan umurnya niscaya kami kembalikan dia kepada awal kejadiannya. Pada saat itu dia kembali lemah dan kurang akal, layaknya anak kecil, sehingga tidak kuat lagi melakukan ibadah yang berat. Maka, mengapa mereka tidak mengerti dan memanfaatkan kesempatan selagi muda'."
  }
]