[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Barangsiapa yang Kami panjangkan usianya sehingga dia tua renta, maka dia akan dikembalikan kepada keadannya semula saaat akalnya lemah dan jasadnya pun lemah. maka apakah mereka tidak berfikir bahwa Allah yang kuasa melakukan ini juga kuasa untuk membangkitkan mereka?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "68. Manusia mana pun yang Kami panjangkan umurnya, Kami kembalikan dia ke masa lemah. Apakah mereka tidak memikirkan dengan akal mereka dan mengetahui bahwa alam ini bukan alam kekekalan dan keabadian, bahwa alam yang kekal adalah alam Akhirat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "68. Barangsiapa yang Kami panjangkan umurnya hingga menua, maka Kami akan kembalikan keadaannya seperti ketika dia masih kecil; lemah badan dan akalnya. Tidakkah manusia berfikir bahwa Dzat Yang mampu melakukan hal ini, juga mampu membangkitkan mereka?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "68. وَمَن نُّعَمِّرْهُ نُنَكِّسْهُ فِى الْخَلْقِ ۖ( Dan barangsiapa yang Kami panjangkan umurnya niscaya Kami kembalikan dia kepada kejadian(nya)) Yakni barangsiapa yang Kami panjangkan umurnya maka Kami akan ubah fisiknya dan Kami akan menjadikannya kebalikan dari keadaannya dia dulu yang penuh kekuatan dan kebugaran; Kami ganti kekuatan mereka menjadi kelemahan, dan Kami ganti masa muda mereka dengan masa tua."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "68. Dan orang yang Kami panjangkan umurnya, Kami ubah bentuk fisiknya dan kondisinya dari kuat menjadi lemah dan cerdas menjadi pikun. Apakah mereka tidak berpikir bahwa Dzat yang berkuasa atas hal itu juga berkuasa atas sesuatu di masa depan berupa penghapusan, pengubahan dan pembangkitan sehingga mereka beriman?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Siapa saja yang Kami panjangkan umurnya} Kami panjangkan umurnya {niscaya Kami akan membalik penciptaannya} mengubah penciptaannya dan menjadikannya berlawanan dengan keadaannya sebelumnya {Maka apakah mereka tidak berpikir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "68. Allah berfirman, ”dan barangsiapa yang Kami panjangkan umurnya,” diantara manusia ini, “niscaya kami kembalikan mereka kepada kejadiannya,” niscaya ia kembali kepada kondisi awal ia diciptakan, yaitu kondisi lemah, lemah akal, dan lemah kekuatan. “maka apakah mereka tidak memikirkan,” bahwa seorang manusia itu kurang (lemah) dari segala sisi? Maka hendaklah mereka memanfaatkan kekuatan dan akal pikiran mereka dan menggunakannya dalam ketaatan kepada Rabbnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 68: Allah menyebutkan diantara dari sunatullah pagi makhluk-Nya yaitu menjadikan manusia kembali lemah dalam masa tuanya sebagaimana ia diciptakan pertama kali, maka tidakkah kalian berfikir akan hal ini? Tidakkah bagi kalian memiliki akal yang mengetahui bahwasanya yang menciptakan manusia adalah yang maha mampu membangkitkan setelah kematian?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya, kembali menjadi lemah dan kurang akal. Bahwa yang berkuasa seperti itu berkuasa pula membangkitkan yang telah mati, sehingga mereka pun mau beriman. Atau maksudnya, maka mengapa mereka tidak mengerti bahwa manusia memiliki kekurangan dari berbagai sisi, oleh karena itu seharusnya mereka gunakan kekuatan dan akal mereka untuk ketaatan kepada Allah Subhaanahu wa Ta'aala."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 68",
    "description": "Dan ingatlah wahai anak cucu adam, barang siapa kami panjangkan umurnya niscaya kami kembalikan dia kepada awal kejadiannya. Pada saat itu dia kembali lemah dan kurang akal, layaknya anak kecil, sehingga tidak kuat lagi melakukan ibadah yang berat. Maka, mengapa mereka tidak mengerti dan memanfaatkan kesempatan selagi muda'69. Kumpulan ayat berikut menyangkal orang kafir yang menuduh Al-Qur'an adalah syair ciptaan nabi Muhammad. Dan kami tidak meng-ajarkan syair kepadanya dan bersyair itu tidaklah pantas baginya karena syair adalah buah khayalan. Nabi Muhammad adalah rasul yang Allah tugaskan untuk menyampaikan wahyu, dan Al-Qur'an itu adalah wahyu Allah yang kandungannya tidak lain hanyalah pelajaran untuk memperbaiki umat dan merupakan kitab yang jelas dalam menerangkan hukum dan syariat Allah."
  }
]