[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "69-70. Dan Kami tidak mengajarkan syair kepada hamba kami, Muhammad, dan tidak patut baginya untuk menjadi penyair, apa yang dia bawa adalah dzikir (peringatan) dimana orang-orang yang berakal mengambil nasihat darinya. dan al-quran membedakan dengan terang antara yang haq dengan yang batil, hokum-hukumnya jelas, hikmah-hikmah dan nasihat-nasiahnya juga jelas. Agar dia memberi peringatan kepada orang yang hatinya hidup dan bashirahnya bercahaya, sedangkan azab berhak dipikul oleh orang-orang yang ingkar kepada Allah, karena al-quran telah menegakkan hujjah Allah yang mendalam atas mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "69. Kami tidak mengajari Muhammad -ṣallallāhu 'alaihi wa sallam- syair, dan memang itu tidak patut baginya, karena itu bukan tabiatnya, bukan tuntutan nalurinya, sehingga kalian bisa menuduhnya sebagai penyair. Yang Kami ajarkan kepadanya tidak lain adalah zikir dan Al-Qur`ān yang nyata bagi siapa yang merenungkannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "69-70. Dan Kami tidak mengajarkan syair kepada Nabi Muhammad, dan memang itu tidak layak baginya dan dia tidak pantas menjadi penyair. Apa yang didatangkannya itu tidak lain adalah peringatan bagi orang yang berakal dan bacaan yang mulia yang menjelaskan bukti-bukti kebenaran, sebagai peringatan bagi orang yang hatinya hidup serta peringatan dari azab bagi orang-orang yang mendustakan Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "69. وَمَا عَلَّمْنٰهُ الشِّعْرَ (Dan Kami tidak mengajarkan syair kepadanya (Muhammad)) Allah membantah kalau al-Qur’an adalah sya’ir dan membantah kalau Nabi adalah penyair. وَمَا يَنۢبَغِى لَهُۥٓ ۚ( dan bersyair itu tidaklah layak baginya) Yakni tidak pantas dia bersyair dan syair itu tidak akan keluar darinya dan jika dia ingin bersyair dia pasti akan kesulitan sebagaimana Allah menjadikannya ‘ummi’ yang tidak dapat membaca dan menulis. إِنْ هُوَ إِلَّا ذِكْرٌ(Al Quran itu tidak lain hanyalah pelajaran) Yakni al-Qur’an hanyalah peringatan dan pelajaran. وَقُرْءَانٌ مُّبِينٌ(dan kitab yang memberi penerangan) Yakni salah satu kitab dari Allah yang dibaca yang mengandung hukum-hukum syariat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "69. Dan Kami tidak mengajarkan syair kepada utusan Kami Muhammad. Dia juga tidak dibenarkan untuk menjadi penyair. Al-Qur’an ini tidak lain hanyalah pelajaran, pengingat dan kitab nyata yang menampakkan hukum-hukum, syariat dan lainnya yang berasal dari Allah, Tuhan semesta alam, bukan syair sebagaimana yang kalian reka-reka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami tidak mengajarkan syair kepadanya dan syair itu tidaklah pantas baginya. Itu tidak lain hanyalah pelajaran dan Al-Qur’an yang jelas} terang lagi jelas bagi orang yang merenungi dan memikirkannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "69. Allah menyucikan NabiNya, Muhammad dari tuduhan yang dialamatkan oleh kaum Musyrikin kepadanya, yaitu bahwa dia adalah seorang penyihir, dan apa yang ia bawa (alqur’an) itu adalah syair. Maka Allah berfirman ”dan kami tidak mengajarkan syair kepadanya (nabi Muhammad), dan tidaklah layak baginya,” menjadi seorang penyair. Maksudnya, ini termasuk kategori mustahil kalau beliau menjadi seorang penyair, sebab beliau adalah orang yang cerdas dan mendapat petunjuk, sedangkan para penyair itu sesat dan diikuti oleh orang-orang yang sesat; dan juga karena sesungguhnya Allah telah melumpuhkan semua syubhat (tuduhan-tuduhan miring,) dari Rasulullah yang dihembuskan oleh orang-orang yang sesat. Allah membantah kalau Nabi itu bisa membaca atau menulis dan Dia menginformasikan bahwa Dia tidak pernah mengajarkan syair kepadanya dan itu tidak pantas baginya. ”alquran itu tidak lain hanyalah pelajaran yang kitabnya yang memberi penerangan,” maksudnya, tidaklah apa yang dibawa oleh Muhammad ini melainkan pelajaran yang dapat dipelajari oleh orang-orang yang berakal mengenai tuntutan-tuntutan agama, ia mencakup semuanya dengan sempurna, dan ia juga mengingatkan akal kepada apa yang telah Allah pusatkan dalam fitrahnya, yaitu perintah kepada segala yang baik dan larangan dari segala yang buruk “kitab yang memberi penerangan,” maksudnya, menerangkan segala yang dibutuhkan penjelasannya. Maka dari itu ma’mul (objek penderita) nya tidak disebutkan, agar menunjukkan bahwa alquran itu menjelaskan seluruh yang haq dan yang batil. yaitu dalilnya yang terperinci dan global, dan yang batil dengan dalil-dalil kebatilannya, Allah menurunkan yang demikian juga kepada para rosulNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 69: Allah menyangkal bahwasanya Nabi Muhammad adalah penyair, mustahil Allah mengajarkan syair; Allah mengutusnya untuk membawa cahaya petunjuk ketuhanan pada umat ini."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala membersihkan Nabi-Nya Muhamma shallallahu 'alaihi wa sallam dari tuduhan yang disampaikan orang-orang kafir, yaitu bahwa Beliau adalah penyair dan bahwa yang Beliau bawa adalah syair. Maksudnya tidak mungkin Beliau penyair karena Beliau adalah seorang yang cerdas dan memperoleh petunjuk, sedangkan para penyair rata-rata orang yang sesat dan diikuti oleh orang-orang yang sesat, dan karena Allah Subhaanahu wa Ta'aala telah menyingkirkan semua syubhat yang dipakai orang-orang yang tersesat untuk mengingkari kerasulan Beliau, Beliau seorang yang tidak mampu baca-tulis sehingga apa yang Beliau bawa adalah betul-betul wahyu dari Allah ‘Azza wa Jalla. Allah juga memberitahukan bahwa Dia tidak mengajarkan syair kepadanya, dan hal itu tidak pantas baginya. Atau bisa juga maksudnya, tidak mudah baginya membuat syair, yakni Beliau tidak mampu membuatnya, sehingga apa yang Beliau bawa bukanlah syair. Yakni peringatan untuk mengingatkan orang-orang yang berakal terhadap semua tuntutan agama, Al Qur’an mengandung semua tuntutan itu, serta mengingatkan akal apa yang Allah tanamkan dalam fitrahnya berupa perintah mengerjakan semua yang baik dan melarang semua yang buruk. Menjelaskan hukum-hukum dan hal lain yang dibutuhkan. Tidak disebutkan ma’mul (objeknya) untuk menerangkan bahwa Al Qur’an menerangkan semua yang hak dengan dalil-dalilnya yang tafshil (rinci) maupun ijmal (garis besar), demikian pula menerangkan yang batil dan dalil-dalil kebatilannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 69",
    "description": "Kumpulan ayat berikut menyangkal orang kafir yang menuduh Al-Qur'an adalah syair ciptaan nabi Muhammad. Dan kami tidak meng-ajarkan syair kepadanya dan bersyair itu tidaklah pantas baginya karena syair adalah buah khayalan. Nabi Muhammad adalah rasul yang Allah tugaskan untuk menyampaikan wahyu, dan Al-Qur'an itu adalah wahyu Allah yang kandungannya tidak lain hanyalah pelajaran untuk memperbaiki umat dan merupakan kitab yang jelas dalam menerangkan hukum dan syariat Allah. 70. Kami wahyukan Al-Qur'an kepada nabi Muhammad agar dia memberi peringatan kepada orang-orang yang hidup hatinya sehingga bisa mengambil pelajaran darinya dan agar dia memberi peringatan serta bukti yang pasti akan ketetapan dan azab terhadap orang-orang kafir yang mengingkari wahyu itu."
  }
]