[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "7-8. Sungguh azab memang patut ditimpakan kepada kebanyakan orang-orang kafir tersebut, setelah kebenaran disampaikan kepada mereka namun mereka menolaknya. Mereka tidak membenarkan Allah dan RasulNya, serta tidak melaksanakan SyariatNya. Sesungguhnya Kami menjadikan orang-orang kafir yang mana kebenaran telah disampaikan kepada mereka namun mereka menolaknya dan bersikukuh di atas kekafiran dan tidak beriman, seperti orang yang dibelenggu lehernya dengan rantai, lalu tangan dan leher mereka disatukan dibawah dagu mereka, sehingga mereka terpaksa mendongakkan kepala ke langit. Mereka terbelenggu dari segala macam kebaikan, mereka tidak melihat kebenaran dan tidak mendapatkan petunjuk kepadanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Sungguh azab Allah telah layak ditimpakan kepada kebanyakan dari mereka sesudah mereka mengetahui kebenaran dari Allah melalui lisan rasul-Nya lalu mereka tidak beriman kepadanya, mereka tetap di atas kekufuran mereka, tidak mempercayai Allah dan rasul-Nya, tidak mengamalkan kebenaran yang dibawa oleh rasul."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "7. Sebagian besar dari mereka berhak mendapat azab di dunia dan di akhirat. Ilmu dan ketetapan Kami telah menyatakan, bahwa mereka bukan orang-orang yang beriman."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. لَقَدْ حَقَّ الْقَوْلُ (Sesungguhnya telah pasti berlaku perkataan (ketentuan Allah)) Yakni ketentuan azab bagi mereka. عَلَىٰٓ أَكْثَرِهِمْ(terhadap kebanyakan mereka) Mereka adalah orang yang mati dalam keadaan kafir. فَهُمْ لَا يُؤْمِنُونَ(kerena mereka tidak beriman) Sebab Allah telah mengetahui kekafiran yang terus menerus dilakukan oleh sebagian mereka sampai mereka mati dalam keadaan itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Sungguh kebanyakan orang-orang Arab Mekah yang menyembah berhala layak menerima azab akibat keteguhan mereka atas kesyirikan. Mereka tidak membenarkan apa yang dibawa oleh Rasulallah SAW."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh benar-benar berlaku perkataan} azab itu pasti berlaku {terhadap kebanyakan mereka, maka mereka tidak akan beriman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7. Akan tetapi mereka, yakni orang-orang yang mana kamu (Nabi Muhammad) diutus untuk memberikan peringatan di tengah mereka, setelah engkau berikan peringatan, mereka terbagi menjadi dua golongan: Satu golongan menolak apa yang engkau bawa dan tidak menerima peringatan. Mereka adalah orang-orang yang dikatakan ntentang mereka, “Sungguh telah pasti berlaku perkataan (ketentuan Allah) terhadap kebanyakan mereka, karena mereka tidak beriman.” Maksudnya, takdir dan kehendak Allah berlaku kepada mereka, yaitu mereka terus pada kekafiran dan kesyirikannya. Sesungguhnya ketetapan Allah berlaku terhadap mereka setelah kebenaran ditawarkan kepada mereka lalu mereka menolaknya. Maka saat itulah mereka dihukum dengan dikunci mati hati mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 7: Allah menjelaskan bahwa didatangkannya adzab adalah kewajiban untuk kebanyakan mereka orang-orang musyrik dari kaum Muhammad ﷺ, setelah mereka di atas kekufuran dan syirik kepada Allah. Mereka tidak beriman dengan apa yang datang dari ayat yang jelas, yang menunjukkan atas kebenaran risalah Muhammad ﷺ dan kenabiannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni berlaku pada mereka qadha’ dan kehendak-Nya, bahwa mereka senantiasa dalam kekafiran dan kemusyrikan, dan dijatuhkan kepada mereka perkataan (hukuman) karena sebelumnya mereka telah disodorkan kebenaran, lalu mereka menolaknya, maka sebagai hukumannya hati mereka dicap."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 7",
    "description": "Karena kaum kafir mekah menolak ajakan nabi Muhammad, Allah bersumpah bahwa sungguh, pasti berlaku perkataan, yakni hukuman, terhadap kebanyakan mereka, karena mereka tidak beriman dan menolak risalah nabi Muhammad. 8. Allah menggambarkan kondisi kaum kafir tersebut dengan firman-Nya, 'sungguh, kami telah memasang belenggu yang diikat di leher mereka, lalu tangan mereka diangkat ke dagu, karena itu kepala mereka tertengadah dan mendongak sehingga tidak dapat menunduk apalagi bergerak dengan bebas."
  }
]