[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "69-70. Dan Kami tidak mengajarkan syair kepada hamba kami, Muhammad, dan tidak patut baginya untuk menjadi penyair, apa yang dia bawa adalah dzikir (peringatan) dimana orang-orang yang berakal mengambil nasihat darinya. dan al-quran membedakan dengan terang antara yang haq dengan yang batil, hokum-hukumnya jelas, hikmah-hikmah dan nasihat-nasiahnya juga jelas. Agar dia memberi peringatan kepada orang yang hatinya hidup dan bashirahnya bercahaya, sedangkan azab berhak dipikul oleh orang-orang yang ingkar kepada Allah, karena al-quran telah menegakkan hujjah Allah yang mendalam atas mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "70. Agar ia memperingatkan siapa yang hatinya hidup dan nalurinya bersinar, karena dia lah yang mengambil faedah darinya. Sedangkan azab akan menimpa orang-orang kafir, karena hujah telah tegak atas mereka dengan diturunkannya kitab dan telah sampainya dakwah kepada mereka, maka mereka tidak mempunyai alasan untuk membela diri."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "70. لِّيُنذِرَ (supaya ia memberi peringatan) Yakni al-Qur’an. مَن كَانَ حَيًّا(kepada orang-orang yang hidup (hatinya)) Yakni hati yang sehat yang mau menerima kebenaran dan enggan menerima kebatilan. وَيَحِقَّ الْقَوْلُ عَلَى الْكٰفِرِينَ(dan supaya pastilah (ketetapan azab) terhadap orang-orang kafir) Yakni ketetapan azab harus diberikan bagi orang yang terus menerus dalam kekafiran yang enggan beriman kepada Allah dan rasul-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "70. Supaya dengan Al-Qur’an itu dia bisa mengingatkan orang berakal yang paham dan mengerti apa yang diucapkan olehnya dengan Al-Qur’an. Dan azab itu diwajibkan dan ditetapkan untuk orang yang memilih kekufuran. Mereka itu layaknya orang mati yang tidak bisa berpikir tentang apa yang diucapkannya dengan Al-Qur’an"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{agar dia memberi peringatan kepada orang-orang yang hidup} hidup hatinya {dan agar ketetapan itu pasti} agar ketetapan azab itu pasti terjadi {bagi orang-orang kafir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "70. “supaya dia (nabi Muhammad) memberi peringatan kepada orang-orang yang hidup,” maksudnya, yang hidup hatinya dan sadar. Dialah orang yang bisa menjadi baik di atas al qur’an ini dan bertambah ilmu dan amal darinya. Dan alqur’an bagi hatinya laksana hujan bagi tanah yang subur lagi bersih. “dan supaya pastilah ketetapan terhadap orang-orang yang kafir,” karena hujjah Allah telah ditegakkan terhadap mereka dan protes mereka terputus, sehingga tidak sedikitpun alasan dan syubhat yang masih tersisa yang mereka miliki yang bisa mereka jadikan dalil."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 70: Ketahuilah wahai manusia bahwasanya Allah menurunkan Al Quran ini kepada Muhammad; sebagai peringatan bagi siapa yang hatinya hidup dan faham, Adapun bagi siapa yang kafir dan sesaat maka mereka akan tetap dalam keadaan syirik dan mengingkari para rasul Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni yang hidup hatinya. Oleh karena itu, dengan siraman Al Qur’an, hatinya akan tumbuh, ilmu dan amalnya akan bertambah olehnya, dan Al Qur’an bagi hati orang mukmin ibarat air hujan yang disiramkan kepada tanah yang baik. Karena hujjah Allah telah tegak kepada mereka, dan alasan mereka telah terputus, sehingga tidak ada sedikit pun uzur dan syubhat yang dapat diterima dari mereka. Dan orang-orang yang kafir itu seperti orang-orang yang mati dan tanah keras yang tidak menumbuhkan tanaman, sehingga pembacaan Al Qur’an tidak bermanfaat bagi mereka dan tidak membuat hatinya tumbuh sebagaimana tumbuhnya tanah yang baik."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 70",
    "description": "Kami wahyukan Al-Qur'an kepada nabi Muhammad agar dia memberi peringatan kepada orang-orang yang hidup hatinya sehingga bisa mengambil pelajaran darinya dan agar dia memberi peringatan serta bukti yang pasti akan ketetapan dan azab terhadap orang-orang kafir yang mengingkari wahyu itu. 71. Kami telah memberi peringatan kepada orang-orang kafir itu. Dan tidakkah mereka melihat bahwa kami telah menciptakan hewan ternak untuk mereka seperti unta, sapi, dan kambing, yaitu sebagian dari apa yang telah kami ciptakan dengan kekuasaan kami, lalu mereka menguasainya untuk memperoleh manfaat darinya sedemikian rupa' seharusnya me-reka mensyukuri hal tersebut, bukan mengingkarinya."
  }
]