[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah para makhluk tidak melihat bahwa Kami menciptakan ternak-ternak untuk mereka, Kami menundukannya untuk mereka, lalu mereka bisa mengendalikan ternak-ternak itu?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "71. Apakah mereka tidak melihat bahwa Kami menciptakan untuk mereka hewan ternak, mereka menguasai hewan-hewan tersebut, mereka menggunakannya untuk kemaslahatan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "71. Tidakkah manusia melihat bahwa Kami menciptakan bagi mereka berbagai jenis hewan ternak, seperti unta, sapi, kambing, dan lain sebagainya. Dan Kami jadikan hewan-hewan itu dalam kuasa mereka, mereka dapat mengarahkannya sesuai apa yang mereka kehendaki."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "71. أَوَلَمْ يَرَوْا۟ أَنَّا خَلَقْنَا لَهُم مِّمَّا عَمِلَتْ أَيْدِينَآ أَنْعٰمًا (Dan apakah mereka tidak melihat bahwa sesungguhnya Kami telah menciptakan binatang ternak untuk mereka yaitu sebahagian dari apa yang telah Kami ciptakan dengan kekuasaan Kami sendiri) Ataukah mereka tidak berfikir dan menghayati bahwa Kami ciptakan bagi mereka sapi, kambing, dan unta tanpa bantuan seorangpun atau sekutu. فَهُمْ لَهَا مٰلِكُونَ (lalu mereka menguasainya) Yakni mereka dapat mengendalikan dan mengaturnya, mereka dapat mengarahkannya sesuai keinginan mereka; seandainya Kami menciptakannya sebagai hewan liar niscaya ia akan lari dari mereka dan tidak akan mampu mengendalikannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "71. Apakah orang-orang musyrik itu tidak mengetahui (Istifham berfungsi untuk menginformasikan) bahwa Aku telah menciptakan bagi mereka hewan-hewan ternak (yaitu unta, sapi dan kambing). Lalu mereka memiliki, mengendalikan dan mengaturnya sesuai kehendak mereka?!"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah mereka tidak mengetahui bahwa Kami telah menciptakan untuk mereka hewan-hewan ternak dari ciptaan tangan Kami, lalu mereka menjadi pemiliknya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "71-73. Allah memerintahkan hamba-hambaNya untuk memperhatikan (merenungkan) kepada apa yang ditundukkan dan dipatuhkan oleh Allah kepada mereka, yaitu hewan ternak dan menjadikan mereka dapat memilkinya, dan hewan-hewan itu patuh kepada mereka pada setiap perintah yang mereka kehendaki; dan bahwa sesungguhnya Allah menciptakan banyak manfaat pada hewan-hewan ternak itu untuk mereka, seperti untuk mengangkut mereka, mengangkut barang-barang bawaan, harta benda dan barang-barang dagangan mereka dari satu tempat ketempat lain, dan mereka juga dapat mengkonsumsi binatang-binatang ternak tersebut. Dan juga manfaat untuk kehangatan badan, dan dari kulit dan bulunya dapat dijadikan perabot dan alat-alat untuk kesenangan hingga waktu yang telah ditentukan. Dan padanya terdapat manfaat sebagai perhiasan dan keindahan dan berbagai manfaat lainnya yang sudah kita saksikan. “maka mengapakah mereka tidak bersyukur,” kepada Allah yang telah mengaruniakan nikmat-nikmat tersebut dan tulus beribadah hanya kepadaNya, serta tidak menikmatinya dengan cara yang kosong dari ibrah dan fikrah (pelajaran dan penghayatan)?"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 71: Allah memerintahkan hamba-Nya untuk melihat apa yang menetap atas kenikmatan-kenikmatan yang beraneka ragam, Allah berkata: Tidakkah kalian melihat kekuasaan Allah yang bahwasanya Allah menciptakan kenikmatan-kenikmatan ini karena sebab diri-diri kalian. Kemudian Allah yang memiliki dan berkuasa atas kalian sebagaimana yang Allah kehendaki."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memerintahkan hamba-hamba-Nya untuk memperhatikan makhluk yang Allah tundukkan untuk mereka seperti halnya hewan ternak, Dia menjadikan mereka memilikinya, selalu taat memenuhi apa yang mereka inginkan, Dia juga menjadikan di dalamnya berbagai manfaat yang banyak untuk mereka seperti dapat membawa mereka, membawa beban berat milik mereka serta perlengkapan mereka dari tempat yang satu ke tempat yang lain, dan mereka juga dapat memakannya, dapat memanfaatkan kulitnya untuk menghangatkan badan, demikian pula memanfaatkan kulitnya dan bulunya sebagai perlengkapan rumah tangga atau sebagai kesenangan sampai waktu yang ditentukan, dan manfaat lainnya yang diperoleh dari hewan tersebut. Yaitu unta, sapi dan kambing. Yakni Kami menciptakannya sendiri tanpa ada yang membantu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 71",
    "description": "Kami telah memberi peringatan kepada orang-orang kafir itu. Dan tidakkah mereka melihat bahwa kami telah menciptakan hewan ternak untuk mereka seperti unta, sapi, dan kambing, yaitu sebagian dari apa yang telah kami ciptakan dengan kekuasaan kami, lalu mereka menguasainya untuk memperoleh manfaat darinya sedemikian rupa' seharusnya me-reka mensyukuri hal tersebut, bukan mengingkarinya. 72. Dan tidak hanya menciptakan hewan-hewan itu, kami pun menundukkannya untuk mereka, lalu sebagiannya mereka manfaatkan untuk menjadi tunggangan dan alat angkut mereka serta barang-barang me-reka, dan sebagian dari hewan-hewan itu kami ciptakan untuk mereka makan dagingnya."
  }
]