[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Kami menundukannya untuk mereka, sehingga diantara ternak-ternak itu ada yang mereka kendarai dalam perjalanan, ada yang mereka gunakan untuk membawa beban, dan ada yang mereka makan dagingnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "72. Kami menundukkan hewan-hewan tersebut bagi mereka sehingga hewan-hewan tersebut tunduk kepada mereka. Mereka mengendarai punggung sebagiannya dan meletakkan barang-barang mereka di atasnya serta mereka juga makan daging sebagian lainnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "72. Dan Kami jadikan hewan-hewan itu tunduk kepada mereka; sebagiannya dapat mereka pakai sebagai tunggangan dan untuk memuat barang-barang berat mereka, dan sebagian lainnya dapat mereka makan dagingnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "72. وَذَلَّلْنٰهَا لَهُمْ (Dan Kami tundukkan binatang-binatang itu untuk mereka) Yakni Kami menjadikannya tuntuk terhadap mereka, mentaati sesuai manfaat yang mereka inginkan bahkan ketika akan disembelih atau diberikan kepada anak kecil pasti ia akan tetap mentaatinya atau jika ditakut-takutinya pasti ia akan takut. فَمِنْهَا رَكُوبُهُمْ (maka sebahagiannya menjadi tunggangan mereka) Yakni sebagian menjadi hewan tunggangan yang mereka tunggangi. وَمِنْهَا يَأْكُلُونَ (dan sebahagiannya mereka makan) Yakni daging dan susunya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "72. Kami juga menjadikan hewan ternak itu jinak, tunduk, tidak liar dan tidak menolak kehendak mereka sampai disembelih. Sebagian di antaranya ada yang menjadi kendaraan mereka dan sisanya ada yang mereka makan dagingnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami menundukkannya} menundukkannya {untuk mereka. Sebagian di antaranya menjadi tunggangan mereka dan sebagian lain mereka makan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "71-73. Allah memerintahkan hamba-hambaNya untuk memperhatikan (merenungkan) kepada apa yang ditundukkan dan dipatuhkan oleh Allah kepada mereka, yaitu hewan ternak dan menjadikan mereka dapat memilkinya, dan hewan-hewan itu patuh kepada mereka pada setiap perintah yang mereka kehendaki; dan bahwa sesungguhnya Allah menciptakan banyak manfaat pada hewan-hewan ternak itu untuk mereka, seperti untuk mengangkut mereka, mengangkut barang-barang bawaan, harta benda dan barang-barang dagangan mereka dari satu tempat ketempat lain, dan mereka juga dapat mengkonsumsi binatang-binatang ternak tersebut. Dan juga manfaat untuk kehangatan badan, dan dari kulit dan bulunya dapat dijadikan perabot dan alat-alat untuk kesenangan hingga waktu yang telah ditentukan. Dan padanya terdapat manfaat sebagai perhiasan dan keindahan dan berbagai manfaat lainnya yang sudah kita saksikan. “maka mengapakah mereka tidak bersyukur,” kepada Allah yang telah mengaruniakan nikmat-nikmat tersebut dan tulus beribadah hanya kepadaNya, serta tidak menikmatinya dengan cara yang kosong dari ibrah dan fikrah (pelajaran dan penghayatan)?"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 72: Allah menjadikan binatang-binatang ternak ini bagi kalian, yang di anatara darinya untuk dijadikan tunggangan ketika safar, kemudian untuk dijadikan hewan pembawa beban-beban berat, dan di antaranya lagi ada yang dipergunakan sebagai penjaga dan di antaranya lagi dijadikan untuk dikonsumsi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 72",
    "description": "Dan tidak hanya menciptakan hewan-hewan itu, kami pun menundukkannya untuk mereka, lalu sebagiannya mereka manfaatkan untuk menjadi tunggangan dan alat angkut mereka serta barang-barang me-reka, dan sebagian dari hewan-hewan itu kami ciptakan untuk mereka makan dagingnya. 73. Dan mereka dapat pula memperoleh berbagai manfaat berupa bahan pakaian dan minuman darinya, yakni dari hewan-hewan tersebut (lihat pula: surah an-na'l/16: 80). Maka, mengapa mereka tidak bersyukur kepada Allah yang telah menyediakan itu semua untuk keperluan me-reka'."
  }
]