[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka juga mendapatkan manfaat-manfaaat lain yang bisa mereka petik, seperti manfaat wol, bulu dan rambut sebagai peralatan dan pakaian dan lain-lainnya, dan mereka juga minum susunya. Maka mengapa mereka tidak bersyukur kepada Allah yang telah memberikan nikmat-nikmat ini kepada mereka dengan mengikhlaskan ibadah hanya kepadaNya?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "73. Mereka juga mendapatkan manfaat-manfaat lain selain mengendarai dan memakan dagingnya, seperti bulunya, rambutnya, kulitnya dan harganya. Darinya mereka membuat permadani dan pakaian. Mereka juga bisa meminum dari susunya. Mengapa mereka tidak bersyukur kepada Allah yang telah memberi mereka nikmat-nikmat tersebut dan selainnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "73. Dan Kami menjadikan padanya berbagai manfaat lain; mereka dapat memanfaatkan bulu dan rambutnya sebagai peralatan, kain, dan lain sebagainya. Mereka juga dapat meminum air susunya untuk menghilangkan dahaga dan mengembalikan kekuatan mereka. Tidakkah mereka bersyukur kepada Allah atas segala kenikmatan ini yang mereka dapatkan tanpa harus bersusah payah, sehingga mereka beriman dan mengesakan-Nya, dan menggunakan segala kenikmatan dari-Nya untuk hal yang Dia ridhai?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "73. وَلَهُمْ فِيهَا مَنٰفِعُ (Dan mereka memperoleh padanya manfaat-manfaat) Berupa bulu, wol, dan rambut hewan-hewan itu; serta sebagai alat angkut dan bekerja di kebun. وَمَشَارِبُ ۖ( dan minuman) Yakni mereka meminum darinya susu segar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "73. Dan bagi mereka dalam hewan ternak ini terdapat banyak manfaat seperti woolnya, bulunya, rambutnya, pemberian beban di atasnya dan lain-lain serta minuman dari susunya. Apakah mereka tidak bersyukur atas nikmat yang diberikan oleh Allah melalui hewan ternak itu sehingga mereka mau beriman?!"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Padanya terdapat berbagai manfaat dan minuman untuk mereka. Apakah mereka tidak bersyukur"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "71-73. Allah memerintahkan hamba-hambaNya untuk memperhatikan (merenungkan) kepada apa yang ditundukkan dan dipatuhkan oleh Allah kepada mereka, yaitu hewan ternak dan menjadikan mereka dapat memilkinya, dan hewan-hewan itu patuh kepada mereka pada setiap perintah yang mereka kehendaki; dan bahwa sesungguhnya Allah menciptakan banyak manfaat pada hewan-hewan ternak itu untuk mereka, seperti untuk mengangkut mereka, mengangkut barang-barang bawaan, harta benda dan barang-barang dagangan mereka dari satu tempat ketempat lain, dan mereka juga dapat mengkonsumsi binatang-binatang ternak tersebut. Dan juga manfaat untuk kehangatan badan, dan dari kulit dan bulunya dapat dijadikan perabot dan alat-alat untuk kesenangan hingga waktu yang telah ditentukan. Dan padanya terdapat manfaat sebagai perhiasan dan keindahan dan berbagai manfaat lainnya yang sudah kita saksikan. “maka mengapakah mereka tidak bersyukur,” kepada Allah yang telah mengaruniakan nikmat-nikmat tersebut dan tulus beribadah hanya kepadaNya, serta tidak menikmatinya dengan cara yang kosong dari ibrah dan fikrah (pelajaran dan penghayatan)?"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 73: Allah jug menjadikan hewan-hewan ini dengan manfaat yang lain yang kalian bisa manfaatkan, maka tidakkah rasa syukur itu diberikan kepada Yang Memberi Kenikmatan ?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Seperti bulunya, kulitnya dan rambutnya. Seperti susunya. Kepada yang memberikan nikmat itu, yaitu Allah Subhaanahu wa Ta'aala dengan beriman dan beribadah hanya kepada-Nya dan tidak hanya bersenang-senang saja tanpa mengambil pelajaran daripadanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 73",
    "description": "Dan mereka dapat pula memperoleh berbagai manfaat berupa bahan pakaian dan minuman darinya, yakni dari hewan-hewan tersebut (lihat pula: surah an-na'l/16: 80). Maka, mengapa mereka tidak bersyukur kepada Allah yang telah menyediakan itu semua untuk keperluan me-reka'74. Dan alih-alih bersyukur atas manfaat yang orang-orang kafir itu dapatkan dari hewan-hewan tersebut, mereka justru kufur dan meng-ambil sesembahan selain Allah. Mereka menjadikan berhala atau benda-benda lain yang dianggap memiliki kekuatan sebagai sesembahan agar keinginan mereka terwujud dan mereka mendapat pertolongan darinya."
  }
]