[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang musyrik mengangkat tuhan-tuhan lain yang mereka sembah selain Allah dengan harapan tuhan-tuhan itu bisa menolong mereka dengan menyelamatkan mereka dari siksaan Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "74. Orang-orang musyrikin mengangkat selain Allah sebagai tuhan-tuhan yang mereka sembah dengan harapan bahwa tuhan-tuhan tersebut menolong dan menyelamatkan mereka dari azab Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "74. Orang-orang musyrik menjadikan tuhan-tuhan yang mereka sembah selain Allah, dengan harapan tuhan-tuhan itu dapat menyelamatkan dan mendatangkan manfaat bagi mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "74. وَاتَّخَذُوا۟ مِن دُونِ اللهِ ءَالِهَةً (Mereka mengambil sembahan-sembahan selain Allah) Seperti patung-patung dan hal lain yang mereka sembah, padahal itu tidak memiliki kuasa apapun dan tidak bermanfaat sedikitpun bagi mereka, serta tidak ada keuntungan sedikitpun yang mereka dapatkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "74. Mereka menjadikan tuhan selain Allah dari berhala dan semacamnya untuk disembah seraya berharap tuhan-tuhan itu menolong mereka dan melindungi mereka dari azab"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka menjadikan sembahan selain Allah agar mereka mendapat pertolongan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "74-75. ini adalah penjelasan kepalsuan sesembahan-sesembahan kaum musyrikin yang mereka angkat (ambil) selain Allah, mereka harapkan pertolongan dan syafa’atnya. Sesungguhnya sesembahan-sesembahan tersebut benar-benar sangat rapuh, “tidak dapat menolong mereka,” dan bahkan mereka tidak dapat menolong diri mereka sendiri. Kalau mereka tidak mampu menolong diri mereka sendiri, lalu bagaimana mereka akan menolong para penyembahnya?! Pertolongan itu harus memenuhi dua syarat, yaitu kemampuan dan (kuasa). Apabila ia mampu, maka masih ada lagi syarat lain, yaitu apakah ia mau menolong penyembahnya atau tidak? Dengan demikian, penafian kemampuan menafikan dua hal ini sekaligus. “padahal berhala-berhala itu bagai tentara yang (akan) dihadirkan kepada mereka,” maksudnya, mereka akan dihadirkan dan juga para penyembahnya di dalam satu siksaan, dan satu sama lain saling berlepas diri. Lalu kenapa mereka tidak berlepas diri di dunia dari penyembahan kepada sesembahan-sesembahan tersebut dan kemudian mengikhlaskan ibadah hanya kepada yang ditanganNYa kerajaan, pemberian manfaat, mara bahaya, pemberian rizki dan menahannya, yaitu Dia Yang Maha pelindung lagi Maha Penolong."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 74: Allah mengabarkan bahwa orang-orang musyrik mengambil tuhan-tuhan selain Allah, yang mereka ibadahi dan mendekatkan diri kepada tuhan-tuhan tersebut, mereka mengembalikan harapan dan syafaat kepada tuhan-tuhan selain Allah. Dan ini adalah sebuah tujuan yang buruk, sesat dan kemaksiatan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini menerangkan batilnya sesembahan-sesembahan kaum musyrik yang dijadikan mereka sebagai sekutu bagi Allah, di mana mereka mengharapkan pertolongan dan syafaatnya, padahal keadaannya sangat lemah. Yakni agar mereka dihindarkan dari azab Allah dengan syafaat sesembahan-sesembahan mereka menurut persangkaan mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 74",
    "description": "Dan alih-alih bersyukur atas manfaat yang orang-orang kafir itu dapatkan dari hewan-hewan tersebut, mereka justru kufur dan meng-ambil sesembahan selain Allah. Mereka menjadikan berhala atau benda-benda lain yang dianggap memiliki kekuatan sebagai sesembahan agar keinginan mereka terwujud dan mereka mendapat pertolongan darinya. 75. Sesembahan orang-orang musyrik itu tidak memiliki kekuatan apa pun untuk memberi manfaat atau menolak mudarat dari mereka. Me-reka itu tidak dapat menolong mereka sedikit pun; padahal mereka itu, ya-itu orang-orang musyrik, menjadi tentara yang disiapkan untuk menjaga sesembahan itu karena tidak mampu menjaga diri mereka sendiri."
  }
]