[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tuhan-tuhan itu tidak kuasa menolong para penyembahnya dan tidak pula mampu menolong diri mereka sendiri. Orang-orang musyrik berikut tuhan-tuhan yang mereka sembah itu, akan dihadirkan seluruhnya kepada azab, dimana sebagaian dari mereka berlepasdiri dari sebagain yang lain."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "75. Tuhan-tuhan yang mereka sembah itu tidak kuasa menolong diri mereka sendiri apalagi menolong orang yang menyembah mereka selain Allah. Mereka dan berhala-berhala mereka semuanya akan dihadirkan di depan azab, lalu sebagian dari mereka cuci tangan dari sebagian yang lain."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "75. tuhan-tuhan itu tidak akan mampu menolong dan memberi manfaat bagi orang yang menyembahnya, bahkan ia tidak mampu menyelamatkan dirinya sendiri. Tuhan-tuhan itu dan orang-orang musyrik yang menyembahnya tidak dapat saling memberi manfaat dan tidak dapat saling melindungi dari azab dunia dan akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "75. لَا يَسْتَطِيعُونَ نَصْرَهُمْ (Berhala-berhala itu tiada dapat menolong mereka) Namun yang pasti adalah kebatilan apa yang mereka harapkan dari mereka berupa pertolongan pada masa-masa sulit. وَهُمْ لَهُمْ جُندٌ مُّحْضَرُونَ (padahal berhala-berhala itu menjadi tentara yang disiapkan untuk menjaga mereka) Yakni orang-orang kafir menyiapkan tentara dari patung-patung. Mereka menyiapkannya di dunia untuk meminta pertolongan darinya, padahal ia tidak dapat menolong mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "75. Tuhan-tuhan mereka tidak bisa menjadi penolong mereka dalam hal tertentu. Padahal orang-orang musyrik itu adalah pasukan yang terlindung oleh berhala-berhala itu yang dipersiapkan sebagai penolong bagi mereka, kemudian setan mendatangi mereka untuk melindungi mereka, sedangkan berhala-berhala itu tidak berguna sama sekali."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sembahan itu tidak mampu menolong mereka, dan mereka itu adalah tentara yang dihadirkan untuk sesembahan itu} dan orang-orang musyrik itu adalah adalah pembantu yang disiapkan untuk menjaga dan menunggu sembahan-sembahan itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "74-75. ini adalah penjelasan kepalsuan sesembahan-sesembahan kaum musyrikin yang mereka angkat (ambil) selain Allah, mereka harapkan pertolongan dan syafa’atnya. Sesungguhnya sesembahan-sesembahan tersebut benar-benar sangat rapuh, “tidak dapat menolong mereka,” dan bahkan mereka tidak dapat menolong diri mereka sendiri. Kalau mereka tidak mampu menolong diri mereka sendiri, lalu bagaimana mereka akan menolong para penyembahnya?! Pertolongan itu harus memenuhi dua syarat, yaitu kemampuan dan (kuasa). Apabila ia mampu, maka masih ada lagi syarat lain, yaitu apakah ia mau menolong penyembahnya atau tidak? Dengan demikian, penafian kemampuan menafikan dua hal ini sekaligus. “padahal berhala-berhala itu bagai tentara yang (akan) dihadirkan kepada mereka,” maksudnya, mereka akan dihadirkan dan juga para penyembahnya di dalam satu siksaan, dan satu sama lain saling berlepas diri. Lalu kenapa mereka tidak berlepas diri di dunia dari penyembahan kepada sesembahan-sesembahan tersebut dan kemudian mengikhlaskan ibadah hanya kepada yang ditanganNYa kerajaan, pemberian manfaat, mara bahaya, pemberian rizki dan menahannya, yaitu Dia Yang Maha pelindung lagi Maha Penolong."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 75: Allah menjelaskan bahwa tuhan-tuhan tersebut tidak akan dapat menjadi penolong bagi diri-diri mereka sendiri, maka bagaimana dapat memberikan pertolongan bagi orang-orang musyrik; Justru orang-orang kafirlah yang mejadikan diri-diri mereka sebagai pelindung dari sesembahan-sesembahan ini serta menolong tuhan-tuhan tersebut."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Demikian pula mereka tidak dapat menolong diri mereka sendiri. Jika diri mereka saja, tidak sanggup mereka tolong lalu bagaimana menolong orang lain. Padahal menolong itu ada dua syarat: (1) Kemampuan dan kesanggupan, (2) Kemauan. Jika kemampuan tidak ada, maka menafikan kedua-duanya (kemampuan dan kemauan). Bisa juga diartikan, padahal mereka (berhala-berhala) itu dan para penyembahnya adalah orang-orang yang sama-sama disiapkan dimasukkan ke dalam neraka. Di dalam neraka itu antara penyembah dengan sesembahan yang disembahnya akan saling berlepas diri. Oleh karena itu, mengapa mereka tidak berlepas diri sewaktu di dunia dari menyembah sesembahan-sesembahan itu, dan hanya menyembah Allah saja yang di Tangan-Nya segala kekuasaan, dan Dia yang berkuasa memberikan manfaat dan menimpakan madharrat, yang berkuasa memberi dan menahan?"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 75",
    "description": "Sesembahan orang-orang musyrik itu tidak memiliki kekuatan apa pun untuk memberi manfaat atau menolak mudarat dari mereka. Me-reka itu tidak dapat menolong mereka sedikit pun; padahal mereka itu, ya-itu orang-orang musyrik, menjadi tentara yang disiapkan untuk menjaga sesembahan itu karena tidak mampu menjaga diri mereka sendiri. 76. Maka dari itu, wahai nabi Muhammad, jangan sampai ucapan me-reka yang penuh kekafiran kepada Allah dan pendustaan kepadamu itu membuat engkau bersedih hati. Sungguh, kami mengetahui apa yang me-reka rahasiakan dalam hati mereka dan apa yang mereka nyatakan dalam bentuk perbuatan. Mereka akan diminta pertanggungjawaban atasnya pada hari kiamat dan pasti akan menerima balasannya."
  }
]