[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka janganlah kamu (wahai rasul) bersedih karena kekafiran mereka kepada Allah, pendustaan mereka kepadamu dan penghinaan mereka kepadamu. Seseungguhnya Kami mengetahui apa yang mereka simpan dan apa yang mereka tampakkan dan Kami akan membalas mereka atasnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "76. Wahai Rasul! Jangan kamu bersedih karena ucapan mereka yang menyatakan, \"Sesungguhnya kamu bukanlah seorang utusan, atau sesungguhnya kamu adalah penyair,\" dan kebohongan-kebohongan lainnya. Sesungguhnya Kami mengetahui apa yang mereka sembunyikan dan apa yang mereka perlihatkan, tidak ada sesuatu yang samar bagi Kami, dan Kami akan membalas mereka atasnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "76. Hai Rasulullah, janganlah kekafiran mereka terhadap Allah, dan pendustaan dan penghinaan mereka terhadapmu membuatmu sedih; sebab Kami mengetahui perkataan dan perbuatan yang mereka rahasiakan dan yang mereka tampakkan, dan Kami akan membalas semua itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "76. فَلَا يَحْزُنكَ قَوْلُهُمْ ۘ (Maka janganlah ucapan mereka menyedihkan kamu) Sebab mereka pasti mengatakan “itu adalah tuhan-tuhan kami, yang menjadi sekutu Allah untuk disembah” dan perkataan lainnya. إِنَّا نَعْلَمُ مَا يُسِرُّونَ وَمَا يُعْلِنُونَ(Sesungguhnya Kami mengetahui apa yang mereka rahasiakan dan apa yang mereka nyatakan) Dan Kami kelak akan membalas mereka atas semua itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "76. Maka jangan sampai ucapan mereka menempatkanmu dalam kesedihan, yaitu “Sesungguhnya mereka adalah tuhan-tuhan Kami”. Maka sesungguhnya mereka adalah orang-orang yang menyekutukan Allah dalam beribadah. Sesungguhnya Kami mengetahui rahasia mereka, sesuatu yang ada dalam hati mereka dan sesuatu yang mereka tampakkan serta mereka ucapkan menggunakan lisan mereka, Lalu Kami membalas mereka atas hal itu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka jangan sampai ucapan mereka membuatmu bersedih. Sesungguhnya Kami mengetahui apa yang mereka rahasiakan dan apa yang mereka nyatakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "76. maksudnya, maka hendaknya jangan sampai ucapan orang-orang yang didustakan itu menjadikan kamu sedih, wahai Rasul. Yang dimaksud ucapan disini adalah apa yang dimaksud oleh konteks ayat, yaitu setiap ucapan yang dengannya mereka mencemoohkan Rasulullah, atau apa yang beliau bawa. Artinya, maka kamu jangan menyibukkan hatimu dengan rasa sedih terhadap mereka. “sesungguhnya kami mengetahui apa yang mereka rahasikan dan apa yang mereka nyatakan,” lalu kami akan memberikan pembalasan kepada mereka sesuai dengan pengetahuan kami tentang mereka. Dan sesungguhnya ucapan mereka sama sekali tidak memudaratkanmu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 76: Allah memerintahkan agar rasul jangan bersedih atas ucapan orang-orang musyrik ini dan atas celaan mereka atasnya, karena sesungguhnya Allah Maha Mengetahui secara sempurna atas mereka, dan akan dibalas bagi mereka serta akan dihisab atas perlakuan mereka kepada rasul."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni ucapan yang isinya mencela Rasulullah shallallahu 'alaihi wa sallam dan mencela apa yang Beliau bawa. Misalnya ucapan mereka, bahwa Beliau bukanlah seorang rasul, dsb. Maksudnya sibuk dengan kesedihan. Yakni oleh karena itu, Kami akan memberinya balasan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 76",
    "description": "Maka dari itu, wahai nabi Muhammad, jangan sampai ucapan me-reka yang penuh kekafiran kepada Allah dan pendustaan kepadamu itu membuat engkau bersedih hati. Sungguh, kami mengetahui apa yang me-reka rahasiakan dalam hati mereka dan apa yang mereka nyatakan dalam bentuk perbuatan. Mereka akan diminta pertanggungjawaban atasnya pada hari kiamat dan pasti akan menerima balasannya. 77. Beralih dari uraian tentang pendustaan kaum kafir kepada nabi Muhammad, Allah melalui ayat ini menjelaskan keniscayaan hari kebangkitan. Ayat ini turun untuk menjawab kelancangan al-''' bin w'il yang menantang rasulullah untuk membuktikan kemampuan Allah membangkitkan kembali tulang lapuk yang dibawanya. Dan tidakkah manusia memperhatikan bahwa kami menciptakannya dari setetes mani, kemudian setelah melalui berbagai proses ia lahir ke dunia dan tumbuh menjadi manusia sempurna, lalu ternyata dia menjadi musuh yang nyata! mereka berubah menjadi musuh dengan mengingkari hari kebangkitan. Sungguh, sikap ini tidak sejalan dengan akal sehat."
  }
]