[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah orang yang mengingkari kebangkitan tidak melihat awal mula penciptaannya sehingga dia bisa menjadikannya dalil akan tempat kembalinya. Sesungguhnya Kami menciptakan dia dari setetes air yang selanjutnya berproses sampai ia menjadi manusia dewasa, dan ternyata dia adalah pendebat yang ulung dan jelas menolak."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "77. Mengapa manusia yang mengingkari kebangkitan sesudah kematian tidak memikirkan bahwa sesungguhnya Kami menciptakannya dari air mani, kemudian dia melewati beberapa fase sebelum akhirnya lahir dan tumbuh, kemudian menjadi orang yang banyak mendebat dan membantah; mengapa manusia tidak melihat hal itu untuk mereka jadikan sebagai bukti atas kebangkitan?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "77. Tidakkah manusia melihat awal mula penciptaannya; Kami menciptakannya dari air mani yang melewati berbagai tahap hingga dia menjadi manusia dewasa, namun ternyata dia menjadi makhluk yang banyak menentang dan membantah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "77. أَوَلَمْ يَرَ الْإِنسٰنُ أَنَّا خَلَقْنٰهُ مِن نُّطْفَةٍ فَإِذَا هُوَ خَصِيمٌ مُّبِينٌ (Dan apakah manusia tidak memperhatikan bahwa Kami menciptakannya dari setitik air (mani), maka tiba-tiba ia menjadi penantang yang nyata) Yakni tidakkah manusia memperhatikan bahwa Kami ciptakan mereka dari hal yang paling lemah, namun ternyata mereka tiba-tiba menjadi penentang Kami dalam hal yang telah ditegakkan bukti dan hujjah Allah didalamnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "77. Apakah setiap manusia khususnya orang yang mengingkari hari kebangkitan tidak mengetahui bahwa sesungguhnya Kami menciptakannya dari salah satu tetesan mani sebagai materi kehidupan sehingga dia sangan menentang Kami, berdebat dengan kebathilan dan mengingkari hari kebangkitan dengan jelas. Ibnu Abbas berkata: “Datanglah Al-‘Ash bin Wail kepada Rasulallah SAW dengan membawa tulang yang terpotong, lalu dia memotongnya dan berkata: “Wahai Muhammad, Apakah daging ini akan dibangkitkan usai terpotong-potong?” Beliau menjawab:”Iya, Allah akan membangkitkan daging ini lalu mematikanmu dan menghidupkanmu kemudian memasukkanmu ke dalam neraka Jahanam” Lalu turunlah ayat-ayat ini”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidakkah manusia mengetahui bahwa Kami menciptakannya dari setetes mani. Kemudian tiba-tiba saja dia menjadi musuh} orang yang sangat menentang dan membantah {yang nyata} nyata terhadap apa yang dikatakan kepadanya dengan pertentangan yang kuat dan perkataan yang jelas"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "77. maka Allah berfirman, ”dan apakah manusia tidak memperhatikan,” yaitu manusia yang mengingkari kebangkitan atau ragu padanya, (memperhatikan) suatu perkara yang memberinya keyakinan sempurna kepada kepastiannya, yaitu awal mula penciptaannya “dari setitik air,” kemudian berubah-ubahnya dalam beberapa fase sedikit demi sedikit hingga menjadi besar dan menjadi anak remaja dan akalnyapun menjadi sempurna dan dewasa, “lalu tiba-tiba ia menjadi penantang yang nyata,” setelah sebelumnya penciptaannya dari setetes air. Cobalah perhatikan perbedaan dua kondisi ini. Dan hendaknya ia mengetahui bahwa yang telah menciptakannya dari ketiadaan itu lebih kuasa lagi mengulangi penciptaannya kembali setelah ia tercerai berai dan hancur luluh!"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 77: Allah mengatakan kepada salah satu pembesar quraisy yang mengingkari hari kebangkitan : Bukankan dia melihat ketika dia mengingkari hari kebangkitan, yang bahwasanya, Kamilah yang memulai penciptaan sesuatu yang lemah dari air mani yang dijaga (dalam rahim)? Maka ketika telah besar dan berkuasa, jadilah permulaan laki-laki yang mendebat ? Kemudian mengingkari hari kebangkitan ?!"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ibnu Abi Hatim meriwayatkan dengan sanadnya yang sampai kepada Ibnu Abbas radhiyallahu 'anhuma ia berkata, “Sesungguhnya Al ‘Aash bin Wa’il mengambil tulang dari Bath-ha’, lalu ia meremukkannya dengan tangannya, kemudian berkata kepada Rasulullah shallallahu 'alaihi wa sallam, “Apakah Allah akan menghidupkan benda ini setelah hancur?” Maka Rasulullah shallallahu 'alaihi wa sallam menjawab, “Ya, Allah akan mematikanmu, kemudian membangkitkanmu dan akan memasukkanmu ke neraka Jahanam.” Ibnu Abbas berkata, “(Maka) turunlah beberapa ayat akhir surat Yaasiin.” (Hadits ini diriwayatkan pula oleh Hakim dalam Mustadraknya juz 2 hal. 429 dari jalan ‘Amr bin ‘Aun dari Hasyim dst. Ia berkata, “Shahih sesuai syarat dua syaikh (Bukhari-Muslim), namun keduanya tidak menyebutkannya.”). Ayat yang mulia ini di dalamnya menyebutkan syubhat orang-orang yang mengingkari kebangkitan serta jawabannya. Yaitu orang yang mengingkari kebangkitan dan meragukannya. Lalu Allah merubah keadaannya sedikit demi sedikit sehingga menjadi sosok yang kuat. Setelah diciptakan pertama kali dari air mani, maka perhatikanlah perbedaan antara keadaan keduanya, sungguh jauh berbeda. Oleh karena itu, hendaknya ia mengetahui, bahwa yang menciptakannya dari yang sebelumnya tidak ada tentu lebih mampu mengulanginya kembali setelah ia menjadi tulang-belulang."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 77",
    "description": "Beralih dari uraian tentang pendustaan kaum kafir kepada nabi Muhammad, Allah melalui ayat ini menjelaskan keniscayaan hari kebangkitan. Ayat ini turun untuk menjawab kelancangan al-''' bin w'il yang menantang rasulullah untuk membuktikan kemampuan Allah membangkitkan kembali tulang lapuk yang dibawanya. Dan tidakkah manusia memperhatikan bahwa kami menciptakannya dari setetes mani, kemudian setelah melalui berbagai proses ia lahir ke dunia dan tumbuh menjadi manusia sempurna, lalu ternyata dia menjadi musuh yang nyata! mereka berubah menjadi musuh dengan mengingkari hari kebangkitan. Sungguh, sikap ini tidak sejalan dengan akal sehat. 78. Demikianlah keingkaran manusia kepada kami. Dan dia membuat perumpamaan bagi kami dan melupakan asal kejadiannya dari setetes air mani yang hina. Dia berkata, 'siapakah yang dapat menghidupkan tulang belulang yang telah hancur luluh'' jika menyadari asal kejadiannya, tentu manusia akan percaya bahwa Allah mahakuasa menghidupkannya kembali sesudah mati."
  }
]