[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bahkan para pengingkar hari kebangkitan itu membuat perumpamaan kepada Kami dengan sebuah perumpamaan yang tidak patut baginya untuk membuatnya, yaitu menyamakan kuasa pencipta dengan kuasa makhluk dan dia lupa awal penciptanya, maka dia berkata ”siapa yang akan menghidupkan tulang-tulang yang lapuk dan telah menjadi tanah?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "78. Orang kafir ini lalai dan bodoh manakala dia menjadikan tulang-tulang yang lapuk sebagai bukti kemustahilan kebangkitan. Dia berkata, \"Siapa yang akan mengembalikannya.\" Dia lupa akan penciptaan dirinya dari ketiadaan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "78-79. Manusia membuat perumpamaan bagi Tuhannya dengan perumpamaan yang tidak layak bagi-Nya; dia menyamakan kekuasaan Tuhan dengan kekuatan makhluk, dan meyakini bahwa kebangkitan orang mati setelah menjadi tulang belulang adalah hal yang mustahil, dia juga mempertanyakan: “Siapa yang akan menghidupkan tulang-belulang yang telah hancur itu?” Seandainya dia mengingat dan memikirkan kembali penciptaan dirinya, niscaya dia akan mengetahui bahwa Dzat Yang Mampu menciptakan pertama kali pasti mampu menghidupkan dan membangkitkannya kembali. Yang menciptakannya pertama kali dari ketidakadaan pasti mampu menghidupkannya kembali setelah ia ada. Itulah Allah, Tuhan semesta alam, Maha Mengetahui rahasia makhluk-Nya dan detail ciptaan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "78. وَضَرَبَ لَنَا مَثَلًا وَنَسِىَ خَلْقَهُۥ ۖ (Dan ia membuat perumpamaan bagi Kami; dan dia lupa kepada kejadiannya) Yakni mereka membuat kisah aneh bagi Kami sebagai perumpamaan, yaitu mereka mengingkari kekuasaan Kami untuk menghidupkan tulang belulang, dan mereka sendiri lupa penciptaan Kami terhadap mereka. قَالَ مَن يُحْىِ الْعِظٰمَ وَهِىَ رَمِيمٌ (ia berkata: “Siapakah yang dapat menghidupkan tulang belulang, yang telah hancur luluh?”) Mereka menyamakan kekuasaan Allah dengan kekuasaan makhluk, sehingga mereka mengingkari kekuasaan Allah yang mampu menghidupkan tulang belulang sebab manusia tidak bisa melakukannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "78. Dia membuat perumpamaan bagi Kami dengan membuat barang asing yang disiapkan sebagai perumpamaan. Itu adalah pengingkarannya terhadap penghidupan Kami terhadap tulang-tulang yang telah digerogoti dan dia melupakan penciptaannya oleh Kami dari sesuatu paling lemah sehingga dia berkata: “Siapa yang menghidupkan tulang-tulang yang telah hancur?”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia membuat perumpamaan bagi Kami dan melupakan asal penciptaannya} penciptaan Kami terhadapnya {Dia berkata,“Siapakah yang bisa menghidupkan tulang-belulang yang dan tulang itu telah hancur luluh} tua dan rusak"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "78. “dan dia membuat perumpamaan bagi kami,” yang tidak pantas bagi siap pun untuk membuatnya, yaitu menganalogikan kekuasaan sang pencipta dengan kekuasaan makhluk, yaitu bahwa perkara yang tidak mungkin bagi kekuasaan makhluk juga tidak mungkin bagi kekuasaan pencipta. Allah mengurai perumpamaan tersebut dengan perkataanNya, “ia berkata,” maksudnya, orang (yang mengingkari) itu berkata, ”siapakah yang dapat menghidupkan tulang belulang, yang telah hancur luluh?\" maksudnya, apakah seseorang bisa menghidupkannya? Ini adalah bentuk pertanyaan menyangkal. Maka artinya, tidak akan ada seseorng pun yang dapat menghidupkannya setelah ia hancur luluh dan binasa. Inilah sisi keserupaan dan perumpamaannya. Yakni bahwa hal itu merupakan perkara yang sangat tidak mungkin (mustahil) berdasarkan kelazimn kemampuan manusia. Ucapan yang muncul dari manusia seperi ini adalah merupakan ketidaksadaraan darinya dan kelupaannya terhadap awal mula penciptaannya. Kalau saja ia menyadari akan penciptaannya setelah sebelumnya ia tidak pernah menjadi sesuatu apa pun yang bisa disebut, lalu kemudian menjadi ada secara kasat mata, tentu ia tidak akan memberikan perumpumaan ini!"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 78: Kemudian manusia ini mengingkari hari pembalasan serta mendebatnya dengan berkata : Apakah Allah mampu wahai Muhammad untuk mengembalikan tulang-belulang yang tercerai berai ini dan dihidupkan untuk kedua kalinya ? Maka orang bodoh ini lupa akan asal penciptaannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Untuk menolak kebangkitan. Padahal tidak patut bagi seorang pun untuk membuat perumpamaan seperti itu, karena di dalamnya menyamakan antara kemampuan Pencipta dengan kemampuan makhluk. Perumpamaan yang dimaksud itu disebutkan dalam lanjutan ayatnya. Yaitu dari mani. Maksud orang yang ingkar ini adalah tidak ada yang dapat menghidupkannya. Pengingkarannya ini merupakan sikap lalainya dan tidak mengingat kejadiannya pertama kali, kalau sekiranya ia mengerti keadaannya dahulu, di mana ia sebelumnya tidak bisa disebut apa-apa, tentu ia tidak membuat perumpamaan seperti itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 78",
    "description": "Demikianlah keingkaran manusia kepada kami. Dan dia membuat perumpamaan bagi kami dan melupakan asal kejadiannya dari setetes air mani yang hina. Dia berkata, 'siapakah yang dapat menghidupkan tulang belulang yang telah hancur luluh'' jika menyadari asal kejadiannya, tentu manusia akan percaya bahwa Allah mahakuasa menghidupkannya kembali sesudah mati. 79. Untuk menjawab pertanyaan mereka, katakanlah wahai nabi Muhammad bahwa yang akan menghidupkannya kembali setelah hancur luluh ialah Allah yang telah menciptakannya pertama kali. Baik menciptakan untuk pertama kali maupun menghidupkan kembali manusia yang telah telah mati adalah hal yang sangat mudah bagi Allah. Dan dia maha mengetahui tentang segala makhluk ciptaan-Nya."
  }
]