[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah kepadanya, ”yang menghidupkannya adalah yang menciptakannya pertama kali dan Dia maha mengetahui seluruh makhluk Nya tidak ada sesuatupun yang samar bagiNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "79. Katakanlah -wahai Rasul- kepadanya, \"Tulang belulang yang lapuk itu dihidupkan oleh Allah yang menciptakannya pertama kali.\" Siapa yang kuasa menciptakannya pertama pasti bisa menghidupkannya kembali. Dia lah Allah yang Mahasuci, yang mengetahui segala makhluk, tidak ada sesuatu yang samar bagi-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "79. قُلْ يُحْيِيهَا الَّذِىٓ أَنشَأَهَآ أَوَّلَ مَرَّةٍ ۖ (Katakanlah: “Ia akan dihidupkan oleh Tuhan yang menciptakannya kali yang pertama) Yakni Allah menciptakannya pertama kali yang sebelumnya belum ada. وَهُوَ بِكُلِّ خَلْقٍ عَلِيمٌ(Dan Dia Maha Mengetahui tentang segala makhluk) Tidak ada yang tersembunyi dari-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "79. Katakanlah kepadanya wahai rasulallah: “Yang menghidupkan tulang-tulang itu adalah Dzat yang menciptakannya pertama kali tanpa sesuatu apapun. Dialah Dzat yang Maha Mengetahui setiap makhluk dan tidak ada satupun yang bisa bersembunyi dariNya”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Katakanlah,“Yang akan menghidupkannya adalah Dzat yang menciptakannya} menciprakannya {pertama kali. Dia Maha Mengetahui setiap makhluk"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "79. kemudian Allah menjawab anggapan tidak mungkin tersebut dengan jawaban yang sangat memuaskan, seraya berfirman, ”katakanlah, ‘ia akan dihidupkan oleh Rabb yang menciptakannya kali yang pertama’.” Yang demikian itu, hanya dengan merenungkan (saja) seseorang pasti tahu dengan yakin, tanpa ada syubhat sedikitpun bahwa yang telah menciptakannya pada kali yang pertama itu kuasa untuk mengulangi penciptaannya untuk kali yang kedua, dan ini lebih mudah bagi kekuasaanNYa apabila direnungkan oleh orang yang mau merenungkan. “dan Dia MahaMengetahui tentang segala makhluk.” Ini juga dalil kedua yang bersumber dari sifat-sifat Allah, yaitu bahwa ilmu Allah meliputi segala makhlukNya dalam seluruh kondisinya sepanjang waktu dan apa yang masih tersisa; dan Dia mengetahui yang ghaib yang nyata. Apabila seorang manusia telah mengakui ilmu yang luar biasa ini, maka niscaya dia tahu bahwasannya ia lebih agung dan lebih tinggi dari hanya sekedar menghidupkan kembali orang-orang mati dari dalam kubur."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 79: Katakanlah wahai Nabi Allah : Allahlah yang mengembalikan yang telah Allah ciptakan pada kali pertama, dan Dialah yang menjadikan dari sesuatu yang tidak ada menjadi ada untuk kedua kalinya. Karena dialah Allah yang menjadikan sesuatu yang tiada menjadi wujud."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala menjawab kemustahilan itu dengan jawaban yang memuaskan. Dengan membayangkan hal itu, seseorang dapat mengetahui secara yakin bahwa yang menciptakan pertama kali dari yang sebelumnya tidak ada tentu mampu mengulangi kembali, maka hal itu lebih mudah bagi-Nya. Baik secara jumlah (garis besar) maupun tafsil (rinci), baik sebelum diciptakan maupun setelah diciptakan. Ini merupakan dalil kedua yang menunjukkan bahwa Dia mampu menciptakan kembali berdasarkan sifat Allah Subhaanahu wa Ta'aala, yaitu bahwa pengetahuan-Nya meliputi semua makhluk-Nya, Dia mengetahui bagian bumi yang dipenuhi jasad orang-orang yang mati, dan bagian bumi yang masih tersisa, Dia mengetahui yang gaib dan yang tampak. Jika Seorang hamba mengakui pengetahuan yang besar ini, maka dia akan mengetahui bahwa pembangkitan manusia yang telah mati meskipun jasadnya telah terpisah-pisah dan hilang entah ke mana, namun hal itu tetap mudah bagi Allah yang ilmu-Nya meliputi segala sesuatu. Pada ayat selanjutnya disebutkan dalil ketiga."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 79",
    "description": "Untuk menjawab pertanyaan mereka, katakanlah wahai nabi Muhammad bahwa yang akan menghidupkannya kembali setelah hancur luluh ialah Allah yang telah menciptakannya pertama kali. Baik menciptakan untuk pertama kali maupun menghidupkan kembali manusia yang telah telah mati adalah hal yang sangat mudah bagi Allah. Dan dia maha mengetahui tentang segala makhluk ciptaan-Nya. 80. Tuhan yang akan menghidupkan kembali tulang belulang yang telah lapuk tersebut yaitu Allah yang menjadikan api untukmu dari kayu yang semula berupa pohon yang basah dan hijau. Begitu kayu itu ke-ring, maka seketika itu kamu nyalakan api dari kayu itu dan dapat meng-ambil manfaat dari api itu. '."
  }
]