[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "7-8. Sungguh azab memang patut ditimpakan kepada kebanyakan orang-orang kafir tersebut, setelah kebenaran disampaikan kepada mereka namun mereka menolaknya. Mereka tidak membenarkan Allah dan RasulNya, serta tidak melaksanakan SyariatNya. Sesungguhnya Kami menjadikan orang-orang kafir yang mana kebenaran telah disampaikan kepada mereka namun mereka menolaknya dan bersikukuh di atas kekafiran dan tidak beriman, seperti orang yang dibelenggu lehernya dengan rantai, lalu tangan dan leher mereka disatukan dibawah dagu mereka, sehingga mereka terpaksa mendongakkan kepala ke langit. Mereka terbelenggu dari segala macam kebaikan, mereka tidak melihat kebenaran dan tidak mendapatkan petunjuk kepadanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Perumpamaan mereka dalam hal ini adalah seperti orang-orang yang dibelenggu leher mereka, tangan mereka dikumpulkan bersama leher mereka di bawah janggut mereka, hal ini memaksa mereka untuk mengangkat kepala mereka ke langit, mereka tidak mampu menundukkan kepada mereka. Mereka adalah orang-orang yang terbelenggu dari iman kepada Allah, maka mereka tidak mengikuti kebenaran dan tidak menundukkan kepala mereka untuk kebenaran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "8. Salah satu azab bagi mereka adalah belenggu-belenggu yang diikatkan pada leher mereka kemudian ditarik dari dagu mereka; sehingga mereka mendongakkan kepala, seperti unta yang ditarik kepalanya dari air saat menutup mata karena enggan meminum air. Mereka telah berpaling dari kebenaran dan menghalanginya, seperti unta yang berpaling dari air yang merupakan sumber kehidupannya. Sehingga mereka seperti budak bagi belenggu yang mengikat mereka. Belenggu adat istiadat dan hawa nafsu mereka menghalangi mereka dari kebenaran, sehingga belenggu-belenggu itu membuat mereka durhaka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. إِنَّا جَعَلْنَا فِىٓ أَعْنٰقِهِمْ أَغْلٰلًا فَهِىَ إِلَى الْأَذْقَانِ (Sesungguhnya Kami telah memasang belenggu dileher mereka, lalu tangan mereka (diangkat) ke dagu) Yakni belenggu-belenggu yang sampai pada dagu mereka, sehingga mereka tidak mampu untuk menolehkan kepala mereka. فَهُم مُّقْمَحُونَ(maka karena itu mereka tertengadah) Yakni menggangkat kepala dan menundukkan pandangan mereka. Pendapat lain mengatakan maknanya adalah Kami belenggu leher mereka yang diikat beserta tangan mereka. Dan ini merupakan perumpamaan yang dibuat Allah bagi mereka tentang keengganan mereka untuk meraih petunjuk seperti ketidakmampuan orang yang diikat untuk bergerak. Namun pendapat lain mengatakan ayat ini merupakan gambaran dari perlakuan yang didapat oleh penduduk neraka, yaitu mereka akan dibelenggu pada leher dan tangan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8. Sesungguhnya Kami menjadikan di leher orang-orang musyrik itu rantai yang mengikat dampai dagu mereka. Mereka mengangkat kepala sehingga tidak dapat menunduk akibat rantai-rantai itu (bentuk jamak dari ghullun). Mereka menundukkan penglihatan dan tidak berpaling pada kebenaran. Abu Jahal berkata: “Jika ada Muhammad, sungguh aku akan melakukannya (menyakitinya)” Lalu Allah menurunkan ayat ini dan ayat setelahnya. Mereka berkata: “Ini dia Muhammad”, lalu dia (Abu Jahal) berkata: “Mana dia? Mana dia?”, dia tidak melihatnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya Kami telah memasang belenggu di leher mereka, lalu tangan mereka (yang terbelenggu) diangkat ke dagu, maka mereka tertengadah} menengadahkan kepala mereka dengan memejamkan penglihatan mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8. Dan Allah menjelaskan penghalang-penghalang yang telah menghalangi iman untuk bisa sampai ke dalam hati mereka seraya berfirman, “Sesungguhnya Kami telah memasang belenggu di leher mereka.” ‘aglaal’ adalah kata jamak dari ‘ghillun’ yang artinya belenggu yang digunakan untuk membelenggu leher, ia serupa dengan borgol pengikat kaki. Belenggu-belenggu yang ada di leher ini sangat besar hingga sampai “ke” dagu, sedangkan kepala mereka diangkat ke atas, “maka karena itu mereka tertengadah,” maksudnya, mereka mengangkat kepala karena kuat dan besarnya belenggu yang ada pada leher mereka, sehingga mereka tidak bisa menunduk."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 8: Allah mensifati kondisi orang-orang kafir yang mereka jelas atau kekafiran nya, Allah mengabarkan bahwasanya kondisi mereka sebagai mana azab yaitu diikatnya tangan-tangan mereka di atas leher leher mereka; kepala mereka terangkat ke langit dan mereka terkunci ada seluruh kebaikan, mereka tidak dapat melihat kebenaran serta mendapatkan petunjuk."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Menurut Syaikh As Sa’diy, selanjutnya Allah Subhaanahu wa Ta'aala menyebutkan penghalang yang menghalangi masuknya iman ke dalam hati mereka. Yakni mengangkat kepalanya dan tidak sanggup menundukkannya. Menurut sebagian ahli tafsir, ayat ini merupakan tamtsil (perumpamaan) yang maksudnya adalah bahwa mereka tidak mau tunduk beriman."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 8",
    "description": "Allah menggambarkan kondisi kaum kafir tersebut dengan firman-Nya, 'sungguh, kami telah memasang belenggu yang diikat di leher mereka, lalu tangan mereka diangkat ke dagu, karena itu kepala mereka tertengadah dan mendongak sehingga tidak dapat menunduk apalagi bergerak dengan bebas. 9. Dan kami jadikan di hadapan mereka sekat, yakni dinding penghalang antara mereka dengan kebenaran yang dibawa oleh nabi Muhammad, dan di belakang mereka juga kami ciptakan sekat, dan kami tutup mata mereka sehingga mereka tidak dapat melihat kebenaran. Itulah perum-pamaan orang-orang yang enggan melakukan kebaikan dan selalu menolak kebenaran."
  }
]