[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dialah yang mengeluarkan bagi kalian api yang membakar dari pohon basah lagi hijau, kalian menyalakan api dari pohon, dia kuasa mengeluarkan sesuatu dari lawannya. ”hal ini mengandung dalil atas keesaan Allah dan kesempurnaan kuasaNya, dan diantaranya adalah menghidupkan kembali orang-orang yang mati dari kubur mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "80. Allah yang menjadikan bagi kalian -wahai manusia api- yang kalian nyalakan dari kayu yang hijau lagi lembab, dan selanjutnya kalian bisa menyalakan apinya. Siapa yang mampu menyatukan dua hal yang bertentangan, kayu hijau yang basah dengan api yang menyala padanya, pasti mampu pula untuk menghidupkan orang-orang yang telah mati."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "80. Allah yang telah mengeluarkan api membara yang kalian lihat dari pohon yang hijau, Maha Kuasa untuk membangkitkan orang mati."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "80. الَّذِى جَعَلَ لَكُم مِّنَ الشَّجَرِ الْأَخْضَرِ نَارًا (yaitu Tuhan yang menjadikan untukmu api dari kayu yang hijau) Allah mengingatkan akan keesaan-Nya dan menunjukkan kekuasaan-Nya dalam menghidupkan orang mati dengan apa yang mereka saksikan berupa api yang Allah nyalakan dari ranting yang basah, yaitu pohon al-Markh dan pohon Afar apabila diambil rantingnya kemudian saling dipukulkan akan mengeluarkkan percikan api, meski keduanya dalam keadaan basah. Atau maknanya adalah Allah memudahkan kalian untuk memanfaatkan kayu bakar yang kalian pakai untuk memasak dan menghangatkan diri, padahal kayu itu dulunya basah. فَإِذَآ أَنتُم مِّنْهُ تُوقِدُونَ(maka tiba-tiba kamu nyalakan (api) dari kayu itu”) Yakni kalian dapat memercikkan api darinya dan menyalakannya padahal sebelumnya kayu itu basah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "80. Dan di antara dalil-dalil kekuasaan Allah SWT yaitu bahwa Dia menyalakan api dari pohon yang hijau yaitu gosokan dan kayu bakar dimana Dia membuat perumpamaan dari keduanya dengan dua tongkat yang saling digesekkan satu sama lain sehingga muncullah api dari keduanya. Dan keduanya itu berwarna hijau. Sehingga kalian bisa menyalakan api dari pepohonan yang hijau itu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dzat yang menjadikan api untuk kalian dari kayu yang hijau. Kemudian seketika itu kalian menyalakan (api) darinya”} menyalakan api"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "80. kemudian Allah mengemukakan dalil ketiga, seraya berfirman, ”yaitu Rabb yang menjadikan untukmu api dari kayu yang hijau, maka tiba-tiba kamu nyalakan api dari kayu itu,” apabila Dia mampu mengeluarkan api yang kering dari pohon yang hijau yang masih sangat basah, padahal sangat berlawanan dan sangat kontras, maka mengeluarkan kembali orang-orang yang mati dari kuburnya juga seperti itu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 80: Pohon kurma yang hijau ini Allah keluarkan darinya api bagi kalian, yang dapat kalian manfaatkan. Allah yang mengeluarkan api yang menyala pada pohon ini, maka Allah pulalah yang menghidupkan kalian dari kubur-kubur kalian, dan Allah kembalikan kalian untuk kali yang lain."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Jika Allah mengeluarkan api yang kering dari tumbuhan hijau yang keadaannya basah, padahal keadaannya berlawanan, maka mengeluarkan orang-orang yang mati dari kuburnya juga sama seperti itu. Ini juga sama menunjukkan bahwa Allah Subhaanahu wa Ta'aala berkuasa membangkitkan. Pada ayat selanjutnya, Allah Subhaanahu wa Ta'aala menyebutkan dalil keempat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 80",
    "description": "Tuhan yang akan menghidupkan kembali tulang belulang yang telah lapuk tersebut yaitu Allah yang menjadikan api untukmu dari kayu yang semula berupa pohon yang basah dan hijau. Begitu kayu itu ke-ring, maka seketika itu kamu nyalakan api dari kayu itu dan dapat meng-ambil manfaat dari api itu. '81. Demikianlah bukti-bukti kuasa Allah. Dan bukankah Allah yang mampu menciptakan langit dan bumi, mampu pula menciptakan kembali yang serupa itu, yaitu jasad mereka yang sudah hancur' benar. Allah kuasa menciptakannya dan dia maha pencipta segala sesuatu lagi maha mengetahui ciptaan-Nya."
  }
]