[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bukankah Allah yang telah menciptakan langit, bumi, dan apa yang ada pada keduanya kuasa menciptakan yang semisal dengan mereka dan mengembalikan mereka sebagaimana Dia mengawali penciptaan mereka? benar, Dia mampu untuk itu karena Dia adalah maha pencipta seluruh makhlukNya, maha mengetahui apa yang telah Dia ciptakan, dan akan Dia ciptakan, tidak ada sesuatupun yang samar bagiNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "81. Bukanlah Allah yang menciptakan langit dan bumi dengan apa yang ada pada keduanya berupa keagungan berkuasa untuk menghidupkan manusia sesudah mati? Benar, sesungguhnya Allah Mahakuasa atas itu. Dia lah Maha Pencipta yang menciptakan seluruh makhluk, Maha mengetahuinya, tidak ada sesuatu yang samar bagi-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "81. Bukankah yang telah menciptakan langit dan bumi yang besar itu, beserta segala tanda kekuasaan-Nya yang ada di dalamnya, Maha Kuasa untuk menciptakan makhluk seperti mereka dan mengulangi penciptaan mereka seperti yang pertama kali? Tentu Dia berkuasa melakukan itu. Dzat yang berkuasa menciptakan makhluk yang sangat besar, pasti mampu menciptakan makhluk yang lebih kecil. Dia Maha Menciptakan seluruh makhluk, Maha Mengetahui seluruh ciptaan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "81. أَوَلَيْسَ الَّذِى خَلَقَ السَّمٰوٰتِ وَالْأَرْضَ بِقٰدِرٍ عَلَىٰٓ أَن يَخْلُقَ مِثْلَهُم ۚ (Dan tidaklah Tuhan yang menciptakan langit dan bumi itu berkuasa menciptakan yang serupa dengan itu?) Yakni Dzat yang mampu menciptakan langit dan bumi yang merupakan makhluk yang besar ukurannya, adalah Dzat yang mampu mengulangi penciptaan manusia yang berukuran kecil dan berkekuatan lemah. بَلَىٰ وَهُوَ الْخَلّٰقُ الْعَلِيمُ (Benar, Dia berkuasa. Dan Dialah Maha Pencipta lagi Maha Mengetahui) Yakni Dia mampu melakukan hal itu, Dia Maha Pencipta dan Maha mengetahui dengan sempurna."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "81. Tidakkah pencipta langit dan bumi yang merupakan ujung dari keagungan itu mampu mengembalikan penciptaan manusia yang kecil dan lemah. Tentu saja Dia mampu atas hal itu. Dialah Dzat yang banyak menciptakan (makhluk) dan luas pengetahuanNya tentang setiap sesuatu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Bukankah Dzat yang menciptakan langit dan bumi mampu menciptakan manusia seperti mereka} manusia serupa, lalu mengembalikan mereka sebagaimana mengawali mereka {Tentu saja, Dialah Dzat yang Maha Pencipta lagi Maha Mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "81. kemudian Allah menyebutkan dalil yang keempat, seraya berfirman, ”tidakkah Rabb yang menciptakan langit dan bumi,” yang begitu luas dan besar ini “berkuasa menciptakan kembali jasad-jasad mereka?” maksudnya, Dia akan kuasa melakukan itu! Sebab penciptaan langit dan bumi itu lebih besar daripada penciptaan manusia. “dan Dia-lah Maha pencipta lagi Maha Mengetahui.” Ini adalah dalil kelima. Yaitu bahwa sesungguhnya Allah Maha pencipta semua makhluk, dalam proses awalnya dan kemudiannya, yang kecil dan yang besarnya. Semua adalah bekas (tanda) dari bekas-bekas penciptaan dan kekuasaanNYa, dan sesungguhnya tidak ada satu pun makhluk yang sulit bagiNya apabila Dia berkehendak menciptakannya. Jadi, menciptakan kembali orang-orang yang sudah mati merupakan salah satu dari bentuk bekas ciptaanNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 81: Allah merendahkan orang-orang kafir ini dengan berkata : Bukankah yang menciptakan langit dan bumi serta isinya Maha Mampu untuk menciptakan yang semisal dengan orang-orang tersebut ?? Betul, Dialah yang Maha Menciptakan segala sesuatunya, yang Maha Tahu terhadap makhluk-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan keadaan keduanya yang besar dan luas. Dia mampu menciptakan kembali, karena penciptaan langit dan bumi lebih besar dari penciptaan manusia. Ini adalah dalil kelima, Dia Maha Pencipta, di mana semua makhluk besar maupun kecil yang terdahulu maupun yang datang kemudian merupakan atsar (bekas) dari ciptaan dan kemampuan-Nya, dan bahwa tidak sulit bagi-Nya menciptakan makhluk jika Dia menghendaki sebagaimana yang diterangkan dalam ayat ayat selanjutnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 81",
    "description": "Demikianlah bukti-bukti kuasa Allah. Dan bukankah Allah yang mampu menciptakan langit dan bumi, mampu pula menciptakan kembali yang serupa itu, yaitu jasad mereka yang sudah hancur' benar. Allah kuasa menciptakannya dan dia maha pencipta segala sesuatu lagi maha mengetahui ciptaan-Nya. 82. Sesungguhnya urusan-Nya menciptakan segala sesuatu sangatlah mudah bagi-Nya. Apabila dia menghendaki untuk menciptakan sesuatu, dia hanya berkata kepadanya, 'jadilah!' maka dengan serta-merta jadilah sesuatu yang dikehendaki-Nya itu."
  }
]