[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "sesungguhnya urusan Allah saat Dia menghendaki sesuatu adalah hanya dengan mengatakan, ”jadilah” maka iapun jadi, termasuk dalam hal ini mematikan, menghidupkan, membangkitkan dan mengumpulkan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "82. Perintah Allah, bila Dia hendak mengadakan sesuatu, hanya dengan mengucapkan kepadanya, \"Jadilah!\" Maka ia pun jadi sebagaimana yang Allah kehendaki. Termasuk dalam hal ini adalah apa yang Allah kehendaki berupa menghidupkan, mematikan, membangkitkan dan sebagainya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "82. Penciptaan dan pembangkitan merupakan perkara yang sangat mudah bagi Allah, jika Dia menghendaki sesuatu maka Dia akan berkata “Jadilah”, maka hal itupun terjadi."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "82. أَن يَقُولَ لَهُۥ كُن فَيَكُونُ (Dia hanya cukup berkata kepadanya: \"Jadilah!\" maka terjadilah ia) Yakni jika Allah hendak melakukan sesuatu maka Dia akan mengatakan ‘kun’, tiba-tiba sesuatu itu telah tercipta tanpa harus menunggu hal lain."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "82. Sesungguhnya perintah Allah saat berkehendak menciptakan sesuatu itu hanya berkata kepadanya: Jadilah, maka terjadilah wujud ciptaan itu. Maknanya jika Dia menentukan sesuatu maka Dia akan memberlakukannya dengan sangat cepat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya ketetapanNya, jika Dia menghendaki sesuatu, Dia hanya berkata kepadanya,“Jadilah!” Maka, jadilah sesuatu itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "82. maka dari itu Dia berfirman, ”sesungguhnya perintahNya apabila Dia menghendaki sesuatu,” adalah kata nakirah (indifinit) dalam konteks syarat, maka maknanya mencakup segala sesuatu. “hanyalah berkata kepadanya,’jadilah!’ maka terjadilah ia,” maksudnya: terjadi pada saat itu juga tanpa ada jeda waktu atau penghalang."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 82: Allah mengabarkan bahwa jika Dia menginginkan sesuatu maka Allah cukup ucapkan “Jadilah” maka jadi seketika tanpa halangan, maka dari sini terdapat bukti atas ke-Maha Kuasaan Allah yang tiada batasan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini termasuk dalil mudahnya bagi Allah Subhaanahu wa Ta'aala menciptakan kembali manusia yang telah mati."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 82",
    "description": "Sesungguhnya urusan-Nya menciptakan segala sesuatu sangatlah mudah bagi-Nya. Apabila dia menghendaki untuk menciptakan sesuatu, dia hanya berkata kepadanya, 'jadilah!' maka dengan serta-merta jadilah sesuatu yang dikehendaki-Nya itu. 83. Itulah Allah yang mahakuasa. Maka mahasuci Allah yang di tangan-Nya kekuasaan penuh atas segala sesuatu di alam ini. Dialah yang menciptakan, mengatur, serta memeliharanya, dan kepada-Nya juga kamu dikembalikan. Keyakinan akan kekuasaan Allah akan timbul dalam hati apabila manusia mau menggunakan akal sehatnya untuk memperhatikan alam semesta ini. []."
  }
]