[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Karena itu, maha suci dan maha tinggi Allah dari kesyirikan dan kelemahan, karena Dia adalah maha raja yang meguasai segala sesuatu, yang bertindak terhadap segala urusan makhlukNya tanpa penentang dan penghalang. Bukti-bukti kuasaNya dan kesempurnaan nikmatnya telah terlihat, dan hanya kepadaNya kalian akan pulang untuk menghadapi prehitungan amal dan pembalasan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "83. Mahasuci Allah lagi Mahatinggi dari apa yang kaum musyrikin sandarkan kepada-Nya berupa kelemahan. Dia lah Tuhan Pemilik segala sesuatu. Dia lah yang mengatur semuanya sesuai dengan kehendak-Nya, di tangan-Nya kunci-kunci segala sesuatu, hanya kepada-Nya kalian dikembalikan pada hari Akhirat, lalu Dia membalas amal-amal kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "83. Maha Suci Allah dari kelemahan dan kesyirikan, Dia Maha Memiliki segalanya, Maha Mengatur seluruh makhluk dan urusan mereka tanpa ada yang membantu dan menyaingi-Nya. Telah jelas tanda-tanda kekuasaan-Nya, kebesaran hikmah-Nya, dan kesempurnaan nikmat-Nya. Seluruh makhluk akan kembali kepada-Nya pada hari kiamat untuk mendapat balasan pahala atas azab."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "83. فَسُبْحٰنَ الَّذِى بِيَدِهِۦ مَلَكُوتُ كُلِّ شَىْءٍ (Maka Maha Suci (Allah) yang di tangan-Nya kekuasaaan atas segala sesuatu) Segala sesuatu berada dalam kekuasaan-Nya dan Dia berkuasa untuk mengaturnya sesuai apa yang Dia inginkan, dan di tangan-Nya kunci segala sesuatu. وَإِلَيْهِ تُرْجَعُونَ(dan kepada-Nya-lah kamu dikembalikan) Dan itu pada kehidupan akhirat setelah kalian dibangkitkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "83. Maha suci Allah dari sesuatu yang tak layak bagiNya dan dari perumpamaan yang mereka buat-buat. Dialah Dzat yang memiliki kekuasan penuh dan agung atas setiap sesuatu. Dan hanya kepadaNyalah kalian akan dikembalikan di akhirat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka Maha suci Dzat yang kekuasaan atas segala sesuatu ada padaNya dan hanya kepadaNya kalian dikembalikan}"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "83 “maka Mahasuci Allah yang di tanganNYa kekuasaan atas segala sesuatu,” ini adalah dalil keenam. Sebab sesungguhnya Allah adalah Maharaja lagi Maha Pemilik segala sesuatu, yang semua apa yang tinggal di dalam atas dan alam bawah adalah milikNya, hamba yang ditundukkan lagi dikendalikan, Dia berbuat apa saja terhadap mereka berdasarkan ketetapan-ketetapanNya yang bersifat syar’I serta yang bersifat jaza’I (balasan). Maka penghidupan kembali orang-orang yang sudah mati untuk memberlakukan hukum balasanNya terhadap mereka merupakan bagian dari kesempurnaan kemaharajaanNYa. Maka dari itu Allah berfirman, ”dan kepadaNya-lah kamu dikembalikan,” tidak bisa diragukan dan tidak bisa pula dielakkan lagi karena sudah sangat banyak argument-argumen yang pasti (telak) dan dalil-dalil yang tegas yang membuktikan semua itu. Maka Mahasuci Allah yang telah menjadi petunjuk, penawar, dan cahaya di dalam firmanNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 83: Allah mensucikan diri-Nya yang bahwasanya Dia adalah Raja atas segala sesuatu, Maha Kuasa atas segala sesuatu dan segala sesuatu kembali dan dihisab atas amalan-amalan manusia dan dibalas di sisi-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ini adalah dalil keenam, yaitu bahwa Allah Subhaanahu wa Ta'aala adalah Raja, Dia memiliki segala sesuatu, di mana semua makhluk yang tinggal di alam semesta baik di alam bagian atas maupun alam bagian bawah adalah milik-Nya, hamba-Nya yang ditundukkan oleh-Nya serta diatur-Nya dengan hukum qadari-Nya, hukum syar’i-Nya dan hukum jaza’i(pembalasan)-Nya. Oleh karena itu, penciptaan-Nya kembali orang-orang yang telah mati untuk diberlakukan hukum jaza’i-Nya termasuk kesempurnaan kekuasaan-Nya. Oleh karenanya di akhir ayat Dia berfirman, “Dan kepada-Nya kamu dikembalikan.” Maka Mahasuci Allah yang menjadikan dalam firman-Nya petunjuk, penawar dan cahaya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 83",
    "description": "Itulah Allah yang mahakuasa. Maka mahasuci Allah yang di tangan-Nya kekuasaan penuh atas segala sesuatu di alam ini. Dialah yang menciptakan, mengatur, serta memeliharanya, dan kepada-Nya juga kamu dikembalikan. Keyakinan akan kekuasaan Allah akan timbul dalam hati apabila manusia mau menggunakan akal sehatnya untuk memperhatikan alam semesta ini. []1. Bila pada akhir surah y's'n Allah menjelaskan keesaan dan kekuasaan-Nya pada hari kiamat, pada permulaan surah ini Allah menegaskan bukti kekuasaan-Nya di alam raya. Demi rombongan malaikat yang berbaris bersaf-saf dengan rapi dalam melaksanakan tugas dan perintah Allah;."
  }
]