[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Kami menjadikan dinding penghalang di depan orang-orang kafir dan juga di belakang mereka, sehingga mereka seperti orang yang dihalang-halangi jalannya dari depan kedua matanya dan dibelakangnya. Lalu Kami membutakan penglihatan mereka disebabkan oleh kekafiran dan kesombongan mereka. Mereka tidak melihat jalan lurus dan tidak mendapatkan petunjuk kepadanya. Siapa pun yang berpaling dari dakwah Islam dan menentangnya, maka dia layak mendapatkan azab ini."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Kami menjadikan penghalang dari kebenaran di depan mereka, penghalang dari belakang mereka, Kami menutup penglihatan mereka dari kebenaran sehingga mereka tidak melihat kebenaran dengan penglihatan yang membuat mereka bisa mengambil manfaat darinya. Hal itu terjadi pada mereka sesudah mereka menentang dan tetap bersikukuh di atas kekufuran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "9. Dan Kami membuat penghalang di depan dan belakang mereka yang mengepung mereka dari segala sisi, sehingga mereka terhalang dari cahaya petunjuk; oleh sebab itu mereka tidak menerima kebenaran dan tidak berhenti dari kesesatan, namun mereka tetap terkepung di antara penghalang itu, sekaligus mendapat menutup yang menutupi dan membutakan mata mereka. Mereka tersandera dalam gelapnya kekafiran dan hawa nafsu, dan terhalang dari keimanan dan petunjuk."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. وَجَعَلْنَا مِنۢ بَيْنِ أَيْدِيهِمْ سَدًّا وَمِنْ خَلْفِهِمْ سَدًّا (Dan Kami adakan di hadapan mereka dinding dan di belakang mereka dinding) Yakni Kami halangi mereka dari keimanan dengan berbagai penghalang, sehingga mereka tidak dapat keluar dari kekafiran menuju keimanan, seperti orang yang dihalangi oleh dinding di depan dan belangkangnya. Dan penghalang-penghalang ini tidak lain adalah karena keangkuhan, keengganan mereka untuk menerima dan mentaati kebenaran. فَأَغْشَيْنٰهُمْ (dan Kami tutup (mata) mereka) Yakni kami tutup penglihatan mereka. فَهُمْ(sehingga mereka) Akibat hal itu. لَا يُبْصِرُونَ(tidak dapat melihat) Yakni mereka tidak dapat melihat jalan petunjuk, dan buta terhadap hari kebangkitan serta untuk menerima syari’at-syari’at yang ada di dunia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9. Kami memberi batasan antara mereka dan keimanan menggunakan penghalang dari depan dan belakang akibat keangkuhan mereka. Lalu Kami menutup penglihatan mereka dengan suatu penutu. Karena penutup itu, mereka tidak mampu melihat jalan petunjuk"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kami memasang penghalang} penghalang {di hadapan mereka dan di belakang mereka, sehingga Kami menutupi mereka} sehingga Kami menutupi penglihatan mereka dari kebenaran {Mereka juga tidak dapat melihat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9. “Dan Kami adakan di hadapan mereka dinding dan di belakang mereka juga dinding.” Maksudnya, penghalang yang menghalangi mereka untuk beriman, “sehingga mereka tidak dapat melihat,” karena telah diliputi oleh kebodohan dan kesengsaraan dari segala arah mereka, maka peringatan sama sekali tidak berguna bagi mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Yasin ayat 9: Kemudian Allah menggambarkan atas kondisi mereka yang lain, Allah Menjelaskan keadaan mereka orang-orang kafir sebagaimana keadaan bagi siapa yang dijadikan di hadapan mereka dinding dan di belakang mereka juga terdapat dinding."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini juga menurut sebagian ahli tafsir merupakan tamtsil yang menunjukkan tertutupnya jalan bagi mereka untuk beriman."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yasin Ayat 9",
    "description": "Dan kami jadikan di hadapan mereka sekat, yakni dinding penghalang antara mereka dengan kebenaran yang dibawa oleh nabi Muhammad, dan di belakang mereka juga kami ciptakan sekat, dan kami tutup mata mereka sehingga mereka tidak dapat melihat kebenaran. Itulah perum-pamaan orang-orang yang enggan melakukan kebaikan dan selalu menolak kebenaran. 10. Itu membuktikan bahwa peringatan apa pun sama sekali tidak ada pengaruhnya bagi kaum kafir. Dan sama saja bagi mereka, apakah engkau, wahai nabi Muhammad, memberi peringatan kepada mereka akan adanya azab atau engkau tidak memberi peringatan kepada mereka; pada akhirnya mereka tetap tidak akan beriman juga. Itu semua diakibatkan oleh keengganan mereka menerima petunjuk Allah yang disampaikan oleh para rasul."
  }
]