[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-4. Allah bersumpah dengan langit dan bintang yang datang di malam hari, Tahukah kamu besarnya bintang itu? Ia adalah bintang yang bersinar terang, Tidak ada satu jiwapun kecuali ditugaskan untuknya seorang malaikat pengawas yang menjaga amal amalnya, agar amal amalnya itu dihisab pada hari kiamat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Allah bersumpah dengan langit, dan bersumpah dengan bintang yang mengetuk di malam hari."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1-4. Allah memperingatkan para hamba-Nya dari kelalaian terhadap amalan mereka di dunia, karena tidaklah seseorang melainkan dia memiliki malaikat pengawas yang menghitung dan mencatat amalannya untuk mendapatkan balasan atas amalan itu. Allah menegaskan hal ini dengan dua sumpah: Demi langit-langit yang luas, dan demi bintang-bintang yang datang pada malam hari, bersinar di langit yang tidak diketahui hakikatnya oleh manusia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. وَالسَّمَآءِ وَالطَّارِقِ (Demi langit dan yang datang pada malam hari) Allah bersumpah dengan langit dan bintang. Disebut dengan thariq karena ia akan muncul pada malam hari dan menghilang di siang hari. (Dan dalam bahasa Arab), orang yang datang pada malam hari disebut dengan thariq."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Keutamaan: Diriwayatkan dari Nasai dari Jabir bin Abdullah, berkata: Ketika Mu’adz mendirikan shalat maghrib, dia membaca surat Al-baqarah dan An-nisa. Kemudian Nabi tahu dan berkata: “Wahai Mu’adz, apakah kamu menjadi pembuat fitnah? Mengapa kamu tidak membaca was sama’i wath thariq atau wasy syamsi wa dhulhaha atau semisalnya saja?” 1. Aku (Allah) bersumpah demi langit dan bintang yang muncul di waktu malam. Bintang itu disebut dengan Ath Thariq, karena bintang itu muncul ketika malam dan hilang ketika siang."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Demi langit dan yang datang pada malam hari} Aku bersumpah demi bintang-bintang yang muncul pada malam hari"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 1-4 Allah berfirman, “Demi langit dan yang datang pada malam hari,” kemudian yang datang di malam hari dijelaskan dengan FirmanNya, “(Yaitu) bintang yang cahayanya menembus,” yakni yang bercahaya yang cahayanya menembus dan membakar langit hingga tembus dan terlihat dari bumi. Yang benar, bintang yang cahayanya menembus adalah kata umum yang mencakup seluruh bintang yang cahayanya menembus. Ada yang menafsirkannya dengan bintang saturnus yang memecah ketujuh langit dan menembusnya hingga dapat terlihat darinya. Disebut ath-Thariq karena bintang tersebut datang di waktu malam. Obyek sumpahnya adalah Firman Allah, “Tidak ada suatu jiwa pun (diri) melainkan ada penjaganya,” yang menjaga amal perbuatannya, baik dan buruknya, dan amal yang dijaganya akan dibalas."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Diawal surah ini Allah ﷻ bersumpah dengan dua hal : Dia bersumpah dengan langit, dan dengan attoriq, Allah ﷻ berhak bersumpah dengan apapun yang Dia inginkan, dan Allah ﷻ tidak bersumpah dengan sesuatu melainkan ada ibroh atau pelajaran yang dapat diserap oleh manusia dari sesuatu itu. Sedangkan hamba tidak berhak baginya untuk bersumpah dengan sesuatu apapun kecuali dia bersumpah dengan nama Allah ﷻ, sperti yang dsabdakan oleh Rasulullah ﷺ : (( مَنْ كَانَ حَالِفًا فَلْيَحْلِفْ بِاللَّهِ أَوْ لِيَصْمُتْ )) \"barangsiapa bersumpah, hendaklah dia bersumpah dengan (nama) Allâh atau diam\" Diriwayatkan oleh : Imam Bukhori : 2679 , di hadits lain Rasulullah bersabda : (( مَنْ حَلَفَ بِغَيْرِ اللَّهِ فَقَدْ كَفَرَ أَوْ أَشْرَكَ )) “Barangsiapa yang bersumpah dengan menyebut selain nama Allah, maka sungguh dia telah kafir atau musyrik” Diriwayatkan oleh : Imam Atturmudzy : 1535 Dari hadits Ibnu Umar , dan Shohohkan oleh Al-Albani dalam kitabnya \"Al Irwa' \". Di ayat ini Allah bersumpah dengan langit yang tujuh tungkatan itu, karena padanya terdapat pelajaran yang sangat penting, juga sebagai atap untuk bumi, itulah nikmat Allah yang sangat besar."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَالسَّمَاءِ وَالطَّارِقِ “Demi langit dan yang datang pada malam hari” Allah ‘Azza Wa Jalla memulai surat ini dengam sumpah, Allah bersumpah dengan langit dan dengan ath-thaariq (yang datang pada malam hari). Terkadanng sumpah Allah dengan makhluk menjadi masalah bagi sebagian orang, bagaimana mungkin Allah Subhaanahu wa Ta’ala bersumpah dengan makhluk-makhluk padahal bersumpah dengan makhluk-makhluk adalah kesyirikan sebagaimana sabda Nabi shallallaahu ‘alaihi wa sallam: مَنْ حَلَفَ بِغَيْرِ اللهِ فَقَدْ كَفَرَ أَوْ أَشْرَكَ “Siapa saja yang bersumpah dengan nama selain maka dia telah kafir atau menjadi musyrik” (1) Beliau ‘alaihissholaatu wassalaam juga bersabda: مَنْ كَانَ حَالِفاً فَلْيَحْلِفْ بِاللهِ أَوْ لِيَصْمُتْ “ Barang siapa yang bersumpah maka bersumpahlah dengan (nama) Allah atau diam” (2) dengan demikian, maka tidak diperbolehkan bersumpah dengan selain Allah, baik dengan para nabi, malaikat-malaikat, dengan ka’bah atau pun dengan negri tidak juga dengan sesuatu dari makhluk-makhluk? Jawaban dari masalah di atas, kita katakan: Sungguh Allah subhaanahu wa ta’ala punya hak untuk bersumpah dengan segala yang Dia kehendaki dari makhluk-Nya, dan sumpah Allah dengan makhluk-Nya menunjukan kebesaran Allah ‘Azza Wa Jalla, karena kebesaran makhluk menunjukkan besarnya yang menciptakannya. Allah banyak bersumpah dengan makhluq-Nya, dan di antara ulama yang aku pandang terbaik dalam menjelaskan masalah ini adalah Ibnul Qayim rahimahullaah dalam kitabnya at-Tibyaan fii Aqsaamil Qur’aan. Ini adalah kitab yang bagus, banyak manfaatnya bagi penuntut ilmu. Di sini Allah Ta’ala bersumpah dengan as-Samaa, sedangkan as-Samaa artinya adalah segala sesuatu yang berada di atasmu, maka segala yang ada di atasmu disebut langit, begitu pun awan yang air hujan turun darinya disebut Samaa’ sebagaiman Allah Ta’ala berfirman: أَنْزَلَ مِنَ السَّمَاءِ مَاءً فَسَالَتْ أَوْدِيَةٌ بِقَدَرِهَا \"Allah telah menurunkan air (hujan) dari langit, maka mengalirlah air di lembah-lembah menurut ukurannya, ”(QS. Ar-Ra’du: 17) jika penyebutan samaa mencakup segala yang berada di atasmu, dengan begitu maka sama mencakup apa-apa yang beradai di antara langit dan bumi, dan mencakup langit-langit seluruhnya, karena semua itu berada di atasmu. Sedangkan firman-Nya وَالطَّارِقِ [wath-thaariq] ini adalah sumpah kedua, maknanya: Bahwa Allah bersumpah dengan ath-Thariq, apa yang dimaksud dengan Thariq? Thariq di sini bukan orang yang mengetuk keluarganya di malam hari, tapi thariq di sini dijelaskan Allah ‘Azza Wa Jalla dengan firman-Nya: النَّجْمُ الثَّاقِبُ “(yaitu) bintang yang cahayanya menembus, ” Inilah yang dimaksud Thariq. Yang dimaksudkan dengan Bintang dalam ayat ini bisa seluruh bintang sehingga ال [alif lam] di sini adalah al-jins (yang bermakna mencakupkan semua bintang) bisa juga bermakna bintang yang cahayanya menembus, yang berkilau, kilauannya tajam, karena dia menyorot kegelapan dengan cahayanya. Bintang apa pun itu maka sejatinya bintang-bintang tu adalah di antara ayat-ayat (tanda-tanda kebesaran) Allah ‘Azza Wa Jalla yang menunjukan kesempurnaan kuasa-Nya dalam menjalankan dan mengaturnya, juga membedakan bentuk-bentuk dan manfaat-manfaatnya juga. Allah Tabaaraka wa Ta’ala berfirman: وَعَلَامَاتٍ وَبِالنَّجْمِ هُمْ يَهْتَدُوْنَ “dan (Dia ciptakan) tanda-tanda (penunjuk jalan). Dan dengan bintang-bintang itulah mereka mendapat petunjuk. ”(QS. An-Nahl: 16) Allah Ta’a juga berfirman: وَلَقَدْ زَيَّنَّا السَّمَاءَ الدُّنْيَا بِمَصَابِيْحَ وَجَعَلْنَاهَا رُجُوْماً لِلشَّيَاطِيْنِ “Sesungguhnya Kami telah menghiasi langit yang dekat dengan bintang-bintang, dan Kami jadikan bintang-bintang itu alat-alat pelempar syaitan, ”(QS.AL-Mulk: 5) bintang-bintang dilangit adalah hiasan langit, juga sebagai pelempar setan dan tanda-tanda untuk petunjuk jalan. (1) Dikeluarkan Tirmiziy (1535) dari hadits Ibnu Umar Radhiyallaahu ‘anhaa dinyatakan shahih al-Albaniy dalam shahih al-Jami’ (6204) (2) Dikeluarkan Bukhari (2679) dan Muslim (1646) dari hadits Abdullah Bin Umar radhiyallaahu ‘anhumaa."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tariq ayat 1: 1-4. Allah memulai surat ini dengan bersumpah dengan langit yang memiliki bintang-bintang bercahaya. Dan Ia bersumpah dengan sesuatu yang datang pada malam hari. Kemudian Allah memberi pertanyaan yang membangkitkan minat keingin tahuan dengan berkata : Apakah engkau tahu wahai Nabi Allah, dengan sesuatu yang datang pada malam hari ini ? Lalu Allah jelaskan bahwa ia adalah bintang yang bersinar dimana cahayanya menembus kegelapan malam, memberi petunjuk kepada siapa yang berjalan di malam hari dan menyembunyikan siang. Kemudian datang penjelasan jawaban bagi sumpah Allah, bahwa setiap jiwa ada penjaganya dari kalangan para malaikat, yang senantiasa menjaga dan mencatat atas apa yang nampak oleh malaikat dari kebaikan dan keburukan (manusia)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tariq Ayat 1",
    "description": "Demi langit yang terbentang dengan kukuh tanpa penopang dan demi apa yang datang pada malam hari dan menghiasi langit. 2. Dan wahai nabi, tahukah kamu apakah yang datang pada malam hari itu'."
  }
]