[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "9-10. Hari itu, apa yang disimpan oleh dada akan ditampakkan, dibedakan antara yang baik dan yang buruk. Manusia tidak punya kekuatan untuk membela dirinya. Manusia tidak punya penolong yang menghindarkannya dari azab Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Pada Hari itu manusia sama sekali tidak mempunyai kekuatan yang bisa mencegahnya dari siksa Allah, dan tidak ada penolong yang dapat menolongnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. إِنَّهُۥ عَلَىٰ رَجْعِهِۦ لَقَادِرٌ (Sesungguhnya Allah benar-benar kuasa untuk mengembalikannya) Yakni membangkitkannya setelah kematian."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Perhatikanlah bagaimana ayat ini menafikan semua sebab yang mungkin terjadi pada diri manusia pada hari kiamat nanti, seperti kekuatan yang dimiliki oleh manusia akan sirna semuanya, begitupun dengan teman-teman mereka yang ketika didunia menjadi penolong semuanya akan tidak berarti pada hari pembalasan itu tiba."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10. Orang-orang yang dulu mengingkari hari kebangkitan dan mereka orang kafir, sama sekali tidak punya daya dan kekuatan untuk bisa terbebas dari azab Allah. Mereka tidak mempunyai penolong sama sekali"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka tidak ada lagi baginya kekuatan dan tidak pula ada penolong"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 8-10 Dzat yang menciptakan manusia dari air yang memancar yang keluar dari tempat yang sulit, tentu mampu untuk mengembalikannya di akhirat dan untuk membangkitkan, mengumpulkan, dan memberi balasan. Ada yang menafsirkan bahwa maknanya adalah, sesungguhnya Allah kuasa untuk mengembalikan air mani yang terpancar ke dalam tulang sulbi kembali. Karena itu Allah berfirman setelahnya, “Pada hari dinampakkan segala rahasia,” yaitu rahasia-rahasia dada ditampakkan dan segala kebaikan dan keburukan yang ada di hati terlihat pada rona muka. Seperti difirmankan Allah, “Pada hari wajah-wajah memutih dan wajah-wajah menghitam.” (Ali Imran: 106) Di dalam dunia, banyak hal yang bisa disembunyikan yang tidak tampak oleh mata manusia, tapi di Hari Kiamat, kebaikan orang-orang baik dan dosa orang-orang yang berdosa pasti nampak. Semua hal menjadi terang dan jelas. Allah berfirman, “Maka sekali-kali tidak ada bagi manusia itu suatu kekuatan pun,” yakni dari dirinya yang bisa menangkal , “dan tidak (pula) seorang penolong” dari luar yang menolongnya. Ini adalah sumpah terhadap orang-orang yang berbuat pada saat mereka melakukannya dan pada saat mereka diberi balasan."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Lalu apa yang akan terjadi dengan diri manusia pada saat itu ? Pada saat semua yang tersembunyi dalam diri manusia ditampakkan dan semua perkara itu berhak atasnya azab , { فَمَا لَهُ مِنْ قُوَّةٍ وَلَا نَاصِرٍ } maka pada saat itu pula mereka tidak memliki kekuatan apapun dan penolong yang akan menolong mereka untuk menghindarkan diri dari azab tersebut, keluarga, sahabat, saudara, teman, ayah, ibu, dan anak-anak mereka serta istri tidak mampu menyelamatkan dan memberikan pertolongan untuk menghindar dari azab yang pedih atas kemaksiatan yang dihasilkan oleh diri mereka sendiri yang selama didunia mereka sembunyikan dari penglihatan dan pengawasan manusia, siapaun tidak mampu memberikan pertolongan sebagaimana didunia. Maka dari itu, menjadi motifas bagi setiap insan untuk mengingat akan hal ini dan selalu mempersiapkan diri untuk menghadapi apapun yang akan terjadi pada hari kiamat."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Kemudian Allah Ta’ala berfirman: فَمَا لَهُ مِنْ قُوَّةٍ “maka sekali-kali tidak ada bagi manusia itu suatu kekuatanpun dan tidak (pula) seorang penolong. ” yaitu di hari kiamat manusia tidak akan punya kekuatan sama sekali, ولا ناصر \"dan tidak (pula) seorang penolong.” yaitu kekuatan dari luar, dirinya sendiri tidak dapat membeladiri dan tidak ada seorang pun yang dapat membelanya, Allah Ta’ala berfirman: فَإِذَا نُفِخَ فِي الصُّوْرِ فَلَا أَنْسَابَ بَيْنَهُمْ يَوْمَئِذٍ وَلَا يَتَسَاءَلُوْنَ “Apabila sangkakala ditiup maka tidaklah ada lagi pertalian nasab di antara mereka pada hari itu, dan tidak ada pula mereka saling bertanya. ”(QS. Al-Mu’minun: 101) di dunia mereka saling bertanya, mereka bertanya satu sama lain, dan berlindung satu kepada yang lain, tetapi di hari kiamat tidak akan ada lagi nasab, yakni: tidak akan kekerabatan, kekerabatan tidak lagi bermanfaat dan mereka tidak akan saling bertanya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tariq ayat 10: Pada hari itu tidak akan mampu manusia untuk dapat memilih (menolak) adzab dengan kekuatannya atau menjauhkannya dari dirinya agar tidak tertimpa adzab Allah. Tidak ada penolong yang akan menolong ata apa yang diturunkan padanya dari kepedihan dan musibah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang mengingkari kebangkitan. Dari dalam dirinya untuk menolak azab yang menimpanya. Yang menghindarkan azab dari dirinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tariq Ayat 10",
    "description": "Ketika semua persoalan terkuak di hadapan Allah maka manusia tidak lagi mempunyai suatu kekuatan dalam dirinya sendiri dan tidak pula ada penolong dari luar dirinya yang mengelakkan nya dari balasan Allah. Allah-lah penguasa tunggal pada hari itu. 11-12. Demi langit yang mengandung hujan yang turun kembali ke bumi. Dengan hujan bumi yang tandus menjadi subur. Inilah salah satu bukti kasih sayang Allah kepada makhluk-Nya. Dan demi bumi yang mempunyai tumbuh-tumbuhan. Benih yang tersiram hujan akan mulai tumbuh dan menembus permukaan tanah untuk berkembang. Banyaknya tumbuhan dan pepohonan mendatangkan manfaat yang besar bagi makhluk hidup lainnya."
  }
]