[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "11-14. Demi langit yang menurunkan hujan berkali-kali, Dan bumi yang memiliki biji-bijian yang tumbuh, Sesungguhnya al-qu’an adalah perkataan yang memisahkan antara yang haq dengan yang batil, Ia tidak main main. Tidak boleh bagi makhluk bersumpah dengan selain Allah, karena itu adalah kesyirikan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Allah bersumpah dengan langit yang mengandung hujan, karena hujan turun dari arah langit berkali-kali."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "11-14. Demi langit yang menurunkan hujan berkali-kali dan demi bumi yang terpecah untuk mengeluarkan tanaman; sungguh al-Qur’an merupakan firman yang membedakan antara kebenaran dan kebatilan, ia bukanlah ucapan senda gurau dan permainan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "11. وَالسَّمَآءِ ذَاتِ الرَّجْعِ (Demi langit yang mengandung hujan) Makna (الرجع) yakni hujan; sebab ia datang dan pergi secara berulang-ulang."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11-12. Aku (Allah) bersumpah demi langit yang mengandung hujan yang setelah hujan itu turun ke bumi akan kembali lagi ke langit. Dan juga bersumpah demi bumi yang dengan hujan itu mengeluarkan tetumbuhan dan pepohonan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Demi langit yang mengandung hujan} hujan yang turun diulang ulang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 11-14 Kemudian Allah membagi golongan selanjutnya berdasar keabsahan al-Qur’an seraya berfirman, “Demi langit yang mengandung hujan, dan bumi yang mempunyai tumbuh-tumbuhan,” yakni langit membawa hujan setiap tahunnya dan bumi mengembalikannya berupa tumbuh-tumbuhan sehingga manusia dan binatang bisa hidup dengannya. Langit juga membawa takdir dan urusan-urusan ilahi di setiap waktu sedangkan bumi menumbuhkan tumbuh-tumbuhan. “Sesungguhnya al-Qur’an itu benar-benar Firman yang memisahkan antara yang haq dan yang batil,” yaitu benar, jujur, jelas, dan terang, “dan sekali-kali bukanlah ia senda gurau,” yakni serius, bukan senda gurau. Al-Qur’an adalah Firman yang membedakan antara berbagai golongan dan berbagai perkataan, serta memutuskan berbagai sengketa."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Kemudian Allah ﷻ bersumpah dengan langit dengan sifat lain yang dimiliknya, Allah ﷻ berfirman : { وَالسَّمَاءِ ذَاتِ الرَّجْعِ } Demi langit yang menurunkan hujan kepermukaan bumi, yakni : hujan yang diturunkan dari asalnya yaitu awan tebal yang menggumpal di langit."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Setelah menyebutkan sumpah-sumpah dari ayat وَالسَّمَاءِ وَالطَّارِقِ \"Demi langit dan yang datang pada malam hari, \" hingga akhir, hingga ayat يَوْمَ تُبْلَى السَّرَائِرُ (9) فَمَا لَهُ مِنْ قُوَّةٍ وَلَا نَاصِرٍ \"Pada hari dinampakkan segala rahasia, maka sekali-kali tidak ada bagi manusia itu suatu kekuatanpun dan tidak (pula) seorang penolong. \" Allah Ta’ala berfirman: وَالسَّمَاءِ ذَاتِ الرَّجْعِ (11) وَالْأَرْضِ ذَاتِ الصَّدْعِ “Demi langit yang mengandung hujan,dan bumi yang mempunyai tumbuh-tumbuhan, “ Ini adalah sumpah kedua untuk langit, sumpah yang pertama yang terletak di awal surat, pada ayat-ayat tersebut Allah berfirman: وَالسَّمَاءِ وَالطَّارِقِ (1) وَمَا أَدْرَاكَ مَا الطَّارِقُ (2) النَّجْمُ الثَّاقِبُ\"Demi langit dan yang datang pada malam hari,tahukah kamu apakah yang datang pada malam hari itu? (yaitu) bintang yang cahayanya menembus, ” Kemudian di sini Allah berfirman:وَالسَّمَاءِ ذَاتِ الرَّجْعِ (11) وَالْأَرْضِ ذَاتِ الصَّدْعِ (12) إِنَّهُ لَقَوْلٌ فَصْلٌ “Demi langit yang mengandung hujan,dan bumi yang mempunyai tumbuh-tumbuhan,sesungguhnya Al Quran itu benar-benar firman yang memisahkan antara yang hak dan yang bathil. ” Sisi keserasian antara dua sumpah tersebut wallaahu a’lam: Sumpah pertama terdapat isyarat kepada thariq yang berarti bintang, sedangkan bintang itu alat pelempar setan-setan yang mencuri berita langit, dengan pelemperan setan tersebut ada penjagaan kitab Allah ‘azza Wa Jalla, ada pun di sini Allah bersumpah dengan langit yang ar-Raj’ mengandung hujan bahwa alquran ini adalah perkataan pembeda, sehingga Allah bersumpah bahwa al-Quran adalah perkataan pemisah. Dengan begitu, maka sumpah pertama kecocokannya adalah bahwa di dalamnya terdapat isyarat terhadap sesuatu yang dengannya alquran terjaga saat diturunkan, dan di sumpah yang kedua terdapat isyarat bahwa al-Quran adalah kehidupan, yakni dikatakan: وَالسَّمَاءِ ذَاتِ الرَّجْعِ “Demi langit yang mengandung hujan ” Ar-Raj’u maknanya hujan, disebut dengan raj’ karena ia selalu kembali dan berulang, dan telah dimaklumi bahwa dengan turunnya hujan bumi menjadi hidup."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tariq ayat 11: 11-12. Kemudian Allah kembalikan dan Ia bersumpah dengan langit yang menurunkan hujan terus menerus, dan bersumpah dengan bumi yang gersang yang kemudian dikeluarkan darinya tumbuh-tumbuhan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sumpah yang disebutkan sebelumnya untuk menerangkan keadaan orang-orang yang beramal ketika mereka beramal dan ketika mereka diberi balasan. Pada ayat ini, Allah Subhaanahu wa Ta'aala bersumpah untuk menerangkan kebenaran Al Qur’an. Raj'i berarti kembali. Ada yang berpendapat, bahwa hujan dinamakan raj'i dalam ayat ini, karena hujan berasal dari uap yang naik dari bumi ke udara, kemudian turun ke bumi, kemudian kembali ke atas, dan dari atas kembali ke bumi dan begitulah seterusnya, wallahu a’lam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tariq Ayat 11",
    "description": "11-12. Demi langit yang mengandung hujan yang turun kembali ke bumi. Dengan hujan bumi yang tandus menjadi subur. Inilah salah satu bukti kasih sayang Allah kepada makhluk-Nya. Dan demi bumi yang mempunyai tumbuh-tumbuhan. Benih yang tersiram hujan akan mulai tumbuh dan menembus permukaan tanah untuk berkembang. Banyaknya tumbuhan dan pepohonan mendatangkan manfaat yang besar bagi makhluk hidup lainnya"
  }
]