[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "11-14. Demi langit yang menurunkan hujan berkali-kali, Dan bumi yang memiliki biji-bijian yang tumbuh, Sesungguhnya al-qu’an adalah perkataan yang memisahkan antara yang haq dengan yang batil, Ia tidak main main. Tidak boleh bagi makhluk bersumpah dengan selain Allah, karena itu adalah kesyirikan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Dan bersumpah dengan bumi yang memunculkan apa yang ada di dalamnya yang berupa tumbuh-tumbuhan, buah-buahan dan pepohonan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "12. وَالْأَرْضِ ذَاتِ الصَّدْعِ (dan bumi yang mempunyai tumbuh-tumbuhan) Yakni apa yang membelah tanah, berupa tanaman, dan pepohonan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11-12. Aku (Allah) bersumpah demi langit yang mengandung hujan yang setelah hujan itu turun ke bumi akan kembali lagi ke langit. Dan juga bersumpah demi bumi yang dengan hujan itu mengeluarkan tetumbuhan dan pepohonan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan bumi yang memiliki rekahan} memiliki rekahan dan tanaman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 11-14 Kemudian Allah membagi golongan selanjutnya berdasar keabsahan al-Qur’an seraya berfirman, “Demi langit yang mengandung hujan, dan bumi yang mempunyai tumbuh-tumbuhan,” yakni langit membawa hujan setiap tahunnya dan bumi mengembalikannya berupa tumbuh-tumbuhan sehingga manusia dan binatang bisa hidup dengannya. Langit juga membawa takdir dan urusan-urusan ilahi di setiap waktu sedangkan bumi menumbuhkan tumbuh-tumbuhan. “Sesungguhnya al-Qur’an itu benar-benar Firman yang memisahkan antara yang haq dan yang batil,” yaitu benar, jujur, jelas, dan terang, “dan sekali-kali bukanlah ia senda gurau,” yakni serius, bukan senda gurau. Al-Qur’an adalah Firman yang membedakan antara berbagai golongan dan berbagai perkataan, serta memutuskan berbagai sengketa."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Dan demi bumi yang terbelah, yakni ketika turun hujan kebumi terbelahlah bumi itu dengan tumbuh-tuumbuhan yang tumbuh ditasnya, Allah ﷻ berfirman : { أَنَّا صَبَبْنَا الْمَاءَ صَبًّا , ثُمَّ شَقَقْنَا الْأَرْضَ شَقًّا , فَأَنْبَتْنَا فِيهَا حَبًّا , وَعِنَبًا وَقَضْبًا , وَزَيْتُونًا وَنَخْلًا , وَحَدَائِقَ غُلْبًا , وَفَاكِهَةً وَأَبًّا , مَتَاعًا لَكُمْ وَلِأَنْعَامِكُمْ } ( Sesungguhnya Kami benar-benar telah mencurahkan air (dari langit) , Kemudian Kami belah bumi dengan sebaik-baiknya , Lalu Kami tumbuhkan biji-bijian di bumi itu , Anggur dan sayur-sayuran , Kebun-kebun (yang) lebat , Dan buah-buahan serta rumput-rumputan , Untuk kesenanganmu dan untuk binatang-binatang ternakmu. ) [ 'Abasa : 25 - 32 ] , dengan tumbuh-tumbahan inilah tanah-tanah di bumi terbelah, tumbuhan yang sebelumnya adalah biji-bijian yang tertanam di tanah, kemudian setelah turunnya hujan biji-bijian itu pun tumbuh dengan subur atas izin Allah ﷻ . Perhatikanlah : bagaimana Allah ﷻ menjadikan biji-bijian mati yang tertanam di dalam tanah, kemudian turunlah hujan dan biji-bijian itu kemudian terpecah dan mengeluarkan daun pertama serta akarnya tumbuh kebawah, dan dedaunan serta batang dan tangkai tumbuh menjulang tinggi ke langit, Allah ﷻ menghidupkan biji-bijian itu setelah kematiannya, begitupun dengan jasad manusia yang tertimbun didalam tanah yang telah berubah menjadi tanah, yang dalam sebuah riwayat dikatakan bahwasanya mayat-mayat tersebut akan diguyuri hujan selama 40 hari; kemudian anggota tubuh mereka pun kembali utuh, jasad-jasad itu kembali tumbuh sebagaimana tumbuhnya pepohonan dari dalam tanah, dalam hadits yang riwayatnya Shohih dkatakan : bahwasanya seluruh jasad manusia akan hancur didalam tanah kecuali satu anggota tubuh yaitu tulang ekor, tulang inilah satu-satunya dari aggota tubuh manusia yang tidak akan hancur bersama tanah, dari tulang ekor inilah jasad manusia akan kembali dirangkap seperti semula."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَالْأَرْضِ ذَاتِ الصَّدْعِ \"dan bumi yang mempunyai tumbuh-tumbuhan\" As-Shada’ aritinya terpecah, yakni terpecah dengan keluarnya tubuhan-tumbuhan, Allah bersumpah dengan hujan yang menjadi sebab keluarnya tumbuhan-tumbuhan, dan dengan terpecahnya (tanah) yang darinya keluar tumbuhan-tumbuhan. Semua itu adalah isyarat kembali hidupnya bumi setelah ia mati, dan Al-Quran pun menjadikan hati kembali hidup setelah mati, sebagaimana Allah Tabaraka Wa Ta’ala berfirman: كَذَلِكَ أَوْحَيْنَا إِلَيْكَ رُوحًا مِنْ أَمْرِنَا “Dan demikianlah Kami wahyukan kepadamu ruh (Al Quran) dengan perintah Kami ”(QS. As-Syura: 52) Allah menyeut al-Quran denga kata ruh karena ia dapat menghidupkan hati-hati. Allah ‘Azza Wa Jalla berfirman: : وَالسَّمَاءِ ذَاتِ الرَّجْعِ (11) “Demi langit yang mengandung hujan,dan bumi yang mempunyai tumbuh-tumbuhan, “ Maknanya mengandung hujan. وَالْأَرْضِ ذَاتِ الصَّدْعِ \"dan bumi yang terpecah\" Maknanya memiliki pecahan untuk keluarnya tubuhan-tumbuhan, sesungguhnya L-Quran adalah لَقَوْلٌ فَصْلٌ \"sesungguhnya Al Quran itu benar-benar firman yang memisahkan \" Allah mensifati al-Wuran dengan sebutan bahwa ia pemisah, dia lah perkataan Allah ‘Azza Wa Jalla, Dialah yang berkata dengannya dan ia sampaikan kepada Jibril ‘alaihissalaam kemudian Jibril turun dengan membawanya ke hati Nabi shallallaahu ‘alaihi wa sallam Allah telah enyandarkan al-Quran sebagai ucapan kepada Jibril dan juga kepada Muhammad ‘alaihimassholaatu wassalaam. Allah berfirman berkaitan yang pertama: إِنَّهُ لَقَوْلُ رَسُولٍ كَرِيمٍ (19) ذِي قُوَّةٍ عِنْدَ ذِي الْعَرْشِ مَكِينٍ (20) مُطَاعٍ ثَمَّ أَمِينٍ “sesungguhnya Al Quran itu benar-benar firman (Allah yang dibawa oleh) utusan yang mulia (Jibril),yang mempunyai kekuatan, yang mempunyai kedudukan tinggi di sisi Allah yang mempunyai 'Arsy, yang ditaati di sana (di alam malaikat) lagi dipercaya.”(QS. At-Takwir: 19-21) dan yang kedua penyandaran al-Quran kepada Rasul shallallaahu ‘alaihi wa sallam إِنَّهُ لَقَوْلُ رَسُولٍ كَرِيمٍ (40) وَمَا هُوَ بِقَوْلِ شَاعِرٍ قَلِيلًا مَا تُؤْمِنُونَ “Sesungguhnya Al Quran itu adalah benar-benar wahyu (Allah yang diturunkan kepada) Rasul yang mulia,dan Al Quran itu bukanlah perkataan seorang penyair. Sedikit sekali kamu beriman kepadanya”(QS. AL-Haqqah: 40-41). Yang pertama Allah menyandarkan perkataan ini kepada jibril ‘alahissalaam, kerena ialah yang nyampaikan al-Quran dar Allah kepada Muhammada shallallaahu ‘alaihi wa sallam, dan yang kedua Allah snadarkan kepada Muhamma shallallaahu ‘alaihi wa sallam karena beliaulah yang menyampaikannya kepada Manusia, walau pun demikian tetaplah Allah subhaanahu wa Ta’ala yang pertama kali mengucapkannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tariq ayat 12: 11-12. Kemudian Allah kembalikan dan Ia bersumpah dengan langit yang menurunkan hujan terus menerus, dan bersumpah dengan bumi yang gersang yang kemudian dikeluarkan darinya tumbuh-tumbuhan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan demikian, manusia dan hewan pun menjadi hidup."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tariq Ayat 12",
    "description": "11-12. Demi langit yang mengandung hujan yang turun kembali ke bumi. Dengan hujan bumi yang tandus menjadi subur. Inilah salah satu bukti kasih sayang Allah kepada makhluk-Nya. Dan demi bumi yang mempunyai tumbuh-tumbuhan. Benih yang tersiram hujan akan mulai tumbuh dan menembus permukaan tanah untuk berkembang. Banyaknya tumbuhan dan pepohonan mendatangkan manfaat yang besar bagi makhluk hidup lainnya. 13. Sungguh, al-quran yang didustakan oleh kaum kafir itu benar-benar firman yang menjadi pemisah antara perkara hak dan batil. Sulit bagi manusia untuk membedakan keduanya tanpa tuntunan Al-Qur'an. Al-qur'an menjadi salah satu bukti kasih sayang Allah karena menjadi penerang jalan hidup dan pemberi solusi bagi persoalan manusia."
  }
]