[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "11-14. Demi langit yang menurunkan hujan berkali-kali, Dan bumi yang memiliki biji-bijian yang tumbuh, Sesungguhnya al-qu’an adalah perkataan yang memisahkan antara yang haq dengan yang batil, Ia tidak main main. Tidak boleh bagi makhluk bersumpah dengan selain Allah, karena itu adalah kesyirikan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "13. Sesungguhnya Al-Qur`ān yang diturunkan kepada Muhammad -ṣallallāhu 'alaihi wa sallam- ini adalah ucapan yang membedakan antara yang benar dan yang batil, yang jujur dan yang dusta."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "13. إِنَّهُۥ لَقَوْلٌ فَصْلٌ (sesungguhnya Al Quran itu benar-benar firman yang memisahkan antara yang hak dan yang bathil) Yakni al-Qur’an adalah firman yang membedakan antara kebenaran dan kebatilan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13-14. Sesungguhnya, Al-quran itu memisahkan antara yang benar dan salah, Al-quran itu sendirilah yang menjadi pemisah. Al-quran tidak diturunkan dengan senda gurau dan main-main"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{sesungguhnya itu} Al-Qur'an itu {benar-benar firman pemisah} yang memisahkan antara yang hak dan yang bathil"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 11-14 Kemudian Allah membagi golongan selanjutnya berdasar keabsahan al-Qur’an seraya berfirman, “Demi langit yang mengandung hujan, dan bumi yang mempunyai tumbuh-tumbuhan,” yakni langit membawa hujan setiap tahunnya dan bumi mengembalikannya berupa tumbuh-tumbuhan sehingga manusia dan binatang bisa hidup dengannya. Langit juga membawa takdir dan urusan-urusan ilahi di setiap waktu sedangkan bumi menumbuhkan tumbuh-tumbuhan. “Sesungguhnya al-Qur’an itu benar-benar Firman yang memisahkan antara yang haq dan yang batil,” yaitu benar, jujur, jelas, dan terang, “dan sekali-kali bukanlah ia senda gurau,” yakni serius, bukan senda gurau. Al-Qur’an adalah Firman yang membedakan antara berbagai golongan dan berbagai perkataan, serta memutuskan berbagai sengketa."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ إِنَّهُ لَقَوْلٌ } Sesungguhnya Al-Qur'an itu adalah { لَقَوْلٌ فَصْلٌ } perkataan pemisah, yakni perkataan mulia yang diucapkan oleh Allah ﷻ sebagai pemisah antara yang haq dan bathil, perkataan yang memisahkan antara kejujuran dan kebohongan. sebagai pemisah antara kemuliaan dan kehinaan."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "إِنَّهُ لَقَوْلٌ فَصْلٌ “sesungguhnya Al Quran itu benar-benar firman yang memisahkan ” Pemisah yang memisahkan antara kebenaran dengan kebatilan, antara orang-orang yang bertakwa dengan orang-orang yang zalim, bahkan al-Quran adalah pemutus orang yang menentang dan memusuhinya, oleh karenanya kita dapati orang-orang muslim yang berjihad melawan orang-orang kafir dengan bimbingan al-Quran, kami dapati mereka akan mengalahkan orang-orang kafir, memutuskan kekuasaan dan menyudahi mereka, ketika mereka berpaling dari al-Quran, mereka akan dikalahkan dan dihinakan sebanding dengan kadar jauhnya mereka dengan al-Quran, samakin manusia itu jauh dengan al-Quran maka semakin jauh pula dengan kemuliaan dan pertolongan hingga mereka kembali kepada kitaabullaah ‘Azza Wa Jalla."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tariq ayat 13: 13-14. Kemudian datang jawaban atas sumpah Allah menjelaskan bahwa Al Qur’an ini ada kalamullah yang memisahkan antara kebenaran dan kebathilan. Dan Al-Qur’an (isinya) adalah kesungguh-sungguhan tidak main-main dan senda gurau; Karena ia adalah firman Rabbul Alamin sebagai Hakim atas segala sesuatu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Fashl bisa juga diartikan benar, jelas, memisahkan yang hak dan yang batil dan menyelesaikan masalah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tariq Ayat 13",
    "description": "Sungguh, al-quran yang didustakan oleh kaum kafir itu benar-benar firman yang menjadi pemisah antara perkara hak dan batil. Sulit bagi manusia untuk membedakan keduanya tanpa tuntunan Al-Qur'an. Al-qur'an menjadi salah satu bukti kasih sayang Allah karena menjadi penerang jalan hidup dan pemberi solusi bagi persoalan manusia. 14. Dan sebagai firman Allah, Al-Qur'an itu bukanlah sendagurauan. Alqur'an bukan sesuatu yang tidak bermakna, bukan pula dongeng masa lalu. Al-qur'an adalah murni rahmat tuhan yang maha pengasih bagi seluruh alam."
  }
]