[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "11-14. Demi langit yang menurunkan hujan berkali-kali, Dan bumi yang memiliki biji-bijian yang tumbuh, Sesungguhnya al-qu’an adalah perkataan yang memisahkan antara yang haq dengan yang batil, Ia tidak main main. Tidak boleh bagi makhluk bersumpah dengan selain Allah, karena itu adalah kesyirikan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Dia bukan permainan dan kebatilan, tetapi ia adalah kesungguhan dan kebenaran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13-14. Sesungguhnya, Al-quran itu memisahkan antara yang benar dan salah, Al-quran itu sendirilah yang menjadi pemisah. Al-quran tidak diturunkan dengan senda gurau dan main-main"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan Al-Qur’an itu sama sekali bukan senda gurau} bukanlah permainan dan senda gurau"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 11-14 Kemudian Allah membagi golongan selanjutnya berdasar keabsahan al-Qur’an seraya berfirman, “Demi langit yang mengandung hujan, dan bumi yang mempunyai tumbuh-tumbuhan,” yakni langit membawa hujan setiap tahunnya dan bumi mengembalikannya berupa tumbuh-tumbuhan sehingga manusia dan binatang bisa hidup dengannya. Langit juga membawa takdir dan urusan-urusan ilahi di setiap waktu sedangkan bumi menumbuhkan tumbuh-tumbuhan. “Sesungguhnya al-Qur’an itu benar-benar Firman yang memisahkan antara yang haq dan yang batil,” yaitu benar, jujur, jelas, dan terang, “dan sekali-kali bukanlah ia senda gurau,” yakni serius, bukan senda gurau. Al-Qur’an adalah Firman yang membedakan antara berbagai golongan dan berbagai perkataan, serta memutuskan berbagai sengketa."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Dan tidak ada satupun yang terkandung dalam Al-Qur'an ini bahan senda gurau ataupun candaan, melainkan seluruhnya adalah kebenaran yang tidak boleh diremehkan dan dipermainkan, tidak satupun kata-kata yang terkandung didalamnya yang merupakan kecacatan dan kekurangan, Allah ﷻ berfirman : { لَا يَأْتِيهِ الْبَاطِلُ مِنْ بَيْنِ يَدَيْهِ وَلَا مِنْ خَلْفِهِ ۖ تَنْزِيلٌ مِنْ حَكِيمٍ حَمِيدٍ } ( Yang tidak datang kepadanya (Al Quran) kebatilan baik dari depan maupun dari belakangnya, yang diturunkan dari Rabb Yang Maha Bijaksana lagi Maha Terpuji ) [ Fussilat : 42 ] , ucapan yang terkandung didalam Al-Qur'an ini tidak ada kebathilan dan aib padanya, kerena Al-Qur'an ini diturunkan dari sang Maha bijaksana lagi Maha terpuji, tidak seperti ucapan yang di tuturkan oleh manusia, maka tidak sepantasnya bagi setiap insan menyamakan AL-Qur'an ini dengan dongeng-dongen umat terdahulu, sebagimana yang dikatakan oleh kaum Musyrikin yang menganggap bahwa AL-Qur'an ini hanya sekedar dongeng orang-orang terdahulu, mereka menganggap Al-Qur'an adalah kumpulan cerita dan kisah-kisa yang tidak bermutu dan tidak kebenaran didalamnya, dan tidak pula ada manfaat bagi pembaca dan pendegarnya, sungguh celakalah mereka dengan azab yang akan mereka terima di hari kiamat."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَمَا هُوَ بِالْهَزْلِ “dan sekali-kali bukanlah dia senda gurau. ” Maknanya bahwa al-Quran bukanlah permainan, ucapan tak berguna dan sia-sia, tetapi dia adalah kebenaran. Semua kata-katanya adalah kebenaran, berita-beritanya adalah kebenaran, hukum-hukumnya adil dan membacanya memperoleh pahala. Andai saja seorang insan membacanya setiap waktunya maka ia tidak akan bosan, jika ia membacanya dengan mentadabburinya maka akan dibuka baginya pintu pemahaman terhadap makna-makna yang belum ia dapatkan sebelumnya, hal ini dapat disaksikan, bacalah dan tadabburilah al-Quran, setiap kali anda membaca dan mentadabburinya maka anda akan menperoleh makna-makna yang belum anda dapatkan sebelumnya. Semua itu dikarenakna al-Quran adalah pemisah dan bukan ucapan senda gurau. Tetapi ucapan candaan dari ucapan manusia, setiap kali anda ulangi maka anda ingin membuangnya, membencinya dan anda akan bosan, adapun kitabullah maka tidak."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tariq ayat 14: 13-14. Kemudian datang jawaban atas sumpah Allah menjelaskan bahwa Al Qur’an ini ada kalamullah yang memisahkan antara kebenaran dan kebathilan. Dan Al-Qur’an (isinya) adalah kesungguh-sungguhan tidak main-main dan senda gurau; Karena ia adalah firman Rabbul Alamin sebagai Hakim atas segala sesuatu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tariq Ayat 14",
    "description": "Dan sebagai firman Allah, Al-Qur'an itu bukanlah sendagurauan. Alqur'an bukan sesuatu yang tidak bermakna, bukan pula dongeng masa lalu. Al-qur'an adalah murni rahmat tuhan yang maha pengasih bagi seluruh alam. 15. Wahai nabi, abaikanlah penentangan kaummu yang kafir dan teruslah menyampaikan risalah tuhanmu karena aku akan menjagamu. Sungguh, mereka merencanakan tipu daya yang jahat, baik terhadap dirimu dengan merencanakan pembunuhan atasmu, terhadap Al-Qur'an dengan menganggapnya dongeng masa lalu, rapalan pesihir, dan racauan orang gila; atau terhadap islam dengan berupaya menghalangi tersebarnya agama ini."
  }
]