[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "15-17. Sesungguhnya orang orang yang mendustakan rasul dan al-qur’an menyusun rencana jahat, yang dengan tipu daya mereka itu mereka ingin menolak kebenaran dan mengukuhkan kebatilan. Aku pun punya acara untuk memenangkan kebenaran, sekalipun orang orang kafir tidak menyukainya. Jangan tergesa-gesa (wahai rasul), untuk diminta diturunkannya azab atas mereka,sebaliknya tunggulah dan berilah mereka tempo sedikit,jangan terburu buru dengan mereka,kamu akan melihat azab,hukuman,kebinasaan dan penderitaan yang menimpa mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Sesungguhnya orang-orang yang mendustakan apa yang dibawa oleh Rasul, mereka membuat tipu daya yang banyak untuk menolak dan membatalkan dakwahnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "15-17. Orang-orang yang mendustakan Allah dan risalahmu itu sedang menyusun makar, namun Allah akan menimpakan makar kepada mereka dengan makar yang lebih besar sehingga dapat membinasakan mereka. Maka bersabarlah dalam menghadapi mereka, dan tunggulah sebentar hingga azab mendatangi mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15. إِنَّهُمْ يَكِيدُونَ كَيْدًا (Sesungguhnya orang kafir itu merencanakan tipu daya yang jahat dengan sebenar-benarnya) Yakni mereka membuat tipu daya untuk menentang agama yang benar yang dibawa oleh Rasulullah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "15. Sesungguhnya orang-orang kafir itu membuat/merencanakan tipu daya untuk memerangi Islam dan Nabi SAW. Mereka juga berusaha untuk membantah atau menghapus apa yang diperintahkan Al-quran"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya mereka melakukan tipu daya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 15-17 “Sesungguhnya orang kafir itu,” yaitu orang-orang yang mendustakan Rasulullah dan al-Qur’an, “merencanakan tipu daya yang jahat dengan sebenar-benarnya,” agar dengan tipu daya mereka dapat menolak kebenaran dan menguatkan kebatilan. “Dan Aku pun membuat rencana (pula) dengan sebenar-benarnya,” untuk menampakkan kebenaran meski orang-orang kafir benci dan untuk menangkal kebatilan yang mereka bawa. Dengan demikian akan diketahui siapakah yang menang. Manusia sangatlah lemah dan hina untuk bisa mengalahkan Allah yang Mahakuat lagi Maha Mengetahui dalam rencana pembalasan terhadap tipu daya. “Karena itu beri tangguhlah orang-orang kafir itu, yaitu beri tangguhlah mereka itu barang sebentar,” yakni sementara waktu, dan mereka akan mengetahui resiko sikap mereka pada saat siksaan menimpa."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ إِنَّهُمْ } Sesungguhnya mereka orang-orang kafir { يَكِيدُونَ كَيْدًا } benar-benar merencanakan tipu daya terhadap Rasulullah ﷺ , mereka mengelabui Rasulullah ﷺ agar mampu membantah perkataannya ﷺ ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Kemudian Allah berfirman: إِنَّهُمْ يَكِيدُونَ كَيْدًا \"Sesungguhnya orang kafir itu merencanakan tipu daya yang jahat dengan sebenar-benarnya.\" mereka orang-orang kafir yag mendustakan Rasulullah shallallaahu ‘alaihi wa sallam يَكِيدُونَ كَيْدًا \"Sesungguhnya orang kafir itu merencanakan tipu daya yang jahat dengan sebenar-benarnya.\" tipu daya yang besar, mereka menipu daya Rasul shallallaahu ‘alaihi wa sallam, dan merencanakan tipu daya yang jahat kepada pengikut-pengikutnya. Lihatlah apa yang mereka lakukan kepada orang0orang mukmin pada saat berada di mekah berupa siksaan, hinaan dan pengusiran, kaum muslimin dua kali berhijrah ke Habasyah (etiopia), kemudian berhijrah ke Madinah, semua itu mereka lakukan demi malrikan diri menyelamatkan agama mereka dari orang-orang jahat itu, yang mengganggu mereka dengan segala tipu daya. Dan tipu daya terbesar mereka kepada Nabi ‘alaihissolaatu wassalaam ketika beliau hijrah, di mana pembesar-pembesar dan tokoh-tokoh mereka berkumpul bermusyawarah tentang apa yang akan mereka lakukan kepada Muhammad? Setiap kali mereka menyebutkan sebuah pendapat mereka menggugurkannya, mereka berkata: ini tidak pantas, hingga setan yang menjelma menjadi seorang laki-laki memberikan usulan sebagaimana disebutkan ahli sejara, setan itu berkata kepada mereka: Aku punya saran agar kalian memilih sepuluh pemuda dari suku yang berbeda, dan kalian mereka masing-masing sebilah pedang sehingga mereka membunuh Muhammad seperti membunuh seorang laki-laki saja, jika mereka melakukannya maka darahnya akan berpencar di berbagai suku, sehingga Bani hasyim tidak akan bisa menuntut qisas dari suku-suku itu sehingga mereka beralih kepada mengambil diyat -dan inilah yang mereka inginkan- maka mereka semua bersepakat dengan pendapat ini dan menganggapnya sebagai pendapat yang terbaik, lalu rencana ini pun diwujudkan. Sepuluh pemuda tersebut duduk menunggu Nabi shallallaahu ‘alaihi wa sallam keluar untuk membunuhnya, tetapi Nabi shallallaahu ‘alaihi wa sallam keluar dari pintu sedangkan mereka tetap duduk dan mereka tidak melihat nabi. Sejearah menyebutkan bahwa beliau menaburkan tanah ke kepada mereka sebagai penghinaan terhadap mereka dan beliau membaca firman Allah Ta’ala: وَجَعَلْنَا مِنْ بَيْنِ أَيْدِيهِمْ سَدًّا وَمِنْ خَلْفِهِمْ سَدًّا فَأَغْشَيْنَاهُمْ فَهُمْ لَا يُبْصِرُونَ “Dan Kami adakan di hadapan mereka dinding dan di belakang mereka dinding (pula), dan Kami tutup (mata) mereka sehingga mereka tidak dapat melihat. ”(QS. Yasin: 9) Jangan heran bagaimana mungkin Nabi shallallaahu ‘alaihi wa sallam keluar di tengah-tengah mereka tapi mereka tidak melihatnya, jangan heran dari kejadian ini. Lihatlah Quraisy ketika Nabi shallallaahu ‘alaihi wa sallam bersembunyi di gua ketika beliau keluar dari madinah menuju mekah, beliau bersembunyi di gua selama tiga hari, karena beliau dicari, karena Quraisy menjadikan beliau sebagai orang yang dicari, dan menjanjikan orang yang dapat menangkapnya akan mendapatkan seratus ekor unta, dan orang yang dapat menangkap beliau dan Abu Bakar dijanjikan dengan dua ratus ekor unta. Ini hadiah yang sangat besar. Merek berhenti di gua tempat Nabi shallallaahu ‘alaihi wa sallam dan Abu Bakar bersembunyi, kita semua tahu jika ada seseorang didalam gua terbuka maka akan terlihat, tetapi mereka tidak melihat Nabi shallallaahu ‘alaihi wa sallam dan Abu Bakar radhiyallaahu ‘anhu, maka Abu Bakar berkata: Wahai Rasulullah andai saja salah seorang dari mereka melihat ke kakinya maka ia akan melihat kita, maka Rasulullah shallallaahu ‘alaihi wa sallam menanggapi: : «لَا تَحْزَنْ إِنَّ اللهَ مَعَنَا، مَا ظَنُّكَ بِاثْنَيْنِ اَللهُ ثَالِثُهُمَا “Jangan bersedih, sesungguhnya Allah bersama kita, apa menurutmu dengan dua orang, Allah yang ketiganya”(1) Dengan ucapan ini, Abu Bakar radhiyallaahu ‘anhu menjadi tenang. Orang-orang yang berhenti di depan gua bukanlah yang pendengarannya kura, penglihatannya kurang, kecerdasannya kurang, tetapi Allahlah yang membutakan mereka sehingga tidak dapat melihat Nabi shallallaahu ‘alaihi wa sallam dan sahabatnya, maka jangan menganggap aneh jika Nabi keluar di tengah sepuluh orang pemuda sebagaimana disebutkan oleh para pakar sejarah, dan beliau menabur pasir ke kepala mereka lalu berkata: وَجَعَلْنَا مِنْ بَيْنِ أَيْدِيهِمْ سَدًّا وَمِنْ خَلْفِهِمْ سَدًّا فَأَغْشَيْنَاهُمْ فَهُمْ لَا يُبْصِرُونَ “Dan Kami adakan di hadapan mereka dinding dan di belakang mereka dinding (pula), dan Kami tutup (mata) mereka sehingga mereka tidak dapat melihat. ”(QS. Yasin: 9) Allah berfirman dalam surat al-Anfal: وَإِذْ يَمْكُرُ بِكَ الَّذِينَ كَفَرُوا لِيُثْبِتُوكَ أَوْ يَقْتُلُوكَ أَوْ يُخْرِجُوكَ وَيَمْكُرُونَ وَيَمْكُرُ اللَّهُ وَاللَّهُ خَيْرُ الْمَاكِرِينَ “Dan (ingatlah), ketika orang-orang kafir (Quraisy) memikirkan daya upaya terhadapmu untuk menangkap dan memenjarakanmu atau membunuhmu, atau mengusirmu. Mereka memikirkan tipu daya dan Allah menggagalkan tipu daya itu. Dan Allah sebaik-baik Pembalas tipu daya. ”(QS. Al-Anfal: 30) (1) Dikeluarkan Bukhari (3653) dan Muslim (2381) dari hadits Abu Bakar ash-Shiddiiq radhiyallaahu ‘anhu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tariq ayat 15: 15-16. Ketahuilah wahai manusia bahwa mereka orang-orang musyrik itu merencanakan untuk bisa menipu cahaya Allah, dan menyingkirkan manusia dari agama Allah dengan membangkitkan fitnah dan hasutan-hasutan, dan menyebarkan keragu-raguan serta syahwat. Akan tetapi Allah yang akan membalas makar mereka sebagaimana tipu daya mereka, dan dengan itu pula Allah tangguhkan dan ulurkan atas keinginan-keinginan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Untuk menolak kebenaran dan menguatkan kebatilan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tariq Ayat 15",
    "description": "Wahai nabi, abaikanlah penentangan kaummu yang kafir dan teruslah menyampaikan risalah tuhanmu karena aku akan menjagamu. Sungguh, mereka merencanakan tipu daya yang jahat, baik terhadap dirimu dengan merencanakan pembunuhan atasmu, terhadap Al-Qur'an dengan menganggapnya dongeng masa lalu, rapalan pesihir, dan racauan orang gila; atau terhadap islam dengan berupaya menghalangi tersebarnya agama ini. 16. Dan aku pun membuat rencana yang jitu untuk membalas tipu daya mereka. Akan aku biarkan mereka bergelimang dosa dan hidup dengan nyaman dan berkecukupan. Di akhirat nanti, aku akan azab mereka dengan siksa yang pedih."
  }
]