[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "15-17. Sesungguhnya orang orang yang mendustakan rasul dan al-qur’an menyusun rencana jahat, yang dengan tipu daya mereka itu mereka ingin menolak kebenaran dan mengukuhkan kebatilan. Aku pun punya acara untuk memenangkan kebenaran, sekalipun orang orang kafir tidak menyukainya. Jangan tergesa-gesa (wahai rasul), untuk diminta diturunkannya azab atas mereka,sebaliknya tunggulah dan berilah mereka tempo sedikit,jangan terburu buru dengan mereka,kamu akan melihat azab,hukuman,kebinasaan dan penderitaan yang menimpa mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Dan Aku membuat rencana untuk memenangkan agama ini dan menghancurkan kebatilan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "16. وَأَكِيدُ كَيْدًا (Dan Akupun membuat rencana (pula) dengan sebenar-benarnya) Yakni Aku menyiksa mereka perlahan-lahan tanpa mereka rasakan, dan Aku akan membalas tipu daya mereka dengan tipu daya yang lebih kuat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16. Kemudian Aku (Allah) membalas tipu daya mereka dengan tipu daya yang lebih dahsyat dari usaha pembantahan mereka. Kemudian Allah membalas mereka dengan balasan yang sesuai dengan perbuatan mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Aku pun membalasnya dengan tipu daya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 15-17 “Sesungguhnya orang kafir itu,” yaitu orang-orang yang mendustakan Rasulullah dan al-Qur’an, “merencanakan tipu daya yang jahat dengan sebenar-benarnya,” agar dengan tipu daya mereka dapat menolak kebenaran dan menguatkan kebatilan. “Dan Aku pun membuat rencana (pula) dengan sebenar-benarnya,” untuk menampakkan kebenaran meski orang-orang kafir benci dan untuk menangkal kebatilan yang mereka bawa. Dengan demikian akan diketahui siapakah yang menang. Manusia sangatlah lemah dan hina untuk bisa mengalahkan Allah yang Mahakuat lagi Maha Mengetahui dalam rencana pembalasan terhadap tipu daya. “Karena itu beri tangguhlah orang-orang kafir itu, yaitu beri tangguhlah mereka itu barang sebentar,” yakni sementara waktu, dan mereka akan mengetahui resiko sikap mereka pada saat siksaan menimpa."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Biarkanlah mereka mengerjakan tipu daya itu, karena sesungguhnya Allah ﷻ akan berbuat lebih dari tipu daya yang mereka lakukan, Allah ﷻ akan berbuat serupa kepada orang-orang yang zholim atas kezholiman yang mereka perbuat. Mereka berencana melakukan tipu daya itu, tapi mereka lemah dan tidak mampu melakukan rencana buruk itu, akan tetapi bagi Allah ﷻ hal itu sangatlah mudah untuk diwujudkan, orang-orang musyrik merencanakan suatu keburukan yang akan mereka timpakan atas kaum muslmin dan Rasulullah ﷺ , akan tetapi rencana tersebut diketahui oleh Allah ﷻ , maka Allah ﷻ pun akan berbuat serupa kepada mereka sebagai balasan ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Lihat tafsir ayat berikutnya"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tariq ayat 16: 15-16. Ketahuilah wahai manusia bahwa mereka orang-orang musyrik itu merencanakan untuk bisa menipu cahaya Allah, dan menyingkirkan manusia dari agama Allah dengan membangkitkan fitnah dan hasutan-hasutan, dan menyebarkan keragu-raguan serta syahwat. Akan tetapi Allah yang akan membalas makar mereka sebagaimana tipu daya mereka, dan dengan itu pula Allah tangguhkan dan ulurkan atas keinginan-keinginan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Untuk menguatkan kebenaran dan menolak kebatilan yang mereka hadapkan meskipun orang-orang kafir membenci."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tariq Ayat 16",
    "description": "Dan aku pun membuat rencana yang jitu untuk membalas tipu daya mereka. Akan aku biarkan mereka bergelimang dosa dan hidup dengan nyaman dan berkecukupan. Di akhirat nanti, aku akan azab mereka dengan siksa yang pedih. 17. Wahai nabi, Allah telah berjanji demikian. Karena itu berilah penangguhan kepada orang-orang kafir itu. Berilah mereka itu kesempatan untuk sementara waktu dan jangan engkau terburu-buru meminta Allah membinasakan mereka. Biarkan mereka hidup di dunia ini beberapa tahun lagi bersama keingkaran mereka. Di akhirat nanti mereka akan menghadap tuhan dalam keadaan hina dan dimurkai."
  }
]