[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "15-17. Sesungguhnya orang orang yang mendustakan rasul dan al-qur’an menyusun rencana jahat, yang dengan tipu daya mereka itu mereka ingin menolak kebenaran dan mengukuhkan kebatilan. Aku pun punya acara untuk memenangkan kebenaran, sekalipun orang orang kafir tidak menyukainya. Jangan tergesa-gesa (wahai rasul), untuk diminta diturunkannya azab atas mereka,sebaliknya tunggulah dan berilah mereka tempo sedikit,jangan terburu buru dengan mereka,kamu akan melihat azab,hukuman,kebinasaan dan penderitaan yang menimpa mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Maka berilah tangguh -wahai Rasul- kepada orang-orang yang mendustakan tersebut, berilah tangguh sedikit dan jangan cepat-cepat memohon ditimpakan siksa dan kehancuran atas mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "17. أَمْهِلْهُمْ (beri tangguhlah mereka) Yakni menunda azab mereka. رُوَيْدًۢا (sebentar) Yakni biarkanlah mereka sebentar saja."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17. Maka dari itu, tahan dulu wahai Nabi, berilah penangguhan untuk menghancurkan mereka. Jangan tergesa-gesa, tunggulah sebentar"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka tangguhkanlah} tunggulah {orang-orang kafir itu. Biarkanlah mereka sejenak} sebentar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 15-17 “Sesungguhnya orang kafir itu,” yaitu orang-orang yang mendustakan Rasulullah dan al-Qur’an, “merencanakan tipu daya yang jahat dengan sebenar-benarnya,” agar dengan tipu daya mereka dapat menolak kebenaran dan menguatkan kebatilan. “Dan Aku pun membuat rencana (pula) dengan sebenar-benarnya,” untuk menampakkan kebenaran meski orang-orang kafir benci dan untuk menangkal kebatilan yang mereka bawa. Dengan demikian akan diketahui siapakah yang menang. Manusia sangatlah lemah dan hina untuk bisa mengalahkan Allah yang Mahakuat lagi Maha Mengetahui dalam rencana pembalasan terhadap tipu daya. “Karena itu beri tangguhlah orang-orang kafir itu, yaitu beri tangguhlah mereka itu barang sebentar,” yakni sementara waktu, dan mereka akan mengetahui resiko sikap mereka pada saat siksaan menimpa."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ فَمَهِّلِ الْكَافِرِينَ } Beri tangguhlah wahai Rasul kepada kaum kuffar itu, janganlah kamu tergesa-gesa untuk memohonkan azab bagi mereka, biarkanlah mereka terlebih dahulu melakukan apapun yang mereka kehendaki, dan jangan pula kalian menyangka wahai mukminin bahwasanya orang-orang kafir dan musyrikin tidak tertimpa musibah dan azab, biarkan mereka melakukan segala sesuatu yang mereka inginkan dan sesungguhnya mereka itu tidak pernah diabaikan, mereka terus berada dalam pengawasan tuhannya, dan sekali-kali mereka tidk akan pernah selamat dari siksaan dan azab tuhan semesta alam, walaupun azab itu tekadang di akhirkan karena ada hikmah yang Allah ﷻ berfirman : { وَأُمْلِي لَهُمْ ۚ إِنَّ كَيْدِي مَتِينٌ } ( Dan Aku memberi tangguh kepada mereka. Sesungguhnya rencana-Ku amat teguh ) [ Al-A'raf : 183 ] , Allah juga mengatakan : { فَذَرْنِي وَمَنْ يُكَذِّبُ بِهَٰذَا الْحَدِيثِ ۖ سَنَسْتَدْرِجُهُمْ مِنْ حَيْثُ لَا يَعْلَمُونَ , وَأُمْلِي لَهُمْ ۚ إِنَّ كَيْدِي مَتِينٌ } ( Maka serahkanlah (ya Muhammad) kepada-Ku (urusan) orang-orang yang mendustakan perkataan ini (Al Quran). Nanti Kami akan menarik mereka dengan berangsur-angsur (ke arah kebinasaan) dari arah yang tidak mereka ketahui , Dan Aku memberi tangguh kepada mereka. Sesungguhnya rencana-Ku amat tangguh ) [ Al-Qalam : 44 - 45 ] , tinggal mereka melakukan sesuka hati mereka, Allah ﷻ berfirman : { أَمْ حَسِبَ الَّذِينَ يَعْمَلُونَ السَّيِّئَاتِ أَنْ يَسْبِقُونَا ۚ سَاءَ مَا يَحْكُمُونَ } ( Ataukah orang-orang yang mengerjakan kejahatan itu mengira bahwa mereka akan luput (dari azab) Kami? Amatlah buruk apa yang mereka tetapkan itu ) [ Al-Ankabut : 4 ] , dan janganlah kamu terkejut dikarenakn azab mereka belum kunjung tiba, kerena sesungguhnya Allah ﷻ telah menyiapkan bagi mereka azab yang lebih pedih, Allah ﷻ berfirman : { وَلَا يَحْسَبَنَّ الَّذِينَ كَفَرُوا أَنَّمَا نُمْلِي لَهُمْ خَيْرٌ لِأَنْفُسِهِمْ ۚ إِنَّمَا نُمْلِي لَهُمْ لِيَزْدَادُوا إِثْمًا ۚ وَلَهُمْ عَذَابٌ مُهِينٌ } ( Dan janganlah sekali-kali orang-orang kafir menyangka, bahwa pemberian tangguh Kami kepada mereka adalah lebih baik bagi mereka. Sesungguhnya Kami memberi tangguh kepada mereka hanyalah supaya bertambah-tambah dosa mereka; dan bagi mereka azab yang menghinakan ) [ Ali Imran : 178 ] , dan setiap bertambah kemaksiatan yang mereka perbuat, maka azab yang dipersiapkan bagi mereka akan bertambah pula. Kemudia Allah ﷻ memberikan penekanan atau penjelasan pada penangguhan itu dengan berkata : { أَمْهِلْهُمْ رُوَيْدًا } yakni berikanlah kepada orang-orang kafir dan musyrikin penanggunghan dalam jangka waktu yang sebentar saja, dan jangan biarkan mereka dengan waktu yang panjang, maka mereka akan tertimpa dengan apa yang telah kami ancamkan kepada mereka, dan mereka pun akan menerima balasan di dunia dan di akhirat atas ulah yang telah mereka perbuat, tipu daya yang mereka perbuat tidak akan hilang dari pengawasan, kejahatan mereka itu tidak akan dilupakan, semuanya dalam pengawasan dan perhitungan dan mereka pasti akan menerima balasan dari itu semua."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "إِنَّهُمْ يَكِيدُونَ كَيْدًا (15) وَأَكِيدُ كَيْدًا \"Sesungguhnya orang kafir itu merencanakan tipu daya yang jahat dengan sebenar-benarnya.Dan Akupun membuat rencana (pula) dengan sebenar-benarnya.\" Kemudian Allah ‘Azza Wa Jalla berfirman: فَمَهِّلِ الْكَافِرِينَ أَمْهِلْهُمْ رُوَيْدًا “Karena itu beri tangguhlah orang-orang kafir itu yaitu beri tangguhlah mereka itu barang sebentar.” مَهِّلِ dan أَمْهِلْ keduanya bermakna sama. Yakni: Tunggulah sejenak dan jangan menunggu lama, رُوَيْدًا maknanya: sedikit, kata ini adalah bentuk tashghir dari kata ruud atau irwaad, maksudnya adalah sesuatu yang sedikit. Ayat ini mengandung ancaman bagi Quraisy dan hiburan bagi Nabi shallallaahu ‘alaihi wa sallam, dan janji kemenangan untuknya, hingga akhirnya sebagaimana Allah ‘Azza Wa Jalla memberitakan, Nabi shallallaahu ‘alaihi wa sallam keluar berhijrah meninggalkan mereka, dan terjadi peperangan di antara mereka, pada tahun kedua hijriyah terbunuh pembesarpembesar dan tokoh-tokoh mereka sekitar 24 orang. Di antaranya adalah panglima mereka, Abu Jahal, setelah delapan tahun kemudian atau bahkan tidak sampai delapan tahun, Nabi shallallaahu ‘alaihi wa sallam memasuki mekah, dengan menaklukan lagi dimenangkan, sampai sampai beliau mengatakan sebagaimana tertulis dalam sejarah, sambil memegang ujung pintu ka’bah sedangkan Quraisy di bawahnya, beliau berkata kepada mereka: مَا تَرَوْنَ أَنِّي فَاعِلٌ بِكُمْ “menurut kalian apa yang akan aku lakukan terhadap kalian?” kerena perkara mereka sudaj di tangan Nabi shallallaahu ‘alaihi wasllam. Beliau berkata مَا تَرَوْنَ أَنِّي فَاعِلٌ بِكُمْ“menurut kalian apa yang akan aku lakukan terhadap kalian?” mereka mengatakan: Engkau adalah saudara yang mulia dan anak saudara yang mulia. Maka beliau bersabda: إِنِّي أَقُوْلُ لَكُمْ كَمَا قَالَ يُوْسُفُ لِأِخْوَتِهِ “Aku katakan kepada kalian sebagaimana Yusuf mengatakan kepada saudara-saudaranya : لَا تَثْرِيبَ عَلَيْكُمُ الْيَوْمَ يَغْفِرُ اللَّهُ لَكُمْ وَهُوَ أَرْحَمُ الرَّاحِمِينَ “Pada hari ini tak ada cercaan terhadap kamu, mudah-mudahan Allah mengampuni (kamu), dan Dia adalah Maha Penyayang diantara para penyayang ” (QS. Yusuf: 92) اِذْهَبُوا فَأَنْتُمْ الطُّلَقَاءُ \"Pergilah, sesungghnya kalian bebas”(1) Sesungguhnya Allah memberikan karunia ini kepada mereka karena mereka masuk islam, Allah Ta’ala berfirman: قُلْ لِلَّذِينَ كَفَرُوا إِنْ يَنْتَهُوا يُغْفَرْ لَهُمْ مَا قَدْ سَلَفَ وَإِنْ يَعُودُوا فَقَدْ مَضَتْ سُنَّتُ الْأَوَّلِينَ “Katakanlah kepada orang-orang yang kafir itu: \"Jika mereka berhenti (dari kekafirannya), niscaya Allah akan mengampuni mereka tentang dosa-dosa mereka yang sudah lalu; dan jika mereka kembali lagi sesungguhnya akan berlaku (kepada mereka) sunnah (Allah tenhadap) orang-orang dahulu\". ”(QS. Al-Anfal: 38) Kita memohon kepada Allah agar menjadikan kita termasuk orang yang membaca kitabullah dengan sebanarnya bacaan dan menjadikannya bermanfaat bagi kita dan menjadikannya sebagai pemberi syafaat bagi kita dihari kiamat, sesungguhnya Dia maha kuasa atas segala sesuatu. (1) Dikeluarkan Ath-Thabari dalam tarikhnya (2/161) dinyatakan dhaif olej al-Albani dalam adh-Dha’ifah (1163)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tariq ayat 17: Allah perintahkan Nabi-Nya untuk meminta kepada Rabbnya agar menjadikan hukuman dan kebinasaan bagi mereka para pendusta; Akan tetapi Allah beri ulur kepada mereka, dan mereka sebentar lagi akan melihat akibat perbuatan mereka. Hal ini sebagai hiburan bagi Nabi ﷺ akan kedekatan kemenangan dan pertolongan bagi orang-orang beriman dan sebagai kabar gembira dengan dekatnya kebinasaan orang-orang kafir."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kelak mereka akan mengetahui akibat sikap mereka ketika azab turun menimpa mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tariq Ayat 17",
    "description": "Wahai nabi, Allah telah berjanji demikian. Karena itu berilah penangguhan kepada orang-orang kafir itu. Berilah mereka itu kesempatan untuk sementara waktu dan jangan engkau terburu-buru meminta Allah membinasakan mereka. Biarkan mereka hidup di dunia ini beberapa tahun lagi bersama keingkaran mereka. Di akhirat nanti mereka akan menghadap tuhan dalam keadaan hina dan dimurkai. 1. Wahai nabi, sucikanlah nama tuhanmu yang mahatinggi dari hal-hal yang tidak layak bagi kemuliaan-Nya."
  }
]