[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-4. Allah bersumpah dengan langit dan bintang yang datang di malam hari, Tahukah kamu besarnya bintang itu? Ia adalah bintang yang bersinar terang, Tidak ada satu jiwapun kecuali ditugaskan untuknya seorang malaikat pengawas yang menjaga amal amalnya, agar amal amalnya itu dihisab pada hari kiamat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Tahukah kamu -wahai Rasul- kondisi bintang yang agung ini?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2-3. Wahai Nabi SAW, apakah engkau tahu apa itu Ath thariq? Pertanyaan dimaksudkan untuk menunjukkan keistimewaan/keagungan Ath thariq. Yaitu, bintang yang berkilau/bersinar terang dan tajam dalam kegelapan malam"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{apakah kamu tahu} apakah kamu tahu {apa yang datang pada malam hari"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 1-4 Allah berfirman, “Demi langit dan yang datang pada malam hari,” kemudian yang datang di malam hari dijelaskan dengan FirmanNya, “(Yaitu) bintang yang cahayanya menembus,” yakni yang bercahaya yang cahayanya menembus dan membakar langit hingga tembus dan terlihat dari bumi. Yang benar, bintang yang cahayanya menembus adalah kata umum yang mencakup seluruh bintang yang cahayanya menembus. Ada yang menafsirkannya dengan bintang saturnus yang memecah ketujuh langit dan menembusnya hingga dapat terlihat darinya. Disebut ath-Thariq karena bintang tersebut datang di waktu malam. Obyek sumpahnya adalah Firman Allah, “Tidak ada suatu jiwa pun (diri) melainkan ada penjaganya,” yang menjaga amal perbuatannya, baik dan buruknya, dan amal yang dijaganya akan dibalas."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Tahukah kamu apa itu ( الطارق ) ? , Makna asal dari ( الطارق ) adalah : seseorang datang dimalam hari, dan Rasulullah ﷺ melarang seorang laki-laki mendekati istrinya jika ia kembali kerumahnya pada malam hari tanpa sepegatahuannya, oleh karena itu Rasulullah ﷺ meminta perlindungan kepada Tuhannya dari kejahatan \"At Thariq\" , intinya adalah makna dari ( الطارق ) : yang datang dimalam hari."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Telah dibahas pada ayat 1"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tariq ayat 2: 1-4. Allah memulai surat ini dengan bersumpah dengan langit yang memiliki bintang-bintang bercahaya. Dan Ia bersumpah dengan sesuatu yang datang pada malam hari. Kemudian Allah memberi pertanyaan yang membangkitkan minat keingin tahuan dengan berkata : Apakah engkau tahu wahai Nabi Allah, dengan sesuatu yang datang pada malam hari ini ? Lalu Allah jelaskan bahwa ia adalah bintang yang bersinar dimana cahayanya menembus kegelapan malam, memberi petunjuk kepada siapa yang berjalan di malam hari dan menyembunyikan siang. Kemudian datang penjelasan jawaban bagi sumpah Allah, bahwa setiap jiwa ada penjaganya dari kalangan para malaikat, yang senantiasa menjaga dan mencatat atas apa yang nampak oleh malaikat dari kebaikan dan keburukan (manusia)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kalimat ini untuk memperbesar perkaranya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tariq Ayat 2",
    "description": "Dan wahai nabi, tahukah kamu apakah yang datang pada malam hari itu'3. Itulah bintang yang bersinar tajam dan cahayanya menembus kegelapan malam. Malam bagaikan tirai yang menyelubungi langit. Cahaya bintang menyeruak, menembus tirai itu sehingga tampak gemerlap."
  }
]