[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-4. Allah bersumpah dengan langit dan bintang yang datang di malam hari, Tahukah kamu besarnya bintang itu? Ia adalah bintang yang bersinar terang, Tidak ada satu jiwapun kecuali ditugaskan untuknya seorang malaikat pengawas yang menjaga amal amalnya, agar amal amalnya itu dihisab pada hari kiamat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Yaitu bintang yang cahayanya menembus langit dengan kuat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. النَّجْمُ الثَّاقِبُ ((yaitu) bintang yang cahayanya menembus) Yakni cahayanya sangat terang seakan-akan menembus kegelapan malam."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2-3. Wahai Nabi SAW, apakah engkau tahu apa itu Ath thariq? Pertanyaan dimaksudkan untuk menunjukkan keistimewaan/keagungan Ath thariq. Yaitu, bintang yang berkilau/bersinar terang dan tajam dalam kegelapan malam"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "(yaitu) bintang yang bersinar tajam} yang bersinar menyala"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 1-4 Allah berfirman, “Demi langit dan yang datang pada malam hari,” kemudian yang datang di malam hari dijelaskan dengan FirmanNya, “(Yaitu) bintang yang cahayanya menembus,” yakni yang bercahaya yang cahayanya menembus dan membakar langit hingga tembus dan terlihat dari bumi. Yang benar, bintang yang cahayanya menembus adalah kata umum yang mencakup seluruh bintang yang cahayanya menembus. Ada yang menafsirkannya dengan bintang saturnus yang memecah ketujuh langit dan menembusnya hingga dapat terlihat darinya. Disebut ath-Thariq karena bintang tersebut datang di waktu malam. Obyek sumpahnya adalah Firman Allah, “Tidak ada suatu jiwa pun (diri) melainkan ada penjaganya,” yang menjaga amal perbuatannya, baik dan buruknya, dan amal yang dijaganya akan dibalas."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "At Thariq yang dimaksud dalam surah ini adalah : { النَّجْمُ الثَّاقِبُ } yaitu bintang yang cahayanya menembus, disebut At Thariq karena bintang terlihat jelas pada malam hari, padanya terdapat keajaiban-kejaiban, sebagai hiasan untuk langit, juga sebagai batu untuk melempar syaithon-syaithon yang hendak mencuri wahyu, juga sebagai tanda atau penunjuk jalan bagi musafir pada malam hari, banyak manfaat yang dapat diambil dari bintang oleh manusia. Dan bintang ini disebut ( الثاقب ) karena cahayanya yang menembus kegelapan pada malam hari, juga sebagai pelempar jin dan syaithon yang dengan bintang-bintang itu tubuh-tubuh mereka terbakar, sehingga mereka pun terlempar dan terusir dari langit karena hendak mencuri wahyu dengan pendengaran mereka, Allah berfirman : { وَأَنَّا لَمَسْنَا السَّمَاءَ فَوَجَدْنَاهَا مُلِئَتْ حَرَسًا شَدِيدًا وَشُهُبًا , وَأَنَّا كُنَّا نَقْعُدُ مِنْهَا مَقَاعِدَ لِلسَّمْعِ ۖ فَمَنْ يَسْتَمِعِ الْآنَ يَجِدْ لَهُ شِهَابًا رَصَدًا } ( Dan sesungguhnya kami telah mencoba mengetahui (rahasia) langit, maka kami mendapatinya penuh dengan penjagaan yang kuat dan panah-panah api , Dan sesungguhnya kami dahulu dapat menduduki beberapa tempat di langit itu untuk mendengar-dengarkan (berita-beritanya). Tetapi sekarang barangsiapa yang (mencoba) mendengar-dengarkan (seperti itu) tentu akan menjumpai panah api yang mengintai (untuk membakarnya). ) [ Al Jin : 8-9 ] . Sebagai kesimpulan, ( الثاقب ) adalah : sesuatu yang menembus kegelapan denga sinarnya, dan : sesuatu yang menghantam syaithon, yakni dengan membakarnya, semua itu adalah ayat-ayat Allah ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Telah dibahas pada ayat 1"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tariq ayat 3: 1-4. Allah memulai surat ini dengan bersumpah dengan langit yang memiliki bintang-bintang bercahaya. Dan Ia bersumpah dengan sesuatu yang datang pada malam hari. Kemudian Allah memberi pertanyaan yang membangkitkan minat keingin tahuan dengan berkata : Apakah engkau tahu wahai Nabi Allah, dengan sesuatu yang datang pada malam hari ini ? Lalu Allah jelaskan bahwa ia adalah bintang yang bersinar dimana cahayanya menembus kegelapan malam, memberi petunjuk kepada siapa yang berjalan di malam hari dan menyembunyikan siang. Kemudian datang penjelasan jawaban bagi sumpah Allah, bahwa setiap jiwa ada penjaganya dari kalangan para malaikat, yang senantiasa menjaga dan mencatat atas apa yang nampak oleh malaikat dari kebaikan dan keburukan (manusia)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni menembus langit-langit sehingga terlihat di bumi. Bintang di sini adalah bintang Tsurayya (Kartika) atau semua bintang. Ada pula yang berpendapat, bahwa bintang tersebut adalah Zuhal (Saturnus). Bintang disebut Thaariq karena ia muncul di malam hari. Isi sumpahnya adalah firman-Nya, “Setiap orang pasti ada penjaganya.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tariq Ayat 3",
    "description": "Itulah bintang yang bersinar tajam dan cahayanya menembus kegelapan malam. Malam bagaikan tirai yang menyelubungi langit. Cahaya bintang menyeruak, menembus tirai itu sehingga tampak gemerlap. 4. Demi itu semua, setiap orang pasti ada malaikat yang ditugasi oleh Allah sebagai penjaganya. Malaikat itu mencatat apa saja yang dilakukan oleh setiap individu, baik itu kebaikan maupun keburukan. Catatan itu akan menjadi bukti pada hari perhitungan kelak."
  }
]