[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-4. Allah bersumpah dengan langit dan bintang yang datang di malam hari, Tahukah kamu besarnya bintang itu? Ia adalah bintang yang bersinar terang, Tidak ada satu jiwapun kecuali ditugaskan untuknya seorang malaikat pengawas yang menjaga amal amalnya, agar amal amalnya itu dihisab pada hari kiamat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Tidak ada seorang pun melainkan Allah menugaskan Malaikat untuk mencatat amal perbuatannya guna perhitungan nanti pada hari Kiamat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. إِن كُلُّ نَفْسٍ لَّمَّا عَلَيْهَا حَافِظٌ (tidak ada suatu jiwapun (diri) melainkan ada penjaganya) Ini merupakan isi dari sumpah Allah tersebut; yakni tidak ada satu orangpun melainkan memiliki pengawas dari golongan malaikat, mereka mengawasi manusia dalam perkataan dan perbuatannya dan menghitung segala perbuatan baik atau buruk yang dilakukannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Segala sesuatu pasti ada penjaga dari Tuhannya. Sebagai pengganti atau wakil untuk menjaganya, dan mengawasi segala perbuatannya. Penjaga itu adalah para malaikat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Tidaklah setiap jiwa melainkan} tidaklah setiap jiwa melainkan {ada penjaganya} malaikat yang mengawasi amal ibadahnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 1-4 Allah berfirman, “Demi langit dan yang datang pada malam hari,” kemudian yang datang di malam hari dijelaskan dengan FirmanNya, “(Yaitu) bintang yang cahayanya menembus,” yakni yang bercahaya yang cahayanya menembus dan membakar langit hingga tembus dan terlihat dari bumi. Yang benar, bintang yang cahayanya menembus adalah kata umum yang mencakup seluruh bintang yang cahayanya menembus. Ada yang menafsirkannya dengan bintang saturnus yang memecah ketujuh langit dan menembusnya hingga dapat terlihat darinya. Disebut ath-Thariq karena bintang tersebut datang di waktu malam. Obyek sumpahnya adalah Firman Allah, “Tidak ada suatu jiwa pun (diri) melainkan ada penjaganya,” yang menjaga amal perbuatannya, baik dan buruknya, dan amal yang dijaganya akan dibalas."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ إِنْ كُلُّ نَفْسٍ } TIdak ada satu jiwapun { لَمَّا عَلَيْهَا حَافِظٌ } melainkan ada penjaganya dari Malaikat. Dikatakan dalam sebuaah riwayat : Yaitu penjaga yang menjaganya dari segala keburukan, setiap manusia ada Malaikat yang menjaganya dari keburukan yang dapat menimpanya, Allah berfirman : { لَهُ مُعَقِّبَاتٌ مِنْ بَيْنِ يَدَيْهِ وَمِنْ خَلْفِهِ يَحْفَظُونَهُ مِنْ أَمْرِ اللَّهِ ۗ} ( Bagi manusia ada malaikat-malaikat yang selalu mengikutinya bergiliran, di muka dan di belakangnya, mereka menjaganya atas perintah Allah ) [ Ar Ra'd : 11 ] , juga ada Malaikat yang mengawasi mereka disetiap langkah dalam melakukan sesuatu, Malaikat itulah yang akan mencatat amalan mereka baik maupun buruknya, Malaikat-malaikat itulah yang menjaga diri setiap hamba dan menjadi pengawas mereka juga disetiap amalan yang mereka perbuat. Maka sesungguhnya manusia itu sekali-kali tidak akan pernah terabaikan dalam melakukan sesuatu apapun, karena setiap mereka akan mempertanggung jawabkan seluruh perbuatan yang diperbuat oleh diri mereka sendiri, berbeda dengan makhluk lain seperti hewan yang mereka bebas melakukan apapun yang terbenak dalam fikiran mereka tanpa adanya pengawasan dan tanggung jawab atas perbuatan itu, Allah ﷻ menugaskan beberapa Malaikat untuk menjaga hamba-Nya dan melindunginya dari terpaa musibah dan ulah jahat musuh, dan Malaikat yang mengawasi hamba itu dalam melakukan amalan apapun, tapi jika Allah ﷻ menghendaki pada hamba-Nya itu suatu musibah maka Malaikat penjaga akan membebaskan dirinya dari penjagaan dengan perintah Allah ﷻ pula."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Kemudian Allah menjelaskan yang disumpahi dengan firman-Nya: إِنْ كُلُّ نَفْسٍ لَمَّا عَلَيْهَا حَافِظٌ “tidak ada suatu jiwapun (diri) melainkan ada penjaganya. ” Di sini terdapat peniadaan, yakni: Tidak ada satu jiwa pun, dan لَمَّا [Lamma] bermakna Illa “Kecuali” yakni: tidak ada satu jiwa pun kecuali ada penjaganya dari Allah, Allah subhaanahu wa Ta’ala menjelaskan pentingnya penjaga tersebut dengan firman-Nya: وَإِنَّ عَلَيْكُمْ لَحَافِظِينَ (10) كِرَامًا كَاتِبِينَ (11) يَعْلَمُونَ مَا تَفْعَلُونَ “Padahal sesungguhnya bagi kamu ada (malaikat-malaikat) yang mengawasi (pekerjaanmu),yang mulia (di sisi Allah) dan mencatat (pekerjaan-pekerjaanmu itu),mereka mengetahui apa yang kamu kerjakan.” (QS. Al-Infithar: 10-12) Malaikat-malaikat penjaga tersebut mengawasi perbuatan manusia, apa yang menjadi pahala dan apa yang menjadi dosa baginya, dan ia akan mendapatinya kelak di hari kiamat sebagai kitab yang terbuka, akan dikatakan kepadanya: اقْرَأْ كِتَابَكَ كَفَى بِنَفْسِكَ الْيَوْمَ عَلَيْكَ حَسِيبًا “ Bacalah kitabmu, cukuplah dirimu sendiri pada waktu ini sebagai penghisab terhadapmu ”(QS. Al-Isra: 14) Mereka para malaikat penjaga menulis apa-apa yang diperbuat manusia berupa ucapan dan juga pekerjaan baik itu dilakukan secara terang-terangan seperti ucapan lisan dan perbuatan anggota badan, atau yang tidak nampak hingga apa-apa yang ada dalam hatinya berupa keyakinan manusia maka sungguh itu akan ditulis di dalamnya sebagaimana Allah Ta’ala berfirman: وَلَقَدْ خَلَقْنَا الْإِنْسَانَ وَنَعْلَمُ مَا تُوَسْوِسُ بِهِ نَفْسُهُ وَنَحْنُ أَقْرَبُ إِلَيْهِ مِنْ حَبْلِ الْوَرِيدِ (16) إِذْ يَتَلَقَّى الْمُتَلَقِّيَانِ عَنِ الْيَمِينِ وَعَنِ الشِّمَالِ قَعِيدٌ (17) مَا يَلْفِظُ مِنْ قَوْلٍ إِلَّا لَدَيْهِ رَقِيبٌ عَتِيدٌ “Dan sesungguhnya Kami telah menciptakan manusia dan mengetahui apa yang dibisikkan oleh hatinya, dan Kami lebih dekat kepadanya daripada urat lehernya, (yaitu) ketika dua orang malaikat mencatat amal perbuatannya, seorang duduk di sebelah kanan dan yang lain duduk di sebelah kiri. Tiada suatu ucapanpun yang diucapkannya melainkan ada di dekatnya malaikat pengawas yang selalu hadir. ”(QS. Qaf: 16-18) Malaikat penjaga tersebut senantiasa menjaga perbuatan anak-anak adam, di lain tempat pun ada malaikat-malaikat penjaga lainnya, yang Allah sebutkan dalam firma-Nya: لَهُ مُعَقِّبَاتٌ مِنْ بَيْنِ يَدَيْهِ وَمِنْ خَلْفِهِ يَحْفَظُونَهُ مِنْ أَمْرِ اللَّهِ “Bagi manusia ada malaikat-malaikat yang selalu mengikutinya bergiliran, di muka dan di belakangnya, mereka menjaganya atas perintah Allah. ” (QS. Ar-Ra’d: 11)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tariq ayat 4: 1-4. Allah memulai surat ini dengan bersumpah dengan langit yang memiliki bintang-bintang bercahaya. Dan Ia bersumpah dengan sesuatu yang datang pada malam hari. Kemudian Allah memberi pertanyaan yang membangkitkan minat keingin tahuan dengan berkata : Apakah engkau tahu wahai Nabi Allah, dengan sesuatu yang datang pada malam hari ini ? Lalu Allah jelaskan bahwa ia adalah bintang yang bersinar dimana cahayanya menembus kegelapan malam, memberi petunjuk kepada siapa yang berjalan di malam hari dan menyembunyikan siang. Kemudian datang penjelasan jawaban bagi sumpah Allah, bahwa setiap jiwa ada penjaganya dari kalangan para malaikat, yang senantiasa menjaga dan mencatat atas apa yang nampak oleh malaikat dari kebaikan dan keburukan (manusia)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni yang menjaga amalnya yang baik dan yang buruk yaitu malaikat, untuk kemudian diberikan balasan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tariq Ayat 4",
    "description": "Demi itu semua, setiap orang pasti ada malaikat yang ditugasi oleh Allah sebagai penjaganya. Malaikat itu mencatat apa saja yang dilakukan oleh setiap individu, baik itu kebaikan maupun keburukan. Catatan itu akan menjadi bukti pada hari perhitungan kelak. 5. Sungguh, hari kebangkitan itu pasti akan terjadi. Maka, hendaklah manusia memperhatikan asal kejadiannya; dari apa dia diciptakan. Dengan demikian, dia akan mengetahui besarnya kekuasan Allah dan keterbatasan dirinya."
  }
]