[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "5-8. Hendaknya orang yang mengingkari kebangkitan kembali itu memperhatikan dari apa dia diciptakan, agar dia mengetahui bahwa pengembalian penciptaan manusia tidaklah lebih sulit daripada penciptaannya pertama kali. Manusia diciptakan dari sperma yang memancar dengan cepat ke Rahim, Yang keluar dari tulang sulbi laki-laki dan dada wanita. Sesungguhnya Allah yang menciptakan manusia dari air ini, benar-benar kuasa untuk menghidupkannya kembali sesudah kematian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Maka hendaknya manusia merenungkan dari apa Allah menciptakannya agar jelas baginya kekuasaan Allah dan jelas pula kelemahan dirinya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "5-10. Hendaklah orang yang mendustakan hari kebangkitan itu menghayati, dari bahan apa dia diciptakan? Dia diciptakan dari air mani yang disemburkan ke dalam rahim yang keluar dari tulang belakang pria dan dari tulang rusuk wanita. Sungguh Allah Maha Kuasa untuk menghidupkan kembali manusia setelah kematiannya, dan itu akan terjadi pada hari ketika rahasia-rahasia manusia akan diungkap, maka manusia tidak memiliki kemampuan untuk membela diri atau makhluk lain yang membantunya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Maka hendaknya, manusia itu memperhatikan dan mengambil pelajaran terhadap apa yang telah Allah ciptakan. Diriwayatkan dari Ibnu Abu Hatim dari ‘Akrimah tentang ayat ini. Berkata: Aku sedang berkunjung ke Abu Al asyad bin Kaladatil Jumha. Saat itu dia berdiri di atas kulit. Dia berkata: Wahai kaum Quraisy, berang siapa menghilangkanku maka baginya adalah begini dan begitu. Dia juga berkata: Bahwa sesungguhnya Muhammad itu mengira kalau isi neraka Jahannam ada 19 (siksaan). Maka yang 10 akan aku ambil semua, kalian cukup yang 9 sisanya saja.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Hendaklah manusia memperhatikan dari apa dia diciptakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 5-7 “Maka hendaklah manusia memperhatikan dari apakah dia diciptakan?” Yakni, hendaklah manusia merenungkan penciptaan dan permulaannya, dia adalah makhluk (yang tercipta) “dari air yang terpancar,” yaitu air mani yang “keluar di antara tulang sulbi laki-laki dan tulang dada perempuan.” Kemungkinan yang dimaksud adalah tulang belakang lelaki dan tulang dada perempuan dan kemungkinan yang dimaksud adalah air mani yang memancar, yaitu air mani lelaki, karena air mani keluar di antara tulang punggung dan tulang dada. Dan sepertinya inilah yang lebih utama, karena sifat air yang memancar yang bisa dilihat dan dirasakan pancarannya adalah air mani lelaki. Di samping itu, kata tara’ib juga dipakai untuk kaum lelaki yang bagi kaum wanita adalah tulang dada. Andai yang dimaksudkan adalah wanita, tentu yang disebutkan adalah tulang sulbi dan tulang dada perempuan. Wallahu a’lam"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ فَلْيَنْظُرِ الْإِنْسَانُ } Maka hendaklah setiap manusia melihat dan memikirkan { مِمَّ خُلِقَ } dari sesuatu apakah ia diciptakan, bukankah manusia adalah makhluk yang diciptakan dari sesuatu yang sebelumnya tidak ada menjadi ada, dengan apakah Allah ﷻ mewujudkan penciptaaan mereka ? . Manusia telah berbuat fasiq, menyekutukan penciptanya, dan melakukan berbagai macam kemaksiatan, akan tetapi mereka tidak pernah memikirkan dari apakah mereka itu diciptakan, maka hendaklah setiap insan berfikir dalam dirinya masing-masing tentang asal penciptaan dirinya itu, agar dia mengetahui siapakah dia itu sebenarnya, agar dia mengetahui betapa lemahnya dirinya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "فَلْيَنْظُرِ الْإِنْسَانُ مِمَّ خُلِقَ \"Maka hendaklah manusia memperhatikan dari apakah dia diciptakan? ” Huruf lam di sini فَلْيَنْظُرِ Untuk menunjukan perintah, yang dimaksud dengan melihat disini adalah melihat dengan mengambil pelajaran yaitu dengan ilmu, yakni hendaknya seorang insan berfikir dari apakah ia tercipta? Apakah ia tercipta dari besi? Apakah ia tercipta dari baja? Apakah ia tercipta dari sesuatu yang keras lagi kuat?"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tariq ayat 5: 5-7. Kemudian Allah memerintahkan agar manusia berfikir (merenungi) darimana ia diciptakan? dan bagaimana ia bisa wujud (ada)? dan bagi manusia semestinya paham bahwa ia diciptakan dari air yang keluar dari tulang belakang laki-laki dan terpancar ke dalam rahim perempuan, kemudian bercampurlah dengan air (ovum) yang ada pada perempuan, yang turun dari tulang belakangnya maka jadilah percampuran (dari keduanya) yang menghasilkan janin."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tariq Ayat 5",
    "description": "Sungguh, hari kebangkitan itu pasti akan terjadi. Maka, hendaklah manusia memperhatikan asal kejadiannya; dari apa dia diciptakan. Dengan demikian, dia akan mengetahui besarnya kekuasan Allah dan keterbatasan dirinya. 6. Dia pada mulanya diciptakan dari air mani yang terpancar dari laki-laki dan perempuan."
  }
]