[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "5-8. Hendaknya orang yang mengingkari kebangkitan kembali itu memperhatikan dari apa dia diciptakan, agar dia mengetahui bahwa pengembalian penciptaan manusia tidaklah lebih sulit daripada penciptaannya pertama kali. Manusia diciptakan dari sperma yang memancar dengan cepat ke Rahim, Yang keluar dari tulang sulbi laki-laki dan dada wanita. Sesungguhnya Allah yang menciptakan manusia dari air ini, benar-benar kuasa untuk menghidupkannya kembali sesudah kematian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Allah menciptakannya dari air yang dipancarkan ke rahim."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. خُلِقَ مِن مَّآءٍ دَافِقٍ (Dia diciptakan dari air yang dipancarkan) Yakni dipancarkan ke dalam rahim. Dan itu adalah campuran antara air mani laki-laki dan air mani perempuan, karena perempuan tercipta dari kedua air itu, namun Allah menyembutnya sebagai air yang satu karena telah bercampur."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Manusia diciptakan dari air mani yang kemudian dibentuk di dalam rahim. Dafiq: bermakna yang dipancarkan. Alhafirah bermakna: yang dibentuk"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia diciptakan dari air yang memancar} dipancarkan ke dalam rahim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 5-7 “Maka hendaklah manusia memperhatikan dari apakah dia diciptakan?” Yakni, hendaklah manusia merenungkan penciptaan dan permulaannya, dia adalah makhluk (yang tercipta) “dari air yang terpancar,” yaitu air mani yang “keluar di antara tulang sulbi laki-laki dan tulang dada perempuan.” Kemungkinan yang dimaksud adalah tulang belakang lelaki dan tulang dada perempuan dan kemungkinan yang dimaksud adalah air mani yang memancar, yaitu air mani lelaki, karena air mani keluar di antara tulang punggung dan tulang dada. Dan sepertinya inilah yang lebih utama, karena sifat air yang memancar yang bisa dilihat dan dirasakan pancarannya adalah air mani lelaki. Di samping itu, kata tara’ib juga dipakai untuk kaum lelaki yang bagi kaum wanita adalah tulang dada. Andai yang dimaksudkan adalah wanita, tentu yang disebutkan adalah tulang sulbi dan tulang dada perempuan. Wallahu a’lam"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Setelah penciptaan Nabi Adam 'alaihissalam sebagai manusia pertama yang diciptakan dari tanah, penciptaan manusia setelahnya adalah dari mani, { خُلِقَ مِنْ مَاءٍ دَافِقٍ } yaitu dari air yang dipancarkan dengan kuat, yakni dari mani yang keluarnya dengan pancaran yang kuat."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Jawaba atas pertanyaan-pertanyaan tersebut bahwa ia خُلِقَ مِنْ مَاءٍ دَافِقٍ “ diciptakan dari air yang dipancarkan, ” yaitu Air dari sperma laki-laki, Allah Ta’ala mensifatinya dalam ayat-ayat yang lain bahwa ia adalah air yang hina, mengalir dengan lemah tidak seperti air biasa yang mudah mengalir, Allah juga mensifatinya dalam ayat lainnya bahwa ia adalah nuthfah yang bermakna air yang sedikit saja. Inilah asal muasal diciptakannya manusia, dan anehnya, manusia yang tercipta dari air yang hina kemudian hatinya menjadi lebih keras dari batu wal-’iyaadzu billaah, kecuali orang yang Allah lembutkan hatinya untuk agama Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tariq ayat 6: 5-7. Kemudian Allah memerintahkan agar manusia berfikir (merenungi) darimana ia diciptakan? dan bagaimana ia bisa wujud (ada)? dan bagi manusia semestinya paham bahwa ia diciptakan dari air yang keluar dari tulang belakang laki-laki dan terpancar ke dalam rahim perempuan, kemudian bercampurlah dengan air (ovum) yang ada pada perempuan, yang turun dari tulang belakangnya maka jadilah percampuran (dari keduanya) yang menghasilkan janin."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tariq Ayat 6",
    "description": "Dia pada mulanya diciptakan dari air mani yang terpancar dari laki-laki dan perempuan. 7. Itulah sperma yang keluar dari antara tulang punggung laki-laki dan ovum yang keluar dari antara tulang dada perempuan. Campuran keduanya kemudian melalui berbagai proses dan tahapan di dalam rahim menjadi janin, cikal bakal manusia."
  }
]