[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "5-8. Hendaknya orang yang mengingkari kebangkitan kembali itu memperhatikan dari apa dia diciptakan, agar dia mengetahui bahwa pengembalian penciptaan manusia tidaklah lebih sulit daripada penciptaannya pertama kali. Manusia diciptakan dari sperma yang memancar dengan cepat ke Rahim, Yang keluar dari tulang sulbi laki-laki dan dada wanita. Sesungguhnya Allah yang menciptakan manusia dari air ini, benar-benar kuasa untuk menghidupkannya kembali sesudah kematian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Air ini keluar dari tulang punggung laki-laki dan tulang dada perempuan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. يَخْرُجُ مِنۢ بَيْنِ الصُّلْبِ وَالتَّرَآئِبِ (yang keluar dari antara tulang sulbi laki-laki dan tulang dada perempuan) Terdapat pendapat mengatakan yang dimaksud adalah dari tulang sulbi laki-laki dan tulang dada perempuan, dan janin tidak akan terbentuk dengan satu jenis air tersebut. Pendapat lain mengatakan: yakni air itu keluar dari seluruh anggota tubuh."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Air mani ini dikeluarkan dari tengah antara dua pantat laki-laki, dan dari tulang dada perempuan. At taraib: bermkna tempat anting-anting dada, bentuk jamak dari tarbiyatun"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{yang keluar dari antara tulang sulbi} tulang penyangga laki-laki {dan tulang dada} dan tulang dada yang terletak antara dua tulang selangka dan payudara"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 5-7 “Maka hendaklah manusia memperhatikan dari apakah dia diciptakan?” Yakni, hendaklah manusia merenungkan penciptaan dan permulaannya, dia adalah makhluk (yang tercipta) “dari air yang terpancar,” yaitu air mani yang “keluar di antara tulang sulbi laki-laki dan tulang dada perempuan.” Kemungkinan yang dimaksud adalah tulang belakang lelaki dan tulang dada perempuan dan kemungkinan yang dimaksud adalah air mani yang memancar, yaitu air mani lelaki, karena air mani keluar di antara tulang punggung dan tulang dada. Dan sepertinya inilah yang lebih utama, karena sifat air yang memancar yang bisa dilihat dan dirasakan pancarannya adalah air mani lelaki. Di samping itu, kata tara’ib juga dipakai untuk kaum lelaki yang bagi kaum wanita adalah tulang dada. Andai yang dimaksudkan adalah wanita, tentu yang disebutkan adalah tulang sulbi dan tulang dada perempuan. Wallahu a’lam"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Dari manakah air ( mani ) itu diasilkan ? apakah dari daratan. atau dari lautan, ataukah munking dari hujan yang turun ke bumi ? tidak... bahkan air itu dihasilkan dari sumber tersendiri. { يَخْرُجُ مِنْ بَيْنِ الصُّلْبِ } Yaitu dari sela-sela tulang sulbi laki-laki { وَالتَّرَائِبِ } dan dari sela-sela tulang dada perempuan. Berasal dari dua sumber yang berbeda, yaitu dari mani laki-laki dan perempuan, Allah ﷻ berfirman : { إِنَّا خَلَقْنَا الْإِنْسَانَ مِنْ نُطْفَةٍ أَمْشَاجٍ } ( Sesungguhnya Kami telah menciptakan manusia dari setetes mani yang bercampur ) [ Al-Insan : 2 ] dari setetes mani yang bercampur antara mani laki-laki dan perempuan. { يَخْرُجُ مِنْ بَيْنِ الصُّلْبِ وَالتَّرَائِبِ } Air yang keluar dari dua sumber itu kemudian disatukan dan bercampur selama 40 hari, kemudian air itu berubah wujud menjadi segumpal darah dan menetap selama 40 hari juga, kemudian setelah itu berubah menjadi potongan daging, kemudian dari daging itulah tubuh manusia dibentuk dengan izin dan kuasa Allah ﷻ , dan setelah penyelesaian tahap ke 4 yang 40 hari ditiupkanlah ruh kedalam tubuh itu, dan selesailah masa penciptaannya dan siap untuk bergerak, seperti itulah tahapan-tahapan penciptaan manusia di perut ibunya yang akhirnya menjadi janin yang siap dilahirkan, sebagimana yang dikatakan dalam hadits Ibnu mas'ud dari Rasulullah bersabda : (( عَنْ عَبْدِ اللهِ بنِ مَسْعوْدٍ رَضِيَ اللهُ عَنْهُ قالَ: حَدَّثَنَا رَسُوْلُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وهُوَ الصَّادِقُ الْمَصْدُوْقُ: إنَّ أَحَدَكُم يُجْمَعُ خلقُهُ فِيْ بَطْنِ أُمِّهِ أَرْبَعِيْنَ يَوْمًا نُطْفَةً، ثُمَّ يَكُوْنُ عَلَقَةً مِثْلَ ذَلِكَ، ثُمَّ يَكُوْنُ مُضْغَةً مِثلَ ذَلِكَ، ثُمَّ يُرْسَلُ إِلَيْهِ الْمَلَكُ فيَنْفُخُ فِيْهِ الرُّوْحَ، وَيُؤْمَرُ بِأَرْبَعِ كَلِمَاتٍ: بِكَتْبِ رِزْقِهِ، وَأَجَلِهِ، وَعَمَلِهِ، وَشَقِيٌّ أَوْ سَعِيْدٌ، فَوَاللهِ الَّذِيْ لاَ إِلَهَ غُيْرُهُ، إِنَّ أَحَدَكُمْ لَيَعْمَلُ بِعَمَلِ أَهْلِ الْجَنَّةِ حَتَّى مَا يَكُوْنُ بَيْنَهُ وَبَيْنَهَا إِلاَّ ذِرَاعٌ فَيَسْبِقُ عَلَيْهِ الْكِتَابُ فَيَعْمَلُ بِعَمَلِ أَهْلِ النَّارِ فَيَدْخُلُهَا، وَإِنَّ أَحَدَكُمْ لَيَعْمَلُ بِعَمَلِ أَهْلِ النَّارِ حَتَّى مَا يَكُوْنُ بَيْنَهُ وَبَيْنَهَا إِلاَّ ذِرَاعٌ فَيَسْبِقُ عَلَيْهِ الْكِتَابُ، فَيَعْمَلُ بِعَمَلِ أَهْلِ الْجَنَّةِ فَيَدْخُلُهَا. (رَوَاهُ الْبُخَارِيُّ وَمُسْلِمٌ )) \" Dari Abu ‘Abdir-Rahman ‘Abdullah bin Mas’ud Radhiyallahu ‘anhu, ia berkata, Rasulullah Shallallahu ‘alaihi wa sallam menuturkan kepada kami, dan beliau adalah ash-Shadiqul Mashduq (orang yang benar lagi dibenarkan perkataannya), beliau bersabda,”Sesungguhnya seorang dari kalian dikumpulkan penciptaannya dalam perut ibunya selama 40 hari dalam bentuk nuthfah (bersatunya sperma dengan ovum), kemudian menjadi ‘alaqah (segumpal darah) seperti itu pula. Kemudian menjadi mudhghah (segumpal daging) seperti itu pula. Kemudian seorang Malaikat diutus kepadanya untuk meniupkan ruh di dalamnya, dan diperintahkan untuk menulis empat hal, yaitu menuliskan rizkinya, ajalnya, amalnya, dan celaka atau bahagianya. Maka demi Allah yang tidak ada ilah yang berhak diibadahi dengan benar melainkan Dia, sesungguhnya salah seorang dari kalian beramal dengan amalan ahli surga, sehingga jarak antara dirinya dengan surga hanya tinggal sehasta, tetapi catatan (takdir) mendahuluinya lalu ia beramal dengan amalan ahli neraka, maka dengan itu ia memasukinya. Dan sesungguhnya salah seorang dari kalian beramal dengan amalan ahli neraka, sehingga jarak antara dirinya dengan neraka hanya tinggal sehasta, tetapi catatan (takdir) mendahuluinya lalu ia beramal dengan amalan ahli surga, maka dengan itu ia memasukinya”. [ Diriwayatkan oleh al Bukhari dan Muslim ] , semua tahapan penciptaan ini terjadi didalam rahim seorang ibu yang kuat. Setelah tahapan penciptaan itu selesai dan lahirlah manusia itu, dia kemudian hidup dimuka bumi ini sesuai dengan apa yang telah Allah ﷻ tetapkan baginya jalan kehidupan, sampai akhirnya ajal menjemput, Allah ﷻ berfirman : { ثُمَّ إِنَّكُمْ بَعْدَ ذَٰلِكَ لَمَيِّتُونَ } ( Kemudian, sesudah itu, sesungguhnya kamu sekalian benar-benar akan mati. ) [ Al-Mu'minun : 15 ] , setelah kematian itu apa yang terjadi padanya ? , Allah berfirman : { ثُمَّ إِنَّكُمْ يَوْمَ الْقِيَامَةِ تُبْعَثُونَ } ( Kemudian, sesungguhnya kamu sekalian akan dibangkitkan (dari kuburmu) di hari kiamat. ) [ Al-Mu'minun : 16 ] , diayat lain Allah berfirman : { وَلَقَدْ خَلَقْنَا الْإِنْسَانَ مِنْ سُلَالَةٍ مِنْ طِينٍ 12 ثُمَّ جَعَلْنَاهُ نُطْفَةً فِي قَرَارٍ مَكِينٍ 13 ثُمَّ خَلَقْنَا النُّطْفَةَ عَلَقَةً فَخَلَقْنَا الْعَلَقَةَ مُضْغَةً فَخَلَقْنَا الْمُضْغَةَ عِظَامًا فَكَسَوْنَا الْعِظَامَ لَحْمًا ثُمَّ أَنْشَأْنَاهُ خَلْقًا آخَرَ ۚ فَتَبَارَكَ اللَّهُ أَحْسَنُ الْخَالِقِينَ 14 ثُمَّ إِنَّكُمْ بَعْدَ ذَٰلِكَ لَمَيِّتُونَ 15 ثُمَّ إِنَّكُمْ يَوْمَ الْقِيَامَةِ تُبْعَثُونَ 16 } ( Dan sesungguhnya Kami telah menciptakan manusia dari suatu saripati (berasal) dari tanah 12 Kemudian Kami jadikan saripati itu air mani (yang disimpan) dalam tempat yang kokoh (rahim) 13 Kemudian air mani itu Kami jadikan segumpal darah, lalu segumpal darah itu Kami jadikan segumpal daging, dan segumpal daging itu Kami jadikan tulang belulang, lalu tulang belulang itu Kami bungkus dengan daging. Kemudian Kami jadikan dia makhluk yang (berbentuk) lain. Maka Maha sucilah Allah, Pencipta Yang Paling Baik 14 Kemudian, sesudah itu, sesungguhnya kamu sekalian benar-benar akan mati 15 Kemudian, sesungguhnya kamu sekalian akan dibangkitkan (dari kuburmu) di hari kiamat 16 ) [ Al-Mu'minun : 12 - 16 ]."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Kemudian Allah menjelaskan bahwa air yang terpancar tersebut يَخْرُجُ مِنْ بَيْنِ الصُّلْبِ وَالتَّرَائِبِ “yang keluar dari antara tulang sulbi laki-laki dan tulang dada . ” Yaitu dadanya yang paling atas, ini menunjukkan kedalaman sumber keluar air ini, bahwa ia keluar dari tempat yang terjaga dalam tubuh, sebagian ulama mengatakan air itu keluar dari antara tulang sulbi laki-laki dan tulang dada perempuan, namun penafsiran tersebut menyelisihi yang nampak jelas pada lafaz ayat, yang benar adalah bahwa yang keluar dari antara tulang sulbi dan tulang dada adalah air mani laki-laki, karena Allah Ta’ala telah mensifatinya demikian."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tariq ayat 7: 5-7. Kemudian Allah memerintahkan agar manusia berfikir (merenungi) darimana ia diciptakan? dan bagaimana ia bisa wujud (ada)? dan bagi manusia semestinya paham bahwa ia diciptakan dari air yang keluar dari tulang belakang laki-laki dan terpancar ke dalam rahim perempuan, kemudian bercampurlah dengan air (ovum) yang ada pada perempuan, yang turun dari tulang belakangnya maka jadilah percampuran (dari keduanya) yang menghasilkan janin."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Menurut Syaikh As Sa’diy, bisa maksudnya yang keluar dari antara tulang punggung laki-laki dan tulang dada perempuan. Bisa juga maksud mani yang terpancar itu adalah mani laki-laki, dan bahwa tempat yang dari sana keluar mani itu adalah di antara tulang sulbi dan tulang dadanya (tulang dada laki-laki), mungkin ini yang lebih tepat, karena Allah Subhaanahu wa Ta'aala menyifati mani itu dengan air yang terpancar, dan yang dirasakan dan disaksikan pancarannya adalah mani laki-laki. Di samping itu, kata ‘taraa’ib’ bisa juga dipakai untuk laki-laki yang kedudukannya menyamai tulang dada bagi perempuan. Kalau memang maksudnya adalah tulang dada perempuan, maka kata-katanya, “Min bainish shulbi wats tsadyain,” dan sebagainya, wallahu a’lam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tariq Ayat 7",
    "description": "Itulah sperma yang keluar dari antara tulang punggung laki-laki dan ovum yang keluar dari antara tulang dada perempuan. Campuran keduanya kemudian melalui berbagai proses dan tahapan di dalam rahim menjadi janin, cikal bakal manusia. 8. Allah kuasa menciptakan manusia dari ketiadaan, dari air yang memancar, maka sungguh Allah benar-benar kuasa pula untuk mengembalikannya menjadi hidup kembali sesudah mati. Mengembalikan sesuatu kepada kondisi semula, dalam perspektif manusia, tentu lebih mudah daripada menciptakannya untuk pertama kali. Namun, kedua hal itu sama mudahnya bagi Allah."
  }
]