[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "5-8. Hendaknya orang yang mengingkari kebangkitan kembali itu memperhatikan dari apa dia diciptakan, agar dia mengetahui bahwa pengembalian penciptaan manusia tidaklah lebih sulit daripada penciptaannya pertama kali. Manusia diciptakan dari sperma yang memancar dengan cepat ke Rahim, Yang keluar dari tulang sulbi laki-laki dan dada wanita. Sesungguhnya Allah yang menciptakan manusia dari air ini, benar-benar kuasa untuk menghidupkannya kembali sesudah kematian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Tatkala Allah menciptakannya dari air yang hina itu sesungguhnya Allah Mahakuasa untuk membangkitkannya setelah kematiannya demi perhitungan amal perbuatan dan pembalasan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. إِنَّهُۥ عَلَىٰ رَجْعِهِۦ لَقَادِرٌ (Sesungguhnya Allah benar-benar kuasa untuk mengembalikannya) Yakni membangkitkannya setelah kematian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8. Sesungguhnya Allah Maha Kuasa untuk membangkitkan manusia dari kematian"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya Dia untuk mengembalikannya} mengembalikannya hidup setelah mati {benar-benar mampu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 8-10 Dzat yang menciptakan manusia dari air yang memancar yang keluar dari tempat yang sulit, tentu mampu untuk mengembalikannya di akhirat dan untuk membangkitkan, mengumpulkan, dan memberi balasan. Ada yang menafsirkan bahwa maknanya adalah, sesungguhnya Allah kuasa untuk mengembalikan air mani yang terpancar ke dalam tulang sulbi kembali. Karena itu Allah berfirman setelahnya, “Pada hari dinampakkan segala rahasia,” yaitu rahasia-rahasia dada ditampakkan dan segala kebaikan dan keburukan yang ada di hati terlihat pada rona muka. Seperti difirmankan Allah, “Pada hari wajah-wajah memutih dan wajah-wajah menghitam.” (Ali Imran: 106) Di dalam dunia, banyak hal yang bisa disembunyikan yang tidak tampak oleh mata manusia, tapi di Hari Kiamat, kebaikan orang-orang baik dan dosa orang-orang yang berdosa pasti nampak. Semua hal menjadi terang dan jelas. Allah berfirman, “Maka sekali-kali tidak ada bagi manusia itu suatu kekuatan pun,” yakni dari dirinya yang bisa menangkal , “dan tidak (pula) seorang penolong” dari luar yang menolongnya. Ini adalah sumpah terhadap orang-orang yang berbuat pada saat mereka melakukannya dan pada saat mereka diberi balasan."
  },
  {
    "title": "Al-Mishbahul Munir fi Tahdzib Tafsir Ibnu Katsir / Syaikh Shafiyurrahman al-Mubarakfuri et. al.",
    "description": "لَقَادِرٌ"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ إِنَّهُ عَلَىٰ رَجْعِهِ لَقَادِرٌ } Sesungguhnya Dia Allah ﷻ benar-benar berkuasa untuk mengembalikan penciptaan hamba-Nya yang diciptakan dari air yang hina itu kembali setelah kematian, karena sesungguhnya yang mampu memulai penciptaan itu lebih mampu untuk mengulangi penciptaan itu kembali, Allah berfirman : { وَهُوَ الَّذِي يَبْدَأُ الْخَلْقَ ثُمَّ يُعِيدُهُ وَهُوَ أَهْوَنُ عَلَيْه } ( Dan Dialah yang menciptakan (manusia) dari permulaan, kemudian mengembalikan (menghidupkan)nya kembali, dan menghidupkan kembali itu adalah lebih mudah bagi-Nya. ) [ Ar Rum : 27 ] , akan tetapi orang-orang kafir mengeyampingkan hal ini, dan meyangka bahwa itu tidak akan terjadi jika tubuh manusia telah hancur lebur, sebagaimana yang tertulis didalam Al-Qur'an : { أَإِذَا كُنَّا عِظَامًا نَخِرَةً } ( Apakah (akan dibangkitkan juga) apabila kami telah menjadi tulang belulang yang hancur lumat?” ) [An Nazi'at : 11 ] , Allah juga berkata : { قُلْ يُحْيِيهَا الَّذِي أَنْشَأَهَا أَوَّلَ مَرَّةٍ ۖ وَهُوَ بِكُلِّ خَلْقٍ عَلِيمٌ } ( Katakanlah: “Ia akan dihidupkan oleh Tuhan yang menciptakannya kali yang pertama. Dan Dia Maha Mengetahui tentang segala makhluk. ) [ Yaa Siin : 79 ] Dialah Allah ﷻ yang menciptakan kamu dari air mani yang hina ini berkuasa untuk mengembalikan penciptaan kamu setelah kamu mati tanpa adanya kekurangan sama sekali, Allah ﷻ berfirman : { وَلَقَدْ جِئْتُمُونَا فُرَادَىٰ كَمَا خَلَقْنَاكُمْ أَوَّلَ مَرَّةٍ } ( Dan sesungguhnya kamu datang kepada Kami sendiri-sendiri sebagaimana kamu Kami ciptakan pada mulanya ) [ Al-An'am : 94 ] . Itulah kuasa Allah ﷻ, Allah berfirman : { أَيَحْسَبُ الْإِنْسَانُ أَنْ يُتْرَكَ سُدًى , أَلَمْ يَكُ نُطْفَةً مِنْ مَنِيٍّ يُمْنَىٰ , ثُمَّ كَانَ عَلَقَةً فَخَلَقَ فَسَوَّىٰ , فَجَعَلَ مِنْهُ الزَّوْجَيْنِ الذَّكَرَ وَالْأُنْثَىٰ , أَلَيْسَ ذَٰلِكَ بِقَادِرٍ عَلَىٰ أَنْ يُحْيِيَ الْمَوْتَىٰ } ( Apakah manusia mengira, bahwa ia akan dibiarkan begitu saja (tanpa pertanggung jawaban)? , Bukankah dia dahulu setetes mani yang ditumpahkan (ke dalam rahim) , Kemudian mani itu menjadi segumpal darah, lalu Allah menciptakannya, dan menyempurnakannya , Lalu Allah menjadikan daripadanya sepasang: laki-laki dan perempuan , Bukankah (Allah yang berbuat) demikian berkuasa (pula) menghidupkan orang mati? Cari Tafsir Search for: Pilih Surat Pilih Surat ) [ Al-Qiyamah : 36 - 40 ] . Ini adalah dalil dan bukti yang meremukkan keberadaan pengikut \" Al-Mu'attilah \" dan \" Al-Jababirah \" , Allah ﷻ berfrman : { أَمْ خُلِقُوا مِنْ غَيْرِ شَيْءٍ أَمْ هُمُ الْخَالِقُونَ } ( Apakah mereka diciptakan tanpa sesuatupun ataukah mereka yang menciptakan (diri mereka sendiri)? ) [ At Thur : 35 ] , mereka diciptakan dari setetes air yang hina, dan telah bahwa mereka itu bukanlah pencipta, bahkan mereka lah yang diciptakan, dan mereka akan dikembalikan kepada kehidupan yang lebih panjang masanya setelah mereka menjadi tanah di kubur mereka."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Kemudian Allah berfirman: إِنَّهُ عَلَى رَجْعِهِ لَقَادِرٌ “Sesungguhnya Allah benar-benar kuasa untuk mengembalikannya (hidup sesudah mati). ” Maknanya bahwa Allah ‘Azza Wa Jalla dalam mengembalikan manusia hidup kembali sungguh berkuasa nanti dihari kiamat kelak sebagai mana Firman Allah : يَوْمَ تُبْلَى السَّرَائِرُ “Pada hari dinampakkan segala rahasia, ” Yang mampu menciptakan manusia dari air yang memancar lagi hina, maha kuasa untuk menjadikannya hidup kembali di hari kiamat, ini di antara pendalilan dengan sesuatu yang tertangkap panca indera terhadapa sesuatu yang terlihat nampak, ini adalah qiyas (penganalogian) dengan akal. Sungguh seorang insan dengan akalnya mengatakan, jika Allah saja mampu menciptakan manusia dari air yang hina kemudia Dia menghidupkannya maka ia akan mampu menghidupkannya untuk kedua kalinya وَهُوَ الَّذِي يَبْدَأُ الْخَلْقَ ثُمَّ يُعِيدُهُ وَهُوَ أَهْوَنُ عَلَيْهِ “Dan Dialah yang menciptakan (manusia) dari permulaan, kemudian mengembalikan (menghidupkan)nya kembali, dan menghidupkan kembali itu adalah lebih mudah bagi-Nya. ”(QS. Ar-Rum: 27) Oleh karenanya Allah ‘Azza Wa Jalla berargumentasi dengan permulaan (penciptaan) atas (kebenaran) dikembalikannya (kehidupan setalah mati). Karena ini adalah qiyas yang jelas dan nampak, akal akan berpindah dari pikiran pertama kepada pikir kedua dengan cepat tanpa beban."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tariq ayat 8: 8-9. Allah kabarkan bahwa yang memulai menciptakan manusia adalah Dzat Yang Maha Mampu mengembalikannya setelah kematiannya. Kemudian Allah jelaskan pengembalian manusia dan dibangkitkannya aka terjadi pada hari kiamat dan ia adalah hari sebagai ujian bagi jiwa-jiwa manusia dan cobaan. Pada hari itu manusia mengetahui apa yang disembunyikan dan dirahasiakan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Barang siapa yang memperhatikan asal kejadiannya, tentu dia akan mengetahui bahwa Yang Berkuasa menciptakan manusia dari air yang hina yang keluar dari tempat yang sempit; dari tulang shulbi dan tulang dada, maka pasti berkuasa pula membangkitkannya setelah mati."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tariq Ayat 8",
    "description": "Allah kuasa menciptakan manusia dari ketiadaan, dari air yang memancar, maka sungguh Allah benar-benar kuasa pula untuk mengembalikannya menjadi hidup kembali sesudah mati. Mengembalikan sesuatu kepada kondisi semula, dalam perspektif manusia, tentu lebih mudah daripada menciptakannya untuk pertama kali. Namun, kedua hal itu sama mudahnya bagi Allah. 9. Allah akan membangkitkan manusia dari kubur mereka pada hari ditampakkan segala rahasia, seperti isi hati manusia, meliputi keyakinan, niat dan rahasia lain yang belum terkuak di dunia."
  }
]