[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "9-10. Hari itu, apa yang disimpan oleh dada akan ditampakkan, dibedakan antara yang baik dan yang buruk. Manusia tidak punya kekuatan untuk membela dirinya. Manusia tidak punya penolong yang menghindarkannya dari azab Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Di Hari ketika rahasia terkuak, sehingga terbukalah niat, keyakinan dan lainnya yang dulu tersembunyi di dalam hati, sehingga tampaklah perbedaan antara yang baik dan yang buruk."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. إِنَّهُۥ عَلَىٰ رَجْعِهِۦ لَقَادِرٌ (Sesungguhnya Allah benar-benar kuasa untuk mengembalikannya) Yakni membangkitkannya setelah kematian."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1) . Ungkapan tentang amal perbuatan dengan kata \"rahasia\" merupakan cara yang baik dan lembut, yakni amalan-amalan seseorang adalah gambaran dari semua kepribadiaan yang tersembunyi dalam dirinya, maka barangsiapa yang kepribadiaannya baik maka dapat disimpulkan bahwa amalan yang ia lakukan dihadapan orang lain akan baik juga, kepribadiaannya akan Nampak seperti cahaya yang terang diwajahnya, dan barangsiapa yang kepribadian dirinya buruk, maka amalan-amalannya akan ikut kepada kepribadiannya yang buruk itu, akan tampak diwajahnya kegelapan dan harapan yang buruk, betapa banyak dari umat manusia yang ketika di dunia tampak dari dirinya berbagai kebaikan yang hanyalah sebatas dalam pandangan orang lain tetapi kebaikan-kebaikan itu bukanlah yang tertera dalam kepribadiannya yang sebenarnya. 2) . Dada atau hati seseorang dapat diibaratkan dengan sebuah kotak yang didalamnya tersimpan semua amalan perbuatannya, dan kotak ini akan dibuka tatkala hari yang dijanjikan itu telah tiba, yaitu hari ketika semua rahasia-rahasia akan ditampakkan dihadapan pemiliknya, maka perhatikanlah apa-apa yang akan dibuka dan diperlihatkan dari dalam kotakmu, apakah kamu senang ketika yang diperlihatkan semua rahasia-rahasia yang tersembunyi dalam dadamu dan didalamnya tersimpan riya', hasad, dengki dan segala hal yang akan merusak keselamatanmu pada hari kiamat itu ? , maka bahagialah orang-orang yang dikatakan kepada mereka kamulah orang yang datang menghadap kepada Allah dengan hati yang selamat. 3) . Apakah ada rasa senang yang terbetik dalam dirimu tatkala rahasia yang selama ini kamu jaga dengan sangat hati-hati diketahui oleh orang lain, rahasia yang ketika orang-orang mengetahuinya dan kamu takut semua itu dilemparkan kepadamu ?! , tentu tidak, bahkan kamu akan berusaha dengan segala cara agar terhindar dari segala cacian dan tuduhan atas semua itu, oleh karena itu berhentilah pada ayat ini untuk kamu mentadabburinya, dan perhatikanlah peristiwa besar yang akan terjadi pada hari itu : { يَوْمَ تُبْلَى السَّرَائِرُ } , jika kamu mengendaki kemenangan pada hari pembalasan, maka ikutilah langkah yang dilakukan oleh mereka yang menghadap kepada tuhannya dengan hati yang selamat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9. Allah mengembalikan mereka pada hari dimana semua rahasia ditampakkan. Maksud dari as sarair adalah semua yang dikandung dalam hati, berupa iman, keyakinan, niat baik/buruk dan sebagainya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Pada hari ditampakkan} dikabarkan {segala rahasia} sesuatu yang disembunyikan di dalam hati berupa akidah, niat, dan yang lainnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 8-10 Dzat yang menciptakan manusia dari air yang memancar yang keluar dari tempat yang sulit, tentu mampu untuk mengembalikannya di akhirat dan untuk membangkitkan, mengumpulkan, dan memberi balasan. Ada yang menafsirkan bahwa maknanya adalah, sesungguhnya Allah kuasa untuk mengembalikan air mani yang terpancar ke dalam tulang sulbi kembali. Karena itu Allah berfirman setelahnya, “Pada hari dinampakkan segala rahasia,” yaitu rahasia-rahasia dada ditampakkan dan segala kebaikan dan keburukan yang ada di hati terlihat pada rona muka. Seperti difirmankan Allah, “Pada hari wajah-wajah memutih dan wajah-wajah menghitam.” (Ali Imran: 106) Di dalam dunia, banyak hal yang bisa disembunyikan yang tidak tampak oleh mata manusia, tapi di Hari Kiamat, kebaikan orang-orang baik dan dosa orang-orang yang berdosa pasti nampak. Semua hal menjadi terang dan jelas. Allah berfirman, “Maka sekali-kali tidak ada bagi manusia itu suatu kekuatan pun,” yakni dari dirinya yang bisa menangkal , “dan tidak (pula) seorang penolong” dari luar yang menolongnya. Ini adalah sumpah terhadap orang-orang yang berbuat pada saat mereka melakukannya dan pada saat mereka diberi balasan."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ يَوْمَ تُبْلَى } Pada hari itu akan ditampakkan { السَّرَائِرُ } semua yang disembunyikan didalam dada dan hati manusia, yang sesorang pun tidak mengetahuinya selain Allah ﷻ , akan tetapi pada hari kiamat semua rahasia-rahasia itu akan ditampakkan, apa yang tersembunyi di dada manusia akan nampak dengan jelas dihadapan Allah ﷻ , Allah ﷻ berfirman : { وَحُصِّلَ مَا فِي الصُّدُورِ } ( Dan dilahirkan apa yang ada di dalam dada ) [ Al-'Adiyat : 10 ] , dan Allah ﷻ berkata : { قُلْ إِنْ تُخْفُوا مَا فِي صُدُورِكُمْ أَوْ تُبْدُوهُ يَعْلَمْهُ اللَّهُ ۗ وَيَعْلَمُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ } ( Katakanlah: “Jika kamu menyembunyikan apa yang ada dalam hatimu atau kamu melahirkannya, pasti Allah mengetahui”. Allah mengetahui apa-apa yang ada di langit dan apa-apa yang ada di bumi. ) [ Ali-Imran : 29 ] , manusia tidak mengetahui apapun yang dirahasiakan diluar dirimya, tetapi Allah ﷻ mengetahui semuanya bahkan apa yang tersembunyi dilangit ( Dia ) menetahuinya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Firman Allah: يَوْمَ تُبْلَى السَّرَائِرُ “Pada hari dinampakkan segala rahasia, ” Maknanya: rahasia-rahasi akan diberitakan (dinampakkan), maksudnya adalah yang tersimpan di hati. Sesungguhnya hisab di hari kiamat itu terhadap apa-apa yang ada di hati, sedangkan hisab di dunia itu terhadap apa-apa yang nampak di anggota tubuh, oleh karenanya Nabi shallallaahu ‘alaihi wa sallam berinteraksi dengan orang-orang munafik sama dengan interaksi beliau dengan orang-orang muslim, di mana beliau pernah dimintai izin untuk membunuh mereka maka beliau bersabda: لَا يَتَحَدَّثِ النَّاسُ أَنَّ مُحَمَّداً يَقْتُلُ أَصْحَابَهُ “ Jangan sampai orang-orang mengatakan bahwa Muhammad telah membunuh para sahabatnya ”(1) Beliau tidak membunuh mereka padahal beliau tahu bahwa fulan munafik, fulan munafik dan fulan munafik, tapi amalan di dunia itu yang dianggap adalah amalan lahiriyah sedangkan di hari kiamat yang di anggap adalah apa-apa yang ada di hati. يَوْمَ تُبْلَى السَّرَائِرُ maknanya ditampakkan ini sebagaimana firman Allah: أَفَلَا يَعْلَمُ إِذَا بُعْثِرَ مَا فِي الْقُبُوْرِ. وَحُصِّلَ مَا فِي الصُّدُوْرِ “Maka apakah dia tidak mengetahui apabila dibangkitkan apa yang ada di dalam kubur,dan dilahirkan apa yang ada di dalam dada,”(QS. Al-Adiyaat: 9-10) oleh karena itu, wajib bagi kita lebih memperhatikan perbuatan hati daripada perbuatan anggota tubuh, perbuatan anggota tubuh adalah tanda yang nampak, tetapi perbuatan hati itulah yang menjadi porosnya, oleh karenanya Nabi shallallaahu ‘alaihi wa sallam tentang orang khawarij, mengabarkan kepada sahabatnya, beliau bersabda: يَحْقِرُ أَحَدُكُمْ صَلَاتَهُ مَعَ صَلَاتِهِمْ، وَصِيَامَهُ مَعَ صِيَامِهِمْ “Salah seorang dari kalian akan meremehkan shalatnya dibandingkan shalat mereka, puasanya dibandingkan dengan puasa mereka,” ’Mereka berusaha keras dengan melakukan amalan-amalan lahiriah namun hati mereka kosong wal-’iyaadzu billaah. لَا يَتَجَاوَزُالْإِسْلَامُ حَنَاجِرَهُمْ، يَمْرُقُوْنَ مِنَ الْإِسْلاَمِ كَمَا يَمْرُقُ السَّهْمُ مِنَ الرَّمِيَّةِ“ Keislamana mereka tidak melebihi kerongkongan mereka, mereka keluar (menembus) dari islam sebagai mana keluarnya anak panah dari sasarannya”(2) Hasan al-Bashri mengatakan: “Demi Allah, Abu Bakar tidak lebih unggul dari mereka dengan sholat mau pun dengan puasa, hanya saka ia lebih unggul dari mereka kerena apa-apa yang tertambat dalam hatinya berupa iman” Jika keimanan tertambat dalam hati seorang insan maka itu akan mendorongnya untuk beramal, tetapi terkada juga amal lahiriah membawa seorang insan untuk meperbaiki hatinya, maka hendaknya kita memperhatikan hati-hati, perbuatan-perbuatan, keyakinan-keyakinan kita, juga mengarahkan, memperbaiki dan membersihkannya dari noda-noda syirik dan bid’ah, juga rasa iri dan permusuhan dan membenci apa-apa yang Allah turunkan kepada rasul-Nya dan membenci sahabat-sahabat nabi radhiyallaahu ‘anhu dan hal lainnya yang hati harus bersih darinya. (1) Dikeluarkan oleh Bukhari (3518) dan Muslim (2584) hadits Jabir Bin Abdillah radhiyallaahu ‘anhuma (2) Dikeluarkan oleh Bukhari (7432) dan Muslim (1064) hadits dari Abu Sa’id al-Khudriy radhiyallaahu ‘anhu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tariq ayat 9: 8-9. Allah kabarkan bahwa yang memulai menciptakan manusia adalah Dzat Yang Maha Mampu mengembalikannya setelah kematiannya. Kemudian Allah jelaskan pengembalian manusia dan dibangkitkannya aka terjadi pada hari kiamat dan ia adalah hari sebagai ujian bagi jiwa-jiwa manusia dan cobaan. Pada hari itu manusia mengetahui apa yang disembunyikan dan dirahasiakan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang disembunyikan dalam hati, berupa keyakinan dan niat. Jika sebelumnya di dunia banyak yang tersembunyi, maka pada hari Kiamat menjadi jelas sehingga terlihat nyata siapa yang benar-benar baik dan siapa yang benar-benar buruk."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tariq Ayat 9",
    "description": "Allah akan membangkitkan manusia dari kubur mereka pada hari ditampakkan segala rahasia, seperti isi hati manusia, meliputi keyakinan, niat dan rahasia lain yang belum terkuak di dunia. 10. Ketika semua persoalan terkuak di hadapan Allah maka manusia tidak lagi mempunyai suatu kekuatan dalam dirinya sendiri dan tidak pula ada penolong dari luar dirinya yang mengelakkan nya dari balasan Allah. Allah-lah penguasa tunggal pada hari itu."
  }
]