[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1. Semua yang ada di langit dan di bumi menyucikan Allah dari apa yang tidak pantas bagiNya, dan hanya Allah semata Pemilik segala sesuatu Yang berkuasa atasnya tanpa pesaing, Yang disucikan dari segala kekurangan, Yang Mahaperkasa, Yang tidak terkalahkan, Yang Mahabijaksana dalam pengaturan dan penciptaanNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Seluruh makhluk yang ada di langit dan di bumi menyucikan Allah dari segala yang tidak pantas bagi-Nya dari sifat-sifat kekurangan dan memahasucikan-Nya. Sungguh Dia adalah Raja yang tunggal dalam kekuasaan-Nya, tersucikan dari segala kekurangan, Maha Perkasa yang tidak ada seorang pun yang mampu mengalahkan-Nya, Maha Bijaksana dalam penciptaan, syariat dan takdir-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1. Seluruh makhluk yang ada di tujuh langit dan bumi melantunkan tasbih dan tahmid kepada Allah; Dia Pemilik dan Pengatur seluruh makhluk, Maka Suci dari segala kekurangan, Maha Perkasa dalam kerajaan-Nya dan Maha Bijaksana dalam mengatur urusan makhluk-makhluk-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. الْمَلِكِ الْقُدُّوسِ (Raja, Yang Maha Suci) Makna (القدوس) yakni tersucikan dari segala aib dan kekurangan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Keutamaan: Imam Muslim meriwayatkan dari Ibnu Abbas RA dan Abu Hurairah RA bahwa sesungguhnya Rasulallah SAW membaca surah Al-Jumu’ah dan surah Al-Munafiqun saat melaksanakan shalat jum’at. 1. Semua makhluk di langit dan bumi mensucikan dan memuji Allah, Dzat yang memiliki kerajaan dan kekuasaan, Dzat yang suci dari segala sesuatu yang tidak sesuai denganNya, Dzat yang disifati dengan sifat-sifat yang sempurna, Dzat yang Maha Kuat, Maha Menang yang tidak ada satu pun yang dapat mengalahkanNya, dan Dzat yang Maha bijaksana dalam menciptakan makhlukNya dan menata urusan-urusan mereka. Dialah Dzat yang meletakkan segala sesuatu pada tempatnya yang tepat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apa yang ada di langit dan yang ada di bumi senantiasa bertasbih kepada Allah} menyusikan Allah dari segala sesuatu yang tidak paantas bagiNya {Dzat Yang Maha Merajai, Maha suci} Maha suci dari segala kekurangan {Maha perkasa, lagi Maha bijaksana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1. “Raja Yang Mahasuci, Yang Mahaperkasa lagi mahabijaksana.” Maksudnya, seluruh yang ada di langit dan di bumi memahasucikan Allah, tunduk pada perintahNya dan menuhankanNya. Karena Dia adalah Yang Mahasempurna dan Maharaja, yang milikNya-lah kerajaan langit dan bumi. Semuanya adalah milik Allah, berada dalam pengaturanNya. Mahasuci lagi Mahaagung, Yang suci dari segala kekurangan dan cela. Mahaperkasa lagi menundukkan secara paksa segala sesuatu. Mahabijaksana pada makhluk dan perintahNya. Sifat-sifat agung ini menyerukan penyembahan Allah semata, yang tidak ada sekutu bagiNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Jumu’ah ayat 1: Surat ini dibuka dengan puji-pujian dan pensucian untuk Allah dari sifat-sifat yang rendahan dan aib. Allah mengabarkan bahwa apa saja yang di langit dan di bumi mensucikan Allah dari apa yang tidak sesuai dengan kemulian dan kebesaran-Nya. Dan Allah adalah Raja yang berkuasa atas segala sesuatu, dengan kekuasaan dan hikmah-Nya. Allah disucikan dari setiap aib dan kekurangan, Dialah yang Maha Kuat, yang segala sesuatu di bawah kekuasaan dan kendali-Nya, Dialah Yang Maha Bijaksana bagi setiap yang Allah telah ciptakan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Semua yang ada di langit dan di bumi bertasbih kepada Allah, tunduk kepada perintah-Nya dan beribadah kepada-Nya karena Dia Maharaja, dimana milik-Nya alam bagian atas maupun bawah, semua milik-Nya dan di bawah pengaturan-Nya. Dari apa yang tidak layak bagi-Nya dan dari segala kekurangan. Yang menundukkan segala sesuatu. Dalam ciptaan dan perintah-Nya. Sifat-sifat agung yang disebutkan dalam ayat ini mengajak untuk beribadah kepada Allah saja; tidak ada sekutu bagi-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Jumu’ah Ayat 1",
    "description": "Apa yang ada di langit, bintang, bulan, matahari dan seluruh planet; dan apa yang ada di bumi, hewan dan tetumbuhan bertasbih kepada Allah, mengakui dan menyatakan kemahasucian Allah yang berbeda dengan seluruh makhluk ciptaan-Nya; dia adalah maharaja yang kekuasaan-Nya mutlak; yang mahasuci dari segala yang diduga manusia; dan dialah yang mahaperkasa menciptakan dan menghancurkan jagat raya sekejap mata; mahabijaksana, tidak terburu menggunakan kekuasaan-Nya yang tiada terbatas untuk menghancurkan jagat raya atau menghukum manusia yang berdosa. 2. Dialah yang mengutus seorang rasul, Muhammad kepada kaum yang buta huruf, yang secara khusus ditujukan kepada bangsa arab yang kebanyakan tidak bisa baca tulis, dari kalangan mereka sendiri, yaitu dari kalangan bangsa arab, yang membacakan kepada mereka ayat-ayat-Nya, ayat-ayat Al-Qur'an, yang isinya menyucikan jiwa mereka yang beriman kepadanya; dan mengajarkan kepada mereka yang membuka diri menerima dan membenaran kerasulan beliau, kitab Al-Qur'an, dan hikmah yakni sunah nabi, meskipun sebelumnya, yakni sebelum kelahiran rasulullah di masa jahiliah, mereka, sebagian di antara para sahabat rasulullah benar-benar dalam kesesatan yang nyata. Keyakinan mereka menyimpang dari prinsip tauhid dan perilaku mereka bertentangan dengan nilai kemanusiaan, salah satunya mengubur anak perempuan hidup-hidup."
  }
]