[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "11. Apabila sebagian kaum Muslimin melihat perdagangan atau permainan dunia dan perhiasannya, mereka berpencar kepadanya dan meninggalkanmu wahai Nabi, berdiri berkhutbah di atas mimbar. Katakanlah kepada mereka wahai Nabi, “Apa yang ada di sisi Allah berupa pahala dan nikmat lebih bermanfaat bagi kalian daripada permainan dan perdagangan. Hanya Allah sebaik-baik pemberi rizki dan pemberi kebaikan, maka mintalah ia kepadaNya, gunakanlah ketaatan kepada Allah untuk mendapatkan apa yang ada di sisiNya berupa kebaikan dunia dan akhirat.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Jika sebagian dari kaum muslimin melihat perniagaan atau permainan, mereka segera berpencar mendatanginya dan meninggalkan kamu -wahai Rasul- berdiri di atas mimbar. Katakan -wahai Rasul-, “Pahala amal saleh yang ada di sisi Allah lebih baik dari perniagaan dan permainan yang kalian kejar, dan Allah adalah sebaik-baik Pemberi rezeki.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "11. Allah menegur sebagian kaum muslimin yang jika melihat perniagaan atau permainan dan perhiasan dunia, maka mereka akan mendatanginya dan meninggalkanmu -hai Rasulullah- berdiri di atas mimbar ketika sedang berkhutbah. Katakanlah kepada mereka: “Pahala besar yang ada di sisi Allah Yang Maha Pemurah lebih baik daripada permainan dengan perhiasan dunia dan perniagaan dengan keuntungan sebesar apapun. Allah adalah sebaik-baik pemberi rezeki, maka mintalah rezeki dunia dan akhirat dari-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "11. وَإِذَا رَأَوْا۟ تِجٰرَةً أَوْ لَهْوًا انفَضُّوٓا۟ إِلَيْهَا (Dan apabila mereka melihat perniagaan atau permainan, mereka bubar untuk menuju kepadanya) Sebab turunnya ayat ini adalah ketika penduduk Madinah mengalami paceklik dan krisis, kemudian datanglah kafilah dagang dari Syam saat Rasulullah sedang berkhutbah Jum’at; maka orang-orang pergi menuju kafilah itu hingga tidak ada yang tersisa kecuali 12 orang laki-laki saja di dalam masjid. Dan diriwayat lain menyatakan: serta tujuh orang wanita. Makna (انفضوا إليها) yakni pergi keluar menuju kafilah itu. وَتَرَكُوكَ قَآئِمًا ۚ( dan mereka tinggalkan kamu sedang berdiri (berkhotbah)) Yakni berdiri di atas mimbar. قُلْ مَا عِندَ اللهِ(Katakanlah: “Apa yang di sisi Allah) Berupa pahala yang besar, yaitu surga. خَيْرٌ مِّنَ اللَّـهْوِ وَمِنَ التِّجٰرَةِ ۚ( lebih baik daripada permainan dan perniagaan”) Yakni perdagangan yang kalian tuju, serta kalian tidak berdiam di masjid untuk mendengarkan khutbah Rasulullah. وَاللهُ خَيْرُ الرّٰزِقِينَ(dan Allah Sebaik-baik Pemberi rezeki)"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Ketika orang-orang yang melaksanakan shalat jum’at itu melihat perniagaan yaitu berbagai macam usaha atau melihat hiburan seperti suara genderang, seruling dan alat lain yang serupa, mereka bertebaran menuju perniagaan dan permainan itu dan meninggalkanmu wahai nabi yang sedang berdiri di atas mimbar dan berkhutbah. Katakanlah (pada mereka): “Apa yang di sisi Allah berupa pahala yang agung yaitu surga itu lebih baik daripada hiburan dan perniagaan yang kalian kejar-kejar. Allah adalah sebaik-baik Dzat yang memberikan rejeki. Maka berserahlah kalian kepadaNya dan carilah rejeki dariNya.” Imam Ahmad, Imam Bukhari, Imam Muslim, dan Tirmidzi dari Jabir berkata: “Saat itu, Nabi SAW berkhutbah pada hari Jum’at, datanglah karavan (yaitu unta yang membawa makanan) yang berjalan (melewati masjid). Lalu mereka (orang-orang yang shalat) pergi menuju karavan itu, sampai tidak ada satupun yang tersisa bersama Nabi kecuali 12 laki-laki. Kemudian Allah menurunkan ayat ini.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apabila mereka melihat perdagangan atau permainan} sesuatu yang mengalihkan jiwa dari segala sesuatu yang bermanfaat {mereka segera berpencar menuju padanya} mereka memisahkan darimu menuju hal itu {dan meninggalkanmu yang sedang berdiri} di atas mimbar khutbah {Katakanlah,“Apa yang ada di sisi Allah itu lebih baik daripada permainan dan perdagangan” Allah adalah sebaik-baik pemberi rezeki}"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11. “Dan apabila mereka melihat perniagaan atau permainan, mereka bubar untuk menuju kepadanya,” maksudnya, mereka keluar dari masjid karena amat menginginkan sesuatu yang melalaikan itu dan karena perdagangan itu dengan meninggalkan kebaikan, “dan mereka tinggalkan kamu sedang berdiri (berkhutbah),” yakni ketika engkau sedang berkhutbah di hadapan banyak orang. Peristiwa ini terjadi pada Hari Jumat ketika Nabi tengah berkhutbah di hadapan orang-orang, datanglah kafilah perdagangan di kota Madinah. Ketika orang-orang yang berada di masjid mendengar kedatangan kafilah itu, mereka pun pergi meninggalkan masjid dan meninggalkan Nabi ketika sedang berkhutbah, karena bersegera ingin mendapatkan sesuatu yang tidak pantas mereka lakukan serta tidak beradab. “Katakanlah, ‘Apa yang di sisi Allah’,” berupa pahala bagi orang yang konsisten dalam kebaikan serta menyabarkan dirinya dalam menyembah Allah, “adalah lebih baik daripada permainan dan perniagaan,” yang meski sebagian tujuannya terpenuhi tapi itu hanya sedikit dan membuat orang tidak mendapatkan pahala akhirat. Bersabar dalam melakukan ketaatan tidak menyebabkan orang tidak kebagian rizki, “dan Allah sebaik-baik Pemberi rizki.” Siapa pun yang bertakwa pada Allah akan diberi rizki dari arah yang tidak diduga-duga. Terdapat beberapa initi sari dari ayat-ayat di atas; Pertama, Shalat Jumat adalah kewajiban seluruh orang-orang Mukmin laki-laki. Mereka wajib bersegera menunaikan serta memperhatikannya. Kedua, dua khutbah pada Hari JUmat adalah wajib dan wajib dihadiri. Karena kata (mengingat) dalam ayat di atas ditafsirkan sebagai dua khutbah. Allah memerintahkan agar orang-orang yang beriman datang segera untuk mendengarkannya. Ketiga, disyariatkan serta diperintahkannya adzan jumat. Keempat, larangan dan haramnya berjual beli setelah adzan Jumat (berkumandang) karena hal itu bisa melalaikan kewajiban dan mempersibuk diri sehingga tidak bisa menunaikannya. Hal itu menunjukkan, bahwa segala sesuatu meski asalnya mubah yang jika dilakukan bisa melalaikan dari kewajiban, maka sesuatu itu tidak boleh dilakukan pada waktu itu. Kelima, perintah untuk mendatangi dua khutbah jumat dan celaan bagi orang yang tidak mendatanginya. Termasuk wajib dalam hal ini adalah diam mendengarkan dua khutbah. Keenam, seseorang yang hendak menghadiri ibadah pada waktu jiwanya mendorong agar mendatangi pekerjaan-pekerjaan yang melalaikan, perdagangan dan kepentingan-kepentingan hawa nafsu harus mengingat kebaikan-kebaikan di sisi allah dan harus lebih mengedepankan ridha Allah daripada hawa nafsunya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Jumu’ah ayat 11: Allah memperingatkan hamba-Nya yang mukmin jika melihat perdagangan orang badui, atau mendengar suara dengan serentak untuk mempromosikan dagangannya, keluarlah mereka para sahabat dari masjid, dengan meninggalkan khatib (untuk menegur pedagang), karena para sahabat pernah mendengar pedagang dari badui, dan mereka para sahabat menyangka telah selesai shalat, dan boleh bagi badui untuk berdagang mencari rezeki; Maka keluarlah para sahabat menuju ke pedagang badui, maka Rasul pada saat itu sedang berkhutbah ﷺ, yaitu beliau ﷺ berkhutbah pada waktu itu setelah shalat jumat, maka Allah memerintahkan Nabi ﷺ agar berkata kepada mereka : Ketahuilah oleh kalian, apa yang di sisi Allah dari ganjaran akhirat lebih baik daripada permainan dan perdagangan yang kalian keluar dengan sebab itu, kemudian ketahuilah sesungguhnya Allah sebaik-baik pemberi rezeki, karena Dia adalah yang membagikan rezeki."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Imam Bukhari meriwayatkan dengan sanadnya yang sampai kepada Jabir bin Abdullah ia berkata, “Ketika kami shalat (Jum’at) bersama Nabi shallallahu 'alaihi wa sallam, tiba-tiba datang rombongan yang membawa bahan makanan, lalu mereka menoleh kepadanya sehingga tidak ada yang tersisa bersama Nabi shallallahu 'alaihi wa sallam kecuali dua belas orang, maka turunlah ayat ini, “Dan apabila mereka melihat perdagangan atau permainan, mereka segera menuju kepadanya dan mereka tinggalkan engkau (Muhammad) sedang berdiri (berkhutbah)…dst.” (Hadits ini diriwayatkan pula oleh Muslim, Tirmidzi dan ia berkata, “Hadits ini hasan shahih,” diriwayatkan pula oleh Ahmad dan Ibnu Jarir). Thabari meriwayatkan dengan sanad yang para perawinya adalah para perawi hadits shahih, demikian pula Abu ‘Uwanah dalam shahihnya sebagaimana dikatakan Al Haafizh dalam Al Fat-h juz 3 hal. 76 dari Jabir bin Abdullah ia berkata, “Wanita-wanita gadis apabila mereka menikah, maka mereka lewat dengan iringan tabuhan gendang dan seruling, dan mereka (sebagian kaum muslimin) meninggalkan Nabi shallallahu 'alaihi wa sallam dalam keadaan berdiri di atas mimbar dan pergi kepadanya, maka Allah menurunkan ayat, “Dan apabila mereka melihat perdagangan atau permainan, mereka segera menuju kepadanya…dst.” Berupa balasan dan pahala untuk orang yang senantiasa melazimi kebaikan dan menyabarkan dirinya untuk beribadah kepada Tuhannya. Meskipun sebagian maksud mereka tercapai, namun sangat sedikit sekali dibanding kebaikan akhirat yang luput karena mengutamakannya. Sabar di atas ketaatan kepada Allah tidaklah menghilangkan rezeki, karena Allah sebaik-baik pemberi rezeki; barang siapa bertakwa kepada Allah, maka ia akan diberi rezeki dari arah yang tidak disangka-sangka. Dalam ayat ini terdapat beberapa faedah: - Shalat Jum’at wajib bagi seluruh kaum muslimin, mereka juga wajib segera dan mengutamakannya di atas semua kesibukan mereka. - Dua kali khutbah pada shalat Jum’at wajib dihadiri, karena kata ‘dzikr’ (mengingat Allah) ditafsirkan dengan dua khutbah. - Disyariatkan mengumandangkan azan Jum’at. - Larangan jual beli ketika azan Jum’at telah dikumandangkan. Yang demikian, karena hal itu dapat menghilangkan kewajiban dan melalaikan darinya. Hal ini menunjukkan bahwa setiap perkara meskipun pada asalnya mubah, namun jika sampai melalaikan kewajiban, maka pada saat itu tidak diperbolehkan. - Perintah untuk menghadiri dua khutbah Jum’at dan celaan bagi orang-orang yang tidak menghadirinya. Termasuk ke dalam bagian ini adalah wajibnya diam mendengarkan khutbah. - Sepatutnya seorang hamba mendatangi ibadah kepada Allah meskipun ada dorongan dalam jiwa untuk mendatangi permainan, bisnis dan keinginan hawa nafsu serta mengingat kebaikan dan pahala yang Allah janjikan serta mengutamakan keridhaan-Nya daripada hawa nafsunya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Jumu’ah Ayat 11",
    "description": "Ayat sebelumnya mengingatkan orang-orang beriman agar kembali bekerja mencari rezeki yang halal apabila sudah melaksanakan salat Jumat. Ayat ini menegur kaum muslim yang meninggalkan Rasulullah ketika sedang menyampaikan khutbah Jumat untuk berburu barang dagangan. Dan apabila mereka, orang-orang beriman yang sedang menyimak khutbah Jum'at, melihat perdagangan, kafilah dagang yang membawa barang-barang berharga tiba di Madinah atau permainan, hiburan musik dan tari yang diselenggarakan guna menyambut kafilah dagang yang baru tiba dari Syam, mereka, sebagian besar orang-orang yang sedang menyimak khutbah Jumat itu, segera menuju kepadanya, ke tempat kafilah dagang dan hiburan itu; dan mereka meninggalkan engkau Muhammad yang sedang berdiri, menyampaikan khutbah Jumat. Katakanlah, wahai Muhammad kepada mereka, ?Apa yang ada di sisi Allah, kenikmatan surga yang diberikan kepada orang yang taat kepada Allah dan Rasul-Nya lebih baik daripada permainan, hiburan, musik dan tari, dan perdagangan barang-barang berharga yang dicari dan disukai manusia.? Dan Allah pemberi rezeki yang terbaik kepada setiap manusia. 1. Apabila orang-orang munafik di Madinah datang kepadamu Muhammad, lalu mereka berkata di hadapanmu, ?Kami mengakui bahwa engkau adalah Rasul Allah,? untuk menunjukkan bahwa mereka beriman kepada Allah dan Rasul-Nya, maka janganlah engkau percaya terhadap ucapan mereka. Dan sebaliknya yakinlah, Allah mengetahui bahwa engkau benar-benar Rasul-Nya dengan menurunkan wahyu dan melindungimu; dan Allah menyaksikan dengan menunjukkan bukti kepada kamu bahwa orang-orang munafik itu benar-benar pendusta tentang pengakuannya bahwa mereka beriman kepada Allah dan Rasul-Nya."
  }
]