[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "2.-3. Allah-lah Yang mengutus kepada orang-orang Arab yang tidak bisa membaca, tidak memiliki kitab dan tidak ada kerasulan pada mereka, seorang rasul dari mereka kepada seluruh manusia, yang membacakan al-Quran kepada mereka, menyucikan mereka dari akidah-akidah rusak dan akhlak-akhlak buruk, mengajari mereka al-Quran dan asSunnah. Sesungguhnya mereka sebelum diutusnya Rasulullah berada di dalam penyimpangan yang nyata dari jalan kebenaran. Allah juga mengutus Rasul tersebut kepada kaum lain yang belum datang dan akan datang dari kalangan orang-orang Arab dan lainnya. Hanya Allah semata Yang Mahaperkasa, Yang berkuasa atas segala sesuatu lagi Mahabijaksana dalam perkataan dan perbuatanNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Dia lah yang mengutus kepada orang-orang Arab yang tidak bisa membaca dan menulis seorang Rasul dari kalangan mereka, membacakan kepada mereka ayat-ayat-Nya yang diturunkan kepadanya, membersihkan mereka dari kekufuran dan akhlak yang buruk, mengajari mereka Al-Qur`ān, mengajari mereka As-sunnah, dan sesungguhnya mereka sebelum pengutusan Rasul tersebut kepada mereka berada dalam kesesatan yang nyata dari kebenaran, karena mereka dahulu menyembah berhala-berhala, menumpahkan darah dan memutuskan silaturahim."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "2-3. Allah yang mengutus Nabi Muhammad sebagai utusan kepada orang-orang Arab yang sedikit sekali mengetahui baca tulis, dan kepada manusia dan jin seluruhnya; agar dia membacakan al-Qur’an kepada mereka, menyucikan mereka dari kotoran kesyirikan dan kemaksiatan, dan mengajarkan mereka al-Qur’an dan as-Sunnah. Dan sebelum Rasulullah diutus, mereka berpaling dari kebenaran dan berada dalam kesyirikan dan kemaksiatan. Dan Allah juga mengutusnya kepada umat-umat lainnya dari berbagai bangsa yang ada setelah generasi para sahabat hingga hari kiamat. Allah maha Perkasa dalam kerajaan-Nya dan Maha Bijaksana dalam mengatur urusan makhluk-makhluk-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. هُوَ الَّذِى بَعَثَ فِى الْأُمِّيِّۦنَ رَسُولًا مِّنْهُمْ (Dialah yang mengutus kepada kaum yang buta huruf seorang Rasul di antara mereka) Yang dimaksud dengan kaum yang buta huruf (Ummiyin) adalah orang-orang Arab; sebagian mereka dapat menulis dan sebagian mereka tidak, sebab mereka bukan termasuk Ahli Kitab. Dan makna asal kata (Ummiy) adalah orang yang tidak dapat membaca dan menulis; dan kebanyakan orang Arab ketika itu tidak dapat baca tulis. يَتْلُوا۟ عَلَيْهِمْ ءَايٰتِهِۦ(yang membacakan ayat-ayat-Nya kepada mereka) Yakni membacakan al-Qur’an. Padahal Rasulullah tidak dapat membaca tulisan atau menulis dan tidak mempelajari itu dari siapapun. وَيُزَكِّيهِمْ(mensucikan mereka) Yakni membersihkan mereka dari kotoran kekafiran, dosa-dosa, dan akhlak yang buruk. Pendapat lain mengatakan: yakni menjadikan mereka memiliki hati yang bersih dengan keimanan. وَيُعَلِّمُهُمُ الْكِتٰبَ وَالْحِكْمَةَ(dan mengajarkan mereka Kitab dan Hikmah) Makna (الكتاب) di sini yakni al-Qur’an, sedangkan (الحكمة) adalah sunnah Rasulullah. Pendapat lain mengatakan yang dimaksud dengan (الكتاب) yakni menulis dengan pena, dan (الحكمة) yakni pemahaman agama; dan inilah pendapat yang diambil oleh Malik bin Anas. وَإِن كَانُوا۟ مِن قَبْلُ لَفِى ضَلٰلٍ مُّبِينٍ (Dan sesungguhnya mereka sebelumnya benar-benar dalam kesesatan yang nyata) Yakni dalam kesyirikan dan jauh dari kebenaran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Maha Suci Allah yang mengutus Muhammad sebagai Rasul dari bangsa Arab yang Ummiy, yaitu orang-orang yang tidak dapat membaca dan menulis. Maknanya adalah kebanyakan dari mereka adalah Ummiy, dan dia (Muhammad) termasuk dalam golongan tersebut yaitu sebagai bangsa Arab yang ummiy. Dia (Muhammad) membacakan kepada mereka ayat-ayat Allah dalam Al-Qur’an yang diturunkan kepadanya dengan ke-Ummiyan-nya yang sama dengan mereka. Dia membersihkan mereka dari kesyirikan dan akidah serta akhlak yang buruk. Dia mengajarkan mereka Al-Qur’an, Sunnah dan pengertian tentang tujuan ajaran syariat dan rahasia-rahasianya. Sesungguhnya sebelum dia diutus menjadi Rasul, mereka berada dalam kesalahan yang jelas dan nyata serta jauh dari kebenaran, yaitu berupa kesyirikan dan keburukan zaman Jahiliyyah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dialah yang mengutus seorang Rasul kepada kaum yang buta huruf} orang Arab yang tidak bisa menulis dan membaca {dari kalangan mereka, yang membacakan kepada mereka ayat-ayatNya, menyucikan mereka} menyucikan mereka dari kekufuran dan akhlak yang buruk {serta mengajarkan kepada mereka kitab} Al-Qur’an {dan hikmah} Sunah {meskipun sebelumnya mereka benar-benar dalam kesesatan yang nyata"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2. “Dia-lah yang mengutus kepada kaum yang buta huruf seorang Rasul,” yang dimaksud kaum buta huruf adalah kaum yang tidak memiliki kitab suci dan tidak ada jejak kerasulan, baik dari kalangan ahli kitab. Allah memberikan ujian besar pada mereka yang melebihi karunia kalangan lainnya, karena mereka tidak memiliki ilmu dan kebaikan. Mereka sebelumnya berada dalam “kesesatan yang nyata.” Dengan menyembah patung, pohon, dan batu, dan beretika seperti binatang buas pemangsa, di mana yang kuat di antara mereka memakan yang lemah. Mereka berada di puncak kebodohan terhadap ilmu para nabi. Kemudian Allah menguutus seorang rasul dari kalangan mereka. Mereka menetahui nasab, sifat-sifatnya yang baik serta kejujurannya, dan Allah menurunkan kitab suciNya, “yang membacakan ayat-ayatNya kepada mereka,” yang pasti dan mengharuskan beriman dan meyakini, “dan menyucikan mereka,” dengan menjelaskan dan mendorong mereka pada sifat-sifat utama serta mencegah mereka dari akhlak-akhlak tercela, “dan mengajarkan kepada mereka Kitab dan hikmah.” Maksudnya, ilmu al-Quran dan -Sunnah yang mencakup seluruh ilmu orang-orang terdahulu dan terkemudian. Setelah pembelajaran dan penyucian itu, mereka menjadi manusia paling baik petunjuk dan jalannya. Mereka menjadikan diri mereka sebagai petunjuk dan memberi petunjuk pada orang lain sehingga mereka menjadi pemimpin orang-orang yang bertakwa. Merupakan nikmat yang paling sempurna dan karunia terbesar, karena Allah mengutus di tengah-tengah mereka rasul tersebut."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Jumu’ah ayat 2: Allah mengabarkan bahwa Dialah yang mengutus Rasul ﷺ kepada umat yang buta huruf, yang tidak dapat membaca dan juga menulis, mereka adalah orang-orang arab. Dan inilah Rasul yang dipilih oleh Allah dari kalangan mereka dan yang termulia dari mereka orang-orang arab, dan dia tidak mengenal apa itu membaca dan menulis semisal dengan mereka (orang-orang arab). Allah telah mengutusnya untuk membacakan kepada mereka ayat-ayat Al Qur’an dan menjelaskan kepada mereka dalil dan bukti yang bersamaan dengan itu, dia tidak dapat membaca dan menulis, dan dia juga (datang) untuk mensucikan mereka dari kotoran kekafiran dan dosa, dan mengajarkan Al Qur’an dan As Sunnah Nabawiyyah yang disucikan. Karena mereka sebelum diutusnya dan kedatangan Rasul ﷺ masih dalam kesesatan yang nyata dari kemaksiatan dan kekafiran dan berkuasa (di tanah arab) keburukan, misalnya : Mengubur hidup-hidup anak perempuan, saling membunuh di antara mereka satu sama lain serta mencuri dan merampok, semua ini menjadikan tidak terdapat pada mereka seorang ahli tauhid, akan tetapi hanya segelintir yang tersisa semisal Waraqah bin Naufal dan yang selainnya. Pada saat itulah mereka menjadi sesat secara umum."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu bangsa Arab, dimana mereka tidak kenal baca-tulis. Allah Subhaanahu wa Ta'aala memberikan nikmat kepada mereka dengan nikmat yang sangat besar daripada nikmat-Nya kepada selain mereka, karena mereka sebelumnya tidak berilmu dan tidak di atas kebaikan, bahkan mereka berada di atas kesesatan yang nyata; mereka menyembah patung, batu dan pepohonan serta berakhak dengan akhlak binatang, dimana yang kuat memakan yang lemah, bahkan mereka berada dalam kebodohan yang dalam terhadap ilmu para nabi, maka Allah Subhaanahu wa Ta'aala mengutus seorang rasul dari kalangan mereka sendiri yang mereka ketahui nasabnya, sifat-sifatnya yang baik, amanahnya dan kejujurannya dan Dia turunkan kepadanya kitab-Nya. Dari syirk. Atau mendorong mereka berakhlak mulia dan mencegah mereka dari akhlak yang buruk. Oleh karena itu, pengutusan rasul kepada mereka adalah nikmat yang paling besar dan paling agung yang dikaruniakan Allah kepada mereka. Ayat ini juga sebagai dasar pijakan dalam dakwah tashfiyah wa tarbiyah (membersihkan umat dari segala yang bukan dari Islam dan mendidik umat di atas ajaran Islam yang murni). Oleh karena itu, setelah ta’lim (pengajaran) dan pembersihan ini mereka (para sahabat) menjadi manusia yang berilmu, bahkan menjadi imam dalam ilmu dan agama, sempurna akhlaknya, paling baik petunjuk dan jalannya. Di samping itu, mereka juga dijadikan standar yang benar oleh Rasulullah shallallahu 'alaihi wa sallam dalam beragama ketika terjadi perselisihan di zaman setelah Beliau sebagaimana sabdanya: ، فَإِنَّهُ مَنْ يَعِشْ مِنْكُمْ فَسَيَرَى اخْتِلاَفاً كًثِيْراً. فَعَلَيْكُمْ بِسُنَّتِي وَسُنَّةِ الْخُلَفَاءِ الرَّاشِدِيْنَ الْمَهْدِيِّيْنَ عَضُّوا عَلَيْهَا بِالنَّوَاجِذِ، وَإِيَّاكُمْ وَمُحْدَثَاتِ اْلأُمُوْرِ، فَإِنَّ كُلَّ بِدْعَةٍ ضَلاَلَةٌ “Karena barang siapa yang hidup di antara kamu (setelah ini), maka ia akan menyaksikan banyaknya perselisihan. Hendaklah kamu berpegang teguh dengan sunnahku dan sunnah Khulafaurrasyidin yang mendapatkan petunjuk, gigitlah (genggamlah dengan kuat) dengan geraham, dan jauhilah perkara yang diada-adakan, karena semua perkara bid’ah adalah sesat.“ (HR. Abu Dawud dan Tirmidzi, dia berkata, \"Hasan shahih.\")"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Jumu’ah Ayat 2",
    "description": "Dialah yang mengutus seorang rasul, Muhammad kepada kaum yang buta huruf, yang secara khusus ditujukan kepada bangsa arab yang kebanyakan tidak bisa baca tulis, dari kalangan mereka sendiri, yaitu dari kalangan bangsa arab, yang membacakan kepada mereka ayat-ayat-Nya, ayat-ayat Al-Qur'an, yang isinya menyucikan jiwa mereka yang beriman kepadanya; dan mengajarkan kepada mereka yang membuka diri menerima dan membenaran kerasulan beliau, kitab Al-Qur'an, dan hikmah yakni sunah nabi, meskipun sebelumnya, yakni sebelum kelahiran rasulullah di masa jahiliah, mereka, sebagian di antara para sahabat rasulullah benar-benar dalam kesesatan yang nyata. Keyakinan mereka menyimpang dari prinsip tauhid dan perilaku mereka bertentangan dengan nilai kemanusiaan, salah satunya mengubur anak perempuan hidup-hidup. 3. Selain mengutus kepada bangsa arab yang tidak bisa baca tulis, Allah juga mengutus rasulullah kepada bangsa-bangsa lain di luar bangsa arab, bahkan kepada seluruh dunia. Dan rasulullah juga diutus kepada kaum yang lain dari mereka di luar bangsa arab untuk masa yang tiada terbatas hingga hari kiamat, kaum yang belum berhubungan dengan mereka, karena hidup pada zaman dan tempat yang berbeda dengan mereka, sebagaimana disebutkan dalam Al-Qur'an, 'dan kami tidak mengutus engkau Muhammad melainkan untuk menjadi rahmat bagi seluruh alam. ' (lihat: surah al-anbiy'/21: 107). Dan dialah yang mahaperkasa, menciptakan dan menghancurkan jagat raya sekejap mata; mahabijaksana, tidak terburu menggunakan kekuasaan-Nya yang tiada terbatas untuk menghukum manusia yang berdosa."
  }
]