[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "2.-3. Allah-lah Yang mengutus kepada orang-orang Arab yang tidak bisa membaca, tidak memiliki kitab dan tidak ada kerasulan pada mereka, seorang rasul dari mereka kepada seluruh manusia, yang membacakan al-Quran kepada mereka, menyucikan mereka dari akidah-akidah rusak dan akhlak-akhlak buruk, mengajari mereka al-Quran dan asSunnah. Sesungguhnya mereka sebelum diutusnya Rasulullah berada di dalam penyimpangan yang nyata dari jalan kebenaran. Allah juga mengutus Rasul tersebut kepada kaum lain yang belum datang dan akan datang dari kalangan orang-orang Arab dan lainnya. Hanya Allah semata Yang Mahaperkasa, Yang berkuasa atas segala sesuatu lagi Mahabijaksana dalam perkataan dan perbuatanNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Rasul ini diutus juga kepada kaum Arab yang lain dan kaum non Arab yang belum datang dan yang akan datang. Sungguh Dia Maha Perkasa yang tidak ada seorang pun mampu mengalahkan-Nya, dan Maha Bijaksana dalam penciptaan-Nya, syariat-Nya dan takdir-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. وَءَاخَرِينَ مِنْهُمْ لَمَّا يَلْحَقُوا۟ بِهِمْ ۚ (dan (juga) kepada kaum yang lain dari mereka yang belum berhubungan dengan mereka) Yakni kaum yang belum pernah berinteraksi dengan mereka pada waktu itu, namun kelak akan berinteraksi dengan mereka. Yakni Rasulullah akan menyucikan mereka dan menyucikan kaum selain mereka, yaitu orang-orang beriman setelah generasi sahabat dari kaum Arab maupun selain Arab hingga datang hari kiamat. Imam Bukhari dan lainnya meriwayatkan dari Abu Hurairah, ia berkata: “Suatu hari kami duduk di majelis Rasulullah saat surat al-Jumu’ah diturunkan, maka Rasulullah membacanya; dan ketika sampai pada ayat (وَءَاخَرِينَ مِنْهُمْ لَمَّا يَلْحَقُوا۟ بِهِمْ) seseorang bertanya kepada beliau: “Hai Rasulullah, siapakah mereka yang belum pernah bertemu dengan kami ini?” maka Rasulullah meletakkan tangannya pada Salman al-Farisi seraya berkata: “Demi Dzat yang jiwaku berada di tangan-Nya, jika saja keimanan itu berdasarkan banyaknya lampu yang menerangi rumah-rumah niscaya orang-orang seperti dia ini pasti akan mendapatkan keimanan.” وَهُوَ الْعَزِيزُ الْحَكِيمُ (Dan Dialah Yang Maha Perkasa lagi Maha Bijaksana) Yakni memiliki kemuliaan dan kebijaksanaan yang tiada batas."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Dia menyucikan kaum-kaum lain di antara bangsa Arab dan dia juga diutus untuk mereka. Mereka adalah orang-orang (yang hidup) setelah generasi para sahabat sampai hari kiamat. Dialah Dzat yang Maha Menang, tidak ada yang dapat mengungguliNya dalam kekuasaan dan pemberian nubuwwah kepadanya (Muhammad). Dialah Dzat yang Maha Bijaksana dalam menciptakan dan memilihnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kepada yang lain di antara mereka} dan mengutusnya kepada kaum lain dari golongan orang Arab dan kaum lainnya {yang belum datang kepada mereka} belum datang kepada mereka setelahnya dan mereka yang akan datang setelahnya {Dialah Dzat Yang Maha perkasa lagi Maha bijaksana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3. Allah berfirman, “Dan (juga) kepada kaum yang lain dari mereka yang belum berhubungan dengan mereka.” Maksudnya, Allah memberi karunia pada kalangan lain selain mereka. Yaitu, kalangan yang tidak buta huruf yang datang setelah mereka dan juga dari kalangan ahli kitab, “yang belum berhubungan dengan mereka,” yaitu orang-orang yang bertemu dan langsung mendapatkan dakwah Rasulullah. Kemungkinan lain, mereka belum bertemu dari segi keutamaan. Kemungkinan lain, mereka belum bertemu dari segi masa. Yang jelas, kedua makna tersebut benar, karena manusia yang didatangkan seorang utusan di tengah-tengah mereka, mereka menyaksikan dan langsung berhadapan dengan dakwah rasul tersebut akan mendapatkan berbagai keistimewaan yang tidak mungkin disaingi oleh seorang pun selain mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Jumu’ah ayat 3: Allah mengabarkan bahwa Dia mengutus Rasul ini juga untuk kaum yang belakangan, yang tidak akan ada Rasul yang datang lagi kepada mereka. Ialah Rasul yang amanah untuk bangsa arab dan selain arab, maka mereka semua akan mengikuti petunjuk dan mensucikan mereka. Dikatakan bahwa yang mengikutinya (Rasul) adalah orang-orang yang memiliki keutamaan; Karena para sahabat adalah manusia yang paling utama dibandingkan yang datang setelah mereka. Dan Allah sajalah yang Maha Kuat, yang dengan kuasa dan kemampuan-Nya Allah teguhkan orang yang but abaca dan tulis ini (Muhammad ﷺ) untuk mengeluarkan umat ini bahkan bagi seluruh uma, dari kegelapan jahiliyyah dan kesesatan menuju kepada cahaya islam. Dialah Rasul yang memiliki kebijaksanaan yang nyata, yang ia dipilih oleh Allah atas semua manusia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala juga memberikan nikmat kepada kaum yang lain selain orang-orang Arab yang datang setelah mereka, dan dari kalangan Ahli Kitab yang belum berhubungan dengan mereka sehingga mereka beriman juga. Bisa juga maksudnya, bahwa mereka belum berhubungan dengan mereka dalam hal keutamaan (belum sampai seperti mereka dalam keutamaan). Dan bisa juga maksudnya, bahwa mereka belum berhubungan dengan mereka dalam hal waktu. Singkatnya, semua makna itu adalah benar, karena mereka yang mendapat kiriman rasul oleh Allah menyaksikan Rasul tersebut dan mengikuti dakwahnya, maka mereka memperoleh keutamaan dan kelebihan yang tidak dicapai oleh yang lain. Di antara keperkasaan dan kebijaksanaan-Nya adalah Dia tidak membiarkan hamba-hamba-Nya begitu saja, bahkan Dia mengutus rasul kepada mereka, memerintah dan melarang. Yang demikian termasuk karunia Allah yang besar yang Dia berikan kepada hamba-hamba-Nya yang Dia kehendaki, bahkan yang demikian merupakan nikmat-Nya yang paling besar daripada nikmat sehat, rezeki dan nikmat-nikmat duniawi lainnya. Oleh karena itu, tidak ada nikmat yang lebih besar daripada nikmat agama, karena di sanalah letak keberuntungan dan kebahagiaan yang abadi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Jumu’ah Ayat 3",
    "description": "Selain mengutus kepada bangsa arab yang tidak bisa baca tulis, Allah juga mengutus rasulullah kepada bangsa-bangsa lain di luar bangsa arab, bahkan kepada seluruh dunia. Dan rasulullah juga diutus kepada kaum yang lain dari mereka di luar bangsa arab untuk masa yang tiada terbatas hingga hari kiamat, kaum yang belum berhubungan dengan mereka, karena hidup pada zaman dan tempat yang berbeda dengan mereka, sebagaimana disebutkan dalam Al-Qur'an, 'dan kami tidak mengutus engkau Muhammad melainkan untuk menjadi rahmat bagi seluruh alam. ' (lihat: surah al-anbiy'/21: 107). Dan dialah yang mahaperkasa, menciptakan dan menghancurkan jagat raya sekejap mata; mahabijaksana, tidak terburu menggunakan kekuasaan-Nya yang tiada terbatas untuk menghukum manusia yang berdosa. 4. Demikianlah karunia Allah yang diberikan kepada siapa yang dia kehendaki seperti mengangkat rasulullah menjadi nabi dan rasul dan diutus kepada umat manusia seluruh alam; dan Allah memiliki karunia yang besar yang diberikan kepada hamba-hamba-Nya yang beriman."
  }
]