[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "4. Pengutusan Rasul kepada orang-orang Arab dan selainnya merupakan karunia dari Allah yang Allah berikan kepada siapa yang Dia kehendaki dari hamba-hambaNya. Hanya Allah semata pemilik karunia dan pemberian yang besar."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Hal itu -yakni diutusnya seorang Rasul kepada Arab dan non Arab- merupakan karunia Allah yang diberikan kepada yang dikehendaki-Nya, dan Allah mempunyai kebaikan yang besar. Di antara kebaikan-Nya yang besar adalah Dia mengutus Rasul umat ini kepada seluruh manusia."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "4. Pengutusan Nabi Muhammad kepada seluruh jin dan manusia yang merupakan perkara agung itu, adalah karunia yang Allah berikan kepada hamba-Nya yang Dia kehendaki. Hanya Allah yang memiliki karunia yang luas bagi makhluk-makhluk-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. وَءَاخَرِينَ مِنْهُمْ لَمَّا يَلْحَقُوا۟ بِهِمْ ۚ (dan (juga) kepada kaum yang lain dari mereka yang belum berhubungan dengan mereka) Yakni kaum yang belum pernah berinteraksi dengan mereka pada waktu itu, namun kelak akan berinteraksi dengan mereka. Yakni Rasulullah akan menyucikan mereka dan menyucikan kaum selain mereka, yaitu orang-orang beriman setelah generasi sahabat dari kaum Arab maupun selain Arab hingga datang hari kiamat. Imam Bukhari dan lainnya meriwayatkan dari Abu Hurairah, ia berkata: “Suatu hari kami duduk di majelis Rasulullah saat surat al-Jumu’ah diturunkan, maka Rasulullah membacanya; dan ketika sampai pada ayat (وَءَاخَرِينَ مِنْهُمْ لَمَّا يَلْحَقُوا۟ بِهِمْ) seseorang bertanya kepada beliau: “Hai Rasulullah, siapakah mereka yang belum pernah bertemu dengan kami ini?” maka Rasulullah meletakkan tangannya pada Salman al-Farisi seraya berkata: “Demi Dzat yang jiwaku berada di tangan-Nya, jika saja keimanan itu berdasarkan banyaknya lampu yang menerangi rumah-rumah niscaya orang-orang seperti dia ini pasti akan mendapatkan keimanan.” وَهُوَ الْعَزِيزُ الْحَكِيمُ (Dan Dialah Yang Maha Perkasa lagi Maha Bijaksana) Yakni memiliki kemuliaan dan kebijaksanaan yang tiada batas."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Keutamaan yang istimewa dengan mengutus Nabi ini pada masanya itu adalah keutamaan Allah yang diberikan kepada orang yang dikehendakiNya dari hamba-hambaNya yang terpilih. Allah adalah Dzat yang memiliki keutamaan paling agung yang tidak mungkin disamai oleh keutamaan atas hamba-hambaNya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Itulah karunia Allah yang dianugerahkan kepada siapa saja yang Dia kehendaki. Allah memiliki karunia yang agung"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4. Ini adalah salah satu keperkasaan dan kebijaksanaan Allah yang tidak membiarkan hamba-hambaNya begitu saja. Tapi Allah mengutus di tengah-tengah mereka seorang rasul yang memerintah dan melarang mereka. Itu adalah salah satu karunia agung dari Allah yang diberikan pada siapa saja yang dikehendaki. Karunia diutusnya seorang rasul lebih besar daripada nikmat kesehatan jasmani dan luasnya rizki bagi mereka. Tidak ada yang lebih baik dari kenikmatan agama yang merupakan sumber keberuntungan dan kebahagiaan abadi."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Jumu’ah ayat 4: Ketahuilah wahai manusia, bahwa diutusnya penutup para Rasul (Muhammad ﷺ) kepada manusia seluruhnya adalah karunia dan pemuliaan dari Allah atas mereka, dan Allah memulikan orang Arab; Dimana turunnya Al Qur’an dengan bahasa mereka, dan tidak diragukan lagi bahwa pengutusan Rasul ini adalah karunia dari Allah, Allah berikan bagi siapa yang dikehendaki dari makhluk-Nya, dan Allah lah yang memiliki karunia yang luas, tidak setara dengan apapun karunia-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu Nabi shallallahu 'alaihi wa sallam dan orang-orang yang disebutkan bersamanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Jumu’ah Ayat 4",
    "description": "Demikianlah karunia Allah yang diberikan kepada siapa yang dia kehendaki seperti mengangkat rasulullah menjadi nabi dan rasul dan diutus kepada umat manusia seluruh alam; dan Allah memiliki karunia yang besar yang diberikan kepada hamba-hamba-Nya yang beriman. 5. Allah mengecam manusia yang mendapat karunia-Nya menjadi ahli agama, tetapi tidak mengamalkannya. Perumpamaan orang-orang yang diberi tugas membawa taurat, menjadi ulama dan bertugas membimbing manusia beragama, kemudian mereka tidak membawanya, tidak mengamalkan agama dan tidak menjadikan dirinya teladan bagi umat adalah seperti keledai yang membawa kitab-kitab yang tebal, dirinya dibebani oleh pengetahuan agama, tetapi pengetahuan agama itu tidak membawa kebaikan apa pun bagi dirinya. Sangat buruk perumpamaan kaum yang mendustakan ayat-ayat Allah yang diwahyukan kepada nabi dan rasul-Nya. Dan Allah tidak akan pernah memberi petunjuk kepada orang-orang yang zalim, yang membiarkan dirinya gelap, padahal mereka memegang lampu."
  }
]