[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "5. Perumpamaan orang-orang Yahudi yang ditugaskan mengamalkan Taurat tetapi tidak melaksanakannya, adalah seperti keledai yang membawa kitab-kitab yang tidak tahu apa yang ada di dalamnya. Sangat buruklah perumpamaan bagi orang-orang yang mendustakan ayat-ayat Allah dan tidak mengambil manfaat darinya. Allah tidak membimbing kaum yang zhalim yang melampaui batasan-batasan Allah dan menyimpang dari ketaatan kepadaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. \"Permisalan orang-orang Yahudi yang dibebani untuk melaksanakan apa yang ada di dalam Taurat lalu mereka meninggalkan apa yang dibebankan kepada mereka, seperti keledai yang mengangkut kitab-kitab yang besar, tidak mengerti apa yang dibebankan kepadanya, apakah itu kitab atau lainnya. Amat buruk permisalan suatu kaum yang mendustakan ayat-ayat Allah, dan Allah tidak memberikan taufik kepada kaum yang zalim untuk mendapatkan kebenaran.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "5. Perumpamaan orang-orang Yahudi yang mendapat mengajaran kitab Taurat dan diperintah untuk mengamalkannya, namun mereka tidak mengamalkannya; seperti keledai yang mengangkut banyak kitab, namun keledai itu tidak memahami isinya. Betapa buruk perumpamaan bagi orang-orang yang mendustakan ayat-ayat al-Qur’an dan mukjizat-mukjizat Rasulullah. Allah tidak akan memberi petunjuk bagi orang-orang yang enggan mengikuti kebenaran, karena mereka telah menzalimi hak Allah, para rasul-Nya dan kitab-kitab-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. مَثَلُ الَّذِينَ حُمِّلُوا۟ التَّوْرَىٰةَ (Perumpamaan orang-orang yang dipikulkan kepadanya Taurat) Perumpamaan ini dibuat Allah bagi orang-orang Yahudi yang tidak mau mengamalkan kitab Taurat. Yakni mereka dibebani untuk menegakkan Taurat dan menjalankan isi kandungannya. ثُمَّ لَمْ يَحْمِلُوهَا(kemudian mereka tiada memikulnya) Yakni tidak mengamalkan kandungannya dan tidak mentaati perintah yang ada di dalamnya. كَمَثَلِ الْحِمَارِ يَحْمِلُ أَسْفَارًۢا ۚ( adalah seperti keledai yang membawa kitab-kitab yang tebal) Kata (الأسفار) adalah bentuk jamak dari (السفر) yaitu kitab yang besar. Dan keledai tidak memahami apakah yang dibebankan di atas punggungnya itu merupakan kitab atau sampah. بِئْسَ مَثَلُ الْقَوْمِ الَّذِينَ كَذَّبُوا۟ بِـَٔايٰتِ اللهِ ۚ( Amatlah buruknya perumpamaan kaum yang mendustakan ayat-ayat Allah itu) Yakni keledai yang diumpamakan seperti orang-orang Yahudi adalah permisalan yang paling buruk yang dimisalkan bagi orang-orang yang mendustakan. Maka janganlah kalian manjadi seperti mereka hai orang-orang beriman. Allah mendahulukan permisalan ini sebagai peringatkan bagi orang-orang yang meninggalkan Rasulullah berdiri berkhutbah di atas mimbar untuk pergi melakukan perdagangan, serta bagi semua orang yang enggan mendengarkan khutbah padahal ia mendengarnya, sebagaimana disebutkan dalam hadits: “Barangsiapa yang berbicara pada hari Jum’at ketika imam sedang berkhutbah, maka ia seperti seekor keledai yang mengangkut kitab-kitab tebal. Dan barangsiapa yang berkata kepada orang itu ‘diamlah’ maka tidak ada (pahala) shalat jum’at baginya.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Perumpamaan orang-orang Yahudi yang dibebankan amal ibadah dalam Taurat, lalu tidak mengamalkan kewajiban Taurat itu sebagaimana keledai yang membawa kitab yang bermanfaat. Perumpamaan buruk ini adalah perumpamaan kaum yang mendustakan dalil-dalil, mukjizat, dan ayat-ayat yang menunjukkan tentang kenabian Muhammad SAW. Allah tidak membantu (menunjukkan) kaum yang menzalimi dirinya dengan kekufuran dan kebohongan kepada kebenaran dan kebaikan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Perumpamaan} perumpamaaan {orang-orang yang dibebani tugas Taurat} Dibebani untuk mengamalkan apa yang ada di dalamnya {kemudian tidak mengamalkannya} tidak mengamalkan apa saja yang ada di dalamnya {adalah seperti keledai yang membawa kitab-kitab} kitab-kitab {Sangat buruk} sangat buruk {perumpamaan kaum yang mendustakan ayat-ayat Allah. Allah tidak memberi petunjuk kepada kaum yang zalim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5. Ketika menyebutkan nikmatNya yang diberikan pada umat ini, umat yang ditengah-tengahnya diutus seorang nabi yang tidak bisa baca-tulis, serta berbagai keistimewaan dan sifat baik yang diberikan yang tidak bisa didapatkan oleh umat yang lain padahal mereka adalah umat yang tidak tahu baca-tulis, umat yang mengungguli orang-orang dahulu dan terkemudian hingga ahli kitab yang mengira bahwa mereka adalah ulama rabbani dan para pendeta yang terdahulu. Selanjutnya Allah menyebutkan, bahwa orang-orang yang membawa kitab Taurat dari kalangan Yahudi dan juga Nasrani dan diperintahkan agar dipelajari dan diamalkan namun mereka tidak membawa dan menunaikan apa yang diperintahkan. Dengan demikian mereka tidak memiliki keutamaan. Mereka tidak ubahnya seperti keledai yang membawa barang berupa kitab-kitab ilmu di atas punggungnya. Bisakah keledai memanfaatkan kitab-kitab yang dibawa di atas punggungnya itu? Apakah karena sebab itu mereka berhak mendapatkan keutamaan? Ataukah jatah mereka hanya sekedar membawa saja. Inilah perumpamaan ulama ahli kitab. Mereka adalah orang-orang yang tidak mengajarkan isi Taurat, yang diantara perintah terbesar dan teragungnya adalah mengikuti Muhammad serta kabar gembira bagi orang yang beriman dengan al-Quran yang dibawanya. Orang yang sifatnya seperti ini tidak bisa memanfaatkan Taurat melainkan hanya kerugian dan tegaknya hujjah atas diri mereka sendiri. Perumpamaan ini persis seperti kondisi mereka “Amatlah buruknya perumpamaan kaum yang mendustakan ayat-ayat Allah itu.” Yang menunjukkan atas kebenaran rasul kita dan kebenaran yang dibawanya, “dan Allah tiada memberi petunjuk kepada kaum yang zhalim.” Maksudnya, tidak menunjukkan mereka pada maslahat-maslahat mereka selama kezhaliman dan pembangkangan masih lekat sebagai sifat mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Jumu’ah ayat 5: Ketika yahudi meninggalkan amalan yang ada dalam Taurat, dan tidak mengimani Muhammad ﷺ, Allah memisalkan mereka yang bahwasanya dibebani agar beramal dengan Taurat, yang di dalamnya terkandung dari sifat Rasul ﷺ dan dituntut untuk mengimani serta menjadi penolongnya, kemudia mereka tidak mengikuti apa yang sesuai dengan isi dari Taurat; Maka mereka ini semisal dengan keledai yang membawa kitab yang bermanfaat dan banyak, akan tetapi tidak memperoleh apa-apa kecuali hanya kebosanan dan kerja keras saja, dan permisalan seperti apa lagi yang lebih buruk dari mereka, contohnya : Mereka mendustakan ayat-ayat Allah yang datang dari lisan Rasulullah ﷺ, dan Allah tidak menyetujui dan memberikan petunjuk kepada kaum yang dzalim kepada diri-diri mereka sendiri, dengan kesyirikan, kekufuran, dan mendustakan para Nabi. Dan adapat diambil hikmah dari ayat ini, bahwa sudah semestinya bagi yang membaca Al Qur’an untuk beramal dengan apa yang terkandung padanya, agar supaya tidak memiliki sifat yang buruk sebagaimana yahudi ini."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala menyebutkan nikmat-Nya kepada umat ini, dimana Dia telah mengutus kepada mereka nabi yang ummi (buta huruf) dan telah melebihkan mereka dengan berbagai kelebihan dan keutamaan yang tidak dicapai oleh seorang pun, padahal mereka adalah ummat yang ummi tetapi bisa mengalahkan generasi terdahulu dan yang akan datang, bahkan mengalahkan Ahli Kitab yang menganggap bahwa mereka adalah para ulama rabbani dan para pendeta yang senior, maka Allah Subhaanahu wa Ta'aala sebutkan bahwa orang-orang yang Allah bebankan kepada mereka kitab Taurat yaitu orang-orang Yahudi, demikian pula orang-orang Nasrani yang Allah bebankan kepada mereka kitab Injil, Dia memerintahkan mereka untuk mempelajari dan mengamalkannya, namun mereka tidak mengamalkannya, maka sesungguhnya mereka tidak memiliki keutamaan apa-apa, bahkan perumpamaan mereka adalah seperti keledai yang membawa kitab-kitab tebal di punggungnya, dimana keledai-keledai itu tidak dapat mengambil faedah dari kitab-kitab itu. Apakah mereka akan mendapatkan keutamaan hanya karena memikul kitab-kitab ilmu ataukah yang mereka dapatkan hanya ‘memikul saja’? Seperti inilah keadaan para ulama Yahudi yang tidak mengamalkan Taurat, yang di antara isinya adalah perintah mengikuti Nabi Muhammad shallallahu 'alaihi wa sallam, kabar gembira tentang kedatangannya dan beriman kepada apa yang dibawanya berupa Al Qur’an. Bukankah yang didapat oleh orang yang seperti ini keadaannya hanyalah kekecewaan, kerugian, dan penegakkan hujjah terhadapnya? Perumpamaan ini sangat sesuai dengan keadaan mereka. Yakni mengamalkannya. Maksudnya, tidak mengamalkan isinya, antara lain tidak membenarkan kedatangan Nabi Muhammad shallallahu 'alaihi wa sallam. Dalam hal tidak bermanfaatnya kitab-kitab itu baginya. Yang menunjukkan kebenaran Rasul kita Muhammad shallallahu 'alaihi wa sallam dan apa yang dibawanya. Dia tidak akan memberi petunjuk kepada hal yang bermaslahat bagi mereka selama sifat zalim dan keras kepala masih melekat pada mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Jumu’ah Ayat 5",
    "description": "Allah mengecam manusia yang mendapat karunia-Nya menjadi ahli agama, tetapi tidak mengamalkannya. Perumpamaan orang-orang yang diberi tugas membawa taurat, menjadi ulama dan bertugas membimbing manusia beragama, kemudian mereka tidak membawanya, tidak mengamalkan agama dan tidak menjadikan dirinya teladan bagi umat adalah seperti keledai yang membawa kitab-kitab yang tebal, dirinya dibebani oleh pengetahuan agama, tetapi pengetahuan agama itu tidak membawa kebaikan apa pun bagi dirinya. Sangat buruk perumpamaan kaum yang mendustakan ayat-ayat Allah yang diwahyukan kepada nabi dan rasul-Nya. Dan Allah tidak akan pernah memberi petunjuk kepada orang-orang yang zalim, yang membiarkan dirinya gelap, padahal mereka memegang lampu. 6. Para pemuka yahudi tidak hanya tidak mengamalkan agamanya, tetapi juga menilai dirinya kekasih Allah, padahal mereka kufur kepada-Nya. Katakanlah, wahai nabi Muhammad kepada para tokoh agama yahudi, 'wahai orang-orang yahudi bani na'ir, bani quraizah dan bani qainuq'! jika kamu mengira dengan penuh keyakinan bahwa kamulah kekasih Allah, karena menjadi bangsa pilihan, bukan orang-orang yang lain, seperti kaum muslim, maka harapkanlah kematianmu, karena kematian membuktikan apakah kamu kekasih Allah atau bukan, jika kamu orang yang benar, dalam pengakuanmu itu. '."
  }
]