[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "6. Katakanlah (wahai Rasul) kepada orang-orang yang berpegang kepada agama Yahudi yang diselewengkan, “Bila kalian mengaku secara dusta bahwa kalian adalah kekasih Allah dan selain kalian bukan, maka silakan berharap kematian bila kalian memang orang-orang yang benar dalam apa yang kalian klaim bahwa cinta Allah adalah milik kalian.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Katakanlah -wahai Rasul-, “Wahai orang-orang yang tetap memeluk agama Yahudi setelah diselewengkan, jika kalian menganggap bahwa kalian adalah kekasih Allah, Dia mengkhususkan kalian sebagai kekasih-Nya bukan manusia lainnya, maka berharaplah kematian untuk kalian agar Allah menyegerakan karamah (kemuliaan) yang dikhususkan untuk kalian -sebagaimana yang kalian klaim- jika kalian adalah orang-orang yang jujur dalam pengakuan kalian sebagai kekasih Allah, bukan manusia lainnya.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "6-7. Hai Rasulullah, katakanlah kepada orang-orang Yahudi yang mengaku bahwa mereka adalah kekasih-kekasih Allah: “Jika kalian mengaku sebagai para kekasih Allah dan Dia tidak memiliki kekasih selain kalian; maka berharaplah agar kalian meninggal jika pengakuan kalian itu benar.” Dan mereka tidak akan mengaharapkan kematian karena mereka sangat tamak terhadap kehidupan dunia, sebab mereka banyak melakukan dosa-dosa. Dan Allah Maha Mengetahui orang-orang yang zalim."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. قُلْ يٰٓأَيُّهَا الَّذِينَ هَادُوٓا۟ إِن زَعَمْتُمْ أَنَّكُمْ أَوْلِيَآءُ لِلَّـهِ مِن دُونِ النَّاسِ (Katakanlah: “Hai orang-orang yang menganut agama Yahudi, jika kamu mendakwakan bahwa sesungguhnya kamu sajalah kekasih Allah bukan manusia-manusia yang lain) Yang dimaksud dengan (الذين هادوا) yakni orang-orang Yahudi. Ayat ini diturunkan karena orang-orang Yahudi mengaku lebih mulia daripada manusia lainnya, dan mengaku sebagai para kekasih Allah dan anak-anak-Nya. maka Allah memerintahkan Rasulullah untuk mengatakan kepada mereka hal ini untuk membantah pengakuan mereka yang batil ini. فَتَمَنَّوُا۟ الْمَوْتَ(maka harapkanlah kematianmu) Agar kalian mendapatkan kemuliaan yang kalian akui. إِن كُنتُمْ صٰدِقِينَ (jika kamu adalah orang-orang yang benar) Yakni benar dalam pengakuan kalian itu. sebab orang yang mengetahui bahwa ia termasuk penghuni surga maka ia akan berharap untuk pergi dari dunia ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Katakanlah wahai Nabi SAW: “Wahai kaum Yahudi, jika kalian menganggap bahwa kalian adalah para kekasih Allah dan orang-orang yang setia kepadaNya daripada manusia lainnya, Maka berharaplah kalian kepada Allah untuk mematikan kalian agar kalian mendapatkan apa yang kalian harapkan untuk bertemu denganNya, jika kalian adalah orang-orang membenarkan atas anggapan bahwa kalian adalah wali-wali Allah. Wali adalah orang yang mementingkan akhirat dan jalan awalnya adalah kematian, maka harapkanlah hal itu”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Wahai orang-orang Yahudi} orang-orang Yahudi {jika kalian mengira bahwa kalian adalah kekasih Allah bukan orang lain, maka harapkanlah kematian, jika kalian adalah orang-orang yang benar”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6. Di antara kezhaliman dan pembangkangan Yahudi adalah mereka mengetahui bahwa mereka berada di atas kebatilan, namun mereka mengklaim berada di atas kebenaran. Mereka juga mengklaim bahwa hanya merekalah para kekasih Allah, bukan kaum lain. Karena itu Allah memerintahkan RasulNya untuk berkata kepada mereka, “jika kamu mendakwakan bahwa sesungguhnya kamu sajalah kekasih Allah bukan manusia-manusia yang lain, maka harapkanlah kematianmu.” Ini adalah perintah yang ringan, sebab seandainya mereka mengetahui bahwa mereka berada di atas kebenaran, tentu mereka tidak terdiam menghadapi tantangan seperti ini yang dijadikan Allah sebagai bukti atas kebenaran mereka. Jika mereka benar-benar mengharapkan kematian berarti mereka benar, namun jika tidak, berarti mereka dusta belaka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Jumu’ah ayat 6: Katakanlah wahai Nabi kepada mereka orang-orang Yahudi : Jika kalian mengklaim bahwasanya kalian adalah kekasih Allah dan yang dicintai oleh-Nya, bukan manusia yang lain, maka serulah diri-diri kalian dengan kebinasaan dan laknat jika kalian orang-orang yang benar dalam klaim kalian. Dan Nabi ﷺ telah melarang dari berharap kematian, kecuali jika untuk tantangan dan mubahalah (saling mendoakan agar dilaknat Allah); Sama saja apakah mubahalah dengan melalui kedua lisan (masing-masing) sebagaimana yang terjadi antara Rasul ﷺ dan utusan nashrani dari Najran, dan ia telah disebutkan dalam ayat 61 di surat Al Imran, atau mubahalah yang dituntut dari satu lisan sebagaimana yang dituntut kepada yahudi dalam ayat ini, dan juga sebagaimana dalam ayat 94 dalam surat Al Baqarah; Dimana mereka dituntut menyeru atas diri mereka sendiri dengan laknat dan kebinasaan jika mereka berdusta. Mereka tidak akan mau melakukan, karena mereka telah yakin bahwa mereka adalah pendusta. Dalam Musnad Ahmad, dari Ibnu Abbas : Seandainya yahudi berharap dengan kematian, sungguh dia akan benar-benar mati, dan dihadapan mereka ada tempat khusus bagi mereka di nereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Di antara kezaliman orang-orang Yahudi dan keras kepalanya mereka adalah bahwa mereka sudah tahu berada di atas kebatilan namun menyangka di atas kebenaran dan menganggap bahwa diri mereka adalah para wali Allah. Oleh karena itu, Allah memerintahkan Rasul-Nya untuk mengatakan sebagaimana yang disebutkan dalam ayat di atas. Karena wali Allah itu lebih mengutamakan akhirat daripada dunia. Ini adalah perintah yang ringan, karena jika mereka mengetahui bahwa mereka berada di atas kebenaran, tentu mereka tidak akan mundur terhadap tantangan ini yang Allah jadikan sebagai dalil atau bukti terhadap kebenarannya. Bahwa kamu adalah para wali Allah dan bahwa kamu berada di atas kebenaran."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Jumu’ah Ayat 6",
    "description": "Para pemuka yahudi tidak hanya tidak mengamalkan agamanya, tetapi juga menilai dirinya kekasih Allah, padahal mereka kufur kepada-Nya. Katakanlah, wahai nabi Muhammad kepada para tokoh agama yahudi, 'wahai orang-orang yahudi bani na'ir, bani quraizah dan bani qainuq'! jika kamu mengira dengan penuh keyakinan bahwa kamulah kekasih Allah, karena menjadi bangsa pilihan, bukan orang-orang yang lain, seperti kaum muslim, maka harapkanlah kematianmu, karena kematian membuktikan apakah kamu kekasih Allah atau bukan, jika kamu orang yang benar, dalam pengakuanmu itu. '7. Namun demikian, mereka tidak mungkin mengharapkan kematian. Dan mereka, tokoh-tokoh yahudi di madinah yang mengaku kekasih Allah tidak akan pernah mengharapkan kematian itu selamanya disebabkan kejahatan yang telah mereka perbuat dengan tangan mereka sendiri. Hal ini karena hati kecil mereka mengakui dirinya salah dan menyadari bahwa kematian akan mengungkapkan siapa yang salah dan siapa yang benar. Dan Allah maha mengetahui pengakuan, perasaan, dan kegelisahan orang-orang yang zalim, yaitu orang-orang yang menganiaya dirinya sendiri dengan berbuat kejahatan, padahal mereka mengetahuinya."
  }
]