[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "8. Katakanlah, “Sesungguhnya kematian yang kalian berlari menjauh darinya, tidak ada tempat berlari darinya, ia pasti datang kepada kalian saat ajal kalian tiba, kemudian kalian kembali pada Hari Kiamat kepada Allah Yang mengetahui hal ghaib dan apa yang hadir, lalu Allah mengabari kalian apa yang telah kalian kerjakan dan akan membalas kalian atasnya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Katakanlah -wahai Rasul- kepada orang-orang Yahudi itu, “Sesungguhnya kematian yang kalian lari darinya, pasti akan mendatangi kalian, tidak ada keraguan, baik cepat ataupun lambat. Kemudian kalian pada hari Kiamat dikembalikan kepada Allah, Yang mengetahui hal yang gaib dan yang nyata, keduanya tak ada yang luput dari-Nya, lalu Dia memberitahukan kepada kalian apa yang telah kalian lakukan di dunia dan membalas kalian atas perbuatan tersebut."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "8. Hai Rasulullah, katakanlah kepada orang-orang Yahudi: Kematian yang kalian hindari itu pasti akan mendatangi kalian, kemudian kalian akan dibangkitkan kembali untuk menuju Allah Yang Maha Mengatahui segala yang tersembunyi dan yang terlihat. Lalu Allah akan mengabarkan kepada kalian segala yang telah kalian perbuat di dunia, agar Allah membalas perbuatan itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. قُلْ إِنَّ الْمَوْتَ الَّذِى تَفِرُّونَ مِنْهُ فَإِنَّهُۥ مُلٰقِيكُمْ ۖ (Katakanlah: “Sesungguhnya kematian yang kamu lari daripadanya, maka sesungguhnya kematian itu akan menemui kamu) Yakni kematian itu akan mendatangi kalian dari arah yang kalian jauhi, dan kalian akan menghadapinya. ثُمَّ تُرَدُّونَ إِلَىٰ عٰلِمِ الْغَيْبِ وَالشَّهٰدَةِ(kemudian kamu akan dikembalikan kepada (Allah), yang mengetahui yang ghaib dan yang nyata) Yaitu ketika hari kiamat. فَيُنَبِّئُكُم بِمَا كُنتُمْ تَعْمَلُونَ(lalu Dia beritakan kepadamu apa yang telah kamu kerjakan”) Yang berupa amalan-amalan buruk, lalu Allah akan membalas kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8. Katakanlah kepada mereka wahai Nabi: “Sesungguhnya kematian yang mereka benci itu pasti akan datang kepada mereka, bukan sesuatu yang mustahil. Kemudian kepada Dzat yang Maha Mengetahui sesuatu yang ghaib dan perasaan-perasaan yang tampak, lalu memberitahu kalian tentang amal perbuatan kalian dan membalas kalian atas perbuatan kalian. Ini adalah ancaman dan janji.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Sesungguhnya kematian yang kalian lari darinya pasti akan menemui kalian. Kemudian kalian akan dikembalikan kepada Dzat Yang Maha Mengetahui yang ghaib dan yang nyata, lalu Dia memberitakan kepada kalian apa yang selama ini kalian kerjakan”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8. Begitulah, meski mereka tidak mengharapkan kematian karena perbuatan yang mereka lakukan bahkan mereka akan lari dari kematian sejauh mungkin, tapi hal itu tidak bisa menyelamatkan mereka, karena kematian pasti menemui mereka karena telah ditentukan dan dituliskan oleh Allah pada para hambaNya. Kemudian setelah kematian dan sempurnanya ajal, semua manusia dikembalikan pada Hari Kiamat menuju Allah Yang Maha Mengetahui yang ghaib dan yang nyata kemudian akan memberitahukan amal perbuatan mereka, baik dan buruknya, sedikit dan banyaknya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Jumu’ah ayat 8: Katakan wahai Nabi Allah kepada mereka yahudi : Sesungguhnya kematian yang kalian enggan untuk berharap, maka kematian itu akan menjadi kenyataan menimpa kalian tanpa mengenal tempat, kemudian kalian akan dikembalikan setelah kalian mati menuju Yang Maha Mengetahui yang ghaib di langit maupun di bumi, dan kalian akan dikabarkan atas apa yang kalian amalkan di dunia, kemudian kalian akan dibalas sesuai dengan amalan-amalan kalian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang baik maupun yang buruk."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Jumu’ah Ayat 8",
    "description": "Kematian yang tidak diharapkan itu pasti akan datang. Katakanlah, wahai nabi Muhammad kepada para pemuka yahudi di madinah, 'sesungguhnya kematian yang kamu lari daripadanya, karena kamu menyadari bahwa kematian akan mengungkapkan siapa yang salah dan siapa yang benar, ia, kematian, meskipun dijauhi pasti menemui kamu, di mana pun kamu berada; kemudian kamu, melalui pintu kematian, akan dikembalikan kepada Allah untuk mempertanggung-jawabkan semua perbuatan selama hidup di dunia. Dia yang maha mengetahui yang gaib, yang tidak terlihat, dan yang nyata, yang kasat mata; lalu dia akan memberitahukan kepada kamu dengan lengkap dan menyeluruh apa yang telah kamu kerjakan, baik kejahatan maupun kebaikan. '9. Allah menghimbau orang-orang beriman agar segera ke masjid untuk salat berjamaah apabila azan sudah dikumandangkan. Wahai orang-orang yang beriman! di mana pun dan kapan pun kamu berada. Apabila telah diseru dengan dikumandangkan azan untuk melaksanakan salat jumat pada hari jumat, atau salat lima waktu maka segeralah kamu mengingat Allah, dengan melaksanakan salat yang khusyuk serta zikir dan doa sesudah salat; dan tinggalkanlah jual beli dan berbagai kegiatan lainnya. Yang demikian itu, meninggalkan sementara berbagai kegiatan untuk segera melaksanakan salat wajib berjamaah di masjid, lebih baik bagi kamu dibandingkan dengan menunda salat, jika kamu mengetahui keutamaan salat di awal waktu dengan berjamaah di masjid."
  }
]