[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "9. Wahai orang-orang yang membenarkan Allah dan RasulNya serta melaksanakan syariatNya, bila muadzin menyerukan shalat pada Hari Jum’at, maka berangkatlah untuk menyimak khutbah dan menunaikan shalat, tinggalkanlah jual beli dan segala urusan yang menyibukkan kalian darinya. Apa yang Allah perintahkan kepada kalian ini adalah lebih baik bagi kalian. Bila kalian mengetahui kemaslahatan diri kalian, maka lakukanlah. Dalam ayat ini terkandung dalil yang mewajibkan untuk menghadiri Shalat Jum’at dan mendengar khutbah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Wahai orang-orang yang beriman kepada Allah dan menjalankan apa yang disyariatkan untuk mereka, jika seorang muazin telah memanggil untuk salat pada hari Jum’at setelah khatib naik ke atas mimbar maka bersegeralah menuju masjid-masjid untuk menghadiri khutbah dan salat. Tinggalkanlah jual beli, agar tidak melalaikan kalian dari ketaatan. Perintah ini yaitu bersegera dan meninggalkan jual beli setelah azan untuk salat Jum'at adalah baik bagi kalian -wahai orang-orang yang beriman- jika kalian mengetahui hal itu, maka kerjakanlah apa yang diperintahkan Allah kepada kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "9-10. Hai orang-orang beriman, jika azan untuk shalat jum’at telah dikumandangkan, maka bersegeralah pergi untuk mendengarkan khutbah dan mendirikan shalat, dan tinggalkanlah kegiatan jual beli dan segala yang menyibukkan kalian dari shalat. Perkara yang besar ini lebih baik bagi kalian jika kalian mengetahui kebaikan dan keridhaan Allah yang ada padanya. Dan jika kalian telah mendirikan shalat maka kembalilah menyebar di muka bumi, dan carilah rezeki dari Allah dengan usaha kalian, serta perbanyaklah zikir kepada Allah agar kalian dapat meraih keridhaan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. يٰٓأَيُّهَا الَّذِينَ ءَامَنُوٓا۟ إِذَا نُودِىَ لِلصَّلَوٰةِ (Hai orang-orang beriman, apabila diseru untuk menunaikan shalat) Yang dimaksud adalah seruan azan ketika khatib telah duduk di mimbar pada hari Jum’at, sebab pada masa Rasulullah tidak ada seruan untuk shalat jum’at selain seruan tersebut. Sedangkan azan pertama pada hari Jum’at adalah seruan yang di mulai pada masa khalifah Utsman bin Affan dengan persetujuan para sahabat ketika kota Madinah semakin meluas. فَاسْعَوْا۟ إِلَىٰ ذِكْرِ اللهِ(maka bersegeralah kamu kepada mengingat Allah) Yakni bergegaslah menuju zikir kepada Allah, yaitu khutbah dan shalat Jum’at di masjid. Dan sebelumnya sibukkanlah kalian dengan persiapannya seperti mandi, berwudhu, dan berangkat. وَذَرُوا۟ الْبَيْعَ ۚ( dan tinggalkanlah jual beli) Yakni tinggalkanlah jual beli dan muamalat lainnya, sebab jika azan telah di kumandangkan untuk shalat jum’at maka jual beli haram dilakukan. ذٰلِكُمْ (Yang demikian itu) Yakni bergegas menuju zikir kepada Allah dan meninggalkan jual beli. خَيْرٌ لَّكُمْ(lebih baik bagimu jika kamu mengetahui) Yakni lebih baik daripada berjual beli dan lebih baik dari tidak bergegas, sebab dengan menjalankan perintah terdapat pahala yang besar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9. Wahai orang-orang yang beriman, jika dikumandangkan adzan kedua untuk melaksanakan shalat ketika khatib duduk di atas mimbar pada hari jum’at, maka berjalanlah kalian untuk melaksanakan shalat dan mendengarkan khutbah, karena di dalamnya nama Allah disebut. Tinggalkanlah kegiatan jual-beli kalian dan semua hal yang menyibukkan kalian dari shalat. Usaha kalian untuk melaksanakan shalat dan meninggalkan jual-beli itu lebih baik bagi kalian daripada kesibukan dunia dan muamalah kalian. Di dalamnya terdapat pahala yang agung jika kalian mengetahui hakikat dua hal yaitu kebaikan dan keburukan. Jika kalian mengetahui bahwa hal itu adalah kebaikan, maka lakukanlah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, apabila diseru} orang yang azan menyeru {untuk melaksanakan shalat pada hari Jumat, maka segeralah} maka bergegaslah {mengingat Allah} mendengarkan khutbah jum’at dan shalat jum’at {dan tinggalkanlah} tinggalkanlah {jual beli. Yang demikian itu lebih baik bagi kalian jika kalian mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9. Allah memerintahkan para hambaNya agar menghadiri dan bersegera menunaikan Shalat Jumat setelah diserukan. Yang dimaksud bersegera dalam ayat ini adalah segera menunaikannya, memperhatikan dan menjadikannya sebagai puncak kesibukannya, bukan dengan berlarian mendatangi tempat shalat yang justru dilarang. Allah berfirman, “Dan tinggalkanlah jual beli.” Maksudnya, tinggalkan jual beli ketika kalian diseru untuk Shalat Jumat dan bersegeralah menuju Shalat Jumat, karena “yang demikian itu lebih baik bagimu jika kamu mengetahui.” Yang di sisi Allah itu lebih baik dan lebih kekal dan siapa pun yang lebih mengutamakan dunia dari pada akhirat , maka sungguh dia merugi dengan kerugian sebenarnya padahal dia mengira akan mendatangkan keuntungan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Jumu’ah ayat 9: Allah menganjurkan hamba-hambanya yang beriman untuk menjawab panggilan shalat pada hari jumat, Allah berkata : Wahai oang-orang yang beriman kepada Allah dan Rasul-Nya ﷺ, jika telah dikumandangkan adzan oleh muadzin, dan hadapan kalian imam telah naik mimbar pada hari jumat untuk melaksanakan shalat, jangan lewatkan untuk berdzikir kepada Allah yaitu shalat dan mendengarkan khutbah, tinggalkan oleh kalian muamalah perdagangan, dan ketahuilah bahwa yang diperintahkan kepada kalian, lebih baik dari sibuk dengan berdagang dan mencari keduniaan jika kalian mengetahui apa balasan akhirnya. Dan dinamakan hari jum’at karena sebab berkumpulnya kaum muslimin dan shalat di dalam masjid dan mendengarkan khutbah, dan dahulu dinamakan dengan hari urubah (persatuan arab)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memerintahkan hamba-hamba-Nya yang mukmin untuk menghadiri shalat Jum’at dan bersegera kepadanya. Maksud bersegera di sini adalah bukan pergi dengan buru-buru, tetapi memperhatikannya dan menjadikannya di atas kesibukan yang lain. Yaitu melaksanakan shalat Jum’at. Maksudnya,apabila imam telah naik mimbar dan muazzin telah azan di hari Jum'at, maka kaum muslimin wajib bersegera memenuhi panggilan muazzin itu dan meninggalkan semua pekerjaannya. Daripada sibuk berjual-beli. Bahwa apa yang ada di sisi Allah lebih baik dan lebih kekal, dan bahwa barang siapa yang mengutamakan dunia di atas akhirat, maka sesungguhnya ia telah rugi dengan kerugian yang hakiki."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Jumu’ah Ayat 9",
    "description": "Allah menghimbau orang-orang beriman agar segera ke masjid untuk salat berjamaah apabila azan sudah dikumandangkan. Wahai orang-orang yang beriman! di mana pun dan kapan pun kamu berada. Apabila telah diseru dengan dikumandangkan azan untuk melaksanakan salat jumat pada hari jumat, atau salat lima waktu maka segeralah kamu mengingat Allah, dengan melaksanakan salat yang khusyuk serta zikir dan doa sesudah salat; dan tinggalkanlah jual beli dan berbagai kegiatan lainnya. Yang demikian itu, meninggalkan sementara berbagai kegiatan untuk segera melaksanakan salat wajib berjamaah di masjid, lebih baik bagi kamu dibandingkan dengan menunda salat, jika kamu mengetahui keutamaan salat di awal waktu dengan berjamaah di masjid. 10. Apabila salat wajib telah dilaksanakan di awal waktu dengan berjamaah di masjid; maka bertebaranlah kamu di bumi, kembali bekerja dan berbisnis; carilah karunia Allah, rezeki yang halal, berkah, dan melimpah dan ingatlah Allah banyak-banyak ketika salat maupun ketika bekerja atau berbisnis agar kamu beruntung, menjadi pribadi yang seimbang, serta sehat mental dan fisik."
  }
]