[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ingatlah ketika mereka datang dari atas kalian, dari bagian atas lembah dari arah timur, dan dari bawah kalian di perut lembah dari arah barat, saat itu pandangan mata terbelalak karena dahsyatnya kebingungan dan kecemasan kalian, hati kalian naik ke tenggorokan karena beratnya rasa takut kalian, keputusasaan menerjang orang-orang munafik, desas-desus berhembus dan kalian berprasangka buruk kepada Allah bahwa Dia tidak menolong agamaNya dan tidak meninggikan kalimatNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Yaitu ketika orang-orang kafir mendatangi kalian dari atas lembah dan dari sisi bawahnya, dari arah timur maupun barat. Ke manapun mata memandang pastilah tampak musuh, dan hati telah naik sampai ke tenggorokan karena besarnya rasa takut, dan kalian menyangka terhadap Allah dengan berbagai prasangka yang bermacam-macam, kadang kalian menyangka akan mendapat pertolongan, kadang merasa putus asa dari Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "10-11. Dan ingatlah ketika orang-orang kafir Makkah bersama para sekutu mereka datang dari atas kalian, sedangkan orang-orang kafir Najd datang dari bawah kalian, dan orang-orang Yahudi bersekongkol dengan mereka untuk menyerang orang-orang beriman, dan mengepung Madinah. Ingatlah ketika penglihatan menjadi goyah akibat keadaan yang menakutkan, dan hati orang-orang munafik menjadi tergoncang dan mereka berprasangka buruk terhadap Allah bahwa Dia tidak akan menolong agama dan pasukan-Nya. ketika itulah orang-orang beriman diuji dengan ujian yang berat, dan terbedakan antara orang yang beriman dari orang munafik. Dan mereka sangat tergoncang oleh ketakutan dan kelaparan. Aisyah meriwayatkan: “ketika mereka datang kepadamu dari atas dan dari bawahmu, dan ketika tidak tetap lagi penglihatan(mu) dan hatimu naik menyesak sampai ke tenggorokan dan kamu menyangka terhadap Allah dengan bermacam-macam purbasangka. (al-Ahzab: 10). Itu adalah ketika terjadi perang Khandaq (Ahzab).” (Shahih al-Bukhari 7/461, kitab peperangan-peperangan Rasulullah, bab perang Khandaq. Dan Shahih Muslim 4/2316, no. 3020, kitab tafsir)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. إِذْ جَآءُوكُم مِّن فَوْقِكُمْ ((Yaitu) ketika mereka datang kepadamu dari atas) Yakni dari atas lembah, dari arah timur. وَمِنْ أَسْفَلَ مِنكُمْ(dan dari bawahmu) Yakni dari bawah lembah, dari arah barat. وَإِذْ زَاغَتِ الْأَبْصٰرُ(dan ketika tidak tetap lagi penglihatan(mu)) Mata mereka terbelalak heran karena kengerian yang terjadi dan kebingungan. وَبَلَغَتِ الْقُلُوبُ الْحَنَاجِرَ(dan hatimu naik menyesak sampai ke tenggorokan) Yakni jantung mereka naik dari tempat asalnya, dan kekagetan dan ketakutan mereka sampai pada tenggorokan mereka. Ini merupakan hiperbola yang dipakai dalam kalimat ini, dan maknanya adalah mereka sangat ketakutan dan kebanyakan mereka terkaget-kaget. وَتَظُنُّونَ بِاللهِ الظُّنُونَا۠( dan kamu menyangka terhadap Allah dengan bermacam-macam prasangka) Yakni sebagian mereka mengira dan mengharapkan kemenangan, dan sebagian yang lain mengira selain itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10. Ketika para musuh mengepung kalian dari jurang yang paling tinggi, dari arah timur, dan dari jurang yang paling rendah dari arah barat, ketika penglihatan mulai terpana sebab dahsyatnya kebingungan dan kegundahan mereka, hati yang menyesak sampai ke tenggorokan, sebagai gambaran dari dahsyatnya ketakutan, kepanikan, dan kelemahan, mereka menyangka-nyangka dengan berbagai sangkaan, mereka putus asa, dan ragu akan janji Allah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika mereka datang kepada kalian dari arah atas kalian} dari atas lembah dari arah timur {dan bawah kalian} dari perut lembah dari arah barat {ketika penglihatan kalian berpaling} penglihatan berpaling dari segala sesuatu sehingga tidak bisa melihat kecuali kepada musuh, karena ketakutan dan kengerian yang sangat dahsyat {hati kalian menyesak sampai ke tenggorokan, dan kalian berprasangka terhadap Allah dengan beragai sangkaan} berbagai sangkaan yang berbeda, sebagian mereka berprasangkan tentang pertolongan, dan sebagian lain berprasangka berbeda dari itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9-11. Allah mengingatkan hamba-hambaNya yang beriman tentang nikmatNya kepada mereka dan mendorong mereka untuk mensyukurinya, yaitu ketika bala tentara negeri Makkah dan hijaz mendatangi mereka dari atas mereka, sedangkan bala tentara negeri Nejed dari arah bawah mereka; dan mereka pun bersepakat dan saling berjanji untuk menghabisi Rasul dan para sahabat. Dan ini terjadi dalam perang Khandaq, dan mereka didukung oleh beberapa kelompok kaum Yahudi yang berada di sekitar Madinah. Mereka pun datang dengan tentara yang sangat besar dan pasukan sekutu. Rasulullah pun membuat parit mengelilingi Madinah. Maka pasukan sekutu mengepung Madinah dan nkeadaan pun makin menjadi sangat genting, hati terasa menyesak ke tenggorokan hingga prasangka buruk dari banyak orang (kaum Mukminin) telah mencapai puncaknya saat mereka melihat keadaan yang sangat menjepit dan berbagai kesengsaraan bertubi-tubi. Pengepungan terhadap kota Madinah ini berlangsung dalam waktu yang cukup lama dan keadaannya seperti yang dijelaskan oleh Allah, “dan ketika tidak tetap lagi penglihatan (mu), dan hatimu naik menyesak samppai ke tenggorokan dan kamu menyangka terhadap Allah dengan bermacam-macam prasangka,” maksudnya, prasangka-prasangka buruk, yaitu bahwa Allah tidak akan menolong agamaNya dan tidak akan menyempurnakan kalimatNya, “di situlah orang-orang Mukmin dijuji,” dengan cobaan yang sangat berat, “dan digoncangkan dengan goncangan yang sangat,” dengan rasa takut, rasa gelisah dan kelaparan, agar iman mereka tampak dan keyakinan mereka bertambah. Maka benar-benar tampaklah, dengan segala puji bagi Allah, keimanan dan kuatnya keyakinan mereka yang membuat mereka mengungguli umat-umat terdahulu dan yang akan datang kemudian. Dan di saat kesempitan makin hebat dan kesengsaraan makin mencekik, maka iman mereka pun menjadi ainul yaqin. \"Dan tatkala orang-orang mukmin melihat golongan-golongan yang bersekutu itu, mereka berkata: \"Inilah yang dijanjikan Allah dan Rasul-Nya kepada kita\". Dan benarlah Allah dan Rasul-Nya. Dan yang demikian itu tidaklah menambah kepada mereka kecuali iman dan ketundukan\". (Al-Ahzab:22). Saat itulah kemunafikan kaum munafik menjadi jelas dan apa yang mereka sembunyikan selama ini menjadi nyata, Allah berfirman,"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahzab ayat 10: Ingatlah ketika datang kepada kalian musuh-musuh dari atas lembah dari arah timur, dan juga dari bawah lembah dari arah barat, yang kemudian yahudi menolong mereka dari bani quraidzah yang berpaling dari perjanjian bersama Rasul ﷺ, dan mengepung (musuh-musuh) di Mandinah dari segala penjuru. Akan tetapi Allah menolong dan membuat mereka mundur."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dari atas lembah dan dari bawahnya, dari timur dan barat. Melihat musuh ada di berbagai arah. Maksudnya ialah menggambarkan bagaimana hebatnya perasaan takut dan perasaan gentar pada waktu itu. Seperti menyangka bahwa Allah tidak akan memenangkan agama-Nya dan tidak akan meninggikan kalimat-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 10",
    "description": "Wahai kaum mukmin, Allah mengirim para malaikat untuk mendukungmu pada perang khandak, yaitu ketika mereka, yakni tentara musyrik, datang kepadamu dari atas, yaitu dari timur, dan tentara yahudi bani quraizah datang dari bawahmu, yaitu dari barat, dan ketika penglihatan-Mu terpana oleh besarnya pasukan mereka dan hal itu menimbulkan rasa takut yang hebat sehingga hatimu menyesak sampai ke tenggorokan, dan bahkan sebagian dari kamu terjangkiti sifat munafik sehingga berprasangka yang bukan-bukan terhadap Allah seakan dia tidak mampu memenangkan pasukan mukmin atas pasukan kafir. 11. Orang-orang mukmin terpana melihat besarnya jumlah pasukan kafir. Di situlah orang-orang mukmin diuji dan sengaja digoncangkan hatinya dengan goncangan yang dahsyat agar terlihat jelas siapa di antara mereka yang benar-benar beriman dan siapa yang munafik."
  }
]