[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dalam keadaan yang sangat mencekam tersebut, iman orang-orang yang beriman diuji dan orang-orang diseleksi, orang Mukmin dibedakan dari orang munafik, mereka ditimpa goncangan yang sangat karena ketakutan dan kecemasan, supaya iman mereka terbukti dan keyakinan mereka bertambah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Dalam keadaan demikian di perang Khandaq, orang-orang beriman mendapat ujian dengan apa yang mereka dapatkan dari kepungan musuh-musuh mereka, dan mereka gemetar dengan amat sangat karena ketakutan, dengan ujian ini jelaslah mana orang-orang mukmin dan mana orang-orang munafik."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "11. هُنَالِكَ ابْتُلِىَ الْمُؤْمِنُونَ (Disitulah diuji orang-orang mukmin) Yakni diuji dengan peperangan, kelaparan, pengepungan, dan pertempuran; agar menjadi jelas siapa diantara mereka yang benar-benar beriman dan siapa yang munafik. وَزُلْزِلُوا۟ زِلْزَالًا شَدِيدًا(dan digoncangkan (hatinya) dengan goncangan yang sangat) Sebagian mereka tergoncang dalam jiwanya dan sebagian tergoncang dalam agamanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Itulah cobaan yang diujikan kepada orang-orang mukmin dengan hal-hal yang berat seperti ketakutan kelaparan dan pengepungan agar dapat diketahui mana orang yang mukmin tapi munafik. Serta banyak diuji dengan ketakutan yang sangat, banyaknya musuh, dan pengepungan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Di situlah orang-orang mukmin diuji} ketika itulah diuji {dan diguncangkan} diguncangkan {dengan guncangan} dengan guncangan {yang dahsyat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9-11. Allah mengingatkan hamba-hambaNya yang beriman tentang nikmatNya kepada mereka dan mendorong mereka untuk mensyukurinya, yaitu ketika bala tentara negeri Makkah dan hijaz mendatangi mereka dari atas mereka, sedangkan bala tentara negeri Nejed dari arah bawah mereka; dan mereka pun bersepakat dan saling berjanji untuk menghabisi Rasul dan para sahabat. Dan ini terjadi dalam perang Khandaq, dan mereka didukung oleh beberapa kelompok kaum Yahudi yang berada di sekitar Madinah. Mereka pun datang dengan tentara yang sangat besar dan pasukan sekutu. Rasulullah pun membuat parit mengelilingi Madinah. Maka pasukan sekutu mengepung Madinah dan nkeadaan pun makin menjadi sangat genting, hati terasa menyesak ke tenggorokan hingga prasangka buruk dari banyak orang (kaum Mukminin) telah mencapai puncaknya saat mereka melihat keadaan yang sangat menjepit dan berbagai kesengsaraan bertubi-tubi. Pengepungan terhadap kota Madinah ini berlangsung dalam waktu yang cukup lama dan keadaannya seperti yang dijelaskan oleh Allah, “dan ketika tidak tetap lagi penglihatan (mu), dan hatimu naik menyesak samppai ke tenggorokan dan kamu menyangka terhadap Allah dengan bermacam-macam prasangka,” maksudnya, prasangka-prasangka buruk, yaitu bahwa Allah tidak akan menolong agamaNya dan tidak akan menyempurnakan kalimatNya, “di situlah orang-orang Mukmin dijuji,” dengan cobaan yang sangat berat, “dan digoncangkan dengan goncangan yang sangat,” dengan rasa takut, rasa gelisah dan kelaparan, agar iman mereka tampak dan keyakinan mereka bertambah. Maka benar-benar tampaklah, dengan segala puji bagi Allah, keimanan dan kuatnya keyakinan mereka yang membuat mereka mengungguli umat-umat terdahulu dan yang akan datang kemudian. Dan di saat kesempitan makin hebat dan kesengsaraan makin mencekik, maka iman mereka pun menjadi ainul yaqin. \"Dan tatkala orang-orang mukmin melihat golongan-golongan yang bersekutu itu, mereka berkata: \"Inilah yang dijanjikan Allah dan Rasul-Nya kepada kita\". Dan benarlah Allah dan Rasul-Nya. Dan yang demikian itu tidaklah menambah kepada mereka kecuali iman dan ketundukan\". (Al-Ahzab:22). Saat itulah kemunafikan kaum munafik menjadi jelas dan apa yang mereka sembunyikan selama ini menjadi nyata, Allah berfirman,"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahzab ayat 11: Allah menguji orang-orang yang beriman dengan ujian yang berat, dan dari peristiwa ini nampaklah mukmin yang jujur dan munafik yang buruk."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Agar tampak jelas, siapa yang ikhlas dan siapa yang tidak. Ketika itu kelihatan sekali –wal hamdulillah- keimanan kaum mukmin, iman mereka menjadi bertambah dan keyakinan mereka meningkat sehingga mereka mengungguli kaum mukmin di masa lalu dan di masa mendatang. Ketika itu, kaum mukmin berkata, “Inilah yang dijanjikan Allah dan Rasul-Nya, dan benarlah Allah dan Rasul-Nya.” Peristiwa itu malah menambah iman mereka. Berbeda dengan orang-orang munafik, mereka malah berkata, “Yang dijanjikan Allah dan Rasul-Nya kepada Kami hanya tipu daya belaka.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 11",
    "description": "Orang-orang mukmin terpana melihat besarnya jumlah pasukan kafir. Di situlah orang-orang mukmin diuji dan sengaja digoncangkan hatinya dengan goncangan yang dahsyat agar terlihat jelas siapa di antara mereka yang benar-benar beriman dan siapa yang munafik. 12. Dan ingatlah ketika orang-orang munafik yang sengaja menyembu-nyikan kekafirannya dan orang-orang yang hatinya berpenyakit serta lemah imannya berkata, 'apa yang dijanjikan Allah dan rasul-Nya kepada kami hanya tipu daya belaka. Dia pasti tidak akan mampu menolong pasukan mukmin. ' mereka berkata demikian karena mereka melihat jumlah pasukan kafir jauh lebih besar daripada pasukan mukmin."
  }
]