[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tatkala orang-orang munafik dan orang-orang yang memendam keragu-raguan dalam hati, yaitu orang-orang yang lemah imannya berkata, “Allah dan RasulNya tidak menjanjikan kepada kita pertolongan dan kemenangan memperoleh kekuasaan, kecuali hanyalah janji yang batil dan tipu daya, jangan mempercayainya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Pada hari itu orang-orang munafik dan orang-orang yang imannya lemah, yang terdapat keraguan di dalam hatinya mereka berkata, “Apa yang dijanjikan oleh Allah dan Rasul-Nya berupa kemenangan dan kekuasaan di bumi tidak lain hanyalah kebohongan yang tidak berdasar.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "12. Dan bagian dari prasangka buruk itu adalah orang-orang munafik, dan orang-orang yang ragu dan yang keimanan di hatinya belum teguh berkata: “Janji yang Allah dan rasul-Nya berikan kepada kita hanyalah janji palsu yang tidak akan terpenuhi.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "12. وَإِذْ يَقُولُ الْمُنٰفِقُونَ وَالَّذِينَ فِى قُلُوبِهِم مَّرَضٌ (Dan (ingatlah) ketika orang-orang munafik dan orang-orang yang berpenyakit dalam hatinya berkata) Mereka adalah orang yang selalu ragu dan tergoncang. مَّا وَعَدَنَا اللهُ وَرَسُولُهُۥٓ( Allah dan Rasul-Nya tidak menjanjikan kepada kami) Dengan kemenangan dan kejayaan. إِلَّا غُرُورًا(melainkan tipu daya) Yakni ketika mereka menggali parit, ternyata terdapat batu besar yang menghalangi mereka untuk menggali. Maka Rasulullah memukulnya dengan kapak, dan terbelah sebagian, seraya bersabda: “Allah akan memberiku kekuasaan bangsa Persia.” Kemudian Rasulullah kembali memukulnya dan terbelah sebagian, seraya berkata: “Allah akan memberiku kekuasaan bangsa Romawi.” Maka sebagian orang munafik berkata: “Bagaimana dia menjanjikan kita kekuasaan Kisra dan Qaishar (bangsa Persia dan Romawi) sedangkan kita masih merasa takut untuk pergi buang hajad sendirian.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12. Ingatlah wahai Nabi, ketika orang-orang munafik berkata, yaitu mereka yang di dalam hatinya ada keraguan dan keyakinannya lemah: “Allah dan rasul-Nya tidak menjanjikan kepada kami tentang pertolongan, dan kemenangan kecuali hanya janji yang bathil dan tipuan saja, kebohongan yang tidak ada buktinya. Nabi ketika perang Khandak memecah/memukul batu dengan kapak, sehingga ada dua belahan yang melayang. Kemudian Nabi berkata: “Sesungguhnya Allah menjanjikan kepadaku kepemilikan Persi dan Romawi.” Kemudian orang-orang munafik berkata: “Allah menjanjikan kami kerajaan Kasra dan qaishar, sehingga salah satu di antara kami sampai takut untuk pergi memenuhi hajatnya.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "(Ingatlah) ketika orang-orang munafik dan orang-orang yang di hatinya terdapat penyakit} keraguan dan keyakinan yang lemah {berkata,“Apa yang dijanjikan Allah dan RasulNya kepada kami hanyalah tipu daya belaka”} kepalsuan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "12. Inilah kebiasaan kaum munafik di saat ditimpa kesengsaraan dan cobaan, imannya tidak kokoh, dia melihat dengan akal pikirannya yang sangat pendek kepada kondisi yang terkini, dan dia selalu membenarkan dugaannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahzab ayat 12: Ingatlah wahai Nabi Allah ketika orang-orang munafik berkata beserta orang-orang yang dihatinya ada keraguan : Tidaklah janji Allah dan Rasul-Nya kecuali kebathilan tanpa kenyataan dan tidak ada bukti atas apa yang kami di sini ditimpa sesuatu yang menakutkan. Maka Allah menampakkan pada peristiwa ini kemunafikan sebagian orang-orang munafik yang sebelumnya mereka tidak diketahui (kemunafikannya), dan Allah juga nampakkan lemahnya keimanan sebagian orang-orang yang beriman yang mereka condong untuk beribadah kepada Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni lemah keyakinannya. Inilah kebiasaan orang-orang munafik ketika menghadapi cobaan, imannya tidak kokoh, dan melihat dengan pandangannya yang pendek kepada keadaan saat itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 12",
    "description": "Dan ingatlah ketika orang-orang munafik yang sengaja menyembu-nyikan kekafirannya dan orang-orang yang hatinya berpenyakit serta lemah imannya berkata, 'apa yang dijanjikan Allah dan rasul-Nya kepada kami hanya tipu daya belaka. Dia pasti tidak akan mampu menolong pasukan mukmin. ' mereka berkata demikian karena mereka melihat jumlah pasukan kafir jauh lebih besar daripada pasukan mukmin. 13. Demikianlah perkataan kaum munafik. Dan ingatlah juga ketika segolongan di antara mereka berkata dengan penuh hasutan, 'wahai penduduk yasrib! tidak ada tempat bagimu untuk menyelamatkan diri jika kamu tetap bersama Muhammad dan tentaranya, maka kembalilah kamu ke rumah. ' dan lihatlah bahwa akibat dari upaya hasutan itu sebagian dari mereka, yakni pasukan mukmin, terpengaruh sehingga meminta izin pulang kepada nabi dengan berkata, 'sesungguhnya rumah-rumah kami terbuka tanpa penjaga, ' padahal rumah-rumah itu tidak terbuka; mereka hanyalah membuat-buat alasan karena ketakutam sehingga hendak lari dari peperangan itu."
  }
]