[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ingatlah (wahai Nabi) ucapan sekelompok orang-orang munafik, yang memanggil-manggil orang-orang Madinah, “Wahai penduduk Yastrib (nama Madinah yang lama), kalian tidak bisa bertahan dalam perang yang merugikan, maka pulanglah ke rumah kalian di dalam kota Madinah.” Lalu ada sekelompok orang-orang munafik yang lain yang meminta izin kepada Nabi untuk pulang ke rumah mereka dengan alasan bahwa rumah mereka membutukuhkan dan tidak terjaga, maka mereka mengkhawatirkannya. Padahal sebenarnya tidak demikian, tujuan mereka dengan itu hanyalah berlari dari medan perang."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "13. Dan ingatlah -wahai Rasul- tatkala segolongan dari orang-orang munafik berkata kepada penduduk Madinah, “Wahai penduduk Yaṡrib (nama kota madinah sebelum Islam), tidak ada tempat bagi kalian di dekat parit, maka pulanglah ke kediaman kalian.” Dan sebagian dari mereka meminta izin dari Nabi -ṣallallāhu 'alaihi wa sallam- untuk pulang ke rumah-rumah mereka dengan alasan bahwa rumah-rumah mereka terbuka untuk musuh, padahal sebenarnya tidak terbuka sebagaimana yang mereka klaim, akan tetapi sebenarnya mereka dengan alasan bohong ini ingin lari dari musuh."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "13. Hai Rasulullah, ingatlah ketika sebagian orang munafik berkata kepada orang-orang beriman: “Hai penduduk Madinah, kalian tidak akan di Madinah dengan aman, maka kembalilah ke tempat tinggal kalian dan tinggalkanlah Muhammad.” Dan sebagian orang munafik meminta izin dari Rasulullah untuk pergi meninggalkan peperangan dengan alasan rumah mereka tidak ada yang melindungi sehingga mereka khawatir akan di datangi musuh atau pencuri. Akan tetapi yang mereka inginkan sebenarnya hanyalah lari dari peperangan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "13. وَإِذْ قَالَت طَّآئِفَةٌ مِّنْهُمْ (Dan (ingatlah) ketika segolongan di antara mreka berkata) Dari dari golongan orang-orang munafik. يٰٓأَهْلَ يَثْرِبَ لَا مُقَامَ لَكُمْ(Hai penduduk Yatsrib (Madinah), tidak ada tempat bagimu) Yakni di tempat para pasukan ini. فَارْجِعُوا۟ ۚ( maka kembalilah kamu) Orang-orang munafik menuruh mereka untuk pergi dari tempat pasukan perang Rasulullah agar mereka kembali ke rumah-rumah mereka di Madinah. وَيَسْتَـْٔذِنُ فَرِيقٌ مِّنْهُمُ النَّبِىَّ(Dan sebahagian dari mereka minta izin kepada Nabi (untuk kembali pulang)) Yakni golongan lainnya yang memiliki iman yang lemah. إن بيوتنا عورة Yakni rumah-rumah kami terbengkalai tanpa ada yang melindunginya, kami takut musuh akan menyerangnya, dan kami khawatir terhadap keluarga kami. وَمَا هِىَ بِعَوْرَةٍ ۖ (Dan rumah-rumah itu sekali-kali tidak terbuka) Maka Allah mendustakan alasan yang mereka sebutkan itu. إِن يُرِيدُونَ إِلَّا فِرَارًا (mereka tidak lain hanya hendak lari) Yakni mereka hanya ingin lari dari peperangan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13. Wahai Nabi, ingatlah ketika sekelompok orang munafik berkata: “Wahai penduduk Madinah,tidak ada tempat yang aman untuk kalian di perkemahan selama perang Khandak ini. Maka pulanglah kalian ke Madinah agar kalian selamat.” Kemudian sekelompok dari mereka meminta izin kepada Nabi dengan berkata: “Sesungguhnya rumah kami tidak tertutup, kami takut keamanan rumah musuh kami. Sehingga mereka berbuat nifak kepada Allah bahwa rumah mereka tidak tertutup/terkunci, sebenarnya mereka hanya takut terbunuh dalam perang"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{(Ingatlah) ketika segolongan di antara mereka berkata,“Wahai penduduk Yatsrib (Madinah), tidak ada tempat bagi kalian} tidak ada tempat bagi kalian di sini {Maka kembalilah” Sebagian kelompok dari mereka meminta izin kepada Nabidengan berkata,“Sesungguhnya rumah-rumah kami terbuka} sepi dan lengang, tidak ada yang menjaganya dari musuh {Padahal rumah-rumah itu tidak terbuka. Mereka tidak menginginkan apapun kecuali lari} lari dari peperangan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "13. “Dan ketika berkata segolongan” dari kaum menafik setelah berkeluh kesah dan kesabaran mereka telah memudar sehingga mereka juga menjadi orang-orang yang melemahkan semangat. Mereka tidak sabar dengan diri mereka sendiri dan juga tidak melepaskan manusia dari kejahatan mereka. Golongan ini mengatakan, “Hai penduduk Yatsrib.” Yang mereka maksud adalah, wahai penduduk Madinah! Mereka menyeru para penduduk Madinah dengan nama negeri (yang menunjukkan tentang asal usul penamaannya), sebagai isyarat bahwa agama dan ukhuwah imaniyah sama sekali tidak mempunyai nilai dalam hati mereka, dan bahwa yang mendorong mereka untuk melakukan hal itu hanyalah seruan biasa. “Wahai penduduk Yatsrib, tidak ada tempat bagimu,” maksudnya, pada tempat kalian yang kalian tuju di luar Madinah. Pada saat itu mereka bermarkas di balik parit (KHandaq) dan di luar Madinah. “Maka kembalilah kamu,” ke Madinah. Golongan ini melemahkan semangat jihad dan menjelaskan bahwa mereka sama sekali tidak mempunyai kekuatan untuk memerangi musuh mereka, dan mereka mengajak untuk meninggalkan peperangan. Golongan ini merupakan golongan terburuk dan paling berbahaya. Dan ada golongan lain di bawah mereka, yaitu golongan yang diliputi oleh jiwa pengecut dan rasa takut, dan mereka lebih suka kalau terpisah dari barisan. Maka mereka pun mulai mengemukakan berbagai alasan palsu. Mereka adalah orang yang dikatakan oleh Allah, “Dan sebagian dari mereka minta izin kepada Nabi (untuk kembali pulang) dengan berkata, ‘Sesungguhnya rumah-rumah kami terbuka’,” maksudnya, terancam bahaya, dan kami khawatir kalau ia diserang oleh musuh sedangkan kami tidak ada di sana. Maka izinkanlah kami, agar kami pulang dan menjaganya. Mereka adalah para pendusta dalam hal ini. “Dan rumah-tumah itu sekali-kali tidak terbuka, mereka tidak lain hanyalah hendak,” maksudnya, tujuan mereka tidak lain, “kecuali lari,” namun mereka menjadikan ucapan tadi sebagai cara dan alasan bagi mereka. Mereka adalah orang-orang yang imannya sangat tipis, sama sekali tidak bisa bertahan di dalam menghadapi dahsyatnya cobaan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahzab ayat 13: Ingatlah wahai Nabi Allah ketika satu kelompok menyeru yaitu dari golongan orang-orang munafik penduduk Madinah dengan berkata : Wahai penduduk Madinah, tidak ada gunanya keberadaan kalian di sini; Sungguh tempat perang ini merugikan kalian, maka kembalilah kalian menuju rumah-rumah kalian agar terhindar dari bahaya. Kemudian datang jamaah yang lain dari orang-orang munafik meminta izin kepada Nabi untuk kembali kerumah mereka, merekalah yang Allah singkap kebohongan mereka, dan Allah menjelaskan bahwa rumahnya untuk berlindung, bahkan mereka ingin lari dari peperangan takut atas diri-diri mereka dari kematian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu kaum munafik. Ketika mereka keluh kesah, kurang kesabarannya, sehingga menjadi orang-orang yang mengendorkan semangat kaum mukmin. Mereka melupakan nama yang baru bagi kota itu, yaitu Madinah. Hal ini menunjukkan bahwa agama dan persaudaraan iman tidak memiliki arti apa-apa dalam hati mereka. Ke rumah-rumahmu di Madinah. Ketika itu mereka keluar bersama Nabi shallallahu 'alaihi wa sallam ke gunung Sila’ yang berada di luar Madinah untuk berperang. Golongan kaum munafik ini adalah golongan yang paling buruk dan paling merugikan, melumpuhkan jihad dan jelas sekali, bahwa mereka tidak memiliki kemampuan untuk melawan musuh. Selain golongan ini ada pula golongan yang lain, yang berada di belakang, mereka berada di belakang karena rasa takut dan sifat pengecut, mereka lebih suka di belakang barisan, sehingga mereka mengemukakan berbagai alasan yang batil agar dimaafkan sebagaimana yang dijelaskan dalam lanjutan ayat di atas. Yakni dalam bahaya, dan kami mengkhawatirkan serangan musuh terhadapnya, sedangkan kami tidak berada di sana. Oleh karena itu, izinkanlah kepada kami untuk pulang, agar kami dapat menjaga rumah kami. Ucapan mereka ini sebagaimana dalam ayat di atas adalah dusta. Iman mereka lemah, dan tidak kokoh ketika menghadai fitnah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 13",
    "description": "Demikianlah perkataan kaum munafik. Dan ingatlah juga ketika segolongan di antara mereka berkata dengan penuh hasutan, 'wahai penduduk yasrib! tidak ada tempat bagimu untuk menyelamatkan diri jika kamu tetap bersama Muhammad dan tentaranya, maka kembalilah kamu ke rumah. ' dan lihatlah bahwa akibat dari upaya hasutan itu sebagian dari mereka, yakni pasukan mukmin, terpengaruh sehingga meminta izin pulang kepada nabi dengan berkata, 'sesungguhnya rumah-rumah kami terbuka tanpa penjaga, ' padahal rumah-rumah itu tidak terbuka; mereka hanyalah membuat-buat alasan karena ketakutam sehingga hendak lari dari peperangan itu. 14. Demikianlah lemahnya iman dalam hati orang-orang yang terpengaruh hasutan kaum munafik itu. Dan kalau yasrib diserang musuh dari segala penjuru, dan mereka diminta untuk murtad dan membuat kekacauan dengan memerangi kaum mukmin, niscaya mereka mengerjakannya; dan hanya sebentar saja mereka menunggu untuk melakukan hal itu tanpa berpikir panjang. Mereka amat cinta dunia dan takut mati sehingga tidak heran bila mereka membuat alasan palsu agar diizinkan tidak ikut berperang."
  }
]