[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Seandainya pasukan Ahzab itu masuk ke madinah dari segala arah penjurunya, kemudian orang-orang munafik itu diminta untuk menyekutukan Allah dan meninggalkan islam, niscaya mereka akan mengiyakan permintaan itu dengan cepat, mereka tidak akan tertinggal sesaatpun untuk berbuat syirik."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Seandainya musuh masuk kota Madinah dari segala penjuru dan meminta kepada mereka untuk kembali kepada kekufuran dan kesyirikan kepada Allah, niscaya mereka akan mengabulkan permintaan musuh mereka itu, dan tidaklah mereka menghindar dari kemurtadan dan kembali kepada kekufuran kecuali hanya sebentar saja."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "14-15. Seandainya orang-orang kafir memasuki kota Madinah dari segala penjuru, kemudian mereka meminta orang-orang munafik untuk keluar dari agama Islam, niscaya mereka akan segera memenuhi permintaan itu tanpa menundanya sedikitpun. Sungguh mereka telah berjanji kepada Allah melalui tangan Rasul-Nya sebelum terjadi perang Khandaq bahwa mereka tidak akan lari dari peperangan. Dan janji kepada Allah akan dipertanggung-jawabkan pemenuhannya pada hari kiamat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "14. وَلَوْ دُخِلَتْ عَلَيْهِم مِّنْ أَقْطَارِهَا (Kalau (Yatsrib) diserang dari segala penjuru) Yakni andai saja rumah-rumah mereka itu diserang musuh. Atau andai kota Madinah diserang dari segala arah. ثُمَّ سُئِلُوا۟ الْفِتْنَةَ(kemudian diminta kepada mereka supaya murtad) Yakni diminta untuk berkhianat terhadap orang-orang beriman dan membuka jalan bagi musuh. Pendapat lain mengatakan yakni jika mereka diminta untuk berperang atas nama kabilah. لَاٰتَوْهَا(niscaya mereka mengerjakannya) Yakni niscaya mereka akan menyepakatinya. وَمَا تَلَبَّثُوا۟ بِهَآ إِلَّا يَسِيرًا(dan mereka tiada akan bertangguh untuk murtad itu melainkan dalam waktu yang singkat) Bahkan mereka akan segara menjalankannya dan pada keadaan ini tidak akan beralasan bahwa rumah-rumah mereka tidak terjaga."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14. Jika Madinah telah dikepung oleh tentara musuh dari segala penjuru, kemudian orang-orang munafik itu diminta untuk keluar dari agama Islam dan memerangi orang muslim pasti mereka melakukannya. Mereka tidak akan berfikir panjang, dan mereka tidak akan bertangguh untuk murtad kecuali hanya dalam waktu yang singkat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Jika rumah mereka diserang dari segala penjuru} jika pasukan yang berkumpul itu masuk ke Madinah dari segala arah {kemudian mereka diminta untuk melakukan fitnah} kembali menjadi kafir dan membunuh orang-orang mukmin {niscaya mereka mengerjakannya} sungguh mereka akan melakukannya dengan segera tanpa peduli {Mereka tidak menunda permintaan itu} mereka tidak tahan untuk menerima kekufuran {kecuali hanya sebentar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "14. “Kalau diserang,” maksudnya, Madinah diserang, “dari segala penjuru” maksudnya, kalau seandainya norang-orang kafir memasuki Madinah dari segala penjurunya dan mereka menguasainya; dan hal ini tidak terjadi; lalu mereka diminta untuk “fitnah,” maksudnya, berpaling dari agama mereka (murtad) dan kembali kepada agama orang-orang yang menguasai (Madinah) dan memenangkan (peperangan), “Niscaya mereka mengerjakannya,” maksudnya, tentu mereka tiada akan menunda untuk murtad itu melainkan dalam waktu yang singkat,” maksudnya, mereka tidak mempunyai sikap menolak dan tidak pula sikap berpegang teguh kepada agama. Bahkan dengan hanya karena musuh dapat menguasai, mereka pun rela memberikan apa yang diminta, dan setuju dengan kekafiran mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahzab ayat 14: 14-15. Walaupun seandainya orang-orang musyrik Madinah masuk dan menyerbu kemudian meminta orang-orang munafik untuk menyekutukan Allah dan kufur kepada Nabi-Nya ﷺ, sungguh mereka akan memenuhi seruan mereka dengan segera."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang dimaksud dengan melakukan fitnah ialah murtad, atau memerangi orang Islam. Mereka tidak memiliki kekuatan dan kekokohan di atas agama, bahkan dengan berkuasanya musuh, mereka segera memberikan apa yang musuh inginkan. Seperti inilah keadaan mereka. Padahal, mereka telah berjanji kepada Allah untuk tidak mundur, sebagaimana diterangkan dalam ayat selanjutnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 14",
    "description": "Demikianlah lemahnya iman dalam hati orang-orang yang terpengaruh hasutan kaum munafik itu. Dan kalau yasrib diserang musuh dari segala penjuru, dan mereka diminta untuk murtad dan membuat kekacauan dengan memerangi kaum mukmin, niscaya mereka mengerjakannya; dan hanya sebentar saja mereka menunggu untuk melakukan hal itu tanpa berpikir panjang. Mereka amat cinta dunia dan takut mati sehingga tidak heran bila mereka membuat alasan palsu agar diizinkan tidak ikut berperang. 15. Dan sungguh, sebelum itu, yaitu pada perang uhud, mereka telah berjanji kepada Allah di hadapan rasulullah bahwa mereka tidak akan berbalik ke belakang atau mundur dari medan perang. Dan mereka lupa bahwa perjanjian dengan Allah akan diminta pertanggungjawabannya di hari kiamat kelak."
  }
]