[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sungguh sebelumnya orang-orang munafik itu telah berjanji kepada Allah melalui tangan rosul-Nya sebelum perang Khandak untuk tidak lari jika mereka mengikuti peperangan dan tidak tertinggal darinya bila mereka diajak berjihad, akan tetapi mereka mengkhianati janji mereka, dan Allah akan menghisab mereka atas perbuatan mereka dan meminta pertanggungjawaban mereka atas janji mereka, karena perjanjian dengan Allah harus dipertangungjawabkan dan dihisab atasnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Sebelumnya orang-orang munafik pernah berjanji kepada Allah setelah pelarian mereka dari peperangan pada perang Uhud, jika Allah membiarkan mereka menyaksikan perang yang lain lagi niscaya mereka akan ikut berperang melawan musuh dan tidak akan lari karena rasa takut dari musuh mereka. Akan tetapi mereka mengingkari janji. Seorang hamba itu akan dimintai pertanggungjawaban atas janjinya terhadap Allah, dan niscaya ia akan ditanya tentang hal itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15. وَلَقَدْ كَانُوا۟ عٰهَدُوا۟ اللهَ مِن قَبْلُ لَا يُوَلُّونَ الْأَدْبٰرَ ۚ (Dan sesungguhnya mereka sebelum itu telah berjanji kepada Allah: “Mereka tidak akan berbalik ke belakang (mundur)”) Mereka tidak ikut dalam perang Badar dan menyaksikan kemuliaan dan kemenangan yang Allah berikan kepada para pasukan perang Badar, sehingga mereka berkata: “jika saja Allah memberikan kami kesempatan untuk bertemu peperangan sekali lagi niscaya kami benar-benar akan ikut berperang.” Terdapat pendapat mengatakan mereka adalah orang-orang dari Bani Haritsah dan Bani Salamah. وَكَانَ عَهْدُ اللهِ مَسْـُٔولًا(Dan adalah perjanjian dengan Allah akan diminta pertanggungan jawabnya) Yakni akan dituntut untuk menepatinya, dan akan dibalas hukuman jika mengingkarinya. Allah mengingatkan mereka kepada janji mereka dengan Rasulullah untuk menolong dan melindungi beliau jika beliau telah berhijrah ke kota mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "15. Sesungguhnya sebelum ini, orang-orang munafik yang meminta izin untuk kembali/pulang, mereka telah berjanji kepada Allah dan rasul-Nya sesudah perang Badr dan sebelum perang Ahzab untuk tidak melarikan diri dan tidak menyerah dari medan perang. Maksud al adbar adalah waktu dhuhur. Sesungguhnya janji di hadapan Allah akan dimintai pertanggungjawaban untuk dipenuhi pada hari kiamat, serta akan diperhitungkan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh mereka sebelum itu benar-benar telah berjanji kepada Allah untuk tidak berbalik ke belakang} tidak lari dari musuh mereka {dan perjanjian dengan Allah itu akan diminta pertanggung jawabannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "15. Ini adalah kondisi mereka. Padahal mereka sebenarnya sudah “berjanji kepada Allah sebelum itu, ‘Mereka tidak akan berbalik ke belakang.’ Dan perjanjian dengan Allah akan diminta pertanggungan jawabnya.” Dia akan meminta pertanggung jawaban atas janji itu. Namun ternyata mereka telah merusaknya. Lalu apa perkiraan mereka kalau bersikap begitu dengan Rabb mereka?"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahzab ayat 15: 14-15. Walaupun seandainya orang-orang musyrik Madinah masuk dan menyerbu kemudian meminta orang-orang munafik untuk menyekutukan Allah dan kufur kepada Nabi-Nya ﷺ, sungguh mereka akan memenuhi seruan mereka dengan segera."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 15",
    "description": "Dan sungguh, sebelum itu, yaitu pada perang uhud, mereka telah berjanji kepada Allah di hadapan rasulullah bahwa mereka tidak akan berbalik ke belakang atau mundur dari medan perang. Dan mereka lupa bahwa perjanjian dengan Allah akan diminta pertanggungjawabannya di hari kiamat kelak. -."
  }
]