[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai Nabi), kepada orang-orang munafik itu, “sesungguhnya itu tidak berguna bagi kalian Berlarinya kalian dari perang karena kalian takut mati atau terbunuh, karena itu tidak menunda ajal kalian. Bila kalian meninggalkan medan perang, kalian tidak menikmati kehidupan dunia, kecuali sebatas umur kalian yang terbatas, dan itu adalah masa yang singkat dibandingkan dengan kehidupan di akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Katakanlah -wahai Rasul- kepada mereka, “Pelarian tidak akan bermanfaat bagi kalian jika kalian lari dari peperangan karena takut terhadap kematian atau pembunuhan, karena umur itu sudah ditentukan. Jika kalian lari sementara ajal kalian belum saatnya datang, sesungguhnya kalian tidak mengecap kesenangan di dalam hidup ini kecuali hanya sebentar saja.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "16-17. Hai Rasulullah, katakanlah kepada orang-orang munafik itu: “Lari tidak akan bermanfaat bagi kalian, jika kalian takut dari kematian atau pembunuhan. Dan jika kalian lari, kalian juga tidak akan bersenang-senang di dunia melainkan hanya sebentar saja sampai ajal kalian datang.” Dan katakanlah kepada mereka: “Siapa yang dapat melindungi kalian dari Allah, jika Dia hendak menimpakan musibah atau memberi rahmat bagi kalian?” Mereka tidak akan mendapatkan pelindung dan penolong selain Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "16. وَإِذًا لَّا تُمَتَّعُونَ إِلَّا قَلِيلًا (dan jika (kamu terhindar dari kematian) kamu tidak juga akan mengecap kesenangan kecuali sebentar saja”) Yakni mereka menikmati kenikmatan sebentar saja setelah pelarian mereka sampai datangnya ajal mereka. Dan segala yang akan datang adalah hal yang dekat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16. Wahai Nabi, katakanlah kepada mereka: “Jika kalian lari, agar terhindar dari kematian atau peperangan maka itu semua tidak akan membawa manfaat sedikitpun bagi kalian. Jika kalian memang berhasil lari, maka kalian tidak akan selamat setelah itu kecuali hanya sebentar saja. Yaitu kisaran waktu umur dan kematian.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Lari itu tidak akan berguna bagi kalian untuk lari dari kematian atau pembunuhan. Jika demikian, kalian tidak akan merasakan kesenangan, kecuali hanya sebentar”} dalam waktu sebentar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "16. “Katakanlah,” kepada mereka dengan nada mencela atas pelarian mereka, dan seraya menyampaikan kepada mereka bahwa hal itu sama sekali tidak berguna sedikit pun bagi mereka, “Lari itu sekali-kali tidaklah berguna bagimu, jika kamu melarikan diri dari kematian atau pembunuhan.” Sekiranya kalian berada di rumah-rumah kalian, niscaya orang-orang yang telah ditakdirkan akan mati terbunuh itu keluar juga ke tempat mereka terbunuh. Segala upaya itu hanya akan bisa berguna jika tidak berlawanan dengan takdir. Namun, kalau takdir sudah tiba, semua upaya menjadi tidak ada artinya, dan segala cara yang diduga oleh manusia akan bisa menyelamatkan dirinya menjadi batal (tidak berfungsi), “dan jika demikian,” ketika kalian lari untuk menyelamatkan diri dari kematian dan pembunuhan, tentu kalian akan bersenang-senang di dunia ini. Sesungguhnya kalian “tidak juga akan mengecap kesenangan kecuali sebentar saja,” suatu kesenangan yang (kadar nilainya) tidak sebanding dengan pelarian dan pengabaian kalian terhadap perintah Allah, serta penyia-nyiaan kalian terhadap diri kalian untuk bisa menikmati kesenangan abadi di dalam kenikmatan abadi."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahzab ayat 16: Katakanlah wahai Nabi kepada mereka orang-orang munafik : Ketahuilah bahwa pelarian kalian dari peperangan tidak akan menjaga kalian dari kematian atau pembunuhan, dan tidak akan mengakhirkan ajal kalian. Meskipun kalian lari, kalian tidak akan dapat bersenang-senang di dunia ini kecuali dengan ketentuan umur-umur kalian, yaitu panjangnya antara ajal ikhtirami dan thabi’i."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kepada mereka sambil mencela mereka dan memberitahukan, bahwa hal itu tidaklah berfaedah apa-apa bagi mereka. Meskipun kamu berada di rumahmu, niscaya orang yang telah ditakdirkan akan mati terbunuh akan keluar juga ke tempat mereka terbunuh. Sebab hanyalah bermanfaat jika tidak berbenturan dengan qadha’ dan qadar, akan tetapi apabila berbenturan dengan qadar, maka segala sebab akan lenyap, dan semua wasilah (sarana) yang disangka seseorang bermanfaat akan sia-sia. Ketika kamu melarikan diri agar selamat dari mati atau terbunuh, lalu kamu dapat bersenang-senang di dunia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 16",
    "description": "-17. Allah mahakuasa, karena itu katakanlah wahai nabi Muhammad untuk mengingatkan mereka, 'siapakah yang dapat melindungi kamu dari ketentuan Allah jika dia menghendaki bencana atasmu atau menghendaki rahmat untuk dirimu'' tentu tidak satu pun. Mereka itu tidak akan mendapatkan pelindung dan penolong selain Allah jika bencana itu benar-benar datang."
  }
]