[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah kepada mereka (wahai Nabi), “Siapa yang melindungi kalian dari Allah atau siapakah yang menjaga kalian dari siksaNya bila Dia menghendaki keburukan terhadap kalian atau Dia menghendaki rahmat bagi kalian, karena Dia-lah yang memberi dan yang menghalangi, yang menimpakan mudarat dan memberikan manfaat? Dan orang-orang yang munafik itu tidak mendapatkan penolong yang bisa menolong mereka dan pembantu dan bisa membantu mereka selain Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Katakan -wahai Rasul- kepada mereka, “Siapakah yang mampu menghalangi kalian dari Allah apabila Dia berkehendak untuk menimpakan kepada kalian apa yang tidak kalian sukai berupa kematian dan peperangan, atau berkehendak memberikan kepada kalian apa yang kalian inginkan berupa keselamatan dan kebaikan? Tidak ada seorang pun yang mampu menghalangi kalian dari hal itu. Orang-orang munafik itu tidak mendapatkan pelindung bagi mereka selain Allah yang melindungi urusannya dan tidak pula mendapatkan penolong yang menghalangi mereka dari siksa Allah bagi mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "17. قُلْ مَن ذَا الَّذِى يَعْصِمُكُم مِّنَ اللهِ (Katakanlah: “Siapakah yang dapat melindungi kamu dari (takdir) Allah) Yakni melindungi kalian dari Allah. إِنْ أَرَادَ بِكُمْ سُوٓءًا(jika Dia menghendaki bencana atasmu) Yakni berupa kematian, hilangnya harta benda, kekeringan, atau tertimpa penyakit. أَوْ أَرَادَ بِكُمْ رَحْمَةً ۚ( atau menghendaki rahmat untuk dirimu?”) Yakni berupa kesejahteraan, kemenangan, dan kesehatan. وَلِيًّا(pelindung) Yang melindungi dan membela mereka. وَلَا نَصِيرًا(dan penolong) Yang menolong mereka dari azab Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17. Katakanlah kepada mereka wahai rasul: “Siapa yang dapat mencegah kalian dari murka Allah jika Dia menghendaki kebinasaan dan kekalahan bagi kalian? Atau jika Allah menghendaki kebaikan kepada kalian berupa memberi pertolongan, kesuburan, keselamatan dan kesehatan. Maka mereka tidak akan menemukan penolong selain Allah, Yang dapat menolong dan menghilangkan bahanya dari mereka.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Katakanlah,“Siapakah yang dapat melindungi kalian} menjaga kalian {dari (ketentuan) Allah jika Dia menghendaki keburukan atas kalian atau menghendaki rahmat untuk kalian” Mereka tidak akan mendapatkan pelindung dan penolong selain Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17. Kemudian Allah menjelaskan bahwa sesungguhnya semua sebab dan upaya, sama sekali tidak berguna bagi seseorang apabila Allah menghendaki keburukan terhadap dirinya, seraya berfirman, “Katakanlah, ‘Siapakah yang dapat melindungi kamu’,” maksudnya, mencegah kalian dari “(takdir) Allah jika Dia menghendaki bencana atasmu,” maksudnya, keburukan, “atau menghendaki rahmat untuk dirimu,” karena sesungguhnya Dia-lah Yang Maha Pemberi dan Maha Pencegah, Yang Maha Menimpakan bahaya lagi Maha Pemberi manfaat, yang tidak akan dapat mendatangkan kebaikan kecuali DIa, dan tidak pula mencegah keburukan kecuali Dia, “dan mereka tidak memperoleh pelindung bagi mereka selain Allah,” yang bisa melindungi mereka, lalu memberikan nberbagai manfaat kepada mereka, sehingga mencegah segala marabahaya dari mereka. Maka hendaklah mereka mematuhi ketaatan kepada Dzat Yang ESa yang mengendalikan segala perkara, yang kehendakNya pasti berlaku, takdirNya pasti terjadi., dan tidak akan berguna seorang pelindung ataupun seorang penolong bila meninggalkan perlindungan dan pertolonganNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahzab ayat 17: Katakanlah wahai Nabi Allah kepada mereka orang-orang munafik : Siapa yang akan menghalangi dan melindungi kalian jika Allah berkehendak baik atau buruk kepada kalian ?! Dan Allah Dialah Al Mu’thi dan Al Mani’. Kemudian Allah menjelaskan bahwa mereka orang-orang munafik tidak memiliki penolong yang melindungi mereka, dan menjaga mereka dari adzab Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala menerangkan, bahwa semua sebab tidaklah berguna bagi seorang hamba apabila Allah menghendaki bencana atas dirinya. Karena sesungguhnya Dialah Allah yang memberi dan menghalangi, yang memberi manfaat dan yang menimpakan madharrat; tidak ada yang mendatangkan kebaikan selain Dia dan tidak ada yang dapat menghindarkan bencana selain Dia. Yang memberi manfaat kepada mereka. Yang menghindarkan bahaya. Oleh karena itu, hendaklah mereka menaati Tuhan yang sendiri mengatur segala urusan, yang kehendak-Nya berlaku, qadar-Nya berjalan, dan tidaklah bermanfaat pelindung dan penolong jika Dia tidak melindungi dan menolong."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 17",
    "description": "Allah mahakuasa, karena itu katakanlah wahai nabi Muhammad untuk mengingatkan mereka, 'siapakah yang dapat melindungi kamu dari ketentuan Allah jika dia menghendaki bencana atasmu atau menghendaki rahmat untuk dirimu'' tentu tidak satu pun. Mereka itu tidak akan mendapatkan pelindung dan penolong selain Allah jika bencana itu benar-benar datang. 18. Allah mengetahui siapa saja yang berkhianat. Sungguh, dengan ilmu-Nya yang meliputi segala sesuatu Allah mengetahui orang-orang yang menghalang-halangi di antara kamu, dari kaum munafik, dan orang yang dengan maksud menghina berkata kepada saudara-saudaranya yang bergaul dengan mereka di madinah, 'marilah ikut bersama kami. Tinggalkanlah Muhammad. Jangan ikut perang sebab sebentar lagi Muhammad akan terbunuh di medan perang. ' tetapi mereka memang datang untuk ikut berperang, namun hanya sebentar karena mereka takut mati."
  }
]