[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya Allah mengetahui orang-orang yang menghalangi-halangi manusia agar tidak berjihad yang berkata kepada saudara-saudara mereka, “Kemarilah, bergabunglah dengan kami, tinggalkanlah Muhammad, jangan ikut perang bersamanya, kami takut kalian akan celaka bila dia celaka.” Dan disamping mereka mengabaikan, mereka juga tidak ikut dalam perang kecuali jarang, itu pun karena riya’ dan sum’ah serta takut malu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Allah mengetahui di antara kalian ada orang yang menghalang-halangi orang lain untuk berperang bersama Rasulullah -ṣallallāhu 'alaihi wa sallam-, dan ada orang yang berkata kepada saudara-saudaranya, “Kemarilah! Janganlah berperang bersamanya sehingga kalian tidak terbunuh, sesungguhnya kami khawatir kalian akan terbunuh.” Dan orang-orang yang rendah ini tidaklah mendatangi peperangan dan tidak pula ikut dalam peperangan kecuali jarang sekali, hanya sekedar untuk menghindarkan aib dari diri mereka, bukan dengan tujuan untuk menolong Allah dan Rasul-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "18-19. Allah mengetahui dengan pasti orang-orang munafik yang menurunkan semangat berjihad di jalan Allah, mereka berkata kepada saudara mereka sekandung dan seperjuangan: “Datanglah kepada kami agar untuk menuju keamanan dan kenyamanan.” Selain itu mereka juga tidak ikut berperang melainkan sesekali saja dengan tujuan riya’ dan sum’ah. Mereka sangat pelit kepada kalian dalam memberi kasih sayang, pertolongan, dan nasehat. Dan jika mereka ikut berperang, maka mereka sangat ketakutan sehingga bola mata mereka terbelalak seperti orang sekarat yang menghadapi kematian. Jika ketakutan telah berlalu dengan berhentinya peperangan, maka mereka akan menyakiti kalian dengan perkataan buruk berupa olokan dan penyebaran kebohongan, mereka juga akan saling memperebutkan harta ghanimah kerena kebakhilan dan kecintaan mereka kepada harta. Orang-orang yang jauh dari kebenaran itu belum benar-benar beriman dengan hati mereka, maka Allah menghapus pahala dari amal kebaikan mereka. Penghapusan pahala yang dapat menjauhkan mereka dari surga adalah perkara yang mudah bagi Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "18. قَدْ يَعْلَمُ اللهُ الْمُعَوِّقِينَ مِنكُمْ (Sesungguhnya Allah mengetahui orang-orang yang menghalang-halangi di antara kamu) Mereka adalah orang-orang munafik yang melemahkan semangat kaum Anshar. Orang-orang munafik itu berkata kepada mereka: “Muhammad dan para sahabatnya hanyalah kelompok yang amat sedikit, mereka pasti akan dikalahkan oleh Abu Sufyan dan bala tentaranya.” وَالْقَآئِلِينَ لِإِخْوٰنِهِمْ هَلُمَّ إِلَيْنَا ۖ (dan orang-orang yang berkata kepada saudara-saudaranya: “Marilah kepada kami”) Yakni orang-orang munafik itu berkata kepada kerabat mereka dari kaum Anshar: “tinggalkanlah Muhammad dan para sahabatnya, dan bergabunglah dengan kami.” وَلَا يَأْتُونَ الْبَأْسَ(Dan mereka tidak mendatangi peperangan) Yakni pertempuran. إِلَّا قَلِيلًا(melainkan sebentar) Kerena ketekutan mereka dari kematian, mereka ikut ke medan perang tanpa mengharap pahala."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "18. Qad: berfungsi untuk realisasi, Allah Maha Tahu terhadap orang-orang yang menghalang-halangi kesungguhan orang selain mereka dalam berperang di jalan Allah. Mereka adalah orang-orang munafik, mereka yang berkata kepada penduduk Madinah yang semangat dalam berperang: “Marilah kesini, disini bersama kami ada ketenangan, tinggalkanlah jihad. Kami takut kalian akan terbunuh. Sesungguhnya Abu Sufyan dan tentara Ahzab akan mengepung Muhammad dan para bala tentaranya.” Sesungguhnya mereka hanya ikut berperang sebentar saja, dengan maksud riya’, karena takut terbunuh"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh Allah mengetahui orang-orang yang menghalangi di antara kalian} orang-orang yang menghalangi untuk berjihad dengan Rasulallah SAW di antara kalian {dan orang yang berkata kepada saudara-saudaranya,“Marilah bersama kami”} marilah bersama kami dan tinggalkanlah Muhammad {Mereka tidak datang dalam peperangan} peperangan {kecuali hanya sebentar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "18. Kemudian Allah mengancam orang-orang yang melemahkan semangat jihad dan merintangi, dan Dia mengultimatum mereka, seraya berfirman, “Sesungguhnya Allah mengetahui orang-orang yang menghalang-halangi dari kamu,” untuk keluar (berperang) bagi orang-orang yang belum keluar, “dan orang-orang yang berkata kepada saudara-saudaranya” yaitu mereka yang telah keluar, “Marilah kepada kami,” maksudnya, kembalilah! Sama seperti perkataan mereka dahulu, “Wahai penduduk Yatsrib, tidak ada tempat bagimu, maka kembalilah kamu.” Dan mereka, sekalipun menghalang-halangi dan melemahkan semangat jihad, “mereka tidak mendatangi peperangan,” maksudnya, pertempuran dan jihad dengan jiwa mereka “melainkan sebentar.” Jadi, mereka adalah orang yang paling berminat untuk kembali pulang, karena tidak mempunyai motivasi iman dan sifat sabar untuk hal yang demikian, dank arena [adanya] faktor yang menuntut kepada sikap pengecut mereka, yaitu kemunafikan dan tidak adanya iman."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahzab ayat 18: Allah mengabarkan bahwa tidaklah tersembunyi bagi Allah keadaan mereka orang-orang munafik yang lemah dalam berjihad dan berperang di jalan Allah; Mereka adalah orang-orang yang lumpuh dalam berjihad dan orang-orang yang melemahkan semangat orang lain dengan berkata : Kemarilah dan kembalilah kepada kami. Mereka adalah orang-orang yang lumpuh yang tidak ada persaksiaannya atas peperangan kecuali hanya sedikit dengan riya dan sum’ah, atau takut dicibir dan karena ingin ghanimah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala mengancam orang-orang yang menghalang-halangi dan mengendorkan semangat kaum muslimin. Karena riya’ atau sum’ah. Mereka adalah orang yang paling ingin tidak ikut berperang karena tidak adanya pendorong untuk itu, yaitu iman dan sabar, dan adanya hal yang menghendaki untuk bersikap pengecut, berupa kemunafikan dan tidak adanya iman."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 18",
    "description": "Allah mengetahui siapa saja yang berkhianat. Sungguh, dengan ilmu-Nya yang meliputi segala sesuatu Allah mengetahui orang-orang yang menghalang-halangi di antara kamu, dari kaum munafik, dan orang yang dengan maksud menghina berkata kepada saudara-saudaranya yang bergaul dengan mereka di madinah, 'marilah ikut bersama kami. Tinggalkanlah Muhammad. Jangan ikut perang sebab sebentar lagi Muhammad akan terbunuh di medan perang. ' tetapi mereka memang datang untuk ikut berperang, namun hanya sebentar karena mereka takut mati. 19. Wahai kaum mukmin, tidak hanya menghasutmu untuk pulang ke madinah, mereka yang berjiwa munafik itu juga kikir terhadapmu karena mereka sejatinya pengecut dan penakut. Apabila datang ketakutan dan bahaya yang mengancam, kamu lihat mereka itu memandang kepadamu dengan penuh ketakutan sehingga matanya terbalik-balik seperti orang yang pingsan karena akan mati; dan apabila rasa ketakutan telah hilang, mereka tampil seperti orang yang kuat dan pemberani, dan dengan sombong kembali mencaci kamu dengan lidah yang tajam atas kebaikan yang kamu lakukan, sedang mereka sendiri kikir atau enggan untuk berbuat kebaikan. Mereka itu pada hakikatnya tidak beriman, maka Allah menghapus pahala dari amalnya dan di akhirat kelak mereka tidak akan mendapati apa yang mereka harapkan. Dan yang demikian itu tentu sa-ngat mudah bagi Allah."
  }
]