[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang munafik itu adalah orang-orang yang bakhil terhadap kalian (wahai orang-orang yang beriman), baik dengan harta mereka, jiwa, usaha dan cinta mereka, karena di dalam hati mereka tertanam permusuhan dan iri dengki, karena mencintai kehidupan dan memberi kematian. Bila mereka ikut dalam berperang, mereka takut mati dan kamu melihat mereka melihat kepadamu, mata mereka berputar-putar karena mereka kehilangan akal mereka, mereka takut kepada kematian dan berlari darinya, seperti berputarnya mata orang yang mengalami sakaratul maut. Bila perang telah usai dan ketakutan telah sirna, maka mereka menuduh kalian dengan kata-kata yang pedas, dan kamu melihat mereka saat pembagian harta rampasan perang sebagai orang-orang yang hasad dan bakhil. Mereka adalah orang-orang yang tidak beriman dengan hati mereka, maka Allah melenyapkan pahala amal mereka, dan hal itu adalah mudah bagi Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Mereka pelit menggunakan harta mereka untuk kalian -wahai orang-orang yang beriman-, sehingga mereka tidak menolong kalian dengan harta tersebut. Mereka juga pelit dengan jiwa mereka sendiri sehingga tidak mau berperang bersama kalian, dan mereka juga pelit dengan rasa cinta mereka sehingga mereka tidak mencintai kalian. Tatkala datang rasa takut kepada mereka saat sedang menghadapi musuh, engkau lihat mereka memandangmu -wahai Rasul- sementara mata mereka berputar-putar karena ketakutan seperti perputaran mata yang sedang menghadapi sakaratul maut. Lalu jika rasa takut sudah pergi dan mereka sudah merasa tenang, mereka menyakiti kalian dengan lidah-lidah mereka yang tajam karena ketamakan mereka terhadap rampasan perang yang mereka inginkan. Orang-orang yang mempunyai sifat-sifat demikian ini bukanlah orang yang beriman dengan sesungguhnya, maka Allah membatalkan pahala amal mereka. Dan sesungguhnya membatalkan pahala amal mereka adalah hal yang mudah bagi Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "19. أَشِحَّةً عَلَيْكُمْ ۖ (Mereka bakhil terhadapmu) Yakni mereka pelit terhadap kalian, mereka tidak membantu kalian menggali parit dan tidak pula menafkahkan harta mereka di jalan Allah. فَإِذَا جَآءَ الْخَوْفُ رَأَيْتَهُمْ يَنظُرُونَ إِلَيْكَ تَدُورُ أَعْيُنُهُمْ(apabila datang ketakutan (bahaya), kamu lihat mereka itu memandang kepadamu dengan mata yang terbalik-balik) Yakni menggerakkan mata mereka ke kiri dan ke kanan, dan ini adalah sikap pengecut jika menyaksikan sesuatu yang ia takutii. كَالَّذِى يُغْشَىٰ عَلَيْهِ مِنَ الْمَوْتِ ۖ( seperti orang yang pingsan karena akan mati) Yakni seperti mata milik orang yang didatangi kematian yang mengangkat pandangannya ke atas tanpa berkedip. فَإِذَا ذَهَبَ الْخَوْفُ سَلَقُوكُم بِأَلْسِنَةٍ حِدَادٍ(dan apabila ketakutan telah hilang, mereka mencaci kamu dengan lidah yang tajam) Yakni ketika mereka telah aman, mereka menyakiti kalian dengan perkataan dari lisan mereka yang tajam dan menyakitkan. Dalam keadaan aman mereka adalah orang yang paling pelit dan paling tajam lisannya, dan ketika dalam peperangan mereka adalah orang yang paling penakut dan pengecut. أَشِحَّةً عَلَى الْخَيْرِ ۚ( sedang mereka bakhil untuk berbuat kebaikan) Yakni bakhil terhadap ghanimah yang mereka dapatkan. Pendapat lain mengatakan, yakni terhadap harta untuk mereka infakkan di jalan Allah. أُو۟لٰٓئِكَ لَمْ يُؤْمِنُوا۟( Mereka itu tidak beriman) Namun mereka adalah orang-orang munafik. فَأَحْبَطَ اللهُ أَعْمٰلَهُمْ ۚ( maka Allah menghapuskan (pahala) amalnya) Allah menghapus pahala jihad mereka, sebab tidak dilandasi dengan iman. وَكَانَ ذٰلِكَ عَلَى اللهِ يَسِيرًا(Dan yang demikian itu adalah mudah bagi Allah) Yakni kemunafikan mereka sangat remeh bagi Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19. Mereka bakhil terhadapmu, apabila datang ketakutan (bahaya), kamu lihat mereka itu memandang kepadamu dengan mata yang terbalik-balik, mata mereka ke kiri dan ke kanan seperti orang yang pingsan karena akan mati. Namun apabila ketakutan telah hilang, mereka mencaci kamu dengan lidah yang tajam seperti besi, mereka menginginkan harta rampasa perang. Mereka berbantahan dengan orang muslim tentang pembagiannya. Mereka sesungguhnya beriman, namun munafik. Sehingga Allah membatalkan pahala amal dan perang mereka, karena tidak diiringi dengan keimanan Dan yang demikian itu adalah mudah bagi Allah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka kikir terhadap kalian} pelit dengan harta, jiwa, kasih sayangnya terhadap kalian {Apabila datang ketakutan} datang peperangan {kamu melihat mereka memandang kepada kalian dengan bola mata yang berputar-putar} ke kanan dan ke kiri karena sangat takut {seperti orang yang pingsan karena akan mati} seperti berputarnya mata orang yang pingsan karena sakaratul maut {Apabila ketakutan telah hilang ketakutan itu, mereka mencaci kalian} mencaci dan menyakiti kalian {dengan lidah yang tajam} tajam {dan kikir untuk berbuat kebaikan} kikir lagi sangat menginginkan rampasan perang {Mereka itu tidak beriman, maka Allah menghapus} menghapus {amal mereka. Yang demikian itu bagi Allah sangat mudah} mudah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "19. “Mereka bakhil terhadapmu” dengan raga mereka di kala peperangan, dan dengan harta mereka untuk berinfak untuk peperangan. Mereka tidak berjihad dengan harta dan jiwa raga mereka. “Apabila datang ketakutan, kamu lihat mereka itu memandang kepadamu,” sebagaimana melihatnya orang yang akan pingsan, “karena akan mati,” karena sikap pengecut yang mengoyak hati mereka dan karena kegelisahan yang menakutkan, dank arena mereka sangat khawatir kalau mereka dipaksa melakukan sesuatu yang sangat tidak mereka suka, yaitu berperang. “Dan apabila ketakutan telah hilang,” dan mereka sudah berada dalam kondisi aman dan tenang, “mereka mencaci kamu dengan lidah yang tajam,” maksudnya, mereka berbicara kepada kalian dengan perkataan yang tajam dan klaim-klaim yang tidak benar; dan ketika engkau mendengar mereka, maka engkau menduga bahwa mereka adalah orang-orang pemberani dan kesatria, “sedang mereka bakhil untuk berbuat kebaikan,” yang diinginkan dari mereka. Ini adalah keburukanj yang terburuk yang ada pada manusia, yaitu kalau dia menjadi kikir dengan apa yang diperintahkan kepadanya, kikir dengan hartanya untuk membelanjakannya pada jalan yang benar, kikir dengan raganya untuk berjihad memerangi musuh Allah, atau untuk berdakwah fi sabilillah, kikir dengan kedudukannya, kikir dengan ilmu, nasihat dan ide-idenya. “Mereka itu” orang-orang yang seperti itu kondisinya, “tidak beriman,” disebabkan karena ketiadaan iman, maka Allah menghapuskan (pahala) amalnya. “Dan yang demikian itu adalah mudah bagi Allah.” Adapun orang-orang yang beriman, maka mereka telah dilindungi oleh Allah dari kekikiran diri mereka dan mereka dibimbing oleh Allah untuk mengorbankan apa yang diperintahkan kepada mereka, seperti mengorbankan raga di dalam perang fi sabilillah dan meninggikan kalimatNya, serta mengorbankan harta mereka untuk berinfak dalam berbagai jalan kebaikan, dan mengorbankan kedudukan dan ilmu mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahzab ayat 19: Di antara sifat dari mereka orang-orang munafik yang lemah : Bahwasanya mereka adalah orang-orang yang bakhil kepada kalian wahai orang-orang beriman, hati-hati mereka tidak berkenan dengan kalian; Maka jika telah datang waktu perang; Jadilah mereka ketakutan dan pecundang, mereka lepaskan keinginan-keinginan mereka dari peperangan karena takut, dan mereka melihat kanan-kiri seolah-olah mereka melihat kematian. Maka jika mereka datang untuk berperang mereka sangat ketakutan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mereka kikir mengorbankan jiwa untuk berperang, dan kikir mengorbankan harta untuknya. Oleh karena itu, mereka tidak berjihad dengan jiwa dan hartanya. Karena sifat pengecut yang mencopot hati mereka dan gelisah yang membuat mereka lupa segalanya dan takut jika mereka dipaksa untuk hal yang mereka benci, yaitu perang. Keadaan menjadi aman dan tenteram, atau ghanimah telah diperoleh dan berhasil dikumpulkan. Mereka akan berbicara dengan kata-kata yang keras dan mengemukakan dakwaan yang tidak benar. Ketika itu, mereka tampil seakan-akan sebagai orang-orang yang berani. Mereka tidak mau mengorbankan milik mereka sedikit pun, tetapi mereka menuntut ghanimah. Ini adalah keadaan yang sangat buruk yang ada dalam diri seseorang. Kikir untuk berbuat yang diperintahkan, kikir mengorbankan harta di jalan Allah, kikir mengorbankan jiwa di jalan Allah, kikir dengan apa yang ada padanya, seperti kedudukannya sehingga tidak mau membantu orang lain, kikir dengan ilmunya, nasihatnya dan pendapatnya sehingga tidak memberikannya kecuali jika ia memperoleh keuntungan. Berbeda dengan orang-orang mukmin, Allah menjaga mereka dari kekikiran diri mereka, diberi-Nya mereka taufik untuk mengerjakan apa yang diperintahkan, mereka rela mengorbankan jiwa dan harta mereka di jalan-Nya untuk meninggikan kalimat-Nya, mereka senang memberikan harta mereka pada pos-pos kebaikan, demikian pula memberikan bantuan kepada orang lain dengan kedudukan dan ilmu mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 19",
    "description": "Wahai kaum mukmin, tidak hanya menghasutmu untuk pulang ke madinah, mereka yang berjiwa munafik itu juga kikir terhadapmu karena mereka sejatinya pengecut dan penakut. Apabila datang ketakutan dan bahaya yang mengancam, kamu lihat mereka itu memandang kepadamu dengan penuh ketakutan sehingga matanya terbalik-balik seperti orang yang pingsan karena akan mati; dan apabila rasa ketakutan telah hilang, mereka tampil seperti orang yang kuat dan pemberani, dan dengan sombong kembali mencaci kamu dengan lidah yang tajam atas kebaikan yang kamu lakukan, sedang mereka sendiri kikir atau enggan untuk berbuat kebaikan. Mereka itu pada hakikatnya tidak beriman, maka Allah menghapus pahala dari amalnya dan di akhirat kelak mereka tidak akan mendapati apa yang mereka harapkan. Dan yang demikian itu tentu sa-ngat mudah bagi Allah. 20. Sifat pengecut, kikir, dan penakut itu mendarah daging dalam jiwa mereka dan bukan sesuatu yang baru. Mereka mengira bahwa golongan-golongan yahudi bani quraizah dan kafir mekah yang bersekutu itu belum benar-benar pergi dan akan kembali untuk membalas dendam. Dan karenanya, jika golongan-golongan yang bersekutu itu datang kembali untuk menyerang kaum mukmin, niscaya mereka yang munafik itu ingin berada di dusun-dusun dan rumah-rumah mereka bersama-sama orang arab badui dan tidak mau ikut perang, sambil terus menanyakan dan mengikuti perkembangan berita tentang kamu di medan perang tersebut. Dan sekiranya mereka berada bersamamu di medang perang, mereka tidak akan berperang melainkan sebentar saja karena mereka pengecut dan takut mati."
  }
]