[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ikutilah apa yang diwahyukan kepadamu dari Tuhanmu, yakni al-Qur’an dan as-Sunnah, sesungguhnya Allah mengetahui segala apa yang kalian perbuat dan membalas kalian atasnya, tidak ada sesuatu pun yang samar bagiNya dari perbuatan tersebut."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Dan ikutilah wahyu yang telah Rabbmu turunkan kepadamu, sesungguhnya Allah Maha Mengetahui apa yang kalian lakukan, tidak ada sesuatupun dari perbuatan itu yang luput dari-Nya dan Dia akan membalas kalian atas perbuatan kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. وَاتَّبِعْ مَا يُوحَىٰٓ إِلَيْكَ مِن رَّبِّكَ ۚ (dan ikutilah apa yang diwahyukan Tuhan kepadamu) Yakni ikutilah wahyu itu dalam setiap urusanmu, dan janganlah kamu ikuti pendapat orang-orang kafir dan munafik."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Jalankanlah wahyu yang telah diturunkan padamu dalam setiap urusanmu, yaitu Al-Qur’an, sesungguhnya Allah adalah tempat ketaatan dalam setiap yang kamu sekalian lakukan, tidak ada satupun yang samar bagi Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ikutilah apa yang diwahyukan Tuhanmu kepadamu. Sesungguhnya Allah Maha Mengetahui apa yang kalian kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-2. Maksudnya, hai orang yang telah dikaruniai kenabian oleh Allah dan diutamakan dengan wahyuNya serta diutamakan atas seluruh manusia! Syukurilah nikmat Rabbmu yang telah dikaruniakan kepadamu dengan menggunakan takwaNya yang engkau lebih utama dengannya daripada selain engkau, dan yang wajib atasmu darinya lebih besar daripada selain kamu. Maka wajib atasmu darinya lebih besar daripada selain kamu. Maka patuhilah perintah-perintahNya dan larangan-laranganNya, dan sampaikanlah risalahNya (ajaranNya) dan sampaikanlah wahyuNya kepada hamba-hambaNya, serta berikanlah nasihat kepada manusia, dan jangan sekali-kali kamu menaati setiap orang kafir yang telah menampakkan permusuhannya terhadap Allah dan RasulNya, ataupun orang munafik yang sudah merahasiakan pendustaan dan kekafiran, dan menampakkan lawannya. Mereka itu semua adalah musuh yang sesungguhnya. Maka janganlah taat kepada mereka dalam sebagian perkara yang dapat merusak takwa dan membatalkannya, dan jangan kamu mengikuti keinginan mereka, karena akan menyesatkanmu dari yang benar, “dan” akan tetapi “Ikutilah apa yang diwahyukan Rabbmu kepadamu,” sebab sesungguhnya itulah petunjuk dan rahmat, dan berharaplah dengannya pahala dari Rabbmu, karena sesungguhnya Dia “Maha Mengetahui apa yang kamu kerjakan,” Dia akan memberikan balasan kepada kalian sesuai dengan apa yang Dia ketahui dari kalian, yaitu kebaikan atau keburukan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahzab ayat 2: Allah memerintahkan Nabi-Nya Muhammad ﷺ agar berpegang teguh dengan apa yang telah diwahyukan Allah dari Al Qur’an dan As Sunnah. Allah mengabarkan bahwa tidak tersembunyi bagi-Nya sesuatu yang tersembunyi, dan kalian akan dibalas pada hari kiamat dengan apa yang pantas dari pahala atau adzab. Allah memerintahkan nabi-Nya, akan tetapi maksudnya untuk disampaikan kepada ummatnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Karena ia adalah petunjuk dan rahmat, dan haraplah pahala Tuhanmya dengannya, karena Dia mengetahui apa yang kamu kerjakan, Dia akan membalas amal yang kamu lakukan sesuai yang Dia ketahui darimu, baik atau buruk."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 2",
    "description": "Dan karena itu, ikutilah dan lakukanlah apa saja yang telah diwah-yukan tuhanmu kepada engkau. Sungguh, Allah maha mengetahui dengan sangat teliti terhadap apa yang kamu kerjakan, baik secara terang-terangan maupun tersembunyi; dan dia akan membalasnya sesuai apa yang telah kamu lakukan. 3. Dan bertawakAllah kepada Allah agar dia meneguhkan langkahmu dalam menyerukan kebenaran. Dan janganlah engkau minta perlin-dungan kepada siapa pun karena cukuplah Allah sebagai pemelihara dirimu dari ancaman dan atau kemungkinan buruk dari kaum kafir dan munafik."
  }
]