[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang munafik menyangka bahwa pasukan Ahzab (koalisi) yang Allah kalahkan dengan kekalahan terburuk tersebut belum pergi, dan yang demikian itu karena ketakutan dan kecemasan mereka yang sangat. Seandainya pasukan ahzab itu kembali ke Madinah, niscaya orang-orang munafik itu berharap bila mereka tidak tinggal di Madinah, tetapi tinggal bersama orang-orang Arab badui di pedalaman. Selanjutnya mereka mencari-cari kabar kalian dan bertanya-tanya tentang berita kalian dari jauh. Seandainya mereka berada diantara kalian, niscaya mereka tidak berperang bersama kalian kecuali sedikit, karena mereka sangat takut, lemah dan tidak memiliki keteguhan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "20. Orang-orang pengecut itu mengira bahwa golongan-golongan yang bersekutu untuk memerangi Rasulullah -ṣallallāhu 'alaihi wa sallam- dan orang-orang yang beriman itu tidak akan pergi sampai mereka bisa membinasakan orang-orang mukmin. Dan jika ditakdirkan bahwa golongan-golongan itu nanti datang lagi, maka orang-orang munafik yang penakut itu berharap berada di Madinah bersama dengan orang-orang Badui. Mereka menanyakan tentang kabar berita kalian, “Apa yang terjadi pada kalian setelah musuh menyerang kalian?” Kalau seandainya mereka bersama kalian -wahai orang-orang yang beriman- niscaya mereka tidak akan berperang bersama kalian kecuali hanya sebentar saja. Maka janganlah kalian pedulikan mereka dan janganlah kalian merasa sedih terhadap mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "20. orang-orang munafik mengira akibat ketakutan mereka bahwa pasukan Ahzab -yaitu pasukan orang-orang kafir Quraisy dan para sekutunya- setelah mengalami kekalahan belum meninggalkan kota Madinah, padahal mereka telah telah meninggalkannya. Dan jika orang-orang kafir kembali menyerang, niscaya orang-orang munafik akan berharap meraka berada di pedalaman suku Baduwi dan jauh dari orang-orang beriman, hal ini akibat ketakutan mereka dari kematian dan penantian terhadap kejadian terbaru dengan bertanya tentang kalian. Dan seandainya mereka bersama kalian saat terjadinya peperangan, niscaya mereka tidak akan ikut berperang melainkan sekedar malu dari kalian, hal ini karena kekikiran dan ketakutan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "20. يَحْسَبُونَ الْأَحْزَابَ لَمْ يَذْهَبُوا۟ ۖ (Mereka mengira (bahwa) golongan-golongan yang bersekutu itu belum pergi) Yakni orang-orang munafik itu karena kepengecutan mereka mengira bahwa pasukan perang ahzab yang akan menyerang itu tetap berada dalam pangkalan perang mereka dan belum kembali ke rumah-rumah mereka. وَإِن يَأْتِ الْأَحْزَابُ(dan jika golongan-golongan yang bersekutu itu datang kembali) Yakni datang kembali setelah kali ini. يَوَدُّوا۟ لَوْ أَنَّهُم بَادُونَ فِى الْأَعْرَابِ(niscaya mereka ingin berada di dusun-dusun bersama-sama orang Arab Badwi) Yakni orang-orang munafik berharap mereka tidak berada di Madinah namun berada di pelosok padang pasir akibat ketakutan yang menimpa mereka. يَسْـَٔلُونَ عَنْ أَنۢبَآئِكُمْ ۖ( sambil menanya-nanyakan tentang berita-beritamu) Yakni mereka bertanya kabar tentang kalian dan apa yang terjadi dengan kalian kepada setiap orang yang datang dari arah kalian tanpa menyaksikan sendiri peperangan itu karena besarnya ketakutan mereka dan lemahnya niat mereka. وَلَوْ كَانُوا۟ فِيكُم مَّا قٰتَلُوٓا۟ إِلَّا قَلِيلًا(Dan sekiranya mereka berada bersama kamu, mereka tidak akan berperang, melainkan sebentar saja) Akibat takut dari aib dan untuk melindungi rumah mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20. Mereka mengira, karena perasaan takut yang besar, bahwa golongan-golongan yang bersekutu itu belum pergi; dan jika golongan-golongan yang bersekutu itu datang kembali, niscaya mereka ingin berada di dusun-dusun bersama-sama orang Arab Badwi, sambil menanya-nanyakan tentang berita-beritamu. Dan sekiranya mereka berada bersama kamu, mereka tidak akan berperang, melainkan sebentar saja"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka mengira} mereka mengira {golongan-golongan itu belum pergi} belum pergi dari penyerangan {Jika golongan-golongan itu datang kembali} jika golongan-golongan itu kembali lagi untuk menyerang {sunggu mereka pasti ingin} mereka berharap {berada di dusun-dusun bersama-sama orang Arab Badui} keluar menuju dusun-dusun bersama orang Arab baduwi {sambil menanyakan berita kalian} kabar kalian {Seandainya mereka berada bersama kalian, niscaya mereka tidak akan berperang, kecuali sebentar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "20. “Mereka mengira golongan-golongan yang bersekutu itu belum pergi,” maksudnya, mereka menduga bahwa pasukan sekutu yang telah berkoalisi untuk memerangi Rasulullah dan para sahabatnya itu tidak akan pergi sebelum menghabisi mereka. Namun, dugaan mereka sia-sia dan perkiraan mereka gagal. “Dan jika golongan-golongan yang bersekutu itu datang,” sekali lagi, “niscaya mereka ingin berada di dusun-dusun bersama-sama orang Arab Badui, seandainya pasukan sekutu datang untuk kedua kalinya seperti pada kali ini, maka orang-orang munafik itu ingin agar mereka tidak ada di Madinah dan tidak juga berada dekat dengannya, dan mereka ingin bersama orang-orang Arab Badui di dusun-dusun, sambil mencari informasi tentang berita kalian, dan mereka bertanya-tanya kabar kalian, mengenai apa yang menimpa kalian. Sungguh mereka sangat celaka dan terkutuk. Mereka tidak termasuk orang yang bernilai kehadirannya. Dan kalaupun “mereka berada bersama kamu, niscaya mereka tidak akan berperang, melainkan sebentar saja,” maka kalian jangan menghiraukan mereka dan jangan berputus asa karena mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahzab ayat 20: Mereka orang-orang yang munafik sungguh sangat ketakutan, mereka menyangka bahwa peperangan ahzab tidak akan pernah usai dari Madinah dan tidak dapat dikalahkan. Maka jika telah datang musuh mengepung madinah, mereka menginginkan untuk tidak di Madinah, dan mereka menginginkan untuk bersama badui memantau kabar dari jauh. Seandainya mereka bersama kalian dalam peperangan, mereka tidak akan berperang kecuali hanya sebentar; Sungguh mereka adalah orang-orang yang pengecut dan lemah dalam keyakinan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kembali ke Mekah, karena takut kepada mereka. Mereka tidak ingin tinggal di Madinah dan tidak ingin dekat dengannya, dan ingin bersama dengan orang-orang Arab baduwi. Tentang perlawananmu dengan orang-orang kafir. Karena riya’ atau takut celaan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 20",
    "description": "Sifat pengecut, kikir, dan penakut itu mendarah daging dalam jiwa mereka dan bukan sesuatu yang baru. Mereka mengira bahwa golongan-golongan yahudi bani quraizah dan kafir mekah yang bersekutu itu belum benar-benar pergi dan akan kembali untuk membalas dendam. Dan karenanya, jika golongan-golongan yang bersekutu itu datang kembali untuk menyerang kaum mukmin, niscaya mereka yang munafik itu ingin berada di dusun-dusun dan rumah-rumah mereka bersama-sama orang arab badui dan tidak mau ikut perang, sambil terus menanyakan dan mengikuti perkembangan berita tentang kamu di medan perang tersebut. Dan sekiranya mereka berada bersamamu di medang perang, mereka tidak akan berperang melainkan sebentar saja karena mereka pengecut dan takut mati. 21. Rasulullah adalah teladan bagi manusia dalam segala hal, termasuk di medan perang. Sungguh, telah ada pada diri rasulullah itu suri teladan yang baik bagimu dalam semua ucapan dan perilakunya, baik pada masa damai maupun perang. Namun, keteladan itu hanya berlaku bagi orang yang hanya mengharap rahmat Allah, tidak berharap dunia, dan berharap hari kiamat sebagai hari pembalasan; dan berlaku pula bagi orang yang banyak mengingat Allah karena dengan begitu seseorang bisa kuat meneladani beliau."
  }
]