[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sungguh telah ada bagi kalian (wahai orang-orang yang beriman) pada perkataan rosululloh sholallohu alaihi wasallam, perbuatannya dan keadaannya suri tauladan yang baik bagi kalian yang baik untuk kalian teladani. Maka peganglah Sunnahnya, karena Sunnahnya dipegang dan dijalani oleh orang-orang yang berharap kepada Allah dan kehidupan akhirat, memperbanyak mengingat Allah dan beristigfar kepadaNya, serta bersyukur kepadaNya dalam setiap keadaan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Dan sesungguhnya di dalam ada yang diucapkan, dilakukan dan dikerjakan oleh Rasulullah terdapat suri teladan yang baik untuk kalian. Dia dengan jiwanya yang mulia mengikuti peperangan, maka bagaimana kalian pelit dengan jiwa kalian dari jiwa Rasulullah? Dan tidaklah mengikuti Rasulullah -ṣallallāhu 'alaihi wa sallam- kecuali orang-orang yang mengharapkan hari Akhir dan beramal untuk menghadapinya serta banyak mengingat Allah. Adapun orang yang tidak mengharapkan hari Akhir dan tidak banyak mengingat Allah, maka ia bukanlah orang yang mengikuti Rasulullah -ṣallallāhu 'alaihi wa sallam-."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "21. Hai orang-orang beriman, sungguh Rasulullah adalah teladan yang baik bagi kalian dalam setiap perkataan, perbuatan, dan tindak tanduknya. Maka wajib meneladaninya bagi orang yang beriman kepada Allah, yang mengharap pahala dari-Nya dan takut dari azab-Nya, serta memperbanyak zikir dengan lisan dan hatinya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "21. لَّقَدْ كَانَ لَكُمْ فِى رَسُولِ اللهِ أُسْوَةٌ حَسَنَةٌ (Sesungguhnya telah ada pada (diri) Rasulullah itu suri teladan yang baik bagimu) Yang telah mengorbankan dirinya untuk ikut berperang, dan pergi ke perang Khandak demi membela agama Allah. Dan Rasulullah merupakan teladan bagi seluruh orang beriman dalam segala langkahnya. لِّمَن كَانَ يَرْجُوا۟ اللهَ وَالْيَوْمَ الْاٰخِرَ(bagi orang yang mengharap (rahmat) Allah dan (kedatangan) hari kiamat) Yakni mengharap pahala Allah atau mengharap pertemuan dengan Allah, serta mengharap rahmat-Nya di hari kiamat atau membenarkan bahwa hari kiamat pasti terjadi. وَذَكَرَ اللهَ كَثِيرًا(dan banyak menyebut Allah) Karena dengan hal ini tercapai peneladanan dengan Rasulullah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "21. Sesungguhnya telah ada pada (diri) Rasulullah itu suri teladan yang baik bagimu (yaitu) bagi orang yang mengharap (rahmat) Allah dan (kedatangan) hari kiamat dan dia banyak menyebut Allah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh pada Rasulullah benar-benar ada suri teladan} teladan {yang baik bagi kalian, (yaitu) bagi orang yang mengharap (ridha) Allah dan hari kiamat serta yang banyak mengingat Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21. “Sesungguhnya telah ada pada (diri) Rasulullah itu suri tauladan yang baik bagimu,” di mana beliau menghadiri peperangan dengan jiwanya yang mulia itu, dan terjun langsung di medan perang, sedangkan beliau adalah manusia yang mulia lagi sempurna, pahlawan nan pemberani, lalu bagaimana bisa kalian kikir dengan diri kalian untuk melakukan suatu perkara yang mana Rasulullah sendiri langsung terjun padanya? Maka teladanilah beliau dalam perkara ini dan perkara yang lainnya. Para ulama ushuliyyun (ahli ushul al-fiqh) berargumen dengan ayat ini atas kehujjahan perbuatan Rasulullah. Dan bahwa hukum asalnya, umat Islam itu bersuri teladan kepadanya dalam semua hukum, kecuali ada dalil syar’I yang mengecualikan kekhususan beliau. Keteladanan itu ada dua macam: keteladanan yang baik dan keteladanan yang buruk. Keteladanan yang baik ada pada Rasulullah. Orang yang meneladani beliau berarti menelusuri jalan yang dapat mengantarkannya kepada kemuliaan Allah, yaitu jalan yang lurus. Sedangkan bersuri teladan kepada selain beliau, -apabila menyalahi beliau-, maka itulah teladan yang buruk. Seperti perkataan kaum musrikin saat mereka diseru oleh para Rasul untuk meneladani mereka, \"Sesungguhnya kami mendapati bapak-bapak kami menganut suatu agama, dan sesungguhnya kami orang-orang yang mendapat petunjuk dengan (mengikuti) jejak mereka.\" (Az-Zukhruf: 22). Suri teladan yang baik ini hanya akan ditelusuri dan diikuti oleh orang yang menginginkan Allah dan Hari akhir. Hal itu terjadi karena iman yang dimilikinya, rasa takut kepada Allah dan mengharapkan pahala kepadaNYa, takut akan siksaNya yang semuanya mendorongnya untuk meneladani Rasulullah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahzab ayat 21: Sungguh bagi kalian wahai orang-orang yang beriman untuk berpegang teguh dalam ucapan, tindakan dan keadaan untuk mengikuti Rasul ﷺ untuk dijadikan contoh yang baik yang tidak putuh asa, dimana bersungguh-sungguh atas dirinya menolong agama Allah; Berpegang teguhlah dengan sunnahnya, dan tetaplah di atas prinsip ﷺ dalam peperangan, bersabarlah sebagaimana kesabaran ﷺ dalam dakwah dan jihad dan seluruh kondisi, dan beramallah sebagaimana amalan-amalan ﷺ serta jangan berputus asa dari mengharap pahala dari Allah dan kasih sayangnya di akhirat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Beliau berani berperang dan terjun ke dalam kancah pertempuran, lalu mengapa kamu kikir mengorbankan jiwamu untuk sesuatu yang Rasulullah shallallahu 'alaihi wa sallam saja berani mengorbankannya? Maka ikutilah Beliau dalam hal ini dan dalam hal lainnya. Para ahli ushul berdalil dengan ayat ini tentang kehujjahan perbuatan Rasulullah shallallahu 'alaihi wa sallam. Demikian pula, bahwa hukum asalnya, umat Beliau mengikuti juga dalam hal hukum, kecuali ada dalil syar’i yang mengkhususkan untuk Beliau. Yang beruswah (meneladani) Beliau dan diberi taufik kepadanya hanyalah orang yang berharap rahmat Allah dan kedatangan hari Akhir, di mana iman yang ada padanya, rasa takutnya kepada Allah, berharapnya kepada pahala-Nya serta takut kepada siksa-Nya mendorongnya untuk mengikuti Rasulullah shallallahu 'alaihi wa sallam. Ada yang mengartikan, bagi orang yang takut kepada Allah dan hari akhir."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 21",
    "description": "Rasulullah adalah teladan bagi manusia dalam segala hal, termasuk di medan perang. Sungguh, telah ada pada diri rasulullah itu suri teladan yang baik bagimu dalam semua ucapan dan perilakunya, baik pada masa damai maupun perang. Namun, keteladan itu hanya berlaku bagi orang yang hanya mengharap rahmat Allah, tidak berharap dunia, dan berharap hari kiamat sebagai hari pembalasan; dan berlaku pula bagi orang yang banyak mengingat Allah karena dengan begitu seseorang bisa kuat meneladani beliau. 22. Salah satu keteladanan rasulullah adalah tidak gentar berhadapan dengan musuh. Inilah yang seharusnya diteladani oleh orang-orang mukmin pada perang khandak. Dan ketika orang-orang mukmin melihat golongan-golongan yahudi bani quraizah dan kafir mekah yang bersekutu itu, mereka berkata, 'inilah yang dijanjikan Allah dan rasul-Nya kepada kita. Kita akan memperoleh kemenangan setelah kekalahan kita pada perang uhud. ' dan benarlah janji Allah dan rasul-Nya. Dan keadaan yang demikian sulit dan berat itu justru menambah keimanan dan keislaman mereka."
  }
]