[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Manakala orang-orang Mukmin melihat pasukan Ahzab yang berkumpul mengepung Madinah, mereka teringat bahwa waktu kemenangan sudah dekat. Mereka berkata, “Inilah yang Allah dan RasulNya janjikan kepada kita, berupa ujian, cobaan dan akhirnya kemenangan.” Maka Allah menunaikan janjiNya dan rasulullah benar dalam berita gembira yang disampaikannya. Dan tidak menambah penglihatan mereka kepada Kedatangan pasukan Ahzab kecuali bertambah iman kepada Allah, kepasrahan kepada takdirNya, dan ketundukan kepada perintahNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "22. Maka tatkala orang-orang yang beriman melihat golongan-golongan itu berkumpul untuk memerangi mereka, mereka berkata, “Inilah yang dijanjikan oleh Allah dan Rasul-Nya berupa cobaan, ujian dan pertolongan, dan benarlah Allah dan Rasul-Nya dalam hal ini, dan memang telah nyata terjadi. Dan penglihatan mereka terhadap golongan-golongan itu tidak menambah bagi mereka kecuali keimanan kepada Allah dan kepatuhan terhadap-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "22. Allah memuji orang-orang beriman dan sikap mereka pada perang ahzab: Ketika orang-orang beriman menyaksikan pasukan besar orang-orang kafir yang mengepung kota Madinah, mereka berkata: “Pasukan besar orang-orang kafir yang kita saksikan mengepung kota Madinah ini adalah apa yang Allah dan rasul-Nya janjikan kepada kita berupa salah satu kebaikan; yaitu kemenangan atau mati syahid. Dan Allah dan rasul-Nya benar dalam janjinya ini.” Pengepungan orang-orang kafir itu hanya menambah keteguhan orang-orang beriman di atas keimanan mereka dan penyerahan diri mereka kepada ketetapan Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "22. وَلَمَّا رَءَا الْمُؤْمِنُونَ الْأَحْزَابَ قَالُوا۟ هٰذَا مَا وَعَدَنَا اللهُ وَرَسُولُهُۥ (Dan tatkala orang-orang mukmin melihat golongan-golongan yang bersekutu itu, mereka berkata: “Inilah yang dijanjikan Allah dan Rasul-Nya kepada kita”) Mereka mengatakan ini sebagai kegembiraan mereka atas terjadinya apa yang Allah dan rasul-Nya janjikan bagi mereka yaitu datangnya pasukan ini. Sebab kedatangannya akan berakhir dengan pertolongan dan kemenangan dari Allah. وَصَدَقَ اللهُ وَرَسُولُهُۥ ۚ( Dan benarlah Allah dan Rasul-Nya) Yakni tampaklah kebenaran apa yang dikabarkan Allah dan Rasul-Nya. وَمَا زَادَهُمْ إِلَّآ إِيمٰنًا وَتَسْلِيمًا(Dan yang demikian itu tidaklah menambah kepada mereka kecuali iman dan ketundukan) Yakni mereka tidak melihat pasukan musuh itu kecuali akan bertambah keimanan dan penyerahan diri mereka kepada Allah. Dan ini menjadikan mereka semakin mengerahkan kekuatan mereka dalam berperang dan dalam melawan tipu daya musuh-musuh Allah dan rasul-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "22. Dan tatkala orang-orang mukmin melihat golongan-golongan yang bersekutu itu, mereka berkata: \"Inilah yang dijanjikan Allah dan Rasul-Nya kepada kita\". Dan benarlah Allah dan Rasul-Nya. Dan yang demikian itu tidaklah menambah kepada mereka kecuali iman dan ketundukan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika orang-orang mukmin melihat golongan-golongan itu, mereka berkata,“Inilah yang dijanjikan Allah dan RasulNya kepada kita” Benarlah Allah dan RasulNya. Hal itu tidak menambah apapun untuk mereka kecuali keimanan dan ketundukkan} dan tunduk kepada perintah-perintahNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "22. Setelah Allah menjelaskan keadaan orang-orang munafik dalam keadaan takut, maka berikutnya Allah menjelaskan keadaan kaum Mukminin, seraya berfirman, “Dan tatkala orang-orang Mukmin melihat golongan-golongan yang bersekutu,” yang telah berkoalisi dan telah menempati tempat-tempatnya, dan rasa takut pun telah hilang “mereka berkata, ‘Inilah yang dijanjikan Allah dan RasulNya kepada kita’,” yaitu dalam FirmanNYa, \"Apakah kamu mengira bahwa kamu akan masuk surga, padahal belum datang kepadamu (cobaan) sebagaimana halnya orang-orang terdahulu sebelum kamu? Mereka ditimpa oleh malapetaka dan kesengsaraan, serta digoncangkan (dengan bermacam-macam cobaan) sehingga berkatalah Rasul dan orang-orang yang beriman bersamanya: \"Bilakah datangnya pertolongan Allah?\" Ingatlah, sesungguhnya pertolongan Allah itu amat dekat.\" (Al-Baqarah:214). “Dan benarlah Allah dan RasulNya,” sebab kami telah melihat apa yang telah diberitakanNYa kepada kami. “Dan tidaklah menambah kepada mereka,” perkara itu, “kecuali iman,” di dalam hati mereka “dan ketundukan,” dalam seluruh anggota tubuh mereka, dan mereka bertambah patuh kepada perintah Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahzab ayat 22: Ketika orang-orang beriman melihat golongan-golongan yang bersekutu tersebut yang mereka telah datang di Madinah, mereka berkata dengan keimanan dan ikhlas : Inilah janji yang telah Allah dan Rasul-Nya janjikan. Dan telah nyata akan janji tersebut, dan tidaklah keadaan tersebut terjadi kecuali bertambah keimanan mereka, dan semakin bertambah keislaman mereka untuk urusan Tuhan mereka. Dalam keadaan demikian Allah memuji mereka yang beriman, yang kokoh dalam peperangan Ahzab."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah menyebutkan keadaan kaum munafik ketika takut, Dia menyebutkan keadaan kaum mukmin. Yang dijanjikan Allah dan Rasul-Nya itu ialah kemenangan setelah mengalami kesusahan atau ujian dan pertolongan-Nya. Dalam berjanji. Karena kami menyaksikan apa yang Dia beritakan kepada kami. Dalam hati mereka. Yakni ketundukan kepada perintah-Nya. Setelah Allah Subhaanahu wa Ta'aala menyebutkan tentang kaum munafik yang berjanji kepada Allah untuk tidak mundur, tetapi ternyata mereka mengingkari janjinya, maka pada ayat selanjutnya Allah menyebutkan tentang kaum mukmin, di mana mereka memenuhi janjinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 22",
    "description": "Salah satu keteladanan rasulullah adalah tidak gentar berhadapan dengan musuh. Inilah yang seharusnya diteladani oleh orang-orang mukmin pada perang khandak. Dan ketika orang-orang mukmin melihat golongan-golongan yahudi bani quraizah dan kafir mekah yang bersekutu itu, mereka berkata, 'inilah yang dijanjikan Allah dan rasul-Nya kepada kita. Kita akan memperoleh kemenangan setelah kekalahan kita pada perang uhud. ' dan benarlah janji Allah dan rasul-Nya. Dan keadaan yang demikian sulit dan berat itu justru menambah keimanan dan keislaman mereka. 23. Di antara sifat mulia beliau yang harus diteladani oleh setiap mukmin adalah memenuhi janji. Di antara orang-orang mukmin yang beriman dengan sesungguhnya itu ada orang-orang yang menepati apa yang telah mereka janjikan kepada Allah untuk sabar dan tegar menghadapi kesulitan. Dan di antara mereka ada yang gugur, seperti pada perang uhud, dan di antara mereka ada pula yang menunggu-nunggu apa yang Allah janjikan, seperti pertolongan-Nya pada perang khandak, dan mereka sedikit pun tidak mengubah janjinya."
  }
]