[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan diantara orang-orang Mukmin ada orang-orang yang memenuhi perjanjian mereka dengan Allah, bersabar di atas kesulitan, kesempitan dan pada saat perang. Dan diantara mereka ada yang telah memenuhi janjinya dan gugur sebagai syahid di jalan Allah atau mati di atas kebenaran dan telah memenuhi janji. Dan diantara mereka ada yang menunggu satu dari dua kebaikan, kemenangan atau mati syahid. Mereka tidak merubah perjanjian dengan Allah, tidak menggantinya dan tidak membatalkannya sebagaimana yang dilakukan oleh orang-orang munafik."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "23. Di antara kaum mukminin ada orang-orang yang jujur kepada Allah, mereka menepati apa yang telah mereka janjikan kepada Allah berupa keteguhan dan kesabaran saat berjihad di jalan Allah. Di antara mereka ada yang meninggal atau terbunuh di jalan Allah, dan di antara mereka ada yang menunggu mati syahid di jalan-Nya. Orang-orang yang beriman ini tidak merubah apa yang telah mereka janjikan kepada Allah, tidak sebagaimana yang dilakukan oleh orang-orang munafik terhadap janji-janji mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "23. Di antara orang-orang beriman itu terdapat orang-orang agung yang menepati janji yang mereka berikan kepada Allah dan rasul-Nya untuk mendengar dan mentaati perintah, sehingga mereka teguh di dalam peperangan. Sebagian mereka terbunuh di jalan Allah, dan sebagian yang lain menunggu kemenangan atau kesyahidan di jalan Allah. Mereka sama sekali tidak mengingkari janji itu dan tidak mengubahnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "23. مِّنَ الْمُؤْمِنِينَ رِجَالٌ صَدَقُوا۟ مَا عٰهَدُوا۟ اللهَ عَلَيْهِ ۖ (Di antara orang-orang mukmin itu ada orang-orang yang menepati apa yang telah mereka janjikan kepada Allah) Mereak menepati janji yang mereka berikan kepada Rasulullah pada malam ‘Aqabah untuk teguh bersama beliau dan melawan orang yang memerangi beliau. Berbeda halnya dengan orang yang berdusta dalam janjinya dan mengkhianati Allah dan Rasul-Nya, yaitu orang-orang munafik. Pendapat lain mengatakan mereka adalah orang-orang yang bernazar pada perang Badar jika mereka bertemu dengan musuh, maka mereka akan memeranginya sampai mereka terbunuh atau diberi kemenangan oleh Allah. Dan ketika perang Ahzab terjadi mereka benar-benar menunaikan nazar mereka sebagaimana yang mereka harapkan hingga mereka terbunuh di jalan Allah. وَمِنْهُم مَّن يَنتَظِرُ ۖ( Dan di antara mereka ada (pula) yang menunggu-nunggu) Yakni tetap menunggu untuk menunaikan nazar mereka sampai ajal mereka datang, mereka tetap dalam keteguhan dan tetap berperang sampai menemui apa yang mereka inginkan yaitu memperoleh keutamaan mati syahid. وَمَا بَدَّلُوا۟ تَبْدِيلًا(dan mereka tidak merubah (janjinya)) Yakni mereka tidak mengganti janji yang mereka berikan kepada Allah dan rasul-Nya, tidak seperti yang dilakukan orang-orang munafik yang mengganti janji mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "23. Di antara orang-orang mukmin itu ada orang-orang yang menepati apa yang telah mereka janjikan kepada Allah; maka di antara mereka ada yang gugur. Dan di antara mereka ada (pula) yang menunggu-nunggu dan mereka tidak merubah (janjinya), Ayat ini turun untuk Anas bin Nadhir yang menghilang dari perang Badr. Sehingga dia berjanji kepada Allah untuk ikut berperang pada peperangan yang lain. Sehingga dia mati syahid dalam perang Uhud. Maka didapati pada jenazahnya 81 bekas luka dari pukulan, tikaman, dan panahan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Di antara orang-orang mukmin itu ada orang-orang yang menepati apa yang telah mereka janjikan kepada Allah. Di antara mereka ada yang gugur} menepati janjinya, lalu dia berperang sehingga dia terbunuh dalam keadaan syahid {dan di antara mereka ada yang menunggu-nunggu. Mereka tidak mengubah apapun} dan mereka tidak mengubah apapun, bahkan teguh pada janji mereka dengan keadaan senang pada janji itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "23. Dan ketika Allah menyebutkan bahwasanya orang-orang munafik telah berjanji kepada Allah untuk tidak berpaling (melarikan diri) dan mereka telah membatalkan janji tersebut, maka Allah menyebutkan sikap tepat janji kaum Mukminin, seraya berfirman, ”Di antara orang-orang Mukmin itu ada orang-orang yang menepati apa yang mereka janjikan kepada Allah,” maksudnya, mereka menunaikannya, melaksanakan dan menyempurnakannya. Mereka pun mengorbankan jiwa raga mereka di dalam ketaatan kepadaNYa. “Maka di antara mereka ada yang gugur,” maksudnya, menuntaskan keinginan dan harapannya serta hak yang menjadi tanggungannya. Lalu dia terbunuh fi sabilillah atau meninggal dalam keadaan sudah melaksanakan kewajibannya, tanpa mengurangi sedikitpun, “dan di antara mereka ada pula yang menunggu-nunggu,” penyempurnaan kewajibannya. Ia sedang menunaikan apa yang menjadi kewajibannya bdan sedang memenuhi keinginannya, namun dia belum menuntaskannya; sedangkan ia berharap bisa menyempurnakannya, berupaya dan bersungguh-sungguh untuk hal itu. “Dan mereka sedikit pun tidak merubah,” seperti kelompok yang lain (kaun munafikin) telah merubahnya. Malah mereka tetap berpegang pada janji, mereka tidak berpaling dan tidak pula merubah. Mereka itulah sosok orang-orang besar yang sejati, sedangkan orang-orang selain mereka, raganya adalah raga manusia jantan, sedangkan sifat-sifat mereka sungguh sangat jauh dari sifat-sifat orang-orang besar."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahzab ayat 23: Allah memuji orang-orang yang imannya jujur, yang ikhlas, Allah berkata : Di antara orang-orang yang beriman dari kalangan laki-laki ada yang menyempurnakan janji kepada Allah dengan tetap bersama Rasul ﷺ; Di antara mereka ada laki-laki yang syahid di jalan Allah, di antara mereka juga ada yang menunggu untuk syahid di jalan Allah dan mencari-cari kesempatan (berjihad). Mereka tidak mengingkari janji-janji mereka yang mereka berjanji kepada Allah, sebagaimana perbuatan orang-orang munafik yang merubah dan menggantikan janji-janji mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Imam Bukhari meriwayatkan dengan sanadnya yang sampai kepada Anas radhiyallahu 'anhu ia berkata, “Pamanku Anas bin An Nadhr tidak hadir dalam perang Badar. Ia berkata, “Wahai Rasulullah, aku pernah tidak hadir dalam peperangan pertama yang engkau lakukan terhadap orang-orang musyrik. Sungguh, jika Allah menghadirkan aku dalam peperangan dengan kaum musyrik, tentu Allah akan melihat apa yang aku lakukan.” Ketika tiba perang Uhud, dan kaum muslimin terpukul mundur, ia berkata, “Ya Allah, aku meminta uzur kepadamu terhadap perbuatan mereka ini –yakni kawan-kawannya-, dan aku berlepas diri kepada-Mu dari mereka ini,” yakni kaum musyrik. Ia kemudian maju, lalu ditemui Sa’ad bin Mu’adz, kemudian ia berkata kepadanya, “Wahai Sa’ad bin Mu’adz! Surga. Demi Tuhan si Nadhr, sesungguhnya aku mencium wanginya di balik Uhud.” Sa’ad berkata, “Aku tidak sanggup melakukan seperti yang dilakukannya.” Anas berkata, “Kami dapati dirinya dipenuhi 80 lebih sabetan pedang, tusukan tombak, atau lemparan panah. Kami temukan dia telah terbunuh dan dicincang oleh kaum musyrik. Tidak ada yang mengetahuinya selain saudarinya berdasarkan jari-jamarinya.” Anas melanjutkan kata-katanya, “Kami mengira atau menyangka bahwa ayat (tersebut) ini turun berkenaan dengan dirinya dan orang yang semisalnya, “Di antara orang-orang mukmin itu ada orang-orang yang menepati apa yang telah mereka janjikan kepada Allah…dst.” Yaitu tetap teguh bersama Nabi shallallahu 'alaihi wa sallam. Mereka memenuhi janji itu dan menyempurnakannya serta mengorbankan jiwa raga mereka untuk mencari keridhaan-Nya. Mati dalam keadaan hendak memenuhi hak-Nya atau terbunuh di jalan Allah. Maksudnya berusaha untuk memenuhi janjinya itu. Tidak seperti orang-orang munafik. Mereka inilah laki-laki yang sejati, adapun kaum munafik, maka mereka hanya berpenampilan lelaki, tetapi sifatnya tidak demikian."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 23",
    "description": "Di antara sifat mulia beliau yang harus diteladani oleh setiap mukmin adalah memenuhi janji. Di antara orang-orang mukmin yang beriman dengan sesungguhnya itu ada orang-orang yang menepati apa yang telah mereka janjikan kepada Allah untuk sabar dan tegar menghadapi kesulitan. Dan di antara mereka ada yang gugur, seperti pada perang uhud, dan di antara mereka ada pula yang menunggu-nunggu apa yang Allah janjikan, seperti pertolongan-Nya pada perang khandak, dan mereka sedikit pun tidak mengubah janjinya. 24. Tujuan dari pemberian keadaan yang sulit dan berat itu kepada orang mukmin adalah agar Allah memberikan balasan kepada orang-orang yang benar imannya itu karena kebenarannya dengan bersabar dalam menghadapi kesulitan, dan mengazab orang munafik yang berkhianat dan merusak perjanjian, jika dia kehendaki, atau menerima tobat mereka jika mau bertobat setelah memperoleh hidayah-Nya. Sungguh, Allah maha pengampun kepada hamba yang bertobat, maha penyayang kepada hamba yang berharap rahmat-Nya."
  }
]