[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah hendak membalas orang-orang yang imannya benar karena kebenaran iman mereka dan perjuangan mereka, dan mereka adalah orang-orang Mukmin. Dan Allah menyiksa orang-orang munafik bila Dia berkenan menyiksa mereka dengan tidak membimbing mereka untuk bertaubat dengan taubat nasuha sebelum kematian, sehingga mereka mati di atas kekafiran, akibatnya mereka berhak masuk neraka, atau Allah menerima taubat mereka dengan membimbing mereka untuk bertaubat dan kembali kepadaNya. Sesungguhnya Allah Maha Pengampun terhadap dosa-dosa orang-orang yang melampaui batas atas diri mereka sendiri bila mereka bertaubat, lagi Maha Penyayang terhadap mereka, di mana Dia membimbing mereka untuk bertaubat dengan baik."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. Agar Allah membalas orang-orang jujur yang telah menepati janji kepada Allah dengan melaksanakan janji tersebut secara jujur dan maksimal. Dan agar Allah menyiksa orang-orang munafik yang mengingkari janji-janji mereka jika Allah berkehendak, dengan cara mematikan mereka sebelum mereka bertobat dari kekufuran, atau dengan mengampuni mereka dengan memberi mereka petunjuk untuk bertobat. Dan Allah Maha Pengampun bagi orang yang bertobat dari dosa-dosanya, dan Maha Penyayang kepadanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "24. Agar Allah membalas orang-orang yang benar dalam memegang janji dengan balasan yang baik berkat ketaatan penuh mereka; dan agar Allah mengazab orang-orang munafik jika Allah menghendakinya apabila mereka tetap dalam kemunafikan, atau mengampuni mereka apabila mereka bertaubat. Allah Maha Mengampuni dan Maha Mengasihi orang-orang yang bertaubat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "24. وَيُعَذِّبَ الْمُنٰفِقِينَ (dan menyiksa orang munafik) Karena mereka mengganti dan merubah janji yang telah mereka buat. Apabila Allah menghendaki maka Allah akan menyiksa mereka jika mereka tetap di atas kemunafikan dan tidak bertaubat. أَوْ يَتُوبَ عَلَيْهِمْ ۚ (atau menerima taubat mereka) Jika Allah menghendakinya. إِنَّ اللهَ كَانَ غَفُورًا رَّحِيمًا(Sesungguhnya Allah adalah Maha Pengampun lagi Maha Penyayang) Yakni bagi orang yang bertaubat diantara mereka dan berhenti dari kemunafikannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "24. supaya Allah memberikan balasan kepada orang-orang yang benar itu karena kebenarannya, dan menyiksa orang munafik jika dikehendaki-Nya, atau menerima taubat mereka. Sesungguhnya Allah adalah Maha Pengampun lagi Maha Penyayang"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{agar Allah memberi balasan kepada orang-orang yang benar itu karena kebenarannya dan mengazab orang munafik jika Dia menghendaki atau menerima taubat mereka. Sesungguhnya Allah Maha Pengampun lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "24. “Supaya Allah memberikan balasan kepada orang-orang yang benar itu karena kebenarannya,”: maksudnya, disebabkan kejujuran mereka dalam perkataaan, berbagai kondisi dan muamalah mereka bersama Allah serta kesamaan lahir dengan batin mereka. Allah berfirman, \"\"Ini adalah suatu hari yang bermanfaat bagi orang-orang yang benar kebenaran mereka. Bagi mereka surga yang dibawahnya mengalir sungai-sungai; mereka kekal di dalamnya selama-lamanya; Allah rida terhadap mereka dan mereka pun rida terhadap-Nya. Itulah keberuntungan yang paling besar.\" (Al-Maidah:119). Maksudnya, Kami telah menetapkan berbagai cobaan, ujian dan goncangan ini adalah agar orang yang jujur bisa dibedakan dari orang yang dusta, sehingga orang-orang yang jujur diberi balasan disebabkan kejujuran mereka. “Dan menyiksa orang-orang munafik,” yang hati dan amal perbuatan mereka berubah saat terjadinya cobaan, dan mereka tidak menunaikan apa telah bmereka janjikan kepada Allah. “Jika dikehendakiNya” menyiksa mereka, yaitu dengan cara tidak menghendaki mereka mendapat petunjuk. Bahkan Allah sudah mengetahui bahwa mereka sama sekali tidak mengandung kebaikan, maka Allah tidak memberi mereka taufikNya, “atau menerima taubat mereka,” dengan cara membimbing mereka bertaubat dan berinabah. Dan inilah yang sering terjadi bagi kemurahan dari DZat Yang Maha Pemurah. Maka dari itu ayat ini ditutup dengan dua nama (Nya) yang mengandung makna maghfirah, karunia dan ihsan (kebaikan), seraya berfirman, “Sesungguhnya Allah adalah Maha Pengampun,” mengampuni dosa-dosa orang-orang yang telah terlanjur melampaui batas terhadap diri mereka sendiri, sekalipun mereka telah banyak melakukan kemaksiatan, selama mereka datang dengan bertaubat, “lagi Maha Penyayang,” terhadap mereka, yang mana DIa telah membimbing mereka kepada taubat, lalu menerima taubat dan menghapus dosa-dosa yang telah mereka lakukan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahzab ayat 24: Ketahuilah barangsiapa yang ikut serta dalam peperangan ahzab, maka Allah akan memberikan pahala dan Allah membalas orang-orang yang jujur dalam niat, ucapan, dan amalah karena sebab kejujuran mereka. Dan Allah akan mengadazab orang-orang munafik jika Allah menghendaki dengan sebab mundurnya mereka dan mengingkari perjanjian mereka dan keberlanjutan mereka di atas kemunafikan, dan jika Allah menghendaki, mereka akan bertaubat, dan Allah ampunkan karena sebab taubat mereka dan karena sebab mereka melepaskan kemunafikan mereka. Sungguh Allah Maha Pengampun, bagi orang-orang yang berpaling atas diri-diri mereka kepada dosa jika mereka bertaubat, dan Maha Penyayang bagi hamba-Nya yang bertaubat dan menerima taubat mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dalam ucapannya, dalam keadaannya, serta hubungan mereka dengan Allah, dan samanya keadaan luar dan dalam mereka. Yang hati dan amal mereka berubah ketika terjadi fitnah, serta tidak memenuhi janji mereka kepada Allah. Yaitu dengan mencabut nyawanya di atas kemunafikan dan tidak memberinya hidayah, karena Dia mengetahui tidak ada lagi kebaikan dalam hati mereka. Dengan memberi mereka taufik untuk bertobat dan kembali. Inilah yang biasa terjadi dalam kepemurahan Allah Subhaanahu wa Ta'aala. Oleh karena itulah, Dia mengkahiri ayat ini dengan dua nama-Nya yang menunjukkan kepada ampunan, karunia dan ihsan-Nya. Dia mengampuni dosa orang yang melampaui batas meskipun banyak dosanya, jika mereka bertobat. Dia memberi mereka taufik untuk bertobat, lalu menerimanya dan menutupi dosa yang mereka lakukan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 24",
    "description": "Tujuan dari pemberian keadaan yang sulit dan berat itu kepada orang mukmin adalah agar Allah memberikan balasan kepada orang-orang yang benar imannya itu karena kebenarannya dengan bersabar dalam menghadapi kesulitan, dan mengazab orang munafik yang berkhianat dan merusak perjanjian, jika dia kehendaki, atau menerima tobat mereka jika mau bertobat setelah memperoleh hidayah-Nya. Sungguh, Allah maha pengampun kepada hamba yang bertobat, maha penyayang kepada hamba yang berharap rahmat-Nya. 25. Dan pada akhir perang khandak Allah menghalau orang-orang kafir itu dengan mengirim angin kencang yang membuat keadaan mereka penuh kejengkelan karena menderita kekalahan tanpa peperangan dan mereka juga tidak memperoleh keuntungan apa pun, baik ganimah maupun tawanan perang. Dengan demikian, cukuplah Allah yang menolong menghindarkan orang-orang mukmin dalam peperangan karena musuh mereka hancur tersapu angin kencang. Dan Allah mahakuat, mahaperkasa; tidak ada yang mampu mengalahkan dan melemahkan-Nya."
  }
]