[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Allah menolak Ahzab (koalisi) kafir Madinah dengan membawa kekalahan, kerugian dan kemarahan, mereka tidak meraih kebaikan dunia dan akhirat. Dan Allah mencukupkan bagi orang-orang yang beriman dengan sebab-sebab yang dengannya Dia mendukung mereka sehingga mereka tidak perlu berperang. Allah Mahakuat sehingga tidak terkalahkan dan tidak ditundukkan, juga Mahaperkasa pada kerajaan dan kekuasaanNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "25. Dan Allah menghalau orang-orang Quraisy, Ghaṭafān, dan orang-orang yang bersama mereka dalam kondisi penuh kesedihan dan kelesuan karena tidak mendapatkan apa yang mereka harapkan. Mereka tidak berhasil menghacurkan kaum mukminin. Dan Allah menghindarkan kaum mukminin dari peperangan dengan mengirimkan angin dan Malaikat. Allah Mahakuat lagi Maha Perkasa, tidak ada seorangpun yang mampu mengalahkan-Nya, Allah pasti akan menundukkan dan menghinakannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "25-27. Allah menjadikan pasukan Ahzab pergi meninggalkan kota Madinah dengan kegagalan, tidak berhasil merealisasikan sedikitpun apa yang mereka inginkan. Dan Allah menjadikan orang-orang beriman tidak perlu berperang berkat siksaan yang Allah turunkan kepada orang-orang kafir itu. Allah Maha Kuat, tidak ada satupun yang dapat mengalahkan-Nya, dan Maha Perkasa dalam memberi balasan. Dan Allah menurunkan orang-orang Yahudi dari Bani Quraidhah dari benteng-benteng mereka karena telah melanggar perjanjian. Allah memasukkan rasa takut ke dalam hati mereka ketika bertemu dengan kalian -hai orang-orang beriman-, sehingga kalian dapat membunuh sebagian mereka dan menawan sebagian lainnya. Dan Allah mewariskan kepada kalian tanah, tempat tinggal, dan harta mereka, baik itu harta bergerak maupun harta tidak bergerak; dan Allah mewariskan kepada kalian tanah yang belum kalian pijak, dengan berbagai penakhlukan yang terjadi setelah perang Ahzab. Allah Maha Kuasa dalam melakukan sesuatu, tidak ada yang sulit bagi-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "25. وَرَدَّ اللهُ الَّذِينَ كَفَرُوا۟ (Dan Allah menghalau orang-orang yang kafir itu) Yakni pasukan perang Ahzab itu. بِغَيْظِهِمْ لَمْ يَنَالُوا۟ خَيْرًا ۚ( yang keadaan mereka penuh kejengkelan, (lagi) mereka tidak memperoleh keuntungan apapun) Allah mengembalikan mereka dengan rasa jengkel karena tidak mendapat kebaikan yang mereka anggap yaitu mengalahkan kaum muslimin. Dan mereka kembali dengan kerugian dan tidak mendapatkan kecuali lelahnya perjalanan dan kerugian harta. وَكَفَى اللهُ الْمُؤْمِنِينَ الْقِتَالَ ۚ( Dan Allah menghindarkan orang-orang mukmin dari peperangan) Dengan angin dan pasukan malaikat yang Allah kirimkan bagi mereka. وَكَانَ اللهُ قَوِيًّا(Dan adalah Allah Maha Kuat) Atas apa yang Dia inginkan. عَزِيزًا(lagi Maha Perkasa) Tidak ada yang mampu melawan-Nya dalam kekuasaan-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "25. Allah menghalau orang-orang yang kafir itu yang keadaan mereka penuh kejengkelan, (lagi) mereka tidak memperoleh keuntungan apapun. Dan Allah menghindarkan orang-orang mukmin dari peperangan. Dan adalah Allah Maha Kuat lagi Maha Perkasa dan Maha Mengalahkan musuh-musuh-Nya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah menghalau orang-orang kafir itu dalam keadaan jengkel} dalam keadaan jengkel dan menderita {Mereka tidak memperoleh kebaikan} mereka tidak menerima kemenangan dan tidak pula harta rampasan {Cukuplah Allah yang menghindarkan orang-orang mukmin dari peperangan. Allah Maha kuat lagi Maha perkasa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "25. “Dan Allah menghalau orang-orang yang kafir itu yang keadaan mereka penuh kejengkelan, lagi mereka tidak memperoleh keuntungan apa pun,” maksudnya, Allah mengembalikan mereka dalam kegagalan, mereka sama sekali tidak memperoleh target yang selama ini sangat mereka inginkan, dengan penuh rasa jengkel, karena merasa mampu menguasai, dan berkeyakinan bahwa kemenangan ada di pihak mereka. Mereka telah terpedaya dengan jumlah mereka yang sangat besar dan merasa bangga dengan koalisi yang mereka bangun dan sangat senang dengan persiapan dan njumlah mereka. Lalu Allah meniupkan angin topan besar, yaitu angin puyuh yang memporak-porandakkan markas pertahanan mereka dan mengobrak-abrik kemah-kemah mereka, menumpahkan panci-panci besar mereka, serta membuat mereka kebingungan, dan Allah pun menimpakan rasa takut kepada mereka. Akhirnya mereka pun pulang dengan rasa jengkel. Ini bagian dari pertolongan Allah kepada hamba-hambaNya yang beriman. “Dan Allah menghindarkan orang-orang Mukmin dari peperangan,” dengan cara yang Dia lakukan terhadap mereka, sepertyi faktor-faktor alamiah dan yang bersifat taqdiri. “Dan Allah Mahakuat lagi Mahaperkasa.” Tidaklah seseorang berupaya mengalahkanNya melainkan ia pasti kalah, dan tidaklah seseorang meminta pertolongan kepadaNYa, melainkan pasti dia menang, tidak ada suatu penghalang pun yang dapat menghalangi kehendakNya, dan tidak berguna kekuatan dan keperkasaan orang-orang yang memiliki kekuatan dan keperkasaan jika Dia tidak menolong mereka dengan kekuatan dan keperkasaanNYa."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahzab ayat 25: Allah menjelaskan tempat kembali keburukan setelah berakhirnya perang ahzab (bagi orang-orang kafir); Dimana Allah membalas mereka orang-orang yang gagal, rugi dan marah, yang mereka tidak mendapatkan kebaikan; Bahkan mereka mendapatkan penghinaan dan kepayahan. Cukuplah Allah menjadi (penolong) atas peperangan orang-orang yang beriman, menjadi sebab-sebab seperti hawa yang sangat dingin, angin yang menerjang kemah-kemah mereka dan menerbangkannya, sungguh Allah Maha Kuat pada kerajaan-Nya, Maha Gagah dalam membalas."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah mengembalikan mereka dalam keadaan kecewa, apa yang mereka harapkan tidak tercapai me iiiiiiivcskipun mereka telah menyiapkan segala sesuatunya, mereka dibuat bangga dengan pasukannya serta bergembira dengan perlengkapan dan jumlahnya. Allah mengirimkan kepada mereka angin kencang (yaitu angin timur) yang menggoncang markaz mereka, merobohkan kemah-kemah mereka, membalikkan periuk mereka, membuat mereka cemas, dan Allah masukkan ke dalam hati mereka rasa ketakutan sehingga mereka pun pulang dalam keadaan jengkel. Ini termasuk pertolongan Allah kepada hamba-hamba-Nya. Imam Nasa’i meriwayatkan dengan sanadnya yang sampai kepada Abdurrahman bin Abi Sa’id dari bapaknya, (ia berkata), “Kaum musyrik membuat kami sibuk pada perang Khandaq sehingga (kami) tidak sempat shalat Zhuhur hingga tenggelam matahari. Hal itu sebelum turun apa yang Allah ‘Azza wa Jalla turunkan tentang perang (yaitu), “Cukuplah Allah (yang menolong) menghindarkan orang-orang mukmin dalam peperangan,” maka Rasulullah shallallahu 'alaihi wa sallam memerintahkan Bilal untuk iqamat, ia pun iqamat, kemudian Beliau shalat sebagaimana shalat pada waktunya, lalu Bilal iqamat untuk shalat Ashar, maka Beliau shalat sebagaimana shalat pada waktunya. Kemudian Bilal mengumandangkan azan Maghrib, lalu shalat sebagaimana shalat pada waktunya.” (Hadits ini para perawinya adalah para perawi hadits shahih). Maksudnya orang mukmin ketika itu tidak perlu berperang, karena Allah telah menghalau mereka dengan mengirimkan angin dan malaikat. Untuk mewujudkan apa yang Dia inginkan. Berkuasa terhadap perintah-Nya. Oleh karena itu, orang-orang yang memiliki kekuatan dan keperkasaan tidaklah bermanfaat kekuatan dan keperkasaannya itu jika Allah tidak menolong mereka dengan kekuatan dan keperkasaan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 25",
    "description": "Dan pada akhir perang khandak Allah menghalau orang-orang kafir itu dengan mengirim angin kencang yang membuat keadaan mereka penuh kejengkelan karena menderita kekalahan tanpa peperangan dan mereka juga tidak memperoleh keuntungan apa pun, baik ganimah maupun tawanan perang. Dengan demikian, cukuplah Allah yang menolong menghindarkan orang-orang mukmin dalam peperangan karena musuh mereka hancur tersapu angin kencang. Dan Allah mahakuat, mahaperkasa; tidak ada yang mampu mengalahkan dan melemahkan-Nya. 26. Setelah kelompok yang bersekutu itu kocar-kacir, Allah memerin-tahkan rasulullah menghalau bani quraizah dari benteng mereka. Dan dia menurunkan orang-orang ahli kitab, yakni bani quraizah, yang membantu mereka, yaitu golongan yang bersekutu, dari benteng-benteng mereka, dan dia memasukkan rasa takut ke dalam hati mereka. Sebagian mereka, yaitu kaum laki-laki yang ikut berperang, kamu bunuh dan sebagian yang lain, yaitu perempuan dan anak-anak, kamu tawan."
  }
]