[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Allah menurunkan orang-orang Yahudi Bani Quraizhah dari benteng mereka untuk membantu Ahzab dalam memerangi kaum Muslimin. Selanjutnya Allah menyusupkan ketakutan ke dalam hati mereka, sehingga mereka pun kalah. Kalian (wahai kaum Muslimin) membunuh sebagian dari mereka dan menawan sebagian yang lain."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "26. Dan Allah menurunkan orang-orang Yahudi yang telah menolong kaum kafir dari benteng-benteng yang mereka gunakan untuk mempertahankan diri dari musuh-musuh mereka serta memasukkan rasa takut ke dalam hati mereka. Sebagian dari mereka kalian bunuh -wahai kaum mukminin- dan sebagian yang lain kalian jadikan tawanan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "26. وَأَنزَلَ الَّذِينَ ظٰهَرُوهُم مِّنْ أَهْلِ الْكِتٰبِ (Dan Dia menurunkan orang-orang Ahli Kitab (Bani Quraizhah) yang membantu golongan-golongan yang bersekutu) Yakni mereka membantu dan memperkuat pasukan itu untuk melawan Rasulullah. Dan yang dimaksud adalah Bani Quraizhah yang menolong pasukan ahzab dan melanggar perjanjian mereka dengan Rasulullah. مِن صَيَاصِيهِمْ(dari benteng-benteng mereka) Yang dimaksud adalah benteng-benteng yang mereka jadikan sebagai tempat perlindungan. وَقَذَفَ فِى قُلُوبِهِمُ الرُّعْبَ(dan Dia memesukkan rasa takut ke dalam hati mereka) Yakni ketakutan yang sangat besar sehingga mereka menyerahkan diri mereka untuk dibunuh dan menyerahkan anak dan istri mereka untuk ditawan. فَرِيقًا تَقْتُلُونَ وَتَأْسِرُونَ فَرِيقًا(Sebahagian mereka kamu bunuh dan sebahagian yang lain kamu tawan) Golongan pertama adalah para lelaki, dan golongan kedua adalah para wanita dan anak-anak."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "26. Dia menurunkan orang-orang Ahli Kitab (Bani Quraizhah) yang membantu golongan-golongan yang bersekutu dari benteng-benteng mereka, dan Dia memasukkan rasa takut ke dalam hati mereka. Sebagian mereka kamu bunuh dan sebagian yang lain kamu tawan. Yaitu perempuan dan anak-anak."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia menurunkan orang-orang yang membantu mereka} membantu golongan-golongan itu {dari golongan Ahlul kitab} dari golongan orang Yahudi Bani Quraizhah {dari benteng-benteng mereka} benteng-benteng mereka {Dia memasukkan ke dalam hati mereka rasa takut} rasa takut yang sangat dahsyat {Sebagian mereka kalian bunuh dan sebagian lain kalian tawan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "26. “Dan Dia menurunkan orang-orang yang membantu mereka,” maksudnya, menolong mereka, “dari Ahli KItab” maksudnya, dari kaum Yahudi, “dari benteng-benteng mereka,” maksudnya, Dia menurunkan mereka dari benteng-benteng pertahanan mereka dalam keadaan terkalahkan lagi menjadi di bawah kekuasaan Islam, “dan Dia memasukkan rasa takut ke dalam hati mereka,” sehingga mereka tidak berani berperang, bahkan mereka menyerah, tunduk dan hina. “Sebagian mereka kamu bunuh,” yaitu kaum laki-laki dewasa yang memerangi, “dan sebagian yang lain kamu tawan,” yaitu kaum wanita dan anak-anak."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahzab ayat 26: Setelah Rasul ﷺ kembali ke Madinah, setelah mendapat pertolongan Allah, Jibril datang kepada Rasul ﷺ memerintahkan kepada Rasul agar pergi menuju bani quraidzah untuk memerangi mereka, dimana mereka mengikuti orang-orang musyrik dan menyelisihi perjanjian mereka dengan Rasul ﷺ; Rasul mengepung benteng-benteng mereka, dimana mereka beranggapan bahwa benteng-benteng tersebut dapat melindungi mereka. Kemudian Allah memasukkan dalam hati-hati mereka rasa takut, hingga mereka menyerah turun dari benteng-benteng mereka dan menyerah. Mereka dihukumi dengan dibunuh laki-laki mereka dan perempuan-peremuan serta anak-anak mereka ditawan, begitu juga harta mereka dijadikan ghanimah, dan hukum tersebut sesuai dengan hukum Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sehingga mereka tidak kuasa berperang, bahkan menyerah dan tunduk. Yaitu kaum lelaki yang ikut berperang. Setelah golongan-golongan yang bersekutu itu kocar-kacir, maka Allah memerintahkan Nabi shallallahu 'alaihi wa sallam untuk menghancurkan Bani Quraizhah (orang-orang Yahudi yang tinggal dekat dengan Madinah) yang sebelumnya telah mengadakan perjanjian damai dengan Beliau untuk tidak saling berperang. Mereka tetap di atas agamanya, dan Beliau tidak akan menyerang mereka. Namun ketika perang Khandaq (parit) tiba, mereka melihat jumlah pasukan ahzab (yang bersekutu) begitu besar untuk menghancurkan Islam, sedangkan jumlah kaum muslimin sedikit. Mereka mengira, bahwa pasukan ahzab itu akan berhasil memusnahkan Islam (Rasulullah shallallahu 'alaihi wa sallam dan kaum mukmin), maka mereka bersekutu dengan pasukan ahzab itu dan membatalkan perjanjiannya. Berita pengkhinatan Bani Quraizhah ini menggemparkan kaum muslimin. Rasulullah shallallahu 'alaihi wa sallam segera mengutus dua orang sahabatnya; Sa’ad bin Mu’adz kepala suku Aus dan Sa’ad bin Ubadah kepala suku Khazraj untuk pergi kepada bani Quraizhah agar menasehati mereka untuk tidak meneruskan pengkhinatan itu. Setibanya kedua utusan itu ke tempat kepala suku Bani Quraizhah Ka’ab bin Asad, keduanya segera menyampaikan pesan-pesan Rasulullah shallallahu ‘alaihi wa sallam. Akan tetapi mereka ditolak dengan sikap kasar dan penuh keangkuhan serta kesombongan. Pengkhinatan pun terus dilakukan. Pengkhianatan Bani Quraizhah ini sangat menyusahkan kaum muslimin dan menakutkan hati mereka, karena orang Yahudi tersebut berada di dalam kota Madinah. Maka dengan pertolongan Allah Subhaanahu wa Ta'aala pasukan sekutu itu bercerai berai pulang kembali ke negeri mereka masing-masing tanpa membawa hasil apa-apa. Tinggallah sekarang Bani Quraizhah sendirian. Nabi Muhammad shallallahu 'alaihi wa sallam beserta kaum muslimin segera membuat perhitungan dengan para pengkhianat itu. Setelah dua puluh lima hari lamanya mereka dikepung dalam benteng. Mereka akhirnya turun dari bentengnya dan mau menyerah kepada Nabi Muhammad shallallahu 'alaihi wa sallam dengan syarat bahwa yang akan menjadi hakim atas perbuatan mereka adalah Sa’ad bin Mu’adz kepala suku Aus, lalu Nabi Muhammad shallallahu 'alaihi wa sallam menerima syarat itu. Setelah mempertimbangkan matang-matang, Sa’ad kemudian menjatuhkan hukuman mati; laki-laki mereka yang sudah baligh dibunuh, sedangkan wanita dan anak-anak mereka ditawan, dan harta mereka menjadi ghanimah. Hukuman demikian adalah wajar bagi pengkhianat-pengkhianat masyarakat yang sedang dalam keadaan perang, terlebih pengkhianatan itu dilakukan ketika musuh sedang melancarkan serangannya. Dengan demikian, sempurnalah nikmat yang Allah berikan kepada Rasul-Nya dan kaum mukmin, Dia menyenangkan hati mereka dengan mengecewakan musuh-musuh-Nya, dan kelembutan Allah Subhaanahu wa Ta'aala selalu berlaku terhadap hamba-hamba-Nya yang mukmin, wal hamdulillahi Rabbil ‘aalamin."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 26",
    "description": "Setelah kelompok yang bersekutu itu kocar-kacir, Allah memerin-tahkan rasulullah menghalau bani quraizah dari benteng mereka. Dan dia menurunkan orang-orang ahli kitab, yakni bani quraizah, yang membantu mereka, yaitu golongan yang bersekutu, dari benteng-benteng mereka, dan dia memasukkan rasa takut ke dalam hati mereka. Sebagian mereka, yaitu kaum laki-laki yang ikut berperang, kamu bunuh dan sebagian yang lain, yaitu perempuan dan anak-anak, kamu tawan. 27. Berkat pertolongan Allah pada perang khandak itu dia mewariskan kepadamu tanah-tanah, rumah-rumah, dan harta benda mereka, dan begitu pula tanah yang belum kamu injak, yaitu tanah-tanah baru yang akan dimasuki oleh tentara mukmin. Dan Allah mahakuasa terhadap segala sesuatu."
  }
]