[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Allah membuat kalian (wahai orang-orang Mukmin) menguasai tanah, rumah dan harta mereka yang bergerak seperti perhiasan, senjata dan hewan ternak, dan harta mereka yang tidak bergerak seperti kebun, rumah dan benteng yang kokoh. Dan Allah menyerahkan tanah yang sebelumnya kalian tidak mampu untuk mendudukinya karena kekuatan dan penjagaan oleh pemiliknya. Sesungguhnya Allah Mahakuasa atas segala sesuatu, sehingga tidak ada sesuatu pun yang melemahkanNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "27. Setelah kehancuran mereka, Allah menjadikan kalian sebagai pemilik tanah mereka dengan segala isinya berupa tanaman dan pohon-pohon kurma, dan menjadikan kalian sebagai pemilik dari rumah dan harta mereka yang lainnya. Dan Allah menjadikan kalian sebagai pemilik tanah Khaibar yang sebelumnya tidak pernah kalian injak, dan niscaya kalian akan menginjakkan kaki di sana. Ini adalah janji dan kabar gembira bagi orang-orang yang beriman, dan Allah Mahakuasa atas segala sesuatu, tidak ada yang mampu melemahkannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "27. وَأَوْرَثَكُمْ أَرْضَهُمْ (Dan Dia mewariskan kepada kamu tanah-tanah) Yakni tanah dan kebun kurma. وَدِيٰرَهُمْ(rumah-rumah) Yakni rumah-rumah dan benteng-benteng. وَأَمْوٰلَهُمْ(dan harta benda mereka) Yakni perhiasan, perabotan, hewan ternak, senjata, uang dinar dan dirham/ وَأَرْضًا لَّمْ تَطَـُٔوهَا ۚ( dan (begitu pula) tanah yang belum kamu injak) Yakni tanah Khaibar. Ketika itu mereka belum mampu menguasainya, maka Allah menjanjikannya bagi mereka. Pendapat lain mengatakan yang dimaksud adalah semua negeri yang akan ditakhlukkan yang berlaku sampai hari kiamat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "27. Dia mewariskan kepada kamu tanah-tanah, rumah-rumah dan harta benda mereka, dan (begitu pula) tanah yang belum kamu injak. Dan adalah Allah Maha Kuasa terhadap segala sesuatu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia mewariskan kepada kalian} Dia memberi kalian kekuasaan {tanah-tanah, rumah-rumah, harta benda mereka, dan tanah yang belum kalian injak} yang belum pernah kalian masuki {Allah Maha kuasa terhadap segala sesuatu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "27. “Dan Dia mewariskan kepada kamu,” maksudnya, menjadikan kalian merampas ghanimah “tanah-tanah, rumah-rumah dan harta benda mereka, dan begitu pula tanah yang belum kamu injak.” Maksudnya, tanah yang sebelumnya, -karena kemuliaan dan kehormatannya bagi pemiliknya-, kalian tidak dapat menginjaknya. Lalu sekarang Allah memberikan kekuasaan kepada kalian dan menjadikan mereka hina, kalian ambil harta benda mereka sebagai ghanimah, kalian bunuh mereka dankalian tawan sebagian mereka. “Dan Allah Mahakuasa terhadap segala sesuatu,” tidak ada apa pun yang dapat membuatNya lemah. Dan di antara kekuasaanNya adalah Dia telah menetapkan takdir yang telah ditetapkanNya untuk kalian. Sekelompok manusia dari Ahli kitab ini adalah Bani Quraizhah dari kaum Yahudi yang tinggal di suatu perkampungan tidak jauh dari luar Madinah. Dan pada waktu Nabi berhijrah ke Madinah, beliau mengadakan perdamaian dan gencatan senjata dengan mereka. Maka beliau pun tidak memerangi mereka dan mereka pun tidak memeranginya, dalam keadaan mereka tetap menganut agama mereka, dan Nabi tidak merubah apa pun dari ajaran mereka. Namun, tatkala mereka melihat pasukan koalisi yang telah berkoalisi untuk memerangi Rasulullah dan banyaknya jumlah mereka serta mereka melihat kecilnya jumlah kaum Muslimin pada peristiwa perang Khandaq, dan mereka merasa yakin bahwa pasukan koalisi akan menghabisi Rasulullah dan kaum Muslimin, dan hal itu didukung dengan provokasi sebagian pemimpin mereka, maka mereka (Bani Quraizhah) membatalkan perjanjian yang ada di antara mereka dengan Rasulullah, dan membantu kaum musyrikin (pasukan sekutu) untuk memerangi beliau. Tatkala Allah memporak porandakkan kaum musyrikin, maka Rasulullah berkonsentrasi untuk memerangi kaum Yahudi itu. Beliau pun mengepung mereka yang bertahan dalam benteng. Kemudian mereka menerima ketentuan (keputusan) Sa’ad bin Mu’adz. Sa’ad bin MU’adz memutuskan terhadap mereka agar kaum laki-laki yang memerangi dibunuh, kaum wanita dan anak-anak mereka ditawan, sedangkan harta benda mereka dijadikan rampasan perang. Dengan demikian Allah telah menyempurnakan karuniaNya kepada RasulNya dan kaum Mukminin, melimpahkan nikmatNya kepada mereka dan menjadikan jiwa mereka lega dengan membinasakan orang-orang yang binasa dari kalangan musuh-musuhnya, dan dibunuhlah orang-orang yang harus dibunuh dan ditawanlah orang-orang yang mesti ditawan. Kelembutan Allah terhadap hamba-hambaNya yang beriman senantiasa tetap berlanjut."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahzab ayat 27: Setelah selesai ﷺ dengan urusan bani quraidzah, Allah menyudahi hukuman atas mereka, Allah memuji Rasul ﷺ dan para sahabatnya dengan pujian dan sanjungan dengan memberikan kepada mereka kebun-kebun milik bani quraidzah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni memberimu ghanimah. Tanah yang belum diinjak adalah tanah-tanah yang akan dimasuki tentara Islam, seperti Khaibar setelah Quraizhah. Tanah tersebut karena begitu berharga bagi pemiliknya, sebelumnya membuat sulit dimasuki tentara Islam. Tidak ada sesuatu pun yang melemahkan-Nya. Oleh karena kekuasaan-Nya, Dia menakdirkan apa yang Dia takdirkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 27",
    "description": "Berkat pertolongan Allah pada perang khandak itu dia mewariskan kepadamu tanah-tanah, rumah-rumah, dan harta benda mereka, dan begitu pula tanah yang belum kamu injak, yaitu tanah-tanah baru yang akan dimasuki oleh tentara mukmin. Dan Allah mahakuasa terhadap segala sesuatu. -."
  }
]