[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai Nabi, katakanlah kepada istri-istrimu yang bersatu meminta tambahan nafkah darimu, “Bila kalian menginginkan kehidupan dunia dan perhiasannya, maka kemarilah, aku akan membuat kalian bisa menikmati kehidupan dunia dari apa yang aku punya dan aku akan meninggalkan kalian tanpa mudarat dan menyakiti kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "28. Wahai Nabi! Katakan kepada para istrimu tatkala mereka meminta darimu tambahan nafkah sementara engkau tidak mempunyai sesuatu untuk menambah nafkah mereka, “Jika kalian menginginkan kehidupan dunia dan segala perhiasan yang ada padanya, maka datanglah kepadaku, niscaya aku akan memberikan mut’ah (hadiah) kepada kalian seperti hadiah diberikan untuk menyenangkan wanita yang ditalak, dan aku menalak kalian dengan talak yang tidak ada kerugian padanya dan tidak pula menyakitkan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "28-29. Allah menyampaikan kepada Rasulullah dengan seruan kemuliaan kenabiannya dan memerintahkannya agar mengatakan kepada para istrinya ketika mereka meminta tambahan nafkah: “Jika kalian ingin kelapangan hidup di dunia, maka kemarilah agar aku mentalak kalian tanpa ada kemudharatan. Namun jika kalian menginginkan keridhaan Allah dan rasul-Nya dan dapat meraih surga di kehidupan akhirat, maka sesungguhnya Allah telah menyiapkan pahala yang berlipat ganda di surga bagi orang-orang yang berbuat baik di antara kalian.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "28. يٰٓأَيُّهَا النَّبِىُّ قُل لِّأَزْوٰجِكَ (Hai Nabi, katakanlah kepada isteri-isterimu) Para ahli tafsir berkata, bahwa istri-istri Nabi memintanya untuk menambah nafkah yang beliau berikan kepada mereka, dan mereka menyakiti hatinya dengan kecemburuan yang terjadi di antara mereka, sehingga Rasulullah meng-ilaa’ mereka selama satu bulan, dan Allah menurunkan ayat ini untuk memberi mereka pilihan. إِن كُنتُنَّ تُرِدْنَ الْحَيَوٰةَ الدُّنْيَا وَزِينَتَهَا(“Jika kamu sekalian mengingini kehidupan dunia dan perhiasannya) Yakni kelapangan, keindahan, kemewahan dunia. فَتَعَالَيْنَ(maka marilah) Yakni datanglah kepadaku. أُمَتِّعْكُنَّ(supaya kuberikan kepadamu mut’ah) Yakni mut’ah talak. وَأُسَرِّحْكُنَّ سَرَاحًا جَمِيلًا (dan aku ceraikan kamu dengan cara yang baik) Yakni aku cerai kalian tanpa merugikan kalian, namun dengan perceraian sesuai sunnah agar kalian bisa mendapatkan perhiasan dunia yang kalian harapkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "28. Hai Nabi, katakanlah kepada sembilan istrimu yang meminta tambahan nafkah kepadamu: \"Jika kamu sekalian mengingini kehidupan dunia dan perhiasannya, maka marilah supaya kuberikan kepadamu mut´ah dan aku ceraikan kamu dengan cara yang baik. Yaitu harta yang diberikan sebab perceraian. Aku akan menceraikan kalian tanpa permusuhan. Ayat ini turun ketika istri-istri nabi meminta perhiasan dan tambahan nafkah. Dimulai dari Aisyah, kemudian Allah mengujinya dan dia memilih Allah dan rasul-Nya. Kemudian dilanjutkan para istri lainnya dan memilih sebagaimana yang dipilih Aisyah. Maka Nabi bersyukur kepada Allah atas istri-istrinya. Dan turunlah surat Al ahzab ayat 52. Kemudian Aisyah berkata: “Nabi memberi pilihan kepada kami dan kami memilihnya, sehingga Nabi tidak ada talak.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai Nabi, katakanlah kepada istri-istri kalian,“Jika kalian menginginkan kehidupan dunia dan perhiasannya, maka kemarilah untuk aku berikan mut’ah kepada kalian} aku berikan mut’ah thalaq kepada kalian {dan aku menceraikan kalian} aku menceraikan kalian {dengan cara yang baik} talaq yang tidak memberikan mudharat dan rasa sakit di dalamnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "28. Tatkala istri-istri Rasulullah sama-sama sepakat menyatakan kecemburuannya kepada beliau, dan mereka menuntut nafkah dan pakaian serta menuntut sesuatu yang tidak sanggup beliau lakukan setiap waktu, dan mereka terus sepakat melakukan tuntutan dan bersikeras dengan keinginan mereka, hingga hal ini terasa sangat memberatkan Rasulullah, sampai membuat beliau bersumpah tidak menggauli mereka sampai satu bulan lamanya. Lalu Allah berkehendak memudahklan permasalahan ini bagi RasulNya dan mengangkat derajat istri-istrinya serta menghilangkan dari mereka segala hal yang dapat mengurangi pahala mereka. Maka Allah menyuruh RasulNya agar memberikan pilihan kepada mereka, seraya berfirman, “Hai Nabi, katakanlah kepada istri-istrimu, ‘Jika kamu sekalian menginginkan kehidupan dunia’,” maksudnya, sudah tidak ada tuntutan lain lagi bagi kalian selain itu, dan kalian memang sudah cukup rela dengan terpenuhinya dunia (harta benda) dan merasa marah kalau tidak memilikinya, maka aku sama sekali tidak mempunyai hasrat dan kebutuhan pada kalian, kalau kalian tetap seperti ini, “maka marilah supaya aku berikan kepadamu mut’ah,” sedikit dari yang aku miliki dari harta benda, “dan aku ceraikan kamu,” maksudnya, aku talak kalian “dengan cara yang baik” tanpa ada rasa marah atau rasa ingin mencela, bahkan dengan lapang dada dan hati terbuka sebelum keadaannya sampai pada batas yang tidak diinginkan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahzab ayat 28: Katakanlah wahai Nabi Allah kepada istri-istrimu yang meminta kepadamu nafkah, perhiasan, pelayan setelah mereka melihat harta ghanimah, dan apa yang Allah berikan kepada Rasul ﷺ dan orang-orang yang beriman dari kebaikan, katakan kepada istri-istrimu : Jika kalian menginginkan kebaikan hidup di dunia dan tidak dapat bersabar dengan pemberian dariku; Maka kemarilah, akan aku berikan apa yang kalian minta dari perhiasan dan kesenangan, dan aku akan metalak kalian dengan tanpa kerugian atau kesengsaraan (bagiku)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Imam Bukhari meriwayatkan dengan sanadnya yang sampai kepada Abdullah bin Abbas radhiyallahu 'anhu ia berkata, “Aku selalu ingin bertanya kepada Umar radhiyallahu 'anhu tentang dua wanita di antara istri Nabi shallallahu 'alaihi wa sallam, di mana Allah Subhaanahu wa Ta'aala berfirman kepada kedua, “Jika kamu berdua bertobat kepada Allah, maka sungguh, hati kamu berdua telah condong (untuk menerima kebenaran); (terj. At Tahrim: 3), sampai saat ia (Umar) berhaji, dan aku pun ikut berhaji bersamanya, ia pun mencari jalan lain dan aku juga mencari jalan yang lain dengan membawa kantong kecil (berisi air), maka Umar buang air. Lalu ia datang, kemudian aku tuangkan ke kedua tangannya air (dari kantong itu), maka ia pun berwudhu’, lalu aku berkata kepadanya, “Wahai Amirul Mukminin! Siapakah dua wanita dari istri Nabi shallallahu 'alaihi wa sallam yang Allah Ta’ala berfirman kepadanya, “Jika kamu berdua bertobat kepada Allah, maka sungguh, hati kamu berdua telah condong (untuk menerima kebenaran),” Umar berkata, “Adu anehnya engkau wahai Ibnu Abbas. Keduanya adalah Aisyah dan Hafshah.” Lalu Umar menyampaikan hadits itu. Ia berkata, “Aku dengan tetanggaku seorang Anshar berada di Bani Umayyah bin Zaid, sedangkan mereka berada di dataran tinggi Madinah. Kami turun bergiliran menemui Nabi shallallahu 'alaihi wa sallam, ia turun pada hari tertentu, dan aku pun turun pada hari tertentu. Apabila tiba giliranku yang turun, maka aku datang kepadanya memberitahukan berita pada hari itu tentang wahyu maupun lainnya, dan apabila tiba giliran dia yang turun, maka dia pun melakukan seperti itu. Kami kaum Quraisy, biasa lebih berkuasa terhadap istri, tetapi setelah kami mendatangi orang-orang Anshar, ternyata mereka adalah orang-orang yang kalah oleh istri, maka mulailah wanita-wanita kami mengikuti kebiasaan wanita Anshar, lalu aku berteriak (marah) kepada istriku, tetapi ia malah membantahku, maka aku pun mengingkari sikapnya itu. Ia pun berkata, “Mengapa kamu mengingkari bantahanku kepadamu. Demi Allah, sesungguhnya istri-istri Nabi shallallahu 'alaihi wa sallam benar-benar membantah Beliau, bahkan salah seorang di antara mereka ada yang menjauhi Beliau pada hari ini sampai malam.” Aku pun menjadi kaget, dan berkata kepadanya, “Sungguh kecewa orang yang melakukan hal itu di antara mereka.” Lalu aku pakai bajuku seluruhnya, kemudian turun dan masuk menemui Hafshah dan berkata kepadanya, “Wahai Hafshah, apakah salah seorang di antara kamu ada yang membuat marah Nabi shallallahu 'alaihi wa sallam pada hari ini sampai malam?” Hafshah menjawab, “Ya.” Aku (Umar) berkata, “Kamu sungguh kecewa dan rugi, apakah kamu merasa aman jika Allah murka karena murka Rasul-Nya shallallahu 'alaihi wa sallam sehingga engkau pun menjadi binasa. Oleh karena itu, janganlah kamu meminta banyak darinya, membantahnya dalam segala sesuatu, dan menjauhinya. Mintalah kepadaku dalam hal yang tampak bagimu (kamu perlukan), dan janganlah kamu tergiur hanya karena tetanggamu lebih cantik darimu dan lebih dicintai Nabi shallallahu 'alaihi wa sallam –maksudnya adalah Aisyah-.” Umar melanjutkan kata-katanya, “(Saat) kami sedang berbincang-bincang tentang (Raja) Ghassan yang sedang memakaikan alas kaki ke kudanya untuk memerangi kami, lalu turun kawan saya seorang Anshar pada hari gilirannya, ia pun kembali kepada kami pada waktu Isya, kemudian menggedor pintuku dengan keras dan berkata, “Apa ada orang (di dalam) sana?” Maka aku kaget lalu keluar menemuinya, ia pun berkata, “Pada hari ini telah terjadi perkara besar.” Aku (Umar) berkata, “Apa itu, apakah (Raja) Ghassan datang?” Ia menjawab, “Bukan, bahkan lebih besar dan lebih parah lagi. Nabi shallallahu 'alaihi wa sallam menalak istri-istrinya.” Aku (Umar) pun berkata, “Kecewa Hafshah dan rugilah dia. Sungguh aku telah mengira hal ini kemungkinan akan terjadi.” Maka aku pakai semua pakaianku, lalu aku shalat Fajar (Subuh) bersama Nabi shallallahu 'alaihi wa sallam, lalu Nabi shallallahu 'alaihi wa sallam masuk ke kamar atas dan mengasingkan diri di sana. Kemudian aku masuk menemui Hafshah dan ternyata ia menangis, lalu aku berkata, “Apa yang membuatmu menangis, bukankah aku telah memperingatkan kamu tentang hal ini? Apakah Nabi shallallahu 'alaihi wa sallam menalakmu semua?” Hafshah berkata, “Aku tidak tahu, itu Beliau sedang mengasingkan diri di kamar atas.” Lalu aku keluar dan datang ke mimbar, ternyata di sekitarnya ada sekumpulan orang yang sebagiannya menangis, maka aku duduk sebentar bersama mereka. Kegelisahanku pun memuncak, lalu aku mendatangi kamar yang di sana terdapat Nabi shallallahu 'alaihi wa sallam, kemudian aku berkata kepada budaknya yang berkulit hitam, “Mintakanlah izin untuk Umar.” Lalu budak itu masuk (menemui Nabi shallallahu 'alaihi wa sallam) dan berbicara dengan Nabi shallallahu 'alaihi wa sallam kemudian kembali dan berkata, “Aku telah berbicara dengan Nabi shallallahu 'alaihi wa sallam dan menyebutkan dirimu kepadanya, namun Beliau diam.” Maka aku kembali dan duduk bersama orang-orang yang berada di dekat mimbar. Tetapi kegelisahanku memuncak, lalu aku mendatangi budak itu dan berkata, “Mintakanlah izin untuk Umar.” Lalu budak itu masuk (menemui Nabi shallallahu 'alaihi wa sallam) kemudian kembali kepadaku dan berkata, “Aku telah menyebutkan dirimu kepadanya, namun ia tetap diam.” Ketika aku hendak kembali, tiba-tiba budak itu memanggilku dan berkata, “Nabi shallallahu 'alaihi wa sallam telah mengizinkanmu.” Maka aku masuk menemui Nabi shallallahu 'alaihi wa sallam, ternyata Beliau sedang berbaring di atas garis-garis tikar, di mana antara Beliau dengan tikar tidak ada kasur, sehingga garis-garis itu membekas ke lambung Beliau, sedangkan Beliau bersandar ke bantal yang terbuat dari kulit yang diisi sabut. Lalu aku mengucapkan salam kepadanya dan berkata sambil berdiri, “Wahai Rasulullah, apakah engkau menalak istri-istrimu.” Lalu Beliau mengangkat pandangannya kepadaku dan berkata, “Tidak,” aku pun berkata, “Allahu akbar.” Kemudian aku berkata dalam keadaan berdiri meminta izin, “Wahai Rasulullah, jika sekiranya engkau memperhatikan keadaanku. Kami kaum Quraisy biasa berkuasa terhadap kaum wanita, tetapi setelah kami tiba di Madinah, ternyata mereka adalah orang-orang yang kalah oleh istri.” Maka Nabi shallallahu 'alaihi wa sallam tersenyum. Kemudian aku berkata, “Wahai Rasulullah, jika sekiranya engkau memperhatikan keadaanku. Aku masuk menemui Hafshah dan berkata kepadanya, “Janganlah membuatmu terpedaya oleh karena tetanggamu lebih cantik darimu dan lebih dicintai Nabi shallallahu 'alaihi wa sallam –maksudnya Aisyah-,” maka Nabi shallallahu 'alaihi wa sallam tersenyum lagi. Maka aku duduk ketika melihat Beliau tersenyum, lalu aku mengangkat pandanganku ke (sekeliling) rumah Beliau. Demi Allah, aku tidak melihat di rumah Beliau sesuatu yang mengembalikan pandangan (kurang enak dilihat) selain tiga kulit. Lalu aku berkata, “Wahai Rasulullah, berdoalah kepada Allah, agar Dia memperkaya umatmu. Karena bangsa Persia dan Romawi telah diberikan kekayaan dan diberikan dunia, padahal mereka tidak menyembah Allah.” Maka Nabi shallallahu 'alaihi wa sallam duduk sambil bersandar dan berkata, “Apakah engkau dalam keadaan (ragu) seperti ini wahai Ibnul Khathtahb. Mereka adalah orang-orang yang disegerakan kesenangan dalam kehidupan dunia.” Aku pun berkata, “Wahai Rasulullah, mohonkanlah ampunan untukku.” Oleh karena berita yang disampaikan Hafshah kepada Aisyah, maka Nabi shallallahu 'alaihi wa sallam mengasingkan diri selama 29 hari. Ketika itu, Beliau berkata, “Aku tidak akan masuk menemui mereka selama sebulan.” Karena kesalnya Beliau kepada mereka saat Allah menegurnya. Setelah 29 hari berlalu, maka Beliau masuk menemui Aisyah dan memulai dengannya, lalu Aisyah berkata kepadanya, “Wahai Rasulullah, sesungguhnya engkau telah bersumpah untuk tidak menemui kami selama sebulan. Engkau di pagi hari baru saja berada di hari yang kedua puluh sembilan yang aku hitung dengan sebenarnya.” Beliau bersabda “Sebulan itu 29 hari.” Ternyata memang bulan ketika itu jumlahnya 29 hari. Aisyah berkata, “Selanjutnya Allah Subhaanahu wa Ta'aala menurunkan ayat pemberian pilihan, lalu Beliau memulai kepadaku sebagai orang yang pertama di antara istri-istrinya, maka aku pilih Beliau. Kemudian Beliau juga memberikan pilihan kepada semua istri-istrinya dan ternyata mereka mengatakan seperti yang dikatakan Aisyah.” Imam Muslim meriwayatkan dengan sanadnya yang sampai kepada Jabir bin Abdillah ia berkata, “Abu Bakar pernah meminta izin untuk masuk menemui Rasulullah shallallahu 'alaihi wa sallam, lalu ia mendapati para sahabat duduk di pintu (rumah) Beliau dan tidak ada seorang pun di antara mereka yang diizinkan masuk. Tetapi Abu Bakar dizinkan untuk masuk, maka ia pun masuk, lalu Umar datang dan meminta izin untuk masuk, maka ia juga diizinkan. Lalu Umar mendapati Nabi shallallahu 'alaihi wa sallam dalam keadaaan duduk dan menahan sedihnya sambil diam (tidak berkata-kata), sedangkan istri-istrinya berada di sekelilingnya. Umar berkata, “Aku akan mengatakan sesuatu yang dapat membuat Nabi shallallahu 'alaihi wa sallam tersenyum,” Umar pun berkata, “Wahai Rasulullah, kalau sekiranya engkau melihat puteri Kharijah, saat ia meminta nafkah kepadaku, maka aku bangkit menghampirinya lalu menekan lehernya.” Maka Rasulullah shallallahu 'alaihi wa sallam tersenyum, dan bersabda, “Mereka ini berada di sekelilingku sebagaimana yang kamu lihat juga meminta nafkah kepadaku.” Lalu Abu Bakar bangkit menghampiri Aisyah dan menekan lehernya, Umar juga bangkit menghampiri Hafshah lalu menekan lehernya, keduanya sambil berkata, “(Mengapa) kamu meminta kepada Rasulullah shallallahu 'alaihi wa sallam nafkah yang tidak ada pada sisinya.” Mereka pun berkata, “Demi Allah, kami tidak akan meminta lagi kepada Rasulullah shallallahu 'alaihi wa sallam sesuatu yang tidak ada padanya selamanya.” Maka Beliau menjauhi mereka selama sebulan atau 29 hari, kemudian turunlah ayat ini kepada Beliau, “Wahai Nabi! Katakanlah kepada istri-istrimu, \" …dst. sampai, “bagi siapa yang berbuat baik di antara kamu.” (Terj, Al Ahzaab: 28-29), maka Beliau memulai kepada Aisyah dan berkata, “Wahai Aisyah! Sesungguhnya aku akan menawarkan kepadamu perkara yang aku ingin engkau tidak terburu-buru dalam hal itu sampai engkau bermusyawarah dengan kedua orang tuamu.” Aisyah berkata, “Apa itu wahai Rasulullah?” Maka Beliau membacakan ayat tersebut kepadanya. Maka Aisyah berkata, “Apakah dalam memilih engkau aku perlu bermusyawarah kepada kedua orang tuaku. Bahkan aku memilih Allah dan Rasul-Nya, serta negeri akhirat, dan aku meminta kepadamu agar engkau tidak memberitahukan kepada seorang pun di antara istri-istrimu tentang perkataanku.” Beliau menjawab, “Tidak ada salah satu istri(ku) yang bertanya kepadaku kecuali aku akan beritahukan. Sesungguhnya Allah tidak mengutusku sebagai orang yang menyusahkan manusia dan tidak pula menginginkan ketergelinciran mereka. Akan tetapi, Dia mengutusku sebagai pengajar dan pemberi kemudahan.” ‘Ikrimah berkata, “Ketika itu istri Beliau ada sembilan orang; lima orang berasal dari Quraisy (Aisyah, Hafshah, Ummu Habibah, Saudah, dan Ummu Salamah radhiyallahu 'anhun). Istri Beliau shallallahu 'alaihi wa sallam juga adalah Shafiyyah binti Huyay An Nadhiiriyyah, Maimunah binti Al Harits Al Hilaaliyyah, Zainab binti Jahsy Al Asadiyyah, Juwairiyyah binti Al Harits Al Mushthaliqiyyah radhiyallahu 'anhun wa ardhaahunna ajma’iin.” Mereka semua berkumpul meminta kepada Nabi shallallahu 'alaihi wa sallam perhiasan dunia yang Beliau tidak memilikinya atau tidak sanggup memenuhinya. Mut'ah yaitu suatu pemberian yang diberikan kepada perempuan yang telah diceraikan menurut kesanggupan suami. Tanpa ada rasa marah dan mencaci-maki, bahkan dengan dada yang lapang dan hati yang senang daripada masalah rumah tangga semakin parah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 28",
    "description": "-29. 'namun, jika kamu menginginkan dan lebih memilih Allah dan rasul-Nya dengan bersabar atas kehidupan yang sederhana ini dan berharap balasan di negeri akhirat, maka sesungguhnya Allah menyediakan pahala yang besar bagi siapa yang berbuat baik di antara kamu. Allah menjanjikan surga bagi siapa saja dari kamu yang tidak meminta hal-hal duniawi kepada rasulullah. '."
  }
]