[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Namun bila kalian menginginkan ridha Allah RasulNya dan apa yang Dia siapkan untuk kalian di akhirat, maka bersabarlah kalian di atas keadaan kalian. Taatilah Allah dan RasulNya, karena sesungguhnya Allah menyediakan pahala yang besar untuk wanita-wanita yang berbuat baik di antara kalian.” Dan mereka telah memilih Allah dan RasulNya dan apa yang Allah siapkan untuk mereka di akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "29. Dan apabila kalian menginginkan rida Allah dan rida Rasul-Nya, serta kalian menginginkan surga di kehidupan Akhirat, maka bersabarlah atas kondisi kalian saat ini, karena sesungguhnya Allah telah menyiapkan pahala yang besar bagi orang yang berbuat kebaikan di antara kalian dengan bersabar dan pergaulan yang baik.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "29. وَإِن كُنتُنَّ تُرِدْنَ اللهَ وَرَسُولَهُۥ وَالدَّارَ الْاٰخِرَةَ (Dan jika kamu sekalian menghendaki (keridhaan) Allah dan Rasulnya-Nya serta (kesenangan) di negeri akhirat) Yakni surga dan kenikmatannya. فَإِنَّ اللهَ أَعَدَّ لِلْمُحْسِنٰتِ مِنكُنَّ(maka sesungguhnya Allah menyediakan bagi siapa yang berbuat baik diantaramu) Yakni kalian yang melakukan amalan kebaikan. أَجْرًا عَظِيمًا(pahala yang besar) Setelah ayat ini diturunkan, Rasulullah memanggil seluruh istrinya satu persatu kemudian membacakan ayat ini kepada mereka, dan mereka memilih untuk tetap bersamanya. Aisyah berkata: Rasulullah memberikan pilihan kepada kami, maka Kami memilih untuk tetap bersamanya, dan beliau tidak menganggapnya sebagai talak."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "29. Jika kamu sekalian menghendaki (keridhaan) Allah dan Rasulnya-Nya serta (kesenangan) di negeri akhirat, maka sesungguhnya Allah menyediakan bagi siapa yang berbuat baik di antaramu pahala yang besar."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Jika kalian menginginkan Allah, RasulNya, dan negeri akhirat, sesungguhnya Allah menyediakan pahala yang besar orang-orang yang berbuat baik di antara kalian”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "29. “Dan jika kamu sekalian menghendaki Allah dan RasulNya serta negeri akhirat,” maksudnya, jika hal-hal ini yang kalian inginkan dan tujuan keinginan kalian, dan kalian memilih Allah, RasulNya dan surge, dan kalian tidak peduli dengan lapang atau sempitnya kehidupan, mudah atau susahnya, dan kalian rela terhadap Rasulullah dengan apa adanya, kalian tidak menuntut sesuatu yang memberatkan beliau, “maka sesungguhnya Allah menyediakan bagi siapa yang berbuat baik diantaramu pahala yang besar.” Allah menetapkan pahala atas sikap ihsan mereka, karena sikap ihsanlah yang menjadi sebab yang memastikan mereka mendapat pahala, bukan karena keadaan mereka sebagai istri-istri Rasulullah. Sebab, hanya sekedar sebagai istri Rasulullah tidak cukup untuk mendapatkan pahala, bahkan sama sekali tidak ada manfaatnya kjalau tidak disertai dengan sikap ihsan. Rasulullah pun memberikan pilihan kepada mereka, lalu mereka semuanya memilih Allah, RasulNya dan negeri akhirat, tidak ada satu pun dari mereka yahng ketinggalan. –Semoga Allah meridhai mereka semua-. Dalam pemberian hak memilih ini terkandung banyak faidah, di antaranya: 1. Perhatian Allah terhadap RasulNya dan semangat (pembelaan) terhadap beliau agar beliau tidak berada dalam kondisi diberatkan oleh banyaknya tuntutan-tuntutan duniawi para istrinya. 2. Bebasnya beliau dari bertanggung jawab (memenuhi) hak-hak para istrinya, sehingga beliau berada dalam kebebasan dirinya, kalau beliau berkehendak memberi maka beliau boleh memberi, dan jika beliau berkehendak menahan maka beliau boleh menahan (tidak memberi); sama sekali tidak ada dosa bagi Nabi dalam hal yang telah Allah tetapkan untuknya. 3. Tindakan beliau membersihkan istri-istrinya (dari penyakit dunia), kalau seandainya ada di antara mereka yang lebih mengutamakan dunia daripada Allah, RasulNya, dan negeri akhirat, dan lebih mengutamakan dunia daripada menjadikannya sebagai npendamping hidup. 4. Keselamatan (kebersihan) istri-istri beliau, semoga Allah meridhai mereka, dari dosa dan dari perbuatan yang dapat mengundang murka Allah dan RasulNya. allah membersihkan mereka dengan cara pemberian pilihan tersebut dari sikap menggerutu terhadap Rasulullah yang bisa mengundang murkanya yang bisa membuat Allah murka yang dapat berakibat pada siksaanNYa. 5. Menampakkan kemuliaan dan ketinggian derajat mereka dan menjelaskan keluhuran impian mereka, di mana Allah, RasulNya dan negeri akhirat menjadi dambaan dan tujuan mereka, bukan dunia bersama gemerlapnya. 6. Kesiapan mereka untuk memilih permasalahan adalah pilihan untuk mencapai kepada derajat surge yang terbaik dan untuk menjadi istri-istri Nabi di dunia dan akhirat. 7. Tampaknya keharmonisan dan kecocokan antara beliau dengan mereka. Sebab sesungguhnya beliau adalah manusia yang paling sempurna, lalu Allah menginginkan agar para istrinya menjadi istri-istri yang sempurna dan menyempurnakan, suci dan menjadikan suci. Allah berfirman, \"dan wanita-wanita yang baik adalah untuk laki-laki yang baik dan laki-laki yang baik adalah untuk wanita-wanita yang baik (pula).\" (An-Nur:26). 8. Sesungguhnya pemberian pilihan ini mengajak dan menimbulkan sifat qona’ah (rela, puas) yang menjadikan hati menjadi tenang dan dada menjadi lapang, dan hilanglah dari mereka kerakusan (pada dunia) dan ketidapuasan yang pasti menimbulkan kegundahan dan kegoncangan hati, kegelisahan dan kepiluannya. 9. Pilhan mereka telah menjadi faktor penyebab untuk makin bertambah dan berlipat gandanya pahala mereka, dan mereka menjadi berada pada kedudukan (luhur) yang sama sekali tidak dimiliki oleh seorang wanita manapun. Maka dari itu Allah berfirman,"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahzab ayat 29: Katakan juga kepada mereka : Maka jika kalian menginginkan keridhaan Allah dan ketaatan kepada Nabi-Nya ﷺ, dan apa yang Allah telah siapkan untuk kalian untuk kehidupan akhirat dari kenikmatan tempat tinggal; Maka taatilah oleh kalian Allah dan Rasul-Nya, bersabarlah atas kesulitan hidup; Karena sungguh Allah menyiapkan bagi wanita-wanita yang baik balasan yang besar, yang tidaklah diketahui besarnya kecuali hanya Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah memberikan pahala yang besar karena ihsan mereka, di mana perbuatan itu adalah sebab untuk mendapatkannya, bukan karena mereka sebagai istri Rasulullah shallallahu 'alaihi wa sallam, karena jika sebatas sebagai istri rasul, maka tidaklah cukup, bahkan tidak bermanfaat apa-apa jika tidak ada ihsan. Mereka pun lebih memilih Allah, Rasul-Nya dan negeri akhirat daripada kehidupan dunia. Mereka tidak peduli terhadap lapang dan sempitnya kehidupan mereka, senang dan susahnya, dan mereka qanaah (menerima apa adanya) pemberian sedikit dari Rasulullah shallallahu 'alaihi wa sallam dan tidak meminta sesuatu yang menyusahkan Beliau. Ada beberapa faedah dari pemberian pilihan ini, di antaranya: - Perhatian Allah kepada Rasul-Nya dan kecemburuan-Nya kepadanya karena keadaannya yang dibuat susah oleh tuntutan istri-istrinya dalam hal duniawi. - Dengan adanya pemberian pilihan ini, maka Beliau selamat dari beban hak-hak istri, dan bahwa Beliau dalam keadaan bebas pribadinya, jika Beliau menghendaki, maka Beliau akan memberi, dan jika tidak menghendaki, maka Beliau tidak memberi. Dan tidak ada keberatan apapun pada Nabi tentang apa yang telah ditetapkan Allah baginya. - Membersihkan Beliau jika ada di antara istri-istrinya yang lebih mengutamakan dunia daripada Allah dan Rasul-Nya serta negeri akhirat, sehingga Beliau tidak menemaninya. - Selamatnya istri-istri Beliau dari dosa dan perkara yang mendatangkan kemurkaan Allah dan Rasul-Nya. Dengan adanya pemberian pilihan ini, Allah memutuskan agar mereka tidak membuat Rasulullah shallallahu 'alaihi wa sallam marah sehingga Tuhannya marah, dan yang demikian dapat mengakibatkan turun siksa-Nya. - Menampakkan ketinggian istri-istri Nabi radhiyallahu 'anhun dan tingginya derajat mereka, serta tingginya harapan mereka, karena Allah, Rasul-Nya dan negeri akhirat menjadi pilihan mereka, tidak dunia dan kesenangannya. - Siapnya mereka dengan pilihan ini untuk mencapai derajat surga yang pilihan, dan agar mereka menjadi istri Beliau di dunia dan akhirat. - Tampaknya keserasian antara Beliau dengan para istrinya, di mana Beliau adalah manusia yang paling sempurna, dan Allah menghendaki agar istri-istrinya pun sebagai wanita yang sempurna lagi menyempurnakan, baik lagi memperbaiki. - Pilihan ini menghendaki untuk bersikap qanaah (menerima apa adanya), di mana hati akan tenteram kepadanya dan dada lapang terhadapnya, rasa tamak menyingkir dari mereka, serta sikap tidak ridha yang membuat hati cemas dan goyang, sedih dan duka pun hilang. - Adanya pemberian pilihan ini pun merupakan sebab bertambah dan berlipatnya pahala mereka, dan berada pada martabat yang berbeda jauh dengan kaum wanita yang lain."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 29",
    "description": "'namun, jika kamu menginginkan dan lebih memilih Allah dan rasul-Nya dengan bersabar atas kehidupan yang sederhana ini dan berharap balasan di negeri akhirat, maka sesungguhnya Allah menyediakan pahala yang besar bagi siapa yang berbuat baik di antara kamu. Allah menjanjikan surga bagi siapa saja dari kamu yang tidak meminta hal-hal duniawi kepada rasulullah. '30. Allah menjanjikan balasan yang agung bagi istri-istri nabi yang berbuat baik. Di sisi yang lain, mereka juga dihadapkan pada acaman yang mengerikan jika berbuat dosa. Wahai istri-istri nabi! barang siapa di antara kamu yang mengerjakan perbuatan keji yang nyata, seperti zina dan durhaka kepada suami, niscaya azabnya akan dilipatgandakan dua kali lipat kepadanya dibanding perempuan-perempuan yang bukan istri nabi. Dan yang demikian itu mudah bagi Allah. []."
  }
]