[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bersandarlah kepada Tuhanmu, serahkanlah segala urusanmu kepadaNya, cukuplah Allah sebagai penjaga bagi siapa yang bertawakal dan kembali kepadaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Dan bersandarlah kepada Allah semata dalam segala urusanmu, dan cukuplah Allah -Subḥānahu- sebagai penjaga hamba-hamba-Nya yang bertawakal kepada-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. وَتَوَكَّلْ عَلَى اللهِ ۚ وَكَفَىٰ بِاللهِ وَكِيلًا (dan bertawakkallah kepada Allah. Dan cukuplah Allah sebagai Pemelihara) Yakni bersandarlah kepada Allah dan serahkan urusanmu kepada-Nya. Sebab cukupllah Allah sebagai penjaga orang yang bertawakkal kepada-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Bergantungkah kepada Allah dan bersegeralah menjalankan perintah Allah, dan cukuplah Allah yang menjadi penjagaan bagimu dan wakil dalam setiap urusanmu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bertawakallah} bergantunglah dalam setiap keadaanmu {kepada Allah. Cukuplah Allah sebagai pemelihara} penjaga terhadap orang yang bergantung kepadaNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3. Jika terbersit dalam hatimu bahwa jika kamu tidak taat kepada mereka dalam (sebagian) keinginan mereka yang menyesatkan, maka akan terjadi sesuatu yang membahayakan dirimu dari mereka, atau akan terjadi kekurangan di dalam membimbing manusia kepada hidayah, maka tolaklah hal itu dari dalam dirimu, dan gunakanlah segala sesuatu yang dapat melawannya dan melawan yang lainnya, yaitu bertawakkal kepada Allah, dengan cara bersandar kepada Rabbmu seperti bersandarnya orang yang tidak dapat mendatangkan bahaya terhadap dirinya atau mafaat, ataupun kematian, kehidupan maupun membangkitkan, dalam menjaga keselamatanmu dari kejahatan mereka dan dalam menegakkan agama yang diperintahkan kepadamu. Dan percayalah kepada Allah dalam mengerjakan perintah itu, apa pun keadaannya. “Dan cukuplah Allah sebagai Pemelihara,” semua perkara diserahkannya kepadaNya, dan Dia-lah yang akan mengaturnya dan mengatur apa yang lebih masalahat bagi hambaNya. Yang demikian itu adalah karena Dia mengetahui kemaslahatan- kepadaNya dan Dia berjanji kepadanya bahwa Dia yang akan mengaturnya. Maka jangan engkau menanyakan tentang (mengapa) setiap permasalahan menjadi mudah, setiap yang sulit menjadi gampang, setiap perkara sulit menjadi ringan setiap kesusahan menjadi hilang, berbagai kondisi dan kebutuhan terpenuhi, berbagai berkah turun, berbagai bencana tercegah dan berbagai keburukan diangkat. Maka di sana Anda akan melihat sang hamba yang lemah tak berdaya yang telah menyerahkan perkaranya kepada Tuhannya yang telah mengatur berbagai perkara yang tidak dapat dilakukan oleh satu umat dari mannusia. Allah telah memudahkan baginya hal-hal yang sangat sulit untuk bisa dilakukan oleh para ahli. Dan kepada Allah lah memohon pertolongan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahzab ayat 3: Allah memerintahkan Nabi-Nya ﷺ agar mengikuti Allah dan agar menyerahkan segala urusannya kepada Allah, dan meminta kepada-Nya saja, serta agar meminta pertolongan untuk menegakkan agama sebagaimana yang diperintahkan-Nya. Cukuplah Allah dan menjadi pemelihara yang menjaga dan memudahkan segala urusan-Nya. Dan Nabi ﷺ telah mentaati apa yang Allah perintahkan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Jika dalam hatimu ada perasaan, bahwa jika kamu tidak menaati keinginan mereka yang menyesatkan, maka akan timbul bahaya atau terjadi kekurangan dalam menunjuki manusia, maka berlepaslah dari kemampuan dirimu dan gunakanlah sesuatu yang dapat menghadapinya, yaitu tawakkal kepada Allah, dengan bersandar kepada Tuhanmu agar Dia menyelamatkan kamu dari keburukan mereka dalam menegakkan agama yang engkau diperintahkan menegakkannya, dan percayalah kepada-Nya dalam mencapai hal itu. Bagimu dan bagi umatmu. Dia akan mengurus masalahmu dengan cara yang lebih bermaslahat bagimu, karena Dia mengetahui maslahat hamba-Nya dari arah yang tidak diketahui hamba, Dia mampu menyampaikannya kepada hamba dari arah yang tidak diketahui hamba, dan Dia lebih sayang kepada hamba-Nya daripada diri hamba itu sendiri, daripada orang tuanya, bahkan lebih sayang melebihi siapa pun, khususnya kepada hamba-hamba pilihan-Nya yang Dia senantiasa mentarbiyah mereka, melimpahkan keberkahan-Nya yang tampak maupun yang tesembunyi, terlebih Dia telah memerintahkan untuk menyerahkan urusan kepada-Nya dan berjanji akan mengurus orang yang bertawakkal kepada-Nya. Oleh karena itu, urusan yang susah akan menjadi mudah, yang berat menjadi ringan, kebutuhan dapat terpenuhi, bahaya terhindar dan keburukan terangkat jika bertawakkal kepada-Nya. Kita dapat melihat, seorang hamba yang lemah ketika dia menyerahkan urusannya kepada Tuhannya, ternyata dia dapat melakukan perkara yang tidak dapat dilakukan banyak orang, hal itu karena Allah telah memudahkannya, dan kepada Allah-lah tempat memohon pertolongan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 3",
    "description": "Dan bertawakAllah kepada Allah agar dia meneguhkan langkahmu dalam menyerukan kebenaran. Dan janganlah engkau minta perlin-dungan kepada siapa pun karena cukuplah Allah sebagai pemelihara dirimu dari ancaman dan atau kemungkinan buruk dari kaum kafir dan munafik. 4. Beralih dari perintah bertakwa dan larangan menaati orang kafir, Allah melalui ayat ini kemudian berbicara tentang orang yang hatinya tidak istikamah, masalah zihar, dan anak angkat. Allah tidak menjadikan bagi seseorang dua hati dalam rongganya. Setiap manusia hanya memiliki satu hati dan darinya muncul kehendak atau keinginan. Karena itu, tidak mungkin di satu sisi ia beriman dan takut kepada Allah namun di sisi lain ia takut kepada selain Allah. Dan begitu juga, dia tidak menjadikan istrimu yang kamu zihar itu sebagai ibumu. Zihar adalah perkataan suami kepada istri, 'punggungmu haram bagiku seperti punggung ibuku, ' atau yang sama maksudnya. Dan dia juga tidak membenarkanmu menjadikan anak angkatmu sebagai anak kandungmu sendiri. Sejak saat itu hukum anak angkat dibatalkan. Dengan begitu nasab anak itu kembali ke nasab ayah kandungnya. Sesungguhnya yang demikian itu hanyalah perkataan di mulutmu saja yang tidak dilandasi ilmu yang benar. Allah mengatakan dan menetapkan hukum yang sebenarnya dan dia menunjukkan kepadamu jalan yang benar dan lurus."
  }
]