[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai istri-istri Nabi, siapa yang melakukan kemaksiatan yang nyata di antara kalian, azab akan dilipatgandakan untuknya dua kali lipat. Karena kedudukan mereka tinggi, maka sangat sesuai bila Allah menyiapkan hukuman berat karena dosa yang terjadi dari mereka, hal ini untuk melindungi kehormatan mereka dan kehormatan Rasulullah, dan hukuman tersebut mudah bagi Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "30. Wahai istri-istri Nabi! Siapa di antara kalian melakukan kemaksiatan yang zahir, maka digandakan siksa baginya pada hari kiamat dua kali lipat dikarenakan kedudukan dan posisi kalian serta demi menjaga harga diri Nabi -ṣallallāhu 'alaihi wa sallam-. Dan sesungguhnya menggandakan siksa itu bagi Allah adalah mudah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "30. Allah menjelaskan beberapa hukum khusus bagi ummahatul mukminin (istri-istri Rasulullah): “Wahai istri-istri Nabi, jika ada dari kalian yang berbuat dosa yang jelas, maka siksaan baginya akan dilipatgandakan di dunia dan di akhirat. Dan siksaan yang berlipatganda itu mudah untuk Allah berikan.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "30. بِفٰحِشَةٍ مُّبَيِّنَةٍ (yang mengerjakan perbuatan keji yang nyata) Yakni perbuatan buruk dan keji yang jelas. Dan Allah telah melindungi dan menyucikan mereka dari hal ini. يُضٰعَفْ لَهَا الْعَذَابُ ضِعْفَيْنِ ۚ( niscaya akan di lipat gandakan siksaan kepada mereka dua kali lipat) Yakni jika mereka melakukan perbuatan keji itu maka Allah akan mengazab mereka dengan azab dua kali lipat dari azab wanita selain mereka. Hal ini karena kedudukan Rasulullah dan derajat mereka yang tinggi. وَكَانَ ذٰلِكَ عَلَى اللهِ يَسِيرًا(Dan adalah yang demikian itu mudah bagi Allah) Yakni bukanlah sesuatu yang berat dan susah bagi-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "30. Hai isteri-isteri Nabi, siapa-siapa di antaramu yang mengerjakan perbuatan keji yang nyata, niscaya akan di lipat gandakan siksaan kepada mereka dua kali lipat. Dan adalah yang demikian itu mudah bagi Allah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai istri-istri Nabi, siapa di antara kalian yang melakukan perbuatan keji yang nyata} maksiat yang nyata {pasti azabnya akan dilipat gandakan dua kali untuknya. Hal yang demikian itu bagi Allah sangat mudah} mudah dan gampang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "30. Setelah mereka memilih Allah, RasulNYa dan akhirat, maka Allah menjelaskan pelipatgandaan pahala untuk mereka dan pelipatgandaan dosa dan kesalahan kalau mereka melakukannya, agar mereka lebih bersikap hati-hati dan bersyukur kepada Allah. Oleh karena itu, Allah menetapkan siapa saja dari mereka yang melakukan perbuatan keji yang nyata, maka mereka mendapatkan siksaan dua kali lipat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahzab ayat 30: Allah menyeru istri-istri Nabi ﷺ dengan nasihat dan petunjuk serta mendidik mereka, setelah mereka memilih Allah dan Rasul-Nya ﷺ serta memilih akhirat, Allah berkata kepada mereka : Wahai istri-istri Nabi, barangsiapa yang di antara kalian datang dengan kebiasaan yang buruk, maksiat terang-terangan, Allah akan berikan adzab dua kali lipat kepada kalian, urusan itu bagi Allah adalah mudah. Dan ini adalah peringatan untuk seluruh wanita-wanita yang beriman."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah mereka memilih Allah, Rasul-Nya dan negeri akhirat, maka Allah menyebutkan pahala yang berlipatganda untuk mereka, dan berlipatgandanya dosa mereka jika mereka melakukan maksiat, yang demikian agar mereka lebih berhati-hati terhadap dosa dan agar mereka bersyukur kepada Allah Ta’ala, sehingga Dia menerangkan, bahwa barang siapa di antara mereka mengerjakan perbuatan keji yang nyata, maka ia akan memperoleh azab dua kali lipat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 30",
    "description": "Allah menjanjikan balasan yang agung bagi istri-istri nabi yang berbuat baik. Di sisi yang lain, mereka juga dihadapkan pada acaman yang mengerikan jika berbuat dosa. Wahai istri-istri nabi! barang siapa di antara kamu yang mengerjakan perbuatan keji yang nyata, seperti zina dan durhaka kepada suami, niscaya azabnya akan dilipatgandakan dua kali lipat kepadanya dibanding perempuan-perempuan yang bukan istri nabi. Dan yang demikian itu mudah bagi Allah. []31. Wahai para istri nabi, kamu mempunyai kedudukan yang lebih utama dibandingkan para wanita biasa disebabkan besarnya tanggung jawab yang harus kamu emban. Bila salah satu dari kamu berbuat dosa yang nyata maka ia akan mendapat hukuman dua kali lebih berat. Dan barang siapa di antara kamu, wahai para istri nabi, tetap taat kepada Allah dan rasul-Nya dan selalu mengerjakan kebajikan, niscaya kami berikan pahala kepadanya dua kali lipat dibandingkan pahala wanita yang bukan istri nabi, dan kami sediakan rezeki yang mulia baginya, baik di dunia maupun di akhirat."
  }
]