[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan barangsiapa diantara kalian yang menaati Allah dan RasulNya dan mengamalkan apa yang Allah perintahkan, Kami memberikan pahala amalnya seperti dua kali pahala pengamal kebaikan dari wanita-wanita lainnya, dan menyiapkan rizki yang mulia untuknya, yaitu surga."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "31. Dan barangsiapa di antara kalian yang menaati Allah dan Rasul-Nya dan mengerjakan amal saleh yang diridai di sisi Allah, maka Kami akan memberikan kepadanya pahala dua kali lipat dari pahala wanita-wanita lain, dan Kami telah siapkan baginya di Akhirat pahala yang mulia, yaitu Surga."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "31. Wahai istri-istri Nabi, barangsiapa di antara kalian yang mentaati Allah dan rasul-Nya, dan menjalankan segala perintah-Nya, maka Kami akan melipatgandakan pahala baginya dua kali lipat, sebagai pahala ketaatan dan pelaksanaan, dan pahala dari para wanita shalihah yang meneladaninya. Dan Kami akan menyiapkan -dengan kekuasaan dan keagungan Kami- bagi orang yang mentaati rezeki yang luas dan pahala di surga.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "31. وَمَن يَقْنُتْ مِنكُنَّ لِلّٰهِ وَرَسُولِهِۦ (Dan barang siapa diantara kamu sekalian (isteri-isteri nabi) tetap taat kepada Allah dan Rasul-Nya) Yakni siapa yang senantiasa dalam ketaatan kepada Allah dan rasul-Nya. نُّؤْتِهَآ أَجْرَهَا مَرَّتَيْنِ (niscata Kami memberikan kepadanya pahala dua kali lipat) Yakni dua kali lipat dari pahala yang dilakukan oleh wanita selain mereka jika mereka melakukan ketaatan itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "31. Barangsiapa (istri-istri Nabi) senantiasa sibuk dalam ketaatan kepada Allah dan rasul-Nya dengan maksimal, maka akan Kami berikan pahala dua kali lipat atas pahala mereka. Akan Kami sediakan rezeki yang baik di surga sebagai tambahan pahala bagi mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Siapa saja di antara kalian yang tetap taat kepada Allah dan RasulNya} siapa saja di antara kalian yang tetap taat kepada Allah dan rasulNya {dan mengerjakan amal shalih, niscaya Kami anugerahkan kepadanya pahala dua kali lipat dan Kami menyediakan baginya} menyediakan {rezeki yang mulia"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahzab ayat 31: Allah mengabarkan,barangsiapa yang amalannya daripada kalian yang ikhlas karena Allah dan Rasul-Nya dan terus dalam keadaan demikian, serta beramal dengan amalan-amalan yang shalih; Maka sungguh Allah akan melipat gandakan bagi mereka dua kali lipa pahala, dan Allah berikan rezeki yang baik di dalam surga yang penuh nikmat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sedikit atau banyak. Di surga sebagai tambahan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 31",
    "description": "Wahai para istri nabi, kamu mempunyai kedudukan yang lebih utama dibandingkan para wanita biasa disebabkan besarnya tanggung jawab yang harus kamu emban. Bila salah satu dari kamu berbuat dosa yang nyata maka ia akan mendapat hukuman dua kali lebih berat. Dan barang siapa di antara kamu, wahai para istri nabi, tetap taat kepada Allah dan rasul-Nya dan selalu mengerjakan kebajikan, niscaya kami berikan pahala kepadanya dua kali lipat dibandingkan pahala wanita yang bukan istri nabi, dan kami sediakan rezeki yang mulia baginya, baik di dunia maupun di akhirat. 32. Wahai para istri nabi, kamu adalah pendamping nabi yang merupakan representasi Al-Qur'an dan islam, maka sudah menjadi kewajiban kamu untuk menjaga citra tersebut. Wahai istri-istri nabi, kedu-dukan dan keutamaan kamu tidak sama seperti perempuan-perempuan yang lain, jika kamu bertakwa. Kamu harus menjaga kehormatan kamu lebih dari usaha perempuan lain menjaga kehormatan mereka. Maka, janganlah kamu tunduk, yakni menggenitkan suara dalam berbicara sehingga bangkit nafsu orang yang ada penyakit dalam hatinya, yakni orang yang mempunyai niat berbuat serong; dan ucapkanlah perkataan yang baik dengan cara yang wajar."
  }
]