[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai istri-istri Nabi, kalian dalam perkara keutamaan dan kedudukan tidak seperti wanita-wanita lain, jika kalian menaati Allah dan RasulNya, serta menjauhi kemaksiatan kepadaNya. Jangan berbicara dengan orang-orang asing dengan suara lemah lembut yang membuat orang-orang yang berhati sakit berharap melakukan perbuatan haram. Ini adalah adab wajib atas setiap wanita yang beriman kepada Allah dan Hari Akhir, dan ucapkanlah kata-kata yang jauh dari kecurigaan yang diingkari oleh syariat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "32. Wahai istri-istri Nabi Muhammad -ṣallallāhu 'alaihi wa sallam-! Kalian tidaklah seperti wanita-wanita lain dalam hal keutamaan dan kemuliaan, akan tetapi dalam hal keutamaan dan kemuliaan ini kalian berada pada tingkat yang tidak bisa dicapai oleh wanita selain kalian, apabila kalian menaati perintah Allah dan menjauhilarangan-Nya. Maka janganlah kalian mengintonasikan ucapan dan menipiskan suara, saat kalian sedang berbicara dengan orang-orang asing dari kalangan lelaki, sehingga orang-orang yang di dalam hati mereka terdapat penyakit nifak dan syahwat yang haram menjadi bangkit karena hal itu. Dan ucapkanlah ucapan yang jauh dari keraguan, dengan menjadikan ucapan tersebut serius, tidak ada main-main, sekedar yang diperlukan saja."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "32. Wahai istri-istri Nabi, kalian bukanlah seperti wanita yang lain; jika kalian bertakwa, maka kalian adalah ummahatul mukminin dan istri-istri penutup para nabi serta teladan bagi wanita lainnya. Maka janganlah kalian mendayu-dayukan suara saat berbicara, sehingga dapat mengoncang hati orang yang dalam hatinya terdapat penyakit berupa syahwat yang besar. Dan berkatalah dengan perkataan yang baik dan diterima oleh syariat dan budaya, tanpa mengandung perkataan kasar."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "32. يٰنِسَآءَ النَّبِىِّ لَسْتُنَّ كَأَحَدٍ مِّنَ النِّسَآءِ ۚ إِنِ اتَّقَيْتُنَّ (Hai isteri-isteri Nabi, kamu sekalian tidaklah seperti wanita yang lain, jika kamu bertakwa) Dalam ayat ini Allah menjelaskan bahwa keutamaan mereka tidak sekedar karena hubungan mereka dengan Rasulullah, namun juga karena ketakwaan yang jelas mereka miliki, keimanan yang tulus, dan menitih jalan Rasulullah pada masa kehidupannya dan setelah kematiannya. فَلَا تَخْضَعْنَ بِالْقَوْلِ(Maka janganlah kamu tunduk dalam berbicara) Yakni janganlah kalian melembutkan suara kalian saat berbicara dengan para lelaki seperti yang dilakukan oleh wanita-wanita penggoda. فَيَطْمَعَ الَّذِى فِى قَلْبِهِۦ مَرَضٌ(sehingga berkeinginanlah orang yang ada penyakit dalam hatinya) Yakni hati yang fajir atau munafik. وَقُلْنَ قَوْلًا مَّعْرُوفًا (dan ucapkanlah perkataan yang baik) Yakni ucapkanlah perkataan yang baik pada orang lain dan jauhilah keraguan, serta menggunakan kata-kata yang sesuai dengan tuntunan syariat, yang tidak menimbulkan keingkaran pada orang yang mendengarnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "32. “Wahai para istri Nabi, keutamaan dan derajat kalian bukanlah seperti perempuan lain. - Kata ahad dalam susunan negatif (laisa) menunjukkan makna laki-laki dan perempuan, juga itu tunggal dan jamak. - Jika kalian (para istri Nabi) senantiasa sibuk dalam ketaqwaan, dengan mengerjakan perintah dan menjauhi segala larangan. Jangan lemahkan suara kalian untuk menunjukkan kelembutan dan sifat keperempuanan kepada para lelaki, berkatalah dengan baik tanpa harus melembutkan suara, agar tidak terjadi kesalahpahaman dan keraguan dari para lelaki.” Qaul ma’ruf: kata-kata yang moderat, tidak menyinggung"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai istri-istri Nabi, kalian tidaklah seperti perempuan-perempuan yang lain jika kalian bertakwa} kalian menjadikan di antara kalian dan kemurkaan Allah dan rasulNya sebuah penjagaan, dengan melakukan perintah dan menjauhi larangan {Maka janganlah merendahkan suara} maka janganlah kalian melembutkaan ucapan dan memperhalus suara ketika kalian berbicara dengan laki-laki asing {sehingga bangkit nafsu orang yang ada penyakit} meluap-luap dan bernafsu {dalam hatinya dan ucapkanlah perkataan yang baik} perkataan yang diketahui sangat jauh dari keraguan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "32. Allah berfirman, “Hai istri-istri Nabi,” satu sapaan (khithab) untuk mereka semua, “kalian tidaklah seperti wanita yang lain, jika kalian bertakwa” kepada Allah. Karena sesungguhnya kalian dengan begitu mengungguli seluruh kaum wanita dan tidak satu pun wanita bisa menyamai kalian. Maka sempurnakanlah takwa dengan seluruh sarana (wasilah) dan tujuan-tujuannya. Maka dari itu mereka dibimbing untuk memutus segala sarana yang diharamkan, seraya berfirman, “Maka janganlah kalian tunduk dalam berbicara,” maksudnya, dalam berbicara kepada kaum laki-laki, atau pembicaraan yang mana mereka dapat mendengarnya, lalu kalian bersikap halus dan berbicara dengan perkataan lembut yang dapat merangsang, sehingga berkeinginanlah “orang yang ada penyakit dalam hatinya,” maksudnya, penyakit birahi zina. Sebab, orang seperti itu selalu siap mengintai perangsang apa pun yang dapat merangsangnya, karena hatinya tidak tidak sehat. Sedangkan hati yang sehat tidak mempunyai syahwat (ketertarikan) kepada segala sesuatu yang Allah haramkan. Sebba, hati seperti itu hampir tidak dapat dirangsang dan digerakkan oleh sebab-sebab (yang merangsang) karena kesehatan dan kebersihannya dari penyakit. Sangat berbeda dengan orang yang hatinya sakit yang tidak sanggup menahan godaan yang bisa ditahan oleh orang yang berhati sehat, dan tidak bisa sabar atas sesuatu yang mana orang yang berhati sehat bisa sabar. Jadi, pemicu sekecil apa pun yang ada dan merangsangnya untuk melakukan yang haram, maka ia akan memenuhi rangsangannya dan langsung melakukannya. Ini membuktikan “Bahwa faktor (penyebab dan) sarana mempunyai hukum-hukum menurut tujuannya,” Sebab hukum asal sikap tunduk dan sikap lembut dalam berbicara itu mubah (boleh). Akan tetapi karena ia bisa menjadi sarana (penyebab) kepada hal yang diharamkan, maka ia tidak diperbolehkan. Maka dari itu, hendaknya seorang perempuan tidak melembutkan suaranya dalam berbicara kepada laki-laki. Dan ketika Allah melarang mereka bersikap lembut dalam berkata, maka bisa jadi muncul dugaan salah bahwa mereka diperintah untuk memperkasar perkataan. Hal ini disingkirkan dengan FirmanNya, “Dan ucapkanlah perkataan yang baik,” maksudnya, tidak kasar dan tidak kering, sebagaimana (perintah untuk) tidak lembut lagi tunduk. Cobalah perhatikan bagaimana Allah berfirman, “Maka janganlah kalian tunduk dalam berbicara,” Allah tidak mengatakan , “Maka janganlah lembut dalam berbicara.” Hal tersebut karena yang dilarang adalah pembicaraan lembut yang di situ terkandung sikap tunduknya seorang wanita kepada laki-laki dan salah tingkah di hadapannya. Dan orang yang tunduk adalah orang membuat orang lain ingin padanya. Berbeda dengan orang yang berbicara dengan pembicaraan lembut yang tidak mengandung sikap tunduk, bahkan terkadang bisa mengandung sikap keras dan mampu mengalahkan lawan. Maka orang yang seperti ini, lawan jenisnya tidak berkeinginan padanya. Maka dari itu Allah memuji RasulNya karena kelembutan beliau, seraya berfirman, \"Maka disebabkan rahmat dari Allah-lah kamu berlaku lemah-lembut terhadap mereka. Sekiranya kamu bersikap keras lagi berhati kasar, tentulah mereka menjauhkan diri dari sekelilingmu\" (Ali Imran:159). Dan Dia berfirman kepada Musa dan Harun, \"Pergilah kamu berdua kepada Firaun, sesungguhnya dia telah melampaui batas; maka berbicaralah kamu berdua kepadanya dengan kata-kata yang lemah lembut, mudah-mudahan ia ingat atau takut\". (Thaha:43-44). Dan Firman Allah, “Sehingga berkeinginanlah orang yang ada penyakit dalam hatinya,” padahal Dia memerintahkan supaya menjaga kemaluan dan Dia memuji laki-laki dan perempuan yang memelihara kemaluannya, serta Dia melarang perbuatan mendekati zina. Ini menunjukkan bahwa sepantasnya seorang hamba apabila merasakan pada dirinya ada kondisi seperti ini, dan dia merasa berhasrat untuk melakukan yang diharamkan saat melihat atau mendengar pembicaraan orang yang dia suka, dan dia merasakan adanya motivator (syahwat) keinginannya telah tertuju kepada yang haram, maka hendaknya dia mengetahui bahwa itu adalah penyakit, dan hendaklah dia bersungguh-sungguh dalam upaya melemahkan penyakit ini dan menumpas bisikan-bisikan rendahan itu, serta bermujahadah melawan nafsu untuk menyelamatkan diri dari penyakit yang sangat berbahaya ini, dan memohonlah kepada Allah perlindungan dan taufikNya; dan (hendaklah dia mengetahui) bahwa upaya yang demikian ini termasuk dalam kategori memelihara kemaluan (kehormatan) yang diperintahkan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahzab ayat 32: Allah menyeru istri-istri Nabi ﷺ dan mengkabarkan bahwa mereka tidaklah sama keutamaan dan kedudukan mereka sebagaimana para perempuan biasa, karena mereka memiliki kedudukan sebagai wanita-wanita yang dijadikan contoh (qudwah) dalam mendidik semua wanita, dan ini adalah kedudukan yang agung bagi perempuan jika mereka beramal dengan ketaatan kepada Allah dan menjauhi dari kemaksiatan. Kemudian Allah menganjurkan agar mereka lemah lembut dan gemulai dalam berbicara kepada laki-laki asing, sehingga terdapat syahwat penyakit keinginan di dada laki-laki asing yang haram. Dan Allah memerintahkan mereka untuk berbicara dengan pembicaraan yang baik, terpuji yang jauh dari kegelisahan. Ini adalah adab yang wajib bagi seluruh wanita yang beriman kepada Allah dan hari akhir."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni, jika mereka bertakwa kepada Allah, maka mereka akan mengungguli kaum wanita dan tidak akan dikejar oleh yang lain. Maka mereka menyempurnakan takwa dengan mengerjakan semua sarana kepada takwa dan maksudnya. Oleh karena itulah, di ayat ini Allah Subhaanahu wa Ta'aala mengarahkan mereka untuk memutuskan sarana-sarana yang dapat mengarah kepada yang haram. Dengan laki-laki atau ketika mereka mendengarkan suaramu. Allah Subhaanahu wa Ta'aala dalam ayat tersebut menggunakan kata-kata, “Falaa takhdha’na bil qauli” (jangan kamu tunduk dalam bicara) tidak “Falaa talinna bil qauli” (jangan kamu lembut dalam suara), karena yang dilarang adalah ucapan lembut yang di sana terdapat ketundukan wanita kepada laki-laki dan jatuh di hadapan mereka. Ucapan lembut yang disertai ketundukan itulah yang membuat laki-laki tergoda, akan tetapi ucapan lembut yang di sana tidak terdapat ketundukan, bahkan terkadang terdapat ketinggian di hadapan musuh, maka yang demikian tentu tidak membuat lawan bicaranya menjadi suka. Oleh karena itulah, Allah memuji Rasul-Nya karena kelembutannya (lihat surah Ali Imran: 159) dan memerintahkan Musa dan Harun ‘alaihimas salam untuk berkata lembut kepada Fir’aun (lihat surah Thaha: 43-44). Yang dimaksud dengan orang yang ada penyakit dalam hatinya adalah orang yang mempunyai niat berbuat serong dengan wanita, seperti melakukan zina. Orang yang hatinya tidak sehat sangat mudah sekali tergerak hatinya karena melihat atau mendengar sesuatu yang membangkitkan syahwat. Adapun orang yang sehat hatinya dari penyakit hati, maka tidak ada syahwat terhadap yang diharamkan Allah, tidak membuatnya cenderung dan tidak tergerak olehnya. Berbeda dengan orang yang sakit hatinya, maka ia tidak mampu menahan seperti yang dilakukan oleh orang yang sehat hatinya, dan tidak bersabar seperti kesabarannya. Sehingga ketika ada sebab kecil pun yang mengarah kepada yang haram, maka orang yang hatinya ada penyakit akan mudah mengikutinya dan tidak mau menolaknya. Ayat, “Sehingga bangkit nafsu orang yang ada penyakit dalam hatinya,” di samping memerintahkan untuk menjaga kemaluan dan sebagai pujian terhadap laki-laki yang menjaganya dan perempuan yang menjaganya serta larangan mendekati zina, juga menunjukkan bahwa sepatutnya seorang hamba apabila melihat keadaan seperti ini dalam dirinya, dan merasa senang mengerjakan yang haram saat melihat atau mendengar ucapan orang yang menginginkannya, serta mendapatkan pendorong ketamakannya dan telah mengarah kepada yang haram, maka kenalilah bahwa itu adalah penyakit. Oleh karena itu, hendaknya ia berusaha memperkecil penyakit ini dan memutuskan pikiran-pikiran buruk yang melintas di hati serta berusaha menyelamatkan dirinya dari penyakit berbahaya ini, serta meminta perlindungan dan taufik kepada Allah Subhaanahu wa Ta'aala, dan bahwa yang demikian termasuk menjaga farji yang diperintahkan. Dalam ayat ini terdapat dalil, bahwa sarana dihukumi dengan tujuannya, karena melembutkan suara pada asalnya adalah mubah, akan tetapi karena hal itu menjadi sarana kepada yang haram, maka diharamkan pula. Oleh karena itu, selayaknya bagi kaum wanita tidak melunakkan suaranya ketika berbicara dengan laki-laki. Setelah Allah melarang mereka melembutkan suara, mungkin timbul persangkaan, bahwa kalau demikian berarti mereka diperintahkan untuk mengeraskan suara, maka anggapan seperti ini ditolak dengan firman-Nya, “dan ucapkanlah perkataan yang baik.” Yakni ucapkanlah perkataan yang tidak kasar, namun tidak pula terlalu lembut."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 32",
    "description": "Wahai para istri nabi, kamu adalah pendamping nabi yang merupakan representasi Al-Qur'an dan islam, maka sudah menjadi kewajiban kamu untuk menjaga citra tersebut. Wahai istri-istri nabi, kedu-dukan dan keutamaan kamu tidak sama seperti perempuan-perempuan yang lain, jika kamu bertakwa. Kamu harus menjaga kehormatan kamu lebih dari usaha perempuan lain menjaga kehormatan mereka. Maka, janganlah kamu tunduk, yakni menggenitkan suara dalam berbicara sehingga bangkit nafsu orang yang ada penyakit dalam hatinya, yakni orang yang mempunyai niat berbuat serong; dan ucapkanlah perkataan yang baik dengan cara yang wajar. 33. Dan hendaklah kamu, wahai istri-istri nabi, tetap di rumahmu dan tidak keluar kecuali untuk keperluan yang dibenarkan oleh agama, dan janganlah kamu berhias dan bertingkah laku seperti orang-orang jahiliah dahulu, di antaranya menggunakan gelang kaki dan menghen'takkannya saat berjalan serta menampakkan bagian tubuh yang seharusnya ditutupi. Dan laksanakanlah salat secara sempurna, baik salat wajib maupun sunah; tunaikanlah zakat, dan taatilah Allah dan rasul-Nya dengan menjalankan perintah dan menjauhi larangan. Sesungguhnya Allah, dengan menurunkan perintah dan larangan itu, bermaksud hendak menghilangkan dosa dari kamu, wahai ahlulbait, yaitu keluarga rasulullah, dan membersih'kan kamu sebersih-bersihnya."
  }
]