[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tetaplah kalian di rumah kalian, jangan meninggalkannya kecuali bila ada hajat. Jangan memperlihatkan kecantikan kalian, seperti yang dilakukan oleh wanita-wanita jahiliyah pertama di zaman-zaman yang telah berlalu sebelum Islam. Ini adalah pembicaraan kepada seluruh wanita Mukmin di setiap masa. Tegakkanlah (wahai istri-istri Nabi) shalat dengan sempurna pada waktunya. Bayarlah zakat sebagaimana yang Allah syariatkan. Taatilah Allah dan RasulNya dalam perintah keduanya dan larangan keduanya. Allah mewasiatkan hal itu untuk kalian karena Dia hendak membersihkan kalian dan menjauhkan kalian dari keburukan dan gangguan wahai Ahlul Bait Nabi, (termasuk dalam hal ini adalah istri-istri beliau dan anak keturunan beliau), dan menyucikan jiwa kalian sesuci-sucinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "33. Menetaplah di rumah-rumah kalian dan janganlah kalian keluar darinya kecuali karena ada keperluan, dan janganlah kalian tampakkan keindahan kalian sebagaimana yang menjadi kebiasaan para wanita sebelum datangnya Islam, yang menampakkannya untuk menggoda kaum lelaki. Dirikanlah salat dengan sempurna dan tunaikan zakat harta kalian serta taatilah Allah dan Rasul-Nya. Sesungguhnya Allah berkehendak untuk menghilangkan kotoran dan dosa dari diri kalian wahai para istri Nabi dan Ahlibaitnya, dan Allah berkehendak untuk membersihkan jiwa kalian dengan cara menghiasinya dengan berbagai akhlak yang utama dan membersihkannya dari kotoran-kotoran jiwa dengan sebersih-bersihnya, tidak tersisa setelah itu satu kotoran pun."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "33. Dan tetaplah kalian dalam rumah kalian, janganlah kalian keluar dari rumah melainkan ada kebutuhan seperti menuntut ilmu, atau demi mencari pahala, atau juga mengharap keutamaan, seperti untuk shalat jamaah, berbuat baik, dan menyambung silaturrahim. Dan janganlah kalian bertabarruj, dengan menampakkan perhiasan kalian seperti perbuatan para wanita pada zaman jahiliyah, namun hendaklah kalian menjadi wanita yang memiliki rasa malu. Dan tetaplah mendirikan shalat, bersegeralah menunaikan zakat, dan taatilah Allah dan Rasul-Nya dengan menjalankan segala perintah-Nya dan menjauhi larangan-Nya. Wahai para istri Nabi, sesungguhnya dengna perintah melakukan perbuatan baik dan utama dan larangan dari perbuatan buruk dan dosa ini, Allah hendak membersihkan kalian dari kotoran kemaksiatan dan dosa, dan menyucikan kalian sesuci-sucinya sesuai dengan ketinggian derajat kalian dan kemuliaan sifat kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "33. وَقَرْنَ فِى بُيُوتِكُنَّ (dan hendaklah kamu tetap di rumahmu) Ini merupakan perintah bagi mereka agar menetap dan berdiam diri di rumah-rumah mereka. وَلَا تَبَرَّجْنَ تَبَرُّجَ الْجٰهِلِيَّةِ الْأُولَىٰ ۖ(dan janganlah kamu berhias dan bertingkah laku seperti orang-orang Jahiliyah yang dahulu) Makna (التبرج) adalah perbuatan wanita yang menampakkan perhiasaan dan kecantikannya yang harus ia sembunyikan yang dapat mengundah syahwat laki-laki. وَأَطِعْنَ اللهَ وَرَسُولَهُۥٓ ۚ (dan taatilah Allah dan Rasul-Nya) Dalam segala yang disyariatkan, dan taatilah Rasulullah dalam segala urusan dunia yang dia perintahkan kepada kalian. إِنَّمَا يُرِيدُ اللهُ لِيُذْهِبَ عَنكُمُ الرِّجْسَ أَهْلَ الْبَيْتِ(Sesungguhnya Allah bermaksud hendak menghilangkan dosa dari kamu, hai ahlul bait) Yakni wahai ahlul bait nabi, Allah ketakwaan dan ketaatan yang Allah perintahkan kepada kalian adalah agar memebersihkan dosa yang memperburuk kehormatan yang diakibatkan ketidak-taatan terhadap apa yang diperintahkan Allah dan melakukan apa yang dilarang-Nya. وَيُطَهِّرَكُمْ تَطْهِيرًا (dan membersihkan kamu sebersih-bersihnya) Dari segala kotoran. Ahlul bait dalam ayat ini menurut Ibnu Abbas, Ikrimah, Atha, dan Said bin Jabir adalah khusus ditujukan kepada istri-istri Rasulullah. Dan ini adalah pendapat yang benar, sebab ayat ini diturunkan bagi mereka, dan ayat sebelum dan sesudahnya juga diturunkan bagi mereka, dan dalam ayat-ayat tersebut sama sekali tidak menyinggung tentang Ali bin Abi Thalib beserta istri dan anak-anaknya. Pendapat lain menyebutkan bahwa ayat ini mencakup seluruh ahlul bait yang bertakwa, baik itu istri-istrinya, anak-anaknya, dan paman-pamannya dan keturunan mereka; namun ayat ini tidak mencakup orang yang tidak bertakwa dari mereka seperti Abu Lahab dan semisalnya pada setiap zaman."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "33. “Menetaplah di dalam rumah, jangan terlalu banyak keluar tanpa keperluan yang disyariatkan. Jangan kalian tampakkan perhiasan (bersolek/menampakkan kecantikan) yang wajib kalian tutupi sehingga tidak mengundang syahwat para laki-laki. Dirikanlah shalat pada awal waktu, tunaikanlah zakat fitrah, dan taatilah perintah syariat Allah dan rasul-Nya. Sesungguhnya Allah hanya ingin membersihkan kalian dari dosa-dosa dan mensucikan kalian dari segala yang kotor wahai ahlu bait (keluarga nabi).” Maksud ahlul bait dalam ayat ini adalah para istri Nabi. Asy-syaukani mengatakan: Ini adalah kebenaran, ayat ini turun kepada/untuk para istri Nabi. Sebelum ayat ini maupun sesudah ayat ini. Ayat ini bukan untuk keluarga Ali dan istrinya Fatimah atau putera-puteranya radliyallahu ‘anhum. Seperti maksud kata ahlul bait pada surat Hud adalah istri Nabi Ibrahim"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Tetaplah di rumah-rumah kalian} dan tetaplah di rumah-rumah kalian, lalu janganlah kalian keluar tanpa ada keperluan {dan janganlah kalian bersolek} janganlah kalian menampakkan keindahan kalian {seperti orang-orang jahiliah dahulu bersolek} yang terdahulu sebelum Islam {Tegakkanlah shalat, tunaikanlah zakat, dan taatlah kepada Allah dan RasulNya. Sesungguhnya Allah hanya hendak menghilangkan dosa dari kalian} dosa dan keburukan {wahai ahlul bait dan membersihkan kalian dengan sebersih-bersihnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "33. “Dan hendaklah kalian tetap di rumah kalian,” maksudnya, tinggal selalu di dalam rumah, sebab yang demikian itu lebih selamat dan lebih menjaga kehormatan kalian, “dan janganlah kalian berhias dan bertingkah laku seperti orang-orang Jahiliyah yang dahulu.” Maksudnya, janganlah kalian banyak keluar dengan berhias atau memakai wangi-wangian sebagaimana kebiasaan wanita jahiliyah dahulu yang sama sekali tidak mempunyai pengetahuan dan agama. Semua ini adalah untuk mencegah keburukan dan segala pemicunya. Dan tatkala Allah memerintahkan mereka bertakwa secara umum dan diperintahkan melakukan beberapa partikal takwa, maka Allah menegaskannya karena melihat betapa butuhnya kaum wanita kepadanya. Demikian pula Allah memerintah mereka untuk taat, khususnya melakukan shalat dan zakat yang keduanya sangat di perlukan oleh setiap orang; dan keduanya merupakan ibadah yang paling besar dan ketaatan yang paling mulia. Sebab di dalam shalat terkandung keikhlasan kepada al-ma’bud (Allah), sedangkan di dalam zakat terkandung ikhsan (berbuat baik) kepada orang lain. Lalu Allah memerintah mereka taat secara umum, seraya berfirman, “Taatilah Allah dan RasulNya,” termasuk dalam taat kepada Allah dan RasulNya adalah segala perintah yang bersifat anjuran. “Sesungguhnya Allah bermaksud” dengan perintah yang diperintahkan kepada kalian dan larangan yang dilarang terhadap kalian “hendak menghilangkan dosa dari kalian” maksudnya, gangguan, keburukan dan kotoran “hai ahlul bait, dan membersihkan kalian sebersih-bersihnya,” sehingga kalian menjadi orang-orang yang suci lagi disucikan. Maksudnya, maka pujilah Rabb kalian dan bersyukurlah kepadaNya atas semua perintah-perintah dan larangan-larangan tersebut yang telah Dia kabarkan kemaslahatnnya; yaitu bahwa sesungguhnya semua itu adalah murni demi kemaslahatan kalian, bahkan sama sekali Allah tidak menghendaki dosa bagi kalian dengan hal itu, melainkan agar jiwa kalian suci, akhlak kalian menjadi bersih dan amal perbuatan kalian menjadi baik serta pahala kalian menjadi sangat besar."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahzab ayat 33: Kemudian Allah mewasiatkan mereka dengan berkata : Tetaplah di rumah-rumah kalian dan berdiamlah serta menetap di dalamnya, janganlah kalian keluar dari rumah-rumah kalian dengan berhias, mempercantik diri sebagaimana yang dilakukan wanita-wanita jahiliyyah sebelum islam, dan tegakkanlah shalat serta menjaga atas waktunya dan syarat-syaratnya, rukun-rukunnya, wajib-wajibnya, sunnah-sunnahnya. Tunaikanlah zakat yang diwajibkan zakat tersebut bagi kalian, dan teruslah di atas ketaatan kepada Allah dan Rasul-Nya dalam menjalankan perintah-perintah dan menjauhi larangan-larangan. Sungguh Allah menginginkan kalian beramal dengan amalan-amalan ini, dan melarang kalian dengan larangan-larangan ini; Agar kalian menjauhi keburukan, kehinaan dan kekejian wahai Ahlu Bait (keluarga) Nabi ﷺ, Allah juga ingin mensucikan kalian secara sempurna sampai kalian menjadi suci dan disucikan serta menjadi qudwah bagi wanita-wanita yang beriman (lainnya)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ibnu Abi Hatim meriwayatkan dari Ibnu Abbas radhiyallahu 'anhuma tentang firman Allah Ta’ala, “Sesungguhnya Allah bermaksud hendak menghilangkan dosa dari kamu, wahai ahlul bait,” ia berkata, “Ayat ini turun berkenaan istri-istri Nabi shallallahu 'alaihi wa sallam secara khusus.” Maksudnya, isteri-isteri Rasul agar tetap di rumah, dan keluar rumah hanyalah jika ada keperluan yang dibenarkan syara'. Perintah ini juga meliputi segenap wanita mukminah. Tetap di dalam rumah dapat lebih menyelamatkan dan menjaga mereka. Yakni sebelum datangnya Islam, di mana kaum wanita memperlihatkan kecantikannya kepada laki-laki. Setelah Islam datang, maka yang boleh ditampakkan adalah perhiasan yang biasa tampak saja, lihat lebih jelasnya di tafsir surah An Nuur: 31. Menurut Syaikh As Sa’diy, maksud ayat tersebut adalah janganlah kamu sering keluar sambil berdandan dan memakai wewangian sebagaimana kebiasaan orang-orang Jahiliyyah dahulu yang tidak memiliki ilmu dan agama. Ini semua adalah untuk menghindari keburukan dan sebab-sebab yang membawa kepadanya. Setelah Allah Subhaanahu wa Ta'aala memerintahkan mereka bertakwa secara umum, dan memerintahkan bagian-bagian takwa, maka mereka diperintahkan agar tetap di rumah dan dilarang bertabarruj (berdandan ketika keluar rumah) sebagaimana kebiasaan Jahiliyyah, karena perlunya mereka dijelaskan hal ini. Demikian pula mereka diperintahkan taat, khususnya dengan melakukan shalat dan menunaikan zakat yang dibutuhkan sekali oleh setiap orang. Keduanya adalah ibadah besar dan ketaatan yang agung, di dalam shalat ada sikap ikhlas kepada Allah yang disembah, dan di dalam zakat ada sikap ihsan kepada hamba-hamba Allah. Selanjutnya Allah Subhaanahu wa Ta'aala memerintahkan mereka taat secara umum, firman-Nya, “dan taatilah Allah dan Rasul-Nya.” Termasuk ketaatan kepada Allah dan rasul-Nya adalah menaati semua yang diperintahkan; wajib atau sunat. Demikian pula keburukan dan kotoran. Dengan adanya perintah dan larangan itu. Ahlul bait di sini, yaitu keluarga Rasulullah shallallahu 'alaihi wa sallam. Sehingga kamu suci lagi menyucikan. Oleh karena itu, pujilah Tuhanmu dan syukurilah karena adanya perintah dan larangan ini, yang telah Dia beritahukan maslahatnya, dan bahwa hal itu murni maslahat (tidak ada mafsadatnya); Allah tidak menghendaki mengadakan kesempitan dan kesulitan bagimu, bahkan agar dirimu bersih dan pahalamu besar."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 33",
    "description": "Dan hendaklah kamu, wahai istri-istri nabi, tetap di rumahmu dan tidak keluar kecuali untuk keperluan yang dibenarkan oleh agama, dan janganlah kamu berhias dan bertingkah laku seperti orang-orang jahiliah dahulu, di antaranya menggunakan gelang kaki dan menghen'takkannya saat berjalan serta menampakkan bagian tubuh yang seharusnya ditutupi. Dan laksanakanlah salat secara sempurna, baik salat wajib maupun sunah; tunaikanlah zakat, dan taatilah Allah dan rasul-Nya dengan menjalankan perintah dan menjauhi larangan. Sesungguhnya Allah, dengan menurunkan perintah dan larangan itu, bermaksud hendak menghilangkan dosa dari kamu, wahai ahlulbait, yaitu keluarga rasulullah, dan membersih'kan kamu sebersih-bersihnya. 34. Dan ingatlah, yakni hafalkan, pahami, laksanakan, dan ajarkanlah apa yang dibacakan di rumahmu dari ayat-ayat Allah, yakni Al-Qur'an, dan hikmah, yakni sunah nabi. Sungguh, Allah mahalembut kepada orang-orang yang taat, maha mengetahui siapa saja yang layak mendapat kemuliaan dan kedudukan tinggi. Khitab dalam ayat-ayat ini memang ditu'jukan kepada para istri nabi, namun wanita muslimah yang baik harus mencontoh apa yang dikerjakan oleh para istri nabi tersebut."
  }
]