[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ingatlah apa yang dibacakan di rumah kalian, yaitu al-Qur’an dan hadist Rasulullah, amalkanlah ia, hargailah ia dengan baik, karena ia termasuk nikmat-nikmat Allah kepada kalian. Sesungguhnya Allah Mahalembut kepada kalian, karena Dia menjadikan kalian tinggal di rumah-rumah di mana di dalamnya dibacakan ayat-ayat Allah dan Sunnah RasulNya, juga Maha teliti saat Dia memilih kalian menjadi istri-istri RasulNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "34. Dan ingatlah apa yang dibacakan di rumah-rumah kalian dari ayat-ayat Allah yang diturunkan kepada Rasul-Nya dan sunah-sunah Rasul-Nya yang suci. Sesungguhnya Allah Mahalembut tatkala memberikan rahmat kepada kalian dengan menempatkan kalian di rumah-rumah Nabi-Nya. Dia Maha Mengetahui keadaan kalian tatkala memilih kalian sebagai istri bagi Rasul-Nya, dan memilih kalian sebagai ibu bagi seluruh kaum mukminin dari umatnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "34. Dan ingatlah selalu sebagai ilmu, amal, dan pengajaran apa yang dibaca di rumah kalian yang berupa ayat-ayat al-Qur’an dan sunnah Nabi Muhammad sebagai penjelas dan penegas apa yang ada dalam al-Qur’an. Allah Maha Lembut kepada hamba-hamba-Nya dalam segala perintah dan ketetapan-Nya, dan Maha Mengetahui segala perbuatan mereka. Dia Maha Mengetahui segala yang tersembunyi, dan menjanjikan kelembutan dan perlindungan bagi para kekasih-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "34. وَاذْكُرْنَ مَا يُتْلَىٰ فِى بُيُوتِكُنَّ مِنْ ءَايٰتِ اللهِ وَالْحِكْمَةِ ۚ (Dan ingatlah apa yang dibacakan di rumahmu dari ayat-ayat Allah dan hikmah) Yakni ingatlah ayat-ayat al-Qur’an dan sunnah Rasulullah yang dibacakan di dalam rumah kalian serta tetaplah membaca, mempelajari, dan mengajarkannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "34. Ingat-ingatlah selalu, ayat-ayat Allah dan sunnah Nabawiyah yang dibacakan di dalam rumah kalian. Sesungguhnya Allah Maha Agung dalam berbuat kelembutan pada para kekasih-Nya serta orang yang taat kepada-Nya. Allah Maha Mengetahui atas segala ciptaan-Nya, serta Maha Tahu dan Memberlakukan segala yang terbaik untuk para makhluk-Nya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ingatlah apa yang dibacakan di rumah kalian yaitu ayat-ayat Allah dan hikmah} sunah {Sesungguhnya Allah Maha lembut lagi Maha Mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "34. Tatkala Allah memerintah mereka beramal (shalih) yang pada dasarnya adalah berbuat dan meninggalkan, maka Allah memerintah mereka belajar ilmu dan menjelaskan kepada mereka caranya, seraya berfirman, “Dan ingatlah apa yang dibacakan di rumah kalian dari ayat-ayat Allah dan hikmah (Sunnah Nabi),” yang dimaksud ayat-ayat Allah adalah al-Quran, sedangkan hikmah adalah rahasia-rahasianya dan sunah RasulNya, dan Allah juga memerintah mereka mengingat al-Quran, yang mencakup mengingat lafazhnya dengan cara membaca dan mengingat maknanya dengan cara mmerenungkan dan memikirkannya serta mengambil kesimpulan hukum-hukumnya dan hikmah-hikmahnya dan mengingat pengamalan dan tafsirnya. “Sesungguhnya Allah Mahalembut lagi Maha Mengetahui,” mengetahui segala rahasia semua perkara dan segala sesuatu yang tersimpan di dalam dada serta segala yang tersembunyi di langit dan bumi serta amal perbuatan yang Nampak dan yang dirahasiakan. Kelembutan dan pengetahuanNYa menuntut untuk menghimbau mereka untuk ikhlas, menyembunyikan amal perbuatan, dan (menuntut) pembalasan Allah atas semua amal perbuatan itu. Dan di antara makna al-Lathif (Yang Mahalembut) adalah Dzat Yang menghalau hambaNya kepada kebaikan dan melindunginya dari keburukan dengan cara-cara yang tersembunyi yang tidak bisa dirasakan, dan menggiring sebagian rizki kepadanya tanpa dia ketahui, dan memperlihatkan kepadanya sebab-sebab yang tidak disukai jiwa, yang mana hal itu menjadi jalan baginya menuju derajat yang paling tinggi dan kedudukan yang teratas."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahzab ayat 34: Kemudian Allah melanjutkan menasihati istri-istri Nabi ﷺ dengan berkata : Ingatlah selalu oleh kalian apa yang telah kalian baca dari Al Qur’an dan As Sunnah Nabi yang suci, dan teruslah untuk beramal dengan keduanya, sungguh Allah Maha Lembut kepada kalian wahai keluarga Nabi, mengetahui apa yang baik bagi kalian dalam urusan agama dan keduniaan; Karena, selalu mengingat Allah dan membaca kitabullah menghilangkan keragu-raguan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala memerintahkan mereka untuk beramal, yang di sana terdapat mengerjakan dan meninggalkan, maka Allah Subhaanahu wa Ta'aala memerintahkan mereka untuk berilmu, dan menjelaskan jalannya. Hikmah di sini bisa maksudnya sunnah Rasulullah shallallahu 'alaihi wa sallam dan bisa maksudnya rahasia-rahasia syariat. Allah memerintahkan mereka mengingatnya, termasuk ke dalamnya menyebut lafaznya dengan membacanya, mengingat maknanya dengan mentadabburi dan memikirkan ayat-ayat-Nya, menggali hukum-hukum-Nya, dan ingat pengamalannya. Allah mengetahui rahasia segala urusan dan yang disembunyikan dalam dada, serta yang tersembunyi di langit dan di bumi, demikian pula amal yang ditampakkan dan dirahasiakan. Kelembutan dan pengetahuan-Nya menghendaki untuk mendorong mereka berbuat ikhlas dan menyembunyikan amal, dan pemberian balasan dari Allah kepada amal mereka. Di antara makna Lathiif (Yang Mahalembut) adalah, bahwa Dia yang mengarahkan kebaikan kepada seorang hamba dan mengarahkan rezeki untuknya dari arah yang tidak dia ketahui, dan Dia akan memperlihatkan kepadanya sebab-sebab yang tidak disenangi oleh jiwa sebagai jalan baginya menuju derajat dan kedudukan yang lebih tinggi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 34",
    "description": "Dan ingatlah, yakni hafalkan, pahami, laksanakan, dan ajarkanlah apa yang dibacakan di rumahmu dari ayat-ayat Allah, yakni Al-Qur'an, dan hikmah, yakni sunah nabi. Sungguh, Allah mahalembut kepada orang-orang yang taat, maha mengetahui siapa saja yang layak mendapat kemuliaan dan kedudukan tinggi. Khitab dalam ayat-ayat ini memang ditu'jukan kepada para istri nabi, namun wanita muslimah yang baik harus mencontoh apa yang dikerjakan oleh para istri nabi tersebut. 35. Allah menjanjikan ampunan dan balasan kebaikan kepada para istri nabi selama mereka taat kepada Allah dan rasul-Nya. Janji demikian juga diberikan kepada siapa pun, laki-laki maupun perempuan, yang beriman dan taat kepada Allah dan rasul-Nya. Sungguh, laki-laki dan perempuan muslim yang taat dan patuh kepada Allah, laki-laki dan perempuan mukmin dengan iman yang sungguh-sungguh, laki-laki dan perempuan yang tetap mantap dan ikhlas dalam ketaatannya, laki-laki dan perempuan yang benar dalam ucapan dan perbuatannya, laki-laki dan perempuan yang sabar dalam menjalankan perintah dan menjauhi larangan Allah serta sabar dalam menghadapi segala cobaan, laki-laki dan perempuan yang khusyuk dalam salat, laki-laki dan perempuan yang sering bersedekah untuk memperoleh rida Allah, laki-laki dan perempuan yang berpuasa wajib maupun sunah, laki-laki dan perempuan yang memelihara kehormatannya dari hal-hal yang Allah haramkan (lihat juga: al-Mu'min'n/23: 5'7), laki-laki dan perempuan yang banyak menyebut nama Allah; Allah telah menyediakan untuk mereka ampunan atas dosa mereka, dan pahala yang besar berupa surga. Mereka kekal di dalamnya. Ayat ini menjelaskan kesetaraan laki-laki dan perempuan di hadapan Allah dalam hal mendapat balasan amal perbuatan sesuai apa yang masing-masing individu kerjakan."
  }
]