[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya laki-laki maupun perempuan yang tunduk kepada perintah-perintah Allah, laki-laki maupun perempuan yang membenarkan, laki-laki maupun perempuan yang taat kepada Allah dan RasulNya, laki-laki maupun perempuan yang benar dalam kata-kata dan perbuatan mereka, laki-laki maupun perempuan yang sabar dalam menjauhi syahwat, sabar di atas ketaatan dan sabar menghadapi apa-apa yang tidak disukai, laki-laki maupun perempuan yang berpuasa wajib dan sunnah, laki-laki maupun perempuan yang menjaga kehormatannya dari zina dan mukadimahnya dan tidak membuka auratnya, laki-laki maupun perempuan yang banyak mengingat Allah dengan hati dan lisan mereka, Allah menyiapkan untuk mereka ampunan bagi dosa-dosa mereka dan pahala yang besar, yaitu surga."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "35. Sesungguhnya orang-orang yang menyerahkan diri kepada Allah dari kalangan lelaki dan wanita, orang-orang yang beriman kepada Allah dari kalangan lelaki dan wanita, orang-orang yang taat kepada Allah dari kalangan lelaki dan wanita, orang-orang yang jujur di dalam keimanan dan ucapan dari kalangan lelaki dan wanita, orang-orang yang bersabar di dalam menjalankan ketaatan, terhadap kemaksiatan dan atas cobaan dari kalangan lelaki dan wanita, orang-orang yang menyedekahkan sebagian harta mereka untuk yang wajib maupun yang sunah dari kalangan lelaki dan wanita, orang-orang yang berpuasa untuk Allah baik yang wajib maupun yang sunah dari kalangan lelaki dan wanita, orang-orang yang menjaga kemaluan mereka dengan menutupinya agar tidak terbuka di hadapan orang yang tidak halal untuk memandangnya, dan dengan menjauhkan diri dari kekejian perbuatan zina dan perbuatan yang menjerumuskan kepada zina dari kalangan lelaki dan wanita, orang-orang yang banyak mengingat Allah dengah hati dan lisan mereka baik dengan sembunyi-sembunyi maupun secara terang-terangan dari kalangan lelaki dan wanita, Allah telah menyiapkan bagi mereka ampunan-Nya atas dosa-dosa mereka dan menyiapkan bagi mereka pahala yang agung pada hari Kiamat, yaitu Surga."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "35. sungguh laki-laki dan perempuan yang menjalankan perintah Allah dan berserah diri kepada ketetapan dan ketentuan-Nya, laki-laki dan perempuan yang beriman kepada Allah dan para rasul-Nya, laki-laki dan perempuan yang taat dan senantiasa beribadah kepada Tuhan mereka, laki-laki dan perempuan yang bermuamalat dengan Allah dan manusia dengan jujur, laki-laki dan perempuan yang sabar dalam menjalankan ketaatan, menjauhi kemaksiatan, dan ridha terhadap ketetapan Allah, laki-laki dan perempuan yang takut kepada Tuhan mereka setiap saat dan khusyu dalam shalat dan berdoa, laki-laki dan perempuan yang bersedekah kepada fakir miskin, laki-laki dan perempuan yang berpuasa wajib dan sunnah, laki-laki dan perempuan yang menjaga kemaluan mereka dari dosa dan hal yang haram, laki-laki dan perempuan yang senantiasa banyak berzikir; orang-orang yang memiliki sifat-sifat mulia tersebut telah Allah siapkan bagi mereka ampunan terhadap dosa mereka dan surga yang mulia sebagai karunia bagi mereka dan balasan atas amalan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "35. إِنَّ الْمُسْلِمِينَ وَالْمُسْلِمٰتِ.... (Sesungguhnya laki-laki dan perempuan yang muslim…..) Berislam adalah dengan memasuki agama islam dan mentaatinya serta mengamalkannya. Kemudian Allah menyandingkan kata ‘muslimat’ sebagai penghormatan bagi mereka –begitu juga dengan kata-kata setelahnya— meskipun sebenarnya mereka telah masuk dalam cakupan kata ‘muslimin’ atau ‘mukminin’ dan seterusnya. Mukminin dan mukminat adalah mereka yang beriman kepada Allah, para malaikat, para Rasul, dan kitab-kitab-Nya, serta hari akhir dan takdir-Nya yang baik maupun yang buruk. Makna qanitin adalah hamba-hamba yang taat, pendapat lain mengatakan maknanya adalah orang-orang yang senantiasa melakukan ibadah dan ketaatan. Makna shadiqin adalah orang yang berbicara dengan kejujuran dan menjauhi kedustaan serta mnepati janji yang ia buat. Makna shabirin adalah orang yang bersabar dalam menjauhi berbagai syahwat dan dalam mengerjakan syariat agama. Makna khasyi’in adalah orang yang tunduk merendahkan diri kepada Allah dan patuh dalam beribadah kepada Allah. Makna mutashaddiq adalah orang yang menyedekahkan hartanya yang memang diwajibkan Allah atasnya atau dianjurkan baginya. Begitu pula makna sha’imin adalah orang yang berpuasa wajib maupun sunnah. Makna hafizhin furujahum adalah orang yang menjaga kemaluan mereka dari perbuatan haram dengan menjaga kehormatan dan mencukupkan diri dengan apa yang dihalalkan baginya. Dan makna zakirin adalah orang yang senantiasa berzikir kepada Allah disetiap waktu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "35. Sesungguhnya para pembangkang hukum dan perintah Allah, entah dari golongan laki-laki maupun perempuan. Beserta orang-orang yang meyakini rukun iman, baik beriman kepada Allah, malaikat-Nya, kitab-kitab-Nya, dan hari akhirat. Beserta orang-orang yang senantiasa melakukan ketaatan, jujur dalam perkataan dan perbuatan, sabar dalam ketaatan dan meninggalkan maksiat, merendahkan diri di hadapan Allah baik hati maupun anggota badan. Senantiasa bersedekah baik sedekah wajib maupun sunnah. Berpuasa wajib baik puasa Ramadan, puasa nadhar, kafarat atas sumpah, pembunuhan maupun dosa. Menjaga kemaluan dari yang diharamkan. Senantiasa mengingat asma Allah baik dengan hati maupun lisan, sirri maupun tampak. Dengan keutamaan Alquran, Allah telah menyediakan curahan ampunan atas dosa-dosa mereka, juga pahala yang besar atas ketaatan mereka, yaitu kenikmatan akhirat. Qanit adalah hamba yang senantiasa taat. Khasyi’ adalah yang senantiasa merendahkan diri di hadapan Allah karena takut dengan-Nya. Diriwayatkan dari Tirmidzi dari Ummu ‘Umarah Al anshariyah bahwa beliau mendatangi Nabi dan mengatakan: Aku tidak melihat sesuatu kecuali itu diperuntukkan untuk para laki-laki, dan aku tidak melihat para perempuan disebut sedikitpun. Sehingga turunlah ayat : Sesungguhnya para muslim laki-laki maupun perempuan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang muslim laki-laki dan perempuan, orang-orang mukmin laki-laki dan perempuan, laki-laki dan perempuan yang taat} laki-laki dan perempuan yang taat kepada Allah {laki-laki dan perempuan yang benar, laki-laki dan perempuan sabar, laki-laki dan perempuan yang khusyuk} laki-laki dan perempuan tunduk kepada Allah {laki-laki dan perempuan yang bersedekah, laki-laki dan perempuan yang berpuasa, laki-laki dan perempuan yang memelihara kemaluan mereka} dari zina dan hal-hal yang dekat dengannya, dan dari membuka aurat {laki-laki dan perempuan yang banyak menyebut (nama) Allah, bagi mereka Allah telah menyiapkan ampunan dan pahala yang besar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "35. Ketika Allah menjelaskan pahala bagi para istri Rasulullah dan hukuman mereka kalau mereka ditakdirkan tidak patuh, dan bahwa tidak seorang wanita pun yang dapat menandingi mereka, maka Allah menjelaskan wanita-wanita selain mereka. Dan ketika hukum (yang berkenaan dengan) mereka dan kaum laki-laki sama, maka Allah menjadikan hukum tersebut padu, seraya berfirman, “Sesungguhnya laki-laki dan perempuan yang Muslim,” dan ini dalam takaran syariat yang zhahir apabila mereka melaksanakannya, “laki-laki dan perempuan yang Mukmin,” dan ini dalam perkara-perkara yang batin, dari berbagai keyakinan hatii dan amal-amalnya, “laki-laki yang patuh” maksudnya, laki-laki yang taat kepada Allah dan rasulNya, “dan perempuan yang patuh, dan laki-laki yang jujur” dalam perkataan dan perbuatannya, “dan perempuan yang jujur, dan laki-laki yang sabar” dalam menghadapi berbagai kesulitan dan musibah, “dan perempuan yang sabar, laki-laki yang khusyu’” dalam seluruh keadaan mereka, terutama dalam ibadah-ibadah mereka, apalagi dalam mengerjakan shalat-shalat mereka “dan perempuan yang khusyu’, laki-laki yang bersedekah” yang wajib maupun yang sunnah, “dan perempuan yang bersedekah, laki-laki dan perempuan yang berpuasa” ini meliputi yang fardhu dan yang sunnah, “laki-laki yang memelihara kehormatan mereka” dari zina dan segala pengantarnya, “dan perempuan yang memelihara kehormatannya, laki-laki yang banyak menyebut Allah” yaitu pada mayoritas waktunya, terutama pada waktu-waktu wirid khusus, seperti dzikir pagi dan petang, dzikir seusai shalat lima waktu. “Dan perempuan yang berdzikir, Allah telah menyediakan untuk mereka,” maksudnya, untuk mereka yang bersifatlan sifat-sifat terpuji dan budi pekerti indah di atas, yang berkisar pada masalah-masalah keyakinan, amal-amal hati, amal perbuatan anggota badan, perkataan-perkataan lisan, dan manfaat yang mengalir dan yang tidak mengalir, dan yang berkisar pada amal-amal kebajikan dan meninggalkan keburukan, yang siapa saja mampu melakukannya, maka sungguuh dia telah melaksanakan ajaran agama seluruhnya, yang lahir dan yang batin dengan Islam, iman dan ikhsan. Maka dari itu Allah membalas mereka atas amal perbuatan mereka dengan ampunan terhadap dosa-dosa mereka, karena sesungguhnya amal-amal kebajikan itu dapat menghapus dosa-dosa. “Dan (menyediakan) pahala yang besar,” yang tidak bisa diukur nilainya kecuali yang telah diberikanNya, berupa segala sesuatu yang belum pernah dilihat oleh pandangan mata, tidak pula didengar oleh telingan dan tidak juga terlintas pada hati manusia. Semoga Allah menjadikan kita termasuk golongan mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahzab ayat 35: Ketahuilah wahai manusia bahwasanya orang-orang yang berserah diri baik laki-laki maupun perempuan dalam perintah-perintah Allah serta tidak mengingkarinya dan orang-orang yang beriman kepada Allah dan hari akhir serta perkara yang ghaib baik laki-laki maupun perempuan, dan mereka yang taat kepada Allah dan Rasul-Nya serta tetap di atas ketaatan tersebut baik laki-laki maupun perempuan, dan orang-orang yang jujur baik laki-laki maupun perempuan dalam niat, ucapan, dan perbuatan mereka, dan orang-orang yang bersabar baik laki-laki maupu perempuan di atas ketaatan dan maksiat serta atas takdir-takdir, musibah-musibah yang berat, dan orang-orang-orang yang tunduk baik laki-laki maupun perempuan yang mereka takut kepada Allah, dan orang-orang yang mensyukuri baik laki-laki maupun perempuan atas rezeki dari Allah yang diberikan kepada mereka dari harta yang wajib maupun selainnya, dan orang-orang yang berpuasa baik laki-laki dan perempuan baik puasa wajib maupun sunnah, dan orang-orang yang menjaga kemaluan dan yang diharamkan oleh Allah baik laki-laki maupun perempuan, dan orang-orang yang banyak mengingat Allah baik laki-laki maupun perempuan; Mereka semua dijanjikan oleh Allah ampunan dari dosa-dosa mereka dan dihapuskan dosa-dosa mereka, dan Allah juga menjanjikan akan memberi mereka pahala yang besar dengan memasukkan mereka ke dalam surga yang penuh kenikmatan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Tirmidzi meriwayatkan dengan sanadnya yang sampai kepada Ummu ‘Ammaarah, bahwa ia datang kepada Nabi shallallahu 'alaihi wa sallam dan berkata, “Aku tidak melihat segala sesuatu kecuali diperuntukkan bagi laki-laki, dan aku tidak melihat kaum wanita disebut-sebut dengan sesuatu, sampai turun ayat ini, “Innal muslimiina wal muslimaati wal mu’miniina wal mu’minaati…dst.” Tirmidzi berkata, “Hadits ini hasan gharib, dan hanya diketahui dari jalur ini.” Syaikh Muqbil berkata, “Hakim di juz 2 hal. 416 juga meriwayatkan dari hadits Ummu Salamah yang sama dengannya, dan ia berkata, “Shahih sesuai syarat dua syaikh (Bukhari-Muslim), namun keduanya tidak meriwayatkan, dan didiamkan oleh Adz Dzahabi, akan tetapi Mujahid (seorang rawi dalam hadits tersebut) seorang yang banyak melakukan kemursalan (memutuskan sanad) dari sahabat, sehingga tidak diketahui apakah ia mendengar hadits itu dari Ummu Salamah atau tidak. Saya menyebutkan haditsnya hanyalah sebagai syahid. Thabrani juga meriwayatkan dari hadits Ibnu Abbas yang semisal dengannya. Haitsami dalam Majma’uzzawaa’id juz 7 hal. 91 berkata, “Di dalam (sanad)nya terdapat Qabus, sedangkan dia dha’if, namun ada yang mentsiqahkan. Selanjutnya, saya melihat Al Haafizh Ibnu Katsir rahimahullah telah menyebutkan dua jalan yang lain bagi hadits Ummu Salamah dalam tafsirnya di juz 3 hal. 47, maka semoga Allah membalasnya dengan balasan yang sebaik-baiknya karena keinginannya yang kuat untuk mengumpulkan jalur-jalur hadits.” Dalam ta’liq (komentarnya) Syaikh Muqbil juga berkata, “Kemudian saya mendapatkan jalan-jalan yang lain bagi hadits itu, di antaranya adalah hadits yang diriwayatkan oleh Ishaq Al Busti dalam tafsirnya hal. 128, dan Nasa’i dalam tafsirnya (2/173).” Setelah Allah Subhaanahu wa Ta'aala menyebutkan pahala istri-istri Rasulullah shallallahu 'alaihi wa sallam, dan siksanya jika mereka mengerjakan perbuatan keji, dan bahwa tidak ada kaum wanita yang sama dengan mereka, maka Dia menyebutkan kaum wanita selain mereka. Oleh karena hukum mereka (kaum wanita) dan kaum lelaki adalah sama, maka Allah jadikan hukum-Nya mengena kepada semuanya. Yang dimaksud dengan muslim di sini ialah orang-orang yang melaksanakan syariat atau ajaran Islam yang zhahir (tampak), sedangkan yang dimaksud dengan orang-orang mukmin di sini ialah orang yang mengerjakan syariat Islam yang batin (tersembunyi), seperti ‘akidah di hati dan amal-amal saleh dari hati. Dalam ucapan dan perbuatannya. Terhadap kesulitan dan musibah. Dalam semua keadaan mereka, terutama dalam beribadah, dan terutama pula dalam shalat mereka. Yang wajib maupun yang sunat. Dari zina dan pengantarnya. Di sebagian besar waktunya, terutama pada waktu ada dzikr muqayyad (yang ditentukan kapan dibaca), seperti dzikr pagi dan petang dan dzikr setelah shalat. Yang disebutkan sifatnya, di mana perbuatan mereka berkisar antara ‘aqidah, amalan hati, amalan anggota badan, amalan lisan, memberikan manfaat baik kepada orang lain maupun kepada diri sendiri, antara perbuatan baik dan meninggalkan keburukan, di mana orang yang mengerjakan semua itu sama saja telah mengerjakan agama secara sempurna, lahir dan batinnya, dengan mengerjakan Islam, iman dan ihsan. Allah akan membalas mereka dengan ampunan terhadap dosa-dosa mereka, karena kebaikan dapat menghapuskan kejahatan, dan akan memberikan pahala yang besar, di mana tidak ada yang mampu mengukurnya kecuali Allah yang memberikannya, berupa kenikmatan yang belum pernah dilihat oleh mata, didengar oleh telinga dan terlintas di hati manusia. Kita meminta kepada Allah agar Dia memasukkan kita ke dalam golongan mereka ini, Allahumma aamin. Terhadap maksiat yang pernah mereka kerjakan. Terhadap ketaatan yang mereka lakukan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 35",
    "description": "Allah menjanjikan ampunan dan balasan kebaikan kepada para istri nabi selama mereka taat kepada Allah dan rasul-Nya. Janji demikian juga diberikan kepada siapa pun, laki-laki maupun perempuan, yang beriman dan taat kepada Allah dan rasul-Nya. Sungguh, laki-laki dan perempuan muslim yang taat dan patuh kepada Allah, laki-laki dan perempuan mukmin dengan iman yang sungguh-sungguh, laki-laki dan perempuan yang tetap mantap dan ikhlas dalam ketaatannya, laki-laki dan perempuan yang benar dalam ucapan dan perbuatannya, laki-laki dan perempuan yang sabar dalam menjalankan perintah dan menjauhi larangan Allah serta sabar dalam menghadapi segala cobaan, laki-laki dan perempuan yang khusyuk dalam salat, laki-laki dan perempuan yang sering bersedekah untuk memperoleh rida Allah, laki-laki dan perempuan yang berpuasa wajib maupun sunah, laki-laki dan perempuan yang memelihara kehormatannya dari hal-hal yang Allah haramkan (lihat juga: al-Mu'min'n/23: 5'7), laki-laki dan perempuan yang banyak menyebut nama Allah; Allah telah menyediakan untuk mereka ampunan atas dosa mereka, dan pahala yang besar berupa surga. Mereka kekal di dalamnya. Ayat ini menjelaskan kesetaraan laki-laki dan perempuan di hadapan Allah dalam hal mendapat balasan amal perbuatan sesuai apa yang masing-masing individu kerjakan. 36. Ketaatan orang-orang yang beriman kepada Allah tidak cukup dibuktikan dengan memiliki sepuluh sifat yang disebutkan dalam ayat-ayat sebelumnya. Ia harus pula tunduk kepada hukum-hukum yang Allah tetapkan. Dan tidaklah pantas bagi laki-laki yang mukmin dan perempuan yang mukmin, apabila Allah dan rasul-Nya telah menetapkan suatu ketetapan hukum, maka tidak akan ada pilihan hukum yang lain bagi mereka tentang urusan mereka. Mereka harus menaati hukum yang Allah dan rasul-Nya tetapkan. Dan barang siapa mendurhakai Allah dan rasul-Nya dengan menolak hukum-Nya, maka sungguh, dia telah tersesat dengan kesesatan yang nyata."
  }
]