[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidak patut bagi seorang Mukmin, laki-laki maupun perempuan, bila Allah dan RasulNya telah menetapkan suatu hokum diantara mereka untuk menyelisihinya dengan memilih selain apa yang ditetapkan oleh Allah dan RasulNya di antara mereka. Barangsiapa durhaka kepada Allah dan RasulNya, maka sungguh dia telah jauh dari jalan kebenaran dengan jauh yang jelas."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "36. Tidak dibolehkan bagi orang mukmin dan mukminah apabila Allah dan Rasul-Nya telah memutuskan untuk mereka suatu keputusan, untuk mempunyai pilihan lain antara menerima atau menolaknya. Dan barangsiapa bermaksiat kepada Allah dan Rasul-Nya maka ia telah sesat dari jalan yang lurus dengan kesesatan yang nyata."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "36. Tidak layak bagi laki-laki dan perempuan beriman untuk memilih hal lain jika Allah dan Rasulullah telah menetapkan bagi mereka suatu perkara. Yang harus mereka lakukan hanyalah berserah diri dan mentaati perintah Allah serta menerima ketetapan Allah dan Rasulullah. Dan barangsiapa yang menentang Allah dan Rasulullah dengan meninggalkan perintah atau melakukan larangan, maka dia sungguh telah jauh dari kebenaran dan petunjuk."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "36. وَمَا كَانَ لِمُؤْمِنٍ وَلَا مُؤْمِنَةٍ إِذَا قَضَى اللهُ وَرَسُولُهُۥٓ أَمْرًا أَن يَكُونَ لَهُمُ الْخِيَرَةُ مِنْ أَمْرِهِمْ ۗ (Dan tidaklah patut bagi laki-laki yang mukmin dan tidak (pula) bagi perempuan yang mukmin, apabila Allah dan Rasul-Nya telah menetapkan suatu ketetapan) Yakni tidak halal bagi orang yang beriman kepada Allah, jika Allah dan Rasulullah memerintahkan suatu perintah kemudian ia memilih perintah mana yang mau ia taati, dan seharusnya ia wajib melakukan apa yang diperintahkan kepadanya dan menyerahkan dirinya di bawah perintah Allah dan rasul-Nya. وَمَن يَعْصِ اللهَ وَرَسُولَهُۥ(Dan barangsiapa mendurhakai Allah dan Rasul-Nya) Dalam urusan apapun. فَقَدْ ضَلَّ ضَلٰلًا مُّبِينًا (maka sungguhlah dia telah sesat, sesat yang nyata) Yakni tersesat dari jalan yang benar secara jelas. Ayat ini diturunkan bagi Zainab binti Jahsy, putri dari paman Rasulullah. Suatu ketika Rasulullah berkata kepada Zainab: “Aku hendak menikahkanmu dengan Zaid bin Haritsah, sebab aku telah merelakannya bagimu.” Namun dia menjawab: “Wahai Rasulullah, tetapi aku tidak merelakannya untuk diriku, sedangkan aku adalah kerabat kaumku dan anak dari paman engkau, oleh sebab itu aku tidak akan menikahinya.” Maka turunlah ayat ini. Ia lalu berujar: “aku kini akan mentaatimu, maka perintahkanlah aku sesuai kehendakmu.” Maka Rasulullah menikahkannya dengan Zaid, dan Zaid akhirnya mengawininya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "36. Tidak layak, dan tidak pantas bagi orang yang beriman baik laki-laki maupun perempuan, apabila Allah dan rasul-Nya telah menetapkan sesuatu maka mereka meminta hak untuk menerima atau menolaknya. Sebagai pemuliaan terhadapa perintah Nabi, Allah telah menyebutkan bahwa apa yang menjadi ketetapan rasul-Nya adalah menjadi ketentuan Allah. Kewajiban mereka hanyalah menaati dan mengerjakan perintah, barangsiapa durhaka/membangkang atas perintah Allah dan rasul-Nya, maka dia telah tersesat dan menyimpang dari jalan kebenaran dan jalan hidayah secara jelas dan terang. Nabi pernah melamar Zainab binti Jahs untuk Zaid bin Haritsah setelah nabi memerdekakan Zaid. Kemudian ternyata Zainab menolak lamaran itu dengan mengatakan bahwa “Aku itu lebih baik dari dirinya secara keturunan.” Maka Allah menurunkan ayat ini, yang menjawab permasalahan nabi dan kemudian Zainab menerima lamaran Zaid. Di sini mengandung hukum meskipun kelihatannya secara umum, namun secara khusus maksud dari ayat ini adalah Zainab dan Zaid."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidaklah pantas} tidak pantas {bagi mukmin laki-laki dan perempuan, apabila Allah dan RasulNya telah menetapkan} memutuskan {suatu ketentuan, akan ada pilihan} pilihan {bagi mereka tentang urusan mereka. Siapa saja yang durhaka kepada Allah dan RasulNya, sungguh dia telah tersesat dengan kesesatan yang nyata} sangat jauh dari jalan yang lurus"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "36. Maksudnya, tidak pantas dan tidakk layak bagi orang yang berkarakterkan iman kecuali bergegas dalam mencari keridhaan Allah dan RasulNya, serta lari dari murka Allah dan RasulNya, mematuhi perintah keduanya dan menjauhi larangan keduanya. Maka sangat tidak pantas bagi seorang lelaki beriman dan tidak pula bagi perempuan beriman, “apabila Allah dan RasulNya telah menetapkan suatu ketetapan,” dari ketetapan-ketetapan, dan keduanya memastikan dan mewajibkannya, “akan ada bagi mereka pilihan yang lain tentang urusan mereka,” maksudnya, memilih pilihan (sendiri), apakah mereka mau mengerjakannya ataupun tidak? Bahkan seorang laki-laki dan perempuan yang beriman mengetahui bahwa Rasul itu harus diutamakan daripada dirinya sendiri. Maka dari itu jangan menjadikan sebagian hawa nafsu sebagai penghalang yang membatasi antara dia dengan perintah Allah dan rasulNya. “Dan barangsiapa mendurhakai Allah dan RasulNya, maka sungguhlah dia telah sesat dengan kesesatan yang nyata,” maksudnya, yang jelas sekali, karena sesungguhnya dia telah meninggalkan jalan yang lurus yang dapat mengantarkan kepada karamah Allah, beralih kepada jalan-jalan lain yang bisa menjerumuskan ke dalam siksa yang sangat perih. Maka Allah terlebih dahulu menjelaskan sebab yang dapat mengakibatkan tidak adanya sikap melawan perintah Allah dan RasulNya, yaitu iman, kemudian Dia menjelaskan pencegah (dari sikap melawan Allah), yaitu dengan cara menakut-nakuti mereka dengan kesesatan yang akan berakibat pada azab dan siksa."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahzab ayat 36: Allah mengabarkan bahwa tidak semestinya dan sepantasnya bagi seorang yang mengaku islam, yang diperintahkan oleh Allah dengan tauhid dan tunduk dengan ketaatan; Jika Allah dan Rasul-Nya perintahkan, (lebih) mendahulukan pendapatnya untuk menyelisihi perintah Allah dan Rasul-Nya, atau meninggalkan untuk dirinya dengan melakukan pilihanan untuk mengerjakan ataukah meninggalkan. Karena sebab sifat seorang yang beriman : tunduk dengan sempurna, berserah diri dengan sempurna; Dan barangsiapa yang menyelisihi Allah dan Rasul-Nya ﷺ dalam segala urusannya, maka dia akan tersesat dengan kesesatan yang nyata dan terang serta jauh dari jalan kebenaran."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sebagian ulama berpendapat, bahwa ayat ini turun berkenaan dengan Abdullah bin Jahsy dan saudarinya Zainab yang dilamarkan oleh Nabi shallallahu 'alaihi wa sallam untuk Zaid bin Haritsah, lalu keduanya tidak suka karena sebelumnya mereka mengira bahwa Nabi shallallahu 'alaihi wa sallam melamar Zainab adalah untuk dirinya sendiri, namun akhirnya keduanya ridha karena ayat tersebut. Ada pula yang berpendapat, bahwa ayat ini turun berkenaan dengan Ummu Kultsum binti ‘Uqbah bin Abi Mu’aith radhiyallahu 'anha, ia adalah wanita yang pertama berhijrah, yakni setelah perdamaian Hudaibiyah, lalu ia memberikan dirinya kepada Nabi shallallahu 'alaihi wa sallam, maka Beliau bersabda, “Aku terima,” maka Beliau menikahkannya dengan Zaid bin Haritsah radhiyallahu 'anhu, yakni –wallahu a’lam- setelah ia (Zaid) berpisah dengan Zainab, lalu ia dan saudaranya marah dan berkata, “Yang kami mau adalah Rasulullah shallallahu 'alaihi wa sallam, tetapi kami malah menikahkan kepada budaknya.” Maka turunlah ayat di atas. Yakni tidak pantas dan tidak layak bagi orang yang memiliki sifat iman selain segera melakukan perbuatan yang diridhai Allah dan Rasul-Nya, menjauh dari kemurkaan Allah dan Rasul-Nya, mengerjakan perintah dan menjauhi larangan. Tidak pantas bagi mereka memiliki pilihan lain, bahkan seorang mukmin laki-laki maupun perempuan tentu mengetahui, bahwa Rasulullah shallallahu 'alaihi wa sallam lebih utama bagi mereka daripada diri mereka sendiri. Oleh karena itu, jangan sampai sebagian hawa nafsu mereka menghalanginya menjalankan perintah Allah dan Rasul-Nya. Karena dia telah meninggalkan jalan yang lurus yang menghubungkan kepada surga, sedangkan jalan-jalan yang lain malah menghubungkannya ke neraka. Oleh karena itulah di bagian awal ayat ini disebutkan sebab yang mengharuskan mereka tidak menentang perintah Allah dan Rasul-Nya, yaitu iman, dan di bagian akhirnya, Dia menyebutkan penghalangnya, yaitu ancaman sesat yang menunjukkan akan memperoleh siksa dan hukuman."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 36",
    "description": "Ketaatan orang-orang yang beriman kepada Allah tidak cukup dibuktikan dengan memiliki sepuluh sifat yang disebutkan dalam ayat-ayat sebelumnya. Ia harus pula tunduk kepada hukum-hukum yang Allah tetapkan. Dan tidaklah pantas bagi laki-laki yang mukmin dan perempuan yang mukmin, apabila Allah dan rasul-Nya telah menetapkan suatu ketetapan hukum, maka tidak akan ada pilihan hukum yang lain bagi mereka tentang urusan mereka. Mereka harus menaati hukum yang Allah dan rasul-Nya tetapkan. Dan barang siapa mendurhakai Allah dan rasul-Nya dengan menolak hukum-Nya, maka sungguh, dia telah tersesat dengan kesesatan yang nyata. 37. Dan ingatlah, ketika engkau, wahai nabi Muhammad, beberapa kali berkata kepada orang, yakni zaid bin ''ri'ah, yang telah diberi nikmat oleh Allah dengan memeluk agama islam dan engkau juga telah memberi nikmat kepadanya dengan memerdekakannya dan mengangkatnya menjadi anak, 'pertahankanlah terus istrimu, zainab binti ja'sy! jangan kau ceraikan ia, dan bertakwalah kepada Allah dengan bersabar menjalani pernikahanmu meski istrimu kurang menghormati'mu'."
  }
]