[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "dan ketika kamu (wahai nabi) berkata kepada orang yang Allah beri nikmat Islam kepadanya, (yaitu Zaid bin Haritsah yang dimerdekakan oleh Nabi dan pernah di angkat sebagai anak olehnya) dan kamu memberi nikmat kemerdekaan kepadanya, “Biarkan istrimu, Zainab binti Jahsy, dalam ikatan pernikahanmu dan jangan mentalaknya dan bertakwalah kepada Allah wahai Zaid.” Dan kamu menyembunyikan dalam hatimu (wahai Nabi) apa yang Allah wahyukan kepadamu, yaitu talak Zaid terhadap istrinya dan menikahkanmu dengan mantan istrinya tersebut, dan Allah menampakkan apa yang kamu sembunyikan, kamu takut orang-orang munafik akan berkata, “Muhammad menikahi mantan istri anak angkat nya.” Padahal Allah lebih patut untuk kamu takuti. Maka ketika Zaid sudah menunaikan hajatnya darinya dan mentalaknya, kemudian istrinya telah menyelesaikan masa iddahnya, Kami menikahkanmu dengannya, agar kamu menjadi teladan dalam membatalkan adat larangan menikah dengan mantan istri anak angkat setelah terjadi talak. Orang-orang Mukmin tidak berdosa untuk menikahi wanita-wanita yang sudah ditalak oleh suami-suami mereka, bila suami-suami mereka sudah menunaikan hajat mereka dari mereka, sekalipun suami-suami tersebut adalah anak angkat mereka. Ketetapan Allah pasti terlaksana tanpa penghalang dan penolak. Pengangkatan anak sendiri adalah adat jahiliyah yang dibatalkan oleh firman Allah: ادْعُوهُمْ لِآبَائِهِمْ “Panggilah mereka (anak-anak angkat itu) dengan (memakai) nama bapak-bapak mereka” (QS Al-Ahzab : 5)"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "37. Dan ingatlah -wahai Rasul- tatkala kamu berkata kepada orang yang telah Allah beri karunia kepadanya berupa kenikmatan Islam dan engkau beri karunia padanya berupa kenikmatan kebebasan dari perbudakan -maksudnya adalah Zaid bin Hāriṡah -raḍiyallāhu 'anhumā- tatkala dia mendatangimu untuk meminta pendapatmu dalam urusan talak istrinya, Zainab binti Jaḥsy -raḍiyallāhu 'anhā-, engkau berkata kepadanya, “Tetap peganglah istrimu dan janganlah engkau menceraikannya serta bertakwalah kepada Allah dengan menjalankan segala perintah-Nya dan menjauhi segala larangan-Nya.” Dan engkau -wahai Rasul- menyembunyikan di dalam dirimu apa yang Allah wahyukan kepadamu bahwa kamu akan menikahi Zainab, karena kamu takut terhadap manusia, padahal Allah akan menampakkan perceraian Zaid dengan istrinya dan dan pernikahanmu dengannya. Dan Allah lebih utama untuk engkau takuti dalam urusan ini. Maka tatkala jiwa Zaid sudah merasa tenang dan dia tidak lagi mencintai istrinya itu kemudian dia mentalaknya, maka Kami menikahkanmu Muhammad dengan wanita itu, agar tidak ada halangan di kalangan orang-orang yang beriman untuk menikahi istri dari anak-anak angkat mereka apabila sudah diceraikan dan habis masa idahnya. Dan sesungguhnya perintah Allah pasti terjadi, tidak ada yang bisa mencegahnya dan tidak ada yang bisa menghalanginya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "37. Hai Rasulullah, ingatlah ketika kamu berkata kepada orang yang telah Allah berikan kepadanya kenikmatan Islam, dan telah kamu berikan kepadanya kasih sayang, kebebasan dari perbudakan, dan kebaikan lainnya; yaitu kepada Zaid bin Haritsah: “Pertahankanlah istrimu dengan baik, dan bertakwalah kepada Allah dalam memperlakukannya dengan tidak menzaliminya meskipun kamu sedang marah kepadanya; sebab keadilan wajib dilakukan dalam keadaan senang maupun marah.” Sedangkan kamu menyembunyikan perkara yang Allah tampakkan kepadamu berupa perceraian Zaid dari Zainab, kemudian kamu akan menikahinya; itulah yang Allah tampakkan kepadamu. Kamu takut terhadap ucapan manusia, sedangkan Allah lebih berhak untuk kamu takuti. Dan ketakutan ini merupakan bentuk kasih sayangmu kepada mereka. Ketika itu Allah telah menyampaikan kepada Rasulullah bahwa Zaid akan menceraikan Zainab, kemudian Zainab akan dinikahi Rasulullah yang dalam pernikahan itu terdapat hikmah besar berupa penghapusan adat masyarakat waktu itu yang mengharamkan mantan istri anak angkat untuk dinikahi. Saat Zaid telah menceraikan Zainab dengan pilihannya sendiri dan tidak ada lagi rasa cinta kepada istrinya itu dan rasa sedih dengan perpisahannya, maka Kami menikahkanmu dengan Zainab, agar tidak ada lagi rasa berdosa atau kecanggungan untuk menikahi wanita yang dulunya adalah istri anak angkat. Dan ketetapan Allah pasti akan terlaksana, tidak ada yang dapat menolak ketetapan-Nya dan tidak ada yang dapat mengubah hukum-Nya. Pernikahan Zaid dengan Zainab kemudian dia menceraikannya lalu Rasulullah menikahinya adalah ketetapan dari Allah Yang Maha Bijaksana dan Maha Mengetahui."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "37. وَإِذْ تَقُولُ لِلَّذِىٓ أَنْعَمَ اللهُ عَلَيْهِ وَأَنْعَمْتَ عَلَيْهِ (Dan (ingatlah), ketika kamu berkata kepada orang yang Allah telah melimpahkan nikmat kepadanya dan kamu (juga) telah memberi nikmat kepadanya) Yang dimaksud adalah Zaid bin Haritsah, Allah telah memberinya kenikmatan Islam, dan Rasulullah memberinya nikmat pembebasannya dari perbudakan, karena dulu ia adalah termasuk budak pada masa jahiliyah. Rasulullah membelinya pada masa jahiliyah kemudian memerdekakannya dan menjadikannya sebagai anak angkat, dan Beliau juga menikahkannya dengan wanita dari suku Quraisy yaitu Zainab binti Jahsy, putri dari paman beliau. أَمْسِكْ عَلَيْكَ زَوْجَكَ(Tahanlah terus isterimu) Yakni Zainab. وَاتَّقِ اللهَ(dan bertakwalah kepada Allah) Yakni bertakwalah dalam urusan istrimu dan jangan terburu-buru untuk mencerainya. وَتُخْفِى(sedang kamu menyembunyikan) Wahai Muhammad. فِى نَفْسِكَ مَا اللهُ مُبْدِيهِ(di dalam hatimu apa yang Allah akan menyatakannya) Yakni urusan menikahi Zainab setalah ia diceraikan oleh Zaid. Allah telah mewahyukan kepadanya bahwa Zaid akan mencerai istrinya, dan kamu akan menikahinya setelah itu untuk menghilangkan adat pengangkatan anak dan akibat-akibatnya. وَتَخْشَى النَّاسَ(dan kamu takut kepada manusia) Yakni malu terhadap mereka atau takut cemoohan mereka yang mengatakan ‘dia memerintahkan maulanya untuk menceraikan istrinya, lalu dia sendiri menikahi wanita itu.’ وَاللهُ أَحَقُّ أَن تَخْشَىٰهُ ۖ(sedang Allah-lah yang lebih berhak untuk kamu takuti) Dan merasa malu terhadap-Nya pada setiap keadaan. فَلَمَّا قَضَىٰ زَيْدٌ مِّنْهَا وَطَرًا(Maka tatkala Zaid telah mengakhiri keperluan terhadap istrinya (menceraikannya)) Yakni menyelesaikan keperluannya dengan menikahinya dan mengawininya kemudian menceraikannya sehingga tidak ada lagi keperluannya terhadap istrinya itu. زَوَّجْنٰكَهَا(Kami kawinkan kamu dengan dia) Setelah Allah mengabarkan beliau hal itu maka itu menjadi pernikahan yang disahkan Allah bagi beliau. Oleh sebab itu, beliau memasukinya tanpa harus meminta izin, mengucapkan akad, mengukur mahar, atau hal lainnya yang menjadi hal lazim yang harus dilakukan oleh umatnya dalam pernikahan. Dan terdapat banyak hadits shahih yang menyatakan hal ini. لِكَىْ لَا يَكُونَ عَلَى الْمُؤْمِنِينَ حَرَجٌ(supaya tidak ada keberatan bagi orang mukmin) Yakni merasa berat dan sempit dada. فِىٓ أَزْوٰجِ أَدْعِيَآئِهِمْ(untuk (mengawini) isteri-isteri anak-anak angkat mereka) Yakni dalam menikahi istri-istri orang yang mereka jadikan sebagai anak angkat, sebagaimana yang dilakukan orang-orang Arab pada masa lalu, dan yang mereka yakini haramnya menikahi bekas istri anak angkat mereka seperti keharaman bekas istri anak kandung mereka. Maka Allah mengabarkan dalam ayat ini bahwa bekas istri anak angkat halal untuk mereka nikahi. إِذَا قَضَوْا۟ مِنْهُنَّ وَطَرًا ۚ(apabila anak-anak angkat itu telah menyelesaikan keperluannya daripada isterinya) Berbeda dengan anak-anak kandung, istri mereka haram bagi bapak mereka setelah terjadinya akad pernikahan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "37. Ingatlah wahai Nabi, ketika engkau berkata kepada Zaid bin Haritsah yang telah Allah anugerahkan nikmat Islam. Juga telah Allah anugerahkan nikmat merdeka dari perbudakan dan mendapat pendidikan yang baik. Nabi berkata: “Pegang eratlah istrimu Zainab di sisimu (pertahankanlah). Takutlah kepada Allah, jangan sampai engkau menceraikannya. Kamu menyembunyikan sesuatu yang akan Allah tampakkan. Hal itu adalah perintah Allah kepada Nabi untuk menikahi Zainab setelah dia diceraikan oleh Zaid, dan sudah habis masa iddahnya. “Engkau, Muhammad, takut mengungkapkannya kepada manusia, takut jika mereka berkata: “Muhammad telah menikahi bekas istri putera angkatnya (Zaid bin Harisah).” Sungguh, benar-benar hanya Allah-lah yang paling berhak untuk engkau takuti atas segala apapun dan Yang paling berhak untuk engkau malu kepada-Nya. Adapun setelah Zaid menceraikan istrinya setelah menikahinya, dan Zaid juga sudah tidak menghendaki Zainab sebagai istrinya setelah mereka berdua bertengkar. Maka Kami jadikan Zainab sebagai istrimu. Sehingga orang mukmin tidak menganggap bahwa menikahi bekas istri anak angkatnya itu dosa, padahal tidak dosa. Dengan syarat apabila suami mereka sudah tidak menginginkan mereka kembali dan sudah habis masa iddah. Ketetapan Allah itu pasti terjadi. Sahabat Anas radliyallahu ‘anhu berkata: “Ayat ini turun untuk Zainab binti Jahsy dan Zaid bin Haritsah.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{(Ingatlah) ketika kamu berkata kepada orang yang telah diberi nikmat oleh Allah} dengan Islam {dan kamu telah memberi nikmat kepadanya} dengan pembebasan dan diangkat anak, yaitu Zaid bin Haritsah RA {“Pertahankan istrimu dan bertakwalah kepada Allah” dan kamu menyembunyikan di dalam dirimu apa yang akan dinyatakan oleh Allah} dan menyembunyikan dalam dirimu sesuatu yang diberitahukan kepadamu berupa talaqnya zait terhadap istrinya, dan pernikahanmu dengannya {dan kamu takut kepada manusia} dan kamu takut berbicara kepada orang-orang bahwa Muhammad telah menikahi (mantan) istri anak (angkatnya) {padahal Allah lebih berhak untuk kamu takuti. Maka ketika Zaid telah mengakhiri keperluan terhadap istrinya} maka ketika Zaid telah memenuhi keperluannya pernikahan untuk istrinya dan telah menalaknya {Kami menikahkanmu dengannya} Kami menjadikannya istrimu tanpa melalui perantara {agar tidak ada keberatan} kesalahan {bagi orang-orang mukmin untuk (menikahi) istri-istri anak-anak angkat mereka} menikahi istri-istri anak-anak angkat mereka {apabila mereka telah menyelesaikan keperluan terhadap istri-istrinya} keperluan setelah menalaknya dan telah usai masa iddahnya {dan ketetapan Allah itu pasti terjadi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "37. Latar belakang turunnya ayat-ayat ini adalah bahwa Allah berkehendak menetapkan suatu syariat (aturan) umum bagi orang-orang Mukmin, yaitu bahwa anak-anak angkat itu bukan dalam status hukum anak kandung hakiki (dilihat) dari segala sudut pandang, dan bahwa istri-istri mereka tidak apa-apa kalau dinikahi oleh orang yang menjadikan merekka anak angkat. Permasalahan ini termasuk perkara yang telah menjadi adat (mengakar) kuat yang hampir tidak bisa dihilangkan kecuali dengan suatu peristiwa yang sangat besar. Oleh karenanya Allah menghendaki kalau ketetapan hukum syariat ini terwujud daam bentuk perkataan Rasulullah dan praktiknya. Apabila Allah menghendaki suatu ketetapan, maka Dia menjadikan sebab kausalitasnya. Tadinya Zaid bin Haritsah dianggil Zaid bin Muhammad. Nabi telah menjadikannya sebagai anak angkat sehingga dia dipanggil dengan sebutan “bin Muhammad” hingga turun perintah “panggillah mereka dengan menyebut nama bapak mereka,” maka semenjak itu dia disebut: Zaid bin Haritsah. Dan pada saat itu dia bersitrikan Zainab binti Jahsy, anak dari bibi Rasulullah, dan sebelum itu sudah terlintas dalam hati Nabi kalau Zainab diceraikan oleh Zaid, maka beliau akan menikahinya. Allah pun menakdirkan sesuatu hal yang terjadi antara zaid dengan istrinya itu yang memaksanya datang kepada Nabi untuk memnta izin untuk menceraikannya. Allah berfirman, “Dan ketika kamu berkata kepada orang yang Allah telah melimpahkan nikmat kepadanya,” maksudnya, dengan nikmat Islam, “dan kamu juga telah memberi nikmat kepadanya,” yaitu dengan memerdekakannya, membimbingnya dengan mengajarkan ilmu kepadanya, ketika dia datang kepadamu untuk minta pendapat tentang rencananya akan menceraikan istrinya. Lalu kamu katakan kepadanya seraya menasehatinya dan memberi tahu padanya tentang kemaslahatnnya, dengan lebih mengutamakannya atas keinginanmu, sekalipun hal itu terbesit dalam hatimu, “Tahanlah terus istrimu,” maksudnya, jangan kamu menceraikannya dan bersabarlah atas apa yang kamu rasakan darinya. “Dan bertakwalah kepada Allah,” dalam seluruh urusanmu secara umum, dan dalam urusan istrimu secara khusus, karena takwa itu mendorong pada kesabaran dan memerintahkannya, “sedang kamu menyembunyikan di dalam hatimu sesuatu yang Allah akan menyatakannya,” yang beliau sembunyikan adalah kalau Zaid menceraikannya, maka Nabi pasti akan menikahinya, “dan kamu takut kepada manusia” dalam tindakanmu tidak membuka sesuatu yang tersimpan di dalam hatimu, “padahal Allah-lah yang lebih berhak untuk kamu takuti,” karena takut kepadaNya itu bisa mendatangkan berbagai kebaikan dan mencegah segala keburukan. “Maka tatkala Zaid telah mengakhiri keperluan terhadap istrinya” maksudnya, setelah jiwanya merasa lega dan sudah tidak menyukai lagi serta menceraikannya, “Kami kawinkan kamu dengannya.” Sesungguhnya Kami melakukan hal ini hanyalah untuk satu kemaslahatan yang sangat besar, yaitu: “supaya tidak ada keberatan bagi orang Mukmin untuk mengawini istri-istri dari anak-anak angkat mereka,” di mana mereka melihatmu menikahi istri Zaid bin Haritsah yang sebelumnya dinisbatkan kepadamu. Oleh karena FirmanNya, “Supaya tidak ada keberatan bagi orang Mukmin untuk mengawini istri-istri dari anak- anak angkat mereka,” bersifat umum, berlaku dalam semua keadaan, sedangkan ada kondisi di mana tidak boleh melakukan hal tersebut, yaitu sebelum habisnya kebutuhan Zaid kepada istrinya, maka Allah mengaitkannya dengan FirmanNya, “Apabila anak-anak angkat itu telah menyelesaikan keperluannya dari istrinya. Dan ketetapan Allah itu pasti terjadi.” Maksudnya, harus dilakukan, tidak ada aral dan tidak ada apa pun yang mencegahnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahzab ayat 37: Ingatlah wahai Nabi Allah pada hari yang engkau berkata kepada orang yang Allah telah beri nikmat atasnya berupa keimanan, dan engkau juga telah memberi nikmat kepadanya dengan membebaskannya, dia adalah Zaid bin Haritsah; Dima dahulu dia adalah budak yang kemudian dimerdekakan oleh Nabi ﷺ, kemudia oleh ﷺ diangkat menjadi anak sebelum ada larangan mengangkat anak angkat, dimana engkau berkata kepadanya : Tahanlah istrimu Zainab binti Jahsy , jangan engkau talak dia, bertakwalah engkau Zaid kepada Allah, bersabarlah atas hakmu. Sedangkan engkau (Muhammad) juga menyembunyikan pada dirimu apa yang sebenarnya telah Allah wahyukan kepadamu atas perceraian zaid kepada istrinya dan engkau (Allah telah wahyukan) untuk menikahinya. Ketahuilah bahwa Allah akan menampakkannya apa yang telah engkau sembunyikan, dan Kami mengetahui engkau (Muhammad) melakukan demikian karena sebab menjaga agar tidak nampak kepada orang-orang bodoh dari munafik dan mereka berkata : Muhammad telah menikahi mantan istri anak angkatnya. Sungguh Allah yang paling berhak untuk ditakuti dari selain-Nya. Ini adalah ketakutan yang manusiawi, karena sebab manusia tidak menginginkan digunjing dengan perkataan ini dan itu (tanpa sumber); Maka ketika zaid selesai kebutuhannya dengan istrinya, dia menceraikannya dan berlakulah iddah baginya, kemudian kami jadikan dia sebagai istrimu wahai Muhammad; Agar tidak menjadikan bagi seorang yang beriman kesempitan dan kesulitan dan dosa atas pernikahan dengan mantan istri dari anak angkatnya setelah ditalaknya setelah selesai hajjatnya dan menyelesaikan masa iddahnya. Dan engkaulah qudwah bagi mereka dalam membatalkan tradisi. Dan apa yang telah Allah tetapkan tidak ada yang dapat menolaknya. Tidak diragukan atas kisah Zaid bin Haritsah adalah sebagai pembatalan dari anak angkat yang popular dan sebagai tradisi jahiliyyah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan menjadikannya muslim. Dengan memerdekakannya. Orang ini adalah Zaid bin Haritsah radhiyallahu 'anhu. Dia pada awalnya adalah seorang tawanan di zaman jahiliyah, lalu Rasulullah shallallahu 'alaihi wa sallam membelinya sebelum Beliau diangkat menjadi Nabi, kemudian Beliau memerdekakannya dan menjadikannya sebagai anak angkat yang kemudian dihapus. Suatu ketika Zaid datang kepada Rasulullah shallallahu 'alaihi wa sallam meminta pendapat Beliau tentang sikapnya ingin menceraikan istrinya, yaitu Zainab binti Jahsy. Maka Beliau menjawab dengan jawaban seperti yang disebutkan dalam ayat di atas. Yakni jangan engkau menceraikannya, dan bersabarlah terhadap perbuatan yang muncul darinya. Dalam semua masalahmu dan dalam masalah istrimu, karena takwa mendorong untuk bersabar dan memerintahkannya. Imam Bukhari meriwayatkan dengan sanadnya yang sampai kepada Anas bin Malik radhiyallahu 'anhu, bahwa ayat ini, “Sedang engkau menyembunyikan di dalam hatimu apa yang akan dinyatakan oleh Allah,” turun berkenaan dengan Zainab binti Jahsy dan Zaid bin Haritsah. Imam Qurthubi dalam tafsirnya berkata, \"Orang-orang (para ulama) berselisih tentang tafsir ayat ini. Qatadah, Ibnu Zaid, dan jamaah para mufassir, di antaranya Thabari dan yang lain berpendapat, bahwa Nabi shallallahu 'alaihi wa sallam terlintas dalam dirinya kecantikan Zainab binti Jahsy, sedangkan ketika itu ia istri Zaid. Beliau ingin sekali jika Zaid menalaknya, lalu Beliau menikahinya…dst.” Selanjutnya Imam Qurthubi berkata, “Inilah yang disembunyikan Beliau dalam hatinya, akan tetapi Beliau wajib melakukan amr ma’ruf, yaitu dalam kata-kata Beliau, \"Pertahankanlah terus istrimu dan bertakwalah kepada Allah,” Namun pendapat ini dibantah oleh Syaikh Asy Syinqithi, bahwa pendapat ini tidak benar dan tidak layak bagi Beliau shallallahu 'alaihi wa sallam. Imam Qurthubi juga menukil serupa dengan itu dari Muqatil dan Ibnu Abbas, dan ia juga menyebutkan dari Ali bin Al Husain, bahwa Allah mewahyukan kepada Nabi-Nya shallallahu 'alaihi wa sallam, bahwa Zaid nanti akan menalak Zainab, dan Allah akan menikahkan ia dengan Rasul-Nya shallallahu 'alaihi wa sallam. Setelah Beliau mengetahui hal ini berdasarkan wahyu, Beliau berkata kepada Zaid, “Pertahankanlah terus istrimu dan bertakwalah kepada Allah.” Yang Beliau sembunyikan dalam hatinya adalah bahwa Allah akan menikahkan Beliau dengan Zainab radhiyallahu 'anha. Setelah menyebutkan pendapat ini, Imam Qurthubi berkata, “Para ulama kami rahmatullah ‘alaihim berkata, “Pendapat ini adalah pendapat yang paling baik tentang tafsir ayat ini, dan inilah yang dipegang oleh para peneliti dari kalangan mufassir, para ulama yang dalam ilmunya, seperti Az Zuhri, Al Qadhi Bakar bin Al ‘Alaa Al Qusyairiy, Al Qadhi Abu Bakar ibnul ‘Arabi dan lain-lain…dst.” Sampai ia (Imam Qurthubi) berkata, “Adapun riwayat bahwa Nabi shallallahu 'alaihi wa sallam berkeinginan kepada Zainab istri Zaid, bahkan terkadang keluar kata-kata canda yang kurang malu seperti ungkapan rindu, maka ini hanyalah berasal dari orang yang bodoh terhadap kemaksuman Nabi shallallahu 'alaihi wa sallam dari hal seperti ini atau orang yang kurang memuliakan kehormatan Beliau.” At Tirmidziy Al Hakiim dalam Nawaadirul Ushul, -dan ia menyandarkan perkataannya kepada Ali bin Al Husain- berkata, “Ali bin Al Husain datang membawa (berita) ini dari perbendaharaan ilmu sebagai salah satu permata dan salah satu mutiara di antara sekian permata dan mutiara, bahwa Allah hanyalah menegurnya dalam masalah yang telah Dia beritahukan kepadanya, bahwa ia (Zainab) akan menjadi salah satu istrinya, lalu mengapa Beliau berkata seelah itu kepada Zaid, “Tahanlah istrimu,” dan Beliau takut jika orang-orang akan berkata, “Beliau menikahi istri anaknya,” padahal Allah lebih berhak untuk ditakuti.” Ibnu Katsir dalam menafsirkan ayat tersebut berkata, “Ibnu Abi Hatim dan Ibnu Jarir menyebutkan di sini beberapa atsar dari sebagian salaf radhiyallahu 'anhum yang kami sangat senang sekali berpaling darinya karena tidak sahih, sehingga kami tidak sebutkan sampai akhirnya,” dan di sana terdapat ucapan Ali bin Al Husain yang telah kita sebutkan di sini. Syaikh Asy Syinqithi berkata, “Yang benar dalam masalah ini insya Allah adalah apa yang kami sebutkan, di mana Al Qur’an menunjukkan demikian, yaitu bahwa Allah memberitahukan kepada Nabi-Nya shallallahu 'alaihi wa sallam, bahwa Zaid akan menalak Zainab dan bahwa Dia akan menikahkan Zainab dengan Beliau shallallahu 'alaihi wa sallam, namun ketika itu Zainab sebagai istri Zaid. Ketika Zaid mengeluhkan tentang Zainab kepada Beliau shallallahu 'alaihi wa sallam, Beliau malah berkata kepadanya, “Tahanlah dirimu dan bertakwalah kepada Allah, “ maka Allah menegurnya karena ucapannya itu, yaitu, “Tahanlah istrimu,” setelah Beliau mengetahui bahwa Zainab akan menjadi istrinya shallallahu 'alaihi wa sallam, dan Beliau takut orang-orang berkata, bahwa Beliau ingin menikahi istri anaknya di waktu Zainab sebagai istri Zaid, jika Beliau menampakkan apa yang Beliau ketahui yaitu pernikahan Beliau dengan Zainab. Dalil terhadap hal ini ada dua: pertama, apa yang kami kemukakan, bahwa Allah Jalla wa ‘Alaa berfirman, “Sedang engkau menyembunyikan di dalam hatimu apa yang akan dinyatakan oleh Allah,” inilah yang dinyatakan Allah Jalla wa ‘Alaa, yaitu pernikahan Beliau dengan Zainab dalam firman-Nya, “Maka ketika Zaid telah mengakhiri keperluan terhadap istrinya (menceraikannya), Kami nikahkan engkau dengan dia,” Allah Subhaanahu wa Ta'aala tidak menampakkan sedikit pun apa yang mereka sangka, yaitu bahwa Beliau mencintainya. Jika itu maksudnya, tentu Allah akan menampakkannya sebagaimana yang anda ketahui. Kedua, Allah Jalla wa ‘Alaa menegaskan, bahwa Dia yang menikahkah Beliau dengan Zainab, dan bahwa hikmah ilahi dalam pernikahan itu adalah untuk menghilangkan keharaman menikahi istri anak angkat dalam firman Allah Ta’ala, “Maka ketika Zaid telah mengakhiri keperluan terhadap istrinya (menceraikannya), Kami nikahkan engkau dengan dia (Zainab) agar tidak ada keberatan bagi orang mukmin untuk (menikahi) istri-istri anak-anak angkat mereka,” firman-Nya, “agar tidak ada keberatan bagi orang mukmin untuk (menikahi) istri-istri anak-anak angkat mereka,” merupakan sebab yang jelas menikahnya Beliau dengan Zainab sebagaimana kami sebutkan, dan karena Allah yang menikahkannya untuk hikmah ilahi ini, maka jelas sekali bahwa sebab pernikahan Beliau kepadanya bukan karena cinta kepadanya yang menjadi sebab Zaid menalaknya sebagaimana yang mereka sangka. Hal ini diperjelas oleh firman Allah Ta’ala, “Maka ketika Zaid telah mengakhiri keperluan terhadap istrinya (menceraikannya)…dst.” Yang menunjukkan bahwa Zaid telah mengakhiri keperluan kepadanya dan tidak butuh lagi, maka ia menalaknya dengan pilihannya, dan yang tahu adalah Allah Ta’ala.” Nanti mereka akan mengatakan, “Beliau menikahi istri anaknya.” Padahal Allah Subhaanahu wa Ta'aala hendak menetapkan syariat yang umum bagi kaum mukmin, bahwa anak angkat bukanlah anak hakiki dari segala sisi, dan bahwa istrinya tidak mengapa dinikahi oleh ayah angkatnya setelah ditalak dan habis masa iddahnya. Dalam segala sesuatu, sehingga tidak perlu mempedulikan kata-kata mereka. Ibnu Sa’ad di juz 8 qaf 1 hal. 73 meriwayatkan dengan sanadnya yang sampai kepada Hammad bin Zaid bin Tsabit dari Anas, ia berkata: Turun ayat berkenaan dengan Zainab binti Jahsy, “Maka ketika Zaid telah mengakhiri keperluan terhadap istrinya (menceraikannya), Kami nikahkan engkau dengan dia,” Anas juga berkata, “Oleh karena itu, Zainab berbangga-bangga di hadapan istri-istri Nabi shallallahu 'alaihi wa sallam dengan mengatakan, “Yang menikahkan kamu semua adalah keluargamu, sedangkan yang menikahkan aku adalah Allah dari atas langit yang tujuh.” (Para perawinya adalah para perawi hadits shahih). Ibnu Sa’ad juga meriwayatkan dengan sanadnya yang sampai kepada Tsabit dari Anas bin Malik ia berkata: Ketika masa iddah Zainab binti Jahsy habis, Rasulullah shallallahu 'alaihi wa sallam bersabda kepada Zaid bin Haritsah, “Aku tidak mendapatkan orang yang paling amanah dan terpercaya bagi diriku daripada engkau. Datangilah Zainab dan lamarkanlah dia untukku.” Anas berkata, “Maka Zaid pergi mendatanginya, dan ketika itu ia sedang meragikan rotinya. (Zaid berkata),” Saat aku melihatnya ia tampak besar (terhormat) dalam hatiku, aku tidak sanggup melihatnya ketika aku tahu bahwa Rasulullah shallallahu 'alaihi wa sallam telah menyebu-nyebut tentangnya, maka aku palingkan punggungku dan aku berbalik ke belakang serta berkata, “Wahai Zainab! Bergembiralah, sesungguhnya Rasulullah shallallahu 'alaihi wa sallam telah menyebut dirimu.” Ia pun berkata, “Aku tidak melakukan apa-apa, sampai aku meminta pilihan kepada Allah,” lalu ia bangkit menuju masjidnya dan turunlah ayat Al Qur’an, “Maka ketika Zaid telah mengakhiri keperluan terhadap istrinya (menceraikannya), Kami nikahkan engkau dengan dia,” (Hadits ini para perawinya adalah para perawi hadits shahih, diriwayatkan pula oleh Ahmad juz 3 hal. 195, dan diriwayatkan pula oleh Muslim juz 9 hal. 228). Maksudnya, setelah habis idahnya. Yakni pasti terjadi dan tidak ada yang dapat menghalangi. Dari ayat ini dapat diambil beberapa faedah, di antaranya adalah: - Pujian terhadap Zaid bin Haritsah karena namanya disebutkan dalam Al Qur’an. - Allah memberitahukan, bahwa Dia telah memberinya nikmat Islam dan iman. Ini adalah persaksian dari Allah, bahwa ia adalah seorang muslim dan mukmin, lahir maupun batin. - Orang yang dimerdekakan mendapatkan kenikmatan dari orang yang memerdekakan. - Bolehnya menikahi bekas istri anak angkat, sebagaimana ditegaskan dalam ayat di atas. - Pengajaran dengan sikap lebih meresap daripada dengan ucapan, apalagi jika ditambah dengan ucapan, maka yang demikian adalah cahaya di atas cahaya. - Rasulullah shallallahu 'alaihi wa sallam telah menyampaikan semua ayat tanpa menyembunyikan, meskipun ayat yang di sana terdapat celaan bagi dirinya. Ini menunjukkan bahwa Beliau adalah utusan Allah, tidak berkata kecuali sesuai yang diwahyukan kepadanya, dan tidak bermaksud meninggikan dirinya. - Cinta sekedar dalam hati seorang hamba kepada orang lain selain istrinya adalah tidak mengapa selama tidak disertai dengan perbuatan yang dilarang, dan seorang hamba tidaklah berdosa meskipun berangan-angan untuk memilikinya. - Orang yang dimintai nasihat adalah orang yang diamanahi, maka wajib baginya memberi nasihat yang lebih bermaslahat bagi yang meminta nasihat. - Seorang hamba harus mendahulukan takut kepada Allah daripada takut kepada manusia. - Keutamaan Zainab radhiyallahu 'anha, karena Allah yang menikahkannya dengan Nabi-Nya Muhammad shallallahu 'alaihi wa sallam. - Seorang wanita yang telah bersuami tidak boleh dinikahi dan berusaha untuk memilikinya serta mencari sebab-sebabnya, sampai suaminya menyelesaikan keperluan dengan istrinya dengan menalaknya dan sampai habis masa iddahnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 37",
    "description": "Dan ingatlah, ketika engkau, wahai nabi Muhammad, beberapa kali berkata kepada orang, yakni zaid bin ''ri'ah, yang telah diberi nikmat oleh Allah dengan memeluk agama islam dan engkau juga telah memberi nikmat kepadanya dengan memerdekakannya dan mengangkatnya menjadi anak, 'pertahankanlah terus istrimu, zainab binti ja'sy! jangan kau ceraikan ia, dan bertakwalah kepada Allah dengan bersabar menjalani pernikahanmu meski istrimu kurang menghormati'mu'. 38. Pernikahan dengan zainab menjadi beban bagi nabi karena erat kaitannya dengan persoalan yang sangat peka dalam masyarakat. Allah menguatkan hati nabi untuk menjalani pernikahan tersebut dan menegaskan, 'tidak ada keberatan apa pun pada nabi Muhammad tentang apa yang telah ditetapkan Allah baginya. Allah telah menetapkan yang demikian sebagai sunah, yakni ketetapan-ketetapan Allah pada nabi-nabi yang telah terdahulu. Dan ketetapan Allah itu suatu ketetapan yang pasti berlaku."
  }
]