[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian Allah menyebutkan para nabi terdahulu dan menyanjung mereka, bahwa mereka telah menyampaikan risalah-risalah Allah kepada manusia dan mereka takut kepada Allah semata dan tidak takut kepada siapa pun selainNya. Dan cukuplah Allah sebagai yang memperhitungkan segala amal perbuatan hamba-hambaNya seluruhnya dan pengawas atas mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "39. (Yaitu) Para Nabi yang menyampaikan risalah Allah yang diturunkan kepada mereka kepada umat-umat mereka, dan mereka tidak takut kepada seorang pun selain Allah -Subḥānahu wa Ta'ālā-, sehingga mereka tidak berpaling kepada apa yang diucapkan oleh orang lain tatkala mereka melakukan apa yang telah Allah halalkan bagi mereka. Dan cukuplah Allah sebagai penjaga amal perbuatan hamba-hamba-Nya untuk Dia perhitungkan dan Dia berikan balasannya kepada mereka. Jika amal perbuatannya baik, maka dibalas dengan kebaikan, jika amal perbuatannya buruk, maka akan dibalas dengan keburukan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "39. Demikianlah keadaan para Nabi, mereka adalah makhluk pilihan, manusia yang paling mengetahui kebenaran, dan paling takut kepada Allah; dan Nabi Muhammad adalah orang yang paling mulia di antara mereka. Dan cukup Allah yang akan menghisab para Nabi tentang penyampaian risalah mereka, dan menghisab kaum mereka tentang jawaban mereka terhadap seruan para Nabi."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "39. الَّذِينَ يُبَلِّغُونَ رِسٰلٰتِ اللهِ وَيَخْشَوْنَهُۥ وَلَا يَخْشَوْنَ أَحَدًا إِلَّا اللهَ ۗ ((yaitu) orang-orang yang menyapaikan risalah-risalah Allah, mereka takut kepada-Nya dan mereka tiada merasa takut kepada seorang(pun) selain kepada Allah) Yakni begitu pula denganmu Hai Muhammad, janganlah kamu pedulikan apa yang dikatakan orang lain tentangmu karena kamu menyampaikan ayat-ayat Allah. وَكَفَىٰ بِاللهِ حَسِيبًا(Dan cukuplah Allah sebagai Pembuat Perhitungan) Yakni membuat perhitungan pada mereka dalam suatu hal. Setelah Rasulullah menikahi Zainab, sebagian orang mengatakan: “dia menikahi istri anaknya sendiri.” Maka Allah menurunkan ayat: مَّا كَانَ مُحَمَّدٌ أَبَآ أَحَدٍ مِّن رِّجَالِكُمْ"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "39. Para nabi terdahulu yang telah menyampaikan risalah Allah kepada manusia. Mereka hanya takut kepada Allah dan tidak takut siapapun kecuali Allah. Begitu juga engkau wahai Muhammad, cukup engkau menyampaikan hukum dan syariat Allah, Allahlah Yang akan menghitung dan menjaga amal-amal mereka. Maka tidak ada yang harus ditakuti kecuali Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{orang-orang yang menyampaikan risalah-risalah Allah, dan takut kepadaNya serta tidak merasa takut kepada siapa pun selain kepada Allah. Cukuplah Allah sebagai pembuat perhitungan} pengawas amal ciptaanNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "39. Kemudian Allah menjelaskan, siapa gerangan mereka yang terdahulu, dan ini adalah sunnah dan tradisi mereka. Sesungguhnya mereka adalah “orang-orang yang menyampaikan risalah-risalah Allah.” Mereka membacakan ayat-ayat Allah, hujjah-hujjah dan argument-argumenNya kepada manusia, dan mengajak mereka kepada Allah, “dan mereka takut kepadaNya,” semata, tiada sekutu bagiNya “dan mereka tiada merasa takut kepada seorang pun,” kecuali kepada Allah. Apabila yang demikian itu adalah sudah menjadi sunnah pada para nabi yang ma’shum, yang tugas mereka telah mereka laksanakan dan mereka kerjakan sebaik-baiknya, yaitu berdakwah, mengajak manusia kepada Allah dan hanya takut kepadaNya semata, yang menuntut untuk melaksanakan segala yang diperintahkanNya dan meninggalkan segala laranganNYa, [maka hal ini membuktikan bahwa yang demikian itu tidak mengandung aib (cela) dari sudut mana pun]. “Dan cukuplah Allah sebagai pembuat Perhitungan,” yang memperhitungkan hamba-hambaNya dan selalu mengawasi amal perbuatan mereka. Dengan demikian dapat diketahui bahwa menikah itu termasuk salah satu sunnah (tradisi) para utusan Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahzab ayat 39: Ketahuilah wahai Nabi Allah bahwa mereka para Nabi yang telah Aku kabarkan kepadamu, mereka semua mengemban kerisalahan dari Allah, dan menjalankan apa yang Allah serta menyampaikan agama Allah dan takut kepada Allah saja tidak kepada selain-Nya, para Nabi tidak takut kepada siapapun selain Allah, mereka tidak menoleh sedikitpun kepada musuh-musuh Allah, begitu juga dengan celaan mereka dan ancaman mereka. Dan cukuplah Allah yang menghisab seluruh manusia yang awal dan akhir, yang mereka dihisab atas amalan-amalan mereka dan dibalas dengannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya, para rasul yang menyampaikan syariat-syariat Allah kepada manusia. Mereka membacakan ayat-ayat dan hujjah-hujjah-Nya kepada manusia, dan mengajak mereka kepada Allah. Maksudnya, mereka tidak takut celotehan manusia dalam hal yang dihalalkan Allah Subhaanahu wa Ta'aala kepada mereka. Jika seperti ini sunnah yang terjadi pada para nabi yang ma’shum, di mana tugas mereka telah mereka laksanakan, yaitu mengajak manusia kepada Allah, takut kepada-Nya saja, yang menghendaki mengerjakan semua perintah dan menjauhi larangan, maka hal itu berarti tidak ada celaan bagi Beliau. Dari sini diketahui, bahwa menikah termasuk sunnah para nabi dan rasul. Yakni yang menjaga dan mengawasi amal makhluk-Nya dan yang menghisab mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 39",
    "description": "Nabi-nabi terdahulu itu adalah orang-orang yang menyampaikan risalah-risalah dan syariat-syariat Allah kepada manusia; mereka takut hanya kepada-Nya dan tidak merasa takut kepada siapa pun selain kepada Allah. Dan cukuplah Allah sebagai pembuat perhitungan amal perbuatan manusia secara cepat dan cermat. ' (lihat juga: al-anbiy'/21: 47)40. Orang-orang musyrik, yahudi, dan munafik tidak henti-hentinya mempersoalkan pernikahan rasulullah dengan zainab. Mereka meng-ejek nabi karena menikahi mantan istri anaknya; mereka menganggap status anak angkat sama dengan anak kandung. Allah lalu menegaskan, 'Muhammad itu bukanlah bapak kandung dari seseorang laki-laki dewasa di antara kamu, tetapi dia adalah utusan Allah dan penutup para nabi. Dia adalah nabi terakhir yang menjadi bapak rohaniah bagi seluruh umat. Karena itu, janda zaid bin ''ri'ah dapat dinikahi oleh rasulullah. Dan Allah maha mengetahui segala sesuatu yang kalian lakukan. '."
  }
]