[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah tidak memberikan bagi seorang manusia pun dua hati dalam dadanya. Dan Allah tidak menjadikan istri-istri yang telah kalian zhihar itu sama dengan ibu-ibu kalian dalam hal pengaharaman. (Zhihar adalah ucapan suami kepada istrinya, “Kamu bagiku adalah seperti punggung ibuku.” Kata-kata ini di zaaman jahiliyah adalah talak. Allah menjelaskan bahwa istri tidak menjadi ibu dalam keadaan apa pun). Allah juga tidak menjadikan anak-anak angkat sebagai anak kandung dalam syariat, sebaliknya zhihar dan adopsi tidak memilki hakikat apa pun dalam pengharaman abadi. Istri yang telah dizhihar tidak sama dengan ibu dalam hal pengharaman, dan tidak ditetapkan dalam nasab dengan pengakuan terhadap seorang anak sebagai anak dengan berkata, “Ini anakku”, itu adalah kata-kata di bibir saja yang tidak memiliki hakikat dan nilai apa pun. Allah berfirman yang haq dan menjelaskan jalannya kepada hamba-hambaNya serta membimbing mereka ke jalan yang lurus."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Sebagaimana Allah tidak membuat dua hati di dalam dada seseorang, demikian pula Allah tidak menjadikan istri-istri seperti para ibu dalam hal pengharamannya, dan tidak menjadikan anak-anak angkat sebagaimana anak-anak kandung. Sesungguhnya ẓihar -yaitu tindakan seorang lelaki yang mengharamkan istrinya untuk dirinya- dan mengangkat anak adalah adat jahiliah yang telah dibatalkan oleh Islam. Sesungguhnya ẓihar dan pengangkatan anak adalah slogan yang senantiasa kalian ucapkan dengan lisan kalian, padahal hal itu bukan yang sebenarnya. Istri bukanlah ibu, dan anak angkat bukanlah anak kandung. Dan Allah -Subḥānahu- berfirman tentang kebenaran untuk dilaksanakan oleh hamba-hamba-Nya, dan Dia menunjuki kepada jalan kebenaran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "4. Allah tidak menciptakan bagi manusia dua hati dalam dadanya, sehingga tidak akan berkumpul antara keimanan dengan kekafiran dalam satu hati. Dan Allah tidak menjadikan istri-istri kalian yang kalian haramkan atas diri kalian dengan ucapan ‘Kamu bagiku seperti ibuku’ sebagai ibu-ibu kalian yang haram untuk kalian nikahi -ucapan ini pada zaman jahiliyah merupakan ucapan talak, namun syariat islam menghapus budaya tersebut dengan mensyariatkan kafarat bagi yang mengucapkannya-. Dan Allah tidak menjadikan anak-anak angkat kalian sebagai anak-anak kandung. Ucapan tersebut jauh dari kebenaran tentang pengharaman, dan anak angkat hanyalah sebutan yang keluar dari mulut. Dan Allah-lah yang mengucapkan kebenaran yang wajib diikuti sebagai petunjuk menuju jalan yang benar."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. مَّا جَعَلَ اللهُ لِرَجُلٍ مِّن قَلْبَيْنِ فِى جَوْفِهِۦ ۚ (Allah sekali-kali tidak menjadikan bagi seseorang dua buah hati dalam rongganya) Salah seorang kaum munafik berkata: “hatiku menyuruhku untuk melakukan ini, dan hatiku menyuruhku melakukan itu.” Maka Allah menjelaskan bahwa seorang manusia hanya memiliki satu hati, dan didalamnya tidak ada kecuali Islam atau kekafiran atau kemunafikan. وَمَا جَعَلَ أَزْوٰجَكُمُ الّٰٓـِٔى تُظٰهِرُونَ مِنْهُنَّ أُمَّهٰتِكُمْ ۚ( dan Dia tidak menjadikan istri-istrimu yang kamu zhihar itu sebagai ibumu) Zhihar adalah seorang suami yang mengatakan kepada istrinya “kamu bagiku bagaikan punggung ibuku.” Kalimat ini dalam adat jahiliyah ditujukan untuk mentalak istrinya. Maka Allah menjelaskan bahwa istri bukanlah ibunya, dan perkataan ini adalah perkataan mungkar dan dosa bagi yang mengatakannya, serta Allah mewajibkan untuk menebus kafarat bagi orang yang mengatakannya. [lihat awal surat al-Mujadilah]. وَمَا جَعَلَ أَدْعِيَآءَكُمْ أَبْنَآءَكُمْ ۚ( dan Dia tidak menjadikan anak-anak angkatmu sebagai anak kandungmu) Yakni Allah tidak menjadikannya anak kalian sesungguhnya atau secara syariat. Dan makna (الأدعياء) yakni anak-anak angkat. ذٰلِكُمْ(Yang demikian itu) Yakni zhihar dan pengangkatan anak yang telah disebutkan tadi. قَوْلُكُم بِأَفْوٰهِكُمْ ۖ (hanyalah perkataanmu di mulutmu saja) Yakni itu hanyalah perkataan di mulut saja dan tidak mempengaruhi apapun, sehingga istri tidak menjadi ibu kalian dan anak angkat tidak menjadi anak kandung, dan hal ini tidak menjadikan hukumnya menjadi hukum antara ibu atau anak."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Allah tidak menciptakan dua hati dalam rongganya, dan Dia tidak menjadikan istri-istrimu yang kamu zihar itu sebagai ibumu, sebagimana ibu yang diharamkan atasmu, seperti ucapan suami kepada istrinya: “kamu bagiku seperti punggung ibuku” ini dalam adat jahiliyah adalah talak, kemudian Allah membedakan bahwa istri itu bukan seperti ibu, dan Dia tidak menjadikan anak angkatmu sebagai anak kandungmu (sendiri), dan doa-doa; anak-anak, dengan mengangkat anak, demikian bagi kalian dzihar dan mengangkat anak, yang bukan hanya ucapan kata yang tidak ada esensinya. Maka tidak dibenarkan menyamakan istri dengan dzihar. Dan juga tidak dibesarkan pemberian nasab pengangkatan anak. Allah telah memfirmakan yang haq yang wajib diikuti umat hambaNya. Ayat ini diturunkan kepada salah satu dari Bani Fihr: “sesungguhnya dalam hatiku ada 2 rongga, aku berfikir menggunakan salah satu darinya lebih utama daripada akal Muhammad”, atau dalam perkara Walid bin Mughirah yang berkata: “aku mempunyai dua rongga dalam hatiku, yang satu lebih tajam dibandingkan yang lainnya. Dan turunlah ayat dzihar pada Khoulah bint Tsa’labah istri Aus bin Shamit sebagaimana yang disebutkan dalam surah Al-Mujadalah. Dan turunlah ayat pembatalan mengangkat anak atas Zaid bin Haristah yang diangkat anak oleh Rasulullah SAW, kemudian Rasul memerdekakannya dan mengangkatnya anak sebelum turunnya wahyu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Allah tidak menjadikan bagi seseorang dua hati dalam rongganya} dadanya {Dia tidak menjadikan istri-istri kalian yang kalian zhihar itu sebagai ibu kalian} Allah tidak menjadikan istri-istri kalian yang kalian ucapkan kepada mereka,”menurutku kamu seperti punggung ibuku” itu seperti ibu kalian dalam pengharaman {dan Dia tidak menjadikan anak angkat kalian sebagai anak kandung kalian} dan Allah tidak menjadikan orang yang kalian anggap sebagai anak (bukan anak yang sebenarnya) itu sebagai anak kandung kalian {Yang demikian itu hanyalah perkataan di mulut kalian saja. Allah berfirman tentang sesuatu yang benar dan Dia menunjukkan jalan} jalan kebenaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4. Allah mencela hamba-hambaNya karena membicarakan sesuatu yang sama sekali tidak ada hakikatnya (kebenarannya) dan Allah tidak menjadikannya seperti apa yang mereka katakan. Sebab, sesungguhnya perkataan dari kalian itu adalah kedustaan dan kepalsuan yang dapat menimbulkan berbagai kemungkaran secara syar’i. ini adalah satu kaidah umum dalam setiap pembicaraan tentang apa saja, dan ia menginformasikan kejadian dan keberadaan sesuatu yang tidak ditetapkan oleh Allah. Akan tetapi Allah mengkhususkan untuk menyebutkan hal-hal tersebut karena ia memang sudah terjadi dan karena kebutuhan mendesak untuk menjelaskannya, maka Dia berfirman, “Allah sekali-kali tidak menjadikan bagi seseorang dua buah hati dalam rongganya.” Ini tidak ada. Maka jangan sekali-kali kalian mengatakan tentang seseorang “bahwa dia mempunyai dua hati di dalam rongga badannya” sebab kalian akan menjadi orang-orang yang berdusta terhadap ciptaan ilahi. “Dan Dia tidak menjadikan istri-istrimu yang kamu zhihar itu,” yaitu seperti salah satu dari kalian mengatakan kepada istrinya, “engkau bagiku seperti punggung ibuku sendiri” atau “seperti ibuku sendiri.” Padahal Allah tidak menjadikan mereka “sebagai ibumu.” Ibumu adalah orang yang telah melahirkanmu dan menjadi wanita yang paling terhormat dan paling haram (untuk dinikahi), sedangkan istrimu adalah wanita yang paling halal untukmu, lalu bagaimana kamu bisa menyamakan salah satu dengan yang lain yang sangat bertolak belakang?! Ini adalah perkara yang tidak boleh, sebagaimana yang difirmankan Allah, \"Orang-orang yang menzihar istrinya di antara kamu, (menganggap istrinya sebagai ibunya, padahal) tiadalah istri mereka itu ibu mereka. Ibu-ibu mereka tidak lain hanyalah wanita yang melahirkan mereka. Dan sesungguhnya mereka sungguh-sungguh mengucapkan suatu perkataan yang mungkar dan dusta\" (Al-Mujadilah:2). “Dan Dia tidak menjadikan anak-anak angkatmu sebagai anak kandungmu (sendiri),” anak-anak angkat adalah anak yang diklaim oleh seseorang sebagai anaknya, padahal ia bukan anaknya, atau yang dipanggilkan kepadanya (di binkan kepadanya) disebabkan karena dia mengadopsinya sebagai anak angkat, seperti kebiasaan yang terjadi pada masa jahiliyah dan awal-awal lahirnya Islam. Lalu Allah hendak memberantas dan menghapusnya. Maka DIa terlebih dahulu menjelaskan kekejiannya, dan bahwa perbuatan itu adalah kebatilan dan kedustaan. Sedangkan setiap kebatilan dan kedustaan itu tidak ada tempat di dalam syariat Allah, dan hamba-hambaNya itu tidak akan berkarakter dengan yang demikian. Allah berfirman (bahwa) Allah tidak menjadikan anak-anak angkat yang kalian klaim atau yang dipanggil dengan menyertakan nama kalian, sebagai anak kalian. Sebab, sesungguhnya anak-anak kalian yang hakiki adalah yang dilahirkan oleh istri kalian dan mereka berasal dari kalian. Sedangkan para anak angkat tersebut bukan dari kalian. Maka Allah tidak menjadikan yang demikian itu sebagai anak kalian. “Yang demikian itu,” maksudnya, perkataan yang kalian katakana tentang anak angkat, bahwa dia adalah anak Si A yang telah mengklaimnya, atau bapak anak itu adalah si B, “hanyalah perkataanmu di mulutmu saja,” maksudnya, perkataan yang tidak ada hakikatnya sama sekali dan tidak ada maknanya, “dan Allah mengatakan yang yakin dan yang benar. Maka dari itu, Dia menyuruh kalian mengikutinya berdasarkan Firman dan syariatNya, seedangkan perkataanNya adalah benar dan syariatNya adalah benar. Perkataan-perkataan dan perbuatan-perbuatan yang batil tidak boleh dinisbatkan (disandarkan) kepadaNya dari sudut pandang mana pun, dan ia bukan bagian dari hidayahNYa, sebab Allah tidak menunjukkan kecuali hanya kepada jalan yang lurus dan jalan yang benar. Dan sekalipun hal yang demikian itu terjadi atas kehendakNya (masyi’ahNya), maka kehendakNYa bersifat umum, meliputi setiap apa saja yang ada, berupa kebaikan dan keburukan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahzab ayat 4: Allah mengabarkan bahwa tidak menjadikan satupun bagi manusia memiliki dua hati di dadanya; Meskipun seorang Rasul atau manusia yang cerdas ataupun yang tajam pikirannya. Allah juga mengabarkan bahwasanya Dia tidak menjadikan seorang istri seperti sebagaiman seorang ibu, yang diharamkan untuk berkata kepada seorang istri : Engkau bagiku seperti punggung ibuku. Ketika seorang istri telah Allah halalkan atasmu. Allah mengabarkan bahwa tidak menjadikan anak-anak angkat bagimu sebagaimana anak-anak kandungmu sendiri, karena sebab mereka tidak berasal dari dirimu, tidak mungkin menjadi seorang anak memiliki dua bapak, karena sesungguhnya dia hanya memiliki satu bapak. Dan klaimmu bahwasanya dia adalah anak kandungmu hanyalah lewat lisan saja tidak secara hakiki. Dzihar dan mengangkat seorang anak menjadi adat pada zaman jahiliyyah, dan datang islam kemudian membatalkan kedua adat tersebut pada ayat ini, dan orang-orang yang beriman diperingatkan dari keduanya. Barangsiapa yang menganggap istrinya seperti ibunya dengan pengharaman, dan mengangkat seorang anak yang bukan anaknya; Maka sungguh dia membuat-buat kebohongan atas nama Allah.Allah menjelaskan akan kebenaran dan memberikan petunjuk kepada perkataan yang jujur dan kepada jalan yang lurus."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini merupakan kaidah umum dalam berbicara tentang segala sesuatu, memberitakan hal yang terjadi atau terwujudnya sesuatu yang Allah tidak mewujudkannya. Dikhususkan tentang masalah di atas adalah karena terjadinya masalah itu dan perlu sekali dijelaskan. Ayat ini sebagai bantahan terhadap salah seorang di antara orang-orang kafir yang menyatakan, bahwa dirinya memiliki dua buah hati yang masing-masingnya berfungsi, sehingga menurutnya, akalnya lebih utama daripada akal Nabi Muhammad shallallahu 'alaihi wa sallam. Padahal, Allah tidak menjadikan bagi seseorang dua hati dalam tubuhnya. Zhihar ialah perkataan seorang suami kepada istrinya, “Punggungmu haram bagiku seperti punggung ibuku atau seperti ibuku,” atau perkataan lain yang sama maksudnya. Sudah menjadi adat kebiasaan orang Arab Jahiliyah bahwa apabila suami berkata demikian kepada istrinya, maka istrinya itu haramnya baginya untuk selama-lamanya. Tetapi setelah Islam datang, maka yang haram untuk selama-lamanya itu dihapuskan, dan istri-istri itu kembali halal bagi suaminya dengan membayar kaffarat (denda) sebagaimana disebutkan dalam surah Al Mujadilah ayat 1-4. Yakni sebagai ibumu yang melahirkan kamu, di mana ia adalah orang yang paling besar kehormatan dan keharamannya bagimu, sedangkan istrimu adalah orang yang paling halal bagimu, lalu bagaimana kamu menyamakan orang yang berbeda? Hal ini tidaklah boleh. Karena anak kandungmu adalah anak yang kamu lahirkan atau dari kamu, sedangkan anak angkat bukan darimu. Menurut Jalaaluddin Al Mahalli, ketika Nabi shallallahu 'alaihi wa sallam menikahi Zainab binti Jahsy yang sebelumnya sebagai istri Zaid bin Haritsah (yang sebelumnya dijadikan anak angkat Rasulullah shallallahu 'alaihi wa sallam), maka orang-orang Yahudi dan kaum munafik berkata, “Muhammad menikahi istri (bekas) anaknya.” Maka Allah mendustakan mereka dengan firman-Nya ini, “Yang demikian itu hanyalah perkataan di mulutmu saja.” Adapun menurut Ibnu Katsir, maksud ayat, “Yang demikian itu hanyalah perkataan di mulutmu saja,” adalah pengangkatan seseorang sebagai anak angkat adalah sebatas ucapan saja, yang tidak menghendaki sebagai anak hakiki, karena ia dicipta melalui tulang shulbi orang lain. Yakni yang yakin dan benar. Oleh karena itulah, Dia memerintahkan kamu untuk mengikuti perkataan dan syariat-Nya. Perkataan-Nya adalah hak dan syariat-Nya adalah hak, sedangkan perkataan dan perbuatan yang batil tidaklah dinisbatkan kepada-Nya dari berbagai sisi, dan tidak termasuk petunjuk-Nya, karena Dia tidaklah menunjukkan kecuali kepada jalan yang lurus dan benar."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 4",
    "description": "Beralih dari perintah bertakwa dan larangan menaati orang kafir, Allah melalui ayat ini kemudian berbicara tentang orang yang hatinya tidak istikamah, masalah zihar, dan anak angkat. Allah tidak menjadikan bagi seseorang dua hati dalam rongganya. Setiap manusia hanya memiliki satu hati dan darinya muncul kehendak atau keinginan. Karena itu, tidak mungkin di satu sisi ia beriman dan takut kepada Allah namun di sisi lain ia takut kepada selain Allah. Dan begitu juga, dia tidak menjadikan istrimu yang kamu zihar itu sebagai ibumu. Zihar adalah perkataan suami kepada istri, 'punggungmu haram bagiku seperti punggung ibuku, ' atau yang sama maksudnya. Dan dia juga tidak membenarkanmu menjadikan anak angkatmu sebagai anak kandungmu sendiri. Sejak saat itu hukum anak angkat dibatalkan. Dengan begitu nasab anak itu kembali ke nasab ayah kandungnya. Sesungguhnya yang demikian itu hanyalah perkataan di mulutmu saja yang tidak dilandasi ilmu yang benar. Allah mengatakan dan menetapkan hukum yang sebenarnya dan dia menunjukkan kepadamu jalan yang benar dan lurus. 5. Allah tidak menjadikan anak angkatmu sebagai anak kandung. Karena itu, panggillah mereka dengan dinisbatkan kepada nama bapak kandung mereka sendiri, bukan bapak angkatnya. Panggilan demikian itulah yang secara syariat dinilai adil di sisi Allah, dan jika kamu tidak mengetahui nama bapak kandung mereka, maka panggillah mereka sebagai saudara-saudaramu seagama dan maula-maulamu. Dan tidak ada dosa atasmu menisbatkan seorang anak kepada selain bapaknya jika kamu khilaf atau belum tahu hukum tentang hal itu, tetapi yang menimbulkan dosa adalah apa yang disengaja oleh hatimu dengan menetapkan sesuatu yang batil. Allah maha pengampun kepada siapa saja yang memohon ampunan-Nya, maha penyayang sehingga tidak serta-merta mengazab hamba-Nya yang bersalah."
  }
]