[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Muhammad bukanlah bapak dari seseorang di antara kalian, akan tetapi dia adalah utusan Allah dan penutup para Nabi, tidak ada kenabian sesudahnya sampai Hari Kiamat. Allah Maha Mengetahui segala amal perbuatan kalian, tidak ada sesuatu pun yang samar bagiNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "40. Dan Muhammad bukanlah bapak dari salah seorang di antara kalian, dia bukanlah orang tua Zaid yang diharamkan atasnya untuk menikahi istri anaknya apabila telah menceraikannya. Akan tetapi dia adalah utusan Allah kepada manusia dan penutup para Nabi, tidak ada lagi Nabi setelahnya. Dan Allah Maha Mengetahui segala sesuatu, tidak ada urusan para hamba-Nya yang luput dari-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "40. Muhammad bukanlah ayah dari seseorang di antara kalian yang menjadikannya haram untuk menikah. Ini merupakan bantahan kepada orang yang berkata bahwa Nabi Muhammad menikahi mantan istri anaknya, Zaid. Akan tetapi beliau adalah Rasulullah dan nabi yang terakhir, oleh sebab itu beliau tidak meninggalkan anak laki-laki setelah kematiannya, karena tidak ada nabi setelahnya. Allah Maha Mengetahui perkataan, perbuatan, dan keadaan kalian, dan Dia Maha Mengatahui apa yang baik bagi hamba-hamba-Nya di dunia dan di akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "40. مَّا كَانَ مُحَمَّدٌ أَبَآ أَحَدٍ مِّن رِّجَالِكُمْ (Muhammad itu sekali-kali bukanlah bapak dari seorang laki-laki di antara kamu) Yakni dia bukanlah bapak Zaid bin Haritsah sebenarnya sehingga istrinya haram baginya, bukan pula bapak seseorang yang tidak dilahirkan dari sulbinya. Namun anak laki-lakinya dari sulbinya adalah Ibrahim, Qasim, Thayib, dan Muthahhar; namun tidak ada yang hidup sampai umur dewasa. وَلٰكِن رَّسُولَ اللهِ وَخَاتَمَ النَّبِيِّۦنَ ۗ(tetapi dia adalah Rasulullah dan penutup nabi-nabi) Makna (الخاتم) yakni yang terakhir, sehingga tidak ada nabi setelahnya. Imam Bukhari, Muslim, dan yang lainnya mengeluarkan hadits dari Jabir, ia berkata, Rasulullah bersabda: “perumpamaanku dengan para Nabi yang lain adalah seperti seseorang yang membangun sebuah bangunan, kemudian dia menyelesaikan dan menyempurnakan pembangunannya kecuali tinggal satu batu bata, sehingga orang yang memasukinya akan melihatnya seraya berkata: ‘betapa indahnya bangunan ini, kecuali satu bata yang belum dilengkapi ini.’ Dan akulah satu batu bata itu, maka akulah penutup para nabi.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "40. Muhammad bukanlah bapak kandung anak-anak kalian. Nabi juga bukan bapak kandung dari Zaid bin Haritsah sehingga dianggap tidak boleh menikahi istri dari anak angkatnya itu. Adapun empat putera Nabi yaitu Ibrahim, Qasim, Tayyib dan Muthahhar sudah meninggal sebelum usia dewasa. Namun, Rasul adalah nabi terakhir, Allah Maha Tahu atas segala sesuatu yang sesuai dan pantas untuk penutup para nabi, yang tidak ada nabi sesudahnya. Ketika Nabi menikahi Zainab, ‘Aisyah berkata: “Nabi telah menikahi kekasih/kesayangan puteranya sendiri.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Muhammad itu bukanlah bapak dari seseorang di antara kalian, tetapi dia adalah utusan Allah dan penutup para nabi. Allah Maha Mengetahui segala sesuatu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "40. Maksudnya, rasul “Muhammad,” itu sekali-kali bukanlah “bapak dari seorang laki-laki kalian,” wahai umat Islam. Di sini Allah memutus intisabnya Zaid bin haritsah kepada beliau melalui ayat ini. Ketika penafian ini bersifat umum dalam seluruh kondisi, jika redaksi ayat diberlakukan sesuai dengan zahirnya lafazh; maksudnya, tidak ada predikat ke –bapakan- karena nasab ataupun ke –bapakan- karena adopsi, padahal sudah dimaklumi bahwa Rasulullah itu adalah bapak bagi seluruh kaum yang beriman, dan istri-istri beliau adalah ibu mereka, maka dijagalah dari dimasukkannya jenis ini kepada keumuman larangan tersebut. Maka Allah berfirman, “Tetapi dia adalah Rasulullah dan penutup nabi-nabi,” maksudnya, inilah kedudukan beliau, yaitu kedudukan (martabat) sebagai orang yang ditaati, ditakuti, dijadikan panutan, dipercaya yang harus mengutamakan cinta kepadanya atas kecintaan kepada siapa pun; dia sangat tulus kepada mereka, yang bagi kaum beriman, karena kebaikan dan ketullusannya, hingga seakan-akan dia (Rasulullah) adalah bapak mereka. “Dan Allah Maha Mengetahui segala sesuatu” maksudnya, ilmu pengetahuan Allah telah meliputi segala sesuatu, Dia tahu di mana dan kapan menetapkan risalahNya, dan tahu siapa pula yang layak untuk menerima karuniaNya, serta siapa pula yang tidak layak untuknya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahzab ayat 40: Ketahuilah wahai manusia bahwa Muhammad ﷺ dan keluarganya bukanlah bapak bagi laki-laki yang muslim, tidak Zaid bin Haritsah dan yang selainnya, akan tetapi dia adalah utusan Allah, dan penutup para Nabi setelahnya. Dan Allah Maha Tahu atas segala sesuatunya, tidak ada yang ghaib dari-Nya walau sebesar biji atom di langit dan di bumi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya, Nabi Muhammad shallallahu 'alaihi wa sallam bukanlah ayah dari salah seorang sahabat (Zaid bin Haritsah radhiyallahu 'anhu), oleh karena itu bekas istri Zaid dapat dikawini Rasulullah shallallahu 'alaihi wa sallam. Inilah kedudukan Beliau. Oleh karena itu sikap kita kepada Beliau adalah menaati perintahnya, menjauhi larangannya, membenarkan setiap sabdanya dan beribadah kepada Allah sesuai sunnahnya, serta mencintainya di atas kecintaan kepada siapa pun orangnya. Oleh karena itu, tidak ada lagi nabi setelah Beliau. Ilmu Allah meliputi segala sesuatu, Dia mengetahui di mana Dia taruh risalah-Nya, dan siapa yang cocok memperoleh karunia-Nya dan siapa yang tidak cocok."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 40",
    "description": "Orang-orang musyrik, yahudi, dan munafik tidak henti-hentinya mempersoalkan pernikahan rasulullah dengan zainab. Mereka meng-ejek nabi karena menikahi mantan istri anaknya; mereka menganggap status anak angkat sama dengan anak kandung. Allah lalu menegaskan, 'Muhammad itu bukanlah bapak kandung dari seseorang laki-laki dewasa di antara kamu, tetapi dia adalah utusan Allah dan penutup para nabi. Dia adalah nabi terakhir yang menjadi bapak rohaniah bagi seluruh umat. Karena itu, janda zaid bin ''ri'ah dapat dinikahi oleh rasulullah. Dan Allah maha mengetahui segala sesuatu yang kalian lakukan. '41-42. Agar keimanan orang-orang mukmin semakin kuat dan tidak terpengaruh cercaan orang-orang musyrik, yahudi, dan munafik kepada rasulullah atas pernikahan beliau dengan zainab, Allah berpesan, 'wahai orang-orang yang beriman! ingatlah kepada Allah kapan dan di mana saja, dengan mengingat di dalam hati maupun dengan zikir lisan sebanyak-banyaknya agar kamu selalu merasakan kehadiran Allah; dan bertasbihlah kepada-Nya pada waktu pagi dan petang dengan menyucikan Allah dari sifat-sifat kekurangan."
  }
]