[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "41-42. Wahai orang-orang yang membenarkan Allah dan RasulNya serta melaksanakan SyariatNya, ingatlah Allah dengan hati kalian, lisan kalian dan anggota badan kalian dengan dzikir yang banyak. Isilah waktu kalian dengan berdzikir kepada Allah di waktu pagi dan petang hari, setelah shalat fardhu dan ketika terjadi sesuatu secara tiba-tiba, karena hal itu adalah ibadah yang disyariatkan, mengundang kecintaan dari Allah, menahan lisan dari dosa, dan membantu kepada segala kebaikan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "41. Wahai orang-orang yang beriman kepada Allah dan mengerjakan apa yang disyariatkan kepada mereka, ingatlah kepada Allah dengan hati, lisan dan anggota tubuh kalian dengan ingatan yang banyak."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "41-42. Hai orang-orang beriman, perbanyaklah berzikir dan bertasbih setiap pagi dan petang; karena zikir merupakan salah satu ibadah yang paling agung, disamping ia merupakan amalan yang paling mudah dan paling menguatkan jiwa dan menyucikan hati. Dan bertasbih kepada Allah adalah dengan mengagungkan dan menyucikan-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "41. – 42. Wahai orang-orang yang beriman, sebut-sebutlah asma Allah dengan hati dan lisan di setiap waktu dengan sepenuh hati. Sucikanlah nama-Nya dari segala sesuatu yang tidak sesuai dengan-Nya baik awal siang maupun akhirnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, ingatlah Allah dengan sebanyak-banyaknya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "41. Allah memerintahkan orang-orang Mukmin agar berdzikir, mengingatNya sebanyak-banyaknya dalam bentuk tahlil, tahmid, tasbih, takbir dan lain-lainnya dari setiap bacaan yang mengandung pendekatan diri kepada Allah. Minimalnya hendaklah seorang manusia menekuni wirid (dzikir) pagi dan sore, dzikir seusai shalat lima waktu, dan di saat kondisi-kondisi tertentu dan sebab-sebab khusus. Dan hendaknya hal ini ditekuni secara kontinyu sepanjang waktu dalam segala kondisi. Sesungguhnya yang demikian ini adalah ibadah yang si pelaku menjadi unggul karenanya, sementara dia merasa tenang dan mengajak kepada Allah dan berma’rifat kepadaNya dan menjadi penolong untuk kebaikan dan mencegah lisan dari perkataan-perkataan kotor."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahzab ayat 41: Allah memerintahkan hamba-Nya yang beriman kepada Allah dan membenarkan Rasulullah ﷺ untuk memperbanyak mengingat Allah baik siang maupun malam dan baik sendiri maupun tidak."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memerintahkan kaum mukmin untuk mengingat-Nya sebanyak-banyaknya sesuai petunjuk Rasul-Nya, seperti dengan tahlil (ucapan Laailaahaillallah), tahmid (ucapan Alhamdulillah), tasbih (ucapan subhaanallah), takbir (ucapan Allahu akbar), dan ucapan lainnya yang mendekatkan diri kepada Allah Subhaanahu wa Ta'aala. Paling sedikitnya adalah seseorang membiasakan dzikr pagi dan petang, setelah shalat dan ketika terjadi sesuatu atau ada sebabnya untuk berdzikr. Demikian pula hendaknya seseorang membiasakan hal itu dalam setiap waktunya, dan dalam semua keadaan, karena dzikr merupakan ibadah yang bisa membalap orang lain dengan santai, mengajaknya mencintai dan mengenal Allah, membantu kepada kebaikan dan menjaga lisan dari ucapan yang buruk. Faedah: Tidak dibenarkan dalam dzikrnya seseorang hanya menyebut “Allah, Allah, Allah” saja seperti yang dilakukan orang-orang shufi. Ini adalah bid’ah, karena Rasulullah shallallahu 'alaihi wa sallam, para sahabat dan tabiin tidak pernah mengajarkan dzikr seperti itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 41",
    "description": "41-42. Agar keimanan orang-orang mukmin semakin kuat dan tidak terpengaruh cercaan orang-orang musyrik, yahudi, dan munafik kepada rasulullah atas pernikahan beliau dengan zainab, Allah berpesan, 'wahai orang-orang yang beriman! ingatlah kepada Allah kapan dan di mana saja, dengan mengingat di dalam hati maupun dengan zikir lisan sebanyak-banyaknya agar kamu selalu merasakan kehadiran Allah; dan bertasbihlah kepada-Nya pada waktu pagi dan petang dengan menyucikan Allah dari sifat-sifat kekurangan"
  }
]