[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "41-42. Wahai orang-orang yang membenarkan Allah dan RasulNya serta melaksanakan SyariatNya, ingatlah Allah dengan hati kalian, lisan kalian dan anggota badan kalian dengan dzikir yang banyak. Isilah waktu kalian dengan berdzikir kepada Allah di waktu pagi dan petang hari, setelah shalat fardhu dan ketika terjadi sesuatu secara tiba-tiba, karena hal itu adalah ibadah yang disyariatkan, mengundang kecintaan dari Allah, menahan lisan dari dosa, dan membantu kepada segala kebaikan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "42. Dan sucikanlah Allah -Subḥānahu- dengan tasbih dan tahlil pada pagi dan sore hari karena keutamaan dua waktu itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "41. – 42. Wahai orang-orang yang beriman, sebut-sebutlah asma Allah dengan hati dan lisan di setiap waktu dengan sepenuh hati. Sucikanlah nama-Nya dari segala sesuatu yang tidak sesuai dengan-Nya baik awal siang maupun akhirnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan bertasbihlah kepadaNya pada waktu pagi dan petang} permulaan dan akhir siang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "42. “Dan bertasbihlah kepadaNya di waktu pagi dan petang,” yakni Pada awal permulaan siang hari dan di sore hari, karena keutamaan dan kemuliaan dua waktu ini serta karena kemudahan untuk melakukannya pada dua waktu ini."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahzab ayat 42: Allah memerintahlan mereka agar memperbanyak bertasbih dan mensucikan Allah dari apa yang tidak pantas bagi-Nya, dan agar terus dalam keadaan demikian pada awal siang dan akhirnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Keduanya adalah waktu yang utama dan karena mudahnya beramal di waktu ini."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 42",
    "description": "41-42. Agar keimanan orang-orang mukmin semakin kuat dan tidak terpengaruh cercaan orang-orang musyrik, yahudi, dan munafik kepada rasulullah atas pernikahan beliau dengan zainab, Allah berpesan, 'wahai orang-orang yang beriman! ingatlah kepada Allah kapan dan di mana saja, dengan mengingat di dalam hati maupun dengan zikir lisan sebanyak-banyaknya agar kamu selalu merasakan kehadiran Allah; dan bertasbihlah kepada-Nya pada waktu pagi dan petang dengan menyucikan Allah dari sifat-sifat kekurangan. 43. Demikianlah pesan Allah kepada orang-orang beriman, karena dialah yang senantiasa memberi rahmat kepadamu, dan para malaikat-Nya memohonkan ampunan untukmu, agar dia yang maha penga-sih mengeluarkan kamu dari kegelapan kepada cahaya yang terang. Dan dia maha penyayang kepada seluruh makhluk-Nya, khususnya kepada orang-orang yang beriman."
  }
]