[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dia-lah yang menyayangi kalian dan menyanjung kalian, dan para malaikat berdoa untuk kalian, agar Dia mengeluarkan kalian dari kegelapan-kegelapan kebodohan dan kesesatan kepada cahaya Islam. Allah Maha Penyayang kepada orang-orang Mukmin di dunia dan akhirat, tidak menyiksa mereka selama mereka selalu taat dan ikhlas kepadaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "43. Dia lah yang telah memberi rahmat kepada kalian, memuji kalian. Dan para Malaikat-Nya berdoa agar Dia mengeluarkan kalian dari kegelapan kekafiran menuju cahaya keimanan, dan Dia Maha Penyayang terhadap kaum mukminin dengan tidak menyiksa mereka apabila mereka menaati-Nya, menjalankan perintah-Nya dan menjauhi larangan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "43. Allah-lah yang merahmati dan memuji kalian, serta mengabulkan doa para malaikat, para nabi, dan orang-orang shalih yang ditujukan untuk kebaikan kalian; dan para malaikat berdoa dan beristighfar bagi kalian, agar Allah -dengan rahmat dan karunia-Nya- mengeluarkan kalian dari gelapnya kesyirikan dan keraguan menuju cahaya keimanan dan keyakinan. Allah Maha Merahmati orang-orang beriman, memberi petunjuk, memperbaiki, dan menjaga mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "43. هُوَ الَّذِى يُصَلِّى عَلَيْكُمْ وَمَلٰٓئِكَتُهُۥ (Dialah yang memberi rahmat kepadamu dan malaikat-Nyamemohonkan ampunan untukmu)) Shalawat Allah bagi hamba-hamba-Nya yakni rahmat dan berkah yang dilimpahkan bagi mereka. Dan shalawat dari para malaikat yakni do’a dan permohonan ampun bagi mereka. لِيُخْرِجَكُم مِّنَ الظُّلُمٰتِ إِلَى النُّورِ ۚ(supaya Dia mengeluarkan kamu dari kegelapan kepada cahaya) Yakni dari kegelapan maksiat menuju cahaya ketaatan, dan dari kegelapan kesesatan menuju cahaya petunjuk."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "43. Dia-lah Yang telah memberikan rahmat kepadamu, para malaikat juga memintakan ampun untukmu, dan untuk mengeluarkanmu dari kekafiran dan kemaksiatan menuju ketaatan dan keimanan. Allah Maha Pengasih kepada orang-orang mukmin. Dialah Dzat Yang menerima sesuatu yang sedikit dan Maha Mengampuni atas sesuatu yang banyak. Ketika ayat shalat ini turun kepada Nabi, Abu Bakar berkata: “Allah tidak memberi suatu kebaikan untukmu kecuali kami juga ikut mendapatkan kebaikan itu.” Maka turunlah ayat ini."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dialah Dzat yang memberi rahmat kepada kalian} Dzat yang merahmati kalian dan memuji kalian {dan para malaikatNya} dan para malaikatNya berdoa dan memohinkan ampunan untuk kalian {agar Dia mengeluarkan kalian dari berbagai kegelapan menuju cahaya} dari kegelapan kekufuran menuju cahaya keimanan {Dia Maha Penyayang kepada orang-orang mukmin"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "43. “Dia-lah yang memberi rahmat kepadamu, dan malaikatNya (memohonkan ampun untukmu), supaya Dia mengeluarkan kamu dari kegelapan kepada cahaya. Dan Dia Maha Penyayang kepada orang-orang yang beriman.” Maksudnya, di antara rahmatNya kepada orang-orang Mukmin dan kelembutanNYa kepada mereka adalah Dia memberikan ampunan dan rahmatNya serta pujianNya kepada mereka. Shalawat dan doa para malaikat untuk mereka sehingga mereka dapat keluar dari berbagai kegelapan dosa-dosa dan kebodohan menuju cahaya iman, taufik, ilmu dan amal. Ini merupakan nikmat terbesar yang Dia karuniakan kepada hamba-hambaNya yang taat, yang merangsang, mengajak dan mendorong mereka untuk mensyukuriNya dan memperbanyak dzikir kepada Allah yang telah bersikap lembut dan belas-kasih kepada mereka dan menjadikan para penyandang ArasyNya, yaitu para malaikat yang paling mulia dan malaikat yang ada di sisiNya bertasbih menyucikan Tuhannya dan memohonkan ampunan bagi orang-orang yang beriman. Mereka mengucapkan, \"Ya Tuhan kami, rahmat dan ilmu Engkau meliputi segala sesuatu, maka berilah ampunan kepada orang-orang yang bertobat dan mengikuti jalan Engkau dan peliharalah mereka dari siksaan neraka yang menyala-nyala, ya Tuhan kami, dan masukkanlah mereka ke dalam surga Adn yang telah Engkau janjikan kepada mereka dan orang-orang yang saleh di antara bapak-bapak mereka, dan istri-istri mereka, dan keturunan mereka semua. Sesungguhnya Engkaulah Yang Maha Perkasa lagi Maha Bijaksana, dan peliharalah mereka dari (balasan) kejahatan. Dan orang-orang yang Engkau pelihara dari (pembalasan) kejahatan pada hari itu, maka sesungguhnya telah Engkau anugerahkan rahmat kepadanya dan itulah kemenangan yang besar\". (Ghafir:7-9). Ini adalah rahmat dan karuniaNya terhadap mereka di dunia."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahzab ayat 43: Allah mengabarkan keadaan yang dia telah Allah berikan rahmat-Nya wahai manusia, dan Allah menyanjung kalian, dan malaikat mendoakan dan memohon ampun bagi kalian; Agar kalian dapat keluar (atas karunia-Nya) dari kegelapan, kebodohan, kesesatan menuju cahaya islam. Kemudian Allah menjelaskan bahwasanya Dia terhadap orang-orang yang beriman mengasihi di dunia dan akhirat, dan di antara rahmat-Nya yaitu Allah tidak mengadzab mereka selama mereka menjadi orang-orang yang taat, ikhlas kepada Allah saja."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Shalawat Allah kepada hamba-hamba-Nya adalah dengan memberikan rahmat atau memujinya di hadapan para malaikat. Sedangkan shalawat malaikat untuk mereka adalah permohonan ampun dan doa untuk mereka. Yakni agar Dia mengeluarkan kita dari gelapnya kekafiran kepada cahaya keimanan, dari gelapnya kemaksiatan kepada cahaya ketaatan, dan dari gelapnya kebodohan kepada cahaya pengetahuan. Ini merupakan nikmat besar yang dilimpahkan-Nya kepada hamba-hamba-Nya yang taat yang menghendaki mereka untuk mensyukurinya, dan banyak menyebut nama-Nya, di mana Dia telah bersikap lembut kepada mereka dan merahmati mereka, bahkan menjadikan para malaikat pemikul ‘Arsy-Nya (singgasana) bertasbih dengan memuji-Nya dan memintakan ampunan untuk orang-orang yang beriman, serta meminta kepada-Nya agar mereka (kaum mukmin) dijauhkan dari azab neraka serta dimasukkan ke dalam surga (lihat surah Al Mu’min: 7-9). Ini (yakni dikeluarkan dari kegelapan kepada cahaya) adalah rahmat dan nikmat-Nya kepada mereka di dunia, adapun rahmat-Nya di akhirat, maka merupakan rahmat yang paling besar, pahala yang paling utama, yaitu memperoleh keridhaan Tuhan mereka dan penghormatan dari-Nya, mendengarkan firman-Nya, melihat wajah-Nya yang mulia, serta memperoleh pahala yang besar, yang tidak diketahui hakikatnya kecuali oleh Allah yang memberikan pahala itu kepada mereka. Oleh karena itu, Dia berfirman, “Penghormatan mereka (orang-orang mukmin itu) ketika mereka menemui-Nya ialah, “Salam,” dan Dia menyediakan pahala yang mulia bagi mereka.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 43",
    "description": "Demikianlah pesan Allah kepada orang-orang beriman, karena dialah yang senantiasa memberi rahmat kepadamu, dan para malaikat-Nya memohonkan ampunan untukmu, agar dia yang maha penga-sih mengeluarkan kamu dari kegelapan kepada cahaya yang terang. Dan dia maha penyayang kepada seluruh makhluk-Nya, khususnya kepada orang-orang yang beriman. 44. Curahan rahmat Allah kepada orang-orang beriman tidak pernah putus, bahkan pada hari kiamat. Sambutan penghormatan yang ditujukan kepada mereka ketika mereka menemui-Nya ialah, 'salam sejahtera bagi kamu dari segala bencana, ' dan dia menyediakan pahala yang mulia, berlimpah, dan abadi bagi mereka, yakni surga. Mereka kekal di dalamnya. (lihat juga: y'nus: 10: 10, ar-ra'd/13: 24, dan y's'n/36: 58)."
  }
]