[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Salam penghormatan kepada orang-orang Mukmin dari Allah di surga pada saat mereka bertemu denganNya adalah salam dan jaminan keamanan bagi mereka dari azab Allah. Allah telah menyiapkan untuk mereka pahala yang baik, yaitu surga."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "44. Salam penghormatan untuk kaum mukminin pada hari mereka bertemu Rabb mereka salam kedamaian dan keamanan dari setiap gangguan. Dan Allah telah menyiapkan bagi mereka pahala yang mulia -yaitu Surga- sebagai balasan atas ketaatan mereka kepada-Nya dan jauhnya mereka dari kemaksiatan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "44. Ucapan penghormatan orang-orang beriman ketika bertemu pada hari perhitungan dan ketika di dalam surga adalah ‘Salam’. Allah dan para malaikat memberi salam kepada mereka, dan mereka saling memberi salam sebagai bentuk penghormatan. Dan Allah menyiapkan surga yang mulia bagi mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "44. تَحِيَّتُهُمْ يَوْمَ يَلْقَوْنَهُۥ سَلٰمٌ ۚ (Salam penghormatan kepada mereka (orang-orang mukmin itu) pada hari mereka menemui-Nya ialah: Salam) Yakni salam penghormatan bagi orang-orang beriman dari Allah pada hari pertemuan dengan-Nya saat kematian mereka, atau di hari kebangkitan, atau saat memasuki surga. Dan pendapat lain mengatakan makna ayat ini adalah Allah menyelamatkan mereka dari segala mala petaka dan Dia memberi mereka kabar gembira tentang keamanan yang akan mereka dapatkan dari segala ketakutan pada hari pertemuan dengan-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "44. Penghormatan Allah untuk orang-orang mukmin pada hari perjumpaan di hari kahirat. Hari ketika orang-orang mukmin memasuki surga. Penghormatan itu berupa keselamatan dari segala yang tidak menyenangkan yang disampaikan melalui lisan para malaikat. Allah telah menyiapkan untuk mereka pahala yang agung yaitu surga."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Ucapan penghormatan mereka} ucapan penghormatan orang-orang mukmin {pada hari ketika mereka menemuiNya} bertemu dengan Allah {adalah,“Salam” dan Dia menyiapkan untuk mereka pahala yang mulia"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "44. Adapun rahmatNya kepada mereka di akhirat, maka sungguh rahmat yang lebih tinggi dan pahala yang lebih utama, yaitu meraih keridhaan Rabb mereka, penghormatan salam dariNya, mendengarkan FirmanNya yang sangat mulia, melihat WajahNya yang sangat indah dan memperoleh pahala yang sangat besar yang tidak diketahui hakikatnya keculai oleh orang yang Dia karuniai. Maka dari itu, Allah berfirman, “Salam penghormatan kepada mereka pada hari mereka menemuiNya ialah, ‘Salam’; dan Dia menyediakan pahala yang mulia bagi mereka.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahzab ayat 44: Allah menjelaskan bahwa pemuliaan bagi mereka orang-orang yang beriman ketika mereka masuk ke dalam surga adalah dengan salam, Allah memuliakan mereka dengan salam, begitu juga para malaikat memberikan salam, para malaikat memberikan salam dari segala penjuru; Kemudian Allah memebrikan kepada mereka kenikmatan yang menetap di Darussalam, di dalam surga yang Allah berikan kenikmatan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Artinya, sejahtera dari segala bencana"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 44",
    "description": "Curahan rahmat Allah kepada orang-orang beriman tidak pernah putus, bahkan pada hari kiamat. Sambutan penghormatan yang ditujukan kepada mereka ketika mereka menemui-Nya ialah, 'salam sejahtera bagi kamu dari segala bencana, ' dan dia menyediakan pahala yang mulia, berlimpah, dan abadi bagi mereka, yakni surga. Mereka kekal di dalamnya. (lihat juga: y'nus: 10: 10, ar-ra'd/13: 24, dan y's'n/36: 58). 45-46. Usai menjelaskan agungnya rahmat yang Allah berikan kepada orang beriman, Allah lalu menjelaskan fungsi pengutusan nabi Muhammad. Wahai nabi Muhammad! sesungguhnya kami mengutusmu kepada seluruh umat manusia untuk menjadi saksi kebenaran agama islam dan agama yang dibawa para rasul sebelum kamu, pembawa kabar gembira bagi mereka yang beriman kepada Allah dan rasul-rasul-Nya serta beramal saleh, dan pemberi peringatan kepada orang-orang yang tidak menerima ajaran Allah, dan untuk menjadi penyeru kepada agama Allah dengan izin-Nya, agar manusia meninggalkan kebatilan, dan kami juga mengutusmu sebagai cahaya yang menerangi jalan hidup manusia."
  }
]