[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "45-46. Wahai nabi, sesungguhnya Kami mengutusmu sebagai saksi atas umatmu bahwa kamu telah menyampaikan risalah, pemberi berita gembira kepada orang-orang Mukmin di antara mereka dengan rahmat dan surga, pemberi peringatan kepada para pendurhaka dan pendusta dengan api neraka. Penyeru kepada tauhid Allah dan ibadah kepadaNya semata dengan perintahNya kepadamu, lampu yang bercahaya bagi siapa yang ingin mengambil cahaya darimu. Perkaramu sangat jelas, kamu membawa kebenaran seperti matahari dari segi cahaya dan sinarnya, tidak ada yang mengingkarinya kecuali orang yang membangkang."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "45. Wahai Nabi! Sesungguhnya Kami mengutusmu kepada manusia sebagai saksi atas mereka bahwa engkau telah menyampaikan kepada mereka risalah yang engkau diutus menyampaikan kepada mereka, dan sebagai pemberi kabar gembira bagi orang-orang yang beriman dari mereka dengan Surga yang telah Allah siapkan bagi mereka, serta sebagai pemberi rasa takut bagi orang-orang kafir dari siksa yang telah Allah siapkan bagi mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "45-46. Allah menyampaikan kepada Nabi Muhammad untuk menjelaskan tugas dan risalahnya yang mulia. Allah mengutusnya sebagai saksi atas umatnya dan umat-umat yang lain, dan saksi atas kebenaran dan menjadi panutan dalam mengamalkannya; sebagai pemberi kabar gembira bagi orang-orang beriman berupa apa yang Allah siapkan bagi mereka; sebagai pemberi peringatan dari azab neraka; dan sebagai penyeru untuk mengesakan Allah, dan mengenal-Nya dan mengenal jalan-Nya dengan izin dan perintah dari-Nya; serta sebagai lentera yang menyinari jalan bagi manusia dengan wahyu, petunjuk, dan taufik dari Allah, serta dengan akhlak dan kemuliaannya yang menjadi teladan bagi orang-orang beriman; dan jalan itu sangat jelas."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "45. يٰٓأَيُّهَا النَّبِىُّ إِنَّآ أَرْسَلْنٰكَ شٰهِدًا (Hai Nabi, sesungguhnya Kami mengutusmu untuk jadi saksi) Yakni saksi atas umatnya, dia bersaksi bagi orang yang membenarkan dan beriman kepadanya dan bersaksi atas orang yang mendustai dan mengingkarinya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "45. Wahai Nabi, sesungguhnya Kami mengutusmu sebagai saksi atas orang-orang yang mendapat risalah itu, yaitu atas keimanan atau pendustaan mereka. Engkau juga Kami utus sebagai pemberi kabar gembira berupa surga bagi orang yang mempercayai dan mentaatimu. Juga sebagai pemberi peringatan atas azab neraka bagi mereka yang mendustakan dan dan mendurhakaimu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai Nabi, sesungguhnya Kami mengutusmu untuk menjadi saksi, pemberi kabar gembira, dan pemberi peringatan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "45. Hal-hal yang disifatkan oleh Allah kepada rasulullah ini adalah yang menjadi tujuan dari kerasulannya, inti dan prinsip-prinsipnya yang menjadi kekuhususan beliau, yaitu ada 5 perkara: Pertama : keberadaan beliau “untuk menjadi saksi.” Maksudnya, saksi atas umatnya tentang amal yang mereka kerjakan berupa kebaikan dan keburukan, sebagaimana Firman Allah, \"agar kamu menjadi saksi atas (perbuatan) manusia dan agar Rasul (Muhammad) menjadi saksi atas (perbuatan) kamu.\" (Al-Baqarah:143). Dan FirmanNya, \"Maka bagaimanakah (halnya orang kafir nanti), apabila Kami mendatangkan seseorang saksi (rasul) dari tiap-tiap umat dan Kami mendatangkan kamu (Muhammad) sebagai saksi atas mereka itu (sebagai umatmu).\" (An-Nisa:41). Jadi, Rasulullah itu adalah saksi nan adil yang diterima. Kedua dan ketiga : kedudukan beliau sebagai “pembawa kabar gembira dan pemberi peringatan.” Hal ini mengharuskan adanya penjelasan tentang orang yang diberi berita gembira dan yang diberi peringatan, materi yang dijadikan berita gembira dan diperingatkan, serta amal-amal yang membawa kepada hal tersebut. Orang yang diberi berita gembira itu adalah orang-orang Mukmin yang bertakwa, yaitu mereka yang mengombinasikan antara iman dan amal shalih serta meninggalkan maksiat. Mereka mendapatkan kabar gembira di dalam kehidupan dunia ini berupa segala pahala duniawi dan religi yang ditimbulkan oleh iman dan takwa; sedangkan di akhirat nangti berupa kenikmatan abadi. Semua itu mengharuskan adanya penjelasan secara terperinci terhadap hal yang disebutkan itu, tentang rincian amal, karakter-karakter takwa dan berbagai macam balasannya. Sedangkan yang diberi peringatan adalah orang-orang yang berdosa lagi zhalim. Mereka adalah para pelaku kezhaliman dan kebodohan. Mereka mendapatkan peringatan di dunia, berupa sanksi-sanksi (hukuman) duniawi dan religi yang diakibatkan oleh kebodohan dan kezhaliman, sedangkan di akhirat nanti mereka mendapatkan siksa yang sangat berat dan azab yang amat panjang. Rincian lebih lanjut tentang masalah ini ada dalam al-Quran dan as-Sunnah yang berkenaan dengan permasalahan tersebut."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahzab ayat 45: Allah menyebutkan karunia-Nya atas Rasul ﷺ dan bagi orang-orang yang beriman dengan berkata : Wahai Nabi, sungguh Kami mengutusmu kepada manusia sebagai saksi bagi umatmu pada hari kiamat yang bahwasanya engkau telah menyampaikan kerisalahan, dan sebagai saksi bagi umat-umat yang sebelummu bahwasanya para rasul mereka telah menyampaikan kerisalahan, dan engkau adalah pemebri kabar gembira bagi orang-orang yang beriman, pemberi petunjuk menuju surga yang Allah ridhai, dan engkau juga sebagai pemberi peringatan bagi yang kufur dan mendustakan serta bermaksiat yang akan mendatangkan balasan yang buruk; Karena sebab penolakan mereka dan pengingkaran mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sifat yang Allah sebutkan untuk Nabi shallallahu 'alaihi wa sallam dalam ayat di atas merupakan maksud dari risalah Beliau, inti dan ushul(dasar)nya; di mana Allah telah mengistimewakan Beliau dengannya. Sifat-sifat itu adalah: - Syahid (sebagai saksi), yakni sebagai saksi bagi umatnya terhadap hal yang mereka kerjakan, baik atau buruk (lihat surah Al Baqarah: 143 dan An Nisaa’: 41). Beliau adalah saksi yang adil dan diterima. - Mubassyir (pemberi kabar gembira). Hal ini menghendaki untuk disebutkan siapa yang mendapatkan kabar gembira, apa bentuk kabar gembiranya dan amal apa yang dapat mendatangkan kabar gembira itu. Orang yang mendapat kabar gembira itu adalah kaum mukmin yang bertakwa, yang menggabung antara iman dan amal saleh serta meninggalkan maksiat. Di dunia mereka mendapatkan kabar gembira akan diberikan balasan segera dari sisi dunia maupun agama, sedangkan di akhirat mereka diberi kabar gembira dengan kenikmatan yang kekal. Adapun amal yang dapat mendatangkan kabar gembira itu adalah semua amal saleh; amal yang diperintahkan Allah dan Rasul-Nya, dan hal ini menghendaki disebutkan secara rinci amalan tersebut dan disebutkan berbagai perkara takwa. - Nadzir (pemberi peringatan). Hal ini pun sama menghendaki untuk disebutkan siapa yang diberikan peringatan, apa bentuk peringatannya dan amal apa yang mendatangkan peringatan itu. Orang-orang yang diberi peringatan itu adalah orang-orang kafir, orang-orang yang mendustakan dan pelaku maksiat, maka bagi mereka peringatan di dunia berupa hukuman dari sisi duniawi dan sisi agama akibat kebodohan dan kezalimannya, sedangkan di akhirat dengan azab yang menyakitkan dan azab yang berpanjangan. Sedangkan amal yang mendatangkan peringatan itu adalah semua amal maksiat, terutama sekali yang paling besarnya yaitu syirk dan kekufuran serta dosa-dosa besar lainnya. - Daa’i (penyeru kepada Allah), maksudnya Allah mengutus Beliau untuk menyeru manusia kepada Tuhan mereka dan mengajak untuk memasuki tempat istimewa-Nya (surga), serta memerintahkan mereka untuk beribadah kepada-Nya; di mana untuk itulah mereka diciptakan. Hal ini menghendaki agar tetap istiqamahnya seorang da’i dalam berdakwah, menyebutkan secara rinci apa yang dia dakwahkan dengan mengenalkan mereka kepada Tuhan mereka dengan sifat-sifat-Nya yang suci, menyucikan-Nya dari sesuatu yang tidak layak dengan keagungan-Nya, mengajak mereka mentauhidkan-Nya, mengajak mereka kepada ushul (dasar-dasar) syariat Islam dan furu’nya, berdakwah dengan cara yang lebih dekat dan menyampaikan maksudnya, melihat keadaan mad’u (yang didakwahi), mengikhlaskan dakwah kepada Allah, tidak kepada dirinya dan untuk membesarkan dirinya sebagaimana hal itu terkadang menimpa orang yang terjun dalam dakwah, dan itu semua tentunya dengan izin Allah Ta’ala baginya dalam berdakwah, dan dengan perintah, iradah (keinginan) dan qadar-Nya. - Siraaj muniir (sebagai pelita yang menerangi). Hal ini menunjukkan, bahwa umat manusia ketika itu berada dalam kegelapan yang besar dan kebodohan yang besar, dan tidak ada cahaya untuk menyinarinya serta pengetahuan yang meneranginya sampai Allah mengutus Nabi-Nya yang mulia, maka melalui Beliau Allah menyinari kegelapan ketika itu, manusia menjadi tahu mana yang benar dan mana yang salah, dan melalui Beliau Allah menunjuki orang-orang yang tersesat ke jalan yang lurus. Maka orang-orang yang bersikap lurus semakin jelas jalan mereka, lalu mereka berjalan di belakang imam yang mulia ini (Rasulullah shallallahu 'alaihi wa sallam), melalui Beliau mereka mengenal mana yang baik dan mana yang buruk, siapa orang yang bahagia dan siapa orang yang sengsara, dan melalui Beliau mereka dapat mengenal Tuhan mereka, mengenal dengan sifat-sifat-Nya yang terpuji, perbuatan-perbuatan-Nya yang lurus dan hukum-hukum-Nya yang tepat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 45",
    "description": "45-46. Usai menjelaskan agungnya rahmat yang Allah berikan kepada orang beriman, Allah lalu menjelaskan fungsi pengutusan nabi Muhammad. Wahai nabi Muhammad! sesungguhnya kami mengutusmu kepada seluruh umat manusia untuk menjadi saksi kebenaran agama islam dan agama yang dibawa para rasul sebelum kamu, pembawa kabar gembira bagi mereka yang beriman kepada Allah dan rasul-rasul-Nya serta beramal saleh, dan pemberi peringatan kepada orang-orang yang tidak menerima ajaran Allah, dan untuk menjadi penyeru kepada agama Allah dengan izin-Nya, agar manusia meninggalkan kebatilan, dan kami juga mengutusmu sebagai cahaya yang menerangi jalan hidup manusia"
  }
]