[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sampaikanlah berita gembira (wahai nabi) kepada orang-orang yang beriman bahwa mereka mendapatkan pahala yang besar dari Allah, yaitu kebun-kebun di surga."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "47. Dan kabarkan kepada orang-orang yang beriman kepada Allah yang melaksanakan syariat-Nya dengan sesuatu yang menyenangkan mereka, bahwa mereka mendapat karunia yang agung dari Allah -Subḥānahu-, yang mencakup pertolongan untuk mereka di dunia dan kemenangan di Akhirat dengan masuk Surga."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "47. Dan berilah kabar gembira bagi orang-orang beriman dari Allah berupa pahala yang besar dan kenikmatan yang banyak yang mengalahkan pahala bagi umat-umat terdahulu. Ini merupakan keistimewaan yang Allah berikan kepada umat ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "47. Wahai Nabi, berikanlah kabar gembira kepada orang-orang mukmin yang senantiasa berbuat jujur, bahwa mereka akan mendapatkan ganjaran agung atas amal baik mereka berupa surga. Ayat ini turun ketika Allah menurunkan surat Al-fath ayat 2 dan ayat 4."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sampaikanlah kabar gembira kepada orang-orang mukmin bahwa sesungguhnya bagi mereka karunia yang besar dari Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "47. Sedangkan FirmanNya, “Dan sampaikanlah berita gembira kepada orang-orang Mukmin, bahwa mereka memndapatkan karunia yang sangat besar dari Allah,” pada kalimat ini dijelaskan mengenai orang yang diberi kabar gembira, mereka adalah orang-orang Mukmin. Dan ketika hanya iman sendirian yang disebutkan, maka amal-amal shalih termasuk di dalamnya. Dan (di sini juga) disebutkan sesuatu yang dijadikan berita gembira, yaitu karunia yang sangat besar. Maksudnya, karunia yang sangat agung lagi mulia yang nilainya tak ternilai, berupa kemenangan di dunia, hidayah bagi hati, ampunan terhadap dosa-dosa, dihilangkannya berbagai kesempitan, banyaknya rizki yang berlimpah ruah, tercapainya kenikmatan-kenikmatan yang menyenangkan, meraih keridhaan Rabb, pahala dariNya dan selamat dari murka dan siksaanNya. Hal ini termasuk faktor yang mempergiat orang-orang yang aktif beramal (amilin), kalau dijelaskan kepada mereka pahala dari Allah atas amal-amal mereka, yang dengannya mereka lebih bersemangat untuk terus menelusuri jalan yang lurus. Ini merupakan bagian dari hikmah syariat Islam, sebagaimana pula, bahwa di antara hikmahnya adalah dia menjelaskan, dalam rangka menakut-nakuti dengannya adanya siksaan-siksaan yang diakibatkan oleh perbuatan yang diperingatkan, sehingga menjadi pendongkrak untuk bisa menahan diri dari hal-hal yang diharamkan Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahzab ayat 47: Allah memerintahkan Nabi-Nya ﷺ untuk menyampaikan kepada hamba Allah yang beriman yang mereka beriman kepada Allah, dan mengikutinya; Bahwasanya mereka akan mendapatkan karunia yang besar, yaitu keridhaan Allah kepada mereka dan dimasukkannya mereka ke dalam surga yang penuh kenikmatan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Disebutkan dalam ayat ini orang-orang yang mendapatkan kabar gembira, yaitu orang-orang yang beriman, dan jika disebut beriman secara tersendiri, maka masuk pula ke dalamnya amal saleh. Demikian pula disebutkan bentuk kabar gembiranya, yaitu karunia yang besar yang sulit diukur, seperti kemenangan di dunia, hidayah bagi hati, diampuni dosa, dihilangkan derita, diperbanyak rezeki, memperoleh nikmat yang menyenangkan, mendapatkan keridhaan Tuhan mereka dan pahala-Nya serta selamat dari kemurkaan dan siksa-Nya. Hal ini termasuk sesuatu yang menyemangatkan orang-orang yang beramal, di mana hal tersebut dapat membantu mereka untuk menempuh jalan yang lurus. Ini termasuk di antara sejumlah hikmah-hikmah syara’, sebagaimana termasuk hikmahnya pula adalah ketika sedang mentarhib (menakut-nakuti) disebutkan hukumannya agar membantu seseorang meninggalkan yang dilarang Allah itu. Yaitu surga."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 47",
    "description": "Dan sampaikanlah kabar gembira kepada orang-orang mukmin yang mantap keimanannya bahwa sesungguhnya bagi mereka karunia yang besar dari Allah, yakni surga yang penuh kenikmatan (lihat juga: y'nus/10: 26 dan asy-syu'ar'/42: 22). 48. Dan janganlah engkau, wahai nabi Muhammad, menuruti keinginan orang-orang kafir dan orang-orang munafik yang menolak dan mengejek ajaran agama yang kaubawa itu. Janganlah engkau hiraukan gangguan mereka, bersabarlah dalam mengemban tugas, dan bertawakAllah kepada Allah dalam semua urusanmu. Dan cukuplah Allah sebagai pelindung dari semua yang engkau takutkan, termasuk dari gangguan mereka."
  }
]