[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "janganlah engkau (wahai Rasul) menaati ucapan orang kafir atau munafik, biarkan gangguannya, hal itu jangan sampai menghalangimu untuk menyampaikan risalah. Percayalah kepada Allah dalam segala urusanmu dan bersandarlah kepadaNya, niscaya Dia mencukupkanmu dari apa yang membebanimu dari segala perkara dunia dan akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "48. Dan janganlah engkau menaati seruan orang-orang kafir dan orang-orang munafik untuk menghalang-halangi agama Allah, dan berpalinglah dari mereka, mudah-mudahan hal itu bisa menarik mereka untuk beriman kepada risalah yang engkau bawa. Dan bergantunglah kepada Allah dalam segala urusanmu, di antaranya dalam meminta pertolongan untuk mengalahkan musuh-musuhmu. Dan cukuplah Allah sebagai pelindung, kepada-Nya hamba-hamba bersandar dalam segala urusan mereka di dunia dan di Akhirat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "48. Dan janganlah kamu mentaati orang-orang kafir dan munafik; selisihilah mereka dan jangan pedulikan gangguan mereka. Tetaplah bertawakkal kepada Allah, karena Dia cukup bagimu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "48. وَلَا تُطِعِ الْكٰفِرِينَ وَالْمُنٰفِقِينَ (Dan janganlah kamu menuruti orang-orang yang kafir dan orang-orang munafik itu) Dalam apa yang mereka tawarkan kepadamu berupa kemunafikan dalam beragama. وَدَعْ أَذَىٰهُمْ(janganlah kamu hiraukan gangguan mereka) Yakni jangalah kamu pedulikan gangguan yang datang dari mereka karena dakwah yang kamu emban menuju jalan Allah dan akibat ketegasanmu dalam menghadapi musuh-musuh-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "48. Wahai Nabi, janganlah engkau turuti orang-orang kafir dan munafik yang melanggar syariatmu. Jangan engkau hiraukan dan engkau pedulikan gangguan mereka. Serahkanlah urusanmu kepada Allah, cukup Dia sebagai penghulu segala sesuatu. Allah telah menekankan ayat ini dalam permulaan surat yang menunjukkan respon Nabi atas ganguan dan perkataan orang menafik. Penekanan ini juga untuk menyelamatkan syariat dari pencampuradukan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Janganlah kamu menuruti orang-orang kafir dan orang-orang munafik itu, biarkan gangguan mereka} berpalinglah dari ucapan mereka dan apa yang menyakiti kalian dan janganlah disibukkan oleh hal itu {dan bertawakallah kepada Allah. Cukuplah Allah sebagai pelindung"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "48. Oleh karena di sana ada sekelompok manusia yang siap melakukan tindakan menghalang-halangi para penyeru kepada Allah, dari kalangan para rasul dan para pengikutnya, yaitu orang-orang munafik yang berpura-pura dan menampakkan kesamaan iman, padahal mereka sebenarnya kafir lagi durjana dalam batinnya, dan juga orang-orang yang kafir lahir dan batin, maka Allah melarang rasulNya patuh kepada mereka dan mewanti-wantinya dari perbuatan itu, seraya berfirman, “Dan janganlah kamu menuruti orang-orang yang kafir dan orang-orang munafik itu.” Yaitu, dalam setiap perkara yang dapat merintangi jalan Allah. Namun perintah ini tidak menuntut untuk menyakiti mereka; akan tetapi jangan kamu taat kepada mereka, “dan janganlah kamu menghiraukan gangguan mereka,” karena yang demikian itu dapat menarik mereka dan menjadi motivator bagi mereka untuk menerima Islam dan untuk menahan diri mereka untuk menyakitinya dan keluarganya. “Dan bertawakallah kepada Allah,” dalam menyempurnakan tugasmu dan mengabaikan musuh-musuhmu. “Dan cukuplah Allah sebagai Pelindung.” Diserahkan kepadaNya semua permasalahn yang penting, karena Dia yang akan mengurusinya dan memudahkannya bagi hambaNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahzab ayat 48: Allah memerintahkan Nabi-Nya ﷺ agar tidak bersama orang-orang kafir dan munafik dalam mencukupkan (berhenti) dari mendakwahkan kerisalahannya, dan Allah juga memerintahkan agar meninggalkan celaan mereka dan juga bersabar atas celaan mereka. Atau agar betawakal kepada Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Oleh karena di sana ada orang-orang yang menghalangi orang-orang yang mengajak kepada Allah (para rasul dan para pengikutnya), yaitu kaum munafik yang menampakkan keimanan di luar, padahal batinnya kafir lagi fasik. Ada pula orang-orang yang kafir lahir maupun batin, maka Allah melarang Rasul-Nya menaati mereka dan menyuruhnya berhati-hati. Dalam setiap perkara yang menghalangi dari jalan Allah. Akan tetapi sikap ini tidak menghendaki untuk menyakiti mereka, bahkan tetap tidak menaati dan tidak menghiraukan gangguan mereka, karena sikap ini dapat menarik mereka, mengajak mereka menerima Islam, dan membuatnya tidak menyakiti dirinya dan keluarganya. Dalam hal menyempurnakan urusanmu dan mengecewakan musuh-musuhmu. Dia akan mengurusnya dan memudahkannya kepada hamba-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 48",
    "description": "Dan janganlah engkau, wahai nabi Muhammad, menuruti keinginan orang-orang kafir dan orang-orang munafik yang menolak dan mengejek ajaran agama yang kaubawa itu. Janganlah engkau hiraukan gangguan mereka, bersabarlah dalam mengemban tugas, dan bertawakAllah kepada Allah dalam semua urusanmu. Dan cukuplah Allah sebagai pelindung dari semua yang engkau takutkan, termasuk dari gangguan mereka. 49. Bertawakal kepada Allah setelah berusaha secara maksimal merupakan cara aman bagi orang yang beriman agar tidak putus asa. Bila seseorang telah berusaha mempertahankan perkawinan, namun pada akhirnya mesti berakhir dengan perceraian, maka hendaklah dia kembalikan persoalan tersebut kepada Allah yang maha bijaksana dalam ketetapan-Nya. Wahai orang-orang yang beriman! apabila kamu menikahi perempuan-perempuan mukmin yang mantap imannya, kemudian kamu ceraikan mereka sebelum kamu mencampurinya, yakni melakukan hubungan intim suami istri dengannya, maka tidak ada masa idah atas mereka yang perlu kamu perhitungkan. Namun berilah mereka mut'ah, yaitu imbalan materi sebagai penghibur hati akibat percerain, dan lepaskan serta ceraikan-lah mereka itu dengan cara yang sebaik-baiknya agar mereka dapat menempuh jalan hidup yang terbaik untuk mereka."
  }
]