[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang yang membenarkan Allah dan rasulNya serta melaksanakan SyariatNya, bila kalian melakukan akad dengan seorang wanita dan kalian belum menyentuhnya kemudian menceraikannya sebelum kalian menggaulinya, maka kalian tidak memilki hak iddah yang kalian perhitungkan atasnya, berikanlah dari harta kalian pemberian Cuma-Cuma sehingga dia bisa mengambil manfaat darinya menurut kemampuan kalian dan untuk menghibur kesedihannya, biarkanlah jalannya dengan tetap menutupi aibnya dengan cara yang baik tanpa menyakiti dan memudaratkan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "49. Wahai orang-orang yang beriman kepada Allah dan mengerjakan apa yang disyariatkan-Nya bagi mereka, jika kalian telah melakukan akad nikah dengan perempuan-perempuan beriman, kemudian kalian menceraikan mereka sebelum kalian menggauli mereka, maka tidak wajib idah atas mereka bagimu, baik dengan hitungan haid atau hitungan bulan, sebab rahim mereka pasti bersih karena tidak ada hubungan badan dengan mereka. Dan berilah mereka mut'ah (hadiah) dari harta-harta kalian sebatas kemampuan kalian, sebagai ganti atas perasaan mereka yang sedih akibat perceraian itu dan biarkanlah mereka kembali kepada keluarga mereka tanpa disakiti."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "49. يٰٓأَيُّهَا الَّذِينَ ءَامَنُوٓا۟ إِذَا نَكَحْتُمُ الْمُؤْمِنٰتِ (Hai orang-orang yang beriman, apabila kamu menikahi perempuan-perempuan yang beriman) Yakni jika kalian mengucapkan akad pernikahan dengan mereka. ثُمَّ طَلَّقْتُمُوهُنَّ مِن قَبْلِ أَن تَمَسُّوهُنَّ(kemudian kamu ceraikan mereka sebelum kamu mencampurinya) Yakni sebelum kalian berjima’ dengan mereka. Dan Allah mengibaratkannya dengan kata ‘menyentuh mereka’ فَمَا لَكُمْ عَلَيْهِنَّ مِنْ عِدَّةٍ تَعْتَدُّونَهَا ۖ(maka sekali-sekali tidak wajib atas mereka ‘iddah bagimu yang kamu minta menyempurnakannya) Dan ini merupakan masalah yang tidak ada perselisihan di dalamnya. Allah menyandarkan masalah ini kepada kaum lelaki untuk menunjukkan bahwa ‘iddah adalah hak bagi kaum lelaki yang mengharuskan wanita-wanita tersebut untuk menjalankan masa ‘iddah ini. فَمَتِّعُوهُنَّ(Maka berilah mereka mut’ah) Wanita yang diceraikan sebelum dicampuri namun telah ditentukan jumlah maharnya maka ia berhak mendapat setengah dari mahar itu. Dan jika belum ditentukan jumlah maharnya maka ia berhak mendapat mut’ah sesuai dengan ayat ini. Adapun wanita yang ditinggal mati suaminya apabila mati setelah selesai mengucapkan akad pernikahan dengannya dan belum mencampurinya maka kematiannya ini sama hukumnya dengan orang yang telah mencampuri istrinya, sehingga wanita ini harus melewati masa ‘iddah selama empat bulan sepuluh hari berdasarkan ijma’ para ulama. وَسَرِّحُوهُنَّ سَرَاحًا جَمِيلًا(dan lepaskanlah mereka itu dengan cara yang sebaik-baiknya) Yakni izinkanlah mereka untuk keluar dari rumah kalian jika mereka telah memasuki rumah itu. Sebab kalian tidak memiliki hak ‘iddah yang harus mereka lalui. Dan maksud dari (سراح جميل) adalah melepasnya tanpa menyakitinya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "49. Wahai orang-orang yang beriman, apabila kalian berakad untuk menikahi perempuan-perempuan beriman. Kemudian kalian mentalak mereka sebelum melakukan hubungan suami istri menurut pendapat para ahli fiqih madzhab Hanafi, maka tidak ada iddah bagi mereka. Iddah adalah sesuatu yang berbilang. Mereka bisa langsung menikah setelah kalian ceraikan. Namun berikanlah mereka uang mut’ah sebagai pesangon dengan jumlah yang secukupnya. Demikian itu apabila pihak laki-laki belum mengucapkan jumlah maharnya, dan apabila telah mengucapkan jumlah maharnya maka pesangon itu adalah separo dari jumalah mahar yang telah disampaikan. Lepaskanlah mereka dengan baik tanpa meninggalkan kemadhorotan bagi mereka, atau tanpa menyakiti mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, apabila kalian menikahi orang-orang mukmin perempuan, kemudian kalian menceraikan mereka sebelum kalian mencampurinya} bergumul dengan mereka {maka tidak ada masa iddah atas mereka} masa penantian perempuan {yang kalian hitung} yang kalian hitung masa haid dan bulan-bulannya {Maka berilah mereka mutah} maka berilah mereka harta yang bisa mereka nikmati sesuai kemampuan kalian {dan lepaskanlah mereka dengan cara yang sebaik-baiknya} dan bebaskanlah jalan mereka dengan baik tanpa memberikan mudharat dan rasa sakit"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "49. Allah menyampaikan kepada orang-orang yang beriman, bahwa mereka apabila telah menikahi wanita-wanita beriman kemudian menceraikannya sebelum mencampuri mereka, maka mereka tidak wajib beriddah dalam hal ini yang dituntut oleh suami terhadap mereka; dan Allah memerintahkan kepada mereka untuk memberikan mut’ah dalam kondisi seperti ini berupa sebagian harta benda yang bisa menjadi penguat perasaan-perasaan (luka hati) mereka karena mereka dicerai; dan Allah memerintahkan juga untuk mencerai mereka dengan cara yang baik, tidak saling memusuhi, tidak saling memaki, tidak saling menuntut dan lain sebagainya. 1. Dengan ayat ini diambil dalil bahwa talak (perceraian) tidak terjadi kecuali setelah nikah. Maka kalau seorang laki-laki menceraikannya sebelum menikahinya, atau menggantungkan perceraiannya pada pernikahannya, maka talak tidak terjadi, karena Firman Allah, “Apabila kamu menikahi perempuan-perempuan yang beriman, kemudian kamu menceraikan mereka.” Allah menetapkan talak sesudah terjadi pernikahan. Ini menunjukkan bahwa talak sebelum nikah tidak mempunyai tempat (pembahasan). Dan apabila talak, yang pada hakikatnya adalah perceraian penuh dan pengharaman yang utuh itu tidak terjadi sebelum nikah, maka pengharaman yang tidak sempurna karena kasus zhihar atau ila’ dan yang serupa dengannya adalah tentu lebih utama dan lebih pasti tidak akan terjadi sebelum nikah. Demikianlah menurut salah satu pendapat ulama yang paling shahih. 2. Dan ayat tersebut dijadikan dalil pula atas diperbolehkannya talak, sebab Allah mengabarkan tentang orang-orang Mukmin dengan nada tidak mencela mereka karenanya, dan Dia juga tidak mencerca mereka, padahal ayat tersebut dimulai dengan sapaan kepada orang-orang Mukmin. 3. Dan ayat tersebut juga (dijadikan dalil) atas diprbolehkannya talak sebelum terjadinya hubungan suami istri, sebagaimana dikatakan dalam ayat yang lain, \"Tidak ada kewajiban membayar (mahar) atas kamu, jika kamu menceraikan istri-istrimu sebelum kamu bercampur dengan mereka\" (Al-Baqarah:236). 4. Dan ayat tersebut menunjukkan bahwa istri yang dicerai sebelum dicampuri itu tidak ada kewajiban beriddah, akan tetapi hanya dengan terjadinya talak tersebut ia boleh langsung menikah, tanpa ada penghalang yang menghalanginya. 5. Dan ayat tersebut menunjukkan bahwa ia wajib beriddah (jika perceraian terjadi) sesudah adanya hubungan suami istri. Lalu apakah yang dimaksud dukhul (masuk, mencampuri) dan bersentuhan disini adalah jimak (persetubuhan), sebagaimana telah menjadi keputusan ijma’? ataukah khulwah (berdua—duaan) itu (juga termasuk bermakna dukhul) sekalipun tidak terjadi persetubuhan dengannya, sebagaimana difatwakan oleh para Khulafa’ Rasyidin. Inilah pendapat yang shahih. Maka ketika dia masuk mengunjunginya, baik dia menyetubuhinya ataupun tidak, apabila ia telah berdua-duaan dengannya, maka istri wajib beriddah. 6. Dan ayat tersebut menjadi dalil bahwa perempuan yang dicerai sebelum terjadi hubungan intim hendaklah diberi mut’ah (semacam cendra mata) oleh mantan suami yang mampu menurut kadar kemampuannya dan suami yang kurang mampu pun menurut kemampuannya. Hal ini dilakukan apabila mahar pernikahan belum ditetapkan. Akan tetapi kalau mantan istri ini sudah ditetapkan maharnya, maka kalau dicerai sebelum adanya hubungan intim, maka maharnya dibagi dua, dan itu sudah mencukupinya (mewakili) mut’ah. 7. Dan ayat tersebut menjadi dalil bahwa seharusnya suami yang menceraikan istrinya sebelum mencampuri atau telah mencampurinya harus mencerikannya secara baik-baik, perceraian yang kedua belah pihak saling memuji, dan tidak boleh dengan cara yang tidak baik. Sebab hal yang demikian itu (mencerai tidak dengan cara yang terbaik) mengandung keburukan yang ditimbulkannya, seperti masing-masing pihak akan saling mencela dan menjatuhkan pihak lain lebih banyak lagi. 8. Dan ayat tersebut juga menunjukkan bahwa iddah itu adalah hak suami, berdasarkan FirmanNYa “maka sekali-kali tidak wajib atas mereka beribadah untukmu.” Mafhumnya (makna tersiratnya) menunjukkan bahwa kalau seandainya sang suami menceraikannya setelah adanya hubungan intim, maka dia mempunyai hak iddah atas istrinya. 9. Dan ayat tersebut menunjukkan bahwa istri yang dipisah karena wafat hendaklah melakukan iddah secara pasti, karena Firman Allah, “Kemudian kamu menceraikan mereka.” (Al-Ayat). 10. Dan ayat tersebut menunjukkan bahwa sesungguhnya istri-istri selain yang belum dicampuri, dari kalangan yang dicerai karena suami eninggal dunia atau masih hidup, maka mereka wajib melakukan iddah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahzab ayat 49: Wahai orang-orang yang beriman kepada Allah dan membenarkan Rasul-Nya serta beramal dengan amalan syariat, jika kalian memiliki akad kepada istri-istri kalian yaitu ikatan pernikahan, kemudian kalian mentalak mereka sebelum bercampur dengan istri-istri kalian, maka tidak ada iddah yang engkau wajibkan bagi mereka. Dan hak mereka (istri-istri kalian) untuk dapat menikah dengan selain dari kalian, akan tetapi kalian mestilah memberikan harta kalian kepada mereka sebagai rasa untuk menyenangkan mereka, dan juga sebagai kelembutan bagi talak mereka, kemudian tinggalkan dengan penuh kebaikan dengan tanpa kerusakan dan kedzaliman bagi mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan kepada kaum mukmin, bahwa apabila mereka menikahi wanita mukminah, lalu mereka menalaknya sebelum mereka campuri, maka tidak ada masa iddah atas istri mereka yang perlu mereka perhitungkan, dan Dia memerintahkan mereka memberikan mut’ah (pemberian yang menyenangkan hati) dan agar perceraian dilakukan dengan cara yang baik tanpa pertengkaran, caci-maki, saling menuntut, dan lain-lain. Ayat ini juga menunjukkan bahwa talak hanyalah terjadi setelah menikah, jika seseorang menalak sebelum menikahinya atau menggantungkan talaknya jika menikahinya, maka tidaklah jatuh, dan bahwa yang demikian (menalak) sebelum menikah bukanlah pada tempatnya. Jika talak yang merupakan pisah dan pengharaman secara sempurna tidak terjadi sebelum nikah, maka pengharaman yang kurang, seperti zhihar atau iila’ lebih tidak jatuh lagi sebelum nikah. Ayat ini juga menunjukkan bolehnya talak, karena Allah Subhaanahu wa Ta'aala memberitahukan kepada kaum mukmin dengan menyebutkan tanpa mencelanya di samping awal ayatnya menerangkan kaum mukmin. Demikian pula menunjukkan bolehnya talak sebelum dicampuri, dan bahwa wanita yang ditalak sebelum dicampuri tidak ada iddahnya, bahkan dengan ditalaknya membolehkan si wanita menikah lagi, dan bahwa iddah hanyalah dilakukan setelah dicampuri. Kemudian apakah maksud dukhul dan masis (dicampuri) adalah jima’ sebagaimana yang telah disepakati atau termasuk pula berkhalwat(berduaan) meskipun tidak sampai jima’ sebagaimana difatwakan para khalifah rasyidin, dan inilah yang benar. Oleh karena itu, barang siapa yang dukhul (mendatangi) kepada istri barunya baik ia menjima’i atau tidak apabila ia telah berduaan dengannya, maka wajib bagi istri jika ditalak menjalani masa iddah. Ayat ini juga menunjukkan, bahwa wanita yang ditalak sebelum dicampuri diberi mut’ah sesuai kemampuan suami, tentunya hal ini apabila si suami belum menentukan mahar, jika sudah menentukan, maka apabila si suami menalaknya sebelum dukhul, ia berikan setengah mahar, dan hal itu sudah cukup tanpa perlu memberi mut’ah lagi. Demikian pula menunjukkan bahwa sepatutnya orang yang mencerai istrinya sebelum dukhul atau setelahnya berpisahnya dengan cara yang baik dan terpuji, karena jika tidak demikian akan ada keburukan yang timbul yaitu saling cela-mencela. Ayat ini juga menunjukkan, bahwa iddah yang dijalani istri adalah hak suami berdasarkan firman-Nya, “Famaa lakum ‘alaihinna min ‘iddah” (maka tidak ada masa iddah atas mereka yang perlu kamu perhitungkan) dan mafhumnya menunjukkan bahwa jika suami menalaknya setelah dicampuri, maka ia punya hak yang harus dijalani istri yaitu masa iddah, dan menunjukkan pula bahwa berpisah karena wafat mengharuskan istri menjalani masa iddah secara mutlak. Yang dimaksud dengan mut'ah di sini pemberian untuk menyenangkan hati isteri yang diceraikan sebelum dicampuri. Tentunya hal ini jika si suami belum menyebutkan maharnya, jika sudah, maka untuknya setengah dari mahar yang disebutkan, demikian yang dikatakan Ibnu Abbas, dan itulah yang dipegang oleh Imam Syafi’i. Yakni tanpa menimpakan madharrat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 49",
    "description": "Bertawakal kepada Allah setelah berusaha secara maksimal merupakan cara aman bagi orang yang beriman agar tidak putus asa. Bila seseorang telah berusaha mempertahankan perkawinan, namun pada akhirnya mesti berakhir dengan perceraian, maka hendaklah dia kembalikan persoalan tersebut kepada Allah yang maha bijaksana dalam ketetapan-Nya. Wahai orang-orang yang beriman! apabila kamu menikahi perempuan-perempuan mukmin yang mantap imannya, kemudian kamu ceraikan mereka sebelum kamu mencampurinya, yakni melakukan hubungan intim suami istri dengannya, maka tidak ada masa idah atas mereka yang perlu kamu perhitungkan. Namun berilah mereka mut'ah, yaitu imbalan materi sebagai penghibur hati akibat percerain, dan lepaskan serta ceraikan-lah mereka itu dengan cara yang sebaik-baiknya agar mereka dapat menempuh jalan hidup yang terbaik untuk mereka. 50. Usai menjelaskan persoalan perceraian yang berlaku secara umum pada ayat-ayat yang lalu, pada ayat berikut Allah menjelaskan hukum pernikahan yang berlaku secara khusus bagi nabi Muhammad. Wahai nabi Muhammad! sesungguhnya kami telah menghalalkan bagimu istri-istrimu yang telah engkau berikan maskawinnya, dan kami halalkan juga bagimu hamba sahaya yang engkau miliki, termasuk apa yang engkau peroleh dalam peperangan yang dikaruniakan Allah untukmu, berupa harta maupun wanita yang ditinggalkan oleh musuh. Dan kami halalkan pula untukmu menikahi anak-anak perempuan dari saudara laki-laki bapakmu, anak-anak perempuan dari saudara perempuan bapakmu, anak-anak perempuan dari saudara laki-laki ibumu, dan anak-anak perempuan dari saudara perempuan ibumu yang turut hijrah bersamamu, dan kami halalkan pula untukmu menikahi perempuan mukmin yang menyerahkan dirinya kepada nabi untuk dinikahi tanpa mahar, kalau nabi ingin menikahinya. Kami gariskan hukum demikian sebagai kekhususan bagimu, wahai nabi Muhammad, bukan untuk semua orang mukmin selain dirimu. Kami telah mengetahui apa yang kami wajibkan kepada mereka, orang-orang mukmin, tentang istri-istri mereka dan hamba sahaya yang mereka miliki. Kami tentukan hukum perkawinan yang demikian itu kepadamu tiada lain agar tidak menjadi kesempitan dan beban bagimu, wahai nabi, dalam menjalankan tugas kenabian. Dan Allah maha peng-ampun kepada hamba-Nya yang bertobat, maha penyayang dengan karunia-Nya yang tiada terbatas."
  }
]