[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Nasabkanlah anak-anak angkat kalian itu kepada bapak-bapak mereka. Itu lebih lurus dan lebih adil di sisi Allah. Bila kalian tidak mengetahui bapak-bapak mereka yang sebenarnya, maka dalam kondisi itu panggillah mereka dengan dasar persaudaraan agama yang terjadi antara kalian, karena mereka adalah saudara-saudara kalian dan maula-maula kalian dalam agama. Tiada dosa atas kalian atas kesalahan yang terjadi dari kalian tanpa kesengajaan, akan tetapi Allah akan menyiksa bila kalian sengaja melakukan hal itu. Allah Maha Pengampun bagi siapa yang salah, Maha Penyayang bagi siapa yang bertaubat dari dosanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Nasabkan siapa yang kalian anggap sebagai anak-anak kalian kepada bapak-bapak mereka yang sesungguhnya. Menasabkan mereka kepada bapak-bapak mereka adalah keadilan di sisi Allah. Apabila kalian tidak tahu bapak-bapak mereka untuk dinasabkan kepada mereka, maka mereka adalah saudara kalian seagama dan mantan budak-budak kalian. Maka panggillah mereka dengan ‘Wahai saudaraku’ atau ‘Wahai anak pamanku’, dan tidak berdosa bagi kalian bila salah seorang di antara kalian salah dengan tidak sengaja menasabkan seseorang kepada yang bukan bapaknya, akan tetapi kalian berdosa apabila sengaja mengucapkan hal itu. Allah Maha Pengampun bagi orang yang bertobat kepada-Nya antara hamba-hamba-Nya dan Maha Penyayang terhadap mereka dengan tidak menghukum mereka karena suatu kesalahan yang tidak disengaja."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "5. Nisbahkanlah anak-anak angkat kalian kepada ayah kandung mereka yang sesungguhnya, sebab menisbahkan anak kepada ayah kandung adalah hukum yang paling adil. Dan jika kalian tidak mengetahui siapa ayah kandung mereka, maka anak-anak angkat itu adalah saudara-saudara kalian seagama. Tidak berdosa bagi kalian atas kesalahan yang dahulu kalian lakukan itu, namun dosa bagi kalian adalah ketika kalian sengaja menisbahkan mereka kepada selain ayah kandung mereka setelah kalian mengetahui hukum tersebut. Allah Maha Pengampun dan Maha Pengasih bagi orang yang tersalah dan bagi orang yang bertaubat. Aisyah, istri Rasulullah meriwayatkan bahwa Abu Hudzaifah -dia termasuk sahabat yang ikut perang Badar bersama Rasulullah- mengangkat Salim sebagai anak angkat dan menikahkahnya dengan keponakannya yang bernama Hindun binti al-Walid bin ‘Utbah -yang merupakan mantan budak seorang wanita Anshar-, sebagaimana Rasulullah menjadikan Zaid sebagai anak angkat. Pada masa jahiliyah, orang yang mengangkat seorang anak angkat akan dipanggil dengan menisbahkannya kepada ayah angkatnya dan dapat mewarisi harta warisannya; hingga turun firman Allah: ‘Panggillah mereka dengan memakai nama bapak-bapak kandung mereka’. Maka datanglah Sahlah kepada Rasulullah…. -lalu disebutkanlah haditsnya-. (Shahih al-Bukhari 7/365, no. 4000, kitab peperangan-peperangan Rasulullah). Dan Abdullah bin Umar meriwayatkan bahwa Zaid bin Haritsah, maula [mantan budak] Rasulullah, pasti dahulu kami memanggilnya Zaid bin Muhammad; hingga turunlah ayat al-Qur’an: ‘Panggilah mereka (anak-anak angkat itu) dengan (memakai) nama bapak-bapak kandung mereka; itulah yang lebih adil pada sisi Allah’. (Shahih al-Bukhari 8/377, kitab tafsir surat al-Ahzab, bab (ayat ini) no. 4782. Dan shahih Muslim 4/884, no. 2425, kitab keutamaan-keutamaan para sahabat, bab keutamaan-keutamaan Zaid bin Haritsah)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. ادْعُوهُمْ لِاٰبَآئِهِمْ (Panggilah mereka (anak-anak angkat itu) dengan (memakai) nama bapak-bapak mereka) Yakni bapak-bapak kandung mereka. Sebutlah nasab mereka dengan nasab bapak-bapak kandung mereka, dan jangan kalian sebut orang lain. هُوَ أَقْسَطُ عِندَ اللهِ ۚ( itulah yang lebih adil pada sisi Allah) Yakni lebih adil daripada perkataan kalian bahwa ini adalah anak si fulan, padahal ia bukan anaknya. فَإِن لَّمْ تَعْلَمُوٓا۟ ءَابَآءَهُمْ فَإِخْوٰنُكُمْ فِى الدِّينِ وَمَوٰلِيكُمْ ۚ( dan jika kamu tidak mengetahui bapak-bapak mereka, maka (panggilah mereka sebagai) saudara-saudaramu seagama dan maula-maulamu) Maka panggil-lah ia “hai saudara dan maulaku” dan janganlah memanggilnya anak si fulan jika kalian tidak mengetahui siapa bapak kandungnya yang sesungguhnya. وَلَيْسَ عَلَيْكُمْ جُنَاحٌ فِيمَآ أَخْطَأْتُم بِهِۦ(Dan tidak ada dosa atasmu terhadap apa yang kamu khilaf padanya) Yakni tidak ada dosa atas kalian dalam kesalahan yang kalian lakukan tanpa sengaja. وَلٰكِن(tetapi (yang ada dosanya)) Dosa itu. مَّا تَعَمَّدَتْ قُلُوبُكُمْ ۚ( apa yang disengaja oleh hatimu) Yang mengucapkan nasab seseorang bukan kepada bapaknya, padahal kalian mengatahui bahwa itu perbuatan haram. Qatadah mengatakan: jika kamu memanggil seseorang dengan nasab yang bukan dari bapaknya, sedangkan kamu mengira itu adalah bapaknya maka tidak ada dosa bagimu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Nasabkanlah anak-anak kalian pada wali-wali mereka yang sebenarnya secara nasab, bukan kepada orang yang mengangkat anak, maka seorang anak dinasabkan kepada walinya yang asli adalah merupakan keadilan hukum, jika kalian tidak mengetahui wali mereka, maka saudara-saudara kalian seagamalah yang menjadi wali, dan kalian tidak menanggung dosa atas apa kejadian yang telah lalu, tetapi kalian bersalah dan berdosa ketika kalian dengan sengaja menasabkan mereka kepada yang bukan wali asli mereka, dan Allah Maha Pengampun bagi hambaNya yang bersalah, Maha Pengasih terhadap hambaNya yang bertaubat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Panggillah mereka dengan (nama) ayah mereka} nasabkanlah panggilan kalian kalian dengan (nama) ayah mereka {Itulah yang adil} yang adil {di sisi Allah. Jika kalian tidak mengetahui ayah mereka, maka (panggillah sebagai) saudara-saudara kalian} maka mereka adalah saudara-saudara kalian {seagama dan teman dekat kalian} orang-orang yang dibebaskan dari perbudakan {Tidak ada dosa} dosa dan kesalahan {atas kalian jika salah tentang itu, tetapi apa yang disengaja} yang disengaja {oleh hati kalian. Allah Maha Pengampun lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5. Kemudian Allah menegaskan kepada mereka untuk meninggalkan kondisi yang pertama yang mengandung perkataan batil, seraya berfirman, “Panggillah mereka,” maksudnya, anak-anak itu, “dengan memakai nama bapak-bapak mereka,” yang memperanakkkan mereka, “itulah yang lebih adil pada sisi Allah,” maksudnya, yang lebih adil, lebih lurus dan lebih berpetunjuk. “Dan jika kamu tidak mengetahui bapak-bapak mereka,” yang sebenarnya, “maka (panggillah mereka sebagai) saudara-saudaramu seagama dan maula-maulamu,” maksudnya, mereka adalah saudara-saudara kalian dalam agama Allah dan maula-maula kalian. Maka pergillah mereka dengan sebutan persaudaraan keimanan yang tulus dan maula-maula atas dasar itu. Jadi, meninggalkan seruan dengan menyebut nama orang yang menjadikan mereka anak angkat adalah keniscayaan, tidak boleh dilakukan. Sedangkan memanggil mereka dengan menyertakan nama bapak kandung mereka, jika diketahui, maka hendaknya mereka melakukan demikian. Dan jika mereka tidak mengetahuinya maka cukuplah memanggil mereka (dengan nama) yang telah dikenal pada mereka, yaitu saudara seagama dan hubungan maula. Maka jangan kalian mengira bahwa kondisi di mana kalian tidak mengetahui bapak kandung mereka menjadi nalasan bagi kalian untuk memanggil nmereka dengan nama orang yang menjadikan mereka anak angkat; sebab sesuatu yang dilarang tidak akan gugur disebabkan hal tersebut. “Dan tidak ada dosa atasmu terhadap apa yang kamu khilaf terhadapnya” secara tidak sengaja lidah salah seorang kalian memanggil mereka dengan nama orang yang menjadikannya sebagai anak angkat. Hal seperti ini tidak ada sanksi hukumnya; atau dia mengetahui ayahnya secara zahir lalu dia memanggilnya dengan menyertakan namanya, padahal sesungguhnya secara batin dia bukan bapaknya, maka tidak ada dosa baginya dalam hal seperti itu apabila terjadi khilaf (dan tidak sengaja). “Tetapi” DIa akan menghukum kalian disebabkan perkataan yang dilarang namun disengaja oleh hati kalian, “dan Allah Maha Pengampun lagiMaha Penyayang.” Dia mengampuni dan merahmati kalian; yang mana Dia tidak menghukum kalian atas apa yang sudah berlalu, dan Dia memaafkan kalian atas sesuatu yang tidak sengaja kalian ucapkan, dan Dia berbelas-kasih kepada kalian, di mana DIa menjelaskan kepada kalian hukum-hukum (aturan-aturanNYa) yang dapat memperbaiki agama dan dunia kalian. Maka segala puji bagiNYa."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahzab ayat 5: Allah memerintahkan agar mengembalikan nasab anak yang diangkat menjadi anak angkat kepada bapak-bapak mereka yang hakiki; Karena itulah yang paling adil, petunjuk yang sebenarnya, dan yang paling lurus. Jika tidak diketahui bapak-bapak mereka, maka anak-anak tersebut adalah sebagai saudara islam kalian dan kalian adalah pemeliharanya yang tiada dosa bagi kalian, dan jika terdapat kesalahan pada kalian, janganlah terus kalian ikuti. Sungguh Allah memiliki banyak ampunan bagi hamba-Nya dan Maha Penyayang bagi mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Imam Bukhari meriwayatkan dengan sanadnya yang sampai kepada Abdullah bin Umar radhiyallahu 'anhuma, bahwa Zaid bin Haritsah maula Rasulullah shallallahu 'alaihi wa sallam sebelumnya biasa kami panggil dengan Zaid bin Muhammad, sampai Allah menurunkan ayat, “Panggilah mereka (anak angkat itu) dengan (memakai) nama bapak-bapak mereka;” Ibnul Jarud meriwayatkan dari Aisyah radhiyallahu 'anha, ia berkata: Sahlah binti Suhail bin ‘Amr (ia adalah istri Abu Hudzaifah bin ‘Utbah) datang kepada Rasulullah shallallahu 'alaihi wa sallam dan berkata, “Sesungguhnya Salim biasa masuk menemui kami sedangkan kami biasa memakai pakaian harian (yang di rumah), dan kami menganggapnya sebagai anak. Abu Hudzaifah mengangkatnya sebagai anak sebagaimana Rasulullah shallallahu 'alaihi wa sallam mengangkat Zaid sebagai anak, maka Allah menurunkan ayat, “Panggilah mereka (anak angkat itu) dengan (memakai) nama bapak-bapak mereka;” Syaikh Muqbil berkata, “Mungkin saja ayat ini berkenaan dengan keduanya,” wallahu a’lam. Yang melahirkan mereka. Oleh karena itulah, Zaid dipanggil dengan Zaid bin Haritsah, karena bapaknya adalah Haritsah. Lebih lurus dan mendapatkan petunjuk. Maula-maula ialah seorang hamba sahaya yang sudah dimerdekakan atau seorang yang pernah dijadikan anak angkat, seperti Salim anak angkat Huzaifah, dipanggil Salim maula Huzaifah. Termasuk ke dalamnya ketika lisannya kelepasan sehingga memanggil anak angkat itu dengan menasabkan kepada yang bukan bapaknya, atau hanya mengetahui sebatas zhahirnya bahwa itu adalah bapaknya, padahal bukan, karena ketidaktahuannya, maka dalam hal ini tidak berdosa. Setelah mengetahui larangannya. Dia tidak menghukummu karena perbuatanmu di masa lalu dan memaafkan kesalahanmu yang tidak disengaja dan merahmatimu karena menerangkan kepadamu hukum-hukum-Nya yang memperbaiki agama dan duniamu, maka segala puji bagi-Nya atas hal itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 5",
    "description": "Allah tidak menjadikan anak angkatmu sebagai anak kandung. Karena itu, panggillah mereka dengan dinisbatkan kepada nama bapak kandung mereka sendiri, bukan bapak angkatnya. Panggilan demikian itulah yang secara syariat dinilai adil di sisi Allah, dan jika kamu tidak mengetahui nama bapak kandung mereka, maka panggillah mereka sebagai saudara-saudaramu seagama dan maula-maulamu. Dan tidak ada dosa atasmu menisbatkan seorang anak kepada selain bapaknya jika kamu khilaf atau belum tahu hukum tentang hal itu, tetapi yang menimbulkan dosa adalah apa yang disengaja oleh hatimu dengan menetapkan sesuatu yang batil. Allah maha pengampun kepada siapa saja yang memohon ampunan-Nya, maha penyayang sehingga tidak serta-merta mengazab hamba-Nya yang bersalah. 6. Usai membatalkan hukum anak angkat yang terkait dengan nabi pada ayat sebelumnya, pada ayat ini Allah menegaskan bahwa kedudukan nabi itu lebih utama bagi orang-orang mukmin daripada sekadar bapak dari seseorang. Bahkan, beliau lebih utama dibandingkan diri mereka sendiri sebab beliau selalu menginginkan kebaikan bagi umatnya dan berkat beliau pula mereka selamat dari kebinasaan. Dan adapun istri-istrinya secara hukum adalah seperti ibu-ibu mereka sendiri yang harus dimuliakan dan haram mereka nikahi jandanya. Begitupun, hanya orang-orang yang mempunyai hubungan darah yang satu sama lain lebih berhak untuk saling mewarisi sebagaimana tercantum di dalam kitab Allah, daripada orang-orang mukmin dan orang-orang muhajirin yang hanya diikat oleh hubungan keagamaan, bukan kekerabatan, kecuali kalau kamu hendak berbuat baik dengan berwasiat yang tidak lebih dari sepertiga hartamu kepada saudara-saudaramu seagama. Demikianlah telah tertulis dalam kitab Allah."
  }
]