[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai Nabi, sesungguhnya Kami membolehkan istri-istrimu untukmu yang telah kamu beri mahar. Kami membolehkan hamba sahayamu yang kamu miliki dari apa yang Allah limpahkan kepadamu sebagai nikmat. Kami membolehkan untukmu menikah dengan anak perempuan paman dan bibimu dari ayah, anak perempuan paman dan bibimu dari puhak ibu yang berhijrah bersamamu. Kami membolehkan untukmu seorang wanita beriman yang memberikan dirinya kepadamu tanpa mahar, bila kamu ingin menikahinya, tetapi ini hanya untukmu saja, adapun untuk selainmu, dia tidak boleh menikahi wanita dengan akad hibah. Kami mengetahui apa yang Kami tetapkan atas orang-orang Mukmin pada istri-istri mereka dan hamba-hamba sahaya mereka, hendaknya mereka tidak menikah kecuali empat istri dan hamba sahaya yang mereka kehendaki dengan tetap mensyaratkan wali, mahar dan saksi mereka. Akan tetapi Kami memberimu keringanan dari apa yang Kami tetapkan untuk mereka. Kami memberimu kelapangan yang tidak Kami berikan kepada selainmu, agar dadamu tidak menjadi sempit dalam menikahi wanita-wanita yang kamu nikahi dari asnaf itu. Ini adalah tambahan perhatian Allah kepada RasulNya dan penghargaanNya kepadaNya. Allah Maha Pengampun bagi dosa-dosa para hambaNya yang beriman, Maha Penyayang dengan memberikan kelonggaran bagi mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "50. Wahai Nabi, sesungguhnya Kami telah menghalalkan bagimu istri-istrimu yang telah kamu berikan mahar mereka, dan Kami halalkan bagimu budak-budak yang kamu miliki yang kamu peroleh dalam peperangan yang dikaruniakan oleh Allah untukmu, dan Kami halalkan bagimu untuk menikahi putri saudara laki-laki bapakmu, putri saudari bapakmu, putri saudara laki-laki ibumu, putri saudari ibumu, yang mengikutimu berhijrah dari Makkah ke Madinah, dan Kami halalkan bagimu untuk menikahi perempuan beriman yang menyerahkan dirinya kepada Nabi tanpa memberinya mahar apabila dia mau menikahinya. Nikah dengan cara penyerahan diri ini khusus untuk Nabi -ṣallallāhu 'alaihi wa sallam- semata, tidak diperbolehkan bagi orang lain dari umatnya. Kami telah mengetahui apa yang telah Kami wajibkan atas orang-orang yang beriman tentang istri-istri mereka, yaitu mereka tidak diperbolehkan untuk menikahi lebih dari empat perempuan, dan tentang syariat Kami kepada mereka dalam urusan hamba sahaya perempuan mereka, yang mereka diperbolehkan untuk bersenang-senang dengan siapa mereka kehendaki dari hamba sahaya tanpa batasan jumlah. Dan Kami membolehkan bagimu apa yang telah kami larang bagi orang selainmu agar kamu tidak mendapatkan tekanan dan kesusahan. Dan Allah Maha Pengampun bagi orang yang bertobat diantara hamba-hamba-Nya, lagi Maha Penyayang kepada mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "50. Allah memberi karunia kepada Nabi Muhammad dengan menghalalkan baginya wanita-wanita yang telah beliau bayarkan mahar mereka, dan budak wanita dari ghanimah atau hadiah yang Allah berikan kepada beliau, seperti Shafiyah binti Huyay, Juwairiyah binti Harits, dan Mariyah al-Qibthiyah. Allah juga menghalalkan baginya anak perempuan paman dan bibi beliau dari jalur ayah dan dari jalur ibu yang telah berhijrah; begitu pula dengan wanita mukminah yang siap beliau nikahi tanpa mahar. Jika kamu mau, maka itu halal bagimu saja, bukan bagi orang-orang beriman lainnya. Kami telah mengetahui apa yang Kami syariatkan dan Kami telah menetapkan bagi orang-orang beriman dalam hal istri dan budak wanita mereka, yaitu mereka tidak boleh menikahi lebih dari empat wanita merdeka dan boleh menikahi budak wanita dengan jumlah yang mereka mau dengan syarat adanya wali, mahar, dan dua saksi. Kami telah memberi keluasan bagimu melebihi orang lain, agar dadamu tidak menjadi sempit saat menikahi wanita-wanita tersebut. Allah Maha Mengampuni dosa hamba-hamba-Nya yang beriman dan Maha Mengasihi dengan memberi keluasan bagi mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "50. يٰٓأَيُّهَا النَّبِىُّ إِنَّآ أَحْلَلْنَا لَكَ أَزْوٰجَكَ الّٰتِىٓ ءَاتَيْتَ أُجُورَهُنَّ (Hai Nabi, sesungguhnya Kami telah menghalalkan bagimu isteri-isterimu yang telah kamu berikan mas kawinnya) Allah menyebutkan dalam ayat ini jenis-jenis pernikahan yang dihalalkan bagi Rasulullah. Allah memulainya dengan istri-istrinya yang telah beliau berikan maharnya sebab mereka telah memilih beliau dibanding dengan kehidupan dunia dan perhiasannya. وَمَا مَلَكَتْ يَمِينُكَ مِمَّآ أَفَآءَ اللهُ عَلَيْكَ(dan hamba sahaya yang kamu miliki yang termasuk apa yang kamu peroleh dalam peperangan yang dikaruniakan Allah untukmu) Yakni tawanan yang menjadi bagian dari harta ghanimah yang Allah berikan kepadamu dari orang-orang kafir yang berupa istri-istri mereka yang diambil secara paksa. Dan halal baginya pula budak wanita yang dibeli atau dihadiahkan dan lain sebagainya. وَبَنَاتِ عَمِّكَ وَبَنَاتِ عَمّٰتِكَ وَبَنَاتِ خَالِكَ وَبَنَاتِ خٰلٰتِكَ الّٰتِى هَاجَرْنَ مَعَكَ(dan (demikian pula) anak-anak perempuan dari saudara laki-laki bapakmu, anak-anak perempuan dari saudara perempuan bapakmu, anak-anak perempuan dari saudara laki-laki ibumu dan anak-anak perempuan dari saudara perempuan ibumu yang turut hijrah bersama kamu) Yakni halal bagimu untuk melamar mereka yang kamu sukai untuk kamu nikahi. Namun tidak halal bagimu mereka yang belum berhijrah. وَامْرَأَةً مُّؤْمِنَةً إِن وَهَبَتْ نَفْسَهَا لِلنَّبِىِّ(dan perempuan mukmin yang menyerahkan dirinya kepada Nabi) Yakni jika ia menyerahkan dirinya kepadamu tanpa meminta mahar. Adapun wanita yang belum beriman maka ia tidak halal bagimu dengan menyerahkan dirinya untukmu. إِنْ أَرَادَ النَّبِىُّ أَن يَسْتَنكِحَهَا(kalau Nabi mau mengawininya) Yakni jika beliau mau menjadikannya sebagai istri dan memiliki hak mencampurinya dengan penyerahan dirinya tanpa meminta mahar. خَالِصَةً لَّكَ مِن دُونِ الْمُؤْمِنِينَ ۗ(sebagai pengkhususan bagimu, bukan untuk semua orang mukmin) Yakni pembolehan wanita yang menyerahkan dirinya tanpa mahar adalah khusus bagimu bukan bagi orang-orang beriman selainmu. قَدْ عَلِمْنَا مَا فَرَضْنَا عَلَيْهِمْ فِىٓ أَزْوٰجِهِمْ(Sesungguhnya Kami telah mengetahui apa yang Kami wajibkan kepada mereka tentang isteri-isteri mereka) Yakni apa yang Allah wajibkan kepada orang-orang beriman tentang hak-hak istri-istri mereka dan syarat-syarat akad pernikahan yang tidak boleh mereka tinggalkan tidak boleh meniru Rasulullah dalam apa yang dikhususkan baginya saja sebagai keluasan dan pemuliaan baginya. Maka janganlah kalian menikah kecuali dengan mahar, saksi, dan wali, dan janganlah salah seorang dari kalian menikah dengan lebih dari empat wanita. وَمَا مَلَكَتْ أَيْمٰنُهُمْ(dan hamba sahaya yang mereka miliki) Yakni dan Kami talah mengetahui apa yang Kami wajibkan kepada mereka dalam budak-budak wanita mereka yaitu mereka harus dari golongan yang boleh diperangi dan ditawan, bukan dari golongan yang tidak boleh diperangi dan ditawan atau golongan yang memiliki perjanjian dengan kaum muslimin. لِكَيْلَا يَكُونَ عَلَيْكَ حَرَجٌ ۗ(supaya tidak menjadi kesempitan bagimu) Yakni Kami melapangkan bagimu penghalalan, agar dadamu tidak terasa sempit dan merasa telah melakukan dosa dalam sebagian pernikahanmu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "50. Allah telah menyediakan perempuan-perempuan yang dibolehkan untuk dinikahi Nabi. Sesungguhnya Kami telah menghalalkan untukmu istri-istrimu yang telah engkau berikan mahar juga hamba sahaya yang engkau miliki. Termasuk juga Kami halalkan bagimu barang-barang yang engkau peroleh dari peperangan. Antara lain puteri paman atau bibi dari bapakmu, puteri dari paman atau bibi dari ibumu yang ikut hijrah bersamamu dari Makkah ke Madinah, kecuali yang tidak ikut hijrah bersamamu. Kami juga telah menghalalkan perempuan-perempuan yang rela menyerahkan dirinya kepada Nabi tanpa mahar, apabila Nabi berkehendak untuk menikahinya. Itu adalah kekhususan bagi sebagai penghormatan derajatmu sebagai Nabi, bukan bagi oranh-orang mukmin lainnya. Maka tidak boleh bagi orang mukmin menikahi perempuan tanpa memberikan mahar. Kami telah mengetahui hukum-hukum yang telah Kami wajibkan kepada orang-orang mukmin atas istri-istri mereka. Hal itu dimaksudkan agar orang-orang mukmin tidak menikahi lebih dari empat perempuan. Dalam pernikahan wajib ada mahar dan janji antara kedua pengantin, wajib ada wali dan dua saksi. Adapun syarat untuk menikahi budak/hamba sahaya adalah bahwa budak itu harus muslimah atau ahli kitab, bukan penyembah berhala atau majusi. Mensucikan rahimnya sebelum berhubungan badan, menghindari dari berbuat zina. Kami telah melonggarkan/memudahkanmu dalam menikahi seseorang wahai Nabi, agar engkau tidak kesulitan dan keberatan dalam memperlakukan sembilan istri tanpa memberdakan mereka sedikitpun. Juga bertujuan untuk menghilangkan beban menikah pada beberapa perempuan. Sesungguhnya Allah Maha Pengampun atas segala yang mempersulit jalan untuk memudahkan pernikahan itu. Allah Maha Pengasih dengan meluaskan jalan atas beban dan kesulitan urusan pernikahan. Ummu Hanni binti Abu Thalib berkata: “Rasul telah meminangku, namun aku tidak menerimanya, dan Nabi juga memaafkanku. Kemudian menurunkan ayat : “Maka telah Kami halalkan bagimu....”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Wahai Nabi, sesungguhnya Kami telah menghalalkan bagimu istri-istrimu yang telah kamu beri mahar mereka} mahar mereka {dan hamba sahaya yang kamu miliki dari apa yang kamu peroleh dari apa yang dianugerahkan Allah untukmu} yang diberikan Allah kepadamu dari orang-orang kafir berupa harta rampasan {dan anak-anak perempuan dari saudara laki-laki ayahmu, anak-anak perempuan dari saudara perempuan ayahmu, anak-anak perempuan dari saudara laki-laki ibumu, anak-anak perempuan dari saudara perempuan ibumu yang berhijrah bersamamu, dan perempuan mukmin yang menyerahkan dirinya kepada Nabi jika Nabi ingin menikahinya khusus untukmu} khusus untukmu {bukan untuk orang-orang mukmin. Sungguh, Kami telah mengetahui apa yang Kami wajibkan kepada mereka} apa yang Kami wajibkan kepada orang-orang mukmin {tentang istri-istri mereka dan hamba sahaya yang mereka miliki agar tidak menjadi kesempitan} kesempitan dan penderitaan {bagimu. Allah Maha Pengampun lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "50. Allah berfirman seraya menyebutkan karuniaNya kepada RasulNya, yaitu menghalalkan segala sesuatu yang dihalalkan bagi beliau dan juga bagi kaum Mukminin serta sesuatu yang menjadi kekhususan dirinya saja, “Hai Nabi, sesungguhnya Kami telah menghalalkan bagimu istri-istrimu yang telah kamu berikan maskawinnya,” maksudnya, yang telah engkau serahkan maharnya kepada istri-istri (mu). Ini termasuk hak yang sama antara dia dan kaum Mukminin. Sebab, sesungguhnya kaum MUkminin juga diperbolehkan bagi mereka (memiliki) istri-istri yang telah mereka beri maharnya. “Dan” demikian pula Kami halalkan bagimu “hamba sahaya yang kamu miliki,” maksudnya, budak-budak perempuan yang kamu miliki, “yang termasuk apa yang kamu peroleh dalam peperangan yang dikaruniakan Allah untukmu,” dari barang rampasan peperangan yang dikaruniakan Allah untukmu,” dari barang rampasan dari orang-orang kafir, yaitu berupa budak-budak wanita mereka dan wanita-wanita merdeka mereka, baik perempuan yang memiliki suami dari mereka ataupun yang tidak. Ini juga hak yang sama (antara beliau dan sahabat). Dan demikian pula yang termasuk hak yang sama adalah FirmanNya, “dan anak-anak perempuan dari saudara laki-laki bapakmu, anak-anak perempuan dari saudari perempuan bapakmu, anak-anak perempuan dari saudara laki-laki ibumu dan anak-anak perempuan dari saudari perempuan ibumu,” mencakup paman dan bibi (dari saudara bapak), dan paman dan bibi (dari saudara ibu) yang dekat dan yang jauh. Ini adalah batasan peremuan-perempuan yang halal dinikahi, yang dapat diambil kesimpulan dari mafhumnya (makna tersiratnya), bahwa perempuan-perempuan selain mereka dari kerabat dekat itu tidak dihalalkan, sebagaimana telah dijelaskan dalam Surat an-Nisa. Sebab sudah tidak diperbolehkan (tidak dihalalkan) wanita-wanita dari kaum kerabat selain mereka yang berasal dari empat jalur kerabat itu. Dan selain mereka yang berasal dari furu’ (cabang, anak, cucu, dan seterusnya) secara pasti, dan ushul (ibu, nenek, dan seterusnya) dan furu’ yang berasal dari bapak, ibu dan yang dibawahnya, dan furu’ bagi orang-orang yang di atasnya (seperti anak nenek) yang berasal dari keturunannya, maka semuanya tidak halal. Dan FirmanNya, “yang turut hijrah bersama kamu,” ini adalah batasan (syarat) bagi kehalalan perempuan-perempuan tersebut bagi Rasulullah, sebagaimana pendapat dalam tafsir ayat ini. Adapun selain rasulullah, maka sudah diketahui bahwa ini adalah tidak halal. “Dan” Kami halalkan untukmu “perempuan Mukmin yang menyerahkan dirinya kepada Nabi,” dengan hanya menyerahkan dirinya itu, “kalau nabi mau mengawininya.” Ini tergantung kepada kemauan dan kesukaan (beliau), “sebagai pengkhususan bagimu, bukan untuk semua orang Mukmin,” yang dimaksud adalah: Bolehnya Nabi (menikahi) perempuan yang menyerahkan dirinya. Sedangkan orang-orang Mukmin maka tidak halal bagi mereka menikahi perempuan dengan hanya disebabkan wanita itu menyerahkan dirinya kepada mereka. “Sungguh Kami telah mengetahui apa yang Kami wajibkan kepada mereka tentang istri-istri mereka dan hamba sahaya yang mereka miliki.” Kami telah mengetahui apa yang menjadi kewajiban kaum Mukminin, apa yang halal bagi mereka dan apa yang tidak halal berupa istri-istri dan budah sahaya. Dan Kami telah memberitakan hal itu kepada mereka, dan Kami telah menjelaskan yang fardhu-fardhu. Maka apa yang ada di dalam ayat ini dari hal-hal yang bertentangan dengan hal itu, maka itu adalah kekhususan bagimu, karena Allah telah menjadikannya sebagai khitab (pesan, perintah) untuk Rasul saja, berdasarkan FirmanNya, \"Hai Nabi, sesungguhnya Kami telah menghalalkan bagimu istri-istrimu yang telah kamu berikan mas kawinnya dan hamba sahaya yang kamu miliki yang termasuk apa yang kamu peroleh dalam peperangan yang dikaruniakan Allah untukmu, dan (demikian pula) anak-anak perempuan dari saudara laki-laki bapakmu, anak-anak perempuan dari saudara perempuan bapakmu, anak-anak perempuan dari saudara laki-laki ibumu dan anak-anak perempuan dari saudara perempuan ibumu yang turut hijrah bersama kamu dan perempuan mukmin yang menyerahkan dirinya kepada Nabi kalau Nabi mau mengawininya, sebagai pengkhususan bagimu, bukan untuk semua orang mukmin. Sesungguhnya Kami telah mengetahui apa yang Kami wajibkan kepada mereka tentang istri-istri mereka dan hamba sahaya yang mereka miliki supaya tidak menjadi kesempitan bagimu. Dan adalah Allah Maha Pengampun lagi Maha Penyayang.\" (Al-Ahzab:50). Dan FirmanNya, “sebagai pengkhususan bagimu, bukan untuk semua orang Mukmin.” Kami membolehkan bagimu, wahai Nabi, sesuatu yang tidak Kami bolehkan bagi mereka, dan Kami lapangkan bagimu sesuatu yang tidak Kami lapangkan bagi selainmu, “supaya tidak menjadi kesempitan bagimu.” Ini bagian dari tambahan perhatian Allah terhadap Rasulullah. “Dan Allah Maha Pengampun lagi Maha Penyayang,” maksudnya, Dia selalu bersifat mengampuni dan merahmati, dan Dia menurunkan sebagian ampunanNya, rahmatNya, kemurahanNya dan kebaikanNya kepada hamba-hambaNya sesuai dengan tuntutan hikmahNya sementara sebab kausalitas didapatkan ada pada mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahzab ayat 50: Wahai Nabi ﷺ sungguh Kami telah membolehkan bagimu macam-macam perempuan dengan memberi kebebasan dan kemudahan bagimu untuk sejenak berhenti dari dakwah, untuk memberi pengajaran terhadap wanita-wanita yang beriman."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala berfirman memberikan kenikmatan kepada Rasul-Nya shallallahu 'alaihi wa sallam dengan menghalalkan untuknya apa yang Dia halalkan, di mana di antaranya ada yang ikut serta dalam hal ini antara Beliau dengan kaum mukmin, dan ada pula yang khusus bagi Beliau saja, tidak yang lain. Yang didapat dari tawanan perang. Ini semua adalah hal yang sama antara Beliau dengan kaum mukmin, di mana dihalalkan juga bagi kaum mukmin. Oleh karena itu, Beliau memiliki Shafiyyah dan Juwairiyyah, lalu Beliau memerdekakan keduanya dan menikahinya. Beliau juga memiliki Raihanah binti Zaid An Nadhriyyah serta Mariyah Al Qibthiyyah, keduanya termasuk budak Beliau shallallahu 'alaihi wa sallam. Ini juga sama termasuk yang kaum mukmin ikut serta di dalamnya. Dari mafhumnya dapat diambil kesimpulan bahwa kerabat selain itu (selain sepupu) tidak halal dinikahi seperti yang disebutkan dalam surah An Nisaa’: 22-23. Ibnu Katsir berkata, “Orang-orang Nasrani tidak menikah dengan seorang wanita kecuali jika antara si laki-laki dengan si wanita ada tujuh kakek atau lebih, sedangkan orang-orang Yahudi, salah seorang di antara mereka menikahi puteri saudaranya dan puteri saudarinya, maka datanglah syariat yang sempurna ini merobohkan sikap orang-orang Nasrani yang berlebihan, sehingga syariat (Islam) membolehkan menikahi puteri paman dan bibi dari pihak bapak (yakni sepupu), serta puteri paman dan bibi dari pihak ibu (yakni sepupu), dan syariat ini mengharamkan sikap orang-orang Yahudi yang meremehkan, yaitu halalnya puteri saudara dan saudari, padahal hal ini adalah sesuatu yang keji dan jelek.” Ini merupakan batasan untuk halalnya mereka itu bagi Rasulullah shallallahu 'alaihi wa sallam saja sebagaimana hal itu merupakan pendapat yang benar di antara dua pendapat dalam menafsirkan ayat ini. Abu Razin dan Qatadah berkata, “Maksudnya adalah berhijrah bersama Beliau ke Madinah.” Namun dalam sebuah riwayat dari Qatadah tentang “(Wanita) yang turut hijrah bersamamu” yaitu wanita yang masuk Islam. Menurut Imam Al Baghawiy, “Selanjutnya syarat hijrah untuk halalnya mereka itu dihapus.” Namun tidak disebutkan yang menghapusnya. Al Mawardi menyebutkan dua pendapat dalam masalah ini: pertama, hijrah merupakan syarat halalnya wanita bagi Beliau secara mutlak. Kedua, hijrah merupakan syarat halalnya kerabat yang disebutkan dalam ayat itu, tidak wanita asing. Tanpa mahar jika Beliau menghendaki. Yakni nikah dengan lafaz hibah (memberikan diri) tanpa adanya mahar adalah khusus untuk Beliau shallallahu 'alaihi wa sallam saja. Adapun bagi kaum mukmin, maka tidak halal bagi mereka menikahi wanita yang menghibahkan dirinya kepada mereka. Qatadah berkata, “Tidak boleh bagi seorang wanita menghibahkan (memberikan) dirinya kepada seorang pun tanpa wali dan tanpa mahar kecuali kepada Nabi shallallahu 'alaihi wa sallam.” Tentang hukum-hukum perkawinan, misalnya mereka tidak boleh menikah lebih dari empat orang istri dan tidak boleh menikahi wanita kecuali dengan adanya wali, dua orang saksi, mahar dan ijab-qabul. Adapun untuk Beliau, maka Allah memberikan rukhshah (keringanan) dalam ha itu. Baik dengan membeli maupun dengan cara kepemilikan lainnya. Menurut penyusun tafsir Al Jalaalain, namun dengan syarat budak tersebut termasuk yang halal bagi pemiliknya, seperti wanita Ahli Kitab, bukan wanita Majusi atau penyembah berhala, dan sebelum dicampuri harus istibra’ (kosong rahimnya baik dengan melahirkan jika hamil, atau sekali haidh jika tidak hamil). Budak yang dimiliki itu tidak ada batasnya (yakni tidak dibatasi sampai empat), di mana ia termasuk yang boleh ditawan dan diperangi, bukan yang tidak boleh ditawan atau mempunyai perjanjian dengan kaum muslimin. Ini merupakan tambahan perhatian Allah Ta’ala kepada Rasul-Nya. Terhadap sesuatu yang sulit dihindari. Dengan memberikan keluasan dalam hal itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 50",
    "description": "Usai menjelaskan persoalan perceraian yang berlaku secara umum pada ayat-ayat yang lalu, pada ayat berikut Allah menjelaskan hukum pernikahan yang berlaku secara khusus bagi nabi Muhammad. Wahai nabi Muhammad! sesungguhnya kami telah menghalalkan bagimu istri-istrimu yang telah engkau berikan maskawinnya, dan kami halalkan juga bagimu hamba sahaya yang engkau miliki, termasuk apa yang engkau peroleh dalam peperangan yang dikaruniakan Allah untukmu, berupa harta maupun wanita yang ditinggalkan oleh musuh. Dan kami halalkan pula untukmu menikahi anak-anak perempuan dari saudara laki-laki bapakmu, anak-anak perempuan dari saudara perempuan bapakmu, anak-anak perempuan dari saudara laki-laki ibumu, dan anak-anak perempuan dari saudara perempuan ibumu yang turut hijrah bersamamu, dan kami halalkan pula untukmu menikahi perempuan mukmin yang menyerahkan dirinya kepada nabi untuk dinikahi tanpa mahar, kalau nabi ingin menikahinya. Kami gariskan hukum demikian sebagai kekhususan bagimu, wahai nabi Muhammad, bukan untuk semua orang mukmin selain dirimu. Kami telah mengetahui apa yang kami wajibkan kepada mereka, orang-orang mukmin, tentang istri-istri mereka dan hamba sahaya yang mereka miliki. Kami tentukan hukum perkawinan yang demikian itu kepadamu tiada lain agar tidak menjadi kesempitan dan beban bagimu, wahai nabi, dalam menjalankan tugas kenabian. Dan Allah maha peng-ampun kepada hamba-Nya yang bertobat, maha penyayang dengan karunia-Nya yang tiada terbatas. 51. Bila para suami yang berpoligami wajib secara adil mengatur gilir-an untuk mendatangi istri-istri mereka, maka ketentuan demikian tidak Allah berlakukan atas nabi Muhammad. Engkau, wahai nabi Muhammad, boleh menangguhkan menggauli siapa yang engkau kehendaki di antara mereka, yakni para istrimu, dan boleh pula menggauli siapa di antara mereka yang engkau kehendaki. Dan siapa yang engkau ingini untuk menggaulinya kembali dari istri-istrimu yang telah engkau sisihkan, yakni engkau tinggalkan untuk tidak menggaulinya kemudian kamu menginginkannya kembali atau mereka yang menginginkannya, maka tidak ada dosa bagimu karena kami perbolehkan khusus untukmu hal tersebut. Kekhususan yang demikian itu Allah anugerahkan kepadamu agar lebih dekat untuk ketenangan hati mereka, dan mereka tidak merasa sedih ketika engkau tidak mendampingi mereka, dan mereka rela dengan apa yang telah engkau berikan kepada mereka semuanya, karena mereka tahu itulah ketetapan Allah. Dan Allah mengetahui apa yang tersimpan dalam hatimu. Dan Allah maha mengetahui apa yang tersimpan dalam hati istri-istrimu, maha penyantun dengan tidak segera menghukum hamba yang berbuat salah dan dosa."
  }
]