[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kamu boleh menunda siapa yang kamu kehendaki dari istri-istrimu dalam jatah pembagian bermalam, dan kamu boleh bermalam di salah seorang dari mereka menurut kehendakmu, dan sipa saja yang kamu minta bermalam pada istri yang sebelumnya kamu menunda bermalam padanya, tidak ada dosa atasmu dalam hal ini. Pilihan tersebut lebih bisa membuat mereka bahagia dan membuat mereka tidak bersedih dan semuanya akan menerima apa yang kami bagikan kepada mereka. Allah mengetahui apa yang tersimpan dalam hati kaum laki-laki, di mana mereka cenderung kepada sebagian wanita atas sebagian yang lainnya. Allah Maha Mengetahui apa yang ada dalam hati, Mahabijaksana sehingga tidak menyegerakan hukuman terhadap siapa yang durhaka kepadaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "51. Engkau -wahai Rasul- boleh menangguhkan menggauli siapa yang engkau kehendaki dari istri-istrimu untuk ditangguhkan gilirannya lalu kamu tidak bermalam bersamanya, dan engkau boleh pula menggauli yang kamu kehendaki dari mereka lalu kamu bermalam bersamanya. Barangsiapa yang kamu inginkan untuk kamu gauli dari istrimu yang ingin kamu tangguhkan, maka kamu tak berdosa. Hak memilih dan keleluasaan bagimu itu lebih bisa membuat senang istri-istrimu dan lebih bisa membuat mereka rida dengan apa yang engkau berikan pada mereka semua, karena mereka tahu bahwa kamu tidak mungkin meninggalkan kewajiban dan tidak pelit dengan kebenaran. Dan Allah mengetahui isi hati kalian -wahai kaum laki-laki- berupa kecenderungan kepada sebagian wanita dari wanita yang lain. Dan Allah Maha Mengetahui amal perbuatan hamba-hamba-Nya, tidak ada sesuatu pun dari amal itu yang tersembunyi dari-Nya, lagi Maha Penyantun dengan tidak menyegerakan siksa bagi mereka agar mereka bertobat kepada-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "51. Salah satu bentuk keluasan Allah bagi Rasulullah dengan memberi pilihan baginya dalam pembagian bermalam di antara para istrinya. Akan tetapi Rasulullah selalu membaginya dengan adil hingga semua istrinya ridha. Allah Maha Mengetahui tabiat dan kecondongan para laki-laki dan perempuan. Dia Maha Mengampuni dosa hamba-hamba-Nya dan Maha Lembut kepada mereka dengan kemudahan yang Dia berikan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "51. تُرْجِى مَن تَشَآءُ مِنْهُنَّ وَتُـْٔوِىٓ إِلَيْكَ مَن تَشَآءُ ۖ (Kamu boleh menangguhkan menggauli siapa yang kamu kehendaki di antara mereka (isteri-isterimu) dan (boleh pula) menggauli siapa yang kamu kehendaki) Pada mulanya membagi jatah bagi istri-istrinya adalah kewajiban baginya, kemudian turunlah ayat ini yang mengangkat hukum wajib itu, dan menjadikan Rasulullah berhak untuk membagi jatah sesuai kehendaknya. Sehingga Rasulullah dahulu membagi jatah bagi istri-istri yang dia hendak gauli dengan sama rata dan memberi jatah bagi istri yang dia tangguhkan menggaulinya jika dia menghendaki. وَمَنِ ابْتَغَيْتَ مِمَّنْ عَزَلْتَ فَلَا جُنَاحَ عَلَيْكَ ۚ(Dan siapa-siapa yang kamu ingini untuk menggaulinya kembali dari perempuan yang telah kamu cerai, maka tidak ada dosa bagimu) Yakni jika Rasulullah hendak mengembalikan istri yang sebelumnya telah dia ceraikan maka itu tidak mengapa baginya. ذٰلِكَ أَدْنَىٰٓ أَن تَقَرَّ أَعْيُنُهُنَّ(Yang demikian itu adalah lebih dekat untuk ketenangan hati mereka) Yakni pilihan yang Kami berikan kepadamu dalam rujukmu dengan mereka itu lebih mendekati keridhaan mereka, sebab pilihan ini dari Kami; karena jika mereka mengetahui bahwa itu dari Allah maka hati mereka akan tenang. وَلَا يَحْزَنَّ(dan mereka tidak merasa sedih) Akibat kamu lebih memilih sebagian mereka daripada yang lain. وَيَرْضَيْنَ بِمَآ ءَاتَيْتَهُنَّ كُلُّهُنَّ ۚ(dan semuanya rela dengan apa yang telah kamu berikan kepada mereka) Berupa pergaulan dan penundaannya, dan perceraian dan rujuk. وَاللهُ يَعْلَمُ مَا فِى قُلُوبِكُمْ ۚ(Dan Allah mengetahui apa yang (tersimpan) dalam hatimu) Pada setiap yang kalian sembunyikan, dan termasuk dari itu adalah perkara-perkara yang kalian sembunyikan yang berhubungan dengan para istri."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "51. Membagi rata kepada para istri dalam hal menggauli itu sebelumnya diwajibkan atas nabi, namun kemudian Allah memberi keringanan, dengan diberi pilihan. Dalam ayat ini, nabi diperbolehkan menangguhkan siapa saja istrinya yang Nabi kehendaki untuk malam-malam lain. Nabi juga diberi kebebasan atas siapa saja istri yang beliau kehendaki untuk didahulukan. Juga tidak ada dosa bagi Nabi untuk menggauli istrinya kembali meskipun sudah mendapat giliran. Juga dibolehkan membagi siapa saja yang hendak diakhirkan. Pilihan ini dimaksudkan agar lebih menenangkan hati mereka para istri Rasul, agar tidak ada kegundahan pada hati mereka, semua rela atas siapapun yang Rasul pilih untuk didahulukan atau diakhirkan. Allah Maha mengetahui segala isi hatimu, isi hati atas kecenderunganmu terhadap beberapa istrimu. Maka bersungguh-sungguhlah dalam berbuat ihsan. Allah Maha Mengetahui atas apa yang mudah bagi makhluk-Nya, Maha Bijaksana dan tidak tergesa-gesa dalam memberi hukuman. Aisyah berkata: “Apakah seorang istri malu untuk menyerahkan dirinya kepada suaminya?” Kemudian Allah menurunkan ayat “...siapapun yang engkau kehendaki..” Kemudian Aisyah berkata: Sepertinya Allah memang memberi keluasan atas kehendak dan keinginanmu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kamu boleh menangguhkan siapa saja yang kamu kehendaki di antara mereka} kamu menangguhkan siapa saja di antara istri-istrimu dalam hal pembagian untuk bermalam dengannya {dan (boleh) menggauli siapa saja yang kamu kehendaki} dan kamu menggauli siapa saja yang kamu kehendaki di antara mereka pada malam hari {Siapa saja yang kamu inginkan} kamu inginkan untuk menggaulinya {dari istri-istrimu yang telah kamu sisihkan} yang telah kamu tangguhkan pembagiannya untuk bermalam dengannya {maka tidak ada dosa} tidak ada dosa {bagimu. Demikian itu lebih dekat} lebih dekat {untuk menyenangkan hati mereka. Mereka tidak merasa sedih dan merasa rela dengan apa yang telah kamu berikan kepada mereka semua} kamu berikan kepada mereka {Allah mengetahui apa yang ada dalam hatimu. Allah Maha Mengetahui lagi Maha Penyantun"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "51. Ini juga termasuk keleluasaan dari Allah untuk RasulNya dan kasih sayangNya kepadanya, yaitu Allah membolehkan baginya mengabaikan pembagian di antara istri-istrinya secara wajib, dan jika beliau melakukan pembagian jatah, maka itu adalah kesukarelaan dari beliau. Sekalipun demikian, Rasulullah selalu bersungguh-sungguh di dalam melakukan pembagian hak di antara mereka dalam segala sesuatu. Lalu di sini Allah berfirman, “Kamu boleh menangguhkan siapa yang kamu kehendaki dari mereka,” maksudnya, kamu menangguhkan siapa saja yang kamu kehendaki dari istri-istrimu, kamu boleh tidak menggaulinya dan boleh tidak bermalam tidur bersamanya. “Dan (kamu boleh) menggauli siapa yang kamu kehendaki,” maksudnya, kamu berkumpul dengannya dan bermalam tidur bersamanya. “Dan” sekalipun demikian, hal ini tidak harus. Maka siapa saja “yang kamu ingini” yaitu agar kamu menggaulinya “maka tidak ada dosa bagimu.” Maksudnya, semua pilihan diserahkan kepadamu semuanya. Kebanyakan ahli tafsir mengatakan, “Ini adalah khusus bagi wanita-wanita yang menyerahkan dirinya kepada Nabi. Nabi boleh menangguhkan siapa saja yang dia kehendaki, dan menggauli siapa saja yang dia suka. Maksudnya, jika beliau berkehendak, maka beliau boleh menerima wanita yang menyerahkan dirinya kepadanya, dan jika beliau menghendaki, maka beliau boleh untuk tidak menerimanya. Wallahu a’lam. Kemudian Allah menjelaskan hikmah di balik itu semua, seraya berfirman, “Yang demikian itu” maksudnya, kelonggaran untukmu dan keadaan semua permasalahan dikembalikan kepadamu dan ada pada wewenangmu, dan apa pun yang kamu lakukan kepada mereka itu adalah kesukarelaan darimu, “adalah lebih dekat untuk ketenangan hati mereka, dan mereka tidak merasa sedih, dan semuanya rela dengan apa yang telah kamu berikan kepada mereka” karena mereka tahu bahwa engkau tidak pernah mengabaikan kewajiban dan tidak pula engkau mengabaikan hak yang semestinya. “Dan Allah mengetahui apa yang tersimpan dalam hatimu,” maksudnya, apa yang terlintas padanya saat melaksanakan hak-hak yang wajib dan yang sunnah dan ketika ada benturan hak-hak. Maka dari itulah diberikan kelonggaran bagimu, wahai Rasulullah, agar hati istri-istrimu merasa tenang. “Dan Allah Maha Mengetahui lagi Maha Penyantun,” maksudnya, Mahaluas ilmunya, lagi sangat Penyantun. Dan di antara ilmunya adalah Dia mensyariatkan bagi kaian sesuatu yang lebih baik untuk urusan-urusan kalian dan lebih banyak pahalanya bagi kalian. Dan di antara kesantunanNya adalah Dia tidak menghukum (mengazab) kalian atas kesalahan yang terjadi dari kalian dan atas keburukan yang selalu dilakukan oleh hati kalian."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahzab ayat 51: Sungguh Kami telah beri keluasan bagimu wahai Rasul untuk mengakhirkan apa yang engkau kehendaki bagi istri-istrimu untuk tidak bermalam di sisi mereka, dan engkau kumpulkan bagi siapa yang engkau kehendaki dari mereka serta engkau bermalam padanya, Kami beri keluasan bagimu dalam pembagian di antara para istrimu, dan Kami tidak menjadikan bagimu kewajiban, karena sesungguhnya hal ini adalah demi kebaikanmu dan janganlah mereka (istri-istrimu) bersedih dengan keputusanmu; Bahkan mereka harus ridha atas hal ini. Sungguh Allah Maha Tahu apa yang bergejolak di dalam dada kalian, dan juga apa yang bergetar dalam dada kalian, sungguh Allah Maha Mengetahui hati."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Imam Bukhari meriwayatkan dengan sanadnya yang sampai kepada Aisyah radhiyallahu 'anha ia berkata: Aku sangat cemburu kepada kaum wanita yang menghibahkan dirinya kepada Rasulullah shallallahu 'alaihi wa sallam dan aku berkata, “Apa (pantas) seorang wanita menghibahkan dirinya?” Maka ketika Allah Ta’ala menurunkan ayat, “Engkau boleh menangguhkan (menggauli) siapa yang engkau kehendaki di antara mereka (para istrimu) dan (boleh pula) menggauli siapa (di antara mereka) yang engkau kehendaki.” Aku berkata, “Aku tidak melihat Tuhanmu kecuali segera menuruti keinginanmu.” Ini termasuk keringanan Allah untuk Rasul-Nya dan rahmat-Nya kepadanya, Dia membolehkan untuk Beliau tidak melakukan penggiliran antara istri-istrinya mengikuti yang wajib, dan jika Beliau menggilir, maka itu merupakan perbuatan tabaru’ (sunat dan kerelaan) dari diri Beliau. Meskipun demikian, Beliau senantiasa berusaha menggilir antara istri-istrinya dalam segala sesuatu, sampai-sampai Beliau berdoa, “Ya Allah, inilah pembagian giliran yang aku mampu, maka janganlah mencelaku dalam hal yang tidak aku mampu.” Dan tidak bermalam di sisinya. Dan bermalam di sisinya. Yakni, itu terserah Beliau semua. Kebanyakan para mufassir berkata, “Sesungguhnya hal ini khusus dengan wanita-wanita yang menghibahkan diri kepada Beliau, Beliau berhak menunda menggauli mereka dan menggauli yang Beliau kehendaki, yakni jika Beliau menghendaki, maka Beliau menerima wanita yang menghibahkan dirinya kepada Beliau, dan jika Beliau tidak menghendaki, maka Beliau berhak tidak menerimanya. Wallahu a’lam. Ibnul Jauziy dalam tafsirnya “Zaadul Masir” berkata. “Tentang makna ayat ini (ayat di atas) ada empat pendapat (ulama): Pertama, engkau boleh menalak yang engkau kehendaki di antara istri-istrimu, serta menahan siapa saja yang engkau kehendaki di antara istri-istrimu. Pendapat ini dipegang oleh Ibnu Abbas. Kedua, engkau boleh tidak menikahi siapa yang engkau kehendaki dan menikahi siapa yang engkau kehendaki di antara kaum wanita umatmu. Pendapat ini dipegang oleh Al Hasan. Ketiga, engkau boleh sisihkan siapa saja yang engkau kehendaki di antara istri-istrimu sehingga engkau tidak mendatanginya namun tanpa menalaknya, dan engkau dapat mendatangi siapa yang engkau kehendaki sehingga engkau tidak sisihkan dia. Pendapat ini dipegang oleh Mujahid. Keempat, engkau boleh menerima siapa saja kaum wanita mukminah yang menghibahkan dirinya kepadamu dan engkau tinggalkan siapa yang engkau kehendaki. Pendapat ini dipegang oleh Asy Sya’biy dan ‘Ikrimah.” Selanjutnya Allah menerangkan hikmahnya, yaitu hikmah pemberian keluasan itu dan penyerahan pilihan kepada Beliau dan tindakan Beliau untuk mereka sebagai sikap tabarru’ (sunat). Karena mereka mengetahui bahwa engkau tidak akan meninggalkan kewajiban dan tidak meremehkan hak yang mesti. Yang melintas di hati ketika memenuhi hak-hak yang wajib dan yang sunat, dan ketika terdesak dalam masalah hak. Oleh karena itulah, Allah mensyariatkan kelonggaran untuk Beliau agar hati istri-istri Beliau tenang. Karena Dia mengetahui, maka Dia mensyariatkan sesuatu yang bermaslahat bagi urusanmu dan lebih memperbanyak pahalamu. Karena santun-Nya, Dia tidak segera menghukum apa yang muncul darimu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 51",
    "description": "Bila para suami yang berpoligami wajib secara adil mengatur gilir-an untuk mendatangi istri-istri mereka, maka ketentuan demikian tidak Allah berlakukan atas nabi Muhammad. Engkau, wahai nabi Muhammad, boleh menangguhkan menggauli siapa yang engkau kehendaki di antara mereka, yakni para istrimu, dan boleh pula menggauli siapa di antara mereka yang engkau kehendaki. Dan siapa yang engkau ingini untuk menggaulinya kembali dari istri-istrimu yang telah engkau sisihkan, yakni engkau tinggalkan untuk tidak menggaulinya kemudian kamu menginginkannya kembali atau mereka yang menginginkannya, maka tidak ada dosa bagimu karena kami perbolehkan khusus untukmu hal tersebut. Kekhususan yang demikian itu Allah anugerahkan kepadamu agar lebih dekat untuk ketenangan hati mereka, dan mereka tidak merasa sedih ketika engkau tidak mendampingi mereka, dan mereka rela dengan apa yang telah engkau berikan kepada mereka semuanya, karena mereka tahu itulah ketetapan Allah. Dan Allah mengetahui apa yang tersimpan dalam hatimu. Dan Allah maha mengetahui apa yang tersimpan dalam hati istri-istrimu, maha penyantun dengan tidak segera menghukum hamba yang berbuat salah dan dosa. 52. Ketika ayat ini turun, nabi mempunyai sembilan istri, yaitu '''isyah, 'af'ah, zainab, ummu salamah, ummu 'ab'bah, maim'nah, saudah, 'afiyyah, dan juwairiyah. Allah memberi nabi kekhususan hukum dalam hal relasi suami-istri, tetapi dia juga memberi batasan dalam pernikahan nabi. Tidak halal bagimu, wahai nabi Muhammad, menikahi perempuan-perempuan lain setelah itu, yakni selain yang sudah hidup bersamamu saat ayat ini turun, dan tidak boleh pula bagimu menceraikan lalu mengganti mereka dengan istri-istri yang lain, meskipun kecantikannya menarik hatimu, kecuali perempuan-perempuan hamba sahaya yang engkau miliki. Dan Allah maha mengawasi segala sesuatu di mana dan kapan pun untuk kebaikan alam semesta."
  }
]