[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidak halal bagimu menikahi wanita lain setelah para istrimu Ummahatul Mukminin, tidak halal juga bagimu untuk mentalak mereka dan menikah dengan selain mereka sebagai pengganti mereka. (Hal ini sebagai penghargaan kepada Ummahatul Mukminin dan ungkapan terima kasih atas kebaikan mereka selama ini yang telah memilih Allah, RasulNya dan akhirat), sekalipun kamu mengagumi kecantikan wanita lain tersebut, kecuali hamba-hamba sahaya wanita yang kamu miliki, mereka halal bagimu. Allah Maha Mengawasi segala sesuatu, tidak ada sesuatu pun yang samar bagiNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "52. Tidak diperbolehkan bagimu -wahai Rasul- untuk menikahi wanita-wanita selain istri-istrimu yang berada di dalam tanggunganmu, dan tidak diperbolehkan bagimu untuk menceraikan mereka, atau menceraikan sebagian dari mereka agar kamu menggantinya dengan wanita-wanita selain mereka, meski kecantikan wanita selain istri-istrimu yang ingin kamu nikahi itu menarik bagimu. Akan tetapi diperbolehkan bagimu untuk bersenang-senang dengan hamba sahayamu yang perempuan tanpa batasan jumlah. Dan Allah Maha Mengawasi segala sesuatu. Ketentuan ini menunjukkan keutamaan ummahatul mukminin, sebab Allah melarang Rasul -ṣallallāhu 'alaihi wa sallam- untuk menceraikan mereka maupun menikah dengan cara menggantikan mereka dengan yang lain."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "52. Hai Nabi, tidak boleh bagimu kembali menikah setelah kamu memiliki sembilan istri itu, dan tidak boleh bagimu mengganti mereka dengan wanita lain dengan mencerai salah satu dari mereka kemudian menikahi wanita lainnya, meskipun kecantikan wanita itu membuatmu takjub; kecuali dengan budak wanita, maka itu tidak mengapa. Allah Maha Mengetahui keridhaan kepada Allah yang ada dalam hati kalian. Allah Maha Mengawasi dan Mengetahui segala urusan, dan Allah mengaturnya dengan sebaik-baiknya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "52. لَّا يَحِلُّ لَكَ النِّسَآءُ مِنۢ بَعْدُ (Tidak halal bagimu mengawini perempuan-perempuan sesudah itu) Lewat ayat ini Allah mengharamkan Rasulullah untuk menikahi wanita lain selain istri-istri yang telah ia nikahi itu sebagai balasan bagi mereka yang telah memilih Allah, Rasulullah, dan hari akhir daripada kehidupan dunia dan perhiasannya. وَلَآ أَن تَبَدَّلَ بِهِنَّ مِنْ أَزْوٰجٍ(dan tidak boleh (pula) mengganti mereka dengan isteri-isteri (yang lain)) Yakni tidak boleh bagimu menceraikan salah satu dari mereka atau lebih kemudian menikahi wanita lainnya sebagai gantinya. وَلَوْ أَعْجَبَكَ حُسْنُهُنَّ(meskipun kecantikannya menarik hatimu) Meski kecantikan wanita yang ingin kamu jadikan pengganti istrimu itu menarik hatimu. إِلَّا مَا مَلَكَتْ يَمِينُكَ (kecuali perempuan-perempuan (hamba sahaya) yang kamu miliki) Yakni boleh bagimu mengganti mereka dengan budak wanita yang kamu miliki atau menambah istrimu dengan mereka. Aisyah dan sebagian sahabat berkata: “tidaklah Rasulullah meninggal dunia sampai Allah menghalalkan baginya untuk menikahi wanita mana saja yang beliau kehendaki kecuali wanita yang memiliki mahram dengannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "52. Tidak halal bagimu menikahi lebih dari sembilan perempuan yang telah Kami pilihkan untukmu wahai Nabi. Itu sudah sesuai sebagaimana empat bagi orang mukmin. Kamu juga tidak dihalalkan mengganti istri-istrimu itu dengan perempuan baru lainnya, dengan cara engkau mentalak beberapa atau semua istrimu kemudian engkau mengganti mereka dengan perempuan baru, meskipun lebih cantik menurutmu. Ini merupakan batasan bagi nabi namun diperbolehkan bagi ummatnya. Kecuali para sahaya yang engkau punyai dan engkau kehendaki, halal bagimu untuk menambahnya. Selain sembilan istri itu Nabi memiliki sahaya Mariah Alqibtiyah yang dihadiahkan oleh Almuqauqis, dari rahimnya Nabi mempunyai putera Ibrahim yang meninggal saat masih disusui. Allah Maha Mengawasi dan Memperhatikan atas segala sesuatu. Min dalam azwaj mengandung arti umum yang menafikan kata sesudahnya. Ikrimah berkata: Ketika Rasul telah memilih istrinya, maka mereka para istri sejatinya memilih Allah dan rasul-Nya. Maka Allah menurunkan ayat ini."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidak halal bagimu menikahi perempuan-perempuan (lain) setelah itu} setelah (menikahi) Sembilan perempuan yang telah kamu pilih dan mereka memilihmu {dan tidak boleh mengganti mereka dengan istri-istri (lain)} dan kamu tidak boleh menalak salah satu di antara mereka lalu mengganti tempatnya dengan menikahi perempuan lain {meskipun kecantikannya menarik hatimu kecuali hamba sahaya perempuan yang kamu miliki. Allah Maha Mengawasi segala sesuatu} Maha Menjaga lagi Maha Mengawasi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "52. Ini adalah kesyukuran dari Allah yang senantiasa Maha Mensyukuri, untuk istri-istri RasulNya yang mana mereka lebih memilih Allah, RasulNya dan negeri akhirat, yaitu dalam bentuk Allah berbelas-kasih kepada mereka dan membatasi RasulNya untuk beristrikan mereka saja, seraya berfirman, “Tidak halal bagimu mengawini perempuan-perempuan sesudah,” istri-istrimu yang ada, “dan tidak boleh pula mengganti mereka dengan istri-istri yang lain,” maksudnya, jangan pula kamu menceraikan salah satu dari mereka lalu mengawini yang lain sebagai gantinya. sehingga terjadilah rasa aman mereka, dari bahaya dan perceraian. Hal ini karena Allah telah menetapkan bahwa mereka adalah istri-istrinya di dunia dan akhirat, tidak boleh terjadi perceraian antara Nabi dengan mereka. “Meskipun kecantikannya menarik hatimu,” maksudnya, kecantikan selain mereka lebih menawan hatimu, maka tetap tidak halal bagimu, “kecuali hamba sahaya yang kamu miliki” yaitu, wanita-wanita tawanan perang, maka hal ini halal bagimu. Sebab, wanita-wanita budak sahaya dalam (sudut pandang) ketidaksukaan istri padanya tidaklah sama kedudukannya dengan istri-istri yang sebenarnya dalam mengganggu. “Dan Allah Maha Mengawasi segala sesuatu,” maksudnya, Dia selalu mengawasi segala permasalahan, mengetahui bagaimana berakhirnya permasalahan itu, Dia selalu mengurusinya dengan aturan yang tersempurna dan kerapian yang paling baik."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahzab ayat 52: Dihalalkan bagimu wahai Nabi untuk menahan istri-istrimu yang bersama denganmu, dan tidak halal bagimu untuk mentalak salah satu di antara mereka untuk menikah dengan selain dari mereka, meskipun engkau merasa takjub dengan selain mereka kecuali bagi hamba sahaya, maka halal bagimu. Sungguh Allah Maha mengawasi segala sesuatu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ini adalah syukur dari Allah yang senantiasa mensyukuri istri-istri Rasul-Nya radhiyallahu 'anhun karena mereka lebih memilih Allah, Rasul-Nya dan negeri akhirat, Dia merahmati mereka dan membatasi Rasul-Nya dengan istri-istri itu saja. Dengan demikian mereka aman dari ditalak, karena Allah telah menetapkan bahwa mereka adalah istri-istri Beliau di dunia dan akhirat, dan Beliau dengan mereka tidak akan berpisah. Nabi shallallahu 'alaihi wa sallam tidak dibolehkan kawin setelh mempunyai istri-istri sebanyak yang telah ada itu dan tidak pula dibolehkan mengganti istri-istrinya yang telah ada itu dengan menikahi perempuan lain. Setelah istri-istri itu, Beliau memiliki budak bernama Mariyah, yang darinya lahir anaknya Ibrahim, dan wafat pada saat Beliau masih hidup. Dia mengawasi segala urusan, mengetahui akibatnya dan mengurusnya secara sempurna dan rapi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 52",
    "description": "Ketika ayat ini turun, nabi mempunyai sembilan istri, yaitu '''isyah, 'af'ah, zainab, ummu salamah, ummu 'ab'bah, maim'nah, saudah, 'afiyyah, dan juwairiyah. Allah memberi nabi kekhususan hukum dalam hal relasi suami-istri, tetapi dia juga memberi batasan dalam pernikahan nabi. Tidak halal bagimu, wahai nabi Muhammad, menikahi perempuan-perempuan lain setelah itu, yakni selain yang sudah hidup bersamamu saat ayat ini turun, dan tidak boleh pula bagimu menceraikan lalu mengganti mereka dengan istri-istri yang lain, meskipun kecantikannya menarik hatimu, kecuali perempuan-perempuan hamba sahaya yang engkau miliki. Dan Allah maha mengawasi segala sesuatu di mana dan kapan pun untuk kebaikan alam semesta. 53. Saat nabi merayakan pernikahan dengan zainab binti ja'sy, beliau mengundang tamu untuk mencicipi hidangan walimah. Di antara tamu-tamu itu, ada tiga orang yang terlalu asyik dan lama berbincang karena merasa betah di kediaman rasulullah. Melalui ayat berikut Allah menjelaskan etika berkunjung ke rumah nabi. Wahai orang-orang yang beriman! janganlah kamu memasuki rumah-rumah nabi sambil menunggu-nunggu waktu makan rasulullah, kecuali jika kamu diizinkan untuk makan tanpa menunggu waktu makanannya masak. Tetapi, jika kamu dipanggil maka masuklah, dan apabila kamu selesai makan, keluarlah kamu dari kediaman nabi tanpa memperpanjang percakapan. Sesungguhnya yang demikian itu, yakni berlama-lama di rumah beliau, adalah mengganggu nabi, sehingga dia malu kepadamu untuk memintamu pulang, dan Allah tidak malu menerangkan hal yang benar."
  }
]