[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang yang membenarkan Allah dan rasulNya dan mengamalkan SyariatNya, janganlah kamu memasuki rumah Nabi kecuali dengan izinnya untuk menyantap makanan dengan tidak menunggu matangnya, akan tetapi bila kalian diundang, maka masuklah, dan bila kalian sudah makan, maka pulanglah tanpa mengobrol sesudahnya diantara kalian, karena duduknya kalian dan perbincangan kalian itu mengganggu Nabi, namun dia malu untuk mengusir kalian ke luar rumah padahal hal itu adalah haknya, dan Allah tidak malu untuk menjelaskan dan menampakkan kebenaran. Bila kalian meminta sebuah hajat kepada istri-istri Nabi seperti bejana rumah dan lainnya, maka mintalah kepada mereka dari balik tabir, karena hal itu lebih suci bagi hati kalian dan hati mereka dari godaan yang mengganggu laki-laki kepada wanita dan sebaliknya, karena melihat adalah sebab fitnah. Kalian tidak patut menyakiti Nabi dan tidak pula menikahi istri-istrinya sesudahnya selama-lamanya, karena mereka adalah ibu bagi kalian, dan seorang laki-laki tidak halal menikahi ibunya. Sesungguhnya bila kalian menyakiti Rasulullah dan menikahi istri-istrinya sesudahnya, maka hal itu adalah dosa besar di sisi Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "53. Wahai orang-orang yang beriman kepada Allah dan melaksanakan apa yang Dia syaritakan bagi mereka, janganlah kalian masuk ke rumah Nabi kecuali setelah mendapat izin darinya untuk memasukinya dengan mengundangmu untuk makan, dan janganlah kalian duduk berlama-lama untuk menunggu matangnya masakan, akan tetapi apabila kalian diundang untuk makan, maka masuklah, dan jika sudah selesai makan segeralah pergi, dan janganlah kalian tinggal setelah itu untuk berbincang-bincang, karena hal itu menyakiti Nabi -ṣallallāhu 'alaihi wa sallam-, dan dia malu untuk mengusir kalian pergi, dan Allah tidak malu untuk memerintahkan suatu kebenaran, maka Dia memerintahkan kepada kalian untuk pergi darinya sehingga kalian tidak menyakitinya dengan menetap di tempatnya. Dan jika kalian meminta suatu hajat kepada sebagian dari istri-istri Nabi seperti butuh panci dan semisalnya, maka mintalah kebutuhan kalian itu dari balik hijab, dan janganlah kalian memintanya dengan cara langsung berhadap-hadapan, sehingga mata kalian tidak memandang mereka, sebagai bentuk penjagaan bagi mereka atas kedudukan Rasulullah -ṣallallāhu 'alaihi wa sallam-. Cara meminta dari balik hijab itu lebih suci untuk hati kalian dan lebih suci untuk hati mereka, sehingga setan tidak masuk ke dalam hati kalian dan hati mereka dengan membawa bisikan-bisikan dan memperindah kemungkaran. Dan tidak sepantasnya bagi kalian -wahai orang-orang yang beriman- untuk menyakiti Rasulullah dengan menetap untuk berbincang-bincang, dan tidak sepantasnya bagi kalian untuk menikahi istri-istrinya setelah kematiannya. Mereka adalah ibu-ibu kaum mukminin, dan tidak diperbolehkan bagi siapapun untuk menikahi ibunya. Sikap menyakiti ini -di antara bentuknya adalah pernikahan kalian dengan istri-istrinya setelah kematiannya- hukumnya haram dan di sisi Allah dianggap sebagai dosa yang besar."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "53. Allah memerintahkan orang-orang beriman agar tidak memasuki rumah Nabi kecuali jika beliau mengizinkan atau mengundang mereka untuk makan, tanpa terburu-buru datang dengan alasan menunggu masakannya matang. Hal ini agar tidak memberatkan Nabi dan istri-istrinya karena kalian terlalu lama di dalam rumah beliau. Jika kalian diundang makan, maka datanglah; dan jika kalian telah selesai makan, maka pamitlah undur diri dan jangan tetap duduk di sana untuk berbincang-bincang, sehingga itu menyebabkan keluarga Nabi merasa keberatan, dan membuat Nabi terganggu akan tetapi Nabi merasa segan kepada kalian. Namun Allah tidak segan untuk menunjukkan kebenaran; Allah mengajari dan memberi petunjuk kepada kalian untuk menjaga hak dan adab. Dan jika kalian meminta sesuatu seperti peralatan rumah tangga dan lain sebagainya kepada istri-istri Nabi atau kalian hendak berbicara dengan mereka, maka sampaikanlah dari belakang tabir pembatas. Itu lebih suci dan lebih aman bagi hati kalian dan hati mereka dari waswas dan gangguan setan. Dan tidak boleh bagi kalian menyakiti Rasulullah dalam bentuk apapun, dan janganlah kalian menikahi istri-istrinya setelah beliau wafat. Sungguh yang demikian adalah dosa yang besar di sisi Allah, karena kehormatan Rasulullah pada masa hidupnya dan setelah kematiannya, dan karena istri-istrinya adalah ibu-ibu kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "53. يٰٓأَيُّهَا الَّذِينَ ءَامَنُوا۟ لَا تَدْخُلُوا۟ بُيُوتَ النَّبِىِّ (Hai orang-orang yang beriman, janganlah kamu memasuki rumah-rumah Nabi) Ini merupakan larangan yang mencakup seluruh sahabat untuk memasuki rumah Rasulullah kecuali dengan seizinnya. إِلَّآ أَن يُؤْذَنَ لَكُمْ إِلَىٰ طَعَامٍ(kecuali bila kamu diizinkan untuk makan) Yakni kecuali kalian telah diundang untuk makan. غَيْرَ نٰظِرِينَ إِنَىٰهُ(dengan tidak menunggu-nunggu waktu masak) Yakni tanpa menunggu waktu masak dan makan. وَلٰكِنْ إِذَا دُعِيتُمْ فَادْخُلُوا۟(tetapi jika kamu diundang maka masuklah) Yakni jika kalian diundang dan diberi izin maka masuklah, sebab undangan saja tidak cukup sebagai izin untuk masuk. فَإِذَا طَعِمْتُمْ فَانتَشِرُوا۟(dan bila kamu selesai makan, keluarlah) Yang dimaksud adalah keharusan untuk keluar dari rumah yang mereka masuki setelah menyelesaikan makan. وَلَا مُسْتَـْٔنِسِينَ لِحَدِيثٍ ۚ(tanpa asyik memperpanjang percakapan) Yang dimaksud adalah larangan bagi mereka untuk tetap duduk setelah menyelesaikan makan untuk memperpanjang percakapan. إِنَّ ذٰلِكُمْ (Sesungguhnya yang demikian itu) Yakni memasuki rumahnya tanpa izin itu, atau memasuki rumahnya dengan izin namun tetap duduk untuk memperpanjang percakapan itu. كَانَ يُؤْذِى النَّبِىَّ (akan mengganggu Nabi) Sebab mereka memenuhi rumahnya dan mempersempit dirinya dan istrinya, serta bercakap-cakap dalam hal yang tidak ia kehendaki. Dan Rasulullah bersabar atas penjamuan mereka yang panjang karena kedermawanannya, maka Allah mengajarkan adab bagi mereka dan generasi setelah mereka. فَيَسْتَحْىِۦ مِنكُمْ ۖ(lalu Nabi malu kepadamu (untuk menyuruh kamu keluar)) Yakni malu untuk mengakatan kepada kalian ‘pergilah’ atau ‘keluarlah’ وَاللهُ لَا يَسْتَحْىِۦ مِنَ الْحَقِّ ۚ(dan Allah tidak malu (menerangkan) yang benar) Yakni Allah tidak akan tinggal diam untuk menjelaskan kepada kalian sesuatu yang benar. وَإِذَا سَأَلْتُمُوهُنَّ(Apabila kamu meminta kepada mereka) Yakni jika kalian meminta kepada istri-istri Nabi. مَتٰعًا(sesuatu (keperluan)) Yakni barang pinjaman dan lainnya, atau jika kalian berbicara dengan mereka. فَسْـَٔلُوهُنَّ مِن وَرَآءِ حِجَابٍ ۚ( maka mintalah dari belakang tabir) Yakni dari balik penghalang yang menutupi antara kalian dengan mereka. ذٰلِكُمْ (Cara yang demikian itu) Yakni meminta keperluan dari balik penutup. أَطْهَرُ لِقُلُوبِكُمْ وَقُلُوبِهِنَّ (lebih suci bagi hatimu dan hati mereka) Yakni lebih suci bagi kalian dari keraguan atau niat jahat yang mendatangi para lelaki dalam perkara perempuan dan niat jahat yang mendatangi perempuan dalam perkara laki-laki. وَمَا كَانَ لَكُمْ أَن تُؤْذُوا۟ رَسُولَ اللهِ(Dan tidak boleh kamu menyakiti (hati) Rasulullah) Yakni tidak dibenarkan bagi kalian menyakiti hati Rasulullah dengan cara apapun. وَلَآ أَن تَنكِحُوٓا۟ أَزْوٰجَهُۥ مِنۢ بَعْدِهِۦٓ أَبَدًا ۚ( dan tidak (pula) mengawini isteri-isterinya selama-lamanya sesudah ia wafat) Sebab mereka adalah para ibu bagi orang-orang beriman, dan seorang anak tidak boleh menikahi ibunya. إِنَّ ذٰلِكُمْ(Sesungguhnya perbuatan itu) Yakni menikahi istri-istrinya setelah kematiannya. كَانَ عِندَ اللهِ عَظِيمًا(adalah amat besar (dosanya) di sisi Allah) Yakni dosa yang besar dan urusan yang berbahaya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "53. Wahai orang-orang yang beriman, jangan sekali-kali kalian masuk ke rumah Nabi tanpa izin, kecuali kalian mendapat undangan untuk makan tanpa harus menunggu makanannya masak. Namun, jika sudah diundang dan diizinkan masuklah kalian segera. Apabila kalian telah selesai makan maka keluarlah tanpa memperpanjang perkataan dan jangan duduk berlama-lama untuk berbincang. Sesungguhnya yang demikian itu adalah diantara hal yang tidak diizinkan, karena dapat membebani rumah dan keluarga Nabi, pasti Nabi segan untuk meminta kalian pergi. Allah tidak akan melewatkan untuk menjelaskan sesuatu yang haq. Apabila kalian ada perlu dengan istri Nabi maka berbicaralah dari balik satir, yang demikian itu lebih suci bagi hati kalian dan hati para istri Nabi dari segala bahaya dan bisikan setan. Kalian tidak boleh menyakiti Rasul baik dengan perkataan maupun perbuatan. Selamanya, kalian diharamkan menikahi istri-istri Rasul sekalipun Rasul telah wafat. Sesungguhnya hal itu merupakan dosa yang sungguh besar. Ayat ini turun sebab undangan Nabi kepada para sahabat untuk jamuan makan/walimah atas pernikahan Nabi dengan Zainab binti Jahsy. Kemudian para sahabat seusai makan mereka berlama-lama dalam berbincang. Kemudian Nabi berdiri dan tinggal tiga orang. Kemudian Nabi memberitahu Anas agar mereka dipersilakan pulang. Kemudian Anas mohon pamit kepada istri Nabi dari balik satir."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Wahai orang-orang yang beriman, janganlah memasuki rumah-rumah Nabi, kecuali jika kalian diizinkan untuk makan tanpa menunggu waktu masaknya} tanpa menunggu waktu matangnya {tetapi jika kalian diundang, maka masuklah dan apabila kalian selesai makan} telah makan {maka keluarlah} keluarlah dari kediamannya {tanpa mencari kesenangan dengan bercakap-cakap} dan janganlah menetap setelah makan untuk bersenang-senang dengan bercakap-cakap satu sama lain {Sesungguhnya yang demikian itu mengganggu Nabi sehingga dia malu kepada kalian. Allah tidak malu terhadap yang benar} untuk menjelaskan dan menerangkan kebenaran {Apabila kalian meminta sesuatu kepada mereka (istri-istri Nabi)} sesuatu yang bisa kalian manfaatkan berupa bejana rumah dan hal semacamnya {maka mintalah dari belakang tabir} tabir {Yang demikian itu lebih suci bagi hatimu dan hati mereka. Kalian tidak boleh menyakiti Rasulullah dan tidak boleh menikahi istri-istrinya selama-lamanya setelah Nabi. Sesungguhnya yang demikian itu sangat besar (dosanya) di sisi Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "53. Allah memerintahkan kepada hamba-hambaNya yang beriman agar beretika kepada Nabi dalam memasuki rumahnya, seraya berfirman, “Hai orang-orang yang beriman, janganlah kamu memasuki rumah-rumah Nabi kecuali bila kamu diizinkan untuk makan.” Maksudnya, jangan kamu masuk rumahnya tanpa ada izin untuk masuk dari beliau untuk makan makanan. Dan juga, kalian jangan “menunggu-nunggu waktu masak” maksudnya kalian menunggu dan berlambat-lambat demi menunggu matangnya masakannya, atau berlapang dada sesudah selesai menyantapnya. Maksudnya, kalian jangan masuk rumah-rumah Nabi, kecuali dengan dua syarat, yaitu: - kalian diizinkan masuk, - dan berdiamnya kalian di rumahnya hanya menurut kadar kebutuhan. Maka dari itu Allah berfirman, “Tetapi jika kamu diundang maka masuklah dan bila kamu selesai makan, maka keluarlah kamu tanpa asyik memperpanjang percakapan” yaitu, sebelum makan atau sesudahnya. Kemudian Allah menjelaskan hikmah larangan tersebut dan faidahnya, seraya berfirman, “sesungguhnya yang demikian itu,” yakni: Menunggu-nunggu yang melebihi kebutuhan, “akan menunggu Nabi,” maksudnya, diamnya kalian (dalam waktu yang lama itu) memberatkan dan menyusahkan beliau untuk mengurusi urusan rumahnya dan kesibukan-kesibukan di dalamnya. “Lalu Nabi malu kepadamu,” untuk mengatakan kepada kalian, “Keluarlah!” sebagaimana hal ini telah menjadi kebiasaan manusia, terutama orang-orang yang sangat ramah di antara mereka, mereka malu untuk menyuruh keluar orang-orang dari rumahnya, “dan” akan tetapi “Allah tidak malu pada yang benar.” Jadi, perintah syar’i sekalipun ada anggapan bahwa di dalam meninggalkannya terdapat etika dan rasa malu, namun tetap harus tegas mengikuti perintah syar’I itu, dan memastikan bahwa apa saja yang menyalahinya, maka sama sekali tidak termasuk dalam etika, dan Allah tidak malu untuk memerintah kalian melakukan apa yang menjadi kebaikan bagi kalian. Inilah etika mereka dalam masuk rumah Nabi. Adapun etika mereka kepada beliau dalam berkomunikasi dengan istri-istrinya ada dua kondisi. Kondisi diperlukan atau kondisi tidak diperlukan. Kalau dalam kondisi tidak diperlukan, maka tidak perlu ada komunikasi, dan etikanya adalah meninggalkannya. Sedangkan jika memang dibutuhkan, seperti untuk menannyakan suatu barang atau lain-lainnya dari perabot rumah atau yang serupa dengannya, maka mereka boleh diminta “dari belakang tabir,” maksudnya, harus ada tirai yang menutup pandangan mata antara kalian dengan mereka, karena tidak ada perlunya memandang mereka. Maka dengan demikian, memandang mereka menjadi terlarang dalam bentuk apa pun. Sedangkan berbicara dengan mereka ada rinciannya, seperti yang telah Allah jelaskan di atas. Kemudian Allah menjelaskan hikmah dari itu semua dengan FirmanNya, “Cara yang demikian itu lebih suci bagi hatimu dan hati mereka,” sebab ia lebih jauh dari hal yang meragukan. Setiap kali seseotang semakin jauh dari sebab-sebab pemicu keburukan, maka hal itu lebih selamat baginya dan lebih suci bagi hatinya. Ini termasuk permasalahan syar’I yang sering Allah jelaskan perinciannya, yaitu bahwa seluruh sarana atau jalan menuju keburukan, sebab-sebab dan pengantar-pengantarnya dilarang, dan bahwa ia disyariatkan untuk dijauhi dengan segala cara. Kemudian Allah menyampaikan suatu kalimat yang sangat padat dan satu kaidah umum, “Dan tidak boleh kamu” wahai seluruh kaum Mukminin. Maksudnya, tidak pantas dan tidak baik bagi kalian, bahkan sesuatu yang paling buruk bagi kalian, “menyakiti Rasulullah.” Maksudnya, menyakiti dalam bentuk perkataan atau perbuatan dengan segala yang berkaitan dengannya, “dan tidak pula mengawini istri-istrinya selama-lamanya sesudah beliau wafat.” Ini termasuk dari sejumlah hal yang menyakiti beliau, sebab sesungguhnya Rasulullah mempunyai kedudukan untuk dihormati, diagungkan, dan dimuliakan. Sedangkan mengawini istri-istrinya sepeninggalnya dapat menodai kedudukan ini. Dan juga, sesungguhnya mereka adalah istri-istri beliau di dunia dan akhirat; hubungan pertalian suami-istri tetap utuh sesudah beliau wafat, maka dari itu tidak halal menikahi istri-istrinya sepeninggalnya bagi siapa pun dari umatnya. “Sesungguhnya perbuatan itu adalah amat besar di sisi Allah.” Perintah ini benar-benar telah dipatuhi oleh umat ini, dan mereka telah menjauhi sesuatu yang dilarang Allah. Maka segala puji dan syukur hanya untuk Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahzab ayat 53: Wahai orang-orang yang beriman kepada Allah dan membenarkan Rasul ﷺ, tetaplah untuk menjaga adab kepada Rasul ﷺ ketika masuk ke dalam rumahnya. Janganlah masuk ke dalam rumahnya kecuali setelah mendapatkan izin darinya, maka jika diizinkan bagimu untuk masuk ke dalamnya untuk makan, maka masuklah dengan tanpa menunggu masakan tersebut masak dan selesai dihidangkan, akan tetapi jika kalian di undang maka masuklah, dan jika telah selesai bagi kalian makan terlebih dahulu, maka segera keluarlah, janganlah berlama-lama duduk untuk basa-basi dan berbicang-bincang bagi kalia atas sebagian yang lain, karena hal itu adalah perbuatan yang mengganggu Nabi ﷺ, dan malulah kalian, malu kepada Nabi dan yang memerintahkan kamu untuk keluar dari rumah Nabi, Sungguh Allah tidak malu dalam menjelaskan kebenaran, tidak juga dalam memerintahkan kalian dalam kebaikan, dan sungguh Allah Maha Lembut kepada Nabi-Nya ﷺ. Jika kalian wahai orang-orang yang beriman meminta kepada istri-istri Nabi ﷺ semua yang bermanfaat, maka mintalah dari belakang tabir antara kalian dan mereka (istri-istri) Nabi. Itulah yang lebih mensucikan hati dari semua kebimbangan, dan sebagai pemutus keburukan. Dan tidak semestinya bagi kalian wahai orang-orang yang beriman untuk menyakiti Rasulullah ﷺ dengan macam apapun. Engkau tidak halal untuk menikahi istri-istri Nabi setelah wafatnya, selamanya. Karena hal itu adalah bentuk menyakiti, semua itu di sisi Allah adalah perbuatan dosa yang besar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memerintahkan kepada hamba-hamba-Nya yang beriman agar memiliki adab terhadap Rasulullah shallallahu 'alaihi wa sallam ketika masuk ke rumahnya. Ayat ini merupakan larangan atas kaum mukmin masuk ke rumah-rumah Rasulullah shallallahu 'alaihi wa sallam tanpa izin, sebagaimana yang mereka lakukan sebelumnya di zaman jahiliyyah dan awal-awal Islam ketika masuk ke rumah-rumah mereka, sehingga Allah cemburu, maka Dia memberitahukan hal ini. Hal ini merupakan pemuliaan Allah Subhaanahu wa Ta'aala kepada umat ini. Selanjutnya, Dia mengecualikan dari hal itu dengan firman-Nya, “Kecuali jika kamu diizinkan untuk makan tanpa menunggu waktu masak (makanannya)” yakni jangan kamu menunggu makanan ketika dimasak sehingga ketika hampir matang, kamu bersiap-siap masuk. Menurut Ibnu Abbas radhiyallahu 'anhuma, bahwa beberapa orang kaum mukmin menunggu-nunggu waktu makan Nabi shallallahu 'alaihi wa sallam, lalu mereka masuk menemui Beliau sebelum makanan matang sampai matang. Setelah itu, mereka makan dan tidak keluar, maka Rasulullah shallallahu 'alaihi wa sallam merasa terganggu dengan mereka, sehingga turunlah ayat ini. Kesimpulannya, bahwa kaum mukmin dilarang masuk ke rumah-rumah Nabi shallallahu 'alaihi wa sallam kecuali dengan dua syarat: (1) Dizinkan masuk, (2) Duduk di sana sebatas keperluan saja. Oleh karena itu, Allah Subhaanahu wa Ta'aala berfirman, “Tetapi jika kamu dipanggil maka masuklah dan apabila kamu selesai makan, keluarlah kamu tanpa memperpanjang percakapan.” Sebelum makan maupun setelahnya. Selanjutnya Allah Subhaanahu wa Ta'aala menjelaskan hikmah dilarang dan faedahnya. Yakni menunggu melebihi keperluan. Karena perkara syar’i meskipun ada sangkaan jika meninggalkannya merupakan adab dan sikap malu, akan tetapi yang telah nyata dan jelas (kebenaran dan kebaikannya) adalah mengikuti perkara syar’i itu, dan memastikan bahwa segala yang menyelisihinya bukanlah adab. Allah tidak malu memerintahkan sesuatu yang di dalamnya terdapat kebaikan bagi kita serta bersikap lembut kepada Rasul-Nya shallallahu 'alaihi wa sallam. Inilah adab ketika masuk ke rumah Beliau shallallahu 'alaihi wa sallam. Selanjutnya adab ketika berbicara dengan istri-istrinya adalah, karena hal itu bisa diperlukan dan bisa tidak diperlukan. Jika tidak diperlukan, maka adabnya adalah meninggalkannya, tetapi jika diperlukan seperti mereka (istri-istri Nabi shallallahu 'alaihi wa sallam) diminta sesuatu seperti perabotan rumah tangga dan sebagainya, maka mereka diminta dari balik hijab yang menghalangi antara si peminta dengan mereka sehingga tidak terlihat. Karena melihat mereka dalam keadaan bagaimana pun adalah haram. Kemudian Allah menyebutkan hikmahnya. Yakni lebih jauh dari hal yang meragukan, dan setiap kali seseorang jauh dari sebab-sebab yang mengajak kepada keburukan, maka hal itu lebih selamat baginya dan lebih membersihkan hatinya. Selanjutnya Allah Subhaanahu wa Ta'aala menyebutkan kalimat yang singkat dan padat serta sebagai kaidah umum. Baik dengan lisan maupun dengan perbuatan. Hal ini termasuk menyakiti hati Rasulullah shallallahu 'alaihi wa sallam. Karena Beliau berada pada kedudukan yang seharusnya dimuliakan dan dihormati serta ditinggikan, sedangkan menikahi istri-istrinya berlawanan dengan kedudukan Beliau. Di samping itu, istri-istri Beliau adalah istri Beliau di dunia dan akhirat, sehingga tidak halal menikahi istri-istrinya setelah Beliau wafat oleh salah seorang di antara umat Beliau. Umat Beliau pun menjauhi larangan itu, wal hamdulillah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 53",
    "description": "Saat nabi merayakan pernikahan dengan zainab binti ja'sy, beliau mengundang tamu untuk mencicipi hidangan walimah. Di antara tamu-tamu itu, ada tiga orang yang terlalu asyik dan lama berbincang karena merasa betah di kediaman rasulullah. Melalui ayat berikut Allah menjelaskan etika berkunjung ke rumah nabi. Wahai orang-orang yang beriman! janganlah kamu memasuki rumah-rumah nabi sambil menunggu-nunggu waktu makan rasulullah, kecuali jika kamu diizinkan untuk makan tanpa menunggu waktu makanannya masak. Tetapi, jika kamu dipanggil maka masuklah, dan apabila kamu selesai makan, keluarlah kamu dari kediaman nabi tanpa memperpanjang percakapan. Sesungguhnya yang demikian itu, yakni berlama-lama di rumah beliau, adalah mengganggu nabi, sehingga dia malu kepadamu untuk memintamu pulang, dan Allah tidak malu menerangkan hal yang benar. 54. Jika kamu menyatakan sesuatu, baik ucapan maupun perbuatan, atau menyembunyikannya dalam hatimu yang paling dalam, maka sesungguhnya Allah maha mengetahui segala sesuatu yang tampak maupun yang tersembunyi."
  }
]