[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bila kalian (wahai manusia) menampakkan sesuatu melalui lisan kalian dari apa yang Allah melarang kalian yang menyakiti Rasulullah atau menyembunyikannya dalam jiwa kalian, maka sesungguhnya Allah mengetahui apa yang ada dalam hati kalian dan apa yang kalian perlihatkan, dan Dia akan menghisab kalian atasnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "54. Jika kalian menampakkan sesuatu dari amal perbuatan kalian, atau menyimpannya pada diri kalian, maka tidak ada sesuatu apapun dari hal itu yang tersembunyi bagi Allah, sesungguhnya Allah Maha Mengetahui segala sesuatu, tidak ada sesuatu pun yang luput dari-Nya dari amal perbuatan kalian maupun yang lainnya, dan Dia akan membalas kalian atas amal perbuatan kalian, jika baik maka dibalas dengan kebaikan dan jika buruk maka akan dibalas dengan keburukan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "54. Jika kalian menampakkan atau menyembunyikan sesuatu dari hati kalian, maka sesungguhnya Allah Maha Melihat segalanya; Allah Maha Mengetahui, baik yang tampak maupun yang tersembunyi."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "54. إِن تُبْدُوا۟ شَيْـًٔا أَوْ تُخْفُوهُ فَإِنَّ اللهَ كَانَ بِكُلِّ شَىْءٍ عَلِيمًا (Jika kamu melahirkan sesuatu atau menyembunyikannya, maka sesungguhnya Allah adalah Maha Mengetahui segala sesuatu) Terdapat pendapat mengatakan bahwa ayat ini diturunkan untuk menanggapi perkataan sebagian sahabat Nabi: ‘jika Rasulullah telah wafat niscaya aku akan menikahi salah satu istrinya ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "54. Jika kalian menampakkan atau menyembunyikan sesuatu dalam hati kalian yang dapat menyakiti Nabi, Allah tetap Maha Tahu atas segala sesuatu. Kalian akan diberi balasan atas segala amal kalian. Ayat ini turun sebagaimana yang dikatakan beberapa sahabat: Jika Rasul telah wafat, aku akan menikahi salah satu istri Nabi"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika kalian menyatakan sesuatu atau menyembunyikannya, sesungguhnya Allah Maha Mengetahui segala sesuatu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "54. Kemudian Allah berfirman, “Jika kamu melahirkan sesuatu,” maksudnya, kalian menampakannya, “atau menyembunyikannya, maka sesungguhnya Allah Maha Mengetahui segala sesuatu,” Dia mengetahui apa yang tersimpan dalam hati kalian dan apa yang kalian tampakkan, lalu nanti Dia akan memberikan balasannya pada kalian."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahzab ayat 54: Allah memperingatkan hamba-Nya dalam segala kondisi mereka dengan berkata : Jika kalian menampakkan sesuatu waai manusia, atau menyembunyikan baik dengan niat, ucapan, perbuatan; Sungguh Allah mengetahui, tidaklah tersembunyi bagi-Nya sesuatu apapun, bertakwalah kepada Allah dan takutlah pada-Nya dalam kesendirian kalian maupun yang nampak dari kalian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dia mengetahui apa yang ada dalam hatimu dan apa yang kamu tampakkan, lalu Dia akan memberikan balasan kepadamu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 54",
    "description": "Jika kamu menyatakan sesuatu, baik ucapan maupun perbuatan, atau menyembunyikannya dalam hatimu yang paling dalam, maka sesungguhnya Allah maha mengetahui segala sesuatu yang tampak maupun yang tersembunyi. 55. Usai menjelaskan ketentuan berinteraksi dan berkomunikasi dengan istri-istri nabi pada ayat sebelumnya, pada ayat ini Allah menjelaskan orang-orang tertentu yang dikecualikan dari ketentuan itu. Tidak ada dosa atas istri-istri nabi untuk berjumpa tanpa tabir dengan bapak-bapak mereka, anak laki-laki mereka, saudara laki-laki mereka, anak laki-laki dari saudara laki-laki mereka, anak laki-laki dari saudara perempuan mereka, perempuan-perempuan mereka yang beriman, baik keluarga maupun bukan, dan hamba sahaya yang mereka miliki. Dan bertakwalah kamu, wahai istri-istri nabi, kepada Allah. Sungguh, Allah maha menyaksikan segala sesuatu yang kamu kerjakan. Laki-laki yang disebutkan pada ayat ini diperbolehkan menjumpai istri-istri nabi tanpa tabir karena ada hubungan kerabat dan karena hajat, sehingga mereka sering berkunjung."
  }
]