[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidak ada dosa bagi kaum wanita untuk tidak berhijab di depan bapak-bapak mereka, anak-anak laki-laki mereka, saudara-saudara laki-laki mereka, keponakan-keponakan laki-laki mereka, baik dari saudara laki-laki maupun wanita, wanita-wanita yang beriman, hamba sahaya mereka, karena adanya hajat kuat dalam membantu mereka. Dan takutlah kepada Allah (wahai kaum wanita) jangan melanggar batasan yang Allah tetapkan untuk kalian, lalu kalian menampakkan perhiasan kalian yang tidak patut kalian tampakkan atau kalian menanggalkan hijab di depan orang yang seharusnya kalian berhijab di depannya. Sesungguhnya Allah Maha Melihat segala sesuatu, menyaksikan amal para hamba yang lahir dan yang batin dan akan membalas mereka atasnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "55. Tidak berdosa bagi istri-istri Nabi -ṣallallāhu 'alaihi wa sallam- untuk melihat dan berbicara tanpa hijab dengan ayah mereka, anak-anak mereka, saudara lelaki mereka, anak saudara laki-laki mereka, anak saudari mereka karena ikatan nasab maupun karena susuan. Tidak ada dosa atas mereka untuk berbicara tanpa hijab dengan para wanita-wanita yang beriman dan hamba-hamba sahaya mereka. Dan bertakwalah kepada Allah -wahai para wanita yang beriman- dalam perintah-perintah Allah dan larangan-larangan-Nya, sesungguhnya Dia menyaksikan apa yang tampak dari kalian dan yang tersembunyi dari kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "55. Tidak mengapa bagi istri-istri Nabi untuk bertemu dengan ayah, anak, saudara laki-laki, anak saudara laki-laki, anak saudara perempuan, wanita-wanita Muslimah, dan budak-budak yang mereka miliki. Hendaklah mereka bertakwa kepada Allah dan senantiasa merasa diawasi Allah. Allah Maha Melihat segalanya, tidak ada urusan hamba-Nya yang tersembunyi dari-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "55. لَّا جُنَاحَ عَلَيْهِنَّ فِىٓ ءَابَآئِهِنَّ (Tidak ada dosa atas isteri-isteri Nabi (untuk berjumpa tanpa tabir) dengan bapak-bapak mereka) Mereka adalah orang-orang yang tidak diwajibkan bagi istri-istri Rasulullah untuk menutup penghalang dari mereka. وَلَا نِسَآئِهِنَّ (dan para wanita lainnya) Yakni kerabat perempuan mereka atau tetangga perempuan mereka atau perempuan lainnya yang ingin bertemu dengan mereka. وَلَا مَا مَلَكَتْ أَيْمٰنُهُنَّ( dan hamba sahaya yang mereka miliki) Yakni budak-budak laki-laki mereka. وَاتَّقِينَ اللهَ( dan bertakwalah kamu (hai isteri-isteri Nabi) kepada Allah) Dalam segala urusan, yang termasuk di dalamnya adalah apa yang disebutkan dalam ayat ini. Imam Bukhari dan Muslim mengeluarkan hadits dari Anas, ia berkata: Umar bin Khattab pernah berkata kepada Rasulullah: “Wahai Rasulullah, sungguh orang yang bertemu istri-istri engkau itu ada yang shalih dan ada yang fajir, andai saja engkau menutupi mereka.” Maka turunlah ayat perintah menutup ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "55. Tidak ada dosa bagi istri Nabi jika mereka tidak memakai penutup/kerudung di depan orang tua mereka, putera-putera mereka, saudara laki-laki mereka, putera saudara laki-laki mereka, dan putera saudara perempuan mereka. Juga di depan perempuan mukmin kecuali perempuan kafir. Juga di depan pembantu/orang yang tinggal di rumah dalam kurun waktu yang lama, baik laki-laki maupun perempuan. Bertaqwalah kalian kepada Allah wahai isitri-istri Nabi dengan memperhatikan batasan-batasan-Nya. Sesungguhnya Allah Maha Menyaksikan atas segala sesuatu, maka tidak ada yang dapat tersembunyi dari Allah. Disebutkan dalam riwayat Bukhari dan Muslim bahwa sahabat Anas berkata: Umar bin Khatab berkata: “Wahai Rasulullah, sesungguhnya istri-istri engkau kemungkinan tetap dirasuki oleh kebaikan maupun keburukan meskipun engkau menutupi mereka.” Maka Allah menurunkan ayat tentang hijab/penutup ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidak ada dosa atas mereka (istri-istri Nabi) dengan ayah-ayah mereka} tidak ada dosa bagi istri-istri nabi dengan menanggalkan tabir untuk bertemu ayah-ayah mereka {anak laki-laki mereka, saudara laki-laki mereka, anak laki-laki dari saudara laki-laki mereka, anak laki-laki dari saudara perempuan mereka, perempuan-perempuan mereka} dan tidak ada dosa bagi mereka untuk tidak mengenakan hijab untuk bertemu wanita-wanita muslim {dan tidak pula hamba sahaya yang mereka miliki. Bertakwalah kalian kepada Allah. Sesungguhnya Allah Maha Menyaksikan segala sesuatu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "55. Setelah Allah menjelaskan bahawasanya mereka (istri-istri Nabi) tidak boleh ditanya tentang sesuatu kecuali dari balik tabir, sedangkan redaksi lafazhnya bermakna umum bagi setiap orang, maka dibutuhkan adanya pengecualian dari mereka yang disebutkan itu, yaitu para mahram; dan bahwa sesungguhnya “tidak ada dosa atas istri-istri Nabi,” dalam berinteraksi tidak menggunkaan tirai pembatas dari mereka. Di dalamnya tidak disebutkan paman dari bapak dan paman dari ibu. Sebab, istri-istri Nabi itu, apabila tidak perlu berhijab (menggunakan tirai pembatas) terhadap orang yang mana kedudukan istri-istri Nabi itu adalah sebagai bibi (saudari perempuan bapak atau ibu), dari anak-anak dari saudara laki-laki dan dari saudari perempuan, beserta ketinggian kedudukan (status) istri-istri itu atas mereka, maka bolehnya mereka tidak berhijab dari paman (dari bapak atau ibu mereka) tentu lebih utama; dan karena konteks ayat yang lain yang dengan tegas menyebutkan paman (dari bapak dan saudara ibu) diutamakan atas makna yang bisa dipahami dari ayat ini. Dan FirmanNya, “dan tidak pula perempuan-perempuan mereka,” maksudnya, dan tidak ada dosa bagi mereka untuk tidak berhijab dari perempuan-perempuan mereka, yaitu mereka yang sejenis dan seagama. Sehingga konteks lafazh ini mengatakan wanita-wanita kafir. Namun bisa juga maksudnya adalah semua jenis wania, karena seorang perempuan tidak perlu berhijab dari perempuan yang lain, “dan tidak pula hamba sahaya yang mereka miliki,” maksudnya, selama budak sahaya itu masih berada dalam kepemilikannya semuanya. Dan setelah Allah mengangkat dosa dari mereka, maka Dia mempersyaratkan padanya dan pada yang lainnya adanya konsistensi bertakwa kepada Allah, dan (dengan syarat) kondisinya tidak ada larangan syar’I padanya. Maka Dia berfirman, “Dan bertakwalah kamu kepada Allah,” maksudnya, gunankanlah selalu takwa kepada Allah dalam seluruh keadaan. “Sesungguhnya Allah Maha Menyaksikan segala sesuatu,” Dia menyaksikan seluruh amal perbuatan hamba-hambaNya (manusia), yang Nampak dan yang tersembunyi, dan Dia selalu mendengar perkataan mereka serta selain melihat gerak-gerik mereka. Kemudian Dia akan memberikan kepada mereka (atas semua itu) balasan yang paling sempurna dan paling lengkap."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahzab ayat 55: Allah mengabarkan bahwa tidak ada dosa bagi istri-istri Nabi ﷺ untuk tidak berhijab dihadapan bapak-bapak mereka, anak-anak mereka, saudara-saudara mereka, anak-anak saudara-saudara mereka, perempuan pada umumnya dan hamba-hamba sahaya mereka. Allah memerintahkan mereka semua untuk bertakwa kepada Allah atas seluruh keadaaan, karena sungguh Allah menjadi saksi atas semuanya, menjadi saksi atas seluruh niat-niat kalian, ucapan-ucapan kalian dan perbuatan-perbuatan kalian, dan tidak tersembunyi semua itu bagi-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala menyebutkan bahwa mereka (istri-istri) Nabi shallallahu 'alaihi wa sallam tidaklah dimintai sesuatu kecuali dari balik tabir, sedangkan lafaz tersebut adalah umum untuk setiap orang, maka perlu adanya pengecualian dari mereka yang disebutkan, yaitu bagi mahram, bahwa tidak ada dosa atas istri-istri Nabi untuk berjumpa tanpa tabir terhadap mahramnya. Selama budak itu dimiliki secara keseluruhan. Dalam setiap keadaan. Dia menyaksikan amalan hamba yang tampak maupun yang tersembunyi, mendengarkan kata-kata mereka, melihat gerakan mereka, kemudian Dia akan membalas mereka dengan balasan yang sempurna."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 55",
    "description": "Usai menjelaskan ketentuan berinteraksi dan berkomunikasi dengan istri-istri nabi pada ayat sebelumnya, pada ayat ini Allah menjelaskan orang-orang tertentu yang dikecualikan dari ketentuan itu. Tidak ada dosa atas istri-istri nabi untuk berjumpa tanpa tabir dengan bapak-bapak mereka, anak laki-laki mereka, saudara laki-laki mereka, anak laki-laki dari saudara laki-laki mereka, anak laki-laki dari saudara perempuan mereka, perempuan-perempuan mereka yang beriman, baik keluarga maupun bukan, dan hamba sahaya yang mereka miliki. Dan bertakwalah kamu, wahai istri-istri nabi, kepada Allah. Sungguh, Allah maha menyaksikan segala sesuatu yang kamu kerjakan. Laki-laki yang disebutkan pada ayat ini diperbolehkan menjumpai istri-istri nabi tanpa tabir karena ada hubungan kerabat dan karena hajat, sehingga mereka sering berkunjung. 56. Allah menurunkan ketentuan tentang etika bagi umat islam ketika berinteraksi dengan istri-istri untuk menjaga kehormatan dan keagungan pribadi rasulullah. Di antara bukti keagungan beliau ialah bahwa sesungguhnya Allah dan para malaikat-Nya bersalawat untuk nabi. Salawat dari Allah berarti memberi rahmat, dan dari malaikat berarti memohonkan ampunan. Karena itu, wahai orang-orang yang beriman! bersalawatlah kamu untuk nabi, seperti dengan berkata all'humma 'alli 'al' mu'ammad (semoga Allah melimpahkan kebaikan dan ke-berkahan kepada nabi Muhammad), dan ucapkanlah salam dengan penuh penghormatan kepadanya, dengan mengucapkan perkataan seperti assal'mu 'alaika ayyuhan-nabiy (semoga keselamatan tercurah kepadamu, wahai nabi)."
  }
]