[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya Allah menyanjung Nabi di depan para malaikat yang dekat kepadaNya, para malaikat juga menyanjung Nabi dan mendoakannya. Wahai orang-orang yang membenarkan Allah dan RasulNya serta melaksanakan SyariatNya, bershalawat kepada Nabi dan ucapkanlah salam dengan sebenar-benarnya sebagai penghormatan dan pengagungan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "56. Sesungguhnya Allah memuji Rasul Muhammad -ṣallallāhu 'alaihi wa sallam- di hadapan para Malaikat-Nya, dan para malaikat-Nya berdoa untuknya. Wahai orang-orang yang beriman kepada Allah dan melaksanakan apa yang disyariatkan-Nya untuk hamba-hamba-Nya, berselawatlah atas Rasul dan berikan salam penghormatan kepadanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "56. Allah dan para malaikat-Nya yang mulia bershalawat kepada Nabi Muhammad. Shalawat dari Allah adalah rahmat dan pujian baginya, sedangkan shalawat bagi malaikat adalah doa dan pujian baginya. Hai orang-orang beriman, maka bershalawatlah kepada Nabi kalian, yang berkat beliau, Allah mengeluarkan kalian dari kegelapan menuju cahaya, memberi kalian hidayah, dan rahmat. Beliau telah mengorbankan hidupnya untuk berjuang dan membimbing umatnya; maka ucapkanlah shalawat dan salam kepada beliau sebagaimana yang Allah ajarkan kepada kalian. Dan shalawat orang-orang beriman kepada Rasulullah adalah pujian dan doa baginya agar Allah meninggikan derajatnya dan menambah kemuliaannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "56. إِنَّ اللهَ وَمَلٰٓئِكَتَهُۥ (Sesungguhnya Allah dan malaikat-malaikat-Nya) Yakni Allah mengabarkan hamba-hamba-Nya tentang kedudukan nabi Muhammad di sisi-Nya di depan para malaikat, bahwa Dia memujinya di hadapan mereka, dan mereka bershalawat kepadanya, serta memerintahkan hamba-hamba-Nya agar mengikuti hal ini dengan bershalawat kepadanya pula. Para ulama telah bersepakat bahwa shalawat kepada Nabi hukumnya wajib bagi setiap muslim, dan paling sedikit sekali seumur hidup. Dan lafadz ‘shalawat dan salam atas Rasulullah’ adalah syi’ar khusus baginya, sehingga tidak diperbolehkan untuk mengatakan ‘shalawat atas si fulan’ tanpa menyebutkan Rasulullah, namun dibolehkan setelah menyebut nama Rasulullah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "56. Sesungguhnya Allah dan para malaikat senantiasa bershalawat kepada Nabi Muhammad sebagai pemuliaan atas derajatnya. Wahai orang-orang mukmin bershalawat dan haturkanlah salam kepada Nabi. Makna shalawat dari Allah adalah berupa rahmat dan ridho. Adapun dari melaikat adalah doa dan permohonan ampun untuk Nabi, sedangkan shalawar dari orang mukmin adalah doa dan pengagungan. Sehingga dari itu, pujian atas Nabi dari penduduk langit dan bumi menjadi terkumpul dan tercucur. Penekanan penghaturan shalawat dari Allah dan malaikat tanpa penyebutan salam menunjukkan bahwa shalawat dari Allah dan malaikat sudah mencukupi."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya Allah dan para malaikatNya bershalawat untuk Nabi} memuji nabi SAW dengan menampakkan kemuliaannya dan mengagungkan perkara tentangnya {Wahai orang-orang yang beriman, berselawatlah kamu untuk Nabi dan ucapkanlah salam dengan penuh hormat kepadanya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "56. Ini mengandung pemberitahuan akan kesempurnaan Rasulullah, ketinggian derajatnya dan kemuliaan kedudukannya di sisi Allah dan di sisi MakhlukNya serta ketinggian popularitasnya, dan “sesungguhnya Allah” “dan malaikat-malaikatNya bershalawat” untuknya. Maksudnya, Allah memujinya di hadapan para malaikatNya dan malaikat muqarrabun yang paling tinggi kedudukannya, karena kecintaan Allah kepadanya, dan para malaikat yang muqarrabun (dekat kepada Allah) pun memuji dan mendoakannya. “Hai orang-orang yang beriman, bershalawatlah kamu untuk Nabi dan ucapkanlah salam penghormatan kepadanya,” dengan meneladani Allah dan para malaikatNya, dan sebagai balasan baginya atas sebagian hak-haknya pada diri kalian, sebagai pelengkap iman kalian, untuk menghormati, mencintai dan memuliakannya, dan untuk menambah amal kebajikan kalian serta penghapus bagi dosa-dosa kalian. Dan bentuk shalawat yang paling utama adalah shalawat yang diajarkannya kepada para sahabatnya: \"اللهم صل على محمد وعلى آل محمد كما صليت على آل إبراهيم إنك حميد مجيد، وبارك على محمد وعلى آل محمد كما باركت على آل إبراهيم إنك حميد مجيد\" Perintah bershalawat dan salam untuk nabi ini disyariatkan di dalam seluruh waktu, dan kebanyakan para ulama mewajibkannya di dalam shalat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahzab ayat 56: Allah memuliakan Nabi-Nya Muhammad ﷺ dan mengabarkan kedudukannya di sisi-Nya. Dan bahwasanya Allah memuji Nabi ﷺ dan menyanjungnya, dan para malaikat juga memujinya. Kemudian Allah memerintahkan orang-orang yang beriman yang mereka membenarkan Allah dan Rasul-Nya ﷺ serta beramal dengan syariat-Nya dengan bershalwat dan salam kepada Nabi. Maka dengan ini terkumpullah bagi Nabi ﷺ pujian-pujian dan mendoakan Rasulullah ﷺ. Kemudian Allah memerintahkan orang-orang yang beriman yang mereka membenarkan Allah dan Rasul-Nya ﷺ serta beramal dengan syariat-Nya dengan bershalwat dan salam kepada Nabi, maka dengan ini semua terkumpul pujian dan doa dari penduduk langit dan bumi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini mengingatkan tentang sempurnanya Rasulullah shallallahu 'alaihi wa sallam, tingginya derajat Beliau, demikian pula kedudukannya di sisi Allah dan di hadapan makhluk-Nya serta tinggi namanya. Yakni Allah memuji Beliau di hadapan para malaikat, karena Allah cinta kepada Beliau, para malaikat yang didekatkan pun memuji Beliau serta mendoakannya. Karena mengikuti Allah dan para malaikat-Nya serta sebagai balasan terhadap jasanya, sekaligus untuk menyempurnakan iman kita, sebagai bentuk pemuliaan terhadap Beliau, penghormatan dan kecintaan kepada Beliau serta untuk menambah kebaikan kita, menghapuskan kesalahan kita. Ucapan shalawat dan salam yang terbaik adalah yang Beliau ajarkan kepada para sahabatnya, yaitu yang biasa kita baca dalam tasyahud. Bershalawat kepada Nabi shallallahu 'alaihi wa sallam diperintahkan dalam setiap waktu, terutama sekali ketika nama Beliau disebut, dalam shalat setelah tasyahhud, takbir kedua dalam shalat janazah, masuk dan keluar masjid, dalam qunut witir, pada siang dan malam Jum’at, setelah mendengar azan, dalam dzikr pagi dan petang, dan sebelum berdoa, dan duduk di suatu majlis (sebagaimana diterangkan dalam beberapa hadits). Demikian pula dalam khutbah dan mukaddimah (pengantar)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 56",
    "description": "Allah menurunkan ketentuan tentang etika bagi umat islam ketika berinteraksi dengan istri-istri untuk menjaga kehormatan dan keagungan pribadi rasulullah. Di antara bukti keagungan beliau ialah bahwa sesungguhnya Allah dan para malaikat-Nya bersalawat untuk nabi. Salawat dari Allah berarti memberi rahmat, dan dari malaikat berarti memohonkan ampunan. Karena itu, wahai orang-orang yang beriman! bersalawatlah kamu untuk nabi, seperti dengan berkata all'humma 'alli 'al' mu'ammad (semoga Allah melimpahkan kebaikan dan ke-berkahan kepada nabi Muhammad), dan ucapkanlah salam dengan penuh penghormatan kepadanya, dengan mengucapkan perkataan seperti assal'mu 'alaika ayyuhan-nabiy (semoga keselamatan tercurah kepadamu, wahai nabi). 57. Setelah meminta orang yang beriman untuk bersalawat kepada nabi pada ayat yang lalu, Allah lalu menyusulinya dengan ancaman kepada orang yang menyakiti beliau. Sesungguhnya terhadap orang-orang yang menyakiti Allah dan rasul-Nya, baik dengan ucapan maupun perbuatan, Allah akan melaknatnya, menjauhkannya dari rahmat Allah, di dunia dan di akhirat, dan menyediakan azab yang menghinakan bagi me-reka."
  }
]