[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang yang menyakiti Allah dengan berbuat syirik atau kemaksiatan-kemaksiatan lainnya dan menyakiti Rasulullah dengan kata-kata dan perbuatan, Allah menjauhkan dan mengusir mereka dari segala kebaikan di dunia dan di akhirat. Allah menyiapkan untuk mereka siksa yang menghinakan mereka dan merendahkan mereka di akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "57. Sesungguhnya orang-orang yang menyakiti Rasulullah dengan ucapan maupun perbuatan, niscaya Allah menjauhkannya dan mengusirnya dari kelapangan rahmat-Nya di dunia dan di Akhirat, dan menyiapkan bagi mereka di Akhirat siksa yang menghinakan sebagai balasan atas perlakuan mereka yang menyakiti Rasul-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "57. Orang-orang yang menyakiti Allah dengan menyelisihi perintah-perintah-Nya, melanggar larangan-larangan-Nya, dan mengganggu para nabi dan kekasih-Nya; dan menyakiti Rasulullah dengan menyelisihi tuntunannya dan melalaikan sunnahnya, melanggar haknya, mengganggu keluarga dan para sahabatnya, atau menghina kepribadian dan akhlaknya; maka Allah melaknat mereka di dunia dan di akhirat, mereka adalah orang-orang yang jauh dari rahmat-Nya dan berhak mendapat azab yang menghinakan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "57. إِنَّ الَّذِينَ يُؤْذُونَ اللهَ وَرَسُولَهُۥ (Sesungguhnya orang-orang yang menyakiti Allah dan Rasul-Nya) Mereka adalah orang-orang musyrik, Yahudi, dan Nasrani yang menjadikan seorang anak bagi Allah. Dan termasuk dari mereka semua orang yang menghina Allah –Maha Tinggi dan Maha Suci Dia— atau orang yang menisbatkan kepadanya sesuatu yang mengandung penghinaan bagi-Nya dengan cara apapun itu. Sedangkan orang-orang yang menyakiti Rasulullah adalah orang-orang yang mendustakannya, melukai kepalanya, mematahkan gigi serinya, dan menuduhnya gila, penyair, pendusta, atau penyihir, serta semua orang yang menyakitinya dengan perkataan atau perbuatan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "57. Sesungguhnya mereka yang telah durhaka kepada Allah dengan menganggap Allah mempunyai anak dan sekutu, juga mereka yang telah mendurhakai Rasul dengan mendustakan dan mengumpat/menyakiti dakwah Nabi, seperti dikatakan: “Bagaimana bisa dia menikahi istri dari puteranya, juga menghalalkan untuk dirinya apa yang haram untuk umatnya.” Orang yang berkata demikian sungguh orang-orang musyrik Yahudi dan Nasrani. Allah telah menjauhkan dan menolak mereka dari anugerah rahmat-Nya di dunia maupun di akhirat. Allah telah menyiapkan untuk mereka azab yang pedih yang akan menghinakan mereka. Ayat ini turun untuk orang-orang yang yang telah mengumpat Nabi ketika Nabi memperistri Safiyah binti Huyai, yang disebabkan adanya tuduhan dari Aisyah tentang Safiyah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang yang menista Allah dan RasulNya, akan dilaknat Allah} mereka akan dijauhkan dan diusir oleh Allah dari rahmatNya {di dunia dan di akhirat dan menyediakan bagi mereka azab yang menghinakan} menghinakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "57-58. Setelah Allah memerintahkan menghormati Rasulullah, dan bershalawat dan salam untuknya, maka Allah melarang menyakitinya dan Dia mengancam atas tindakan ini, seraya berfirman, “Sesungguhnya orang-orang yang menyakiti Allah dan RasulNya.” ini menyakiti dalam bentuk ucapan atau perbuatan berupa tindakan mencela dan memaki atau melecehkannya, atau melecehkan agamanya, atau apa saja yang dapat berakibat menyakitinya, “Allah akan melaknatinya di dunia,” yakni: mengusir dan menjauhkan mereka. Di antara laknat atau kutukan terhadap mereka di dunia adalah Dia memastikan terbunuhnya orang yang mencela Rasulullah dan menyakitinya. “Dan di akhirat, dan menyediakan baginya siksa yang menghinakan.” Sebagai balasan baginya atas perbuatan menyakiti Nabi adalah dia disakiti dengan azab yang sangat pedih. Jadi, menyakiti Rasulullah itu tidak sama dengan menyakiti selain beliau, sebab seorang hamba itu belum beriman kepada Allah hingga beriman kepada RasulNya, sedangkan beliau mempunyai hak untuk dihormati yang merupakan konsekuensi dari iman, di mana hal ini menuntut agar beliau tidak diperlakukan seperti selainnya, meskipun menyakiti orang-orang Mukmin pun merupakan perbuatan keji dan dosanya sangat besar. Maka dari itu Allah berfirman tentang hal ini, “Dan orang-orang yang menyakiti orang-orang Mukmin dan Mukminat tanpa kesalahan yang mereka perbuat,” maksudnya, tanpa perbuatan dosa dari mereka yang mengharuskan untuk disakiti, “maka sesungguhnya mereka telah memikul” di punggung mereka “kebohongan” karena mereka telah menyakiti mereka tanpa sebab, “dan dosa yang nyata,” karena mereka menzhalimi orang-orang beriman dan menodai kehormatan yang diperintahkan oleh Allah untuk dihormati. Maka dari itu, mencela seorang yang beriman dan menodai kehormatan yang diperintahkan oleh Allah untuk dihormati. Maka dari itu, mencela seorang yang beriman mengharuskan (mengakibatkan) hukum dera (ta’zir) sesuai dengan kondisi orang Mukmin yang disakiti itu dan ketinggian kedudukannya. Jadi, mendera orang yang mencaci sahabat itu lebih keras, dan mendera orang yang mencaci ulama atau ahli agama itu lebih besar daripada mencaci selain mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahzab ayat 57: Allah mengabarkan orang-orang yang mencela Allah dan Rasul-Nya ﷺ dari celaan apapun; Dengan ucapan, perbuatan, paksaan, hinaan dan perendahan; Mereka adalah orang-orang yang jauh dari Allah dan terhalang dari rahmat-Nya, Allah akan timpakan adzab kepada mereka yang akan mereka dapatkan di akhirat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala memerintahkan untuk memuliakan Rasul-Nya shallallahu 'alaihi wa sallam, bershalawat dan mengucapkan salam kepada Beliau, maka Allah Subhaanahu wa Ta'aala melarang menyakitinya dan mengancam orang yang menyakitinya sebagaimana dalam firman-Nya di atas. Baik dengan mencaci-maki, mencacatkannya maupun mencacatkan agamanya. Termasuk orang-orang yang menyakiti Allah dan Rasul-Nya adalah orang-orang yang menyifati Allah dengan sifat yang Dia bersih lagi suci darinya, seperti anak dan sekutu, serta mendustakan Rasul-Nya shallallahu 'alaihi wa sallam. Termasuk laknat untuk mereka di dunia adalah keharusan dibunuh orang yang mencaci-maki Rasulullah shallallahu 'alaihi wa sallam. Yang demikian karena menyakiti Rasulullah shallallahu 'alaihi wa sallam tidaklah seperti menyakiti selain Beliau, di mana seseorang tidaklah beriman kepada Allah sampai dia beriman kepada Rasul-Nya shallallahu 'alaihi wa sallam dan Beliau berhak dimuliakan karena termasuk lawazim (yang menyatu) dengan keimanan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 57",
    "description": "Setelah meminta orang yang beriman untuk bersalawat kepada nabi pada ayat yang lalu, Allah lalu menyusulinya dengan ancaman kepada orang yang menyakiti beliau. Sesungguhnya terhadap orang-orang yang menyakiti Allah dan rasul-Nya, baik dengan ucapan maupun perbuatan, Allah akan melaknatnya, menjauhkannya dari rahmat Allah, di dunia dan di akhirat, dan menyediakan azab yang menghinakan bagi me-reka. 58. Termasuk kategori menyakiti nabi adalah menyakiti orang-orang yang beriman. Dan karena itu, Allah menegaskan bahwa orang-orang yang menyakiti dengan menuduh, menghina, dan mengganggu orang-orang mukmin laki-laki dan perempuan, tanpa ada kesalahan berupa perbuatan buruk yang sengaja mereka perbuat (lihat juga: al-baqarah/2: 286), maka sungguh, mereka telah memikul kebohongan dan dosa yang nyata yang menyebabkan mereka layak menerima azab dari Allah. Dari ayat ini tidak dapat diambil kesimpulan bahwa orang mukmin yang melakukan perbuatan buruk boleh disakiti, dihina, atau diganggu."
  }
]