[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang yang menyakiti orang-orang Mukmin, baik laki-laki maupun perempuan dengan kata-kata maupun perbuatan bukan karena dosa yang mereka lakukan, maka mereka telah melakukan kedustaan dan dosa yang paling buruk, dan melakukan dosa yang paling jahat, yang karenanya mereka berhak dihukum setimpal di akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "58. Dan orang-orang yang menyakiti kaum mukminin dan mukminat dengan ucapan maupun perbuatan tanpa adanya dosa yang mereka lakukan seperti perbuatan jahat yang mengharuskan untuk disakiti, maka sesungguhnya mereka telah melakukan kedustaan dan dosa yang jelas."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "58. Dan orang-orang yang menyakiti hamba-hamba Allah yang beriman tanpa sebab dosa dan kesalahan yang mengharuskannya mendapat hukuman, maka mereka telah melakukan kedustaan dan dosa yang jelas, mereka tidak akan terbebas dari dosa itu hingga mereka bertaubat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "58. وَالَّذِينَ يُؤْذُونَ الْمُؤْمِنِينَ وَالْمُؤْمِنٰتِ (Dan orang-orang yang menyakiti orang-orang yang mukmin dan mukminat) Dengan cara apapun baik itu dengan perkataan maupun perbuatan. بِغَيْرِ مَا اكْتَسَبُوا۟( tanpa kesalahan yang mereka perbuat) Yakni tanpa alasan yang benar. Dan alasan yang benar seperti jika seseorang dihina, dipukul, atau dibunuh maka ia boleh membalasnya sebagai qishash baginya; dan jika dia menusak suatu benda maka pelakunya harus menggantinya, atau jika ia melakukannya dengan sengaja maka ia harus dihukum ta’zir."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "58. Orang-orang yang telah menyakiti orang-orang mukmin laki-laki dan perempuan dengan perkataan maupun perbuatan yang tercela, dengan mencela/mengumpat atau menganiaya atau membunuh seorang mukmin, maka sejatinya mereka telah membawa beban dusta yang buruk. Ibnu Abbas mengatakan: Ayat ini turun untuk Abdullah bin Ubai dan orang-orang yang bersamanya. Mereka menghasut Aisyah radliyallahu ‘anha. Nabi berkata: Siapa memintakan maaf untuk orang yang telah menyakitiku, serta mengumpulkan di dalam rumahnya beserta orang-orang yang menyakitiku. Muqatil berpendapat bahwa ayat ini turun untuk Ali, karena beberapa orang munafik telah menyakitinya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Orang-orang yang menyakiti orang-orang mukmin laki-laki dan perempuan, tanpa ada kesalahan yang mereka lakukan} tanpa ada dosa yang mereka kerjakan {sungguh, mereka telah menanggung} menanggung {kebohongan} kebohongan menjijikkan {dan dosa yang nyata} yang nyata"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "57-58. Setelah Allah memerintahkan menghormati Rasulullah, dan bershalawat dan salam untuknya, maka Allah melarang menyakitinya dan Dia mengancam atas tindakan ini, seraya berfirman, “Sesungguhnya orang-orang yang menyakiti Allah dan RasulNya.” ini menyakiti dalam bentuk ucapan atau perbuatan berupa tindakan mencela dan memaki atau melecehkannya, atau melecehkan agamanya, atau apa saja yang dapat berakibat menyakitinya, “Allah akan melaknatinya di dunia,” yakni: mengusir dan menjauhkan mereka. Di antara laknat atau kutukan terhadap mereka di dunia adalah Dia memastikan terbunuhnya orang yang mencela Rasulullah dan menyakitinya. “Dan di akhirat, dan menyediakan baginya siksa yang menghinakan.” Sebagai balasan baginya atas perbuatan menyakiti Nabi adalah dia disakiti dengan azab yang sangat pedih. Jadi, menyakiti Rasulullah itu tidak sama dengan menyakiti selain beliau, sebab seorang hamba itu belum beriman kepada Allah hingga beriman kepada RasulNya, sedangkan beliau mempunyai hak untuk dihormati yang merupakan konsekuensi dari iman, di mana hal ini menuntut agar beliau tidak diperlakukan seperti selainnya, meskipun menyakiti orang-orang Mukmin pun merupakan perbuatan keji dan dosanya sangat besar. Maka dari itu Allah berfirman tentang hal ini, “Dan orang-orang yang menyakiti orang-orang Mukmin dan Mukminat tanpa kesalahan yang mereka perbuat,” maksudnya, tanpa perbuatan dosa dari mereka yang mengharuskan untuk disakiti, “maka sesungguhnya mereka telah memikul” di punggung mereka “kebohongan” karena mereka telah menyakiti mereka tanpa sebab, “dan dosa yang nyata,” karena mereka menzhalimi orang-orang beriman dan menodai kehormatan yang diperintahkan oleh Allah untuk dihormati. Maka dari itu, mencela seorang yang beriman dan menodai kehormatan yang diperintahkan oleh Allah untuk dihormati. Maka dari itu, mencela seorang yang beriman mengharuskan (mengakibatkan) hukum dera (ta’zir) sesuai dengan kondisi orang Mukmin yang disakiti itu dan ketinggian kedudukannya. Jadi, mendera orang yang mencaci sahabat itu lebih keras, dan mendera orang yang mencaci ulama atau ahli agama itu lebih besar daripada mencaci selain mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahzab ayat 58: Allah mengabarkan bahwasanya orang-orang yang menyakiti orang-orang yang beriman dengan apapun dengan tanpa hak dan sebab; Maka mereka membawa di punggung-punggung mereka kejahatan dan dosa, mereka akan mendapatkan balasan atas perbuatan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Oleh karena itu, mencaci-maki salah seorang kaum mukmin menghendaki untuk diberi hukuman ta’zir (hukuman yang mendidik) sesuai keadaan orang yang dicaci-maki dan kedudukannya. Dan menta’zir orang yang mencaci maki sahabat lebih pantas lagi, dan bahwa mencaci maki para ulama dan orang-orang yang baik agamanya lebih besar dosanya daripada selain mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 58",
    "description": "Termasuk kategori menyakiti nabi adalah menyakiti orang-orang yang beriman. Dan karena itu, Allah menegaskan bahwa orang-orang yang menyakiti dengan menuduh, menghina, dan mengganggu orang-orang mukmin laki-laki dan perempuan, tanpa ada kesalahan berupa perbuatan buruk yang sengaja mereka perbuat (lihat juga: al-baqarah/2: 286), maka sungguh, mereka telah memikul kebohongan dan dosa yang nyata yang menyebabkan mereka layak menerima azab dari Allah. Dari ayat ini tidak dapat diambil kesimpulan bahwa orang mukmin yang melakukan perbuatan buruk boleh disakiti, dihina, atau diganggu. 59. Setelah menjelaskan larangan menyakiti, menghina, dan mengganggu nabi dan orang-orang yang beriman, Allah lalu memerintah perempuan mukmin, khususnya istri-istri nabi, agar mengenakan jilbab supaya terhindar dari gangguan dan hinaan orang-orang jahat. Jilbab adalah baju longgar yang menutupi baju dan kerudung wanita atau baju luar bagi wanita. Model jilbab beragam sesuai selera pengguna dan adat suatu daerah. Di indonesia, jilbab dikenal sebagai penutup kepala wanita. Jilbab harus memenuhi beberapa kriteria, yakni tidak transparan dan dapat menutupi kepala, leher, serta dada. Sebelum ayat ini turun, pakaian wanita merdeka dan budak hampir sama. Kesamaan itu membuat mereka sulit dibedakan, sehingga laki-laki iseng terkadang menggoda perempuan merdeka karena disangkanya budak."
  }
]