[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai Nabi, katakan kepada istri-istrimu, anak-anak perempuanmu dan wanita-wanita kaum Mukminin agar mereka menjulurkan kain-kain mereka dari kepala dan wajah mereka untuk menutupi wajah mereka, kepala dan dada mereka. Hal itu lebih dekat kepada keterjagaan dan perlindungan sehingga mereka tidak beresiko diganggu atau dijahili. Allah Maha Pengampun lagi Maha Penyayang di mana Dia mengampuni apa yang telah berlalu dari kalian, Dia menyayangi kalian dengan apa yang Dia jelaskan, mana yang halal dan mana yang haram."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "59. Wahai Nabi! Ucapkanlah kepada istri-istrimu, katakan kepada anak-anak perempuanmu dan katakan kepada istri-istri kaum mukminin, agar mereka memanjangkan jilbab yang mereka pakai ke seluruh tubuh mereka sehingga aurat mereka tidak tersingkap di hadapan lelaki asing. Yang demikian ini agar mereka lebih mudah dikenali sebagai orang merdeka, sehingga tidak ada orang yang mengganggu mereka sebagaimana gangguan yang biasa dialami oleh hamba sahaya perempuan. Dan Allah Maha Pengampun atas dosa-dosa para hamba-Nya yang bertobat kepada-Nya, lagi Maha Penyayang kepada mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "59. Hai Nabi, katakanlah kepada para istri dan anak perempuanmu serta seluruh wanita Muslimah agar mereka menjulurkan kain jilbab untuk menjaga kehormatan dan kesucian mereka, sehingga tidak ada yang berani mengganggu mereka. Jilbab adalah tanda kemuliaan dan keutamaan, dan pakaian kewibawaan. Hal itu menjadikan mereka lebih mudah dikenal sebagai orang-orang beriman dan terhormat, sehingga tidak ada yang akan berani mengganggu. Allah Maha Mengampuni mereka atas perbuatan mereka yang telah lalu ketika mereka belum mengetahui hukum ini; dan Allah Maha Mengasihi mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "59. عَلَيْهِنَّ مِن جَلٰبِيبِهِنَّ ۚ(Hendaklah mereka mengulurkan jilbabnya) Makna jilbab adalah pakaian yang menutup seluruh tubuh perempuan. Dan makna mengulurkannya adalah dengan menjulurkannya sampai menutupi perhiasannya yang Allah perintahkan untuk ditutupi. ذٰلِكَ (Yang demikian itu) Yakni mengulurkan jilbab itu. أَدْنَىٰٓ أَن يُعْرَفْنَ (supaya mereka lebih mudah untuk dikenal) Yakni agar mudah dikenali oleh orang yang melihat mereka sehingga dapat terbedakan dari para budak wanita, dan menjadi jelas bagi orang bahwa mereka adalah para wanita merdeka yang suci dan menjaga kehormatan. فَلَا يُؤْذَيْنَ ۗ (karena itu mereka tidak di ganggu) Yakni diganggu oleh pihak yang dalam hatinya terdapat penyakit dengan mencoba menodai mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "59. Ayat tentang hijab/penutup ini, wahai Nabi katakanlah kepada para istri dan puterimmu, juga kepada para mukmin perempuan apabila mereka keluar dari rumah: Agar mereka melonggarkan dan menggeraikan sebagian pakaian mereka di atas mereka yang dapat menutupi seluruh badan mereka. Adapun jilbab adalah pakaian luar yang dapat menutupi seluruh badan. Maksudnya adalah untuk menggeraikan sebagaian pakaian yang dapat menutupi wajah selain mata. Ini dimaksudkan sebagai ciri bahwa mereka adalah perempuan yang merdeka bukan sorang budak/sahaya. Sehingga mereka tidak akan diganggu oleh orang fasik. Sesungguhnya Allah Maha mengampuni terhadap pendahulu mereka yang telah meninggalkan penutup badan, dan Maha Pengasih kepada hamba-Nya. Abu Malik berkata: Dulu para mukmin perempuan keluar malam hari untuk memenuhi hajat mereka, kemudian orang-orang munafik mengganggu dan menyakiti mereka. Kemudian turunlah ayat ini."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Wahai Nabi, katakanlah kepada istri-istrimu, anak-anak perempuanmu dan istri-istri orang mukmin supaya mereka mengulurkan ke tubuh mereka} mengulurkan pada kepala dan wajah mereka {jilbab mereka} selendang dan kain penutup mereka {Yang demikian itu agar mereka lebih mudah} lebih dekat {untuk dikenali} untuk dikenali bahwa mereka merdeka {sehingga mereka tidak diganggu} sehingga mereka tidak diperlakukan dengan perlakuan yang dibenci dan menyakitkan {Allah Maha Pengampun lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "59. Ayat ini disebut ayat hijab. Allah memerintahkan NabiNya untuk memerintah kaum wanita secara umum, dan dimulai dari istri-istrinya dan putri-putrinya, karena mereka lebih ditekankan (menjalankan perintah) daripada selain mereka, dank arena pemberi perintah untuk orang lain semestinya memulainya dari keluarganya sebllah memerintahkan NabiNya untuk memerintah kaum wanita secara umum, dan dimulai dari istri-istrinya dan putri-putrinya, karena mereka lebih ditekankan (menjalankan perintah) daripada selain mereka, dank arena pemberi perintah untuk orang lain semestinya memulainya dari keluarganya sebelum memerintah orang lain, sebagaimana Firman Allah, \"Hai orang-orang yang beriman, peliharalah dirimu dan keluargamu dari api neraka\" (At-Tahrim:6). “Hendaklah mereka mengulurkan jilbabnya ke seluruh tubuh mereka.” Jilbab ini kain yang melapisi pakaian, berupa selimut, khimar (kerudung), kain sorban atau yang serupa dengannya. Maksudnya, hendaklah mereka menutup wajahnya dan dadanya dengannya. Kemudian Allah menyebutkan hikmahnya, “Yang demikian itu supaya mereka lebih mudah untuk dikenali, karena itu mereka tidak diganggu.” Ini menunjukkan adanya gangguan apabila mereka kaum wanita beriman) tidak mengenakan jilbab, maka mereka akan mudah diduga bukan wanita-wanita suci (terhormat), sehingga mudah didatangi oleh orang yang hatinya sakit lalu mengganggu mereka, dan bisa saja mereka dilecehkan, dan mereka diduga sebagai perempuan-perempuan budah sahaya. Dan akibatnya orang-orang yang menginginkan keburukan meremehkan mereka. Jadi, hijab itu memutus hasrat busuk orang-orang yang berhasrat buruk terhadap mereka. “Dan Allah Maha Pengampun lagi Maha Penyayang,” di mana Dia mengampuni kesalahan-kesalahan kalian yang telah lalu dan bebelas kasih kepada kalian dengan menjelaskan hukum-hukumNya kepada kalian dan menjelaskan sesuatu yang halal dan haram. Ini adalah menutup pintu dari arah mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahzab ayat 59: Allah memerintahkan Nabi-Nya ﷺ untuk mewajibkan hijab bagi istri-istri Nabi ﷺ, anak-anak perempuannya dan wanita-wanita yang beriman, Allah berkata : Wahai Nabi ﷺ katakanlah kepada istri-istrimu, anak-anak perempuanmu dan wanita-wanita yang beriman untuk mengulurkan hijab mereka sampai menutupi kepala, wajah dan dada-dada mereka, semua yang tertutup tersebut akan menghindarkan dari pandangan orang-orang bodoh, dan akan menampakkan bahwasanya mereka adalah wanita-wanita yang merdeka. Sungguh Allah Maha Pengampun bagi siapa yang bertaubat, yang memiliki banyak rahmat bagi siapa yang mengharapkannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini dinamakan ayat hijab, di mana Allah memerintahkan Nabi-Nya menyuruh kaum wanita secara umum, dan dimulai dengan istri dan putri Beliau karena mereka lebih ditekankan daripada selainnya, di samping itu orang yang memerintahkan orang lain sepatutnya memulai keluarganya lebih dahulu sebelum selain mereka sebagaimana firman Allah Ta’ala, “Wahai orang-orang yang beriman, peliharalah dirimu dan keluargamu dari api neraka yang bahan bakarnya adalah manusia dan batu; penjaganya malaikat-malaikat yang kasar, keras, dan tidak mendurhakai Allah terhadap apa yang diperintahkan-Nya kepada mereka dan selalu mengerjakan apa yang diperintahkan.” (Terj. At Tahrim: 6) Menurut As Suddiy, sebab turunnya ayat ini adalah karena orang-orang fasik biasa menganggu kaum wanita ketika mereka keluar di malam hari. Ketika mereka melihat wanita yang memakai penutup muka, maka mereka membiarkannya (tidak mengganggunya), akan tetapi ketika mereka melihat tanpa penutup muka, mereka berkata, “(Ia) adalah seorang budak.” Lalu mereka mengganggunya, maka turunlah ayat ini. Jilbab ialah sejenis baju kurung yang lebar yang dapat menutup seluruh tubuh wanita di samping baju biasa (baju yang biasa dipakai dalam rumah oleh wanita) dan kerudung. Menurut Ibnu Abbas dan Abu Ubaidah, bahwa kaum wanita diperintahkan menutup kepala dan muka mereka dengan jilbab selain satu mata, agar diketahui sebagai wanita merdeka. Dengan demikian, maksud ayat ini adalah hendaknya mereka tutup dengan jilbab mereka kepala, muka dan dada. Bahwa mereka adalah wanita-wanita merdeka. Berbeda dengan budak yang tidak menutupi wajahnya, sehingga mereka diganggu oleh kaum munafik. Karena Dia mengampuni perbuatan di masa lalu dan merahmati mereka dengan menerangkan beberapa hukum, menerangkan yang halal dan yang haram."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 59",
    "description": "Setelah menjelaskan larangan menyakiti, menghina, dan mengganggu nabi dan orang-orang yang beriman, Allah lalu memerintah perempuan mukmin, khususnya istri-istri nabi, agar mengenakan jilbab supaya terhindar dari gangguan dan hinaan orang-orang jahat. Jilbab adalah baju longgar yang menutupi baju dan kerudung wanita atau baju luar bagi wanita. Model jilbab beragam sesuai selera pengguna dan adat suatu daerah. Di indonesia, jilbab dikenal sebagai penutup kepala wanita. Jilbab harus memenuhi beberapa kriteria, yakni tidak transparan dan dapat menutupi kepala, leher, serta dada. Sebelum ayat ini turun, pakaian wanita merdeka dan budak hampir sama. Kesamaan itu membuat mereka sulit dibedakan, sehingga laki-laki iseng terkadang menggoda perempuan merdeka karena disangkanya budak. 60-61. Setelah memerintahkan perempuan yang beriman untuk mengenakan jilbab, Allah lalu menjelaskan ancaman kepada para pengganggu yang pada umumnya kaum munafik. Sungguh, jika orang-orang munafik, yaitu mereka yang pura-pura beriman tetapi hatinya ingkar; orang-orang yang berpenyakit dalam hatinya, seperti dengki dan dendam sehingga gemar menyakiti dan mengganggu orang-orang beriman; dan orang-orang yang menyebarkan kabar bohong di madinah tidak berhenti menyakitimu, niscaya kami perintahkan engkau, wahai nabi Muhammad, untuk memerangi mereka, kemudian mereka tidak lagi menjadi tetanggamu di madinah kecuali sebentar serta dalam keadaan terlaknat dan terhina. Di mana saja mereka dijumpai, mereka akan ditang-kap dan dibunuh tanpa ampun."
  }
]