[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Nabi Muhammad lebih berhak terhadap orang-orang Mukmin dan lebih dekat kepada mereka daripada diri mereka sendiri dalam perkara agama dan dunia. Kehormatan istri-istri Nabi atas umatnya adalah seperti kehormatan ibu-ibu mereka, tidak boleh menikahi istri-istri Nabi sesudah beliau. Sedangkan para pemilik hubungan kekerabatan di kalangan kaum Muslimin, sebagian dari mereka lebih berhak atas warisan sebagian yang lain dalam hokum Allah dan SyariatNya daripada warisan berdasarkan iman dan hijrah. (dahulu Kaum Muslimin di awal-awal Islam saling mewarisi berdasarkan iman dan hijrah, bukan kekerabatan, kemudian hal itu mansukh dengan ayat-ayat warisan). Kecuali bila kalian (wahai kaum Muslimin) berkenan melakukan kebaikan kepada selain ahli waris dalam bentuk bantuan, kebaikan, silaturahim, wasiat dan kebaikan lainnya. Hukuman tersebut telah ditakdirkan dan ditetapkan di Lauhul Mahfuzh, maka kalian wajib melaksanakannya. Ayat ini mewajibkan sesorang lebih mencintai Nabi daripada dirinya sendiri, wajib tunduk secara utuh kepada beliau, wajib menghormati Ummahatul Mukminin, yaitu para istri Nabi, dan bahwasanya mencaci mereka merupakan kerugian yang sangat nyata."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Nabi Muhammad -ṣallallāhu 'alaihi wa sallam- lebih utama bagi orang-orang yang beriman daripada diri mereka sendiri dalam segala ajakannya terhadap mereka, meski hati mereka lebih condong kepada selain beliau, dan istri-istri beliau seperti ibu bagi seluruh kaum beriman, maka diharamkan atas setiap muslim untuk menikahi salah satu dari mereka setelah beliau wafat. Dan orang yang mempunyai hubungan kekerabatan, sebagian dari mereka lebih utama dari sebagian yang lain dalam hal warisan di dalam hukum Allah daripada orang yang berimana dan berhijrah di jalan Allah, yang sebelumnya saling mewarisi di antara mereka pada awal permulaan Islam, kemudian saling mewarisi ini dihapuskan setelah itu, kecuali apabila kalian -wahai orang-orang yang beriman- melakukan kebaikan kepada wali-wali kalian yang bukan ahli waris, seperti memberi wasiat atau memberi kebaikan (hadiah) kepada mereka, maka hal itu dibolehkan bagi kalian. Hukum tersebut sudah tertulis di dalam lauḥul maḥfūẓ, maka wajib dijalankan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "6. Nabi Muhammad lebih berhak menentukan hukum yang dia kehendaki bagi orang-orang beriman; dan istri-istrinya sama seperti ibu mereka dalam hal keharamannya, yakni istri-istri Nabi haram mereka nikahi setelah kematian beliau. Dan kerabat lebih berhak mendapat harta warisan dalam syariat Allah daripada hak orang-orang beriman yang lain yang tidak memiliki hubungan kerabat -sebab hukum pewarisan dengan sebab hijrah dan kesepakatan telah dihapus dengan ayat ini-; kecuali jika kalian memberi wasiat kepada teman yang memiliki kesepakatan dengan kalian agar mereka mendapat kebaikan. Hukum yang agung dan kebenaran yang mulia ini telah tertulis dalam lauhul mahfudh, sehingga wajib untuk dijalankan. Abu Hurairah meriwayatkan dari Nabi, beliau bersabda: “Tidak ada seorangpun yang beriman melainkan aku harus lebih dia utamakan dari siapapun di dunia dan di akhirat. Jika kalian ingin maka bacalah firman Allah: ‘Nabi itu (hendaknya) lebih utama bagi orang-orang mukmin dari diri mereka sendiri’. Dan jika ada orang beriman yang wafat dan meninggalkan harta, maka harta itu bagi kerabat-kerabatnya. Dan jika dia meninggalkan hutang atau keluarga yang harus dinafkahi maka hendaklah hendaklah yang memiliki hak datang kepadaku, karena aku adalah orang yang akan menanggungnya.” (Shahih al-Bukhari 8/377, kitab tafsir surat al-Ahzab, no. 4781)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. النَّبِىُّ أَوْلَىٰ بِالْمُؤْمِنِينَ مِنْ أَنفُسِهِمْ ۖ (Nabi itu (hendaknya) lebih utama bagi orang-orang mukmin dari diri mereka sendiri) Yakni Nabi lebih utama bagi mereka adalah urusan agama dan duniawi, dan bahkan lebih utama daripada diri mereka sandiri, maka tentu saja beliau lebih utama dari selain diri mereka. Oleh sebab itu wajib bagi mereka untuk mentaatinya di atas ketaatan mereka terhadap diri mereka sendiri, dan lebih mengutamakan ketaatannya daripada keinginan hati dan fikiran mereka. Pendapat lain mengatakan, yang dimaksud adalah Nabi lebih utama bagi orang-orang beriman daripada sesama mereka. Imam Bukhari dan lainnya mengeluarkan hadits dari Abu Hurairah, dari Nabi, beliau bersabda: “tidak ada seorang yang beriman melainkan aku lebih utama baginya daripada manusia lainnya di dunia dan di akhirat. Jika kalian mau, bacalah: النبي أولى بالمؤمنين من أنفسهم, maka jika ada orang beriman yang mati dan meninggalkan harta maka kerabatnya menjadi pewarisnya, namun jika ia meninggalkan hutang atau kehilangan harta maka hendaklah mendatangiku, sebab aku lebih utama baginya.” وَأَزْوٰجُهُۥٓ أُمَّهٰتُهُمْ ۗ( dan isteri-isterinya adalah ibu-ibu mereka) Yakni seperti ibu-ibu mereka dalam keharamannya bagi mereka, serta seperti kedudukan mereka dalam hak untuk dihormati; sehingga tidak ada yang diperbolehkan untuk menikahi salah satu istri-istri Nabi setelah kematian beliau sebagaimana tidak diperbolehkan baginya menikahi ibunya sendiri, sebab istri-istri nabi adalah ibu orang-orang beriman semuanya laki-laki dan perempuan. وَأُو۟لُوا۟ الْأَرْحَامِ بَعْضُهُمْ أَوْلَىٰ بِبَعْضٍ(Dan orang-orang yang mempunyai hubungan darah satu sama lain lebih berhak (waris-mewarisi)) Yakni dimaksud dengan orang yang memiliki hubungan darah adalah para kerabat. Yakni sebagian mereka lebih berhak atas warisan sebagian lainnya. Ayat ini telah dijelaskan tafsirnya pada akhir surat al-Anfal, dan ayat ini merupakan ayat yang menghapus hukum warisan pada awal islam yang bersandar pada hijrah dan hubungan pertemanan. فِى كِتٰبِ اللهِ(di dalam Kitab Allah) Yakni dalam al-Qur’an pada ayat-ayat yang membahas tentang warisan. مِنَ الْمُؤْمِنِينَ(daripada orang-orang mukmin) Yakni para kerabat yang beriman. وَالْمُهٰجِرِينَ(dan orang-orang Muhajirin) Yakni para kerabat yang beriman lebih utama daripada orang-orang beriman dan yang berhijrah yang bukan kerabat meskipun diantara mereka memiliki hubungan perjanjian atau pertemanan. إِلَّآ أَن تَفْعَلُوٓا۟ إِلَىٰٓ أَوْلِيَآئِكُم مَّعْرُوفًا ۚ( kecuali kalau kamu berbuat baik kepada saudara-saudaramu (seagama)) Yakni dengan sedekah atau wasiat, maka itu diperbolehkan. Ketika Allah menghapus hukum waris karena hubungan perjanjian atau berhijrah, Allah kemudian membolehkan bagi mereka untuk mendapat wasiat. كَانَ ذٰلِكَ(yang demikian itu) Yakni penghapusan hukum waris dengan dasar hijrah dan perjanjian, kemudian menjadikan warisan bagi para kerabat. فِى الْكِتٰبِ مَسْطُورًا(telah tertulis di dalam Kitab (Allah)) Yakni tercantum dalam Lauhul Mahfuhz, atau dalam al-Qur’an sehingga wajib untuk diterapkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Nabi lebih berhak atas kalian wahai orang-orang Mukmin, dalam urusan dunia dan agama, dan lebih utama diantara mereka, imam Bukhari meriwayatkan dari Abu Hurairah bahwa Nabi SAW bersabda: “tidak ada seorang Mukmin yang lebih utama dibandingkan aku di dunia dan di akhirat bacalah jika kalian mau: “Nabi itu lebih utama dibandingkan orang-orang Mukmin” maka ketika seorang Mukmin meninggalkan hartanya dan mewariskan hartanya kepada orang yang dikehendaki, ketika ia meninggalkan harta atau menghambur-hamburkannya – keturunan – maka datangilah aku sebab akulah tuannya”. Dan para istri-istri Nabi adalah sebagai ibu umat Islam yang diagungkan dan dihormati, orang-orang yang memiliki ikatan kerabat sebagiannya telah memiliki hak waris dengan sebagian yang lain. Adat yang demikian telah dihapus ketika masa kejayaan islam di zaman dahulu dari hijrah dan perwalian. Seperti dengan kekerabatan (persaudaraan) dan perwalian, maka mereka lebih utama secara hukum Allah dalam hal mewaris diantara kerabat yang jauh, kecuali jika mereka berwasiat kepada para sahabat yang dipercayainya yang kemudian dijadikan wali dan mewarisi hartanya diantara orang mukmin. Yang ma’ruf disini adalah wasiyat, bahwa hukum yang demikian itu ada;ah hukum mewaris bagi kerabat yang memiliki ikatan darah yang telah ditetapkan di lauhil mahfudz. Maka kalian wajib mengamalkannya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Nabi itu lebih utama} lebih benar {bagi orang-orang mukmin daripada diri mereka dan istri-istrinya adalah ibu-ibu mereka} dan istri-istri nabi SAW itu seperti ibu-ibu orang mukmin, yang haram untuk dinikahi dan diagungkan hak-haknya {Orang-orang yang mempunyai hubungan darah} orang yang memiliki hubungan kerabat {satu sama lain itu lebih berhak di dalam kitab Allah} ketentuan dan syariat Allah {daripada orang-orang mukmin dan kaum Muhajirin, kecuali jika kalian hendak berbuat baik kepada saudara-saudara kalian} akan tetapi jika kalian menginginkan perbuatan baik dalam masalah kehidupan terhadap saudara-saudara kalian yang bukan ahli waris berupa pemberian hadiah, pemberian bantuan, sedekah, dan wasiat dengan sesuatu yang tidak lebih dari sepertiga bagian, maka itu boleh {Demikian itu telah tertulis} tertulis {dalam kitab} Lauhil Mahfudz"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6. Allah menyampaikan suatu informasi yang dengannya mereka bisa mengetahui status Rasulullah dan kedudukannya, sehingga mereka dapat berinteraksi dengan beliau sesuai dengan (konsekuensi) status tersebut, seraya berfirman, “Nabi itu (hendaknya) lebih utama bagi orang-orang Mukmin daripada diri mereka sendiri,” sesuatu yang paling dekat kepada manusia dan sesuatu yang lebih utama yang dimilikinya. Jadi, Rasulullah itu lebih utama baginya daripada dirinya sendiri. Sebab, Nabi telah mengerahkan untuk mereka nasihat (ketulusan), rasa kasih dan sayang yang dengannya ia menjadi manusia yang paling pengasih dan paling penyayang. Maka Rasulullah adalah manusia yang paling banyak jasanya kepada mereka dibandingkan siapa saja, karena sesungguhnya tidaklah suatu kebaikan sebesar biji sawi mencapai mereka dan tidak pula keburukan sebesar biji sawi terhindar dari mereka melainkan pasti melalui beliau dan disebabkan beliau. Oleh karena itu, mereka wajib –apabila kehendak dirinya atau kehendak siapa pun dari manusia berlawanan dengan kehendak (maksud) Rasulullah- mendahulukan kehendak Rasulullah, dan tidak melawan perkataan rasulullah dengan perkataan siapa pun dia, dan mereka wajib membelanya dengan jiwa, harta dan anak-anak mereka, dan mendahulukan kecintaan kepada beliau daripada kecintaan kepada manusia semuanya. Dan tidak boleh berkata sampa beliau berkata, tidak boleh mendahuluinya. Dia -lah Muhammad sholallohu alaihi wasalam bapa bagi orang-orang yang beriman, sebagaimana dalam qiroah sebagian sahabat, dia merawatnya sebagaimana merewat bapak kepada anak-anaknya. Maka konsekwensi dari kebapaan ini adalah bahwasanya istri-istri beliau adalah ibu bagi mereka, maksudnya dalam pemuliaan dan kehormatan dan kemuliaan, bukan dalam soal berdua-duaan dan kemahraman. Ini semua seakan-akan sebagai pengantar bagi pembahasan yang akan disebutkan nanti tentang kisah Zaid bin Haritsah yang sebelumnya dipanggil Zaid bin Muhammad, hingga Allah menurunkan ayatNya, \"Muhammad itu sekali-kali bukanlah bapak dari seorang laki-laki di antara kamu, tetapi dia adalah Rasulullah dan penutup nabi-nabi. Dan adalah Allah Maha Mengetahui segala sesuatu\" (Al-Ahzab:40). Maka semenjak itu Allah memutus nasabnya dan afiliasinya kepadanya. Allah menginformasikan dalam ayat ini bahwasanya orang-orang Mukmin semuanya adalah anak-anak Rasulullah, maka tidak ada kelebihan antara satu dengan yang lainnya, sekalipun afiliasi dakwah terputus dari salah seorang dari mereka. Sebab, nasab imani itu tidak pernah terputus darinya. Maka hendaknya dia tidak perlu bersedih dan berduka. Kedudukan tersebut mengakibatkan kedudukan para istri Rasul sebagai ibu bagi seluruh kaum Mukminin, maka mereka tidak bisa menjadi halal bagi siapa saja sepeninggal beliau, sebagaimana ditegaskan oleh Allah, dan tidak halal (pula) bagi kalian mengawini istri-istrinya selama-lamanya sesudah ia wafat. (Al-Ahzab:53). “Dan orang-orang yang mempunyai hubungan darah,” maksudnya, kaum kerabat dekat dan jauh, “satu sama lain lebih berhak (saling mewarisi) di dalam Kitab Allah,” maksudnya, dalam hukumNYa. Maka sebagian mewarisi sebagian yang lain, dan sebagian berbuat baik kepada sebagian yang lain. Jadi mereka lebih utama daripada sumpah dan pembelaan. Dan demikian pula, anak-anak angkat yang dahulu menjadi pewaris karena sebab-sebab tersebut dengan mengabaikan kaum kerabat pun telah diputus oleh Allah, lalu Allah menjadikan hak waris diberikan kepada kaum kerabat sebagai kasih saying dan kebajikan dariNya. Sebab, kalau permasalahan (pewarisan) terus berdasarkan kebiasaan yang telah lalu, niscaya akan banyak terjadi kerusakan, keburukan dan upaya-upaya tipu daya untuk mencegah kaum kerabat dari harta waris. “Daripada orang-orang Mukmin dan orang-orang MUhajirin,” maksudnya, sama saja apakah kaum kerabat itu adalah orang-orang Mukmin Muhajirin ataukah bukan Muhajirin. Sebab, sesungguhnya orang-orang yang mempunyai hubungan darah (dzawil arham) itu lebih diutamakan dalam masalah ini. Ayat ini merupakan hujjah (argument) atas perwalian orang-orang yang mempunyai hubungan darah dalam seluruh bentuk perwalian, seperti dalam perwalian nikah, harta, dan lain-lainnya, ”kecuali kalau kamu mau berbuat baik kepada saudara-saudaramu seagama,” maksudnya, mereka tidak mempunyai hak yang diwajibkan, melainkan berdasarkan kehendak kalian saja jika kalian suka memberi mereka secara suka rela dan memberikan kepada mereka suatu kebaikan dari kalian. “Yang demikian itu” keputusan tersebut di atas “tertulis di dalam al-KItab,” maksudnya, telah termaktub dan ditulis serta telah ditetapkan oleh Allah, maka harus dilaksanakan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahzab ayat 6: Allah mengabarkan bahwa Nabi ﷺ adalah yang paling berhak untuk diikuti dari kalangan orang-orang yang beriman dibandingkan atas diri-diri mereka sendiri dalam urusan agama dan dunia, dia ﷺ tidaklah meninggalkan kebaikan kecuali memberi petunjuk kepada umatnya, dan tidak juga keburukan kecuali telah diperingatkan olehnya. Dan Allah mengabarkan bahwa istri-istrinya adalah ibu bagi orang-orang yang beriman; Tidak dihalalkan menikahi mereka setelah Rasul ﷺ. Allah juga mengabarkan bahwa nasab kerabat beliau ﷺ mulia satu sama lain bagi mereka yang mewarisi keimanan dan hijrah, semua itu ada di dalam kitab Allah; Pada awal islam diperbolehkan mewarisi selain islam karena mendesak, akan tetapi dihapuskan setelah itu dan digantikan dengan pewarisan wajib dengan sebab keimanan dan hijrah dalam ayat ini. Dan Allah mengecualikan wasiat bagi orang-orang yang miskin dari kalangan muhajirin yang tidak memiliki hubungan waris; Maka tidak mengapa mewarisi dengan syarat-syaratnya, ini adalah hukum yang berhubungan dengan warisan yang telah Allah tetapkan sebelumnya di Lauhil Mahfudz, kemudian dijelaskan dalam Al Qur’an dan wajib untuk mengikutinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan kepada kaum mukmin tentang keadaan Rasul dan kedudukannya agar mereka menyikapi Beliau dengan sikap yang pantas. Maksudnya, orang-orang mukmin itu sepatutnya mencintai Nabi mereka lebih dari mencintai diri mereka sendiri dalam segala urusan. Oleh karena itu, ajakan Beliau harus lebih dituruti daripada ajakan diri mereka yang menginginkan kepada selain itu. Yang demikian adalah karena Rasulullah shallallahu 'alaihi wa sallam telah mengorbankan pikiran dan tenaganya untuk kebaikan mereka, Beliau adalah orang yang paling sayang kepada mereka, paling banyak kebaikannya bagi mereka. Dengan demikian, apabila keinginan dirinya atau keinginan orang lain berbenturan dengan keinginan Beliau, maka keinginan Beliau harus didahulukan, demikian pula tidak membantah ucapan Beliau dengan ucapan seseorang siapa pun dia, dan mereka harus rela mengorbankan diri mereka dan harta mereka untuk Beliau, mendahulukan kecintaan kepada Beliau di atas kecintaan kepada siapa pun, tidak berkata sampai Beliau berkata dan tidak maju berada di depan Beliau. Dalam hal haramnya menikahi mereka, berhak dimuliakan dan dihormati, bukan dalam hal khalwat (yakni tetap tidak boleh berkhalwat dengan istri Beliau). Yakni kerabat jauh atau dekat. Yakni daripada kewarisan yang didasarkan keimanan dan hijrah yang pernah terjadi di awal Islam, lalu kemudian dihapus. Jika tidak dihapus tentu akan menimbulkan kerusakan, keburukan dan hilat (tipu daya) untuk menghalangi kerabat dari memperoleh warisan. Ayat ini merupakan hujjah tentang kewalian kerabat dalam semua kewalian, seperti nikah, harta, dan lain-lain. Yang dimaksud dengan berbuat baik di sini adalah berwasiat yang tidak lebih dari sepertiga harta, atau berbuat baik dengan harta kepada mereka dari hartamu. Yakni dihapuskan kewarisan karena iman dan hijrah dengan kewarisan yang didasarkan karena hubungan kekerabatan. Dan ditakdirkan oleh Allah Subhaanahu wa Ta'aala sehingga harus diberlakukan. Maksudnya, Al Lauhul Mahfuzh."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 6",
    "description": "Usai membatalkan hukum anak angkat yang terkait dengan nabi pada ayat sebelumnya, pada ayat ini Allah menegaskan bahwa kedudukan nabi itu lebih utama bagi orang-orang mukmin daripada sekadar bapak dari seseorang. Bahkan, beliau lebih utama dibandingkan diri mereka sendiri sebab beliau selalu menginginkan kebaikan bagi umatnya dan berkat beliau pula mereka selamat dari kebinasaan. Dan adapun istri-istrinya secara hukum adalah seperti ibu-ibu mereka sendiri yang harus dimuliakan dan haram mereka nikahi jandanya. Begitupun, hanya orang-orang yang mempunyai hubungan darah yang satu sama lain lebih berhak untuk saling mewarisi sebagaimana tercantum di dalam kitab Allah, daripada orang-orang mukmin dan orang-orang muhajirin yang hanya diikat oleh hubungan keagamaan, bukan kekerabatan, kecuali kalau kamu hendak berbuat baik dengan berwasiat yang tidak lebih dari sepertiga hartamu kepada saudara-saudaramu seagama. Demikianlah telah tertulis dalam kitab Allah. 7-8. Demikianlah kedudukan nabi dan istri-istrinya di kalangan kaum mukmin. Nabi juga mempunyai kedudukan luhur sebagai pembawa risalah dan penyeru kepada agama yang benar, sebagaimana para rasul sebelumnya. Dan ingatlah ketika kami mengambil perjanjian dari para nabi dan dari engkau sendiri, khususnya para rasul ulul 'azmi, seperti dari nuh, ibrahim, musa, dan isa putra maryam, dan kami telah mengambil dari mereka perjanjian yang teguh untuk menyampaikan risalah Allah kepada kaum masing-masing agar dia menanyakan kepada orang-orang yang benar dari para rasul tentang kebenaran mereka di hari kiamat'apakah mereka melaksanakan ajaran Allah itu, dan dia menyediakan azab yang pedih bagi orang-orang kafir."
  }
]