[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "60-61. Bila orang-orang yang menampakkan iman dan menyembunyikan kekafiran, orang-orang yang memendam keragu-raguan dan kebimbangan dalam hati mereka dan orang-orang yang menyebarkan berita-berita dusta di kota Rasulullah, tidak menghentikan keburukan dan kejahatan mereka, niscaya Kami akan menguasakanmu atas mereka, kemudian mereka tidak akan tinggal di dalamnya bersamamu kecuali dalam waktu yang singkat, mereka terusir dari rahmat Allah di mana pun mereka berada mereka ditawan atau dibunuh selama mereka berada di atas kemunafikan, menyebarkan berita-berita bohong di antara kaum Muslimin dengan tujuan menimbulkan fitnah dan kerusakan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "60. Apabila orang-orang munafik tidak berhenti dari kemunafikan mereka dengan menyembunyikan kekufuran dan menampakkan keislaman mereka; dan orang-orang yang di dalam hatinya terdapat kejahatan tidak berhenti dari ketergantungan mereka kepada syahwat; dan orang-orang yang membawa berita-berita bohong di Madinah tidak berhenti untuk memecah belah antara kaum mukminin; maka Kami akan memerintahkanmu -wahai Rasul- untuk membalas mereka, dan sungguh Kami akan menguasakan mereka kepadamu, kemudian mereka tidak tinggal bersamamu di Madinah kecuali sebentar saja, baik karena kematian atau karena mereka terusir dari Madinah akibat kerusakan yang mereka lakukan di bumi."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "60-61. Jika orang-orang munafik dan yang memiliki penyakit dalam hatinya serta orang-orang yang selalu menyebarkan kedustaan dan tipu daya di Madinah itu tidak juga berhenti dari kedustaan dan tipu daya mereka, maka niscaya Kami akan menyebutkan mereka kepadamu dan membuatmu dapat menguasai mereka, kemudian mereka tidak akan tinggal bersamamu di Madinah lebih lama lagi, mereka akan keluar dari Madinah dengan penuh kehinaan dan terusir; di manapun mereka berada, mereka akan disiksa dan dibunuh. Pernyataan Allah bagi mereka ini merupakan perintah untuk merealisasikannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "60. لَّئِن لَّمْ يَنتَهِ الْمُنٰفِقُونَ (Sesungguhnya jika tidak berhenti orang-orang munafik) Dari kemunafikan mereka. وَالَّذِينَ فِى قُلُوبِهِم مَّرَضٌ(orang-orang yang berpenyakit dalam hatinya) Yakni keraguan dalam perkara agama. وَالْمُرْجِفُونَ فِى الْمَدِينَةِ(dan orang-orang yang menyebarkan kabar bohong di Madinah (dari menyakitimu)) Dengan menyebarkan berita bohong untuk melemahkan kaum muslimin dan memenangkan kaum musyrikin. Mereka dahulu menyebarkan berita bahwa pasukan perang muslimin mengalami kekalahan, atau terkadang menyebarkan bahwa mereka terbunuh dan berita lainnya yang menghancurkan hati kaum muslimin. Maka Allah mengancam mereka dengan firman-Nya: لَنُغْرِيَنَّكَ بِهِمْ(niscaya Kami perintahkan kamu (untuk memerangi) mereka) Yakni Kami pasti akan menjadikanmu berkuasa atas mereka. ثُمَّ لَا يُجَاوِرُونَكَ فِيهَآ إِلَّا قَلِيلًا(kemudian mereka tidak menjadi tetanggamu (di Madinah) melainkan dalam waktu yang sebentar) Dengan memerintahkanmu untuk mengusir mereka dari Madinah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "60. Apabila orang-orang munafik tidak berhenti menyakiti orang-orang mukmin dan orang-orang yang masih lemah dan ada keraguan atas agama, juga orang-orang Yahudi dan mereka yang menyebarkan berita bohong, membuat gaduh keyakinan manusia untuk menghina sisi orang-orang muslim. Itu semua adalah sifat dari orang munafik, makan sungguh akan Kami perintahkan kalian untuk memerangi mereka. Kemudian mereka juga tidak membuat kalian nyaman di Madinah, tidak menjadi tetanggamu kecuali hanya sebentar saja setelah turunnya ayat ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh jika orang-orang munafik, orang-orang yang dalam hatinya ada penyakit} kedurhakaan {dan orang-orang yang menyebarkan kabar bohong} orang-orang yang menyebarkan kabar bohong {di Madinah itu tidak berhenti, sungguh Kami akan memerintahkanmu atas mereka} sungguh Kami akan membuatmu berkuasa atas mereka dengan memerangi dan mengusir mereka {kemudian mereka tidak menjadi tetanggamu} mereka tidak tinggal bersamamu {di sana} di Madinah {kecuali sebentar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "60-61. Adapun dari arah orang-orang jahat, maka Allah telah mengancam mereka dengan FirmanNya, “Sesungguhnya jika orang-orang munafik, orang-orang yang berpenyakit dalam hatinya tidak berhenti,” maksudnya penyakit ragu dan syahwat, “dan orang-orang yang menyebarkan kabar bohong di Madinah,” maksudnya, orang-orang yang meneror dan menakut-nakuti akan adanya musuh, yaitu mereka yang membicarakan banyaknya jumlah dan kekuatan musuh serta kelemahan kaum muslimin. Allah tidak menyebutkan objek sasaran di mana di situ mereka berhenti melakukan terror, agar hal itu mencakup segala keburukan yang dibisikkan dan dibujukkan oleh hati mereka, serta yang diserukannya, seperti mengeluarkan kata-kata sindiran, mencaci Islam dan para pemeluknya, menaburkan kegoncangan kepada kaum Muslimin, menyepelekan kekuatan mereka, melecehkan wanita-wanita beriman dengan perbuatan buruk dan keji dan berbagai macam kemaksiatan lainnya yang bersumber dari manusia-manusia semisal mereka. “Niscaya Kami perintahkan kamu untuk memerangi mereka.” Maksudnya, niscaya Kami perintahkan padamu untuk menyiksa mereka dan memerangi mereka, dan Kami akan menjadikanmu berkuasa atas mereka. Lalu, apabila Kami telah melakukan hal itu, maka mereka sama sekali tidak mempunyai daya untuk menghadapimu, dan tidak mempunyai kekuatan ataupun pertahanan untuk mempertahankan diri. Maka dari itu Allah berfirman, “Kemudian mereka tidak menjadi tetanggamu di sana melainkan dalam waktu yang sebentar.” Maksudnya, mereka tidak menjadi tetanggamu di Madinah kecuali sebentar karena kamu membunuh mereka atau mengusir mereka. Ini adalah dalil untuk pengusiran orang-orang jahat yang keberadaan mereka di tengah-tengah kaum Muslimin membahayakan. Sesungguhnya cara yang demikian itu lebih efektif untuk menumpas kejahatan dan lebih jauh darinya, dan mereka menjadi “terlaknat, di mana saja mereka dijumpai, mereka ditangkap dan dibunuh dengan sehebat-hebatnya.” Maksudnya, mereka diusir di mana saja mereka dijumpai, mereka tidak akan merasakan rasa aman dan tidak pula rasa tentram, mereka takut dibunuh, atau ditawan atau disiksa."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahzab ayat 60: Allah memperingatkan orang-orang munafik dan orang yang berpenyakit (bersyahwat) terhadap wanita-wanita yang beriman, Allah berkata : Sungguh jika mereka tidak berhenti (yaitu orang-orang munafik), dan yang bagi mereka ada penyakit dalam hati mereka penyakit syahwat dan keraguan, dan yang menakut-nakuti orang-orang yang beriman dan yang mencela mereka; Maka jika mereka tidak berhenti atas apa yang mereka perbuat, maka akan Kami adzab mereka, Kami akan perangi mereka dan mereka tidak akan bertahan di Madinah dalam waktu yang lama."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Baik penyakit keraguan maupun syahwat. Seperti mengatakan, bahwa musuh telah datang kepadamu, pasukan kecil (sariyyah) telah terbunuh atau kalah, jumlah musuh lebih besar, mereka lebih kuat, kaum muslimin lemah, dsb. Tidak disebutkan ma’mul (objeknya), yakni sesuatu apa yang seharusnya mereka berhenti, untuk menerangkan keumuman terhadap segala godaan mereka dan seruan mereka kepada keburukan, seperti menyindir Islam dan kaum muslimin, menakut-nakuti kaum muslimin dan mengendorkan semangat mereka, melemahkan kekuatan kaum muslimin, mengganggu wanita mukminah, dan perbuatan maksiat lainnya yang mereka lakukan. Yakni Kami perintahkan engkau memberi mereka hukuman dan memerangi mereka, dan Kami akan memberimu kekuasaan terhadap mereka. Jika Kami telah melakukannya, maka tidak ada kemampuan lagi bagi mereka untuk melawanmu. Karena kamu membunuh mereka atau mengasingkan mereka. Dalam ayat ini terdapat dalil tentang pengasingan orang-orang yang jahat, di mana dengan tetap tinggalnya mereka di tengah-tengah masyarakat muslim dapat menimbulkan bahaya, maka dengan pengasingan dapat memutuskan keburukan mereka dan menjauhkan kaum muslimin darinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 60",
    "description": "60-61. Setelah memerintahkan perempuan yang beriman untuk mengenakan jilbab, Allah lalu menjelaskan ancaman kepada para pengganggu yang pada umumnya kaum munafik. Sungguh, jika orang-orang munafik, yaitu mereka yang pura-pura beriman tetapi hatinya ingkar; orang-orang yang berpenyakit dalam hatinya, seperti dengki dan dendam sehingga gemar menyakiti dan mengganggu orang-orang beriman; dan orang-orang yang menyebarkan kabar bohong di madinah tidak berhenti menyakitimu, niscaya kami perintahkan engkau, wahai nabi Muhammad, untuk memerangi mereka, kemudian mereka tidak lagi menjadi tetanggamu di madinah kecuali sebentar serta dalam keadaan terlaknat dan terhina. Di mana saja mereka dijumpai, mereka akan ditang-kap dan dibunuh tanpa ampun"
  }
]