[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "60-61. Bila orang-orang yang menampakkan iman dan menyembunyikan kekafiran, orang-orang yang memendam keragu-raguan dan kebimbangan dalam hati mereka dan orang-orang yang menyebarkan berita-berita dusta di kota Rasulullah, tidak menghentikan keburukan dan kejahatan mereka, niscaya Kami akan menguasakanmu atas mereka, kemudian mereka tidak akan tinggal di dalamnya bersamamu kecuali dalam waktu yang singkat, mereka terusir dari rahmat Allah di mana pun mereka berada mereka ditawan atau dibunuh selama mereka berada di atas kemunafikan, menyebarkan berita-berita bohong di antara kaum Muslimin dengan tujuan menimbulkan fitnah dan kerusakan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "61. Mereka terusir dari rahmat Allah. Di mana saja mereka ditemukan, niscaya mereka akan ditangkap dan dibunuh dengan ganas, dikarenakan kemunafikan mereka dan penyebaran kerusakan yang mereka lakukan di bumi."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "61. مَّلْعُونِينَ (dalam keadaan terlaknat) Yakni dengan keadaan terusir. أَيْنَمَا ثُقِفُوٓا۟( Di mana saja mereka dijumpai) Yakni ditemui dan didapati. أُخِذُوا۟ وَقُتِّلُوا۟ تَقْتِيلًا(mereka ditangkap dan dibunuh dengan sehebat-hebatnya) Yakni mereka tidak akan menemukan orang yang mau melindungi mereka, bahkan mereka akan diculik orang lain dalam keadaan tertawan atau terbunuh akibat kemurkaan Allah dan rasul-Nya terhadap mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "61. Mereka tertolak dari rahmat Allah, dimanapun mereka berada mereka akan ditangkap dan dibunuh dengan hebat. Murka Allah atas mereka untuk mengakhiri kedurhakaan merek"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dalam keadaan terlaknat} terusir dari rahmat {Di mana pun mereka dijumpai} didapati {mereka akan ditangkap} ditawan {dan benar-benar dibunuh} benar-benar dibunuh semuanya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "60-61. Adapun dari arah orang-orang jahat, maka Allah telah mengancam mereka dengan FirmanNya, “Sesungguhnya jika orang-orang munafik, orang-orang yang berpenyakit dalam hatinya tidak berhenti,” maksudnya penyakit ragu dan syahwat, “dan orang-orang yang menyebarkan kabar bohong di Madinah,” maksudnya, orang-orang yang meneror dan menakut-nakuti akan adanya musuh, yaitu mereka yang membicarakan banyaknya jumlah dan kekuatan musuh serta kelemahan kaum muslimin. Allah tidak menyebutkan objek sasaran di mana di situ mereka berhenti melakukan terror, agar hal itu mencakup segala keburukan yang dibisikkan dan dibujukkan oleh hati mereka, serta yang diserukannya, seperti mengeluarkan kata-kata sindiran, mencaci Islam dan para pemeluknya, menaburkan kegoncangan kepada kaum Muslimin, menyepelekan kekuatan mereka, melecehkan wanita-wanita beriman dengan perbuatan buruk dan keji dan berbagai macam kemaksiatan lainnya yang bersumber dari manusia-manusia semisal mereka. “Niscaya Kami perintahkan kamu untuk memerangi mereka.” Maksudnya, niscaya Kami perintahkan padamu untuk menyiksa mereka dan memerangi mereka, dan Kami akan menjadikanmu berkuasa atas mereka. Lalu, apabila Kami telah melakukan hal itu, maka mereka sama sekali tidak mempunyai daya untuk menghadapimu, dan tidak mempunyai kekuatan ataupun pertahanan untuk mempertahankan diri. Maka dari itu Allah berfirman, “Kemudian mereka tidak menjadi tetanggamu di sana melainkan dalam waktu yang sebentar.” Maksudnya, mereka tidak menjadi tetanggamu di Madinah kecuali sebentar karena kamu membunuh mereka atau mengusir mereka. Ini adalah dalil untuk pengusiran orang-orang jahat yang keberadaan mereka di tengah-tengah kaum Muslimin membahayakan. Sesungguhnya cara yang demikian itu lebih efektif untuk menumpas kejahatan dan lebih jauh darinya, dan mereka menjadi “terlaknat, di mana saja mereka dijumpai, mereka ditangkap dan dibunuh dengan sehebat-hebatnya.” Maksudnya, mereka diusir di mana saja mereka dijumpai, mereka tidak akan merasakan rasa aman dan tidak pula rasa tentram, mereka takut dibunuh, atau ditawan atau disiksa."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahzab ayat 61: Ketahuilah wahai manusia bahwa mereka orang-orang munafik, mereka adalah orang-orang yang tercegah dari rahmat Allah dan penjagaan-Nya. Mereka terhinaka di mana pun mereka berada, dan apapun keadaan mereka, mereka di manapun berada tidak akan merasa aman, bahwa mereka akan merasa terintai untuk dibunuh. Karena itu semua merupakan kemarahan Allah dan Rasul-Nya ﷺ bagi mereka, dan laknat Allah bagi mereka dan tercegahnya mereka dari rahmat Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni mereka dijauhkan di mana saja mereka berada, tidak memperoleh keamanan, tidak dapat menetap, dan mereka takut dibunuh, dipenjarakan atau disiksa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 61",
    "description": "60-61. Setelah memerintahkan perempuan yang beriman untuk mengenakan jilbab, Allah lalu menjelaskan ancaman kepada para pengganggu yang pada umumnya kaum munafik. Sungguh, jika orang-orang munafik, yaitu mereka yang pura-pura beriman tetapi hatinya ingkar; orang-orang yang berpenyakit dalam hatinya, seperti dengki dan dendam sehingga gemar menyakiti dan mengganggu orang-orang beriman; dan orang-orang yang menyebarkan kabar bohong di madinah tidak berhenti menyakitimu, niscaya kami perintahkan engkau, wahai nabi Muhammad, untuk memerangi mereka, kemudian mereka tidak lagi menjadi tetanggamu di madinah kecuali sebentar serta dalam keadaan terlaknat dan terhina. Di mana saja mereka dijumpai, mereka akan ditang-kap dan dibunuh tanpa ampun. 62. Ancaman dan siksa Allah kepada orang-orang munafik, orang-orang yang hatinya berpenyakit, dan orang-orang yang menebar fitnah, sebagaimana dijelaskan dalam ayat sebelumnya, adalah sebagai sunah dan ketetapan Allah yang berlaku juga bagi orang-orang yang telah terdahulu sebelum kamu dan akan berlaku bagi generasi sesudahmu, dan engkau tidak akan mendapati perubahan pada sunah Allah. (lihat juga: al-isr'/17: 77 dan al-fat'/48: 23)."
  }
]