[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sunnah Allah dan caraNya yang berlaku atas orang-orang munafik di kalangan umat-umat terdahulu, yaitu mereka ditawan dan dibunuh di mana pun mereka berada. Dan kamu (wahai Nabi) tidak akan menemukan perubahan dan pergantian pada cara Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "62. Ini adalah sunnah Allah yang berlaku bagi kaum munafik jika menampakkan kemunafikannya, dan sunnah Allah itu tetap, engkau tidak akan mendapati perubahan padanya selama-lamanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "62. Sunnatullah dan ketetapan Allah terhadap orang-orang munafik dan penyebar fitnah serta seluruh musuh agama adalah dengan menurunkan siksaan dan membinasakan mereka serta membatalkan tipu daya mereka. Dan sunnatullah tidak akan berubah selamanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "62. سُنَّةَ اللهِ فِى الَّذِينَ خَلَوْا۟ مِن قَبْلُ ۖ (Sebagai sunnah Allah yang berlaku atas orang-orang yang telah terdahulu sebelum(mu)) Yakni Allah telah menjalankan ketetapan itu pada umat-umat terdahulu, yakni melaknat orang-orang munafik dan menjadikan mereka terculik dan terbunuh. Dan begitu pula nasib orang-orang yang senantiasa menyebarkan kabar bohong itu. وَلَن تَجِدَ لِسُنَّةِ اللهِ تَبْدِيلًا (dan kamu sekali-kali tiada akan mendapati peubahan pada sunnah Allah) Yakni tidak akan diganti dan diubah, namun akan tetap berlaku pada orang-orang seperti mereka, baik itu pada masa terdahulu maupun masa yang akan datang."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "62. Allah telah menjadikan itu sebagai ketetapan bagi umat terdahulu. Tidak ada yang bisa merubah sunnatullah, itu semua sudah menjadi ketetapan selamanya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{sebagai sunatullah} sunnatullah {bagi orang-orang yang telah berlalu} telah berlalu {sebelumnya. Kamu tidak akan mendapati pada sunatullah suatu perubahan} perubahan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "62. “Sebagai sunnah Allah yang berlaku atas orang-orang yang telah terdahulu sebelumnya,” yaitu bahwa siapa saja yang terus bergelimang dalam kemaksiatan dan berbuat lancang mengganggu (kaum Muslimin) dan tidak berhenti dari perbuatan ini, maka dia pasti akan disiksa dengan siksaan yang sangat keras, “dan kamu sekali-kali tidak akan mendapat perubahan pada Sunnah Allah.” Maksudnya, tidak ada pergantian. Akan tetapi Sunnah dan kebiasaan Allah itu terus berlaku disertai dengan faktor-faktor yang menuntut adanya sebab kausalitasnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahzab ayat 62: Allah menjelaskan bahwa semua itu adalah sunnatullah dan jalan bagi siapa yang munafik dengan menampakkan islam dan menyembunyikan kekufuran. Allah berlepas diri dari musuh-musuh-Nya dan dzahir-dzahir mereka tidak akan aman, mereka akan selalu merasakan akan dibunuh. Sunnatullah bagi mereka orang-orang munafik yang tidak akan berubah dan tergantikan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni barang siapa yang tetap berbuat maksiat, berani mengganggu dan tidak mau berhenti, maka dia akan dihukum dengan hukuman yang berat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 62",
    "description": "Ancaman dan siksa Allah kepada orang-orang munafik, orang-orang yang hatinya berpenyakit, dan orang-orang yang menebar fitnah, sebagaimana dijelaskan dalam ayat sebelumnya, adalah sebagai sunah dan ketetapan Allah yang berlaku juga bagi orang-orang yang telah terdahulu sebelum kamu dan akan berlaku bagi generasi sesudahmu, dan engkau tidak akan mendapati perubahan pada sunah Allah. (lihat juga: al-isr'/17: 77 dan al-fat'/48: 23)63. Ancaman dan siksa pedih bagi orang-orang munafik tidak hanya berlangsung di dunia, tetapi juga di akhirat. Karena penasaran tentang hari kiamat, manusia bertanya kepadamu, wahai nabi Muhammad, tentang hari kiamat. Katakanlah, 'ilmu tentang hari kiamat itu hanya di sisi Allah. ' dan tahukah engkau kapan datangnya kiamat itu' pasti engkau tidak tahu. Boleh jadi hari kiamat itu sudah dekat waktunya."
  }
]