[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Manusia bertanya kepadamu (wahai rasul) kapan datangnya Kiamat, sebagai wujud pendustaan dan pengingkaran. Katakanlah kepada mereka, “Ilmu tentang Kiamat hanyalah di sisi Allah.” siapa tahu (wahai Rasul) bahwa waktu terjadinya Kiamat itu sudah dekat saatnya?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "63. Orang-orang musyrik bertanya kepadamu -wahai Rasul sebagai bentuk pengingkaran dan pendustaan, dan orang-orang Yahudi juga bertanya kepadamu tentang hari Kiamat, kapan datangnya? Katakan kepada mereka, “Pengetahuan tentang hari Kiamat hanya ada pada Allah, aku tidak mengetahui sedikitpun tentangnya.” Dan tahukah kamu, bahwa Kiamat itu bisa jadi sudah dekat?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "63. Hai Nabi, orang-orang bertanya kepadamu kapan terjadi hari kiamat. Jawablah: “Waktu terjadinya hanya diketahui Allah, tidak ada yang mengetahui selain Dia. Dan tahukah kamu, mungkin itu akan terjadi sebentar lagi; maka apa yang telah mereka persiapkan?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "63. يَسْـَٔلُكَ النَّاسُ عَنِ السَّاعَةِ ۖ (Manusia bertanya kepadamu tentang hari kiamat) Yakni tentang waktu kejadiannya. وَمَا يُدْرِيكَ(Dan tahukah kamu) Hai Muhammad. لَعَلَّ السَّاعَةَ تَكُونُ قَرِيبًا(boleh jadi hari kiamat itu sudah dekat waktunya) Yakni dalam waktu dekat. Kalimat ini ditujukan bagi Rasulullah untuk menjelaskan bahwa jika waktu kejadiannya tidak diketahuinya padahal dia adalah Rasulullah, lalu bagaimana dengan orang selainnya?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "63. Orang-orang musyrik bertanya kepadamu tentang waktu terjadinya hari kiamat dengan nada mengejek. Katakanlah kepada mereka: Sesungguhnya hanya Allah-lah Yang mengetahui tentang hari kamat. Tidak ada seorangpun yang tahu atas hari kiamat meskipun raja maupun nabi. Lalu apakah Allah telah memberi tahumu tentang waktu hari kiamat Ya Muhamad? Maksudnya bahwa Nabi tidak mengetahuinya sama sekali. Adapun seumpama engkau akan mendapati hari kiamat dalam waktu dekat. Di dalam ayat ini terdapat ancaman bagi orang-orang yang ingin segera melihat hari kiamat dan mendiamkan orang-orang yang banyak menawar."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Orang-orang bertanya kepadamu tentang hari kiamat. Katakanlah bahwa pengetahuan tentang hal itu hanya ada di sisi Allah” Apakah kamu mengetahui} apakah kamu mengetahui {boleh jadi hari kiamat itu sudah dekat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "63. Manusia mencari tahu kepadamu (wahai Muhammad) tentang kiamat dengan tujuan agar disegerakan; dan sebagian mereka bermaksud mendustakan kebenarannya dan bermaksud untuk mendiskrediitkan orang yang menginformasikannya. “katakanlah” kepada mereka, “Sesungguhnya pengetahuan tentangnya hanya di sisi Allah.” Maksudnya, tidak ada yang mengetahuinya kecuali Allah. Jadi, aku dan orang selainku tidak mempunyai pengetahuan tentang kapan terjadinya. Sekalipun demikian, kalian jangan sekali-kali menganggapnya lambat, “dan tahukah kamu, boleh jadi hari berbangkit itu sudah dekat waktunya.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahzab ayat 63: Allah mengabarkan bahwa yahudi dan yang semisal dengan mereka dalam kekafiran dan munafik bertanya kepada Nabi ﷺ dengan maksud mencibir tentang waktu datangnya hari kiamat, maka katakan kepada mereka wahai Nabi Allah : Sungguh ilmunya di sisi Allah saja, sesungguhnya Allah yang akan menampakkan waktunya, dan tidak engkau tahu wahai yang bertanya kepada utusan Allah ﷺ, mungkin saja waktu tersebut dekat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Manusia bertanya kepada Nabi Muhammad shallallahu 'alaihi wa sallam tentang hari Kiamat dengan maksud meminta disegerakan, sedangkan sebagian lagi mendustakan kejadiannya dan mencoba melemahkan yang memberitahukannya. Yakni kapan terjadinya? Yakni tidak ada yang mengetahuinya kecuali Allah, aku dan selainku tidak mengetahui kapan terjadinya, namun kamu janganlah menganggapnya lambat. Dekat atau jauh kiamat tidak ada faedahnya, yang ada faedahnya adalah rugi atau beruntung, celaka atau bahagia, apakah seorang hamba berhak mendapatkan azab atau berhak mendapatkan pahala di hari itu? Inilah yang perlu diberitahukan. Maka di ayat selanjutnya disebutkan sifat orang yang berhak mendapatkan azab dan sifat azabnya, karena azab tersebut sesuai dengan mereka yang mendustakan kiamat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 63",
    "description": "Ancaman dan siksa pedih bagi orang-orang munafik tidak hanya berlangsung di dunia, tetapi juga di akhirat. Karena penasaran tentang hari kiamat, manusia bertanya kepadamu, wahai nabi Muhammad, tentang hari kiamat. Katakanlah, 'ilmu tentang hari kiamat itu hanya di sisi Allah. ' dan tahukah engkau kapan datangnya kiamat itu' pasti engkau tidak tahu. Boleh jadi hari kiamat itu sudah dekat waktunya. 64-65. Sungguh, pada hari kiamat Allah melaknat dan menyiksa orang-orang kafir dan menyediakan bagi mereka api neraka yang menyala-Nyala. Mereka kekal di dalamnya selama-lamanya; mereka tidak akan mendapatkan satu pun pelindung dan penolong yang menyelamatkan mereka dari azab Allah."
  }
]