[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "64-66. Sesungguhnya Allah mengusir orang-orang kafir dari rahmatNya di dunia dan akhirat, menyiapkan untuk mereka di akhirat api neraka yang menyala-nyala dan sangat panas, mereka tinggal di dalamnya untuk selama-lamanya, mereka tidak menemukan pelindung yang mengurusi mereka dan membela mereka, tidak pula penolong yang membantu mereka lalu mengentaskan mereka dari api neraka. Saat itu wajah orang-orang kafir dibolak-balik di neraka, mereka pun berkata dengan penuh penyesalan dan kebingungan, “Duhai, seandainya dulu kami taat kepada Allah dan kepada RasulNya, niscaya kami termasuk penghuni surga.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "65. Mereka tetap di dalam siksa api yang disiapkan untuk mereka selama-lamanya, mereka tidak mendapati pelindung yang bermanfaat bagi mereka dan tidak pula mendapati penolong yang mampu menghindarkan mereka dari siksa."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "65. Mereka akan kekal di dalamnya; mereka tidak akan keluar darinya, dan apinya tidak akan padam, serta mereka tidak akan mati sehingga mereka dapat berhenti merasakan azabnya, dan tidak ada yang dapat menyelamatkan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "65. Mereka kekal selamanya di neraka tanpa jeda. Mereka tidak menemukan/mempunyai satu penolongpun yang dapat menyelamatkan mereka dari azab tersebut."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka kekal di dalamnya selama-lamanya. Mereka tidak akan memperoleh pelindung dan tidak pula penolong"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "64-66. Kalau hanya sekedar kiamat, cepat atau lambat, sama sekali tidak ada nilai dan tidak ada pula faidahnya, akan tetapi yang menjadi (tolok ukur) nilai; kerugian, dan keuntungan, kesengsaraan dan kebahagiaan itu Adalah: Apakah seseorang berhak mendapat azab atau mendapat pahala. Maka hal ini akan aku beritakan kepada kalian dan akan aku jelaskan orang yang berhak menerimanya. Kemudian Dia menjelaskan orang yang berhak menerima azab dan tentang azab itu sendiri, karena uraian tersebut sangat pas atas mereka yang mendustakan kiamat itu. Allah berfirman, “sesungguhnya Allah melaknati orang-orang kafir,” maksudnya, orang-orang yang watak kufur telah menjadi jalan hidup mereka, dan jalan hidup mereka adalah kafir terhadap Allah, para RasulNya dan syariat yang mereka ajarkan dari Allah. Maka Allah mengusir dan menjauhkan mereka di dunia dan akhirat dari rahmatNya, dan cukuplah itu menjadi siksaan bagi mereka, “dan menyediakan bagi mereka api yang menyala-nyala,” maksudnya, api neraka yang bergejolak yang membakar jasad mereka, dan azab itu sampai kepada hati mereka, dan mereka dikekalkan di dalam azab yang sangat dahsyat itu, hingga mereka tidak akan dikeluarkan dariNya dan tidak dihentikan azab itu (walau) sesaat pun. “Mereka tidak memperoleh” untuk mereka “seorang pelindung” sehingga dia bisa memberikan apa yang mereka minta, “dan tidak pula seorang penolong” yang dapat mencegah aza dari mereka. Bahkan Allah Yang Mahatinggi lagi Maha Penolong berlepas diri dari mereka, dan mereka pun diliputi azab api yang bernyala-nyala, menjilat mereka sampai tiada tara. Oleh karena itu Allah berfirman, “pada hari ketika muka mereka dibolak-balikkan dalam neraka” dan mereka pun merasakan panasnya, dan sengatannya pun makin dahsyat menimpa mereka, dan mereka menyesali amal yang telah mereka lakukan dahulu, dan “mereka berkata, ‘Alangkah baiknya, andaikata kami taat kepada Allah dan taat pula kepada Rasul” maka kami tenttu selamat dari azab ini, dan kami tenttu berhak menerima, (seperti halnya orang-orang yang taat), pahala yang berlipat ganda. Namun itu semua adalah angan-angan yang waktunya telah berlalu, maka ia sama sekali tidak berguna bagi mereka kecuali sebagai penyesalan, kesedihan, kepiluan, dan kepedihan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ahzab ayat 65: Yang memberikan apa yang mereka minta. Yang menghindarkan azab dari mereka. Pelindung maupun penolong telah meninggalkan mereka, dan mereka diliputi oleh azab yang menyala-nyala serta terasa sampai ke hati saking dahsyatnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 65",
    "description": "64-65. Sungguh, pada hari kiamat Allah melaknat dan menyiksa orang-orang kafir dan menyediakan bagi mereka api neraka yang menyala-Nyala. Mereka kekal di dalamnya selama-lamanya; mereka tidak akan mendapatkan satu pun pelindung dan penolong yang menyelamatkan mereka dari azab Allah. 66. Sebagai salah satu bentuk siksa yang akan diterima orang-orang kafir adalah bahwa pada hari itu wajah mereka dibolak-balikkan dalam neraka. Mereka berkata dengan penuh penyesalan, 'wahai, kiranya dahulu saat di dunia kami taat kepada Allah dan taat kepada rasul, niscaya kami tidak akan tersiksa. ' (lihat juga: al-furq'n/25: 27'29)."
  }
]