[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "64-66. Sesungguhnya Allah mengusir orang-orang kafir dari rahmatNya di dunia dan akhirat, menyiapkan untuk mereka di akhirat api neraka yang menyala-nyala dan sangat panas, mereka tinggal di dalamnya untuk selama-lamanya, mereka tidak menemukan pelindung yang mengurusi mereka dan membela mereka, tidak pula penolong yang membantu mereka lalu mengentaskan mereka dari api neraka. Saat itu wajah orang-orang kafir dibolak-balik di neraka, mereka pun berkata dengan penuh penyesalan dan kebingungan, “Duhai, seandainya dulu kami taat kepada Allah dan kepada RasulNya, niscaya kami termasuk penghuni surga.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "66. Pada hari Kiamat, wajah-wajah mereka bergelimpangan di Neraka, mereka berkata, dari karena begitu besarnya penyesalan mereka, mereka berkata, “Seandainya saja pada kehidupan dunia dulu kami menaati Allah dengan mengerjakan segala yang diperintahkan-Nya kepada kami dan menjauhi segala apa yang dilarang-Nya atas kami serta kami menaati Rasul dalam apa yang dibawanya dari Rabbnya.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "66. Pada hari mereka bergelimpangan di atas bara apinya dan memasuki kobarannya, sehingga mereka menyesal atas kewajiban yang dulu mereka tinggalkan. Mereka berteriak kesakitan dan berandai-andai jika saja mereka mentaati Allah dan rasul-Nya niscaya mereka akan selamat dari neraka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "66. يَوْمَ تُقَلَّبُ وُجُوهُهُمْ فِى النَّارِ (Pada hari ketika muka mereka dibolak-balikan dalam neraka) Yakni kadang mereka menghadap ke suatu arah dan kadang ke arah yang lain. Atau kadang mereka dalam keadaan tertelungkup dan kadang dalam keadaan terlentang. Atau warna kulit mereka berubah akibat panasnya api neraka sehingga kadang berwarna kehitaman dan kadang berwarna kehijauan. يَقُولُونَ يٰلَيْتَنَآ أَطَعْنَا اللهَ وَأَطَعْنَا الرَّسُولَا۠( mereka berkata: “Alangkah baiknya, andaikata kami taat kepada Allah dan taat (pula) kepada Rasul”) Mereka berangan-angan andai mereka mentaati Allah dan Rasulullah dan beriman kepada risalahnya agar mereka dapat selamat dari azab sebagaimana orang-orang beriman."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "66. Hari itu adalah hari dimana jasad mereka dibolak-balik di dalam neraka dari sisi ke sisi lain. Mereka berkata: “Seandainya kami dulu taat kepada perintah Allah dan rasul-Nya dan menjauhi larangan-Nya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Pada hari (ketika) wajah mereka dibolak-balikkan dalam neraka} wajah mereka dibolak-balikkan di dalam neraka dari satu arah ke arah lain, agar bertambah siksaan mereka {Mereka berkata,“Aduhai, sekiranya dahulu kami taat kepada Allah dan taat kepada Rasul”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "64-66. Kalau hanya sekedar kiamat, cepat atau lambat, sama sekali tidak ada nilai dan tidak ada pula faidahnya, akan tetapi yang menjadi (tolok ukur) nilai; kerugian, dan keuntungan, kesengsaraan dan kebahagiaan itu Adalah: Apakah seseorang berhak mendapat azab atau mendapat pahala. Maka hal ini akan aku beritakan kepada kalian dan akan aku jelaskan orang yang berhak menerimanya. Kemudian Dia menjelaskan orang yang berhak menerima azab dan tentang azab itu sendiri, karena uraian tersebut sangat pas atas mereka yang mendustakan kiamat itu. Allah berfirman, “sesungguhnya Allah melaknati orang-orang kafir,” maksudnya, orang-orang yang watak kufur telah menjadi jalan hidup mereka, dan jalan hidup mereka adalah kafir terhadap Allah, para RasulNya dan syariat yang mereka ajarkan dari Allah. Maka Allah mengusir dan menjauhkan mereka di dunia dan akhirat dari rahmatNya, dan cukuplah itu menjadi siksaan bagi mereka, “dan menyediakan bagi mereka api yang menyala-nyala,” maksudnya, api neraka yang bergejolak yang membakar jasad mereka, dan azab itu sampai kepada hati mereka, dan mereka dikekalkan di dalam azab yang sangat dahsyat itu, hingga mereka tidak akan dikeluarkan dariNya dan tidak dihentikan azab itu (walau) sesaat pun. “Mereka tidak memperoleh” untuk mereka “seorang pelindung” sehingga dia bisa memberikan apa yang mereka minta, “dan tidak pula seorang penolong” yang dapat mencegah aza dari mereka. Bahkan Allah Yang Mahatinggi lagi Maha Penolong berlepas diri dari mereka, dan mereka pun diliputi azab api yang bernyala-nyala, menjilat mereka sampai tiada tara. Oleh karena itu Allah berfirman, “pada hari ketika muka mereka dibolak-balikkan dalam neraka” dan mereka pun merasakan panasnya, dan sengatannya pun makin dahsyat menimpa mereka, dan mereka menyesali amal yang telah mereka lakukan dahulu, dan “mereka berkata, ‘Alangkah baiknya, andaikata kami taat kepada Allah dan taat pula kepada Rasul” maka kami tenttu selamat dari azab ini, dan kami tenttu berhak menerima, (seperti halnya orang-orang yang taat), pahala yang berlipat ganda. Namun itu semua adalah angan-angan yang waktunya telah berlalu, maka ia sama sekali tidak berguna bagi mereka kecuali sebagai penyesalan, kesedihan, kepiluan, dan kepedihan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahzab ayat 66: 64-66. Allah mengabarkan bahwa Allah menghalau orang-orang kafir dan pengingkar yang sombong, dan menjauhkan dari rahmat-Nya serta menghalau dari masuk ke dalam surga, Allah menyiapkan adzab nereka bagi mereka karena sebab kekafiran dan kesombongan mereka yang apinya menyambar-nyambar dan menyala-nyala di dalamnya. Neraka ini, bagi siapa yang memsaukinya dan tinggal di dalamnya, akan kekal selama-lamanya, tidak akan lenyap dan musnah, mereka orang-orang kafir di dalamnya dan tidak akan diperbaharui urusan mereka, dan tidak pula mereka dapat menghalau, dan tidak pula ada yang menolong mereka di dalamnya serta menyelamatkan mereka. Mereka akan berubah-ubah wujud mereka dari satu bentuk ke bentuk yang lain dan buruk hangus terbakar terkena api, mereka berkata dalam kondisi demikian : Duhai kiranya aku taat kepada Allah, mentauhidkan-Nya dan beriman kepada-Nya, dan kiranya aku juga taat kepada Rasul ﷺ membenarkannya dan mengikutinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mereka pun merasakan panasnya, perkaranya semakin dahsyat dan mereka menyesali perbuatan yang mereka lakukan di masa lalu. Sehingga kami selamat dari azab ini dan kami mendapatkan pahala yang besar sebagaimana orang-orang yang taat. Akan tetapi waktunya telah lewat, sehingga tidak ada lagi gunanya, yang ada hanyalah penyesalan, kekecewaan, kesedihan dan rasa sakit."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 66",
    "description": "Sebagai salah satu bentuk siksa yang akan diterima orang-orang kafir adalah bahwa pada hari itu wajah mereka dibolak-balikkan dalam neraka. Mereka berkata dengan penuh penyesalan, 'wahai, kiranya dahulu saat di dunia kami taat kepada Allah dan taat kepada rasul, niscaya kami tidak akan tersiksa. ' (lihat juga: al-furq'n/25: 27'29)67-68. Dan mereka juga berkata, 'ya tuhan kami, sesungguhnya kami telah menaati para pemimpin dan para pembesar kami yang sesat, lalu mereka menyesatkan kami dari jalan yang benar. Ya tuhan kami, karena kesesatan mereka sendiri dan penyesatan mereka kepada kami, maka timpakanlah kepada mereka azab dua kali lipat, dan laknat serta siksa-lah mereka dengan laknat dan siksa yang besar. '."
  }
]