[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "67-68. Orang-orang kafir berkata di Hari Kiamat, “Wahai Tuhan kami, sesungguhnya kami menaati imam-imam kami dalam kesesatan dan tokoh-tokoh kami dalam kesyirikan, lalu mereka menyelewengkan kami dari jalan petunjuk dan iman. Wahai Tuhan kami, siksalah mereka dengan siksa dua kali lipat siksaan yang Engkau timpakan kepada kami dan usirlah mereka dengan keras dari rahmatMu.” Ini merupakan dalil bahwa taat kepada selain Allah, menyelisihi perintah Allah dan perintah Rasulullah menyebabkan murka Allah dan hukumanNya, dan bahwa orang yang mengikuti dan diikuti sama-sama berserikat dalam siksa. Maka hendaknya setiap Muslim mewaspadai hal ini."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "67. Mereka membawa alasan yang lemah dan batil, mereka berkata, “Wahai Rabb kami! Sesungguhnya kami menaati para pemimpin kami dan para pembesar kaum kami, lalu mereka menyesatkan kami dari jalan yang lurus."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "67. Mereka berkata dengan penuh penyesalan: “Ya Tuhan kami, dahulu kami mentaati pemimpin kekafiran dan kesesatan. Mereka menghiasi kekafiran bagi kami, sehingga kami mentaati mereka; sehingga kami tersesat dari jalan lurus yang dapat mengantarkan kepada-Mu.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "67. وَقَالُوا۟ رَبَّنَآ إِنَّآ أَطَعْنَا سَادَتَنَا وَكُبَرَآءَنَا (Dan mereka berkata: “Ya Tuhan kami, sesungguhnya kami telah mentaati pemimpin-pemimpin dan pembesar-pembesar kami) Mereka adalah para pemimpin dan pembesar mereka yang mereka taati dan ikuti di dunia. فَأَضَلُّونَا السَّبِيلَا۠( lalu mereka menyesatkan kami dari jalan (yang benar)) Akibat mereka selalu menghiasi kekafiran kepada Allah dan rasul-Nya bagi kami."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "67. Adapun para pengikut orang-orang kafir berkata: Ya Tuhan kami, sesungguhnya kami hanya mengikuti perintah pembesar dan pemimpin kami dalam kekafiran dan pendustaan. Sehingga merekalah yang menyesatkan kami dari kebenaran dan petunjuk dengan kekufuran kepada Allah dan rasul-Nya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata,“Wahai Tuhan kami, sesungguhnya kami telah menaati para pemimpin dan para pembesar kami, lalu mereka menyesatkan kami dari jalan} jalan yang lurus"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "67. “Dan mereka berkata, ‘Ya Rabb kami, sesungguhnya kami telah menaati pemimpin-pemimpin dan pembesar-pembesar kami’,” dan kami telah bertaklid kepada mereka dalam kesesatan mereka, “lalu mereka menyesatkan kami dari jalan.” Ini sebagaimana Firman Allah, \"Dan (ingatlah) hari (ketika itu) orang yang lalim menggigit dua tangannya, seraya berkata: \"Aduhai kiranya (dulu) aku mengambil jalan bersama-sama Rasul.\" Kecelakaan besarlah bagiku; kiranya aku (dulu) tidak menjadikan sifulan itu teman akrab (ku). Sesungguhnya dia telah menyesatkan aku dari Al Qur'an ketika Al Qur'an itu telah datang kepadaku. Dan adalah setan itu tidak mau menolong manusia.\" (Al-Furqan: 27-29)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahzab ayat 67: Mereka berkata dengan menyesal : Wahai Rabb kami, sungguh kami telah mentaati pemimpin-pemimpin dan pembesar-pembesar kami, kami berjalan mengikuti mereka dan taklid kepada mereka, maka kami tersesat dari jalan yang benar dan tauhid, dan dari jalan petunjuk dan iman, kami berjalan di atas kesyirikan dan kesesatan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang menjadi pengikut. Ayat ini seperti yang disebutkan dalam surah Al Furqan: 27-29, yaitu: “Dan (ingatlah) hari (ketika itu) orang yang zalim menggigit dua tangannya, seraya berkata, \"Wahai, kiranya (dulu) aku mengambil jalan bersama-sama Rasul.-- Kecelakaan besarlah bagiku; sekiranya aku (dulu) tidak menjadikan si fulan itu teman akrab(ku).-- Sesungguhnya dia telah menyesatkan aku dari Al Quran ketika Al Quran itu telah datang kepadaku. Dan setan itu tidak mau menolong manusia.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 67",
    "description": "67-68. Dan mereka juga berkata, 'ya tuhan kami, sesungguhnya kami telah menaati para pemimpin dan para pembesar kami yang sesat, lalu mereka menyesatkan kami dari jalan yang benar. Ya tuhan kami, karena kesesatan mereka sendiri dan penyesatan mereka kepada kami, maka timpakanlah kepada mereka azab dua kali lipat, dan laknat serta siksa-lah mereka dengan laknat dan siksa yang besar. '67-68"
  }
]