[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang yang membenarkan Allah dan RasulNya serta melaksanakan SyariatNya, janganlah kalian menyakiti Rasulullah dengan kata-kata dan perbuatan, janganlah kalian seperti orang-orang yang menyakiti Nabiyullah Musa lalu Allah membebaskannya dari kebohongan dan kedustaan yang mereka katakan. Musa di sisi Allah memiliki kedudukan dan derajat yang tinggi."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "69. Wahai orang-orang yang beriman kepada Allah dan menjalankan syariat-Nya bagi mereka, janganlah kalian menyakiti Rasul kalian yang akan mengakibatkan kalian menjadi seperti orang-orang yang menyakiti Musa dengan ucapan mereka bahwa Musa menderita sakit hernia. Maka Allah membersihkannya dari tuduhan-tuduhan yang mereka katakan, hingga jelas bagi mereka bahwa Musa terbebas dari tuduhan yang mereka ucapkan. Sesungguhnya Musa di sisi Rabbnya mempunyai kedudukan terhormat, Dia tidak menolak permintaannya dan tidak pula menyia-nyiakan usahanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "69. Hai orang-orang beriman, janganlah kalian menyakiti Rasulullah sehingga kalian akan seperti orang-orang yang menyakiti Musa yang membuat kedustaan terhadapnya, bahwa Musa memiliki buah zakar yang bengkak, maka Allah membersihkannya dari kedustaan mereka itu. Musa adalah orang yang memiliki derajat dan kedudukan yang tinggi di sisi Allah. Abu Hurairah meriwayatkan dari Rasulullah, beliau bersabda: “Dahulu orang-orang Bani Israil mandi bersama-sama tanpa busana sehingga mereka dapat saling melihat aurat mereka. Sedangkan Nabi Musa mandi sendiri, sehingga Bani Israil berkata: ‘Sungguh, Musa tidak mandi bersama kita karena dia memiliki buah zakar yang bengkak’.” Rasulullah melanjutkan: “Pada suatu hari Nabi Musa mandi dan meletakkan pakaiannya di atas batu. Namun batu itu pergi membawa pakaiannya, sehingga Nabi Musa mengejarnya seraya berkata: ‘Hai batu, pakaianku! Hai batu, pakaianku!’ Hingga Bani Israil dapat melihat aurat Nabi Musa, dan mereka berkata: ‘Sungguh, Musa tidak terkena penyakit.’ Sampai berhentilah batu itu, sehingga auratnya terlihat; maka Nabi Musa mengambil pakaiannya dan memakainya. Lalu Nabi Musa memukul batu itu hingga pukulannya membekas pada batu tersebut.” (Shahih al-Bukhari, kitab mandi, bab mandi sendiri tanpa busana, no. 274. Shahih Muslim, kitab haidh, bab dibolehkannya mandi tanpa busana saat sendiri, no. 339. Dan makna (الأدرة) yakni penyakit bengkak pada buah zakar, kitab as-Shihah karangan al-Jauhari 3/138)"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "69. لَا تَكُونُوا۟ كَالَّذِينَ ءَاذَوْا۟ مُوسَىٰ (janganlah kamu menjadi seperti orang-orang yang menyakiti Musa) Allah memerintahkan orang-orang beriman supaya tidak menyakiti Nabi Muhammad sebagaimana Bani Israil menyakiti Nabi Musa. Ibnu Abi Syaibah, Ibnu Jarir, dan Ibnu Munzir mengeluarkan hadits dari Ibnu Abbas, ia berkata, kaum Nabi Musa bekata kepadanya bahwa dia memiliki buah zakar yang besar. Ketika dia pergi mandi pada suatu hari dan dia melepas bajunya di atas batu, tiba-tiba batu itu terbawa arus membawa bajunya, maka Musa mengejarnya dalam keadaan telanjang, dan ketika dia sampai di tempat Bani Israil berkumpul, mereka melihatnya, dan ternyata dia bukan orang yang memiliki buah zakar yang besar. وَكَانَ عِندَ اللهِ وَجِيهًا (Dan adalah dia seorang yang mempunyai kedudukan terhormat di sisi Allah) Dan Nabi Musa memiliki kedudukan yang tinggi di sisi Allah, bahkan Dia berbicara kepadanya secara langsung."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "69. Wahai orang-orang mukmin, janganlah kalian menjadi seperti orang-orang Yahudi yang menyakiti Nabi Musa, janganlah kalian menyakiti Nabi kalian. Wujud menyakiti itu adalah seperti perkataan mereka: “Dia (nabi) telah berbuat kemungkaran, kemudian Allah membersihkan Nabi dari tuduhan yang keliru. Allah menunjukkan bukti-bukti yang menunjukkan kedustaan tuduhan mereka. Sesungguhnya Musa memiliki kedudukan yang terhormat dan di sisi Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Wahai orang-orang yang beriman, janganlah seperti orang-orang yang menyakiti Musa, lalu Allah membersihkannya dari tuduhan-tuduhan yang mereka ucapkan. Dia di sisi Allah adalah orang yang memiliki kedudukan terhormat} orang yang memiliki kemuliaan dan dikabulkan doanya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "69. Allah mengingatkan hamba-hambaNya yang beriman untuk tidak menyakiti Rasulullah, Muhammad, nabi yang mulia lagi pengasih dan penyayang, agar mereka tidak membalasnya dengan lawan dari sikap-sikap yang wajib, seperti memuliakan dan menghormatinya, dan hendaknya mereka tidak meniru perilaku orang-orang yang menyakiti Musa bin Imran, Kali mar-rahman. Lalu Allah membebaskannya dari apa yang mereka katakan. Maksudnya, Allah menampakkan kepada mereka keselamatan (kebersihan) Musa darinya. Padahal (fakta) kondisinya Nabi Musa bukanlah tempat tuduhan (dialamatkan) atau untuk disakiti, karena mempunyai kedudukan terhormat di sisi Allah, didekatkan kepadaNya, dan termasuk golongan Rasul yang istimewa dan termasuk hamba-hambaNya yang disucikan. Namun keutamaan-keutamaan yang dimilkinya tidak membuat mereka jera untuk menyakitinya dan mengganggunya dengan hal-hal yang tidak dia suka. Maka waspadalah wahai orang-orang yang beriman, agar tidak meniru mereka dalam hal ini. Gangguan yang dimaksud adalah ucapan Bani Israil tentang Nabi Musa saat mereka mengetahui sifat Nabi Musa yang sangat pemalu dan sangat menutup diri dari mmereka, “Sesungguhnya tidak ada yang mencegahnya dari sikap yang demikian itu selain karena dia berpenyakit adar.” Maksudnya, buah dzakar kemaluannya sangat besar membengkak, dan hal ini menyebar luas di kalangan mereka. Maka Allah berkehendak membebaskannya dari tuduhan mereka, maka pada suatu hari beliau mandi dan beliau meletakan pakaiannya di atas batu, kemudian batu itu menggelinding membawa pakaian tersebut. Maka Musa pun terus membawanya hingga melintasi majelis Bani Israil, sehingga mereka melihatnya sebagai sebaik-baik ciptaan Allah. Maka sirnalah apa yang mereka tuduhkan kepadanya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahzab ayat 69: Allah memperingatkan mereka orang-orang yang beriman kepada Allah dan Rasul-Nya dan beramal dengan syariat-Nya; Bahwasanya menyakiti Nabi ﷺ dengan ucapan atau perbuatan; Sebagaimana yahudi menyakiti Nabi mereka Musa; Di mana mereka menyakiti dengan berbagai macam bentuknya, di antaranya mereka berkata : Dia (Musa) memiliki benjolan di dzakarnya, dikatakan juga : Dia memiliki aib di kulitnya seperti lepra dan yang lainnya. Ini semua mereka lihat secara sembunyi-sembunyi ketika Musa mandi, agar mereka mendapatkan salah satu aibnya. Allah berlepas diri dari apa yang mereka nisbatkan kepada Musa dari keburukan. Maka ketika Musa mandi di sungai, ketika dia akan memakai pakaiannya mereka melihatnya, jika demikian Musa selamat atas sangkaan mereka. Kemudian Allah mengabarkan bahwa Musa memiliki keagungan dan kedudukan di sisi Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala mengingatkan hamba-hamba-Nya yang mukmin agar tidak menyakiti Rasulullah shallallahu 'alaihi wa sallam; nabi yang mulia, yang memiliki sifat pengasih dan penyayang dengan bersikap kepada Beliau bertentangan dengan yang seharusnya, yaitu dimuliakan dan dihormati dan agar mereka tidak menyerupai orang-orang yang menyakiti Musa bin Imran, seorang yang diajak bicara oleh Allah, lalu Allah membersihkan Beliau dari tuduhan yang mereka lontarkan, yaitu dengan menunjukkan kebersihan Beliau. Padahal Musa ‘alaihis salam tidak pantas dijadikan sasaran tuduhan dan gangguan karena Beliau memiliki kedudukan terhormat di sisi Allah, dekat dengan-Nya, termasuk rasul pilihan dan termasuk hamba-hamba-Nya yang ikhlas. Keutamaan Beliau yang begitu banyak tidak membuat mereka berhenti dari menyakiti Beliau. Oleh karena itu, kamu wahai kaum mukmin berhati-hatilah jangan menyerupai mereka. Terhadap nabimu. Imam Bukhari meriwayatkan dengan sanadnya yang sampai kepada Abu Hurairah radhiyallahu 'anhu, ia berkata: Rasulullah shallallahu 'alaihi wa sallam bersabda, “Sesungguhnya Musa adalah seorang pemalu dan menutupi diri. Kulitnya sedikit pun tidak terlihat karena malu (ketika mandi), lalu di antara Bani Israil ada orang-orang yang menyakiti Beliau, mereka berkata, “Tidaklah Beliau menutup diri seperti ini kecuali karena cacat di kulitnya, entah itu sopak, udrah (bengkak biji kemaluannya), atau karena penyakit. Allah ingin membersihkan Beliau dari tuduhan yang mereka lontarkan kepada Musa itu. Maka pada suatu hari, Musa menyendiri, ia taruh pakaiannya di atas sebuah batu, kemudian mandi. Setelah selesai, ia datangi pakaiannya untuk mengambilnya, tetapi batu itu malah membawa lari pakaiannya, maka Musa mengambil tongkatnya dan mengejar batu itu sambil berkata, “Pakaianku hai batu, pakaianku hai batu.” Sehingga Beliau tiba di tengah kumpulan Bani Israil, lalu mereka melihat Beliau dalam keadaan telanjang ternyata fisiknya fisik terbaik yang diciptakan Allah. Allah membersihkan Beliau dari tuduhan yang mereka katakan itu, lalu batu itu berdiri, kemudian Musa mengambil pakaiannya dan memakainya, lalu dipukullah batu itu dengan tongkatnya. Demi Allah, sesungguhnya pada batu itu ada bekas pukulannya tiga, empat atau lima pukulan. Itulah maksud firman Allah Ta’ala, “Wahai orang-orang yang beriman! Bertakwalah kamu kepada Allah dan ucapkanlah perkataan yang benar,” (terj. Al Ahzaab: 70) Imam Bukhari meriwayatkan dengan sanadnya yang sampai kepada Abdullah bin Mas’ud radhiyallahu 'anhu, ia berkata: Pada saat perang Hunain, Nabi shallallahu 'alaihi wa sallam mengutamakan beberapa orang dalam pembagian (harta rampasan perang). Beliau memberikan Aqra’ bin Habis seratus ekor unta, memberikan kepada ‘Uyainah seperti itu dan memberikan juga kepada beberapa pemuka Arab. Ketika itu, Beliau melebihkan mereka dalam pembagian. Lalu ada seseorang yang berkata, “Demi Allah, sesungguhnya pembagian ini tidak ada keadilannya, dan tidak dimaksudkan untuk mencari wajah Allah.” Aku (Ibnu Mas’ud) berkata, “Demi Allah, saya akan laporkan kepada Nabi shallallahu 'alaihi wa sallam, lalu aku mendatanginya dan memberitahukan hal itu. Maka Beliau bersabda, “Siapakah yang akan berbuat adil jika Allah dan Rasul-Nya tidak berbuat adil? Semoga Allah merahmati Musa. Sungguh, dia telah disakiti dengan yang lebih dari ini, namun ia bersabar.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 69",
    "description": "Usai menyebutkan penyesalan orang-orang kafir ketika merasakan siksa neraka, Allah pada ayat-ayat berikut beralih menjelaskan larangan menyakiti orang lain dengan tuduhan palsu dan perkataan bohong. Wahai orang-orang yang beriman! janganlah kamu seperti orang-orang dari bani israil yang menyakiti hati nabi musa dengan berkata dusta. Nabi musa sangat jauh dari tuduhan dusta tersebut, maka Allah membersihkannya dari tuduhan-tuduhan yang mereka lontarkan. Dan dia seorang yang mempunyai kedudukan terhormat di sisi Allah. 70-71. Allah lantas meminta orang yang beriman agar berkata benar. Wahai orang-orang yang beriman! bertakwalah kamu kepada Allah dan ucapkanlah perkataan yang benar dan tepat sasaran. Jika kamu melakukan hal tersebut, niscaya Allah akan memperbaiki amal-amalmu dengan mempermudah jalanmu untuk berbuat baik dan bertobat, dan meng-ampuni dosa-dosamu. Dan barang siapa menaati Allah dan rasul-Nya, maka sungguh dia menang dengan kemenangan yang agung. Dia akan memperoleh ampunan Allah dan mendapatkan surga."
  }
]