[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Ingatlah (wahai Nabi) ketika Kami mengambil perjanjian yang dikukuhkan dari para nabi agar mereka menyampaikan risalah. Dan Kami mengambil perjanjian darimu, dari Nuh, Ibrahim, Musa dan Isa putra Maryam (yang mana mereka adalah para Rasul Ulul Azmi menurut pendapat yang masyhur) dan Kami juga mengambil perjanjian tegas dari mereka untuk menyampaikan risalah dan menunaikan amanat dan agar sebagian membenarkan sebagian yang lain."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Dan ingatlah -wahai Rasul- tatkala Kami mengambil perjanjian yang kuat dari para Nabi, yaitu agar mereka hanya menyembah Allah semata dan tidak menyekutukan-Nya dengan sesuatu apapun dan menyampaikan wahyu yang diturunkan kepada mereka. Dan Kami ambil perjanjian terlebih khusus darimu dan dari Nabi Nuh, Ibrahim, Musa dan Isa ibnu Maryam. Kami mengambil dari mereka perjanjian yang kuat untuk ditepati dengan menyampaikan risalah Allah yang telah diamanatkan kepada mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "7-8. Hai Rasulullah, ingatlah ketika Kami mengambil perjanjian dari para nabi agar mereka menyampaikan risalah, dan Kami juga mengambil perjanjian itu darimu, dan dari Nuh, Ibrahim, Musa, dan Isa bin Maryam. Kami mengambil perjanjian itu yang dikuatkan dengan sumpah, agar mereka menyampaikan risalah, sehingga Allah akan bertanya kepada para nabi tersebut dan para pengikut mereka, apakah kalian telah menyampaikan risalah itu kepada para hamba-Ku? Dan barangsiapa yang mendustakan maka Allah telah menyiapkan azab yang pedih bagi mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. وَإِذْ أَخَذْنَا مِنَ النَّبِيِّۦنَ مِيثٰقَهُمْ (Dan (ingatlah) ketika Kami mengambil perjanjian dari nabi-nabi) Agar mereka menyembah Allah dan menyeru kepada peribadatan-Nya, dan agar saling membenarkan, serta agar mereka memberi nasehat bagi kaum mereka. وَمِنكَ وَمِن نُّوحٍ وَإِبْرٰهِيمَ وَمُوسَىٰ وَعِيسَى ابْنِ مَرْيَمَ ۖ( dan dari kamu (sendiri) dari Nuh, Ibrahim, Musa dan Isa putra Maryam) Allah hanya menyebutkan mereka sebab mereka adalah para Rasul yang memiliki keteguhan dan kesabaran yang luar biasa. Dan didahulukannya Nabi Muhammad padahal beliau paling akhir pengutusannya adalah jelas sebagai pemuliaan dan penghormatan baginya. وَأَخَذْنَا مِنْهُم مِّيثٰقًا غَلِيظًا(dan Kami telah mengambil dari mereka perjanjian yang teguh) Yakni perjanjian yang sangat tegas dalam apa yang dipikulkan kepada mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Wahai Nabi, ingatlah, bahwa ketika Kami memberikan janji kepada para Nabi untuk menyampaikan risalah, perjanjiannya adalah bahwa: janji yang dikuatkan, dan Kami mengambil janji darimu wahai Rasul, dari Nuh, Ibrahim, Musa, Isa ibn Maryam, dan mengkhususkan mereka dengan sebutan ulul ‘Azmi diantara para Rasul, dan Kami berikan janji kepada mereka untuk bersumpah menyampaikan risalah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{(Ingatlah) ketika Kami mengambil perjanjian dari para nabi} perjanjian yang dikuatkan dengan menyampaikan risalah, menegakkan agama Allah, dan saling membenarkan satu sama lain {darimu, dari Nuh, Ibrahim, Musa, dan Isa putra Maryam. Kami telah mengambil dari mereka perjanjian yang teguh} perjanjian yang kuat untuk ditepati dengan menunaikan sesuatu yang diwajibkan untuk mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7-8. Allah mengabarkan bahwasanya Dia telah mengambil dari para nabi secara umum dan dari para ulu ‘azmi, (yaitu lima rasul yang disebutkan secara khusus), perjanjian yang sangat berat dan ikatan yang sangat kuat yang dikokohkan untuk menegakkan agama Allah dan berjihad di jalanNYa; dan bahwa sesungguhnya ini adalah jalan yang telah ditempuh oleh para nabi terdahulu hingga ditutup dengan penghulu mereka dan yang paling utama, yaitu Muahmmad, dan Allah memerintahkan manusia supaya meneladani mereka. Dan Allah akan menanyakan kepada para nabi dan para pengikutnya tentang janji yang sangat berat ini, apakah mereka memenuhinya dan mereka benar, lalu Dia akan membalas mereka dengan surge-surga kenikmatan, ataukah mereka ingkar lalu Dia akan menyiksa mereka dengan azab yang pedih? Allah berfirman, \"Di antara orang-orang mukmin itu ada orang-orang yang menepati apa yang telah mereka janjikan kepada Allah\" (Al-Ahzab:23)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahzab ayat 7: Allah mengabarkan bahwa Allah mengambil janji dengan para Nabi-Nya secara tegas dalam urusan ketauhidan dan dalam beribadah kepada Allah saja, serta melarang dari menyekutukan Allah, dan mendakwahkan kepada manusia atas hal itu, dan menyampaikan kepada mereka (manusia) secara menyeluruh, dan berjihad di jalan Allah. Kemudian Allah menegaskan bahwa pengambilan janji ini dilakukakn kepada Muhammad ﷺ, Nuh, Ibrahim, Musa, dan Isa. Mereka semua yang lima adalah Ulul Azmi di antara para rasul; Allah meyebutkan mereka para Nabi yang kemudian mengisahkannya dengan tegas."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan bahwa Dia mengambil perjanjian yang teguh dari para nabi secara umum, dan dari para rasul ulul ‘azmi secara khusus untuk menegakkan agama Allah dan berjihad di jalan-Nya, dan bahwa jalan ini adalah jalan yang dilalui para nabi terdahulu sampai diakhiri oleh penutup para nabi, yaitu Muhammad shallallahu 'alaihi wa sallam. Dia juga memerintahkan manusia untuk mengikuti mereka. Allah Subhaanahu wa Ta'aala akan bertanya kepada para nabi dan para pengikut mereka tentang janji yang teguh ini, apakah mereka memenuhinya sehingga Dia akan memberikan balasan kepada mereka dengan surga yang penuh kenikmatan, atau bahkan mereka tidak memenuhinya sehingga Dia mengazab mereka dengan azab yang pedih? Allah Subhaanahu wa Ta'aala berfirman di ayat lain, “Di antara orang-orang mukmin itu ada orang-orang yang menepati apa yang telah mereka janjikan kepada Allah; maka di antara mereka ada yang gugur, dan di antara mereka ada (pula) yang menunggu- nunggu dan mereka tidak merobah (janjinya),” (Al Ahzaab: 23) Yakni agar mereka semua beribadah kepada Allah dan mengajak manusia beribadah kepada-Nya. Perjanjian yang teguh ialah kesanggupan menyampaikan agama kepada umatnya masing-masing."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 7",
    "description": "7-8. Demikianlah kedudukan nabi dan istri-istrinya di kalangan kaum mukmin. Nabi juga mempunyai kedudukan luhur sebagai pembawa risalah dan penyeru kepada agama yang benar, sebagaimana para rasul sebelumnya. Dan ingatlah ketika kami mengambil perjanjian dari para nabi dan dari engkau sendiri, khususnya para rasul ulul 'azmi, seperti dari nuh, ibrahim, musa, dan isa putra maryam, dan kami telah mengambil dari mereka perjanjian yang teguh untuk menyampaikan risalah Allah kepada kaum masing-masing agar dia menanyakan kepada orang-orang yang benar dari para rasul tentang kebenaran mereka di hari kiamat'apakah mereka melaksanakan ajaran Allah itu, dan dia menyediakan azab yang pedih bagi orang-orang kafir"
  }
]