[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang yang membenarkan Allah dan RasulNya serta melaksanakan SyariatNya, taatilah Allah dan jauhilah kemaksiatan kepadaNya, agar kalian tidak ditimpa hukumanNya, dan ucapkanlah dalam segala urusan kalian dan keadaan kalian kata-kata yang lurus sesuai dengan kebenaran, bersih dari kedustaan dan kebatilan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "70. Wahai orang-orang yang beriman kepada Allah dan melaksanakan syariat-Nya, bertakwalah kepada Allah dengan mengerjakan segala perintah-Nya dan menjauhi segala larangan-Nya serta ucapkanlah ucapan yang benar dan jujur."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "70-71. Hai orang-orang yang beriman kepada Allah dan Rasulullah, bertakwalah kepada Allah dalam segala urusan kalian dan selalu berusahalah berkata benar, niscaya Allah akan memperbaiki dan menerima amalan kalian dan mengampuni dosa-dosa kalian. Dan barangsiapa yang senantiasa mentaati Allah dan Rasul-Nya maka dia akan meraih kemenangan yang besar."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "70. يٰٓأَيُّهَا الَّذِينَ ءَامَنُوا۟ اتَّقُوا۟ اللهَ (Hai orang-orang yang beriman, bertakwalah kamu kepada Allah) Dalam segala urusan. وَقُولُوا۟ قَوْلًا سَدِيدًا(dan katakanlah perkataan yang benar) Yakni perkataan yang sesuai kenyataan dan kebenaran dalam segala urusan kalian, dan termasuk di dalamnya adalah perkataan yang berhubungan dengan Zaid bin Haritsah dan Zainab binti Jahsy. Dan janganlah kalian menuduh Nabi melakukan hal yang tidak halal baginya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "70. Wahai orang-orang mukmin: Hati-hatilah dengan siksa Allah dengan menjalankan perintah Allah dan menjauhi maksiat. Berkatalah dengan perkataan yang baik dan benar"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Wahai orang-orang yang beriman, bertakwalah kepada Allah dan ucapkanlah perkataan yang benar} yang benar dan tepat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "70. Allah memerintahkan kaum Mukminin untuk bertakwa kepadaNya dalam seluruh kondisi mereka, lahir dan batin. Dari takwa itu Allah mengkhususkan dan menyunnahkan untuk berkata benar, yaitu perkataan yang sejalan dengan yang benar atau mendekati kebenaran di saat sesuatu yang meyakinkan itu udzur (sulit dipastikan), berupa bacaan, dzikir, amar ma’ruf, nahi mungkar, mempelajari ilmu dan mengajarkannya, berupaya maksimal untuk memperoleh yang tepat dalam masalah-masalah ilmiah, dan setiap sarana yang membantu untuknya. Dan termasuk perkataan yang benar adalah berkata lembut dan santun dalam berbicara kepada orang lain dan perkataan yang mengandung nasihat dan bimbingan kepada apa yang lebih maslahat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahzab ayat 70: Wahai orang-orang yang beriman kepada Allah dan Rasul-Nya ﷺ : Jadikan antara kalian dan antara adzab Allah penghalang dengan mengerjakan perintah-perintah-Nya dan menjauhi larangan-larangan-Nya, katakanlah oleh kalian perkataan yang benar dan adil dalam setiap urusan kalian dan muamalah kalian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala menerintahkan kaum mukmin agar bertakwa kepada-Nya dalam setiap keadaan mereka, ketika sembunyi atau terang-terangan. Demikian pula mengajak mereka berkata benar, yakni perkataan yang sesuai kebenaran atau mendekatinya ketika sulit dipastikan. Termasuk ke dalam perkataan yang benar adalah membaca Al Qur’an, berdzikr, beramar ma’ruf dan bernahi mungkar, mempelajari ilmu dan mengajarkannya, berusaha sesuai dengan kebenaran dalam berbagai masalah ilmiah, menempuh jalan yang mengarah kepadanya serta sarana yang dapat membantu kepadanya. Termasuik perkataan yang benar pula adalah ucapan yang lembut dan halus ketika berbicara dengan orang lain dan ucapan yang mengandung nasihat serta isyarat kepada yang lebih bermaslahat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 70",
    "description": "70-71. Allah lantas meminta orang yang beriman agar berkata benar. Wahai orang-orang yang beriman! bertakwalah kamu kepada Allah dan ucapkanlah perkataan yang benar dan tepat sasaran. Jika kamu melakukan hal tersebut, niscaya Allah akan memperbaiki amal-amalmu dengan mempermudah jalanmu untuk berbuat baik dan bertobat, dan meng-ampuni dosa-dosamu. Dan barang siapa menaati Allah dan rasul-Nya, maka sungguh dia menang dengan kemenangan yang agung. Dia akan memperoleh ampunan Allah dan mendapatkan surga"
  }
]