[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bila kalian bertakwa kepada Allah dan berkata benar, niscaya Allah akan memperbaiki amal-amal perbuatan kalian dan mengampuni dosa-dosa kalian. Barangsiapa menaati Allah dan rasulNya dalam perintah dan larangan, maka dia telah beruntung dengan mendapatkan kehormatan besar di dunia dan di akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "71. Sesungguhnya jika kalian bertakwa kepada Allah dan mengucapkan ucapan yang benar, niscaya Allah akan memperbaiki bagi kalian amal perbuatan kalian dan menerimanya dari kalian serta menghapus dari kalian dosa-dosa kalian sehingga Dia tidak menyiksa kalian karena dosa itu. Dan barangsiapa menaati Allah dan Rasul-Nya maka dia telah mendapatkan kemenangan yang besar, tidak ada kemenangan yang setara dengannya, yaitu kemenangan dengan mendapatkan keridaan Allah dan masuk ke dalam Surga."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "71. Niscaya Allah akan memperbaiki dan mempermudahmu untuk mengerjakan amal-amal saleh dan memberimu pahala. Kemudian Allah juga akan menghapus kesalahan dan dosamu atas keistiqamahanmu. Barangsiapa mentaati perintah Allah dan rasul-Nya, maka dia akan memperoleh tujuannya, dan akan memperoleh keridhoan Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Niscaya Dia akan memperbaiki amal-amal kalian dan mengampuni dosa-dosa kalian. Siapa saja yang menaati Allah dan RasulNya, sungguh dia telah mendapatkan kemenangan yang besar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "71. Kemudian Allah menjelaskan pengaruh yang ditimbulkan oleh takwa kepada Allah dan mengucapkan perkataan yang benar, seraya berfirman, “Niscaya Allah memperbaiki bagimu amalan-amalanmu,” maksudnya, hal itu dapat menjadi sebab bagi keshalihan (kebaikan) amal dan jalan untuk diterima. Karena dengan menggunakan takwa, maka amal kebajikan bisa diterima, sebagaimana Allah berfirman, \"Sesungguhnya Allah hanya menerima (korban) dari orang-orang yang bertakwa\". (Al-Maidah:27) Dan dengannya pula seseorang akan diberi taufik untuk beramal shalih, dan Allah akan memperbaiki amal-amalnya dengan cara memeliharanya dari hal-hal yang dapat merusaknya, menjaga pahalanya dan melipatgandakannya. Demikian pula, mengabaikan takwa dan ucapan yang benar merupakan sebab bagi rusaknya amal kebajikan, ia tidak diterima dan tidak mempunyai bekas (pengaruh). “Dan mengampuni bagimu” juga “dosa-dosamu” yang merupakan sebab kebinasaan kalian. Jadi, dengan takwa, berbagai perkara dapat menjadi lurus, dan dengannya pula segala yang terlarang menjadi terhindarkan. Maka dari itu Allah berfirman, “Dan barangsiapa menaati Allah dan rasulNya, maka sesuungguhnya dia telah mendapat kemenangan yang besar.\""
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahzab ayat 71: Allah menjelaskan sesungguhnya kalian jika yakin kepada Allah wahai manusia, dan kalian mengatakan perkataan yang baik; Semua itu menyebabkan Allah memperbaiki amalan-amalan kalian, dengan diberikan rezeki kepada kalian berupa keikhlasan yang diikuti dengna amalan-amalan; Allah akan menerima amalan-amalan kalian dan mengampuni dosa-dosa kalian dan maksiat0maksiat yang telah kalian kerjakan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala menyebutkan manfaat dari bertakwa kepada-Nya dan mengucapkan perkataan yang benar. Yang demikian menjadi sebab baiknya amal yang dilakukan dan jalan agar diterima, karena menggunakan takwa menjadikan semua amal diterima, sebagaimana firman Allah Ta’ala, “Sesungguhnya Allah hanya menerima dari orang-orang yang bertakwa.” (Terj. Al Maa’idah: 27) Di samping itu, dengan takwa, Allah akan memberi taufik kepada seseorang untuk beramal saleh, menjaga amal tersebut dari yang merusaknya, menjaga pahalanya dan melipatgandakannya, sebagaimana jika seseorang meremehkan ketakwaan dan perkataan yang benar menjadikan sebab rusaknya amal, tidak diterimanya dan tidak ada pengaruhnya. Dosa merupakan penyebab binasanya seseorang, maka dengan takwa Allah akan ampuni dosa-dosa itu, perkara menjadi lurus dan semua yang dikhawatirkan terjadi hilang."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 71",
    "description": "70-71. Allah lantas meminta orang yang beriman agar berkata benar. Wahai orang-orang yang beriman! bertakwalah kamu kepada Allah dan ucapkanlah perkataan yang benar dan tepat sasaran. Jika kamu melakukan hal tersebut, niscaya Allah akan memperbaiki amal-amalmu dengan mempermudah jalanmu untuk berbuat baik dan bertobat, dan meng-ampuni dosa-dosamu. Dan barang siapa menaati Allah dan rasul-Nya, maka sungguh dia menang dengan kemenangan yang agung. Dia akan memperoleh ampunan Allah dan mendapatkan surga. 72. Setelah meminta orang-orang beriman untuk menjaga ketakwaan, Allah lalu menjelaskan bahwa salah satu wujud takwa adalah menjaga amanah. Sesungguhnya kami telah menawarkan amanat, yakni tugas-tugas keagamaan, kepada langit, bumi, dan gunung-gunung, tetapi semuanya enggan untuk memikul tanggung jawab amanat itu dan mereka khawatir tidak akan mampu melaksanakannya, lalu kami menawarkan amanat itu kepada manusia, dan dipikullah amanat itu oleh manusia. Sungguh, manusia itu sangat zalim karena menyatakan sanggup memikul amanat tetapi secara sengaja menyia-nyiakannya, dan sangat bodoh karena menerima amanat tetapi sering lengah dan lupa menjalankan atau memenuhinya."
  }
]