[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya Kami telah menawarkan amanat (yang Allah amanatkan kepada orang-orang mukallaf agar mereka menjalankan perintah-perintah Allah dan menjauhi larangan-laranganNya) kepada langit dan bumi serta gunung, namun mereka semuanya menolak untuk memikulnya, dan mereka takut tidak misa menunaikannya, lalu manusialah yang memikulnya dan menanggungnya sekalipun dia lemah. Sesungguhnya manusia itu sangat zhalim dan bodoh terhadap dirinya sendiri."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "72. Sesungguhnya Kami telah menawarkan beban syariat dan apa yang harus dijaga dari harta dan rahasia kepada langit, bumi dan gunung-gunung, namun mereka semua enggan untuk menerima amanah ini dan takut dari akibatnya, lalu manusia menerimanya, sesungguhnya manusia itu amat zalim terhadap dirinya sendiri dan tidak mengetahui sama sekali akibat dari menerima amanah ini."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "72. Kami menawarkan beban, tanggungjawab, dan kewajiban dalam ibadah, muamalat, dan pemakmuran alam kepada seluruh makhluk, namun mereka semua menolak untuk memikulnya dan merasa tanggungjawab itu teramat besar dan berat. Kemudian manusia memilih untuk memikulnya dengan segala konsekuensinya. Sungguh manusia sangat zalim kepada diri sendiri dan sangat tidak mengetahui kadar tanggungjawab."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "72. إِنَّا عَرَضْنَا الْأَمَانَةَ عَلَى السَّمٰوٰتِ وَالْأَرْضِ وَالْجِبَال (Sesungguhnya Kami telah mengemukakan amanat kepada langit, bumi dan gunung-gunung) Dan bagian dari amanat ini adalah ketaatan dan kewajiban-kewajiban yang jika dikerjakan mendapat pahala dan jika ditinggalkan mendapat siksa, yang dibebankan kepada manusia yang tidak ada yang tahu siapa yang meninggalkannya kecuali Allah. Dan termasuk juga amanat berupa harta benda seperti barang titipan dan lain sebagainya yang tidak membutuhkan bukti. Dan hal-hal yang termasuk dari amanah juga adalah mandi junub, kemaluan, telinga, mata, lisan, perut, tangan, dan kaki. فَأَبَيْنَ أَن يَحْمِلْنَهَا وَأَشْفَقْنَ مِنْهَا(maka semuanya enggan untuk memikul amanat itu dan mereka khawatir akan mengkhianatinya) Yakni langit, bumi, dan gunung meskipun memiliki ukuran yang sangat besar jika memungkinkan untuk memikul beban syariat yang diberikan kepada manusia yang tidak ada yang mengetahui jika ia melalaikannya kecuali Allah niscaya mereka akan merasa berat karena pahala dan siksa yang ada dibalik itu semua. وَحَمَلَهَا الْإِنسٰنُ ۖ إِنَّهُۥ كَانَ ظَلُومًا جَهُولًا (dan dipikullah amanat itu oleh manusia. Sesungguhnya manusia itu amat zalim dan amat bodoh) Yakni menyanggupi untuk menjalankannya. Dan ini merupakan kezaliman bagi dirinya sendiri dan kebodohannya terhadap apa yang dipikulnya. Pendapat lain mengatakan bahwa yang dimaksud dengan memikul amanah ini adalah bahwa manusia disiapkan untuk memikulnya secara fitrah. Atau dia memikulnya ketika ditawarkan amanah ini kepadanya di alam ruh."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "72. Sesungguhnya Kami telah memberikan amanat dan tanggung jawab untuk melakukan ketaatan juga kehendak kepada langit, bumi dan gunung-gunung.. Kami meminta mereka untuk melaksanakan dan menjaga amanah itu, dan mereka khawatir untuk tidak bisa mengemban amanah itu. Sehingga dipikullah amanat itu oleh Adam bapak para manusia dengan segala kelemahannya, juga oleh jin. Mereka itu amat dhalim dan bodoh atas dirinya sendiri dan amanah mereka, ketika mereka diminta untuk menjaga amanah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya Kami telah menawarkan amanat} beban syariat berupa perintah dan larangan {kepada langit, bumi, dan gunung-gunung; tetapi semuanya enggan} lalu mereka menolak {untuk memikulnya dan mereka takut terhadapnya} mereka takut atas kesudahan dalam memikulnya {Lalu amanat itu dipikul oleh manusia. Sesungguhnya manusia itu sangat zalim lagi sangat bodoh} sangat zalim terhadap diri sendiri, dan sangat bodoh untuk mengetahui kesudahan memikul amanat itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "72. Allah mengagungkan masalah amanah yang diamanahkan Allah kepada orang-orang yang mukallaf, yang pada hakikatnya adalah mematuhi perintah-perintah dan menjauhi larangan-larangan dalam kondisi tersembunyi dan rahasia sebagaimana pada kondisi terbuka; dan bahwasanya Allah telah menawarkannya kepada semua makhluk yang besar-besar, yaitu langit, bumi, dan gunung secara sukarela (memilih), bukan mewajibkan, dan (dikatakan kepada mereka), “Kalau kamu melaksanakannya dan menunaikannya sebagaimana mestinya, maka kamu dapat pahala, dan jika kamu tidak melaksanakannya dan tidak menunaikannya, maka kamu akan ditimpa azab, “maka semuanya enggan untuk memikulnya dan mereka khawatir padanya” maksudnya, takut kalau tidak sanggup mengembannya, bukan karena durhaka kepada Rabbnya, dan juga bukan karena tidak berminat kepada pahalanya. Kemudian Allah menawarkannya kepada manusia dengan persyaratan tersebut di atas. Maka dia pun menerima dan menanggungnya sekalipun dia zhalim dan bodoh, dan dia pun memikul beban yang sangat berat ini."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahzab ayat 72: Allah memuliakan urusan amanah yang ia merupakan kebebasan dalam pilihan dalam menaati perintah-perintah-Nya dan menjauhi larangan-larangan-Nya, dan antara menjadi seorang yang beriman atau kafir, kemudian Allah menjadikan balasan dan adzab berdasarkan pilihannya; Karena sebab agungnya amanah ini, Allah menawarkan kepada makhluk-Nya; Yaitu langit dan bumi serta gunung; memberikan pilihan dengan tanpa mewajibkan; Maka para makluk tadi menolak semuanya untuk membawa amanh ini, mereka berharap untuk pasrah tanpa memilih; Karena sebab mereka takut tidak menjalankannya sebagaimana perintah Allah; Adapun manusia yang lemah mereka menerima amanah ini; Karena sebab mereka dzalim bagi diri mereka, bodoh secara tabiat dalam mengemban amanah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala membesarkan masalah amanah yang dibebankannya kepada orang-orang mukallaf. Yang dimaksud dengan amanah di sini ialah tugas-tugas agama, yaitu mengerjakan perintah dan menjauhi larangan seperti shalat dan lainnya, di mana jika dikerjakan mereka akan mendapatkan pahala, dan jika ditinggalkan mereka akan mendapatkan siksa. Allah Subhaanahu wa Ta'aala menawarkannya kepada makhluk-makhluk yang besar, seperti langit, bumi dan gunung-gunung, penawaran pilihan bukan paksaan. Mereka khawatir tidak sanggup memikulnya dan malah mendurhakai Tuhannya, bukan karena tidak suka pahalanya. Lalu Allah menawarkannya kepada manusia, kemudian manusia menerimanya dan siap memikulnya dengan keadaannya yang zalim lagi jahil (bodoh)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 72",
    "description": "Setelah meminta orang-orang beriman untuk menjaga ketakwaan, Allah lalu menjelaskan bahwa salah satu wujud takwa adalah menjaga amanah. Sesungguhnya kami telah menawarkan amanat, yakni tugas-tugas keagamaan, kepada langit, bumi, dan gunung-gunung, tetapi semuanya enggan untuk memikul tanggung jawab amanat itu dan mereka khawatir tidak akan mampu melaksanakannya, lalu kami menawarkan amanat itu kepada manusia, dan dipikullah amanat itu oleh manusia. Sungguh, manusia itu sangat zalim karena menyatakan sanggup memikul amanat tetapi secara sengaja menyia-nyiakannya, dan sangat bodoh karena menerima amanat tetapi sering lengah dan lupa menjalankan atau memenuhinya. 73. Demikianlah kezaliman dan kebodohan manusia, sehingga Allah akan mengazab orang-orang munafik laki-laki dan perempuan, orang-orang musyrik laki-laki dan perempuan, karena mereka tidak menjalankan amanat; dan bagi mereka yang bertobat, Allah akan menerima tobat orang-orang mukmin laki-laki dan perempuan. Dan Allah maha pengampun, maha penyayang kepada semua hamba yang bertobat. []."
  }
]