[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sehingga akibat dari dipikulnya amanat oleh manusia adalah bahwa Allah akan menyiksa orang-orang munafik, laki-laki dan perempuan, yaitu orang-orang yang menampakkan Islam dan menyembunyikan kekafiran dan orang-orang yang menyekutukan Allah dalam beribadah kepadaNya, yang laki-laki dan yang perempuan. Dan Allah menerima taubat orang-orang mukmin, yang laki-laki dan yang perempuan, dengan menutupi dosa-dosa mereka dan tidak menghukum mereka. Allah Maha Pengampun bagi hamba-hambaNya yang bertaubat kepadaNya dan juga Maha Penyayang kepada mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "73. Manusia memikul beban amanah ini dengan takdir dari Allah, agar Allah menyiksa orang-orang munafik laki-laki dan perempuan, dan orang-orang musyrik laki-laki dan perempuan karena kemunafikan dan kesyirikan mereka kepada Allah, dan agar Allah mengampuni orang-orang yang beriman laki-laki dan perempuan yang telah berhasil mengemban beban amanah syariat ini. Dan Allah Maha Pengampun terhadap dosa-dosa orang yang bertobat kepada-Nya dari para hamba-Nya, lagi Maha Penyayang kepada mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "73. Allah menguji manusia dengan tanggungjawab itu untuk memberi azab bagi laki-laki dan perempuan munafik yang mengkhianati amanah dan perjanjian dengan menampakkan sesuatu yang menyelisihi apa yang mereka sembunyikan, dan juga bagi laki-laki dan perempuan musyrik yang lebih memilih kesyirikan daripada tauhid. Dan agar Allah mengampuni laki-laki dan perempuan beriman yang menjaga amanah dan melaksanakan tugas mereka di muka bumi. Allah Maha Mengampuni dosa-dosa dan memberi rahmat bagi hamba-hamba-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "73. لِّيُعَذِّبَ اللهُ الْمُنٰفِقِينَ وَالْمُنٰفِقٰتِ وَالْمُشْرِكِينَ وَالْمُشْرِكٰتِ(sehingga Allah mengazab orang-orang munafik laki-laki dan perempuan dan orang-orang musyrikin laki-laki dan perempuan) Yakni manusia memikulnya sehingga Allah akan mengazab orang yang mengkhianati amanah ini dan mendustakan para Rasul serta mengingkari perjanjian. وَيَتُوبَ اللهُ عَلَى الْمُؤْمِنِينَ وَالْمُؤْمِنٰتِ ۗ( dan sehingga Allah menerima taubat orang-orang mukmin laki-laki dan perempuan) Yakni orang-orang yang menjalankan amanah yang dipikulnya yang berupa ibadah dan lain sebagainya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "73. Amanah itu diemban oleh manusia agar Allah mengazab orang-orang munafik atas kemunafikan dan penghianatan mereka atas amanah yang mereka emban. Juga mengazab orang-orang musyrik atas kesyirikan mereka kepada Allah. Juga agar Allah menerima taubat orang-orang mukmin yang senantiasa taat kepada Allah dan rasul-Nya. Juga menerima taubat orang-orang yang senantiasa menjaga amanah. Allah Maha luas dalam memberi ampunan atas dosa-dosa orang yang bertaubat. Allah Mengasihi mereka atas penjagaan mereka terhadap amanah yang mereka emban untuk beribadah dan seterusnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dengan demikian, Allah akan mengazab orang-orang munafik laki-laki dan perempuan serta orang-orang musyrik laki-laki dan perempuan. Allah akan menerima taubat orang-orang mukmin laki-laki dan perempuan. Allah Maha Pengampun lagi Maha Penyayang}"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "73. Maka manusia terbagi menjadi tiga bagian menurut pelaksanan atau tidaknya amanat tersebut. Yaitu (pertama), kaum munafik. Mereka menampakkan bahwa mereka melaksanakannya secara lahir, tidak secara batin. Dan (kedua), orang-orang musyrik yang mengabaikannya secara lahir dan batin. Dan (ketiga), orang-orang Mukmin yang menunaikannya secara lahir dan batin. Lalu Allah menjelaskan perbuatan tiga macam manusia ini dan apa yang pantas bagi mereka, pahala atau siksaan, seraya berfirman, “Sehingga Allah mengazab orang-orang munafik laki-laki dan perempuan, dan orang-orang musrikin laki-laki dan perempuan; dan Allah menerima taubat orang-orang Mukmin laki-laki dan perempuan. Dan Allah Maha Pengampun lagi Maha Penyayang.” Maka segala puji hanya untukNya, yang mana telah mengakhiri ayat ini dengan dua nama (Nya) yang sangat mulia yang menunjukkan kepada kesempurnaan ampunan Allah dan luasnya rahmatNya, serta keuniversalan kemurahanNYa, padahal sesungguhnya manusia-manusia yang akan diadili sangat banyak, di antara mereka ada yang tidak berhak mendapat ampunan dan rahmat karena kenifakan dan kesyirikannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahzab ayat 73: Allah menutup surat ini dengan penjelasan bahwasanya manusia membawa amanah ini agar Allah dapat mengadzab orang-orang munafik laki-laki maupun perempuan dan orang-orang musyrik laki-laki maupun perempuan; Karena sebab mereka berkhianat atas amanah yang diberikan Allah dan tidak beramal sebagaimana perintah Allah. Allah mengecualikan bagi orang-orang yang beriman baik laki-laki maupun perempuan yang mereka semua menjaga amanah sebagaimana yang diinginkan oleh Allah, mereka mengerjakan kewajiban mereka, dan menjauhkan larangan-larangan yang dilarang Allah, sungguh Allah memiliki banyak ampunan bagi orang-orang yang bertaubat dari hamba-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dalam memkul tugas amanah itu, manusia terbagi menjadi tiga golongan: Pertama, kaum munafik yang menampakkan dirinya bahwa mereka melaksanakannya baik lahir maupun batin, padahal tidak. Kedua, kaum musyrik yang tidak melaksanakannya sama sekali, baik lahir maupun batin. Ketiga, kaum mukmin yang melaksanakannya lahir maupun batin. Maka di ayat tersebut Allah Subhaanahu wa Ta'aala menyebutkan amal ketiga golongan itu dan balasan kepada masing-masingnya. Yang tidak menjalankan amanah itu. Yang menjalankan amanah itu. Segala puji bagi Allah Ta’ala karena Dia mengakhiri ayat ini dengan dua nama-Nya yang mulia, yang menunjukkan sempurnanya ampunan Allah, luasnya rahmat-Nya dan meratanya kepemurahan-Nya, tetapi sayangnya kebanyakan mereka tidak mau mendapatkan ampunan dan rahmat-Nya karena perbuatan nifak dan syirknya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 73",
    "description": "Demikianlah kezaliman dan kebodohan manusia, sehingga Allah akan mengazab orang-orang munafik laki-laki dan perempuan, orang-orang musyrik laki-laki dan perempuan, karena mereka tidak menjalankan amanat; dan bagi mereka yang bertobat, Allah akan menerima tobat orang-orang mukmin laki-laki dan perempuan. Dan Allah maha pengampun, maha penyayang kepada semua hamba yang bertobat. []1. Pada bagian pungkasan surah al-a'z'b Allah menegaskan pen-tingnya menunaikan amanat. Di sana Allah juga mengancam orang munafik dan kafir dengan azab yang pedih dan mengampuni dosa orang yang bertobat, karena Allah maha pengampun dan maha penyayang. Surah saba' lantas diawali dengan pujian kepada Allah, pemilik apa saja yang ada di langit dan bumi. Segala puji bagi Allah yang memiliki, menguasai, dan mengatur apa yang ada di langit dan apa yang ada di bumi, dan segala puji di akhirat juga bagi Allah karena dialah penguasa dan pengendali kehidupan akhirat. Dan dialah yang mahabijaksana dalam tindakan dan ciptaan-Nya, mahateliti sehingga mengetahui semua urusan secara rinci."
  }
]