[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah mengambil perjanjian tersebut dari para Rasul di atas agar Dia bertanya kepada para rasul tentang apakah umat-umat mereka memenuhi ajakan mereka atau tidak. Lalu Dia membalas orang-orang yang beriman dengan surga dan Dia telah menyiapkan bagi orang-orang kafir di Hari Kiamat azab yang besar di dalam Neraka Jahanam."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Allah mengambil perjanjian yang kuat ini dari para nabi agar Allah bertanya kepada para nabi atas kebenaran mereka (menyampaikan risalah) sebagai bentuk celaan bagi orang-orang kafir. Dan Allah telah menyiapkan bagi orang-orang yang kafir terhadap-Nya dan terhadap para rasul-Nya pada hari Kiamat nanti siksa yang menyakitkan, yaitu Neraka Jahanam."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. لِّيَسْـَٔلَ الصّٰدِقِينَ عَن صِدْقِهِمْ ۚ (agar Dia menanyakan kepada orang-orang yang benar tentang kebenaran mereka) Yakni tentang kebenaran mereka dalam menepati perjanjian ini, yang berisi perintah untuk menyampaikan risalah kepada kaum mereka. Jika mereka saja akan ditanya tentang hal ini, lalu bagaimana dengan orang-orang selain mereka? وَأَعَدَّ لِلْكٰفِرِينَ عَذَابًا أَلِيمًا(dan Dia menyediakan bagi orang-orang kafir siksa yang pedih) Yakni dan Allah akan menanyakan orang-orang kafir bagaimana mereka menjawab rasul mereka. Dan Allah telah menyiapkan bagi mereka azab yang sangat pedih."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8. Dan Kami telah memberikan janji agar di hari kiamat Allah mempertanyai para Nabi tersebut dalam janji mereka tentang kejujuran mereka, dalam menyampaikan risalah dan menyampaikan wahyu kepada kaumnya, Allah telah memberikan janji kepada para Rasul untuk menyampaikan kepada orang kafir mengenai adzab dan siksa yang pedih"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{agar Dia menanyakan kepada orang-orang yang benar tentang kebenaran mereka. Dia menyediakan bagi bagi orang-orang kafir azab yang pedih} yang menyakitkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7-8. Allah mengabarkan bahwasanya Dia telah mengambil dari para nabi secara umum dan dari para ulu ‘azmi, (yaitu lima rasul yang disebutkan secara khusus), perjanjian yang sangat berat dan ikatan yang sangat kuat yang dikokohkan untuk menegakkan agama Allah dan berjihad di jalanNYa; dan bahwa sesungguhnya ini adalah jalan yang telah ditempuh oleh para nabi terdahulu hingga ditutup dengan penghulu mereka dan yang paling utama, yaitu Muahmmad, dan Allah memerintahkan manusia supaya meneladani mereka. Dan Allah akan menanyakan kepada para nabi dan para pengikutnya tentang janji yang sangat berat ini, apakah mereka memenuhinya dan mereka benar, lalu Dia akan membalas mereka dengan surge-surga kenikmatan, ataukah mereka ingkar lalu Dia akan menyiksa mereka dengan azab yang pedih? Allah berfirman, \"Di antara orang-orang mukmin itu ada orang-orang yang menepati apa yang telah mereka janjikan kepada Allah\" (Al-Ahzab:23)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahzab ayat 8: Allah mengambil janji kepada mereka para rasul dan akan meminta pertanggung jawaban pada hari kiamat atas dakwah mereka dan penyampaian kerisalahan mereka serta apa yang telah mereka minta dari umat mereka. Dan Allah juga akan bertanya kepada mereka tentang jawaban atas umat-umat mereka. Dengan rahmat-Nya Allah mengabarkan kepada orang-orang yang beriman, bahwa Allah akan mengadzab orang-orang yang kafir yang mendustkana para rasul dengan adzab yang pedih di neraka jahannam. Adapun bagi orang-orang yang beriman maka memungkinkan untuk mendapatkan rahmat-Nya yang kemudian Allah ampunkan mereka, dan mungkin juga Allah bersihkan (dengan neraka) kemudian Allah masukkan ke dalam surga dengan rahmat-Nya. Berkata Al Qurthubi : Jika para rasul akan ditanya, lalu bagaimana dengan keadaan seluruh makhluk?!."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Pada hari kiamat Allah akan menanyakan kepada para rasul sampai di mana usaha mereka menyampaikan ajaran-ajaran Allah kepada umatnya dan sampai di mana umatnya melaksanakan ajaran Allah itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 8",
    "description": "7-8. Demikianlah kedudukan nabi dan istri-istrinya di kalangan kaum mukmin. Nabi juga mempunyai kedudukan luhur sebagai pembawa risalah dan penyeru kepada agama yang benar, sebagaimana para rasul sebelumnya. Dan ingatlah ketika kami mengambil perjanjian dari para nabi dan dari engkau sendiri, khususnya para rasul ulul 'azmi, seperti dari nuh, ibrahim, musa, dan isa putra maryam, dan kami telah mengambil dari mereka perjanjian yang teguh untuk menyampaikan risalah Allah kepada kaum masing-masing agar dia menanyakan kepada orang-orang yang benar dari para rasul tentang kebenaran mereka di hari kiamat'apakah mereka melaksanakan ajaran Allah itu, dan dia menyediakan azab yang pedih bagi orang-orang kafir. 9. Ayat ini menginformasikan pertolongan Allah kepada kaum mukmin pada perang khandak. Wahai orang-orang yang beriman! ingatlah akan nikmat Allah yang telah dia karuniakan kepadamu ketika bala tentara dari kaum musyrik dan yahudi bani quraizah datang kepadamu, lalu kami kirimkan kepada mereka angin topan dan bala tentara yang tidak dapat terlihat olehmu, yaitu para malaikat yang memorak-porandakan barisan mereka. Allah maha melihat apa yang kamu kerjakan dan akan memberi balasan yang setimpal atasnya."
  }
]