[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang Mukmin seluruhnya, ingatlah nikmat Allah yang telah Dia berikan kepada kalian di Madinah di hari-hari Perang Ahzab, (yaitu Perang Khandaq) ketika orang-orang musyrik di luar Madinah bersatu padu dengan orang-orang Yahudi ditambah dengan orang-orang munafik di dalam Madinah dan sekitarnya, lalu mereka mengepung kalian, maka Kami mengirimkan angin yang kencang kepada mereka yang menerbangkan tenda-tenda mereka dan melemparkan bejana-bejana mereka, dan Kami mengirimkan para malaikat dari langit yang tidak kalian lihat, maka ketakutan menyergap hati mereka. Allah Maha Melihat apa yang kalian perbuat, tidak ada sesuatu pun yang samar bagiNya dari semua itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Wahai orang-orang yang beriman kepada Allah dan menjalankan apa yang disyariatkan! Ingatlah nikmat Allah kepada kalian, tatkala datang ke Madinah tentara kafir yang bergabung untuk memerangi kalian, dengan dibantu oleh orang-orang munafik dan orang-orang Yahudi, lalu Kami kirimkan kepada mereka angin, yaitu angin topan yang dengannya Nabi -ṣallallāhu 'alaihi wa sallam- mendapat pertolongan. Dan Kami utus bala tentara dari kalangan Malaikat yang tidak bisa kalian lihat, maka orang-orang kafir melarikan diri tidak mampu berbuat apa-apa. Dan Allah Maha Mengetahui amal perbuatan kalian, tidak ada sesuatu pun dari hal itu yang luput dari-Nya dan Dia akan membalas kalian atas amal perbuatan kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "9. Allah mengingatkan hamba-hamba-Nya yang beriman tentang kenikmatan yang Dia berikan kepada mereka, saat pasukan sekutu yang terdiri dari orang-orang musyrik, Yanudi, dan munafik datang ke Madinah dan mengepung orang-orang beriman. Kemudian Allah mengirim kepada pasukan itu angin kencang yang merobohkan tenda-tenda dan menumpahkan panci-panci mereka. Dan Allah juga mengutus para malaikat dari langit untuk menolong orang-orang beriman. Allah Maha Mengetahui segala yang kalian kerjakan, tidak ada yang tersembunyi dari-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. إِذْ جَآءَتْكُمْ جُنُودٌ (ketika datang kepadamu tentara-tentara) Mereka adalah para pasukan yang terkumpul dari berbagai golongan untuk menyerang Rasulullah di Madinah. Perang ini disebut dengan perang Khandak atau perang Ahzab. Pasukan ini terdiri dari Abu Sufyan bin Harb bersama orang-orang Qurasy, ‘Uyainah bin Hishn al-Fazari bersama kabilah Ghathafan, dan Bani Quraidzah dan Bani Nadhir dari kaum Yahudi. Perang ini terjadi pada bulan Syawal tahun ke lima hijriah. فَأَرْسَلْنَا عَلَيْهِمْ رِيحًا(lalu Kami kirimkan kepada mereka angin topan) Sampai-sampai panci-panci mereka terlempar dan kemah-kemah mereka tercabut. وَجُنُودًا لَّمْ تَرَوْهَا ۚ( dan tentara yang tidak dapat kamu melihatnya) Yakni pasukan malaikat. Allah mengirim pasukan malaikat kepada mereka, sehingga tencabut pasak-pasak dan memotong tali-tali kemah mereka, api unggun mereka padam, panci-panci mereka terbalik, dan kuda-kuda mereka saling bertabrakan; dan Allah memasukkan ketakutan ke dalam hati mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9. Wahai orang-orang Mukmin, ingatlah kalian akan nikmat yang telah diberikan oleh Allah pada saat perang Khandaq pada tahun ke-5 hijriyah, ketika kalian didatangi pasukan Ahzab untuk menyerbu kota Madinah dari kaum Quraisy, Ghatafan dan kaum Yahudi, lalu Kami kirimkan kepada mereka angina topan, yang menumbangkan tenda-tenda mereka dan membalikkan periuk-periuk mereka, dan Kami kirimkan bala tentara yang tidak dapat mereka lihat yaitu Malaikat, dan pasak-pasak tercabut, dan ketakutan menyelimuti jiwa mereka. Dan Allah Maha Mengetahui, termasuk Mengetahui lubang Khandaq dan yang lainnya dengan penglihatan yang jelas. Ayat yang diturunkan ketika perang Ahzab dibawah pimpinan Abu Sufyan, sedang orang-orang munafiq mengadu kepada Nabi, dan berkata: sesungguhnya rumah-rumah kami telanjang (terbuka) sebab diporak-prandakan angin kencang, mereka berkata: lari, lari"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Wahai orang-orang yang beriman, ingatlah nikmat Allah atas kalian ketika datang kepada kalian bala tentang} pasukan yang berkumpul untuk menyerang Rasulullah SAW dari pasukan Quraisy, Ghathafan, orang-orang Yahudi dari Bani Quraizhah dan lainnya {lalu Kami kirimkan kepada mereka angin topan dan bala tentara yang tidak dapat kalian lihat} dan Kami mengutus bala tentara dari golongan malaikat yang tidak bisa kalian lihat {Allah Maha Melihat apa yang kalian kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9-11. Allah mengingatkan hamba-hambaNya yang beriman tentang nikmatNya kepada mereka dan mendorong mereka untuk mensyukurinya, yaitu ketika bala tentara negeri Makkah dan hijaz mendatangi mereka dari atas mereka, sedangkan bala tentara negeri Nejed dari arah bawah mereka; dan mereka pun bersepakat dan saling berjanji untuk menghabisi Rasul dan para sahabat. Dan ini terjadi dalam perang Khandaq, dan mereka didukung oleh beberapa kelompok kaum Yahudi yang berada di sekitar Madinah. Mereka pun datang dengan tentara yang sangat besar dan pasukan sekutu. Rasulullah pun membuat parit mengelilingi Madinah. Maka pasukan sekutu mengepung Madinah dan nkeadaan pun makin menjadi sangat genting, hati terasa menyesak ke tenggorokan hingga prasangka buruk dari banyak orang (kaum Mukminin) telah mencapai puncaknya saat mereka melihat keadaan yang sangat menjepit dan berbagai kesengsaraan bertubi-tubi. Pengepungan terhadap kota Madinah ini berlangsung dalam waktu yang cukup lama dan keadaannya seperti yang dijelaskan oleh Allah, “dan ketika tidak tetap lagi penglihatan (mu), dan hatimu naik menyesak samppai ke tenggorokan dan kamu menyangka terhadap Allah dengan bermacam-macam prasangka,” maksudnya, prasangka-prasangka buruk, yaitu bahwa Allah tidak akan menolong agamaNya dan tidak akan menyempurnakan kalimatNya, “di situlah orang-orang Mukmin dijuji,” dengan cobaan yang sangat berat, “dan digoncangkan dengan goncangan yang sangat,” dengan rasa takut, rasa gelisah dan kelaparan, agar iman mereka tampak dan keyakinan mereka bertambah. Maka benar-benar tampaklah, dengan segala puji bagi Allah, keimanan dan kuatnya keyakinan mereka yang membuat mereka mengungguli umat-umat terdahulu dan yang akan datang kemudian. Dan di saat kesempitan makin hebat dan kesengsaraan makin mencekik, maka iman mereka pun menjadi ainul yaqin. \"Dan tatkala orang-orang mukmin melihat golongan-golongan yang bersekutu itu, mereka berkata: \"Inilah yang dijanjikan Allah dan Rasul-Nya kepada kita\". Dan benarlah Allah dan Rasul-Nya. Dan yang demikian itu tidaklah menambah kepada mereka kecuali iman dan ketundukan\". (Al-Ahzab:22). Saat itulah kemunafikan kaum munafik menjadi jelas dan apa yang mereka sembunyikan selama ini menjadi nyata, Allah berfirman,"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ahzab ayat 9: Allah menyeru kepada hamba-Nya yang beriman dengan kecintaan yang mereka disifati dengan sifat keimanan. Allah menyeru mereka dan menyebut-nyebut mereka dengan karunia, kasih sayang dan pertolongan-Nya, Allah berkata kepada mereka : Ingatlah akan nikmat Allah bagi diri-diri kalian pada hari yang berkumpul para pasukan, yang berkumpul atas kalian para kabilah-kabilah pada hari Khandaq, yang kemudian kami usir mereka semua dengan terhina, dan kami kirimkan angin yang kencang (yang kemudian) menerjang tenda-tenda mereka, dan mereka semua ditakdirkan lari. Kemudian Kami kirimkah para malaikat dari langit yang para malaikat tersebut tidak dapat dilihat oleh mata-mata kalian. Sungguh Allah Maha Mengetahui yang tersembunyi, yang tidak ada satupun yang tersembunyi bagi-Nya sesuatu apapun dari niat-niat kalian, perbuatan kalian dan amalan-amalan kalian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala mengingatkan kepada hamba-hamba-Nya yang mukmin nikmat-Nya kepada mereka dan mendorong mereka untuk mensyukurinya, yaitu ketika datang kepada mereka penduduk Mekah dan Hijaz dari atas mereka, penduduk Nejd dari bawah mereka, dan mereka bekerja sama dan bersekutu untuk memusnahkan Rasulullah shallallahu 'alaihi wa sallam dan para sahabatnya, yaitu pada saat perang Khandaq. Pasukan yang bersekutu itu juga dibantu oleh orang-orang Yahudi yang berada di sekitar Madinah, sehingga mereka datang menyerang kaum muslimin dalam jumlah yang besar. Ketika itu parit telah dibuat di sekitar Madinah, dan musuh telah mengepung Madinah, keadaan pun menjadi parah sampai hati mereka menyesak ke tenggorokan dan banyak yang berprasangka yang bukan-bukan terhadap Allah karena mereka melihat sebab-sebab kehancuran mereka dari berbagai arah, dan pengepungan itu terus berlalu dalam beberapa hari. Ayat ini menerangkan kisah Ahzab, yaitu golongan-golongan yang dihancurkan pada perangan Khandaq karena menentang Allah dan Rasul-Nya. Yang dimaksud dengan tentara yang tidak dapat kamu lihat adalah para malaikat yang sengaja didatangkan Allah untuk menghancurkan musuh-musuh-Nya itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ahzab Ayat 9",
    "description": "Ayat ini menginformasikan pertolongan Allah kepada kaum mukmin pada perang khandak. Wahai orang-orang yang beriman! ingatlah akan nikmat Allah yang telah dia karuniakan kepadamu ketika bala tentara dari kaum musyrik dan yahudi bani quraizah datang kepadamu, lalu kami kirimkan kepada mereka angin topan dan bala tentara yang tidak dapat terlihat olehmu, yaitu para malaikat yang memorak-porandakan barisan mereka. Allah maha melihat apa yang kamu kerjakan dan akan memberi balasan yang setimpal atasnya. 10. Wahai kaum mukmin, Allah mengirim para malaikat untuk mendukungmu pada perang khandak, yaitu ketika mereka, yakni tentara musyrik, datang kepadamu dari atas, yaitu dari timur, dan tentara yahudi bani quraizah datang dari bawahmu, yaitu dari barat, dan ketika penglihatan-Mu terpana oleh besarnya pasukan mereka dan hal itu menimbulkan rasa takut yang hebat sehingga hatimu menyesak sampai ke tenggorokan, dan bahkan sebagian dari kamu terjangkiti sifat munafik sehingga berprasangka yang bukan-bukan terhadap Allah seakan dia tidak mampu memenangkan pasukan mukmin atas pasukan kafir."
  }
]