[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan di antara manusia ada yang berkata, “Kami beriman kepada Allah.” namun, ketika kaum musyrikin mengganggunya, dia gundah tak sabar akibat siksaan dan gangguan mereka, layaknya dia berkeluh kesah karena mengalami siksaan Allah dan tidak bersabar atas ujian dariNya. Maka dia murtad meninggalkan keimanannya. Dan sesungguhnya bila datang pertolongan dari Tuhanmu (wahai Rasul) bagi orang-orang yang beriman kepadaNya, maka orang-orang yang telah murtad meninggalkan keimanan itu berkata, “Sesungguhnya kami bersama kalian (wahai kaum Mukiminin). Kami akan menolong kalian mengatasi musuh-musuh kalian.” Bukankah Allah lebih mengetahui daripada siapapun tentang isi hati seluruh makhlukNya?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Di antara manusia ada yang berkata, “Kami beriman kepada Allah.” Namun tatkala ia mendapatkan gangguan dari orang-orang kafir atas keimanannya, ia menjadikan gangguan mereka itu seperti siksa Allah, lalu ia kembali murtad dari imannya karena menyepakati orang-orang kafir. Jika terjadi pertolongan dari Rabbmu untukmu -wahai Rasul- niscaya ia berkata, “Kami pernah bersama kalian dalam keimanan -wahai orang-orang yang beriman-.” Bukankah Allah mengetahui apa yang ada di dalam hati manusia, tidak ada yang tersembunyi dari-Nya kekufuran dan keimanan yang ada di dalam hati, maka bagaimana mereka memberitakan kepada Allah apa yang ada di dalam hati mereka, sementara Allah lebih mengetahui daripada mereka apa yang ada di dalam hati."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "10. Ini adalah yang terjadi dengan orang-orang yang masuk Islam di Makkah, akan tetapi mereka tidak bersabar dalam menghadapi ujian dan cobaan sehingga mereka kembali kepada kesyirikan akan tetapi mereka menyembunyikan kesyirikan mereka itu dari orang-orang muslim. Mereka adalah orang-orang yang dijerumuskan setan, sehingga mereka memiliki sifat kekafiran dan kemunafikan. Mereka mendapat ujian karena keimanan mereka, akan tetapi mereka tidak bersabar dan menyamakan antara siksaan dari manusia dengan siksaan di akhirat; dengan begitu mereka mengira dapat menjauhkan diri dari ujian. Allah menyingkap hakikat diri mereka yang berada dalam kemunafikan; jika kaum muslimin mendapatkan kemenangan dari Tuhanmu maka mereka akan berkata “Kami termasuk dari kalian”, karena mereka mengira kemunafikan mereka telah tersebar; akan tetapi itu menjadikan kedustaan mereka terbongkar. Allah Maha Melihat apa yang ada dalam hati mereka; bukankah Allah Maha Mengetahui apa yang manusia sembunyikan dalam diri mereka, dan tidak ada yang tersembunyi dari-Nya?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. وَمِنَ النَّاسِ مَن يَقُولُ ءَامَنَّا بِاللهِ فَإِذَآ أُوذِىَ فِى اللهِ (Dan di antara manusia ada orang yang berkata: “Kami beriman kepada Allah”, maka apabila ia disakiti (karena ia beriman) kepada Allah) Sebagaimana yang dilakukan oleh orang-orang kafir terhadap orang-orang beriman, dan yang dilakukan oleh para pelaku maksiat terhadap para pelaku ketaatan; yakni berupa gangguan terhadap mereka disebabkan keimanan mereka kepada Allah dan karena mengamalkan apa yang Allah perintahkan. جَعَلَ فِتْنَةَ النَّاسِ(ia menganggap fitnah manusia itu) Yakni gangguan mereka yang ditimpakan kepadanya. كَعَذَابِ اللهِ(sebagai azab Allah) Yakni ia sangat mengeluh atas gangguan mereka, dan tidak mau bersabar dalam menghadapinya, serta menganggapnya sangat berat dan besar seperti azab dari Allah; sehingga ia mentaati manusia seperti ketaatannya kepada Allah. Terdapat pendapat mengatakan bahwa ia adalah orang munafik yang jika disakiti di jalan Allah ia menjadi murtad dan kembali kafir. Oleh sebab itu seorang mukmin harus bersabar atas gangguan yang ia dapatkan di jalan Allah dan jangan sampai ia mundur dari kebenaran karena hal itu. Namun tidak mengapa ia menuruti orang kafir secara lahiriyah saja untuk bertaqiyah, sedangkan hatinya tetap dalam keimanan. وَلَئِن جَآءَ نَصْرٌ مِّن رَّبِّكَ(Dan sungguh jika datang pertolongan dari Tuhanmu) Yakni kemenangan, pertolongan, dan penakhlukkan dari Allah bagi orang-orang beriman atas musuh mereka, serta harta ghanimah yang mereka dapatkan. لَيَقُولُنَّ إِنَّا كُنَّا مَعَكُمْ ۚ( mereka pasti akan berkata: “Sesungguhnya kami adalah besertamu”) Yakni mereka akan masuk ke dalam agama kalian dan membantu kalian melawan musuh kalian. Namun mereka dibantah oleh Allah dengan firman-Nya: أَوَلَيْسَ اللهُ بِأَعْلَمَ بِمَا فِى صُدُورِ الْعٰلَمِينَ(Bukankah Allah lebih mengetahui apa yang ada dalam dada semua manusia?) Baik itu kebaikan atau keburukan. Maka mengapa mereka mengaku dengan pengakuan yang dusta? Mereka adalah orang-orang yang lemah imannya, jika mereka disakiti oleh orang-orang kafir maka mereka mengikuti orang-orang kafir tersebut; namun jika Islam meraih kemenangan dan Allah memberi pertolongan bagi orang-orang beriman pada suatu peperangan maka mereka berkata “sejak dulu kami telah bersama kalian.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10. Dan di antara manusia, yaitu orang-orang yang munafik itu ada yang berkata dengan lisannya “Kami beriman kepada Allah” sedangkan hatinya takut untuk beriman. Dan apabila dia disakiti oleh orang-orang musyrik di jalan Allah atau karena keimanannya kepada Allah maka dia akan menjadikan fitnah manusia di dunia sebagai azab Allah yang dia dapatkan dalam neraka Jahanam di akhirat. Maksudnya adalah kecemasan terhadap sesuatu yang remeh dirasa seperti kecemasan terhadap azab yang sangat dahsyat. Maka terguncanglah imannya hanya karena cobaan paling rendah dan dia berpura-pura. Dan jika pertolongan Allah kepada orang-orang mukmin itu menjadi nyata, maka orang-orang munafik akan berkata: “Sesungguhnya Kami sama dengan kalian dalam keimanan dan agama, maka perkenankanlah kami menjadi sekutu kalian dalam memiliki harta rampasan.” Kemudian Allah membalas mereka dengan berfirman: “Bukankah Allah Maha Mengetahui tentang apa yang ada dalam hati hamba-hambaNya berupa keikhlasan dan kemunafikan?” Tentu saja. Ayat ini diturunkan untuk orang-orang munafik yang beriman hanya dengan lisan mereka, sehingga saat ujian dan musibah dari Allah menimpa diri mereka, mereka terpikat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "10-11. Setelah Allah menjelaskan bahwasanya Dia pasti akan menguji orang yang mengaku beriman agar tampak orang yang tulus dari orang yang dusta, maka Allah menjelaskan bahwa di antara manusia ada sekelompok manusia yang tidak mempunyai kesabaran dalam menghadapi ujian dan mereka tidak mempunyai keteguhan pendirian dalam menghadapi sebagian goncangan, seraya berfirman, “dan di antara manusia ada yang berkata, ‘Kami beriman kepada Allah,’ maka apabila dia disakiti (karena dia beriman) kepada Allah,” seperti dicambuk, diambil hartanya atau dicerca agar keluar dari agamanya dan agar kembali kepada kebatilan, “dia menganggap fitnah manusia sebagai azab Allah,” maksudnya, dia menjadikannya sebagai penghalang baginya untuk beriman dan tetap berpendirian teguh padanya, sebagaimana siksaan itu menjadi penghalang dari sesuatu yang menjadi sebabnya. “Dan sungguh jika datang pertolongan dari Rabbmu, mereka pasti akan berkata, ‘Sesungguhnyakami besertamu’,” karena sejalan dengan keinginan hawa nafsunya. Kelompok manusia ini termasuk orang-orang yang dikatakan oleh Allah, \"Dan di antara manusia ada orang yang menyembah Allah dengan berada di tepi; maka jika ia memperoleh kebajikan, tetaplah ia dalam keadaan itu, dan jika ia ditimpa oleh suatu bencana, berbaliklah ia ke belakang. Rugilah ia di dunia dan di akhirat. Yang demikian itu adalah kerugian yang nyata.\" (Al-Hajj:11). “Bukankah Allah lebih mengetahui apa yang ada dalam dada manusia,” di mana Dia telah mengabarkan kepada kalian tentang kelompok yang demikian keadaannya ini, sebagaimana telah dijelaskan kepada kalian, sehingga kalian dapat mengetahui betapa sempurnanya pengetahuan Allah dan betapa luas hikmahNya. “Dan sesungguhnya Allah benar-benar mengetahui orang-orang yang beriman; dan sesungguhnya Dia mengetahui orang-orang yang munafik.” Maka dari itu, Dia menetapkan adanya ujian dan cobaan agar ilmuNya tampak pada mereka, kemudian Dia memberikan pembalasan menurut apa yang tampak dari mereka, bukan menurut ilmu yang diketahuiNya sendiri, sebab jika demikian bisa jadi mereka akan beralasan terhadap Allah bahwa kalau saja mereka tahu bahwa mereka diuji tentu mereka akan dapat bertahan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Ankabut ayat 10: Allah mengabarkan bahwa di antara manusia ada manusia yang mengklaim beriman kepada Allah dan membenarkan Rasul-Nya ﷺ; Maka jika mereka diuji oleh Allah, mereka mgolok-olok jalan Allah dengan dengki atau mengurung diri dan selainnya; Mereka tidak sabar atas ujian tersebut, dan Allah jadikan celaan mereka terhadap jalan Allah sebagai adzab bagi mereka, Allah timpakan hukuman kepada mereka, mereka mentaati celaan itu sebagaimana mentaati Allah, dan mereka takut akan ujian tersebut sebagaimana mereka mentaati Allah. Maka jika datang orang yang beriman yang lemah mendapat pertolongan dari Allah dan Allah berikan penaklukan bagi mereka atas orang-orang kafir, mereka sungguh akan berkata kepada manusia yang lain : Sunggu kami semisal dengan kalian dalam iman dan kami sebelumnya telah bersama kalian menolong kalian dan berada dipihak kalian!! Allah mendustakan ucapan mereka dengan berkata : Bukankah Allah saja yang maha tahu atas apa yang ada pada dada manusia ?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala menyebutkan bahwa Dia harus menguji orang yang mengaku beriman agar tampa jelas siapa yang benar imannya dan siapa yang dusta, maka Allah Subhaanahu wa Ta'aala menjelaskan, bahwa di antara manusia ada segolongan orang yang tidak sabar terhadap ujian dan tidak kokoh menghadapi sedikit kegoncangan. Seperti dipukul, diambil hartanya dan dicela, maka ia murtad dari agamanya dan kembali kepada kebatilan. Maksudnya, orang itu takut kepada penganiayaan manusia terhadapnya karena imannya, seperti takutnya kepada azab Allah, sehingga ia tinggalkan imannya itu. Seperti kemenangan sehingga memperoleh ghanimah (harta rampasan perang). Yakni, oleh karena itu sertakanlah kami dalam ghanimah. Karena hal itu sesuai selera hawa nafsunya. Orang seperti ini sama seperti yang disebutkan dalam surah Al Hajj: 11, “Dan di antara manusia ada orang yang menyembah Allah dengan berada di tepi; maka jika ia memperoleh kebajikan, tetaplah ia dalam keadaan itu, dan jika ia ditimpa oleh suatu bencana, berbaliklah ia ke belakang. Rugilah ia di dunia dan di akhirat. Yang demikian itu adalah kerugian yang nyata.” Apakah keimanan atau kemunafikan yang bersemayam dalam dirinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Ankabut Ayat 10",
    "description": "Ayat-ayat yang lalu menyimpulkan bahwa ada orang yang beriman kepada Allah yang diuji dan disakiti oleh kaum musyrikin namun mereka tabah dalam keimanan, dan di antara manusia ada pula sebagian yang berkata dengan lidahnya tanpa menyentuh secara mantap hatinya, 'kami beriman kepada Allah, ' tetapi apabila dia disakiti dengan ditimpa cobaan karena dia beriman kepada Allah, hatinya goyah dan takut kepada siksa yang akan menimpanya dari kaum musyrikin. Dia menganggap cobaan berupa siksaan dan gangguan dari manusia itu sebagai siksaan Allah, dan tidak sabar menghadapinya. Orang itu takut kepada kezaliman manusia, seperti ketakutannya kepada azab Allah, karena itu dia tinggalkan imannya itu. Dan jika datang pertolongan dari tuhanmu berupa kemenangan kepada orang-orang mukmin atas musuh-Musuh mereka, dan mereka mendapatkan harta rampasan, niscaya datang-lah mereka, yaitu orang orang yang berpura-pura beriman itu kepada orang-orang muslim dan akan berkata, 'sesungguhnya kami bersama kamu dalam keimanan, maka berilah kami bagian dari harta rampasan itu. ' tidak sepantasnya mereka menyangka bahwa keadaan mereka ini tidak diketahui Allah. Bukankah Allah lebih mengetahui apa yang ada di dalam dada semua manusia, baik yang berupa keimanan maupun kemunafikan'11. Mustahil Allah tidak mengetahui keadaan makhluk-Nya. Allah pasti mengetahui dengan ilmu-Nya yang azali, tentang orang-orang yang ber-iman dengan sungguh-sungguh dan dia pasti mengetahui orang-orang yang munafik. Dia akan memberikan balasan kepada masing-masing dari mereka sesuai dengan apa yang dikerjakannya."
  }
]