[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Allah benar-benar akan mengetahui (dengan pengetahuan yang tampak jelas bagi para makhluk) orang-orang yang beriman kepadaNya dan mengikuti RasulNya dan melaksanakan syariatNya. Dan Dia akan benar-benar mengetahui orang-orang yang munafik, agar dapat dibeda-bedakan masing-masing golongan dari golongan lainnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Dan sesungguhnya Allah benar-benar mengetahui orang-orang yang beriman dengan sebenar-benarnya dan sesungguhnya Allah benar-benar mengetahui orang-orang munafik yang menampakkan keimanan dan menyembunyikan kekafiran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "11. Dua golongan ini menjadi pengkhususan dari kata (العالمين) ‘Seluruh manusia’ dalam ayat sebelumnya sebagai bentuk pemfokusan kepada keduanya, sebab ilmu tentang apa yang ada dalam hati berhubungan dengan balasan yang sesuai dengan isi hati tersebut. Sungguh Allah akan mengetahui dengan ilmu yang jelas bagi manusia hakikat orang-orang yang beriman dan hakikat orang-orang munafik."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "11. وَلَيَعْلَمَنَّ اللهُ الَّذِينَ ءَامَنُوا۟ وَلَيَعْلَمَنَّ الْمُنٰفِقِينَ (Dan sesungguhnya Allah benar-benar mengetahui orang-orang yang beriman: dan sesungguhnya Dia mengetahui orang-orang yang munafik) Yakni Allah pasti akan memisahkan kedua golongan tersebut dan menyingkap ketulusan iman orang yang tulus dan kemunafikan orang yang munafik. Orang yang tulus dalam imannya adalah orang yang tidak goyah akibat rasa sakit yang menimpanya, serta bersabar di jalan Allah dengan kesabaran yang sesungguhnya. Adapun orang munafik adalah orang yang selalu berbelok dari satu golongan ke golongan yang lain; jika disakiti oleh orang-orang kafir maka ia mengikuti mereka dan kembali kafir terhadap Allah, namun jika kekuatan Islam telah kembali, dan kemenangan diraih lagi oleh Islam, maka ia akan mengaku bahwa ia bagian dari kaum muslimin."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Dan sungguh Allah akan menampakkan keduanya dari golongan orang mukmin dan orang munafik dan membedakan antara dua golongan ini. Orang mukmin yang ikhlas itu sabar atas ketaatan dan fitnah, sedangkan orang munafik itu mudah tergoncang dari tempatnya. Jika dia difitnah oleh orang-orang kafir, maka dia mengikuti mereka dan mengingkari Allah SWT. Dan jika orang-orang muslim diberi beri kemenangan, dia mengumumkan keislamannya dan mengklaim bahwa dirinya muslim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "10-11. Setelah Allah menjelaskan bahwasanya Dia pasti akan menguji orang yang mengaku beriman agar tampak orang yang tulus dari orang yang dusta, maka Allah menjelaskan bahwa di antara manusia ada sekelompok manusia yang tidak mempunyai kesabaran dalam menghadapi ujian dan mereka tidak mempunyai keteguhan pendirian dalam menghadapi sebagian goncangan, seraya berfirman, “dan di antara manusia ada yang berkata, ‘Kami beriman kepada Allah,’ maka apabila dia disakiti (karena dia beriman) kepada Allah,” seperti dicambuk, diambil hartanya atau dicerca agar keluar dari agamanya dan agar kembali kepada kebatilan, “dia menganggap fitnah manusia sebagai azab Allah,” maksudnya, dia menjadikannya sebagai penghalang baginya untuk beriman dan tetap berpendirian teguh padanya, sebagaimana siksaan itu menjadi penghalang dari sesuatu yang menjadi sebabnya. “Dan sungguh jika datang pertolongan dari Rabbmu, mereka pasti akan berkata, ‘Sesungguhnyakami besertamu’,” karena sejalan dengan keinginan hawa nafsunya. Kelompok manusia ini termasuk orang-orang yang dikatakan oleh Allah, \"Dan di antara manusia ada orang yang menyembah Allah dengan berada di tepi; maka jika ia memperoleh kebajikan, tetaplah ia dalam keadaan itu, dan jika ia ditimpa oleh suatu bencana, berbaliklah ia ke belakang. Rugilah ia di dunia dan di akhirat. Yang demikian itu adalah kerugian yang nyata.\" (Al-Hajj:11). “Bukankah Allah lebih mengetahui apa yang ada dalam dada manusia,” di mana Dia telah mengabarkan kepada kalian tentang kelompok yang demikian keadaannya ini, sebagaimana telah dijelaskan kepada kalian, sehingga kalian dapat mengetahui betapa sempurnanya pengetahuan Allah dan betapa luas hikmahNya. “Dan sesungguhnya Allah benar-benar mengetahui orang-orang yang beriman; dan sesungguhnya Dia mengetahui orang-orang yang munafik.” Maka dari itu, Dia menetapkan adanya ujian dan cobaan agar ilmuNya tampak pada mereka, kemudian Dia memberikan pembalasan menurut apa yang tampak dari mereka, bukan menurut ilmu yang diketahuiNya sendiri, sebab jika demikian bisa jadi mereka akan beralasan terhadap Allah bahwa kalau saja mereka tahu bahwa mereka diuji tentu mereka akan dapat bertahan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Ankabut ayat 11: Allah mengabarkan bahwa Dia akan menguji orang-orang islam, untuk membedakan mana yang beriman kepada Allah dan membenarkan Rasul ﷺ, dengan mana yang munafik yang mereka menampakkan sesuatu yang menyelisihi batin mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Oleh karena itu, Dia akan mengadakan cobaan dan ujian agar pengetahuan-Nya itu jelas di hadapan manusia, lalu Dia membalas sesuai yang tampak itu, tidak hanya berdasarkan pengetahuan-Nya saja, karena bisa saja nanti mereka berhujjah di hadapan Allah, bahwa mereka jika diuji akan sabar."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Ankabut Ayat 11",
    "description": "Mustahil Allah tidak mengetahui keadaan makhluk-Nya. Allah pasti mengetahui dengan ilmu-Nya yang azali, tentang orang-orang yang ber-iman dengan sungguh-sungguh dan dia pasti mengetahui orang-orang yang munafik. Dia akan memberikan balasan kepada masing-masing dari mereka sesuai dengan apa yang dikerjakannya. 12. Di antara cobaan keimanan lainnya adalah ajakan untuk melakukan dosa sambil menyatakan bahwa dosanya akan ditanggung oleh yang mengajak. Orang-orang yang kafir berkata kepada orang-orang yang beriman dengan ikhlas, 'ikutilah jalan kami dan tetaplah kamu dalam agama kami, yaitu agama leluhur kami, dan apabila kebangkitan dan perhitungan yang kalian takuti itu terjadi, maka kami yang akan memikul dosa-dosamu semua, apa pun dosa itu. ' padahal seseorang tidak akan memikul dosa orang lain dan mereka sedikit pun tidak sanggup memikul dosa-dosa mereka sendiri. Sesungguhnya mereka benar-benar pendusta yang bukan hanya kali ini saja mereka berdusta, tetapi telah berkali-kali, sehingga kebohongan telah mendarah daging dalam kepribadian mereka."
  }
]