[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang yang mengingkari keesaan Allah dari suku Quraisy, dan tidak mengimani ancaman Allah dan janjiNya, mereka berkata kepada orang-orang yang beriman kepada Allah dan mengamalkan sariatNya dari suku mereka, “Tinggalkanlah agama Muhammad, dan ikutilah agama kami. Sesungguhnya kami nanti akan memikul dosa-dosa dan kesalahan-kesalahan kalian.” Padahal mereka itu tidak memikul sedikitpun dari dosa-dosa mereka. Sesungguhnya mereka itu benar-benar berdusta dalam ucapan yang mereka katakan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Dan orang-orang yang kafir berkata kepada orang-orang yang beriman kepada Allah semata, “Ikutilah agama kami dan apa yang menjadi kepercayaan kami, kami akan menanggung dosa-dosa kalian dan memberi balasan kepada kalian.” Padahal tidaklah mereka mampu menanggung dosa-dosa mereka sedikitpun. Sesungguhnya mereka itu dusta dalam ucapan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "12. Orang-orang musyrik terus berusaha untuk membuat orang-orang Islam yang tidak dapat mereka beri cobaan, agar mereka meninggalkan Islam. Mereka berusaha melakukan penjerumusan namun itu menampakkan kebodohan dan keangkuhan mereka. Sebagaian mereka mengaku, jika mereka dibangkitkan pada hari kiamat, maka mereka akan menjadi para pemimpin yang bertanggungjawab; yakni kami memiliki kemampuan untuk menanggung dosa orang lain, sehingga kami akan menanggung dosa-dosa kalian jika kalian mengikuti jalan kami. Allah mengungkapkan ucapan mereka dengan huruf Lam untuk perintah (ولنحمل) yang berfungsi menggambarkan ajakan mereka, karena dengan ungkapan perintah kepada diri mereka sendiri untuk menanggung dosa-dosa itu lebih tegas dibandingkan dengan sekedar ungkapan kabar dari mereka. Namun perkataan mereka itu bukan suatu kebenaran, mereka tidak akan mampu menanggung sedikitpun dosa, dan mereka sungguh orang-orang yang berdusta."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "12. وَقَالَ الَّذِينَ كَفَرُوا۟ لِلَّذِينَ ءَامَنُوا۟ اتَّبِعُوا۟ سَبِيلَنَا (Dan berkatalah orang-orang kafir kepada orang-orang yang beriman: “Ikutilah jalan kami) Yakni tempuhlah jalan kami dan masuklah ke dalam agama kami. وَلْنَحْمِلْ خَطٰيٰكُمْ (dan nanti kami akan memikul dosa-dosamu”) Yakni jika dengan mengikuti jalan kami merupakan sebuah dosa yang menjadikan kalian disiksa pada hari kebangkitan –sebagaimana yang kalian katakan— maka kami akan menanggung itu bagi kalian sehingga kami saja yang akan disiksa. وَمَا هُم بِحٰمِلِينَ مِنْ خَطٰيٰهُم مِّن شَىْءٍ ۖ (dan mereka (sendiri) sedikitpun tidak (sanggup), memikul dosa-dosa mereka) Yakni mereka tidak akan dapat menanggung dosa yang mereka perbuat dan tidak akan memikul dosa para pengikut mereka, namun setiap orang akan memikul dosanya sendiri-sendiri."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12. Orang-orang kafir berkata kepada orang-orang mukmin: “Ikutilah agama kami, maka kami akan memikul dosa-dosa kalian dan kami akan menyalahkan agama kalian atas hal itu.” Mereka (orang kafir) itu tidaklah memikul apapun dari dosa mereka (orang mukmin). Sesungguhnya mereka itu berbohong dalam janji mereka. Mujahid berkata: “Sesungguhnya ayat ini diturunkan untuk orang-orang kafir Quraisy yang berkata salah seorang yang beriman di antara mereka:”Kita tidak akan dibangkitkan, baik kami maupun kalian. Maka ikutilah kami. Dan jika kalian punya dosa maka itu menjadi beban kami”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "12. Allah mengabarkan tentang perbuatan mengada-ada kaum kafir dan seruan mereka kepada kaum Mukminin agar masuk kepada agama mereka; dan di dalamnya terdapat peringatan terhadap kaum Mukminin untuk tidak terpedaya dengan mereka dan terjerumus di dalam makar mereka, seraya berfirman, “Dan berkatalah orang-orang yang kafir kepada orang-orang yang beriman, ‘Ikutilah jalan kami’,” maka tinggalkanlah agama kalian atau sebagian ajarannya, dan ikutilah agama kami, karena kami memberikan jaminan kepada kalian atas segala perkara itu dan kami akan menanggung “dosa-dosa kalian.” Sesungguhnya masalah ini bukan wewenang mereka, maka dari itu Allah berfirman, “dan mereka sedikit pun tidak memikul dosa-dosa mereka,” tidak (memikul) sedikit dan tidak pula banyak. Pemikulan (penanggungan dosa) ini, sekalipun yang bersangkutan rela dengannya, namun ia sama sekali tidak berguna, karena kebenaran itu milik Allah semata. Allah tidak akan memberikan kemampuan kepada seseorang untuk bertindak dalam haknya kecuali atas dasar perintah dan keputusanNya, sedangkan keputusanNya adalah bahwa tidak satu jiwa pun yang bisa menanggung dosa jiwa yang lain."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Ankabut ayat 12: 12-13. Allah mengabarkan bahwa orang yang kafir terhadap Allah dan mengingkari para utusan-Nya mereka berkata : Siapa yang beriman kepada Allah saja, kemarilah kalian kepada agama Kami, kepada jalan Kami dan Kami akan memikul dosa-dosa kalian. Allah dustakan mereka atas seruan yang mereka seru ini. Allah mengabarkan bahwa mereka tidak akan mungkin memikul dosa-dosa mereka. Allah mengabarkan bahwa orang-orang kafir berdusta atas ucapan-ucapan mereka ini. Allah kemudian menegaskan bahwa mereka orang-orang kafir akan memikul dosa mereka dan dosa orang yang diajak oleh mereka (yang mereka sesatkan), dengan tanpa dikurangi dari dosa orang-orang yang mereka sesatkan yang mereka hanyalah taklid. Mereka orang-orang kafir juga akan ditanya di hari kiamat tentang apa yang mereka katakan dari kedustaan. Sebagaimana Allah firmankan dalam surat An Nahl : 25."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan kedustaan orang kafir dan ajakan mereka kepada kaum mukmin untuk mengikuti agama mereka. Di dalamnya sekaligus peringatan kepada kaum mukmin agar tidak tertipu oleh mereka serta terperangkap makar mereka. Mungkin timbul sangkaan bahwa orang-orang kafir yang mengajak kepada kekafirannya, demikian pula orang yang sama dengan mereka di antara penyeru kebatilan, hanya memikul dosa yang mereka lakukan, maka pada ayat selanjutnya Allah Subhaanahu wa Ta'aala menjelaskan, bahwa mereka akan memikul pula dosa orang-orang yang mengikuti mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Ankabut Ayat 12",
    "description": "Di antara cobaan keimanan lainnya adalah ajakan untuk melakukan dosa sambil menyatakan bahwa dosanya akan ditanggung oleh yang mengajak. Orang-orang yang kafir berkata kepada orang-orang yang beriman dengan ikhlas, 'ikutilah jalan kami dan tetaplah kamu dalam agama kami, yaitu agama leluhur kami, dan apabila kebangkitan dan perhitungan yang kalian takuti itu terjadi, maka kami yang akan memikul dosa-dosamu semua, apa pun dosa itu. ' padahal seseorang tidak akan memikul dosa orang lain dan mereka sedikit pun tidak sanggup memikul dosa-dosa mereka sendiri. Sesungguhnya mereka benar-benar pendusta yang bukan hanya kali ini saja mereka berdusta, tetapi telah berkali-kali, sehingga kebohongan telah mendarah daging dalam kepribadian mereka. 13. Dan mereka benar-benar akan memikul dosa-dosa mereka sendiri yang sangat berat, dan di samping itu mereka pun akan memikul dosa-dosa yang lain, yaitu dosa-dosa orang-orang yang telah mereka sesatkan dan palingkan dari kebenaran, bersama dosa mereka. Dan pada hari kiamat mereka pasti akan ditanya tentang kebohongan yang selalu mereka ada-adakan ketika di dunia dan mereka akan disiksa karena itu semua."
  }
]