[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang musyrik itu benar-benar akan memikul beban kesalahan-kesalahan dan dosa-dosa mereka, serta kesalahan-kesalahan orang-orang yang mereka sesatkan dan mereka halangi dari jalan Alah, di samping dosa-dosa mereka sendiri, tanpa mengurangi sedikit pun dari dosa-dosa para pengikut mereka. Dan pada Hari Kiamat, mereka benar-benar akan ditanya tentang kedustaan-kedustaan yang mereka ada-adakan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "13. Dan sungguh orang-orang musyrik yang mengajak kepada kesesatan, mereka itu benar-benar akan menanggung dosa-dosa mereka yang telah mereka lakukan, dan sungguh mereka akan menanggung dosa-dosa orang yang mengikuti ajakan mereka tanpa sedikitpun mengurangi dosa orang-orang yang mengikuti mereka. Dan sungguh mereka akan dimintai pertanggungjawaban pada hari Kiamat atas kesesatan yang pernah mereka lakukan di dunia."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "13. Jika orang-orang itu berdusta dalam pengakuan mereka itu, namun mereka tetap harus memikul dosa-dosa orang lain, yaitu orang-orang yang mengikuti mereka saat mereka ajak untuk menyekutukan Allah. Orang-orang yang berdusta yang mengira mampu menanggung dosa-dosa segolongan orang beriman itu pasti akan menanggung beban kesusahan pada hari kiamat, yaitu beban dosa-dosa dari orang-orang yang telah mereka sesatkan di samping dosa-dosa dari balasan kesyrikan mereka sendiri. Mereka akan mempertanggungjawabkan semua kedustaan yang mereka buat yang bersumber dari penyesatan pengikut mereka dan usaha mereka menyesatkan kaum muslimin."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "13. وَلَيَحْمِلُنَّ أَثْقَالَهُمْ (Dan sesungguhnya mereka akan memikul beban (dosa) mereka) Yakni dosa-dosa yang telah mereka kerjakan. وَأَثْقَالًا مَّعَ أَثْقَالِهِمْ ۖ( dan beban-beban (dosa yang lain) di samping beban-beban mereka sendiri) Yakni dosa-dosa orang lain bersama dosa-dosa mereka sendiri. Yaitu dosa-dosa orang yang mereka sesatkan dan keluarkan dari hidayah menuju kesesatan. وَلَيُسْـَٔلُنَّ يَوْمَ الْقِيٰمَةِ(dan sesungguhnya mereka akan ditanya pada hari kiamat) Sebagai hinaan dan olokan bagi mereka. عَمَّا كَانُوا۟ يَفْتَرُونَ(tentang apa yang selalu mereka ada-adakan) Yakni dusta-dusta yang mereka buat di dunia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13. Sungguh orang-orang kafir itu akan memikul beban-beban atau dosa-dosa yang mereka perbuat beserta beban dan dosa lainnya yaitu beban orang yang mereka sesatkan. Dan sungguh mereka akan diberi pertanyaan ejekan dan hinaan pada hari kiamat tentang apa yang merea buat-buat berupa kebohongan dan kebathilan yang digunakan untuk menyesatkan selain mereka."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "13. Ketika FirmanNya, “dan mereka sendiri sedikit pun tidak (sanggup) memikul dosa-dosa mereka” kadang bisa dipahami bahwasanya orang-orang kafir yang menyeru kepada kekafirannya –dan orang-orang yang semisal mereka yang menyerukan kepada kebatilannya- tidak (sanggup) memikul dosa kecuali dosa-dosa yang mereka lakukan, tanpa dosa-dosa yang dilakukan oleh orang lain sekalipun mereka adalah penyebabnya, maka Allah berfirman seraya menolak kemungkinan pemahaman keliru itu, “Dan sesungguhnya mereka akan memikul beban mereka,” yaitu dosa-dosa yang mereka perbuat “dan beban-beban di samping beban-beban mereka sendiri,” yaitu dosa-dosa yang disebabkan oleh mereka. Jadi, dosa yang dilakukan oleh sang pengikut, maka masing-masing pengikut dan orang yang diikuti mempunyai bagian darinya. Hal itu karena si pengikut yang bertindak sebagai pelaku dan yang langsung melakukannya, sedangkan orang yang diikuti telah menyebabkan orang lain melakukan dosa dank arena ia menyerukan kepadanya. Demikian pula halnya dengan kebaikan, apabila dilakukan oleh pengikut, maka ia akan mendapatkan pahalanya, karena ia secara langsung telah melakukannya, dan orang yang mengajak orang lain melakukannya pun mendapat pahala juga, karena ia telah menjadi sebab bagi orang lain, “dan sesungguhnya mereka akan ditanya pada Hari Kiamat tentang apa yang selalu mereka ada-adakan,” yaitu berupa kejahatan dan mempropagandakannya, serta ucapan mereka, “Dan nanti kami akan memikul dosa-dosamu.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Ankabut ayat 13: 12-13. Allah mengabarkan bahwa orang yang kafir terhadap Allah dan mengingkari para utusan-Nya mereka berkata : Siapa yang beriman kepada Allah saja, kemarilah kalian kepada agama Kami, kepada jalan Kami dan Kami akan memikul dosa-dosa kalian. Allah dustakan mereka atas seruan yang mereka seru ini. Allah mengabarkan bahwa mereka tidak akan mungkin memikul dosa-dosa mereka. Allah mengabarkan bahwa orang-orang kafir berdusta atas ucapan-ucapan mereka ini. Allah kemudian menegaskan bahwa mereka orang-orang kafir akan memikul dosa mereka dan dosa orang yang diajak oleh mereka (yang mereka sesatkan), dengan tanpa dikurangi dari dosa orang-orang yang mereka sesatkan yang mereka hanyalah taklid. Mereka orang-orang kafir juga akan ditanya di hari kiamat tentang apa yang mereka katakan dari kedustaan. Sebagaimana Allah firmankan dalam surat An Nahl : 25."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Karena ajakan mereka kepada kaum mukmin agar mengikuti jalan mereka dan karena mereka menyesatkan para pengikut mereka. Berupa keburukan, penghiasan mereka terhadap perbuatan buruk dan ucapan mereka, bahwa mereka siap menanggung dosa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Ankabut Ayat 13",
    "description": "Dan mereka benar-benar akan memikul dosa-dosa mereka sendiri yang sangat berat, dan di samping itu mereka pun akan memikul dosa-dosa yang lain, yaitu dosa-dosa orang-orang yang telah mereka sesatkan dan palingkan dari kebenaran, bersama dosa mereka. Dan pada hari kiamat mereka pasti akan ditanya tentang kebohongan yang selalu mereka ada-adakan ketika di dunia dan mereka akan disiksa karena itu semua. 14. Cobaan, ujian dan siksaan dalam keimanan juga dialami oleh para nabi dan umatnya, di antaranya nabi nuh yang sangat lama sekali menghadapi gangguan dari kaumnya. Dan sungguh, kami telah mengutus nabi nuh kepada kaumnya untuk menyeru mereka kepada ajaran tauhid. Maka dia tinggal bersama mereka untuk menyampaikan risalah ketuhanan, terhitung sejak kami mengutusnya menjadi nabi selama seribu tahun kurang lima puluh tahun, yaitu sembilan ratus lima puluh tahun. Selama itu nabi nuh berdakwah dengan berbagai cara, dan selama itu pula mereka durhaka dan tidak memenuhi seruannya. Kemudian mereka yang durhaka itu dilanda banjir besar sebagai bentuk azab untuk mereka, sedangkan mereka adalah orang-orang yang zalim dengan kekufuran mereka."
  }
]