[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sungguh Kami telah mengutus Nuh kepada kaumnya. Maka dia tinggal di tengah mereka selama 950 tahun lamanya. Ia menyeru mereka kepada tauhid dan melarang mereka dari perbuatan syirik. Akan tetapi, mereka tidak menyambut seruannya. Maka Allah mengahancurkan mereka dengan banjir besar, sedang mereka dalam keadaan menganiaya diri mereka sendiri dengan perbuatan kafir dan sikap aniaya mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Dan sungguh Kami telah mengutus Nuh sebagai rasul kepada kaumnya dan tinggal bersama mereka selama sembilan ratus lima puluh tahun mengajak mereka untuk mentauhidkan Allah. Maka mereka mendustakannya dan tetap dalam kekafiran mereka, maka mereka ditimpa banjir bandang dalam keadaan zalim dikarenakan mereka kafir kepada Allah dan mendustakan Rasul-Nya, lalu mereka binasa karena tenggelam."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "14. Dalam ayat ini dibahas tentang rasul yang pertama diutus untuk penduduk bumi dan tentang waktu panjang yang dia habiskan bersama kaumnya -yaitu selama 950 tahun- untuk menunjukkan kesabarannya dalam menghadapi gangguan dari kaumnya. Ayat ini menunjukkan bahwa kaumnya telah mendustakannya dan berada dalam kesesatan dengan menyebutkan kesudahan mereka berupa kebinasaan mereka karena tenggelam dalam banjir bandang akibat kezaliman mereka terhadap diri mereka sendiri. Dan ini adalah isyarat bagi orang-orang yang berpaling dari dakwah Nabi Muhammad tentang kesudahan yang menunggu mereka akibat kedurhakaan yang mereka lakukan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "14. وَلَقَدْ أَرْسَلْنَا نُوحًا إِلَىٰ قَوْمِهِۦ فَلَبِثَ فِيهِمْ أَلْفَ سَنَةٍ إِلَّا خَمْسِينَ عَامًا (Dan sesungguhnya Kami telah mengutus Nuh kepada kaumnya, maka ia tinggal di antara mereka seribu tahun kurang lima puluh tahun) Ayat ini sebagai peneguh hati Rasulullah; seakan-akan dikatakan kepadanya: sesungguhnya Nuh hidup di dunia selama 950 tahun untuk menyeru kaumnya, namun tidak ada yang beriman kepadanya kecuali sedikit saja. Maka kamu lebih patut untuk bersabar karena umurmu lebih pendek darinya dan jumlah umatmu lebih banyak. فَأَخَذَهُمُ الطُّوفَانُ(Maka mereka ditimpa banjir besar) Setelah berlalunya waktu yang telah disebutkan –yaitu 950 tahun—. Makna (الطوفان) adalah air deras yang menimpa mereka dari langit dan keluar dari tanah hingga menenggelamkan mereka semua. وَهُمْ ظٰلِمُونَ(dan mereka adalah orang-orang yang zalim) Yakni mereka terus menerus melakukan kezaliman, dan nasehat dan peringatan yang disampaikan Nabi Nuh kepada mereka tidak membekas di hati mereka padahal telah Nabi Nuh lakukan dalam waktu yang sangat panjang."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14. Sungguh Kami telah mengutus Nuh kepada kaumnya. Dia tinggal bersama mereka selama 950 tahun. Dia menyeru mereka untuk mengesakan Allah, namun mereka mendustakannya. Hal itu untuk mengokohkan nabi SAW dan membuatnya sabar dalam melanjutkan dakwahnya karena sebelumnya Nuh AS telah mendahuluinya bersabar dalam berdakwah selama masa itu. Dia termasuk orang-orang pertama yang bersabar. Dan balasan para pendusta itu yaitu dengan membanjiri mereka dengan hujan lebat yang turun dari langit dan pancaran air dari bumi. Mereka itu menzalimi diri sendiri dengan berbuat kufur"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "14. Allah meberitakan tentang keputusan dan kebijaksanaanNya di dalam menimpakan siksaan terhadap umat-umat yang mendustakan, dan bahwa Allah telah mengutus hamba dan RasulNya, Nuh kepada kaumnya (untuk) mengajak mereka kepada tauhid dan hanya beribadah kepada Allah semata, melarang mereka menyembah tandingan dan berhala, “maka dia tinggal diantara mereka,” sebagai nabi penyeru (selama) “seribu tahun kurang lima puluh tahun.” Dia sama sekali tidak pernah berhenti mengajak mereka dan tidak pernah jemu memberi mereka nasihat, dia menyeru mereka siang dan malam, dengan cara sembunyi-sembunyi dan terang-terangan, namun mereka tidak mendapat petunjuk dan tidak mengikuti petunjuknya, malah mereka terus tenggelam dalam kekafiran dan kesesatan mereka, hingga akhirnya Nuh mendoakan keburukan terhadap mereka beserta kesabaran, kelembutan dan penderitaan yang harus ditanggungnya, seraya berkata, \"Ya Tuhanku, janganlah Engkau biarkan seorang pun di antara orang-orang kafir itu tinggal di atas bumi.\" (Nuh:26). “Maka mereka ditimpa banjir besar,” maksudnya air yang turun dari langit dengan deras, “dan mereka adalah orang-orang yang zhalim,” berhak menerima azab."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Ankabut ayat 14: Allah mengabarkan bawa Dia mengutus Nuh kepada kaumnya, dia mendakwahkan selama 950 tahun, mereka diseru oleh Nuh untuk beriman dan bertauhid. Tidak ada yang menjawab seruan Nuh, mereka adalah orang-orang yang syirik dan kafir, maka Allah binasakan mereka dengan banjir bandang, karena sebab mereka dzalim terhadap diri-diri mereka sendiri dengan kufur dan fasik serta maksiat. Para ahli tafsir berkata : Bahwa dinamakan Nuh karena dia banyak melarang."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan hukum (ketetapan) dan hikmah-Nya dalam mengazab umat-umat yang mendustakan, dan bahwa Dia mengutus hamba dan Rasul-Nya Nuh ‘alaihis salam kepada kaumnya, mengajak mereka kepada tauhid dan beribadah hanya kepada Allah serta melarang mereka berbua syirk. Ibnu Abbas berkata, “Nuh diutus ketika berusia 40 tahun, dan Beliau tinggal (berdakwah) di tengah kaumnya selama seribu tahun kurang lima puluh, dan tinggal setelah banjir besar selama 60 tahun, sehingga banyak jumlah manusia dan bertebaran (di mana-mana).” Sebagai nabi dan rasul; berdakwah kepada mereka. Namun Beliau tidak lemah berdakwah kepada mereka dan tidak putus semangat menasehati mereka, Beliau berdakwah kepada mereka di malam dan siang, secara sembunyi dan terang-terangan, namun mereka tidak mau mengikuti ajakan Beliau, bahkan tetap di atas kekafiran dan sikap melampaui batasnya, sehingga tiba saat di mana Nabi mereka Nuh ‘alaihis salam mendoakan kebinasaan bagi mereka di tengah kesabarannya yang dalam, santunnya dan siap memikul derita dalam berdakwah. Yang menenggelamkan mereka. Yakni berhak mendapat azab."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Ankabut Ayat 14",
    "description": "Cobaan, ujian dan siksaan dalam keimanan juga dialami oleh para nabi dan umatnya, di antaranya nabi nuh yang sangat lama sekali menghadapi gangguan dari kaumnya. Dan sungguh, kami telah mengutus nabi nuh kepada kaumnya untuk menyeru mereka kepada ajaran tauhid. Maka dia tinggal bersama mereka untuk menyampaikan risalah ketuhanan, terhitung sejak kami mengutusnya menjadi nabi selama seribu tahun kurang lima puluh tahun, yaitu sembilan ratus lima puluh tahun. Selama itu nabi nuh berdakwah dengan berbagai cara, dan selama itu pula mereka durhaka dan tidak memenuhi seruannya. Kemudian mereka yang durhaka itu dilanda banjir besar sebagai bentuk azab untuk mereka, sedangkan mereka adalah orang-orang yang zalim dengan kekufuran mereka. 15. Maka untuk mewujudkan janji kami selamatkan nuh dan orang-orang yang berada di kapal itu bersamanya, dan kami jadikan peristiwa itu sebagai pelajaran bagi semua manusia, terutama yang datang kemudian."
  }
]