[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka Kami menyelamatkan Nuh dan orang-orang yang mengikutinya dari orang-orang yang bersamanya di dalam perahu. Dan Kami menjadikan"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Maka Kami selamatkan Nuh dan orang-orang beriman yang bersamanya di dalam bahtera dari kebinasaan dengan tenggelam dan Kami jadikan bahtera itu sebagai pelajaran bagi manusia agar mereka mengambil hikmah darinya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "15. Demikianlah kesudahan orang-orang yang mendustakan. Adapun orang-orang yang selamat adalah Nuh dan orang-orang beriman yang bersamanya. Adapun kapal yang mereka naiki tetap dapat mereka lihat dalam waktu yang lama sebagai tanda terjadinya banjir bandang sebagai azab dari Allah bagi orang-orang yang mendustakan, dan kapal itu juga sebagai bukti bagi orang-orang beriman."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15. فَأَنجَيْنٰهُ وَأَصْحٰبَ السَّفِينَةِ (Maka Kami selamatkan Nuh dan penumpang-penumpang bahtera itu) Yakni Kami selamatkan Nuh dan keluarga serta keluarganya yang berada di atas perahu bersamanya. Namun terdapat perselisihan pendapat tentang jumlah mereka. وَجَعَلْنٰهَآ (dan Kami jadikan peristiwa itu) Yakni Kami jadikan perahu itu. ءَايَةً لِّلْعٰلَمِينَ (pelajaran bagi semua umat manusia) Yakni pelajaran besar bagi mereka. Perahu itu tetap berada di atas bukit Judiy dalam waktu yang lama. Pendapat lain mengatakan maknanya adalah Kami jadikan peristiwa itu, atau keselamatan mereka itu, atau penenggelaman itu, sebagai pelajaran bagi mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "15. Dan Kami selamatkan Nuh dan orang yang ikut bersamanya menaiki perahu, yaitu anak-anak dan para pengikutnya yang mukmin. Jumlah mereka adalah 80 orang atau bahkan lebih sedikit. Dan Kami jadikan perahu itu sebagai pelajaran dan nasehat bagi seluruh orang berilmu yang hidup setelah mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "15. “Maka Kami menyelamatkan Nuh dan penumpang-penumpang bahtera itu,” yaitu mereka yang menumpang bersamanya; keluarga dan orang-orang yang beriman kepadanya “dan Kami jadikan peristiwa itu,” yakni: Bahtera dan kisah Nuh (sebagai) “pelajaran bagi semua umat manusia,” yang dapat mereka jadikan sebagai bahan pelajaran, yaitu bahwa orang yang mendustakan para rasul pasti kesudahannya adalah kebinasaan, dan bahwa orang-orang yang beriman, maka Allah akan memberikan kelegaan dari segala kesedihan dan jalan keluar dari segala kesempitan. Dan Allah juga menjadikan bahtera, yakni, yang sejenisnya sebagai tanda (pelajaran) bagi semua manusia, yang dapat mereka jadikan sebagai pelajaran berharga, sebagai rahmat dari Tuhan mereka yang telah menyediakan segala fasilitasnya dan menjadikan mudah urusannya bagi mereka, dan menjadikannya mampu mengangkut mereka dan mengangkut barang-barang mereka dari satu tempat ke tempat yang lain, dari satu pulau ke pulau yang lain."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Ankabut ayat 15: Allah mengabarkan bahwasanya Dia menyelamatkan Nuh dan yang beriman bersamanya dengan menaiki kapal dari tenggelam dan kebinasaan, dan Allah jadikan kisah Nuh sebagai tanda dan pelajaran bagi seluruh alam yang mengambil pelajaran dari kisah tersebut."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni, bahwa barang siapa mendurhakai utusan-Nya, maka mereka akan mendapatkan kebinasaan, dan bahwa orang-orang mukmin akan Allah bukakan jalan keluar bagi mereka dari setiap kecemasan dan membukakan jalan keluar dari setiap kesempitan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Ankabut Ayat 15",
    "description": "Maka untuk mewujudkan janji kami selamatkan nuh dan orang-orang yang berada di kapal itu bersamanya, dan kami jadikan peristiwa itu sebagai pelajaran bagi semua manusia, terutama yang datang kemudian. 16. Selain nabi nuh, rasul pertama, nabi ibrahim juga mengalami hal yang sama. Dan ingatlah wahai rasul, kisah nabi ibrahim, ketika dia berkata kepada kaumnya, 'sembahlah dan patuhilah Allah dalam segala hal yang diperintahkan-Nya dengan penuh keikhlasan dan bertakwalah kepada-Nya dengan menghindari segala sesuatu yang dapat mendatangkannya siksa-Nya. Yang demikian itu, yakni kepatuhan dan ketakwaan, lebih baik bagimu daripada kekufuran, jika kamu mengetahui apa yang baik dan buruk bagimu."
  }
]