[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ingatlah (wahai rasul) tentang Ibrahim ketika ia menyeru kaumnya, “Ikhlaskanlah ibadah karena Allah semata. Dan takutlah terhadap kemurkaanNya, dengan cara menjalankan kewajiban-kewajiban dariNya dan menjauhi maksiat-maksiat kepadaNya. Itu lebih baik bagi kalian, jika kalian mengetahui apa yang baik bagi kalian dari apa yang buruk bagi kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Dan ingatlah -wahai Rasul- kisah Ibrahim saat dia berkata kepada kaumnya, “Sembahlah Allah semata dan takutlah kepada siksa-Nya dengan cara menjalankan segala perintah-Nya dan menjauhi segala larangan-Nya, hal yang diperintahkan kepada kalian itu lebih baik bagi kalian jika kalian adalah orang-orang yang mengetahui."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "16. Kami juga mengutus Ibrahim, dia terus berusaha menyampaikan hidayah kepada kaumnya dengan berkata: “Beribadahlah hanya kepada Allah semata, dan berhati-hatilah dari siksaan-Nya. Jalan yang aku tunjukkan ini lebih baik bagi kalian daripada penderitaan yang kalian hadapi, jika kalian dapat membedakan apa dapat bermanfaat bagi kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "16. وَإِبْرٰهِيمَ إِذْ قَالَ لِقَوْمِهِ اعْبُدُوا۟ اللهَ وَاتَّقُوهُ ۖ (Dan (ingatlah) Ibrahim, ketika ia berkata kepada kaumnya: “Sembahlah olehmu Allah dan bertakwalah kepada-Nya) Yakni esakanlah Allah dalam ibadah, dan janganlah kalian menyekutukan-Nya dengan sesuatu apapun. ذٰلِكُمْ خَيْرٌ لَّكُمْ(Yang demikian itu adalah lebih baik bagimu) Yakni menyembah Allah dan bertakwa kepada-Nya lebih baik bagi kalian daripada menyekutukan-Nya. Kesyirikan tidak ada kebaikannya sedikitpun, namun Ibrahim mengatakan ini kepada mereka berdasarkan keyakinan mereka. إِن كُنتُمْ تَعْلَمُونَ(jika kamu mengetahui) Yakni jika kalian memiliki sedikit ilmu, atau jika kalian memiliki ilmu yang menjadikan kalian dapat membedakan antara yang baik dan yang buruk."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16. Wahai Nabi, ingatlah juga saat Ibrahim AS berkata kepada kaumnya: “Menyembahlah hanya kepada Allah. Tidak ada sekutu bagiNya dan takutlah kepada Allah dengan mengerjakan perintah-perintahNya dan menjauhi kesyirikan. Ibadah dan takwa itu lebih baik dan lebih benar bagi kalian daripada kesyirikan (dimana tidak ada kebaikan dalam kesyirikan dan itu adalah ucapan mereka sesuai keyakinan mereka) jika kalian memang mengetahui kebaikan dan bisa membedakan antara kebaikan dan keburukan”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "16. Allah menyebutkan bahwasanya Dia mengutus KhalilNya, Ibrahim kepada kaumnya untuk mengajak mereka kepada Allah, seraya berkata kepada mereka, “Kalian sembahlah Allah,” maksudnya, Esakanlah Dia, tuluslah beribadah kepadaNya dan patuhilah apa yang diperintahkan kepada kalian, “dan bertakwalah kepadaNYa,” agar Dia tidak memurkai kalian, (karena jika demikian), maka Dia akan menyiksa kalian. Hal itu dengan cara meninggalkan segala apa saja dari kemaksiatan yang dapat membuatNya murka. “Yang demikian itu,” yakni, beribadah kepada Allah dan bertakwa kepadaNya “lebih baik bagimu,” daripada mengabaikannya. Ungkapan ini termasuk dalam penggunaan kata tafdhil (yang bermakna lebih atau paling) dengan menyebutkan sesuatu yang tidak ada keutamannya pada bagian yang lain. Karena meninggalkan ibadah kepada Allah dan mengabaikan takwa kepadaNya sama sekali tidak ada baiknya dari semua sisinya. Sesungguhnya beribadah kepada Allah dan bertakwa kepadaNya adalah lebih baik bagi manusia, karena tidak ada jalan lain untuk memperoleh karamah (rahmat) Nya di dunia ini dan di akhirat nanti kecuali hanya dengannya. Semua kebaikan yang ada di dunia dan akhirat adalah merupakan pengaruh ibadah dan takwa kepada Allah, “jika kamu mengetahui” hal itu. Maka ketahuilah semua perkara dan perhatikanlah mana yang lebih pantas didahulukan (diutamakan)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Ankabut ayat 16: Ingatlah wahai Nabi Allah satu hari di mana Ibrahim berkata kepada kaumnya : Ikhlaslah dalam beribadah kepada Allah saja, taatilah Allah dalam perbuatan, perintah-perintah-Nya dan jauhilah maksiat. Ketahuilah bahwa ibadah kepada Allah dan takwa adalah lebih baik bagi kalian dari setiap kenikmatan dunia dan juga perhiasannya, jika kalian mengetahui dan dapat membedakan antara kebaikan dan keburukan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala menyebutkan, bahwa Dia mengutus kekasih-Nya Ibrahim ‘alaihis salam kepada kaumnya untuk mengajak mereka beribadah kepada Allah Subhaanahu wa Ta'aala saja, dan inilah dakwah para nabi, yakni mengajak kepada tauhid dan menjauhi syirk. Yakni sembahlah Allah saja, ikhlaskanlah dalam beribadah kepada-Nya dan laksanakanlah perintah-Nya. Bisa juga maksudnya, takutlah kamu jika Dia sampai murka kepadamu sehingga Dia mengazab kamu, dan hal itu dilakukan dengan cara meninggalkan segala sesuatu yang membuat-Nya murka, yaitu kemaksiatan. Yakni beribadah kepada Allah dan bertakwa kepada-Nya. Akibat dari kedua perbuatan itu; tauhid dan syirk. Bertauhid akan membawa ke surga, sedangkan berbuat syirk akan membawa ke neraka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Ankabut Ayat 16",
    "description": "Selain nabi nuh, rasul pertama, nabi ibrahim juga mengalami hal yang sama. Dan ingatlah wahai rasul, kisah nabi ibrahim, ketika dia berkata kepada kaumnya, 'sembahlah dan patuhilah Allah dalam segala hal yang diperintahkan-Nya dengan penuh keikhlasan dan bertakwalah kepada-Nya dengan menghindari segala sesuatu yang dapat mendatangkannya siksa-Nya. Yang demikian itu, yakni kepatuhan dan ketakwaan, lebih baik bagimu daripada kekufuran, jika kamu mengetahui apa yang baik dan buruk bagimu. 17. Selanjutnya nabi ibrahim mengecam kaumnya dengan menyatakan, sesungguhnya yang kamu sembah selain Allah hanyalah berhala-berhala dan patung-patung yang kalian buat dengan tangan kalian sen-diri, dan kemudian kamu membuat-buat kebohongan dengan menyebutnya sebagai tuhan. Kamu menyembah berhala-berhala itu dengan harapan dapat memberi manfaat dan perlindungan serta menganugerahkan rezeki kepadamu, padahal sesungguhnya apa dan siapa pun yang kamu sembah selain Allah itu tidak mampu memberikan perlindungan dan rezeki kepadamu walau sedikit; karena itu maka minta dan berusaha-lah dengan sungguh-sungguh guna memperoleh rezeki dari Allah, dan di samping itu sembahlah dia dengan penuh ketulusan dan bersyukurlah kepada-Nya atas rezeki yang telah dianugerahkan-Nya kepadamu. Ha-Nya kepada-Nya semata kamu akan dikembalikan setelah kematian untuk dimintakan pertanggungjawaban."
  }
]