[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apa yang kalian sembah (wahai kaum) selain Allah kecuali berhala-berhala saja, dan kalian membuat-buat kedustaan dengan menamakannya sebagai tuhan-tuhan sembahan. Sesungguhnya berhala-hala kalian yang kalian sembah selain Allah itu tidak mampu memberikan rizki apa pun kepada kalian. Maka carilah rizki dari sisi Allah, bukan dari berhala-berhala kalian. Dan ikhlaskanlah ibadah hanya kepadaNya, begitu juga rasa syukur atas rizkiNya bagi kalian. Kepada Allah kalian akan dikembalikan setelah kematian kalian. Kemudian Dia akan memberikan balasan kepada kalian sesuai dengan apa yang kalian perbuat.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Sesungguhnya kalian -wahai orang-orang musyrik- hanyalah menyembah berhala-berhala yang tidak mampu memberi manfaat dan tidak pula menghindarkan dari mudarat, dan kalian telah mengada-adakan kedustaan tatkala kalian menganggap bahwa ia berhak untuk disembah. Sesungguhnya yang kalian sembah selain Allah itu tidak mampu memberikan rezeki kepada kalian, maka mintalah rezeki kepada Allah Yang Maha Pemberi rezeki dan sembahlah Dia semata serta bersyukurlah kepada-Nya atas rezeki yang telah dikaruniakan kepada kalian. Hanya kepada-Nya lah kalian dikembalikan pada hari Kiamat untuk mendapatkan perhitungan dan pembalasan, bukan kepada berhala-berhala kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "17. Hai kaumku, kalian enggan menyembah Allah, tetap menyembah batu yang kalian pahat dengan tangan kalian sendiri dalam berbagai bentuk namun tidak dapat hidup, dan membuat kisah-kisah dusta. Berhala-berhala yang kalian sembah selain Allah tidak memberi kalian rezeki apapun, dan seharusnya kalian meminta rezeki dari Allah yang menjadi sumber kehidupan kalian, dan menyembah Allah semata dan mensyukuri segala kenikmatan dari-Nya. kepada Allah tempat kembali, untuk membalas hamba-hamba-Nya sesuai dengan amal perbuatan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "17. إِنَّمَا تَعْبُدُونَ مِن دُونِ اللهِ أَوْثٰنًا (Sesungguhnya apa yang kamu sembah selain Allah itu adalah berhala) Ibrahim menerangkan kepada mereka bahwa mereka menyembah sesuatu yang tidak dapat memberi manfaat atau mudharat, tidak dapat mendengar dan melihat. Makna (الأوثان) sama dengan (الأصنام). Namun pendapat lain mengatakan bahwa (الأصنام) adalah patung yang terbuat dari emas, perak, atau logam. Sedangkan (الأوثان) adalah patung yang terbuat dari tanah liat atau batu. وَتَخْلُقُونَ إِفْكًا ۚ( dan kamu membuat dusta) Yakni kalian hanya menyembah patung-patung yang kalian buat sendiri, kalian berdusta dengan mengatakan bahwa patung-patung itu adalah tuhan-tuhan yang disembah. إِنَّ الَّذِينَ تَعْبُدُونَ مِن دُونِ اللهِ لَا يَمْلِكُونَ لَكُمْ رِزْقًا(esungguhnya yang kamu sembah selain Allah itu tidak mampu memberikan rezeki kepadamu) Yakni mereka tidak akan mampu memberi kalian rezeki sedikitpun. فَابْتَغُوا۟ عِندَ اللهِ الرِّزْقَ(maka mintalah rezeki itu di sisi Allah) Yakni berharaplah rezeki dari Allah, sebab di sisi-Nya segala rezeki, dan mintalah dari-Nya karunia-Nya, serta sembahlah Dia semata tanpa menyekutukan-Nya dengan yang lain."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17. Wahai kaumku, sesungguhnya apa yang kalian sembah selain Allah berupa berhala-berhala itu tidak memberi mahdharat dan manfaat. (Al-Watsanu adalah sesuatu yang dibuat dari material keras atau batu. Ash-Shanamu adalah sesuatu yang dibuat dari logam seperti tembaga atau sejenisnya. Dan At-Timtsal adalah suatu ilustrasi dari makhluk hidup) Kalian menciptakan berhala yang kalian sebut sebagai tuhan itu adalah suatu kebohongan dan kepalsuan. Sesungguhnya berhala-berhala yang kalian sembah selain Allah itu tidak mampu memberi sedikitpun rejeki untuk kalian, maka carilah rejeki di sisi Allah. Hanya Dialah Dzat yang Maha Pemberi Rejeki. Dialah sang Pemilik rejeki. Menyembahlah hanya kepadaNya dengan ikhlas dan bersyukurlah kepadanya atas nikmat yang telah dilimpahkan kepada kalian. Hanya kepadaNyala kalian dikembalikan pada hari kiamat untuk dibalas dan dihisab."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17-18. Setelah Allah memerintah mereka beribadah dan bertakwa kepadaNya, lalu Dia melarang mereka beribadah kepada berhala, dan menjelaskan kerapuhannya dan ketidakberhakannya untuk diibadahi, seraya berfirman, “Sesungguhnya apa yang kamu sembah selain Allah itu adalah berhala, dan kamu membuat dusta,” kalian yang memahatnya dan kalian yang membuatnya dengan tangan kalian, dan kalian pula yang membuat nama-nama sembahan untuk berhala itu, dan kalian mengada-adakan kedustaan dengan memerintahkan untuk menyembahnya dan berpegang teguh kepada yang demikian, “Sesungguhnya yang “ kamu sembah “selain Allah itu,” di dalam kerapuhannya, dan bahwa sesungguhnya ia tidak mempunyai sesuatu yang dapat menjadikannya untuk disembah, “ia tidak mampu memberikan rizki kepadamu,” seakan-akan di sini dikatakan, “Sudah jelas sekali bagi kami bahwa berhala-berhala ini adalah makhluk (ciptaan) yang lemah, tidak mampu memberikan manfaat atau menimpakan bahaya, tidak pula mematikan, menghidupkan atau membangkitkan kembali. Dan sesungguhnya siapa saja yang demikian keadaannya maka ia sama sekali, sedikit pun tidak memiliki hak untuk disembah dan dipertuhankan. Sedangkan hati pasti selalu mencari sembahan yang dipertuhankannya dan kepadaNya ia meminta segala hajatnya. Kemudian Allah berfirman seraya menghimbau mereka beribadah hanya kepada yang berhak disembah, “Maka mintalah rizki itu di sisi Allah,” karena Dia-lah yang mempermudah rizki lagi menentukan, yang mengabulkan permohonan orang yang berdoa kepadaNya untuk kebaikan agama dan dunianya, “dan sembahlah Dia,” semata, tidak ada sekutu bagiNya, karena hanya Dia Yang Mahasempurna, Maha Pemberi manfaat, Maha menimpakan bahaya, Yang Esa dalam mengatur, “dan bersyukurlah kepadaNya” semata, karena seluruh apa saja berupa nikmat yang sampai kepada manusia adalah dariNya; dan seluruh apa saja yang tertolak dari mereka berupa bencana, maka Dia-lah yang menolaknya. “Hanya kepadaNya kamu akan dikembalikan,” lalu Dia akan membalas kalian atas amal yang telah kalian kerjakan, dan Dia akan menerangkan kepada kalian apa saja yang telah kalian rahasiakan dan apa yang kalian tampakkan. Maka waspadalah saat datang kepadaNya sedangkan kalian dalam keadaan musyrik, dan sukailah apa saja yang dapat membuat kalian dekat kepadaNya dan membuat Dia memberikan pahala di saat kedatangan kalian kepadaNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Ankabut ayat 17: Allah mengabarkan bahwasanya Ibrahim berkata kepada kaumnya : Sungguh sesembahan ini yang kalian sembah selain Allah adalah ciptaan tangan-tangan kalian sendiri, lalu bagaimana dapat kalian sembah ?! Dan kalian mengetahui bahwasanya sesembahan ini tidak dapat member rezeki kepada kalian, tidak juga member manfaat dan mudharat kepada kalian, maka oleh karena itu wajib bagi kalian untuk meminta rezeki kepada Allah Ar Razzaq yang di tangan-Nya lah perbendaharaan rezeki di langit dan di bumi, dan juga wajib bagi kalian untuk mengikhlaskan ibadah dengan tauhid, dan agar hanya bersyukur kepada Allah serta memuji-Nya karena sesungguhnya kalian akan kembali kepada-Nya di hari kiamat; Kalian akan dibalas berdasarkan amalan-amalan kalian dan dihisab atas amalan-amalan kalian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Ibrahim memerintahkan mereka untuk beribadah kepada Allah dan bertakwa kepada-Nya serta melarang mereka menyembah berhala, maka Beliau menerangkan kekurangan pada berhala itu dan ketidakberhakannya untuk disembah. Maksudnya, pernyataan mereka bahwa berhala-berhala itu dapat memberi syafaat kepada mereka di sisi Allah atau sebagai sekutu-sekutu-Nya. Ini adalah dusta. Seakan-akan dikatakan, “Telah jelas bagi kita bahwa berhala-berhala itu dicipta dan memiliki kekurangan, tidak mampu memberikan manfaat dan tidak mampu menimpakan bahaya, tidak mampu mematikan dan tidak mampu menghidupkan serta membangkitkan, jika sifatnya seperti ini, maka berarti ia sangat tidak berhak untuk diibadahi dan disembah, sedangkan hati butuh menyembah dan meminta kebutuhan, maka pada lanjutan ayatnya, Ibrahim mendorong mereka untuk mengarahkannya kepada yang berhak disembah, yaitu Allah Subhaanahu wa Ta'aala dan meminta dipenuhi kebutuhan kepada-Nya. Yakni karena Dia yang memudahkannya, menakdirkannya, mengabulkan doa orang yang berdoa kepada-Nya dalam masalah agama dan dunianya. Karena Dia Mahasempurna, Yang mampu memberikan manfaat dan menimpakan madharrat, lagi yang mengatur alam semesta sendiri. Karena semua yang sampai kepada makhluk berupa kenikmatan adalah berasal dari-Nya, dan semua musibah yang hendak menimpa, maka Dia yang menolaknya. Dia akan membalas amalmu, memberitakan apa yang kamu sembunyikan dan apa yang kamu tampakkan. Oleh karena itu, berhati-hatilah kamu ketika menghadap-Nya sedangkan kamu di atas perbuatan syirk, dan carilah hal yang mendekatkan dirimu kepada-Nya dan yang menjadikan kamu memperoleh pahala-Nya ketika menghadap-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Ankabut Ayat 17",
    "description": "Selanjutnya nabi ibrahim mengecam kaumnya dengan menyatakan, sesungguhnya yang kamu sembah selain Allah hanyalah berhala-berhala dan patung-patung yang kalian buat dengan tangan kalian sen-diri, dan kemudian kamu membuat-buat kebohongan dengan menyebutnya sebagai tuhan. Kamu menyembah berhala-berhala itu dengan harapan dapat memberi manfaat dan perlindungan serta menganugerahkan rezeki kepadamu, padahal sesungguhnya apa dan siapa pun yang kamu sembah selain Allah itu tidak mampu memberikan perlindungan dan rezeki kepadamu walau sedikit; karena itu maka minta dan berusaha-lah dengan sungguh-sungguh guna memperoleh rezeki dari Allah, dan di samping itu sembahlah dia dengan penuh ketulusan dan bersyukurlah kepada-Nya atas rezeki yang telah dianugerahkan-Nya kepadamu. Ha-Nya kepada-Nya semata kamu akan dikembalikan setelah kematian untuk dimintakan pertanggungjawaban. 18. Dan jika kamu orang-orang kafir terus-menerus mendustakan ajaran Allah yang disampaikan oleh rasul Muhammad, maka ketahuilah, sungguh, umat sebelum kamu juga telah mendustakan para rasul. Tetapi mereka tidak dapat memberi mudarat kepada rasul-rasul itu, bahkan sebenarnya mereka membuat kemudaratan kepada diri mereka sendiri, yaitu ketika mereka dihancurkan oleh Allah karena pendustaan mereka itu. Dan kewajiban rasul itu hanyalah menyampaikan agama Allah kepada kaumnya dengan uraian serta praktek dan contoh pengamalan tuntunan Allah yang jelas dan dengan cara seterang-terangnya. '."
  }
]