[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Jika kalian (wahai manusia) mendustakan Rasul Kami, Muhammad, dalam risalah yang kalian diajak untuk mengikutinya, yaitu beribadah kepada Allah saja, maka sesungguhnya umat-umat sebelum kalian telah mendustakan para rasul mereka terkait risalah yang diserukan kepada mereka yang berupa kebenaran. Akibatnya, kemurkaan Allah menimpa mereka. Dan Rasulullah Muhammad tidaklah berkewajiban kecuali hanya menyampaikan kepada kalian risalah dari Allah dengan penjelasan yang sejelas-jelasnya, dan sungguh ia telah melakukannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Jika kalian -wahai orang-orang musyrik- mendustakan apa yang dibawa oleh Muhammad -ṣallallāhu 'alaihi wa sallam-, maka sesungguhnya umat-umat sebelum kalian telah mendustakan, seperti kaum Nuh, 'Ād dan Ṡamūd. Kewajiban Rasul hanyalah menyampaikan dengan sejelas-jelasnya, dan dia telah menyampaikan kepada kalian apa yang diperintahkan oleh Rabbnya untuk disampaikan kepada kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "18. Firman Allah ini ditujukan kepada orang-orang musyrik Quraisy dan orang-orang yang mendustakan lainnya, yang Allah sampaikan di antara perkataan Ibrahim dengan kaumnya. Jika kalian mendustakan dan berpaling dari dakwah Nabi Muhammad agar kalian menyembah Allah semata, maka telah ada contoh bagi kalian dari umat-umat terdahulu, mereka mendapat kemurkaan dari Allah akibat dosa-dosa yang mereka lakukan. Dan Kami tidak membebani rasul Kami melainkan hanya untuk menyampaikan risalah dengan jelas."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "18. وَإِن تُكَذِّبُوا۟ فَقَدْ كَذَّبَ أُمَمٌ مِّن قَبْلِكُمْ ۖ (Dan jika kamu (orang kafir) mendustakan, maka umat yang sebelum kamu juga telah mendustakan) Yakni jika kalian mendustakan Muhammad, maka itu sudah menjadi kebiasaan orang-orang kafir dalam menyikapi nabi-nabi sebelumnya. وَمَا عَلَى الرَّسُولِ إِلَّا الْبَلٰغُ الْمُبِينُ(Dan kewajiban rasul itu, tidak lain hanyalah menyampaikan (agama Allah) dengan seterang-terangnya”) Yakni menyampaikan kepada kaumnya, dan dia tidak memiliki kewajiban untuk menjadikan kaumnya menerima hidayah dan dia tidak memang tidak akan mampu melakukan itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "18. Dan jika kalian mendustakan risalahku, maka sungguh banyak umat sebelumku dan sebelum kalian yang telah mendustakan rasul-rasul mereka. Dan kewajiban rasul itu tidak lain kecuali menyampaikan dengan jelas dakwahnya kepada kaumnya dan tidak ada kapasitas baginya untuk memberi hidayah kepada mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17-18. Setelah Allah memerintah mereka beribadah dan bertakwa kepadaNya, lalu Dia melarang mereka beribadah kepada berhala, dan menjelaskan kerapuhannya dan ketidakberhakannya untuk diibadahi, seraya berfirman, “Sesungguhnya apa yang kamu sembah selain Allah itu adalah berhala, dan kamu membuat dusta,” kalian yang memahatnya dan kalian yang membuatnya dengan tangan kalian, dan kalian pula yang membuat nama-nama sembahan untuk berhala itu, dan kalian mengada-adakan kedustaan dengan memerintahkan untuk menyembahnya dan berpegang teguh kepada yang demikian, “Sesungguhnya yang “ kamu sembah “selain Allah itu,” di dalam kerapuhannya, dan bahwa sesungguhnya ia tidak mempunyai sesuatu yang dapat menjadikannya untuk disembah, “ia tidak mampu memberikan rizki kepadamu,” seakan-akan di sini dikatakan, “Sudah jelas sekali bagi kami bahwa berhala-berhala ini adalah makhluk (ciptaan) yang lemah, tidak mampu memberikan manfaat atau menimpakan bahaya, tidak pula mematikan, menghidupkan atau membangkitkan kembali. Dan sesungguhnya siapa saja yang demikian keadaannya maka ia sama sekali, sedikit pun tidak memiliki hak untuk disembah dan dipertuhankan. Sedangkan hati pasti selalu mencari sembahan yang dipertuhankannya dan kepadaNya ia meminta segala hajatnya. Kemudian Allah berfirman seraya menghimbau mereka beribadah hanya kepada yang berhak disembah, “Maka mintalah rizki itu di sisi Allah,” karena Dia-lah yang mempermudah rizki lagi menentukan, yang mengabulkan permohonan orang yang berdoa kepadaNya untuk kebaikan agama dan dunianya, “dan sembahlah Dia,” semata, tidak ada sekutu bagiNya, karena hanya Dia Yang Mahasempurna, Maha Pemberi manfaat, Maha menimpakan bahaya, Yang Esa dalam mengatur, “dan bersyukurlah kepadaNya” semata, karena seluruh apa saja berupa nikmat yang sampai kepada manusia adalah dariNya; dan seluruh apa saja yang tertolak dari mereka berupa bencana, maka Dia-lah yang menolaknya. “Hanya kepadaNya kamu akan dikembalikan,” lalu Dia akan membalas kalian atas amal yang telah kalian kerjakan, dan Dia akan menerangkan kepada kalian apa saja yang telah kalian rahasiakan dan apa yang kalian tampakkan. Maka waspadalah saat datang kepadaNya sedangkan kalian dalam keadaan musyrik, dan sukailah apa saja yang dapat membuat kalian dekat kepadaNya dan membuat Dia memberikan pahala di saat kedatangan kalian kepadaNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Ankabut ayat 18: Sungguh kalian wahai penduduk Mekkah mendustakan ayat-ayat Allah, dan kalian mengingkari Rasulullah ﷺ; Sungguh telah berlalu kaum yang mendustakan para rasul mereka, maka balasan bagi mereka adalah kebinasaan dan kerugian yang nyata, dan tidaklah bagi rasul-rasul Kami kecuali hanyalah menyampaikan dengan penjelasan yang jelas, sehingga tegaklah hujjah bagi kalian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kedua kisah di atas, merupakan hiburan bagi Nabi Muhammad shallallahu 'alaihi wa sallam, dan pada ayat selanjutnya Allah Subhaanahu wa Ta'aala berfirman tentang kaumnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Ankabut Ayat 18",
    "description": "Dan jika kamu orang-orang kafir terus-menerus mendustakan ajaran Allah yang disampaikan oleh rasul Muhammad, maka ketahuilah, sungguh, umat sebelum kamu juga telah mendustakan para rasul. Tetapi mereka tidak dapat memberi mudarat kepada rasul-rasul itu, bahkan sebenarnya mereka membuat kemudaratan kepada diri mereka sendiri, yaitu ketika mereka dihancurkan oleh Allah karena pendustaan mereka itu. Dan kewajiban rasul itu hanyalah menyampaikan agama Allah kepada kaumnya dengan uraian serta praktek dan contoh pengamalan tuntunan Allah yang jelas dan dengan cara seterang-terangnya. '19. Dan apakah mereka lengah sehingga tidak memperhatikan bagaimana Allah senantiasa memulai penciptaan semua makhluk, termasuk manusia, dari tiada. Setelah Allah menciptakan mereka kemudian dia meng-ulanginya kembali setelah hancur dan binasa dengan mengembalikan penciptaan itu seperti semula. Sungguh, mengembalikan penciptaan yang demikian itu sangatlah mudah bagi Allah. Jika demikian, bagaimana mereka mengingkari pengembalian manusia hidup kembali kelak di hari kemudian'."
  }
]