[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidakkah mereka itu mengetahui bagaimana Allah mengadakan makhluk dari tidak ada, kemudian Dia mengembalikan wujudnya setelah kehancurannya, sebagaimana Dia memulai penciptaannya sekali lagi dalam wujud yang baru, tanpa menyulitkanNya? Sesungguhnya hal itu mudah bagi Allah, sebagaimana mudah bagiNya untuk mengadakannya pertama kali."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Adakah orang-orang yang mendustakan tersebut memperhatikan bagaimana Allah menciptakan makhluk dari awal kemudian mengembalikannya setelah kematiannya. Sesungguhnya yang demikian itu mudah bagi Allah, dan Dia Mahakuasa, tidak ada sesuatu pun yang melemahkan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "19. Apakah orang-orang yang mendustakan hari kebangkitan itu tidak mengetahui tanda-tanda kekuasaan Allah pada makhluk-Nya; Dia menciptakan makhluk-Nya dari ketidakadaan dan dengan kuasa-Nya menciptakan mereka kembali setelah kematian sebagaimana penciptaan mereka sebelumnya. Sungguh yang demikian itu adalah hal yang mudah bagi Allah, tidak ada yang sulit bagi-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "19. أَوَلَمْ يَرَوْا۟ كَيْفَ يُبْدِئُ اللهُ الْخَلْقَ ثُمَّ يُعِيدُهُۥٓ ۚ (Dan apakah mereka tidak memperhatikan bagaimana Allah menciptakan (manusia) dari permulaannya, kemudian mengulanginya (kembali)) Yakni tidaklah mereka memperhatikan bagaimana Allah menciptakan setiap mereka dari air mani, kemudian Allah mengeluarkannya ke dunia, lalu mematikannya sesudah itu; begitu juga pada seluruh binatang dan tumbuhan. Apabila kalian telah melihat kuasa Allah untuk menciptakan maka Dia juga berkuasa untuk mengulangi penciptaan itu (membangkitkan dari kematian). إِنَّ ذٰلِكَ عَلَى اللهِ يَسِيرٌ(Sesungguhnya yang demikian itu adalah mudah bagi Allah) Sebab jika Allah hendak menciptakan sesuatu, Dia berfirman: “jadilah” maka ciptaan itupun jadi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19. Apakah mereka tidak melihat dan mengetahui bagaimana Allah memulai penciptaan manusia, hewan dan tumbuhan, kemudian menghidupkan kembali manusia setelah mati dan tiada. Sesungguhnya yang demikian itu mudah dan gampang bagi Allah. Barang siapa yang mampu menciptakan sesuatu pertama kali maka dia juga mampu mengembalikannya. Dia hal itu sama bagiNya. Kata {Yarau} di sini bermakna ya’lamu (mengetahui) dan hamzah istifham itu berfaedah inkary dan nafi. Dan jika digabungkan dengan nafi yang sebenarnya yaitu {Lam} maka akan berfungsi untuk menunjukkan informasi, yaitu untuk memastikan bahwa merka benar-benar melihat (mengetahui). Kalimat yang serupa yaitu {Alam Nashrah} [QS Asy-Syarh 94/1]"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "19. “Dan apakah mereka tidak memperhatikan bagaimana Allah menciptakan (manusia) dari permulaannya, kemudian mengulanginya kembali,” pada Hari KIamat? “SEsungguhnya yang demikian itu mudah bagi Allah” seperti telah difirmankan oleh Allah, \"Dan Dialah yang menciptakan (manusia) dari permulaan, kemudian mengembalikan (menghidupkan) nya kembali, dan menghidupkan kembali itu adalah lebih mudah bagi-Nya.\" (Ar-Rum: 27)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Ankabut ayat 19: Apakah mereka orang-orang yang mendustakan hari kebangkitan tidak melihat Allah menciptakan makhluk dari sesuatu yang tiada, kemudian Allah matikan dan kemudian Allah bangkitkan pada kali yang lain di hari kiamat untuk dibalas dan dihisab ? Sungguh kebangkitan itu adalah mudah bagi Allah; Karena Allah jika berkehendak atas sesuatu Dia berkata : Kun (jadilah) fa Yakun (maka jadi)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni memulai penciptaan makhluk dan mengulanginya kembali."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Ankabut Ayat 19",
    "description": "Dan apakah mereka lengah sehingga tidak memperhatikan bagaimana Allah senantiasa memulai penciptaan semua makhluk, termasuk manusia, dari tiada. Setelah Allah menciptakan mereka kemudian dia meng-ulanginya kembali setelah hancur dan binasa dengan mengembalikan penciptaan itu seperti semula. Sungguh, mengembalikan penciptaan yang demikian itu sangatlah mudah bagi Allah. Jika demikian, bagaimana mereka mengingkari pengembalian manusia hidup kembali kelak di hari kemudian'20. Meski sudah sangat banyak bukti kekuasaan Allah dan keniscayaan hari akhir yang dikemukakan, Allah memerintahkan nabi Muhammad, katakanlah wahai rasul, kepada orang-orang yang mendustakan kebangkitan setelah kematian, 'berjalanlah di muka bumi ke mana saja kaki berjalan, maka perhatikanlah dengan segera bagaimana Allah memulai penciptaan makhluk yang beraneka ragam, kemudian Allah menjadikan kejadian yang akhir dengan membangkitkan manusia setelah mati kelak di akhirat. Sungguh, Allah mahakuasa atas segala sesuatu yang dikehendaki-Nya."
  }
]