[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah manusia menyangka ketika mereka mengatakan, “Kami beriman,” bahwa sesungguhnya Allah akan membiarkan mereka tanpa cobaan dan ujian?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Apakah manusia mengira bahwa dengan ucapan mereka, “Kami beriman kepada Allah,” mereka akan dibiarkan saja tanpa diuji untuk memastikan hakikat yang mereka ucapkan, apakah mereka benar-benar beriman? Perkaranya tidak sebagaimana yang mereka kira."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "2. Allah menguji hamba-hamba-Nya yang beriman sesuai dengan tingkat keimanan mereka. Apakah manusia mengira Allah akan membiarkan mereka saja ketika mereka berkata “Kami beriman” tanpa menguji kebenaran perkataan mereka itu dengan ujian melalui harta dan diri mereka? Tidaklah demikian, Tuhan mereka pasti akan menguji mereka agar menjadi jelas tingkat kebenaran dan keteguhan mereka. Dan ayat ini tetap berlaku bagi umat ini."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. أَحَسِبَ النَّاسُ أَن يُتْرَكُوٓا۟ (Apakah manusia itu mengira bahwa mereka dibiarkan (saja)) Makna ayat ini adalah bahwa Allah tidak akan membiarkan manusia tanpa diuji dan diberi cobaan. Mereka tidak akan dibiarkan mengatakan “kami telah beriman” tanpa mendapat ujian. أَن يَقُولُوٓا۟ ءَامَنَّا وَهُمْ لَا يُفْتَنُونَ(mengatakan: “Kami telah beriman”, sedang mereka tidak diuji lagi?) Yakni sedang mereka tidak diberi cobaan dalam harta dan diri mereka. Kenyataannya tidak seperti yang mereka sangka, mereka harus diuji dengan perintah berjihad, kemiskinan, mara bahaya, dan lain sebagainya, agar jelas siapa yang jujur dalam keimanannya dan siapa yang munafik, siapa yang benar dan siapa yang bohong."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Apakah manusia itu beranggapan bahwa mereka akan dibiarkan saja tanpa diberi beban cobaan, hanya karena sudah mengucapkan dengan lisan mereka: “Kami beriman kepada Allah dan rasulNya” sedangkan mereka tidak diuji dengan nafsu dan harta mereka serta tidak diuji dengan beban dan kesukaran. Ayat ini yaitu {A hasiban naasu …} [2] diturunkan untuk Amar bin Yasir saat dia di siksa karena berada di jalan Allah."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-3. Allah menginformasikan tentang kesempurnaan hikmah (kebijaksanaan) Nya, dan bahwa hikmahNya tidak memastikan bahwa setiap orang yang mengatakan bahwa dirinya adalah seorang Mukmin dan mengklaim iman bagi dirinya, untuk tetap dalam kondisi selamat dari cobaan dan ujian, tidak menghadapi hal-hal yang mengganggu iman mereka atau cabang-cabangnya. Sebab, kalau perkaranya seperti itu, tentu tidak dapat dibedakan mana orang yang jujur (sejati) dari orang yang dusta, antara orang yang berpegang kepada kebenaran dari orang yang berpegang kepada kebatilan. Akan tetapi, sunnah dan kebiasaannya terhadap umat-umat yang telah lalu dan terhadap umat ini adalah Dia akan menguji mereka dengan kesenangan dan kesengsaraan hidup, kesulitan dan kemudahan, hal-hal yang membuat semangat dan yang membuat benci, kekayaan dan kefakiran, dengan penguasaan musuh-musuh terhadap mereka pada saat-saat tertentu, dengan memerangi musuh dengan perkataan dan perbuatan serta dengan berbagai cobaan lainnya, yang semuanya kembali kepada cobaan syubhat yang melawan akidah, fitnah syahwat yang melawan kamauan. Maka siapa saja ketika munculnya berbagai syubhat itu imannya tetap kokoh, tidak goyah dan dia menolaknya dengan kebenaran yang dimilikinya, dan di saat munculnya syahwat (rongrongan hawa nafsu) yang menyeret dan merangsang kepada maksiat dan dosa, atau yang memalingkan dari apa-apa yang diperintahkan Allah dan RasulNya, dia berbuat sesuai dengan tuntutan iman dan ia bermujahadah (berupaya keras) melawan rongrongan nafsunya, maka hal itu membuktikan ketulusan dan kebenaran imannya. (Sebaliknya), siapa saja di saat munculnya berbagai syubhat, lalu syubhat itu menimbulkan keraguan dan kebimbangan di dalam hatinya, dan di saat munculnya rongrongan hawa nafsu, lalu nafsu itu menyeretnya kepada maksiat atau menghalanginya dari kewajiban-kewajiban agama, maka hal itu membuktikan bahwa imannya tidak benar dan tidak tulus. Manusia dalam posisi ini berbeda-beda derajatnya, tidak ada yang mengetahuinya kecuali Allah. Ada yang rendah dan ada yang tinggi. Maka kami memohon kepada Allah, semoga Dia meneguhkan kami dengan al-Qaul ats- Tsabit (tauhid) di dunia dan akhirat, dan menguhkan hati kami pada agamaNya. Sesungguhnya cobaan dan ujian bagi jiwa tak ubahnya seprti alat tempa besi yang memisahkan karat dari besi."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Ankabut ayat 2: Allah berkata dalam awal surat ini dengan pengingkaran : Apakah manusia menyangka dengan mengatakan : Kami beriman kepada Allah; Kemudian ditinggalkan dengan tanpa di uji dan diberikan cobaan serta terjauhkan dari penilaian, sampai diketahui yang jujur dalam keimanan dan selainnya ?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan tentang sempurnanya hikmah-Nya. Hikmah-Nya tidak menghendaki bahwa setiap orang yang mengaku mukmin tetap dalam keadaan aman dari fitnah dan ujian serta tida datang kepada mereka sesuatu yang menggoyang iman mereka. Yang demikian adalah karena jika tidak demikian, maka tidak dapat dibedakan antara orang yang benar-benar beriman dengan yang tidak (yakni berdusta) dan tidak dapat dibedakan antara orang yang benar dengan orang yang salah. Akan tetapi Sunnah-Nya dan kebiasaan-Nya terhadap generasi terdahulu sampai pada umat ini adalah bahwa Dia akan menguji mereka. Barang siapa yang ketika fitnah syubhat (kesamaran) datang, imannya tetap kokoh dan dapat menolak dengan kebenaran yang dipegangnya. Dan ketika fitnah syahwat datang yang mengajaknya berbuat dosa dan maksiat atau memalingkan dari perintah Allah dan Rasul-Nya, ia bersabar dalam arti mengerjakan konsekwensi iman dan melawan hawa nafsunya, hal ini menunjukkan kebenaran imannya. Akan tetapi barang siapa yang ketika syubhat datang, ada pengaruh dalam hatinya berupa keraguan dan kebimbangan dan ketika syahwat datang, membuatnya mengerjakan maksiat atau berpaling dari kewajiban, maka yang demikian menunjukkan tidak benar keimanannya. Manusia dalam hal ini berbeda-beda tingkatannya, tidak ada yang mengetahuinya selain Allah. Oleh karena itu, kita meminta kepada Allah agar Dia menguatkan kita dengan ucapan yang teguh (Laailaahaillallah) di dunia dan akhirat dan mengokohkan kita di atas agamanya. Ujian dan cobaan ibarat kir (alat peniup api untuk besi) yang mengeluarkan kotorannya. Agar diketahui hakikat keimanan mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Ankabut Ayat 2",
    "description": "Apakah manusia mengira bahwa mereka akan dibiarkan begitu saja pada setiap waktu, tempat dan situasi hanya dengan mengatakan, 'kami telah beriman, ' dan mereka tidak diuji dengan hal-hal yang dapat membuktikan hakikat keimanan mereka, yaitu dalam bentuk cobaan-cobaan dan tugas-tugas keagamaan' tidak, bahkan mereka harus diuji dengan hal-hal seperti itu. 3. Dan apakah mereka menduga demikian, padahal sungguh, kami bersumpah bahwa kami telah menguji orang-orang sebelum mereka, yaitu sebelum umat nabi Muhammad, dengan tugas-tugas keagamaan dan bermacam nikmat dan cobaan, agar tampak perbedaan antara orang-orang yang benar-benar beriman dan berdusta sesuai dengan apa yang diketahuinya berdasarkan ilmu-Nya yang azali. Maka sesungguhnya Allah pasti mengetahui orang-orang yang benar dalam keimanannya dan pasti mengetahui orang-orang yang dusta."
  }
]