[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai Rasul) kepada orang-orang yang mengingkari Hari Kebangkitan setelah kematian, “Berjalanlah di muka bumi, lalu perhatikanlah bagaimana Allah mengadakan mahkluk-makhlukNya, tidak sulit bagiNya untuk mengadakan itu pertama kali. Demikian pula, bukan perkara sulit bagiNya untuk mengulang penciptaan itu kembali sekali lagi. Sesungguhnya Allah MahaKuasa atas segala sesuatu; tidak ada sesuatu yang diinginkanNya yang melemahkanNya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "20. Katakanlah -wahai Rasul- kepada orang-orang yang mendustakan hari Kebangkitan tersebut, “Berjalanlah di muka bumi dan perhatikanlah bagaimana Allah memulai penciptaan makhluk, kemudian Allah menghidupkan manusia setelah kematiannya dengan kehidupan kedua untuk kebangkitan dan perhitungan. Sesungguhnya Allah Mahakuasa atas segala sesuatu, tidak ada sesuatu pun yang mampu melemahkan-Nya, maka tidak berat bagi-Nya untuk membangkitkan manusia sebagaimana tidak berat bagi-Nya untuk menciptakan mereka dari awal."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "20. Hai Rasulullah, katakanlah kepada orang-orang yang mengingkari hari kebangkitan dan berdirinya mereka di hadapan Allah: “Perhatikanlah bumi ini, baik yang dekat maupun yang jauh; kemudian perhatikanlah kembali bagaimana penciptaannya, agar kalian memahami bahwa yang menciptakannya -dari ketidakadaan- Maha Kuasa untuk menciptakannya kembali di akhirat kelak; sebab jika Dia mampu menciptakan pertama kali maka Dia mampu mengulangi penciptaannya kembali. Dia mampu membangkitkan dan mampu melakukan segala yang Dia kehendaki.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "20. قُلْ سِيرُوا۟ فِى الْأَرْضِ فَانظُرُوا۟ كَيْفَ بَدَأَ الْخَلْقَ ۚ (Katakanlah: “Berjalanlah di (muka) bumi, maka perhatikanlah bagaimana Allah menciptakan (manusia) dari permulaannya) Meski dengan jumlah yang banyak, bermacam-macam warna, tabiat, dan bahasa mereka. ثُمَّ اللهُ يُنشِئُ النَّشْأَةَ الْاٰخِرَةَ ۚ( kemudian Allah menjadikannya sekali lagi) Yakni menciptakannya kembali dengan penciptaan yang kedua pada hari kebangkitan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20. Katakanlah wahai nabi kepada para pendusta risalahmu itu: “Berjalanlah kalian di permukaan bumi lalu lihatlah bagaimana awal mula penciptaan makhluk sebelum kalian dengan bentuk yang berbeda-beda dan perangai yang berubah-ubah, supaya kalian mengerti kesempurnaan kuasa Allah. Jejak peninggalan mereka menunjukkan keberadaan mereka. Kemudian Allah menghidupkan lagi makhlukNya usai kebangkitan pertama yang disebut awal penciptaan. Sesungguhnya awal penciptaan dan proses penghidupan ulang itu adalah dua kebangkitan. Sesunggunya Allah berkuasa atas setiap sesuatu dan tidak ada sesuatu yang tidak mampu dilakukanNya seperti awal penciptaan awal dan penghidupan kembali. Kata Bada’a dan Abda’a itu bermakna satu yaitu awal penciptaan, yaitu menciptakan sesuatu yang belum ada. Dan kebangkitan akhirat adalah proses menghidupkan makhluk pada hari kiamat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "20. “Katakanlah” kepada mereka kalau mereka meragukan permulaan (penciptaan), “Berjalanlah di (muka) bumi,” dengan jasad dan hati kalian, “maka perhatikanlah bagaimana Allah menciptakan (manusia) dari permulaannya,” maka sesungguhnya kalian akan menemukan umat-umat dari anak cucu Adam dan dari berbagai jenis hewan senantiasa ada sedikit demi sedikit; dan kalian akan menjumpai tumbuh-tumbuhan dan berbagai pohon, bagaimana ia tumbuh dari waktu ke waktu. Dan kalian menjumpai awan, angina dan lain-lainnya selalu bereproduksi, bahkan manusia selalu dalam permulaan dan pengulangan (proses reproduksi). Maka perhatikanlah mereka pada saat mereka mati dengan kematian kecil, yaitu tidur. Mereka telah diselimuti malam yang gelap gempita, gerak mereka pun menjadi diam, suara mereka menjadi sepi dan mereka menjadi di atas kasur dan di tempat-tempat tidur mereka, tak ubahnya seperti orang mati. Kemudian mereka terus seperti itu sepanjang malam hingga fajar Shubuh terbit, lalu mereka bangun dari tidur lelap mereka, dan mereka dibangkitkan dari kematian seraya berkata, “segala puji bagi Allah yang telah menghidupkan kami setelah kami dimatikan dan hanya kepadaNya-lah tempat kami kembali.” Oleh karena itu, Allah berfirman, “Kemudian Allah,” setelah membangkitkan mereka “menjadikannya sekali lagi” yaitu penciptaan yang tidak menjadikan kematian ataupun tidur; melainkan kekekalan dan keabadian di dalam salah satu dari dua negeri. “Sesungguhnya Allah Maha kuasa atas segala sesuatu.” Kekuasaan Allah tidak dapat dihalangi oleh apa pun. Sebagaimana Dia kuasa memulai penciptaan, maka kekuasaanNya untuk mengulangi penciptaan itu tentu lebih mudah dan lebih layak (mampu dilakukan)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Ankabut ayat 20: Katakanlah wahai Nabi Allah kepada mereka yang mendustakan : Berjalanlah di bumi dengan tubuh-tubuh kalian, kemudian berpikirlah dengan hati dan akal kalian, lihatlah bagaimana Allah memulai penciptaan makhluk dan mewujudkannya dari ketiadaan ?! Kemudian Allah mematikannya, kemudian dikembalikan jika Allah menghendaki mereka dan mewujudkan kembali pada kali yang lain; Allah juga yang menghendaki mereka awal pertama kali dan tidak ada yang menahan Allah untuk mengembalikannya pada kali yang lain, sungguh kuasa Allah tidak ada yang melemahkan-Nya, Allah maha kuasa atas segala sesuatu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kepada mereka, jika mereka masih ragu-ragu. Dengan badan dan hatimu. Kamu akan mendapati makhluk, baik dari kalangan manusia maupun hewan senantiasa terwujud sedikit demi sedikit, demikian pula kamu melihat tanaman tumbuh sedikit demi sedikit, dan kamu menemukan awan, angin dan sebagainya mengalami pembaruan, bahkan makhluk semuanya selalu mengalami permulaan dan pengembalian. Perhatikanlah mereka ketika mengalami mati yang kecil, yaitu tidur ketika malam menimpa mereka, maka gerakan mereka pun mulai tenang, suara terhenti dan mereka di kasurnya seperti orang yang mati, dan mereka selama malam itu tetap seperti itu sampai tiba waktu pagi, mereka pun bangun dari tidurnya dan bangkit dari kematiannya, di antara mereka ada yang bersyukur dengan mengatakan, “Al Hamdulilallladzii ahyaanaa ba’da maa amaatanaa wa ilaihin nusyuur” (artinya: Segala puji bagi Allah yang telah menghidupkan kami setelah mematikan kami dan kepada-Nyalah kami dibangkitkan) Maksudnya, Allah membangkitkan manusia setelah mati kelak di akhirat, dan mereka akan hidup kekal di salah satu tempat; surga atau neraka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Ankabut Ayat 20",
    "description": "Meski sudah sangat banyak bukti kekuasaan Allah dan keniscayaan hari akhir yang dikemukakan, Allah memerintahkan nabi Muhammad, katakanlah wahai rasul, kepada orang-orang yang mendustakan kebangkitan setelah kematian, 'berjalanlah di muka bumi ke mana saja kaki berjalan, maka perhatikanlah dengan segera bagaimana Allah memulai penciptaan makhluk yang beraneka ragam, kemudian Allah menjadikan kejadian yang akhir dengan membangkitkan manusia setelah mati kelak di akhirat. Sungguh, Allah mahakuasa atas segala sesuatu yang dikehendaki-Nya. 21. Dia mengazab dengan sangat adil siapa yang dia kehendaki atas segala dosa yang dilakukannya semasa hidup, dan memberi rahmat kepada siapa yang dia kehendaki, yaitu orang-orang yang bertobat dan beramal saleh, dan hanya kepada-Nya setelah kematian kamu akan dikembalikan untuk perhitungan dan pembalasan."
  }
]