[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dia menyiksa siapa saja dari makhlukNya yang Dia kehendaki atas kejahatan yang dahulu ia perbuat pada hari-hari kehidupannya, dan Dia memberikan rahmat kepada orang-orang yang bertaubat dari mereka dan beramal shalih. KepadaNya-lah kalian akan dikembalikan. Lalu Dia akan memberikan balasan kepada kalian sesuai apa yang kalian perbuat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Allah menyiksa siapa yang dikehendaki-Nya dari makhluk-Nya dengan keadilan-Nya dan mengasihi yang dikehendaki-Nya dari makhluk-Nya dengan karunia-Nya. Hanya kepada-Nya lah kalian dikembalikan pada hari Kiamat untuk perhitungan tatkala Dia membangkitkan kalian hidup-hidup dari kuburan kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "21. Allah mengazab hamba-Nya yang Dia kehendaki akibat keburukan-keburukan yang telah dia kerjakan, dan marahmati siapa yang Dia kehendaki dari orang yang beriman dan beramal shalih. Dan kepada Allah seluruh manusia akan kembali pada hari kebangkitan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "21. يُعَذِّبُ مَن يَشَآءُ (Allah mengazab siapa yang dikehendaki-Nya) Yakni mengazab orang-orang kafir dan pelaku maksiat. وَيَرْحَمُ مَن يَشَآءُ ۖ( dan memberi rahmat kepada siapa yang dikehendaki-Nya) Yakni merahmati orang-orang yang beriman dan mempercayai para rasul-Nya, serta melaksanakan perintah dan menjauhi larangan-Nya. وَإِلَيْهِ تُقْلَبُونَ (dan hanya kepada-Nya-lah kamu akan dikembalikan) Dan tidak kepada selain-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "21. Dia menyiksa orang yang dikehendaki untuk disiksa dan mengasihi orang yang dikehendaki untuk dikasihi. Dan hanya kepadaNyalah kalian dikembalikan setelah kematian kalian."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21. “Allah mengazab siapa yang dikehendakiNya dan memberi rahmat siapa yang dikehendakiNya,” maksudnya, hanya Dia semata yang berwenang menentukan keputusan pembalasan, yaitu memberikan pahala kepada orang-orang yang taat dan merahmati mereka, dan mengazab orang-orang yang durhaka dan memberikan hukuman peringatan terhadap mereka, “dan hanya kepadaNYa-lah kamu akan dikembalikan,” maksudnya, kalian akan dikembalikan kepada negeri yang di sana keputusan azab dan rahmatNya diberlakukan. Maka berusahalah di dunia ini untuk melakukan amal yang dapat menjadi sebab rahmatNya, yaitu berbagai ketaatan, dan jauhilah segala sebab yang dapat mengakibatkan azabNya, yaitu segala bentuk kemaksiatan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Ankabut ayat 21: Allah mengabarkan bahwasanya Dia sajalah yang mengadzab bagi siapa yang Dia kehendaki bagi orang-orang musyrik dan yang bermaksiat dengan adil, dan Allah juga merahmati bagi siapa yang dikehendaki-Nya dari orang-orang yang bertahid dan yang taat dengan rahmat dan karunia-Nya. Kepada Allahlah mereka semua kembali dan tempat mereka kembali hanya kepada-Nya. Allah akan membalasa amalan mereka dan menghisab dan mengadzab mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dia sendiri yang memberikan hukum jaza’i (pembalasan), yaitu mengazab mereka yang bermaksiat dan memberikan pahala dan rahmat kepada orang-orang yang taat. Kamu akan dikembalikan ke negeri akhirat, negeri yang di sana berlaku hukum-hukum jaza’i (azab dan rahmat-Nya). Oleh karena itu, kerjakanlah sebab untuk memperoleh rahmat-Nya yaitu taat dan jauhilah sebab yang mendatangkan azab-Nya yaitu maksiat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Ankabut Ayat 21",
    "description": "Dia mengazab dengan sangat adil siapa yang dia kehendaki atas segala dosa yang dilakukannya semasa hidup, dan memberi rahmat kepada siapa yang dia kehendaki, yaitu orang-orang yang bertobat dan beramal saleh, dan hanya kepada-Nya setelah kematian kamu akan dikembalikan untuk perhitungan dan pembalasan. 22. Jangan duga akan dapat menghindar dari siksa-Nya, karena ketika itu tidak ada kekuasaan selain kuasa-Nya dan kamu wahai para pendurhaka sama sekali tidak dapat melepaskan diri dari siksa yang ditetapkan Allah, baik kamu berada di bumi maupun berada di langit, dan tidak ada pelindung yang dapat menghalangi siksa Allah dan penolong bagimu yang dapat meringankan siksa yang ditetapkan itu selain Allah."
  }
]