[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang yang menolak hujjah-hujjah Allah, serta mengingkari dalil-dalilNya dan perjumpaan denganNya pada Hari Kiamat, mereka itu tidak memiliki keinginan terhadap rahmatKu di akhirat ketika mereka menyaksikan sendiri siksaan yang dipersiapkan bagi mereka, dan mereka akan mendapat siksaan yang pedih lagi menyakitkan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "23. Dan orang-orang yang mengingkari ayat-ayat Allah Yang Mahasuci dan mengingkari pertemuan dengan Allah pada hari Kiamat, mereka itulah orang-orang yang putus asa dari rahmat-Ku, maka mereka tidak akan masuk Surga selamanya karena kekufuran mereka dan bagi mereka siksa yang menyakitkan siap menunggu di Akhirat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "23. Allah mengancam orang-orang yang mengingkari ayat-ayat Allah dan kebangkitan makhluk untuk menghadap Tuhannya, bahwa mereka layak untuk putus harapan dari rahmat dan ampunan-Nya dan berhak mendapat azab-Nya yang pedih."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "23. وَالَّذِينَ كَفَرُوا۟ بِـَٔايٰتِ اللهِ (Dan orang-orang yang kafir terhadap ayat-ayat Allah) Baik itu ayat kauniyah maupun ayat tanziluiyah, atau juga keduanya. Serta orang-orang yang kafir terhadap pertemuan dengan Allah, yakni mengingkari hari kebangkitan dan peristiwa-peristiwa setelahnya. أُو۟لٰٓئِكَ يَئِسُوا۟ مِن رَّحْمَتِى (mereka putus asa dari rahmat-Ku) Yakni mereka di dunia berputus asa dari rahmat Allah, tidak bermanfaat bagi mereka kitab-kitab Allah dan tidak pula kabar-kabar yang disampaikan para Rasul-Nya; serta mereka berputus asa di akhirat dari rahmat Allah yang berupa surga."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "23. Dan orang-orang yang mengingkari ayat-ayat Allah yang diturunkan dalam kitab-kitab samawi dan ayat-ayat kauniyyah yang menunjukkan kepada keesaan sang pencipta, dan menolak untuk bertemu Allah dengan dibangkitkan setelah mati, maka mereka itu tidak mendapatkan rahmatKu pada hari kiamat dan bagi mereka itu azab yang pedih di neraka Jahanam akibat kekufuran mereka."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "23. Allah mengabarkan siapa mereka yang sama sekali tidak memiliki kebaikan dan (hanya) memperoleh keburukan, dan bahwasanya mereka adalah orang-orang yang kafir kepadaNya, kepada para RasulNya dan kepada ajaran yang mereka bawa serta kepada para RasulNya dan kepada ajaran yang mereka bawa serta mendustakan perjumpaan dengan Allah. Mereka sama sekali tidak memiliki apa-apa kecuali dunia, maka dari itu mereka berani melakukan syirik dan berbagai maksiat, sebab di dalam hati mereka tidak ada sesuatu yang dapat mereka takut dari akibat semua perbuatan mereka itu, maka dari itu Allah berfirman, “Mereka berputus asa dari raahmatKu,” maksudnya, maka “Mereka berputus asa dari rahmatKu,” maksudnya, maka dari itu mereka tidak melakukan satu sebab pun yang dengannya mereka bisa mendapat rahmat. Sebab bila tidak, kalau saja mereka masih mempunyai keinginan untuk mendapat rahmatNya, tentu mereka melakukan amal-amal kebajikan. Berputus asa dari rahmat Allah merupakan bahaya yang sangat besar. Ia ada dua macam, yaitu : Putus asanya kaum kafir dari rahmat Allah, dalam bentuk meninggalkan semua hal yang dapat membuat mereka dekat dengannya. Dan (kedua), putus asanya para pelaku maksiat disebabkan banyaknya dosa-dosa yang mereka lakukan yang membuat mereka merasa jauh, hingga dosa-dosa itu menyelimuti hati mereka, lalu menimbulkan rasa putus asa, “dan mereka itu mendapat azab yang pedih,” yaitu azab yang sangat pedih lagi menyakitkan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Ankabut ayat 23: Dan mereka yang kafir dengan ayat-ayat Allah yang menunjukkan atas ke maha tunggalan-Nya, dan mendustakan para utusan-Nya; Mereka adalah orang-orang yang tidak mengharap rahmat Allah; Sebab mereka tidak beramal dengan apa yang menjadikan Allah memberikan rahmat-Nya; Bahkan mereka menyelisihi sebaliknya, dan beramal dengan penyelisihan tersebut. Maka mereka di akhirat mendapatkan adzab yang pedih."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan tentang orang yang telah hilang kebaikannya dan yang ada hanya keburukan, bahwa mereka kafir kepada-Nya dan kepada para rasul-Nya serta apa yang mereka bawa, demikian pula mereka mendustakan pertemuan dengan Allah, di sisi mereka yang ada hanyalah dunia. Oleh karena itulah, mereka melakukan perbuatan syirk dan kemaksiatan, karena tidak ada dalam hati mereka rasa takut terhadap perbuatan mereka itu. Oleh karena itulah, mereka tidak mengerjakan perbuatan yang menjadi sebab mendapatkan rahmat. Jika mereka berharap rahmat-Nya, tentu mereka akan melakukan perbuatan yang mendatangkan rahmat-Nya. Berputus asa dari rahmat Allah merupakan dosa yang besar. Ia terbagi menjadi dua: (1) Putus asa orang-orang kafir, di mana mereka meninggalkan semua sebab yang dapat mendekatkan mereka kepada rahmat Allah, (2) Putus asa para pelaku maksiat karena banyaknya dosa yang mereka lakukan sehingga membuat mereka berputus asa. Biasanya putus asa terjadi karena tidak mengenal siapa Allah, Allah Maha Pengampun lagi Maha Penyayang, betapa pun besar dosa yang dilakukan hamba, maka Dia tetap membuka pintu tobat selama ajal belum tiba dan matahari belum terbut dari barat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Ankabut Ayat 23",
    "description": "Harapan mereka untuk meraih surga pupus, dan orang-orang yang mengingkari ayat-ayat Allah, baik yang terbentang di alam raya maupun yang tertulis dalam kitab suci, dan mengingkari pertemuan dengan-Nya, yakni pada hari kebangkitan, mereka itu sungguh telah berputus asa dari rahmat-ku ketika menyaksikan azab yang telah disediakan bagi mereka, dan mereka itu akan mendapat azab yang pedih. -."
  }
]