[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka tidak ada jawaban dari kaum Ibrahim kepadanya selain sebagian mereka berkata kepada sebagian yang lain, “Bunuhlah dia atau bakarlah dia dengan api. Lalu lemparkanlah dia kedalamnya.” Lalu Allah menyelamatkan dirinya dari api itu, dan Dia menjadikan api itu dingin dan keselamatan baginya. Sesungguhnya dalam peristiwa Kami menyelamatkan Ibrahim dari api itu benar-benar terdapat bukti-bukti dan hujjah-hujjah bagi orang-orang yang beriman kepada Allah dan melaksanakan syariatNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. Dan jawaban kaum Ibrahim kepadanya -setelah diperintahkan untuk menyembah Allah semata dan meninggalkan ibadah kepada selain-Nya dari berhala-berhala- tidak adalah dengan mengatakan, ”Bunuhlah dia dan lemparkanlah ke api agar tuhan-tuhan kalian menjadi pemenang.” Lalu Allah menyelamatkannya dari api. Sesungguhnya dalam kisah penyelamatan Ibrahim dari api setelah dia dilemparkan ke dalamnya terdapat pelajaran bagi orang-orang yang beriman, karena orang-orang yang beriman inilah yang bisa mendapatkan manfaat dari pelajaran ini."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "24. Ayat-ayat berikut ini kembali membahas tentang Nabi Ibrahim, setelah sebelumnya terdapat peringatan tentang terhadap beberapa perkara. Kaum Nabi Ibrahim merasa terpojokkan oleh Ibrahim, sehingga mereka bertekat untuk menyingkirkannya, baik itu dengan membunuh atau membakarnya. Akan tetapi Allah menyelamatkan Nabi Ibrahim dari api yang telah mereka siapkan baginya. Sungguh pada pertolongan ini terdapat banyak tanda atas kekuasaan Allah yang besar, kebenaran janji-Nya, kemuliaan rasul-Nya, dan penundukan makhluk-makhluk-Nya bagi Nabi Ibrahim. Akan tetapi tanda-tanda ini hanya diterima orang-orang beriman dan diingkari orang yang dalam hatinya tidak terdapat keimanan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "24. فَمَا كَانَ جَوَابَ قَوْمِهِۦٓ إِلَّآ أَن قَالُوا۟ اقْتُلُوهُ أَوْ حَرِّقُوهُ (Maka tidak adalah jawaban kaum Ibrahim, selain mengatakan: “Bunuhlah atau bakarlah dia”) Ayat ini mengembalikan pembicaraan ke dalam kisah nabi Ibrahim, setelah terselingi oleh pembahasan tentang nabi Muhammad. فَأَنجَىٰهُ اللهُ مِنَ النَّارِ ۚ( lalu Allah menyelamatkannya dari api) Dan Allah menjadikan api itu dingin dan tidak membahayakan nabi Ibrahim. إِنَّ فِى ذٰلِكَ (Sesungguhnya pada yang demikian itu) Yakni pada pertolongan Allah kepada Ibrahim. لَاٰيٰتٍ (benar-benar terdapat tanda-tanda kebesaran Allah) Yang mana mereka telah menyalakan api yang sangat besar, kemudian melemparkan Ibrahim ke dalam api itu, namun api itu tidak membakarnya dan tidak menyakitinya sedikitpun."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "24. Dan tidaklah jawaban kaum Ibrahim setelah dia menyeru mereka untuk mengesakan Allah kecuali mereka saling berkata: “Bunuh atau bakar saja dia menggunakan api” Lalu Allah menolongnya dari api mereka dan menjadikan api itu sejuk dan menyelamatkannya. Sesungguhnya dalam pertolongan Allah terhadap Ibrahim itu dalil-dalil yang jelas tentang keberadaan dan keesaan Allah bagi kaum yang beriman kepadaNya dan kekuasaanNya. Dan orang-orang mukmin menggunakan peristiwa itu untuk pengingat, karena mereka mengambil manfaat dari peristiwa itu."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "24. Maksudnya, tidaklah jawaban kaum Ibrahim saat Ibrahim mengajak mereka kepada Allah adalah menerima dakwah (seruan) nya dan juga berpegang kepada nasihatnya atau melihat nikmat Allah yang dilimpahkan kepada mereka berupa mengutus beliau sebagai rasul kepada merekka. Tetapi sesungguhnya jawaban mereka adalah seburuk-buruk jawaban, yaitu, “Mereka mengatakan, ‘Bunuhlah atau bakarlah dia’,” dengan seburuk-buruk pembunuhan. Sementara mereka adalah kaum yang berkuasa, yang mempunyai kekuasaan. Maka dari itu mereka menceburkan Ibrahim ke dalam api, “lalu Allah menyelamatkannya,” dari api itu. “Sesungguhnya pada yang demikian itu benar-benar terdapat tanda-tanda kebesaran Allah bagi orang-orang beriman,” sehingga mereka dapat mengetahui kebenaran ajaran yang dibawa (diajarkan) oleh para rasul, kebaikan dan dan ketulusan mereka, serta kebatilan dari keyakinan orang-orang yang menyalahi mereka dan menentangnya; dan bahwa para penentang rasul-rasul itu seakan-akan sudah saling berpesan. Sebagian sudah menganjurkan kepada sebagian yang lain untuk mendustakan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Ankabut ayat 24: Maka apa yang di ingkari dari kaum Ibrahim setelah Ibrahim mendakwahkan kepada mereka kepada tauhid, dan melarang dari beribadah kepada sesembahan lai, kecuali sebagian dari mereka berkata kepada sebagian yang lain : Bunuhlah Ibrahim atau bakarlah dia dengan api. Kemudian mereka menetapkan untuk membakar Ibrahim dan mereka menyalakan api untuk Ibrahim dimasukkan ke dalamnya. Akan tetapi Allah menyelamatkannya dari api. Sungguh itu adalah tanda-tanda yang jelas dari apa yang Ibrahim menyeru kepada kaumnya, tanda ini adalah sebagai manfaat bagi orang-orang yang beriman yang mereka membenarkan Allah dan para utusan-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan menjadikannya dingin dan memberikan keselamatan bagi Ibrahim. Karena merekalah yang dapat mengambil manfaat daripadanya. Dari sana mereka mengetahui benarnya apa yang dibawa para rasul dan batilnya ucapan dan sikap orang yang menyelisihi mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Ankabut Ayat 24",
    "description": "-."
  }
]