[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Ibrahim berkata kepada kaumnya, “Wahai kaumku, sesungguhnya yang kalian sembah itu adalah tuhan-tuhan yang batil yang kalian jadikan sebagai tuhan selain Allah, kalian saling mencintai dalam penyembahan kepadanya, Kalian saling berkasih sayang dalam berkhidmat kepadanya di kehidupan dunia. Kemudian pada Hari Kiamat, sebagian dari kalian akan berlepasadiri atas sebagian yang lain, dan sebagian dari kalian akan melaknat sebagian yang lain. Sedang tempat kembali kalian semua adalah neraka, dan kalian tidak mempunyai penolong yang akan menyelamatkan kalian sehingga kalian tidak memasukinya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "25. Dan Ibrahim -'alaihissalām- berkata kepada kaumnya, “Sesungguhnya kalian menjadikan berhala-berhala ini sebagai tuhan-tuhan yang kalian sembah hanyalah untuk menciptakan perkenalan dan kecintaan dalam penyembahannya di kehidupan dunia ini semata, kemudian kecintaan di antara kalian tersebut pada hari Kiamat akan terputus, lalu sebagian dari kalian berlepas diri dari sebagian lainnya ketika menyaksikan siksa, dan sebagian melaknati sebagian yang lain, lalu tempat kalian kembali adalah Neraka, kalian tidak mempunyai penolong-penolong yang mencegah kalian dari siksa Allah, tidak dari berhala-berhala yang telah kalian sembah selain Allah, tidak pula dari yang lainnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "25. Nabi Ibrahim kembali berkata kepada kaumnya: “Kalian terus menghadap berhala-berhala ini dan menyembahnya karena kalian ingin menjadikannya sebab persatuan di antara kalian di kehidupan dunia dan penguat hubungan kalian dalam penyembahan dan pelayanan kepadanya; sehingga kalian takut hubungan itu akan hilang jika kalian meninggalkan berhala-berhala tersebut. Lalu apa hasil dari jalan yang sesat dan kenikmatan yang sesaat ini pada hari kiamat? Orang-orang yang lalai itu akan saling bermusuhan akibat kekafiran dan keingkaran mereka, generasi terdahulu akan berlepas diri dari generasi setelahnya, dan mereka akan saling mencela dan melaknat. Akan tetapi itu semua tidak bermanfaat bagi mereka, karena api neraka telah menunggu mereka; tidak ada yang mampu menolong mereka dari kehinaan dan balasan bagi mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "25. وَقَالَ (Dan berkata Ibrahim) Ibrahim berkata kepada kaumnya. إِنَّمَا اتَّخَذْتُم مِّن دُونِ اللهِ أَوْثٰنًا مَّوَدَّةَ بَيْنِكُمْ فِى الْحَيَوٰةِ الدُّنْيَا ۖ( Sesungguhnya berhala-berhala yang kamu sembah selain Allah adalah untuk menciptakan perasaan kasih sayang di antara kamu dalam kehidupan dunia ini) Yakni untuk saling mengasihi dan berinteraksi karena kalian sama-sama menyembah berhala-berhala itu, dan kalian takut akan kehilangan kasih sayang itu jika kalian tidak lagi menyembahnya. Yakni rasa kasih sayang adalah hal yang menyatukan kalian dalam penyembahan berhala-berhala itu. ثُمَّ يَوْمَ الْقِيٰمَةِ يَكْفُرُ بَعْضُكُم بِبَعْضٍ(kemudian di hari kiamat sebahagian kamu mengingkari sebahagian (yang lain)) Dan kasih sayang yang terbangun di atas asas yang batil itu akan sirna. Pendapat lain mengatakan bahwa para penyembah berhala itu berlepas diri dari berhalanya, dan berhala itu berlepas diri dari para penyembahnya. وَيَلْعَنُ بَعْضُكُم بَعْضًا(dan sebahagian kamu melaknati sebahagian (yang lain)) Yakni setiap golongan melaknat golongan lain. وَمَأْوَىٰكُمُ النَّارُ(dan tempat kembalimu ialah neraka) Yakni tempat tinggal yang kalian tinggali adalah neraka. وَمَا لَكُم مِّن نّٰصِرِينَ(dan sekali-kali tak ada bagimu para penolongpun) Yakni penolong yang dapat menyelamatkan kalian dari neraka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "25. Ibrahim berkata: “Wahai kaumku, sesungguhnya berhala-berhala yang kamu jadikan Tuhan selain Allah itu adalah untuk menumbuhkan rasa cinta di antara kalian dan keinginan untuk menyembahnya di kehidupan dunia. Kemudian pada hari kiamat sebagian kalian berlepas diri dari sebagian lainnya. Kemudian para penyembah itu berlepas diri dari berhala-berhala itu, begitu juga berhala-berhala itu berlepas diri dari para penyembahnya. Para pengikut (kepercayaan itu) melaknat para pemimpin mereka, begitu juga sebaliknya. Tempat kalian adalah neraka dan kalian tidak memiliki penolong yang dapat menyelamatkan kalian dari neraka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "25. “Dan berkata” Ibrahim kepada mereka dalam serangkaian nasihat yang dikatakannya, “Sesungguhnya berhala-berhala yang kalian sembah selain Allah adalah untuk menciptakan perasaan kasih sayang diantara kalian dalam kehidupan dunia ini,” maksudnya, puncak dari semua itu adalah rasa kasih di dunia, nanti akan terputus dan sirna, “kemudian di Hari KIamat sebagian kalian mengingkari sebagian (yang lain) dan sebagian kalian melaknati sebagian yang lain,” maksudnya, masing-masing dari para penyembah dan sesembahan-sesembahan itu berlepas diri dari yang lain; \"dan apabila manusia sudah dihimpun (di padang Mahsyar. Pent ) maka mereka menjadi musuh bagi para sesembahannya, dan mereka (para sesembahan) itu pun mengingkari penyembahan mereka.\" Maka bagaimana bisa kalian masih mau mencintai sesembahan yang sudah pasti akan berlepas diri dari para penyembahnya, dan bahkan mengutuknya. Dan sesungguhnya tempat tinggal mereka semua, baik yang menyembah dan yang disembah “adalah neraka” dan tidak ada seorang pun yang bisa menolong mereka dari azab Allah atau mencegah siksaanNya dari mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Ankabut ayat 25: Dan sebagian dari apa yang Ibrahim wasiatkan kepada kaumnya adalah, dia berkata kepada kaumnya : Sungguh sesembahan ini yang kalian ibadahi di dunia saling mencintai satu sama lain karena perkumpulan di antara mereka, kemudian di hari kiamat, mereka akan saling mengkafirkan satu sama lain, saling melaknat satu sama lain, saling berlepas diri antara yang disembah dan yang menyembah, dan yang menyembah dari yang disembah sebagaimana firman Allah dalam surat Az Zukhruf : 67. Kemudian kalian akan ditempatkan di neraka jahannam untuk diadzab di dalamnya, tidak ada penolong bagi kalian dan juga pembela kalian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Di antara bentuk skap tulusnya. Yakni pemimpin mereka berlepas diri dari pengikutnya. Yakni para pengikut mengutuk para pemimpinnya. Dari azab Allah dan siksa-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Ankabut Ayat 25",
    "description": "-."
  }
]