[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka Luth membenarkan Ibrahim dan mengikuti ajaran agamanya. Dan Ibrahim berkata kepadanya, “Sesungguhnya aku meninggalkan negeri kaumku menuju tempat yang diberkahi, yaitu Syam. Sesungguhnya Allah, Dia-lah Yang Mahaperkasa Yang tidak terkalahkan, Mahabijaksana dalam pengaturanNya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "26. Maka Lūṭ -'alaihissalām- beriman kepadanya dan berkata, “Sesungguhnya aku berpindah ke (tempat yang diperintahkan) Rabbku, ke negeri Syam yang diberkahi. Sesungguhnya Dia Maha Perkasa tak terkalahkan, tidak menjadikan hina orang yang berpindah kepada-Nya dan Maha Bijaksana dalam takdir-Nya dan ketentuan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "26. Nabi Luth mengimani risalah Nabi Ibrahim dan menjadi pengikutnya. Kalimat (فآمن له لوط) disebutkan di antara kisah Nabi Ibrahim. Kemudian Ibrahim menyatakan akan meninggalkan negeri dan penduduk negerinya untuk berhijrah menuju Tuhannya Yang Maha Perkasa, yang tidak terkalahkan, dan Maha Bijaksana dalam pengatur dan menciptakan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "26. فَـَٔامَنَ لَهُۥ لُوطٌ ۘ (Maka Luth membenarkan (kenabian)nya) Yakni Luth beriman kepada Ibrahim dan membenarkan segala yang ia bawa. Dan Luth adalah keponakan Ibrahim. وَقَالَ(Dan berkatalah Ibrahim) Ibrahim barkata. إِنِّى مُهَاجِرٌ إِلَىٰ رَبِّىٓ ۖ( “Sesungguhnya aku akan berpindah ke (tempat yang diperintahkan) Tuhanku (kepadaku)) Yakni berpindah dari Kutsa, sebuah kota di negeri Kufah di Irak, menuju Hiran kemudian menuju Syam, ia berpindah bersama Luth keponakannya, dan Sarah istrinya. Yakni aku akan berpindah dari negeri kaumku ke tempat yang dapat aku tempati untuk menyembah Tuhanku. إِنَّهُۥ هُوَ الْعَزِيزُ الْحَكِيمُ(sesungguhnya Dialah Yang Maha Perkasa lagi Maha Bijaksana) Yakni yang Maha perkasa yang segala perbuatan-Nya berlaku sesuai hikmah dan kebijaksanaan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "26. Maka Luth AS membenarkan risalah Ibrahim AS, lalu Ibrahim berkata: “Sesungguhnya aku berhijrah dari negeriku (Kutsa, yaitu desa dari daerah Kuffah di Iraq) menuju Harran kemudian menuju Syam, yaitu berhijrah dari rumah-rumahku menuju tempat yang diperintahkan Tuhan kepadaku supaya aku bisa menyembahNya. Sesungguhnya Tuhanku adalah Dzat yang Maha Kuat lagi Maha Perkasa yang melindungiku dari musuh-musuhku dan Maha Bijaksanan dalam penciptaan dan pengaturanNya” Ibrahim bersama dengan istrinya, Sarah dan anak dari saudaranya, Luth. Dia tinggal di Palestian dan Luth tinggal di Sodom."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "26. Maksudnya, Ibrahim terus mengajak kaumnya, sedangkan mereka melanjutkan sikap keras kepala mereka, namun berkat dakwahnya, LUth beriman kepadanya, yang kemudian Allah menjadikannya sebagai nabi dan rasul kepada kaumnya, sebagaimana akan dijelaskan kemudian. “Dan berkatalah,” Ibrahim saat melihat bahwa seruannya kepada kaumnya sudah tidak berguna lagi sedikit pun, “Sesungguhnya aku akan berpindah kepada Rabbku,” maksudnya, meninggalkan daerah yang busuk (tidak produktif) dan berpindah ke tempat yang diberkahi (produktif) yaitu negeri Syam, “sesungguhnya Dia-lah yang Mahaperkasa,” maksudnya, yang memiliki kekuatan, dan Dia kuasa memberi hidayah kepada kalian, akan tetapi Dia “Mahabijaksana,” semuanya sesuai dengan kebijaksanaanNya. Setelah Ibrahim menjauhkan diri dan meninggalkan mereka, sedangkan mereka tetap dalam keadaannya, maka Allah tidak menjelaskan tentang mereka bahwa Allah telah mengazab mereka, akan tetapi Allah menyebutkan bahwa Ibrahim menjauhkan diri dan meninggalkan mereka. Adapun hal-hal nyang disebutkan dalam riwayat isra’iliyat, bahwa Allah telah membuka pintu nyamuk terhadap mereka, lalu nyamuk-nyamuk itu menghisap darah dan memakan daging mereka serta membuat mereka musnah sama sekali, maka kebenaran riwayat ini sangat tergantung kepada (pendukung) dari dalil syar’i. sedangkan dalilnya tidak ada. Kalau seandainya Allah telah memusnahkan mereka dengan azab, tentu Dia menyebtkannya sebagaimana Dia menyebutkan pembinasaan umat-umat lain yang mendustakan. Akan tetapi, apakah termasuk rahasia dari itu semua adalah bahwa al-Khalil, Ibrahim, merupakan manusia yang paling pengasih, paling utama, paling penyantun dan paling mulia, sebab dia tidak mendoakan keburukan terhadap kaumnya sebagaimana dilakukan oleh nabi-nabi yang lain; sedangkan Allah tidak menimpakan azab yang menyeluruh karenanya? Diantara hal yang menunjukkan kepada yang demikian adalah bahwasanya Ibrahim berdialog dengan malaikat dalam masalah pembinasaan kaum Luth, dan beliau mendebat malaikat serta membela mereka (kaum Luth), padahal mereka bukan kaumnya. Allah yang lebih mengetahui kondisi yang sebenarnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Ankabut ayat 26: Allah mengabarkan bahwasanya Luth beriman dengan dakwah Ibrahim dan mengikuti Ibrahim, kemudian berkata Ibrahim : Aku meninggalkan tanah kaumku dan berhijrah untuk berdakwah kepada Allah dan agar seorang hamba beribadah kepada Tuhanku serta bertauhid. Sesungguhnya Tuhanku adalah maha kuat yang menaklukkan dan tidak ditaklukkan, Dialah Al Hakim yang meletakkan segala sesuatu pada tempatnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Nabi Ibrahim ‘alaihis salam senantiasa berdakwah kepada kaumnya, namun kaumnya senantiasa di atas pembangkangannya, hanyasaja di antara mereka ada yang beriman, yaitu Luth, yang kemudian diangkat Allah menjadi Rasul-Nya. Ketika melihat bahwa kaumnya sudah tidak bisa diharapkan lagi keimanannya. Yaitu ke Syam. Catatan: Setelah Ibrahim pergi dari negeri itu, sedangkan mereka tetap di atas kekafirannya tidak disebutkan apakah Allah membinasakan mereka dengan azab atau bagaimana selanjutnya? Adapun yang disebutkan dalam cerita Israiliyyat, bahwa Allah kemudian membuka kepada mereka pintu nyamuk untuk masuk lalu meminum darah mereka serta memakan daging mereka dan membinasakan mereka sampai akhirnya, maka untuk mengetahui kebenaran kisah ini dibutuhkan dalil dan ternyata belum kami temukan. Kalau memang Allah Subhaanahu wa Ta'aala membinasakan mereka sampai ke akar-akarnya, tentu Dia menyebutkan sebagaimana kebinasaan umat-umat yang mendustakan. Akan tetapi, mungkin rahasianya adalah bahwa Nabi Ibrahim ‘alaihis salam; karena Beliau termasuk di antara manusia yang paling sayang, paling sabar dan paling utama, maka Beliau tidak mendoakan kebinasaan untuk kaumnya. Di antara yang menunjukkan demikian adalah bahwa ketika para malaikat datang kepada Ibrahim untuk membinasakan kaum Luth, maka Ibrahim mendebat mereka dan mencoba untuk menahan mereka meskipun mereka bukan kaumnya, wallahu a’lam (lihat tafsir As Sa’diy). Dia memiliki kekuatan dan mampu menjadikan manusia memperoleh hidayah, akan tetapi sesuai dengan kebijaksanaan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Ankabut Ayat 26",
    "description": "-."
  }
]