[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Kami menganugerahkan Ishaq kepada Ibrahim menjadi putranya, dan Ya’qub setelahnya menjadi putra dari anaknya. Dan Kami menjadikan nabi-nabi dan kitab-kitab suci pada keturunannya. Dan Kami memberikan kepadanya sebagai pahala atas cobaan di jalan Kami nama yang baik di dunia dan anak yang sholeh. Dan sesungguhnya dia di akhirat kelak termasuk orang-orang yang shalih."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "27. Dan Kami karuniakan kepada Ibrahim, Isḥāq dan Ya'qūb dan Kami jadikan kenabian dan kitab-kitab yang diturunkan dari sisi Allah pada anak-anaknya sebagai balasan atas kesabarannya dalam menjalankan kebenaran di dunia, dan sesungguhnya dia di Akhirat akan mendapatkan pahala orang-orang yang saleh. Apa yang diberikan kepada Ibrahim -'alaihissalām- di dunia tidak mengurangi balasan baik yang telah disiapkan oleh Allah untuknya di Akhirat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "27. Dan Kami mengaruniakan kepada Ibrahim anak yang shalih yang bernama Ishaq dan cucu yang bernama Ya’qub. Dan Kami tetapkan pada keturunan Ibrahim terdapat para nabi yang memiliki kitab suci; Taurat, Injil, Zabur, dan al-Qur’an adalah kitab-kitab yang mengandung petunjuk, yang diturunkan kepada para nabi dari keturunan Ibrahim yang suci. Dan Allah memberinya dua balasan; balasan di dunia berupa kemenangan dalam menghadapi musuh-musuhnya, keturunan yang banyak, dan memiliki nama baik dan terhormat; dan balasan di akhirat dia akan bersama orang-orang yang shalih."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "27. وَوَهَبْنَا لَهُۥٓ إِسْحٰقَ وَيَعْقُوبَ وَجَعَلْنَا فِى ذُرِّيَّتِهِ النُّبُوَّةَ وَالْكِتٰبَ (Dan Kami anugrahkan kepda Ibrahim, Ishak dan Ya’qub, dan Kami jadikan kenabian dan Al Kitab pada keturunannya) Yakni Allah mengarunikannya beberapa anak, Allah memberinya Ismail sebagai anak pertamanya dan Ishaq anak keduanya, serta Ya’qub anak dari Ishaq; serta Allah menjadikan dalam keturunannya kenabian dan kitab, sehingga Allah tidak mengutus seorang nabi setelahnya melainkan dari garis keturunannya; dan al kitab adalah Taurat, Injil, Zabur, dan al-Qur’an. وَءَاتَيْنٰهُ أَجْرَهُۥ فِى الدُّنْيَا ۖ( dan Kami berikan kepadanya balasannya di dunia) Ibrahim dikaruniai keturunan di dunia, dan Allah mengabarkan kepadanya bahwa kenabian akan berlansung di garis keturunannya, serta seluruh agama mengaku bahwa Ibrahim bagian dari mereka, dan Allah juga memberinya di dunia amalan shalih dan akibat yang baik. وَإِنَّهُۥ فِى الْاٰخِرَةِ لَمِنَ الصّٰلِحِينَ(dan sesungguhnya dia di akhirat, benar-benar termasuk orang-orang yang saleh) Yakni yang benar-benar shalih yang berhak mendapatkan pahala yang besar dan karunia yang banyak dari Tuhan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "27. Dan Kami anugerahkan Ishaq kepada Ibrahim setelah anak sulungnya Ismail, dan Ya’kub dari keturunan Ishaq. Dan Kami menjadikan keturunan Ibrahim sebagai nabi, sehingga setiap nabi setelahnya merupakan keturunannya. Dan (kami juga memberi) kitab, yaitu Taurat, Injil, Zabur dan Al-Qur’an. Kami juga memberinya balasan di dunia, yaitu rejeki yang melimpah, anak, dan pujian yang baik di antara seluruh pemeluk agama. Dan di akhirat dia termasuk golongan orang-orang yang sempurna keshalehannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "27. “Dan Kami anugerahkan kepada Ibrahim; Ishaq dan Ya’qub,” maksudnya, setelah dia berpindah tempat ke Syam, “dan Kami jadikan kenabian dan al-Kitab pada keturunannya,” sehingga tidak ada nabi sesudahhnya kecuali dari keturunannya, dan tidak pula ada kitab suci yang diturunkan kecuali kepada keturunannya, hingga akhirnya ditutup dengan keturunannya, yaitu Muhammad, dan semoga shalawat dan salam dicurahkan kepada mereka semua. Ini merupakan kemuliaan dan kebanggaan yang paling tinggi, yaitu hidayah, rahmat, kebahagiaan, keberuntungan dan keselamatan berada pada anak keturunannya, dan melalui mereka orang-orang mendapat petunjuk, kaum beriman dapat beriman dan orang-orang shalih menjadi shalih, “dan Kami berikan padanya balasan di dunia,” berupa istri yang cantk jelita, rizki yang berlimpah, anakanak yang menjadi penyejuk hati, mengenal Allah, mencintaiNya serta berinabah kepadaNya. “Dan sesungguhnya dia di akhirat, benar-benar termasuk orang-orang yang shalih,” bahkan dia dan Muhammad adalah orang-orang shalih yang paling utama secara mutlak dan yang tertinnggi kedudukannya. Dengan demikian, Allah telah mengaruniakan kepadanya dua kebahagiaan; dunia dan akhirat. Sudah disebutkan di muka bahwa Nabi Luth beriman kepada Ibrahim dan menjadi salah seorang yang berpedoman kepadanya. Mereka (ahli tafsir. Pent) menyebutkan bahwa Luth bukan dari keturunan Ibrahim, melainkan merupakan anak dari saudara Ibrahim. Maka Firman Allah, “dan Kami jadikan kenabian dan al-kitab pada keturunannya,” sekalipun bersifat umum, namun ia tidak berlawanan dengan keberadaan Luth sebagai nabi dan rasul, walau dia bukan dari keturunan Ibrahim. Sebab, ayat ini dikemukakan dalam konteks memuji al-Khalil Ibrahim; dan juga telah diinformasikan bahwa dia mendapat petunjuk melalui Ibrahim. Sedangkan orang yang mendapat petunjuk melalui Ibrahim (langsung) tentu lebih sempurna daripada orang yang mendapat petunjuk melalui anak keturunannya bila dilihat dari sisi keutamaan sang pemberi petunjuk. Wallahu a’lam."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Ankabut ayat 27: Maka setelah Ibrahim berhijrah ke negeri Syam, maka Allah memeberinya anak keturunan yang shalih; Dan tidaklah dari Nabi kecuali diutus setelahnya anak keturunannya, dan dari keturunannya adalah Ismail yang sebagai kakek dari Nabi ﷺ, kemudian Ishaq, Ya’qub kemudian Allah mengabarkan bahwa Dia memberikan kepada Ibrahim dengan anak keturunan yang shalih di dunia, yang memiliki derajat tinggi dan baik, dan Allah jadikan bagi Ibrahim di akhirat termasuk orang-orang shalih yang tinggi derajat dan namannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Isma’il. Semua nabi setelah Ibrahim dan Luth adalah keturunan Nabi Ibrahim. Ini merupakan keutamaan yang paling agung, di mana sebab hidayah, rahmat, kebahagiaan dan keberuntungannya dijadikan pada keturunannya. Melalui tangan keturunannya, manusia banyak yang beriman. Yaitu dengan memberikan istri yang cantik, rezeki yang luas, anak cucu yang baik, kenabian yang terus menerus pada keturunannya, dan pujian yang baik di semua kalangan. Yang memperoleh derajat yang tinggi. Bahkan Beliau dan Nabi Muhammad ‘alaihimash shalaatu was salam adalah orang salih yang paling utama secara mutlak. Allah mengumpulkan kebahagiaan di dunia dan di akhirat untuknya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Ankabut Ayat 27",
    "description": "-."
  }
]