[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "28-29. Dan ingatlah (wahai rasul) Luth ketika ia berkata kepada kaumnya, “Sesungguhnya kalian benar-benar telah mengerjakan perbuatan yang amat buruk. Tidak ada seorang pun yang mendahului kalian dengan perbuatan itu dari umat-umat sebelumnya. Apakah pantas kalian mendatangi sesama lelaki melalui dubur-duubur mereka dan kalian menghambat perjalanan orang-orang musafir dengan perbuatan keji kalian tersebut, serta melakukan perbuatan-perbuatan mungkar di tempat-tempat perkumpulan kalian seperti mengolok-olok manusia, melempari orang yang melintas dan mengganggu mereka dengan ucapan-ucapan dan perbuatan-perbuatan yang tidak sopan?” dalam ayat ini terdapat pemberitahuan tidak bolehnya orang-orang berkumpul-kumpul dalam kemungkaran yang dilarang oleh Allah dan RasulNya. Maka tidak ada jawaban dari kaum Luth kepadanya selain berkata, “Datangkanlah kepada kami siksaan Allah bila kamu termasuk orang-orang yang jujur dalam perkataan yang kamu ucapkan lagi dapat mewujudkan apa yang kamu ancamkan itu.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "28. Dan ingatlah -wahai Rasul- akan Nabi Lūṭ ketika dia berkata kepada kaumnya, “Sesungguhnya kalian melakukan dosa yang sangat buruk yang tidak pernah ada seorang pun di alam semesta ini yang melakukannya sebelum kalian, maka kalian adalah orang yang menggagas dosa yang tertolak oleh fitrah yang lurus."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "28. Hai Rasulullah, sebutkanlah kisah hamba Kami yang shalih yang bernama Luth, ketika dia mencela kaumnya yang melakukan perbuatan keji sehingga mereka terbiasa melakukannya, merekalah yang pertama melakukannya karena tidak ada kaum sebelum mereka yang melakukannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "28. وَلُوطًا إِذْ قَالَ لِقَوْمِهِۦٓ إِنَّكُمْ لَتَأْتُونَ الْفٰحِشَةَ (Dan (ingatlah) ketika Luth berkata pepada kaumnya: “Sesungguhnya kamu benar-benar mengerjakan perbuatan yang amat keji) Makna (الفاحشة) adalah sifat yang benar-benar buruk. مَا سَبَقَكُم بِهَا مِنْ أَحَدٍ مِّنَ الْعٰلَمِينَ(yang belum pernah dikerjakan oleh seorangpun dari umat-umat sebelum kamu”) Yakni tidak ada yang pernah melakukan perbuatan itu sebelumnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "28. Wahai Nabi, ingatlah juga Luth AS saat berkata kepada kaumnya: ”Sesungguhnya kalian mempraktekkan perbuatan buruk yang dibenci oleh orang-orang normal yaitu homo seksual, yaitu mendatangi dubur para lelaki. Belum ada satupun orang sebelum kalian yang melakukannya\""
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "28-29. Lalu Allah mengirim Luth kepada kaumnya. Mereka di samping berbuat syirik juga melakukan perbuatan keji terhadap kaum lelaki (homoseks), merampok dan melakukan berbagai kemungkaran di majelis-majelis mereka. Lalu Luth memberi mereka nasihat agar tidak melakukan hal-hal tersebut, dan dia pun menjelaskan kepada mereka tentang keburukannya dan dampak buruk yang sangat besar yang akan ditimbulkannya. Namun mereka tidak peduli dan tidak juga mengambil pelajaran. “Maka jawaban kaumnya tidak lain hanya mengatakan, ‘Datangkanlah kepada kami azab Allah, jika kamu termasuk orang-orang yang benar.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Ankabut ayat 28: Katakan wahai Nabi Allah kepada kaummu kisah tentang Luth bersama dengan kaumnya, di mana Luth berkata kepada kaumnya : Sungguh kalian telah melakukan perbuatan keji yang menjijikkan yang belum pernah dilakukan seorang manusia pun sebelum kalian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Luth adalah anak saudara Ibrahim. Kaum Luth di samping melakukan perbuatan syirk juga mengerjakan perbuatan keji, menyamun dan melakukan perbuatan munkar di majlis mereka, maka Luth menasehati mereka tentang perkara ini dan menerangkan keburukannya serta menerangkan akibat dari perbuatan itu, namun mereka tidak berhenti dan sadar."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Ankabut Ayat 28",
    "description": "-."
  }
]