[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "28-29. Dan ingatlah (wahai rasul) Luth ketika ia berkata kepada kaumnya, “Sesungguhnya kalian benar-benar telah mengerjakan perbuatan yang amat buruk. Tidak ada seorang pun yang mendahului kalian dengan perbuatan itu dari umat-umat sebelumnya. Apakah pantas kalian mendatangi sesama lelaki melalui dubur-duubur mereka dan kalian menghambat perjalanan orang-orang musafir dengan perbuatan keji kalian tersebut, serta melakukan perbuatan-perbuatan mungkar di tempat-tempat perkumpulan kalian seperti mengolok-olok manusia, melempari orang yang melintas dan mengganggu mereka dengan ucapan-ucapan dan perbuatan-perbuatan yang tidak sopan?” dalam ayat ini terdapat pemberitahuan tidak bolehnya orang-orang berkumpul-kumpul dalam kemungkaran yang dilarang oleh Allah dan RasulNya. Maka tidak ada jawaban dari kaum Luth kepadanya selain berkata, “Datangkanlah kepada kami siksaan Allah bila kamu termasuk orang-orang yang jujur dalam perkataan yang kamu ucapkan lagi dapat mewujudkan apa yang kamu ancamkan itu.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "29. Sungguh patutkah kalian mendatangi laki-laki pada duburnya untuk memuaskan syahwat kalian, dan kalian merampok para musafir sehingga mereka tidak bisa melewati kalian karena khawatir atas pebuatan keji yang kalian lakukan, sementara kalian di dalam perkumpulan-perkumpulan kalian melakukan perbuatan mungkar seperti telanjang, mengganggu dengan ucapan dan tindakan terhadap orang yang melalui daerah kalian? Maka jawaban kaumnya kepadanya setelah dilarang dari perbuatan mungkar itu tidak lain hanyalah, “Datangkan siksa Allah yang telah kamu ancamkan kepada kami jika kamu benar atas apa yang kamu yakini.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "29. Dan Luth menegaskan pengingkarannya terhadap kaumnya atas banyaknya dosa yang mereka lakukan; mereka berhubungan intim dengan sesama lelaki melalui dubur mereka, menghalangi orang-orang yang akan melewati jalan, sebagian mereka rampas hartanya dan sebagian yang lain mereka paksa untuk berbuat keji dengan mereka; dan mereka menjadikan tempat berkumpul sebagai perkumpulan untuk menyebarkan dan menghiasi perbuatan keji mereka. Akan tetapi mereka enggan mengambil manfaat dari nasehat dan celaan serta peringatan dari siksaan Allah; mereka menjawab perkataan Luth dengan olokan: “Dimana azab Allah yang kamu ancamkan kepada kami? Jika kamu orang yang benar maka datangkanlah azab itu.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "29. أَئِنَّكُمْ لَتَأْتُونَ الرِّجَالَ (Apakah sesungguhnya kamu patut mendatangi laki-laki) Yakni berbuat keji dengan mereka. وَتَقْطَعُونَ السَّبِيلَ(dan menjadi begal) Terdapat pendapat mengatakan bahwa mereka berbuat keji dengan para musafir yang melewati kota mereka, mereka mencegah orang lain melewati negeri mereka untuk tujuan ini. Pendapat lain mengatakan bahwa mereka mencegah orang lain melewati negeri mereka untuk membunuh dan merampas hartanya. وَتَأْتُونَ فِى نَادِيكُمُ الْمُنكَرَ ۖ( dan mengerjakan kemungkaran di tempat-tempat pertemuanmu?) Terdapat pendapt mengatakan bahwa mereka melempari orang lain dengan batu-batu kecil dan mengolok-olok orang asing. Pendapat lain mengatakan bahwa mereka kentut di tempat pertemuan mereka. Pendapat lain mengatakan bahwa mereka berbuat keji dengan para lelaki di tempat pertemuan mereka, sedangkan orang lain melihat perbuatan mereka itu. Dan masih ada pendapat lainnya selain yang telah disebutkan. فَمَا كَانَ جَوَابَ قَوْمِهِۦٓ إِلَّآ أَن قَالُوا۟ ائْتِنَا بِعَذَابِ اللهِ إِن كُنتَ مِنَ الصّٰدِقِينَ(Maka jawaban kaumnya tidak lain hanya mengatakan: “Datangkanlah kepada kami azab Allah, jika kamu termasuk orang-orang yang benar”) Yakni mereka tidak menjawab kecuali dengan jawaban ini, yang menunjukkan pendustaan dan kedurhakaan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "29. Apakah kalian (Istifham yang digunakan untuk mengejek) berlaku homo dengan para lelaki, menyamun para musafir dengan menyakiti dan mengambil harta mereka serta berbuat keji kepada, dan mendatangi tempat-tempat berkumpul kalian untuk melakukan sesuatu yang mengingkari syari’at, akal, dan kebiasaan normal seperti praktek homo seksual dan berbagai macam kekejian baik dalam perkataan maupun perbuatan. Tidaklah jawaban kaum Luth kecuali berkata dengan mengejek: “Datangkanlah kepada Kami azab Allah, jika kamu benar dalam ancaman yang kamu berikan kepada kami” Dengan ucapan ini mereka kembali ingkar dan keras kepala"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "28-29. Lalu Allah mengirim Luth kepada kaumnya. Mereka di samping berbuat syirik juga melakukan perbuatan keji terhadap kaum lelaki (homoseks), merampok dan melakukan berbagai kemungkaran di majelis-majelis mereka. Lalu Luth memberi mereka nasihat agar tidak melakukan hal-hal tersebut, dan dia pun menjelaskan kepada mereka tentang keburukannya dan dampak buruk yang sangat besar yang akan ditimbulkannya. Namun mereka tidak peduli dan tidak juga mengambil pelajaran. “Maka jawaban kaumnya tidak lain hanya mengatakan, ‘Datangkanlah kepada kami azab Allah, jika kamu termasuk orang-orang yang benar.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Ankabut ayat 29: Allah menjelaskan bahwasanya mereka kaum Luth berbuat kekejian yang besar, mereka mendatangi laki-laki di dubur-dubur mereka, mereka juga mencegah para musafir yang lewat di negeri mereka dan mereka melakukan perbuatan keji terhadap mereka. Mereka mencegah para musafir yang lewat karena sebab perbuatan mereka yang keji, mereka mendatangi para musafir tersebut berkelompok dan mengajak mereka untuk berbuat keji."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sebagian ahli tafsir mengartikan menyamun di sini dengan melakukan perbuatan keji terhadap orang-orang yang lewat dalam perjalanan, karena sebagian besar mereka melakukan homoseksual dengan tamu-tamu yang datang ke kampung mereka. Ada pula yang mengartikan dengan merusak jalan keturunan karena berbuat homoseksual itu, ada ada pula yang menafsirkan, dengan menghadang orang-orang yang lewat lalu membunuh dan merampas harta mereka. Bahwa perbuatan itu keji dan bahwa azab akan turun menimpa pelakunya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Ankabut Ayat 29",
    "description": "-."
  }
]