[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sungguh Kami telah menguji umat-umat manusia sebelum mereka dan mengadakan cobaan pada mereka yang merupakan orang-orang yang Kami mengutus rasul-rasul Kami kepada mereka. Maka Allah benar-benar akan mengetahui kebenaran orang-orang yang benar dalam keimanan mereka dan kedustaan orang-orang yang mendustakan, untuk memisahkan yang satu dengan yang lain."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Dan sungguh telah Kami uji orang-orang sebelum mereka, maka sesungguhnya Allah benar-benar mengetahui dengan pengetahuan yang jelas dan mengungkapkannya kepada kalian kejujuran orang-orang yang jujur dalam keimanan mereka dan kedustaan orang-orang yang dusta dalam keimanan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "3. Sesungguhnya ujian-ujian yang disebabkan masuknya seseorang ke dalam keimanan merupakan sunnatullah yang telah berlaku pada umat-umat terdahulu, maka tidak boleh seseorang mengingkari ujian itu dan lalai dari sunnatullah. Ujian-ujian ini dinisbatkan kepada Allah karena Dia adalah pencipta sebab-sebabnya dan hanya Dia yang mampu menghilangkannya. Dan barangsiapa yang tidak terjerumus akibat ujian itu dan tetap mengikuti petunjuk maka telah jelas keteguhan imannya. Namun barangsiapa yang imannya terguncang karena takut terhadap ujian itu maka imannya telah goyah. Sungguh Allah akan mengetahui dengan ilmu yang jelas bagi makhluk -dan sesungguhnya hal itu telah Allah ketahui akan terjadi- tentang kebenaran orang-orang yang benar dan kedustaan orang-orang yang berdusta."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. وَلَقَدْ فَتَنَّا الَّذِينَ مِن قَبْلِهِمْ ۖ (Dan sesungguhnya kami telah menguji orang-orang yang sebelum mereka) Yakni ini merupakan sunnatullah pada hamba-hamba-Nya, Allah menguji orang-orang beriman dari umat ini sebagaimana telah menguji umat-umat sebelum mereka seperti yang disebutkan dalam al-Qur’an tentang kisah-kisah para Nabi dan ujian Allah terhadap pengikut mereka dan orang-orang yang beriman kepada mereka serta segala yang menimpa mereka. فَلَيَعْلَمَنَّ اللهُ الَّذِينَ صَدَقُوا۟( maka sesungguhnya Allah mengetahui orang-orang yang benar) Yakni yang benar dalam perkataan mereka “kami telah beriman” وَلَيَعْلَمَنَّ الْكٰذِبِينَ(dan sesungguhnya Dia mengetahui orang-orang yang dusta) Yakni orang-orang yang dusta diantara mereka. Yakni Allah akan menampakkan siapa yang benar diantara mereka dan akan membedakan antara dirinya dari orang-orang yang berdusta."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Sungguh Kami telah menguji umat-umat sebelum mereka dengan berbagai macam cobaan dan ujian. Maka sesungguhnya Allah menampakkan kebenaran orang-orang yang benar dan kebohongan para pendusta seta membalas setiap golongan sesuai perbuatannya. Ini adalah ilmu yang dapat disaksikan. Tidak ada pertentangan dalam Ilmu Allah yang Maha Terdahulu sebelum adanya makhluk tentang setiap sesuatu."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-3. Allah menginformasikan tentang kesempurnaan hikmah (kebijaksanaan) Nya, dan bahwa hikmahNya tidak memastikan bahwa setiap orang yang mengatakan bahwa dirinya adalah seorang Mukmin dan mengklaim iman bagi dirinya, untuk tetap dalam kondisi selamat dari cobaan dan ujian, tidak menghadapi hal-hal yang mengganggu iman mereka atau cabang-cabangnya. Sebab, kalau perkaranya seperti itu, tentu tidak dapat dibedakan mana orang yang jujur (sejati) dari orang yang dusta, antara orang yang berpegang kepada kebenaran dari orang yang berpegang kepada kebatilan. Akan tetapi, sunnah dan kebiasaannya terhadap umat-umat yang telah lalu dan terhadap umat ini adalah Dia akan menguji mereka dengan kesenangan dan kesengsaraan hidup, kesulitan dan kemudahan, hal-hal yang membuat semangat dan yang membuat benci, kekayaan dan kefakiran, dengan penguasaan musuh-musuh terhadap mereka pada saat-saat tertentu, dengan memerangi musuh dengan perkataan dan perbuatan serta dengan berbagai cobaan lainnya, yang semuanya kembali kepada cobaan syubhat yang melawan akidah, fitnah syahwat yang melawan kamauan. Maka siapa saja ketika munculnya berbagai syubhat itu imannya tetap kokoh, tidak goyah dan dia menolaknya dengan kebenaran yang dimilikinya, dan di saat munculnya syahwat (rongrongan hawa nafsu) yang menyeret dan merangsang kepada maksiat dan dosa, atau yang memalingkan dari apa-apa yang diperintahkan Allah dan RasulNya, dia berbuat sesuai dengan tuntutan iman dan ia bermujahadah (berupaya keras) melawan rongrongan nafsunya, maka hal itu membuktikan ketulusan dan kebenaran imannya. (Sebaliknya), siapa saja di saat munculnya berbagai syubhat, lalu syubhat itu menimbulkan keraguan dan kebimbangan di dalam hatinya, dan di saat munculnya rongrongan hawa nafsu, lalu nafsu itu menyeretnya kepada maksiat atau menghalanginya dari kewajiban-kewajiban agama, maka hal itu membuktikan bahwa imannya tidak benar dan tidak tulus. Manusia dalam posisi ini berbeda-beda derajatnya, tidak ada yang mengetahuinya kecuali Allah. Ada yang rendah dan ada yang tinggi. Maka kami memohon kepada Allah, semoga Dia meneguhkan kami dengan al-Qaul ats- Tsabit (tauhid) di dunia dan akhirat, dan menguhkan hati kami pada agamaNya. Sesungguhnya cobaan dan ujian bagi jiwa tak ubahnya seprti alat tempa besi yang memisahkan karat dari besi."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Ankabut ayat 3: Allah menjelaskan kepada Nabi-Nya ﷺ bahwasanya Allah memberikan ujian kepada orang-orang yang beriman sebelumnya dari pengikut para Nabi dan menguji mereka semua, semisal pengikut Nuh, Hud, Shalih dan selain dari mereka. Sebagaimana Allah menguji orang-orang yang beriman yang telah lalu dan akan diuji pengikutmu wahai Nabi Allah yang beriman, untuk penjelas mereka yang jujur dan yang dusta dan mereka akan mendapatkan balasan amalan mereka yang buruk dengan adzab yang buruk pula."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Ankabut Ayat 3",
    "description": "Dan apakah mereka menduga demikian, padahal sungguh, kami bersumpah bahwa kami telah menguji orang-orang sebelum mereka, yaitu sebelum umat nabi Muhammad, dengan tugas-tugas keagamaan dan bermacam nikmat dan cobaan, agar tampak perbedaan antara orang-orang yang benar-benar beriman dan berdusta sesuai dengan apa yang diketahuinya berdasarkan ilmu-Nya yang azali. Maka sesungguhnya Allah pasti mengetahui orang-orang yang benar dalam keimanannya dan pasti mengetahui orang-orang yang dusta. 4. Ataukah orang-orang yang mengerjakan kejahatan itu setelah kami larang mengerjakannya melalui rasul yang kami utus dan atau melalui akal sehat yang kami anugerahkan kepada manusia, mengira bahwa mereka akan dapat mendahului kami dalam usaha mereka untuk lari sehingga luput dari azab atau perhitungan kami' sangatlah buruk apa yang mereka tetapkan itu! alangkah buruknya perkiraan dan sikap me-reka ini!."
  }
]