[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dia berkata, “Wahai Tuhanku, tolonglah aku mengahadapi kaum yang melakukan kerusakan dengan menurunkan siksaan pada mereka, lantaran mereka telah mengadakan suatu perbuatan keji yang baru dan bersikeras menjalankannya terus.” Maka Allah mengabulkan doanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "30. Lūṭ -'alaihissalām- berdoa kepada Rabbnya setelah keangkuhan kaumnya dan setelah mereka menantang untuk diturunkan siksa atas mereka, sebagai pelecehan terhadapnya, “Wahai Rabbku! Tolonglah aku atas orang-orang yang berbuat kerusakan di muka bumi karena kekufuran dan kemaksiatan buruk yang mereka sebarkan.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "30. Nabi Luth memohon kepada Tuhannya agar menolongnya dalam menghadapi mereka, supaya Dia memperlihatkan kepada mereka kebenaran risalah yang dia sampaikan. Nabi Luth menyebut kaumnya sebagai orang-orang yang berbuat kerusakan, dan ini sebagai alasan pengabulan permohonannya, sebab Allah tidak menyukai orang-orang yang berbuat kerusakan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "30. قَالَ رَبِّ انصُرْنِى عَلَى الْقَوْمِ الْمُفْسِدِينَ (Luth berdoa: “Ya Tuhanku, tolonglah aku (dengan menimpakan azab) atas kaum yang berbuat kerusakan itu”) Dengan menurunkan azab-Mu kepada mereka. Kerusakan yang mereka lakukan adalah perbuatan mereka mendatangi para lelaki dan perbuatan mungkar mereka di tempat-tempat pertemuan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "30. Luth berkata: “Ya Tuhanku, tolonglah aku dengan menurunkan azabmu kepada kaum yang merusak dan suka bermaksiat dengan mendatangi lelaki dan mempraktekkan kemunkaran” Lalu Allah mengabulkan doanya dan mengutus para malaikat kepadanya untuk mengazab mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "30-35. Nabi Luth pun berputus asa dari mereka dan telah mengetahui bahwa mereka telah pantas mendapatkan azab. Dia sangat prihatin atas pendustaan yang mereka lakukan terhadapnya, maka dari itu ia mendoakan keburukan atas mereka, seraya berkata, “Ya Rabbku, tolonglah aku (dengan menimpakan azab) atas kaum yang berbuat kerusakan itu.” Allah mengabulkan doanya. Maka Allah mengutus malaikat untuk membinasakan mereka. Malaikat singgah di kediaman Ibrahim sebelum membinasakan kaum LUth. mereka memberitahukan kepadanya bahwa ia kan dikarunia Ishaq, lalu berikutnya adalah Ya’qub. Kemudian Ibrahim bertanta kepada mereka, “Kemana kalian hendak pergi?” malaikat pun memberitahu kalau mereka bermaksud akan membinasakan kaum Luth. Maka Ibrahim pun mendebat mereka dan mengatakan, “Sesunggunya di kota itu ada Luth.” Mereka menjawab, “Kami sungguh-sungguh akan menyelamatkan dia dan pengikut-pengikutnya kecuali istrinya. Dia adalah termasuk orang-orang yang tertinggal.” Lalu mereka meneruskan perjalanan hingga akhirnya sampai kepada Luth. Kedatangan mereka telah membuatnya tidak enak dan merasa sangat keberatan, sebab dia tidak mengenal mereka dan bahkan dia mengira kalau para malaikat itu adalah para musafir yang bertamu. Ia sangat mengkhawatirkan mereka dari perlakuan kaumnya. Maka kemudian para malaikat itu berkata kepadanya, “Janganlah kamu takut dan jangan pula bersedih hati,” dan mereka memberitahu kepadanya bahwa mereka adalah utusan Allah, “Sesungguhnya kami akan menyelamatkanmu dan pengikut-pengikutmu, kecuai istrimu, dia adalah termasuk orang-orang yang tertinggal. Sesungguhnya Kami akan menurunkan azab atas penduduk kota ini,” maksudnya adalah siksaan, “dari langit karena mereka berbuat fasik.” Lalu para malaikat menyuruhnya agar pergi di malam hari bersama keluarganya. Dan setelah pagi hari tiba, Allah membalik negeri mereka, bagian bawah menjadi bagian atasnya, dan Allah menurunkan hujan bebatuan dari Sijjil terhadap mereka secara berkelanjutan hingga membinasakan mereka semua. Kemudian mereka menjadi salah satu cerita malam hari dan menjadi salah satu ibrah (pelajaran dan peringatan). “Dan sesungguhnya Kami tinggalkan darinya satu tanda yang nyata bagi orang-orang yang berakal.” Maksudnya, Kami sisakan dari perkampungan negeri kaum Luth itu beberapa bekas-bekas yang nyata untuk kaum yang mampu memahami ibrah dengan hati mereka sehingga mereka dapat mengambil pelajaran darinya, sebagaimana Allah menyatakan, \"Dan sesungguhnya kamu (hai penduduk Mekah) benar-benar akan melalui (bekas-bekas) mereka di waktu pagi, dan di waktu malam. Maka apakah kamu tidak memikirkan?\" (Ash-Shaffat:137-138)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Ankabut ayat 30: Tidaklah Luth kecuali memohon kepada Tuhannya untuk menolongnya, dan menampakkan atas kaumnya yang berbuat kerusakan di bumi dengan syirik dan perbuatan keji, maksiat dan bermacam kemungkaran."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Karena sudah putus asa terhadap mereka, mengetahui keberhakan mereka untuk menerima azab dan sudah tidak sabar terhadap pendustaan dari mereka, maka Beliau mendoakan keburukan untuk mereka. Maka Allah mengabulkan doanya, Dia mengutus para malaikat untuk membinasakan mereka, namun sebelumnya mereka menemui Ibrahim dan memberikan kabar gembira kepadanya akan mendapat putra; Ishaq dan setelahnya nanti ada Ya’kub. Kemudian Nabi Ibrahim bertanya kepada mereka tentang urusan mereka selanjutnya, maka para malaikat memberitahukan, bahwa mereka hendak membinasakan kaum Luth, lalu Beliau meminta mereka mempertimbangkan kembali dan Beliau berkata, “Sesungguhnya di sana terdapat Luth.” Para malaikat menjawab, \"Kami lebih mengetahui siapa yang ada di kota itu. Kami pasti akan menyelamatkan dia dan pengikut-pengikutnya kecuali istrinya. Dia termasuk orang-orang yang tertinggal (dibinasakan).” Selanjutnya para malaikat pergi dan mendatangi Luth."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Ankabut Ayat 30",
    "description": "-."
  }
]