[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan tatkala para malaikat mendatangi Ibrahim dengan membawa berita gembira dari Allah dengan kelahiran Ishaq dan setelah Ishaq, kelahiran putranya Ya’qub. Para malaikat berkata kepada Ibrahim, “Sesungguhnya kami akan menghancurkan penduduk negeri kaum Luth ini, yaitu Sodom. Sesungguhnya penduduk negeri itu adalah orang-orang yang menzhalimi diri mereka sendiri dengan bermaksiat kepada Allah.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "31. Dan ketika Malaikat yang Kami utus datang kepada Ibrahim untuk memberinya kabar gembira dengan kelahiran Isḥāq, lalu kemudian disusul dengan kelahiran Ya'qūb, mereka berkata kepadanya, “Sesungguhnya kami akan menghancurkan penduduk negeri Sadūm, negeri kaum Lūṭ. Sesungguhnya penduduknya adalah orang-orang yang zalim karena perbuatan keji yang mereka lakukan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "31. Para malaikat mendatangi Ibrahim untuk memberi kabar gembira dari Allah bahwa dia akan dikaruniai anak bernama Ishaq dan Ishaq akan memiliki anak bernama Ya’qub. Kemudian para malaikat itu berkata: “Kami akan menjalankan perintah Allah untuk membinasakan penduduk negeri tempat Luth tinggal (negeri Sodom).” Lalu para malaikat menyebutkan asalan azab itu untuk menenangkan Ibrahim, dan dia mengetahui azab Allah tidak akan datang melainkan akibat dosa pelakunya; dan kaum Luth telah menzalimi diri mereka sendiri dengan kekafiran dan perbuatan keji, dan menzalimi orang-orang lainnya dengan menebar ketakutan kepada mereka dan memaksa mereka untuk melakukan apa yang tidak mereka sukai."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "31. وَلَمَّا جَآءَتْ رُسُلُنَآ إِبْرٰهِيمَ بِالْبُشْرَىٰ (Dan tatkala utusan Kami (para malaikat) datang kepada Ibrahim membawa kabar gembira) Yakni kabar gembira tentang kelahiran anaknya yang bernama Ishaq dan kelahiran cucunya yang bernama Ya’qub. قَالُوٓا۟ إِنَّا مُهْلِكُوٓا۟ أَهْلِ هٰذِهِ الْقَرْيَةِ ۖ( mereka mengatakan: “Sesungguhnya kami akan menghancurkan penduduk negeri ini) Yakni mereka mengatakan kepada Ibrahim perkataan ini. Dan yang dimaksud dengan negeri di sini ialah negeri Sodom yang dihuni oleh kaum Luth."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "31. Dan ketika para malaikat utusan Kami datang kepada Ibrahim dengan membawa kabar baik tentang kelahiran Ishaq dan Ya’kub setelahnya, mereka berkata kepadanya: “Sesungguhnya kami akan menghancurkan penduduk kota Luth, yaitu kota Sodom. Sesungguhnya penduduknya menzalimi diri sendiri dengan berbuat maksiat serta mengingkari dan mendustakan utusan mereka”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "30-35. Nabi Luth pun berputus asa dari mereka dan telah mengetahui bahwa mereka telah pantas mendapatkan azab. Dia sangat prihatin atas pendustaan yang mereka lakukan terhadapnya, maka dari itu ia mendoakan keburukan atas mereka, seraya berkata, “Ya Rabbku, tolonglah aku (dengan menimpakan azab) atas kaum yang berbuat kerusakan itu.” Allah mengabulkan doanya. Maka Allah mengutus malaikat untuk membinasakan mereka. Malaikat singgah di kediaman Ibrahim sebelum membinasakan kaum LUth. mereka memberitahukan kepadanya bahwa ia kan dikarunia Ishaq, lalu berikutnya adalah Ya’qub. Kemudian Ibrahim bertanta kepada mereka, “Kemana kalian hendak pergi?” malaikat pun memberitahu kalau mereka bermaksud akan membinasakan kaum Luth. Maka Ibrahim pun mendebat mereka dan mengatakan, “Sesunggunya di kota itu ada Luth.” Mereka menjawab, “Kami sungguh-sungguh akan menyelamatkan dia dan pengikut-pengikutnya kecuali istrinya. Dia adalah termasuk orang-orang yang tertinggal.” Lalu mereka meneruskan perjalanan hingga akhirnya sampai kepada Luth. Kedatangan mereka telah membuatnya tidak enak dan merasa sangat keberatan, sebab dia tidak mengenal mereka dan bahkan dia mengira kalau para malaikat itu adalah para musafir yang bertamu. Ia sangat mengkhawatirkan mereka dari perlakuan kaumnya. Maka kemudian para malaikat itu berkata kepadanya, “Janganlah kamu takut dan jangan pula bersedih hati,” dan mereka memberitahu kepadanya bahwa mereka adalah utusan Allah, “Sesungguhnya kami akan menyelamatkanmu dan pengikut-pengikutmu, kecuai istrimu, dia adalah termasuk orang-orang yang tertinggal. Sesungguhnya Kami akan menurunkan azab atas penduduk kota ini,” maksudnya adalah siksaan, “dari langit karena mereka berbuat fasik.” Lalu para malaikat menyuruhnya agar pergi di malam hari bersama keluarganya. Dan setelah pagi hari tiba, Allah membalik negeri mereka, bagian bawah menjadi bagian atasnya, dan Allah menurunkan hujan bebatuan dari Sijjil terhadap mereka secara berkelanjutan hingga membinasakan mereka semua. Kemudian mereka menjadi salah satu cerita malam hari dan menjadi salah satu ibrah (pelajaran dan peringatan). “Dan sesungguhnya Kami tinggalkan darinya satu tanda yang nyata bagi orang-orang yang berakal.” Maksudnya, Kami sisakan dari perkampungan negeri kaum Luth itu beberapa bekas-bekas yang nyata untuk kaum yang mampu memahami ibrah dengan hati mereka sehingga mereka dapat mengambil pelajaran darinya, sebagaimana Allah menyatakan, \"Dan sesungguhnya kamu (hai penduduk Mekah) benar-benar akan melalui (bekas-bekas) mereka di waktu pagi, dan di waktu malam. Maka apakah kamu tidak memikirkan?\" (Ash-Shaffat:137-138)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Ankabut ayat 31: Allah mengabarkan bahwasanya para malaikat datang membawa kabar gembira kepada Ibrahim dengan kabar akan diberikan anak keturunan yang shalih, di mana para malaikat tersebut membawa kabar akan datangnya anak keturunan yaitu Ishaq dan Ya’qub, mereka para malaikat berkata : Sungguh kami akan membinasakan penduduk kaum Luth, karena mereka melanggar akan batasan-batasan Allah, dan mereka dzalim terhadap diri-diri mereka dengan kesyirikan , kekejian dan maksiat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Ankabut Ayat 31",
    "description": "-."
  }
]