[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ibrahim berkata kepada para malaikat, “Sesungguhnya di negeri itu terdapat Luth, sedang dia bukan termasuk orang-orang yang berbuat kezhaliman.” Malaikat berkata kepadanya, “Sesungguhnya kami lebih mengetahui tentang orang yang berada di dalamnya. Kami benar-benar akan menyelamatkannya dan para pengikutnya dari kebinasaan yang akan menimpa penduduk negeri itu kecuali istrinya, dia termasuk orang-orang yang tertinggal lagi dibinasakan.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "32. Ibrahim -'alaihissalām- berkata kepada mereka, \"Sesungguhnya di dalam negeri yang ingin kalian binasakan penduduknya ada Lūṭ, dan dia bukan termasuk golongan orang-orang yang zalim.” Malaikat berkata, “Kami lebih tahu tentang siapa yang ada di dalam negeri itu, sungguh kami akan menyelamatkannya dan keluarganya dari kebinasaan yang diturunkan kepada penduduk negeri, kecuali istrinya, ia termasuk orang-orang yang tertinggal yang dibinasakan, maka kami akan membinasakannya bersama mereka.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "32. Ibrahim khawatir azab itu akan menimpa Luth juga. Maka para malaikat berkata bahwa mereka lebih mengetahui keadaan penduduk negeri itu dan mengetahui bahwa Luth berhak untuk mendapat keselamatan. Dan para malaikat itu hanya menjalankan perintah Allah, dan mereka mengetahui dengan izin Tuhan mereka bahwa tidak akan ada yang selamat kecuali Luth dan keluarganya selain istrinya yang akan ikut dibinasakan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "32. قَالَ إِنَّ فِيهَا لُوطًا ۚ (Berkata Ibrahim: “Sesungguhnya di kota itu ada Luth”) Lalu mengapa kalian akan membinasakan negeri itu? قَالُوا۟ نَحْنُ أَعْلَمُ بِمَن فِيهَا ۖ( Para malaikat berkata: “Kami lebih mengetahui siapa yang ada di kota itu) Baik itu orang baik maupun orang jahat, dan kami paling mengetahui dari yang lain tentang keberadaan Luth. لَنُنَجِّيَنَّهُۥ وَأَهْلَهُۥٓ (Kami sungguh-sungguh akan menyelamatkan dia dan pengikut-pengikutnya) Dari azab. إِلَّا امْرَأَتَهُۥ كَانَتْ مِنَ الْغٰبِرِينَ (kecuali isterinya. Dia adalah termasuk orang-orang yang tertinggal (dibinasakan)) Yakni ia termasuk orang yang tertinggal dalam azab, sehingga ia tidak dapat selamat bersama orang-orang yang selamat. Allah menetapkan istri Luth termasuk orang yang diazab dan dibinasakan karena ia membantu kaum Luth dalam melakukan kesesatan dan dosa-dosa mereka, oleh sebab itu ia layak mendapat balasan seperti balasan yang diberikan bagi kaum Luth."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "32. Ibrahim berkata kepada mereka: “Sesungguhnya dalam kota itu ada Luth, bagaimana bisa kalian akan menghancurkannya?” Mereka menjawab: “Kami lebih tahu daripada kamu tentang orang yang ada di dalamnya. Sungguh kami akan menyelamatkannya dan keluarganya dari kehancuran kecuali istrinya. Dia termasuk orang yang tinggal untuk diazab”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "30-35. Nabi Luth pun berputus asa dari mereka dan telah mengetahui bahwa mereka telah pantas mendapatkan azab. Dia sangat prihatin atas pendustaan yang mereka lakukan terhadapnya, maka dari itu ia mendoakan keburukan atas mereka, seraya berkata, “Ya Rabbku, tolonglah aku (dengan menimpakan azab) atas kaum yang berbuat kerusakan itu.” Allah mengabulkan doanya. Maka Allah mengutus malaikat untuk membinasakan mereka. Malaikat singgah di kediaman Ibrahim sebelum membinasakan kaum LUth. mereka memberitahukan kepadanya bahwa ia kan dikarunia Ishaq, lalu berikutnya adalah Ya’qub. Kemudian Ibrahim bertanta kepada mereka, “Kemana kalian hendak pergi?” malaikat pun memberitahu kalau mereka bermaksud akan membinasakan kaum Luth. Maka Ibrahim pun mendebat mereka dan mengatakan, “Sesunggunya di kota itu ada Luth.” Mereka menjawab, “Kami sungguh-sungguh akan menyelamatkan dia dan pengikut-pengikutnya kecuali istrinya. Dia adalah termasuk orang-orang yang tertinggal.” Lalu mereka meneruskan perjalanan hingga akhirnya sampai kepada Luth. Kedatangan mereka telah membuatnya tidak enak dan merasa sangat keberatan, sebab dia tidak mengenal mereka dan bahkan dia mengira kalau para malaikat itu adalah para musafir yang bertamu. Ia sangat mengkhawatirkan mereka dari perlakuan kaumnya. Maka kemudian para malaikat itu berkata kepadanya, “Janganlah kamu takut dan jangan pula bersedih hati,” dan mereka memberitahu kepadanya bahwa mereka adalah utusan Allah, “Sesungguhnya kami akan menyelamatkanmu dan pengikut-pengikutmu, kecuai istrimu, dia adalah termasuk orang-orang yang tertinggal. Sesungguhnya Kami akan menurunkan azab atas penduduk kota ini,” maksudnya adalah siksaan, “dari langit karena mereka berbuat fasik.” Lalu para malaikat menyuruhnya agar pergi di malam hari bersama keluarganya. Dan setelah pagi hari tiba, Allah membalik negeri mereka, bagian bawah menjadi bagian atasnya, dan Allah menurunkan hujan bebatuan dari Sijjil terhadap mereka secara berkelanjutan hingga membinasakan mereka semua. Kemudian mereka menjadi salah satu cerita malam hari dan menjadi salah satu ibrah (pelajaran dan peringatan). “Dan sesungguhnya Kami tinggalkan darinya satu tanda yang nyata bagi orang-orang yang berakal.” Maksudnya, Kami sisakan dari perkampungan negeri kaum Luth itu beberapa bekas-bekas yang nyata untuk kaum yang mampu memahami ibrah dengan hati mereka sehingga mereka dapat mengambil pelajaran darinya, sebagaimana Allah menyatakan, \"Dan sesungguhnya kamu (hai penduduk Mekah) benar-benar akan melalui (bekas-bekas) mereka di waktu pagi, dan di waktu malam. Maka apakah kamu tidak memikirkan?\" (Ash-Shaffat:137-138)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Ankabut ayat 32: Akan tetapi Ibrahim berkata kepada mereka para malaikat : Sungguh negeri tersebut padanya terdapat Nabi Luth, maka para malaikat menjawab : Kami lebih mengetahui akan kondisi penduduk negeri tersebut, kami akan menyelamatkannya berserta keluarganya dari adzab kecuali istrinya yang dia akan disempurnakan adzabnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Ankabut Ayat 32",
    "description": "-."
  }
]