[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan tatkala malaikat-malaikat itu mendatangi Luth, hal itu menggelisahkannya. Sebab dia menduga mereka adalah tamu-tamu dari bangsa manusia. Dan dia bersedih hati karena keberadaan mereka, lantaran dia tahu keburukan tindakan kaumnya. Dan mereka berkata, “Janganlah kamu mengkhawatirkan kami. Kaummu tidak akan sanggup menyentuh kami. Dan janganlah bersedih hati dari berita yang kami sampaikan kepadamu bahwa kami akan membinasakan mereka. Sesungguhnya kami akan menyelamatkanmu dari siksaan yang menimpa kaummu, dan menyelamatkan keluargamu kecuali istrimu. Sesungguhnya dia akan binasa bersama orang-orang yang binasa dari kaummu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "33. Ketika para Malaikat yang Kami utus untuk membinasakan kaum Lūṭ mendatangi Lūṭ, kedatangan mereka ini menjadikannya gelisah dan sedih, karena dia khawatir gangguan buruk kaumnya terhadap mereka. Para utusan tersebut mendatanginya dalam bentuk lelaki sementara kaumnya menggauli lelaki untuk melampiaskan nafsunya, bukan kepada wanita. Dan para Malaikat berkata kepadanya, “Jangan takut! Kaummu tidak akan bisa mengganggumu dan janganlah kamu bersedih karena kabar dari kami yang akan membinasakan mereka. Sesungguhnya kami akan menyelamatkanmu dan keluargamu dari kebinasaan, kecuali istrimu, ia termasuk orang-orang yang tertinggal yang dibinasakan, maka kami akan membinasakannya bersama mereka.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "33. Para malaikat itu mendatangi negeri Luth dan pergi menuju Luth, namun kedatangan para malaikat itu membuat Luth tidak senang, karena dia mengira para tamu itu adalah manusia sehingga mereka bisa saja akan mendapat gangguan dari kaumnnya sebagaimana yang biasa mereka lakukan terhadap orang lain. Maka para malaikat itu berkata kepadanya: “Janganlah kamu mengkhawatirkan kami dari mereka, sebab mereka tidak akan mampu mengganggu kami.” Kemudian mereka menyampaikan kepadanya apa yang akan mereka lakukan dan menjamin keselamatannya sebelum memberitahukan azab bagi kaumnya, dan menjamin keselamatan keluarganya selain istrinya yang akan ikut dibinasakan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "33. وَلَمَّآ أَن جَآءَتْ رُسُلُنَا لُوطًا سِىٓءَ بِهِمْ (Dan tatkala datang utusan-utusan Kami (para malaikat) itu kepada Luth, dia merasa susah karena (kedatangan) mereka) Yakni Luth didatangi sesuatu yang membuatnya susah dan khawatir, sebab ia menyangka para malaikat itu adalah manusia, sehingga ia mengkhawatirkan mereka dari kaumnya, sebab mereka menyerupa sebagai manusia yang sangat tampan. وَضَاقَ بِهِمْ ذَرْعًا(dan (merasa) tidak punya kekuatan untuk melindungi mereka) Yakni tidak mampu mengatur mereka dan merasa sedih dan sempit dadanya. وَقَالُوا۟ لَا تَخَفْ وَلَا تَحْزَنْ ۖ (dan mereka berkata: “Janganlah kamu takut dan jangan (pula) susah) Yakni janganlah kamu mengkhawatirkan kami dari kaummu dan janganlah bersedih hati, sebab mereka tidak akan mampu melawan kami. إِنَّا مُنَجُّوكَ وَأَهْلَكَ (Sesungguhnya kami akan menyelamatkan kamu dan pengikut-pengikutmu) Dari azab yang Allah perintahkan kepada kami untuk menimpakannya pada mereka. إِلَّا امْرَأَتَكَ كَانَتْ مِنَ الْغٰبِرِينَ (kecuali isterimu, dia adalah termasuk orang-orang yang tertinggal (dibinasakan)”) Para malaikat itu memberi tahu Luth bahwa mereka akan membinasakan kaumnya serta menyelamatkan dirinya dan keluarganya kecuali istrinya, sebagaimana mereka memberi tahu Ibrahim tentang hal ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "33. Saat para malaikat utusan Kami datang kepada Luth dengan wujud pemuda tampan yang sudah matang. Dia (Luth) kesal dengan (penampilan) mereka dan kesusahan untuk menyembunyikan mereka dari kaumnya. Dia kesal dan sedih menampung mereka karena takut tidak mampu menjaga mereka dari fitnah kaumnya. Mereka (malaikat) berkata kepadanya: “Sesungguhnya Kami adalah utusan-utusan Tuhanmu. Jangan mengkhawatirkan kami dari kaummu dan janganlah bersedih, sesungguhnya mereka tidak mampu menangkap kami. Sesungguhnya kami adalah penolong-penolongmu dan keluargamu dari kehancuran kecuali istrimu yang termasuk orang yang tinggal untuk diazab.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "30-35. Nabi Luth pun berputus asa dari mereka dan telah mengetahui bahwa mereka telah pantas mendapatkan azab. Dia sangat prihatin atas pendustaan yang mereka lakukan terhadapnya, maka dari itu ia mendoakan keburukan atas mereka, seraya berkata, “Ya Rabbku, tolonglah aku (dengan menimpakan azab) atas kaum yang berbuat kerusakan itu.” Allah mengabulkan doanya. Maka Allah mengutus malaikat untuk membinasakan mereka. Malaikat singgah di kediaman Ibrahim sebelum membinasakan kaum LUth. mereka memberitahukan kepadanya bahwa ia kan dikarunia Ishaq, lalu berikutnya adalah Ya’qub. Kemudian Ibrahim bertanta kepada mereka, “Kemana kalian hendak pergi?” malaikat pun memberitahu kalau mereka bermaksud akan membinasakan kaum Luth. Maka Ibrahim pun mendebat mereka dan mengatakan, “Sesunggunya di kota itu ada Luth.” Mereka menjawab, “Kami sungguh-sungguh akan menyelamatkan dia dan pengikut-pengikutnya kecuali istrinya. Dia adalah termasuk orang-orang yang tertinggal.” Lalu mereka meneruskan perjalanan hingga akhirnya sampai kepada Luth. Kedatangan mereka telah membuatnya tidak enak dan merasa sangat keberatan, sebab dia tidak mengenal mereka dan bahkan dia mengira kalau para malaikat itu adalah para musafir yang bertamu. Ia sangat mengkhawatirkan mereka dari perlakuan kaumnya. Maka kemudian para malaikat itu berkata kepadanya, “Janganlah kamu takut dan jangan pula bersedih hati,” dan mereka memberitahu kepadanya bahwa mereka adalah utusan Allah, “Sesungguhnya kami akan menyelamatkanmu dan pengikut-pengikutmu, kecuai istrimu, dia adalah termasuk orang-orang yang tertinggal. Sesungguhnya Kami akan menurunkan azab atas penduduk kota ini,” maksudnya adalah siksaan, “dari langit karena mereka berbuat fasik.” Lalu para malaikat menyuruhnya agar pergi di malam hari bersama keluarganya. Dan setelah pagi hari tiba, Allah membalik negeri mereka, bagian bawah menjadi bagian atasnya, dan Allah menurunkan hujan bebatuan dari Sijjil terhadap mereka secara berkelanjutan hingga membinasakan mereka semua. Kemudian mereka menjadi salah satu cerita malam hari dan menjadi salah satu ibrah (pelajaran dan peringatan). “Dan sesungguhnya Kami tinggalkan darinya satu tanda yang nyata bagi orang-orang yang berakal.” Maksudnya, Kami sisakan dari perkampungan negeri kaum Luth itu beberapa bekas-bekas yang nyata untuk kaum yang mampu memahami ibrah dengan hati mereka sehingga mereka dapat mengambil pelajaran darinya, sebagaimana Allah menyatakan, \"Dan sesungguhnya kamu (hai penduduk Mekah) benar-benar akan melalui (bekas-bekas) mereka di waktu pagi, dan di waktu malam. Maka apakah kamu tidak memikirkan?\" (Ash-Shaffat:137-138)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Ankabut ayat 33: Kemudian para malaikat datang kepada Luth dalam bentuk manusia yang bertamu kepada Luth. Luth sangat bersedih, dan takut kepada mereka para malaikat karena keburukan kaumnya. Para malaikat mengabarkan bahwasanya mereka adalah utusan Allah dengan berkata : Janganlah kalian takut kepada kami atas urusan kaummu dan jangan pula bersedih, kami akan menyelamatkan dirimu dan keluargamu dari adzan dan kebinasaan yang akan menimpa kaummu kecuali istrimu yang untuknya akan disempurnakan adzab."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Nabi Luth ‘alaihis salam merasa bersedih hati karena kedatangan para utusan Allah itu, di mana mereka berupa pemuda yang rupawan sedangkan kaum Luth sangat menyukai pemuda-pemuda yang rupawan untuk melakukan homoseksual. Beliau merasa tidak sanggup melindungi mereka jika ada gangguan dari kaumnya, maka para malaikat itu memberitahukan kepada Luth, bahwa mereka adalah para utusan Allah ‘Azza wa Jalla."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Ankabut Ayat 33",
    "description": "-."
  }
]