[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya kami akan menimpakan siksaan dari langit pada penduduk negeri ini, disebabkan kemaksiatan mereka kepada Allah dan perbuatan keji mereka.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "34. Sesungguhnya Kami akan menurunkan siksa dari langit atas penduduk negeri ini yang telah melakukan perbuatan keji, berupa bebatuan dari tanah yang terbakar membara, sebagai balasan atas pengingkaran mereka terhadap ketaatan kepada Allah dengan melakukan perbuatan keji yang buruk, yaitu menggauli lelaki untuk melampiaskan syahwat, bukan kepada wanita.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "34. Para malaikat itu melanjutkan perkataan mereka tentang azab yang pedih yang akan mereka turunkan dari langit sehingga menimpa kaum Luth akibat kemaksiatan mereka dan kesesatan mereka dari jalan yang lurus."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "34. إِنَّا مُنزِلُونَ عَلَىٰٓ أَهْلِ هٰذِهِ الْقَرْيَةِ رِجْزًا مِّنَ السَّمَآءِ (Sesungguhnya Kami akan menurunkan azab dari langit atas penduduk kota ini) Yaitu dengan melempari mereka dengan batu. Pendapat lain mengatakan, yaitu dengan membakar mereka dengan api yang datang dari langit. Dan pendapat lain mengatakan, yaitu dengan menenggelamkan mereka ke dalam tanah dan menimpa mereka dengan angin yang membawa bebatuan, sebagaimana disebutkan pada ayat yang lain. بِمَا كَانُوا۟ يَفْسُقُونَ (karena mereka berbuat fasik) Yakni disebabkan kefasikan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "34. Sesungguhnya Kami akan menurunkan azab yang sangat pedih dari langit berupa hujan batu kerikil kepada penduduk kota ini akibat kerusakan mereka, yaitu menjatuhi dan melempari mereka dengan batu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "30-35. Nabi Luth pun berputus asa dari mereka dan telah mengetahui bahwa mereka telah pantas mendapatkan azab. Dia sangat prihatin atas pendustaan yang mereka lakukan terhadapnya, maka dari itu ia mendoakan keburukan atas mereka, seraya berkata, “Ya Rabbku, tolonglah aku (dengan menimpakan azab) atas kaum yang berbuat kerusakan itu.” Allah mengabulkan doanya. Maka Allah mengutus malaikat untuk membinasakan mereka. Malaikat singgah di kediaman Ibrahim sebelum membinasakan kaum LUth. mereka memberitahukan kepadanya bahwa ia kan dikarunia Ishaq, lalu berikutnya adalah Ya’qub. Kemudian Ibrahim bertanta kepada mereka, “Kemana kalian hendak pergi?” malaikat pun memberitahu kalau mereka bermaksud akan membinasakan kaum Luth. Maka Ibrahim pun mendebat mereka dan mengatakan, “Sesunggunya di kota itu ada Luth.” Mereka menjawab, “Kami sungguh-sungguh akan menyelamatkan dia dan pengikut-pengikutnya kecuali istrinya. Dia adalah termasuk orang-orang yang tertinggal.” Lalu mereka meneruskan perjalanan hingga akhirnya sampai kepada Luth. Kedatangan mereka telah membuatnya tidak enak dan merasa sangat keberatan, sebab dia tidak mengenal mereka dan bahkan dia mengira kalau para malaikat itu adalah para musafir yang bertamu. Ia sangat mengkhawatirkan mereka dari perlakuan kaumnya. Maka kemudian para malaikat itu berkata kepadanya, “Janganlah kamu takut dan jangan pula bersedih hati,” dan mereka memberitahu kepadanya bahwa mereka adalah utusan Allah, “Sesungguhnya kami akan menyelamatkanmu dan pengikut-pengikutmu, kecuai istrimu, dia adalah termasuk orang-orang yang tertinggal. Sesungguhnya Kami akan menurunkan azab atas penduduk kota ini,” maksudnya adalah siksaan, “dari langit karena mereka berbuat fasik.” Lalu para malaikat menyuruhnya agar pergi di malam hari bersama keluarganya. Dan setelah pagi hari tiba, Allah membalik negeri mereka, bagian bawah menjadi bagian atasnya, dan Allah menurunkan hujan bebatuan dari Sijjil terhadap mereka secara berkelanjutan hingga membinasakan mereka semua. Kemudian mereka menjadi salah satu cerita malam hari dan menjadi salah satu ibrah (pelajaran dan peringatan). “Dan sesungguhnya Kami tinggalkan darinya satu tanda yang nyata bagi orang-orang yang berakal.” Maksudnya, Kami sisakan dari perkampungan negeri kaum Luth itu beberapa bekas-bekas yang nyata untuk kaum yang mampu memahami ibrah dengan hati mereka sehingga mereka dapat mengambil pelajaran darinya, sebagaimana Allah menyatakan, \"Dan sesungguhnya kamu (hai penduduk Mekah) benar-benar akan melalui (bekas-bekas) mereka di waktu pagi, dan di waktu malam. Maka apakah kamu tidak memikirkan?\" (Ash-Shaffat:137-138)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Ankabut ayat 34: Ketahuilah bahwasanya Kami akan menurunkan adzab kepada penduduk negeri ini dengan adzab dari langit, yang mereka dilempari dengan bebatuan sijjil dari langit karena sebab kefasikan mereka dan keluarnya mereka dari tauhid dan taat kepada Allah, kemudian para malaikat membalikkan negeri mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maka para malaikat memerintahkan Luth untuk pergi di malam hari membawa keluarganya selain istrinya. Ketika tiba pagi harinya, Allah Subhaanahu wa Ta'aala membalik negeri mereka, Dia menjungkirbalikkan bagian atas ke bawah dan penduduknya dihujani batu dari tanah yang keras secara bertubi-tubi sehingga mereka semua binasa, maka jadilah mereka bahan pembicaraan dan pelajaran bagi generasi setelah mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Ankabut Ayat 34",
    "description": "-."
  }
]