[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sungguh Kami telah mempertahankan beberapa bekas peninggalan nyata dari perkampungan kaum Luth bagi kaum yang mau memikirkan pelajaran-pelajaran dari kejadian tersebut, sehingga mereka mendapatkan manfaat darinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "35. Dan sungguh Kami telah meninggalkan dari negeri yang telah Kami hancurkan ini tanda yang nyata bagi kaum yang berakal, karena orang yang berakal inilah yang bisa mengambil pelajaran dari setiap peristiwa tanda-tanda (kekuasaan Allah)."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "35. Kami telah menyisakan sisa-sisa di negeri itu sebagai tanda yang menjelaskan hasil dari kemaksiatan, agar orang-orang yang berakal sehat dapat mengambil pelajaran darinya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "35. وَلَقَد تَّرَكْنَا مِنْهَآ ءَايَةًۢ بَيِّنَةً (Dan sesungguhnya Kami tinggalkan daripadanya satu tanda yang nyata) Yakni Kami sisakan dari negeri itu setelah Kami binasakan tanda dan bukti yang jelas, yaitu sisa-sisa bebatuan yang digunakan untuk menimpa negeri itu dan bangunan-bangunan yang telah roboh, serta sisa-sisa tanah yang dibalikkan di atas mereka; hal ini agar menjadi pelajaran bagi orang-orang yang memiliki akal yang sehat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "35. Sungguh setelah menghancurkan menghancurkan kota itu kami menyisakan pertanda, pelajaran dan nasehat yang jelas berupa sisa-sisa batu yang dilemparkan kepada mereka dan reruntuhan rumah-rumah bagi kaum yang menggunakan akal mereka untuk mempelajarinya."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "30-35. Nabi Luth pun berputus asa dari mereka dan telah mengetahui bahwa mereka telah pantas mendapatkan azab. Dia sangat prihatin atas pendustaan yang mereka lakukan terhadapnya, maka dari itu ia mendoakan keburukan atas mereka, seraya berkata, “Ya Rabbku, tolonglah aku (dengan menimpakan azab) atas kaum yang berbuat kerusakan itu.” Allah mengabulkan doanya. Maka Allah mengutus malaikat untuk membinasakan mereka. Malaikat singgah di kediaman Ibrahim sebelum membinasakan kaum LUth. mereka memberitahukan kepadanya bahwa ia kan dikarunia Ishaq, lalu berikutnya adalah Ya’qub. Kemudian Ibrahim bertanta kepada mereka, “Kemana kalian hendak pergi?” malaikat pun memberitahu kalau mereka bermaksud akan membinasakan kaum Luth. Maka Ibrahim pun mendebat mereka dan mengatakan, “Sesunggunya di kota itu ada Luth.” Mereka menjawab, “Kami sungguh-sungguh akan menyelamatkan dia dan pengikut-pengikutnya kecuali istrinya. Dia adalah termasuk orang-orang yang tertinggal.” Lalu mereka meneruskan perjalanan hingga akhirnya sampai kepada Luth. Kedatangan mereka telah membuatnya tidak enak dan merasa sangat keberatan, sebab dia tidak mengenal mereka dan bahkan dia mengira kalau para malaikat itu adalah para musafir yang bertamu. Ia sangat mengkhawatirkan mereka dari perlakuan kaumnya. Maka kemudian para malaikat itu berkata kepadanya, “Janganlah kamu takut dan jangan pula bersedih hati,” dan mereka memberitahu kepadanya bahwa mereka adalah utusan Allah, “Sesungguhnya kami akan menyelamatkanmu dan pengikut-pengikutmu, kecuai istrimu, dia adalah termasuk orang-orang yang tertinggal. Sesungguhnya Kami akan menurunkan azab atas penduduk kota ini,” maksudnya adalah siksaan, “dari langit karena mereka berbuat fasik.” Lalu para malaikat menyuruhnya agar pergi di malam hari bersama keluarganya. Dan setelah pagi hari tiba, Allah membalik negeri mereka, bagian bawah menjadi bagian atasnya, dan Allah menurunkan hujan bebatuan dari Sijjil terhadap mereka secara berkelanjutan hingga membinasakan mereka semua. Kemudian mereka menjadi salah satu cerita malam hari dan menjadi salah satu ibrah (pelajaran dan peringatan). “Dan sesungguhnya Kami tinggalkan darinya satu tanda yang nyata bagi orang-orang yang berakal.” Maksudnya, Kami sisakan dari perkampungan negeri kaum Luth itu beberapa bekas-bekas yang nyata untuk kaum yang mampu memahami ibrah dengan hati mereka sehingga mereka dapat mengambil pelajaran darinya, sebagaimana Allah menyatakan, \"Dan sesungguhnya kamu (hai penduduk Mekah) benar-benar akan melalui (bekas-bekas) mereka di waktu pagi, dan di waktu malam. Maka apakah kamu tidak memikirkan?\" (Ash-Shaffat:137-138)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Ankabut ayat 35: Allah mengabarkan bahwa Dia menjadikan dari negeri ini bekas-bekas yang Nampak yang menunjukkan atas kebinasaan mereka; Agar dapat diambil pelajaran bagi orang yang mengambil pelajaran. Dan juga bagi para pemiliki akal yang sehat dan fitrah yang selamat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya, bekas-bekas runtuhan kota Sodom, negeri kaum Luth. Hal ini sebagaimana firman Allah Ta’ala di surah Ash Shaaffat: 137-138, “Dan sesungguhnya kamu (hai penduduk Mekah) benar-benar melalui (bekas-bekas) mereka di waktu pagi,-- dan di waktu malam. Maka apakah kamu tidak memikirkan?"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Ankabut Ayat 35",
    "description": "-."
  }
]