[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Kami telah mengutus kepada negeri Madyan saudara mereka, yaitu Syu’aib. Maka dia berkata berkata kepada mereka, “Hai kaumku, beribadahlah kepada Allah semata, dan murnikanlah ibadah bagiNya. Kalian tidak punya sesembahan selainNya. Dan berharaplah dengan ibadah yang kalian kerjakan untuk memperoleh pahala pada Hari Akhir. Dan janganlah kalian banyak berbuat kerusakan dan maksiat di muka bumi. Dan janganlah kalian mengerjakannya terus menerus. Akan tetapi, bertaubatlah kepada Allah dari perbuatan itu dan kemabalilah (kepadaNya).”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "36. Dan telah Kami utus kepada kaum Madyan saudara mereka senasab, yaitu Syu'aib -'alaihissalām-, dia berkata kepada kaumnya, “Wahai kaumku! Sembahlah Allah semata dan mohonlah balasan di hari Akhir dengan ibadah kalian kepada Allah, serta janganlah kalian membuat kerusakan di muka bumi dengan melakukan kemaksiatan dan menyebarkannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "36. Dan Kami mengutus kepada negeri Madyan saudara mereka -yang bernama Syuaib- agar menjadi seorang rasul yang menyampaikan nasehat bagi mereka. Dia mengajak mereka untuk menyembah Allah semata dan menyiapkan diri untuk hari kebangkitan dan hari menghadap Allah, dan memperingatkan mereka agar menjauhi segala kerusakan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "36. وَإِلَىٰ مَدْيَنَ أَخَاهُمْ شُعَيْبًا (Dan (Kami telah mengutus) kepada penduduk Mad-yan, saudara mereka Syu’aib) Yakni dan Kami telah mengutus Syuaib kepada kaumnya. فَقَالَ يٰقَوْمِ اعْبُدُوا۟ اللهَ (maka ia berkata: “Hai kaumku, sembahlah olehmu Allah) Yakni esakanlah Allah dalam ibadah dan jadikan itu hanya untuk-Nya. وَارْجُوا۟ الْيَوْمَ الْاٰخِرَ (harapkanlah (pahala) hari akhir) Yakni harapkanlah pahala hari akhir dan berbuatlah amal kebaikan untuk mencegahmu dari azab di hari itu. وَلَا تَعْثَوْا۟ فِى الْأَرْضِ مُفْسِدِينَ(dan jangan kamu berkeliaran di muka bumi berbuat kerusakan”) Makna (العثو) yakni kerusakan yang sangat berat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "36. Kami mengutus kepada kota Madyan saudara mereka sendiri yang berasal dari suku dan nasab yang sama, yaitu Syu’aib. Dia berkata kepada mereka: “Wahai kaumku, menyembahlah hanya kepada Allah. Tidak ada sekutu bagiNya dan kerjakanlah sesuatu yang kalian harapkan berupa pahara hari akhir. Dan janganlah mengerjakan kerusakan terburuk di bumi.” Kata {Mufsidin} adalah Haal yang menegaskan amilnya dan memberikan makna ketetapan atas kerusakan. Dan kata Ta’tsau berasal dari kata ‘Atsiya, seperti Ta’iba Yat’abu. ‘Atswu dan ‘Atsyu adalah separah-parah kerusakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "36-37. Maksudnya, “Dan,” Kami mengutus “kepada penduduk Madyan,” suatu suku yang sangat terkenal, “Syu’aib,” lalu dia memerintah mereka untuk beribadah kepada Allah saja, tiada sekutu bagiNya, dan berima kepada kebangkitan (sesudah kematian), mengharapkannya dan beramal untuk menghadapinya. Dan dia pun melarang mereka berbuat kerusakan di muka bumi ini, seperti berbuat curang dalam takar-menakar dan timbang menimbang serta melakukan perompakan di jalan-jalan. “Maka mereka mendustakannya,” lalu mereka ditimpa azab Allah, “maka jadilah mereka mayat-mayat yang bergelimpangan di tempat-tempat tinggal mereka.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Ankabut ayat 36: Allah mengabarkan bahwasanya Dia mengutus di Madain saudara-saudara mereka Syua’ib, dia menyeru kepada kaumnya kepada iman dan tauhid dengan berkata kepada mereka : Wahai kaumku, esakan Allah, tunggalkan dalam peribadatan, jaganlah kalian menyekutukan-Nya dengan apapun, berimanlah kepada hari akhir, takutlah kalian kepada urusan yang dahsyat, berharaplah dengan pahala Allah dan karunia-Nya, janganlah kalian berbuat kerusakan dengan amalan-amalan kalian di bumi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Beliau memerintahkan mereka beribadah kepada Allah saja, beriman kepada kebangkitan dan berharap pahala di hari itu dan takut terhadap peristiwa di hari itu, beramal untuk menghadapinya, serta melarang mereka berbuat kerusakan di bumi dengan melakukan kemaksiatan, seperti mengurangi takaran dan timbangan, mebegal jalan, dsb. Bisa juga diartikan, takutlah kepada hari Kiamat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Ankabut Ayat 36",
    "description": "-."
  }
]