[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka penduduk Madyan mendustakan syuaib dalam perkara yang dibawanya diri Allah berupa risalah, maka merepa ditimpa gempa yagn besar sekali, maka negeri mereka menjadi hancur dan binasa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "37. Lalu kaumnya mendustakannya, maka mereka pun ditimpa gempa sehingga mereka bergelimpangan jatuh dengan muka mereka tersungkur ke tanah, meninggal tak bergerak di rumah-rumah mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "37. Akan tetapi kaum Nabi Syuaib menentang dakwahnya dan terus menerus mendustakannya, sehingga mereka tertimpa gempa dahsyat sehingga mereka semua mati bergelimpangan di dalam rumah mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "37. فَأَخَذَتْهُمُ الرَّجْفَةُ (lalu mereka ditimpa gempa yang dahsyat) Yakni gempa yang disebabkan teriakan malaikat Jibril. فَأَصْبَحُوا۟ فِى دَارِهِمْ جٰثِمِينَ (dan jadilah mereka mayat-mayat yang bergelimpangan di tempat-tempat tinggal mereka) Yakni mati tergeletak tertelungkup di atas tanah di negeri atau di rumah-rumah mereka seperti burung-burung yang mati."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "37. Lalu mereka mendustakan Syu’aib, kemudian mereka ditimpa gempa, yaitu guncangan dahsyat melalui teriakan Jibril yang mengakibatkan gempa. Kemudian mereka menjadi tumpukan-tumpukan mayat dalam rumah-rumah mereka."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "36-37. Maksudnya, “Dan,” Kami mengutus “kepada penduduk Madyan,” suatu suku yang sangat terkenal, “Syu’aib,” lalu dia memerintah mereka untuk beribadah kepada Allah saja, tiada sekutu bagiNya, dan berima kepada kebangkitan (sesudah kematian), mengharapkannya dan beramal untuk menghadapinya. Dan dia pun melarang mereka berbuat kerusakan di muka bumi ini, seperti berbuat curang dalam takar-menakar dan timbang menimbang serta melakukan perompakan di jalan-jalan. “Maka mereka mendustakannya,” lalu mereka ditimpa azab Allah, “maka jadilah mereka mayat-mayat yang bergelimpangan di tempat-tempat tinggal mereka.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Ankabut ayat 37: Akan tetapi penduduk Madain mendustakan Nabi mereka, dan tidak beriman dengan apa yang telah datang kepada mereka, maka Allah timpaka adzab kepada mereka, Allah berikan gempa bumi yang keras, mereka terombang-ambing dan binasa, maka jadilah negeri mereka seperti benda-benda mati yang mayat-mayat mereka tergeletak."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Ankabut Ayat 37",
    "description": "-."
  }
]