[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kami (juga) telah membinasakan kaum Ad dan Tsamud. Dan sungguh telah menjadi jelas bagi kalian kehancuran dan tidak berpenghuninya pemukiman mereka, dan datangnya siksaan Kami pada mereka semua. Dan setan menjadikan perbuatan-perbuatan buruk mereka indah pada pandangan mereka. Lalu dia menghalangi mereka dari jalan Allah dan jalan keimanan kepadaNya dan kepada RasulNya. Dan mereka adalah orang-orang yang paham akan kekafiran dan kesesatan mereka juga terkagum dengannya. Mereka berasumsi bahwa diri mereka berada di atas petunjuk dan kebenaran, padahal mereka itu sebenarnya tenggelam di dalam kesesatan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "38. Dan Kami juga telah membinasakan 'Ād, kaum Nabi Hūd dan Ṡamūd kaum Nabi Ṣāleḥ. Maka telah nyata bagi kalian -wahai penduduk Makkah- dari bekas tempat-tempat tinggal mereka di Al-Ḥijr dan Asy-Syiḥr di Haḍramaut yang menunjukkan kepada kalian kebinasaan mereka. Tempat-tempat tinggal mereka yang kosong sebagai saksi atas peristiwa itu. Setan telah menghiasi amal perbuatan yang mereka kerjakan, berupa kekafiran dan kemaksiatan lainnya, lalu setan mengalihkan mereka dari jalan yang lurus, padahal mereka adalah orang-orang yang mempunyai pengetahuan terhadap yang benar dan yang sesat, serta yang lurus dan yang bengkok, karena para Rasul mereka telah mengajari mereka, akan tetapi mereka memilih untuk mengikuti nafsu daripada mengikuti petunjuk."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "38. Ayat-ayat ini menyebutkan kaum-kaum yang mendustakan dan menjelaskan kesudahan mereka. Inilah kaum ‘Ad dan Tsamud, orang yang menyaksikan tempat tinggal mereka akan mengetahui kehancuran yang menimpa mereka semua, tempat tinggal itu telah kosong dari mereka. Kesudahan ini tidak akan terjadi kecuali setelah setan telah berhasil menghiasi perbuatan buruk yang mereka lakukan, sehingga akal dan hati mereka tidak bermanfaat lagi dan kesesatan timbul di antara mereka yang membuat mereka terpukau dengan keyakinan yang mereka anut."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "38. وَعَادًا وَثَمُودَا۟ (Dan (juga) kaum ‘Aad dan Tsamud) Yakni dan Kami telah membinasakan kaum ‘Aad dan Tsamud. وَقَد تَّبَيَّنَ لَكُم مِّن مَّسٰكِنِهِمْ ۖ( dan sungguh telah nyata bagi kamu (kehancuran mereka) dari (puing-puing) tempat tinggal mereka) Yakni dan telah jelas bagi kalian di negeri Hijr dan Ahqaf tanda-tanda yang dapat kalian ambil pelajarannya dan kalian perhatikan. وَزَيَّنَ لَهُمُ الشَّيْطٰنُ أَعْمٰلَهُمْ(Dan syaitan menjadikan mereka memandang baik perbuatan-perbuatan mereka) Yakni kekafiran dan kemaksiatan yang mereka lakukan. فَصَدَّهُمْ(lalu ia menghalangi mereka dari jalan (Allah)) Dengan perbuatan setan yang menjadikan mereka memandang baik amal mereka itu. عَنِ السَّبِيلِ(dari jalan (Allah)) Yakni jalan yang jelas yang mengantarkan kepada kebenaran. وَكَانُوا۟ مُسْتَبْصِرِينَ(sedangkan mereka adalah orang-orang berpandangan tajam) Yakni orang-orang yang mampu memperhatikan dan mengetahui kebenaran lewat tanda-tanda itu. Mereka dahulu adalah orang yang berakal namun akal mereka tidak bermanfaat bagi mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "38. Dan Kami menghancurkan kaum ‘Aad dan Tsamud. Sungguh telah jelas bagi kalian jejak-jejak tempat tinggal mereka di daerah Al-Ahqaf dan Al-Hijr ketika kalian melihat betapa luas kehancuran tempat itu saat berjalan melewatinya yang digunakan sebagai pelajaran dan nasehat bagi orang-orang yang mau berpikir. Setan menghiasi pebuatan mereka sehingga mereka melihatnya sebagai perbuatan baik. Melalui hiasan ini, Setan mengalangi mereka untuk melewati jalan terang menuju keimanan, kebenaran dan amal shalih. Mereka adalah orang-orang berakal yang punya penglihatan yang memungkinkan untuk melihat dan beangan-angan serta membedakan kebenaran dari kebathilan, namun mereka mengabaikannya dengan sombong dan keras kepala"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "38. Dan demikian pula Kami lakukan terhadap kaum ‘Ad dan Tsamud. Anda telah mengetahui kisah mereka, dan sudah jelas bagi kalian melalui sesuatu yang dapat kalian saksikan dengan mata kepala kalian sendiri, yaitu bagian dari tempat-tempat tinggal dan peninggalan-peninggalan mereka yang telah mereka tinggalkan untuk selama-lamanya. Mereka telah didatangi oleh para raasul dengan bukti-buktinya yang sangat berguna bagi hati nurani, namun mereka mendustakan dan membantah para rasul itu, dan setan memperindah perbuatan mereka itu dalam pandangan mereka hingga mereka mengira bahwa apa yang mereka lakukan itu lebih utama dan lebih baik daripada apa yang dibawa oleh para rasul."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Ankabut ayat 38: Allah mengabarkan bahwa Ad dan Tsamud juga mendustakan rasul mereka, mereka tidak beriman kepada rasul mereka, Allah juga timpakan adzab kepada mereka, dan tersisa bekas-bekas adzab yang ditimpakan kepada mereka. Setan telah menghiasi amalan-amalan mereka dengan kesyirikan dan mendustakan rasul, mereka menyimpang dari jalan yang lurus setelah mereka diberikan penjelasan oleh para utusan Allah serta diberikan petunjuk. Akan tetapi mereka sombong dengan pengetahuan mereka yang bathil dan sesat, dan bahwasanya kebenaran adalah apa yang datang pada Syua’ib."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Di Hijr dan Yaman. Berupa kekafiran dan kemaksiatan, sehingga mereka menyangka bahwa perbuatan mereka itu lebih baik daripada apa yang dibawa para rasul."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Ankabut Ayat 38",
    "description": "-."
  }
]