[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Kami telah membinasakan Qarun, Fir’aun dan Haman. Dan sesungguhnya Musa telah mendatangi mereka semua dengan membawa ayat-ayat yang nyata. Tetapi mereka berlaku congkak dan sombong di muka bumi. Mereka tidaklah bisa meloloskan diri dari Kami, bahkan Kami kuasa menyiksa mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "39. Dan Kami telah membinasakan Qārūn tatkala ia telah berbuat aniaya terhadap kaum Musa, dengan ditenggelamkan ke dalam tanah. Dan Kami membinasakan Fir'aun bersama menterinya, Hāmān, dengan ditenggelamkan ke dalam lautan. Musa telah datang kepada mereka dengan membawa mukjizat nyata yang menunjukkan kebenarannya, akan tetapi mereka berlaku sombong di negeri Mesir dan menolak untuk beriman kepada Musa, maka tidaklah mungkin bagi mereka untuk selamat dari siksa Kami dengan melarikan diri dari Kami."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "39. Sebagaimana Allah telah membuat berbagai perumpamaan dengan umat-umat yang durhaka terhadap Tuhan mereka, Allah juga membuat perumpamaan dengan orang-orang terdahulu yang durhaka, agar menjadi peringatan bagi kaum Quraisy dan lainnya. Allah telah membinasakan Qarun, Fir’aun, dan Haman. Mereka tidak mengambil manfaat dari hidayah yang ada dalam risalah Nabi Musa sehingga mereka ingkar dan angkuh di muka bumi; akan tetapi mereka tidak mampu selamat dari genggaman dan siksaan Allah, namun Kami mampu meliputi mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "39. وَقٰرُونَ وَفِرْعَوْنَ وَهٰمٰنَ ۖ (dan (juga) Karun, Fir’aun dan Haman) Kami membinasakan mereka setelah para Rasul datang kepada mereka. فَاسْتَكْبَرُوا۟ فِى الْأَرْضِ (Akan tetapi mereka berlaku sombong di (muka) bumi) Yakni merasa sombong dari menyembah Allah. وَمَا كَانُوا۟ سٰبِقِينَ (dan tiadalah mereka orang-orang yang luput (dari kehancuran itu)) Yakni tidak dapat meloloskan diri."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "39. Dan Kami hancurkan Qarun yang jahat dan angkuh, Fir’aun yang zalim, sewenang-wenang dan mengaku sebagai Tuhan, dan Haman yaitu Menterinya yang membantunya dalam kezaliman. Sungguh datang kepada mereka Musa dengan membawa hujjah jelas yang menunjukkan pada kebenaran risalahnya. Namun mereka sewenang-wenang dan meremehkan kebenaran dan enggan menyembah Allah. Dan mereka tidak bisa pergi melarikan diri dari azab Kami"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Ankabut ayat 39: Setelah Allah menyebutkan kebinasaan umat-umat yang sombong dan bermaksiat, di mana mereka memusuhi rasul-rasul mereka, sebagimana kaum Luth, Hud, Shalih, Allah menjelaskan bahwasanya Qarun dan Fir’aun serta Haman mereka juga mendustakan rasul-rasul mereka dan Allah juga membinasakan mereka, setelah Musa datang kepada mereka membawa bukti-bukti yang jelas yang menunjukkan atas kebenaran apa yang mereka diseru kepadanya; Mereka malah menerimanya dengan angkuh di bumi; Padahal mereka tahu bahwasanya yang dibawa Musa adalah kebenaran. Oleh sebab itu Allah mengabarkan bahwa mereka telah pantas menerima adzab dan kebinasaan serta mereka mengajar perang Allah di mana Allah tidak dapat dilemahkan oleh mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mereka tidak mau mengikuti kebenaran yang dibawa Musa ‘alaihis salam dan mereka merendahkan hamba-hamba Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Ankabut Ayat 39",
    "description": "-."
  }
]