[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bahkan apakah orang-orang yang berbuat maksiat-maksiat seperti perbuatan syirik dan perbuatan maksiat lainnya mengira bahwa mereka akan dapat melemahkan Kami, sehingga mereka lolos dengan diri mereka dari Kami, dan Kami tidak kuasa atas mereka? Alangkah buruk penilaian mereka yang mereka tetapkan itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Bahkan apakah orang-orang yang berbuat kemaksiatan dengan melakukan kesyirikan dan selainnya itu mengira bahwa mereka mampu melemahkan Kami dan selamat dari siksa Kami? Sungguh buruk ketetapan yang mereka gunakan. Mereka tidak akan mampu melemahkan Allah dan tidak akan selamat dari siksa-Nya apabila mati dalam kekufuran mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "4. Ayat-ayat yang disebutkan itu merupakan peneguh bagi orang-orang beriman dalam menghadapi berbagai ujian yang berat. Kemudian disebutkan ancaman bagi orang-orang musyrik bahwa perbuatan mereka mengganggu orang-orang beriman adalah hal yang Kami ketahui, dan Kami tidak akan membiarkan mereka lepas dari siksaan. Apakah mereka mengira akan membuat Kami lemah sehingga Kami tidak dapat mengalahkan mereka? Apakah mereka meyakini dapat mencurahkan kemurkaan mereka terhadap para kekasih Kami sehingga mereka dapat mengalahkan Kami? Sungguh seburuk-buruk ketetapan adalah ketetapan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. أَمْ حَسِبَ الَّذِينَ يَعْمَلُونَ السَّيِّـَٔاتِ (Ataukah orang-orang yang mengerjakan kejahatan itu mengira) Mereka adalah para pelaku maksiat yang tidak peduli dengan kemasiatan yang mereka lakukan. أَن يَسْبِقُونَا ۚ( bahwa mereka akan luput (dari azab) Kami?) Yakni mereka mengira akan mampu lolos dari Kami sebelum Kami mengazab mereka akibat perbuatan mereka. سَآءَ مَا يَحْكُمُونَ (Amatlah buruk apa yang mereka tetapkan itu) Yakni alangkah buruk apa yang mereka anggap bahwa mereka akan mampu lolos dari kuasa Kami."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Ataukah orang-orang yang berbuat buruk yaitu orang-orang yang berbuat maksiat dan kafir itu beranggapan bahwa mereka bisa luput dari Kami dan merintangi Kami, atau melarikan diri dari hukuman Kami, sehingga (Kami) tidak mungkin untuk menghukum mereka? Jika mereka beranggapan seperti itu, maka sungguh itu adalah seburuk-buruk ketentuan yang mereka tetapkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4. Maksudnya, apakah orang-orang yang kemauan dan perhatiannya untuk melakukan dosa-dosa dan mengerjakan tindakan criminal akan mengira bahwa amal perbuatan mereka akan diabaikan begitu saja, dan bahwa Allah akan melupakan mereka atau mereka akan mampu melewatiNya? Lalu karena itu mereka berani melakukannya dan mudah bagi mereka untuk melakukannya? “Amatlah buruk apa yang mereka tetapkan itu.” Maksudnya, sungguh sangat buruk sekali keputusan mereka. Karena yang demikian itu adalah keputusan yang sangat zhalim, karena bermakna mengingkari kekuasaan Allah dan hikmahNya, dan (mengandung arti) bahwa mereka mempunyai kekuasaan yang dapat digunakan untuk melindungi diri mereka dari siksaan Allah, padahal mereka adalah makhluk yang paling lemah dan paling tidak berdaya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Ankabut ayat 4: Allah berkata dengan pengingkaran : Apakah mereka orang-orang kafir, syirik dan maksiat menyangka bahwa Kami mengabaikan mereka, dan meninggalkan mereka tenggelam dalam syahwat mereka. Mereka menyangka terasing dari Kami sehingga tidak beribadah dengan sepengetahuan Kami, mereka dan pengikut mereka. Seburuk-buruk sangkaan adalah sangkaan mereka yang menyangka demikian.; Ketahuilah bahwasanya tidaklah lupur dari Allah seorangpun dari mereka dan juga selain mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu syirk dan kemaksiatan. Yakni, apakah orang-orang yang perhatiannya mengerjakan keburukan mengira bahwa amal mereka akan dibiarkan, dan bahwa Allah lalai terhadap mereka atau mereka dapat lolos dari-Nya sehingga mereka berani mengerjakan keburukan dan mudah melakukannya. Ketetapan itu adalah ketetapan yang tidak adil, di samping itu di dalamnya mengandung pengingkaran kepada kekuasaan Allah dan hikmah-Nya, dan seakan-akan mereka memiliki kemampuan untuk menolak azab Allah, padahal mereka adalah makhluk yang lemah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Ankabut Ayat 4",
    "description": "Ataukah orang-orang yang mengerjakan kejahatan itu setelah kami larang mengerjakannya melalui rasul yang kami utus dan atau melalui akal sehat yang kami anugerahkan kepada manusia, mengira bahwa mereka akan dapat mendahului kami dalam usaha mereka untuk lari sehingga luput dari azab atau perhitungan kami' sangatlah buruk apa yang mereka tetapkan itu! alangkah buruknya perkiraan dan sikap me-reka ini!5. Setelah memperingatkan semua pihak, baik yang taat maupun yang durhaka, Allah mengisyaratkan anugerah-Nya kepada yang taat dengan berfirman; barangsiapa yang beriman kepada kebangkitan dan mengharap pertemuan dengan Allah, maka bergegaslah mengerjakan amal saleh, karena sesungguhnya waktu yang dijanjikan Allah pasti datang. Dan dia yang maha mendengar perkataan-perkataan hamba-Nya, maha me-ngetahui perbuatan-perbuatan mereka, dan dia akan membalas me-reka masing-masing sesuai dengan apa yang dilakukannya."
  }
]