[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian Kami menyiksa masing-masing dari mereka itu dengan siksaan Kami disebabkan dosanya. Maka di antara mereka, ada yang Kami jatuhkan bebatuan kepada mereka dari tanah yang panas terbakar, mereka adalah kaum Luth, dan ada yang disambar oleh suara dahsyat, mereka adalah kaum Shaleh dan kaum Syua’ib, dan ada yang dibenamkan ke dalam bumi, seperti Qarun, dan ada pula yang Kami tenggelamkan, mereka adalah kaum Nuh, Fir’aun dan kaumnya. Dan Allah tidaklah membinasakan mereka karena dosa-dosa orang lain, sehingga Dia menzhalimi mereka dengan membinasakan mereka tanpa pantas menerima hukuman itu, akan tetapi mereka itu telah berbuat aniaya terhadap diri mereka sendiri, dengan hidup bergelimang dalam kenikmatan dari Tuhan mereka, namun malah beribadah kepada selainNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "40. Maka masing-masing dari yang telah disebutkan sebelumnya Kami timpakan siksa atas mereka, seperti kaum Lūṭ yang telah Kami kirim atas mereka batu dari tanah yang terbakar dengan bertubi-tubi, juga kaum Ṣāleḥ dan kaum Syu'aib yang tertimpa suara keras yang mengguntur, dan Qārūn yang telah ditelan oleh bumi bersama rumahnya, serta kaum Nuh, Fir'aun dan Hāmān yang telah Kami binasakan dengan ditenggelamkan. Tidaklah Allah berbuat zalim terhadap mereka akan tetapi mereka sendiri yang berbuat zalim terhadap diri mereka sendiri dengan melakukan kemaksiatan sehingga mereka berhak mendapatkan siksa."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "40. Kemudian Allah menjelaskan berbagai macam siksaan bagi umat dan orang-orang yang telah disebutkan sebelumnya. Allah menetapkan azab bagi tiap-tiap mereka atas kemaksiatan yang telah mereka lakukan; sebagian mereka ditimpa angin kencang yang menghembuskan batu-batu yang membinasakan, dan mereka adalah kaum Luth sebagaimana disebutkan dalam at-Tafsir as-Shahih (3/71), dan dalam tafsir Ibnu Katsir mereka adalah kaum ‘Ad (at-Tafsir 3/543). Sedangkan kaum yang dibinasakan dengan suara keras adalah kaum Tsamud, suara itu menghentikan suara dan gerakan mereka. Adapun yang ditenggelamkan ke dalam tanah adalah Qarun yang angkuh dan membanggakan diri. Dan yang ditenggelamkan di laut adalah Fir’aun dan pengikutnya setelah mereka berlaku sombong di muka bumi. Maha Suci Allah dari menzalimi mereka meski hanya sedikit, merekalah yang menzalimi diri mereka sendiri yang menjadi sebab datangnya azab dan siksaan kepada mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "40. فَكُلًّا أَخَذْنَا بِذَنۢبِهِۦ ۖ (Maka masing-masing (mereka itu) Kami siksa disebabkan dosanya) Yakni Kami siksa setiap mereka akibat kekafiran dan pendustaan mereka. فَمِنْهُم مَّنْ أَرْسَلْنَا عَلَيْهِ حَاصِبًا(maka di antara mereka ada yang Kami timpakan kepadanya hujan batu kerikil) Yakni angin yang menimpa mereka dengan hujan batu. Dan mereka adalah kaum Luth. وَمِنْهُم مَّنْ أَخَذَتْهُ الصَّيْحَةُ(dan di antara mereka ada yang ditimpa suara keras yang mengguntur) Mereka adalah kaum Tsamud dan penduduk negeri Madyan. وَمِنْهُم مَّنْ خَسَفْنَا بِهِ الْأَرْضَ(dan di antara mereka ada yang Kami benamkan ke dalam bumi) Mereka adalah Qarun dan kaumnya. وَمِنْهُم مَّنْ أَغْرَقْنَا ۚ( dan di antara mereka ada yang Kami tenggelamkan) Mereka adalah kaum Nabi Nuh dan kaum Fir’aun. وَمَا كَانَ اللهُ لِيَظْلِمَهُمْ(dan Allah sekali-kali tidak hendak menganiaya mereka) Dengan siksaan itu. Sebab Allah telah mengirim para rasul dan menurunkan kitba-kitab-Nya kepada mereka. وَلٰكِن كَانُوٓا۟ أَنفُسَهُمْ يَظْلِمُونَ(akan tetapi merekalah yang menganiaya diri mereka sendiri) Akibat terus menerus dalam kekafiran dan pendustaan terhadap para Rasul serta akibat perbuatan maksiat yang mereka kerjakan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "40. Setiap individu atau kelompok yang telah disebutkan akan kami hukum sesuai dosanya, yaitu kekufuran dan pendustaan mereka. Di antara mereka ada yang Kami beri kiriman angin kencang yang di dalamnya mengandung batu kerikil, yaitu batu kecil. Mereka itu adalah kaum Luth dan kaum ‘Aad yang merupakan kaum Hud. Di antara mereka juga ada yang kami hukum dengan suara teriakan, yaitu teriakan yang sangat keras seperti kaum Madyan dan kaum Tsamud. Dan di antara mereka juga ada yang kami benamkan dalam bumi seperti Qarun dan kaum Luth. Mereka itu diazab dengan ditenggelamkan dan dilempari batu. Di antara mereka juga ada yang Kami tenggelamkan seperti kaum Nuh dan Fir’aun beserta pasukannya. Tidaklah Allah menzalimi mereka dengan apa yang Dia perbuat kepada mereka, yaitu mengazab mereka tanpa sebab dosa, namun mereka menzalimi diri mereka sendiri dengan berbuat kekufuran dan mendustakan para rasul dan melakukan kemaksiatan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "39. Demikian pula Qarun, Fir’aun dan haman. Ketika Allah mengutus Musa bin Imran kepada mereka dengan mukjizat-mikjizat yang nyata dan argument-argumen yang sangat jelas, namun mereka tetap tidak mau tunduk bahkan mereka berbuat sombong di muka bumi terhadap hamba-hamba Allah (Bani Israil) dengan memperbudak mereka dan sombong terhadap kebenaran. Mereka menolaknya, maka akhirnya mereka tidak mampu menyelamatkan diri hingga azab menimpa mereka, “dan tidaklah mereka itu orang-orang yang mendahului.” Maksudnya, (tidaklah mereka mendahului) Allah dan tidak pula luput (dari azabNya). Akan tetapi mereka kalah dan menyerah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Ankabut ayat 40: Allah mengabarkan bahwasanya setiap umat akan mendapatkan bagian dari adzab karena apa yang dia telah usahakan, dan beraneka ragam akhir dari balasan atas amalan mereka; Di antara mereka ada yang dikirim angin yang besar kemudian mereka binasa seperti kaum Ad, ada juga yang mati karena sebab lengkingan suara keras seperti kaum Nabi Shalih, ada juga yang ditenggelamkan oleh Allah di bumi sebagaimana Qarun, ada juga yang Allah tenggelamkan seperti kaum Nuh dan juga Fir’aun serta tentaranya. Kemudian Allah menjelaskan bahwasanya Dia tidak mendzalimi kaum-kaum ini dengan apa yang Allah perbuat dengan menurunkan adzab dan kebinasaan; Karena bahwasanya Allah mengadzab mereka karena sebab mereka dzalim kepada diri-diri mereka dengan melakukan kesyirikan, kekafiran, kemaksiatan dan keburukan-keburukan. Allah telah mengabarkan bahwasanya Dia mengharamkan kedzaliman atas diri-Nya dan Allah jadikan haram, dzalim di antara manusia, Allah berkata dalam hadits qudsi : Wahai hamba-Ku, sungguh Aku mengharamkan atas diri-Ku kedzaliman, dan aku haramkan di antara kalian berbuat dzalim, maka janganlah kalian berbuat dzalim. Dan tidak diragukan bahwasanya Allah menyebutkan umat-umat ini dan apa yang pada mereka dari kekufuran dan sombong atas hidayah para rasul adalah sebagai peringatan dari berlaku sebagaimana mereka, dan sebagai pemberitahuan bahwa balasanya sebagaimana mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni sesuai ukuran dosanya dan diberi hukuman yang sesuai. Seperti kaum Luth. Ada pula yang mengatakan seperti kaum ‘Aad, yaitu ketika mereka berkata, “Siapakah yang lebih kuat daripada kami?” Maka datang kepada mereka angin topan yang sangat dingin yang membawa kerikil-kerikil lalu ditimpakan kepada mereka, mengangkat mereka dari bumi sampai tinggi ke atas, lalu dijungkirbalikkan ke bawah, sehingga kepalanya pecah dan mereka dalam keadaan berbadan tanpa kepala seperti batang-batang kurma yang telah kosong (lapuk), lihat tafsir Ibnu Katsir. Seperti kaum Saleh (Tsamud). Seperti Karun. Seperti kaum Nuh dan Fir’aun bersama bala tentaranya. Dia tidak akan mengazab mereka, kecuali karena mereka berdosa. Mereka tidak mengerjakan tugas mereka, di mana mereka diciptakan untuk beribadah, bahkan menyibukkan diri mereka untuk selain itu, mereka sibukkan diri mereka untuk memuaskan hawa nafsu dan berbuat maksiat, sehingga mereka merugikan diri mereka serugi-ruginya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Ankabut Ayat 40",
    "description": "-."
  }
]