[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Perumpamaan orang-orang yang menjadikan berhala-berhala sebagai penolong selain Allah yang mereka harapkan pertolonggannya adalah seperti laba-laba yang membuat sarang bagi dirinya agar dapat menjaganya, namun sarang itu tidak memberikan manfaat sedikit pun ketika ia membutuhkan (perlindungan) nya. Demikian pula keadaan orang-orang musyrik, para penolong mereka yang mereka ada-adakan selain Allah itu tidak dapat memberikan bantuan sedikit pun. Dan sesungguhnya selemah-lemah rumah adalah rumah laba-laba, seandainya mereka mengetahui hal itu, pasti mereka tidak menjadikannya sebagai penolong-penolong. Tuhan-tuhan itu tidak memberikan manfaat bagi mereka dan tidak dapat mendatangkan mudarat terhadap mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "41. Permisalan orang-orang musyrik yang menjadikan berhala-berhala selain Allah, mereka menyembahnya dengan harapan mendapat manfaatnya dan syafaatnya, mereka itu seperti laba-laba membuat rumah yang tidak bisa melindunginya dari panas, dingin dan serangan musuhnya. Dan sesungguhnya selemah-lemah rumah adalah rumah laba-laba, karena rumah itu tidak mengusir rasa dingin darinya dan tidak pula melindunginya dari kepanasan. Demikian pula berhala-berhala mereka, tidak mendatangkan manfaat kepada mereka, tidak menghindarkan mereka dari mudarat dan tidak memberikan syafaat. Jika orang-orang musyrik mengetahui hal itu maka tidaklah mereka menjadikan sembahan itu disembah selain Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "41. Ini merupakan perumpamaan bagi orang yang menjadikan berhala-berhala sebagai penolong yang mereka harapkan manfaatnya selain Allah; mereka seperti laba-laba yang membuat sarang dan mengira sarang itu dapat melindunginya dari bahaya, akan tetapi sarang itu sama sekali tidak dapat diharapkan karena akan porak poranda akibat sedikit saja gangguan. Orang-orang musyrik seperti laba-laba karena tertipu oleh apa yang telah mereka siapkan; para sesembahan mereka seperti sarang laba-laba yang tidak dapat memberi perlindungan sedikitpun. Sebagaimana diketahui sarang laba-laba adalah sarang yang sangat lemah. Demikianlah orang yang menjadikan selain Allah sebagai sesembahan akan menjadi jauh dari petunjuk. Seandainya mereka mengetahui pada sesembahan mereka tidak dapat memberi manfaat, niscaya mereka tdiak akan menjadikannya sesembahan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "41. مَثَلُ الَّذِينَ اتَّخَذُوا۟ مِن دُونِ اللهِ أَوْلِيَآءَ (Perumpamaan orang-orang yang mengambil pelindung-pelindung selain Allah) Mereka mengangkat penolong-penolong selain Allah sebagai sandaran dalam memenuhi kebutuhan mereka, baik itu penolong berupa benda mati atau hewan yang mati atau hidup. كَمَثَلِ الْعَنكَبُوتِ اتَّخَذَتْ بَيْتًا ۖ( seperti laba-laba yang membuat rumah) Sebab rumahnya tidak bermanfaat baginya sedikitpun untuk menghindarkannya dari panas, dingin, hujan, dan musuh. Demikian pula penolong yang diangkat orang-orang kafir selain Allah, ia tidak mampu memberi manfaat bagi mereka sedikitpun dan tidak dapat melingdungi mereka dari apapun. وَإِنَّ أَوْهَنَ الْبُيُوتِ لَبَيْتُ الْعَنكَبُوتِ ۖ( Dan sesungguhnya rumah yang paling lemah adalah rumah laba-laba) Tidak ada rumah serangga yang lebih lemah rumahnya atau yang mendekati kelemahannya"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "41. Perumpamaan (wujud) orang-orang yang mengambil penolong-penolong selain Allah untuk memberi keuntungan pada mereka dan memenuhi kebutuhan mereka baik itu dari benda-benda mati, patung, berhala, hewan, malaikat atau bahkan manusia yang masih hidup atau yang sudah mati itu seperti laba-laba (serangga kecil) yang membangun rumah sendiri untuk tempat perlindungannya. Rumah itu tidak sedikitpun menutupinya dari panas, dingin atau hujan dan ridak melindunginya juga dari musuh. Sesungguhnya rumah paling lemah adalah rumah laba-laba. Begitu juga berhala dan sebagainya yang tidak bermanfaat pula bagi penyembahnya. Jika mereka mengetahui hal itu, mereka tidak akan menyembahnya."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "40. “Maka masing-masing” dari mereka, yaitu umat-umat yang mendustakan itu, “Kami siksa disebabkan dosanya,” sesuai dengan kadarnya, dan dengan hukuman yang setimpal dengannya, “maka di antara mereka ada yang Kami timpakan kepadanya hujan batu kerikil,” yakni: Azab yang memberikan hujan batu kepada mereka, seperti halnya kaum ‘Ad ketika Allah mengirim kepada mereka angin yang dingin, \"Dan (yang Allah menimpakan angin itu kepada mereka selama tujuh malam dan delapan hari terus menerus; maka kamu lihat kaum Ad pada waktu itu mati bergelimpangan seakan-akan mereka tunggul-tunggul pohon kurma yang telah kosong (lapuk).\" Al-Haqqah:7). “Dan di antara mereka ada yang ditimpa suara keras yang mengguntur,” seperti kaum Shaleh, “dan di antara mereka ada yang Kami benamkan ke dalam bumi,” sepert Qarun, “dan di antara mereka ada yang Kami tenggelamkan,” seperti Fir’aun dan Haman berserta para bala tentaranya, “dan Allah sekali-kali tidak menganiaya mereka,” maksudnya, tidak pantas dan tidak layak bagi Allah untuk menzhalimi mereka, sebab kesempurnaan sifat adilNya dan ketidakbutuhanNya kepada seluruh makhluk, “akan tetapi merekalah yang menganiaya diri mereka sendiri,” mereka telah menghalangi jiwa dari haknya yang sedang ia inginkan. Sebab, sesungguhnya jiwa diciptakan untuk beribadah hanya kepada Allah semata. Sementara mereka telah menempatkan jiwa mereka bukan pada tempatnya dan telah menyibukannya dengan berbagai syahwat dan kemaksiatan, sehingga mereka benar-benar telah membahayakannya sejauh-jauhnya di mana mereka mengira bahwa mereka menyelamatkannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Ankabut ayat 41: Ketahuilah wahai manusia bahwa mereka orang-orang musyrik yang menyembah sesembahan selain Allah dan menjadikannya sebagai penolong, yaitu mengharap pertolongan mereka dan manfaat dari mereka, keadaan mereka sebagaimana keadaan laba-laba yang membuat jaring yang lemah, yang tipis, yang tidak bertahan dengan musim panas begitu juga dengan dingin. Begitulah sesembahan selain Allah yang tidak memberikan manfaat bagi yang menyembahnya; Karena sebab batu tidak memberi manfaat dan juga mudharat, tidak juga menjadi sebab sebuah keberhasilan seorang hamba pada hari kiamat, bahkan mereka (sesembahannya) akan berlepas diri dari mereka, dan akan menjadikan sebab kebinasaan mereka, begitu pula orang-orang yang mereka cintai dari kalangan orang-orang shalihh, mereka akan berlepas diri dari mereka. Kemudian Allah menjelaskan bahwas kalau saja mereka orang-orang musyrik mengetahui akan hakikat keilmuan akan sesembahan ini, mereka tidak akan membutuhkan sesembahan tersebut, karena sesembahan tersebut sebagaimana jaring laba-laba yang tidak memiliki manfaat, karena lemah ketika mereka ridha dengan sesembahan selain Allah, mereka meninggalkan ibadah kepada Allah yang dalam genggaman-Nya segala sesuatu dan kepada-Nya lah semuanya kembali. Sungguh sesembahan itu akan berlepas diri dari mereka yang sesembahan tersebut tidak memberikan mudharat dan manfaat, akan tetapi kuatnya kekafiran mereka dan sombong dengan kebutaan mata-mata mereka, maka mereka tetap dalam kekafiran dan kesesatan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah menerangkan kelemahan sesembahan orang-orang musyrik, Dia menjelaskan kepada yang lebih tinggi lagi, yaitu bahwa berhala dan patung itu tidak ada apa-apanya, bahkan mereka hanya sekedar nama dan keyakinan yang mereka ada-adakan, padahal jika diteliti, maka akan diketahui dengan jelas kebatilannya. Yakni sesembahan yang mereka harapkan manfaatnya. Rumah tersebut tidak menghalangi panas, dingin dan bahaya yang menimpa. Laba-laba tergolong hewan yang lemah, dan rumahnya adalah rumah yang paling lemah. Oleh karena itu, tidak ada yang mengambilnya sebagai rumah pelindung kecuali akan menambah kelemahan untuknya. Demikianlah berhala dan patung yang mereka jadikan sebagai pelindung, mereka tidak dapat memberikan manfaat kepada para penyembahnya; mereka lemah dari berbagai sisi, dan jika menjadikan mereka sebagai penguat, maka hanya menambah kelemahan belaka. Jika mereka memiliki pengetahuan tentang keadaan mereka dan keadaaan yang mereka jadikan sebagai pelindung, tentu mereka tidak akan menjadikannya sebagai pelindung dan akan berlepas diri dari mereka, dan tentu mereka akan menjadikan Allah Yang Mahakuasa lagi Maha Penyayang sebagai pelindung mereka, di mana barang siapa yang menyerahkan urusan kepada-Nya, maka Dia akan mencukupkannya dan akan menguatkannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Ankabut Ayat 41",
    "description": "-."
  }
]