[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya Allah mengetahui tandingan-tandingan yang mereka persekutukan dengan Allah, dan sesungguhnya obyek-obyek itu tidak ada apa-apanya, hanya sekedar nama-nama yang mereka bubuhkan kepadanya, tidak dapat mendatangkan manfaat, juga tidak dapat mencelakai. Dia Mahaperkasa dalam menghukum orang yang kafir kepadaNya lagi Mahabijaksana dalam pengaturan dan perbuatanNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "42. Sesungguhnya Allah -Subḥānahu wa Ta'ālā- mengetahui apa yang mereka sembah selain-Nya, tidak ada sesuatu pun yang luput dari hal tersebut, dan Dia Maha Perkasa tidak terkalahkan, Maha Bijaksana di dalam penciptaan-Nya, takdir-Nya dan ketentuan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "42. Setelah dijelaskan bahwa orang-orang musyrik tidak memiliki pengetahuan, kemudian disebutkan pengetahuan Allah tentang hakikat berhala-berhala secara detail bahwa hakikatnya bertentangan dengan keyakinan orang yang menyembahnya. Allah mengetahui mereka menyembah sesuatu yang sama sekali tidak memiliki kemampuan, sehingga tidak layak untuk mendapat sebutan apapun. Allah Maha Perkasa dalam membalas orang yang mengingkari-Nya dan Maha Bijaksana terhadap ciptaan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "42. إِنَّ اللهَ يَعْلَمُ مَا يَدْعُونَ مِن دُونِهِۦ مِن شَىْءٍ ۚ (Sesungguhnya Allah mengetahui apa saja yang mereka seru selain Allah) Yakni apa yang mereka seru selain Allah sama sekali tidak mampu memberi manfaat atau mudharat. وَهُوَ الْعَزِيزُ الْحَكِيمُ(Dan Dia Maha Perkasa lagi Maha Bijaksana) Yakni Maha Perkasa yang berbuat sesuatu dengan penuh ketelitian dan hikmah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "42. Sesungguhnya Allah mengetahui sesuatu yang mereka sembah selain Allah berupa berhala dan patung. Tidak sedikitpun sesuatu yang disembah itu memberi manfaat atau memberi bahaya. Dialah Dzat yang Maha Kuat dan Maha Membalas orang yang mengingkariNya serta Maha Bijaksana terhadap ciptaanNya, pengaturanNya dan seluruh firman dan tindakanNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "41. Ini adalah sebuah perumpamaan yang diberikan oleh Allah bagi orang yang menyembah selain Dia di samping menyembahNya dengan maksud agar mulia, menjadi kuat dan memperoleh manfaat, dan bahwa (hakikat) perkaranya adalah malah kebalikannya dari apa yang dimaksudkannya. Sesungguhnya perumpamaannya adalah seperti laba-laba yang membuat sarang untuk melindunginya dari cuaca panas, dingin dan berbagai ancaman. “Dan sesungguhnya rumah yang paling lemah,” paling rapuh dan paling lemah, “ialah rumah laba-laba.” Sebab laba-laba adalah termasuk jenis hewan yang sangat lemah, dan rumahnya pun adalah rumah yang paling rapuh. Maka tidaklah dia bertambah dengan tindakannya itu melainkan kelemahan. Demikian pula mereka yang menjadikan selain Allah sebagai pelindung, mereka fakir dan lemah dari segala sisi. Dan dikala mereka mengambil pelindung-pelindung dari selainNYa (dengan maksud) agar mereka menjadi mulia karenanya dan meminta pertolongan kepada mereka, maka makin bertambah lemah dan makin bertambah rapuh. Sebab mereka menjadikan para sesembahan itu sebagai sandaran dalam kebanyakan kepentingan mereka, dan menyerahkan berbagai permasalahan itu kepada mereka, serta membiarkan mereka (untuk mengurusinya) dengan keyakinan bahwa para sesembahan (pelindung) itu akan menuntaskannya. Lalu mereka (para sesembahan) itu menelantarkan mereka, akhirnya mereka sama sekali tidak memperoleh apa pun dari mereka, dan mereka pun tidak memberikan pertolongan sekecil apa pun kepada mereka. Kalau saja mereka mengerahui dengan sebenarnya keadaan para pelinduung itu dan keadaan orang-orang yang menjadikannya sebagai pelindung, tentu mereka tidak mengangkatnya dan tentu mereka pasti berlepas diri darinya, dan niscaya mereka menyerahkan (permasalahan mereka) kepada Allah Yang Mahakuasa lagi Mahapenyayang, yaitu Dzat yang apabila sang hamba berlindung kepadaNya dan berserah diri kepadaNya, niscaya Dia memberinya kecukupan pada urusan agama dan dunianya, dan niscaya dia akan makin bertambah kuat di dalam hati, badan, keadaan dan pekerjaannya. 42. Setelah Allah menjelaskan puncak kerapuhan sesembahan-sesembahan kaum musyrikin, maka Allah berpindah meningkat dari pembahasan ini kepada hal yang lebiih tegas darinya, dan bahwa sesembahan-sesembahan itu bukanlah sesuatu yang berarti, akan tetapi semua ttuhan itu hanyalah nama-nama yang mereka berikan dan dugaan-dugaan yang mereka yakini. Dan setelah diteliti ternyata Nampak jelas bagi orang yang berakal tentang kepalsuan dan kenihilan sesembahan-sesembahan tersebut. Oleh karenanya, Allah berfirman, “Sesungguhnya Allah mengetahui apa saja yang mereka seru selain Allah.” Maksudnya, sesungguhnya Allah mengetahui, -DIa-lah yang mengetahui yang ghaib dan yang nyata-, bahwasanya mereka tidak menyembah sesuatu yang ada (berwujud) dari selain Allah, dan tidak pula sembahan yang mempunyai hakikat. Sebagaimana Firman Allah, \"Itu tidak lain hanyalah nama-nama yang kamu dan bapak-bapak kamu mengada-adakannya; Allah tidak menurunkan suatu keterangan pun untuk (menyembah) nya. Mereka tidak lain hanyalah mengikuti sangkaan-sangkaan, dan apa yang diingini oleh hawa nafsu mereka, dan sesungguhnya telah datang petunjuk kepada mereka dari Tuhan mereka.\" (An’Najm:23) dan FirmanNYa \"Dan orang-orang yang menyeru sekutu-sekutu selain Allah, tidaklah mengikuti (suatu keyakinan). Mereka tidak mengikuti kecuali prasangka belaka, dan mereka hanyalah menduga-duga.\" (Yunus:66). “Dan Dia Mahaperkasa,” yang milikNya-lah semua kekuatan, yang dengannya Dia menguasai seluruh makhluk, “lagi Mahabijaksana” Yang menempatkan segala sesuatu tepat pada tempatnya, dan Yang membuat segala seesuatu yang Dia ciptakan sebaik-baiknya dan Yang mengokohkan apa yang diperintahkanNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Ankabut ayat 42: Ketahuilah bahwasanya Allah memiliki pengetahuan akan langit dan bumi, Allah mengetahui keadaan tuhan-tuhan mereka yang mereka menyeru dan beribadah kepada selain Allah, dan bahwasanya tuhan-tuhan mereka tidak memudharatkan dan juga memberi manfaat, Allah mengetahu keadaan orang-orang musyrik yang menjadi hamba bagi tuhan-tuhan ini yang bathil, Dialah Allah yang tidak satupun tersembunyi bagi-Nya akan hal itu, Dia Maha Kuat, Yang Maha Menaklukkan, Yang Memiliki Kuasa, Dialah Al Hakim atas kerajaan-Nya serta memenuhi kebutuhan makhluk-Nya, yang Dia meletakkan sesuatu sesuai tempatnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala mengetahui –di mana Dia mengetahui yang gaib dan yang tampak-, sesuatu yang mereka sembah selain-Nya, dan bahwa mereka tidak memiliki sifat ketuhanan sama sekali, dan keadaan mereka sebagaimana firman-Nya, “Itu tidak lain hanyalah nama-nama yang kamu dan bapak-bapak kamu mengadakannya; Allah tidak menurunkan suatu keterangan pun untuk (menyembah)nya. Mereka tidak lain hanyalah mengikuti sangkaan-sangkaan, dan apa yang diingini oleh hawa nafsu mereka dan sesungguhnya telah datang petunjuk kepada mereka dari Tuhan mereka.” (Terj. An Najm: 23) Dengan keperkasaan-Nya Dia mengalahkan semua makhluk. Dia menempatkan sesuatu pada tempatnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Ankabut Ayat 42",
    "description": "-."
  }
]