[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Perumpamaan-perumpamaan ini Kami adakan bagi sekalian manusia, agar mereka dapat mengambil manfaat darinya dan mengambil pelajaran darinya. Dan tidak ada yang memahaminya kecuali orang yang mengenal Allah, ayat-ayat dan syariatNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "43. Permisalan-permisalan yang Kami buat untuk manusia ini untuk membangunkan mereka dan menjadikan mereka melihat kebenaran serta menunjuki mereka kepadanya, tidak ada yang mampu memahaminya dengan sempurna sebagaimana yang diinginkan kecuali orang-orang yang mengerti syariat-syariat Allah dan hikmah-hikmah-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "43. Allah mengolok orang-orang musyrik karena mereka tidak mampu memahami makna-makna yang diberikan kepada mereka dalam bentuk berbagai perumpamaan. Dan Allah memberi kenikmatan kepada orang-orang yang berakal. Orang-orang yang fasih memahami bahwa setiap keadaan memiliki perkataan yang tepat untuk ucapkan pada waktu itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "43. وَتِلْكَ الْأَمْثٰلُ نَضْرِبُهَا لِلنَّاسِ ۖ (Dan perumpamaan-perumpamaan ini Kami buat untuk manusia) Yakni perumpamaan ini dan perumpamaan lain yang terdapat dalam al-Qur’an itu Kami jadikan bagi manusia sebagai peringatan bagi mereka dan mendekatkan mereka dalam pemahaman. وَمَا يَعْقِلُهَآ(dan tiada yang memahaminya) Yakni tidak ada yang memahami dan mengerti sesuatu yang Kami umpamakan ini. إِلَّا الْعٰلِمُونَ(kecuali orang-orang yang berilmu) Yakni orang yang mengetahui Allah dengan pengetahuan yang dalam dan yang memperhatikan ayat yang dibacakan kepada mereka dan apa yang mereka saksikan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "43. Perumpamaan-perumpamaan yang ada dalam Al-Qur’an ini Kami jelaskan kepada manusia untuk menarik perhatian dan mendekatkan diri (pada Al-Qur’an) agar paham. Tidak ada yang memahami perumpamaan itu kecuali orang-orang berilmu yang mau merenung memikirkan apa yang dibacakan untuk mereka dan hal-hal yang mereka saksikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "43. “Dan perumpamaan-perumpamaan ini Kami buatkan untuk manusia,” maksudnya, untuk mereka, agar mereka mengambil manfaat dan untuk mengajar mereka, karena perumpamaan itu termasuk salah satu metode yang dapat menjelaskan ilmu, karena ia dapat memudahkan hal-hal yang logis dengan hal-hal yang empiris (nyata) sehingga makna yang dimaksud menjadi jelas karenanya. Dan perumpamaan itu menjadi maslahat bagi kebanyakan orang, “dan” tetapi “tiada yang memahaminya,” untuk menghayati dan memikirkan serta menerapkannya sesuai gambaran yang dikemukakan oleh perumpamaan itu, dan memahaminya di dalam hati “kecuali orang yang berilmu,” maksudnya, kecuali orang yang benar-benar memiliki ilmu yang sebenarnya, yaitu mereka yang memiliki ilmu sampai ke dalam hati mereka. Ini adalah pujian untuk perumpamaan-perumpamaan yang dilontarkan, dan suatu anjuran untuk dihayati dan dipahami, dan pujian pula bagi orang yang memahaminya, dan bahwa itu merupakan tanda bahwa dia termasuk ahli imu. Dengan demikian, dapat diketahui bahwa orang yang tidak memahaminya, (padahal perumpamaan itu sangat penting), adalah tidak termasuk ahli ilmu. Sebab hal tersebut adalah bahwa permisalan-permisalan yang dicontohkan oleh Allah di dalam al-Quran hanyalah perkara-perkara yang besar, tuntutan-tuntutan yang tinggi, dan permisalan-permisalan yang agung. Ahli ilmu adalah orang-orang yang mengetahui arti pentingnya hal itu daripada perkara lainnya, karena perhatian Allah terhadapnya, anjuranNya kepada para hamba untuk memahami dan memikirnya, sehingga mereka mengerahkan kemampuan mereka untuk mengetahuinya. Adapun orang yang tidak memahaminya, maka itu merupakan bukti bahwa dia bukan ilmu. Sebab apabila ia tidak mengetahui masalah-masalah yang penting, maka ia tidak mengetahui masalah-masalah lain tentu lebih utama dan lebih pasti. Maka dari itu Allah sering memberikan perumpamaan-perumpamaan dalam masalah-masalah prinsip agama (ushuludin) dan yang serupa dengannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Ankabut ayat 43: Allah mengabarkan bahwa permisalan ini yang di kabarkan kepada manusia agar mereka mengambil manfaat dan agar mempelajari darinya, dan tidaklah yang memikirkan dengan akalnya atas permisalan ini dan memahami tujuannya kecuali hanyalah orang-orang yang memiliki akal bijak dan faham. Di sini terdapat pujian bagi ulama karena mereka yang mengambil manfaat dari permisalan ini dan mengilmui apa yang wujud dari kandungan permisalan tersebut."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni karena mereka, untuk manfaat mereka dan untuk mengajarkan mereka, karena perumpamaan termasuk di antara cara untuk memperjelas ilmu, mendekatkan perkara yang masih di akal dengan perkara yang dapat dirasakan, sehingga makna yang diinginkan menjadi jelas, sehingga ia merupakan maslahat untuk semua manusia. Di mana ilmu tersebut masuk sampai ke hati mereka. Ayat ini merupakan pujian kepada perumpamaan yang Allah buat dan dorongan untuk mentadabburi dan memikirkannya, demikian pula pujian bagi orang yang dapat memahaminya. Dari sini diketahui, bahwa orang yang tidak memahaminya berarti tidak berilmu. Sebabnya adalah karena perumpamaan yang Allah buat dalam Al Qur’an adalah untuk perkara-perkara besar (seperti ushuluddin), tuntutan yang tinggi, serta masalah yang agung. Ahli ilmu mengetahui, bahwa perumpamaan itu lebih penting daripada selainnya karena Allah memperhatikannya, mendorong hamba-hamba-Nya untuk memikirkannya. Jika ternyata ada orang yang tidak memahaminya padahal sangat penting sekali, maka yang demikian menunjukkan bahwa ia bukan ahli ilmu, karena jika masalah yang sangat penting saja dia tidak mengetahuinya, apalagi masalah yang di bawahnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Ankabut Ayat 43",
    "description": "-."
  }
]