[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah menciptakan langit dan bumi dengan asas keadilan dan keseimbangan. Sesungguhnya dalam penciptaanNya tersebut benar-benar terkandung bukti yang besar atas KuasaNya dan keberhakanNya sebagai satu-satunya yang berhak disembah. Dalam ayat ini Allah menyebutkan “orang-orang yang beriman” secara khusus, karena merekalah yang mengambil manfaat dari hal itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "44. Allah -Subḥānahu wa Ta'ālā- menciptakan langit dan menciptakan bumi dengan hak, Dia tidak menciptakannya dengan batil, tidak pula menciptakannya dengan sia-sia. Sesungguhnya dalam penciptaan itu benar-benar terdapat tanda-tanda yang nyata atas kekuasaan Allah bagi orang-orang yang beriman, karena orang-orang yang beriman lah yang mau berdalil dengan makhluk Allah atas kekuasaan Żat Yang Maha Pencipta. Adapun orang-orang kafir, mereka itu melalui tanda-tanda yang ada di ufuk maupun yang ada pada diri mereka sendiri tidak mampu membuat perhatian mereka tergugah atas keagungan Sang Pencipta dan kekuasaan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "44. Allah menyampaikan kepada orang-orang beriman bahwa Dia yang menciptakan langit dan bumi dengan teratur, segala sesuatunya dengan perhitungan. Keduanya adalah tanda yang jelas atas keesaaan dan kekuasaan Allah, dan hendaklah mereka menghayati besarnya penciptaan langit dan bumi."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "44. خَلَقَ اللهُ السَّمٰوٰتِ وَالْأَرْضَ بِالْحَقِّ ۚ (Allah menciptakan langit dan bumi dengan hak) Yakni dengan keadilan untuk menjaga kemaslahatan hamba-hamba-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "44. Allah menciptakan langit dan bumi secara adil dan penuh perlindungan terhadap para hamba(Nya) dengan penuh hikmah dan tidak sia-sia. Dalam penciptaan keduanya (langit dan bumi) Dia tidak dibantu siapa pun. Sesungguhnya dalam penciptaan itu ada petunjuk atas keesaan Allah dan kekuasaanNya kepada orang-orang mukmin karena mereka adalah orang-orang yang mengambil manfaat dari hal itu untuk menambah keimanan bukan untuk kekufuran. Yang dimaksud dengan firmanNya {bil haqqi} yaitu mengandung hikmah yang luhur sebagaimana yang disebutkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "44. Maksudnya Dia-lah Allah Yang Esa, Yang menciptakan langit dengan keluhuran, ketinggian, keluasan, dan keindahannya, dan segala sesuatu yang ada di dalamnya seperti matahari, bulan, bintang-bintang dan para malaikat, dan bumi beserta segala apa yang ada padanya seperti gunung-gunung, lautan, daratan, gurun, pohon-pohon dan lain-lain. Semua itu Dia ciptakan dengan benar. Maksudnya, Dia tidak menciptakannya dengan sia-sia atau tidak berguna, atau tidak bermanfaat. Sesungguhnya Dia menciptakannya agar perintah dan syariatnya tegak, dan agar kenikmatannya terhadap segenap hambaNya menjadi sempurna, serta agar mereka melihat bagian dari kebijaksanaanNya, kemahaperkasaanNya dan kemahakuasaanNya, sesuatu yang menunjukkan bahwa sesungguhnya hanya Dia-lah sembahan mereka, Dia-lah yang berhak mereka cintai dan Dia-lah tuhan mereka. “Sesungguhnya pada yang demikian itu terdapat tanda-tanda kekuasaan Allah bagi orang-orang Mukmin,” sesuai dengan banyaknya tuntutan keimanan, jika seorang yang beriman merenungkannya, niscaya ia dapat melihatnya dengan mata kepala."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Ankabut ayat 44: Ketahuilah bahwasanya Allah sendirilah dalam penciptaan langit dan bumi dengan keadilan-Nya dan menurut bagiannya masing-masing, pada keterangan ini terdapat petunjuk dan tanda-tanda yang jelas atas hikmah-Nya dan kuasa-Nya serta Allah mengajarkan kepada manusia. Dan tidaklah mengambil manfaat dari permisalan tanda-tanda ini kecuali hanyalah orang-orang yang beriman yang mereka membenarkan Allah dan rasul-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya, Allah Subhaanahu wa Ta'aala sendiri yang menciptakan langit dengan keadaannya yang tinggi, luas, indah dan apa yang ada di sana seperti matahari, bulan, bintang, malaikat, dll. demikian pula Allah sendiri yang menciptakan bumi dan apa yang ada di sana seperti gunung-gunung, lautan, daratan, padang sahara, pepohonan dan lain-lain. Dia menjadikan semua itu bukanlah untuk main-main, melainkan dengan penuh hikmah, agar perintah dan syari’at-Nya tegak, agar nikmat-Nya kepada hamba-hamba-Nya semakin sempurna, dan agar mereka mengetahui kebijaksanaan-Nya, keperkasaan-Nya, dan pengaturan-Nya, di mana hal itu menunjukkan keesaan-Nya, keberhakan-Nya untuk disembah, dan dicintai oleh semua makhluk-Nya. Bisa juga maksudnya, terdapat tanda yang menerangkan tuntutan keimanan jika seorang mukmin mau memikirkannya. Disebutkan “orang-orang yang beriman” secara khusus karena hanya mereka yang dapat mengambil manfaat daripadanya, berbeda dengan orang-orang kafir."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Ankabut Ayat 44",
    "description": "-."
  }
]