[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan bacalah apa yang diturunkan kepadamu dari al-Qur’an ini dan amalkanlah kandungannya, serta laksanakanlah shalat dengan seluruh aturannya. Sesungguhnya menjaga shalat dengan baik akan menahan orang yang melakukannya dari terjerumus di dalam maksiat-maksiat dan perbuatan-perbuatan mungkar. Hal itu dikarenakan orang yang menegakannya, yang menyempurnakan rukun-rukun dan syarat-syaratnya, hatinya akan bercahaya, dan keimanan, ketakwaan dan kecintaannya terhadap kebaikan akan bertambah, dan (sebaliknya) keinginannya terhadap keburukan akan semakin berkurang atau hilang sama sekali. Dan sungguh mengingat Allah di dalam shalat dan di tempat lainnya lebih agung dan lebih utama dari segala sesuatu. Dan Allah mengetahui apa saja yang kalian perbuat, yang baik maupun yang buruk. Lalu Dia memberikan balasan kepada kalian atas perbuatan tersebut dengan balasan yang sempurna lagi penuh."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "45. Bacakanlah -wahai Rasul- kepada manusia apa yang telah diwahyukan kepadamu oleh Allah dari Al-Qur`ān. Dan laksanakan salat dengan sempurna, sesungguhnya shalat yang dilaksanakan dengan tata cara yang sempurna akan mencegah pelakunya dari terjerumus ke dalam kemaksiatan dan kemungkaran, dikarenakan munculnya cahaya di dalam hati yang mencegahnya dari mendekati kemaksiatan dan menunjukinya kepada amal perbuatan yang saleh. Dan sungguh mengingat Allah itu lebih besar dan lebih agung dari segala sesuatu dan Allah itu Maha Mengetahui apa yang kalian kerjakan, tidak ada sesuatu pun dari amal perbuatan kalian yang luput dari-Nya, dan Dia akan membalas amal perbuatan tersebut, apabila baik dibalas dengan kebaikan, apabila buruk maka dibalas pula dengan keburukan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "45. Allah berfirman kepada Rasulullah: “Bacalah al-Qur’an yang diturunkan kepadamu untuk manusia dan amalkanlah ia; dan dirikanlah shalat sesuai aturannya karena shalat merupakan amalan yang agung. Shalat memiliki banyak manfaat bagi yang mengerjakannya, yaitu menghalanginya dari pelanggaran syariat, dapat mengingatkan kepada Allah, dan mengingatkan agar senantiasa menjauhi kemurkaan Allah. Shalat memiliki waktu-waktu tertentu di siang dan malam hari agar senantiasa menjadi pengingat. Shalat dapat mencegah perbuatan keji dan kemungkaran, karena ia adalah zikir kepada Allah, sedangkan zikir kepada Allah adalah perkara yang agung. Allah Maha Mengetahui perbuatan yang kalian lakukan, dan Allah akan meminta pertanggungjawaban atas perbuatan itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "45. اتْلُ مَآ أُوحِىَ إِلَيْكَ مِنَ الْكِتٰبِ (Bacalah apa yang telah diwahyukan kepadamu, yaitu Al Kitab (Al Quran)) Yakni bacalah al-Qur’an dengan menghayati ayat-ayatnya dan memperhatikan makna-maknanya. إِنَّ الصَّلَوٰةَ تَنْهَىٰ عَنِ الْفَحْشَآءِ وَالْمُنكَرِ ۗ (Sesungguhnya shalat itu mencegah dari (perbuatan-perbuatan) keji dan mungkar) Yakni tetaplah senantiasa menegakkan shalat sebagaimana diperintahkan. Makna (الفحشاء) adalah perbuatan yang buruk. Dan makna (المنكر) adalah sesuatu yang tidak dianjurkan dalam syariat. Adapun makna bahwa shalat mencegah perbuatan buruk dan mungkar yakni mengerjakan shalat merupakan sebab seseorang berhenti dari kemaksiatannya, sebab didalam shalat terkandung peringatan tentang pengawasan Allah dan terdapat penghayatan terhadap ayat-ayat-Nya. وَلَذِكْرُ اللهِ أَكْبَرُ ۗ( Dan sesungguhnya mengingat Allah (shalat) adalah lebih besar) Yakni lebih besar dari segala sesuatu. Yakni mengingat Allah (berzikir) adalah ibadah yang paling utama karena inilah yang dapat mencegah seseorang dari perbuatan buruk dan mungkar, sebab berhenti dari perbuatan buruk dan mungkar tidak mungkin dilakukan kecuali oleh orang yang mengingat Allah (berzikir) dan merasa diawasi Allah. Dan zikir yang terkandung di dalam shalat adalah sebab utama yang menjadikan shalat lebih mulia dari ketaatan yang lain. وَاللهُ يَعْلَمُ مَا تَصْنَعُونَ(Dan Allah mengetahui apa yang kamu kerjakan) Allah akan membalas kebaikan kalian dengan kebaikan dan membalas keburukan dengan keburukan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "45. Wahai Rasulallah, bacalah apa yang diwahyukan kepadamu berupa Al-Qur’an dengan merenung seraya berpikir tentang makna-maknanya dan dirikanlah shalat fardhu pada waktunya serta tetaplah menjaganya. Sesungguhnya shalat itu mencegah orang-orang mukmin dari setiap perbuatan buruk yang menyimpang dari syari’at. Dan sesungguhnya mengingat Allah, yaitu shalat merupakan ketaatan ter besar daripada segala ketaatan dan ibadah paling utama daripada setiap ibadah yang tidak mengandung dzikir, karena tidak ada yang paling sempurna kecuali orang yang mengingat Allah dan mendekatkan diri kepadaNya. Dan Allah mengetahui apa yang kalian perbuat dalam hidup kalian baik itu kebaikan atau keburukan dan membalas kalian atas hal itu. Al-Fakhsya’ adalah perbuatan buruk yang sudah keterlaluan seperti zina. Dan Al-Munkar adalah setiap sesuatu yang menyimpang dari syariat dan akal sehat seperti pembunuhan dan pengerusakan."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "45 Allah memerintahkan untuk membaca wahyuNya atau kitabNya, yaitu kitab al-qur’an yang agung ini. Makna “membaca al-qur’an” adalah mengikutinya dengan cara mematuhi apa yang diperintahkannya dan menjauhi apa yang dilarangnya, berpegang kepada petunjuknya, membenarkan apa-apa yang diinformasikannya, merenungkan makna-maknanya dan membaca lafazhnya. Jadi, membaca lafazh nya menjadi bagian dari maknanya dan termasuk dari bagian darinya. Apbila makna tilawah al-kitab itu demikian maknanya, maka diketahuilah bahwa penegakkan agama, semuanya masuk dalam (makna) “membaca al-qur’an’, Maka firmanNya,”dirikanlah shalat,” adalah termasuk dalam kategori menyambungkan (athaf) sesuatu yang bermakna khusus kepada yang bermakna umum, disebabkan keutamaan shalat, kemuliaan dan pengaruhnya yang sangat indah, yaitu, “sesungguhnya shalat itu mencegah dari (perbuatan-perbuatan) keji dan mungkar”, perbuatan keji adalah segala dosa yang tergolong besar dan terhitung keji, berupa segala bentuk maksiat yang dikehendaki oleh nafsu. Sedangkan mungkar adalah setiap maksiat yang diingkari oleh akal sehat dan fitrah. Dan sisi “keberadaan shalat”, dapat mencegah perbuatan keji dan mungkar adalah bahwa seorang hamba yang menegakkannya, menunaikan rukun-rukun, syarat-syarat dan kekhusyuannya, maka hatinya akan bersinar, jiwanya menjadi suci, imannya bertambah dan kemauannya pada kebaikan makin kuat, serta kemauannya pada keburukan berkurang atau habis. Secara pasti,”konsisten pada shalat,” dan memeliharanya akan mencegah perbuatan keji dan kemungkaran. Demikianlah di antara tujuan shalat dan buahnya. Dan di sisi lain, shalat juga mempunyai tujuan yang lebih besar daripada itu dan lebih agung, yaitu apa yang terkandung di dalam shalat itu sendiri, berupa dzikrullah dengan hati, lisan dan badan. Hal itu karena sesungguhnya Allah menciptakan manusia agar beribadah kepadaNya, dan ibadah yang paling utama yang mereka kerjakan adalah shalat. Dan di dalamnya juga terdapat penghambaan seluruh anggota tubuh yang tidak terdapat dalam ibadah yang lain. Maka dari itu Dia berfirman, ”dan sesungguhnya mengingat Allah adalah lebih besar,” ini bisa berarti bahwa ketika Dia memerintahkan shalat dan memujinya, Dia mengabarkan bahwa berdzikir mengingatNya di luar shalat itu lebih besar daripada shalat. Ini adalah pendapat jumhur (mayoritas) para ahli tafsir. Akan tetapi pengertian yang lebih tepat. Sebab shalat merupakan dzikir yang lebih utama daripada dzikir di luar shalat; dan karena shalat itu sendiri, sebagaimana dijelaskan di muka, merupakan dzikir yang paling agung. “dan Allah mengetahui apa yang kamu kerjakan,” (berupa) kebaikan dan keburukan, lalu Dia akan memberikan balasan kepada kalian atas semua itu dengan pembalasan yang paling sempurna."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Ankabut ayat 45: Allah memerintahkan Nabi-Nya Muhammad ﷺ agar terus membacakan apa yang Allah turunkan baginya, dari Al Qur’an ini dengan tadabbur dan penuh pelajaran, dan agar pula taat kepada perintah-perintah dan menjauhi larangan-larangan-Nya. Allah memerintahkan untuk menegakkan shalat pada waktunya dengan menyempurnakan rukun dan wajibnya serta khusyuk dan dengan ketundukkan, karena orang yang menjaga akan shalat akan menghalangi dari jatuh kedalam keburukan dengan segala macamnya, sebagaimana Allah memerintahkan untuk memperbanyak dzikir kepada Allah dalam shalat dan pada semua keadaan; Karena sesungguhnya mengingat Allah adalah keagungan dan utama serta sebuah amalan. Allah memerintahkan kepada Nabi-Nya ﷺ dengan amalan-amalan ini agar menyampaikan kepada umatnya; Karena ini termasuk terkandung dalam kerisalahannya ﷺ. Ketahuilah wahai manusia, bahwasanya Allah mengetahui apa yang kalian perbuat dari kebaikan dan keburukan, kalian akan dibalas atas amalan-amalan kalian dengan kebaikan jika amalan kalian baik, dan kejelekkan jika amalan kalian jelek."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memerintahkan untuk mentilawahkan wahyu-Nya, yaitu kitab-Nya ini. Tilawah memiliki dua arti: (1) Ittiba’ (mengikuti), yakni kita diperintahkan untuk mengikuti perintah yang ada dalam kitab itu dan menjauhi larangannya, mengambilnya sebagai petunjuk, membenarkan beritanya, dan mentadabburi maknanya. (2) Tilawah alfzaazhihi (membaca lafaznya), sehingga membaca merupakan bagiannya. Jika tilawah seperti ini maknanya (membaca dan mengikuti), maka berarti dalam tilawah terdapat penegakkan agama secara keseluruhan. Ini termasuk menghubungkan yang khusus dengan yang umum sebelumnya (yakni tilawah kitab-Nya), hal ini karena keistimewaan shalat dan pengaruhnya yang indah dalam kehidupan. Keji adalah perbuatan yang dianggap sangat buruk di antara perbuatan maksiat yang disenangi oleh jiwa. Mungkar adalah semua maksiat yang diingkari oleh akal dan fitrah. Sebab mengapa shalat dapat mencegah dari perbuatan keji dan mungkar adalah karena seorang hamba yang mendirikannya; yang menyempurnakan syarat dan rukunnya disertai sikap khusyu’ (hadirnya hati) sambil memikirkan apa yang ia baca, maka hatinya akan bersinar dan menjadi bersih, imannya bertambah, kecintaannya kepada kebaikan menjadi kuat, keinginannya kepada keburukan menjadi kecil atau bahkan hilang, sehingga jika terus menerus dilakukan, maka akan membuat pelakunya mencegah dari perbuatan keji dan mungkar, hubungannya dengan Allah terjalin, sehingga Allah memberikan kepadanya penjagaan, dan setan yang mengajak kepada kemaksiatan merasa kesulitan untuk menguasai dirinya. Inilah buah yang dihasilkan dari shalat, namun di sana terdapat maksud yang lebih besar dari itu, yaitu dapat tercapai dzikrullah (mengingat Allah) seperti yang dikandung oleh shalat itu sendiri, di mana di dalamnya terdapat dzikrullah baik dengan hati, lisan maupun dengan anggota badan, dan lagi Allah Subhaanahu wa Ta'aala menciptakan manusia untuk beribadah kepada-Nya, sedangkan ibadah yang paling utama adalah shalat yang di sana terdapat bukti penghambaan anggota badan secara keseluruhan yang tidak terdapat pada ibadah selainnya. Oleh karena itulah, pada lanjutan ayatnya Allah Subhaanahu wa Ta'aala berfirman, “Dan (ketahuilah) mengingat Allah (shalat) itu lebih besar…dst.” Baik atau buruk, oleh karena itu, Dia akan memberikan balasan kepadamu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Ankabut Ayat 45",
    "description": "-46. Pada ayat sebelumnya Allah memberi umat islam petunjuk dalam menghadapi kaum musyrik mekah atau para penyembah berhala. Allah lalu menyusulinya dengan ayat ini, yang mengajarkan cara berdakwah kepada kaum yahudi dan nasrani. Dan janganlah kamu, wahai umat islam, berdebat demi menunjukkan kebenaran ajaran islam dengan ahli kitab, yakni yahudi dan nasrani yang mengingkari kerasulan nabi Muhammad, melainkan dengan cara yang lebih baik dibanding caramu menghadapi orang-orang musyrik yang tidak percaya tuhan. Kaum yahudi dan nasrani sejatinya percaya kepada tuhan dan ajaran yang dibawa oleh nabi musa dan isa sehingga lebih mudah bagimu untuk mengajak mereka kepada agama islam. Berdebatlah dengan cara yang lebih baik, kecuali dengan orang-orang yang zalim di antara mereka, yaitu orang-orang yang tetap membantah, membangkang, bahkan memusuhimu setelah menerima penjelasan-penjelasan yang kamu sampaikan dengan cara terbaik. Kamu bisa menunjukkan cara dan sikap yang lebih tegas kepada mereka itu, dan katakanlah kepada mereka, 'kami telah beriman kepada kitab Al-Qur'an yang diturunkan kepada kami dan kitab-kitab yang diturunkan kepadamu, yakni taurat dan injil. Tuhan kami dan tuhan kamu sesungguhnya satu, yaitu Allah; dan hanya kepada-Nya kami senantiasa berserah diri. '."
  }
]