[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan janganlah kalian (wahai kaum Mukminin) mendebat kaum Yahudi dan Nasrani kecuali dengan cara yang baik dan ucapan yang bagus serta dakwah kepada kebenaran melalui metode yang paling mudah menuju tujuan tersebut, kecuali orang-orang yang menyimpang dari kebenaran, membangkang dan berlaku sombong serta mengumumkan api permusuhan terhadap kalian. Maka lawanlah mereka dengan pedang hingga mereka beriman atau mau menyerahkan jizyah sendiri sedang mereka dalam keadaan terhina. Dan katakanlah, “Kami beriman kepada al-Qur’an yang diturunkan kepada kami dan kami beriman kepada Taurat dan Injil yang diturunkan kepada kalian. Dan Tuhan Kami dan Tuhan kalian adalah satu. Tidak ada sekutu bagiNya dalam uluhiyah dan rububiyah serta nama dan sifatNya. Dan kami tunduk dan menghinakan diri kepadaNya dengan ketaatan dalam perkara yang diperintahkan kepada kami dan larangan yang tertuju kepada kami.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "46. Dan janganlah kalian -wahai orang-orang yang beriman- bermusyawarah dan mendebat orang-orang Yahudi dan orang-orang Nasrani melainkan dengan cara yang baik dan metode yang benar, yaitu dengan dakwah menggunakan nasihat dan hujah-hujah yang jelas. Kecuali terhadap orang-orang yang zalim di antara mereka dengan melakukan pertentangan dan kesombongan serta mengumumkan perang terhadap kalian. Maka perangilah mereka hingga mereka menyerah atau membayar jizyah (pajak) dengan patuh sedang mereka dalam keadaan tunduk. Dan katakan kepada orang-orang Yahudi dan Nasrani, “Kami telah beriman kepada Al-Qur`ān yang diturunkan oleh Allah kepada kami dan kami beriman kepada Taurat dan Injil yang diturunkan kepada kalian. Tuhan kami dan Tuhan kalian adalah satu, tidak ada sekutu bagi-Nya di dalam uluhiyah-Nya, rububiyah-Nya dan kesempurnaan-Nya, dan hanya kepada-Nya semata kami tunduk dan patuh."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "46. Allah memberi petunjuk kepada orang-orang beriman dan mengajari mereka kebijaksanaan dalam berinteraksi dengan orang-orang Yahudi dan Nasrani. Allah melarang berdebat dengan mereka melainkan dengan cara yang baik, dan menyampaikan nasehat dengan baik agar dapat mengantarkan kepada kebenaran; kecuali bagi mereka yang berbuat zalim dengan menyatakan perang terhadap orang-orang beriman, maka hendaklah orang-orang beriman menyikapi mereka dengan keras dan tegas. Kemudian Allah menjelaskan kepada orang-orang beriman apa yang seharusnya dikatakan saat berbicara dengan mereka: “Katakanlah, kami mengimani al-Qur’an yang diturunkan kepada kami, dan kami juga mengimani Taurat dan Injil yang diturunkan kepada kalian. Tuhan kami dan Tuhan kalian adalah satu, dan kami tunduk dan taat kepada-Nya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "46. وَلَا تُجٰدِلُوٓا۟ أَهْلَ الْكِتٰبِ إِلَّا بِالَّتِى هِىَ أَحْسَنُ (Dan janganlah kamu berdebat denganAhli Kitab, melainkan dengan cara yang paling baik) Yaitu dengan memperingati mereka lewat hujjah dan bukti dari Allah, dengan harapan mereka akan menerima agama Islam; dan bukan dengan cara yang keras dan kasar. إِلَّا الَّذِينَ ظَلَمُوا۟ مِنْهُمْ ۖ(kecuali dengan orang-orang zalim di antara mereka) Yakni mereka yang berlebihan dalam berdebat dan tidak menjaga adab dengan orang-orang beriman. Ketika itu dibolehkan untuk berlaku keras dan kasar dalam berdebat dengan mereka. وَقُولُوٓا۟ ءَامَنَّا بِالَّذِىٓ أُنزِلَ إِلَيْنَا(dan katakanlah: “Kami telah beriman kepada (kitab) yang diturunkan kepada kami) Yakni al-Qur’an. وَأُنزِلَ إِلَيْكُمْ(dan yang diturunkan kepadamu) Yakni Taurat dan Injil; kami beriman bahwa dua kitab itu diturunkan dari Allah, dan keduanya adalah syariat yang berlaku sampai datangnya syariat Islam dan diutusnya Nabi Muhammad; dan tidak termasuk dari dua kitab tersebut apa yang mereka ubah dan ganti. وَإِلٰهُنَا وَإِلٰهُكُمْ وٰحِدٌ (Tuhan kami dan Tuhanmu adalah satu) Tidak ada sekutu bagi-Nya. وَنَحْنُ لَهُۥ مُسْلِمُونَ (dan kami hanya kepada-Nya berserah diri) Yakni kami sebagai umat Nabi Muhammad hanya mentaati-Nya semata. Terdapat sebuah hadits yang dikeluarkan oleh Imam Bukhari dan Nasa’i dari Abu Hurairah, ia berkata: dahulu para Ahli Kitab membaca Taurat dengan bahasa Ibrani dan mentafsirkannya dengan bahasa Arab untuk kaum muslimin. Kemudian Rasulullah bersabda: “janganlah kalian mempercayai Ahli Kitab dan jangan pula kalian dustakan mereka, namun katakanlah: ‘kami beriman kepada kitab yang diturunkan kepada kami dan yang diturunkan kepada kalian, dan Tuhan kami dan Tuhan kalian adalah satu, dan kami hanya berserah diri kepada-Nya’.” Dan hadits yang dikeluarkan Imam Baihaqi dari Jabir bin Abdullah, ia berkata, Rasulullah bersabda: “janganlah kalian menanyakan sesuatu pada Ahli Kitab, mereka tidak akan dapat memberi kalian hidayah, sebab mereka sendiri telah tersesat. Jika kalian menanyakannya kepada mereka bisa jadi kalian akan membenarkan sesuatu yang batil atau mendustakan sesuatu yang benar. Demi Allah, seandainya Musa masih hidup diantara kalian maka dia tidak akan dibolehkan kecuali menjadi pengikutku.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "46. Wahai orang-orang mukmin, janganlah kalian berdebat dengan kaum Yahudi dan Nasrani kecuali perdebatan yang masuk akal untuk menjelaskan kebenaran dengan cara paling baik yang di dalamnya tetap menjaga keintahan ucapan, keluwesan kalimat dan penahanan nafsu (emosi), namun orang-orang yang menzalimi dari golongan mereka itu telah melampaui batas keras kepalanya. Tidak masalah jika menanggapi mereka dengan hal serupa. Dalam perdebatan kalian, katakanlah kepada mereka: “Kami mengimani apa yang diturunkan kepada kami berupa Al-Qur’an, dan apa yang diturunkan kepada kalian berupa Taurat dan Injil tanpa menyimpang dan menggantinya. Tuhan kami dan Tuhan kalian hanya satu dan tidak ada sekutu bagiNya. Dan kami adalah-orang-orang yang taat dan tunduk kepadaNya” Al-Baihaqi meriwayatkan dari Sya’b bin Jabir yang berkata: “Rasulallah SAW bersabda: “Janganlah kalian bertanya kepada ahli kitab tentang sesuatu apapun. Sesungguhnya mereka tidak memberi kalian petunjuk melainkan menyesatkan, atau kalian akan membenarkan kebathilan dan mendustakan kebenaran. Demi Allah, jika saja Musa masih hidup di antara kalian maka tidak ada tempat baginya kecuali mengikutiku”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "46 Allah melarang berdebat dengan ahli kitab jika dilakukan tanpa dilandasai pengetahuan yang mendalam dari pihak yang akan mendebat, atau tanpa landasan kaidah yang benar, dan hendaknya tidak mendebat (mereka) kecuali dengan cara yang terbaik, dengan akhlak yang mulia, santun, perkataan yang lembut dan berdakwah kepada kebenaran dan memperindah yang haq, dan dengan menolak kebatilan dan mematahkannya dengan cara yang paling mudah yang bisa mengantarkan kepadanya. Dan hendaknya niat atau tujuan dari perdebatan tidak hanya sekedar perdebatan, sikap ingin mengalahkan dan ingin menjadi yang teratas. Akan tetapi tujuannya adalah menjelaskan kebenaran dan memberikan petunjuk kepada manusia, “kecuali,” dengan orang zhalim di antara ahli kitab. Yaitu dengan tampaknya tujuan dan keadaannya bahwa dia sama sekali tidak mempunyai keinginan pada kebenaran. Tentu sama sekali tidak ada faidahnya mendebat orang seperti ini, karena tujuan dari perdebatan menjadi hilang. “dan katakanlah,’kami telah beriman kepada (kitab-kitab) yang diturunkan kepada kami dan yang diturunkan kepadamu, tuhan (sembahan) kami dan tuhanmu adalah satu’,” maksudnya, hendaklah perdebatan kalian dengan ahli kitab dilandasai dengan beriman kepada sesuatu yang diturunkan kepada kalian dan sesuatu yang diturunkan kepada mereka, dan beriman kepada Rasul kalian dan Rasul mereka, dan berdasarkan landasan bahwa sembahan itu satu. Dan hendaknya diskusi kalian dengan ahli kitab tidak dengan cara yang dapat melecehkan sedikitpun dari kitab-kitab suci, atau mencemarkan salah seorang Rasul, sebagaimana yang dilakukan oleh orang-orang jahil saat berdebat dengan lawan, ia mencemooh semua yang ada pada lawannya, baik yang haq maupun yang batil. Hal demikian adalah kezhaliman yang menyimpang dari yang wajib dan dari etika perdebatan. Karena sesungguhnya yang wajib adalah membantah kebatilan yang ada pada lawan dan menerima kebenaran yang ada padanya, tidak boleh menolak kebenaran karena perkatan lawan sekalipun dia adalah seorang kafir. Dan juga, karena melandasi debat ahli kitab dengan cara di atas mengandung pengharusan terhadap mereka untuk mengakui al-qur’an dan rasul yang membawanya (Muhammad.) sebab, apabila dia membicarakan prinsip-prinsip agama dan sesuatu yang telah disepakati oleh para nabi dan kitab-kitab suci samawi dan sudah disetujui oleh kedua belah pihak yang berdebat dan sudah dipastikan kebenarannya, di mana kitab-kitab sebelumnya dan para rasul bersama al-qur’an dan Muhammad benar-benar telah menjelaskannya, membuktikan dan mengabarkannya, maka hal itu mengharuskan mereka meyakini (dengan membenarkan) semua kitab-kitab suci samawi dan seluruh para rasul. Inilah di antara keistimewaan islam. Adapun kalau (malah) dikatakan,”kami hanya beriman kepada sesuatu yang dijelaskan oleh kitab suci saja, tanpa meyakini kitab suci yang lain, padahal itu yang benar yang membenarkan kitab-kitab sebelumnya, maka sikap ini adalah sikap kezhaliman dan hawa nafsu. Sikap itu kembali pada pernyataan pendustaan. Sebab, apabila dia mendustakan al-qur’an yang membuktikan kebenaran dan yang membenarkan kitab Taurat yang sudah ada sebelumnya, maka sesungguhnya dia berarti mendustakan pernyataan yang telah dia klaim bahwa dia telah beriman kepadanya. Dan juga, karena setiap cara yang dapat membuktikan kepada kenabian Muhammad. Dan setiap syubhat (pemikiran yang keliru) yang dijadikan dasar untuk mendiskreditkan kenabian Muhammad, maka cara yang semisal dengannya atau yang lebih hebat darinya bisa diarahkan kepada kenabian dari nabi yang lain. Apabila telah terbukti kepalsuan syubhat tersebut pada nabi lainnya maka kepastian kepalsuannya pada kebenaran Nabi Muhammad menjadi lebih jelas lagi. “dan hanya kepadaNya kami berserah diri,” maksudnya, kami tunduk berserah diri kepada perintahNya. Siapa saja yang beriman kepadaNya, menjadikanNya sebagai sembahan dan beriman kepada seluruh kitab-kitabNya dan para RasulNya, serta tunduk kepada Allah dan mengikuti para RasulNya maka dialah orang yang berbahagia. Dan siapa saja yang menyimpang dari jalan ini, maka dialah orang yang sengsara."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Ankabut ayat 46: Allah memerintahkan orang-orang yang beriman agar mendebat orang-orang yahudi dan nasrani dengan ungkapan yang baik, dan ucapan yang baik; Jauh dari kekotoran dalam ucapan, dari celaan dan dari olok-olok; Kecuali jika mereka telah meninggalkan adab, bersikap buruk dan sombong, maka debatlah mereka dengan ungkapan yang keras. Katakan kepada mereka : Sesungguhnya kami beriman dengan Al Qur’an ini yang diturunkan kepada kami, kami juga beriman kepada taurat dan injil yang diturunkan kepada kalian, karena Tuhan kami dan kalian satu, tiada sekutu bagi-Nya; Tidak disekutukan dalam dzat-Nya, tidak dalam uluhiyyah-Nya dan juga tidak pada rububiyyah-Nya serta nama-nama dan sifat-sifat-Nya. Kami semua tunduk, taat kepada-Nya saja dengan apa yang Dia perintahkan dan larang kepada kami, dan juga mentaati Rasul-Nya yang menyampaikan kepada kami. Allah memerintahkan orang-orang beriman untuk tidak debat kusir dengan yahudi dan nasrani kecuali dengan kebaikan, mencakup juga kepada seluruh agama, firqah, ahli ahwa, ahli milal, madzhab dan pemikiran."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Seperti mengajak kepada Allah dengan ayat-ayat-Nya dan mengingatkan hujjah-hujjah-Nya. Yang dimaksud dengan orang-orang yang zalim ialah orang-orang yang setelah diberikan kepadanya keterangan-keterangan dan penjelasan-penjelasan dengan cara yang baik, mereka tetap membantah dan membangkang dan tetap menyatakan permusuhan. Ada pula yang menafsirkan tentang orang-orang yang zalim, yaitu orang-orang yang malah memerangi dan enggan membayar jizyah (pajak), maka bantah mereka dengan pedang (perang) sampai mereka mau masuk Islam atau membayar jizyah. Qatadah dan selainnya berkata, “Ayat ini dimansukh dengan ayat pedang (perang), sehingga tidak lagi berdebat dengan mereka, yang ada hanyalah masuk Islam, membayar jizyah atau perang.” Sedangkan menurut yang lain, bahwa ayat ini tetap berlaku hukumnya, yakni bagi orang yang ingin mengkaji lebih lanjut terhadap agama Islam dari kalangan mereka, maka dilakukan perdebatan dengan cara yang baik. Syaikh As Sa’diy berkata, “Allah Subhaanahu wa Ta'aala melarang mendebat Ahli Kitab jika pendebatnya tidak di atas ilmu atau tidak di atas kaidah yang diridhai, dan melarang mereka agar tidak berdebat kecuali dengan cara yang baik seperti akhlak yang baik, lembut dan tutur kata yang halus, mengajak kepada yang hak dan menghiasnya, membantah kebatilan dan memperburuknya dengan cara yang lebih dekat sampai kepada maksud, dan agar tidak ada maksud untuk sekedar berdebat, memenangkan diri dan cinta ketinggian, bahkan maksudnya adalah menerangkan yang hak, dan memberi petunjuk kepada manusia kecuali Ahli kitab yang zalim, di mana tampak dari niat dan keadaannya tidak menginginkan yang hak, bahkan maksudnya mengacaukan dan memenangkan diri, maka orang ini tidak ada faedahnya mendebatnya, karena maksud yang diinginkan daripadanya tidak ada.” Yakni kepada orang-orang yang mau menerima jizyah apabila mereka memberitakan sesuatu yang berasal dari kitab-kitab mereka. Dengan tidak membenarkan mereka dan tidak mendustakan. Yakni hendaknya perdebatan kamu dengan Ahli kitab didasari atas iman kepada kitab yang diturunkan kepada kamu dan kitab yang diturunkan kepada mereka, demikian juga di atas keimanan kepada rasul kamu dan rasul mereka serta di atas dasar bahwa Tuhan yang berhak disembah hanya satu, yaitu Allah Subhaanahu wa Ta'aala. Janganlah perdebatan kamu dengan mereka malah mencacatkan salah satu di antara kitab-kitab yang diturunkan atau salah seorang rasul sebagaimana yang dilakukan orang yang jahil terhadap lawannya sampai-sampai ia mencacatkan semua yang ada pada mereka, yang hak maupun yang batil. Ini adalah kezaliman dan keluar dari yang wajib serta keluar dari adab berdebat. Karena yang wajib adalah membantah kebatilan yang ada pada orang yang berdebat dan menerima kebenaran yang ada padanya dan jangan sampai ia menolak yang hak karena ucapannya meskipun kafir. Di samping itu mendasari perdebatan dengan mereka di atas dasar ini membuat mereka mengakui Al Qur’an dan Rasul yang membawanya. Hal itu, karena apabila berbicara tentang dasar-dasar agama yang disepakati oleh para nabi dan rasul serta disepakati oleh semua kitab, lalu dasar-dasar itu diakui semua pihak, di mana kitab-kitab yang diturunkan dan para rasul yang diutus menerangkan sama dengan yang disebutkan oleh Rasulullah shallallahu 'alaihi wa sallam dan Al Qur’an, maka yang demikian menghendaki untuk membenarkan semua kitab dan semua rasul, dan inilah di antara keistimewaan Islam. Adapun jika dikatakan, “Kami beriman dengan kitab yang dibawa rasul ini, tidak rasul yang itu, padahal ia juga hak dan membenarkan kitab sebelumnya, maka ia berarti zalim dan berbuat tidak adil, dan secara tidak langsung ia juga mendustakan kitab yang diturunkan kepada rasul yang ia sebutkan, karena barang siapa mendustakan Al Qur’an yang sama menunjukkan seperti yang ditunjukkan kitab sebelumnya, bahkan membenarkan kitab-kitab yang diturunkan sebelumnya, maka sama saja ia mendustakan kitab-kitab yang diturunkan sebelumnya. Oleh karena itu, barang siapa yang beriman kepada-Nya, menjadikan-Nya sebagai Tuhannya yang disembah, beriman kepada semua kitab dan semua rasul, tunduk kepada Allah dan rasul-rasul-Nya, maka dia adalah orang yang berbahagia, dan barang siapa yang menyimpang daripadanya, maka dia adalah orang yang celaka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Ankabut Ayat 46",
    "description": "Pada ayat sebelumnya Allah memberi umat islam petunjuk dalam menghadapi kaum musyrik mekah atau para penyembah berhala. Allah lalu menyusulinya dengan ayat ini, yang mengajarkan cara berdakwah kepada kaum yahudi dan nasrani. Dan janganlah kamu, wahai umat islam, berdebat demi menunjukkan kebenaran ajaran islam dengan ahli kitab, yakni yahudi dan nasrani yang mengingkari kerasulan nabi Muhammad, melainkan dengan cara yang lebih baik dibanding caramu menghadapi orang-orang musyrik yang tidak percaya tuhan. Kaum yahudi dan nasrani sejatinya percaya kepada tuhan dan ajaran yang dibawa oleh nabi musa dan isa sehingga lebih mudah bagimu untuk mengajak mereka kepada agama islam. Berdebatlah dengan cara yang lebih baik, kecuali dengan orang-orang yang zalim di antara mereka, yaitu orang-orang yang tetap membantah, membangkang, bahkan memusuhimu setelah menerima penjelasan-penjelasan yang kamu sampaikan dengan cara terbaik. Kamu bisa menunjukkan cara dan sikap yang lebih tegas kepada mereka itu, dan katakanlah kepada mereka, 'kami telah beriman kepada kitab Al-Qur'an yang diturunkan kepada kami dan kitab-kitab yang diturunkan kepadamu, yakni taurat dan injil. Tuhan kami dan tuhan kamu sesungguhnya satu, yaitu Allah; dan hanya kepada-Nya kami senantiasa berserah diri. '47. Dan sebagaimana kami telah menurunkan kitab-kitab kepada para rasul sebelum engkau, demikianlah kami juga turunkan kitab Al-Qur'an kepadamu. Oleh karena itu, orang-orang yang telah kami berikan kitab, yakni taurat dan injil, dan tidak menutupi kebenaran isinya, terutama informasi tentang nabi Muhammad, tentu mereka beriman kepadanya, yakni Al-Qur'an. Dan di antara mereka, yakni orang-orang kafir mekah, ada juga orang yang beriman kepadanya, Al-Qur'an. Dan hanya orang-orang kafir yang mengingkari ayat-ayat kami dan terus-menerus dalam kekafirannya."
  }
]