[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sebagaimana Kami (wahai rosul) telah menurunkan kitab-kitab kepada rasul-rasul sebelum kamu, Kami menurunkan kepadamu kitab yang membenarkan kitab-kitab terdahulu. Maka orang-orang yang Kami anugerahkan al-Kitab kepada mereka dari kalangan Bani Israil, lalu mereka memahaminya dengan sebenarnya, mereka itu beriman kepada al- Qur’an. Dan dari kalangan bangsa Arab dari suku Quraisy dan lainnya ada yang beriman kepadanya. Tidak ada orang yang mengingkari al-Qur’an atau ragu-ragu terhadap dalil-dalil dan bukti-buktinya yang nyata, kecuali orang-orang kafir yang sudah menjadi kebiasaan mereka untuk mengingkari dan membangkang."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "47. Dan sebagaimana Kami telah menurunkan kitab-kitab kepada orang-orang sebelummu, maka Kami pun menurunkan kepadamu Al-Qur`ān. Sebagian orang-orang yang membaca Taurat seperti Abdullah bin Salam, beriman kepada Al-Qur`ān karena mereka mendapati ciri-cirinya telah disebutkan di dalam kitab-kitab mereka. Dan di antara orang-orang musyrik juga ada yang beriman kepadanya, dan tidaklah ingkar terhadap ayat-ayat Kami kecuali orang-orang kafir yang memang tabiatnya adalah pengingkaran dan penolakan terhadap kebenaran meski sudah jelas sebagai kebenaran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "47. Hai Rasulullah, sebagaimana Kami menurunkan Taurat dan lainnya, Kami juga menurunkan al-Qur’an kepadamu. Orang-orang Yahudi dan Nasrani yang mengikuti kebenaran akan beriman kepada al-Qur’an, dan sebagian orang arab juga akan beriman kepadanya. Dan tidaklah ada orang yang mendustakan al-Qur’an dan mukjizat-mukjizat melainkan orang yang teguh dalam kekafiran."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "47. وَكَذٰلِكَ أَنزَلْنَآ إِلَيْكَ الْكِتٰبَ ۚ (Dan demikian (pulalah) Kami turunkan kepadamu Al Kitab (Al Quran)) Yakni dengan penurunan kitab yang menakjubkan ini, demikian pula al-Qur’an Kami turunkan kepadamu. فَالَّذِينَ ءَاتَيْنٰهُمُ الْكِتٰبَ يُؤْمِنُونَ بِهِۦ ۖ( Maka orang-orang yang telah kami berikan kepada mereka Al Kitab (Taurat) mereka beriman kepadanya (Al Quran)) Yakni orang-orang yang telah beriman dari Ahli Kitab, seperti Abdullah bin Salam dan para sahabatnya. وَمِنْ هٰٓؤُلَآءِ(dan di antara mereka) Yakni penduduk Makkah yang telah masuk Islam. Pendapat lain mengatakan bahwa ini mencakup seluruh orang Arab. مَن يُؤْمِنُ بِهِۦ ۚ( ada yang beriman kepadanya) Yakni kepada al-Qur’an. وَمَا يَجْحَدُ بِـَٔايٰتِنَآ (Dan tiadalah yang mengingkari ayat-ayat kami) Yakni ayat-ayat al-Qur’an. إِلَّا الْكٰفِرُونَ (selain orang-orang kafir) Yakni orang-orang musyrik dan Ahli Kitab yang terus menerus dalam kekafiran mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "47. Seperti penurunan Taurat dan kitab lainnya itulah Kami menurunkan Al-Qur’an yang membenarkan kitab-kitab Tuhan yang mendahuluinya. Orang-orang yang Kami beri kitab yaitu kaum Yahudi dan Nasrani lalu mengikuti kandungan dalam kitab-kitab mereka, maka mereka akan beriman kepada Al-Qur’an ini seperti Abdullah bin Salam dan kelompoknya. Tidak ada yang mengingkari kebenaran ayat-ayat Al-Qur’an kecuali orang yang bersikeras atas kekufuran yaitu orang-orang musyrik dan ahli kitab. Al-Juhud adalah pengingkaran yang dilakukan dengan lisan terhadap sesuatu yang tetap dalam hati."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "47 maksudnya, “dan demikian pulalah kami turunkan kepadamu,” wahai Muhammad, “al-kitab” yang mulia, yang menjelaskan setiap berita yang agung, yang menyeru kepada setiap akhlak mulia dan perkara yang sempurna, yang membenarkan kitab-kitab suci terdahulu, yang diberitakan oleh para nabi terdahulu, “lalu orang-orang yang telah Kami berikan kepada mereka Al-kitab,” mereka mengenalnya dengan sebenar-benarnya, dan mereka belum dirasuki oleh rasa dengki dan hawa nafsu, “maka mereka beriman kepadanya,” karena mereka meyakini kebenarannya berdasarkan kesesuaian pengetahuan yang mereka miliki, dan berdasarkan berita-berita gembira yang ada pada mereka serta karena mereka diistimewakan dengan kemampuan untuk membedakan antara yang baik dan yang buruk, antara yang benar dan yang dusta. “dan diantara mereka (orang-orang kafir Makkah),” yang ada “ada yang beriman kepadanya,” dengan iman yang dilandasi pengetahuan yang mendalam, bukan karena suka atau takut. “dan tidaklah yang mengingkari ayat-ayat Kami melainkan orang-orang yang kafir,” yaitu mereka yang karakternya adalah yang mengingkari kebenaran dan menentangnya. Ini adalah pembatasan terhadap orang-orang yang kafir kepadanya. Yaitu bahwa tidak ada seorangpun (dari mereka) yang tujuannya adalah mencari kebenaran. Kalau tidak demikian, maka setiap orang yang mempunyai tujuan yang benar pasti beriman kepadanya. Hal itu disebabkan karena didalamnya terdapat bukti-bukti yang nyata bagi setiap orang yang masih mempunyai akal sehat atau mendengar dengan baik sedangkan ia menyaksikan. Di antara bukti yang membuktikan kebenarannya adalah bahwa al-qur’an ini dibawa oleh seorang nabi yang dipercaya, nabi yang dikenal kejujuran dan keamanahannya, tempat masuk dan tempat keluarnya serta seluruh kondisinya oleh kaumnya; dan dia tidak pernah menulis satu barispun dengan tangannya, bahkan dia sama sekali tidak bisa membaca satu baris pun yang tertulis. Jadi, kondisi beliau dalam membawa al-qur’an dalam kondisi seperti itu merupakan bukti yang pasti dan paling jelas, yang sama sekali tidak dapat diragukan bahwa al-qur’an ini datang dari sisi Allah Yang Mahaperkasa lagi Maha Terpuji."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Ankabut ayat 47: Sebagaimana diturunkan kitab-kitab kepada rasul yang sebelum engkau wahai Nabi Allah, kami juga menurunkan kepadamu Al Qur’an ini yang agung, maka orang-orang yang dalam ilmunya dari ahli kitab yang telah turun kepadanya taurat dan injil (seperti Abdullah bin Salam), mereka akan mengimani Al Qur’an, karena Al Qur’an adalah kebenaran di sisi Allah. Begitu juga dengan orang-orang arab quraisy dan selain (agar) mereka yang beriman dengan Al Qur’an dan membenarkannya. Dan tidaklah mengingkari ayat-ayat Kami kecuali kaum yang sombong yang mereka menerobos batasan-batasan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang menerangkan berita yang besar, yang mengajak kepada akhlak yang mulia dan perintah yang sempurna serta membenarkan kitab-kitab sebelumnya, dan dikabarkan oleh para nabi sebelumnya. Yakni sebagaimana Kami turunkan Taurat dan selainnya kepada mereka. Mereka mengetahuinya dengan sebenar-benarnya dan tidak dimasuki hasad dan hawa nafsu, seperti sikap yang diambil Abdullah bin salam dan kawan-kawannya. Mereka meyakini kebenaran Al Qur’an karena kesamaan dengan apa yang mereka pegang selama ini. Yakni beriman di atas pandangannya yang tajam, bukan karena sekedar senang atau takut kepadanya. Yakni yang kebiasaannya adalah menolak yang hak dan membangkang terhadapnya. Hal ini adalah pembatasan untuk orang-orang yang kafir kepada Al Qur’an, bahwa tidak ada maksudnya untuk mengikuti yang hak, padahal siapa saja yang memiliki maksud yang benar, maka ia pasti beriman kepadanya karena kandungannya yang terdiri dari bukti dan keterangan yang nyata bagi orang yang mempunyai akal, siap mendengarkan dan hadir hatinya. Di antara dalil yang menunjukkan kebenarannya adalah bahwa ia dibawa oleh nabi yang terpercaya, di mana kaumnya sudah mengenal kejujurannya, amanahnya, dan semua keadaannya yang seluruhnya baik. Di samping itu, sebagaimana diterangkan pada ayat selanjutnya, Beliau tidak mampu menulis dan tidak bisa membaca, sehingga jika Beliau membawa kitab yang agung ini, maka hal itu merupakan bukti yang nyata yang tidak menerima lagi keraguan bahwa kitab itu turun dari sisi Allah Yang Mahaperkasa lagi Maha terpuji."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Ankabut Ayat 47",
    "description": "Dan sebagaimana kami telah menurunkan kitab-kitab kepada para rasul sebelum engkau, demikianlah kami juga turunkan kitab Al-Qur'an kepadamu. Oleh karena itu, orang-orang yang telah kami berikan kitab, yakni taurat dan injil, dan tidak menutupi kebenaran isinya, terutama informasi tentang nabi Muhammad, tentu mereka beriman kepadanya, yakni Al-Qur'an. Dan di antara mereka, yakni orang-orang kafir mekah, ada juga orang yang beriman kepadanya, Al-Qur'an. Dan hanya orang-orang kafir yang mengingkari ayat-ayat kami dan terus-menerus dalam kekafirannya. 48. Dan seharusnya mereka meyakini kebenaran Al-Qur'an sebagai kitab suci yang Allah turunkan kepada engkau, wahai nabi Muhammad, sebab mereka tahu benar bahwa engkau tidak pernah membaca sesuatu kitab pun sebelum Al-Qur'an dan engkau juga tidak pernah menulis suatu kitab pun dengan tangan kananmu karena engkau adalah seorang ummi, tidak pandai membaca maupun menulis. Sekiranya engkau pernah membaca dan menulis, niscaya ragu orang-orang yang mengingkarinya, yakni Al-Qur'an. Mereka akan menemukan alasan bagi keraguan mereka kepada Al-Qur'an andaikata engkau pernah membaca dan/atau menulis."
  }
]