[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan termasuk mukjizat-mukjizatmu yang nyata (wahai Rasul) adalah bahwasanya kamu itu tidak dapat membaca kitab apa pun dan menulis huruf-huruf dengan tanganmu sendiri sebelum turunnya al-Qur’an kepadamu. Dan mereka tahu itu. Sekiranya kamu itu dapat membaca atau menulis sebelum diwahyukan wahyu kepadamu, pastilah para penentang ragu-ragu perihal al-Qur’an. Dan mereka akan mengatakan, “Dia telah mempelajarinya dari kitab-kitab terdahulu atau menyalinnya dari kitab-kitab tersebut.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "48. Dan tidaklah engkau -wahai Rasul- membaca kitab apapun sebelum Al-Qur`ān dan tidaklah engkau menulis sesuatu dengan tangan kananmu, karena engkau buta huruf, tidak bisa membaca dan menulis. Seandainya engkau bisa membaca dan menulis niscaya orang-orang bodoh akan meragukan kenabianmu dan mengira bahwa engkau menulis dari kitab-kitab yang telah lalu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "48-49. Hai Rasulullah, kamu tidak pernah membaca suatu kitab dan tidak pernah menulis sesuatu dengan tanganmu sebelum al-Qur’an diturunkan kepadamu. Seandainya dahulu kamu membaca dan menulis maka orang-orang kafir yang teguh dalam kebatilan akan meragukanmu. Akan tetapi kenyataannya tidak sebagaimana yang mereka kira; sesungguhnya ia adalah al-Qur’an yang mengandung ayat-ayat yang jelas yang menjadi petunjuk menuju kebenaran. Ia tersimpan dalam dada orang-orang beriman yang berilmu. Dan tidaklah ada orang yang mendustakan al-Qur’an dan mukjizat-mukjizat melainkan orang yang teguh dalam kekafiran."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "48. وَمَا كُنتَ تَتْلُوا۟ مِن قَبْلِهِۦ مِن كِتٰبٍ (Dan kamu tidak pernah membaca sebelumnya (Al Quran) sesuatu Kitabpun) Yakni hai Muhammad, kamu tidak pernah membaca suatu kitab sebelum al-Qur’an, dan kamu tidak bisa membaca karena kamu adalah orang yang ‘ummi’ yang tidak mampu membaca. وَلَا تَخُطُّهُۥ بِيَمِينِكَ ۖ( dan kamu tidak (pernah) menulis suatu Kitab dengan tangan kananmu) Dan kamu tidak menulisnya sendiri sebab kamu tidak bisa menulis. إِذًا لَّارْتَابَ الْمُبْطِلُونَ (andaikata (kamu pernah membaca dan menulis), benar-benar ragulah orang yang mengingkari(mu)) Seandainya kamu adalah orang yang dapat membaca dan menulis niscaya mereka akan berkata: mungkin saja dia menemukan apa yang dia baca kepada kita dari kitab-kitab Allah terdahulu, atau kitab yang ditulis tentang cerita umat-umat dahulu. Dan ketika kamu adalah orang yang ‘ummi’ yang tidak bisa baca tulis, maka tidak ada celah untuk meragukanmu sama sekali."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "48. Dan Kamu wahai rasul, tidak membaca kitab apapun sebelum Al-Qur’an. Kamu juga tidak menulis dengan tangan kananmu. Sesungguhnya kamu buta huruf, tidak bisa membaca dan menulis. Kalaupun kamu membaca dan menulis karena keraguan orang-orang bathil tentang urusanmu, maka serulah mereka bahwa apa yang kamu baca diambil dari kitab-kitab terdahulu. Al-Mubthilun adalah orang-orang yang menjadikan kebenaran sebagai kebathilan dan terjerumus dalam kebathilan. {Min Kitaabin} menunjukkan keumuman fungsi nafi terhadap kalimat setelahnya."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "48. maka dari itu Dia berfirman, ”dan kamu (wahai Muhammad) tidak pernah mentilawah” maksudnya, membaca “sebelumnya suatu kitab pun dan kamu tidak pernah menulis suatu kitab pun dengan tangan kananmu; andaikata demikian,” andaikata kamu seperti demikian keadaannya, “benar-benar ragulah orang yang mengingkari,” pasti mereka mengatakan, ”Muhammad telah mempelajarinya dari kitab-kitab terdahulu, atau mengutipnya dari sana.” Namun, kenyataannya, sungguh telah diturunkan kepada hatimu sebuah kitab yang sangat mulia, yang dapat kamu gunakan untuk menantang para ahli sastra arab yang mempunyai retorika yang sangat tinggi, lagi menjadi musuh yang sangat memusuhi, agar mereka mendatangkan kitab yang semisal dengannya, atau satu surat yang semisal dengannya, lalu mereka tidak mampu sama sekali untuk melakukannya, bahkan jiwa mereka sama sekali tidak membisikkan kepada mereka untuk menantangnya, karena mereka tahu retorika dan kefasihan al-qur’an ini, dan mereka tahu bahwa perkataan seorang manusia tidak akan pernah bisa menandinginya, atau mirip dengannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Ankabut ayat 48: Kabarkan kepada mereka orang-orang musyrik dari apa yang menunjukkan atas benarnya Al Qur’an ini, dan ia diturunkan dari sisi Allah : Engkau wahai Nabi ﷺ, tidaklah mengenal membaca dan menulis sebelum turun Al Qur’an ini, maka jika engkau sampaikan kepada orang-orang musyrik, engkau akan dituduh dengan kebathilan dan mengada-ngada atau jika engkau menukil kitab-kitab yang dahulu pun demikian keadaan mereka orang-orang musyrik."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Tentu mereka akan berkata, “Ia belajar dari kitab-kitab sebelumnya atau menyalin darinya.” Tetapi ketika turun kepada Beliau kitab yang agung, yang kemudian Beliau menantang para ahli satra dan musuh yang keras kepala untuk mendatangkan yang serupa dengan Al Qur’an yang dibawanya atau satu surat saja, namun ternyata mereka tidak sanggup mendatangkannya, bahkan diri mereka tidak ada keinginan untuk membantahnya, karena mereka tahu ketinggian bahasanya dan kefasihannya, dan karena ucapan salah seorang dari manusia tidak ada yang sampai sejalan dengannya atau sesuai caranya. Oleh karena itulah, Allah Subhaanahu wa Ta'aala berfirman, “Sebenarnya, (Al Quran) itu adalah ayat-ayat yang jelas di dalam dada orang-orang yang berilmu. Hanya orang-orang yang zalim yang mengingkari ayat-ayat Kami.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Ankabut Ayat 48",
    "description": "Dan seharusnya mereka meyakini kebenaran Al-Qur'an sebagai kitab suci yang Allah turunkan kepada engkau, wahai nabi Muhammad, sebab mereka tahu benar bahwa engkau tidak pernah membaca sesuatu kitab pun sebelum Al-Qur'an dan engkau juga tidak pernah menulis suatu kitab pun dengan tangan kananmu karena engkau adalah seorang ummi, tidak pandai membaca maupun menulis. Sekiranya engkau pernah membaca dan menulis, niscaya ragu orang-orang yang mengingkarinya, yakni Al-Qur'an. Mereka akan menemukan alasan bagi keraguan mereka kepada Al-Qur'an andaikata engkau pernah membaca dan/atau menulis. 49. Sebenarnya Al-Qur'an itu adalah ayat-ayat yang jelas, tidak ada sedikit pun keraguan padanya, yang terpelihara di dalam dada orang-orang yang berilmu, baik melalui tradisi hafalan turun-temurun sehingga tidak seorang pun dapat mengubahnya maupun dari segi pemahaman dan pengamalannya. Hanya orang-orang yang zalim yang mengingkari ayat-ayat kami dengan menutup diri dari kebenaran Al-Qur'an."
  }
]