[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Barangsiapa yang mengharap perjumpaan dengan Allah dan sangat berharap terhadap pahalaNya, maka sesungguhnya masa yang telah ditetapkan oleh Allah untuk membangkitkan semua makhluk untuk memberikan pembalasan dan hukuman benar-benar akan tiba lagi dekat. Dan Dia Maha Mendengar semua perkataan dan Maha Mengetahui segala amal perbuatan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Barangsiapa menginginkan pertemuan dengan Allah pada hari Kiamat agar Allah membalasnya, maka hendaknya dia mengetahui bahwa ketetapan yang telah Allah tetapkan itu pasti terjadi dalam waktu dekat. Dan Dia maha Mendengar ucapan hamba-hamba-Nya dan Maha Mengetahui segala perbuatan mereka, tidak ada sesuatu pun yang luput dari-Nya dan Dia akan membalas mereka karenanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "5. Barangsiapa yang mengharap perjumpaan dengan Allah, menunggu hari kebangkitan, dan menyiapkan bekal untuk hal itu dengan keimanan dan amal shalih, maka waktu yang telah Allah tetapkan dalam ilmu-Nya untuk melakukan hisab pasti akan datang. Allah Maha Mendengar segala perkataan dan Maha Mengetahui segala perbuatan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. مَن كَانَ يَرْجُوا۟ لِقَآءَ اللهِ (Barangsiapa yang mengharap pertemuan dengan Allah) Yakni barangsiapa yang berharap akan bertemu dengan Allah maka kemudian ia beramal dengan ucapan dan perbuatan yang baik saat masa hidupnya, niscaya Allah tidak akan menyia-nyiakan pahalanya. فَإِنَّ أَجَلَ اللهِ لَاٰتٍ ۚ( maka sesungguhnya waktu (yang dijanjikan) Allah itu, pasti datang) Yakni waktu yang telah ditetapkan bagi hari kebangkitan pasti akan datang; maka beramal-lah untuk hari tersebut. وَهُوَ السَّمِيعُ (Dan Dialah Yang Maha mendengar) Mengdengar segala perkataan hamba-hamba-Nya. الْعَلِيمُ (lagi Maha Mengetahui) Mengetahui apa yang mereka rahasiakan dan apa yang mereka tampakkan, sehingga Allah tidak akan menyia-nyiakan amal baik mereka sedikitpun."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Barangsiapa yang mengharapkan dan mendambakan untuk bertemu Allah pada hari kiamat, yaitu dengan mengimaniNya, maka sesungguhnya waktu yang ditentukan untuk pembangkitan dan keluar dari kubur serta penghisaban itu pasti datang pada saatnya, bukan mustahil. Dan Allah itu Maha Mendengar ucapan-ucapan hamba dan Maha Mengetahui tindakan-tindakan mereka dan orang-orang yang mempersiapkan diri untuk bertemu denganNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5. Maksudnya, wahai orang yang mencintai Tuhannya, yang merindukan kedekatan dan perjumpaan denganNya, yang bergegas untuk memperoleh keridhaanNya! Bergembiralah dengan (sudah makin) dekatnya masa perjumpaan dengan Sang Kekasih. Sebab, ia pasti datang, dan segala sesuatu yang pasti datang itu berarti dekat. Maka berbekallah untuk perjumpaan denganNya, dan berjalanlah menujuNya dengan disertai jiwa optimis (raja’) sambil mengharapkan sampai kepadaNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Ankabut ayat 5: Ketahuilah wahai manusia, barangsiapa yang mencintai Rabbnya, yang rindu akan perjumpaan dengan-Nya; Maka wajib baginya di atas tauhid dan terus di atas amalan yang shalih, karena sesungguhnya apa yang telah Allah tentukan dari hari kebangkitan pasti terjadi, Allah Dialah yang maha mendengar ucapan hamba-Nya, maha tahu atas niat dan apa yang ada di dalam dada manusia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni, wahai orang yang mencintai Tuhannya, yang rindu bertemu dan dekat dengan-Nya, yang segera mendatangi keridhaan-Nya, bergembiralah karena dekatnya pertemuan dengan kekasih, karena pertemuan itu akan datang, dan semua yang datang adalah dekat, oleh karena itu persiapkanlah bekal untuk bertemu dengan-Nya dan berjalanlah ke arahnya sambil berharap sampai kepada-Nya. Akan tetapi, tidak semua yang mengaku lalu diberikan dan tidak semua yang berangan-angan lalu disampaikan, karena Allah Maha Mendengar semua suara dan Maha Mengetahui niat seorang hamba. Jika ia benar dalam hal itu, maka ia akan mendapatkan keinginannya, sebaliknya jika ia dusta, maka pengakuannya tidaklah bermanfaat, dan Dia mengetahui siapa yang cocok memperoleh kecintaan-Nya dan siapa yang tidak. Oleh karena itu, bersiaplah untuk menghadapinya. Ucapan semua hamba. Amal dan hati mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Ankabut Ayat 5",
    "description": "Setelah memperingatkan semua pihak, baik yang taat maupun yang durhaka, Allah mengisyaratkan anugerah-Nya kepada yang taat dengan berfirman; barangsiapa yang beriman kepada kebangkitan dan mengharap pertemuan dengan Allah, maka bergegaslah mengerjakan amal saleh, karena sesungguhnya waktu yang dijanjikan Allah pasti datang. Dan dia yang maha mendengar perkataan-perkataan hamba-Nya, maha me-ngetahui perbuatan-perbuatan mereka, dan dia akan membalas me-reka masing-masing sesuai dengan apa yang dilakukannya. 6. Dan barangsiapa berjihad dengan mencurahkan segala kemampuannya untuk meninggikan kalimat Allah dan mengorbankan diri dengan selalu bersabar dalam melakukan ketaatan kepada Allah, maka sesungguhnya pahala, manfaat dan kebaikan jihadnya itu adalah untuk dirinya sendiri. Tidak ada sedikit pun manfaat amal tersebut yang dibutuhkan oleh Allah. Sungguh, Allah mahakaya tidak memerlukan sesuatu apa pun dari mereka, bahkan dari seluruh alam."
  }
]