[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang musryrik berkata, “ Mengapa tidak diturunkan kepada Muhammad bukti-bukti dan hujjah-hujjah dari Tuhannya yang dapat kami saksikan seperti unta Shaleh, dan tongkat Musa?” katakanlah kepada mereka, “Sesungguhnya mukjizat-mikjizat itu wewenang Allah. Jika Dia berkehendak, Dia akan menurunkannya dan bila berkehendak, Dia menahannya. Sesungguhnya aku hanyalah seorang pemberi peringatan bagi kalian. Aku memperingatkan kalian terhadap kedahsyatan siksaanNYa dan hukumanNya, menerangkan jalan kebenaran dari jalan kebatilan.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "50. Orang-orang musyrik berkata, “Kenapa tidak diturunkan kepada Muhammad mukjizat-mukjizat dari Rabbnya sebagaimana yang diturunkan kepada para Rasul sebelumnya?” Katakan -wahai Rasul- kepada orang-orang yang berkata itu, “Sesungguhnya mukjizat itu hanyalah di tangan Allah, Dia menurunkannya kapan saja Dia kehendaki, dan bukanlah wewenangku untuk menurunkannya, aku hanyalah seorang pemberi peringatan bagi kalian dari siksa Allah, dengan peringatan yang jelas.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "50. Orang-orang kafir itu berkata dengan bodohnya: “Mengapa tidak diturunkan kepada Muhammad mukjizat dan bukti-bukti dari Tuhannya?!” Katakanlah kepada mereka: “Sesungguhnya perkara mukjizat ini adalah urusan Allah, tidak ada yang dapat mendatangkannya selain Dia; Dia menurunkan atau tidak menurunkannya sesuai dengan kehendak-Nya. Adapun aku hanyalah pemberi peringatan dari Allah untuk menjelaskan jalan petunjuk kepada kalian dan memperingatkan kalian dari kesesatan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "50. وَقَالُوا۟ لَوْلَآ أُنزِلَ عَلَيْهِ ءَايٰتٌ مِّن رَّبِّهِۦ ۖ (Dan orang-orang kafir Mekah berkata: “Mengapa tidak diturunkan kepadanya mukjizat-mukjizat dari Tuhannya?”) Seperti mukjizat-mukjizat Musa, unta betina Nabi Shalih, dan al-Masih yang mampu menghidupkan orang mati. قُلْ إِنَّمَا الْاٰيٰتُ عِندَ اللهِ(Katakanlah: “Sesungguhnya mukjizat-mukjizat itu terserah kepada Allah) Allah menurunkan mukjizat itu kepada hamba-Nya yang Dia kehendaki, dan tidak ada orang yang mampu untuk membuat mukjizat. وَإِنَّمَآ أَنَا۠ نَذِيرٌ مُّبِينٌ(Dan sesungguhnya aku hanya seorang pemberi peringatan yang nyata”) Yakni aku memberi kalian peringatan sebagaimana aku diperintah, dan memberi kalian penjelasan sebagaimana seharusnya, dan aku tidak mampu melakukan sesuatu yang lebih dari itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "50. Orang-orang kafir Mekah berkata: “Kenapa Al-Qur’an tidak diturunkan kepada Muhammad sebagai mukjizat-mukjizat yang dapat dirasakan langsung dari Tuhannya seperti unta Shalih, tongkat Musa, dan hidangan Isa” Wahai Rasulallah, Katakanlah sebagai mereka sebagai jawaban untuk mereka: “Sesungguhnya perkara mukjizat itu hanya ada di sisi Allah, bukan termasuk kapasitasku. Urusanku tidak lain kecuali memberi peringatan kemaksiatan dengan neraka. Aku hanya memberi peringatan para pelanggar dari azab Allah dan memberi penjelasan tentang kebenaran dari kebathilan”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "50. maksudnya, orang-orang zhalim (yang mendustakan Rasulullah dan syariat yang beliau bawa) menentang dan mengusulkan kepadanya agar diturunkan mukjizat-mukjizat yang dapat mereka lihat, sebagaimana perkataan mereka,”dan mereka berkata,’kami sekali-kali tidak percaya kepadamu hingga kamu memancarkan mata air dari bumi untuk kami’,” (al-isra:90) Sesungguhnya penentuan “turunnya mukjizat,” itu bukan hak mereka dan juga bukan hak Rasulullah. Sebab yang demikian itu berarti tindakan turut mengatur bersama Allah. Dan kalau demikian halnya dan harus demikian, padahal tidak seorangpun yang memiliki hak urusan, maka Allah berfirman, ”katakanlah, ’sesungguhnya mukjizat-mukjizat itu terserah kepada Allah’.” Jika Dia berkehendak, maka Dia menurunkannya, atau menahannya. “dan sesungguhnya aku hanya seorang pemberi peringatan yang nyata.” Aku tidak mempunyai kedudukan lebih dari kedudukan ini. Kalau yang dimaksud adalah menjelaskan yang benar dari yang batil (palsu), lalu apabila tujuan sudah dicapai dengan cara apa pun, maka usulan ”agar diturunkannya mukjizat-mukjizat tertentu,” atas hal di atas adalah suatu kezhaliman, kediktatoran dan kesombongan terhadap Allah dan terhadap kebenaran. Bahkan kalau seandainya ditakdirkan (oleh Allah) mukjizat-mukjizat itu diturunkan sedangkan di dalam hati mereka terdapat tekad bahwa mereka tidak akan beriman kepada kebenaran kecuali dengan mukjizat-mukjizat itu, maka hal itu bukanlah iman, itu tidak lain hanyalah sesuatu yang sejalan dengan hawa nafsu mereka, mereka mengimaninya bukan karena sesuatu itu adalah kebenaran, akan tetapi karena mukjizat-mukjizat tersebut. Maka, faidah apa yang bisa diperoleh dengan diturunkannya mukjizat tersebut dengan asumsi mukjizat itu ditakdirkan turun?"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Ankabut ayat 50: Ketika orang-orang musyrik keras kepada dengan menginginkan agar turunnya Al Qur’an mestilah terlihat dengan mata-mata mereka, Allah memerintahkan Nabi-Nya Muhammad ﷺ untuk berkata kepada mereka : Sungguh urusan turunnya ayat-ayat Allah ini maka jika Allah menghendaki Allah akan turunkan, dan jika tidak maka Allah akan tahan, dan tidaklah aku kecuali hanyalah pemberi peringatan kepada kalian, aku memperingati kalian dari adzab akibat kedzaliman kalian, kesyirikan kalian dan kedustaan kalian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni sesuai yang mereka usulkan, seperti ucapan mereka, “Kami sekali-kali tidak percaya kepadamu hingga kamu memancarkan mata air dan bumi untuk kami…dst.”(lihat surah Al Israa’: 90-96) Padahal menentukan ayat atau mukjizat tertentu bukanlah diserahkan kepada mereka, dan bukan pula diserahkan kepada rasul, tetapi diserahkan kepada Allah, jika Dia menghendaki, maka Dia menurunkannya dan jika tidak, maka Dia tidak menurunkannya. Jika maksudnya adalah menjelaskan yang hak, dan ternyata bisa dilakukan dengan cara apa pun, maka mengusulkan ayat tersebut adalah suatu kezaliman, dan sikap sombong terhadap Allah dan terhadap kebenaran. Bahkan jika ditakdirkan ayat yang mereka usulkan itu turun dan ternyata hati mereka tidak beriman kecuali dengannya, maka yang demikian bukanlah keimanan, akan tetapi hanya sesuai hawa nafsu mereka sehingga mereka beriman, bukan karena ia sebuah kebenaran, bahkan karena ayat atau mukjizat itu sesuai dengan yang mereka usulkan. Akan tetapi karena maksud utamanya adalah untuk menerangkan yang hak, maka Allah Subhaanahu wa Ta'aala menyebutkan jalannya, Dia berfirman, “Apakah tidak cukup bagi mereka bahwa Kami telah menurunkan kepadamu kitab (Al Quran) yang dibacakan kepada mereka?” di dalamnya terdapat ayat-ayat yang jelas dan penjelasan yang sangat bagus, tepat dan bijak, padahal yang membawanya seorang yang ummi (tidak kenal baca tulis). Hal ini merupakan bukti yang paling besar terhadap kebenarannya, terlebih mereka tidak mampu mendatangkan yang semisalnya. Selain itu, isinya terdapat berita yang gaib; berita tentang umat-umat terdahulu dan yang akan terjadi selanjutnya yang ternyata sesuai kenyataan. Demikian pula pengawasannya terhadap kitab-kitab terdahulu, pembenarannya terhadap yang benar dan pembersihannya terhadap penyelewengan tangan manusia terhadap kitab-kitab tersebut. Ditambah lagi dengan petunjuknya ke jalan yang lurus, perintahnya kepada semua kebaikan dan larangannya dari semua keburukan, perintah dan larangannya sejalan dengan keadilan dan kebijaksanaan lagi dapat dimengerti dan diterima oleh fitrah, di samping itu petunjuknya sejalan dengan setiap zaman dan setiap umat, di mana urusan mereka tidak akan baik kecuali dengan petunjuknya. Semua itu sebenarnya sudah cukup bagi orang yang membenarkan yang hak (benar) dan mencarinya. Yakni aku tidak memiliki kedudukan lebih di atas ini."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Ankabut Ayat 50",
    "description": "Andaikata kaum kafir mekah dan orang yahudi mau membuka hati pasti mereka akan mengakui Al-Qur'an bukan hasil karya nabi Muhammad, melainkan mukjizat yang agung. Namun, mereka justru meminta mukjizat inderawi seperti yang didatangkan Allah kepada para nabi terdahulu. Dan mereka berkata kepada nabi Muhammad untuk menjatuhkan mentalnya, 'mengapa tidak diturunkan mukjizat-Mukjizat dari tuhannya yang bisa dilihat oleh mata seperti mukjizat-Mukjizat para nabi sebelumnya'' katakanlah, 'mukjizat-Mukjizat itu bukan urusanku. Semuanya terserah kepada Allah, apakah dia membekali para rasul-Nya dengan mukijzat inderawi atau bukan. Aku hanya seorang pemberi peringatan yang jelas, yang diperkuat dengan argumentasi dan bukti-bukti yang kuat. '51. Sebagian kaum muslim yang belum kuat imannya terpengaruh oleh ucapan kaum yahudi bahwa mukjizat para nabi terdahulu lebih agung dan lebih bisa dibuktikan kehebatannya dibanding mukjizat nabi Muhammad. Karena itu, Allah meminta beliau untuk menanggapi, 'apakah tidak cukup bagi mereka bahwa kami telah menurunkan kepadamu kitab Al-Qur'an yang dibacakan kepada mereka sebagai mukjizat yang abadi, berbeda dari mukjizat para nabi terdahulu yang habis masanya bersamaan dengan wafat mereka' sungguh, dalam Al-Qur'an itu terdapat rahmat yang besar bagi mereka dan generasi setelahnya, dan pelajaran bagi orang-orang yang beriman. Dengan Al-Qur'an itu mereka selalu dibimbing agar senantiasa berada di jalan yang benar."
  }
]