[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah tidak cukup bagi mereka pengetahuan mereka tentang kejujuranmu (wahai Rasul), bahwa Kami telah menurunkan kepadamu al-Qur’an yang dibacakan kepada mereka? Sesungguhnya di dalam al-Qur’an ini terdapat rahmat bagi kaum Mukiminin di dunia dan akhirat, serta peringatan bagi mereka, di mana mereka akan mengingat-ingat pelajaran dan nasihat yang dikandungnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "51. Tidak cukupkah bagi orang-orang yang mengusulkan itu bahwasanya Kami telah menurunkan Al-Qur`ān kepadamu -wahai Rasul- yang dibacakan atas mereka. Sesungguhnya di dalam Al-Qur`ān yang diturunkan atas mereka itu terdapat rahmat dan nasihat bagi orang-orang yang beriman, mereka lah yang bisa mendapatkan manfaat darinya. Maka yang diturunkan kepada mereka itu lebih baik daripada apa yang mereka usulkan dari mukjizat semisal yang diturunkan kepada para Rasul terdahulu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "51. Allah mengingkari orang-orang kafir: “Apakah tidak cukup bagi orang-orang musyrik itu bahwa Kami telah menurunkan al-Qur’an kepadamu untuk dibaca, sehingga dapat mengetuk pendengaran mereka? Sungguh dalam al-Qur’an ini terdapat kenikmatan dan peringatan bagi orang-orang yang teguh dalam keimanan kepada Allah.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "51. أَوَلَمْ يَكْفِهِمْ أَنَّآ أَنزَلْنَا عَلَيْكَ الْكِتٰبَ يُتْلَىٰ عَلَيْهِمْ ۚ (Dan apakah tidak cukup bagi mereka bahwasanya Kami telah menurunkan kepadamu Al Kitab (Al Quran) sedang dia dibacakan kepada mereka?) Apakah kitab yang mengandung mukjizat ini tidak cukup bagi orang-orang musyrik dari meminta mukjizat-mukjizat yang lain, Aku telah menantang mereka agar mendatangkan kitab yang semisalnya, atau satu surat yang menandinginya, namun mereka tidak mampu melakukannya. Seandainya Aku mendatangkan mereka dengan mukjizat-mukjizat Musa atau mukjizat-mukjizat Nabi yang lain, mereka juga tidak akan beriman sebagaimana mereka tidak beriman kepada al-Qur’an. إِنَّ فِى ذٰلِكَ لَرَحْمَةً(Sesungguhnya dalam (Al Quran) itu terdapat rahmat yang besar) Yakni rahmat yang besar di dunia dan di akhirat. وَذِكْرَىٰ( dan pelajaran) Peringatan bagi mereka di dunia yang mengingatkan mereka dan memberi petunjuk kepada kebenaran. لِقَوْمٍ يُؤْمِنُونَ (bagi orang-orang yang beriman) Yakni orang-orang yang mempercayainya bahwa ia berasal dari Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "51. Apakah tidak cukup bagi orang-orang musyrik itu tanda-tanda bagi apa yang mereka cari-cari bahwa sesungguhnya Kami menurunkan Al-Qur’an kepadamu. Al-Qur’an selalu dibacakan untuk mereka. Dia menantang mereka untuk mendatangkan sesuatu yang menyerupainya. Sesungguhnya dalam kitab itu adalah nikmat agung, pelajaran dan pengingat bagi kaum yang mengimani apa yang kamu bawa dari sisi Allah tanpa merasa sedih. Diturunkan ketika orang-orang muslim membawa kitab-kitab yang mereka tulis. Di dalamnya ada sebagian sesuatu yang mereka dengar dari kaum Yahudi."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "51. ketika yang dimaksud adalah menjelaskan yang benar, maka Allah menyebutkan caranya, seraya berfirman, ”dan apakah tidak cukup bagi mereka,” dalam pengetahuan mereka tentang kebenaranmu dan kebenaran syariat yang kamu bawa “bahwasannya Kami telah menurunkan kepadamu al-kitab sedang ia dibacakan kepada mereka,” ini adalah ungkapan singkat yang sangat padat, di dalamnya terkandung banyak bukti-bukti yng sangat jelas dan petunjuk-petunjuk yang sangat gamblang. Sebab, sebagaimana telah dijelaskan di muka bahwa kedatangan Rasulullah dengan membawa al-qu’an, padahal beliau adalah seorang buta huruf adalah merupakan bukti paling besar atas kebenarannya; kemudian (kedua) ketidakmampuan mereka menentang dan melawannya adalah merupakan tanda (bukti) yang lain. Lalu (ketiga) kemunculannya secara terang-terangan di mana al-qur’an dibacakan kepada mereka, dan disebutkan bahwa ia berasal dari sisi Allah. Rasulullah menampakkanya (memunculkannya) kepermukaan umum di mana pada saat itu beliau hanya mempunyai segelintir pendukung, sedangkan orang-orang yang menentang dan memusuhinya sangat banyak. namun beliau tidak merahasiakannya dan hal itu pun tidak mematahkan tekad bulat beliau, malah beliau menyerukannya dengan lantang di depan banyak orang, beliau mengumandangkannya kepada orang yang dekat dan orang yang jauh, bahwasannya (al-qur’an) ini adalah firman Rabbku, maka apakah ada seseorang yang mampu melawannya, atau berbicara dengan mengalahkannya, atau dapat menandinginya? Kemudian (keempat), informasi al-qur’an tentang kisah-kisah generasi pertama dan berita-berita orang-orang terdahulu dan hal-hal ghaib yang akan datang serta kontemporer, semuanya sesuai dengan kenyataaan. Kemudian (kelima), hegemoni al-qur’an terhadap kitab-kitab samawi sebelumnya, dan pembenarannya terhadap yang shahih serta menafikkan hal-hal yang dimasukkan ke dalam kitab-kitab tersebut, berupa tahrif dan tabdil; lalu bimbingannya kepada jalan yang lurus (yang tercermin) dalam perintah dan larangannya; hingga ia memerintahkan sesuatu lalu orang yang berakal mengatakan “kalau saja ia tidak melarangnya” akan tetapi semua itu sangat sesuai dengan keadilan, mizan dan hikmah (kebijaksanaan) yang sangat logis bagi orang-orang yang mempunyai hati nurani dan akal. Kemudian (keenam), bimbingan-bimbingannya, hidayahnya dan hukum-hukumnya selalu relevan dengan setiap keadaan dan setiap zama, yang mana semua permasalahan tidak akan bisa menjadi baik kecuali dengannya. Semua itu sudah cukup bagi siapa saja yang ingin membenarkan kebenaran dan berusaha mencari yang benar. Allah tidak akan mencukupi orang yang belum puas dengan al-qur’an, dan Allah tidak akan memberikan kesembuhan kepada orang yang tidak sembuh denagn al-qur’an. Dan siapa saja yang berpegang dan berpedoman kepadanya, niscaya al-qur’an menjadi rahmat dan kebaikan baginya. Maka dari itu Allah berfirman, ”sesungguhnya di dalam (al-qur’an) itu terdapat rahmat yang besar dan pelajaran bagi orang-orang yang beriman,” yang demikian itu karena mereka akan memperoleh banyak ilmu, kebaikan yang sangat berharga, kesucian jiwa dan ruh, kemurnian keyakinan, kesempurnaan akhlak, futuhat (pembukaan) ilahi dan berbagai rahasia ilahi."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Ankabut ayat 51: Setelah Allah berkata tentang mereka orang-orang musyrik yang mendustakan dengan apa yang telah mereka katakan, Allah berkata : Tidakkah Al Qur’an ini cukup bagi mereka, yang dia (Rasul) telah bacakan kepada mereka, di mana ayat-ayat dan mukjizat yang telah sampai kepada mereka ?! Ketahuilah wahai manusia, bahwasanya dalam turunnya Al Qur’an ini dengan rahmat dari Allah, dan nasihat serta dzikir bagi kaum yang beriman kepada Allah dan membenarkan para utusan-Nya, itulah sebesar-besar mukjizat Nabi ﷺ."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang merupakan ayat Allah (mukjizat) yang terus menerus, berbeda dengan ayat-ayat-Nya yang lain (mukjizat). Hal itu, karena di dalamnya terdapat ilmu yang banyak, kebaikan yang melimpah, membersihkan hati dan ruh, menyucikan keyakinan, menyempurnakan akhlak, dan lain-lain."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Ankabut Ayat 51",
    "description": "Sebagian kaum muslim yang belum kuat imannya terpengaruh oleh ucapan kaum yahudi bahwa mukjizat para nabi terdahulu lebih agung dan lebih bisa dibuktikan kehebatannya dibanding mukjizat nabi Muhammad. Karena itu, Allah meminta beliau untuk menanggapi, 'apakah tidak cukup bagi mereka bahwa kami telah menurunkan kepadamu kitab Al-Qur'an yang dibacakan kepada mereka sebagai mukjizat yang abadi, berbeda dari mukjizat para nabi terdahulu yang habis masanya bersamaan dengan wafat mereka' sungguh, dalam Al-Qur'an itu terdapat rahmat yang besar bagi mereka dan generasi setelahnya, dan pelajaran bagi orang-orang yang beriman. Dengan Al-Qur'an itu mereka selalu dibimbing agar senantiasa berada di jalan yang benar. 52. Katakanlah wahai nabi Muhammad, 'cukuplah Allah menjadi saksi antara aku dan kamu bahwa aku telah menyampaikan risalah ilahi ini kepadamu. Dia mengetahui urusan apa pun di antara kita. Apa yang di langit dan di bumi tidak ada yang tersembunyi bagi Allah. Dan dia juga mengetahui orang-orang yang percaya kepada yang batil, yakni para penyembah berhala dan apa saja yang dipertuhankan selain Allah, dan orang-orang ingkar kepada eksistensi dan keesaan Allah, padahal mereka telah menyaksikan bukti-bukti yang jelas. Sungguh, mereka itulah orang-orang yang benar-benar rugi di dunia dan akhirat. '."
  }
]