[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah, “Cukuplah Allah menjadi saksi antara diriku dan kalian atas kejujuranku bahwa aku adalah utusanNya, dan atas pendustaan kalian kepadaku dan penolakan kalian terhadap kebenaran yang aku bawa dari sisi Allah. Dia mengetahui apa yang ada di langit dan di bumi. Tidak ada sesuatu pun di dalam keduanya yang samar bagiNya. Dan orang-orang yang beriman kepada kebatilan dan mengingkari Allah (meskipun terdapat bukti-bukti yang nyata ini) mereka itu adalah orang-orang yang merugi di dunia dan akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "52. Katakan -wahai Rasul-, “Cukuplah Allah Yang Mahasuci sebagai saksi atas kejujuranku tentang apa yang aku bawa dan sebagai saksi atas pendustaan kalian terhadapnya, Dia Maha Mengetahui apa yang ada di langit dan mengetahui apa yang ada di bumi, tidak ada sesuatu pun dari keduanya yang luput dari-Nya. Dan orang-orang yang percaya dengan kebatilan dari setiap apa yang disembah selain Allah dan ingkar dengan Allah yang merupakan Żat satu-satunya yang berhak untuk disembah. Mereka itu adalah orang-orang yang merugi karena mereka menggantikan keimanan dengan kekufuran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "52. Hai Rasulullah, katakanlah kepada orang-orang yang mendustakan itu: “Cukuplah Allah sebagai saksi kebenaranku bahwa aku adalah rasul-Nya. Allah mengetahui segala yang ada di tujuh langit dan bumi, tidak ada yang tersembunyi dari-Nya. Adapun orang-orang yang beriman kepada kesyirikan dan setan dari golongan jin dan manusia, dan mendustakan Allah; maka yang jauh dari kebenaran itu adalah orang-orang yang merugi, sebab mereka lebih memilih kekafiran daripada keimanan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "52. قُلْ كَفَىٰ بِاللهِ بَيْنِى وَبَيْنَكُمْ شَهِيدًا ۖ (Katakanlah: “Cukuplah Allah menjadi saksi antaraku dan antaramu) Yakni sebagai saksi atas apa yang terjadi di antara aku dan kalian. يَعْلَمُ مَا فِى السَّمٰوٰتِ وَالْأَرْضِ ۗ( Dia mengetahui apa yang di langit dan di bumi) Tidak ada yang tersembunyi baginya. وَالَّذِينَ ءَامَنُوا۟ بِالْبٰطِلِ وَكَفَرُوا۟ بِاللهِ أُو۟لٰٓئِكَ هُمُ الْخٰسِرُونَ(Dan orang-orang yang percaya kepada yang batil dan ingkar kepada Allah, mereka itulah orang-orang yang merugi) Yakni mereka beriman kepada apa yang mereka sembah selain Allah, dan mengingkari Tuhan yang hak, yaitu Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "52. Wahai Nabi: “Cukuplah Allah yang menjadi saksi atas kebenaranku antara aku dan kalian. Tidak ada satupun yang tersembunyi darinya sesuatu di langit dan bumi” Dan orang-orang yang beriman kepada kebathilan, yaitu setiap sesuatu yang disembah selain Allah seperti berhala, dan ingkar kepada Allah, yaitu, mereka mengingkari dan menyangkalNya atau menyangkal keesaanNya. Maka mereka itu adalah orang-orang yang merugikan diri sendiri dalam transaksi yang mana mereka memberli kekufuran menggunakan keimanan."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "52. “kataknlah, ’cukuplah Allah menjadi saksi antaraku dan antaramu’,” sesungguhnya aku telah meminta kesaksian kepadaNya, maka kalau aku dusta, niscaya aku ditimpa oleh sesuatu yang kalian bisa mengambil pelajarannya. Akan tetapi kalau al-qur’an ini seperti itu adanya (benar), maka sesungguhnya Dia akan memberiku dukungan, Dia akan menolongku, Dia akan memudahkan segala urusan bagiku. Maka hendaknya kesaksian yang mulia dari Allah ini sudah cukup bagi kalian. Dan kalau masih terbesit di dalam hati kalian bahwa kesaksianNya, -karena kalian tidak mendengar dan tidak melihatnya-, belum cukup bagi kalian sebagai bukti maka sesungguhnya “dia mengetahui apa yang ada di langit dan bumi,” dan yang termasuk dalam kategori pengetahuanNya adalah pengetahuan tentang keadaanku, keadaan kalian dan segala perkataan yang telah aku katakan kepada kalian. Maka kalau aku mengada-ada dengan mengatasnamakanNya, padahal Dia mengetahui dan kuasa menimpakan siksaanNya terhadapku, tentulah hal itu menjadi pelecehan terhadap ilmu (pengetahuan), kekuasaan dan kebijaksanaanNya, sebagaimana Dia berfirman, “seandainya dia (Muhammad) mengadakan sebagian perkataan atas (nama) kami, niscaya benar-benar kami pegang dia pada tangan kanannya. Kemudian benar-benar kami potong urat tali jantungnya,” (al-haqqah:44-46) “dan orang-orang yang percaya kepada yang batil dan ingkari kepada Allah, mereka itulah orang-orang yang merugi,” karena mereka telah merugi dalam hal iman kepada Allah, para malaikat, kitab-kitabNya, para RasulNya dan Hari Kemudian, dank arena mereka sudah luput dari kenikmatan abadi, dank arena mereka sudah luput dari kenikmatan abadi, dank arena mereka memperoleh kebatilan yang sangat buruk sebagai ganti dari kebenaran yang shahih, dan memperoleh semua azab yang sangat pedih sebagai ganti kenikmatan abadi. Maka mereka telah merugikan diri mereka sendiri dan keluarga mereka pada Hari Kiamat kelak."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Ankabut ayat 52: Katakanlah wahai Nabi Allah ﷺ kepada mereka orang-orang yang musyrik : Sungguh Allah mencukupkanku untuk menjadikan Allah sebagai saksi atas apa yang terjadi antara aku dan kalian, telah datang kebenaran kepada kalian dari sisi Tuhan kalian, aku juga telah menyampaikan apa yang aku diutus dengannya kepada kalian, akan tetapi kalian telah mendustakanku dan sombonng, engkau tidak beriman, dan Allah lah sebagai saksi akan hal itu, Dialah yang mengetahui apa yang di langit dan di bumi, tidak tersembunyi bagi-Nya sesuatu yang tersembunyi. Ketahuilah wahai kaum bahwasanya mereka yang mengikuti kebathilan dan membenarkannya, mengingkari kebenaran dan mendustakan Allah dan para utusan-Nya; Merekalah orang-orang yang merugi dengan kerugian yang sebenarnya. tidak ada kerugian lebih besar darinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni atas kebenaranku. Jika aku berdusta, maka Dia akan menimpakan kepadaku hukuman yang kalian dapat mengambil pelajaran darinya. Akan tetapi, jika ternyata Dia malah menolongku, membelaku dan memudahkan urusanku, maka cukuplah persaksian yang agung ini dari sisi Allah. Jika dalam hatimu, persaksian-Nya –karena kamu tidak melihat dan mendengarnya- tidak cukup sebagai dalil, maka sesungguhnya Dia mengetahui apa yang di langit dan di bumi, termasuk di antaranya terhadap keadaanku dan keadaanmu. Jika aku berkata dusta tentang-Nya padahal Dia mengetahui aku, tentu Dia akan menghukumku. Yaitu yang disembah selain Allah. Karena mereka membeli kekafiran dengan keimanan, membeli azab dengan kenikmatan dan membeli kerugian dengan keuntungan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Ankabut Ayat 52",
    "description": "Katakanlah wahai nabi Muhammad, 'cukuplah Allah menjadi saksi antara aku dan kamu bahwa aku telah menyampaikan risalah ilahi ini kepadamu. Dia mengetahui urusan apa pun di antara kita. Apa yang di langit dan di bumi tidak ada yang tersembunyi bagi Allah. Dan dia juga mengetahui orang-orang yang percaya kepada yang batil, yakni para penyembah berhala dan apa saja yang dipertuhankan selain Allah, dan orang-orang ingkar kepada eksistensi dan keesaan Allah, padahal mereka telah menyaksikan bukti-bukti yang jelas. Sungguh, mereka itulah orang-orang yang benar-benar rugi di dunia dan akhirat. '53. Tidak hanya mengingkari Al-Qur'an, mereka juga menantang nabi Muhammad agar menyegerakan turunnya azab. Ini adalah tindakan bodoh sebab jika Allah benar-benar menurunkan azab-Nya maka tidak satu pun dari mereka bisa menyelamatkan diri darinya. Mereka meminta kepadamu, wahai nabi Muhammad, agar segera diturunkan azab, untuk membuktikan kerasulanmu. Kalau bukan karena waktunya yang telah ditetapkan berdasarkan hikmah dan kebijaksanaan-Nya, niscaya azab itu pasti datang kepada mereka. Dan sungguh azab itu pasti akan datang kepada mereka dengan tiba-tiba, sedang mereka tidak menyadarinya."
  }
]