[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang musyrik dari kaummu itu akan meminta kepadamu (wahai Rasul) supaya disegerakan turunnya siksaan untuk tujuan memperolok-olok saja. Kalau bukan karena Allah telah menetapkan waktu tertentu untuk sikssan bagi mereka yang tidak akan maju dan mundur darinya di dunia, niscaya siksaan itu benar-benar datang kepada mereka ketika mereka memintanya dengan tiba-tiba, sedang mereka tidak menyadari dan tidak awas."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "53. Orang-orang musyrik memintamu -wahai Rasul- untuk mempercepat datangnya siksa yang engkau peringatkan kepada mereka. Kalau seandainya Allah tidak menentukan untuk menyiksa mereka pada suatu waktu yang tidak bisa dimajukan dan tidak pula bisa dimundurkan, niscaya siksa yang mereka minta itu datang kepada mereka, sungguh siksa itu datang kepada mereka dengan tiba-tiba dalam kondisi mereka tidak menyangka-nyangka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "53-55. Hai Rasulullah, para pemuka orang-orang musyrik meminta kepadamu agar Allah menurunkan azab kepada mereka sebagai bentuk kedustaan dan tipu daya terhadapmu. Seandainya Allah tidak menetapkan azab mereka pada waktu yang telah ditentukan niscaya azab itu akan menimpa mereka saat mereka memintanya. Sungguh azab itu akan mendatangi mereka secara tiba-tiba di saat mereka tidak menyadari kedatangannya. Mereka memintamu agar menimpakan kepada mereka azab ketika di dunia, sedangkan azab neraka Jahannam pada hari kiamat akan mengepung mereka dari atas dan bawah mereka. Dan ketika itu Allah akan berfirman: “Rasakanlah balasan atas dosa-dosa yang dahulu kalian lakukan.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "53. وَيَسْتَعْجِلُونَكَ بِالْعَذَابِ ۚ (Dan mereka meminta kepadamu supaya segera diturunkan azab) Sebagai bentuk olokan dan pendustaan dari mereka. وَلَوْلَآ أَجَلٌ مُّسَمًّى(Kalau tidaklah karena waktu yang telah ditetapkan) Allah telah menetapkan waktu untuk mengazab mereka, yaitu pada hari kiamat. لَّجَآءَهُمُ الْعَذَابُ(benar-benar telah datang azab kepada mereka) Yakni azab yang berhak mereka dapatkan karena dosa-dosa mereka. وَلَيَأْتِيَنَّهُم بَغْتَةً(dan azab itu benar-benar akan datang kepada mereka dengan tiba-tiba) Datang seketika. وَهُمْ لَا يَشْعُرُونَ(sedang mereka tidak menyadarinya) Yakni mereka lalai sebelum kedatangannya, dan tidak menyadari kedatangan tersebut."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "53. Wahai Nabi, orang-orang musyrik itu memintamu untuk mempercepat azab dengan cara mengolok-olok. Jika saja tidak ada waktu yang telah ditentukan dan dijanjikan di sisi Allah untuk setiap azab atau kaum di dunia atau di hari kiamat, sungguh azab yang layak akan menimpa mereka dengan cepat akibat dosa-dosa mereka. Sungguh Kami juga mendatangkan azab untuk mereka dengan seketika di dunia saat terjadi pertempuran seperti yang terjadi di lembah Badar dan di akhirat saat ajal menjemput mereka sedangkan mereka tidak merasa waktu kedatangannya."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "53. Allah mengabarkan tentang kebodohan orang-orang yang mendustakan para rasul dan syariat yang mereka bawa, dan bahwa mereka mengatakan agar segera diturunkan azab, dan tambahan pendustaan mereka, “kapan janji ini, kalau kalian memang orang-orang yang benar?” (al-anbiya:38) Allah berfirman, ”kalau tidaklah karena waktu yang telah ditetapkan,” yang sudah ditetapkan waktu terjadinya, dan sekarang masih belum saatnya, ”benar-benar telah datang azab kepada mereka,” disebabkan mereka menganggap kami tidak mampu dan karena mereka mendustakan yang benar. Maka kalau saja kami menghukum mereka disebabkan kebodohan mereka, niscaya perkataan mereka menjadi faktor yang mempercepat untuk ditimpakannya bala dan azab terhadap mereka. Akan tetapi, sekalipun demikian, mereka tidak bisa menghambat turunnya azab, karena ia akan datang menimpa mereka “dengan tiba-tiba, sedang mereka tidak menyadarinya,” azab itu pun terjadi, sebagaimana diberitakan oleh Allah. Tatkala mereka datang menuju badar dengan congkak dan berbangga diri, seraya mengira bahwa mereka akan memperoleh apa yang mereka angan-angankan, maka Allah membinasakan mereka, membunuh para pembesar mereka dan menghabisi sejumlah orang-orang jahat mereka, sehingga tidak ada satu rumah pun milik mereka melainkan ditimpa oleh musibah itu. Azab menimpa mereka dari arah dan waktu yang tidak mereka duga, dan azab itu menimpa mereka sedangkan mereka tidak sadar."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Ankabut ayat 53: Allah mengabarkan kepada Nabi-Nya ﷺ bahwa kaumnya tidak hanya berhenti pada kedustaan, akan tetapi mereka menambah dengan menuntut dari Rasul ﷺ dengan olok-olok untuk menyegerakan adzab Allah yang akan menimpa mereka. Kemudian Allah menjelaskan bahwa kalau sekiranya tidak ditentukan kejadiannya, maka sungguh Allah akan turunkan (mereka akan binasa), dengan datangnya adzab kepada mereka ketika mereka meminta kepada Nabi ﷺ, akan tetapi ketahuilah wahai orang-orang kafir, bahwasanya adzab ini akan datang kepada kalian, dan kalian tidak merasakan akan kedatangannya; Kalian akan binasa dan celaka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan tentang kebodohan orang-orang yang mendustakan Rasulullah shallallahu 'alaihi wa sallam dan apa yang Beliau bawa, dan bahwa mereka meminta disegerakan azab sebagai tambahan terhadap pendustaan mereka. Yang dimaksud dengan waktu yang telah ditetapkan ialah menjanjikan azab itu pada waktu yang ditentukan, seperti pada perang Badar, dan pada hari pembalasan nanti di akhirat. Maka terjadilah sesuai yang diberitakan Allah Subhaanahu wa Ta'aala. Saat mereka datang ke Badar dalam keadaan sombong lagi membanggakan diri dan mereka mengira bahwa maksud mereka akan tercapai, ternyata Allah menghinakan mereka, pemuka mereka terbunuh, sejumlah orang-orang jahat dari mereka dihabiskan sehingga tidak ada satu pun keluarga mereka kecuali merasakan musibah itu. Kalau pun mereka tidak tertimpa azab duniawi, namun di hadapan mereka ada azab akhirat, di mana tidak ada seorang pun yang dapat meloloskan diri darinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Ankabut Ayat 53",
    "description": "Tidak hanya mengingkari Al-Qur'an, mereka juga menantang nabi Muhammad agar menyegerakan turunnya azab. Ini adalah tindakan bodoh sebab jika Allah benar-benar menurunkan azab-Nya maka tidak satu pun dari mereka bisa menyelamatkan diri darinya. Mereka meminta kepadamu, wahai nabi Muhammad, agar segera diturunkan azab, untuk membuktikan kerasulanmu. Kalau bukan karena waktunya yang telah ditetapkan berdasarkan hikmah dan kebijaksanaan-Nya, niscaya azab itu pasti datang kepada mereka. Dan sungguh azab itu pasti akan datang kepada mereka dengan tiba-tiba, sedang mereka tidak menyadarinya. 54. Sekali lagi mereka meminta kepadamu wahai nabi Muhammad, sebagai bentuk ejekan dan ketidakpercayaan mereka terhadap kera-sulanmu, agar segera diturunkan azab. Mereka lupa bahwa azab itu pasti akan datang. Seandainya tidak datang di dunia, azab itu akan menimpa mereka di akhirat dalam bentuk yang lebih besar. Itulah nereka jahanam. Dan sesungguhnya neraka jahanam itu pasti meliputi orang-orang kafir. Jahanam akan datang dari segala arah sehingga mereka tidak mampu menghindar."
  }
]