[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan mereka meminta kepadamu untuk disegerakan turunnya siksaan pada mereka di dunia, padahal siksaan itu pasti akan mendatangi mereka tanpa keraguan padanya, bisa di dunia dan bisa di akhirat. Dan sesungguhnya siksaan Neraka Jahanam di akhirat itu benar-benar meliputi mereka, tidak ada tempat lari bagi mereka darinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "54. Mereka minta untuk disegerakan siksa yang engkau janjikan kepada mereka, dan sesungguhnya neraka Jahanam yang telah Allah janjikan untuk orang-orang yang kafir pasti meliputi mereka, hingga mereka tidak bisa lari dari siksanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "54. يَسْتَعْجِلُونَكَ بِالْعَذَابِ وَإِنَّ جَهَنَّمَ لَمُحِيطَةٌۢ بِالْكٰفِرِينَ (Mereka meminta kepadamu supaya segera diturunkan azab. Dan sesungguhnya Jahannam benar-benar meliputi orang-orang yang kafir) Yakni Jahannam akan mengepung mereka sebentar lagi, sebab sesuatu yang akan datang itu tidak akan lama kedatangannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "54. Mereka memintamu untuk mempercepat azab dunia. Katakanlah kepada mereka wahai Nabi: “Sesunggunya azab akhirat pasti akan datang dan sesungguhnya neraka Jahannam sungguh meliputi orang-orang kafir pada hari kiamat.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "54. demikianlah, dan jika azab duniawi itu tidak turun menimpa mereka, maka sesungguhnya di hadapan mereka ada azab ukhrawi yang tidak seorang pun dari mereka yang lolos darinya, baik yang sudah ditimpa azab di dunia terlebih dahulu maupun yang ditangguhkan, maka “sesungguhnya jahanam benar-benar meliputi orang-orang yang kafir,” mereka tidak mempunyai tempat menghindar atau tempat melepaskan diri darinya. Jahanam itu telah mengepung mereka dari segala sisi sebagaimana dosa-dosa, kejahatan dan kekafiran telah meliputi mereka. Azab itu adalah azab yang sangat dahsyat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Ankabut ayat 54: Bagaimana mereka bisa meminta untuk disegerakan kepada Nabi Allah ﷺ dengan adzab, sedangkan adzab tersebut pasti akan datang kepada mereka, tidak mungkin tidak. Sungguh adzab akan meliputi mereka orang-orang kafir yang menolak dan sombong dari segala penjuru, mereka tidak akan dapat memerangi adzab tersebut, tidak juga ada yang menolong bagi mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Oleh karena itu, mereka tidak dapat meloloskan diri darinya karena Jahanam mengepung mereka sebagaimana dosa dan kekafiran mengepung diri mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Ankabut Ayat 54",
    "description": "Sekali lagi mereka meminta kepadamu wahai nabi Muhammad, sebagai bentuk ejekan dan ketidakpercayaan mereka terhadap kera-sulanmu, agar segera diturunkan azab. Mereka lupa bahwa azab itu pasti akan datang. Seandainya tidak datang di dunia, azab itu akan menimpa mereka di akhirat dalam bentuk yang lebih besar. Itulah nereka jahanam. Dan sesungguhnya neraka jahanam itu pasti meliputi orang-orang kafir. Jahanam akan datang dari segala arah sehingga mereka tidak mampu menghindar. 55. Demikianlah gambaran azab bagi orang-orang kafir, yaitu pada hari ketika azab menutup dan menimpa mereka dari atas dan dari bawah kaki mereka, bahkan dari segala arah. Dan Allah berkata kepada mereka, 'rasakanlah azab ini sebagai balasan atas apa yang telah kamu kerjakan, berupa kekafiran dan kemusyrikan!'."
  }
]