[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Pada Hari Kiamat, siksaan Neraka Jahanam akan mengepung orang-orang kafir dari sisi atas kepala mereka, dan dari arah bawah kaki-kaki mereka. Api neraka melingkupi mereka dari segenap sisi mereka. Pada saat itu, Allah berfirman kepada mereka, “Rasakanlah balasan apa yang telah kalian perbuat di dunia yaitu perbuatan syirik kepada Allah dan tindakan kejahatan serta dosa-dosa.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "55. Pada hari di saat siksa mengepung mereka dari atas mereka dan menjadi kasur bagi mereka dari arah bawah kaki mereka, dan Allah berfirman kepada mereka sebagai bentuk celaan atas mereka, “Rasakanlah balasan dari syirik dan kemaksiatan yang pernah kalian lakukan.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "55. يَوْمَ يَغْشَىٰهُمُ الْعَذَابُ مِن فَوْقِهِمْ وَمِن تَحْتِ أَرْجُلِهِمْ (pada hari mereka ditutup oleh azab dari atas mereka dan dari bawah kaki mereka) Yakni mereka terkepung dari segala arah, dan jika azab telah mengepung seperti ini maka berarti mereka telah terkepung oleh Jahannam. وَيَقُولُ ذُوقُوا۟ مَا كُنتُمْ تَعْمَلُونَ(dan Allah berkata (kepada mereka): “Rasailah (pembalasan dari) apa yang telah kamu kerjakan”) Yang mengatakan kalimat ini adalah Allah, atau sebagian malaikat atas perintah Allah. Yakni rasakanlah balasan atas kekafiran dan kemaksiatan yang telah kalian perbuat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "55. Pada hari mereka ditimpa dan ditutup oleh azab dari segala penjuru mereka yaitu dari atas dan bawah kaki mereka. Dikatakan kepada mereka: “Rasakanlah balasan atas sesuatu yang kalian lakukan dan kalian tidak bisa lari dari Kami”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "55. “pada hari mereka ditiup oleh azab dari atas mereka dan dari bawah kaki mereka dan Allah berkata kepada mereka, ’rasakanlah (pembalasan dari) apa yang telah kamu kerjakan’,” karena amal perbuatan kalian akan berubah menjadi azab terhadap kalian, dan kalian akan diliputi azab sebagaimana kekafiran dan dosa-dosa telah meliputi kalian."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Ankabut ayat 55: Allah menjelaskan bahwa adzab ini akan meliputi kafir pada hari kiamat dari seluruh penjuru, mereka akan tertutupi dengan adzab, yang terdapat api di atas mereka dan bawah mereka, kemudian Allah berkata : Rasakanlah atas apa yang telah kalian perbuat dari kesyirikan, maksiat, kedustaan, olok-olok dan ketergesa-gesaan atas meminta adzab."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Amal mereka berubah menjadi azab, dan azab itu menutupi mereka sebagaimana kekafiran dan kemaksiatan menutupi diri mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Ankabut Ayat 55",
    "description": "Demikianlah gambaran azab bagi orang-orang kafir, yaitu pada hari ketika azab menutup dan menimpa mereka dari atas dan dari bawah kaki mereka, bahkan dari segala arah. Dan Allah berkata kepada mereka, 'rasakanlah azab ini sebagai balasan atas apa yang telah kamu kerjakan, berupa kekafiran dan kemusyrikan!'56. Setelah rangkaian ayat-ayat sebelumnya menggambarkan sikap dan perlakuan buruk orang-orang kafir mekah kepada kaum muslim, terutama yang duafa, ayat-ayat berikut memerintahkan agar mereka berhijrah meski harus meninggalkan harta benda dan sanak saudara mereka. Wahai hamba-hamba-ku yang beriman! jika kamu tidak lelusa beribadah kepada Allah karena mendapat ancaman dan teror dari kaum kafir, berhijrahlah ke daerah lain yang lebih aman. Sungguh, bumi-ku luas, maka sembahlah aku semata dan janganlah takut sebab aku-lah yang memenuhi kebutuhan hamba-ku. Aku pula yang menentukan hidup dan mati mereka."
  }
]