[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai hamba-hambaKu yang beriman, jika kalian berada dalam kesulitan untuk menampakkan keimanan kalian dan beribadah kepada Allah semata, maka berhijrahlah kalian ke bumi Allah yang luas, dan murnikanlah ibadah bagiKu saja."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "56. Wahai hamba-hamba-Ku yang beriman kepada-Ku! Berhijrahlah kalian dari negeri yang di situ kalian tidak bisa beribadah kepada-Ku dengan tenang, sesungguhnya bumi-Ku itu luas maka sembahlah aku semata dan janganlah engkau menyekutukan-Ku dengan sesuatupun."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "56-59. Allah menyampaikan kepada orang-orang yang beriman sebagai pemuliaan bagi mereka: “Wahai hamba-hamba-Ku, jika kalian tidak dapat menegakkan syariat untuk menyembah Allah di negeri kalian, maka berhijrahlah menuju negeri lain agar kalian dapat menjalankan agama dengan menyembah Allah semata. Kematian pasti akan mendatangi kalian, kemudian kalian akan kembali kepada Tuhan kalian untuk memberi balasan atas keimanan dan amal shalih kalian berupa surga, Allah akan menempatkan kalian di istana-istana yang tinggi di antara kebun-kebun subur yang di bawahnya mengalir sungai-sungai, kalian akan kekal di dalamnya. Ini adalah sebaik-baik kedudukan yang tinggi sebagai balasan bagi orang-orang yang mentaati Allah, yaitu orang-orang yang sabar dalam menjalankan ibadah, dan dalam menghadapi cobaan yang menimpa mereka; dan mereka senantiasa bersandar kepada Allah.” Abu Malik al-Asy’ari berkata, Rasulullah bersabda: “Di surga terdapat ruangan yang bagian luarnya dapat terlihat dari dalam dan bagian dalamnya dapat terlihat dari luar, ruangan ini Allah siapkan bagi orang yang memberi makan orang lain, melembutkan perkataan, senantiasa berpuasa, dan mendirikan shalat ketika orang lain menikmati tidurnya.” (Diriwayatkan Imam Ahmad dalam al-Musnad 5/343, dan Ibnu Hibban dalam Shahihnya (al-Ihsan 2/262 no. 509) pentahqiq kitab al-Ihsan berkata bahwa sanad hadits ini kuat. Dan diriwayatkan juga oleh Imam al-Hakim dalam al-Mustadrak 1/321 dari hadits Abdullah bin ‘Amr secara marfu’ seperti itu. Dan dishahihkan oleh Imam ad-Dzahabi)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "56. يٰعِبَادِىَ الَّذِينَ ءَامَنُوٓا۟ إِنَّ أَرْضِى وٰسِعَةٌ فَإِيّٰىَ فَاعْبُدُونِ (Hai hamba-hamba-Ku yang beriman, sesungguhnya bumi-Ku luas, maka sembahlah Aku saja) Yakni jika kalian di Makkah merasa terhalangi dari menampakkan keimanan dan mengamalkan syariat Islam secara terang-terangan tanpa takut pada seseorang dan takut dari gangguan orang-orang musyrik sehingga harus menyembunyikan agama kalian, maka sesungguhnya bumi Allah itu luas, maka pergilah dari Makkah dan keluarlah dari tempat yang sempit dan susah, agar kalian mendapat kemudahan dalam beribadah kepada-Ku semata dan dapat menampakkan syi’ar-syi’ar agama kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "56. Wahai hamba-hambaKu yang beriman, jika di Mekah di tempat lainnya kalian tidak mampu menyiarkan Islam dan menjalankan (syariat)nya karena takut disakiti orang-orang musyrik, maka berhijrahlah ke negeri lain yang memudahkan kalian untuk beribadah di dalamnya. Sesungguhnya bumiKu itu luas, maka ikhlaslah kepadaku dalam beribadah di setiap tempat lain yang tidak menyempitkan kalian. Ayat ini diturunkan untuk mengajak orang-orang mukmin yang ada di Mekah agar berhijrah. Mereka berkata: “Kami takut kelaparan dan mengalami kesempitan hidup jika kami berhijrah.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "56-59. Allah berfirman, “hai hamba-hambaKu yang beriman,” kepadaKu dan membenarkan rasulKu, “sesungguhnya bumiKu luas, maka sembahlah Aku saja,” apabila kalian tidak bisa beribadah kepada Rabb kalian di suatu daerah, maka pindahlah darinya ke daerah yang lain di mana kalian bisa beribadah kepada Allah semata. Sebab, tempat-tempat ibadah dan letak-letaknya luas, sementara Dzat yang disembah hanya satu, dan kematian pasti akan menimpa kalian, kemudian kalian akan dikembalikan kepada Rabb kalian. Lalu Dia akan memberikan balasan kepada orang yang menyempurnakan ibadahnya dan memadukan antara iman dana mal shalih, yaitu Dia akan menempatkannya pada bilik-bilik yang sangat tinggi dan tempat-tempat tinggal yang sangat indah lagi penuh dengan apa saja yang disukai oleh jiwa dan sedap dipandang mata, sedangkan kalian kekal di dalamnya. Itulah senikmat-nikmat tempat tinggal di surga yang penuh kenikmatan dan pahala bagi orang-orang yang beramal di sisi Allah, “yaitu orang-orang yang bersabar,” dalam beribadah kepada Allah, “dan bertawakkal kepada Rabbnya.” Dalam hal itu. Kesabaran mereka dalam beribadah kepada Allah menuntut sikap mencurahkan segenap kemampuan dan potensi, dan perang besar melawan setan yang selalu mengajak mereka merusak sebagian dari ibadah. Dan tawakkal mereka kepada Allah berkonsekuensi sangat bersandar kepada Allah dan berbaik sangka kepadaNya, bahwa Dia pasti akan merealisasikan dan menyempurnakan amal-amal kebajikan yang mereka tekadkan. Allah menuliskan nash tawakal, walaupun ia sudah masuk dalam makna sabar adalah karena tawakal selalu dibutuhkan dalam setiap mengerjakan perintah dan meninggalkan larangan, dan ia tidak akan bisa terlaksana kecuali disertai tawakal."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Ankabut ayat 56: Allah menyeru atas hamba-Nya yang beriman, Allah izinkan mereka, perintahkan mereka untuk hijrah dari negeri syirik dan dzalim dan Allah mengabarkan mereka bahwa bumi Allah luas, maka mereka hijrah menuju bumi Allah yang luas, dan mereka mengikhlaskan ibadah mereka kepada Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini turun berkenaan dengan kaum muslimin yang lemah yang berada di Mekah, di mana mereka berada dalam kesulitan menampakkan syiar-syiar islam di sana. Oleh karena itu, jika kamu kesulitan beribadah kepada Tuhanmu di suatu negeri, maka pindahlah ke negeri yang lain, karena bumi Allah itu luas."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Ankabut Ayat 56",
    "description": "Setelah rangkaian ayat-ayat sebelumnya menggambarkan sikap dan perlakuan buruk orang-orang kafir mekah kepada kaum muslim, terutama yang duafa, ayat-ayat berikut memerintahkan agar mereka berhijrah meski harus meninggalkan harta benda dan sanak saudara mereka. Wahai hamba-hamba-ku yang beriman! jika kamu tidak lelusa beribadah kepada Allah karena mendapat ancaman dan teror dari kaum kafir, berhijrahlah ke daerah lain yang lebih aman. Sungguh, bumi-ku luas, maka sembahlah aku semata dan janganlah takut sebab aku-lah yang memenuhi kebutuhan hamba-ku. Aku pula yang menentukan hidup dan mati mereka. 57. Jika kamu khawatir mati kelaparan akibat hijrah ke tempat lain, ketahuilah bahwa kamu pasti akan mati dengan cara lain. Sebab setiap makhluk yang bernyawa tanpa terkecuali akan merasakan mati, dengan atau tanpa sebab. Kemudian, setelah itu hanya kepada kami kamu dikembalikan untuk mendapat balasan yang setimpal atas amal perbuatanmu, baik maupun buruk. Ayat ini mengandung ancaman bagi orang-orang kafir."
  }
]