[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tiap-tiap jiwa yang hidup akan merasakan kematian, kemudian kepada Kami kalian akan dikembalikan untuk menghadapi perhitungan amal dan pembalasannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "57. Dan janganlah ketakutan terhadap kematian mencegah kalian untuk berhijrah, setiap jiwa akan merasakan kematian, kemudian hanya kepada Kami semata kalian kembali pada hari Kiamat untuk perhitungan dan pembalasan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "57. كُلُّ نَفْسٍ ذَآئِقَةُ الْمَوْتِ ۖ ثُمَّ إِلَيْنَا تُرْجَعُونَ (Tiap-tiap yang berjiwa akan merasakan mati. Kemudian hanyalah kepada Kami kamu dikembalikan) Yakni setiap jiwa suatu hari nanti pasti akan merasakan pahitnya kematian, maka janganlah kalian merasa susah untuk meninggalkan negeri kalian serta merasa berat untuk berpisah dari saudara dan sahabat. Kemudian hanya kepada Allah kalian akan kembali. Maka setiap jiwa yang hidup sebenarnya dalam perjalanan menuju negeri yang kekal yang akan tinggal di sana dalam waktu yang sangat lama."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "57. Setiap makhluk pasti merasakan kematian di tanah air dan wilayahnya atau di tempat asing dan tempat hijrahnya. Kemudian kalian dikembalikan kepada Kami setelah mati untuk dihisab dan dibalas"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "56-59. Allah berfirman, “hai hamba-hambaKu yang beriman,” kepadaKu dan membenarkan rasulKu, “sesungguhnya bumiKu luas, maka sembahlah Aku saja,” apabila kalian tidak bisa beribadah kepada Rabb kalian di suatu daerah, maka pindahlah darinya ke daerah yang lain di mana kalian bisa beribadah kepada Allah semata. Sebab, tempat-tempat ibadah dan letak-letaknya luas, sementara Dzat yang disembah hanya satu, dan kematian pasti akan menimpa kalian, kemudian kalian akan dikembalikan kepada Rabb kalian. Lalu Dia akan memberikan balasan kepada orang yang menyempurnakan ibadahnya dan memadukan antara iman dana mal shalih, yaitu Dia akan menempatkannya pada bilik-bilik yang sangat tinggi dan tempat-tempat tinggal yang sangat indah lagi penuh dengan apa saja yang disukai oleh jiwa dan sedap dipandang mata, sedangkan kalian kekal di dalamnya. Itulah senikmat-nikmat tempat tinggal di surga yang penuh kenikmatan dan pahala bagi orang-orang yang beramal di sisi Allah, “yaitu orang-orang yang bersabar,” dalam beribadah kepada Allah, “dan bertawakkal kepada Rabbnya.” Dalam hal itu. Kesabaran mereka dalam beribadah kepada Allah menuntut sikap mencurahkan segenap kemampuan dan potensi, dan perang besar melawan setan yang selalu mengajak mereka merusak sebagian dari ibadah. Dan tawakkal mereka kepada Allah berkonsekuensi sangat bersandar kepada Allah dan berbaik sangka kepadaNya, bahwa Dia pasti akan merealisasikan dan menyempurnakan amal-amal kebajikan yang mereka tekadkan. Allah menuliskan nash tawakal, walaupun ia sudah masuk dalam makna sabar adalah karena tawakal selalu dibutuhkan dalam setiap mengerjakan perintah dan meninggalkan larangan, dan ia tidak akan bisa terlaksana kecuali disertai tawakal."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Ankabut ayat 57: Allah mengabarkan bahwasanya setiap jiwa akan merasakan maut, berpindah dari dunia ini, semuanya kembali kepada Allah, untuk diberikan balasan bagi setiap amalan mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Ankabut Ayat 57",
    "description": "Jika kamu khawatir mati kelaparan akibat hijrah ke tempat lain, ketahuilah bahwa kamu pasti akan mati dengan cara lain. Sebab setiap makhluk yang bernyawa tanpa terkecuali akan merasakan mati, dengan atau tanpa sebab. Kemudian, setelah itu hanya kepada kami kamu dikembalikan untuk mendapat balasan yang setimpal atas amal perbuatanmu, baik maupun buruk. Ayat ini mengandung ancaman bagi orang-orang kafir. 58. Allah menjanjikan surga bagi hamba-Nya yang beriman. Dan orang-orang yang beriman dan senantiasa mengerjakan kebajikan dengan mematuhi perintah Allah dan meninggalkan larangan-Nya, sungguh mereka akan kami tempatkan pada tempat-tempat yang tinggi di surga yang mengalir di bawahnya sungai-sungai. Mereka kekal di dalamnya dengan penuh kenikmatan. Itulah sebaik-baik balasan bagi orang yang berbuat kebajikan semata karena Allah."
  }
]