[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang yang beriman kepada Allah dan RasulNya serta mengerjakan apa-apa yang diperintahkan kepada mereka, berupa amal-amal shalih, Kami benar-benar akan tempatkan mereka pada kamar-kamar yang tinggi di dalam surga yang di bawahnya mengalir sungai-sungai, mereka tinggal kekal abadi di dalamnya. Sebaik-baik balasan bagi orang-orang yang beramal dengan menjalankan ketaatan kepada Allah adalah kamar-kamar hunian tersebut di surga yang penuh kenikmatan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "58. Orang-orang yang beriman kepada Allah dan mengerjakan amal perbuatan saleh yang mendekatkannya kepada Allah, sungguh Kami akan menyiapkan untuk mereka kamar-kamar di Surga, di bawahnya mengalir sungai-sungai, mereka kekal di dalamnya, mereka tidak terjamah oleh kefanaan. Balasan ini adalah sebaik-baik balasan untuk orang yang menjalankan ketaatan kepada Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "58. وَالَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ الصّٰلِحٰتِ لَنُبَوِّئَنَّهُم مِّنَ الْجَنَّةِ غُرَفًا (Dan orang-orang yang beriman dan mengerjakan amal-amal yang saleh, sesungguhnya akan Kami tempatkan mereka pada tempat-tempat yang tinggi di dalam surga) Ayat ini mengandung ajakan untuk berhijrah. Yakni Kami akan menempatkan kalian di tempat-tempat yang tinggi di surga, maka janganlah kalian merasa berat berpisah dari negeri kalian untuk berhijrah di jalan Allah demi menyelamatkan agama kalian, sebab balasan bagi kalian berada di sisi Allah. تَجْرِى مِن تَحْتِهَا الْأَنْهٰر(yang mengalir sungai-sungai di bawahnya) Yakni di bawah tempat-tempat yang tinggi itu. خٰلِدِينَ فِيهَا ۚ (mereka kekal di dalamnya) Yakni di dalam tempat-tempat yang tinggi tersebut, atau di dalam surga, mereka tidak akan mati selamanya. نِعْمَ أَجْرُ الْعٰمِلِينَ (Itulah sebaik-baik pembalasan bagi orang-orang yang beramal) Yakni sebaik baik balasan bagi orang-orang yang beramal shalih, yaitu balasan berupa surga."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "58. Orang-orang yang beriman kepada Allah dan rasulNya serta mengerjakan amal shalih yang diperintahkan secara hukum, sungguh Kami akan memberi mereka ruang-ruang dari surga (tempat-tempat yang tinggi) yang mengalir sungai dari bawah pohon-pohon dan tempat-tempatnya. Mereka menetap di dalam surga selama-lamanya. Sebaik-baik balasan ini adalah balasan bagi orang-orang-orang yang mengerjakan perintah-perintah Allah SWT."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "56-59. Allah berfirman, “hai hamba-hambaKu yang beriman,” kepadaKu dan membenarkan rasulKu, “sesungguhnya bumiKu luas, maka sembahlah Aku saja,” apabila kalian tidak bisa beribadah kepada Rabb kalian di suatu daerah, maka pindahlah darinya ke daerah yang lain di mana kalian bisa beribadah kepada Allah semata. Sebab, tempat-tempat ibadah dan letak-letaknya luas, sementara Dzat yang disembah hanya satu, dan kematian pasti akan menimpa kalian, kemudian kalian akan dikembalikan kepada Rabb kalian. Lalu Dia akan memberikan balasan kepada orang yang menyempurnakan ibadahnya dan memadukan antara iman dana mal shalih, yaitu Dia akan menempatkannya pada bilik-bilik yang sangat tinggi dan tempat-tempat tinggal yang sangat indah lagi penuh dengan apa saja yang disukai oleh jiwa dan sedap dipandang mata, sedangkan kalian kekal di dalamnya. Itulah senikmat-nikmat tempat tinggal di surga yang penuh kenikmatan dan pahala bagi orang-orang yang beramal di sisi Allah, “yaitu orang-orang yang bersabar,” dalam beribadah kepada Allah, “dan bertawakkal kepada Rabbnya.” Dalam hal itu. Kesabaran mereka dalam beribadah kepada Allah menuntut sikap mencurahkan segenap kemampuan dan potensi, dan perang besar melawan setan yang selalu mengajak mereka merusak sebagian dari ibadah. Dan tawakkal mereka kepada Allah berkonsekuensi sangat bersandar kepada Allah dan berbaik sangka kepadaNya, bahwa Dia pasti akan merealisasikan dan menyempurnakan amal-amal kebajikan yang mereka tekadkan. Allah menuliskan nash tawakal, walaupun ia sudah masuk dalam makna sabar adalah karena tawakal selalu dibutuhkan dalam setiap mengerjakan perintah dan meninggalkan larangan, dan ia tidak akan bisa terlaksana kecuali disertai tawakal."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Ankabut ayat 58: Allah mengabarkan bahwa mereka yang beriman kepada Allah, dan membenarkan Rasulullah ﷺ, kemudian mengikuti perintah Allah dengan berhijrah di jalan Allah; Mereka akan Allah masukkan ke dalam surga, yang mengalir di dalamnya sungai-sungai, dan mereka kekal di dalamnya, tidak berpindah dan juga fana."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Ankabut Ayat 58",
    "description": "Allah menjanjikan surga bagi hamba-Nya yang beriman. Dan orang-orang yang beriman dan senantiasa mengerjakan kebajikan dengan mematuhi perintah Allah dan meninggalkan larangan-Nya, sungguh mereka akan kami tempatkan pada tempat-tempat yang tinggi di surga yang mengalir di bawahnya sungai-sungai. Mereka kekal di dalamnya dengan penuh kenikmatan. Itulah sebaik-baik balasan bagi orang yang berbuat kebajikan semata karena Allah. 59. Mereka itulah orang-orang yang bersabar dalam melaksanakan ketaatan kepada-Nya, mampu mengendalikan nafsu, dan senantiasa bertawakal kepada tuhannya setelah berikhtiar secara maksimal."
  }
]