[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya surga-surga yang telah disebutkan itu diperuntukkan bagi kaum Mukminin yang bersabar dalam beribadah kepada Allah dan memegang kuat terhadap ajaran agama mereka, dan kepada Allah-lah mereka bergantung dalam rizki-rizki dan jihad melawan musuh-musuh mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "59. Ini juga merupakan sebaik-baik balasan bagi orang-orang yang menempuh ketaatan kepada Allah dengan bersabar dalam menjalankannya dan di dalam menghindari kemaksiatan terhadap Allah serta hanya kepada Allah semata mereka menggantungkan segala perkara mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "59. الَّذِينَ صَبَرُوا۟ ((yaitu) yang bersabar) Bersabar dalam menjalankan kewajiban-kewajiban agama, dan bersabar atas gangguan dari orang-orang musyrik. وَعَلَىٰ رَبِّهِمْ يَتَوَكَّلُونَ(dan bertawakkal kepada Tuhannya) Yakni mereka menyerahkan urusan mereka dalam segala keadaan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "59. (Yaitu) orang-orang yang bersabar atas siksaan orang-orang musyrik dan berhijrah untuk menyebarkan agama serta hal lain berupa cobaan dan musibah. Mereka menyerahkan urusan kepada Tuhan mereka dan mengimaninya."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "56-59. Allah berfirman, “hai hamba-hambaKu yang beriman,” kepadaKu dan membenarkan rasulKu, “sesungguhnya bumiKu luas, maka sembahlah Aku saja,” apabila kalian tidak bisa beribadah kepada Rabb kalian di suatu daerah, maka pindahlah darinya ke daerah yang lain di mana kalian bisa beribadah kepada Allah semata. Sebab, tempat-tempat ibadah dan letak-letaknya luas, sementara Dzat yang disembah hanya satu, dan kematian pasti akan menimpa kalian, kemudian kalian akan dikembalikan kepada Rabb kalian. Lalu Dia akan memberikan balasan kepada orang yang menyempurnakan ibadahnya dan memadukan antara iman dana mal shalih, yaitu Dia akan menempatkannya pada bilik-bilik yang sangat tinggi dan tempat-tempat tinggal yang sangat indah lagi penuh dengan apa saja yang disukai oleh jiwa dan sedap dipandang mata, sedangkan kalian kekal di dalamnya. Itulah senikmat-nikmat tempat tinggal di surga yang penuh kenikmatan dan pahala bagi orang-orang yang beramal di sisi Allah, “yaitu orang-orang yang bersabar,” dalam beribadah kepada Allah, “dan bertawakkal kepada Rabbnya.” Dalam hal itu. Kesabaran mereka dalam beribadah kepada Allah menuntut sikap mencurahkan segenap kemampuan dan potensi, dan perang besar melawan setan yang selalu mengajak mereka merusak sebagian dari ibadah. Dan tawakkal mereka kepada Allah berkonsekuensi sangat bersandar kepada Allah dan berbaik sangka kepadaNya, bahwa Dia pasti akan merealisasikan dan menyempurnakan amal-amal kebajikan yang mereka tekadkan. Allah menuliskan nash tawakal, walaupun ia sudah masuk dalam makna sabar adalah karena tawakal selalu dibutuhkan dalam setiap mengerjakan perintah dan meninggalkan larangan, dan ia tidak akan bisa terlaksana kecuali disertai tawakal."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Ankabut ayat 59: Allah menjelaskan bahwa mereka orang-orang yang beriman mendapatkan balasan ini, karena sebab mereka sabar ata kesulitan hijrah dan jihad, mereka berpegang teguh dengan agama mereka, bertawakkal kepada Tuhan mereka dan bersandar kepada-Nya, dan menyerahkan segala urusan kepada-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni terhadap gangguan orang-orang musyrik serta berhijrah untuk menampakkan agama. Oleh karena itu, Allah memberi rezeki kepada mereka dari arah yang tidak mereka sangka. Tawakkal menghendaki untuk bersandar kepada Allah dan bersangka baik kepada-Nya, bahwa Dia akan mewujudkan amal yang mereka ‘azamkan dan menyempurnakannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Ankabut Ayat 59",
    "description": "Mereka itulah orang-orang yang bersabar dalam melaksanakan ketaatan kepada-Nya, mampu mengendalikan nafsu, dan senantiasa bertawakal kepada tuhannya setelah berikhtiar secara maksimal. 60. Sebagian kaum muslim merasa berat untuk berhijrah karena khawatir akan kelangsungan hidupnya di tempat yang baru. Karena itu, ayat ini menegaskan bahwa rezeki itu sepenuhnya menjadi tanggung jawab Allah. Dan berapa banyak makhluk bergerak yang bernyawa yang tidak dapat membawa dan mengurus rezekinya sendiri. Allah-lah yang memudahkannya dengan memberi rezeki kepadanya dan memudahkan rezeki juga kepadamu, wahai manusia. Dia maha mendengar, maha mengetahui."
  }
]