[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan barangsiapa berjihad di jalan Allah untuk menegakkan kalimat Allah, dan berjuang menundukkan dirinya untuk taat kepadaNya, sesungguhnya ia tengah berjihad untuk dirinya sendiri. Sebab sesungguhnya ia melakukan itu demi mencari pahala melalui jihadnya. Sesungguhnya Allah MahaKaya, tidak membutuhkan segala amal perbuatan seluruh makhlukNya. KepunyaanNya-lah kerajaan, penciptaan dan penetapan ketentuan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Barangsiapa bersungguh-sungguh dengan membawa dirinya kepada ketaatan dan menjauhi larangan serta berjuang di jalan Allah, sebenarnya perjuangannya itu untuk dirinya sendiri, karena manfaatnya itu kembali kepada dirinya, dan Allah tidak butuh kepada seluruh makhluk, sehingga ketaatan mereka tidak menambah-Nya dan kemaksiatan mereka tidak mengurangi-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "6. Dan barangsiapa yang bersabar dalam menghadapi berbagai cobaan, teguh di atas agama Allah, dan berusaha meninggikan kalimat-Nya, maka dia telah menyiapkan kebaikan yang besar bagi dirinya sendiri dan Allah akan meninggikan derajatnya di akhirat, dan tidak ada manfaat sedikitpun yang diambil oleh Allah darinya karena Allah Maha Kaya, tidak membutuhkan amal perbuatan seluruh makhluk."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. وَمَن جٰهَدَ فَإِنَّمَا يُجٰهِدُ لِنَفْسِهِۦٓ ۚ (Dan barangsiapa yang berjihad, maka sesungguhnya jihadnya itu adalah untuk dirinya sendiri) Yakni barangsiapa yang berjihad melawan orang-orang kafir dan berjihad melawan dirinya sendiri dengan bersabar di atas ketaatan, maka sesungguhnya ia berjihad untuk dirinya sendiri. Yakni pahala jihad itu hanya untuknya dan bukan untuk orang lain, dan manfaatnya tidak akan berpengaruh bagi Allah sedikitpun. إِنَّ اللهَ لَغَنِىٌّ عَنِ الْعٰلَمِينَ(Sesungguhnya Allah benar-benar Maha Kaya (tidak memerlukan sesuatu) dari semesta alam) Sehingga Allah tidak butuh ketaatan mereka sebagaimana kemaksiatan mereka tidak memberi-Nya mudharat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Dan barangsiapa berusaha meninggikan kalimat Allah , maka sesungguhnya pahala usahanya itu bagi dirinya sendiri. Sesungguhnya Allah tidak membutuhkan hamba-hambaNya dari golongan manusia, jin dan malaikat. Dia tidak membutuhkan ketaataan mereka."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6. Akan tetapi tidak semua orang yang mengklaim itu diberi sesuatu yang diklaimnya, dan tidak pula setiap orang yang mendambakan (sesuatu) diberi sesuatu yang didambakannya. Sebab, Allah Maha mendengar semua suara, lagi Maha mengetahui semua niat manusia. Maka siapa saja saja yang tulus dalam hal itu, niscaya Allah memberikan kepadanya apa yang dia harapkan. Dan siapa saja yang dusta, maka klaim apa pun tidak berguna baginya. Dan Dia-lah Yang Maha Mengetahui siapa yang layak mendapatkan cintaNya, dan siapa yang tidak layak. “Dan barangsiapa yang berjihad,” melawan nafsunya, setan dan musuhnya yang kafir, “maka sesungguhnya itu adalah untuk dirinya sendiri,” sebab manfaatnya kembali kepada dirinya sendiri, hasilnya kembali kepadanya, sedangkan Allah Mahakaya, tidak membutuhkan seluruh semesta alam; Dia tidak pernah memerintahkan dengan sesuatu yang telah Dia perintahkan kepada mereka itu untuk mendapat manfaat darinya, dan tidak pula DIa melarang mereka dari sesuatu yang dilarangNya karena bakhil terhadap mereka. Sudah dimaklumi bahwa perintah dan larangan itu diperlukan adanya kesungguhan dari seorang -mukallaf untuk bisa melakukannya, sebab nafsu (jiwa) nya berdasarkan tabiatnya selalu merasa berat unttuk melakukan kebaikan itu, dan musuh-musuhnya pun, yaitu orang kafir selalu menghalang-halanginya untuk menegakkan agamanya sebagaimana mestinya. Semua ini adalah rintangan-rintangan yang membutuhkan mujahadah-mujahadah (kesungguhan) dan usaha yang sangat kuat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Ankabut ayat 6: Allah mengabarkan bahwa siapa yang sungguh-sungguh dalam kebaikan dirinya dan menolong dirinya, dan sungguh-sungguh mencurahkan untuk berjihad kepada kafir dan berperang dengan mereka, maka manfaat dan buahnya akan kembali kepadanya. Ketahuilah bahwa Allah maha kaya dari amalan-amalan makhluk, tidak ada manfaat ketaatan mereka, juga tidak membahayakan kemaksiatan mereka yang bermaksiat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Jihad melawan orang kafir atau jihad melawan hawa nafsu dan setan. Yakni manfaatnya untuk dirinya sendiri, tidak untuk Allah. Baik manusia, jin maupun malaikat, dan Dia tidak butuh ibadah mereka. Dia tidaklah memerintah mereka agar Dia memperoleh manfaat dari mereka, dan tidak pula melarang mereka karena kikir kepada mereka. Sudah menjadi maklum, bahwa perintah dan larangan butuh adanya jihad (kesungguhan), karena jiwa seseorang pada tabiatnya berat melakukan kebaikan, setan juga menghalanginya, demikian pula orang kafir sama menghalanginya dari menegakkan agama-Nya, semua ini adalah penghalang yang butuh dijihadi dan dilawan dengan kesungguhan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Ankabut Ayat 6",
    "description": "Dan barangsiapa berjihad dengan mencurahkan segala kemampuannya untuk meninggikan kalimat Allah dan mengorbankan diri dengan selalu bersabar dalam melakukan ketaatan kepada Allah, maka sesungguhnya pahala, manfaat dan kebaikan jihadnya itu adalah untuk dirinya sendiri. Tidak ada sedikit pun manfaat amal tersebut yang dibutuhkan oleh Allah. Sungguh, Allah mahakaya tidak memerlukan sesuatu apa pun dari mereka, bahkan dari seluruh alam. 7. Dan orang-orang yang beriman kepada Allah dan rasul-Nya dan mengerjakan kebajikan, pasti akan kami hapus kesalahan-kesalahannya dan mereka pasti akan kami beri balasan yang lebih baik dari apa yang me-reka kerjakan."
  }
]