[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan berapa banyak binatang yang tidak menyimpan bekal makanannya untuk keesokan harinya, sebagaimana yang dilakukan oleh keturunan Adam. Allah yang memberikan rizki kepada binatang-binatang itu dan kepada kalian. Dia Maha Mendengar ucapan-ucapan kalian, lagi Maha Mengetahui perbuatan-perbuatan kalian dan pikiran-pikiran yang terlintas di hati kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "60. Setiap hewan melata -meski banyak jumlahnya- hingga tidak bisa mengumpulkan rezekinya serta memikulnya, Allah lah yang memberinya rezeki dan memberi rezeki kepada kalian. Maka tidak ada alasan bagi kalian untuk tidak berhijrah karena khawatir kelaparan, dan Dia Maha Mendengar ucapan-ucapan kalian dan Maha Mengetahui segela niat dan amal perbuatan kalian, tidak ada sedikitpun dari hal itu yang luput dari-Nya, dan Dia akan memberi balasan untuk kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "60. Banyak sekali makhluk di muka bumi yang tidak memiliki kemampuan untuk mengumpulkan, mendapatkan, dan membawa rezekinya melainkan sekedar rezeki yang telah Allah tetapkan baginya. Dengan kelemahan makhluk itu hanya Allah yang mampu menyiapkan dan memudahkan rezeki baginya; Allah memberi rezeki kepada setiap makhluk sesuai dengan kemaslahatan baginya. Allah Maha Mendengar segala perkataan, dan Maha Mengetahui segala perbuatan dan kejadian. Umar bin Khattab berkata, Rasulullah bersabda: “Seandainya kalian sungguh-sungguh bertawakal kepada Allah, maka sungguh Allah akan memberi kalian rezeki sebagaimana Allah memberi rezeki kepada seekor burung yang pergi dalam keadaan lapar dan kembali dalam keadaan kenyang “ (Diriwayatkan oleh Imam Ibnu Majah dalam as-Sunan 3/573 no. 2344 -kitab zuhud, bab bertawakkal kepada Allah. Dan diriwayatkan oleh Imam Ahmad dalam al-Musnad 1/30. Dishahihkan oleh Imam al-Hakim dalam al-Mustadrak 4/318, dan al-Albani dalam as-Silsilah as-Shahihah no. 310)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "60. وَكَأَيِّن مِّن دَآبَّةٍ لَّا تَحْمِلُ رِزْقَهَا اللهُ يَرْزُقُهَا وَإِيَّاكُمْ ۚ (Dan berapa banyak binatang yang tidak (dapat) membawa (mengurus) rezekinya sendiri. Allah-lah yang memberi rezeki kepadanya dan kepadamu) Makna ayat ini adalah: dan di dunia terdapat banyak hewan yang tidak mampu memikul rezekinya atau menyimpan rezekinya karena ia sangat lemah, namun Allah-lah yang memberi rezeki kepada mereka dan kepada kalian dari karunia-Nya. Lalu mengapa kalian tidak bertawakkal kepada Allah yang Maha Kuat dan Maha Kuasa dalam mencari penghidupan sebagaimana tawakkal hewan-hewan yang lemah itu kepada Allah. Ayat ini mengandung peneguhan hati bagi orang yang hendak berhijrah yang masih ragu karena takut terhadap kemiskinan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "60. Berapa banyak hewan melata (min untuk menjelaskan jenis sesuatu yang banyak di susunan sebelumnya, yaitu banyak hewan melata) yang tidak mampu memikul dan melindungi beban rejekinya karena lemah. Allah memberi mereka dan kalian rejeki dengan memudahkan sebab-sebab (pendapatan) rejeki dan kehidupan. Dia Maha Mendengar ucapan-ucapan kalian dan Maha Mengetahui keadaan-keadaan dan rahasia-rahasia kalian. Ayat ini diturunkan saat Nabi meminta sahabat-sahabatnya untuk berhijrah ke Madinah lalu mereka berkata: “Di sana Kami tidak memiliki rumah dan bangunan. Tidak ada pula orang yang memberi makan dan memberi minum kami.” Kemudian turunlah ayat ini"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "60. Allah sang Pencipta telah menjamin rizki seluruh makhluk, yang kuat maupun mereka yang lemah. Betapa banyak “binatang melata,” di muka bumi ini yang lemah kekuatannya, rendah akalnya, “yang tidak dapat membawa (mengurus) rizkinya sendiri,” dan tidak pula dapat menyimpannya, bahkan ia tetap senantiasa tidak dapat membawa rizkinya sedikitpun, namun Allah terus menyediakan rizki untuknya pada setiap saat sesuai dengan waktunya. “Allah-lah yang memberi rizki kepadanya dan kepadamu,” jadi kalian semua menjadi tanggungan Allah yang mengatur rizki kalian, sebagaimana Dia telah menciptakan dan mengurusi kalian. “dan Dia MahaMendengar lagi MahaMengetahui,” maka tidak ada sesuatupun yang tersembunyi dariNya, tidak akan ada binatang melatapun yang binasa karena keadaannya tersembunyi dariNya, sebagaimana Allah tegaskan, “dan tidak ada suatu binatang melatapun di bumi melainkan Allah-lah yang memberi rizkinya, dan Dia mengetahui tempat berdiam binatang itu dan tempat penyimpanannya. Semua tertulis dalam kitab yang nyata (lauh mahfudzh).” (hud:6)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Ankabut ayat 60: Ketahuilah wahai manusia, berapa banyak dari hewan yang melata yang lemah di bumi, yang mereka tidak dapat mencari rezeki dan juga tidak dapat menyimpan; Allah cukupkan rezeki mereka, dengan dipertemukan rezeki tersebut dengan mereka ?! Sebagaimana Allah cukupkan rezeki kalian, maka tidak ada yang menghalangi kalian dari hijrah karena sebab kalian takut faqir dan hilang harta, karena sungguh Allah telah mencukupi rezeki kalian dan rezeki seluruh makhluk-Nya. Sesungguhnya Allah maha mendengar perkataan-perkataan kalian, tidak tersembunyi bagi-Nya sesuatu apapun, Dialah yang maha mengetahui niat-niat kalian dan kondisi kalian, dan apa yang ada dalam dada-dada kalian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Karena lemahnya. Wahai orang-orang yang berhijrah! Meskipun kamu tidak membawa bekal setelah berusaha membawanya. Kamu semua adalah tanggungan Allah, rezekimu diurus-Nya sebagaimana Dia yang menciptakan kamu dan mengaturmu.. Oleh karena itu, tidak ada satu pun yang samar bagi-Nya, dan tidak ada satu pun makhluk yang binasa karena tidak mendapatkan rezeki disebabkan samar oleh-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Ankabut Ayat 60",
    "description": "Sebagian kaum muslim merasa berat untuk berhijrah karena khawatir akan kelangsungan hidupnya di tempat yang baru. Karena itu, ayat ini menegaskan bahwa rezeki itu sepenuhnya menjadi tanggung jawab Allah. Dan berapa banyak makhluk bergerak yang bernyawa yang tidak dapat membawa dan mengurus rezekinya sendiri. Allah-lah yang memudahkannya dengan memberi rezeki kepadanya dan memudahkan rezeki juga kepadamu, wahai manusia. Dia maha mendengar, maha mengetahui. 61. Usai menjelaskan janji dan ancaman-Nya, Allah kemudian beralih menegaskan bahwa seandainya orang kafir mau menggunakan akal budinya, pasti mereka akan mengakui eksistensi dan keesaan Allah. Dan sungguh, jika engkau bertanya kepada mereka, 'siapakah yang menciptakan langit dan bumi dan menundukkan matahari dan bulan supaya selalu berada di garis edarnya dan tidak saling mendahului'' pasti mereka akan menjawab, 'Allah. ' maka mengapa mereka bisa dipalingkan dari kebenaran, padahal bukti-bukti tentang wujud keesaan Allah sedemikian jelas'."
  }
]