[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan jikalau kamu (wahai Rasul) bertanya kepada kaum musyrikin, “Siapakah Dzat yang menciptakan langit dan bumi dengan keteraturan yang indah ini, dan menundukkan matahari dan bulan?” pastilah mereka benar-benar akan mengatakan, “Allah-lah saja yang menciptakannya.” Maka mengapa mereka dapat dipalingkan dari beriman kepada Allah, Pencipta segala sesuatu dan pengaturannya, dan menyembah selain Allah bersamaNYa? Alangkah aneh kedustaan dan kebohongan mereka!"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "61. Jika engkau -wahai Rasul- bertanya kepada orang-orang musyrik, “Siapa yang menciptakan langit? Siapa yang menciptakan bumi? Siapa yang menundukkan matahari dan bulan, keduanya saling bergantian?” Niscaya mereka menjawab, “Yang menciptakan langit, menciptakan bumi, menundukkan matahari dan bulan terus menerus adalah Allah.” Maka bagaimana mereka terpalingkan dari keimanan kepada Allah semata dan menyembah tuhan-tuhan selain Allah yang tidak mampu mendatangkan manfaat dan tidak pula memberikan mudarat?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "61. Hai Rasulullah, sungguh jika kamu bertanya kepada orang-orang musyrik: “Siapa yang menciptakan langit dan bumi dan menundukkan matahari dan bulan sehingga keduanya beredar sesuai dengan kemaslahatan bagi makhluk-makhluk lainnya?” niscaya mereka akan menjawab: “Hanya Allah yang menciptakannya”. Jika mereka mengakui Allah yang menciptakan, mengapa mereka tidak menyembah Allah semata?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "61. وَلَئِن سَأَلْتَهُم مَّنْ خَلَقَ السَّمٰوٰتِ وَالْأَرْضَ وَسَخَّرَ الشَّمْسَ وَالْقَمَرَ لَيَقُولُنَّ اللهُ ۖ (Dan sesungguhnya jika kamu tanyakan kepada mereka: “Siapakah yang menjadikan langit dan bumi dan menundukkan matahari dan bulan?” Tentu mereka akan menjawab: “Allah”) Yakni “Allah-lah yang menciptakannya.” Mereka tidak akan mampu mengingkari hal ini dan tidak akan bisa menafikannya. فَأَنَّىٰ يُؤْفَكُونَ(maka betapakah mereka (dapat) dipalingkan (dari jalan yang benar)) Yakni lalu mengapa mereka berpaling dari pengakuan mengenai keesaan-Nya dalam sifat ketuhanan dan bahwa Dia tidak memiliki sekutu?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "61. Wahai Nabi, sungguh jika kamu bertanya kepada orang-orang musyrik: “Siapakah yang menciptakan dan menyempurnakan langit dan bumi, dan menundukkan matahari dan bulan sehingga keduanya bisa beredar untuk memberi manfaat bagi para makhluk?” Mereka akan berkata: “Hanya Allahlah yang Maha Pencipta dan Maha Memfungsikan (keduanya)” Lalu bagaimana bisa mereka tidak mau mengesakanNya setelah pengakuan mereka itu?!"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "61-63. ini adalah suatu pengambilan dalil (sebagai bukti) bagi kaum musyrikin yang mendustakan tauhid ilahiyah dan ibadah, dan pengharusan terhadap mereka berdasarkan tauhid rububiyyah yang mereka yakini. Sebab, kalau “kamu tanyakan kepada mereka, ’siapakah yang menjadikan langit, lalu dengannya Dia menghidupkan (menyuburkan) kembali bumi ini setelah kedustaannya? Dan siapa yang memilki kekuasaan mengatur segala sesuatu? “tentu mereka akan menjawab, ’Allah’,” semata, dan tentu mereka mengakui ketidakberdayaan berhala-berhala dan orang-orang yang menyembahnya bersama Allah untuk melakukan sedikit saja dari hal-hal itu! Maka heranlah anda terhadap kebohongan dan kedustaan mereka serta tindakan mereka menghadap kepada sesuatu yang mereka yakini ketidakberdayaanya, mereka mengakui bahwa sembahan itu tidak berhak mengurus sesuatu apa pun! Anda sangat prihatin terhadap mereka karena mereka tidak berkaal, dan karena mereka dungu, sangat lemah akalnya! Apakah kamu menemukan orang yang lebih lemah akalnya dan lebih dangkal mata hatinya daripada orang-orang yang datang kepada batu, atau kuburan atau yang serupa dengannya, “sedangkan dia mengetauhi bahwa benda-benda itu tidak dapat memberikan untungan, tidak dapat menimpakan bahaya, tidak dapat menciptakan dan tidak pula dapat memberi rizki), lalu ia mempersembahkan seluruh keikhlasannya dan ketulusan ubudih (penghambaannya), kepadanya, dan dia mempersekutukannya dengan Rabb sang pencipta, pemberi rizki, pemberi keuntungan, dan penurun bahaya? Ucapkanlah,”segala puji bagi Allah yang telah menjelaskan petunjuk (hidayah) dari kesesatan dan menjelaskan kepalsuan ajaran yang dianut oleh kaum musyrikin, agar diwaspadai oleh orang-orang yang mendapat taufikNya,” dan katakanlah, “segala puji bagi Allah yang telah menciptakan amal atas dan alam bawah, dan bertindak mengatur dan memberi mereka rizki, dan Dia melapangkan rizki kepada siapa saja yang Dia kehendaki, dan menyempitkannya terhadap siapa saja yang Dia kehendaki karena hikmah dariNya dan karena Dia tahu apa yang menjadi kemaslahatan bagi hamba-hmabNya serta apa yang pantas bagi mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Ankabut ayat 61: Sungguh jika engkau tanya wahai Nabi kepada mereka orang-orang musyrik : Siapa yang menciptakan langit dan bumi ?! Siapa yang menjalankan matahari dan bulan, dan aturan-aturan perjalanan keduanya dengan tata caranya ?! Mereka pasti akan menjawab : Allah Dialah yang menciptakan langit dan bumi, dan menjalankan matahari dan bulan, ketika mereka menjawab demikian, lalu bagaimana mereka dapat berpaling dari ibadah kepada selain-Nya, padahal Dialah pencipta yang memenuhi kebutuhan makhluk-Nya di alam ini ?!"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini menetapkan tauhid uluhiyyah dengan dalil tauhid rububiyyah, yakni oleh karena Allah Subhaanahu wa Ta'aala yang menciptakan dan mengatur alam semesta, maka Dia pula yang berhak diibadahi. Yakni orang-orang kafir. Yakni bagaimana mereka dipalingkan dari tauhid (beribadah hanya kepada-Nya) padahal mereka mengetahui bahwa Allah adalah Rabbul ‘alamin."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Ankabut Ayat 61",
    "description": "Usai menjelaskan janji dan ancaman-Nya, Allah kemudian beralih menegaskan bahwa seandainya orang kafir mau menggunakan akal budinya, pasti mereka akan mengakui eksistensi dan keesaan Allah. Dan sungguh, jika engkau bertanya kepada mereka, 'siapakah yang menciptakan langit dan bumi dan menundukkan matahari dan bulan supaya selalu berada di garis edarnya dan tidak saling mendahului'' pasti mereka akan menjawab, 'Allah. ' maka mengapa mereka bisa dipalingkan dari kebenaran, padahal bukti-bukti tentang wujud keesaan Allah sedemikian jelas'62. Allah pula yang melapangkan rezeki, baik material maupun nonmaterial, bagi orang yang dia kehendaki di antara hamba-hamba-Nya, dan dia pula yang membatasi baginya semata demi kemaslahatan hamba-Nya itu. Sungguh, Allah maha mengetahui segala sesuatu, antara lain, mana bentuk pekerjaan yang memberi maslahat atau tidak, juga rezeki mana yang maslahat dan yang tidak maslahat."
  }
]