[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah melapangkan rizki bagi siapa saja yang dikehendakiNya dari makhlukNya dan menyempitkannya bagi orang-orang yang lain dari mereka, karena Allah mengetahui apa yang terbaik untuk kemaslahat hamba-hamba-Nya. Sesungguhnya Allah Maha Mengetahui segala sesuatu tentang keadaan-keadaan dan urusan-urusan kalian. Tidak ada sesuatu pun yang tersembunyi bagiNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "62. Allah melapangkan rezeki bagi hamba-hamba-Nya yang dikehendaki-Nya, dan menyempitkannya bagi yang dikehendaki-Nya, karena suatu himah yang hanya diketahui oleh-Nya. Sesungguhnya Allah Maha Mengetahui segala sesuatu, tidak ada sesuatu pun yang luput dari-Nya, maka tidak luput darinya tindakan apa yang baik bagi hamba-hamba-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "62. Allah menenangkan para hamba, bahwa rezeki ada di tangan-Nya; Dia melapangkan atau menyempitkan rezeki bagi hamba-Nya yang Dia kehendaki, dan keduanya merupakan ujian dari Allah. Allah Maha Mengetahui segala sesuatu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "62. اللهُ يَبْسُطُ الرِّزْقَ لِمَن يَشَآءُ مِنْ عِبَادِهِۦ وَيَقْدِرُ لَهُۥٓ ۚ (Allah melapangkan rezeki bagi siapa yang dikehendaki-Nya di antara hamba-hamba-Nya dan Dia (pula) yang menyempitkan baginya) Yakni rezeki yang lapang atau sempit itu berasal dari Allah, Allah melapangkan rezeki bagi siapa yang Dia kehendaki dan menyempitkannya bagi siapa yang Dia kehendaki sesuai dengan hikmah-Nya yang dalam. إِنَّ اللهَ بِكُلِّ شَىْءٍ عَلِيمٌ (Sesungguhnya Allah Maha Mengetahui segala sesuatu) Yang mengetahui apa yang baik dan yang buruk bagi hamba-hamba-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "62. Allah melapangkan rejeki bagi hambaNya yang dikehendaki sebagai ujian dan menyempitkan rejeki bagi orang yang dikehendaki sebagai cobaan. Sesungguhnya Allah atas segala sesuatu itu Maha Mengetahui dan Maha Luas ilmuNya. Dia memberi dan mencegah (rejeki) sesuai hikmah dan kemaslahatannya."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "61-63. ini adalah suatu pengambilan dalil (sebagai bukti) bagi kaum musyrikin yang mendustakan tauhid ilahiyah dan ibadah, dan pengharusan terhadap mereka berdasarkan tauhid rububiyyah yang mereka yakini. Sebab, kalau “kamu tanyakan kepada mereka, ’siapakah yang menjadikan langit, lalu dengannya Dia menghidupkan (menyuburkan) kembali bumi ini setelah kedustaannya? Dan siapa yang memilki kekuasaan mengatur segala sesuatu? “tentu mereka akan menjawab, ’Allah’,” semata, dan tentu mereka mengakui ketidakberdayaan berhala-berhala dan orang-orang yang menyembahnya bersama Allah untuk melakukan sedikit saja dari hal-hal itu! Maka heranlah anda terhadap kebohongan dan kedustaan mereka serta tindakan mereka menghadap kepada sesuatu yang mereka yakini ketidakberdayaanya, mereka mengakui bahwa sembahan itu tidak berhak mengurus sesuatu apa pun! Anda sangat prihatin terhadap mereka karena mereka tidak berkaal, dan karena mereka dungu, sangat lemah akalnya! Apakah kamu menemukan orang yang lebih lemah akalnya dan lebih dangkal mata hatinya daripada orang-orang yang datang kepada batu, atau kuburan atau yang serupa dengannya, “sedangkan dia mengetauhi bahwa benda-benda itu tidak dapat memberikan untungan, tidak dapat menimpakan bahaya, tidak dapat menciptakan dan tidak pula dapat memberi rizki), lalu ia mempersembahkan seluruh keikhlasannya dan ketulusan ubudih (penghambaannya), kepadanya, dan dia mempersekutukannya dengan Rabb sang pencipta, pemberi rizki, pemberi keuntungan, dan penurun bahaya? Ucapkanlah,”segala puji bagi Allah yang telah menjelaskan petunjuk (hidayah) dari kesesatan dan menjelaskan kepalsuan ajaran yang dianut oleh kaum musyrikin, agar diwaspadai oleh orang-orang yang mendapat taufikNya,” dan katakanlah, “segala puji bagi Allah yang telah menciptakan amal atas dan alam bawah, dan bertindak mengatur dan memberi mereka rizki, dan Dia melapangkan rizki kepada siapa saja yang Dia kehendaki, dan menyempitkannya terhadap siapa saja yang Dia kehendaki karena hikmah dariNya dan karena Dia tahu apa yang menjadi kemaslahatan bagi hamba-hmabNya serta apa yang pantas bagi mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Ankabut ayat 62: Ketahuilah bahwa Allahlah yang meluaskan yang terkunci, Allahlah yang meluaskan rezeki bagi siapa yang dikehendaki-Nya dari hamba-Nya, Allah juga yang menyempitkan bagi siapa yang dikehendaki dari hamba-Nya, semuanya itu dengan hikmah dari-Nya, mau luas maupun sempit, keduanya terdapat hikmah dan pelajaran, sesungguhnya Allah berkuasa atas segala sesuatu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sebagai ujian. Sebagai ujian."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Ankabut Ayat 62",
    "description": "Allah pula yang melapangkan rezeki, baik material maupun nonmaterial, bagi orang yang dia kehendaki di antara hamba-hamba-Nya, dan dia pula yang membatasi baginya semata demi kemaslahatan hamba-Nya itu. Sungguh, Allah maha mengetahui segala sesuatu, antara lain, mana bentuk pekerjaan yang memberi maslahat atau tidak, juga rezeki mana yang maslahat dan yang tidak maslahat. 63. Allah kembali menunjukkan bukti kebodohan orang kafir karena tidak mau menggunakan akal mereka untuk membuktikan wujud dan keesaan-Nya. Dan sungguh jika kamu bertanya kepada mereka, 'siapakah yang menurunkan air dari langit lalu dengan air itu dihidupkan-Nya bumi yang sudah mati'' pasti mereka akan menjawab, 'Allah. ' katakanlah, wahai nabi Muhammad, 'segala puji bagi Allah' bahwa mereka mengakui kebenaran hal tersebut, tetapi kebanyakan mereka tidak mengerti atau tidak mau mempelajari bahwa tidak ada kontradiksi di alam ini; segalanya berjalan dengan teratur."
  }
]