[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan jikalau kamu (wahai Rasul) bertanya kepada kaum musyrikin, “Siapakah Dzat yang menurunkan air (hujan) dari langit lalu menghidupkan tanah dengannya setelah kegersangannya?” niscaya mereka benar-benar akan mengatakan kepadamu dengan mengakuinya, ”Allah semata, Dia-lah yang menurunkannya.” Maka katakanlah, “Segala puji bagi Allah Yang telah menerangkan hujjahNya di hadapan mereka.” Tetapi kebanyakan mereka tidak memahami apa saja yang bermanfaat bagi mereka dan segala yang mendatangkan bahaya bagi mereka. Seandainya mereka memahaminya niscaya mereka tidak menyekutukan sesuatu bersama Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "63. Jika engkau -wahai Rasul- bertanya kepada orang-orang musyrik, “Siapa yang menurunkan air dari langit yang Dia gunakan menghidupkan bumi setelah sebelumnya merupakan tanah gersang?” Niscaya mereka menjawab, “Yang menurunkan hujan dari langit dan Dia gunakan menghidupkan bumi adalah Allah.” Katakan -wahai Rasul- “Segala puji bagi Allah yang telah menampakkan bukti kepada kalian, tapi kenyataannya kebanyakan dari kalian tidak berakal, sebab apabila mereka berakal, niscaya mereka tidak mungkin menyekutukan Allah dengan berhala-berhala yang tidak mampu mendatangkan manfaat dan tidak pula mampu memberi mudarat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "63. Allah bersumpah bahwa orang-orang kafir mengakui hanya Allah yang menciptakan. Jika kamu bertanya kepada mereka, siapa yang menurunkan air dari awan, kemudian air itu menumbuhkan tanaman di tanah yang sebelumnya tandus? Niscaya mereka akan berkata: “Hanya Allah yang melakukannya”. Katakanlah: “Segala puji bagi Allah, karena telah jelas hujjah dan pengakuan lisan mereka dalam mengucapkan kebenaran, akan tetapi kebanyakan dari mereka enggan mengikuti kebenaran tersebut.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "63. وَلَئِن سَأَلْتَهُم مَّن نَّزَّلَ مِنَ السَّمَآءِ مَآءً فَأَحْيَا بِهِ الْأَرْضَ مِنۢ بَعْدِ مَوْتِهَا لَيَقُولُنَّ اللهُ ۚ (Dan sesungguhnya jika kamu menanyakan kepada mereka: “Siapakah yang menurunkan air dari langit lalu menghidupkan dengan air itu bumi sesudah matinya?” Tentu mereka akan menjawab: “Allah”) Yakni yang menurunkan hujan dan dengannya menghidupkan bumi adalah Allah. Mereka mengakui hal ini, sehingga ini menjadi bukti atas kebatilan dari kemusyrikan yang mereka lakukan dalam beribadah kepada Allah. قُلِ الْحَمْدُ لِلّٰهِ ۚ( Katakanlah: “Segala puji bagi Allah”) Yakni pujilah Allah karena telah menjadikan kebenaran itu bersamamu, serta memenangkan hujjahmu atas mereka. بَلْ أَكْثَرُهُمْ لَا يَعْقِلُونَ(tetapi kebanyakan mereka tidak memahami(nya)) Oleh sebab itu mereka tidak mau mengamalkan apa yang mereka akui itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "63. Wahai Nabi, jika kamu bertanya kepada mereka: “Siapa yang menurunkan hujan dari langit sehingga melalui itu bumi hidup dengan tumbuhnya tanaman setelah mengalami kekeringan dan kegersangan?” Sungguh mereka akan berkata: “Hanya Allah yang bisa melakukan semua itu” Katakanlah (wahai Muhammad): ”Segala puji bagi Allah karena telah menampakkan hujjah dan memberi pertolongan terhadap kebenaran, namun kebanyakan orang orang-orang musyrik itu tidak menyadari pertentangan mereka dalam hal itu”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "61-63. ini adalah suatu pengambilan dalil (sebagai bukti) bagi kaum musyrikin yang mendustakan tauhid ilahiyah dan ibadah, dan pengharusan terhadap mereka berdasarkan tauhid rububiyyah yang mereka yakini. Sebab, kalau “kamu tanyakan kepada mereka, ’siapakah yang menjadikan langit, lalu dengannya Dia menghidupkan (menyuburkan) kembali bumi ini setelah kedustaannya? Dan siapa yang memilki kekuasaan mengatur segala sesuatu? “tentu mereka akan menjawab, ’Allah’,” semata, dan tentu mereka mengakui ketidakberdayaan berhala-berhala dan orang-orang yang menyembahnya bersama Allah untuk melakukan sedikit saja dari hal-hal itu! Maka heranlah anda terhadap kebohongan dan kedustaan mereka serta tindakan mereka menghadap kepada sesuatu yang mereka yakini ketidakberdayaanya, mereka mengakui bahwa sembahan itu tidak berhak mengurus sesuatu apa pun! Anda sangat prihatin terhadap mereka karena mereka tidak berkaal, dan karena mereka dungu, sangat lemah akalnya! Apakah kamu menemukan orang yang lebih lemah akalnya dan lebih dangkal mata hatinya daripada orang-orang yang datang kepada batu, atau kuburan atau yang serupa dengannya, “sedangkan dia mengetauhi bahwa benda-benda itu tidak dapat memberikan untungan, tidak dapat menimpakan bahaya, tidak dapat menciptakan dan tidak pula dapat memberi rizki), lalu ia mempersembahkan seluruh keikhlasannya dan ketulusan ubudih (penghambaannya), kepadanya, dan dia mempersekutukannya dengan Rabb sang pencipta, pemberi rizki, pemberi keuntungan, dan penurun bahaya? Ucapkanlah,”segala puji bagi Allah yang telah menjelaskan petunjuk (hidayah) dari kesesatan dan menjelaskan kepalsuan ajaran yang dianut oleh kaum musyrikin, agar diwaspadai oleh orang-orang yang mendapat taufikNya,” dan katakanlah, “segala puji bagi Allah yang telah menciptakan amal atas dan alam bawah, dan bertindak mengatur dan memberi mereka rizki, dan Dia melapangkan rizki kepada siapa saja yang Dia kehendaki, dan menyempitkannya terhadap siapa saja yang Dia kehendaki karena hikmah dariNya dan karena Dia tahu apa yang menjadi kemaslahatan bagi hamba-hmabNya serta apa yang pantas bagi mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Ankabut ayat 63: Dan jika engkau wahai Nabi Allah tanya kepada mereka : Siapa yang menurunkan hujan dari langit, yang menghidupkan bumi setelah kering ?! Pasti mereka akan menjawab yang bertanya : Allah Dialah yang menurunkan hujan. Maka katakan : Segala puji bagi Allah atas tegaknya bukti bagi mereka, dan ketahuilah kebanyakan mereka manusia tidaklah paham dengan akal-akal mereka, sekiranya mereka tahu, mereka akan beramal dengan amalan yang akan menyelamatkan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mereka akan mengakui kelemahan berhala dan patung yang mereka sembah selain-Nya. Oleh karena itu, mengapa mereka sampai menyekutukan Allah dengan sesuatu? Kita tentu tidak akan menemukan orang yang paling lemah akalnya dan paling sedikit ketajaman hatinya daripada orang yang mendatangi batu, kuburan dan sebagainya untuk disembah, sedangkan dirinya mengetahui bahwa benda-benda itu tidak memberikan manfaat dan tidak dapat menolak bahaya, tidak dapat menciptakan dan tidak dapat memberikan rezeki. Anehnya, mereka malah memberikan keikhlasan dan pengabdian kepadanya serta menyekutukannya dengan Allah Yang Maha Pencipta lagi Yang memberi rezeki, Yang memberi manfaat dan menimpakan bahaya. Karena telah tegak hujjah bagimu, atau karena Dia telah menerangkan petunjuk daripada kesesatan serta menerangkan kebatilan yang dipegang oleh kaum musyrik selama ini. Demikian pula segala puji bagi-Nya, karena Dia telah menciptakan alam semesta, mengatur dan memberikan rezeki kepada mereka, melapangkan dan menyempitkan siapa yang Dia kehendaki karena kebijaksanaan-Nya, dan karena Dia mengetahui hal yang pantas bagi hamba-hamba-Nya. Pertentangan mereka dalam hal pengakuan dan prakteknya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Ankabut Ayat 63",
    "description": "Allah kembali menunjukkan bukti kebodohan orang kafir karena tidak mau menggunakan akal mereka untuk membuktikan wujud dan keesaan-Nya. Dan sungguh jika kamu bertanya kepada mereka, 'siapakah yang menurunkan air dari langit lalu dengan air itu dihidupkan-Nya bumi yang sudah mati'' pasti mereka akan menjawab, 'Allah. ' katakanlah, wahai nabi Muhammad, 'segala puji bagi Allah' bahwa mereka mengakui kebenaran hal tersebut, tetapi kebanyakan mereka tidak mengerti atau tidak mau mempelajari bahwa tidak ada kontradiksi di alam ini; segalanya berjalan dengan teratur. 64. Salah satu faktor yang menjadikan orang-orang kafir enggan menyembah Allah, meski bukti wujud dan keesaan-Nya begitu jelas, adalah motivasi duniawi. Karena itu, ayat ini menginformasikan hakikat kehidupan dunia dan perbandingannya dengan kehidupan akhirat. Dan kehidupan dunia ini hina, tidak bernilai, dan tidak pula kekal. Dunia ini hanya senda-gurau yang akan melenakan orang kafir dari tugas hidup yang sebenarnya, dan dunia ini juga layaknya permainan yang hanya memberi kesenangan sesaat, sebelum kelelahan datang. Dan sesungguhnya negeri akhirat itulah kehidupan yang sebenarnya bagi manusia. Itulah kehidupan yang kekal dan abadi. Di sana manusia akan merasakan kebahagiaan dan kesengsaraan yang hakiki, sekiranya mereka mengetahui dan memahami kefanaan dunia dan kekekalan akhirat. Namun, banyak dari mereka tidak berusaha memahami hal itu."
  }
]