[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "65-66. Apabila orang-orang kafir naik menumpang kapal-kapal di laut, dan mereka khawatir tenggelam, mereka mengesakan Allah dan mengikhlaskan doa hanya kepadaNya dalam keadaan sulit mereka. Tatkala Allah telah menyelamatkan mereka ke daratan dan kesulitan mereka telah sirna, mereka kembali kepada kesyirikan mereka. Dengan sikap demikian ini, mereka itu telah melakukan dua hal yang saling kontradiktif; mengesakan Allah dalam kesulitan, dan menyekutukan Allah dalam kondisi nyaman. Dan perbuatan syirik mereka setelah curahan nikmat Kami pada mereka berupa keselamatan dari (mara bahaya) lautan, agar kesudahannya berwujud kekafiran terhadap kenikmatan yang telah Kami berikan kepada mereka dalam diri mereka, harta benda mereka; dan agar mereka menghabiskan kesenangan mereka di dunia ini. Lalu mereka akan mengetahui rusaknya perbuatan-perbuatan mereka dan siksaan pedih yang Allah sediakan bagi mereka di Hari Kiamat. Dalam ayat ini termuat satu peringatan keras dan ancaman bagi mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "66. Mereka kembali menjadi musyrik untuk mengingkari kenikmatan yang telah Kami berikan kepada mereka dan untuk menikmati apa yang telah mereka dapatkan berupa perhiasan kehidupan dunia, dan niscaya mereka akan mengetahui akibat perbuatan mereka ketika mereka mati."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "66. Sesungguhnya mereka itu musyrik agar mereka bisa mengingkari nikmat yang Kami berikan dan lapangkan untuk mereka, dan agar mereka bisa menikmati penyembahan berhala (Lam dalam dua fiil tersebut adalah lam untuk membenarkan kekuasaan Allah dan lam untuk menunjukkan konsekwensi dan efek yang didapatkan oleh mereka) Maka mereka akan mengetahui konsekwensi atas hal itu."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "65-66. kemudian Allah mengharuskan kaum musyrikin dengan ketulusan mereka kepada Allah pada saat dalam keadaan sempit (kepepet) di waktu mereka mengarungi lautan dan menggunungnya gelombang, serta saat mereka sangat takut akan binasa (tenggelam), di mana mereka mengabaikan sesembahan-sesembahan mereka, dan mereka dengan tulus hanya berdoa kepada Allah semata, tidak ada sekutu bagiNya. Lalu, tatkala suasana sempit itu ada, -dan Allah telah menyelamatkan mereka ke daratan karena ketulusan doa mereka kepadaNYa-, ternyata mereka mempersekutukan Allah lagi dengan sembahan-sembahan yang tidak dapat menyelamatkan mereka dari kesempitan, dan tidak pula dapat menghilangkan kesulitan dari mereka. Kenapa mereka tidak menuluskan doa kepada Allah dalam kondisi lapang dan sempit, mudah dan sulit agar mereka bisa benar-benar menjadi orang-orang mukmin sejati, yang berhak mendapat pahala dariNya, diselamatkan dari azabNya. Akan tetapi, kesyirikan mereka tersebut adalah setelah Kami melimpahkan karunia kepada mereka, yaitu berupa keselamatan dari bahaya lautan agar kesudahannya adalah kufur terhadap apa yang telah kami anugerahkan kepada mereka dan memabalas nikmat dengan sikap buruk, serta agar mereka dapat sepenuhnya bersenang-senang di dunia ini, suatu kesenangan nyang tak ubahnya seperti bersenang-senangnya hewan. Mereka tidak mempunyai visi selain perut dan kemaluan mereka. “kelak mereka akan mengetahui,” di saat mereka berpindah dari kehidupan dunia menuju kehidupan akhirat betapa dahsyatnya duka dan betapa pedihnya siksaan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Ankabut ayat 66: Ketika mereka Allah selamatkan yaitu orang-orang musyrik dari tenggelam maka mereka kembali menyekutukan Allah dengan tuhan-tuhan mereka. Mereka kufur kepada Allah dengan apa yang telah Allah berikan nikmat bagi mereka dengan tidak menenggelamkan mereka, begitu juga dengan harta dan anak mereka, maka mereka bersenang-senang dengan kehidupan dunia yang dibatasi ini; Mereka akan tahu akibat dari kesyirikan mereka, kekufuran mereka pada hari perhitungan amal dan balasan, pada ayat init terdapat peringatan dan ancaman bagi mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ini merupakan ancaman. Termasuk di antaranya nikmat dihindarkan dari bahaya. Yaitu ketika mereka meninggalkan dunia menuju akhirat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Ankabut Ayat 66",
    "description": "Allah membiarkan mereka bergelimang dalam kenikmatan penuh dosa sebagai istidraj. Biarlah mereka mengingkari nikmat yang telah kami berikan kepada mereka, seperti selamat dari bencana, sukses setelah kegagalan, sembuh dari sakit, dan silakan mereka hidup bersenang-senang dalam kekafiran dan dosa. Maka, di akhirat kelak mereka akan mengetahui akibat perbuatan mereka dan merasakan penyesalan yang tidak berguna lagi. 67. Mengapa kaum kafir mekah enggan menyembah Allah' tidakkah mereka memperhatikan beberapa nikmat Allah, antara lain bahwa kami telah menjadikan negeri mereka, mekah, sebagai tanah suci yang aman, padahal manusia di sekitarnya, yakni di luar mekah, saling merampok dan saling membunuh sehingga selalu diliputi kecemasan' setelah kebenaran datang kepada mereka secara gamblang, mengapa mereka masih percaya kepada yang batil dan ingkar kepada nikmat Allah dengan tetap menyembah berhala'."
  }
]