[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidakkah orang-orang kafir Makkah melihat bahwa sesungguhnya Allah telah menjadikan Makkah sebagai kota suci yang aman bagi mereka, yang para penduduknya merasa aman dengan jiwa-jiwa dan harta mereka, sedang orang-orang sekitar mereka yang diluar kota suci mengalami ancaman-ancaman dan tidak merasa aman? Apakah mereka justru meyakini keyakinan yang syirik, sedang dengan kenikmatan Allah yang telah mengistimewakan mereka dengannya, mereka mengingkarinya, tidak beribadah kepadaNya semata tanpa menyembah selainNya?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "67. Tidakkah orang-orang yang mengingkari nikmat-nikmat Allah atas mereka itu ketika Allah menyelamatkan mereka dari tenggelam mengetahui adanya kenikmatan lain, yaitu bahwa Kami telah membuatkan untuk mereka tanah suci yang di dalamnya mereka merasa aman atas darah dan harta mereka, pada saat orang-orang selain mereka sedang ditimpa peperangan; mereka terbunuh, ditahan, wanita-wanita dan keluarga mereka ditawan, harta mereka dirampas. Apakah dengan kebatilan dari tuhan-tuhan yang mereka akui itu mereka percaya sementara terhadap kenikmatan yang Allah berikan mereka mengingkari? Kenapa mereka tidak mensyukurinya kepada Allah?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "67. Apakah orang-orang kafir Quraisy tidak mengetahui bahwa Kami telah menjadikan kota Makkah menjadi tempat yang suci dan aman bagi diri dan harta mereka, sedangkan orang-orang di sekitar mereka yang ada di luar tanah suci senantiasa terancam pembunuhan, penawanan, dan perampokan? Setelah Allah memberi kenikmatan yang besar ini apakah mereka kemudian beriman kepada patung dan berhala-berhala, dan mengingkari kenikmatan Allah Yang Maha Pengasih?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "67. أَوَلَمْ يَرَوْا۟ أَنَّا جَعَلْنَا حَرَمًا ءَامِنًا (Dan apakah mereka tidak memperhatikan, bahwa sesungguhnya Kami telah menjadikan (negeri mereka) tanah suci yang aman) Yakni orang-orang kafir Quraisy mengetahui, bahwa Kami jadikan negeri mereka ini sebagai negeri yang aman, penduduknya aman dari serangan musuh, pembunuhan, penawanan, dan penculikan. وَيُتَخَطَّفُ النَّاسُ مِنْ حَوْلِهِمْ ۚ (Dan apakah mereka tidak memperhatikan, bahwa sesungguhnya Kami telah menjadikan (negeri mereka) tanah suci yang aman) Yakni mereka berada dalam keamanan dan kesejahteraan; berbeda halnya dengan orang-orang Arab lainnya, mereka setiap saat dapat diserang musuh, harta mereka dirampas, darah mereka ditumpahkan, dan kehormatan dan harta benda mereka dirampas oleh para penjahat orang Arab dan setan-setannya. أَفَبِالْبٰطِلِ يُؤْمِنُونَ(Maka mengapa (sesudah nyata kebenaran) mereka masih percaya kepada yang bathil) Yakni percaya terhadap kemusyrikan setelah hujjah Allah ditegakkan atas mereka. وَبِنِعْمَةِ اللهِ يَكْفُرُونَ (dan ingkar kepada nikmat Allah?) Yakni mengganti rasa syukur terhadap kenikmatan itu dengan rasa ingkar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "67. Apakah orang-orang kafir Quraisy itu tidak mengetahui bahwa sesungguhnya Kami menciptakan tanah Mekah ini sebagai tanah yang suci dan aman bagi jiwa dan harta (mereka). Orang-orang di sekitar mereka dirampok dengan dibunuh, disandera dan dicuri. Apakah terhadap kebatilan (yaitu berhala atau setan) mereka akan beriman setelah tampaknya hujjah atas mereka dan mengingkari nikmat Allah, sehingga (awalnya) mereka tidak menyekutukan Tuhan mereka yang memberi nikmat lalu menyekutukanNya dengan tuhan lainnya? Ibnu Abbas berkata: “Orang-orang musyrik berkata: “Wahai Muhammad, Tidak ada yang mencegah kami untuk memasuki agamamu kecuali kami khawatir ditawan orang-orang karena jumlah kami sedikit sedangkan bangsa Arab lebih banyak daripada kami”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "67. kemudian Allah menyebutkan karuniaNya terhadap mereka berupa tanah haram yang aman, dan bahwa sesungguhnya mereka adalah para penduduknya yang berada dalam suasana aman, lapang dan penuh rizki, sementara masyarakat yang berada di sekitarnya (di luar tanah haram) selalu dirampok dan merasa cemas. Lalu mereka tidak menyembah tuhan yang telah memberi mereka makan (sehingga bebas) dari kelaparan dan menentramkan mereka dari rasa takut? “maka mengapa mereka masih percaya kepada yang batil,” yaitu kesyirikan yang mereka anut, perkataan dan berbagai perbuatan yang batil (palsu), “dan kepada nikmat Allah,” mereka “ingkar” ke mana akal pikiran mereka pergi? Dan htai nurani mereka hilang? Mereka lebih mementingkan kesesatan daripada hidayah, kebatilan daripada kebenaran, dan kesengsaraan daripada kebahagiaan; di mana dan kapan saja mereka berada, maka mereka adalah manusia yang paling zhalim."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Ankabut ayat 67: Allah berkata : Apakah mereka orang-orang yang mendustakan tidak melihat bahwasanya Kami telah menjadikan mereka tenang dan aman di negeri mereka yang tiada mengganggu seorang pun (tidak sebagaimana negeri yang lain), dengan adanya peperangan! Apakah dengan kebathilan yaitu kesyirikan mereka beriman dan membenarkan nikmat Allah ?!"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Nikmat-Nya pula kepada mereka. Mengapa mereka tidak menyembah kepada Tuhan yang memberikan makan kepada mereka di saat lapar dan mengamankan mereka di saat takut. Yaitu perbuatan syirk mereka, demikian pula ucapan dan perbuatan mereka yang batil. Di manakah mereka taruh akal mereka? Sampai-sampai, mereka rela mengutamakan kesesatan di atas petunjuk, kebatilan di atas yang hak, dan kesengsaraan di atas kebahagiaan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Ankabut Ayat 67",
    "description": "Mengapa kaum kafir mekah enggan menyembah Allah' tidakkah mereka memperhatikan beberapa nikmat Allah, antara lain bahwa kami telah menjadikan negeri mereka, mekah, sebagai tanah suci yang aman, padahal manusia di sekitarnya, yakni di luar mekah, saling merampok dan saling membunuh sehingga selalu diliputi kecemasan' setelah kebenaran datang kepada mereka secara gamblang, mengapa mereka masih percaya kepada yang batil dan ingkar kepada nikmat Allah dengan tetap menyembah berhala'68. Jika demikian adanya, siapakah yang lebih zalim daripada orang yang mengada-adakan kebohongan kepada Allah dengan perilaku syiriknya atau orang yang mendustakan yang hak, yakni kerasulan nabi Muhammad dan kebenaran Al-Qur'an sebagai kitab yang datang dari Allah, ketika yang hak itu datang kepadanya dengan bukti-bukti yang sangat jelas' padahal, perilaku semacam itu termasuk kekafiran yang diancam dengan neraka. Bukankah dalam neraka jahanam ada tempat bagi orang-orang kafir' pasti. Neraka jahanam adalah tempat kembali orang-orang kafir untuk selama-lamanya."
  }
]