[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidak ada orang yang lebih besar tindak kezhalimannya daripada orang yang berdusta terhadap Allah, lalu menyematkan keadaan sesat dan kebatilan yang ada padanya kepada Allah, atau mendustakan kebenaran yang Allah mengutus RasulNya, Muhammad, dengannya. Sesungguhnya di dalam neraka itu benar-benar terdapat tempat tinggal bagi orang-orang yang kafir kepada Allah, mengingkari keesaaNya dan mendustakan RasulNya, Muhammad."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "68. Tidak ada seorangpun yang lebih zalim daripada orang yang mengada-adakan dusta atas Allah dengan mengadakan sekutu bagi-Nya, atau mendustakan kebenaran yang dibawa oleh Rasul-Nya. Tidak disangsikan bahwa Neraka Jahanam adalah tempat bagi orang-orang kafir dan yang semisal dengan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "68. Tidak ada orang yang lebih zalim daripada orang yang membuat kedustaan terhadap Allah dengan mengatakan Allah memiliki sekutu, atau mendustakan al-Qur’an dan Rasulullah yang datang kepadanya. Apakah orang-orang yang mendustakan itu tidak mengetahui neraka Jahannam adalah tempat kembali mereka? Pertanyaan ini dimaksudkan sebagai penegas bahwa tempat mereka adalah di neraka Jahannam."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "68. وَمَنْ أَظْلَمُ مِمَّنِ افْتَرَىٰ عَلَى اللهِ كَذِبًا(Dan siapakah yang lebih zalim daripada orang-orang yang mengada-adakan kedustaan terhadap Allah) Yakni tidak ada orang yang lebih zalim dari orang yang mengatakan bahwa Allah memiliki sekutu atau orang yang berdusta terhadap Allah apa yang tidak Allah katakan. أَوْ كَذَّبَ بِالْحَقِّ لَمَّا جَآءَهُۥٓ ۚ( atau mendustakan yang hak tatkala yang hak itu datang kepadanya?) Yakni mendustakan Rasul, kitab, dan keesaan Allah. أَلَيْسَ فِى جَهَنَّمَ مَثْوًى لِّلْكٰفِرِينَ(Bukankah dalam neraka Jahannam itu ada tempat bagi orang-orang yang kafir?) Yakni sungguh di Jahannam terdapat tempat untuk mereka tinggali."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "68. Tidak ada yang lebih zalim daripada orang yang membuat-buat kebohongan kepada Allah sehingga dia beranggapan punya sekutu atau mendustakan Al-Qur’an dan Rasul saat menerima dan mendengarnya (Al-Qur’an) tanpa memahaminya. Bukankah di neraka Jahanam adalah hunian dan tempat tinggal bagi orang-orang kafir sebagai balasan kekufuran mereka?! Istifham tersebut adalah pemberitahuan bahwa tempat tinggal mereka adalah neraka Jahanam."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "68. “dan siapakah yang lebih zhalim daripada orang-orang yang mengada-adakan kedustaan terhadap Allah,” dengan menyandarkan kesesatan dan kebatilan yang dianutnya kepada Allah, dan “mendustakan yang haq tatkala yang haq itu datang kepadanya,” melalui RasulNya Muhammad? Akan tetapi orag zhalim yang berkeras kepala ini, di hadapannya sudah ada jahanam (menunggu), “bukankah dalam neraka jahanam itu ada tempat bagi orang-orang yang kafir?” dengan jahanam itu kebenaran diambil dari mereka, dan dengannya pula mereka dihinakan, dan ia pun menjadi tempat tinggal abadi mereka, yang mereka tidak akan dikeluarkan darinya?"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Ankabut ayat 68: Ketahuilah wahai manusia bahwa tidak seorangpun yang lebih dzalim, lebi buruk jalannya dengan mendustakan Alla dengan melakukan kesyirikan, atau mendustakan agama-Nya, ketika telah datang dihadapannya para nabi Allah dan Rasul-Nya, sungguh neraka adalah tempat bagi orang-orang kafir yang mendustakan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya, mendustakan Nabi Muhammad shallallahu 'alaihi wa sallam atau Al Qur’an. Di hadapan orang yang zalim lagi keras kepala ini ada neraka Jahanam, di mana dari mereka diambil hak itu dan mereka dihinakan di sana, tempat tinggal mereka kekal dan mereka tidak akan dikeluarkan daripadanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Ankabut Ayat 68",
    "description": "Jika demikian adanya, siapakah yang lebih zalim daripada orang yang mengada-adakan kebohongan kepada Allah dengan perilaku syiriknya atau orang yang mendustakan yang hak, yakni kerasulan nabi Muhammad dan kebenaran Al-Qur'an sebagai kitab yang datang dari Allah, ketika yang hak itu datang kepadanya dengan bukti-bukti yang sangat jelas' padahal, perilaku semacam itu termasuk kekafiran yang diancam dengan neraka. Bukankah dalam neraka jahanam ada tempat bagi orang-orang kafir' pasti. Neraka jahanam adalah tempat kembali orang-orang kafir untuk selama-lamanya. 69. Selanjutnya, Allah memberi janji kepada orang-orang mukmin. Dan orang-orang yang berjihad dan bersungguh-sungguh dalam menjalankan ketaatan kepada Allah dan membela agama-Nya semata untuk mencari keridaan kami, kami akan tunjukkan kepada mereka jalan-jalan kami yang mengantarkan mereka menuju kebahagiaan dan keselamatan dunia dan akhirat. Dan sungguh, Allah beserta orang-orang yang berbuat baik. Dia memberi balasan yang lebih baik kepada siapa saja yang mengembangkan sikap kebajikan dalam hal apa pun dan kepada siapa pun, tentu setelah semua kewajiban terpenuhi dengan sempurna. []."
  }
]