[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang Mukmin yang berjuang melawan musuh-musuh Allah, jiwa dan setan, dan mereka bersabar menghadapi fitnah-fitnah dan gangguan di jalan Allah, Allah akan memberikan hidayah kepada mereka menuju jalan-jalan kebajikan dan meneguhkan mereka di atas jalan yang lurus. Dan orang yang bersifat demikian, maka dia merupakan orang yang telah berbuat baik kepada diri sendiri dan kepada orang lain. Dan sesungguhnya Allah benar-benar menyertai orang yang berbuat baik dari makhlukNya dengan pertolongan, dukungan, perlindungan dan pemberian hidayah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "69. Dan orang-orang yang berjuang melawan orang-orang kafir untuk mencari rida Kami niscaya Kami mudahkan baginya untuk mendapatkan jalan yang lurus, dan sesungguhnya Allah bersama orang-orang yang berbuat baik dengan bantuan-Nya, pertolongan-Nya dan petunjuk-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "69. Dan orang-orang yang berjuang menegakkan hak Kami, demi tersebarnya agama Islam, maka sungguh Kami akan menunjukkan kepada mereka jalan-jalan kebaikan, dan akan mereka akan mendapat keridhaan Allah di dunia dan akhirat. Sungguh Allah bersama orang-orang yang membaguskan perkataan dan perbuatan mereka dengan pertolongan dan bantuan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "69. وَالَّذِينَ جٰهَدُوا۟ فِينَا(Dan orang-orang yang berjihad untuk (mencari keridhaan) Kami) Yakni mereka berjihad mengorbankan diri mereka dan memasang badan mereka untuk berdakwah di jalan Allah demi mendapatkan keridhaan Allah. لَنَهْدِيَنَّهُمْ سُبُلَنَا ۚ( benar-benar akan Kami tunjukkan kepada mereka jalan-jalan Kami) Yakni jalan-jalan kebaikan yang dapat mengantarkan kepada keridhaan Allah. وَإِنَّ اللهَ لَمَعَ الْمُحْسِنِينَ (Dan sesungguhnya Allah benar-benar beserta orang-orang yang berbuat baik) Dengan pertolongan dan bantuan-Nya. Dan barangsiapa bersama Allah niscaya tidak akan ada yang mampu mengalahkannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "69. Orang-orang yang berjihad dalam kebenaran Kami untuk menyebarkan dakwah Kami, maka sungguh Kami akan menunjukkan mereka kepada jalan kebaikan dan ridha Allah. Sesungguhnya Allah itu bersama orang-orang yang memperbaiki amal mereka dengan menolong mereka di dunia dan memberi mereka pahala di akhirat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "69. “dan orang-orang yang berjihad untuk di jalan Kami,” yaitu mereka yang berhijrah fi sabilillah dan berperang melawan musuh-musuh mereka serta mengorbankan segenap kemampuan mereka dalam rangka mencari keridhaanNya, “benar-benar akan Kami tunjukkan kepada mereka jalan-jalan Kami,” maksudnya, jalan-jalan yang dapat mengantarkan mereka kepada Kami. Hal itu karena mereka adalah orang-orang yang berbuat kebajikan, sedangkan Allah selalu bersama orang-orang yang berbuat kebajikan; memberikan pertolongan, kemenangan, dan hidayah. Hal ini menunjukkan bahwa manusia yang paling mungkin mendapatkan kebenaran adalah para pejuang (mujahid); dan siapa saja yang berbuat ihsan di dalam mengerjakan apa yang diperintahkan kepadanya, niscaya dia ditolong oleh Allah dan dimudahkan baginya segala sebab yang dapat mengantarnya kepada hidayah; dan bahwa siapa saja yang bersungguh-sungguh dan berijtihad dalam menuntut ilmu syar’I, maka dari hidayah dan pertolongan itu ia akan memperoleh perkara-perkara ilahi yang berada di luar jangkauan kemampuan kesungguhannya, masalah ilmu dijadikan mudah baginya. Karena sesungguhnya mencari ilmu syar’i itu termasuk jihad fi sabillillah, bahkan ia merupakan salah satu dari dua bentuk jihad yang tidak akan mampu melakukannya kecuali manusia-manusia pilihan. Ia merupakan jihad dengan perkataan dan lisan terhadap orang-orang kafir dan orang-orang munafik, dan jihad dalam rangka mengajarkan permasalahan agama, dan dalam rangka mengembalikan pertikaian orang-orang yang berselisih kepada yang benar, sekalipun mereka adalah orang-orang Muslim."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Ankabut ayat 69: Allah menutup surat ini dengan menganjurkan untuk berjihad dan bersungguh-sungguh dalam memerangi musuh. Dan Allah menjanjikan para mujahidin yang ikhlas di sisi-Nya, dan siapa yang Allah bersamanya, maka tidak ada yang dapat mengalahkan. Kemutlakan jihad pada ayat ini mencakup jihad keseluruhannya, jihad dengan diri, setan dan musuh-musuh Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mereka adalah orang-orang yang berhijrah di jalan Allah dan berjihad melawan musuh mereka. Mereka mengerahkan kemampuannya untuk mencari keridhaan-Nya. Yakni yang menyampaikan mereka kepada Kami, karena mereka adalah orang-orang yang berbuat ihsan. Dengan memberikan bantuan, pertolongan dan hidayah. Ayat ini menunjukkan, bahwa orang yang layak mendapatkan kebenaran adalah orang yang sungguh-sungguh, dan bahwa orang yang berbuat ihsan dalam melaksanakan perintah Allah, maka Dia akan membantunya serta memudahkan sebab-sebab hidayah. Ayat ini juga menunjukkan, bahwa orang yang bersungguh-sungguh mencari ilmu syar’i, maka dia akan mendapatkan hidayah dan pertolongan dari Allah. Di samping itu, mencari ilmu merupakan salah satu di antara dua jihad, di mana tidak ada yang melakukannya kecuali manusia-manusia pilihan, yang pertama yaitu jihad dengan ucapan dan lisan kepada kaum kafir dan munafik, jihad untuk berusaha mengajarkan agama dan membantah orang-orang yang menyelisihi yang hak, sedangkan yang kedua adalah jihad fisik (perang). Selesai tafsir surah Al ‘Ankabut dengan memuji Allah dan dengan pertolongan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Ankabut Ayat 69",
    "description": "Selanjutnya, Allah memberi janji kepada orang-orang mukmin. Dan orang-orang yang berjihad dan bersungguh-sungguh dalam menjalankan ketaatan kepada Allah dan membela agama-Nya semata untuk mencari keridaan kami, kami akan tunjukkan kepada mereka jalan-jalan kami yang mengantarkan mereka menuju kebahagiaan dan keselamatan dunia dan akhirat. Dan sungguh, Allah beserta orang-orang yang berbuat baik. Dia memberi balasan yang lebih baik kepada siapa saja yang mengembangkan sikap kebajikan dalam hal apa pun dan kepada siapa pun, tentu setelah semua kewajiban terpenuhi dengan sempurna. []1. Alif lam mim."
  }
]