[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang yang beriman kepada Allah dan RasulNya, dan mengerjakan amal shalih, niscaya Kami sunguh-sungguh akan menghapuskan dosa-dosa dari mereka dan Kami akan benar-benar memberikan pahala kepada mereka atas amal-amal shalih mereka yang lebih baik dari apa yang mereka kerjakan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Dan orang-orang yang beriman dan bersabar atas ujian Kami pada mereka serta melakukan amal saleh niscaya, Kami hapuskan dosa-dosa mereka dengan amal saleh yang mereka lakukan dan niscaya Kami beri mereka pahala di Akhirat dengan pahala yang lebih baik dari apa yang mereka kerjakan di dunia."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "7. Ini merupakan janji dan kabar gembira dari Allah bagi orang-orang yang beriman kepada Allah dan rasul-Nya, dan setelah keimanannya dia melakukan amal shalih. Sungguh Kami akan mengampuni kesalahan-kesalahan yang telah mereka lakukan, dan kami akan memberi mereka pahala sebagai balasan atas kebaikan amal mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. وَالَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ الصّٰلِحٰتِ لَنُكَفِّرَنَّ عَنْهُمْ سَيِّـَٔاتِهِمْ (Dan orang-orang yang beriman dan beramal saleh, benar-benar akan Kami hapuskan dari mereka dosa-dosa mereka) Yakni Kami sungguh akan meliputi mereka dengan ampunan, dan menutup sisa-sisa kemurkaan dan azab dari mereka berkat amal shalih yang mereka lakukan. وَلَنَجْزِيَنَّهُمْ أَحْسَنَ الَّذِى كَانُوا۟ يَعْمَلُونَ(dan benar-benar akan Kami beri mereka balasan yang lebih baik dari apa yang mereka kerjakan) Yakni dengan balasan amal mereka yang terbaik. Dan pendapat lain mengatakan maksudnya adalah dengan balasan yang lebih baik dari amalan mereka, sehingga Allah memberi mereka lebih banyak dan lebih baik dari apa yang mereka kerjakan, sebagaimana disebutkan dalam firman-Nya: من جاء بالحسنة فله عشر أمثالها “Barangsiapa membawa amal yang baik, maka baginya (pahala) sepuluh kali lipat amalnya” (Al-An'am:160)"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Dan orang-orang yang beriman kepada Allah dan rasulNya serta melakukan amal shalih yang diperintahkan, maka Kami akan menghapus dosa-dosa yang ikut berkembang bersama mereka dengan menghilangkan hukuman mereka selama mereka tidak bersikeras untuk mengulanginya. Dan sungguh Kami akan membalas mereka dengan sebaik-baik balasan untuk amal shalih mereka dengan 10 kebaikan yang serupa dan bahkan lebih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7. Maksudnya, sesungguhnya orang-orang yang telah di karuniai iman dan amal sholih oleh Allah, niscaya Allah mengampuni dosa-dosa mereka; sebab amal-amal kebajikan itu dapat menghapuskan dosa-dosa, “dan benar-benar akan Kami beri mereka balasan yang lebih baik dari apa yang mereka kerjakan,” yaitu amal-amal kebajikan berupa berbagai kewajiban dan amal-amal ssunnah. Itulah sebaik-baik amal yang dilakukan oleh seorang hamba; sebab dia pun melakukan amal-amal yang mubah dan lainnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Ankabut ayat 7: Allah menjanjikan bagi siapa yang Allah berikan karunia atas mereka dengan keimanan dan amal shalih; Dengan menghapuskan apa yang telah mereka kerjakan dalam keburukan, dan Allah akan balas mereka dengan balasan yang sempurna atas apa yang telah mereka amalkan dari tauhid, ketaatan,menjauhkan dari syirik dan yang haram."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Orang-orang yang dianugerahi Allah iman dan amal saleh, akan Allah hapus kesalahan mereka, karena kebaikan menghapuskan keburukan. Dengan amal salehnya. Yakni amal-amal baik yang mereka kerjakan, yang wajib maupun yang sunat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Ankabut Ayat 7",
    "description": "Dan orang-orang yang beriman kepada Allah dan rasul-Nya dan mengerjakan kebajikan, pasti akan kami hapus kesalahan-kesalahannya dan mereka pasti akan kami beri balasan yang lebih baik dari apa yang me-reka kerjakan. 8. Setelah ayat-ayat yang lalu menguraikan keniscayaan ujian dan cobaan bagi orang-orang yang beriman, berikut ini disebutkan salah satu contoh tersebut, yaitu di saat kedua orang tua yang dicintai memaksa untuk berbuat syirik dan maksiat lainnya. Berbakti kepada orang tua adalah sebuah kewajiban, tetapi ada batas yang tidak boleh dilanggar. Dan kami wajibkan kepada manusia agar berbakti dengan berbuat kebaikan sebanyak-banyaknya kepada kedua orang tuanya dan menaati keduanya. Dan jika keduanya bersungguh-sungguh memaksamu untuk mempersekutukan aku dan atau melakukan kemaksiatan dalam bentuk apa pun, dengan sesuatu yang engkau tidak mempunyai ilmu tentang itu, atau tidak dapat diterima oleh akal sehat, maka janganlah engkau patuhi keduanya, karena ketaatan kepada manusia tidak boleh dalam bentuk maksiat atau durhaka kepada tuhan. Hanya kepada-ku tempat kembalimu pada hari kiamat, dan akan aku beritakan secara rinci kepadamu apa yang telah kamu kerjakan selama di dunia untuk mendapatkan balasan."
  }
]