[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Kami wajibkan kepada manusia untuk berbakti kepada kedua orangtuanya dan berlaku baik kepada mereka berdua dengan tutur kata dan perbuatan. Dan apabila mereka berdua memaksamu (wahai manusia) untuk menyekutukan sesuatu denganKu dalam ibadah, maka janganlah kamu melaksanakan perintah mereka berdua. Dan (permintaan berbuat) seluruh jenis maksiat (dari mereka) dihukumi sama dengan permintaan mereka untuk menyekutukan Allah. Tidak ada kewajiban taat kepada makhluk, siapa pun dia, untuk maksiat kepada Allah, sebagaimana telah disebutkan dalam hadist dari Rasulullah. Kepada-Ku lah tempat kembali kalian pada hari kiamat. Lalu Kami akan beritahukan kepada kalian apa saja yang telah kalian perbuat di dunia, dari perbuatan yang baik maupun perbuatan yang buruk. Dan Aku akan memberikan balasan kepada kalian sesuai dengan perbuatan-perbuatan itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Dan Kami wasiatkan kepada manusia agar berbakti dan berbuat baik kepada kedua orang tuanya. Jika keduanya memaksamu -wahai manusia- untuk menyekutukan-Ku dengan apa yang kamu tidak punya pengetahuan tentangnya -sebagaimana yang terjadi pada Sa'd bin Abi Waqqāṣ -raḍiyallāhu 'anhu- dengan ibunya- maka janganlah engkau menaati mereka berdua dalam perkara itu, karena tidak boleh taat kepada makhluk dalam bermaksiat terhadap Żat Yang Maha Pencipta. Hanya kepada-Ku semata tempat kalian kembali pada hari Kiamat, lalu Aku mengabarkan kepada kalian apa yang pernah kalian lakukan di dunia dan aku membalas untuknya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "8. Allah memerintahkan manusia untuk berbakti kepada kedua orangtua, memperlakukan mereka dengan baik sebagaimana mereka telah mengasuh dan membesarkannya, sebagai balasan dan penghormatan atas kebaikan mereka. Dan saat kamu berbakti kepada mereka bisa jadi mereka akan memaksamu untuk menyekutukan Allah, maka ketika itu janganlah kalian menuruti perintah mereka, namun janganlah kalian memperlakukan mereka dengan buruk karena kesyirikan mereka sebab balasan kesyirikan itu merupakan urusan Allah, Allah akan menyampaikan perbuatan yang telah mereka kerjakan di dunia kemudian akan membalas mereka atas perbuatan itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. وَوَصَّيْنَا الْإِنسٰنَ بِوٰلِدَيْهِ حُسْنًا ۖ (Dan Kami wajibkan manusia (berbuat) kebaikan kepada dua orang ibu-bapaknya) Yakni Kami wasiatkan kepada manusia agar berbuat baik kepada kedua orang tuanya, yaitu dengan perbuatan yang menjadikan keduanya ridha dan menyenangkan hati mereka, berupa kasih sayang dan berbakti kepada keduanya. وَإِن جٰهَدَاكَ لِتُشْرِكَ بِى مَا لَيْسَ لَكَ بِهِۦ عِلْمٌ فَلَا تُطِعْهُمَآ ۚ( Dan jika keduanya memaksamu untuk mempersekutukan Aku dengan sesuatu yang tidak ada pengetahuanmu tentang itu, maka janganlah kamu mengikuti keduanya) Yakni jika kedua orangtuamu meminta dan mengharuskanmu untuk menyekutukan Aku dengan tuhan yang kamu ketahui bahwa itu bukan tuhan, maka janganlah kamu taati mereka dalam hal ini, sebab tidak ada ketaatan bagi makhluk dalam bermaksiat kepada Allah. Termasuk dalam hal ini juga permintaan mereka untuk bermaksiat kepada Allah, maka tidak boleh juga mentaati mereka dalam kemaksiatan. Jika keduanya memerintahkanmu untuk melakukan hal haram maka langgarlah perintah mereka dan taatilah Allah; namun jangan kamu jadikan perintah mereka itu sebagai penghalangmu untuk berbuat baik kepada keduanya. فَأُنَبِّئُكُم بِمَا كُنتُمْ تَعْمَلُونَ (lalu Aku kabarkan kepadamu apa yang telah kamu kerjakan) Yakni Aku akan beritahu kalian amal kebaikan dan keburukan kalian, kemudian Aku akan membalas kedua jenis amal itu sesuai keharusannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8. Kami perintahkan manusia untuk baik kepada kedua orang tuanya dengan menaati, berbuat baik, dan mengasihinya. Jika keduanya (orang tua) mencoba membawa anaknya kepada kesyirikandan menghendaki anaknya terhadap hal itu (kesyirikan) dimana dia (orang tua) tidak memiliki bukti keilmuan atas keberadaan Tuhan, maka janganlah kamu menaati keduanya dalam hal itu karena seorang makhluk tidak boleh taat dalam melakukan kemaksiatan kepada Penciptanya. Perbuatan maksiat yang sisertai dengan kesyirikan itu tidak boleh ditaati. Hanya kepadaKulah tempat kembali kalian semua pada hari kiamat. Maka Aku memberitahu kalian tentang apa yang kalian perbuat dan membalas kalian atas perbuatan itu. Ungkapan menggunakan kata {Husnan} itu untuk menunjukkan kebaikan yang sangat agung, sehingga seakan-akan dirinya adalah kebaikan itu sendiri. Ayat ini diturunkan saat Ibu Sa’ad bin Abi Waqash mengetahui keimanan anaknya, lalu dia bersumpah untuk tidak makan dan tidak minum sampai mati atau anaknya kembali kafir, kemudian turunlah ayat ini."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8. Maksudnya, Kami telah memerintahkan dan memesankan kepada manusia untuk berbuat baik (ihsan) kepada kedua ibu-bapaknya. Yaitu dengan cara berbakti dan berbuat baik kepada mereka berdua dalam bentuk perkataan dan perbuatan, dan hendaklah selalu menjaga hal itu dan tidak mendurhakai dan berbuat buruk terhadap keduanya, baik dengan perkataan ataupun perbuatan. “Dan jika keduanya memaksamu” untuk mempersekutukan , “Aku dengan sesuatu yang tidak ada pengetahuan tentang hal itu,” dan tidak ada seorang pun yang mempunyai pengetahuan tentang kebenaran syirik kepada Allah. Ini menjelaskan betapa sangat seriusnya masalah syirik, “maka janganlah kamu mengikuti keduanya. Hanya kepadaKu-lah kembalimu, lalu Aku kabarkan kepadamu apa yang telah kamu kerjakan,” lalu Aku akan memberikan pembalasan terhadap kalian. Maka dari itu berbuat baiklah kepada kedua orang tua kalian, dan dahulukanlah ketaatan kepada mereka berdua (daripada ketaatan kepada selainnya) kecuali ketaatan kepada Allah dan RasulNya. Sebab, ketaatan kepada Allah dan RasulNya harus lebih didahulukan atas segala sesuatu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Ankabut ayat 8: Allah mewasiatkan manusia untuk berbuat kebaikan kepada kedua orang tuanya dalam ucapan dan amalan. Dan jika keduanya memaksamu untuk menyekutukan Allah, maka tidak ada kewajiban taat kepada keduanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Imam Muslim meriwayatkan dengan sanadnya yang sampai kepada Mush’ab bin Sa’ad dari bapaknya (Sa’ad bin Abi Waqqas), bahwa terhadap dirinya turun beberapa ayat Al Qur’an, ia bercerita, “Ibu Sa’ad pernah bersumpah untuk tidak akan berbicara dengan Sa’ad sampai Sa’ad mau kafir kepada agamanya, dan ia berjanji akan mogok makan dan minum. Ibunya berkata, “Engkau mengatakan, bahwa Allah mewajibkan kamu berbuat baik kepada orang tuamu, aku ibumu, sekarang memerintahkan kamu berbuat itu (kafir kepada agama Islam).” Sa’ad berkata, “Ibuku berdiam diri (tidak makan dan minum) selama tiga hari sehingga ia merasakan kepayahan yang sangat, lalu anaknya yang bernama ‘Amarah memberinya minum, kemudian ibunya memanggil Sa’ad, maka Allah ‘Azza wa Jalla menurunkan dalam Al Qur’an ayat ini, “Dan Kami wajibkan manusia (berbuat) kebaikan kepada dua orang tuanya. Dan jika keduanya memaksamu untuk mempersekutukan Aku…dst.” (terj. Al ‘Ankabut: 8). Di sana pun terdapat ayat, “Dan pergaulilah keduanya di dunia dengan baik.” (Terj. Lukman: 15). Sa’ad juga bercerita, “Rasulullah shallallahu 'alaihi wa sallam memperoleh ghanimah yang besar, di antaranya terdapat sebuah pedang, maka aku mengambilnya dan membawa kepada Rasulullah shallallahu 'alaihi wa sallam, aku pun berkata, “Berikanlah kepadaku pedang ini. Aku adalah seorang yang telah engkau ketahui keadaannya (yakni pandai memainkan pedang).” Maka Beliau bersabda, “Kembalikanlah ke tempat kamu mengambil.” Lalu aku pergi, sehingga ketika aku hendak menaruhnya ke tempat barang rampasan (yang belum dibagi), maka aku mencela diriku sendiri, lalu aku kembali kepada Beliau dan berkata, “Berikanlah ia untukku.” Maka Beliau mengeraskan suaranya, “Kembalikanlah ia ke tempat kamu mengambil.” Maka Allah menurunkan ayat, “Yas’aluunaka ‘anil anfaal (Mereka bertanya kepadamu tentang harta rampasan perang).” (Al Anfaal: 1). Sa’ad bercerita pula, “Aku pernah sakit, lalu aku kirim seseorang kepada Nabi shallallahu 'alaihi wa sallam, maka Beliau datang kepadaku, lalu aku berkata, “Biarkanlah aku membagi hartaku sesuai yang aku kehendaki.” Ternyata Beliau menolak.” Aku berkata, “Bagaimana jika separuhnya (yakni aku wasiatkan).” Beliau ternyata menolak, maka aku berkata, “Bagaimana jika sepertiga?” Maka Beliau diam, oleh karenanya jika sepertiga ternyata dibolehkan. Sa’ad juga bercerita, “Aku pernah mendatangi sekumpulan kaum Anshar dan Muhajirin, mereka berkata, “Kemarilah, agar kami memberimu makan dan memberimu minuman khamr.” Hal itu sebelum khamr diharamkan. Sa’ad juga bercerita, “Lalu aku mendatangi mereka dalam sebuah kebun, ternyata ada kepala hewan sembelihan yang dipanggang di dekat mereka dan sebuah geriba (tempat minum dari kulit) yang berisi khamr, maka aku makan dan minum bersama mereka, kemudian dibicarakanlah tentang kaum Muhajirin dan Anshar, aku berkata, “Kaum Muhajirin lebih baik daripada Anshar,” Lalu salah seorang mengambil salah satu rahang kepala (hewan itu) kemudian memukulku dengannya sehingga hidungku terluka, maka aku datang kepada Rasulullah shallallahu 'alaihi wa sallam dan memberitahukan hal itu, maka Allah ‘Azza wa Jalla menurunkan ayat berkenaan dengan khamr, “Sesungguhnya (meminum) khamar, berjudi, (berkorban untuk) berhala, mengundi nasib dengan anak panah adalah termasuk perbuatan syaitan…dst.” (Terj. Al Maa’idah: 90). Baik dengan ucapan maupun dengan perbuatan. Dan tidak ada seorang yang memiliki ilmu bahwa syirk itu benar. Hal ini untuk membesarkan masalah syirk. Yakni kemudian akan Aku beri balasan amalmu. Oleh karena itu, berbaktilah kepada kedua orang tuamu dan dahulukanlah ketaatan kepada keduanya, namun tetap di atas ketaatan kepada Allah dan rasul-Nya, karena ia harus didahulukan di atas segalanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Ankabut Ayat 8",
    "description": "Setelah ayat-ayat yang lalu menguraikan keniscayaan ujian dan cobaan bagi orang-orang yang beriman, berikut ini disebutkan salah satu contoh tersebut, yaitu di saat kedua orang tua yang dicintai memaksa untuk berbuat syirik dan maksiat lainnya. Berbakti kepada orang tua adalah sebuah kewajiban, tetapi ada batas yang tidak boleh dilanggar. Dan kami wajibkan kepada manusia agar berbakti dengan berbuat kebaikan sebanyak-banyaknya kepada kedua orang tuanya dan menaati keduanya. Dan jika keduanya bersungguh-sungguh memaksamu untuk mempersekutukan aku dan atau melakukan kemaksiatan dalam bentuk apa pun, dengan sesuatu yang engkau tidak mempunyai ilmu tentang itu, atau tidak dapat diterima oleh akal sehat, maka janganlah engkau patuhi keduanya, karena ketaatan kepada manusia tidak boleh dalam bentuk maksiat atau durhaka kepada tuhan. Hanya kepada-ku tempat kembalimu pada hari kiamat, dan akan aku beritakan secara rinci kepadamu apa yang telah kamu kerjakan selama di dunia untuk mendapatkan balasan. 9. Dan orang-orang yang beriman dan membuktikan keimanannya itu dengan mengerjakan kebajikan mereka pasti akan kami masukkan mereka ke dalam golongan orang yang saleh yang akan mendapatkan kenikmatan di surga."
  }
]