[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang yang beriman kepada Allah dan RasulNya, serta mengerjakan amal-amal shalih, niscaya Kami benar-benar akan memasukannya ke dalam surga golongan hamba-hamba Allah yang shalih."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Dan orang-orang yang beriman kepada Allah serta melakukan amal saleh niscaya, Kami masukkan mereka ke dalam golongan orang-orang saleh pada hari Kiamat, lalu Kami kumpulkan mereka bersama orang-orang saleh dan Kami balas pahala mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "9. Sesungguhnya orang-orang yang beriman kepada Allah dan rasul-Nya, dan mengerjakan amalan-amalan yang sesuai dengan petunjuk-Nya, maka -dengan keagungan Kami- sungguh Kami akan menjadikan mereka termasuk orang-orang yang shalih."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. لَنُدْخِلَنَّهُمْ فِى الصّٰلِحِينَ (benar-benar akan Kami masukkan mereka ke dalam (golongan) orang-orang yang saleh) Yakni termasuk golongan orang-orang yang teguh dalam kebaikan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9. Dan orang-orang yang beriman kepada Allah dan rasulNya serta mengerjakan amal shalih yang diperintahkan, maka sungguh Kami akan menjadikannya dan mengumpulkannya dalam golongan hamba-hamba yang shalih di surga, yaitu para nabi dan para wali"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9. Maksudnya, barangsiapa yang beriman kepada Allah dan melakukan amal shalih, maka sesungguhnya Allah telah menjanjikan kepadanya untuk memasukannya ke surge bersama kelompok hamba-hamba Allah yang shalih dari kalangan para nabi, shiddiqin, syuhada dan orang-orang shalih. Masing-masing (mendapatkan balasan) menurut derajat dan martabatnya di sisi Allah. Jadi, iman yang shahih dan amal yang shalih adalah tanda bukti (yang menunjukkan) kebahagiaan pelakunya, dan dia adalah termasuk keluarga (kekasih) Allah dan kaum shalih dari hamba-hamba Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-‘Ankabut ayat 9: Allah mengabarkan bahwa mereka yang Allah berikan keimanan kepada mereka dan amalan shalih; Mereka akan Allah masukkan ke dalam surga karena sebab menjadi hamba Allah yang shalih."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya, orang yang beriman kepada Allah dan beramal saleh, maka Allah berjanji akan memasukkannya ke surga tergolong ke dalam golongan orang-orang saleh, yaitu para nabi, para shiddiqin, para syuhada’ dan orang-orang saleh, masing-masing tergantung derajat dan kedudukannya di sisi Allah. Oleh karena itu, iman dan amal saleh adalah tanda kebahagiaan seorang hamba."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-‘Ankabut Ayat 9",
    "description": "Dan orang-orang yang beriman dan membuktikan keimanannya itu dengan mengerjakan kebajikan mereka pasti akan kami masukkan mereka ke dalam golongan orang yang saleh yang akan mendapatkan kenikmatan di surga. 10. Ayat-ayat yang lalu menyimpulkan bahwa ada orang yang beriman kepada Allah yang diuji dan disakiti oleh kaum musyrikin namun mereka tabah dalam keimanan, dan di antara manusia ada pula sebagian yang berkata dengan lidahnya tanpa menyentuh secara mantap hatinya, 'kami beriman kepada Allah, ' tetapi apabila dia disakiti dengan ditimpa cobaan karena dia beriman kepada Allah, hatinya goyah dan takut kepada siksa yang akan menimpanya dari kaum musyrikin. Dia menganggap cobaan berupa siksaan dan gangguan dari manusia itu sebagai siksaan Allah, dan tidak sabar menghadapinya. Orang itu takut kepada kezaliman manusia, seperti ketakutannya kepada azab Allah, karena itu dia tinggalkan imannya itu. Dan jika datang pertolongan dari tuhanmu berupa kemenangan kepada orang-orang mukmin atas musuh-Musuh mereka, dan mereka mendapatkan harta rampasan, niscaya datang-lah mereka, yaitu orang orang yang berpura-pura beriman itu kepada orang-orang muslim dan akan berkata, 'sesungguhnya kami bersama kamu dalam keimanan, maka berilah kami bagian dari harta rampasan itu. ' tidak sepantasnya mereka menyangka bahwa keadaan mereka ini tidak diketahui Allah. Bukankah Allah lebih mengetahui apa yang ada di dalam dada semua manusia, baik yang berupa keimanan maupun kemunafikan'."
  }
]