[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang kafir dari kalangan Yahudi, Nashrani dan kaum musyrikin tidak akan meninggalkan kekafiran mereka hingga kamu datang kepada mereka dengan tanda yang dijanjikan kepada mereka pada kitab-kitab terdahulu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Orang-orang yang kafir dari golongan Yahudi dan Nasrani serta orang-orang musyrik tidak mungkin meninggalkan ijmak dan kesepakatan mereka dalam kekufuran hingga datang kepada mereka keterangan yang jelas dan hujah yang nyata."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1. Para ahli kitab -yaitu orang-orang Yahudi dan Nasrani- dan para penyembah berhala tidak akan meninggalkan kepercayaan sesat dan menyelisihi tauhid, hingga datang kepada mereka penjelasan tentang kebenaran. Dahulu mereka menunggu pengutusan Nabi dan berkata: Kami tidak akan meninggalkan agama kami hingga diutusnya Nabi yang dijanjikan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. لَمْ يَكُنِ الَّذِينَ كَفَرُوا۟ مِنْ أَهْلِ الْكِتٰبِ (Orang-orang kafir yakni ahli Kitab) Yakni orang-orang Yahudi dan Nasrani. وَالْمُشْرِكِينَ (dan orang-orang musyrik) Yakni orang-orang musyrik Arab yang merupakan para penyembah berhala. مُنفَكِّينَ(tidak akan meninggalkan (agamanya)) Yakni tidak meninggalkan dan berhenti dari kekafiran mereka. حَتَّىٰ تَأْتِيَهُمُ الْبَيِّنَةُ (sebelum datang kepada mereka bukti yang nyata) Maksud (البينة) yakni Nabi Muhammad dan risalah yang didatangkannya. Beliau telah menjelaskan kepada mereka kesesatan dan kejahilan mereka, dan telah menyeru mereka untuk beriman."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Keutamaan surah: Imam Ahmad, Imam Bukhari, Imam Muslim, Tirmidzi dan An-Nasa’I mengatakan dari Anas bin Malik, Rasulallah SAW bersabda kepada Ubay bin Ka’b: “Sesungguhnya Allah memerintahkanku untuk membacakan ayat ini kepadamu {lam yakunilladziina kafaruu min ahlil kitaab} [QS Al-Bayyinah 98/1]” lalu dia bertanya: ”Apakah Allah menyebut namaku kepadamu?” kemudian Rasul menjawab: ”Benar” maka menangislah Ubay. 1-2. Tidaklah orang-orang kafir dari ahli kitab yang terdiri dari kaum Yahudi, Nasrani, Shabi’ dan orang-orang musyrik, yaitu penyembah berhala-berhala itu, akan berhenti dari kekafiran mereka. Mereka adalah orang-orang yang ditinggalkan tanpa bimbingan menuju kebenaran sampai datang kepada mereka dalil nyata yang menjelaskan tentang kebenaran, yaitu Al-Qur’an atau Rasulallah Muhammad SAW. Maknanya adalah bahwa kami tidak meninggalkan mereka kecuali penjelasan dalil itu telah sampai kepada mereka untuk mencegah mereka yang hendak tidak mempercayai hari kiamat. Dan huruf {min} pada firmanNya {min ahli} adalah sebagai penjelas"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang kafir dari golongan Ahlul kitab} orang-orang Yahudi dan Nasrani {dan orang-orang musyrik tidak akan meninggalkan} tidak akan berhenti dari kekufuran mereka {sampai datang kepada mereka bukti yang nyata} dalil yang jelas"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1. Allah berfirman, “Orang-orang kafir dari ahli kitab,” yakni dari kalangan Yahudi dan Nasrani, “dan orang-orang musyrik,” dari segenap umat, “tidak akan meninggalkan” kekufuran dan kesesatan mereka. Artinya, mereka senantiasa berada dalam kesesatan. Tidaklah waktu berlalu melainkan mereka semakin kufur, “sebelum datang kepada mereka bukti yang nyata,” yakni bukti yang jelas."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Sesungguhnya orang-orang kafir dari kalangan yahudi dan nasrani; karena ahli kitab juga ada dari mukminin, sebagaimana yang Allah firmankan dalam Al-Qur’an : { لَيْسُوا سَوَاءً ۗ مِنْ أَهْلِ الْكِتَابِ أُمَّةٌ قَائِمَةٌ يَتْلُونَ آيَاتِ اللَّهِ آنَاءَ اللَّيْلِ وَهُمْ يَسْجُدُونَ , يُؤْمِنُونَ بِاللَّهِ وَالْيَوْمِ الْآخِرِ وَيَأْمُرُونَ بِالْمَعْرُوفِ وَيَنْهَوْنَ عَنِ الْمُنْكَرِ وَيُسَارِعُونَ فِي الْخَيْرَاتِ وَأُولَٰئِكَ مِنَ الصَّالِحِينَ } ( Mereka itu tidak sama; di antara Ahli Kitab itu ada golongan yang berlaku lurus, mereka membaca ayat-ayat Allah pada beberapa waktu di malam hari, sedang mereka juga bersujud (sembahyang) , Mereka beriman kepada Allah dan hari penghabisan, mereka menyuruh kepada yang ma’ruf, dan mencegah dari yang munkar dan bersegera kepada (mengerjakan) pelbagai kebajikan; mereka itu termasuk orang-orang yang saleh ) [ Ali Imran : 113-114 ] , dan Allah -عز وجل- juga berfirman : { وَإِنَّ مِنْ أَهْلِ الْكِتَابِ لَمَنْ يُؤْمِنُ بِاللَّهِ وَمَا أُنْزِلَ إِلَيْكُمْ وَمَا أُنْزِلَ إِلَيْهِمْ خَاشِعِينَ لِلَّهِ لَا يَشْتَرُونَ بِآيَاتِ اللَّهِ ثَمَنًا قَلِيلًا ۗ أُولَٰئِكَ لَهُمْ أَجْرُهُمْ عِنْدَ رَبِّهِمْ ۗ إِنَّ اللَّهَ سَرِيعُ الْحِسَابِ } ( Dan sesungguhnya diantara ahli kitab ada orang yang beriman kepada Allah dan kepada apa yang diturunkan kepada kamu dan yang diturunkan kepada mereka sedang mereka berendah hati kepada Allah dan mereka tidak menukarkan ayat-ayat Allah dengan harga yang sedikit. Mereka memperoleh pahala di sisi Tuhannya. Sesungguhnya Allah amat cepat perhitungan-Nya ) [ Ali Imran 199 ] , selain mereka beriman kepada Rasul-rasul yang telah lalu mereka juga beriman kepada Muhammad, maka Allah menetapkan untuk mereka dua ganjaran atas keimanan mereka, Allah -عز وجل- berfirman : { يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَآمِنُوا بِرَسُولِهِ يُؤْتِكُمْ كِفْلَيْنِ مِنْ رَحْمَتِهِ وَيَجْعَلْ لَكُمْ نُورًا تَمْشُونَ بِهِ وَيَغْفِرْ لَكُمْ ۚ وَاللَّهُ غَفُورٌ رَحِيمٌ } ( Hai orang-orang yang beriman (kepada para rasul), bertakwalah kepada Allah dan berimanlah kepada Rasul-Nya, niscaya Allah memberikan rahmat-Nya kepadamu dua bagian, dan menjadikan untukmu cahaya yang dengan cahaya itu kamu dapat berjalan dan Dia mengampuni kamu. Dan Allah Maha Pengampun lagi Maha Penyayang ) [ Al-Hadid : 28 ] , Allah juga berfirman : { أُولَٰئِكَ يُؤْتَوْنَ أَجْرَهُمْ مَرَّتَيْنِ بِمَا صَبَرُوا وَيَدْرَءُونَ بِالْحَسَنَةِ السَّيِّئَةَ وَمِمَّا رَزَقْنَاهُمْ يُنْفِقُونَ } ( Mereka itu diberi pahala dua kali disebabkan kesabaran mereka, dan mereka menolak kejahatan dengan kebaikan, dan sebagian dari apa yang telah Kami rezekikan kepada mereka, mereka nafkahkan ) [ Al-Qashash : 54 ] , yakni para ahli kitab yang beriman kepada Nabi Muhammad akan diberikan oleh Allah -عز وجل- ganjaran dua kali lipat, ganjaran atas keimanan mereka kepada Rasul-rasul sebelum Muhammad, dan ganjaran atas keimanan mereka kepada Rasulullah Muhammad ﷺ , maka barangsiapa yang kafir kepada Muhammad sungguh ia telah kafir kepada para Rasul-rasul sebelumnya, karena sesungguhnya barangsiapa yang kafir kepada satu Raasul pun ataun satu Nabi, maka ia telah kafir kepada Nabi dan Rasul seluruhnya, Allah -عز وجل- berfirman : { لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ } ( “Kami tidak membeda-bedakan antara seseorangpun (dengan yang lain) dari rasul-rasul-Nya” ) [ Al-Baqarah : 285 ] . { وَالْمُشْرِكِينَ } yaitu orang-orang yang tidak bersandar kepada kitab apapun, dan mereka adalah penyembah berhala dan selain mereka dari kelompok atheis. { مُنْفَكِّينَ } yakni mereka tidak akan berhenti dari kebathilan yang mereka jalani saat ini, dan setiap mereka merasa bahwa mereka telah berada diatas kebenaran. { حَتَّىٰ تَأْتِيَهُمُ الْبَيِّنَةُ } Sampai datang kepada mereka bukti dan dalil yang menjelaskan kerusakan dan kesalahan dari kebenaran yaitu Al-Qur'an yang dimuliakan."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Allah 'Azza Wa Jalla berfirman: لَمْ يَكُنِ الَّذِينَ كَفَرُوا مِنْ أَهْلِ الْكِتَابِ وَالْمُشْرِكِينَ مُنْفَكِّينَ حَتَّى تَأْتِيَهُمُ الْبَيِّنَةُ \" Orang-orang kafir yakni ahli kitab dan orang-orang musyrik (mengatakan bahwa mereka) tidak akan meninggalkan (agamanya) sebelum datang kepada mereka bukti yang nyata,\" Maksudnya: Siapa saja orang-orang kafir dari kalangan مِنْ أَهْلِ الْكِتَابِ ahlulkitab, baik yahudi dan nasrani. Mereka dinamakan dengan sebutan ahlulkitab, karena lembaran-lembaran kitab suci mereka masih ada hingga diutusnya Nabi shallallaahu 'alaihi wa sallam walau pun di dalamnya sudah dirubah dan diselewengkan, tetapi mereka tetaplah ahlulkitab. Orang yahudi mereka memiliki taurat, dan nasrani mereka memiliki injil وَالْمُشْرِكِينَ orang-orang musyrik mereka adalah orang-orang yang menyembah patung dengan beragam bentuknya, dari kalangan bani israil mau pun selain mereka. mereka tidaklah مُنْفَكِّينَ Maknanya: meninggalkan apa-apa yang mereka anut berupa kesyirikan dan kekufuran, mereka senantiasa dalam agamanya, حَتَّى تَأْتِيَهُمُ الْبَيِّنَةُ \" sampai datang kepada mereka bukti yang nyata,\" Dan bayinah (bukti) adalah yang menjelaskan kebenaran pada segala sesuatu, maka sgala sesuatu yang dengannya kebenaran menjadi jelas maka disebut dengan bayinah, oleh karenaya Nabi 'alaihissholaatu wassalaam bersabda: اَلْبَيِّنَةُ عَلَى الْمُدَّعِي \"Bukti wajib didatangkan oleh orang yang mengaku (mengklaim)\"(1). Segala yang menjelaskan kebenaran maka itulah bukti, dan ini bisa pada segala sesuai sesuai kadarnya, maka apakah maksud bukti yang Allah sebutkan di sini? (1) Dikeluarkan Tirmidziy (1341) dari hadits Abdullah Bin Amer radhiyallaahu 'anhuma, dinyatakan shahih oleh Al-Albaniy dalam shahih al-Jami' (2897)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Bayyinah ayat 1: 1-2. Dimulainya surat ini dengan penjelasan mereka yang kufur kepada Allah dan Rasul-Nya ﷺ, dari Yahudi dan Nashoro dan orang-orang musyrik yang mengibadahi benda-benda mati dan patung-patung, yang kekufuran dan kesesatannya masih terus berlanjut sampai mereka mendapatkan penjelasan yang benar, yang diberikan kepadanya dengan tanda-tanda dan argumentasi yang terang (jelas) dimana mereka telah dijanjikan di dalam kitab-kitab samawiyyah yang mendahului (Al Qur’an). Kemudian Allah menjelaskan bahwa tanda-tanda yang mereka dijanjikan dengannya ada (diutusnya) Muhammad ﷺ, yang ia membacakan pada mereka Al Qur’an yang bersih dari kebathilan dan yang menunjuki dan mengoreksi mereka, dalam kehidupan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu orang-orang Yahudi dan Nasrani. Yakni hujjah yang nyata, yaitu Nabi Muhammad shallallahu 'alaihi wa sallam sebagaimana diterangkan dalam ayat setelahnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Bayyinah Ayat 1",
    "description": "Orang-orang yang kafir dari golongan ahli kitab, yaitu yahudi dan nasrani, dan orang-orang musyrik penyembah berhala tidak akan meninggalkan kekafiran mereka sampai datang kepada mereka bukti yang nyata. 2. Bukti yang nyata itu adalah nabi Muhammad, seorang rasul dari Allah yang membacakan kepada mereka lembaran-lembaran yang suci. Itulah al-quran yang disucikan dari kebohongan dan kebatilan."
  }
]