[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Yaitu Rasul Allah, Muhammad sholallohu alaihi wasallam yang membacakan al-qur’an dalam shuhuf-shuhuf(lembaran-lembaran) yang disucikan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Keterangan yang jelas dan hujah yang nyata itu adalah Rasul dari sisi Allah yang diutus-Nya dengan membacakan lembaran-lembaran yang disucikan, yang tidak disentuh kecuali oleh orang-orang yang disucikan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "2-3. Penjelasan yang dimaksud adalah pengutusan Nabi Muhammad, yang membacakan suhuf-suhuf yang bersih dari kebatilan dan akhlak tercela. Dalam suhuf-suhuf ini terdapat hukum-hukum lurus yang Allah turunkan, yang mengandung ketauhidan dan akhlak-akhlak terpuji."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. رَسُولٌ مِّنَ اللَّـهِ (yaitu) seorang Rasul dari Allah) Yakni Muhammad. يَتْلُوا۟ صُحُفًا مُّطَهَّرَةً (yang membacakan lembaran-lembaran yang disucikan (Al Quran)) Yakni terlindung dari perubahan dan syubhat, dan ia benar-benar firman Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "1-2. Tidaklah orang-orang kafir dari ahli kitab yang terdiri dari kaum Yahudi, Nasrani, Shabi’ dan orang-orang musyrik, yaitu penyembah berhala-berhala itu, akan berhenti dari kekafiran mereka. Mereka adalah orang-orang yang ditinggalkan tanpa bimbingan menuju kebenaran sampai datang kepada mereka dalil nyata yang menjelaskan tentang kebenaran, yaitu Al-Qur’an atau Rasulallah Muhammad SAW. Maknanya adalah bahwa kami tidak meninggalkan mereka kecuali penjelasan dalil itu telah sampai kepada mereka untuk mencegah mereka yang hendak tidak mempercayai hari kiamat. Dan huruf {min} pada firmanNya {min ahli} adalah sebagai penjelas."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{(yaitu) seorang Rasul dari Allah yang membacakan} yang membacakan {lembaran-lembaran yang suci} yang bersih dari hal-hal bathil"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2-3. Kemudian Allah menjelaskan bukti nyata tersebut seraya berfirman, “(yaitu) seorang Rasul dari Allah,” yakni yang diutus oleh Allah untuk menyeru manusia kepada kebenaran dan menurunkan padanya kitab yang ia baca agar mengajarkan hikmah kepada manusia, menyucikan mereka, dan mengeluarkan mereka dari kegelapan menuju cahaya. Karena itu Allah berfirman, “Yang membacakan lembaran yang disucikan (al-Quran),” yakni yang terjaga dari pendekatan setan. Hanya mereka yang suci yang menyentuhnya, karena al-Quran adalah kalam (Firman) yang paling tinggi. Karena itu Allah berfirman tentang lembaran-lembaran itu, “Di dalamnya,” yakni di dalam lembaran-lembaran tersebut, “terdapat (isi) Kitab-kitab yang lurus,” yakni berita-berita benar, perintah-perintah adil yang menunjukkan kepada kebenaran dan menuju jalan yang lurus. Bila bukti nyata ini datang pada mereka, maka ketika itu jelaslah antara orang yang mencari kebenaran dan orang yang tidak memiliki kehendak untuk mencarinya. Setelah itu orang yang binasa akan binasa setelah adanya bukti nyata dan orang yang hidup juga akan hidup setelah ada bukti nyata."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Yakni Muhammad ﷺ yang membacakan lembaran-lembaran wahyu yang suci yaitu Al-Qur’an."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "اَلْبَيِّنَةُ Bukti ini, Allah berfirman: رَسُولٌ مِنَ اللَّهِ \"(yaitu) seorang Rasul dari Allah \" rasul yang disebutkan di sini adalah Nabi Muhammad shallallaahu 'alaihi wa sallam Bin Abdullah al-Hasyimiy al-Qurasyiy shalawatullaahi wasalaamuhu 'alaihi, disebutkan dalam bentuk nakirah رَسُوْلٌ [Rasulun] sebagai pemuliaan kepadanya, karena beliau semestinya dimuliakan dengan pemuliaan yang layak, tanpa kurang atau pun berlebihan رَسُولٌ مِنَ اللَّهِ \"(yaitu) seorang Rasul dari Allah \" Maksudnya: Bahwa Allah mengutusnya kepada alam semesta sebagai pembawa kabar gembira dan peringatan, Allah Tabaraka waTa'alla berfirman: وَأَرْسَلْنَاكَ لِلنَّاسِ رَسُولًا \"Dan Kami utus engkau kepada manusia sebagai rasul\"(QS. An-Nisa: 79) dan Allah berfirman: تَبَارَكَ الَّذِي نَزَّلَ الْفُرْقَانَ عَلَى عَبْدِهِ لِيَكُونَ لِلْعَالَمِينَ نَذِيرًا \" Maha Suci Allah yang telah menurunkan Al-Furqaan (Al Qur'an) kepada hamba-Nya, agar dia menjadi pemberi peringatan kepada seluruh alam,\"(QS. Al-Furqan: 1) belaiu adalah Muhammad 'alaihissholaatu wassalaam yang diutus dari sisi Allah dengan perantara Jibril, 'alaihissholaatu wassalaam, karena Jibril dia lah utusan Rabb semesta alam kepada para rasul-Nya, ditugaskan menyampaikan wahyu, diturunkan kepada siapa saja yang Allah kehendaki dari hamba-hamba-Nya. يَتْلُو صُحُفًا مُطَهَّرَةً \" yang membacakan lembaran-lembaran yang disucikan \" Maksudnya: membacakan untuk dirinya dan untuk orang-orang صُحُفًا Bentuk jamak dari صَحِيْفَة [shahifah], yaitu: Kertas, lembaran atau yang serupa dengannya yang dijadikan tempat menulis مُطَهَّرَةً Maksudnya: Dibersihkan dari kesyirikan, dan dari kerendahan-kerendahan akhlaq (yang buruk) dan dari segala yang buruk, karena lembaran-lembaran tersebut bersih dan suci."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Bayyinah ayat 2: 1-2. Dimulainya surat ini dengan penjelasan mereka yang kufur kepada Allah dan Rasul-Nya ﷺ, dari Yahudi dan Nashoro dan orang-orang musyrik yang mengibadahi benda-benda mati dan patung-patung, yang kekufuran dan kesesatannya masih terus berlanjut sampai mereka mendapatkan penjelasan yang benar, yang diberikan kepadanya dengan tanda-tanda dan argumentasi yang terang (jelas) dimana mereka telah dijanjikan di dalam kitab-kitab samawiyyah yang mendahului (Al Qur’an). Kemudian Allah menjelaskan bahwa tanda-tanda yang mereka dijanjikan dengannya ada (diutusnya) Muhammad ﷺ, yang ia membacakan pada mereka Al Qur’an yang bersih dari kebathilan dan yang menunjuki dan mengoreksi mereka, dalam kehidupan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala mengutus Beliau untuk mengajak manusia kepada kebenaran; Dia menurunkan kepadanya kitab, agar Beliau mengajarkan kepada manusia kitab itu dan hikmah (As Sunnah) serta membersihkan mereka, dan mengeluarkan mereka dari kegelapan kepada cahaya. Yakni terjaga dari didekati oleh setan-setan dan tidak disentuh kecuali oleh makhluk yang disucikan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Bayyinah Ayat 2",
    "description": "Bukti yang nyata itu adalah nabi Muhammad, seorang rasul dari Allah yang membacakan kepada mereka lembaran-lembaran yang suci. Itulah al-quran yang disucikan dari kebohongan dan kebatilan. 3. Lembaran-lembaran suci itu di dalamnya terdapat kitab-kitab, yakni hukum-hukum tertulis, yang lurus. Al-qur'an berisi akidah, hukum, kisah, dan aturan yang menuntun umat manusia ke jalan yang benar dan lurus."
  }
]