[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Pada shuhuf-shuhuf tersebut ada berita-berita yang benar dan perintah-perintah yang adil, yang membimbing kepada kebenaran dan kepada jalan yang lurus."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Di dalam lembaran-lembaran itu terdapat berita-berita yang benar dan hukum-hukum yang adil, menunjuki manusia kepada kebaikan dan kedewasaan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. فِيهَا كُتُبٌ قَيِّمَةٌ (di dalamnya terdapat (isi) Kitab-kitab yang lurus) Maksudnya adalah ayat-ayat dan hukum-hukum yang tertulis di dalamnya. Makna (القيمة) yakni lurus dan sama sekali tidak berbelok dari kebenaran; bahkan seluruh isinya adalah kebaikan, petunjuk, dan hikmah, sebagaimana firman Allah: الحمد لله الذي أنزل على عبده الكتاب ولم يجعل له عوجا قيما لينذر.... “Segala puji bagi Allah yang telah menurunkan kepada hamba-Nya Al Kitab (Al-Quran) dan Dia tidak mengadakan kebengkokan di dalamnya; sebagai bimbingan yang lurus, untuk memperingatkan…” (al-Kahfi: 1-2) Dan barangsiapa yang mengikutinya maka ia telah berada di jalan Allah yang lurus."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Dalam shuhuf-shuhuf itu terdapat ayat-ayat tertulis dan hukum-hukum syari’at yang lurus dan penuh hikmah yang tidak ada penyimpangan di dalamnya, melainkan kebaikan dan bimbingan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{di dalamnya terdapat kitab-kitab yang lurus} berita-berita yang benar, dan hukum-hukum yang adil"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2-3. Kemudian Allah menjelaskan bukti nyata tersebut seraya berfirman, “(yaitu) seorang Rasul dari Allah,” yakni yang diutus oleh Allah untuk menyeru manusia kepada kebenaran dan menurunkan padanya kitab yang ia baca agar mengajarkan hikmah kepada manusia, menyucikan mereka, dan mengeluarkan mereka dari kegelapan menuju cahaya. Karena itu Allah berfirman, “Yang membacakan lembaran yang disucikan (al-Quran),” yakni yang terjaga dari pendekatan setan. Hanya mereka yang suci yang menyentuhnya, karena al-Quran adalah kalam (Firman) yang paling tinggi. Karena itu Allah berfirman tentang lembaran-lembaran itu, “Di dalamnya,” yakni di dalam lembaran-lembaran tersebut, “terdapat (isi) Kitab-kitab yang lurus,” yakni berita-berita benar, perintah-perintah adil yang menunjukkan kepada kebenaran dan menuju jalan yang lurus. Bila bukti nyata ini datang pada mereka, maka ketika itu jelaslah antara orang yang mencari kebenaran dan orang yang tidak memiliki kehendak untuk mencarinya. Setelah itu orang yang binasa akan binasa setelah adanya bukti nyata dan orang yang hidup juga akan hidup setelah ada bukti nyata."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Diantara lembaran-lembaran itu ada kitab-kitab suci yang diturunkan kepada Rasul-rasul sebelum Muhammad dan Al-Qur’an yang diturunkan kepadanya yang tertulis didalamnya kebenaran dan hukum-hukum yang adil, yang membimbing manusia kepada kebaikkan, dan suci dari gangguan syaithon, Allah berfirman : { لَا يَمَسُّهُ إِلَّا الْمُطَهَّرُونَ } ( Tidak menyentuhnya kecuali siapa yang disucikan ) [ Al-Waqi’ah : 79 ] , “Al-Muthohharun” yaitu para Malaikat."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "3-4. فِيهَا maknanya: Didalam lembaran-lembaran tersebut terdapat كُتُبٌ قَيِّمَةٌ kitab-kitab yang lurus \" Kitab-kitab: maknanya: tulisan-tulisan yang tertulis yang lurus, كُتُبٌ [Kutubun] bentuk jamak dari كِتَاب [kitab: buku] bermakna yang ditulis. Makna ayat ini: Bahwa di dalam lembaran-lembaran ini, terdapat tulisan-tulisan yang lurus, yang Allah 'Azza Wa Jalla tulis. Dan dikethui bahwa apabila seorang insan membuka lembaran-lembaran al-Quran akan mendapatinya demikian, dia akan mendapati al-Quran berupa tulisan-tulisan yang lurus, perhatikanlah yang didatangkan oleh al-Quran berupa penetapan pengesaan Allah 'Azza Wa Jalla, pemujian dan pengagungan, dan pensucian kepada-Nya, anda akan mendapati Al-Quran penuh dengan hal itu. Perhatikanlah apa-apa yang terkandung dalam Al-Quran berupa penyebutan sifat Nabi shallallaahu 'alaihi wa sallam dan sifat para sahabatnya dari kalangan muhajirin dan anshar, dan sifat para pengikut mereka dalam kebaikan. Perhatikanlah apa-apa yang disebutkan dalam al-Quran beurpa perintah untuk shalat, zakat, puasa, haji dan perkara lainnya, termasuk akhlak-akhlak mulia, anda akan mendapatinya segalah yang didatangkan oleh Al-Quran lurus dengan sendirinya, dan dia pun meluruskan yang lainnya فِيهَا كُتُبٌ قَيِّمَةٌ \" di dalamnya terdapat (isi) kitab-kitab yang lurus.\" Dengan demikian, Allah memberitakan dalam ayat ini bahwa tidak mungkin mereka orang-orang kafir baik ahlulkitab dan juga orang-orang musyrik meninggalkan agama mereka, sampai datang kepada mereka bukti. Lalu setelah datang kepada mereka bukti itu, apakah mereka meninggalkan agama mereka, meninggalkan kekufuran mereka dan kesyirikan mereka? Jawabanya: Allah ta'ala berfirman: وَمَا تَفَرَّقَ الَّذِينَ أُوتُوا الْكِتَابَ إِلَّا مِنْ بَعْدِ مَا جَاءَتْهُمُ الْبَيِّنَةُ \" Dan tidaklah berpecah belah orang-orang yang didatangkan Al Kitab (kepada mereka) melainkan sesudah datang kepada mereka bukti yang nyata.\" Yakni: Setelah datang bukti kepada mereka, mereka berselisih, di antara mereka ada yang beriman dan di antara mereka ada yang kafir. Dari kalangan nasrani ada yang beriman seperti raja Najasyi, raja negeri habasyah, dan dari kalangan yahudi pun ada yang beriman seperti Abdullah bin Salam radhiyallaah 'anhu. Di antara mereka ada yang beriman ada juga yang kafir, dan siapa saja yang Allah ketahui bahwa ia menginginkan kebaikan, dan menginginkan gama untuk Allah, dia akan beriman dan mendaoatkan taufiq untuk beriman, dan siapa saja yang tidak demikian maka ia akan ditunjukkan kepada kekufuran, dan begitu juga, dari kalangan orang-orang musyrik ada yang beriman, dan alangkah manyaknya orang-orang musyrik dari kalangan quraisy yang beriman, orang-orang quraisy sebelum di utusnya Nabi shallallaahu 'alaihi wa sallam, masih dalam agama yang dianut oleh mereka hingga datang bukti kepada mereka, kemudian setelah datang bukti, mereka pun berselisih dan bercerai-berai, sebagaimana Allah ta'ala berfirman: وَلَا تَكُونُوا كَالَّذِينَ تَفَرَّقُوا وَاخْتَلَفُوا مِنْ بَعْدِ مَا جَاءَهُمُ الْبَيِّنَاتُ وَأُولَئِكَ لَهُمْ عَذَابٌ عَظِيمٌ \" Dan janganlah kamu menyerupai orang-orang yang bercerai-berai dan berselisih sesudah datang keterangan yang jelas kepada mereka. Mereka itulah orang-orang yang mendapat siksa yang berat,\"(QS. Ali Imran: 105)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Bayyinah ayat 3: Allah menjelaskan bahwa Al Qur’an mengandung ayat-ayat dan hukum-hukum, yang memberi pengajaran berharga, teruji dan jelas, yang tidak ada kesesatan di dalamnya. Dan yang memberi petunjuk kepada yang haq dan jalan yang selamat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang dimaksud dengan isi kitab-kitab yang lurus ialah isi kitab-kitab yang diturunkan kepada nabi-nabi seperti Zabur, Taurat, dan Injil yang murni. Ada pula yang menafsirkan, bahwa di dalam Al Qur’an terdapat berita-berita yang benar, perintah yang adil yang menunjukkan kepada kebenaran dan jalan yang lurus. Ketika bukti yang nyata ini (Al Qur’an) telah datang, maka saat itu jelaslah orang yang bermaksud mencari kebenaran dengan yang tidak bermaksud mencarinya, sehingga menjadi binasa seseorang karena bukti yang jelas dan menjadi hidup orang yang hidup karena bukti yang jelas."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Bayyinah Ayat 3",
    "description": "Lembaran-lembaran suci itu di dalamnya terdapat kitab-kitab, yakni hukum-hukum tertulis, yang lurus. Al-qur'an berisi akidah, hukum, kisah, dan aturan yang menuntun umat manusia ke jalan yang benar dan lurus. 4. Wahai nabi, ketahuilah bahwa ahli kitab dahulu sepakat mengimani dirimu sebagai rasul terakhir sebagaimana informasi yang mereka dapati dalam kitab-kitab mereka. Dan tidaklah terpecah-belah orang-orang ahli kitab itu melainkan setelah datang kepada mereka bukti yang nyata, yaitu kedatangan'mu atau Al-Qur'an yang kaubawa. Sebagian beriman kepadamu dan sebagian yang lain mengingkarimu."
  }
]