[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ahli kitab dari kalangan yahudi dan nasrani tidak berselisih tentang Muhammad sholallohu alaihi wasallam bahwa dia adalah utusan Allah yang haq karena mereka mendapatkan ciri-cirinya dalam kitab mereka, kecuali sesudah mereka mengetahui bahwa Muhammad sholallohu alaihi wasallam adalah nabi yang dijanjikan kepada mereka dalam taurat dan inijl, mereka sepakat atas keabsahan kenabian Muhammad sholallohu alaihi wasallam. Maka ketika beliau diutus, ada yang beriman kepadanya,dan ada yang mengingkari kenabiannya karena hasad dan dengki."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Orang-orang Yahudi yang diberi Taurat dan orang-orang Nasrani yang diberi Injil tidak berselisih kecuali setelah Allah mengutus Nabi-Nya kepada mereka. Maka di antara mereka ada yang masuk Islam dan di antara mereka ada yang tetap berkubang di dalam kekafirannya padahal ia mengetahui kebenaran Nabi-Nya"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "4. Jika orang-orang kafir itu enggan meninggalkan agama mereka hingga datang penjelasan, maka inilah penjelasan itu telah datang kepada mereka. Akan tetapi mereka kemudian terpecah; di antara mereka ada yang beriman, dan yang lainnya tetap dalam kekafiran. Tidak ada yang memecah mereka dari kebenaran melainkan pengutusan Rasulullah. Ibnu Mas’ud berkata: Ayat ini dimulai dengan celaan keras kepada pada Ahli kitab secara khusus, dan olokan keras terhadap kejahatan mereka karena mengatakan perpecahan mereka tidak terjadi kecuali setelah kebenaran itu datang dan jelas, serta ketidakmampuan mereka untuk mengajukan alasan. (Tafsir Ibnu Mas’ud 5/277)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. وَمَا تَفَرَّقَ الَّذِينَ أُوتُوا۟ الْكِتٰبَ إِلَّا مِنۢ بَعْدِ مَا جَآءَتْهُمُ الْبَيِّنَةُ (Dan tidaklah berpecah belah orang-orang yang didatangkan Al Kitab (kepada mereka) melainkan sesudah datang kepada mereka bukti yang nyata) Yakni perpecahan mereka tidak disebabkan oleh kebingungan atau syubhat, namun perpecahan itu terjadi setelah kebenaran menjadi jelas. Kemudian Allah mengurus Nabi Muhammad, dan sebagian mereka beriman kepadanya dan sebagian lainnya kafir; padahal seharusnya mereka berada dalam satu jalan dengan mengikuti agama Allah dan menjadi penganut Rasulullah yang datang dari Allah yang membenarkan kitab mereka dahulu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4-5. Para ahli kitab itu tidak menyimpang dan tidak saling berbeda tentang perkara nabi Muhammad SAW kecuali setelah datangnya dalil nyata yang menunjukkan kebenaran itu, sehingga sebagian mereka ada yang beriman dan sisanya ingkar. Para ahli kitab itu tidak diperintah dalam Taurat dan Injil kecuali hanya untuk menyembah Allah dan tidak menyekutukanNya dengan ikhlas dalam ibadah, tidak syirik, menjauhkan kebatilan dari kebenaran, menjalankan shalat fardhu pada waktunya dan menunaikan zakat kepada yang berhak menerimanya. Itulah agama yang lurus di jalan kebenaran"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dan tidaklah terpecah-belah} bertentangan {orang-orang yang diberi kitab} orang-orang Yahudi dan Nasrani {melainkan setelah datang kepada mereka bukti yang nyata} setelah diutusnya nabi Muhammad SAW, sehingga di antara mereka ada yang ingkar dan ada yang beriman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4. Dan bila ahli kitab tidak beriman dan tunduk pada Rasul, hal itu bukanlah kesesatan dan pembangkangan mereka yang pertama, karena tidaklah mereka terpecah belah, berselisih, dan menjadi banyak golongan, “melainkan sesudah datang kepada mereka bukti yang nyata,” yang mengharuskan orang-orang yang mengikutinya bersatu padu. Hanya saja karena kehinaan dan kerendahan, petunjuk hanya semakin menambah mereka sesat dan bashirahnya semakin membuat buta hati mereka."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Dan tidaklah mereka kaum Yahudi dan Nasrani yang diturunkan kepada mereka kitab berselisih dan tidak pula terlepas dari kebodohan mereka, melainkan telah datang kepada mereka bukti yang nyata, Allah - عز وجل - telah menurunkan Taurat dan Injil dan mengutus kepada mereka Rasul sebagai penjelas dan pemberi peringatan, tetapi mereka tetap berada diatas perselisihan dan kebodohan, ha litu dikarena mereka mengikuti hawa nafsu dan tidak ikut kepada kebenaran yang tertulis dalam kitab Allah ﷻ . Yahudi dan Nasrani tidak menjadikan kitab Taurat dan Injil sebagai pedoman mereka, dan mereka terus berjalan datas bumi dengan kebodohan mereka, dan Rasulullah ﷺ bersabda : (( افترقت اليهود على إحدى و سبعين فرقة ، فواحدة في الجنة و سبعين في النار ، و افترقت النصارى على اثنين و سبعين فرقة فواحدة في الجنة و إحدى و سبعين في النار ، و الذي نفسي بيده لتفترقن أمتي على ثلاث و سبعين فرقة ، فواحدة في الجنة و ثنتين و سبعين في النار ، قيل يا رسول الله من هم ؟ قال : هم الجماعة )) “Yahudi telah berpecah-belah menjadi 71 golongan, maka satu di Surga dan tujuh puluh di Neraka, dan Nashara telah berpecah belah menjadi 72 golongan, maka satu di Surga dan tujuh puluh satu di Neraka, dan demi yang jiwaku di tangan-Nya sungguh ummatku akan berpecah belah menjadi 73 golongan, maka satu di Surga dan tujuh puluh dua di Neraka, dikatakan “Wahai Rasul ALLAH siapa mereka itu?”, beliau berkata: “Mereka adalah al-Jama’ah.”” (HR Ibnu Majah : 3992 , dari hadits Ibnu Umar, dan Shahihkan oleh Al-Albany dalam kitabnya “Shahihul Jami” : 1492 ) , dalam riwayat lain dikatakan : ((هم من كان على مثل ما أنا عليه اليوم و أصحابي )) “Mereka adalah orang yang berada di atas ajaran yang sama dengan ajaranku pada hari ini, dan para sahabatku.” [ HR. Turmudzi : 2641 , dari hadits Ibnu Umar , dan Shahihkan oleh Al-Albani dalam kitabnya “Shahihul Jami” : 5343 ] , dan inilah yang disebut “Firqoh Najiyah” golongan yang selamat. Allah ﷻ telah melarang kita dari perselisihan sebagaimana orang-orang Yahudi dan Nashrani berselisih, Allah ﷻ berfirman : { وَلَا تَكُونُوا كَالَّذِينَ تَفَرَّقُوا وَاخْتَلَفُوا مِنْ بَعْدِ مَا جَاءَهُمُ الْبَيِّنَاتُ ۚ وَأُولَٰئِكَ لَهُمْ عَذَابٌ عَظِيمٌ } ( Dan janganlah kamu menyerupai orang-orang yang bercerai-berai dan berselisih sesudah datang keterangan yang jelas kepada mereka. Mereka itulah orang-orang yang mendapat siksa yang berat ) [ Ali Imran : 105 ] , perselisihan dan perbedaan pandangan adalah tabiat manusia, apalagi dalam perkara “Ijtihad, Istinbat,” dalam menentukan hukum tertentu dalam syari’at banyak terjadi di kalangan Ahli Ilmu, akan tetapi perkara ini dapat diselesaikan dengan kembali kepada Al-Qur’an dan Hadits Nabi ﷺ , maka barangsiapa berada diatas dalil yang benar perkataannya lah yang diambil, dan barangsiapa yang menyelisihi dalil ditinggalkan, Allah - عز وجل - berfirman : {يَا أَيُّهَا الَّذِينَ آمَنُوا أَطِيعُوا اللَّهَ وَأَطِيعُوا الرَّسُولَ وَأُولِي الْأَمْرِ مِنْكُمْ ۖ فَإِنْ تَنَازَعْتُمْ فِي شَيْءٍ فَرُدُّوهُ إِلَى اللَّهِ وَالرَّسُولِ إِنْ كُنْتُمْ تُؤْمِنُونَ بِاللَّهِ وَالْيَوْمِ الْآخِرِ ۚ ذَٰلِكَ خَيْرٌ وَأَحْسَنُ تَأْوِيلًا } ( Hai orang-orang yang beriman, taatilah Allah dan taatilah Rasul (Nya), dan ulil amri di antara kamu. Kemudian jika kamu berlainan pendapat tentang sesuatu, maka kembalikanlah ia kepada Allah (Al Quran) dan Rasul (sunnahnya), jika kamu benar-benar beriman kepada Allah dan hari kemudian. Yang demikian itu lebih utama (bagimu) dan lebih baik akibatnya ) [ An Nisa : 59 ] , dan kembali kepada Allah dan Rasul-Nya yakni kembali kepada Al-Qur’an dan Sunnah Rasul, semasa hidup Rasulullah maka permasalahan yang dihadapi oleh ummatnya kembali kepadanya, sedangkan setelah kematian beliau hukum suatu permasalahan syari’at dikembalikan kepada sunnah-sunnah yang beliau tinggalkan. Perbedaan pendapat yang kerap terjadi diantara kaum muslimin harus disandarkan kepada dalil-dali yang benar sesuai Al-Qur’an dan Sunnah Rasulullah, dari perbedaan itu perkara yang disetujui oleh Al-Qur’an dan Sunnah maka itulah yang benar, sedangkan perkara yang melanggar Al-Qur’an dan Sunnah maka perkara adalah itu salah. Dan zaman sekarang ini bermunculan beberapa pendakwah yang menyampaikan fatwa nya di beberapa media massa, mereka mengatakan bahwasanya perbedaan dan perselisihan adalah rahmat, dan sesungguhnya agama ini luas, ambil lah pendapat apapun dari fatwa seorang 'alim yang kamu sepakat dengannya; hal ini termasuk memudahkan agama dengan nafsu, dan ini adalah kebathilan, perbedaan dan perselisihan pendapat dianyata ulama memang ada, begitupun dengan ijtihad, akan tetapi seseorang tidak diperbolehkan memutuskan untuk mengambil apapun dari pendapat tersebut yang menyalahi dalil dari Al-Qur'an dan Sunnah Rasulullah, atau ijtihad dari seorang 'alim yang disepakati hukumnya oleh semua ulama atau sebagian besar dari mereka. Adapun mengambil hukum dari hawa nafsu, dan meninggalkan apa yang sesuai dengan dalil karena tidak sesuai dengan hawa nafsu kita; maka cara ini adalah cara yang dipakai oleh Yahudi dan Nashrani, Allah ﷻ berfirman : { اتَّخَذُوا أَحْبَارَهُمْ وَرُهْبَانَهُمْ أَرْبَابًا مِنْ دُونِ اللَّهِ } ( Mereka menjadikan orang-orang alimnya dan rahib-rahib mereka sebagai tuhan selain Allah ) [ At Taubah : 31 ] , mereka menghalalkan apa yamg sebenarnya itu haram, dan mengharamkan apa yang halal dalam syari'at. Yahudi dan Nashrani adalah orang-orang yang sering melakukan perselisihan dan perbedaan sejak dulu kala, maka tidak menjadi hal yang menakjubkan jikalau mereka berlepas diri syari'at Muhammad dan selalu membedakan diri mereka darinya, hal itu dikarenakan mereka mengikuti hawa nafsu, Allah ﷻ berfirman : { فَإِنْ لَمْ يَسْتَجِيبُوا لَكَ فَاعْلَمْ أَنَّمَا يَتَّبِعُونَ أَهْوَاءَهُمْ ۚ وَمَنْ أَضَلُّ مِمَّنِ اتَّبَعَ هَوَاهُ بِغَيْرِ هُدًى مِنَ اللَّهِ ۚ إِنَّ اللَّهَ لَا يَهْدِي الْقَوْمَ الظَّالِمِينَ } ( Maka jika mereka tidak menjawab (tantanganmu) ketahuilah bahwa sesungguhnya mereka hanyalah mengikuti hawa nafsu mereka (belaka). Dan siapakah yang lebih sesat daripada orang yang mengikuti hawa nafsunya dengan tidak mendapat petunjuk dari Allah sedikitpun. Sesungguhnya Allah tidak memberi petunjuk kepada orang-orang yang zalim ) [ Al-Qashash : 50 ] ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "3-4. فِيهَا maknanya: Didalam lembaran-lembaran tersebut terdapat كُتُبٌ قَيِّمَةٌ kitab-kitab yang lurus \" Kitab-kitab: maknanya: tulisan-tulisan yang tertulis yang lurus, كُتُبٌ [Kutubun] bentuk jamak dari كِتَاب [kitab: buku] bermakna yang ditulis. Makna ayat ini: Bahwa di dalam lembaran-lembaran ini, terdapat tulisan-tulisan yang lurus, yang Allah 'Azza Wa Jalla tulis. Dan dikethui bahwa apabila seorang insan membuka lembaran-lembaran al-Quran akan mendapatinya demikian, dia akan mendapati al-Quran berupa tulisan-tulisan yang lurus, perhatikanlah yang didatangkan oleh al-Quran berupa penetapan pengesaan Allah 'Azza Wa Jalla, pemujian dan pengagungan, dan pensucian kepada-Nya, anda akan mendapati Al-Quran penuh dengan hal itu. Perhatikanlah apa-apa yang terkandung dalam Al-Quran berupa penyebutan sifat Nabi shallallaahu 'alaihi wa sallam dan sifat para sahabatnya dari kalangan muhajirin dan anshar, dan sifat para pengikut mereka dalam kebaikan. Perhatikanlah apa-apa yang disebutkan dalam al-Quran beurpa perintah untuk shalat, zakat, puasa, haji dan perkara lainnya, termasuk akhlak-akhlak mulia, anda akan mendapatinya segalah yang didatangkan oleh Al-Quran lurus dengan sendirinya, dan dia pun meluruskan yang lainnya فِيهَا كُتُبٌ قَيِّمَةٌ \" di dalamnya terdapat (isi) kitab-kitab yang lurus.\" Dengan demikian, Allah memberitakan dalam ayat ini bahwa tidak mungkin mereka orang-orang kafir baik ahlulkitab dan juga orang-orang musyrik meninggalkan agama mereka, sampai datang kepada mereka bukti. Lalu setelah datang kepada mereka bukti itu, apakah mereka meninggalkan agama mereka, meninggalkan kekufuran mereka dan kesyirikan mereka? Jawabanya: Allah ta'ala berfirman: وَمَا تَفَرَّقَ الَّذِينَ أُوتُوا الْكِتَابَ إِلَّا مِنْ بَعْدِ مَا جَاءَتْهُمُ الْبَيِّنَةُ \" Dan tidaklah berpecah belah orang-orang yang didatangkan Al Kitab (kepada mereka) melainkan sesudah datang kepada mereka bukti yang nyata.\" Yakni: Setelah datang bukti kepada mereka, mereka berselisih, di antara mereka ada yang beriman dan di antara mereka ada yang kafir. Dari kalangan nasrani ada yang beriman seperti raja Najasyi, raja negeri habasyah, dan dari kalangan yahudi pun ada yang beriman seperti Abdullah bin Salam radhiyallaah 'anhu. Di antara mereka ada yang beriman ada juga yang kafir, dan siapa saja yang Allah ketahui bahwa ia menginginkan kebaikan, dan menginginkan gama untuk Allah, dia akan beriman dan mendaoatkan taufiq untuk beriman, dan siapa saja yang tidak demikian maka ia akan ditunjukkan kepada kekufuran, dan begitu juga, dari kalangan orang-orang musyrik ada yang beriman, dan alangkah manyaknya orang-orang musyrik dari kalangan quraisy yang beriman, orang-orang quraisy sebelum di utusnya Nabi shallallaahu 'alaihi wa sallam, masih dalam agama yang dianut oleh mereka hingga datang bukti kepada mereka, kemudian setelah datang bukti, mereka pun berselisih dan bercerai-berai, sebagaimana Allah ta'ala berfirman: وَلَا تَكُونُوا كَالَّذِينَ تَفَرَّقُوا وَاخْتَلَفُوا مِنْ بَعْدِ مَا جَاءَهُمُ الْبَيِّنَاتُ وَأُولَئِكَ لَهُمْ عَذَابٌ عَظِيمٌ \" Dan janganlah kamu menyerupai orang-orang yang bercerai-berai dan berselisih sesudah datang keterangan yang jelas kepada mereka. Mereka itulah orang-orang yang mendapat siksa yang berat,\"(QS. Ali Imran: 105)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Bayyinah ayat 4: Kemudian Allah menjelaskan tentang Yahudi dan Nashoro yang mereka tidak berselisih kecuali setelah diutusnya Rasul ﷺ kepada manusia untuk menjelaskan kepada mereka apa yang dihilangkan oleh mereka dari kitab samawiyyah, Maka ketika diutusnya Rasul ﷺ kepada manusia untuk menjelaskan kepada mereka bahwa Nabi yang telah dijanjikan di Taurat dan Injil (telah datang), maka barulah mereka berselisih. Diantara mereka ada yang beriman, dan kebanyakan dari mereka tidak mengimani; Sebab mereka tidak ridha bahwa Nabi diutus dari selain (kaum) mereka. Sebagaimana Allah berfirman : لِّئَلَّا يَعْلَمَ أَهْلُ ٱلْكِتَـٰبِ أَلَّا يَقْدِرُونَ عَلَىٰ شَىْءٍۢ مِّن فَضْلِ ٱللَّهِ ۙ وَأَنَّ ٱلْفَضْلَ بِيَدِ ٱللَّهِ يُؤْتِيهِ مَن يَشَآءُ , yang artinya : (Kami terangkan yang demikian itu) supaya ahli Kitab mengetahui bahwa mereka tiada mendapat sedikitpun akan karunia Allah (jika mereka tidak beriman kepada Muhammad), dan bahwasanya karunia itu adalah di tangan Allah. Dia berikan karunia itu kepada siapa yang dikehendaki-Nya; {Al Hadid : 29}. Dan sungguh Allah telah datangkan kenabian kepada Muhammad ﷺ."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Jika Ahli Kitab tidak beriman kepada Rasul dan tunduk kepadanya, maka hal itu bukanlah hal yang baru tentang sesat dan kerasnya mereka, karena mereka tidaklah berpecah belah dan berselisih bahkan menjadi ke dalam beberapa golongan kecuali setelah datang kepada mereka bukti yang nyata, yang mengharuskan untuk berkumpul dan bersatu, akan tetapi karena kehinaan dan kerendahan mereka, petunjuk tidaklah menambah mereka selain kesesatan. Ada yang berpendapat, bahwa sebelum kedatangan Beliau shallallahu 'alaihi wa sallam, mereka berkumpul untuk sama-sama beriman kepada Nabi Muhammad shallallahu 'alaihi wa sallam, namun ketika Beliau datang, maka di antara mereka banyak yang kafir kepada Beliau karena hasad kepadanya. Yaitu Nabi Muhammad shallallahu 'alaihi wa sallam atau Al Qur’an."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Bayyinah Ayat 4",
    "description": "Wahai nabi, ketahuilah bahwa ahli kitab dahulu sepakat mengimani dirimu sebagai rasul terakhir sebagaimana informasi yang mereka dapati dalam kitab-kitab mereka. Dan tidaklah terpecah-belah orang-orang ahli kitab itu melainkan setelah datang kepada mereka bukti yang nyata, yaitu kedatangan'mu atau Al-Qur'an yang kaubawa. Sebagian beriman kepadamu dan sebagian yang lain mengingkarimu. 5. Mereka terpecah belah seperti itu padahal mereka dalam kitab-kitab mereka hanya diperintah untuk menyembah Allah dengan ikhlas menaati-Nya semata-mata karena menjalankan agama, dan juga diperintah agar melaksanakan salat dan menunaikan zakat; dan yang demikian itulah aga-ma yang lurus dan benar agama islam. Keikhlasan dalam beribadah dengan memurnikan niat demi mencari rida Allah dan menjauhkan diri dari kemusyrikan adalah salah satu syarat diterimanya ibadah."
  }
]