[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka tidak diperintahkan dalam seluruh syariat Allah kecuali agar mereka beribadah kepada Allah semata, mengarahkan ibadah mereka hanya kepada wajah NYA,menjauhi syirik dengan condong kepada iman,menegakan shalat dan menunaikan zakat. Itulah agama istiqamah, yaitu agama islam."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Kejahatan dan pembangkangan orang-orang Yahudi dan Nasrani menjadi nyata, karena mereka tidak diperintahkan di dalam Al-Qur`ān kecuali dengan apa yang diperintahkan kepada mereka di dalam kitab mereka berupa ibadah kepada Allah semata, menghindari syirik, mendirikan salat, menunaikan zakat. Maka apa yang diperintahkan kepada mereka adalah agama yang lurus, yang tidak ada penyelewengan di dalamnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "5. Allah memerintahkan mereka untuk menyembah-Nya dengan penuh keikhlasan dan meninggalkan segala agama menuju agama Islam saja, beristiqamah di atas ajaran Nabi Ibrahim yang lurus dan berpegang teguh pada syariat Allah seperti mendirikan shalat dan menunaikan zakat. Itulah agama Islam, agama lurus yang jauh dari kesesatan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. وَمَآ أُمِرُوٓا۟( Padahal mereka tidak disuruh) Dengan perintah yang ada dalam kitab-kitab yang diturunkan dahulu dan dalam al-Qur’an. إِلَّا لِيَعْبُدُوا۟ اللَّـهَ مُخْلِصِينَ لَهُ الدِّينَ (supaya menyembah Allah dengan memurnikan ketaatan kepada-Nya) Yakni agar mereka senantiasa beribadah kepada Allah, dan ibadah mereka harus bersih dari segala kemusyrikan, dan agar mereka benar-benar ikhlas dalam beragama. حُنَفَآءَ((menjalankan) agama yang lurus) Yakni meninggalkan segala agama menuju agama Islam semata. وَيُقِيمُوا۟ الصَّلَوٰةَ وَيُؤْتُوا۟ الزَّكَوٰةَ ۚ (dan supaya mereka mendirikan shalat dan menunaikan zakat) Yakni mendirikan shalat sesuai tuntunan Allah pada waktunya, dan menunaikan zakat kepada orang yang berhak. وَذٰلِكَ دِينُ الْقَيِّمَةِ (dan yang demikian itulah agama yang lurus) Yakni agama yang demikian adalah agama yang lurus, maka tidak pantas untuk berselisih tentangnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4-5. Para ahli kitab itu tidak menyimpang dan tidak saling berbeda tentang perkara nabi Muhammad SAW kecuali setelah datangnya dalil nyata yang menunjukkan kebenaran itu, sehingga sebagian mereka ada yang beriman dan sisanya ingkar. Para ahli kitab itu tidak diperintah dalam Taurat dan Injil kecuali hanya untuk menyembah Allah dan tidak menyekutukanNya dengan ikhlas dalam ibadah, tidak syirik, menjauhkan kebatilan dari kebenaran, menjalankan shalat fardhu pada waktunya dan menunaikan zakat kepada yang berhak menerimanya. Itulah agama yang lurus di jalan kebenaran"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Padahal mereka tidak diperintahkan melainkan menyembah Allah dengan ikhlas hanya kepadaNya} dalam beribadah {dengan lurus} menyimpang dari semua agama menuju agama Islam {mendirikan shalat dan menunaikan zakat; yang demikian itulah agama yang lurus} dan amal yang diperintahkan oleh agama yang lurus"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5. Padahal semua kitab berasal dari pangkal dan agama yang sama, karena itu tidaklah mereka, “disuruh,” dalam seluruh syariat tersebut kecuali agar mereka menyembah, “Allah dengan memurnikan ketaatan kepadaNya,” yakni mencari Wajah Allah dalam seluruh ibadah, baik yang zahir maupun yang batin, serta ingin mendekat di sisiNya, “yang lurus,” berpaling dan meninggalkan seluruh agama yang berseberangan dengan agama tauhid. Allah menyebutkan shalat dan zakat secara khusus meski keduanya tercakup dalam FirmanNya, “Agar mereka menyembah Allah dengan memurnikan ketaatan kepadaNya,” adalah karena keutamaan dan kemuliaan keduanya dan karena keduanya adalah ibadah yang jika ditunaikan, berarti seluruh syariat agama telah tegak. “Dan yang demikian itulah,” yaitu tauhid dan ikhlas dalam beragama adalah “Agama yang lurus,” yakni agama lurus yang akan mengantarkan ke surga penuh kenikmatan, dan selain itu hanyalah jalan-jalan yang akan mengantarkan ke Neraka Jahim."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ وَمَا أُمِرُوا } Yakni semua makhluk, baik dari ahli kitab maupun selain dari meeka, juga kaum muslimin, mereka tidak diperintahkan selain hanya untuk mereka beribadah hanya kepada Allah ﷻ ikhlas karena mengharap keridhoan-Nya, itulah agama yang sempurna, menegakkan tauhid dimuka bumi adalah tujuan dari penciptaan seluruh makhluk di muka bumi ini, bahkan semua Nabi dan Rasul walaupun syari’at yang mereka bawa berebeda satu sama lainnya akan tetapai tujuan mereka sama, yaitu untuk menegakkan tauhid di muka bumi, untuk mensatukan ibadaha hanya kepada Allah ﷻ , { خْلِصِينَ لَهُ الدِّينَ } Ibadah yang terbebas dari kesyirikan. { حُنَفَاءَ } Bentuk jamak dari kata “حنيف “ yaitu menyimpang dari kebathilan, dan menerima segala kebenaran seperti Sifat yang ada pada Nabi Ibrahim - عليه السلام - , Allah berfirman tentangnya : { إِنَّ إِبْرَاهِيمَ كَانَ أُمَّةً قَانِتًا لِلَّهِ حَنِيفًا وَلَمْ يَكُ مِنَ الْمُشْرِكِينَ } ( Sesungguhnya Ibrahim adalah seorang imam yang dapat dijadikan teladan lagi patuh kepada Allah dan hanif. Dan sekali-kali bukanlah dia termasuk orang-orang yang mempersekutukan (Tuhan) ) [ An-Nahl : 120 ] , oleh karena itu agama yang dibawakan oleh Rasulullah ﷺ adalah agama yang “Hanif” yaitu agama yang tidak menyimpang dari kebenaran dan jauh dari kesesatan. { وَيُقِيمُوا الصَّلَاةَ وَيُؤْتُوا الزَّكَاةَ } Dan agar mereka mendirikan shalat dan menunaikan zakat, kenapa didalam ayat ini disebutkan secara khusus perintah shalat dan zakat, bukankah keduanya telah masuk dalam perintah ikhlas dalam beragama ? , hal itu dikarenakan kedua ibadah itu memiliki keutamaan tersendiri dalam islam, kedua ibadah ini mengantarkan kepada kemudahan dalam beramal shalih, Allah ﷻ berfirman : { إِنَّ الصَّلَاةَ تَنْهَىٰ عَنِ الْفَحْشَاءِ وَالْمُنْكَرِ } ( Sesungguhnya shalat itu mencegah dari (perbuatan-perbuatan) keji dan mungkar ) [ Al-Ankabut : 45 ] , sedangkan zakat adalah salah satu cara islam untuk mensucikan manusia dari kebakhilan, maka barangsiapa yang senantiasa menjaga shalatnya ia telah menjaga agamanya, dan barangsiapa yang senantiasa membayar zakat ia telah menunaikan sebagian dari kebaikan yang belum ia tunaikan; karena zakat adalah pembimbing manusia untuk senantiasa berbuat baik, shalat adalah ibadah badaniyah ( ibadah anggota tubuh ), dan zakat adalah ibadah maliyah ( ibadah harta ), maka barangsiapa yang telah mendirikan shalat, da menunaikan zakat ia telah mendirikan agama ini dengan lebih sempurna. Akan tetapi jikalau seseorang melakukan berbagai macam kebaikan sedangkan dia tidak mendirikan shalat, maka dia bukanlah seorang muslim, atau tidak menunaikan zakat padahal dirinya mampu, maka dia juga belum temasuk muslim yang sesungguhnya, oleh karena itu Abu bakr as shiddiq - رضي الله عنه - memerangi orang-orang yang enggan membayar zakat,padahal mereka bersaksi bahwa tiada Tuhan yang berhak disembah selain Allah dan Muhammad adalah Rasul utusan Allah, mereka mendirikan shalat, akan tetapi ketika zakat diperintahkan untuk dibayar mereka enggan, kemudian berkatalah Abu Bakr - رضي الله عنه - : “ Demi Allah aku akan memerangi orang-orang yang memisahkan antara shalat dan zakat ” , Abu bakr kemudian memerangi mereka sampai tunduk kepada hukum Allah - عز وجل - . { وَذَٰلِكَ دِينُ الْقَيِّمَةِ } Maka barangsiapa yang telah melaksanakan semua perintah diatas, yakni mengkhususkan semua ibadah hanya kepada Allah dengan ikhlas, mendirikan shalat, dan membayar zakat, maka sesungguhnya itu adalah agama yang lurus."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Bayyinah ayat 5: Allah menjelaskan perintah-perintah yang terkandung di dalam Al Qur’an untuk Yahudi dan Nasrani beserta musyrikin, dalam (menjalankan) keikhlasan beribadah kepada Allah saja dan tidak menyekutukannya dengan sesuatu apapun, dan mengikuti agama yang lurus serta berpaling dari semua agama, menuju kepada agama islam. Kemudian memerintahkan juga untuk menegakkan shalat dan mentunaikan zakat. Itulah yang diperintahkan Allah pada nya, yang islam adalah agama yang tetap dimana para Rasul diperintahkan (mengikutinya)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dalam kitab mereka, yaitu Taurat dan Injil. Yakni meniatkan semua ibadah mereka yang tampak maupun tesembunyi karena mengharap ridha Allah dan agar dapat dekat di sisi-Nya. Lurus berarti jauh dari syirk (mempersekutukan Allah) dan jauh dari kesesatan, atau berpaling dari seluruh agama yang bertentangan dengan tauhid. Disebutkan shalat dan zakat secara khusus meskipun sudah masuk ke dalam ayat, “Li ya’budullah” karena keutamaan dan kemuliaan keduanya dan karena keduanya merupakan tiang agama, dimana dengan keduanya maka akan tegaklah semua syariat dalam agama. Yakni tauhid dan berbuat ikhlas dalam beragama. Yakni yang dapat menyampaikan pelakunya ke surga."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Bayyinah Ayat 5",
    "description": "Mereka terpecah belah seperti itu padahal mereka dalam kitab-kitab mereka hanya diperintah untuk menyembah Allah dengan ikhlas menaati-Nya semata-mata karena menjalankan agama, dan juga diperintah agar melaksanakan salat dan menunaikan zakat; dan yang demikian itulah aga-ma yang lurus dan benar agama islam. Keikhlasan dalam beribadah dengan memurnikan niat demi mencari rida Allah dan menjauhkan diri dari kemusyrikan adalah salah satu syarat diterimanya ibadah. 6. Sungguh, orang-orang yang kafir dari golongan ahli kitab dan orang-orang yang musyrik akan masuk ke neraka jahanam dengan bermacam siksa pedih di dalamnya; mereka kekal di dalamnya selama-lamanya. Tidak ada kesempatan bagi mereka untuk keluar, bahkan untuk sekadar sejenak lepas dari siksa. Mereka itu adalah sejahat-jahat makhluk. Allah telah mem-beri mereka peringatan, tetapi mereka enggan mengindahkannya. Dia tidak akan menyiksa seseorang kecuali setelah memberinya peringatan."
  }
]