[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang kafir dari kalangan orang-orang yahudi, nasrani dan kaum musyrikin berada dalam api neraka jahanam, mereka kekal didalamnya. Mereka adalah makhluk yang paling buruk."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Sesungguhnya orang-orang yang kafir -dari kalangan Yahudi dan Nasrani serta kaum musyrikin- pada hari Kiamat akan masuk Neraka Jahanam, mereka menetap di dalamnya selama-lamanya. Mereka adalah seburuk-buruk ciptaan karena kekufuran mereka terhadap Allah dan pendustaan mereka terhadap Rasul-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "6. Jelaslah sikap orang-orang musyrik dan kebebalan mereka untuk tetap menuruti hawa nafsu serta kerusakan akidah mereka, meskipun kabar yang ada dalam kitab mereka yang telah mereka tungguh telah nyata. Akibat sikap mereka itu maka mereka akan menjadi bahan bakar api neraka dan kekal di dalamnya selama-lamanya. Mereka adalah seburuk-buruk makhluk bagi Allah, dan mereka hanya akan mendatangkan keburukan dan gangguan bagi orang-orang beriman. Mereka seperti itu karena telah tersesat setelah mereka memperoleh sebab-sebab yang dapat mengantarkan mereka kepada hidayah. Para ahli kitab masuk neraka karena telah berpaling dari kitab-kitab mereka sebelum mengalami pengubahan. Sedangkan orang-orang musyrik masuk neraka karena mereka tersesat dari ajaran yang lurus, dan menjadikan berhala-berhala sebagai bagian dari ajaran itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. أُو۟لٰٓئِكَ هُمْ شَرُّ الْبَرِيَّةِ (Mereka itu adalah seburuk-buruk makhluk) Yakni makhluk yang paling buruk keadaannya, sebab mereka meninggalkan kebenaran karena sifat hasad dan sesat; karena itulah mereka akan kembali ke tempat yang merupakan seburuk-buruk tempat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Sesungguhnya orang-orang kafir dari ahli kitab yang terdiri dari kaum Yahudi, kaum Nasrani dan penyembah berhala, balasan mereka pada hari kiamat adalah di neraka Jahanam. Mereka tinggal di sana selama-lamanya. Mereka adalah seburuk-buruk ciptaan karena telah meninggalkan kebenaran dengan iri dan zalim"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya orang-orang yang kafir dari golongan Ahlul kitab dan orang-orang musyrik itu di neraka Jahanam; mereka kekal di dalamnya selama-lamanya. Mereka itu adalah sejahat-jahat makhluk} ciptaan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6. Kemudian Allah menyebutkan balasan orang-orang kafir setelah datangnya bukti nyata kepada mereka seraya berfirman, “Sesungguhnya orang-orang kafir dari ahli kitab dan orang-orang musyrik (akan masuk) ke Neraka Jahanam,” siksa Neraka Jahanam meliputi mereka dan siksanya amat dahsyat menimpa mereka. “Mereka kekal di dalamnya,” tidaklah siksaan diringankan dari mereka sedangkan mereka terbenam di dalamnya. “Mereka itu adalah seburuk-buruk makhluk,” karena mereka tahu kebenaran namun mereka meninggalkannya, mereka rugi dunia akhirat."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Kemudian dijelaskan dalam ayat ini balasan orang-orang kafir dari kalangan ahli kitab dan orang-orang musyrik, dan balasan bagi orang-orang beriman pada ayat setelahnya, Allah - عز وجل - berfirman : { إِنَّ الَّذِينَ كَفَرُوا مِنْ أَهْلِ الْكِتَابِ وَالْمُشْرِكِينَ فِي نَارِ جَهَنَّمَ خَالِدِينَ فِيهَا ۚ أُولَٰئِكَ هُمْ شَرُّ الْبَرِيَّةِ } . { إِنَّ الَّذِينَ كَفَرُوا مِنْ أَهْلِ الْكِتَابِ وَالْمُشْرِكِينَ } Perhatikanlah, mereka berbuat kekafiran padahal mereka adalah ahl kitab !! itu dikarenakan mereka tidak mengikuti kitab yang Allah turunkan kepada mereka, dan tidak pula mereka mengamalkan apa yang diperintahkan didalamnya, mereka adalah kaum Yahudi dan Nashrani. Dan musyrikin adalah orang yang menyembah berhala, pohon-pohon, dan batu-batu, dan juga api sebagaimana yang dilakukan oleh kelompok majusi. { إِنَّ الَّذِينَ كَفَرُوا مِنْ أَهْلِ الْكِتَابِ وَالْمُشْرِكِينَ } DIsebutkan \"Ahli kitab\" dan \"Musyrikin\" tanpa dipisahkan antara keduanya, dan sebagian da'i mengatakan : bahwa ada perbedaan antara \"Ahli kitab\" dan \"musyrikin\" dari segi balasan... betul ada perbedaan diantara keduanya dalam hal hukum syari'at, akan tetapi dari segi balasan dan ganjaran tidak ada perbedaan antara mereka disisi Allah, mereka semua adalah orang-orang kafir, mereka adalah penghuni neraka, padahal mereka adalah Ahli kitab !! tetapi jika mereka tidak tunduk kepada perintah yang ada dalam kitab itu mereka akan bersama para penghuni neraka. { نَارِ جَهَنَّمَ } Mereka ( Yahudi dan Nashrani ) akan dimasukkan kedalam neraka jahannam, \"Jahannam\" : adalah salah satu tingkatan dari tingkatan-tingkatan neraka yang Allah cipatakan, karena Allah - عز وجل - telah menciptakan neraka beberapa tingkatan yang sangat rendah, sebagaimana surga diciptakan dengan tingkatan-tingkatannya yang sangat tinggi, surga adalah tempat yang sangat tinggi diakhirat, sedangkan neraka adalah tempat kembali yang paling rendah. Lalu apakah ahli kitab dan musyrikin itu akan tinggal didalam neraka selama satu hari, atau dua hari, atau bahkan cuman satu bulan atau satu tahun ? tentu tidak { خَالِدِينَ فِيهَا } bahkan mereka akan tinggal di neraka itu kekal selamanya, azab yang sangat pedih akan mereka rasakan selamanya didalam neraka jahannam, tidak ada harapan bagi mereka untuk bisa selamat dan keluar dari neraka itu, semua itu merupakan balasan atas kekafiran yang telah mereka lakukan didunia, kemudian Allah ﷻ mengatakan : { أُولَٰئِكَ } Dan orang-orang kafir itu { شَرُّ الْبَرِيَّةِ } adalah seburuk buruknya ciptaan, biarlah mereka mengatakan : bahwasanya Yahudi dan Nasrani saat ini telah maju dan berkembang dari segi teknologi, mereka telah merubah peradaban dunia dan terus naik dan memiliki kekuasaan yang besar di seluruh dunia, tetapi semua itu tidak ada nilainya disisi Allah - عز وجل - , mereka akan kekal selamanya di neraka, kesuksesan apapun yang telah mereka raih di dunia tidak akan bermanfaat diri mereka sendiri, walaupn dunia memuji mereka dengan gelar \"manusia terbaik\" dengan berbagai kecanggihan dan tehnologi yang mereka ciptakan , tetapi pada hakikatnya mereka adalah makhluk ciptaan yang paling buruk dan paling hina."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "إِنَّ الَّذِينَ كَفَرُوا مِنْ أَهْلِ الْكِتَابِ وَالْمُشْرِكِينَ فِي نَارِ جَهَنَّمَ خَالِدِينَ فِيهَا أُولَئِكَ هُمْ شَرُّ الْبَرِيَّةِ \" Sesungguhnya orang-orang kafir yakni ahli Kitab dan orang-orang musyrik (akan masuk) ke neraka Jahanam; mereka kekal di dalamnya. Mereka itu adalah seburuk-buruk makhluk.\"Allah Ta'ala menjelaskan pada ayat ini dengan penjelaskan yang ditegaskan dengan إن [inna] إِنَّ الَّذِينَ كَفَرُوا مِنْ أَهْلِ الْكِتَابِ وَالْمُشْرِكِينَ فِي نَارِ جَهَنَّمَ \"Sesungguhnya orang-orang kafir yakni ahli Kitab dan orang-orang musyrik (akan masuk) ke neraka Jahanam;\" Maknanya: Di dalam neraka yang dinamakan dengan Jahannam, dinamai jahannam karena kedalamannya yang sangat dan kegelapannya, kata tersebut diambil dari kata Juhmah (gelap/hitam), dikatakan bahwa kata ini adalah kata a'jami (non arab) yang dijadikan kosakata bahasa arab oleh orang arab. Bagaimana pun juga asal muasalnya, kata jahannam adalah salah satu nama-nama neraka, dan firman Allah: إِنَّ الَّذِينَ كَفَرُوا مِنْ أَهْلِ الْكِتَابِ وَالْمُشْرِكِينَ \"Sesungguhnya orang-orang kafir yakni ahli Kitab dan orang-orang musyrik \" Huruf من [min] di sini berfungsi penjelasan dari kata yang belum dijelaskan sebelumnya, yaitu isim maushul dalam firman-Nya: إِنَّ الَّذِينَ كَفَرُوْا \"Sesungguhnya orang-orang yang kafir\" dari sinilah maka konsekuensi dari ayat ini adalah bahwa Ahlul-Kitab mereka adalah orang-orang kafir. Mereka adalah orang-orang yahudi dan nasrani. Dan memang begitulah (kondisi mereka). Orang-orang yahudi dan nasrani adalah orang-orang kafir ketika mereka tidak beriman kepada Rasulullah Muhammad shallallaahu 'alaihi wa sallam. Jika mereka mengatakan: Mereka beriman kepada Allah dan hari akhir,d an mereka mendoakan orang-orang mati mereka dengan doa rahmat dan yang semisalnya berupa ungkapan-ungkapan pendekatan, maka mereka sebenarnya berdusta. Kalau saja mereka beriman kepada Allah dan hari akhir pasti mereka akan beriman kepada Muhammad shallallaahu 'alaihi wa sallam, bahkan mereka akan beriman kepada rasul-rasuk mereka, karena Nabi shallallahu 'alaihi wa sallam telah mereka dapatkan penyebutan sifatnya dalam taurat dan injil, sebagaimana Allah tabaraka wa Ta'ala berfirman dalam surat al-A'raf: الَّذِينَ يَتَّبِعُونَ الرَّسُولَ النَّبِيَّ الْأُمِّيَّ الَّذِي يَجِدُونَهُ مَكْتُوبًا عِنْدَهُمْ فِي التَّوْرَاةِ وَالْإِنْجِيلِ يَأْمُرُهُمْ بِالْمَعْرُوفِ وَيَنْهَاهُمْ عَنِ الْمُنْكَرِ وَيُحِلُّ لَهُمُ الطَّيِّبَاتِ وَيُحَرِّمُ عَلَيْهِمُ الْخَبَائِثَ \" (Yaitu) orang-orang yang mengikut Rasul, Nabi yang umi yang (namanya) mereka dapati tertulis di dalam Taurat dan Injil yang ada di sisi mereka, yang menyuruh mereka mengerjakan yang makruf dan melarang mereka dari mengerjakan yang mungkar dan menghalalkan bagi mereka segala yang baik dan mengharamkan bagi mereka segala yang buruk \" (QS. Al-A'raf: 157) Bahkan Nabi Isa shallallaahu 'alaihi wa sallam berkata kepada bani Israil: يَا بَنِي إِسْرَائِيلَ إِنِّي رَسُولُ اللَّهِ إِلَيْكُمْ مُصَدِّقًا لِمَا بَيْنَ يَدَيَّ مِنَ التَّوْرَاةِ وَمُبَشِّرًا بِرَسُولٍ يَأْتِي مِنْ بَعْدِي اسْمُهُ أَحْمَدُ \" Hai Bani Israel, sesungguhnya aku adalah utusan Allah kepadamu, membenarkan kitab (yang turun) sebelumku, yaitu Taurat dan memberi kabar gembira dengan (datangnya) seorang Rasul yang akan datang sesudahku, yang namanya Ahmad (Muhammad) \"(QS. Ash-Shaff: 6) Lalu ketika telah datang Rasul tersebut yang dikabarkan oleh Isa dengan bukti-buktinya, mereka mengatakan: Ini adalah sihir yang nyata, mereka mendustakannya dan neggan mengikutinya kecuali sebagian kecil dari yahudi dan nasrani, mereka beriman kepada Muhammad shallallaahu 'alaihi wa sallam dan mengikutinya. أُولَئِكَ هُمْ شَرُّ الْبَرِيَّةِ \" Mereka itu adalah seburuk-buruk makhluk.\" Seburuk buruk makhluk, al-bariyah berarti makhluk. Dengan begitu, maka orang-orang kafir dari kalangan yahudi, nasrani dan orang-orang musyrik , mereka seburuk-buruk makhluk, sungguh Allah telah menjelaskan secara sempurna dalam firman-Nya: إِنَّ شَرَّ الدَّوَابِّ عِنْدَ اللَّهِ الَّذِينَ كَفَرُوا فَهُمْ لَا يُؤْمِنُونَ \" Sesungguhnya binatang (makhluk) yang paling buruk di sisi Allah ialah orang-orang yang kafir, karena mereka itu tidak beriman.\"(QS. Al-Anfal: 55) Dan Allah Ta'ala juga berfirman: إِنَّ شَرَّ الدَّوَابِّ عِنْدَ اللَّهِ الصُّمُّ الْبُكْمُ الَّذِينَ لَا يَعْقِلُونَ (22) وَلَوْ عَلِمَ اللَّهُ فِيهِمْ خَيْرًا لَأَسْمَعَهُمْ وَلَوْ أَسْمَعَهُمْ لَتَوَلَّوْا وَهُمْ مُعْرِضُونَ \" Sesungguhnya binatang (makhluk) yang seburuk-buruknya pada sisi Allah ialah orang-orang yang pekak dan tuli yang tidak mengerti apa-apa pun. Kalau kiranya Allah mengetahui kebaikan ada pada mereka, tentulah Allah menjadikan mereka dapat mendengar. Dan jika Allah menjadikan mereka dapat mendengar, niscaya mereka pasti berpaling juga, sedang mereka memalingkan diri (dari apa yang mereka dengar itu).\"(QS. Al-Anfal: 22-23) Mereka orang-orang kafir dari kalangan yahudi, nasrani dan orang-orang musyrik, mereka adalah seburuk-buruk makhluk di sisi Allah 'Azza wa Jalla. Jika mereka adalah seburuk-buruk makhluk maka kita tidak memprediksikan dari mereka kecuali segala keburukan, karena orang yang buruk, akan menjadi sumber keburukan, dan tidak mungkin selamanya kita berbaik sangka kepada mereka, terkadang kita percaya pada orang jujur di kalangan mereka, sebagaimana Nabi shallallaahu 'alaihi wa sallam pernah percaya kepada seorang musyrik yang bernama Abdullah Bin Uraiqith, ketika beliau membayar jasanya untuk memberikan petunjuk jalan ketika hijrah, tapi kebanyakan mereka tidak bisa dipercaya, karena mereka semua buruk (pada dasarnya)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Bayyinah ayat 6: Allah mengabarkan bahwasanya barangsiapa yang mereka kufur kepada Allah dan Rasul-Nya ﷺ dari kalangan Yahudi dan Nasrani serta musyrikin yang mengibadahi benda mati; Mereka semua pada hari kiamat tempatnya di neraka jahannam, tinggal di dalamnya selama-lamanya, tidak dikeluarkan darinya selamanya. Sebab mereka adalah seburuk-buruk dan sejelek-jelek ciptaan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala menyebutkan balasan orang-orang kafir setelah bukti yang nyata datang kepada mereka. Azab dan siksaannya meliputinya. Tanpa diringankan azab mereka. Karena mereka telah mengetahui yang hak namun mereka tinggalkan sehingga mereka rugi di dunia dan akhirat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Bayyinah Ayat 6",
    "description": "Sungguh, orang-orang yang kafir dari golongan ahli kitab dan orang-orang yang musyrik akan masuk ke neraka jahanam dengan bermacam siksa pedih di dalamnya; mereka kekal di dalamnya selama-lamanya. Tidak ada kesempatan bagi mereka untuk keluar, bahkan untuk sekadar sejenak lepas dari siksa. Mereka itu adalah sejahat-jahat makhluk. Allah telah mem-beri mereka peringatan, tetapi mereka enggan mengindahkannya. Dia tidak akan menyiksa seseorang kecuali setelah memberinya peringatan. 7. Sungguh, orang-orang yang beriman kepada Allah dan rasulnya dengan iman yang benar dan mengerjakan kebajikan dengan ikhlas dan sesuai ketetentuan syariat, mereka itu adalah sebaik-baik makhluk. Mereka adalah makhluk yang Allah kehendaki untuk menjadi khalifah di bumi."
  }
]