[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Balasan mereka disi tuhan mereka pada hari kiamat adalah surga-surga sebagai tempat tinggal yang sangat indah, mengalir dibawah istana-istana dan kebun-kebunnya sungai-sungai, mereka kekal di dalam selama-lamanya. Allah ridha kepada mereka dengan menerima amal-amal shalih mereka, dan mereka ridho terhadap apa yang disiapkan bagi mereka berupa berbagai bentuk kemuliaan. Balasan baik ini adalah bagi siapa yang takut kepada Allah dan menjauihi kemaksiatan kepadaNYA."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Balasan mereka di sisi Rabb mereka adalah surga-surga yang dari bawah istana-istana dan pepohonannya mengalir sungai-sungai, mereka menetap di dalamnya selama-lamanya. Allah rida pada mereka karena mereka beriman kepada-Nya dan menaati-Nya, dan mereka pun rida pada Allah karena rahmat yang Allah berikan kepada mereka. Rahmat ini hanya didapat oleh orang yang takut kepada Rabbnya dengan mematuhi perintah-Nya dan menjauhi larangan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. جَزَآؤُهُمْ عِندَ رَبِّهِمْ (Balasan mereka di sisi Tuhan mereka) Sebagai balasan atas keimanan dan amal shalih yang telah mereka lakukan. جَنّٰتُ عَدْنٍ تَجْرِى مِن تَحْتِهَا الْأَنْهٰرُ(surga ‘Adn yang mengalir di bawahnya sungai-sungai) Yakni dari bawah popohonan dan kamar-kamarnya. خٰلِدِينَ فِيهَآ أَبَدًا (mereka kekal di dalamnya selama-lamanya) Yakni mereka tidak akan keluar darinya dan tidak akan mati."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8. Pahala mereka di sisi Tuhan pada hari kiamat atas keimanan dan amal shalih mereka adalah surga-surga yang akan mereka tempati. Dan digunakanlah nama {‘Adn} sebagai nama salah satu surga. Sungguh mereka abadi di sana. Sungai-sungai mengalir di bawah ruang-ruang dan kebun-kebunnya. Mereka tinggal di dalamnya selama-lamanya. Allah meridhai mereka, dan itulah sebaik-baik balasan karena telah menaati perintahNya, meridhai balasanNya dan merasa senang dengan hal itu. Itulah balasan yang baik bagi orang yang takut dengan kedudukan Tuhannya dalam setiap amal perbuatan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Balasan mereka} pahala mereka {di sisi Tuhan mereka ialah surga ’Adn} yang akan didiami selamanya {yang mengalir di bawahnya sungai-sungai; mereka kekal di dalamnya selama-lamanya. Allah ridha terhadap mereka dan mereka pun ridha kepadaNya. Yang demikian itu adalah bagi orang yang takut kepada Tuhannya} takut kepada Tuhannya sehingga dia melaksanakan perintahNya dan menjauhi laranganNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8. “Balasan mereka di sisi Rabb mereka ialah Surga ‘And,” yaitu surga tempat tinggal yang tidak akan ada pergi dan berpindah serta tidak ada lagi permintaan (untuk lebih dari itu) di atasnya, “yang mengalir di bawahnya sungai-sungai; mereka kekal di dalamnya selama-lamanya. Allah ridha terhadap mereka dan mereka pun ridha kepadaNya.” Allah ridha kepada mereka atas amal perbuatan baik yang pernah mereka lakukan dan mereka ridha kepadaNya karena berbagai kemuliaan dan pahala besar yang disediakan untuk mereka. “Yang demikian itu,” balasan yang baik itu “adalah (balasan) bagi orang yang takut kepada Rabbnya,” yakni untuk orang yang takut kepada Allah sehingga ia menahan diri dari berbagai kemaksiatan dan menunaikan apa yang diwajibkan padanya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ جَزَاؤُهُمْ عِنْدَ رَبِّهِمْ } Maka balasan mereka disisi tuhan mereka { جَنَّاتُ } adalah surga-surga, bukan hanya satu surga, akan tetapi surga yang banyak, { عَدْنٍ } surga-surga itu sebagai tempat tinggal mereka, dan mereka tidak akan pergi dari tempat itu, dan tidak pula mereka akan dikeluarkan selamanya, tempat tinggal yang penuh dengan kenkmatan dan kebahagiaan. { تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ } Dari bawah istana-istananya, dan pohon-pohonnya mengalir sungai-sungai yang sangat bagus airnya dan enak untuk diminum. { خَالِدِينَ فِيهَا أَبَدًا ۖ } Mereka kekal tinggal didalamnya, mereka tidak akan terkena dan merasakan sakit apapun, tiada kematian didalamnya, dan tidak pula ada kesedihan dan kegundahan, segalanya penuh dengan kesenangan dan kebahagiaan. { رَضِيَ اللَّهُ عَنْهُمْ } Allah ridho dengan mereka, da ini adalah kenikmatan yang lebih besar dari surga itu sendiri, Allah - عز وجل - berfirman : { وَرِضْوَانٌ مِنَ اللَّهِ أَكْبَرُ } ( Dan keridhaan Allah adalah lebih besar ) [ At-Taubah ; 72 ] . { وَرَضُوا عَنْهُ ۚ } Dan mereka pun ridho dengan tuhan mereka atas apa yang telah mereka nikmati dari perhiasan dan kenikmatan surga. { ذَٰلِكَ لِمَنْ خَشِيَ رَبَّهُ } Balasan yang baik hanyalah untuk orang-orang yang takut kepada tuhannya, serta takut kepada-Nya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Kemudian Allah menjelaskan balasan pahala mereka, Allah berfirman: جَزَاؤُهُمْ عِنْدَ رَبِّهِمْ جَنَّاتُ عَدْنٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ \" Balasan mereka di sisi Tuhan mereka ialah surga Adn yang mengalir di bawahnya sungai-sungai \" Di ayat ini Allah memdahulukan pujian kepada orang-orang mukmin yang beramal saleh dari penyebutan balasan untuk mereka, karena pujian Allah kepada mereka adalah tingkatan termulia dan suatu keutaamaan tertinggi, oleh karenanya Allah mendahulukan penyebutan pujian-Nya daripada balasan yang akan diberikan kepada mereka di hari kiamat. جَزَاؤُهُمْ عِنْدَ رَبِّهِمْ جَنَّاتُ عَدْنٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ \" Balasan mereka di sisi Tuhan mereka ialah surga Adn yang mengalir di bawahnya sungai-sungai \" جَنَّاتُ \"Surga-surga\" disebutkan dengan jamak karena banyak macamnya, karena Nabi shallallaahu 'alaihi wa sallam bersabda sesungguhnya surga-surga: جَنَّتَانِ مِنْ ذَهَبٍ آنِيَتُهَا وَمَا فِيْهَا، وَجَنَّتَانِ مِنْ فِضَّةٍ آنِيَتُهَا وَمَا فِيهَا \" ada dua surga dari emas, bejana-bejana dan apa-apa yang ada di dalamnya, dan ada dua surga dari perak, bejana-bejana dan apa-apa yang ada di dalamnya \"(1) Allah mengisyaratkan tentang hal ini dalam firman-Nya: وَلِمَنْ خَافَ مَقَامَ رَبِّهِ جَنَّتَانِ \"Dan bagi orang yang takut akan saat menghadap Tuhannya ada dua surga.\"(QS. Ar-Rahman: 46) kemudian Allah menyebutkan sifat-sifat kedua surga itu, Allah berfirman: وَمِنْ دُونِهِمَا جَنَّتَانِ \"Dan selain dari dua surga itu ada dua surga lagi. \"(QS. Ar-Rahman: 62) Mereka memperoleh surga-surga, dan surga-surga yang Allah Ta'ala sebutkan sebgai balasan bagi orang-orang beriman dan orang-orang yang beramal saleh adalah berita tentang tempat-tempat yang agung yang Allah 'Azza Wa Jalla siapkan untuk orang-orang yang beriaman lagi bertaqwa, di dalamnya terdapat kenikmatan yang tidak pernah dilihat mata, didengar telinga dan tidak pernah terbersit pada hati seorang manusia. Tidak mungkin seorang insan pun membayangkan bagaimana nikmatnya negeri akhirat selamanya, karena kenikmatannya lebih tinggi dan lebih besar dari yang kita bayangkan, Ibnu Abbas radhiyallaahu 'anhuma mengatakan: \"Tidak ada suatu yang ada di surga dari apa yang ada dunia melainkan hanya sekedar nama-nama saja\" tapi hakikat-hakikatnya berbeda dengan perbedaan yang besar. Allah 'Azza Wa Jalla berfirman: جَنَّاتُ عَدْنٍ \" ialah surga Adn \" Adn bermakna menetap dalam sebuah tempat dan tidak keluar darinya, dan di antara kesempurnaan kenikmatan ahli surga, setiap mereka tidak meminta dipindahkan dari kenikmatan yang diperoleh ke tempat lain, karena dia tidak melihat seorang pun yang mendapatkan kenikmatan melebih dirinya, dan ia tidak merasakan iri jika dibandingkan dengan yang lebih tinggi dan sempurna darinya, Allah Tabaraka wa Ta'ala berfirman: لَا يَبْغُونَ عَنْهَا حِوَلًا \" mereka tidak ingin berpindah daripadanya. \"(QS. Al-Kahfi: 108) Maknanya: Mereka tidak akan meminta pindah dari kenikmatan yang telah mereka dapatkan, karena Allah telah memberikan kepuasan kepada mereka dengan kenikmatan yang telah diberikan kepada mereka, mereka tidak akan mendapatkan seorang pun yang lebih sempurna kenikmatannya dari mereka. Oleh karenanya Allah Ta'ala memberi nama surga-surga ini dengan surga Adn. مِنْ تَحْتِهَا الْأَنْهَارُ \" yang mengalir di bawahnya sungai-sungai \" Di bawahnya, Para ulama mengatakan: Di bawah istana-sitana dan pohon-pohonnya, jika tidak, maka dia berada di pinggirannya bukan di bawahnya, ia terletak di bawah istana-istana dan pohon pohon. Sungai-sungai itu yang Allah'azza Wa Jalla sebutkan di sini secara global, Allah rinci sifatnya dalam surat Muhammad, Allah berfirman: مَثَلُ الْجَنَّةِ الَّتِي وُعِدَ الْمُتَّقُونَ فِيهَا أَنْهَارٌ مِنْ مَاءٍ غَيْرِ آسِنٍ وَأَنْهَارٌ مِنْ لَبَنٍ لَمْ يَتَغَيَّرْ طَعْمُهُ وَأَنْهَارٌ مِنْ خَمْرٍ لَذَّةٍ لِلشَّارِبِينَ وَأَنْهَارٌ مِنْ عَسَلٍ مُصَفًّى \" (Apakah) perumpamaan (penghuni) surga yang dijanjikan kepada orang-orang yang bertakwa yang di dalamnya ada sungai-sungai dari air yang tiada berubah rasa dan baunya, sungai-sungai dari air susu yang tiada berubah rasanya, sungai-sungai dari khamar (arak) yang lezat rasanya bagi peminumnya dan sungai-sungai dari madu yang disaring \"(QS. Muhammad: 15) Dan telah datang berita dari atsar-atsar yang menjelaskan bahwa surga-surga itu mengalir tanpa aliran dan parit-parit, artinya bahwa sungai tersebut mengalir di atas tanah, alirannya mengarah sesuai keinginan manusia, tidak perlu menggali parit, dan tidak perlu membuat saluran-saluran pipa yang menahan airnya agar tidak meluap kekanan atau kekiri. Dalam hal ini, Ibnul Qayim rahimahullah mengatakan dalam kitab nuniyahnya: أَنْهَارُهَا مِنْ غَيْرِ أُخْدُودٍ جَرَتْ سُبْحَانَ مُمْسِكِهَا عَنِ الْفَيْضَانِ Sungai-sungai surga tanpa saluran ia mengalir Maha suci Allah yang menahannya tidak tumpah (kemana-mana) خَالِدِينَ فِيهَا أَبَدًا \"Mereka kekal di dalamnya selamanya\" Maknanya: mereka menetap di dalamnya selamanya, tidak akan mati, tidak akan sakit, tidak mendapat kesulitan, tidak merasakan sakit, tidak merasakan sedih, tidak akan tersentuh oleh himpitan, mereka berada di kenikmatan yang paling sempurna, selalu, selama-lamanya. رَضِيَ اللَّهُ عَنْهُمْ وَرَضُوا عَنْهُ \" Allah rida terhadap mereka dan mereka pun rida kepada-Nya.\" Ini adalah kenikmatan tersempurna, yaitu bahwa Allah Ta'ala ridha terhadapa mereka sehingga halal bagi mereka memperoleh kridhaan Allah, Allah tidak akan membenci setelah itu selamanya, bahkan mereka akan melihat Allah'Azza Wa Jalla dengan mata mereka sendiri, layaknya melihat rembulan di malam purnama, mereka tidak meragukan akan hal ini, mereka tidak bimbang, dan mereka tidak berdesak-desakan saat melihat Allah, tetapi setiap manusia akan melihat Allah di tempatnya sendiri sesuai dengan kehendak Allah 'Azza Wa Jalla. Kemudian Allah 'Azza Wa Jalla: ذَلِكَ لِمَنْ خَشِيَ رَبَّهُ \" Yang demikian itu adalah (balasan) bagi orang yang takut kepada Tuhannya.\" Maknanya: balasan tersebut diperuntukkan bagi orang takut kepada Allah 'Azza Wa Jalla. Al-Khasy-yah adalah khauf (takut) kepada Allah 'Azza Wa Jalla yang disertai dengan kewibawaan, pengagungan kepadanya, dan ini tidak akan terjadi kecuali pada orang yang mengenal Allah, sebagai mana Allah Ta'ala berfirman: إِنَّمَا يَخْشَى اللَّهَ مِنْ عِبَادِهِ الْعُلَمَاءُ إِنَّ اللَّهَ عَزِيزٌ غَفُورٌ \" Sesungguhnya yang takut kepada Allah di antara hamba-hamba-Nya, hanyalah ulama. Sesungguhnya Allah Maha perkasa lagi Maha Pengampun.\"(QS. Fatir: 28) maknanya: Para ulama (takut) dengan keagungan dan kesempurnaan kuasa-Nya, takut (khasy-yah) lebih khusus (istimewa) dari takut (khauf). Akan jelas perbedaan keduanya dengan contoh: Jika anda takut pada seseorang, anda tidak tahu apah orang itu mampu menguasai anda atau tidak, ini adalah khauf. Dan jika anda takut pada seseorang yang anda tahu bahwa ia mampu menguasai anda maka ini adalah khasy-yah. Dengan ini, maka selesailah surat ini dan selesai juga tafsirnya yang dimudahkan bagi kami dalam membahasnya. Kita memintak kepada Allah agar menjadikan kita termasuk orang yang mengikuti kitabullah dengan sebaik-baiknya, sesungguhnya Dia Maha kuasa atas segala sesuatu. (1) Dikeluarkan Bukhari (4878) dan Muslim (180) dari hadits Abu Musa al-Asy'ariy radhiyallaahu 'anhu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Bayyinah ayat 8: 7-8. Setelah Allah menjelaskan balasan orang-orang kafir di akhirat, Allah menjelaskan tentang orang-orang yang beriman. Dan Ia kabarkan mereka yang membenarkan Allah dan mengikuti Rasul ﷺ dan beramal dengan amalan yang shalih, mereka adalah sebaik-baik ciptaan di dunia dan akhirat, mereka adalah orang yang berhak mendapat karunia Allah, dan oleh karena itu balasan mereka ada di sisi Penciptanya, mereka di akhirat mendapat surga yang mengalir di bawah kamar-kamar dan pepohonan mereka sungai-sungai, dan mereka menempati kenikmatan ini selama-lamanya. Tidak akan terputus (kenikmatan) yang di dapatkan mereka selamanya. Allah ridha dengan mereka dan kepada amalan shalih yang mereka kerjakan sebelumnya (di dunia), dan mereka juga ridha kepada Tuhannya atas kenikmatan dan tempat tinggal yang diberikan kepada mereka. Kemudian Allah menjelaskan bahwa balasan dan ganjaran yang baik ini diberikan bagi mereka yang takut kepada Allah, dan menjauhi apa yang membuatnya murka dari kekafiran dan kesyirikan serta dosa dan maksiat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala ridha kepada mereka karena mereka mengerjakan hal-hal yang diridhai-Nya, dan mereka pun ridha kepada-Nya karena Dia telah menyediakan untuk mereka berbagai kenikmatan dan pahala yang besar. Yakni takut kepada azab Tuhannya, sehingga ia berhenti dari mendurhakai-Nya dan beralih mengerjakan kewajibannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Bayyinah Ayat 8",
    "description": "Balasan mereka di sisi tuhan mereka ialah surga 'adn yang mengalir di bawahnya sungai-sungai; mereka kekal di dalamnya selama-lamanya bersama segala kenikmatan di dalamnya. Selain itu, mereka mendapat nikmat yang lebih besar. Allah rida terhadap mereka atas keimanan dan amal saleh mereka dan mereka pun rida kepada-Nya atas kemuliaan yang Allah anugerahkan kepada mereka. Yang demikian itu adalah balasan yang agung bagi orang yang takut kepada tuhannya. Ketakutannya pada siksaan Allah mendorongnya untuk menjauhkan diri dari larangan Allah, termasuk kemusyrikan dan kekafiran. 1-3. Banyak kejadian dahsyat yang terjadi di bumi ketika kiamat tiba. Apabila bumi diguncangkan oleh malaikat atas perintah Allah dengan guncangan yang dahsyat setelah israfil meniupkan sangkakala pertama, dan bumi telah mengeluarkan beban-beban berat yang dikandung-Nya, baik kekayaan yang ada di dalamnya atau mayat-mayat yang terkubur, dan pada saat itu manusia bertanya dengan penuh kekalutan dan ketakutan, 'apa yang terjadi pada bumi ini' mengapa bumi berguncang sedemikian dahsyat dan mengeluarkan apa saja yang dikandungnya' apakah ini hari kiamat''."
  }
]