[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-2 (haamim. ain sin qaf) pembicaraan tentang huruf-huruf yang terpisah-pisah (seperti ini) telah hadir di awal surat al-baqarah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1, 2. Ḥā Mīm. 'Aīn Sīn Qāf. Pembahasan tentang huruf-huruf semacam ini sudah ada di awal surah Al-Baqarah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1-2. Pada awal surat al-Baqarah telah dijelaskan tentang huruf muqattha’ah, dan hikmah dari penyebutan huruf muqattha’ah ini adalah untuk menjelaskan sisi mukjizat al-Qur’an."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1-2. عٓسٓقٓ حمٓ (Haa Miim. ‘Ain Siin Qaaf) Telah disebutkan penjelasan tentang huruf-huruf muqattha’ah pada awal surat seperti ini di awal surat al-Baqarah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "1-2. Ha’, Mim, ‘Ain, Sin, Qaf. Potongan-potongan huruf ini berfungsi untuk memberi perhatian pada kalimat setelahnya dan menantang orang Arab untuk menghadirkan sesuatu yang serupa dengan Al-Qur’an selama itu tersusun dari huruf-huruf Arab yang merupakan huruf dalam bahasa mereka ini."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ḥā Mīm"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-5. Allah menyampaikan bahwasanya Dia mewahyukan al-Quran agung ini kepada Nabi yang mulia sebagaimana Dia telah mewahyukan kepada para nabi dan rasul sebelum beliau. Dalam berita ini terdapat karuniaNya berupa penurunan kitab-kitab suci dan pengutusan para rasul di masa dahulu dan berikutnya, dan bahwa sesungguhnya Nabi Muahammad bukanlah rasul pertama, dan bahwa sesungguhnya jalan yang ia tempuh adalah jalan para rasul sebelum beliau, dan kondisi-kondisinya pun sama dengan kondisi-kondisi para rasul sebelum beliau, dana pa yang belia bawa (yaitu ajaran) serupa dengan ajaran yang mereka bawa. Sebab semuanya adalah benar dan kebenaran, yaitu diturunkan dari Tuhan Yang menyandang sifat ketuhanan (uluhiyah), keperkasaan agung, kebijaksanaan sempurna, seluruh alam atas dana lam bawah adalah kerajaanNya dan berada di bawah kendaliNya, baik secara takdir maupun syar’i, Dan sesungguhnya Dia “Yang Mahatingggi,” dzat, kemuliaan, dan keperkasaanNya, “lagi Mahabesar,” yang karena kebesaranNya, “hampir saja langit itu pecah dari sebelah atasnya,” padahal keduanya sangat luar biasa besarnya dan keduanya adalah benda mati. “Dan malaikat-malaikat,” yang mulia lagi didekatkan, tunduk kepada keagunganNya dan bersikap hina dina karena keperkasaanNya, patuh kepada RububiyahNya. “mereka bertasbih dengan memuji Rabbnya,” mereka mengagungkanNya dari segala kekurangan dan menyifatiNya dengan segala sifat kesempurnaan, “dan memohonkan ampun bagi orang-orang yang ada di bumi,” dari hal-hal yang timbul dari mereka, yaitu segala apa yang tidak layak dengan keagungan dan kebesaran Allah, padahal Dia “Yang Maha Pengampun lagi Maha Penyayang,” yang kalau saja bukan karena ampunan dan rahmatNya, tentu Dia segera menimpakan hukuman yang membinasakan terhadap manusia. Di dalam pengungkapan terhadap Allah dengan sifat-sifat tersebut di atas setelah Dia menjelaskan bahwasanya Dia telah mewahyukan kepada para rasul pada umumnya dan kepada Nabi Muhammad pada khususnya, terdapat sebuah isyarat bahwa al-Quran al-Karim ini mengandung dalil-dalil dan argument-argumen serta ayat-ayat yang membuktikan akan kesempurnaan Sang Pencipta, Allah, dan pengungkapan tentang Allah dengan nama-nama yang agung yang menyebabkan hati penuh dengan ma’rifat, kecintaan, pengagungan, penghormatan dan pemuliaan kepadaNya serta memusatkan segala bentuk penghambaan lahir dan batin hanya kepadaNya. Dan sesungguhnya kezhaliman yang paling besar dan perkataan (keyakinan) yang paling keji adalah pengangkatan sembahan-sembahan selain Allah, yang mereka sama sekali tidak memiliki kuasa memberikan manfaat ataupun menimpakan bahaya, melainkan mereka adalah makhluk yang bergantung kepada Allah dalam seluruh kondisi dan perihal mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syura ayat 1: (Haa Miim), ('Ain Siin Qaaf) kedua ayat ini hanya Allahlah yang mengetahui arti dan maksudnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syura Ayat 1",
    "description": "Hanya Allah yang lebih tahu tentang makna h' m'm2. Hanya Allah pula yang lebih tahu tentang makna 'a'n s'n q'f."
  }
]