[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "perkara apapun yang kalian perselisihkan dalam agama kalian (wahai manusia) maka hukumnya dikembalikan kepada Allah dalam kitab-kitabNya dan sunnah rasulNya. itulah Allah, tuhanku dan tuhan kalian. hanya kepadaNya semata aku bertawakal dalam segala urusanku dan hanya kepadaNya lah aku mengembalikan seluruh urusanku."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Dan apa saja yang kalian perselisihkan -wahai manusia- baik itu dalam masalah pokok agama kalian atau cabang-cabangnya, maka keputusannya kembali kepada Allah, yaitu dengan mengembalikannya kepada Kitab-Nya dan sunnah Rasul-Nya -ṣallallāhu 'alaihi wa sallam-. Dan Żat yang mempunyai sifat sedemikian ini adalah Rabbku, kepada-Nya aku menyandarkan segala urusanku dan kepada-Nya aku bertobat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "10. Hai para hamba, perkara-perkara agama yang kalian perselisihkan, maka ketetapannya kembali pada Allah dalam kitab-Nya dan sunnah rasul-Nya. Allah Yang Maha Agung adalah Tuhankku dan Tuhan kalian; hanya kepada-Nya aku menyerahkan urusan dan perkaraku."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. وَمَا اخْتَلَفْتُمْ فِيهِ مِن شَىْءٍ فَحُكْمُهُۥٓ إِلَى اللهِ ۚ (Tentang sesuatu apapun kamu berselisih, maka putusannya (terserah) kepada Allah) Yakni segala sesuatu yang diperselisihkan para hamba Allah dalam perkara agama, maka hukum dan ketetapannya kembali kepada Allah. Allah akan memutuskan perselisihan tersebut pada hari kiamat dengan keputusan-Nya, ketika itu jelaslah siapa yang benar dan siapa yang salah, dan para penghuni surga akan dipisahkan dari para penghuni neraka. ذٰلِكُمُ((Yang mempunyai sifat-sifat demikian) itu) Yakni Dzat yang memutuskan perkara tersebut. اللهُ رَبِّى عَلَيْهِ تَوَكَّلْتُ(adalah Allah Tuhanku. Kepada-Nya lah aku bertawakkal) Yakni katakanlah hai Muhammad, aku bersandar kepada Allah semata pada setiap urusanku, dan hanya kepada-Nya aku serahkan urusanku. وَإِلَيْهِ أُنِيبُ(dan kepada-Nya-lah aku kembali) Yakni hanya kepada-Nya aku kembali dengan bertaubat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10. Terkait sesuatu dalam urusan agama yang kalian pertentangkan, maka hukumnya diserahkan kepada Allah. Dialah Dzat yang menghakiminya dengan benar dan adil pada hari kiamat. Itulah Dzat yang Maha Bijaksana dalam segala sesuatu. Dialah Tuhanku, Allah. KepadaNyalah kusandarkan segala urusanku, bukan kepada selainNya. Dan Hanya kepadaNyalah aku kembali sebagai orang yang bertaubat dan meminta pertolongan atas setiap urusan serta berlindung dari setiap keburukan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apa yang kalian perselisihkan, keputusannya itu kepada Allah. Itulah Allah Tuhanku. Hanya kepadaNya aku bertawakal dan hanya kepadaNya aku kembali} Hanya kepada Allah aku mengembalikan segala urusanku"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "10. Allah berfirman, “Tentang sesuatu apa pun kamu berselisih,” baik dalam masalah prinsip-prinsip agama kalian atau cabang-cabangnya yang kalian belum menyepakatinya, “maka keputusanya kepada Allah,” artinya harus di kembalikan kepda al-Qur’an dan Hadist RasulNya. Dan apa pun ketentuan al-Qur’an dan hadist itu, maka itulah yang benar, dana pa pun yang menyalahi keduanya, itulah yang bathil. “Itulah Allah Rabbku,” maksudnya, karena Allah adalah Rabb pencipta, Pemberi rezeki dan pengatur, maka dia-lah hakim (pemberi keputusan) di antara hamba-hambaNya melalui syari’atNya dalam segala urusan mereka. Pengertian (mafhum) dalam ayat suci ini adalah bahwa”kesepakatan umat islam itu adalah hujjah yang pasti,”Sebab Allah tidak menyuruh kita mengembalikanya kecuali hal-hal yang kita perselisihkan. Sedangkan apa yang telah kita sepakati cukup menjadi kesepakatan umat, sebab umat islam itu terjaga dari kekeliruan, dan sudah pasti kesepakatan mereka tersebut sudah sejalan dengan ajaran yang ada di dalam al-Qr’aun dan Hadist Rasululloh. FirmanNya,”KepadaNya-lah aku bertawakal,” artinya, aku menyandarkan diri dengan hatiku kepadaNya dalam mencari kebaikan dan menolak keburukan dengan yakin kepdaNya dalam pemberian pertolongaNya,”dan kepadanyalah aku kembali,” artinya, aku menghadapkan diri dengan jiwa dan ragaku kepadaNya dan dengan taat dan ibadah kepadaNya. Dua prinsip ini sering di sebut oleh Allah di dalam kitabNya. Sebab, dengan keduanya kesempurnaan seorang hamba dapat dicapai. Dan kesempurnaan tidak dapat ia raih dengan ketiadaan dua prinsip ini atau ketiadaan salah satunya. Sama seperti Firman Allah,”Hanya kepadaMu kami menyembah dan hanya kepadaMu kami meminta pertolongan,” dan juga firmanNya, “Maka beribadahlah kalian kepadanya dan bertawakallah kepadaNya.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syura ayat 10: (Dan apa yang kalian perselisihkan) dengan orang-orang kafir (tentang sesuatu perkara) yang menyangkut masalah agama dan masalah-masalah lainnya (maka putusannya) dikembalikan (kepada Allah) kelak di hari kiamat yaitu Dia akan memutuskan perkara itu di antara kalian. Katakanlah kepada mereka, (\"Itulah Allah, Rabbku, kepada-Nyalah aku bertawakal dan kepada-Nyalah aku kembali) yakni dikembalikan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Tentang ushul (masalah pokok) maupun furu’ (masalah cabang) yang kamu tidak bersepakat di sana.. Yakni dikembalikan kepada kitab Allah dan sunnah Rasul-Nya, yang dihukuminya adalah hak dan yang menyelisihinya adalah batil. Mafhum ayat ini adalah bahwa kesepakatan umat merupakan hujjah yang qath’i (pasti), karena Allah tidak memerintahkan kita mengembalikan kepada-Nya kecuali jika kita berselisih, sehingga dalam hal yang kita sepakati, maka sudah cukup dengan kesepakatan umat, dan bahwa ia terpelihara dari kesalahan. Namun demikian, kesepakatannya harus sesuai dengan yang ada dalam kitabullah dan sunnah Rasul-Nya. Ada pula yang menafsirkan, bahwa apa pun yang kamu perselisihkan dengan orang kafir, maka keputusan-Nya diserahkan kepada Allah pada hari Kiamat, yakni Dia akan memutuskannya di antara kamu pada hari itu. Yakni oleh karena Allah adalah Ar Rabb; Pencipta, Pemberi rezeki, dan pengatur, maka Allah pula yang memberikan keputusan di antara hamba-hamba-Nya dengan keputusan qadari-Nya, syar’i-Nya dan jaza’i(pembalasan)-Nya. Yakni aku bersandar kepada-Nya dalam mendatangkan manfaat dan menolak madharat serta percaya kepada-Nya bahwa Dia akan memberikan pertolongan. Yakni menghadap, baik dengan hatiku maupun badanku serta taat dan beribadah kepada-Nya. Syaikh As Sa’diy berkata, “Kedua hal ini merupakan dasar yang sering disebut Allah dalam kitab-Nya, karena dengan berkumpulnya keduanya tercapailah kesempurnaan pada seorang hamba, dan kesempurnaan itu akan hilang ketika keduanya hilang atau salah satunya, sebagaimana firman Allah Ta’ala, “Iyyaaka na’budu wa iyyaka nasta’iin” (Hanya kepada-Mu kami menyembah dan hanya kepada-Mu kami memohon pertolongan), demikian pula firman-Nya, “Fa’bud-hu wa tawakkal ‘alaih.” (Maka sembahlah Dia dan bertawakkallah kepada-Nya)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syura Ayat 10",
    "description": "Allah menyatakan kepada seluruh manusia, 'dan apa pun yang kamu perselisihkan padanya tentang sesuatu, termasuk di dalamnya tentang terjadinya kiamat itu, keputusannya terserah kepada Allah karena yang mengetahui tentang semua itu hanyalah dia. Lalu Allah memerintahkan kepada nabi Muhammad untuk menyatakan bahwa yang memiliki sifat-sifat demikian itulah Allah, yang maha esa, tidak ada sekutu bagi-Nya, maha mengetahui tentang segala sesuatu, mahaagung, dan mahakuasa. Dialah tuhanku, pemelihara, pembimbing dan pelindung-ku. Kepada-Nya aku terus-menerus bertawakal dan berserah diri dan kepada-Nya aku terus-menerus kembali untuk bertobat. 11. Dialah, Allah, pencipta langit dengan segala keindahannya dan pencipta bumi tanpa ada contoh sebelumnya dan dia pula yang menciptakan segala isi yang ada pada keduanya, termasuk makhluk-makhluk yang menghuninya. Dia menjadikan bagi kamu pasangan-pasangan dari jenis kamu sendiri, yaitu pasangan laki-laki sebagai suami dan perempuan sebagai istri dan menjadikan pula dari jenis hewan ternak pasangan-pasangan bagi masing-masing binatang, ada jantan dan ada betina dan dengan berpasangan itu mereka dapat melanjutkan keturunannya. Dijadikan-Nya kamu berkembang biak dan dapat melanjutkan keturunanmu dengan jalan berpasang-pasangan itu. Tidak ada sesuatu pun dari semua makhluk yang telah diciptakan-Nya itu yang serupa dengan dia dalam zat dan segala sifat dan perbuatan-Nya. Dia suci dari pasangan. Dan dia yang maha mendengar segala yang kamu katakan, maupun yang terlintas dalam pikiranmu, maha melihat segala yang kamu lakukan, baik secara terangan-terangan maupun sembunyi-sembunyi."
  }
]