[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah adalah pencipta langit dan bumi dan pembuat keduanya dengan kuasa, kehendak dan hikmahNya, dan Dia menjadikan pasangan-pasangan dari jenis kalian sendiri agar kalian merasa tenang kepadanya. Dia menjadikan hewan ternak berpasangan-pasangan, jantan dan betina. Dia memperbanyak bilangan kalian melalui pernikahan dan kelahiran. Tidak ada satupun makhluk Allah yang menyerupai dan menandingiNya, tidak pada dzatNya, tidak pada nama-namaNya, tidak pada sifat-sifat-Nya dan tidak pada perbuatan-Nya, karena seluruh nama-nama-Nya adalah husna (paling baik), dan sifat-sifat-Nya adalah sifat-sifat kesempurnaan dan keagungan, dan dengan perbuatan-perbuatan-Nya Dia menciptakan makhluk-makhluk yang besar dan tidak ada yang ikut serta bersama-Nya. Dia maha mendengar lagi maha melihat, tidak sedikitpun dari perbuatan dan perkataan hamba-hamba-Nya yang samar bagi-Nya dan Dia akan membalas mereka atasnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Allah pencipta langit dan pencipta bumi tanpa ada contoh sebelumnya, Dia menciptakan dari diri kalian berpasang-pasangan dan menciptakan untuk kalian unta, sapi dan kambing berpasang-pasangan hingga hewan-hewan ini berkembang biak untuk kalian. Dia menciptakan kalian dengan pasangan-pasangan untuk kalian dengan cara pernikahan dan memberi kehidupan kepada kalian dengan menjadikan dari hewan-hewan ternak kalian hasil dagingnya dan susunya. Tidak ada dari makhluk-Nya yang menyerupai-Nya. Dia Maha Mendengar ucapan-ucapan hamba-hamba-Nya dan Maha Melihat segala perbuatan mereka. Tidak ada sesuatu pun yang luput dari-Nya dan Dia akan membalas segala amal mereka; jika baik maka akan mendapat ganjaran baik, bila buruk maka akan mendapat ganjaran buruk."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "11-12. Dia Pencipta tujuh langit dan bumi, menciptakan bagi kalian pasangan bagi laki-laki dan perempuan agar kalian kalian merasakan ketentraman padanya, juga menciptakan bagi kalian unta, sapi, dan kambing yang berpasang-pasangan. Dia menjadikan kalian berkembang biak dan menyebar ke berbagai tempat. Tidak ada makhluk yang serupa dengan-Nya; Dia Maha Mendengar seluruh perkataan dan Maha Melihat segala kejadian. Dia Pemilik kerajaan tujuh langit dan bumi. Dia melapangkan dan menyempitkan rezeki hamba-hamba-Nya sesuai kehendak-Nya. Dia Maha Mengetahui segalanya, tidak ada yang tersembunyi dari-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "11. فَاطِرُ السَّمٰوٰتِ وَالْأَرْضِ ۚ ((Dia) Pencipta langit dan bumi) Yakni Allah yang menciptakan dan mengadakan keduanya dari ketidakadaan. جَعَلَ لَكُم مِّنْ أَنفُسِكُمْ أَزْوٰجًا(Dia menjadikan bagi kamu dari jenis kamu sendiri pasangan-pasangan) Yakni Allah menciptakan bagi kalian wanita dari jenis kalian. وَمِنَ الْأَنْعٰمِ أَزْوٰجًا ۖ (dan dari jenis binatang ternak pasangan-pasangan (pula)) Dan Allah menciptakan bagi kalian hewan-hewan ternak berbagai jenis jantan dan betina. Yakni delapan pasang hewan ternak yang disebutkan dalam surat al-An’am. يَذْرَؤُكُمْ فِيهِ ۚ( dijadikan-Nya kamu berkembang biak dengan jalan itu) Yakni Allah memperbanyak kalian dengan menjadikan kalian berpasang-pasangan laki-laki dan perempuan, karena itu merupakan sebab memperoleh keturunan. لَيسَ كَمِثْلِهِۦ شَىْءٌ ۖ( Tidak ada sesuatupun yang serupa dengan Dia) Yakni makhluk-makhluk-Nya tidak akan menandingi-Nya dalam hikmah, kekuasaan, dan ilmu-Nya. Allah memuji diri-Nya lewat hal ini sebagai penunjuk kepada hikmah-Nya dalam memperbanyak makhluk hidup di bumi dengan cara perkawinan. وَهُوَ السَّمِيعُ (dan Dialah yang Maha Mendengar) Segala suara. الْبَصِيرُ (dan Maha Melihat) Segala kejadian. Oleh sebab itu Allah menciptakan hal-hal tersebut dengan hikmah. Dan Allah Maha Melihat setiap makhluk baik itu yang kecil maupun yang besar, yang terlihat maupun yang tersembunyi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Dialah Sang Pencipta langit dan bumi yang tidak ada contohnya sebelumnya. Dia menciptakan wanita dari golongan kalian. Dia juga menciptakan hewan-hewan ternak (unta, sapi, dan kambing) berpasang-pasang juga. Dzat yang memperbanyak kalian melalui sistem ini. Dia juga menyebar luaskan kalian melalui sistem berpasangan antara dua jenis yang merupakan penyebab banyaknya keturunan. Tiada yang dapat menyerupai Allah baik Dzat maupun SifatNya. Dialah Dzat yang Maha Mendengarkan segala suara. Dzat yang Maha Melihat segala sesuatu, baik kecil maupun besar"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Pencipta} Pencipta dan pembuat pertama kali {langit dan bumi. Dia menjadikan pasangan-pasangan} pasangan-pasangan baik laki-laki dan perempuan {bagi kalian dari jenis kalian dan dari jenis hewan ternak pasangan-pasangan. Dia menjadikan kalian berkembang biak dengan itu} Dia menciptakan dan memperbanyak kalian dengan berpasangan itu {Tidak ada sesuatu pun yang serupa denganNya. Dia Maha Mendengar lagi Maha Melihat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11. ”Pencipta langit dan Bumi,” maksudnya, Pembuatan keduanya dengan Kuasan Kehendak, dan kebijaksanaaNya, “Dia menjadikan bagi kamu dari jeniskamu sendiri pasang-pasang,” agar kalian merasakan ketentraman kepadanya dan berkembang biak dari kalian anak keturunan dan kalian memperoleh banyak keuntungan “dan dari jenis binatang ternak pasangan –pasangan pula,” dan dari jenis dua macam: Jantan dan betina, agar dia tetap tersisa dan berkembang biak untuk kemaslahatan kalian yang banyak sekali. Maka dari itu Allah menggunakan huruf lam sebagai alat bantu transitip (yang bermakna untuk), sehinggga maknanya, Dia menjadikan itu semua untuk kalian dan untuk mengaruniakanya kepada kalian. Maka dari itu Allah berfirman, “dijadikanya kamu berkembang biak dengan jalan itu,” yakni mengembangkan dan memperbanyak kalian, memper banyak hewan-hewan ternak kalian disebabkan dia telah menciptakan dari dirikalian dan manciptakan pula untuk kalian pasangan-pasanagn. “tidak ada sesuatupun yang serupa dengan dia,” artinya, tidak ada sesuatu apapun dari mahkluknya yang menyerupai ataupun menyamaiNya, baik pada DzatNya, nama-namaNya sipat-sipatNya maupun perbuatan-perbuatanNYa. Sebab semua nama-nama adalah sangat indah dan semua sifat-sifatNya adalah sifat-sifat kesempurnaaan dan keagungan, dan perbuatan-perbuatan (af’al) yang denganya dia menciptakan seluruh ciptaan-ciptaan yang luar biasa besarnya ini, tidak ada sesuatu pun yang menyertaiNya. maka tidak ada sesuatupun yang semisal denganNya, karena kamanunggalan dan kesaanNya dengan kesempurnaan segala sisi. “ Dan Dia-lah Yang Maha Mendengar,” seluruh suara dengan berbagai macam Bahasa, dengan berbagai dialek. ”Lagi Maha Malihat,” Dia melihat langkah seekor semut hitam dan kecil di malam yang gulita di atas batu hitam yang keras, dan dia melihat mengalirnya makanan di dalam anggota tubuh hewan-hewan yang sangat kecil sekalipun, dan juga aliran air di dalam dahan-dahan kayu yang sangan rumit. Ayat ini yang lainya adalah dalil Ahlu Sunah waljama’ah dalam menetapkan sipat-sipat Allah dan menafikan keserupaanNya dengan mahkluk. Dan di dalamnya terlihat sanggahan terhadap kaum musyabihah (yang meyakini Allah sama dengan mahkluknya), yaitu terletak pada firmaNnya “tidak ada sesuatu apa pun yang serupa dengan dia,” dan juga sanggahan terhadap sekte Mu’aththilah (sekte yang tidak ada meyakiniadanya sipat bagi Allah,) yaitu pada firmaNya, “Dan Dia-lah Maha Mendengar lagi Maha Melihat.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syura ayat 11: (Pencipta langit dan bumi) Dialah Yang mengadakan langit dan bumi (Dia menjadikan bagi kalian dari jenis kalian sendiri pasangan-pasangan) sewaktu Dia menciptakan Hawa dari tulang rusuk Adam (dan dari jenis binatang ternak pasanganpasangan) ada jenis jantan dan ada jenis betina (dijadikan-Nya kalian berkembang biak) maksudnya, mengembangbiakkan kalian (dengan jalan itu) yaitu melalui proses perjodohan. Dengan kata lain, Dia memperbanyak kalian melalui anak beranak. Dhamir yang ada kembali kepada manusia dan binatang ternak dengan ungkapan yang lebih memprioritaskan manusia. (Tidak ada sesuatu pun yang serupa dengan Dia) huruf Kaf adalah Zaidah, karena sesungguhnya Allah swt. tiada sesuatu pun yang semisal dengan-Nya (dan Dialah Yang Maha Mendengar) semua apa yang dikatakan (lagi Maha Melihat) semua apa yang dikerjakan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan kekuasaan-Nya, kehendak-Nya dan kebijaksanaan-Nya. Sehingga kamu merasakan ketenangan dengannya dan memperoleh keturunan dan memperoleh manfaat. Ada yang menafsirkan dengan Dia menjadikan Hawa’ dari tulang rusuk Adam. Ada jantan dan ada betina. Itu semua karena kamu, yakni untuk melimpahkan nikmat kepadamu. Yakni tidak ada sesuatu pun dari makhluk-Nya yang serupa dan sama dengan-Nya baik dengan zat-Nya, nama-nama-Nya, sifat-Nya, maupun perbuatan-Nya. Hal itu, karena semua nama-Nya paling indah dan sifat-Nya adalah sifat sempurna dan agung. Sedangkan perbuatan-Nya, maka dengannya Dia mengadakan makhluk-makhluk yang besar tanpa ada yang ikut serta dengan-Nya. Oleh karena itu, tidak ada yang serupa dengan-Nya karena sendirinya Dia dengan kesempurnaan dari segala sisi. Ayat ini merupakan bantahan kepada kaum Musyabbihah yang menyerupakan Allah dengan makhluk-Nya. Sedangkan lanjutan ayatnya, yaitu wahuwas samii’ul ‘aliim (Dia Maha Mendengar dan Maha Melihat) merupakan bantahan terhadap kaum Mu’aththilah (yang meniadakan sifat bagi Allah). Ahlussunnah pertengahan antara kaum musyabbihah dan kaum mu’aththilah, mereka menetapkan sifat bagi Allah seperti yang disebutkan Allah dalam kitab-Nya dan disebutkan Rasul dalam sunnah-Nya, namun mereka tidak menyamakan sifat tesebut dengan sifat makhluk-Nya. Dia mendengar semua suara dengan beragam bahasa serta bermacam-macam kebutuhan. Dia melihat rayapan semut yang hitam di malam yang gelap di atas batu yang keras. Dia juga melihat bagaimana makanan mengalir kepada makhluk-makhluk kecil serta mengalirnya air di dahan-dahan yang tipis. Jika yang paling kecil saja dan yang tersembunyi Dia mengetahuinya lalu bagaimana dengan yang besar dan jelas."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syura Ayat 11",
    "description": "Dialah, Allah, pencipta langit dengan segala keindahannya dan pencipta bumi tanpa ada contoh sebelumnya dan dia pula yang menciptakan segala isi yang ada pada keduanya, termasuk makhluk-makhluk yang menghuninya. Dia menjadikan bagi kamu pasangan-pasangan dari jenis kamu sendiri, yaitu pasangan laki-laki sebagai suami dan perempuan sebagai istri dan menjadikan pula dari jenis hewan ternak pasangan-pasangan bagi masing-masing binatang, ada jantan dan ada betina dan dengan berpasangan itu mereka dapat melanjutkan keturunannya. Dijadikan-Nya kamu berkembang biak dan dapat melanjutkan keturunanmu dengan jalan berpasang-pasangan itu. Tidak ada sesuatu pun dari semua makhluk yang telah diciptakan-Nya itu yang serupa dengan dia dalam zat dan segala sifat dan perbuatan-Nya. Dia suci dari pasangan. Dan dia yang maha mendengar segala yang kamu katakan, maupun yang terlintas dalam pikiranmu, maha melihat segala yang kamu lakukan, baik secara terangan-terangan maupun sembunyi-sembunyi. 12. Dia tidak hanya menciptakan semua yang ada di langit dan bumi, tetapi juga menguasai seluruhnya. Karena itu, milik-Nyalah dan di bawah kekuasaan-Nya semua perbendaharaan langit dan bumi; dia melapangkan rezeki bagi siapa yang dia kehendaki, yaitu kepada siapa pun tanpa melihat kepada iman dan amal yang dilakukannya, tetapi berdasarkan hukum-hukum yang telah ditetapkannya dalam memperoleh rezeki dan membatasinya bagi siapa pun, bukan karena kekafirannya dan kemaksiatannya, tetapi karena dia tidak memenuhi hukum-hukum itu. Sungguh, dia, satu-satunya, maha mengetahui segala sesuatu yang ada di langit dan bumi, termasuk yang dilapangkan dan dibatasi rezekinya."
  }
]