[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bagi-Nya kerajaan langit dan bumi dan di tangan-Nya kunci-kunci rahmat dan rizki, Dia melapangkan rizki-Nya bagi siapa yang Dia kehendaki dari hamba-hamba-Nya, dan menyempitkannya bagi siapa yang Dia kehendaki. Sesungguhnya Dia maha mengetahui segala sesuatu tidak satupun dari perkara makhluk-Nya yang samar bagi-Nya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Hanya Dia lah yang mempunyai kunci-kunci perbendaharaaan langit dan bumi. Dia melapangkan rezeki bagi yang dikehendaki-Nya dari kalangan hamba-Nya sebagai bentuk ujian bagi mereka; adakah dia akan bersyukur ataukah akan kufur? Dan Dia menyempitkan rezeki bagi yang dikehendaki-Nya sebagai bentuk cobaan bagi mereka; adakah dia akan bersabar ataukah akan murka dengan takdir Allah atasnya? Sesungguhnya Dia Maha Mengetahui atas segala sesuatu, tidak ada sedikitpun dari maslahat para hamba-Nya yang tersembunyi dari-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "12. لَهُۥ مَقَالِيدُ السَّمٰوٰتِ وَالْأَرْضِ ۖ (Kepunyaan-Nya-lah perbendaharaan langit dan bumi) Yakni memiliki perbendaharaannya atau kunci-kunci pengaturannya. يَبْسُطُ الرِّزْقَ لِمَن يَشَآءُ وَيَقْدِرُ ۚ( Dia melapangkan rezeki bagi siapa yang dikehendaki-Nya dan menyempitkan(nya)) Yakni Allah meluaskan rezeki bagi makhluk yang Dia kehendaki dan menyempitkan bagi makhluk yang Dia kehendaki."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12. Hanya MilikNya kunci-kunci gudang langit dan bumi. Dia meluaskan dan menyempitkan rejeki makhlukNya yang dikehendaki. Sesungguhnya Allah SWT adalah Dzat yang sempurna pengetahuannya atas segala sesuatu. Tidak ada rahasia yang luput dariNya dan tidak ada kemaslahatan makhluk yang tidak diketahuiNya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "MilikNyalah perbendaharaan langit dan bumi} kunci-kunci perbendaharaan langit dan bumi {Dia melapangkan} melapangkan {rezeki bagi siapa saja yang Dia kehendaki dan menyempitkan} dan menyempitkannya kepada siapa saja yang Dia kehendaki {Sesungguhnya Dia Maha Mengetahui segala sesuatu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "12. ”Kepunyaan nya-lah perbendaharaan langit dan bumi,” Miliknya-lah kerajaan langit dan bumi, di TanganNya-lah semua kunci rahmat, rizki berbagai kenikmatan yang lahir dan yang batin. Jadi, semua mahkluk bergantung kepada Allah dalam mencari kebaikan mereka dan mencegah keburukan dari mereka, dalam setiap keadaan.Tidak ada seorang pun yang memiliki otoritas. Allah-lah yang Maha Memberi ,Yang menahan Yang dapat menimpakan mudharat dan dapat mendatangkan manfaat, yang tiada suatu nikmatpun ada pada hamba-hamba ini melainkan ia berasal dariNya dan tidak ada yang bisa mencegah keburukan selain dia. Dan apa pun rahmat yang Allah bukakan untuk manusia, maka tidak ada yang bisa menahanya, dan apa pun yang di tahan, maka tidak ada yang bisa melepaskanya selain dia. Maka dari itu dia berfirman, “Dia melapangkan rizki bagi siapa yang di kehendakinya,” maksudnya, melapangkannya dan memberikannya dari bebagai macam rezeki yang dia kehendaki,” dan menyempitkan,” maksudnya, menyusahkan bagi siapa saja yang dia kehendaki hingga hanya sebatas keperluanya saja, tidak lebih dari itu. Semua itu tergantung kepada ilmu dan kebijaksanaanNya. Maka dari itu Dia berfirman, “Sesungguhnya Dia Maha Mengetahui segala sesuatu,” yakni Dia mengetahui kondisi hamba-hambaNya sehingga memberi masing-masing sesuai dengan kebijaksanaanNya dan menurut tuntutan kehendakNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syura ayat 12: (Kepunyaan-Nyalah khazanah langit dan bumi) yakni kunci-kunci khazanahnya, yaitu berupa hujan, tumbuh-tumbuhan dan lain sebagainya. (Dia melapangkan rezeki) meluaskannya (bagi siapa yang dikehendaki-Nya) sebagai ujian baginya (dan membatasinya) menyempitkannya bagi siapa yang dikehendaki-Nya sebagai cobaan baginya (Sesungguhnya Dia Maha Mengetahui segala sesuatu.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni milik-Nyalah kerajaan langit dan bumi dan di Tangan-Nya kunci-kunci rahmat dan rezeki, serta nikmat-nikmat yang tampak maupun yang tersembunyi. Semua makhluk butuh kepada Allah dalam mendatangkan maslahat mereka dan menghindarkan madharrat dan dalam setiap keadaan, dan tidak ada seorang pun yang berkuasa terhadapnya. Ada yang menafsirkan perbendaharaan langit dan bumi maksudnya hujan dan tumbuh-tumbuhan. Allah Subhaanahu wa Ta'aala Dialah yang memberi dan menghalangi, yang menimpakan bahaya dan memberikan manfaat, dimana tidak ada satu pun nikmat yang diperoleh hamba kecuali dari-Nya dan tidak ada yang dapat menolak keburukan kecuali Dia. Sebagaimana firman-Nya, “Apa saja yang Allah anugerahkan kepada manusia berupa rahmat, maka tidak ada seorangpun yang dapat menahannya; dan apa saja yang ditahan oleh Allah maka tidak seorang pun yang sanggup melepaskannya sesudah itu. Dan Dialah yang Mahaperkasa lagi Mahabijaksana.” (Terj. Fathir: 2) Oleh karena itulah di ayat ini Dia berfirman, “Dia melapangkan rezeki dan membatasinya bagi siapa yang Dia kehendaki.” Sehingga rezeki itu hanya sebatas kebutuhannya dan tidak lebih. Semua ini mengikuti pengetahuan dan hikmah-Nya. Dia mengetahui semua keadaan hamba-hamba-Nya, Dia memberikan masing-masingnya yang sesuai dengan hikmah-Nya dan dikehendaki oleh masyi’ah (kehendak)-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syura Ayat 12",
    "description": "Dia tidak hanya menciptakan semua yang ada di langit dan bumi, tetapi juga menguasai seluruhnya. Karena itu, milik-Nyalah dan di bawah kekuasaan-Nya semua perbendaharaan langit dan bumi; dia melapangkan rezeki bagi siapa yang dia kehendaki, yaitu kepada siapa pun tanpa melihat kepada iman dan amal yang dilakukannya, tetapi berdasarkan hukum-hukum yang telah ditetapkannya dalam memperoleh rezeki dan membatasinya bagi siapa pun, bukan karena kekafirannya dan kemaksiatannya, tetapi karena dia tidak memenuhi hukum-hukum itu. Sungguh, dia, satu-satunya, maha mengetahui segala sesuatu yang ada di langit dan bumi, termasuk yang dilapangkan dan dibatasi rezekinya. 13. Ayat-ayat yang lalu menjelaskan bahwa Allah yang telah menciptakan langit dan bumi dan segala perbendaharaannya adalah milik-Nya. Ayat ini menjelaskan bahwa dia, Allah, telah mensyariatkan atau menetapkan kepadamu, wahai umat nabi Muhammad, dari agama, yaitu prinsip-prinsip serupa yang telah diwasiatkan-Nya, yaitu diwahyukan kepada nuh dan serupa pula dengan apa yang telah kami wahyukan kepadamu, wahai nabi Muhammad, dan apa yang telah kami wasiatkan kepada nabi-nabi sebelummu, yaitu ibrahim, musa, dan isa. Syariat yang telah diwasiatkan dan diwahyukan itu adalah tegakkanlah tuntunan dan ajaran agama, berupa keimanan dan ketakwaan dengan baik, konsisten, dan terus-menerus, dan janganlah kamu berselisih paham dan berbeda pendapat tentang suatu persoalan yang dapat menimbulkan kamu berpecah belah di dalamnya, yakni di dalam prinsip dan ajaran agama itu. Sangat berat, besar, dan sulit bagi orang-orang musyrik untuk mengikuti prinsip-prinsip dan tuntunan-tuntunan agama dari tuhanmu yang kamu serukan kepada mereka untuk mengikutinya karena mereka menolaknya. Allah meyakinkan nabi Muhammad dengan mengatakan bahwa Allah memilih orang-orang yang dia kehendaki untuk mengikuti dan meyakini prinsip-prinsip dan tuntunan-tuntunan agama tauhid yang diajarkan dan disampaikannya. Dia pula memberi petunjuk untuk kembali kepada agama-Nya bagi orang yang kembali kepada-Nya setelah bertobat atas kekafiran dan kesalahan mereka."
  }
]