[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dia mensyariatkan untuk kalian (wahai manusia) agama yang telah kami wahyukan kepadamu (wahai rasul) yaitu islam. sebagaimana Dia mewasiatkannya kepada Nuh agar mengamalkan dan menyampaikannya, dan juga yang Kami wasiatkan kepada Ibrahim, Musa dan Isa (mereka berlima adalah ullul azmi dari para rasul menurut pendapat yang mahsur) agar mereka semuanya menegakkan agama dengan tauhid, dan ketaatan kepada Allah dan beribadah kepadaNya semata, bukan kepada sealinNYa. Dan jangan berselisih dalam agama yang Aku perintahkan kepada kalian. Apa yang kamu dakwahkan berupa tauhid kepada Allah dan mengikhlaskan ibadah kepadanya benar-benar berat bagi orang-orang musyrik. Allah lebih memilih mengemban tauhid siapa saja yang Dia kehendaki dari makhluk-Nya, dan Dia membimbing untuk beramal dan menaati-Nya siapa yang kembali kepada-Nya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "13. Allah mensyariatkan kepada kalian dalam masalah agama sebagaimana Kami telah memerintahkan kepada Nuh untuk menyampaikannya dan mengamalkannya, dan apa yang Kami wahyukan kepadamu -wahai Rasul- dan Allah syariatkan kepada kalian seperti yang telah Kami perintahkan kepada Ibrahim, Musa dan Isa untuk menyampaikannya dan mengamalkannya, intinya adalah, “Tegakkanlah agama dan tinggalkanlah sikap berpecah belah dalam agama”. Amat berat bagi kaum musyrikin apa yang kamu serukan kepada mereka berupa ajakan mentauhidkan Allah dan meninggalkan penyembahan kepada selain Allah. Allah memilih orang yang dikehendaki-Nya dari para hamba-Nya dan memberinya kemudahan untuk menyembah dan taat kepada-Nya serta memberi petunjuk kepada agama-Nya orang yang mau kembali dengan bertobat dari dosa-dosanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "13. Allah memberi kenikmatan kepada hamba-hamba-Nya yang beriman dan Rasulullah dengan kenikmatan yang besar dengan mensyariatkan bagi mereka agama terbaik yaitu Islam, yang menjadi agama yang Allah perintahkan untuk diikuti oleh Nabi Nuh, Ibrahim, Musa, dan Isa; dan mereka adalah para Nabi Ulul Azmi. Allah memerintahkan mereka untuk menegakkan seluruh syiar-syiar agama ini dan melarang mereka dari perpecahan dalam agama. Dan Allah mengolok orang-orang musyrik yang berpaling dari seruan Nabi Muhammad untuk mengesakan Allah Yang Memilih rasul sesuai dengan kehendak-Nya dan Memberi Taufik kepada orang beriman yang kembali kepada-Nya dengan ketaatan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "13. شَرَعَ لَكُم مِّنَ الدِّينِ (Dia telah mensyari’atkan bagi kamu tentang agama) Yakni Allah menjelaskan bagi umat Nabi Muhammad tentang agama-Nya. مَا وَصَّىٰ بِهِۦ نُوحًا(apa yang telah diwasiatkan-Nya kepada Nuh) Berupa tauhid dan asas-asas Syari’at yang tidak ada perbedaan bagi setiap rasul dan sesuai dengan semua kitab. وَالَّذِىٓ أَوْحَيْنَآ إِلَيْكَ(dan apa yang telah Kami wahyukan kepadamu) Berupa al-Qur’an, syari’at Islam, dan menjauhi kesyirikan. وَمَا وَصَّيْنَا بِهِۦٓ إِبْرٰهِيمَ وَمُوسَىٰ وَعِيسَىٰٓ ۖ( dan apa yang telah Kami wasiatkan kepada Ibrahim, Musa dan Isa) Yang berupa syari’at yang sesuai pada rasul-rasul ulul azmi. أَنْ أَقِيمُوا۟ الدِّينَ(yaitu: Tegakkanlah agama) Yakni tegakkanlah tauhid dan keimanan kepada Allah, ketaatan kepada rasul-rasul-Nya, dan menerima syariat-syariat-Nya. Mujahid berkata: tidaklah Allah mengutus seorang nabipun melainkan juga mewasiatkan untuk mendirikan shalat, menunaikan zakat, meminta untuk bersiap mentaati Allah; dan itulah agama Allah yang disyariatkan kepada mereka. وَلَا تَتَفَرَّقُوا۟ فِيهِ ۚ( dan janganlah kamu berpecah belah tentangnya) Yakni janganltentang tauhid, keimanan kepada Allah, ketaatan kepada rasulullah, dan syari’at-Nya; sebab tidak layak hal-hal tersebut diperselisihkan. Namun tidak termasuk dalam hal ini syari’at-syari’at sekunder serta jenis-jenis ibadah dan detail-detailnya, sebab syari’at-syari’at semacam ini memang terdapat perbedaan pada setiap umat, sebagaimana dalam firman-Nya: لكل جعلنا منكم شرعة ومنهاجا “Untuk tiap-tiap umat diantara kamu, Kami berikan aturan dan jalan yang terang.” (al-Maidah: 48) كَبُرَ عَلَى الْمُشْرِكِينَ مَا تَدْعُوهُمْ إِلَيْهِ ۚ( Amat berat bagi orang-orang musyrik agama yang kamu seru mereka kepadanya) Yakni sangat berat bagi mereka seruan yang dilakukan para rasul yang berupa pengesaan Allah dan menjauhi berhala-berhala, begitu pula berat bagi mereka untuk bersaksi bahwa tiada Tuhan yang berhak disembah kecuali Allah, dan Iblis beserta tentaranya pun merasa kesulitan untuk melawannya. Dan tidaklah Allah menginginkan kecuali menolong dan meninggikan agama-Nya. اللهُ يَجْتَبِىٓ إِلَيْهِ مَن يَشَآءُ(Allah menarik kepada agama itu orang yang dikehendaki-Nya) Yakni Allah memilih hamba-Nya yang Dia kehendaki untuk mentauhidkan-Nya dan masuk ke dalam agama-Nya. وَيَهْدِىٓ إِلَيْهِ مَن يُنِيبُ(dan memberi petunjuk kepada (agama)-Nya orang yang kembali (kepada-Nya)) Yakni memberinya taufik agar mau masuk ke dalam agama-Nya dan mengikhlaskan ibadahnya serta kembali kepada ketaatan-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13. Allah menjelaskan hukum-hukum dan agamaNya kepada kalian wahai orang-orang mukmin melalui risalah Muhammad SAW yang tidak diperintahkan kepada Nuh yang merupakan salah satu rasul pertama yang membawa hukum-hukum Allah kepada manusia. Dia juga menjelaskan kepada kamu wahai nabi tentang wahyu kami dalam Al-Qur’an yang tidak kami perintahkan kepada Ibrahim As, Musa As dan Isa As yang selalu menjaga agama Allah, yaitu mengesakanNya secara umum saja, menunaikan sebagian perintah dan meninggalkan sebagian lainnya. Adapun dalam hal membedakan bagian, cabang, dan rincian hukum, tidak ada yang mencegahnya, karena setiap hukum, berbeda satu sama lain, sesuai firmanNya: {Li kullin ja’alnaa minkum syir’atan wa minhaajan} [QS Al-Maidah 5/48] Wahai Rasulullah! Apa yang engkau serukan kepada orang-orang musyrik berupa mengesakan Tuhan dan meninggalkan berhala itu lebih agung daripada mereka dan membuat mereka terpecah belah. Allah memberikan risalahNya kepada hamba yang dikehendakiNya. Dia juga membimbing dan menolong orang yang mau menaatiNya dan beribadah kepadaNya dengan ikhlas."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia telah mensyariatkan} Dia menerangkan dan menjelaskan {bagi kalian agama yang Dia wasiatkan kepada Nuh, yang telah Kami wahyukan kepadamu, dan yang telah Kami wasiatkan kepada Ibrahim, Musa, dan Isa yaitu,”Tegakkanlah agama dan janganlah berpecah-belah} janganlah berselisih {di dalamnya. Sangat berat} sangat agung {bagi orang-orang musyrik agama yang kalian serukan kepada mereka. Allah memilih orang yang Dia pilih pada (agama)Nya} Memilih nabi dan wali untuk agamanya {orang yang Dia kehendaki dan memberi petunjuk pada (agama)Nya bagi orang yang kembali} kembali melakukan ketaatan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "13. Ini adalah karunia terbesar yang Allah limpahkan kepada hamba-hambaNya, yaitu Dia menetapkan sebaik-baik agama untuk mereka, yang paling utama, paling suci dan paling bersih, yaitu Dinul Islam, yang telah disyariatkan (ditetapkan) oleh Allah untuk orang-orang pilihan yang diistimewakan di antara hamba-hambaNya. Bahkan Allah mensyariatkannya untuk yang terbaik dari yang terbaik dan teristimewa dari yang istimewa. Mereka adalah Ulul ‘azmi di antara para rasul yang disebutkan di dalam ayat Ini. Mereka adalah manusia yang paling tinggi moralnya dan yang paling sempurna derajatnya dari segala sisi. Jadi agama yang ditetapkan oleh Allah untuk mereka harus sesuai dengan kondisi mereka dan sejalan dengan kesempurnaan mereka. Bahkan mereka telah dijadikan sempurna dan dipilih oleh Allah karena mereka melaksanakannya. Kalau saja bukan karena Agama Islam ini, tidak seorang pun di antara manusia yang menjadi tinggi derajatnya. Islam adalah ruh kebahagiaan dan kutub pusaran kesempurnaan. Itulah yang dicakup oleh kitab al-Quran ini dan yang diserukannya, yaitu tauhid, amal-amal shalih, akhlak, dan adab. Maka dari itu Allah berfirman, “Tegakkanlah agama.” Artinya, Allah memerintahkan kepada kalian untuk menegakkan seluruh syariat-syariat Agama, prinsip-prinsipnya dan cabang-cabangnya. Kalian menegakkannya pada orang-orang lain selain kalian, kalian saling tolong menolong atas kebajikan dan takwa dan jangan saling tolong menolong atas perbuatan dosa dan permusuhan. “Dan janganlah kamu berpecah belah tentangnya,” maksudnya, hendaklah terjadi kesepakatan bagi kalian dalam masalah prinsip-prinsip agama dan cabang-cabangnya, berupaya seriuslah kalian untuk tidak dipecah belah oleh persolan-persoalan dan tidak dikelompok-kelompok sehingga kalian menjadi bergolong-golongan, yang sebagian memusuhi sebagian yang lain, padahal kalian masih sepaham dalam masalah prinsip agama kalian. Termasuk bersatu dalam Agama dan tidak bercerai-berai di dalamnya, adalah apa yang diperintahkan oleh Penetap syariat berupa perkumpulan-perkumpulan umum, seperti perkumpulan haji, hari raya, hari Jumat, shalat lima waktu, jihad dan berbagai bentuk ibadah lainnya yang tidak akan bisa terlaksana dan tidak bisa sempurna kecuali dengan melakukan persatuan (pertemuan) untuknya dan tidak bercerai berai. “Amat berat bagi orang-orang musyrik apa yang kamu seru mereka kepadanya.” Artinya, mereka benar-benar merasa sangat berat karena kamu mengajak mereka mengesakan Allah saja, seperti yang dikatakan oleh Allah tentang mereka, “Dan apabila hanya nama Allah saja yang disebut, kesallah hati orang-orang yang tidak beriman kepada kehidupan akhirat; dan apabila nama sembahan-sembahan selain Allah yang disebut, tiba-tiba mereka bergirang hati.” -Azzumar: 45- Dan ucapan mereka (yang diabadikan Allah), “Mengapa ia menjadikan tuhan-tuhan itu Tuhan Yang satu saja? Sesungguhnya ini benar-benar suatu hal yang sangat mengherankan”. -Shad:5- “Allah menarik kepadanya orang yang dikehendakiNya.” Artinya, Allah memilih di antara manusia ciptaanNya orang yang Dia ketahui bahwasanya ia layak untuk ditarik kepada tugas kerasulan dan kewalianNya. Dan termasuk di antaranya adalah Dia memilih umat Islam ini dan mengistimewakannya atas seluruh umat dan memilihkan untuknya agama yang paling utama dan yang paling baik, “dan memberi mereka petunjuk kepadaNya orang yang kembali.” Inilah sebab yang dilakukan oleh seseorang yang dengannya ia bisa memperoleh hidayah dari Allah, yaitu inabah (kembali) kepadaNya dan ketertarikan naluri-naluri hatinya kepadaNya,dan tujuannya mencari keridhaanNya. Maka kebaikan niat seseorang yang disertai dengan kesungguhannya dalam mencari hidayah merupakan faktor penyebab kemudahan untuk hidayah, seperti yang Allah Firmankan, “Dengan kitab itulah Allah menunjuki orang-orang yang mengikuti keridaan-Nya ke jalan keselamatan,” -Almaidah:16- Di dalam ayat ini dijelaskan bahwasanya Allah “memberi petunjuk kepadaNya orang yang kembali,” di samping FirmanNya yang mengatakan, “dan ikutilah jalan orang yang kembali kepada-Ku”,-Luqman:15- Ditambah dengan kondisi para sahabat nabi, (semoga Allah meridhai mereka), dan betapa gigih kembalinya mereka kepada Allah, adalah bukti bahwa perkataan mereka adalah hujjah (pegangan, argument), terutama perkataan para Khulafa’ Rasyidin, semoga Allah meridhoi mereka semuanya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syura ayat 13: (Dia telah mensyariatkan bagi kalian tentang agama apa yang telah diwasiatkan-Nya kepada Nuh) dia adalah nabi pertama yang membawa syariat (yang telah Kami wahyukan kepadamu dan apa yang telah Kami wasiatkan kepada Ibrahim, Musa dan Isa yaitu, \"Tegakkanlah agama dan janganlah kalian berpecah-belah tentangnya.\") inilah ajaran yang telah disyariatkan dan yang telah diwasiatkan serta yang telah diwahyukan kepada Nabi Muhammad saw. yaitu ajaran Tauhid. (Amat berat) amat besarlah (bagi orang-orang musyrik agama yang kamu seru mereka kepadanya) yakni ajaran tauhid (Allah menarik kepada agama itu) kepada ajaran tauhid (orang yang dikehendaki-Nya dan memberi petunjuk kepada agama-Nya orang yang kembali kepada-Nya) orang yang mau menerima untuk berbuat taat kepada-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini menerangkan nikmat yang paling besar yang Allah berikan kepada hamba-hamba-Nya, yaitu mensyariatkan untuk mereka agama terbaik dan paling utama, paling mulia dan paling suci, yaitu agama Islam, dimana Allah mensyariatkan agama itu kepada hamba-hamba pilihan-Nya bahkan makhluk terbaik dan paling tinggi derajatnya, yaitu para rasul ulul ‘azmi yang disebutkan dalam ayat ini. Kalau bukan karena agama Islam, maka tidak ada seorang pun di antara makhluk menjadi makhluk yang tinggi. Dengan demikian, agama Islam merupakan ruh kebahagiaan, poros kesempurnaan, dimana hal itu terkandung dalam kitab yang mulia ini; dimana yang diserukannya adalah tauhid, amal, akhlak dan adab. Ayat ini menunjukkan bahwa agama para nabi adalah agama tauhid (Islam) meskipun syariatnya berbeda-beda sesuai dengan kondisi umat pada waktu itu. Yang dimaksud dengan menegakkan agama Islam di sini adalah mengesakan Allah Subhaanahu wa Ta'aala, beriman kepada-Nya, kitab-kitab-Nya, rasul-rasul-Nya dan hari akhirat serta menaati segala perintah dan menjauhi larangan-Nya atau menegakkan semua syariat baik yang ushul (dasar) maupun yang furu’ (cabang), yaitu kamu menegakkannya oleh dirimu dan berusaha menegakkannya juga pada selain dirimu serta saling bantu-membantu di atas kebaikan dan takwa. Agar agama dapat tegak secara sempurna. Termasuk di antara sarana berkumpul di atas agama dan tidak berpecah adalah apa yang diperintahkan syari’ (Allah dan Rasul-Nya) untuk berkumpul di waktu haji, pada hari raya, shalat Jum’at dan jamaah, berjihad dan ibadah-ibadah lainnya yang tidak mungkin sempurna kecuali dengan berkumpul bersama dan tidak berpecah belah. Jangankan mengikuti, disebut nama Allah saja mereka tidak suka. Allah memilih di antara makhluk-Nya orang yang Dia ketahui layak dipilih untuk menerima risalah atau kewalian-Nya. Termasuk pula Dia memilih umat ini dan melebihkannya di atas seluruh umat. Kembali kepada-Nya merupakan sebab dari seorang hamba yang dengannya ia memperoleh hidayah Allah Subhaanahu wa Ta'aala. Dengan demikian baiknya niat seorang hamba dan berusaha memperoleh hidayah termasuk sebab untuk dimudahkan kepada hidayah Allah, sebagaimana firman-Nya, “Dengan kitab itulah Allah menunjuki orang-orang yang mengikuti keridhaan-Nya ke jalan keselamatan, …dst.” (Terj. Al Ma’idah: 16)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syura Ayat 13",
    "description": "Ayat-ayat yang lalu menjelaskan bahwa Allah yang telah menciptakan langit dan bumi dan segala perbendaharaannya adalah milik-Nya. Ayat ini menjelaskan bahwa dia, Allah, telah mensyariatkan atau menetapkan kepadamu, wahai umat nabi Muhammad, dari agama, yaitu prinsip-prinsip serupa yang telah diwasiatkan-Nya, yaitu diwahyukan kepada nuh dan serupa pula dengan apa yang telah kami wahyukan kepadamu, wahai nabi Muhammad, dan apa yang telah kami wasiatkan kepada nabi-nabi sebelummu, yaitu ibrahim, musa, dan isa. Syariat yang telah diwasiatkan dan diwahyukan itu adalah tegakkanlah tuntunan dan ajaran agama, berupa keimanan dan ketakwaan dengan baik, konsisten, dan terus-menerus, dan janganlah kamu berselisih paham dan berbeda pendapat tentang suatu persoalan yang dapat menimbulkan kamu berpecah belah di dalamnya, yakni di dalam prinsip dan ajaran agama itu. Sangat berat, besar, dan sulit bagi orang-orang musyrik untuk mengikuti prinsip-prinsip dan tuntunan-tuntunan agama dari tuhanmu yang kamu serukan kepada mereka untuk mengikutinya karena mereka menolaknya. Allah meyakinkan nabi Muhammad dengan mengatakan bahwa Allah memilih orang-orang yang dia kehendaki untuk mengikuti dan meyakini prinsip-prinsip dan tuntunan-tuntunan agama tauhid yang diajarkan dan disampaikannya. Dia pula memberi petunjuk untuk kembali kepada agama-Nya bagi orang yang kembali kepada-Nya setelah bertobat atas kekafiran dan kesalahan mereka. 14. Dan mereka, kaum musyrik dan ahli kitab dari umat-umat terdahulu tidak berselisih, berpecah belah, dan berkelompok-kelompok kecuali setelah datang kepada mereka ilmu, yakni pengetahuan tentang prinsip-prinsip, tuntunan-tuntunan, dan petunjuk-petunjuk kepada kebenaran yang disampaikan oleh para nabi. Perselisihan dan perpecahan di antara mereka disebabkan karena kedengkian yang terjadi antara sesama mereka. Jika tidaklah karena suatu ketetapan yang telah ada dahulunya dari tuhanmu untuk menangguhkan azab bagi mereka sampai batas waktu yang ditentukan, pastilah hukuman yang berat yang datang dari tuhanmu bagi mereka telah dilaksanakan dan mereka menjadi binasa de-ngan hukuman itu. Dan sesungguhnya orang-orang yang mewarisi kepada mereka kitab, yaitu taurat dan injil, setelah mereka yang berselisih dan berpecah-belah itu dan mereka hidup hingga pada zaman nabi Muhammad, benar-benar berada dalam keraguan yang mendalam tentang kitab taurat dan injil yang mereka warisi itu atau kitab Al-Qur'an dengan ajaran-ajaran islam yang dibawa oleh nabi Muhammad."
  }
]