[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan tidaklah bercerai-berai orang-orang yang menyekutukan Allah di dalam agama mereka dalam agama mereka, sehingga mereka menjadi kelompok-kelompok dan aliran-aliran, kecuali setelah datang ilmu kepada mereka dan hujjah telah tegas atas mereka, dan yang membuat mereka melakukan hal itu hanyalah pengingkaran dan pelanggaran. kalau bukan karena kalimat yang telah ada dari tuhanmu (wahai rasul) dengan menunda azab dari mereka ke waktu yang telah ditetapkan yaitu hari kiamat, niscaya telah ditetapkan diantara mereka untuk menyegerakan azab mereka atas orang-orang kafir dari mereka. Dan sesungguhnya orang-orang yang diberi taurat dan injil setelah orang-orang yang berselisih tentang kebenaran tersebut benar-benar dalam keraguan dari agama dan iman, terjatuh kedalam kebimbangan dan perselisihan yang tercela."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Dan tidaklah orang-orang kafir dan musyrik itu berpecah belah melainkan setelah ditegakkan hujah atas mereka dengan diutusnya Muhammad -ṣallallāhu 'alaihi wa sallam- kepada mereka. Dan tidaklah terjadi perpecahan mereka melainkan karena kedengkian dan kezaliman. Kalaulah bukan karena ketentuan yang telah berlaku sebelumnya dalam ilmu Allah bahwa Dia menangguhkan azab kepada mereka sampai waktu tertentu dalam ilmu Allah, yaitu hari Kiamat, niscaya Allah memberi keputusan terhadap mereka, lalu Allah memberikan azab kepada mereka disebabkan kekufuran mereka kepada Allah dan pendustaan mereka kepada para Rasul-Nya. Dan sesungguhnya orang-orang yang mewarisi kitab Taurat dari kalangan yahudi dan yang mewarisi Kitab Injil dari kalangan Nasrani setelah para pendahulu mereka dan para kaum musyrik, benar-benar berada dalam keraguan tentang Al-Qur`ān yang dibawa oleh Muhammad -ṣallallāhu 'alaihi wa sallam- ini dan benar-benar mendustakannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "14. Tidaklah pemeluk agama-agama dan orang-orang musyrik terpecah belah melainkan setelah para Rasul datang kepada mereka dengan membawa ilmu dari Allah; dan tidaklah itu mereka lakukan melainkan karena rasa dengki dan permusuhan di antara mereka. Kalaulah bukan karena ketetapan Allah sebelumnya untuk mengakhirkan siksaan mereka, niscaya akan ditetapkan kebinasaan bagi orang-orang kafir itu. Adapun para Ahli kitab yang mendapat kitab Taurat dan Injil setelah orang-orang yang akan binasa itu berada dalam keraguan terhadap kitab-kitab mereka sendiri."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "14. وَمَا تَفَرَّقُوٓا۟ إِلَّا مِنۢ بَعْدِ مَا جَآءَهُمُ الْعِلْمُ (Dan mereka (ahli kitab) tidak berpecah belah, kecuali setelah datang pada mereka ilmu pengetahuan) Yakni tidaklah Ahli Kitab berpecah belah melainkan mereka telah mengetahui bahwa perpecahan merupakan sebuah kesesatan, namun mereka tetap berpecah belah karena kezaliman mereka demi mencari kedudukan dan karena fanatisme mereka yang berlebihan. وَلَوْلَا كَلِمَةٌ سَبَقَتْ مِن رَّبِّكَ(Kalau tidaklah karena sesuatu ketetapan yang telah ada dari Tuhanmu dahulunya) Yaitu ketetapan Allah tentang pengakhiran siksaan bagi mereka. إِلَىٰٓ أَجَلٍ مُّسَمًّى(sampai kepada waktu yang ditentukan) Yakni sampai hari kiamat. لَّقُضِىَ بَيْنَهُمْ ۚ( pastilah mereka telah dibinasakan) Yakni tentu telah ditetapkan siksaan yang menimpa orang-orang kafir di dunia dan keselamatan bagi orang-orang beriman. وَإِنَّ الَّذِينَ أُورِثُوا۟ الْكِتٰبَ(Dan sesungguhnya orang-orang yang diwariskan kepada mereka Al-Kitab) Dari orang-orang Yahudi dan Nasrani. مِنۢ بَعْدِهِمْ(sesudah mereka) Yakni setelah umat-umat sebelum mereka. لَفِى شَكٍّ مِّنْهُ(benar-benar berada dalam keraguan tentang kitab itu) Yakni tentang al-Qur’an atau tentang Muhammad. مُرِيبٍ(yang menggoncangkan) Yakni yang menjerumuskan ke dalam keraguan, oleh sebab itu mereka tidak beriman. Pendapat lain mengatakan maksud ayat ini adalah bahwa orang-orang musyrik Arab mewarisi al-Qur’an setelah mereka mewarisi kitab-kitab dari para Ahli Kitab, namun mereka dalam keraguan terhadap al-Qur’an."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14. Para ahli agama itu tidak saling berselisih dalam hal agama, dimana ada sebagian yang mengesakan dan mengimani Tuhannya, ada juga sebagian lain yang ingkar, kecuali setelah mereka mengetahui agama haq yang dibawakan oleh para rasul. Jika saja sebelumnya tidak ada ketentuan Allah untuk menangguhkan dan mengakhirkan balasanNya (kepada mereka) sampai waktu yang ditentukan, sungguh ketentuan yang terjadi di antara mereka adalah kehancuran bagi orang-orang kafir dan pertolongan bagi orang-orang mukmin. Sesungguhnya orang-orang yang diserahi kitab (ahli kitab dari kaum Yahudi dan Nasrani) yang hidup di masa Nabi SAW itu berada dalam kebingungan tentang urusan dan kitab mereka, yang mana mereka tidak benar-benar mengimaninya dan tidak pula mengimani Al-Qur’an. Sungguh mereka benar-benar dalam keragu-raguan dan kebimbangan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka tidak berpecah-belah kecuali setelah datang kepada mereka pengetahuan} Al-Qur’an yang dipelajari {karena kedengkian antara mereka} karena mereka melampaui batas dan saling bermusuhan satu sama lain {Jika bukan karena suatu ketetapan yang telah ada dari Tuhanmu sampai batas waktu yang ditentukan, pastilah hukuman bagi mereka telah dilaksanakan. Sesungguhnya orang-orang yang mewarisi kitab} Taurat dan Injil {setelah mereka} setelah berlalunya mereka {benar-benar berada dalam keraguan terhadapnya} terhadap Al-Qur’an {yang mendalam} dalam keraguan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "14. Setelah Allah memerintahkan persatuan kaum Muslimin dalam Bergama dan melarang mereka berpecah belah, Dia sampaikan kepada mereka agar jangan terpedaya dengan al-Kitab yang Allah turunkan kepada mereka; sebab orang-orang Ahlul Kitab itu tidak bercerai-berai kecuali setelah Allah menurunkan kepada mereka al-Kitab yang seharusnya melahirkan persatuan. Namun mereka melakukan kebalikan dari apa yang diperintahkan oleh kitab suci mereka. Semua itu adalah karena kecongkakan dan kebencian dari mereka. Sebab mereka saling benci membenci dan saling dengki mendengki, dan terjadilah kebencian dan permusuhan di antara mereka, dengan demikian terjadilah perpecahan. Maka waspadalah wahai kaum Muslimin untuk tidak menjadi seperti mereka. “Kalaulah tidak karena sesuatu ketetapan yang telah ada dari Rabbmu dahulunya,” yakni untuk penundaan azab yang membinasakan hingga waktu yang telah ditentukan, “pastilah mereka telah dibinasakan.” Akan tetapi kebijaksanaan dan kelembutanNya menuntut untuk ditangguhkannya siksaan itu dari mereka. “Dan sesungguhnya orang-orang yang diwariskan kepada mereka al-Kitab sesudah mereka,” maksudnya, orang-orang mewarisi mereka dan mereka menjadi pengganti (penerus) mereka yang berilmu di antara mereka, “benar-benar berada dalam keraguan yang menggoncangkan tentang kitab itu,” maksudnya, benar-benar berada dalam ketidakjelasan yang sangat kentara yang menjerumuskan ke dalam perselisihan, di mana para pendahulu mereka berselisih karena congkak dank eras kepala. Dan generasi selanjutnya berselisih karena ragu dan bimbang. Semua mereka sama-sama dalam perselisihan yang tercela."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syura ayat 14: (Dan mereka tidak berpecah-belah) yaitu para pemeluk agama-agama tentang agamanya, umpamanya sebagian dari mereka berpegang kepada ajaran tauhid dan sebagian lainnya kafir (melainkan sesudah datangnya pengetahuan kepada mereka) yakni pengetahuan tentang ajaran tauhid (karena kedengkian) yang dimaksud adalah orang-orang kafir (di antara mereka. Kalau tidaklah karena sesuatu ketetapan yang telah ada dari Rabbmu dahulunya) untuk menangguhkan pembalasan (sampai kepada waktu yang ditentukan) yakni hari kiamat (pastilah telah diputuskan di antara mereka) yaitu diazab-Nya orang- 308 orang kafir di dunia. (Dan sesungguhnya orang-orang yang diwariskan kepada mereka Alkitab sesudah mereka) mereka adalah orang-orang Yahudi dan orang-orang Nasrani (benar-benar dalam keraguan terhadapnya) terhadap Nabi saw. (yang mengguncangkan) yang menyebabkan keragu-raguan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala memerintahkan agar kaum muslimin berkumpul di atas agama mereka serta melarang mereka berpecah belah, maka Dia memberitahukan kepada mereka agar jangan tertipu hanya karena Allah telah menurunkan kitab kepada mereka, karena Ahli Kitab sebelumnya tidaklah berpecah belah sampai Allah menurunkan juga kitab kepada mereka yang menghendaki mereka untuk bersatu, namun ternyata mereka mengerjakan kebalikan dari apa yang diperintahkan dalam kitab tersebut. Hal itu terjadi karena kedengkian di antara mereka; mereka saling benci membenci dan saling dengki-mendengki sehingga terjadilah perpecahan, oleh karena itu hendaknya kita berhati-hati agar tidak seperti mereka. Maksudnya, orang-orang yang beragama atau Ahli Kitab tidaklah berpecah belah dalam hal agama, kecuali setelah nyata kebenaran, namun mereka pun tetap berpecah belah. Yaitu hari Kiamat. Dengan mengazab mereka di dunia, akan tetapi kebijaksanaan dan santun-Nya menghendaki untuk menunda azab dari mereka. Yaitu orang-orang Yahudi dan Nasrani. Yakni benar-benar berada dalam kesamaran yang besar yang menjatuhkan ke dalam perselisihan, dimana pendahulu mereka berselisih baik karena dengki maupun karena sikap membangkang. Generasi setelah mereka juga berselisih karena ragu-ragu, dan semuanya sama-sama dalam perselisihan yang tercela."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syura Ayat 14",
    "description": "Dan mereka, kaum musyrik dan ahli kitab dari umat-umat terdahulu tidak berselisih, berpecah belah, dan berkelompok-kelompok kecuali setelah datang kepada mereka ilmu, yakni pengetahuan tentang prinsip-prinsip, tuntunan-tuntunan, dan petunjuk-petunjuk kepada kebenaran yang disampaikan oleh para nabi. Perselisihan dan perpecahan di antara mereka disebabkan karena kedengkian yang terjadi antara sesama mereka. Jika tidaklah karena suatu ketetapan yang telah ada dahulunya dari tuhanmu untuk menangguhkan azab bagi mereka sampai batas waktu yang ditentukan, pastilah hukuman yang berat yang datang dari tuhanmu bagi mereka telah dilaksanakan dan mereka menjadi binasa de-ngan hukuman itu. Dan sesungguhnya orang-orang yang mewarisi kepada mereka kitab, yaitu taurat dan injil, setelah mereka yang berselisih dan berpecah-belah itu dan mereka hidup hingga pada zaman nabi Muhammad, benar-benar berada dalam keraguan yang mendalam tentang kitab taurat dan injil yang mereka warisi itu atau kitab Al-Qur'an dengan ajaran-ajaran islam yang dibawa oleh nabi Muhammad. 15. Karena itu, apa pun sikap mereka terhadap kamu, termasuk keraguan mereka yang mendalam terhadap ajaran-ajaran yang kamu sampaikan, serulah mereka dengan penuh kesabaran untuk beriman kepada tuhanmu dan tetaplah beriman dan berdakwah sebagaimana diperintahkan tuhanmu kepadamu Muhammad dan janganlah mengikuti keinginan mereka dalam hal apa pun dan katakanlah kepada mereka yang kafir dan ragu itu dengan tegas, 'aku beriman kepada kitab yang diturunkan Allah dan apa yang diturunkan-Nya di dalam kitab suci-Nya dan aku diperintahkan agar berlaku adil di antara kamu sekalian. Allah adalah tuhan kami dan juga tuhan kamu, yang menciptakan, memelihara, mendidik, dan membimbing ke jalan yang benar, dan memberi balasan atas apa yang kita kerjakan. Bagi kami perbuatan kami dan kami akan mempertanggungjawabkannya dan bagi kamu perbuatan kamu dan kamu akan mempertanggungjawabkannya di hadapan-Nya. Tidak perlu lagi ada pertengkaran antara kami dan kamu, Allah mengumpulkan antara kita di hari kiamat nanti dan memutuskan perbedaan di antara kita dan kepada-Nyalah kita semua kembali. '."
  }
]