[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kepada agama yang lurus yang Allah syariatkan bagi para nabi dan Dia wasiatkan kepada mereka itulah hendaknya kamu dakwahi hamba-hamba Allah (wahai rasul), dan beristiqamahlah sebagaimana yang Allah perintahkan kepadamu, jangan mengikuti hawa nafsu orang-orang yang ragu-ragu dalam kebenaran dan membelot dari agama, dan ucapkanlah “saya membenarkan seluruh kitab-kitab yang turun dari langit kepada nabi-nabi, dan tuhanku memerintahkan kepadaku agar bersikap adil diantara kalian dalam menetapkan hukum. Allah adalah tuhan kami dan tuhan kalian, bagi kami pahala perbuatan kami yang shalih dan bagi kalian balasan amal perbuatan kalian yang buruk. Tidak ada perdebatan dan perselisihan diantara kami dengan kalian setelah jelasnya kebenaran, Allah akan mengumpulkan antara kami dan kalian di hari kiamat lalu Dia memberikan keputusan diantara kita dengan kebenaran dalam perkara yang kita perselisihkan, hanya kepadaNya tempat kembali dan berpulang, lalu Dia membalas masing-masing sesuai dengan haknya. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Serulah kepada agama yang lurus ini dan teguhlah di atasnya sebagaimana yang diperintahkan Allah kepadamu dan janganlah mengikuti hawa nafsu mereka yang sesat serta ucapkanlah dalam membantah mereka, “Aku beriman kepada Allah dan kepada kitab-kitab yang diturunkan Allah kepada para Rasul-Nya, dan Allah memerintahkan kepadaku untuk menghukum di antara kalian dengan adil. Allah yang aku sembah adalah Rabb kami dan Rabb kalian semua. Bagi kami amal perbuatan kami, yang baik maupun yang buruk, dan bagi kalian amal perbuatan kalian, yang baik maupun yang buruk. Tidak ada lagi pertentangan di antara kami dan kalian setelah hujah menjadi nyata dan keterangan menjadi jelas. Allah akan mengumpulkan kita semua dan kepada-Nya tempat kita kembali pada hari Kiamat, dan Dia akan membalas masing-masing dari kita sesuai dengan haknya masing-masing. Pada saat itu akan tampak orang yang jujur dari orang pendusta dan orang yang benar dari orang yang sesat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "15. Hai Rasulullah, serulah kepada agama yang agung ini, beristiqamahlah sebagaimana yang Allah perintahkan kepadamu, dan janganlah kamu mengikuti hawa nafsu orang-orang musyrik, dan katakanlah, ‘Aku beriman kepada seluruh kitab yang Allah turunkan kepada para Rasul-Nya, dan Tuhanku memerintahkanku untuk berbuat adil terhadap kalian dalam menetapkan hukum. Allah Adalah Tuhan kami dan Tuhan kalian. Bagi kami pahala amal shalih kami dan bagi kalian balasan amal buruk kalian. Tidak ada yang perlu diperdebatkan antara kita setelah kebenaran telah jelas. Allah akan mengumpulkan kita semua pada hari kiamat, dan kepada-Nya kita akan kembali untuk menjalankan hisab.’"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15. فَلِذٰلِكَ فَادْعُ ۖ وَاسْتَقِمْ (Maka karena itu serulah (mereka kepada agama ini) dan tetaplah) Yakni karena perpecahan dan keraguan yang telah disebutkan tadi, atau karena Allah telah menetapkan syari’at-Nya, maka serulah kepada Allah dan kepada tauhid, dan beristiqamah-lah dalam seruanmu, serta teruslah menyampaikan risalahmu. كَمَآ أُمِرْتَ ۖ( sebagaimana diperintahkan kepadamu) Yakni sebagaimana yang Allah perintahkan kepadamu. وَلَا تَتَّبِعْ أَهْوَآءَهُمْ ۖ (dan janganlah mengikuti hawa nafsu mereka) Yakni hawa nafsu mereka yang batil dan fanatisme mereka yang sesat, dan janganlah kamu pedulikan orang yang menyelisihimu dalam urusan Allah. وَقُلْ ءَامَنتُ بِمَآ أَنزَلَ اللهُ مِن كِتٰبٍ ۖ (dan katakanlah: “Aku beriman kepada semua Kitab yang diturunkan Allah) Yakni beriman kepada semua kitab yang telah Allah turunkan kepada para Rasul, bukan seperti orang yang beriman kepada sebagiannya dan mengingkari sebagian lainnya. وَأُمِرْتُ لِأَعْدِلَ بَيْنَكُمُ ۖ( dan aku diperintahkan supaya berlaku adil diantara kamu) Yakni adil dalam menerapkan hukum-hukum Allah jika kalian mengajukan perkara kepadaku, dan aku tidak akan menzalimi kalian. اللهُ رَبُّنَا وَرَبُّكُمْ ۖ( Allah-lah Tuhan kami dan Tuhan kamu) Yakni Tuhan kami dan Tuhan kalian, Pencipta kami dan Pencipta kalian. لَنَآ أَعْمٰلُنَا (Bagi kami amal-amal kami) Yakni pahala atau siksaan dari amalan kami hanya bagi kami. وَلَكُمْ أَعْمٰلُكُمْ ۖ (dan bagi kamu amal-amal kamu) Yakni pahala atau siksaan dari amalan kalian hanya bagi kalian. لَا حُجَّةَ بَيْنَنَا وَبَيْنَكُمُ ۖ (Tidak ada pertengkaran antara kami dan kamu) Yakni tidak ada lagi perselisihan antara kami dengan kalian, sebab kebenaran telah terang dan jelas. اللهُ يَجْمَعُ بَيْنَنَا ۖ (Allah mengumpulkan antara kita) Di padang mahsyar. وَإِلَيْهِ الْمَصِيرُ (dan kepada-Nya-lah kembali (kita)”) Yakni Allah adalah tempat kembali di hari kiamat, dan Dia akan membalas kita semua sesuai dengan amalan masing-masing."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "15. Oleh karena apa yang telah disebutkan sebelumnya, berupa kesepahaman dan pertentangan tentang agama yang lurus, maka ajaklah manusia untuk mengesakan Allah wahai rasulallah! Beristiqamahlah dalam dakwahmu dan penyampaian risalahmu sebagaimana yang diperintahkan Allah kepadamu dan janganlah ikuti hawa nafsu orang-orang musyrik yang rusak itu. Katakanlah (kepada mereka): “Aku mengimani (aku membenarkan) seluruh kitab yang diturunkan Allah kepada para rasulNya. Aku juga diperintahkan untuk berbuat adil tentang hukum-hukum Allah di antara kalian. Allah adalah Tuhan kami dan Tuhan kalian. Bagi kami amal perbuatan kami, dan bagi kalian amal perbuatan kalian. Dia membalas keduanya sesuai amal perbuatan masing-masing. Tidak ada perselisihan dan perdebatan antara kami dan kalian. Allah mengumpulkan kita semua di padang mahsyar pada hari kiamat dan hanya kepadaNyalah tempat kembali. Dia akan membalas keduanya sesuai amal perbuatan masing-masing”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Oleh karena itu} Maka kepada agama yang lurus tersebut {serulah (mereka), tetaplah sebagaimana yang diperintahkan kepadamu} tetaplah pada agam itu sebagaiman yang diperintahkan Allah kepadamu {dan janganlah mengikuti keinginan mereka. Katakanlah,“Aku beriman kepada kitab yang diturunkan Allah dan aku diperintahkan agar berlaku adil di antara kalian. Allah adalah Tuhan kami dan Tuhan kalian. Bagi kami perbuatan kami dan bagi kalian perbuatan kalian. Tidak (perlu) ada perdebatan} tidak ada perdebatan {di antara kami dan kalian. Allah mengumpulkan kita dan kepadaNyalah tempat kembali”} tempat kembali"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "15. “Maka karena itu serulah,” maksudnya, maka untuk Agama yang benar dan jalan yang lurus yang karenanya Allah menurunkan kitab-kitabNya dan mengutus para rasulNya, serulah umatmu kepadanya dan himbaulah mereka kepadanya serta tegakkanlah jihad karenanya terhadap siapa saja yang tidak menerimanya. “Dan tetaplah,” yakni istiqamahlah kamu sendiri “sebagaimana diperintahkan kepadamu,” yaitu istiqamah yang sejalan yang perintah Allah, tidak ada sikap berlebihan ataupun mengabaikan, melainkan kepatuhan kepada perintah-perintah Allah dan menjauhi larangan-laranganNya secara kontinu. Jadi, Allah memerintahkan NabiNya untuk menyempurnakan dirinya dengan menetapi istiqamah dan menyempurnakan orang-orang lain dengan mengajak mereka kepada hal itu. Dan suatu yang dimaklukmi, bahwa perintah kepada Rasulullah itu adalah juga merupakan perintah kepada umatnya apabila tidak ada nash yang mengecualikannya. “Dan janganlah mengikuti hawa nafsu mereka,” maksudnya, hawa nafsu orang-orang yang menyimpang dari Agama, yaitu orang-orang kafir dan kaum munafik. Mengikuti mereka bisa dengan mengikuti sebagian ajaran agama mereka, atau dengan meninggalkan dakwah kepada Allah, atau dengan mengabaikan istiqamah. Sebab, jika kamu mengikuti hawa nafsu mereka setelah datang kepadamu ilmu, maka sesungguhnya engkau benar-benar termasuk orang-orang yang zhalim. Allah tidak mengatakan: “Jangan kamu ikuti agama mereka, karena hakikat agama mereka yang disyariatkan oleh Allah untuk mereka adalah agama para rasul semuanya, namun mereka tidak mengikutinya, malah mengikuti hawa nafsu, dan mereka menjadikan agama sebagai perbuatan sia-sia dan mainan. “Dan katakanlah” kepada mereka ketika berdebat dengan mereka, “Aku beriman kepada semua kitab yang diturunkan Allah,” maksudnya, agar debatmu kepada mereka berdasarkan prinsip yang sangat agung ini, yang menunjukkan kepada kemuliaan Islam, kebesaran dan hegemoninya terhadap seluruh agama, dan bahwa agama yang dianut oleh Ahlul KItab itu hanyalah bagian dari Islam. Di sini terdapat petunjuk bahwa Ahlul KItab, jika mereka berdebat dengan suatu perdebatan yang dilandasi iman (keyakinan) kepada sebagian kitab-kitab suci atau sebagian rasul dengan mengabaikan yang lainnya, maka hal itu tidak boleh diterima. Sebab, Kitab suci yang mereka serukan dan rasul yang mereka klaim itu di antara syaratnya adalah ia harus membenarkan al-Quran ini dan nabi yang membawanya. Karena Kitab suci kita dan rasul kita tidak memerintahkan kita melainkan supaya kita beriman kepada Nabi Musa dan Nabi Isa, Taurat dan Injil yang al-Quran memberitakan dan membenarkannya, dan ia juga menginformasikan bahwa Taurat dan Injil membenarkan al-Quran dan mengakui kebenarannya. Adapun kalau hanya sekedar Taurat dan Injil, Musa dan Isa yang mereka akui, dan tidak mengaku kita dan tidak menyetujui Kitab kita, maka kita tidak disuruh mempercayai mereka. firmanNya, “Dan aku diperintahkan supaya berlaku adil di antara kamu,” maksudnya, dalam memberikan putusan di antara apa yang kalian perselisihkan. Maka permusuhan kalian dan kebencian kalian terhadapku, wahai Ahlul Kitab, tidak akan menghalangiku untuk berlau adil terhadap kalian. Termasuk adil dalam memberikan putusan di antara mereka yang memiliki banyak pendapat yang berbeda-beda dari kaum Ahli KItab dan lain-lainnya adalah menerima kebenaran yang ada pada mereka dan menolak kebatilan yang ada pada mereka. “Allah adalah Rabb kami dan Rabb kamu,” maksudnya, Rabb bagi semua. Kalian tidak lebih berhak daripada kami, “Bagi kami amal-amal kami dan bagi kamu amal-amal kamu,” yang baik dan yang buruk, “tidak ada pertengkaran antara kami dan kamu” setelah semua kenyataan menjadi jelas dan kebenaran menjadi nyata dari yang batil, dan petunjuk dari kesesatan. Tidak ada tempat lagi bagi berdebat dan bertengkar. Sebab maksud dari debat itu adalah menjelaskan yang benar dari yang batil, agar orang yang jujur mendapat petunjuk, dan hujjah (argument) tegak atas orang yang tersesat. Bagaimana tidak, sedangkan Allah sudah berfirman , “Dan janganlah kamu berdebat dengan Ahli Kitab, melainkan dengan cara yang paling baik,” -Al- ankabut: 46- Maka sesungguhnya yang dimaksud adalah apa yang telah kami jelaskan itu. “Allah akan mengumpulkan antara kita dan kepadaNya- lah (semua akan) kembali pada Hari Kiamat kelak. Lalu Dia akan memberikan balasan kepada masing-masing menurut perbuatannya, dan pada saat itu akan terungkap yang benar dari yang dusta."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syura ayat 15: (Maka karena itu) karena ajaran tauhid itu (serulah) manusia, hai Muhammad (dan tetaplah) berpegang teguh kepada ajaran tauhid (sebagaimana diperintahkan kepadamu dan janganlah mengikuti hawa nafsu mereka) yang membujukmu untuk meninggalkan ajaran tauhid (dan katakanlah, \"Aku beriman kepada semua Kitab yang diturunkan Allah dan aku diperintahkan supaya berlaku adil) bersikap adil (di antara kalian) dalam masalah memutuskan hukum (Allahlah Rabb kami dan Rabb kalian. Bagi kami amal-amal kami dan bagi kalian amal-amal kalian) masing-masing akan mendapatkan balasan amalnya sendirisendiri. (Tidak ada pertengkaran) persengketaan (antara kami dan kalian) ayat ini diturunkan sebelum nabi diperintahkan untuk berjihad melawan mereka (Allah mengumpulkan antara kita) pada hari semua manusia dikembalikan kepada-Nya untuk menjalani peradilan di hadapan-Nya (dan kepada-Nyalah kembali kita\") kita akan dikembalikan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni kepada agama yang lurus dan agama yang benar, dimana Al Qur’an Allah turunkan membawanya dan para rasul diutus Allah dengan membawanya. Oleh karena itu, serulah umatmu kepadanya dan dorong mereka kepadanya serta berjihadlah melawan orang-orang yang tidak menerimanya. Maksudnya, tetaplah dalam agama dan lanjutkanlah berdakwah. Atau tetaplah sesuai perintah Allah, tidak meremehkan dan tidak berlebihan, bahkan di atas perintah Allah dan menjauhi larangan-Nya dengan konsisten di atasnya. Dalam ayat ini Allah memerintahkan Beliau shallallahu 'alaihi wa sallam untuk menyempurnakan dirinya dengan tetap istiqamah dan menyempurnakan orang lain dengan berdakwah kepadanya. Sudah menjadi maklum perintah kepada Nabi Muhammad shallallahu 'alaihi wa sallam menjadi perintah pula untuk umatnya jika tidak ada takhshis(pengkhusus)nya. Yakni hawa nafsu orang-orang yang menyimpang dari agama seperti orang-orang kafir dan munafik, bisa dengan mengikuti sebagian agama mereka, meninggalkan dakwah, dan tidak istiqamah. Karena sesungguhnya, jika engkau mengikuti hawa nafsu mereka setelah ilmu datang kepadamu, maka engkau akan menjadi orang-orang yang zalim. Dalam ayat ini Allah Subhaanahu wa Ta'aala tidak berfirman, “Dan janganlah kamu mengikuti agama mereka.” Karena hakikat agama mereka adalah apa yang Allah syariatkan untuk mereka, yaitu agama para rasul, akan tetapi mereka tidak mengikutinya, bahkan mereka mengikuti hawa nafsu mereka dan menjadikan agama mereka sebagai bahan permainan. Ketika berdebat dengan mereka. Yakni hendaknya perdebatan mereka didasari atas asas yang besar ini, dimana hal ini menunjukkan kemuliaan Islam, keagungannya, dan pengawasannya terhadap semua agama. Dalam ayat ini terdapat petunjuk bahwa Ahli Kitab jika mereka mengajak berdebat atas dasar beriman kepada sebagian kitab atau sebagian rasul, maka tidak diterima, karena kitab yang mereka serukan kepadanya dan rasul yang mereka menisbatkan diri kepadanya mensyaratkan harus membenarkan semua kitab dan semua rasul. Yakni dalam memberikan keputusan terhadap hal yang kamu perselisihkan. Oleh karena itu, wahai Ahli Kitab! Janganlah kebencian dan permusuhanmu menghalangimu untuk berbuat adil terhadap kami. Yakni Tuhan kita semuanya. Masing-masing dibalas sesuai amalnya. Maksudnya, setelah jelas hakikatnya, kebenaran daripada kebatilan juga menjadi jelas, petunjuk daripada kesesatan juga menjadi jelas, maka tidak ada lagi perdebatan, karena maksud dari perdebatan adalah adalah menerangkan yang hak dari yang batil agar orang yang cerdas mendapat petunjuk dan agar hujjah tegak kepada orang-orang yang sesat, namun hal ini bukanlah berarti bahwa Ahli Kitab tidak didebat, tetapi maksudnya seperti tadi. Yakni pada hari Kiamat, lalu Dia membalas masing-masing sesuai amalnya dan ketika itu jelaslah yang benar daripada yang dusta."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syura Ayat 15",
    "description": "Karena itu, apa pun sikap mereka terhadap kamu, termasuk keraguan mereka yang mendalam terhadap ajaran-ajaran yang kamu sampaikan, serulah mereka dengan penuh kesabaran untuk beriman kepada tuhanmu dan tetaplah beriman dan berdakwah sebagaimana diperintahkan tuhanmu kepadamu Muhammad dan janganlah mengikuti keinginan mereka dalam hal apa pun dan katakanlah kepada mereka yang kafir dan ragu itu dengan tegas, 'aku beriman kepada kitab yang diturunkan Allah dan apa yang diturunkan-Nya di dalam kitab suci-Nya dan aku diperintahkan agar berlaku adil di antara kamu sekalian. Allah adalah tuhan kami dan juga tuhan kamu, yang menciptakan, memelihara, mendidik, dan membimbing ke jalan yang benar, dan memberi balasan atas apa yang kita kerjakan. Bagi kami perbuatan kami dan kami akan mempertanggungjawabkannya dan bagi kamu perbuatan kamu dan kamu akan mempertanggungjawabkannya di hadapan-Nya. Tidak perlu lagi ada pertengkaran antara kami dan kamu, Allah mengumpulkan antara kita di hari kiamat nanti dan memutuskan perbedaan di antara kita dan kepada-Nyalah kita semua kembali. '16. Ayat yang lalu menegaskan bahwa tidak ada lagi bantahan yang terjadi antara orang-orang beriman dan orang-orang kafir. Dalam ayat ini Allah menyatakan bahwa orang-orang yang berbantah-bantah tentang agama Allah dan berusaha memalingkan orang-orang yang beriman dari agama-Nya setelah agama itu di terima dan di imani oleh mereka, perbantahan mereka itu menjadi sia-sia di sisi tuhan mereka. Mereka mendapat kemurkaan Allah dengan dijauhkannya mereka dari rahmat-Nya sebagai akibat dari perbuatan mereka dan mereka mendapat azab yang sangat keras di akhirat kelak."
  }
]