[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang yang mendebat agama Allah yang dengannya Aku mengutus Muhammad setelah manusia menjawab ajakannya dan mereka masuk islam, hujjah dan debat mereka batil lagi sia-sia di sisi tuhan mereka. Bagi mereka dari Allah kemurkaan di dunia dan diakhirat mereka mendapatkan azab yang keras, yaitu api neraka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Dan orang-orang yang membantah dengan hujah-hujah yang sesat tentang agama yang diturunkan kepada Muhammad -ṣallallāhu 'alaihi wa sallam- setelah manusia menerima dakwahnya, maka hujah-hujah mereka tidak bernilai dan sia-sia di sisi Rabb mereka dan di sisi orang-orang yang beriman, tidak punya pengaruh. Mereka akan mendapat murka Allah akibat kekufuran dan penolakan mereka terhadap kebenaran dan mereka akan merasakan azab pedih yang menanti di hari Kiamat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "16. Orang-orang kafir yang mendebat agama Allah setelah agama ini diterima manusia, maka hujjah mereka batil di sisi Allah dan mereka mendapat kemurkaan dari-Nya di dunia, sedangkan di akhirat mereka akan mendapat siksaan yang berat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "16. وَالَّذِينَ يُحَآجُّونَ فِى اللهِ مِنۢ بَعْدِ مَا اسْتُجِيبَ لَهُۥ (Dan orang-orang yang membantah (agama) Allah sesudah agama itu diterima) Mujahid berkata: mereka adalah suatu kaum yang menyangka bahwa kejahiliyahan akan kembali sehingga mereka mendebat orang-orang yang telah masuk Islam dengan harapan mereka dapat kembali kepada kejahiliyahan. Qatadah berkata: mereka adalah orang-orang Yahudi dan Nasrani. Dan bantahan mereka adalah dengan mengatakan “nabi kami diutus sebelum nabi kalian dan kitab kami diturunkan sebelum kitab kalian.” حُجَّتُهُمْ دَاحِضَةٌ عِندَ رَبِّهِمْ(maka bantahan mereka itu sia-sia saja, di sisi Tuhan mereka) Yakni hujjah mereka tidak memiliki kekuatan, seperti sesuatu yang tergelincir dari tempatnya. وَعَلَيْهِمْ غَضَبٌ(Mereka mendapat kemurkaan (Allah)) Yakni kemurkaan yang besar dari Allah akibat bantahan mereka untuk membela kebatilan. وَلَهُمْ عَذَابٌ شَدِيدٌ(dan bagi mereka azab yang sangat keras) Di akhirat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16. Orang-orang yang berdebat tentang agama Allah sesudah agama itu diterima oleh manusia, maka hujjah mereka itu sia-sia di sisi Tuhan mereka dan tidak berdasar. Bagi mereka itu kemarahan besar dari Allah akibat perdebatan mereka yang bathil dan bersikeras atas kekufuran mereka. Bagi mereka itu siksa yang amat dahsyat lagi menyakitkan di akhirat akibat kekufuran mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Orang-orang yang berbantah-bantahan tentang Allah} berdebat tentang agama Allah {setelah (agama itu) diterima} manusia menerima agama Allah, lalu mereka berserah diri dan masuk agamaNya {maka perdebatan mereka itu sia-sia} lenyap dan sia-sia {di sisi Tuhan mereka. Bagi mereka itu kemurkaan dan azab yang sangat keras"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "16. Ini adalah pengukuhan terhadap Firman Allah (pada ayat sebelumnya) “Tidak ada hujjah di antara kami dengan kalian.” Di sini Allah mengabarkan bahwa “orang-orang yang membantah Allah” dengan argument-argument yang palsu dan syubhat-syubhat yang kontradiksi, “sesudah ia diterima” untuk Allah, yakni, sesudah orang-orang yang berakal menerima seruan Allah setelah Dia menjelaskan kepada mereka ayat-ayat yang pasti dan argument-argumen yang akurat, maka mereka yang membantah kebenaran itu setelah kebenaran itu jelas, “maka bantahan mereka itu sia-sia saja,” artinya, palsu lagi tertolak, “di sisi Rabb mereka,” sebab ia mengandung penolakan terhadap kebenaran; dan setiap yang menyalahi kebenaran itu pasti batil. “Mereka mendapat kemurkaan,” karena kedurhakaan dan sikap berpaling mereka dari hujjah-hujjah Allah dan penjelasan-penjelasanNya dank arena mereka mendustakannya, “dan bagi mereka azab yang sangat keras.” Dan itu adalah akibat dari murka Allah terhadap mereka. Inilah hukuman bagi setiap orang yang mendebat kebenaran dengan kebatilan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syura ayat 16: (Dan orang-orang yang membantah) agama (Allah) maksudnya, membantah Nabi-Nya (sesudah agama itu diterima) sesudah diimani dan nyatanya mukjizat yang dibawanya, yang dimaksud dengan mereka adalah orang-orang Yahudi (maka bantahan mereka itu sia-sia saja) atau batil (di sisi Rabb mereka. Mereka mendapat kemurkaan Allah dan bagi mereka azab yang sangat keras.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Hal ini menguatkan firman-Nya di ayat sebelumnya, “Tidak (perlu) ada pertengkaran antara kami dan kamu.” Di ayat ini Allah memberitahukan bahwa orang-orang yang membantah agama Allah dengan hujjah-hujjah yang batil serta syubhat yang bertentangan. Oleh orang-orang yang berakal setelah Allah menerangkan kepada mereka ayat-ayat yang qath’i (pasti) dan hujjah yang jelas, maka mereka yang mendebat kebenaran setelah jelas seperti yang dilakukan orang-orang Yahudi, hujjahnya batal dan tertolak di sisi Tuhan mereka, karena mengandung penolakan terhadap yang hak, sedangkan segala sesuatu yang menyelisihi yang hak adalah batil. Karena kedurhakaan mereka dan berpalingnya mereka dari hujjah-hujjah Allah serta bukti-buktinya dan karena mereka mendustakannya. Itu merupakan atsar (bekas) dari kemurkaan Allah kepada mereka. Inilah hukuman bagi setiap orang yang mendebat yang hak dengan yang batil."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syura Ayat 16",
    "description": "Ayat yang lalu menegaskan bahwa tidak ada lagi bantahan yang terjadi antara orang-orang beriman dan orang-orang kafir. Dalam ayat ini Allah menyatakan bahwa orang-orang yang berbantah-bantah tentang agama Allah dan berusaha memalingkan orang-orang yang beriman dari agama-Nya setelah agama itu di terima dan di imani oleh mereka, perbantahan mereka itu menjadi sia-sia di sisi tuhan mereka. Mereka mendapat kemurkaan Allah dengan dijauhkannya mereka dari rahmat-Nya sebagai akibat dari perbuatan mereka dan mereka mendapat azab yang sangat keras di akhirat kelak. 17. Bantahan-bantahan yang dilakukan orang-orang kafir, seperti yang digambarkan di dalam ayat sebelumnya, didasarkan pada pemikiran mereka. Ayat ini menjelaskan bahwa ajaran ilahi didasarkan pada kitab suci yang hak. Allah menegaskan bahwa Allah yang telah menurunkan kitab suci Al-Qur'an kepada nabi Muhammad, dan kitab-kitab suci yang lain kepada para rasul sebelum beliau dengan membawa kebenaran yang bersumber dari yang mahabenar dan kitab suci itu juga menjadi neraca keadilan untuk menetapkan hukum di antara manusia. Dan tahukah kamu, wahai manusia, tentang waktu kedatangan hari kiamat, dan bersiap-siaplah untuk menghadapinya karena boleh jadi hari kiamat itu sudah dekat waktu kedatangannya'."
  }
]