[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah lah yang menurunkan al-qur’an dan kitab lainnya dengan kebenaran, Dia juga menurunkan timbangan, yaitu keadilan supaya memerikan keputusan hukum diantara mausia dengan obyektif. Tahukah kamu, bahwa boleh jadi saat kehadiran memang sudah dekat?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Allah lah yang menurunkan kitab-kitab dengan membawa kebenaran yang tiada keraguan sedikitpun padanya, dan Allah menurunkan keadilan untuk dijadikan patokan hukum di antara manusia dengan objektif. Dan bisa jadi hari Kiamat yang mereka dustakan itu sudah dekat, dan telah dimaklumi bahwa setiap yang akan datang itu dekat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "17-18. Allah menurunkan al-Qur’an dan kitab-kitab lainnya dengan berisi kebenaran dan menurunkannya dengan adil untuk memberi ketetapan di antara manusia dengan penuh keadilan. Dan bagaimana menurutmu jika hari kiamat sebentar lagi terjadi, sedangkan dirimu tidak mengetahuinya? Itulah hari kiamat yang orang-orang kafir ingin agar ia segera terjadi sebagai bentuk olokan mereka. Sedangkan orang-orang beriman merasa takut dari kejadiannya, dan mereka sangat yakin ia pasti akan terjadi. Hai para hamba, ketahuilah bahwa orang-orang yang membantah terjadinya hari kiamat itu berada dalam kesesatan yang jauh dari kebenaran."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "17. اللهُ الَّذِىٓ أَنزَلَ الْكِتٰبَ بِالْحَقِّ (Allah-lah yang menurunkan kitab dengan (membawa) kebenaran) Ayat ini meliputi seluruh kitab yang diturunkan Allah kepada para rasul. وَالْمِيزَانَ ۗ( dan (menurunkan) neraca (keadilan)) Yakni menurunkan keadilan. Keadilan disebutkan dengan kata ‘neraca’ karena neraca adalah alat untuk menyamakan berat sesuatu dalam jual beli. Pendapat lain mengatakan yang dimaksud dengan neraca dalam kitab yang diturunkan Allah adalah penjelasan tentang kebaikan dan keburukan. Pendapat lain mengatakan yang dimaksud adalah Allah mengajarkan manusia untuk menimbang dengan neraca agar hak-hak diantara mereka tidak dizalimi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17. Allah adalah Dzat yang menurunkan Al-Qur’an dan seluruh kitab disertai dengan kebenaran. Dia menurunkan kaidah-kaidah keadilan untuk digunakan sebagai pedoman hukum di antara manusia (Keadilan itu dinamakan sebagai timbangan karena itu adalah alat keadilan). Dan tahukah kamu wahai manusia, barangkali waktu kiamat itu sangat dekat kejadiannya. Maknanya adalah dengan menurunkan timbangan itu akan ada keadilan dan penerapannya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah yang menurunkan kitab} Al-Qur’an {dengan benar} dengan benar {dan timbangan} keadilan {Pakah kamu mengetahui} Apakah kamu mengetahui {boleh jadi hari kiamat itu sudah dekat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17. Setelah Allah menjelaskan bahwa argument-argumenNya jelas lagi nyata sehingga setiap orang yang masih memiliki secuil kebaikan pasti menerimanya, maka Allah menjelaskan dasar dan kaidahnya, bahkan seluruh argument yang Dia sampaikan kepada manusia itu kembali kepadaNya, seraya berfirman, “Allah-lah yang menurunkan kitab dengan kebenaran dan neraca.” Kitab yang dimaksud adalah al-Quran al- ‘Azhim yang turun dengan benar dan meliputi kebenaran, kejujuran dan keyakinan. Semuanya adalah ayat-ayat yang sangat jelas dan dalil-dalil yang nyata tentang seluruh al-mathalib al-ilahiyah (tuntutan-tuntutan ilahi) dan akidah-akidah keagamaan. Ia datang dengan membawa permasalahan-permasalahan yang terbaik dan dalil-dalil yang paling jelas. Adapun al-Mizan adalah keadilan dan pengakuan terhadap qiyas (analogi) yang benar dan akal yang sehat. Maka setiap dalil ‘aqli (rasional) dari tanda-tanda yang ada di dalam jagat raya dan yang ada di dalam jiwa, dalil-dalil syar’I, kolerasi-kolerasi, illat-illat (alasan-alasan hukum), hukum-hukum dan hikmah-hikmah itu, masuk ke dalam arti al-Mizan yang diturunkan Allah dan yang diletakanNya di antara hamba-hambaNya agar mereka menimbang dengannya semua perkara yang ditetapkanNya dan yang dinafikanNya, dan agar mereka tahu dengannya kebenaran apa-apa yang diberitakanNya dan disampaikan oleh rasul-rasulNya. Maka apa saja yang keluar dari dua perkara ini (dari al-Kitab dan al-Mizan) yang disebut hujjah, argument atau dalil atau ungkapan apa saja yang serupa dengannya, maka ia adalah kebatilan nan kontradiksi yang dasar-dasarnya sudah berantakan dan pondasi-pondasi dan cabang-cabangnya yang telah runtuh dapat diketahui oleh siapa saja yang menguasai permasalahan-permasalahan dan jalur-jalurnya, dan bisa memilah antara dalil-dalil yang kuat dari yang lemah, dan tahu perbedaan antara hujjah dengan syubhat. Adapun orang yang terpedaya dan terpesona dengan ungkapan-ungkapan yang indah dan kata-kata yang samar, sedangkan pikirannya tidak sampai kepada makna yang dimaksud maka ia tidak tergolong ahli dan tidak pula termasuk pakar dalam bidang ini. Maka sikapnya yang menyetujui dan menyelisihi tidak berguna. Kemudian Allah berfirman seraya mempertakuti orang-orang yang minta agar kiamat segera didatangkan, yaitu mereka yang mengingkarinya, seraya berfirman “Dan tahukah kamu, boleh jadi hari KIamat itu dekat.” Maksudnya, tidak diketahui jauhnya ataupun kapan ia akan terjadi. Ia bisa saja terjadi pada suatu waktu dan kepastiannya sangat menakutkan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syura ayat 17: (Allahlah yang menurunkan Kitab) Alquran (dengan membawa kebenaran) lafal Bil Haqqi berta'alluq kepada lafal Anzala (dan neraca), keadilan. (Dan tahukah kamu) apakah kamu tahu (boleh jadi kiamat itu) yakni kedatangannya (sudah dekat?) lafal La'alla amalnya di-ta'alluq-kan kepada Fi'il dan lafal-lafal sesudahnya berkedudukan sebagai dua Maf'ul."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala menerangkan bahwa hujjah-hujah-Nya begitu jelas dan terang, dimana hujjah-Nya diterima oleh orang yang memiliki kebaikan, maka Allah menyebutkan dasar dan kaidahnya, bahkan merupakan semua hujjah yang Allah sampaikan kepada hamba. Kitab di sini adalah Al Qur’an. Ia turun dengan membawa kebenaran, mengandung kebenaran, kejujuran dan keyakinan. Semuanya adalah ayat-ayat yang jelas, dalil yang terang terhadap semua tuntutan ilahi dan keyakinan dalam beragama, maka Al Qur’an datang dengan membawa masalah yang paling baik dan dalil yang paling jelas. Adapun neraca, maka maksudnya keadilan dan memandang dengan qiyas yang shahih dan akal yang kuat. Termasuk ke dalam neraca yang Allah turunkan dan letakkan di antara hamba-hamba-Nya adalah semua dalil ‘aqli (akal), baik ayat-ayat yang ada di ufuk maupun yang ada pada diri manusia, memandang dari sisi syar’i, munasabah (kesesuaian), illat (alasan-alasan), hukum-hukum dan hikmah-hikmah. Allah letakkan di antara hamba-hamba-Nya agar mereka menimbang masalah-masalah yang masih samar, mengetahui benarnya apa yang Dia beritakan kepada mereka, dan apa yang diberitakan para rasul-Nya. Oleh karena itu, apa yang berada di luar perkara ini (kitab dan neraca) yang dianggap sebagai hujjah atau dalil maka ia adalah batil dan bertentangan, dimana asasnya rusak, bangunannya roboh demikian pula cabang-cabangnya. Hal itu diketahui oleh orang yang mengetahui masalah dan pengambilannya, mengetahui perbedaan antara dalil yang rajih dengan yang kurang rajih, serta dapat membedakan antara hujjah dan syubhat. Adapun orang yang tertipu dengan ungkapan yang terkesan indah, lafaz yang dihias, bashirah(mata hati)nya tidak sampai kepada makna yang dikehendaki, maka ia tidak termasuk ke dalam orang-orang tersebut. Selanjutnya Allah Subhaanahu wa Ta'aala berfirman menakut-nakuti orang-orang yang meminta disegerakan Kiamat lagi mengingkarinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syura Ayat 17",
    "description": "Bantahan-bantahan yang dilakukan orang-orang kafir, seperti yang digambarkan di dalam ayat sebelumnya, didasarkan pada pemikiran mereka. Ayat ini menjelaskan bahwa ajaran ilahi didasarkan pada kitab suci yang hak. Allah menegaskan bahwa Allah yang telah menurunkan kitab suci Al-Qur'an kepada nabi Muhammad, dan kitab-kitab suci yang lain kepada para rasul sebelum beliau dengan membawa kebenaran yang bersumber dari yang mahabenar dan kitab suci itu juga menjadi neraca keadilan untuk menetapkan hukum di antara manusia. Dan tahukah kamu, wahai manusia, tentang waktu kedatangan hari kiamat, dan bersiap-siaplah untuk menghadapinya karena boleh jadi hari kiamat itu sudah dekat waktu kedatangannya'18. Orang-orang yang tidak percaya akan adanya hari kiamat meminta de-ngan mengolok-olok agar hari itu segera terjadi jika memang betul ada dan akan datang, sedangkan orang-orang yang beriman kepada keniscayaan adanya hari akhir itu merasa takut kepadanya karena aneka ragam siksanya dan mereka yakin bahwa kiamat itu adalah akan terjadi dan kedatangannya merupakan satu hal yang pasti. Ketahuilah bahwa sesungguhnya orang-orang yang membantah tentang terjadinya kiamat itu dan meragukan kedatangannya benar-benar telah tersesat jauh dari kebenaran."
  }
]