[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang yang tidak beriman kepada hari kiamat meminta disegerakannya kiamat sebagai bentuk perolok-olokan dan penghinaan. Sedangkan orang-orang yang beriman kepadanya takut akan terjadinya kimat tersebut, mereka mengetahui bahwa ia adalah haq yang tidak mengandung kebimbangan. Ketahuilah, bahwa orang-orang yang mendebat kedatangan kiamat benar-benar dalam kesesatan yang jauh dari kebenaran."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Orang-orang yang tidak percaya akan datangnya hari Kiamat itu meminta agar hari Kiamat disegerakan, karena mereka tidak percaya dengan hari Perhitungan, balasan baik dan siksa, sementara orang-orang yang beriman kepada Allah merasa takut kepadanya karena mereka tidak mengerti apa yang akan terjadi pada mereka setelah hari itu. Mereka meyakini dengan seyakin-yakinnya bahwa hari Kiamat itu benar adanya, tidak ada keraguan sedikitpun padanya. Dan orang-orang yang membantah tentang hari Kiamat dan meragukan kedatangannya sungguh berada dalam kesesatan yang jauh dari kebenaran."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "18. يَسْتَعْجِلُ بِهَا الَّذِينَ لَا يُؤْمِنُونَ بِهَا ۖ (Orang-orang yang tidak beriman kepada hari kiamat meminta supaya hari itu segera didatangkan) Permintaan mereka agar hari kiamat disegerakan adalah dengan olokan-olokan mereka terhadap hari kiamat dan pendustaan mereka terhadap kedatangannya. وَالَّذِينَ ءَامَنُوا۟ مُشْفِقُونَ مِنْهَا(dan orang-orang yang beriman merasa takut kepadanya) Yakn mereka merasa takut dan khawatir terhadap kedatangannya, sebab mereka mengetahui bahwa mereka akan dihisab dan dibalas atas amalan mereka. وَيَعْلَمُونَ أَنَّهَا الْحَقُّ (dan mereka yakin bahwa kiamat itu adalah benar (akan terjadi)) Yakni hari kiamat itu pasti akan datang. أَلَآ إِنَّ الَّذِينَ يُمَارُونَ فِى السَّاعَةِ(Ketahuilah bahwa sesungguhnya orang-orang yang membantah tentang terjadinya kiamat itu) Yakni mereka mendebat tentang kejadiannya karena keraguan mereka terhadap hal itu. لَفِى ضَلٰلٍۭ بَعِيدٍ(benar-benar dalam kesesatan yang jauh) Yakni jauh dari kebenaran. Seandainya mereka mau memikirkan niscaya mereka akan mengetahui bahwa Dzat yang mampu menciptakan mereka pertama kali pasti mampu mengulangi penciptaan itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "18. Sebagai wujud ejekan, Orang-orang yang mengingkari kiamat itu minta agar waktu kiamat itu dipercepat. Sedangkan orang-orang yang mengimaninya, mereka takut akan kedatangannya. Mereka juga tahu, bahwa kiamat itu pasti terjadi dan tidak ada keraguan di dalamnya. Ingatlah (berfungsi sebagai peringatan bagi pendengar yang ada pada kalimat setelahnya) sesungguhnya orang-orang yang membantah dan mengingkari adanya kiamat itu tersesat (menyimpang) dari jalan kebenaran dan petunjuk, serta jauh dari kebenaran"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang tidak percaya kepadanya meminta agar disegerakan, dan orang-orang yang beriman merasa takut kepadanya} takut terhadap kejadiannya {dan yakin bahwa hari kiamat itu adalah benar. Ketahuilah sesungguhnya orang-orang yang membantah} membantah {tentang kiamat itu benar-benar berada dalam kesesatan yang jauh"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "18. “Orang-orang yang tidak beriman kepada Hari KIamat meminta supaya hari itu segera didatangkan,” sebagai sikap keras kepala dan mendustakan serta menentang Allah. “Dan orang-orang yang beriman merasa takut kepadanya,” maksudnya, mereka takut karena mereka beriman kepadanya dank arena mereka mengetahui apa-apa yang ada pada Hari KIamat itu, seperti pembalasan terhadap amal perbuatan, dan takutnya mereka karena mereka mengenal Allah, mereka khawatir kalau amal-amal perbuatan mereka tidak bisa menyelamatkan mereka dan tidak bisa membahagiakan. Maka dari itu Allah berfirman, “Dan mereka yakin bahwa kiamat itu adalah benar,” yang taka da keraguan padanya dan tidak ada pula kebimbangan. “Ketahuilah bahwa sesungguhnya orang-orang yang membantah terhadap terjadinya kiamat,” setelah mereka meragukannya, mereka membantah para rasul dan para pengikutnya karena mereka membenarkannya. Maka mereka benar-benar dalam sikap menyelisihi “yang jauh”. Artinya, suatu sikap menentang dan sikap membantah yang sama sekali tidak dekat kepada kebenaran, bahkan sangat-sangat jauh dari kebenaran. Dan sikap jauh yang manayang lebih jauh daripada orang yang mendustakan negeri yang merupakan negeri yang sesungguhnya?! Yaitunegeri yang di ciptakan untuk keabadian dan kekekalan, yaitu negeri pembalasan yang di situ Allah menampakan keadilan dan karuniaNya. Dan sesungguhnya negeri dunia ini bila di bandingkan dengan negeri akhirat adalah seperti seorang pengendara yang beristirahat di siang hari di bawah naungan pohon, kemudian ia meneruskan perjalan dan meninggalkanya. Bukan tempat untuk selama-lamanya. Mereka hanya membernarkan negeri yang akan sirnadan fana ini yang bisa mereka lihat dan mereka saksikan saja, dan mereka mendustakan negeri akhirat yang sangat banyak sekali inpormasi tentangnya yang di sampaikan oleh Kitab-kitab suci ilahi, oleh para rasul dan para pengikutnya, yang mana mereka adalah manusia yang paling sempurna akalnya, paling dalam ilmunya, dan paling tinggi kecerdasanyadan pemahamnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syura ayat 18: (Orang-orang yang tidak beriman kepada hari kiamat meminta supaya hari itu segera didatangkan) mereka mengatakan, \"Kapan hari kiamat itu akan datang,\" demikian itu karena mereka menduga bahwa hari kiamat tidak akan datang (dan orangorang yang beriman, merasa takut) merasa khawatir (kepadanya dan mereka yakin bahwa kiamat itu adalah benar akan terjadi Ketahuilah bahwa sesungguhnya orang-orang yang membantah) mendebat (tentang terjadinya hari kiamat itu benar-benar dalam kesesatan yang jauh.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan sikap membangkang, mendustakan, dan melemahkan Tuhannya. Yakni takut karena keimanan mereka kepadanya, mereka tahu sesuatu yang akan terjadi pada hari itu yaitu pembalasan terhadap amal, mereka takut karena mereka kenal Tuhan mereka; mereka takut jika amal mereka tidak membahagiakan mereka dan tidak menyelamatkan. Yakni setelah mereka membantahnya; membantah rasul dan para pengikutnya yang menetapkan adanya Kiamat, maka sesungguhnya mereka berada dalam pertengkaran dan permusuhan yang jauh dari kebenaran, bahkan jauh sekali. Padahal sesuatu apa yang lebih jauh dari kebenaran daripada orang-orang yang mendustakan negeri yang sebenarnya; negeri yang diciptakan untuk tetap dan kekal; negeri tempat pembalasan yang di sana Allah menampakkan keadilan dan karunia-Nya, sedangkan negeri ini (dunia) jika dibandingkan dengannya seperti orang yang mengendarai kendaraan yang beristirahat di bawah naungan pohon lalu ia pergi meninggalkannya. Negeri tersebut adalah negeri tempat berlalu dan bukan tempat menetap. Tetapi mereka malah membenarkan negeri yang akan sirna dan fana karena mereka menyaksikannya dan mendustakan negeri akhirat yang telah mutawatir diberitakan oleh kitab-kitab samawi dan para rasul yang mulia serta para pengikutnya yang merupakan makhluk paling sempurna akalnya, paling banyak ilmunya, dan paling dalam kecerdasan dan kepintarannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syura Ayat 18",
    "description": "Orang-orang yang tidak percaya akan adanya hari kiamat meminta de-ngan mengolok-olok agar hari itu segera terjadi jika memang betul ada dan akan datang, sedangkan orang-orang yang beriman kepada keniscayaan adanya hari akhir itu merasa takut kepadanya karena aneka ragam siksanya dan mereka yakin bahwa kiamat itu adalah akan terjadi dan kedatangannya merupakan satu hal yang pasti. Ketahuilah bahwa sesungguhnya orang-orang yang membantah tentang terjadinya kiamat itu dan meragukan kedatangannya benar-benar telah tersesat jauh dari kebenaran. 19. Ayat ini menggambarkan beberapa sifat Allah. Sifat-sifat itu adalah bahwa Allah mahalembut terhadap hamba-hamba-Nya dengan melimpahkan banyak rahmat dan kebaikan kepada mereka dengan sangat mudah; dia memberi rezeki, yakni berbagai anugerah kenikmatan kepada siapa yang dia kehendaki tanpa diskriminasi sesuai dengan upaya dan kemaslahatan mereka tanpa dia memperhitungkan sejauh mana kebaikan hamba itu terhadap-Nya dan dia mahakuat terhadap segala anugerah-Nya sehingga tidak ada yang dapat menahan pemberian-Nya, mahaperkasa terhadap segala keinginannya sehingga tidak ada yang dapat menghalanginya."
  }
]