[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah maha lembut kepada hamba-hamabNya Dia melapangkan rizki bagi siapa yang Dia kehendaki dan menyempitkannya bagi siapa yang Dia kehendaki sesuai dengan hikmahNya. Dia maha kuat yang memiliki seluruh kekuatan, maha perkasa dalam pembalasanNya terhadap orang-orang yang bermaksiat kepadaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Allah Mahalembut kepada para hamba-Nya, memberi rezeki kepada yang dikehendaki-Nya, melapangkan rezeki baginya dan menyempitkan rezeki atas orang yang dikehendaki-Nya sebagai kasih sayang kepadanya meski nampaknya tidak demikian. Dia Mahakuat, tidak ada yang mengalahkan-Nya dan Maha Perkasa yang membalas para musuh-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "19. Allah Maha Lembut kepada hamba-hamba-Nya; Dia memberi rezeki kepada siapa yang Dia kehendaki dari mereka. Dia Maha Kuat, tidak ada yang dapat mengalahkan-Nya, dan Dia Maha Perkasa dalam memberi balasan bagi musuh-musuh-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "19. اللهُ لَطِيفٌۢ بِعِبَادِهِۦ (Allah Maha lembut terhadap hamba-hamba-Nya) Yakni Allah sangat lembut dan mengasihi mereka. Dan salah satu bentuk kasih sayang Allah adalah Dia memberi rezeki kepada mereka untuk kehidupan mereka di dunia. يَرْزُقُ مَن يَشَآءُ ۖ (Dia memberi rezeki kepada yang di kehendaki-Nya) Dengan cara yang Allah kehendaki. Dia meluaskan rezeki sebagian hamba-Nya dan menyempitkan bagi hamba-Nya yang lain."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19. Allah itu lembut dan bermurah hati kepada hamba-hambaNya, sehingga Dia tidak mempercepat azab mereka. Dia juga Dzat yang banyak kebaikanNya terhadap mereka. Dia memberi rejeki orang dikehendaki di antara mereka sesuai kebijaksanaanNya, baik melimpah atau sedikit. Dialah Dzat yang luas kekuasaanNya lagi Maha Kuat dan tak terkalahkan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah Maha lembut terhadap hamba-hambaNya. Dia memberi rezeki kepada siapa saja yang Dia kehendaki. Dia Maha kuat lagi Maha perkasa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "19. Allah menyampaikan sikap lembutNya terhadap hamba-hambaNya agar mereka mengenal dan mencintainya dan agar mereka membicarakan kelembutan dan kemurahaNya. Kelembutan itu merupakan bagian dari sipat-sipatNya yang artinya adalah: Dia yang mengetahui segala yang tersembunyi dan rahasia, yang mengantarkan hamba-hambaNya terutama orang-orang yang beriman kepada apasaja yang mengandung kebaikan bagi mereka tanpa mereka ketahui dan tanpa mereka duga. Diantara kelembutaNya terhadap hamba-hambaNya yang beriman adalah dia menunjuki mereka kepada kebaikan dengan petunjuk yang tidak pernah terlintas di benak mereka, dengan memudahkan baginya sebab-sebab yang mengarakan mereka kepada kebaikan tersebut dari dalam fitrah mereka melalui kecintaanya kepada yang benardan kepatuhanya kepada kebenaran itu serta perintahnya kepada para malaikatyang mulia untuk meneguhkan hamba-hambaNya yang beriman dan merangsang mereka untuk melakukan kebaikan dan meniupkan di dalam hati mereka ketertarikan kepada yang benar sehingga menjadi pemicu untuk mengikutinya. Dan termasuk kelembutaNya juga adalah Dia memerintahkan kepeda orang-orang yang beriman untuk melakukan berbagai ibadah sosial yang denganya tekad mereka menjadi kuat dan gairah mereka mengeliat serta menjadi perlombaan di antara mereka untuk melakukan kebajikan dan menyenanginya serta menjadi teladan di antara yang satu sama lainya. Termasuk kelembutanya juga adalah dia telah menetepkan segala sebab yang merintanginya dan mencegahnya dari perbuatan-perbuatan maksiat, hingga apadila Allah telah mengetahui bahwa dunia, harta dan tahta yang serupa dengan akan diperlombakan manusia itu merintangi hambanya dari ketaatan kepadanyaatau membuatnya lalai terhadap Allah atau menyeretnya kepada maksiat, maka Allah menjauhkan hal-hal tersebut darinya dan Allah mempersempit rizkinmya. Maka dari itu di sini dia berfirman, ”Dia memberi rizki kepada siapa yang dikehendakiNya,” tergantung tuntunan hikmah (kebijaksanaan) dan kelembutanNya. “Dan Dia-lah Yang Maha Kuat Lagi Maha Perkasa,” yang milikNyalah seluruh kekuatan, Maka tiada daya dan tiada kekuatan bagi seseorang di antara mahkluk ini kecuali dengan pertolongaNya, yang kepadaNya tunduk segala sesuatu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syura ayat 19: (Allah Maha Lembut terhadap hamba-hamba-Nya) baik terhadap mereka yang berbakti maupun terhadap mereka yang durhaka, karena Dia tidak membinasakan mereka melalui kelaparan sebab kemaksiatan mereka (Dia memberi rezeki kepada siapa yang dikehendaki-Nya) artinya, Dia memberikan kepada masing-masingnya apa yang Dia kehendaki (dan Dialah Yang Maha Kuat) atas semua kehendak-Nya (lagi Maha Perkasa) Maha Menang atas semua perkara-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan kelembutan-Nya kepada hamba-hamba-Nya agar mereka mengenal dan mencintai-Nya dan mencari kelembutan dan kemurahan-Nya. Kelembutan adalah salah satu sifat Allah Ta’ala, maknanya bahwa Dia mengetahui yang tersembunyi maupun yang rahasia, dimana Dia menyampaikan kepada hamba-hamba-Nya –khususnya kaum mukmin- kepada sesuatu yang di sana terdapat kebaikan bagi mereka dari arah yang tidak mereka ketahui dan tidak mereka sangka. Ya Allah, berikanlah kembutan-Mu kepadaku. Ya Allah, berikanlah kelembutan-Mu kepadaku. Ya Allah, berikanlah kelembutan-Mu kepadaku. Di antara kelembutan-Nya kepada hamba-Nya yang mukmin adalah Dia menunjukinya kepada kebaikan dengan petunjuk yang tidak terlintas dalam hatinya karena Dia memudahkan sebab-sebab kepadanya, seperti fitrahnya untuk mencintai yang hak, tunduk kepadanya, ilham Allah Subhaanahu wa Ta'aala kepada para malaikat yang mulia agar mereka mengokohkan hamba-hamba-Nya yang mukmin.dan mendorong mereka kepada kebaikan serta menaruh ke dalam hati mereka indahnya kebenaran yang mendorong mereka untuk mengikutinya. Termasuk kelembutan-Nya adalah Dia memberintahkan kaum mukmin ibadah yang dilakukan secara jama’i (berjamaah), dimana dengannya niat mereka kuat dan cita-cita mereka bangkit dan terjadilah perlombaan kepada kebaikan serta mencintainya, demikian pula mengikutinya sebagian mereka kepada sebagian yang lain. Termasuk kelembutan-Nya adalah Dia menetapkan kepada hamba-Nya semua sebab yang menghalanginya berbuat maksiat, sehingga Allah Subhaanahu wa Ta'aala karena Dia mengetahui bahwa dunia, harta dan kepemimpinan dan yang semisalnya -yang biasa dikejar oleh orang-orang yang cinta dunia-, dimana hal itu dapat memutuskan hamba-Nya dari ketaatan kepada-Nya atau membuatnya lalai dari-Nya atau membuatnya jatuh ke dalam maksiat, maka Dia palingkan hamba-Nya dan membatasi rezekinya. Oleh karena itulah Dia berfirman, “Dia memberi rezeki kepada yang Dia kehendaki,” sesuai hikmah (kebijaksanaan) dan kelembutan-Nya. Dia memiliki kekuatan semuanya, tidak ada daya dan upaya bagi makhluk kecuali dengan pertolongan-Nya, dimana segala sesuatu tunduk kepada-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syura Ayat 19",
    "description": "Ayat ini menggambarkan beberapa sifat Allah. Sifat-sifat itu adalah bahwa Allah mahalembut terhadap hamba-hamba-Nya dengan melimpahkan banyak rahmat dan kebaikan kepada mereka dengan sangat mudah; dia memberi rezeki, yakni berbagai anugerah kenikmatan kepada siapa yang dia kehendaki tanpa diskriminasi sesuai dengan upaya dan kemaslahatan mereka tanpa dia memperhitungkan sejauh mana kebaikan hamba itu terhadap-Nya dan dia mahakuat terhadap segala anugerah-Nya sehingga tidak ada yang dapat menahan pemberian-Nya, mahaperkasa terhadap segala keinginannya sehingga tidak ada yang dapat menghalanginya. 20. Pada ayat yang lalu, Allah menggambarkan orang-orang yang membantah terjadinya kiamat, sedangkan dalam ayat ini Allah menggambarkan keuntungan di akhirat bagi orang-orang yang beriman. Barang siapa menghendaki keuntungan di akhirat melalui amal-amal yang dilakukannya di dunia ini dengan niat yang ikhlas, akan kami tambahkan keuntungan itu baginya dengan melipatgandakan keuntungannya, dan barang siapa menghendaki keuntungan di dunia melalui usaha dan kegiatan yang hanya semata-semata ingin mendapatkan keuntungan dunia, kami berikan kepadanya sebagian dari hasil usahanya itu berupa keuntungan dunia sesuai dengan kehendak kami, tetapi dia tidak akan mendapat bagian di akhirat kelak."
  }
]