[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Barang siapa yang mengnginkan pahala akhirat denagn amalnya, kemudia dia menunaikan hak-hak Allah dan berinfak mendukung dakwah kepada agama, Kami menambahkan amal perbuatannya kebaikan, lalu amal kebaikannya dilipat gandakan sampai sepuluh kali lipat sampai tambahan (yang banyak) yang dikehendaki Allah. Dan barangsiapa yang menginginkan dunia semata dengan amal perbuatannya, maka Kami memberinya apa yang Kami bagikan untuknya, dan di akhirat dia tidak memperoleh pahala apapun."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "20. Barangsiapa menginginkan pahala Akhirat, menjalankan amalan-amalannya maka Kami akan lipat gandakan pahalanya. Kebaikan itu dibalas dengan sepuluh kali lipatnya hingga tujuh ratus kali lipat, hingga berlipat-lipat. Dan barangsiapa menginginkan dunia saja maka Kami akan berikan bagiannya yang telah ditentukan baginya di dunia, dan di Akhirat ia tidak mendapat bagian dikarenakan ia mendahulukan dunia atas Akhirat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "20. Allah mendorong untuk beramal sebagai bekal kehidupan akhirat; barangsiapa yang menginginkan pahala di akhirat dari amalan dan niatannya, maka Kami akan melipatgandakan kebaikannya; dan barangsiapa yang menginginkan kenikmatan dunia semata dari amalannya, maka Kami memberi kepada siapa yang Kami kehendaki dari mereka apa yang Kami mau, namun di akhirat dia tidak akan mendapat balasan pahala. Abu Hurairah berkata, Rasulullah pernah membaca firman Allah: مَن كَانَ يُرِيدُ حَرْثَ ٱلْءَاخِرَةِ نَزِدْ لَهُۥ فِى حَرْثِهِۦ ۖ وَمَن كَانَ يُرِيدُ حَرْثَ ٱلدُّنْيَا نُؤْتِهِۦ مِنْهَا وَمَا لَهُۥ فِى ٱلْءَاخِرَةِ مِن نَّصِيبٍ Barang siapa yang menghendaki keuntungan di akhirat akan Kami tambah keuntungan itu baginya dan barang siapa yang menghendaki keuntungan di dunia Kami berikan kepadanya sebagian dari keuntungan dunia dan tidak ada baginya suatu bahagianpun di akhirat. [Asy-Syura: 20] Kemudian beliau bersabda: “Allah berfirman, ‘Wahai Bani Adam, persembahkanlah dirimu untuk beribadah kepada-Ku, niscaya Aku akan memenuhi dadamu dengan kekayaan dan menutup kemiskinanmu; jika itu tidak kalian lakukan, maka Aku akan memenuhi dadamu dengan kesibukan, dan aku tidak akan menutup kemiskinanmu.” (Diriwayatkan oleh Imam at-Tirmidzi dalam as-Sunan no. 2466, dan mengatakan hadist ini hasan gharib; dan Imam Ibnu Hibban dalam Shahihnya 2/119 no. 393; dan Imam al-Hakim meriwayatkannya dari Ma’qal bin Yasar dengan riwayat yang semisalnya, dishahihkan dan disepakati Imam adz-Dzahabi dalam al-Mustadrak 4/326. Kedua riwayat ini disepakati oleh Syeikh al-Albani dalam as-Silsilah as-Shahihah no. 950)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "20. مَن كَانَ يُرِيدُ حَرْثَ الْاٰخِرَةِ نَزِدْ لَهُۥ فِى حَرْثِهِۦ ۖ(barang siapa yang menghendaki keuntungan di akhirat akan Kami tambah keuntungan itu baginya) Yakni barangsiapa yang menginginkan pahala di akhirat dengan amal perbuatannya, maka Allah akan melipat gandakan pahala itu baginya, setiap satu pahala kebaikan Allah gandakan menjadi sepuluh kali lipat sampai tujuh ratus kali lipat. Pendapat lain mengatakan bahwa Allah akan menambah taufik dan pertolongan serta memudahkannya untuk melakukan amal kebaikan. وَمَن كَانَ يُرِيدُ حَرْثَ الدُّنْيَا نُؤْتِهِۦ مِنْهَا(dan barang siapa yang menghendaki keuntungan di dunia Kami berikan kepadanya sebagian dari keuntungan dunia) Yakni diberikan kepadanya sebagian dari apa yang telah ditetapkan baginya sesuai dengan kehendak Kami. وَمَا لَهُۥ فِى الْاٰخِرَةِ مِن نَّصِيبٍ (dan tidak ada baginya suatu bahagianpun di akhirat) Sebab dia tidak beramal untuk akhirat sehingga dia tidak memiliki bagian di sana."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20. Barangsiapa ingin amal ibadahnya mendapatkan pahala akhirat, maka kebaikannya akan dilipatgandakan sebanyak 70 kali lipat. Barangsiapa yang menginginkan amal ibadahnya hanya untuk urusan dunia dan memenuhi syahwatnya, bukan untuk akhirat, maka Kami akan memberikan hal itu, namun tidak ada apapun yang tersisa baginya di akhirat, karena dia mengabaikan persiapan untuk menghadapinya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Siapa saja yang menghendaki balasan} pahala {akhirat, maka Kami akan menambahkan} melipatgandakan {baginya balasan itu. Siapa saja yang menghendaki balasan dunia, maka Kami berikan kepadanya sebagian darinya} Kami memberinya sebagian dari dunia {tetapi dia tidak akan mendapat bagian sedikit pun di akhirat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "20. Kemudian Allah berfirman, “Barang siapa yang menghendaki keuntungan di akhirat” maksudnya, pahal dan ganjaranya, ia beriman dan membenarkanya dan berupayakeras untuknya, “akan kami tambah keuntungan baginya,” dengan kami lipat gandakan amal dan balasanyamenjadi berlipat-lipat, sebagai Dia firmankan, “Dan barang siapa menhendaki kehidupan akhirat dan berusaha kearah itu dengan bersungguh-sungguh sedang dia adalahMukmin, maka mereka itu adalah orang yang usahanya di balasi dengan baik.” Di sisi lain, bagianya dari dunia pasti dia peroleh. “Dan barabg siapa yang menghendaki keuntungan di dunia,” di mana dunia adalah yang di inginkanya dan puncak harapanya sehingga ia tidak berbuat untuk akhiratnya dan tidak pula harapkan pahalanya serta tidak takut pada siksanya, “Kami berikan kepadanya sebagian keuntungan dunia,” bagianya yang telah ditentukan untuknya, “dan tidak ada baginyasuatu bagianpun di akhirat.” Sesungguhnya dia telah di haramkan mendapatkan surga dan kenikmatanya dan ia berhak mendapat neraka dan apinya yang bernyala-nyala. Ayat ini mirip dengan firmaNya, ”Barang siapa menghendaki kehidupan dunia dan perhianya, niscaya Kami berikan kepada mereka balasan pekerjaan mereka di dunia dengan sempurna dan mereka di dunia itu tidak akan di rugikan. Itulah orang-orang yang tidak memperoleh di akhirat, kecuali neraka dan lenyaplah di akhirat itu apa yang telah mereka usahakan di dunia dan sia-sialah apa yang telah mereka kerjakan.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syura ayat 20: (Barang siapa yang menghendaki) dengan amalnya (keuntungan akhirat) pahala akhirat (Kami tambahkan keuntungan itu baginya) dilipatgandakan pahalanya yaitu satu kebaikan dibalas dengan sepuluh kebaikan dan bahkan lebih dari itu (dan barang siapa yang menghendaki keuntungan di dunia, Kami berikan kepadanya sebagian dari keuntungan dunia) tanpa dilipatgandakan (dan tidak ada baginya suatu bagian pun di akhirat.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni pahala dan balasan-Nya, dia mengimaninya dan membenarkannya serta berusaha kepadanya. Yakni satu kebaikan dilipatgandakan menjadi sepuluh kebaikan atau lebih, ia juga memperoleh bagian dari dunia ini. Oleh karena itu, orang yang mencari akhirat seperti orang yang menanam padi, dimana akan tumbuh pula rumput. Sedangkan orang yang mencari dunia seperti orang yang menanam rumput, tidak akan tumbuh padi. Maksudnya dunia yang menjadi tujuannya dan akhir cita-citanya, tidak mau mengejar akhiratnya, tidak mengharap pahalanya dan tidak takut siksa pada hari itu. Yakni Kami berikan kepadanya bagian yang telah ditetapkan untuknya. Ia tidak masuk surga dan tidak memperoleh kenikmatannya, bahkan berhak masuk neraka dan memperoleh kesengsaraannya. Ayat ini sama seperti firman-Nya di ayat lain, “Barang siapa yang menghendaki kehidupan dunia dan perhiasannya, niscaya Kami berikan kepada mereka balasan pekerjaan mereka di dunia dengan sempurna dan mereka di dunia itu tidak akan dirugikan.-- Itulah orang-orang yang tidak memperoleh di akhirat, kecuali neraka dan lenyaplah di akhirat itu apa yang telah mereka usahakan di dunia dan sia-sialah apa yang telah mereka kerjakan.” (Terj. Huud: 15-16)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syura Ayat 20",
    "description": "Pada ayat yang lalu, Allah menggambarkan orang-orang yang membantah terjadinya kiamat, sedangkan dalam ayat ini Allah menggambarkan keuntungan di akhirat bagi orang-orang yang beriman. Barang siapa menghendaki keuntungan di akhirat melalui amal-amal yang dilakukannya di dunia ini dengan niat yang ikhlas, akan kami tambahkan keuntungan itu baginya dengan melipatgandakan keuntungannya, dan barang siapa menghendaki keuntungan di dunia melalui usaha dan kegiatan yang hanya semata-semata ingin mendapatkan keuntungan dunia, kami berikan kepadanya sebagian dari hasil usahanya itu berupa keuntungan dunia sesuai dengan kehendak kami, tetapi dia tidak akan mendapat bagian di akhirat kelak. 21. Apakah mereka yang melakukan usaha untuk kepentingan dunia semata dan melupakan akhiratnya mempunyai sesembahan selain Allah yang menetapkan aturan agama bagi mereka, sehingga mereka mengikuti apa yang mereka anggap telah ditetapkan sesembahan itu yang sesungguhnya tidak di izinkan atau di ridai Allah' dan sekiranya tidak ada ketetapan yang pasti dari Allah yang menunda datangnya hukuman itu akibat perbuatan syirik, maksiat, dan keingkaran mereka terhadap hari kiamat itu, tentulah hukuman di antara mereka telah dilaksanakan. Dan sungguh, orang-orang zalim, yaitu orang-orang kafir itu akan mendapat azab yang sangat pedih di akhirat kelak."
  }
]