[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah orang-orang musyrik itu memiliki sekutu-sekutu dalam kesyirikan dan kesesatan mereka, yang membuat-buat bid’ah dalam agama dan kesyirikan yang tidak diijinkan oleh Allah? Kalau bukan karena keputusan takdir Allah untuk menangguhkan mereka dan bahwa Dia tidak menyegerakan bagi mereka azab di dunia, niscaya ditetapkan dikalangan mereka dengan disegerakannya azab. Sesungguhnya orang-orang yang kafir kepada Allah di hari kiamat mendapatkan siksa yang menyakitkan dan pedih."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Apakah orang-orang musyrik itu mempunyai tuhan-tuhan selain Allah, yang telah mensyariatkan bagi mereka agama yang tidak diizinkan Allah untuk disyariatkan, mulai dari menyekutukan Allah, mengharamkan apa yang dihalalkan, menghalalkan apa yang diharamkan? Kalaulah bukan karena apa yang diputuskan oleh Allah dari umur yang terbatas untuk memisahkan antara kelompok yang berselisih dan Allah menangguhkan mereka hingga ajalnya, niscaya mereka kan terpisah. Dan sesungguhnya orang-orang yang menganiaya diri mereka sendiri dengan menyekutukan Allah dan melakukan kemaksiatan, bagi mereka azab menyakitkan yang menunggu mereka pada hari Kiamat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "21. Allah mengolok orang-orang musyrik: Apakah orang-orang yang menyekutukan Allah itu memiliki sekutu-sekutu berupa tuhan-tuhan dan setan-setan yang membuatkan syariat kesyirikan dan kemaksiatan bagi mereka yang tidak Allah perintahkan untuk itu? Kalaulah bukan karena ketetapan Allah sebelumnya untuk membiarkan mereka terlebih dahulu, niscaya Dia akan menetapkan bagi mereka kebinasaan yang segera datang. Sungguh orang-orang yang menzalimi diri sendiri dengan kekafiran akan mendapat azab yang pedih pada hari kiamat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "21. أَمْ لَهُمْ شُرَكٰٓؤُا۟ شَرَعُوا۟ لَهُم مِّنَ الدِّينِ مَا لَمْ يَأْذَنۢ بِهِ اللهُ ۚ (Apakah mereka mempunyai sembahan-sembahan selain Allah yang mensyariatkan untuk mereka agama yang tidak diizinkan Allah?) Berupa kesyirikan dan kemaksiatan. Sehingga mereka menjerumuskan para pengikut mereka dalam kebingungan tentang urusan agama. وَلَوْلَا كَلِمَةُ الْفَصْلِ(Sekiranya tak ada ketetapan yang menentukan (dari Allah)) Yakni diakhirkannya sampai datangnya hari kiamat pemberian keputusan tentang perselisihan yang terjadi diantara orang-orang yang saling berselisih. لَقُضِىَ بَيْنَهُمْ ۗ( tentulah mereka telah dibinasakan) Yakni tentu telah diputuskan perselisihan antara orang-orang beriman dengan orang-orang musyrik, atau antara orang-orang musyrik dengan sesembahan mereka; sehingga siksaan bagi para pemimpin dalam kesyirikan akan disegerakan di dunia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "21. Bahkan bagi orang-orang musyrik itu, sembahan-sembahan selain Allah, yang membawa mereka dalam kekufuran. Mereka adalah setan. Mereka tidak mengikuti apa yang disyariatkan oleh Allah, berupa agama, namun mereka malah mengikuti sesuatu yang membuat mereka semakin jauh, yaitu berupa kesyirikan, mengingkari hari kebangkitan dan kemaksiatan. Itu adalah hal-hal yang tidak diizinkan oleh Allah. Sekiranya tidak ada ketentuan yang berupa janji Allah SWT untuk menangguhkan azab mereka, sungguh mereka akan dibinasakan dan azab mereka akan dipercepat. Sesungguhnya bagi orang-orang zalim (orang-orang kafir) itu azab yang menyakitkan. {Am} bermakna {bal} yang berfungsi untuk berpindah dari satu kalimat ke kalimat lainnya, dan bermakna hamzah istifham ingkary yang berfungsi untuk menegasikan (kalimat ssetelahnya). Maknanya perintah itu tidak seperti yang mereka kerjakan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ataukah mereka mempunyai sekutu-sekutu yang menetapkan bagi mereka} yang menciptakan bagi mereka {aturan agama yang tidak diizinkan oleh Allah. Seandainya tidak ada ketetapan} ketetapan terdahulu dari Allah SWT dengan menangguhkan balasan sampai hari kiamat {maka sungguh hukuman di antara mereka telah dilaksanakan. Sesungguhnya orang-orang zalim itu akan mendapat azab yang sangat pedih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21. Allah menyampaikan bahwa kaum musyrikin telah mengambil sekutu-sekutu (sembahan-sembahan) yang mereka cintai dan mereka percayai, mereka dan para sekutu itu sama dalam kekafiran dan perbuatan-perbuatan kufur. (Mereka) adalah setan-setan dari bangsa manusia yang mengajak kepada kekafiran “yang mensyariatkan untuk mereka agama yang tidak diizinkan Allah,” berupa syirik, bid’ah-bid’ah, mengharamkan apa-apa yang dihalalkan oleh Allah dan menghalalkan apa-apa yang telah diharamkan oleh Allah serta hal-hal yang serupa dengannya yang yang menjadi tuntutan hawa nafsu mereka. Padahal Agama itu hanya apa-apa yang telah disyariatkan oleh Allah agar dipatuhi oleh manusia dan mereka mendekatkan diri kepadaNya dengannya. Hukum asalnya adalah dilarang bagi setiap orang membuat suatu aturan apa pun (syariat) yang tidak bersumber dari Allah dan dari RasulNya. Lalu bagaimana dengan orang-orang fasik yang bersekutu dengan bapak-bapak mereka, sedangkan mereka menganut kekafiran!? “Sekiranya tak ada ketetapan yang menentukan, tentulah mereka telah dibinasakan.” Artinya, kalau saja bukan karena ketetapan ajal yang telah ditentukan Allah sebagai pemisah antara berbagai golongan itu, dan bahwasanya Dia akan menangguhkan mereka kepadanya, tentu telah diputuskan di antara mereka pada saat itu juga dengan memberikan kebahagiaan kepada orang yang berpegang kepada kebenaran dan membinasakan orang yang berada pada kesesatan, karena penyebab untuk dibinasakan sudah ada. Namun, di hadapan mereka dan di hadapan setiap orang zhalim sudah ada azab pedih yang telah menanti di akhirat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syura ayat 21: (Apakah) sebenarnya (mereka mempunyai) yang dimaksud adalah orang-orang kafir Mekah (sesembahan-sesembahan) yaitu setan-setan mereka (yang mensyariatkan) maksudnya, sesembahan-sesembahan mereka itu mensyariatkan (untuk mereka) untuk orang-orang kafir (agama) yang rusak (yang tidak diizinkan oleh Allah?) seperti ajaran menyekutukan Allah dan mengingkari adanya hari berbangkit. (Sekiranya tidak ada ketetapan yang menentukan dari Allah) ketentuan yang telah terdahulu yang menetapkan bahwa pembalasan itu pada hari kiamat (tentulah telah diputuskan di antara mereka) dan orangorang yang beriman, yaitu orang-orang kafir akan langsung diazab di dunia. (Dan sesungguhnya orang-orang yang zalim itu) yakni orang-orang kafir (akan memperoleh azab yang amat pedih) yang amat menyakitkan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan bahwa kaum musyrik mengambil para sekutu, dimana mereka berwala’ (menaruh sikap setia) kepadanya, dan mereka bersama-sama dengan para sekutu itu dalam kekafiran dan amalan kufur, dari kalangan setan manusia para penyeru kekafiran. Ada pula yang menafsirkan, apakah mereka mempunyai sembahan-sembahan yang menetapkan untuk mereka agama yang tidak diizinkan Allah? Seperti syirk, mengingkari kebangkitan, bid’ah, mengharamkan apa yang Allah halalkan dan menghalalkan apa yang Allah haramkan dan sebagainya sesuai hawa nafsu mereka. Padahal aturan dalam agama itu tidak boleh kecuali apa yang disyariatkan Allah Ta’ala. Dengan demikian, hukum asal dalam ibadah itu haram sampai ada dalil yang memerintahkannya dari Allah dan Rasul-Nya. Pada saat itu juga karena yang menghendaki untuk dibinasakan sudah ada, akan tetapi Dia menundanya karena santun-Nya dan karena kebijaksanaan-Nya. Yakni orang-orang kafir. Di akhirat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syura Ayat 21",
    "description": "Apakah mereka yang melakukan usaha untuk kepentingan dunia semata dan melupakan akhiratnya mempunyai sesembahan selain Allah yang menetapkan aturan agama bagi mereka, sehingga mereka mengikuti apa yang mereka anggap telah ditetapkan sesembahan itu yang sesungguhnya tidak di izinkan atau di ridai Allah' dan sekiranya tidak ada ketetapan yang pasti dari Allah yang menunda datangnya hukuman itu akibat perbuatan syirik, maksiat, dan keingkaran mereka terhadap hari kiamat itu, tentulah hukuman di antara mereka telah dilaksanakan. Dan sungguh, orang-orang zalim, yaitu orang-orang kafir itu akan mendapat azab yang sangat pedih di akhirat kelak. 22. Kamu, wahai nabi Muhammad dan siapa pun juga, akan melihat orang-orang zalim itu di hari kiamat kelak sangat ketakutan atas segala sesuatu, karena perbuatan dosa dan kejahatan, yang telah mereka lakukan di dunia, dan azab Allah pasti menimpa mereka. Ini adalah kerugian yang amat besar yang di peroleh oleh orang-orang kafir. Dan engkau juga dapat melihat orang-orang yang beriman kepada Allah dan keniscayaan kiamat itu dan mewujudkan keimanan mereka dengan mengerjakan kebajikan akan berada di dalam taman-taman surga dengan segala kenikmatannya. Mereka memperoleh apa yang mereka kehendaki di sisi tuhan sebagai balasan atas ketaatan mereka. Yang demikian itu adalah karunia yang besar yang di anugerahkan Allah kepada mereka."
  }
]