[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apa yang Aku beritahukan kepada kalian (wahai manusia) berupa Kenikmatan dan kemuliaan di akhirat, adalah berita gembira yang Allah sampaikan kepada hamba-hambaNya yang beriman kepadaNya dan menaatiNya di dunia. Dan katakanlah (wahai rasul) kepada orang-orang yang meragukan hari kiamat dari kalangan orang-orang musyrik kaummu, ”aku tidak meminta upah dari harta kalian atas kebenaran yang aku bawa kepada kalian dan aku dakwahkan kepada kalian, kecuali kecintaan kalian kepadaku sebagai kerabat kalian dan hendaknya kalian tetap menyambung tali silaturahmi antara diriku dengan kalian”. Dan barang siapa melakukan kebaikan, maka Kami melipat gandakannya menjadi sepuluh kali lipatnya bahkan lebih. Sesungguhnya Allah maha pengampun bagi dosa-dosa para hambaNYa juga maha memberikan balasan baik atas kebaikan dan ketaatan mereka kepadaNYa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "23. Itulah kabar gembira besar yang diberikan Allah melalui rasul-Nya bagi orang-orang yang beriman kepada Allah dan rasul-rasul-Nya dan melaksanakan amal saleh. Katakanlah -wahai Rasul- “Aku tidak meminta upah dari kalian atas seruanku kepada kebenaran, kecuali satu balasan yang manfaatnya kembali kepada kalian, yaitu kalian mencintaiku karena kekeluargaanku pada kalian.” Barangsiapa melakukan kebaikan niscaya Kami lipatkan pahalanya, kebaikan dengan sepuluh kali lipatnya. Sesungguhnya Allah Maha Pengampun terhadap dosa-dosa orang yang bertobat kepada-Nya di antara hamba-hamba-Nya, dan Maha Mensyukuri amal perbuatan yang mereka kerjakan karena mendambakan wajah Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "23. Demikianlah kedudukan mulia yang Allah kabarkan kepada hamba-hamba-Nya yang beriman yang menjalankan apa yang Allah perintahkan kepada mereka. Hai Rasulullah, katakanlah kepada orang-orang musyrik: “Aku tidak meminta upah dari kalian atas penyampaian risalah melainkan sekedar agar kalian menyambung hubungan kekerabatan antara diriku dengan kalian.” Dan barangsiapa yang melakukan kebaikan niscaya Kami akan melipatgandakannya; Allah Maha Mengampuni dosa hamba-hamba-Nya yang bertaubat, dan Maha Mensyukuri hamba-hamba-Nya yang beriman. Dari Ibnu ‘Abbas, bahwa dia pernah ditanya tentang firman Allah, “(إلا المودة في القربى) Kecuali kasih sayang dalam kekeluargaan”; kemudian Sa’id bin Jabir berkata: (القربى) yakni Ahlul bait Nabi Muhammad. Maka Ibnu Abbas berkata: “Kamu terlalu terburu-buru berpendapat, sesungguhnya Nabi Muhammad memiliki hubungan kekerabatan dengan seluruh suku dalam kabilah Quraisy; sehingga maknanya adalah, kecuali hanya agar kalian menyambung hubungan kekerabatan antara diriku dengan kalian. (Shahih al-Bukhari 8/426 no. 4818, kitab tafsir surat asy-Syura bab ayat ini)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "23. ذٰلِكَ الَّذِى يُبَشِّرُ اللهُ عِبَادَهُ الَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ الصّٰلِحٰتِ ۗ (Itulah (karunia) yang (dengan itu) Allah menggembirakan hamba-hamba-Nya yang beriman dan mengerjakan amal yang saleh) Mereka adalah orang-orang yang mengumpulkan dalam dirinya keimanan dan ketaatan untuk menjalankan perintah Allah dan menjauhi larangan-Nya. Merekalah orang-orang yang mendapat kabar gembira ini. قُل لَّآ أَسْـَٔلُكُمْ عَلَيْهِ أَجْرًا إِلَّا الْمَوَدَّةَ فِى الْقُرْبَىٰ ۗ( Katakanlah: “Aku tidak meminta kepadamu sesuatu upahpun atas seruanku kecuali kasih sayang dalam kekeluargaan”) Yakni akan tetapi aku meminta dari kalian kasih sayang dalam kekerabatan antara aku dengan kalian, maka jagalah aku dan janganlah kalian tergesa-gesa untuk melawanku, serta biarkanlah urusanku dengan orang-orang. Ibnu ‘Abbas berkata: Rasulullah memiliki hubungan kerabat dengan seluruh orang Quraisy; ketika mereka mendustakannya dan menggan untuk menjadi pengikutnya, beliau bersabda: “Hai kaumku, jika memang kalian dengan untuk menjadi pengikutku maka paling tidak jagalah hubungan kekerabatanku dengan kalian; dan jangan sampai orang Arab lainnya lebih kuat dalam menjagaku dan membelaku daripada kalian.” Rasulullah tidak pernah sama sekali meminta upah atas dakwah yang beliau sampaikan. وَمَن يَقْتَرِفْ حَسَنَةً نَّزِدْ لَهُۥ فِيهَا حُسْنًا ۚ( Dan siapa yang mengerjakan kebaikan akan Kami tambahkan baginya kebaikan pada kebaikannya itu) Yakni barangsiapa yang mengerjakan kebaikan niscaya Kami tambah baginya kebaikan yang dilipat gandakan pahalanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "23. Pahala yang agung itu diberitakan oleh Allah kepada hamba-hamba mukminNya yang mengerjakan amal ibadah yang diperintahkan olehNya dan meninggalkan apa yang dilarangNya. Katakanlah wahai Nabi: “Aku tidak mencari imbalan atau upah dari kalian atas risalah yang aku sampaikan.” (kecuali agar terjalin hubungan kekerabatan antara aku dan kalian), sebagaimana dijelaskan Imam Bukhari dari Ibnu Abbas. Sesungguhnya beliau (Muhammad) memiliki hubungan kerabat dengan setiap orang suku Quraisy. Barangsiapa melaksanakan amal yang baik dan mengusahakan ketaatan, niscaya akan kami lipatgandakan pahalanya dan kami tambah pahala kebaikannya. Sesungguhnya Allah adalah Dzat yang memiliki banyak ampunan bagi dosa-dosa hambaNya yang bertaubat, dan Maha Bersyukur atas hambaNya yang sedikit ketaatan dan kebaikannya. Qatadah berkata: “Orang-orang Musyrik berkata: “Barangkali Muhammad mencari imbalan atas apa yang dia kerjakan” kemudian diturunkanlah ayat ini untuk menerangkan kepada mereka tentang cinta kasihnya dan upayanya dalam menjaga kekerabatan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Itulah kabar gembira yang disampaikan Allah kepada hamba-hambaNya yang beriman dan beramal shalih. Katakanlah,“Aku tidak meminta kepada kalian suatu imbalan} imbalan {pun atas seruan itu} atas penyampaian risalah itu {kecuali kasih sayang dalam kekeluargaan”} kecuali kalian menyayangiku karena hubungan kekeluargaanku tehadap kalian {Siapa saja yang mengerjakan} mengusahakan {kebaikan, maka Kami akan menambahkan baginya kebaikan} pahala dan imbalan {Sesungguhnya Allah Maha Pengampun lagi Maha Mensyukuri"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "23. “itulah yang disampaikan Allah kepada hamba-hambaNya yang beriman dan mengerjakan amal shalih,” ini adalah berita gembira yang sangat agung yang merupakan berita gembira paling besar secara total yang disampaikan oleh yang maha pengasih lagi maha penyayang melalui manusia yang paling utama untuk orang-orang yang beriman dan beramal shalih. Maka ia adalah tujuan yang paling tinggi, dan sarana yang bisa mengantarkan kepadanya merupakan sarana yang paling utama. ”katakanlah (hai Muhammad), ’aku tidak meminta kepadamu atasnya’,” maksudnya, atas penyampaian al-qur’an yang aku lakukan kepada kalian dan atas seruanku kepada hukum-hukumnya, ”suatu upahpun,” jadi aku tidak ingin mengambil harta kalian, tidak pula ingin menjadi penguasa terhadap kalian atau tujuan-tujuan lainnya. “kecuali kasih sayang dalam keluargamu,” Bisa jadi makna lainnya adalah: aku tidak meminta kepada kalian atas seruan ini suatu upah pun selain satu saja, ia adalah milik kalian dan manfaatnya kembali kepada kalian, yaitu kalian menyayangi dan mencintaiku dalam kekerabatan, yakni, karena hubungan kerabat. Maka ini berarti kasih sayang lebih dari kasih sayang karena iman. Sebab kasih sayang karena iman kepada rasul dan mengutamakan kecintaan kepadanya atas seluruh yang dicintai sesudah kecintaan kepada Allah itu fardhu atas setiap Muslim. Mereka diminta lebih dari itu, yaitui mencintainya karena hubungan kerabat. Sebab, Rasulullah telah melakukan dakwahnya kepada manusia yang paling dekat kepadanya, hingga dikatakan bahwa tidak ada seorangpun dari suku quraisy melainkan Rasulullah memilki hubungan kekerabatan dengannya. Bisa juga maksudnya adalah, kecuali mencintai Allah dengan kecintaan yang tulus, yaitu kecintaan yang disertai dengan taqarub kepada Allah dan bertawassul dengan ketaatan kepadaNYa yang membuktikan kebenaran dan ketulusan cintanya. Maka dari itu Allah berfirman, ”kecuali kasih sayang dalam al-qurba” yakni,taqarub kepada Allah. Berdasarkan dua makna ini. Maka pengecualian tesebut membuktikan bahwa Rasulullah sama sekali tidak meminta upah apapun atas seuannya, kecuali sesuatu yang manfaatnya kembali pada meeka sendiri. Maka ini sama sekali bukan upah,bahkan itu adalah upah dai beliau untuk meeka, sebagaimana, fiman Allah, ”dan meeka tidak menyiksa oang-orang mukmin itu melainkan karena orang yang mukmin itu berriman kepada Allah yang mahaperkasa lagi maha tepuji,” (al-buruj:8) Dan sepeti ucapan mereka: sifulan itu tidak punya dosa padamu selain dia dalah seorang yang berbuat baik kepadamu. “dan siapa yang mengajarkan kebaikan,” berupa shalat, puasa, haji atau perbuatan baik kepada manusia, “akan kami tambahkan baginya kebaikan pada kebaikannya itu,” yaitu berupa: Allah melapangkan dadanya, memudahkan urusannya dan ia menjadi sebab untuk memperoleh taufik untuk mengejakan amal baik yang lain, yang dengannya amal seorang. Mukmin bertambah dan derajatnya naik di sisi Allah dan dikalangan makhlukNya, dan ia juga memperoleh pahala di dunia dan akhirat. ”sesungguhnya Allah maha pengampun lagi maha mensyukuri,” Dia mengampuni dosa-dosa itu saat dilakukan taubat darinya, dan Dia mensyukuri amal yang sedikit (kecil) dengan pahala yang berlimpah ruah. Maka dengan ampunanNya, Dia mengampuni dosa-dosa dan menghapus berrbagai aib, dan dengan syukurNya, dia menerima kebajikan-kebajikan dan melipat gandakannya dengan berlipat-lipat kali."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syura ayat 23: (Itulah karunia yang dengan itu Allah menggembirakan) berasal dari lafal Al-Bisyarah (hamba-hamba-Nya yang beriman dan mengerjakan amal yang saleh. Katakanlah, \"Aku tidak meminta kepada kalian atas seruanku ini) atas penyampaian risalah ini (sesuatu upah pun kecuali kasih sayang dalam kekeluargaan) Istitsna di sini bersifat Munqathi' maksudnya, tetapi aku meminta kepada kalian hendaknya kalian mencintai kekerabatan denganku yang memang pada kenyataannya telah ada hubungan kerabat antara kalian dan aku. Karena sesungguhnya bagi Nabi saw. mempunyai hubungan kekerabatan dengan setiap puak yang berakar dari kabilah Quraisy. (Dan siapa yang mengerjakan kebaikan) yakni ketaatan (akan Kami tambahkan baginya kebaikan pada kebaikannya itu) yaitu dengan melipatgandakan pahala kebaikannya. (Sesungguhnya Allah Maha Pengampun) terhadap dosa-dosa (lagi Maha Mensyukuri) bagi orang yang sedikit beramal kebaikan, karenanya Dia melipatgandakan pahalanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni kabar gembira yang besar ini merupakan kabar gembira yang paling besar secara mutlak yang diberitakan oleh Tuhan Yang Maha Pengasih lagi Maha Penyayang melalui tangan manusia paling utama (Nabi Muhammad shallallahu 'alaihi wa sallam) untuk orang-orang yang beriman dan beramal saleh, di mana yang diberitakan itu merupakan cita-cita yang paling besar, sedangkan wasilah (sarana) yang menyampaikan ke sana adalah wasilah yang paling utama. Imam Ahmad meriwayatkan dengan sanadnya yang sampai kepada Abdul Malik bin Maisarah ia berkata: Aku mendengar Thawus berkata, “Ibnu Abbas ditanya tentang ayat ini, “Katakanlah (Muhammad), \"Aku tidak meminta kepadamu sesuatu imbalan pun atas seruanku kecuali kasih sayang dalam kekeluargaan.” Ia (Thawus) berkata, “Sa’id bin Jubair berkata, “(Yaitu) hubungan kekeluargaan dengan Muhammad.” Kemudian Ibnu Abbas berkata, “Engkau terburu-buru, sesungguhnya tidak ada satu pun marga dari marga-marga Quraisy kecuali Rasulullah shallallahu 'alaihi wa sallam mempunyai hubungan kekerabatan dengan mereka, lalu ia berkata, “Kecuali kamu menyambung hubungan kekerabatan antara aku dengan kamu.” Yakni atas penyampaian Al Qur’an ini kepadamu dan ajakan kepada hukum-hukumnya. Aku tidak menginginkan hartamu dan berkuasa atas kamu serta kesenangan lainnya. Bisa maksudnya, aku tidak meminta kepadamu selain satu imbalan yang diperuntukkan buat kamu dan manfaatnya kembalinya kepadamu, yaitu agar kamu mencintaiku karena hubungan kekerabatan, yakni kasih sayang tambahan setelah kasih sayang karena iman, karena kasih sayang dan cinta karena beriman kepada rasul serta mendahulukannya di atas semua kecintaan -setelah cinta kepada Allah- adalah wajib bagi setiap muslim. Mereka itu diminta lebih dari itu, yaitu agar mereka mencintai Beliau karena hubungan kekerabatan, karena Beliau shallallahu 'alaihi wa sallam telah langsung mendakwahkan kepada orang yang paling dekat kerabatnya dengan Beliau, bahkan sampai disebutkan bahwa tidak ada satu pun dari kabilah Quraisy kecuali Rasulullah shallallahu 'alaihi wa sallam memiliki hubungan kekerabatan kepadanya. Bisa juga maksudnya, bahwa yang Beliau minta adalah kecintaan kepada Allah yang benar yang diiringi dengan taqarrub (pendekatan diri) kepada Allah Subhaanahu wa Ta'aala dan mencari sarana untuk taat kepada-Nya yang menunjukkan benarnya kecintaannya. Kedua kemungkinan ini menunjukkan bahwa Beliau shallallahu 'alaihi wa sallam sama sekali tidak meminta upah selain sesuatu yang kembalinya buat mereka dan hal ini sesungguhnya bukanlah upah, bahkan merupakan imbalan Beliau kepada mereka. Pengecualian dalam ayat di atas disebut istitsna’ munqathi’ (pengecualian yang memutuskan dengan sebelumnya) seperti ucapan seseorang, “Fulan tidak punya dosa kepadamu selain perbuatan ihsannya kepadamu.” Seperti shalat, zakat, puasa, haji atau berbuat ihsan kepada orang lain. Yaitu Allah akan lapangkan dadanya, memudahkan urusannya, menjadi sebab diberi taufiq kepada amalan yang lain, bertambah amalnya, tinggi derajatnya baik di sisi Allah maupun di sisi makhluk-Nya serta memperoleh pahala cepat atau lambat. Terhadap dosa-dosa meskipun besar dan banyak ketika seseorang bertobat darinya. Dengan ampunan-Nya maka diampuni dosa-dosa dan ditutup semua aib. Amal yang dikerjakan hamba dengan menerima kebaikannya meskipun sedikit dan melipatgandakannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syura Ayat 23",
    "description": "Itulah karunia besar yang di beritahukan Allah untuk menggembirakan hamba-hamba-Nya yang beriman dan mengerjakan kebajikan yang telah di perintahkan oleh Allah dan meninggalkan larangan-larangan-Nya. Katakanlah kepada mereka yang kafir itu, wahai nabi Muhammad, 'aku tidak akan pernah meminta kepadamu sesuatu imbalan apa pun walau sedikit atas seruanku kepadamu untuk beriman kecuali jalinan kasih sayang di antara aku dan kalian dalam ke keluargaan. ' dan barang siapa mengerjakan kebaikan dengan penuh keimanan dan ketulusan akan kami tambahkan dengan melipat gandakan kebaikan baginya. Sungguh, Allah maha pengampun kepada siapa pun yang memohon ampun atas dosa-dosa yang mereka lakukan, maha mensyukuri kepada siapa pun dari hamba-hamba-Nya atas perbuatan baik yang telah di lakukannya sehingga Allah menambahkan pahalanya. 24. Ataukah mereka, orang-orang kafir itu masih terus mengatakan, 'dia, Muhammad, telah mengada-adakan kebohongan tentang Allah dengan mengatakan bahwa Al-Qur'an itu adalah firman-Nya, padahal dia bukan firman-Nya. ' lalu sekiranya Allah menghendaki dengan izin dan kekuasaan-Nya niscaya dia kunci hatimu. Dan Allah menghapus yang batil dengan cara menimbulkan sebab-sebab yang dapat menghancurkannya dan membenarkan yang benar yang di tunjukkan-Nya dengan firman-Nya, yaitu wahyu-wahyu yang di turunkannya melalui Al-Qur'an. Sungguh, dia maha mengetahui segala isi hati, baik yang di nyatakan maupun yang di sembunyikan."
  }
]