[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bahkan apakah orang-orang musrik berkata, ”Muhammad telah membuat kebohongan atas nama Allah, dimana dia datang membawa apa yang dia bacakan kepada kami sebagai sesuatu yang dia buat dari dirinya sendiri?”. dan bila Allah berkehendak, niscaya Allah akan menutup hati-hati mu rapat-rapat bila kamu (wahai rasul) melakukan hal itu. Allah mengikis kebatilan sehingga ia pun lenyap dan menetapkan kebenaran denagn kalimat-kalimatNya yang tidak berubah dan tidak berganti, dan dengan janjiNya yang benar yang tidak di selisihiNya. Sesungguhnya Allah maha mengetahui isi hati hamba-hamabNya tiada sesuatupun yang samar bagiNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. Di antara sangkaan orang-orang musyrik, mereka berkata bahwa Muhammad -ṣallallāhu 'alaihi wa sallam- telah membuat Al-Qur`ān ini dan menisbahkannya kepada Rabbnya. Allah berfirman membantah mereka, \"Kalau seandainya engkau membisikkan pada dirimu untuk berbuat dusta maka niscaya Aku akan mengunci hatimu, dan Aku akan menghapus kebatilan yang dibuat-buat itu, dan Aku akan menetapkan kebenaran. Tetapi itu semua tidak terjadi, maka itu menunjukkan Nabi -ṣallallāhu 'alaihi wa sallam- bahwa dia mendapatkan wahyu dari Tuhannya.\" Sesungguhnya Allah Maha Mengetahui apa yang ada di dalam hati hamba-hamba-Nya, tidak ada sesuatu pun yang tersembunyi dari-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "24-25. Allah mengolok orang-orang musyrik: “Apakah mereka berkata, ‘Muhammad telah membuat kebohongan terhadap Allah dengan mengatakan bahwa al-Qur’an berasal dari-Nya’? Jika kamu membuat kebohongan itu niscaya Allah telah menutup hatimu, menghilangkan kebatilan itu, dan menetapkan kebenaran dan menjelaskannya dengan hujjah yang jelas. Dia Maha Mengetahui apa yang ada dalam hati hamba-hamba-Nya, dan Dia Menerima taubat mereka yang bertaubat dan mengampuni dosa bagi mereka yang Dia kehendaki, serta Maha Mengetahui kebaikan dan keburukan yang kalian lakukan, sehingga Dia akan membuat perhitungan terhadapnya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "24. أَمْ يَقُولُونَ افْتَرَىٰ عَلَى اللهِ كَذِبًا ۖ (hkan mereka mengatakan: “Dia (Muhammad) telah mengada-adakan dusta terhadap Allah”) Dengan mengaku menjadi nabi yang Dia utus. فَإِن يَشَإِ اللهُ يَخْتِمْ عَلَىٰ قَلْبِكَ ۗ( Maka jika Allah menghendaki niscaya Dia mengunci mati hatimu) Yakni jika dirimu menyuruhmu agar membuat kedustaan terhadap Allah niscaya Allah akan mengunci hatimu jika DIa menghendaki sehingga kamu tidak mampu untuk membuat kedustaan itu. وَيَمْحُ اللهُ الْبٰطِلَ(dan Allah menghapuskan yang batil) Yakni seandainya apa yang dibawa Rasulullah itu adalah sesuatu yang batil pasti Allah telah menghapus kebatilan itu, sebagaimana yang Allah lakukan pada orang-orang yang berdusta terhadap-Nya. وَيُحِقُّ الْحَقَّ(dan membenarkan yang hak) Yakni membenarkan agama Islam dan mengokohkannya. بِكَلِمٰتِهِۦٓ ۚ( dengan kalimat-kalimat-Nya) Yakni dengan al-Qur’an yang telah Allah turunkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "24. Bahkan orang-orang musyrik itu berkata: “Muhammad telah merekayasa kebohongan terhadap Allah. Dia mengklaim Al-Qur’an dari sisiNya dan mengklaim mendapatkan nubuwwah.” Akan tetapi tuduhan kepalsuan itu sangat jauh dari kepalsuan yang sesungguhnya. Sesungguhnya orang yang berani terhadap Allah adalah orang yang punya kecenderungan kekufuran dalam hatinya dan tidak mengenal Tuhannya. Kalaupun adanya kepalsuan darimu terhadap Allah itu bohong, sungguh Dia bisa mengunci hatimu (atas kepalsuan itu), jika Dia berkehendak dan kamu tidak mampu berbuat apapun. Allah menghilangkan kebathilan, menerangkan Islam dan meneguhkannya dengan apa yang tercantum dalam Al-Qur’an. Sesungguhnya Dia Maha mengetahui isi hati seluruh manusia"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ataukah mereka berkata} tetapi orang-orang kafir Mekkah berkata {“Dia telah mengada-adakan} membuat-buat {kebohongan tentang Allah” Jika Allah menghendaki, niscaya Dia akan mengunci} mengunci {hatimu. Allah menghapus} menghilangkan {yang batil dan membenarkan} menampakkan dan meneguhkan {yang benar dengan firman-firmanNya. Sesungguhnya Dia Maha Mengetahui segala isi hati"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "24. maknanya, apakah orang-orang yang mendustakan Rasulullah dengan lancang dan dusta akan berkata, ”Dia telah mengada-ngadakan dusta terhadap Allah?” di mana mereka menuduhmu dengan perkara yang paling keji dan paling buruk, yaitu perbuatan mengada-ada atas nama Allah dengan mengaku-ngaku sebagai dan menyandarkan kepada Allah sesuatu yang Allah sendiri bebas darinya, padahal mereka mengetahui kejujuran dan keamanahanmu, maka bagaimana mereka lancang berani berbuat dusta yang sangat jelas ini?! Bahkan dengan perbuatan itu mereka telah lancang terhadap Allah. Itu adalah pencemoohan terhadap Allah, dimana Allah telah meneguhkanmu untuk dakwah yang agung ini, yang menurut klaim mereka mengandung kerusakan terbesar di bumi ini. Allah telah meneguhkan beliau berdakwah secara terbuka, kemudian menisbatkan dakwah beliau kepadaNya dan kemudian menguatkan beliau dengan mukjizat-mukjizat yang jelas dan dalil-dalil yang melumpuhkan, kemenangan yang nyata, dan kekuasaan terhadap siapa saja yang menyalahiNya. Dan Allah kuasa untuk memberangus dakwah ini dari dasar dan materinya, yaitu dengan mengunci rapat hati Rasulullah sehingga beliau tidak menyadari apa pun dan sehingga tidak ada suatu kebaikan apa pun yang masuk kepadanya. Apabila ia telah mengunci rapat hati beliau, maka terputuslah semua perkara dan terhentilah ia. Ini adalah satu bukti yang pasti atas kebenaan ajaran yang di bawa oleh Rasul, dan satu kesaksian yang paling kuat dai Allah untuk beliau atas apa yang beliau katakan, dan tidak ada kesaksian yang lebih agung atau lebih besa drainya. Maka dari itu, diantara hikmah, rahmat dan sunnahNya yang berlaku adalah bahwasannya Dia mengahapus kebatilan dan melenyapkannya, sekalipun dalam beberapa waktu tertentu kebatilan itu memiliki kekuatan, namun kesudahannya adalah kebinasaan. ”dan membenarkan yang haq dengan kalimat-kalimatNYa,” yang bersifat kauniyah (alamiah) yang tidak akan diganti atau pun diubah, dan dengan janniNya yang mahabenar, dan dengan kalimat-kalimatNya yang bersifat agama yang merealisasikan kebenaan yang disyariatkanNya yang menguatkannya di dalam hati dan membuat sadar orang-oang yang mempunyai akal. Dan diantara cara Allah mewujudkan kebenaran itu adalah dengan menakdirkan bagi kebenaran itu kebatilan, agar ia melawannya. Apabila kebenaran itu telah melawan kebatilan, maka kebenaran pasti mengalahkannya dengan argument-argumennya dan dengan bukti-buktinya, sehingga dari cahaya dan petunjukNYa itu tampaklah apa yang dengannya kebatilan menjadi redup dan mati serta terbukti kepalsuannya bagi setiap orang, sedangkan yang benar tampak sejelas-jelasnya bagi setiap oang. “sesungguhnya Dia maha mengetahui segala isi hati,” dengan segala apa yang ada di dalamnya dan apa-apa yang menjadi sifatnya, berupa kebaikan ataupun keburukan serta apa saja yang ia sembunyikan dan ia tidak tampakkan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syura ayat 24: (Bahkan) tetapi (mereka mengatakan, \"Dia telah mengada-adakan dusta terhadap Allah\") yaitu dengan menisbatkan Alquran, bahwasanya diturunkan dari sisi Allah. (Maka jika Allah menghendaki niscaya Dia mengunci mati) maksudnya, mengikat (hatimu) dengan kesabaran, sehingga kamu sabar di dalam menghadapi perlakuan mereka yang menyakitkan melalui perkataan dan perbuatan-perbuatan lainnya; memang Allah swt. telah melaksanakan apa yang dikehendaki-Nya itu (dan Allah menghapuskan yang batil) yakni perkara yang telah mereka katakan itu (dan membenarkan yang hak) menetapkannya (dengan kalimat-kalimat-Nya) yang diturunkan kepada Nabi-Nya. (Sesungguhnya Dia Maha Mengetahui segala isi hati) mengetahui apa yang terkandung di dalam kalbu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang mendustakan Rasulullah shallallahu 'alaihi wa sallam. Karena menisbatkan Al Qur’an kepada Allah Subhaanahu wa Ta'aala, padahal mereka mengetahui kejujuran dan amanahnya, lalu mengapa mereka berani menuduh Beliau berdusta. Tuduhan tersebut sebenarnya juga mencacatkan Allah Subhaanahu wa Ta'aala, karena Allah yang memberikan kesempatan kepada Beliau untuk mengemban dakwah yang agung ini, menyuarakannya dan menisbatkannya kepada-Nya, dan Dia memperkuat Beliau dengan mukjizat yang nyata dan dalil-dalil yang kuat, ditambah dengan pertolongan-Nya yang jelas dan keberhasilan mengalahkan musuhnya, padahal Allah Subhaanahu wa Ta'aala berkuasa memutuskan dakwah ini dari dasarnya, yaitu dengan mengunci hati Rasulullah shallallahu 'alaihi wa sallam sehingga Beliau tidak dapat menerima apa-apa dan tidak lagi dimasuki oleh kebaikan. Jika hati sudah dikunci maka perkara apa pun terhenti. Ini merupakan dalil yang qath’i benarnya apa yang dibawa Rasulullah shallallahu 'alaihi wa sallam dan persaksian dari Allah yang paling kuat terhadap aa yang Beliau ucapkan, dan bahwa tidak ada persaksian yang lebih besar daripada ini. Oleh karena itulah, termasuk hikmah, rahmat dan sunnah-Nya yang berjalan di alam semesta ini adalah Dia menghapuskan kebatilan dan menyingkirkannya meskipun terkadang kebatilan dalam suatu waktu memiliki sedikit kekuatan, namun akhirnya akan binasa. Untuk bersabar terhadap gangguan mereka. Baik kalimat-Nya di alam semesta yang tidak dapat dirubah dan diganti, janji-Nya yang benar, kalimat agama-Nya yang mewujudkan apa yang disyariatkan-Nya berupa kebenaran, mengokohkannya di hati serta menerangi ulul albab (orang-orang yang berakal). Sehingga termasuk penguatan-Nya terhadap yang hak adalah Dia adakan kebatilan untuk melawannya, jika kebatilan melawannya, maka kebenaran menyerangnya dengan bukti dan keterangannya, sehingga dari cahaya dan petunjuknya kalahlah yang batil itu dan tampak jelas kebatilannya oleh semua orang dan kebenaran semakin jelas bagi setiap orang. Yakni yang ada di dalamnya dan sifat yang melekat padanya baik atau buruk, yang disembunyikan maupun yang ditampakkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syura Ayat 24",
    "description": "Ataukah mereka, orang-orang kafir itu masih terus mengatakan, 'dia, Muhammad, telah mengada-adakan kebohongan tentang Allah dengan mengatakan bahwa Al-Qur'an itu adalah firman-Nya, padahal dia bukan firman-Nya. ' lalu sekiranya Allah menghendaki dengan izin dan kekuasaan-Nya niscaya dia kunci hatimu. Dan Allah menghapus yang batil dengan cara menimbulkan sebab-sebab yang dapat menghancurkannya dan membenarkan yang benar yang di tunjukkan-Nya dengan firman-Nya, yaitu wahyu-wahyu yang di turunkannya melalui Al-Qur'an. Sungguh, dia maha mengetahui segala isi hati, baik yang di nyatakan maupun yang di sembunyikan. 25. Orang-orang kafir itu harus meminta ampun kepada Allah yang maha pemurah atas keyakinan mereka yang sesat dan perbuatan dosa yang telah mereka lakukan. Dan di antara kemurahan Allah adalah bahwa dialah yang menerima tobat dari hamba-hamba-Nya yang mengakui dan meminta ampun atas kesalahannya itu dan memaafkan keburukan-keburukan yang telah di lakukan dan mengetahui apa yang kamu kerjakan, baik yang besar maupun yang kecil."
  }
]