[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah adalah yang menerima taubat dari hamba-hamabNya bila mereka kembali untuk mentauhidkan-Nya dan menaati-Nya, dan Dia memaafkan keburukan-keburukan, dan Dia mengetahui kebaikan dan keburukan yang kalian lakukan, tidak ada sesuatupun dari hal itu yang samar bagi Allah, dan Dia akan membalas kalian atasnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "25. Dan Dia -Subḥānahu- Yang menerima tobat hamba-hamba-Nya dari kekafiran dan maksiat jika mereka bertobat kepada-Nya, dan Dia mengampuni kesalahan-kesalahan yang pernah mereka perbuat. Dia mengetahui apa saja yang kalian kerjakan, tidak ada satu pun dari perbuatan kalian yang tersembunyi dari-Nya, dan Dia akan membalas kalian atas perbuatan itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "25. Allah adalah Dzat yang menerima taubat hamba-hambaNya yang mau bertaubat dan memaafkan keburukan-keburukan yang mereka lakukan. Dia mengetahui apa yang kalian perbuat, baik atau buruk. {‘An ‘Ibadihi} bermakna (min) karena penerimaan taubat itu dihubungkan dengan huruf min"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dialah yang menerima taubat dari hamba-hambaNya, memaafkan kesalahan-kesalahan, dan mengetahui apa yang kalian kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "25. ini adalah penjelasan tentang kesempurnaan kemurahan Allah keluasan kedermawananNYa serta kesempurnaan kelembutanNYa dengan menerima taubat “dari hamba-hamabNya” saat mereka menanggalkan diri dari dosa-dosa dan menyesalinya, serta berbulat hati untuk tidak mengulanginya kembali jika itu semua ia lakukan semata-mata mengharapkan ridha Allah, Rabb mereka. Maka Allah menerimanya serta sebelumnya ia telah menjadi sebab bagi kebinasaan dan turunnya siksaan-siksaan duniawi dan ukhrawi. Dia memaafkan “kesalahan-kesalahan,” dan menghapuskannya dan menghapus bekas-bekasnya, yaitu yang berupa cela dan siksa-siksa yang di akibatkannya sehingga orang yang bertaubat itu kembali menjadi seorang yang mulia di sisiNYa hingga seakan-akan tidak pernah melakukan suatu kejahatan apa pun. Allah mencintainya dan membimbingnya kepada apa saja yang membuatnya makin dekat kepadaNYa. Oleh karena taubat itu termasuk amal yang sangat agung yang terkadang sempuna disebabkan kesempunaan keikhlasan dan ketulusannya dan tekadang bisa jadi kuang sempuna karena berkuangnya kadar keikhlasan ketulusannya, dan bahkan terkadang rusak apabila tujuannya adalah untuk menacapai tujuan-tujuan duniawi, sedangkan tempat keikhlasan dan ketulusan itu adalah hati yang hanya diketahui oleh Allah saja, maka Allah menutup ayat ini dengan FirmanNya,”dan Dia mengetahui apa yang kamu kerjakan,”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syura ayat 25: (Dan Dialah yang menerima tobat dari hamba-hamba-Nya) dari sebagian di antara mereka (dan memaafkan kesalahankesalahan) yang para pelakunya telah bertobat daripadanya (dan mengetahui apa yang kalian kerjakan) dapat dibaca Taf'aluuna atau Yaf'aluuna; kalau dibaca Yaf'aluuna artinya, mengetahui apa yang mereka kerjakan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini menerangkan sempurnanya kemurahan Allah Subhaanahu wa Ta'aala, luasnya pemberian-Nya dan sempurnanya kelembutan-Nya; Dia menerima tobat yang muncul dari hamba-hamba-Nya saat mereka mencabut dosa mereka dan menyesalinya serta berazam untuk tidak mengulanginya jika maksud mereka adalah mencari keridhaan Allah Subhaanahu wa Ta'aala, karena Allah Subhaanahu wa Ta'aala tetap menerimanya meskipun telah sempurna sebab seseorang binasa. Yakni menghapusnya dan menghapus pengaruhnya, seperti aib dan hukuman yang menghendakinya, dan orang yang bertobat di sisi-Nya menjadi mulia seakan-akan dia tidak pernah mengerjakan kejahatan pun, Dia juga mencintainya dan memberinya taufik kepada sesuatu yang mendekatkan kepada-Nya. OIeh karena tobat terkadang sempurna karena sempurnanya keikhlasan dan kejujurannya, namun bisa saja berkurang ketika kurang ikhlas dan jujur, bahkan bisa saja sia-sia jika maksudnya untuk memperoleh tujuan duniawi, dan karena hal itu terletak di hati dimana tidak ada yang mengetahuinya kecuali Allah, maka Dia tutup ayat ini dengan firman-Nya, “dan mengetahui apa yang kamu kerjakan,"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syura Ayat 25",
    "description": "25. Orang-orang kafir itu harus meminta ampun kepada Allah yang maha pemurah atas keyakinan mereka yang sesat dan perbuatan dosa yang telah mereka lakukan. Dan di antara kemurahan Allah adalah bahwa dialah yang menerima tobat dari hamba-hamba-Nya yang mengakui dan meminta ampun atas kesalahannya itu dan memaafkan keburukan-keburukan yang telah di lakukan dan mengetahui apa yang kamu kerjakan, baik yang besar maupun yang kecil. 26. Dan di samping itu, kemurahan Allah yang lain bahwa dia pula memperkenankan doa dan permohonan orang-orang yang beriman dan mengerjakan kebajikan yang di perintahkan Allah sebagai perwujudan imannya serta menambah pahala, kebaikan, dan ganjaran-Nya kepada mereka dari karunia-Nya lebih besar dari apa yang mereka kerjakan. Orang-orang yang ingkar, yang melanggar apa yang di perintahkan dan mengerjakan apa yang di larang akan mendapat azab yang sangat keras di hari akhirat kelak sebagai balasan atas ke ingkaran mereka."
  }
]