[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang yang beriman kepada Allah dan rasulNya memenuhi seruan rasulNya dan mereka tunduk kepadaNya dan Allah menambahkan karunia berupa taufik dan pelipatgandaan pahala balasan dengan karuniaNya. Sedangkan orang-orang kafir kepada Allah dan rasulNya akan memperoleh azab yang keras lagi menyakitkan di hari kiamat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "26. Allah menjawab doa orang-orang yang beriman kepada Allah dan rasul-rasul-Nya, serta menambahkan bagi mereka apa yang tidak mereka minta, sementara bagi orang-orang yang kafir terhadap Allah dan rasul-rasul-Nya adalah azab perih yang menanti mereka pada hari Kiamat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "26. Orang-orang beriman yang menjalankan amal shalih akan memenuhi seruan Allah untuk menuju kepada kebenaran, dan Allah akan menambah karunia, petunjuk, dan pahala yang besar bagi mereka. Sedangkan orang-orang yang mendustakan Allah akan mendapat azab yang pedih dalam neraka Jahannam."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "26. وَيَسْتَجِيبُ الَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ الصّٰلِحٰتِ (dan Dia memperkenankan (doa) orang-orang yang beriman serta mengerjakan amal yang saleh) Yakni Allah mengabulkan doa bagi orang-orang yang beriman kepada-Nya dan memberi apa yang mereka inginkan. وَيَزِيدُهُم مِّن فَضْلِهِۦ ۚ( dan menambah (pahala) kepada mereka dari karunia-Nya) Yakni Allah menambah atas apa yang mereka minta, atau atas pahala yang menjadi hak mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "26. Allah mengabulkan doa orang-orang yang beriman kepadaNya dan rasulNya, mengerjakan amal ibadah yang diperintahNya dan meninggalkan apa yang dilarangNya. Dia menambahkan kebaikan dan keutamaanNya berupa pahala yang lebih banyak dari yang semestinya. Dan bagi orang-orang kafir itu, siksa yang amat sangat pedih pada hari kiamat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia memperkenankan (doa) orang-orang yang beriman} Dia mengabulkan doa orang-orang yang beriman {dan beramal shalih, dan menambah kepada mereka dari karuniaNya. Dan orang-orang kafir, bagi mereka itu azab yang sangat keras"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "26. Allah mengajak hamba-hambaNYa untuk inabah (kembali) kepadaNYa dan bertauabt dari kelalaian. Lalu mereka terbagi berdasarkan penerimaan mereka kepada seruanNYa menjadi dua bagian: yang memenuhi seruan, dan mereka diungkapkan dengan FirmanNYa, ”dan orang-orang yang beriman serta mengerjakan amal shalih memenuhi,” maksudnya, mereka memenuhi seruan Rabb mereka tatkala mereka diseru oleh Allah kepadaNya, karena iman dan amal shalih yang mereka miliki membawa mereka kesana. Apabila mereka telah memenuhi seruan Allah, niscaya Allah bersyukur kepada mereka, Dialah yang maha pengampun lagi maha mensyukuri. dan memberikan tambahan kepada mereka “bagian dari kauniaNYa,” berupa taufik dan semangat untuk beramal dan menambahkan kepada mereka pelipatan pahala melebihi apa yang dapat diraihnya dengan amal-amalnya, berrupa pahala dan keuntungan yang sangat besar. Adapun orang-orang yang tidak memenuhi seruan Allah, mereka adalah orang-orang yang berkeras kepala, yang kafir kepadaNYa dan kepada para rasulNya, maka mereka memperoleh azab yang sangat keras di dunia dan dikahirat kelak."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syura ayat 26: (Dan Dia memperkenankan doa orang-orang yang beriman serta mengerjakan amal yang saleh) maksudnya, Dia mengabulkan apa yang mereka minta (dan menambah kepada mereka) maksudnya, Allah menambah kepada mereka (dari karunia-Nya. Dan orang-orang yang kafir bagi mereka azab yang sangat keras.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala mengajak semua hamba-hamba-Nya untuk kembali kepada-Nya dan tobat terhadap kelalaiannya, maka terbagilah mereka kepada dua golongan; golongan yang mengikuti yaitu orang-orang yang beriman dan golongan yang tidak mau mengikuti, yaitu orang-orang yang kafir. Maksudnya orang-orang yang beriman memenuhi ajakan Tuhan mereka saat mengajak mereka kepada-Nya, tunduk kepada-Nya dan mendatangi seruan-Nya, karena iman dan amal saleh yang ada pada mereka membawa mereka kepadanya. Ketika mereka mau mengikuti, maka Allah mensyukuri mereka dan Dia Maha Pengampun lagi Maha Mensyukuri. Dia tambahkan kepada mereka pula karunia, taufiq dan semangat untuk beramal serta menambahkan kelipatannya dalam hal pahala melebihi hal yang seharusnya diperoleh amal mereka berupa pahala dan keberuntungan yang besar. Adapun orang-orang yang tidak mau memenuhi panggilan Allah, yaitu mereka yang tetap membangkang yang kafir kepada-Nya dan kepada Rasul-Nya, maka mereka mendapatkan azab yang keras di dunia dan di akhirat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syura Ayat 26",
    "description": "Dan di samping itu, kemurahan Allah yang lain bahwa dia pula memperkenankan doa dan permohonan orang-orang yang beriman dan mengerjakan kebajikan yang di perintahkan Allah sebagai perwujudan imannya serta menambah pahala, kebaikan, dan ganjaran-Nya kepada mereka dari karunia-Nya lebih besar dari apa yang mereka kerjakan. Orang-orang yang ingkar, yang melanggar apa yang di perintahkan dan mengerjakan apa yang di larang akan mendapat azab yang sangat keras di hari akhirat kelak sebagai balasan atas ke ingkaran mereka. 27. Selain itu, kemurahan Allah adalah di bentangkannya rezeki bagi hamba-hamba-Nya. Allah menyatakan bahwa sekiranya Allah melapangkan rezeki kepada hamba-hamba-Nya dengan berbagai kenikmatan dan anugerah, baik yang bersifat materi maupun non-materi niscaya mereka akan berbuat melampaui batas di muka bumi dengan melakukan perbuatan-perbuatan yang menyimpang dari ajaran Allah dan tidak mensyukuri nikmat-nikmat-Nya. Ini sudah menjadi tabiat manusia pada umumnya. Dan tetapi dia menurunkan rezeki-rezeki-Nya dengan ukuran tertentu yang dia kehendaki. Sungguh, dia mahateliti tentang hal-hal yang mendetail terhadap semua keadaan hamba-hamba-Nya, maha melihat terhadap apa yang mereka lakukan dan terima."
  }
]