[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sekiranya Allah memberikan rizkiNya kepada hamba-hamba dan melapangkannya bagi mereka, niscaya mereka akan berbuat kerusakan dimuka bumi berupa kesombongan dan keangkuhan, dan niscaya sebagian dari mereka dan berbuat aniaya terhadap sebagian yang lain, akan tetapi Allah menurunkan rizki-rizki mereka dengan kadar yang mencukupi sesuai dengan kehendakNya, sesungguhnya Allah maha teliti terhadap kemaslahatn-kemaslahatan hambaNya, maha mengetahui bagaimana mengatur dan mengarahkan kondisi-kondisi mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "27. Seandainya Allah melapangkan rezeki bagi seluruh hamba-Nya, niscaya mereka akan melampaui batas dalam kezaliman di bumi. Akan tetapi Allah -Subḥānahu- menurunkan rezeki sesuai kehendak-Nya dalam hal melapangkan dan menyempitkan rezeki. Sesungguhnya Dia Maha Mengetahui dan Maha Melihat ihwal hamba-hamba-Nya. Dia memberi karena suatu berdasarkan hikmah dan menahan juga karena suatu hikmah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "27-28. Seandainya Allah melapangkan rezeki bagi hamba-hamba-Nya di atas kebutuhan mereka, niscaya itu akan terjadi kerusakan dan kezaliman di natara mereka. Akan tetapi Allah menetapkan rezeki yang cukup bagi mereka. Allah Maha Mengetahui keadaan hamba-hamba-Nya dan bagaimana mengatur urusan mereka. Dia yang menurunkan hujan setelah mereka putus asa dari kedatangannya, Dia menyebar rahmat-Nya di antara makhluk-makhluk-Nya. Dia Pelindung yang melindungi hamba-hamba-Nya dengan karunia-Nya dan Dia Terpuji dalam segala keadaan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "27. وَلَوْ بَسَطَ اللهُ الرِّزْقَ لِعِبَادِهِۦ (Dan jikalau Allah melapangkan rezeki kepada hamba-hamba-Nya) Yakni seandainya Allah melapangkan rezeki mereka. لَبَغَوْا۟ فِى الْأَرْض(tentulah mereka akan melampaui batas di muka bumi) Yakni niscaya mereka akan berbuat maksiat di atas bumi dan mengingkari kenikmatan yang Allah berikan, dan mereka akan menyombongkan diri dan meminta apa yang tidak layak mereka minta. وَلٰكِن يُنَزِّلُ بِقَدَرٍ مَّا يَشَآءُ ۚ( tetapi Allah menurunkan apa yang dikehendaki-Nya dengan ukuran) Yakni Allah menurunkan rezeki bagi hamba-hamba-Nya dengan kadar yang telah ditentukan sesuai dengan kehendak-Nya dan hikmah-Nya yang dalam. إِنَّهُۥ بِعِبَادِهِۦ خَبِيرٌۢ( Sesungguhnya Dia Maha Mengetahui hamba-hamba-Nya) Yakni mengetahui keadaan mereka. بَصِيرٌ(lagi Maha Melihat) Yakni melihat apa yang terbaik bagi mereka, rezeki yang luas atau sempit."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "27. Jika Allah melapangkan rejeki bagi seluruh hamba-hambaNya, niscaya mereka akan berada dalam kezaliman (melampaui batas hukum), kesewenang-wenangan dan kerusakan. Akan tetapi Dia menurunkan rejeki dalam jumlah tertentu sesuai dengan kabijaksanaanNya, tabiat manusia, dan sesuatu yang cocok untuk mereka, berupa kekayaan atau kefakiran. Sesungguhnya Allah SWT mengetahui rahasia-rahasia hambaNya dan keadaan mereka yang terlihat. Dia Maha Melihat sesuatu yang baik dan berbahaya bagi mereka. Ali RA berkata: “Ayat ini diturunkan untuk Ashabus Suffah. Mereka berkata: “Andai saja kita memiliki kekayaan di dunia”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Seandainya Allah melapangkan} melapangkan {rezeki kepada hamba-hambaNya, niscaya mereka akan melampaui batas} melampaui batas {di bumi. Akan tetapi Dia menurunkan nya sesuai kadar yang DIa kehendaki. Sesungguhnya Dia Maha Mengetahui lagi Maha Melihat hamba-hambaNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "27. kemudian Allah menjelaskan bahwa di antara kelembutanNYa terhadap hamba-hambaNYa adalah Dia tidak melimpahkan dunia (harta benda) kepada mereka dengan pelimpahan yang dapat merusak agama mereka, seraya berfirman, ”dan jikalau Allah melapangkan rizki kepada hamba-hambaNya, tentulah mereka akan melampaui batas di muka bumi,” artinya, niscaya mereka lalai dari ketaatan kepada Allah dan tenggelam dalam menikmati syahwat kehidupan dunia. Jadi, hal itu pasti membuat mereka sibuk dengan apa-apa yang disenangi oleh nafsu mereka sekalipun berupa maksiat dan kezhaliman. ”tetapi Allah menurunkan apa yang dikehendakiNYa dengan ukuran,”menurut tuntutan kelembutan dan hikmahNYa.” sesungguhnya DIa maha mengetahui hamba-hambaNYa lagi maha melihat,” sebagaimana disebutkan dalam salah satu riwayat (hadits qudsi): “Sesungguhnya di antara hamba-Ku, keimanan barulah menjadi baik jika Allah memberikan kekayaan padanya. Seandainya Allah membuat ia miskin, tentu hal itu akan merusaknya. Dan di antara hamba-Ku, keimanan barulah baik jika Allah memberikan kemiskinan padanya. Seandainya Allah membuat ia kaya, tentu hal itu akan merusaknya “Sesungguhnya di antara hamba-Ku, keimanan barulah menjadi baik jika Allah memberikan kesehatan padanya. Seandainya Allah membuat ia sakit, tentu hal itu akan merusaknya. Dan di antara hamba-Ku, keimanan barulah baik jika Allah memberikan penyakit padanya. Seandainya Allah membuat ia sehat tentu hal itu akan merusaknya. Aku mengatur urusan hamba-hamba KU dengan ilmuKU pada hati mereka, sesungguhnya Aku Mahamengetahui dan Mahamelihat”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syura ayat 27: (Dan jika Allah melapangkan rezeki kepada hamba-hamba-Nya) semuanya (tentulah mereka akan melampaui batas) semuanya akan melampaui batas; tentulah mereka akan berlaku sewenang-wenang (di muka bumi, tetapi Allah menurunkan) dapat dibaca Yunazzilu atau Yunzilu, yakni menurunkan rezeki-Nya (apa yang dikehendaki-Nya dengan ukuran) maka Dia melapangkan rezeki itu kepada sebagian hamba-hamba-Nya, sedangkan yang lainnya tidak; dan timbulnya sikap melampaui batas ini dari melimpahnya rezeki. (Sesungguhnya Dia Maha Mengetahui keadaan hamba-hamba-Nya lagi Maha Melihat.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ibnu Jarir meriwayatkan dengan sanadnya yang sampai kepada ‘Amr bin Harrits dan lainnya, bahwa mereka berkata, “Ayat ini turun berkenaan dengan penduduk Shuffah (serambi masjid), “Dan sekiranya Allah melapangkan rezeki kepada hamba-hamba-Nya niscaya mereka akan berbuat melampaui batas di bumi, tetapi Dia menurunkan dengan ukuran yang Dia kehendaki.” Hal itu karena mereka mengatakan, “Kalau sekiranya kamu punya…dst.” Mereka berangan-angan. Selanjutnya Allah Subhaanahu wa Ta'aala menyebutkan, bahwa di antara kelembutan-Nya kepada hamba-hamba-Nya adalah Dia tidak melapangkan rezeki kepada mereka yang dapat membahayakan agama mereka. Yakni tentu akan lalai dari menaati Allah, mendatangi kesenangan dunia, sehingga hidup mereka penuh dengan memenuhi hawa nafsu meskipun sebagai kemaksiatan dan kezaliman. Yakni sesuai kelembutan dan kebijaksanaan-Nya. Allah Subhaanahu wa Ta'aala memberi mereka rezeki yang Dia pilih yang di sana terdapat kebaikan bagi mereka, Dia lebih tahu dalam hal itu, sehingga Dia memberikan kekayaan orang yang berhak mendapatkannya dan membuat fakir orang yang berhak mendapatkannya. Jika kekayaan memperbaiki imannya, maka Dia memberikannya, tetapi jika kekayaan malah merusaknya, maka Dia berikan kefakiran. Demikian pula jika kesehatan memperbaiki imannya, maka Dia memberikannya dan jika sakit yang memperbaiki imannya, maka Dia berikan sakit."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syura Ayat 27",
    "description": "Selain itu, kemurahan Allah adalah di bentangkannya rezeki bagi hamba-hamba-Nya. Allah menyatakan bahwa sekiranya Allah melapangkan rezeki kepada hamba-hamba-Nya dengan berbagai kenikmatan dan anugerah, baik yang bersifat materi maupun non-materi niscaya mereka akan berbuat melampaui batas di muka bumi dengan melakukan perbuatan-perbuatan yang menyimpang dari ajaran Allah dan tidak mensyukuri nikmat-nikmat-Nya. Ini sudah menjadi tabiat manusia pada umumnya. Dan tetapi dia menurunkan rezeki-rezeki-Nya dengan ukuran tertentu yang dia kehendaki. Sungguh, dia mahateliti tentang hal-hal yang mendetail terhadap semua keadaan hamba-hamba-Nya, maha melihat terhadap apa yang mereka lakukan dan terima. 28. Hal lain yang menunjukkan kemurahan Allah adalah dialah yang menurunkan hujan dari langit setelah mereka berputus asa untuk mendapatkan air bagi kebutuhan mereka dan untuk menghadapi ke keringan yang berkepanjangan, dan dia juga menyebarkan rahmat-Nya itu kepada semua makhluk-Nya sehingga semuanya dapat menikmati dan memperoleh manfaatnya. Dan dialah maha pelindung bagi semua makhluk-Nya dari segala yang membahayakan mereka, maha terpuji atas segala rahmat, tindakan, dan kebijaksanaan-Nya."
  }
]