[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Hanya Allah semata yang menurunkan hujan dari langit, dengannya Allah menyelamatkan manusia setelah mereka berputus asa darinya, Dia menebarkan rahmatNya diantara makhlukNya lalu Dia meratakan hujan kepada mereka, Dialah penolong yang mengurusi urusan hamba-hamabNya dengan kebaikan dan karuniaNya yang maha terpuji dalam pertolongan dan pengaturanNYa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "28. Dia lah yang menurunkan hujan kepada hamba-hamba-Nya setelah mereka putus asa dari turunnya hujan, dan menyebarkan rahmat-Nya dengan hidupnya bumi setelah turun hujan, dan Dia lah yang mengatur semua urusan hamba-hamba-Nya dan Dia Maha Terpuji atas segala hal."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "28. وَهُوَ الَّذِى يُنَزِّلُ الْغَيْثَ مِنۢ بَعْدِ مَا قَنَطُوا۟ (Dan Dialah Yang menurunkan hujan sesudah mereka berputus asa) Yakni setelah mereka putus harapan dari hal itu, sehingga mereka mengetahui kadar rahmat bagi mereka lewat hujan yang diturunkan itu, dan agar mereka mensyukuri apa yang wajib mereka syukuri. وَهُوَ الْوَلِىُّ(Dan Dialah Yang Maha Pelindung) Pelindung bagi hamba-hamba-Nya yang shalih dengan memberi mereka kebaikan dan manfaat serta menjauhkan mereka dari keburukan. الْحَمِيدُ (lagi Maha Terpuji) Yakni Dzat yang berhak mendapat pujian dari mereka atas nikmat yang telah Dia berikan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "28. Allah adalah Dzat yang menurunkan hujan untuk menolong manusia usai mereka putus asa tentang turunnya hujan. Dia melebarkan rahmatNya untuk segala sesuatu dan menyebarluaskan manfaat hujan itu ke setiap tempat. Dialah Dzat yang memalingkan hamba-hambaNya yang shalih kepada kebaikan, Dzat yang dipuji dalam setiap keadaan, Dzat yang paling layak untuk dipuji dan diberi rasa syukur atas nikmatNya yang sangat banyak."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dialah yang menurunkan hujan} hujan {setelah mereka berputus asa} berputus asa terhadap turunnya hujan {dan menyebarkan rahmatNya} dan meluaskan hujanNya {Dialah Maha Pelindung} Dzat yang memberi perlindungan kepada para hambaNya dengan kebaikan dan karuniaNya {lagi Maha Terpuji"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "28. “Dan Dialah yang menurunkan hujan” maksudnya, hujan lebat yang dengannya negeri dan manusia menjadi hidup bergairah,”sesudah mereka berputus asa,” maksudnya, setelah hujan tidak turun dalam yang membuat mereka mengira ia tidak akan tuun lagi dan mereka berputus asa dan mereka telah mengupayakan segala untuk (mengatasi) kekeringan itu, lalu Allah menurunkan hujan lebat,”dan menyebarkan,” dengannya “rahmatNYa” yaitu seperti menumbuhkan makanan-makanan pokok untuk manusia dan hewan-hewan ternak mereka, sehingga hujan itu sangat berkesan bagi mereka, mereka besuka ria karenannya dan bergembira ”dan Dialah yang maha pelindung,” yang melindungi hamba-hambaNYa dengan berbagai macam bentuk pengaturan, dan DIalah yang mengatur berbagai macam bentuk pengaturan, dan Dialah yang mengatur berbagai kepetingan agama dan dunia mereka “lagi maha terpuji,” dalam perlindungan dan pengaturanNYa. Maha terpuji Allah atas kesempurnaan yang dimilkiNYa dan atas apa yang Dia limpahkan kepada makhlukNYa dari berbagai macam bentuk karunia."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syura ayat 28: (Dan Dialah Yang menurunkan hujan) yakni air hujan (sesudah mereka berputus asa) putus harapan dari turunnya hujan (dan menyebarkan rahmat-Nya) maksudnya, menyebarkan hujan yang diturunkan-Nya. (Dan Dialah Yang Maha Pelindung) yang berbuat baik kepada orang-orang Mukmin (lagi Maha Terpuji) di kalangan orang-orang beriman."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni hujan yang deras yang mengenai negeri dan penduduknya. Seyelah mereka mengira bahwa hujan tidak akan turun kepada mereka. Seperti dikeluarkan-Nya makanan untuk mereka dan hewan ternak mereka, sehingga mereka bergembira dengannya. Yakni yang mengurus hamba-hamba-Nya dengan berbagai pengurusan, Dia mengurus maslahat agama mereka maupun dunia mereka. Dalam pengurusan-Nya dan pengarahan-Nya. Demikian pula Maha Terpuji karena kesempurnaan-Nya dan karena Dia melimpahkan berbagai karunia kepada hamba-hamba-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syura Ayat 28",
    "description": "Hal lain yang menunjukkan kemurahan Allah adalah dialah yang menurunkan hujan dari langit setelah mereka berputus asa untuk mendapatkan air bagi kebutuhan mereka dan untuk menghadapi ke keringan yang berkepanjangan, dan dia juga menyebarkan rahmat-Nya itu kepada semua makhluk-Nya sehingga semuanya dapat menikmati dan memperoleh manfaatnya. Dan dialah maha pelindung bagi semua makhluk-Nya dari segala yang membahayakan mereka, maha terpuji atas segala rahmat, tindakan, dan kebijaksanaan-Nya. 29. Dan ketahuilah wahai seluruh manusia bahwa di antara tanda-tanda kebesaran dan kekuasaan-Nya adalah penciptaan langit dengan segala perhiasannya dan bumi yang terhampar dengan aneka macam isinya, yang kesemuanya di ciptakan dengan bentuk dan sistem yang sangat teliti. Dan juga menjadi tanda kekuasaan-Nya adalah penciptaan makhluk-makhluk yang melata yang dia sebarkan pada keduanya. Dan dia mahakuasa untuk mengumpulkan mereka semuanya apabila dia kehendaki, di mana pun atau kapan pun."
  }
]