[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Diantara tanda-tanda yang menunjukan kebesaran Allah, kuasa dan kekuasaanNya adalah penciptaan langit dan bumi tanpa contoh sebelumnya dan berbagi jenis makhluk bergerak (bernyawa) yang Dia tebarkan di muka bumi, dan Dia mahakuasa jika Dia berkehendak untuk mengumpulkan seluruh makhluk setelah mereka semuanya mati di hari kiamat, tidak ada sesutupun yang sulit bagi Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "29. Di antara tanda-tanda yang menunjukkan kekuasaan Allah dan keesaan-Nya adalah penciptaan langit dan bumi serta apa yang Dia sebarkan pada keduanya berupa makhluk-makhluk yang mengagumkan. Dia Mahakuasa mengumpulkan mereka untuk memberi balasan kapan saja Dia kehendaki, tidak susah bagi-Nya untuk melakukan hal itu sebagaimana tidak susah pula bagi-Nya untuk menciptakan mereka dari awal."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "29. وَمَا بَثَّ فِيهِمَا مِن دَآبَّةٍ ۚ (dan makhluk-makhluk yang melata Yang Dia sebarkan pada keduanya) Terdapat pendapat mengatakan bahwa yang dimaksud adalah Allah menyebar makhluk-makhluk di bumi saja. [aku katakan: secara tekstual ayat ini menjelaskan bahwa Allah menciptakan pula makhluk-makhluk melata di langit, bisa jadi terdapat sebagian planet yang dapat dihuni oleh makhluk hidup] وَهُوَ عَلَىٰ جَمْعِهِمْ(Dan Dia Maha Kuasa mengumpulkan semuanya) Yakni Allah mengumpulkan mereka di langit. إِذَا يَشَآءُ قَدِيرٌ(apabila dikehendaki-Nya) Yakni Allah mengumpulkan makhluk-makhluk melata itu dari tempat-tempatnya jika Dia menghendaki, dan Dia memiliki kemampuan penuh untuk melakukan itu."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "29. Salah satu tanda kekuasaan Allah: Dia menciptakan tujuh langit dan bumi, dan menyebarkan di dalamnya berbagai jenis hewan yang merayap di muka bumi dan bergerak di setiap langit. Dia Maha Kuasa untuk mengumpulkan seluruh makhluk-Nya jika Dia menghendaki hal itu, tidak ada yang sulit bagi-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "29. Di antara bukti-bukti kekuasaan Allah adalah langit dan bumi yang diciptakan dengan sangat menakjubkan ini, dan adanya makhluk hidup yang beragam dan tersebar di antara keduanya. Dia sangat mampu untuk mengumpulkan semuanya pada hari kiamat, jika berkehandak"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Di antara tanda-tandaNya adalah penciptaan langit dan bumi serta apa yang Dia sebarkan} Dia sebarkan {pada keduanya berupa makhluk-makhluk melata. Dia Maha kuasa mengumpulkan semuanya apabila Dia menghendaki"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syura ayat 29: (Dan di antara tanda-tanda kekuasaan-Nya ialah menciptakan langit dan bumi dan) menciptakan (apa yang Dia sebarkan) Dia sebar ratakan (pada keduanya, yaitu berupa makhluk yang melata) pengertian Ad-Dabbah ialah makhluk yang menempati bumi, yaitu manusia dan lain-lainnya. (Dan Dia untuk mengumpulkan semuanya) mengumpulkan semua makhluk untuk dihadapkan kepada-Nya (Maha Kuasa jika dikehendaki-Nya) Dhamir Hum yang terdapat pada lafal Jam'ihim lebih memprioritaskan makhluk yang berakal daripada makhluk lainnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni termasuk dalil yang menunjukkan kekuasaan-Nya yang besar dan bahwa Dia akan menghidupkan orang yang telah mati setelah matinya. Dengan keadaannya yang luas dan besar yang menunjukkan kekuasaan-Nya dan luas-Nya kerajaan-Nya. Apa yang tampak pada keduanya berupa kerapihan dan keindahan menunjukkan kebijaksanaan-Nya. Demikian pula apa yang ada pada keduanya berupa berbagai manfaat dan maslahat menunjukkan rahmat-Nya, dan bahwa hal itu menunjukkan bahwa Dia berhak ditujukan berbagai ibadah, dan bahwa peribadahan kepada selain-Nya adalah batil. Sebagai maslahat dan manfaat bagi hamba-hamba-Nya. Setelah mereka mati di padang mahsyar pada hari Kiamat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syura Ayat 29",
    "description": "Dan ketahuilah wahai seluruh manusia bahwa di antara tanda-tanda kebesaran dan kekuasaan-Nya adalah penciptaan langit dengan segala perhiasannya dan bumi yang terhampar dengan aneka macam isinya, yang kesemuanya di ciptakan dengan bentuk dan sistem yang sangat teliti. Dan juga menjadi tanda kekuasaan-Nya adalah penciptaan makhluk-makhluk yang melata yang dia sebarkan pada keduanya. Dan dia mahakuasa untuk mengumpulkan mereka semuanya apabila dia kehendaki, di mana pun atau kapan pun. 30. Pada ayat yang lalu, Allah telah menunjukkan beberapa kebaikan sebagai anugerah yang bersumber dari-Nya. Pada ayat ini, Allah menyatakan bahwa musibah yang kamu peroleh adalah akibat perbuatanmu sendiri. Allah berfirman, 'dan musibah apa pun yang menimpa kamu, kapan dan di manapun, adalah di sebabkan oleh perbuatan tanganmu sendiri. Itu semua karena kecerobohan, kesalahan, dan kemaksiatan yang kamu lakukan sendiri, dan walaupun begitu, Allah tetap memaafkan banyak dari kesalahan-kesalahanmu itu."
  }
]