[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kalian (wahai umat manusia) tidak dapat melemahkan kuasa Allah atas kalian dan tidak pula mampu menghindarinya. kalian tidak memiliiki penolong selain Allah yang mengurusi urusan-urusan kalian, yang bisa menyampaikan manfaat kepada kalian dan tiada pula pembantu bagi kalian selain Allah yang dapat menolak kemudaratan dari kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "31. Dan tidaklah kalian mampu untuk menyelamatkan diri dari Rabb kalian jika Dia ingin menghukum kalian, dan tidaklah kalian mempunyai pelindung yang mampu melindungi urusan kalian selain Dia, tidak pula kalian mempunyai penolong yang mampu mengangkat siksa dari diri kalian jika Allah menghendaki untuk menyiksa kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "31. Hai para hamba, kalian di bumi tidak akan melemahkan Allah, dan kalian tidak akan dapat lari dari-Nya. kalian tidak memiliki penolong selain Allah yang dapat mengatur urusan kalian, dan menjauhkan kalian dari sesuatu yang dapat menyakiti kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "30. وَمَآ أَصٰبَكُم مِّن مُّصِيبَةٍ فَبِمَا كَسَبَتْ أَيْدِيكُمْ (Dan apa saja musibah yang menimpa kamu maka adalah disebabkan oleh perbuatan tanganmu sendiri) Yakni musibah-musibah yang menimpa kalian apapun itu adalah balasan bagi kalian atas kemaksiatan yang telah kalian lakukan. وَيَعْفُوا۟ عَن كَثِيرٍ (dan Allah memaafkan sebagian besar (dari kesalahan-kesalahanmu)) Yakni memaafkan banyak kemaksiatan yang dilakukan oleh hamba-hamba-Nya, maka Allah tidak tercela disebabkan telah menurunkan musibah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "31. Wahai manusia, kalian tidak bisa menghalangi Tuhan untuk menghukum kalian. Maka larilah dariNya di bumi, namun kalian tetap berada dalam genggamanNya. Kalian tidak memiliki pembimbing, pelindung, dan penolong yang mencegah azab yang akan menimpa kalian selain Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kalian tidak dapat melepaskan diri di bumi} melepaskan diri dari Allah dengan lari di bumi {dan kalian tidak mempunyai pelindung atau penolong pun selain Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "31. penangguhan hukuman-hukuman bukanlah karena Allah mengabaikan dan bukan pula karena Allah tidak mampu, sebab “kamu tidak dapat mengalahkan di muka bumi,” maksudnya, (kalian tidak mungkin) mengalahkan kuasa Allah terhadap kalian, melainkan kalianlah yang lemah, tidak berdaya di muka bumi ini, kalian tidak bisa menghindar dari apa yang dilakukan Allah terhadap kalian,”dan kamu tidak memperoleh seorang pelindung pun selain Allah,” yang bisa melindungi kalian, sehingga kalian mendapat keuntungan-keuntugan darinya “dan tidak pula seorang penolong,” yang dapat menolak marahabaya dari kalian."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syura ayat 31: (Dan kalian tidak dapat) hai orang-orang musyrik (melepaskan diri) melarikan diri dari azab Allah (di muka bumi) maksudnya, kalian tidak akan dapat meloloskan diri dan menghindar dari azab-Nya itu (dan kalian tidak memperoleh selain Allah) (seorang pelindung pun dan tidak pula seorang penolong) yang dapat menolak azab Allah dari kalian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Wahai kaum musyrik. Yani kamu tidak dapat melemahkan kekuasaan Allah terhadapmu, bahkan kamu semua adalah lemah, dan kamu tidak dapat menolak apa yang Allah tetapkan untukmu. Sehingga kamu memperoleh manfaat. Yang menghindarkan bahaya darimu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syura Ayat 31",
    "description": "Dan meskipun kamu memiliki kekuatan yang sangat besar, kamu tidak akan dapat melepaskan diri dari siksaan Allah, jika Allah menurunkannya untuk kalian di bumi, dan kamu tidak akan pernah memperoleh pelindung yang dapat melindungi kamu dari azab itu atau penolong yang dapat menolong kamu dari bahaya apa pun yang akan menimpamu selain Allah. 32. Dan di antara tanda-tanda kebesaran dan kekuasaan-Nya ialah kapal-kapal yang beraneka macam yang berlayar di laut dengan aneka muatan dan penumpang di dalamnya, bagaikan gunung-gunung yang menjulang tinggi."
  }
]