[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "32-33 Diantara ayat-ayatNya yang menunjukan kuasa Allah yang mengagumkan dan kekuasaan-NYa yang mengalahkan, adalah kapal-kapal yang besar seperti gunung yang berlayar di lautan. Bila Allah yang membuat kapal-kapal itu berjalan di laut berkehendak, Dia akan menghentikan angin sehingga kapal-kapal itu hanya diam diatas air, tidak bergerak. sesungguhnya dalam berlayarnya kapal-kapal itu dan berhentinya ia di lautan dengan kuasa Allah mengandung nasihat-nasihat dan bukti-bukti yang nyata atas kuasa Allah bagi orang-orang yang sangat sabar dalam menerima takdir Allah yang menyakitkan, serta banyak bersyukur atas nikmat-nikmat dan karunia-karuniaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "33. Jikalau Allah berkehendak untuk menenangkan angin yang menjalankan kapal-kapal itu niscaya Allah menenangkannya sehingga kapal-kapal itu tetap diam di laut dan tidak bergerak. Sesungguhnya di dalam hal-hal yang disebutkan itu dari mulai penciptaan kapal-kapal dan pergerakan angin terdapat bukti-bukti yang nyata atas kekuasaan Allah bagi orang yang banyak bersabar atas cobaan yang menimpanya dan banyak bersyukur atas nikmat Allah untuknya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "33. إِن يَشَأْ يُسْكِنِ الرِّيحَ (Jika Dia menghendaki, Dia akan menenangkan angin) Yakni angin yang menggerakkan kapal-kapal. فَيَظْلَلْنَ(maka jadilah kapal-kapal itu) Yakni kapal-kapal. رَوَاكِدَ(terhenti) Terhenti dengan tenang. عَلَىٰ ظَهْرِهِۦٓ ۚ( di permukaan laut) Di atas permukaan laut. إِنَّ فِى ذٰلِكَ(Sesungguhnya pada yang demikian itu) Yakni pada urusan kapal-kapal itu. لَاٰيٰتٍ(terdapat tanda-tanda (kekuasaan-Nya)) Yakni tanda-tanda yang agung. لِّكُلِّ صَبَّارٍ شَكُورٍ(bagi setiap orang yang banyak bersabar dan banyak bersyukur) Yakni bagi orang yang sangat sabar atas musibah dan banyak bersyukur atas kenikmatan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "33. Jika berkehendak, Allah akan memberhentikan angin yang menggerakkan kapal-kapal layar itu sehingga tetap diam di atas permukaan laut. Sesungguhnya dalam pelayaran dan pemberhentian kapal itu di atas air adalah untuk menunjukkan betapa menakjubkannya kekuasaan Tuhan itu bagi setiap kesabaran dan rasa syukur atas nikmat Tuhan yang dilakukan oleh orang mukmin."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Jika Dia menghendaki, Dia akan menghentikan angin, sehingga kapal itu terhenti} berhenti {di permukaannya} menetap di permukaan laut dan tidak bisa berlayar {Sesungguhnya pada yang demikian itu terdapat ayat-ayat bagi tiap-tiap orang yang selalu bersabar dan banyak bersyukur"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "33-34 kemudian Allah menyinggung sebab-sebab (fasilitas-fasilitas) tersebut dengan FirmanNYa, ”jika Dia menghendaki, Dia akan menenangkan angin, ” yang dijadikan oleh Allah sebagai sebab yang membuatnya bisa berjalan, “maka jadilah, ” yakni, kapal-kapal itu “terhenti, ” di permukaan lautan, tidak bisa maju dan tidak bisa mundur. Ini tidak menjadi batal karena adanya kapal-kapal motor, sebab diantara syaratnya untuk bisa berangkat adalah adanya angin. Dan jika Allah menghendaki, niscaya Dia membinasakan kapal-kapal tesebut karena perbuatan para penumpangnya. Maksudnya, Allah menenggelamkannya di dalam lautan dan menghancukannya. Namun Allah masih berlaku lembut dan memaafkan kebanyakan (perbuatan mereka). “sesungguhnya pada yang demikian itu tedapat tanda-tandaNya bagi setiap orang yang banyak bersabar dan banyak bersyukur, ” maksudnya, sangat penyabar terhadap hal-hal yang tidak disukai oleh jiwanya dan menyusahkannya sehingga ia tidak menyukainya, seperti kesusahan dalam menjalankan ketaatan atau dalam menolak bujukan untuk berbuat maksiat, atau untuk menghentikan jiwannya bersikap muka di saat ditimpa musibah dan suka berterima kasih di waktu senang dan di saat menerima berbagai nikmat, dia mengakui karunia tuhannya, ia tunduk patuh kepadaNya dan menggunakannya dalam angka mencari keridaanNya. Itulah oang yang akan dapat banyak mengambil manfaat dari ayat-ayat Allah. Adapun orang yang tidak mempunyai kesabaran dan tidak mempunyai rasa syukur terhadap nikmat-nikmat Allah, maka ia pasti berpaling atau bersikap keras kepala, tidak mau mengambil pelajaran dari ayat-ayat Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syura ayat 33: (Jika Dia menghendaki Dia akan menenangkan angin, maka jadilah kapal-kapal itu) sehingga jadilah kapal-kapal itu (terhenti) diam tidak dapat melaju (di permukaan laut. Sesungguhnya pada yang demikian itu terdapat tanda-tanda kekuasaanNya bagi setiap orang yang banyak bersabar dan banyak bersyukur) yang dimaksud adalah orang mukmin, dia dapat bersabar di kala tertimpa musibah dan bersyukur di kala hidup senang."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala mengingatkan tentang sebab-sebab itu. Dimana dengan angin kapal mereka dapat berjalan. Orang itu adalah orang mukmin, di mana ia bersabar saat menerima musibah dan terhadap hal yang memberatkan dirinya, seperti rasa lelah ketika menjalankan ketaatan, menolak segala yang mengajak kepada maksiat serta menahan dirinya agar tidak keluh kesah. Demikian pula ia bersyukur saat memperoleh kelapangan dan saat mendapatkan nikmat; dia mengakui nikmat Tuhannya dan tunduk kepada-Nya serta mengalihkan nikmat-nikmat itu untuk mencari keridhaan-Nya. Orang inilah yang dapat mengambil manfaat dari ayat-ayat Allah. Adapun orang yang tidak bersabar dan bersyukur, maka ia tetap saja berpaling atau membangkang dan tidak mendapatkan manfaat dari ayat-ayat-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syura Ayat 33",
    "description": "Jika dia, Allah, menghendaki, dia akan menghentikan angin yang mendorong kapal-kapal itu dalam pelayarannya, sehingga jadilah kapal-kapal itu terhenti, tidak akan bergerak, dan tidak pula akan dapat berlayar di permukaan laut hingga sampai ke tempat tujuannya. Sungguh, pada yang demikian itu, yaitu berhenti dan berlayarnya kapal itu, terdapat tanda-tanda ke kuasaan Allah bagi orang yang selalu bersabar menerima musibah dan kesulitan dan banyak bersyukur menerima ke nikmatan dan ke senangan yang di anugerahkan Allah, 34. Atau dia akan menghancurkan kapal-kapal itu bersama dengan muatan dan penumpang yang ada di dalamnya dengan cara mengirimkan badai yang sangat besar karena pelanggaran dan perbuatan dosa yang mereka lakukan. Dan dia memaafkan banyak dari mereka dan dosa-dosa mereka."
  }
]