[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Atau Allah menenggelamkan kapal-kapal itu karena dosa-dosa para penumpangnya dan Dia juga memaafkan banyak dosa sehingga tidak menyiksa karenanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "34. Atau jikalau Allah -Subḥānahu- berkehendak untuk menghancurkan kapal-kapal itu dengan mengirimkan angin topan kepadanya niscaya Allah menghancurkannya karena dosa-dosa yang dilakukan oleh manusia. Dan Allah memaafkan banyak dari dosa hamba-hamba-Nya sehingga Dia tidak menyiksa mereka walaupun banyak dosa mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "34. أَوْ يُوبِقْهُنَّ بِمَا كَسَبُوا۟ (atau kapal-kapal itu dibinasakan-Nya karena perbuatan mereka) Yakni jika Allah menghendaki niscaya Dia akan membinasakan kapal-kapal itu dengan menenggelamkan akibat dosa-dosa yang telah mereka perbuat. وَيَعْفُ عَن كَثِيرٍ (atau Dia memberi maaf sebagian besar (dari mereka)) Dengan mengampuni dosa-dosa mereka, sehingga menyelamatkan mereka dari tenggelam."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "34. Jika berkehendak, Allah akan membinasakan para penumpang (kapal) dengan menenggelamkan mereka akibat perbuatan dosa mereka. Akan tetapi Dia mengabaikan dosa-dosa dari kebanyakan penumpang kapal-kapal itu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Atau Dia akan menghancurkan kapal-kapal itu} menenggelamkannya {karena perbuatan mereka, dan Dia memaafkan banyak (kesalahan)"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "33-34 kemudian Allah menyinggung sebab-sebab (fasilitas-fasilitas) tersebut dengan FirmanNYa, ”jika Dia menghendaki, Dia akan menenangkan angin, ” yang dijadikan oleh Allah sebagai sebab yang membuatnya bisa berjalan, “maka jadilah, ” yakni, kapal-kapal itu “terhenti, ” di permukaan lautan, tidak bisa maju dan tidak bisa mundur. Ini tidak menjadi batal karena adanya kapal-kapal motor, sebab diantara syaratnya untuk bisa berangkat adalah adanya angin. Dan jika Allah menghendaki, niscaya Dia membinasakan kapal-kapal tesebut karena perbuatan para penumpangnya. Maksudnya, Allah menenggelamkannya di dalam lautan dan menghancukannya. Namun Allah masih berlaku lembut dan memaafkan kebanyakan (perbuatan mereka). “sesungguhnya pada yang demikian itu tedapat tanda-tandaNya bagi setiap orang yang banyak bersabar dan banyak bersyukur, ” maksudnya, sangat penyabar terhadap hal-hal yang tidak disukai oleh jiwanya dan menyusahkannya sehingga ia tidak menyukainya, seperti kesusahan dalam menjalankan ketaatan atau dalam menolak bujukan untuk berbuat maksiat, atau untuk menghentikan jiwannya bersikap muka di saat ditimpa musibah dan suka berterima kasih di waktu senang dan di saat menerima berbagai nikmat, dia mengakui karunia tuhannya, ia tunduk patuh kepadaNya dan menggunakannya dalam angka mencari keridaanNya. Itulah oang yang akan dapat banyak mengambil manfaat dari ayat-ayat Allah. Adapun orang yang tidak mempunyai kesabaran dan tidak mempunyai rasa syukur terhadap nikmat-nikmat Allah, maka ia pasti berpaling atau bersikap keras kepala, tidak mau mengambil pelajaran dari ayat-ayat Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syura ayat 34: (Atau kapal-kapal itu dibinasakan-Nya) lafal ayat ini di'athafkan kepada Yuskin artinya, atau Dia menenggelamkan kapalkapal itu berikut para penumpang dan apa yang dimuatnya, yaitu dengan menimbulkan angin badai (karena perbuatan mereka) disebabkan dosa-dosa yang dilakukan oleh para penumpangnya (atau Dia memberi maaf sebagian besar) dari dosa-dosa itu, yang karenanya Dia tidak menenggelamkan para pelakunya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni dengan menenggelamkannya dan membinasakannya, akan tetapi Dia Maha Penyantun dan banyak memaafkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syura Ayat 34",
    "description": "Atau dia akan menghancurkan kapal-kapal itu bersama dengan muatan dan penumpang yang ada di dalamnya dengan cara mengirimkan badai yang sangat besar karena pelanggaran dan perbuatan dosa yang mereka lakukan. Dan dia memaafkan banyak dari mereka dan dosa-dosa mereka. 35. 'semua kebesaran dan kekuasaan kami itu, ' kata Allah, 'ditunjukkan kepada mereka agar orang-orang yang selalu membantah tanda-tanda kekuasaan kami mengetahui dan menyadari bahwa mereka berada di bawah kekuasaan kami dan tidak akan memperoleh jalan keluar dan menghindarkan diri dari siksaan kami. '."
  }
]