[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang yang mendebat ayat-ayat Kami yang menetapkan tauhid bagi Kami, dengan cara yang batil, mengetahui bahwa mereka tidak memiliki tempat berlari dan menghindar dari azab Allah bila Allah mengazab mereka atas dosa-dosa dan kekafiran mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "35. Pada saat penghacuran kapal-kapal tersebut dengan angin badai, orang-orang yang membantah ayat-ayat Allah karena ingin membatalkannya mengetahui bahwa mereka tidak mempunyai tempat untuk lari dari kehancuran, sehingga mereka tidak menyeru kecuali kepada Allah dan meniggalkan lain-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "35. Orang-orang kafir yang membantah dengan kebatilan ayat-ayat qur’aniyah dan kauniyah Kami telah mengetahui bahwa mereka tidak dapat lari dari azab Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "35. وَيَعْلَمَ الَّذِينَ يُجٰدِلُونَ فِىٓ ءَايٰتِنَا مَا لَهُم مِّن مَّحِيصٍ (Dan supaya orang-orang yang membantah ayat-ayat (kekuasaan) Kami mengetahui bahwa mereka sekali-kali tidak akan memperoleh jalan ke luar) Yakni mereka tidak dapat lari atau mendapat tempat kabur."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "35. Allah mengetahui orang-orang yang saling berdebat tentang ayat-ayat kami yang tercantum dalam Al-Qur’an dengan bathil. Mereka adalah orang-orang kafir. Mereka tidak memiliki jalan lari dan jalan keluar dari azab. Ini adalah untuk menjelaskan kekuasaan Allah dan memperingatkan orang-orang kafir di setiap waktu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Agar orang-orang yang membantah ayat-ayat Kami mengetahui bahwa mereka tidak akan memperoleh jalan keluar} tempat melarikan diri dari azab Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "35. kemudian Allah berrfiman, ”dan supaya orang-orang yang membantah ayat-ayat kami mengetahui, ” untuk membatalkannya (merusaknya) dengan kebatilan mereka, ”bahwa mereka sekali-kali tidak akan memperoleh jalan keluar, ” tidak ada yang bisa menyelamatkan mereka dari siksa yang menimpa mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syura ayat 35: (Dan supaya mengetahui) lafal ayat ini kalau dibaca Rafa' berarti merupakan jumlah Isti'naf atau kalimat baru, kalau dibaca Nashab berarti di'athafkan kepada Ta'lil yang diperkirakan keberadaannya, yaitu; Dia menenggelamkan mereka sebagai pembalasan dari-Nya kepada mereka, dan supaya mengetahui (orang-orang yang membantah ayat-ayat Kami, bahwa mereka sekali-kali tidak akan memperoleh jalan keluar) maksudnya, tempat untuk melarikan diri dari azab Kami. Jumlah Nafi atau lafal Ma Lahum Min Mahiish menduduki tempat dua Maf'ul bagi lafal Ya'lama. Sedangkan Nafinya sendiri di-mu'allaqkan dari amalnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan kebatilan mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syura Ayat 35",
    "description": "'semua kebesaran dan kekuasaan kami itu, ' kata Allah, 'ditunjukkan kepada mereka agar orang-orang yang selalu membantah tanda-tanda kekuasaan kami mengetahui dan menyadari bahwa mereka berada di bawah kekuasaan kami dan tidak akan memperoleh jalan keluar dan menghindarkan diri dari siksaan kami. '36. Sesuatu apa pun yang di berikan kepadamu dari ke nikmatan lahiriah, seperti rezeki harta atau ke nikmatan lain yang di peroleh di dunia ini, maka itu adalah ke senangan hidup di dunia yang di nikmati buat sementara, tidak kekal abadi. Sedangkan apa, yaitu ke nikmatan, yang ada di sisi Allah, yang di anugerahkan kepadamu sebagai balasan atas segala kebaikan yang telah di lakukan di dunia lebih baik dari semua ke nikmatan lahiriah duniawi itu dan lebih kekal di nikmati bagi orang-orang yang beriman. Ke nikmatan duniawi akan berakhir karena kematian dan hanya kepada tuhan mereka, mereka bertawakal, yaitu berserah diri dan menyerahkan segala urusannya setelah mengusahakannya dengan segala kemampuannya."
  }
]