[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apapun yang diberikan kepada kalian (wahai manusia) baik berupa harta atau anak-anak atau lainnya adalah kesenangan bagi kalian dalam hidup di dunia ini, ia akan lenyap dengan cepat, sedangkan apa yang ada di sisi Allah berupa kenikmatan surga yang langgeng adalah lebih baik dan lebih abadi bagi orang-orang yang beriman kepada Allah dan para utusanNya dan mereka bertawakal kepada tuhan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "36. Maka apa yang diberikan kepada kalian -wahai manusia- mulai dari harta, kedudukan dan anak, maka itu adalah kenikmatan kehidupan dunia semata, dan itu akan hilang terputus. Sementara kenikmatan yang abadi adalah kenikmatan Surga yang disiapkan Allah untuk orang-orang yang beriman kepada Allah dan kepada rasul-rasul-Nya serta bersandar hanya kepada Rabb mereka dalam setiap urusan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "36-41. Allah menganggap kehidupan dunia sangat sedikit: Hai para hamba, seberapa banyakpun perhiasan dunia yang kalian kumpulkan, janganlah itu membuat kalian lalai, karena itu hanyalah kenikmatan kehidupan dunia yang fana. Dan pahala dari Allah di akhirat lebih baik dari kenikmatan dunia dan lebih kekal keberadaannya; dan ini semua bagi orang-orang yang beriman dan bertawakkal kepada Allah. Sifat-sifat mereka adalah mereka menjauhi dosa-dosa besar dan kemaksiatan yang keji, jika mereka marah maka mereka akan memaafkan, menahan amarah, menyambut keimanan yang Allah serukan kepada mereka, mengerjakan shalat pada waktunya, bermusyawarah dalam urusan penting mereka, menyedekahkan sebagian rezekinya di jalan Allah, dan jika mereka terzalimi maka mereka membalasnya dengan balasan yang setimpal tanpa melebihi kezaliman yang mereka dapatkan, dan barangsiapa yang memaafkan orang yang berbuat buruk kepadanya dan memperbaiki hubungannya dengan orang itu demi mengharap keridhaan Allah maka balasan pemberian maaf itu akan Allah berikan. Allah tidak menyukai orang-orang yang zalim; dan barangsiapa membalas orang zalim dengan balasan setimpal maka itu bukan suatu perbuatan dosa."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "36. فَمَآ أُوتِيتُم مِّن شَىْءٍ فَمَتٰعُ الْحَيَوٰةِ الدُّنْيَا ۖ (Maka sesuatu yang diberikan kepadamu, itu adalah kenikmatan hidup di dunia) Yakni kekayaan dan kelapangan rezeki yang diberikan kepada kalian hanyalah kenikmatan yang sedikit dan sebentar, yang akan habis dan sirna. وَمَا عِندَ اللهِ(dan yang ada pada sisi Allah) Berupa pahala ketaatan, yaitu surga. خَيْرٌ(lebih baik) Lebih baik daripada kenikmatan dunia. وَأَبْقَىٰ( dan lebih kekal) Karena kenikmatan surga tidak akan terputus, sedangkan kenikmatan dunia akan habis dengan cepat. لِلَّذِينَ ءَامَنُوا۟ وَعَلَىٰ رَبِّهِمْ يَتَوَكَّلُونَ(bagi orang-orang yang beriman, dan hanya kepada Tuhan mereka, mereka bertawakkal) Yakni mereka menyerahkan dan menyandarkan segala urusan mereka kepada Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "36. Kalian tidak memberikan sedikitpun nikmat seperti kekayaan dan kekuatan. Itu tidak lain hanyalah harta benda yang terbatas untuk dinikmati kemudian hilang. Pahala ketaatan di sisi Allah itu lebih baik dan lebih kekal pengaruhnya daripada harta benda dunia, karena hal itu abadi dan tidak terputus-putus. Pahala itu diperuntukkan bagi orang-orang yang beriman kepada Allah dan rasulNya, dan menyerahkan urusan mereka kepadaNya. Ali RA berkata: “Abu Bakar RA menyedekahkan seluruh harta bendanya, kemudian semua orang mencelanya, lalu turunlah ayat ini”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apa pun yang diberikan kepada kalian} apapun yang diberikan kepada kalian {maka itu adalah kesenangan hidup di dunia. Dan apa yang ada di sisi Allah lebih baik dan lebih kekal bagi orang-orang yang beriman dan hanya bertawakal kepada Tuhan mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "36. ini adalah anjuran zuhud terhadap dunia dan rangsangan untuk mencintai akhiat dan penjelasan tentang aml-amal yang bisa mengantarkan kepadanya, seraya berfirman, ”maka sesuatu apapun yang diberikan kepadamu, ” berupa kerajaan, kekuasaan, harta kekayaan, anak-anak, kesehatan, dan keselamatan fisik, ”itu adalah kenikmatan hidup di dunia, ” suatu kelezatan yang akan punah dan akan terputus, ”dan yang ada pada sisi Allah, ” yaitu pahala yang berlimpah dan balasan yang sangat mulia dan kenikmatan abadi, adalah”lebih baik, ”dai kelezatan-kelezatan dunia;suatu perbandingan kebaiakn yang jauh diantara keduanya, ”dan lebih kekal, ” sebab ia adalah kenikmatan yang tidak ada kesusahannya, tidak ada kekeruhannya, dan tidak ada perpindahan. Kemudian Dia menjelaskan milik siapa pahala itu, seraya berfiman ”bagi orang-orang yang beriman, dan hanya kepada Rabb mereka, mereka betawakal, ”maksudnya, mereka memadukan antara iman yang benar yang melahirkan amal-amal iman yang tampak dan yang tidak tampak, dengan tawakal (sikap berserah diri)yang merupakan alat bagi setiap amal. Sebab, setiap amal (perbuatan) yang tidak diserrtai tawakal adalah tidak sempuna. Tawakal adalah bersandar diri kepada Allah dengan hati dalam mencari apa-apa yang dicintai dan menolak apa-apa yang tidak disukai, disertai dengan sikap percaya sepenuhnya kepada Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syura ayat 36: (Maka apa yang diberikan kepada kalian) khithab ayat ini ditujukan kepada orang-orang mukmin dan lain-lainnya (berupa sesuatu) dari perhiasan duniawi (itu adalah kenikmatan hidup di dunia) untuk dinikmati kemudian lenyap sesudah itu (dan yang ada pada sisi Allah) berupa pahala (lebih baik dan lebih kekal bagi orang-orang yang beriman dan hanya kepada Rabb mereka, mereka bertawakal) kemudian di'athafkan kepadanya ayat berikut ini, yaitu:"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini membuat seseorang zuhud kepada dunia dan cinta kepada akhirat serta menyebutkan amal yang dapat menyampaikan kepadanya. Seperti kekuasaan, kedudukan, harta dan anak, serta badan yang sehat. Yang kemudian akan hilang. Yaitu pahala yang besar dan kenikmatan yang kekal. Daripada kesenangan dunia. Mereka menggabung antara iman yang benar yang menghendaki amal dengan tawakkal, dimana ia (tawakkal) merupakan alat untuk setiap amal. Oleh karena itu, setiap amal yang tidak dibarengi tawakkal, maka tidak akan sempurna. Tawakkal adalah bersandarnya hati kepada Allah dalam mendatangkan apa yang dicintai hamba dan dalam menghindarkan apa yang tidak disukainya dengan disertai rasa percaya kepada-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syura Ayat 36",
    "description": "Sesuatu apa pun yang di berikan kepadamu dari ke nikmatan lahiriah, seperti rezeki harta atau ke nikmatan lain yang di peroleh di dunia ini, maka itu adalah ke senangan hidup di dunia yang di nikmati buat sementara, tidak kekal abadi. Sedangkan apa, yaitu ke nikmatan, yang ada di sisi Allah, yang di anugerahkan kepadamu sebagai balasan atas segala kebaikan yang telah di lakukan di dunia lebih baik dari semua ke nikmatan lahiriah duniawi itu dan lebih kekal di nikmati bagi orang-orang yang beriman. Ke nikmatan duniawi akan berakhir karena kematian dan hanya kepada tuhan mereka, mereka bertawakal, yaitu berserah diri dan menyerahkan segala urusannya setelah mengusahakannya dengan segala kemampuannya. 37. Dan juga kenikmatan-kenikmatan ukhrawi itu lebih baik dan lebih kekal bagi orang-orang yang menjauhi dosa-dosa besar dan perbuatan-perbuatan keji, dan apabila mereka marah yang disebabkan oleh karena perbuatan buruk yang di lakukan oleh orang lain terhadap mereka, segera memberi maaf atas kesalahannya itu."
  }
]