[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang yang menjauhi dosa-dosa besar dari apa-apa yang dilarang Allah dan kemaksiatan-kemaksiatan yang buruk lagi jelek, dan bila mereka marah kepada orang yang berbuat buruk kepada mereka, mereka memaafkan perbuatan buruk tersebut. tidak membalas perilaku keburukan demi mencari pahala dan maaf dari Allah, ini termasuk kemuliaan akhlak."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "37. Dan orang-orang yang menghindari dosa-dosa besar dan dosa-dosa yang buruk, apabila mereka marah terhadap orang yang berbuat jahat kepada mereka baik dengan ucapan atau dengan perbuatan, mereka akan memaafkan kesalahannya dan tidak membalasnya. Dan sifat pemaaf ini merupakan kelebihan mereka jika di dalamnya terdapat kebaikan dan maslahat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "37. وَالَّذِينَ يَجْتَنِبُونَ كَبٰٓئِرَ الْإِثْمِ (Dan (bagi) orang-orang yang menjauhi dosa-dosa besar) Yakni dosa-dosa besar yang telah dijelaskan pada surat an-Nisa: 31. وَالْفَوٰحِشَ(dan perbuatan-perbuatan keji) Perbuatan-perbuatan keji ini termasuk juga dalam dosa-dosa besar, namun dosanya lebih berat dari dosa-dosa besar lainnya. Perbuatan-perbuatan keji ini seperti pembunuhan, zina, dan lain sebagainya. وَإِذَا مَا غَضِبُوا۟ هُمْ يَغْفِرُونَ(dan apabila mereka marah mereka memberi maaf) Yakni mereka memaafkan kesalahan yang telah membuat mereka marah dengan memendam kemarahan mereka, dan bersabar terhadap orang yang menzalimi mereka. Dalam hadits disebutkan: “Rasulullah tidak pernah membalas dendam untuk dirinya sendiri, melainkan karena larangan-larangan Allah dilanggar.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "37. Apa yang di sisi Allah itu lebih baik bagi orang-orang yang beriman, tawakal dan menjauhi dosa-dosa besar (yaitu Allah mengancam dan mengumumkan batasan hukum tertentu terkait dosa tersebut) dan kemaksiatan yang buruk dan keji, seperti zina dan pembunuhan. Itu adalah penyebutan yang khusus dengan maksud untuk menyebut yang umum. Saat marah, mereka menjauhi dosa dan menahan amarah mereka. Ayat ini diturunkan untuk Umar, saat dicaci di Mekah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan orang-orang yang menjauhi dosa-dosa besar dan perbuatan-perbuatan keji} kemaksiatan-kemaksiatan yang buruk {dan apabila mereka marah segera memberi maaf"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "37. “dan (juga bagi) orang-orang yang menjauhi dosa-dosa besar dan perbuatan-perbuatan keji, ” perbedaan antara dosa-dosa besar dengan perbuatan-perbuatan keji, sekalipun semuanya merupakan dosa besar, adalah bahwa perbuatan-perbuatan keji adalah dosa yang sangat besar yang di dalam jiwa tedapat nafsu dorongan untuk melakukannya, seperti zina dan yang serupa dengannya. Sedangkan dosa-dosa besar adalah yang tidak sepeti itu. Pengertian ini adalah bila keduanya disebutkan secara besamaan. adapun kalau masing-masing disebutkan secara terpisah (tersendiri), maka yang terakhir masuk kepada yang sebelumnya. ”dan (juga bagi orang-orang yang) apabila mereka marah, mereka memberi maaf, ” maksudnya, mereka telah berakhlak mulia dan berbudi luhur, sehingga sifat lembut telah menjadi karakter mereka, akhlak mulia telah menjadi tabiat mereka hingga apabila ada seseorang yang membuatnya marah dengan ucapan ataupun perbuatannya, mereka menahan kemarahannya itu, mereka tidak melepaskannya, bahkan mereka memafkannya. Mereka tidak membalas orang yang berbuat buruk kecuali dengan ihsan (sikap baik), memaafkan, dan berlapang dada. maka sikap memaafkan dan berlapang dada ini melahirkan banyak maslahat dan banyak mencegah timbulnya kerusakan pada diri mereka sendiri dan pada orang lain. Ini sebagaimana firmanNYa, “tolaklah kejahatan itu dengan cara yang lebih baik, maka tiba-tiba orang yang antaramu dan antara dia ada permusuhan seolah-olah telah menjadi teman yang sangat setia. Sifat-sifat yang baik itu tidak dianugerahkan melainkan kepada orang-orang yang sabar dan tidak dianugrahkan melainkan kepada orrang-orang yang mempunyai keberuntungan yang besar, ” (fushilat:34-35)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syura ayat 37: (Dan bagi orang-orang yang menjauhi dosa-dosa besar dan perbuatan-perbuatan keji) yang mengharuskan pelakunya menjalani hukuman Hadd; lafal ayat ini merupakan 'Athful Ba'dh 'Alal Kull (dan apabila mereka marah mereka memberi maaf) maksudnya, mereka selalu bersikap maaf."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Menurut Syaikh As Sa’diy, perbedaan antara dosa-dosa besar dengan perbuatan keji; dimana kedua-duanya sama-sama dosa besar adalah, bahwa perbuatan keji adalah dosa besar dimana dalam hati manusia ada kecenderungan kepadanya, seperti zina dan sebagainya. Sedangkan dosa besar (selain perbuatan keji) tidak seperti itu. Hal ini ketika dipadukan antara keduanya, akan tetapi ketika dipisahkan, maka masing-masingnya masuk ke dalam yang lain. Yakni mereka memiliki akhlak yang mulia dan kebiasaan yang baik, dimana sifat santun menjadi tabiat mereka, akhlak yang mulia juga sehingga ketika ada yang membuat mereka marah, baik dengan kata-kata maupun perbuatannya, maka mereka menahan marahnya dan tidak memberlakukannya, bahkan mereka memaafkan dan tidak membalas orang yang jahat kecuali dengan ihsan, memaafkan dan mengampuni; sehingga dari sikap itu muncullah berbagai maslahat dan terhindar berbagai mafsadat baik bagi mereka maupun orang lain; bahkan yang sebelumnya terdapat permusuhan menjadi persahabatan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syura Ayat 37",
    "description": "Dan juga kenikmatan-kenikmatan ukhrawi itu lebih baik dan lebih kekal bagi orang-orang yang menjauhi dosa-dosa besar dan perbuatan-perbuatan keji, dan apabila mereka marah yang disebabkan oleh karena perbuatan buruk yang di lakukan oleh orang lain terhadap mereka, segera memberi maaf atas kesalahannya itu. 38. Ayat yang lalu menjelaskan kenikmatan ukhrawi yang diperoleh oleh orang-orang yang menghindarkan diri dari perbuatan dosa besar. Ayat ini juga menerangkan bahwa kenikmatan ukhrawi yang lebih baik dan lebih kekal itu juga akan diperoleh oleh orang-orang yang menerima seruan tuhan mereka. Dan kenikmatan ukhrawi itu akan di anugerahkan pula kepada orang-orang yang menerima dan mematuhi seruan tuhan melalui para rasul dan wahyu-wahyu yang di sampaikan kepada mereka dan orang-orang yang melaksanakan salat, sebagai salah satu kewajiban yang diwajibkan kepada mereka, sedang urusan mereka yang berkaitan dengan persoalan dunia dan kemaslahatan kehidupan mereka, diputuskan dengan musyawarah antara mereka. Dan yang juga menerima kenikmatan ukhrawi itu adalah mereka yang menginfakkan di jalan Allah dengan tulus dan ikhlas sebagian dari rezeki mereka, baik dalam bentuk harta maupun lainnya yang kami berikan kepada mereka."
  }
]