[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang yang menjawab seruan tuhan mereka saat Dia mengajak mereka kepada tauhid dan ketaatan, mereka mendirikan shalat-shalat wajib dengan batasan-batasan pada waktu-waktunya, dan bila mereka hendak melakukan sesuatu mereka bermusyawarah terlebih dahulu tentangnya, dan mereka menyedekahkan sebagian harta yang Kami berikan kepada mereka di jalan Allah, mereka menunaikan hak-hak yang harus ditunaikan kepada yang berhak berupa zakat, nafkah dan bentuk-bentuk infak yang lain."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "38. Dan orang-orang yang menjawab seruan Rabb mereka, dengan cara melakukan perintah-Nya dan meninggalkan larangan-Nya, mengerjakan salat dalam bentuk yang paling sempurna, orang-orang yang selalu bermusyawarah di antara mereka dalam urusan yang penting dan orang-orang yang menafkahkan sebagian apa yang Kami rezekikan kepada mereka dengan maksud mengharap wajah Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "38. وَالَّذِينَ اسْتَجَابُوا۟ لِرَبِّهِمْ (Dan (bagi) orang-orang yang menerima (mematuhi) seruan Tuhannya) Yakni mematuhi apa yang diperintahkan kepada mereka dan mentaati para rasul. وَأَقَامُوا۟ الصَّلَوٰةَ(dan mendirikan shalat) Mendirikannya pada waktunya sesuai dengan syarat-syarat dan rukun-rukunnya. Allah mengkhususkan penyebutan shalat karena ia adalah ibadah yang paling tinggi derajatnya, yang merupakan penyambung antara hamba dengan Tuhannya. وَأَمْرُهُمْ شُورَىٰ بَيْنَهُمْ(sedang urusan mereka (diputuskan) dengan musyawarat antara mereka) Mereka merundingkan urusan mereka tanpa terburu-buru, dan tidak mementingkan pandapat masing-masing dalam setiap masalah yang mendatangi mereka, yakni masalah yang menyangkut masyarakat luas seperti, pengangkatan khalifah, pengaturan negara, pengangkatan pemimpin wilayah, dan hukum-hukum peradilan. Demikian pula pada urusan pribadi mereka saling berunding. وَمِمَّا رَزَقْنٰهُمْ يُنفِقُونَ(dan mereka menafkahkan sebagian dari rezeki yang Kami berikan kepada mereka) Mereka menginfakkan harta mereka di jalan-jalan kebaikan dan menyedekahkannya pada orang-orang yang membutuhkan dan di jalan Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "38. Dan bagi orang-orang yang menerima anjuran Tuhan untuk mereka berupa bertauhid, ibadah, dan menaati rasul. Mereka melaksanakan shalat hanya dengan sempurna dan mengkhususkannya untuk berdzikir, karena shalat adalah ibadah paling tinggi. Mereka bermusyawarah dalam urusan-urusan yang umum dan yang khusus tanpa mementingkan dan memaksakan pendapat individu, seperti urusan kepemimpinan, wilayah, masalah hukum, dan perkara-perkara yang khusus. Mereka menafkahkan rejeki yang diberikan oleh Allah dalam jalan yang baik. Maknanya adalah bahwa musyawarah adalah sesuatu yang sudah lazim dalam menyelesaikan masalah mereka. Ayat ini diturunkan untuk kaum Anshar yang diajak rasulallah SAW untuk beriman, kemudian mereka menerimanya dan mendirikan shalat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan orang-orang yang menerima seruan Tuhan dan mendirikan shalat, dan urusan mereka (diputuskan) dengan musyawarah di antara mereka. Mereka menginfakkan sebagian dari rezeki yang Kami anugerahkan kepada mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "38 “dan orang-orang yang menerima seruan RRabbnya, ” maksudnya, mereka tunduk untuk menaatiNYa, memenuhi seruanNYa dan tujuan mereka pun adalah keridaanNYa dan tujuan akhir mereka adalah meraih kedekatan denganNYa. termasuk memenuhi seruan Allah adalah menegakkan shalat dan menunaikan zakat. Maka dari itu Allah menyambung keduanya dengan yang sebelumnya sebagai athful am alal khash (pengikutan pada yang umum kepada yang khusus) yang menunjukan kemuliaan dan keutamaan yang khusus itu, seraya berfirman ”dan mendirikan shalat, ” yang lahir dan yang batinnya, yang fardhu dan yang sunnahnya, ” dan mereka menginfakan sebagain dari izki yang kami berikan kepada mereka, ” infak yang wajib seperti zakat, infak terhadap kerabat dekat dan yang semisal mereka, dan infak yang Sunnah seperti bersedekah kepada masyarakat awam. ”sedang urusan mereka, ” yang bersikap religi dan yang besifat duniawi” adalah musyawarah antara mereka, ”maksudnya, tidak seorangpun dai mereka yang bersikap otoriter dengan pendapatnya dalam suatu urusan bersama diantara mereka. Ini tidak akan terjadi kecuali merupakan bagian dari kebesamaan, kekompakan, kecintaan, dan saling sayang menyayangi diantara mereka, dan meupakan kesempurnaan (kematangan) pikiran mereka adalah bahwa apabila mereka hendak melakukan suatu perkara yang memerlukan pengarahan pikian dan pendapat, maka mereka berkumpul, bemusyarah, serta melakukan pembahasan tentangnya, hingga jika kemaslahatan sudah terbukti, maka mereka segera nmengambilnya. ini seperti pendapat (ide) dalam peperangan dan jihad, penugasan para petugas untuk menduduki suatu jabatan kekuasaan atau hakim atau yang semisal dengannya. juga seperti pembahasan tentang masalah-masalah agama secara umum, sebab semua itu termasuk permasalahan bersama. melakukan pembahasan bersama. melakukan pembahasn terhadapnya adalah untuk menjelaskan yang tepat dari yang dicintai Allah. Itu semua masuk dalam ayat ini."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syura ayat 38: (Dan bagi orang-orang yang menerima seruan Rabbnya) yang mematuhi apa yang diserukan Rabbnya yaitu, mentauhidkan-Nya dan menyembah-Nya (dan mendirikan salat) memeliharanya (sedangkan urusan mereka) yang berkenaan dengan diri mereka (mereka putuskan di antara mereka dengan musyawarah) memutuskannya secara musyawarah dan tidak tergesa-gesa dalam memutuskannya (dan sebagian dari apa yang Kami rezekikan kepada mereka) atau sebagian dari apa yang Kami berikan kepada mereka (mereka menafkahkannya) untuk jalan ketaatan kepada Allah. Dan orang-orang yang telah disebutkan tadi merupakan suatu golongan kemudian golongan yang lainnya ialah;"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni tunduk menaati-Nya dan menyambut seruan-Nya seperti tauhid dan beribadah kepada-Nya, sehingga niat mereka adalah mencari keridhaan-Nya dan tujuan mereka adalah dekat dengan-Nya. Termasuk memenuhi seruan Allah adalah mendirikan shalat dan menunaikan zakat Yang fardhu maupun yang sunat. Baik yang terkait dengan agama maupun dunia. Mereka tidak bertindak sendiri dan tergesa-gesa dalam masalah yang terkait orang banyak. Oleh karena itu, apabila mereka ingin melakukan suatu perkara yang butuh pemikiran dan ide, maka mereka berkumpul dan mengkaji bersama-sama, sehingga ketika sudah jelas maslahatnya, maka mereka segera melakukannya. Misalnya adalah dalam masalah perang dan jihad, mengangkat pegawai pemerintahan atau yang menjadi hakim, demikian pula membahas masalah-masalah agama secara umum, karena ia termasuk masalah yang terkait antara sesama, dan membahasnya agar jelas yang benar yang dicintai Allah. Seperti nafkah yang wajib, misalnya zakat, menafkahi anak-istri dan kerabat, dsb. Sedangkan nafkah yang sunat seperti bersedekah kepada semua manusia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syura Ayat 38",
    "description": "Ayat yang lalu menjelaskan kenikmatan ukhrawi yang diperoleh oleh orang-orang yang menghindarkan diri dari perbuatan dosa besar. Ayat ini juga menerangkan bahwa kenikmatan ukhrawi yang lebih baik dan lebih kekal itu juga akan diperoleh oleh orang-orang yang menerima seruan tuhan mereka. Dan kenikmatan ukhrawi itu akan di anugerahkan pula kepada orang-orang yang menerima dan mematuhi seruan tuhan melalui para rasul dan wahyu-wahyu yang di sampaikan kepada mereka dan orang-orang yang melaksanakan salat, sebagai salah satu kewajiban yang diwajibkan kepada mereka, sedang urusan mereka yang berkaitan dengan persoalan dunia dan kemaslahatan kehidupan mereka, diputuskan dengan musyawarah antara mereka. Dan yang juga menerima kenikmatan ukhrawi itu adalah mereka yang menginfakkan di jalan Allah dengan tulus dan ikhlas sebagian dari rezeki mereka, baik dalam bentuk harta maupun lainnya yang kami berikan kepada mereka. 39. Ayat-ayat yang lalu menjelaskan beberapa golongan yang akan mendapatkan kenikmatan ukhrawi dari Allah. Di dalam ayat ini, Allah memerintahkan untuk membela diri kepada orang-orang yang di zalimi. Dan orang-orang yang apabila mereka di perlakukan dengan zalim, yaitu tindakan yang melampaui batas oleh orang lain, mereka sendiri dengan segala kekuatan dan kemampuannya membela diri sesuai dengan kondisi yang mereka hadapi."
  }
]