[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang yang bila dizhalimi, mereka menuntut hak mereka kepada orang yang menzhalimi mereka tanpa melampaui batas, namun bila mereka bersabar, maka akibat kesabaran mereka mengandung kebaikan yang banyak."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "39. Dan orang-orang yang apabila mereka mendapat perlakuan zalim, mereka membela diri demi menjaga kemuliaan dan harga dirinya, jika orang yang berbuat zalim itu bukan orang yang layak diberi maaf. Pembelaan diri ini diperbolehkan, khususnya apabila tidak ada kebaikan dalam pemberian maaf."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "39. وَالَّذِينَ إِذَآ أَصَابَهُمُ الْبَغْىُ هُمْ يَنتَصِرُونَ (Dan ( bagi) orang-orang yang apabila mereka diperlakukan dengan zalim mereka membela diri) Yakni jika mereka terzalimi tanpa alasan yang benar, sebab tunduk kepada orang yang menzalimi mereka bukanlah termasuk sifat yang menunjukkan kehormatan mereka, sebagaimana disebutkan dalam firman-Nya: ولله العزة ولرسوله وللمؤمنين “Padahal kekuatan itu hanyalah bagi Allah, bagi Rasul-Nya dan bagi orang-orang mukmin.” (al-Munafiqun: 8) Oleh sebab itu membalas orang yang menzaliimi termasuk keutamaan dalam agama, sebab kelemahan, kerendahan, dan kehinaan bukanlah sifat orang-orang beriman, namun itu semua merupakan sifat musuh-musuh mereka yang mengingkari Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "39. Dan orang-orang yang saat menerima kezaliman dan tindakan yang melewati batas, mereka menolong atau membela diri mereka dari kezaliman itu dengan melawan keburukan itu menggunakan sesuatu yang serupa."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan orang-orang yang apabila mereka diperlakukan zalim} dizalimi dan dimusuhi {mereka membela diri} membalas orang yang menzalimi mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "39. “dan orang-orang yang apabila mereka diperlakukan dengan zhalim, ” maksudnya, kezhaliman yang sampai kepada mereka dai musuh, ”mereka membela diri, ”karena kekuatan dan keperkasaan (harga diri) mereka. mereka tidak menjadi manusia yang hina dan lemah untuk membela diri. Ringkasnya, Allah menyifati mereka dengan iman, tawakal kepada Allah, menjauhi perbuatan-perbuatan keji dan dosa-dosa besar yang dengannya dosa-dosa kecil dihapuskan, kepatuhan yang sempurna dan memenuhi seruan tuhan mereka, menegakkan shalat, berinfak di jalan-jalan kebajikan, bermusyawarah dalam urusan-urusan mereka, kekuatan dan membela diri terhadap musuh. Inilah karakter-karakter mulia dalam diri mereka tersebut memastikan mereka melakukan karakter-karakter lainnya dan menjauhi lawan-lawannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syura ayat 39: (Dan bagi orang-orang yang apabila mereka diperlakukan dengan lalim) dizalimi (mereka membela diri) maksudnya membalas perlakuan zalim itu sesuai dengan kelaliman yang diterimanya, sebagaimana yang diungkapkan oleh firman-Nya:"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Karena kuat dan mulianya mereka dan mereka bukan orang yang lemah dan hina. Allah Subhaanahu wa Ta'aala menyifati mereka dengan iman, tawakkal kepada Allah, menjauhi dosa-dosa besar dan perbuatan keji, ketundukan yang sempurna, memenuhi seruan Tuhan mereka, mendirikan shalat, berinfak dalam hal-hal yang baik, bermusyawarah dalam menetapkan suatu keputusan serta kuat dan mulia sehingga membalas orang yang menzalimi mereka. Ini semua merupakan sifat sempurna yang mereka miliki, dan hal ini berarti mereka juga mengerjakan perkara yang di bawah itu dan tidak melakukan kebalikannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syura Ayat 39",
    "description": "Ayat-ayat yang lalu menjelaskan beberapa golongan yang akan mendapatkan kenikmatan ukhrawi dari Allah. Di dalam ayat ini, Allah memerintahkan untuk membela diri kepada orang-orang yang di zalimi. Dan orang-orang yang apabila mereka di perlakukan dengan zalim, yaitu tindakan yang melampaui batas oleh orang lain, mereka sendiri dengan segala kekuatan dan kemampuannya membela diri sesuai dengan kondisi yang mereka hadapi. 40. Dan balasan dari suatu kejahatan apa pun adalah kejahatan yang setimpal dan seimbang dengan kejahatan itu demi mencapai keadilan, tetapi barang siapa memaafkan pelaku dan perbuatan zalim yang di lakukannya dan berbuat baik kepada orang yang berbuat jahat itu, maka pahalanya akan di perolehnya dengan jaminan dari Allah. Sungguh, dia tidak menyukai, yaitu tidak melimpahkan rahmat-Nya, kepada orang-orang zalim."
  }
]