[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Hanya milik Allah semata apa yang ada di langit dan di bumi Dia maha tinggi dengan dzat, kuasa, dan keperkasaanNya, juga maha agung yang memiliki keagungan dan kebesaran."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Hanya milik Allah semata apa yang ada di langit dan apa yang ada di bumi, baik itu dalam penciptaan, kekuasaan dan pengaturan, dan Dia Mahatinggi dalam Żat, takdir dan kekuasaan-Nya, dan Dia Mahaagung dalam Żat-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. لَهُۥ مَا فِى السَّمٰوٰتِ وَمَا فِى الْأَرْضِ ۖ وَهُوَ الْعَلِىُّ الْعَظِيمُ (Kepunyaan-Nya-lah apa yang ada di langit dan apa yang ada di bumi. Dan Dialah yang Maha Tinggi lagi Maha Besar) Allah menyebutkan tentang diri-Nya ini untuk menunjukkan kesempurnaan kuasa-Nya, dan pengaturan-Nya yang pasti terjadi pada seluruh makhluk-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Milik Allah itu segala sesuatu di langit dan bumi, baik itu kerajaan, makhluk dan persembahan. Dialah yang Maha Tinggi lagi Maha Mulia. Dzat yang Maha Agung kekuasaanNya. Maksudnya adalah untuk menunjukkan kesempurnaan kuasa Allah dan berlakunya aturanNya terhadap para makhlukNya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "MilikNyalah apa yang ada di langit dan apa yang ada di bumi. Dialah Dzat Yang Maha tinggi lagi Maha agung"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-5. Allah menyampaikan bahwasanya Dia mewahyukan al-Quran agung ini kepada Nabi yang mulia sebagaimana Dia telah mewahyukan kepada para nabi dan rasul sebelum beliau. Dalam berita ini terdapat karuniaNya berupa penurunan kitab-kitab suci dan pengutusan para rasul di masa dahulu dan berikutnya, dan bahwa sesungguhnya Nabi Muahammad bukanlah rasul pertama, dan bahwa sesungguhnya jalan yang ia tempuh adalah jalan para rasul sebelum beliau, dan kondisi-kondisinya pun sama dengan kondisi-kondisi para rasul sebelum beliau, dana pa yang belia bawa (yaitu ajaran) serupa dengan ajaran yang mereka bawa. Sebab semuanya adalah benar dan kebenaran, yaitu diturunkan dari Tuhan Yang menyandang sifat ketuhanan (uluhiyah), keperkasaan agung, kebijaksanaan sempurna, seluruh alam atas dana lam bawah adalah kerajaanNya dan berada di bawah kendaliNya, baik secara takdir maupun syar’i, Dan sesungguhnya Dia “Yang Mahatingggi,” dzat, kemuliaan, dan keperkasaanNya, “lagi Mahabesar,” yang karena kebesaranNya, “hampir saja langit itu pecah dari sebelah atasnya,” padahal keduanya sangat luar biasa besarnya dan keduanya adalah benda mati. “Dan malaikat-malaikat,” yang mulia lagi didekatkan, tunduk kepada keagunganNya dan bersikap hina dina karena keperkasaanNya, patuh kepada RububiyahNya. “mereka bertasbih dengan memuji Rabbnya,” mereka mengagungkanNya dari segala kekurangan dan menyifatiNya dengan segala sifat kesempurnaan, “dan memohonkan ampun bagi orang-orang yang ada di bumi,” dari hal-hal yang timbul dari mereka, yaitu segala apa yang tidak layak dengan keagungan dan kebesaran Allah, padahal Dia “Yang Maha Pengampun lagi Maha Penyayang,” yang kalau saja bukan karena ampunan dan rahmatNya, tentu Dia segera menimpakan hukuman yang membinasakan terhadap manusia. Di dalam pengungkapan terhadap Allah dengan sifat-sifat tersebut di atas setelah Dia menjelaskan bahwasanya Dia telah mewahyukan kepada para rasul pada umumnya dan kepada Nabi Muhammad pada khususnya, terdapat sebuah isyarat bahwa al-Quran al-Karim ini mengandung dalil-dalil dan argument-argumen serta ayat-ayat yang membuktikan akan kesempurnaan Sang Pencipta, Allah, dan pengungkapan tentang Allah dengan nama-nama yang agung yang menyebabkan hati penuh dengan ma’rifat, kecintaan, pengagungan, penghormatan dan pemuliaan kepadaNya serta memusatkan segala bentuk penghambaan lahir dan batin hanya kepadaNya. Dan sesungguhnya kezhaliman yang paling besar dan perkataan (keyakinan) yang paling keji adalah pengangkatan sembahan-sembahan selain Allah, yang mereka sama sekali tidak memiliki kuasa memberikan manfaat ataupun menimpakan bahaya, melainkan mereka adalah makhluk yang bergantung kepada Allah dalam seluruh kondisi dan perihal mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syura ayat 4: (Kepunyaan-Nyalah apa yang ada di langit dan apa yang ada di bumi) sebagai milik-Nya semua makhluk dan hambahamba-Nya. (Dan Dialah Yang Maha Tinggi) di atas semua makhluk-Nya (lagi Maha Besar) atau Maha Agung."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni milik-Nya, ciptaan-Nya dan hamba-Nya. Semuanya di bawah pengaturan-Nya baik yang bersifat qadari (ketetapan-Nya terhadap alam semesta) maupun syar’i (ketetapan-Nya dalam agama). Baik zat-Nya, kedudukan-Nya maupun kekuasaan-Nya. Karena kebesaran-Nya langit itu hampir saja pecah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syura Ayat 4",
    "description": "Menjadi milik-Nya lah, dan di bawah kekuasaan, pengaturan, dan kewenangan-Nya lah segala apa yang ada di langit dan apa yang ada di bumi. Dan dia lah, yang mahaagung dalam kedudukan-Nya, mahabesar dalam kekuasaan-Nya. 5. Hampir saja langit-langit yang menjadi milik-Nya itu, yang telah diciptakan-Nya dengan sangat kuat dan kukuh, pecah dari sebelah atas-Nya karena kebesaran dan keagungan Allah. Dan malaikat-malaikat di mana pun berada selalu bertasbih menyucikan-Nya dari segala kekurangan dengan memuji keagungan dan kebesaran tuhan-Nya dan memohonkan ampunan untuk orang-orang beriman yang ada di bumi atas dosa-dosa mereka. Ingatlah, sesungguhnya Allah dialah yang maha pengampun dengan mengampuni dosa hamba-hamba-Nya, maha penyayang dengan memberikan rahmat-Nya kepada mereka."
  }
]