[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Hukuman keburukan atas pelakunya adalah keburukan semisalnya, tidak ada tambahan. namun barangsiapa memaafkan pelaku keburukan dan tidak menghukumnya, lalu dia memperbaiki hubungan dirinya dengan pelaku yang dimaafkan tersebut demi mencari wajah Allah, maka pahala maafnya dijaimin oleh Allah. Sesungguhnya Allah tidak mencintai orang-orang yang zhalim yang memulai melakukan permusuhan terhadap manusia dan berbuat buruk kepada mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "40. Barangsiapa berkehendak untuk mengambil haknya, maka ia diperbolehkan, akan tetapi dengan kadar yang sama tanpa tambahan dan atau melampaui batas. Dan barangsiapa memaafkan orang yang berbuat jahat terhadap dirinya dan tidak membalasnya atas perbuatan jahat itu serta melakukan perdamaian antara dirinya dan saudaranya, maka pahalanya ada di sisi Allah. Sesungguhnya Dia tidak menyukai orang-orang yang zalim, yang berbuat zalim terhadap manusia pada jiwa mereka, harta mereka dan kehormatan mereka. Bahkan Allah memurkai mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "40. وَجَزٰٓؤُا۟ سَيِّئَةٍ سَيِّئَةٌ مِّثْلُهَا ۖ( Dan balasan suatu kejahatan adalah kejahatan yang serupa) Yakni jika kamu membalas orang yang menzalimimu maka janganlah membalas lebih dari kadar kezalimannya kepadamu. Mujahid dan as-Suddy mengatakan: balasan ini dalam tanggapan terhadap orang yang berkata buruk, jika orang itu berkata: “semoga Allah menghinakanmu” maka jika ia membalasnya maka harus dengan “semoga Allah menghinakanmu” tanpa menambahnya dengan ucapan buruk lain. فَمَنْ عَفَا وَأَصْلَحَ فَأَجْرُهُۥ عَلَى اللهِ ۚ( maka barang siapa memaafkan dan berbuat baik maka pahalanya atas (tanggungan) Allah) Yakni barangsiapa yang memaafkan orang yang menzaliminya dan memperbaiki hubungan antara dirinya dengan orang yang menzaliminya dengan pemberian maaf ketika dia mampu untuk membalas dendam. Namun jika dia tidak membalas karena kelemahan dan kehinaan maka itu bukanlah suatu keutamaan. Sebab Allah memberi pahala orang yang memaafkan jika dia sebenarnya mampu untuk membalas dendam dan mengambil haknya dari orang yang menzaliminya, namun dia merelakannya karena mengharap pahala Allah. إِنَّهُۥ لَا يُحِبُّ الظّٰلِمِينَ(Sesungguhnya Dia tidak menyukai orang-orang yang zalim) Yakni Allah tidak menyukai orang-orang yang memulai kezaliman, dan orang yang berlebihan dalam membalas kezaliman karena itu juga termasuk kezaliman itu sendiri."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "40. Balasan tindakan buruk adalah balasan yang serupa. Balasan itu dikatakan sama-sama buruk atau sama-sama jahat bentuknya. Maka barangsiapa memaafkan orang yang menzaliminya dan meredakan permusuhan antara dia dan orang yang menzalimi itu, maka pahalanya itu di sisi Allah Azza wa Jalla. Sesungguhnya Allah SWT tindak meyukai orang-orang yang saling menyerang untuk membunuh dan melewati batas, namun itu Allah sedang menghukum mereka, karena sesungguhnya melewati batas itu adalah kezaliman."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Balasan suatu keburukan adalah keburukan yang serupa. dan siapa saja yang memaafkan dan berdamai, maka pahalanya dari Allah. Sesungguhnya Dia tidak menyukai orang-orang zalim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "40. Allah menjelaskan pada ayat ini tingkatan-tingkatan hukuman, yaitu ada tiga tingkatan: keadilan, keutamaan, dan kezahliman. Tingkatan adil adalah membalas kejahatan dengan kejahatan serupa, tidak lebih dan tidak kurang. Maka nyawa dibalas dengan nyawa, setiap angggota tubuh dengan anggota tubuh yang sama, dan harta dibalas dengan ganti rugi harta yang semisal. Tingkatan keutamaan adalah memafkan dan berdamai dengan yang berbuat kesalahan. Maka dari itu Allah berfirman, ”maka barangsiapa memaafkan dan berbuat baik maka pahalanya atas tanggungan Allah, ” Allah akan memberinya balasan upah yang sangat besar dan pahala yang sangat banyak. Allah memberikan persyaratan dalam pemberian maaf, yaitu untuk perbaikan dan memberikan petunjuk bahwa apbila si pelaku kejahatan itu tidak pantas diberi maaf dalam kondisi seperti ini pemberian maaf tidak diperintahkan. Dan pada pahal yang ditanggung Allah itu mengandung himbauan untuk memberikan maaf, dan hendaknya seorang hamba memperlakukan manusia dengan perlakuan yang dicintai oleh Allah, mkaa hewndaknya ia memaafkan mereka. Sebagaimana ia sennag diampuni oleh Allah, maka hendaklah ia mengampuni mereka, karena sesungguhnya ganjaran itu sejenis dengan perbuatan. Dan tingkatan kezhaliman telah dijelaskan oleh Allah dengan firmanNYa, ”sesungguhnya Dia tidak menyukai orang-orang yang zhalim, ” yaitu orang-orang yang terlebih dahulu melakukan kejahatan terhadap orang lain, atau membalas pelaku kejahatan dengan balasan yang melebihi kejahatannya. Jadi, berlebihan itu adalah tindak kezhaliman."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syura ayat 40: (Dan balasan suatu kejahatan adalah kejahatan yang serupa) kejahatan yang kedua ini dinamakan pula sebagai kejahatan bukan pembalasan, karena jenis dan gambarannya sama dengan yang pertama. Hal ini tampak jelas di dalam masalah yang menyangkut kisas luka. Sebagian di antara para ahli fikih mengatakan, bahwa jika ada seseorang mengatakan kepadamu, \"Semoga Allah menghinakan kamu,\" maka pembalasan yang setimpal ialah harus dikatakan pula kepadanya, \"Semoga Allah menghinakan kamu pula (maka barang siapa memaafkan) orang yang berbuat lalim kepadanya (dan berbuat baik) yakni tetap berlaku baik kepada orang yang telah ia maafkan (maka pahalanya atas tanggungan Allah) artinya, Allah pasti akan membalas pahalanya. (Sesungguhnya Dia tidak menyukai orang-orang yang lalim) maksudnya Dia tidak menyukai orang-orang yang memulai berbuat lalim, maka barang siapa yang memulai berbuat lalim dia akan menanggung akibatnya, yaitu siksaan dari-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dalam ayat ini Allah Subhaanahu wa Ta'aala menyebutkan beberapa macam hukuman, dan bahwa ia ada tiga macam, yaitu adil, ihsan dan zalim. Adil contohnya adalah membalas kejahatan dengan kejahatan yang setimpal, tidak kurang dan tidak lebih. Oleh karena itu, jiwa dibalas dengan jiwa, luka dibalas dengan luka yang serupa dan harta ditanggung dengan harta yang serupa. Ihsan contohnya memaafkan dan berbuat baik kepada orang yang berbuat jahat kepadanya. Orang yang menzaliminya. Yang dimaksud berbuat baik di sini ialah berbuat baik kepada orang yang berbuat jahat kepadanya. Adapula yang menafsirkan selain ini. Maksudnya, Allah akan memberikan kepadanya pahala yang besar dan balasan yang banyak, namun Allah mensyaratkan untuk memaafkan hendaknya ada ishlah (memperbaiki), hal itu menunjukkan, bahwa pelaku kejahatan jika tidak layak dimaafkan dan maslahat syar’i menghendaki untuk memberikan hukuman kepadanya, maka dalam keadaan ini tidaklah diperintahkan memaafkan. Firman-Nya, “Fa ajruhuu ‘alallah” (maka pahalanya dari Allah) terdapat dorongan untuk memaafkan dan menyikapi manusia dengan sikap yang dicintai Allah. Oleh karena Allah Subhaanahu wa Ta'aala suka memaafkan hamba-Nya, maka hendaknya ia memaafkan mereka. Adapun tentang zalim, maka disebutkan dalam firman-Nya, “Sungguh, Dia tidak menyukai orang-orang zalim.” Yakni orang-orang yang pertama berbuat kejahatan atas orang lain atau membalas pelaku kejahatan secara lebih, maka lebihnya itu adalah zalim."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syura Ayat 40",
    "description": "Dan balasan dari suatu kejahatan apa pun adalah kejahatan yang setimpal dan seimbang dengan kejahatan itu demi mencapai keadilan, tetapi barang siapa memaafkan pelaku dan perbuatan zalim yang di lakukannya dan berbuat baik kepada orang yang berbuat jahat itu, maka pahalanya akan di perolehnya dengan jaminan dari Allah. Sungguh, dia tidak menyukai, yaitu tidak melimpahkan rahmat-Nya, kepada orang-orang zalim. 41. Tetapi orang-orang yang telah berusaha membela diri mereka setelah di zalimi, tidak ada alasan untuk menyalahkan dan mengecam mereka."
  }
]