[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "(tetapi) barangsiapa menuntut haknya setelah dia dizhalimi maka mereka tidak memikul dosa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "41. Barangsiapa membela diri maka mereka tidak berdosa karena mereka mengambil hak mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "41. وَلَمَنِ انتَصَرَ بَعْدَ ظُلْمِهِۦ (Dan sesungguhnya orang-orang yang membela diri sesudah teraniaya) Yakni orang yang membalas terhadap orang yang telah menzaliminya. فَأُو۟لٰٓئِكَ مَا عَلَيْهِم مِّن سَبِيلٍ (tidak ada satu dosapun terhadap mereka) Yakni tidak mendapat dosa atau siksa, sebab hak untuk membalas kejahatan yang dilakukan secara sengaja telah ditetapkan dalam syari’at, demikian pula hak ganti rugi pada kejahatan yang dilakukan tanpa sengaja. Dan dalam ejekan dan olokan diperbolehkan untuk membalasnya dengan balasan yang sesuai."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "41. Orang yang membalas kezaliman dengan tindakan serupa yang dilakukan oleh orang yang menzaliminya, maka tidak ada jalan atau alasan untuk mencaci dan menghukumnya. Ayat ini dan ayat setelahnya diturunkan untuk Abu Bakar As-Siddiq RA. Dia dicaci oleh sebagian orang Anshar, kemudian dia menanggapinya dengan hal yang serupa, lalu dia menahan diri."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh siapa saja yang membela diri setelah dizalimi} setelah dizalimi oleh orang zalim {maka tidak ada bagi mereka suatu jalan} hukuman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "41. “dan sesungguhnya orang-orang yang membela diri, ” dari”sesudah teraniaya, ” maksudnya, membela diri dari orang yang menganiayanya setelah kezhaliman menimpanya, “tidak ada suatu dosa pun atas mereka, ”artinya, tidak ada dosa atas mereka dalam melakukan pembelaan itu. Firmannya, ”dan orang-orang yang apabila mereka diperlakukan dengan zhalim, ” dan firmanNYa ”dan sesungguhnya orang-orang yang membela diri sesudah teraniaya, ”menunjukkan bahwa perbuatan penganiayaan dan kezhaliman sudah ada dan telah terjadi. Adapun kalau masih hanya dalam bentuk keinginan untuk melakukan penganiayaan terhadap oang lain dan keinginan untuk melakukan penganiayan terhadap orang lain dan keinginan untuk betindak zhalim, namun belum dilakukan sedikitpun, maka yang seperti ini tidak boleh diberi balasan dengan yang serupa. Ia hanya diberi pelajaran yang bisa membuatnya jera dari perkataan atau perbuatan yang berasal darinya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syura ayat 41: (Dan sesungguhnya orang-orang yang membela diri sesudah teraniaya) sesudah ia menerima penganiayaan dari orang lain (tidak ada suatu dosa pun atas mereka) maksudnya, mereka tidak berdosa bila menuntut."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Hal ini menunjukkan bahwa membalas hanyalah ketika benar-benar terjadi kezaliman terhadap dirinya. Oleh karena itu, jika sekedar ada keinginan untuk menzalimi orang lain namun tidak terjadi, maka tidak dibalas semisalnya, tetapi cukup diberi ta’dib (pelajaran) yang dapat mencegahnya melakukan kezaliman."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syura Ayat 41",
    "description": "Tetapi orang-orang yang telah berusaha membela diri mereka setelah di zalimi, tidak ada alasan untuk menyalahkan dan mengecam mereka. 42. Sesungguhnya jalan untuk menyatakan kesalahan dan perbuatan dosa hanya ada pada orang-orang yang berbuat zalim kepada manusia dan melampaui batas di muka bumi tanpa mengindahkan kebenaran. Mereka itu mendapat siksa yang pedih atas perbuatan mereka di hari akhirat kelak."
  }
]