[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dosa hanya dipikul oleh orang-orang yang melakukan pelanggaran terhadap manusia secara zhalim dan permusuhan serta melebihi batas yang tidak Dia izinkan. Mereka membuat kerusakan di muka bumi tanpa hak, mereka akan mendapatkan azab yang menyakitkan dan pedih di hari kiamat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "42. Sesungguhnya balasan dan siksa itu hanya untuk orang-orang yang menzalimi manusia dan melakukan kemaksiatan di muka bumi. Bagi mereka siksa yang menyakitkan di Akhirat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "42. Sesungguhnya dosa dan siksaan itu bagi orang-orang yang menzalimi orang lain dan berbuat kerusakan di bumi dengan perkataan dan perbuatan batil. Mereka yang jauh dari kebenaran itu akan mendapatkan azab yang pedih."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "42. إِنَّمَا السَّبِيلُ عَلَى الَّذِينَ يَظْلِمُونَ النَّاسَ (Sesungguhnya dosa itu atas orang-orang yang berbuat zalim kepada manusia) Yakni atas orang yang melakukan kezaliman tanpa alasan. وَيَبْغُونَ فِى الْأَرْضِ بِغَيْرِ الْحَقِّ ۚ( dan melampaui batas di muka bumi tanpa hak) Yakni orang-orang yang berlaku sewenang-wenang terhadap diri dan harta orang lain tanpa alasan yang dibenarkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "42. Cacian dan hukuman itu bagi orang-orang yang menganiaya manusia, menyakiti manusia, berbuat kerusakan dibumi secara zalim tanpa bisa dibenarkan, takabur, dan sewenang-wenang menyakiti orang dan mengambil harta. Bagi mereka itu adalah azab yang pedih di akhirat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya alasan} hukuman {itu hanya ada pada orang-orang yang menzalimi manusia dan melampaui batas} melampaui batas {di bumi tanpa alasan yang benar. Mereka itu mendapat siksa yang sangat pedih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "42. “sesungguhnya jalan itu, ” artinya, sesungguhnya hujjah berupa hukuman syari itu ditunjukan “atas orang-orang yang berbuat zhalim kepada manusia dan melampaui batas di muka bumi tanpa hak, ” ini meliputi semua bentuk kezhaliman dan penganiaayan terhadap orang lain, terhadap darah (jiwa) mereka, harta atau kehormatan mereka. ”mereka itu mendapat azab yang pedih, ”artinya, yang menyakitkan jiwa dan badan sesuai dengan kezhaliman dan penganiayaannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syura ayat 42: (Sesungguhnya dosa itu atas orang-orang yang berbuat lalim kepada manusia dan melampaui batas) yaitu mereka mengerjakan hal-hal (di muka bumi tanpa hak) mereka mengerjakan perbuatan-perbuatan maksiat. (Mereka itu mendapat azab yang pedih) yaitu azab yang menyakitkan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Baik darah mereka, harta maupun kehormatan mereka. Yang menyakitkan hati dan badan sesuai kezaliman mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syura Ayat 42",
    "description": "Sesungguhnya jalan untuk menyatakan kesalahan dan perbuatan dosa hanya ada pada orang-orang yang berbuat zalim kepada manusia dan melampaui batas di muka bumi tanpa mengindahkan kebenaran. Mereka itu mendapat siksa yang pedih atas perbuatan mereka di hari akhirat kelak. 43. Akan tetapi, barang siapa bersabar terhadap kezaliman dengan tidak melakukan pembalasan atas kezaliman itu dan memaafkannya, sungguh yang demikian itu termasuk perbuatan yang mulia."
  }
]