[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Barangsiapa bersabar dalam menghadapi gangguan, membalas keburukan dengan maaf, perdamaian dan lapang dada, sesungguhnya hal itu termasuk perkara yang berat yang berhak diberi ucapan terima kasih dan perbuatan terpuji yang diperintahkan Allah dan Dia menyiapkan pahala besar dan pujian yang baik terhadapnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "43. Adapun orang yang bersabar atas gangguan orang lain terhadapnya dan dia memaafkannya, maka kesabarannya itu termasuk perbuatan yang mendatangkan kebaikan bagi dirinya dan masyarakat; itu adalah perbuatan yang terpuji, dan tidaklah seseorang mendapat sifat itu kecuali orang yang sangat beruntung."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "43. Dan barangsiapa yang bersabar setelah mendapat gangguan dan menutupi kesalahan itu; maka itu merupakan perkara agung yang terpuji yang Allah tegaskan untuk dilakukan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "43. وَلَمَن صَبَرَ (Tetapi orang yang bersabar) Atas kezaliman. وَغَفَرَ(dan memaafkan) Memaafkan orang yang menzaliminya padahal dia mampu membela diri dan menuntut haknya. إِنَّ ذٰلِكَ(sesungguhnya (perbuatan) yang demikian itu) Yakni kesabaran dan pemberian maaf itu. لَمِنْ عَزْمِ الْأُمُورِ(termasuk hal-hal yang diutamakan) Yakni merupakan keteguhan hati dan kekuatan sehingga dia tidak terdorong untuk melampiaskan hawa nafsu untuk membalas."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "43. Orang yang sabar atas penderitaan dan mengampuni dosa orang yang menyakiti serta memaafkan orang yang menzaliminya, maka kesabaran dan ampunan itu adalah perkara yang wajib dilakukan, maknanya adalah kewajiban secara hukum yang harus diputuskan dan dipegang teguh"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh siapa yang bersabar dan memaafkan, sesungguhnya yang demikian itu termasuk urusan yang diutamakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "43. “tetapi orang yang bersabar” dalam menghadapi yang dia rasakan dari gangguan orang lain, ”dan memaafkan”mereka dengan memaafkan perbuatan yang mereka lakukan tehadapnya, ”sesungguhnya yang demikian itu temasuk hal-hal yang diutamakan, ” artinya, termasuk perkara-perkaa yang dianjukan dan ditekankan oleh Allah dan Allah mengabarkan bahwa ia tidak akan dilakukan kecuali oleh orang-oang yang penyabar yang memperoleh keutamaan yang sangat besar, dan ia termasuk perkara yang tidak bisa dilakukan kecuali oleh orang-orang yang memilki tekad dan kemauan keras dan orang-orang yang memiliki pikiran dan nurani. Sebab, sesungguhnya tidak melakukan pembelaan diri dengan ucapan atau perbuatan adalah merupakan sesuatu yang sangat berat bagi jiwa, dan sabar atas gangguan, memaafkan, mengampuni dan membalasnya dengan kebaikan adalah lebih berat dan lebih berat lagi. Namun, itu semua ringan bagi orang yang diringankan oleh Allah dan berjihad melawan nafsunya untuk bisa bersikap demikian serta memohon pertolongan kepada Allah untuk itu. Kemudian apabila seorang hamba merasakan manisnya sabar dan menemukan pengaruh-pengaruhnya, maka ia akan menghadapi semua itu dengan lapang dada, akhlak mulia, dan menikmatinya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syura ayat 43: (Tetapi orang yang bersabar) dan ia tidak membela dirinya atau tidak menuntut balas (dan memaafkan) memaafkan kelaliman orang lain terhadap dirinya (sesungguhnya yang demikian itu) yaitu sabar dan pemaaf (termasuk hal-hal yang diutamakan) yang dianjurkan oleh syariat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Terhadap gangguan yang menimpanya dari orang lain. Yakni termasuk perkara yang didorong dan ditekankan Allah Subhaanahu wa Ta'aala, dimana Dia memberitahukan, bahwa hal itu tidaklah dimiliki kecuali oleh orang-orang yang sabar serta memiliki bagian yang besar, dimiliki oleh orang-orang yang berazam kuat, berpikiran cerdas dan berpandangan dalam. Hal itu, karena tidak membela diri baik dengan ucapan maupun perbuatan termasuk sesuatu yang paling sulit. Demikian pula bersabar terhadap gangguan, memaafkan dan mengampuninya serta menyikapinya dengan ihsan merupakan sesuatu yang paling sulit, akan tetapi hal itu mudah bagi orang yang dimudahkan Allah, ia berusaha menyifati diri dengannya serta meminta pertolongan kepada Allah terhadapnya. Selanjutnya, apabila seorang hamba merasakan manisnya kesabaran dan mendapatkan atsar(hasil)nya, maka dia menerimanya dengan dada yang lapang dan merasa senang di dalamnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syura Ayat 43",
    "description": "Akan tetapi, barang siapa bersabar terhadap kezaliman dengan tidak melakukan pembalasan atas kezaliman itu dan memaafkannya, sungguh yang demikian itu termasuk perbuatan yang mulia. 44. Dan barang siapa dibiarkan sesat oleh Allah akibat kecenderungan dan keinginan hatinya untuk sesat, maka tidak ada baginya pelindung yang dapat melindunginya dari kesesatan itu sesudahnya, sesudah Allah memperlakukannya dengan perlakuan itu. Kamu, wahai nabi Muhammad dan orang-orang beriman, akan melihat orang-orang zalim ketika mereka melihat azab yang akan di terimanya di akhirat kelak berkata, 'adakah kiranya jalan yang dapat mengantarkan kami untuk kembali ke alam dunia''."
  }
]