[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Barangsiapa yang disesatkan oleh Allah dari jalan yang lurus disebabkan karena zhalimnya, maka dia tidak memiliki penolong yang membimbingnya kejalan yang lurus. kamu melihat (wahai rasul) orang-orang yang kafir kepada Allah di hari kiamat (saat mereka meliaht azab) mereka berkata kepada tuhan mereka ”adakah jalan bagi kami untuk kembali ke dunia agar kami bisa menaatimu?” lalu mereka tiidak dihiraukan atas ucapan itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "44. Barangsiapa dibelokkan Allah dari hidayah dan disesatkan dari kebenaran, maka ia tidak mempunyai pelindung setelah-Nya yang mampu memberikan perlindungan atas urusannya. Dan engkau lihat orang-orang yang menganiaya diri mereka sendiri dengan melakukan kekufuran dan maksiat, saat mereka menyaksikan siksa pada hari Kiamat secara langsung, mereka berkata sambil berangan-angan, “Adakah jalan kembali ke dunia sehingga kami bertobat kepada Allah.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "44. Barangsiapa yang Allah sesatkan dari petunjuk maka tidak ada penolong yang dapat memberinya petunjuk. Dan pada hari kiamat kamu akan melihat orang-orang yang menzalimi diri sendiri dengan melakukan kekafiran berkata kepada Tuhan mereka ketika mereka menyaksikan azab: “Apakah ada jalan untuk kembali ke dunia agar kami dapat melakukan amal shalih?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "44. وَمَن يُضْلِلِ اللهُ فَمَا لَهُۥ مِن وَلِىٍّ مِّنۢ بَعْدِهِۦ ۗ (Dan siapa yang disesatkan Allah maka tidak ada baginya seorang pemimpinpun sesudah itu) Maka tidak ada seorangpun yang dapat memberinya petunjuk atau mampu menolongnya. وَتَرَى الظّٰلِمِينَ(Dan kamu akan melihat orang-orang yang zalim) Yakni orang-orang musyrik dan mendustakan hari kebangkitan. لَمَّا رَأَوُا۟ الْعَذَابَ(ketika mereka melihat azab) Ketika mereka melihat neraka. يَقُولُونَ هَلْ إِلَىٰ مَرَدٍّ مِّن سَبِيلٍ(berkata: “Adakah kiranya jalan untuk kembali?”) Yakni apakah ada jalan untuk kembali ke dunia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "44. Dan orang yang tidak dibimbing Allah menuju keimanan karena dia bersikeras atas kekufuran, maka tidak ada satupun penolong yang mengarahkannya pada petunjukNya. Kamu akan melihat orang-orang zalim (orang-orang kafir) yang mendustakan hari kebangkitan. Saat mereka melihat neraka dan azab yang ada di dalamnya, mereka akan berkata: “Andaikan ada jalan untuk kembali ke dunia, sungguh kami akan bertaubat dan mengerjakan amal shalih” {Min Waliyyin} menunjukkan makna umum pada kalimat setelahnya. {Hal} adalah huruf istifham yang bermakna tamanni, dalam ayat ini seperti (laita)"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Siapa saja yang dibiarkan sesat oleh Allah} diabaikan oleh Allah {maka tidak ada baginya pelindung setelah itu. Kamu akan melihat orang-orang zalim, ketika mereka melihat azab, mereka berkata,“Apakah jalan untuk kembali} apakah ada jalan kembali ke dunia"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "44. Allah mengabarkan bahwa Dialah sendirian yang memberikan hidayah dan menyesatkan, dan “siapa yang disesatkan Allah, ”disebabkan kezhalimannya, ”maka tidak ada baginya seorang pemimpin pun setelah itu, ”yang bisa mengurusi permasalahannya dan memberinya hidayah. “dan kamu akan melihat orang-orang yang zhalim ketika mereka melihat azab” dengan penglihatan yang sangat mengerikan, sulit dan sangat keji, dimana mereka menampakkan penyesalan yang sangat besar dan rasa sedih atas apa yang telah meeka lakukan dahulu dan “berkata ‘adakah kiranya untuk kembali’, ” atinya, adakah jalan bagi kami atau upaya untuk bisa kembali ke dunia agar kami bisa melakukan selain dai apa yang telah kami lakukan dahulu?ini adalah pemintaan sesuatu yang mustahil yang tidak mungkin."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syura ayat 44: (Dan siapa yang disesatkan Allah maka tidak ada baginya seorang pemimpin pun sesudah itu) artinya tiada seorang pun yang dapat memberikan petunjuk kepadanya sesudah ia disesatkan oleh Allah (Dan kamu akan melihat orang-orang yang lalim ketika mereka melihat azab berkata, \"Adakah kiranya jalan untuk kembali) ke dunia bagi kami.\""
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan bahwa Dia yang sendiri memberi hidayah dan menyesatkan. Disebabkan kezalimannya. Yang memberikan hidayah kepadanya. Menampakkan penyesalan dan kesedihan yang mendalam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syura Ayat 44",
    "description": "Dan barang siapa dibiarkan sesat oleh Allah akibat kecenderungan dan keinginan hatinya untuk sesat, maka tidak ada baginya pelindung yang dapat melindunginya dari kesesatan itu sesudahnya, sesudah Allah memperlakukannya dengan perlakuan itu. Kamu, wahai nabi Muhammad dan orang-orang beriman, akan melihat orang-orang zalim ketika mereka melihat azab yang akan di terimanya di akhirat kelak berkata, 'adakah kiranya jalan yang dapat mengantarkan kami untuk kembali ke alam dunia''45. Dan kamu dan siapa pun yang hadir di tempat itu akan melihat mereka, orang-orang yang zalim, sedang di hadapkan ke neraka sebagai tempat penyiksaan yang abadi bagi mereka dalam keadaan tertunduk karena merasa hina, mereka melihat dengan pandangan yang lesu karena merasa sebentar lagi akan menerima siksaan api neraka. Dan orang-orang yang beriman berkata, 'sesungguhnya orang-orang yang rugi karena tidak beriman dan beramal saleh sewaktu di dunia ialah orang-orang yang merugikan diri mereka sendiri dan keluarganya pada hari kiamat. ' ingatlah, sesungguhnya orang-orang zalim itu berada dalam azab yang kekal di dalam neraka."
  }
]