[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kamu akan melihat (wahai rasul) orang-orang zhalim itu akan digiring menuju api neraka dalam keadaan hina dan rendah, mereka melihat api neraka dengan pandangan tertunduk penuh kelemaha karena ketakutan yang hebat dan kehinaan. Dan orang-orang yang beriman kepada Allah dan rasulNYa berkata di dalam surga ketika mereka melihat kerugian yang menimpa orang-orang kafir, ”sesungguhnya orang-orang yang benar-benar merugi adalah orang-orang yang merugikan diri dan keluarganya di hari kiamat dengan masuk kedalam neraka.” ketahuilah bahwa orang-orang zhalim di hari kiamat berada dalam azab yang abdi, tidak terputus dan tidak berhenti."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "45. Dan engkau lihat -wahai Rasul- orang-orang yang berbuat aniaya ketika dihadapkan ke Neraka dalam keadaan rendah dan hina, mereka melihat kepada manusia dengan diam-diam karena besarnya rasa takut mereka terhadap Neraka. Dan orang-orang yang beriman kepada Allah dan kepada rasul-rasul-Nya berkata, “Sesungguhnya orang yang benar-benar merugi adalah orang-orang yang kehilangan diri mereka dan kehilangan keluarga mereka pada hari Kiamat disebabkan siksa Allah yang mereka dapatkan.” Ketahuilah bahwa orang-orang yang menganiaya diri mereka sendiri dengan melakukan kekufuran dan kemaksiatan-kemaksiatan mereka berada dalam siksa abadi yang tidak akan terputus selamanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "45-46. Hai Rasulullah, dan kamu melihat orang-orang zalim dihadapkan ke neraka Jahannam dengan tertunduk hina sambil mencuri-curi pandangan karena sangat ketakutan. Dan orang-orang beriman berkata: “Orang-orang merugi yang sesungguhnya adalah mereka yang merugi pada diri sendiri dan keluarga mereka di hari kiamat.” Hai para hamba, ketahuilah kesudahan buruk orang-orang zalim berada dalam azab yang kekal, dan mereka tidak memiliki pembantu yang akan menolong mereka dari azab. Dan barangsiapa yang Allah sesatkan maka dia tidak akan memiliki jalan untuk keluar dari kesesatan untuk menuju hidayah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "45. وَتَرَىٰهُمْ يُعْرَضُونَ عَلَيْهَا خٰشِعِينَ مِنَ الذُّلِّ (Dan kamu akan melihat mereka dihadapkan ke neraka dalam keadaan tunduk karena (merasa) hina) Yakni mereka terdiam dan tertunduk karena kehinaan yang mereka rasakan ketika itu. يَنظُرُونَ مِن طَرْفٍ خَفِىٍّ ۗ( mereka melihat dengan pandangan yang lesu) Yakni mereka mencuri-curi penglihatan karena ketakutan mereka yang begitu besar. وَقَالَ الَّذِينَ ءَامَنُوٓا۟ إِنَّ الْخٰسِرِينَ الَّذِينَ خَسِرُوٓا۟ أَنفُسَهُمْ وَأَهْلِيهِمْ يَوْمَ الْقِيٰمَةِ ۗ( Dan orang-orang yang beriman berkata: “Sesungguhnya orang-orang yang merugi ialah orang-orang yang kehilangan diri mereka sendiri dan (kehilangan) keluarga mereka pada hari kiamat) Yakni orang-orang yang benar-benar merugi adalah mereka. Adapun kerugian mereka terhadap diri mereka sendiri adalah karena mereka akan masuk neraka dan menyerahkan diri untuk diazab tanpa ada harapan untuk selamat, sedangkan kerugian mereka terhadap keluarga mereka karena jika keluarga mereka bersama mereka di neraka namun tidak dapat bermanfaat bati mereka, dan jika keluarga mereka di surga maka telah terpisah dengan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "45. Wahai rasul, kamu juga akan melihat orang-orang zalim tertunduk ketakutan saat ditunjukkan neraka karena mereka akan mendapati kerendahan dan kehinaan. Mereka melihat neraka menggunakan iris (selaput pelangi mata) mereka, seraya menyembunyikan sebagian besar bagian matanya karena ketakutan yang amat sangat besar. Orang-orang mukmin berkata: “Sesungguhnya orang-orang yang benar-benar rugi adalah mereka yang mencelakakan diri dan keluarga mereka dengan menyuguhkannya kepada azab abadi di neraka pada hari kiamat. Ingatlah sesungguhnya orang-orang zalim itu berada dalam azab pedih yang menyakitkan”. {Alaa} untuk memberi peringatan pendengar agar berangan-angan tentang sesuatu setelahnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kamu akan melihat mereka dihadapkan kepadanya} kepada neraka {dalam keadaan tertunduk} tunduk {karena hina. Mereka memperhatikan dengan pandangan yang lesu} mereka memandang neraka dengan pandangan yang lesu tanpa berpaling darinya karena kengerian ketika memandangnya {Orang-orang yang beriman berkata,“Sesungguhnya orang-orang yang rugi adalah orang-orang yang merugikan diri sendiri dan keluarganya pada hari kiamat” Ketahuilah, sesungguhnya orang-orang zalim itu berada dalam azab yang kekal} abadi tanpa terputus"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "45. “dan kamu akan melihat meeka dihidupkan kepadanya,” maksudnya, kepada neraka “dalam keadaan tunduk karena terhina,” yakni, kamu lihat badan meReka tunduk karena kehinaan yang ada dalam hati mereka, ”mereka melihat dengan pandangan yang lesu,” maksudnya, melihat ke neraka dengan lirikan dan sudut mata karena sangat ketakutan. “dan orang-orang yang beriman berkata,” saat tampak semua akhir kesudahan manusia dan sudah terpisah dengan jelas orang-orang yang jujur dari yang lainnya,”sesungguhnya orang-orang yang merugi” yang sebenarnya ”ialah orang-orang yang kehilangan diri mereka sendiri dan keluarga mereka pada hari Kiamat,”dimana mereka telah merugikan diri mereka sendiri akan pahala yang sangat menyakitkan,dan mereka dipisahkan dari keluarga mereka sehingga meeka tidak dapat berkumpul bersama sepanjang hukuman yang mereka alami. “ingatlah, sesungguhnya orang-orang yang zhalim,” terhadap mereka dengan melakukan kekufuran dan berbagai maksiat, ”berada dalam azab yang kekal,” didasarnya dan di tengah-tengahnya, tenggelam di dalamnya, tidak akan dikeluarkan darinya selama-lamanya, dan tidak pula dikurangi sedikitpun dari mereka, sedangkan mereka berputus asa di dalamnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syura ayat 45: (Dan kamu akan melihat mereka dihadapkan kepadanya) yakni ke neraka (dalam keadaan tunduk) takut dan merasa rendah diri (karena merasa hina, mereka melihat) ke neraka (dengan pandangan yang lesu) atau dengan pandangan yang malas. Huruf Min di sini bermakna Ibtidaiyah atau bermakna sama dengan huruf Ba. (Dan orang-orang yang beriman berkata, \"Sesungguhnya orang-orang yang merugi ialah orang-orang yang kehilangan diri mereka sendiri dan kehilangan keluarga mereka pada hari kiamat\") karena mereka kekal menjadi penghuni neraka dan tidak memperoleh bidadari-bidadari yang telah disediakan buat mereka seandainya mereka beriman. Isim Maushul atau lafal Al Ladziina Khasiruu Anfusahum merupakan Khabar dari lafal Inna. (Ingatlah, sesungguhnya orang-orang yang zalim itu) yakni orang-orang yang kafir itu (berada dalam azab yang kekal) azab yang abadi; ini adalah firman Allah swt."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ketika telah tampak keadaan akhir manusia, dan tampak jelas orang yang benar dan orang yang salah. Yang dimaksud dengan merugikan diri dan keluarganya ialah mengekalkan mereka di neraka, mendapatkan azab yang pedih di sana dan dipisahkan dengan keluarganya, ia juga tidak memperoleh kenikmatan surga, demikian pula bidadari yang disiapkan di sana jika mereka beriman. Yakni orang-orang kafir. Ya Allah, masukkanlah kami ke dalam surga dan jauhkanlah kami dari neraka. Ya Allah, masukkanlah kami ke dalam surga dan jauhkanlah kami dari neraka. Ya Allah, masukkanlah kami ke dalam surga dan jauhkanlah kami dari neraka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syura Ayat 45",
    "description": "Dan kamu dan siapa pun yang hadir di tempat itu akan melihat mereka, orang-orang yang zalim, sedang di hadapkan ke neraka sebagai tempat penyiksaan yang abadi bagi mereka dalam keadaan tertunduk karena merasa hina, mereka melihat dengan pandangan yang lesu karena merasa sebentar lagi akan menerima siksaan api neraka. Dan orang-orang yang beriman berkata, 'sesungguhnya orang-orang yang rugi karena tidak beriman dan beramal saleh sewaktu di dunia ialah orang-orang yang merugikan diri mereka sendiri dan keluarganya pada hari kiamat. ' ingatlah, sesungguhnya orang-orang zalim itu berada dalam azab yang kekal di dalam neraka. -."
  }
]