[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang kafir itu saat Allah menyiksa mereka di hari kiamat, tidak memiliki pembantu dan penolong yang dapat menolong mereka dari azab Allah. Barangsiapa disesatkan oleh Allah karena kekafiran dan kezhalimannya, maka dia tidak memiliki jalan yang dengannya dia bisa meraih kebenaran di dunia dan meraih surga di akhirat, karena jalan-jalan keselamatan telah tertutup di depannya. Memberikan petunjuk (hidayah) dan menyesatkan hanya di tangan Allah semata, tidak sealinNYa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "46. Dan tidaklah mereka mempunyai pelindung yang mampu menolong dengan menyelamatkan mereka dari siksa Allah pada hari Kiamat. Barangsiapa disimpangkan oleh Allah dari kebenaran lalu disesatkan-Nya, maka selamanya tidak ada baginya jalan yang menuntunnya kepada petunjuk menuju kebenaran."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "46. وَمَا كَانَ لَهُم مِّنْ أَوْلِيَآءَ يَنصُرُونَهُم مِّن دُونِ اللهِ (Dan mereka sekali-kali tidak mempunyai pelindung-pelindung yang dapat menolong mereka selain Allah) Yakni tidak ada seorangpun yang dapat menolong mereka dari azab pada saat itu kecuali Allah. وَمَن يُضْلِلِ اللهُ فَمَا لَهُۥ مِن سَبِيلٍ (Dan siapa yang disesatkan Allah maka tidaklah ada baginya satu jalanpun (untuk mendapat petunjuk)) Yakni jalan yang dapat ia tempuh untuk menuju keselamatan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "46. Tidaklah bagi orang-orang kafir itu penolong yang menolong mereka dari azab. Dan orang yang disesatkan Allah dengan dibiarkan dan dan tidak diarahkan menuju hidayah, maka dia tidak memiliki jalan untuk selamat dari azab."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka tidak akan mempunyai pelindung yang dapat menolong mereka selain Allah. Siapa saja yang dibiarka sesat oleh Allah, maka tidak akan ada jalan baginya} maka tidak ada jalan baginya untuk sampai kepada kebenaran ketika di dunia, dan sampai ke surga ketika di akhirat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "46. “dan mereka sekali-kali tidak mempunyai pelindung-pelindung yang dapat menolong mereka selain Allah,” sebagaimana dahulu mereka di dunia yang memanjakan diri mereka dengan hal itu. Maka pada hari kiamat tampaklah bagi mereka dan bagi yang lain bahwa semua bentuk hubungan mereka yang mereka dambakan itu sudah terputus, dan bahwa sesungguhnya di kala azab Allah menimpa mereka maka sama sekali tidak bisa ditolak. ”dan siapa yang disesatkan Allah, maka tidaklah ada baginya sesuatu jalanpun,” yang dengannya hidayah bisa diperoleh. Jadi, mereka telah sesat saat mereka mengklaim manfaat dan bisa menolak bahaya pada para sesembahan-sesembahan mereka. Maka pada saat itu terbuktilah kesesatan mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syura ayat 46: (Dan mereka sekali-kali tidak mempunyai pelindung-pelindung yang dapat menolong mereka selain Allah) yang dapat menolak azab-Nya dari diri mereka (Dan siapa yang disesatkan Allah maka tidaklah ada baginya sesuatu jalan pun) yaitu jalan yang benar baginya di dunia dan jalan yang dapat mengantarkannya ke surga, di akhirat kelak."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni yang menghindarkan azab-Nya. Ia tidak memperoleh petunjuk ketika di dunia dan tidak mengetahui jalan ke surga di akhirat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syura Ayat 46",
    "description": "-47. Agar kalian mendapat pertolongan dari Allah dan mendapat perlindungan dari-Nya, maka patuhilah seruan tuhanmu dengan mengamalkan apa yang di perintahkan dan meninggalkan apa yang di larang sebelum datang dari Allah suatu hari, yaitu hari akhirat, yang tidak dapat di tolak kehadirannya oleh siapa pun karena ia datang atas perintah dari Allah. Pada hari itu kamu tidak memperoleh tempat berlindung kecuali iman dan amal saleh yang telah kamu lakukan dan tidak pula dapat mengingkari dosa-dosamu yang pernah kamu perbuat di dunia."
  }
]