[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Penuhilah seruan tuhan kalian (wahai orang-orang kafir) dengan beriman dan menaati-Nya sebelum hari kiamat tiba yang tidak mungkin ditolak. Saat itu kalian tidak memiliki tempat berlindung yang bisa menyelamatkan kalian dari siksa Allah, tidak ada tempat yang menghalangi kalian yang bisa kalian jadikan sebagai persembunyian. Ayat ini mengandung dalil dicelanya menunda-nunda dan didalamnya juga terkandung perintah untuk bersegera dalam melakukan segala bentuk amal shalih yang ada di depan hamba, karena penundaan memiliki akibat buruk yang tidak diharapkan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "47. Patuhilah -wahai manusia- seruan Rabb kalian dengan bersegera kepada ketaatan terhadap perintah-perintah-Nya dan meninggalkan larangan-larangan-Nya serta tidak menunda-nunda, sebelum datangnya hari Kiamat yang apabila telah datang tidak ada yang bisa menolaknya. Kalian tidak mempunyai tempat yang bisa kalian gunakan untuk berlindung dan kalian tidak punya pengingkaran yang bisa kalian gunakan untuk mengingkari dosa-dosa kalian yang telah kalian lakukan di dunia."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "47-48. Hai para hamba, sambutlah seruan Tuhan kalian untuk menyembah-Nya sebelum kedatangan hari kiamat yang tidak mungkin seorangpun dapat membatalkan kejadiannya. Kalian tidak akan memiliki tempat berlindung dan penolong pada hari itu. Kalian tidak akan dapat mengingkari apa yang telah kalian kerjakan. Jika mereka berpaling dari seruan menuju keimanan dan lebih memilih kekafiran, maka Kami tidak mengutusmu -hai Rasulullah- untuk mencatat amalan mereka agar kamu dapat menghisab mereka atas perbuatan itu; namun kewajibanmu hanya menyampaikan dakwah. Jika Kami -dengan keagungan dan kekuasaan Kami yang sempurna- memuliakan manusia dengan rahmat, maka dia akan merasa senang; namun jika mereka tertimpa musibah akibat kemaksiatan yang mereka lakukan, maka manusia akan mengingkari kenikmatan-kenikmatan Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "47. اسْتَجِيبُوا۟ لِرَبِّكُم (Patuhilah seruan Tuhanmu) Yakni terimalah seruan-Nya untuk beriman kepada-Nya, dan kepada kitab-kitab dan rasul-rasul-Nya yang diserukan kepada kalian. مِّن قَبْلِ أَن يَأْتِىَ يَوْمٌ لَّا مَرَدَّ لَهُۥ مِنَ اللهِ ۚ (sebelum datang dari Allah suatu hari yang tidak dapat ditolak kedatangannya) Yakni sebelum datang hari kedatangan azab dari Allah yang tidak dapat dihindari oleh siapapun. مَا لَكُم مِّن مَّلْجَإٍ يَوْمَئِذٍ(Kamu tidak memperoleh tempat berlindung pada hari itu) Sehingga kalian dapat berlindung di sana. وَمَا لَكُم مِّن نَّكِيرٍ (dan tidak (pula) dapat mengingkari (dosa-dosamu)) Yakni pada hari itu kalian tidak memperoleh orang yang dapat menolak azab yang akan menimpa mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "47. Terimalah ajakan Tuhan kalian dengan cepat dan ikhlas dengan beriman kepada Allah, kitabNya, dan rasul-rasulNya, beribadah kepadaNya dan menaatiNya sebelum datangnya hari itu, yaitu hari kiamat, yang mana Allah tidak akan mengembalikannya setelah menentukan hukum dan ketetapan tentangnya. Wahai manusia, kalian tidak memiliki benteng yang dapat kalian gunakan untuk berlindung dari azab pada saat itu. Kalian juga tidak akan dapat menyangkaal turunnya azab akibat dosa kalian setelah anggota tubuh, buku catatan amal, dan malaikat itu memberi kesaksian."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Penuhilah seruan Tuhan kalian sebelum datang dari suatu hari yang tidak dapat ditolak} yang tidak ada satu pun orang yang bisa mencegahnya {dari Allah. Kalian tidak akan mempunyai tempat berlindung} tempat yang kalian gunakan untuk berlindung {pada hari itu dan tidak pula dapat mengingkari} mengingkari apa yang sudah kalian buat-buat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "47. Allah memerintahkan hamba-hambaNYa untuk memenuhi seruanNya dan menjauhi apa-apa yang dilarangNya, dan segera melakukan hal tersebut serta tidak menunda-nunda waktu, ”sebelum datang,” hari kiamat yang apabila telah datang tidak mungkin bisa ditolak dan tidak mungkin lagi mengejar ketertinggalan. Dan pada hari itu seorang hamba tidak memiliki tempat yang bisa digunakan untuk berlindung agar bisa terhindar dari Allah dan lari dariNya. Malah para malaikat telah mengelilingi semua manusia dari belakang dan mereka diseru, ”hai sekalian jin dan manusia, jika kamu sanggup menembus (melintasi) penjuru langit dan bumi, maka lintasilah, kamu tidak dapat menembusnya kecuali dengan kekuatan,” (ar-rahman:33) Dan pada saat itu manusia tidak bisa mengingkari apa-apa yang telah diperbuatnya dan tindakan-tindakan kejahatan yang telah dilakukannya. Bahkan, kalaupun ia mengingkari, niscaya seluruh anggota tubuhnya memberikan kesaksian melawannya. Ayat ini dan yang semisal dengannya mengandung celaan terhadap angan-angan dan mengandung perintah untuk menggunakan kesempatan (momen) untuk melakukan amal (perbuatan baik) yang bisa dilakukan saat itu, sebab menunda-nunda waktu itu mendatangkan mudarat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syura ayat 47: (Patuhilah seruan Rabb kalian) perkenankanlah seruan-Nya, yaitu dengan mentauhidkan-Nya dan menyembah-Nya (sebelum datang suatu hari) yakni hari kiamat (dari Allah yang tidak dapat ditolak kedatangannya) apabila hari itu datang tidak dapat ditolak. (Kalian tidak memperoleh tempat berlindung) yang kalian dapat berlindung di dalamnya (pada hari itu dan tidak pula dapat mengingkari) dosa-dosa kalian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memerintahkan hamba-hamba-Nya untuk memenuhi seruan-Nya dengan mengikuti perintah-Nya dan menjauhi larangan-Nya, bersegera melakukannya dan tidak menundanya sebelum datang hari Kiamat yang jika sudah datang, maka tidak mungkin ditolak dan tidak dapat dikejar yang telah luput, dan seorang hamba pada hari itu tidak memiliki tempat berlindung untuk meloloskan diri dari Tuhannya, bahkan para malaikat telah mengepung mereka semua dari belakang dan ketika itu mereka dipanggil, “Wahai jamaah jin dan manusia, jika kamu sanggup menembus (melintasi) penjuru langit dan bumi, maka lintasilah, kamu tidak dapat menembusnya kecuali dengan kekuatan.” (Terj. Ar Rahman: 33) Pada hari itu, manusia juga tidak mengingkari perbuatan yang dikerjakannya, bahkan kalau seandainya mereka mengingkari, maka anggota badannya akan menjadi saksi. Dalam ayat ini terdapat celaan terhadap panjang angan-angan dan perintah memanfaatkan kesempatan untuk beramal saat ada amal saleh di hadapannya, serta tidak menundanya, karena menundanya terdapat malapetaka. Dengan tauhid dan ibadah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syura Ayat 47",
    "description": "Agar kalian mendapat pertolongan dari Allah dan mendapat perlindungan dari-Nya, maka patuhilah seruan tuhanmu dengan mengamalkan apa yang di perintahkan dan meninggalkan apa yang di larang sebelum datang dari Allah suatu hari, yaitu hari akhirat, yang tidak dapat di tolak kehadirannya oleh siapa pun karena ia datang atas perintah dari Allah. Pada hari itu kamu tidak memperoleh tempat berlindung kecuali iman dan amal saleh yang telah kamu lakukan dan tidak pula dapat mengingkari dosa-dosamu yang pernah kamu perbuat di dunia. 48. Jika mereka berpaling, yaitu tidak mau menerima seruanmu untuk beriman, maka ingatlah, wahai nabi Muhammad, kami tidak mengutus engkau sebagai pengawas bagi mereka dengan memaksa mereka untuk beriman dan tidak pula mengharuskan mereka menerima seruanmu sehingga mereka beriman. Kewajibanmu tidak lain hanyalah menyampaikan risalah dan seruan tuhanmu kepada mereka. Dan sungguh, apabila kami merasakan kepada manusia suatu rahmat, yaitu hal-hal yang menyenangkan dari kami, dia menyambutnya dengan gembira; tetapi jika sebaliknya mereka ditimpa kesusahan disebabkan perbuatan tangan mereka sendiri, niscaya mereka ingkar. Sungguh, manusia itu salah satu sifatnya adalah sangat ingkar kepada nikmat."
  }
]