[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "49-50 Hanya milik Allah semata kerajaan langit dan bumi dan apa yang ada pada keduanya. Dia menciptakan apa yang Dia kehendaki, memberikan kepada siapa yang Dia kehenadki dari hamba-hambaNya anak perempuan tanpa laki-laki bersamanya, dan Dia memberikan kepada siapa yang Dia kehendaki dari hamba-hamabNya anak laki-laki tanpa perempuan bersamanya, dan Allah memberikan anak laki-laki dan perempuan kepada siapa yang Dia kehendaki dari hamba-hambaNYa, serta Dia menjadikan siapa yang Dia kehendaki mandul tidak beranak. Sesungguhnya Allah maha mengetahui apa yang Dia ciptakan, maha kuasa untuk membuat apa yang Dia kehendaki, tidak ada sesuatu yang melemahkannya saat Dia hendak menciptakanNYa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "49-50. Milik Allah lah kerajaan langit dan kerajaan bumi. Dia menciptakan apa yang Dia kehendaki dari jenis laki-laki, perempuan atau yang lainnya. Dia memberikan anak perempuan kepada yang Dia kehendaki dan menghalanginya dari anak laki-laki, serta memberikan anak laki-laki kepada yang Dia kehendaki dan menghalanginya dari anak perempuan, atau memberikan kepada yang Dia kehendaki anak laki-laki dan perempuan bersamaan serta menjadikan orang yang Dia kehendaki mandul tidak mempunyai anak. Sesungguhnya Dia Maha Mengetahui apa yang terjadi dan apa yang akan terjadi pada masa yang akan datang, dan ini bagian dari kesempurnaan ilmu-Nya dan kesempurnaan hikmah-Nya. Tidak ada sesuatupun yang tersembunyi dari-Nya, dan tidak ada sesuatupun yang melemahkan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "49-50. Allah adalah pemilik kerajaan tujuh langit dan bumi, serta segala isinya, Dia menciptakan makhluk yang dikehendaki, kemudian memberi rezeki berupa anak perempuan kepada yang Dia kehendaki, dan memberi rezeki berupa anak laki-laki kepada yang Dia kehendaki, atau memberi rezeki berupa anak laki-laki dan perempuan, dan Dia menjadikan siapa yang dikehendaki menjadi mandul tanpa anak. Dia Maha Mengetahui segala keadaan makhluk-Nya, Maha Kuasa untuk menciptakan apa yang Dia kehendaki dan memberi rezeki kepada siapa yang Dia kehendaki."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "49. يَهَبُ لِمَن يَشَآءُ إِنٰثًا وَيَهَبُ لِمَن يَشَآءُ الذُّكُورَ (Dia memberikan anak-anak perempuan kepada siapa yang Dia kehendaki dan memberikan anak-anak lelaki kepada siapa yang Dia kehendaki) Yakni Allah mengaruniakan anak-anak perempuan saja tanpa ada anak laki-laki kepada yang Dia kehendaki, dan mengaruniakan anak-anak laki-laki saja tanda ada anak perempuan kepada yang Dia kehendaki."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "49. Milik Allah itu kerajaan langit dan bumi. Dia mengatur segala yang ada di dalam keduanya dan menciptakan makhluk sesuai kehendakNya. Dia memberikan anak perempuan atau laki-laki bagi orang yang menginginkannya, sesuai kebijaksanaanNya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Milik Allahlah kerajaan langit dan bumi. Dia menciptakan apa yang Dia kehendaki, memberikan} memberikan {anak perempuan kepada siapa saja yang Dia kehendaki, dan memberikan anak laki-laki kepada siapa saja yang Dia kehendaki"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "49-50. Ayat ini mengandung pemberitaan tentang betapa luasnya kerajaan Allah dan terealisasinya tindakanNya dalam keerajaanNya dan mengatur semua uusan, hingga pengaturan yang dilakukanNya mencakup ciptaan tentang sebab-sebab yang dilakukan oleh manusia. sesungguhnya nikah (pesetubuhan) itu merupakan salah satu sebab dilahirkannya anak. Allahlah yang telah memberi mereka anak-anak menurut kehendakNya. Maka diantara manusia ada yang diberi anak perempuan dan ada pula yang diberi anak laki-laki, dan ada pula yang diberi berpasangan. Maksudnya, anak laki-laki dan perempuan. dan diantara mereka ada yang dijadikan mandul, tidak bisa mempunyai anak. “sesungguhnya Dia mahamengetahui,” segala sesuatu “lagi mahakuasa,” melakukan apa saja. Dia berbuat sesuai dengan pengetahuanNya dan keahlianNya terhadap segala sesuatu dan sesuai dengan kuasaNya pada makhluk-makhlukNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syura ayat 49: (Kepunyaan Allahlah kerajaan langit dan bumi. Dia menciptakan apa yang Dia kehendaki. Dia memberikan kepada siapa yang Dia kehendaki) yakni berupa anak-anak (yaitu anak-anak perempuan dan Dia memberikan anak-anak lelaki kepada siapa yang Dia kehendaki.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini di dalamnya terdapat berita tentang luasnya kerajaan Allah Subhaanahu wa Ta'aala, berlakunya tindakan-Nya pada kerajaan-Nya sesuai yang Dia kehendaki, Dia mengatur semua urusan, sampai-sampai pengaturan Allah Subhaanahu wa Ta'aala karena meratanya; mengena kepada makhluk terhadap sebab yang dikerjakan mereka. Nikah misalnya, ia termasuk sebab lahirnya anak, maka Allah Subhaanahu wa Ta'aala Dialah yang memberikan kepada mereka anak sesuai yang Dia kehendaki. Di antara makhluk-Nya ada yang Dia karuniakan anak perempuan, ada pula yang Dia karuniakan anak laki-laki, ada pula yang Dia berikan secara berpasangan dan bersamaan; anak laki-laki dan perempuan, dan di antara mereka ada pula yang Dia jadikan mandul."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syura Ayat 49",
    "description": "Hanya milik Allah-lah kewenangan untuk penciptaan dan pengaturan kerajaan langit dan bumi dengan kekuasaan-Nya. Dia menciptakan apa yang dia kehendaki sesuai dengan kehendak-Nya, walaupun yang di ciptakannya itu enggan menerimanya, memberikan anak-anak ber jenis kelamin perempuan saja, tanpa anak laki-laki kepada siapa yang dia kehendaki, dan memberikan anak-anak berjenis kelamin laki-laki saja, tanpa anak-anak perempuan kepada siapa yang dia kehendaki. Demikianlah kekuasaan Allah kepada makhluk-Nya, tidak dapat mereka menolaknya. 50. Atau, dia mengkombinasikan mereka, yakni menggabungkan anak-anak itu, ada anak-anak berjenis laki-laki dan ada pula yang berjenis perempuan kepada siapa yang dikehendaki-Nya, dan menjadikan mandul siapa yang dia kehendaki mandul. Dia maha mengetahui segala hal yang terkait dengan persoalan-persoalan di atas, dan mahakuasa atas segala sesuatu yang dikehendaki-Nya."
  }
]