[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Langit hampir terbelah setiap tingkatan langit berada di atas yang di bawahnya karena keagungan dan kemuliaan Allah yang maha penyayang. sedangkan para malaikat bertasbih dengan memuji tuhan mereka dan menyucikanNya dari apa yang tidak patut bagiNya, mereka memohon kepada tuhan mereka ampunan untuk penduduk bumi dari kalangan orang-orang yang beriman kepadaNya. Ketahuilah bahwa sesungguhnya Allah maha pengampun bagi dosa-dosa para hambaNya yang beriman juga maha penyayang kepada mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Di antara keagungan-Nya -Subḥānahu- hampir saja langit dengan kebesarannya dan ketinggiannya menjadi terbelah di atas bumi, dan para malaikat bertasbih memuji Rabbnya dengan tunduk dan mengagungkan-Nya serta memintakan ampunan kepada Allah bagi orang-orang yang ada di bumi. Ingatlah bahwa Allah Maha Pengampun atas dosa-dosa orang yang bertobat dari kalangan hamba-hamba-Nya, dan Maha Penyayang terhadap mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. تَكَادُ السَّمٰوٰتُ يَتَفَطَّرْنَ مِن فَوْقِهِنَّ ۚ (Hampir saja langit itu pecah dari sebelah atas (karena kebesaran Tuhan)) Yakni langit hampir terbelah karena keagungan Allah yang ada di atasnya. Dan bisa jadi juga diakibatkan oleh jumlah para malaikat di langit yang sangat banyak, dalam hadits disebutkan: “tidak ada tempat di langit yang seluas telapak kaki melainkan terdapat malaikat yang sedang ruku’ atau sujud.” (diriwayatkan oleh Imam Ahmad dan Tirmidzi). Pendapat lain mengatakan maknanya adalah: langit hampir terbelah oleh perkataan orang-orang musyrik bahwa Allah memiliki seorang anak. وَالْمَلٰٓئِكَةُ يُسَبِّحُونَ بِحَمْدِ رَبِّهِمْ(dan malaikat-malaikat bertasbih serta memuji Tuhan-nya) Yakni mereka menyucikan Allah dari segala yang tidak layak bagi-Nya seraya memuji-Nya. وَيَسْتَغْفِرُونَ لِمَن فِى الْأَرْضِ ۗ( dan memohonkan ampun bagi orang-orang yang ada di bumi) Yakni bagi hamba-hamba Allah yang beriman, dan karena harapan mereka terhadap keimanan orang kafir dan pertaubatan orang fasik. أَلَآ إِنَّ اللهَ هُوَ الْغَفُورُ الرَّحِيمُ(Ingatlah, bahwa sesungguhnya Allah Dialah Yang Maha Pengampun lagi Penyayang) Yakni Maha Pengampun dan Penyayang."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Langit hampir terbelah akibat buruknya kejahatan para orang musyrik atau karena keagungan dan kebesaran Allah yang berada di atasnya dengan derajat ketuhanan dan kekuasaanNya. Para malaikat mensucikanNya dari sesuatu yang tidak layak untukNya, serta memuji dan bersyukur kepadaNya. Mereka memintakan ampun untuk orang-orang mukmin di bumi. FirmanNya {Li man fil ardhi} adalah bentuk umum yang digunakan untuk menyebut sesuatu yang khusus. Ingatlah, sesungguhnya Allah adalah Dzat yang banyak ampunan dan rahmatNya bagi orang-orang mukmin yang memasrahkan diri mereka kepadaNya. Maksudnya adalah untuk menjelaskan perbedaan antara hamba-hamba yang ikhlas dan yang keji."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Hampir saja langit itu pecah} terbelah {dari sebelah atasnya} dari atas dua tanah {dan malaikat-malaikat bertasbih dengan memuji Tuhan mereka serta memohonkan ampunan untuk orang yang ada di bumi. Ingatlah, sesungguhnya Allahlah Dzat Yang Maha Pengampun lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-5. Allah menyampaikan bahwasanya Dia mewahyukan al-Quran agung ini kepada Nabi yang mulia sebagaimana Dia telah mewahyukan kepada para nabi dan rasul sebelum beliau. Dalam berita ini terdapat karuniaNya berupa penurunan kitab-kitab suci dan pengutusan para rasul di masa dahulu dan berikutnya, dan bahwa sesungguhnya Nabi Muahammad bukanlah rasul pertama, dan bahwa sesungguhnya jalan yang ia tempuh adalah jalan para rasul sebelum beliau, dan kondisi-kondisinya pun sama dengan kondisi-kondisi para rasul sebelum beliau, dana pa yang belia bawa (yaitu ajaran) serupa dengan ajaran yang mereka bawa. Sebab semuanya adalah benar dan kebenaran, yaitu diturunkan dari Tuhan Yang menyandang sifat ketuhanan (uluhiyah), keperkasaan agung, kebijaksanaan sempurna, seluruh alam atas dana lam bawah adalah kerajaanNya dan berada di bawah kendaliNya, baik secara takdir maupun syar’i, Dan sesungguhnya Dia “Yang Mahatingggi,” dzat, kemuliaan, dan keperkasaanNya, “lagi Mahabesar,” yang karena kebesaranNya, “hampir saja langit itu pecah dari sebelah atasnya,” padahal keduanya sangat luar biasa besarnya dan keduanya adalah benda mati. “Dan malaikat-malaikat,” yang mulia lagi didekatkan, tunduk kepada keagunganNya dan bersikap hina dina karena keperkasaanNya, patuh kepada RububiyahNya. “mereka bertasbih dengan memuji Rabbnya,” mereka mengagungkanNya dari segala kekurangan dan menyifatiNya dengan segala sifat kesempurnaan, “dan memohonkan ampun bagi orang-orang yang ada di bumi,” dari hal-hal yang timbul dari mereka, yaitu segala apa yang tidak layak dengan keagungan dan kebesaran Allah, padahal Dia “Yang Maha Pengampun lagi Maha Penyayang,” yang kalau saja bukan karena ampunan dan rahmatNya, tentu Dia segera menimpakan hukuman yang membinasakan terhadap manusia. Di dalam pengungkapan terhadap Allah dengan sifat-sifat tersebut di atas setelah Dia menjelaskan bahwasanya Dia telah mewahyukan kepada para rasul pada umumnya dan kepada Nabi Muhammad pada khususnya, terdapat sebuah isyarat bahwa al-Quran al-Karim ini mengandung dalil-dalil dan argument-argumen serta ayat-ayat yang membuktikan akan kesempurnaan Sang Pencipta, Allah, dan pengungkapan tentang Allah dengan nama-nama yang agung yang menyebabkan hati penuh dengan ma’rifat, kecintaan, pengagungan, penghormatan dan pemuliaan kepadaNya serta memusatkan segala bentuk penghambaan lahir dan batin hanya kepadaNya. Dan sesungguhnya kezhaliman yang paling besar dan perkataan (keyakinan) yang paling keji adalah pengangkatan sembahan-sembahan selain Allah, yang mereka sama sekali tidak memiliki kuasa memberikan manfaat ataupun menimpakan bahaya, melainkan mereka adalah makhluk yang bergantung kepada Allah dalam seluruh kondisi dan perihal mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syura ayat 5: (Hampir saja) dapat dibaca Takaadu atau Yakaadu (langit itu pecah) dibaca Yatafath-tharna dengan huruf tha yang ditasydidkan menurut qiraat lain dibaca Yanfathirna dengan memakai huruf Nun (dari sebelah atasnya) hampir setiap langit itu pecah menimpa yang lainnya karena kebesaran Allah swt. (dan malaikat-malaikat bertasbih serta memuji Rabbnya) disertai dengan mengucapkan puji-pujian (dan memohonkan ampun bagi orang-orang yang ada di bumi) yakni bagi orang-orang yang beriman. (Ingatlah! Bahwa sesungguhnya Allah Dialah Yang Maha Pengampun) kepada kekasih-kekasih-Nya (lagi Maha Penyayang) kepada mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni malaikat yang mulia lagi didekatkan tunduk kepada keagungan-Nya, menyerahkan diri kepada keperkasaan-Nya dan tunduk dengan rububiyyah-Nya. Maksudnya, mengagungkan-Nya dari setiap kekurangan, dan menyifati-Nya dengan semua kesempurnaan. Yaitu kaum mukmin. Kalau bukan karena ampunan dan rahmat-Nya, tentu Dia akan menyegerakan hukuman yang membinasakan kepada makhluk-Nya yang durhaka. Dengan disifatinya Allah Subhaanahu wa Ta'aala dengan sifat-sifat ini setelah disebutkan bahwa Dia memberi wahyu kepada para rasul secara umum dan Nabi Muhammad shallallahu 'alaihi wa sallam secara khusus terdapat isyarat bahwa dalam Al Qur’anul Karim ini terdapat dalil-dalil dan bukti-bukti serta ayat-ayat yang menunjukkan kesempurnaan Allah Subhaanahu wa Ta'aala. Demikian pula disifatinya Allah Subhaanahu wa Ta'aala dengan nama-nama yang agung akan membuat hati penuh dengan ma’rifat (mengenal) kepada-Nya, mencintai-Nya, mengagungkan-Nya dan memuliakan-Nya, serta membuat manusia mengarahkan ibadah baik yang tampak maupun yang tersembunyi kepada Allah Subhaanahu wa Ta'aala, dan bahwa sebuah kezaliman yang paling besar serta perkataan yang paling buruk adalah ketika mengadakan tandingan-tandingan bagi Allah, padahal tandingan-tandingan itu tidak mampu memberikan manfaat dan menimpakan madharrat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syura Ayat 5",
    "description": "Hampir saja langit-langit yang menjadi milik-Nya itu, yang telah diciptakan-Nya dengan sangat kuat dan kukuh, pecah dari sebelah atas-Nya karena kebesaran dan keagungan Allah. Dan malaikat-malaikat di mana pun berada selalu bertasbih menyucikan-Nya dari segala kekurangan dengan memuji keagungan dan kebesaran tuhan-Nya dan memohonkan ampunan untuk orang-orang beriman yang ada di bumi atas dosa-dosa mereka. Ingatlah, sesungguhnya Allah dialah yang maha pengampun dengan mengampuni dosa hamba-hamba-Nya, maha penyayang dengan memberikan rahmat-Nya kepada mereka. 6. Dan orang-orang yang menentang tuntunan-Nya dan menyekutukan-Nya dengan mengambil pelindung-pelindung dan menyembah sesuatu selain Allah, Allah mengawasi dan memperhatikan segala amal dan perbuatan mereka. Adapun engkau, wahai Muhammad, bukanlah orang yang diserahi tanggung jawab untuk mengawasi mereka dan tidak pula mempertanggungjawabkan amal mereka. Tugas engkau hanya menyampaikan kebenaran kepada mereka."
  }
]