[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "49-50 Hanya milik Allah semata kerajaan langit dan bumi dan apa yang ada pada keduanya. Dia menciptakan apa yang Dia kehendaki, memberikan kepada siapa yang Dia kehenadki dari hamba-hambaNya anak perempuan tanpa laki-laki bersamanya, dan Dia memberikan kepada siapa yang Dia kehendaki dari hamba-hamabNya anak laki-laki tanpa perempuan bersamanya, dan Allah memberikan anak laki-laki dan perempuan kepada siapa yang Dia kehendaki dari hamba-hambaNYa, serta Dia menjadikan siapa yang Dia kehendaki mandul tidak beranak. Sesungguhnya Allah maha mengetahui apa yang Dia ciptakan, maha kuasa untuk membuat apa yang Dia kehendaki, tidak ada sesuatu yang melemahkannya saat Dia hendak menciptakanNYa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "49-50. Milik Allah lah kerajaan langit dan kerajaan bumi. Dia menciptakan apa yang Dia kehendaki dari jenis laki-laki, perempuan atau yang lainnya. Dia memberikan anak perempuan kepada yang Dia kehendaki dan menghalanginya dari anak laki-laki, serta memberikan anak laki-laki kepada yang Dia kehendaki dan menghalanginya dari anak perempuan, atau memberikan kepada yang Dia kehendaki anak laki-laki dan perempuan bersamaan serta menjadikan orang yang Dia kehendaki mandul tidak mempunyai anak. Sesungguhnya Dia Maha Mengetahui apa yang terjadi dan apa yang akan terjadi pada masa yang akan datang, dan ini bagian dari kesempurnaan ilmu-Nya dan kesempurnaan hikmah-Nya. Tidak ada sesuatupun yang tersembunyi dari-Nya, dan tidak ada sesuatupun yang melemahkan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "50. أَوْ يُزَوِّجُهُمْ ذُكْرَانًا وَإِنٰثًا ۖ (atau Dia menganugerahkan kedua jenis laki-laki dan perempuan (kepada siapa) yang dikehendaki-Nya) Yakni mengaruniakan anak laki-laki dan perempuan bagi sebagian hamba-Nya. Sehingga makna (التزويج) di sini adalah mengumpulkan bagi seseorang anak laki-laki dan perempuan. وَيَجْعَلُ مَن يَشَآءُ عَقِيمًا ۚ( dan Dia menjadikan mandul siapa yang Dia kehendaki) Yakni tidak dikaruniakan kepadanya anak laki-laki atau perempuan. إِنَّهُۥ عَلِيمٌ قَدِيرٌ(Sesungguhnya Dia Maha Mengetahui lagi Maha Kuasa) Yakni memiliki ilmu yang sangat dalam dan kekuasaan yang sangat agung, dan bagian dari kesempurnaan kuasa-Nya adalah dengan mengaruniakan kepada siapa yang Dia kehendaki dengan jenis keturunan yang Dia kehendaki."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "50. Atau memberi mereka dua jenis, yaitu laki-laki dan perempuan dan menjadikan usaha seseorang yang dikehendakiNya sia-sia, sehingga tidak melahirkan siapapun. Sesungguhnya Allah SWT Maha Mengetahui makhlukNya, berkuasa atas apa yang dikehendakiNya dan bertindak untuk sesuatu yang dianggap maslahat dan penuh hikmah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Atau Dia menganugerahkan laki-laki dan perempuan} mengumpulkan untuknya di antara keduanya, sehingga melahirkan anak laki-laki dan perempuan {serta menjadikan siapa saja yang Dia kehendaki mandul} tidak memiliki anak {Sesungguhnya Dia Maha Mengetahui lagi Maha kuasa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "49-50. Ayat ini mengandung pemberitaan tentang betapa luasnya kerajaan Allah dan terealisasinya tindakanNya dalam keerajaanNya dan mengatur semua uusan, hingga pengaturan yang dilakukanNya mencakup ciptaan tentang sebab-sebab yang dilakukan oleh manusia. sesungguhnya nikah (pesetubuhan) itu merupakan salah satu sebab dilahirkannya anak. Allahlah yang telah memberi mereka anak-anak menurut kehendakNya. Maka diantara manusia ada yang diberi anak perempuan dan ada pula yang diberi anak laki-laki, dan ada pula yang diberi berpasangan. Maksudnya, anak laki-laki dan perempuan. dan diantara mereka ada yang dijadikan mandul, tidak bisa mempunyai anak. “sesungguhnya Dia mahamengetahui,” segala sesuatu “lagi mahakuasa,” melakukan apa saja. Dia berbuat sesuai dengan pengetahuanNya dan keahlianNya terhadap segala sesuatu dan sesuai dengan kuasaNya pada makhluk-makhlukNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syura ayat 50: (Atau Dia menganugerahkan kedua jenis) atau Dia menjadikan buat mereka (laki-laki dan perempuan, dan Dia menjadikan mandul siapa yang Dia kehendaki) sehingga tidak mempunyai anak dan tidak dapat membuahi. (Sesungguhnya Dia Maha Mengetahui) apa yang diciptakan-Nya (lagi Maha Kuasa) atas semua apa yang dikehendaki-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dia mengetahui segala sesuatu dan berkuasa terhadap segala sesuatu, sehingga Dia bertindak dengan ilmu-Nya dan dengan kekuasaan-Nya terhadap makhluk-makhluk-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syura Ayat 50",
    "description": "Atau, dia mengkombinasikan mereka, yakni menggabungkan anak-anak itu, ada anak-anak berjenis laki-laki dan ada pula yang berjenis perempuan kepada siapa yang dikehendaki-Nya, dan menjadikan mandul siapa yang dia kehendaki mandul. Dia maha mengetahui segala hal yang terkait dengan persoalan-persoalan di atas, dan mahakuasa atas segala sesuatu yang dikehendaki-Nya. 51. Ayat-ayat yang lalu berbicara tentang kekuasaan Allah atas makhluk-makhluk-Nya. Ayat ini menjelaskan tentang wahyu Allah yang diturunkan kepada rasul. Dan tidaklah patut, yaitu tidak mungkin terjadi, bagi seorang manusia bahwa Allah akan berbicara secara langsung kepadanya kecuali berupa wahyu yang di turunkan kepadanya atau pembicaraan yang disampaikannya dari belakang tabir, seperti yang di alami oleh nabi musa di tur sina atau dengan mengutus utusan, yakni malaikat jibril lalu di wahyukan kepadanya dengan izin-Nya apa yang dia kehendaki. Sungguh, dia mahatinggi, mahasuci dari sifat-sifat yang dimiliki makhluk-Nya dan mahabijaksana dalam menempatkan sesuatu secara proporsional sesuai dengan hikmah-Nya."
  }
]