[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidak patut bagi seorang anak cucu adam diajak berbicara oleh Allah kecuali dalam bentuk wahyu yang Dia wahyukan kepadanya atau Allah berbicara kepadanya di balik hijab, sebagaimana Allah bicara kepada Musa atau Allah mengutus seorang utusan, sebagaimana jibril, turun kepada para rasul, lalu dia memberikan wahyu dengan izin tuhan-Nya (bukan sekedar keinginan nafsunya) apa yang hendak Allah wahyukan. Sesungguhnya Allah maha tinggi dengan Dzat Nya, nama-namaNya, sifat-sifatNya dan perbuatan-perbuatanNya Dia mengalahkan segala sesuatu dan para makhlukpun tunduk kepadaNYa, maha bijaksana dalam segala pengaturanNYa terhadap urusan makhkukNYa. Ayat ini menetapkan sifat “kalam” (berbicara) bagi Allah sesuai dengan kebesaran dan keagunganNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "51. Tidak patut bagi manusia berbicara dengan Allah kecuali melalui wahyu yang diturunkan kepadanya atau berbicara dengannya secara langsung, akan tetapi berada di belakang tabir tanpa bisa melihat-Nya, atau Dia mengirim malaikat sebagai utusan seperti Jibril, lalu dia mewahyukan kepada rasul dari kalangan manusia dengan izin Allah apa yang dikehendaki-Nya untuk diwahyukan kepadanya. Sesungguhnya Dia -Subḥānahu- Mahatinggi Żat-Nya dan sifat-sifat-Nya, Maha Bijaksana dalam penciptaan-Nya, takdir-Nya dan syariat-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "51. Tidak mungkin manusia dapat Allah firmankan kepadanya melainkan melalui wahyu yang diturunkan kepadanya, atau Allah berfirman kepadanya dibalik tabir, atau dengan mengutus malaikat kepadanya untuk menyampaikan wahyu dengan izin Tuhannya. Allah Maha Tinggi Dzat, nama, dan sifat-Nya; dan Maha Bijaksana dalam mengatur urusan makhluk-makhluk-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "51. وَمَا كَانَ لِبَشَرٍ أَن يُكَلِّمَهُ اللهُ إِلَّا وَحْيًا (Dan tidak mungkin bagi seorang manusiapun bahwa Allah berkata-kata dengan dia kecuali dengan perantaraan wahyu) Yakni dengan wahyu yang diberikan kepadanya sehingga ia menjadi terilhami dan dimasukkan ke dalam hatinya sebagaimana diilhamkan kepada ibu Nabi Musa, dan kepada Nabi Ibrahim tentang penyembelihan anaknya. Wahyu adalah pengilhaman dengan cepat dan tersembunyi. أَوْ مِن وَرَآئِ حِجَابٍ(atau dibelakang tabir) Sebagaimana Allah mewahyukan kepada Nabi Musa. Yakni suara-Nya terdengar namun Dzat-Nya tidak terlihat. أَوْ يُرْسِلَ رَسُولًا فَيُوحِىَ بِإِذْنِهِۦ مَا يَشَآءُ ۚ( atau dengan mengutus seorang utusan (malaikat) lalu diwahyukan kepadanya dengan seizin-Nya apa yang Dia kehendaki) Yakni mengutus malaikat untuk mewahyukan kepada seorang rasul dengan perintah dan bantuan Allah dengan wahyu yang Dia kehendaki."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "51. Tidak mungkin bagi manusia dapat diajak berbicara Allah kecuali melalui wahyu yang diturunkan kepadanya (wahyu adalah kalam tersembunyi yang disadari dengan cepat) atau diajak berbicara dari balik satir (penutup), sebagaimana Musa AS berbicara, atau dengan mengirimnya utusan dari golongan malaikat seperti Jibril AS untuk menyampaikan wahyu atau menyampaikan sesuatu yang dikirim kepadanya dengan perintah yang dikehendaki Allah. Sesungguhnya Allah SWT adalah Dzat yang Maha Luhur dan terbebas dari sifat-sifat makhlukNya. Dia bertindak sesuai kebijaksanaanNya dengan meletakkan setiap sesuatu pada tempatnya yang tepat. Ayat ini diturunkan saat orang Yahudi berkata kepada nabi SAW: “Jika kamu benar-benar nabi, Apakah kamu tidak berbicara dan melihat Allah layaknya Musa berbicara (denganNya)?” Kemudian turunlah ayat ini dan Nabi SAW bersabda: “Musa belum pernah melihat Allah SWT.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidak mungkin} Tidak benar {bagi seorang manusia untuk diajak berbicara (langsung) oleh Allah, kecuali dengan wahyu} ilham atau melihat dalam mimpi {dari belakang tabir} mendengar kalamNya tetapi tidak melihatNya sebagaimana Dia berfirman kepada Musa AS {atau dengan mengirim utusan} malaikat seperti Jibril AS {lalu mewahyukan kepadanya dengan izinNya apa yang Dia kehendaki. Sesungguhnya Dia Maha tinggi lagi Maha bijaksana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "51. setelah orang-orang yang mendustakan para utusan Allah, yang kafir kepada Allah itu berkata, ”kenapa Allah tidak langsung bebicara kepada kami atau datang kepada kami bukti,” (al-baqarah:118), karena kesombongan dan kecongkakan mereka, maka Allah menjawab (membantah) mereka dengan ayat suci ini. (dan Dia jelaskan) bahwa Dia hanya berkata-kata langsung kepada manusia tertentu, yaitu para nabi yang diutus dan manusia pilihanNYa. Dan pembicaraan itu terjadi melalui beberapa cara: berbicara kepadanya melalui wahyu, Dia tiupkan wahyu tesebut kepada hati seorrang rasul tanpa perantara seorang malaikat atau tanpa pembicaraan langsung dengan rasul itu, “atau” Dia berbicara kepadanya secara langsung akan tetapi “dari belakang tabir”sebagaimana terjadi pada nabi musa bin iman (yang dijuluki) kalimur-rahman “atau” Allah berbicara kepadanya melalui perantara utusan dari kalangan malaikat, “dengan mengutus seorang utusan,” seperti malaikat jibril atau malaikat-malaikat lainnya.”lalu diwahyukan kepadanya dengan seizinNya, ”maksudnya, seizin tuhannya, tidak berdasarkan kemauannya sendiri.” Sesungguhnya Allah mehatinggi dzatNya. Mahatinggi sifat-sifatNya, lagi mahaagung, lagi mahatinggi perbuatan-perbuatanNya. dia telah mengalahkan segala sesuatu, seluruh makhluk tunduk kepadaNYa, ”lagi mahabijaksana,” di dalam penempatan segala sesuatu dari berbagai makhluk dan ketetapan hukum masing-masing pada tempatnya,"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syura ayat 51: (Dan tidak mungkin bagi seorang manusia pun bahwa Allah berkata-kata dengan dia kecuali) dengan perantaraan (wahyu) yang Dia wahyukan kepadanya di dalam tidurnya atau melalui ilham (atau) melainkan (di belakang tabir) seumpamanya Allah memperdengarkan kalam-Nya kepadanya, tetapi dia tidak dapat melihat-Nya, sebagaimana yang telah terjadi pada Nabi Musa a.s. (atau) kecuali (dengan mengutus seorang utusan) yakni malaikat, seperti Jibril (lalu diwahyukan kepadanya) maksudnya, utusan itu menyampaikan wahyu-Nya kepada rasul yang dituju (dengan seizin-Nya) dengan seizin Allah (apa yang Dia kehendaki) apa yang Allah kehendaki. (Sesungguhnya Dia Maha Tinggi) dari sifat-sifat yang dimiliki oleh semua makhluk (lagi Maha Bijaksana) di dalam perbuatan-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ketika orang-orang yang mendustakan para rasul berkata, “Mengapa Allah tidak berbicara langsung dengan kami?” karena kesombongan mereka, maka Allah membantah mereka dengan ayat yang mulia ini, dan bahwa pembicaraan Allah Subhaanahu wa Ta'aala hanyalah kepada makhluk pilihan-Nya, dan bahwa caranya sebagaimana yang disebutkan dalam ayat di atas. Yaitu dengan menyampaikan wahyu ke dalam hati rasul tersebut tanpa mengutus seorang malaikat dan tanpa berbicara secara langsung. Dari belakang tabir artinya ialah seorang dapat mendengar firman Allah, akan tetapi dia tidak dapat melihat-Nya seperti yang terjadi pada Nabi Musa ‘alaihis salam. Seperti malaikat Jibril ‘alaihis salam. Tinggi zat-Nya, sifat-Nya, tinggi perbuatan-Nya, Dia mengalahkan segala sesuatu dan semua makhluk tunduk kepada-Nya. Karena menempatkan sesuatu pada tempatnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syura Ayat 51",
    "description": "Ayat-ayat yang lalu berbicara tentang kekuasaan Allah atas makhluk-makhluk-Nya. Ayat ini menjelaskan tentang wahyu Allah yang diturunkan kepada rasul. Dan tidaklah patut, yaitu tidak mungkin terjadi, bagi seorang manusia bahwa Allah akan berbicara secara langsung kepadanya kecuali berupa wahyu yang di turunkan kepadanya atau pembicaraan yang disampaikannya dari belakang tabir, seperti yang di alami oleh nabi musa di tur sina atau dengan mengutus utusan, yakni malaikat jibril lalu di wahyukan kepadanya dengan izin-Nya apa yang dia kehendaki. Sungguh, dia mahatinggi, mahasuci dari sifat-sifat yang dimiliki makhluk-Nya dan mahabijaksana dalam menempatkan sesuatu secara proporsional sesuai dengan hikmah-Nya. 52. Dan demikianlah kami wahyukan kepadamu, wahai nabi Muhammad, ruh, yaitu Al-Qur'an yang di turunkan dengan perantaraan jibril dengan perintah kami. Sebelumnya, yaitu sebelum Al-Qur'an itu di turunkan kepadamu, engkau tidaklah mengetahui apakah al-kitab itu, yaitu Al-Qur'an dan apakah pula iman itu. Akan tetapi, kami menjadikannya, yaitu Al-Qur'an itu, cahaya yang dapat menerangi dan menunjukkan jalan yang benar kepadamu. Dengan Al-Qur'an itu pula kami memberi petunjuk siapa yang kami kehendaki untuk mendapat petunjuk di antara hamba-hamba kami. Dan sungguh, engkau, wahai nabi Muhammad, benar-benar membimbing manusia kepada jalan yang lurus, jalan yang kami ridai."
  }
]