[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "52-53 Sebagiamana Kami telah mewahyukan kepada nabi-nabi sebelummu (wahai nabi), Kami juga mewahyukan alqur’an kepadamu dari sisi Kami. Sebelumnya kamu tidak mengetahui apa itu kitab-kitab terdahulu, apa itu iman, dan apa itu syariat ilahiyah? Akan tetapi Kami menjadikan al-qur’an sebagai cahaya bagi manusia, dengannya Kami memberi petunjuk kepada siapa yang Kami kehendaki dari hamba-hamba Kami ke jalan yang lurus. Dan Sesungguhnya kamu (wahai rasul) benar-benar menujukan dan membimbing dengan izin Allah ke jalan yang lurus (yaitu islam), jalan Allah yang memiliki segala kerajaan yang ada di langit dan di bumi, tiada sekutu bagiNYa dalam hal itu. Hanya kepada Allah (wahai manusia) segala urusan kalian akan berpulang, yang baik maupun yang buruk, lalu Dia akan membalas masing-masing dengan amalnya, bila baik maka dengan balasan baik, bila buruk maka dengan balasan buruk."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "52. Dan sebagaimana Kami wahyukan kepada para nabi-nabi sebelummu -wahai Rasul- Kami mewahyukan kepadamu Al-Qur`ān dari sisi Kami. Sebelumnya kamu tidak mengetahui apa saja kitab samawi yang diturunkan kepada para rasul dan sebelumnya kamu tidak mengetahui apa itu iman. Akan tetapi Kami menurunkan Al-Qur`ān ini sebagai cahaya, dengannya Kami memberi petunjuk kepada yang kami kehendaki dari hamba-hamba Kami. Dan sesungguhnya kamu benar-benar menunjukkan manusia kepada jalan yang lurus, yaitu agama Islam."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "52-53. Hai Rasulullah, sebagaimana Kami mewahyukan kepada para rasul, Kami juga menyampaikan wahyu kepadamu berupa al-Qur’an dari sisi Kami. Sebelumnya kamu tidak mengetahui apa itu kitab-kitab samawi terdahulu dan apa itu keimanan; akan tetapi Kami menjadikan al-Qur’an ini cahaya yang menerangi para hamba, dengan al-Qur’an Kami memberi petunjuk kepada hamba yang Kami kehendaki. Hai Rasulullah, sungguh kamu memberi petunjuk menuju agama Islam yang merupakan agama Allah Yang Memiliki kerajaan yang ada di tujuh langit dan bumi. Hai para hamba, ketahuilah, sesungguhnya semua makhluk akan kembali kepada Allah untuk menjalani hisab."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "52. وَكَذٰلِكَ أَوْحَيْنَآ إِلَيْكَ رُوحًا مِّنْ أَمْرِنَا ۚ (Dan demikianlah Kami wahyukan kepadamu wahyu (Al Quran) dengan perintah Kami) Yakni Kami mewahyukan al-Qur’an kepadamu yang merupakan perintah Allah dan ruh karena ia membawa petunjuk yang mengandung kehidupan dari kematian akibat kekafiran. مَا كُنتَ تَدْرِى مَا الْكِتٰبُ(Sebelumnya kamu tidaklah mengetahui apakah Al Kitab (Al Quran)) Yakni tidak mengetahui apa itu kitab, sebab Rasulullah merupakan ‘ummi’ yang tidak dapat membaca dan menulis. وَلَا الْإِيمٰنُ(dan tidak pula mengetahui apakah iman itu) Yakni sebelum diwahyukan kepada Rasulullah, dia tidak mengetahui arti iman dan syari’at-syari’at secara terperinci, namun Allah hanya menyebutkan iman karena ia merupakan inti dan asas syari’at. وَلٰكِن جَعَلْنٰهُ نُورًا نَّهْدِى بِهِۦ مَن نَّشَآءُ(tetapi Kami menjadikan Al Quran itu cahaya, yang Kami tunjuki dengan dia siapa yang kami kehendaki) Yakni Kami jadikan ruh (al-Qur’an) yang Kami wahyukan kepadamu sebagai cahaya dan petunjuk kepada ketauhidan, keimanan, dan jalan-jalan kehidupan, dengannya Kami memberi petunjuk kepada siapa yang Kami kehendaki dari kegelapan kejahiliyahan dan kesesatan menuju hidayah dan ilmu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "52. Sebagaimana kami mewahyukan rasul-rasul selain kamu, kami juga mewahyukan Al-Qur’an ini kepadamu. Itu adalah salah satu perintah Allah. Al-Qur’an disebut ruh, karena hati bisa hidup lantaran Al-Qur’an, diberi petunjuk melalui Al-Qur’an, dan di dalamnya terdapat cara hidup agar terhindar dari kematian dalam keadaan kafir. Kamu tidak mengenal Al-Qur’an sebelum diwahyukan kepadamu, karena kamu Ummiy (buta huruf). Kamu juga tidak mengetahui hakikat keimanan yang ada dalam berbagai syariat dan hukum yang berbeda-beda. Akan tetapi kami jadikan Al-Qur’an ini cahaya penerang dan petunjuk pada keesaan (Allah) dan keimanan. Kami membimbing hamba yang Kami kehendaki menuju agama yang benar. Wahai nabi, sesungguhnya kamu membimbing manusia menuju jalan yang lurus."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Demikianlah} Sebagaimana Kami mewahyukan kepada seluruh rasul Kami {Kami mewahyukan kepadamu rūh} Al-Qur’an {dengan perintah Kami. Sebelumnya kamu tidaklah mengetahui apakah kitab} kitab-kitab terdahulu {dan apakah itu iman, tetapi Kami menjadikannya cahaya yang Kami gunakan untuk memberi petunjuk kepada siapa saja yang Kami kehendaki di antara hamba-hamba Kami. Sesungguhnya kamu benar-benar membimbing ke jalan yang lurus} agama yang lurus tidak ada kebengkokan di dalamnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "52. “dan demikianlah,” ketika kami mewahyukan kepada para rasul sebelummu,”kami mewahyukan kepadamu ruh dari perintah kami,” yaitu al-qur’an al-karim ini. Allah menamakannya ruh karena dengan ruh itulah jasad manusia hidup, dan hati serta ruh hanya bisa hidup dengan al-qu’an dan dengannya pula semua maslahat dunia dan agama menjadi hidup, karena di dalamnya terkandung banyak kebaikan dan ilmu. Dan ia murni karena Allah atas para rasulNya dan hamba-hambaNYa yang beriman tanpa sebab (jasa) dari mereka. Maka dari itu Allah berfirman, ”sebelumnya kamu tidaklah mengetahui” maksudnya, sebelum diturunkannya kepadamu,”apakah al-kitab ini dan tidak pula mengetahui apakah imam itu,” artinya, kamu tidak memiliki pengetahuan tentang infomasi-infomasi kitab-kitab terdahulu dan tidak pula iman dan amal kepada syariat-syariat ilahiyah. Bahkan kamu adalah seorang yang buta huruf, tidak bisa menulis dan tidak bisa membaca. Lalu datang kepadamu kitab ini, dimana “kami menjadikannya cahaya, yang kami tunjuki dengannya siapa saja yang kami kehendaki di antara hamba-hamba kami,” yang dapat mereka jadikan penerang di dalam kegelapan-kegelapan kekafiran, bid’ah dan pemikiran-pemikiran yang menyesatkan, dan dengannya mereka dapat mengetahui fakta-fakta yang sebenanya dan mereka dapat menjadikannya sebagai pedoman menuju jalan yang lurus.”dan sesungguhnya kamu benar-benar memberi petunjuk kepada jalan yang lurus,” maksudnya, kamu menjelaskannya kepada mereka, kamu meneranginya dan memotivasi mereka kepadanya dan kamu melaang mereka dari lawannya dan mewanti-wanti mereka dari lawannya tersebut."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syura ayat 52: (Dan demikianlah) maksudnya, sebagaimana Kami wahyukan kepada rasul-rasul selain kamu (Kami wahyukan kepadamu) hai Muhammad (wahyu) yakni Alquran, yang karenanya kalbu manusia dapat hidup (dengan perintah Kami) yang Kami wahyukan kepadamu. (Sebelumnya kamu tidaklah mengetahui) sebelum Kami mewahyukan kepadamu (apakah Alkitab) yakni Alquran itu (dan tidak pula mengetahui apakah iman itu) yakni syariat-syariat dan tanda-tanda-Nya Nafi dalam ayat ini amalnya di-ta'alluqkan kepada Fi'il dan lafal-lafal sesudah Fi'il menempati kedudukan dua Maf'ulnya (tetapi Kami menjadikan Alquran itu) wahyu atau Alquran itu (cahaya, yang Kami tunjuki dengan dia siapa yang Kami kehendaki di antara hamba-hamba Kami. Dan sesungguhnya kamu benar-benar memberi petunjuk) maksudnya kamu menyeru dengan wahyu yang diturunkan kepadamu (kepada jalan) tuntunan (yang lurus) yakni agama Islam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sebagaimana Kami telah mewahyukan kepada para rasul sebelum-Mu. Al Qur’an disebut ruh karena dengannya hati dan ruh menjadi hidup, demikian pula maslahat dunia dan agama menjadi hidup dengannya; karena di dalamnya terdapat kebaikan dan ilmu yang banyak. Ia merupakan pemberian Allah murni kepada rasul-Nya dan kepada hamba-hamba-Nya yang mukmin tanpa sebab dari mereka. Oleh karena itulah, Dia berfirman, “Sebelumnya engkau tidaklah mengetahui apakah kitab (Al Quran) dan apakah iman itu, yakni engkau tidak memiliki pengetahuan tentang berita kitab-kitab terdahulu, demikian pula tidak memiliki iman dan amal terhadap syariat Allah, bahkan engkau adalah seorang yang ummi (buta huruf), tidak bisa menulis dan membaca, lalu datanglah kitab ini kepadamu, Mereka mengambil sinarnya untuk menerangi kegelapan kufur, bid’ah, dan hawa nafsu. Dengannya mereka mengenal hakikat dan dengannya mereka memperoleh petunjuk ke jalan yang lurus."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syura Ayat 52",
    "description": "Dan demikianlah kami wahyukan kepadamu, wahai nabi Muhammad, ruh, yaitu Al-Qur'an yang di turunkan dengan perantaraan jibril dengan perintah kami. Sebelumnya, yaitu sebelum Al-Qur'an itu di turunkan kepadamu, engkau tidaklah mengetahui apakah al-kitab itu, yaitu Al-Qur'an dan apakah pula iman itu. Akan tetapi, kami menjadikannya, yaitu Al-Qur'an itu, cahaya yang dapat menerangi dan menunjukkan jalan yang benar kepadamu. Dengan Al-Qur'an itu pula kami memberi petunjuk siapa yang kami kehendaki untuk mendapat petunjuk di antara hamba-hamba kami. Dan sungguh, engkau, wahai nabi Muhammad, benar-benar membimbing manusia kepada jalan yang lurus, jalan yang kami ridai. 53. Yaitu jalan Allah yang milik-Nyalah kewenangan dan kekuasaan terhadap apa yang ada di langit dan apa yang ada di bumi. Ingatlah, segala urusan kembali kepada Allah tanpa perantara, lalu dia memberi ganjaran pahala kepada mereka yang telah melakukan kebajikan dan menghukum mereka yang telah berbuat dosa."
  }
]