[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "52-53 Sebagiamana Kami telah mewahyukan kepada nabi-nabi sebelummu (wahai nabi), Kami juga mewahyukan alqur’an kepadamu dari sisi Kami. Sebelumnya kamu tidak mengetahui apa itu kitab-kitab terdahulu, apa itu iman, dan apa itu syariat ilahiyah? Akan tetapi Kami menjadikan al-qur’an sebagai cahaya bagi manusia, dengannya Kami memberi petunjuk kepada siapa yang Kami kehendaki dari hamba-hamba Kami ke jalan yang lurus. Dan Sesungguhnya kamu (wahai rasul) benar-benar menujukan dan membimbing dengan izin Allah ke jalan yang lurus (yaitu islam), jalan Allah yang memiliki segala kerajaan yang ada di langit dan di bumi, tiada sekutu bagiNYa dalam hal itu. Hanya kepada Allah (wahai manusia) segala urusan kalian akan berpulang, yang baik maupun yang buruk, lalu Dia akan membalas masing-masing dengan amalnya, bila baik maka dengan balasan baik, bila buruk maka dengan balasan buruk."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "53. Yaitu jalan Allah yang memiliki segala yang ada di langit dan memiliki segala yang ada di bumi, baik dalam penciptaannya, penguasaannya dan pengurusannya. Tidak ada keraguan bahwa hanya kepada Allah semata segala sesuatu akan dikembalikan, baik dalam takdirnya maupun urusannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "53. yaitu agama Allah, pemiliki kekuasaan atas segala yang ada di langit dan bumi. Ingatlah bahwa hanya kepada Allahlah segala sesuatu itu dikembalikan tanpa melalui wasilah apapun, Dia memberi pahala orang yang berbuat kebaikan dan menghukum orang yang berbuat keburukan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{jalan Allah yang milikNyalah apa yang ada di langit dan apa yang ada di bumi. Ketahuilah bahwa hanya kepada Allahlah segala urusan kembali} kembali"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "53. kemudian Allah menjelaskan jalan yang lurus tersebut, seraya berfirman “yaitu jalan Allah yang kepunyaanNya segala apa yang ada di langit dan apa yang ada di bumi,” maksudnya, jalan yang dibentangkan oleh Allah untuk hamba-hambaNYa dan menyampaikan kepada mereka bahwa ia bisa mengantarkan mereka kepadaNYa dan kepada negeri karamahNya.”ingatlah, bahwa kepada Allah lah semua urusan kembali,” maksudnya, semua perkara kebaikan dan keburukan kembali kepadaNya, lalu Dia akan memberikan balasan kepada masing-masing menurut amal perbuatannya, jika baik dibalas dengan kebaikan dan jika buuk dibalas dengan keburukan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syura ayat 53: (Yaitu jalan Allah yang kepunyaan-Nya segala apa yang ada di langit dan apa yang ada di bumi) sebagai milik-Nya, makhluk-Nya dan hamba-hamba-Nya. (Ingatlah, bahwa kepada Allahlah kembali semua urusan) semua urusan dikembalikan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Jalan tersebut menghubungkan kepada Allah dan kepada surga-Nya. Yakni milik-Nya, ciptaan-Nya dan hamba-Nya. Semua perkara baik maupun buruk dikembalikan, maka Dia akan memberikan balasan sesuai amal yang dilakukan seseorang; jika baik maka dibalas dengan kebaikan dan jika buruk, maka akan dibalas dengan keburukan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syura Ayat 53",
    "description": "Yaitu jalan Allah yang milik-Nyalah kewenangan dan kekuasaan terhadap apa yang ada di langit dan apa yang ada di bumi. Ingatlah, segala urusan kembali kepada Allah tanpa perantara, lalu dia memberi ganjaran pahala kepada mereka yang telah melakukan kebajikan dan menghukum mereka yang telah berbuat dosa. 1. H' m'm. Kedua huruf ini termasuk huruf-huruf yang terletak pada permulaan sebagian dari surah-surah al-quran seperti: alif l'm m'm, alif l'm r', alif l'm m'm s'd, dan sebagainya. Di antara ahli-ahli tafsir ada yang menyerahkan pengertiannya kepada Allah karena di pandang termasuk ayat-ayat mutasyabihat, dan ada pula yang menafsirkannya. Golongan yang menafsirkannya ada yang memandangnya sebagai nama surah, dan ada pula yang berpendapat bahwa huruf-huruf abjad itu gunanya untuk menarik perhatian para pendengar supaya memperhatikan al-quran itu, dan untuk mengisyaratkan bahwa al-quran itu diturunkan dari Allah dalam bahasa arab yang tersusun dari huruf-huruf abjad. Kalau mereka tidak percaya bahwa al-quran di turunkan dari Allah dan hanya buatan Muhammad semata-mata, maka cobalah mereka buat semacam al-quran itu."
  }
]