[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang yang mengangkat tuhan-tuhan selain Allah, yang mereka jadikan pelindung dan mereka juga menyembahnya, Allah akan menjaga perbuatan mereka atas mereka lalu membalas mereka sesuai dengannya di hari kiamat. Sedangkan Kamu (wahai rasul) bukan penangung jawab atas mereka untuk menjaga amal perbuatan mereka, karena sesungguhnya kamu hanyalah pemberi peringatan tugasmu hanya menyampaikan dan tanggung jawab-Ku lah memperghitungkannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Dan orang-orang yang menjadikan berhala-berhala di sisi Allah, mereka meminta perlindungan kepadanya dan menyembahnya selain menyembah Allah, sesungguhnya Allah mengawasi mereka, mencatat setiap perbuatan mereka dan membalasnya. Dan engkau -wahai Rasul- tidak ditugasi untuk mengawasi mereka, maka engkau tidak akan ditanya tentang perbuatan mereka. Sesungguhnya engkau hanyalah penyampai."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "6. Allah mengancam orang-orang musyrik yang membuat tuhan-tuhan selain Allah untuk mereka sembah, bahwa Allah mencatat amalan mereka dan Dia akan memberi perhitungan atas amalan itu pada hari kiamat. Hai Rasulullah, kamu bukan orang yang akan menanggung amalan mereka, kamu hanyalah penyampai risalah dan pengemban amanah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. وَالَّذِينَ اتَّخَذُوا۟ مِن دُونِهِۦٓ أَوْلِيَآءَ (Dan orang-orang yang mengambil pelindung-pelindung selain Allah) Yakni berhala-berhala yang mereka sembah. اللهُ حَفِيظٌ عَلَيْهِمْ(Allah mengawasi (perbuatan) mereka) Yakni Allah mengawasi amal perbuatan mereka untuk membalas mereka sesuai dengan amalan tersebut. وَمَآ أَنتَ عَلَيْهِم بِوَكِيلٍ (dan kamu (ya Muhammad) bukanlah orang yang diserahi mengawasi mereka) Yakni Allah tidak membebanimu dengan mereka sehingga kamu disiksa karena dosa-dosa mereka, tidak pula membebanimu untuk memberi mereka hidayah, namun tugasmu hanyalah menyampaikan risalah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Dan orang-orang yang meminta pertolongan selain Allah, yaitu para berhala dan semacamnya lalu menyembahnya, maka Allah itu sangat mengetahui keadaan dan amal perbuatan mereka. Dia mengingatnya untuk membalas mereka atas amal perbuatan tersebut. Wahai Nabi, kamu tidaklah dipilih untuk memberi hidayah dan menghakimi mereka atas amal tersebut, namun kamu hanya ditugaskan untuk menyampaikan saja"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang mengambil pelindung-pelindung} berhala-berhala yang mereka mintai perlindungan dan mereka sembah {selain Dia} selain Allah {Allah mengawasi mereka} Mengawasi amal ibadah mereka sehingga membalas mereka {Dan kamu bukanlah penanggung jawab mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6. Maka dari itu Allah melanjutkan FirmanNya dengan, “Dan orang-orang yang mengambil pelindung-pelindung selain Allah,” di mana mereka berloyalitas kepada para pelindung itu dengan menyembah dan taat kepada mereka seperti halnya mereka beribadah dan taat kepada Allah, maka mereka sesungguhnya telah mengambil (melakukan) kebatilan, dan apa yang mereka sembah itu sebenarnya bukan pelindung, “Allah mengawasi mereka,” Yang memelihara amal perbuatan mereka, dan kemudian akan memberikan balasannya terhadap yang baik dan yang buruknya, “dan kamu bukanlah orang yang diserahi mengawasi mereka,” lalu akan diminta pertanggung jawaban atas amal perbuatan mereka. Kamu sesungguhnya hanyalah penyampai yang telah menunaikan tugasmu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syura ayat 6: (Dan orang-orang yang mengambil selain Allah) mengambil berhala-berhala (sebagai pelindung-pelindung, Allah mengawasi) mencatat (perbuatan mereka) untuk membalas mereka kelak (dan kamu bukanlah orang yang diserahi mengawasi mereka) untuk memperoleh apa yang diminta dari mereka, tugasmu tiada lain hanya menyampaikan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu kepada patung dan berhala, dimana mereka menyembah kepadanya. Maka sesungguhnya yang mereka ambil adalah sesuatu yang batil, bukan pelindung sama sekali. Yakni menjaga amal mereka, dan akan membalasnya dengan yang baik atau yang buruk. Kewajibanmu hanyalah menyampaikan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syura Ayat 6",
    "description": "Dan orang-orang yang menentang tuntunan-Nya dan menyekutukan-Nya dengan mengambil pelindung-pelindung dan menyembah sesuatu selain Allah, Allah mengawasi dan memperhatikan segala amal dan perbuatan mereka. Adapun engkau, wahai Muhammad, bukanlah orang yang diserahi tanggung jawab untuk mengawasi mereka dan tidak pula mempertanggungjawabkan amal mereka. Tugas engkau hanya menyampaikan kebenaran kepada mereka. 7. Dan demikianlah kami wahyukan Al-Qur'an kepadamu, wahai nabi Muhammad dalam bahasa arab, yaitu bahasa yang engkau gunakan bersama kaummu agar engkau memberi peringatan kepada penduduk ibukota, yaitu kota mekah, dan penduduk negeri-negeri di sekelilingnya serta memberi peringatan tentang hari berkumpul, hari kiamat, yang tidak diragukan adanya oleh orang-orang beriman. Pada hari itu nanti segolongan di antara manusia masuk surga karena keimanan dan amal saleh yang mereka lakukan dan segolongan yang lain masuk neraka karena kekafiran dan kedurhakaan mereka terhadap Allah."
  }
]