[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "sebagaimana Kami telah mewahyukan kepada para nabi sebelummu, maka Kami wahyukan juga kepadamu al-qur’an dengan bahasa arab, agar kamu memberi peringatan kepada penduduk makkah dan manusia-manusia lainnya di sekitarnya. Kamu memberi peringatan kepada mereka tentang hari berkumpul yaitu hari kiamat, yang kehadirannya tidak diragukan. Saat itu manusia terbagi menjadi dua kelompok; satu kubu di surga dan mereka adalah orang-orang yang beriman kepada Allah dan mengikuti apa yang dibawa oleh utusanNya Muhammad , dan satu kelompok lagi di neraka yang membakar, mereka adalah orang-orang yang kafir kepada Allah dan menyelisihi apa yang dibawa oleh rasulullah Muhammad."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Dan sebagaimana telah kami wahyukan kepada para nabi-nabi sebelummu -wahai Rasul-, Kami mewahyukan kepadamu Al-Qur`ān dalam bahasa Arab agar kamu memperingatkan penduduk Makkah dan negeri-negeri Arab di sekitarnya kemudian kepada manusia seluruhnya, dan agar kamu menakuti manusia dengan datangnya hari Kiamat, hari di saat Allah mengumpulkan orang-orang terdahulu sampai yang terkahir di dalam satu dataran untuk diperhitungkan amal perbuatannya dan untuk diberi balasan. Tidak ada keraguan tentang terjadinya hari itu, dan manusia terbagi menjadi dua kelompok; satu kelompok berada di Surga, yaitu orang-orang yang beriman, dan satu kelompok di Neraka, yaitu orang-orang kafir."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "7. Dan sebagaimana Kami memberi wahyu kepada para nabi terdahulu, Kami juga mewahyukan kepadamu berupa al-Qur’an yang berbahasa arab yang fasih, agar kamu memberi peringatan para penduduk Makkah dan seluruh hamba lainnya; memberi peringatan dari azab pada hari kiamat yang mengumpulkan seluruh makhluk, hari yang tidak diragukan kedatangannya. Kemudian pada hari itu para makhluk terbagi menjadi dua golongan; satu golongan di surga dan golongan lainnya di neraka Jahannam yang membara."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. وَكَذٰلِكَ أَوْحَيْنَآ إِلَيْكَ قُرْءَانًا عَرَبِيًّا (Demikianlah Kami wahyukan kepadamu Al Quran dalam bahasa Arab) Yakni dengan bahasa kaummu, sebagaimana Kami mengutus setiap rasul dengan agama kaumnya. لِّتُنذِرَ أُمَّ الْقُرَىٰ( supaya kamu memberi peringatan kepada ummul Qura (penduduk Mekah)) Ummul Qura yakni kota Makkah. Dan yang dimaksud adalah agar Rasulullah memberi peringatan kepada penduduk kota Makkah. وَمَنْ حَوْلَهَا(dan penduduk (negeri-negeri) sekelilingnya) Yakni agar kamu memperingatkan mereka dari azab. وَتُنذِرَ يَوْمَ الْجَمْعِ(serta memberi peringatan (pula) tentang hari berkumpul (kiamat)) Yakni hari kiamat. Sebab hari itu sebagai waktu dikumpulkannya para makhluk dan dikumpulkannya antara arwah dengan tubuhnya. لَا رَيْبَ فِيهِ ۚ( yang tidak ada keraguan padanya) Yakni tanpa ada keraguan. فَرِيقٌ فِى الْجَنَّةِ وَفَرِيقٌ فِى السَّعِيرِ(Segolongan masuk surga, dan segolongan masuk Jahannam) Yakni mereka semua akan berkumpul di padang mahsyar kemudian saling berpisah sesuai dengan tempat yang ditentukan bagi mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Itulah perumpamaan pemberian wahyu kepada para nabi sebelumnya. Kami mewahyukan Al-Qur’an yang berbahasa Arab untuk disampaikan kepada kaummu, supaya kamu memberi peringatan penduduk Mekah dan seluruh orang-orang di sekitarnya dengan Al-Qur’an dan kamu memberi peringatan tentang hukuman hari kiamat yang mana para makhluk dikumpulkan untuk dihisab dan dibalas. Al-Qur’an itu tidak ada keraguan di dalamnya. Di dalamnya manusia digolongkan menjadi dua golongan, yaitu golongan yang masuk surga dan golongan yang masuk neraka selama-lamanya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Demikianlah} seperti apa yang Kami wahyukan kepada para nabi sebelummu {Kami mewahyukan kepadamu Al-Qur’an yang berbahasa Arab agar kamu memberi peringatan kepada (penduduk) Ummul Qurā} untuk memperingatkan pendidik Mekkah dengan azab {dan penduduk di sekelilingnya serta memberi peringatan tentang hari berkumpul} hari kiamat dimana Allah mengumpulkan pada hari itu orang-orang terdahulu dan orang-orang yang akan datang di satu dataran {yang tidak diragukan keberadaannya} yang tidak diragukan kejadiannya {Segolongan di surga dan segolongan masuk neraka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7. Kemudian Allah menyebutkan karuniaNya kepada RasulNya dan kepada manusia pada umunya, di mana Allah telah menurunkan “al-Quran dalam Bahasa arab,” yang sangat jelas lafazh-lafazh dan maknanya, “supaya kamu memberi peringatan kepada ummul Qura,” maksudnya, Makkah al-Mukarramah “dan penduduk sekelilingnya” dari perkampungan-perkampungan orang-orang Arab, kemudian pemberi peringatan ini terus merambat ke seluruh manusia, “serta memberi peringhatan pula” kepada manusia “tentang hari berkumpul,” yang pada hari itu Allah menghimpun orang-orang yang terdahulu dan yang datang kemudian. Dan kamu sampaikan kepada mereka bahwa “tidak ada keraguan padanya,” dan manusia pada hari itu terbagi menjadi dua kelompok: satu kelompok “masuk surga,” yaitu orang-orang yang beriman kepada Allah dan membenarkan para Rasul; dan sekelompok lagi “masuk neraka” yaitu berbagai kelompok orang-orang kafir yang mendustakan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syura ayat 7: (Demikianlah) sebagaimana penurunan wahyu ini (Kami wahyukan kepadamu Alquran dalam bahasa Arab supaya kamu memberi peringatan) dengannya, (kepada Umulquraa dan penduduk negeri-negeri sekelilingnya) yaitu penduduk kota Mekah dan semua manusia (serta memberi peringatan pula) kepada manusia (tentang hari berkumpul) yakni hari kiamat, yang pada hari itu semua makhluk dikumpulkan (yang tidak ada keraguan) atau keragu-raguan (padanya. Segolongan) dari mereka (masuk surga dan segolongan yang lain masuk Sa'ir) yakni neraka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah menyebutkan nikmat-Nya kepada Rasul-Nya dan kepada manusia karena telah menurunkan Al Qur’an. Jelas lafaz dan maknanya. Maksudnya, penduduk dunia seluruhnya. Hari Kiamat disebut hari berkumpul karena pada hari itu semua makhluk baik yang terdahulu maupun yang kemudian dikumpulkan. Ketika itu manusia terbagi menjadi dua golongan. Yaitu mereka yang beriman kepada Allah dan membenarkan para rasul-Nya. Mereka adalah orang-orang kafir yang mendustakan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syura Ayat 7",
    "description": "Dan demikianlah kami wahyukan Al-Qur'an kepadamu, wahai nabi Muhammad dalam bahasa arab, yaitu bahasa yang engkau gunakan bersama kaummu agar engkau memberi peringatan kepada penduduk ibukota, yaitu kota mekah, dan penduduk negeri-negeri di sekelilingnya serta memberi peringatan tentang hari berkumpul, hari kiamat, yang tidak diragukan adanya oleh orang-orang beriman. Pada hari itu nanti segolongan di antara manusia masuk surga karena keimanan dan amal saleh yang mereka lakukan dan segolongan yang lain masuk neraka karena kekafiran dan kedurhakaan mereka terhadap Allah. 8. Dan sekiranya Allah menghendaki niscaya dia jadikan mereka satu umat saja, dengan menjadikan mereka semua beriman atau kafir seluruhnya dan tidak memberi mereka kesempatan untuk memilih. Tetapi dia memasukkan orang-orang yang dia kehendaki ke dalam rahmat-Nya, yaitu surga-Nya atas dasar anugerah-Nya dan memasukkan mereka yang kafir ke dalam neraka lantaran kekafiran mereka. Dan orang-orang yang zalim, yang telah melanggar tuntunan dan menyekutukan-Nya tidak ada bagi mereka seorang pelindung pun yang dapat melindungi mereka dari azab Allah dan seorang penolong pun yang dapat menolong mereka dari siksaan api neraka."
  }
]