[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sekiranya Allah berkenan mengumpulkan makhlukNya di atas petunjuk dan menjadikan mereka di atas satu agama yang dinaungi hidayah niscaya Dia melakukannya, akan tetapi Allah hendak memasukkan siapa yang dikehendakiNya dari makhluk-makhluk pilihannya ke dalam rahamatNya. Sedangkan orang-orang yang menzhalimi diri mereka sendiri dengan berbuat kesyirikan, tidak memiliki pelindung yang mengurusi perkara-perkara mereka di hari kiamat dan tidak memiliki penolong yang menolong mereka dari siksaa Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Seandainya Allah menghendaki untuk menjadikan mereka satu umat dengan memeluk agama Islam, niscaya Allah menjadikan mereka satu umat dalam Islam dan memasukkan mereka semua ke dalam Surga. Akan tetapi hikmah Allah menggariskan bahwa Dia memasukkan yang dikehendaki-Nya ke dalam Islam dan memasukkannya ke dalam Surga. Dan orang-orang yang zalim terhadap diri mereka sendiri dengan melakukan kekufuran dan kemaksiatan tidaklah memiliki pelindung yang mampu melindungi mereka dan tidak pula memiliki penolong yang mampu menolong mereka dari azab Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "8. Seandainya Allah menghendaki niscaya Dia akan menjadikan seluruh manusia mendapat petunjuk, akan tetapi Dia menghendaki untuk hanya memasukkan ke dalam rahmat-Nya orang-orang beriman yang Dia kehendaki; adapun orang-orang yang menzalimi diri mereka sendiri dengan kekafiran amak mereka tidak memiliki penolong selain Allah yang mengatur urusan mereka, dan tidak pula memiliki orang yang dapat menyelamatkan mereka dari azab."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. وَلَوْ شَآءَ اللهُ لَجَعَلَهُمْ أُمَّةً وٰحِدَةً (Dan kalau Allah menghendaki niscaya Allah menjadikan mereka satu umat (saja)) Yakni menjadi pemeluk satu agama, baik itu di atas petunjuk maupun di atas kesesatan. Namun mereka terpecah-pecah dalam agama yang berbeda-beda sebagai kehendak Allah yang telah ditetapkan. وَلٰكِن يُدْخِلُ مَن يَشَآءُ فِى رَحْمَتِهِۦ ۚ (tetapi Dia memasukkan orang-orang yang dikehendaki-Nya ke dalam rahmat-Nya) Yakni ke dalam agama yang benar yaitu Islam. وَالظّٰلِمُونَ مَا لَهُم مِّن وَلِىٍّ وَلَا نَصِيرٍ(Dan orang-orang yang zalim tidak ada bagi mereka seorang pelindungpun dan tidak pula seorang penolong) Yakni orang-orang musyrik tidak memiliki penolong dan pelindung yang dapat menolong mereka dari azab pada saat itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8. Jika saja berkehendak, niscaya Allah sudah menjadikan seluruh manusia berpegang pada satu agama saja, ada yang diberi petunjuk atau ada yang tersesat. Akan tetapi karena bosan, mereka terpisah menjadi berbeda-beda. Orang-orang yang beriman, akan dimasukkan dalam rahmatNya dengan diberi petunjuk dan pertolongan supaya melakukan ketaatan. Adapun orang-orang kafir, maka mereka tidak akan menemukan penolong yang dapat membantu urusan-urusan mereka dan melindungi mereka dari azab."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Seandainya Allah menghendaki, niscaya Dia akan menjadikan mereka umat yang satu} pemeluk satu agama {Akan tetapi Dia memasukkan orang-orang yang Dia kehendaki ke dalam rahmatNya. Dan orang-orang zalim itu tidak memiliki pelindung dan tidak pula penolong"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8. “Dan” meskipun itu semua, kalau Allah menghendaki, niscaya Dia menjadikan manusia “satu umat saja,” semuanya di atas petunjuk. Sebab Dial ah Yang Kuasa, tidak ada sesuatu pun yang sukar bagiNya. Akan tetapi Dia hendak memasukkan ke dalam rahmatNya orang-orang yang dikehendakiNya di antara manusia-manusia pilihanNya. Adapun orang-orang yang zhalim yang tidak bisa beramal shalih maka mereka adalah orang-orang yang dihalangi dari rahmatNya. Mereka sama sekali tidak akan mendapatkan seorang pelindung pun yang dapat melindungi mereka yang bisa mewujudkan impian mereka, dan tidak ada pula seorang penolong yang menolak bahaya dari mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syura ayat 8: (Dan kalau Allah menghendaki niscaya Allah menjadikan mereka satu umat) artinya memeluk satu agama, yaitu agama Islam (tetapi Dia memasukkan orang-orang yang dikehendaki-Nya ke dalam rahmat-Nya. Dan orang-orang yang lalim) yaitu orang-orang kafir (tidak ada bagi mereka seorang pelindung pun dan tidak pula seorang penolong) yang dapat menolak azab Allah dari diri mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Di atas petunjuk, karena Dia mampu melakukannya, akan tetapi Dia ingin memasukkan ke dalam rahmat-Nya orang yang Dia kehendaki di antara makhluk-Nya. Yang tidak cocok memperoleh kebaikan, maka mereka terhalang dari mendapatkan rahmat. Sehingga tidak ada yang membimbing mereka memperoleh hal yang dicintai. Sehingga tidak ada yang menghindarkan sesuatu yang tidak disukai dari mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syura Ayat 8",
    "description": "Dan sekiranya Allah menghendaki niscaya dia jadikan mereka satu umat saja, dengan menjadikan mereka semua beriman atau kafir seluruhnya dan tidak memberi mereka kesempatan untuk memilih. Tetapi dia memasukkan orang-orang yang dia kehendaki ke dalam rahmat-Nya, yaitu surga-Nya atas dasar anugerah-Nya dan memasukkan mereka yang kafir ke dalam neraka lantaran kekafiran mereka. Dan orang-orang yang zalim, yang telah melanggar tuntunan dan menyekutukan-Nya tidak ada bagi mereka seorang pelindung pun yang dapat melindungi mereka dari azab Allah dan seorang penolong pun yang dapat menolong mereka dari siksaan api neraka. 9. Atau apakah mereka mengambil pelindung-pelindung yang mereka sembah selain dia, yang dapat melindungi dan menolong mereka dari azab-Nya dan siksaan api neraka' padahal Allah, dialah satu-satunya yang menjadi pelindung yang sebenarnya. Dan dia, satu-satunya yang menghidupkan orang yang mati, dan dia pula yang mahakuasa atas segala sesuatu."
  }
]