[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bahkan orang-orang musyrik itu mengangkat pelindung-pelindung selain Allah yang mereka berloyalitas kepada mereka, padahal hanya Allah semata pelindung yang semestinya d cintai oleh hambaNya dengan ibadah dan ketaatan. Sementara Dia mencintai hamba-hambaNya yang beriman dengan mengeluarkan mereka dari kegelpan-kegelapan menuju cahaya dan membantu mereka dalam segala urusan mereka. Dia yang akan menghidupkan orang-orang yang telah mati saat kebangkitan tiba dan Dia maha kuasa atas segala sesuatu, tidak ada sesuatpun yang melemahkanNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Akan tetapi orang-orang musyrik mengambil penolong-penolong selain Allah yang mereka mintai pertolongan, dan Allah adalah Penolong yang sebenarnya, maka selain Dia tidak mampu memberi manfaat ataupun mendatangkan mudarat. Dia lah yang menghidupkan orang-orang yang sudah mati dan membangkitkan mereka untuk perhitungan amal mereka dan untuk pemberian balasan. Dan Dia Mahakuasa atas segala sesuatu, tidak ada sesuatupun yang melemahkan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "9. Allah mengingkari orang-orang musyrik karena mereka tidak menjadikan Allah sebagai pelindung; namun mereka menjadikan pelindung-pelindung selain Allah. Jika mereka menghendaki pelindung, hanya Allah pelindung sesungguhnya; Dia semata yang dapat membangkitkan makhluk yang telah mati, dan Dia Maha Kuasa atas segalanya, tidak ada yang sulit bagi-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. أَمِ اتَّخَذُوا۟ مِن دُونِهِۦٓ أَوْلِيَآءَ ۖ (Atau patutkah mereka mengambil pelindung-pelindung selain Allah?) Yakni ataukah orang-orang kafir mengangkat pelingdung dari berhala-berhala yang mereka sembah agar dapat menolong mereka. فَاللهُ هُوَ الْوَلِىُّ(Maka Allah, Dialah pelindung (yang sebenarnya)) Yakni Dia-lah yang berhak untuk dijadikan pelindung, sebab Dialah yang Maha Pencipta dan Maha Pemberi Rezeki yang dapat memberi mamfaat dan mudharat serta menolong orang yang Dia kehendaki. وَهُوَ (dan Dia) Dan termasuk sifat-Nya adalah يُحْىِ الْمَوْتَىٰ وَهُوَ عَلَىٰ كُلِّ شَىْءٍ قَدِيرٌ (menghidupkan orang-orang yang mati, dan Dia adalah Maha Kuasa atas segala sesuatu) Yakni Dia mampu melakukan segala sesuatu, Dialah yang berhak dituhankan, dan diesakan dalam ibadah, serta dijadikan sebagai pelindung."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9. Bahkan orang-orang musyrik itu meminta pertolongan kepada selain Allah, yaitu para berhala dan semacamnya. Allah adalah penolong bagi orang-orang mukmin. Dialah Dzat yang menghidupkan orang-orang mati dengan membangkitkannya pada hari kebangkitan. Dialah yang Maha Suci lagi sempurna. KekuasaanNya mencakup segala sesuatu. Dialah Dzat yang paling layak untuk disembah, dimintai pertolongan dan dianggap sebagai Tuhan. {Am} bermakna (bal) yang berfungsi untuk berpindah dari kalimat sebelumnya kepada kalimat tentang keingkaran mereka yang meminta pertolongan kepada selain Allah SWT."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ataukah mereka mengambil} ataukah orang-orang musyrik mengambil {pelindung-pelindung selain Dia} selain Allah {Dan Allahlah pelindung. Dia menghidupkan orang-orang mati dan Dia Maha kuasa atas segala sesuatu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9. Dan orang-orang yang mengambil pelindung-pelindung selain Allah, di mana mereka loyal kepada mereka dengan menyembahnya, mereka benar-benar telah melakukan kekeliruan yang jauh, “Allah-lah Pelindung,” yang diloyalitasi oleh hambaNya dengan ibadah dan taat kepadaNya serta bertaqarrub yang mampu ia lakukan. Dan Dia mengatur hamba-hambaNya yang beriman khususnya dengan mengeluarkan mereka dari berbagai kegelapan menuju cahaya, membina mereka dengan kelembutanNya dan memberikan pertolongan kepada mereka dalam semua urusan mereka. “Dan Dia menghidupkan orang-orang yang mati, dan Dia adalah Mahakuasa atas segala sesuatu,” artinya, Dia-lah yang bertindak menghidupkan dan mematikan, terealisasi kehendak dan KuasaNya. Maka Dia lah yang berhak disembah, tiada sekutu bagiNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syura ayat 9: (Atau patutkah mereka mengambil selain-Nya) mengambil berhala-berhala (sebagai pelindung-pelindung) lafal Am adalah Munqathi'ah yang maknanya sama dengan lafal Bal yang menunjukkan makna Intiqal; Hamzahnya atau makna Istifhamnya menunjukkan pengertian ingkar. Maksudnya yang diambil oleh mereka itu bukanlah pelindung-pelindung mereka. (Maka Allah, Dialah Pelindung) Penolong bagi orang-orang Mukmin, huruf Fa di sini hanya untuk Athaf saja (dan Dia menghidupkan orangorang yang mati dan Dia adalah Maha Kuasa atas segala sesuatu.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sungguh, mereka telah berbuat sangat salah sekali. Allah Dialah wali yang sebenarnya, Dia yang membimbing hamba-Nya untuk beribadah kepada-Nya dan menaati-Nya serta untuk mendekatkan diri kepada-Nya dengan taqarrub yang bisa dilakukan, Dia pula yang mengurus hamba-hamba-Nya secara umum dengan pengaturan-Nya dan berlakunya qadar bagi mereka, Dia pula yang mengurus hamba-hamba-Nya yang mukmin secara khusus dengan mengeluarkan mereka dari kegelapan kepada cahaya. Demikian pula mengurus mereka dengan kelembutan-Nya dan membantu mereka dalam semua urusan mereka. Dialah yang mengatur mereka dengan menghidupkan dan mematikan, kehendak dan qadar-Nya berlaku bagi mereka. Dialah Tuhan yang berhak diibadahi satu-satu-Nya, tidak ada sekutu bagi-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syura Ayat 9",
    "description": "Atau apakah mereka mengambil pelindung-pelindung yang mereka sembah selain dia, yang dapat melindungi dan menolong mereka dari azab-Nya dan siksaan api neraka' padahal Allah, dialah satu-satunya yang menjadi pelindung yang sebenarnya. Dan dia, satu-satunya yang menghidupkan orang yang mati, dan dia pula yang mahakuasa atas segala sesuatu. 10. Allah menyatakan kepada seluruh manusia, 'dan apa pun yang kamu perselisihkan padanya tentang sesuatu, termasuk di dalamnya tentang terjadinya kiamat itu, keputusannya terserah kepada Allah karena yang mengetahui tentang semua itu hanyalah dia. Lalu Allah memerintahkan kepada nabi Muhammad untuk menyatakan bahwa yang memiliki sifat-sifat demikian itulah Allah, yang maha esa, tidak ada sekutu bagi-Nya, maha mengetahui tentang segala sesuatu, mahaagung, dan mahakuasa. Dialah tuhanku, pemelihara, pembimbing dan pelindung-ku. Kepada-Nya aku terus-menerus bertawakal dan berserah diri dan kepada-Nya aku terus-menerus kembali untuk bertobat."
  }
]