[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bila kemenangan atas orang orang kafir quraisy telah terwujud bagimu (wahai rasul), dan penaklukan kota Makkah telah terlaksana."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Jika pertolongan Allah untuk agamamu -wahai Rasul- dan kemenangan dari Allah untuk agamamu telah tiba, dan telah terjadi peristiwa penaklukan kota Makkah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1. Hai Muhammad, jika kamu dapat meraih kemenangan dalam melawan musuh dengan pertolongan yang kuat dan tidak terkalahkan, dan jika Allah menolongmu untuk menakhlukkan kota Makkah yang telah Allah janjikan kepadamu beberapa kali, dan kaum musliminpun mengharapkan dan memperkirakannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. اِذَا جَآءَ نَصۡرُ اللّٰهِ وَالۡفَتۡحُۙ‏ (Apabila telah datang pertolongan Allah dan kemenangan) Yakni hai Muhammad, jika pertolongan Allah telah datang kepadamu atas orang-orang yang memusuhimu, yaitu kaum Quraisy; dan kota Makkah telah ditakhlukkan untukmu. Makna (النصر) yakni pertolongan yang dapat mengalahkan musuh. Sedangkan (الفتح) yakni penakhlukan pemukiman para musuh dan hati mereka untuk menerima kebenaran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Keutamaan surah: Di jelaskan dalam hadits Tirmidzi dari Anas bin Malik bahwa surah ini sama dengan seperempat Al-Qur’an, begitu juga surah {Idza Zulzilat} [QS Al-Zal-zalah: 99/1] yang sama dengan seperempat Al-Qur’an. Menurut An-Nasa’I bahwa surah ini adalah surah Al-Qur’an yang terakhir diturunkan. Dan menurut Al-Bazzar dan Al-Baihaqi bahwa surah ini adalah surah yang diturunkan di pertengahan hari-hari Tasyriq, yang dikenal dengan hari berpamitan. Menurut Imam Ahmad dan Ibnu Jarir dari Ibnu Abbas: “Saat surah ini diturunkan Rasulallah SAW bersabda:”Aku mengumumkan kematian diriku” 1. Tatkala pertolongan Allah menjadi nyata bagimu wahai Nabi dan orang-orang mukmin berupa (kemenangan) atas musuh-musuhmu dari suku Quraisy dan penaklukan Mekah. Imam Bukhari dan lainnya mengatakan dari Ibnu Abbas yang menafsiri surah ini untuk Umar dan para sahabat lainnya bahwa surah ini merupakan batas akhir Rasulallah SAW diajari oleh Allah. Allah berfirman: “{Idza Jaa’a Nashrullahi wal fathu} maka itu adalah tanda ajalmu (akan tiba)”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apabila telah datang pertolongan Allah dan kemenangan} fathu Makkah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-3. Dalam surat yang mulia ini terdapat berita gembira dan sekaligus perintah untuk RasulNya pada saat berita gembira itu terwujud, serta terdapat sebuah isyarat dan peringatan akan beberapa hal yang disebabkan olehnya. Berita gembira yang dimaksud adalah berita gembira pertolongan Allah untuk RasulNya, penaklukkan Makkah dan masuknya orang-orang “ke dalam agama Allah dengan berbondong-bondong,” karena kebanyakan dari mereka menjadi pemeluk dan penolongnya setelah sebelumnya mereka memusuhinya. Berita gembira yang disampaikan ini benar-benar terjadi. Sedangkan perintah setelah terwujudnya kemenangan dan penaklukan adalah perintah Allah untuk RasulNya agar bersyukur kepada Allah atas hal itu serta memahasucikan dengan memujiNya dan memohon ampunan padaNya. Dan berkaitan dengan isyarat, terdapat dua isyarat dalam ayat ini: pertama, isyarat bahwa kemenangan akan terus berlangsung bagi Islam dan semakin bertambah manakala terwujud tasbih (memahasucikan) Allah dengan memujiNya dan memohon ampunan padaNya dari RasulNya, karena hal ini termasuk rasa syukur, sebagaimana firman Allah: Dan (ingatlah juga), tatkala Tuhanmu memaklumkan; \"Sesungguhnya jika kamu bersyukur, pasti Kami akan menambah (nikmat) kepadamu, dan jika kamu mengingkari (nikmat-Ku), maka sesungguhnya azab-Ku sangat pedih\". (QS. ibrahim-ayat-7) Dan hal itu telah terwujud di masa Khulafa’ Rasyidin dan generasi setelahnya dari umat ini. Dan pertolongan Allah senantiasa berlangsung hingga Islam mencapai apa yang tidak bisa dicapai oleh agama-agama lain dan banyak orang yang masuk ke dalam Islam dalam jumlah yang belum pernah ada pada agama lain, hingga terjadilah pembangkangan terhadap perintah Allah dalam umat ini sehingga mereka tertimpa perpecahan, ceraiberainya urusan dan terjadilah apa yang terjadi. Meski demikian, umat dan agama ini tetap memiliki rahmat dan kelembutan Allah yang tidak pernah terlintas di benak atau berlalu dalam khayalan. Isyarat kedua adalah dekatnya ajal Rasulullah. Alasannya adalah karena usia beliau adalah usia mulia yang dengannya Allah bersumpah, dan Allah telah memberitahukan bahwa hal-hal utama itu ditutup dengan istighfar seperti shalat, haji, dan lainnya. Allah memerintahkan RasulNya untuk bertahmid dan beristighfar dalam kondisi itu sebagai sebuah isyarat bahwa ajal beliau sudah dekat. Hendaklah beliau mempersiapkan diri untuk bertemu dengan Rabb beliau dan menutup usianya dengan sesuatu paling istimewa yang beliau miliki. Semoga shalawat dan salam terlimpahkan pada beliau. Rasulullah menafsirkan al-Quran dan mengucapkan tasbih dan istighfar dalam shalat. Dan beliau banyak memebacanya dalam ruku dan sujudnya : سُبْحَانَكَ اللَّهُمَّ رَبَّنَا وَبِحَمْدِكَ ، اللَّهُمَّ اغْفِرْ لِى Maha Suci Engkau Ya Allah, Rabb kami, pujian untuk-Mu, ampunilah aku"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Jika datang pertolongan Allah dan kemenangan kepada Rasul-Nya, pertolongan Allah untuk Nabi-Nya yang mendapat perlakuan buruk dari orang-orang kafir dan musyrikin, dan kemenangan saat membuka kota Makkah."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "إِذَا جَاءَ نَصْرُ اللَّهِ وَالْفَتْحُ \" Apabila telah datang pertolongan Allah dan kemenangan.\" Pembicaraan dalam ayat ini tertuju kepada Nabi Shallallaahu 'alaihi wa sallam. نَصْرُ اللَّهِ \"Pertolongan Allah\" Pertolongan di sini adlah Allah memberikan kekuasaan kepada seseorang dari musuhnya, di mana ia menguasainya, merendahkan dan mengendalikannya. Kemenangan adalah kesenangan terbesar yang terdapat pada seorang hamba pada amalan-amalannya, karena orang yang menang akan memperoleh semangat besar, kegembiraan dan kesenangan, akan tetapi jika di atas kebenaran maka ini adalah kebaikan. Sebagaimana dalam hadits dari Nabi Shallallaahu 'alaihi wa sallam bahwa beliau bersabda: نُصِرْتُ بِالرُّعْبِ مَسِيْرَةَ شَهْرٍ \"Aku diberikan pertolongan berupa rasa takut (musuh padaku) sejarang satu bulan\"(1) Maknanya: Bahwa Musuhnya takut pada beliau apabila jarak antara beliau dengan musuhnya sejarak satu bulan. Rasa takut (terancam) adalah sesuatu yang paling mengacaukan musuh, karena siapa saja yang hatinya dihantui rasa takut maka tidak akan mampu teguh selamanya. Ia akan terbang dengan tiupan angin. Firman Allah إِذَا جَاءَ نَصْرُ اللَّهِ وَالْفَتْحُ \" Apabila telah datang pertolongan Allah \" Maknanya: Pertolongan Allah padamu atas musuhmu. وَالْفَتْحُ \"Dan kemenangan\" diathafkan kepada an-Nashr (pertolongan) padahal kedudukan kemenangan dari pertolongan adalah sebagai penyebabnya. Dan ini adalah termasuk bab pengathafan sesuatu yang lebih khusus (kemenangan) kepada yang umum (pertolongan) seperti dalam firman Allah Ta'ala: تَنَزَّلُ الْمَلَائِكَةُ وَالرُّوحُ فِيهَا \" Pada malam itu turun malaikat-malaikat dan malaikat Jibril \"(QS. Al-Qadr: 4) Maknanya: Bahwa pada malam lailatul qadr, Malaikat jibril adalah di antara malaikat-malaikat, disebutkan secara khusus karena kemuliaannya ال pada kata الفتح (al-Fathu) berfungsi untuk al-'ahdu adz-Dzihniy (menentukan kata yang sudah ditangkap secara spontan oleh benak pendengar yang dimaksud tertentu). Maknanya kemenangan yang sudah kalian ketahui di benak-benak kalian, yaitu kemenangan pada saat fathu makkah. Fathu makkah terjadi pada bulan ramadan, bulan ke delapan hijriyah. Sebabnya: Nabi shallallaahu 'alaihi wa sallam, ketika beliau membuat pejanjian damai dengan Quraisy pada perjanjian hudaibiyah pada tahun ke enam, dengan perjanjian yang sudah masyhur. Quraisy mengkhianati perjanjian tersebut, maka Nabi shallallaahu 'alaihi wa sallam menyerang mereka, keluar menuju mereka dari Madinah beserta sepuluh ribu pasukan, beliau keluar dengan sembunyi sembunyi dan mengatakan: اَللَّهُمَّ عَمِّ أَخْبَارَنَا عَنْهُمْ \"Ya Allah sembunyikanlah berita-berita tentang kami dari mereka\". Maka Beliau tidak menggertak mereka kecuali mereka telah terkepung dan memasuki Mekah pada tanggal dua puluh Ramadhan, tahun delapan hijriyah, dengan dimenangkan, ditolong dan didukung (pertolongan Allah). Sehingga pada akhirnya , orang-orang kuffar berkumpul kepadanya di sekitar ka'bah, beliau berdiri di depan fintunya, orang-orang Quraisy di bawah kuasanya, mereka menungguh tindakan beliau. Lalu beliau memegang kedua sisi pintu dan mengatakan: يَامَعْشَرَ قُرَيْشٍ، مَا تَظُنُّوْنَ أَنِّي فَاعِلٌ بِكُمْ \"Wahai sekalian Quraisy, menurut kalian apa yang akan aku lakukan terhadap kalian \" padahal beliau delapan tahun sebelumnya lari dari mereka, dan sekarang mereka beradai digenggamannya dan di bawah kuasanya, beliau mengatakan: مَا تَظُنُّوْنَ أَنِّي فَاعِلٌ بِكُمْ \" Menurut kalian apa yang akan aku lakukan terhadap kalian \" mereka menjawab: Anda akan memperlakukan kebaikan pada kami, anda saudara yang mulia, dan anak dari saudara yang mulia. Beliau mengatakan: فَإِنِّي أَقُوْلُ لَكُمْ كَمَا قَالَ يُوسُفُ لِإِخْوَتِهِ: لَا تَثْرِيبَ عَلَيْكُمُ الْيَوْمَ يَغْفِرُ اللَّهُ لَكُمْ اِذْهَبُوا فَأَنْتُمْ الطُّلَقَاء \"Sesungguhnya aku akan mengatakan kepada kalian sebagaimana Yusuf mengatakan kepada saudara-saudaranya: \" Pada hari ini tak ada cercaan terhadap kamu, mudah-mudahan Allah mengampuni (kamu),\"(QS. Yusuf: 92) Pergilah, kalian bebas! \"(2) Beliau memaafkan mereka, Kemenangan ini Allah beri nama dengan kemenangan yang nyata, Allah Ta'ala berfirman: إِنَّا فَتَحْنَا لَكَ فَتْحًا مُبِينًا \" Sesungguhnya Kami telah memberikan kepadamu kemenangan yang nyata,\"(QS. Al-Fath: 1) Maknanya: Jelas, besar nyata. (1) Dikeluarkan Bukhari (335) dan Muslim (521) dari hadits Jabir radhiyallaahu 'anhu. (2) Dikeluarkan Ath-Thabariy dalam Tarikh ath-Thabariy (2/161) dinyatakan dha'if oleh al-Albaniy dalam adh-Dha'iifah (1163)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nasr ayat 1: Surat ini dimulai dengan kabar gembira untuk Nabi ﷺ dengan penaklukan (pembebasan) besar, dan ia adalah penaklukan Mekkah, dimana Allah berkata : Jika Allah tolong engkau wahai Nabi ﷺ atas musuh-musuhmu, dan engkau melihat musuh-musuhmu ditaklukkan dan kemudian Allah telantarkan mereka, Allah bukakan Mekkah bagimu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dalam surah ini terdapat kabar gembira, perintah kepada Rasul-Nya ketika memperoleh kabar gembira itu, isyarat dan pemberitahuan yang akan terjadi setelahnya. Kabar gembira itu adalah pertolongan Allah kepada Rasul-Nya shallallahu 'alaihi wa sallam, penaklukkan Mekah dan masuknya manusia secara berbondong-bondong kepada agama Allah, yakni banyak yang menjadi pemeluk agamnya dan pengikutnya setelah sebelumnya sebagai musuhnya, dan kabar gembira ini pun terjadi. Setelah hal itu terjadi, maka Allah Subhaanahu wa Ta'aala memerintahkan Rasul-Nya shallallahu 'alaihi wa sallam untuk bersyukur kepada Tuhannya terhadap hal itu, bertasbih dengan memuji-Nya dan meminta ampunan kepada-Nya. Sedangkan isyarat yang ada di sana ada dua isyarat: Pertama, isyarat bahwa pertolongan Allah itu akan terus berlanjut kepada agama ini dan akan bertambah ketika dilakukan tasbih sambil memuji-Nya dan beristighfar dari Beliau, karena hal ini termasuk syukur, sedangkan Allah Subhaanahu wa Ta'aala telah berjanji, bahwa jika manusia bersyukur, maka Dia akan menambah nikmat-Nya, dan hal ini terbukti, seperti yang terlihat di zaman para khulafa’ raasyidin dan setelahnya bahwa pertolongan Allah Subhaanahu wa Ta'aala senantiasa berlanjut kepada umat ini, sehingga agama Islam telah sampai kepada puncaknya yang tidak dapat ditandingi oleh agama-agama selainnya, dan telah masuk ke dalamnya manusia dalam jumlah yang banyak sampai terjadilah pada umat ini penyimpangan kepada perintah Allah, maka Allah menguji mereka dengan terpecah belahnya kalimat mereka dan terjadilah apa yang terjadi. Meskipun demikian, untuk umat dan agama ini ada rahmat dan kelembutan Allah Subhaanahu wa Ta'aala yang tidak disangka-sangka. Kedua, isyarat bahwa ajal Rasulullah shallallahu 'alaihi wa sallam telah semakin dekat. Alasannya adalah bahwa umur Beliau adalah umur yang utama, dan sudah maklum bahwa hal-hal yang utama ditutup dengan istighfar seperti shalat, haji, dsb. Maka Allah Subhaanahu wa Ta'aala memerintahkan Rasul-Nya shallallahu 'alaihi wa sallam memuji dan beristighfar dalam keadaan seperti ini sehingga terdapat isyarat bahwa ajalnya hampir tiba, oleh karena itu hendaknya Beliau bersiap-siap untuk bertemu Tuhannya dan mengakhiri umurnya dengan yang paling utama yang dapat Beliau lakukan. Oleh karena itulah, Beliau menakwilkan surah itu dan banyak mengucapkan dalam ruku’ dan sujudnya, “Subhaanakallahumma wabihamdika Allahummaghfirliy.” (artinya: Mahasuci Engkau yang Allah dan dengan memuji-Mu. Ya Allah, ampunilah aku). Kepada Nabi-Nya shallallahu 'alaihi wa sallam terhadap musuh-musuhnya. Yakni fat-hu (penaklukkan) Mekah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nasr Ayat 1",
    "description": "Wahai nabi Muhammad, apabila telah datang pertolongan Allah kepadamu dan pengikutmu dalam menghadapi kaum kafir quraisy, dan telah datang pula kemenangan kepadamu dengan penaklukan mekah menjadi kota yang suci kembali dari kesyirikan dan kekafiran, 2. Dan engkau lihat manusia dari seluruh penjuru jazirah arab berbondong-bondong masuk agama Allah, yakni agama islam, setelah sebelumnya mereka masuk islam secara perorangan, ."
  }
]