[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kamu menyaksikan orang-orang dalam jumlah besar masuk islam secara berkelompok-kelompok."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Dan engkau melihat manusia masuk ke dalam agama Islam secara berbondong-bondong."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "2. Dan setelah penakhlukkan besar ini banyak orang yang akan menyatakan masuk Islam secara berbondong-bondong, dan kamu akan menyaksikannya secara langsung."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. وَرَاَيۡتَ النَّاسَ يَدۡخُلُوۡنَ فِىۡ دِيۡنِ اللّٰهِ اَفۡوَاجًا (dan kamu lihat manusia masuk agama Allah dengan berbondong-bondong) Setelah Rasulullah berhasil menakhlukkan kota Makkah, orang-orang Arab berkata: “Apa yang menjadikan Muhammad dapat mengalahkan penduduk Baitul haram, padahal Allah telah menolong mereka dari pasukan gajah; sungguh dia berada di atas kebenaran, dan kalian tidak akan mampu melawannya.” Kemudian banyak sekali dari mereka yang masuk Islam, setelah sebelumnya mereka hanya masuk satu persatu atau dua orang dua orang, kemudian menjadi satu kabilah masuk Islam seluruhnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Kamu melihat manusia dari bangsa Arab dan bangsa lainnya masuk Islam secara berbondong-bondong, seperti penduduk Mekah, Thaif, Yaman, Bani Hawazin dan suku-suku Arab."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan kamu melihat manusia berbondong-bondong masuk agama Allah} berturut-turut"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-3. Dalam surat yang mulia ini terdapat berita gembira dan sekaligus perintah untuk RasulNya pada saat berita gembira itu terwujud, serta terdapat sebuah isyarat dan peringatan akan beberapa hal yang disebabkan olehnya. Berita gembira yang dimaksud adalah berita gembira pertolongan Allah untuk RasulNya, penaklukkan Makkah dan masuknya orang-orang “ke dalam agama Allah dengan berbondong-bondong,” karena kebanyakan dari mereka menjadi pemeluk dan penolongnya setelah sebelumnya mereka memusuhinya. Berita gembira yang disampaikan ini benar-benar terjadi. Sedangkan perintah setelah terwujudnya kemenangan dan penaklukan adalah perintah Allah untuk RasulNya agar bersyukur kepada Allah atas hal itu serta memahasucikan dengan memujiNya dan memohon ampunan padaNya. Dan berkaitan dengan isyarat, terdapat dua isyarat dalam ayat ini: pertama, isyarat bahwa kemenangan akan terus berlangsung bagi Islam dan semakin bertambah manakala terwujud tasbih (memahasucikan) Allah dengan memujiNya dan memohon ampunan padaNya dari RasulNya, karena hal ini termasuk rasa syukur, sebagaimana firman Allah: Dan (ingatlah juga), tatkala Tuhanmu memaklumkan; \"Sesungguhnya jika kamu bersyukur, pasti Kami akan menambah (nikmat) kepadamu, dan jika kamu mengingkari (nikmat-Ku), maka sesungguhnya azab-Ku sangat pedih\". (QS. ibrahim-ayat-7) Dan hal itu telah terwujud di masa Khulafa’ Rasyidin dan generasi setelahnya dari umat ini. Dan pertolongan Allah senantiasa berlangsung hingga Islam mencapai apa yang tidak bisa dicapai oleh agama-agama lain dan banyak orang yang masuk ke dalam Islam dalam jumlah yang belum pernah ada pada agama lain, hingga terjadilah pembangkangan terhadap perintah Allah dalam umat ini sehingga mereka tertimpa perpecahan, ceraiberainya urusan dan terjadilah apa yang terjadi. Meski demikian, umat dan agama ini tetap memiliki rahmat dan kelembutan Allah yang tidak pernah terlintas di benak atau berlalu dalam khayalan. Isyarat kedua adalah dekatnya ajal Rasulullah. Alasannya adalah karena usia beliau adalah usia mulia yang dengannya Allah bersumpah, dan Allah telah memberitahukan bahwa hal-hal utama itu ditutup dengan istighfar seperti shalat, haji, dan lainnya. Allah memerintahkan RasulNya untuk bertahmid dan beristighfar dalam kondisi itu sebagai sebuah isyarat bahwa ajal beliau sudah dekat. Hendaklah beliau mempersiapkan diri untuk bertemu dengan Rabb beliau dan menutup usianya dengan sesuatu paling istimewa yang beliau miliki. Semoga shalawat dan salam terlimpahkan pada beliau. Rasulullah menafsirkan al-Quran dan mengucapkan tasbih dan istighfar dalam shalat. Dan beliau banyak memebacanya dalam ruku dan sujudnya : سُبْحَانَكَ اللَّهُمَّ رَبَّنَا وَبِحَمْدِكَ ، اللَّهُمَّ اغْفِرْ لِى Maha Suci Engkau Ya Allah, Rabb kami, pujian untuk-Mu, ampunilah aku"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Dan kamu melihat wahai Rasul oarang-orang dengan berbondong-bondong masuk kedalam islam, mereka datang dari berbagai suku untuk memeluk islam, mereka membait Rasulullah ﷺ sebagai pemimpin dan sebagai rasul utusan Allah, maka apakah dengan pertolongan dan masuknya orang-orang kedalam islam disambut oleh Rasulullah dengan bangga dan kesombongan ? tidak sama sekali beliau menyambut semua itu dengan bersyukur kepada Allah - عز وجل - ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Setelah semua orang-orang mengetahui bahwa kemenangan akhir berada pada Muhammad shallallaahu 'alaihi wa sallam, dan kekuasaan Quraisy dan pengikutnya telah berakhir, maka orang-orang pun يَدْخُلُونَ فِي دِينِ اللَّهِ أَفْوَاجًا \" mereka masuk agama Allah dengan berbondong-bondong,\" Maknanya: bergerombolan setelah sebelumnya mereka masuk satu persatu, dan tidaklah ada seseorang yang masuk islam dalam kondisi-kondisi tertentu kecuali dengan sembunyi-sembunyi, dan mereka saat ini masuk islam dengan berbondong-bondong, bahkan delegasi-delegasi (utusan suku) berdatangan kepada Nabi shallallaahu 'alaihi wa sallam ke madinah dari setiap penjuru, sehingga tahun ke sembilan disebut dengan tahun delegasi."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nasr ayat 2: Kemudian engkau melihat banyak manusia masuk ke dalam islam secara berjamaah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah sebelumnya seorang demi seorang yang masuk Islam. Namun setelah penaklukkan Mekah, maka bangsa Arab dari berbagai penjuru banyak yang datang menemui Beliau menyatakan diri masuk Islam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nasr Ayat 2",
    "description": "Dan engkau lihat manusia dari seluruh penjuru jazirah arab berbondong-bondong masuk agama Allah, yakni agama islam, setelah sebelumnya mereka masuk islam secara perorangan, 3. Maka sebagai ungkapan syukur kepada Allah atas karunia-Nya yang agung itu, bertasbihlah dan sucikanlah tuhanmu dari sifat-sifat yang tak layak bagi-Nya, dan sertailah tasbihmu itu dengan memuji tuhan-Mu yang telah menyokongmu dalam menaklukkan mekah, dan mohonlah ampunan kepada-Nya untukmu dan umatmu. Sungguh, dia maha penerima tobat hamba-hamba-Nya yang bertasbih dan beristigfar. Membaca tasbih, tahmid, dan istighfar adalah cara yang mulia ketika seseorang meraih kesuksesan karena pada hakikatnya Allah-lah yang memberi kesuksesan itu kepadanya, bukan dengan berpesta dan berfoya-foya."
  }
]