[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bila semua itu terjadi, maka bersiaplah untuk bertemu dengan tuhanmu dengan meperbanyak bertasbih dengan memujinya, dan memperbanyak isthigfar kepada NYA, sesungguhnya Dia melimpahkan ampunan NYA kepada orang orang yang bertasbih dan berisighfar, Dia mengampuni mereka,menyayangi mereka dan menerima taubatan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Maka ketahuilah bahwa hal itu adalah pertanda dekatnya akhir dari tugas yang dibebankan kepadamu, maka bertasbihlah dengan memuji Rabbmu, sebagai bentuk rasa syukur kepada-Nya atas nikmat pertolongan dan kemenangan. Dan mohon ampunlah kepada-Nya, sesungguhnya Dia Maha Menerima tobat, yang menerima tobat hamba-Nya dan mengampuni mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "3. Jika kemenangan, penakhlukan, dan masuknya orang-orang ke dalam agama Islam telah terjadi; maka bertasbihlah menyucikan Allah dari segala hal yang tidak layak bagi-Nya, dan bertahmidlah memuji-Nya atas karunia yang telah Dia berikan kepadamu, serta mohonlah ampun kepada-Nya atas segala kekurangan; agar kamu menyiapkan diri untuk berjumpa dengan Allah; dan ketika telah selesai amal-amal ketaatan yang menambah ketinggian derajat, sehingga tidak ada hal lain melainkan meminta kepada Allah untuk mengampuni kekurangannya. Sungguh Allah Maha Pengampun bagi hamba-hamba-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. فَسَبِّحۡ بِحَمۡدِ رَبِّكَ (maka bertasbihlah dengan memuji Tuhanmu) Di sini terkumpul antara tasbih karena hal menakjubkan dari Allah yang terjadi yang sebelumnya belum pernah terbesit dipikirannya maupun dipikiran orang lain; serta tasbih untuk memuji Allah atas kebesaran nikmat dari-Nya dengan pertolongan dan penakhlukan kota Makkah serta masuk Islamnya banyak kabilah dengan berbondong-bondong. وَاسۡتَغۡفِرۡهُ‌ ؔ( dan mohonlah ampun kepada-Nya) Yakni mintalah ampunan dari Allah atas dosamu untuk merendahkan diri di hadapan-Nya dan merendahkan amalanmu. اِنَّهٗ كَانَ تَوَّابًا(Sesungguhnya Dia adalah Maha Penerima taubat) Yakni Dia menerima taubat dan merahmati orang yang memohon ampun kepada-Nya. Imam Bukhari dan lainnya meriwayatkan dari Ibnu Abbas, yang berpendapat tentang surat ini: “ini merupakan ajal Rasulullah yang Allah kabarkan kepadanya, Dia berfirman: اِذَا جَآءَ نَصۡرُ اللّٰهِ وَالۡفَتۡحُۙ‏ (Apabila telah datang pertolongan Allah dan kemenangan) Yakni Ini merupakan tanda ajalmu. فَسَبِّحۡ بِحَمۡدِ رَبِّكَ وَاسۡتَغۡفِرۡهُ اِنَّهٗ كَانَ تَوَّابًا ‌ (maka bertasbihlah dengan memuji Tuhanmu dan mohonlah ampun kepada-Nya Sesungguhnya Dia adalah Maha Penerima taubat)"
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Diriwayatkan dari 'Aisyah ia berkata : Rasulullah sering memperbanyak dalam rukuk dan sujudnya membaca ; { سُبْحَانَكَ اللَّهُمَّ رَبَّنَا وَبِحَمْدِكَ اللَّهُمَّ اغْفِرْ لِي } \"Nabi shallallahu ‘alaihi wa sallam banyak membaca doa ini dalam rukuk dan sujudnya, setelah turun surat An-Nashr. Beliau lakukan demikian, dalam rangka mengamalkan perintah di akhir surat An-Nashr. (HR. Bukhari) 2 ). { فَسَبِّحْ بِحَمْدِ رَبِّكَ وَاسْتَغْفِرْهُ } Menggabungkan antara istighfar dan tasbih; yang didalam istighfar adalah pengampunan dosa, sedangkan dalam tasbih memohon kesempurnaan. 3 ). berapa jarak antara firman Allah : { لَعَلَّكَ بَاخِعٌ نَفْسَكَ أَلَّا يَكُونُوا مُؤْمِنِينَ } \"Boleh jadi kamu (Muhammad) akan membinasakan dirimu, karena mereka tidak beriman\" [ asy-Syu'aro' : 3 ] dan firman Allah : { وَرَأَيْتَ النَّاسَ يَدْخُلُونَ فِي دِينِ اللَّهِ أَفْوَاجًا } \" dan kamu lihat manusia masuk agama Allah dengan berbondong-bondong\" ? tidaklah ia melainkan jarak waktu yang singkat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Maka sucikanlah Allah dan shalatlah kepadaNya sebagai wujud syukur atas nikmatNya dan mintalah ampunan kepadaNya dengan merendahkan diri kepadaNya untuk dirimu dan orang-orang yang mengikutimu yaitu orang-orang mukmin. Sesungguhnya Maha Suci Allah yaitu Dzat yang Maha menerima taubat hamba-hambaNya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{maka bertasbihlah dengan memuji Tuhanmu dan mohonlah ampunan kepadaNya. Sesungguhnya Dia Maha Penerima taubat}"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-3. Dalam surat yang mulia ini terdapat berita gembira dan sekaligus perintah untuk RasulNya pada saat berita gembira itu terwujud, serta terdapat sebuah isyarat dan peringatan akan beberapa hal yang disebabkan olehnya. Berita gembira yang dimaksud adalah berita gembira pertolongan Allah untuk RasulNya, penaklukkan Makkah dan masuknya orang-orang “ke dalam agama Allah dengan berbondong-bondong,” karena kebanyakan dari mereka menjadi pemeluk dan penolongnya setelah sebelumnya mereka memusuhinya. Berita gembira yang disampaikan ini benar-benar terjadi. Sedangkan perintah setelah terwujudnya kemenangan dan penaklukan adalah perintah Allah untuk RasulNya agar bersyukur kepada Allah atas hal itu serta memahasucikan dengan memujiNya dan memohon ampunan padaNya. Dan berkaitan dengan isyarat, terdapat dua isyarat dalam ayat ini: pertama, isyarat bahwa kemenangan akan terus berlangsung bagi Islam dan semakin bertambah manakala terwujud tasbih (memahasucikan) Allah dengan memujiNya dan memohon ampunan padaNya dari RasulNya, karena hal ini termasuk rasa syukur, sebagaimana firman Allah: Dan (ingatlah juga), tatkala Tuhanmu memaklumkan; \"Sesungguhnya jika kamu bersyukur, pasti Kami akan menambah (nikmat) kepadamu, dan jika kamu mengingkari (nikmat-Ku), maka sesungguhnya azab-Ku sangat pedih\". (QS. ibrahim-ayat-7) Dan hal itu telah terwujud di masa Khulafa’ Rasyidin dan generasi setelahnya dari umat ini. Dan pertolongan Allah senantiasa berlangsung hingga Islam mencapai apa yang tidak bisa dicapai oleh agama-agama lain dan banyak orang yang masuk ke dalam Islam dalam jumlah yang belum pernah ada pada agama lain, hingga terjadilah pembangkangan terhadap perintah Allah dalam umat ini sehingga mereka tertimpa perpecahan, ceraiberainya urusan dan terjadilah apa yang terjadi. Meski demikian, umat dan agama ini tetap memiliki rahmat dan kelembutan Allah yang tidak pernah terlintas di benak atau berlalu dalam khayalan. Isyarat kedua adalah dekatnya ajal Rasulullah. Alasannya adalah karena usia beliau adalah usia mulia yang dengannya Allah bersumpah, dan Allah telah memberitahukan bahwa hal-hal utama itu ditutup dengan istighfar seperti shalat, haji, dan lainnya. Allah memerintahkan RasulNya untuk bertahmid dan beristighfar dalam kondisi itu sebagai sebuah isyarat bahwa ajal beliau sudah dekat. Hendaklah beliau mempersiapkan diri untuk bertemu dengan Rabb beliau dan menutup usianya dengan sesuatu paling istimewa yang beliau miliki. Semoga shalawat dan salam terlimpahkan pada beliau. Rasulullah menafsirkan al-Quran dan mengucapkan tasbih dan istighfar dalam shalat. Dan beliau banyak memebacanya dalam ruku dan sujudnya : سُبْحَانَكَ اللَّهُمَّ رَبَّنَا وَبِحَمْدِكَ ، اللَّهُمَّ اغْفِرْ لِى Maha Suci Engkau Ya Allah, Rabb kami, pujian untuk-Mu, ampunilah aku"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Begitulah seharusnya yang dilakukan setiap muslim bila mendapatkan pertolongand dari Allah, menyambut pertolongan itu dengan penuh ketenangan, memperbanyak tasbih dan istighfar, dan menjauhkan dari dirinya sifat berbangga-bangga dan sombong, sebagaimana yang dilakukan oleh orang-orang kafir. { فَسَبِّحْ } Sucikannlah nama tuhanmu dari segala bentuk kesyirikan, { بِحَمْدِ رَبِّكَ } sucikanlah dengan memujinya : سبحان الله , والحمد لله , ولااله الا الله , والله اكبر , bertasbihlah dan pujilah tuhanmu dengan bacaan tersebut,. { وَاسْتَغْفِرْهُ ۚ} Dan memohonlah kepada tuhanmu ampunan dari dosa, ampunan dari kecerobohan, ampunan dari kesalahan keci dan besar, jika Rasulullah diperintahkan untuk beristighfar kepada tuhannya, maka perintah itu lebih diwajibkan bagi kita sebagai ummatnya, rasulullah diperintahkan oleh tuhannya untuk memohon ampun, padaha Rasulullah ﷺ telah diampuni dosa-dosanya baik yang telah berlalu maupun yang akan datang, Rasulullah ﷺ adalah hamba Allah yang paling sempurna ibadahnya, dosa-dosanya telah diampuni, hamba Allah yang paling banyak dzikirnya, dengan segala keutamaan dan kemualiaan beliau masih butuh dengan dzikir dan istighfar kepada Allah, maka terlebih lagi kita sebagai umatnya yang tidak mendapatkan jaminan surga dari Allah - عز وجل - . Dirawatkan bahwasanya surah ini merupakan isyarat akan dekatnya ajal Rasulullah ﷺ , karena surah ini turun pada hari kedua tasyriq pada haji wada', yaitu haji terakhir yang dilakukan oleh Rasulullah ﷺ , pada saat itu beliau mengetahui dekatnya ajal. Suatu ketika Umar bin khattab - رضي الله عنه - bermaksud untuk menguji sahabat-sahat Nabi tentang surah ini, diapun mengumpulkan orang penghuni badr, juga para tetua sahabat, Umar mengumpulkan beliau disuatu majlis, dan bersama beliau sahabat Ibnu Abbas yang masih berumur muda, maka diantara sahabat lainnya takjub dengan Ibnu abbas, bagaimana mungkin anak kecil ini ikut bergabung dalam majlis yang semua adalah orang dewasa, kenapa Umar tidak mengikutkan anak-anak kami.. tapi mengikutkan ibnu abbas dalam majlsi ini ?! Umar - رضي الله عنه - bermaksud mengabarkan kepada mereka tentang saabat kecil ini, beliau ingin menyampaikan keutamaan yang ada pada diri ibnu abbas yang Allah anugerahkan kepada beliau, Umar pun berkata kepada sahabat : \"apa yang kalian ketahui tentag surah ini ? yakni surah An-Nasr , Sebagian dari mereka berkata : Allah memerintahkan kita apabila pertolongan-Nya datang agar kami bertasbih dan bersitghfar dan bertahmid memuji-Nya, dan sebagian lainnya diam tidak berkata apa-apa, kemudian Umar bertanya kepada Ibnu Abbas : Bagaimana menurutmu wahai Ibnu Abbas ? , Ibnu Abbas berkata : Surah ini adalah isyarat dekatnya ajal Rasulullah ﷺ , yakni Allah telah menyempurnakan pertolongannya kepada Muhammad ﷺ , maka setelah itu akan datang ajal menjemput, maka dari itu sahabat pun mengetahui keutamaan dan keistimewaan Ibnu Abbas yang merupakan orang yang paling cerdas diantara sahabat. { إِنَّهُ كَانَ تَوَّابًا } Beristghfarlah kepada tuhanmu sesungguhnya dia maha pengampun segala dosa dan kesalahan."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Allah 'Azza Wa Jalla berfirman, jika engkau melihat ciri tersebut; فَسَبِّحْ بِحَمْدِ رَبِّكَ وَاسْتَغْفِرْهُ \" maka bertasbihlah dengan memuji Tuhanmu dan mohonlah ampun kepada-Nya. Sesungguhnya \" Jawaban yang akan terbersit, akan dikatakan, maka bersyukurlah kepada Allah atas nikmat tersebut dan pujilah Allah, akan tetap فَسَبِّحْ بِحَمْدِ رَبِّكَ وَاسْتَغْفِرْهُ \" maka bertasbihlah dengan memuji Tuhanmu dan mohonlah ampun kepada-Nya. Sesungguhnya \" Yang semisal dengan ini adalah firman Allah Ta'ala: إِنَّا نَحْنُ نَزَّلْنَا عَلَيْكَ الْقُرْآنَ تَنْزِيلًا (23) فَاصْبِرْ لِحُكْمِ رَبِّكَ \" Sesungguhnya Kami telah menurunkan Al Qur'an kepadamu (hai Muhammad) dengan berangsur-angsur. Maka bersabarlah kamu untuk (melaksanakan) ketetapan Tuhanmu,\" Yang terbersit akan dijawab dengan perintah bersyukur kepada Rabbmu atas turunnya Al-Quran dan laksanakan hak Al-Quran, tetapi Allah berfirman: فَاصْبِرْ لِحُكْمِ رَبِّكَ \" Maka bersabarlah kamu untuk (melaksanakan) ketetapan Tuhanmu,\" sebagai pemberitahuan bahwa beliau akan memperolah gangguan karena menyampaikan ak-Quran dan menyebarkannya di tengah umat ini. فَسَبِّحْ بِحَمْدِ رَبِّكَ وَاسْتَغْفِرْهُ \" maka bertasbihlah dengan memuji Tuhanmu dan mohonlah ampun kepada-Nya. \" Jika dicermati maka akan Nampak hikmahnya. Maknanya: Bahwa jika telah datang pertolongan Allah dan kemenangan maka ajalmu telah dekat, dan tidaklah tersisa untukmu melainkan bertasbih dengan memuji Tuhanmu dan beristighfar فَسَبِّحْ بِحَمْدِ رَبِّكَ \" maka bertasbihlah dengan memuji Tuhanmu \" Maknanya: bertasbihlah dengan tasbih yang diiringi dengan pujian. Sedangkan maksud at-tasbih: adalah mensucikan Allah Ta'ala dari apa yang tidak pantas dengan kemuliaan-Nya, sedangkan pujina adalah memuji dengan menyebut kesempurnaan disertai kecintaan dan pengagungan, kumpulkanlah antara pensucian dan pujian وَاسْتَغْفِرْهُ \" dan mohonlah ampun kepada-Nya. \" Mintalah ampunan kepada-Nya. Allah Ta'ala memerintahkannya dengan dua perintah: Perintah pertama: Pensucian yang diiringi dengan pujian. Kedua: Beristighfar, Istighfar adalah memohon pengampunan. Sedangkan pengampunan adalah Allah Ta'ala menutupi dosa-dosa hamba-Nya disertai penghapusannya, dan dimaafkan. Ini adalah puncak yang diinginkan seorang hamba. Karena seorang hamba banyak dosa dan membutuhkan pengampunan. Jika Allah tidak melimpahkan rahmat-Nya ia akan binasa. Oleh karenanya Nabi shallallaahu 'alaihi wa sallam bersabda: لَنْ يَدْخُلَ أَحَدٌ مِنْكُمُ الْجَنَّةَ بِعَمَلِهِ \" Tidak akan ada seorang pun dari kalian yang masuk surga dengan amalnya \" para sahabar bertanya: Engkau pun tidak wahai Rasulullah? Beliau menjawab: \" Saya pun tidak, hanya saja Allah melimpahkan kepadaku rahmat-Nya\"(1) karena amalanmu kalau saja anda mau membandingkannya dengan kenikmatan-kenikmatan, maka satu jenis kenikmatan akan meliputi (mengungguli) amalanmu, maka bagaimana bisa menjadi penebus untuk masuk surga. Oleh karenanya, Sebagian yang menyadari menyenandungkan sebuah syai’r: إِذَا كَانَ بِشُكْرِيْ نِعْمَةَ اللهِ نِعْمَةٌ عَلَيَّ لَهُ فِي مِثْلِهَا يَجِبُ الشُّكْرُ Jika saja dengan kesyukuranku terhadap kenikmatan dari Allah adalah kenikmatan padaku, maka baginyalah yang semisal dengannya wajib disyukuri… فَكَيْفَ بُلُوْغُ الشُّكْرِ إِلَّا بِفَضْلِهِ وَإِنْ طَالَتِ الْأَيَامُ وَاتَّصَلَ العُمْرُ Bagaimana bisa memperoleh kesyukuran kecuali atas keutamaan-Nya, meski hari-hari yang Panjang berlalu dan usia terus bersambung… إِنَّهُ كَانَ تَوَّابًا “Sesungguhnya Dia adalah Maha Penerima tobat.” Maknanya: Allah Azza Wa Jalla senantiasa menerima taubat hamba-hamba-Nya. Jika anda memohon pengampunan-Nya maka Dia akan mengampunimu. Ini makna surat ini. Tetapi surat ini mengandung makna yang besar tidak bisa difahami kecuali oleh orang-orang yang cerdas. Oleh kerena itu, Ketika Umar Bin Khathab radhiyallaahu ‘anhu mendengar orang orang mengkritisinya Ketika ia mendekatkan Abdullah Bin Abbas radhiyallaahu ‘anhuma di usianya yang masih kecil, dan tidak menyertakan pemuda-pemuda kaum muslimin lain seusianya. Umar radhiyallah adalah di antara khalifah yang paling adil, hendak menjelaskan kepada manusia bahwa beliau tidaklah memiliki kecondongan kepada Ibnu Abbas sedikit pun. Maka beliau mengumpulkan pembesar-pembesar sahabat muhajirin dan anshar pada suatu hari, sedangkan mereka sedangkan Ibnu Abbas sedang Bersama mereka. Umar bertanya kepada mereka: Apa yang kalian pahami dari surat ini إِذَا جَاءَ نَصْرُ اللَّهِ وَالْفَتْحُ “Apabila telah datang pertolongan Allah dan kemenangan.” Hingga akhir surat? Maka mereka menafsirkannya sebatas yang Nampak pada merka. Sebagian mereka mengatakan: Kita diperintahkan untuk memuji kepada Allah dan meminta ampunan-Nya, jika kita ditolong dan dimenangkan. Sebagian yang lain mengatakan: Kami tidak tahu. Sebagian yang lain tidak mengatakan apapun. Lalu Umar berkata, menurutmu bagaiaman wahai Ibnu Abbas? Ia menjawab: Wahai Amiirul mu’miniin, ini menunjukkan ajalnya Rasulullah shallallaahu ‘alaihi wa sallam, yang Allah beritakan kepadanya إِذَا جَاءَ نَصْرُ اللَّهِ وَالْفَتْحُ “Apabila telah datang pertolongan Allah dan kemenangan.” Kemanangan (ditaklukkannya) mekkah, maka itulah ciri dekatnya ajalmu وَرَأَيْتَ النَّاسَ يَدْخُلُونَ فِي دِينِ اللَّهِ أَفْوَاجًا (2) فَسَبِّحْ بِحَمْدِ رَبِّكَ وَاسْتَغْفِرْهُ إِنَّهُ كَانَ تَوَّابًا (3) “Dan kamu lihat manusia masuk agama Allah dengan berbondong-bondong, maka bertasbihlah dengan memuji Tuhanmu dan mohonlah ampun kepada-Nya. Sesungguhnya Dia adalah Maha Penerima tobat.” Maka Umar meresponnya: Demi Allah aku tidak mengetahui dari ayat itu melainkan seperti pengetahuanmu ini”(2) Dengan demikian, terlihat keutamaan Ibn Abbas dan kelebihannya, dan bahwa ia memiliki kecerdasan dan pengetahuan tentang maksud Allah Ketika surat ini turun, Rasulullah shallallaah ‘alaihi wa sallam menjadi orang yang lebih giat ibadahnya kepada Allah, dan lebih bertakwa kepada-Nya, beliau memperbanyak mengucapkan dalam ruku’ dan sujudnya: سُبْحَانَكَ اللهُمَّ رَبَّنَا وَبِحَمْدِكَ، اَللَّهُمَّ اغْفِرْ لِي “’Maha suci Engkau, Ya Allah, Tuhan kami dan dengan memujimu, Ya Allah ampunilah aku”(3) Maka kita katakan: Maha Suci Engkau ya Allah, Tuhan kami dengan memuji-Mu, Ya Allah ampunilah kami dari dosa-dosa kami, dan keteledoran kami pada urusan kami, teguhkanlah pijakan kaki-kaki kami dan tolonglah kami atas orang-orang kafir. (1) Dikeluarkan Bukhari (5673) dan Muslim (2816) dari hadits Abu Hurairah radhiyallaahu ‘anhu (2) Dikeluarkan Bukhari (4294) dari hadits Ibnu Abbas radhiyallaahu ‘anhuma. (3) Dikeluarkan Al-Bukhari (4967) dan Muslim (484) dari hadits ‘Aisyah radhiyallaahu ‘anha."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nasr ayat 3: Jika engkau melihat hal itu maka bertasbihlah dengan pujian kepada Rabbmu Yang Maha Agung atas nikmat yang diberikan ini. Dan mintalah kepada Allah ampunan bagi dirimu dan bagi umatmu, karena sesungguhnya Allah banyak menerima taubat dan rahmatnya agung bagi hamba-hamba yang beriman. Ketika Allah taklukkan Mekkah, maka terbukalah tali kekang dimana kabilah-kabilah (sebelumnya) melarang (manusia) masuk islam; Karena kabilah-kabilah arab mengetahui, barangsiapa yang masuk islam akan menjadi musuh penduduk Mekkah. Maka ketika Allah taklukkan Mekkah, tidak ada perasaan takut seorangpun dari kabilah-kabilah yang menentang quraisy. Oleh karenanya banyak dari kabilah arab yang mengikuti dan mengikrarkan islam, dengan ini dinamakan tahun jama’ah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan turunnya surah ini diketahui, bahwa ajal Beliau telah semakin dekat; penaklukkan Mekkah terjadi pada bulan Ramadhan tahun ke-8 Hijriah, sedangkan wafatnya Beliau shallallahu 'alaihi wa sallam pada bulan Rabi’ul Awwal pada tahun ke-11 Hijriah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nasr Ayat 3",
    "description": "Maka sebagai ungkapan syukur kepada Allah atas karunia-Nya yang agung itu, bertasbihlah dan sucikanlah tuhanmu dari sifat-sifat yang tak layak bagi-Nya, dan sertailah tasbihmu itu dengan memuji tuhan-Mu yang telah menyokongmu dalam menaklukkan mekah, dan mohonlah ampunan kepada-Nya untukmu dan umatmu. Sungguh, dia maha penerima tobat hamba-hamba-Nya yang bertasbih dan beristigfar. Membaca tasbih, tahmid, dan istighfar adalah cara yang mulia ketika seseorang meraih kesuksesan karena pada hakikatnya Allah-lah yang memberi kesuksesan itu kepadanya, bukan dengan berpesta dan berfoya-foya. 1. Karena kebenciannya kepada nabi dan penentangannya terhadap dakwah beliau dengan cara yang menyakitkan, maka celaka dan binasalah kedua tangan abu lahab yakni diri ab' lahab, yang bernama 'abdul 'uzz' bin 'abdul muttalib; dan benar-benar binasa dia!."
  }
]