[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-3. apabila Hari Kiamat tiba, saat itu tidak seorang pun yang mendustakannya, ia merendahkan musuh-musuh Allah di dalam neraka, (sebaliknya) meninggikan kekasih-kekasih Allah di surga."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Apabila kiamat telah terjadi, tak ayal lagi."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1-3. Allah menyebutkan kejadian-kejadian hari kiamat jika telah terjadi; setiap makhluk akan melihat kejadian itu dengan jelas, tidak akan ada seorangpun yang dapat mendustakan kejadiannya. Hari kiamat akan menjatuhkan orang-orang kafir dan sesat menuju tempat terdalam di neraka, dan akan mengangkat orang-orang beriman menuju derajat yang tinggi di surga."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. إِذَا وَقَعَتِ الْوَاقِعَةُ (Apabila terjadi hari kiamat) Kata (الواقعة) adalah salah satu nama hari kiamat, seperti kata (الآزفة) dan lain sebagainya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Keutamaan: Imam Ahmad dari Jabir bin Samrah berkata: “Rasulallah SAW mengerjakan shalat sebagaimana shalat-shalat kalian setiap hari, namun beliau meringankannya. Shalat beliau lebih ringan daripada shalat kalian dan dalam shalat subuhnya beliau membaca surah Al-Waqi’ah dan surah-surah lain yang serupa.” 1. Saat kiamat terjadi (disampaikan menggunakan fiil madhi karena hari itu pasti terjadi). Al-Waqi’ah, Azifah, dan Al-Haaqah itu bermakna kiamat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apabila hari kiamat terjadi} hari kiamat terjadi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-3. Allah mengabarkan tentang kondisi kiamat yang pasti terjadi, di mana “terjadinya kiamat itu tidak dapat didustakan (disangkal),” maksudnya, tidak ada keraguan padanya karena telah nampak bukti-buktinya, baik secara akal maupun dalil al-Quran dan -Sunnah. Dan kemahabijaksanaanNya telah menunjukkan bahwa, “(kejadian itu) merendahkan (satu golongan) dan meninggikan (golongan yang lain),” maksudnya, merendahkan (sebagian) manusia di tempat paling rendah dan meninggikan sebagian manusia lain di tempat yang paling tinggi. Atau bisa pula bermakna, ia merendahkan suaranya sehingga memperdengarkan yang dekat, dan meninggikan suaranya sehingga memperdengarkan yang jauh."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Waqi’ah ayat 1: Surat ini dimulai dengan pengkabaran berkenaan dengan Al Waqi’ah yaitu hari kiamat yang pasti akan terjadi, ketika ditiupnya sangkakala sebagai datangnya hari kiamat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Di ayat ini dan setelahnya, Allah Subhaanahu wa Ta'aala memberitahukan tentang sesuatu yang pasti terjadi, yaitu hari Kiamat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Waqi’ah Ayat 1",
    "description": "1-3. Allah mengawali surah ini dengan penjelasan tentang hari akhir yang dia tetapkan sebagai tanda dimulainya balasan bagi hamba. Apabila terjadi hari kiamat pada akhir kehidupan dunia kelak, terjadinya peristiwa dahsyat ini tidak dapat didustakan atau disangkal oleh siapa pun. Peristiwa ini merupakan ketetapan Allah yang pasti terjadi. Peristiwa itu akan merendahkan golongan yang ingkar kepada Allah dan meninggikan golongan lain yang beriman, melaksanakan perintah Allah, dan meninggalkan larangan-Nya"
  }
]