[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "10-12. Dan orang-orang yang bersegera dalam kebaikan di dunia, mereka adalah orang-orang yang bersegera menuju derajat-derajat yang tinggi di akhirat. Mereka adalah orang-orang yang didekatkan di sisi Allah. Allah memasukkan mereka ke dalam surga-surga kenikmatan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Mereka itu adalah orang-orang yang didekatkan kepada Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "11. أُو۟لٰٓئِكَ الْمُقَرَّبُونَ (Mereka itulah yang didekatkan kepada Allah) Yakni orang-orang yang bergegas menuju rahmat Allah adalah orang-orang yang didekatkan kepada Allah, yang senantiasa mendapat pahala mereka yang besar dan kemuliaan yang agung."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11-12. Mereka adalah orang-orang yang derajatnya didekatkan dan ditinggikan di surga dan dengan diiringi kenikmatan. Mereka adalah orang-orang yang mendapatkan perlakuan khusus dan dimuliakan di sisi Tuhannya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka itulah orang-orang yang didekatkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "10-14. “Dan orang-orang yang paling dahulu beriman. Mereka itulah orang yang didekatkan (kepada Allah),” maksudnya adalah bahwa orang-orang yang ketika di dunia paling dahulu kepada kebaikan (keimanan), mereka di akhirat adalah orang-orang yang paling dahulu masuk surga. Mereka itulah yang memiliki sifat didekatkan kepada Allah, “berada dalam surga-surga kenikmatan,” di tempat yang paling tinggi, di tempat tertinggi yang tidak ada tempat lagi di atasnya. Dan mereka yang disebutkan adalah “segolongan besar dari orang-orang yang terdahulu,” maksudnya, jumlah golongan besar orang-orang terdahulu dari umat ini secara umum daripada umat yang datang selanjutnya, karena orang-orang yang didekatkan (kepada Allah) dari golongan pertama lebih banyak daripada golongan orang-orang yang kemudian. Dan orang-orang yang didekatkan kepada Allah adalah manusia-manusia istimewa."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Waqi’ah ayat 11: 10-12. Adapun golongan yang ketiga, adalah golongan yang paling tinggi di anatar dua golongan sebelumnya, yang mereka di dunia berlomba dalam menyempunakan keimanan, yaitu dari keikhlasan, jihada, amalan-amalan baik dan amalan-amalan yang shalih; Mereka saling berlomba di dunia dalam kebaikan, maka di akhirat mereka mendapatkan ridha Allah. Mereka adalah orang-orang yang dekat dengan pahala dan balasan yang besar di sisi Allah dengan ditempatkan di surga yang tinggi yaitu surga And. Dan kemungkinan golongan ini akan ada dari jin dan manusia sejak Adam sampai hari kiamat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mereka ini adalah makhluk-makhluk pilihan Allah Subhaanahu wa Ta'aala."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Waqi’ah Ayat 11",
    "description": "11-12. Mereka yang pertama beriman itu adalah orang-orang yang dekat kepada Allah. Sebagai balasan, mereka akan mendapat rahmat-Nya, yaitu berada dalam surga yang penuh kenikmatan sebagaimana yang dia janjikan"
  }
]