[
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Dan sedikit dari manusia di akhir jaman, mereka adalah orang-orang yang terdepan dan didekatkan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "14. وَقَلِيلٌ مِّنَ الْاٰخِرِينَ (dan segolongan kecil dari orang-orang yang kemudian) Yakni dari umat ini. Disebut dengan golongan kecil karena dibandingkan dengan orang-orang sebelum mereka yang lebih banyak, karena telah banyak nabi yang diutus kepada mereka dan banyak orang-orang yang beriman kepada para nabi tersebut. Pendapat lain mengatakan, yang dimaksud dengan golongan yang besar adalah orang-orang terdahulu dari umat Nabi Muhammad, sedangkan golongan yang kecil adalah generasi setelah mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14-15. Dan sedikit dari umat nabi SAW. Digambarkan dengan prosentase sedikit karena kumpulan umat sebelumnya terbilang lebih banyak. Imam Ahmad dan Abu Hurairah berkata: “Saat ayat {Tsullatum minal awwaliin wa qaliilun …} diturunkan, hal itu memecah belah orang-orang muslim, kamudian diturunkan ayat {Tsullatum minal awwalin wa tsullatum minal aakhiriin}” Di atas permadani-permadani yang ditenun dengan rapi dan dihiasi dengan benang-benang emas"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan sedikit dari orang-orang yang datang kemudian} yang akan datang dari umat ini"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "10-14. “Dan orang-orang yang paling dahulu beriman. Mereka itulah orang yang didekatkan (kepada Allah),” maksudnya adalah bahwa orang-orang yang ketika di dunia paling dahulu kepada kebaikan (keimanan), mereka di akhirat adalah orang-orang yang paling dahulu masuk surga. Mereka itulah yang memiliki sifat didekatkan kepada Allah, “berada dalam surga-surga kenikmatan,” di tempat yang paling tinggi, di tempat tertinggi yang tidak ada tempat lagi di atasnya. Dan mereka yang disebutkan adalah “segolongan besar dari orang-orang yang terdahulu,” maksudnya, jumlah golongan besar orang-orang terdahulu dari umat ini secara umum daripada umat yang datang selanjutnya, karena orang-orang yang didekatkan (kepada Allah) dari golongan pertama lebih banyak daripada golongan orang-orang yang kemudian. Dan orang-orang yang didekatkan kepada Allah adalah manusia-manusia istimewa."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Waqi’ah ayat 14: 13-14. Allah menjelaskan bahwa golongan ini adalah pilihan dari orang-orang yang beriman, yang mereka dari umat Muhammad ﷺ dan selainnya, dan sedikit dari umat-umat yang lain. Ini menunjukkan akan keutamaan para salafush shalih dari para sahabat Muhammad ﷺ dan para tabi’in; Mereka adalah orang-orang yang dekat dengan pahala dan besar kemuliaannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini menunjukkan keutamaan generasi pertama umat ini secara jumlah (garis besar) daripada generasi yang datang kemudian, karena orang-orang yang didekatkan dari kalangan orang-orang terdahulu lebih banyak daripada orang-orang yang datang kemudian."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Waqi’ah Ayat 14",
    "description": "13-16. Ayat-ayat ini menerangkan kenikmatan yang akan mereka terima di surga tersebut. Segolongan besar dari orang-orang yang terdahulu beriman kepada Allah dan segolongan kecil dari orang-orang yang kemudian yang tetap teguh dalam ketaatan dan tauhid akan mendapat balasan yang dia janjikan. Mereka berada di atas dipan yang kukuh dan indah karena bertahta emas dan permata, seraya bertelekan di atasnya berhadap-hadapan sambil mensyukuri nikmat yang mereka terima"
  }
]