[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "13-16. Surga tersebut akan dimasuki oleh banyak orang dari generasi awal umat ini dan juga selain mereka dari umat-umat lain, dan sedikit dari generasi akhir umat ini. Mereka di atas ranjang-ranjang yang disulam dengan emas, bersandar di atasnya saling berhadap-hadapan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Bertelekan di atas permadani-permadani ini sambil berhadap-hadapan dengan wajah-wajah mereka, salah seorang dari mereka tidak melihat kepada tengkuk orang lain."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "16. مُّتَّكِـِٔينَ عَلَيْهَا مُتَقٰبِلِينَ (seraya bertelekan di atasnya berhadap-hadapan) Yakni mereka duduk di atas dipan sambil bersandar dan saling berhadapan dan tidak saling membelakangi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16. Mereka duduk atau bersandar di atas ranjang-ranjang yang saling berhadapan. Tiap-tiap mereka tidak melihat orang di sekitarnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{bersandar di atasnya dengan saling berhadapan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "15-16. “Mereka berada di atas dipan yang bertahtakan emas dan permata,” maksudnya, bertahtakan emas, perak, mutiara, permata dan perhiasan lain yang tidak diketahui kecuali oleh Allah. “seraya bertelekan di atasnya,” maksudnya, di atas dipan tersebut, duduk mapan nan penuh dengan ketenangan, santai dan nyaman, “berhadap-hadapan,” wajah setiap dari mereka kepada wajah temannya, karena kejernihan hati mereka dan saling menerima dengan penuh kecintaan dan kebaikan adab mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Waqi’ah ayat 16: 15-16. Allah menjelaskan apa yang telah Allah siapkan bagi orang-orang yang berlomba dalam kebaikan; Allah mengabarkan bahwa mereka di dalam surga di atas dipan-dipan yang ditenun dengan menggunakan benang-benang emas, yang dihiasi dengan mutiara dan permata serta batu zamrud, yang bertelekan di atasnya dan penghuninya saling bertemu satu sama lain."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan tenang dan santai."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Waqi’ah Ayat 16",
    "description": "13-16. Ayat-ayat ini menerangkan kenikmatan yang akan mereka terima di surga tersebut. Segolongan besar dari orang-orang yang terdahulu beriman kepada Allah dan segolongan kecil dari orang-orang yang kemudian yang tetap teguh dalam ketaatan dan tauhid akan mendapat balasan yang dia janjikan. Mereka berada di atas dipan yang kukuh dan indah karena bertahta emas dan permata, seraya bertelekan di atasnya berhadap-hadapan sambil mensyukuri nikmat yang mereka terima. 17-19. Di surga itu mereka dikelilingi oleh anak-anak muda yang tetap muda dan selalu menyenangkan bila dipandang. Anak-anak muda itu melayani mereka dengan membawa gelas, cerek, dan minuman segar yang diambil dari air yang mengalir dari sumber yang tidak pernah kering. Mereka juga mendapat minuman anggur yang tidak memabukkan sehingga mereka tidak pening karenanya dan tidak pula mabuk."
  }
]