[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "17-19. Mereka dikelilingi oleh anak-anak muda belia yang melayani mereka, yang tidak menua dan tidak mati, dengan membawa gelas-gelas, cerek, dan piala berisi minuman yang di ambil dari mata air khamar yang mengalir di surga yang tidak membuat mereka pusing dan tidak menghilangkan akal mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Anak-anak muda itu mengelilingi mereka dengan membawa gelas-gelas yang tidak punya pegangan dan ceret-ceret yang punya pegangan serta piala yang berisi arak yang mengalir di Surga, tidak pernah berhenti."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "18. بِأَكْوَابٍ وَأَبَارِيقَ (dengan membawa gelas, cerek) Makna (الأكواب) adalah gelas berbentuk lingkaran yang tidak memiliki telinga sebagai pegangan. Sedangkan (الأباريق) adalah wadah yang memiliki pegangan dan belalai. وَكَأْسٍ مِّن مَّعِينٍ (dan minuman yang diambil dari air yang mengalir) Yakni khamr yang keluar dari mata air yang tidak pernah kering."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "18. Dengan membawa gelas-gelas, cangkir-cangkir, dan bejana berisi khamr yang mengalir dari mata air yang tidak pernah terputus-putus"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dengan gelas} cangkir-cangkir yang tidak ada pegangannya {kendi} kendi yang memiliki pegangan {dan seloki dari sumber yang mengalir (18)} khamr yang mengalir di surga"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17-19. “Mereka dikelilingi oleh anak-anak muda yang tetap muda,” maksudnya anak-anak yang masih kecil yang sangat tampan dan menawan mengelilingi para penghuni surga untuk melayani mereka dan memenuhi kebutuhan-kebutuhan mereka, “Seakan-akan mereka itu mutiara yang tersimpan.” –At-Thur:24-, maksudnya tersimpan di mana tidak dijamah oleh sesuatu pun yang dapat merubahnya, mereka terciptakan untuk hidup abadi dan selamanya, dan mereka mengelilingi para penghuni surga dengan membawa bejana-bejana tempat minum mereka, “dengan membawa gelas,” yaitu tempat air minum yang tidak memiliki pegangan, “dan cerek,” yaitu tempat air yang memiliki pegangan, “dan sloki (piala) berisi minuman yang diambil dari mata air yang mengalir,” maksudnya dari khamar yang lezat diminum lagi tidak memabukkan, “mereka tidak pening karenanya,” maksudnya bahwa khamar tersebut tidak membuat mereka pusing sebagaimana khamar dunia membuat pusing kepala orang yang meminumnya, dan tidak juga mereka “mabuk,” maksudnya akal mereka tidaklah pergi melayang-layang (karena meminumnya), sebagaimana yang ditimbulkan oleh khamar dunia. Intinya bahwa segala macam bentuk kenikmatan di surga yang menurut jenisnya ada di dunia, maka ada yang di akhirat tidaklah mengandung kerusakan dan tidak pula membinasakan, sebagaimana firman Allah, (Apakah) perumpamaan (penghuni) jannah yang dijanjikan kepada orang-orang yang bertakwa yang di dalamnya ada sungai-sungai dari air yang tiada berubah rasa dan baunya, sungai-sungai dari air susu yang tidak berubah rasanya, sungai-sungai dari khamar yang lezat rasanya bagi peminumnya dan sungai-sungai dari madu yang disaring; dan mereka memperoleh di dalamnya segala macam buah-buahan dan ampunan dari Rabb mereka, sama dengan orang yang kekal dalam jahannam dan diberi minuman dengan air yang mendidih sehingga memotong ususnya?-Muhammad:15- Di dalam ayat ini Allah menyebutkan tentang khamar surga dan menafikan darinya segala macam kerusakan yang didapatkan pada khamar dunia."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Waqi’ah ayat 18: 17-19. Mereka orang-orang yang berlomba menuju kepada kebaikan, mereka dikelilingi anak-anak muda yang tetap muda, tidak menjadi tua dan berubah masa mudanya, bersama dengan anak-anak muda tersebut gelas-gelas dan teko-teko dan juga wadah yang berisi khamr yang lezat yang keluar dari mata air yang tidak pernah kering, tidak juga membahayakan dan menyakitkan, tidak akan pusing dan mabuk ketika meminumnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni teko yang memiliki pegangan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Waqi’ah Ayat 18",
    "description": "17-19. Di surga itu mereka dikelilingi oleh anak-anak muda yang tetap muda dan selalu menyenangkan bila dipandang. Anak-anak muda itu melayani mereka dengan membawa gelas, cerek, dan minuman segar yang diambil dari air yang mengalir dari sumber yang tidak pernah kering. Mereka juga mendapat minuman anggur yang tidak memabukkan sehingga mereka tidak pening karenanya dan tidak pula mabuk"
  }
]