[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-3. apabila Hari Kiamat tiba, saat itu tidak seorang pun yang mendustakannya, ia merendahkan musuh-musuh Allah di dalam neraka, (sebaliknya) meninggikan kekasih-kekasih Allah di surga."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Tidak ada satu jiwa pun yang mendustakannya sebagaimana Kiamat didustakan ketika di dunia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. لَيْسَ لِوَقْعَتِهَا كَاذِبَةٌ (tidak seorangpun dapat berdusta tentang kejadiannya) Yakni jika itu telah terjadi maka tidak akan ada yang mendustakannya lagi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Kejadian kiamat itu tidak bisa didustakan. Kata Al-Kadzibah di sini adalah lafadz yang dimaksudkan untuk menyebut mashdar, yaitu Al-Kidzbu sebagaimana kata Khaainah yang bermakna Al-Khianah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{tidak ada seorang pun yang dapat mendustakan} orang yang mendustakan {terjadinya} pada waktu kejadiannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-3. Allah mengabarkan tentang kondisi kiamat yang pasti terjadi, di mana “terjadinya kiamat itu tidak dapat didustakan (disangkal),” maksudnya, tidak ada keraguan padanya karena telah nampak bukti-buktinya, baik secara akal maupun dalil al-Quran dan -Sunnah. Dan kemahabijaksanaanNya telah menunjukkan bahwa, “(kejadian itu) merendahkan (satu golongan) dan meninggikan (golongan yang lain),” maksudnya, merendahkan (sebagian) manusia di tempat paling rendah dan meninggikan sebagian manusia lain di tempat yang paling tinggi. Atau bisa pula bermakna, ia merendahkan suaranya sehingga memperdengarkan yang dekat, dan meninggikan suaranya sehingga memperdengarkan yang jauh."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Waqi’ah ayat 2: Ketahuilah wahai manusia, jika telah tegak hari kiamat dan datang kejadiannya, maka di sana tidak ada seorangpun yang datang dengan mendustakannya; Dan akan merugi orang-orang mengingkari hari kebangkitan, karena mereka akan melihat dengan mata mereka di hadaoan mereka sendiri. Al Waqi’ah adalah nama di antara nama-nama hari kiamat, misal nama lai : Al Azifah dan As Shakhah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sebagaimana sebelum terjadinya disangkal atau didustakan oleh sebagian manusia. Atau maksudnya, tidak ada keraguan padanya karena begitu jelas dalil-dalilnya baik secara akal maupun naql, demikian pula ditunjukkan oleh hikmah (kebijaksanaan) Allah Subhaanahu wa Ta'aala."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Waqi’ah Ayat 2",
    "description": "1-3. Allah mengawali surah ini dengan penjelasan tentang hari akhir yang dia tetapkan sebagai tanda dimulainya balasan bagi hamba. Apabila terjadi hari kiamat pada akhir kehidupan dunia kelak, terjadinya peristiwa dahsyat ini tidak dapat didustakan atau disangkal oleh siapa pun. Peristiwa ini merupakan ketetapan Allah yang pasti terjadi. Peristiwa itu akan merendahkan golongan yang ingkar kepada Allah dan meninggikan golongan lain yang beriman, melaksanakan perintah Allah, dan meninggalkan larangan-Nya"
  }
]