[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "20-24. Anak-anak muda belia itu mengelilingi mereka menyuguhkan buah-buahan yang mereka pilih, juga daging burung yang disukai oleh jiwa mereka. Mereka memiliki istri-istri yang bermata lebar seperti mutiara yang terlindungi keindahan dan kebeningnnya, sebagai balasan bagi mereka atas amal shalih yang mereka kerjakan di dunia."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "20. Anak-anak muda itu mengelilingi mereka dengan membawa buah-buahan yang mereka pilih."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20. Mereka juga diberi buah-buahan yang mereka pilih dan mereka sukai"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan buah-buahan yang mereka pilih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "20. “Dan buah-buahan dari apa yang mereka pilih,” maksudnya apa pun juga yang mereka pilih, yang mata mereka suka memandangnya dan jiwa mereka menginginkannya, dari berbagai macam buah-buahan yang enak dan lezat, niscaya mereka akan mendapatkannya paling sempurna dan paling baik."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Waqi’ah ayat 20: 20-21. Mereka di surga memiliki pilihan dan keinginan dalam memilih buah-buahan yang lezat. Mereka juga memiliki daging burung yang mereka inginkan dari jenis burung apapun."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mereka dapat memperolehnya dengan keadaannya yang sempurna."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Waqi’ah Ayat 20",
    "description": "20-21. Di sana disediakan pula makanan dan buah-buahan yang beragam sehingga mereka mendapatkan buah apa pun yang mereka pilih. Dan dihidangkan pula kepada mereka daging burung apa pun yang menggugah selera, seperti yang mereka inginkan"
  }
]