[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "20-24. Anak-anak muda belia itu mengelilingi mereka menyuguhkan buah-buahan yang mereka pilih, juga daging burung yang disukai oleh jiwa mereka. Mereka memiliki istri-istri yang bermata lebar seperti mutiara yang terlindungi keindahan dan kebeningnnya, sebagai balasan bagi mereka atas amal shalih yang mereka kerjakan di dunia."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Dan mengelilingi mereka dengan membawa daging burung yang mereka inginkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "21. Dan dengan daging burung dari apa yang amat sangat mereka inginkan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan daging burung yang mereka sukai"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21. “Dan daging burung dari apa yang mereka pilih,” maksudnya, apa pun juga yang mereka pilih, yang mata mereka suka memandangnya dan jiwa mereka menginginkannya, dari berbagai macam jenis dagingnya sesuai aoa yang mereka inginkan. Jika mereka mau dagi yang dibakar atau dimasak atau yang lainnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Waqi’ah ayat 21: 20-21. Mereka di surga memiliki pilihan dan keinginan dalam memilih buah-buahan yang lezat. Mereka juga memiliki daging burung yang mereka inginkan dari jenis burung apapun."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Waqi’ah Ayat 21",
    "description": "20-21. Di sana disediakan pula makanan dan buah-buahan yang beragam sehingga mereka mendapatkan buah apa pun yang mereka pilih. Dan dihidangkan pula kepada mereka daging burung apa pun yang menggugah selera, seperti yang mereka inginkan. 22-24. Orang-orang yang beriman itu mendapat karunia dan nikmat saat di surga, dan di sekeliling mereka ada bidadari-bidadari yang cantik jelita dan bermata jeli. Mereka laksana mutiara yang tersimpan baik dan tidak ternoda oleh apa pun. Kami berikan kenikmatan itu sebagai balasan atas keimanan mereka kepada Allah dan kebaikan apa saja yang mereka kerjakan di dunia."
  }
]