[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "20-24. Anak-anak muda belia itu mengelilingi mereka menyuguhkan buah-buahan yang mereka pilih, juga daging burung yang disukai oleh jiwa mereka. Mereka memiliki istri-istri yang bermata lebar seperti mutiara yang terlindungi keindahan dan kebeningnnya, sebagai balasan bagi mereka atas amal shalih yang mereka kerjakan di dunia."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "22. Dan mereka memiliki bidadari-bidadari yang bermata lebar penuh kecantikan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "22. وَحُورٌ عِينٌ (Dan ada bidadari-bidadari bermata jeli) Yakni istri-istri mereka adalah para bidadari. Makna (الحور) yakni bagian hitam matanya sangat hitam, dan bagian putih matanya sangat putih. Dan (العين) yakni memiliki mata yang luas dan jelita."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "21. Dan daging burung yang diharapkan, disukai, dan didambakan oleh mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan bidadari yang bermata indah} dan perempuan-perempuan yang putih yang memiliki mata lebar yang indah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "22-23. “Dan (di dalam surga itu) ada bidadari-bidadari yang bermata jeli, laksana mutiara yang tersimpan baik,” maksudnya, para penghuni surga akan mendapatkan bidadari-bidadari yang bermata jeli. ‘alhauraa’ adalah wanita (bidadari) yang memiliki mata bercelak, manis, indah, dan mengagumkan, sedangkan ‘al’iinu’ adalah wanita yang matanya besar lagi indah menawan. Dan keindahan mata seorang wanita adalah di antara tanda terbesar akan kecantikan dan keindahannya. “Laksana mutiara yang tersimpan baik,” maksudnya, bidadari-bidadari itu laksana mutiara putih jernih lagi indah yang terlindungi dari mata manusia, dari hembusan angin dan dari sinar matahari, di mana warnanya adalah warna yang paling baik dan tidak memiliki cacat sedikit pun. Demikian juga bidadari-bidadari yang bermata jeli tersebut yang tidak memiliki cacat sedikitpun, bahkan mereka adalah para bidadari yang memiliki sifat-sifat yang sempurna lagi indah dan menakjubkan. Apa pun yang engkau perhatikan padanya, maka engkau tidak akan mendapatkan melainkan semua yang membahagiakan hati dan menyenangkan pandangan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Waqi’ah ayat 22: 22-23. Mereka juga memiliki bidadari, yang mereka adalah wanita-wanita yang cantik, yang memiliki mata-mata indah, yang terjaga dan suci sampai-sampai mereka seperti mutiara yang terjaga dan tak pernah tersentuh, istri-istri mereka di dunia, mereka Allah jadikan jauh lebih cantik dari bidadari."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni bidadari yang sangat jelas hitam bola matanya dan sangat putih pinggirnya serta matanya jeli."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Waqi’ah Ayat 22",
    "description": "22-24. Orang-orang yang beriman itu mendapat karunia dan nikmat saat di surga, dan di sekeliling mereka ada bidadari-bidadari yang cantik jelita dan bermata jeli. Mereka laksana mutiara yang tersimpan baik dan tidak ternoda oleh apa pun. Kami berikan kenikmatan itu sebagai balasan atas keimanan mereka kepada Allah dan kebaikan apa saja yang mereka kerjakan di dunia"
  }
]