[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "20-24. Anak-anak muda belia itu mengelilingi mereka menyuguhkan buah-buahan yang mereka pilih, juga daging burung yang disukai oleh jiwa mereka. Mereka memiliki istri-istri yang bermata lebar seperti mutiara yang terlindungi keindahan dan kebeningnnya, sebagai balasan bagi mereka atas amal shalih yang mereka kerjakan di dunia."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. Sebagai balasan atas amal perbuatan saleh yang pernah mereka lakukan selama di dunia."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "24-26. Mereka berhak mendapatkan berbagai kenikmatan besar itu sebagai balasan bagi mereka atas kebaikan yang mereka lakukan di dunia. Di dalam surga mereka tidak mendengar perkataan batil, dan tidak mendapat dosa dari yang mereka dengar kerena yang mereka dengar hanya perkataan baik dan ucapan salam di antara mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "24. Semua itu diberikan untuk mereka sebagai balasan atas amal perbuatan mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{sebagai balasan atas apa yang mereka kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "24. Kenikmatan tersebut yang telah dipersiapkan untuk mereka adalah “sebagai balasan bagi apa yang telah mereka kerjakan” yakni, sebagaimana mereka telah melakukan berbagai amal kebaikan, maka demikian juga Allah memberikan balasan dengan kebaikan dan menyempurnakan segala kemenangan dan kenikmatan untuk mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Waqi’ah ayat 24: Allah menjelaskan kenikmatan ini adalah sebagai balasan bagi mereka yang di dunia beramal dengan tauhid dan segala yang Allah cintai dan ridhai dari ucapan dan perbuatan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Oleh karena mereka memperbaiki amal, maka Allah memperbaiki balasan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Waqi’ah Ayat 24",
    "description": "22-24. Orang-orang yang beriman itu mendapat karunia dan nikmat saat di surga, dan di sekeliling mereka ada bidadari-bidadari yang cantik jelita dan bermata jeli. Mereka laksana mutiara yang tersimpan baik dan tidak ternoda oleh apa pun. Kami berikan kenikmatan itu sebagai balasan atas keimanan mereka kepada Allah dan kebaikan apa saja yang mereka kerjakan di dunia. 25-26. Mereka tidak mendengar di dalamnya perkataan yang sia-sia, seperti gurauan atau perkataan yang tidak bermanfaat, dan tidak pula mereka mendengar perkataan yang menimbulkan dosa. Tetapi, di dalam sana mereka hanya mendengar ucapan salam hangat dan doa yang menyejukkan."
  }
]