[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "25-26. Mereka tidak mendengar kata-kata batil di surga dan tidak juga kalimat-kalimat yang mengandung dosa, kecuali ucapan yang selamat dari hal-hal tercela tersebut, yaitu ucapan salam sebagian kepada sebagian yang lain."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "26. Mereka tidak mendengar selain salam dari malaikat untuk mereka dan salam sebagian dari mereka kepada sebagian yang lain."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "26. إِلَّا قِيلًا سَلٰمًا سَلٰمًا (akan tetapi mereka mendengar ucapan salam) Yakni mereka mengatakan salam, yakni mereka saling memberi sambutan dengan ucapan salam."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "26. Namun ucapan (mereka) adalah salam, salam. Mereka berkata: “Allah memberikanmu kesejahteraan yang diberkahi.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{kecuali ucapan,“Salam, salam”} kecuali saling memberi sambutan satu sama lain dengan mengucapkan salam"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "25-26. “Mereka tidak mendengar di dalamnya perkataan yang sia-sia dan tidak pula perkataan yang menimbulkan dosa,” maksudnya, bahwa di dalam surga yang penuh kenikmatan itu mereka tidak akan mendengar perkataan yang sia-sia, tidak mendengar ucapan yang tidak memiliki faidah dan tidak juga mendengar percakapan yang menimbulkan dosa, “akan tetapi mereka hanya mendengar ucapan salam,” maksudnya, mereka hanya akan mendengar perkataan baik. Yang demikian itu karena surga adalah tempat orang-orang baik, dan tidak ada padanya melainkan segala sesuatu yang baik. Hal ini menunjukkan bahwa para penghuni surga memiliki adab yang baik dalam percakapan mereka, dan bahwa yang mereka ucapkan adalah perkataan terbaik dan yang paling membahagiakan bagi hati serta paling selamat dari segala kesia-siaan dan dosa. Kita memohon kepada Allah akan karunia (surga) Nya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Waqi’ah ayat 26: 25-26. Dan di antara nikmat Allah yang diberikan kepada mereka, mereka tidaklah mendengar di surga ucapan buruk atau yang mendatangkan dosa dan yang tidak ada manfaat. Mereka tidaklah mendengar kecuali ucapan yang baik, yang di antaranya adalah : Ucapan salam dan ucapan selamat (penghormatan) satu sama lain."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Hal itu, karena surga adalah tempat orang-orang yang baik dan tidak ada di sana selain semua yang baik. Hal ini juga menunjukkan bagusnya adab penghuni surga dalam percakapan di antara sesama mereka, dan bahwa ucapan mereka adalah ucapan yang paling baik dan paling menyenangkan jiwa serta paling selamat dari sesuatu yang sia-sia dan dosa. Ya Allah, masukkanlah kami ke surga dan jauhkanlah kami dari neraka. Ya Allah, masukkanlah kami ke surga dan jauhkanlah kami dari neraka. Ya Allah, masukkanlah kami ke surga dan jauhkanlah kami dari neraka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Waqi’ah Ayat 26",
    "description": "25-26. Mereka tidak mendengar di dalamnya perkataan yang sia-sia, seperti gurauan atau perkataan yang tidak bermanfaat, dan tidak pula mereka mendengar perkataan yang menimbulkan dosa. Tetapi, di dalam sana mereka hanya mendengar ucapan salam hangat dan doa yang menyejukkan. 27. Usai menguraikan nikmat bagi orang beriman, pada ayat-ayat ini Allah menjelaskan siapakah golongan kanan itu. Dan sebagian manusia termasuk golongan kanan, yaitu mereka yang beriman dan menaati ajaran Allah. Alangkah bahagianya mereka yang termasuk golongan kanan itu. Mereka pasti akan mendapat balasan surga yang penuh kenikmatan."
  }
]