[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-3. apabila Hari Kiamat tiba, saat itu tidak seorang pun yang mendustakannya, ia merendahkan musuh-musuh Allah di dalam neraka, (sebaliknya) meninggikan kekasih-kekasih Allah di surga."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Merendahkan orang-orang kafir yang jahat dengan memasukkan mereka ke dalam Neraka, dan mengangkat orang-orang yang beriman yang bertakwa dengan memasukkan mereka ke dalam Surga."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. خَافِضَةٌ رَّافِعَةٌ ((Kejadian itu) merendahkan (satu golongan) dan meninggikan (golongan yang lain)) Yakni merendahkan kaum-kaum yang dahulu di dunia dimuliakan, yaitu orang-orang kafir yang memiliki kedudukan tinggi dan orang-orang fasik yang memiliki derajat dan kekayaan; dan meninggikan kaum yang dahulu di dunia dianggap asing, yaitu orang-orang yang beriman."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Merendahkan suatu kaum dan meninggikan lainnya. Kaum yang pertama adalah orang-orang kafir dan orang-orang fasik, dan kaum yang kedua adalah orang-orang yang beriman."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{merendahkan dan meninggikan} merendahkan orang-orang kafir di neraka, dan meninggikan orang-orang mukmin"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-3. Allah mengabarkan tentang kondisi kiamat yang pasti terjadi, di mana “terjadinya kiamat itu tidak dapat didustakan (disangkal),” maksudnya, tidak ada keraguan padanya karena telah nampak bukti-buktinya, baik secara akal maupun dalil al-Quran dan -Sunnah. Dan kemahabijaksanaanNya telah menunjukkan bahwa, “(kejadian itu) merendahkan (satu golongan) dan meninggikan (golongan yang lain),” maksudnya, merendahkan (sebagian) manusia di tempat paling rendah dan meninggikan sebagian manusia lain di tempat yang paling tinggi. Atau bisa pula bermakna, ia merendahkan suaranya sehingga memperdengarkan yang dekat, dan meninggikan suaranya sehingga memperdengarkan yang jauh."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Waqi’ah ayat 3: Allah menjelaskan dari sebagian keadaan-keadaan hari kiamat adalah direndahkannya suatu kaum dan ditinggikannya kaum yang lain. Dan didahulukannya penyebutan kata Al Khafd adalah karena pada hari itu ketika tegak hari kiamat, urusan mereka sangat sulit, tidak dapat berkata-kata walaupun satu lafadz pun."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan masuk ke tempat yang paling rendah, yaitu neraka. Dengan masuk ke tempat yang paling tinggi, yaitu surga."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Waqi’ah Ayat 3",
    "description": "1-3. Allah mengawali surah ini dengan penjelasan tentang hari akhir yang dia tetapkan sebagai tanda dimulainya balasan bagi hamba. Apabila terjadi hari kiamat pada akhir kehidupan dunia kelak, terjadinya peristiwa dahsyat ini tidak dapat didustakan atau disangkal oleh siapa pun. Peristiwa ini merupakan ketetapan Allah yang pasti terjadi. Peristiwa itu akan merendahkan golongan yang ingkar kepada Allah dan meninggikan golongan lain yang beriman, melaksanakan perintah Allah, dan meninggalkan larangan-Nya. 4-6. Apabila bumi digoncangkan sedahsyat-dahsyatnya pada saat kiamat dan gempa hebat di seluruh penjuru bumi menghancurkan apa saja yang ada di atasnya (lihat pula: surah az-zalzalah/99: 1), dan ketika itu gunung-gunung dihancur-luluhkan seluluh-luluhnya, maka jadilah ia debu yang beterbangan bagai bulu tertiup angin ke segala arah (lihat pula: su-rah al-q'ri'ah/101: 5)."
  }
]