[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "27-34. Ashabul Yamin (golongan kanan), betapa besar kedudukan dan balasan mereka. Mereka di bawah pohon bidara yang tidak berduri dan pisang yang sebagian tersusun di atas sebagian lainnya, naungan yang langgeng yang tidak lenyap, air mengalir yang tiada henti, buah-buahan yang banyak yang tidak pernah habis dan tidak pula berakhir, tidak ada yang menghalangi mereka, dan juga kasur-kasur yang terangkat di atas ranjang-ranjang."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "32. Dan buah-buahan yang banyak, tidak terkira jumlahnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "30-31-32. Dan diberi naungan yang selamanya terbentang, air yang selalu mengalir tanpa terputus-putus, dan buah-buahan yang beragam yang selalu dilimpahkan dalam jumlah banyak."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan buah-buahan yang banyak"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "27-34. Kemudian Allah menyebutkan apa yang telah Dia persiapkan bagi golongan kanan seraya berfirman, “Dan golongan kanan, alangkah bahagianya golongan kanan itu,” maksudnya kedudukan dan kondisi mereka amatlah agung, “berada di antara pohon bidara yang tidak berduri,” maksudnya tidak memiliki duri dan ranting yang tidak enak dipandang lagi membahayakan, dan digantikan di tempat tersebut dengan buah yang baik (lezat dan bermanfaat). Dan pohon bidara itu memiliki keistimewaan, yakni pohonnya yang sangat rindang nan teduh dan biasa digunakan sebagai tempat beristirahat. “Dan pohong pisang yang bersusun-susun (buahnya).” ‘attholhu’ adalah sebuah pohon yang dikenal dikalangan masyarakat, yaitu pohon besar yang biasanya didapati di daerah pedalaman yang pada pelepahnya tersusun buahnya yang enak dan lezat. “Dan air yang tercurah,” maksudnya di dalam surga banyak didapati mata air dan sungai-sungai yang mengalir terus menerus. “Dan buah-buahan yang banyak, yang tidak berhenti (buahnya) dan tidak terlarang mengambilnya,” maksudnya, buah-buahan tersebut tidaklah seperti yang ada di dunia, di mana dalam waktu tertentu akan berhenti berbuah dan tidak bisa dipetik, artinya tidak mudah bagi orang yang ingin menikmatinya (setiap kali mau). Akan tetapi buah-buahan di surga itu akan selalu ada dan dapat dipetik dari dekat, di mana seorang hamba penghuni surga akan dapat mengambilnya dalam keadaan apa pun. “Dan kasur-kasur yang tebal lagi empuk” yakni memiliki ketebalan (ketinggian) yang melebihi semua kasur yang ada (di dunia), dan kasur-kasur tersebut terbuat dari sutra, emas dan mutiara, serta dari sesuatu yang tidak ada yang mengetahuinya kecuali Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Waqi’ah ayat 32: 27-34. Ketika Allah selesai menyebutkan perihal orang-orang yang berlomba dalam kebaikan, maka Allah menyebutkan kondisi golongan kanan, dan apa yang mereka dapatkan dari kenikmatan; Allah mengabarkan bahwa golongan kanan urusannya dan derajatnya ditinggikan, mereka bertempat di surga yang penuh dengan pohon bidara yang tak memiliki duri, dan juga pohon pisang yang berderet-deret satu sama lain yang terhampar dan tidak akan pernah habis. Begitu juga air yang manis yang mengalir dari semburan mata air surga dan sungai-sungainya. Begitu juga buah-buahan yang lezat yang terus ada, dan tidak akan penah terputus dari waktu ke waktu, bahkan buah-buahan tersebut saling berdekatan jika ingin dipetik. Penghuni surga duduk di tempat yang tinggi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Waqi’ah Ayat 32",
    "description": "32-34. Di surga terdapat beragam sayuran dan buah-buahan yang sudah masak dan banyak macamnya. Pepohonan di dalamnya merupakan tumbuhan yang tidak berhenti berbuah dan tidak terlarang pula bagi penghuni surga untuk mengambilnya. Bagi mereka disediakan pula tempat istirahat yang dilengkapi pembaringan, dan di atasnya terdapat kasur-kasur yang tebal lagi empuk"
  }
]