[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "35-38. Sesungguhnya Kami menciptakan kaum wanita penghuni surga dengan penciptaan yang berbeda dengan penciptaan mereka di dunia, penciptaan sempurna yang tidak fana, Kami menjadikan mereka gadis perawan, dicintai oleh para suami mereka, dalam umur yang sama (sebaya), Kami menciptakan mereka untuk Ashabul Yamin (golongan kanan)."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "35. Sesungguhnya Kami menciptakan bidadari-bidadari tersebut dengan penciptaan yang tidak lazim."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "35. إِنَّآ أَنشَأْنٰهُنَّ إِنشَآءً (Sesungguhnya Kami menciptakan mereka (bidadari-bidadari) dengan langsung) Yakni Kami menciptakan bidadari-bidadari itu secara langsung tanpa melalui proses kelahiran. Pendapat lain mengatakan yang dimaksud adalah wanita-wanita keturunan Adam, yakni Allah mengembalikan mereka dari keadaan tua dan mati ke masa muda mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "35-36-37. Sesungguhnya kami menciptakan bidadari-bidadari surga sebagai ciptaan baru tanpa melalui proses kelahiran, lalu menjadikan mereka pemudi-pemudi yang perawan yang sangat disukai suami-suami mereka dan umur-umurnya selalu sama, yaitu remaja"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya Kami menciptakan mereka secara langsung} Kami memulai penciptaan mereka dengan tanpa dilahirkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "35-38. “Sesungguhnya Kami menciptakan mereka (bidadari-bidadari) dengan langsung,” maksudnya bahwa Kami menciptakan wanita-wanita penghuni surga dengan penciptaan yang tidak seperti penciptaan di dunia, yakni penciptaan sempurna yang tidak akan mengalami kefanaan. “Dan kami jadikan mereka gadis-gadis perawan,” baik yang masih kecil maupun yang sudah dewasa dari mereka, dan kerumunan itu mencakup para bidadari dan para wanita penghuni surga, dan bahwasanya sifat tersebut –yakni perawan- selalu menyertai mereka dalam segala keadaan mereka, sebagaimana keberadaan mereka yang “penuh cinta lagi sebaya umurnya,” dan (sifat itu) selalu menyertai mereka dalam segala keadaan. ‘al’arobu’ adalah seorang wanita yang dicintai oleh suaminya karena keindahan perkataan dan bentuk tubuhnya serta riang, cantik dan penuh kasih, dia adalah wanita yang jika berbicara mempesona, sehingga orang yang mendengarkan tidak ingin perkataannya berhenti, terlebih lagi ketika mereka mendendangkan nyanyian dengan suara mereka yang sangat merdu. Dan jika melihat kepada adab, kepribadian, dan keriangan, maka semua itu akan memenuhi hati suaminya dengan kegembiraan dan kebahagiaan. Jika ia berpindah dari satu tempat ke tempat lain, maka tempat tersebut akan dipenuhi dengan aroma harum dan cahaya indah. Dan suasana riang itu juga termasuk ketika berhubungan badan. Sedangkan ‘al-atrobu’ adalah para wanita yang memiliki umur sebaya, yaitu umur tiga puluh tiga tahun, yang mana merupakan usia paling diharapkan dan batas maksimal masa muda. Jadi wanita-wanita para penghuni surga itu penuh cinta lagi sebaya umurnya, memiliki keserasian dan keharmonisan, serta tidak bersedih dan tidak membuat sedih, akan tetapi mereka adalah para wanita yang selalu bahagia dan membahagiakan, senang dan menyenangkan serta enak untuk selalu dipandang. “(Kami ciptakan mereka) untuk golongan kanan,” maksudnya bahwa para bidadari itu dipersiapkan dan disediakan untuk mereka, para penghuni surga."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Waqi’ah ayat 35: 35-38. Allah mengabarkan bahwa Dia menjadikan wanita-wanita ahli surga untuk dijadikan bidadari surga dengan bentuk (ciptaan) yang baru, Allah menjadikan istri-istri mereka (di dunia) dengan ciptaan yang baru, Allah jadikan mereka lebih cantik daripada bidadari surga. Wanita-wanita tersebut tidak akan mati, kemudian Allah jadikan kembali perawan, yang tidak akan hilang keperawanan mereka setelahnya, yang mereka saling mencintai atas diri-diri suami mereka, Allah jadikan mereka memiliki suami dari golongan-golongan kanan yang di surga, yang suami-suami mereka adalah orang-orang yang beriman kepada Allah, dan beramal shalih di dunia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mereka diciptakan tanpa melalui kelahiran dan langsung menjadi gadis, atau maksudnya Allah menciptakan mereka (wanita-wanita penghuni surga) dalam keadaan sempurna dan tidak menerima kebinasaan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Waqi’ah Ayat 35",
    "description": "35-38. Selain kenikmatan yang telah diuraikan, sesungguhnya di surga juga terdapat bidadari-bidadari cantik yang kami ciptakan mereka secara langsung. Kami jadikan mereka sebagai gadis-gadis perawan. Mereka selalu penuh dengan cinta lagi sebaya umurnya. Kami ciptakan mereka khusus untuk golongan kanan yang teguh imannya dan selalu menaati aturan Allah"
  }
]