[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "39-40. Mereka adalah jamaah besar dari orang-orang generasi awal dan jamaah dalam jumlah besar dari generasi yang datang kemudian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "39. Mereka adalah sekelompok orang dari umat-umat para Nabi yang terdahulu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "39-40. وَثُلَّةٌ مِّنَ الْاٰخِرِينَ ثُلَّةٌ مِّنَ الْأَوَّلِينَ ((yaitu) segolongan besar dari orang-orang yang terdahulu dan segolongan besar pula dari orang-orang yang kemudian) Yakni banyak dari umat-umat terdahulu, yaitu mulai dari nabi Adam sampai Nabi Muhammad, dan banyak dari umat terakhir yaitu umat Nabi Muhammad. Pendapat lain mengatakan, yang dimaksud dengan golongan orang-orang terdahulu adalah orang-orang terdahulu dari umat Nabi Muhammad, sedangkan golongan selanjutnya adalah generasi akhir umat ini yang mengikuti mereka dalam iman."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "39-40. Kelompok besar dari umat-umat terdahulu sebelum nabi kita dan kelompk besar dari umat nabi Muhammad SAW"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Segolongan dari orang-orang yang terdahulu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "39-40. “(Yaitu) segolongan besar dari orang-orang terdahulu, dan segolongan besar pula dari orang-orang yang kemudian,” maksudnya golongan kanan itu adalah sejumlah besar dari orang-orang terdahulu dan sejumlah besar dari orang-orang yang kemudian."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Waqi’ah ayat 39: 39-40. Golongan ini adalah golongan yang terpilih dari golongan kanan, yang terbanyak dari mereka adalah orang-orang terdahulu (dari umat-umat sebelum umat Muhammad ﷺ), dan banyak juga dari umat Muhammad ﷺ."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Waqi’ah Ayat 39",
    "description": "39-40. Karunia dan kenikmatan itu diperuntukkan bagi kelompok kanan, yaitu segolongan besar dari orang-orang yang terdahulu beriman dan menaati ajaran Allah, dan disiapkan pula bagi segolongan besar pula dari orang-orang yang kemudian dalam memeluk islam. 39-40"
  }
]