[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "39-40. Mereka adalah jamaah besar dari orang-orang generasi awal dan jamaah dalam jumlah besar dari generasi yang datang kemudian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "40. Dan sekelompok dari umat Muhammad -ṣallallāhu 'alaihi wa sallam-, di akhir zaman."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "39-40. Kelompok besar dari umat-umat terdahulu sebelum nabi kita dan kelompk besar dari umat nabi Muhammad SAW"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan segolongan dari orang-orang yang kemudian"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "39-40. “(Yaitu) segolongan besar dari orang-orang terdahulu, dan segolongan besar pula dari orang-orang yang kemudian,” maksudnya golongan kanan itu adalah sejumlah besar dari orang-orang terdahulu dan sejumlah besar dari orang-orang yang kemudian."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Waqi’ah ayat 40: 39-40. Golongan ini adalah golongan yang terpilih dari golongan kanan, yang terbanyak dari mereka adalah orang-orang terdahulu (dari umat-umat sebelum umat Muhammad ﷺ), dan banyak juga dari umat Muhammad ﷺ."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni golongan kanan ini terdiri dari sejumlah besar orang-orang yang terdahulu dan sejumlah besar orang-orang yang datang kemudian."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Waqi’ah Ayat 40",
    "description": "39-40. Karunia dan kenikmatan itu diperuntukkan bagi kelompok ka-nan, yaitu segolongan besar dari orang-orang yang terdahulu beriman dan menaati ajaran Allah, dan disiapkan pula bagi segolongan besar pula dari orang-orang yang kemudian dalam memeluk islam. 41-42. Beralih dari uraian tentang golongan kanan, Allah pada ayat-ayat berikut menerangkan golongan kiri. Dan orang-orang yang termasuk golongan kiri adalah mereka yang ingkar pada Allah dan selalu berbuat menyimpang. Alangkah sengsaranya golongan kiri itu karena mereka akan menerima azab sesuai dengan perilakunya di dunia. Mereka disiksa dalam pusaran angin yang membawa udara amat panas hingga membuat seluruh tubuh mereka melepuh, dan bagi mereka disediakan pula minuman dari air panas yang mendidih sehingga lidah mereka terbakar saat meminumnya."
  }
]