[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "41-44. Dan Ashabusy Syimal (golongan kiri), betapa buruk balasan dan keadaan mereka. Dalam hawa panas dari hawa panas api Neraka Jahanam yang menyusup ke dalam nafas mereka, air panas yang mendidih, naungan dari asap hitam pekat, tempat mereka tidak dingin dan pemandangan mereka tidak bagus."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "42. Mereka berada di angin yang sangat panas, dan di air yang sangat panas."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "42. yaitu dalam nyala api neraka atau berada dalam angin yang sangat panas yang menusuk pori-pori kulit dan air yang sangat panas."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dalam angin yang sangat panas} angin yang panas {dan air yang mendidih} air yang sangat panas"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "41-44. Yang dimaksud dengan golongan kiri ialah para penghuni neraka dan orang-orang yang beramal buruk. Dalam ayat ini Allah menyebutkan bagi mereka siksaan yang berhak mereka dapatkan, di mana Allah mengabarkan bahwasanya mereka, “dalam (siksaan) angin yang amat panas,” yakni angin panas yang (terhembus) dari panasnya api Neraka Jahanam, yang membuat mereka sesak nafas dan gundah yang teramat sangat, “dan air yang panas yang mendidih,” yaitu air mendidih yang dapat melelehkan usus-usus mereka, “dan dalam naungan asap yang hitam” yakni jilatan api yang bercampur dengan asap panas. “tidak sejuk dan tidak menyenangkan.” Maksudnya bahwa asap yang hitam tersebut tidak mengandung kesejukan sama sekali dan tidak pula menyenangkan. Maksud ayat ini adalah bahwa dalam kondisi tersebut (mereka ditimpa) kegundahan, kegalauan, dan kesengsaraan yang tidak mengandung kebaikan sama sekali. Karena penafian sesuatu berarti penetapan sesuatu yang berlawanan dengannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Waqi’ah ayat 42: 41-44. Allah memulai menjelaskan golongan kiri, yaitu mereka adalah orang-orang kafir, musyrik, ateis dan munafik secara aqidah, dan selain dari mereka dari firqah-firqah yang kufur, maka bagaimanakah keadaan mereka dan apa balasan bagi mereka ? Sungguh mereka ditimpakan api pada kulit-kulit (jasad) mereka, dan minuman bagi mereka adalah dari air panas mendidih, mereka dipayungi dengan asap hitam; Asap ini panas dan tidak enak dilihat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang memotong usus-usus mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Waqi’ah Ayat 42",
    "description": "41-42. Beralih dari uraian tentang golongan kanan, Allah pada ayat-ayat berikut menerangkan golongan kiri. Dan orang-orang yang termasuk golongan kiri adalah mereka yang ingkar pada Allah dan selalu berbuat menyimpang. Alangkah sengsaranya golongan kiri itu karena mereka akan menerima azab sesuai dengan perilakunya di dunia. Mereka disiksa dalam pusaran angin yang membawa udara amat panas hingga membuat seluruh tubuh mereka melepuh, dan bagi mereka disediakan pula minuman dari air panas yang mendidih sehingga lidah mereka terbakar saat meminumnya. 43-44. Demikian pedih azab bagi golongan kiri itu, dan mereka selalu dalam naungan asap yang hitam dari api neraka. Asap hitam itu membuat suasana di neraka sama sekali tidak sejuk dan tidak pula menyenangkan."
  }
]