[
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "45. Sesungguhnya keadaan mereka sebelum merasakan azab tersebut, mereka bersenang-senang di dunia, tidak ada tujuan hidup selain melampiaskan syahwat mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "45. إِنَّهُمْ كَانُوا۟ قَبْلَ ذٰلِكَ مُتْرَفِينَ (Sesungguhnya mereka sebelum itu hidup bermewahan) Yakni menikmati apa yang tidak halal bagi mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "43-44-45. Mereka diberi naungan asap neraka yang hitam dan panas. Tidak dingin sama sekali layaknya naungan-naungan biasanya. Tidak juga berguna untuk mencegah sakitnya hawa panas bagi orang yang bernaung di bawahnya. Tidak baik juga bagi penglihatan. Golongan kiri itu saat di dunia sangat menikmati dan asyik dengan syahwatnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya mereka sebelum itu hidup bermewah-mewah.} bermewah-mewahan lagi mengikuti hawa nafsu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "45-48. Kemudian Allah menyebutkan amal perbuatan para penghuni neraka yang telah menghantarkan mereka kepada balasan tersebut dengan berfirman, “Sesungguhnya mereka sebelum itu hidup bermewah-mewahan.” Maksudnya bahwa dunia telah membuat mereka lalai, mereka beramal (hanya untuk mendapatkan kesenangannya) dan mereka telah bersuka ria serta berhura-hura dengannya, sehingga angan-angan (terhadap kesenangan dunia) telah melalaikan mereka dari amal shalih. Inilah kemewahan hidup yang telah dicela oleh Allah. “Dan mereka terus-menerus mengerjakan dosa yang besar,” maksudnya bahwa mereka melakukan dosa-dosa besar dan tidak bertaubat darinya serta tidak menyesalinya, bahkan mereka terus menerus melakukan perbuatan-perbuatan yang membuat Rabb mereka murka, mereka telah mempersembahkan kepadaNya dosa yang begitu banyak yang tidak mungkin untuk diampuni. Dan (di samping itu) mereka juga mengingkari Hari Pembalasan, di mana mereka mengatakan (sebagai bentuk ketidakpercayaan mereka kepadanya), “Apakah apabila kami mati dan menjadi tanah dan tulang belulang, apakah sesungguhnya kami benar-benar akan dibangkitkan kembali? Apakah bapak-bapak kami yang terdahulu (dibangkitkan pula)?” maksudnya, bagaimana mungkin kami akan dibangkitkan kembali setelah kematian kami, sedangkan kami telah hancur lebur menjadi tanah dan tulang belulang?! Ini adalah suatu yang mustahil."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Waqi’ah ayat 45: 45-48. Allah menyebutkan amalan orang-orang kafir yang layak bagi mereka untuk diadzab, Allah mengabarkan bahwa mereka di dunia bersenang-senang, tidaklah mereka beramal kecuali asasnya adalah syahwat mereka, mereka di dunia adalah orang-orang yang jahat yaitu melakukan kesyirikan, mereka juga mengingkari hari kebangkitan, mereka mengatakan dengan nada sombong dan pengingkaran : Apakah bila kami mati dan menjadi tanah dan tulang belulang, apakah sungguh kami akan benar-benar dibangkitkan kembali ? Dan dibangkitkan juga bapak-bapak kami yang telah mati mendahului kami ?!"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah menyebutkan amal yang membuat mereka sampai ke tempat itu. Tidak mau mengerjakan amal saleh dan dibuat lalai oleh dunia. Yang ada di benak mereka adalah keinginan hidup enak di dunia, sehingga mereka kerahkan pikiran dan tenaga untuk memperolehnya sampai lupa terhadap akhirat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Waqi’ah Ayat 45",
    "description": "45-46. Golongan kiri itu mendapat azab yang sangat pedih karena sesungguhnya mereka sebelum itu selalu hidup bermewahan dari harta yang tidak halal, dan di samping itu mereka terus menerus mengerjakan dosa besar"
  }
]