[
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "48. Ataukah bapak-bapak kami terdahulu yang telah meninggal sebelum kami juga akan dibangkitkan?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "48. أَوَءَابَآؤُنَا الْأَوَّلُونَ (apakah bapak-bapak kami yang terdahulu (juga)?”) Yakni kebangkiatan nenek moyang mereka lebih mustahil lagi, sebab mereka telah mati sejak lama."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "48. Apakah leluhur-leluhur kami terdahulu juga dibangkitkan? Sesungguhnya mereka sangat mengingkari kebangkitan ayah-ayah dan kakek-kakek mereka karena waktunya sudah sangat lama"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah nenek moyang kami yang terdahulu juga} apakah nenek moyang Kami yang terdahulu juga dibangkitkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "45-48. Kemudian Allah menyebutkan amal perbuatan para penghuni neraka yang telah menghantarkan mereka kepada balasan tersebut dengan berfirman, “Sesungguhnya mereka sebelum itu hidup bermewah-mewahan.” Maksudnya bahwa dunia telah membuat mereka lalai, mereka beramal (hanya untuk mendapatkan kesenangannya) dan mereka telah bersuka ria serta berhura-hura dengannya, sehingga angan-angan (terhadap kesenangan dunia) telah melalaikan mereka dari amal shalih. Inilah kemewahan hidup yang telah dicela oleh Allah. “Dan mereka terus-menerus mengerjakan dosa yang besar,” maksudnya bahwa mereka melakukan dosa-dosa besar dan tidak bertaubat darinya serta tidak menyesalinya, bahkan mereka terus menerus melakukan perbuatan-perbuatan yang membuat Rabb mereka murka, mereka telah mempersembahkan kepadaNya dosa yang begitu banyak yang tidak mungkin untuk diampuni. Dan (di samping itu) mereka juga mengingkari Hari Pembalasan, di mana mereka mengatakan (sebagai bentuk ketidakpercayaan mereka kepadanya), “Apakah apabila kami mati dan menjadi tanah dan tulang belulang, apakah sesungguhnya kami benar-benar akan dibangkitkan kembali? Apakah bapak-bapak kami yang terdahulu (dibangkitkan pula)?” maksudnya, bagaimana mungkin kami akan dibangkitkan kembali setelah kematian kami, sedangkan kami telah hancur lebur menjadi tanah dan tulang belulang?! Ini adalah suatu yang mustahil."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Waqi’ah ayat 48: 45-48. Allah menyebutkan amalan orang-orang kafir yang layak bagi mereka untuk diadzab, Allah mengabarkan bahwa mereka di dunia bersenang-senang, tidaklah mereka beramal kecuali asasnya adalah syahwat mereka, mereka di dunia adalah orang-orang yang jahat yaitu melakukan kesyirikan, mereka juga mengingkari hari kebangkitan, mereka mengatakan dengan nada sombong dan pengingkaran : Apakah bila kami mati dan menjadi tanah dan tulang belulang, apakah sungguh kami akan benar-benar dibangkitkan kembali ? Dan dibangkitkan juga bapak-bapak kami yang telah mati mendahului kami ?!"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Waqi’ah Ayat 48",
    "description": "47-48. Golongan kiri itu tidak mempercayai adanya hari kebangkitan, dan mereka selalu mengatakan, 'apakah bila kami mati, dikubur, dan menjadi tanah dan tulang belulang kami hancur, apakah sesungguhnya kami akan benar-benar dibangkitkan kembali seperti saat di dunia ini' apakah bapak-bapak kami yang sudah meninggal terdahulu juga akan dibangkitkan seperti halnya kami''49-50. Wahai nabi, katakanlah untuk meyakinkan mereka, 'sesungguhnya orang-orang yang sudah meninggal terdahulu, termasuk kakek moyang mereka, dan orang-orang yang terkemudian, seperti anak cucu mereka, benar-benar akan dikumpulkan di padang mahsyar pada waktu tertentu pada hari yang telah dikenal dan ditetapkan."
  }
]