[
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "49. Katakanlah -wahai Rasul- kepada orang-orang yang mengingkari kebangkitan itu, “Sesungguhnya orang-orang yang terdahulu dan orang-orang terkemudian,"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "49-50. Hai Rasulullah, katakanlah kepada mereka: Semua makhluk; baik yang terdahulu atau yang setelahnya, akan dibangkitkan untuk menjalani hari perhitungan yang telah Allah tetapkan waktunya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "49. قُلْ إِنَّ الْأَوَّلِينَ وَالْاٰخِرِينَ (Katakanlah: “Sesungguhnya orang-orang yang terdahulu dan orang-orang yang terkemudian) Yakni katakanlah hai Muhammad, bahwa orang-orang terdahulu dan yang setelahnya yang kalian termasuk di dalamnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "49. Katakanlah kepada mereka wahai Rasulallah: “Sesungguhnya umat-umat pertama dan umat-umat terakhir termasuk kalian”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Katakanlah,“Sesungguhnya orang-orang yang terdahulu dan yang kemudian"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "49-50. maksudnya, katakanlah (wahai Muhammad) bahwa orang-orang yang terdahulu dan orang-orang yang kemudia, mereka semua akan dibangkitkan keembali oleh Allah dan mereka akan dikumpulkan pada waktu yang ditentukan di hari yang telah diketahui yang telah Allah takdirkan bagi para hambaNya ketika masa penciptaan telah berakhir, dan Allah akan membalas mereka atas amal-amal yang telah mereka perbuat di dunia."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Waqi’ah ayat 49: 49-50. Kemudian Allah memerintahkan Rasul-Nya untuk menjawab mereka dan berkata : Sesungguhnya orang-orang yang telah lalu dan yang akhir dari umat yang mengikutinya; Akan dikumpulkan Allah dalam satu barisan, yaitu dalam waktu yang telah ditentukan, tidaklah mengetahui akan waktu tersebut kecuali hanya Allah semata, itulah hari kiamat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Waqi’ah Ayat 49",
    "description": "49-50. Wahai nabi, katakanlah untuk meyakinkan mereka, 'sesungguhnya orang-orang yang sudah meninggal terdahulu, termasuk kakek moyang mereka, dan orang-orang yang terkemudian, seperti anak cucu mereka, benar-benar akan dikumpulkan di padang mahsyar pada waktu tertentu pada hari yang telah dikenal dan ditetapkan"
  }
]