[
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "50. akan dikumpulkan pada hari Kiamat yang tidak disangsikan, untuk mendapatkan perhitungan amal perbuatan dan pembalasan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "50. لَمَجْمُوعُونَ (benar-benar akan dikumpulkan) Setelah dibangkitkan. إِلَىٰ مِيقٰتِ يَوْمٍ مَّعْلُومٍ (di waktu tertentu pada hari yang dikenal) Yakni pada hari kiamat. Telah diketahui hari kejadiannya oleh Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "50. Mereka dikumpulkan dan dihimpun pada hari yang telah diketahui itu, yaitu hari kiamat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Benar-benar akan dikumpulkan pada waktu tertentu, yaitu hari yang sudah diketahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "49-50. maksudnya, katakanlah (wahai Muhammad) bahwa orang-orang yang terdahulu dan orang-orang yang kemudia, mereka semua akan dibangkitkan keembali oleh Allah dan mereka akan dikumpulkan pada waktu yang ditentukan di hari yang telah diketahui yang telah Allah takdirkan bagi para hambaNya ketika masa penciptaan telah berakhir, dan Allah akan membalas mereka atas amal-amal yang telah mereka perbuat di dunia."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Waqi’ah ayat 50: 49-50. Kemudian Allah memerintahkan Rasul-Nya untuk menjawab mereka dan berkata : Sesungguhnya orang-orang yang telah lalu dan yang akhir dari umat yang mengikutinya; Akan dikumpulkan Allah dalam satu barisan, yaitu dalam waktu yang telah ditentukan, tidaklah mengetahui akan waktu tersebut kecuali hanya Allah semata, itulah hari kiamat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu pada hari Kiamat; hari dimana Allah Subhaanahu wa Ta'aala membalas amal yang mereka kerjakan selama di dunia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Waqi’ah Ayat 50",
    "description": "49-50. Wahai nabi, katakanlah untuk meyakinkan mereka, 'sesungguhnya orang-orang yang sudah meninggal terdahulu, termasuk kakek moyang mereka, dan orang-orang yang terkemudian, seperti anak cucu mereka, benar-benar akan dikumpulkan di padang mahsyar pada waktu tertentu pada hari yang telah dikenal dan ditetapkan. 51-53. Kemudian pada kehidupan di akhirat itu, sesungguhnya kamu wahai orang-orang yang sesat dan selalu berbuat dosa dan maksiat lagi mendustakan ayat-ayat Allah dan dakwah nabi, pasti kamu akan memakan buah pohon zaqqum yang sangat pahit dan tidak enak, dan ketahuilah bahwa kamu tidak hanya memakan satu buah, melainkan akan penuh perutmu dengannya akibat makan dalam jumlah banyak."
  }
]