[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "55. Kemudian kalian, wahai orang-orang yang sesat dari petunjuk yang mendustakan ancaman dan janji Allah, benar-benar akan makan pohon zaqqum, salah satu pohon buruk, perut-perut kalian penuh dengannya karena kalian sangat lapar, lalu kalian minum air yang sangat panas yang tidak menghilangkan dahaga, tetapi kalian minum dengan banyak, seperti minumnya unta haus yang tidak pernah hilang dahaganya karena ia memang sakit."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "55. Dan kalian sangat banyak meminumnya seperti unta yang banyak minum karena sakit usus (selalu kehausan)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "55. فَشٰرِبُونَ شُرْبَ الْهِيمِ (Maka kamu minum seperti unta yang sangat haus minum) Makna (الهيم) adalah unta yang kehausan yang tidak dapat hilang kehausannya akibat penyakit yang menimpanya. Yakni kalian saat meminum air panas tidak akan seperti biasanya, namun kalian akan meminumnya seperti unta yang kehausan yang tidak dapat hilang kehausannya dengan meminum air."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "55. Kalian akan meminum seperti onta yang kehausan, onta yang tidak lagi mendapat minuman untuk menyembuhkan sakit huyam-nya: yaitu penyakit yang menyerupai rasa kehausan yang amat sangat, sehingga onta itu meminum sampai mati atau menjadi sakit."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka kalian minum bagaikan unta yang sangat haus} seperti minumnya unta haus yang tidak hilang kehausannya karena penyakit yang menimpanya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "54-56. Dan minuman mereka juga adalah seburuk-buruk minuman, yaitu bahwa mereka minum (untuk mendorong) makanan tersebut dengan air yang sangat panas yang mendidih di dalam perut, “seperti unta yang sangat haus minum,” yakni, unta kehausan yang rasa hausnya telah memuncak, atau (bisa juga bermakna) bahwa ‘alhiimi’ adalah penyakit yang menyerang unta sehingga ia akan selalu kehausan meskipun telah minum air. “ini” Yakni makanan dan minuman tersebut merupakan “hidangan untuk mereka” maksudnya jamuan bagi mereka “pada Hari Pembalasan”, yaitu jamuan yang telah mereka persembahkan untuk diri mereka sendiri dan mengutamakannya daripada jamuan Allah dan para waliNya. Allah berfirman, “Sesungguhnya orang-orang yang beriman dan beramal saleh, bagi mereka adalah surga Firdaus menjadi tempat tinggal, mereka kekal di dalamnya, mereka tidak ingin berpindah dari padanya.” -Al-Kahfi:108-"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Waqi’ah ayat 55: 51-56. Katakanlah wahai Nabi Allah kepada mereka orang-orang musyrik : Sesungguhnya kalian wahai orang-orang yang tersesat dari jalan tauhid dan hidyah, serta mengingkari hari kebangkitan, kalian akan diberikan makanan dari pohon zaqum, dan ia adalah pohon yang dilaknat, yang tidak enak dilihat dan dimakan. Kalian akan memakannya sampai memenuhi perut-perut kalian. Kemudian kalian akan minum air yang mendidih dengan sebab haus yang sangat yang kalian rasakan, akan tetapi minuman itu tidak menghilangkan dahaga; Kalian minum akan tetapi tidak menghilangkan haus, sebagaimana unta yang sangat haus yang tidak menumukan minuman air. Kemudian ketahuilah bahwa makanan dan minuman ini adalah sajian bagi kalian yang disiapkan di hari kiamat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Waqi’ah Ayat 55",
    "description": "54-56. Wahai orang yang sesat, sesudah memenuhi perut dengan buah zaqqum yang sangat tidak enak itu, kamu akan meminum air yang sangat panas dan membakar lidah. Meski demikian, karena dahaga yang sangat mencekik maka kamu minum air panas itu seperti unta yang sangat haus minum. Itulah beragam hidangan menyakitkan yang kami sediakan untuk mereka yang selalu ingkar dan berbuat maksiat, pada hari pembalasan'"
  }
]