[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "57. Kami menciptakan kalian (wahai manusia) dan sebelumnya kalian bukan sesuatu; maka mengapa kalian tidak membenarkan kebangkitan kembali?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "57. Kami menciptakan kalian -wahai orang-orang yang mendustakan- yang sebelumnya kalian tidak ada, maka kenapa kalian tidak membenarkan bahwa Kami akan membangkitkan kalian dalam keadaan hidup setelah kematian kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "57-61. Hai manusia, Kami -dengan keagungan dan kekuasaan Kami- yang telah menciptakan kalian, maka mengapa kalian tidak mempercayai kebangkitan? Sampaikanlah kepada-Ku tentang air mani yang kalian pancarkan ke dalam rahim, apakah kalian yang menciptakan air mani ini menjadi manusia yang sempurna, atau Kami yang mampu menciptakannya? Kami tetapkan kematian bagi kalian, dan Kami tidak kesulitan untuk menghancurkan kalian kemudian mengganti kalian dengan kaum yang lain yang lebih taat daripada kalian. Dan Kami tidak kesulitan kembali menciptakan kalian pada hari kiamat dengan penciptaan yang tidak kalian ketahui."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "57. نَحْنُ خَلَقْنٰكُمْ فَلَوْلَا تُصَدِّقُونَ (Kami telah menciptakan kamu, maka mengapa kamu tidak membenarkan?) Kami telah menciptakan kalian padahal sebelumnya kalian bukanlah sesuatu apapun, dan kalian mengetahui hal itu; tapi mengapa kalian tidak percaya terhadap kebangkitan sebagaimana percaya terhadap penciptaan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "57. Kami Yang telah berkuasa menciptakan kalian wahai manusia, lalu kenapa kalian tidak mempercayai dan mengimani hari kebangkitan dan hari dimana kalian akan dikembalikan seperti sedia kala?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kami telah menciptakan kalian. Mengapa kalian tidak membenarkan} mengapa kalian tidak membenarkan kebangkitan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "57. Kemudian Allah menyebutkan dalil secara akal yang menunjukkan (kebenaran) Hari Kebangkitan seraya berfirman, “Kami telah menciptakan kamu, maka mengapa kamu tidak membenarkan (hari berbangkit)?” maksudnya, Kamilah yang telah menciptakan kalian setelah sebelumnya kalian bukanlah sesuatu yang dapat disebut, (Kami telah menciptakan kalian) tanpa kelelahan maupun kecapaian, bukankah Allah Yang Mahamampu melakukan itu semua juga mampu untuk menghidupkan kembali orang yang telah mati? Tentu, sesungguhnya Dia Mahakuasa atas segala sesuatu. Oleh sebab itu Allah mencela mereka karena tidak mempercayai adanya Hari Kebangkitan sedangkan mereka menyaksikan (tanda-tanda) yang lebih besar dan lebih kuat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Waqi’ah ayat 57: Ketahuilah wahai manusia bahwa Allahlah yang menciptakan kalian dan tidak yang lainnya, lalu mengapa kalian tidak membenarkan hari kebangkitan ?Apakah ada selain Allah yang menciptakan kalian yang tanpa permisalan, kemudian lemah dalam mengembalikan (membangkitkan) kalian ?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala menyebutkan dalil ‘aqli (akal) yang menunjukkan adanya kebangkitan. Padahal yang mampu menciptakan pasti mampu mengulangi penciptaan kembali."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Waqi’ah Ayat 57",
    "description": "Setelah menjelaskan azab bagi orang yang mengingkari hari kebangkitan, pada ayat-ayat ini Allah menguraikan tanda-tanda kekuasaan-Nya yang terkait kiamat tersebut. Wahai manusia, kami yang mahakuasa telah menciptakan kamu, maka saat kamu mengetahui hal itu, mengapa kamu tidak membenarkan adanya penciptaan dan kebangkitan'58-59. Maka adakah kamu perhatikan, wahai manusia yang ingkar, tentang benih manusia yang kamu pancarkan' kamukah yang menciptakannya untuk kemudian menjadi manusia utuh, atau kami yang menciptakannya'."
  }
]