[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "58-59. Tidakkah kalian memperhatikan setetes air yang kalian masukkan ke dalam Rahim istri-istri kalian? Apakah kalian yang menciptakan bayi itu atau Kami yang menciptakan?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "58. Tidakkah kalian lihat -wahai manusia- air mani yang kalian pancarkan ke dalam rahim istri-istri kalian?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "58. أَفَرَءَيْتُم مَّا تُمْنُونَ (Maka terangkanlah kepadaku tentang nutfah yang kamu pancarkan) Yakni air mani yang kalian pancarkan ke dalam rahim istri-istri kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "58. Apakah kalian tidak memperhatikan, mani yang kalian keluarkan dan masuk dalam rahim?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apakah kalian memperhatikan apa yang kalian pancarkan} air mani yang kalian pancarkan dalam rahim istri kalian"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "58-62. Maksudnya, “Apakah kamu memperhatikan” awal penciptaan kalian berupa air mani “yang kamu pancarkan.” Apakah kalian yang menciptakan mani itu dan apa yang tumbuh darinya, ataukah Allah Yang menciptakannya? Allah Yang telah menciptakan pada diri kalian nafsu syahwat dan alatnya bagi laki-laki dan perempuan, dan menunjuki setiap dari keduanya kepada hal tersebut, Yang telah menjadikan di antara kalian rasa kasih dan sayang sebagai sebab adanya reproduksi. Karena itulah Allah menjelaskan kepada mereka dengan berdalil dengan penciptaan yang pertama atas penciptaan yang kedua, dengan berfirman, “Dan sesungguhnya kamu telah mengetahui penciptaan yang pertama, maka mengapakah kamu tidak mengambil pelajaran (untuk penciptaan yang kedua)?” bahwa Allah Yang Mahakuasa atas penciptaan kalian yang pertama adalah kuasa (juga) untuk membangkitkan kalian kembali."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Waqi’ah ayat 58: 58-59. Allah menyebutkan empat bukti sebagai benarnya kebangkitan dan benarnya kejadian hari kebangkitan tersebut; Allah berkata menyebutkan bukti pertama : Kabarkan kepadaku wahai orang-orang musyrik, tentang mani yang dipancarkan di rahim istri-istri kalian, apakah kalian yang menciptakannya, begitu juga sperma yang kalian hasilkan dan jenis kelamin laki-laki maupun perempuan, apakah kalian yang menciptakan ? Ataukah Allah yang menciptakan dan kuasa atasnya ?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Di rahim istri-istrimu. Maksudnya, tidakkah kamu perhatikan awal penciptaan kamu yang berasal dari mani, apakah kamu yang menciptakan mani itu dan apa yang terjadi setelahnya, yakni menjadi segumpal darah, lalu menjadi segumpal daging dan menjadi manusia, ataukah Allah yang menciptakannya?"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Waqi’ah Ayat 58",
    "description": "58-59. Maka adakah kamu perhatikan, wahai manusia yang ingkar, tentang benih manusia yang kamu pancarkan' kamukah yang menciptakannya untuk kemudian menjadi manusia utuh, atau kami yang menciptakannya'58-59"
  }
]