[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "4-6. apabila bumi diguncang dengan kuat sekali, gunung-gunung dihancurkan berkeping-keping, sehingga ia menjadi debu yang beterbangan di udara disapu angin."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Dari penghancuran ini menjadikannya debu yang bertebaran, tidak menetap."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6-7. Dan menjadi debu yang bertebaran kemana-mana. Kalian akan dikategorikan menjadi tiga golongan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan menjadi debu yang beterbangan} debu yang bertebaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4-6. “Apabila bumi digoncangkan sedahsyat-dahsyatnya,” maksudnya, digerakkan dan diobrak-abrik, “dan gunung-gunung dihancur-luluhkan sehancur-hancurnya” maksudnya diluluh-lantakkan, “maka jadilah ia debu yang beterbangan” sehingga di bumi tidak ada gunung atau tanda apa pun, datar sama sekali, kamu tidak melihat tempat yang rendah maupun yang tinggi sama sekali padanya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Waqi’ah ayat 6: Allah menjelaskan bahwa gunung-gunung kondisinya luluh lantah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sehingga bumi menjadi rata tidak ada tempat yang tinggi dan tidak ada tempat yang rendah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Waqi’ah Ayat 6",
    "description": "4-6. Apabila bumi digoncangkan sedahsyat-dahsyatnya pada saat kiamat dan gempa hebat di seluruh penjuru bumi menghancurkan apa saja yang ada di atasnya (lihat pula: surah az-zalzalah/99: 1), dan ketika itu gunung-gunung dihancur-luluhkan seluluh-luluhnya, maka jadilah ia debu yang beterbangan bagai bulu tertiup angin ke segala arah (lihat pula: su-rah al-q'ri'ah/101: 5). 7-10. Dan pada saat kiamat itu kamu, wahai manusia, akan terbagi menjadi tiga golongan. Yaitu golongan kanan; mereka itulah orang yang beriman kepada Allah, melaksanakan perintah-Nya, dan menjauhi larangan-Nya. Alangkah mulianya golongan kanan itu karena mereka akan mendapat karunia yang dia janjikan. Dan yang kedua adalah golongan kiri, yaitu mereka yang ingkar dan berbuat kemaksiatan. Alangkah sengsaranya golongan kiri itu karena mereka akan mendapat hukuman akibat kemungkarannya. Dan yang ketiga adalah orang-orang yang paling dahulu beriman pada dakwah rasulullah. Karena itu, merekalah yang paling dulu masuk surga sebagai balasan atas keimanan dan ketaatannya."
  }
]