[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "60-61. Kami menetapkan kematian di antara kalian. Kami tidak lemah untuk merubah penciptaan kalian di Hari Kiamat dan menghidupkan kalian dalam keadaan dan sifat yang kalian tidak ketahui."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "60. Kami telah mentakdirkan kematian di antara kalian, dan masing-masing dari kalian mempunyai ajal, tidak maju dan tidak pula mundur, dan Kami tidaklah lemah,"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "60. نَحْنُ قَدَّرْنَا بَيْنَكُمُ الْمَوْتَ (Kami telah menentukan kematian di antara kamu) Yakni Kami tentukan waktu bagi setiap kalian, sehingga sebagian kalian meninggal ketika telah berusia lanjut dan sebagian lalinnya meninggal ketika masih kecil. Namun seluruh penduduk bumi akan mati semua. وَمَا نَحْنُ بِمَسْبُوقِينَ(dan Kami sekali-sekali tidak akan dapat dikalahkan) Namun Kami-lah yang berkuasa."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "60. Kami-lah Yang menentukan dan menetapkan kematian atas setiap orang dengan ketentuan, ketetapan dan waktu yang tertentu juga. Kami bukanlah golongan yang lemah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami telah menentukan kematian di antara kalian dan Kami tidak lemah} lemah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "58-62. Maksudnya, “Apakah kamu memperhatikan” awal penciptaan kalian berupa air mani “yang kamu pancarkan.” Apakah kalian yang menciptakan mani itu dan apa yang tumbuh darinya, ataukah Allah Yang menciptakannya? Allah Yang telah menciptakan pada diri kalian nafsu syahwat dan alatnya bagi laki-laki dan perempuan, dan menunjuki setiap dari keduanya kepada hal tersebut, Yang telah menjadikan di antara kalian rasa kasih dan sayang sebagai sebab adanya reproduksi. Karena itulah Allah menjelaskan kepada mereka dengan berdalil dengan penciptaan yang pertama atas penciptaan yang kedua, dengan berfirman, “Dan sesungguhnya kamu telah mengetahui penciptaan yang pertama, maka mengapakah kamu tidak mengambil pelajaran (untuk penciptaan yang kedua)?” bahwa Allah Yang Mahakuasa atas penciptaan kalian yang pertama adalah kuasa (juga) untuk membangkitkan kalian kembali."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Waqi’ah ayat 60: 60-61. Ketahuilah wahai manusia bahwa Allah sajalah yang kuasa mematikan kalian dengan berbagai macam bentuk kematian yang Dia kehendaki, dan bahwasanya Allah tidak ada yang mampu melemahkan-Nya untuk dapat mencelakakan kalian dan menggantikan dengan ciptaan yang lain semisal dengan kalian (manusia). Allah juga tidak dapat dilemahkan akan ciptan-Nya pada hari kiamat, dan Allah menjadikan kalian tidak mengetahui bagaimana rupa (bentuk) kalian di hari kiamat yang berhubungan dengan kehidupan kalian yang abadi dan baru. Maka penghuni surga memiliki sifat dan kondisi sesuai keadaan mereka, begitu juga penghuni nereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Waqi’ah Ayat 60",
    "description": "60-61. Wahai orang yang ingkar, ketahuilah bahwa kami telah menentukan kematian masing-masing di antara kamu sesuai kehendak kami, dan kami sekali-kali tidak pernah merasa lemah untuk menggantikan kamu yang ingkar dengan orang-orang yang seperti kamu di dunia ini, dan kami berkuasa pula untuk membangkitkan kamu kelak di akhirat dalam keadaan yang tidak kamu ketahui"
  }
]