[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "60-61. Kami menetapkan kematian di antara kalian. Kami tidak lemah untuk merubah penciptaan kalian di Hari Kiamat dan menghidupkan kalian dalam keadaan dan sifat yang kalian tidak ketahui."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "61. untuk mengganti penciptaan dan bentuk kalian sebagaimana yang telah kalian ketahui, dan menjadikan kalian dalam penciptaan dan bentuk yang tidak kalian ketahui."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "61. عَلَىٰٓ أَن نُّبَدِّلَ أَمْثٰلَكُمْ (untuk menggantikan kamu dengan orang-orang yang seperti kamu) Yakni Kami datangkan makhluk seperti kalian sebagai pengganti kalian. وَنُنشِئَكُمْ فِى مَا لَا تَعْلَمُونَ(dan menciptakan kamu dalam keadaan yang tidak kamu ketahui) Yakni dalam bentuk dan rupa yang tidak kalian ketahui. Imam Al-Hasan mengatakan: yakni Kami menjadikan kalian kera dan babi sebagaimana yang telah Kami lakukan pada kaum-kaum sebelum kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "61. Kami tidak lemah untuk menciptakan makhluk pengganti kalian atau yang serupa dengan kalian atau bahkan Kami mampu mencpitakan makhluk yang lebih baik dari kalian. Kami juga kuasa untuk menjadikan kalian dengan rupa yang buruk, yang bahkan kalian tidak bisa menggambarkan keburukannya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{untuk mengubah bentuk kalian} Kami mengubah penciptaan kalian {dan menciptakan kalian dalam keadaan yang tidak kalian ketahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "58-62. Maksudnya, “Apakah kamu memperhatikan” awal penciptaan kalian berupa air mani “yang kamu pancarkan.” Apakah kalian yang menciptakan mani itu dan apa yang tumbuh darinya, ataukah Allah Yang menciptakannya? Allah Yang telah menciptakan pada diri kalian nafsu syahwat dan alatnya bagi laki-laki dan perempuan, dan menunjuki setiap dari keduanya kepada hal tersebut, Yang telah menjadikan di antara kalian rasa kasih dan sayang sebagai sebab adanya reproduksi. Karena itulah Allah menjelaskan kepada mereka dengan berdalil dengan penciptaan yang pertama atas penciptaan yang kedua, dengan berfirman, “Dan sesungguhnya kamu telah mengetahui penciptaan yang pertama, maka mengapakah kamu tidak mengambil pelajaran (untuk penciptaan yang kedua)?” bahwa Allah Yang Mahakuasa atas penciptaan kalian yang pertama adalah kuasa (juga) untuk membangkitkan kalian kembali."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Waqi’ah ayat 61: 60-61. Ketahuilah wahai manusia bahwa Allah sajalah yang kuasa mematikan kalian dengan berbagai macam bentuk kematian yang Dia kehendaki, dan bahwasanya Allah tidak ada yang mampu melemahkan-Nya untuk dapat mencelakakan kalian dan menggantikan dengan ciptaan yang lain semisal dengan kalian (manusia). Allah juga tidak dapat dilemahkan akan ciptan-Nya pada hari kiamat, dan Allah menjadikan kalian tidak mengetahui bagaimana rupa (bentuk) kalian di hari kiamat yang berhubungan dengan kehidupan kalian yang abadi dan baru. Maka penghuni surga memiliki sifat dan kondisi sesuai keadaan mereka, begitu juga penghuni nereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Waqi’ah Ayat 61",
    "description": "60-61. Wahai orang yang ingkar, ketahuilah bahwa kami telah menentukan kematian masing-masing di antara kamu sesuai kehendak kami, dan kami sekali-kali tidak pernah merasa lemah untuk menggantikan kamu yang ingkar dengan orang-orang yang seperti kamu di dunia ini, dan kami berkuasa pula untuk membangkitkan kamu kelak di akhirat dalam keadaan yang tidak kamu ketahui. 62. Allah pencipta seluruh makhluk, termasuk manusia. Dan sungguh, wahai orang yang mengingkari kebangkitan, kamu telah mengetahui bahwa Allah yang mahakuasa telah melakukan penciptaan manusia yang pertama, maka tentu dia kuasa pula untuk menghidupkan kembali mereka yang sudah mati pada penciptaan kedua. Maka, mengapakah kamu tidak mengambil pelajaran dari kekuasaan-Nya itu untuk meyakini adanya kebangkitan'"
  }
]