[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "62. Sungguh kalian telah tahu bahwa Allah yang menciptakan kalian pertama kali dan saat itu kalian bukan sesuatu. Maka tidakkah kalian mengingat Kuasa Allah untuk menghidupkan kalian kembali?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "62. Dan sungguh kalian telah mengetahui bagaimana Kami menciptakan kalian pada awal penciptaan, maka apakah kalian tidak mengambil pelajaran dan mengerti bahwa yang menciptakan kalian pertama kali mampu untuk membangkitkan kalian setelah kematian kalian"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "62. Sungguh kalian telah mengetahui bahwa Allah-lah yang menciptakan kalian pertama kali sebelum kalian belum menjadi sesuatu apapun. Maka mengapa kalian tidak mengingat kuasa Allah untuk menciptakan kalian sekali lagi."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "62. وَلَقَدْ عَلِمْتُمُ النَّشْأَةَ الْأُولَىٰ (Dan Sesungguhnya kamu telah mengetahui penciptaan yang pertama) Yakni permulaan penciptaan dari air mani, kemudian segumpal darah, lalu segumpal daging, dan katika itu kalian belum menjadi makhluk apapun. فَلَوْلَا تَذَكَّرُونَ(maka mengapakah kamu tidak mengambil pelajaran) Yakni mengapa kalian tidak mengingat kekuasaan Allah dalam penciptaan yang kedua dengan membandingkannya dengan penciptaan yang pertama."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "62. Sebenarnya kalian sudah tahu dan faham, bahwa Allah-lah yang telah menciptakan kalian pada kehidupan yang lalu (di dunia), apakah kalian tidak ingat akan itu? Siapa Yang Berkuasa menciptakan sesuatu, Dia akan berkuasa mengembalikan/membangkitkannya kembali yaitu pada hari kebangkitan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh kalian benar-benar telah mengetahui penciptaan yang pertama} penciptaan yang pertama {Mengapa kalian tidak mengambil pelajaran i"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "58-62. Maksudnya, “Apakah kamu memperhatikan” awal penciptaan kalian berupa air mani “yang kamu pancarkan.” Apakah kalian yang menciptakan mani itu dan apa yang tumbuh darinya, ataukah Allah Yang menciptakannya? Allah Yang telah menciptakan pada diri kalian nafsu syahwat dan alatnya bagi laki-laki dan perempuan, dan menunjuki setiap dari keduanya kepada hal tersebut, Yang telah menjadikan di antara kalian rasa kasih dan sayang sebagai sebab adanya reproduksi. Karena itulah Allah menjelaskan kepada mereka dengan berdalil dengan penciptaan yang pertama atas penciptaan yang kedua, dengan berfirman, “Dan sesungguhnya kamu telah mengetahui penciptaan yang pertama, maka mengapakah kamu tidak mengambil pelajaran (untuk penciptaan yang kedua)?” bahwa Allah Yang Mahakuasa atas penciptaan kalian yang pertama adalah kuasa (juga) untuk membangkitkan kalian kembali."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Waqi’ah ayat 62: Allah mencela mereka karena sebab tidak menggunakan akal-akal mereka; Dan menyampaikan pemikiran mereka aga mereka berpikir akan kondisi mereka. Allah berkata : Sungguh kalian wahai orang-orang musyrik, bahwa kalian mengetahui dengan yakin akan penciptaan kalian yang pertama kali dari sperma, kemudian darah, kemudian daging, maka kondisi untuk mengembalikan kalian lebih mudah daripada menciptakan kalian pada kali pertama yang tidak berwujud apapun; Bersamaan dengan itu tidak ada yang sulit bagi Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu bahwa yang menciptakan pertama kali tentu mampu menciptakan kembali setelah mereka mati."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Waqi’ah Ayat 62",
    "description": "Allah pencipta seluruh makhluk, termasuk manusia. Dan sungguh, wahai orang yang mengingkari kebangkitan, kamu telah mengetahui bahwa Allah yang mahakuasa telah melakukan penciptaan manusia yang pertama, maka tentu dia kuasa pula untuk menghidupkan kembali mereka yang sudah mati pada penciptaan kedua. Maka, mengapakah kamu tidak mengambil pelajaran dari kekuasaan-Nya itu untuk meyakini adanya kebangkitan' 63-64. Maka terangkanlah kepadaku, wahai pengingkar, tentang benih yang kamu tanam di ladang. Kamukah yang menumbuhkannya hingga menjadi tanaman atau kamikah yang menumbuhkannya hingga menjadi besar dan berbuah'."
  }
]