[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "63-67. Tidakkah kalian memperhatikan tanaman yang kalian tanam? Apakah kalian yang menghidupkannya dari bumi atau Kami yang menetapkan batangnya di bumi? Bila Kami berkehendak, niscaya Kami menjadikan tanaman tersebut rontok mengering sehingga tidak bisa dimakan, lalu kalian heran terhadap apa yang menimpa tanaman kalian. Kalian berkata, “Sungguh kami merugi dan diazab. Kami gagal panen dan tidak mendapatkan rizki.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "64. Apakah kalian yang menumbuhkan benih itu ataukah Kami yang menumbuhkannya?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "64. ءَأَنتُمْ تَزْرَعُونَهُۥٓ (Kamukah yang menumbuhkannya) Yakni apakah kalian yang menumbuhkan dan menjadikannya tanaman lalu menghasilkan malai dan biji-bijian. أَمْ نَحْنُ الزّٰرِعُونَ (atau Kamikah yang menumbuhkannya) Yakni ataukah Kami yang menumbuhkan dan menjadikannya tumbuhan? Jika kalian mengakui hal ini maka kenapa kalian mengingkari kebangkitan?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "64. Apakah yang menanam dan menumbuhkan berbagai macam tanaman dan pepohonan itu adalah kalian? Atau-kah Kami?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apakah kalian yang menumbuhkannya} menumbuhkannya {atau Kami yang menumbuhkan} yang menumbuhkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "63-67. Ini adalah karunia Allah bagi hamba-hambaNya, dengannya Dia menyeru para hamba agar mengesakanNya, beribadah kepadaNya, dan kembali kepadaNya, di mana Dia telah menganugerahkan nikmat kepada mereka dengan apa-apa yang memudahkan mereka berupa sawah, ladang, pohon, buah, kemudian keluar darinya berbagai macam jenis makanan, rizki, dan buah-buahan yang merupakan kebutuhan pokok dan kemaslahatan mereka yang tidak mungkin bagi mereka untuk dapat menghitungnya, apalagi mensyukuri dan menunaikan haknya. Oleh karena itu Allah menetapkan karuniaNya dengan berfirman, “Kamukah yang menumbuhkannya atau Kami-kah yang menumbuhkannya?” maksudnya, apakah kalian yang mengeluarkannya dari bumi dalam bentuk tanaman, atau apakah kalian yang mengeluarkan bulir dan buahnya sehingga menjadi tanaman yang siap dipanen dan buah yang sudah matang? Atau hanya Allah-lah semata yang melakukan itu semua dan menganugerahkannya kepada kalian? Usaha maksimal yang bisa kalian lakukan hanyalah mengolah dan membajak tanah kemudian menabur benih padanya, setelah itu kalian sama sekali tidak tahu apa yang akan terjadi setelah itu dan tidak ada kekuasaan bagi kalian yang lebih dari hal tersebut. Namun meski demikian, Allah memperingatkan kalian bahwa tanaman itu berpotensi rusak jika bukan karena penjagaan Allah dan perlindunganNya, sebagai nafkah dan kesenangan sampai waktu tertentu. Dia berfirman, “Kalau Kami kehendaki, benar-benar Kami jadikan dia” maksudnya tanaman tersebut beserta apa yang ada padanya berupa buah-buahan, menjadi “kering dan hancur” maksudnya hancur berantakan, tidak ada manfaat dan rizki padanya sama sekali, “maka jadilah kamu” maksudnya disebabkan tanaman itu menjadi hancur setelah kalian lelah menanamnya dan telah mengeluarkan banyak harta untuknya “heran tercengang”, maksudnya, kalian akan menyesali apa yang menimpa kalian, sehingga dengan demikian akan sirna kebahagiaan, kesenangan, dan kegembiraan kalian, kemudian kalian akan mengatakan, “SEsungguhnya kami benar-benar menderita kerugian,” yakni bahwa sesungguhnya kami telah ditimpa musibah yang membinasakan kami. Kemudian setelah itu kalian akan tahu dari mana sebenarnya kalian datang, dan karena sebab apakah kalian tertimpa musibah. Lalu kalian mengatakan, “Bahkan kami menjadi orang yang tidak mendapat hasil apa-apa”! Oleh karena itu, panjatkanlah pujian ke hadirat Allah yang telah menanamnya untuk kalian, kemudian memelihara dan menyempurnakannya (hingga waktu panen), dan tidak mengirim perusak-perusak yang membuat kalian tidak dapat mendapatkan manfaat dan kebaikannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Waqi’ah ayat 64: 63-67. Ini adalah bukti yang kedua atas benarnya akan kebangkitan, dimana Allah berkata : Kabarkan kepada-Ku tentang benih yang tumbuh di tanah kalian, apakah kalian yang menumbuhkan tumbuhan dari bumi ?! Ataukah Kami yang menumbuhkannya ? Jika seandainya Kami menjadikannya (bumi) untuk bercocok tidak berbuah, dan tidak memiliki manfaat, maka kalian akan tercengang berkepanjangan karena cocok tanam kalian tanpa membuahkan hasil, dan berkatalah mereka yang keheranan : Sungguh kami adalah orang-orang yang merugi dengan kerugian yang besar; Hilang dari kami hasil (bercocok tanam) tanpa hasil yang sesuai; Bahkan Kami jadikan mereka tidak mendapatkan hasil apa-apa dari bercocok tanam mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni apakah kamu yang megeluarkannya dari dalam bumi atau menumbuhkannya atau mengeluarkan tangkai dan buahnya sehingga menjadi biji yang dapat dipanena dan buah yang masak? Ataukah Allah yang sendiri melakukannya dan memberimu nikmat dengannya. Perbuatan kamu hanyalah menggarap tanah, menabur benih dan menyiraminya selanjutnya kamu tidak mengetahui apa yang terjadi dan kamu tidak berkuasa lagi setelahnya. Oleh karena itu, Allah Subhaanahu wa Ta'aala mengingatkan kita bahwa tanaman yang kita tanam sesungguhnya siap menerima bahaya jika Allah tidak menjaganya dan memeliharanya, agar menjadi bahan makanan bagi kita sampai waktu tertentu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Waqi’ah Ayat 64",
    "description": "63-64. Maka terangkanlah kepadaku, wahai pengingkar, tentang benih yang kamu tanam di ladang. Kamukah yang menumbuhkannya hingga menjadi tanaman atau kamikah yang menumbuhkannya hingga menjadi besar dan berbuah'65-67. Sekiranya kami kehendaki, pepohonan subur dan berbuah lebat yang kami tumbuhkan itu dapat kami hancurkan sampai kering dan lumat sehingga tidak lagi bermanfaat. Bila hal ini terjadi maka kamu akan heran dan tercengang sambil berkata, 'sesungguhnya, akibat peristiwa tidak terduga itu, kami benar-benar menderita kerugian yang sangat besar, bahkan kami benar-benar akan menjadi orang yang tidak mendapat hasil apa-apa. '."
  }
]