[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "68-69. Tidakkah kalian memperhatikan air yang kalian minum sehingga karenanya kalian hidup? Apakah kalian yang menurunkannya dari awan ke bumi atau Kami yang menurunkannya sebagai rahmat dari Kami kepada kalian?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "69. Apakah kalian yang menurunkannya dari awan di langit ataukah Kami yang menurunkannya?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "69. ءَأَنتُمْ أَنزَلْتُمُوهُ مِنَ الْمُزْنِ (Kamukah yang menurunkannya) Yakni dari awan. أَمْ نَحْنُ الْمُنزِلُونَ (atau Kamikah yang menurunkannya) Dengan kuasa Kami semata. Maka bagaimana kalian tidak percaya terhadap keesaan Allah dan terhadap hari kebangkitan?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "69. Kalian-kah yang telah menurunkan air itu dari awan, ataukah Kami yang telah menurunkannya dengan kehendak dan kuasa Kami tanpa bantuan dari siapapun? Muznun jamak dari muznatun"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah kalian yang menurunkannya dari awan} awan {atau Kami yang menurunkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "68-70. Tatkala Allah menyebutkan nikmat yang Dia anugerahkan kepada hamba-hambaNya berupa makanan, Dia (juga) menyebutkan nikmatNya kepada mereka berupa air minum segar yang mereka minum, dan bahwa sekiranya Allah tidak memudahkannya, niscaya tidak ada jalan bagi kalian untuk mendapatkannya, dan bahwa Dia lah Yang telah menurunkannya “dari awan” yakni awan dan hujan yang telah diturunkan oleh Allah, sehingga dengannya terciptalah sungai-sungai yang mengalir di atas bumi dan di dalamnya,dan terciptalah mata air-mata air yang memancar deras. Dan di antara nikmatNya adalah bahwa Dia menjadikan air itu tawar lagi segar yang disukai oleh jiwa, dan jika Dia menghendaki, Dia dapat menjadikannya “asin” lagi pahit sehingga tidak dapat dimanfaatkan. “Maka mengapakah kamu tidak bersyukur” kepada Allah Yang telah menganugerahkan nikmat-nikmatNya itu kepada kalian?"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Waqi’ah ayat 69: 68-70. Ini adalah bukti yang ketiga atas benarnya kebangkitan, dimana Allah berkata : Kabarkan kepadaku tentang air segar yang bersih, yang kalian minum, apakah kalian yang menurunkan dari awan ?! Ataukah Kami yang menurunkan kepada kalian, dan mengalirkan kepada kalian untuk diambil manfaatnya! Kalau saja Kami kehendaki kami jadikan air itu asin dan kotor sehingga tidak dapat diminum! Amat buruk rasa syukur kalian kepada Allah, yang Dia memberikan kepada kalian nikmat; Maka esakanlah Allah dan taatilah Rasulullah ﷺ!"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Waqi’ah Ayat 69",
    "description": "68-70. Pernahkah pula kamu memperhatikan air yang kamu minum tiap hari' kamukah yang menurunkannya dari awan ataukah kami yang menurunkan air itu' ketahuilah, kalau kami kehendaki niscaya kami menjadikannya asin sehingga tidak layak minum. Maka, mengapakah kamu tidak bersyukur atas anugerah Allah yang besar itu'68-70"
  }
]