[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "7. Kalian (wahai makhluk) terbagi menjadi tiga kelompok."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Dan kalian saat itu terbagi menjadi tiga golongan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "7-16. Dan ketika itu kalian -hai para hamba- akan terbagi menjadi tiga golongan: Golongan kanan yang berada di derajat yang tinggi, betapa mulianya derajat mereka! Golongan kiri yang berada di derajat yang rendah, betapa menderitanya keadaan mereka! Dan golongan yang bersegera melakukan kebaikan-kebaikan ketika di dunia, mereka adalah golongan yang bersegera menuju kenikmatan yang kekal di akhirat, orang-orang yang memiliki derajat yang tinggi ini adalah orang-orang yang didekatkan kepada Allah pada kedudukan yang mulia dan surga-surga yang penuh kenikmatan, surga-surga ini akan dimasuki oleh banyak orang dari umat-umat terdahulu dan sedikit saja dari umat-umat setelah mereka; mereka adalah para pengikut Nabi Muhammad dari generasi-generasi awal dan generasi-generasi selanjutnya; mereka duduk di atas dipan-dipan yang ditenun dengan benang emas, mereka bersandar padanya dengan saling berhadap-hadapan agar mereka semakin merasakan ketentraman dan kenikmatan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6-7. Dan menjadi debu yang bertebaran kemana-mana. Kalian akan dikategorikan menjadi tiga golongan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kalian menjadi tiga golongan} golongan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7-9. “Dan kamu” wahai para hamba “menjadi tiga golongan,” maksudnya, kalian terbagi menjadi tiga kelompok sesuai dengan amalan baik dan buruk kalian. Kemudian Allah menyebutkan secara terperinci tentang keadaan tiga golongan tersebut dengan berfirman, “Yaitu golongan kanan, alangkah mulianya golongan kanan itu” sebagai bentuk pengagungan bagi kedudukan dan keadaan mereka. “Dan golongan kiri, alangkah sengsaranya golongan kiri itu,” dan ini menjelaskan betapa mengerikan keadaan mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Waqi’ah ayat 7: Allah menjelaskan bahwa manusia terbagi menjadi tiga golongan. Dua golongan masuk surga, dan golongan yang lainnya masuk ke dalam neraka. Dan yang benar menurut arah pembicaraan dalam ayat ini adalah pembebanan syariat kepada jin dan manusia dari awal sampai akhir, dan bukan hanya turunnya sebuah ayat kepada mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sesuai amal yang kamu kerjakan selama di dunia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Waqi’ah Ayat 7",
    "description": "7-10. Dan pada saat kiamat itu kamu, wahai manusia, akan terbagi menjadi tiga golongan. Yaitu golongan kanan; mereka itulah orang yang beriman kepada Allah, melaksanakan perintah-Nya, dan menjauhi larangan-Nya. Alangkah mulianya golongan kanan itu karena mereka akan mendapat karunia yang dia janjikan. Dan yang kedua adalah golongan kiri, yaitu mereka yang ingkar dan berbuat kemaksiatan. Alangkah sengsaranya golongan kiri itu karena mereka akan mendapat hukuman akibat kemungkarannya. Dan yang ketiga adalah orang-orang yang paling dahulu beriman pada dakwah rasulullah. Karena itu, merekalah yang paling dulu masuk surga sebagai balasan atas keimanan dan ketaatannya"
  }
]