[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "71-72. Tidakkah kalian memperhatikan api yang kalian nyalakan. Apakah kalian yang menumbuhkan pohonnya yang menjadi bahan api atau Kami yang menumbuhkkannya?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "71. Apakah kalian melihat api yang kalian nyalakan untuk kalian manfaatkan?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "71-73. Katakanlah kepada-Ku tentang api yang kalian nyalakan dari kayu; apakah kalian yang menciptakan pohonnya, atau Kami yang menciptakannya? Kami menjadikan api di dunia sebagai peringatan bagi kalian dari api neraka, dan Kami menciptakannya untuk dimanfaatkan para musafir."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "71. أَفَرَءَيْتُمُ النَّارَ الَّتِى تُورُونَ (Maka terangkanlah kepadaku tentang api yang kamu nyalakan) Yakni api yang kalian hasilkan dari kayu yang berasal dari pohon yang basah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "71-72. Kabarkan kepada-Ku tentang api yang kalian nyalakan dengan bantuan kayu-kayu pepohonan. Kalian mengesek dengan gesekan yang kuat sehingga tersulutlah api dari gesekan kayu itu. Layaknya batu yang mengandung besi, kalian pukul-pukulkan sehingga keluarlah percikan api. Bukankah Kami yang menumbuhkan kayu itu dengan kekuasaan Kami, tanpa bantuan kalian sedikitpun? Kayu-kayu yang dapat digunakan untuk pemantik/penyulut api ini di kalangan orang Arab antara lain adalah pohon markh, ‘ifar, kalkh"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah kalian memperhatikan api yang kalian nyalakan} yang kalian nyalakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "71-73. Ini adalah nikmat yang masuk kepada kategori kebutuhan pokok yang pasti dibutuhkan oleh makhluk, karena sesungguhnya manusia membutuhkan kenikmatan tersebut dalam banyak perkara dan kebutuhan mereka. Allah menyatakan kepada mereka (agar mereka mengakui), akan api yang Dia ciptakan pada pepohonan, dan bahwa makhluk tidaklah dapat menciptakannya, akan tetapi hanya Allah-lah Yang menciptakan (api itu) dari pepohonan yang hijau, kemudian ia menjadi api yang dinyalakan sesuai dengan kebutuhan para hamba, lalu apabila mereka telah selesai dari kebutuhan mereka, maka mereka memadamkan dan mematikannya. “Kami menjadikan api itu untuk peringatan” bagi para hamba terhadap nikmat Rabb mereka, dan sebagai peringatan (bagi mereka) akan Neraka Jahanam yang telah Allah persiapkan untuk orang-orang yang bermaksiat kepadaNya, serta menjadikannya sebagai cemeti untuk menuntun hamba-hambaNya kepada surga yang penuh dengan kenikmatan, “dan bahan yang berguna bagi musafir di padang pasir.” Maksud dari kata al-Muqwin adalah orang-orang yang mengambil manfaat atau para musafir. Allah mengkhususkan para musafir adalah karena manfaat api itu bagi musafir lebih besar daripada bagi selainnya, atau bisa jadi sebabnya adalah karena dunia ini, semuanya adalah tempat melakukan safar, dan seorang hamba dari sejak dilahirkan adalah seorang musafir (orang yang melakukan perjalanan) menuju Rabbnya. Api ini telah dijadikan oleh Allah sebagai bahan yang berguna bagi musafir di dunia ini, dan sebagai peringatan bagi mereka akan negeri yang kekal (akhirat)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Waqi’ah ayat 71: 71-73. Ini adalah bukti yang keempat atas benarnya kebangkitan, dimana Allah berkata : Kabarkan kepadaku tentang api yang kalian nyalakan (dengan digesekkan kepada kayu). Apakah kalian yang menjadikan kayu itu ataukah Kami yang yang menciptakannya. ketahuilah bahwa kami menciptakan api ini agar Kami dapat memperingatkan kalian dengan api neraka, maka hal ini menjadi pelajaran dan nasihat bagi orang-orang yang mau mengambil pelajaran. Api ini juga sebagai kesenangan untuk memasak makanan dan keperluan kalian, juga menjadi manfaat bagi para musafir untuk digunakan pada kondisi mereka yang beraneka macam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Apa yang disebutkan di ayat ini dan setelahnya juga termasuk bagian nikmat yang dikaruniakan-Nya kepada mereka, dimana nikmat ini tergolong nikmat dharuri (pokok), karena manusia butuh nyala api dalam banyak keperluan mereka, maka Dia membuat mereka mengakuinya dengan menerangkan bahwa Dia yang menumbuhkan pohon yang hijau yang dari sana mereka bisa menyalakan api untuk kebutuhan mereka, setelah itu mereka memadamkannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Waqi’ah Ayat 71",
    "description": "71-74. Bila kamu sudah memahami siapa yang menurunkan air, maka pernahkah kamu memperhatikan tentang api yang kamu nyalakan dari kayu bakar' kamukah yang menumbuhkan pohon penghasil kayu bakar itu ataukah kami yang menumbuhkannya' ketahuilah, kami jadikan api itu untuk peringatan dan bahan bakar yang berguna bagi musafir di padang pasir. Dengan anugerah ini, maka bertasbihlah dengan menyebut nama tuhanmu yang mahabesar. '71-74"
  }
]