[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "73. Kami menjadikan api yang kalian nyalakan sebagai peringatan bahwa ada Neraka jahanam dan juga sebagai manfaat bagi orang-orang musafir."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "73. Kami menjadikan api ini sebagai peringatan untuk kalian agar kalian ingat dengan Neraka, dan kami menjadikannya bermanfaat untuk para musafir di antara kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "73. نَحْنُ جَعَلْنٰهَا تَذْكِرَةً(Kami jadikan api itu untuk peringatan) Yakni agar mengingatkan kalian dari panasnya api neraka sehingga orang beriman dapat mengambil pelajaran darinya. وَمَتٰعًا لِّلْمُقْوِينَ (dan bahan yang berguna bagi musafir di padang pasir) Seperti para musafir dan penduduk pedalaman yang tinggal di tempat yang jauh."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "73. Kami telah menjadikan api dunia antara lain bisa disulut/dipantik sebagai peringatan bagi kalian tentang neraka Jahannam. Kami juga menjadikan segala sesuatu yang dapat dibakar oleh api itu, sehingga bisa bermanfaat bagi para musafir"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami menjadikannya sebagai peringatan} peringatan bagi kalian tentang neraka Jahanam {dan manfaat bagi para musafir} manfaat bagi para musafir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "71-73. Ini adalah nikmat yang masuk kepada kategori kebutuhan pokok yang pasti dibutuhkan oleh makhluk, karena sesungguhnya manusia membutuhkan kenikmatan tersebut dalam banyak perkara dan kebutuhan mereka. Allah menyatakan kepada mereka (agar mereka mengakui), akan api yang Dia ciptakan pada pepohonan, dan bahwa makhluk tidaklah dapat menciptakannya, akan tetapi hanya Allah-lah Yang menciptakan (api itu) dari pepohonan yang hijau, kemudian ia menjadi api yang dinyalakan sesuai dengan kebutuhan para hamba, lalu apabila mereka telah selesai dari kebutuhan mereka, maka mereka memadamkan dan mematikannya. “Kami menjadikan api itu untuk peringatan” bagi para hamba terhadap nikmat Rabb mereka, dan sebagai peringatan (bagi mereka) akan Neraka Jahanam yang telah Allah persiapkan untuk orang-orang yang bermaksiat kepadaNya, serta menjadikannya sebagai cemeti untuk menuntun hamba-hambaNya kepada surga yang penuh dengan kenikmatan, “dan bahan yang berguna bagi musafir di padang pasir.” Maksud dari kata al-Muqwin adalah orang-orang yang mengambil manfaat atau para musafir. Allah mengkhususkan para musafir adalah karena manfaat api itu bagi musafir lebih besar daripada bagi selainnya, atau bisa jadi sebabnya adalah karena dunia ini, semuanya adalah tempat melakukan safar, dan seorang hamba dari sejak dilahirkan adalah seorang musafir (orang yang melakukan perjalanan) menuju Rabbnya. Api ini telah dijadikan oleh Allah sebagai bahan yang berguna bagi musafir di dunia ini, dan sebagai peringatan bagi mereka akan negeri yang kekal (akhirat)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Waqi’ah ayat 73: 71-73. Ini adalah bukti yang keempat atas benarnya kebangkitan, dimana Allah berkata : Kabarkan kepadaku tentang api yang kalian nyalakan (dengan digesekkan kepada kayu). Apakah kalian yang menjadikan kayu itu ataukah Kami yang yang menciptakannya. ketahuilah bahwa kami menciptakan api ini agar Kami dapat memperingatkan kalian dengan api neraka, maka hal ini menjadi pelajaran dan nasihat bagi orang-orang yang mau mengambil pelajaran. Api ini juga sebagai kesenangan untuk memasak makanan dan keperluan kalian, juga menjadi manfaat bagi para musafir untuk digunakan pada kondisi mereka yang beraneka macam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Terhadap nikmat-nikmat Allah dan terhadap neraka Jahanam yang Dia siapkan untuk orang-orang yang bermaksiat dan sebagai cemeti untuk menggiring hamba-hamba-Nya menuju negeri yang penuh kenikmatan (surga).. Disebutkan musafir secara khusus, karena musafir lebih banyak membutuhkannya daripada selainnya. Atau maksudnya, karena dunia ini tempat safar, bukan tempat menetap, maka seorang hamba dari sejak dilahirkan maka dia sedang mengadakan perjalanan menuju Tuhannya. Nah, api itu Allah siapkan untuk musafir tersebiut sebagai bahan berguna baginya dan sebagai peringatan baginya terhadap negeri yang kekal (akhirat)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Waqi’ah Ayat 73",
    "description": "71-74. Bila kamu sudah memahami siapa yang menurunkan air, maka pernahkah kamu memperhatikan tentang api yang kamu nyalakan dari kayu bakar' kamukah yang menumbuhkan pohon penghasil kayu bakar itu ataukah kami yang menumbuhkannya' ketahuilah, kami jadikan api itu untuk peringatan dan bahan bakar yang berguna bagi musafir di padang pasir. Dengan anugerah ini, maka bertasbihlah dengan menyebut nama tuhanmu yang mahabesar. '71-74"
  }
]