[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "74. Maka sucikanlah (wahai nabi) Tuhanmu Yang maha agung yang nama-nama dan sifat-sifatNya sempurna, serta kebaikan dan keberkahanNya banyak."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "74. Maka sucikanlah -wahai Rasul- Rabbmu Yang Mahaagung dari hal-hal yang tidak semestinya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "74. Hai Rasulullah, bertasbihlah dengan menyebut nama Tuhanmu Yang Maha Agung dan dengan memuji-Nya atas segala kerunia-Nya yang berlimpah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "74. Maka bertasbihlah kamu kepada Allah, atas dzat dan sifat-sifat-Nya yang agung, dari apa saja yang tidak patut atas Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka bertasbihlah dengan (menyebut) nama Tuhanmu} maka sucikanlah Tuhanmu dengan menyebut namaNya {Yang Maha agung"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "74. Ketika Allah menjelaskan sebagian dari nikmat-nikmatNya yang mengharuskan timbulnya pujian kepadaNya dari hamba-hambaNya, berikut syukur kepadaNya dan beribadah kepadaNya, Allah memerintahkan untuk mentasbihkan dan mengagungkanNya, di mana Dia berfirman, “Maka bertasbihlah dengan (menyebut) nama Rabbmu Yang Mahaagung.” Maksudnya, sucikanlah Rabbmu Yang Agung Yang Sempurna nama-nama dan sifat-sifatNya, banyak memberikan kebaikan dan balasan kebaikan, dan pujilah Dia dengan hati, lisan, dan anggota tubuhmu; karena Dia memang layak untuk semua itu, Dia-lah yang berhak disyukuri, maka jangan sampai Dia diingkari, (hendaknya) diingat dan disebut dalam dzikir dan tidak dilupakan, serta ditaati dan tidak dimaksiati."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Waqi’ah ayat 74: Selama kondisinya demikian, maka sucikan wahai Nabi Allah Tuhanmu dan bersihkan dari apa yang tidak pantas untuk-Nya. Dialah Yang Agung yang memberikan nikmat sebagai kesenangan dan manfaat yang dimanfaatkan oleh orang bertakwa dan yang tidak."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala menerangkan nikmat-nikmat-Nya kepada mereka yang menghendaki agar Dia dipuji oleh hamba-hamba-Nya, disyukuri dan diibadahi, maka Dia memerintahkan mereka untuk bertasbih dan memuji-Nya. Yakni sucikanlah Tuhanmu Yang Mahabesar, yang sempurna nama dan sifat-Nya, banyak ihsan dan kebaikan-Nya. Dan pujilah Dia dengan hatimu, lisanmu dan anggota badanmu, karena Dia layak memilikinya, Dia berhak disyukuri tidak dikufuri, Dia berhak disebut nama-Nya tidak dilupakan dan Dia berhak ditaati dan tidak didurhakai. Menurut Ibnu Jarir, “Maka sucikanlah dengan menamai Tuhanmu Yang Mahabesar dengan nama-nama-Nya yang indah (Asmaa’ul Husna).”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Waqi’ah Ayat 74",
    "description": "71-74. Bila kamu sudah memahami siapa yang menurunkan air, maka pernahkah kamu memperhatikan tentang api yang kamu nyalakan dari kayu bakar' kamukah yang menumbuhkan pohon penghasil kayu bakar itu ataukah kami yang menumbuhkannya' ketahuilah, kami jadikan api itu untuk peringatan dan bahan bakar yang berguna bagi musafir di padang pasir. Dengan anugerah ini, maka bertasbihlah dengan menyebut nama tuhanmu yang mahabesar. '75-76. Usai menjelaskan tanda-tanda kekuasan-Nya, Allah beralih menguraikan kemuliaan Al-Qur'an. Kemudian aku bersumpah dengan salah satu tanda kekuasaan-ku, yaitu tempat beredarnya bintang-bintang. Dan sesungguhnya, bila manusia mau memikirkan betapa teraturnya bintang-bintang yang beredar pada posisinya itu, mereka akan tahu bahwa sumpah ini benar-benar sumpah yang besar, kalau kamu mengetahui. '."
  }
]