[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "75-76. Allah bersumpah dengan tempat-tempat jatuhnya bintang di tempat terbenamnya, dan sesungguhnya itu adalah sumpah yang besar bila kalian mengetahui kadarnya,"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "75. Allah bersumpah dengan orbit-orbit bintang dan letak-letaknya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "75-76. Sumpah, demi tempat terbitnya bintang-bintang. Andai kalian mengetahui, ini adalah sumpah yang sangat agung tujuannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "75. فَلَآ أُقْسِمُ بِمَوٰقِعِ النُّجُومِ (Maka Aku bersumpah dengan masa turunnya bagian-bagian Al-Quran) Yakni dengan tempat-tempat jatuhnya bintang, yaitu tempat-tempat tenggelamnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "75. Kemudian Aku bersumpah demi tempat beredarnya bintang-bintang"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Aku bersumpah} Aku bersumpah, huruf “Laa” untuk menguatkan sumpah {demi tempat beredarnya bintang-bintang} tempat-tempat jatuhnya bintang di tempat terbenamnya di langit"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "75-76. Allah bersumpah dengan bintang-bintang dan tempat beredarnya, yaitu tempat jatuhnya di tempat-tempat terbenamnya dan apa yang Allah adakan di waktu-waktu tersebut berupa kejadian-kejadian yang menunjukkan keagungan, kebesaran, dan keesaanNYa. Kemudian Allah mengagungkan apa yang Dia bersumpah dengannya seraya berfirman, “Sesungguhnya sumpah itu adalah sumpah yang besar kalau kamu mengetahui,” sumpah ini adalah sumpah yang agung, karena pada bintang-bintang, peredarannya, jatuhnya ditempat-tempat terbenamnya adalah merupakan tanda-tanda dan peringatan yang tidak mungkin dapat dihitung."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Waqi’ah ayat 75: Allah bersumpah dengan tempat jatuhnya bintang-bintang di langit bagian barat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Waqi’ah Ayat 75",
    "description": "75-76. Usai menjelaskan tanda-tanda kekuasan-Nya, Allah beralih menguraikan kemuliaan Al-Qur'an. Kemudian aku bersumpah dengan salah satu tanda kekuasaan-ku, yaitu tempat beredarnya bintang-bintang. Dan sesungguhnya, bila manusia mau memikirkan betapa teraturnya bintang-bintang yang beredar pada posisinya itu, mereka akan tahu bahwa sumpah ini benar-benar sumpah yang besar, kalau kamu mengetahui. '75-76"
  },
  {
    "title": "Tafsir Tematis / Team Asatidz TafsirWeb",
    "description": "Allah Subhaanahu wa Ta'aala bersumpah dengan bintang dan mawaaqi’, yakni jatuhnya di tempat tenggelamnya dan apa yang Allah adakan pada waktu itu berupa kejadian-kejadian yang menunjukkan kebesaran-Nya, keagungan-Nya dan keesaan-Nya. Dan pada ayat selanjutnya, Dia perbesar perkara sumpah ini."
  }
]