[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "75-76. Allah bersumpah dengan tempat-tempat jatuhnya bintang di tempat terbenamnya, dan sesungguhnya itu adalah sumpah yang besar bila kalian mengetahui kadarnya,"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "76. Sesungguhnya sumpah dengan orbit-orbit bintang ini -jika kalian mengetahui kebesarannya- sungguh agung, karena di dalamnya mengandung tanda-tanda dan pelajaran-pelajaran yang tidak terbatas."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "76-77. Sumpah itu adalah sumpah yang agung, jika kalian tahu betapa besar kekuasaan dan keagungan-Nya. Kalian juga termasuk orang-orang yang tahu akan itu semua. Ayat ini turun ketika manusia diguyur hujan, Sebagian dari mereka berkata, Sesungguhnya kita diguyur dengan hujan seperti ini. Akibat turunnya bintang tersebut. Sesungguhnya wahyu yang diberikan kepadamu wahai Nabi, adalah Al-Qur’an yang mengandung banyak kebaikan dan kemanfaatan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya itu benar-benar sumpah yang sangat besar seandainya kalian mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "75-76. Allah bersumpah dengan bintang-bintang dan tempat beredarnya, yaitu tempat jatuhnya di tempat-tempat terbenamnya dan apa yang Allah adakan di waktu-waktu tersebut berupa kejadian-kejadian yang menunjukkan keagungan, kebesaran, dan keesaanNYa. Kemudian Allah mengagungkan apa yang Dia bersumpah dengannya seraya berfirman, “Sesungguhnya sumpah itu adalah sumpah yang besar kalau kamu mengetahui,” sumpah ini adalah sumpah yang agung, karena pada bintang-bintang, peredarannya, jatuhnya ditempat-tempat terbenamnya adalah merupakan tanda-tanda dan peringatan yang tidak mungkin dapat dihitung."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Waqi’ah ayat 76: Allah mengabarkan bahwa sumpah ini sebagai keagungan dan kekuasaan-Nya, akan tetapi kalian tidak memahami ketinggian dan kedudukannya. Berkata ulama i’jaz : Bintang-bintang ini yang Allah bersumpah atasnya, tempat bintang ini di langit yang tinggi, dimana bintang tersebut tersulut api. Tempat peredarannya luas berpindah-pindah. Wallahu A’lam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sumpah ini dipandang besar karena pada bintang dan peredarannya serta jatuhnya di tempat tenggelamnya terdapat ayat-ayat dan pelajaran yang tidak dapat dijumlahkan. Sedangkan isi sumpahnya adalah mengukuhkan Al Qur’an, dan bahwa dia adalah benar tanpa ada keraguan lagi. Demikian pula bahwa Al Qur’an adalah bacaan yang mulia, yang banyak kebaikan dan pengetahuannya. Bahkan setiap kebaikan dan ilmu diambil dan digali darinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Waqi’ah Ayat 76",
    "description": "75-76. Usai menjelaskan tanda-tanda kekuasan-Nya, Allah beralih menguraikan kemuliaan Al-Qur'an. Kemudian aku bersumpah dengan salah satu tanda kekuasaan-ku, yaitu tempat beredarnya bintang-bintang. Dan sesungguhnya, bila manusia mau memikirkan betapa teraturnya bintang-bintang yang beredar pada posisinya itu, mereka akan tahu bahwa sumpah ini benar-benar sumpah yang besar, kalau kamu mengetahui. '77-80. Allah bersumpah bahwa sesungguhnya Al-Qur'an yang berisi tuntunan-Nya ini adalah bacaan yang sangat mulia. Wahyu Allah ini tertulis pada kitab yang terpelihara, yaitu lauh mahfuz yang selalu terjaga, sehingga tidak ada yang dapat menyentuhnya kecuali hamba-hamba-Nya yang disucikan. Sungguh, Al-Qur'an ini diturunkan dari tuhan seluruh alam."
  }
]