[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "77-79. bahwa sesungguhnya al-Quran yang turun kepada Muhammad ini adalah al-Quran yang manfaatnya agung, kebaikannya banyak, ilmunya melimpah, dalam sebuah kitab yang terjaga dan tertutup dari mata-mata makhluk, yaitu kitab yang ada di tangan para malaikat. Tidak menyentuh al-Quran kecuali para malaikat yang mulia yang Allah sucikan mereka dari aib-aib dan dosa-dosa, dan tidak disentuh juga kecuali oleh orang-orang yang menyucikan diri dari syirik, junub, dan hadats."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "77. Sesungguhnya Al-Qur`ān yang dibacakan kepada kalian -wahai manusia- adalah Al-Qur`ān yang mulia, karena di dalamnya terdapat manfaat-manfaat yang agung."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "77-80. Dan isi dari sumpah ini bahwa al-Qur’an merupakan kitab yang tidak diragukan kebenarannya, ia memiliki kedudukan dan manfaat yang besar di dunia dan akhirat, ia terdapat dalam kitab yang dijaga dari kebatilan dan perubahan, dan terlindungi dalam Lauhul Mahfuzh. Tidak ada yang boleh memegang al-Qur’an melainkan para malaikat yang suci dan orang-orang yang suci hatinya dengan keimanan, dan suci badannya dengan wudhu atau mandi. Al-Qur’an diturunkan Allah, Tuhan semesta alam, kepada Nabi Muhammad al-Amin."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "77. إِنَّهُۥ لَقُرْءَانٌ كَرِيمٌ (Sesungguhnya Al-Quran ini adalah bacaan yang sangat mulia) Yakni yang dimuliakan dan diangkat derajatnya di atas kitab-kitab yang lain, dan Allah menyucikannya sehingga tidak menjadikannya sihir, perdukunan, atau kedustaan. Ia adalah kitab yang mulia karena mengandung akhlak-akhlak yang mulia dan utama; penghafalnya akan dimuliakan dan pembacanya akan diagungkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "76-77. Sumpah itu adalah sumpah yang agung, jika kalian tahu betapa besar kekuasaan dan keagungan-Nya. Kalian juga termasuk orang-orang yang tahu akan itu semua. Ayat ini turun ketika manusia diguyur hujan, Sebagian dari mereka berkata, Sesungguhnya kita diguyur dengan hujan seperti ini. Akibat turunnya bintang tersebut. Sesungguhnya wahyu yang diberikan kepadamu wahai Nabi, adalah Al-Qur’an yang mengandung banyak kebaikan dan kemanfaatan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya itu benar-benar Al-Qur’an yang sangat mulia} memiliki manfaat yang agung, dan kebaikan yang banyak"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "77. Adapun yang disumpahkan atasnya adalah penetapan al-Quran, dan bahwa al-Quran itu adalah benar adanya yang tidak ada keraguan padanya dan tidak ada kebimbangan mengenainya. Dan bahwasanya al-Quran itu “sangat mulia” maksudnya, (mengandung) kebaikan yang sangat banyak dan ilmu yang sangat melimpah. Semua kebaikan dan ilmu hanya diambil dan diintisarikan dari Kitabullah itu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Waqi’ah ayat 77: 77-80. Allah menyebutkan dengan sumpah kepada Al Qur’an Al Karim, Allah berkata : Ketahuilah wahai manusia bahwa Al Qur’an ini adalah sempurna bagi kebaikan seorang hamba di dunia dan akhirat. Al Qur’an terjaga dan tertulis pada kitab yang ada di sisi Allah, dan dikatakan bahwa itu adalah lauhul mahfudz, dikatakan juga bahwasanya ia adalah mushaf yang dihadapan kita sekarang. Al Qur’an ini tidak disentuh kecuali oleh para malaikat yang suci, inilah yang kuat dari ayat ini, dan tidaklah Al Qur’an ini disentuh kecuali yang telah bersih dari kesyirikan dan yang sedang junub serta hadats kecil. Allah kemudian mengabarkan bahwa Al Qur’an diturunkan dari sisi Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Waqi’ah Ayat 77",
    "description": "77-80. Allah bersumpah bahwa sesungguhnya Al-Qur'an yang berisi tuntunan-Nya ini adalah bacaan yang sangat mulia. Wahyu Allah ini tertulis pada kitab yang terpelihara, yaitu lauh mahfuz yang selalu terjaga, sehingga tidak ada yang dapat menyentuhnya kecuali hamba-hamba-Nya yang disucikan. Sungguh, Al-Qur'an ini diturunkan dari tuhan seluruh alam"
  }
]