[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "77-79. bahwa sesungguhnya al-Quran yang turun kepada Muhammad ini adalah al-Quran yang manfaatnya agung, kebaikannya banyak, ilmunya melimpah, dalam sebuah kitab yang terjaga dan tertutup dari mata-mata makhluk, yaitu kitab yang ada di tangan para malaikat. Tidak menyentuh al-Quran kecuali para malaikat yang mulia yang Allah sucikan mereka dari aib-aib dan dosa-dosa, dan tidak disentuh juga kecuali oleh orang-orang yang menyucikan diri dari syirik, junub, dan hadats."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "78. Di dalam kitab yang terjaga dari mata manusia, yaitu Lauḥul Maḥfuẓ."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "78. فِى كِتٰبٍ مَّكْنُونٍ (pada kitab yang terpelihara (Lauhul Mahfuzh)) Yakni kitab yang tertutup dan terjaga. Pendapat lain mengatakan, yakni terjauhkan dari hal batil. Dan yang dimaksud adalah kitab lauhul mahfuhz."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "78. Dalam kitab yang dijaga oleh Allah, terjaga dari pemalsuan dan perubahan, yaitu Lauhul Mahfudz. Yaitu mushaf atau lembaran yang berada di sisi Kami, yang terang"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dalam kitab yang terpelihara} kitab yang terjaga, yaitu Lauhil Mahfudz"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "78. “Pada kitab yang terpelihara (Lauhul Mahfuzh)” yaitu terpelihara dari mata para makhluk. Kitab yang terpelihara ini adalah Lauhul Mahfuzh, maksudnya bahwa al-Quran ini termaktub di Lauhul Mahfuzh, teragungkan di sisi Allah dan di sisi para malaikat di al-Malaul a’la. Ada (juga) kemungkinan bahwa yang dimaksud dengan kitab yang terpelihara adalah kitab yang berada di tangan para malaikat yang Allah turunkan untuk menyampaikan wahyu dan risalahNya. Dan yang dimaksud dengan hal itu adalah bahwasanya kitab tersebut terpelihara dari para setan, yang mana mereka tidak mampu untuk merubahnya, tidak mampu menambah dan tidak mampu mengurangi maupun mencurinya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Waqi’ah ayat 78: 77-80. Allah menyebutkan dengan sumpah kepada Al Qur’an Al Karim, Allah berkata : Ketahuilah wahai manusia bahwa Al Qur’an ini adalah sempurna bagi kebaikan seorang hamba di dunia dan akhirat. Al Qur’an terjaga dan tertulis pada kitab yang ada di sisi Allah, dan dikatakan bahwa itu adalah lauhul mahfudz, dikatakan juga bahwasanya ia adalah mushaf yang dihadapan kita sekarang. Al Qur’an ini tidak disentuh kecuali oleh para malaikat yang suci, inilah yang kuat dari ayat ini, dan tidaklah Al Qur’an ini disentuh kecuali yang telah bersih dari kesyirikan dan yang sedang junub serta hadats kecil. Allah kemudian mengabarkan bahwa Al Qur’an diturunkan dari sisi Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni tertutup dari penglihatan makhluk, yaitu Lauh Mahfuzh. Maksudnya, Al Qur’an ini tertulis dalam Lauh Mahfuzh, dimuliakan di sisi Allah dan di sisi para malaikat-Nya. Bisa juga maksud ‘kitab yang terpelihara’ adalah kitab yang berada di tangan-tangan para malaikat, dimana Allah menurunkan mereka dengan membawa wahyu-Nya. Sedangkan maksud ‘terpelihara’ adalah tertutup dari setan, dimana mereka tidak sanggup merubahnya, mengurangi dan mencurinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Waqi’ah Ayat 78",
    "description": "77-80. Allah bersumpah bahwa sesungguhnya Al-Qur'an yang berisi tuntunan-Nya ini adalah bacaan yang sangat mulia. Wahyu Allah ini tertulis pada kitab yang terpelihara, yaitu lauh mahfuz yang selalu terjaga, sehingga tidak ada yang dapat menyentuhnya kecuali hamba-hamba-Nya yang disucikan. Sungguh, Al-Qur'an ini diturunkan dari tuhan seluruh alam"
  }
]