[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "77-79. bahwa sesungguhnya al-Quran yang turun kepada Muhammad ini adalah al-Quran yang manfaatnya agung, kebaikannya banyak, ilmunya melimpah, dalam sebuah kitab yang terjaga dan tertutup dari mata-mata makhluk, yaitu kitab yang ada di tangan para malaikat. Tidak menyentuh al-Quran kecuali para malaikat yang mulia yang Allah sucikan mereka dari aib-aib dan dosa-dosa, dan tidak disentuh juga kecuali oleh orang-orang yang menyucikan diri dari syirik, junub, dan hadats."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "79. Tidak ada yang bisa menyentuhnya kecuali malaikat yang disucikan dari dosa dan aib."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "79. لَّا يَمَسُّهُۥٓ إِلَّا الْمُطَهَّرُونَ (tidak menyentuhnya kecuali orang-orang yang disucikan) Yakni tidak ada yang menyentuh kitab yang terjaga itu kecuali makhluk-makhluk yang disucikan, yaitu para malaikat. Adapun setan tidak akan mampu menyentuhnya. Dan ayat ini menunjukkan bahwa al-Qur’an tidak boleh dipegang oleh orang kafir, orang junub, atau orang yang berhadats; dan ia harus dihindarkan dari tempat-tempat yang najis."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "79. Tidak akan tersentuh makna Alquran kecuali orang yang suci dari dosa, yaitu para Malaikat, atau juga tidak boleh menyentuhnya kecuali orang yang suci dari hadas/ dalam keadaan berwudhu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Tidak ada yang menyentuhnya, kecuali orang-orang yang disucikan} para malaikat yang disucikan dari dosa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "79. “Tidak menyentuhnya kecuali orang-orang yang disucikan.” Maksudnya bahwa al-Quran itu tidak disentuh kecuali oleh para malaikat yang mulia, yang mana Allah telah menyucikan mereka dari segala kesalahan, dosa, dan cela. Apabila al-Quran itu tidak didsentuh kecuali oleh para malaikat yang disucikan, dan bahwasanya makhluk-makhluk yang keji dan setan-setan tidak memiliki kemampuan maupun kekuatan untuk menyentuhnya, maka ayat ini menunjukkan adanya peringatan bahwasanya tidaklah boleh menyentuh al-Quran kecuali orang yang suci, sebagaimana disebutkan di dalam hadist Rasulullah. Karena itulah ada yang berpendapat bahwa ayat ini merupakan khabar yang bermakna larangan, maksudnya tidak boleh menyentuh al-Quran kecuali orang yang suci."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Waqi’ah ayat 79: 77-80. Allah menyebutkan dengan sumpah kepada Al Qur’an Al Karim, Allah berkata : Ketahuilah wahai manusia bahwa Al Qur’an ini adalah sempurna bagi kebaikan seorang hamba di dunia dan akhirat. Al Qur’an terjaga dan tertulis pada kitab yang ada di sisi Allah, dan dikatakan bahwa itu adalah lauhul mahfudz, dikatakan juga bahwasanya ia adalah mushaf yang dihadapan kita sekarang. Al Qur’an ini tidak disentuh kecuali oleh para malaikat yang suci, inilah yang kuat dari ayat ini, dan tidaklah Al Qur’an ini disentuh kecuali yang telah bersih dari kesyirikan dan yang sedang junub serta hadats kecil. Allah kemudian mengabarkan bahwa Al Qur’an diturunkan dari sisi Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni tidak ada yang menyentuh Al Qur’an selain hamba-hamba yang disucikan, yaitu para malaikat yang yang mulia, dimana Allah Subhaanahu wa Ta'aala menyucikan mereka dari dosa-dosa dan cacat. Menurut sebagian ulama, ayat ini mengingatkan, bahwa tidak boleh menyentuh Al Qur’an kecuali orang yang suci. Oleh karena itu, ada yang berpendapat, bahwa ayat ini meskipun bentuknya berita, namun terdapat larangan, yaitu tidak boleh menyentuh Al Qur’an kecuali orang yang suci."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Waqi’ah Ayat 79",
    "description": "77-80. Allah bersumpah bahwa sesungguhnya Al-Qur'an yang berisi tuntunan-Nya ini adalah bacaan yang sangat mulia. Wahyu Allah ini tertulis pada kitab yang terpelihara, yaitu lauh mahfuz yang selalu terjaga, sehingga tidak ada yang dapat menyentuhnya kecuali hamba-hamba-Nya yang disucikan. Sungguh, Al-Qur'an ini diturunkan dari tuhan seluruh alam"
  }
]