[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "80. Al-Quran yang mulia ini diturunkan dari Tuhan semesta, maka ia adalah kebenaran yang tidak ada keraguan padanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "80. Diturunkan dari Rabb para makhluk kepada Nabi-Nya Muhammad -ṣallallāhu 'alaihi wa sallam-."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "80. Alquran diturunkan Allah Ta’ala Tuhan semesta alam seluruhnya ke dalam hati Nabi Muhammad SAW"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{diturunkan dari Tuhan alam semesta"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "80. “Diturunkan dari Rabb semesta alam,” maksudnya bahwa al-Quran ini menyandang predikat yang mulia tersebut yaitu bahwa ia diturunkan dari Rabb semesta alam, Yang mengatur para hambaNya dengan berbagai macam nikmatNya, baik kenikmatan agama maupun kenikmatan dunia. Dan pengaturan Allah yang paling agung bagi hamba-hambaNya adalah dengan menurunkan al-Quran yang menc akup kemaslahatan dunia dan akhirat. Dan dengannya Allah telah merahmati para hamba dengan rahmat yang tidak mampu mereka syukuri, dan dari apa yang wajib bagi mereka untuk menegakkannya, mengumumkannya, berdakwah kepadanya, dan menjelaskannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Waqi’ah ayat 80: 77-80. Allah menyebutkan dengan sumpah kepada Al Qur’an Al Karim, Allah berkata : Ketahuilah wahai manusia bahwa Al Qur’an ini adalah sempurna bagi kebaikan seorang hamba di dunia dan akhirat. Al Qur’an terjaga dan tertulis pada kitab yang ada di sisi Allah, dan dikatakan bahwa itu adalah lauhul mahfudz, dikatakan juga bahwasanya ia adalah mushaf yang dihadapan kita sekarang. Al Qur’an ini tidak disentuh kecuali oleh para malaikat yang suci, inilah yang kuat dari ayat ini, dan tidaklah Al Qur’an ini disentuh kecuali yang telah bersih dari kesyirikan dan yang sedang junub serta hadats kecil. Allah kemudian mengabarkan bahwa Al Qur’an diturunkan dari sisi Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya, Al Qur’an yang telah disebutkan sifatnya itu turun dari Allah Tuhan Yang Mengurus seluruh alam; Dia mengurus hamba-hamba-Nya dengan nikmat-nikmat dunia dan agama, dimana di antara kepengurusan-Nya kepada mereka yang paling besarnya adalah dengan menurunkan Al Qur’an ini yang di dalamnya terdapat petunjuk bagi mereka agar mereka dapat hidup bahagia di dunia dan akhirat. Hal ini menunjukkan, bahwa Allah Subhaanahu wa Ta'aala setelah menciptakan mereka, maka Dia tidak membiarkan mereka begitu saja, bahkan tetap mengurus mereka dengan nikmat-nikmat-Nya baik nikmat dunia berupa rezeki maupun nikmat agama berupa petunjuk. Dengan Al Qur’an Allah berikan rahmat kepada hamba-hamba-Nya yang mereka tidak sanggup untuk mensyukurinya. Oleh karena itu, mereka harus menjunjung tinggi isi Al Qur’an, mengamalkannya dan mendakwahkannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Waqi’ah Ayat 80",
    "description": "77-80. Allah bersumpah bahwa sesungguhnya Al-Qur'an yang berisi tuntunan-Nya ini adalah bacaan yang sangat mulia. Wahyu Allah ini tertulis pada kitab yang terpelihara, yaitu lauh mahfuz yang selalu terjaga, sehingga tidak ada yang dapat menyentuhnya kecuali hamba-hamba-Nya yang disucikan. Sungguh, Al-Qur'an ini diturunkan dari tuhan seluruh alam. 81-82. Bila kamu mengetahui bahwa Al-Qur'an berasal dari Allah, maka apakah kamu masih menganggap remeh berita tentang wahyu-Nya ini' masihkah kamu berani menjadikan rezeki yang kamu terima dari Allah justru untuk mendustakan ajaran dan mengingkari kekuasaan-Nya'."
  }
]