[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "83-85. Apakah kalian sanggup, manakala nafas seseorang di antara kalian naik ke tenggorokan saat Sakaratulmaut dan kalian ikut hadir di sana, untuk menahan ruh nya dari jasadnya? Tidak akan sanggup. Kami lebih dekat kepadanya daripada kalian dengan para malaikat Kami, tetapi kalian tidak melihat mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "84. Dan kalian pada saat itu menyaksikan orang yang sedang sekarat di hadapan kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "84. وَأَنتُمْ حِينَئِذٍ تَنظُرُونَ (padahal kamu ketika itu melihat) Yakni kalian melihatnya keluar ruhnya, dan ketika itu kalian tidak dapat menolongnya atau meringankan beban yang dia hadapi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "84. Sedangkan kalian semua yang berada di dekat mereka itu melihat bagaimana mereka menghadapi sakaratul maut. Kalian tidak bisa berbuat apa-apa untuk mereka, bahkan untuk sekedar meringankan kepedihan mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{padahal kalian ketika itu melihat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "83-85. “Maka mengapa ketika nyawa sampai di kerongkongan, padahal kamu ketika itu melihat, dan Kami lebih dekat kepadanya daripada kamu, tapi kamu tidak melihat.” Maksudnya, maka mengapa tatkala ruh telah sampai di kerongkongan, padahal kalian melihat orang yang sedang sekarat dalam keadaan seperti itu, sedangkan sebenarnya Kami lebih dekat kepadanya daripada kalian dengan ilmu Kami dan para malaikat Kami, akan tetapi kalian tidak melihat?"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Waqi’ah ayat 84: 83-85. Allah berkata dengan maksud melemahkan mereka : Apakah kalian mampu wahai orang-orang musyrik, jika nyawa salah satu di antara kalian telah sampai kerongkongan ketika akan dicabut dan kalian melihatnya ketika itu, dapatkan kalian menghalanginya agar tidak keluar ? Ketahuilah bahwa Allahlah dengan ilmu dan kuasa-Nya beserta para malaikat-Nya yang menggenggam ruh-ruh yang dekat dengan kalian, akan tetapi kalian tidak dapat melihatnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Waqi’ah Ayat 84",
    "description": "83-85. Pada ayat-ayat ini Allah memberi peringatan kepada mereka yang mendustakan-Nya, terlebih lagi saat sakaratul maut tiba. Bila telah tiba waktunya, semua manusia akan meninggal, maka kalau begitu mengapa kamu tidak mencegah kedatangan kematian, ketika nyawa yang menjadi tanda kehidupan telah sampai di kerongkongan, dan kamu ketika itu melihat bagaimana penderitaan orang yang sekarat itu, dan kami serta para malaikat lebih dekat kepadanya daripada kamu, tetapi kamu ketika itu tidak melihat keberadaan kami'83-85"
  }
]