[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "86-87. Bila kalian tidak dihisab dan tidak dibalas atas amal perbuatan kalian, apakah kalian sanggup mengembalikan arwah ke jasad bila kalian memang benar? Tidak akan bisa kalian kembalikan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "86. Lalu kenapa jika kalian -sebagaimana kalian yakini- tidak akan dibangkitkan untuk mendapat balasan atas perbuatan kalian,"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "86. فَلَوْلَآ إِن كُنتُمْ غَيْرَ مَدِينِينَ (maka mengapa jika kamu tidak dikuasai (oleh Allah)?) Yakni jika kalian tidak dimiliki dan dikuasai Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "86. Bukankah kalian mengira bahwa amal kalian tidak akan dihitung pada hari kiamat, dan kalian pun juga mengingkari hari kebangkitan?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka mengapa tidak} mengapa tidak {jika kalian tidak diberi balasan} tidak diberi balasan dan dihiasb atas amal kalian"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "86-87. “Maka mengapa jika kamu tidak dikuasai (Oleh Allah),” maksudnya, apabila kalian beranggapan bahwa kalian tidak akan dibangkitkan, tidak akan dihisab dan tidak akan diberi balasan (atas semua perbuatan kalian), mengapa kalian tidak mengembalikan nyawa itu (kepada tempatnya), “jika kamu adalah orang-orang yang benar” dan kalian mengakui bahwa kalian tidak mampu mengembalikan nyawa itu ke tempatnya. Tatkala demikian, maka (hanya ada dua kemungkinan) : kalian mengakui kebenaran yang dibawa oleh Muhammad, atau mengingkarinya, dan kalian tahu keadaan dan tempat kembali yang buruk."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Waqi’ah ayat 86: 86-87. Maka jika kalian wahai orang-orang musyrik tidak mengimani bahwa di sana ada hari kebangkitan dan perhitungan yaitu di hari kiamat; Apakah kalian mampu mengembalikan ruh ini yang telah sampai di kerongkongan tubuh yang akan dicabut darinya, jika memang kalian adalah orang-orang yang benar, dengan klaim kalian bahwa di sana tidak ada hari kebangkitan dan perhitungan dan juga adzab."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Bisa juga diartikan, “Maka mengapa jika kamu memang tidak akan diberi balasan,”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Waqi’ah Ayat 86",
    "description": "86-87. Setelah mengetahui keadaan orang yang sekarat, maka mengapa jika kamu memang benar tidak dikuasai oleh Allah dan bisa melakukan apa saja, kamu tidak mengembalikan nyawa itu ke tempatnya jika kamu, seperti pengakuanmu, adalah orang-orang yang benar'86-87"
  }
]