[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "88-89. Sedangkan bila mayit itu termasuk orang-orang yang besegera dalam kebaikan yang didekatkan, saat dia mati, dia mendapatkan rahmat yang lapang dan kebahagiaan serta segala yang menenangkan jiwanya, baginya surga yang penuh kenikmatan di"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "88. Adapun bila yang meninggal termasuk orang-orang yang berlomba dalam kebaikan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "88-89. Jika orang yang meninggal itu termasuk orang-orang yang bersegera mencari derajat yang tinggi, maka baginya peristirahatan dan rezeki yang melimpah di dalam surga dari Allah. Abu Hurairah meriwayatkan dari Nabi, beliau bersabda: “Orang yang akan meninggal akan didatangi para malaikat, dan jika orang ini adalah orang shalih maka para malaikat itu berkata: “Keluarlah wahai jiwa yang baik yang berada di jasad yang baik, keluarlah dalam keadaan terpuji, dan bergembiralah dengan ketenangan dan rezeki yang melimpah.” (Diriwayatkan oleh Ibnu Majah dalam as-Sunan no. 4262 -zuhud, bab mengingat dan mempersiapkan kematian. al-Bushiri mengatakan, sanadnya shahih dan para perawinya tsiqat (Mishbah al-Zujajah 2/349), dan dishahihkan al-Albani (Shahih Ibnu Majah 2/420), dan diriwayatkan al-Hakim, serta dishahihkan dan disepakati oleh adz-Dzahabi dalam al-Mustadrak 1/37-40)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "88. فَأَمَّآ إِن كَانَ مِنَ الْمُقَرَّبِينَ (adapun jika dia (orang yang mati) termasuk orang-orang yang didekatkan (kepada Allah)) Yakni orang-orang yang bersegera dalam kebaikan yang merupakan golongan pertama dari tiga golongan yang telah dijelaskan sebelumnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "88. Maka apabila orang yang meninggal itu termasuk orang-orang yang dekat dengan Allah, salah satu dari golongan 3 yang terdahulu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Adapun jika dia itu termasuk yang didekatkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "88-89. Di awal surat Allah telah menyebutkan keadaan tiga golongan: al-Muqarrabin (orang-orang yang didekatkan kepada Allah), golongan kanan dan golongan pendusta yang sesat di negeri akhirat yang kekal. kemudian di akhir surat ini Allah menyebutkan keadaan mereka ketika sakaratul maut dan ketika meninggal dunia. Allah berfirman, “Adapun jika dia (orang yang mati) termasuk orang yang didekatkan (kepada Allah)” maksudnya, apabila orang yang meninggal itu termasuk orang-orang yang didekatkan kepada Allah, yang mana mereka adalah orang-orang yang mendekatkan diri kepadaNya dengan melaksanakan hal-hal yang diwajibkan dan dianjurkan, serta meninggalkan hal-hal yang diharamkan, yang dimakruhkan dan hal-hal mubah yang tidak bermanfaat, “maka” bagi mereka “ketentraman” yakni kenyamanan, ketenangan, kebahagiaan, kesenangan, serta kenikmatan jiwa dan raga, “dan rizki” yaitu sebuah nama yang mencakup segala kenikmatan jasmani berupa berbagai macam jenis makanan, minuman, dan selainnya. Ada juga yang mengatakan bahwa yang dimaksud dengan ar-Raihan (rizki) yaitu apa-apa yang baik yang telah dikenal di kalangan masyarakat, sehingga ia merupakan pengungkapan (ta’bir) dengan jenis sesuatu dari jenisnya yang umum. “Serta surga kenikmatan” kalimat yang ketiga ini merupakan penghimpun dua hal yang telah disebutkan di atas, di mana di dalamnya terdapat berbagai macam kenikmatan yang tidak pernah dilihat oleh mata, tidak pernah didengar oleh telinga, dan tidak pernah terbersit dalam benak seorang pun. Di dalam ayat ini Allah memberi kabar gembira kepada orang-orang yang didekatkan kepadaNya ketika sedang sakaratul maut dengan kabar gembira ini, yaitu sebuah kabar gembira yang hampir-hampir membuat ruh itu terbang karena begitu gembira dan bahagianya, sebagaimana Allah berfirman, “Sesungguhnya orang-orang yang mengatakan: \"Tuhan kami ialah Allah\" kemudian mereka meneguhkan pendirian mereka, maka malaikat akan turun kepada mereka dengan mengatakan: \"Janganlah kamu takut dan janganlah merasa sedih; dan gembirakanlah mereka dengan jannah yang telah dijanjikan Allah kepadamu\". Kamilah pelindung-pelindungmu dalam kehidupan dunia dan akhirat; di dalamnya kamu memperoleh apa yang kamu inginkan dan memperoleh (pula) di dalamnya apa yang kamu minta.Sebagai hidangan (bagimu) dari Tuhan Yang Maha Pengampun lagi Maha Penyayang.” -Fushshilat:30-32-. Dan Allah Yang Mahamulia lagi Mahatinggi juga berfirman: “Bagi mereka berita gembira di dalam kehidupan di dunia dan (dalam kehidupan} di akhirat” -Yunus:64- Dan telah ditafsirkan bahwa kabar gembira yang disebutkan di atas di dalam ayat itu adalah kabar gembira di dalam kehidupan dunia."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Waqi’ah ayat 88: 88-89. Allah menyebutkan kondisi orang-orang yang sekarat di dunia dan pembagian mereka kepada tiga bagian, bagian pertama : Jika mayat ini adalah orang-orang yang ikhlas yang berlomba-lomba dalam kebaikan, maka mereka ditempatkan di tempat yang tinggi, mereka memiliki tempat peristirahatan, kebahagiaan dan kemenangan serta rizki yang baik dan surga yang luas, yang mereka dapat bersenang-senang di dalalamnya di sisi Tuhan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala di awal surah telah menyebutkan tiga golongan; golongan orang-orang yang didekatkan, golongan kanan dan golongan kiri (golongan yang mendustakan lagi sesat) dan keadaan mereka di akhirat. Selanjutnya di akhir surah ini, Allah menyebutkan keadaan mereka menjelang wafat. Menurut Syaikh As Sa’diy, yaitu mereka yang mengerjakan perkara wajib dan sunat, meninggalkan yang haram dan yang makruh dan perkara mubah yang berlebihan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Waqi’ah Ayat 88",
    "description": "88-89. Adapun jika dia yang mati itu termasuk orang-orang yang didekatkan kepada Allah karena ketaatan dan amal baiknya, maka dia pasti akan memperoleh ketenteraman dan rezeki serta surga yang penuh kenikmatan sebagai balasan atas semua yang telah mereka perbuat di dunia"
  }
]