[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "88-89. Sedangkan bila mayit itu termasuk orang-orang yang besegera dalam kebaikan yang didekatkan, saat dia mati, dia mendapatkan rahmat yang lapang dan kebahagiaan serta segala yang menenangkan jiwanya, baginya surga yang penuh kenikmatan di akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "89. Maka baginya istirahat yang tidak ada lagi keletihan setelahnya, rezeki yang baik dan rahmat. Dan baginya juga Surga yang di dalamnya ia menikmati apa yang diinginkan jiwanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "89. فَرَوْحٌ وَرَيْحَانٌ وَجَنَّتُ نَعِيمٍ (maka dia memperoleh ketenteraman dan rezeki serta jannah kenikmatan) Makna (الروح) yakni beristirahat dari dunia dan kesibukannya. Dan (الريحان) yakni rezeki di surga; namun al-Hasan berpendapat yang dimaksud adalah kemangi yang dikenal yang dipakai untuk wewangian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "89. Maka dia akan mendapatkan ketentraman dan rahmat, rizki yang baik dan surga yang dipenuhi dengan kenikmatan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka baginya ketenteraman} maka baginya ketenangan {rezeki} rezeki yang baik {dan surga yang penuh kenikmatan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "88-89. Di awal surat Allah telah menyebutkan keadaan tiga golongan: al-Muqarrabin (orang-orang yang didekatkan kepada Allah), golongan kanan dan golongan pendusta yang sesat di negeri akhirat yang kekal. kemudian di akhir surat ini Allah menyebutkan keadaan mereka ketika sakaratul maut dan ketika meninggal dunia. Allah berfirman, “Adapun jika dia (orang yang mati) termasuk orang yang didekatkan (kepada Allah)” maksudnya, apabila orang yang meninggal itu termasuk orang-orang yang didekatkan kepada Allah, yang mana mereka adalah orang-orang yang mendekatkan diri kepadaNya dengan melaksanakan hal-hal yang diwajibkan dan dianjurkan, serta meninggalkan hal-hal yang diharamkan, yang dimakruhkan dan hal-hal mubah yang tidak bermanfaat, “maka” bagi mereka “ketentraman” yakni kenyamanan, ketenangan, kebahagiaan, kesenangan, serta kenikmatan jiwa dan raga, “dan rizki” yaitu sebuah nama yang mencakup segala kenikmatan jasmani berupa berbagai macam jenis makanan, minuman, dan selainnya. Ada juga yang mengatakan bahwa yang dimaksud dengan ar-Raihan (rizki) yaitu apa-apa yang baik yang telah dikenal di kalangan masyarakat, sehingga ia merupakan pengungkapan (ta’bir) dengan jenis sesuatu dari jenisnya yang umum. “Serta surga kenikmatan” kalimat yang ketiga ini merupakan penghimpun dua hal yang telah disebutkan di atas, di mana di dalamnya terdapat berbagai macam kenikmatan yang tidak pernah dilihat oleh mata, tidak pernah didengar oleh telinga, dan tidak pernah terbersit dalam benak seorang pun. Di dalam ayat ini Allah memberi kabar gembira kepada orang-orang yang didekatkan kepadaNya ketika sedang sakaratul maut dengan kabar gembira ini, yaitu sebuah kabar gembira yang hampir-hampir membuat ruh itu terbang karena begitu gembira dan bahagianya, sebagaimana Allah berfirman, “Sesungguhnya orang-orang yang mengatakan: \"Tuhan kami ialah Allah\" kemudian mereka meneguhkan pendirian mereka, maka malaikat akan turun kepada mereka dengan mengatakan: \"Janganlah kamu takut dan janganlah merasa sedih; dan gembirakanlah mereka dengan jannah yang telah dijanjikan Allah kepadamu\". Kamilah pelindung-pelindungmu dalam kehidupan dunia dan akhirat; di dalamnya kamu memperoleh apa yang kamu inginkan dan memperoleh (pula) di dalamnya apa yang kamu minta.Sebagai hidangan (bagimu) dari Tuhan Yang Maha Pengampun lagi Maha Penyayang.” -Fushshilat:30-32-. Dan Allah Yang Mahamulia lagi Mahatinggi juga berfirman: “Bagi mereka berita gembira di dalam kehidupan di dunia dan (dalam kehidupan} di akhirat” -Yunus:64- Dan telah ditafsirkan bahwa kabar gembira yang disebutkan di atas di dalam ayat itu adalah kabar gembira di dalam kehidupan dunia."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Waqi’ah ayat 89: 88-89. Allah menyebutkan kondisi orang-orang yang sekarat di dunia dan pembagian mereka kepada tiga bagian, bagian pertama : Jika mayat ini adalah orang-orang yang ikhlas yang berlomba-lomba dalam kebaikan, maka mereka ditempatkan di tempat yang tinggi, mereka memiliki tempat peristirahatan, kebahagiaan dan kemenangan serta rizki yang baik dan surga yang luas, yang mereka dapat bersenang-senang di dalalamnya di sisi Tuhan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni ketenangan, kegembiraan dan kenikmatan lahir-batin. Raihaan pada ayat tersebut adalah nama yang mencakup segala kenikmatan yang diterima badan, berupa makanan, minuman, dan lain-lain. Yakni yang menggabung rauh (ketenteraman) dan raihaan, dimana di dalamnya terdapat sesuatu yang belum pernah dilihat oleh mata, didengar oleh telinga, dan terlintas di hati manusia. Orang yang didekatkan dengan Allah, maka akan diberi kabar gembira dengan kabar gembira itu yang membuat ruhnya melayang dari jasad karena gembira dan senang. Hal ini sebagaimana firman Allah Ta’ala, “Sesungguhnya orang-orang yang mengatakan, \"Tuhan Kami ialah Allah\" kemudian mereka meneguhkan pendirian mereka, maka malaikat akan turun kepada mereka dengan mengatakan, \"Janganlah kamu takut dan janganlah merasa sedih; dan bergembiralah dengan surga yang telah dijanjikan Allah kepadamu\".--- Kamilah pelindung-pelindungmu dalam kehidupan dunia dan akhirat; di dalamnya kamu memperoleh apa yang kamu inginkan dan memperoleh (pula) di dalamnya apa yang kamu minta.---Sebagai hidangan (bagimu) dari Tuhan yang Maha Pengampun lagi Maha Penyayang.” (Terj. Fushshilat: 30-32) Dalam ayat lain Allah Subhaanahu wa Ta'aala berfirman, “Bagi mereka berita gembira di dalam kehidupan di dunia dan (dalam kehidupan} di akhirat. (Terj. Yuunus: 64)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Waqi’ah Ayat 89",
    "description": "88-89. Adapun jika dia yang mati itu termasuk orang-orang yang didekatkan kepada Allah karena ketaatan dan amal baiknya, maka dia pasti akan memperoleh ketenteraman dan rezeki serta surga yang penuh kenikmatan sebagai balasan atas semua yang telah mereka perbuat di dunia. 90-91. Dan adapun jika dia yang meninggal itu termasuk golongan kanan, yaitu orang yang selalu berbuat baik dan menaati ajaran Allah, maka keselamatanlah yang akan dikaruniakan bagimu karena kamu adalah bagian dari golongan kanan."
  }
]