[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "90-91. Lalu bila mayit itu termasuk Ashabul Yamin (golongan kanan), kepadanya dikatakan, “Salam untukmu dan keamanan, karena kamu termasuk golongan kanan.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "90 - 91. Jika yang meninggal dari golongan kanan, maka jangan risaukan keadaan mereka karena mereka selamat dan aman."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "90-91. Dan jika orang yang meninggal itu termasuk orang-orang dari golongan kanan, maka akan dikatakan kepadanya: “Keselamatan bagimu dari azab dan dari segala keburukan, karena kamu termasuk orang-orang dari golongan kanan.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "90-91. Apabila orang yang telah meninggal itu termasuk golongan kanan, maka mereka mendapat salam dari para malaikat ketika tengah menghadapi sekarat: keselamatan bagi kalian dari golongan kanan. Mereka telah mendahului kalian, dan kalian adalah bagian dari mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Adapun jika dia termasuk golongan kanan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "90-91. Dan firmanNya, “Dan adapun jika dia termasuk golongan kanan,” yakni, mereka yang telah menunaikan kewajiban-kewajiban dan meninggalkan hal-hal yang diharamkan, meski terjadi pada diri mereka sebagian kelalaian dalam sebagian hak-hak yang tidak merusak keimanan dan ketauhidan mereka, maka dikatakan kepada kepada salah seorang dari mereka “maka keselamatan bagimu karena kamu dari golongan kanan,” maksudnya engkau mendapatkan salam keselamatan dari saudara-saudaramu yang termasuk golongan kanan, yakni bahwa mereka memberikan salam kepadanya, mengucapkan salam hormat ketika ia sampai di tempat mereka dan bertemu dengan mereka. Atau dikatakan kepadanya, “Keselamatan bagimu dari segala penyakit, bencana, dan siksaan, karena engkau termasuk golongan kanan, yang selamat dari dosa-dosa yang membinasakan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Waqi’ah ayat 90: 90-91. Bagian yang kedua : Jika mayit ini dari golongan kanan (dan mereka menempati kedudukan di bawah bagian yang telah disebutkan pada ayat sebelumnya); Maka para malaikat mengabarkan dan berkata kepada mereka : Keselamatan yang engkau dapat dari golongan kanan, dan Allah menyelamatkan dari setiap petaka, keburukan dan bencana."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Menurut Syaikh As Sa’diy, yaitu mereka yang mengerjakan kewajiban dan meninggalkan hal yang haram, meskipun terjadi pengurangan pada sebagian hak yang tidak merusak tauhid dan iman mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Waqi’ah Ayat 90",
    "description": "90-91. Dan adapun jika dia yang meninggal itu termasuk golongan kanan, yaitu orang yang selalu berbuat baik dan menaati ajaran Allah, maka keselamatanlah yang akan dikaruniakan bagimu karena kamu adalah bagian dari golongan kanan"
  }
]