[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "92-94. Dan bila mayit itu termasuk orang-orang yang mendustakan kebangkitan, yang tersesat dari jalan kebenaran, dia mendapatkan jamuan berupa minuman dari Jahanam yang sangat panas mendidih, dan juga api membakar dimana dia akan merasakan azabnya yang berat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "92. Dan apabila yang meninggal termasuk orang-orang yang mendustakan apa yang dibawa oleh Rasul -ṣallallāhu 'alaihi wa sallam- dan orang-orang yang tersesat dari jalan yang lurus."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "92-94. Namun jika orang yang akan meninggal itu termasuk orang-orang yang mendustakan Allah dan hari kebangkitan, dan tersesat dari petunjuk; maka akan dihidangkan kepadanya minuman yang sangat pahit, dan dia akan masuk ke dalam neraka Jahannam."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "92. وَأَمَّآ إِن كَانَ مِنَ الْمُكَذِّبِينَ الضَّآلِّينَ (Dan adapun jika dia termasuk golongan yang mendustakan lagi sesat) Yakni yang mendustakan hari kebangkitan, dan tersesat dari petunjuk, yang merupakan golongan kiri."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "92. Adapun mereka yang mati dalam keadaan mendustakan Allah, rasul-Nya, dan hari kebangkitan, orang-orang yang sesat dan berpaling dari petunjuk mereka adalah golongan kiri"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Adapun jika dia termasuk golongan para pendusta lagi sesat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "92-94. “Dan adapun jika termasuk golongan orang yang mendustakan lagi sesat” yaitu mereka yang mendustakan kebenaran dan telah sesat dari (jalan) hidayah, “maka dia mendapat hidangan air yang mendidih dan dibakar di dalam neraka,” maksudnya, jamuan bagi mereka pada hari ketika mereka menghadap Rabb mereka adalah air yang dibakar di dalam neraka yang meliputi mereka dan sampai ke dalam hati mereka. Dan apabila mereka meminta minum karena rasa haus yang sangat, Dan jika mereka meminta minum, niscaya mereka akan diberi minum dengan air seperti besi yang mendidih yang menghanguskan muka. Itulah minuman yang paling buruk dan tempat istirahat yang paling jelek. -Alkahfi:29-"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Waqi’ah ayat 92: 92-94. Bagian yang ketiga : Jika mayit ini adalah dari orang-orang yang mendustakan Allah dan Rasul-Nya, yang mereka adalah orang-orang yang mengingkari hari kebangkitan dan hari akhir, orang-orang yang sesat dari tauhid dan ketaatan; Maka jamuan mereka adalah disiapkannya di dalam neraka air yang mendidih, mereka akan meminum setelah makan dari buah zaqum. Dan dijadikan di dalam neraka api dan adzab yang dirasakan oleh mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu mereka yang mendustakan kebenaran dan tersesat dari petunjuk."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Waqi’ah Ayat 92",
    "description": "92-94. Dan adapun jika dia yang meninggal itu termasuk golongan yang mendustakan ayat-ayat Allah lagi sesat akidah dan ibadahnya, maka dia akan mendapat hidangan air yang mendidih sebagai minumannya, dan dia akan mendapat hukuman yang pedih karena dibakar di dalam jahanam"
  }
]