[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "95-96. Sesungguhnya apa yang Kami kisahkan kepadamu ini (wahai Rasul) adalah kebenaran haqqul yaqin yang tidak ada keraguan padanya. Maka bertasbihlah dengan nama Tuhanmu Yang Mahaagung, sucikanlah Dia dari apa yang diucapkan orang-orang zhalim dan pengingkar. Mahatinggi Allah dari apa yang mereka katakan setinggi-tingginya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "95. Sesungguhnya apa yang Kami kisahkan kepadamu ini -wahai Rasul- adalah suatu keyakinan yang benar, yang tidak mengandung keraguan sama sekali."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "95-96. Hai Rasulullah, apa yang telah Kami sebutkan ini merupakan berita yang benar, maka bertasbihlah menyebut nama Tuhanmu Yang Maha Agung, dan dengan memuji karunia-Nya yang melimpah. Abu Hurairah meriwayatkan dari Nabi, beliau bersabda: “Dan jika orang yang akan meninggal adalah orang jahat, maka para malaikat itu berkata: ‘Keluarlah wahai jiwa yang buruk yang berada di jasad yang buruk, keluarlah dalam keadaan tercela, dan bergembiralah dengan air yang mendidih dan nanah, dan hal lain yang semisalnya’. Akan terus dikatakan kepadanya hal itu hingga nyawanya keluar, kemudian nyawa itu dibawa ke langit, namun langit tidak terbuka baginya.” (Diriwayatkan oleh Ibnu Majah dalam as-Sunan no. 4262 -zuhud, bab mengingat dan mempersiapkan kematian. al-Bushiri mengatakan, sanadnya shahih dan para perawinya tsiqat (Mishbah al-Zujajah 2/349), dan dishahihkan al-Albani (Shahih Ibnu Majah 2/420), dan diriwayatkan al-Hakim, serta dishahihkan dan disepakati oleh adz-Dzahabi dalam al-Mustadrak 1/37-40)."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "95. Sesungguhnya wahyu yang diturunkan kepadamu dalam surat ini adalah berita yang benar dan keyakinan yang pasti dan tidak ada keraguan padanya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya ini benar-benar merupakan keyakinan yang benar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "95. “Sesungguhnya (yang disebutkan ini),” yakni, yang telah disebutkan oleh Allah berupa pembalasan bagi amalan-amalan para hamba, yakni yang baik maupun yang buruk, serta perincian dari itu semua, “adalah suatu keyakinan yang benar,” yang tidak ada keraguan maupun kebimbangan padanya. Bahkan ia adalah kebenaran yang pasti terjadi. Dan Allah telah mempersaksikan kepada hamba-hambaNya dengan dalil-dalil tak terbantahkan yang menunjukkan itu semua, hingga bagi orang-orang yang berakal cemerlang, seakan-akan mereka merasakan dan menyaksikannya secara langsung, sehingga mereka memuji Allah atas apa yang telah Allah khususkan bagi mereka berupa nikmat agung dan karunia yang sangat besar ini."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Waqi’ah ayat 95: Ketahuilah Nabi Allah, yang telah Kami kisahkan kepadamu adalah kebenaran yang pasti, dimana tidak ada keraguan padanya; Dengan nampaknya bukti-bukti yang pasti, seolah-olah melihat langsung dengan mata kepala."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni pemberian balasan terhadap kebaikan dan keburukan yang dilakukan hamba serta rinciannya. Yang tidak ada keraguan lagi, bahkan benar dan pasti terjadi. Allah Subhaanahu wa Ta'aala telah memberikan buktinya baik dari dalil ‘aqli (akal) maupun naqli yang menunjukkan demikian sehingga hal itu di kalangan orang-orang yang berakal seakan-akan dirasakan oleh mereka dan disaksikannya. Maka mereka memuji Allah Subhaanahu wa Ta'aala atas nikmat yang dikaruniakan-Nya kepada mereka berupa hidayah irsyad (petunjuk) maupun hidayah taufiq (bantuan dari Allah untuk menjalankan petunjuk itu). Oleh karena itu, Allah Subhaanahu wa Ta'aala berfirman, “Maka bertasbihlah dengan (menyebut) nama Tuhanmu Yang Mahabesar.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Waqi’ah Ayat 95",
    "description": "95-96. Sungguh, semua yang disebutkan ini adalah suatu keyakinan yang benar. Maka, setelah kamu mengetahui dan memahami dengan benar, bertasbihlah dengan menyebut nama tuhanmu yang mahabesar lagi mahaagung"
  }
]