[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah memuliakan kedudukan diriNYa dan mengagungkan urusanNya karena kuasaNya untuk melakukan hal-hal yang tidak dapat diperbuat oleh siapapun selainNya; tiada tuhan yang berhak disembah selainNya, dan tidak ada tuhan (penguasa alam) selainNya. Dialah yang menjalankan hambaNYa, Muhammad di malam hari pada sebagian malamnya dengan jasad dan ruhnya dalam keadaan terjaga, bukan tidur, dari masjidil haram di makkah menuju masjidil aqsha di baitul maqdis yang Allah memberkahi sekelilingnya dari segi tanam-tanamannya, buah-buahannya dan lain sebagianya, dan Dia menjadikannya sebagai tempat hidup banyak nabi agar ia dapat menyaksikan keajaiban-keajaibab kuasa Allah dan petunjuk-petunjuk keesaanNYa. Sesungguhnya Allah , Dia mahamendengar semua ucapan para hambaNya lagi mahamelihat semua perbuatan mereka. Maka DIa akan memberikah hak setiap orang di dunia dan di akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Sungguh Allah -Subḥānahu- Maha Suci lagi Agung; lantaran kekuasaan-Nya yang tidak bisa ditandingi oleh selain-Nya. Dia lah yang memperjalankan hamba-Nya Muhammad -ṣallallāhu 'alaihi wa sallam- dengan jasad dan ruhnya serta dalam kondisi sadar (bukan mimpi) pada sebagian malam dari Masjidil Haram menuju Masjid Bait al-Maqdis (Al-Aqṣa) yang kami berkahi dan anugerahi tanah-tanah sekelilingnya dengan banyaknya buah-buahan, dan pertanian, serta sebagai tempat diutus dan menetapnya para Nabi -'alaihimussalām-, agar ia (Muhammad) menyaksikan sebagian tanda-tanda kebesaran Kami yang menunjukkan kekuasaan Allah -Subḥānahu-, karena sesungguhnya Dia Yang Maha Mendengar; tidak ada yang tersembunyi dari-Nya segala sesuatu yang terdengar, lagi Maha Melihat; tidak ada yang tersembunyi dari-Nya segala sesuatu terlihat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1. Maha Suci Allah dari segala yang tidak layak bagi kebesaran dan keagungan-Nya; Dia berkuasa untuk melakukan hal-hal menakjubkan, seperti memperjalankan hamba-Nya, Muhammad pada malam hari dengan jasad dan ruhnya dari Masjidil Haram di Makkah menuju Masjidil Haram di Baitul Maqdis yang telah Kami berkati sekelilingnya dengan banyak risalah dan berbagai jenis buah-buahan dan rezeki. Hal ini agar Kami menunjukkan kepadanya mukjizat-mukjizat yang agung seperti menaiki langit ke tujuh dan mukjizat-mukjizat lain yang menunjukkan keesaan dan kebesaran Allah. Dia Maha Mendengar segala perkataan dan Maha Melihat segala perbuatan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. سُبْحٰنَ الَّذِىٓ أَسْرَىٰ بِعَبْدِهِۦ لَيْلًا (Maha Suci Allah, yang telah memperjalankan hamba-Nya pada suatu malam) Yakni memperjalankan hamba-Nya di malam hari. Allah tidak menyebut beliau dalam ayat ini dengan Nabi-Nya, Rasul-Nya, atau Muhammad, hal ini sebagai penghormatan bagi beliau dengan menjadikannya dalam kedudukan yang mulia ini (yakni sebagai hamba-Nya). مِّنَ الْمَسْجِدِ الْحَرَامِ(dari Al Masjidil Haram) Rasulullah diperjalankan dari rumah milik Ummu Hani’ yang terletak di sebelah Masjidil Haram. إِلَى الْمَسْجِدِ الْأَقْصَا(ke Al Masjidil Aqsha) Yakni masjid Baitul Maqdis, dan pada saat itu tidak ada masjid setelahnya (oleh sebab itu disebut sebagai al-Masjidil Aqsha (masjid yang terjauh)). الَّذِى بٰرَكْنَا حَوْلَهُۥ(yang telah Kami berkahi sekelilingnya) Dengan buah-buahan, sungai-sungai, dan tempat tinggal para nabi dan orang-orang shalih; serta di sana terdapat keberkahan dunia dan akhirat. لِنُرِيَهُۥ مِنْ ءَايٰتِنَآ ۚ(agar Kami perlihatkan kepadanya sebagian dari tanda-tanda (kebesaran) Kami) Yakni keajaiban-keajaiban yang Allah tunjukkan kepada beliau di malam itu. إِنَّهُۥ(Sesungguhnya Dia) Yakni Allah Ta’ala. هُوَ السَّمِيعُ (Maha Mendengar) Segala suara. الْبَصِيرُ (lagi Maha Mengetahui) Segala wujud, termasuk diantaranya adalah Maha Mengetahui diri Rasulullah dan amal perbuatan-Nya. Terdapat pendapat mengatakan bahwa perjalanan tersebut dengan jasad dan ruh Rasulullah. Pendapat lain mengatakan perjalanan tersebut hanya dengan ruhnya saja. Isra’ Mi’raj terjadi satu tahun sebelum Rasullah berhijrah ke Madinah. Dan pendapat lain mengatakan terjadi beberapa tahun sebelum hijrah."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Diantara gaya bahasa al-Qur'an yang unik yaitu dengan mendatangkan sesuatu yang sudah dikenal baik secara istilah maupun adat atau logika, diantaranya : firman Allah : { سُبْحَانَ الَّذِي أَسْرَىٰ بِعَبْدِهِ لَيْلًا } \"Maha Suci Allah, yang telah memperjalankan hamba-Nya pada suatu malam\" dalam ayat disebutkan kata \"Lail\" padahal sudah difahami bahwa kata \"isra\" tidak memiliki makna lain melainkan hanya (perjalanan di malam hari); hal itu bertujuan untuk menghadirkan gambaran yang lebih jelas tentang Isra' ini ke dalam fikiran pendengar, sehingga seakan-akan ia benar-benar hadir dalam peristiwa malam itu, dan dengan konteks seperti ini memberikan nilai pengaruh yang lebih besar. 2 ). Dari ayat ini dapat disimpulkan bahwa dari penyebutan masjid al-Aqsho dengan menambahkan sifatnya yang diberkahi, dan tidak seperti masjid al-Harom yang tidak disebutkan sifat berkahnya: bahwasanya kemashuran masjid al-Harom sebagai masjid yang diberkahi telah meluas di kalangan masyarakat dan sebagai tempat berpijaknya Ibrahim juga sangat dikenal oleh kalangan Arab, adapun masjid al-Agsho bahkan tidak sedikit orang yang seolah-olah ia lupa tentangnya, lebih parahnya lagi orang-orang kafir dengan usaha mereka untuk mengahpuskan jejak-jejak kenabian dari masjid ini, hal itu karena kebencian orang Nashrani terhadap Yahudi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Keutamaan: Imam Ahmad, Tirmidzi, An-Nasai dan lainnya meriwayatkan dari ‘Aisyah RA bahwa Nabi SAW setiap malam membaca surah Bani Israil dan Az-Zumar. Surah ini juga dinamakan surah Bani Israil dan termasuk surah-surah awal yang diturunkan di Mekah. 1. Maha suci Allah dari apa yang tidak sesuai dengannyan berupa sifat-sifat lemah dan kurang, Dzat yang menjalankan hambaNya, Muhammad SAW secara jasad dan ruh pada sebagian malam sebelum satu tahun berhijrah, dari rumah Ummu Hani’ di seberang Masjidil Haram (Masijil Haram digunakan untuk menyebut Mekah atau tempat suci yang ada di Mekah) menuju masjid Baitul Maqdis yang Kami berkahi sekelilingnya dengan buah-buahan, perkebunan dan sungai-sungai, dan menjadikannya sebagai tempat turunnya malaikat dan tempat tinggalnya para nabi, supaya Kami bisa memperlihatkan dia sebagian dalil-dalil kekuasaan Kami yang menakjubkan dan betapa menakjubkannya para makhluk. Sesungguhnya Dia (Allah) itu Maha Mendengar ucapan-ucapan hamba-hambaNya dan Maha Melihat perbuatan-perbuatan mereka. Dan di sini Allah menggambarkan nabiNya sebagai orang yang menerima wahyu kehambaan untuk memberi penghormatan, kemuliaan dan isyarat kepadanya yang mana dia berkumpul bersama para nabi dan melakukan perjalanan langit. Dan sungguh rasulallah SAW telah mengatakan kepada kaum Quraisy tentang peristiwa Isra’ Mi’raj tersebut dan mereka mendustakannya lalu Allah menurunkan ayat ini untuknya sebagai wujud pembenaran baginya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maha suci} Maha suci dan Maha agung {Dzat yang telah memperjalankan hambaNya} memperjalankan nabi Muhammad dengan jasad dan ruhnya dengan keadaan sadar {pada malam hari dari Masjidil haram ke Masjidil aqsa yang telah Kami berkahi sekelilingnya agar Kami memperlihatkan kepadanya sebagian ayat-ayat Kami. Sesungguhnya Dia Maha Mendengar lagi Maha Melihat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1. Allah menyucikan dan mengagungkan diriNYa, karena Dia memiliki perbuatan-perbuatan dan aneka karunia yang agung. Termasuk dalam kategori itu adalah bahwa Dia “yang telah memperjalankan hambaNya,” yaitu RasulNya, Muhammad “dari Masjidil Haram,” masjid yang paling agung secara mutlak “ke Masjidil Aqsha,” sebuah masjid yang termasuk kategori masjid-masjid yang utama dan tempat (pusat) para nabi. Beliau diperjalankan dalam satu malam melintasi jarak yang sangat jauh, dan kembali pada malam itu juga. Allah menunjukkan tanda-tanda kebesaranNya kepada beliau, yang menyebabkan beliau mendapatkan tambahan petunjuk, kekuatan bashirah, ketetapan hati serta pembeda (antara yang benar dan bathil). Peristiwa ini menunjukkan perhatian dan kelembutan Allah terhadap Nabi, lantaran Dia memberikan kemudahan dalam seluruh uruusan serta melimpahkan karunia-karuniaNya kepada beliau beliau hingga mengungguli orang-orang terdahulu dan generasi yang akan datang dengannya. Zahirnya ayat menunjukkan bahwa, peristiwa Isra’ terjadi pada permulaan malam dan sejak dari tempat Masjidil Haram itu sendiri. Akan tetapi, telah disebutkan dalam kitab ash-Shahih bahwasanya Rasulullah memulai perjalanan Isra’ dari rumah Ummu Hani. Berdasarkan ini maka keutamaan Masjidil Haram berlaku untuk seluruh tanah Haram. Di setiap tanah Haram, (pahala) beribadah akan berliparganda sebagaimana pelipatgandaan (pahala) ibadah di dalam Masjidil haram. (Selain itu), ayat ini menunjukkan bahwasanya peristiwa Isra’ (dan MI’raj) berlangsung dengan ruh dan jasad Nabi sekaligus. Karena jika tidak demikian, maka kejadian ini bukanlah termasuk tanda kebesaran yang besar dan keistimewaan yang agung. Begitu banyak hadits yang diriwayatkan dari Nabi berkaitan dengan peristiwa Isra’ (dan Mi’raj). Nabi menerangkan secara rinci kejadian-kejadian yang telah beliau lihat, dan bahwasanya beliau diperjalankan di malam hari menuju Baitul Maqdis, kemudian dinaikkan dari sana menuju langit-langit hingga sampai pada permukaan atas langit yang tertinggi. Beliau telah menyaksikan surge dan neraka, (bertemu dengan) sejumlah Nabi sesuai dengan kedudukan mereka, lantas ditetapkan atas beliau kewajiban shalat lima puluh waktu (dalam sehari semalam). Atas arahan dari Nabi Musa al-Kalim, beliau berbolak-balik kepada RabbNya (untuk meminta keringanan) hingga menjadi lima kali waktu secara perbuatan, dan menjadi 50 dalam pahala dan balasannya. Beliau dan umatnya telah meraih sumber-sumber kebanggaan di malam itu, yang tidak ada yang mengetahui kadarnya kecuali Allah. Allah menyebut Muhammad di sini dan di dalam kesempatan menurunkan al-Quran dan di tempat penentangan sifat ‘ubudiyah. Lantaran Rasulullah telah meraih kedudukan-kedudukan yang tinggi ini melalui penyempurnaan penghambaan beliau kepada Rabbnya. Dan Firman Allah, “Yang telah Kami berkahi sekelilingnya,” dengan pepohonan yang banyak dan sungai-sungai dan kesuburan yang langgeng. Di antara keberkahan (Masjidil Aqsha) adalah pengutamaan Masjid ini dibandingkan masjid-masjid lainnya selain Masjidil Haram dan Masjid Nabawi, dan bahwasanya dituntut untuk memaksakan bepergian ke masjid-masjid ini semata-mata untuk beribadah dan shalat di dalamnya. Dan bahwa Allah telah mengkhususkan tempat ini bagi kebanyakan para nabi dan orang-orang pilihanNya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (سُبۡحَٰنَ) subhaana : Maha Suci dari segala yang tidak layak bagi keagungan dan kesempurnaan-Nya, yaitu Allah jalla jalaaluh. (بِعَبۡدِهِۦ) bi’abdih : dengan hamba-Nya dan Rasul-Nya Muhammad shallallahu ‘alaihi wa sallam. (مِّنَ ٱلۡمَسۡجِدِ ٱلۡحَرَامِ) minal masjidil haraami : dari Masjidil Haram yang berada di Mekah. (إِلَى ٱلۡمَسۡجِدِ ٱلۡأَقۡصَا) ilal masjidil aqshaa : menuju Masjidil Aqsha yang berada di Baitul Maqdis. (مِنۡ ءَايَٰتِنَآۚ) min aayaatinaa : keajaiban dan bukti kekuasaan Kami yang terdapat pada kerajaan tertinggi. Makna ayat: Allah ta’ala mensucikan diri-Nya dari segala yang disematkan oleh kaum musyrikin berupa sekutu, anak perempuan, dan sifat-sifat makhluk. Allah berfirman “Maha suci Allah yang telah memperjalankan hamba-Nya” yaitu Muhammad bin Abdullah bin Abdul Muthalib bin Hasyim Al-Qurasyi Al-‘Adnani “pada malam hari dari Masjidil Haram” dari Mekah ketika beliau keluar dari rumah Ummu Hani` dan hatinya dicuci dengan air zamzam, serta ditanami iman dan hikmah. Kemudian Allah memperjalankannya dari Masjidil Haram menuju Masjidil Aqsha di Baitul Maqdis. Nabi shallallahu ‘alaihi wa sallam mengabarkan bahwa Allah ta’ala mengumpulkan seluruh nabi di Masjidil Aqsha, dan beliau menjadi imam shalat bagi mereka, karena beliau adalah imam para nabi dan penutup mereka. Kemudian beliau naik ke atas langit, langit demi langit. Setiap langit beliau menemukan penghuninya, hingga sampai pada Sidratul Muntaha di sisinya ada surga Jannatul Ma`wa. Lalu beliau dinaikkan hingga dapat mendengar goresan pena-pena. Firman-Nya ta’ala “yang telah Kami berkahi sekelilingnya” yaitu disekitar Masjidil Aqsha, makna “sekelilingnya” bagian luarnya, yang meliputi pepohonan, sungai-sungai, dan buah-buahan. Adapun bagian dalamnya, maka keberkahan agama dengan dilipat gandakannya pahala shalat di dalamnya; pahalanya setara dengan pahala 500 shalat. Firman-Nya “agar Kami perlihatkan kepadanya sebagian tanda-tanda kebesaran Kami.” Ini adalah sebab dari Isra` dan Mi’raj. Yaitu, Allah memperjalankan hamba-Nya dan menaikkannya menuju langit, untuk memperlihatkan keajaiban ciptaan-Nya pada kerjaan tertinggi, dan agar apa yang telah ia ketahui dengan wahyu bisa ia saksikan dengan pengelihatan. Firman-Nya ta’ala “Sesungguhnya Dia Maha Mendengar Maha Melihat.” Maha Suci Dia, Dialah yang Maha Mendengar perkataan hamba-hamba-Nya, Maha Melihat perbuatan dan keadaan mereka, sehingga hikmah dari Isra` yang menakjubkan ini adalah untuk memperkuat keimanan orang yang beriman dan agar orang yang ragu semakin ragu dan bertambah kufur serta ingkar. Pelajaran dari ayat: 1. Penegasan keyakinan pada Isra` dan Mi’raj Nabi Muhammad shallallahu ‘alaihi wa sallam dengan ruh dan jasad beliau bersamaan, dari Masjidil Haram menuju Masjidil Aqsha, kemudian menuju langit-langit yang tinggi, hingga mendengar goresan pena-pena, dan Allah mewahyukan kepadanya apa yang Dia wahyukan, serta mewajibkan bagi umatnya shalat lima waktu. 2. Kemuliaan tiga masjid; Masjidil Haram, Masjid Nabawi shallallahu ‘alaihi wa sallam, dan Masjidil Aqsha. Masjidil Haram dan Masjidil Aqsha telah disebutkan dengan dalil tersendiri, adapun Masjid Rasulullah shallallahu ‘alaihi wa sallam disebutkan dengan isyarat yang mengarah ke sana, karena kata Al-Aqsha merujuk kepada qashiyy (jauh). Sehingga Al-Qashiyy adalah Masjid Nabawi dan Al-Aqsha adalah masjid di kompleks Baitul Maqdis. 3. Penjelasan hikmah dari Isra` dan Mi’raj, yaitu untuk menunjukkan kepada Rasulullah shallallahu ‘alaihi wa sallam dengan mata kepalanya apa yang telah dia imani dan ketahui dengan wahyu, sehingga yang gaib menjadi terang bagi Rasulullah shallallahu ‘alaihi wa sallam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 1: Masjidilharam adalah masjid yang paling utama secara mutlak, sedangkan Masjidil Aqsa termasuk masjid yang utama, di mana ia merupakan tempat para nabi. Syaikh As Sa’diy berkata, “Beliau diperjalankan dalam satu malam ke tempat yang jauh sekali, dan kembali pada malam itu. Allah memperlihatkan kepada Beliau ayat-ayat-Nya yang dengannya bertambahlah hidayah, bashirah (pandangan yang dalam) dan furqan (pembeda). Hal ini merupakan perhatian Allah Ta’ala dan kelembutan-Nya terhadap Beliau, di mana Allah memudahkan Beliau menuju kepada kemudahan dalam semua urusannya. Allah juga memberikan kepadanya nikmat yang banyak yang mengalahkan orang-orang terdahulu dan orang-orang yang datang kemudian. Zhahir ayat menunjukkan bahwa israa’ terjadi pada awal malam, dan dimulai dari Masjidilharam itu. Akan tetapi, ada riwayat dalam hadits shahih, bahwa Beliau diperjalankan dari rumah Ummu Hani’. Dengan demikian, keutamaan pada Masjidilharam untuk semua tanah haram. Semua bagiannya dilipatgandakan (pahala) ibadahnya sebagaimana dilipatgandakannya ibadah ketika di masjid tersebut. Hal ini juga menunjukkan bahwa isra’ terjadi dengan ruh dan jasadnya secara bersamaan, karena jika tidak demikian, maka sama saja tidak ada tanda besar dan keutamaan yang agung. Banyak hadits-hadits yang sah dari Nabi shallallahu 'alaihi wa sallam tentang israa’, dan perincian tentang apa yang Beliau lihat, dan bahwa Beliau diperjalankan ke Baitulmaqdis, lalu dari sana dinaikkan ke langit-langit sampai tiba di bagian langit yang paling atas. Beliau juga melihat surga dan neraka, dan melihat para nabi dengan tingkatan yang berbeda-beda. Ketika itu, Allah mewajibkan kepada Beliau shalat lima puluh waktu, lalu Beliau kembali menghadap Allah dan terus kembali dengan isyarat Nabi Musa Al Kalim, sehingga jumlahnya menjadi lima waktu dikerjakan, namun pahala dan balasannya seperti melakukan shalat lima puluh waktu. Ketika itu, Beliau dan umatnya membawa banyak kebanggan, di mana tidak ada yang mengetahui jumlahnya selain Allah ‘Azza wa Jalla. Faedah: Sebagian orang yang kurang akalnya mengatakan bahwa isra’ dan mi’raj bertentangan dengan akal sehat manusia. Kita menjawab, “Tidak, bahkan sama sekali tidak bertentangan dengan akal manusia, karena yang memperjalankan Nabi Muhammad shallallahu 'alaihi wa sallam dari Masjidil Haram ke Masjidil Aqsa adalah Allah Subhaanahu wa Ta'aala sebagaimana dalam ayat di atas, bukan Nabi Muhammad shallallahu 'alaihi wa sallam sendiri. Sedangkan Allah Maha Kuasa atas segala sesuatu dan semuanya mudah bagi-Nya. Untuk lebih jelasnya, kami akan membuatkan permisalan dengan pertanyaan berikut, “Mungkinkah seekor semut bisa tiba dari Jakarta ke Bogor dalam waktu tiga jam?” Jawab, “Mungkin, karena bisa saja semut tersebut berada dalam buah rambutan, lalu buah rambutan tersebut diangkut ke dalam sebuah mobil yang hendak berangkat dari Jakarta ke Bogor, ternyata sampai di Bogor hanya memakan waktu tiga jam, sehingga semut pun sampai di sana dalam waktu tiga jam.” Sampainya semut ke Bogor dalam waktu yang cukup singkat itu, karena yang memperjalankan adalah mobil yang memiliki kecepatan dan kekuatan, bukan semut itu sendiri. Perhatikanlah permisalan ini! Daerah-daerah sekitarnya mendapat berkah dari Allah dengan diutus-Nya nabi-nabi di negeri itu dan diberikan-Nya kesuburan tanah. Termasuk keberkahan Masjidil Aqsa adalah dilebihkan-Nya masjid itu di atas semua masjid selain Masjidilharam dan Masjid Nabawi, dan ia salah satu masjid yang dianjurkan mengadakan perjalanan untuk beribadah dan shalat di sana. Di samping itu, Allah Subhaanahu wa Ta'aala mengkhususkannya sebagai tempat para nabi dan makhluk pilihan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 1",
    "description": "Pada akhir surah an-nahl mengandung pesan kepada nabi Muhammad agar bersabar dan tidak bersedih hati disebabkan tipu daya dan penolakan orang-orang yang menentang dakwahnya. Di saat beliau mengalami kesulitan menghadapi orang-orang kafir yang menolak dakwahnya, ayat pertama dari surah ini menyatakan bahwa beliau mempunyai kedudukan yang mulia di sisi Allah, di mana Allah memperjalankannya dari masjidilharam ke masjidil aqsha dan memperlihatkan kepadanya tanda-tanda kekuasaan dan kebesarannya. Ayat pertama ini menyatakan, maha suci Allah, yang telah memperjalankan hamba-Nya, yakni nabi Muhammad, pada malam hari dari masjidilharam, yang berada di mekah ke masjidil aqsa, yang berada di palestina, yang telah kami berkahi sekelilingnya, dengan tanahnya yang subur yang menghasilkan aneka tanaman dan buah-buahan serta menjadi tempat turunnya para nabi, agar kami perlihatkan kepadanya dengan mata kepala atau mata hati sebagian dari tanda-tanda kebesaran dan kekuasaan kami. Sesungguhnya dia, yaitu Allah adalah maha mendengar perkataan hamba-Nya, maha mengetahui tingkah laku dan perbuatannya. Bila Allah memuliakan nabi Muhammad dengan memperjalalankannya dari masjidilharam ke masjidil aqsa, maka dia memuliakan nabi musa dengan menganugerahkan kepadanya kitab taurat agar menjadi petunjuk bagi bani israil. Dan kami berikan kepada nabi musa kitab, yaitu taurat, dan kami menjadikannya sebagai petunjuk yang khusus bagi bani israil, yaitu anak keturunan nabi yakub, agar mereka tidak menyembah kepada selain-ku. Kepada mereka aku berfirman, janganlah kamu mengambil penolong selain aku, yakni janganlah menyembah dan menggantungkan segala urusan kepada selain-ku."
  }
]