[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "9-10. Sesungguhnya al-qur’an yang kami turunkan kepada hamba kami Muhammad ini, menunjukan manusia kepada jalan terbaik, yaitu ajaran islam, membawa kabar gembira bagi kaum mukmin yang mengamalkan apa yang diperintahkan Allah kepada mereka dan berhenti dari perkara yang Allah larang mereka darinya, bahwa sesunggguhnya bagi mereka pahala yang besar dan bahwa sesungguhnya orang-orang yang tidak mempercayai kehidupan akhirat dan segala balasan yang ada di sana, maka kami sediakan bagi mereka siksaan yang menyakitkan di neraka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Ia juga memberikan kabar buruk bagi orang-orang yang tidak beriman dengan hari Kiamat, yaitu bahwasanya Kami akan menyediakan bagi mereka pada hari Kiamat kelak azab yang pedih."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10. Dan sesungguhnya orang-orang yang tidak beriman kepada hari kiamat dan apa yang terkandung didalamnya berupa penghisaban. Kami telah menyiapkan bagi mereka itu azab yang sangat menyakitkan yaitu azab neraka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan sesungguhnya orang-orang yang tidak beriman pada akhirat itu telah Kami sediakan} Kami persiapkan {bagi mereka azab yang sangat pedih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9-10. Allah mengabarkan tentang kemuliaan dan keagungan al-Quran, bahwasanya ia “memberikan petunjuk kepada (jalan) yang lebih lurus,” lebih adil dan mulia dalam aspek akidah, amal perbuatan, maupun akhlak. Barangsiapa yang meraih petunjuk dengan seruan ajaran al-Quran, maka dialah manusia yang paling sempurna, paling lurus dan paling sarat dengan petunjuk dalam segala urusannya “dan memberi kabar gembira kepada orang-orang Mukmin yang mengerjakan amal shalih,” yang berbentuk kewajiban-kewajiban maupun perbuatan-perbuatan yang bersifat sunnah “bahwa bagi mereka ada pahala yang besar.” Allah telah menyediakannya bagi mereka di tempat kemuliaanNya (surga), yang tidak ada yang mengetahui karakteristiknya kecuali Allah. “Dan bahwa orang-orang yang tidak beriman kepada kehidupan akhirat, Kami sediakan bagi mereka azab yang pedih.” Al-Quran mengandung kabar gembira dan ancaman, serta cara-cara perolehan kabar gembira itu, yaitu (dengan cara) beriman dan beramal shalih, dan sebab-sebab yang memastikan (datangnya) ancaman yaitu (dengan melakukan) perkara yang berlawanan dengannya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (أَعۡتَدۡنَا لَهُمۡ عَذَابًا أَلِيمٗا) a’tadnaa lahum ‘azaaban iliimaa : yaitu azab neraka kelak pada hari kiamat. Makna ayat; Sebagaimana Al-Qur’an mengabarkan tentang orang-orang yang tidak beriman dengan hari akhir, bahwa Allah menyiapkan untuk mereka azab yang pedih di Jahanam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 10: Ayat ini menunjukkan, bahwa Al Qur’an berisikan kabar gembira dan peringatan, menerangkan sebab-sebab untuk memperoleh kabar gembira, yaitu iman dan amal saleh dan sebab yang yang menjadikan seseorang mendapat ancaman, yaitu kebalikannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 10",
    "description": "Dan memberi kabar buruk serta ancaman bahwa sesungguhnya orangorang yang tidak beriman kepada kehidupan akhirat, kami sediakan bagi mereka kelak di hari kiamat azab yang pedih yaitu neraka. Dan manusia terkadang berdoa untuk kejahatan, seperti mengharapkan kematiannya, kematian anak dan keluarganya, atau untuk kehancuran harta bendanya dalam keadaan marah atau putus asa sebagaimana ia berdoa untuk kebaikan. Allah menyatakan, dan adalah manusia bersifat tergesa-gesa. Sifat itulah yang menyebabkan manusia berdoa untuk kejahatan, tanpa disadari bahwa doanya itu jika dikabulkan akan membawa kerugian bagi dirinya. Oleh karena itu, janganlah tergesagesa di dalam mengambil keputusan."
  }
]