[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai rasul) kepada orang-orang yang mengingkari kebenaran, ”jika sekiranya kalian itu memiliki pembendaharaan rahmat tuhanku yang tidak akan habis atau lenyap, pastilah kalian akan pelit dengannya, kalian tidak akan memberikannya kepada orang lain karena khawatir akan habis sehingga kalian akan berubah menjadi orang-orang miskin.” Dan termasuk karakter manusia, ia akan bersifat bakhil dengan apa yang ada di tangannya, kecuali orang yang Allah jaga dengan keimanan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "100. Katakanlah kepada kaum musyrikin itu wahai Rasul, \"Sekiranya kalian menguasai perbendaharaan rahmat Tuhanku yang tidak akan pernah habis dan terputus, niscaya kalian akan tetap enggan untuk membelanjakan dan menginfakkan perbendaharaan tersebut karena khawatir akan habis dan agar kalian tidak menjadi orang-orang miskin.\" Dan memang diantara tabiat manusia itu adalah bersifat kikir pada dirinya, kecuali bila ia seorang beriman maka tentu ia akan menginfakkan hartanya dengan harapan mendapatkan pahala dari Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "100. قُل لَّوْ أَنتُمْ تَمْلِكُونَ خَزَآئِنَ رَحْمَةِ رَبِّىٓ (Katakanlah: “Kalau seandainya kamu menguasai perbendaharaan-perbendaharaan rahmat Tuhanku) Seandainya mereka menggenggam seluruh perbendaharaan rezeki niscaya mereka tidak akan menginfakkannya karena kekikiran dan kebakhilan mereka. وَكَانَ الْإِنسٰنُ قَتُورًا (Dan adalah manusia itu sangat kikir) Yakni bakhil terhadap diri sendiri dan orang lain."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "100. Katakanlah kepada mereka wahai Nabi tentang sebab permintaan mereka tertolak: Dia pelit \"Kalau seandainya kamu menguasai perbendaharaan-perbendaharaan rahmat Tuhanku, niscaya kamu akan tetap menjadi kikir dan bakhil karena takit menjadi miskin\". Dan manusia yang kafir itu sangat kikir."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Sekiranya kalian memiliki perbendaharaan rahmat Tuhanku, maka kalian menahannya} kikir {karena takut habis”} karena takut habis dengan diinfakkan {Manusia itu memang sangat kikir} kikir dan pelit"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "100. “Katakanlah, ‘Kalau seandainya kamu menguasai perbendaharaan-perbendaharaan rahmat Rabbku,” yang tidak akan pernah habis dan tidak musnah “niscaya perbendaharaan itu kamu tahan karena takut membelanjakannya,” maksudnya, takut harta yang kamu keluarkan darinya akan habis. Namun, manusia tercipta dengan tabiat bakhil dan kikir."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 100: Yang tidak habis-habisnya. Termasuk di dalamnya rezeki dan hujan. Karena takut habis disebabkan kekikiranmu, padahal perbendaharaan Allah tidak akan habis, akan tetapI tabiat manusia kikir lagi bakhil."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 100",
    "description": "Ayat ini merupakan lanjutan dari jawaban terhadap tuntutan kaum musyrik. Katakanlah wahai nabi Muhammad, sekiranya kamu menguasai perbendaharaan rahmat tuhanku, berupa harta benda atau apa saja yang dianugerahkan Allah kepada makhluk-Nya, niscaya perbendaharaan itu kamu tahan, tidak kamu berikan kepada siapa yang membutuhkan karena takut membelanjakannya, yakni takut kemiskinan karena membelanjakan apa yang dianugerahkan oleh tuhanmu. Dan manusia itu memang sangat kikir. Demikianlah Allah tidak akan mengabulkan tuntutan mereka karena seperti itulah ketetapan Allah menyangkut hikmah dan maslahat dalam penciptaan makhluk-Nya. Ayat yang lalu menjelaskan bahwa kaum musyrik enggan menerima kebenaran yang disampaikan oleh nabi Muhammad meskipun telah ditunjukkan bukti-bukti yang sangat banyak. Hal ini sangat menyedihkan hati nabi yang sangat ingin agar umatnya beriman. Ayat ini memberikan hiburan kepada nabi dengan menguraikan kisah bani israil dengan kaumnya, sekaligus mengisyaratkan bahwa seandainya kaum musyrikin di mekah diberikan ayat-ayat yang mereka minta, niscaya mereka tetap tidak akan percaya sebagaimana keadaan kaum nabi musa. Dan sungguh, kami telah memberikan kepada musa, yang kami utus kepada bani israil dan kepada fir'aun dengan membawa sembilan mukjizat yang nyata, 2 sebagai bukti atas kerasulannya, akan tetapi fir'aun tetap ingkar dan tidak mau beriman kepadanya, maka tanyakanlah kepada bani israil, yang hidup pada masamu apa yang terjadi ketika musa datang kepada mereka, yakni kepada nenek moyang mereka. Ketahuilah bahwa ketika itu nabi musa menemui fir'aun menyampaikan risalah dan bukti-bukti kebenarannya, lalu fir'aun berkata kepadanya, wahai musa! sesungguhnya aku benar-benar menduga engkau terkena sihir. Demikian dituduhkan fir'aun kepada nabi musa."
  }
]