[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sesungguhnya Kami telah memberi Musa sembilan mukjizat yang nyata lagi mempersaksikan kebenaran kenabiannya, yaitu tongkat, tangan (yang memancarkan cahaya cemerlang), tahun-tahun kekeringan, minimnya buah-buahan, air bah, belalang, kutu, kodok, dan darah. Maka tanyakanlah (wahai rasul) kepada orang-orang yahudi demi menuntut pengakuan mereka ketika musa mendatangi para nenek moyang mereka dengan membawa mukjizat-mukjizatnya yang nyata, maka fir’aun berkata kepada Musa, ”sesungguhnya aku mengira engkau (wahai musa) seorang tukang sihir, tertipu dan terpedaya akan akalmu di bawah kendalinya, lantaran hal-hal aneh yang engkau bawa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "101. \"Dan sungguh Kami telah menganugerahkan pada Musa sembilan mukjizat yang membuktikan kebenarannya, yaitu berupa tongkat, tangan, tahun-tahun yang kering, berkurangnya buah-buahan, adanya angin topan, belalang, kutu, katak, dan darah. Maka tanyakanlah -wahai Rasul- kepada kaum Yahudi ketika Musa mendatangi pendahulu-pendahulu mereka dengan mukjizat-mukjizat itu, lantas Fir'aun berkata kepadanya, \"Wahai Musa, sungguh aku mengira engkau benar-benar seorang yang terkena sihir lantaran adanya hal-hal aneh yang engkau bawa\"."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "101-102. Sungguh Kami telah memberi Musa Tujuh mukjizat yang jelas; yaitu tongkat, tangan, kekurangan buah-buahan, banjir, peceklik, belalang, kutu, katak, dan darah. Hai Rasulullah, tanyakanlah kepada orang-orang Yahudi ketika Musa diutus kepada para pendahulu mereka, kemudian Fir’aun berkata kepadanya: “Hai Musa, Sungguh aku yakin kamu tela terkena sihir.” Maka Musa menjawab dengan penuh keberanian untuk membantah tuduhan dan kedustaan Fir’aun: “Sungguh kamu telah mengetahui bahwa tidak ada yang menurunkan berbagai mukjizat yang menunjukkan kebenaranku melainkan Tuhan langit dan bumi yang juga sebagai bukti yang jelas atas besarnya kekuasaan-Nya dan keesaan-Nya. sungguh aku yakin kamu akan binasa.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "101. وَلَقَدْ ءَاتَيْنَا مُوسَىٰ تِسْعَ ءَايٰتٍۭ بَيِّنٰتٍ ۖ (Dan sesungguhnya Kami telah memberikan kepada Musa sembilan buah mukjizat yang nyata) Yakni tanda-tanda yang menunjukkan kebenaran kenabiannya, dan bisa jadi mukjizat-mukjizat itu sebanding dengan mukjizat-mukjizat yang diusulkan oleh orang-orang kafir Quraisy atau bahkan lebih hebat lagi. Yakni yakni mukjizat-mukjizat itu tidak menjadikan Fir’aun dan kaumnya beriman, namun mengakibatkan mereka binasa; maka demikian apa yang kalian minta hai para penduduk Makkah. Sembilan mukjizat ini adalah taufan, belalang, kutu, katak, darah, tongkat, tangan, kemarau, dan kekurangan buah-buahan. Sebagian besar dari mukjizat ini telah dijelaskan pada surat al-A’raf: 133. Pendapat lain mengatakan bahwa yang dimaksud adalah Sembilan wasiat yang terdapat dalam Taurat. Imam Ahmad dan Tirmidzi mengeluarkan hadits yang dishahihkan oleh Imam Tirmidzi dari Shafwan bin ‘Assal bahwa seorang Yahudi berkata kepada seorang temannya: “marilah kita pergi ke nabi ini untuk menanyainya”. Maka keduanya mendatangi Rasulullah dan bertanya tentang firman Allah (وَلَقَدْ ءَاتَيْنَا مُوسَىٰ تِسْعَ ءَايٰتٍۭ بَيِّنٰتٍ). Kemudian Rasulullah menjawab: “yakni janganlah kalian menyekutukan Allah dengan sesuatu apapun, jangan berzina, jangan membunuh seseorang yang diharamkan untuk dibunuh kecuali dengan alasan yang hak, jangan mencuri, jangan melakukan sihir, jangan menggiring orang yang tidak bersalah menuju penguasa agar ia membunuhnya, jangan memakan harta riba, jangan menuduhkan perbuatan keji pada wanita yang menjaga kehormatan, dan khusus bagi kalian wahai orang-orang Yahudi untuk tidak melanggar kehormatan hari sabtu.” Maka kedua orang Yahudi ini mencium tangan dan kaki Rasulullah seraya berkata “kami bersaksi bahwa engkau adalah seorang Nabi Allah.” Rasulullah bertanya kepada mereka: “lalu apa yang menghalangi kalian untuk masuk Islam?” keduanya menjawab: “sesungguhnya Nabi Dawud memohon kepada Allah agar dalam keturunannya terus menerus diutus nabi dari mereka; dan kami khawatir jika kami masuk Islam, orang-orang Yahudi akan membunuh kami.” فَسْـَٔلْ بَنِىٓ إِسْرٰٓءِيلَ(maka tanyakanlah kepada Bani Israil) Yakni pertanyaan untuk meminta kesaksian agar menambah rasa yakin. Dan yang dimaksud dengan Bani Israil di sini adalah mereka yang telah beriman seperti Abdullah bin Salam dan para sahabatnya. فَقَالَ لَهُۥ فِرْعَوْنُ إِنِّى لَأَظُنُّكَ يٰمُوسَىٰ مَسْحُورًا (lalu Fir’aun berkata kepadanya: “Sesungguhnya aku sangka kamu, hai Musa, seorang yang kena sihir”) Makna (المسحور) yakni orang yang terkena sihir sehingga akalnya terganggu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "101. Sesungguhnya Kami telah memberikan kepada Musa sembilan buah mukjizat yang nyata sebagai bukti kebenaran risalahnya. Sebagaimana permintaan pendduk Makkah, namun Fir’aun dan para pengikutnya tetap tidak beriman, padahal mukjizat itu sungguh jelas dan nyata. Adapun sembilan mukjizat itu adalah topan, belalang, kutu, katak, darah, tongkat, tangan yang memancarkan sinar, tahun yang menakjubkan, kekurangan buah-buahan, menghapuskan harta, serta kemurnian atas hati sebagaimana sebelumnya pengganti dari tongkat dan tangan. Maka tanyakanlah kepada Mukmin Bani Israil wahai rasul tentang zamanmu sebagaimana ayat ini. Apakah kaummu tidak mengingkari juga, sehingga kamu jadikan ini sabagai hujjah untuk kaummu. Tatkala Musa datang kepada mereka lalu Fir´aun berkata kepadanya: \"Sesungguhnya aku sangka engkau sedang terkena sihir\". Sehingga akalnya disangka gila, sehingga Musa datang kepada mereka dengan keadaan seperti itu, yaitu dengan membawa risalah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sungguh Kami telah menganugerahkan kepada Musa sembilan mukjizat yang nyata} sembilan petunjuk yang jelas atas kenabiannya dan kebenaran hal yang datang kepadanya, yaitu tongkat, tangan, tahun-tahun kering, kekurangan buah, banjir bandang, belalang, kutu, katak, dan darah {Maka tanyakanlah kepada Bani Israil ketika dia datang kepada mereka lalu Fir‘aun berkata kepadanya,“Sesungguhnya aku benar-benar yakin bahwa kamu, wahai Musa, terkena sihir”} akalmu terkena sihir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "101. Maksudnya, bukanlah engkau, wahai rasul yang didukung dengan ayat-ayatNya , seorang rasul pertama yang dinyatakan dusta oleh umat manusia. Sesungguhnya Kami telah mengutus sebelummu Musa bin Imran al-Kalim kepada Firaun dan kaumnya. Kami memberikan kepadanya “Sembilan buah mukjizat yang nyata.” Setiap mukjizat itu sudah cukup memadai bagi orang-orang yang tujuannya adalah mengikkuti kebenaran. Mukjizat itu seperti ular, tongkat, angin topan, belalang, kutu, katak, darah, azab dan terbelahnya lautan. Apabila ada keraguan padamu tentang hal itu “Maka tanyakalanlah kepada Bani Israil, tatkala Musa datang kepada mereka lalu Firaun berkata kepadanya,” meskipun sudah didatangkan mukjizat-mukjizat ini, “sesungguhnya aku sangka kamu, hai Musa seorang yang kena sihir.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 101: Saakan-akan sebelum kalimat ini ada kalimat, “Wahai Rasul! Engkau bukanlah seorang saja rasul yang diberi mukjizat, dan bukan pula seorang saja rasul yang didustakan, bahkan rasul sebelummu juga.” Di mana masing-masingnya sebenarnya cukup sebagai bukti kebenaran Rasul tersebut. Mukjizat yang sembilan itu, menurut Ibnu Abbas adalah tongkat, tangan, kemarau panjang, laut, taufan (banjir), belalang, kutu, katak, dan darah. Menurut Muhammad bin Ka’ab adalah, tangan dan tongkat, lima lagi di surah Al A’raaf, serta thams (pembinasaan harta), dan (pemukulan tongkat ke) batu (sehingga memancarkan air).” Ibnu Abbas juga berkata (demikian pula Mujahid), “Yaitu tangannya, tongkatnya, kemarau panjang, kekurangan buah-buahan, taufan (banjir besar), belalang, kutu, katak dan darah.” Adapun Al Hasan Al Bashriy menjadikan kemarau panjang dan kekurangan buah-buahan sebagai satu mukjizat, menurutnya bahwa yang kesembilan adalah tongkatnya menelan tongkat-tongkat para tukang sihir yang membayangkannya sebagai ular. Sedangkan Syaikh As Sa’diy berpendapat, bahwa mukjizat tersebut misalnya ular, tongkat, taufan, belalang, kutu, katak, darah, rijz (azab) dan terbelahnya lautan. Jika engkau ragu-ragu terhadapnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 101",
    "description": "Ayat yang lalu menjelaskan bahwa kaum musyrik enggan menerima kebenaran yang disampaikan oleh nabi Muhammad meskipun telah ditunjukkan bukti-bukti yang sangat banyak. Hal ini sangat menyedihkan hati nabi yang sangat ingin agar umatnya beriman. Ayat ini memberikan hiburan kepada nabi dengan menguraikan kisah bani israil dengan kaumnya, sekaligus mengisyaratkan bahwa seandainya kaum musyrikin di mekah diberikan ayat-ayat yang mereka minta, niscaya mereka tetap tidak akan percaya sebagaimana keadaan kaum nabi musa. Dan sungguh, kami telah memberikan kepada musa, yang kami utus kepada bani israil dan kepada fir'aun dengan membawa sembilan mukjizat yang nyata, 2 sebagai bukti atas kerasulannya, akan tetapi fir'aun tetap ingkar dan tidak mau beriman kepadanya, maka tanyakanlah kepada bani israil, yang hidup pada masamu apa yang terjadi ketika musa datang kepada mereka, yakni kepada nenek moyang mereka. Ketahuilah bahwa ketika itu nabi musa menemui fir'aun menyampaikan risalah dan bukti-bukti kebenarannya, lalu fir'aun berkata kepadanya, wahai musa! sesungguhnya aku benar-benar menduga engkau terkena sihir. Demikian dituduhkan fir'aun kepada nabi musa. Mendengar tuduhan fir'aun itu, lalu dia, yakni nabi musa menjawab, sungguh, engkau wahai fir'aun telah mengetahui bahwa yang menurunkan mukjizat-Mukjizat itu ialah Allah, karena tidak ada yang kuasa menurunkan itu kecuali Allah tuhan pemelihara langit dan bumi. Dia menurunkannya sebagai bukti-bukti yang nyata yang dapat mengantar orang percaya kepada Allah. Akan tetapi engkau, wahai fir'aun, menolak bukti-bukti itu dan sungguh aku benar-benar menduga engkau akan binasa, wahai fir'aun, jika engkau tidak percaya kepada Allah dan tidak mau menerima tuntunan yang kusampaikan."
  }
]