[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka musa membalas ucapan fir’aun, ”sungguh engkau telah yakin wahai fir’aun, tidak ada yang menurunkan sembilan mukjizat itu yang membuktikan kebenaran kenabianku selain tuhan penguasa langit dan bumi, agar menjadi bukti bagi orang-orang yang memiliki akal lurus untuk mengetahui keesaan Allah dalam uluhiyah dan rububiyah. Dan sesungguhnya aku benar-benar yakin bahwa sesungguhnya engkau wahai fir’aun, akan binasa, terlaknat, lagi kalah.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "102. Musa menjawab sebagai bantahan kepadanya, \"Wahai Fir'aun! Sungguh engkau benar-benar yakin bahwa tidak ada yang menurunkan mukjizat-mukjizat ini kecuali Allah Tuhan seluruh langit dan bumi. Dia menurunkannya sebagai bukti nyata atas kekuasaan-Nya, dan kebenaran Rasul-Nya, namun engkau tetap saja ingkar, dan sungguh aku benar-benar yakin engkau akan binasa dan sengsara wahai Fir'aun!\"."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "102. قَالَ لَقَدْ عَلِمْتَ مَآ أَنزَلَ هٰٓؤُلَآءِ (Musa menjawab: “Sesungguhnya kamu telah mengetahui, bahwa tiada yang menurunkan mukjizat-mukjizat itu) Yakni mukjizat-mukjizat yang telah dipertunjukkan itu. إِلَّا رَبُّ السَّمٰوٰتِ وَالْأَرْضِ بَصَآئِرَ(kecuali Tuhan Yang memelihara langit dan bumi sebagai bukti-bukti yang nyata) Yakni bukti-bukti yang menunjukkan kekuasaan dan keesaan Allah. وَإِنِّى لَأَظُنُّكَ يٰفِرْعَوْنُ مَثْبُورًا(dan sesungguhnya aku mengira kamu, hai Fir’aun, seorang yang akan binasa”) Makna dari (الظن) dalam kalimat ini adalah merasa yakin. Dan makna (الثبور) yakni kebinasaan dan kerugian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "102. Musa menjawab perkataan Fir’aun: \"Sesungguhnya kamu telah mengetahui, bahwa tiada yang menurunkan mukjizat-mukjizat itu kecuali Tuhan Yang memelihara langit dan bumi sebagai bukti-bukti yang nyata atas Kemahaesaan-Nya dan kebenaran risalahku; dan sesungguhnya aku yakin bahwa engkau adalah seorang yang akan binasa dan merugi\". Zhann dua ayat tersebut bermakna meyakini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia} Musa {menjawab,“Sungguh kamu benar-benar telah mengetahui bahwa tidak ada yang menurunkan itu} mukjizat yang berjumlah sembilan ini {kecuali Tuhan langit dan bumi sebagai bukti-bukti yang nyata} petunjuk dan bukti atas kebenaran sesuatu yang aku bawa kepadamu {Sesungguhnya aku benar-benar yakin bahwa kamu} aku yakin bahwa kamu {wahai Fir‘aun, terlaknat”} celaka dan merugi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "102. Maka “Musa menjawab,” kepadanya “Sesungguhnya kamu telah mengetahui,” wahai Firaun “bahwa tidak ada yang menurunkan semua itu,” yaitu mukjizat-mukjizat itu “kecuali Rabb yang memelihara langit dan bumi sebagai bukti-bukti yang nyata,” dariNya untuk hamba-hambaNya. Dan perkataanmu itu bukanlah yang sejujurnya. Karena kamu mengatakan itu hanya untuk menyemangati kaummu dan mengolok-olok Bani Israil “dan sesungguhnya aku mengira kamu, hai Firaun, seorang yang akan binasa,” maksudnya yang dimurkai, dan dilemparkan ke dalam azab. Kamu mendapatkan kecelakaan, celaan, dan laknat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 102: Tetapi engkau masih saja mengingkari. Yakni dimurkai dan dilempar ke dalam azab."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 102",
    "description": "Mendengar tuduhan fir'aun itu, lalu dia, yakni nabi musa menjawab, sungguh, engkau wahai fir'aun telah mengetahui bahwa yang menurunkan mukjizat-Mukjizat itu ialah Allah, karena tidak ada yang kuasa menurunkan itu kecuali Allah tuhan pemelihara langit dan bumi. Dia menurunkannya sebagai bukti-bukti yang nyata yang dapat mengantar orang percaya kepada Allah. Akan tetapi engkau, wahai fir'aun, menolak bukti-bukti itu dan sungguh aku benar-benar menduga engkau akan binasa, wahai fir'aun, jika engkau tidak percaya kepada Allah dan tidak mau menerima tuntunan yang kusampaikan. Mendengar jawaban nabi musa, sikap fir'aun tetap tidak percaya bahkan semakin durhaka. Kemudian dia, yakni fir'aun hendak mengusir mereka, yaitu nabi musa dan pengikutnya dari bumi mesir, maka ketika ia benar-benar mengusir nabi musa dan pengikutnya, kami tenggelamkan dia, yakni fir'aun, beserta orang yang bersama dia seluruhnya ketika menyeberangi laut merah dalam perjalanan dari mesir menuju sinai."
  }
]