[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka fir’aun ingin melancarkan gangguan kepada Musa dan mengusirnya beserta bani israil dari wilayah mesir. Akan tetapi kemudian kami menenggelamkannya beserta pasukannya yang bersamanya di dalam laut sebagai hukuman bagi mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "103. Lalu Fir'aun hendak menghukum Musa dan kaumnya dengan mengusir mereka dari negeri Mesir, maka Kami binasakan dirinya beserta seluruh bala tentara yang bersamanya dengan penenggelaman."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "103-104. Setelah Fir’aun melihat kekalahannya berdebat dengan Musa, dia mulai menzalimi Musa dan Bani Israil, dan mengusir mereka dari Mesir. Maka Kami membalas Fir’aun dengan menenggelamkannya dan seluruh pengikutnya. Dan Kami katakan kepada Bani Israil: “Tinggallah di negeri suci di Syam; dan jika telah datang hari kiamat Kami akan mendatangkan kalian semua, baik itu yang beriman maupun yang kafir.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "103. فَأَرَادَ أَن يَسْتَفِزَّهُم مِّنَ الْأَرْضِ (Kemudian (Fir’aun) hendak mengusir mereka dari bumi (Mesir) itu) Yakni Fir’aun hendak mengusir Nabi Musa dan Bani Israil dari negeri Mesir. فَأَغْرَقْنٰهُ وَمَن مَّعَهُۥ جَمِيعًا(maka Kami tenggelamkan dia (Fir’aun) serta orang-orang yang bersama-sama dia seluruhnya) Yakni bala tentaranya yang mengejar Nabi Musa."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "103. Kemudian Fir´aun hendak mengusir mereka yaitu Musa dan pengikutnya Bani Israil dari bumi Mesir serta menjauhkan mereka dari Mesir. Maka Kami tenggelamkan Fir´aun beserta tentara dan orang-orang yang bersamanya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kemudian dia hendak mengusir mereka} mengusir Musa dan Bani Israil {dari bumi} dari tanah Mesir {lalu Kami menenggelamkannya beserta seluruh orang yang bersamanya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "103-104. “Kemudian dia berkehendak,” yaitu Firaun “mengusir mereka (Musa dan pengkiut-pengikutnya) dari bumi (Mesir) itu,” maksudnya mengusir dan mengeluarkan mereka dari negeri itu, “maka Kami menenggelamkan (Firaun) serta orang-orang yang bersama-samanya seluruhnya,” dan Kami wariskan bumi dan rumah-rumah mereka kepada Bani Israil. Oleh karenanya, Allah berfirman, “Dan Kami berfirman sesudah itu kepada Bani Israil, ‘Diamlah di negeri ini. Maka apabila datang masa berbangkit, niscaya Kami datangkan kamu dalam keadaan bercampur baur (dengan musuhmu)’,” semuanya, untuk memberi balasan setiap orang, sesuai dengan amalannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 103",
    "description": "Mendengar jawaban nabi musa, sikap fir'aun tetap tidak percaya bahkan semakin durhaka. Kemudian dia, yakni fir'aun hendak mengusir mereka, yaitu nabi musa dan pengikutnya dari bumi mesir, maka ketika ia benar-benar mengusir nabi musa dan pengikutnya, kami tenggelamkan dia, yakni fir'aun, beserta orang yang bersama dia seluruhnya ketika menyeberangi laut merah dalam perjalanan dari mesir menuju sinai. Dan setelah itu, yakni setelah penenggelaman itu, kami berfirman kepada bani israil, tinggAllah di negeri ini, palestina dan sekitarnya, tetapi apabila masa berbangkit datang kelak di hari kiamat, niscaya kami kumpulkan kamu dalam keadaan bercampur baur dengan orang-orang kafir dan semua musuh-Musuhmu. Dan kami akan memperhitungkan amal perbuatanmu dan memberikan pembalasan yang setimpal sesuai apa yang mereka lakukan."
  }
]