[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian kami berfirman kepada bani israil pasca kebinasaan fir’aun dan para pengikutnya. ”tinggalah kalian di negeri syam, apabila nanti datang hari kiamat, kami akan datang membawa kalain dari kubur-kubur kalian menuju tempat perhitungan amal dan perbuatan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "104. Dan setelah kebinasaan Fir'aun dan bala tentaranya, Kami berfirman kepada Bani Israil, \"Menetaplah di negeri Syam, tetapi apabila hari Kiamat telah tiba, Kami akan kumpulkan kalian semua di padang mahsyar untuk dihisab.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "104. وَقُلْنَا مِنۢ بَعْدِهِۦ لِبَنِىٓ إِسْرٰٓءِيلَ اسْكُنُوا۟ الْأَرْضَ (dan Kami berfirman sesudah itu kepada Bani Israil: “Diamlah di negeri ini) Yakni di negeri Baitul Maqdis. فَإِذَا جَآءَ وَعْدُ الْاٰخِرَةِ (maka apabila datang masa berbangkit) Yakni kehidupan akhirat, yaitu hari kiamat. Atau kerusakan kedua yang akan mereka lakukan sebagaimana yang disebutkan di awal surat. جِئْنَا بِكُمْ لَفِيفًا (niscaya Kami datangkan kamu dalam keadaan bercampur baur) Yakni Kami akan datangkan kalian dari kubur kalian dengan bercampur baur antara mukmin dan kafir dari segala tempat. Pendapat lain mengatakan yakni Kami akan datangkan kalian dari berbagai suku dan negeri menuju Baitul Maqdis untuk menyempurnakan apa yang telah Allah tetapkan dari kerusakan yang akan mereka lakukan pada kali kedua."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "104. Kami berfirman kepada Bani Israil sesudah kebinasaan Fir’aun: \"Diamlah di negeri ini, negeri di mana kalian ingin diusir oleh Fir’aun. Maka apabila hari kiamat datang, niscaya Kami kumpulkan kalian dalam keadaan bercampur baur antara mukmin dan kafir\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lalu Kami berfirman setelah itu} setelah pembinasaan Fir’aun {kepada Bani Israil,“Tinggallah di negeri ini} negeri Syam {Apabila janji kebangkitan datang, Kami akan mengumpulkan kalian dalam keadaan bercampur baur” (104)} kelompok-kelompok yang berbeda dari setiap ras"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "103-104. “Kemudian dia berkehendak,” yaitu Firaun “mengusir mereka (Musa dan pengkiut-pengikutnya) dari bumi (Mesir) itu,” maksudnya mengusir dan mengeluarkan mereka dari negeri itu, “maka Kami menenggelamkan (Firaun) serta orang-orang yang bersama-samanya seluruhnya,” dan Kami wariskan bumi dan rumah-rumah mereka kepada Bani Israil. Oleh karenanya, Allah berfirman, “Dan Kami berfirman sesudah itu kepada Bani Israil, ‘Diamlah di negeri ini. Maka apabila datang masa berbangkit, niscaya Kami datangkan kamu dalam keadaan bercampur baur (dengan musuhmu)’,” semuanya, untuk memberi balasan setiap orang, sesuai dengan amalannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 104",
    "description": "Dan setelah itu, yakni setelah penenggelaman itu, kami berfirman kepada bani israil, tinggAllah di negeri ini, palestina dan sekitarnya, tetapi apabila masa berbangkit datang kelak di hari kiamat, niscaya kami kumpulkan kamu dalam keadaan bercampur baur dengan orang-orang kafir dan semua musuh-Musuhmu. Dan kami akan memperhitungkan amal perbuatanmu dan memberikan pembalasan yang setimpal sesuai apa yang mereka lakukan. Setelah menguraikan kisah nabi musa dan kaumnya serta kaum musyrik yang enggan menerima kebenaran yang disampaikan nabi Muhammad, ayat selanjutnya menjelaskan tujuan diturunkan kitab suci Al-Qur'an untuk menyatakan bukti-bukti kebenaran itu. Dan kami turunkan Al-Qur'an itu dengan benar, yakni benar Al-Qur'an itu datang dari Allah, dan Al-Qur'an itu turun dengan membawa kebenaran, dalam kandungannya. Dan kami tidaklah mengutus engkau wahai nabi Muhammad, melainkan sebagai pembawa berita gembira bagi orang-orang yang taat akan masuk surga dan pemberi peringatan bagi orang-orang yang durhaka akan masuk neraka."
  }
]