[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan dengan kebenaranlah kami turunkan al-qur’an ini kepada Muhammad untuk memerintahkan hamba-hamba dan melarang mereka serta berisi berita pahala dan siksaan bagi mereka. Dan dengan kebenaran, keadilan, pemeliharaan dari perubahan dan revisi, al-qur’an itu turun. Dan kami tidaklah mengutus engkau (wahai rasul), kecuali sebagai pembawa berita gembira bagi orang yang taat dan mempertakutkan dengan neraka bagi orang yang berbuat maksiat dan kafir."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "105. Dan Kami turunkan Al-Qur`ān ini dengan sebenarnya kepada Muhammad -ṣallallāhu 'alaihi wa sallam-, dan ia turun kepadanya dengan membawa kebenaran tanpa bisa diganti dan dirubah. Dan Kami tidaklah mengutusmu -wahai Rasul- kecuali sebagai pembawa kabar gembira atas orang-orang yang bertakwa dengan adanya Surga, dan sebagai pemberi ancaman atas orang-orang kafir dan bermaksiat dengan adanya Neraka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "105. Allah menjelaskan keagungan al-Qur’an: “Dan Kami turunkan al-Qur’an yang mengandung kebenaran, dan diturunkan kepadamu -hai Muhammad- dalam keadaan terjaga dari segala macam perubahan. Dan Kami tidak mengutusmu melainkan sebagai penyampai kabar gembira berupa surga bagi orang yang taat dan sebagai pemberi peringatan berupa neraka bagi orang yang bermaksiat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "105. وَبِالْحَقِّ أَنزَلْنٰهُ وَبِالْحَقِّ نَزَلَ ۗ (Dan Kami turunkan (Al Quran) itu dengan sebenar-benarnya dan Al Quran itu telah turun dengan (membawa) kebenaran) Yakni Kami tidak menurunkan al-Qur’an melainkan dengan kebenaran. Dan al-Qur’an memang telah turun membawa kebenaran. وَمَآ أَرْسَلْنٰكَ إِلَّا مُبَشِّرًا(Dan Kami tidak mengutus kamu, melainkan sebagai pembawa berita gembira) Berupa surga bagi orang yang taat. وَنَذِيرًا (dan pemberi peringatan) Berupa neraka bagi orang yang bermaksiat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "105. Kami turunkan Al Quran itu dengan sebenar-benarnya dan Al Quran itu telah turun dengan membawa kebenaran tentang syariat, akidah yang benar dan tidak ada keraguan dalam Alquran. Kebenaran yang paling awal adalah bahwa Alquran diturunkan dari Allah. Yang kedua adalah Alquran mengandung akidah dan hukum-hukum. Kami tidak mengutus engkau wahai Muhammad, melainkan sebagai pembawa berita gembira dan pemberi peringatan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kami menurunkannya} Kami menurunkan Al-Qur’an {dengan sebenarnya dan (Al-Qur’an) itu turun dengan (membawa) kebenaran. Kami tidak mengutusmu kecuali sebagai pembawa berita gembira dan pemberi peringatan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "105. Maksudnya, Kami menurunkan al-Quran ini dengan kebenaran, untuk memerintahkan dan melarang para hamba, untuk memberi pahala dan hukuman “dan al-Quran itu telah turun dengan (membawa) kebenaran,” dengan kebenaran, keadilan dan perlindungan dari setan yang terkutuk “dan Kami tidak mengutus kamu, melainkan sebagai pembawa berita gembira,” bagi orang-orang yang menaati Allah dengan balasan pahala di dunia dan akhirat “dan pemberi peringatan,” bagi orang yang bermaksiat kepada Allah dengan hukuman di dunia dan akhirat. Hal ini menuntut adanya penjelasan tentang kabar gembira dan peringatan yang disampaikan itu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 105: Bagi orang-orang yang taat kepada Allah dengan surga. Bagi orang-orang yang bermaksiat dengan neraka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 105",
    "description": "Setelah menguraikan kisah nabi musa dan kaumnya serta kaum musyrik yang enggan menerima kebenaran yang disampaikan nabi Muhammad, ayat selanjutnya menjelaskan tujuan diturunkan kitab suci Al-Qur'an untuk menyatakan bukti-bukti kebenaran itu. Dan kami turunkan Al-Qur'an itu dengan benar, yakni benar Al-Qur'an itu datang dari Allah, dan Al-Qur'an itu turun dengan membawa kebenaran, dalam kandungannya. Dan kami tidaklah mengutus engkau wahai nabi Muhammad, melainkan sebagai pembawa berita gembira bagi orang-orang yang taat akan masuk surga dan pemberi peringatan bagi orang-orang yang durhaka akan masuk neraka. Selanjutnya dijelaskan tentang cara turunnya Al-Qur'an. Dan alqur'an kami turunkan berangsur-angsur, ayat demi ayat dalam masa lebih kurang 23 tahun, tidak kami turunkan secara sekaligus agar engkau wahai nabi Muhammad membacakannya kepada manusia perlahan-lahan, dengan demikian dapat dipahami tuntunannya dengan sebaik-baiknya dan mudah dihafalkan, dan kami menurunkannya secara bertahap sesuai dengan kebutuhan dan kemaslahatan manusia."
  }
]