[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kami telah menurunkan kepadamu (wahai rasul) al-qur’an yang telah kami jelaskan, kami rapikan dan kami uraikan untuk menjadi pembeda antara petunjuk dan kesesatan, kebenaran, dan kebatilan; agar engkau membacakannya kepada manusia dengan pelan-pelan dan perlahan-lahan, dan kami turunkan al-qur’an itu secara terpisah-pisah sedikit demi sedikit, sesuai dengan peristiwa-peristiwa yang terjadi dan tuntutan kondisi-kondisi."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "106. Dan Al-Qur`ān itu Kami turunkan dengan keterangan yang jelas, dengan harapan agar engkau membacakannya kepada manusia secara perlahan-lahan, dan tidak tergesa-gesa, karena hal itu lebih mudah untuk dipahami dan diperhatikan, dan Kami pula yang menurunkannya secara berangsur-angsur dan bertahap sesuai dengan peristiwa dan kondisi tertentu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "106-109. Kami telah menjelaskan al-Qur’an agar manusia membacanya dengan perlahan supaya mereka dapat memahaminya; dan Kami menurunkannya sedikit demi sedikit. Hai Rasulullah, katakanlah kepada orang-orang kafir: “Sama saja apakah kalian beriman kepada al-Qur’an atau tidak, ia tetaplah kitab yang benar. Sungguh orang-orang yang memiliki ilmu tentang kitab-kitab terdahulu, jika al-Qur’an dibacakan kepada mereka niscaya mereka akan mengimaninya dan mendengarnya dengan khusyu’ dan bersujud bersungkur di atas wajah mereka seraya berkata: ‘Maha Suci Tuhan kami, sungguh janji-Nya pasti akan terjadi’. Dan jika kembali dibacakan al-Qur’an kepada mereka, maka mereka akan kembali sujud dan bersungkur di atas wajah mereka sambil menangis dan kekhusyu’an dan ketundukan mereka kepada Allah akan semakin bertambah.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "106. وَقُرْءَانًا فَرَقْنٰهُ (Dan Al Quran itu telah Kami turunkan dengan berangsur-angsur) Yakni Kami menurunkannya sedikit demi sedikit, bukan sekaligus. لِتَقْرَأَهُۥ عَلَى النَّاسِ عَلَىٰ مُكْثٍ(agar kamu membacakannya perlahan-lahan kepada manusia) Yakni membacakannya selama masa diturunkannya sedikit demi sedikit dengan perlahan, hal ini menjadikannya lebih mudah dipahami dan dihafal. وَنَزَّلْنٰهُ تَنزِيلًا(dan Kami menurunkannya bagian demi bagian) Yakni Kami turunkan sedikit demi sedikit untuk kemaslahatan. Andai saja seluruh kewajiban diperintahkan dalam satu waktu niscaya orang-orang tidak akan mampu menjalankannya dan akan lari menjauh."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Diriwayatkan dari Mujahid bahwa seseorang bertanya bertanya kepadanya mengenai orang yang membaca al-Baqarah dan Ali 'Imran, dan seseorang lagi membaca al-Baqarah saja, kedua memulai shalat secara bersamaan, rukuk mereka sama, sampai sujud pun sama, Mujahid berkata: yang membaca al-Baqarah saja lebih afdhol, kemudian beliau membaca : { وَقُرْءَانًا فَرَقْنَٰهُ لِتَقْرَأَهُۥ عَلَى ٱلنَّاسِ عَلَىٰ مُكْثٍ } \"Dan Al Quran itu telah Kami turunkan dengan berangsur-angsur agar kamu membacakannya perlahan-lahan kepada manusia\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "106. Alquran itu telah Kami turunkan secara berangsur-angsur selama dua puluh tiga tahun tidak secara sekaligus, agar engkau membacakannya perlahan-lahan kepada manusia. Kami menurunkannya bagian demi bagian sesuai dengan kebutuhan dan konteks masalah dan hikmah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan Al-Qur’an Kami menurunkannya berangsur-angsur} Kami menjelaskan dan menguraikannya {agar kamu membacakannya kepada manusia secara perlahan-lahan} secara perlahan dan pelan {dan Kami benar-benar menurunkannya secara bertahap} dan Kami menurunkan Al-Qur’an terpisah secara berangsur-angsur sesuai kemaslahatan dan peristiwa yang terjadi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "106. Maksudnya, Kami menurunkan al-Quran ini secara berangsur-angsur untuk membedakan antara petunjuk dan kesesatan yang haq dan yang batil, “agar kamu membacakannya perlahan-lahan kepada manusia,” maksudnya dengan pelan-pelan supaya mereka merenunginya, menghayati makna-maknanya dan mengambil ilmu darinya “dan Kami menurunkannya bagian demi bagian,” maksudnya sedikit demi sedikit selama 23 tahun. \"Tidaklah orang-orang kafir itu datang kepadamu (membawa) sesuatu yang ganjil, melainkan Kami datangkan kepadamu suatu yang benar dan yang paling baik penjelasannya.\" (Al-Furqan:33)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 106: Dalam waktu 23 tahun. Agar mereka mentadabburi dan memikirkan kandungannya serta agar mereka paham. Sesuai situasi dan kondisi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 106",
    "description": "Selanjutnya dijelaskan tentang cara turunnya Al-Qur'an. Dan alqur'an kami turunkan berangsur-angsur, ayat demi ayat dalam masa lebih kurang 23 tahun, tidak kami turunkan secara sekaligus agar engkau wahai nabi Muhammad membacakannya kepada manusia perlahan-lahan, dengan demikian dapat dipahami tuntunannya dengan sebaik-baiknya dan mudah dihafalkan, dan kami menurunkannya secara bertahap sesuai dengan kebutuhan dan kemaslahatan manusia. Jika demikian sifat dan ciri-ciri Al-Qur'an sebagaimana dijelaskan oleh ayat-ayat yang lalu, maka wahai nabi Muhammad, katakanlah kepada orang-orang kafir mekah dan kepada manusia seluruhnya, berimanlah kamu kepadanya, yakni Al-Qur'an, atau tidak usah beriman, itu sama saja bagi Allah. Jika engkau beriman, engkau mendapat manfaat dari keimananmu. Dan jika engkau ingkar, engkau juga yang mendapat kerugian. Tidak ada manfaat sedikit pun bagi Allah dari keimanan kamu, dan tidak ada pula mudarat bagi Allah dari keingkaran kamu. Sesungguhnya orang yang telah diberi pengetahuan sebelumnya, yakni ulama ahli kitab yang beriman kepada nabi Muhammad, mereka diberi pengetahuan tentang wahyu Allah sebelum turunnya Al-Qur'an, apabila Al-Qur'an dibacakan kepada mereka, mereka menyungkurkan wajah, yakni menjatuhkan wajahnya untuk bersujud mengakui kebesaran Allah dan kebenaran firman-Nya."
  }
]