[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai rasul) kepada orang-orang yang mendustakan, ”berimanlah kepada al-qur’an atau tidak usah mengimaninya, karena sesungguhnya keimanan kalian tidak akan menambah kesempurnaan baginya dan pendustaan kalian tidak melekatkan kekurangan padanya. sesungguhnya orang-orang yang berilmu(ulama) yang diberi kitab-kitab suci terdahulu sebelum al-quran mengetahui hakikat wahyu, apabila dibacakan al-qur’an kepada mereka, mereka menjadi khusyu dan lalu bersujud dengan wajah-wajah mereka karena penganggungan kepada Allah dan sebagai rasa syukur kepadaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "107. Katakanlah wahai Rasul, \"Berimanlah kalian kepadanya, dan keimanan kalian tersebut tidaklah memberinya satu kelebihan apapun, atau janganlah kalian beriman kepadanya, dan kekafiran kalian tersebut tidaklah memberinya suatu kekurangan apapun. Sesungguhnya orang-orang yang membaca kitab-kitab samawi terdahulu dan mengetahui adanya wahyu dan kenabian, apabila Al-Qur`ān dibacakan kepada mereka, maka mereka segera menyungkurkan wajah bersujud kepada Allah sebagai tanda syukur kepada-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "107. قُلْ ءَامِنُوا۟ بِهِۦٓ أَوْ لَا تُؤْمِنُوٓا۟ ۚ (Katakanlah: “Berimanlah kamu kepadanya atau tidak usah beriman) Tanpa menambah-nambahkannya atau menguranginya. إِنَّ الَّذِينَ أُوتُوا۟ الْعِلْمَ مِن قَبْلِهِۦٓ( Sesungguhnya orang-orang yang diberi pengetahuan sebelumnya) Yakni orang-orang berilmu yang membaca kitab-kitab yang diturunkan terdahulu sebelum diturunkannya al-Qur’an dan yang mengetahui hakikat dari wahyu dan tanda-tanda kenabian seperti Zaid bin ‘Amr bin Naufal, Waraqah bin Naufal, dan Abdullah bin Salam. إِذَا يُتْلَىٰ عَلَيْهِمْ(apabila Al Quran dibacakan kepada mereka) Yakni saat al-Qur’an dibacakan kepada mereka. يَخِرُّونَ لِلْأَذْقَانِ سُجَّدًا(mereka menyungkur atas muka mereka sambil bersujud) Yakni sujud bersimpuh kepada Allah karena kebenaran yang mereka ketahui di dalam al-Qur’an."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "107-109 1. Barangsiapa yang diberikan kepada ilmu namun tidak dapat menangis karenanya sesungguhnya ia telah diberikan ilmu yang tidak memberi manfaat baginya. 2. Sufyan ats-Tauri berkata : barangsiapa yang dibuat nangis oleh ilmunya sesungguhnya dia adalah seorang ‘alim; Allah berfirman : { إِنَّ ٱلَّذِينَ أُوتُوا۟ ٱلْعِلْمَ مِن قَبْلِهِۦٓ إِذَا يُتْلَىٰ عَلَيْهِمْ يَخِرُّونَ لِلْأَذْقَانِ سُجَّدًا } “Sesungguhnya orang-orang yang diberi pengetahuan sebelumnya apabila Al Quran dibacakan kepada mereka, mereka menyungkur atas muka mereka sambil bersujud”, dan Allah juga berfirman : { إِذَا تُتْلَىٰ عَلَيْهِمْ ءَايَٰتُ ٱلرَّحْمَٰنِ خَرُّوا۟ سُجَّدًا وَبُكِيًّا } “Apabila dibacakan ayat-ayat Allah Yang Maha Pemurah kepada mereka, maka mereka menyungkur dengan bersujud dan menangis.” [Maryam : 58] 3. { وَيَخِرُّونَ لِلْأَذْقَانِ يَبْكُونَ وَيَزِيدُهُمْ خُشُوعًا} \" Dan mereka menyungkur atas muka mereka sambil menangis dan mereka bertambah khusyu\" begitulah mereka disanjung oleh Allah dengan tangis dan kekhusyuan mereka ketika mendengarkan al-Qur’an, lalu bagaimana dengan kita? Sesungguhnya dengan memahami dan mentadabburi ayat-ayat al-Qur’an yang kit abaca adalah cara yang paling tepat untuk menghadirkan tangis dalam bacaan kita."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "107. Katakanlah wahai Nabi kepada para musyrik Mekah dengan ancaman: \"Berimanlah kamu kepada Alquran maka iman itu akan bermanfaat untuk kalian, ataupun tidak usah beriman sama saja bagi Allah, namun jika kalian ingkar, itu akan berdampak buruk bagi kalian. Sesungguhnya Ulama Al kitab yang beriman sebelum Alquran turun, mereka yang telah memahami hakikat diturunkannya wahyu. Mereka adalah Waraqah bin Naufal, Zaid bin Umar, Ibnu Nufail, dan Abdullah bin Salam. Ketika Alquran dibacakan kepada mereka, mereka menyungkurkan muka mereka sambil bersujud dengan khusyuk karena mengagungkan wahyu Allah dan bersyukur atas diutusnya Nabi"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Katakanlah,“Berimanlah kepadanya atau tidak usah beriman. Sesungguhnya orang-orang yang telah diberi pengetahuan sebelumnya} sebelum turunnya Al-Qur’an {apabila dibacakan kepada mereka, maka mereka menyungkurkan wajah seraya bersujud”} mereka menjatuhkaan wajah mereka dengan cepat seraya bersujud kepada Allah untuk mengagungkan dan bersyukur kepadaNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "107. Apabila telah jelas bahwa al-Quran adalah kebenaran yang di dalamnya tidak ada keraguan dari sisi manapun, maka “katakanlah,” kepada orang-orang yang mendustakan dan berpaling darinya, “Berimanlah kamu kepadanya atau tidak usah beriman (sama saja bagi Allah).” Allah tidak membutuhkan kalian, dan kalian tidak akan bisa mencelakakan Allah. Bahkan dampak buruknya mengarah kepada kalian. Sesungguhnya Allah masih mempunyai hamba-hamba selainmu. Mereka itu adalah orang-orang yang mana Allah memberikan ilmu yang bermanfaat kepada mereka “apabila al-Quran dibacakan kepada mereka, niscaya mereka menyangkut atas muka mereka sambil bersujud,” maksudnya mereka sangat terpengaruh dan tunduk kepadanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 107: Kepada orang yang mendustakan dan berpaling darinya. Sebagai ancaman terhadap mereka; karena sesungguhnya Allah tidak butuh kepada mereka dan mereka pun tidak dapat merugikan-Nya, bahkan akibat dari sikap mereka itu kembalinya menimpa mereka, dan lagi Allah Subhaanahu wa Ta'aala memiliki hamba-hamba selain mereka, yaitu orang-orang yang diberi oleh Allah ilmu yang bermanfaat sebagaimana disebutkan pada lanjutan ayatnya. Mereka itu adalah Ahli Kitab yang beriman."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 107",
    "description": "Jika demikian sifat dan ciri-ciri Al-Qur'an sebagaimana dijelaskan oleh ayat-ayat yang lalu, maka wahai nabi Muhammad, katakanlah kepada orang-orang kafir mekah dan kepada manusia seluruhnya, berimanlah kamu kepadanya, yakni Al-Qur'an, atau tidak usah beriman, itu sama saja bagi Allah. Jika engkau beriman, engkau mendapat manfaat dari keimananmu. Dan jika engkau ingkar, engkau juga yang mendapat kerugian. Tidak ada manfaat sedikit pun bagi Allah dari keimanan kamu, dan tidak ada pula mudarat bagi Allah dari keingkaran kamu. Sesungguhnya orang yang telah diberi pengetahuan sebelumnya, yakni ulama ahli kitab yang beriman kepada nabi Muhammad, mereka diberi pengetahuan tentang wahyu Allah sebelum turunnya Al-Qur'an, apabila Al-Qur'an dibacakan kepada mereka, mereka menyungkurkan wajah, yakni menjatuhkan wajahnya untuk bersujud mengakui kebesaran Allah dan kebenaran firman-Nya. Dan dalam kondisi bersujud mereka berkata, mahasuci tuhan kami dari segala kekurangan dan ketidaksempurnaan; sungguh, janji tuhan kami bahwa dia akan menurunkan wahyu dan mengutus rasul-Nya pasti dipenuhi, dan telah dipenuhi janji itu dengan diutusnya nabi Muhammad dan diturunkannya Al-Qur'an."
  }
]