[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang yang diberi ilmu itu disaat mendengarkan al-qur’an berkata, ”kesucian menjadi milik tuhan kami dan Dia berlepas diri dari komentar yang diungkapkan kaum musyrikin kepadaNya, dan apa yang dijanjikan Allah yang berupa pahala dan siksaan akan terjadi, lagi merupakan kebenaran. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "108. Dan dalam sujudnya mereka berkata, \"Sungguh, Maha Suci Tuhan kami dari sifat menyelisihi janji, apa yang Dia janjikan berupa diutusnya Muhammad -ṣallallāhu 'alaihi wa sallam- telah terjadi, sesungguhnya janji Tuhan kami dengan hal itu atau hal lainnya pasti akan terjadi.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "108. وَيَقُولُونَ سُبْحٰنَ رَبِّنَآ إِن كَانَ وَعْدُ رَبِّنَا لَمَفْعُولًا (dan mereka berkata: “Maha Suci Tuhan kami, sesungguhnya janji Tuhan kami pasti dipenuhi”) Yakni janji Allah tentang kemenangan orang-orang beriman pasti akan datang. Atau janji Allah tentang kedatangan Rasul yang terakhir."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "107-109 1. Barangsiapa yang diberikan kepada ilmu namun tidak dapat menangis karenanya sesungguhnya ia telah diberikan ilmu yang tidak memberi manfaat baginya. 2. Sufyan ats-Tauri berkata : barangsiapa yang dibuat nangis oleh ilmunya sesungguhnya dia adalah seorang ‘alim; Allah berfirman : { إِنَّ ٱلَّذِينَ أُوتُوا۟ ٱلْعِلْمَ مِن قَبْلِهِۦٓ إِذَا يُتْلَىٰ عَلَيْهِمْ يَخِرُّونَ لِلْأَذْقَانِ سُجَّدًا } “Sesungguhnya orang-orang yang diberi pengetahuan sebelumnya apabila Al Quran dibacakan kepada mereka, mereka menyungkur atas muka mereka sambil bersujud”, dan Allah juga berfirman : { إِذَا تُتْلَىٰ عَلَيْهِمْ ءَايَٰتُ ٱلرَّحْمَٰنِ خَرُّوا۟ سُجَّدًا وَبُكِيًّا } “Apabila dibacakan ayat-ayat Allah Yang Maha Pemurah kepada mereka, maka mereka menyungkur dengan bersujud dan menangis.” [Maryam : 58] 3. { وَيَخِرُّونَ لِلْأَذْقَانِ يَبْكُونَ وَيَزِيدُهُمْ خُشُوعًا} \" Dan mereka menyungkur atas muka mereka sambil menangis dan mereka bertambah khusyu\" begitulah mereka disanjung oleh Allah dengan tangis dan kekhusyuan mereka ketika mendengarkan al-Qur’an, lalu bagaimana dengan kita? Sesungguhnya dengan memahami dan mentadabburi ayat-ayat al-Qur’an yang kit abaca adalah cara yang paling tepat untuk menghadirkan tangis dalam bacaan kita."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "108. Sambil bersujud mereka berkata: \"Maha Suci Tuhan kami dari sifat mengingkari janji, sesungguhnya janji Tuhan kami berupa hari kebangkitan dan perhitungan pasti dipenuhi\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka berkata,“Maha suci Tuhan kami. Sesungguhnya janji Tuhan kami pasti terlaksana”} pasti akan terjadi, bukan sesuatu yang mustahil"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "108. “Dan mereka berkata, ‘Mahasuci Rabb kami,” dari sesuatu yang dilekatkan oleh kaum musyrikin, yang tidak sesuai dengan keagunganNya. “Sesungguhnya janji Rabb kami,” berupa Hari Kebangkitan dan Pembalasan amalan “pasti dipenuhi.” Tidak mungkin diingkari, dan tidak ada keraguan sama sekali."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 108: Yakni Mahasuci Dia dari mengingkari janji, atau Mahasuci Dia dari segala yang dinisbatkan orang-orang musyrik kepada-Nya. Dengan akan menurunkan Al Qur’an dan akan diutusnya Nabi Muhammad shallallahu 'alaihi wa sallam. Atau maksudnya, bahwa janji-Nya dengan akan membangkitkan manusia dan memberikan balasan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 108",
    "description": "Dan dalam kondisi bersujud mereka berkata, mahasuci tuhan kami dari segala kekurangan dan ketidaksempurnaan; sungguh, janji tuhan kami bahwa dia akan menurunkan wahyu dan mengutus rasul-Nya pasti dipenuhi, dan telah dipenuhi janji itu dengan diutusnya nabi Muhammad dan diturunkannya Al-Qur'an. Dan mereka menyungkurkan wajah sekali lagi dan demikian seterusnya sambil menangis karena takut kepada Allah dan mereka bertambah khusyuk memohon kepada Allah setiap kali dibacakan kepada mereka ayat-ayat Al-Qur'an."
  }
]