[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan mereka menyungkur bersujud dengan wajah-wajah mereka, menangis lantaran tersentuh dengan nasihat-nasihat al-qur’an dan mendengar al-qur’an serta nasihat-nasihatnya semakin menambah ketundukan bagi mereka terhadap perintah Allah dan keagungan kuasaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "109. Dan mereka menyungkurkan wajah bersujud kepada Allah sembari menangis dalam keadaan khusyuk, dan pendengaran bacaan Al-Qur`ān serta pemahaman mereka terhadap makna kandungannya semakin membuat mereka tunduk dan takut kepada Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "109. وَيَخِرُّونَ لِلْأَذْقَانِ يَبْكُونَ (Dan mereka menyungkur atas muka mereka sambil menangis) Allah mengulangi penyebutan kalimat “menyungkur atas muka mereka sambil menangis” karena al-Qur’an sangat berpengaruh bagi hati mereka dan menambah kekhusyu’an mereka. وَيَزِيدُهُمْ (dan mereka bertambah) Yakni dengan mendengar bacaan al-Qur’an. خُشُوعًا (kekhusyu’annya) Yakni kelembutan hati dan mata yang berkaca-kaca."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "107-109 1. Barangsiapa yang diberikan kepada ilmu namun tidak dapat menangis karenanya sesungguhnya ia telah diberikan ilmu yang tidak memberi manfaat baginya. 2. Sufyan ats-Tauri berkata : barangsiapa yang dibuat nangis oleh ilmunya sesungguhnya dia adalah seorang ‘alim; Allah berfirman : { إِنَّ ٱلَّذِينَ أُوتُوا۟ ٱلْعِلْمَ مِن قَبْلِهِۦٓ إِذَا يُتْلَىٰ عَلَيْهِمْ يَخِرُّونَ لِلْأَذْقَانِ سُجَّدًا } “Sesungguhnya orang-orang yang diberi pengetahuan sebelumnya apabila Al Quran dibacakan kepada mereka, mereka menyungkur atas muka mereka sambil bersujud”, dan Allah juga berfirman : { إِذَا تُتْلَىٰ عَلَيْهِمْ ءَايَٰتُ ٱلرَّحْمَٰنِ خَرُّوا۟ سُجَّدًا وَبُكِيًّا } “Apabila dibacakan ayat-ayat Allah Yang Maha Pemurah kepada mereka, maka mereka menyungkur dengan bersujud dan menangis.” [Maryam : 58] 3. { وَيَخِرُّونَ لِلْأَذْقَانِ يَبْكُونَ وَيَزِيدُهُمْ خُشُوعًا} \" Dan mereka menyungkur atas muka mereka sambil menangis dan mereka bertambah khusyu\" begitulah mereka disanjung oleh Allah dengan tangis dan kekhusyuan mereka ketika mendengarkan al-Qur’an, lalu bagaimana dengan kita? Sesungguhnya dengan memahami dan mentadabburi ayat-ayat al-Qur’an yang kit abaca adalah cara yang paling tepat untuk menghadirkan tangis dalam bacaan kita."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "109. Mereka menyungkurkan wajah mereka sambil menangis karena takut kepada Allah dan mereka bertambah khusyu´ dalam mendengarkan Alquran. Ayat ini diulang sebagai penekakan tentang manfaat Alquran kepada orang mukmin"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka menyungkurkan wajah seraya menangis dan (Al-Qur’an) itu menambah kekhusyukan mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "109. “Dan mereka menyungkur atas muka mereka,” yaitu di atas wajah-wajah mereka “sambil menangis dan ia menambah mereka,” maksudnya al-Quran menambah “kekhusyuan.” Mereka itu sebagaimana orang-orang yang Allah beri nikmat bagi mereka dari kalangan ahlu kitab yang beriman seperti Abdullah bin Salam dan lainnya yang memeluk Islam di masa Nabi (masih hidup) dan setelahnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 109: Mereka ini seperti halnya Abdullah bin Salam dan Ahli KItab lainnya yang beriman sewaktu Nabi Muhammad shallallahu 'alaihi wa sallam hidup atau setelahnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 109",
    "description": "Dan mereka menyungkurkan wajah sekali lagi dan demikian seterusnya sambil menangis karena takut kepada Allah dan mereka bertambah khusyuk memohon kepada Allah setiap kali dibacakan kepada mereka ayat-ayat Al-Qur'an. Katakanlah wahai nabi Muhammad kepada orang-orang musyrik mekah, serulah Allah atau serulah ar-rahma'n, dia yang maha pengasih. Jangan ragu engkau menyeru dengan kedua nama itu, sebab keduanya adalah nama tuhan. Dengan nama yang mana saja kamu dapat menyeru, karena dia mempunyai nama-nama yang terbaik, yakni asma'ul-a'usna', sebutlah salah satu dari nama itu atau semuanya tidaklah berarti engkau mengakui berbilangnya zat tuhan, sebab berbilangnya nama tidak berarti berbilangnya zat tuhan, dan selanjutnya katakanlah kepada mereka janganlah engkau mengeraskan suaramu dalam salat, agar orangorang musyrik mekah tidak menyakitimu dan menghina agamamu, dan janganlah pula merendahkannya sehingga tidak terdengar suaramu sama sekali, dan usahakan jalan tengah di antara kedua itu, yakni tidak mengeraskan suara dalam salat dan tidak pula merendahkan suaranya."
  }
]