[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kadang-kadang manusia berdoa buruk bagi dirinya, anaknya atau hartanya ketika dalam kondisi marah, sebagaimana ia memohon kebaikan. Ini termasuk bukti kebodohan manusia dan tergesa-gesanya. Sedang, diantara bukti rahmat Allah bagi manusia Dia mengabulkan doa kebaikannya saja, tidak berharap doa buruknya. Karena Dia mengetahui tidak ada niat untuk keinginannya tersebut. Dan manusia secara tabiat bawaan memang bersifat tergesa-gesa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Seringkali manusia mendoakan keburukan untuk diri, anak dan hartanya tatkala marah -lantaran kejahilannya-, sama seperti halnya ia mendoakan kebaikan untuk dirinya. Sehingga andai Kami mengabulkan doa keburukannya tersebut, niscaya diri, anak dan hartanya akan binasa. Sungguh manusia memang memiliki fitrah suka tergesa-gesa, sehingga sering kali ia tergesa-gesa mengerjakan sesuatu yang bisa mendatangkan mudarat baginya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "11. Allah memberi petunjuk kepada manusia agar tidak berbuat zalim dalam berdoa, yaitu dengan mendoakan keburukan bagi diri sendiri, harta, dan anak-anak seperti ketika dia berdoa untuk kebaikan. Sungguh manusia selalu terburu-buru dalam mencapai apa yang dia inginkan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "11. وَيَدْعُ الْإِنسٰنُ بِالشَّرِّ (Dan manusia mendoa untuk kejahatan) Yaitu doa buruk seseorang untuk dirinya sendiri dan anak-anaknya yang tidak diharapkan untuk dikabulkan yang ia panjatkan saat ia sedang dalam kemarahan. دُعَآءَهُۥ بِالْخَيْرِ ۖ( sebagaimana ia mendoa untuk kebaikan) Yakni seperti doanya untuk kebaikan diri dan keluarganya, semisal doa memohon kesehatan, rezeki, dan lain sebagainya. Seandainya Allah mengabulkan doa buruknya niscaya ia akan binasa, namun Allah tidak mengabulkannya sebagai karunia dan kasih sayang-Nya. وَكَانَ الْإِنسٰنُ عَجُولًا(Dan adalah manusia bersifat tergesa-gesa) Yakni mempunyai tabiat bertega-gesa. Dan bagian dari sifat ketergesa-gesaannya ia memohon keburukan sebagaimanan ia memohon kebaikan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Al-Hasan menjelaskan ayat ini \"Dan manusia mendoa untuk kejahatan sebagaimana ia mendoa untuk kebaikan. Dan adalah manusia bersifat tergesa-gesa\" yakni doa manusia untuk kejahatan bagi anak dan istrinya, berawal dari kemarahan karena sesuatu yang buruk menimpa dirinya kemudian berdoa dengan doa yang buruk, ia mencela dirinya sendiri, istrinya, hartanya dan anak-anaknya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Dan manusia berdoa untuk dirinya dan keluarganya dengan doa yang mengandung keburukan atau kemahdharatan ketika lelah dan marah, sebagaimana doanya yang mengandung kebaikan bagi dirinya dan keluarganya seperti meminta kemuliaan, harta dan kesehatan. Dan manusia itu tergesa-gesa dalam urusan-urusannya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Manusia berdoa untuk keburukan sebagaimana doanya} sebagaimana doanya {untuk kebaikan. Dan manusia itu tergesa-gesa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11. Inilah salah satu bentuk kebodohan manusia dan sifatnya yang terburu-buru. Dia tergesa-gesa untuk berdoa bagi dirinya, anak dan hartanya dengan doa keburukan tatkala dia marah, sebagaimana dia (juga) bersegera dalam berdoa meminta kebaikan. Akan tetapi, Allah dengan sifat kelembutanNYa kepada para hamba, hanya mengabulkan doa kebaikan dan tidak mengabulkan doa keburukannya. \"Dan kalau sekiranya Allah menyegerakan kejahatan bagi manusia seperti permintaan mereka untuk menyegerakan kebaikan, pastilah diakhiri umur mereka. Maka Kami biarkan orang-orang yang tidak mengharapkan pertemuan dengan Kami, bergelimangan di dalam kesesatan mereka.\" (Yunus:11)."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (وَيَدۡعُ ٱلۡإِنسَٰنُ بِٱلشَّرِّ) wa yad’ul insaanu bisy syarr : mendoakan keburukan untuk dirinya atau keluarganya tatkala ia kesal dan marah. (وَكَانَ ٱلۡإِنسَٰنُ عَجُولٗا) wa kaanal insaanu ‘ajuulaa : mudah terpengaruh dengan apa yang terlintas di benaknya, tidak berpikir panjang dan teliti. Makna ayat: Firman-Nya ta’ala “Dan manusia berdoa keburukan sebagaimana doa untuk kebaikan...” Allah ta’ala mengabarkan perihal kelemahan manusia dan ketidaktahuan mereka terhadap akibat-akibat suatu perkara. Seperti, jika ia sedang tertimpa kesulitan atau marah maka ia akan mendoakan keburukan untuk dirinya atau keluarganya, tanpa berpikir panjang mengenai efek dari doa tersebut seandainya Allah ta’ala mengkabulkan doanya. Manusia mendoakan keburukan seperti ia berdoa untuk kebaikan, firman-Nya “Dan memang manusia bersifat tergesa-gesa.” Terburu-buru dalam banyak perkara, ini adalah tabiatnya jika ia tidak berakhlak dengan adab dan akhlak qurani. Namun, jika ia istiqamah di atas manhaj (jalan) Al-Qur’an tabiatnya akan berubah, sehingga ia memiliki sifat hati-hati, sabar, dan tenang."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 11: Bagi diri, keluarga, dan hartanya ketika marah. Hal ini karena kebodohan dan sikap tergesa-gesanya. Akan tetapi, Allah Subhaanahu wa Ta'aala karena kelembutan-Nya mengabulkan yang baiknya, tidak yang buruk, karena sebagaimana firman-Nya, “Dan kalau sekiranya Allah menyegerakan kejahatan bagi manusia seperti permintaan mereka untuk menyegerakan kebaikan, pastilah diakhiri umur mereka…dst.” (Terj. Yunus: 11) Dengan berdoa untuk keburukan diri dan keluarganya tanpa melihat akibatnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 11",
    "description": "Dan manusia terkadang berdoa untuk kejahatan, seperti mengharapkan kematiannya, kematian anak dan keluarganya, atau untuk kehancuran harta bendanya dalam keadaan marah atau putus asa sebagaimana ia berdoa untuk kebaikan. Allah menyatakan, dan adalah manusia bersifat tergesa-gesa. Sifat itulah yang menyebabkan manusia berdoa untuk kejahatan, tanpa disadari bahwa doanya itu jika dikabulkan akan membawa kerugian bagi dirinya. Oleh karena itu, janganlah tergesagesa di dalam mengambil keputusan. Dan kami jadikan malam dan siang dan silih bergantinya keduanya itu sebagai dua tanda untuk menunjukkan kekuasaan kami, lalu kami hapuskan tanda malam, kami hapus cahayanya sehingga terjadilah kegelapan dan engkau tidak dapat melihat segala sesuatu di sekitarmu, dan kami jadikan tanda siang itu terang, yakni kami jadikan siang dapat menerangi, sehingga kamu dapat melihat segala sesuatu di sekitarmu. Demikian itu agar kamu dapat mencari kurnia dari tuhanmu dengan melakukan pekerjaan yang bermanfaat bagi kehidupanmu. Dan agar dengan kehadiran malam dan siang itu kamu mengetahui bilangan tahuntahun dan perhitungan waktu yang sangat bermanfaat bagi kehidupan manusia. Sebagai penutup, ayat ini menyatakan, dan segala sesuatu yang bermanfaat bagi kehidupanmu telah kami terangkan dengan jelas, tidak ada sesuatu yang terlewati agar menjadi pelajaran bagimu."
  }
]