[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai rasul), kepada orang-orang musyrik dari kaummu yang mengingkari engkau berdoa dengan membaca, ”Ya allah, ya rahman” Serulah Allah atau serulah arrahman. dengan namaNya yang mana saja kalian menyeruNya, sesungguhnya kalian telah menyeru tuhan yang satu. Sebab, nama-namaNya itu mahabaik. Dan janganlah engkau mengeraskan suaramu di dalam shalatmu sehingga kaum musyrikin mendengarmu, dan jangnlah engkau lirihkan sehingga para sahabatmu tidak mendengarmu. Bersikaplah tengah-tengah antara keras dan lirih."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "110. Katakanlah wahai Rasul kepada orang-orang yang mengingkari ucapanmu tatkala berdoa \"Ya Allah, Ya Rahmān\", \"Sungguh Allah dan Rahmān merupakan dua nama bagi-Nya, maka serulah Dia dengan salah satunya atau dengan nama-nama-Nya yang lain, karena Dia memiliki nama-nama yang baik, dan dua nama ini diantara nama-nama yang baik tersebut.\" Dan janganlah engkau mengeraskan suaramu dalam salat sehingga orang-orang musyrik mendengar bacaannmu, dan jangan pula merendahkannya sehingga orang-orang beriman tidak mendengar bacaanmu, akan tetapi usahakanlah untuk menempuh jalan tengah di antara keduanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "110-111. Hai Muhammad, katakanlah kepada orang-orang musyrik yang mengingkari nama ‘ar-Rahman’: Serulah Allah dengan seruan ‘ya Allah’ atau ‘ya Rahman’; dengan mana saja dari dua nama ini kamu menyeru-Nya, maka kamu sedang menyeru satu Tuhan, sebab seluruh nama-nama Allah merupakan nama yang baik. Dan janganlah kamu mengeraskan bacaan al-Qur’an dalam shalatmu sehingga orang-orang musyrik dapat mendengarnya, sehingga mereka akan menghina al-Qur’an dan menghina Allah yang telah menurunkannya; dan jangan pula kamu membacanya terlalu pelan, sehingga makmum yang dibelakangmu tidak dapat mendengar bacaanmu; namun bacalah dengan suara pertengahan antara keras dan berbisik. Dan katakanlah: “Segala puji bagi Allah dan Maha Suci dari memiliki anak dan sekutu dalam penyembahan-Nya; Dia tidak mengangkat seorangpun makhluknya untuk menjadi penguat dan penolong-Nya, karena Dia Maha Kaya dan tidak membutuhkan makhluk, Dia harus diagungkan seagung-agungnya dengan dzikir dan rasa syukur.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "110. قُلِ ادْعُوا۟ اللهَ أَوِ ادْعُوا۟ الرَّحْمٰنَ ۖ (Katakanlah: “Serulah Allah atau serulah Ar-Rahman) Ibnu Abbas meriwayatkan: suatu hari Rasulullah melaksanakan shalat di Makkah, lalu beliau berkata dalam doanya: “Ya Allah Ya Rahman.” Maka orang-orang musyrik berkata: “lihatlah pada orang yang keluar dari agama nenek moyangnya ini, dia melarang kita untuk menyembah dua tuhan, sedangkan dia sendiri menyembah dua tuhan (yakni Allah dan Rahman).” Maka Allah menurunkan ayat ini, yang maknanya adalah dua nama ini sama-sama dibolehkan dalam penyebutannya dan penggunaannya untuk berdoa. أَيًّا مَّا تَدْعُوا۟ (Dengan nama yang mana saja kamu seru) Yakni nama yang mana saja dari asma’ul husna yang kalian pakai untuk berdoa tidaklah suatu masalah bagi kalian. فَلَهُ الْأَسْمَآءُ الْحُسْنَىٰ ۚ (Dia mempunyai al asmaaul husna) Dan yang dimaksud dengan asma’ul husna (nama-nama yang baik) adalah keesaannya dalam sifat-sifat keagungan dan kemuliaan. وَلَا تَجْهَرْ بِصَلَاتِكَ وَلَا تُخَافِتْ بِهَا(dan janganlah kamu mengeraskan suaramu dalam shalatmu dan janganlah pula merendahkannya) Yakni dalam bacaan shalatmu. وَابْتَغِ بَيْنَ ذٰلِكَ سَبِيلًا(dan carilah jalan tengah di antara kedua itu”) Yakni tidak dengan suara yang terlalu keras atau terlalu rendah. Ini adalah hukum bagi orang yang menjalankan shalat sendirian, adapun bagi imam maka ia harus mengeraskannya pada shalat maghrib, dan isya’ pada dua rakaat pertama, dan shalat subuh dan jum’at, hal ini agar makmum yang dibelakangnya dapat mendengar bacaannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "110. Wahai Nabi, katakanlah kepada orang musyrik dan para pengingkar Allah pemilik nama Arrahman: \"Serulah Allah dengan berkata Wahai Allah Yang Maha Pengasih (Ar-Rahman). Dialah Pemilik dua sifat itu. Dengan nama yang mana saja kamu seru, Dia mempunyai al asma al husna (nama-nama yang terbaik) yang tertuju pada sifat kemahaluhuran dan kemuliaan-Nya. Jangan kamu lantangkan suaramu dalam shalatmu wahai Nabi sehingga mereka tidak mendengarnya dan jangan pula melirihkannya dan carilah jalan tengah\". Orang musyrik mendengar Nabi berdoa: “Ya Allah, Ya Rahman.” Sehingga orang musyrik berkata: “Lihatlah dia, dia melarang kami untuk menyembah dua tuhan namun dia sendiri menyembah dua tuhan. Maka turunlah ayat ini."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Serulah Allah atau serulah Ar-Raḥmān, Nama mana saja yang kalian seru} nama manapun dari nama Allah yang kalian seru {Dia mempunyai nama-nama yang terbaik. Janganlah mengeraskan (suara)} janganlah meninggikan suaramu {pada (bacaan) shalatmu} suara bacaanmu dalam shalat {dan jangan pula merendahkan} merahasiakan {bacaannya. Carilah} carilah {jalan} jalan tenga {di antara itu} antarah keras dan rendah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "110. Allah berfirman kepada para hambaNya, “Serulah Allah atau serulah ar-Rahman,” maksudnya nama mana saja yang kamu kehenddaki “dengan nama yang mana saja kamu seru, Dia mempunyai Asmaul Husna (nama-nama yang terbaik).” Allah tidak mempunyai nama yang tidak baik sehingga Dia (perlu) melarang berdoa dengan nama itu. (Bahkan), nama-nama Allah mana saja yang kamu gunakan untuk menyeruNya, niscaya tujuannya akan tercapai. Dan seyogyanya, apabila berdoa, hendaklah disebutkan dalam setiap permintaan dengan permohonan yang sesuai dengan nama-nama itu. “Dan jangalah kamu mengeraskan suaramu dalam shalatmu,” maksudnya bacaanmu, “dan janganlah pula merendahkannya,” masing-masing dua perkara ini mengandung unsur yang terlarang. Adapun bacaan yang keras, maka apabila orang-orang musyrik yang ingkar itu mendengarnya, tentu mereka akan mencelanya dan mencela orang yang membacanya. Sedangkan bacaan yang pelan, maka orang-orang yang ingin mendengarkannya (secara diam-diam) tidak akan bisa merealisasikan maksudnya. “Dan carilah di antara kedua itu,” yaitu antara mengeraskan bacaan dan memelankannya, “jalan,” yaitu jalan tengah di antara keduanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 110: Kepada orang-orang musyrik yang mengingkari sifat rahmah (penyayang) bagi Allah ‘Azza wa Jalla dan menolak menamai-Nya dengan Ar Rahman, atau kepada hamba-hamba-Nya. Nama yang dimiliki-Nya hanya yang terbaik. Oleh karena itu, nama yang mana saja di antara nama-nama-Nya kamu dapat berdoa dengannya, namun sepatutnya ketika berdoa; menggunakan nama-Nya yang sesuai. Misalnya, ketika meminta rezeki, maka menggunakan nama-Nya Ar Razzaq (Maha Pember rezeki), dsb. Imam Bukhari meriwayatkan dengan sanadnya yang sampai kepada Ibnu Abas radhiyallahu 'anhuma, tentang firman Allah Ta’ala, “Dan janganlah engkau mengeraskan suaramu dalam shalat dan jangan (pula) merendahkannya,” ia berkata, “Ayat tersebut turun, ketika itu Rasulullah shallallahu 'alaihi wa sallam sedang bersembunyi di Mekah. Beliau apabila shalat bersama para sahabatnya, mengeraskan suara bacaan Al Qur’annya, dan ketika orang-orang musyrik mendengarnya, maka mereka mencaci-maki Al Qur’an, yang menurunkannya dan yang membawanya.” Maka Allah Ta’ala berfirman kepada Nabi-Nya shallallahu 'alaihi wa sallam, “Dan janganlah engkau mengeraskan suaramu” yakni bacaanmu sehingga orang-orang musyrik mendengarnya, kemudian memaki Al Qur’an. “dan jangan (pula) merendahkannya,” yakni terhadap para sahabatmu sehingga engkau tidak memperdengarkan kepada mereka, “dan usahakan jalan tengah di antara kedua itu.” Maksudnya janganlah membaca ayat Al Quran dalam shalat terlalu keras atau terlalu pean tetapi cukuplah sekedar dapat didengar oleh makmum."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 110",
    "description": "Katakanlah wahai nabi Muhammad kepada orang-orang musyrik mekah, serulah Allah atau serulah ar-rahma'n, dia yang maha pengasih. Jangan ragu engkau menyeru dengan kedua nama itu, sebab keduanya adalah nama tuhan. Dengan nama yang mana saja kamu dapat menyeru, karena dia mempunyai nama-nama yang terbaik, yakni asma'ul-a'usna', sebutlah salah satu dari nama itu atau semuanya tidaklah berarti engkau mengakui berbilangnya zat tuhan, sebab berbilangnya nama tidak berarti berbilangnya zat tuhan, dan selanjutnya katakanlah kepada mereka janganlah engkau mengeraskan suaramu dalam salat, agar orangorang musyrik mekah tidak menyakitimu dan menghina agamamu, dan janganlah pula merendahkannya sehingga tidak terdengar suaramu sama sekali, dan usahakan jalan tengah di antara kedua itu, yakni tidak mengeraskan suara dalam salat dan tidak pula merendahkan suaranya. Dan katakanlah wahai nabi Muhammad, segala puji bagi Allah yang tidak mempunyai anak, sebagaimana dikatakan orang-orang yahudi bahwa malaikat adalah anak-anak Allah, dan demikian pula dipercaya oleh orang-orang nasrani bahwa nabi isa adalah anak Allah, dan tidak pula mempunyai sekutu dalam kerajaan-Nya, sebagaimana dipercaya oleh kaum musyrik yang percaya kepada tuhan-tuhan selain Allah, dan dengan demikian, dia tidak memerlukan penolong dari kehinaan yang dilontarkan oleh siapa pun yang menghina-Nya. Hanya dia saja yang mahaagung dan oleh karena itu agungkanlah dia seagung-agungnya."
  }
]