[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan katakanlah (wahai rasul), ”segala puji bagi Allah yang memiliki sifat kesempurnaan dan puji-pujian, yang maha suci dari memiliki anak dan sekutu dalam uluhiyahNya, dan Dia tidak mempunyai pembela dari makhlukNya. Dia mahakaya lagi maha kuat, sedang mereka itu kekurangan lagi membutuhkan kepadaNya. Dan agungkanlah Dia dengan pengagungan yang sempurna dengan memujiNya dan hanya beribadah kepadaNya, tiada sekutu bagiNya serta mengkhihlaskan seluruh agama (ketaatan) hanya kepadaNYa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "111. Dan katakanlah wahai Rasul, \"Segala puji bagi Allah yang berhak mendapatkan berbagai pujian yang tidak memiliki anak, dan tidak pula memiliki sekutu, sungguh Dia tidak memiliki sekutu dalam kerajaan-Nya, tidak ditimpa kehinaan dan kerendahan, tidak memerlukan bantuan dan pertolongan,\" dan agungkanlah Dia seagung-agungnya dan jangan sekali-sekali menyandarkan padanya anak, sekutu dan penolong dalam kerajaan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "111. وَقُلِ الْحَمْدُ لِلّٰهِ الَّذِى لَمْ يَتَّخِذْ وَلَدًا(Dan katakanlah: “Segala puji bagi Allah Yang tidak mempunyai anak) Sebagaimana yang dikatakan oleh orang-orang Yahudi dan Nasrani; serta orang-orang musyrik yang mengatakan para malaikat adalah anak-anak perempuan Allah. وَلَمْ يَكُن لَّهُۥ شَرِيكٌ فِى الْمُلْكِ (dan tidak mempunyai sekutu dalam kerajaan-Nya) Sebagaimana anggapan orang yang menyembah dua tuhan dan kelompok-kelompok lain yang mempercayai tuhan yang lebih dari satu. وَلَمْ يَكُن لَّهُۥ وَلِىٌّ مِّنَ الذُّلِّ ۖ (dan Dia bukan pula hina yang memerlukan penolong) Yakni Allah tidak butuh pertolongan orang lain dari kehinaan. Dia Maha Kaya dari segala penolong. وَكَبِّرْهُ تَكْبِيرًۢا(dan agungkanlah Dia dengan pengagungan yang sebesar-besarnya) Yakni agungkanlah Dia seagung-agungnya, dan jadikanlah Dia Dzat yang paling agung dari segalanya. Imam Ahmad dan at-Thabrani mengeluarkan hadits dari Mu’adz bin Anas, ia berkata: Rasulullah bersabda: “ayat kemuliaan ialah ayat: وَقُلِ الْحَمْدُ لِلّٰهِ الَّذِى لَمْ يَتَّخِذْ وَلَدًا.....الآية"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "111. Katakanlah wahai Nabi: \"Segala syukur dan pujian yang sempurna hanya bagi Allah Yang tidak mempunyai anak dan tidak mempunyai sekutu dalam kerajaan-Nya sebagai bantahan kepada orang musyrik, penyembah berhala yang mengatakan bahwa tuhan itu banyak. Ini sebagai bantahan kepada Nasrani, Yahudi, serta orang musyrik yang menyatakan bahwa malaikat adalah anak perempuan Allah. Dia tidak pula hina sehingga memerlukan penolong, agungkanlah Dia dengan pengagungan yang sebesar-besarnya dari peranakan dan persekutuan. Ayat ini turun ketika Yahudi dan Nasrani berkata: “Allah memiliki putera.” Orang Arab berkata: “Aku memenuhi panggilan-Mu, Yang tidak memiliki sekutu kecuali sekutu yang Engkau miliki.” Adapun Shabi’ dan Majusi berkata: Kalau bukan karena sekutu Allah maka pasti hina.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Katakanlah,“Segala puji bagi Allah yang tidak mengangkat seorang anak, tidak mempunyai sekutu dalam kerajaanNya, dan tidak memerlukan penolong dari kehinaan} penolong yang membantunya karena lemah dan butuh bantuan {Agungkanlah Dia seagung-agungnya”} agungkanlah Dia seagung-agungnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "111. “Dan katakanlah, ‘Segala puji bagi Allah’ ,” yang mempunyai kesempurnaan, pujian, dan kemurahan dalam segala sisi, yang terlepas dari segala cacat dan kekurangan, “Dzat yang tidak mempunyai anak dan tidak mempunyai sekutu dalam kerajaanNya,” bahkan kerajaan semuanya adalah milik Allah Yang Maha Esa dan Perkasa. Semua mahluk yang berada di atas dan di bawah, semua milik Allah. Tidak ada bagian sedikit pun bagi siapa saja dari kerajaan itu “dan Dia tidak memerlukan penolong disebabkan kehinaan,” maksudnya tidak mengangkat salah seorang dari makhlukNYa sebagai waliNya guna mengagungkan diri dan menolonNya. Sesungguhnya Dia Mahakaya dan Mahaterpuji, tidak membutuhkan seorang pun dari makhlukNya, baik yang di bumi maupun yang di langit. Akan tetapi, Allah mengambil wali-wali sebagai kebaikan dan rahmat dariNya untuk para hambaNya, \"Allah Pelindung orang-orang yang beriman; Dia mengeluarkan mereka dari kegelapan (kekafiran) kepada cahaya (iman)\" (Al-Baqarah:257). “Dan agungkanlah Dia dengan pengagungan yang sebesar-besarnya,” maksudnya besarkan dan agungkanlah Dia dengan memberitakan sifat-sifatNya yang agung, dan dengan memujiNya, dengan Asma’ul Husna, dengan memuji perbuatan-perbuatanNya yang suci, dan mengagungkanNya dengan beribadah kepadaNya semata tanpa sekutu dan mengikhlaskan agama ini semuanya hanya untuk Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 111: Yang memiliki kesempurnaan, pujian, kemuliaan dari segala sisi, dan bersih dari semua cela dan kekurangan. Alam semesta ini seluruhnya milik Allah, tidak ada seorang pun yang ikut serta dalam kerajaan-Nya. Karena Dia Maha Kaya lagi Maha Terpuji, akan tetapi Dia mengambil wali-wali-Nya hanyalah karena ihsan-Nya kepada mereka dan rahmat-Nya. Dari mempunyai anak, sekutu, dan dari kehinaan serta dari segala yang tidak layak bagi-Nya. Atau maksudnya, agungkanlah Dia dengan memberitahukan sifat-sifat-Nya yang agung, dengan memuji-Nya, dengan nama-nama-Nya yang indah, memuliakan-Nya karena perbuatan-perbuatan-Nya yang suci, mengagungkan dan membesarkan-Nya dengan beribadah kepada-Nya saja serta mengikhlaskan ibadah kepada-Nya. Selesai tafsir surah Al Israa’ dengan pertolongan Allah dan taufiq-Nya, wal hamdulillahi Rabbil ‘aalamiin."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 111",
    "description": "Dan katakanlah wahai nabi Muhammad, segala puji bagi Allah yang tidak mempunyai anak, sebagaimana dikatakan orang-orang yahudi bahwa malaikat adalah anak-anak Allah, dan demikian pula dipercaya oleh orang-orang nasrani bahwa nabi isa adalah anak Allah, dan tidak pula mempunyai sekutu dalam kerajaan-Nya, sebagaimana dipercaya oleh kaum musyrik yang percaya kepada tuhan-tuhan selain Allah, dan dengan demikian, dia tidak memerlukan penolong dari kehinaan yang dilontarkan oleh siapa pun yang menghina-Nya. Hanya dia saja yang mahaagung dan oleh karena itu agungkanlah dia seagung-agungnya. Pada akhir surah al-isra', rasulullah diperintah agar memuji Allah dan menyucikannya dari segala kekurangan. Surah ini dimulai dengan menyampaikan kewajaran Allah menyandang pujian itu dengan mengingatkan tentang keharusan memuji dan menaati perintahnya sesuai dengan yang digariskan agama dalam kitab suci Al-Qur'an. Segala puji hanya tertuju bagi Allah yang telah menurunkan kepada hamba-Nya, yaitu nabi Muhammad al-kitab, yakni Al-Qur'an, dan dia tidak membuat padanya kebengkokan, baik redaksi maupun maknanya. Ayat demi ayatnya saling menjelaskan tidak ada pertentangan satu dengan lainnya."
  }
]