[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kami menjadikan malam dan siang sebagai dua tanda yang menunjukan keesaan kemaha kuasaaan Kami. Kemudian Kami menghapuskan tanda malam ( yaitu bulan) dan menjadikan tanda siang (yaitu matahari) bersinar terang, agar dalam sinar siang hari manusia dapat melihat bagaimana dia harus mengerjakan urusan-urusan kehidupanya, dan ia dapat berdiam diri pada malamnya untuk mengambil kesempatan berteduh dan istirahat. Dan agar manusia mengetahui (melalui pergantian malam dan siang) bilangan tahun dan perhitungan bulan dan hari–hari agar mereka menyusun berdasarkan itu apa-apa yang mereka mau dari kemaslahatan-kemaslahatan mereka. Dan segala sesuatu taleh kami jelaskan dengan penjalasan yang cukup."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Kami menciptakan malam dan siang sebagai dua tanda yang menunjukkan keesaan dan kekuasaan Allah; karena pada keduanya terdapat perbedaan dari segi lama atau singkatnya, dan suhu panas atau dinginnya, lalu kami menjadikan malam dalam kondisi gelap sebagai waktu istrahat dan tidur, dan menjadikan siang dalam kondisi terang benderang, dengannya manusia bisa melihat dan mencari mata pencaharian, harapannya agar dengan adanya pergantian siang malam ini kalian mengetahui bilangan tahun, dan perhitungan masa bulan, hari, dan jam. Sungguh segala sesuatu telah Kami terangkan sejelas-jelasnya agar semuanya bisa dibedakan, dan agar yang hak bisa jelas dibedakan dari yang batil."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "12. Dan Kami jadikan siang dan malam sebagai dua tanda yang agung yang menunjukkan keesaan Kami. Kami jadikan tanda malam dengan kegelapannya agar kalian dapat mendapatkan ketenangan pada waktu malam, dan kami jadikan tanda siang dengan cahaya yang terang benderang agar kalian dapat mencari sumber kehidupan kalian; dan agar kalian dapat mengetahui jumlah hari, bulan, dan tahun. Dan segala perkara agama dan dunia telah Kami jelaskan dengan terperinci."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "12. وَجَعَلْنَا الَّيْلَ وَالنَّهَارَ ءَايَتَيْنِ ۖ (Dan Kami jadikan malam dan siang sebagai dua tanda) Karena dalam keduanya terdapat perbedaan dalam panjang dan pendek waktunya dari hari ke hari dalam satu tahun, dan antara satu tempat dengan tempat lain, serta perbedaan dalam suhu panas dan dinginnya, dan perbedaan dalam intensitas cahayanya pada saat saling silih berganti. Sehingga siang dan malam adalah tanda yang menunjukkan wujud dan kekuasaan pencipta-Nya bagi orang yang berfikir tentang ketakjuban ini. فَمَحَوْنَآ ءَايَةَ الَّيْلِ(lalu Kami hapuskan tanda malam) Yakni menghapus ayat yang berupa malam itu sendiri. Pendapat lain mengatakan yang dimaksud dengan tanda malam adalah bulan. Yakni Kami hilangkan cahayanya, yakni Kami ciptakan bulan tidak dapat mengeluarkan cahaya. وَجَعَلْنَآ ءَايَةَ النَّهَارِ مُبْصِرَةً(dan Kami jadikan tanda siang itu terang) Yakni Allah menciptakan siang terang benderang agar benda-benda dapat terlihat. لِّتَبْتَغُوا۟ فَضْلًا مِّن رَّبِّكُمْ(agar kamu mencari kurnia dari Tuhanmu) Yakni agar kalian memanfaatkan cahaya siang untuk mencari penghidupan dan menciptakan malam agar kalian dapat beristirahat. وَلِتَعْلَمُوا۟ عَدَدَ السِّنِينَ وَالْحِسَابَ ۚ( dan supaya kamu mengetahui bilangan tahun-tahun dan perhitungan) Sebab tidak mungkin diketahui bilangan tahun dan perhitungan bulan dan hari kecuali dengan pergantian siang malam. Jika merujuk pada pendapat pertama dalam penafsiran tanda malam yang tidak disebutkan tentang bulan makan bilangan tahun yang dimaksud adalah tahun syamsiyah (Masehi). Dan jika merujuk pada pendapat kedua maka yang dimaksud adalah bilangan tahun Qamariyah (Hijriyah). وَكُلَّ شَىْءٍ فَصَّلْنٰهُ تَفْصِيلًا(Dan segala sesuatu telah Kami terangkan dengan jelas) Yakni segala urusan agama kalian yang Allah hendak menerangkannya kepada kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12. Dan Kami telah menjadikan malam dan siang sebagai dua tanda yang menunjukkan kepada kesempurnaan kekuasaan, hikmah dan keesaan (Kami). Lalu Kami menjadikan tanda-tanda langit itu tertutup kegelapan, tidak ada cahaya di dalamnya supaya dapat digunakan untuk istirahat dan berdiam diri. Dan Kami jadikan tanda-tanda siang itu terang benderang agar bisa melihat segala sesuatu di dalamnya, supaya kalian bisa bias mencari rejeki dan penghidupan dari keutamaan Allah di siang hari, dan dengan mengetahui perputaran keduanya kalian dapat mengtahui jumlah tahun, menghitung bulan, hari dan setiap sesuatu dari urusan dunia dan agama yang telah Kami jelaskan dengan sangat jelas"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "12. Allah berfirman, “Dan Kami jadikan malam dan siang sebagai dua tanda,” maksudnya keduanya merupakan bukti yang menunjukkan kesempurnaan kekuasaan Allah dan keluasan rahmatNya. Dia-lah Dzat yang tidak selayaknya peribadahan ditujukan kecuali untukNYa. “Lalu Kami hapuskan tanda malam,” maksudnya bercahaya, “agar kamu mencari karunia dari Rabbmu,” melalui mata pencaharian, proses pruduksi, perdagangan dan perjalanan kalian, “dan supaya kamu mmengetahui,” dengan beriringannya siang malam dan pergantian bulan “bilangan tahun-tahun dan perhitungan,” maka kalian (bisa merencanakan) segala kemaslahatan yang kalian kehendaki berdasarkan itu, “dan segala sesuatu telah Kami terangkan dengan jelas,” maksudnya Kami sudah menerangkan ayat-ayat (tanda-tanda kebesaran Kami) dan menguraikannya sehingga jelaslah perbedaan segala sesuatu, dan kebenaran pun menjadi terang di antara kebatilan. Sebagaimana Firman Allah, \"Tiadalah Kami alpakan sesuatupun dalam Al-Kitab\" (Al-An’Am:38)."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (ءَايَتَيۡنِۖ) `aayataiin : dua tanda akan keberadaan Allah, kekuasaan, ilmu, rahmat, dan hikmah-Nya. (فَمَحَوۡنَآ ءَايَةَ ٱلَّيۡلِ) famahaunaa `aayatal lail : Kami hilangkan cahayanya dengan kegelapan yang muncul setelah matahari terbenam. (مُبۡصِرَةٗ) mubshirah : manusia dapat melihat dengannya; karena cahaya siang hari. (عَدَدَ ٱلسِّنِينَ وَٱلۡحِسَابَۚ) ‘adadas siniin wal hisaab : jumlah tahun, akhir dan awal tahun, perhitungan siang dan malam, dan waktu-waktunya; hari, minggu, dan bulan. Makna ayat: Firman-Nya “Dan Kami jadikan malam dan siang sebagai dua tanda (kebesaran Kami)...” Dua tanda akan keberadaan, kekuasaan, ilmu, dan hikmah Kami. Firman-Nya “Kemudian Kami hapus tanda malam...” Kami hilangkan cahayanya dan Kami jadikan tanda siang terang benderang, kemudian Allah menjelaskan tujuan hal ini “agar kamu dapat mencari karunia dari Rabbmu...” mencari rezeki di siang hari, lalu dari sisi lain “dan agar kamu mengerahui bilangan tahun dan perhitungan waktu...” bilangan tahun, akhir dan awal tahun, serta waktu-waktu siang dan malam, seperti hari, minggu, dan bulan karena kebutuhan dunia dan agama kalian bergantung kepada bilangan hari tersebut. Firman-Nya ta’ala “Dan segala sesuatu telah Kami terangkan dengan jelas.” Segala sesuatu yang dibutuhkan manusia untuk meraih kesempurnaan dan kebahagian, telah Kami terangkan dengan jelas di dalam Kitab ini yang memberi petunjuk ke jalan yang paling lurus. Pelajaran dari ayat: • Malam dan siang sebagai tanda yang menunjukkan keberadaan Allah ta’ala, ilmu, kekuasaan, dan pengaturan-Nya. • Disyariatkannya ilmu hisab (perhitungan) dan mempelajarinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 12: Dan luasnya rahmat-Nya. Demikian pula terdapat tanda, bahwa tidak ada yang berhak diibadahi selain Dia. Yakni Kami hapuskan cahayanya dengan kegelapan agar kalian dapat beristirahat. Dengan bergantinya malam dan siang, serta berubahnya keadaan bulan. Lalu dari sana kamu membuat perncanaan terhadap hal yang bermaslahat bagimu. Yang dibutuhkan. Agar semuanya dapat dibedakan, dan agar yang hak menjadi jelas dari yang batil."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 12",
    "description": "Dan kami jadikan malam dan siang dan silih bergantinya keduanya itu sebagai dua tanda untuk menunjukkan kekuasaan kami, lalu kami hapuskan tanda malam, kami hapus cahayanya sehingga terjadilah kegelapan dan engkau tidak dapat melihat segala sesuatu di sekitarmu, dan kami jadikan tanda siang itu terang, yakni kami jadikan siang dapat menerangi, sehingga kamu dapat melihat segala sesuatu di sekitarmu. Demikian itu agar kamu dapat mencari kurnia dari tuhanmu dengan melakukan pekerjaan yang bermanfaat bagi kehidupanmu. Dan agar dengan kehadiran malam dan siang itu kamu mengetahui bilangan tahuntahun dan perhitungan waktu yang sangat bermanfaat bagi kehidupan manusia. Sebagai penutup, ayat ini menyatakan, dan segala sesuatu yang bermanfaat bagi kehidupanmu telah kami terangkan dengan jelas, tidak ada sesuatu yang terlewati agar menjadi pelajaran bagimu. Ayat yang lalu ditutup dengan pernyataan bahwa segala sesuatu telah kami rinci dan jelaskan. Salah satu yang dirinci dan dijelaskannya berupa amal-amal perbuatannya. Ayat ini menyatakan, dan setiap manusia itu telah kami tetapkan amal perbuatannya sebagaimana tetapnya kalung pada lehernya, tidak dapat terpisah satu dengan lainnya. Dan kami keluarkan baginya pada hari kiamat sebuah kitab yang mencatat semua amalnya di dunia yang dijumpainya kitab itu terbuka, tidak ada sesuatu yang ditutupi atau tersembunyi."
  }
]