[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan setiap manusia, Allah telah menjadikan apa yang dia perbuat yang baik maupun yang buruk selalu melekat padanya, maka dia tidak akan dihisab kerena perbuatan orang lain juga tidak akan dihisab orang lain kerena amal dia. Dan pada Hari Kiamat Allah akan mengeluarkan baginya satu buku yang berisi catatan segala perbuatanya yang akan ia lihat terbuka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "13. Dan setiap manusia telah Kami jadikan amal perbuatan yang ia kerjakan senantiasa melekat pada dirinya laksana melekatnya kalung pada leher, ia tidak akan terpisah darinya hingga amal perbuatannya tersebut dihisab, dan pada hari Kiamat kelak Kami keluarkan baginya satu kitab yang tercatat di dalamnya semua amal perbuatannya yang baik dan buruk, lalu ia akan menyaksikan kitab ini terbuka dan terbentang dihadapannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "13-14. Setiap manusia tertawan dengan amalannya; dia akan mendapat balasan atas amalan tersebut, dan pada hari kiamat Kami akan mengeluarkan baginya sebuah kitab yang telah terbuka yang berisi segala kebaikan dan keburukan yang telah dia perbuat. Ketika itu akan dikatakan kepadanya: “Bacalah kitab catatan amalanmu, cukuplah hari ini sebagai saksi atas apa yang telah kamu perbuat itu”."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "13. وَكُلَّ إِنسٰنٍ أَلْزَمْنٰهُ طٰٓئِرَهُۥ (Dan tiap-tiap manusia itu telah Kami tetapkan amal perbuatannya (sebagaimana tetapnya kalung) pada lehernya) Menurut kepercayaan orang-orang arab (الطائر)/burung adalah tanda dari nasib seseorang, atau sering juga mereka sebut dengan (البخت). Dahulu mereka menggantungkan nasib seseorang dengan burung yang terbang melewati mereka, mereka mengaku bahwa mereka dapat mengetahui kebaikan atau keburukan dari burung tersebut. Maka dalam ayat ini Allah menjelaskan bahwa nasib seseorang tergantung dari kebaikan atau keburukan hati dan perbuatannya, dan burung sama sekali tidak mengatahui hal tersebut. وَنُخْرِجُ لَهُۥ يَوْمَ الْقِيٰمَةِ كِتٰبًا يَلْقَىٰهُ مَنشُورًا (Dan Kami keluarkan baginya pada hari kiamat sebuah kitab yang dijumpainya terbuka) Dalam kitab tersebut tercantum amalan-amalan kebaikan dan keburukannya sebagai kabar gembira tentang kebaikannya yang disegerakan atau sebaliknya sebagai hinaan atas keburukannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13. Dan Kami telah menetapkan kepada setiap manusia itu amal perbuatannya berupa amal baik atau buruk dengan mengikatkan tali ketentuan itu di lehernya, amal perbuatan yang ditetapkan kepadanya. Lalu Kami keluarkan baginya itu catatan amalnya pada hari kiamat, yang terbuka di hadapannya tanpa digulung. Catatan yang mengandung amal baik dan buruk"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Setiap manusia telah Kami kalungkan (catatan) amal perbuatannya di lehernya} amalnya yang diperbuat, seperti mengikat kalung di leher {Kami mengeluarkan} mengeluarkan {baginya pada hari kiamat sebuah kitab yang dia terima dalam keadaan terbuka} yang dia dapati dalam keadaan terbuka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "13-14. Ini merupakan pemberitahuan tentang kesempurnaan keadilan Allah; bahwasanya Dia menetapkan amal perbuatan pada setiap orang (sebagaimana kalung yang menempel) pada lehernya. Maksudnya, setiap amal perbuatan yang dikerjakan, baik ataupun buruk, niscaya Allah menetapkan (ganjarannya) pada pelakunya, tidak akan berpindah kepada orang lain. (Begitu pula) orang lain pun tidak dimintai pertanggung jawaban berdasarkan amalan orang tadi. “Kami keluarkan baginya pada Hari KIamat sebuah Kitab yang dijumpainya terbuka.” Di dalamnya terdapat segala sesuatu yang pernah dia kerjakan berupa kebaikan dan keburukan, baik yang besar maupun kecil. Kemudian dikatakan kepadanya, “Bacalah kitabmu. Cukuplah dirimu sendiri pada waktu ini sebagai penghisab terhadapmu.” Inilah bentuk keadilan dan keobyektifan terbesar, manakala dikatakan kepada seorang hamba, “Hisablah dirimu sendiri.” Supaya dia mengetahui fakta dosa yang ada pada dirinya yang mendatangkan azab."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (طَٰٓئِرَهُۥ) thaa`irah : amalan dan takdirnya; kebahagiaan atau kesengsaraan. (فِي عُنُقِهِۦۖ) fii ‘unuqih : terus bersamanya tidak akan berpisah hingga akhir. Makna ayat: Allah ta’ala menjelaskan bahwa Dia—karena keagungan kekuasaan-Nya, keluasan ilmu dan hikmah-Nya dalam pengaturan—menetapkan segala konsekuensi dari setiap amal yang dilakukan oleh seorang insan berupa kebahagiaan atau kesengsaraan di dunia dan akhirat. Sebuah keharusan yang tidak mungkin dihindari atau tertunda seakan-akan balasan itu terikat di lehernya, inilah makna dari firman-Nya ta’ala “Dan seluruh manusia telah Kami kalungkan catatan amal perbuatanya di lehernya…” Firman-Nya ta’ala “Dan pada hari kiamat Kami keluarkan baginya sebuah kitab dalam keadaan terbuka.” Pada hari kiamat Allah ta’ala akan mengeluarkan bagi setiap insan kitab amalannya, maka ia akan mendapatinya “terbuka” di hadapannya. Pelajaran dari ayat: • Penegasan aqidah qadha` dan qadar. • Penegasan aqidah kebangkitan dan pembalasan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 13: Mujahid berkata, “Tidak ada anak yang lahir, kecuali di lehernya ada selembar catatan, tertulis di sana (apakah) ia orang yang bahagia atau celaka?” Syaikh As Sa’diy berkata, “Apa yang dikerjakannya baik atau buruk, Allah jadikan melekat pada dirinya tidak berpindah kepada yang lain. Oleh karena itu, ia tidaklah dihisab dengan amal orang lain, dan orang lain tidaklah dihisab dengan amalnya.” Yang di sana tercatat amal-amalnya; baik dan buruk, kecil dan besar."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 13",
    "description": "Ayat yang lalu ditutup dengan pernyataan bahwa segala sesuatu telah kami rinci dan jelaskan. Salah satu yang dirinci dan dijelaskannya berupa amal-amal perbuatannya. Ayat ini menyatakan, dan setiap manusia itu telah kami tetapkan amal perbuatannya sebagaimana tetapnya kalung pada lehernya, tidak dapat terpisah satu dengan lainnya. Dan kami keluarkan baginya pada hari kiamat sebuah kitab yang mencatat semua amalnya di dunia yang dijumpainya kitab itu terbuka, tidak ada sesuatu yang ditutupi atau tersembunyi. Pada saat itu akan dinyatakan kepadanya, bacalah kitabmu yang terbuka di hadapanmu dan cukuplah dirimu sendiri pada hari ini sebagai penghitung atas dirimu yang menghitung dan menilai perbuatanmu di dunia. Kamu tidak dapat mengingkari perbuatanmu karena semuanya telah ditampakkan dengan nyata di dalam kitabmu."
  }
]