[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Akan dikatakan kepadanya, “Bacalah buku perbuatan-perbuatanmu.” Maka ia akan membacanya, walaupun dia tidak tahu baca tulis di dunia. Hari ini cukuplah dirimu sendiri menjadi pihak yang akan memperhitungkan amal perbuatanmu di atasmu, sehingga engkau akan tahu balasan yang akan di terima dirimu. Ini termasuk bentuk keadilan dan ketetapan obyektip yang paling agung dengan di katakan kepada seorang hamba, “Hitunglah perbuatan sendiri, cukuplah itu menjadi penghisab terhadapmu.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Pada hari itu Kami akan katakan padanya, \"Wahai manusia! Bacalah kitab catatan amalmu, dan silahkan menghisab sendiri amal perbuatanmu, sebab pada hari Kiamat ini cukuplah dirimu sebagai penghitung atas amalanmu sendiri\"."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "14. اقْرَأْ كِتٰبَكَ (Bacalah kitabmu) Terdapat pendapat mengatakan bahwa setiap orang akan dapat membacanya baik itu bagi orang yang dapat membaca ketika di dunia maupun tidak. كَفَىٰ بِنَفْسِكَ الْيَوْمَ عَلَيْكَ حَسِيبًا(cukuplah dirimu sendiri pada waktu ini sebagai penghisab terhadapmu) Kata (الحسيب) bermakna (المحاسب) yakni setiap manusia dapat melihat kitab tersebut untuk mengetahui hasil dan mampu memperhitungkannya, dan mereka tidak butuh orang lain untuk membantunya melakukan hal itu."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Setelah peristiwa kematian menghampiri setiap manusia, akan ada masa perhitungan yang ketat dari setiap amalan yang telah kita kerjakan ketika di dunia, ketahuilah bahwa semuanya telah disiapkan dalam kitab amalan setiap orang tanpa menyisakan sedikitpun baik yang kecil maupun besar, namun manusia melupakan apa yang telah mereka perbuat. kitab ini akan mengejutkan setiap hamba pada hari kiamat, lalu diletakan dihadapannya dan dkatakan kepadanya : { اقْرَأْ كِتَابَكَ كَفَىٰ بِنَفْسِكَ الْيَوْمَ عَلَيْكَ حَسِيبًا } \"Bacalah kitabmu, cukuplah dirimu sendiri pada waktu ini sebagai penghisab terhadapmu\". 2 ). Hidup seseorang setelah kematianya bagaikan sebuah buku yang akan dibaca oleh orang banyak maka perbaikilah tulisanmu yang ada di dalamnya, jangan pernah menyangka bahwa sampul buku itu akan memberi manfaat tetapi isinya hanya berisi keburukan; karena besok akan dikatakan kepadamu : { اقْرَأْ كِتَابَكَ كَفَىٰ بِنَفْسِكَ الْيَوْمَ عَلَيْكَ حَسِيبًا } \"Bacalah kitabmu, cukuplah dirimu sendiri pada waktu ini sebagai penghisab terhadapmu\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14. Dan kalaupun buta, maka tetap akan dikatakan kepadanya: “bacalah kitabmu (catatan amalmu) yang di dalamnya terkandung seluruh amalmu yang telah terekam. Pada hari ini, hanya cukup dirimulah yang dihisab dan menjadi saksi atas amal perbuatanmu”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{“Bacalah kitabmu. cukuplah dirimu pada hari ini sebagai penghitung atas dirimu”} sebagai penghitung"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "13-14. Ini merupakan pemberitahuan tentang kesempurnaan keadilan Allah; bahwasanya Dia menetapkan amal perbuatan pada setiap orang (sebagaimana kalung yang menempel) pada lehernya. Maksudnya, setiap amal perbuatan yang dikerjakan, baik ataupun buruk, niscaya Allah menetapkan (ganjarannya) pada pelakunya, tidak akan berpindah kepada orang lain. (Begitu pula) orang lain pun tidak dimintai pertanggung jawaban berdasarkan amalan orang tadi. “Kami keluarkan baginya pada Hari KIamat sebuah Kitab yang dijumpainya terbuka.” Di dalamnya terdapat segala sesuatu yang pernah dia kerjakan berupa kebaikan dan keburukan, baik yang besar maupun kecil. Kemudian dikatakan kepadanya, “Bacalah kitabmu. Cukuplah dirimu sendiri pada waktu ini sebagai penghisab terhadapmu.” Inilah bentuk keadilan dan keobyektifan terbesar, manakala dikatakan kepada seorang hamba, “Hisablah dirimu sendiri.” Supaya dia mengetahui fakta dosa yang ada pada dirinya yang mendatangkan azab."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (عَلَيۡكَ حَسِيبٗا) ‘alaika hasiibaa : cukuplah dirimu sebagai penghitung atas dirimu. Makna ayat: Kemudian dikatakan kepadanya “Bacalah kitabmu yang telah menghitung seluruh amalanmu, tidak terluput darinya baik kecil maupun besar.” Firman-Nya ta’ala “Cukuplah dirimu sendiri pada hari ini sebagai penghitung atas dirimu.” Cukuplah dirimu yang menghitung amalanmu wahai manusia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 14: Hal ini termasuk keadilan yang paling besar."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 14",
    "description": "Pada saat itu akan dinyatakan kepadanya, bacalah kitabmu yang terbuka di hadapanmu dan cukuplah dirimu sendiri pada hari ini sebagai penghitung atas dirimu yang menghitung dan menilai perbuatanmu di dunia. Kamu tidak dapat mengingkari perbuatanmu karena semuanya telah ditampakkan dengan nyata di dalam kitabmu. Barang siapa mendapat hidayah sehingga ia berbuat sesuai dengan petunjuk Allah, maka sesungguhnya dia berbuat itu untuk keselamatan dan kebahagiaan dirinya sendiri; dan barang siapa yang sesat tidak mendapat petunjuk Allah maka sesungguhnya ia tersesat dari jalan yang benar dan yang demikian itu mendatangkan kerugian bagi dirinya sendiri. Dan seorang yang berdosa tidak dapat memikul dosa orang lain, yakni setiap orang memikul dosanya sendiri yang harus dipertanggungjawabkan di hadapan Allah. Perbuatan yang baik mendapat ganjaran dan perbuatan yang buruk mendapat siksaan yang pedih. Dan kami tidak akan berbuat aniaya dengan menyiksa manusia sebelum kami mengutus seorang rasul yang menunjukkan kepada mereka jalan yang benar dan mencegah dari kesesatan."
  }
]