[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Barangsiapa berada di atas petunjuk dan mengikuti jalan kebenaran, maka sesungguhnya pahala perbuatan itu hanya kembali kepadanya. Dan barangsiapa melenceng dan mengikuti jalan kebatilan, maka sesungguhnya siksaan akibat perbuatan itu hanya kembali kepadanya saja.Tidak ada jiwa yang berbuat dosa yang menanggung dosa jiwa lain yang berbuat dosa, Dan Allah tidaklah menyiksa seseorang kecuali telah tegak baginya hujjah-hujjah dengan diutusnya para rasul dan diturunkannya kitab-kitab."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Barangsiapa yang mengikuti hidayah dan petunjuk keimanan, niscaya ganjaran pahalanya akan kembali pada dirinya, sebaliknya barangsiapa yang tersesat maka balasan kesesatannya juga akan kembali pada dirinya sendiri, sebab seseorang tidak akan menanggung beban dosa orang lain, dan Kami tidak akan menyiksa suatu kaum hingga ditegakkan hujah atas mereka dengan mengirimkan pada mereka para Rasul."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "15. Barangsiapa yang mengikuti kebenaran maka pahalanya kembali padanya, dan barangsiapa yang berpaling dari kebenaran maka siksaannya juga kembali padanya, tidak ada seorang pun yang memikul dosa orang lain, dan Kami tidak akan mengazab seseorang hingga Kami mengutus kepadanya para rasul yang menyampaikan hujjah dan dalil-dalil yang jelas."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15. وَلَا تَزِرُ وَازِرَةٌ وِزْرَ أُخْرَىٰ ۗ (Dan seorang yang berdosa tidak dapat memikul dosa orang lain) Setiap manusia memikul dosanya sendiri-sendiri, tidak ada orang lain yang akan memikul dosa itu untuknya. وَمَا كُنَّا مُعَذِّبِينَ حَتَّىٰ نَبْعَثَ رَسُولًا(dan Kami tidak akan mengazab sebelum Kami mengutus seorang rasul) Ini merupakan bagian dari keadilan Allah. Dan dikatakan bahwa orang yang meninggal sebagai ahli fatrah (orang yang hidup pada zaman tidak adanya seorang utusan dari Allah) atau meninggal pada saat masih bayi maka mereka akan diuji pada hari kiamat; sehingga Allah tidak mengazab hamba-Nya kecuali setelah ditegakkannya hujjah atas mereka dengan diutusnya para Rasul dan diturunkannya kitab-kitab-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "15. Dan barangsiapa yang mendapat petunjuk menuju kebenaran dan keimanan, maka pahala atas petunjuk itu adalah baginya. Dan barangsiapa menyimpang dari jalan kebenaran dan Islam, maka dosanya itu atas dirinya sendiri. Seseorang tidak akan memikul dosa orang lain, melainkan hanya menanggung dosanya sendiri. Sesuai ketentuan keadilan Allah, Kami tidak akan mengazab seorang atas ketidaktahuan dan penyembahan sampai Kami mengutur seorang rasul kepada kaumnya yang menjelaskan kepada mereka apa yang harus dikerjakan dan yang menjadi hak-hak mereka. Ayat ini diturunkan terkait pemberian petunjuk bagi Abdul Salamah bin Abdul Aswad dan kesesatan Walid bi Mughirah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Siapa saja yang mendapat petunjuk, sesungguhnya dia mendapat petunjuk itu untuk dirinya. Siapa saja yang tersesat, sesungguhnya kesesatannya itu menimpa dirinya. Seorang yang berdosa tidak akan memikul} seorang yang berdosa tidak memikul {dosa orang lain} dosa orang lain {Kami tidak akan menyiksa sehingga Kami mengutus seorang rasul"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "15. Maksudnya, hidayah dan kesesatan itu (dampaknya) akan kembali pada dirinya sendiri. Seseorang tidak akan menanggung dosa oranglain. Dia pun tidak dapat menampik kesalahan yang dia kerjakan sekecil biji sawi pun. Allah adalah Dzat yang paling adil, tidak akan mengazab seseorang sehingga hujjah tegak atasnya melalui risalah, kemudian orang itu (merespon dengan) menentangnya. Adapun orang yang tunduk dengan hujjah atau belum sampai hujjah Allah kepadanya, maka Allah tidak akan mengazabnya. Ayat ini dijadikan dalil bahwasanya Allah tidak akan mengazab ahlul fathrah (orang-orang yang hidup di masa transisi kenabian, pent) dan anak-anak kaum musyrikin (yang meninggal sebelum dewasa), sampai Dia mengutus seorang rasul kepada mereka. Karena sesungguhnya Allah itu suci dari segala bentuk tindak aniaya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (وَلَا تَزِرُ وَازِرَةٞ وِزۡرَ أُخۡرَىٰۗ) walaa taziru waaziratuw wizra ukhraa : seseorang tidak dapat memikul dosa orang lain. Makna ayat: Firman-Nya ta’ala “Barang siapa berbuat sesuai dengan petunjuk Allah, maka sesuungguhnya itu untuk keselamatan dirinya sendiri...” setelah penjelasan ini—maka seharusnya manusia mengetahui—barang siapa yang mendapatkan hidayah pada hari ini, beriman kepada Allah dan rasul-Nya, pertemuan dengan Allah, janji dan ancaman-Nya, dan beramal saleh serta menjauh dari syirik dan maksiat, perbuatan itu semua akan kembali kepada dirinya sendiri, ia akan selamat dari azab dan berbahagia di negeri kebahagiaan (surga). Dan yang tersesat dari jalan petunjuk, mendustakan dan tidak beriman, berbuat syirik dan tidak mengesakan Allah, bermaksiat dan enggan taat, maka kesesatan itu akan kembali kepadanya nanti, ia akan sengsata dan disiksa di neraka Jahanam negeri siksaan dan kesengsaraan. Firman-Nya ta’ala “Dan seseorang yang berdosa tidak dapat memikul dosa orang lain...” Al-wizr adalah dosa dan al-waazirah adalah yang memikul dosa tersebut dan dihukum karenanya. Makna dari perkataan ini adalah seseorang tidak akan memikul dosa orang lain pada hari kiamat kelak, bahkan setiap jiwa akan bertanggung jawab atas dirinya sendiri. Dan penegasannya ada pada firman-Nya “Barang siapa berbuat sesuai dengan petunjuk Allah, maka sesungguhnya itu untuk keselamatan dirinya sendiri, dan barang siapa tersesat maka sesungguhnya (kerugian) itu bagi dirinya sendiri...” firman-Nya ta’ala “Tetapi Kami tidak akan menyiksa sebelum Kami mengutus seorang rasul.” Allah ta’ala—karena Dia adalah Maha Adil dan Maha Penyayang—tidak akan menghancurkan suatu kaum dengan azab sebelum mengutus kepada mereka seorang rasul yang mengenalkan mereka kepada Rabb mereka, apa yang Dia cintai dan benci, memerintahkan melakukan apa yang Allah cintai dan meninggalkan hal yang Dia benci yaitu syirik dan maksiat. Pelajaran dari ayat: • Penegasan keadilan ilahi pada hari kiamat, tidak ada satu pun yang terzalimi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 15: Yang menerangkan kepadanya kewajibannya. Allah Subhaanahu wa Ta'aala Maha Adil, Dia tidaklah mengazab sampai hujjah tegak. Adapun orang yang tunduk mengikuti hujjah itu atau yang tidak sampai kepadanya hujjah-Nya, maka Allah Subhaanahu wa Ta'aala tidak akan mengazabnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 15",
    "description": "Barang siapa mendapat hidayah sehingga ia berbuat sesuai dengan petunjuk Allah, maka sesungguhnya dia berbuat itu untuk keselamatan dan kebahagiaan dirinya sendiri; dan barang siapa yang sesat tidak mendapat petunjuk Allah maka sesungguhnya ia tersesat dari jalan yang benar dan yang demikian itu mendatangkan kerugian bagi dirinya sendiri. Dan seorang yang berdosa tidak dapat memikul dosa orang lain, yakni setiap orang memikul dosanya sendiri yang harus dipertanggungjawabkan di hadapan Allah. Perbuatan yang baik mendapat ganjaran dan perbuatan yang buruk mendapat siksaan yang pedih. Dan kami tidak akan berbuat aniaya dengan menyiksa manusia sebelum kami mengutus seorang rasul yang menunjukkan kepada mereka jalan yang benar dan mencegah dari kesesatan. Dan jika kami hendak membinasakan suatu negeri, yang durhaka sesuai ketetapan kami, maka kami perintahkan kepada orang-orang yang hidup mewah di negeri itu agar menaati Allah, tetapi mereka tidak mau menaati-Nya, bahkan mereka melakukan kedurhakaan dalam negeri itu dengan melakukan penganiayaan dan pengrusakan, maka sudah sepantasnya berlaku terhadapnya perkataan, yakni ketentuan kami, kemudian kami hancurkan negeri itu sehancur-hancurnya, sehingga mereka tidak dapat bangkit lagi."
  }
]