[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan jika kami berkehendak membinasakan satu penduduk negeri dikarenakan perbuatan zhalim mereka, maka kami memerintahkan kepada orang-orang yang hidup mewah diantara mereka untuk taat kepada Allah dan mentauhidkanNya serta membenarkan para rasulNya, sedang yang lain hanya mengikuti mereka saja. Lalu mereka mendurhakai perintah tuhan mereka dan mendustakan para rasulNya, sehingga sudah pantaslah berlaku pada mereka ketetapan turunnya siksaan yang tidak bisa di tolak. Maka Kami pun membinasakan mereka sampai habis ke akar-akarnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Dan jika Kami hendak membinasakan suatu negeri lantaran kezaliman penduduknya, maka Kami perintahkan kepada orang-orang yang hidup mewah dan bergelimang harta di negeri itu agar mentaati Allah, tetapi mereka tidak mengindahkannya, bahkan mereka melakukan kedurhakaan dan pembangkangan, maka mereka pantas mendapatkan hukuman berupa azab yang menyeluruh, sehingga Kami pun membinasakan mereka dengan azab tersebut."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "16-17. Allah memperingatkan manusia agar tidak keluar dari ketaatan-Nya: “Jika Kami hendak membinasakan suatu kaum maka Kami akan memerintahkan orang-orang yang hidup mewah di negeri itu untuk melakukan ketaatan, namun mereka enggan menjalankan ketaatan tersebut sehingga mereka berhak mendapat siksaan; maka Kami binasakan mereka semua tanpa terkecuali. Dan Kami telah membinasakan banyak umat-umat yang kafir setelah zaman Nabi Nuh. Hai Rasulallah, cukuplah bagimu Allah Yang Maha Mengetahui segala perbuatan hamba-hamba-Nya, tidak ada yang tersembunyi sedikit pun dari-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "16. وَإِذَآ أَرَدْنَآ أَن نُّهْلِكَ قَرْيَةً أَمَرْنَا مُتْرَفِيهَا (Dan jika Kami hendak membinasakan suatu negeri, maka Kami perintahkan kepada orang-orang yang hidup mewah di negeri itu) Yakni Kami akan perintahkan mereka untuk melakukan ketaatan dan kebaikan namun mereka bermaksiat dan melakukan keburukan. Terdapat pendapat mengatakan bahwa yang dimaksud dengan (أمرنا مترفيها) yakni Kami akan memperbanyak orang-orang yang berbuat kefasikan di negeri tersebut. Makna (مترفيها) yakni orang-orang yang mendapat kenikmatan yang terlena oleh kenikmatan mereka, mereka adalah orang-orang yang bentindak sewenang-wenang dan semena-mena, mereka adalah para penguasa yang zalim dan orang-orang kaya yang fajir."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16. Dan jika Kami hendak membinasakan penduduk suatu negeri karena saking beratnya kejahatan mereka, maka Kami akan perintahkan kepada orang-orang yang diberi kenikmatan di dalamnya, yaitu para pemimpin, para pemilik kewenangan dan orang-orang yang memiliki kemuliaan untuk berbuat ketaatan dan kebaikan. Namun mereka menyimpang dari perintah Kami, sehingga azab itu pasti menimpa mereka, lalu Kami binasakan mereka dan Kami robohkan rumah-rumah mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika Kami hendak membinasakan suatu negeri, Kami perintahkan orang-orang yang hidup mewah di negeri itu} orang-orang yang hidup mewah dan para pemimpin negeri itu {Lalu mereka melakukan hal fasik di negeri itu sehingga pantaslah berlaku pada negeri itu perkataan (azab Kami)} maka negeri itu pasti ditimpa azab {Maka Kami menghancurkannya sehancur-hancurnya} meruntuhkannya seruntuh-runtuhnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "16. Allah memberitahukan bahwasanya apabila Dia ingin menghancurkan salah satu negeri yang berbuat sewenang-wenang dan meluluhlantahkannya dengan azab sampai tak tersisa, maka Dia akan memberikan perintah kepada orang-orang kalangan mewah mereka dalam bentuk ketetapan takdir (untuk menaati Allah). Lalu mereka berbuat kefasikan sampai tindakan melampaui batas mereka sudah parah “maka sudah sepantasnya berlaku terhadapnya perkataan (ketentuan Kami),” yaitu ketentuuan azab (Kami), yang mana tidak ada (seorang pun) yang sanggup menolaknya “kemudian Kami hancurkan negeri itu sehancur-hancurnya.”"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (مُتۡرَفِيهَا) mutrafiihaa : orang-orang yang memiliki kenikmatan, seperti orang kaya dan para pembesar. (فَحَقَّ عَلَيۡهَا ٱلۡقَوۡلُ) fahaqqa ‘alaihal qaul : yaitu azab. Makna ayat: Firman-Nya ta’ala “Dan jika Kami hendak menghancurkan suatu negeri...” yaitu penduduknya “maka Kami perintahkan kepada orang yang hidup mewah di negeri itu...” Kami perintahkan kepada orang kaya dan para pembesar mereka untuk mentaati Kami dengan menegakkan syariat dan menunaikan kewajiban dan sunnah-sunnah, meninggalkan dosa-dosa besar dan berbuatan keji, namun mereka tidak melakukan perintah atau meninggalkan larangan, itulah makna dari “namun mereka berbuat kedurhakaan, maka sepantasnya berlakulah perkataan Kami...” telah tetap bagi mereka azab “kemudian Kami binasakan sama sekali negeri itu.” Kami musnahkan mereka secara sempurna, inilah penjelas dari firman-Nya ta’ala “Tetapi Kami tidak akan menyiksa sebelum Kami mengutus seorang rasul.” Karena seorang rasul memerintah dan melarang—atas izin Allah ta’ala—, jika mereka tidak menaatinya maka mereka akan tertimpa azab. Pelajaran dari ayat: • Penjelasan ketetapan Allah ta’ala akan kehancuran kaum-kaum, mereka tidak dihancurkan kecuali telah datang peringatan dan penangguhan untuk mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 16: Yaitu para pemimpinnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 16",
    "description": "Dan jika kami hendak membinasakan suatu negeri, yang durhaka sesuai ketetapan kami, maka kami perintahkan kepada orang-orang yang hidup mewah di negeri itu agar menaati Allah, tetapi mereka tidak mau menaati-Nya, bahkan mereka melakukan kedurhakaan dalam negeri itu dengan melakukan penganiayaan dan pengrusakan, maka sudah sepantasnya berlaku terhadapnya perkataan, yakni ketentuan kami, kemudian kami hancurkan negeri itu sehancur-hancurnya, sehingga mereka tidak dapat bangkit lagi. Dan sesuai dengan ketetapan itu dinyatakan, berapa banyaknya kaum setelah kebinasaan kaum nuh, telah kami binasakan disebabkan oleh kedurhakaan mereka. Dan cukuplah tuhanmu yang maha mengetahui, maha melihat dosa hamba-hamba-Nya. Tidak ada yang tersembunyi dan terluput dari pembalasan-Nya."
  }
]