[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kami telah banyak membinasakan banyak umat manusia yang mendustakan lagi mengingkari rasul mereka sesudah Nuh. Dan cukuplah tuhanmu (wahai rasul) bahwa Dia mahamengetahui semua perbuatan para hambaNya, tidak ada sesuatu yang samar bagiNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Sungguh betapa banyak umat yang mendustakan Kami setelah masa Nuh yang Kami binasakan, seperti kaum 'Ād dan Ṡamūd. Dan cukuplah Tuhanmu -wahai Rasul- Yang Maha Mengetahui dan Melihat dosa hamba-hamba-Nya, sama sekali tidak ada yang tersembunyi dari-Nya, dan Dia pasti memberikan mereka balasan atas dosa-dosa tersebut."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "17. وَكَمْ أَهْلَكْنَا مِنَ الْقُرُونِ (Dan berapa banyaknya kaum telah Kami binasakan) Yakni umat-umat. مِنۢ بَعْدِ نُوحٍ ۗ (sesudah kaum Nuh) Seperti kaum ‘Aad dan Tsamud. خَبِيرًۢا بَصِيرًا (Maha Mengetahui lagi Maha Melihat) Tidak ada yang tersembunyi bagi-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17. Dan kebanyakan umat-umat kafir terdahulu seperti kaum ‘Aad dan kaum Tsamud yang hidup setelah Nuh itu Kami binasakan karena kekufuran mereka dan pendustaan mereka terhadap para rasul. Dan cukuplah Wahai Nabi bahwa Allah itu Maha Mengetahui dosa hamba-hambaNya, Maha Mengamatinya dan Maha mengetahuinya sehingga tidak ada satupun yang luput dariNya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Berapa banyak telah Kami binasakan} Kami telah membinasakan banyak {generasi} umat yang berdusta {setelah Nuh. Cukuplah Tuhanmu sebagai Yang Maha teliti lagi Maha Melihat dosa-dosa hambaNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17. Mereka itu umat manusia yang banyak, setelah kaum Nabi Nuh yang mana Allah memusnahkannya dengan azab, seperti kaum ‘Ad, Tsamud, kaum Nabi Luth, dan kaum lainnya yang telah Allah siksa ketika tindakan melampaui batas mereka sudah merajalela dan kekufuran mereka semakin menjadi-jadi. Akibatnya, Allah menurunkan hukuman yang dahsyat kepada mereka, “dan cukuplah Rabbmu Maha Mengetahui lagi Maha Melihat dosa hamba-hambaNya.” Janganlah mereka merasa takut munculnya tindakan kezhaliman dari Allah, karena sesungguhnya Allah hanya mengazab atas dasar perbuatan yang mereka lakukan saja."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (وَكَمۡ أَهۡلَكۡنَا) wa kam ahlaknaa : Kami telah banyak membinasakan. (مِنَ ٱلۡقُرُونِ) minal quruun : orang yang hidup pada sebelumnya. (خَبِيرَۢا بَصِيرٗا) khabiiram bashiiraa : Maha Mengetahui dan Melihat dosa-dosa para hamba. Makna ayat: Firman-Nya ta’ala “Dan berapa banyak kaum setelah Nuh yang telah Kami binasakan...” ini adalah penekanan dari hukuman yang telah disebutkan. Allah ta’ala mengajarkan kepada kita bahwa apa yang telah Dia kabarkan benar-benar terjadi dan banyak kaum setelah kaum Nuh telah binasa; ‘Ad, Tsamud, kaum Luth, penduduk Aikah, dan kaum Fir’aun. Firman-Nya ta’ala “dan cukuplah Rabbmu Yang Maha Mengetahui, Maha Melihat dosa hamba-hamba-Nya.” Ayat ini mengandung penjelasan akan pengetahuan Allah ta’ala terhadap dosa para hamba-Nya, dan ancaman dan teguran yang keras, karena Allah ta’ala tidak ridha dengan kejahatan dan dosa yang dilakukan terus menerus. Allah ta’ala memberikan penangguhan, semoga kaum itu sadar, semoga orang-orang yang berbuat fasik berhenti, namun jika mereka terus melakukannya setelah pemberitahuan dan ancaman atas dosa-dosa dan kezaliman mereka, Allah akan menghukum mereka dengan azab dari Yang Maha Perkasa, Maha Kuasa. Maka berhati-hatilah wahai orang yang terus menerus melakukan kesyirikan dan maksiat!! Pelajaran dari ayat: • Peringatan dari terlalu banyak bernikmat-nikmat dan bermewah-mewah, karena itu dapat menyebabkan kefasikan dan meninggalkan ketaatan, kemudian kefasikan itu akan membawa kehancuran dan kebinasaan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 17: Seperti kaum ‘Aad, Tsamud, kaum Luth, dan lain-lain. Allah mengazab mereka ketika mereka banyak melakukan kemaksiatan dan kekafiran mereka semakin besar. Oleh karena itu, janganlah mereka takut dizalimi-Nya, karena Dia memberikan hukuman sesuai amal mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 17",
    "description": "Dan sesuai dengan ketetapan itu dinyatakan, berapa banyaknya kaum setelah kebinasaan kaum nuh, telah kami binasakan disebabkan oleh kedurhakaan mereka. Dan cukuplah tuhanmu yang maha mengetahui, maha melihat dosa hamba-hamba-Nya. Tidak ada yang tersembunyi dan terluput dari pembalasan-Nya. Allah memberikan pembalasan berupa ganjaran atau siksaan kepada manusia sesuai amal perbuatannya. Ayat ini menyatakan, barang siapa yang hanya menghendaki kehidupan sekarang, yaitu kehidupan duniawi dan ia tidak beriman kepada kehidupan akhirat, maka kami segerakan baginya di dunia ini apa yang kami kehendaki dari apa yang diharapkannya, seperti kedudukan sosial yang tinggi atau harta yang banyak, bagi orang yang kami kehendaki, yaitu mereka yang berusaha meraihnya dengan memenuhi syarat dan ketentuan, bukan untuk semua orang yang menghendakinya. Kemudian kami sediakan baginya di akhirat neraka jahanam; ia akan memasukinya dalam keadaan tercela dan terusir dari rahmat Allah."
  }
]