[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Barang siapa yang hanya mencari dunia yang cepat sirna ini, dan berusaha dengan kuat untuk itu saja, sedang ia tidak mengimani alam akhirat dan tidak beramal untuknya, maka Allah akan menyegerakan baginya di dunia ini apa yang dikehendaki dan diinginkanNYa, dari hal-hal yang telah Dia tulis baginya di lauhil mahfuzh. Kemudian Allah menjadikan neraka jahanam baginya di akhirat kelak. Ia memasukinya dalam keadaan tercela lagi terusir dari rahmat Allah . itu disebabkan keinginannya untuk meraih dunia dan usaha kuatnya untuk itu, bukan untuk akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Barangsiapa yang mengerjakan amal kebajikan hanya demi menghendaki kehidupan dunia, sedang ia tidak beriman kepada hari Akhirat, dan tidak juga mempedulikannya, maka Kami segerakan balasan baginya (di dunia ini) berupa kenikmatan dan karunia yang Kami kehendaki, bukan apa yang ia kehendaki. Kemudian pada hari Kiamat kelak Kami sediakan baginya Neraka Jahanam, dia akan memasukinya dengan merasakan kepanasan azabnya dalam keadaan terhina lantaran hanya menghendaki kehidupan dunia dan kafir terhadap hari Akhirat, serta terjauhkan dari rahmat Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "18. Barangsiapa yang meniatkan amalannya demi mendapat dunia saja, maka Kami akan menyegerakan kenikmatan baginya jika Kami menghendaki, kemudian Kami siapkan baginya neraka jahanam di akhirat, dia akan memasukinya dalam keadaan terhina dan dijauhkan dari rahmat Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "18. مَّن كَانَ يُرِيدُ الْعَاجِلَةَ (Barangsiapa menghendaki kehidupan sekarang) Yakni kenikmatan sementara atau kehidupan dunia. Yakni barangsiapa yang menginginkan kehidupan dunia itu lewat amal kebaikan dan amalan akhirat. عَجَّلْنَا لَهُۥ فِيهَا(maka Kami segerakan baginya di dunia itu) Yakni di dunia. مَا نَشَآءُ(apa yang Kami kehendaki) Dan bukan tergantung kehendak orang yang menginginkan hal tersebut. لِمَن نُّرِيدُ(bagi orang yang kami kehendaki) Yakni bagi orang yang Kami kehendaki utuk mendapatkan kenikmatan sementara tersebut. ثُمَّ جَعَلْنَا لَهُۥ جَهَنَّمَ(dan Kami tentukan baginya neraka jahannam) Karena ia tidak menjalankan amal akhirat dengan ikhlas sebagaimana yang diperitahkan. يَصْلَىٰهَا مَذْمُومًا مَّدْحُورًا (ia akan memasukinya dalam keadaan tercela dan terusir) Yakni dijauhkan dari rahmat Allah."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "18-19 1 ). Perhatikan ayat ini : { مَنْ كَانَ يُرِيدُ الْعَاجِلَةَ عَجَّلْنَا لَهُ فِيهَا مَا نَشَاءُ لِمَنْ نُرِيدُ } \"Barangsiapa menghendaki kehidupan sekarang (duniawi), maka Kami segerakan baginya di dunia itu apa yang kami kehendaki bagi orang yang kami kehendaki\" Allah tidak mengatakan : \"kami segerakan apa yang ia kehendaki\" melainkan Allah mengatakan : \"apa yang kami kehendaki\" bukan apa yang ia kehendaki \"bagi orang yang kami kehendaki\"; karena diantara manusia ada yang diberikan baginya apa yang ia kehendaki di dunia, dan ada yang diberikan baginya sedikit dari apa yang ia kehedak, dan diantara mereka bahkan ada yang tidak diberikan sedikitpun dari apa yang ia kehendaki, adapun di akhirat ia mesti mendapatkan buah daripada amalan yang ia kerjakan dengan mengharap ridho Allah : { وَمَنْ أَرَادَ الْآخِرَةَ وَسَعَىٰ لَهَا سَعْيَهَا وَهُوَ مُؤْمِنٌ فَأُولَٰئِكَ كَانَ سَعْيُهُمْ مَشْكُورًا } \"Dan barangsiapa yang menghendaki kehidupan akhirat dan berusaha ke arah itu dengan sungguh-sungguh sedang ia adalah mukmin, maka mereka itu adalah orang-orang yang usahanya dibalasi dengan baik.\" [19]. 2 ). Perhatikan sifat-sifat ini yang dengannya Allah menjelaskan kriteria orang-orang yang menyampaikan kebenaran dalam mengear akhirat : { وَمَنْ أَرَادَ الْآخِرَةَ } \"Dan barangsiapa yang menghendaki kehidupan akhirat\" harus ada kemauan, namun tidak cukup hanya kemauan saja melainkan ada usaha dan kerja keras untuk menggapainya : { وَسَعَىٰ لَهَا سَعْيَهَا } tetapi kemauan dan usaha berbuah hasil yang pasti dengan keimanan, dan inilah yang menjadi penentu dari dua kriteria tadi : { وَهُوَ مُؤْمِنٌ }."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "18. Barangsiapa hanya menghendaki amal dunia dan kesenangannya yang telah berlalu atas akhirat, maka Kami akan menyegerakan baginya sesuatu yang Kami kehendaki bagi orang yang ingin disegerakan di antara mereka, bukan sesuatu yang mereka kehendaki, Kemudian karena meninggalkan amal akhirat, Kami membuatnya masuk ke dalam neraka Jahanam sebagai orang yang tercela, menjijikkan dan tertolak dari rahmat Allah SWT"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Siapa saja yang menghendaki kehidupan sekarang} dunia {Kami menyegerakan baginya di dunia apa yang Kami kehendaki bagi siapa saja yang Kami kehendaki. Kemudian Kami menyediakan baginya neraka Jahanam. Dia akan memasukinya} Dia akan memasukinya dan mengalami panasnya{dalam keadaan tercela lagi terusir} dijauhkan dari rahmat Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "18. Allah memberitahukan bahwasanya “barangsiapa menghendaki,” (kehidupan) dunia “kehidupan sekarang,” yang akan berakhir lagi fana, kemudian dia bekerja dan berusaha untuk meraihnya sehingga dia lupa tempat asal dan tujuan akhir hidupnya (akhirat), maka Allah akan segera memberikan sebagian kekayaan dan perhiasan dunia yang dia inginkan dan kehendaki, (sesuai jatah) yang telah Allah tulis baginya di Lauhul Mahfuzh. Hanya saja, semua itu bukanlah kenikmatan yang mempunyai nilai manfaat lagi tidak kekal baginya. Kemudian di akhirat kelak, Allah menyediakan baginya “Neraka Jahannam, dia memasukinya,” maksudnya dia merasakan langsung sikaanNya “dalam keadaan tercela dan terusir,” dalam keadaan kehinaan, terbongkar seluruh aibnya dan tercela di hadapan Allah dan para makhluk (juga) jauh dari rahmat Allah. Maka Allah menyatukan baginya antara deraan siksa dengan kehinaan bagi orang ittu."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (ٱلۡعَاجِلَةَ) al-‘aajilah : yaitu dunia karena ia cepat berakhir. (يَصۡلَىٰهَا) yashlaahaa madzmuumam madkhuuraa : memasukinya dengan hina, jauh dari surga. Makna ayat: Konteks ayat masih seputar kabar-kabar kebenaran Allah ta’ala yang mencakup jenis-jenis petunjuk ilahi yang tidak ada seorang pun terhalang darinya kecuali orang yang binasa. Allah ta’ala berfirman pada ayat yang pertama [ayat 18] “Barang siapa yang menginginkan kehidupan sekarang...” yaitu dunia “Kami segerakan baginya di dunia ini apa yang Kami kehendaki...” bukan seperti yang diinginkan hamba, dan firman-Nya “bagi orang yang Kami kehendaki...” tidak seperti yang diinginkan orang lain, karena seluruh perkara adalah milik Kami, “kemudian...” “Kemudian Kami sediakan baginya di akhirat neraka Jahanam; dia akan memasukinya dalam keadaan tercela...” terhina “dan terusir.” Terusir dari rahmat Kami yaitu surga negeri orang-orang yang baik, taat dan jujur."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 18: Allah Subhaanahu wa Ta'aala menyegerakan untuknya perhiasan dunia yang Dia kehendaki sesuai yang dicatat-Nya di Al Lauhul Mahfuzh untuk orang itu. Akan tetapi, hal itu hanyalah kesenangan yang sementara dan tidak kekal baginya. Dari rahmat. Ia memperoleh kehinaan dan azab."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 18",
    "description": "Allah memberikan pembalasan berupa ganjaran atau siksaan kepada manusia sesuai amal perbuatannya. Ayat ini menyatakan, barang siapa yang hanya menghendaki kehidupan sekarang, yaitu kehidupan duniawi dan ia tidak beriman kepada kehidupan akhirat, maka kami segerakan baginya di dunia ini apa yang kami kehendaki dari apa yang diharapkannya, seperti kedudukan sosial yang tinggi atau harta yang banyak, bagi orang yang kami kehendaki, yaitu mereka yang berusaha meraihnya dengan memenuhi syarat dan ketentuan, bukan untuk semua orang yang menghendakinya. Kemudian kami sediakan baginya di akhirat neraka jahanam; ia akan memasukinya dalam keadaan tercela dan terusir dari rahmat Allah. Dan barang siapa yang menghendaki dengan amal perbuatannya pembalasan kehidupan akhirat dan berusaha ke arah itu, yakni untuk memperoleh kehidupan akhirat dengan sungguh-sungguh dengan melakukan amal salih, sedangkan dia beriman kepada Allah dengan sungguh-sungguh, maka mereka itu adalah orang-orang yang usahanya dibalas dengan baik di sisi Allah dan mendapat ganjaran sesuai dengan amalnya."
  }
]