[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan barangsiapa bertujuan dengan amal shalihnya untuk mendapatkan pahala di akhirat yang kekal abdi, dan ia berusaha kuat untuk itu dengan melakukan ketaatan kepada Allah , sedang dia beriman keapada Allah dan pahala serta balasan besar dariNya, maka mereka itu adalah orang-orang yang amal shalihnya diterima dan tersimpan bagi mereka di sisi tuhan mereka, dan mereka akan memperoleh balasan atas amal itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Sebaliknya barangsiapa yang mengerjakan amal kebajikan dengan menghendaki pahala Akhirat dan berusaha meraihnya secara sungguh-sungguh tanpa disertai sifat ria dan sum'ah, dan ia beriman kepada perkara-perkara yang diwajibkan Allah untuk diimani, maka mereka yang memiliki sifat-sifat seperti ini, usaha dan kesungguhan mereka akan diterima di sisi Allah dan Dia akan memberikan mereka ganjaran atasnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "19. Dan barangsiapa yang menginginkan kehidupan akhirat beserta kenikmatannya dan mengerjakan amalan yang dapat mengantarkannya kepada keinginannya tersebut dengan penuh keimanan dan kebaikan, maka orang yang memiliki derajat yang tinggi ini akan diterima amalannya di sisi Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "19. وَمَنْ أَرَادَ الْاٰخِرَةَ (Dan barangsiapa yang menghendaki kehidupan akhirat) Yakni yang menginginkan kehidupan akhirat dengan amalan-amalannya. وَسَعَىٰ لَهَا سَعْيَهَا(dan berusaha ke arah itu dengan sungguh-sungguh) Yakni dengan usaha yang sesuai dengan yang diperintahkan tanpa melakukan bid’ah atau dibarengi dengan hawa nafsu. وَهُوَ مُؤْمِنٌ(sedang ia adalah mukmin) Yakni beriman kepada Allah dengan keimanan yang benar. فَأُو۟لٰٓئِكَ كَانَ سَعْيُهُم مَّشْكُورًا(maka mereka itu adalah orang-orang yang usahanya dibalasi dengan baik) Yakni diterima oleh Allah."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1. Perhatikan ayat ini : { مَنْ كَانَ يُرِيدُ الْعَاجِلَةَ عَجَّلْنَا لَهُ فِيهَا مَا نَشَاءُ لِمَنْ نُرِيدُ } \"Barangsiapa menghendaki kehidupan sekarang (duniawi), maka Kami segerakan baginya di dunia itu apa yang kami kehendaki bagi orang yang kami kehendaki\" Allah tidak mengatakan : \"kami segerakan apa yang ia kehendaki\" melainkan Allah mengatakan : \"apa yang kami kehendaki\" bukan apa yang ia kehendaki \"bagi orang yang kami kehendaki\"; karena diantara manusia ada yang diberikan baginya apa yang ia kehendaki di dunia, dan ada yang diberikan baginya sedikit dari apa yang ia kehedak, dan diantara mereka bahkan ada yang tidak diberikan sedikitpun dari apa yang ia kehendaki, adapun di akhirat ia mesti mendapatkan buah daripada amalan yang ia kerjakan dengan mengharap ridho Allah : { وَمَنْ أَرَادَ الْآخِرَةَ وَسَعَىٰ لَهَا سَعْيَهَا وَهُوَ مُؤْمِنٌ فَأُولَٰئِكَ كَانَ سَعْيُهُمْ مَشْكُورًا } \"Dan barangsiapa yang menghendaki kehidupan akhirat dan berusaha ke arah itu dengan sungguh-sungguh sedang ia adalah mukmin, maka mereka itu adalah orang-orang yang usahanya dibalasi dengan baik.\" [19]. 2. Perhatikan sifat-sifat ini yang dengannya Allah menjelaskan kriteria orang-orang yang menyampaikan kebenaran dalam mengear akhirat : { وَمَنْ أَرَادَ الْآخِرَةَ } \"Dan barangsiapa yang menghendaki kehidupan akhirat\" harus ada kemauan, namun tidak cukup hanya kemauan saja melainkan ada usaha dan kerja keras untuk menggapainya : { وَسَعَىٰ لَهَا سَعْيَهَا } tetapi kemauan dan usaha berbuah hasil yang pasti dengan keimanan, dan inilah yang menjadi penentu dari dua kriteria tadi : { وَهُوَ مُؤْمِنٌ }."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19. Dan barangsiapa menghendaki amal akhirat dan mengerjakan perbuatan yang diperintahkan berupa ketaatan, yaitu beriman dengan benar tanpa melakukan kesyirikan dan pendustaan, maka mereka semua itu telah memenuhi tiga syarat. Amal mereka diterima di sisi Allah SWT, yaitu diterima disisiNya dan diberi imbalan olehNya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Siapa saja yang menghendaki kehidupan akhirat dan berusaha ke arah itu dengan sungguh-sungguh} berbuat untuk itu dengan sungguh-sungguh {dan dia adalah mukmin, mereka itulah orang yang usahanya dibalas dengan baik} diterima"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "19. “Dan barangsiapa yang menghendaki kehidupan akhirat,” kemudian dia menyukai dan mengutamakannya daripada kehidupan dunia “dan berusaha kea rah itu dengan sungguh-sungguh,” (tempat) yang mana kitab samawi dan atsar nabi mengajak kepadanya, lalu dia beramal sesuai dengan batas (maksimal) kemampuannya “sedang dia orang yang beriman,” kepada Allah, para malaikatNya, kitab-kitabNya, para rasulNya, dan Hari Akhir, “Maka mereka itu, adalah orang-orang yang usahanya dibalasi dengan baik,” maksudnya amalnya diterima, berkembang dan tersimmpan. Bagi mereka pahala dan ganjaran di sisi Rabbnya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (وَسَعَىٰ لَهَا سَعۡيَهَا) wa sa’aa lahaa sa’yahaa : melakukan amalan yang menjadi syarat untuk masuk kedalam surga, yaitu dengan iman dan amal saleh. (كَانَ سَعۡيُهُم مَّشۡكُورٗا) kaana sa’yuhum masykuuraa : amalan mereka diterima dan diganjar oleh Allah ta’ala. Makna ayat: Firman-Nya ta’ala pada ayat yang kedua [19] “Dan barang siapa yang menghendaki kehidupan akhirat...” Allah ta’ala mengabarkan bahwa siapa pun yang menginginkan kebahagiaan di akhirat “dan berusaha ke sana dengan bersungguh-sungguh...” beramal dengan cara yang benar, yaitu iman yang benar dan amal saleh. Sesuai dengan apa yang Allah syariatkan dalam kitab-Nya dan lisan rasul-Nya serta menjauhi syirik dan maksiat. Firman-Nya ta’ala “dan dia beriman...” ini adalah syarat sahnya amal saleh yaitu amalan seorang hamba seperti shalat dan jihad tidak akan diterima kecuali dia telah beriman kepada Allah dan rasul-Nya, apa yang telah dibawa oleh rasul-Nya dan dikabarkan berupa perkara gaib. Firman-Nya ta’ala “maka mereka...” yang telah disebutkan telah beriman dan beramal saleh “Maka mereka itu orang yang usahanya dibalas dengan baik.” Amalan mereka diterima dan dibalas dengan pahala berupa surga dan keridhaan Allah ta’ala."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 19: Dia ridha kepada akhirat dan lebih mengutamakan akhirat daripada dunia. Sesuai kemampuannya. Kepada rukun iman yang enam. Yakni diterima dan diberi pahala. Meskipun demikian, mereka tidak kehilangan bagian di dunia, karena masing-masingnya mendapat kemurahan dari Allah Subhaanahu wa Ta'aala. Oleh karena itu, barang sapa yang mencari akhirat, maka dia akan memperoleh pula dunia, ibarat orang yang menanam padi akan tumbuh rumput. Sebaliknya orang yang mencari dunia, maka dia tidak memperoleh akhirat, ibarat orang yang menanam rumput tidak tumbuh padi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 19",
    "description": "Dan barang siapa yang menghendaki dengan amal perbuatannya pembalasan kehidupan akhirat dan berusaha ke arah itu, yakni untuk memperoleh kehidupan akhirat dengan sungguh-sungguh dengan melakukan amal salih, sedangkan dia beriman kepada Allah dengan sungguh-sungguh, maka mereka itu adalah orang-orang yang usahanya dibalas dengan baik di sisi Allah dan mendapat ganjaran sesuai dengan amalnya. Kepada masing-masing golongan, baik golongan ini yang mengharapkan pembalasan dunia maupun golongan itu yang mengharapkan pembalasan akhirat, kami berikan bantuan dari kemurahan tuhanmu, yakni kami berikan bagi keduanya itu pembalasan sesuai dengan amal perbuatannya. Dan kemurahan tuhanmu tidak dapat dihalangi oleh siapa pun. Pembalasan di dunia kami berikan kepada siapa saja yang berusaha meraihnya, baik kafir maupun mukmin, sedangkan pembalasan berupa pahala di akhirat, khusus kami anugerahkan kepada orang-orang yang beriman dan beramal saleh dengan sungguh-sungguh sesuai dengan ketentuan tuhanmu."
  }
]