[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sebagaimana Allah telah memuliakan Muhammad dengan isra, Kami telah memuliakan Musa dengan memberinya kitab taurat. Dan kami menjadikannya sebagai penjelas kebenaran dari bimbingan bagi bani israil, yang berisi larangan bagi mereka dari menjadikan selain Allah sebagai yang menangani(segala urusan) atau sesembahan yang mana mereka menyerahkan segala persoalan mereka kepadanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Kami telah memberikan pada Musa -'alaihissalām- Kitab Taurat yang kami jadikan sebagai hidayah dan petunjuk bagi Bani Israil, dengan mengambil janji dari mereka, \"Janganlah mengambil pelindung selain Aku dengan menyerahkan urusan kalian padanya, namun berserah dirilah kalian sepenuhnya hanya kepada-Ku\"."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "2. Dan Kami memberikan Taurat kepada Musa sebagai petunjuk bagi para keturunan Nabi Ya’qub menuju kebenaran dan keesaan Allah karena kitab itu mengandung larangan menyembah selain Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. وَءَاتَيْنَا مُوسَى الْكِتٰبَ (Dan Kami berikan kepada Musa kitab) Yakni kitab Taurat. وَجَعَلْنٰهُ(dan Kami jadikan kitab Taurat itu) Yakni kitab taurat tersebut. هُدًى لِّبَنِىٓ إِسْرٰٓءِيلَ (petunjuk bagi Bani Israil) Agar mereka mendapat petunjuk darinya. أَلَّا تَتَّخِذُوا۟ مِن دُونِى وَكِيلًا ((dengan firman): “Janganlah kamu mengambil penolong selain Aku) Yakni penolong dalam segala urusan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Dan Kami anugerahkan kepada Musa kitab Taurat. Lalu Kami jadikan kitab itu sebagai petunjuk bagi Bani Israil dari kegelapan menuju cahaya dan supaya kalian tidak mengambil Tuhan lain selain Aku yang kalian serahi segala perkara-perkara kalian."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami memberi Musa kitab} Taurat {dan menjadikannya sebagai petunjuk bagi Bani Israil,“Janganlah mengambil selain Aku sebagai seorang pelindung} sesembahan yang kalian wakilkan kepadanya urusan-urusan kalian"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2. Seringkali Allah Yang Maha Pencipta menghubungkan antara kenabian Muhammad dengan kenabian Musa, kitab dan syariat mereka berdua. Karena kitab keduanya adalah sebaik-baik kitab, syariat mereka merupakan syariat yang paling sempurna, dan kenabian mereka adalah (tingkat) kenabian yang tertinggi serta para pengikut mereka adalah bagian terbesar kaum Mukminin. Oleh karenanya, Allah berfirman, “Dan Kami jadikan kitab Taurat itu petunjuk bagi Bani Israil,” yang bisa mereka jadikan petunjuk dari dalam kegelapan kebodohan menuju keilmuan tentang kebenaran (dengan berfirman), “Janganlah kamu mengambil penolong selain aku,” maksudnya Kami telah katakana hal itu kepada mereka. Dan untuk tujuan itu pula, Kami telah menurunkan al-Kitab (Taurat). (Yaitu) supaya mereka beribadah hanya kepada Allah, kembali kepadaNya, menjadikanNya sebagai satu-satunya Penolong dan Pengatur, baik dalam urusan agama ataupun perkara duniawi mereka, serta tidak bergantung kepada selainNYa dari makhluk yang tidak memiliki sesuatu pun (kekuasaan) dan tidak bisa memberi manfaat sedikit pun bagi mereka."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (وَءَاتَيۡنَا مُوسَى ٱلۡكِتَٰبَ) wa`aatainaa muusal kitaab : Kami berikan kepada Musa kitab yaitu Taurat. (وَجَعَلۡنَٰهُ هُدٗى لِّبَنِيٓ إِسۡرَٰٓءِيلَ) wa ja’alnaahu hudal libanii israa`il : Kami menjadikan Al-Kitab atau Musa sebagai hidayah; petunjuk untuk Bani Israil. (وَكِيلٗا) wakiilaa : penjaga atau sekutu. Makna ayat: Allah ta’ala mengabarkan bahwa Dia-lah yang memperjalankan hamba-Nya pada malam hari dari Masjidil Haram menuju Masjidil Aqsha, bahwa Dia yang telah memberikan Musa Al-Kitab; Taurat, dan Allah telah memberikan keutamaan kepada Muhammad shallallahu ‘alaihi wa sallam dan umatnya dengan Isra` dan Mi’raj dan kepada Musa dengan memberikannya Al-Kitab, sebagai petunjuk dan penjelas untuk Bani Israil, Dia pula yang memberikan keutamaan kepada Bani Israil. Segala puji dan karunia hanya milik-Nya. Firman-Nya “Dan Kami menjadikannya...” yaitu Al-Kitab “petunjuk...” penjelas bagi Bani Israil, sehingga mereka dapat meraih jalan kesempurnaan dan kebahagiaan. Firman-Nya “janganlah kalian mengambil penolong selain Aku...” Kami telah memberikan Musa Al-Kitab dan menjadikannya petunjuk untuk Bani Israil agar mereka tidak mengambil penolong selain-Ku, sehingga mereka menjadikannya sekutu dengan bertawakkal kepadanya dan menyerahkan urusan mereka kepadanya, melupakan-Ku sedangkan Aku adalah Rabb mereka dan pemberi nikmat. Pelajaran dari ayat: • Penjelasan karunia Allah kepada dua umat; umat Islam dan Bani Israil. • Penjelasan rahasia dari penurunan kitab-kitab, yaitu untuk memberikan manusia petunjuk menuju peribadatan kepada Allah ta’ala dan mentauhidkan-Nya dalam ibadah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 2: Allah Subhaanahu wa Ta'aala sering menyertakan kenabian Muhammad shallallahu 'alaihi wa sallam dengan kenabian Musa ‘alaihis salam, demikian pula antara kitab dan syari’at keduanya. Hal itu, karena kitab keduanya adalah kitab yang paling utama, sedangkan syari’atnya adalah syari’at yang paling sempurna, dan kenabian keduanya adalah kenabian yang paling tinggi, dan para pengikutnya adalah mayoritas kaum mukmin. Demikian menurut Syaikh As Sa’diy rahimahullah. Di tengah gelapnya kebodohan. Yakni agar mereka hanya beribadah kepada Allah, kembali kepada-Nya, dan menjadikan-Nya sebagai al Wakil (Tuhan yang diserahi urusan) serta pengatur mereka baik dalam urusan agama maupun dunia, serta tidak bergantung kepada selain-Nya yang sesungguhnya tidak memiliki apa-apa dan tidak memberikan manfaat sedikit pun."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 2",
    "description": "Bila Allah memuliakan nabi Muhammad dengan memperjalalankannya dari masjidilharam ke masjidil aqsa, maka dia memuliakan nabi musa dengan menganugerahkan kepadanya kitab taurat agar menjadi petunjuk bagi bani israil. Dan kami berikan kepada nabi musa kitab, yaitu taurat, dan kami menjadikannya sebagai petunjuk yang khusus bagi bani israil, yaitu anak keturunan nabi yakub, agar mereka tidak menyembah kepada selain-ku. Kepada mereka aku berfirman, janganlah kamu mengambil penolong selain aku, yakni janganlah menyembah dan menggantungkan segala urusan kepada selain-ku. Wahai keturunan dari orang yang kami bawa bersama nuh, yaitu orangorang yang diselamatkan Allah dari bencana banjir, jadikanlah nenek moyangmu, yaitu nabi nuh sebagai teladan bagimu, sesungguhnya dia adalah hamba Allah yang banyak bersyukur atas nikmat yang dianugerahkan Allah kepadanya. Maka bersyukurlah kamu sekalian atas nikmat diutusnya rasul kepadamu, sebagaimana mereka mensyukuri nikmat yang dianugerahkan Allah kepadanya."
  }
]