[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Masing-masing golongan yang berusaha untuk dunia yang fana dan golongan yang beramal untuk akhirat yang kekal, Kami memberinya tambahan bagian dari rizki Kami. Kami memberi rizki kepada kaum mukminin dan orang-orang kafir di dunia. Sebab sesungguhnya rizki itu berasal dari pemberian tuhanmu sebagai karunia dariNya. Dan pemberian tuhanmu tidak terhalangi bagi siapapun, orang mukmin maupun kafir."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "20. Kepada masing-masing dua golongan ini yaitu golongan buruk dan golongan baik, Kami berikan bantuan dan tambahan kemurahan dari karunia Tuhanmu -wahai Rasul- tanpa henti. Sungguh karunia dan kemurahan Tuhanmu di kehidupan dunia ini tidak terhalangi dari seorangpun, sama saja ia orang baik-baik ataupun orang yang buruk."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "20. Dan bagi setiap orang yang beramal untuk dunia dan yang beramal untuk akhirat akan Kami berikan kepada mereka karunia Kami yang luas. Kami memberi rezeki di dunia kepada orang beriman dan orang kafir, kepada orang yang taat dan orang yang bermaksiat; dan karunia Tuhanmu tidak pernah terhalang dari seorang pun."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "20. كُلًّا نُّمِدُّ هٰٓؤُلَآءِ وَهٰٓؤُلَآءِ (Kepada masing-masing golongan baik golongan ini maupun golongan itu Kami berikan bantuan) Yakni Kami menambah pemberian Kami kepada setiap golongan secara terus menerus tanpa terputus, kemaksiatan seseorang tidak menjadikan rezekinya terputus. مِنْ عَطَآءِ رَبِّكَ ۚ( dari kemurahan Tuhanmu) Yakni seluruh rezeki tersebut hanya karena karunia dan kemurah-Nya. وَمَا كَانَ عَطَآءُ رَبِّكَ مَحْظُورًا(Dan kemurahan Tuhanmu tidak dapat dihalangi) Yakni tidak terlarang."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20. Masing-masing golongan itu akan Kami beri anugerah dan Kami mudahkan setelah beberapa kesempatan dari rejeki Tuhanmu dengan kemurahan anugerahNya. Dan rejeki dan keutamaan Tuhanmu itu pasti diberikan kepada orang yang layak menerimanya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Tiap-tiap (golongan) Kami beri tambahan} Kami tambah {dari anugerah Tuhanmu, golongan itu dan golongan ini dan kemurahan Tuhanmu tidak dapat dihalangi} tidak bisa dicegah siapapun"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "20. Walaupun demikian, jatah mereka di dunia tidak terlewatkan. Masing-masing pihak dibantu oleh Allah dari bagian kenikmatan dunia, karena itu merupakan cerminan curahan karunia dan kebaikan Allah."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "(كُلّٗا نُّمِدُّ هَٰٓؤُلَآءِ وَهَٰٓؤُلَآءِ) kullan numiddu haa`ulaa`i wa haa`ulaa`i : Kami memberi keduanya. (وَمَا كَانَ عَطَآءُ رَبِّكَ مَحۡظُورًا) wa maa kaana ‘athaa`u rabbika mahzhuuraa : karunia Allah ta’ala di dunia tidak terbatas dari siapapun. Makna ayat: Firman-Nya ta’ala “Kepada masing-masing (golongan), baik (golongan) ini (yang menginginkan dunia) maupun (golongan) itu (yang menginginkan akhirat), Kami berikan bantuan dari kemurahan Rabbmu. Dan kemurahan Rabbmu tidak dapat terhalangi.” Setiap dari yang menginginkan dunia dan yang menginginkan akhirat, Allah memberikan mereka pemberian-Nya; karunia-Nya yang luas. Mereka semua makan, minum, dan mengenakan pakaian sesuai dengan apa yang telah ditakdirkan untuk mereka, baik luas ataupun sempit, kemudian mereka meninggal dan jelaslah perbedaan tergantung pada keinginan yang rusak atau yang baik. Firman-Nya ta’ala “Dan kemurahan Rabbmu tidak dapat terhalangi.” Jika Allah ta’ala menginginkan untuk memberi kepada seseorang, maka tidak ada yang dapat menghalangi pemberian tersebut. Pelajaran dari ayat: • Kedua negeri; kebahagian dan kesengsaraan, tergantung kepada usaha dan perbuatan hamba. Ini merupakan ketetapan Allah ta’ala kepada para hamba-Nya. • Usaha untuk mendapatkan dunia adalah dengan perdagangan, pertanian, dan produksi. • Usaha untuk mendapatkan akhirat adalah dengan iman, amal saleh, dan membersihkan diri dari syirik dan maksiat. • Allah ta’ala memberikan dunia kepada yang Dia cintai dan tidak Dia cintai, pemberiannya tergantung kepada ketetapan-Nya yang harus diketahi di dunia, serta perbuatan sesuai dengan aturan-Nya bagi mereka yang ingin dunia ataupun akhirat. • Apa yang Allah berikan, tidak mungkin akan dihalangi oleh siapa pun, sehingga wajib bertawakkal kepada Allah dan berpaling dari selain-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 20: Bahkan semua makhluk mendapatkan karunia dan ihsan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 20",
    "description": "Kepada masing-masing golongan, baik golongan ini yang mengharapkan pembalasan dunia maupun golongan itu yang mengharapkan pembalasan akhirat, kami berikan bantuan dari kemurahan tuhanmu, yakni kami berikan bagi keduanya itu pembalasan sesuai dengan amal perbuatannya. Dan kemurahan tuhanmu tidak dapat dihalangi oleh siapa pun. Pembalasan di dunia kami berikan kepada siapa saja yang berusaha meraihnya, baik kafir maupun mukmin, sedangkan pembalasan berupa pahala di akhirat, khusus kami anugerahkan kepada orang-orang yang beriman dan beramal saleh dengan sungguh-sungguh sesuai dengan ketentuan tuhanmu. Kemudian Allah menyatakan kepada kedua golongan itu, perhatikanlah dan ambillah pelajaran bagimu bagaimana kami lebihkan sebagian dari mereka atas sebagian yang lain, dari kesenangan duniawi maupun kesenangan ukhrawi yang diperoleh sebagai ganjaran dari amal perbuatannya. Dan pasti pembalasan berupa kesenangan dalam kehidupan akhirat lebih tinggi derajatnya dan lebih besar keutamaanya dibandingkan dengan pembalasan di dunia."
  }
]