[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Perhatikanlah (wahai rasul), bagaimana Allah melebihkan sebagian manusia di atas sebagian yang lain di dunia dalam rizki dan pekerajaan. Dan kehidupan akhirat benar-benar lebih tinggi derajat-derajatnya bagi kaum mukminin dan lebih besar keutamaannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Perhatikanlah -wahai Rasul-, bagaimana Kami melebihkan sebagian mereka atas sebagian yang lain di kehidupan dunia ini dari segi rezeki dan pangkat kedudukan, namun kehidupan Akhirat tentu lebih tinggi derajat kenikmatan dan karunianya serta lebih besar keutamaannya dibandingkan kehidupan dunia, sebab itu hendaknya setiap mukmin berusaha untuk meraihnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "21. Hai manusia, lihatlah bagaimana Kami melebihkan sebagian manusia atas sebagian lainnya dari sisi rezeki dan akhlak mereka. Dan derajat yang ada di akhirat lebih agung dan lebih besar."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "21. انظُرْ كَيْفَ فَضَّلْنَا بَعْضَهُمْ عَلَىٰ بَعْضٍ ۚ (Perhatikanlah bagaimana Kami lebihkan sebagian dari mereka atas sebagian (yang lain)) Dan hal ini sesuai dengan hikmah Allah yang dalam, yang tidak dapat dijangkau oleh akal manusia. وَلَلْاٰخِرَةُ أَكْبَرُ دَرَجٰتٍ وَأَكْبَرُ تَفْضِيلًا(Dan pasti kehidupan akhirat lebih tinggi tingkatnya dan lebih besar keutamaannya) Yakni tingkatan dan derajat antara orang-orang beriman dengan orang-orang kafir di akhirat jauh berbeda di atas tingkatan dan derajat mereka di dunia dalam hal keluasan dan kesempitan atau dalam hal lainnya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Persaingan ketat dalam mengumpulkan prestasi dan nilai antar penuntut tidak lain adalah persaingan dalam urusan duniawi, tapi sesungguhnya al-Qur'an telah datang dengan wasiat dan petunjuknya yang menganjurkan setiap orang untuk bersaing dalam urusan akhirat, dan itu jauh lebih agung dan lebih besar manfaatnya. Seorang mukmn yang dimudahkan oleh Allah untuk menjalaninya akan mengambil pelajaran dari setiap ayat-ayat ini : { انْظُرْ كَيْفَ فَضَّلْنَا بَعْضَهُمْ عَلَىٰ بَعْضٍ ۚ وَلَلْآخِرَةُ أَكْبَرُ دَرَجَاتٍ وَأَكْبَرُ تَفْضِيلًا } \"perhatikanlah bagaimana Kami lebihkan sebagian dari mereka atas sebagian (yang lain). Dan pasti kehidupan akhirat lebih tinggi tingkatnya dan lebih besar keutamaannya.\""
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "21. Lihatlah dengan penuh perhatian wahai manusia, bagaimana Kami memberi keutamaan sebagian golongan atas sebagian lainnya dalam hal rejeki, kekuatan, kesehatan, dan kemuliaan sebagai bentuk kebijaksanaan yang terang yang tidak disadari oleh umumnya akal (manusia), Namun derajat kemuliaan di akhirat itu lebih agung, lebih banyak dan lebih luhur daripada kemuliaan dunia, maka sebaiknya mementingkan urusan akhirat lebih banyak"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Perhatikanlah bagaimana Kami melebihkan sebagian mereka atas sebagian lain. Sungguh kehidupan akhirat lebih tinggi derajatnya dan lebih besar keutamaannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21. “Perhatikanlah bagaimana Kami lebihkan sebagian dari mereka atas sebagian yang lain),” di dunia dengan kelapangan rizki dan keterbatasannya, kemudahan dan kesusahan, pengetahuan dan kebodohan, keceradasan dan ketololan, dan aspek-aspek lainnya yang mana Allah melebihkan sebagian orang dari sebagian yang lain dengannya. “Dan pasti kehidupan akhirat lebih tinggi tingkatnya dan lebih besar keutamaannya.” Maka tidak bisa di perbandingkan antara kenikmatan dunia dengan kenikmatan akhirat dalam segala sudut. Alangkah jauh perbedaan antara orang yang berada di istana-istana yang tinggi, aneka kelezatan yang bermacam-macam, beragam jenis kebaikan, rangkaian kebahagiaan, dengan orang yang menggelepar-gelepar di dalam Neraka Jahim, tersiksa dengan azab yang pedih, dan kemurkaan Rabb Yang Maha Penyayang yang sudah mengenainya. Dan masing-masing dari dua kampung itu (dunia dan akhhirat) di hadapan para penghuninya mempunyai sisi-sisi perbedaan yang tidak terhitung jumlahnya oleh seseorang."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (كَيۡفَ فَضَّلۡنَا بَعۡضَهُمۡ عَلَىٰ بَعۡضٖۚ) kaifa fadhdhalnaa ba’dhahum ‘alaa ba’dh : dalam hal rezeki dan kedudukan. Makna ayat: Firman-Nya ta’ala “Perhatikanlah bagaimana Kami melebihkan sebagian mereka atas sebagian yang lain...” Lihatlah wahai rasul Kami dan orang yang memahami perkataan Kami, bagaimana Kami melebihkan sebagian orang dari sebagian yang lain dalam rezeki—yang mencakup kesehatan, keselamatan, harta, keturunan, dan pangkat—jika engkau memahami hal ini, ketahui bahwa akhirat tentu lebih besar derajat dan perbedaannya. Itu semua kembali kepada karunia Allah—yang pertama—kemudian kepada perbuatan; baik atau buruk, banyak atau sedikit, sebagaimana keadaan di dunia, seseorang akan mendapatkan kebaikan tergantung usahanya di dunia, sekalipun ia kafir, sesuai dengan firman-Nya “Barang siapa yang menginginkan kehidupan dunia dan perhiasannya, pasti Kami berikan (balasan) penuh atas pekerjaan mereka di dunia (dengan sempurna) dan mereka di dunia tidak akan dirugikan.” [QS. Hud:15] keadaan mereka sebagai orang kafir atau musyrik tidak mengurangi buah dari perbuatan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 21: Di dunia, dengan luas dan sedikitnya rezeki, mudah dan susahnya, berpengetahuan dan yang tidak berpengetahuan, yang berakal cerdas dan yang kurang, dan lain sebagainya di antara perkara yang Allah bedakan antara yang satu dengan yang lain. Daripada dunia. Oleh karena itu, kenikmatan dunia dibandingkan akhirat, tidak ada apa-apanya dari berbagai sisi. Oleh karenanya kehidupan akhirat harus lebih diutamakan dan diberi perhatian lebih."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 21",
    "description": "Kemudian Allah menyatakan kepada kedua golongan itu, perhatikanlah dan ambillah pelajaran bagimu bagaimana kami lebihkan sebagian dari mereka atas sebagian yang lain, dari kesenangan duniawi maupun kesenangan ukhrawi yang diperoleh sebagai ganjaran dari amal perbuatannya. Dan pasti pembalasan berupa kesenangan dalam kehidupan akhirat lebih tinggi derajatnya dan lebih besar keutamaanya dibandingkan dengan pembalasan di dunia. Oleh karena itu, janganlah engkau adakan tuhan yang lain di samping Allah, yakni jangan mempersekutukan-Nya, nanti engkau menjadi tercela dan terhina karena perbuatanmu itu, sehingga engkau menyesal karena tidak ada siapa pun yang dapat menolongmu."
  }
]