[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Janganlah engkau (wahai manusia) mengadakan sekutu bersama Allah dalam beribadah kepadaNYa, akibatnya engkau kembali membawa celaan dan dicampakan oleh Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "22. Wahai hamba Allah! Janganlah engkau mengadakan tuhan lain di samping Allah yang engkau sembah, nanti engkau akan tercela dan tak terpuji di hadapan Allah dan di hadapan hamba-hamba-Nya yang saleh serta terhina dan tidak akan ada yang menolongmu dari-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "22. Allah memperingatkan manusia dari bahaya kesyirikan dan melarang mereka melakukannya karena dapat mendatangkan kehinaan dan kerugian di dunia dan di akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "22. فَتَقْعُدَ مَذْمُومًا مَّخْذُولًا (sehingga kamu menjadi tercela dan terhina) Yakni sehingga kalian berada dalam dua hal tersebut; tercela di hadapan Allah, para malaikat, dan orang-orang shalih, dan terhina di hadapan Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "22. Wahai manusia, janganlah kamu menyertakan tuhan lain selain Allah sebagai sekutu dalam peribadatanmu, sehingga kamu akan mendapatkan cacian dari Allah, para malaikat Allah dan hamba-hamba yang shalih serta menjadi orang yang gagal, sehingga tidak ada penolong bagimu. Allah akan menelantarkanmu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Janganlah menjadikan tuhan yang lain bersama Allah sehingga kamu menjadi} menjadi {tercela lagi terhina} tidak ditolong dari orang yang harapkan pertolongannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "22. Maknanya: Janganlah kalian meyakini bahwasanya ada salah satu dari makhluk yang berhak untuk diibadahi. Jangan (pula) kalian menyekutukan siapa pun denganNya dalam beribadah. Sesungguhnya itu semua merupakan penyulut celaan dan penelantaran (tanpa bimbingan Allah). Allah, para malaikat dan para RasulNya telah melarang syirik, betul-betul mencela pelakunya, dan menyandangkan predikat-predikat tercela dan ciri-ciri yang buruk lantaran tindak kesyirikan, selama pelakunya merupakan orang yang sifatnya paling jelek dan citranya paling buruk. Dalam urusan agama dan dunianya, dia mengalami penelantaran sesuai besar kecilnya tindakannya meninggalkan ketergantungan kepada Rabbnya. Barangsiapa yang bersandar kepada selain Allah, maka (kondisinya) akan terlantara, dia pun akan dibuat memiliki ketergantungan kepada obyek yang digantunginya tersebut. Padahal tidak ada seorang pun yang mampu memberi manfaat bagi orang lain kecuali dengan izin Allah. Sebagaimana orang yang menjadikan sesembahan selain Allah mendapatkan celaan dan kenistaan, maka orang yang bertauhid dan mengikhlaskan agamanya hanya kepada Allah serta bergantung hanya kepadaNya, maka dia dalam keadaan terpuji dan tertolong dalam segala keadaannya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (لَّا تَجۡعَلۡ مَعَ ٱللَّهِ إِلَٰهًا ءَاخَرَ) laa taj’al ma’allaahi ilaahan `aakhar : jangan kalian menyekutukan Allah ta’ala dengan selain-Nya berupa sesembahan yang batil. (فَتَقۡعُدَ مَذۡمُومٗا مَّخۡذُولٗا) fataq’uda madzmuumam makhdzuulaa : sehingga engkau menjadi tercela di hadapan para malaikat dan kaum mukminin, serta jauh dari Allah ta’ala. Makna ayat: Firman-Nya ta’ala “Janganlah engkau mengadakan tuhan yang lain di samping Allah...” wahai rasul Kami janganlah engkau menjadikan tuhan di samping Allah, engkau beriman, beribadah, dan mengakui di samping Kami ketuhanannya, karena jika engkau melakukannya—dan mustahil ia akan melakukannya, karena Allah tidak menghendakinya—“nanti engkau menjadi tercela dan terhina.” Terhina karena kaum mukminin dan para malaikat akan menghinamu, terusir dari sisi Rabbmu sehingga engkau tidak punya penolong. Sekalipun konteks ayat adalah percakapan kepada Rasulullah shallallahu ‘alaihi wa sallam, namun yang dimaksud adalah manusia seluruhnya. Allah ta’ala melarang hamba-Nya untuk beribadah kepada selain-Nya sedangkan ia juga beribadah kepada Allah, sehingga ia pun menjadi celaka wal’iyaadzubillah ta’ala. Pelajaran dari ayat: • Pengharaman syirik serta ancaman pelakunya dengan abadi di neraka Jahanam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 22: Maksudnya, janganlah kamu meyakini bahwa ada seorang di antara makhluk yang berhak disembah, dan janganlah menyekutukan Allah dengan sesuatu pun di antara makhluk-Nya, karena yang demikian dapat mengakibatkan kamu menjadi orang yang tercela lagi terlantar (tidak ada yang menolongnya baik dalam urusan agama maupun dunia). Ayat ini juga menunjukkan, bahwa barang siapa yang bergantung kepada selain Allah, maka dia akan menjadi orang terlantar, karena tidak ada satu pun makhluk yang dapat memberi manfaat kepada orang lain kecuali dengan izin Allah. Sebaliknya, barang siapa yang mengesakan-Nya, mengikhlaskan ibadah hanya kepada-Nya dan bergantung kepada-Nya saja, maka dia terpuji lagi mendapat pertolongan dalam semua keadaannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 22",
    "description": "Oleh karena itu, janganlah engkau adakan tuhan yang lain di samping Allah, yakni jangan mempersekutukan-Nya, nanti engkau menjadi tercela dan terhina karena perbuatanmu itu, sehingga engkau menyesal karena tidak ada siapa pun yang dapat menolongmu. Setelah menjelaskan penggolongan manusia menjadi dua golongan; ada yang menghendaki kehidupan dunia saja dan ada yang menghendaki kehidupan akhirat di samping kehidupan dunia, kelompok ayat ini selanjutnya menjelaskan tatakrama pergaulan antar manusia dalam kehidupannya. Ayat ini menyatakan, dan tuhanmu telah menetapkan dan memerintahkan agar kamu wahai sekalian manusia jangan menyembah selain dia dan hendaklah berbuat baik kepada ibu bapakmu dengan sebaikbaiknya. Jika salah seorang di antara keduanya atau kedua-duanya sampai berusia lanjut dan mereka berada dalam pemeliharaanmu, maka sekalikali janganlah kamu menyakiti keduanya, misalnya dengan mengatakan kepada keduanya perkataan ah, yakni perkataan yang mengandung makna kemarahan atau kejemuan, dan janganlah engkau membentak keduanya jika mereka merepotkan kamu atau berbuat sesuatu yang kamu tidak menyukainya, dan ucapkanlah kepada keduanya perkataan yang mulia, yakni perkataan yang baik, yang mengandung penghormatan dan kasih sayang."
  }
]