[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan tuhanmu (wahai manusia) telah memerintah, mengharuskan dan mewajibkan untuk diesakan dalam peribadahan kepadaNya, dan Dia memerintahkan untuk berbuat baik kepada bapak-ibu, terutama di saat mereka berusia lanjut, janganlah engkau berkeluh kesah, jangan merasa kesal terhadap sesuatu yang engkau lihat dari mereka atau salah satu dari mereka, dan jangan memperdengarkan kepada mereka ucapan yang buruk, bahkan jangan pula berkata (ah) sekaliapun ia merupakan tingkat terendah dari ucapan yang buruk. Dan janganlah muncul darimu tindakan buruk kepada mereka berdua. Akan tetapi bersikaplah lembu kepada mereka berdua. Dan katakanlah kepada mereka berdua selalu perkataan lembut bagi tulus."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "23. Wahai hamba Allah! Tuhanmu telah memerintahkan dan mewajibkan atasmu untuk tidak menyembah selain-Nya, serta memerintahkan untuk berbuat baik kepada kedua orang tua terutama ketika mereka telah berusia lanjut. Jika salah seorang diantara keduanya atau kedua-duanya telah berusia lanjut dalam pemeliharaanmu, maka janganlah sekali-kali engkau mengeluh dari mereka dengan kata-kata yang menyakiti mereka, dan jangan pula membentak dan berkata kasar kepada keduanya, namun ucapkanlah kepada mereka perkataan baik yang penuh lembut dan santun."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "23-24. Dalam surat yang agung ini Allah menyampaikan hukum-hukum yang bijaksana dan adab-adab yang mulia: Allah memerintahkan hamba-hamba-Nya agar tidak menyembah selain Allah, dan memerintahkan agar berbuat baik kepada kedua orang tua dalam perkataan dan perbuatan; apabila keduanya atau salah satu dari mereka telah berusia senja maka janganlah sekali-kali menghardik mereka meski hanya dengan kalimat ‘ah’, atau berbuat buruk kepada mereka dan membentak mereka dengan kasar. Perlakukanlah mereka dengan lembut dan berkatalah kepada mereka dengan perkataan yang baik dan halus. Perlakukan mereka dengan penuh kasih sayang serta doakanlah mereka agar senantiasa mendapat rahmat dari Allah sebagai balasan bagi mereka yang telah mengasuhmu ketika masih kecil."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "23. وَقَضَىٰ رَبُّكَ (Dan Tuhanmu telah memerintahkan) Yakni Allah memerintahkan dengan perintah yang tegas agar mengesakan-Nya dalam ibadah. وَبِالْوٰلِدَيْنِ إِحْسٰنًا ۚ (dan hendaklah kamu berbuat baik pada ibu bapakmu dengan sebaik-baiknya) Kemudian Allah mengkhususkan penyebutan keadaan orang tua ketika telah lanjut usia karena ketika itu mereka sangat membutuhkan kebaktian dari seorang anak, dengan firman-Nya: إما يبلغن عندك الكبر أحدهما أو كلاهما إِمَّا يَبْلُغَنَّ (jika telah berumur lanjut) Yakni apabila mereka telah mencapai umur yang telah lanjut. عِندَكَ الْكِبَرَ أَحَدُهُمَآ أَوْ كِلَاهُمَا (salah seorang di antara keduanya atau kedua-duanya sampai berumur lanjut dalam pemeliharaanmu) Yakni dalam tanggunganmu. فَلَا تَقُل لَّهُمَآ أُفٍّ(maka sekali-kali janganlah kamu mengatakan kepada keduanya perkataan “ah”) Yakni kalimat atau suara yang menunjukkan rasa kesal dan berat. وَلَا تَنْهَرْهُمَا(dan janganlah kamu membentak mereka) Makna (النهر) yakni cacian dan sikap kasar. Yakni janganlah kamu berbicara dengan keduanya dengan suara yang membentak di hadapan keduanya. وَقُل لَّهُمَا (dan ucapkanlah kepada mereka) Sebagai ganti dari rasa kesal dan bentakan tersebut. قَوْلًا كَرِيمًا (perkataan yang mulia) Yakni perkataan yang lembut dan penuh kasih sayang, dengan menggunakan ungkapan yang paling baik dan paling lembut dan penuh adab dan rasa hormat."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1. { إِمَّا يَبْلُغَنَّ عِنْدَكَ الْكِبَرَ } perhatikan penisbatan zhorf \"عندك\" dalam kalimat ini, ini menunjukkan akan tanggung jawab yang besar seorang anak terhadap kedua orangtuanya sekalipun mereka berada di rumah yang berbeda, atau bahkan jika keduanya tinggal di kota atau negara yang berbeda dengan sang anak maka berbakti kepada keudanya tetap menjadi kewajiban anak. 2. Saat kedua orangtua mencapai masa tua mereka hal dibutuhkan olehnya adalah pelayanan khusus, diantara yang paling mereka butuhkan adalah pelayanan yang dapat menggantikan masa-masa muda mereka tatkala kekuatan masih sempurna, oleh karena itu mereka begitu antusias menunggu respon baik dan pelayanan yang baik dari anak-anaknya. 3. Ibnu ‘Aqîl berkata: sebaik-baik prasangkaku kepada Tuhanku adalah, bahwasanya kelembutan-Nya berwasiat agar aku berbuat demikian ketika kedua orangtuaku beranjak tua, Dia berfirman: { فَلَا تَقُلْ لَهُمَا أُفٍّ } \"maka sekali-kali janganlah kamu mengatakan kepada keduanya perkataan \"ah\""
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "23. Wahai manusia, Allah telah memberikan perintah yang mutlak dan ketentuan agar kalian tidak menyembah kecuali hanya kepada Allah, dan sebaiknya kalian berbuat baik kepada kedua orang tua secara sempurna, jika salah satu atau keduanya telah sampai pada umur yang seharusnya kamu jaga dan pelihara. Janganlah menyakiti keduanya dengan memberi penderitaan terkecil (sekalipun) seperti mengucapkan kata (Uffin) yang menunjukkan pada kemalasan atau keberatan hati. janganlah memperingatkan keduanya dengan kasar, dan ucapkanlah perkataan yang indah dan halus kepada keduanya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Tuhanmu telah memerintahkan} memerintahkan dan mewajibkan {agar kalian jangan menyembah kecuali hanya kepadaNya dan hendaklah berbuat baik kepada orang tua. Jika salah seorang di antara keduanya atau kedua-duanya sudah mencapai usia lanjut maka janganlah kamu mengatakan kepada keduanya perkataan “ah” dan janganlah membentak keduanya} dan janganlah mencaci keduanya {serta ucapkanlah kepada keduanya perkataan yang baik"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "23. Ketika Allah melarang perbuatan syirik, maka Dia memerintahkan untuk bertauhid, seraya berfirman, “Dan Rabbmu telah memerintahkan,” dengan ketetapan agama dan memerintahkan dengan perintah syar’I (yang berhubungan dengan mahabbah Allah terhadap perintah tersebut. Pent) “janganlah kalian menyembah,” siapa pun dari penduduk bumi ataupun langit, yang masih hidup maupun yang sudah mati “kecuali kepadaNya,” karena Diaa-lah Mahatunggal, Maha Esa dan Satu, tempat bergantung, yang memiliki semua sifat kesempurnaan, (dan memiliki sifat) paling agung di antara sifat-sifat yang sempurna itu dalam bentuk tingkatan yang tidak ada satu makhluk pun yang menyerupaiNYa. Dia-lah Pemberi nikmat lahiriyah dan batiniyah, Dzat yang mampu menolak semua siksaan, Yang Menciptakan, Pemberi rizki dan Pengatur segala urusan. Dia Esa dengan segala sifat itu. Adapun selain Allah, maka tidak ada yang memiliki sedikit pun dari sifat-sifat tersebut. Setelah menyebutkan hak-hakNya, Allah kemudian menyebutkan masalah pelaksanaan hak kedua orang tua dengan FirmanNya, “Dan hendaklah kamu berbuat baik pada ibu bapakmu dengan sebaik-baiknya,” maksudnya berbuatlah kebaikan kepada orang tua dengan segala bentuk kebaktian yang bersifat perkataan ataupun perbuatan. Hal ini dikarenakan mereka merupakan penyebab munculnya seseorang di dunia ini. Mereka mempunyai rasa kecintaan dan keinginan berbuat baik serta kedekatan kepada anak yang menorehkan tuntutan semakin kuatnya haknya mereka dan semakin wajibnya berbakti kepada mereka. “Jika salah seorang di antara keduanya atau kedua-duanya sampai berumur lanjut dalam pemeiharaanmu,” maksudnya apabila keduanya telah memasuki usiaa (lanjut), saat kekuatan mereka mulai melemah, dan membutuhkan sikap kelembutan dan baik dalam kadar yang sudah semestinya “maka sekali-kali janganlah kamu mengatakan kepada keduanya perkataan, Ah.” Ini adalah bentuk gangguan yang paling ringan, Allah memperingatkan dengan bentuk gangguan ini terhadap jenis gangguan lain (yang lebih besar). Pengertiannya, janganlah kamu menyakiti keduanya dengan gangguan sekecil apa pun, “dan janganlah kamu membentak mereka,” maksudnya janganlah menggertak dan berkata kepada keduanya dengan kata-kata yang kasar. “Dan ucapkanlah kepada mereka perkataan yang mulia,” dengan ungkapan yang mereka sukai dengan penuh sopan santun, dengan omongan yang lemah lembut nan elok, yang menyejukkan hati dan menentramkan jiwa mereka. Semuanya itu disesuaikan dengan situasi dan kondisi serta masa."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (وَقَضَىٰ رَبُّكَ) wa qadhaa rabbuk : memerintahkan dan mewasiatkan. (وَبِٱلۡوَٰلِدَيۡنِ إِحۡسَٰنًاۚ) wa bil waalidaini ihsaanaa : yaitu berbuat baiklah kepada kedua orang tua kalian, dengan berbakti kepada keduannya. (فَلَا تَقُل لَّهُمَآ أُفّٖ) falaa taqullahumaa uff : yaitu perkataan; celaka, buruk, dan rugi. (وَلَا تَنۡهَرۡهُمَا) wa laa tanharhumaa : janganlah engkau membentak mereka dengan perkataan yang keras. (قَوۡلٗا كَرِيمٗا) qaulan kariimaa : yang baik dan lembut. Makna ayat: Ketika Allah telah mengharamkan syirik dan rasul-Nya telah melarangnya, dengan firman-Nya “Janganlah engkau mengadakan tuhan yang lain di samping Allah, nanti engkau menjadi tercela dan terhina.” Allah memerintahkan kepada tauhid “Dan Rabbmu telah memerintahkan...” menetapkan, menyuruh, dan mewasiatkan “agar kamu jangan menyembah selain Dia...” jangan kalian beribadah kecuali hanya kepada Allah ‘azza wa jalla. Firman-Nya ta’ala “dan hendaklah berbuat baik kepada kedua orang tua...” Allah mewasiatkan untuk berbuat baik dan berbakti kepada ibu dan bapak, dengan memberikan kebaikan kepada mereka, melindungi mereka dari gangguan, mentaati keduanya selama bukan kemaksiatan kepada Allah ta’ala. Firman-Nya ta’ala “Jika salah seorang di antara keduanya atau kedua-duanya sampai berusia lanjut dalam pemeliharaanmu, maka sekali-kali jangalah engkau mengatakan “ah” atau membentak keduanya...” jika kedua orang tuamu atau salah satu dari mereka baik ibu atau ayah telah mencapai usia lanjut, dan engkau hidup dan tinggal bersama keduanya, maka engkau wajib berbakti kepada keduanya sebagaimana dahulu mereka membantu engkau tatkala kecil, mencuci air seni keduanya, membersihkan najis yang ada pada mereka, memberikan apa yang mereka butuhkan, serta tidak merasa berat dan enggan dalam membantu keduanya. Sebagaimana yang telah mereka lakukan kepadamu tatkala engkau kecil, engkau buang air kecil atau besar, mereka pun membersihkan dan mencucinya tanpa ada rasa berat atau enggan. Firman-Nya ta’ala “Janganlah engkau membentak keduanya...” janganlah engkau mengucapkan kalimat yang keras dan lantang “dan ucapkanlah kepada keduanya perkataan yang baik.” Indah, santun, dan lembut, dengan penuh kesantunan dan penghormatan kepada keduanya. Pelajaran dari ayat: • Wajib hanya beribadah kepada Allah semata dan berbakti kepada orang tua, yaitu dengan berbuat baik kepada keduanya, melindungi mereka dari keburukan, serta mentaati keduanya dalam perkara yang baik. • Wajib mendoakan ampunan dan rahmat untuk kedua orang tua."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 23: Setelah Allah melarang perbuatan syirk dalam ayat sebelumnya, maka di ayat ini, Allah Subhaanahu wa Ta'aala memerintahkan kita untuk mentauhidkan-Nya. Karena Dia Mahaesa, Dia memiliki semua sifat sempurna, sifat yang dimiliki-Nya adalah sifat yang paling agung; yang tidak mirip dengan seorang pun dari makhluk-Nya, Dia yang memberikan segala nikmat dan menghindarkan segala bencana, Dia yang mencipta, Dia yang memberi rezeki, dan Dia yang mengatur segala urusan, Dia sendiri saja dalam semua itu. Oleh karena itu, hanya Dia yang berhak disembah. Dengan berbagai bentuk perbuatan ihsan, baik yang berupa perkataan maupun perbuatan. Kata-kata “Ah” adalah perbuatan menyakiti orang tua yang paling ringan. Jika mengucapkan kata Ah kepada orang tua tidak diperbolehkan, apalagi mengucapkan kata-kata atau memperlakukan mereka dengan yang lebih kasar dari itu. Yakni perkataan yang dicintai keduanya serta menenteramkan hati keduanya, dan hal ini disesuaikan dengan keadaan, kebiasaan dan zaman."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 23",
    "description": "Setelah menjelaskan penggolongan manusia menjadi dua golongan; ada yang menghendaki kehidupan dunia saja dan ada yang menghendaki kehidupan akhirat di samping kehidupan dunia, kelompok ayat ini selanjutnya menjelaskan tatakrama pergaulan antar manusia dalam kehidupannya. Ayat ini menyatakan, dan tuhanmu telah menetapkan dan memerintahkan agar kamu wahai sekalian manusia jangan menyembah selain dia dan hendaklah berbuat baik kepada ibu bapakmu dengan sebaikbaiknya. Jika salah seorang di antara keduanya atau kedua-duanya sampai berusia lanjut dan mereka berada dalam pemeliharaanmu, maka sekalikali janganlah kamu menyakiti keduanya, misalnya dengan mengatakan kepada keduanya perkataan ah, yakni perkataan yang mengandung makna kemarahan atau kejemuan, dan janganlah engkau membentak keduanya jika mereka merepotkan kamu atau berbuat sesuatu yang kamu tidak menyukainya, dan ucapkanlah kepada keduanya perkataan yang mulia, yakni perkataan yang baik, yang mengandung penghormatan dan kasih sayang. Selanjutnya Allah menyatakan, dan rendahkanlah dirimu terhadap keduanya dengan penuh kasih sayang karena rasa hormat yang tulus kepada keduanya, dan ucapkanlah, yakni berdoalah, wahai tuhanku, yang maha pengasih, maha penyayang, sayangilah keduanya, karena mereka berdua telah mendidik aku waktu kecil dengan penuh kasih sayang."
  }
]