[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan bersikaplah kepada ibu-ibu dan bapak-bapakmu dengan merendah dan tawadhu sebagai bentuk sayang kepada mereka, dan mohonlah kepada tuhanmu agar berkenan menyayangi mereka berdua dengan rahmatNya yang luas semasa mereka masih hidup maupun setelah wafat, sebagaimana mereka dahulu bersabar dalam mendidikmu semasa masih kecil, yang tak berdaya lagi tak punya kekuatan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. Dan rendahkanlah dirimu terhadap keduanya dengan penuh rasa kasih sayang, dan katakanlah, \"Wahai Tuhanku! Sayangi dan rahmatilah keduanya karena mereka berdua telah bersusah payah membina dan memeliharaku sewaktu kecil."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "24. وَاخْفِضْ لَهُمَا جَنَاحَ الذُّلِّ مِنَ الرَّحْمَةِ (Dan rendahkanlah dirimu terhadap mereka berdua dengan penuh kesayangan) Asal dari ungkapan ini diambil dari perilaku burung jika ingin memeluk anaknya untuk mengasuh dan mengasihinya maka ia akan merendahkan sayapnya. Seakan-akan Allah berfirman kepada seorang anak “peliharalah kedua orang tuamu dengan mendekatkan dirimu dan tunduklah pada mereka. وَقُل رَّبِّ ارْحَمْهُمَا كَمَا رَبَّيَانِى صَغِيرًا (dan ucapkanlah: “Wahai Tuhanku, kasihilah mereka keduanya, sebagaimana mereka berdua telah mendidik aku waktu kecil”) Yakni dengan kasih sayang seperti kasih sayang mereka ketika mengasuhku. Atau maknanya adalah kasihilah mereka sebab mereka telah mengasuhku."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "24. Dan tunjukkanlah ketundukkan dan kerendah hatian kepada keduanya untuk menambahkan kasih sayangmu kepada keduanya. Dan berdoalah: “Wahai Tuhanku kasihilah keduanya (orang tuaku) dan sayangilah keduanya sebagaimana keduanya menyayangi dan mendidikku saat masih kecil”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tundukkanlah dirimu terhadap keduanya dengan penuh kasih sayang} tunduk dan merendahlah kepada keduanya {dan ucapkanlah,“Wahai Tuhanku, kasihilah keduanya sebagaimana mereka berdua mendidik aku pada waktu kecil”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "24. “Dan rendahkanlah dirimu terhadap mereka berdua dengan penuh kesayangan,” maksudnya, rendah dirilah kepada mereka berdua dalam rangka menghinakan diri, ungkapan sayang dan berharap pahala (dari Allah), bukan lantaran takut atau mengharap sesuatu dari mereka atau kepentingan-kepentingan lain yang tidak mendatangkan pahala bagi seseorang. “Dan ucapkanlah, ‘Wahai Rabbku, kasihilah mereka keduanya’ ,” maksudnya mintakanlah rahmat bagi keduanya, baik mereka masih hidup ataupun sudah meninggal, sebagai balasan atas pembinaan terhadapmu yang mereka lakukan di kala kamu masih kecil. Dari ayat ini, bisa dipahami, bahwasanya semakin besar pendidikan yang diberikan orang tua kepada anak, semakin besar pula hak orang tua itu (atas anaknya). Begitu pula orang yang menangani pendidikan keagamaan dan keduniaan seorang anak dengan cara yang baik, selain kedua orang tuanya, maka dia memiliki hak yang menjadi kewajiban anak yang dia didik dengan sebaik-baiknya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (جَنَاحَ ٱلذُّلِّ) janaahadz dzull : berlemah lembutlah dan merendahlah di sisi mereka berdua. Makna ayat: Firman-Nya ta’ala “Dan rendahkanlah dirimu terhadap keduanya dengan penuh kasih sayang...” berlemah lembutlah kepada keduanya, berkasih sayang, dan perhatian kepada mereka. Selalu doakan ampunan dan rahmat untuk keduanya selama hidupmu, jika keduanya adalah orang yang bertauhid dan wafat di atasnya berdasarkan firman-Nya ta’ala “Tidak pantas bagi Nabi dan orang-orang yang beriman memohonkan ampunan kepada Allah bagi orang-orang musyrik sekalipun orang-orang itu kaum kerabatnya...” Inilah makna dari firman-Nya ta’ala “Dan ucapkanlah “Wahai Rabbku! Sayangilah keduanya sebagaimana mereka berdua telah medidik aku pada waktu kecil.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 24: Karena hendak mencari pahala, bukan karena takut atau berharap sesuatu dari keduanya, dan maksud-maksud lain yang tidak berpahala. Di waktu mereka hidup atau sudah meninggal. Dari ayat ini dapat dipahami, bahwa jika pendidikan yang diberikan banyak, maka semakin bertambah pula haknya. Oleh karena itu, orang yang mendidik seseorang dalam urusan agama dan dunianya dengan pendidikan yang baik selain kedua orang tuanya, maka dia memiliki hak terhadap orang yang dididik. Orang yang dididik perlu mendoakan kebaikan kepadanya, karena melalui pendidikan darinya, ia memperoleh banyak pengetahuan dan pengalaman."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 24",
    "description": "Selanjutnya Allah menyatakan, dan rendahkanlah dirimu terhadap keduanya dengan penuh kasih sayang karena rasa hormat yang tulus kepada keduanya, dan ucapkanlah, yakni berdoalah, wahai tuhanku, yang maha pengasih, maha penyayang, sayangilah keduanya, karena mereka berdua telah mendidik aku waktu kecil dengan penuh kasih sayang. Dalam keadaan kedua orang tua sudah berumur lanjut dan berada dalam pemeliharaanmu, boleh jadi suatu waktu engkau berbuat kesalahan, secara tidak sengaja atau karena terpaksa. Dalam keadaan demikian itu, ketahuilah bahwa tuhanmu lebih mengetahui apa yang ada dalam hatimu; jika kamu orang-orang yang baik dan tulus mengasihi kedua orang tuamu dan berbakti kepada keduanya dengan sepenuh hatimu. Mohonlah ampun kepada tuhanmu, maka sungguh, dia maha pengampun bagi orang-orang yang bertobat dan menyertainya dengan berbuat kebaikan."
  }
]