[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tuhan kalain (wahai manusia) lebih mengetahui apa yang ada di hati sanubari kalian, yang baik maupun yang buruk. Bila keinginan dan tujuan kalian adalah mengharap keridhaan Allah dan apa saja yang mendekatkan diri kalian kepadaNya, Sesungguhnya Dia mahapengampunorang-orang yang mau kembali kepadaNya di sepanjang waktu. Maka brangsiapa yang Allah mengetahui tidak ada di hatinya selain kembali kepada Allah dengan bertaubat (inabah) dan cinta kepadaNya, sesungguhnya Allah akan memaafkannya dan mengampuni dosa-dosaa kecil yang muncul darinya yang terjadi akibat sifat tabiat manusiawinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "25. Wahai manusia! Tuhan kalian lebih mengetahui apa yang ada dalam hati kalian berupa sifat ikhlas dalam beribadah, beramal kebajikan, dan berbakti kepada kedua orang tua, sebab jika niat ibadah dan pergaulan baik dengan orang tua atau selain mereka berdua baik maka Dia sungguh Maha Pengampun atas orang-orang yang senantiasa memohon tobat dan ampunan pada-Nya. Sehingga barangsiapa yang bertobat dari kelalaiannya sebelumnya dalam ketaatan terhadap Tuhannya, dan kebaktiannya terhadap orang tuanya niscaya Allah mengampuninya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "25. Hai Manusia, Tuhan kalian Maha Mengetahui kebaikan dan keburukan yang ada dalam diri kalian. Jika kalian menginginkan kebaikan dalam berbakti kepada orang tua kalian, akan tetapi yang terjadi adalah apa yang tidak kalian inginkan bukan karena kesengajaan dari kalian, maka Allah akan mengampuni hal itu dan tidak akan menyiksa kalian karenanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "25. رَّبُّكُمْ أَعْلَمُ بِمَا فِى نُفُوسِكُمْ ۚ (Tuhanmu lebih mengetahui apa yang ada dalam hatimu) Yakni tentang ada tidaknya rasa ikhlas dalam hatimu ketika menjalankan segala ketaatan, serta mengetahui tentang kebaktian kalian kepada kedua orang tua atau kedurhakaan. إِن تَكُونُوا۟ صٰلِحِينَ (jika kamu orang-orang yang baik) Dan dosa yang kalian telah bertaubat darinya tidak akan memberi mudharat kepada kalian. فَإِنَّهُۥ كَانَ لِلْأَوّٰبِينَ غَفُورًا (maka sesungguhnya Dia Maha Pengampun bagi orang-orang yang bertaubat) Yakni bagi orang-orang yang telah meninggalkan dosa-dosa dengan bertaubat darinya. Dan barangsiapa yang bertaubat maka Allah akan menerima taubatnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "25. Tuhan kalian mengetahui apa yang ada dalam hati kalian berupa keikhlasan dan hal lain dalam hal ketaatan, jika kalian adalah orang-orang yang taat kepada Allah dan bermaksud untuk berbuat baik. Dan jika kalian melakukan kesalahan dalam memberi hak keduanya misalnya, lalu kalian bertaubat, maka sesungguhnya Allah itu Maha Pengampun bagi dosa-dosa hamba-hambaNya yang bertaubat dan kembali untuk berbuat taat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tuhan kalian lebih mengetahui apa yang ada dalam diri kalian. Jika kalian adalah orang-orang shalih, sesungguhnya Dia bagi orang-orang yang bertaubat itu} bagi orang-orang yang kembali kepadaNya untuk bertaubat {Maha Pengampun"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "25. Maksudnya, Rabb kalian mengetahui semua rahasia yang kalian sembunyikan yang berbentuk kebaikan dan keburukan. Dia tidak semata-mata melihat tindak tanduk dan rupa fisik kalian, Dia hanyalah memandang apa yang ada dalam hati, berupa kebaikan dan keburukan “jika kamu orang-orang yang baik,” dengan menjadikan hasrat dan orientasi-orientasi kalian berkisar pada keridhaan Allah, kesukaan kalian tertuju pada obyek yang bisa mendekatkan diri kepada Allah, dan tidak ada keinginan-keinginan yang mengendap dalam hatinya untuk selain Allah. “Sesungguhnya Dia bagi orang-orang yang bertaubat,” yaitu orang-orang yang senantiasa kembali kepada Allah di segala waktunya “Maha Pengampun.” Maka siapa saja yang telah Allah lihat (dalam) hatinya, dan Dia mengetahui tidak ada di dalamnya selain (kerinduan) kembali dan kecintaan kepadaNya serta mencintai segala sesuatu yang bisa mendekatkan kepadaNya, maka –sekalipun terkadang muncul pada dirinya efek (keterlenaan) yang berasal dari sifat-sifat manusiawinya-, sesungguhnya Allah akan memaafkannya dan mengampuni perkara-perkara yang insidentil, yang bukan permanen."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (كَانَ لِلۡأَوَّٰبِينَ غَفُورٗا) kaana lilawwaabiini : orang-orang yang kembali taat setelah ia bermaksiat. Makna ayat: Dan firman-Nya ta’ala “Rabbmu lebih mengetahui apa yang ada dalam hatimu, jika kamu orang yang baik, maka sungguh, dia Maha Pengampun kepada orang yang bertobat.” Allah ta’ala mengabarkan bahwa Dia lebih mengetahui tentang diri kita dibanding kita sendiri, barang siapa yang memendam ketidakridhaan kepada kedua orang tuannya serta marah kepada keduanya, maka Allah Maha Mengetahui itu. Barang siapa yang menyimpan kecintaan kepada keduanya, penghormatan, serta ridha dengan mereka, Allah ta’ala Maha Mengetahui dan akan membalasnya. Orang yang baik akan dibalas dengan kebaikan sedangkan orang yang jahat akan dibalas dengan keburukan. Firman-Nya ta’ala “Jika kamu orang yang baik, maka sungguh, Dia Maha Pengampun kepada orang yang bertobat.” Karena kelemahan manusia, terkadang seseorang memendam keinginan buruk kepada kedua orang tuanya atau terlintas dalam dirinya keburukan berupa perkataan atau perbuatan, sedangkan dia adalah orang yang saleh menunaikan hak-hak Allah ta’ala, hak-hak orang tuanya, serta hak-hak manusia. Maka Allah mengabarkan bahwa Dia Maha Pengampun kepadanya jika ia bertaubat beristighfar dan menyesal dari perbuatan itu. Pelajaran dari ayat: • Wajib merasa diawasi oleh Allah dan tidak boleh menyimpan suatu keburukanpun dalam hati. • Barang siapa yang saleh, lalu terlintas pada dirinya sesuatu yang buruk, lalu ia bertaubat darinya, maka Allah akan mengampuninya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 25: Berupa menyembunyikan rasa berbakti atau tidak, dan perkara yang baik atau yang buruk. Dia tidak memperhatikan rupamu, akan tetapi memperhatikan hati dan amalmu. Yakni taat kepada Allah, atau harapanmu adalah keridhaan Allah serta perhatianmu tertuju kepada hal yang dapat mendekatkan dirimu kepada Allah Subhaanahu wa Ta'aala dan memasukkanmu ke dalam surga-Nya. Yakni orang yang banyak kembali kepada Allah di setiap waktu. Dia mengampuni sikap kurang mereka dalam memenuhi hak kedua orang tua, seperti sikap kurang sabar, dsb. yang timbul dari tabi’at kemanusiaan. Demikian pula mengampuni perkara-perkara kurang baik yang terkadang timbul selama tidak terus menerus."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 25",
    "description": "Dalam keadaan kedua orang tua sudah berumur lanjut dan berada dalam pemeliharaanmu, boleh jadi suatu waktu engkau berbuat kesalahan, secara tidak sengaja atau karena terpaksa. Dalam keadaan demikian itu, ketahuilah bahwa tuhanmu lebih mengetahui apa yang ada dalam hatimu; jika kamu orang-orang yang baik dan tulus mengasihi kedua orang tuamu dan berbakti kepada keduanya dengan sepenuh hatimu. Mohonlah ampun kepada tuhanmu, maka sungguh, dia maha pengampun bagi orang-orang yang bertobat dan menyertainya dengan berbuat kebaikan. Dan berikanlah haknya kepada keluarga-keluarga yang dekat, dari pihak ibu maupun bapak, berupa bantuan, kebajikan, dan silaturahim. Demikian juga kepada orang miskin dan orang yang dalam perjalanan, berikanlah zakat yang diwajibkan atas kamu, sedekah yang dianjurkan atau bantuan lainnya yang diperlukan, dan janganlah kamu menghamburhamburkan hartamu secara boros dengan membelanjakannya pada halhal yang tidak ada kemaslahatan."
  }
]