[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan berbuat baiklah kepada orang-orang yang masih terkait hubungan kekerabatan denganmu, dan berilah ia haknya dalam bentuk kebaikan dan bakti dan berilah orang miskin yang tidak memiliki sesuatu yang mencukupinya dan menutupi kebutuhannya, musafir yang terasing dari keluarga dan kehabisan bekal harta. Dan janganlah engkau belanjakan hartamu dalam urusan selain ketaatan kepada Allah atau secara berlebihan dan boros."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "26. Wahai orang yang beriman! Berikanlah hak kerabat dekatmu berupa ikatan silaturahmi, juga berilah bantuan kepada orang miskin yang membutuhkan, dan orang yang kehabisan bekal dalam perjalanan, dan janganlah sekali-kali menggunakan hartamu dalam kemaksiatan, atau menghambur-hamburkannya secara boros."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "26-27. Allah memerintahkan untuk menunaikan hak-hak para kerabat berupa kebaikan bagi mereka, dan menunaikan hak orang-orang miskin yang membutuhkan, dan musafir yang jauh dari keluarga dan hartanya. Dan janganlah memboroskan hartamu demi menuruti hawa nafsu, karena orang-orang yang memboroskan harta tanpa alasan yang benar seperti setan-setan yang selalu membelanjakan harta di dalam kebatilan. Sungguh setan sangat mengingkari kenikmatan-kenikmatan yang telah Allah berikan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "26. وَءَاتِ ذَا الْقُرْبَىٰ (Dan berikanlah kepada keluarga-keluarga yang dekat) Yakni berilah orang-orang yang dekat denganmu secara nasab. حَقَّهُۥ (akan haknya) Yakni hak disambungnya silaturrahim yang Allah perintahkan. وَالْمِسْكِينَ(kepada orang miskin) Yakni orang fakir yang tidak mampu lagi mencari penghidupan. وَابْنَ السَّبِيلِ (dan orang yang dalam perjalanan) Yakni orang yang kehabisan bekal dalam perjalanan. Yang dimaksud dengan bersedekah kepada mereka adalah sedekah sunnah atau sedekah wajib (zakat). وَلَا تُبَذِّرْ تَبْذِيرًا (dan janganlah kamu menghambur-hamburkan (hartamu) secara boros) Yakni berlebih-lebihan dalam membelanjakan harta meski untuk hal yang halal, dan membelanjakan harta untuk hal yang haram meski hanya sedikit."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "26. Berilah kerabatmu hak-haknya berupa kebaikan dan silaturahmi. Dan berilah orang yang membutuhkan itu haknya berupa zakat, juga orang yang kehabisan bekal dalam perjalanannya. Sedekahkanlah kepada mereka sedekah nafilah ketika membutuhkan. Dan janganlah kamu menafkahkan harta benda kepada selain tempat yang disarankan oleh syariat. Hal itu melewati batas yang telah dipertimbangkan oleh syariat dalam urusan infak yang halal dan infak kepada selain yang berhak. Ayat ini diturunkan terkait nasihat kepada orang-orang itu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Berikanlah} berikanlah {kepada kerabat dekat haknya, dan orang miskin, dan orang yang dalam perjalanan. Janganlah menghambur-hamburkan (hartamu) secara boros} dan janganlah berlaku terlalu boros"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "26-27. Allah berfirman, “Dan berikanlah kepada keluarga-keluarga yang dekan akan haknya,” berupa perbuatan baik dan mulia, yang wajib ataupun yang sunnah. Hak tersebut berbeda-beda tergantung dengan situasi dan kondisi, kedekatan kekerabatan, sisi atau tidaknya keterdesakan, dan (perbedaan) masa, “dan kepada orang miskin.” Berikanlah haknya kepadanya berupa zakat atau pemberian lainnya supaya kemiskinannya terentaskan “dan orang yang dalam perjalanan,” yaitu orang asing lagi jauh dari kampung halamannya (yang kehabisan bekal), mereka semua diberi bagian harta dengan cara yang tidak menimbulkan bahaya bagi si pemberi dan tidak melebihi ukuran yang sewajarnya. Karena hal ini termasuk pemborosan. Allah melarang pemborosan dan mengabarkan, bahwa sesungguhnya para pemboros itu “adalah saudara-saudara setan,” karena setan tidak mengajak kecuali kepada setiap perangai yang tercela. Maka ia membujuk manusia untuk bersifat bakhil dan pelit. Apabila tidak berhasil, maka ia mengajaknya kea rah pemborosan. Paddahal, Allah memerintahkan dan memuji sikap paling adil dan seimbang, sebagaimana yang diungkapkan dalam FirmanNya tentang sifat-sifat Ibadurrahman al-Abrar (para hamba Allah Dzat Yang Maha Pengasih yang bersifat baik). \"Dan orang-orang yang apabila membelanjakan (harta), mereka tidak berlebihan, dan tidak (pula) kikir, dan adalah (pembelanjaan itu) di tengah-tengah antara yang demikian.\" (Al-FurQan:67)"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (وَءَاتِ ذَا ٱلۡقُرۡبَىٰ) wa aati dzal qurbaa : berikanlah hak-hak kerabat, seperti perlakuan baik dan silaturahmi. (ٱلسَّبِيلِ وَلَا تُبَذِّرۡ تَبۡذِيرًا) wa laa tubadzdzir tabdziiraa : janganlah engkau belanjakan hartamu untuk selain ketaatan kepada Allah dan rasul-Nya. Makna ayat: Firman-Nya ta’ala “Dan tunaikanlah haknya kepada kerabat dekat, juga kepada orang miskin dan orang yang dalam perjalanan...” Ini adalah perintah Allah kepada hamba-Nya yang beriman agar mereka menunaikan hak-hak kerabat mereka berupa memberikan kebaikan atau bersilaturahmi, begitu pula orang-orang miskin yang fakir yang dirundung kekurangan serta menjadi rendah karena miskin. Allah ta’ala memerintahkan orang beriman untuk memberikan hak-hak mereka dengan berbuat baik, memberikan pakaian, makanan, dan perkataan yang baik. Begitu pula dengan orang yang berada di perjalanan; musafir, yaitu dengan memberikannya jamuan, membantu perjalanannya—jika dibutuhkan—serta memberikannya keamanan dan petunjuk jalan tujuannya. Firman-Nya ta’ala “Dan janganlah engkau menghambur-hamburkan hartamu secara boros.” Janganlah engkau menggunakan hartamu pada perkara yang bukan ketaatan kepada Allah ta’ala. Pelajaran dari ayat: • Wajib memberikan hak-hak kerabat berupa kebaikan dan silaturahmi, begitu kepada orang-orang miskin dan musafir. • Haram menghamburkan harta, yaitu menggunakannya untuk bermaksiat dan hal yang diharamkan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 26: Haknya berbeda-beda tergantung keadaan, kedekatan, kebutuhan dan waktu. Dengan disambung silaturrahimnya dan dimuliakan. Dengan diberikan zakat dan sedekah untuk mengurangi kemiskinannya Yang kehabisan bekal, lalu diberikan bantuan namun tidak sampai memadharratkan si pemberi, dan pemberian yang diberikan hendaknya tidak melebihi kebutuhannya, karena jika demikian akan termasuk ke dalam tabdzir (pemborosan). Seperti mengeluarkannya untuk selain ketaatan kepada Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 26",
    "description": "Dan berikanlah haknya kepada keluarga-keluarga yang dekat, dari pihak ibu maupun bapak, berupa bantuan, kebajikan, dan silaturahim. Demikian juga kepada orang miskin dan orang yang dalam perjalanan, berikanlah zakat yang diwajibkan atas kamu, sedekah yang dianjurkan atau bantuan lainnya yang diperlukan, dan janganlah kamu menghamburhamburkan hartamu secara boros dengan membelanjakannya pada halhal yang tidak ada kemaslahatan. Allah mencela perbuatan membelanjakan harta secara boros, dengan menyatakan, sesungguhnya orang-orang yang pemboros itu adalah saudara setan, mereka berbuat boros dalam membelanjakan harta karena dorongan setan, oleh karena itu, perilaku boros termasuk sifat setan, dan setan itu adalah sangat ingkar kepada nikmat dan anugerah tuhannya."
  }
]