[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang yang melakukan pemborosan dan membelanjakan hartanya dalam maksiat kepada Allah mereka itu menyerupai setan-setan dalam hal keburukan, kerusakan dan maksiat. Dan setan itu sangat banyak kufurnya dan keras pengingkarannya terhadap nikmat tuhannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "27. Sesungguhnya orang-orang yang menggunakan harta mereka dalam kemaksiatan, dan orang-orang yang menghambur-hamburkannya secara boros adalah saudara-saudara setan, mereka mentaati segala apa yang diperintahkan para setan tersebut berupa sikap boros dan menghambur-hamburkan harta, padahal setan itu sangat ingkar kepada Tuhannya, ia tidak beramal kecuali dengan amalan maksiat, dan tidak pula memerintahkan kecuali dengan perintah yang mengundang kemurkaan Tuhannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "27. إِنَّ الْمُبَذِّرِينَ كَانُوٓا۟ إِخْوٰنَ الشَّيٰطِينِ ۖ (Sesungguhnya pemboros-pemboros itu adalah saudara-saudara syaitan) Dan berlebih-lebihan dalam membelanjakan harta merupakan bagian dari godaan setan, sehingga jika ada orang yang melakukannya maka ia telah mentaati dan mengikuti setan. وَكَانَ الشَّيْطٰنُ لِرَبِّهِۦ كَفُورًا(dan syaitan itu adalah sangat ingkar kepada Tuhannya) Yang tidak berbuat kecuali keburukan dan tidak menyuruh kecuali menyuruh untuk berbuat keburukan. Dan orang yang menghambur-hamburkan harta adalah orang yang sangat ingkar terhadap nikmat Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "27. Sesungguhnya orang-orang yang boros adalah pasangan (saudara) setan karena pemborosan itu termasuk godaan setan. Dan setan itu sangat kufur atas nikmat-nikmat Tuhannya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya orang-orang yang boros itu adalah saudara-saudara setan} orang-orang yang menyerupai setan dalam berbuat boros dan kerusakan {dan setan itu sangat ingkar kepada Tuhannya} menyangkal nikmat-nikmatnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "26-27. Allah berfirman, “Dan berikanlah kepada keluarga-keluarga yang dekan akan haknya,” berupa perbuatan baik dan mulia, yang wajib ataupun yang sunnah. Hak tersebut berbeda-beda tergantung dengan situasi dan kondisi, kedekatan kekerabatan, sisi atau tidaknya keterdesakan, dan (perbedaan) masa, “dan kepada orang miskin.” Berikanlah haknya kepadanya berupa zakat atau pemberian lainnya supaya kemiskinannya terentaskan “dan orang yang dalam perjalanan,” yaitu orang asing lagi jauh dari kampung halamannya (yang kehabisan bekal), mereka semua diberi bagian harta dengan cara yang tidak menimbulkan bahaya bagi si pemberi dan tidak melebihi ukuran yang sewajarnya. Karena hal ini termasuk pemborosan. Allah melarang pemborosan dan mengabarkan, bahwa sesungguhnya para pemboros itu “adalah saudara-saudara setan,” karena setan tidak mengajak kecuali kepada setiap perangai yang tercela. Maka ia membujuk manusia untuk bersifat bakhil dan pelit. Apabila tidak berhasil, maka ia mengajaknya kea rah pemborosan. Paddahal, Allah memerintahkan dan memuji sikap paling adil dan seimbang, sebagaimana yang diungkapkan dalam FirmanNya tentang sifat-sifat Ibadurrahman al-Abrar (para hamba Allah Dzat Yang Maha Pengasih yang bersifat baik). \"Dan orang-orang yang apabila membelanjakan (harta), mereka tidak berlebihan, dan tidak (pula) kikir, dan adalah (pembelanjaan itu) di tengah-tengah antara yang demikian.\" (Al-FurQan:67)"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (لِرَبِّهِۦ كَفُورٗا) li rabbihii kafuuraa : banyak berbuat kufur dan ingkar kepada nikmat-nikmat Rabbnya ta’ala, begitu pula orang yang menghamburkan harta saudaranya (setan). Makna ayat: Firman-Nya ta’ala “sesungguhnya orang-orang yang pemboros itu adalah saudara setan...” karena mereka menggunakan harta untuk bermaksiat, para pembangkang dari perintah Allah, seperti inilah setan, mereka menyerupainya sehingga menjadi saudara, dan firman-Nya ta’ala “dan setan itu sangat ingkar kepada Rabbnya.” Karena ia telah bermaksiat kepada Allah dan mengkufuri nikmat-Nya, tidak bersyukur kepada-Nya dengan taat kepada-Nya. Adapun orang yang menghamburkan harta untuk bermaksiat, enggan taat kepada Rabbnya, tidak bersyukur atas nikmat-nikmat yang diberikan kepadanya, maka dia adalah setan. Maka apakah seorang hamba yang muslim ridha menjadi setan?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 27: Yakni di atas jalannya, karena setan tidaklah mengajak kecuali kepada perbuatan tercela. Ia mengajak manusia untuk bersikap bakhil atau kikir, ketika manusia menolaknya, maka setan mengajaknya untuk melakukan pemborosan. Sedangkan yang diperintahkan Allah adalah perkara yang adil dan pertengahan lagi terpuji. Yakni kufur kepada nikmat-nikmat-Nya, demikian pula saudaranya yaitu orang yang pemboros."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 27",
    "description": "Allah mencela perbuatan membelanjakan harta secara boros, dengan menyatakan, sesungguhnya orang-orang yang pemboros itu adalah saudara setan, mereka berbuat boros dalam membelanjakan harta karena dorongan setan, oleh karena itu, perilaku boros termasuk sifat setan, dan setan itu adalah sangat ingkar kepada nikmat dan anugerah tuhannya. Kemudian kepada orang yang karena suatu keadaan tidak dapat memberi bantuan kepada orang yang memerlukan, ayat ini memberi tuntunan; dan jika engkau benar-benar berpaling dari mereka, tidak dapat memberikan bantuan kepada keluarga dekat, orang miskin atau orang yang sedang dalam perjalanan, bukan karena engkau enggan membantu tetapi karena keadaanmu pada waktu itu tidak memungkinkan memberi bantuan kepada mereka, dalam arti materi atau sebab-sebab lainnya, maka engkau berpaling dari mereka untuk memperoleh rahmat dari tuhanmu yang engkau harapkan, sehingga suatu waktu engkau dapat membantu mereka jika keadaanmu memungkinkan. Dalam keadaan ini, maka katakanlah kepada mereka ucapan yang pantas, baik, dan memberi harapan, bukan penolakan dengan kata-kata yang kasar."
  }
]