[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan jika kamu berpaling dari memberi kepada orang-orang yang engkau diperintah untuk memberi mereka karena tidak ada yang dapat engkau berikan kepada mereka, karena mengharap rizki yang engkau tunggu dari sisi tuhanmu, maka katakanlah kepada mereka tutur kata yang halus lagi lembut, seperti mendoakan kecukupan dan kelapangan rizki bagi mereka, dan sampaikan janji kepada mereka jika Allah memudahkan rizki dari karunaiNya (bagimu), sesungguhnya engkau akan memberi mereka sebagain dari rizki itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "28. Dan apabila engkau enggan untuk memberi mereka -dikarenakan tidak ada harta yang dapat engkau berikan- sembari menanti adanya rezeki dari Allah, maka cukuplah bagimu untuk mengucapkan kata-kata yang lembut lagi santun kepada mereka, misalnya; engkau mendoakan agar rezeki mereka dilapangkan, atau menjanjikan mereka suatu pemberian bila Allah memberimu harta."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "28. Jika kamu tidak memiliki harta yang dapat kamu berikan kepada orang-orang yang diperintahkan untuk diberi karena kamu masih menunggu rezeki dari Allah, maka katakanlah kepada mereka perkataan yang baik dan lembut ketika meminta maaf karena tidak dapat memberi mereka apapun."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "28. وَإِمَّا تُعْرِضَنَّ عَنْهُمُ (Dan jika kamu berpaling dari mereka) Yakni jika kamu berpaling dari kerabat, orang miskin, dan ibnu sabil karena suatu hal yang menuntut untuk berlaku demikian. ابْتِغَآءَ رَحْمَةٍ مِّن رَّبِّكَ(untuk memperoleh rahmat dari Tuhanmu) Yakni disebabkan karena kamu tidak memiliki rezeki dari Tuhanmu untuk kamu sedekahkan, dan kamu ingin agar Allah memberimu rezeki (agar dapat bersedekah). فَقُل لَّهُمْ قَوْلًا مَّيْسُورًا (maka katakanlah kepada mereka ucapan yang pantas) Yakni perkataan yang lembut dan mudah diterima seperti menjanjikan kepada mereka sedekah di lain waktu atau dengan memohon maklum atas ketidakmampuan memberi sedekah dengan cara yang mudah diterima."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Ayat ini mencontohkan didikan yang baik kepada setiap insan, yakni janganlah kamu berpaling dari mereka dengan cara yang meremehkan mereka dalam hal kekayaan dan kekuatan sehingga kamu menjauh dari mereka, melainkan kamu boleh saja berpaling dari mereka tatkala kesulitan menghadapimu, atau rintangan yang merintangi antara kamu dengannya, dan ketika itu kamu mengharap dari Allah dibukakannya bagimu pintu kemudahan agar dapat bertemu mereka kembali."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "28. Dan jika kamu berpaling dari orang-orang yang disebutkan itu berupa kerabat, orang miskin dan ibnu sabil karena darurat namun malu untuk menolak karena mengharap rejeki yang kamu tunggu-tunggu, sehingga kamu masih ingin memberi mereka, maka katakanlah kepada mereka perkataan yang mudah dicerna dan lembut bahwa kamu akan memberi mereka di waktu yang akan datang. Ayat ini diturunkan terkait setiap orang miskin yang meminta kepada Nabi SAW."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Jika kamu berpaling dari mereka} jika kamu berpaling dari orang-orang yang Aku perintahkan kepadamu untuk memberi mereka rezeki {untuk memperoleh rahmat dari Tuhanmu yang kamu harapkan} menunggu rezeki dari Allah yang kalian tunggu kedatangannya sehingga kamu memberi mereka sebagian dari rezeki itu {maka ucapkanlah kepada mereka perkataan yang lemah lembut} lemah lembut"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "28. Perintah unttuk memberi harta kepada karib-kerabat ini berlaku dalam kondisi mampu dan kecukupan. Adapun dalam kondisi tidak mampu atau sulit memenuhi nafkah harian, maka Allah memerintahkan supaya menolak dengan cara penolakan yang baik. Allah berfirman, “Dan jika kamu berpaling dari mereka untuk memperoleh rahmat dari Rabbmu yang kamu harapkan,” maksudnya kamu menunda untuk memberi mereka di waktu yang lain dengan berharap semoga Allah memudahkan urusannya di waktu tersebut, “maka katakanlah kepada mereka ucapan yang pantas,” maksudnya secara sopan dengan lembut dan menyampaikan janji (bantuan) bila kesempatan datang, dan permohonan maaf karena tidak bisa memberi saat ini, supaya mereka beranjak pergi darimu dengan pikiran yang tenang, sebagaimana kandungan Firman Allah, \"Perkataan yang baik dan pemberian maaf lebih baik dari sedekah yang diiringi dengan sesuatu yang menyakitkan (perasaan si penerima). Allah Maha Kaya lagi Maha Penyantun\" (Al-Baqarah:263) Ini juga salah satu (cerminan) sifat kelembutan Allah terhadap para hambaNya. Dia memerintahkan mereka supaya menunggu-nunggu rahmat dan rizki dariNya. Karena menunggu itu termasuk ibadah. Begitu pula janji mereka untuk memberi sedekah tatkala diberi kelonggaran juga merupakan ibadah yang (bisa dikerjakan) saat itu. Hal ini disebabkan (karena wujud) keinginan untuk berbuat baik adalah satu kebaikan. Oleh karenanya, sebaiknya seseorang itu segera melakukan (kebaikan) yang mampu dia kerjakan, serta berniat untuk melakukan kebaikan yang belum mampu dia jalankan agar dia memperoleh pahala dengannya, dan semoga dengan pengharapannya tersebut, Allah berkenan memudahkannya dalam mengerjakan kebaikan tersebut,"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (وَإِمَّا تُعۡرِضَنَّ عَنۡهُمُ) wa immaa tu’ridhanna ‘anhum : yaitu orang-orang yang telah disebutkan sebelumnya; para kerabat, orang-orang miskin, musafir, lalu engkau tidak memberikan mereka sesuatu. (ٱبۡتِغَآءَ رَحۡمَةٖ مِّن رَّبِّكَ تَرۡجُوهَا) ibtighaa`a rahmatim mir rabbika tarjuuhaa : untuk mencari rezeki yang engkau harapakn dari Allah ta’ala (قَوۡلٗا مَّيۡسُورٗا) qaulam maisuuraa : yang lembut dan ramah, dengan engkau berjanji akan memberi mereka jika telah mempunyai rezeki. Makna ayat: Konteks ayat masih mengenai wasiat-wasiat Allah tabaaraka wa ta’ala yang sekaligus hukum yang telah diwahyukan kepada rasul-Nya agar diikuti dan memperoleh kesempurnaan dan kebahagiaan dengan hukum-hukum itu. Firman Allah ta’ala “Dan jika engkau berpaling dari mereka untuk memperoleh rahmat Rabbmu yang engkau harapkan, maka katakanlah kepada mereka ucapan yang lemah lembut.” Jika engkau berpaling dari kerabatmu, atau orang miskin yang memintamu, atau seorang musafir yang punya kebutuhan, engkau tidak memberikan mereka sesuatu wahai rasul Kami “Maka katakanlah kepada mereka ucapan yang lemah lembut.” Perkataan yang baik dan lembut, dan ini adalah perbautan yang baik, seperti perkataanmu, “Jika Allah memberikan ku rezeki, aku akan memberikanmu” atau “sebentar lagi aku akan mendapatkan ini, kemudian aku akan memberikanmu ini” dan yang sejenisnya yang merupakan janji yang baik. Sehingga itu menjadi pemberian darimu untuk mereka, dan mereka dapat berbahagia dan tidak bersedih. Pelajaran dari ayat: • Janji yang baik dapat berubah menjadi sedekah bagi yang tidak mempunyai apapun untuk disedekahkan kepada orang yang memintanya. • Haramnya bakhil dan berlebihan serta keutamaan pertengahan dan biasa-biasa saja."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 28: Yakni dari kerabatmu, dengan tidak memberi mereka, beralih kepada waktu yang lain yang di sana kamu berharap dimudahkan oleh Allah rezekimu. Hal itu, karena perintah memberi kepada kerabat adalah jika mampu dan kaya, adapun jika tidak mampu atau tidak bisa memberi pada saat itu, maka Allah Subhaanahu wa Ta'aala memerintahkan untuk mengucapkan kata-kata yang lemah lembut. Maksudnya, apabila kamu tidak dapat melaksanakan perintah Allah seperti yang tersebut dalam ayat 26, maka katakanlah kepada mereka perkataan yang baik agar mereka tidak kecewa karena mereka belum mendapat bantuan dari kamu. Dalam keadaan seperti itu, kamu berusaha untuk mencari rezeki (rahmat) dari Tuhanmu, sehingga kamu dapat memberikan kepada mereka hak-hak mereka. Contoh ucapan yang lemah lembut adalah berjanji akan memberikan bantuan kepada mereka ketika ada rezeki. Hal ini termasuk ibadah, karena berniat untuk berbuat baik adalah sebuah kebaikan. Oleh karena itu, sepatutnya seorang hamba melakukan perbuatan baik yang bisa dilakukan dan memiliki niat baik untuk perkara yang belum bisa dilakukan, agar memperoleh pahala terhadapnya dan boleh jadi Allah memudahkannya karena harapan yang ada dalam dirinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 28",
    "description": "Kemudian kepada orang yang karena suatu keadaan tidak dapat memberi bantuan kepada orang yang memerlukan, ayat ini memberi tuntunan; dan jika engkau benar-benar berpaling dari mereka, tidak dapat memberikan bantuan kepada keluarga dekat, orang miskin atau orang yang sedang dalam perjalanan, bukan karena engkau enggan membantu tetapi karena keadaanmu pada waktu itu tidak memungkinkan memberi bantuan kepada mereka, dalam arti materi atau sebab-sebab lainnya, maka engkau berpaling dari mereka untuk memperoleh rahmat dari tuhanmu yang engkau harapkan, sehingga suatu waktu engkau dapat membantu mereka jika keadaanmu memungkinkan. Dalam keadaan ini, maka katakanlah kepada mereka ucapan yang pantas, baik, dan memberi harapan, bukan penolakan dengan kata-kata yang kasar. Dan janganlah engkau jadikan tanganmu terbelenngu pada lehermu, yakni janganlah enggan mengulurkan tanganmu memberikan bantuan kepada orang-orang yang membutuhkan bantuan, dan jangan pula engkau terlalu mengulurkannya, yakni janganlah kamu boros dalam membelanjakan harta, karena itu kamu menjadi tercela karena kekikiranmu, dan menyesal karena keborosanmu dalam membelanjakan harta."
  }
]