[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan janganlah engkau menahan tanganmu dari berinfak di jalan kebaiakan, sebagai tindakan menyempitkan dirimu, keluargamu dan orang-orang yang membutuhkan, dan janganlah pula berlebihan dalam berinfak, hingga engkau memberikan apa yang melebihi kemampuanmu, akibatnya engkau duduk dalam keadaan tercela, orang-orang mencaci dan mencelamu, lagi menyesal atas sikap mubadzirmu dan habisnya hartamu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "29. Dan janganlah menahan tanganmu dari memberi harta, dan jangan melampaui batas dalam memberi, nanti engkau akan dicela oleh manusia lantaran kekikiranmu bila enggan memberi, juga nanti engkau akan menyesal dan berhenti dari memberi lantaran habisnya hartamu yang engkau berikan secara berlebihan karena tidak ada lagi yang dapat engkau berikan setelahnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "29-30. Allah memberi petunjuk kepada orang-orang beriman untuk berinfak sesuai dengan kemampuan dan kebutuhan: “Janganlah kamu menahan tanganmu untuk berinfak di jalan kebaikan dan jangan pula berlebih-lebihan dalam berinfaq sehingga tidak tersisa sedikitpun harta di tanganmu, karena itu akan membuatmu terhina di hadapan Allah dan para makhluk, dan membuatmu menyesal karena telah menghabiskan harta. Sungguh Tuhanmu akan meluaskan rezeki sebagian manusia dan menyempitkan rezeki sebagian lainnya. Allah Maha Mengetahui kemaslahatan bagi hamba-hamba-Nya dan Maha bijaksana dalam membagi rezeki."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "29. وَلَا تَجْعَلْ يَدَكَ مَغْلُولَةً إِلَىٰ عُنُقِكَ وَلَا تَبْسُطْهَا كُلَّ الْبَسْطِ (Dan janganlah kamu jadikan tanganmu terbelenggu pada lehermu dan janganlah kamu terlalu mengulurkannya) Yakni keadaan orang yang pelit adalah seperti keadaan orang yang tangannya terikat di lehernya sehingga tidak dapat menggerakkannya. فَتَقْعُدَ مَلُومًا مَّحْسُورًا(karena itu kamu menjadi tercela dan menyesal) Akibat sikap berlebih-lebihan yang kamu lakukan, kamu tidak dapat mencukupi kebutuhan karena kemiskinan. Dalam ayat ini terdapat bantahan terhadap setiap orang yang berpendapat tentang orang yang menginfakkan seluruh hartanya tanpa menyisakannya sepersepun untuk bekal hari esok."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "29. Janganlah kamu cegah tangan kamu untuk berinfak sebagaimana orang yang membelenggu tangannya di leher, yaitu janganlah kamu pelit. Dan janganlah kamu melebarkan infak kamu sampai terlalu berlebihan sehingga kamu menjadi tercela di sisi Allah dan manusia, serta menjadi orang yang menyesal dan bersedih. Nabi SAW bersabda kepada Aisyah: “berinfaklah secukupnya saja” Kemudian Aisyah berkata: “Kalau begitu tidak ada yang tersisa sedikitpun” Lalu Allah menurunkan ayat {Wa Laa taj’al yadaka…}"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Janganlah menjadikan tanganmu terbelenggu pada lehermu} Jangan menahan tanganmu untuk berinfak dalam kebaikan layaknya tangan yang terbelenggu di lehernya sehingga dia tidak menjulurkannya {dan jangan mengulurkannya secara berlebihan} dan janganlah memberikan infak secara berlebihan sehingga kamu memberi melebihi kemampuanmu {sehingga kamu menjadi} kamu menjadi {tercela} orang-orang mencela dan mengecammu {lagi menyesal} habis tidak memiliki sesuatu apapun di sisimu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "29. Sementara itu, Allah berfirman disini, “Dan janganlah kamu jadikan tanganmu terbelenggu pada lehermu.” Ini adalah ungkapan kiasan bagi orang yang sangat bakhil “dan janganlah kamu terlalu mengulurkannya,” akibatnya, engkau membelanjakannya bukan pada pos yang sepatutnya atau melebihi ukuran yang wajar “karena itu kamu,” apabila kamu melakukan hal itu “menjadi tercela,” maksudnya terkena cacian atas apa yang telah kamu lakukan dan “menyesal,” maksudnya bersedih hati, tangannya hampa, tidak tersisa sedikit pun harta di tangan, dan tidak pula digantikan oleh pujian maupun sanjungan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (مَغۡلُولَةً إِلَىٰ عُنُقِكَ) maghluulatan ilaa ‘unuqik : jangan menahan dari berinfak, seakan-akan tanganmu terikat di lehermu, tidak bisa memberikan apapun. (وَلَا تَبۡسُطۡهَا كُلَّ ٱلۡبَسۡطِ) wa laa tabsuthhaa kullal basth : jangan menginfakkan seluruh apa yang engkau miliki sampai tidak tersisa sama sekali. (فَتَقۡعُدَ مَلُومٗا) fataq’uda maluumaa : orang yang tidak mendapatkan infakmu akan mencelamu. (مَّحۡسُورًا) mahsuuraa : engkau tidak bisa melangsungkan hidup karena tidak punya apa-apa. Makna ayat: Firman-Nya ta’ala “Dan jangan jadikan tanganmu terbelenggu di lehermu...” janganlah engkau bakhil atas apa yang telah Allah ta’ala berikan kepadamu, lalu engkau tidak memberikan hak orang-orang yang membutuhkan, seakan-akan tanganmu terikat di lehermu, tidak bisa memberikan infak. Firman-Nya ta’ala “dan jangan lapangkannya selapang-lapangnya...” jangan engkau buka tanganmu untuk memberi, sampai tidak tersisa apapun di kantungmu atau di perbendaharaanmu untuk dirimu dan keluargamu. Firman-Nya ta’ala “sehingga engkau menjadi tercela dan menyesal.” Jika engkau tidak memberikan orang yang memintamu, engkau akan dicela, adapun jika engkau menginfakkan segala yang engkau punya, lalu engkau tidak bisa melanjutkan kehidupanmu dan sisa umurmu, seperti seekor unta yang telah lelah karena perjalanan, ia tidak mampu melanjutkan perjalanan dan ditinggalkan dengan penuh penyesalan, pemiliknya tidak mampu mengembalikannya kepada keluarganya tidak pula melanjutkan perjalanan menuju tujuan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 29: Ini merupakan kinayah (kiasan) sikap menahan tangannya dari berinfak (terlalu kikir). Seperti mengeluarkan harta untuk hal yang tidak patut atau melebihi dari yang patut. Karena tidak berinfak. Karena terlalu pemurah, sehingga di tanganmu tidak ada harta."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 29",
    "description": "Dan janganlah engkau jadikan tanganmu terbelenngu pada lehermu, yakni janganlah enggan mengulurkan tanganmu memberikan bantuan kepada orang-orang yang membutuhkan bantuan, dan jangan pula engkau terlalu mengulurkannya, yakni janganlah kamu boros dalam membelanjakan harta, karena itu kamu menjadi tercela karena kekikiranmu, dan menyesal karena keborosanmu dalam membelanjakan harta. Sebab utama sifat kikir manusia adalah karena takut terjerumus ke dalam kemiskinan. Ayat ini mengingatkan bahwa sungguh, tuhanmu melapangkan rezeki bagi siapa yang dia kehendaki untuk dilapangkan rezekinya dan menyempitkannya kepada siapa yang dia kehendaki untuk disempitkan rezekinya; sesungguhnya dia maha mengetahui segala sesuatu, maha melihat akan hamba-hambanya. Dia memberikan kepada hamba-Nya segala sesuatu yang menjadi kebutuhan dan kemaslahatannya apabila ia menjalani sebab-sebab untuk mendapatkannya."
  }
]