[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai keturunan orang-orang yang telah kami selamatkan mereka dan kami bawa mereka bersama-sama dengan Nuh di dalam kapal, janganlah kalian menyekutukan Allah dalam beribadah kepadaNya. Jadilah kalian manusia-manusia yang bersyukur atas nikmat-nikmatNya dan meneladani Nuh . Sebab sesungguhnya dia adalah hamba yang sangat bersyukur kepada Allah dengan sepenuh hati, lisan dan anggota-anggota tubuhnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Kalian (Bani Israil) berasal dari keturunan orang-orang yang Kami limpahkan kepada mereka nikmat keselamatan bersama Nuh -'alaihissalām- dari azab tenggelam dalam badai gelombang. Maka ingatlah selalu nikmat keselamatan ini, dan bersyukurlah kepada Allah -Ta'ālā- atasnya dengan cara memurnikan ibadah dan ketaatan hanya kepada-Nya, serta teladanilah sikap Nuh yang senantiasa banyak bersyukur kepada Allah -Ta'ālā-."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "3. Allah memberi dorongan kepada keturunan Nabi Nuh dan orang-orang beriman yang selamat dari banjir bandang, agar menyembah-Nya Semata dan mensyukuri segala kenikmatan-Nya; karena Nabi Nuh adalah hamba yang selalu bersyukur kepada Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. ذُرِّيَّةَ مَنْ حَمَلْنَا مَعَ نُوحٍ ۚ ((yaitu) anak cucu dari orang-orang yang Kami bawa bersama-sama Nuh) Yakni Wahai para keturunan dari orang-orang yang Kami selamatkan bersama Nabi Nuh dalam perahu. Allah mengingatkan mereka dengan kejadian pada zaman nabi Nuh sebab ketika itu tidak ada penolong kecuali Allah. إِنَّهُۥ كَانَ عَبْدًا شَكُورًا(Sesungguhnya dia adalah hamba (Allah) yang banyak bersyukur) Allah menyebut Nabi Nuh dengan sebutan hamba yang banyak bersyukur sebagai dorongan bagi keturunannya agar mereka senantiasa bersyukur kepada Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Janganlah kalian mengambil penolong lain selain Aku wahai keturunan orang yang Kami tampung di atas bahtera bersama Nuh supaya tidak tenggelam. Sesungguhnya Nuh itu hamba yang banyak bersyukur dan selalu memuji Allah SWT dalam segala kondisi yang dialaminya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Keturunan} keturunan {orang yang Kami bawa bersama Nuh, sesungguhnya dia adalah hamba yang banyak bersyukur”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3. “(Yaitu) anak cucu dari orang-orang yang Kami bawa bersama-sama Nuh,” maksudnya “Wahai anak cucu dari orang-orang yang telah Kami beri anugerah dan Kami angkut bersama Nuh.” “Sesungguhnya dia adalah hamba (Allah) yang banyak bersyukur,” pada ayat ini terkandung keterangan pemuliaan terhadap Nabi Nuh yang berbentuk pujian, lantaran beliau telah menjalankan kewajibannya untuk bersyukur kepada Allah dan telah menyandang sifat tersebut. (Di dalamnya juga terkandung) anjuran bagi keturunannya untuk menapaki jalan hidup dengan mengaca kepada beliau dalam bersyukur (kepada Allah), serta (perintah) supaya mereka selalu mengingat nikmat-nikmat Allah bagi mereka tatkala Allah menjadikan mereka tetap survive dan menempatkan mereka di bumi sebagai khalifah serta menenggelamkan selain mereka, (kaum yang tidak beriman)."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (مَنۡ حَمَلۡنَا) man hamalnaa : di dalam kapal. Makna ayat: Firman-Nya “Wahai anak cucu yang Kami bawa bersama Nuh...” Wahai keturunan yang telah Kami bawa bersama Nuh, bersyukurlah kepada-Ku sebagaimana Nuh telah bersyukur kepada-Ku atas keselamatan yang telah-Ku berikan kepadanya dan para pengikutnya ketika di dalam perahu, “Sesungguhnya dia...” yaitu Nuh “adalah hamba yang banyak bersyukur.” Maka jadilah kalian sepertinya, bersyukurlah kepada-Ku dengan beribadah kepada-Ku, mentauhidkan-Ku, jangalah kalian tinggalkan ketaatan dan janganlah kalian membuat sekutu untuk-Ku. Pelajaran dari ayat: • Wajib bersyukur kepada Allah ta’ala atas nikmat-nikmat-Nya, karena Nuh ‘alaihis salam jika memakan sebuah makanan ia berkata, Alhamdulillah, jika minum ia berkata, Alhamdulillah, ketika mengenakan sepatu, Alhamdulillah, ketika selesai menunaikan hajat, beliau berucap, Alhamdulillah. Oleh karena itu ia disebut sebagai hamba yang banyak bersyukur, begitu pula Rasulullah dan orang-orang shaleh dari umat ini sampai saat ini."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 3: Dalam kapal. Lagi memuji-Nya dalam setiap keadaan. Di ayat ini, Allah Subhaanahu wa Ta'aala meninggikan namanya dan memujinya karena syukurnya kepada Allah Subhaanahu wa Ta'aala. Demikian pula mendorong keturunannya agar mengikutinya dengan bersyukur dan mengingat nikmat Allah, karena Dia telah menyelamatkan mereka, menjadikan mereka sebagai khalifah di bumi dan menenggelamkan yang lain."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 3",
    "description": "Wahai keturunan dari orang yang kami bawa bersama nuh, yaitu orangorang yang diselamatkan Allah dari bencana banjir, jadikanlah nenek moyangmu, yaitu nabi nuh sebagai teladan bagimu, sesungguhnya dia adalah hamba Allah yang banyak bersyukur atas nikmat yang dianugerahkan Allah kepadanya. Maka bersyukurlah kamu sekalian atas nikmat diutusnya rasul kepadamu, sebagaimana mereka mensyukuri nikmat yang dianugerahkan Allah kepadanya. Allah menganugerahkan kepada bani israil kitab taurat agar menjadi petunjuk, tetapi mereka enggan berpedoman padanya. Dan telah kami tetapkan terhadap bani israil, yakni anak-cucu nabi yakub, melalui wahyu yang kami turunkan kepada nabi musa yang termaktub dalam kitab itu, yakni taurat, bahwa kamu pasti akan membuat kerusakan di muka bumi ini, yakni baitul maqdis, sebanyak dua kali, tetapi Allah tidak segera menjatuhkan siksa kepadamu, dan dengan demikian pasti kamu akan menyombongkan diri dengan kesombongan yang besar."
  }
]