[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya tuhanmu melapangkan rizki bagi sebagian manusia dan menyempitkannya bagi sebagian yang lain, sejalan dengan ilmu dan hikmah Allah .Sesungguhnya Dia maha mengetahui rahasia-rahasia para hambaNya, tidak ada yang tersembunyi dari ilmuNya sesuatu yang kecil pun dari kondisi-kondisi mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "30. Sungguh, Tuhanmu melapangkan rezeki bagi siapa saja yang Dia kehendaki, dan menyempitkannya bagi siapa saja yang Dia kehendaki untuk suatu hikmah yang besar. Sungguh Dia Maha Mengetahui lagi Melihat hamba-hamba-Nya, tidak ada satu urusan mereka yang tersembunyi dari-Nya, sehingga Dia bisa menentukan apa saja terhadap urusan mereka sekehendak-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "30. إِنَّ رَبَّكَ يَبْسُطُ الرِّزْقَ لِمَن يَشَآءُ وَيَقْدِرُ ۚ (Sesungguhnya Tuhanmu melapangkan rezeki kepada siapa yang Dia kehendaki dan menyempitkannya) Yakni melapangkan rezeki kepada sebagian orang dan menyempitkan rezeki sebagian yang lain sesuai dengan hikmah Allah yang dalam. خَبِيرًۢا بَصِيرًا (Maha Mengetahui lagi Maha Melihat) Tidak ada yang tersembunyi bagi-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "30. Sesungguhnya Tuhanmu meluaskan rejeki orang yang dikehendakiNya dan menyempitkan orang yang dikehendakiNya sesuai kebijaksanaanNya yang ditujukan untuk kebaikan para hamba. Sesungguhnya Allah SWT Maha Mengetahui setiap sesuatu, sehingga Dia memberi rejeki hamba-hambaNya sesuai kemaslahatan mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya Tuhanmu melapangkan} melapangkan {rezeki bagi siapa saja yang Dia kehendaki dan menyempitkannya} menyempitkan {Sesungguhnya Dia Maha Mengetahui lagi Maha Melihat hamba-hambaNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "30. Kemudian Allah memberitahukan bahwasanya Allah “melapangkan rizki kepada siapa yang Dia kehendaki,” dari hamba-hambaNya, menakdirkan dan menyempitkannya atas siapa yang dikehendakiNya sebagai bentuk hikmah dariNya. “Sesungguhnya Dia Maha Mengetahui lagi Maha Melihat akan hamba-hambaNya,” maka Allah membalas mereka dengan balasan yang baik bagi mereka menuruut pandanganNya, serta mengatur mereka dengan kelembutan dan kemuliaanNYa."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (يَبۡسُطُ ٱلرِّزۡقَ لِمَن يَشَآءُ وَيَقۡدِرُۚ) yabsuthur rizqa limay yasyaa`u wa yaqdir : meluaskan, dan menyempitkan rezeki sebagai ujian. Makna ayat: Firman-Nya ta’ala “Sesungguhnya Rabbmu yang melapangkan rezeki kepada yang Dia kehendaki...” melapangkannya kepada yang Dia kehendaki sebagai ujian, apakah ia bersyukur atau mengingkari, dan menyempitkan rezeki bagi yang Dia kehendaki sebagai cobaan, apakah ia bersabar atau malah murka. “Sesungguhnya Dia kepada hamba-hamba-Nya, Maha Teliti Maha Melihat.” Oleh karena itu Dia melapangkan dan menyempitkan rezeki sesuai dengan ilmu dan hikmah-Nya, karena ada sebagian dari hamba-Nya yang tidak tahan kecuali dengan kelapangan, dan ada yang tidak tahan kecuali dengan kesempitan. Pelajaran dari ayat: • Jelasnya hikmah Allah ta’ala dalam meluaskan dan menyempitkan rezeki hamba-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 30: Dia mengetahui batin dan zahir mereka, oleh karenanya Dia akan membalas mereka dengan sesuatu yang cocok bagi mereka dan mengatur mereka dengan kelembutan dan kemurahan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 30",
    "description": "Sebab utama sifat kikir manusia adalah karena takut terjerumus ke dalam kemiskinan. Ayat ini mengingatkan bahwa sungguh, tuhanmu melapangkan rezeki bagi siapa yang dia kehendaki untuk dilapangkan rezekinya dan menyempitkannya kepada siapa yang dia kehendaki untuk disempitkan rezekinya; sesungguhnya dia maha mengetahui segala sesuatu, maha melihat akan hamba-hambanya. Dia memberikan kepada hamba-Nya segala sesuatu yang menjadi kebutuhan dan kemaslahatannya apabila ia menjalani sebab-sebab untuk mendapatkannya. Kemudian Allah melarang kaum muslim membunuh anak-anak mereka seperti yang dilakukan beberapa suku dari kaum arab jahiliyah. Allah berfirman, dan janganlah kamu membunuh anak-anakmu karena takut kemiskinan akan menimpa mereka. Kamilah yang akan memberi rezeki kepada mereka, bukan kamu yang memberi rezeki kepada mereka, dan kami juga yang memberi rezeki kepadamu. Janganlah kamu mencemaskan mereka karena kemiskinan, maka oleh sebab itu kamu membunuhnya. Membunuh mereka itu sungguh suatu dosa yang besar."
  }
]