[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apabila kalian telah mengetahui bahwa rizki itu di tangan Allah , maka janganlah kalain wahai manusia membunuh anak-anak kalian lantaran rasa takut terhadap kemiskinan, karena sesungguhnya Dialah Allah yang maha pemberi rizki bagi hamba-hambaNya, Dia memberi rizki kepada anak-anak sebagiamana memberi rizki kepada orangtua. Sesungguhnya membunuh anak-anak merupakan perbuatan dosa besar."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "31. Dan janganlah kalian membunuh anak-anak kalian karena takut miskin jika menafkahi mereka, sebab Kami lah yang bertanggungjawab memberi rezeki pada mereka, dan juga pada kalian, karena membunuh mereka merupakan suatu dosa besar, terlebih mereka tak berdosa dan tidak pula ada alasan yang mengharuskan pembunuhan itu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "31. Dan janganlah kalian membunuh anak-anak kalian karena takut jatuh miskin, padahal rezeki kalian adalah tanggung jawab Kami dan bukan tanggung jawab kalian. Sungguh pembunuhan terhadap anak-anak itu adalah dosa yang besar."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "31. خَشْيَةَ إِمْلٰقٍ ۖ (takut kemiskinan) Allah melarang mereka untuk membunuh anak mereka sendiri karena takut miskin. Dan ini merupakan perbuatan yang dahulu mereka lakukan. نَّحْنُ نَرْزُقُهُمْ وَإِيَّاكُمْ ۚ( Kamilah yang akan memberi rezeki kepada mereka dan juga kepadamu) Dan kalian bukanlah orang yang memberi anak-anak itu rezeki sehingga kalian memperlakukan mereka demikian. خِطْـًٔا كَبِيرًا (suatu dosa yang besar) Yakni dosa yang besar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "31. Dan janganlah kalian membunuh anak-anak kalian karena takut fakir, sebagaimana yang dilakukan sebagian orang-orang bodoh. Kami memberi rejeki anak-anak kalian juga diri kalian. Dan kalian bukanlah pemberi rejeki. Dan yang berlalu di sini adalah rejeki anak, karena sesungguhnya pembunuhan itu dilakukan karena takut fakir dengan adanya mereka. Dan yang berlalu dalam urusan binatang ternak adalah rejeka bapak karena pembunuhan itu karena kefakiran bapak. Sesungguhnya pembunuhan mereka itu adalah dosa besar (agung)"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Janganlah membunuh anak-anak kalian karena takut miskin} fakir {Kamilah yang memberi rezeki kepada mereka dan (juga) kepadamu. Sesungguhnya membunuh mereka itu adalah suatu dosa} dosa {yang besar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "31. Ini adalah bentuk kasih sayang Allah terhadap hambaNya, lantaran Dia lebih saying kepada mereka dibandingkan dua orang tua mereka. Oleh sebab itu, Dia melarang orang tua untuk membunuh anak-anak mereka (hanya) karena takut kemiskinan. Allah-lah yang menanggung rizki mereka semua. Allah mengabarkan bahwasanya “membunuh mereka adalah suatu dosa yang besar,” maksudnya termasuk dosa-dosa yang paling besar, dikarenakan telah sirnanya rasa kasih sayang dari hati, kedurhakaan yang besar, serta kenekatan membunuh anak yang belum pernah berbuat dosa dan tidak pernah bermaksiat."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (خَشۡيَةَ إِمۡلَٰقٖۖ) khasyyata imlaaq : takut kefakiran dan kesulitan. (خِطۡ‍ٔٗا كَبِيرٗا) khith`an kabiiraa : dosa yang besar. Makna ayat: Firman-Nya ta’ala “Janganlah engkau membunuh anak-anakmu karena takut miskin...” karena takdir yang telah ditetapkan Allah, kemudian Allah mewasiatkan “janganlah kalian membunuh anak-anak kalian...” anak yang belum baligh “karena takut miskin...” khawatir akan kemiskinan dan kekurangan. Karena dahulu kaum Arab mengubur hidup-hidup anak perempuan karena takut celaan, dan membunuh anak laki-laki—begitu pula perempuan—karena takut kemiskinan. Maka Allah mewasiatkan mereka untuk tidak melakukan hal itu, dan Dia berfirman berjanji dan menanggung rezeki anak-anak dan ayah-ayah mereka firman-Nya ta’ala “Kamilah yang memberikan mereka rezeki begitu pula kalian...” Allah ta’ala mengabarkan bahwa membunuh anak “adalah kesalahan yang besar.” Dosa besar, lalu bagaimana hal ini dilakukan oleh seorang mukmin. Pelajaran dari ayat: • Haram membunuh anak setelah ia lahir atau menggugurkannya karena takut miskin dan malu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 31: Hal ini termasuk rahmat-Nya kepada hamba-hamba-Nya, di mana Dia lebih sayang kepada mereka daripada ibu-bapak mereka. Dia melarang orang tua membunuh anaknya karena takut miskin, dan Dia menjanjikan akan memberi rezeki. Karena hal itu menandakan sudah hilangnya rasa kasihan dalam hatinya, dan lagi anak-anak mereka sama sekali tidak memiliki kesalahan dan dosa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 31",
    "description": "Kemudian Allah melarang kaum muslim membunuh anak-anak mereka seperti yang dilakukan beberapa suku dari kaum arab jahiliyah. Allah berfirman, dan janganlah kamu membunuh anak-anakmu karena takut kemiskinan akan menimpa mereka. Kamilah yang akan memberi rezeki kepada mereka, bukan kamu yang memberi rezeki kepada mereka, dan kami juga yang memberi rezeki kepadamu. Janganlah kamu mencemaskan mereka karena kemiskinan, maka oleh sebab itu kamu membunuhnya. Membunuh mereka itu sungguh suatu dosa yang besar. Dan janganlah kamu mendekati zina dengan melakukan perbuatan yang dapat merangsang atau menjerumuskan kepada perbuatan zina; sesungguhnya zina itu adalah suatu perbuatan yang keji, yang mendatangkan penyakit dan merusak keturunan, dan suatu jalan yang buruk yang menyebabkan pelakunya disiksa dalam neraka."
  }
]