[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan janganlah kalian mendekati perzinaan dan segala pemicunya, supaya kalian tidak terjerumus ke dalamnya. Sesungguhnya zina itu benar-benar amat buruk, dan seburuk-buruk tindakan adalah perzinaan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "32. Dan jauhilah perbuatan zina, serta jauhilah segala sesuatu yang bisa mengantarkan padanya, karena zina adalah amalan paling keji dan jalan yang sangat buruk lantaran akibatnya berupa ketidakjelasan nasab anak hasil zina dan azab Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "32. Dan jauhilah kekejian perbuatan zina dan segala yang dapat menjerumuskan kepada perbuatan itu. Sungguh perbuatan zina adalah perbuatan yang sangat buruk, dan seburuk-buruk jalan adalah jalan yang mengantarkan kepada perzinaan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "32. وَلَا تَقْرَبُوا۟ الزِّنَىٰٓ ۖ (Dan janganlah kamu mendekati zina) Yakni dengan melakukan hal-hal yang menjerumuskan ke dalam perbuatan zina. Dan ini merupakan larangan melakukan perbuatan zina secara tidak langsung karena zina lebih berat dosanya. إنه كان فاحشة (sesungguhnya zina itu adalah suatu perbuatan yang keji) Yakni perbuatan yang sangat buruk. وَسَآءَ سَبِيلًا (Dan suatu jalan yang buruk) Sebab perbuatan ini menjerumuskan pelakunya ke dalam neraka, dan menyebabkan ketidak jelasan hubungan nasab."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "32. Dan janganlah kalian mendekati zina dan sesuatu yang membuka jalan untuk zina, karena zina itu adalah perbuatan buruk yang sudah jelas keburukannya, dan itu merupakan seburuk-buruk jalan karena mengakibatkan masuk neraka, percampuran nasab dan penyakit, penyakit berbahaya dan menodai kehormatan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Janganlah mendekati zina. Sesungguhnya zina itu adalah perbuatan keji} perbuatan keji yang dilarang karena keburukannya {dan seburuk-buruk} seburuk-buruk {jalan} jalan dan lintasan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "32. Larangan dari mendekati perzinaan itu lebih mengena dibandingkan sekedar larangan dari melakukannya. Karena larangan (mendekati zina) itu mencakup semua foreplay dan faktor penyulutnya. Sesungguhnya barangsiapa yang mengitari sekitar daerah larangan, niscaya hampir-hampir dia terjerumus di dalamnya. Terutama dalam perkara ini, yang pada kebanyakan jiwa manusia terdapat dorongan nafsu yang sangat kuat ke arahnya. Allah mengemukakan perzinaan dan potret buruknya , bahwasanya ia adalah “suatu perbuatan yang keji” maksudnya dosa yang keji dalam sudut pandangan syariat, akal dan fitrah, lantaran memuat pelanggaran terhadap kehormatan pada hak Allah, hak wanita tersebut, hak istri atau suaminya, merusak kesucian hubungan rumah tangga, mencampur adukkan nasab dan kerusakan-kerusakan yang lainnya. Dan Firman Allah, “Dan suatu jalan yang buruk,” maksudnya seburuk-buruk jalan adalah jalan orang-orang yang lancang melakukan dosa besar ini."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (فَٰحِشَةٗ وَسَآءَ سَبِيلٗا) faahisyataw wa saa`a sabiilaa : perilaku yang amat sangat buruk dan seburuk-buruk jalan. Makna ayat: Firman-Nya ta’ala “Dan jangan dekat zina, sungguh itu adalah perbuatan keji dan seburuk-buruk jalan.” Di antara yang Allah tetapkan dan wasiatkan, adalah larangan untuk mendekati—wahai orang-orang yang beriman—zina, walau hanya sekedar mendekati belum melakukannya. Karena zina dalam hukum Allah adalah sebuah perbuatan keji, kelakuan yang sangat buruk tidak dapat bisa diterima oleh tabiat, akal, dan syariat. Dan jalan yang dapat mengantarkan kepada zina adalah seburuk-buruknya jalan yang dapat memberikan efek negatif dan merusak di antaranya, yang pertama: merusak kehormatan kaum mukminin dan yang terakhir: adalah Jahanam, serta dibakar dengan panasnya, dan menetap di dalamnya untuk waktu yang lama. Pelajaran dari ayat: • Haram melakukan hal yang dapat mengantar kepada zina seperti: memandang dengan syahwat, berbicara dengan perempuan asing, dan menyentuhnya. Serta haramnya zina, dan ini lebih ditekankan lagi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 32: Larangan mendekati lebih dalam daripada larangan melakukan, karena hal ini menunjukkan dilarang pula segala yang mengantarkan kepadanya. Yakni perkara yang dianggap keji baik oleh syara’, akal maupun fitrah manusia, karena di dalamnya terdapat sikap berani terhadap larangan yang terkait dengan hak Allah, hak wanita, hak keluarganya atau suaminya, merusak kasur, mencampuradukkan nasab dan mafsadat lainnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 32",
    "description": "Dan janganlah kamu mendekati zina dengan melakukan perbuatan yang dapat merangsang atau menjerumuskan kepada perbuatan zina; sesungguhnya zina itu adalah suatu perbuatan yang keji, yang mendatangkan penyakit dan merusak keturunan, dan suatu jalan yang buruk yang menyebabkan pelakunya disiksa dalam neraka. Dan janganlah kamu membunuh jiwa yang diharamkan Allah membunuhnya, kecuali dengan suatu alasan yang benar, misalnya atas dasar menjatuhkan hukum qisas. Dan barang siapa dibunuh secara zalim, bukan karena sebab yang bersifat syariat, maka sesungguhnya kami telah memberi kekuasaan kepada ahli warisnya, untuk menuntut kisas atau meminta ganti rugi kepada pembunuhnya, atau memaafkannya, tetapi janganlah ahli waris itu melampaui batas dalam membunuh, yakni dalam menuntut membunuh apalagi melakukan pembunuhan dengan main hakim sendiri. Sesungguhnya ia adalah orang yang mendapat pertolongan dari sisi Allah dengan ketetapan hukum-Nya yang adil."
  }
]