[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan janganlah kalian membunuh jiwa yang Allah haramkan untuk dibunuh kecuali dengan alasan syar’I, seperti melalui qishah atau merajam pezina yang telah menikah atau membunuh orang murtad. Dan barangsiapa dibunuh tanpa alasan yang kuat, maka Kami telah jadikan bagi walinya, baik ahli warisnya atau penguasa untuk menuntut hukum bunuh terhadap pelaku atau menuntut pembayaran diyat. Dan tidak boleh bagi ahli waris korban untuk melampaui batas ketentuan Allah dalam melakukan qishos seperti membunuh dua orang atau kebih hanya gara-gara membunuh satu orang atau tindakan memutilasi sipembunuh. Sesungguhnya Allah menjadi penolong bagi wali korban pembunuhan untuk menghadapi pembunuh hingga mampu membunuhnya melalui hukum qishash."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "33. Dan janganlah kalian membunuh orang yang diharamkan jiwanya oleh Allah, baik karena keimanannya atau adanya perjanjian damai dengannya, kecuali jika ia memang berhak dibunuh karena murtad, berzina setelah menikah, atau karena kisas. Barangsiapa dibunuh secara zalim tanpa ada alasan yang membolehkan pembunuhannya, maka Kami memberikan kuasa pada wali dari kalangan ahli warisnya atas pembunuhnya, ia boleh menuntut untuk kisas terhadap si pembunuh tersebut, memberinya maaf tanpa ada tebusan apapun, atau memberinya maaf dengan mensyaratkan tebusan diyat. Dan ia tidak boleh melampaui batasan yang dibolehkan oleh Allah seperti memutilasi tubuh pembunuh, membunuhnya dengan cara yang tidak benar, atau membunuh orang yang bukan pembunuhnya, karena sesungguhnya sang wali tersebut adalah orang yang mendapat dukungan dan pertolongan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "33. Dan janganlah kalian membunuh jiwa yang Allah haramkan untuk dibunuh, tanpa alasan yang sesuai syariat seperti orang yang murtad, orang yang membunuh dengan sengaja, dan orang berzina yang telah menikah. Dan barangsiapa yang dibunuh secara zalim tanpa alasan yang dibolehkan syariat, maka Kami telah memberi kewenangan bagian ahli warisnya yang paling dekat untuk menegakkan qishash terhadap si pembunuh dengan pengawasan hakim, atau mengambil harta diyat, atau juga dengan mengampuni si pembunuh tersebut. Maka janganlah kalian melanggar syariat ini dengan membunuh selain pelaku pembunuhan itu atau dengan melakukan qishash dengan cara mutilasi. Sungguh wali orang yang terbunuh telah mendapat pertolongan dengan hukum-hukum yang adil ini."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "33. وَلَا تَقْتُلُوا۟ النَّفْسَ الَّتِى حَرَّمَ اللهُ (Dan janganlah kamu membunuh jiwa yang diharamkan Allah) Yakni jiwa yang Allah lindungi dengan perlindungan agama atau perjanjian. إِلَّا بِالْحَقِّ ۗ (melainkan dengan suatu (alasan) yang benar) Yakni sesuatu yang menjadikan dibolehkannya pembunuhan terhadap seseorang seperti kemurtadan, perbuatan zina yang dilakukan orang yang telah menikah, dan qishash atas orang yang membunuh dengan sengaja dan tidak memiliki hak untuk membunuh. وَمَن قُتِلَ مَظْلُومًا (Dan barangsiapa dibunuh secara zalim) Yakni tidak disebabkan hal-hal dibolehkannya pembunuhan secara syariat. فَقَدْ جَعَلْنَا لِوَلِيِّهِۦ(maka sesungguhnya Kami telah memberi kepada ahli warisnya) Yakni ahli waris yang menjadi wali dalam urusannya. سُلْطٰنًا(kekuasaan) Makna (السلطان) yakni kekuasaan atas si pembunuh, ia boleh membunuh atau memaafkan pembunuh tersebut, atau meminta diyat kepadanya. فَلَا يُسْرِف فِّى الْقَتْلِ ۖ (tetapi janganlah ahli waris itu melampaui batas dalam membunuh) Yakni maka janganlah memotong-motong (mutilasi) tubuh pembunuh atau mengazabnya, atau membunuh orang yang tidak membunuh keluarganya itu. إِنَّهُۥ كَانَ مَنصُورًا(Sesungguhnya ia adalah orang yang mendapat pertolongan) Yakni wali terbunuh tersebut mendapat pertolongan dan bantuan. Sebab Allah memerintahkan para penguasa untuk menolong wali terbunuh agar dapat mengambil haknya secara sempurna."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "33. Dan janganlah kalian jiwa yang diharamkan oleh Allah untuk menyakitinya karena melindungi agama atau suatu janji kecuali pembunuhan yang dibenarkan, seperti menentang agama, zinah muhson, hukum qishash bagi pembunuh berencana dan pembunuh yang melakukan pembunuhan tidak sesuai syariat. Dan sungguh Kami telah memberikan kewenangan bagi ahli waris terdekat orang yang dibunuh atas orang yang membunuh, yaitu Jika berkehendak dia meminta agar pembunuh tersebut dibunuh sesuai keadilan dan ketentuan hakim atau dimaafkan atau meminta uang tebusan. Lalu sebaiknya ahli waris itu tidak melebihi batas yang telah disyariatkan dengan membunuh orang selain pembunuh tersebut atau membunuh banyak orang atau menganiaya dan menyiksa pembunuh tersebut. Sesungguhnya dia atau ahli waris itu didukung dan diberi bantuan dari Allah dan hakim dengan memberikannya pilihan untuk memberikan hukuman qishash yang adil"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Janganlah membunuh orang yang diharamkan Allah, kecuali dengan suatu (alasan) yang benar} kecuali salah satu dari tiga, yaitu kufur setelah beriman, berbuat zina setelah menikah, dan membunuh seseorang yang tidak berdosa dengan sengaja {Siapa yang dibunuh secara teraniaya, sungguh Kami telah memberi kepada walinya} orang yang mengurusa perkara orang yang terbunuh yaitu pewaris dan hakim {kekuasaan} memiliki kuasa atas orang yang membunuh. {Akan tetapi, janganlah dia melampaui batas} Janganlah dia melampaui batas yang sudah disyariatkan {dalam pembunuhan (qisas). Sesungguhnya dia adalah orang yang mendapat pertolongan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "33. Ini mencakup setiap jiwa yang Allah haramkan untuk membunuhnya, baik berupa anak kecil maupun orang dewasa, pria maupun wanita, orang merdeka ataupun budak belian, baik Muslim maupun kafir yang memiliki perjanjian “kecuali dengan suatu (alasan) yang benar,” seperti orang yang membunuh jiwa lain (tanpa alasan benar), orang yang berbuat zina yang telah menikah, orang yang meninggalkan agama dan berpisah dari jamaah kaum Muslimin (murtad), serta penjahat saat mellangsungkan kejahatannya, yang tidak bisa diatasi kecuali dengan dibunuh. “Dan barangsiapa dibunuh secara zhalim,” maksudnya tanpa alasan yang benar, “maka sesungguhnya Kami telah memberi kepada ahli warisnya,” keluarga dan ahli waris yang terdekat dengannya “kekuasaan,” maksudnya alasan kuat untuk menuntut qishash (hukum balas) kepada si pembunuh. Dan Kami juga telah menetapkan kekuasaan berdasarkan takdir baginya untuk melangsungkannya. Hal ini bisa dilakukan tatkala syarat-syarat yang mengharuskan penegakan hukum qishash telah terpenuhi, seperti kesengajaan, permusuhan, dan kesetaraan. “Tetapi janganlah ahli waris itu melampaui batas,” maksudnya walinya (jangan melampaui batas) “dalam membunuh. Sesungguhnya ia adalah orang yang mendapat pertolongan,” makna ‘al-israf’ adalah melampaui batas, baik dengan cara memutilasi jasad pembunh, membunuh dengan cara yang berbeda, atau membunuh selain pelaku. Dalam ayat ini terdapat dalil yang menunjukkan bahwasanya pemilik hak qishash adalah wali korban. Maka si pembunuh tidak diqishash kecuali dengan izinnya. Apabila wali korban memaafkan si pembunuh, maka gugurlah hukum qishash. Allah menolong wali korban (untuk menuntut) si pembunuh dan orang yang membantunya, hingga wali korban dapat berkesempatan untuk membunuh si pembunuh."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (لِوَلِيِّهِۦ سُلۡطَٰنٗا) liwaliyyihii sulthaanaa : yaitu memberikan bagi ahli waris yang terbunuh kekuasaan atas pembunuh. (فَلَا يُسۡرِف فِّي ٱلۡقَتۡلِۖ) falaa yusrif fil qatl : yaitu jangan membunuh yang bukan pembunuhnya. Makna ayat: Firman-Nya ta’ala “Dan janganlah kalian membunuh jiwa yang telah Allah haramkan, kecuali karena kebenaran...” diantara hukum dan wasiat Allah, adalah jangalah kalian—wahai kaum mukminin—membunuh jiwa yang telah Allah haramkan kecuali dengan kebenaran. Rasulullah shallallahu ‘alaihi wa sallam telah menjelaskan alasan bolehnya membunuh jiwa seorang mukmin yaitu satu dari tiga sebab: pembunuhan secara sengaja, zina setelah menikah, dan keluar dari agama Islam. Firman-Nya ta’ala “Dan barang siapa yang dibunuh secara zalim, sungguh Kami telah menjadikan kekuasaan kepada walinya...” dari yang terbunuh secara zalim dengan sengaja, Allah ta’ala telah memberikan kepadanya hak atas si pembunuh, jika walinya berkehendak ia dibunuh, atau membayar diyat, atau ia mengampuninya karena mengharap Wajah Allah. Firman-Nya ta’ala “Maka janganlah berlebihan dalam membunuh, sungguh ia telah mendapatkan pertolongan.” Tidak boleh bagi wali yang terbunuh untuk berlebihan dalam membunuh, yaitu lebih dari satu orang sebagai ganti untuk satu jiwa, atau membunuh perempuan sebagai ganti dari laki-laki, atau membunuh yang bukan pembunuhnya, oleh karena itu Allah ta’ala memberikan hak untuk membunuh pelaku pembunuhan, namun tidak boleh membunuh yang bukan pelakunya, sebagaimana dahulu mereka lakukan pada masa jahiliyah. Pelajaran dari ayat: • Haram membunuh seseorang yang telah Allah ta’ala haramkan jiwanya, kecuali karena kebenaran. Alasan itu adalah; pembunuhan secara sengaja, berzina setelah menikah, kufur setelah beriman."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 33: Mencakup anak kecil, orang dewasa, laki-laki dan wanita, orang merdeka dan budak, orang muslim dan orang kafir yang mengikat perjanjian. Maksudnya yang dibenarkan oleh syara' seperti qishash, membunuh orang murtad, rajam kepada pezina yang sudah menikah, dan pemberontak ketika melakukan pemberontakan yang tidak ada cara untuk menghentikannya kecuali harus dibunuh. Yakni dengan tanpa alasan yang benar. Maksud kekuasaan di sini adalah hak ahli waris yang terbunuh atau penguasa untuk menuntut qisas atau menerima diat. Lihat Al Baqarah: 178 dan An Nisaa’: 92. Adapula yang menafsirkan “kekuasaan” di sini dengan hujjah yang jelas untuk mengqishas pembunuh, dan Allah memberikan juga kepadanya kekuasaan secara taqdir. Ayat ini menunjukkan bahwa hak membunuh (qisas) diserahkan kepada wali, oleh karenanya pembunuh tidaklah diqishas kecuali dengan izinnya, dan jika dia memaafkan, maka gugurlah qishas. Dan qishas dilakukan ketika syarat-syaratnya terpenuhi, seperti membunuh dengan sengaja, sekufu’ (sederajat), dsb. Yakni ‘ashabah dan ahli waris yang paling dekat kepadanya. Seperti membunuh yang bukan pembunuh, membunuh menggunakan alat yang berbeda dengan alat yang dipakai si pembunuh, dan membunuh ditambah dengan mencincang."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 33",
    "description": "Dan janganlah kamu membunuh jiwa yang diharamkan Allah membunuhnya, kecuali dengan suatu alasan yang benar, misalnya atas dasar menjatuhkan hukum qisas. Dan barang siapa dibunuh secara zalim, bukan karena sebab yang bersifat syariat, maka sesungguhnya kami telah memberi kekuasaan kepada ahli warisnya, untuk menuntut kisas atau meminta ganti rugi kepada pembunuhnya, atau memaafkannya, tetapi janganlah ahli waris itu melampaui batas dalam membunuh, yakni dalam menuntut membunuh apalagi melakukan pembunuhan dengan main hakim sendiri. Sesungguhnya ia adalah orang yang mendapat pertolongan dari sisi Allah dengan ketetapan hukum-Nya yang adil. Dan janganlah kamu mendekati harta anak yatim, yakni mengelolanya atau membelanjakannya kecuali dengan cara yang lebih baik, yang bermanfaat bagi anak yatim itu sampai dia dewasa dan mampu mengelola sendiri hartanya dengan baik, dan penuhilah janji, baik kepada Allah maupun sesama manusia; sesungguhnya janji itu pasti diminta pertanggungjawabannya, oleh karena itu janji harus dipenuhi dan ditunaikan dengan sempurna."
  }
]