[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan janganlah kalian mengendalikan semua kalian harta-harta anak-anak yang ditinggal mati oleh bapak-bapak mereka sebelum mereka baligh dan lalu mereka berada di bawah tanggungan kalian kecuali dengan cara yang baik bagi mereka. Yaitu dengan cara mengembangkan dan meningkatkannya hingga si anak yatim mencapai usia matang dan sudah bagus dalam mengelola hartanya. Dan penuhilah janji yang kalian telah berkomitmen untuk melaksanakannya. Sesungguhnya perjanjian itu, Allah akan meminta pertanggung jawaban kepada yang bersangkutan di hari kiamat. Dia akan memberi balasan baginya apabila menyempurnakan dan memenuhinya dan akan menyiksa orang yang akan mengkhianatinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "34. Dan janganlah kalian menggunakan harta anak yang orang tuanya telah wafat kecuali dengan cara yang baik, seperti mengembangkan harta tersebut (dengan jalan dagang) atau menjaganya, hingga anak tersebut dewasa dan mampu mengelola hartanya sendiri. Dan penuhilah perjanjian yang berlaku antara kalian dengan Allah, atau antara kalian dengan hamba-hamba-Nya yang lain dengan tanpa membatalkan atau melalaikannya, karena pada hari Kiamat kelak Allah pasti akan bertanya pada orang yang melakukan perjanjian; apakah ia menepatinya agar ia memberinya pahala, atau melalaikannya agar ia menghukumnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "34. Dan janganlah kalian menggunakan harta anak yatim kecuali dengan tujuan mengembangkan harta itu; gunakanlah harta mereka dengan baik hingga mereka mencapai usia dewasa. Dan penuhilah semua janji yang telah kalian buat karena kalian akan ditanya tentang janji itu pada hari kiamat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "34. وَلَا تَقْرَبُوا۟ مَالَ الْيَتِيمِ إِلَّا بِالَّتِى هِىَ أَحْسَنُ (Dan janganlah kamu mendekati harta anak yatim, kecuali dengan cara yang lebih baik (bermanfaat)) Allah melarang untuk mendekati harta anak yatim sebagai penekanan dalam larangan untuk secara langsung merusak harta tersebut. Namun harta tersebut harus diurus oleh seorang wali yang mampu mengurus harta tersebut dengan baik, yaitu dengan menjaganya dan mengolahnya agar mendapatkan keuntungan, serta menafkahkannya kepada anak yatim tersebut tanpa berlebih-lebihan. حَتَّىٰ يَبْلُغَ أَشُدَّهُۥ ۚ( sampai ia dewasa) Apabila anak yatim itu telah dewasa maka hartanya harus dikembalikan kepadanya atau kalian dibolehkan untuk mengolahnya dengan izinnya. وَأَوْفُوا۟ بِالْعَهْدِ ۖ( dan penuhilah janji) Yakni tegakkanlah janji tersebut secara syar’i dan aturan yang diridhai kecuali apabila terdapat dalil khusus yang membolehkan pembatalan janji tersebut."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Siapapun yang melontarkan satu kalimat yang menunjukkan suatu perjanjian; maka kalimat itu telah menjadi tanggug jawab baginya untuk mewujudkannya, hal itu yang telah diwahyukan oleh Allah Swt. { وَأَوْفُوا بِالْعَهْدِ ۖ إِنَّ الْعَهْدَ كَانَ مَسْئُولًا } \"penuhilah janji; sesungguhnya janji itu pasti diminta pertanggungan jawabnya\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "34. Dan janganlah kalian mendekati harta anak yatim dengan memberikan kerugian dan kerusakan, melainkan dengan cara yang bagus dengan menjaga, memelihara dan memberi infak kepada anak yatim tersebut secara terus menerus sampai anak yatim itu baligh, yaitu telah sempurna menggunakan akal dan telah baik dalam berperilaku dan berkomitmenlah dalam janji, yaitu memikul tanggung jawab dari Allah dan janji dengan manusia kecuali janji dengan surat perjanjian yang rusak. Sesungguhnya orang yang berjanji itu bertanggung jawab untuk memuliakan dan melaksanakan janji tersebut"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Janganlah kamu mendekati harta anak yatim, kecuali dengan (cara) yang terbaik sampai dia dewasa dan penuhilah} penuhilah {janji. Sesungguhnya janji itu pasti diminta pertanggungjawabannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "34. (Aturan) ini merupakan (cerminan) kelembutan dan kasih sayang Allah kepada anak yatim, yang kehilangan ayahnya saat masih kecil, yang mana dia tidak mengetahui kemaslahatan baginya dan tidak bisa mengurus dirinya sendiri. Maka Allah memerintahkan walinya supaya menjaga sang anak dan memelihara hartanya serta tidak mendekatinya “kecuali dengan cara yang lebih baik,” berupa (menginvestasikannya) dalam perdagangan, tidak menjerumuskannya pada bahaya-bahaya dan bersemangat untuk mengembangkannya. Usaha ini berlangsung sampai si anak yatim mencapai usia “dewasa” yaitu masa baligh, matang akalnya, dan bisa berpikir dengan baik. Apabila anak yatim tersebut telah mencapai usia dewasa, maka selesailah tanggung jawab perwalian darinya. Selanjutnya, si anak tersebut menjadi wali bagi dirinya sendiri. Hartanya pun diserahkan kepadanya, sebagaimana Firman Allah, \"Kemudian jika menurut pendapatmu mereka telah cerdas (pandai memelihara harta), maka serahkanlah kepada mereka harta-hartanya\" (An-Nisa:6) “Dan penuhilah janji,” yang kamu tetapkan kepada Allah dan kepada manusia. “Sesungghnya janji itu pasti dimintai pertanggungjawabannya,” maksudnya kalian bertanggung jawab tentang pemenuhan tanggung jawab dan tidaknya. Apabila kalian memenuhinya, maka kalian akan memperoleh pahala yang banyak. Akan tetapi, jika kalian tidak memenuhi tanggung jawab, akibatnya akan mendapat dosa yang besar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 34: Hal ini menunjukkan kelembutan Allah dan rahmat-Nya kepada anak yatim yang ditinggal mati bapaknya ketika ia masih kecil, di mana ia tidak mengetahui hal yang bermaslahat bagi dirinya. Maka Allah Subhaanahu wa Ta'aala memerintahkan kepada walinya untuk menjaganya, menjaga hartanya dan mengurusnya dengan baik. Seperti mendagangkannya dan tidak menjatuhkannya ke dalam bahaya hilang atau binasa, berusaha mengembangkannya, dan hal itu terus berlangsung sampai anak yatim itu baligh dan akalnya cerdas. Jika sudah demikian, maka lepaslah kewaliannya dan harta itu diserahkan kepadanya. Ketika kamu berjanji dengan Allah atau dengan manusia. Apakah dipenuhi atau tidak? Jika dipenuhi, maka ia mendapatkan pahala, dan jika tidak, maka ia akan mendapatkan dosa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 34",
    "description": "Dan janganlah kamu mendekati harta anak yatim, yakni mengelolanya atau membelanjakannya kecuali dengan cara yang lebih baik, yang bermanfaat bagi anak yatim itu sampai dia dewasa dan mampu mengelola sendiri hartanya dengan baik, dan penuhilah janji, baik kepada Allah maupun sesama manusia; sesungguhnya janji itu pasti diminta pertanggungjawabannya, oleh karena itu janji harus dipenuhi dan ditunaikan dengan sempurna. Dan sempurnakanlah takaran apabila kamu menakar, jangan mengurangi takaran untuk orang atau melebihkannya untuk dirimu, dan timbanglah dengan timbangan yang benar sesuai dengan ukuran yang ditetapkan. Itulah yang lebih utama bagimu, karena dengan demikian orang akan percaya kepadamu dan tenteram dalam bermuamalah denganmu dan lebih baik akibatnya bagi kehidupan manusia pada umumnya di dunia dan bagi kehidupanmu di akhirat kelak."
  }
]