[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sempurnakanlah takaran, dan jangan kalain menguranginya bila kalian menakar untuk oranglain. Dan timbanglah dengan neraca yang benar. Sesungguhnya tindakan adil dalam menakar dan menimbang adalah lebih baik bagi kalian di dunia dan akibatnya lebih baik di sisi Allah pada hari akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "35. Dan sempurnakanlah takaran apabila kamu menakar untuk orang lain dan jangan menguranginya, dan timbanglah dengan timbangan yang jujur lagi tidak mengurang-nguranginya, sebab penyempurnaan takaran dan timbangan tersebut lebih baik bagi kalian di dunia dan di Akhirat kelak, dan lebih baik ganjarannya daripada sikap curang dengan mengurangi takaran atau timbangan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "35. Dan sempurnakanlah takaran jika kalian menakar untuk orang lain dan jangan kalian menguranginya sedikitpun. Dan timbanglah dengan timbangan yang tidak mengandung kedhaliman. Sungguh keadilan yang besar dalam menakar dan menimbang lebih baik bagi kalian di dunia dan membawa kesudahan yang baik di akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "35. وَأَوْفُوا۟ الْكَيْلَ إِذَا كِلْتُمْ (Dan sempurnakanlah takaran apabila kamu menakar) Yakni sempurnakanlah takaran dan janganlah kalian kurangi. وَزِنُوا۟ بِالْقِسْطَاسِ الْمُسْتَقِيمِ ۚ (dan timbanglah dengan neraca yang benar) Makna (القسطاس) yakni timbangan yang dipakai untuk menimbang barang-barang dagangan seperti timbangan gantung, timbangan emas, dan lain sebagainya. Kata ini berasal dari bahasa Ramawi. Makna (المستقيم) yakni yang tidak perdapat pengurangan atau penambahan. Atau secara adil. ذٰلِكَ(Itulah) Yakni penyempurnaan takaran dan timbangan itu. خَيْرٌ(lebih utama) Yakni lebih baik di sisi Allah dan di sisi manusia. وَأَحْسَنُ تَأْوِيلًا(dan lebih baik akibatnya) Yakni lebih baik kesudahannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "35. Dan sempurnakanlah takaran saat kalian menakar, dan menimbanglah dengan timbangan normal yang tidak ada kecurangan di dalamnya. Dan berlaku jujur dalam menakar dan menimbang itu lebih baik dan lebih utama bagi kalian di dunia dengan mendapatkan reputasi baik dan muamalah yang disenangi, dan sebaik baik balasan dan harta itu ada di akhirat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sempurnakanlah takaran apabila kalian menakar dan timbanglah dengan timbangan yang benar} dengan timbangan yang seimbang lagi sama {Itulah yang paling baik dan paling bagus akibatnya} kesudahannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "35. Ini adalah perintah untuk berlaku adil dan menyempurnakan takaran dan timbangan-timbangan dengan adil tanpa memangkas ataupun menguranginya. Dari konteks umum ayat di atas dapat diambil faidah, adanya larangan dari berbagai bentuk penipuan dalam masalah harga, barang dan obyek yang sudah disepakati, dan (kandungan) perintah untuk tulus dan jujur dalam bermuamalah. “Itulah yang lebih utama (bagimu),” daripada berbuat tidak demikian “dan lebih baik akibatnya,” lebih baik akibat kesudahannya. Dengan itu, seorang hamba selamat dari berbagai tuntutan pertanggungjawaban dan berkah pun akan turun."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 35: Dari keumuman maknanya dapat disimpulkan, larangan berbuat curang atau menipu (ghisy) baik pada uang yang dibayarnya, barangnya maupun pada ‘akadnya, dan perintah memiliki sifat nus-h (tulus) serta jujur dalam bermuamalah. Dengan melakukan hal tersebut, maka seorang hamba akan selamat dari pertanggungjawaban dan akan mendapatkan keberkahan dalam hartanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 35",
    "description": "Dan sempurnakanlah takaran apabila kamu menakar, jangan mengurangi takaran untuk orang atau melebihkannya untuk dirimu, dan timbanglah dengan timbangan yang benar sesuai dengan ukuran yang ditetapkan. Itulah yang lebih utama bagimu, karena dengan demikian orang akan percaya kepadamu dan tenteram dalam bermuamalah denganmu dan lebih baik akibatnya bagi kehidupan manusia pada umumnya di dunia dan bagi kehidupanmu di akhirat kelak. Dan janganlah kamu mengikuti apa yang kamu tidak mempunyai pengetahuan tentangnya. Jangan mengatakan sesuatu yang engkau tidak ketahui, jangan mengaku melihat apa yang tidak engkau lihat, jangan pula mengaku mendengar apa yang tidak engkau dengar, atau mengalami apa yang tidak engkau alami. Sesungguhnya pendengaran, penglihatan dan hati, adalah amanah dari tuhanmu, semuanya itu akan diminta pertanggunganjawabnya, apakah pemiliknya menggunakan untuk kebaikan atau keburukan'."
  }
]