[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan janganlah engaku (wahai manusia), mengikuti apa yang tidak engkau ketahui. Akan tetapi pastikan dan verifikasi(akan kebenarannya) dahulu. Sesungguhnya manusia akan dimintai pertanggung jawaban menggenai bagaimana ia menggunakan pendengaran, penglihatan, dan hatinya. Apabila dia mempergunakannya dalam perkara-perkara baik, niscaya akan memperoleh pahala, dan jika ia mempergunakannya dalam hal-hal buruk, maka dia akan memperoleh hukuman."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "36. Wahai anak Adam! Janganlah kamu mengikuti sesuatu yang tidak kamu ketahui, sehingga kamu hanya mengikuti prasangka dan insting belaka, sebab manusia pasti akan mempertanggungjawabkan baik-buruknya penggunaan alat pendengaran, penglihatan, dan hatinya, yang baik akan diberikan pahala dan ganjaran, sedangkan yang buruk akan diberikan hukuman dan azab."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "36. Dan janganlah kamu mengatakan apa yang tidak kamu ketahui, namun pastikanlah kebenarannya terlebih dahulu sebelum kalian mengatakannya. Sungguh manusia pada hari kiamat akan ditanya tentang pendengaran, penglihatan, dan hatinya. Sungguh hukum-hukum yang mulia ini akan dipertanggungjawabkan manusia pada hari kiamat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "36. وَلَا تَقْفُ مَا لَيْسَ لَكَ بِهِۦ عِلْمٌ ۚ (Dan janganlah kamu mengikuti apa yang kamu tidak mempunyai pengetahuan tentangnya) Allah melarang manusia untuk mengatakan sesuatu yang tidak ia ketahui, atau melakukan suatu amalan tanpa berlandaskan ilmu, seperti menjelekkan atau menuduh orang lain tanpa dasar dan mengikuti firasat atau prasangka semata. إِنَّ السَّمْعَ وَالْبَصَرَ وَالْفُؤَادَ كُلُّ أُو۟لٰٓئِكَ كَانَ عَنْهُ مَسْـُٔولًا(Sesungguhnya pendengaran, penglihatan dan hati, semuanya itu akan diminta pertanggungan jawabnya) Pemilik anggota tubuh tersebut akan ditanya untuk apa ia gunakan karena anggota tubuh tersebut hanyalah sebatas alat, apabila digunakan dalam kebaikan maka pemiliknya berhak mendapat pahala dan apabila ia digunakan dalam keburukan maka pemiliknya berhak mendapatkan siksa. Pendapat lain mengatakan bahwa Allah akan menjadikan anggota tubuh bersebut dapat berbicara ketika ditanya, sehingga ia dapat memberitahu apa yang dilakukan oleh pemiliknya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). { إِنَّ السَّمْعَ وَالْبَصَرَ وَالْفُؤَادَ كُلُّ أُولَٰئِكَ كَانَ عَنْهُ مَسْئُولًا } \"Sesungguhnya pendengaran, penglihatan dan hati, semuanya itu akan diminta pertanggungan jawabnya.\" Anggota badan ini bagaikan aliran sungai yang membawa sesuatu sampai ke hati, apakah itu bersih ataupun kotor, barangsiapa yang pandai untuk mengahalanginya dari keburukan, niscaya akan bersih hatinya dari semua kotoran. Namun barangsiapa yang menghantarkannya kepada kemaksiatan, maka sungguh iya telah membawanya kepada kegelapan. 2 ). \"Sesungguhnya pendengaran, penglihatan dan hati, semuanya itu akan diminta pertanggungan jawabny\" Tatkala tiga anggota badan ini merupakan anggota badan yang paling mulia; Allah mengkhususkan penyebutannya untuk dimintai pertanggung jawaban, hal itu menunjukkan bahwa kebahagiaan manusia tergantung sehatnya ketiga anggota badan ini, sebaliknya celakanya hidup seseorang tergantung rusaknya ketiga anggota badan ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "36. Dan janganlah kamu mengikuti sesuatu yang tidak kamu ketahui, dan janganlah kamu ikut campur dalam hal yang tidak ada hubungannya denganmu. Sesungguhnya pada hari kiamat kamu bertanggungjawab di sisi Allah atas penglihatan, pendengaran dan hati yang kamu gunakan baik dalam kebaikan atau keburukan. Dan anggota-anggota tubuh ini adalah amanat yang dititipkan di sisimu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Janganlah mengikuti} jangaanlah mengikuti {sesuatu yang tidak kamu ketahui. Sesungguhnya pendengaran, penglihatan, dan hati nurani, semua itu akan diminta pertanggung jawabannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "36. Maksudnya, janganlah kamu mengikuti apa yang tidak kamu ketahui. Namun, telitilah setiap apa yang hendak kamu katakan dan kerjakan. Janganlah pernah sekali-kali menyangka semua itu akan pergi tanpa memberi manfaat bagimu dan (bahkan) mencelakakanmu. “Sesungguhnya pendengaran,penglihatan, dan hati, semuanya itu akan diminta pertanggung jawabannya.” Sudah sepantasnya seorang hamba yang mengetahui bahwasanya dia akan diminta pertanggung jawaban tentang segala yang telah dia katakan dan perbuat serta (cara) pemanfaatan anggota badan yang telah Allah ciptakan untuk beribadah kepadaNya, untuk mempersiapkan jawaban atas pertanyaan-pertanyaan (yang akan diajukan). Hal itu tidak bisa terlaksana kecuali dengan menggunakannya (hanya) dalam rangka pengabdian diri (beribadah) kepada Allah, mengikhlaskan agama ini (hanya) untukNYa dan mengekangnya dari setiap yang dibenci Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 36: Bahkan perhatikan dahulu keadaannya dan pikirkan dahulu akibatnya jika engkau hendak mengucapkan atau melakukan sesuatu. Oleh karena itu, sepatutnya seorang hamba yang mengetahui bahwa ucapan dan perbuatannya akan diminta pertanggungjawaban menyiapkan jawaban untuknya. Hal itu tentunya dengan menggunakan anggota badannya untuk beribadah kepada Allah, mengikhlaskan ibadah kepada-Nya dan menjaga dirinya dari melakukan perbuatan yang dibenci Allah Subhaanahu wa Ta'aala."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 36",
    "description": "Dan janganlah kamu mengikuti apa yang kamu tidak mempunyai pengetahuan tentangnya. Jangan mengatakan sesuatu yang engkau tidak ketahui, jangan mengaku melihat apa yang tidak engkau lihat, jangan pula mengaku mendengar apa yang tidak engkau dengar, atau mengalami apa yang tidak engkau alami. Sesungguhnya pendengaran, penglihatan dan hati, adalah amanah dari tuhanmu, semuanya itu akan diminta pertanggunganjawabnya, apakah pemiliknya menggunakan untuk kebaikan atau keburukan'dan janganlah engkau berjalan di muka bumi ini dengan sombong, untuk menampakkan kekuasaan dan kekuatanmu, karena sesungguhnya sekuat apa pun hentakan kakimu, kamu sekali-kali tidak dapat menembus bumi dan setinggi apa pun kepalamu, sekali-kali kamu tidak akan sampai setinggi gunung. Sesungguhnya kamu adalah makhluk yang lemah dan rendah di hadapan Allah, kamu tidak memiliki kekuatan dan kemuliaan, melainkan apa yang dianugerahkan oleh-Nya."
  }
]