[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan janganlah engkau berjalan di muka bumi dengan angkuh lagi takabur, karena sesungguhnya engkau itu tidak akan mampu menembus bumi dengan langkah kakimu diatasnya, dan engkau tidak akan pernah mampu menyamai tinggi gunung dengan keangkuhan, kesombongan, dan takaburmu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "37. Dan janganlah kamu berjalan di muka bumi ini dengan sikap angkuh dan sombong, sebab walaupun engkau berjalan dengan sikap keangkuhan bumi tidak akan terbelah karenanya, dan tidak pula dirimu akan menjulang tinggi seperti tingginya gunung-gunung, lalu kenapa harus menunjukkan sikap angkuh?!"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "37. Dan janganlah kamu berjalan di muka bumi secara angkuh dan sombong, karena kamu tidak akan mampu berjalan kaki melintasi seluruh muka bumi, dan meskipun kamu merasa tinggi namun ketinggianmu tidak akan menyamai puncak gunung."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "37. وَلَا تَمْشِ فِى الْأَرْضِ مَرَحًا ۖ (Dan janganlah kamu berjalan di muka bumi ini dengan sombong) Makna (المرح) yakni angkuh dan menyombongkan diri. إِنَّكَ لَن تَخْرِقَ الْأَرْضَ(karena sesungguhnya kamu sekali-kali tidak dapat menembus bumi) Dengan cara jalanmu yang penuh kesombongan itu. Dalam kalimat ini terdapat olokan bagi orang yang angkuh dan sombong. وَلَن تَبْلُغَ الْجِبَالَ طُولًا(dan sekali-kali kamu tidak akan sampai setinggi gunung) Yakni kemampuanmu tidak akan setinggi gunung sehingga besarnya jasadmu dapat menanggung beban kesombonganmu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "37. Dan janganlah berjalan di permukaan bumi dengan angkuh dan sombong. Sesungguhnya kamu tidak akan bisa menembus bumi hingga sampai di permukaan lainnya menggunakan kesombonganmu. Kamu juga tidak akan bisa mencapai gunung dengan keangkuhanmu, Dalam hal ini terdapat sindiran bagi orang sombong dan membatasi mereka agar tidak sombong."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Janganlah berjalan di bumi ini dengan sombong} dengan angkuh dan sombong {karena sesungguhnya kamu tidak akan dapat menembus bumi} tidak bisa membelah bumi dengan langkahmu di atasnya {dan tidak akan mampu menjulang setinggi gunung"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "37. Allah berfirman, “Dan janganlah kamu berjalan di muka bumi ini dengan sombong,” yaitu congkak, berlagak, sombong terhadap kebenaran dan merasa lebih besar di hadapan makhluk. “Sesungguhnya kamu,” dengan perbuatanmu itu “sekali-kali kamu tidak akan sampai setinggi gunung,” dengan kesombonganmu. Bahkan kamu menjadi hina di sisi Allah, nista pada pandangan makhluk, dalam keadaan dimurkai dan dibenci. Engkau telah meraup perilaku-perilaku yang seburuk-buruknya, dan engkau telah menyandangi diri dengan moral yang paling rendah tanpa mendapatkan sebagian apa yang kamu inginkan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 37: Dengan menolak kebenaran dan merendahkan manusia. Bahkan karenanya engkau menjadi seorang yang hina di sisi Allah dan di hadapan manusia dalam keadaan dimurkai dan dibenci. Jika engkau tidak anggup menembus bumi sampai bagian paling bawah dan menjulang setinggi gunung, maka mengapa engkau bersikap sombong?"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 37",
    "description": "Dan janganlah engkau berjalan di muka bumi ini dengan sombong, untuk menampakkan kekuasaan dan kekuatanmu, karena sesungguhnya sekuat apa pun hentakan kakimu, kamu sekali-kali tidak dapat menembus bumi dan setinggi apa pun kepalamu, sekali-kali kamu tidak akan sampai setinggi gunung. Sesungguhnya kamu adalah makhluk yang lemah dan rendah di hadapan Allah, kamu tidak memiliki kekuatan dan kemuliaan, melainkan apa yang dianugerahkan oleh-Nya. Semua itu, yakni keburukan-keburukan yang disebutkan dalam ayatayat sebelum ini, kejahatannya amat dibenci di sisi tuhanmu."
  }
]