[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Semua yang sudah disebutkan, berupa perintah-perintah dan larangan-larangan, Allah tidak menyukai keburukannya, dan tidak meridhai hal itu pada hamba-hambaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "38. Wahai manusia! Semua yang telah disebutkan di atas, berupa amalan yang dilarang, merupakan kejahatan yang sangat dibenci dan dilarang oleh Tuhanmu, Allah tidak akan meridai pelakunya, bahkan Dia memurkainya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "38. Segala perkara-perkara yang jauh dari akhlak yang mulia ini sangat Allah benci keburukannya dan tidak akan Allah ridhai, serta Allah akan memberi balasan atas perbuatan tersebut."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "38. كُلُّ ذٰلِكَ كَانَ سَيِّئُهُۥ عِندَ رَبِّكَ مَكْرُوهًا (Semua itu kejahatannya amat dibenci di sisi Tuhanmu) Yakni hal-hal terlarang yang telah disebutkan itu adalah sesuatu yang dibenci dan dimurkai Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "38. Setiap larangan yang disebutkan adalah sifat-sifat terlarang yang dibenci, tidak diridhai dan akan dihukum oleh Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Semua itu} setiap hal yang telah disebutkan itu {kejahatannya} kejahatan dari hal itu {dibenci di sisi Tuhanmu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "38. “Semua itu,” semua larangan yang telah disebutkan yang telah Allah larang pada ayat-ayat sebelumnya, mulai dari Firman Allah, “Janganlah kamu adakan tuhan yang lain di samping Allah,” dan larangan durhaka kepada kedua orang tua, dan deretan larangan setelahnya “kejahatannya amat dibenci di sisi Rabbmu,” maksudnya semua itu berakibat buruk dan berbahaya bagi pelakunya. Terlebih lagi, Allah pun membenci dan menolak perbuatan-perbuatan itu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 38: Maksudnya, semua larangan yang tersebut pada ayat-ayat 22, 23, 26, 29, 31, 32, 33, 34, 36, dan 37 surat ini."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 38",
    "description": "Semua itu, yakni keburukan-keburukan yang disebutkan dalam ayatayat sebelum ini, kejahatannya amat dibenci di sisi tuhanmu. Itulah sebagian hikmah, hukum-hukum yang mengandung kebenaran yang bermanfaat bagi kehidupan manusia, yang diwahyukan tuhanmu kepadamu, yakni nabi Muhammad, melalui malaikat jibril. Dan janganlah kamu mengadakan tuhan yang lain di samping Allah, yang menyebabkan engkau dilemparkan ke dalam neraka dalam keadaan tercela oleh dirimu sendiri dan orang lain dan dijauhkan dari rahmat Allah."
  }
]