[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Hal Yang Kami jelaskan dan Kami terangkan dari beberapa hukum yang agung, berupa perintah terhadap amal-amal perbuatan yang baik dan larangan dari moral-moral hina, termasuk yang Kami wahyukan kepada engkau wahai nabi. Maka janganlah engkau (wahai manusia) menjadikan sekutu bersama Allah dalam ibadah kepadaNya. Akibatnya, engkau akan dicampakan kedalam neraka jahanam, dalam keadaan kamu dicela oleh dirimu sendiri dan manusia, dan engkau menjadi manusia yang terusir lagi dijauhkan dari segala kebaikan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "39. Perkara yang Kami jelaskan berupa perintah, larangan dan hukum-hukum merupakan wahyu dari Tuhanmu kepadamu, maka janganlah engkau -wahai manusia- mengadakan Tuhan lain bersama Allah, nanti engkau diceburkan ke dalam neraka Jahanam dalam keadaan tercela di mata dirimu sendiri dan di mata manusia lainnya, serta terjauhkan dari segala kebaikan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "39. Hai Rasulullah, apa yang telah disebutkan itu merupakan hikmah yang agung dan perintah yang mulia yang telah Allah wahyukan kepadamu agar hamba-Nya melaksanakannya. Dan janganlah dia membuat sekutu bagi Allah dalam peribadatan, sehingga dia dapat dilempar ke neraka jahanam dalam keadaan terhina di hadapan Pencipta dan para makhluk, serta dijauhkan dari segala kebaikan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "39. ذٰلِكَ مِمَّآ أَوْحَىٰٓ إِلَيْكَ رَبُّكَ مِنَ الْحِكْمَةِ ۗ (Itulah sebagian hikmah yang diwahyukan Tuhanmu kepadamu) Ayat ini merujuk pada apa yang telah disebutkan sebelumnya yang berupa lima belas perintah. Yakni itu semua adalah bagian dari hukum-hukum yang Allah wahyukan kepadamu yang tidak terkandung keburukan didalamnya. وَلَا تَجْعَلْ مَعَ اللهِ إِلٰهًا ءَاخَرَ(Dan janganlah kamu mengadakan tuhan yang lain di samping Allah) Allah mengulangi larangan perbuatan syirik sebagai penegas dan penekanan terhadap larangan tersebut, serta sebagai peringatan bahwa tauhid adalah inti dan tiang dari agama. فَتُلْقَىٰ فِى جَهَنَّمَ مَلُومًا مَّدْحُورًا(yang menyebabkan kamu dilemparkan ke dalam neraka dalam keadaan tercela lagi dijauhkan) Yakni terhina dan terusir."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "39. Tanggung jawab itu, yaitu 25 hal yang berisi perintah dan larangan adalah sejumlah wahyu yang diberikan kepadamu wahai Nabi, sebagai hikmah yang adil, kebaikan dan pelajaran. Dan janganlah kamu menyertakan Tuhan lain bersama Allah dalam beribadah, lalu dia menjadi sekutu yang ditolak, kemudian kamu dimasukkan ke dalam neraka Jahannam dalam keadaan terhina dan tertolak dari rahmat Allah. Hikmah pada dasarnya adalah mengetahui kebenaran tentang DzatNya. Dan yang dimaksud disini bahwa hukum-hukum ini adalah ayat-ayat yang membimbing menuju hikmah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Itulah sebagian hikmah yang diwahyukan Tuhan kepadamu. Janganlah menjadikan tuhan yang lain bersama Allah, sehingga kamu dilemparkan ke dalam neraka Jahanam dalam keadaan tercela lagi terusir} terusir dari setiap kebaikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "39. “Itulah,” yang Kami jelaskan dan terangkan dari hukum-hukum yang agung ini. “sebagian hikmah yang diwahyukan Rabbmu kepadamu,” sesungguhnya termasuk nilai-nilai yang mengandung hikmah, adalah perintah untuk berbuat kebaikan dan berakhlak mulia, serta larangan dari moral yang hina dan tingkah laku yang jelek. Perbuatan-perbuatan yang disebutkan pada ayat-ayat ini termasuk pancaran hikmah yang luhur, yang diwahyukan oleh Rabb semesta alam kepada penghulu para rasul (Nabi Muhammad) dalam kitabNya yang mulia (al-Quran al-Karim) untuk disampaikan kepada umat yang terbaik. Perbuatan-perbuatan itu termasuk hikmah yang barangsiapa telah mendapatkannya, maka dia telah dianugerahi kebaikan yang melimpah ruah. Kemudian, Allah menutup rangkaian ayat itu dengan larangan untuk beribadah kepada selainNya sebagaimana Allah telah mengawalinya dengan topic itu. Allah berfirman, “Dan janganlah kamu mengadakan tuhan yang lain di samping Allah yang menyebabkan kamu dilemparkan ke dalam neraka,” yaitu dalam keadaan kekal dan dikekalkan. Sesungguhnya orang yang berbuat syirik, maka Allah benar-benar mengharamkan surge baginya surge. Dan tempat kembalinya adalah di dalam neraka “dalam keadaan tercela lagi dijauhkan (dari rahmat Allah),” maksudnya, kamu dikenai celaan, laknat dan hinaan dari Allah, para malaikat, dan seluruh manusia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 39: Hal itu, karena hikmah adalah perintah melakukan perbuatan yang baik dan berakhlak mulia, serta larangan melakukan perbuatan yang buruk dan berakhlak hina. Perintah dan larangan yang disebutkan termasuk hikmah, di mana orang yang diberikannya sama saja telah diberikan kebaikan yang banyak. Kemudian di akhir ayat, Allah Subhaanahu wa Ta'aala menutup lagi dengan larangan beribadah kepada selain Allah karena begitu besarnya perkara ini. Yakni memperoleh celaan dari Allah, malaikat, dan manusia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 39",
    "description": "Itulah sebagian hikmah, hukum-hukum yang mengandung kebenaran yang bermanfaat bagi kehidupan manusia, yang diwahyukan tuhanmu kepadamu, yakni nabi Muhammad, melalui malaikat jibril. Dan janganlah kamu mengadakan tuhan yang lain di samping Allah, yang menyebabkan engkau dilemparkan ke dalam neraka dalam keadaan tercela oleh dirimu sendiri dan orang lain dan dijauhkan dari rahmat Allah. Setelah mengingatkan umat islam agar tidak mengikuti perkataan dan perbuatan yang tidak diketahui kebenarannya, pada ayat ini Allah menjelaskan kesalahan kaum musyrik yang menyembah patung-patung sebagai perantara mendekatkan diri mereka kepada tuhan. Allah menyatakan, maka apakah pantas, apa yang engkau katakan bahwa tuhanmu memilihkan anak-anak laki-laki untukmu dan dia mengambil anak-anak perempuan di antara para malaikat, yang menurut pandanganmu lebih rendah derajatnya daripada anak laki-laki' sungguh, kamu benar-benar mengucapkan kata yang besar dosanya, yaitu bahwa tuhan mempunyai anak dan para malaikat berjenis kelamin perempuan, sungguh perkataan itu adalah kebohongan yang nyata."
  }
]