[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Kami telah mengabarkan kepada bani israil di dalam kitab taurat yang diturunkan atas mereka bahwa sesungguhnya pasti akan terjadi kerusakan yang timbul dari mereka dua kali di wilayah baitul maqdis dan tempat-tempat sekitarnya dengan melakukan tindak kezhaliman, membunuhi para nabi, sombong, dan tindakan melampaui batas serta permusuhan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Kami telah mengabarkan pada Bani Israil dalam Kitab Taurat bahwa mereka pasti akan melakukan kerusakan di muka bumi dengan melakukan kemaksiatan dan kesombongan sebanyak dua kali. Bahkan mereka akan berkuasa atas manusia secara zalim dan keji, dengan berlebih-lebihan dalam menjalankan kekuasaan atas mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "4. Dan Kami sampaikan dalam Taurat kepada para keturunan Nabi Ya’qub bahwa mereka akan membuat kerusakan sebanyak dua kali di bumi yang mereka tinggali, yaitu di Baitul Maqdis dan sekitarnya; mereka akan mengusai manusia dengan penuh kezaliman dan penindasan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. وَقَضَيْنَآ إِلَىٰ بَنِىٓ إِسْرٰٓءِيلَ فِى الْكِتٰبِ (Dan telah Kami tetapkan terhadap Bani Israil dalam Kitab itu) Yakni Kami tetapkan dan kabarkan. Yang dimaksud dengan kitab yakni Taurat. لَتُفْسِدُنَّ فِى الْأَرْضِ(Sesungguhnya kamu akan membuat kerusakan di muka bumi ini) Yakni tanah suci yang di dalamnya terdapat al-Masjid al-Aqsha. مَرَّتَيْنِ(dua kali) Terdapat pendapat mengatakan, pada kali pertama adalah dengan membunuh Asy’iya (Nabi Yesaya), atau dengan memenjarakan Armiya’ (Nabi Armia), atau dengan melanggar hukum-hukum Taurat. Sedangkan kali kedua adalah dengan membunuh Nabi Yahya bin Zakariya dan keinginan mereka untuk membunuh Nabi Isa. Dan pendapat lain mengatakan bahwa kerusakan pertama telah mereka lakukan namun belum terjadi yang kedua. وَلَتَعْلُنَّ عُلُوًّا كَبِيرًا(dan pasti kamu akan menyombongkan diri dengan kesombongan yang besar) Yakni sungguh kalian akan menguasai manusia dan negeri kalian akan berkuasa lewat perbuatan zalim dan sewenang-wenang."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Kami ajarkan dan beritahukan kepada Bani Israil dalam kitab Taurat itu bahwa kalian akan berbuat kerusakan di tanah Palestina (Tanah suci yang di dalamnya terdapat Masjidil Aqsa sebanyak dua kali kerusakan: yang pertama yaitu melanggar hukum-hukum Taurat dan membunuh para pengikutnya dan kedua yaitu, membunuh Zakaria, Yahya dan berniat membunuh Isa) dan pasti kalian akan enggan menaati Allah dengan sangat angkuh dan merasa tinggi di atas manusia dengan kekuasaan dan kezaliman."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami mewahyukan kepada Bani Israil} Kami memberitahu kepada Bani Israil {di dalam kitab itu} Taurat {“Sungguh kalian akan berbuat kerusakan di bumi} di negeri Syam dan Baitul maqdis {dua kali dan benar-benar akan menyombongkan diri} dan benar-benar meremehkan ketaatan kepada Allah {dengan kesombongan yang besar”} kesombongan yang agung"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4. “Dan telah Kami tetapkan terhadap Bani Israil,” maksudnya sudah berlalu (ketetapan) Kami, telah Kami perintahkan mereka, dan Kami beritahukan dalam kitab mereka, bahwasanya pasti timbul pada mereka tindakan pengrusakan di bumi dua kali dengan perbuatan maksiat, pengingkaran nikmat, tinggi hati dan arogan di bumi, bahwa bila telah berlangsung salah satu dari kedua kerusakan itu, maka Allah akan menjadikan musuh berkuasa atas mereka dan menyiksa mereka. Ini merupakan peringatan dan ancaman supaya mereka kembali dan ingat kepada Allah."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (وَقَضَيۡنَآ) wa qadhainaa : Kami mengumumkan keputusan Kami kepada mereka. (فِي ٱلۡكِتَٰبِ) fil kitaab : Taurat. (عُلُوّٗا كَبِيرٗا) ‘uluwwan kabiiraa : sangat melampaui batas. Makna ayat: Firman-Nya ta’ala “Dan Kami telah menetapkan bagi Bani Israil dalam Al-Kitab, “Sesungguhnya kalian akan membuat kerusakan di bumi ini dua kali, dan pasti kalian akan menyombongkan diri dengan melampaui batas.” Allah ta’ala mengabarkan Bani Israil akan ketetapan-Nya untuk mereka, yaitu pada kitab mereka; Taurat, bahwa mereka akan membuat kerusakan di bumi dengan berbuat maksiat dan dosa serta menyombongkan diri di bumi dengan menentang Allah dan menzalimi manusia. “kesombongan yang besar” dan setiap yang telah Dia putuskan pasti akan terjadi. Pelajaran dari ayat: • Apa yang telah Allah tetapkan pasti terjadi, apa yang Dia janjikan pasti terpenuhi, dan beriman akan hal itu adalah perkara wajib. • Ancaman terhadap perbuatan merusak, kezaliman, dan berbuat sombong di muka bumi, serta penjelasan balasan yang buruk yang akan diterima."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 4: Ayat ini dan setelahnya merupakan peringatan dan ancaman agar mereka kembali kepada agama Allah. Yakni negeri Syam dengan melakukan berbagai kemaksiatan dan bersikap sombong. ang pertama adalah membunuh Nabi Zakaria ‘alaihis salam, sedangkan yang kedua adalah membunuh Nabi Yahya ‘alaihis salam. Sebagai balasan terhadap kejahatan mereka membunuh nabi dan ulama, maka Allah mengirimkan Jalut dan tentara-tentaranya yang membunuh dan menawan Bani Israil serta merobohkan Baitulmaqdis. Sedangkan sebagai balasan terhadap kejahatan mereka; membunuh Nabi Yahya ‘alaihis salam adalah dengan Allah kirimkan kepada mereka raja Bukhtanashir, lalu ia membunuh ribuan orang Bani Israil dan menawan anak-anak mereka serta merobohkan Baitulmaqdis kembali. Hal ini menurut pendapat sebagian ulama."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 4",
    "description": "Allah menganugerahkan kepada bani israil kitab taurat agar menjadi petunjuk, tetapi mereka enggan berpedoman padanya. Dan telah kami tetapkan terhadap bani israil, yakni anak-cucu nabi yakub, melalui wahyu yang kami turunkan kepada nabi musa yang termaktub dalam kitab itu, yakni taurat, bahwa kamu pasti akan membuat kerusakan di muka bumi ini, yakni baitul maqdis, sebanyak dua kali, tetapi Allah tidak segera menjatuhkan siksa kepadamu, dan dengan demikian pasti kamu akan menyombongkan diri dengan kesombongan yang besar. Maka apabila datang saat hukuman bagi kejahatan pertama yang kamu perbuat dari kedua kejahatan itu, yang telah ditetapkan kepadamu, kami datangkan kepadamu hamba-hamba kami yang mempunyai kekuatan yang besar untuk menguasai negerimu dan menaklukanmu, lalu mereka merajalela di kampung-kampung, memasuki rumahmu untuk mengejar, menyiksa, dan membunuhmu, dan itulah ketetapan yang pasti terlaksana. Inilah ketetapan Allah atas kaum bani israil disebabkan mereka meninggalkan hukum taurat dan membunuh para nabi. Maka datanglah hukuman Allah."
  }
]