[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah tuhan kalian (wahai kaum musyrikin) telah mengistimewakan kalian dengan memberi kalian anak-anak lelaki, sedang Dia sendiri menjadikan maliakat sebagai anak-anak perempuannya? sesungguhnya ucapan kalian ini amat buruk lagi keji, tidak pantas bagi Allah ."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "40. Wahai orang-orang yang mengklaim bahwa para Malaikat adalah anak-anak perempuan Allah, apakah Tuhan kalian -wahai kaum musyrikin- mengistimewakan kalian dengan anak laki-laki dan Dia memilih untuk diri-Nya para Malaikat sebagai anak-anak perempuan? Sungguh Allah Mahatinggi dari apa yang kalian katakan, sungguh kalian benar-benar telah mengatakan tentang Allah perkataan yang sangat keji dengan menyandarkan pada-Nya anak, serta mengklaim bahwa Dia memiliki anak perempuan sebagai bentuk kekufuran yang melampaui batas kepada-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "40. Allah mengingkari anggapan-anggapan orang-orang musyrik: “Apakah Allah akan mengistimewakan kalian dengan memberi kalian anak-anak lelaki, kemudian Dia memilih anak-anak perempuan untuk diri-Nya sendiri?” Sungguh kalian telah mengucapkan kalimat sangat besar keburukannya hingga hampir mengguncang langit dan bumi."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "40. أَفَأَصْفَىٰكُمْ رَبُّكُم بِالْبَنِينَ وَاتَّخَذَ مِنَ الْمَلٰٓئِكَةِ إِنٰثًا ۚ (Maka apakah patut Tuhan memilihkan bagimu anak-anak laki-laki sedang Dia sendiri mengambil anak-anak perempuan di antara para malaikat?) Ini merupakan kalimat yang ditujukan bagi orang-orang kafir yang mengatakan bahwa para malaikat adalah anak-anak perempuan Allah. Yakni apakah Allah lebih mengutamakan kalian daripada diri-Nya sehingga Dia mengistimewakan kalian dengan anak-anak laki-laki, sedangkan bagi diri-Nya sendiri anak-anak perempuan? إِنَّكُمْ لَتَقُولُونَ قَوْلًا عَظِيمًا (Sesungguhnya kamu benar-benar mengucapkan kata-kata yang besar (dosanya)) Yakni sangat besar dosanya dan sangat berani terhadap Allah sampai pada titik yang tidak dapat dibayangkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "40. Wahai orang-orang musyrik, apakah patut Tuhan kalian mengkhususkan putera untuk kalian dan memilih anak perempuan dari golongan malaikat untuk diriNya sendiri? Sesungguhnya dengan kepalsuan ini kalian telah mengatakan keingkaran yang sangat besar dengan menyertakan anak untuk Allah SWT. Yang demikian itu pasti mendapatkan hukuman yang dahsyat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apakah (pantas) Tuhan kalian memilihkan} mengkhususkan untuk kalian {anak laki-laki, sedangkan Dia menjadikan malaikat sebagai anak perempuan. Sesungguhnya kalian benar-benar mengucapkan perkataan yang (dosanya) sangat besar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "40. INi merupakan bantahan keras terhadap siapa saja yang mengklaim bahwasanya Allah memperanak anak perempuan dari makhlukNYa. Allah berfirman, “Maka apakah patut Rabbmu memilihkan bagimu laki-laki,” maksudnya memilihkan bagimu pilihan terbaik dan bagian yang sempurna “sedang Dia mengambil,” untuk diriNya “anak perempuan dari para malaikat?” lantaran mereka menyangka bahwa para malaikat adalah anak-anak perempuan Allah. “Sesungguhnya kamu benar-benar mengucapkan kata-kata yang besar (dosanya).” Dalam pernyataan ini termuat kelancangan besar kepada Allah, pasalnya kalian menisbatkan anak bagiNya yang berarti Allah membutuhkan mereka dan ketidakbutuhan sebagian makhluk kepada Allah. Mereka telah menetapkan pilihan bagiNya dengan bagian yang terburuk dari dua jenis yang ada, yaitu anak-anak perempuan. Padahal Dia-lah yang telah menciptakanmu dan memilihkan untukmu jenis kelamin laki-laki. Mahatinggi Allah dari perkataan orang-orang zhalim."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 40: Menurut persangkaanmu. Karena kamu telah menisbatkan anak kepada-Nya yang menunjukkan bahwa Dia butuh kepada makhluk-Nya dan sebagian makhluk merasa tidak butuh kepada-Nya, padahal Dia Maha Kaya, tidak butuh kepada makhluk-Nya, bahkan semua makhluk membutuhkan-Nya. Di samping itu, mereka menetapkan untuk-Nya bagian yang paling murah, yaitu anak-anak perempuan. Maka Mahatinggi Allah dari apa yang diucapkan orang-orang zalim dengan ketinggian yang sebesar-besarnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 40",
    "description": "Setelah mengingatkan umat islam agar tidak mengikuti perkataan dan perbuatan yang tidak diketahui kebenarannya, pada ayat ini Allah menjelaskan kesalahan kaum musyrik yang menyembah patung-patung sebagai perantara mendekatkan diri mereka kepada tuhan. Allah menyatakan, maka apakah pantas, apa yang engkau katakan bahwa tuhanmu memilihkan anak-anak laki-laki untukmu dan dia mengambil anak-anak perempuan di antara para malaikat, yang menurut pandanganmu lebih rendah derajatnya daripada anak laki-laki' sungguh, kamu benar-benar mengucapkan kata yang besar dosanya, yaitu bahwa tuhan mempunyai anak dan para malaikat berjenis kelamin perempuan, sungguh perkataan itu adalah kebohongan yang nyata. Dan sungguh, dalam Al-Qur'an ini telah kami jelaskan berulang-ulang peringatan dengan beraneka macam perupamaan, janji, dan ancaman agar mereka selalu ingat dan mengambil pelajaran. Tetapi peringatan yang berulang-ulang itu tidak lain hanyalah menambah mereka lari semakin jauh dari kebenaran."
  }
]