[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sungguh kami telah menerangkan dan kami variasikan dalam al-qur’an ini jenis-jenis hukum, bentuk-bentuk perumpamaan dan macam-macan nasihat, saupaya manusia dapat mengambil pelajaran dan merenungi hal-hal yang memberi mereka manfaaat dan kemudian mereka mengambilnya, dan hal-hal yang membahayakan mereka kemudian mereka tinggalkan. Dan tidaklah keterangan dan penjelasan itu menambah orang-orang zhalim kecuali kian jauh dari kebenaran dan kelalaian dari berfikir dan memetik pelajaran."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "41. Dan sungguh, dalam Al-Qur`ān ini telah Kami jelaskan berulang-ulang tentang hukum-hukum, mauizah, dan berbagai perumpamaan agar manusia mengambilnya sebagai peringatan, sehingga mereka bisa mengerjakan apa yang mendatangkan manfaat, dan menjauhi apa yang memberikan mudarat, akan tetapi kenyataannya sebagian mereka adalah orang-orang yang sifat fitrah mereka telah berubah, yang dengannya mereka hanya semakin bertambah jauh dari kebenaran dan semakin membencinya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "41. Sungguh Kami telah menjelaskan dengan terperinci kepada jin dan manusia berbagai penjelasan dalam al-Qur’an, agar mereka dapat mendapatkan bukti-bukti sehingga mereka dapat beriman. Akan tetapi penjelasan tersebut hanya menambah kejauhan orang-orang zalim dari kebenaran dan kebaikan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "41. وَلَقَدْ صَرَّفْنَا فِى هٰذَا الْقُرْءَانِ (Dan sesungguhnya dalam Al Quran ini Kami telah ulang-ulangi) Yakni Kami tela menjelaskan dalam al-Qur’an dengan berbagai macam cara penyampaian seperti dengan perumpamaan-perumpamaan dan lain sebagainya, atau Kami ulang-ulang perkataan itu. لِيَذَّكَّرُوا۟ (agar mereka selalu ingat) Yakni agar mereka mengambil pelajaran dan mentadabburi dan memikirkannya dengan akal mereka sehingga mereka berhenti dari perkataan bathil mereka. وَمَا يَزِيدُهُمْ إِلَّا نُفُورًا (Dan ulangan peringatan itu tidak lain hanyalah menambah mereka lari) Yakni membuat mereka semakin jauh dari kebenaran dan semakin lalai dari memikirkan kebenaran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "41. Dan sungguh Kami telah memberikan berbagai penjelasan dalam Al-Qur’an ini berupa perumpamaan, janji, dan ancaman supaya mereka mengambil pelajaran dan mengingat. Namun hal itu tidak lain hanya menambah kebencian mereka dan bertambah jauh dari kebenaran."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh Kami telah menjelaskan} menjelaskan {dalam Al-Qur’an ini agar mereka selalu ingat} agar mereka mengambil pelajaran {Akan tetapi itu tidak menambah (apa pun) kepada mereka, kecuali lari} menjauh dari kebenaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "41. Allah mengabarkan bahwasanya Dia telah mengulang-ulang (peringatan) dalam al-Quran. Maksudnya, Dia telah memvariasikan hukum-hukum dan menjelaskannya, memperbanyak kuantitas dalil dan bukti-bukti nyata untuk risalah yang Allah serukan. Dia terus mewanti-wanti dan memperingatkan supaya mereka mengingat-ngingat hal-hal yang bermanfaat sehingga mereka mengerjakannya, dan mengingatkan sesuatu yang membahayakan sehingga dihindari. Akan tetapi, kebanyakan manusia enggan (menerima peringatan) “melainkan (menambah) mereka lari,” dari ayat-ayat Allah, karena kebencian mereka terhadap kebenaran dan kecintaan mereka terhadap kebatilan yang mereka gelayuti (sebelumnya), sampai mengakibatkan mereka fanatic buta terhadap kebatilan mereka, tidak sudi mendengar ayat-ayat Allah, dan tidak pula memberikan perhatian kepadanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 41: Demikian pula perintah dan larangan, hukum-hukum, perumpamaan, kisah, bukti, janji dan ancaman, nasehat, dsb."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 41",
    "description": "Dan sungguh, dalam Al-Qur'an ini telah kami jelaskan berulang-ulang peringatan dengan beraneka macam perupamaan, janji, dan ancaman agar mereka selalu ingat dan mengambil pelajaran. Tetapi peringatan yang berulang-ulang itu tidak lain hanyalah menambah mereka lari semakin jauh dari kebenaran. Katakanlah wahai nabi Muhammad kepada kaum musyrik, jika ada tuhan-tuhan di samping-Nya, dan mustahil adanya yang demikian itu sebagaimana yang mereka katakan, dan mereka percaya, niscaya tuhan-tuhan itu mencari jalan kepada tuhan yang mempunyai 'arsy, untuk menyaingi, mengalahkan, atau berbagi kekuasaan dengan-Nya."
  }
]