[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai rasul) kepada kaum musyrikin, ”seandainya ada bersama Allah tuhan-tuhan yang lain, maka pasti tuhan-tuhan itu akan mencari cara untuk mengalahkan Allah, Dzat yang memiliki arasy yang besar. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "42. Wahai Rasul! Katakanlah kepada orang-orang musyrik, \"Seandainya ada tuhan-tuhan sesembahan lain di samping Allah -Ta'ālā- sebagaimana yang mereka klaim secara fitnah dan dusta, niscaya tuhan-tuhan sesembahan itu akan mencari jalan kepada Allah Pemilik Arasy untuk mengalahkan dan merebut kekuasaan-Nya.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "42-43. Allah memerintahkan Nabi Muhammad untuk memahamkan orang-orang musyrik dengan berkata kepada mereka: katakanlah seandainya terdapat tuhan-tuhan lain selain Allah sebagaimana yang mereka anggap, niscaya tuhan-tuhan itu akan berusaha mengalahkan Allah dan setiap tuhan akan mendatangkan ciptaannya masing-masing, serta mereka akan saling bersaing! Maha Suci dan Maha Tinggi Allah dari kedustaan orang-orang musyrik tersebut."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "42. قُل لَّوْ كَانَ مَعَهُۥٓ ءَالِهَةٌ كَمَا يَقُولُونَ (Katakanlah: “Jikalau ada tuhan-tuhan di samping-Nya, sebagaimana yang mereka katakan) Ayat ini ditujukan bagi orang-orang yang mengatakan bahwa Allah memiliki sekutu. إِذًا لَّابْتَغَوْا۟ إِلَىٰ ذِى الْعَرْشِ(niscaya tuhan-tuhan itu mencari kepada Tuhan yang mempunyai ‘Arsy) Yakni kepada Allah. سَبِيلًا (sebuah jalan) Yakni cara untuk saling mengalahkan seperti yang dilakukan oleh para raja satu sama lain yang selalu saling berperang dan menyerbu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "42. Wahai Nabi, katakanlah kepada orang-orang musyrik: “Jika ada tuhan lain bersama Allah sebaimana yang mereka anggapkan, maka sebaiknya tuhan-tuhan itu mencari jalan menuju Allah, Tuhan ‘Arsy yang memiliki kerajaan mutlak, untuk melakukan penawaran dalam mengatur porsi-porsi kerajaan itu, sebagaimana yang dilakukan para raja pada umumnya dalam membagi kekuasaan dan kerajaan”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Katakanlah,“Seandainya ada tuhan-tuhan (lain) di sampingNya} bersama Allah {sebagaimana yang mereka katakan, niscaya tuhan-tuhan itu mencari} mencari {jalan kepada Pemilik ʻArsy} pemilik Arsy yaitu Allah SWT"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "42. Di antara topic paling agung yang Allah mengulang-ulanginya adalah ayat-ayat dan petunjuk-petunjuk tentang tauhid yang merupakan inti dari semua perkara yang penting. Karenanya, Allah memerintahkannya dan melarang dari lawannya (syirik), dan telah menegakkan keterangan-keterangan yang banyak berupa hujjah ‘aqliyah dan naqliyah untuknya, hingga siapa saja yang bersungguh-sungguh menyimak sebagiannya saja, niscaya tidak akan membekaskan keraguan atau sangsi di hatinya. Di antara dalil-dalil itu, dalil logika yang Allah sebutkan disini. Allah berfirman, “Katakanlah,” kepada kaum musyrikin yang mengangkat sesembahan selain Allah. “Jikalau ada tuhan-tuhan di sampingNya, sebagaimana yang mereka katakan,” yaitu sebagai konsekuensi persangakaan dan tuduhan mereka “niscaya tuhan-tuhan itu mencari jalan kepada Rabb yang mempunyai ‘Arasy,” maksudnya, pasti mereka akan mencari jalan menuju kepada Allah dengan cara beribadah dan kembali kepadaNya, mendekatkan diri dan mencari perantara (yang disyariatkan) kepadaNya. Maka bagaimana bisa (terjadi) seorang manusia –yang serba kekurangan, yang mengetahui betapa besarnya ketergantungannya untuk beribadah kepada Rabbnya- menjadikan sesembahan lain beserta Allah? Tidaklah tindakan ini melainkan termasuk kezhaliman yang paling parah dan bentuk kebodohan yang paling dungu. Berdasarkan makna ini, ayat ini menjadi selaras dengan Firman, \"Orang-orang yang mereka seru itu, mereka sendiri mencari jalan kepada Tuhan mereka siapa di antara mereka yang lebih dekat (kepada Allah) dan mengharapkan rahmat-Nya dan takut akan azab-Nya; sesungguhnya azab Tuhanmu adalah suatu yang (harus) ditakuti. \"(Al-Isra’: 57) dan juga Firman Allah \"Dan (ingatlah) suatu hari (ketika) Allah menghimpunkan mereka beserta apa yang mereka sembah selain Allah, lalu Allah berkata (kepada yang disembah): \"Apakah kamu yang menyesatkan hamba-hamba-Ku itu, atau mereka sendirikah yang sesat dari jalan (yang benar)?\" Mereka (yang disembah itu) menjawab: \"Maha Suci Engkau, tidaklah patut bagi kami mengambil selain Engkau (untuk jadi) pelindung, akan tetapi Engkau telah memberi mereka dan bapak-bapak mereka kenikmatan hidup, sampai mereka lupa mengingati (Engkau); dan mereka adalah kaum yang binasa.\" (Al-Furqan:17-18). Ada kemungkinan bahwa Firman Allah, “Katakanlah, ‘JIkalau ada tuhan-tuhan di sampingNya, sebagaimana yang mereka katakan, niscaya tuhan-tuhan itu mencari jalan kepada tuhan yang mempunyai ‘Arasy’ ,” mengarah pada pengertian, pastilah mereka akan mencari jalan dan berupaya untuk mengalahkan Allah, baik ia akan mengalahkanNya (atau tidak),sehingga barangsiapa menang dan mengalahkan (yang lain), maka dialah yang akan menjadi rabb yang disembah. Padahal sungguh orang-orang itu meyakini bahwa mereka akan mengakui kalau para sesembahan mereka yang mereka seru selain Allah adalah kalah lagi terpencundangi, tidak memiliki wewnang apa pun, lalu mengapa orang-orang itu masih mengangkatnya sebagai sesembahan, padahal kondisinya demikian (buruk)? Maka, penafsiran ini semakna dengan Firman Allah, \"Allah sekali-kali tidak mempunyai anak, dan sekali-kali tidak ada tuhan (yang lain) beserta-Nya, kalau ada tuhan beserta-Nya, masing-masing tuhan itu akan membawa makhluk yang diciptakannya, dan sebagian dari tuhan-tuhan itu akan mengalahkan sebagian yang lain. Maha Suci Allah dari apa yang mereka sifatkan itu,\" (Al-Mu’minun:91)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 42: Tentu mereka mencari jalan untuk beribadah kepada Allah, kembali kepada-Nya, mendekatkan diri dan mencari wasilah (sarana) yang dapat mendekatkan diri kepada-Nya. Hal ini seperti yang disebutkan dalam ayat 57 surah Al Israa’, ”Orang-orang yang mereka seru itu, mereka sendiri mencari jalan kepada Tuhan mereka siapa di antara mereka yang lebih dekat (kepada Allah) dan mengharapkan rahmat-Nya dan takut akan azab-Nya; sesungguhnya azab Tuhanmu adalah sesuatu yang (harus) ditakuti.” Bisa juga maksudnya, bahwa jika ada tuhan-tuhan lain di samping Allah, tentu mereka akan berusaha mengalahkan Allah ‘Azza wa Jalla dan yang menang itulah yang akan menjadi tuhan. Hal ini seperti yang disebutkan dalam surah Al Mu’minun: 91, “Allah sekali-kali tidak mempunyai anak, dan sekali-kali tidak ada tuhan (yang lain) beserta-Nya, kalau ada Tuhan beserta-Nya, maka masing-masing Tuhan itu akan membawa makhluk yang diciptakannya, dan sebagian dari tuhan-tuhan itu akan mengalahkan sebagian yang lain. Mahasuci Allah dari apa yang mereka sifatkan itu,” Jelas sekali tidak ada tuhan yang lain di samping Dia, karena sesembahan yang mereka sembah sangat lemah sekali, tidak mampu menciptakan bahkan diciptakan. Lalu mengapa mereka masih saja menjadikannya sebagai tuhan dan menyembahnya, padahal keadaannya seperti ini?"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 42",
    "description": "Katakanlah wahai nabi Muhammad kepada kaum musyrik, jika ada tuhan-tuhan di samping-Nya, dan mustahil adanya yang demikian itu sebagaimana yang mereka katakan, dan mereka percaya, niscaya tuhan-tuhan itu mencari jalan kepada tuhan yang mempunyai 'arsy, untuk menyaingi, mengalahkan, atau berbagi kekuasaan dengan-Nya. Mahasuci dan mahatinggi dia dari apa yang mereka katakan, bahwa ada tuhan-tuhan selain dia, pemilik 'arasy yang agung. Apa yang mereka katakan adalah dusta. Sungguh, dia mahatinggi, dengan ketinggian yang sebesar-besarnya, jauh sekali dari apa yang mereka katakan."
  }
]