[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah bersih dan maha suci dari apa yang dikatakan oleh kaum musyrikin, dan Dia mahatinggi dari apa yang mereka katakan dengan ketinggian yang sebesar-besarnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "43. Sungguh Allah -Subḥānahu- Maha Suci lagi Mulia dari apa yang orang-orang musyrik sifatkan pada-Nya, dan Mahatinggi dari apa yang mereka katakan dengan setinggi-tingginya keagungan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "43. سُبْحٰنَهُۥ (Maha Suci Dia) Pensucian Dzat Allah. وَتَعٰلَىٰ( dan Maha Tinggi) Jauh tinggi di atas keagungan-Nya. عَمَّا يَقُولُونَ (dari apa yang mereka katakan) Dari perkataan-perkataan buruk mereka dan kedustaan besar mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "43. Maha suci Allah SWT dari setiap sekutu. Maha Agung dan Maha Jauh Allah dari anggapan-anggapan dan ucapan-ucapan bathil. Maha Tinggi lagi Maha Besar, Dzat yang tidak mungkin mengambil sekutu-sekutu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maha suci dan Maha tinggi Dia dari apa yang mereka katakan dengan ketinggian yang agung"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "43. “Mahasuci dan Mahatinggi Dia,” maksudnya Allah Mahasuci, murni dan tinggi sifat-sifatNya “dari apa yang mereka katakana,” berupa kesyirikan dan pendaulatan tandingan-tandingan bagi Allah “dengan ketinggian yang sebesar-besarnya.” Sungguh tinggi dan agung kedudukanNYa, besar kesombonganNya, yang tidak bisa diperbandingkan kebersamaan wujud sesembahan denganNya. Sungguh telah tersesat orang yang mengatakan itu dengan kesesatan yang nyata, dan telah berbuat kezhaliman dengan kezhaliman yang besar. Sungguh makhluk-makhluk Allah yang besar itu merunduk di hadapan keagungan Allah. Langit yang tujuh beserta penghuninya dan bumi yang tujuh beserta penghuninya terlampau kecil di hadapan kesombongan Allah. Seluruh bumi ini kelak pada Hari KIamat akan berada dalam genggamanNya dan langit-langit digulung dengan Tangan kananNya. Semua alam (ciptaan selain Allah) yang berada di atas dan dibawah sangat membutuhkanNya di setiap waktu, (dalam rupa kekurangan) pada Dzat mereka yang tidak mungkin terlepas (dari rasa butuh) meski hanya sekejap. Aspek kebutuhan (kepada Allah) ini adalah dari segala sisinya. Kebutuhan dari sudut penciptaan, rizki, dan pengaturan. Kebutuhan (kepada Allah) dari sisi keharusan memposisikan Allah sebagai sesembahan dan Dzat yang dicintai yang mana kepadaNya mereka mendekatkan diri dan tempat untuk mengeluh dalam setiap keadaan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 43: Kedudukan-Nya sangat tinggi dan agung, kebesaran-Nya jelas yang tidak memungkinkan adanya tuhan di samping-Nya, maka sungguh sesat dan sungguh zalim orang yang mengatakan dan menyangka ada tuhan di samping Dia. Semua makhluk kecil di hadapan keagungan-Nya, langit yang tujuh dan bumi yang tujuh beserta isinya kecil di hadapan kebesaran-Nya, pada hari kiamat bumi seluruhnya dalam genggaman-Nya, dan langit dilipat dengan tangan kanan-Nya. Alam bagian atas maupun bawah semuanya butuh kepada-Nya di setiap waktu dan setiap saat. Butuhnya mereka pun dari seluruh sisi, butuh dicipta, butuh diberi rezeki, butuh diurus, dll."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 43",
    "description": "Mahasuci dan mahatinggi dia dari apa yang mereka katakan, bahwa ada tuhan-tuhan selain dia, pemilik 'arasy yang agung. Apa yang mereka katakan adalah dusta. Sungguh, dia mahatinggi, dengan ketinggian yang sebesar-besarnya, jauh sekali dari apa yang mereka katakan. Langit yang tujuh, bumi, dan semua yang ada di dalamnya yakni para malaikat, manusia, jin, dan makhluk lainnya baik yang berakal maupun yang tidak berakal senantiasa dan terus-menerus bertasbih kepada Allah dengan ucapan maupun keadaan yang menunjukkan kepatuhan dan ketundukan kepada hukum Allah. Dan tidak ada sesuatu pun dari mereka yang ada di langit dan di bumi melainkan bertasbih dengan memujinya, dengan caranya, tetapi kamu sekalian tidak mengerti tasbih mereka. Sungguh, dia maha penyantun, maha pengampun kepada hamba-Nya yang berbuat dosa dan mau bertobat kepada-Nya."
  }
]