[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Langit yang tujuh dan bumi yang tujuh lapis, dan semua makhluk yang ada di dalamnya bertasbih kepada Allah . Dan setiap sesuatu di alam ini menyucikan Allah dengan sebenar-benarnya di sertai pujian dan sanjungan bagi Allah . akan tetapi, kalian wahai manusia, tidak dapat memahaminya. Sesungguhnya Dia maha penyantun terhadap para hambaNya, tidak menyegerakan hukuman bagi orang yang melanggar ketentuanNya, maha pengampun bagi mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "44. Langit, bumi, dan semua makhluk yang ada di langit dan bumi senantiasa bertasbih kepada Allah, dan tidak ada suatu makhlukpun melainkan bertasbih mensucikan-Nya sembari memuji dan menyanjung-Nya, tetapi kalian tidak mengetahui cara mereka bertasbih, sebab kalian tidak mengetahui kecuali cara tasbih yang diucapkan dengan bahasa kalian. Sungguh Dia Maha Penyantun, tidak menyegerakan azab bagi hamba-Nya, lagi Maha Pengampun bagi hamba-hamba-Nya yang bertobat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "44. Tujuh langit dan bumi serta segala yang ada di dalamnya mengucapkan tasbih. Dan tidak ada sesuatu yang ada dalam alam semesta ini melainkan ia bertasbih dan bertahmid memuji Allah, akan tetapi kalian tidak memahami tasbih mereka. Allah Maha Lembuh kepada hamba-hamba-Nya, sehingga Dia tidak segera mengazab mereka, namun mengampuni dosa-dosa orang yang bertaubat di antara mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "44. تُسَبِّحُ لَهُ السَّمٰوٰتُ السَّبْعُ وَالْأَرْضُ وَمَن فِيهِنَّ ۚ (Langit yang tujuh, bumi dan semua yang ada di dalamnya bertasbih kepada Allah) Yakni dan semua makhluk-makhluk yang berakal seperti malaikat, manusia, dan jin. وَإِن مِّن شَىْءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِۦ(Dan tak ada suatupun melainkan bertasbih dengan memuji-Nya) Yang meliputi segala sesuatu, apapun itu; sebab seluruh makhluk mengakui bahwa Allah adalah Sang Pencipta yang Maha Kuasa. Terdapat pendapat dari beberapa ulama bahwa tasbih tersebut adalah tasbih yang sebenarnya yang dilafadzkan oleh seluruh makhluk, namun manusia tidak dapat mendengar atau memahaminya. Imam Bukhari, Imam Muslim, dan lainnya meriwayatkan dari Abu Hurairah, ia berkata: Rasulullah bersabda: suatu hari seekor semut menggigit seorang Nabi, lalu Nabi tersebut memerintahkan agar membakar satu koloni dari semut tersebut. Maka Allah mewahyukan kepada-Nya: “apakah karena satu ekor semut kamu membakar satu umat yang senantiasa bertasbih?” وَلٰكِن لَّا تَفْقَهُونَ تَسْبِيحَهُمْ ۗ( tetapi kamu sekalian tidak mengerti tasbih mereka) Yakni kalian tidak memahami apa yang dikatakan oleh benda-benda mati. Terdapat pendapat mengatakan bahwa kalimat ini ditujukan bagi orang-orang kafir yang tidak mau mengambil pelajaran dari sesuatu. إِنَّهُۥ كَانَ حَلِيمًا غَفُورًا(Sesungguhnya Dia adalah Maha Penyantun lagi Maha Pengampun) Bagian dari kelembutan-Nya adalah dengan tidak menyegerakan siksaan bagi kalian. Dan bagian dari ampunan-Nya adalah Allah tidak menyiksa orang yang telah bertaubat."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Sesungguhnya seluruh penjuruh dan lapisan langit dan bumi yang luas ini bertasbih dan memuji Tuhannya; lalu kenapa kita justru menyimpang dan tidak tercelup sebagaimana tercelupnya alam ini?ketahuilah bahwa sesungguhnya kedurhakaan adalah jalan kebinasaan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "44. Maha Suci Allah dari sesuatu yang tidak sesuai denganNya. Langit yang tujuh, bumi dan makhluk (malaikat, manusia, jin dan makhluk yang tidak berakal) di dalamnya mensucikan hakikatNya, atau mensucikanNya melalui lisan yang mana dengan keberadaan dan keyakinan terhadap lisan itu bisa menunjukkan kepada adanya sang pencipta lisan yang Maha Esa. Dan tidak ada satupun dari hewan, tumbuhan dan benda-benda mati kecuali mensucikan Allah. Namun kalian tidak mengetahui tasbih mereka, wahai manusia, karena itu berbeda dengan bahasa kalian. Sesungguhnya Allah itu Maha Bersabar atas hamba-hambanya yang bermaksiat dengan tidak cepat-cepat memberi hukuman, dan Maha Pengampun bagi orang yang bertaubat dan kembali"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Langit yang tujuh, bumi, dan semua yang ada di dalamnya bertasbih kepada Allah. Tidak ada sesuatu pun, kecuali bertasbih dengan memujiNya} menyucikanNya dengan disertai pujian kepadaNya {tetapi kalian tidak mengerti} tidak memahami {(cara) bertasbih mereka. Sesungguhnya Dia Maha Penyantun lagi Maha Pengampun"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "44. Oleh karena itu, Allah berfirman “Langit yang tujuh, bumi dan semua yang ada di dalamnya bertasbih kepada Allah. Dan tidak ada suatu pun,” dari manusia, hewan , pepohonan, tumbuhan dan benda padat, yang hidup maupun yang mati “melainkan bertasbih dengan memujiNya,” dengan bahasa lisan dan bahasa tubuh “tetapi kamu sekalian tidak mengerti tasbih mereka,” maksudnya tasbih makhluk lain yang tidak berkomunikasi dengan bahasa kalian. Akan tetapi, semuanya dimengerti oleh Allah, Dzat Yang Maha Mengetahui perkara-perkara ghaib. “Sesungguhnya Dia Maha Penyantun lagi Maha Pengampun,” lantaran Allah tidak menyegerakan (hukuman) azab atas orang yang berkomentar tentangNya dengan komentar (miring) yang hampir-hampir langit-langit dan bumi pecah, gunung-gunung ikut runtuh menyungkur (karena ucapan itu). Tetapi, DIa memberi penangguhan bagi mereka, mencurahkan nikmat, memberi rizki dan menyeru mereka ke pintu taubat, supaya mereka bertaubat dari dosa yang besar ini. Dan berikutnya Allah memberi mereka pahala yang melimpah dan mengampuni dosa-dosa mereka. Seandainya bukan karena santunan dan ampunan Allah, tentulah langit-langit itu akan dirobohkan hingga tidak menyisakan satu pun dari binatang melata (yang hidup) di muka bumi ini."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 44: Baik hewan yang bisa bicara maupun yang tidak bicara, tumbuhan, tanaman, benda hidup atau benda mati. Yakni dengan lisan mengucapkan, “Subhaanallahi wa bihamdih.” Atau dengan lisanulhal (keadaan yang menunjukkan bertasbih dan memuji-Nya). Karena tidak menggunakan bahasa kamu. Dia tidak segera menyiksa orang yang mengucapkan kata-kata batil itu yang langit dan bumi hampir pecah karenanya, dan gunung-gunung luluh karenanya. Tetapi Dia menangguhkan mereka, memberi rezeki kepada mereka serta mengajak mereka mendatangi pintu-Nya dengan bertobat dari dosa yang sangat besar itu, agar Dia memberikan mereka pahala yang besar dan mengampuni dosa mereka. Kalau bukan karena santun dan ampunan-Nya, tentu langit telah jatuh menimpa bumi dan tentu tidak ada makhluk bergerak pun yang masih tinggal di bumi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 44",
    "description": "Langit yang tujuh, bumi, dan semua yang ada di dalamnya yakni para malaikat, manusia, jin, dan makhluk lainnya baik yang berakal maupun yang tidak berakal senantiasa dan terus-menerus bertasbih kepada Allah dengan ucapan maupun keadaan yang menunjukkan kepatuhan dan ketundukan kepada hukum Allah. Dan tidak ada sesuatu pun dari mereka yang ada di langit dan di bumi melainkan bertasbih dengan memujinya, dengan caranya, tetapi kamu sekalian tidak mengerti tasbih mereka. Sungguh, dia maha penyantun, maha pengampun kepada hamba-Nya yang berbuat dosa dan mau bertobat kepada-Nya. Pada ayat yang lalu Allah menyatakan bahwa kaum musyrik tidak memperoleh manfaat dari kehadiran Al-Qur'an walaupun telah berulang kali peringatan dijelaskan di dalamnya. Terkait dengan ini, Allah berfirman kepada nabi, dan apabila engkau wahai nabi Muhammad membaca Al-Qur'an yang merupakan petunjuk bagi sekalian manusia, niscaya kami adakan antara kamu dan orang-orang yang tidak beriman kepada kehidupan akhirat suatu dinding yang tertutup, yang menjadi penghalang bagi mereka di dalam memahami tuntunan Al-Qur'an."
  }
]