[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apabila engkau membaca al-qur’an, sedang kuam musyrikin mendengarkannya, maka Kami adakan antara engkau dan orang-orang yang tidak beriman kepada akhirat sekat penutup yang menutupi akal-akal mereka untuk memahami al-qur’an sebagai bentuk hukuman bagi mereka atas kekafiran dan keingakaran mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "45. Wahai Rasul! Apabila engkau membaca Al-Qur`ān lantas mereka mendengarkan isi kandungannya berupa peringatan dan mauizah, maka Kami adakan antara engkau dan orang-orang yang tidak beriman kepada hari Kiamat tersebut suatu dinding pemisah yang tidak terlihat, yang menghalangi mereka dari memahami Al-Qur`ān sebagai bentuk hukuman atas pengingkaran mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "45-46. Jika kamu membaca al-Qur’an kemudian orang-orang kafir mendengarnya, maka Kami akan membuat penghalang antara dirimu dengan mereka yang menghalangi penglihatan mereka yang ingin mengganggumu, dan menghalangi hati mereka dari pemahaman al-Qur’an karena Kami telah menutup hati mereka, dan Kami jadikan penutup pada telinga mereka sehingga mereka tidak dapat mendengarnya dengan penuh penghayatan; ini merupakan balasan bagi mereka. Hai Nabi, dan jika kamu menyebut nama Tuhanmu untuk menyeru kepada keesaan-Nya, niscaya mereka akan segera berpaling seperti keledai yang berlari dari seekor singa."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "45. حِجَابًا مَّسْتُورًا (suatu dinding yang tertutup) Yakni keberpalingan mereka dari bacaan al-Qur’anmu seperti orang yang diantara kamu dan dirinya terdapat pembatas yang menghalanginya pendengaran."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "45-46 1 ). Sebagian ahli tafsir berpendapat bahwa : maksud pada penghujung ayat ini adalah penutup. Namun yang tepat adalah membawa makna ayat pada kalimat asalnya. Yakni, suatu dinding yang tertutup dari penglihatan mata sehingga ia tidak nampak olehnya, maka dengan ini maknanya lebih tepat. 2 ). Menjadi pelajaran penting yaitu tatkala Allah menyebutkan penafian pngetahuan dan pendustaan daripada musuh-musuh para Rasul, maka bakal kita temukan sebagian dari mereka ada yang menolak untuk mengingat Allah, dan ada juga yang menolak untuk mentadabburi kitab-Nya, dan lebih daripada itu mereka justru memilih apa yang dibacakan oleh syaithon kepada wali-wali mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "45. Dan apabila kamu membaca Al-Qur’an, wahai Nabi, maka Kami akan membuatkan antara kamu dan orang-orang yang tidak mengimani akhirat sebuah dinding penghalang yang menghalangimu dari mereka, sehingga mereka tidak bisa melihatmu. Maksudnya adalah Kami menciptakan sekat-sekat yang mencegah mereka untuk mengambil manfaat dan pelajaran dari Al-Qur’an karena penolakan mereka terhadap Al-Qur’an dan dirimu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apabila kamu membaca Al-Qur’an, Kami membuat antara kamu dan orang-orang yang tidak beriman pada akhirat suatu tabir yang tertutup (45)} tabir pernghalang yang mencegah mereka untuk memahaminya dan mengambil manfaat darinya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "45. Allah mengabarkan tentang hukuman bagi para pendusta kebenaran, yaitu orang-orang yang menampik dan memalingkan diri dari kebenaran, bahawasanya Allah menghalangi keimanan (dari hati mereka). Allah berfirman, “Dan apabila kamu membaca al-Quran,” yang bermuatan pelajaran, peringatan, petunjuk iman, kebaikan, dan ilmu yang melimpah “niscaya Kami adakan antara kamu dan orang-orang yang tidak beriman kepada kehidupan akhirat, suatu dinding yang tertutup,” yang betul-betul menghalangi mereka untuk memahami al-Quran, meneliti hakikatnya dan tunduk kepada kebaikan yang diserukannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 45: Allah Subhaanahu wa Ta'aala memberitahukan hukuman-Nya kepada orang-orang yang mendustakan kebenaran; yang menolak dan berpaling daripadanya, bahwa Dia menghalangi mereka dari beriman. Yang di dalamnya mengandung nasehat, peringatan, petunjuk, kebaikan dan ilmu yang banyak. Yang menutupi mereka dari memahaminya dan dari tunduk kepada seruannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 45",
    "description": "Pada ayat yang lalu Allah menyatakan bahwa kaum musyrik tidak memperoleh manfaat dari kehadiran Al-Qur'an walaupun telah berulang kali peringatan dijelaskan di dalamnya. Terkait dengan ini, Allah berfirman kepada nabi, dan apabila engkau wahai nabi Muhammad membaca Al-Qur'an yang merupakan petunjuk bagi sekalian manusia, niscaya kami adakan antara kamu dan orang-orang yang tidak beriman kepada kehidupan akhirat suatu dinding yang tertutup, yang menjadi penghalang bagi mereka di dalam memahami tuntunan Al-Qur'an. Dan kami adakan penutup-penutup di atas hati mereka dan penyumbat di telinga mereka, sesuai dengan kehendak mereka yang tidak percaya kepada kebenaran Al-Qur'an, sehingga mereka tidak dapat memahaminya, yakni memahami tuntunan Al-Qur'an. Dan apabila engkau menyebut tuhanmu saja dalam Al-Qur'an, tanpa menyebut tuhan-tuhan mereka, niscaya mereka berpaling dan lari menjauh ke belakang karena benci dan enggan mendengar tuntunan Al-Qur'an."
  }
]