[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kami jadikan pada hati kaum musyrikin penutup-penutup supaya mereka tidak dapat memahami al-qur’an dan kami adakan sumbatan pada pendengaran-pendengaran mereka supaya mereka tidak dapat mendengarnya. Dan apabila engkau menyebut nama tuhanmu saja dalam al-qur’an untuk mengajak mereka agar mentauhidkanNya dan melarang mereka berbuat syirik kepadaNya, mereka kembali berpaling dengan lari dari ajakanmu, lantaran kesombongan dan keangkuhan mereka untuk mentauhidkan Allah dalam ibadah kepadaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "46. Dan Kami jadikan hati mereka tertutup agar tidak memahami kandungan Al-Qur`ān, dan menjadikan telinga mereka tersumbat agar tidak mendapatkan manfaat ketika mendengarkannya, dan apabila engkau menyebut Tuhanmu saja dalam Al-Qur`ān dan tidak menyebut nama-nama tuhan yang mereka klaim, mereka segera berpaling ke belakang demi menjauhkan diri dari kemurnian tauhid kepada Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "46. وَجَعَلْنَا عَلَىٰ قُلُوبِهِمْ أَكِنَّةً (dan Kami adakan tutupan di atas hati mereka) Yakni tutup bagi hati mereka. أَن يَفْقَهُوهُ(agar mereka tidak dapat memahaminya) Yakni agar mereka tidak dapat memahaminya. وَفِىٓ ءَاذَانِهِمْ وَقْرًا ۚ( dan ada sumbatan di telinga mereka) Yakni terdapat beban yang membuat mereka tuli. وَإِذَا ذَكَرْتَ رَبَّكَ فِى الْقُرْءَانِ وَحْدَهُۥ (Dan apabila kamu menyebut Tuhanmu saja dalam Al Quran) Tanpa menyebutkan tuhan-tuhan mereka sebagai perantara. وَلَّوْا۟ عَلَىٰٓ أَدْبٰرِهِمْ نُفُورًا (niscaya mereka berpaling ke belakang karena bencinya) Yakni mereka menghadapkan punggung mereka kepadamu dan melangkah pergi agar tidak mendengar bacaan al-Qur’an."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "46. Dan Kami membuat penutup atas hati mereka supaya mereka tidak memahami Al-Qur’an. Dan dalam telinga mereka ada suatu keberatan dan ketulian yang mencegah mereka untuk mendengar, mengambil pelajaran dan berangan-angan tentang Al-Qur’an. Dan jika kamu hanya mengingat Tuhanmu tanpa mengingat tuhan-tuhan mereka, wahai nabi, maka mereka akan kembali ke tempat mereka dengan melarikan diri supaya tidak mendengarmu. Ayat ini diturunkan saat Nabi SAW bersabda di rumah Abu Thalib: “Wahai orang-orang Quraisy, ucapkanlah “Laa ilaaha Illallah” maka dengan itu kalian akan memiliki (sekutu) bangsa Arab dan mendapatkan pinjaman dari orang asing.” Lalu mereka berpaling. Kemudian turunlah ayat ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kami menjadikan di atas hati mereka penutup-penutup sehingga mereka tidak memahaminya} penutup-penutup agar mereka tidak bisa memahaminya {dan di telinga mereka ada penyumbat} penyumbat agar mereka tidak bisa mendengarkan manfaat darinya {Apabila kamu menyebu Tuhanmu saja dalam Al-Qur’an, mereka berpaling ke belakang} mereka kembali ke belakang {melarikan diri} melarikan diri menghindar dari mendengar kata Tauhid"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "46. “Dan Kami adakan tutupan di atas hati mereka,” maksudnya penutup yang membuat mereka tidak bisa mencerna al-Quran, padahal mereka mampu mendengarnya (dengan telinga mereka) dengan jelas, sehingga hujjah telah tegak atas mereka. “Dan sumbatan di telinga mereka,” maksudnya ketulian untuk menyimaknya. “Dan apabila kamu menyebut Rabbmu saja dalam al-Quran,” dalam rangka menyerukan keesaan Allah dan melarang dari perbuatan syirik “niscaya mereka berpaling ke belakang karena bencinya,” karena sangat besarnya antipasti mereka terhadap seruanmu dan kecintaan terhadap kebatilan mereka selama ini, sebagaimana Allah berfirman, \"Dan apabila hanya nama Allah saja yang disebut, kesallah hati orang-orang yang tidak beriman kepada kehidupan akhirat; dan apabila nama sembahan-sembahan selain Allah yang disebut, tiba-tiba mereka bergirang hati. \" (Az-Zumar:45)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 46: Yang mengajak untuk mentauhidkan-Nya dan melarang dari perbuatan syirk. Dan lebih sukanya mereka kepada kebatilan. Hal ini sebagaimana firman Allah Ta’ala, “Dan apabila hanya nama Allah saja disebut, kesallah hati orang-orang yang tidak beriman kepada kehidupan akhirat; dan apabila nama sembahan-sembahan selain Allah yang disebut, tiba-tiba mereka bergirang hati.” (Az Zumar: 45)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 46",
    "description": "Dan kami adakan penutup-penutup di atas hati mereka dan penyumbat di telinga mereka, sesuai dengan kehendak mereka yang tidak percaya kepada kebenaran Al-Qur'an, sehingga mereka tidak dapat memahaminya, yakni memahami tuntunan Al-Qur'an. Dan apabila engkau menyebut tuhanmu saja dalam Al-Qur'an, tanpa menyebut tuhan-tuhan mereka, niscaya mereka berpaling dan lari menjauh ke belakang karena benci dan enggan mendengar tuntunan Al-Qur'an. Apa yang dilakukan kaum musyrik itu tidak luput dari pengetahuan Allah. Kami lebih mengetahui dalam keadaan bagaimana mereka mendengarkan sewaktu mereka mendengarkan engkau, bahwa mereka melecehkan kamu dan mencari-cari celah untuk menolak kebenaran Al-Qur'an, dan sewaktu mereka berbisik-bisik di antara mereka sendiri untuk mendustakan Al-Qur'an, yaitu ketika orang-orang zalim itu berkata, kamu tidak lain hanyalah mengikuti seorang laki-laki yang kena sihir."
  }
]