[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kami lebih mengetahui apa yang didengarkan oleh para pemuka suku quraisy, ketika mereka mendengarkannmu, sedang tujuan mereka adalah jahat. Mereka menyimak bukanlah demi mendapatkan petunjuk dan menerima kebenaran. Dan kami mengetahui bisikan-bisikan antar mereka sewaktu mereka berkata, ”kalian itu tidaklah mengikuti kecuali seorang lelaki yang kena sihir hingga akalnya pun kacau. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "47. Kami lebih mengetahui bagaimana para pemuka mereka mendengarkan Al-Qur`ān. Mereka mendengarkannya bukan untuk mendapatkan petunjuk darinya, namun hanya ingin mencemooh dan bersenda gurau tatkala engkau membacanya. Dan Kami juga lebih mengetahui apa yang orang-orang musyrik itu bisik-bisikkan berupa klaim dusta dan untuk menghalangi manusia darinya (Muhammad), sewaktu mereka berkata kufur pada diri mereka sendiri, Wahai manusia, kalian tidaklah mengikuti kecuali seorang laki-laki yang terkena sihir lagi tidak waras akalnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "47-48. Allah menyingkap kedustaan para pemimpin orang-orang musyrik Makkah bagi Nabi Muhammad: “Kami Maha Mengetahui keadaan mereka saat mereka mendengarmu membaca al-Qur’an kemudian mereka saling berbisik, ketika orang-orang zalim yang menghina Nabi dan al-Qur’an itu berkata, ‘Kalian tidak lain hanya mengikuti orang yang terkena sihir sehingga dia berkata sesuatu yang tidak jelas’. Hai Nabi, lihatlah bagaimana mereka menyebutmu dengan sebutan-sebutan yang sangat jauh dari sifatmu yang sebenarnya dengan mengatakan kamu adalah tukang sihir, syair, dan orang gila? Mereka telah tersesat akibat kedustaan ini, sehinga mereka tidak mendapatkan jalan kebenaran."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "47. نَّحْنُ أَعْلَمُ بِمَا يَسْتَمِعُونَ بِهِۦٓ (Kami lebih mengetahui dalam keadaan bagaimana mereka mendengarkan) Yakni mereka meremehkanmu dan mengolok al-Qur’an, serta bermain-main saat kamu menyebut Tuhanmu saja tanpa menyebut tuhan-tuhan mereka. وَإِذْ هُمْ نَجْوَىٰٓ (dan sewaktu mereka berbisik-bisik) Yakni dan Kami lebih mengetahui apa yang mereka bisikkan saat merea saling berbisik tentang kedustaan dan ejekan. إِذْ يَقُولُ الظّٰلِمُونَ إِن تَتَّبِعُونَ إِلَّا رَجُلًا مَّسْحُورًا (ketika orang-orang zalim itu berkata: “Kamu tidak lain hanyalah mengikuti seorang laki-laki yang kena sihir”) Yakni orang yang terkena sihir sehingga akalnya terganggu dan kurang waras."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "47. Kami lebih mengetahui tentang keadaan mereka saat mendengarkan Al-Qur’an. Mereka itu adalah orang-orang mengolok-olok dirimu dan Al-Qur’an, yaitu ketika orang-orang musyrik itu mendengarkanmu saat membaca Al-Qur’an, saat mereka saling berbisik secara samar-samar untuk mendustakan dan menghina Al-Qur’an, dan saat mereka berkata: “Tidak ada yang kalian ikuti kecuali seorang laki-laki yang telah diguna-guna sehingga dia kehilangan akal dan menjadi gila”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kami lebih tahu bagaimana mereka mendengarkannya saat mereka mendengarkanmu dan berbisik-bisik} Kami lebih tahu terhadap sesuatu yang mereka rahasiakan terkait perkaramu {ketika orang-orang zalim itu berkata,“Kalian hanya mengikuti seorang laki-laki yang terkena sihir”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "47. “Kami lebih mengetahui dalam keadaan bagaimana mereka mendengarkan,” maksudnya, sesungguhnya Kami menghambat mereka dari perolehan manfaat tatkala mendengarkan al-Quran, karena Kami tahu bahwa niatan-niatan mereka jelek. Mereka ingin mencari-cari kekurangan sekecil apa pun untuk tujuan mendiskreditkan al-Quran, tujuan mendengarnya mereka bukan untuk mencari petunjuk dan menerima kebenaran. Mereka tetap bertekad untuk tidak mengikuti al-Quran. Maka barangsiapa keadaannya demikian adanya, niscaya mendengarkan al-Quran tidak akan berguna baginya sedikitpun. Untuk itu, Allah berfirman, “Sewaktu mereka mendengarkan kamu, dan sewaktu mereka berbisik-bisik,” yaitu mereka saling berbisik, “(yaitu) ketika orang-orang zhalim itu berkata,” dalam pembicaraan mereka yang lirih “Kamu tidak lain hanyalah mengikuti seorang laki-laki yang kena sihir.” Maka apabila seperti ini bentuk bisikan kezhaliman yang beredar di antara mereka, dan mereka telah mengembangkan opini (mereka) bahwa Rasulullah itu terkena sihir, berarti mereka tidak mau menghiraukan perkataan beliau, dan sedang mengigau, tidak paham apa yang dikatakan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 47: Yakni Kami cegah mereka dari mengambil manfaat ketika mendengarkan Al Qur’an, karena Kami mengetahui niat mereka yang buruk, di mana mereka ingin mencari-cari kesalahan untuk mencelamu. Mendengarnya mereka bukan untuk mengambil petunjuk dan menerima yang hak karena mereka sudah kokoh untuk tidak mengikutinya. Dalam bisik-bisik mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 47",
    "description": "Apa yang dilakukan kaum musyrik itu tidak luput dari pengetahuan Allah. Kami lebih mengetahui dalam keadaan bagaimana mereka mendengarkan sewaktu mereka mendengarkan engkau, bahwa mereka melecehkan kamu dan mencari-cari celah untuk menolak kebenaran Al-Qur'an, dan sewaktu mereka berbisik-bisik di antara mereka sendiri untuk mendustakan Al-Qur'an, yaitu ketika orang-orang zalim itu berkata, kamu tidak lain hanyalah mengikuti seorang laki-laki yang kena sihir. Allah memerintahkan kepada rasul, lihatlah bagaimana mereka membuat perumpamaan-perumpamaan terhadapmu, dengan menggunakan kata-kata seperti dukun, penyair, penyihir, gila, dan sebagainya, karena itu mereka menjadi sesat, jauh dari petunjuk tuhan, dan tidak dapat lagi menemukan jalan yang benar menuju kepadanya."
  }
]