[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "pikirkanlah olehmua (Wahai rasul) ucapan mereka dengan penuh keheranan, ”sesungguhnya Muhammad adalah tukang sihir, penyair, orang gila!” Mereka telah melampaui batas dan menyimpang, serta tidak memperoleh cahaya hidayah menuju jalan yang lurus lagi benar."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "48. Perhatikanlah -wahai Rasul-, agar engkau merasa heran dengan apa yang mereka sifatkan pada dirimu berupa sifat tercela yang beragam, sehingga merekapun menyimpang dan terombang-ambing dari jalan kebenaran, dan tidak dapat lagi menemukan jalan kebenaran tersebut."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "48. انظُرْ كَيْفَ ضَرَبُوا۟ لَكَ الْأَمْثَالَ (Lihatlah bagaimana mereka membuat perumpamaan-perumpamaan terhadapmu) Yakni mereka kadang mengatakan bahwa kamu adalah seorang dukun, tukang sihir, penyair, atau orang gila. فَضَلُّوا۟ (karena itu mereka menjadi sesat) Sesat dari jalan yang benar dalam semua tuduhan mereka itu. فَلَا يَسْتَطِيعُونَ سَبِيلًا (dan tidak dapat lagi menemukan jalan (yang benar)) Yakni jalan menuju hidayah atau jalan agar dapat mengarahkan tuduhan kepadamu yang dapat diterima oleh akal sehingga mereka dapat dipercaya dalam tuduhan tersebut."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "48. Lihatlah wahai nabi, bagaimana mereka membuat perumpamaan-perumpamaan berbeda tentangmu karena mereka teguh dan terjerumus dalam kekufuran. Mereka berkata tentangmu: “Seorang penyihir, dukun, penyair, dan orang gila” Mereka salah dalam menempuh jalan hidayah dan kebenaran sehingga mereka tidak akan pernah menemukan jalan menuju hal itu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Perhatikanlah bagaimana mereka membuat perumpamaan-perumpamaan tentangmu} mereka menyerupakanmu dengan beberapa hal yang mereka katakan yaitu penyihir, penyair, dan orang gila {Maka sesatlah mereka} maka tersesatlah mereka dari kebenaran {sehingga mereka tidak sanggup (mendapatkan) jalan} jalan menuju kebenaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "48. Allah berfirman, “Lihatlah,” dengan keheranan. “Bagaimana mereka membuat perumpamaan-perumpamaan terhadapmu,” yang merupakan perumpamaan paling sesat dan paling jauh dari kebenaran “karena itu mereka menjadi sesat,” dalam masalah itu, atau menjadi faktor penyebab kesesatan mereka. Hal ini disebabkan mereka sendiri yang melandasi urusan mereka di atas pondasi kesesatan. Maka, suatu perkara yang dibangun di atas kerusakan, akan lebih parah kerusakannya. Maka mereka tidak menemukan “jalan (kebenaran),” maksudnya mereka tidak mendapat petunjuk apa pun. Maka jatah bagi mereka adalah kesesatan yang utuh dan kezhaliman yang murni."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 48: Sambil merasakan keanehan dari mereka. Dengan menyebutmu sebagai orang yang terkena sihir, dukun, penyair, dan memberikan perumpamaan lainnya untukmu yang merupakan perumpamaan yang paling sesat dan paling jauh dari kebenaran. Dari petunjuk."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 48",
    "description": "Allah memerintahkan kepada rasul, lihatlah bagaimana mereka membuat perumpamaan-perumpamaan terhadapmu, dengan menggunakan kata-kata seperti dukun, penyair, penyihir, gila, dan sebagainya, karena itu mereka menjadi sesat, jauh dari petunjuk tuhan, dan tidak dapat lagi menemukan jalan yang benar menuju kepadanya. Pada ayat yang lalu, Allah membicarakan perkara kenabian dan bantahan kepada kaum musyrik yang memperolok-olokkan nabi dan mendustakan Al-Qur'an. Kemudian pada ayat ini Allah membantah keragu-raguan mereka terhadap akhirat, kebangkitan dan pembalasan. Allah menyatakan, dan mereka, orang-orang yang tidak percaya kepada hari kebangkitan, berkata, apakah bila kami telah menjadi tulang-belulang yang berserakan dan benda-benda yang hancur, terpisah satu dengan yang lain apakah kami benar-benar akan dibangkitkan kembali sebagai makhluk yang baru'."
  }
]