[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang musyrik berkata dengan nada pengingkaran bahwa mereka akan diciptakan kembali dalam bentuk baru, setelah tulang belulang mereka lapuk dan mereka menjadi hancur, ”apakah kami benar-benar akan dibangkitkan kembali pada hari kiamat sebagai makhluk yang baru?\""
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "49. Dan orang-orang musyrik tersebut berkata -sebagai bentuk pengingkaran terhadap Hari Kebangkitan-, \"Apabila kami telah mati dan menjadi tulang-belulang, serta jasad kami telah hancur, apakah kami akan dibangkitkan kembali sebagai makhluk yang baru? Sungguh ini adalah perkara yang mustahil terjadi.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "49. Orang-orang kafir mengingkari adanya hari kebangkitan dengan berkata: “Jika kita telah menjadi tulang belulang yang tercerai berai, apakah kita akan dibangkitkan dan diciptakan kembali setelah kematian?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "49. وَقَالُوٓا۟ أَءِذَا كُنَّا عِظٰمًا وَرُفٰتًا (Dan mereka berkata: “Apakah bila kami telah menjadi tulang belulang dan benda-benda yang hancur) Makna (الرفات) yakni segala sesuatu yang telah hancur dan usang. Yakni ketika mereka telah hancur dan jasad mereka telah usang setelah kematian mereka. Dan pendapat lain mengatakan yang dimaksud dengan (الرفات) yakni tanah. (yakni jika mereka telah menjadi tanah) أَءِنَّا لَمَبْعُوثُونَ خَلْقًا جَدِيدًا(apa benar-benarkah kami akan dibangkitkan kembali sebagai makhluk yang baru?”) Ini merupakan pertanyaan yang bertujuan untuk mengingkari atau mengungkapkan kemustahilan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "49. Dan orang-orang musyrik yang mendustakan hari kebangkitan itu berkata: “Apakah jika kita telah menjadi tulang-belulang yang sudah tua dan sudah hancur menjadi potongan-potongan yang rusak, kami akan dibangkitkan sebagai ciptaan baru yang dapat menikmati kehidupan setelah mati?!”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka berkata,“Apabila kami telah menjadi tulang-belulang dan kepingan-kepingan} debu {apakah kami benar-benar akan dibangkitkan kembali sebagai makhluk yang baru”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "49. Allah mengabarkan tentang perkataan para pengingkar Hari Kebangkitan dengan perkataan mereka, “Apakah bila kami telah menjadi tulang dan benda-benda yang hancur,” maksudnya jasad-jasad yang telah rusak “apa benar-benar kami akan dibangkitkan kembali sebagai makhluk yang baru?” ini tidak akan terjadi, mustahil menurut mereka. Mereka adalah orang-orang yang sangat bodoh, lantaran mendustakan utusan Allah, menentang ayat-ayatNya, dan menyamakan kemampuan al-KHaliq (Sang Pencipta) langit dan bumi dengan kemampuan mereka yang sangat lemah. Tatkala memandang hal itu (kebangkitan setelah mati) tidak mungkin terjadi, dan mereka pun tidak sanggup melakukannya, maka mereka pun menilai kekuasaan Allah demikian pula. Mahasuci Dzat yang telah menjadikan sebagian makhluk dari makhlukNYa –yang mana mereka mengklaim sebagai orang-orang yang berakal dan cerdas- sebagai symbol kebodohan pada sesuatu yang paling jelas, paling gambling lagi paling terang serta paling tinggi petunjuknya, supaya memperlihatkan kepada para hambaNya, bahwa tidak ada alternative lain melainkan taufik dan pertolonganNYa atau kebinasaan dan kesesatan. \"(Mereka berdoa): \"Ya Tuhan kami, janganlah Engkau jadikan hati kami condong kepada kesesatan sesudah Engkau beri petunjuk kepada kami, dan karuniakanlah kepada kami rahmat dari sisi Engkau; karena sesungguhnya Engkau-lah Maha Pemberi (karunia).\" (Ali Imran:8)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 49: Sambil mengingkari kebangkitan. Menurut mereka, hal itu mustahil. Sungguh lemah sekali akal mereka, mereka samakan kemampuan Pencipta langit dan bumi dengan kemampuan mereka yang lemah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 49",
    "description": "Pada ayat yang lalu, Allah membicarakan perkara kenabian dan bantahan kepada kaum musyrik yang memperolok-olokkan nabi dan mendustakan Al-Qur'an. Kemudian pada ayat ini Allah membantah keragu-raguan mereka terhadap akhirat, kebangkitan dan pembalasan. Allah menyatakan, dan mereka, orang-orang yang tidak percaya kepada hari kebangkitan, berkata, apakah bila kami telah menjadi tulang-belulang yang berserakan dan benda-benda yang hancur, terpisah satu dengan yang lain apakah kami benar-benar akan dibangkitkan kembali sebagai makhluk yang baru'katakanlah wahai nabi Muhammad, jadilah kamu sekalian, apa saja, batu atau besi, niscaya tuhan akan mengembalikan kamu kepada keadaan semula ketika diciptakan."
  }
]