[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka ketika terjadi kerusakan pertama yang mereka timbulkan, Kami datangkan kepada mereka hamba-hamba kami yang memiliki keberanian dan kekuatan luarbiasa untuk menguasai mereka, lalu mempencundangi mereka, membunuhi mereka serta mengusir mereka. Orang-orang itu berkeliling di perkampungan-perkampungan mereka dengan merusak. Itu merupakan suatu ketetapan yang mesti terjadi, karena ada faktor penyebabnya dari kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Apabila kerusakan yang pertama telah terjadi, Kami akan mendatangkan hamba-hamba Kami yaitu suatu kaum yang memiliki keperkasaan dan kekuatan besar untuk menguasai mereka, serta membunuh dan mengusir mereka. Lalu mereka merajalela di kampung-kampung (Bani Israil) sembari merusak segala yang mereka temui. Sungguh janji Allah tentang peristiwa ini pasti terjadi dan terlaksana."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "5. Jika kerusakan pertama yang mereka lakukan telah terjadi, maka Kami akan menjadikan mereka di bawah kekuasaan hamba-hamba Kami yang sangat kejam dan memiliki kekuatan yang sangat besar, mereka akan menyebar ke perumahan untuk memeriksa keberadaan Bani Israil untuk mereka bunuh dan mereka tangkap. Ini merupakan janji yang pasti akan terjadi karena kerusakan pertama yang mereka lakukan sebelum terjadinya peperangan Thalut melawan Jalut yang telah disebutkan dalam surat al-Baqarah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. فَإِذَا جَآءَ وَعْدُ أُولَىٰهُمَا (Maka apabila datang saat hukuman bagi (kejahatan) pertama) Yakni kerusakan pertama yang mereka perbuat dari dua kerusakan sebagaimana disebutkan. بَعَثْنَا عَلَيْكُمْ عِبَادًا لَّنَآ أُو۟لِى بَأْسٍ شَدِيدٍ(Kami datangkan kepadamu hamba-hamba Kami yang mempunyai kekuatan yang besar) Yakni para pemilik kekuatan dalam peperangan dan ketangguhan saat pertempuran. Terdapat pendapat mengatakan orang yang dimaksud adalah Nebukadnezar dan bala tentaranya, para penduduk Babilonia. فَجَاسُوا۟ خِلٰلَ الدِّيَارِ ۚ( lalu mereka merajalela di kampung-kampung) Yakni menyerang dan masuk-masuk ke pemukiman untuk mencari dan membunuh mereka. وَكَانَ (dan itulah) Yakni kejadian itu. وَعْدًا مَّفْعُولًا (ketetapan yang pasti terlaksana) Yakni pasti terjadi. Atau mungkin juga maksudnya adalah telah terjadi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Dan apabila telah datang janji untuk dua kerusakan itu dan janji hukuman atas hal itu, maka Kami akan mengutus kepada kalian para hamba Kami yang memiliki kekuatan dalam berperang dan berbuat kekerasan yaitu para penyembah berhala dari daerah Babilonia di Iraq. Mereka itu adalah Nebuchadnezar dan pasukannya. Mereka masuk dan menjebol rumah-rumah kalian untuk mencari, membunuh dan menawan kalian serta merampas kehormatan kalian. Dan janji hukuman kalian itu terbuka lebar dan pasti terjadi."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apabila datang waktu yang pertama dari keduanya} waktu pertama dari keduanya yaitu kerusakan dan kesombongan {Kami mendatangkan} Kami mengutus {kepada kalian hamba-hamba Kami yang memiliki kekuatan yang besar} memiliki kekuatan yang besar {lalu mereka merajalela} mereka berkeliling dan bergema {di antara kampung-kampung} di antara kampung-kampung {Itulah janji yang pasti terlaksana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5. “Maka apabila datang saat hukuman bagi (kejahatan) pertama dari kedua (kejahatan) itu,” kerusakan pertama dari dua kerusakan yang akan mereka perbuat. Maksudnya, jika telah terjadi kerusakan (pertama) dari mereka, maka “Kami datangkan kepadamu,” kedatangan ketetapan takdir, dan Kami akan menguasakan (musuh-musuh) atas kalian yang merupakan ketetapan kauni dan sebagai pembalasan, “hamba-hamba Kami yang mempunyai kekuatan besar,” yaitu orang-orang yang memiliki keberanian, jumlah personel yang banyak dan kekuatan (yang penuh). Lalu Allah akan memenangkan mereka atas kalian. Mereka akan membunuhi kalian, menawan anak-anak kalian, dan merampasi kekayaan-kakayaan kalian serta merajalela “di kampung-kampung,” menerjang kampung-kampung. Mereka juga akan menerobos ke Masjidil Haram dan merusaknya. “Dan itulah ketetapan yang pasti terlaksana,” yang pasti akan terjadi karena adanya faktor penyebab dari mereka. Para ahli tafsir berbeda pendapat tentang penentuan siapakah mereka yang diberi kekuasaan (mengalahkan Bani Israil). Hanya saja, para ulama itu bersepakat bahwasanya mereka adalah kaum kuffar, bisa jadi dari penduduk Irak, jazirah Arab atau selain mereka. Allah akan memberikan kekuasaan pada kaum itu atas Bani Israil, di kala telah merebak kemaksiatan di tengah-tengah Bani Israil dan meninggalkan banyak aturan syariat Allah dan melampaui batas di atas bumi."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (أُولَىٰهُمَا) uulaahumaa : yang pertama dari dua perkara. (فَجَاسُواْ خِلَٰلَ) fa jaasuu khilaal : keluar masuk ketengah negeri untuk membunuh dan membuat kerusakan. (وَعۡدٗا مَّفۡعُولٗا) wa’adam maf’uulaa : janji yang pasti terpenuhi, tidak akan diingkari. Makna ayat: Firman-Nya “Maka jika telah tiba hukuman bagi kejahatan pertama dari dua kejahatan...” yang pertama “Kami datangkan kepada kalian hamba-hamba Kami yang perkasa...” kekuatan dan keperkasaan ketika perang, dan ini terjadi tatkala mereka berbuat kerusakan dan berbuat zalim dengan melanggar batasan-batasan syariat serta berpaling dari ketaatan kepada Allah ta’ala sampai mereka nabi mereka Armiya ‘alaihis salam, yang dibunuh oleh orang yang zalim Jalut. Lalu Jalut menyerang mereka dari arah Jazirah dan melakukan bersama pasukannya apa yang telah Allah ta’ala kabarkan “lalu mereka merajalela di kampung-kampung...” keluar masuk membunuh dan merusak, sebagai hukuman dari Allah kepada Bani Israil karena mereka telah membuat kerusakan dan kesombongan yang besar. Firman-Nya “Dan itulah ketetapan yang pasti terjadi.” Yaitu apa yang terjadi pada kali pertama berupa pengerusakan dan penghancuran beserta sebab-sebabnya merupakan janji Allah ta’ala yang pasti terjadi, kemudian Dia penuhi, karena Dia telah memutuskan dan mengabarkan keputusan-Nya pada kitab mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 5: Yakni pemberani, berjumlah banyak, dan peralatannya lengkap. Mencari kamu untuk membunuh kamu dan menawan anak-anakmu serta merampas harta kekayaanmu. Para ulama berselisih tentang orang yang menguasai Bani Israil itu, hanyasaja mereka sepakat bahwa mereka yang mengiuasai itu adalah orang-orang kafir. Ada yang mengatakan, bahwa mereka itu adalah Jalut dan tentara-tentaranya, yang membunuh dan menawan Bani Israil serta merobohkan Baitulmaqdis. Allah Subhaanahu wa Ta'aala memberikan kekuasaan kepada musuh saat Bani Israil banyak yang melakukan maksiat, meninggalkan banyak syari’at yang dibebankan kepada mereka serta melampaui batas di muka bumi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 5",
    "description": "Maka apabila datang saat hukuman bagi kejahatan pertama yang kamu perbuat dari kedua kejahatan itu, yang telah ditetapkan kepadamu, kami datangkan kepadamu hamba-hamba kami yang mempunyai kekuatan yang besar untuk menguasai negerimu dan menaklukanmu, lalu mereka merajalela di kampung-kampung, memasuki rumahmu untuk mengejar, menyiksa, dan membunuhmu, dan itulah ketetapan yang pasti terlaksana. Inilah ketetapan Allah atas kaum bani israil disebabkan mereka meninggalkan hukum taurat dan membunuh para nabi. Maka datanglah hukuman Allah. Ketetapan Allah menakdirkan bahwa mereka dapat mengalahkan musuh-Musuhnya dan membangun kembali kerajaannya yang besar. Allah menyatakan, kemudian kami berikan kepadamu giliran untuk mengalahkan mereka kembali, setelah negerimu dikuasai dan ditaklukkan oleh mereka, dan kami membantumu untuk membangun kembali negerimu dan mengokohkan kekuasaanmu dengan harta kekayaan serta anak-anak dan kami jadikan kamu kelompok yang lebih besar dari kelompok kamu sebelumnya."
  }
]