[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "50-51. Katakanlah (wahai rasul), untuk membugkam mereka, ”jadilah kalian batu atau besi dalam hal keras dan kekatannya, jika kalian mampu untuk itu. Atau jadilah kalian makhluk yang besar dan yang mustahil sekalipun untuk dapat di terima oleh akal kalian,” niscaya mereka akan mengatakan (sebagai bentuk pengingkaran), ”siapakah yang akan mengembalikan kami menuju kehidupan lagi setelah kematian?” katakanlah kepada mereka, ”yang mengulang dan mengembalikan kalian adalah Allah yang telah menciptakan kalian pertama kali dari tidak ada.” sewaktu mereka mendengarkan jawaban ini, mereka akan menggeleng-gelengkan kepala-kepala mereka dengan mengolok-olok dan merasa aneh lantaran menganggapnya mustahil terjadi dan mereka berkata ”kapankah kebangkitan itu terjadi?” katakanlah, ”kalian tidak akan pernah tahu, bahwa kebangkitan yang kalian ingkari dan kalian anggap tidak mungkin itu barangkali sudah dekat waktu terjadinya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "51. Atau jadilah makhluk lain yang lebih besar dari keduanya menurut pikiranmu, namun Allah tetap akan mengembalikan penciptaan kalian sebagaimana Dia menciptakan kalian pertama kali, dan menghidupkan kalian kembali sebagaimana Dia menghidupkan kalian pertama kali\". Niscaya para pembangkang tersebut akan berkata, \"Siapakah yang akan menghidupkan kami kembali setelah kami mati?\", Katakanlah pada mereka, \"Kalian akan dihidupkan kembali oleh Żat yang pertama kali menciptakan kalian.\" Mereka akan menggeleng-gelengkan kepala seraya mencemooh jawabanmu sembari berkata dalam ketidak percayaan, \"Kapankah waktu kehidupan kembali ini?!\". Katakanlah pada mereka, \"Barangkali waktunya telah dekat sebab segala hal yang akan tiba adalah dekat.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "51. أَوْ خَلْقًا مِّمَّا يَكْبُرُ فِى صُدُورِكُمْ ۚ (atau suatu makhluk dari makhluk yang tidak mungkin (hidup) menurut pikiranmu”) Atau jika kalian merupakan makhluk yang sangat besar menurut kalian yang lebih besar dari batu, niscaya kalian pasti akan dibangkitkan juga. فَسَيَقُولُونَ مَن يُعِيدُنَا ۖ( Maka mereka akan bertanya: “Siapa yang akan menghidupkan kami kembali?”) Yakni siapa yang mengembalikan kami pada kehidupan setelah kami telah hancur, atau jika kami adalah batu atau besi. قُلِ الَّذِى فَطَرَكُمْ أَوَّلَ مَرَّةٍ ۚ( Katakanlah: “Yang telah menciptakan kamu pada kali yang pertama”) Yakni Yang akan membangkitkan kalian adalah Allah yang telah menciptakan kalian pertama kali sebelum adanya makhluk seperti kalian. فَسَيُنْغِضُونَ إِلَيْكَ رُءُوسَهُمْ(Lalu mereka akan menggeleng-gelengkan kepala mereka kepadamu) Yakni mereka akan menggerakkan kepala mereka untuk mengolok-olokmu. وَيَقُولُونَ مَتَىٰ هُوَ ۖ (dan berkata: “Kapan itu (akan terjadi)?”) Yakni kapan terjadinya pembangkitan dan pengulangan penciptaan. قُلْ عَسَىٰٓ أَن يَكُونَ قَرِيبًا (Katakanlah: “Mudah-mudahan waktu berbangkit itu dekat”) Yakni mungkin saja sebentar lagi, sebab segala yang akan terjadi pada hakikatnya (dekat) sebentar lagi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "51. Atau jadilah kalian makhluk lain yang mana hal itu tidak masuk akal kalian untuk bisa hidup, yaitu sesuatu yang lebih keras dari batu dan besi, namun sesungguhnya Dia tetap akan menghidupkan dan membangkitkan kalian. Lalu mereka akan berkata: “Siapakah yang menghidupkan kami lagi?” Katakanlah kepada mereka: “Allah, Dzat yang menciptakan kalian pertama kalian, yang akan mengembalikan kalian dan tidak akan menjadi benda” lalu mereka akan mengarahkan kepala mereka ke arahmu untuk mengolok-olok, terkejut dan berkata: “Kapankan hari kebangkitan itu?” Katakanlah kepada mereka: ”Bisa jadi kejadian itu sudah dekat, dan setiap sesuatu yang akan terjadi itu sudah dekat”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Atau makhluk lain yang yang lebih besar} yang lebih besar {menurut kalian” Kemudian, mereka akan bertanya,“Siapa yang akan menghidupkan kami kembali”} yang mengembalikan kami hidup setelah kematian kami {Katakanlah,“Dzat yang telah menciptakan kalian} yang menciptakan kalian {pertama kali” Mereka akan menggeleng-gelengkan kepalanya kepadamu} mereka akan menggelengkan kepada mereka kepadamu dengan heran dan mengejek {dan berkata,“Kapankah itu”} kebangkitan ini {Katakanlah,“Barangkali waktunya sudah dekat”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "50-51. Karena itu, Allah memerintahkan RasulNya untuk berkata kepada para pengingkar Hari Kebangkitan yang menilainya mustahil, “Katakanlah, ‘Jadilah kamu sekalian batu atau besi, atau menjadi suatu makhluk yang besar (yang tidak mungkin hidup kembali)’ .” Maksudnya, makhluk yang membesar “menurut pikiranmu,” supaya kamu selamat –menurut persepsi kalian- dari kekuasaan Allah (untuk membangkitkan) kalian atau (selamat dari) terealisasinya kehendak Allah pada kalian. Karena dalam bentuk dan sifat seperti apa pun nisaya kamu tidak akan mampu melumpuhkan (ketetapan) Allah. Kamu tidak punya andil kuasa dalam pengaturan dirimu, baik tatkala hidup atau sesudah mati. Maka, serahkanlah urusan pengaturan dan penanganan kepada Dzat Yang Mahakuasa atas segala sesuatu dan menjangkau segala sesuatu. “Maka mereka akan bertanya,” tatkala engkau mengetengahkan hujjah atas mereka tentang Hari Kebangkitan, “Siapa yang akan menghidupkan kami kembali? Katakanlah, ‘Dzat Yang telah menciptakan kamu pada kali yang pertama’ ,” sebagaimana Dia telah menciptakan kamu, padahal sebelumnya kamu adalah sesuatu yang tidak pernah disebut, maka Dia-lah yang akan mengembalikan kamu sebagai makhluk yang baru, \"Sebagaimana Kami telah memulai penciptaan pertama begitulah Kami akan mengulanginya\" (Al-Anbiya:104). “Lalu mereka akan menggeleng-gelengkan kepala mereka,” maksudnya menggerak-gerakkan kepala mereka sebagi bentuk pengingkaran dan ungkapan keheranan terhadap apa yang kamu katakana “dan mereka berkata, ‘Kapan itu (akan terjadi)?’ “ maksudnya kapan waktu terjadinya Hari Kebangkitan yang kamu sangka (terjadi) berdasarkan perkataanmu? Pertanyaan ini bukan untuk mengakui kenyataan Hari Kebangkitan, akan tetapi merupakan bentuk kebodohan dan kelemahan dari mereka “Katakanlah, ‘Mudah-mudahan waktu berbangkit itu dekat’ .” sesungguhnya penentuan waktu kapan Hari Kebangkitan tidaklah berfaidah. Akan tetapi, manfaat dan tuntutannya terdapat pada keyakinan dan pengakuan terhadapnya. Lalu apabila tidak demikian, maka sesungguhnya segala sesuatu yang pasti datang itu, berarti dekat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 51: Seperti langit, bumi dan gunung. Ada pula yang menafsirkan dengan kematian, karena tidak ada yang lebih besar dalam diri anak Adam selain kematian. Maksud ayat ini adalah bahwa kalau pun kamu menjadi batu, besi, atau yang lebih besar dan yang nampaknya tidak mungkin hidup seperti gunung, atau bahkan kematian, tetapi Allah Subhaanahu wa Ta'aala tetap sanggup menghidupkan kamu jika Dia menghendaki, karena tidak ada sesuatu pun yang sulit bagi-Nya. Karena yang mampu menciptakan pertama kali dari yang sebelumnya tidak ada, tentu mampu menciptakan kembali setelah matinya makhluk tersebut, bahkan lebih mudah. Sambil mengejek. Karena tidak ada faedah menyebutkan waktunya, bahkan yang ada faedahnya adalah ketika diperkuat akan adanya, mengakuinya dan menetapkannya. Di samping itu, setiap yang akan datang, maka hal itu adalah dekat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 51",
    "description": "Atau jadilah kamu suatu makhluk dari makhluk yang tidak mungkin mengalami hidup kembali menurut pikiranmu, karena lebih keras dari batu ataupun besi, niscaya tuhan akan menghidupkanmu dan membangkitkanmu. Maka setelah mendengar penjelasan itu, mereka akan bertanya, siapa yang akan menghidupkan kami kembali sesudah kami mati. Katakanlah wahai nabi Muhammad, yang telah menciptakan kamu pada kali yang pertama. Lalu setelah mendengar jawaban nabi, mereka akan menggeleng-gelengkan kepala mereka kepadamu karena tidak percaya dan berkata seakan-akan menantang, kapan kebangkitan itu akan terjadi' katakanlah wahai nabi Muhammad, mudah-Mudahan waktu berbangkit itu dekat, dan pasti datang saat yang dijanjikan itu. Yaitu pada hari ketika dia memanggil kamu melalui malaikat, lalu kamu mematuhi-Nya dengan bersungguh-sungguh sambil memuji-Nya atas kuasa-Nya membangkitkan kamu, dan kamu mengira bahwa kamu tidak berdiam di dalam kubur atau di dunia kecuali sebentar saja, walaupun kamu berada di sana bertahun-tahun lamanya."
  }
]