[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Pada hari pencipta kalian memanggil kalian untuk bangkit keluar dari kubur kalian, lalu kalian menyambut titah Allah itu dan patuh kepadaNya, dan bagi Allah pujian dalam seluruh kondisi. Dan kalian menyangka (karena ketakutan luar biasa di hari kiamat) bahwa kalian tidaklah tinggal di dunia kecuali sebentar saja, lantaran lamanya masa tinggal kalian di akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "52. Allah akan menghidupkan kalian kembali pada hari ketika Dia menyeru kalian menuju bumi mahsyar (kebangkitan), dan kalian mematuhi seruannya, sembari memuji-Nya, dan saat itu kalian pasti akan mengira bahwa tidaklah kalian berada di atas bumi ini melainkan hanya sebentar saja."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "52. Akan terjadi suatu hari Tuhan kalian akan memanggil kalian agar kalian keluar dari kubur kalian, dan kalian akan menuruti perintah-Nya sehingga kalian keluar dari kubur dengan memuji Allah. Ketika itu kalian akan menyangka bahwa kalian hanya sebentar saja tinggal di alam kubur."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "52. يَوْمَ يَدْعُوكُمْ (yaitu pada hari Dia memanggil kamu) Yakni hari ketika Allah memanggil kalian ke padang mahsyar. فَتَسْتَجِيبُونَ بِحَمْدِهِۦ (lalu kamu mematuhi-Nya sambil memuji-Nya) Yakni kalian mematuhi dan memuji-Nya. وَتَظُنُّونَ إِن لَّبِثْتُمْ(dan kamu mengira, bahwa kamu tidak berdiam) Di dalam kubur. إِلَّا(kecuali) Kecuali dengan waktu. قَلِيلًا(sebentar saja) Dunia menjadi kecil dan remeh di mata mereka saat melihat kedahsyatan hari kiamat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "52. Yaitu hari dimana Tuhan kalian memanggil kalian dari kubur melalui lisan Israfil, lalu kalian menyahuti panggilan itu seraya memuji Allah SWT atas kesempurnaan kuasaNya. Dan kalian berpikir bahwa kalian tidak tidak di kubur kecuali dalam waktu yang sebentar, bukankah kalian tidak hidup kalian kecuali hanya dalam waktu yang singkat, karena teror yang kalian saksikan pada hari kiamat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Yaitu pada hari Dia memanggil kalian} Allah memanggil kalian ke tempat berdiri {lalu kalian mematuhiNya dengan memujiNya} perintahNya {dan kalian mengira bahwa kalian tidak berdiam kecuali hanya sebentar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "52. “Yaitu pada hari Dia memanggil kamu,” untuk dibangkitkan dan dikumpulkan serta ditiuplah sangkakala “lalu kamu mematuhiNya sambil memujiNya,” maksudnya kalian semua tunduk terhadap perintahNya dan tidak mungkin memungkiriNya. Firman Allah, “Sambil memujiNya,” maksudnya Dia terpuji atas segala perbuatanNya. Dengan sifat terpuji itulah DIa akan membalas perbuatan hamba ketika Dia mengumpulkan mereka di Hari Kiamat “dan kamu mengira, bahwa kamu tidak berdiam (di dalam kubur) kecuali sebentar saja,” disebabkan begitu cepat masa terjadinya, dan bahwa segala bentuk kenikmatan yang pernah mampir pada kalian seolah-olah tidak pernah ada. Inilah perkataan yang dikatakan oleh orang-orang yang ingkar, “Kapankah ia akan terjadi?” Mereka berada pada puncak penyesalan tatkala Hari Kebangkitan itu datang. Maka dikatakan kepada mereka, “Inilah apa-apa yang dahulu kamu dustakan.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 52: Dari kubur melalui lisan malaikat Israfil. Dia Mahaterpuji terhadap perbuatan-Nya, demikian pula pembalasan yang dilakukan-Nya ketika Dia mengumpulkan mereka pada hari kiamat. Demikian pula kamu merasa bahwa kenikmatan yang kamu peroleh selama di dunia hanya sebentar. Karena dahsyatnya yang kamu lihat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 52",
    "description": "Yaitu pada hari ketika dia memanggil kamu melalui malaikat, lalu kamu mematuhi-Nya dengan bersungguh-sungguh sambil memuji-Nya atas kuasa-Nya membangkitkan kamu, dan kamu mengira bahwa kamu tidak berdiam di dalam kubur atau di dunia kecuali sebentar saja, walaupun kamu berada di sana bertahun-tahun lamanya. Dan katakanlah kepada hamba-hamba-kuyang beriman apabila mereka berkata kepada kaum musyrikin, hendaklah mereka mengucapkan perkataan yang lebih baik dan benar walaupun mereka bersikap keras dan berkata kasar kepadamu. Sungguh, setan itu senantiasa mencari peluang dan berusaha menimbulkan perselisihan di antara mereka, yakni orangorang yang beriman. Sungguh, setan itu adalah musuh yang nyata bagi manusia."
  }
]