[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tuhan kalian lebih mengetahui tentang kalian (wahai sekalian manusia). Jika Dia berkehendak, Dia akan merahmati kalian, maka akan memberikan taufik kepada kalian untuk beriman. Atau kalau Dia berkehendak lain, Dia akan mematikan kalian diatas kekafiran, lalu Dia mengazab kalian. Dan tidaklah Kami mengutusmu (wahai rasul) sebagai penjaga bagi mereka, dengan mengangani urusan-urusan mereka dan memberi balasan bagi mereka sesuai dengan amal perbuatan mereka. akan tetapi, misi pentingmu ialah menyampaikan risalah yang engkau diutus untuk mengembannya dan menjelaskan jalan yang lurus."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "54. Wahai manusia! Tuhan kalian lebih mengetahui tentang diri kalian, tidak ada satu perkara kalian pun yang tersembunyi dari-Nya, jika Dia menghendaki adanya rahmat atas kalian, niscaya Dia akan mencurahkan rahmat-Nya dengan memberi kalian taufik iman dan amal saleh. Dan jika Dia menghendaki adanya azab atas kalian, niscaya Dia akan menurunkan azab-Nya dengan menjauhkan kalian dari iman dan mematikan kalian dalam keadaan kafir. Dan tidaklah Kami mengutusmu -wahai Rasul-kepada mereka sebagai wakil untuk memaksa mereka beriman, menjauhi kekafiran, dan menghitung amalan baik buruk mereka, namun engkau hanya bertugas menyampaikan apa yang diperintahkan Allah atasmu untuk disampaikan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "54. Hai manusia, Tuhan kalian Maha Mengetahui apa yang ada dalam diri kalian dan kesudahan urusan kalian; jika Dia menghendaki, maka Dia akan merahmati kalian dengan memberi taufik menuju keimanan. Dan jika Dia menghendaki, maka Dia akan mengazab kalian dengan mematikan kalian dalam keadaan kafir atau bermaksiat. Dan Kami tidak mengutusmu hai Muhammad sebagai penjaga dan penanggung urusan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "54. رَّبُّكُمْ أَعْلَمُ بِكُمْ ۖ إِن يَشَأْ يَرْحَمْكُمْ أَوْ إِن يَشَأْ يُعَذِّبْكُمْ ۚ (Tuhanmu lebih mengetahui tentang kamu. Dia akan memberi rahmat kepadamu jika Dia menghendaki dan Dia akan mengazabmu, jika Dia menghendaki) Terdapat pendapat mengatakan bahwa kalimat ini ditujukan bagi orang-orang musyrik. Maknanya adalah jika Allah bisa saja berkehendak agar kalian memeluk Islam sehingga Dia memberi kalian rahmat, atau berkehendak menjadikan kalian mati dalam keadaan musyrik sehingga Dia akan mengazab kalian. وَمَآ أَرْسَلْنٰكَ عَلَيْهِمْ وَكِيلًا(Dan, Kami tidaklah mengutusmu untuk menjadi penjaga bagi mereka) Yakni Kami tidak membebanimu agar menghalangi mereka dari kekafiran dan memaksa mereka agar beriman."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "54. Tuhan kalian lebih tahu tentang kalian wahai orang-orang musyrik. Jika mau Dia akan menolong kalian untuk beriman dan jika mau Dia juga akan mematikan kalian dalam keadaan kafir lalu menghukum kalian. Dan kami tidak mengutusmu sebagai pelindung yang melindungi mereka dari kekufuran dan mengharuskan mereka untuk beriman, wahai Nabi."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Tuhan kalian lebih mengetahui tentang kalian. Jika Dia menghendaki, niscaya Dia merahmati kalian dan jika Dia menghendaki, niscaya Dia mengazab kalian. Kami tidaklah mengutusmu sebagai penjaga bagi mereka} penjaga"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "54. “Rabbmu lebih mengetahui tentang kamu,” daripada kamu sendiri. Dia tidak menghendaki kecuali kebaikan bagi kalian, tidak memerintahkan kecuali di dalamnya mengandung kemaslahatan bagi kalian. Dan terkadang, kalian menghendaki sesuatu, sementara kebaikan malah berada di tempat sebaliknya. “Dia akan memberi rahmat kepadamu jika Dia menghendaki atau Dia akan mengazabmu, jika Dia menghendaki,” maka Allah akan memberi taufik kepada siapa saja yang dikehendaki dengan sebab rahmatNya, dan DIa akan menghinakan siapa yang saja yang dikehendaki sehingga dia sesat dan berhak mendapatkan azab. “Dan Kami tidaklah mengutusmu untuk menjadi penjaga bagi mereka,” supaya kamu mengatur urusan mereka dan menyelesaikan pembalasan perbuatan mereka. Sesungguhnya Allah-lah yang menjaga. Kamu hanyalah seorang yang menyampaikan dan pemberi petunjuk ke jalan yang lurus."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 54: Daripada dirimu. Oleh karena itu, Dia tidak menginginkan bagi kita selain yang baik, dan tidak memerintahkan selain yang bermaslahat bagi kita. Dengan menjadikan kamu bertobat dan beriman. Dengan membiarkanmu tersesat dan mati di atas kekafiran. Yakni memaksa mereka untuk beriman, engkau hanyalah penyampai dan pembimbing ke jalan yang lurus. Menurut penyusun tafsir Al Jalaalain, ayat ini sebelum ada perintah untuk memerangi mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 54",
    "description": "Tuhanmu lebih mengetahui tentang kamu wahai kaum musyrik. Jika dia menghendaki, niscaya dia akan memberi rahmat kepadamu, dengan memberi petunjuk kepadamu sehingga kamu beriman, dan jika dia menghendaki, dia akan mengazabmu, disebabkan karena keburukan perbuatanmu dan kekufuranmu, sehingga kamu mati dalam kekufuran. Dan kami tidaklah mengutusmu wahai nabi Muhammad untuk menjadi penjaga bagi mereka yang mencegah mereka dari kekufuran atau memaksa mereka kepada iman. Dan tuhanmu lebih mengetahui siapa yang ada di langit dan di bumi dari sekalian makhluk-Nya, dan dia memilih di antara makhluk-Nya itu nabi-nabi yang diutus untuk memberikan peringatan dan petunjuk kepada kaumnya. Dan sungguh, telah kami lebihkan keutamaan sebagian nabi-nabi itu atas sebagian yang lain, dan di antara kelebihan itu ialah kami berikan kitab zabur kepada nabi dawud."
  }
]