[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan tuhanmu (wahai rasul), lebih mengetahui siapa saja yang berada di langit dan di muka bumi. Dan sesungguhnya kami telah melebihkan sebagian nabi di atas sebagian yang lain dengan berbagai keutamaan, jumlah pengikutnya lebih banyak dan diturunkannya kitab-kitab. Dan kami telah memberikan Zabur kepada daud."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "55. Dan Tuhanmu -wahai Rasul- lebih mengetahui siapa yang ada di langit dan di bumi, Dia lebih mengetahui keadaan mereka, dan hak-hak yang harus mereka dapatkan, dan sungguh Kami telah memberikan kelebihan kepada sebagian Nabi-Nabi atas sebagian lainnya berupa kelebihan banyaknya pengikut dan diturunkannya kitab pada mereka, dan Kami telah berikan Daud suatu kitab bernama Zabur."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "55-57. Hai Rasulullah, Tuhanmu Maha Mengetahui siapa yang ada di tujuh langit dan bumi ini, Dia mengistimewakan siapa yang Dia kehendaki dengan sesuatu yang Dia kehendaki. Sungguh Kami telah mengutamakan sebagian para nabi atas sebagian lainnya dengan memberi mereka kitab, pengikut yang banyak, berfirman kepada mereka secara langsung, dan keutamaan-keutamaan lainnya. Dan Nabi Daud telah diutamakan dengan kitab Zabur. Katakanlah: “Panggillah orang-orang yang dahulu kalian anggap sebagai tuhan-tuhan selain Allah, agar mereka memberi kalian syafaat; mereka tidak akan mampu mengangkat siksaan dari kalian dan tidak dapat mengalihkan azab kepada orang lain.” Para nabi, malaikat, dan orang-orang shalih yang memiliki derajat yang tinggi yang disembah orang-orang musyrik itu, adalah orang-orang yang selalu berusaha mendekat kepada Allah dengan ketaatan dan ibadah, mereka selalu ingin menjadi hamba yang paling dekat dengan Allah dan senantiasa memohon rahmat-Nya dan takut dari azab-Nya. sungguh azab Tuhanmu sangat berat sehingga layak untuk dijauhi."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "55. وَرَبُّكَ أَعْلَمُ بِمَن فِى السَّمٰوٰتِ وَالْأَرْضِ ۗ (Dan Tuhan-mu lebih mengetahui siapa yang (ada) di langit dan di bumi) Yakni lebih mengetahui diri, keadaan, dan hak mereka. وَلَقَدْ فَضَّلْنَا بَعْضَ النَّبِيِّۦنَ عَلَىٰ بَعْضٍ ۖ( Dan sesungguhnya telah Kami lebihkan sebagian nabi-nabi itu atas sebagian (yang lain)) Seperti Allah telah menjadikan nabi Ibrahim sebagai Khalil (hamba terkasih-Nya), menjadikan nabi Musa sebagai kalim (orang yang diajak Allah berbicara secara langsung), menciptakan Nabi Isa dari kalimat dan ruh-Nya, memberi Nabi Sulaiman kerajaan yang besar, dan mengampuni Nabi Muhammad segala dosanya yang telah lalu dan yang akan datang. وَءَاتَيْنَا دَاوُۥدَ زَبُورًا (dan Kami berikan Zabur kepada Daud) Kitab Zabur berisi nasehat-nasehat dan bacaan-bacaan zikir."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "55. Tuhanmu lebih tahu tentang keadaan seluruh makhluk yang ada di langit dan bumi, lalu Dia memilih salah satu di antara mereka untuk menerima nubuwwah. Dan sungguh Kami telah mengutamakan sebagian nabi atas nabi lainnyya dengan beberapa kelebihan, seperti menjadikan Ibrahim sebagai Khalil (sahabat), Musa sebagai kalim (orang yang bisa bercakap-cakap), Isa sebagai kalimat dan ruh Allah, Sulaiman sebagai pemilik kerajaan yang agung dan mengistimewakan Muhammad dengan Isra’ Mi’raj dan mengampuni dosa-dosanya yang telah lalu dan akan datang, serta menjadikannya sebagai penutup para nabi, dan Kami berikan Zabur kepada Dawud."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan Tuhanmu lebih mengetahui siapa yang di langit dan di bumi. Sungguh Kami telah melebihkan sebagian nabi-nabi atas sebagian lain dan Kami anugerahkan Zabur kepada Daud (55)} kitab yaitu Zabur, seluruh isinya tentang pujian, penghormatan dan sanjungan kepada Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "55. “Dan Rabbmu lebih mengetahui siapa yang (ada) di langit dan bumi,” dari segala macam makhluk. Kemudian Dia memberikan sesuatu yang menjadi hak mereka dan sesuai dengan tuntutan hikmahNya. Dia mengutamakan sebagian di atas sebagian yang lainnya pada semua perangai yang hissi (inderawi) maupun maknawi. Sebagaimana Allah mengutamakan sebagian nabiNya –yang diberi (bekal) wahyu- di atas nabi-nabi yang lain, dengan aneka keutamaan dan macam-macam keistimewaan yang bersumber pada karunia yang Allah curahkan kepada mereka, berupa sifat-sifat terpuji, akhlak yang diridhai, amal shalih, banyaknya pengikut, diiturunkannya kitab kepada sebagian mereka yang memuat hukum-hukum syariat dan akidah yang diridhai, sebagaimana Allah telah menurukan kitab Zabur kepada nabi Dawud. Ia adalah kitab yang sudah dimaklumi bersama. Apabila Allah telah mengutamakan sebagian nabi di atas sebagian yang lain, dan memberikan kepada sebagian mereka sebuah kitab, maka mengapa para pendusta itu mengingkari sesuatu yang telah diturunkan Allah kepada nabi Muhammad berupa kenabian dan al-Quran?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 55: Dengan beragam makhluk yang ada. Dia memberikan masing-masingnya sesuai yang dikehendaki hikmah-Nya, Dia melebihkan sebagiannya di atas sebagain yang lain, baik secara hissiy (nampak) maupun maknawi (tidak nampak) sebagaimana Dia melebihkan sebagian nabi di atas nabi yang lain, baik dalam hal sifat yang terpuji, akhlak yang diridhai, amal yang saleh, banyak pengikut, turunnya kitab-kitab atas sebagian mereka yang mengandung hukum-hukum syar’i dan ‘aqidah yang benar, sebagaimana Dia menurunkan kepada Nabi Dawud kitab Zabur. Jika Allah Ta’ala telah melebihkan sebagian nabi di atas sebagian yang lain dan telah memberikan kitab-kitab kepada sebagian mereka, lalu mengapa orang-orang yang mendustakan Rasulullah shallallahu 'alaihi wa sallam mengingkari apa yang diturunkan Allah Subhaanahu wa Ta'aala kepada Beliau dan karunia yang diberikan-Nya berupa kenabian dan kitab? Dengan mengkhususkan sebagian mereka dengan keutamaan di atas sebagian yang lain, seperti keutamaan Nabi Musa ‘alaihis salam dengan diajak bicara oleh Allah, Nabi Ibrahim ‘alaihis salam dan Nabi Muhammad shallallahu 'alaihi wa sallam dijadikan sebagai kekasih-Nya, serta diisrakan-Nya Nabi Muhammad shallallahu 'alaihi wa sallam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 55",
    "description": "Dan tuhanmu lebih mengetahui siapa yang ada di langit dan di bumi dari sekalian makhluk-Nya, dan dia memilih di antara makhluk-Nya itu nabi-nabi yang diutus untuk memberikan peringatan dan petunjuk kepada kaumnya. Dan sungguh, telah kami lebihkan keutamaan sebagian nabi-nabi itu atas sebagian yang lain, dan di antara kelebihan itu ialah kami berikan kitab zabur kepada nabi dawud. Katakanlah wahai nabi Muhammad kepada kaum musyrik, panggillah mereka yang kamu anggapsebagai tuhan selain Allah, seperti nabi isa, nabi uzair, para malaikat, atau siapa pun yang dianggap oleh sebagian orang sebagai tuhan mereka selain Allah, dan mintalah kepadanya agar mendatangkan manfaat kepadamu atau menghilangkan bahaya yang menimpamu, maka mereka tidak akan mempunyai kekuasaan sedikit pun untuk menghilangkan bahaya daripadamu dan tidak pula mampu memindahkannya sehingga tidak menimpa kamu."
  }
]