[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai rasul), kepada kaum musyrikin dari kaummu sendiri, ”Sesungguhnya sesembahan-sesembahan yang kalian seru untuk menyingkirkan mudarat dari kalian, mereka tidak memiliki kemampuan untuk itu, dan tidak kuasa memindahkannya dari satu kondisi ke kondisi lainnya. Dzat yang maha kuasa untuk itu, Dialah Allah semata.” Ayat ini berlaku umum terhadap semuya yang diseru selain Allah, baik yang sudah mati maupun berada di tempat yang jauh, baik dari kalangan para nabi maupun orang-orang shalih atau lainnya, dengan istilah meminta tolong, doa atau memohon lainnya. Tidak ada sesembahan yang haq kecuali Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "56. Wahai Rasul! Katakanlah kepada orang-orang musyrik itu, \"Wahai orang-orang musyrik! Serulah mereka yang kalian anggap sebagai tuhan-tuhan selain Allah bila suatu bahaya menimpa kalian, niscaya mereka tidak kuasa membentengi kalian dari mara bahaya tersebut, dan tidak pula kuasa untuk memindahkannya kepada selain kalian lantaran lemahnya mereka, dan barangsiapa yang lemah sekali-kali bukanlah tuhan yang patut disembah.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "56. قُلِ ادْعُوا۟ الَّذِينَ زَعَمْتُم مِّن دُونِهِۦ (Katakanlah: “Panggillah mereka yang kamu anggap (tuhan) selain Allah) Yakni yakni panggillah mereka yang kalian anggap sebagai tuhan-tuhan selain Allah. فَلَا يَمْلِكُونَ كشْفَ الضُّرِّ عَنكُمْ وَلَا تَحْوِيلًا(maka mereka tidak akan mempunyai kekuasaan untuk menghilangkan bahaya daripadamu dan tidak pula memindahkannya”) Yakni yang tidak mampu menghilangkannya atau mengalihkannya dari kalian kepada orang lain. Dan yang tidak mampu melakukan hal tersebut bukanlah tuhan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "56. Katakanlah kepada orang-orang musyrik wahai Nabi: “Panggillah mereka yang kalian sangka sebagai tuhan. Kalian telah berdusta dalam hal itu bahwa ada tuhan selain Allah seperti Malaikat, Isa, Uzair dan yang lain yang memiliki akal. (Sedangkan patung-patung itu, dibatalkan oleh Allah ketuhanannya pada ayat-ayat lainnya). Tunggulah pertolongan dan bantuan dari mereka, niscaya mereka tidak akan mampu menghilangkan kemahdharatan seperti kefakiran dan penyakit dari kalian, tidak juga bisa memindahkan hal itu kepada selain kalian, karena memang secara mutlak mereka tidak mampu. Ibnu Mas’ud berkata: “Sebagian manusia menyembah makhluk yang berakal dari golongan jin. Lalu para jin itu Islam, sedangkan manusia-manusia yang lainnya masih berpegang teguh untuk menyembah mereka, lalu turunlah ayat ini.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Katakanlah,“Serulah mereka yang kalian anggap (tuhan) selain Dia. Mereka tidak akan mampu menghilangkan bahaya dari kalian dan tidak pula mengalihkannya”} memindahkannya dari kalian kepada orang lain"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "56. Allah berfirman, “Katakanlah,” kepada kaum musyrikin yang telah menjadikan tandingan bagi Allah, mereka beribadah kepada tandingan-tandingan itu sebagaimana peribadatan mereka kepada Allah, berdoa kepada Allah disertai tuntutan keharusan kepada mereka untuk mengoreksi apa yang mereka sangka dan yakini jika mereka benar, “Panggillah mereka yang kamu anggap,” sesembahan selain Allah. Lantas, saksikanlah apakah mereka mampu memberi manfaat atau menolak bahaya dari kalian? Sesungguhnya mereka itu tidak “mempunyai kekuasaan untuk menghilangkan bahaya darimu,” berupa penyakit, kemiskinan, kesulitan dan yang semisalnya. Tidaklah mereka mampu menghilangkan semuanya itu, tidak pula mereka mampu memindahkannya dari seseorang kepada orang lain, ataupun mengganti dari satu kesulitan dengan kesulitan yang lebih ringan. Apabila ternyata demikian sifat-sifat sesembahan kalian, maka buat apa kalian berdoa kepada selain Allah. Sesungguhnya mereka tidak mempunyai kesempurnaan, tidak pula perbuatan-perbuatan yang bermanfaat. Oleh karenanya, tindakan mengangkat mereka (sebagai sesembahan selain Allah) adalah bentuk kedangkalan agama dan akal serta kebodohan dalam pola pikir. Di antara hal yang mengherankan, tindakan bodoh yang sudah membudaya dan terbiasa, dan menerimanya dengan membabi buta dari para leluhur mereka yang sesat, kemudian pelakunya menilainya sebagai pendapat yang lurus dan pemikiran yang paling berguna dan memandang bahwa memurnikan agama (hanya) untuk Allah yang Maha Esa, Maha Sempurna, Yang Memberi nikmat yang lahir maupun batin, itulah kedunguan dan perkara yang aneh. Sebagaimana perkataan orang-orang musyrik , \"Mengapa ia menjadikan tuhan-tuhan itu Tuhan Yang satu saja? Sesungguhnya ini benar-benar suatu hal yang sangat mengherankan.\" (Shad:5)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 56: Imam Muslim meriwayatkan dengan sanadnya yang sampai kepada Abu Ma’mar dari Abdullah tentang ayat, “Orang-orang yang mereka seru itu, mereka sendiri mencari jalan kepada Tuhan,” ia berkata, “Ada segolongan manusia yang menyembah segolongan jin, lalu segolongan jin itu masuk Islam, sedangkan manusia yang menyembahnya tetap menyembah, maka turunlah ayat, “Orang-orang yang mereka seru itu, mereka sendiri mencari jalan kepada Tuhan.” Imam Muslim menyebutkan lagi hadits dari jalan yang lain yang sampai kepada Ibnu Mas’ud, dan di sana disebutkan, “Lalu golongan jin masuk Islam, sedangkan manusia yang menyembah mereka tidak menyadari,” maka turunlah ayat tersebut. Seperti berhala, malaikat, jin, Nabi Isa, ‘Uzair, para wali atau orang-orang saleh dan sebagainya. Perhatikanlah, apakah mereka dapat memberi manfaat kepadamu dan menghindarkan bahaya atau tidak? Seperti sakit, kemiskinan, kesulitan, dsb. Kepada yang lain. Jika keadaan yang mereka sembah itu seperti ini, maka pantaskah disembah? Pantaskah menyembah makhluk yang tidak memiliki kesempurnaan, yang tidak berkuasa memberikan manfaat dan menghindarkan bahaya. Oleh karena itu, menjadikan makhluk yang lemah keadaannya sebagai tuhan merupakan kekurangan pada akal dan kebodohan pada pemikiran. Namun anehnya, mereka memandang kebalikannya, mereka menyangka bahwa menyembah makhluk yang lemah itulah pandangan yang lurus dan akal yang sehat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 56",
    "description": "Katakanlah wahai nabi Muhammad kepada kaum musyrik, panggillah mereka yang kamu anggapsebagai tuhan selain Allah, seperti nabi isa, nabi uzair, para malaikat, atau siapa pun yang dianggap oleh sebagian orang sebagai tuhan mereka selain Allah, dan mintalah kepadanya agar mendatangkan manfaat kepadamu atau menghilangkan bahaya yang menimpamu, maka mereka tidak akan mempunyai kekuasaan sedikit pun untuk menghilangkan bahaya daripadamu dan tidak pula mampu memindahkannya sehingga tidak menimpa kamu. Orang-orang yang mereka seru itu, yaitu orang-orang yang mereka anggap sebagai tuhan selain Allah, mereka sendiri mencari jalan kepada tuhan mereka, dan berusaha siapa di antara mereka yang lebih dekat kepada Allah. Dan mereka senantiasa mengharapkan rahmat-Nya dan takut akan azab-Nya. Sungguh, azab tuhanmu adalah sesuatu yang harus ditakuti oleh siapa pun makhluk-Nya."
  }
]