[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang yang di seru bersama Allah oleh kaum musyrikin dari kalangan para nabi, orang-orang shalih, para malaikat, justru berlomba untuk mendekatkan diri kepada tuhan mereka dengan segala hal yang mampu mereka perbuat berupa amal-amal shalih, dan mereka mengharapkan rahmatNya dan takut terhadap siksaanNya. Sesungguhnya siksaan tuhanmu itu adalah sesuatu yang sepantasnya dikhawatirkan dan di takuti oleh para hamba."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "57. Orang-orang yang mereka seru dan sembah itu dari kalangan Malaikat atau selainnya, mereka sendiri mencari jalan demi mendekatkan diri kepada Allah dengan beramal saleh, bahkan mereka sendiri saling berlomba siapa yang lebih dekat pada-Nya dengan melakukan berbagai ketaatan, serta sangat mengharap rahmat-Nya, dan takut akan azab-Nya, karena sungguh azab Tuhamu itu -wahai Rasul- hendaknya dijauhi."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "57. أُو۟لٰٓئِكَ الَّذِينَ يَدْعُونَ يَبْتَغُونَ إِلَىٰ رَبِّهِمُ الْوَسِيلَةَ أَيُّهُمْ أَقْرَبُ (Orang-orang yang mereka seru itu, mereka sendiri mencari jalan kepada Tuhan mereka siapa di antara mereka yang lebih dekat (kepada Allah)) Yakni para malaikat, Isa al-Masih, dan lainnya yang kalian sembah sebagai sekutu Allah adalah makhluk-makhluk Allah yang juga mencari sesuatu yang dapat mendekatkan mereka kepada Allah, mereka mendekat kepada Allah dengan beramal shalih dan dan saling berlomba-lomba dalam hal itu agar mereka mengetahui siapa yang paling dekat kepada-Nya dengan ketaatan dan ibadah tersebut. وَيَرْجُونَ رَحْمَتَهُۥ(dan mengharapkan rahmat-Nya) Yakni mereka juga mengharapkan rahmat Allah sebagaimana orang lain mengaharapkannya, lalu bagaimana mereka dapat menjadi tuhan-tuhan. وَيَخَافُونَ عَذَابَهُۥٓ ۚ( dan takut akan azab-Nya) Sebagaimana selain mereka takut dari azab Allah. إِنَّ عَذَابَ رَبِّكَ كَانَ مَحْذُورًا(sesungguhnya azab Tuhanmu adalah suatu yang (harus) ditakuti) Yakni azab Allah layak untuk ditakuti para malaikat dan para nabi serta makhluk-makhluk yang lainnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "57. Mereka yang disembah orang-orang musyrik dan dijadikan tuhan selain Allah seperti malaikat dan Isa itu mencari sesuatu yang mendekatkan mereka kepada Allah dengan berbuat ketaatan dan beribadah, serta mencari hal yang membuat mereka lebih dekat lagi dengan Allah, lalu bagaimana bisa mereka bisa dalam keadaan jauh? Mereka mengharapkan rahmat Tuhannya dan takut dengan azabNya sebagaimana hamba-hamba lainnya, lalu bagaimana bisa kalian menganggap mereka sebagai Tuhan? Sesungguhnya azab tuhanmu itu diperingatkan bagi setiap orang"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Orang-orang yang mereka seru itu mencari} mencari {jalan kepada Tuhan} cara untuk mendekat dengan beramal shalih {siapa di antara mereka yang lebih dekat. Mereka juga mengharapkan rahmatNya dan takut kepada azabNya. Sesungguhnya azab Tuhanmu itu adalah yang ditakuti"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "57. Kemudian Allah juga memberitahukan bahwasanya sesembahan selain Allah –yang disembah orang-orang musyrik itu- sibuk sendiri lalai dari mereka, bersamaan dengan perhatian mereka untuk mendekatkan diri kepada Allah dan mencari sarana untuk itu. Maka Allah berfirman, “Orang-orang yang mereka seru itu,” dari kalangan para nabi, orang-orang shalih maupun para malaikat “mencari jalan kepada Rabb mereka, siapa di antara mereka yang lebih dekat (kepada Allah),” maksudnya mereka berlomba-lomba dalam mendekatkan diri kepada Rabbnya. Mereka mengerahkan segala kemampuan berupa amal-amal shalih yang bisa mendekatkan diri kepada Allah dan kepada rahmatNya “dan takut akan azabNya,” kemudian mereka menghindari penyebab datangnya azab Allah. “Sesungguhnya azab Rabbmu adalah suatu yang (harus) ditakuti,” maksudnya itulah yang harus betul-betul diwaspadai dan memelihara diri dari sebab-sebabnya. Tiga sifat ini, sifat khauf (rasa takut), raja’ (pengharapan) dan mahabbah (cinta) yang Allah sematkan kepada orang-orang yang didekatkan kepadaNya ini, merupakan asal dan bahan dasar dari segala kebaikan. Barangsiapa yang memiliki tiga sifat ini dengan sempurna, maka sempurnalah segala urusannya. Dan apabila hati kosong dari sifat-sifat ini, maka kebaikan-kebaikan pergi darinya hingga akhirnya dipenuhi berbagai keburukan. Dan tanda kecintaan seorang hamba, sebagaimana yang disebutkan Allah adalah kesungguhan seorang hamba untuk melakukan apa saja yang bisa mendekatkan diri kepada Allah, berlomba-lomba untuk dekat denganNya dengan mengikhlaskan semua amalan (hanya) untuk Allah semata, tulus dalam mengerjakannya dan berusaha mengerjakannya dalam bentuk yang sempurna, sesuai dengan batas kemampuannya. Barangsiapa yang mengaku cinta kepada Allah tanpa melakukan hal-hal di atas, maka dia adalah seorang pendusta."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 57: Maksudnya malaikat, jin yang masuk Islam, Nabi Isa ‘alaihis salam, dan 'Uzair yang mereka sembah itu mencari jalan untuk mendekatkan diri kepada Allah. Berupa amal saleh. Lalu mengapa mereka (orang-orang musyrik) itu mendakwakan mereka sebagai tuhan? Dalam ayat ini terdapat pilar-pilar ibadah yang dilakukan oleh mereka yang mendekatkan diri kepada Allah Subhaanahu wa Ta'aala, yaitu rasa takut, rasa harap dan rasa cinta. Oleh karena itu, kecintaan saja yang tidak disertai dengan rasa takut dan kepatuhan, seperti cinta terhadap makanan dan harta, tidaklah termasuk ibadah. Demikian pula rasa takut saja tanpa disertai dengan cinta, seperti takut kepada binatang buas, maka itu tidak termasuk ibadah. Tetapi jika suatu perbuatan di dalamnya menyatu rasa takut dan cinta maka itulah ibadah. Dan ibadah tidak ditujukan kecuali kepada Allah Ta'ala semata. Perlu diketahui, bahwa tanda cinta kepada Allah adalah seorang hamba bersungguh-sungguh mengerjakan amalan yang dapat mendekatkan diri kepada Allah, berlomba mencari kedekatan-Nya dengan mengikhlaskan amalan karena Allah dan melakukannya dengan cara yang terbaik yang mampu dilakukannya, tentunya di atas sunnah Rasulullah shallallahu 'alaihi wa sallam. Barang siapa yang mengaku mencintai Allah, namun tidak melakukan hal itu, maka dia dusta."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 57",
    "description": "Orang-orang yang mereka seru itu, yaitu orang-orang yang mereka anggap sebagai tuhan selain Allah, mereka sendiri mencari jalan kepada tuhan mereka, dan berusaha siapa di antara mereka yang lebih dekat kepada Allah. Dan mereka senantiasa mengharapkan rahmat-Nya dan takut akan azab-Nya. Sungguh, azab tuhanmu adalah sesuatu yang harus ditakuti oleh siapa pun makhluk-Nya. Dan tidak ada suatu negeri pun yang durhaka penduduknya karena kekufuran atau kejahatan perbuatannya, melainkan kami membinasakannya sebelum hari kiamat dengan kematian atau kami siksa penduduknya dengan siksa yang sangat keras. Yang demikian itu, yakni kebinasaan dan siksa yang menimpa mereka, telah tertulis di dalam kitab lauh mahfudh."
  }
]