[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah mengancam orang-orang kafir bahwa tidak ada satu negeri pun yang mendustakan para rasul kecuali akan turun kepada mereka hukuman yang menghancurkan mereka di dunia sebelum hari kiamat atau berupa siksaan yang pedih bagi penduduknya. Ini satu ketetapan yang sudah Allah tulis dan ketentuan yang Allah telah Dia tetapkan secara pasti, yang pasti akan terjadi, dan ketetapan itu telah tertulis di lauhil mahfuzh."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "58. Dan tidak ada satu perkampungan atau perkotaan pun yang penduduknya durhaka, melainkan Kami menurunkan padanya suatu azab dan kebinasaan dalam kehidupan dunia ini lantaran kekafirannya, atau Kami siksa mereka dengan siksa yang sangat keras baik dengan pembunuhan atau lainnya lantaran kekafirannya pula. Sungguh pembinasaan dan azab ini merupakan keputusan Allah yang telah tertulis dalam Lauḥ Maḥfūẓ."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "58. Tidak ada penduduk suatu negeri yang kafir kepada Allah melainkan Kami akan menyiksa mereka dengan kehancuran atau azab yang keras di dunia; ini merupakan ketetapan yang telah tertulis dalam Lauhul Mahfudz."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "58. وَإِن مِّن قَرْيَةٍ إِلَّا نَحْنُ مُهْلِكُوهَا قَبْلَ يَوْمِ الْقِيٰمَةِ (Tak ada suatu negeripun (yang durhaka penduduknya), melainkan Kami membinasakannya sebelum hari kiamat) Yakni suatu negeri yang dihuni oleh orang-orang kafir pasti akan dibinasakan, baik itu dengan kematian atau dengan azab yang sangat keras yang menghabiskan mereka semua sebelum tiba hari kiamat. كَانَ ذٰلِكَ(Yang demikian itu) Yakni pembinasaan atau azab tersebut. فِى الْكِتٰبِ(di dalam kitab) Yakni dalam Lauh Mahfuzh. مَسْطُورًا (telah tertulis) Yakni telah tercantum."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "58. Dan tidaklah penduduk suatu daerah (negeri) yang menzalimi diri sendiri dengan berbuat kufur dan maksiat kecuali mereka akan dihancurkan sebelum hari kiamat, baik dengan kematian atau azab yang sangat dahsyat yang akan menumbangkan mereka dengan membantai mereka atau yang lainnya. Pembinasaan dan azab itu sudah ditetapkan dan tertulis di Lauhil Mahfuz"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidak ada} tidak ada {suatu negeri pun kecuali Kami membinasakannya} meruntuhkannya {sebelum hari kiamat atau Kami menyiksanya dengan siksa yang sangat keras. Yang demikian itu di dalam kitab} Lauhil Mahfuz {telah tertulis} tertulis"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "58. Maksudnya, tidak ada suatu negeri pun yang mendustakan para utusan Allah melainkan pasti mereka akan ditimpa kebinasaan atau azab yang pedih sebelum Hari KIamat. Ini adalah ketetapan yang Allah gariskan dan pasti terjadi. Maka hendaklah orang-orang yang mendustakan itu segera kembali kepada Allah dan mengakui kebenaran para utusan Allah sebelum azab menimpa mereka dan ketetapan takdir terealisasikan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 58: Dengan mematikannya. Oleh karena itu, hendaknya orang-orang yang mendustakan para rasul itu segera kembali kepada Allah dan membenarkan para rasul-Nya sebelum sempurna untuk mereka ketetapan azab."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 58",
    "description": "Dan tidak ada suatu negeri pun yang durhaka penduduknya karena kekufuran atau kejahatan perbuatannya, melainkan kami membinasakannya sebelum hari kiamat dengan kematian atau kami siksa penduduknya dengan siksa yang sangat keras. Yang demikian itu, yakni kebinasaan dan siksa yang menimpa mereka, telah tertulis di dalam kitab lauh mahfudh. Orang-orang kafir mekah berkata bahwa nabi-nabi dahulu dapat melakukan perbuatan yang luar biasa, seperti mengarahkan angin menurut kehendaknya atau menghidupkan orang mati, lalu mereka meminta kepada nabi Muhammad agar menunjukkan bukti kenabiannya dengan mengubah bukit safa menjadi emas, maka turunlah wahyu Allah, dan tidak ada yang menghalangi kami untuk mengirimkankepadamu tanda-tanda kekuasaan kami yang dapat dilihat, melainkan karena tandatanda itu telah didustakan oleh orang terdahulu. Dan di antara tanda-tanda yang telah kami berikan kepada umat terdahulu yaitu tanda-tanda yang kami berikan kepada kaum Å amud, kaumnya nabi saleh, berupa unta betina sebagai mukjizat yang dapat dilihat, sebagaimana yang diusulkan oleh mereka, tetapi mereka menganiaya unta betina itu dengan membunuhnya. Dan kami tidak mengirimkan tanda-tanda itu melainkan untuk menakut-nakuti agar mereka beriman. Akan tetapi mereka tidak mau beriman, walaupun telah kami tunjukkan kepada mereka tanda-tanda kekuasaan kami yang bersifat indrawi yang mereka minta. Jika kami menunjukkan tanda-tanda itu kepadamu niscaya kamu akan mendustakan pula, dan dengan demikian akan berlaku pula ketentuan kami menghancurkan penduduk negeri yang durhaka sebagaimana berlaku kepada kaum sebelum kamu."
  }
]