[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan tidak ada yang menghalang-halangi Kami untuk menurunkan mukjizat-mukjizat yang diminta oleh kaum musyrikin kecuali pendustaan yang telah di lakukan oleh umat-umat manusia sebelum mereka. Sesungguhnya Allah telah memenuhi permintaan mereka, namun kemudian mereka mundustakan dan akhirnya mereka binasa. Dan Kami telah memberikan kepada tsamud (mereka adalah kaum Nabi shaleh) mukjizat yang jelas yaitu unta betina, akan tetapi, mereka mengingkarinya. Maka kamipun membinasakan mereka. Dan kami tidaklah mengutus para rasul dengan membawa tanda-tanda kuasa, pelajaran-pelajaran dan mukjizat-mukjizat yang Kami tampakkan melalui tangan-tangan mereka kecuali untuk mempertakutkan para hamba, agar mereka memperoleh pelajaran dan mendapat peringatan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "59. Dan Kami tidak mengirimkan tanda-tanda jelas yang dimintai oleh orang-orang musyrik untuk membuktikkan kebenaran Rasul seperti menghidupkan orang mati atau semisalnya, melainkan karena Kami telah mengirimkannya kepada umat-umat terdahulu dan mereka hanya mendustakannya. Dan Kami telah berikan kepada kaum Ṡamūd suatu tanda kekuasaan Allah yang agung lagi jelas yaitu berupa onta betina, namun mereka mendustakannya sehingga Kami pun menyegerakan azab bagi mereka. Dan Kami tidaklah mengirimkan tanda-tanda tersebut melalui tangan para Rasul, kecuali dengan tujuan untuk menakut-nakuti umat mereka. Semoga dengannya mereka masuk Islam dan menyerahkan diri kepada Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "59. Allah menyampaikan rahmat-Nya dengan tidak menurunkan mukjizat yang orang-orang musyrik minta; karena tidak ada yang menghalangi Allah untuk menurunkannya melainkan pendustaan yang dilakukan umat-umat terdahulu terhadap mukjizat yang mereka minta, Allah telah memberikan mujizat yang mereka minta akan tetapi mereka mendustakannya, sehingga Allah membinasakan mereka. Salah satu dari umat-umat tersebut adalah kaum Tsamud; Allah memberi mereka unta betina sebagai mukjizat yang dapat mereka lihat dengan mata telanjang, akan tetapi mereka mengingkari mukjizat tersebut, sehingga Allah membinasakan mereka. Dan Kami tidaklah mengirim suatu ayat kauniyah seperti gempa bumi, gunung Meletus, dan lain sebagainya melainkan untuk menimbulkan rasa takut para hamba, sehingga mereka dapat mengambil pelajaran darinya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "59. وَمَا مَنَعَنَآ أَن نُّرْسِلَ بِالْاٰيٰتِ إِلَّآ أَن كَذَّبَ بِهَا الْأَوَّلُونَ ۚ (Dan sekali-kali tidak ada yang menghalangi Kami untuk mengirimkan (kepadamu) tanda-tanda (kekuasan Kami), melainkan karena tanda-tanda itu telah didustakan oleh orang-orang dahulu) Para penduduk Makkah meminta Rasulullah agar ia mengubah bukit Shafa menjadi emas dan menjauhkan dari mereka gunung-gunung yang ada di Makkah, kemudian malaikat Jibril mendatangi Rasulullah seraya berkata: “jika kamu menghendaki, apa yang diminta kaummu akan dikabulkan, namun jika mereka tidak juga beriman maka mereka akan segera diazab; dan jika kamu menghendaki, bersabarlah dan memberi mereka kesempatan.” Maka turunlah ayat ini. Yakni jika Kami mengirimkan mukjizat itu namun mereka tetap mendustainya maka mereka akan segera diazab dan tidak ditangguhkan lagi, sebagaimana sunnatullah yang berlaku bagi hamba-hamba-Nya. وَءَاتَيْنَا ثَمُودَ النَّاقَةَ مُبْصِرَةً (Dan telah Kami berikan kepada Tsamud unta betina itu (sebagai mukjizat) yang dapat dilihat) Yakni mukjizat yang menunjukkan kebenaran Nabi Shalih yang dapat dilihat oleh mata kepala mereka sendiri. فَظَلَمُوا۟ بِهَا ۚ( tetapi mereka menganiaya unta betina itu) Yakni mengingkari mukjizat tersebut. وَمَا نُرْسِلُ بِالْاٰيٰتِ إِلَّا تَخْوِيفًا(Dan Kami tidak memberi tanda-tanda itu melainkan untuk menakuti) Yakni Kami tidak mengirim berbagai mukjizat kepada para rasul kecuali untuk memberi rasa takut pada orang-orang yang mendustakan supaya mereka beriman."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Qatadah memberi penjelasan tentang ayat ini: Sesungguhnya Allah SWT menakuti manusia dengan ayat-ayat Nya sesuai kehendak-Nya; boleh jadi mereka sadar diri dan kembali kepada-Nya dan kembali mengingat keesaan Allah SWT, telah diriwayatkan kepada kita bahwa Kufah pernah bernah berguncang pada masa Ibnu Mas'ud kemudia beliau berkata : wahai sekalian manusia, sesungguhnya Allah memberi kita peringatan, maka terimalah peringatan itu dengan sebaik-baiknya. 2 ). Kamu kah itu yang sebenarnya ?! sesungguhnya Rasulullah pernah terjatuh sorbannya karena takut setelah menerima ayat tentang matahari; sungguh itulah hati yang benar-benar memahami tanda-tanda kebesaran Allah ini { وَمَا نُرْسِلُ بِالْآيَاتِ إِلَّا تَخْوِيفًا } \"Dan Kami tidak memberi tanda-tanda itu melainkan untuk menakuti\", maka apakah hati kita sudah bergetar wahai ahli Qur'an, tatkala melihat ayat-ayat ini ? 3 ). Sesungguhnya gempa dan gunung-gunung merapi adalah bagian dari peristiwa alam yang dikirim oleh Allah sebagai peringatan bagi hamba-hamba Nya, dan makna ini tidak menyalahi penafsiran ilmiyah apapun, sebagaimana yang juga terjadi pada gerhana bulan dan matahari. 4 ). Suatu ketika beberapa surat kabar memberitakan adanya guncangan yang terjadi di wilayah kota Madinah, maka sebagia penduduk menyerukan untuk intropeksi hal-hal yang bisa menjadi penyebab kejadian tersebut, namun sayangnya seketika muncul berita lain tentang keberadaan sekelompok wanita di kota itu yang tidak mengindahkan akhlak mereka sebagai seorang wanita. Maka dari itu apakah menjadi bagian dari agama ini ketika Allah menrunkan peringatan-Nya lalu kita tidak menunjukkan rasa kehawatiran dan rasa takut kita kepada Allah SWT ?!"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "59. Tidak ada yang bisa mencegah Kami untuk medatangkan mukjizat materi yang bisa dirasakan yang diminta orang-orang kafir Mekah kecuali Kami mengetahui bahwa mereka akan mendustakannya sebagaimana orang-orang terdahulu mendustakannya. Pembinasaan secara umum pantas diberikan sesuai ketentuan hukum Kami. Namun Kami tidak mau meniadakan mereka (terlebih dahulu) karena mungkin sebagian mereka akan beriman. Dan telah Kami datangkan kepada kabilah Tsamud, kaumnya Shalih seekor unta sebagai tanda memberi penjelasan dengan terang atas kekuasaan Kami dan kebenaran Shalih AS, namun mereka menzalimi diri sendiri dengan mengingkarinya dan membantainya, lalu Kami binasakan mereka semua. Dan Kami tidak mendatangkan mukjizat bersama para rasul kecuali untuk memperingatkan para pendusta, barangkali mereka mau mengambil pelajaran lalu mau beriman."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Tidak ada yang menghalangi Kami untuk mengirimkan ayat-ayat, melainkan karena ayat-ayat itu telah didustakan oleh orang-orang terdahulu. Kami telah memberikan kepada kaum Tsamud unta betina yang jelas} sebagai ayat yang menjelaskan dan menunjukkan kepada kebenaran Shalih {tetapi mereka menganiayanya} mereka mengingkarinya {Kami tidak mengirimkan ayat-ayat itu kecuali untuk menakut-nakuti"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "59. Allah menyebutkan rahmatNya dengan tidak menurunkan ayat-ayat (tanda-tanda kebesaranNya) yang diinginkan oleh para pendusta itu. Tidak ada penghalang untuk menurunkan ayat-ayat itu kecuali karena khawatir mereka akan mendustakannya. Sehingga apabila mereka mendustakan ayat-ayat itu, pastilah akan disegerakan azab yang membinasakan mereka tanpa ditunda-tunda lagi. Sebagaimana telah terjadi pada orang-orang terdahulu yang mendustakan. Di antara ayat Allah yang terbesar adalah ayat yang telah diturunkan kepada kaum Tsamud berupa unta besar yang mencengangkan, yang seluruh kabilah minum darinya. Kendati demikian, mereka tetap mendustakan ayat Allah tersebut. Akibatnya, mereka pun ditimpa oleh azab yang telah Allah kisahkan kepada kita di dalam kitabNya. Mereka pun demikian. Seandainya telah datang tanda-tanda kebesaran Allah yang agung, niscaya mereka tidak mau beriman. Karena yang menghalangi mereka dari keimanan bukanlah kesamaran tentang kebenaran ajaran rasul, atau ketidakjelasan apakah risalahnya hak atau batil? Karena sesungguhnya telah banyak keterangan yang jelas yang menunjukkan tentang kebenaran risalah yang dibawa Rasulullah, yang pasti akan mendatangkan hidayah bagi orang yang bermaksud mencari hidayah. Maka demikian pula keadaan kaum yang lain. Pastilah akan menyikapinya seperti orang-orang sebelum mereka. Maka, tidak diturunkannya ayat-ayat (yang mereka minta itu) merupakan kebaikan bagi mereka dan lebih bermanfaat. Dan FirmanNya, “Dan Kami tidak memberi tanda-tanda itu melainkan untuk menakuti,” maksudnya bukanlah maksud dari diturunkannya ayat-ayat itu untuk menjadi seruan dan faktor yang mendatangkan keimanan, sehingga tidak mungkin orang menjadi beriman kecuali dengannya. Akan tetapi, maksud semua itu adalah untuk menakut-nakuti dan membuat ciut, agar mereka tercegah dari keyakinan yang dahulu mereka pegang teguh."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 59: Imam Ahmad meriwayatkan dengan sanadnya dari Ibnu Abbas, ia berkata, “Penduduk Mekah meminta kepada Nabi shallallahu 'alaihi wa sallam agar Beliau mengubah bukit Shafa menjadi emas, dan agar Beliau menjauhkan gunung-gunung dari mereka sehingga mereka dapat menabur benih (untuk bercocok tanam). Lalu dikatakan kepada Beliau, “Jika engkau mau, maka engkau dapat menundanya, dan jika engkau mau, maka engkau dapat mendatangkan apa yang mereka minta. Jika setelah diturunkan mereka kafir, maka mereka akan dibinasakan sebagaimana orang-orang sebelum mereka dibinasakan.” Beliau bersabda, “Tidak, bahkan aku menunda saja.” Maka Allah ‘Azza wa Jalla menurunkan ayat ini, “Dan tidak ada yang menghalangi Kami untuk mengirimkan (kepadamu) tanda-tanda (kekuasan kami), melainkan karena tanda-tanda itu telah didustakan oleh orang terdahulu. Dan telah Kami berikan kepada Tsamud unta betina (sebagai mukjizat) yang dapat dilihat,” Syaikh Muqbil berkata, “Hadits ini dinisbatkan oleh Ibnu Katsir dalam Al Bidayah juz 3 hal. 52 kepada Nasa’i, ia berkata, “Sanadnya jayyid.” Ibnu Jarir juga menyebutkannya pada juz 15 hal. 108, Hakim juz 2 hal. 362, ia berkata, “Shahih isnadnya, namun keduanya (Bukhari-Muslim) tidak menyebutkannya,” dan didiamkan oleh Adz Dzahabiy. Al Haitsami dalam Al Majma’ juz 7 hal. 50 berkata, “Para perawinya adalah para perawi hadits shahih.” Yang diusulkan kaum Quraisy. Maksudnya, Allah Subhaanahu wa Ta'aala menetapkan bahwa orang-orang yang mendustakan tanda-tanda kekuasaan-Nya ketika datang, akan dimusnahkan tanpa ditunda lagi. Orang-orang Quraisy meminta kepada Nabi Muhammad shallallahu 'alaihi wa sallam agar diturunkan pula kepada mereka tanda-tanda kekuasaan Allah itu, tetapi Allah tidak akan menurunkannya kepada mereka, karena kalau tanda-tanda kekuasaan Allah itu diturunkan juga, pasti mereka akan mendustakannya, dan tentulah mereka akan dibinasakan seperti umat-umat terdahulu, sedangkan Allah tidak hendak membinasakan kaum Quraisy untuk menyempurnakan urusan Nabi Muhammad shallallahu 'alaihi wa sallam. Lalu mereka dibinasakan. Agar mereka berhenti dari sikapnya itu.."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 59",
    "description": "Orang-orang kafir mekah berkata bahwa nabi-nabi dahulu dapat melakukan perbuatan yang luar biasa, seperti mengarahkan angin menurut kehendaknya atau menghidupkan orang mati, lalu mereka meminta kepada nabi Muhammad agar menunjukkan bukti kenabiannya dengan mengubah bukit safa menjadi emas, maka turunlah wahyu Allah, dan tidak ada yang menghalangi kami untuk mengirimkankepadamu tanda-tanda kekuasaan kami yang dapat dilihat, melainkan karena tandatanda itu telah didustakan oleh orang terdahulu. Dan di antara tanda-tanda yang telah kami berikan kepada umat terdahulu yaitu tanda-tanda yang kami berikan kepada kaum Å amud, kaumnya nabi saleh, berupa unta betina sebagai mukjizat yang dapat dilihat, sebagaimana yang diusulkan oleh mereka, tetapi mereka menganiaya unta betina itu dengan membunuhnya. Dan kami tidak mengirimkan tanda-tanda itu melainkan untuk menakut-nakuti agar mereka beriman. Akan tetapi mereka tidak mau beriman, walaupun telah kami tunjukkan kepada mereka tanda-tanda kekuasaan kami yang bersifat indrawi yang mereka minta. Jika kami menunjukkan tanda-tanda itu kepadamu niscaya kamu akan mendustakan pula, dan dengan demikian akan berlaku pula ketentuan kami menghancurkan penduduk negeri yang durhaka sebagaimana berlaku kepada kaum sebelum kamu. Selanjutnya Allah mengingatkan kepada nabi Muhammad agar tidak ragu-ragu menyampaikan risalah-Nya, dan tidak bersedih hati karena penolakan orang-orang kafir terhadap ayat-ayat Allah. Dan ingatlah ketika kami wahyukan kepadamu, wahai nabi Muhammad, sungguh, ilmu dan kekuasaan tuhanmu meliputi seluruh manusia. Sampaikanlah ini kepada semua manusia dan janganlah bersedih hati karena penolakan mereka terhadap ayat-ayat kami. Dan ketahuilah kami tidak menjadikan mimpi, atau penglihatan dalam keadaan sadar, yang telah kami perlihatkan kepadamu, pada malam isra mikraj melainkan sebagai ujian bagi manusia agar menjadi jelas siapa di antara mereka yang percaya dan siapa yang tidak percaya dan begitu pula apa yang kami wahyukan kepadamu tentang pohon yang terkutuk dalam Al-Qur'an agar menjadi ujian bagi manusia siapa di antara mereka yang percaya dan siapa yang tidak percaya. Dan dengan kedua macam tanda itu kami menakut-nakuti mereka, supaya mereka beriman tetapi yang demikian itu hanyalah menambah besar kedurhakaan mereka."
  }
]