[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian kami kembalikan bagi kalian (wahai bani israil), kekuasaan dan kemenangan atas para musuh kalain yang dahulu di kuasakan atas kalian. Dan kami tambah rizki dan jumlah anak-anak kalain, serta menguatkan kalian dan menjadikan kalain berjumlah lebih banyak dari pada jumlah musuh kalian. Kondisi demikian disebabkan perbuatan baik dan ketundukan kalian kepada Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Wahai Bani Israil! Kami kemudian mengembalikan kepada kalian negeri dan kekuasaan tatkala kalian telah bertobat kepada Allah -Ta'ālā-, bahkan Kami juga membantu dan mengembalikan pada kalian harta kekayaan yang sebelumnya telah dirampas, juga anak-anak yang sebelumnya telah menjadi tawanan, dan Kami jadikan kalian kelompok yang lebih besar dari pada musuh-musuh kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "6. Kemudian setelah kalian bertaubat dan mentaati Thalut, Allah menjadikan Nabi Daud dapat membunuh Jalut, sehingga Kami kembalikan kejayaan kalian atas para musuh dan Kami luaskan rezeki kalian dengan keberhasilan menakhlukkan berbagai negeri dan banyak keturunan sehingga Kami menjadikan jumlah kalian lebih banyak daripada jumlah musuh. Semua ini berkat keimanan kepada Allah dan kebaikan kepada hamba-hamba Allah yang lain."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. ثُمَّ رَدَدْنَا لَكُمُ الْكَرَّةَ عَلَيْهِمْ (Kemudian Kami berikan kepadamu giliran untuk mengalahkan mereka kembali) Yakni dapat membalas kekalahan mereka. Dan hal ini ketika mereka bertaubat. وَأَمْدَدْنٰكُم بِأَمْوٰلٍ وَبَنِينَ(dan Kami membantumu dengan harta kekayaan dan anak-anak) Setelah sebelumnya dirampas harta mereka dan ditawan istri-istri mereka. وَجَعَلْنٰكُمْ أَكْثَرَ نَفِيرًا(dan Kami jadikan kamu kelompok yang lebih besar) Yakni jumlah pasukan perang yang pergi berperang lebih besar dari pasukan musuh kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Kemudian setelah kalian bertaubat, Kami kembalikan kerajaan dan kemenangan kalian. Dan Kami limpahkan kepada kalian harta benda dan anak setelah kalian dirampas dan ditawan. Dan Kami jadikan kalian memiliki jumlah yang lebih banyak dari mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kemudian Kami memberikan kepada kalian giliran} kekuasaan dan kelebihan {untuk mengalahkan mereka, membantu kalian dengan harta kekayaan dan anak-anak, dan menjadikan kalian lebih banyak kelompoknya} jumlahnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6. “Kemudian Kami berikan kepadamu giliran untuk mengalahkan mereka kembali,” yaitu atas orang-orang yang telah diberi keleluasaan untuk menguasai kalian. Kemudian kalian sanggup mengusir mereka dari kampung-kampung halaman. “Dan Kami membantumu dengan harta kekayaan dan anak-anak,” maksudnya Kami memperbanyak kucuran rizki dan jumlah kalian, serta Kami besarkan kekuatan kalian (untuk mengalahkan) mereka, “dan Kami jadikan kamu kelompok yang lebih besar,” daripada mereka dengan sebab perbuatan baik dan ketundukan kalian kepada Allah."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat: Firman-Nya ta’ala “Kemudian Kami berikan kepadamu giliran untuk mengalahkan mereka...” setelah tahun yang panjang Bani Israil hidup di bawah penindasan dan terusir, muncullah keinginan dan permintaan untuk pengangkatan seorang raja yang dapat memimpin mereka berjihad, sebagaimana yang telah dijelaskan pada surat Al-Baqarah, mereka berjihad dan Daud berhasil membunuh Jalut, ini lah makna dari “Kemudian Kami berikan kepadamu giliran untuk mengalahkan mereka...” Firman-Nya “Kami membantumu dengan harta kekayaan dan anak-anak dan Kami jaddikan kamu kelompok yang lebih besar.” Yaitu paling banyak pasukan dalam peperangan, harta, dan anak keturunan. Maka muncullah sebuah negeri yang dapat memimpin dunia pada masa Daud dan Sulaiman ‘alaihimas salam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 6: Yakni berhasil mengusir mereka dari tempat tinggalnya. Ada yang berpendapat, bahwa maksudnya adalah berhasil membunuh Jalut dan tentara-tentaranya setelah seratus tahun ditindas olehnya. Disebabkan perbuatan ihsanmu dan ketundukan serta kerendahan hatimu kepada Allah Subhaanahu wa Ta'aala."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 6",
    "description": "Ketetapan Allah menakdirkan bahwa mereka dapat mengalahkan musuh-Musuhnya dan membangun kembali kerajaannya yang besar. Allah menyatakan, kemudian kami berikan kepadamu giliran untuk mengalahkan mereka kembali, setelah negerimu dikuasai dan ditaklukkan oleh mereka, dan kami membantumu untuk membangun kembali negerimu dan mengokohkan kekuasaanmu dengan harta kekayaan serta anak-anak dan kami jadikan kamu kelompok yang lebih besar dari kelompok kamu sebelumnya. Jika kamu berbuat baik dengan menaati perintah Allah dan rasul-Nya serta melakukan kebijakan kepada sesamanya, berarti kamu berbuat baik untuk dirimu sendiri, karena balasan yang kamu peroleh dari kebaikan itu. Dan jika kamu berbuat jahat, makakerugian kejahatanitujugauntuk dirimu sendiri, karena akibat dari kejahatan akan menimpamu. Selanjutnya dinyatakan kejahatan yang kedua yang diperbuat oleh kaum bani israil dan azab Allah yang ditimpakan atas mereka dinyatakan dalam firmannya, dan apabila datang saat hukuman kejahatan yang kedua, yang telah kami tetapkan di dalam kitab itu, kami datangkan orang-orang lain untuk menyiksamu sehingga menyuramkan wajah-wajahmu, akibat kesedihan dan penderitaan yang kamu alami, dan mereka, yakni musuhmusuhmu masuk ke dalam masjid, yakni masjidil aqsa, guna menyiksa dan membunuhmu sebagaimana mereka memasukinya pada kali pertama guna menyiksa dan membunuhmu akibat kejahatan kamu yang pertama, dan mereka memasukinya dengan tujuan untuk membinasakan sehabis-habisnya apa saja yang mereka kuasai."
  }
]