[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ingatlah (wahai rasul) ketika Kami berfirman kepadamu, ”sesungguhnya tuhanmu meliputi seluruh manuasia dengan ilmu dan kekuasaanNya. Dan Kami tidaklah menjadikan penglihatan yang kami perlihatkan kepadamu secara langsung pada malam isra’ mi’raj berupa makhluk-mahkluk ciptaan yang luar biasa besar kecuali sebagai ujian bagi manusia, supaya bisa memisahkan mana yang kafir, dan mana yang mukmin. Dan tidaklah Kami menjadikan pohon zaqqum terlaknat yang disebutkan dalam al-qur’an, kecuali sebagai cobaan bagi manusia. Kami membuat takut kaum musyrikin dengan berbagai macam siksaan dan tanda-tanda kuasa Kami. Dan tidaklah perkara-perkara yang menakutkan itu menambah mereka kecuali kian menjadi-jadi dalam kekafiran dan kesesatan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "60. Dan ingatlah -wahai Rasul- ketika Kami wahyukan kepadamu, \"Sungguh kekuasaan Tuhanmu meliputi seluruh manusia, mereka senantiasa berada dalam genggaman-Nya, Allah juga akan melindungi dirimu dari kejahatan mereka, maka sampaikanlah segala apa yang diperintahkan padamu untuk disampaikan. Dan Kami tidak menjadikan apa yang Kami perlihatkan padamu secara jelas pada malam isra` kecuali sebagai ujian bagi manusia; apakah mereka akan membenarkannya atau malah mendustakannya? Dan Kami juga tidak menjadikan pohon zaqqum yang disebutkan dalam Al-Qur`ān bahwa ia tumbuh di dasar Neraka Jahim melainkan sebagai ujian bagi mereka. Bila mereka tidak percaya dengan dua tanda kebenaran Rasul ini maka mereka pasti tidak akan percaya dengan tanda-tanda kebenaran lainnya, dan Kami akan terus mengancam mereka untuk mengirimkan tanda-tanda kebenaran Rasul, namun hal itu malah tidak akan menambah mereka kecuali semakin bertambah kafir dan semakin terjerumus ke dalam kesesatan.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "60. Hai Rasulullah, Ingatlah ketika Kami berfirman kepadamu untuk menenangkan hatimu: “Sungguh Tuhanmu akan melindungimu dari gangguan manusia. Dan Kami tidak peristiwa-peristiwa yang Kami perlihatkan kepadamu pada malam isra’ mi’raj melainkan sebagai ujian bagi manusia, agar membedakan antara orang yang beriman dan orang yang mendustakan; dan pohon Zaqqum yang terlaknat dalam al-Qur’an juga merupakan ujian bagi mereka. Kami memberi ketakutan kepada orang-orang musyrik yang mendustakan dengan berbagai mukjizat dan siksaan, akan tetapi itu hanya menambah pelanggaran mereka terhadap larangan-larangan Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "60. وَإِذْ قُلْنَا لَكَ إِنَّ رَبَّكَ أَحَاطَ بِالنَّاسِ ۚ (Dan (ingatlah), ketika Kami wahyukan kepadamu: “Sesungguhnya (ilmu) Tuhanmu meliputi segala manusia”) Yakni mereka berada dalam genggaman-Nya dan di bawah kekuasaan-Nya. Terdapat pendapat mengatakan yang dimaksud dengan manusia disini adalah para penduduk kota Makkah. Allah berkuasa atas mereka dan akan memberimu kuasa atas mereka, maka janganlah kamu tergesa-gesa. وَمَا جَعَلْنَا الرُّءْيَا الَّتِىٓ أَرَيْنٰكَ إِلَّا فِتْنَةً لِّلنَّاسِ(Dan Kami tidak menjadikan mimpi (penampakan) yang telah Kami perlihatkan kepadamu, melainkan sebagai ujian bagi manusia) Penampakan ini merupakan penampakan nyata pada saat malam isra’ mi’raj yang disebutkan pada awal surat, dan disebut sebagai mimpi karena itu terjadi pada malam hari. Sedangkan ujian yang dimaksud adalah murtadnya sekelompok orang yang sebelumnya telah beriman akibat kabar isra’ mi’raj yang Rasulullah sampaikan kepada mereka. Pendapat lain mengatakan bahwa penampakan itu adalah dalam mimpi. Allah menampakkan kepada Rasulullah dalam mimpi bahwa ia melawan kafir Quraisy di perang Badar. وَالشَّجَرَةَ الْمَلْعُونَةَ فِى الْقُرْءَانِ ۚ (an (begitu pula) pohon yang terkutuk dalam Al Quran) Yakni pohon Zaqqum. Dan yang dimaksud dengan (الفتنة) adalah bahwa Abu Jahal dan lainnya mengatakan: sahabat kalian itu (Muhammad) mengatakan bahwa neraka Jahannam dapat membakar batu, kemudian ia mengatakan bahwa di neraka tumbuh pepohonan. Dan diriwayatkan bahwa Abu Jahal memerintahkan budak wanitanya untuk menghidangkan kurma dan mentega, kemudian dia mengatakan kepada para sahabatnya: “nikmatilah buah Zaqqum ini” وَنُخَوِّفُهُمْ فَمَا يَزِيدُهُمْ إِلَّا طُغْيٰنًا كَبِيرًا (Dan Kami menakut-nakuti mereka, tetapi yang demikian itu hanyalah menambah besar kedurhakaan mereka) Yakni menakut-nakuti mereka dangan berbagai mukjizat. Namun hal itu tidak bermanfaat bagi mereka, melainkan hanya menambah kekafiran mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Ayat-ayat kauniyah Allah tunjukkan agar kita takut kepada-Nya, dan sebagai bukti akan kekuasaan dan kekuatan-Nya, orang-orang yang diberikan hidayah oleh Allah akan mengingat sedangkan orang-orang yang dijauhkan darinya akan menyombongkan diri { وَنُخَوِّفُهُمْ فَمَا يَزِيدُهُمْ إِلَّا طُغْيَٰنًا كَبِيرًا } \"Dan Kami menakut-nakuti mereka, tetapi yang demikian itu hanyalah menambah besar kedurhakaan mereka.\""
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "60. Dan ingatlah wahai Nabi saat Kami berfirman kepadamu: “Sesungguhnya Tuhanmu meliputi manusia dengan pengetahuan dan kekuasaanNya, sehingga mereka berada dalam genggaman dan di bawah kuasaNya, maka sampaikanlah kepada mereka risalahmu.” Dan Kami tidak menjadikan penglihatan yang Kami perlihatkan kepadamu pada malam Isra’ Mi’raj, yaitu melihat ayat-ayat dan mukjizat Allah sebagaimana yang terdapat dalam surah (ayat) {Linuriyahu min ayatina} [1] Dan Kami tidak menjadikan pohon Zaqqum yang sangat dihindari untuk dimakan yang tumbuh di dasar neraka Jahim tanpa terbakar itu kecuali sebagai ujian dan cobaan bagi penduduk Mekah. Dan Kami tidak memperingatkan mereka dengan pohon itu dan ayat-ayat (lain). Peringatan Kami dan penyampaian ayat itu tidak lain hanya membuat mereka semakin menjadi-jadi dalam kekufuran. Pada suatu hari rasulallah SAW khawatir, lalu dikatakan kepadanya: “Apa yang terjadi kepadamu wahai rasulallah? Jangan kamu pedulikan hal itu, sesungguhnya itu adalah penglihatan tentang apa yang menimpa mereka.” Lalu Allah SWT menurunkan ayat {Wa Maa Ja’alnaar ru’yaa}. Abu Jahal dan lainnya berkata: “Sahabat kalian menganggap bahwa neraka Jahanam itu mampu membakar batu” kemudian berkata: “Namun di dalamnya tumbuh pohon”. Dia menganggap bahwa pohon Zaqqum itu adalah makanan jenis bubur dengan tambahan susu, lalu turunlah ayat {Wasy-Syajarota …}"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "(Ingatlah) ketika Kami berfirman kepadamu,“Sesungguhnya Tuhanmu meliputi seluruh manusia”} meliputi seluruh manusia dengan takdir dan ilmuNya, jadi mereka itu ada dalam genggamanNya {Kami tidak menjadikan penglihatan yang telah Kami perlihatkan kepadamu} penglihatan matamu yang Kami perlihatkan kepadamu pada malam Isra’ Mi’raj yang termasuk sesuatu yang mengagumkan {melainkan sebagai ujian} ujian dan tes {bagi manusia dan pohon yang terkutuk} pohon zaqqum yang terkutuk karena memakannya {dalam Al-Qur’an. Kami menakut-nakuti mereka, tetapi yang demikian itu hanyalah menambah kedurhakaan mereka} semakin kufur dan tersesat {menjadi besar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "60. “Dan (ingatlah), ketika Kami wahyukan kepadamu,” ‘Sesungguhnya Rabbmu meliputi segala manusia’ ,” yaitu ilmu dan kekuasaanNya. Maka tidak ada bagi mereka tempat berlindung dariNya, dan tidak ada tempat persembunyian bagi mereka dariNya. Maka, ini sudah cukup bagi orang-orang yang berakal untuk meninggalkan segala sesuatu yang Allah benci yang (ilmu dan kekuasaanNya) meliputi segala sesuatu. “Dan Kami tidak menjadikan mimpi yang telah Kami perlihatkan kepadamu,” kebanyakan ahli tafsir mengartikan kata ‘aru-ru’ya’ tersebut dengan malam Isra “dan pohon kayu yang terkutuk,” yang disebutkan “dalam al-Quran,” yaitu pohon Zaqqum yang tumbuh di dasar Neraka Jahim. Pengertian ayat ini adalah, apabila dua perkara ini saja sudah menjadi fitnah bagi manusia, sehingga orang-orang kafir terus terang dengan keingkarannya, dan kejahatan mereka semakin menjadi-jadi, sementara sebagian orang yang lemah imannya kembali menjadi kafir, (hanya) dengan sebab kabar berita yang Rasulullah sampaikan tentang kejadian-kejadian (luar biasa) di malam Isra’, yaitu perjalanan (yang dimulai) dari Masjidil haram hingga Masjidil Aqsa, yang merupakan peristiwa yang sangat luar biasa, dan informasi tentang adanya pohon yang tumbuh di dasar Neraka Jahim termasuk kejadian yang di luar kewajaran, ini saja sudah menyebabkan orang-orang itu mendustakan, maka bagaimana seandainya mereka menyaksikan ayat-ayat Allah yang lebih besar dan kejadian-kejadian yang lebih luar biasa? Bukankah hal itu akan semakin menyebabkan kenaikan tingkat keburukan mereka? Oleh karenanya, Allah pun merahmati mereka dan memalingkannya dari mereka. Dari sini, kita bisa mengetahui bahwa tidak dijelaskannya secara rinci peristiwa-peristiwa luar biasa yang akan terjadi di masa mendatang dalam al-KItab dan as-Sunnah adalah lebih utama dan lebih baik. Karena perkara-perkara besar yang belum pernah disaksikan padanannya oleh orang-orang, mungkin saja akal-akal mereka tidak mau menerimanya. (Apabila mereka diberitahu sebelum terjadinya peristiwa itu), maka hal itu berpotensi menimbulkan keraguan di hati orang-orang Mukmin, dan menjadi penghalang bagi orang-orang yang belum masuk Islam dan membuat orang lari dari Islam. Akan tetapi, Allah menggunakan lafazh-lafazh umum yang mencakup semua kejadian yang akan terjadi. Wallahu a’lam. “Dan Kami menakut-nakuti mereka,” dengan ayat-ayat. “Tetapi yang demikian itu tidaklah menambah mereka,” maksudnya, ancaman itu (tidaklah menambah mereka) “melainkan kedurhakaan yang besar,” ungkapan ini lebih mewakili predikat keburukan dan rasa cinta terhadap keburukan itu, kebencian mereka terhadap kebaikan dan kepongahan kepadanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 60: Baik ilmu-Nya maupun kekuasaan-Nya. Mereka semua dalam genggaman-Nya, oleh karena itu sampaikanlah apa yang diturunkan Tuhanmu kepada mereka, dan jangan takut kepada seorang pun, karena Dia yang menjagamu dari mereka. Ayat ini juga sudah cukup bagi orang yang berakal untuk berhenti dari mengerjakan larangan Allah yang ilmu dan kekuasaan-Nya meliputi seluruh manusia. Mimpi adalah terjemah dari kata Ar Ru'ya dalam ayat ini. Maksudnya adalah mimpi tentang perang Badar yang dialami Rasulullah shallallahu 'alaihi wa sallam sebelum perang Badar itu terjadi. Namun kebanyakan mufassir menerjemahkan kata Ar Ru'ya tersebut dengan penglihatan, yang maksudnya adalah penglihatan yang dialami Rasulullah shallallahu 'alaihi wa sallam di malam Isra dan mi'raj. Yakni sebagai ujian bagi penduduk Mekah, oleh karena itu mereka semakin mendustakan Beliau, sedangkan sebagian orang yang telah beriman kembali murtad ketika diberitahukan peristiwa isra’ dan mi’raj. Yaitu pohon zaqqum yang tersebut dalam surat As Shaffat ayat 62 sampai dengan 65. Pohon Zaqqum tumbuh di dasar neraka Jahanam. Allah menjadikannya sebagai cobaan bagi mereka. Oleh karena itu, mereka mengatakan karena mengingkarinya, “Bukankah api itu membakar pohon, mengapa malah menumbuhkannya?” Syaikh As Sa’diy berkata, “Dari sini anda mengetahui, bahwa tidak disebutkan secara tegas dalam Al Qur’an dan As Sunnah peristiwa-peristiwa besar yang terjadi di akhir-akhir zaman ini lebih tepat dan lebih baik, karena peristiwa yang tidak disaksikan manusia ada yang sebanding. Terkadang akal mereka tidak menerimanya jika langsung diberitahukan sebelum terjadinya, sehingga hal itu menyebabkan keraguan di hati sebagian kaum mukmin, menghalangi non muslim masuk Islam dan menjauhkannya. Bahkan Allah menyebutkannya dengan lafaz-lafaz yang umum mengena kepada segala sesuatu yang akan terjadi.” Dengan banyak ayat (tanda kekuasaan-Nya)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 60",
    "description": "Selanjutnya Allah mengingatkan kepada nabi Muhammad agar tidak ragu-ragu menyampaikan risalah-Nya, dan tidak bersedih hati karena penolakan orang-orang kafir terhadap ayat-ayat Allah. Dan ingatlah ketika kami wahyukan kepadamu, wahai nabi Muhammad, sungguh, ilmu dan kekuasaan tuhanmu meliputi seluruh manusia. Sampaikanlah ini kepada semua manusia dan janganlah bersedih hati karena penolakan mereka terhadap ayat-ayat kami. Dan ketahuilah kami tidak menjadikan mimpi, atau penglihatan dalam keadaan sadar, yang telah kami perlihatkan kepadamu, pada malam isra mikraj melainkan sebagai ujian bagi manusia agar menjadi jelas siapa di antara mereka yang percaya dan siapa yang tidak percaya dan begitu pula apa yang kami wahyukan kepadamu tentang pohon yang terkutuk dalam Al-Qur'an agar menjadi ujian bagi manusia siapa di antara mereka yang percaya dan siapa yang tidak percaya. Dan dengan kedua macam tanda itu kami menakut-nakuti mereka, supaya mereka beriman tetapi yang demikian itu hanyalah menambah besar kedurhakaan mereka. Penolakan orang-orang kafir kepada para rasul itu bukanlah sesuatu yang baru. Para rasul sebelum nabi Muhammad juga mendapatkan perlakuan yang sama dari kaumnya. Permusuhan kepada para nabi bahkan telah dimulai semenjak permusuhan iblis kepada nabi adam. Dan ingatlah ketika kami berfirman kepada para malaikat, sujudlah kamu semua kepada adam, yakni sujud dengan tujuan penghormatan bukan menyembah, lalu mereka semuanya sujud, kecuali iblis yang enggan bersujud karena keangkuhan dan kedurhakaannya. Ia (iblis) berkata, apakah aku harus bersujud kepada orang yang engkau ciptakan dari tanah yang rendah derajatanya daripadaku yang engkau ciptakan dari api'."
  }
]