[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ingatlah firman Kami kepaada malaikat, ”bersujudlah kepada Adam sebagai penghormatan dan pemuliaan.” merekapun bersujud semua kecuali iblis. ia menyombongkan diri dan menolak bersujud sembari berdalih, sebagai bentuk kesombongan dan pengingkaran, ”apakah pantas aku bersujud kepada manusia yang lemah dan makhluk yang diciptakan dari tanah liat ini?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "61. Dan ingatlah -wahai Rasul- ketika Kami berfirman kepada para Malaikat, \"Sujudlah kalian semua kepada Adam sebagai sujud penghormatan, bukan sujud ibadah dan penyembahan,\" lalu mereka semua mengerjakannya dan sujud kepada Adam, namun ternyata Iblis enggan bersujud kepadanya karena sombong seraya berkata kepada Allah, \"Apakah aku harus bersujud kepada orang yang Engkau ciptakan dari tanah, sedangkan aku Engkau telah ciptakan dari api?! Sungguh aku lebih mulia darinya.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "61. Allah memperingatkan dari tipu daya setan dalam lima ayat berikut. Allah menyebutkan percakapan yang terjadi antara diri-Nya dengan setan ketika Dia memerintahkan seluruh malaikat untuk bersujud kepada Adam sebagai penghormatan baginya; maka para malaikat bersujud kepadanya semua, kecuali Iblis yang enggan dan inggar dengan berkata: “Apakah aku harus bersujud kepada makhluk yang Engkau ciptakan dari tanah?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "61. فَسَجَدُوٓا۟ إِلَّآ إِبْلِيسَ قَالَ ءَأَسْجُدُ لِمَنْ خَلَقْتَ طِينًا (lalu mereka sujud kecuali iblis. Dia berkata: “Apakah aku akan sujud kepada orang yang Engkau ciptakan dari tanah?”) Yakni Iblis merasa angkuh dan enggan untuk bersujud kepada Adam dan mengaku bahwa dirinya lebih mulia dari Adam, sebab ia diciptakan dari unsur api, dan ia menganggap bahwa api lebih mulia daripada tanah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "61. Dan ingatlah ketika Kami berfirman kepada para malaikat: “Bersujudlah kepada Adam sebagai bentuk penghormatan dan sambutan mulia.” Lalu semuanya bersujud kecuali Iblis yang enggan dan berkata: “Haruskah aku bersujud kepada makhluk yang terbuat dari tanah?!” kalimat {Khalaqta Tiinaa} maknanya adalah Engkau menciptakannya dari tanah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "(Ingatlah) ketika Kami berfirman kepada para malaikat,“Sujudlah kepada Adam” Mereka pun sujud, kecuali Iblis. Ia berkata,“Apakah aku harus bersujud kepada orang yang Engkau ciptakan dari tanah”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "61. Allah Yang Mahasuci lagi Mahatinggi telah mengingatkan para hambaNya akan dahsyatnya permusuhan dan kegigihan setan untuk menyesatkan mereka. Dan bahwa tatkala Allah menciptakan Adam, setan berlagak sombong untuk sujud kepadanya, “dia berkata,” dengan penuh kesombongan, “Apakah aku akan sujud kepada orang yang Engkau ciptakan berupa tanah?” yaitu dari tanah. Dengan prasangkanya, dia lebih baik daripada Adam karena tercipta dari api. Sungguh telah dibahas betapa buruknya qiyas (analogi) yang batil ini dari banyak segi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 61: Allah Subhaanahu wa Ta'aala mengingatkan tentang kerasnya permusuhan setan kepada manusia dan keinginannya untuk menyesatkan mereka (manusia). Sebagai penghormatan, bukan sujud ibadah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 61",
    "description": "Penolakan orang-orang kafir kepada para rasul itu bukanlah sesuatu yang baru. Para rasul sebelum nabi Muhammad juga mendapatkan perlakuan yang sama dari kaumnya. Permusuhan kepada para nabi bahkan telah dimulai semenjak permusuhan iblis kepada nabi adam. Dan ingatlah ketika kami berfirman kepada para malaikat, sujudlah kamu semua kepada adam, yakni sujud dengan tujuan penghormatan bukan menyembah, lalu mereka semuanya sujud, kecuali iblis yang enggan bersujud karena keangkuhan dan kedurhakaannya. Ia (iblis) berkata, apakah aku harus bersujud kepada orang yang engkau ciptakan dari tanah yang rendah derajatanya daripadaku yang engkau ciptakan dari api'ia, yaitu iblis, berkata, terangkanlah kepadaku, inikah yang yang lebih engkau muliakan daripada aku' terangkanlah mengapa adam yang diciptakan dari tanah lebih engkau muliakan daripadaku yang engkau ciptakan dari api' sekiranya engkau memberi waktu kepadaku untuk menggoda dan menyesatkan mereka sampai hari kiamat, pasti akan aku sesatkan keturunannya, sehingga mereka sesat dan durhaka kepada-Mu, kecuali sebagian kecil saja dari mereka, yaitu orang-orang yang mendapat perlindungan dari-Mu, maka aku tidak dapat menyesatkan mereka."
  }
]