[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Iblis berkata kepada Allah dengan penuh kelancanagn dan kekafiran kepadaNya, ”bagaimana menurutMu makhluk ciptaan yang telah Engkau beri kelebihan atas diriku? jika Engkau melanggengkanku dalam keadaan hidup sampai hari kiamat, aku benar-benar akan dapat menguasai keturunan-keturunannya dengan menyesatkan dan merusak mereka, kecuali orang-orang yang ikhlas dalam keimanannya yang jumlahnya sedikit saja. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "62. Iblis berkata lagi pada Tuhannya, \"Inikah makhluk yang lebih Engkau muliakan daripada aku dengan memerintahkanku untuk bersujud kepadanya? Sekiranya Engkau memberiku umur hingga masa berakhirnya dunia, pasti aku akan berusaha menyesatkan anak keturunannya, dan mengeluarkan mereka dari jalan yang lurus kecuali sebagian kecil dari mereka yang Engkau lindungi yaitu hamba-hamba-Mu yang memurnikan keikhlasan hanya kepada-Mu.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "62-63. Kemudian pembangkangannya semakin bertambah ketika dia berkata: “Beritahukanlah kepadaku tentang makhluk ini, mengapa Engkau lebih mengutamakannya dariku?” Lalu dia bersumpah: “Jika Engkau menangguhkanku hingga hari kiamat, sungguh aku akan menguasai keturunannya dengan menggoda dan menyesatkan mereka; kecuali orang-orang beriman yang enggau jaga mereka dariku.” Maka Allah membalas dengan laknat dan kehinaan baginya dan bagi para pengikutnya: “Pergilah, dan Aku telah mengangguhkanmu. Dan jika ada keturunan Adam yang mentaatimu maka neraka Jahannam adalah balasan bagimu dan baginya sebagai balasan yang sempurna dan setimpal."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "62. أَرَءَيْتَكَ (Terangkanlah kepadaku) Yakni beritahukanlah aku tentang orang yang lebih Engkau utamakan dariku, mengapa Engkau lebih mengutamakannya sehingga Engkau perintahkan aku untuk bersujud kepadanya? لَأَحْتَنِكَنَّ ذُرِّيَّتَهُۥٓ( niscaya benar-benar akan aku sesatkan keturunannya) Yakni sungguh aku akan mengusai mereka dengan godaanku dan aku sesatkan seperti kuda yang dipasang tali kekangnya. Makna (التحنيك) yakni kuda yang dipasang tali kekang pada rahangnya (agar mudah dikendalikan) إِلَّا قَلِيلًا (kecuali sebahagian kecil) Mereka adalah orang-orang yang dilindungi oleh Allah yang disebutkan dalam firman-Nya: إن عبادي ليس لك عليهم سلطان “Sesungguhnya hamba-hamba-Ku tidak ada kekuasaan bagimu terhadap mereka” (al-Hijr:42)"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "62. Wahai Tuhanku, beritahulah aku wahai Tuhan tentang makhluk yang engkau utamakan atasku ini, kenapa engkau mengutamakannya, sedangkan aku lebih mulia daripada dia? Maksudnya yaitu aku tidak tahu sebab pemuliaan ini, Jika engkau memberiku waktu sampai haru kiamat, sungguh aku akan memalingkan mereka dengan bujuk rayu dan kesesatan, kecuali sedikit orang dari mereka yang engkau pelihara, maka aku tidak memiliki kuasa atas mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ia berkata,“Terangkanlah kepadaku tentang orang ini yang lebih Engkau muliakan daripada aku} Beritahulah aku tentang orang yang Engkau lebihkan di atasku sehingga Engkau memerintahkanku untuk bersujud kepadanya {Sungguh jika Engkau memberi tenggang waktu kepadaku} menangguhkanku {sampai hari kiamat, niscaya aku benar-benar akan menyesatkan keturunannya} sungguh aku akan menarik keturunannya untuk menyimpang dari jalanMu yang lurus {kecuali sebagian kecil”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "62. Maka tatkala jelas bagi iblis bahwa Allah mengutamakan Adam atas dirinya, “dia (iblis) berkata,” mengajak bicara kepada Allah, “Terangkanlah kepadaku, inikah orangnya yang Engkau muliakan atas diriku? Sesungguhnya jika Engkau memberi tangguh kepadaku sampai Hari Kiamat, niscaya benar-benar akan aku sesatkan keturunannya,” maksudnya aku benar-benar akan membinasakan mereka sampai tuntas dengan menyesatkan (mereka) dan aku sungguh akan menyimpangkan mereka “kecuali sebagian kecil,” setan yang keji mengetahui bahwa di antara mereka ada yang memusuhi dan tidak patuh terhadap Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 62: Yakni padahal aku Engkau ciptakan dari api. Yang Engkau jaga."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 62",
    "description": "Ia, yaitu iblis, berkata, terangkanlah kepadaku, inikah yang yang lebih engkau muliakan daripada aku' terangkanlah mengapa adam yang diciptakan dari tanah lebih engkau muliakan daripadaku yang engkau ciptakan dari api' sekiranya engkau memberi waktu kepadaku untuk menggoda dan menyesatkan mereka sampai hari kiamat, pasti akan aku sesatkan keturunannya, sehingga mereka sesat dan durhaka kepada-Mu, kecuali sebagian kecil saja dari mereka, yaitu orang-orang yang mendapat perlindungan dari-Mu, maka aku tidak dapat menyesatkan mereka. Dia, yaitu Allah, berfirman, pergilah, yakni lakukan apa yang engkau mampu untuk menyesatkan mereka, tetapi barang siapa di antara mereka, yaitu anak cucu adam yang mengikuti kamu menempuh jalan yang sesat, maka sungguh, neraka jahanamlah balasanmu semua, iblis dan anak cucu adam yang mengikuti ajakannya sebagai pembalasan yang cukup dan setimpal dengan perbuatannya."
  }
]