[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah berfirman memperingatkan iblis dan para pengikutnya, ”pergilah engkau! Maka siapa saja yang mengikutimu dari keturunan Adam, lalu ia menaatimu, maka sesungguhnya hukuman bagimu dan hukuman bagi mereka akan (ditimpakan secara) penuh di neraka jahanam."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "63. Tuhannya berfirman kepadanya, \"Pergilah engkau dan orang-orang yang mengikutimu dari anak keturunan Adam, maka sungguh Neraka Jahanamlah balasan bagimu dan bagi mereka sebagai balasan yang sempurna lagi setimpal atas amal keburukan kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "63. قَالَ اذْهَبْ فَمَن تَبِعَكَ مِنْهُمْ (Tuhan berfirman: “Pergilah, barangsiapa di antara mereka yang mengikuti kamu) Yakni yang mematuhimu. فَإِنَّ جَهَنَّمَ جَزَآؤُكُمْ(maka sesungguhnya neraka Jahannam adalah balasanmu semua) Yakni balasan bagi Iblis dan pengikutnya. جَزَآءً مَّوْفُورًا(sebagai suatu pembalasan yang cukup) Yakni balasan yang sempurna."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "63. Allah berfirman: “Pergilah dengan perkaraamu, barangsiapa di antara mereka yang menaatimu, maka sesungguhnya neraka jahannam itu adalah balasanmu dan mereka sebagai bentuk balasan yang berlebih dan sempurna.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia berfirman,“Pergilah, siapa saja di antara mereka yang mengikutimu} dari keturunan Adam menaatimu {sesungguhnya neraka Jahanam adalah balasan kalian semua sebagai balasan yang sempurna} yang melimpah dan sempurna"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "63. Allah berfirman kepadanya, “Pergilah, barangsiapa di antara mereka yang mengikuti kamu,” dan memilihmu daripada Rabbnya dan penjaganya yang hak. “Maka sesungguhnya Neraka Jahanam adalah balasanmu semua, sebagai suatu pembalasan yang cukup,” maksudnya, yang tersimpan dan terpenuhi sebagai balasan atas perbuatan kalian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 63: Dengan diberi tangguh sampai tiupan yang pertama."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 63",
    "description": "Dia, yaitu Allah, berfirman, pergilah, yakni lakukan apa yang engkau mampu untuk menyesatkan mereka, tetapi barang siapa di antara mereka, yaitu anak cucu adam yang mengikuti kamu menempuh jalan yang sesat, maka sungguh, neraka jahanamlah balasanmu semua, iblis dan anak cucu adam yang mengikuti ajakannya sebagai pembalasan yang cukup dan setimpal dengan perbuatannya. Dan perdayakanlah siapa saja di antara mereka anak cucu adam yang engkau, yakni iblis sanggup melakukannya dengan suaramu yang memukau dan ajakanmu yang menggoda, dan lakukanlah dengan segala kemampuanmu, kerahkanlah pasukanmu terhadap mereka, yang berkuda dan yang berjalan kaki, dan bersekutulah dengan mereka pada harta dengan menggoda agar mereka mencari dan menginfakkan hartanya dengan jalan yang haram, dan berserikatlah dengan mereka pada anak-anak dengan berbuat zina sehingga melahirkan anak-anak sebagai hasil dari perbuatannya atau menguburkannya anak perempuan mereka hiduphidup, lalu beri janjilah kepada mereka bahwa mereka tidak akan mendapat siksaan dengan perbuatannya itu. Padahal setan itu hanya menjanjikan tipuan belaka kepada mereka."
  }
]