[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan hasutlah setiap orang dari mereka yang bisa kamu hasut dengan menyeru mereka untuk mendurhakaiKu, dan kumpulkanlah atas mereka apa yang mampu untuk kamu kumpulkan baik pasukan berkuda atau pasukan berjalan kaki, dan jadikanlah dirimu berserikat dengan mereka pada kekayaan mereka agar mereka mencarinya dari hal-hal yang diharamkan dan pada anak-anak mereka dengan memperindah pandangan mereka terhadp zina dan maksiat-maksiat serta pelanggaran terhadap perintah-perintah Allah, sehingga praktek kebejatan dan kerusakan kian merajalela, dan berilah para pengikutmu dari keturunan Adam janji-janji dusta. Maka setiap janji setan itu adalah batil dan merupakan tipu daya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "64. Dan perdayakanlah siapa saja di antara mereka yang sanggup engkau (Iblis) tipu dengan suara indahmu yang menyeru kepada maksiat, dan kerahkanlah pasukan berkudamu dan pejalan kaki menuju mereka agar mereka tunduk dan mengikutimu. Bersekutulah dengan mereka dalam harta dengan menghiasi amal usaha mereka yang menyelisihi syariat Allah, dan bersekutulah dengan mereka pada anak-anak mereka dengan cara mereka mengklaimnya secara dusta, menghasilkannya dari jalan zina, dan menghambakan mereka kepada selain Allah sewaktu pemberian nama, serta berilah mereka janji-janji dusta dan angan-angan palsu,\" Padahal setan itu hanya menjanjikan kedustaan belaka yang menipu mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "64-65. Dan jerumuskanlah mereka yang kamu mampu dengan godaanmu menuju kemaksiatan dan kerusakan, dan kumpulkanlah terhadap mereka seluruh pasukan yang kamu miliki, pasukan yang berkendara menuju kemaksiatan dan pasukan yang berjalan untuk bermaksiat kepada Allah. Bersekutulah dengan mereka dalam harta yang mereka miliki dengan menghiasi perbuatan mereka membelanjakan harta dalam hal-hal haram dan dengan mencarinya dengan cara yang tidak dibenarkan syariat. Dan Bersekutulah dengan mereka dalam anak-anak yang mereka miliki, dengan mengubur hidup-hidup anak perempuan mereka dan membunuh anak laki-laki mereka karena takut jatuh miskin, dan dengan membuat ikhtilath antara laki-laki dan perempuan sehingga mereka terjerumus dalam perzinaan sehingga akan ada banyak anak-anak dari hasil zina. Dan janjikanlah kepada mereka janji-janji palsu dan angan-angan kosong. Dan apa yang dijanjika setan hanyalah janji batil yang menggoda. Sungguh hamba-hamba-Ku yang beriman yang mentaati-Ku tidak akan mampu kamu sesatkan. Dan cukuplah Tuhanmu sebagai Penjaga mereka darimu.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "64. وَاسْتَفْزِزْ مَنِ اسْتَطَعْتَ مِنْهُم بِصَوْتِكَ(Dan hasunglah siapa yang kamu sanggupi di antara mereka dengan ajakanmu) Yakni hinakanlah mereka dengan godaanmu agar bermaksiat kepada Allah. وَأَجْلِبْ عَلَيْهِم بِخَيْلِكَ وَرَجِلِكَ(dan kerahkanlah terhadap mereka pasukan berkuda dan pasukanmu yang berjalan kaki) Yakni ajaklah mereka dengan mengerahkan bala tentaramu yang berkuda dan yang berjalan kaki agar membantumu untuk menggoda anak keturunan Adam. وَشَارِكْهُمْ فِى الْأَمْوٰلِ وَالْأَوْلٰدِ (dan berserikatlah dengan mereka pada harta dan anak-anak) Serikatnya dalam harta berupa segala penggunaan harta yang menyelisihi aturan syariat; sedangkan serikatnya dalam anak keturunan berupa usaha untuk mendapatkan anak dengan cara yang tidak sesuai syariat, yakni dengan berzina, dan pemberian nama anak keturunan dengan nama Abdul Laata dan Abdul Uzza. وَعِدْهُمْ ۚ (dan beri janjilah mereka) Imam al-Farra’ menafsirkan, yakni katakanlah kepada mereka: “surga dan neraka itu tidak ada, maka berbuatlah sesuka kalian” dan janjikanlah kepada mereka bahwa mereka tidak akan dibangkitkan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Berhati-hatilah wahai mukmin! dan perhatikanlah firman Allah ini kepada musuh kita Iblis : { وَاسْتَفْزِزْ مَنِ اسْتَطَعْتَ مِنْهُمْ بِصَوْتِكَ } \"Dan hasunglah siapa yang kamu sanggupi di antara mereka dengan ajakanmu\", masuk dalam ayat ini semua hal yang mengajak kepada kemaksiatan { وَأَجْلِبْ عَلَيْهِمْ بِخَيْلِكَ وَرَجِلِكَ } \"dan kerahkanlah terhadap mereka pasukan berkuda dan pasukanmu yang berjalan kaki\" dan dalam kalimat ini termasuk juga siapapun yang berjalan di menuju kemaksiatan, sesungguhnya itu semua adalah pasukan berkuda dan pasukan yang berjalan kaki untuk syaithon."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "64. Dan rendahkanlah anak cucu Adam yang bisa kamu ajak menuju kemaksiatan menggunakan suara, bujuk rayu dan gangguanmu. Dan kerahkanlah kepada mereka dengan sungguh-sungguh kavalerimu dan pasukanmu yang berjalan kaki. Berserikatlah dengan mereka pada harta agar diinfakkan untuk barang haram dan pada anak agar dihasilkan melalui zina, serta beranikan mereka untuk mengubur hidup-hidup anak-anak perempuan. Dan berikanlah mereka janji-janji palsu bahwa mereka tidak akan dibangkitkan dan tidak ada balasan atas hal itu, dan harapan palsu seperti pertolongan dari berhala. Tidak ada yang dijanjikan setan untuk mereka kecuali janji palsu dan menipu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Perdayakanlah} godalah {siapa saja di antara mereka yang kamu sanggup dengan ajakanmu} dengan ajakanmu untuk bermaksiat kepada Allag {Kerahkanlah terhadap mereka} serulah terhadap mereka {pasukanmu yang berkuda dan yang berjalan kaki} pasukan berkudamu dan yang berjalan untuk mengajak bermaksiat kepada Allah.{Bersekutulah dengan mereka dalam harta dan anak-anak, lalu berilah janji kepada mereka” Setan itu tidak menjanjikan kepada mereka melainkan tipuan} janji palsu yang menipu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "64. Kemudian Allah memerintahkan iblis untuk melakukan apa saja yang ia mampu untuk menyesatkan mereka, seraya berfirman, “Dan tipu dayalah siapa yang kamu sanggupi di antara mereka dengan ajakanmu.” Termasuk dalam konteks ini setiap penyeru kepada perbuatan maksiat “dan kerahkanlah terhadap mereka pasukan berkuda dan pasukanmu yang berjalan kaki.” Masuk dalam pengertian ayat ini adalah setiap pengendara dan orang yang berjalan di atas kemaksiatan kepada Allah, maka semuanya termasuk dari tentara berkuda dan pasukan pejalan kaki milik setan. Maksudnya, bahwasanya Allah berkehendak untuk menguji hamba-hambaNYa dengan musuh yang nyata ini yang mengajak mereka untuk bermaksiat dengan perkataan dan perbuatannya. “Dan berserikatlah dengan mereka pada harta dan anak-anak,” ini meliputi setiap kemaksiatan yang terkait dengan harta benda dan anak-anak mereka, berupa menentang membayar zakat, kaffarah dan hak-hak yang wajib, tidak membina dan mendidik anak untuk mengerjakan kebaikan dan meninggalkan keburukan, mengambil harta yang bukan haknya atau menggunakannya tanpa alasan yang benar atau menempuh cara-cara yang buruk. Bahkan para ahli tafsir menyebutkan bahwa termasuk juga dalam intervensi setan pada harta dan anak yaitu meninggalkan ucapan tasmiyah (bismillah) ketika makan, minum, dan jima’, dan bahwa bila dia tidak menyebut Nama Allah dalam melakukan hal itu, maka setan ikut serta di dalamnya, sebagaimana disebutkan dalam hadits “dan beri janjilah mereka,” yaitu janji-janji indah yang tidak ada realitanya. Oleh karenanya, Allah berfirman, “dan tidak ada yang dijanjikan oleh setan kepada mereka melainkan tipuan belaka,” yaitu kebatilan yang akan pupus. Seperti memperindah pandangan kepada kemaksiatan dan keyakinan-keyakinan yang buruk kepada mereka, dan menjanjikan pahala bagi mereka dengan itu, lantaran mereka menyangka berada di atas kebenaran. Allah berfirman, \"Setan menjanjikan (menakut-nakuti) kamu dengan kemiskinan dan menyuruh kamu berbuat kejahatan (kikir); sedang Allah menjanjikan untukmu ampunan daripada-Nya dan karunia. Dan Allah Maha Luas (karunia-Nya) lagi Maha Mengetahui.\" (Al-Baqarah:268)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 64: Seperti dengan nyanyian, alat musik, dan semua seruan yang mengajak kepada maksiat. Termasuk pula pasukan berkuda dan pejalan kaki dari kalangan manusia yang berjalan dalam bermaksiat kepada Allah, ia termasuk pasukan setan. Hal ini mencakup semua maksiat yang terkait dengan harta dan anak, seperti enggan membayar zakat, kaffarat dan hak-hak yang wajib, harta riba, mengambil harta tanpa haknya, dan harta hasil ghasb (rampasan). Demikian pula tidak mendidik anak di atas kebaikan; di atas ‘aqidah yang benar, ibadah yang sahih dan akhlak yang mulia. Bahkan banyak mufassir yang menggolongkan pula dalam keikutseraan setan pada harta dan anak, yaitu tidak membaca basmalah ketika makan, minum, masuk dan keluar rumah, dan berjima’; yakni jika tidak disebut nama Allah, maka setan ikut serta di dalamnya. Bahwa kebangkitan dan pembalasan itu tidak ada, atau menyampaikan janji-janji palsu yang dihias. Maksud ayat ini adalah Allah menguji manusia dengan memberi kesempatan kepada iblis untuk menyesatkan manusia dengan segala cara dan kemampuan yang ada padanya; baik dengan perkataannya maupun tindakannya. Tetapi segala tipu daya setan itu tidak akan mampu menghadapi orang-orang yang beriman sebagaimana diterangkan dalam ayat selanjutnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 64",
    "description": "Dan perdayakanlah siapa saja di antara mereka anak cucu adam yang engkau, yakni iblis sanggup melakukannya dengan suaramu yang memukau dan ajakanmu yang menggoda, dan lakukanlah dengan segala kemampuanmu, kerahkanlah pasukanmu terhadap mereka, yang berkuda dan yang berjalan kaki, dan bersekutulah dengan mereka pada harta dengan menggoda agar mereka mencari dan menginfakkan hartanya dengan jalan yang haram, dan berserikatlah dengan mereka pada anak-anak dengan berbuat zina sehingga melahirkan anak-anak sebagai hasil dari perbuatannya atau menguburkannya anak perempuan mereka hiduphidup, lalu beri janjilah kepada mereka bahwa mereka tidak akan mendapat siksaan dengan perbuatannya itu. Padahal setan itu hanya menjanjikan tipuan belaka kepada mereka. Sesungguhnya terhadap hamba-hamba-ku yang taat dan berbuat kebajikan menuruti perintah-ku, engkau wahai iblis, tidaklah dapat berkuasa atas mereka, engkau tidak dapat menyesatkan mereka walaupun engkau kerahkan segenap kemampuanmu untuk menggoda mereka. Dan cukuplah tuhanmu sebagai penjaga bagi mereka sehingga engkau tidak dapat menyesatkannya."
  }
]