[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya para hamba-hambaKu yang beriman, ikhlas, lagi taat kepadaKu, tidak ada kekuasaan bagimu atas mereka untuk menyesatkan mereka. ”Dan cukuplah tuhanmu (wahai nabi) sebagai pelindung dan penjaga bagi kaum mukminin dari makar setan dan tipu dayanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "65. \"Sesungguhnya hamba-hamba-Ku yang beriman dan mengerjakan ketaatan kepada-Ku, engkau tidak akan bisa berkuasa atas mereka wahai Iblis,\" Karena Allah senantiasa membentengi mereka dari tipu dayamu, dan cukuplah Allah sebagai penjaga bagi orang-orang yang selalu menyerahkan segala urusannya kepada-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "65. إِنَّ عِبَادِى لَيْسَ لَكَ عَلَيْهِمْ سُلْطٰنٌ ۚ (Sesungguhnya hamba-hamba-Ku, kamu tidak dapat berkuasa atas mereka) Yakni hamba-hamba-Nya yang beriman. وَكَفَىٰ بِرَبِّكَ وَكِيلًا(Dan cukuplah Tuhan-mu sebagai Penjaga) Sebagai tempat mereka bertawakkal, agar Allah melindungi mereka dari tipu daya setan dan menjaga mereka dari godaannya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Jika kita memandang bahwa syaithon telah mengalahkan kita dalam hal kekuatan dan kerajaan, maka pastikanlah bagaimana penghambaan kita kepada Allah; karena Allah telah berfirman : { إِنَّ عِبَادِي لَيْسَ لَكَ عَلَيْهِمْ سُلْطَانٌ ۚ وَكَفَىٰ بِرَبِّكَ وَكِيلًا } \"Sesungguhnya hamba-hamba-Ku, kamu tidak dapat berkuasa atas mereka. Dan cukuplah Tuhan-mu sebagai Penjaga.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "65. Wahai Iblis, tidak ada kewenangan bagimu atas hamba-hambaKu yang shalih dan ikhlas, serta tidak ada kuasa bagimu untuk membujuk mereka. Cukup Tuhanmulah yang menjaga mereka darimu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{“Sesungguhnya tidak ada kekuasaan bagimu atas hamba-hambaKu. Cukuplah Tuhanmu sebagai penjaga"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "65. Tatkala Allah mengabarkan keinginan yang hendak dilakukan setan pada para hamba, maka Allah menyebutkan sesuatu yang bisa dijadikan pegangan untuk penjagaan dari fitnah setan. Yaitu mengambakan diri kepada Allah dengan penuh keimanan dan tawakal. Allah berfirman, “Sesungguhnya hamba-hambaKu, kamu tidak dapat berkuasa atas mereka,” maksudnya, (tidak bisa) menguasai dan menyesatkan, bahkan –disebabkan penghambaan mereka kepada Alllah-, maka Allah menjaga mereka dari setiap keburukan, melindungi mereka dari setan yang terkutuk, dan mencukupi segala kebutuhan mereka “Dan cukuplah Rabbmu sebagai Penjaga,” bagi orang-orang bertawakal dan melaksanakan perintah-perintahNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 65: Yakni yang mukmin. Syaikh As Sa’diy berkata, “Setelah Allah memberitahukan apa yang ingin dilakukan setan terhadap manusia, Allah menerangkan sesuatu yang dapat menjaga diri dari fitnah(godaan)nya, yaitu beribadah kepada Allah, menegakkan keimanan dan bertawakkal.” Bagi orang yang bertawakkal dan melaksanakan perintah-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 65",
    "description": "Sesungguhnya terhadap hamba-hamba-ku yang taat dan berbuat kebajikan menuruti perintah-ku, engkau wahai iblis, tidaklah dapat berkuasa atas mereka, engkau tidak dapat menyesatkan mereka walaupun engkau kerahkan segenap kemampuanmu untuk menggoda mereka. Dan cukuplah tuhanmu sebagai penjaga bagi mereka sehingga engkau tidak dapat menyesatkannya. Setelah dijelaskan pada ayat yang lalu bahwa Allah menjadi penjaga atas hamba-Nya dari godaan iblis, pada ayat ini Allah menyebutkan sebagian dari nikmat-Nya yang dianugerahkan kepada hamba-Nya agar nikmat tersebut disyukuri. Tuhanmulah yang senantiasa memelihara dan berbuat baik kepadamu adalah dia yang melayarkan kapal-kapal di lautan untukmu, dengan menciptakan hukum-hukumnya sehingga dengan mudah kapal-kapal itu berlayar di samudra yang luas agar kamu mencari karunia-Nya, mencari kekayaan-kekayaan lautan, seperti ikan dan mutiara atau berdagang dari satu tempat ke tempat lain. Sungguh, dia Allah maha penyayang terhadapmu wahai orang-orang yang beriman."
  }
]