[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tuhan kalian (wahai sekalian manusia), Dialah yang memudahkan bagi kalian berlayarnya kapal-kapal di laut, agar kalian dapat mencari rizki Allah dalam perjalan-perjalan jauh kalian dan perniagaan kalian. Sesungguhnya Allah maha penyayang terhadap para hambaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "66. Wahai manusia! Tuhanmulah yang memudahkan berlayarnya kapal-kapal di lautan untukmu, dengan tujuan agar kalian bisa mencari rezeki dan karunia-Nya dengan usaha dagang atau lainnya, sungguh Dia Maha Penyayang terhadap kalian dengan mempermudah sarana-sarana rezeki dan karunia tersebut."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "66. Hai hamba-hamba-Ku, Tuhan kalianlah yang menjalankan kapal-kapal di lautan agar kalian dapat mencari rezeki dari Allah dengan sungguh-sungguh dalam perjalanan dan perdagangan kalian. Sungguh Allah Maha Pengasih bagi seluruh hamba-hamba-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "66. يُزْجِى لَكُمُ الْفُلْكَ فِى الْبَحْرِ (yang melayarkan kapal-kapal di lautan untukmu) Yakni menjalankan dan mengarahkan kapal-kapal. لِتَبْتَغُوا۟ مِن فَضْلِهِۦٓ ۚ( agar kamu mencari sebahagian dari karunia-Nya) Agar kalian dapat bepergian ke negeri-negeri dengan membawa barang-barang dagangan sehingga kalian mendapatkan rezeki yang Allah karuniakan kepada hamba-hamba-Nya, atau sehingga kalian mendapatkan keuntungan dari perdagangan itu. إِنَّهُۥ كَانَ بِكُمْ رَحِيمًا(Sesungguhnya Dia adalah Maha Penyayang terhadapmu) Sehingga Allah memberi kalian petunjuk bagi kebaikan kehidupan dunia kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "66. Tuhan kalian hanya Allah, Dzat yang menjalankan bahtera di atas laut untuk kalian, supaya kalian bisa mencari rejeki dari keutamaan Allah SWT dengan berdagang dan usaha. Sesungguhnya Dia Maha Penyayang bagi kalian dengan memberikan kenikmatan dan memberi petunjuk untuk memperbaiki dunia kalian"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tuhanmulah yang membuat berlayar} menjalankan dan membuat berlayar {kapal-kapal} bahtera-bahtera {di lautan untuk kalian agar kalian mencari} agar kalian mencari {karuniaNya} rezekiNya {Sesungguhnya Dia Maha Penyayang terhadap kalian"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "66. Allah menyebutkan nikmatNya kepada para hamba, bahwasanya Dia tellah menciptakan bahtera, kapal-kapal dan alat angkutan lainnya bagi mereka, dan mengilhamkan kepada mereka bagaimana cara membuatnya, menundukkan laut yang bergelombang, sehingga alat-alat angkut itu bisa memanfaatkannya untuk transportasi, pengangkutan barang-barang dan perniagaan. Ini salah satu bentuk rahmat Allah kepada para hambaNya. Allah senantiasa menyayangi dan berlemah lembut kepada mereka. Dia memberikan segala kebutuhan dan hal-hal yang bermanfaat bagi mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 66: Allah Subhaanahu wa Ta'aala mengingatkan nikmat-nikmat-Nya yang diberikan kepada hamba-hamba-Nya, berupa penundukkan-Nya untuk mereka kapal dan perahu, mengilhamkan kepada mereka cara membuatnya, penundukkan-Nya laut yang berombak besar sehingga mereka dapat berlayar di sana agar manusia memperoleh manfaat darinya seperti dapat menaikinya dan dapat mengangkutkan barang-barang mereka. Seperti dengan berdagang."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 66",
    "description": "Setelah dijelaskan pada ayat yang lalu bahwa Allah menjadi penjaga atas hamba-Nya dari godaan iblis, pada ayat ini Allah menyebutkan sebagian dari nikmat-Nya yang dianugerahkan kepada hamba-Nya agar nikmat tersebut disyukuri. Tuhanmulah yang senantiasa memelihara dan berbuat baik kepadamu adalah dia yang melayarkan kapal-kapal di lautan untukmu, dengan menciptakan hukum-hukumnya sehingga dengan mudah kapal-kapal itu berlayar di samudra yang luas agar kamu mencari karunia-Nya, mencari kekayaan-kekayaan lautan, seperti ikan dan mutiara atau berdagang dari satu tempat ke tempat lain. Sungguh, dia Allah maha penyayang terhadapmu wahai orang-orang yang beriman. Dan apabila kamu ditimpa bahaya di lautan, diterpa angin kencang atau ombak yang besar, niscaya hilang dari ingatanmu semua berhala dan tuhan-tuhan yang biasa kamu seru, kecuali dia, kamu hanya mengingat dia dan bermohon kepada-Nya agar menyelamatkan kamu dari bahaya yang menimpa. Tetapi ketika dia, Allah, telah menyelamatkan kamu sehingga kamu dapat kembali dengan selamat ke daratan, kamu berpaling dari-Nya, tidak lagi mengesakan-Nya dan tidak lagi bergantung kepada-Nya, karena kamu merasa telah bebas dari bahaya. Dan manusia memang selalu ingkar, tidak mensyukuri nikmat yang dianugerahkan Allah kepada-Nya, kecuali orang-orang yang taat dan mendapat petunjuk-Nya."
  }
]