[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apabila kesulitan menimpa kalian di lautan hingga kalian hampir-hampir terancam tenggelam dan binasa, maka hilanglah dari benak-benak kalian tuhan-tuhan yang kalian sembah, dan kalian hanya mengingat Allah semata Dzat yang mahakuasa agar memberi pertolongan dan menyelamtakan kalian. Lalu kemudian kalian ikhlaskan kepadaNya dalam meminta petolongan, kemudia Dia membantu dan menyelamatkan kalian. Namun setelah Dia menyelamatkan kalian ke daratan, kalian berpaling dari beriman, ikhlas dan beramal shalih. Ini termasuk bentuk kebodohan manusia dan kekafirannya. Dan manusia itu banyak mengingkari nikmat-nikmat Allah ."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "67. Dan apabila kalian ditimpa suatu bahaya atau bencana di lautan -wahai orang-orang musyrik- sehingga kalian khawatir akan binasa, niscaya semua yang kalian sembah selain Allah akan hilang dari benak kalian, dan tidak akan teringat kecuali hanya Allah, lalu kepada-Nya lah kalian memohon pertolongan, namun tatkala Dia menolong dan menyelamatkan kalian, setelah kalian berada di daratan kalian malah berpaling dari keyakinan mengesakan-Nya dan dari menghaturkan doa hanya kepada-Nya, serta kembali mengagungkan patung-patung kalian. Sungguh, manusia memang sangat mengingkari nikmat Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "67. Bagian dari rahmat-Nya yang menunjukkan keesaan-Nya adalah jika mereka tertimpa suatu bahaya di lautan, tuhan-tuhan mereka yang dahulu mereka sembah selain Allah tidak akan terlintas dalam pikiran mereka, namun mereka akan meminta pertolongan kepada Allah. Dan saat Allah telah menyelamatkan mereka dari tenggelam, mereka kembali berpaling dari keimanan kepada-Nya. ini merupakan pengingkaran terhadap kenikmatan-kenikmatan yang telah Dia berikan kepada mereka; sungguh manusia sangat ingkar terhadap kenikmatan-kenikmatan Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "67. وَإِذَا مَسَّكُمُ الضُّرُّ فِى الْبَحْرِ (Dan apabila kamu ditimpa bahaya di lautan) Yakni ketakutan akan tenggelam. ضَلَّ مَن تَدْعُونَ(niscaya hilanglah siapa yang kamu seru) Yakni tuhan-tuhan kalian, mereka akan hilang dari pikiran kalian; dan apa yang kalian sembah selain Allah itu juga tidak dapat menolong kalian, baik itu patung, malaikat, jin, atau manusia. إِلَّآ إِيَّاهُ ۖ( kecuali Dia) Padahal mereka semuanya telah mengetahuinya secara fitrah bahwa sesembahan mereka tidak dapat menolong mereka dan tidak dapat memberi mereka manfaat pada keadaan itu. فَلَمَّا نَجَّىٰكُمْ إِلَى الْبَرِّ أَعْرَضْتُمْ ۚ( Maka tatkala Dia menyelamatkan kamu ke daratan, kamu berpaling) Yakni berpaling dari keikhlasan kepada Allah dan kembali menyembah dan memohon pertolongan kepada berhala-berhala mereka. وَكَانَ الْإِنسٰنُ كَفُورًا(Dan manusia itu adalah selalu tidak berterima kasih) Yakni banyak sekali keingkarannya terhadap kenikmatan-kenikmatan Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "67. Atau jika kalian menghadapi penderitaan atau takut tenggelam di laut, maka hilang dan lenyaplah dari pikiran kalian benda/orang yang kalian sembah sebagai tuhan (selain Allah), sehingga kalian tidak menyeru kepadanya, melainkan hanya kepada Allah, karena kalian mengetahui bahwa ketika kalian berada dalam penderitaan itu, tidak ada yang menyingkapnya kecuali Allah. Berhala-berhala dan benda lainnya itu tidak berguna bagi kalian. Dan ketika Dia (Allah) telah menyelamatkan kalian dari tenggelam dan kalian sampai di daratan, kalian tidak mau beriman dan mengesakan Allah, serta kembali menyeru (menyembah) terhadap berhala-berhala kalian. Dan manusia yang kafir itu tidak berterima kasih atas nikmat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apabila kalian ditimpa bahaya di lautan, niscaya hilang} hilang {semua yang kalian seru} yang kalian sembah {kecuali Dia. Lalu ketika Dia menyelamatkan kalian ke daratan, kalian berpaling. Manusia memang selalu ingkar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "67. Dan di antara rahmatNya yang menunjukkan bahwa Dia-lah satu-satunya Dzat yang layak disembah, bukan obyek yang lain, adalah tatkala mereka tertimpa bahaya di lautan, kemudian mereka takut akan binasa karena gulungan ombak, niscaya hilanglah dari benak mereka, segala sesuatu yang mereka sembah selain Allah di waktu lapang, baik sesembahan itu hidup atau mati. Seolah-olah mereka tidak pernah menyeru sesembahan itu sama sekali. Hal ini disebabkan mereka mengetahui bahwasanya sesembahan itu tak berdaya untuk menghilangkan bahaya (yang sedang dihadapi). Mereka pun berteriak menyeru sang Pencipta langit dan bumi, Dzat yang dimintai perlindungan oleh semua makhluk dalam masalah-masalah mereka yang genting. Pada waktu seperti ini mereka mengikhlaskan doa dan ketundukan kepada Allah semata. Akan tetapi, ketika Allah telah menghilangkan bahaya dan menyelamatkan mereka hingga sampai ke daratan, maka mereka lupa kepada Dzat tempat mereka berdoa sebelumnya. Mereka menyekutukan denganNya suatu obyek yang tidak mampu memberi dan tidak pula mampu mencegah pemberian. Mereka pun berpaling dari keikhlasan untuk Rabb dan Penguasa mereka. Ini disebabkan kebodohan manusia dan kekufurannya. Karena sesungguhnya manusia itu sering mengkufuri nikmat-nikmat yang diberikan. Kecuali orang-orang yang diberi hidayah, maka Allah memberikan nikmat kepada mereka dengan akal yang sehat dan mengambil petunjuk menuju jalan yang lurus. Ia mengetahui bahwasanya Dzat yang telah menghilangkan kesulitan-kesulitan dan menyelamatkannya dari kengerian-kengerian, Dia-lah yang berhak untuk ditunggalkan dan diikhlaskan kepadaNya seluruh amalan, baik dalam keadaan lapang atau sempit, susah ataupun senang. Adapun orang yang ditelantarkan tanpa bimbingan (dari Allah) dan diserahkan kepada penanganan akalnya yang lemah, maka tidak menghiraukan pada waktu kesulitan kecuali hanya kemaslahatan sesaat dan keselamatannya di waktu itu. Ketika dia telah mendapatkan keselamatan dan kesulitan telah menjauhinya, niscaya dia menduga dengan akalnya yang bodoh bahwa dia telah melemahkan Allah. Di dalam hatinya tidak terbetik akibat jelek yang bersifat duniawi, apalagi perkara akhirat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 67: Termasuk rahmat-Nya yang menunjukkan bahwa Dia yang satu-satunya berhak disembah adalah ketika mereka tertimpa bahaya di lautan, lalu mereka takut akan binasa karena ombak yang begitu besar, ketika itu hilanglah di pikiran mereka sesembahan-sesembahan yang mereka sembah selain Allah Subhaanahu wa Ta'aala di waktu aman sentosa, seakan-akan mereka tidak pernah berdoa kepada sesembahan-sesembahan itu karena mereka mengetahui bahwa sesembahan tersebut adalah lemah dan tidak mampu menghilangkan bahaya. Ketika itu, mereka berdoa dengan mengeraskan suara kepada Pencipta langit dan bumi yang diminta oleh semua makhluk ketika kondisi sulit. Saat itu, mereka memurnikan doa kepada-Nya serta merendahkan diri. Namun ketika Allah telah menghilangkan bahaya dari mereka dan menyelamatkan mereka ke daratan, mereka lupa kepada yang menyelamatkan mereka, yaitu Allah, bahkan menyekutukan-Nya dengan sesuatu yang tidak mampu mendatangkan manfaat dan menolak bahaya, tidak kuasa memberi dan tidak kuasa menahan. Hal ini termasuk kebodohan manusia dan kekufurannya, karena manusia sangat sering kufur kepada nikmat Allah selain orang yang diberi-Nya hidayah dan dikaruniakan oleh-Nya akal yang sehat, di mana ia mengetahui bahwa yang menghilangkan bahaya dan menyelamatkannya itulah yang berhak diibadahi, baik di waktu sulit maupun di waktu lapang. Akan tetapi, orang yang ditelantarkan oleh Allah dan diserahkan dirinya kepada akalnya yang lemah, maka ia tidak melihat sewaktu susahnya selain maslahat untuk saat itu dan diselamatkan pada saat itu. Ketika ia selamat dan kesulitan hilang, maka ia mengira karena kebodohannya bahwa dia telah melemahkan Allah Subhaanahu wa Ta'aala, dan tidak terlintas di hatinya akibat dari sikapnya itu di dunia, apalagi di akhirat. Oleh karena itu, pada ayat selanjutnya Allah Subhaanahu wa Ta'aala berfirman, “Maka apakah kamu merasa aman bahwa Dia tidak akan membenamkan sebagian daratan bersama kamu atau Dia meniupkan (angin keras yang membawa) batu-batu kecil?”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 67",
    "description": "Dan apabila kamu ditimpa bahaya di lautan, diterpa angin kencang atau ombak yang besar, niscaya hilang dari ingatanmu semua berhala dan tuhan-tuhan yang biasa kamu seru, kecuali dia, kamu hanya mengingat dia dan bermohon kepada-Nya agar menyelamatkan kamu dari bahaya yang menimpa. Tetapi ketika dia, Allah, telah menyelamatkan kamu sehingga kamu dapat kembali dengan selamat ke daratan, kamu berpaling dari-Nya, tidak lagi mengesakan-Nya dan tidak lagi bergantung kepada-Nya, karena kamu merasa telah bebas dari bahaya. Dan manusia memang selalu ingkar, tidak mensyukuri nikmat yang dianugerahkan Allah kepada-Nya, kecuali orang-orang yang taat dan mendapat petunjuk-Nya. Maka apakah kamu benar-benar telah merasa aman bahwa dia tidak akan membenamkan sebagian daratan bersama kamu, sebelum kamu tiba dengan selamat ke pantai, atau dia meniupkan angin keras yang membawa batu-batu kecil' dan kamu tidak akan mendapat seorang pelindung pun, yang dapat melindungi kamu dari bahaya yang menimpamu."
  }
]