[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah kalian (wahai sekalian manusia) lalai dari siksaan Allah, sehingga kalian merasa aman ditenggelamkan dari permukaan bumi atau Allah menurunkan hujan batu pada kalian dari langit, sehingga menghabisi kalian kemudian kalian tidak mendapatkan seseorangpun yang sanggup melindungi kalian dari siksaanNya?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "68. Maka apakah kalian -wahai orang-orang musyrik- merasa aman ketika Allah menyelamatkan kalian ke daratan bahwa Dia tidak membenamkan daratan tersebut bersama kalian? Atau apakah kalian merasa aman bahwa Dia tidak menurunkan bebatuan dari langit untuk menimpa kalian seperti yang Dia lakukan terhadap kaum Lūṭ? Dan kalian sama sekali tidak akan mendapatkan seorang penjaga dan pelindung pun yang bisa menjaga kalian dari azab dan kebinasaan tersebut."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "68-69. Allah mengingkari dan mengolok perbuatan orang-orang kafir yang kembali kepada kekafiran: “Setelah kalian selamat dari lautan, apakah kemudian kalian akan aman dari tenggelam ke dalam tanah atau dihujani batu dari langit sehingga kalian dapat terbunuh, dan kalian tidak memiliki seorangpun yang dapat menolong kalian dari siksaan itu? Atau apakah kalian merasa aman jika kembali ke lautan, kemudian Allah mengirim kepada kalian angin kencang yang membinasakan, sehingga kalian tenggelam akibat kekafiran kalian, dan kalian tidak menemukan seorangpun yang dapat membalas dendam kalian terhadap Kami?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "68. أَفَأَمِنتُمْ أَن يَخْسِفَ بِكُمْ جَانِبَ الْبَرِّ(Maka apakah kamu merasa aman (dari hukuman Tuhan) yang menjungkir balikkan sebagian daratan bersama kamu) Makna (الخسف) yakni runtuhnya tanah bersama apa yang ada diatasnya. Allah memperingatkan mereka dari musibah di daratan setelah mereka merasa aman dari musibah di lautan. أَوْ يُرْسِلَ عَلَيْكُمْ حَاصِبًا(atau Dia meniupkan (angin keras yang membawa) batu-batu kecil?) Yakni angin kencang yang membawa bebatuan kecil. ثُمَّ لَا تَجِدُوا۟ لَكُمْ وَكِيلًا(dan kamu tidak akan mendapat seorang pelindungpun bagi kamu) Yakni penjaga dan penolong untuk melindungi kalian dari azab Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "68. Apakah kalian merasa ditolong dari tenggelam dan merasa aman yang menjungkirkan tanah di daratan, yaitu tanah yang rata di bawah kalian, ataukah Dia mengutus untuk kalian angin kencang yang menghancurkan dan mengandung kerikil yang melemparkan batu, yaitu batu-batu kecil, kemudian kalian tidak mendapati penolong dan penyelamat yang melindungi kalian dari azab."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah kalian merasa aman (dari hukumanNya) yang membenamkan sebagian daratan bersama kalian} sebagian bumi {atau mengirimkan kepada kalian kerikil} bebatuan dari langit {lalu kalian tidak akan mendapati seorang pun sebagai pelindung} penjaga dan penolong yang menjaga kalian dari azab Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "68-69. Oleh karenanya, Allah mengingatkan mereka dengan FirmanNya, \"Maka apakah kamu merasa aman (dari hukuman Allah) yang menjungkirbalikkan sebagian daratan bersama kamu atau Dia meniupkan (angin keras yang membawa) batu-batu kecil?” maksudnya Dia Mahakuasa atas segala sesuatu, apabila Dia menghendaki, niscaya akan menurunkan azab kepadamu dari arah bawah dengan mengjungkirbalikkan kalian, atau dari atas, dengan meniupkan angin keras yang menerbangkan kerikil. Itu adalah azab yang mengenai mereka secara merata dengan batu-batu kerikil sehingga mereka menjadi orang-orang yang binasa. Maka janganlah kamu menyangka bahwa kebinasaan hanya terjadi di lautan belaka. Apabila kamu berpandangan demikian, maka apakah kamu merasa aman dari “dikembalikanNya kamu,” ke lautan “sekali lagi lalu Dia meniupkan atas kamu angin taupan,” yaitu angin kencang yang menghancurkan segala sesuatu yang mendatanginya, “dan di tenggelamkanNya kamu disebabkan kekafiranmu. Kemudian kamu tidak akan mendapat seorang penolong pun dalam hal ini terhadap (siksaan) Kami,” yaitu tempat meminta pertolongan. Sesungguhnya Allah tidak akan menzhalimi kalian meskipun seberat biji sawi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 68: Seperti halnya yang menimpa Qarun. Seperti yang menimpa kaum Luth. Oleh karena itu, janganlah kamu mengira bahwa azab Allah hanya terjadi di lautan saja. Allah Subhaanahu wa Ta'aala berfirman, “Katakanlah: \" Dialah yang berkuasa untuk mengirimkan azab kepadamu, dari atas kamu atau dari bawah kakimu atau Dia mencampurkan kamu dalam golongan-golongan (yang saling bertentangan) dan merasakan kepada sebagian kamu keganasan sebagian yang lain…dst\". (Terj. Al An’aam: 65)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 68",
    "description": "Maka apakah kamu benar-benar telah merasa aman bahwa dia tidak akan membenamkan sebagian daratan bersama kamu, sebelum kamu tiba dengan selamat ke pantai, atau dia meniupkan angin keras yang membawa batu-batu kecil' dan kamu tidak akan mendapat seorang pelindung pun, yang dapat melindungi kamu dari bahaya yang menimpamu. Ataukah kamu merasa aman bahwa dia suatu waktu dengan kehendak dan kekuasaan-Nya akan mengembalikan kamu ke laut sekali lagi, lalu setelah kamu berada di tengah lautan, dia tiupkan angin topan kepada kamu dan ditenggelamkan-Nya kamu di tengah lautan atau di tempat kamu diselamatkan dahulu disebabkan kekafiranmu' kemudian walaupun kamu berusaha dengan mengerahkan segenap kemampuanmu, kamu tidak akan mendapatkan seorang penuntut pun yang dapat menuntut balas atau menolong kamu dalam menghadapi siksaan kami."
  }
]