[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ataukah apakah kalian (wahai sekalian manusia), merasa aman terhadap tuhan kalian, sedang kalian telah ingkar kepadaNya, dari mengembalikan kalian ke laut sekali lagi, lalu Dia mengirim angin kencang yang meluluhkan segala yang ia lewati. Lalu Dia menenggelamkan kalian gara-gara kekafiran kalian, kemudian kalianpun tidak mendapati pertanggung jawaban dan tuntutan terhadap kami; karena sesungguhnya Allah tidak pernah menzhalimi kalian sebesar biji dzarrah sekalipun?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "69. Atau apakah kalian merasa aman bahwa Allah tidak akan mengembalikan ke lautan sekali lagi, lalu Dia mengirimkan angin topan kepada kalian, lalu Dia menenggelamkan kalian lantaran kafirnya kalian terhadap nikmat Allah tatkala menyelamatkan kalian pertama kali? Kemudian kalian tidak akan mendapatkan seorang penolongpun yang bisa menuntut apa yang Kami lakukan atas kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "69. أَمْ أَمِنتُمْ أَن يُعِيدَكُمْ فِيهِ تَارَةً أُخْرَىٰ (atau apakah kamu merasa aman dari dikembalikan-Nya kamu ke laut sekali lagi) Yakni karena menguatnya kebutuhan kalian untuk kembali melaut. فَيُرْسِلَ عَلَيْكُمْ قَاصِفًا مِّنَ الرِّيحِ(lalu Dia meniupkan atas kamu angin taupan) Makna (القاصف) yakni angin kencang yang memiliki suara kencang. فَيُغْرِقَكُم بِمَا كَفَرْتُمْ ۙ( dan ditenggelamkan-Nya kamu disebabkan kekafiranmu) Yakni akibat kekafiran kalian. ثُمَّ لَا تَجِدُوا۟ لَكُمْ عَلَيْنَا بِهِۦ تَبِيعًا(Dan kamu tidak akan mendapat seorang penolongpun dalam hal ini terhadap (siksaan) Kami) Yakni pembela yang menuntut Kami atas apa yang Kami lakukan terhadap kalian, sehingga ia dapat membalas dendam kepada Kami untuk kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "69. Ataukah kalian lebih merasa aman jika Dia mengembalikan kalian di laut lagi untuk tujuan ditenggelamkan atau diterbangkan, lalu Allah mengutus untuk kalian angin kencang yang memporak-porandakan bahtera, yaitu merusak dan menghancurkannya, lalu menenggelamkan kalian akibat kekufuran kalian, sedangkan kalian tidak mendapati penolong bagi kalian atas pembalasan yang kami berikan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Ataukah kalian merasa aman dari (hukumanNya) yang akan mengembalikan kalian ke laut} ke laut {sekali lagi} sekali lagi {lalu mengirimkan kepada kalian angin topan} angin yang sangat lebat {dan menenggelamkan kalian karena kekufuran kalian, kemudian kalian tidak akan mendapati seorang penolong dalam hal ini terhadap Kami} seorang dimintai tolong untuk menghadapi Kami"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "68-69. Oleh karenanya, Allah mengingatkan mereka dengan FirmanNya, \"Maka apakah kamu merasa aman (dari hukuman Allah) yang menjungkirbalikkan sebagian daratan bersama kamu atau Dia meniupkan (angin keras yang membawa) batu-batu kecil?” maksudnya Dia Mahakuasa atas segala sesuatu, apabila Dia menghendaki, niscaya akan menurunkan azab kepadamu dari arah bawah dengan mengjungkirbalikkan kalian, atau dari atas, dengan meniupkan angin keras yang menerbangkan kerikil. Itu adalah azab yang mengenai mereka secara merata dengan batu-batu kerikil sehingga mereka menjadi orang-orang yang binasa. Maka janganlah kamu menyangka bahwa kebinasaan hanya terjadi di lautan belaka. Apabila kamu berpandangan demikian, maka apakah kamu merasa aman dari “dikembalikanNya kamu,” ke lautan “sekali lagi lalu Dia meniupkan atas kamu angin taupan,” yaitu angin kencang yang menghancurkan segala sesuatu yang mendatanginya, “dan di tenggelamkanNya kamu disebabkan kekafiranmu. Kemudian kamu tidak akan mendapat seorang penolong pun dalam hal ini terhadap (siksaan) Kami,” yaitu tempat meminta pertolongan. Sesungguhnya Allah tidak akan menzhalimi kalian meskipun seberat biji sawi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 69: Dengan berlayar di lautan. Bahkan hal itu mungkin."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 69",
    "description": "Ataukah kamu merasa aman bahwa dia suatu waktu dengan kehendak dan kekuasaan-Nya akan mengembalikan kamu ke laut sekali lagi, lalu setelah kamu berada di tengah lautan, dia tiupkan angin topan kepada kamu dan ditenggelamkan-Nya kamu di tengah lautan atau di tempat kamu diselamatkan dahulu disebabkan kekafiranmu' kemudian walaupun kamu berusaha dengan mengerahkan segenap kemampuanmu, kamu tidak akan mendapatkan seorang penuntut pun yang dapat menuntut balas atau menolong kamu dalam menghadapi siksaan kami. Dan sungguh, kami telah memuliakan anak cucu adam, yaitu golongan manusia pada umumnya dengan tubuh yang bagus, kemampuan berpikir, kebebasan berkehendak, dan ilmu pengetahuan, dan kami angkut mereka di darat dengan kendaraan seperti onta atau lainnya, dan di laut, dengan kapal, dan kami beri mereka rezeki dari yang baik-baik, berupa minuman dan makanan yang lezat rasanya, dan kami lebihkan keutamaan mereka di atas banyak makhluk yang kami ciptakan dengan kelebihan yang sempurna."
  }
]