[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Jika kalian baik dalam perbuatan-perbuatan dan uacapan-ucapan kalian, Sesungguhnya kalian berarti telah berbuat baik terhadap diri kalian sendiri. Sebab pahalanya kembali kepada kalian. Bila kalain bertindak buruk, maka hukumannya(juga) berbalik mengenai kalian sendiri. Jika nanti telah tiba ketetapan terjadinya kerusakan kedua (yang kalian perbuat), maka Kami akan menjadikan musuh kalian berkuasa atas kalain kembali, untuk menghinakan dan mengalahkan kalian, sehingga tampaklah bekas-bekas penghinaan dan penistaan pada wajah-wajah kalian dan lalu merangsek masuk menghadapi kalain ke dalam baitul maqdis untuk menghancurkannya sebagaimana mereka dahulu pernah menghancurkannya, dan kemudian meluluhlantahkan semua yang mereka miliki sehabis-habisnya secara total."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Wahai Bani Israil! Seandainya kalian memperbaiki amalan kalian, dan mengerjakannya sesuai tata cara yang diperintahkan, niscaya ganjaran amalan tersebut pasti kembali pada diri kalian, sebab Allah tidak membutuhkan amalan-amalan tersebut. Sebaliknya, andai kalian berbuat keburukan maka balasannya juga akan kembali kepada kalian, sebab kebaikan amalan kalian sama sekali tidaklah memberikan manfaat kepada Allah, dan keburukan kalian tidak pula mendatangkan kerugian bagi-Nya. Apabila masa kerusakan yang kedua telah tiba, Kami akan memberikan kekuasaan pada musuh-musuh kalian agar merendahkan, menginjak-injak harga diri dan menyuramkan wajah kalian dengan menimpakan atas kalian ragam penghinaan dan siksa. Mereka juga pasti akan memasuki Baitul Maqdis lalu menghancurkannya sebagaimana yang mereka lakukan pada penguasaan mereka yang pertama, lalu menghancurkan semua negeri yang mereka kuasai secara menyeluruh."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "7. Jika kalian baik dalam perkataan dan perbuatan kalian, maka pahalanya akan kembali bagi diri kalian di dunia dan di akhirat; namun jika kalian melakukan keburukan dengan berbuat kekafiran dan kemaksiatan, maka siksaannya juga akan kembali pada diri kalian. Dan jika kerusakan kedua telah kalian perbuat, maka Kami akan menjadikan kalian kembali dikuasai para musuh agar mereka menghinakan dan menindas kalian, dan agar mereka dapat memasuki Baitul Maqdis untuk menghancurkannya kembali sebagaimana yang terjadi ketika kalian melakukan kerusakan yang pertama; musuh-musuh itu akan menghancurkan dan membinasakan segala yang dapat mereka kuasai, seperti yang terjadi ketika datang serangan Bukhtanasshar, raja negeri Babil yang terletak sekitar 100 km selatan Baghdad."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. إِنْ أَحْسَنتُمْ (Jika kamu berbuat baik) Yakni jika perkataan dan perbuatan kalian sesuai dengan yang diperintahkan kepada kalian. أَحْسَنتُمْ لِأَنفُسِكُمْ ۖ (kamu berbuat baik bagi dirimu sendiri) Sebab balasan dari hal tersebut akan kembali kepada kalian. وَإِنْ أَسَأْتُمْ (dan jika kamu berbuat jahat) Dalam perkataan dan perbuatan kalian. فَلَهَا ۚ (maka (kejahatan) itu bagi dirimu sendiri) Yakni berarti kalian telah bebuat jahat pada diri kalian sendiri. فَإِذَا جَآءَ وَعْدُ الْاٰخِرَةِ (dan apabila datang saat hukuman bagi (kejahatan) yang kedua) Yakni jika telah datang waktu dari hukuman kedua yang dijanjikan kepada mereka. لِيَسُۥٓـُٔوا۟ وُجُوهَكُمْ (untuk menyuramkan muka-muka kamu) Yakni Kami akan menguatkan musuh kalian agar mereka dapat berbuat sesuatu yang menghinakan kalian sehingga pada wajah kalian akan nampak tanda kekalahan, kehinaan, dan ‘aib setelah kalian dulunya menyombongkan diri dan angkuh. وَلِيَدْخُلُوا۟ الْمَسْجِدَ كَمَا دَخَلُوهُ أَوَّلَ مَرَّةٍ وَلِيُتَبِّرُوا۟ (dan mereka masuk ke dalam mesjid, sebagaimana musuh-musuhmu memasukinya pada kali pertama dan untuk membinasakan) Yakni untuk menghancurkan dan membinasakan. مَا عَلَوْا۟ (apa saja yang mereka kuasai) Yakni apa yang mereka kuasai dari negeri kalian. Atau semasa mereka berkuasa. تَتْبِيرًا(sehabis-habisnya) Yakni sehancur-hancurnya. Sebagian ulama berpendapat bahwa kemungkinan terjadinya kejahatan mereka kali kedua adalah apa yang terjadi pada saat ini. Dan kebinasaan datang dari senjata-senjata perang yang datang dari arah atas seperti pesawat-pesawat jet, roket-roket dan lain sebagainya. Waallahu a’lam."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Jika kalian memperbaiki perbuatan dan perkataan kalian dengan menaati Tuhan kalian maka kalian telah berbuat baik pada diri kalian, karena imbalan atas hal itu adalah bagi kalian sendiri. Dan jika kalian berbuat kerusakan dan kemaksiatan maka atas kalian itu musibah yang buruk. Dan apabila telah datang saat lain (hukuman lain) atas kerusakan kedua di bumi, Kami akan mengutus mereka (kaum dari Babilonia) agar mereka memberi dampak buruk, hina dan menyedihkan bagi kalian, yaitu agar mereka memberi kalian kehinaan, penderitaan dan keburukan, lalu mereka masuk ke dalam Baitul Maqdis dan menghancurkannya, sebagaimana mereka masuk ke dalamnya pertama kali, kemudian mereka merobohkan dan memberi kehancuran yang dahsyat terhadap sesuatu yang mendominasi mereka, yaitu negeri kalian."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Jika kalian berbuat baik, maka kalian telah berbuat baik untuk diri kalian sendiri. Jika kalian berbuat jahat, maka itu untuk diri kalian} menimpa kalian {Apabila datang waktu yang kedua} waktu kerusakan dan kesombongan yang kedua {untuk menyuramkan} untuk menghinakan dan merendahkan {wajah kalian untuk memasuki masjid} Baitul maqdis {sebagaimana memasukinya ketika pertama kali, dan untuk membinasakan} menghancurkan {apa yang mereka kuasai} apa yang mereka kuasai yaitu negeri-negeri kalian {dengan kehancuran yang sempurna} dengan kehancuran yang sempurna"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7. “Jika kamu berbuat baik, (berarti) kamu berbuat baik bagi dirimu sendiri,” karena manfaat dari perbuatan baik kalian kembali kepada kalian sendiri (bukan kepada orang lain), bahkan saat kalian masih berada di dunia, seperti yang telah kalian saksikan, berupa kemenangan kalian terhadap musuh-musuh kalian “dan jika kamu berbuat jahat, maka (kejahatan) itu bagi dirimu sendiri,” kepada diri kalian sendirilah bahaya itu berbalik arah, sebagaimana yang telah Allah perlihatkan kepada kalian berupa penguasaan musuh atas kalian “dan apabila datang saat hukuman bagi (kejahatan) yang kedua,” yaitu kejadian berikutnya yang kalian berbuat kembali kerusakan di muka bumi pada waktu tersebut, maka Allah akan memberikan kekuasaan musuh-musuh atas kalian juga. “(Kami datangkan orang-orang lain) untuk menyuramkan muka-muka kamu,” melalui kemenangan mereka atas kalian dan keberhasilan menawan kalian. “Supaya mereka masuk ke dalam Masjidil Haram sebagaimana mereka dahulu pernah masuk untuk yang pertama kalinya,” masjid yang dimaksudkan dalam ayat ini adalah masjid Baitul Maqdis “dan untuk membinasakan,” meruntuhkan dan menghancurkan “apa saja yang mereka kuasai,” atas kekuasaan yang mereka pegangi “sehabis-habisnya,” maka mereka akan menghancurkan rumah-rumah, masjid-masjid serta lading-ladang kalian."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata (إِنۡ أَحۡسَنتُمۡ) in ahsantum : jika kalian taat kepada Allah dan Rasul-Nya dengan ikhlas dan menjalankannya sesuai dengan yang telah disyariatkan. (أَحۡسَنتُمۡ لِأَنفُسِكُمۡۖ) ahsantum li`anfusikum : pahala dan balasan yang baik kelak akan kembali kepada kalian sendiri tidak kepada yang lain. (وَإِنۡ أَسَأۡتُمۡ) wa in asa`tum : jika kalian buruk dalam ketaatan, maka hukuman akan keburukan yang kalian lakukan akan kembali kepada diri kalian. (لِيَسُ‍ُٔواْ وُجُوهَكُمۡ) liyasuu`uu wujuuhakum : agar mereka menjelekkan wajah mereka dengan bencana dan kelamnya kesedihan, dan mereka dalam keadaan hina. (وَلِيَدۡخُلُواْ ٱلۡمَسۡجِدَ) wa liyadkhulul masjid : yaitu Baitul Maqdis. (وَلِيُتَبِّرُواْ مَا عَلَوۡاْ تَتۡبِيرًا) wa liyutabbiruu maa ‘alau tatbiiraa : agar mereka menghancurkan sehancur-hancurnya apa yang telah mereka kuasai berupa negeri Bani Israil. Makna ayat: Konteks ayat masih berkisah tentang Bani Israil. Setelah Allah ta’ala mengabarkan apa yang telah diputuskan dalam kitab mereka, bahwa mereka akan berbuat kerusakan di bumi sebanyak dua kali dan berbuat kesombongan yang besar. Tatkala datang waktu pertama, Allah mengutus kepada mereka orang-orang yang kuat dan bengis, merekalah Jalut dan tentaranya, lalu mereka membunuh dan merampas Bani Israil. Kemudian Allah ta’ala memberikan kesempatan kepada mereka untuk membalas, lantas mereka menang dan Daud berhasil membunuh Jalut, muncullah sebuah negara yang besar yang memiliki pasukan perang terbanyak dan daerah kekuasaan terluas, karena mereka kembali kepada Allah dan mengamalkan kitab-Nya dan berpegang teguh kepada syariat-Nya, di sinilah Allah ta’ala berfirman “Jika kamu berbuat baik, maka itu untuk dirimu sendiri...” jika kalian berbuat baik dengan mengikuti kebenaran dan berpegang teguh taat kepada Allah dan rasul-Nya dengan melaksanakan kewajiban, menjauhi larangan, serta berpegang teguh dengan ajaran Allah ta’ala untuk memperbaiki manusia. Namun, jika kalian berbuat buruk; meninggalkan syari’at, tenggelam dalam kelezatan dan syahwat, maka hasilnya akan kembali kepada diri kalian sendiri sesuai dengan ketentuan Allah ta’ala “Barang siapa mengerjakan kejahatan, niscaya akan dibalas sesuai dengan kejahatan itu, dan dia tidak akan mendapatkan pelindung dan penolong selain Allah.” [Qs. An-Nisa`: 123] Firman-Nya ta’ala “Apabila datang janji yang terakhir...” yaitu waktu yang ditentukan; yang kedua setelah pertama, Allah kembali mengutus kepada mereka hamba-hamba-Nya; Nebukadnezar (Bikhatunshar) dan bala tentaranya, Allah mengutus mereka untuk menjadikan wajah Bani Israil hitam karena apa yang mereka rasakan berupa kesedihan dan kehinaan “agar mereka memasuki masjid...” yaitu Baitul Maqdis, sebagaimana mereka memasukinya pertama kali “sehingga mereka menghancurkan...” memusnahkan “apa yang mereka kuasai...” yang mereka dapatkan dari rumah-rumah Bani Israil “sehancur-hancurnya.” Menghancurkannya secara total. Hal ini terjadi tatkala mereka membunuh Zakaria, Yahya ‘alaihimas salam, dan banyak ulama, serta setelah muncul kefasikan di kalangan mereka, para wanita yang berhias, berbuat keji, dan memakai hak tinggi, sebagaimana yang Rasulullah shallallahu ‘alaihi wa sallam. Pelajaran dari ayat: • Kebenaran janji Allah ta’ala. • Penegasan kenabian Nabi shallallahu ‘alaihi wa sallam, karena kabar seperti ini tidak akan bisa diceritakan kecuali oleh nabi yang mendapat wahyu. • Penegasan kaidah: barang siapa yang beramal saleh, itu untuk dirinya, begitu pula dengan keburukan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 7: Karena manfaatnya kembali kepada kamu, bahkan ketika di dunia, saat kamu berbuat ihsan kamu dapat mengalahkan musuhmu. Sebagaimana Allah Subhaanahu wa Ta'aala telah memberikan kekuasaan kepada musuhmu terhadap kamu ketika kamu melakukan berbagai kemaksiatan. Yakni membuatmu sedih dengan kesedihan yang nampak di wajahmu karena adanya pembunuhan dan penawanan. Sebagaimana sebelumnya. Mereka membinasakan rumah-rumahmu, masjid-masjid, dan ladang tempat kamu bercocok tanam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 7",
    "description": "Jika kamu berbuat baik dengan menaati perintah Allah dan rasul-Nya serta melakukan kebijakan kepada sesamanya, berarti kamu berbuat baik untuk dirimu sendiri, karena balasan yang kamu peroleh dari kebaikan itu. Dan jika kamu berbuat jahat, makakerugian kejahatanitujugauntuk dirimu sendiri, karena akibat dari kejahatan akan menimpamu. Selanjutnya dinyatakan kejahatan yang kedua yang diperbuat oleh kaum bani israil dan azab Allah yang ditimpakan atas mereka dinyatakan dalam firmannya, dan apabila datang saat hukuman kejahatan yang kedua, yang telah kami tetapkan di dalam kitab itu, kami datangkan orang-orang lain untuk menyiksamu sehingga menyuramkan wajah-wajahmu, akibat kesedihan dan penderitaan yang kamu alami, dan mereka, yakni musuhmusuhmu masuk ke dalam masjid, yakni masjidil aqsa, guna menyiksa dan membunuhmu sebagaimana mereka memasukinya pada kali pertama guna menyiksa dan membunuhmu akibat kejahatan kamu yang pertama, dan mereka memasukinya dengan tujuan untuk membinasakan sehabis-habisnya apa saja yang mereka kuasai. Allah yang maha pengasih tidak menutup rahmat-Nya kepada siapa yang mau bertobat dari kejahatan dan kembali kepada jalan yang benar. Allah menyatakan, mudah-Mudahan tuhanmu akan melimpahkan rahmat kepadamu, setelah kali yang kedua kejahatan yang kamu lakukan, dan kamu sungguh-sungguh bertobat kepada Allah, tetapi jika kamu kembali kepada kedurhakaan dengan melakukan kejahatan lagi, niscaya kami kembali mengazabmu di dunia dan kelak di akhirat kami jadikan neraka jahanam penjara atau hamparan tempat duduk bagi orang-orang yang tidak beriman kepada Allah dan rasul-Nya."
  }
]