[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sungguh Kami telah memuliakan keturunan-keturunan Adam dengan karunia akal dan diutusnya para rasul kepada mereka, dan kami tundukan seluruh yang ada di alam ini bagi mereka, dan kami mudahkan bagi mereka tunggangan-tunggangan di darat dan kapal-kapal untuk mengangkut mereka, dan Kami beri mereka rizki dari makanan dan minuman yang baik-baik, dan Kami lebihkan mereka diatas kebanyakan makhluk ciptaanNya dengan keutamaan yang besar."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "70. Dan sungguh, Kami telah memuliakan anak keturunan Adam akal pikiran, bersujudnya para Malaikat terhadap kakek mereka, serta kemuliaan lainnya, dan Kami telah menundukkan segala sarana yang mengangkut mereka di daratan berupa hewan tunggangan dan alat transportasi, serta menundukkan sarana yang mengangkut mereka di lautan berupa kapal-kapal, dan Kami beri mereka rezeki berupa makanan, minuman dan pernikahan yang baik-baik dan sebagainya, dan Kami juga lebihkan mereka di atas banyak makhluk ciptaan Kami dengan kelebihan yang besar lagi sempurna, sebab itu mereka wajib bersyukur atas nikmat-nikmat Allah ini."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "70. Dan bagian dari rahmat Allah bagi hamba-hamba-Nya adalah dengan memuliakan mereka: “Sungguh Kami telah memuliakan keturunan Adam, dan Kami telah tundukkan bagi mereka hewan-hewan di darat dan kapal-kapal di laut agar dapat mereka tunggangi dan mengangkut barang-barang yang mereka miliki. Dan Kami telah memberi mereka makanan dan minuman yang halal dan lezat. Dan Kami telah melebihkan mereka dari banyak makhluk-makhluk lainnya dengan kelebihan yang banyak."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "70. وَلَقَدْ كَرَّمْنَا بَنِىٓ ءَادَمَ (Dan sesungguhnya telah Kami muliakan anak-anak Adam) Yakni Allah menciptakan mereka dengan bentuk yang indah dan menistimewakan mereka dengan kemampuan berbicara dan berfikir, serta mengkhususkan mereka dengan berbagai makanan, minuman, dan pakaian yang tidak dimiliki oleh segala jenis hewan. Allah juga memuliakan mereka dengan memberi mereka kekuasaan atas makhluk-makhluk lain dan menjadikan makhluk-makhluk lain untuk memenuhi kebutuhan mereka. وَحَمَلْنٰهُمْ فِى الْبَرِّ(Kami angkut mereka di daratan) Dengan hewan-hewan tunggangan atau kendaraan-kendaraan yang mereka buat. وَالْبَحْرِ(dan di lautan) Dengan kapal-kapal. وَرَزَقْنٰهُم مِّنَ الطَّيِّبٰتِ(Kami beri mereka rezeki dari yang baik-baik) Yakni makanan dan minuman yang lezat. وَفَضَّلْنٰهُمْ عَلَىٰ كَثِيرٍ مِّمَّنْ خَلَقْنَا تَفْضِيلًا (dan Kami lebihkan mereka dengan kelebihan yang sempurna atas kebanyakan makhluk yang telah Kami ciptakan) Maka dari itu wajib bagi manusia agar menyikapi kenikmatan ini dengan penuh rasa syukur dan menjauhi keingkarannya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Telah menceritakan kepada kita al-Qur'an yang begitu sempurna menjelaskan tentang sambutan dan jamuan bagi Adam -'Alaihissalam-, begitu juga tentang kemuliaan yang didapat oleh setiap insan., kemudian dijadikan sebagai tolak ukur bagi beradaban yang maju! namun seketika semua timbangan terbalik dengan hadirnya peradaban baru; peradaban yang mengumpulkan ummat manusia pada satu sumber yang dengannya mereka hanya berlomba-lomba mengumpulkan harta kekayaan dan mereka mengenyangkan diri dengan nafsunya, inilah yang menjadikan dalam benak mereka bahwa kehidupan dunia lebih utama ketimbang kehidupan akhirat!"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "70. Dan sungguh telah Kami utamakan anak cucu Adam sebagai ciptaan yang baik dan Kami istimewakan mereka dengan akal, tabiat, ilmu, dan pemahaman. Dan Kami pikul mereka di daratan menggunakan hewan melata dan kendaraan lainnya, dan di lautan dengan bahtera. Dan Kami beri rejeki mereka dengan kelezatan makanan dan minuman. Kami utamakan mereka atas banyak makhluk, yaitu selain malaikat, dengan keutamaan yang besar. Maksudnya yaitu jenis yang diutamakan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sungguh Kami telah memuliakan} memuliakan {anak cucu Adam dan Kami angkut mereka di darat dan di laut. Kami memberi rezeki kepada mereka dari yang baik-baik dan Kami melebihkan mereka di atas banyak makhluk yang Kami ciptakan dengan kelebihan yang sempurna"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "70. Ini adalah salah satu kemurahan dan kebaikan Allah yang tidak terukur kadarnya kepada mereka, yang mana Dia memuliakan Bani Adam dengan semua bentuk kemuliaan. Allah memuliakan mereka dengan ilmu dan akal. Allah mengutus para rasul menurunkan kitab-kitab, menjadikan wali dan orang pillihan (Nya) dari mereka, serta mencurahkan nikmat-nikmat lahir maupun batin yang lain bagi mereka. “Dan kami angkut mereka di daratan,” di atas tunggangan seperti unta, baghal, keledai, dan kendaraan-kendaraan darat, “dan di lautan,” dengan kapal-kapal dan perahu-perahu. “Kami beri mereka rizki dari yang baik-baik,” dalam bentuk makanan, minuman, pakaian dan pasangan. Maka, tidak ada dari kebaikan yang berhubungan erat dengan kebutuhan mereka melainkan pasti Allah telah memuliakan mereka dengannya dan memudahkannya bagi mereka dengan semudah-mudahnya. “Dan kami lebihkan mereka dengan kelebihan yang sempurna atas kebanyakan makhluk yang telah Kami ciptakan,” dengan keistimewaan khusus bagi mereka berupa jalan hidup yang baik dan mengutamakan mereka dengan aneka keutamaan yang tidak dimiliki makhluk lain dari jenis-jenis makhluk (yang ada). Apakah mereka tidak mau bersyukur kepada Dzat yang melimpahkan nikmatNya dan menepis bahaya? Jangan sampai nikmat-nikmat itu menghalangi mereka dari Dzat yang memberi nikmat itu sendiri, sehingga mereka sibuk dengan kenikmatan itu dari beribadah kepadaNya, bahkan tidak menutup kemungkinan menggunakannya dalam bermaksiat kepadaNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 70: Dengan ilmu, mampu berbicara, fisik yang seimbang, dan lain-lain. Di atas hewan dan kendaraan. Di atas kapal. Yakni jenisnya. Oleh karena itu, tidakkah mereka bersyukur kepada Tuhan yang telah memuliakan dan melebihkan mereka di atas makhluk-makhluk-Nya dengan sibuk beribadah kepada Tuhan mereka; bahkan mereka gunakan nikmat-nikmat itu untuk mendurhakai-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 70",
    "description": "Dan sungguh, kami telah memuliakan anak cucu adam, yaitu golongan manusia pada umumnya dengan tubuh yang bagus, kemampuan berpikir, kebebasan berkehendak, dan ilmu pengetahuan, dan kami angkut mereka di darat dengan kendaraan seperti onta atau lainnya, dan di laut, dengan kapal, dan kami beri mereka rezeki dari yang baik-baik, berupa minuman dan makanan yang lezat rasanya, dan kami lebihkan keutamaan mereka di atas banyak makhluk yang kami ciptakan dengan kelebihan yang sempurna. Ingatlah, pada hari ketika kami panggil setiap umat dengan pemimpinnya; kepada setiap anggota dari umat itu diberikan catatan amalnya, dan barang siapa diberikan catatan amalnya di tangan kanannya mereka itulah orang-orang yang berbahagia, mereka akan berulang-ulang membaca catatannya dengan baik disebabkan karena kegembiraannya, dan mereka tidak akan dirugikan sedikit pun dengan dikurangi pahala dari amal yang dilakukannya."
  }
]