[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sebutkanlah (wahai rasul), hari kebangkitan dengan memberikan kabar gembira dan menyampaikan peringatan, ketika Allah memanggil tiap-tiap golongan dari manusia bersama pemimpinnya yang dahulu mereka ikuti di dunia. Maka siapa saja diantara mereka termasuk orang shalih dari mereka, dan disodori buku catatan amal perbuatannya di tangan kanannya, maka mereka itu akan membaca buku catatan amal mereka dengan senang dan riang gembira. Dan mereka tidak mengalami pengurangan pahala dari amal-amal shalih mereka sedikitpun, walaupun seukuran benang tipis yang berada di tengah biji kurma."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "71. Dan ingatlah -wahai Rasul- pada hari ketika Kami menyeru setiap kelompok umat dengan pemimpin yang mereka ikuti ketika di dunia, barangsiapa yang diberikan catatan amalnya di tangan kanannya, mereka akan membaca catatannya dengan gembira, tidak dikurangi sedikitpun dari pahala mereka walaupun kecilnya pahala tersebut laksana selaput putih yang membungkus biji kurma."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "71. Hai Nabi, ingatlah pada hari kebangkitan ketika Kami memanggil setiap umat bersama nabi mereka untuk menjadi saksi atas mereka. Dan barangsiapa yang diberi kitab amalannya dengan tangan kanan -dan mereka adalah orang-orang yang mendapat kebahagiaan dan derajat yang tinggi-, maka mereka akan membaca kitab mereka dengan parasaan senang atas kebaikan-kebaikan yang telah mendapat balasan, dan balasan bagi mereka sama sekali tidak dikurangi sedikitpun."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "71. يَوْمَ نَدْعُوا۟ كُلَّ أُنَاسٍۭ بِإِمٰمِهِمْ ۖ ((Ingatlah) suatu hari (yang di hari itu) Kami panggil tiap umat dengan pemimpinnya) Dengan dikatakan pada hari itu “wahai umat yang diturunkan kepadanya Taurat! wahai umat yang diturunkan kepadanya Injil! wahai umat yang diturunkan kepadanya al-Qur’an! فَمَنْ أُوتِىَ كِتٰبَهُۥ بِيَمِينِهِۦ(dan barangsiapa yang diberikan kitab amalannya di tangan kanannya) Dari orang-orang yang dipanggil tersebut. فَأُو۟لٰٓئِكَ يَقْرَءُونَ كِتٰبَهُمْ (maka mereka ini akan membaca kitabnya itu) Yakni kitab yang menyebutkan segala amalan kebaikan dan amalan keburukannya. وَلَا يُظْلَمُونَ فَتِيلًا (dan mereka tidak dianiaya sedikitpun) Yakni pahala mereka sama sekali tidak dikurangi meski hanya seukuran ‘fatil’, yakni kulit tipis yang terdapat pada biji kurma."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "71. Dan ingatlah hari dimana Kami menyeru setiap umat dengan diiringi nabi atau kitab yang diturunkan kepada mereka saat kiamat. Dan Kami berikan kepada setiap manusia itu catatan amalnya. Barangsiapa diberi catatan amalnya dengan menggunakan tangan kanan, maka mereka adalah orang-orang yang berbahagia. Mereka membaca catatan yang diberikan kepada mereka itu dengan senang. Dan tidak berkurang sedikitpun pahala amal ibadah mereka. Al-Fatil adalah ikatan benang panjang yang ada di separuh biji buah. Ini digunakan sebagai contoh karena sangat sedikit dan tidak terlalu berarti"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "(Ingatlah) pada hari Kami memanggil setiap umat dengan pemimpinnya} dengan catatan amal mereka {Maka siapa saja yang diberi catatan amalnya dengan tangan kanannya, mereka akan membaca catatannya dan mereka tidak akan dirugikan} dan mereka tidak akan dikurangi pahalanya {sedikit pun} bahkan sekecil serabut yang ada di belahan biji kurma"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "71. Allah mengabarkan tentang keadaan para makhluk pada hari Kiamat. Allah juga mengabarkan bahwa Dia akan memanggil setiap umat bersama dengan imam dan pemberi petunjuk mereka, yaitu para rasul dan penerus-penerusnya. Kemudian setiap umat maju, dan rasul yang pernah menyeru mereka pun menghadirinya. Amalan mereka dibandingkan dengan kitab yang pernah diserukan oleh rasul, apakah sesuai atau tidak? Dengan ini, terbagilah manusia menjadi dua kelompok, “maka barangsiapa yang diberikan Kitab amalannya di tangan kanannya,” karena sebelumnya mereka mengikuti imamnya yang menunjukkan kepada jalan yang lurus, mengambil petunjuk dari Kitabullah, maka kebaikannya menjadi banyak dan keburukannya menyusut, “maka mereka ini akan membaca kitabnya itu,” dengan bacaan yang menggembirakan dan menyenangkan atas sesuatu yang mereka lihat di dalamnya dari sesuatu yang membuat mereka bahagia dan senang, “dan mereka tidak dianiaya sedikit pun,” dari setiap kebaikan yang telah mereka lakukan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 71: Yaitu hari kiamat. Yakni dengan nabi mereka atau dengan kitab yang diturunkan kepada nabi mereka, lalu dikatakan, “Wahai umat fulan!”. Kemudian setiap umat dihadapkan, dengan dihadiri rasulnya yang pernah berdakwah kepada mereka, kemudian amal mereka dihadapkan ke kitab yang diturunkan kepada rasul, apakah amal mereka sesuai dengan perintah yang ada dalam kitab itu atau tidak?. Ada pula yang menafsirkan “Dengan catatan amal mereka,” lalu dikatakan kepada orang yang banyak melakukan keburukan, “Wahai pemilik keburukan!” Mereka adalah orang-orang yang berbahagia. Yakni dengan gembira dan senang. Amal baik mereka tidak akan dirugikan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 71",
    "description": "Ingatlah, pada hari ketika kami panggil setiap umat dengan pemimpinnya; kepada setiap anggota dari umat itu diberikan catatan amalnya, dan barang siapa diberikan catatan amalnya di tangan kanannya mereka itulah orang-orang yang berbahagia, mereka akan berulang-ulang membaca catatannya dengan baik disebabkan karena kegembiraannya, dan mereka tidak akan dirugikan sedikit pun dengan dikurangi pahala dari amal yang dilakukannya. Dan barang siapa buta hatinya di dunia ini, menempuh jalan yang sesat dan durhaka kepada tuhan, maka di akhirat dia akan buta pula hatinya dan tersesat jauh dari jalan yang benar. Tidak ada waktu lagi untuk bertobat dan mencari keselamatan dari azab tuhan. Kepada mereka diberikan catatan amalnya di tangan kirinya. Mereka itulah orang-orang yang celaka disebabkan karena kesesatan dan kedurhakaannya kepada tuhan."
  }
]