[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan barang siapa di dunia ini buta hatinya dari melihat bukti-bukti kuasa Allah, tidak beriman kepada risalah yang dibawa Muhammad maka dia pada hari kiamat akan lebih buta untuk mengetahui jalan menuju surga dan juga lebih sesat jalannya dari petunjuk dan bimbingan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "72. Dan barangsiapa yang buta hatinya dari menerima kebenaran dan tunduk kepadanya di kehidupan dunia ini, maka di hari Kiamat kelak dia akan lebih buta lagi, tidak akan mendapatkan jalan Surga, dan tersesat dari jalan hidayah, sungguh balasan suatu amalan setimpal dan sejenis dengan amalannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "72. Dan barangsiapa yang buta hatinya di dunia ini sehingga tidak mendapat petunjuk menuju kebenaran, maka di akhirat dia akan lebih buta dan lebih tersesat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "72. وَمَن كَانَ فِى هٰذِهِۦٓ (Dan barangsiapa yang di dunia ini) Yakni di dunia. أَعْمَىٰ (buta) Kehilangan penglihatan, yakni buta hatinya. فَهُوَ فِى الْاٰخِرَةِ أَعْمَىٰ( niscaya di akhirat (nanti) ia akan lebih buta (pula)) Yakni buta matanya. Ia dihukum dengan mata yang buta sebagai balasan atas hati yang buta."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Barangsiapa yang buas kepada Allah dengan maksiatnya kepada-Nya di dunia ini, maka sesungguhnya kebuasanya itu akan kembali kepadanya di alam barzakh dan pada hari kiamat ia akan menjadi lebih buruk."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "72. Dan barangsiapa di dunia dia buta bashirahnya atau hatinya, maka di akhirat itu buta penglihatannya. Dia tidak ditunjukkan menuju jalan kemenangan bahkan jauh darinya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Siapa saja yang di dunia ini} di kehidupan dunia {buta (hatinya), maka di akhirat pun dia pasti buta dan lebih tersesat jalannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "72. “Dan barangsiapa yang di sini,” yakni di dunia ini “buta” dari kebenaran, maka dia tidak menerima dan tidak tunduk kepadanya, justru dia mengikuti kesesatan “niscaya di akhirat (nanti) dia akan lebih buta (pula)” (tidak melihat) jalur menuju surge, sebagaimana tatkala di dunia dia tidak menapakinya “dan lebih tersesat dari jalan (yang benar).” Karena balasan itu disebabkan oleh jenis amal perbuatan itu tersendiri, dan sebagaimana kamu memberi balasan, maka kamu diberi balasan pula. Dalam ayat ini, terdapat dalil bahwasanya setiap umat itu akan diseru kepada agama dan kitabnya. Apakah dilaksanakan ataukah tidak? Mereka tidak akan diazab dengan syariat nabi lain yang tidak diperintahkan untuk mengikutinya. Allah tidak akan mengazab seseorang kecuali setelah hujjah tegak atasnya, kemudian dia menyelisihinya. Orang-orang yang suka berbuat kebaikan akan diberikan kitab mereka dengan tangan kanannya. Mereka akan mendapatkan kebahagiaan yang sangat besar. Sedangkan orang-orang yang suka berbuat kejelekan, akan mendapatkan kebalikannya. Mereka tidak mampu membaca kitab mereka disebabkan dahsyatnya kegelisahan dan ketakutan yang mereka rasakan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 72: Dari melihat kebenaran dan dari tunduk kepadanya. Dari jalan yang mengarah kepada surga ketika di akhirat, karena ia tidak menempuh jalannya ketika di dunia, dan al jazaa’ min jinsil ‘amal (balasan diberikan sesuai amal yang dikerjakan)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 72",
    "description": "Dan barang siapa buta hatinya di dunia ini, menempuh jalan yang sesat dan durhaka kepada tuhan, maka di akhirat dia akan buta pula hatinya dan tersesat jauh dari jalan yang benar. Tidak ada waktu lagi untuk bertobat dan mencari keselamatan dari azab tuhan. Kepada mereka diberikan catatan amalnya di tangan kirinya. Mereka itulah orang-orang yang celaka disebabkan karena kesesatan dan kedurhakaannya kepada tuhan. Orang-orang kafir berupaya agar nabi Muhammad mau menuruti keinginan mereka, menyampaikan sesuatu yang lain dari apa yang diwahyukan oleh Allah. Nabi terdorong oleh harapannya yang sangat kuat agar mereka masuk islam, hampir saja tergoda oleh bujuk rayu orang-orang kafir itu, akan tetapi Allah meneguhkan hatinya sehingga keinginan orang kafir itu tidak terlaksana. Dan mereka, orang-orang kafir, hampir memalingkan engkau wahai nabi Muhammad dari apa yang telah kami wahyukan kepadamu, yaitu menyangkut perintah dan larangan, janji dan ancaman yang terkandung dalam Al-Qur'an, dan menyuruhmu agar engkau mengada-ada menyampaikan sesuatu yang lain dari apa yang termaktub dalam Al-Qur'an itu terhadap kami; dan jika engkau berbuat demikian tentu mereka menjadikan engkau sahabat yang setia, sebab engkau menuruti kehendaknya dan melaksanakan perintahnya."
  }
]