[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "dan sungguh Hampir-hampir saja kaum musyrikin itu akan memalingkanmu (wahai rasul) dari al-qur’an yang diturunkan Allah kepadamu, agar kamu membuat-buat kebohongan terhadap kami terkait apa yang Kami wahyukan kepadamu. Jika kamu melakukan apa yang kamu inginkan, pastilah mereka akan menjadikanmu orang kecintaan yang dekat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "73. Dan sungguh orang-orang musyrik itu hampir saja memalingkan dirimu dari apa yang telah Kami wahyukan kepadamu berupa ayat-ayat Al-Qur`ān -wahai Rasul-, agar engkau mengada-adakan hal lain terhadap Kami yang sesuai dengan hawa nafsu mereka, dan apabila engkau melakukan apa yang mereka inginkan niscaya mereka akan menjadikan dirimu sebagai sahabat setia mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "73. Allah memperingatkan orang-orang beriman dari bahaya gangguan orang-orang kafir yang selalu berusaha meminta orang-orang beriman untuk mengubah sebagian hukum-hukum yang ada dalam al-Qur’an, dan dengan kelicikan dan tipu daya yang mereka miliki, mereka hampir berhasil melakukannya hingga Rasulullah hampir menjadikan mereka para kekasih dan orang-orang terdekatnya; akan tetapi dengan rahmat-Nya, Allah meneguhkannya di atas kebenaran. Hal ini karena Rasulullah sangat ingin mereka dapat masuk Islam, sehingga beliau berfikir untuk sedikit menuruti permintaan mereka; namun Allah melindunginya sehingga beliau mengurungkan persetujuannya. Sungguh jika beliau melakukannya niscaya Allah akan melipatgandakan azabnya di dunia, dan melipatgandakannya lagi di akhirat, dan beliau tidak mendapatkan seorangpun yang dapat menyelamatkannya dari azab yang berlipat ganda itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "73. وَإِن كَادُوا۟ لَيَفْتِنُونَكَ (Dan sesungguhnya mereka hampir memalingkan kamu) Yakni hampir saja mereka menipumu dengan perkataan mereka “kemarilah untuk memuji tuhan-tuhan kami, dan kami akan masuk ke dalam agamamu”, maka Allah mewahyukan ayat ini kepada beliau. Hal ini karena dalam memenuhi permintaan mereka itu terdapat pelanggaran atas hukum dalam al-Qur’an dan kedustaan terhadap Allah, seperti mengganti kabar gembira dengan ancaman siksa dan lain sebagainya. وَإِذًا لَّاتَّخَذُوكَ خَلِيلًا (dan kalau sudah begitu tentulah mereka mengambil kamu jadi sahabat yang setia) Yakni apabila kami mengikuti hawa nafsu mereka maka mereka akan menjadikanmu teman setia dengan tulus."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "73. Sesungguhnya mereka hampir menempatkanmu dalam fitnah, yaitu penderitaan yang berat dan menipumu menggunakan sangkaan dan kata-kata manis mereka terkait agama mereka (Namun Nabi Muhammad ‘Alaihissalam terpelihara dan terjaga dari fitnah) supaya mereka bisa memalingkanmu dari dari apa yang telah Kami wahyukan kepadamu berupa hukum, perintah, larangan, janji dan peringatan. Jika kamu melakukan hal itu dan mengikuti hawa nafsu mereka, niscaya mereka akan menjadikanmu sebagai teman yang ikhlas. Ayat ini diturunkan terkait perkumpulan orang Quraisy seperti Abu Jahal dan Umayyah bin Khalaf, yang berkata: Wahai Muhammad, Biarkanlah tuhan kami, dan Kami akan masuk ke dalam agamamu,” sedangkan Nabi sedang menginginkan keislaman kaumnya. Lalu Allah menurunkan ayat ini."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya mereka hampir} hampir {memalingkan kamu} memalingkanmu {dari apa yang telah Kami wahyukan kepadamu agar kamu mengada-ada} agar kamu membuat-buat {yang lain terhadap Kami. Jika demikian} Jika kamu berbuat demikian {sungguh mereka menjadikanmu sahabat setia} kekasih yang setia"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "73. Allah menyebutkan karunia dan penjagaanNya kepada RasulNya, Muhammad dari para musuh yang gigih melontarkan fitnah dengan segala macam cara. Allah berfirman, “Dan sesungguhnya mereka hampir memalingkan kamu dari apa yang telah Kami wahyukan kepadamu, agar kamu membuat sesuatu yang lain secara bohong terhadap Kami,” maksudnya mereka telah melancarkan tipu-daya kepadamu yang belum pernah mereka ketahui (sebelumnya), mereka merekayasa dirimu agar mau berbohong atas Nama Allah dengan (memberi keterangan) yang berbeda dengan yang telah diwahyukan kepadamu, lantas kamu membawakan keterangan yang sesuai dengan hawa nafsu mereka, dan kamu meninggalkan wahyu yang diturunkan Allah kepadamu. “Dan kalau sudah begitu,” seandainya kamu melakukan apa yang mereka inginkan, “tentulah mereka mengambil kamu jadi sahabat yang setia,” yaitu sebagai kekasih sejati, lebih dihormati dari kekasih-kekasih mereka yang lain, karena perangai-perangai yang telah Allah pasang untukmu berupa akhlak mulia dan adab yang tinggi, yang dicintai oleh semua karib yang dekat maupun jauh, kawan maupun lawan. Akan tetapi, sungguh kamu akan mengetahui bahwasanya, tidaklah mereka memusuhi dan melawanmu melainkan karena kebenaran yang kamu bawa, bukan karena pribadimu. Sebagaimana Firman Allah , \"Sesungguhnya, Kami mengetahui bahwasanya apa yang mereka katakan itu menyedihkan hatimu, (janganlah kamu bersedih hati), karena mereka sebenarnya bukan mendustakan kamu, akan tetapi orang-orang yang zalim itu mengingkari ayat-ayat Allah. \" (Al-An’am:33)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 73: Allah Subhaanahu wa Ta'aala mengingatkan nikmat-nikmat-Nya yang diberikan kepada rasul-Nya dan penjagaan-Nya dari tipu daya musuh-musuh-Nya yang ingin menggelincirkan Beliau dengan berbagai cara. Dengan membawa sesuatu yang sesuai dengan hawa nafsu mereka dan meninggalkan apa yang diturunkan Allah. Yakni jika melakukan sesuatu yang sesuai hawa nafsu mereka (orang-orang kafir). Karena akhlak yang dikaruniakan Allah kepada Beliau yang begitu mulia dan adab yang baik yang dicintai oleh orang-orang yang dekat maupun yang jauh, kawan maupun musuh. Akan tetapi perlu diketahui, bahwa sesungguhnya mereka tidaklah memusuhi Beliau kecuali karena kebenaran yang Beliau bawa. Allah Subhaanahu wa Ta'aala berfirman, “Sesungguhnya Kami mengetahui bahwa apa yang mereka katakan itu menyedihkan hatimu, (janganlah kamu bersedih hati), karena mereka sebenarnya bukan mendustakan kamu, akan tetapi orang-orang yang zalim itu mengingkari ayat-ayat Allah.” (terj. Al An’aam: 33)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 73",
    "description": "Orang-orang kafir berupaya agar nabi Muhammad mau menuruti keinginan mereka, menyampaikan sesuatu yang lain dari apa yang diwahyukan oleh Allah. Nabi terdorong oleh harapannya yang sangat kuat agar mereka masuk islam, hampir saja tergoda oleh bujuk rayu orang-orang kafir itu, akan tetapi Allah meneguhkan hatinya sehingga keinginan orang kafir itu tidak terlaksana. Dan mereka, orang-orang kafir, hampir memalingkan engkau wahai nabi Muhammad dari apa yang telah kami wahyukan kepadamu, yaitu menyangkut perintah dan larangan, janji dan ancaman yang terkandung dalam Al-Qur'an, dan menyuruhmu agar engkau mengada-ada menyampaikan sesuatu yang lain dari apa yang termaktub dalam Al-Qur'an itu terhadap kami; dan jika engkau berbuat demikian tentu mereka menjadikan engkau sahabat yang setia, sebab engkau menuruti kehendaknya dan melaksanakan perintahnya. Dan sekiranya kami tidak memperteguh hatimu, untuk menolak kehendak dan keinginan mereka niscaya engkau hampir saja condong sedikit kepada mereka, disebabkan karena mereka berupaya sangat keras membujukmu agar engkau menyampaikan sesuatu yang lain dari apa yang kami wahyukan kepadamu."
  }
]