[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sekiranya Kami tidak meneguhkan (hati)mu di atas kebenaran dan menjagamu dari menyetujui mereka, pastilah kamu hampir saja condong sedikit kepada apa yang mereka sarankan kepadamu disebabkan kuatnya tipudaya mereka dan dahsyatnya tipu muslihat mereka serta banyaknya usaha dan keinginan besarmu agar mereka mendapatkan hidayah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "74. Dan seandainya Kami tidak menganugerahkan keteguhan pada hatimu di atas kebenaran, niscaya engkau hampir saja condong sedikit kepada mereka, sehingga engkau pun bisa saja menyetujui kemauan mereka lantaran kuatnya tipu daya mereka dibalik kuatnya tekadmu untuk membuat mereka beriman, namun Kami menghalangimu agar tidak condong kepada kemauan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "74. وَلَوْلَآ أَن ثَبَّتْنٰكَ (Dan kalau Kami tidak memperkuat (hati)mu) Yakni andai Kami tidak meneguhkanmu diatas kebenaran dan tidak melindungimu agar tidak menyetujui mereka. لقد كدت تركن إليهم (niscaya kamu hampir-hampir condong kepada mereka) Yakni sedikit condong kepada mereka. شَيْـًٔا قَلِيلًا (dengan sedikit kecondongan) Akan tetapi kemudian Rasulullah mendapat perlindungan, sehingga beliau terhindar dari kecondongan kepada mereka meski hanya sedikit."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "74-75 1 ). Ayat ini menunjukan bahwa besarnya suatu keburukan itu tergantung keadaan dan kedudukan pelakunya , dan ciri org yg tersesat adalah melanggar aturan Allah dan keluar dari wilayah-Nya. Wajib bagi yg membaca ayat ini utk mentadaburinya dan merasa takut, serta selalu berpegang Teguh dg agama.. 2 ). { وَلَوْلَآ أَن ثَبَّتْنَٰكَ لَقَدْ كِدتَّ تَرْكَنُ إِلَيْهِمْ شَيْـًٔا قَلِيلًا } \"Dan kalau Kami tidak memperkuat (hati)mu, niscaya kamu hampir-hampir condong sedikit kepada mereka,\" perhatikan pada lafadz (sedikit) dan lihatlah apa yang terjadi, kemudian perhatikan akibat yang mengejutkan pada ayat setelahnya : { إِذًا لَّأَذَقْنَٰكَ ضِعْفَ ٱلْحَيَوٰةِ وَضِعْفَ ٱلْمَمَاتِ ثُمَّ لَا تَجِدُ لَكَ عَلَيْنَا نَصِيرًا } \"Kalau terjadi demikian, benar-benarlah Kami akan rasakan kepadamu (siksaan) berlipat ganda di dunia ini dan begitu (pula siksaan) berlipat ganda sesudah mati, dan kamu tidak akan mendapat seorang penolongpun terhadap Kami.\""
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "74. Kalau tidak Kami tidak teguhkan dirimu atas kebenaran dengan memberi perlindungan, sungguh kamu hampir sedikit condong kepada mereka, karena saking kuatnya tipu daya dan desakan mereka, namun Aku membuatmu menyadari perlindungan Kami, dan menahanmu agar tidak condong kepada mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Jika Kami tidak memperteguhmu, niscaya kamu hampir} kamu hampir {condong} condong {kepada mereka sedikit"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "74. “Dan,” kendatipun demikian “kalau bukan karena Kami memperkuat (hati)mu,” untuk tetap di atas kebenaran dan Kami karuniakan kepadamu penolakan terhadap permintaan mereka “niscaya kamu hampir-hampir condong sedikit kepada mereka,” karena banyaknya usahamu untuk membenahi mereka dan kecintaanmu untuk memberikan hidayah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 74: Yakni jika Kami tidak meneguhkan kamu di atas kebenaran dan memberimu nikmat dengan tidak memenuhi seruan mereka. Karena begitu besarnya tipu daya mereka. Namun demikian, sebagaimana ditunjukkan oleh ayat ini, Beliau tidak condong kepada mereka dan tidak mendekatinya karena peneguhan Allah terhadap hati Beliau."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 74",
    "description": "Dan sekiranya kami tidak memperteguh hatimu, untuk menolak kehendak dan keinginan mereka niscaya engkau hampir saja condong sedikit kepada mereka, disebabkan karena mereka berupaya sangat keras membujukmu agar engkau menyampaikan sesuatu yang lain dari apa yang kami wahyukan kepadamu. Jika demikian, yakni jika engkau menuruti kehendak dan keinginannya, tentu akan kami rasakan kepadamu siksaan dua kali lipat di dunia ini dan dua kali lipat setelah mati, dibandingkan dengan siksaan yang kami timpakan kepada selain engkau, dan engkau wahai nabi Muhammad tidak akan mendapat seorang penolong pun terhadap kami. Tetapi kami telah kuatkan hatimu sehingga engkau tidak tergoda oleh tipu daya orang-orang kafir itu dan tidak condong sedikit pun untuk menuruti keinginannya."
  }
]