[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Jika engkau (wahai rasul) condong kepada kaum musyrikin sedikit terkait apa yang mereka mintakan kepadamu, niscaya Kami akan menimpakan padamu siksaan berlipat ganda saat engkau masih hidup di dunia dan siksaaan berlipat ganda di akhirat sesudah engkau mati. Hukuman yang demikian ini lantaran kesempurnaan nikmat Allah yang tercurah pada dirimu dan kesempurnaan ma’rifatmu kepada tuhanmu. Kemudian engkau tidak akan mendapatkan seseorangpun yang akan menolongmu dan menyingkirkan siksaan kami dari dirimu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "75. Dan apabila engkau condong kepada kemauan mereka niscaya Kami akan menimpakan padamu azab yang berlipat ganda di dunia ini dan di Akhirat kelak, kemudian engkau (Muhammad) tidak akan mendapatkan seorang penolong pun yang melindungimu dari Kami atau menghentikan azab itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "75. إِذًا لَّأَذَقْنٰكَ ضِعْفَ الْحَيَوٰةِ وَضِعْفَ الْمَمَاتِ (kalau terjadi demikian, benar-benarlah Kami akan rasakan kepadamu (siksaan) berlipat ganda di dunia ini dan begitu (pula siksaan) berlipat ganda sesudah mati) Yakni azabmu akan menjadi dua kali lipat dari azab orang musyrik di dunia dan begitu juga di akhirat. ثُمَّ لَا تَجِدُ لَكَ عَلَيْنَا نَصِيرًا (dan kamu tidak akan mendapat seorang penolongpun terhadap Kami) Yakni penolong yang dapat menolongmu dari azab itu."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "74-75 1 ). Ayat ini menunjukan bahwa besarnya suatu keburukan itu tergantung keadaan dan kedudukan pelakunya , dan ciri org yg tersesat adalah melanggar aturan Allah dan keluar dari wilayah-Nya. Wajib bagi yg membaca ayat ini utk mentadaburinya dan merasa takut, serta selalu berpegang Teguh dg agama.. 2 ). { وَلَوْلَآ أَن ثَبَّتْنَٰكَ لَقَدْ كِدتَّ تَرْكَنُ إِلَيْهِمْ شَيْـًٔا قَلِيلًا } \"Dan kalau Kami tidak memperkuat (hati)mu, niscaya kamu hampir-hampir condong sedikit kepada mereka,\" perhatikan pada lafadz (sedikit) dan lihatlah apa yang terjadi, kemudian perhatikan akibat yang mengejutkan pada ayat setelahnya : { إِذًا لَّأَذَقْنَٰكَ ضِعْفَ ٱلْحَيَوٰةِ وَضِعْفَ ٱلْمَمَاتِ ثُمَّ لَا تَجِدُ لَكَ عَلَيْنَا نَصِيرًا } \"Kalau terjadi demikian, benar-benarlah Kami akan rasakan kepadamu (siksaan) berlipat ganda di dunia ini dan begitu (pula siksaan) berlipat ganda sesudah mati, dan kamu tidak akan mendapat seorang penolongpun terhadap Kami.\""
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "75. Jika kamu mendekati jalannya hawa nafsu mereka, maka sungguh Kami akan membuatmu merasakan berlipat-lipat azab dunia dan akhirat, yatitu serupa dengan apa yang diazabkan untuk selainmu di dunia dan akhirat, lalu tidak kamu dapati penolong bagimu yang melindungimu dari azab."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika demikian} jika kamu condong kepada mereka {sungguh Kami akan membuatmu merasakan dua kali lipat di dunia} azab yang berlipat di dunia {dan dua kali lipat setelah mati} dan azab yang berlipat di akhirat {Kemudian kamu tidak akan mendapati seorang penolong pun terhadap Kami} penolong yang melindungimu dari azab Kami"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "75. “Kalau terjadi demikian,” seandainya kamu condong kepada keinginan mereka, “benar-benarlah Kami akan rasakan kepadamu (siksaan) berlipat ganda di dunia ini dan begitu (pula siksaan) berlipat ganda sesudah mati,” maksudnya benar-benar akan Kami timpakan kepadamu siksaan yang berlipat ganda di dunia dan akhirat. Hal itu karena Allah telah menyempurnakan nikmat-nikmatNya kepadamu dan menyempurnakan pengetahuanmu “kemudian kamu tidak akan mendapat seorang penolong pun terhadap Kami,” yang menyelamatkanmu dari azab yang menimpamu. Akan tetapi, Allah memeliharamu dari sebab-sebab keburukan dan keburukan itu sendiri. Selanjutnya, Kami menguatkan hatimu dan Kami menunjukkan kamu ke jalan yang lurus. Dan kamu tidak akan condong kepada mereka dari sisi manapun. Dia telah melimpahkan atas dirimu nikmat yang sempurna dan anugerah yang tak terhingga."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 75: Yakni jika engkau mengikuti keinginan mereka. Hal itu, karena Beliau telah diberikan kenikmatan yang sempurna oleh Allah dan diberikan pengetahuan yang cukup yang mengharuskan Beliau untuk tetap di atas hak (kebenaran). Yang menyelamatkan kamu dari azab yang ditimpakan kepadamu. Akan tetapi, Allah Subhaanahu wa Ta'aala telah menjagamu dari sebab-sebab keburukan, meneguhkan kamu dan menunjukkan kamu jalan yang lurus."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 75",
    "description": "Jika demikian, yakni jika engkau menuruti kehendak dan keinginannya, tentu akan kami rasakan kepadamu siksaan dua kali lipat di dunia ini dan dua kali lipat setelah mati, dibandingkan dengan siksaan yang kami timpakan kepada selain engkau, dan engkau wahai nabi Muhammad tidak akan mendapat seorang penolong pun terhadap kami. Tetapi kami telah kuatkan hatimu sehingga engkau tidak tergoda oleh tipu daya orang-orang kafir itu dan tidak condong sedikit pun untuk menuruti keinginannya. Dan sungguh, mereka orang-orang kafir itu hampir membuatmu wahai nabi Muhammad gelisah di negeri mekah karena mereka menyuruh engkau harus keluar dari negeri itu, akan tetapi Allah mencegahnya sehingga tidak terlaksana keinginan orang-orang kafir itu, dan kalau terjadi demikian, yakni jika mereka benar-benar mengusirmu dari mekah niscaya sepeninggalmu mereka tidak akan tinggal di sana melainkan sebentar saja, kemudian mereka akan hancur binasa."
  }
]