[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "dan sungguh Hampir saja kaum musyrikin mengusirmu dari makkah dengan cara melancarkan gangguan-gangguan terhadapmu. Seandainya mereka mengusirmu darinya, niscaya mereka tidak akan tinggal di dalamnya sepeninggalmu melainkan sebentar saja hingga turun pada mereka hukuman yang disegerakan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "76. Dan sungguh orang-orang kafir itu hampir membuatmu gelisah dengan aksi permusuhan mereka terhadapmu agar mereka mengeluarkanmu dari Makkah, akan tetapi Allah menghalangi mereka dari mengeluarkanmu hingga tiba masa hijrah atas perintah Tuhanmu. Seandainya mereka mengeluarkanmu dari Makkah, niscaya mereka tidak akan tinggal lama setelah itu melainkan sebentar saja karena mereka akan segera di azab."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "76-77. Orang-orang kafir ketika telah berputus asa dari persetujuan Rasulullah atas permintaan mereka, mereka berusaha untuk mengusirnya dari Makkah dengan terus menerus mengganggunya dan para pengikutnya. Sungguh jika mereka mengusirnya, niscaya azab akan menimpa mereka tidak lama setelah Rasulullah keluar dari Makkah; demikianlah sunnatullah yang berlaku pada umat-umat terdahulu yang mengusir para rasul mereka dari negeri mereka, dan ini adalah sunnatullah yang akan terus berlaku tanpa berubah sedikitpun."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "76. وَإِن كَادُوا۟ لَيَسْتَفِزُّونَكَ (Dan sesungguhnya benar-benar mereka hampir membuatmu gelisah) Yakni mereka hampir mengganggumu di kota Makkah agar kamu keluar darinya. Namun hal itu tidak terjadi, karena Allah mencegah mereka, sampai beliau berhijrah dengan perintah Allah sesuai dengan waktu yang telah ditentukan untuk berhjrah setelah mereka hendak mengusirnya. وإذا لا يلبثون خلافك (dan kalau terjadi demikian, niscaya sepeninggalmu mereka tidak tinggal) Yakni mereka tidak akan tinggal di sana setelah kamu keluar darinya. إِلَّا (melainkan) Kecuali sebatas waktu yang sebentar saja."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "76. Dan sesungguhnya mereka hampir membuatmu gelisah, wahai Nabi, dengan mengusirmu dari tanah Mekah, namun Allah mencegah mereka melakukan itu. Dan kalaupun mereka mengusirmu, mereka tidak akan tinggal disana kecuali hanya dalam waktu sebentar setelah mengusirmu, lalu mereka dibinasakan. Orang Yahudi berkata kepada Nabi SAW: “Jika Kamu memang benar-benar Nabi, maka pergilah ke Syam yang merupakan tempat berkumpul dan tanahnya para nabi” Kemudian Nabi melaksanakan perang Tabuk, Nabi ingin ke Syam setelah perang Tabuk. Kemudian Allah menurunkan ayat ini dan memerintahkannya untuk kembali ke Madinah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya mereka hampir} hampir {membuatmu gelisah} pertentangan mereka membuatmu cemas {di bumi} di tanah Mekkah {untuk mengusirmu dari sana. Jika demikian} Jika mereka mengusirmu {maka mereka tidak akan tinggal setelah kepergianmu} mereka tidak akan bertahan setelah kepergianmu {kecuali sebentar saja} waktu yang sebentar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "76-77. “Dan sesungguhnya mereka benar-benar hampir membuatmu gelisah di negeri (Makkah) untuk mengusirmu darinya,” karena kebencian mereka dengan keberadaanmu bersama mereka. Hampir saja mereka mengusirmu dan menyingkirkanmu dari negeri (Makkah). Seandainya mereka melakukannya, niscaya mereka tidak akan lama bertahan di negeri itu, hingga azab menimpa mereka. Itu adalah sunnatullah yang tidak pernah berubah dan berganti pada setiap umat. Setiap umat yang mendustakan dan mengusir RasulNya, niscaya Allah akan menyegerakan azab bagi mereka. Oleh karenanya, tatkala orang-orang kafir itu membuat makar terhadap RasulNya dan mengusirnya, maka tidaklah mereka mampu bertahan kecuali sebentar saja sampai akhirnya Allah membinasakan mereka di Perang Badar, menewaskan tokoh-tokoh mereka dan mencerai-beraikan kekuatan mereka. BagiNya-lah semua pujian. Dalam ayat ini terdapat dalil betapa besarnya kebutuhan seorang hamba kepada peneguhan hati oleh Allah. (Sudah seharusnya) dia senantiasa meminta, supaya Allah meneguhkan hatinya di atas keimanan dengan tetap melakukan segala usaha yang mengahantarkan kepadanya. Karena Nabi saja –padahal beliau adalah insan yang paing sempurna- (diberi peneguhan hati oleh Allah). Allah berfirman kepada beliau, “Dan kalau bukan karena Kami memperkuat (hatimu), niscaya kamu hampir-hampir condong sedikit kepada mereka,” lalu bagaimana dengan selain beliau? Dalam ayat ini terdapat tindakan Allah mengingatkan RasulNya terhadap karunia dan penjagaanNya dari keburukan. Hal ini menunjukkan bahawasanya Allah mencintai hamba-hambaNya, yang menyadari curahan kenikmatan pada mereka di kala muncul sebab-sebab keburukan dalam bentuk penjagaan dariNya dan keteguhan di atas keimanan. Dalam ayat ini terdapat pula dalil bahwasanya semakin tinggi kedudukan seorang hamba dan semakin banyak nikmat yang dia dapatkan dari Allah, maka semakin besar pula dosa dan tingkat kejahatannya apabila dia melakukan perbuatan yang tercela. Karena Allah telah mengingatkan RasulNya, seandainya beliau melakukannya –dan itu tidak mungkin terjadi- dengan FirmanNya, “Kalau terjadi demikian, benar-benarlah Kami akan rasakan kepadamu (siksaan) berlipat ganda sesudah mati, dan kamu tidak akan mendapat seorang penolong pun terhadap Kami.” Dalam ayat ini terdapat pula dalil bahwasanya apabila Allah menghendaki kehancuran suatu umat, maka kejahatannya akan berlipat-lipat, membesar dan semakin menjadi-jadi, sampai akhirnya jatuhlah keputusan dari Allah atas mereka, maka Allah menimpakan hukuman itu kepada mereka, sebagaimana itu sudah menjadi sunnatullah yang berlaku pada umat-umat terdahulu apabila mereka mengusir RasulNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 76: Yang demikian karena kebencian mereka yang begitu dalam kepada Beliau. Syaikh As Sa'diy berkata, “Dan ketika orang-orang kafir membuat makar terhadap Beliau serta mengeluarkan Beliau (dari Mekah), ternyata mereka tidak tinggal (di dunia) kecuali sebentar, sehingga Allah membinasakan mereka di Badar, tokoh-tokoh mereka terbunuh dan kekuatan mereka pecah, maka segala puji bagi-Nya. Dalam ayat ini terdapat dalil butuhnya seorang hamba kepada peneguhan Allah terhadap dirinya, dan bahwa sepatutnya bagi dirinya senantiasa mencari keridhaan Tuhannya; meminta kepada-Nya agar diteguhkan di atas keimanan sambil berusaha melakukan semua sebab yang dapat mencapai ke arah itu, karena Nabi shallallahu 'alaihi wa sallam adalah makhluk yang paling sempurna, namun Allah tetap berfirman kepadanya, “Dan sekiranya Kami tidak memperteguh(hati)mu, niscaya engkau hampir saja condong sedikit kepada mereka.” Lalu bagaimana dengan selain Beliau?” Menurut Syaikh As Sa’diy pula, bahwa semakin tinggi kedudukan seorang hamba dan banyak mendapatkan nikmat, maka semakin besar dosanya apabila melakukan perbuatan tercela. Demikian pula, apabila Allah ingin membinasakan suatu umat, maka dibiarkan dosanya menumpuk, lalu Allah menimpakan azab kepadanya. Ada yang menafsirkan, bahwa maksudnya kalau sampai terjadi Nabi Muhammad shallallahu 'alaihi wa sallam diusir oleh penduduk Mekah, niscaya mereka tidak akan lama hidup di dunia, dan Allah segera akan membinasakan mereka. Hijrah Nabi Muhammad shallallahu 'alaihi wa sallam ke Madinah bukan karena pengusiran kaum Quraisy, akan tetapi karena perintah Allah Subhaanahu wa Ta'aala. Ada pula yang mengatakan, bahwa ayat ini turun berkenaan orang-orang Yahudi ketika mereka datang kepada Rasulullah shallallahu 'alaihi wa sallam dan berkata, “Wahai Abul Qasim, jika engkau memang seorang nabi maka pergilah ke Syam, karena Syam adalah negeri padang mahsyar dan negeri para nabi.” Maka Beliau berperang di Tabuk dengan maksud pergi menuju Syam. Ketika sampai di Tabuk, Allah menurunkan kepada Beliau ayat di atas dan memerintahkan Beliau untuk kembali ke Madinah (Hal ini berdasarkan hadits yang diriwayatkan oleh Baihaqi dari Abdullah bin Ghanam. Menurut Ibnu Katsir, dalam isnadnya perlu diteliti, karena Nabi shallallahu 'alaihi wa sallam berperang Tabuk karena perintah Allah, bukan karena perintah orang-orang Yahudi.”)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 76",
    "description": "Dan sungguh, mereka orang-orang kafir itu hampir membuatmu wahai nabi Muhammad gelisah di negeri mekah karena mereka menyuruh engkau harus keluar dari negeri itu, akan tetapi Allah mencegahnya sehingga tidak terlaksana keinginan orang-orang kafir itu, dan kalau terjadi demikian, yakni jika mereka benar-benar mengusirmu dari mekah niscaya sepeninggalmu mereka tidak akan tinggal di sana melainkan sebentar saja, kemudian mereka akan hancur binasa. Yang demikian itu, yakni kehancuran bagi umat yang mengusir para rasul kami dari negerinya, merupakan ketetapan bagi para rasul kami yang kami utus sebelum engkau, dan tidak akan engkau dapati perubahan atas ketetapan kami. Setiap umat yang mengusir para rasul dari negerinya pasti akan dibinasakan oleh Allah. Demikianlah ketetapan Allah yang ditetapkan, dan tidak ada perubahan bagi ketetapan itu selamalamanya."
  }
]