[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Itu adalah ketetapan Allah terkait pembinasaan umat manusia yang mengusir rasul dari tengah mereka. Dan engkau (wahai rasul) tidak akan menemukan adanya perubahan pada ketetapan Kami. Tidak ada pengingkaran terhadap janji Kami."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "77. Ketentuan tidak tinggalnya mereka melainkan sebentar saja setelah engkau keluar darinya karena akan di azab, merupakan ketetapan Allah yang pasti bagi para Rasul sebelum engkau, yaitu bahwa setiap Rasul yang dikeluarkan oleh kaumnya dari negeri mereka, Allah menurunkan padanya azab. Dan engkau -wahai Rasul- tidak akan dapati perubahan atas ketetapan Kami, bahkan engkau akan mendapatinya pasti terjadi."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "77. سُنَّةَ مَن قَدْ أَرْسَلْنَا قَبْلَكَ مِن رُّسُلِنَا ۖ (sebagai suatu ketetapan terhadap rasul-rasul Kami yang Kami utus sebelum kamu) Bahwa jika mereka mengusir nabi mereka dari sekeliling mereka atau membunuhnya maka akan turun azab yang menimpa mereka. وَلَا تَجِدُ لِسُنَّتِنَا تَحْوِيلًا (dan tidak akan kamu dapati perubahan bagi ketetapan Kami itu) Yakni ketentuan yang telah Allah tetapkan tidak akan ada seorangpun yang mampu merubahnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "77. Ketetapan Kami yang sudah ditentukan, yaitu membinasakan umat-umat terdahulu yang mengusir para rasul dari rumah-rumah mereka itu juga merupakan ketetapan Kami yang terjadi kepadamu sebagaimana rasul sebelummu. Dan kamu tidak akan mendapati perubahan dan pergantian terkait ketetapan kami"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Merupakan ketetapan} hal lazim {(bagi) para rasul Kami yang benar-benar Kami utus sebelum kamu dan kamu tidak akan mendapati atas ketetapan Kami suatu perubahan} perubahan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "76-77. “Dan sesungguhnya mereka benar-benar hampir membuatmu gelisah di negeri (Makkah) untuk mengusirmu darinya,” karena kebencian mereka dengan keberadaanmu bersama mereka. Hampir saja mereka mengusirmu dan menyingkirkanmu dari negeri (Makkah). Seandainya mereka melakukannya, niscaya mereka tidak akan lama bertahan di negeri itu, hingga azab menimpa mereka. Itu adalah sunnatullah yang tidak pernah berubah dan berganti pada setiap umat. Setiap umat yang mendustakan dan mengusir RasulNya, niscaya Allah akan menyegerakan azab bagi mereka. Oleh karenanya, tatkala orang-orang kafir itu membuat makar terhadap RasulNya dan mengusirnya, maka tidaklah mereka mampu bertahan kecuali sebentar saja sampai akhirnya Allah membinasakan mereka di Perang Badar, menewaskan tokoh-tokoh mereka dan mencerai-beraikan kekuatan mereka. BagiNya-lah semua pujian. Dalam ayat ini terdapat dalil betapa besarnya kebutuhan seorang hamba kepada peneguhan hati oleh Allah. (Sudah seharusnya) dia senantiasa meminta, supaya Allah meneguhkan hatinya di atas keimanan dengan tetap melakukan segala usaha yang mengahantarkan kepadanya. Karena Nabi saja –padahal beliau adalah insan yang paing sempurna- (diberi peneguhan hati oleh Allah). Allah berfirman kepada beliau, “Dan kalau bukan karena Kami memperkuat (hatimu), niscaya kamu hampir-hampir condong sedikit kepada mereka,” lalu bagaimana dengan selain beliau? Dalam ayat ini terdapat tindakan Allah mengingatkan RasulNya terhadap karunia dan penjagaanNya dari keburukan. Hal ini menunjukkan bahawasanya Allah mencintai hamba-hambaNya, yang menyadari curahan kenikmatan pada mereka di kala muncul sebab-sebab keburukan dalam bentuk penjagaan dariNya dan keteguhan di atas keimanan. Dalam ayat ini terdapat pula dalil bahwasanya semakin tinggi kedudukan seorang hamba dan semakin banyak nikmat yang dia dapatkan dari Allah, maka semakin besar pula dosa dan tingkat kejahatannya apabila dia melakukan perbuatan yang tercela. Karena Allah telah mengingatkan RasulNya, seandainya beliau melakukannya –dan itu tidak mungkin terjadi- dengan FirmanNya, “Kalau terjadi demikian, benar-benarlah Kami akan rasakan kepadamu (siksaan) berlipat ganda sesudah mati, dan kamu tidak akan mendapat seorang penolong pun terhadap Kami.” Dalam ayat ini terdapat pula dalil bahwasanya apabila Allah menghendaki kehancuran suatu umat, maka kejahatannya akan berlipat-lipat, membesar dan semakin menjadi-jadi, sampai akhirnya jatuhlah keputusan dari Allah atas mereka, maka Allah menimpakan hukuman itu kepada mereka, sebagaimana itu sudah menjadi sunnatullah yang berlaku pada umat-umat terdahulu apabila mereka mengusir RasulNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 77: Maksudnya, setiap umat yang mengusir rasul pasti akan dibinasakan Allah. Itulah sunnah (ketetapan) Allah Subhaanahu wa Ta'aala yang tidak mengalami perubahan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 77",
    "description": "Yang demikian itu, yakni kehancuran bagi umat yang mengusir para rasul kami dari negerinya, merupakan ketetapan bagi para rasul kami yang kami utus sebelum engkau, dan tidak akan engkau dapati perubahan atas ketetapan kami. Setiap umat yang mengusir para rasul dari negerinya pasti akan dibinasakan oleh Allah. Demikianlah ketetapan Allah yang ditetapkan, dan tidak ada perubahan bagi ketetapan itu selamalamanya. Laksanakanlah salat sejak matahari tergelincir, condong dari pertengahan langit ke arah barat, sampai gelapnya malam dan laksanakan pula salat subuh. Sesungguhnya salat subuh itu disaksikan oleh malaikat, baik malaikat siang maupun malaikat malam. Perintah salat pada ayat ini mencakup salat lima waktu. Sesudah tergelincir matahari adalah waktu untuk salat zuhur dan asar, sesudah gelapnya malam untuk waktu salat magrib, isya dan subuh."
  }
]