[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dirikanlah shalat dengan sempurna dari waktu tergelincirnya matahari di tengah hari hingga waktu datangnya malam. Dan masuk dalam pengertian ini shalat dzhur, ashar, maghrib, dan isya. Dan laksanakanlah sholat subuh dan panjangkanlah bacaan al-qur’an di dalam shalat shubuh, karena sesungguhnya sholat subuh itu dihadiri malaikat penjaga malam dan malaikat penjaga siang."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "78. Dirikanlah salat dengan melaksanakannya secara sempurna di waktu-waktunya, mulai dari tergelincirnya matahari dari tengah langit yang mencakup waktu salat zuhur dan asar, sampai gelapnya malam yang mencakup waktu salat magrib dan isya, serta dirikanlah salat fajar dengan memperpanjang bacaan Al-Qur`ān di dalamnya, karena salat fajar dihadiri oleh Malaikat malam dan Malaikat siang."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "78-79. Allah memerintahkan Nabi Muhammad dan umatnya dengan perkara yang agung: “Senantiasalah mendirikan shalat dari waktu tergelincirnya matahari pada siang hari hingga malam hari -masuk di dalamnya shalat dhuhur, ashar, maghrib, dan isya’-, dan dirikanlah shalat subuh dengan memanjangkan bacaannya, karena bacaan al-Qur’an pada shalat fajar akan disaksikan para malaikat yang bertugas pada malam hari dan para malaikat yang bertugas pada siang hari.” Kemudian Allah memerintahkan Rasulullah untuk mendirikan shalat sunnah tahajjud pada malam hari untuk memperbanyak bacaan al-Qur’an agar beliau mendapat derajat pemberi syafaat bagi kaum muslimin pada hari kiamat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "78. أَقِمِ الصَّلَوٰةَ لِدُلُوكِ الشَّمْسِ (Dirikanlah shalat dari sesudah matahari tergelincir) Yakni matahari agak condong dari pertengahan langit, yakni shalat dhuhur. إِلَىٰ غَسَقِ الَّيْلِ(sampai gelap malam) Makna (الغسق) yakni ketika malam telah gelap gulita. Yang dimaksud adalah shalat maghrib dan isya’. وَقُرْءَانَ الْفَجْرِ ۖ( dan (dirikanlah pula shalat) subuh) Yakni dirikanlah bacaan pada waktu fajar, yakni shalat subuh, dan pada shalat subuh disunnahkan untuk dipanjangkan bacaannya. إِنَّ قُرْءَانَ الْفَجْرِ كَانَ مَشْهُودًا(Sesungguhnya shalat subuh itu disaksikan (oleh malaikat)) Yakni disaksikan oleh malaikat malam dan malaikat siang sebagaimana yang disebutkan dalam hadits shahih."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Allah Swt. menyebutkan dalam kitab-Nya waktu-waktu shalat, sesekali disebutkan tiga waktu dalam satu ayat sebagaimana dalam firman-Nya : { أَقِمِ ٱلصَّلَوٰةَ لِدُلُوكِ ٱلشَّمْسِ إِلَىٰ غَسَقِ ٱلَّيْلِ وَقُرْءَانَ ٱلْفَجْرِ ۖ إِنَّ قُرْءَانَ ٱلْفَجْرِ كَانَ مَشْهُودًا } \"Dirikanlah shalat dari sesudah matahari tergelincir sampai gelap malam dan (dirikanlah pula shalat) subuh. Sesungguhnya shalat subuh itu disaksikan (oleh malaikat).\" dan sisanya lagi dsebutkan dalam empat ayat : { فَسُبْحَٰنَ ٱللَّهِ حِينَ تُمْسُونَ وَحِينَ تُصْبِحُونَ , وَلَهُ ٱلْحَمْدُ فِى ٱلسَّمَٰوَٰتِ وَٱلْأَرْضِ وَعَشِيًّا وَحِينَ تُظْهِرُونَ } \"Maka bertasbihlah kepada Allah di waktu kamu berada di petang hari dan waktu kamu berada di waktu subuh , dan bagi-Nya-lah segala puji di langit dan di bumi dan di waktu kamu berada pada petang hari dan di waktu kamu berada di waktu Zuhur\" [ Ar-Rum : 17-18], dan firman-Nya : { وَسَبِّحْ بِحَمْدِ رَبِّكَ قَبْلَ طُلُوعِ ٱلشَّمْسِ وَقَبْلَ غُرُوبِهَا ۖ وَمِنْ ءَانَآئِ ٱلَّيْلِ فَسَبِّحْ وَأَطْرَافَ ٱلنَّهَارِ لَعَلَّكَ تَرْضَىٰ } \"dan bertasbihlah dengan memuji Tuhanmu, sebelum terbit matahari dan sebelum terbenamnya dan bertasbih pulalah pada waktu-waktu di malam hari dan pada waktu-waktu di siang hari, supaya kamu merasa senang,\" [Thaha : 130], dan firman-Nya : { فَٱصْبِرْ عَلَىٰ مَا يَقُولُونَ وَسَبِّحْ بِحَمْدِ رَبِّكَ قَبْلَ طُلُوعِ ٱلشَّمْسِ وَقَبْلَ ٱلْغُرُوبِ , وَمِنَ ٱلَّيْلِ فَسَبِّحْهُ وَأَدْبَٰرَ ٱلسُّجُودِ } \"Maka bersabarlah kamu terhadap apa yang mereka katakan dan bertasbihlah sambil memuji Tuhanmu sebelum terbit matahari dan sebelum terbenam(nya) , Dan bertasbihlah kamu kepada-Nya di malam hari dan setiap selesai sembahyang.\" [Qaf : 39-40], kemudian datanglah sunnah memberikan penjelasan yang lebih luas dan terperinci."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "78. Dirikanlah shalat (shalat zhuhur) sesudah tergelincirnya matahari dan sesudah condong dari tengah-tengah langit menuju arah barat. Lalu dirikanlah dua shalat, yaitu maghrib dan isya’ ketika telah datang kegelapaan malam. Lalu dirikanlah shalat fajar (subuh). Sesungguhnya shalat fajar dan membaca Al-Qur’an di dalamnya merupakan ibadah yang disaksikan oleh para malaikat malam dan malaikat siang"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dirikanlah shalat sejak matahari tergelincir} terbenamnya matahari dari langit {sampai gelapnya malam} kegelapan malam {dan (dirikanlah shalat) subuh} dan dirikanlah shalat subuh yang bacaan Al-Qur’annya panjang {Sesungguhnya shalat Subuh itu disaksikan} disaksikan, malaikat malam dan malaikat siang menyaksikannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "78. Allah menerintahkan NabiNya, Muhammad untuk menegakkan shalat dengan sempurna, baik secara fisik maupun bathin pada waktu-waktunya “dari sesudah matahari tergelincir,” yaitu condongnya matahari ke arah barat setelah tergelincir. Masuk pada waktu itu adalah Shalat Zhuhur dan Ashar “sampai gelap malam,” yaitu hingga gelap. Masuk dalam waktu ini adalah Shalat Magrib dan Isya “dan (dirikanlah pula shalat) fajar,” yaitu Shalat Subuh. Disebutkan dengan kata “qur’an”, karena shalat subuh disyariatkan memperpanjang bacaan al-Quran di dalamnya melebihi waktu-waktu shalat lain. Dan juga karena keutamaan bacaan al-Quran di dalamnya, lantaran disaksikan oleh Allah, para malaikat siang, dan malaikat malam. Dalam ayat ini, disebutkan lima waktu untuk shalat-shalat yang wajib. Dan bahwa shalat-shalat yang dikerjakan di dalamnya merupakan shalat-shalat wajib karena adanya pengkhususan dengan perintah itu. Pada ayat ini terdapat keterangan bahwa waktu merupakan syarat sahnya shalat, dan ia menjadi sebab diwajibkannya (pelaksanaan) shalat. Karena Allah memerintahkan untuk mendirikan shalat pada waktu-waktu ini. Apabila ada udzur, maka shalat zhuhur dan ashar boleh dijamak. Begitu pula magrib dan isya. Karena Allah menggabungkan waktu keduanya secara bersamaan. Dalam ayat ini (juga) termuat keutamaan shalat subuh dan keutamaan memperpanjang bacaan di dalamnya, dan bahwa bacaan merupakan rukun dari shalat subuh. Karena apabila suatu ibadah dinamakan dengan sebagian namanya, maka itu menunjukkan kewajiban perkara tersebut. 79. Dan Firman Allah, “Dan pada sebagian malam hari maka shalat tahajudlah kamu,” maksudnya shalatlah pada sisa waktu malam “sebagai suatu ibadah tambahan bagimu,” maksudnya agar shalat malam menjadi tambahan bagi tingginya kedudukan dan derajatmu. Berbeda dengan orang selainmu, maka shalat malam itu sebagai penghapus atas kesalahan-kesalahannya. Pengertian ayat ini juga bisa mengandung makna bahwasanya shalat lima waktu itu merupakan kewajiban atasmu dan kamu Mukminin. Berbeda dengan shalat malam, maka itu adalah kewajiban yang dikhususkan untukmu. Hal ini karena kemuliaanmu di sisi Allah, sehingga Dia menjadikan tugasmu lebih banyak daripada orang lain, supaya pahalamu menjadi banyak, yang dengan itu kamu bisa mencapai al-Maqam al-Mahmud (kedudukan terpuji di sisi Rabbmu). Ia merupakan kedudukan yang dipuji-puji oleh orang-orang yang terdahulu dan yang akan datang, yaitu kedudukan bisa memberi syafaat tertinggi, tatkala seluruh makhluk meminta syafaat kepada Nabi Adam, kemudian Nabi Nuh, Ibrahim, Musa, dan Isa, mereka semua mengemukakan udzur darinya. Hingga mereka meminta syafaat dari pemimpin anak keturunan Adam, supaya Allah mengasihi mereka dari kegelisahan dan kesusahan pada waktu itu. Beliau pun meminta syafaat kepada Rabbnya. Kemudian Allah pun mengizinkan beliau untuk memberikan syafaat, menempatkan beliau di tempat yang mana orang-orang terdahulu hingga orang-orang yang datang belakangan merasa iri untuk mendapatkannya. Sehingga hal itu menjadi karunia Nabi Muhammad bagi seluruh makhluk."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 78: Yakni shalat Zhuhur, ‘Ashar, Maghrib dan Isya. Shalat Subuh disebut Qur’anul fajr, karena disyariatkannya memperpanjang bacaan Al Qur’an di sana melebihi biasanya pada shalat fardhu lainnya. Di samping itu, karena adanya keutamaan membaca Al Qur’an di waktu itu karena disaksikan oleh Allah, malaikat malam dan malaikat siang. Dalam ayat ini disebutkan waktu-waktu shalat fardhu, dan bahwa masuknya waktu merupakan syarat sahnya shalat, dan bahwa waktu tersebut merupakan sebab wajibnya, karena Allah memerintahkan untuk mendirikannya karena tiba waktu-waktu itu. Demikian pula menunjukkan, bahwa Zhuhur dan ‘Ashar dapat dijama’ (digabung), demikian pula Maghrib dan Isya karena adanya ‘uzur. Selain itu, di ayat ini terdapat dalil keutamaan shalat Subuh dan keutamaan memperpanjang bacaan di sana."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 78",
    "description": "Laksanakanlah salat sejak matahari tergelincir, condong dari pertengahan langit ke arah barat, sampai gelapnya malam dan laksanakan pula salat subuh. Sesungguhnya salat subuh itu disaksikan oleh malaikat, baik malaikat siang maupun malaikat malam. Perintah salat pada ayat ini mencakup salat lima waktu. Sesudah tergelincir matahari adalah waktu untuk salat zuhur dan asar, sesudah gelapnya malam untuk waktu salat magrib, isya dan subuh. Dan pada sebagian malam, yaitu pada sepertiga malam yang terakhir, bangunlah dan lakukanlah salat tahajud sebagai suatu ibadah tambahan bagimu wahai nabi Muhammad, mudah-Mudahan tuhanmu mengangkatmu ke tempat yang terpuji di mana engkau memberikan syafaat agung kelak di hari kiamat."
  }
]