[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan bangunlah (wahai nabi) dari tidurmu pada sebagain malam. Bacalah al-qur’an dalam shalat malam supaya shalat malammu menjadi tambahan bagimu untuk meninggikan kualitasmu dan meningkatkan derajatmu. Mudah-mudahan Allah membangkitkan kamu menjadi pemberi syafaat bagi sekalian manusia pada hari kiamat, sehingga Allah merahmati mereka dari kondisi yang meliputi merreka, dan engkau menduduki kedudukan yang dipuji oleh orang-orang terdahulu dan orang-orang yang datang belakangan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "79. Dan pada sebagian malam, maka dirikanlah salat tahajud -wahai Rasul-, salatlah di sebagian waktu malam itu agar ia menjadi tambahan untuk mengangkat derajatmu, dengan harapan agar Allah membangkitkanmu di hari Kiamat kelak sebagai pemberi syafaat kepada seluruh umat manusia agar terbebaskan dari kesengsaraan dan rasa takut pada hari Kiamat, dan engkau berhak mendapatkan kedudukan sebagai pemegang syafaat 'uẓma (teragung) yang dipuji dan disanjung oleh umat-umat terdahulu dan belakangan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "79. وَمِنَ الَّيْلِ فَتَهَجَّدْ بِهِۦ (Dan pada sebahagian malam hari bersembahyang tahajudlah kamu) Shalat tahajjud adalah shalat yang dilaksanakan pada malam hari setelah bangun tidur. نَافِلَةً لَّكَ(sebagai suatu ibadah tambahan bagimu) Yakni tambahan atas shalat-shalat wajib. Terdapat pendapat mengatakan bahwa shalat tahajjud wajib dilakukan oleh Rasulullah dan sunnah bagi umatnya, dan pendapat ini menyelisihi ayat ini secara tekstual. عَسَىٰٓ أَن يَبْعَثَكَ رَبُّكَ مَقَامًا مَّحْمُودًا(mudah-mudahan Tuhan-mu mengangkat kamu ke tempat yang terpuji) Yakni kedudukan yang dimiliki Rasulullah untuk memberi syafaat di hari kiamat bagi manusia agar Allah mengistirahatkan mereka dari kesusahan mereka, sehingga orang-orang di padang mahsyar memberi pujian bagi kedudukan tersebut, dan di tangan Rasulullah terdapat bendera pujian."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Pada ayat ini ada peringatan bagi setiap mukmin tentang kebaikan balasan yang akan mereka terima jika menghidupkan malamnya dengan ibadah kepada tuhannya, dan sesungguhnya bai mereka tempat berpijak di sisi tuhannya tergantung kedudukan mereka dalam ibadah, semakin baik fanatisme mereka kepada nabinya dalam mendirikan ibadah ini, maka semakin baik pula balasan yang akan mereka terima dari tuhannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "79. Dan pada sebagian malam, yaitu sepertiga malam terakhir, dirikanlah shalat tahajjud seusai tidur wahai Nabi, sebagai suatu kewajiban tambahan bagimu setelah shalat-shalat fardhu. Barangkali Allah akan membangkitkan dan mendirikanmu pada hari kiamat di maqam terpuji yang mana kamu dipuji-puji oleh seluruh manusia, yaitu maqam syafaat yang agung dalam menentukan suatu hukum"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Pada sebagian malam lakukanlah shalat tahajud} berdirilah dengan membaca Al-Qur’an (shalat) {sebagai tambahan bagimu} tambahan bagimu untuk mengangkat derajatmu {mudah-mudahan Tuhanmu mengangkatmu ke tempat yang terpuji} tempat syafaat yang agung yang mana para pendahulu dan orang-orang yang akan datang memujimu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "79. Dan Firman Allah, “Dan pada sebagian malam hari maka shalat tahajudlah kamu,” maksudnya shalatlah pada sisa waktu malam “sebagai suatu ibadah tambahan bagimu,” maksudnya agar shalat malam menjadi tambahan bagi tingginya kedudukan dan derajatmu. Berbeda dengan orang selainmu, maka shalat malam itu sebagai penghapus atas kesalahan-kesalahannya. Pengertian ayat ini juga bisa mengandung makna bahwasanya shalat lima waktu itu merupakan kewajiban atasmu dan kamu Mukminin. Berbeda dengan shalat malam, maka itu adalah kewajiban yang dikhususkan untukmu. Hal ini karena kemuliaanmu di sisi Allah, sehingga Dia menjadikan tugasmu lebih banyak daripada orang lain, supaya pahalamu menjadi banyak, yang dengan itu kamu bisa mencapai al-Maqam al-Mahmud (kedudukan terpuji di sisi Rabbmu). Ia merupakan kedudukan yang dipuji-puji oleh orang-orang yang terdahulu dan yang akan datang, yaitu kedudukan bisa memberi syafaat tertinggi, tatkala seluruh makhluk meminta syafaat kepada Nabi Adam, kemudian Nabi Nuh, Ibrahim, Musa, dan Isa, mereka semua mengemukakan udzur darinya. Hingga mereka meminta syafaat dari pemimpin anak keturunan Adam, supaya Allah mengasihi mereka dari kegelisahan dan kesusahan pada waktu itu. Beliau pun meminta syafaat kepada Rabbnya. Kemudian Allah pun mengizinkan beliau untuk memberikan syafaat, menempatkan beliau di tempat yang mana orang-orang terdahulu hingga orang-orang yang datang belakangan merasa iri untuk mendapatkannya. Sehingga hal itu menjadi karunia Nabi Muhammad bagi seluruh makhluk."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 79: Ada yang menafsirkan dengan, “Sebagai kewajiban tambahan bagimu tidak umatmu” atau “Sebagai keutamaan di atas shalat fardhu.” Ada pula yang menafsirkan, agar shalat malam itu menambah kedudukanmu, meninggikan derajatmu, berbeda dengan selainmu, maka shalat itu sebagai penebus kesalahannya. Yakni tempat yang dipuji oleh orang-orang terdahulu dan yang datang kemudian, yaitu tempat di mana Beliau melakukan syafa’at agar urusan manusia diselesaikan. Ketika itu manusia mencari orang yang mau memberikan syafa’at untuk mereka, mereka mendatangi Adam, lalu Nuh, Ibrahim, Musa, kemudian Isa, namun mereka tidak bisa dan mengemukakan alasannya, sehingga akhirnya mereka mendatangi Nabi Muhammad shallallahu 'alaihi wa sallam untuk berbicara kepada Allah agar Allah merahmati mereka di padang mahsyar yang ketika itu matahari didekatkan satu mil sehingga keringat manusia berkucuran."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 79",
    "description": "Dan pada sebagian malam, yaitu pada sepertiga malam yang terakhir, bangunlah dan lakukanlah salat tahajud sebagai suatu ibadah tambahan bagimu wahai nabi Muhammad, mudah-Mudahan tuhanmu mengangkatmu ke tempat yang terpuji di mana engkau memberikan syafaat agung kelak di hari kiamat. Dan katakanlah, wahai nabi Muhammad, ya tuhanku, masukkan aku ke tempat masuk yang benar dan dengan cara yang benar, baik dalam urusan dunia maupun akhirat, dan keluarkan pula aku ke tempat keluar yang benar dan dengan cara yang benar pula, baik dalam urusan dunia maupun akhirat, dan berikanlah kepadaku dari sisi-Mu kekuasaan yang dapat menolongku menghadapi orang yang memusuhiku. Ayat ini berkaitan dengan hijrah nabi dari mekah ke madinah. Di dalamnya terkandung perintah agar nabi memohon kepada Allah agar memasuki madinah dengan cara yang benar, dan keluar dari mekah dengan cara yang benar pula. Ada juga yang menafsirkan agar kita memasuki kubur dengan baik dan keluar darinya pada hari berbangkit dengan baik pula."
  }
]