[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mudah-mudahan tuhan kalian (wahai bani israil), melimpahkan rahmatNya kepada kalain setelah hukuman yang ditimpakanNya pada kalian, jika kalian mau bertaubat dan memperbaiki diri. Akan tetapi, bila kalian kembali melakukan kerusakan dan kezhaliman, niscaya Kami akan kembali menghukum dan menghinakan kalian. Dan kami menjadikan neraka jahanam bagi kalian dan seluruh orang kafir sebagai penjara yang tidak mungkin keluar darinya selamanya. Dalam ayat ini dan ayat sebelumnya terkandung unsur peringatan bagi umat ini agar tidak berbuat maksiat supa tidak menimpa mereka hukuman serupa yang menimpa bani israil. Sebab ketetapan-ketetapan Allah tetap berjalan sama, tidak berubah-ubah dan tidak berganti-ganti"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Mudah-mudahan Tuhan kalian -wahai Bani Israil- akan melimpahkan rahmat kepada kalian setelah adanya bencana berat ini apabila kalian kembali bertobat dan memperbaiki amalan kalian. Namun bila kalian kembali melakukan kerusakan untuk ketiga kalinya atau lebih dari itu, niscaya Kami pasti akan kembali memberikan bencana pada kalian. Sungguh Kami menjadikan neraka Jahanam itu sebagai penjara dan tempat tinggal orang-orang yang kafir terhadap Allah, mereka tidak akan bisa membebaskan diri darinya sedikitpun."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "8. Hai para keturunan Nabi Ya’qub, semoga Tuhan kalian merahmati kalian dengan rahmat yang luas jika kalian bertaubat dari berbuat kerusakan dan berjalan di atas petunjuk. Namun jika kalian kembali kepada kerusakan dan kesesatan, Kami akan kembali menyiksa dan menindas kalian. Dan Kami jadikan neraka Jahannam sebagai tempat orang-orang kafir, mereka akan kekal di dalamnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. عَسَىٰ رَبُّكُمْ أَن يَرْحَمَكُمْ ۚ (Mudah-mudahan Tuhanmu akan melimpahkan rahmat(Nya) kepadamu) Wahai Bani Israil Mudah-mudahan Tuhanmu akan melimpahkan rahmat(Nya) kepadamu setelah Allah menghukum kalian di kali kedua. وَإِنْ عُدتُّمْ (dan sekiranya kamu kembali kepada (kedurhakaan)) Untuk yang ketiga kalinya atau seterusnya. عُدْنَا ۘ( niscaya Kami kembali (mengazabmu)) Yakni kembali menghukum kalian. وَجَعَلْنَا جَهَنَّمَ لِلْكٰفِرِينَ حَصِيرًا (dan Kami jadikan neraka Jahannam penjara bagi orang-orang yang tidak beriman) Makna (الحصير) yakni tahanan. Mereka akan ditahan didalamnya tanpa dapat membebaskan diri selama-lamanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8. Dan telah Kami firmankan dalam kitab Taurat itu: “Semoga Tuhan kalian memuliakan kalian jika mau bertaubat dan taat setelah Dia membalas kalian untuk kedua kalinya. Dan jika kalian kembali berbuat kerusakan, maka Kami akan kembalikan hukuman itu. Dan Kami jadikan neraka itu sebagai penjara bagi orang-orang kafir dan mereka tidak mampu keluar dari sana selamanya”. Al-Hadhir yaitu penjara dan tempat sempit"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mudah-mudahan Tuhan kalian melimpahkan rahmat kepada kalian. Jika kalian kembali} Jika kalian kembali berbuat kerusakan untuk ketiha kalinya {niscaya Kami kembali} maka kami kembali mengazab kalian {Kami menjadikan neraka Jahanam bagi orang-orang kafir sebagai penjara} tempat tidur dan tempat istirahat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8. “Mudah-mudahan Rabbmu akan melimpahkan rahmat(Nya) kepadamu,” kemudian Allah membalikkan kemenagan bagi kalian terhadap mereka. Lantas Allah merahmati mereka dan memberikan negeri bagi mereka disertai ancaman terhadap mereka bila berbuat maksiat-maksiat, seraya berfirman, “Dan sekiranya kamu kembali kepada (kedurhakaan ),” mengulang berbuat kerusakan di muka bumi, “niscaya Kami kembali,” mengazab kalian. Ternyata mereka kembali melakukan kerusakan di muka bumi, maka Allah (menghukum mereka dengan) menjadikan RasulNya, Muhammad berkuasa atas mereka. Allah membalas mereka lewat beliau. Ini adalah balasan mereka di dunia. Adapun siksa Allah bagi mereka di akhirat lebih dahsyat dan menghinakan. Oleh karena itu, Allah berfirman selanjutnya, “Dan Kami jadikan Neraka Jahanam penjara bagi orang-orang kafir,” mereka akan masuk dan menghuninya, tidak akan pernah keluar dari tempat itu selama-lamanya. Dalam ayat-ayat ini terdapat peringatan bagi umat Islam dari perbuatan maksiat, supaya mereka tidak tertimpa oleh siksaan yang telah menimpa Bani Israil. Ketetapan Allah hanyalah satu, dan tidak akan dirubah-rubah atau direvisi. Orang yang mau mencermati penguasaan kaum kuffar dan tindak kesewenangan mereka terhadap kaum Muslimin, tentu akan mengetahui (kesimpulan) bahwasanya itu semua sebagai hukuman bagi mereka disebabkan dosa-dosa kaum Muslimin itu sendiri. Apabila kaum Muslimin kembali melaksanakan Kitabullah dan Sunnah RasulNYa, niscaya Allah akan menjadikan mereka pengendali kekuasaan di muka bumi, dan Dia akan memberikan pertolongan kepada mereka terhadap musuh-musuhnya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (وَإِنۡ عُدتُّمۡ عُدۡنَاۚ) wa in ‘udtum ‘udnaa : jika kalian kembali berbuat kerusakan dan maksiat, Kami akan kembali menghinakan kalian. (حَصِيرًا) hashiiraa : (neraka Jahanam) mengurung dan memenjarakan mereka serta menjadi alas mereka duduk di atasnya, dan (api Jahanam) berada di atas dan bawah mereka. Makna ayat: Firman-Nya ta’ala “Mudah-mudahan Rabbmu akan merahmati kalian...” ini merupakan sebuah kebaikan yang agung seandainya mereka memintanya dengan jujur, mereka akan meraihnya. Namun, mereka berpaling dan hidup dengan menerobos syariat dan bermaksiat kepada Allah ta’ala dan rasul-Nya. Firman-Nya ta’ala “Dan jika kalian kembali...” jika kalian kembali kepada kefasikan dan perbuatan keji, Kami akan mengirimkan orang-orang yang Kami kehendaki untuk menguasai kalian, lalu Allah ta’ala memenuhi janji-Nya, sehingga rasul-Nya Muhammad shallallahu ‘alaihi wa sallam dan kaum mukminin berhasil menguasai mereka. Beliau mengusir Bani Qainuqa’ dan Bani Nadhir dari Madinah dan membunuh Bani Quraizhah, sebagaimana raja-raja Eropa menindas mereka, mengusir, menimbun mereka, dan membuat mereka mencicipi siksaan dalam waktu yang lama. Firman-Nya ta’ala “Dan Kami menjadikan Jahanam sebagai penjara bagi orang kafir.” Jika hukuman di dunia adalah dengan mereka dikuasai oleh orang-orang zalim dan direbutnya kebebasan mereka, serta membuat mereka merasakan siksaan dengan pembunuhan, penjara, dan pengusiran. Azab akhirat adalah dengan penjara dan kurungan di dalam neraka Jahanam, penjara bagi orang-orang kafir mereka tidak akan keluar darinya “untuk orang kafir” orang-orang yang mengingkari syariat Allah dan nikmat-Nya atas mereka, dengan meninggalkan hukum dan menyia-nyiakan kewajiban, malas melaksanakan sunnah, serta tenggelam dalam kelezatan dan syahwat. Pelajaran dari ayat: • Kewajiban untuk berharap hanya kepada Allah; menunggu jalan keluar dan kebaikan dari-Nya sekalipun lama. • Allah ta’ala terkadang menggabungkan untuk orang kafir antara azab dunia dan azab akhirat, begitu pula orang fasik dari kalangan kaum mukminin."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 8: Setelah menimpakan hukuman yang kedua. Ternyata orang-orang Yahudi mengulangi lagi kejahatannya dengan mendustakan Nabi Muhammad shallallahu 'alaihi wa sallam dan mengkhianati perjanjian dengan Beliau, maka Allah berikan kepada Beliau kekuasaan terhadap mereka, sehingga kelompok dari mereka, yaitu Bani Quraizhah dibunuh, sekelompok lagi yaitu Bani Nadhir diusir sebagaimana kelompok sebelumnya, yaitu Bani Qainuqa’ juga diusir. Demikian juga Allah Subhaanahu wa Ta'aala mensyari’atkan kepada Beliau pemungutan pajak dari mereka jika mereka ingin aman di bawah perlindungan pemerintah Islam. Mereka dibakar di sana dan tidak dikeluarkan daripadanya. Syaikh As Sa’diy berkata, “Dalam beberapa ayat ini terdapat peringatan terhadap umat ini untuk tidak melakukan maksiat agar mereka tidak ditimpa musibah seperti yang menimpa Bani Israil. Hal itu, karena Sunnatullah itu satu, tidak berubah dan berganti. Orang yang menyaksikan kaum kafir dan zalim menguasai kaum muslimin akan mengetahui, bahwa hal itu disebabkan dosa-dosa mereka; sebagai hukuman bagi mereka, dan bahwa jika mereka menegakkan kitab Allah dan sunnah Rasul-Nya, maka Allah akan menguatkan mereka di bumi dan menolong mereka terhadap musuh-musuh mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 8",
    "description": "Allah yang maha pengasih tidak menutup rahmat-Nya kepada siapa yang mau bertobat dari kejahatan dan kembali kepada jalan yang benar. Allah menyatakan, mudah-Mudahan tuhanmu akan melimpahkan rahmat kepadamu, setelah kali yang kedua kejahatan yang kamu lakukan, dan kamu sungguh-sungguh bertobat kepada Allah, tetapi jika kamu kembali kepada kedurhakaan dengan melakukan kejahatan lagi, niscaya kami kembali mengazabmu di dunia dan kelak di akhirat kami jadikan neraka jahanam penjara atau hamparan tempat duduk bagi orang-orang yang tidak beriman kepada Allah dan rasul-Nya. Allah menurunkan Al-Qur'an kepada nabi Muhammad agar menjadi petunjuk bagi umat manusia guna meraih keselamatan dan kebahagiaan di dunia dan akhirat. Sungguh, Al-Qur'an ini memberikan petunjuk bagi umat manusia ke jalan yang paling lurus yang mengantarkan keselamatan dan kebahagiaan mereka dan memberi kabar gembira kepada orang-orang mukmin yang mengerjakan kebajikan sebagai bukti dari keimanannya itu bahwa bagi mereka ada pahala yang besar sebagai imbalan dari iman dan apa yang diamalkannya itu."
  }
]