[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan katakanlah “wahai tuhanku, masukkanlah aku dengan cara masuk yang benar ke dalam hal-hal yang baik bagiku, dan keluarkanlah aku dengan cara keluar yang benar dari hal-hal yang buruk bagiku. Dan berikanlah kepadaku dari sisiMu hujjah yang kuat yang dengannya Engkau akan membelaku terhadap semua orang yang menentangku.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "80. Dan katakanlah -wahai Rasul-, Wahai Tuhanku! Jadikanlah semua tempat masuk dan tempat keluarku senantiasa dalam ketaatan dan keridaan-Mu, dan berikanlah kepadaku dari sisi-Mu hujah dan dalil kuat lagi jelas agar bisa memenangkanku atas musuh-musuhku."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "80-81. Hai Rasulullah, berdoalah kepada Allah: “Ya Tuhanku, masukkanlah aku ke dalam kedudukan yang Engkau kehendaki untukku yang membuatku dapat mentaati-Mu dan meraih keridhaan-Mu; dan keluarkanlah aku dari segala sesuatu yang dapat mengeluarkanku dari ketaatan dan keridhaan-Mu. Dan berilah aku dari sisi-Mu, kekuatan dan perlindungan yang dapat menolongku dari musuh-musuh-Mu.” Dan katakanlah: “Cahaya Islam telah terbit, dan kekafiran dan kesyirikan telah berlalu. Sungguh kebatilan tidak akan kekal.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "80. وَقُل رَّبِّ أَدْخِلْنِى مُدْخَلَ صِدْقٍ وَأَخْرِجْنِى مُخْرَجَ صِدْقٍ (Dan katakanlah: “Ya Tuhan-ku, masukkanlah aku secara masuk yang benar dan keluarkanlah (pula) aku secara keluar yang benar) Terdapat pendapat mengatakan bahwa ayat ini turun ketika Rasulullah diperintahkan untuk berhijrah, yakni dalam masuk kota Madinah dan keluar dari kota Makkah, memasukkan kemuliaan dan mengeluarkan kemenangan. وَاجْعَل لِّى مِن لَّدُنكَ سُلْطٰنًا نَّصِيرًا(dan berikanlah kepadaku dari sisi Engkau kekuasaan yang menolong) Yakni hujjah yang kuat yang dengannya Engkau menolongku atas orang-orang yang menyelisihiku. Pendapat lain mengatakan bahwa Rasulullah diperintahkan untuk meminta Tuhannya kekuasaan dan negara yang kuat yang menjadikannya disegani agar dapat meninggikan dan menolong agama; maka Allah menjadikan baginya negara di Madinah."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Dan itu merupakan cara masuk dan keluar yang menjadikan pemiliknya berada dalam naungan Allah SWT. Masuk dan keluar mereka selalu dengan Allah dan untuk-Nya, dan ini adalah salah satu doa terbaik yang mesti dipanjatkan oleh setiap hamba, karena jika telah berada di jalan masuk dan keluar karena Allah maka ia telah masuk dan keluar dengan cara yang benar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "80. Katakanlah wahai nabi: “Wahai Tuhanku, masukkanlah aku ke dalam Madinah atau dalam setiap urusan agama dan duniaku dalam keadaan ridha. Dan keluarkanlah aku dari Mekah atau dari sunia dengan keadaan ridha. Dan berilah aku kekuatan di sisiMu yang menyelamatkanku dari musuh-musuhMu” As-Sulthan adalah sebuah hujjah yang jelas dan An-Nashir adalah penolong yang memberi bantuan. Ibnu Abbas berkata: “Saat itu Nabi SAW berada di Mekah, kemudian diperintahkan untuk berhijrah. Lalu turunlah ayat {Wa Qul Rabbi Adkhilnii ..}”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Katakanlah,“Ya Tuhanku, masukkanlah aku dengan cara yang benar} dengan cara masuk yang diridhai yang tidak aku lihat keterpaksaan di dalamnya {dan keluarkanlah aku dengan cara yang benar} cara keluar yang diridhai, mendapat kemuliaan dan aman dari cacian {dan berikanlah aku dari sisiMu} sisiMu {kekuasaan yang dapat menolong} dalil yang jelas yang bisa menolongku dari orang orang yang menentangku"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "80. FirmanNya, “Dan katakanlah, ‘Ya Rabbku, masukanlah aku ke tempat masuk yang benar dan keluarkanlah (pula) aku ke tempat keluar yang benar,” maksudnya jadikanlah tempat masuk dan tempat keluarku semuanya dalam ketaatan dan keridhaanMu. Karena hal ini memuat sifat keikhlasan dan keselarasan dengan perintah. “Dan berikanlah kepadaku dari sisiMu kekuasaan yang menolong,” maksudnya hujjah yang nyata dan petunjuk yang pasti pada seluruh yang aku kerjakan dan aku tinggalkan. Ini adalah keadaan paling mulia yang mana Allah menempatkan hambaNya di sana. Yakni, supaya seluruh keadaannya baik dan mengarahkan kepada kedekatan pada Rabbnya. Dan supaya dia memiliki dasar petunjuk yang jelas dalam setiap keadaannya. Hal ini mencakup ilmu yang bermanfaat dan amal shalih, yaitu ilmu tentang berbagai problematika dan dalil-dalil petunjuk."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 80: Ada yang mengatakan, bahwa ayat ini turun ketika Beliau diperintahkan berhijrah. Yakni yang disenangi, di mana aku tidak melihat sesuatu yang tidak aku sukai di sana. Dari Mekah. Dari musuh-musuh-Mu. Ada yang menafsirkan, bahwa dalam ayat ini kita memohon kepada Allah agar ketika memasuki suatu ibadah dan selesai darinya dengan niat yang ikhlas dan bersih dari ria dan dari sesuatu yang merusakkan pahala serta sesuai dengan perintah. Ada pula yang menafsirkan, bahwa dalam ayat ini kita memohon kepada Allah Subhaanahu wa Ta'aala agar kita memasuki kubur dengan baik dan keluar daripadanya waktu hari berbangkit dengan baik pula. Syaikh As Sa’diy berkata, “Ini adalah keadaan paling tinggi yang diberikan Allah kepada seorang hamba, yakni semua keadaannya baik, dan mendekatkan dirinya kepada Tuhannya, dan agar dirinya pada setiap keadaan berada di atas dalil yang nyata; yakni mencakup ilmu yang bermanfaat dan dapat beramal saleh karena mengetahui masalah dan dalil-dalil.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 80",
    "description": "Dan katakanlah, wahai nabi Muhammad, ya tuhanku, masukkan aku ke tempat masuk yang benar dan dengan cara yang benar, baik dalam urusan dunia maupun akhirat, dan keluarkan pula aku ke tempat keluar yang benar dan dengan cara yang benar pula, baik dalam urusan dunia maupun akhirat, dan berikanlah kepadaku dari sisi-Mu kekuasaan yang dapat menolongku menghadapi orang yang memusuhiku. Ayat ini berkaitan dengan hijrah nabi dari mekah ke madinah. Di dalamnya terkandung perintah agar nabi memohon kepada Allah agar memasuki madinah dengan cara yang benar, dan keluar dari mekah dengan cara yang benar pula. Ada juga yang menafsirkan agar kita memasuki kubur dengan baik dan keluar darinya pada hari berbangkit dengan baik pula. Dan katakanlah wahai nabi Muhammad, kebenaran, yaitu agama yang mengajarkan tauhid kepada Allah telah datang, dan yang batil, yaitu kemusyrikan dan kekufuran kepada Allah telah lenyap. Sungguh, yang batil itu pasti lenyap, tidak dapat bertahan lama di muka bumi."
  }
]