[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan katakanlah (wahai rasul) kepada kaum musyrikin, ”telah datang islam dan telah lenyap kesyirikan. Sesungguhnya kebatilan itu tidak ada kelanggengan dan keteguhan baginya. Dan Kebenaranlah yang akan tetap kokoh lagi abadi yang tidak akan sirna.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "81. Dan katakanlah kepada orang-orang musyrik itu -wahai Rasul-, \"Islam telah datang, kemenangan yang Allah janjikan telah tiba, kekafiran dan kesyirikan telah lenyap, karena sungguh kebatilan pasti akan lenyap dan sirna, akan hancur bila berhadapan dengan kebenaran.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "81. وَقُلْ جَآءَ الْحَقُّ (Dan katakanlah: “Yang benar telah datang) Yakni kemenangan Islam yang dijanjikan Allah kepada Nabi Muhammad. وَزَهَقَ الْبٰطِلُ ۚ( dan yang batil telah lenyap”) Yakni kesyirikan telah hilang dan sirna. Imam Bukhari, Imam Muslim, dan yang lainnya mengeluarkan hadits dari Ibnu Mas’ud, ia berkata: Rasulullah memasuki kota Makkah sedangkan di sekeliling Ka’bah terdapat 360 berhala, maka Rasulullah menghancurkannya dengan tongkat yang ada di tangannya seraya berkata: “جَآءَ الْحَقُ وَزَهَقَ الْبٰطِلُ ۚإن الباطل كان زهوقا”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "81. Wahai Rasul, katakanlah ketika memasuki Mekah: “Tampaklah kebenaran, yaitu Islam dan melemahlah kebathilan, yaitu kesyirikan dan kekufuran. Sesungguhnya kebathilan itu pasti dan akan terus melemah”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Katakanlah,“Yang benar telah datang} Islam {telah lenyap} sia-sia dan lenyap {kebathilan itu} kemusyrikan {Sesungguhnya yang bathil itu pasti lenyap} akan hilang, samar dan tidak tersisa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "81. FirmanNya, “Dan katakanlah, ‘Yang benar telah datang dan yang batil telah lenyap’ ,” kebenaran adalah apa yang Allah wahyukan kepada RasulNya, Muhammad, Allah memerintahkannya untuk mengatakan dan mengumumkan, “Telah datang kebenaran yang tidak ada sesuatu pun yang menentangnya. Dan kebatilan telah lenyap.” Artinya (kebatilan) telah pudar dan pupus. “Sesungguhnya yang batil itu adalah sesuatu yang pasti lenyap,” maksudnya ini adalah sifat kebatilan. Akan tetapi, terkadang kebatilan berkuasa laris (digemari) apabila tidak dihadapi dengan kebenaran.Lalu tatkala datang kebenaran, maka kebatilan meredup dan tidak akan tersisa sama sekali. Tidaklah kebatilan itu akan laris kecuali pada waktu dan tempat yang kosong dari ilmu tentang ayat-ayat Allah dan penjelasannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 81: Nabi shallallahu 'alaihi wa sallam ketika masuk ke Mekah di hari Fathu Makkah (penaklukkan Mekah), sedangkan ketika itu di sekeliling Baitullah ada 360 patung, Beliau memukulnya dengan tongkat yang ada di tangannya dan mengucapkan ayat di atas sampai patung-patung itu jatuh. Ketika engkau masuk kembali ke Mekah. Yakni Islam atau wahyu yang diwahyukan Allah kepada Rasul-Nya Muhammad shallallahu 'alaihi wa sallam. Yakni kekfuran. Inilah sifat untuk yang batil, yakni akan lenyap. Akan tetapi, terkadang ia menjadi kuat dan laris di tengah-tengah manusia ketika tidak dilawan oleh yang hak, namun ketika yang hak datang, maka yang batil segera lenyap. Oleh karena itu, kebatilan tidaklah laris di tengah masyarakat kecuali ketika mereka berpaling dari kitabullah dan sunnah Rasul-Nya shallallahu 'alaihi wa sallam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 81",
    "description": "Dan katakanlah wahai nabi Muhammad, kebenaran, yaitu agama yang mengajarkan tauhid kepada Allah telah datang, dan yang batil, yaitu kemusyrikan dan kekufuran kepada Allah telah lenyap. Sungguh, yang batil itu pasti lenyap, tidak dapat bertahan lama di muka bumi. Dan kami turunkan Al-Qur'an kepadamu wahai nabi Muhammad, sebagai obat penawar berbagai macam penyakit hati dan rahmat bagi orang-orang yang beriman yang mengamalkan tuntunannya, sedangkan bagi orang-orang yang zalim, Al-Qur'an itu hanya akan menambah kerugian disebabkan oleh kekufuran mereka. Setiap kali mendengar bacaan alqur'an semakin bertambah kekufurannya."
  }
]