[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kami menurunkan dari ayat-ayat al-qur’an al-azhim ayat-ayat yang menyembuhkan hati dari semua penyakit, seperti keraguan, kemunafikan dan kebodohan, dan akan menyembuhkan jasmani melalui bacaan ruqyah dengannya, dan hal-hal yang menjadi penyebab teraihnya rahmat Allah melalui kandungan keimanannya. Dan tidaklah al-qur’an ini menambah bagi orang-orang kafir ketika mendengarnya, kecuali kekafiran dan kesesatan. Kaarena pendustaan mereka terhadapnya dan tidak ada keimanan dalam diri mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "82. Dan Kami turunkan dari Al-Qur`ān sesuatu yang menjadi obat penawar bagi hati dari penyakit kebodohan, kekafiran dan keraguan, dan sesuatu yang menjadi obat bagi badan bila melakukan ruqyah dengannya, juga dari Al-Qur`ān itu Kami turunkan sesuatu yang menjadi rahmat bagi orang-orang mukmin yang beramal dengannya. Dan Al-Qur`ān ini tidaklah menambah pada orang-orang kafir kecuali kebinasaan; karena mendengarkannya membuat mereka semakin dengki, semakin mendustakan dan berpaling darinya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "82. Bagian dari rahmat Allah adalah Dia menurunkan ayat-ayat al-Qur’an yang dapat menyembuhkan hati dari penyakit keraguan, kebodohan, dan kegundahan; dan ada yang dapat menyembuhkan tubuh melalui ruqyah; dan ada yang menjadi rahmat bagi orang-orang beriman karena keimanan dan hikmah yang dikandungnya. Dan jika orang-orang kafir mendengar ayat-ayat al-Qur’an hanya menambah kekafiran dan kelalaian mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "82. وَنُنَزِّلُ مِنَ الْقُرْءَانِ مَا هُوَ شِفَآءٌ (Dan Kami turunkan dari Al Quran suatu yang menjadi penawar) Yakni obat bagi hati yang dapat menghilangkan kejahilan darinya dan mengusir keraguan, syubhat, dan kesesatan. وَرَحْمَةٌ لِّلْمُؤْمِنِينَ ۙ( dan rahmat bagi orang-orang yang beriman) Karena mengandung ilmu yang bermanfaat yang meliputi urusan kebaikan keagamaan dan duniawi, dan karena dalam membacanya mentadabburinya terdapat pahala yang besar serta ampunan dan keridhaan Allah. وَلَا يَزِيدُ(dan Al Quran itu tidaklah menambah) Yakni al-Qur’an itu. الظّٰلِمِينَ(kepada orang-orang yang zalim) Yakni orang-orang yang meletakkan kedustaan pada posisi pembenaran yang harus mereka lakukan terhadap al-Qur’an. إِلَّا خَسَارًا(selain kerugian) Yakni kebinasaan, sebab bacaan al-Qur’an yang mereka dengar membuat mereka murka dan mencekik mereka dan hal ini membuat mereka semakin menambah keburukan mereka, sehingga mereka akan binasa oleh sebab hal tersebut."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Sebagian salaf mengatakan dua kemungkinan orang yang selalu bercengkrama dengan al-Qur'an: menjadi seorang yang beruntung atau sebaliknya, Allah SWT. berfirman : { وَنُنَزِّلُ مِنَ ٱلْقُرْءَانِ مَا هُوَ شِفَآءٌ وَرَحْمَةٌ لِّلْمُؤْمِنِينَ ۙ وَلَا يَزِيدُ ٱلظَّٰلِمِينَ إِلَّا خَسَارًا } \"Dan Kami turunkan dari Al Quran suatu yang menjadi penawar dan rahmat bagi orang-orang yang beriman dan Al Quran itu tidaklah menambah kepada orang-orang yang zalim selain kerugian.\" 2 ). Segala kemaksiatan yang diperbuat oleh jasad seseorang seseungguhnya itu merupakan kerusakan dan penyakit dalam dirinya, dan Allah telah menjadikan al-Qur'an sebagai penawar untuk penyakit hati. 3 ). Sesungguhnya nasihat tidak akan bermanfaat bagi hati yang telah tertutupi oleh kegelapan, sebagaimana hujan yang jatuh di tanah yang tandus tidak akan menumbuhkan apa-apa. 4 ). Seorang mutadabbir mengatakan: suatu ketika aku ditimpa suatu kecanduan kepada hal yang diharamkan, jika aku meninggalkannya seakan-akan hatiku terbelah, karenanya aku melalaikan kewajiban menuntut ilmu, maka kemudian aku bertanya kepada salah seorang Masyaikh, beliau menasihatiku dengan tiga perkara, dan hanya satu yang membuatku tersentuh: yaitu membaca kita Allah dengan tadabbur, dan memohon kesembuhan hati dari penyakit kecanduan itu, maka akupun melakukannya, dan demi Allah setalah itu aku menjadi benci dengan kecanduan itu dan akupun jiwaku kembali menjadi lebih baik."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "82. Dan telah turun kepadamu ayat dari Al-Qur’an yang merupakan obat bagi hati dari kegelisahan, kesyirikan dan kesesatan serta rahmat yang melimpah bagi orang-orang mukmin. Dan tidak memberi tambahan kepada orang-orang kafir melainkan semakin celaka dan menyimpang akibat pendustaan dan pengingkaran mereka terhadap Al-Qur’an."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kami menurunkan dari Al-Qur’an sesuatu yang menjadi obat dan rahmat bagi orang-orang mukmin, dan tidak menambah apapun bagi orang-orang zalim kecuali kerugian} kehancuran karena kekufuran mereka terhadap Al-Qur’an"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "82. Al-Quran itu mengandung penyembuh dan rahmat. Akan tetapi, kandungan ittu bukan untuk setiap orang. Itu hanya diperuntukkan bagi orang-orang beriman yang membenarkan ayat-ayatNya lagi mengetahuinya. Adapun orang-orang zhalim yang tidak membenarkan atau tidak mau mengamalkannya, maka ayat-ayat itu tidak menambah kepada mereka kecuali kerugian belaka. Hal ini karena hujjah telah tegak atas mereka. Penyembuhan yang disebutkan dalam al-Quran itu bersifat umum untuk menyembuhkan hati dari syubhat dan kebodohan, pemikiran rusak, dan penyimpangan yang buruk, serta niat yang busuk. Al-Quran mencakup ilmu yakin yang mengakibatkan syubhat dan kebodohan lenyap, (serta mengandung) nasihat dan peringatan yang dapat melenyapkan setiap syahwat yang menyelisihi perintah Allah. (Selain itu), juga untuk menyembuhkan tubuh dari rasa sakit dan gangguan-gangguannya. Adapun rahmat, maka sesungguhnya muatan al-Quran itu bersisi sebab-sebab dan sarana-sarana yang dianjurkan bagi seorang hamba untuk melakukannya. Kapan saja dia menjalankannya, maka akan memperoleh kemenangan berupa rahmat, kebahagiaan yang abadi dan pahala yang akan disegerakan ataupun ditangguhkan pembalasannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 82: Yakni obat terhadap kesesatan. Demikian pula obat bagi hati yang terkena syubhat, kebodohan, pemikiran yang batil, penyimpangan, dan niat buruk. Hal itu, karena Al Qur’an mengandung ilmu yang yakin yang dapat menyingkirkan semua syubhat dan kebodohan, dan mengandung nasehat serta peringatan yang dapat menyingkirkan semua syahwat yang bertentangan dengan perintah Allah. Demikian pula, Al Qur’an merupakan obat bagi badan yang mengalami sakit dan penderitaan. Karena di dalamnya terdapat sebab-sebab dan sarana untuk memperoleh rahmat, di mana apabila eorang hamba melakukannya, maka dia akan memperoleh rahmat, kebahagiaan yang abadi, dan pahala di dunia dan akhirat. Yakni mereka yang tidak membenarkan Al Qur'an atau tidak mengamalkannya. Karena dengan Al Qur'an, hujjah tegak terhadap mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 82",
    "description": "Dan kami turunkan Al-Qur'an kepadamu wahai nabi Muhammad, sebagai obat penawar berbagai macam penyakit hati dan rahmat bagi orang-orang yang beriman yang mengamalkan tuntunannya, sedangkan bagi orang-orang yang zalim, Al-Qur'an itu hanya akan menambah kerugian disebabkan oleh kekufuran mereka. Setiap kali mendengar bacaan alqur'an semakin bertambah kekufurannya. Dan apabila kami berikan kenikmatan kepada manusia, seperti kesehatan atau kekayaan niscaya dia berpaling tidak bersyukur kepada Allah dan menjauhkan diri dari mengingat Allah dengan sombong; dan apabila dia ditimpa kesusahan, seperti sakit atau kemiskinan niscaya dia berputus asa kehilangan harapan dari rahmat Allah."
  }
]