[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apabila kami mencurahkan kenikmatan kepada manusia sebagaimana adanya, berupa harta benda dan keafiatan, dia akan berpaling dan menjauh dari ketaatan kepada tuhannya. Dan apabila dia ditimpa kesulitan hidup seperti kemiskinan atau penyakit, maka dia menjadi manusia yang putus asa, sebab sesungguhnya dia tidak percaya terhadap karunia Allah , kecuali orang-orang yang dijaga Allah dalam kedua keadaan itu; kemudahan dan kesulitan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "83. Dan apabila Kami berikan nikmat kesenangan pada manusia, seperti nikmat kesehatan, dan kekayaan, ia berpaling untuk tidak mensyukuri dan mentaati Allah, dan bahkan menjauhi-Nya dengan sikap sombong, namun apabila ditimpa penyakit kemiskinan, atau semisalnya, maka ia akan sangat putus asa dari rahmat Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "83-84. Allah menyampaikan ketidaksempurnaan manusia kecuali jika dia berpegang teguh kepada petunjuk Allah. Jika Allah memberinya nikmat kesehatan dan kebahagiaan, dia enggan bersyukur kepada Allah dan berpaling dari ibadah dengan menyibukkan diri dengan syahwat dunia. Namun jika dia tertimpa musibah, maka dia akan menjadi orang yang berputus asa. Kemudian Allah memerintahkan Rasulullah untuk memberi peringatan orang-orang kafir dan memberi kabar gembira bagi orang-orang beriman: “Setiap kami dan kalian berbuat dan berjalan di atas jalan yang dia yakini, dan Tuhan kalian Maha Mengetahui siapa yang paling benar jalannya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "83. وَإِذَآ أَنْعَمْنَا عَلَى الْإِنسٰنِ (Dan apabila Kami berikan kesenangan kepada manusia) Dengan kenikmatan-kenikmatan yang melazimkan rasa syukur seperti kesehatan dan kekayaan. أَعْرَضَ(niscaya berpalinglah dia) Yakni berpaling dari mensyukuri dan mengingat Allah. وَنَـَٔا بِجَانِبِهِۦ ۖ( dan membelakang dengan sikap yang sombong) Yakni mengabaikan perasaannya dan memalingkan punggungnya, sehingga yang muncul dari dirinya hanyalah kesombongan dan kejauhan dirinya dari rasa syukur atas kenikmatan tersebut. وَإِذَا مَسَّهُ الشَّرُّ(dan apabila dia ditimpa kesusahan) Berupa penyakit atau kemiskinan. كَانَ يَـُٔوسًا(niscaya dia berputus asa) Yakni sangat berputus asa dari rahmat Allah. Orang seperti ini apabila mendapatkan apa yang mereka inginkan maka akan melupakan Sang Pencipta, dan apabila tidak mendapatkan keinginannya maka akan dipenuhi kesedihan dan dikuasai keputus-asaan. Dan dua sifat ini sangat buruk."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "83. Dan ketika Kami berikan nikmat kesehatan dan kebahagiaan kepada manusia, dia tidak mau bersyukur atas nikmat Tuhannya. Dan apabila penyakit dan kefakiran menimpanya, dia putus asa dari rahmat Tuhannya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apabila Kami memberi kenikmatan kepada manusia, niscaya dia berpaling dan menjauhkan diri} tidak mau bersyukur dan taat kepada Allah karena sombong {dan apabila dia ditimpa kesusahan} penderitaan dan kerugian {niscaya dia berputus asa} sangat berputus asa dari rahmat Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "83. Begitulah tabiat manusia dari sudut pandang dzatnya, kecuali orang-orang yang mendapat hidayah dari Allah. Manusia itu saat meraih kenikmatan dari Allah, maka dia bersuka cita dengannya, menyombongkan diri dengannya, berpaling dan menjauhi Rabbnya, tidak bersyukur kepadaNya dan tidak mau mengingatNya, “dan apabila dia ditimpa kesusahan,” seperti sakit atau selainnya “niscaya dia berputus asa,” dari kebaikan. Dia putus asa dari harapan (mendapatkan rahmat) Rabbnya, dan menyangka bahwasanya keadaan yang menimpanya itu akan terjadi selamanya. Adapun orang yang mendapatkan hidayah Allah, maka dia merendahkan diri dan bersyukur kepada Rabbnya tatkala mendapatkan kenikmatan. Apabila ditimpa musibah, maka dia memohon dengan merendahkan diri kepada Rabbnya dan mengharap kekuatan kepada Allah, supaya segera dihilangkan musibah yang telah menimpanya. Dengan itu, akan lebih meringankan beban cobaannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 83: Dari rahmat Allah. Inilah tabiat manusia selain orang yang diberi hidayah oleh Allah Subhaanahu wa Ta'aala, di mana mereka apabila diberi nikmat oleh Allah Subhaanahu wa Ta'aala, ia bergembira dengannya dan bersikap sombong, berpaling dan menjauh dari Tuhannya, tidak bersyukur kepada Tuhannya dan tidak menyebut-Nya. Tetapi apabila dia ditimpa kesusahan, seperti sakit, kemiskinan, dsb. ia berputus asa dari kebaikan atau dari rahmat Allah, ia memutuskan harapannya kepada Tuhannya dan mengira bahwa ia akan tetap terus seperti itu. Adapun orang yang diberi hidayah oleh Allah Subhaanahu wa Ta'aala, maka ketika memperoleh nikmat, ia tunduk kepada Tuhannya, mensyukuri nikmat-Nya, sedangkan ketika mendapat kesusahan seperti sakit, ia merendahkan diri kepada Tuhannya, mengharap kesembuhan dari-Nya dan dihilangkan dari derita itu, sehingga cobaan pun terasa ringan baginya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 83",
    "description": "Dan apabila kami berikan kenikmatan kepada manusia, seperti kesehatan atau kekayaan niscaya dia berpaling tidak bersyukur kepada Allah dan menjauhkan diri dari mengingat Allah dengan sombong; dan apabila dia ditimpa kesusahan, seperti sakit atau kemiskinan niscaya dia berputus asa kehilangan harapan dari rahmat Allah. Katakanlah wahai nabi Muhammad, setiap orang berbuat sesuai dengan keadaannya masing-masing, yakni sesuai pembawaannya, caranya dan kecenderungannya dalam mencari petunjuk dan menempuh jalan menuju kebenaran. Maka tuhanmu lebih mengetahui siapa yang lebih benar jalannya dan siapa yang lebih sesat jalannya. Kepada setiap orang dari kedua golongan itu tuhan memberikan balasan sesuai dengan perbuatannya."
  }
]