[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai rasul) kepada sekalian manusia, Tiap-tiap orang dari kalian akan berbuat sesuai dengan keadaannya. Dan tuhan kalian lebih mengetahui orang yang mendapatkan petunjuk menuju kebenaran."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "84. Katakanlah -wahai Rasul-, \"Setiap manusia beramal sesuai dengan pembawaannya masing-masing yang menyerupai keadaannya dalam hidayah atau kesesatan.\" Maka Tuhanmu lebih mengetahui siapa yang lebih benar jalannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "84. قُلْ كُلٌّ يَعْمَلُ عَلَىٰ شَاكِلَتِهِۦ (Katakanlah: “Tiap-tiap orang berbuat menurut keadaannya masing-masing”) Yakni setiap insan berperilaku sesuai dengan akhlak yang dia biasakan pada dirinya. فَرَبُّكُمْ أَعْلَمُ بِمَنْ هُوَ أَهْدَىٰ سَبِيلًا(Maka Tuhanmu lebih mengetahui siapa yang lebih benar jalannya) Yakni dalam perilakunya, apakah itu baik atau buruk."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Disebutkan dalam hadits shahih: \"semuanya telah dimudahkan terhadap apa yang diciptakan untuknya\", maka perhatikanlah kesesuaian bakat dan kemampuanmu, dan kembangkanlah untuk kamu pergunakan di jalan Allah, untuk ummatmu dan untuk keluargamu, dan janganlah berlagak seperti orang baik padahal kamu belum memberi apa-apa, sehingga kamu termasuk orang yang kelam kabut, tadabburi ayat Allah : { قُلْ كُلٌّ يَعْمَلُ عَلَىٰ شَاكِلَتِهِۦ } \"Tiap-tiap orang berbuat menurut keadaannya masing-masing\" { وَلِكُلٍّ وِجْهَةٌ هُوَ مُوَلِّيهَا ۖ فَٱسْتَبِقُوا۟ ٱلْخَيْرَٰتِ } \"Dan bagi tiap-tiap umat ada kiblatnya (sendiri) yang ia menghadap kepadanya. Maka berlomba-lombalah (dalam membuat) kebaikan\" [Al-Baqarah : 148]."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "84. Katakanlah: “Setiap manusia itu beramal sesuai kepercayaan dan jalannya dalam hidayah maupun kesesatan. Dan Tuhan kalian itu lebih tahu tentang orang yang paling benar dan paling lurus jalannya”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Katakanlah,“Setiap orang berbuat sesuai dengan pembawaannya masing-masing} cara yang sesuai dengan keadaannya baik dalam petunjuk maupun kesesatan {Maka Tuhanmu lebih mengetahui siapa yang lebih benar jalannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "84. Maksudnya, “Katakanlah, ‘Tiap-tiap orang’ ,” dari manusia “berbuat menurut keadaannya,” sesuai dengan kondisinya masing-masing. Apabila mereka termask orang-orang pilihan lagi baik, maka tidaklah sesuatu itu selaras dengan mereka melainkan pasti amalan mereka itu diperuntukkan bagi Allah, Rabbul alamin. Sedangkan orang-orang selain mereka yang tidak mendapatkan curahan hidayah, maka tidaklah ada amalan yang selaras dengan mereka melainkan pasti amalan yang tertuju untuk makhluk, dan tidaklah amalan itu sesuai dengan mereka kecuali amalan yang sejalan dengan keinginan-keinginan mereka. Dan Rabbmu “lebih mengetahui siapa yang lebih benar jalannya.” Allah lebih mengetahui siapakah yang berhak untuk mendapat hidayah, sehingga Allah memberinya hidayah, dan siapakah yang tidak berhak untuk mendapat hidayah, sehingga Allah menerlantarkannya dan tidak memberinya hidayah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 84: Dalam ayat ini terdapat ancaman terhadap orang-orang musyrik. Yakni keadaan yang sesuai baginya. Termasuk dalam pengertian keadaan di sini adalah tabiat dan pengaruh alam sekitar. Jika orang tesebut tergolong orang yang baik, maka amalan mereka dilakukan karena Allah Rabbul ‘alamin, dan jika orang tersebut tergolong orang yang buruk, maka amal mereka dilakukan karena makhluk dan tidak melakukan selain yang sesuai dengan keinginan makhluk. Dia mengetahui siapa yang cocok mendapatkan hidayah dan siapa yang tidak."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 84",
    "description": "Katakanlah wahai nabi Muhammad, setiap orang berbuat sesuai dengan keadaannya masing-masing, yakni sesuai pembawaannya, caranya dan kecenderungannya dalam mencari petunjuk dan menempuh jalan menuju kebenaran. Maka tuhanmu lebih mengetahui siapa yang lebih benar jalannya dan siapa yang lebih sesat jalannya. Kepada setiap orang dari kedua golongan itu tuhan memberikan balasan sesuai dengan perbuatannya. Dan mereka, yakni orang-orang kafir mekah bertanya kepadamu wahai nabi Muhammad tentang roh, apakah hakikat roh itu. Katakanlah, roh itu termasuk urusan tuhanku, hanya dia yang mengetahui hakikat roh itu dan tidaklah kamu wahai manusia diberi pengetahuan kecuali sedikit dibandingkan dengan keluasan objek yang diketahui atau dibandingkan dengan ilmu Allah."
  }
]