[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang kafir bertanya kepadamu tentang hakikat ruh sebagai bentuk penentangan. Maka jawablah mereka bahwa hakikat ruh dan kondisi-kondisinya termasuk perkara yang hanya Allah saja yang mengetahuinya. Dan tidaklah kalian dan sekalian manusia deberi pengetahuan kecuali sedikit saja."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "85. Dan orang-orang kafir dari kalangan Ahli Kitab bertanya kepadamu -wahai Rasul- tentang hakikat roh, maka katakanlah pada mereka, \"Tidak ada yang mengetahui hakikat roh kecuali Allah, sedangkan kalian dan semua makhluk tidaklah diberikan ilmu kecuali hanya sedikit bila dibandingkan dengan ilmu Allah -Subḥānahu wa Ta'ālā-."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "85. Hai Nabi, sebagian orang yahudi bertanya kepadamu tentang ruh, maka jawablah bahwa hakikat ruh yang sesungguhnya hanya Allah yang mengetahuinya; sedangkan manusia tidak mengetahui perkara itu, sebab manusia hanya memiliki ilmu yang sangat sedikit jika dibandingkan dengan ilmu Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "85. وَيَسْـَٔلُونَكَ عَنِ الرُّوحِ ۖ (Dan mereka bertanya kepadamu tentang roh) Yakni tentang hakikat sebenarnya dari ruh. Yaitu ruh yang menjadikan manusia hidup, Allah menciptakannya dan tidak memberitahukan kepada seorangpun tentang hakikatnya. مِنْ أَمْرِ رَبِّى (termasuk urusan Tuhan-ku) Yakni Allah menjadikan ilmu tentangnya hanya bagi-Nya, dan tidak mengabarkan tentangnya pada seorang nabipun. وَمَآ أُوتِيتُم مِّنَ الْعِلْمِ إِلَّا قَلِيلًا (dan tidaklah kamu diberi pengetahuan melainkan sedikit) Yakni ilmu yang Allah berikan kepada kalian sangatlah sedikit."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "85. Wahai, Nabi, dan mereka bertanya kepadamu tentang hakikat ruh yang merupakan sesuatu yang membuat manusia hidup. Katakanlah kepada mereka: “Ruh itu termasuk ciptaan Tuhanku. Dan kalian itu tidak tahu kecuali hanya sedikit dari ilmu Allah” Kaum Quraisy berkata kepada orang Yahudi: “Ajarilah Kami tentang sesuatu yang bisa kami tanyakan kepada laki-laki ini” lalu mereka berkata: “tanyakanlah kepadanya tentang ruh”. Lalu mereka bertanya kepadanya tentang ruh. Lalu Allah menurunkan ayat ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka bertanya kepadamu tentang ruh. Katakanlah,“Ruh itu termasuk urusan Tuhanku} ilmu Tuhanku {sedangkan kalian tidak diberi pengetahuan kecuali hanya sedikit”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "85. Ayat ini mengandung cara untuk membungkam orang-orang yang suka bertanta-tanya tentang permasalahan yang tidak dimaksudkan melainkan untuk menentang dan melumpuhkan, tidak menanyakan permasalahan yang penting. Mereka menanyakan tentang ruh yang merupakan perkara yang tersembunyi yang tidak setiap orang mengetahuinya secara baik mengenai sifat dan keadaannya. Padahal mereka itu adalah orang yang dangkal terhadap ilmu yang dibutuhkan seorang hamba. Oleh karenanya, Allah memerintahkan RasulNya untuk menjawab pertanyaan mereka dengan FirmanNya, “katakanlah , ‘Ruh itu termasuk urusan Rabbku’ ,” maksudnya termasuk dari ciptaanNya yang (jika) Allah perintahkan untuk menjadi berwujud maka jadilah ia. Pertanyaan tentang ruh tidak terlalu berfaidah, lantaran kalian tidak mengetahui ilmu lainnya (yang harus diketahui). Dalam ayat ini terdapat dalil bahwasanya apabila seseorang itu ditanya tentang suatu perkara, padahal ada hal yang lebih penting untuk diketahui si penanya, maka hendaklah dia mengalihkan jawabannya, menunjukannya dengan hal yang lebih dibutuhkan oleh si penanya dan mengarahkannya pada hal yang bermanfaaat baginya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 85: Imam Bukhari meriwayatkan dengan sanadnya yang sampai kepada Abdullah (Ibnu Mas’ud) radhiyallahu ‘anhu, ia berkata, “Ketika aku berjalan bersama Nabi shallallahu 'alaihi wa sallam di area sepi Madinah, ketika itu Beliau bersandar dengan tongkat dari pelepah daun kurma yang dibawanya, lalu Beliau melewati beberapa orang Yahudi, kemudian masing-masing mereka berkata kepada yang lain, “Bertanyalah kepadanya tentang ruh?” Sedangkan yang lain berkata, “Janganlah bertanya kepadanya, agar dia tidak membawa sesuatu yang tidak kalian suka.” Sebagian mereka berkata, “Kami sungguh akan bertanya kepadanya.” Lalu salah seorang di antara mereka bangun dan berkata, “Wahai Abul Qasim, apai itu ruh?” Beliau pun diam, maka aku (Ibnu Mas’ud) berkata (dalam hati), “Sungguh, Beliau sedang menerima wahyu.” Aku pun bangun (agar tidak mengganggunya). Setelah Beliau selesai (menerima wahyu), Beliau bersabda, “Dan mereka bertanya kepadamu (Muhammad) tentang ruh. Katakanlah, \"Ruh itu termasuk urusan Tuhanku, sedangkan kamu diberi pengetahuan hanya sedikit.” Yakni orang-orang Yahudi. Di mana dengannya jasad menjadi hidup. Dalam ayat ini terdapat larangan bertanya yang maksudnya memberatkan diri atau untuk mengalahkan dan meninggalkan bertanya terhadap hal yang penting. Bertanya tentang ruh, berarti bertanya tentang hal-hal yang samar yang tidak seorang pun manusia yang sanggup menyifatkan dengan tepat dan tentang bagaimana bentuknya. Dalam ayat ini terdapat dalil bahwa orang yang ditanya tentang sesuatu yang bagi si penanya sebaiknya bertanya tentang yang lain, maka hendaknya ia berpaling dari memberikan jawaban, menunjukkan kepadanya hal yang dibutuhkan serta mengarahkannya kepada hal yang bermanfaat baginya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 85",
    "description": "Dan mereka, yakni orang-orang kafir mekah bertanya kepadamu wahai nabi Muhammad tentang roh, apakah hakikat roh itu. Katakanlah, roh itu termasuk urusan tuhanku, hanya dia yang mengetahui hakikat roh itu dan tidaklah kamu wahai manusia diberi pengetahuan kecuali sedikit dibandingkan dengan keluasan objek yang diketahui atau dibandingkan dengan ilmu Allah. Dan sesungguhnya jika kami menghendaki, niscaya kami lenyapkan, kami hapus dari hatimu apa yang telah kami wahyukan kepadamu, wahai nabi Muhammad, dan engkau tidak akan mendapatkan seorang pembela pun terhadap keputusan kami, melenyapkan apa yang kami wahyukan kepadamu. Tetapi pelenyapan itu tidak akan terjadi, dan yang demikian itu tidak lain, ."
  }
]