[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sesungguhnya jika Kami menghendaki untuk menghapus al-qur’an dari hatimu, pastilah Kami kuasa melakukannya. Kemudian kalian tidak mendapati seorangpun penolong untuk dirimu yang mempu menghalangi dari kejadian tersebut atau mengembalikan al-qur’an kepadamu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "86. Demi Allah, jika Kami berkehendak melenyapkan semua yang telah Kami turunkan kepadamu -wahai Rasul- berupa wahyu dengan cara menghapuskannya dari dada manusia dan dari buku catatan Al-Qur`ān, niscaya Kami dengan mudah saja melenyapkannya, kemudian engkau tidak akan mendapatkan seorang penolongpun untuk membelamu dan mengembalikannya padamu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "86-87. Allah menyampaikan karunia dan rahmat-Nya dalam penurunan dan penjagaan-Nya bagi al-Qur’an untuk menarik perhatian orang-orang kafir yang berusaha merubah al-Qur’an: Allah Maha Kuasa untuk menghapus al-Qur’an dari hati Rasulullah, dan Dia bersumpah tidak ada yang dapat mencegah-Nya dalam melakukan itu; akan tetapi dengan rahmat Allah, Dia menjadikan al-Qur’an tetap dalam hati Rasulullah. Sungguh karunia Allah yang diberikan kepada Rasulullah sangat besar. Dalam ayat ini terdapat peringatan bagi orang-orang beriman agar berusaha mendapat manfaat dari al-Qur’an agar dapat meraih kebahagiaan di dunia dan di akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "86. وَلَئِن شِئْنَا لَنَذْهَبَنَّ بِالَّذِىٓ أَوْحَيْنَآ إِلَيْكَ (Dan sesungguhnya jika Kami menghendaki, niscaya Kami lenyapkan apa yang telah Kami wahyukan kepadamu) Yakni seandainya Kami menghendaki niscaya Kami akan menghapus wahyu itu dari hati dan kitab sampai tidak tersisa sedikitpun. ثُمَّ لَا تَجِدُ لَكَ بِهِۦ(dan dengan pelenyapan itu, kamu tidak akan mendapatkan) Yakni kamu tidak akan mendapatkan al-Qur’an jika Kami menghilangkannya dan menjadikan kamu lupa tentangnya. عَلَيْنَا وَكِيلًا(seorang pembelapun terhadap Kami) Yakni kamu tidak akan mendapatkan seorang yang kamu pasrahi untuk mengembalikan al-Qur’an dari Kami."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "86. Kalau berkehendak, niscaya Kami hapuskan penjagaan Al-Qur’an ini dari hati dan tulisan-tulisan. Sehinggak kamu tidak mendapati orang yang berserah diri dan mengikrarkan janji kepadamu untuk membelamu sedikitpun"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh jika Kami menghendaki, niscaya Kami lenyapkan apa yang telah Kami wahyukan kepadamu} sumpah jika Kami berkehendak sungguh Kami akan menghapus Al-Qur’an yang telah Kami wahyukan kepadamu melalui hati dan tulisan sehingga tidak ditemukan jejaknya {dan kamu tidak akan mendapatkan seorang pembela untuk dirimu terhadap Kami} penolong yang melindungimu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "86-87. Allah mengabarkan bahwa al-Quran dan wahyu yang Allah wahyukan kepada RasulNya, adalah rahmat bagi Rasul itu sendiri dan bagi para hambaNya. Hal itu adalah nikmat terbesar yang diberikan kepada RasulNya secara mutlak. Sungguh karunia yang Allah berikan kepada beliau sangat besar, tak terukur kadarnya. Maka Dzat yang telah berkenan mengutumakan kamu dengan itu, mampu untuk melenyapkannya kemudian engkau tidak dapat menjumpai orang yang mampu mengemballikannya (kepadamu) dan tidak ada seorang penolong pun yang memintakannya kepada Allah. Oleh karenanya, bergembiralah kamu dan tenanglah. Jangan risau terhadap tuduhan dusta dari orang-orang yang mendustakan dan olokan dari orang-orang sesat. Mereka telah ditawari nikmat yang paling besar, akan tetapi menolaknya disebabkan kehinaan mereka di hadapan Allah dan penelantaranNya terhadap mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 86: Allah Subhaanahu wa Ta'aala memberitahukan, bahwa Al Qur’an yang diwahyukan-Nya kepada Rasul-Nya adalah rahmat dari-Nya kepadanya dan kepada hamba-hamba-Nya. Ia merupakan nikmat terbesar yang diberikan kepada Rasul-Nya secara mutlak. Dia yang mengaruniakan nikmat itu kepadamu mampu melenyapkannya, lalu engkau tidak mendapatkan seorang yang dapat menolaknya dan membela dalam hal itu di hadapan Allah. Oleh karena itu, bergembiralah dengannya, tenteramkanlah hatimu karenanya, dan janganlah pendustaan dan olok-olokkan mereka membuatmu sedih, karena sesungguhnya kepada mereka telah disodorkan nikmat terbesar itu, namun mereka menolaknya. Dengan menghapusnya dari dada dan dari mushaf."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 86",
    "description": "Dan sesungguhnya jika kami menghendaki, niscaya kami lenyapkan, kami hapus dari hatimu apa yang telah kami wahyukan kepadamu, wahai nabi Muhammad, dan engkau tidak akan mendapatkan seorang pembela pun terhadap keputusan kami, melenyapkan apa yang kami wahyukan kepadamu. Tetapi pelenyapan itu tidak akan terjadi, dan yang demikian itu tidak lain, kecuali karena rahmat dari tuhanmu yang dicurahkan kepadamu dan semua makhluk-Nya. Sungguh, karunia-Nya atasmu, wahai nabi Muhammad, yang aku cintai dan aku pilih sebagai utusan-ku, sangat besar."
  }
]