[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Akan tetapi, Allah merahmatimu, sehingga meneguhkannya dalam hatimu. Sesungguhnya karuniaNya terhadap dirimu sangatlah besar. Dia telah menganugerahkan kepadamu al-qur’an al-azhim dan maqam mahmud (kedudukan yang terpuji) serta karunia-karunia lainnya yang tidak diberikanNya kepada seorangpun dari seluruh makhluk."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "87. Akan tetapi Kami tidaklah melenyapkannya sebagai rahmat dari Tuhanmu, bahkan membiarkannya terjaga (dalam dada dan lembaran kitab), sungguh karunia Tuhanmu kepadamu begitu besar yang mana Dia menjadikanmu sebagai Rasul, menutup para Nabi dengan dirimu, serta menurunkan kitab Al-Qur`ān kepadamu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "87. إِلَّا رَحْمَةً مِّن رَّبِّكَ ۚ (kecuali karena rahmat dari Tuhanmu) Yakni, akan tetapi Kami tidak menghendaki hal itu karena rahmat dari Tuhanmu. إِنَّ فَضْلَهُۥ كَانَ عَلَيْكَ كَبِيرًا(Sesungguhnya karunia-Nya atasmu adalah besar) Yang telah menjadikanmu seorang Rasul, menurunkan kepadamu al-Qur’an, menjadikanmu pemimpin bani Adam, memberimu kedudukan yang terpuji, dan kenikmatan lainnya yang Allah karuniakan kepadamu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "87. Akan tetapi Kami tidak mengendaki itu dan Kami tetap membuatnya terpelihara di dadamu sebagai rahmat dari Tuhanmu. Sesungguhnya keutamaanNya kepadamu itu sangat besar wahai Nabi, dengan menjadikanmu seorang rasul"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Tetapi tidak} tetapi kami tidak menginginkan itu {karena rahmat dari Tuhanmu. Sesungguhnya karuniaNya atasmu sangat besar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "86-87. Allah mengabarkan bahwa al-Quran dan wahyu yang Allah wahyukan kepada RasulNya, adalah rahmat bagi Rasul itu sendiri dan bagi para hambaNya. Hal itu adalah nikmat terbesar yang diberikan kepada RasulNya secara mutlak. Sungguh karunia yang Allah berikan kepada beliau sangat besar, tak terukur kadarnya. Maka Dzat yang telah berkenan mengutumakan kamu dengan itu, mampu untuk melenyapkannya kemudian engkau tidak dapat menjumpai orang yang mampu mengemballikannya (kepadamu) dan tidak ada seorang penolong pun yang memintakannya kepada Allah. Oleh karenanya, bergembiralah kamu dan tenanglah. Jangan risau terhadap tuduhan dusta dari orang-orang yang mendustakan dan olokan dari orang-orang sesat. Mereka telah ditawari nikmat yang paling besar, akan tetapi menolaknya disebabkan kehinaan mereka di hadapan Allah dan penelantaranNya terhadap mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 87: Yakni tidak dilenyapkan-Nya Al Qur’an itu adalah karena rahmat Allah. Karena Dia telah menurunkan Al Qur’an kepadamu, memberikan kamu maqam mahmud (lihat Al Israa’: 79), dan memberikan keutamaan lainnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 87",
    "description": "Kecuali karena rahmat dari tuhanmu yang dicurahkan kepadamu dan semua makhluk-Nya. Sungguh, karunia-Nya atasmu, wahai nabi Muhammad, yang aku cintai dan aku pilih sebagai utusan-ku, sangat besar. Katakanlah, wahai nabi Muhammad, sesungguhnya jika manusia dan jin berkumpul bersama-sama dan mengerahkan semua upaya untuk membuat yang serupa dengan Al-Qur'an ini, mereka tidak akan dapat membuat yang serupa dengannya, dalam kesempurnaan isinya dan keindahan bahasanya, sekalipun mereka saling membantu satu sama lain."
  }
]