[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah, ”seandainya bangsa jin dan manusia sepakat berusaha mendatangkan sesuatu yang serupa dengan al-qur’an yang merupakan mukjizat ini, niscaya mereka tidak sanggup mendatangkan yang semisal dengan keindahan bahasanya, maknanya dan hukumnya, walaupun mereka semua saling membantu dan saling bekerja sama untuk mewujudkannya. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "88. Katakanlah wahai Rasul, \"Sesungguhnya jika seluruh manusia dan jin berkumpul untuk membuat sesuatu yang serupa dengan Al-Qur`ān yang diturunkan kepadamu dari segi balagah atau sastranya, keindahan susunannya, dan ketepatan penempatan lafal-lafalnya, mereka tidak akan pernah sanggup membuat yang serupa dengannya sekalipun mereka saling membantu dan menolong satu sama lain.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "88. Allah menjelaskan keagungan al-Qur’an dalam kefasihan, hukum-hukum, kalimat-kalimat, dan makna-maknanya. Al-Qur’an adalah mukjizat dari Allah, dan bukan perkataan manusia. Hai Rasulullah, katakanlah kepada jin dan manusia: “Sungguh jika seluruh jin dan manusia bersepakat untuk bantu membantu dalam mendatangkan sesuatu yang setara dengan al-Qur’an dalam kefasihan dan hikmahnya, niscaya mereka tidak akan mampu melakukannya meskipun mereka telah saling tolong menolong.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "88. قُل لَّئِنِ اجْتَمَعَتِ الْإِنسُ وَالْجِنُّ عَلَىٰٓ أَن يَأْتُوا۟ بِمِثْلِ هٰذَا الْقُرْءَانِ (Katakanlah: “Sesungguhnya jika manusia dan jin berkumpul untuk membuat yang serupa Al Quran ini) Yakni al-Qur’an yang diturunkan Allah dengan kefasihan, keindahan rangkaian kata-katanya, dan keringkasan lafadz dengan kedalaman maknanya. لَا يَأْتُونَ بِمِثْلِهِۦ(niscaya mereka tidak akan dapat membuat yang serupa dengan dia) Sebab makhluk tidak akan mampu mendatangkan yang semisal dari yang didatangkan oleh Sang Pencipta. وَلَوْ كَانَ بَعْضُهُمْ لِبَعْضٍ ظَهِيرًا(sekalipun sebagian mereka menjadi pembantu bagi sebagian yang lain”) Yakni pembantu dan penolong."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "88. Katakanlah wahai Rasul: “Jikalau manusia dan jin berkumpul secara bersamaan untuk mendatangkan hal yang menyerupai Al-Qur’an ini dalam segi kesempurnaan balaghah, fashahah dan kefasihan lafaznya, niscaya mereka tidak mungkin bisa melakukannya, meskipun mereka saling membantu satu sama lain” Sebagian orang Yahudi berkata kepada Nabi SAW: “Al-Qur’an ini tidak teratur rapi seperti Taurat. Maka turunkanlah kepada kami sebuah kitab yang kami kenal. Kalau tidak, kami akan mendatangkan kepadamu sesuatu seperti yang engkau bawa.” Maka Allah menurunkan ayat ini”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Sungguh, jika manusia dan jin berkumpul untuk mendatangkan yang serupa dengan Al-Qur’an ini, mereka tidak akan dapat mendatangkan yang serupa dengannya, sekalipun mereka satu sama lain membantu} membantu dan menolong"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "88. Ini adalah dalil yang pasti dan petunjuk yang terang atas kebenaran dan kelurusan apa yang dibawa Rasulullah. Allah menantang kalangan manusia dan jin supaya mendatangkan sesuatu yang serupa dengan al-Quran. Allah memberitahukan bahwasanya mereka tidak akan pernah mampu mendatangkan sesuatu yang semisal al-Quran. Meskipun mereka saling bekerjasama untuk itu, mereka tidak akan mampu. Maka terjadilah sebagaimana yang dikabarkan Allah. Sesungguhnya motivasi-motivasi dari musuh Allah yang mendustakan al-Quran sangat banyak untuk membantah (al-Quran) yang beliau bawa dengan cara apa pun. Padahal mereka adalah orang-orang yang ahli dalam bahasa dan kefasihan. Seandainya mereka memiliki keahlian dan kemampuan sedikit saja untuk itu, tentu mereka akan melakukannya. Dengan itu bisa diketahui bahwasanya mereka itu tertunduk sangat dalam secara suka rela maupun terpaksa. Mereka itu terlalu lemah untuk mengadakan penentangan terhadap al-Quran. Bagaimana mungkin makhluk yang berasal dari tanah, memiliki kekurangan dari segala sisi, -yang tidak mempunyai ilmu, kemampuan, kemauan, keinginan, pembicaraan, dan kesempurnaan melainkan datang dari Rabbnya- dapat menantang perkataan Rabb bumi dan langit, Dzat yang memiliki kesempurnaan dan pujian yang mutlak dan kemuliaan yang agung, Dzat yang seandainya lautan itu dijadikan tinta kemudian ditambahkan lagi tujuh lautan sebagai tambahan dan seluruh pepohonan dijadikan pena untuk menuliskan kalimat-kalimatNya, tentulah tinta-tinta itu akan habis dan pena-pena rusak, sementara kalimat-kalimatNya belum selesai dituliskan? Sebagaimana tidak ada satu makhluk pun yang menyerupai Allah dalam sifat-sifatNYa, maka perkataanNya termasuk sifat-sifat Allah yang tidak ada seorangpun yang dapat menyerupai Allah di dalamnya. Tidak ada sesuatu pun yang menyerupaiNya, baik dalam dzat, sifat, nama maupun perbuatanNYa. Maka celakalah orang yang menyamakan Kalamulllah dengan perkataan makhluk dan menyangkan bahwa Muhammad-lah yang mengada-adakan hal itu atas Nama Allah dan membuatnya sendiri."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 88: Ayat ini merupakan bukti kebenaran Al Qur’an, di mana Allah menantang manusia dan jin untuk mendatangkan yang serupa dengan Al Qur’an, dan Dia memberitahukan, bahwa mereka tidak mampu membuatnya meskipun mereka saling bantu-membantu. Ayat ini turun untuk membantah perkataan orang-orang kafir, “Jika kami mau, kami mampu berkata seperti ini.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 88",
    "description": "Katakanlah, wahai nabi Muhammad, sesungguhnya jika manusia dan jin berkumpul bersama-sama dan mengerahkan semua upaya untuk membuat yang serupa dengan Al-Qur'an ini, mereka tidak akan dapat membuat yang serupa dengannya, dalam kesempurnaan isinya dan keindahan bahasanya, sekalipun mereka saling membantu satu sama lain. Dan sungguh, Allah bersumpah, kami telah menjelaskan kepada manusia dalam Al-Qur'an ini dengan bermacam-macam perumpamaan, yakni dengan bermacam-macam cara dan gaya bahasa, seperti penyampaian kebenaran dengan disertai bukti-bukti, dengan janji dan ancaman, kisah dan perumpamaan yang disampaikan berulang-ulang agar manusia beriman, tetapi kebanyakan manusia tidak menyukainya bahkan mengingkarinya. Mereka tidak tersentuh hatinya sedikit pun untuk dapat menerima tuntunan Al-Qur'an walaupun disampaikan dengan bermacam-macam cara dan gaya bahasa karena kesombongan dan kedengkian mereka."
  }
]