[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sungguh Kami telah menjelaskan dan memvariasikan perumpamaan-perumpamaan dalam al-qur’an yang semestinya dapat dijadikan sumber pelajaran sebagai bentuk hujjah di hadapan mereka, agar mereka mau mengikuti dan mengamalkannya. Namun kebanyakan manusia enggan (bersikap) kecuali untuk menolak kebenaran dan mengingkari hujjah-hujjah Allah dan dalil-dalil kebenaranNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "89. Dan sungguh Kami telah menjelaskan berulang-ulang kepada manusia dalam Al-Qur`ān ini, dengan menyebutkan berbagai macam pelajaran berupa mauizah, pelajaran, perintah, larangan dan kisah-kisah agar mereka beriman, tetapi kebanyakan manusia malah membangkang dan ingkar terhadap Al-Qur`ān ini."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "89. Sungguh Kami telah jelaskan kepada para hamba berbagai perumpamaan dalam al-Qur’an dengan segala cara, baik itu dari sisi hukum, ibrah, dan kisah; akan tetapi kebanyakan manusia mengingkari perumpamaan-perumpamaan tersebut."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "89. وَلَقَدْ صَرَّفْنَا لِلنَّاسِ فِى هٰذَا الْقُرْءَانِ مِن كُلِّ مَثَلٍ (Dan sesungguhnya Kami telah mengulang-ulang kepada manusia dalam Al Quran ini tiap-tiap macam perumpamaan) Yakni Kami ulang-ulang wahyu ini dengan segala perumpamaannya yang menuntut untuk diambil pelajarannya, baik itu tentang mukjizat, ibrah, targhib dan tarhib, perintah dan larangan, kisah-kisah orang terdahulu, surga, neraka, dan hari kiamat. Dan Kami mengulangi maknanya dengan metode yang berbeda agar mereka mau beriman karena bisa jadi sebagian metode penyampaian dapat memberi pengaruh pada orang kafir jika memang sebagian lainnya belum dapat memberi pengaruh. فَأَبَىٰٓ أَكْثَرُ النَّاسِ إِلَّا كُفُورًا(tapi kebanyakan manusia tidak menyukai kecuali mengingkari(nya)) Bahkan mereka malah mengingkari al-Qur’an sebagai firman Allah setelah ditegakkan hujjah atas mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "89. Dan sungguh telah Kami jelaskan kepada manusia dalam Al-Qur’an ini beragam jenis penjelasan untuk menunkan kepada kebenaran dan Kami ulang-ulang makna-maknanya dalam bentuk yang berbeda-beda supaya mereka beriman dan beristiqamah. Kami juga telah datang dengan memberi kabar gembira, peringatan, dan kisah-kisah orang-orang yang hidup pertama agar manusia mendahulukan amal baik dan wapada tehadap kelalaian. Namun kebanyakan manusia dari penduduk Mekah dan lainnya tidak mau, melainkan menyimpang dari kebenaran dan mengingkari bahwa turunnya Al-Qur’an itu dari sisi Allah. Firmannya {min kulli matsal} maksudnya adalah dari tiap-tiap makna, yaitu seperti perumpamaan dalam hal keanehan dan pengaruhnya bagi jiwa"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sungguh Kami telah menjelaskan berulang-ulang} menerangkan dan menjelaskan {kepada manusia segala perumpamaan kepada manusia dalam Al-Qur’an ini, tetapi kebanyakan manusia tidak menginginkannya kecuali ingkar} ingkar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "89-93. Allah berfirman, “Dan sesungguhnya Kami telah mengulang-ulang kepada manusia dalam al-Quran ini tiap-tiap macam perumpamaan,” maksudnya Kami telah memvariasikan nasihat-nasihat dan perumpamaan-perumpamaan. Kami mengulang-ulangi maknanya supaya para hamba itu bisa mengambil pelajaran, sehingga mereka akan menjadi ingat dan takut kepada Allah. Akan tetapi, hanya sedikit dari mereka yang ingat. Yaitu orang-orang yang telah Allah tetapkan dengan kebahagiaan dan membantu mereka dengan taufikNya. Adapun kebanyakan manusia, maka mereka enggan berbuat kecuali mengingkari kenikmatan yang sangat besar dari segala besar dari segala sisi. Mereka menampik tanda-tanda kebesaran Allah terhadap beliau dengan usulan ayat-ayat yang mereka buat sendiri yang zhalim lagi bodoh. Mereka berkata kepada Rasulullah yang datang membawa al-Quran yang penuh dengan petunjuk dan ayat-ayatNya, “Kami sekali-kali tidak percaya kepadamu hingga kamu memancarkan mata air dari bumi untuk kami,” yaitu sungai yang mengalir, “atau kamu mempunyai sebuah kebun kurma dan anggur,” sehingga kamu tidak perlu berjalan bolak-bail keluar masuk pasar “atau kamu jatuhkan langit berkeping-keping atas kami, sebagaimana kamu katakan,” sebagai bagian dari azab “atau kamu datangkan Allah dan malaikat-malaikat berhadapan dan dapat dilihat langsung, mempersaksikan kebenaran risalah yang engkau bawa. “Atau kamu mempunyai sebuah rumah dari emas,” yaitu rumah yang berhiaskan emas dan benda mulia lainnya “atau kamu naik ke langit,” dengan cara naik yang bisa disaksikan indera “dan” meskipun demikian “kami sekali-kali tidak akan mempercayai kenaikanmu itu hingga kamu turunkan atas kami sebuah Kitab yang kami baca.” Maka ketika penentangan, upaya-upaya pelumpuhan, dan perkataan orang yang paling bodoh dan paling zhalim ini mengandung penolakan terhadap kebenaran, sikap kurang ajar terhadap Allah, dan (pemaksaan) terhadap Rasulullah supaya mendatangkan ayat-ayat, maka Allah memerintahkan beliau supaya menyucikanNya. Allah berfirman, “Katakanlah, ‘Mahasuci Rabbku’,” dari perkataan kalian (yang rusak) dengan penyucian yang setinggi-tingginya. Mahasuci Allah dari menjadikan hukum-hukum dan ayat-ayatNya mengikuti hawa nafsu mereka yang rusak dan pemikiran mereka yang sesat. “Bukankah aku ini melainkan (hanya) seorang manusia yang menjadi rasul?” yang tidak memiliki kekuasaan sama sekali."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 89: Setiap perumpamaan dimaksudkan agar mereka memetik hikmahnya, namun ternyata tidak ada yang mau memetik hikmahnya dan merubah sikapnya selain sebagian kecil di antara mereka yang telah ditetapkan dahulu sebagai orang-orang yang berbahagia, yang diberi taufik oleh Allah Subhaanahu wa Ta'aala kepada kebaikan. Sedangkan mayoritas manusia bersikap ingkar terhadap nikmat yang besar itu (yakni Al Qur’an), bahkan mereka menyusahkan diri mereka dengan meminta didatangkan ayat yang lain selain daripada Al Qur’an yang sesuai keinginan diri mereka yang zalim lagi jahil (bodoh)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 89",
    "description": "Dan sungguh, Allah bersumpah, kami telah menjelaskan kepada manusia dalam Al-Qur'an ini dengan bermacam-macam perumpamaan, yakni dengan bermacam-macam cara dan gaya bahasa, seperti penyampaian kebenaran dengan disertai bukti-bukti, dengan janji dan ancaman, kisah dan perumpamaan yang disampaikan berulang-ulang agar manusia beriman, tetapi kebanyakan manusia tidak menyukainya bahkan mengingkarinya. Mereka tidak tersentuh hatinya sedikit pun untuk dapat menerima tuntunan Al-Qur'an walaupun disampaikan dengan bermacam-macam cara dan gaya bahasa karena kesombongan dan kedengkian mereka. Dan mereka orang-orang musyrik mekah berkata, kami tidak akan percaya kepadamu wahai Muhammad sebelum engkau memancarkan dengan deras mata air dari bumi dan mengalirkannya secara terus-menerus untuk kami, ."
  }
]