[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "9-10. Sesungguhnya al-qur’an yang kami turunkan kepada hamba kami Muhammad ini, menunjukan manusia kepada jalan terbaik, yaitu ajaran islam, membawa kabar gembira bagi kaum mukmin yang mengamalkan apa yang diperintahkan Allah kepada mereka dan berhenti dari perkara yang Allah larang mereka darinya, bahwa sesunggguhnya bagi mereka pahala yang besar dan bahwa sesungguhnya orang-orang yang tidak mempercayai kehidupan akhirat dan segala balasan yang ada di sana, maka kami sediakan bagi mereka siksaan yang menyakitkan di neraka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Sungguh kitab Al-Qur`ān yang diturunkan kepada Muhammad -ṣallallāhu 'alaihi wa sallam- ini memberikan petunjuk ke jalan yang paling baik yaitu jalan Islam, dan memberikan kabar gembira pada orang-orang mukmin yang beramal saleh, berupa pahala dan ganjaran yang besar di sisi Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "9-10. Allah menyampaikan keagungan al-Qur;an dan perannya dalam memajukan kehidupan manusia; al-Qur’an selalu memberi petunjuk yang paling baik dalam menyelesaikan perkara-perkara besar, dan yang paling utama adalah perkara dalam agama Islam. Dan al-Qur’an memberi kabar gembira bagi orang-orang yang beriman kepada Allah dan para rasul-Nya yang senantiasa melakukan amal shalih bahwa mereka akan mendapatkan pahala yang besar di surga, dan Kami telah menyiapkan azab yang pedih bagi orang-orang kafir."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. إِنَّ هٰذَا الْقُرْءَانَ يَهْدِى لِلَّتِى هِىَ أَقْوَمُ (Sesungguhnya Al Quran ini memberikan petunjuk kepada (jalan) yang lebih lurus) Yakni kepada agama Islam yang didalamnya terkandung hal yang paling lurus yaitu mentauhidkan Allah dan mengimani rasul-rasul-Nya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Kedatangan ayat : { إِنَّ هَٰذَا الْقُرْآنَ يَهْدِي لِلَّتِي هِيَ أَقْوَمُ } setelah firman Allah { وَءَاتَيْنَا مُوسَى ٱلْكِتَٰبَ وَجَعَلْنَٰهُ هُدًى لِّبَنِىٓ إِسْرَٰٓءِيلَ } sebagai bayan bahwa petunjuk yang diberikan al-Qur'an, lebih lurus dan sempurna daripada kitab-kitab yang turun sebelumnya, walaupun petunjuk yang juga diberkan kitab-kitab itu menuju jalan yang lurus, namun kesempurnaan al-Qur'an lebih besar. 2 ). Ibnu Taimiyyah dalam bantahannya kepada penganut filsafat, beliau memberikan komentar dengan menggunakan ayat ini : { إِنَّ هَٰذَا الْقُرْآنَ يَهْدِي لِلَّتِي هِيَ أَقْوَمُ } \"Sesungguhnya Al Quran ini memberikan petunjuk kepada (jalan) yang lebih lurus\" namun berbeda bagi penganut filsafat justru keyakinan mereka membawa mereka kepada jalan yang jauh dari pertolongan Allah. 3 ). Syaikh bin Baz ditanya tentang kitab-kitab yang beliau rekomendasikan dalam bidang akidah, beliau menjawab : \"sebaik-baiknya buku dalam bidang ini adalah kitabullah al-Qur'an, di dalamnya terdapat sebaik-baiknya petunjuk dan cahaya, maka bersandarlah kalian kepadanya. Kemudian Syaikh mengisyaratkan kepada buku-buku ahlussunnah, kemudian perhatikan isyarat yang keluar dari hati seorang mutadabbir di bawah ini. 4 ). Seorang Syaikh menceritakan, Syaikh Abdul 'Aziz as-Salman menceritakan menceritakan kepadaku: \"suatu ketika aku membaca firman Allah { إِنَّ هَٰذَا الْقُرْآنَ يَهْدِي لِلَّتِي هِيَ أَقْوَمُ } kemudian aku mencoba untuk mengamati setiap makna yang terkandung di dalamnya, akhirnya aku ber'azam untuk terus membaca ayat-ayat al-QUr'an sehingga dengannya aku mendapat beberapa petunjuk dari al-Qur'an yang lebih besar, dan seringkali aku menulis beberapa faidah dan petunjuk yang yang Allah bukakan untuk dari al-Qur'an ini, dan hasilnya adalah kitab yang tersusun dalam bentuk dua jilid yang berjudul \"al-Anwar as-Sathi'at Li Ayat Jami'at\". 5 ). Sebaik-baiknya perubahan dalam sejarah kehidupan ummat manusia adalah apa yang diberlakukan oleh Allah melalui tangan-tangan para nabi-Nya, dan sebaik-baik perintah adalah apa yang dituliskan dalam kitab yang dibawakan oleh sebaik-baiknya utusan Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9. Sesungguhnya Al-Qur’an ini menuntun menuju jalan dan keadaan yang lurus, yaitu mengesakan Allan, keimanan dan Islam. Dan memberi kabar gembira bagi orang-orang mukmin dengan risalah keesaan, yaitu orang-orang yang mengerjakan amal shalih yang diperintahkan oleh Allah dan sesungguhnya bagi mereka itu pahala yang agung. Al-Qur’an itu juga memberi dua kabar gembira: yaitu tentang pahala mereka dan hukuman bagi musuh-musuh mereka yaitu apa yang terkandung dalam ayat selanjutnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya Al-Qur’an ini memberi petunjuk ke (jalan) yang paling lurus} paling benar dan paling lurus {dan memberi kabar gembira kepada orang-orang mukmin yang mengerjakan kebajikan bahwa bagi mereka ada pahala yang sangat besar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9-10. Allah mengabarkan tentang kemuliaan dan keagungan al-Quran, bahwasanya ia “memberikan petunjuk kepada (jalan) yang lebih lurus,” lebih adil dan mulia dalam aspek akidah, amal perbuatan, maupun akhlak. Barangsiapa yang meraih petunjuk dengan seruan ajaran al-Quran, maka dialah manusia yang paling sempurna, paling lurus dan paling sarat dengan petunjuk dalam segala urusannya “dan memberi kabar gembira kepada orang-orang Mukmin yang mengerjakan amal shalih,” yang berbentuk kewajiban-kewajiban maupun perbuatan-perbuatan yang bersifat sunnah “bahwa bagi mereka ada pahala yang besar.” Allah telah menyediakannya bagi mereka di tempat kemuliaanNya (surga), yang tidak ada yang mengetahui karakteristiknya kecuali Allah. “Dan bahwa orang-orang yang tidak beriman kepada kehidupan akhirat, Kami sediakan bagi mereka azab yang pedih.” Al-Quran mengandung kabar gembira dan ancaman, serta cara-cara perolehan kabar gembira itu, yaitu (dengan cara) beriman dan beramal shalih, dan sebab-sebab yang memastikan (datangnya) ancaman yaitu (dengan melakukan) perkara yang berlawanan dengannya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (لِلَّتِي هِيَ أَقۡوَمُ) lillatii hiya aqwam : menuju jalan yang paling lurus dan benar. (أَنَّ لَهُمۡ أَجۡرٗا كَبِيرٗا) anna lahum ajran kabiiraa : yaitu surga Darussalam. Makna ayat: Allah ta’ala mengabarkan bahwa Al-Qur’anul Karim yang diturunkan kepada rasul-Nya Muhammad shallallahu ‘alaihi wa sallam, yang telah Dia perjalankan dari Masjidil Haram menuju Masjidil Aqsha, untuk memberi petunjuk dari apa yang terjadi di dalamnya berupa: bukti (hujjah), syariat, dan nasehat menuju jalan yang lebih lurus dari jalan-jalan yang ada. Jalan itu adalah Islam; jalan kebahagiaan dan kesempurnaan di dunia dan akhirat. “Dan memberikan kabar gembira untuk orang-orang yang beriman lagi beramal saleh...” Al-Qur’an memberikan kabar gembira kepada orang-orang yang beriman kepada Allah, rasul-Nya, pertemuan dengan-Nya, janji, dan ancaman-Nya kemudian beramal saleh, baik wajib maupun sunnah, juga meninggalkan dosa-dosa besar dan maksiat, bahwa untuk mereka pahala yang besar yaitu surga. Pelajaran dari ayat: • Penjelasan keutamaan Al-Qur’an, bahwa ia memberikan petunjuk menuju Islam; jalan kebahagiaan bagi manusia. • Janji dan ancaman, kabar gembira bagi mukmin yang beramal saleh dan peringatan bagi orang kafir mengenai datangnya hari akhir. • Penjelasan keadaan manusia sebelum mereka berhias dengan adab qurani dan akhlak nabawiyah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 9: Di ayat ini, Allah Subhaanahu wa Ta'aala menerangkan kemuliaan Al Qur’an dan keagungannya. Baik dalam ‘aqidah, amal maupun akhlak. Oleh karena itu, orang yang mengambil petunjuk darinya, maka ia akan menjadi orang yang sempurna, lurus dan mendapat petunjuk. Yaitu amalan yang wajib maupun yang sunat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 9",
    "description": "Allah menurunkan Al-Qur'an kepada nabi Muhammad agar menjadi petunjuk bagi umat manusia guna meraih keselamatan dan kebahagiaan di dunia dan akhirat. Sungguh, Al-Qur'an ini memberikan petunjuk bagi umat manusia ke jalan yang paling lurus yang mengantarkan keselamatan dan kebahagiaan mereka dan memberi kabar gembira kepada orang-orang mukmin yang mengerjakan kebajikan sebagai bukti dari keimanannya itu bahwa bagi mereka ada pahala yang besar sebagai imbalan dari iman dan apa yang diamalkannya itu. Dan memberi kabar buruk serta ancaman bahwa sesungguhnya orangorang yang tidak beriman kepada kehidupan akhirat, kami sediakan bagi mereka kelak di hari kiamat azab yang pedih yaitu neraka."
  }
]