[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ketika al-qur’an membungkam kaum musyrikin dan mengalahkan mereka, maka merekapun mulai meminta-minta mukjizat-mukjizat sesuai dengan hawa nafsu mereka. Mereka berakta, ”kami tidak akan mempercayaimu (wahai Muhammad), dan mengamalkan apa yang engkau sampaikan sampai engkau dapat memancarkan dari tanah makkah mata air yang mengalir."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "90. Dan orang-orang musyrik itupun berkata, \"Kami tidak akan beriman kepadamu (wahai Muhammad) sehingga engkau memancarkan untuk kami satu mata air yang terus-menerus mengalir dari tanah Makkah ini."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "90-93. Orang-orang kafir itu terus mengingkari dan meminta berbagai permintaan kepada Nabi yang menunjukkan kebebalan dan kelalaian mereka, sebagaimana dijelaskan dalam empat ayat yang akan disebutkan ini: Mereka berkata: “Kami tidak akan beriman kepadamu hingga kamu dapat memancarkan mata air di kota Makkah ini, hingga kamu memiliki kebun yang penuh dengan pohon kurma dan anggur sedangkan sungai-sungai mengalir dengan deras di bawah pohon-pohon itu, hingga kamu menjatuhkan langit berpotong-potong kepada kami, hingga kamu mendatangkan Allah dan para malaikat kepada kami agar kami dapat melihat mereka, hingga kamu memiliki istana berlapis emas, atau hingga kamu naik ke langit dengan tangga, dan kami tidak akan mempercayai naikmu ke langit hingga kamu mendatangkan kitab dari Allah yang terpampang di depan kami sehingga kami dapat membacanya.” Katakanlah kepada mereka: “Maha Suci Allah! Aku hanyalah seorang Rasul yang diutur Allah kepada kalian.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "90. وَقَالُوا۟ لَن نُّؤْمِنَ لَكَ (Dan mereka berkata: “Kami sekali-kali tidak percaya kepadamu) Yakni para pemimpin penduduk Makkah berkata. حَتَّىٰ تَفْجُرَ لَنَا مِنَ الْأَرْضِ يَنۢبُوعًا(hingga kamu memancarkan mata air dan bumi untuk kami) Makna (الينبوع) yakni mata air yang deras yang senantiasa mengalir tanpa terputus."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "90. Para pemimpin musyrik Mekah berkata: “Kami tidak akan pernah beriman kepadamu sampai kamu bisa memancarkan sumber-sumber mata air yang mengalir tanpa henti untuk kami.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka berkata,“Kami tidak akan percaya kepadamu sehingga kamu memancarkan untuk kami dari bumi} tanah Mekkah {mata air yang mengalir} mata air yang mengalir yang tidak akan habis airnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "89-93. Allah berfirman, “Dan sesungguhnya Kami telah mengulang-ulang kepada manusia dalam al-Quran ini tiap-tiap macam perumpamaan,” maksudnya Kami telah memvariasikan nasihat-nasihat dan perumpamaan-perumpamaan. Kami mengulang-ulangi maknanya supaya para hamba itu bisa mengambil pelajaran, sehingga mereka akan menjadi ingat dan takut kepada Allah. Akan tetapi, hanya sedikit dari mereka yang ingat. Yaitu orang-orang yang telah Allah tetapkan dengan kebahagiaan dan membantu mereka dengan taufikNya. Adapun kebanyakan manusia, maka mereka enggan berbuat kecuali mengingkari kenikmatan yang sangat besar dari segala besar dari segala sisi. Mereka menampik tanda-tanda kebesaran Allah terhadap beliau dengan usulan ayat-ayat yang mereka buat sendiri yang zhalim lagi bodoh. Mereka berkata kepada Rasulullah yang datang membawa al-Quran yang penuh dengan petunjuk dan ayat-ayatNya, “Kami sekali-kali tidak percaya kepadamu hingga kamu memancarkan mata air dari bumi untuk kami,” yaitu sungai yang mengalir, “atau kamu mempunyai sebuah kebun kurma dan anggur,” sehingga kamu tidak perlu berjalan bolak-bail keluar masuk pasar “atau kamu jatuhkan langit berkeping-keping atas kami, sebagaimana kamu katakan,” sebagai bagian dari azab “atau kamu datangkan Allah dan malaikat-malaikat berhadapan dan dapat dilihat langsung, mempersaksikan kebenaran risalah yang engkau bawa. “Atau kamu mempunyai sebuah rumah dari emas,” yaitu rumah yang berhiaskan emas dan benda mulia lainnya “atau kamu naik ke langit,” dengan cara naik yang bisa disaksikan indera “dan” meskipun demikian “kami sekali-kali tidak akan mempercayai kenaikanmu itu hingga kamu turunkan atas kami sebuah Kitab yang kami baca.” Maka ketika penentangan, upaya-upaya pelumpuhan, dan perkataan orang yang paling bodoh dan paling zhalim ini mengandung penolakan terhadap kebenaran, sikap kurang ajar terhadap Allah, dan (pemaksaan) terhadap Rasulullah supaya mendatangkan ayat-ayat, maka Allah memerintahkan beliau supaya menyucikanNya. Allah berfirman, “Katakanlah, ‘Mahasuci Rabbku’,” dari perkataan kalian (yang rusak) dengan penyucian yang setinggi-tingginya. Mahasuci Allah dari menjadikan hukum-hukum dan ayat-ayatNya mengikuti hawa nafsu mereka yang rusak dan pemikiran mereka yang sesat. “Bukankah aku ini melainkan (hanya) seorang manusia yang menjadi rasul?” yang tidak memiliki kekuasaan sama sekali."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 90: Kepada Rasulullah shallallahu 'alaihi wa sallam yang datang membawa Al Qur’an yang penuh dengan bukti dan mukjizat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 90",
    "description": "An mereka orang-orang musyrik mekah berkata, kami tidak akan percaya kepadamu wahai Muhammad sebelum engkau memancarkan dengan deras mata air dari bumi dan mengalirkannya secara terus-menerus untuk kami, atau engkau mempunyai di negeri mekah ini sebuah kebun kurma dan anggur yang luas tanahnya dan indah pemandangannya, lalu engkau alirkan di celah-celahnya, yakni dicelah-celah kebun itu sungai-sungai yang deras alirannya, ."
  }
]