[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Atau engaku jatuhkan langit dalam kepingan-kepingan kecil kepada kami sebagaimana engkau klaim, atau engkau datangkan Allah dan malaikatNya kepaada kami sehingga kami dapat menyaksikan mereka di depan kami dengan mata kepala kami."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "92. Atau sampai langit menjatuhkan azab kepada kami sebagaimana yang engkau ancamkan, atau hingga engkau mendatangkan Allah dan para Malaikat-Nya secara nyata, agar mereka sendirilah yang bersaksi tentang kebenaran wahyu yang engkau klaim."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "92. أَوْ تُسْقِطَ السَّمَآءَ كَمَا زَعَمْتَ عَلَيْنَا كِسَفًا (atau kamu jatuhkan langit berkeping-keping atas kami sebagaimana kamu katakan) Yakni terpecah belah. أَوْ تَأْتِىَ بِاللهِ وَالْمَلٰٓئِكَةِ قَبِيلًا(atau kamu datangkan Allah dan malaikat-malaikat berhadapan muka dengan kami) Yakni terlihat dengan mata kepala sehingga Kami dapat melihat mereka dengan mata kami dan mereka menghadap kepada kami. Pendapat lain mengatakan yakni agar didatangkan malaikat sesuai golongannya masing-masing secara bergantian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "92. Atau kamu memohon agar diturunkan sebagian potongan dari langit sebagaimana yang kamu anggap dan akui sebagai ancaman Allah kepada Kami, atau kamu mendatangkan Allah supaya kami bisa melihatNya dengan mata telanjang, serta malaikat supaya Kami bisa melihatnya langsung dalam kumpulan-kumpulan yang mana mereka bersaksi untukmu atas kebenaran risalahmu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Atau kamu menjatuhkan langit berkeping-keping} berkeping-keping {kepada kami, sebagaimana kamu telah mengatakannya, atau kamu datangkan Allah dan para malaikat berhadapan muka dengan kami} berpandangan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "89-93. Allah berfirman, “Dan sesungguhnya Kami telah mengulang-ulang kepada manusia dalam al-Quran ini tiap-tiap macam perumpamaan,” maksudnya Kami telah memvariasikan nasihat-nasihat dan perumpamaan-perumpamaan. Kami mengulang-ulangi maknanya supaya para hamba itu bisa mengambil pelajaran, sehingga mereka akan menjadi ingat dan takut kepada Allah. Akan tetapi, hanya sedikit dari mereka yang ingat. Yaitu orang-orang yang telah Allah tetapkan dengan kebahagiaan dan membantu mereka dengan taufikNya. Adapun kebanyakan manusia, maka mereka enggan berbuat kecuali mengingkari kenikmatan yang sangat besar dari segala besar dari segala sisi. Mereka menampik tanda-tanda kebesaran Allah terhadap beliau dengan usulan ayat-ayat yang mereka buat sendiri yang zhalim lagi bodoh. Mereka berkata kepada Rasulullah yang datang membawa al-Quran yang penuh dengan petunjuk dan ayat-ayatNya, “Kami sekali-kali tidak percaya kepadamu hingga kamu memancarkan mata air dari bumi untuk kami,” yaitu sungai yang mengalir, “atau kamu mempunyai sebuah kebun kurma dan anggur,” sehingga kamu tidak perlu berjalan bolak-bail keluar masuk pasar “atau kamu jatuhkan langit berkeping-keping atas kami, sebagaimana kamu katakan,” sebagai bagian dari azab “atau kamu datangkan Allah dan malaikat-malaikat berhadapan dan dapat dilihat langsung, mempersaksikan kebenaran risalah yang engkau bawa. “Atau kamu mempunyai sebuah rumah dari emas,” yaitu rumah yang berhiaskan emas dan benda mulia lainnya “atau kamu naik ke langit,” dengan cara naik yang bisa disaksikan indera “dan” meskipun demikian “kami sekali-kali tidak akan mempercayai kenaikanmu itu hingga kamu turunkan atas kami sebuah Kitab yang kami baca.” Maka ketika penentangan, upaya-upaya pelumpuhan, dan perkataan orang yang paling bodoh dan paling zhalim ini mengandung penolakan terhadap kebenaran, sikap kurang ajar terhadap Allah, dan (pemaksaan) terhadap Rasulullah supaya mendatangkan ayat-ayat, maka Allah memerintahkan beliau supaya menyucikanNya. Allah berfirman, “Katakanlah, ‘Mahasuci Rabbku’,” dari perkataan kalian (yang rusak) dengan penyucian yang setinggi-tingginya. Mahasuci Allah dari menjadikan hukum-hukum dan ayat-ayatNya mengikuti hawa nafsu mereka yang rusak dan pemikiran mereka yang sesat. “Bukankah aku ini melainkan (hanya) seorang manusia yang menjadi rasul?” yang tidak memiliki kekuasaan sama sekali."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 92",
    "description": "Atau engkau jatuhkan langit berkeping-keping atas kami, sebagaimana engkau katakan dalam ancamanmu kepada kami, atau engkau datangkan Allah dan para malaikat datang ke muka bumi berhadapan muka dengan kami, dan kami pun melihatnya dengan mata kepala, atau engkau mempunyai sebuah rumah yang terbuat dari emas, atau kami lihat engkau naik ke langit tingkat demi tingkat. Dan kami tidak akan mempercayai kenaikanmu ke langit itu sebelum engkau turunkan kepada kami sebuah kitab untuk kami baca. Katakanlah, wahai nabi Muhammad, mahasuci tuhanku, bukankah aku ini hanya seorang manusia yang menjadi rasul' aku hanya diutus untuk menyampaikan wahyu Allah kepadamu, dan tidak ada kemampuan bagi seorang rasul berbuat sesuatu kecuali atas izin Allah."
  }
]