[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Atau engkau mempunyai rumah yang terbuat dari emas, atau engkau mendaki tanggga menuju langit, dan kami tidak akan mempercayaimu mendaki sampai engkau kembali dengan membawa kitab dari Allah yang terbuka dimana kami dapat membaca di dalamnya bahwa sesungguhnya engkau adalah utusan Allah sebenarnya. ”katakanlah (wahai rasul), dengan memandang aneh terhadap penentangan kaum kafir, ”maha suci tuhanku!! bukankah aku ini kecuali hanya seorang hamba dari hamba-hambaNya yang menyampaikan risalahnya? bagaimana aku bisa memenuhi apa yang kalian minta?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "93. Atau hingga engkau memiliki sebuah rumah yang dihiasi emas dan lainnya, atau hingga engkau naik ke langit, dan jika engkau menaikinya, kami tidak akan pernah percaya bahwa engkau benar-benar seorang utusan Allah jika engkau naik ke langit kecuali bila engkau turun kepada kami dengan membawa suatu kitab yang tertulis dari sisi Allah yang di dalamnya tertulis bahwa engkau adalah utusan Allah.\" Maka katakanlah kepada mereka wahai Rasul, \"Maha Suci Tuhanku, bukankah aku ini hanyalah seorang manusia yang menjadi Rasul sebagaimana Rasul-rasul sebelumnya, aku sama sekali tidak memiliki kekuasaan untuk mendatangkan sesuatupun, lalu bagaimana bisa aku mendatangkan semua yang kalian minta?!\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "93. أَوْ يَكُونَ لَكَ بَيْتٌ مِّن زُخْرُفٍ (Atau kamu mempunyai sebuah rumah dari emas) Yakni rumah yang terbuat dari emas. Pendapat lain mengatakan yakni rumah yang dihiasi dengan banyak perhiasan seperti yang biasa dilakukan oleh orang-orang kaya raya dalam menghiasi rumah. أَوْ تَرْقَىٰ فِى السَّمَآءِ(atau kamu naik ke langit) Yakni kamu naik pada tingkatan-tingkatannya. وَلَن نُّؤْمِنَ لِرُقِيِّكَ(Dan kami sekali-kali tidak akan mempercayai kenaikanmu itu) Yakni kami tidak akan mempercayai kenabianmu jika kamu telah naik ke langit. حَتَّىٰ تُنَزِّلَ عَلَيْنَا كِتٰبًا نَّقْرَؤُهُۥ ۗ( hingga kamu turunkan atas kami sebuah kitab yang kami baca) Yakni sampai kami menurunkan kepada kami sebuah kitab dari langit yang membenarkanmu dan menunjukkan kenabianmu. قُلْ سُبْحَانَ رَبِّى(Katakanlah: “Maha Suci Tuhanku) Penyucian Allah dari kelemahan dalam melakukan sesuatu. هَلْ كُنتُ إِلَّا بَشَرًا(bukankah aku ini hanya seorang manusia) Yakni tidaklah aku melainkan hanya seorang manusia yang diciptakan, dan aku bukanlah seorang malaikat sehingga aku dapat naik ke langit. رَّسُولًا(yang menjadi rasul) Yang diperintah Allah untuk menyampaikan risalah kepada kalian. Hai orang-orang yang mengusulkan hal-hal ini! Apakah kalian telah mendengar bahwa seorang manusia yang dapat melakukan hal-hal ini? Aku hanyalah seorang hamba yang diutus, dan aku tidak memiliki hak untuk mengatur Tuhanku."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "93. Atau sampai kamu memiliki rumah yang terbuat dari emas, atau kamu menaiki tangga-tangga langit di hadapan kami. Kami tidak akan membenarkan atas peristiwa naikmu (ke atas langit) sampai kamu menurunkan untuk kami suatu kitab yang membenarkan dirimu dan memerintahkan kami untuk mengikutimu. Katakanlah kepada mereka wahai rasul: “Maha suci Tuhanku untuk melakukan sesuatu sesuai kehendakku dan Maha Suci Dia dari campur tangan orang lain dalam kekuasaanNya, karena sesungguhnya Dia adalah Dzat yang melakukan sesuatu sesuai kehendakNya sendiri. Aku tidak lain hanya seorang manusia biasa yang diutus layaknya para rasul lainnya untuk menyampaikan risalah Tuhanku kepada kalian. Tidak ada satupun rasul yang bisa mendatangkan suatu ayat (mukjizat) kecuali dengan seijin Allah SWT” Ayat-ayat ini diturunkan untuk pemimpin-pemimpin Quraisy yang mengajukan permintaan-permintaan ini kepada Nabi SAW untuk melemahkan, menentang dan mempermalukannya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{atau kamu mempunyai sebuah rumah dari emas} emas {atau kamu menaiki} menaiki {langit dan kami tidak akan mempercayai kenaikanmu itu} naikmu {sehingga kamu menurunkan kepada kami sebuah kitab untuk kami baca” Katakanlah,“Maha suci Tuhanku. Bukankah aku ini hanya seorang manusia yang menjadi rasul”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "89-93. Allah berfirman, “Dan sesungguhnya Kami telah mengulang-ulang kepada manusia dalam al-Quran ini tiap-tiap macam perumpamaan,” maksudnya Kami telah memvariasikan nasihat-nasihat dan perumpamaan-perumpamaan. Kami mengulang-ulangi maknanya supaya para hamba itu bisa mengambil pelajaran, sehingga mereka akan menjadi ingat dan takut kepada Allah. Akan tetapi, hanya sedikit dari mereka yang ingat. Yaitu orang-orang yang telah Allah tetapkan dengan kebahagiaan dan membantu mereka dengan taufikNya. Adapun kebanyakan manusia, maka mereka enggan berbuat kecuali mengingkari kenikmatan yang sangat besar dari segala besar dari segala sisi. Mereka menampik tanda-tanda kebesaran Allah terhadap beliau dengan usulan ayat-ayat yang mereka buat sendiri yang zhalim lagi bodoh. Mereka berkata kepada Rasulullah yang datang membawa al-Quran yang penuh dengan petunjuk dan ayat-ayatNya, “Kami sekali-kali tidak percaya kepadamu hingga kamu memancarkan mata air dari bumi untuk kami,” yaitu sungai yang mengalir, “atau kamu mempunyai sebuah kebun kurma dan anggur,” sehingga kamu tidak perlu berjalan bolak-bail keluar masuk pasar “atau kamu jatuhkan langit berkeping-keping atas kami, sebagaimana kamu katakan,” sebagai bagian dari azab “atau kamu datangkan Allah dan malaikat-malaikat berhadapan dan dapat dilihat langsung, mempersaksikan kebenaran risalah yang engkau bawa. “Atau kamu mempunyai sebuah rumah dari emas,” yaitu rumah yang berhiaskan emas dan benda mulia lainnya “atau kamu naik ke langit,” dengan cara naik yang bisa disaksikan indera “dan” meskipun demikian “kami sekali-kali tidak akan mempercayai kenaikanmu itu hingga kamu turunkan atas kami sebuah Kitab yang kami baca.” Maka ketika penentangan, upaya-upaya pelumpuhan, dan perkataan orang yang paling bodoh dan paling zhalim ini mengandung penolakan terhadap kebenaran, sikap kurang ajar terhadap Allah, dan (pemaksaan) terhadap Rasulullah supaya mendatangkan ayat-ayat, maka Allah memerintahkan beliau supaya menyucikanNya. Allah berfirman, “Katakanlah, ‘Mahasuci Rabbku’,” dari perkataan kalian (yang rusak) dengan penyucian yang setinggi-tingginya. Mahasuci Allah dari menjadikan hukum-hukum dan ayat-ayatNya mengikuti hawa nafsu mereka yang rusak dan pemikiran mereka yang sesat. “Bukankah aku ini melainkan (hanya) seorang manusia yang menjadi rasul?” yang tidak memiliki kekuasaan sama sekali."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 93: Yang di dalamnya terdapat ayat yang membenarkanmu. Oleh karena semua ini merupakan sikap menyusahkan diri dan hendak mengalahkan serta ucapan orang yang paling dungu dan paling zalim yang maksudnya menolak kebenaran, dan merupakan sikap kurang adab terhadap Allah serta menuntut kepada Rasulullah shallallahu 'alaihi wa sallam untuk mendatangkan mukjizat, maka Allah Subhaanahu wa Ta'aala memerintahkan Beliau untuk mentasbihkan Allah Subhaanahu wa Ta'aala; yakni mensucikan-Nya dari apa yang mereka katakan, dan Mahasuci Dia jika hukum-hukum dan ayat-ayat-Nya mengikuti hawa nafsu dan pandangan mereka yang rusak. Sebagaimana rasul-rasul yang lain, di mana mereka tidak mampu mendatangkan mukjizat kecuali dengan izin Allah ‘Azza wa Jalla."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 93",
    "description": "Atau engkau mempunyai sebuah rumah yang terbuat dari emas, atau kami lihat engkau naik ke langit tingkat demi tingkat. Dan kami tidak akan mempercayai kenaikanmu ke langit itu sebelum engkau turunkan kepada kami sebuah kitab untuk kami baca. Katakanlah, wahai nabi Muhammad, mahasuci tuhanku, bukankah aku ini hanya seorang manusia yang menjadi rasul' aku hanya diutus untuk menyampaikan wahyu Allah kepadamu, dan tidak ada kemampuan bagi seorang rasul berbuat sesuatu kecuali atas izin Allah. Dan tidak ada sesuatu yang menghalangi manusia untuk beriman ketika petunjuk, yakni wahyu Allah yang dibawa oleh para rasul datang kepadanya, baik pada zaman dahulu maupun sekarang, selain perkataan mereka, mengapa Allah mengutus seorang manusia menjadi rasul' mereka menolak siapa pun manusia sebagai utusan Allah, karena menurut pendapatnya yang pantas menjadi rasul Allah adalah para malaikat."
  }
]