[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan tidak ada sesuatu yang menghambat orang-orang kafir untuk beriman kepaada Allah dan rasulNya serta taat kepada Allah dan rasulNya ketika telah datang kepada mereka penjelasan yang memadai dari sisi Allah kecuali komentar mereka yang penuh kebodohan dan pengingkaran, ”apakah Allah mengutus seorang rasul dari bangsa manusia?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "94. Dan tidak ada yang menghalangi orang-orang kafir untuk beriman kepada Allah dan Rasul-Nya, dan beramal sesuai petunjuk Rasul, selain karena pengingkaran mereka terhadap adanya Rasul yang berasal dari bangsa manusia, yaitu tatkala mereka berkata, \"Mengapa Allah mengutus kepada kami seorang Rasul dari kalangan manusia?!\"."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "94. Hal yang menyebabkan orang-orang musyrik beriman setelah berbagai mukjizat mereka lihat adalah keyakinan mereka tentang ketidakmungkinan jika Allah mengutus rasul dari golongan manusia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "94. إِلَّآ أَن قَالُوٓا۟ (kecuali perkataan mereka) Yakni tidak ada yang mencegah mereka untuk beriman kecuali perkataan mereka “Adakah Allah mengutus seorang manusia menjadi rasuI?” أَبَعَثَ اللهُ بَشَرًا رَّسُولًا(Adakah Allah mengutus seorang manusia menjadi rasuI?) Yakni keingkaran mereka tentang seorang rasul yang berasal dari golongan manusia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "94. Dan tidak ada yang menghalangi manusia di masa dulu dan di masamu untuk beriman kepada Allah dan apa yang diturunkan olehNya ketika mendatangkan wahyu petunjuk kecuali mereka mengingkari bahwa seorang rasul itu dari golongan manusia"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidak ada sesuatu yang menghalangi manusia untuk beriman ketika petunjuk datang kepada mereka, kecuali mereka berkata,“Mengapa Allah mengutus seorang manusia menjadi rasul”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "94. Ini adalah faktor penyebab yang menghalangi kebanyakan orang (kaum musyrikin) untuk beriman, yaitu karena rasul yang diutus kepada mereka berasal dari bangsa manusia seperti mereka. Padahal sebenarnya ini merupakan rahmat Allah kepada mereka yaitu dengan mengirimkan utusan dari kalangan manusia. Karena mereka tidak sanggup bertemu dengan malaikat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 94: Yakni tidak dari kalangan malaikat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 94",
    "description": "Dan tidak ada sesuatu yang menghalangi manusia untuk beriman ketika petunjuk, yakni wahyu Allah yang dibawa oleh para rasul datang kepadanya, baik pada zaman dahulu maupun sekarang, selain perkataan mereka, mengapa Allah mengutus seorang manusia menjadi rasul' mereka menolak siapa pun manusia sebagai utusan Allah, karena menurut pendapatnya yang pantas menjadi rasul Allah adalah para malaikat. Katakanlah wahai nabi Muhammad, sekiranya di bumi ada para malaikat, yang berjalan-jalan dengan tenang, dan melakukan aneka kegiatan di muka bumi ini, niscaya kami turunkan kepada mereka malaikat dari langit untuk menjadi rasul bagi mereka. Itulah ketetapan Allah yang berlaku baik dahulu mapun sekarang, yaitu mengutus para rasul dari jenis makhluk yang sama dengan jenis makhluk kepada siapa ia diutus menyampaikan wahyu kepadanya."
  }
]