[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai rasul) sebagai bantahan terhadap pengingkaran kaum musyrikin perihal rasul yang berasal dari bangsa manusia. ”kalau seandainya di muka bumi ada malaikat-malaikat yang berjalan-jalan di atasnya dengan tenang, pastilah kami akan mengutuus kepada mereka seorang rasul dari bangsa malaikat. Hanya saja, penghuni bumi adalah manusia. Maka utusan Allah kepada mereka sepantasnya dari bangsa mereka sendiri, agar memungkinkan terjadinya komunikasi baik dengannya dan memahami ucapannya. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "95. Katakanlah -wahai Rasul- sebagai bantahan kepada mereka, \"Sekiranya di bumi ada Malaikat yang menetap dan berjalan di atasnya dengan rasa tenang sebagaimana halnya keadaan kalian, niscaya Kami akan turunkan kepada mereka seorang Malaikat dari langit sebagai Rasul dari bangsa mereka sendiri, karena hanya Dia lah yang bisa memahamkan mereka tentang risalah yang diembannya, dan bukanlah suatu kebaikan bila Kami mengutus kepada para Malaikat tersebut seorang Rasul dari kalangan manusia, dan hal ini persis dengan keadaan kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "95-96. Hai Rasulullah, katakanlah kepada mereka: “Seandainya di bumi hidup malaikat sebagai ganti dari manusia yang hidup di sana, niscaya Kami akan menurunkan dari langit seorang rasul dari golongan malaikat; akan tetapi penduduk bumi adalah manusia.” Katakanlah: “Cukuplah Allah sebagai saksiku; Dia Maha Mengetahui segala keadaan hamba-hamba-Nya dan Maha Melihat segala perbuatan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "95. قُل لَّوْ كَانَ فِى الْأَرْضِ مَلٰٓئِكَةٌ يَمْشُونَ مُطْمَئِنِّينَ (Katakanlah: “Kalau seandainya ada malaikat-malaikat yang berjalan-jalan sebagai penghuni di bumi) Yakni seandainya yang di bumi sebagai ganti dari manusia adalah para malaikat yang berjalan dengan kedua kaki dengan tenang dan tentram sebagaimana manusia berjalan. لَنَزَّلْنَا عَلَيْهِم مِّنَ السَّمَآءِ مَلَكًا رَّسُولًا(niscaya Kami turunkan dari langit kepada mereka seorang malaikat menjadi rasul) Agar rasul itu berasal dari golongan mereka sehingga ia dapat menyampaikan dan memberikan pemahaman dengan lebih sempurna. Yakni bukanlah sebuah kebijaksanaan jika ketika itu Kami mengutus seorang manusia kepada golongan malaikat tersebut."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "95. Katakanlah kepada mereka wahai rasul: “Sesungguhnya tiap-tiap rasul itu dari golongan yang diutus kepadanya, maka jika di bumi itu ada malaikat-malaikat yang berjalan kaki dan menetap di sana, niscaya Kami akan mengutus kepada mereka seorang malaikat sebagai rasul dari golongan mereka, supaya mereka bisa saling memahami”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Jika di bumi ada para malaikat yang berjalan dengan tenang} tinggal dan menetap di sana {sungguh Kami menurunkan kepada mereka malaikat dari langit untuk menjadi rasul”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "95. Seandainya “ada malaikat-malaikat yang berjalan-jalan sebagai penghuni di bumi,” sedangkan mereka (kamu musyrikin) sanggup untuk menyaksikan dan menerima wahyu dari para malaikat “niscaya Kami turunkan dari langit kepada mereka seorang rasul,” agar memungkinkan mereka untuk bertemu dengannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 95: Hal itu, karena tidaklah diutus kepada suatu umat seorang rasul kecuali dari kalangan mereka, agar dapat berbicara dengan mereka dan agar pembicaraannya dipahami. Di samping itu, mereka tidak sanggup menimba pelajaran dari para malaikat karena mereka tidak berjalan-jalan di bumi dengan tenang."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 95",
    "description": "Katakanlah wahai nabi Muhammad, sekiranya di bumi ada para malaikat, yang berjalan-jalan dengan tenang, dan melakukan aneka kegiatan di muka bumi ini, niscaya kami turunkan kepada mereka malaikat dari langit untuk menjadi rasul bagi mereka. Itulah ketetapan Allah yang berlaku baik dahulu mapun sekarang, yaitu mengutus para rasul dari jenis makhluk yang sama dengan jenis makhluk kepada siapa ia diutus menyampaikan wahyu kepadanya. Katakanlah wahai nabi Muhammad kepada orang-orang yang tidak mau beriman, cukuplah Allah menjadi saksi antara aku dan kamu sekalian bahwa aku adalah seorang manusia yang diutus oleh Allah menyampaikan wahyu kepadamu. Sungguh, dia maha mengetahui keadaan setiap makhluk-Nya, maha melihat akan tingkah laku dan perbuatan hamba-hamba-Nya baik yang tampak maupun yang tersembunyi."
  }
]