[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah kepada mereka, ”cukuplah Allah menjadi saksi antara aku dan kalian atas kejujuranku dan kebenaran kenabianku. Sesungguhnya Dia maha mengetahui semua kondisi hamba-hambaNYa, maha melihat amal perbuatan mereka, dan Dia akan memberikan balasan kepada mereka sesuai dengan itu. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "96. Katakanlah wahai Rasul, \"Cukuplah hanya Allah yang menjadi saksi antara aku dan kalian bahwa aku benar-benar Rasulullah yang diutus kepada kalian, dan bahwasanya aku telah menyampaikan kepada kalian risalah yang diembankan padaku, karena sesungguhnya Dia Maha Tahu segala keadaan hamba-Nya, tidak ada satu keadaan merekapun yang tersembunyi dari-Nya, juga Maha Melihat segala yang tersembunyi dalam diri mereka.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "96. قُلْ كَفَىٰ بِاللهِ شَهِيدًۢا بَيْنِى وَبَيْنَكُمْ ۚ (Katakanlah: “Cukuplah Allah menjadi saksi antara aku dan kamu sekalian) Atas risalah yang telah aku sampaikan kepada kalian yang Allah perintahkan kepadaku untuk menyampaikannya. إِنَّهُۥ كَانَ بِعِبَادِهِۦ خَبِيرًۢا بَصِيرًا(Sesungguhnya Dia adalah Maha Mengetahui lagi Maha Melihat akan hamba-hamba-Nya) Yakni Maha Mengetahui segala keadaan mereka serta apa yang mereka tampakkan dan apa yang mereka rahasiakan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "96. Katakanlah juga kepada mereka: “Cukuplah Allah yang menjadi saksi atas kebenaran risalahku. Sesungguhnya Allah SWT itu Maha Mengetahui kondisi-kondisi hamba-hambaNya dan selalu mengamati seluruh amal mereka baik yang nampak maupun yang tersembunyi”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Cukuplah Allah menjadi saksi} saksi {antara aku dan kalian. Sesungguhnya Dia Maha Mengetahui lagi Maha Melihat hamba-hambaNya”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "96. “Katakanlah, ‘Cukuplah Allah menjadi saksi antara aku dan kamu sekalian.’ Sesungguhnya Dia Maha Mengetahui lagi Maha Melihat hamba-hambaNya,” di antara bentuk persaksian Allah atas RasulNya adalah Allah mendukungnya dengan mukjizat, menurunkan ayat-ayat untuknya dan menolongnya dari kaum yang memusuhi dan melawannya. Seandainya beliau (Nabi Muhammad) mengada-adakan sebagian perktaan atas Nama Allah, tentulah Dia akan menyeret tangan kanannya, kemudian Dia putus urat jantungnya. Sesungguhnya Dia Maha Mengetahui lagi Maha Melihat. Bagi Allah, tidak ada sesuatu pun yang tersembunyi pada keadaan para hambaNYa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 96: Atas kebenaranku. Termasuk persaksian-Nya terhadap Rasul-Nya adalah penguatan-Nya dengan memberikan mukjizat, diturunkan ayat-ayat dan ditolong-Nya Beliau terhadap musuh-musuhnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 96",
    "description": "Katakanlah wahai nabi Muhammad kepada orang-orang yang tidak mau beriman, cukuplah Allah menjadi saksi antara aku dan kamu sekalian bahwa aku adalah seorang manusia yang diutus oleh Allah menyampaikan wahyu kepadamu. Sungguh, dia maha mengetahui keadaan setiap makhluk-Nya, maha melihat akan tingkah laku dan perbuatan hamba-hamba-Nya baik yang tampak maupun yang tersembunyi. Dan barang siapa diberi petunjuk oleh Allah, disebabkan kecenderungan hatinya untuk mendapat petunjuk, dialah yang mendapat petunjuk, tidak ada siapa pun yang dapat menyesatkannya, dan barang siapa dia sesatkan, disebabkan oleh penolakannya terhadap ayat-ayat Allah, maka engkau tidak akan mendapatkan penolong-penolong bagi mereka yang dapat menunjukkan kepada jalan yang benar selain dia, Allah yang mahakuasa. Dan kami akan mengumpulkan mereka pada hari kiamat dengan wajah tersungkur, ditarik malaikat ke dalam neraka dalam keadaan buta, tidak dapat melihat sesuatu yang terjadi, bisu, tidak dapat mengutarakan kepedihan, dan tuli, tidak dapat mendengar sesuatu yang menyenangkan hati. Keadaan mereka di akhirat adalah sebagaimana sikap mereka terhadap ayat-ayat Allah ketika mereka di dunia. Tempat kediaman mereka adalah neraka jahanam. Setiap kali nyala api jahanam itu akan padam, disebabkan punah bahan bakarnya yang berupa manusia, kami tambah lagi nyalanya dengan mengembalikan kulitnya dan menumbuhkan kembali tulangnya bagi mereka. Setiap kali kulit mereka hangus terbakar oleh api neraka, Allah mengganti kulit yang lain sehingga tidak putus-putusnya kepedihan menimpa mereka."
  }
]