[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Siksaan yang dideskripsikan ini merupakan hukuman bagi kaum musyrikin disebabkan kekafiran mereka terhadap ayat-ayat Allah dan hujjah-hujjahNya, dan juga pendustaan mereka terhadap rasul-rasulNya yang menyeru mereka untuk beribadah kepadaNya saja, dan juga karena ucapan mereka dengan penuh kesombongan (ketika diperintahkan membenarkan hari kebangkitan) ”apakah kami bila telah mati dan kami berubah menjadi tulang-belulang yang hancur berkeping-keping kami akan dibangkitkan kembali setelah itu dalam bentuk makhluk yang baru?”."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "98. Azab yang mereka dapatkan tersebut merupakan balasan atas kekafiran mereka terhadap ayat-ayat yang Kami turunkan kepada Rasul Kami, dan atas perkataan mereka demi mengingkari adanya Hari Kebangkitan, \"Apabila kami telah mati, lalu menjadi tulang-belulang dan benda-benda yang hancur serta terpisah-pisah, apakah kami akan dibangkitkan kembali sebagai makhluk yang baru?!\"."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "98. Itulah tempat kembali yang jauh dari rahmat Allah sebagai balasan atas kekafiraan mereka terhadap ayat-ayat-Nya, pendustaan mereka terhadap hari kebangkitan, dan keingkaran mereka terhadap orang yang beriman dan mendakwahkannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "98. ذٰلِكَ (Itulah) Yakni azab itu. جَزَآؤُهُم بِأَنَّهُمْ كَفَرُوا۟ بِـَٔايٰتِنَا(balasan bagi mereka, karena sesungguhnya mereka kafir kepada ayat-ayat Kami) Yakni akibat kekafiran mereka terhadap ayat-ayat Kami, mereka tidak mempercayai ayat-ayat qur’aniyah dan tidak pula mentafakkuri ayat-ayat kauniyah. وَقَالُوٓا۟ أَءِذَا كُنَّا عِظٰمًا وَرُفٰتًا(dan (karena mereka) berkata: “Apakah bila kami telah menjadi tulang belulang dan benda-benda yang hancur) Telah dijelaskan tafsir dari kalimat ini pada ayat 49."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "98. Itulah balasan bagi mereka yaitu azab di neraka Jahannam, mereka ingkar kepada ayat-ayat Kami baik ayat kauniyah maupun Alquran. Mereka juga tidak mengambil pelajaran dari ayat-ayat itu. Mereka mengingkari kerasulan nabi dan hari kebangkitan dan perhitungan dengan berkata: \"Apakah bila kami telah menjadi tulang belulang dan benda-benda yang hancur, apakah kami benar-benar akan dibangkitkan kembali sebagai makhluk baru?\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Itulah balasan bagi mereka karena sesungguhnya mereka ingkar kepada ayat-ayat Kami dan berkata,“Apabila kami telah menjadi tulang-belulang dan benda-benda yang hancur, apakah kami benar-benar akan dibangkitkan kembali sebagai makhluk baru”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "98. Allah tidak berbuat sewenang-wenang terhadap mereka. Akan tetapi Allah membalas kakafiran mereka terhadap ayat-ayatNya dan pengingkaran mereka terhadap Hari Kebangkitan yang telah diberitakan oleh para rasul dan dibicarakan oleh kitab-kitab. Mereka meremehkan Rabb mereka dan mengingkari kesempurnaan kekuasaanNya. “Mereka berkata, ‘Apakah bila kami telah menjadi tulang belulang dan benda-benda yang hancur, apakah kami benar-benar akan dibangkitkan kembali sebagai makhluk baru?’ “ maksudnya itu tidak akan terjadi. Karena termasuk hal yang sangat mustahil bagi akal mereka yang rusak."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 98: Mengingkari adanya kebangkitan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 98",
    "description": "Itulah neraka jahanam balasan bagi mereka, disebabkan karena sesungguhnya mereka kafir kepada ayat-ayat kami, baik ayat-ayat yang diturunkan melalui wahyu, yakni kitab suci, maupun ayat-ayat yang terhampar di alam raya dan karena mereka menolak hari kebangkitan dengan berkata, apabila kami telah menjadi tulang belulang dan benda-benda yang hancur, bagaikan debu yang beterbangan apakah kami benar-benar akan dibangkitkan kembali sebagai makhluk baru'Allah menjawab pertanyaan mereka dengan menyatakan, dan apakah mereka tidak memperhatikan, melihat dengan mata hatinya, bahwa Allah yang menciptakan langit dan bumi dengan segala keharmonisan dan ketelitian sistemnya adalah mahakuasa pula menciptakan yang serupa dengan mereka, tidak sulit bagi Allah menjadikan kulit dan tulang belulang yang hancur menjadi makhluk yang baru, dan dia telah menetapkan waktu tertentu, yakni waktu kematian dan kebangkitan bagi mereka, yang tidak diragukan lagi, walau sedikit pun kedatangannya' maka orang zalim itu, yaitu orang-orang yang tidak percaya kepada ayat-ayat kami dan menolak hari kebangkitan, mereka tidak menolaknya kecuali dengan kekafiran, meskipun telah jelas bukti-bukti dipaparkan kepada mereka."
  }
]