[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apakah kaum musyrikin itu lalai, tidak menyadari dan tidak tahu bahwa sesungguhnya Allah Dialah Dzat yang menciptakan langit dan bumi dan semua makhluk yang ada di dalamnya tanpa ada contoh sebelumnya, Dia maha kuasa untuk menciptakan makhluk-makhluk seperti mereka setelah mereka lenyap? Allah telah menetapkan waktu tertentu bagi kaum musyrikin untuk kematian mereka dan timpaan siksaan bagi mereka, dan tidak diragukan lagi bahwa itu akan menimpa mereka. Kendatipun kebenaran dan dalil-dalilnya sudah begitu jelas, akan tetapi orang-orang kafir menolak kecuali untuk mengingkari agama Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "99. Apakah orang-orang yang ingkar terhadap Hari Kebangkitan itu tidak tahu bahwa Allah yang menciptakan langit dan bumi dengan segala kemegahannya, pasti akan sangat kuasa pula untuk menciptakan yang serupa dengan mereka, sebab siapa saja yang kuasa menciptakan sesuatu yang besar, maka ia pasti kuasa pula untuk menciptakan sesuatu yang lebih kecil darinya. Allah telah menetapkan bagi mereka di dunia ini batasan waktu berakhirnya kehidupan mereka, dan menetapkan pula bagi mereka waktu kebangkitan yang tidak ada keraguan padanya, akan tetapi sekalipun bukti-bukti adanya kebangkitan itu telah nyata dan jelas, kaum musyrikin tetap tidak menerimanya kecuali dengan pembangkangan dan kekafiran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "99-100. Allah mengingkari orang-orang yang ingkar terhadap hari kebangkitan sebagai olokan bagi mereka: “Apakah mereka tidak mengetahui bahwa Allah yang telah menciptakan tujuh langit dan tujuh bumi berkuasa untuk mengulangi penciptaan manusia setelah mereka hancur? Dan Allah telah menentukan waktu kematian manusia tanpa ada keraguan; akan tetapi orang-orang musyrik tetap mendustakan dan mengingkari hari kebangkitan.” Hai Rasulullah, katakanlah kepada mereka: “Seandainya kalian memiliki perbendaharaan rahmat Allah yang luas, niscaya kalian akan berbuat kikir dan enggan menginfakkannya karena takut akan habis; sungguh manusia adalah makhluk yang bakhil dan kikir.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "99. قَادِرٌ عَلَىٰٓ أَن يَخْلُقَ مِثْلَهُمْ (berkuasa (pula) menciptakan yang serupa dengan mereka) Yakni barangsiapa yang mampu menciptakan yang semisal ini maka penciptaannya sekali lagi adalah lebih mudah sehingga Dia lebih mampu melakukannya. وَجَعَلَ لَهُمْ أَجَلًا لَّا رَيْبَ فِيهِ(dan telah menetapkan waktu yang tertentu bagi mereka yang tidak ada keraguan padanya?) Yakni waktu kematian atau hari kiamat. فَأَبَى الظّٰلِمُونَ إِلَّا كُفُورًا (Maka orang-orang zalim itu tidak menghendaki kecuali kekafiran) Yakni orang-orang musyrik tidak melakukan kecuali keingkaran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "99. Sehingga Allah menjawab pertanyaan mereka: “Apakah mereka tidak memperhatikan (dengan penglihatan hati) bahwasanya Allah yang menciptakan langit dan bumi juga berkuasa menciptakan yang serupa dengan itu, bukankah itu semua adalah ciptaan-Nya? Dia telah menetapkan waktu tertentu (ajal) yaitu hari kematian dan kebangkitan bagi mereka, tidak ada keraguan padanya? Maka orang-orang zalim itu tidak menghendaki kecuali pembangkangan dan kekafiran"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah mereka tidak memperhatikan bahwa sesungguhnya Allah yang menciptakan langit dan bumi itu Maha kuasa menciptakan yang serupa dengan mereka dan Maha kuasa menetapkan ajal bagi mereka} waktu tertentu untuk kematian mereka {tidak diragukan lagi} tidak diragukan lagi datangnya ajal itu {Lalu orang-orang zalim itu tidak menginginkannya kecuali kekufuran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "99. “Dan apakah mereka tidak memperhatikan bahwasanya Allah yang menciptakan langit dan bumi.” Wujud keduanya lebih besar daripada wujud penciptaan manusia “Kuasa (pula) menciptakan yang serupa dengan mereka?” tentu. Sesungguhnya Dia Mahakuasa untuk melakukannya. “Dan,” akan tetapi Dia telah menjadikan untuk itu, “waktu yang tertentu bagi mereka yang tidak ada keraguan padanya.” Tidak diragukan lagi. Kalau tidak demikian, seandainya Allah menghendaki, tentulah Dia mendatangkan siksaan dengan tiba-tiba kepada mereka, bersamaan dengan penegakan hujjah dan dalil-dalil tentang Hari Kebangkitan, “maka orang-orang zhalim itu enggan (berbuat sesuatu) kecuali kekafiran,” yaitu kezhaliman dan kebohongan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Isra ayat 99: Di mana langit dan bumi itu lebih besar dibanding manusia. Maksudnya, waktu mereka mati atau waktu mereka dibangkitkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Isra Ayat 99",
    "description": "Allah menjawab pertanyaan mereka dengan menyatakan, dan apakah mereka tidak memperhatikan, melihat dengan mata hatinya, bahwa Allah yang menciptakan langit dan bumi dengan segala keharmonisan dan ketelitian sistemnya adalah mahakuasa pula menciptakan yang serupa dengan mereka, tidak sulit bagi Allah menjadikan kulit dan tulang belulang yang hancur menjadi makhluk yang baru, dan dia telah menetapkan waktu tertentu, yakni waktu kematian dan kebangkitan bagi mereka, yang tidak diragukan lagi, walau sedikit pun kedatangannya' maka orang zalim itu, yaitu orang-orang yang tidak percaya kepada ayat-ayat kami dan menolak hari kebangkitan, mereka tidak menolaknya kecuali dengan kekafiran, meskipun telah jelas bukti-bukti dipaparkan kepada mereka. Ayat ini merupakan lanjutan dari jawaban terhadap tuntutan kaum musyrik. Katakanlah wahai nabi Muhammad, sekiranya kamu menguasai perbendaharaan rahmat tuhanku, berupa harta benda atau apa saja yang dianugerahkan Allah kepada makhluk-Nya, niscaya perbendaharaan itu kamu tahan, tidak kamu berikan kepada siapa yang membutuhkan karena takut membelanjakannya, yakni takut kemiskinan karena membelanjakan apa yang dianugerahkan oleh tuhanmu. Dan manusia itu memang sangat kikir. Demikianlah Allah tidak akan mengabulkan tuntutan mereka karena seperti itulah ketetapan Allah menyangkut hikmah dan maslahat dalam penciptaan makhluk-Nya."
  }
]