[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ini adalah surat agung dari al-Qur’an yang Kami turunkan dan Kami mewajibkan mengamalkan hokum-hukumnya, dan Kami menurunkan di dalamnya petunjuk-petunjuk yang nyata, supaya kalian (wahai kaum Mukminin) mengingat ayat-ayat yang nyata ini dan kemudian melaksanakannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Surah ini Kami turunkan dan Kami wajibkan (manusia) untuk beramal dengan hukum-hukum yang terkandung di dalamnya, serta Kami turunkan padanya ayat-ayat yang jelas lagi nyata, dengan harapan agar kalian mengambil pelajaran darinya berupa perkara hukum-hukum, sehingga kalian pun bisa mengamalkannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1. Dengan keagungan Kami, Kami turunkan surat yang mulia ini kepada Nabi Muhammad. Kami wajibkan hukum-hukumnya, dan Kami turunkan ayat-ayatnya yang menjelaskan dengan jelas hukum-hukum dan pelajaran-pelajaran yang ada di dalamnya, agar kalian mengambil ibrah dan menjadikannya penerang."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. سُورَةٌ (satu surat) Yakni surat ini. أَنزَلْنٰهَا(yang Kami turunkan) Makna surat adalah kumpulan ayat-ayat yang memiliki awal dan akhir. وَفَرَضْنٰهَا (dan Kami wajibkan) Yakni Kami haruskan dan wajibkan kalian untuk menjalankan hukum-hukumnya. وَأَنزَلْنَا فِيهَآ ءَايٰتٍۭ بَيِّنٰتٍ (dan Kami turunkan di dalamnya ayat ayat yang jelas) Yakni Kami turunkan dalam kandungan dan isinya ayat-ayat yang jelas. Pengulangan kata (أنزلنا) kerena besarnya perhatian terhadap penurunan surat ini karena hukum-hukum yang dikandungnya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ) Perhatikan permulaan surah ini: { سُورَةٌ أَنزَلْنَٰهَا وَفَرَضْنَٰهَا } \"(Ini adalah) satu surat yang Kami turunkan dan Kami wajibkan (menjalankan hukum-hukum yang ada di dalam)nya\" ayat ini sebagai pengantar untuk ayat-ayat yang akan datang dalam surah ini yang di dalamnya akan dijelaskan tentang hudud, hukum-hukum dan adab-adab, maka hendaklah setiap hamba mempersiapkan diri dalam ketaatan kepada perintah dan larangan yang dijelaskan di dalamnya dengan sebaik mungkin; karena ia bukanlah dari pemikiran manusia, dan bukan pula hasil ijtihad ilmuan, di dalam surah ini dijelaskan secara umum tentang hukum-hukum yang berkaitan dengan percampuran antara laki-laki dan perempuan, pakaian kaum perempuan, dan perkara keluarnya perempan dari rumahnya; maka hendaknya seseorang tidak melanggar batasan-batasan yang Allah tetapkan hanya karena alasan pribadi. 2 ). Allah befirman pada awal surah an-Nur: { سُورَةٌ أَنزَلْنَٰهَا وَفَرَضْنَٰهَا وَأَنزَلْنَا فِيهَآ ءَايَٰتٍۭ بَيِّنَٰتٍ } \"(Ini adalah) satu surat yang Kami turunkan dan Kami wajibkan (menjalankan hukum-hukum yang ada di dalam)nya, dan Kami turunkan di dalamnya ayat ayat yang jelas\" di dalam surah ini terdapat beberapa hujjah tentang masalah agama dan beberapa ayat yang menjelaskan tentang tauhid, terdapat juga dalil-dalil ahkam, dan di tiap-tiap ayat yang jelas itu, adalah merupakan hujjah yang dapat diterima oleh akal dan ujungnya akan kembali kepada ketuhidan kepada Allah, dan dalil-dalil ahkam yang menunjukkan pengikutnya kepada kebenaran, dan mengangkat kebodohan dari diri pengikutnya, dan inilah yang menjadi keutamaan dari surah ini; dan menjadi kemuliaan bagi Nabi pada kedudukannya sebagai Nabi dan Rasul, dan juga kemuliaan bagi kita bahwa ini adalah petunjuk bagi kita."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Keutamaan: Mujahid menyebutkan bahwa rasulullah SAW bersabda: Ajarkanlah kepada putera-putera kalian surah Al-maidah, dan kepada puteri-puteri kalian surah Annur. Adapun Umar radliyallahu anhu menulis untuk sebagian gubernurnya: Ajarkanlah surah Annisa, surah Al ahzab dan surah Annur. 1. Surah ini adalah satu surah yang Kami turunkan kepada Rasul. Kami turunkan dalam surah ini berbagai ayat yang jelas. Pengulangan kata anzalna adalah untuk menambah penjagaan atas turunnya surah ini. agar kamu selalu mengingat dan mengambil pelajaran darinya sehingga kalian mengamalkan isinya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Surah yang Kami turunkan, Kami wajibkan mengamalkannya} Kami wajibkan mengamalkan hukum-hukumnya {dan Kami turunkan di dalamnya ayat-ayat yang jelas} yang jelas {agar kalian mengambil pelajaran} mengambil pelajaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1. Maksudnya, ini “satu surat” yang sangat besar keagungannya. \"Kami turunkan,” sebagai rahmat dari kami segenap hamba, dan kami pelihara dari (campur tangan) semua setan. “dan kami wajibkan (menjalankan hukum-hukum yang ada di dalam) nya,” maksudnya kami telah menentukan kadar ukuran dalam hal hukuman-hukuman pidana, persaksian dan lainnya. “dan kami turunkan di dalamnya ayat-ayat yang jelas” yakni hukum-hukum yang jelas, untaian perintah dan larangan serta hikmah-hikmah yang agung. “agar kamu selalu mengingatinya,” tatkala kami menerangkannya kepada kalian dan mengajarkan kepada kalian hal-hal yang belum kalian mengerti."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nur ayat 1: Yakni karena rahmat-Nya kepada hamba-hamba-Nya. Bisa juga diartikan, “Kami tetapkan”, yakni Kami tetapkan di dalamnya apa yang Kami tetapkan seperti masalah hudud, persaksian, dsb. Maksudnya, hukum-hukum yang jelas, perintah dan larangan dan hikmah-hikmah yang agung. Yakni ketika Kami terangkan. Pada ayat selanjutnya Allah Subhaanahu wa Ta'aala menerangkan hukum-hukum yang telah diisyaratkan itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nur Ayat 1",
    "description": "Surah ini dibuka dengan penegasan bahwa ketentuan hukum Allah wajib dilaksanakan. 'inilah suatu surah yang kami turunkan dan kami wajibkan bagi kamu untuk menjalankan hukum-hukum di dalam-Nya, dan kami turunkan di dalamnya tanda-tanda yang jelas tentang kekuasaan dan keesaan kami agar kamu selalu ingat dan mengambil pelajaran darinya. 2. Surah ini mengandung ketentuan hukum yang pasti, salah satunya hukum perzinaan. Kepada pezina perempuan yang belum pernah menikah dan demikian pula pezina laki-laki yang belum pernah menikah, deralah masing-masing dari keduanya seratus kali jika perziaan keduanya terbukti sesuai dengan syarat-syaratnya, dan janganlah rasa belas kasih-an kepada keduanya mencegah kamu untuk menjalankan agama dan hukum Allah, jika kamu beriman kepada Allah dan hari kemudian. Salah satu konsekuensi iman adalah melaksanakan hukum Allah. Dan hendaklah pelaksanaan hukuman mereka disaksikan oleh sebagian orang-orang yang beriman, sedikitnya tiga atau empat orang, agar hukuman itu menjadi pelajaran bagi pihak-pihak yang melihat dan mendengarnya."
  }
]