[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sekiranya bukan karena karunia Allah pada kalian dan rahmatNya (wahai kaum Mukminin) dengan menetapkan aturan ini pada pasangan-pasangan suami dan istri, pastilah akan menimpa pihak yang berdusta dari dua belah pihak yang saling melaknat dengan doa buruk yang akan menimpa dirinya (jika berbohong), dan sesungguhnya Allah Maha Menerima taubat orang yang bertaubat dari hamba-hambaNya, Mahabijaksana dalam penetapan syariat dan pengaturanNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Dan kalaulah bukan karena karunia dan rahmat Allah kepada kalian -wahai sekalian manusia- dan andaikata Allah bukan Penerima tobat orang-orang yang bertobat lagi Maha Bijaksana dalam pengaturan dan syariat-Nya, niscaya Dia akan menyegerakan azabnya lantaran dosa-dosa kalian, dan mempermalukan kalian dengannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "10. Wahai orang-orang beriman, kalaulah bukan karena karunia dan rahmat Allah yang diberikan kepada kalian dengan penetapan hukum-hukum ini. Dan sungguh Allah Maha Menetima taubat hamba-Nya yang bertaubat dan Maha Bijaksana dalam syariat-Nya sehingga tidak segera menyiksa kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. وَلَوْلَا فَضْلُ اللهِ عَلَيْكُمْ وَرَحْمَتُهُۥ وَأَنَّ اللهَ تَوَّابٌ (Dan andaikata tidak ada kurnia Allah dan rahmat-Nya atas dirimu dan (andaikata) Allah bukan Penerima Taubat) Yakni Allah kembali menerima dan memberi ampunan pada orang yang bertaubat kepada-Nya dan berhenti dari kemaksiatannya. حَكِيمٌ(lagi Maha Bijaksana) Dalam syariat li’an yang diberikan bagi hamba-hamba-Nya dan dalam hukum-hukum had yang diwajibkan kepada mereka. Dan kalaulah bukan karena ampunan dan kebijaksanaan Allah niscaya orang yang berbohong diantara suami dan istri tersebut akan mendapat azab yang besar."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Firman Allah setelah menjelaskan tentang hukuman cambuk bagi pelaku zina: { وَلَوْلَا فَضْلُ اللَّهِ عَلَيْكُمْ وَرَحْمَتُهُ وَأَنَّ اللَّهَ تَوَّابٌ حَكِيمٌ } \"Dan andaikata tidak ada kurnia Allah dan rahmat-Nya atas dirimu dan (andaikata) Allah bukan Penerima Taubat lagi Maha Bijaksana, (niscaya kamu akan mengalami kesulitan-kesulitan)\" pada umumnya yang terbetik dalam benak kebanyakan orang bahwa ayat yang sering terdengar adalah: { تَوَّاب رَّحِيْمٌ } karena rahmat sesuai dengan ampunan, namun kali ini Allah menutup ayat dengan lafadz ( الحكيم ) sebagai syarat akan faidah disyariatkannya sumpah dan persaksian dalam perkara ini, yaitu menutup aib dari pelaku dosa yang besar ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10. Andaikata tidak ada karunia Allah dan rahmat-Nya atas dirimu, maka kalian akan segera menerima hukuman dan niscaya kamu akan mengalami kesulitan-kesulitan. Namun Allah Maha Penerima taubat hamba-Nya lagi Maha Bijaksana atas syariat-Nya bagi permasalahan suami istri"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Seandainya bukan karena karunia Allah dan rahmatNya kepada kalian dan Allah Maha Penerima taubat lagi Maha bijaksana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "10 “dan andaikata tidak ada karunia Allah dan rahmatNya atas dirimu, dan (andaikata) Allah (bukan) penerima taubat lagi Mahabijaksana,” jawaban dari syarat itu tersembunyi. Ia sudah ditunjukkan oleh konteks pembicaraan, yakni, “ aku akan menimpakan kepada salah seorang yang telah berdusta dari keduanya sesuatu yang telah mereka doakan atas dirinya.” Dan berkat rahmat Allah dan karuniaNya, terdapat penetapan hukum li’an ini khusus untuk suami istri, karena memang sangat dibutuhkan. Allah telah menerangkan kengerian praktik zina, dan kebejatannya serta buruknya menuduh orang lain berzina, dan Allah telah mensyariatkan bertaubat dari dosa besar ini dan dari dosa yang lain."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nur ayat 10: Jawab dari syarat (seandainya) menurut Syaikh As Sa’diy adalah, “Tentu akan menimpa kepada salah seorang yang berdusta di antara dua orang yang melakukan li’an doa buruk terhadapnya, dan di antara rahmat dan karunia-Nya adalah berlakunya hukum yang khusus terkait dengan suami-istri ini karena sangat diperlukan sekali, demikian pula Dia menerangkan betapa buruknya perbuatan zina, dan menuduh orang lain berzina, dan Dia pun mensyariatkan tobat dari dosa besar ini, dan dosa besar lainnya.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nur Ayat 10",
    "description": "8-10. Usai menjelaskan langkah yang harus ditempuh oleh suami jika menuduh istrinya berzina, Allah lalu memberi kesempatan bagi istri untuk menunjukkan kesuciannya dan kedustaan tuduhan sang suami. Bila istri tidak membantah tuduhan suami maka ia dianggap bersalah dan berhak dijatuhi hukuman zina. Dan istri itu terhindar dari hukuman zina apabila dia bersumpah empat kali atas nama Allah dalam sumpahnya bahwa dia, yaitu suaminya, benar-benar termasuk orang-orang yang berdusta dalam tuduhannya, dan sumpah yang kelima bahwa kemurkaan Allah akan menimpanya, yaitu istri, jika dia, yaitu suami, itu termasuk orang yang berkata benar. Dan seandainya bukan karena karunia Allah yang menurunkan Al-Qur'an dan rahmat-Nya dalam menerima tobat hamba-Nya dan menetapkan hukum yang bijaksana kepadamu, niscaya kamu akan menemui kesulitan. Dan sesungguhnya Allah maha penerima tobat, mahabijaksana. 11. Beralih dari penjelasan hukum li''n, Allah lalu mengisahkan salah satu kasus yang menimpa keluarga nabi, yang lazim disebut 'ad' al-ifk (berita bohong). Ayat ini mengecam mereka yang tanpa bukti menuduh 'aisyah berbuat zina dengan 'afw'n bin mu'a''al. Sesungguhnya orang-orang yang membawa dan dengan sengaja menyebarluaskan berita bohong itu adalah dari golongan kamu juga. Janganlah kamu mengi-ra berita bohong itu buruk bagi kamu, bahkan itu baik bagi kamu karena kamu dapat membedakan siapa yang munafik dan siapa mukmin sejati. Setiap orang dari mereka yang menyebarkan berita bohong tersebut akan mendapat balasan sesuai kadar dari dosa yang diperbuatnya. Dan barang siapa di antara mereka yang mengambil bagian terbesar dari dosa yang diperbuatnya, yakni orang yang menjadi sumber utama berita bohong itu, dia mendapat azab yang besar di akhirat nanti."
  }
]