[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang yang datang dengan membawa kedustaan yang paling keji, yaitu menuduh Ummul Mukminin Aisyah dengan tuduhan zina, adalah satu golongan yang mengaku berasal dari kalian (wahai kaum Muslimin), maka janganlah beranggapan bahwa perkataan mereka buruk bagi kalian, bahkan sebaliknya itu adalah suatu kebaikan bagi kalian, lantaran hal itu membuat pembersihan nama Ummul Mukminin dan kesucian dan penghormatan namanya, mengangkat derajatnya, dan menghapus semua kesalahannya. Tiap-tiap individu yang berbicara dusta, baginya balasan perbuatannya berupa dosa. Dan orang yang menanggung penyebarannya hingga meluas adalah Abdullah bin Ubay bin Salul seorang pembesar orang munafik (semoga Allah melakantnya), baginya siksaan besar di akhirat, yaitu tinggal secara abadi di bagian terbawah neraka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Sesungguhnya orang-orang yang membawa berita bohong itu (yaitu menuduh Ummul mukminin Aisyah -raḍiyallāhu 'anhā- melakukan zina), adalah kelompok yang berafiliasi pada kalian juga -wahai orang-orang mukmin-. Janganlah kalian mengira bahwa berita bohong itu buruk bagi kalian, bahkan itu adalah sesuatu yang baik bagi kalian karena di dalamnya terdapat pahala dan penyeleksian terhadap kaum mukminin (dari orang-orang munafik), juga mendatangkan penegasan kesucian Ummul mukminin Aisyah -raḍiyallāhu 'anhā- dari perbuatan keji tersebut. Tiap-tiap orang dari mereka yang ikut serta dalam menuduh Aisyah -raḍiyallāhu 'anhā- akan mendapat dosa yang dilakukannya karena menyebarkan kedustaan, dan siapa di antara mereka yang memulai dan mengambil bagian yang terbesar dalam penyiaran berita bohong itu, baginya azab yang besar, orang tersebut adalah pemimpin kaum munafik yaitu Abdullah bin Ubay bin Salul."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "11. Allah membebaskan Ummul mukminin, Aisyah, dari tuduhan zina yang disebarkan oleh pemimpin kaum munafik, Abdullah bin Ubay bin Salul; dan Allah menerangkan hati keluarga Abu Bakar: Sesungguhnya orang-orang yang membuat kedustaan keji dan besar itu merupakan sekelompok orang dari kaum muslimin, dan sebagian mereka menampakkan diri telah memeluk Islam. Wahai keluarga Abu Bakar, janganlah kalian mengira tuduhan ini buruk bagi kalian, namun sebenarnya baik bagi kalian karena berujung kemuliaan besar bagi kalian dengan penyucian Allah bagi Ummul mukminin, Aisyah; dan untuk membongkar keburukan orang-orang fasik, serta sebagai pelajaran bagi orang-orang beriman. Setiap orang yang menyebarkan tuduhan ini akan mendapat dosa atas perbuatannya itu. Dan orang yang pertama kali membuat tuduhan ini adalah pemimpin kaum munafik, Abdullah bin Ubay, dia akan mendapat azab yang sangat pedih di akhirat. Aisyah berkata, yang dimaksud dalam firman Allah (والذي تولى كبره) ‘orang yang berperan paling besar dalam penyebaran tuduhan ini’ adalah Abdullah bin Salul. (Shahih al-Bukhari 8/306 no. 4749, kitab tafsir surat an-Nur, dan yang dimaksud dengan Abdullah adalah bin Ubay bin Salul)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "11. إِنَّ الَّذِينَ جَآءُو بِالْإِفْكِ (Sesungguhnya orang-orang yang membawa berita bohong itu) Makna (الإفك) adalah kebohongan dan kedustaan. Dan yang dimaksud di sini adalah kebohongan yang ditujukan kepada Ummul Mu’minin ‘Aisyah. Dalam hadits yang dikeluarkan oleh Imam Bukhari, Muslim, penulis kitab-kitab sunan, dan lainnya, dari Aisyah dalam hadits panjang yang menjadi sebab turunnya ayat ini, dan intinya bahwa ‘Aisyah keluar dari pelana untanya untuk mencari kalungnya yang terputus. Namun rombongan kafilah perang melanjutkan perjalanan dan mereka mengira ‘Aisyah berada di dalam pelananya. Ketika ‘Aisyah kembali ke tempat kafilah itu ternyata mereka telah meninggalkannya, maka ia tetap menunggu di tempat itu. Kemudian lewatlah Shafwan bin Mu’atthal yang ketika itu tertinggal dari kafilah, maka ia mendudukkan untanya dan mengangkut ‘Aisyah. Ketika para pendusta melihat hal ini mereka menuduh ‘Aisyah telah melakukan perbuatan keji dengan Shafwan, namun Allah membersihkan ‘Aisyah dari apa yang mereka tuduhkan. عُصْبَةٌ مِّنكُمْ ۚ( adalah dari golongan kamu) Mereka adalah Abdullah bin Ubay yang merupakan pemimpin orang-orang munafik, Zaid bin Rifa’ah, Hassan bin Tsabit, Misthah bin Atsatsah, Hamnah bin Jahsy, dan orang-orang lain yang membantu mereka. لَا تَحْسَبُوهُ شَرًّا لَّكُم ۖ بَلْ هُوَ خَيْرٌ لَّكُمْ ۚ( Janganlah kamu kira bahwa berita bohong itu buruk bagi kamu bahkan ia adalah baik bagi kamu) Yakni dengan kejadian ini kalian dapat mendapat pahala yang besar dengan menjelaskan bersihnya Ummul Mukminin ‘Aisyah dari tuduhan, serta kisah ini menjadi sumber syariat yang belaku bagi umat muslim secara umum. لِكُلِّ امْرِئٍ مِّنْهُم مَّا اكْتَسَبَ مِنَ الْإِثْمِ ۚ( Tiap-tiap seseorang dari mereka mendapat balasan dari dosa yang dikerjakannya) Yakni dosa akibat tuduhan bohong yang ia katakan. وَالَّذِى تَوَلَّىٰ كِبْرَهُۥ مِنْهُمْ (Dan siapa di antara mereka yang mengambil bahagian yang terbesar dalam penyiaran berita bohong itu) Yakni Abdullah bin Ubay, dan pendapat lain mengatakan ia adalah Hassan bin Tsabit. لَهُۥ عَذَابٌ عَظِيمٌ (baginya azab yang besar) Disebabkan amal keburukannya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). { لَا تَحْسَبُوهُ شَرًّا لَّكُم ۖ بَلْ هُوَ خَيْرٌ لَّكُمْ } \"Janganlah kamu kira bahwa berita bohong itu buruk bagi kamu bahkan ia adalah baik bagi kamu\" Kalimat ini datang di awal ayat dari ayat-ayat yang turun pada peristiwa Ifk (pembawa berita bohong) ayat ini sebagai pembaharuan oleh sebagian dari mereka yang mendustakan al-Qur'an dan menjauh darinya. Dan Allah telah benar dalam ayatNya: { بَلْ هُوَ خَيْرٌ لَّكُمْ } peristiwa ini memberikan kesadaran bagi ummat dan mereka menyaksikan hakikat dari pada suatu kaum. 2 ). Kepada mereka yang terus berlomba-lomba menyebarkan tayangan-tayangan haram di media sosial dan sebagainya: Perhatikan firman Allah: { لَّكُمْ ۚ لِكُلِّ ٱمْرِئٍ مِّنْهُم مَّا ٱكْتَسَبَ مِنَ ٱلْإِثْمِ ۚ وَٱلَّذِى تَوَلَّىٰ كِبْرَهُۥ مِنْهُمْ لَهُۥ عَذَابٌ عَظِيمٌ } \"Tiap-tiap seseorang dari mereka mendapat balasan dari dosa yang dikerjakannya. Dan siapa di antara mereka yang mengambil bahagian yang terbesar dalam penyiaran berita bohong itu baginya azab yang besar\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Cerita tentang kebohongan ini (pada ayat 18) bahwa sesungguhnya orang-orang yang membawa berita bohong kepadamu itu. Yaitu berita bohong yang menjadi berita bohong paling buruk tentang Sayyidah Fatimah ummul mukminin yang menuduhnya berzina itu adalah dari golongan kamu juga. Mereka adalah Abdullah bin Ubay, Zaid bin Rafa’ah, Hasan bin Tsabit, Misthah bin Atsatsah, Humnah binti Jahs dan orang-orang yang membantunya. Janganlah kamu kira bahwa berita bohong itu buruk bagi kamu bahkan ia adalah baik bagi kamu. Tiap-tiap seseorang dari mereka mendapat balasan dari dosa yang dikerjakannya. Dan siapa di antara mereka yang mengambil bahagian yang terbesar dalam penyiaran berita bohong itu baginya azab yang besar di akhirat. Ayat ini turun ketika Aisyah mendapat fitnah keji ketika perang dengan dengan Bani Mushthalaq. Ketika kalungnya jatuh dia kembali untuk mencarinya, sehingga tertinggal dari tentara tanpa diketahui bahwa Aisyah tertinggal."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang yang datang dengan berita bohong itu} dusta dan kebohongan paling buruk dengan menuduhkan bahwa ibunya orang-orang mukmin yaitu Aisyah RA berbuat keji {adalah kelompok di antara kalian} kelompok yang dihubungkan dengan kalian {Janganlah mengira} janganlah mengira bahwa kebohongan itu {bahwa hal itu buruk bagi kalian, sebaliknya itu baik bagi kalian. Bagi setiap orang dari mereka} setiap orang yang berbicara dengan dusta {balasan dari dosa yang diperbuat. Dan orang yang mengambil peran besar di antara mereka} yang menanggung kebohongan paling besar di antara mereka dengan mengawali kesesatan itu, yaitu Abdullah bin Ubay ibn Salul, pemimpin orang-orang munafik {maka baginya azab yang sangat berat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11 Firman Allah, “sesungguhnya orang-orang yang membawa berita bohong itu,” yaitu kedustaan yang keji, berupa tuduhan kepada Ummul Mukminin, “adalah dari golongan kamu juga,” maksudnya sekelompok orang yang menisbatkan diri kepada kalian, wahai kaum Mukminin. Diantara mereka, ada seorang Mukmin yang sejati dalam keimanannya, akan tetapi termakan oleh isu yang dihembuskan oleh orang-orang munafik. Sebagian lagi adalah orang-orang yang munafik. “janganlah kamu kira bahwa berita bohong itu buruk bagi kamu bahkan ia adalah baik bagi kamu,” karena mengandung (keterangan) tentang rehabilitasi nama Ummul Mukminin dari tuduhan keji, kesucian pribadi dan pengangkatan citranya. Pujian yang umum ini pun mencakup juga seluruh istri Nabi. (kejadian ini baik buat bagi kalian) lantaran memuat (juga) pengetengahan ayat-ayat yang sangat dibutuhkan oleh para hamba, yang akan terus berlaku sampai Hari Kiamat. Ini semua merupakan kebaikan yang sungguh besar, seandainya tidak ada isu komentar yang dilontarkan penyulut berita dusta ini, niscaya kebaikan-kebaikan itu tidak teraih. Bilamana Allah menghendaki suatu perkara, maka Dia akan menciptakan sebab kausalitas ke arahnya. Oleh karena itu, Allah menjadikan arah pembicaraan bersifat umum bagi seluruh kaum Mukminin. Allah mengabarkan bahwa celaan kepada sebagian kaum Mukminin hakikatnya seperti mencela dirinya sendiri. Dalam ayat ini, terdapat keterangan bahwasannya kaum Mukminin dalam kecintaan, kasih sayang, kelembutan dan kebersamaan mereka sesuai dengan kemaslahatan mereka ibarat jasad yang satu, dan seorang Mukmin dengan orang Mukmin lainnya, bak bangunan yang saling menguatkan. Sebagaimana seseorang tidak suka menodai siapapun melukai kehormatan saudaranya yang Mukmin yang sudah seperti dirinya sendiri. Bila ternyata seorang hamba belum sampai kepada keadaan ini, maka sesungguhnya itu terjadi karena imannya kurang dan tidak amu bersikap baik terhadap dirinya. “tiap-tiap orang dari mereka mendapat balasan dari dosa yang dikerjakannya,” ini adalah ancaman bagi orang-orang yang telah membawa cerita dusta, bahwa mereka akan dihukum sesuai dengan materi yang telah mereka katakan. Nabi telah menjatuhkan hukum had kepada sebagian mereka. “dan siapa (diantara mereka) yang mengambil bagian yang terbesar dalam penyiaran berita bohong itu,” yakni penyulut berita dusta, seorang munafik yang keji, ’Abdullah bin ubay salul, semoga laknat Allah tertuju kepadanya, “baginya azab yang besar.” Ketahuilah, azabnya adalah kekal abadi di neraka yang paling bawah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nur ayat 11: Imam Bukhari meriwayatkan dengan sanadnya yang sampai kepada Aisyah radhiyallahu 'anha ia berkata, “Rasulullah shallallahu 'alaihi wa sallam apabila keluar bepergian, melakukan undian di antara istri-istrinya, siapa di antara mereka yang keluar bagiannya, maka Rasulullah shallallahu 'alaihi wa sallam akan pergi bersamanya. ‘Aisyah berkata, “Maka Beliau melakukan undian di antara kami dalam suatu perang yang dilakukannya, ternyata bagianku yang keluar, maka aku keluar bersama Rasulullah shallallahu 'alaihi wa sallam setelah turun ayat hijab. Aku pun dibawa dalam sekedupku dan ditempatkan di situ. Kami pun berangkat, sehingga ketika Rasulullah shallallahu 'alaihi wa sallam telah selesai dari perang itu dan kembali pulang serta telah dekat ke Madinah, (saat itu Beliau telah singgah dan beristirahat pada sebagian malam) maka Beliau memberitahukan untuk melanjutkan perjalanan di malam itu. Ketika orang-orang saling memberitahukan keberangkatan, maka aku pun berdiri dan berjalan kaki melewati pasukan (untuk memenuhi urusannya). Setelah aku menyelesaikan urusanku, maka aku mendatangi tempatku, ternyata kalungku yang tersusun dari manik (berasal dari) Zhafar (daerah di Yaman) terlepas. Aku pun mencari kalung itu, pencarianku terhadapnya membuatku tertahan (tidak kembali), kemudian datanglah beberapa orang yang biasa mengangkut(sekedup)ku, lalu mereka mengangkut sekedupku dan menaruhnya di atas unta yang aku naiki, sedang mereka mengira bahwa aku sudah berada di dalamnya, dan biasanya kaum wanita agak ringan dan tidak banyak dagingnya (kurus), mereka biasa memakan sedikit makanan. Oleh karena itu, beberapa orang itu tidak merasakan apa-apa ketika sekedupnya ringan saat mereka angkut, dan lagi aku seorang wanita yang masih belia. Mereka pun membangkitkan unta-unta (yang beristirahat) dan berangkat, dan aku menemukan kalungku itu setelah mereka semua pergi. Aku datangi tempat mereka, ternyata tidak ada yang memanggil maupun memenuhi panggilan, aku pun pergi menuju tempat di mana sebelumnya aku berada, dan aku mengira bahwa mereka akan mencariku kemudian kembali kepadaku. Ketika aku duduk di tempatku, mataku tidak tahan sehingga aku tertidur. Ketika itu, Shafwan bin Al Mu’aththal As Sulami Adz Dzakwaniy berada di belakang pasukan, ia berjalan di akhir malam (setelah tertidur), ketika tiba waktu Subuh ia telah sampai di tempatku, ia pun melihat bayang-bayang hitam seorang manusia yang sedang tidur, ia pun mendatangiku dan mengenaliku ketika melihatku, dan ia melihatku sebelum turun ayat hijab. Aku pun bangun karena mendengar istirja’nya (ucapan innaa lillahi wa innaa ilaihi raaji’uun) saat ia mengenaliku, aku pun menutupi wajahku dengan jilbabku. Demi Allah, ia tidak berbicara satu kata pun kepadaku dan aku tidak mendengar kata-katanya selain istirja’nya, ia pun menundukkan untanya dan menginjak kedua kaki depan untanya, maka aku pun naik, dan ia pun berangkat menuntunku sampai kami menemui pasukan setelah mereka singgah di saat sinar matahari sangat panas di siang bolong. Ketika itu binasa orang yang binasa, dan orang yang mengambil bagian besar dalam kedustaan adalah Abdullah bin Ubay bin Salul. Kami pun tiba di Madinah, dan aku merasakan sakit selama sebulan sejak aku tiba (di Madinah), sedangkan orang-orang sibuk membicarakan berita dusta yang dibawa oleh yang membawanya, aku tidak menyadari sedikit pun tentang hal itu dan ia membuatku bimbang di tengah sakitku. Aku pun tidak melihat lagi kelembutan dari Rasulullah shallallahu 'alaihi wa sallam yang biasa aku lihat ketika aku sakit. Beliau hanya masuk, memberi salam dan berkata, “Bagaimana keadaan dirimu?” Lalu Beliau pergi, itulah yang membuatku gelisah dan aku tidak menyadari keburukan (yang terjadi) sehingga aku keluar setelah agak sembuh, lalu Ummu Misthah mengantarkan aku menuju area tinggi (di luar Madinah) yang menjadi tempat buang air kami dan kami biasa tidak keluar kecuali di malam hari dan begitulah seterusnya, dan hal itu sebelum kami membuat jamban di dekat rumah-rumah kami, dan kebiasaan kami seperti kebiasaan kaum Arab terdahulu dalam buang air, yaitu pergi jauh dari rumah. Kami merasa terganggu ketika memuat jamban di dekat rumah, maka aku berangkat dengan Ummu Misthah, yaitu putri Abu Ruhm bin ‘Abdi Manaf, sedangkan ibunya putri Shakhr bin ‘Amir bibi (dari pihak ibu) Abu Bakar Ash Shiddiq, sedangkan anaknya adalah Misthah bin Utsaatsah, maka aku dan Ummu Misthah kembali ke rumahku dan kami telah menyelesaikan urusan kami, lalu Ummu Misthah tersandung kainnya dan berkata, “Celaka Misthah,” aku pun berkata kepadanya, “Buruk sekali apa yang engkau ucapkan, apakah engkau memaki seseorang yang menghadiri perang Badar?” Ummu Misthah berkata, “Wahai wanita yang tidak sadar, tidakkah kamu mendengar ucapannya?” Aku berkata, “Apa yang ia ucapkan?” Maka Ummu Misthah memberitahukan ucapan orang-orang yang berdusta, maka bertambah sakitah aku. Ketika aku pulang ke rumah dan menemui Rasulullah shallallahu 'alaihi wa sallam, Beliau mengucapkan salam dan berkata, “Bagaimana keadaan dirimu?” Aku berkata, “Aku meminta izin untuk mendatangi ibu bapakku.” Aisyah berkata, “Ketika itu, aku ingin memastikan beritanya dari keduanya. Maka Rasulullah shallallahu 'alaihi wa sallam mengizinkanku, lalu aku datang kepada ibu bapakku, aku pun berkata kepada ibuku, “Wahai ibu, apa yang sedang dibicarakan orang-orang?” Ibunya menjawab, “Wahai anakku, tenangkan dirimu. Demi Allah, hampir tidak ada satu pun wanita cantik yang berada pada seseorang yang mencintainya dan ia memiliki banyak saningan wanita, kecuali mereka akan mencacatkannya.” Aisyah berkata, “Subhaanallah, apakah orang-orang membicarakan seperti ini?” Aku pun menangis pada malam itu sampai pagi hari dan air mata tidak henti-hentinya mengucur, aku bergadang sampai pagi hari sambil menangis, maka Rasulullah shallallahu 'alaihi wa sallam memanggil ‘Ali bin Abi Thalib dan Usamah bin Zaid ketika wahyu terlambat turun, Beliau bermusyawarah dengan keduanya apakah perlu menceraikan istrinya. Adapun Usamah bin Zaid mennyerahkan kepada Rasulullah shallallahu 'alaihi wa sallam, karena Beliau yang mengetahui kebersihan keluarganya dan yang mengetahui sejauh mana rasa cinta Beliau kepada mereka. Usamah berkata, “Wahai Rasulullah, (tahanlah) keluargamu, kami tidak mengetahui tentangnya selain kebaikan.” Sedangkan Ali bin Abi Thalib berkata, “Wahai Rasulullah, Allah tidak mempersempit engkau, wanita selainnya cukup banyak, jika engkau bertanya kepada wanita budak (milik Aisyah) tentu dia akan berkata benar terhadapmu.” Maka Rasulullah shallallahu 'alaihi wa sallam memanggil Barirah dan bersabda, “Wahai Barirah, adakah engkau melihat sesuatu yang meragukanmu?” Barirah menjawab, “Tidak demi Allah yang mengutusmu dengan kebenaran, aku tidak melihat padanya sesuatu (yang engkau tanyakan) yang dapat membuatku mencelanya selain karena dia masih belia yang terkadang tidur karena (menjaga) adonan keluarganya, lalu kambing datang dan memakannya (adonan itu).” Kemudian Rasulullah shallallahu 'alaihi wa sallam bangkit dan ketika itu Beliau meminta orang yang mau membelanya terhadap Abdullah bin Ubay bin Salul. Aisyah berkata, “Lalu Rasulullah shallallahu 'alaihi wa sallam bersabda di atas mimbar, “Wahai kaum muslimin! Siapa yang mau membelaku dari orang yang gangguannya sampai mengena kepada keluargaku? Demi Allah, aku tidak mengetahui tentang keluargaku selain kebaikan. Sungguh, orang-orang telah menyebutkan seorang laki-laki yang tidak aku ketahui selain kebaikan, dan ia tidaklah menemui keluargaku kecuali bersamaku.” Lalu Sa’ad bin Mu’adz Al Anshariy bangkit dan berkata, “Wahai Rasulullah, saya siap membelamu darinya. Jika ia termasuk suku Aus, maka aku akan menebas lehernya, dan jika ia termasuk saudara kami dari suku Khazraj, engkau tinggal menyuruh kami, maka kami akan melaksanakan perintahmu.” Lalu Sa’ad bin ‘Ubadah bangkit, sedangkan ia adalah tokoh Khazraj, dan sebelumnya ia adalah seorang yang saleh, akan tetapi kemarahannya bangkit, ia pun berkata kepada Sa’ad, “Demi Allah, engkau dusta. Jangan engkau bunuh dia dan engkau tidak akan sanggup membunuhnya.” Lalu Usaid bin Hudhair bangkit, sedang dia adalah putra paman Sa’ad bin Mu’adz, lalu ia berkata kepada Sa’ad bin ‘Ubadah, “Demi Allah, engkau berdusta, kami akan membunuhnya. Engkau adalah munafik dan membela kaum munafik, maka bangkitlah kedua suku; Aus dan Khazraj sampai mereka ingin berperang. Sedangkan Rasulullah shallallahu 'alaihi wa sallam berdiri di atas mimbar. Rasulullah shallallahu 'alaihi wa sallam senantiasa berusaha mendiamkan mereka sehingga mereka pun diam, dan Beliau pun diam.” Aisyah berkata, “Maka aku menangis pada hari itu tanpa berhenti dan tidak tidur malam.” Lalu kedua ibu-bapakku mendekatiku, sedangkan aku telah menangis selama dua malam dan satu hari, aku tidak tidur malam dan air mataku tidak berhenti menangis. Keduanya mengira bahwa tangisan itu membuka isi hatiku. Ketika keduanya duduk di dekatku, sedangkan aku dalam keadaan menangis, maka ada seorang wanita Anshar yang meminta izin menemuiku, maka aku mengizinkannya, ia pun menangis bersamaku. Ketika kami seperti itu, Rasulullah shallallahu 'alaihi wa sallam masuk menemui kami kemudian Beliau duduk, dan sebelumnya Beliau tidak pernah duduk di dekatku sejak diberitakan ini dan itu, dan sudah berlangsung sebulan tidak turun wahyu kepada Beliau berkenaan dengan aku. Rasulullah shallallahu 'alaihi wa sallam kemudian bersyahadat ketika telah duduk dan berkata, “Amma ba’du, wahai Aisyah, telah sampai berita kepadaku tentang kamu begini dan begitu. Jika engkau tidak bersalah, maka Allah akan membersihkan dirimu, dan jika engkau terjatuh melakukan dosa, maka mintalah ampunan kepada Allah dan bertobatlah kepada-Nya, karena seorang hamba apabila mengakui dosanya kemudian bertobat kepada Allah, maka Allah akan menerima tobatnya.” Setelah Rasulullah shallallahu 'alaihi wa sallam selesai mengucapkan kata-katanya, berhentilah air mataku sehingga aku tidak merasakan satu tetes pun darinya. “ Aku pun berkata kepada bapakku, “Jawablah perkataan Rasulullah shallallahu 'alaihi wa sallam,” Dia (bapakku) berkata, “Demi Allah, aku tidak mengetahui apa yang harus aku ucapkan kepada Rasulullah.” Aku pun berkata kepada ibuku, “Jawablah (perkataan) Rasulullah.” Ia (ibuku) berkata, “Aku tidak tahu apa yang harus aku ucapkan kepada Rasulullah shallallahu 'alaihi wa sallam.” Aku pun berkata, “Aku adalah seorang wanita yang masih belia, aku memang tidak banyak membaca Al Qur’an. Sesungguhnya aku, demi Allah, telah mengetahui bahwa engkau telah mendengar berita itu lalu berita itu menetap di hatimu dan kamu membenarkannya. Jika aku katakan, bahwa aku bersih daripadanya, dan Allah mengetahui bahwa diriku bersih, tentu engkau tidak akan membenarkan aku, dan jika aku mengaku terhadap suatu urusan yang Allah mengetahui bahwa aku bersih darinya, tentu engkau akan membenarkan aku. Demi Allah, aku tidak mendapatkan perumpamaan untuk kamu selain perkataan bapak Yusuf, yaitu “Kesabaran yang baik (itulah sikapku), dan kepada Allah-lah diminta terhadap apa yang kamu sifatkan.” Kemudian aku pindah dan tidur di kasurku. Ketika itu, aku mengetahui bahwa diriku bersih dan Allah akan membersihkan aku, akan tetapi demi Allah, aku tidak mengira bahwa Allah akan menurunkan wahyu tentang aku yang kemudian dibaca dan aku merasa sangat kecil jika sampai dibicarakan Allah dalam wahyu yang dibaca, akan tetapi aku berharap Rasulullah shallallahu 'alaihi wa sallam bermimpi dalam tidurnya, bahwa Allah membersihkan aku daripadanya. Demi Allah, Rasulullah shallallahu 'alaihi wa sallam tidak meninggalkan (tempatnya) dan tidak ada salah seorang dari ahlul bait yang keluar sampai diturunkan wahyu kepada Beliau, maka Beliau tampak keberatan (karena wahyu yang turun) sampai menetes keringat seperti mutiara padahal hari sangat dingin karena beratnya wahyu yang turun kepada Beliau. Setelah lenyap kesusahan itu dari Rasulullah shallallahu 'alaihi wa sallam, maka Beliau tertawa, dan kalimat yang pertama Beliau ucapkan kepada Aisyah radhiyallahu 'anha adalah, “Allah telah membersihkan kamu.” Lalu ibuku berkata, “Bangunlah kepadanya.” Aku pun berkata, “Tidak. Demi Allah, aku tidak akan bangun kepadanya dan tidak akan memuji selain Allah ‘Azza wa Jalla.” Allah ‘Azza wa Jalla menurunkan ayat, “Sesungguhnya orang yang membawa berita bohong itu adalah dari golongan kamu juga. Janganlah kamu mengir…dst. Sampai sepuluh ayat. Setelah Allah menurunkan tentang bersihnya aku, Abu Bakar Ash Shiddiq radhiyallahu 'anhu yang biasanya menafkahi Misthah bin Utsatsah karena hubungan kerabat dengannya dan karena fakirnya, berkata, “Demi Allah, saya tidak akan menafkahi Misthah lagi selamanya setelah ucapannya terhadap Aisyah,” maka Allah menurunkan ayat, “Dan janganlah orang-orang yang mempunyai kelebihan dan kelapangan di antara kamu bersumpah bahwa mereka (tidak) akan memberi (bantuan) kepada kaum kerabat(nya), orang-orang yang miskin dan orang-orang yang berhijrah pada jalan Allah, dan hendaklah mereka memaafkan dan berlapang dada. Apakah kamu tidak ingin bahwa Allah mengampunimu? Dan Allah adalah Maha Pengampun lagi Maha Penyayang.” (Terj. An Nuur: 22) Abu Bakar berkata, “Benar demi Allah, sesungguhnya aku ingin Allah mengampuniku.” Maka ia menafkahi Misthah lagi yang sebelumnya ia nafkahi, ia juga berkata, “Demi Allah, aku tidak akan menarik nafkah itu darinya selamanya.” Aisyah radhiyallahu 'anha berkata, “Rasulullah shallallahu 'alaihi wa sallam bertanya kepada Zainab binti Jahsy tentang masalahku, “Wahai Zainab, apa yang engkau ketahui atau apa pendapatmu?” Ia menjawab, “Wahai Rasulullah, aku menjaga pendengaran dan penglihatanku. Aku tidak mengetahui selain kebaikan.” Aisyah berkata, “Padahal dia antara istri Rasulullah shallallahu 'alaihi wa sallam yang bersaing denganku, maka Allah menjaganya dengan kewara’an, sedangkan saudarinya Hamnah hendak membelanya (dengan merendahkan Aisyah), dan ia termasuk orang yang binasa di antara para pemikul berita dusta.” (HR. Bukhari) Berita bohong ini tertuju kepada istri Rasulullah shallallahu 'alaihi wa sallam 'Aisyah radhiyallahu 'anha Ummul Mu'minin, setelah perang dengan Bani Mushtaliq bulan Sya'ban 5 H. Yakni golongan yang menisbatkan diri kepadamu, di antara mereka ada yang mukmin namun tertipu oleh buaian kaum munafik, dan di antara mereka ada orang-orang munafik. Karena di dalamnya terdapat pembersihan diri ummul mukminin (Aisyah radhiyallahu 'anha) dan kesuciannya, disebut tinggi namanya, sampai pujian itu mengena pula kepada semua ummahatul mukminin (istri-istri Nabi shallallahu 'alaihi wa sallam yang lain selain Aisyah), dan di dalamnya juga terdapat penjelasan terhadap ayat-ayat yang dibutuhkan manusia, dan senantiasa diberlakukan sampai hari kiamat. Semuanya terdapat kebaikan yang besar, kalau tidak ada peristiwa itu, tentu tidak ada beberapa kebaikan ini. Ini merupakan ancaman untuk mereka yang membawa kebohongan, bahwa mereka akan disiksa sesuai ucapannya, dan Nabi shallallahu 'alaihi wa sallam pun menegakkan had terhadap mereka. Yang mengambil bagian terbesar dalam kebohongan adalah Abdullah bin Ubay bin Salul, tokoh munafik. Dialah yang pertama membicarakan berita dusta dan yang menyebarkannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nur Ayat 11",
    "description": "Beralih dari penjelasan hukum li''n, Allah lalu mengisahkan salah satu kasus yang menimpa keluarga nabi, yang lazim disebut 'ad' al-ifk (berita bohong). Ayat ini mengecam mereka yang tanpa bukti menuduh 'aisyah berbuat zina dengan 'afw'n bin mu'a''al. Sesungguhnya orang-orang yang membawa dan dengan sengaja menyebarluaskan berita bohong itu adalah dari golongan kamu juga. Janganlah kamu mengi-ra berita bohong itu buruk bagi kamu, bahkan itu baik bagi kamu karena kamu dapat membedakan siapa yang munafik dan siapa mukmin sejati. Setiap orang dari mereka yang menyebarkan berita bohong tersebut akan mendapat balasan sesuai kadar dari dosa yang diperbuatnya. Dan barang siapa di antara mereka yang mengambil bagian terbesar dari dosa yang diperbuatnya, yakni orang yang menjadi sumber utama berita bohong itu, dia mendapat azab yang besar di akhirat nanti. 12. Ketika isu itu merebak, sebagian kaum muslim tidak percaya berita tersebut dan meyakini kesucian 'aisyah. Sebagian yang lain terdiam, tidak membenarkan dan tidak pula membantah'nya. Di satu sisi ayat ini mengecam mereka yang diam seakan membenarkan isu itu, dan di sisi lain menganjurkan mereka bersikap proaktif dan mengambil langkah positif. Mengapa orang-orang mukmin dan mukminat ketika mendengar berita bohong itu tidak berbaik sangka terhadap saudara-saudara me-reka yang dicemarkan namanya, padahal orang itu adalah bagian dari diri mereka sendiri, yakni sesama muslim; dan mengapa juga saat kamu mendengar berita bohong itu kamu tidak berkata, 'ini adalah berita bohong yang nyata. '."
  }
]