[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mengapa sebagian kaum Mukminin dan Mukminat tidak berprasangka baik kepada sebagian yang lain begitu mendengar isu dusta tersebut, yaitu bersihnya orang yang tertuduh dari tuduhan yang mereka lontarkan, dan kemudian berkata, “Ini adalah kebohongan nyata terhadap Aisyah.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Alangkah baiknya bila kaum mukminin dan mukminat mendengar berita bohong yang besar itu, mereka berprasangka baik terhadap kesucian mukmin yang dituduh tersebut, serta berkata, \"Ini adalah suatu berita bohong yang nyata\"."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "12. Allah menegur orang-orang beriman yang tidak ikut mengingkari kemungkaran besar ini: “Mengapa ketika kalian mendengar kedustaan ini kalian tidak berprasangka baik kepada Ummul Mukminin, Aisyah, dan membantah orang-orang yang menyebarkannya bahwa itu adalah kedustaan yang jelas.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "12. لَّوْلَآ إِذْ سَمِعْتُمُوهُ ظَنَّ الْمُؤْمِنُونَ وَالْمُؤْمِنٰتُ بِأَنفُسِهِمْ خَيْرًا (Mengapa di waktu kamu mendengar berita bohong itu orang-orang mukminin dan mukminat tidak bersangka baik terhadap diri mereka sendiri) Yakni orang-orang beriman ketika mendengar ucapan para pembawa berita bohong itu hendaklah mengukur hal itu pada diri mereka sendiri; jika itu sekiranya tidak mungkin terjadi pada mereka maka lebih mustahil lagi terjadi pada Ummul Mukminin ‘Aisyah. Diriwayatkan bahwa istri Abu Ayyub al-Anshari berkata kepadanya ketika para pendusta itu telah menuduh ‘Aisyah: “apakah kamu telah mendengar apa yang dikatakan orang-orang tentang ‘Aisyah? Abu Ayyub menjawab: “Ya, aku telah mendengarnya, dan itu adalah berita bohong. Apakah mungkin kamu akan melakukan hal seperti itu hai Ummu Ayyub?” dia menjawab: “demi Allah, itu tidak mungkin aku lakukan.” Lalu Abu Ayyub berkata: “demi Allah, sungguh ‘Aisyah lebih baik dan lebih suci darimu, itu semua hanyalah kebohongan dan tuduhan batil.” وَقَالُوا۟ هٰذَآ إِفْكٌ مُّبِينٌ(dan (mengapa tidak) berkata: “Ini adalah suatu berita bohong yang nyata”) Yakni kebohongan yang nyata."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12. Mengapa di waktu kamu mendengar berita bohong itu orang-orang mukmin dan mukminat tidak bersangka baik terhadap diri mereka sendiri, dan mengapa tidak berkata: \"Ini adalah suatu berita bohong yang nyata\"."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mengapa tidak} mengapa tidak {orang-orang mukmin laki-laki dan perempuan itu berprasangka baik pada diri mereka} pada saudara mereka {ketika mendengar berita bohong itu, dan berkata,“Ini adalah kebohongan yang nyata”} kebohongan yang jelas lagi nyata"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "12 kemudian Allah memberikan petunjuk kepada para hambaNya bila mendengar perkataan seperti ini. firmannNya, “mengapa diwaktu kamu mendengar berita bohong itu, orang-orang Mukminin dan Mukminat tidak bersangka baik terhadap diri mereka sendiri,” maksudnya kaum Mukminin menyangka sebagian mereka dengan prasangka yang baik, yaitu bebas dari tuduhan mereka. Sesungguhnya keimanan yang mereka punya akan menyingkirkan tuduhan dusta yang batil tentang mereka. “dan mereka mengatakan,” karena prasangka tersebut, “Mahasuci Engkau,” yakni untuk menyucikanMu dari segala kejelekan serta menyucikanMu dari penetapan ujian kepada hamba-hambaMu yang setia dengan segala perbuatan yang keji. “ini adalah suatu berita bohong yang nyata,” maksudnya dusta dan kebohongan termasuk perkara yang paling besar dan paling jelas. Ini adalah prasangka yang wajib dilakukan tatkala seorang Mukmin mendengar saudaranya seiman tertimpa tuduhan semacam ini, menjauhkannya dari lisannya dan mendustakan orang yang telah melontarkan itu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nur ayat 12: Selanjutnya Allah Subhaanahu wa Ta'aala mengarahkan hamba-hamba-Nya ketika mendengar berita seperti itu. Yakni bersihnya orang yang dituduhkan itu, yaitu ‘Aisyah radhiyallahu 'anha, dan lagi keimanan yang ada dalam diri mereka menolak berita dusta yang disampaikan itu. Maksudnya, masing-masing bersangka baik terhadap yang lain. Disebut “terhadap diri mereka sendiri” karena celaan yang ditujukan sebagian mereka kepada yang lain sama saja mencela diri mereka sendiri, karena kaum mukmin seperti sebuah jasad, dan antara mukmin yang satu dengan yang lain seperti sebuah bangunan, yang satu sama lain saling menguatkan. Oleh karena itu, hendaknya seseorang tidak mencela mukmin yang lain, karena yang demikian sama saja mencela dirinya sendiri, dan jika seseorang tidak bersikap seperti ini, maka yang demikian menunjukkan imannya lemah dan tidak memiliki sikap nasihah (tulus) terhadap kaum muslimin. Ketika mereka mendengar kata-kata itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nur Ayat 12",
    "description": "Ketika isu itu merebak, sebagian kaum muslim tidak percaya berita tersebut dan meyakini kesucian 'aisyah. Sebagian yang lain terdiam, tidak membenarkan dan tidak pula membantah'nya. Di satu sisi ayat ini mengecam mereka yang diam seakan membenarkan isu itu, dan di sisi lain menganjurkan mereka bersikap proaktif dan mengambil langkah positif. Mengapa orang-orang mukmin dan mukminat ketika mendengar berita bohong itu tidak berbaik sangka terhadap saudara-saudara me-reka yang dicemarkan namanya, padahal orang itu adalah bagian dari diri mereka sendiri, yakni sesama muslim; dan mengapa juga saat kamu mendengar berita bohong itu kamu tidak berkata, 'ini adalah berita bohong yang nyata. '13. Setelah mengecam umat islam yang pasif atas berita bohong itu, Allah lalu beralih berbicara tentang penyebar berita bohong itu. Diskursus pada ayat ini tidak diarahkan secara langsung kepada mereka untuk mengisyaratkan betapa besarnya kemurkaan Allah. Mengapa mereka yang menuduh itu tidak datang membawa empat saksi yang bersaksi atas kebenaran tuduhan mereka' oleh karena mereka tidak membawa saksi-saksi maka mereka itu dalam pandangan Allah, yaitu dalam ketetapan hukum-Nya, khususnya dalam kasus ini, adalah orang-orang yang berdusta."
  }
]