[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sekiranya bukan karena karunia Allah dan rahmatNya kepada kalian, yang mana kebaikanNya meliputi kalian dalam agama dan dunia kalian, sehingga tidak menyegerakan putusan siksaan bagi kalian dan berkenan menerima taubat orang yang bertaubat dari kalian, pastilah Dia akan menimpakan pada kalian siksaan besar disebabkan kalian tengggelam dalam pembicaraan tersebut."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Sekiranya kalau bukan karena karunia dan rahmat Allah kepada kalian semua -wahai orang-orang mukmin- yang mana Dia tidak menyegerakan azab atas kalian, serta menerima tobat orang-orang yang bertobat di antara kalian, niscaya kalian akan ditimpa azab yang besar lantaran pembicaraan kalian tentang berita bohong dan kedustaan tersebut atas Ummul mukminin."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "14-16. Allah mengolok orang-orang beriman yang ikut membincangkan tuduhan dusta ini: “Kalaulah bukan karena karunia Allah dengan menjelaskan hukum-hukumnya, dan karena rahmat-Nya dengan tidak segera menyiksa di dunia, serta karena ampunan-Nya di akhirat bagi orang yang bertaubat; niscaya kalian akan tertimpa azab yang besar akibat kalian ikut memperbincangkan tuduhan dusta itu dan menyebarkan di antara kalian apa yang tidak benar. Kalian menyangka itu adalah dosa kecil, padahal di sisi Allah itu termasuk dosa yang paling membinasakan. Mengapa ketika kalian mendengarnya, kalian tidak mengingkarinya dan menjelaskan keharamannya serta menyatakan keheranan terhadap penyebaran tuduhan itu dengan mengucapkan tasbih kepada Allah akibat kedustaan besar yang diarahkan kepada istri Rasulullah.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "14. فِى مَآ أَفَضْتُمْ فِيهِ (karena pembicaraan kamu tentang berita bohong itu) Yakni kalaulah bukan karena Aku telah memutuskan untuk memberi karunia kepada kalian di dunia yang diantaranya adalah menangguhkan azab, dan memberi kalian rahmat di akhirat dengan mengampuni kalian, niscaya Aku akan segera mengazab kalian akibat kebohongan yang kalian perbincangkan. Namun dengan rahmat-Nya Allah menutupi kesalahan kalian di dunia dan memberi rahmat di akhirat bagi orang yang bertaubat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14. Sekiranya tidak ada karunia Allah dan rahmat-Nya kepada kamu semua di dunia dan di akhirat, niscaya kamu ditimpa azab yang besar, karena pembicaraan kamu tentang berita bohong itu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika bukan karena karunia Allah dan rahmatNya kepada kalian di dunia dan akhirat, niscaya kalian ditimpa} sungguh kalian ditimpa {azab yang sangat berat karena apa yang kalian bahas panjang lebar} kalian bicarakan berupa berita bohong itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "14 “sekiranya tidak ada karunia Allah dan rahmatNya kepada kamu semua di dunia dan akhirat,” dimana kebaikan Allah telah melingkupi kalian di dunia dan akhirat pada urusan agama dan dunia kalian “niscaya kamu ditimpa karena pembicaraan kamu,” maksudnya, karena kalian larut (dalam pembicaraan itu)”di dalamnya,” berkaitan dengan berita bohong itu”azab yang besar,” kalian pantas mendapatkannya disebabkan ucapan yang telah kalian katakan. Akan tetapi, karena karunia Allah dan rahmatNya atas kalian, maka Dia mensyariatkan taubat atas kalian dan menjadikan hukuman sebagai pembersih dosa kalian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nur ayat 14: Yakni karena kamu sudah berhak menerimanya. Akan tetapi, karena karunia Allah dan rahmat-Nya kepada kamu, Dia mensyariatkan kepadamu tobat dan menjadikan hukuman sebagai penebus dosa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nur Ayat 14",
    "description": "Dan seandainya bukan karena karunia Allah sehingga dia tidak menyegerakan siksa-Nya, dan seandainya pula tidak ada rahmat-Nya yang berlimpah kepadamu di dunia dengan menerima tobat kamu, dan di akhirat dengan mengampuni siapa yang dikehendaki-Nya, niscaya kamu ditimpa azab yang besar disebabkan oleh pembicaraan kamu tentang hal bohong itu. 15. Kelompok ayat ini menggambarkan situasi ketika kabar bohong itu tersebar. Ingatlah ketika kamu menerima berita bohong itu dari mulut ke mulut dan kamu katakan dengan mulutmu sendiri, bukan dengan isyarat, apa yang tidak kamu ketahui sedikit pun duduk persoalannya, dan kamu menganggapnya sesuatu yang remeh dan tidak penting, padahal dalam pandangan Allah berita bohong itu adalah soal besar dan perbuatan yang sangat buruk."
  }
]