[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ketika kalian menangkap berita bohong tersebut dan menyebarluaskannya dari mulut ke mulut padahal itu merupakan perkataan yang batil, dan kalian tidak memiliki pengetahuan apa pun tentang (keakuratan) nya. Dan dua perkara itu terlarang, yaitu mengucapkan kebatilan dan berbicara tanpa dasar pengertahuan (yang benar). Dan kalian mengasumsikannya sebagai perkara yang sederhana, padahal di sisi Allah merupakan perkara besar. Di sini, terkandung larangan tegas dari menyepelekan masalah penyebarluasan kebatilan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Ingatlah di waktu berita bohong itu kalian terima dan kalian sebarkan dari mulut ke mulut meski sesuatu yang batil; padahal kalian tidak mengetahui kebenarannya sedikitpun, dan menganggapnya hal yang ringan saja, padahal ia di sisi Allah adalah besar karena di dalamnya terdapat kedustaan dan tuduhan palsu terhadap orang yang tidak bersalah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15. إِذْ تَلَقَّوْنَهُۥ بِأَلْسِنَتِكُمْ ((Ingatlah) di waktu kamu menerima berita bohong itu dari mulut ke mulut) Yakni mereka saling menceritakan berita itu, yakni ketika seseorang dari mereka bertemu dengan orang lain lalu berkata padanya: aku mendengar begini dan begitu. Mereka menceritakannya tanpa memeriksa kebenaran berita itu terlebih dahulu. وَتَقُولُونَ بِأَفْوَاهِكُم مَّا لَيْسَ لَكُم بِهِۦ عِلْمٌ (dan kamu katakan dengan mulutmu apa yang tidak kamu ketahui sedikit pun) Yakni berita yang mereka ucapkan itu hanya dari mulut-mulut mereka saja, tidak sesuai dengan kenyataan yang terjadi yang bersumber dari kesaksian langsung atau berita yang benar. وَتَحْسَبُونَهُۥ هَيِّنًا(dan kamu menganggapnya suatu yang ringan) Yakni sesuatu yang remeh yang tidak menimbulkan dosa. وَهُوَ عِندَ اللهِ عَظِيمٌ (Padahal dia pada sisi Allah adalah suatu yang besar) Yakni besar dosa dan siksanya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Abdullah bin Mas'ud pernah berkata: Tiada yang lebih dibutuhkan di muka bumi ini dari memenjarakan lisan dalam waktu yang panjang. 2 ). Diantara manusia ada yang menangkap percakapan dengan cepat tanpa menyaringnya dahulu, dan menyampaikannya tanpa memikirkan kebanaran dan kebohongan ucapan itu, dan tanpa menyesuaikannya dengan hati dan akalnya, Menyangka bahwa hal itu adalah perkara yang biasa, pada mereka ini Allah menurunkan ayatNya: { إِذْ تَلَقَّوْنَهُۥ بِأَلْسِنَتِكُمْ وَتَقُولُونَ بِأَفْوَاهِكُم مَّا لَيْسَ لَكُم بِهِۦ عِلْمٌ وَتَحْسَبُونَهُۥ هَيِّنًا وَهُوَ عِندَ ٱللَّهِ عَظِيمٌ } \"(Ingatlah) di waktu kamu menerima berita bohong itu dari mulut ke mulut dan kamu katakan dengan mulutmu apa yang tidak kamu ketahui sedikit juga, dan kamu menganggapnya suatu yang ringan saja. Padahal dia pada sisi Allah adalah besar.\" 3 ). \"dan kamu katakan dengan mulutmu\" Padahal seseorang tidak berkata apapun melankan dengan lisannya, namun maksud dari kalimat sebagai pengantar untuk kalimat setelahnya: \"apa yang tidak kamu ketahui sedikit juga\", dari ayat ini menunjukkan suatu adab yang bernilai tinggi, yaitu: bahwasanya seseorang tidak mengatakan dengan lisannya apa yang tidak ia ketahui dan tanpa memastikan kebanaran suatu ucapan, melainkan ia termasuk dari dua jenis manusia: orang yang sedikit akal, orang yang berucap tanpa tabayyun, sehingga dengan mudahnya ia berdusta, atau orang munafiq yang menyembunyikan kebenaran dan menyampaikan apa yang berbeda dari hakikatnya. 4 ), Seorang pembaca berita menceritakan, suatu ketika datang kepadaku satu pesan di handphone yang akhirnya merubah jalan hidupku, yaitu: { وَتَحْسَبُونَهُۥ هَيِّنًا وَهُوَ عِندَ ٱللَّهِ عَظِيمٌ } \"dan kamu menganggapnya suatu yang ringan saja. Padahal dia pada sisi Allah adalah besar.\""
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "15. Ingatlah di waktu kamu menerima berita bohong itu dari mulut ke mulut dan kamu katakan dengan mulutmu apa yang tidak kamu ketahui sedikit pun. Lalu kamu menganggapnya suatu yang ringan saja. Padahal kesalahan itu pada sisi Allah adalah besar."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Ketika kalian menyampaikannya} sebagian kalian menceritakan hal itu ke sebagian lain, lalu kalian saling menyampaikannya {dengan lisan kalian; kalian berkata dengan mulut kalian sesuatu yang tidak kalian ketahui sedikit pun; dan kalian menganggapnya} menggapnya {sebagai hal remeh} yang mudah, gampang, dan tidak ada tanggung jawab atas hal tersebut {padahal hal itu di sisi Allah adalah sesuatu yang besar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "15. “(ingatlah) di waktu kamu menerima berita bohong itu dari mulut ke mulut,” maksudnya, kalian menerima menggunjingkannya antara kalian dan menggencarkan pembicaraan itu, padahal merupakan perkataan yang batil. “dan kamu katakan dengan mulutmu sesuatu yang tidak kamu ketahui sedikitpun juga,” dua perkara ini terlarang; pembicaraan yang batil dan berkata tanpa dasar ilmu. “dan kamu menganggapnya sesuatu yang ringan saja.” Oleh sebab itu, orang yang lancang telah berani melakukannya dari kalangan kaum Mukminin yang telah bertaubat darinya, dan mereka membersihkan diri setelahnya. “padahal ia pada sisi Allah adalah besar,” ini mengandung peringatan yang keras tentang membiasakan berbuat sebagian dosa dengan menganggapnya sebagai sesuatu yang sepele. Sesungguhnya, persepsi seorang hamba tidak memberikan manfaat baginya sama sekali dan tidak (pula) meringankan hukuman dosanya, bahklan akan melipat gandakan dosanya dan dimudahkan untuk tergelincir melakukannya lagi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nur ayat 15: Keduanya adalah perkara haram; yaitu membicarakan sesuatu yang batil dan berbicara tanpa ilmu. Yakni tidak ada dosa di sana. Ulama menjelaskan, bahwa dosa kecil bisa menjadi besar apabila dilakukan terus-menerus, meremehkannya, bangga dalam mengerjakannya atau pun terang-terangan melakukannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nur Ayat 15",
    "description": "Kelompok ayat ini menggambarkan situasi ketika kabar bohong itu tersebar. Ingatlah ketika kamu menerima berita bohong itu dari mulut ke mulut dan kamu katakan dengan mulutmu sendiri, bukan dengan isyarat, apa yang tidak kamu ketahui sedikit pun duduk persoalannya, dan kamu menganggapnya sesuatu yang remeh dan tidak penting, padahal dalam pandangan Allah berita bohong itu adalah soal besar dan perbuatan yang sangat buruk. 16. Dan mengapa kamu tidak berkata dengan tegas dan secara langsung ketika mendengarnya, 'tidak pantas bagi kita membicarakan berita bohong ini, lebih-lebih terhadap istri nabi. Mahasuci engkau ya Allah, ini adalah kebohongan yang besar. '."
  }
]