[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan mengapa kalian tidak mengatakan, ketika mendengar berita bohong itu, “Tidak boleh bagi kami untuk mengatakan kebohongan ini, sebagai penyucian bagiMu (wahai Tuhanku) dari tuduhan tersebut pada istri RasulMu, Muhammad.” Ini adalah satu bentuk kedustaan besar ditinjau dari sisi tanggungan kesalahan dan dosa yang pantas diterima."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Dan mengapa kalian tidak berkata di waktu mendengar berita bohong itu, \"Sekali-kali tidaklah pantas bagi kita membicarakan perkara yang keji ini, demi mensucikan-Mu wahai Tuhan kami, dan tuduhan keji terhadap Ummul mukminin ini adalah dusta yang besar\"."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "16. وَلَوْلَآ إِذْ سَمِعْتُمُوهُ قُلْتُم مَّا يَكُونُ لَنَآ أَن نَّتَكَلَّمَ بِهٰذَا (Dan mengapa kamu tidak berkata, diwaktu mendengar berita bohong itu: “Sekali-kali tidaklah pantas bagi kita memperkatakan ini) Ini merupakan celaan bagi semua orang beriman yang ikut memperbincangkan berita bohong itu. Yakni mengapa ketika kalian mendengar berita bohong itu kalian tidak mendustakan orang yang memperbincangkannya dengan berkata kepada mereka “kami tidak boleh dan tidak pantas untuk membicarakan hal ini, dan itu tidak mungkin kami lakukan apapun yang terjadi. سُبْحٰنَكَ(Maha Suci Engkau) Kalimat ini untuk mengungkapkan rasa heran terhadap mereka yang datang membawa berita bohong itu. هٰذَا بُهْتٰنٌ عَظِيمٌ (ini adalah dusta yang besar) Makna (البهتان) adalah membicarakan seseorang apa yang tidak sesuai dengan kenyataannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16. Mengapa di waktu mendengar berita bohong itu kamu tidak berkata: \"Sekali-kali tidaklah pantas bagi kita membicarakan ini, Maha Suci Engkau Ya Tuhan kami, ini adalah dusta yang besar\" Buhtan adalah mengatakan kepada orang lain tentang berita bohong atas seseorang. Kalimat subhanallah diucapkan oleh orang Arab ketika mereka takjub dengan sesuatu yang langka yang luar biasa."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mengapa kalian tidak} mengapa tidak {berkata ketika mendengarnya,“Tidak pantas bagi kita} tidak benar bagi kita {untuk membicarakan ini. Maha suci Engkau. Ini adalah kebohongan} kebohongan dan tipu daya {yang besar”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "16 “dan mengapa kamu tidak pada waktu mendengar berita bohong itu,” maksudnya, tidaklah kalian, wahai kaum Mukminin ketika mendengar berita bohong itu “kalian katakan,” untuk mengingkari hal itu dan menganggapnya sebagai persoalan yang besar, “sekali-kali tidaklah pantas bagi kita mengatakan ini,” maksudnya, tidak patut dan tidak layak bagi kami untuk mengucapkan perkataan yang sangat jelas kedustaannya ini. Karena seorang Mukmin, keimannanya akan mencegah dirinya untuk melakukan kenistaan-kenistaan ini. “ini adalah dusta,” kebohongan “yang besar,”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nur ayat 16: Kalimat tasbih disunahkan diucapkan ketika keheranan (takjub). Maksud kalimat, “Mahasuci Engkau (ya Allah),” di sini adalah menyucikan Allah dari semua keburukan dan dari memberikan bala’ kepada hamba-hamba pilihan-Nya dengan menjadikan mereka mengerjakan perkara-perkara keji."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nur Ayat 16",
    "description": "Dan mengapa kamu tidak berkata dengan tegas dan secara langsung ketika mendengarnya, 'tidak pantas bagi kita membicarakan berita bohong ini, lebih-lebih terhadap istri nabi. Mahasuci engkau ya Allah, ini adalah kebohongan yang besar. '17. Demikianlah Allah memperingatkan kamu agar tunduk dan patuh pada ketentuan-Nya, dan melarang kamu kembali mengulangi perbuat-an seperti itu untuk selama-lamanya, jika kamu benar-benar orang ber-iman. Dan Allah menjelaskan ayat-ayat-Nya serta bentuk-bentuk akhlak yang mulia kepada kamu agar kamu melaksanakannya. Dan Allah maha mengetahui keadaan kamu, mahabijaksana dalam segala aturan-Nya."
  }
]