[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah mengingatkan dan melarang kalian dari mengulangi tindakan serupa selamanya, berupa melontarkan tuduhan dusta, bila kalian beriman kepadaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Allah memperingatkan dan menasihati kalian agar jangan kembali membuat tuduhan dusta selama-lamanya yang membuat kalian menuduh orang yang tak bersalah melakukan perbuatan keji, jika kamu orang-orang yang beriman kepada Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "17-18. Allah memperingatkan kalian agar tidak kembali melakukan dosa besar semacam ini selamanya jika kalian beriman kepada Allah dan rasul-Nya. Dan Allah menjelaskan kepada kalian ayat-ayat yang mengandung adab-adab yang mulia. Allah Maha Mengetahui perkataan dan perbuatan kalian, dan Maha Bijaksana dalam menetapkan hukum-hukum-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17. Allah memperingatkan kamu agar jangan kembali berbuat yang seperti itu selama-lamanya, jika kamu orang-orang yang beriman."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah memperingatkan kalian} Allah mencegah kalian {kembali mengulangi seperti itu selamanya jika kalian adalah orang-orang mukmin"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17 “Allah memperingatkan kamu agar (jangan) kembali melakukan yang seperti itu,” yaitu perbuatan serupa, seperti menuduh kaum Mukminin dengan perbuatan jahat. Allah menasihati dan memperingatkan kalian dari perkara itu. Sebaik-baik nasihat dan peringatan adalah dari Rabb kita. Maka wajib atas kita untuik meresponnya dengan penuh penerimaan, tulus, tunduk pasrah dan arsa syukur atas keterangan yang sudah dijelaskan kepada kita. Sesungguhnya Allah adalah sebaik-baiknya Dzat yang memberi nasihat kepada kalian “jika kalian orang-orang yang beriman.” Ini mengindikasikan bahwa keimanan yang benar akan menghalangi pemiliknya dari perbuatan yang haram."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nur ayat 17: Sebaik-baik nasehat adalah nasehat Allah, oleh karena itu kita wajib menerima dan tunduk serta bersyukur kepada-Nya. Yaitu menuduh orang mukmin berbuat keji. Ayat ini menunjukkan, bahwa iman yang benar akan menghalangi pemiliknya dari mengerjakan perbuatan haram."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nur Ayat 17",
    "description": "Demikianlah Allah memperingatkan kamu agar tunduk dan patuh pada ketentuan-Nya, dan melarang kamu kembali mengulangi perbuat-an seperti itu untuk selama-lamanya, jika kamu benar-benar orang ber-iman. Dan Allah menjelaskan ayat-ayat-Nya serta bentuk-bentuk akhlak yang mulia kepada kamu agar kamu melaksanakannya. Dan Allah maha mengetahui keadaan kamu, mahabijaksana dalam segala aturan-Nya. 19. Allah mengarahkan ayat ini kepada pihak-pihak yang merasa senang dengan tersebarnya isu negatif tersebut. Sesungguhnya orang-orang yang ingin agar perbuatan yang sangat keji, yaitu berita bohong itu tersiar di kalangan orang-orang yang beriman, maka mereka akan mendapat azab yang pedih di dunia dengan hukuman yang tepat, dan demikian pula akan mendapat siksa yang pedih di akhirat apabila mereka tidak bertobat. Dan Allah mengetahui segala sesuatu, termasuk niat buruk para penyebar kebohongan itu, sedang kamu tidak mengetahui secara pasti motif mereka."
  }
]