[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Allah menerangkan kepada kalian ayat-ayat yang memuat hokum-hukum syari dan nasihat-nasihat. Dan Allah Maha Mengetahui perbuatan-perbuatan kalian, lagi Mahabijaksana dalam syariat dan pengaturanNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Dan Allah menerangkan ayat-ayat-Nya yang mengandung berbagai hukum dan nasihat kepada kalian. Dan Allah Maha Mengetahui apa yang kalian kerjakan, tidak ada sesuatupun yang tersembunyi bagi-Nya, dan Dia pasti akan memberikan kalian balasan atasnya, juga Maha Bijaksana dalam pengaturan dan syariat-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "18. Allah menerangkan ayat-ayat-Nya kepada kamu. Dan Allah Maha Mengetahui atas kondisi kalian lagi Maha Bijaksana atas segala perbuatan-Nya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah menjelaskan} menerangkan {ayat-ayat kepada kalian. Allah Maha Mengetahui lagi Maha bijaksana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "18 “dan Allah menerangkan ayat-ayatNya kepada kamu,” yang mencakup keterangan hukum-hukum, nasihat, ancaman, anjuran dan nperinagtan, dan menjelaskan kepada kalian dengan sejelas-jelasnya”dan Allah maha mengetahui lagi (Mahabijaksana),” maksudnya, ilmuNya sempurna dan sifat hikmahNya merata. Diantara (cerminana) ilmu dan hikmahNYa, bahwa Allah mengajarkan kalian sebagian ilmuNya, walaupun hal ini, kembali pada maslahat yang akan kalian rasakan pada setiap waktu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nur ayat 18: Yang mengandung hukum-hukum, nasehat, larangan, targhib dan tarhib, dsb. Tentang apa yang perlu diperintahkan kepadamu dan tentang apa yang perlu dilarang kepadamu. Dalam perintah dan larangan itu. Dia menerangkan hikmah dari perintah dengan menerangkan kebaikan yang ada di dalamnya, dan menerangkan hikmah dari larangan itu dengan menerangkan keburukan yang menghendaki untuk ditinggalkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nur Ayat 18",
    "description": "Allah mengarahkan ayat ini kepada pihak-pihak yang merasa senang dengan tersebarnya isu negatif tersebut. Sesungguhnya orang-orang yang ingin agar perbuatan yang sangat keji, yaitu berita bohong itu tersiar di kalangan orang-orang yang beriman, maka mereka akan mendapat azab yang pedih di dunia dengan hukuman yang tepat, dan demikian pula akan mendapat siksa yang pedih di akhirat apabila mereka tidak bertobat. Dan Allah mengetahui segala sesuatu, termasuk niat buruk para penyebar kebohongan itu, sedang kamu tidak mengetahui secara pasti motif mereka. -."
  }
]