[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang yang suka tersebarnya perbuatan keji di tengah kaum Muslimin, berupa tuduhan zina atau perkataan yang buruk, bagi mereka azab yang pedih di dunia dengan dilaksanakannya hukum had (pidana) atas mereka dan musibah dunia lainnya yang akan menimpanya, dan di akhirat, bagi mereka siksaan neraka, bila mereka tidak bertaubat kepada Allah. Dan Allah semata yang mengetahui kedustaan mereka, juga mengetahui kemaslahatan hamba-hambaNya dan kesudahan segala perkara, sedangkan kalian tidak mengetahui hal itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Sesungguhnya orang-orang yang ingin kemunkaran tersebut -termasuk tuduhan berzina- tersiar di kalangan orang-orang yang beriman, bagi mereka azab yang pedih di dunia dengan diberikan hukuman had atas mereka, dan juga di Akhirat kelak mereka mendapatkan azab Neraka. Sungguh Allah mengetahui kebohongan mereka dan segala perkara hamba-hamba-Nya beserta maslahat mereka, sedang kamu tidak mengetahui hal tersebut."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "19. Setelah Allah memperingatkan orang-orang beriman agar tidak kembali ikut membicarakan berita bohong itu, kemudian Allah memperingatkan mereka dari perbuatan yang bisa jadi akan mereka lakukan di kemudian hari, yaitu dengan memperingatkan dari kegemaran menyebarkan perbuatan keji di kalangan orang-orang beriman; maka orang-orang yang berusaha menyebarkan perbuatan zina dan menyebarkan berita dusta tentang zina di kalangan orang beriman maka bagi mereka hukuman qazaf (hukuman akibat menuduh orang lain berbuat zina) di dunia, sedangkan di akhirat mereka akan mendapatkan siksa neraka. Hanya Allah yang mengetahui kebenaran yang sesungguhnya dan rahasia-rahasia yang tersembunyi, sedangkan kalian tidak mengetahuinya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "19. إِنَّ الَّذِينَ يُحِبُّونَ أَن تَشِيعَ الْفٰحِشَةُ (Sesungguhnya orang-orang yang ingin agar perbuatan yang amat keji itu tersiar) Yakni tersebarnya perbuatan zina. فِى الَّذِينَ ءَامَنُوا۟ (di kalangan orang-orang yang beriman) Yakni orang-orang beriman yang senantiasa menjaga kehormatan dirinya. لَهُمْ عَذَابٌ أَلِيمٌ فِى الدُّنْيَا(bagi mereka azab yang pedih di dunia) Dengan hukuman had baginya. وَالْاٰخِرَةِ ۚ( dan di akhirat) Dengan azab neraka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Tersebarnya berita-berita bohong menciptakan kerusakan yang besar, dan sesungguhnya yang menjauhkan manusia dari kerusakan adalah ketakuan mereka sendiri kepadanya, maka jika orang-orang terus menyampaikan berita-berita yang berkaitan dengan kejahatan; maka akan semakin berkurang kejadiannya ditelinga, dan jiwa-jiwa akan berani bertindak, oleh karena itu Allah berfirman: { وَٱللَّهُ يَعْلَمُ وَأَنتُمْ لَا تَعْلَمُونَ } \"Dan Allah mengetahui, sedang, kamu tidak mengetahui.\" 2 ). Orang berakal sehat adalah dia yang menyadari akan kekurangan dirinya, dan berusaha untuk memperbaikinya, bukan mereka yang kerap mencari-mencari kekurangan orang lain kemudian menyebarkannya di hadapan manusia. 3 ). Kecintaan pada tersebarnya kekejian akan mengundang segala media buruk untuk menyambut kekejian ini, baik itu dengan ucapa, atau dengan perbuatan, atau dengan menyepakatinya, dan ancaman yang keras ini tertuju kepada pihak-pihak yang mengajak wanita-wanita muslimah untuk melepaskan hijab mereka, dan berlepas dari segala atran yang telah ditetapkan oleh syariat. 4 ). { إِنَّ ٱلَّذِينَ يُحِبُّونَ أَن تَشِيعَ ٱلْفَٰحِشَةُ } \"Sesungguhnya orang-orang yang ingin agar (berita) perbuatan yang amat keji itu tersiar\" masuk dalam kategori ini ajakan-ajakan yang mengundang para wanita untuk keluar dari tempat teduhnya (rumahnya), dan bisa jadi orang yang ada iman dalam hatinya pun terjerumus ke dalam ajakan itu; karena melihat banyaknya panggilan dan jumlah pegiat yang terus bertambah sehingga membuatnya berfikir bahwa hal itu adalah biasa. 5 ). Dalam ayat ini ada ancaman dari Allah yang tidak akan meninggalkan siapapun yang berperan dalam pengadaan suatu kerusakan dan pengrusakan di muka bumi dengan ancaman azab yang pedih baik di dunia dan di akhirat, baik itu azab yang dirasakan langsung ataupun secara bathin, baik itu siksaan yg kita ketahui ataupun tidak; oleh karena itu dipenghujung ayat Allah berfirman: { وَٱللَّهُ يَعْلَمُ وَأَنتُمْ لَا تَعْلَمُونَ } \"Dan Allah mengetahui, sedang, kamu tidak mengetahui.\" sebagai penawar hati orang-orang beriman, dan menyingkirkan kotoran hati mereka. 6 ). Jika salah seorang dari imam berusaha memperbaiki seorang pengikutnya atau kaum mukminin, maka ini adalah kebaikan, dan jika yang memperbaiki adalah Rasulullah, maka tidak ada lagi jalan untuk keburukan. Maka bagaimana jika yang mendatangkan perbaikan dan menjamin suatu keutamaan dan kemuliaan adalah Allah ta'ala? dan inilah yang terjadi pada seluruh ummatul mukminin, khususnya 'Aisyah dimana Allah menurunkan ayat-ayat ini tentang kesuciannya dari tuduhan yang dilemparkan oleh sebagian orang. 7 ). Jika ancaman dari Allah yang keras ini saja turun bagi mereka yang menuangkan tuduhan keji kepada Ibunda 'Aisyah, dan ayat-ayat itu tidak turun kecuali setelah terjadinya perstiwa Ifk, lalu bagaimana dengan mereka yang berusaha melemparkan tuduhan-tuduhan keji kepada Aisyah seteah turunnya ayat yang dengan jelas menunjukkan kesucian beliau dari tuduhan-tuduhan itu?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19. Sesungguhnya orang-orang yang ingin agar berita perbuatan yang amat keji itu yaitu zina, tersiar di kalangan orang-orang yang beriman yang selalu menjaga diri, maka bagi mereka azab yang pedih di dunia dengan didera dan di akhirat dengan azab neraka. Allah Maha mengetahui atas apa yang tersembunyi dan juga yang tampak, sedang kamu tidak mengetahui"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang yang senang atas tersebarnya} tersebar {perbuatan yang keji itu} zina dan perkataan yang buruk {di kalangan orang-orang yang beriman, bagi mereka itu azab yang sangat pedih di dunia dan akhirat. Allah mengetahui, sedangkan kalian tidak mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "19 “sesungguhnya orang-orang yang ingin agar (berita) perbuatan yang amat keji itu tersiar,” yaitu perkara yang keji lagi buruk, lalu mereka menyukai kejelekan lebih menyabar “di kalangan orang-orang yang beriman, maka mereka mendapatkan azab yang pedih,” yaitu, azab yang memedihkan hati, dan badan, lanatran tipuan mereka terhadap saudaranya sesama kaum muslimin, gembira dengan keburukan yang menimpa mereka dan lancang menodai kehormatan mereka. Bilamana ancaman ini ditunjukkan hanya atas perasaan senang agar kekejian tersebar dan menikmatinya dengan hati mereka, lalu bagaimana (hukumannya) atas perbuatan yang lebih parah dari itu, dengan memunculkan dan menyebarkannya? Sama saja, apakah kekejian itu terjadi ataupun tidak terjadi. Semua ini berasal dari rahmat Allah untuk para hambaNya yang beriman, menjaga kehormatan-kehormatan mereka, sebagaimana Allah telah menjaga harta dan darah mereka, menyuruh mereka untuk menjalin solidaritas, agar salah seorang diantara mereka mencintai kebaikan untuk saudaranya yang dia sukai bagi dirinya, serta membenci keburukan untuk saudaranya yang dia benci buat dirinya. “dan Allah mengetahui, sedang kamu tidak mengetahui,” oleh karena itu, Allah memberitahu kalian dan menerangkan kepada kalian dengan apa yang kalian tidak ketahui."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nur ayat 19: Baik bagi hati maupun badan. Yang demikian karena sifat ghisy (keinginan merugikan) saudaranya kaum muslimin, ingin keburukan menimpa mereka, dan berani menodai kehormatan mereka. Jika ancaman ini disebabkan karena keinginan agar perkara keji tersebar di tengah-tengah kaum mukmin, lalu bagaimana jika ditampakkan dan dipindahkan ke tengah-tengah kaum muslimin? Ini semua termasuk rahmat Allah kepada hamba-hamba-Nya kaum mukmin dan untuk menjaga kehormatan mereka, sebagaimana Dia telah menjaga darah dan harta mereka, dan memerintahkan mereka sesuatu yang dapat membuat mereka tetap bersatu dan agar mereka saling mencintai kebaikan didapatkan oleh saudaranya. Dengan mendapatkan had qadzaf. Dengan mendapat neraka. Oleh karena itulah, Dia mengajarkan kamu dan menerangkan kepada kamu apa yang tidak kamu ketahui."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nur Ayat 19",
    "description": "-20. Dan kalau bukan karena karunia Allah dan rahmat-Nya kepadamu, niscaya kamu akan ditimpa azab yang besar akibat kedurhakaan kamu, tetapi bencana itu tidak segera Allah jatuhkan karena dia memberi kamu kesempatan untuk bertobat. Sungguh, Allah maha penyantun dengan menangguhkan siksa-Nya, maha penyayang kepada orang-orang yang beriman, utamanya di akhirat."
  }
]