[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wanita pezina dan lelaki pezina yang belum pernah menjalani pernikahan sebelumnya, hukuman masing-masing mereka adalah seratus cambukan, dan bersama itu terdapat hokum tetap dalam as-Sunnah, yaitu pengasingan selama setahun. Dan janganlah rasa iba kalian terhadap mereka berdua mendorong kalian meninggalkan hukman pidana tersebut atau meringankannya, bila kalian beriman kepada Allah dan Hari Akhir, serta menjalankan hokum-hukum islam. Dan hendaknya menyaksikan pelaksanaan hukuman itu sejumlah orang dari kalangan kaum Mukminin, sebagai bentuk perlakuan buruk (bagi pelaku), pencegahan, nasihat dan pelajaran (bagi orang lain)."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Pezina wanita yang masih gadis dan pezina laki-laki yang masih bujang, maka cambuklah setiap mereka seratus kali, dan janganlah kalian merasa belas kasihan kepada keduanya yang membuat kalian enggan menjalankan hukuman had atau meringankan had tersebut kepada keduanya bila kalian memang benar-benar beriman kepada Allah dan hari kemudian. Dan hendaknya pelaksanaan hukuman had keduanya dihadiri oleh sekumpulan orang-orang mukmin agar mereka mengenal keduanya, serta untuk memberikan efek jera bagi keduanya dan selain keduanya (yang ingin melakukan zina)."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "2. Pezina laki-laki dan pezina perempuan yang belum menikah, cambuklah masing-masing seratus cambukan dan asingkanlah dia selama satu tahun -sebagaimana disebutkan dalam sunnah nabawiyah- sebagai balasan atas kejahatan mereka itu. dan janganlah sekali-kali rasa kasihan terhadap keduanya membuat kalian membatalkan hukum Allah ini jika kalian beriman kepada Allah dan hari akhir. Dan hendaklah orang beriman -satu orang atau lebih- menyaksikan pelaksanaan hukuman ini agar menjadi pelajaran baginya. Dari Abu Hurairah dan Zaid bin Khalid, berkata: Ada dua orang yang mengajukan perkara mereka kepada Rasulullah. Salah seorang dari mereka berkata: “Putuskanlah perkara kami sesuai dengan kitabullah”, dan seorang lagi berkata -dan orang ini lebih pandai-: “Benar wahai Rasulullah, putuskanlah perkara kami sesuai kitabullah, dan izinkanlah aku mengungkapkan perkara ini”. Rasulullah menjawab: “ungkapkanlah”. Maka dia berkata: “Anakku adalah ‘asif’ dari orang ini -Imam Malik berkata, yang dimaksud dengan ‘asif’ adalah kuli-, namun anakku ini berzina dengan istrinya. Orang-orang memberitahukanku bahwa hukuman bagi anakku adalah hukuman rajam, maka aku menebusnya dengan 200 ekor kambing dan seorang budak perempuanku. Kemudian aku bertanya kepada orang-orang yang berilmu, dan mereka memberitahuku bahwa hukuman bagi anakku adalah hukum cambuk seratus kali dan diasingkan selama satu tahun, sedangkan hukum rajam hanya bagi istri orang ini.” Rasulullah menjawab: “Demi jiwaku yang berada di tangan-Nya, sungguh aku akan memutuskan perkara kalian sesuai dengan kitabullah; kambing dan budak perempuanmu harus dikembalikan kepadamu, kemudian anakmu harus dicambuk seratus cambukan dan diasingkan selama setahun.” Lalu Rasulullah memerintahkan Anis al-Aslami mendatangi istri si orang kedua tersebut dan bertanya tentang perkara perzinaannya, jika dia mengakui maka dia harus dihukum rajam. Wanita itu mengakui perbuatannya, maka dia mendapat hukuman rajam. (Shahih al-Bukhari 11/532, kitab sumpah dan nazar, bab bagaimana Rasulullah bersumpah, no. 6633, 6634. Dan shahih Muslim 3/1324-1325, no. 1697, 1698)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. الزَّانِيَةُ وَالزَّانِى فَاجْلِدُوا۟ كُلَّ وٰحِدٍ مِّنْهُمَا (Perempuan yang berzina dan laki-laki yang berzina, maka deralah tiap-tiap seorang dari keduanya) Zina adalah hubungan badan antara laki-laki dan perempuan tanpa hubungan pernikahan antara keduanya. Makna (الزانية) adalah perempuan yang rela untuk diajak berbuat zina, tanpa ada keengganan darinya. Makna (الجلد) adalah pukulan dengan menggunakan cambuk atau tongkat. Dikatakan (جلده) jika ia dipukul pada kulitnya. مِا۟ئَةَ جَلْدَةٍ ۖ( seratus kali dera) Ini merupakan hukum had bagi pezina laki-laki lajang atau perempuan gadis, dan dalam hadits disebutkan pula hukuman tambahan berupa pengasingan selama satu tahun. Adapun bagi pezina merdeka yang telah menikah hukumannya adalah rajam, sebagaimana disebutkan dalam hadits shahih dan mutawattir. Ayat ini adalah ayat yang menghapus hukum ayat yang menyebutkan hukuman kurungan dan siksaan bagi pezina, yaitu ayat 15 dan 16 pada surat an-Nisa’. Ayat ini ditujukan bagi para pemimpin atau yang mendapat wewenang untuk memutuskan perkara. Namun pendapat lain mengatakan bahwa ayat ini ditujukan bagi seluruh kaum muslimin namun mereka terwakili oleh para pemimpin. وَلَا تَأْخُذْكُم بِهِمَا رَأْفَةٌ فِى دِينِ اللهِ (dan janganlah belas kasihan kepada keduanya mencegah kamu untuk (menjalankan) agama Allah) Makna (الرأفة) adalah belas kasihan. Dan pendapat lain mengatakan maknanya adalah rasa kasihan yang paling dalam. إِن كُنتُمْ تُؤْمِنُونَ بِاللهِ وَالْيَوْمِ الْاٰخِرِ ۖ (jika kamu beriman kepada Allah, dan hari akhirat) Yakni jika kalian percaya kepada keesaan Allah dan hari kebangkitan yang terdapat pembalasan amal perbuatan di sana, maka janganlah kalian tidak menjalankan hukum had. وَلْيَشْهَدْ عَذَابَهُمَا طَآئِفَةٌ مِّنَ الْمُؤْمِنِينَ(dan hendaklah (pelaksanaan) hukuman mereka disaksikan oleh sekumpulan orang-orang yang beriman) Yakni agar sebagian kaum muslimin hadir menyaksikan untuk menambah rasa tersiksa bagi kedua pelaku zina, dan agar keburukan dan aib mereka berdua tersebar, serta supaya perbuatan ini dijauhi karena keburukan pelakunya akan tersebar di kalangan orang banyak."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ وَلَا تَأْخُذْكُم بِهِمَا رَأْفَةٌ فِى دِينِ ٱللَّ } \"dan janganlah belas kasihan kepada keduanya mencegah kamu untuk (menjalankan) agama Allah\" Allah melarang dari bermudah-mudahan dan lalai dalam menjalankan hukuman terhadap dosa yang dilakukan pada umumnya, dan secara khusus hukuman dosa zina secara khusus ditegaskan; karena dosa ini dibangun dari keinginan yang tidak terkendali dan syahwat yang jahat, sehingga syaithon mengiasi hati orang-orang yang kerap cenderung terhadap dosa ini, sampai-sampai begitu banyak manusia yang terjerumus dan memberikan kemudahan untuk berlangsungnya dosa ini, bahkan mereka mengira bahwa ini adalah rahmat dan kemudahan, namun sebenarnya itu adalah kehinaan dan kelemahan iman, ada upaya dalam membantu terjadinya dosa dan permusuhan, dan meninggalkan perintah melarang kepada perzinahan dan kemungkaran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Perempuan pezina dan laki-laki pezina yang masih perawan atau perjaka yaitu belum menikah. Maka pukul atau deralah tiap-tiap seorang dari keduanya seratus kali atas kemaksiatan mereka. Sudah ditetapkan dalam sunnah bahwa ada tambahan pukulan/jilidan secara umum. Adapun hukuman untuk pezina muhson yaitu yang sudah menikah dan merdeka, maka hukuman bagi mereka adalah rajam menurut sunnah yang sahih dan mutawatir. Jangan berbelas kasihan kepada keduanya sekalipun sedikit dalam menegakkan aturan Allah, jika kamu memang beriman kepada Allah, hari kebangkitan dan hari akhirat hari pembalasan. Hendaklah pelaksanaan hukuman mereka disaksikan oleh sekumpulan orang-orang yang beriman. Paling sedikit adalah tiga orang, sebab jika disaksikan orang banyak maka akan bisa menjadi peringatan, pelajaran dan pembelajaran. Inilah aturan bagi zina."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Pezina perempuan dan pezina laki-laki, cambuklah} maka pukullan dengan cambuk {masing-masing dari keduanya seratus kali cambukan dan janganlah rasa belas kasihan} belas kasihan dan lemah lembut {kepada keduanya mencegah kalian untuk (melaksanakan) agama Allah} hukum Allah {jika kalian beriman kepada Allah dan hari akhir. Hendaklah disaksikan} hendaklah dihadiri {hukuman untuk keduanya itu} hukuman cambuk untuk kedua pezina itu {oleh sekelompok} sekelompok {dari golongan orang-orang mukmin"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2. ini adalah mengenai pelaku zina lelaki dan perempuan yang lajang. Yaitu mereka berdua dipukul sebanyak seratus kali pukulan. Adapun orang yang pernah melewati masa pernikahan (lelaki atau wanita), menurut petunjuk kandungan Sunnah yang shahih juga popular, hukumannya yaitu rajam. Allah melarang kita terpengaruh dalam rasa iba kepada mereka berdua di dalam menegakkan agama Allah, yang akan menghambat kita menjalankan hukuman pidana atas mereka berdua, baik rasa kasihan alami atau karena ada jalinan kekerabatan, persahabatan atau hubungan lainnya (dengan tertuduh). Hanya keimananlah yang dapat melenyapkan perasaan yang menghalangi pelaksanaan hukum Allah itu. Rasa sayang kepadanya yang hakiki itu adalah dengan menegakkan hukum kepadanya. Kita ini, kendatipun merasa kasihan kepadanya lantaran terjadinya takdir semacam itu kepadanya, namun kita tidak boleh mengungkapkan belas kasih kepadanya dari sisi ini. Allah memerintahkan supaya proses penegakan hukum dua orang pezina itu dihadiri oleh “sekumpulan orang-orang,” Mukmin. Supaya diketahui oleh khalayak dan terpenuhilah sasaran untuk menghinakan (pelaku) dan menciptakan suasana kehati-hatian (dari tindakan itu), dan hendaklah mereka benar-benar menyaksikannya secara nyata. Sesungguhnya, menyaksikan pelaksanaan hukum syariat secara langsung termasuk faktor yang berpotensi menguatkan ilmu dan meresapkan pemahaman, serta akan mendekatkan kepada kebenaran, tidak ditambah-tambah ataupun di kurangi. Wallahu’alam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nur ayat 2: Hukum ini berlaku pada pezina laki-laki dan perempuan yang belum menikah, yakni bahwa keduanya didera seratus kali. Sedangkan yang sudah menikah, maka As Sunnah menerangkan, bahwa hadnya adalah dengan dirajam. Yakni memukul kulitnya (mencambuk). Ditambah dengan diasingkan setahun berdasarkan As Sunnah. Adapun budak setengah dari hukuman itu. Atau hubungan kerabat dan persahabatan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nur Ayat 2",
    "description": "Surah ini mengandung ketentuan hukum yang pasti, salah satunya hukum perzinaan. Kepada pezina perempuan yang belum pernah menikah dan demikian pula pezina laki-laki yang belum pernah menikah, deralah masing-masing dari keduanya seratus kali jika perziaan keduanya terbukti sesuai dengan syarat-syaratnya, dan janganlah rasa belas kasih-an kepada keduanya mencegah kamu untuk menjalankan agama dan hukum Allah, jika kamu beriman kepada Allah dan hari kemudian. Salah satu konsekuensi iman adalah melaksanakan hukum Allah. Dan hendaklah pelaksanaan hukuman mereka disaksikan oleh sebagian orang-orang yang beriman, sedikitnya tiga atau empat orang, agar hukuman itu menjadi pelajaran bagi pihak-pihak yang melihat dan mendengarnya. 3. Usai menjelaskan hukuman atas pezina, ayat ini mengingatkan keharusan menghindari pezina, khususnya untuk dijadikan pasangan hidup. Pezina laki-laki tidak boleh menikah kecuali dengan pezina perempuan atau dengan perempuan musyrik; dan demikian juga sebaliknya, pezina perempuan tidak boleh menikah kecuali dengan pezina laki-laki atau dengan laki-laki musyrik; dan yang demikian itu, yaitu menikah dengan pezina, diharamkan bagi orang-orang mukmin."
  }
]