[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang yang beriman kepada Allah dan RasulNya serta melaksanakan syariatNya, janganlah kalian menapaki jalan-jalan setan. Dan barangsiapa menapaki jalan-jalan setan, maka sesungguhnya setan itu memerintahkannya melakukan perbuatan-perbuatan buruk dan perbuatan-perbuatan munkar. Dan sekiranya bukan karena karunia Allah pada kaum Mukminin dan rahmatNya pada mereka, niscaya tidak ada seorang pun dari mereka yang suci dari kotoran dosa selamanya. Akan tetapi, Allah dengan karuniaNya, menyucikan siapa saja yang Dia kehendaki. Dan Allah Maha Mendengar ucapan-ucapan kalian, lagi Maha Mengetahui niat-niat dan perbuatan-perbuatan kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Hai orang-orang yang beriman kepada Allah dan mengamalkan syariat-Nya, janganlah kalian mengikuti jalan-jalan setan dalam menghiasi kebatilan. Barangsiapa yang mengikuti jalan-jalan setan, maka sesungguhnya ia menyuruh mengerjakan perbuatan dan perkataan jelek dan yang mungkar menurut syariat. Kalaulah bukan karena karunia dan rahmat Allah kepada kalian –wahai orang-orang beriman-, niscaya tidak seorangpun dari kalian bersih dari perbuatan keji dan mungkar itu selama-lamanya bila ia bertobat, tetapi Allah membersihkan siapa yang dikehendaki-Nya dengan menerima tobat jika ia bertobat. Dan Allah Maha Mendengar segala ucapan kalian, lagi Maha Mengetahui amal perbuatan kalian, tidak ada sesuatupun yang tersembunyi bagi-Nya, dan Dia pasti akan memberikan balasan bagi kalian atas amal perbuatan tersebut."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "21. Allah memperingatkan orang-orang beriman agar tidak mengikuti jalan setan dan bermaksiat kepada Allah. Dan barangsiapa yang mengikuti jalan-jalan setan, maka sesungguhnya setan hanya memerintahkan kepada keburukan, dosa, dan kemaksiatan. Kalaulah bukan karena karunia dan rahmat Allah bagi kalian, niscaya Allah tidak akan menyucikan seorangpun dari kotoran kekejiannya, akan tetapi Allah menyucikan siapa yang Dia kehendaki dengan karunia-Nya. allah Maha Mendengar perkataan kalian dan Maha Melihat perbuatan kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "21. يٰٓأَيُّهَا الَّذِينَ ءَامَنُوا۟ لَا تَتَّبِعُوا۟ خُطُوٰتِ الشَّيْطٰنِ ۚ (Hai orang-orang yang beriman, janganlah kamu mengikuti langkah-langkah syaitan) Yakni janganlah kalian menempuh jalan-jalan setan yang selalu diserukan bagi kalian oleh mereka. فَإِنَّهُۥ (maka sesungguhnya) Yakni setan itu. يَأْمُرُ بِالْفَحْشَآءِ وَالْمُنكَرِ ۚ( syaitan itu menyuruh mengerjakan perbuatan yang keji dan yang mungkar) Makna (الفحشاء) adalah perbuatan yang sangat buruk. Dan (المنكر) adalah apa yang di anggap buruk oleh syariat. Barangsiapa yang mengikuti setan maka ia akan menjadi pengikutnya yang mentaati segala perintahnya. مَا زَكَىٰ مِنكُم مِّنْ أَحَدٍ أَبَدًا (niscaya tidak seorangpun dari kamu bersih (dari perbuatan-perbuatan keji dan mungkar itu) selama-lamanya) Yakni diri kalian tidak akan bersih dari kotorannya selama kalian hidup. وَلٰكِنَّ اللهَ يُزَكِّى مَن يَشَآءُ ۗ( tetapi Allah membersihkan siapa yang dikehendaki-Nya) Yakni hamba-hamba-Nya yang diberi karunia dan rahmat bagi mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Banyak diantara kaum muslimin yang senantiasa memohon karunia dari Allah ta'ala, tetapi banyak juga diantara mereka yang merasa karunia itu telah diraih namun hanya pada urusan dunia: seperti rezeki, kesehatan dan sebagainya, dan terlepas dari benak mereka bahwa karunia yang terbesar itu adalah kesucian diri; karena itu Allah berfirman: { وَلَوْلَا فَضْلُ ٱللَّهِ عَلَيْكُمْ وَرَحْمَتُهُۥ مَا زَكَىٰ مِنكُم مِّنْ أَحَدٍ أَبَدًا وَلَٰكِنَّ ٱللَّهَ يُزَكِّى مَن يَشَآءُ } \"Sekiranya tidaklah karena kurnia Allah dan rahmat-Nya kepada kamu sekalian, niscaya tidak seorangpun dari kamu bersih (dari perbuatan-perbuatan keji dan mungkar itu) selama-lamanya, tetapi Allah membersihkan siapa yang dikehendaki-Nya. Dan Allah Maha Mendengar lagi Maha Mengetahui.\""
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "21. Wahai orang-orang yang beriman janganlah kalian mengikuti langkah setan yang selalu membujuk kalian agar mengikutinya, seperti menyebarluaskan aib. Maka barangsiapa mengikuti langkah setan maka sesungguhnya setan menyuruh untuk mengerjakan sesuatu yang bisa memperbesar keburukannya berupa dosa (perbuatan keji) dengan menginkari syariat (berbuat mungkar), mengikutinya (setan), menaatinya dan selalu memberatkan hati kepadanya. Kalau bukan karena adanya keutamaan dan rahmat Allah untuk kalian dengan menerima taubat yang dapat menghapus dosa, niscaya tidak ada satupun yang bisa suci dari kotornya dosa. Namun Allah membersihkan dosa orang yang dikehendaki dengan menerima taubatnya. Allah itu Maha Mendengar ucapan mereka dan Maha Mengetahui niat dan segala pengetahuan tentang mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, janganlah kalian mengikuti langkah-langkah} langkah-langkah dan lintasan {setan. Siapa saja yang mengikuti langkah-langkah setan, maka sesungguhnya dia} maka sesungguhnya setan {menyuruh perbuatan yang keji} perbuatan jahat berupa perkataan dan perbuatan {dan kemungkaran} sesuatu yang dilarang syariat {Kalau bukan karena karunia Allah dan rahmatNya kepada kalian, niscaya tidak seorang pun di antara kalian yang bersih} tidak ada yang suci {selama-lamanya. Akan tetapi Allah membersihkan} menyucikan {siapa saja yang Dia kehendaki. Allah Maha Mendengar lagi Maha Mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21 Setelah melarang dosa ini secara khusus, Allah juga melarang (kalian) dari dosa secara umum. Dia berfirman, ”hai orang-orang yang beriman, janganlah kamu mengikuti langkah-langkah setan,” maksudnya, jalan-jalan dan godaan-godaannya. Langkah-langkah setan ini mencakup seluruh perbuatan maksiat yang berhubungan dengan hati, lisan, dan badan. Diantara hikmah Allah, dalam menerangkan hukum ini –yakni larangan untuk mengikuti langkah-langkah setan adalah, penjelasan mengenai kejelekan yang ditimbulkan dan motivator untuk meninggalkan larangan itu. Allah berfirman, “barangsiapa yang mengikuti langakah-langkah setan, maka sesungguhnya dia,” yaitu setan “menyuruh mengerjakan perbuatan yang keji,” yaitu segala perbuatan yang dianggap jelek oleh akal dan syariat berupa dosa-dosa besar disertai adanya kecondongan hati kepadanya “dan yang mungkar” yaitu segala yang diingkari oleh akal dan tidak dikenal (sebagai perbuatan baik). Jadi, perbuatn-perbuatan maksiat yang merupakan langkah-langkah setan, tidak keluar dari bingkai ini. Maka Allah melarang hambaNya dari hal tersebut sebagai wujud kenikmatanNYa atas mereka, supaya bersyukur dan mengingatNya. Karena yang demikian merupakan tameng penjaga bagi mereka dari noda, kenistaan, dan kejelekan-kejelekan mereka. Dan termasuk dari kebaikan Allah atas mereka, adalah melarang mereka dari semua itu sebagaimana Allah melarang mereka dari (mkaan) racun-racun pembunuh dan semacamnya. “sekiranya tidaklah karena karunia Allah dan rahmatNya kepada kamu sekalian, niscaya tidak seorangpun dari kamu bersih (dari perbuatan-perbuatan keji dan mungkar itu) selama-lamanya.” Maksudnya, tidak ada seorangpun yang bersih (selamat) dari mengikuti langkah-langkah setan. Karena setan bersama tentaranya itu akan selalu berupaya untuk menyeru kepadanya dan memolesnya menjadi indah. Sementara itu, jiwa selalu cenderung kepada keburukan dan menyeru kepadanya. Kekurangan terus menguasai diri seorang hamba dari segala penjuru, sementara iman tidak kuat. Bila ia dibiarkan terpengaruh oleh faktor-faktor itu, niscaya tidak ada seorangpun yang suci dengan membersihkan diri dari dosa-dosa dan kejelekan-kejelekanya serta (tidak mmapu) meningkatkan amal kebaikannya. Sesungguhnya penyucian diri itu memuat unsur pembersihan dan peningkatan diri. Akan tetapi, karunia dan rahmatNyalah yang menjadikan seseorang menyucukan dirinya. Termasuk doa nabi, “ya Allah berikanlah pada diriku ketakwaan, dan sucikanlah ia karena Engkaulah sebaik-baik yang menyucikannya. Engkau adalah penolong dan penguasanya.” Oleh karena itu, Allah berfirman, “tetapi Allah membersihkan siapa yang dikehendakiNya,” yaitu orang yang Allah ketahui akan membersihkan diri dengan menyucikan jiwanya. Oleh sebab itu, Allah berfirman,” dan Allah Mhaamendengar lagi Maha Mengetahui.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nur ayat 21: Setelah Allah melarang perkara dosa itu secara khusus, maka Dia melarang dosa-dosa yang lain secara umum. Termasuk langkah-langkah setan adalah semua maksiat, baik yang terkait dengan hati, lisan maupun anggota badan. Perbuatan keji adalah perbuatan yang dipandang keji oleh akal dan semua syariat, berupa dosa-dosa besar. Mungkar adalah perbuatan yang diingkari oleh akal dan syariat. Maksiat yang merupakan langkah-langkah setan tidak lepas dari perkara keji dan mungkar, maka Allah melarang hamba-hamba-Nya dari yang demikian sebagai nikmat-Nya kepada mereka agar mereka bersyukur dan mengingat-Nya, karena dengan menjauhinya dapat membuat diri mereka bersih dari kotoran dan noda yang mengotori dirinya. Termasuk ihsan-Nya adalah Dia melarang mereka dari perbuatan itu sebagaimana Dia melarang memakan racun yang dapat membunuhnya, dsb. Ya, kalau bukan karena karunia Allah dan rahmat-Nya tentu tidak ada seorang pun yang dapat bersih dari perbuatan keji dan munkar, karena setan dan tentaranya mengajak manusia kepadanya dan menghiasnya serta berusaha semaksimal mungkin agar manusia jatuh ke dalamnya, hawa nafsu manusia juga cenderung kepadanya, dan kekurangan menguasai manusia dari berbagai sisi, sedangkan imannya tidak kuat. Oleh karena itu, jika tidak ada karunia Allah dan rahmat-Nya, tentu tidak seorang pun yang dapat bersih dari perkara keji dan mungkar serta dapat berbuat kebaikan. Oleh karena itu, di antara doa Nabi shallallahu 'alaihi wa sallam adalah: اللَّهُمَّ إِنِّى أَعُوذُ بِكَ مِنَ الْعَجْزِ وَالْكَسَلِ وَالْجُبْنِ وَالْبُخْلِ وَالْهَرَمِ وَعَذَابِ الْقَبْرِ اللَّهُمَّ آتِ نَفْسِى تَقْوَاهَا وَزَكِّهَا أَنْتَ خَيْرُ مَنْ زَكَّاهَا أَنْتَ وَلِيُّهَا وَمَوْلاَهَا اللَّهُمَّ إِنِّى أَعُوذُ بِكَ مِنْ عِلْمٍ لاَ يَنْفَعُ وَمِنْ قَلْبٍ لاَ يَخْشَعُ وَمِنْ نَفْسٍ لاَ تَشْبَعُ وَمِنْ دَعْوَةٍ لاَ يُسْتَجَابُ لَهَا “Ya Allah, sesungguhnya aku berlindung kepada-Mu dari kelemahan, kemalasan, ketakutan, kebakhilan dan kepikunan serta azab kubur. Ya Allah, berikanlah kepada diriku ketakwaannya, bersihkanlah dia, sesungguhnya Engkau sebaik-baik yang membersihkannya. Engkau Pelindung dan Penguasanya. Ya Allah, sesungguhnya aku berlindung kepada-Mu dari ilmu yang tidak bermanfaat, dari hati yang tidak khusyu’, dari jiwa yang tidak puas dan dari doa yang tidak diijabah.” (HR. Muslim) Ada yang menafsirkan, “Dengan menerima tobatnya.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nur Ayat 21",
    "description": "Tuduhan kepada 'aisyah, seperti yang telah dibantah pada ayat-ayat sebelumnya, adalah ulah setan. Karena itu, ayat ini melarang kaum mukmin mengikuti langkah-langkah setan. Wahai orang-orang yang beriman, bentengi dirimu dengan keimanan dan janganlah kamu memaksakan diri menentang fitrah kamu dengan mengikuti langkah-langkah setan yang membisikkan kejahatan, di antaranya menyebarkan berita bohong. Barang siapa mengikuti langkah-langkah setan dengan penuh kesadaran, bukan karena lalai atau tidak tahu, maka dia telah berbuat keji dan mungkar karena sesungguhnya setan menyuruh mengerjakan perbuatan yang keji, yaitu ucapan dan perbuatan yang tidak sejalan dengan tuntunan agama dan akal sehat, seperti zina dan tuduhan berzina, dan perbuatan mungkar, yaitu perbuatan buruk yang dicela oleh adat istiadat dan bertentangan dengan nilai-nilai agama. Kalau bukan karena karunia Allah dan rahmat-Nya kepadamu, di antaranya menunjukkan kepadamu jalan tobat, niscaya tidak seorang pun di antara kamu bersih dari perbuatan keji dan mungkar itu selama-lamanya, tetapi Allah membersihkan siapa yang dia kehendaki dari dosa-dosa itu. Dan Allah maha mendengar permohonan siapa pun, maha mengetahui isi hati dan ketulusannya. 22. Salah satu bentuk godaan setan adalah mencarikan dalih agar seseorang enggan membantu orang lain. Dan janganlah orang-orang yang mempunyai kelebihan dalam kesalehan beragama serta keutamaan akhlak yang luhur dan kelapangan rezeki di antara kamu, wahai orang-orang yang beriman, bersumpah bahwa mereka tidak akan memberi bantuan kepada kerabat-Nya, orang-orang miskin, dan orang-orang yang berhijrah di jalan Allah hanya karena orang-orang itu pernah berbuat kesalahan kepadanya atau membuat pribadinya tersinggung. Sebaiknya mereka berbesar hati dengan tetap mengulurkan bantuan, dan hendaklah mereka memaafkan orang yang pernah melukai hatinya, dan berlapang dada sehingga dapat membuka lembaran baru dalam hubungan mereka. Apakah kamu tidak suka bahwa Allah mengampuni kesalahan dan kekurangan kamu' tentu kamu suka. Karena itu, maafkanlah mereka agar Allah memaafkan dan mengampuni kamu. Dan Allah maha pengampun sehingga akan menghapus dosa kamu, maha penyayang dengan mencurahkan nikmat lebih banyak lagi kepada kamu."
  }
]