[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan janganlah orang terhormat dalam agama dan memiliki kelapangan dalam harta, bersumpah untuk tidak mau menyambung hubungan silaturahmi dengan kaum kerabatnya yang miskin, orang-orang yang membutuhkan uluran tangan yang mana mereka tidak memiliki sesuatu yang bisa menutupi dan mencukupi kebuthan mereka dan kaum Muhajirin fi sabilillah, dan menghentikan pemberian nafkah hidup bagi mereka, gara-gara dosa yang mereka perbuat; dan hendaknya memaafkan kesalahan mereka dan tidak menghukum mereka. Tidakkah kalian suka Allah memaafkan kalian? Maka maafkanlah kesalahan mereka. Allah Maha Pengampun bagi hamba-hambaNya, lagi Maha Penyayang terhadap mereka. Di sini, terkandung ajakan untuk memaafkan dan lapang dada, meskipun diperlakukan buruk."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "22. Dan janganlah orang-orang yang mempunyai keutamaan dalam agama, dan kelapangan harta di antara kalian bersumpah untuk tidak akan memberi bantuan lagi kepada kaum kerabatnya yang membutuhkan -karena miskin lagi berhijrah di jalan Allah- hanya lantaran dosa yang mereka lakukan, dan hendaklah mereka memaafkan dan berlapang dada terhadap mereka. Apakah kalian tidak ingin agar Allah mengampuni dosa-dosa kalian bila kalian memaafkan dan berlapang dada terhadap mereka?! Sungguh Allah adalah Żat Maha Pengampun atas hamba yang bertobat kepada-Nya, lagi Maha Penyayang terhadap mereka. Oleh karena itu hendaknya para hamba meneladani Allah. Ayat ini turun berkaitan dengan Abu Bakar Aṣ-Ṣiddiq -raḍiyallāhu 'anhu- saat bersumpah untuk menyetop nafkah kepada Misṭah karena keterlibatannya dalam peristiwa ifik."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "22. Allah mendorong orang-orang beriman untuk memiliki akhlak yang mulia, dan melarang orang yang pemurah dan kaya di antara orang beriman untuk bersumpah dengan nama Allah demi berhenti menyambung silaturrahim dengan para kerabat mereka yang miskin dan membutuhkan, dan orang-orang yang berhijrah di jalan keridhaan Allah, akibat keburukan mereka meski keburukan itu sangat besar. Kemudian Allah memerintahkan untuk memaafkan kesalahan dan melupakannya agar tidak ada lagi rasa sakit hati. Lalu Allah menekankan hal ini dengan berfirman: “Tidakkah kalian ingin agar Allah mengampuni kalian? Allah Maha Mengampuni dosa orang-orang yang bertaubat, dan Maha Mengasihi mereka.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "22. وَلَا يَأْتَلِ (Dan janganlah bersumpah) Yakni janganlah bersumpah. أُو۟لُوا۟ الْفَضْلِ مِنكُمْ وَالسَّعَةِ(orang-orang yang mempunyai kelebihan dan kelapangan di antara kamu) Yakni orang yang memiliki kedudukan tinggi dan kekayaan. Ibnu Mundzir mengeluarkan hadits dari Aisyah, ia berkata: “Misthah bin Atsatsah adalah orang yang ikut menyebarkan berita bohong itu, dan ia termasuk kerabat Abu Bakar, dahulu ia berada dalam tanggungan/pemeliharaan Abu Bakar. Sehingga ketika ia ikut menyebarkan berita bohong itu, Abu Bakar bersumpah untuk tidak akan memberi hartanya sedikitpun kepada Misthah. Maka Allah menurunkan ayat ini.” Aisyah kembali berujar: “kemudian Abu Bakar kembali menanggung kebutuhannya, lalu membayar kafarat untuk menebus sumpahnya. أَن يُؤْتُوٓا۟ أُو۟لِى الْقُرْبَىٰ وَالْمَسٰكِينَ وَالْمُهٰجِرِينَ(bahwa mereka (tidak) akan memberi (bantuan) kepada kaum kerabat(nya), orang-orang yang miskin dan orang-orang yang berhijrah) Yakni Misthah adalah kerabat Abu Bakar, orang yang ikut berhijrah, sekaligus orang miskin. Tiga hal ini menjadikannya layak untuk memperoleh bantuan, meskipun ia telah melakukan apa yang terjadi. وَلْيَعْفُوا۟ (dan hendaklah mereka memaafkan) Yakni memaafkan dosa yang telah mereka lakukan dan kejahatan yang telah mereka perbuat. وَلْيَصْفَحُوٓا۟ (dan berlapang dada) Yakni menutup mata dan melupakan kejahatan mereka. أَلَا تُحِبُّونَ أَن يَغْفِرَ اللهُ لَكُمْ ۗ( Apakah kamu tidak ingin bahwa Allah mengampunimu) Karena pemberian maaf dan ampunan kalian bagi orang-orang yang telah berbuat tidak baik kepada kalian. وَاللهُ غَفُورٌ رَّحِيمٌ(Dan Allah adalah Maha Pengampun lagi Maha Penyayang) Mengapa para hamba tidak meneladani Tuhan mereka dalam ampunan dan pemberian maaf bagi orang-orang yang bersalah."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Apakah kamu senang jika Allah memberimu ampunan, dan mengapuskan kesalahan-kesalahanmu? hal itu cukup mudah untk diraih; namun di sisi Allah adalah perkara yang agung! yaitu dengan kamu melapangkan dan memaafkan kesalahan orang lain pada dirimu, atau siapa saja yan berbuat tidak elok kepadamu, atau bahkan telah berbuat zholim kepada mu, dan jika hatimu berat menerima hal itu maka ingatkanlah tentang firman tuhannya: { وَلْيَعْفُوا۟ وَلْيَصْفَحُوٓا۟ ۗ أَلَا تُحِبُّونَ أَن يَغْفِرَ ٱللَّهُ لَكُمْ } \"dan hendaklah mereka memaafkan dan berlapang dada. Apakah kamu tidak ingin bahwa Allah mengampunimu?\" 2 ). Ayat ini turun kepada Abu Bakr tatkala ia bersumpah untuk tidak memberi nafkah kepada kaum yang telah menuduh 'Aisyah dengan tuduhan yang keji, dan Allah tidak memberika isyarat kepada mereka tentang kesalahan yang mereka perbuat, karena telah dilakukan penghakiman kepada mereka maka Allah pun membersihkan diri mereka dari kesalahan itu. Maka apakah kita akan melakukan hal yang sama kepada pelaku dosa setelah mereka bertaubat dan telah mensucikan dirinya; maka kita tidak mengingat mereka dengan kesalahan yang mereka perbuat selamanya!"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "22. Dan Jangan sampai orang yang memiliki keutamaan, kebaikan, kekayaan dan kesejahteraan itu bersumpah untuk tidak memberikan hartanya kepada kerabat, orang miskin, orang-orang yang berhijrah di jalan Allah untuk mencari ridhaNya. Sebaiknya mereka memaafkan dan mengampuni dosa dan perbuatan buruk mereka. Apakah kalian tidak ingin Allah mengampuni kalian karena memaafkan dan mengampuni orang-orang yang menyakiti (kalian). Allah adalah Dzat yang Maha Pengampun dosa-dosa orang-orang yang taat dan Maha Pengasih bagi hamba-hambaNya yang beriman dengan segala kesempurnaan kuasaNya. Maka lebih berakhlaklah kalian kepadaNya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Janganlah bersumpah} janganlah bersumpah dengan nama Allah {orang-orang yang mempunyai kelebihan} orang-orang yang memiliki keutamaan dalam agama {dan kelapangan di antara kalian} orang-orang yang memiliki kekayaan dalam harta {akan (tidak) memberi} akan tidak memberi {kepada kerabat, orang-orang miskin, dan orang-orang yang berhijrah di jalan Allah. Hendaklah mereka memaafkan dan berlapang dada. Apakah kalian tidak senang bahwa Allah mengampuni kalian. Allah Maha Pengampun lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "22. ”dan janganlah bersumpah,” maksudnya mengeluarkan sumpah “orang-orang yang mempunyai kelebihan dan kelapangan diantara kamu bahwa mereka (tidak) akan memberi (bantuan) kepada kaum kerabat(nya), orang-orang yang miskin dan orang-orang yang berhijrah pada jalan Allah, dan hendaklah mereka memaafkan dan berlapang adda,” diantara orang yang larut dalam berita dusta ini adalah Mistah bin utasah, dia masih kerabat Abu Bakar ash-shidiq. Mistah seorang yang fakir dari golongan Muhajirin di jalan Allah. Abu bakar bersumpah untuk tidak memberikan nafkah lagi kepada Misthah, karena ia telah mengabarkan berita dusta. Maka turunlah ayat ini, [Allah melarangnya] dari sumpah (yang mengandung substansi) menghentikan pemberian nafkah baginya, menganjurkan abu bakar untuk memaafkan dan berlapang dada dan menjanjikan padanya ampunan bila ia berkenan memaafkannya. Lalu Allah berfirman, “apakah kamu tidak ingin bahwa Allah mengampunimu? Dan Allah Maha Pengampun lagi Maha Penyayang.” Bila kalian memperlakukan hambaNya dengan sikap maaf dan lapang dada, niscaya Allah akan memperlakukan kalian seperti itu. Mendengar ayat ini, abu bakar berkata, “ Ya, demi Allah, sungguh aku benar-benar senang bila Allah mengampuniku.” Selanjutnya, Abu bakar kembali memberikan nafkah kepada Misthah. Dalam ayat ini, termuat dalil tentang pemberian nafkah kepada kerabat, dan bahwa pemberian nafkah dan curahan kebaikan (dari seseorang) tidak boleh di putus disebabkan perbuatan maksiat yang dia lakukan, serta anjuran untuk memberikan maaf dan berlapang dada, walaupun para pelaku kejelekan tersebut (masih terus) melakukan kejelekannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nur ayat 22: Ayat ini berhubungan dengan sumpah Abu Bakar radhiyallahu 'anhu bahwa dia tidak akan memberikan apa-apa kepada kerabatnya ataupun orang lain yang terlibat dalam menyiarkan berita bohong tentang diri 'Aisyah. Maka turunlah ayat ini melarang Beliau melaksanakan sumpahnya itu dan menyuruh memaafkan dan berlapang dada terhadap mereka setelah mendapat hukuman atas perbuatan mereka itu. Dalam ayat ini terdapat dalil menafkahi kerabat, dan bahwa menafkahi dan berbuat ihsan kepada mereka tidaklah ditinggalkan karena maksiat seseorang, dan terdapat anjuran memaafkan dan berlapang dada."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nur Ayat 22",
    "description": "Salah satu bentuk godaan setan adalah mencarikan dalih agar seseorang enggan membantu orang lain. Dan janganlah orang-orang yang mempunyai kelebihan dalam kesalehan beragama serta keutamaan akhlak yang luhur dan kelapangan rezeki di antara kamu, wahai orang-orang yang beriman, bersumpah bahwa mereka tidak akan memberi bantuan kepada kerabat-Nya, orang-orang miskin, dan orang-orang yang berhijrah di jalan Allah hanya karena orang-orang itu pernah berbuat kesalahan kepadanya atau membuat pribadinya tersinggung. Sebaiknya mereka berbesar hati dengan tetap mengulurkan bantuan, dan hendaklah mereka memaafkan orang yang pernah melukai hatinya, dan berlapang dada sehingga dapat membuka lembaran baru dalam hubungan mereka. Apakah kamu tidak suka bahwa Allah mengampuni kesalahan dan kekurangan kamu' tentu kamu suka. Karena itu, maafkanlah mereka agar Allah memaafkan dan mengampuni kamu. Dan Allah maha pengampun sehingga akan menghapus dosa kamu, maha penyayang dengan mencurahkan nikmat lebih banyak lagi kepada kamu. 23-25. Sungguh, orang-orang yang menuduh berzina kepada perempuan-perempuan yang baik, menjaga kehormatannya, dan menjauhi perbuatan maksiat; yang lengah, yaitu tidak pernah berpikir untuk berbuat keji; dan wanita yang beriman kepada Allah dan rasul-Nya, mereka, yakni para penuduh itu, dilaknat di dunia dan di akhirat, dan mereka akan mendapat azab yang besar pada hari kiamat ketika Allah menjadikan lidah, tangan, dan kaki mereka menjadi saksi atas mereka terhadap apa yang dahulu mereka kerjakan, termasuk tuduhan bohong mereka. Pada hari itu Allah menyempurnakan balasan yang sebenarnya bagi mereka secara setimpal, dan ketika itu mereka tahu dan sadar bahwa Allah mahabenar atas segala firman-Nya, maha menjelaskan segala sesuatu."
  }
]