[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang yang melontarkan tuduhan zina kepada wanita-wanita suci yang beriman kepada Allah yang tidak pernah terbetik pada hati mereka niat tersebut, mereka akan dijauhkan dari rahmat Allah di dunia dan akhirat, dan bagi mereka siksaan besar di Neraka jahanam. Pada ayat ini terkandung dalil kafirnya orang yang mencela atau menuduh salah seorang istri Nabi dengan tuduhan yang buruk."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "23. Sesungguhnya orang-orang yang menuduh wanita baik-baik lagi beriman yang hati mereka tidak terbesit sedikitpun untuk berzina, mereka itu terkena laknat dan dijauhkan dari rahmat Allah di dunia dan di Akhirat, dan bagi mereka azab yang besar di Akhirat kelak."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "23-25. Orang-orang yang menuduh wanita-wanita beriman yang hati mereka bersih dari kemaksiatan bahwa mereka telah melakukan zina, maka mereka yang menuduh itu telah dijauhkan dari rahmat Allah di dunia dengan ditegakkannya hukum qazaf kepada mereka, sedangkan di akhirat mereka akan mendapat azab neraka yang sangat pedih. Azab pada hari kiamat tersebut ketika lidah, tangan, dan kaki bersaksi atas segala dosa yang dilakukan manusia. Pada hari itu Allah akan membalas perbuatan mereka dengan adil; dan mereka mengetahui Allah adalah Maha Benar dan Maha Menjelaskan, yang tidak menzalimi mereka sedikitpun. Syeikh as-Syinqithi berkata: firman Allah (يومئذ يوفيهم الله دينهم الحق). Yang dimaksud adalah balasan, dengan dalil bahwa kata (يوفيهم) bermakna menyempurnakan, dan kata ini menunjukkan penyempurnaan balasan, seperti pada firman Allah: ثُمَّ يُجْزَىٰهُ ٱلْجَزَآءَ ٱلْأَوْفَىٰ Kemudian akan diberi balasan kepadanya dengan balasan yang paling sempurna. (an-Najm: 41). Dan firman Allah: وَإِنَّمَا تُوَفَّوْنَ أُجُورَكُمْ يَوْمَ ٱلْقِيَٰمَة Dan sesungguhnya pada hari kiamat sajalah disempurnakan pahalamu. (Ali Imran: 185)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "23. إِنَّ الَّذِينَ يَرْمُونَ الْمُحْصَنٰتِ الْغٰفِلٰتِ (Sesungguhnya orang-orang yang menuduh wanita yang baik-baik, yang lengah) Yakni wanita-wanita yang tidak pernah terbesit dalam pikiran mereka untuk berbuat keji, dan termasuk dari mereka adalah Aisyah. لُعِنُوا۟ فِى الدُّنْيَا وَالْاٰخِرَةِ (mereka kena laknat di dunia dan akhirat) Yakni dijauhkan dari rahmat Allah, mendapat hukuman had, dan dijauhi oleh orang-orang mukmin, serta digolongkan menjadi orang-orang yang tidak memiliki sifat adil."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1. { إِنَّ ٱلَّذِينَ يَرْمُونَ ٱلْمُحْصَنَٰتِ ٱلْغَٰفِلَٰتِ ٱلْمُؤْمِنَٰتِ } \"Sesungguhnya orang-orang yang menuduh wanita yang baik-baik, yang lengah lagi beriman (berbuat zina)\" lengah dari suatu perbuatan buruk dapat menjaga seseorang dari melakukannya; karena perbuatan itu tidak akan terjadi kecuali dengan keinginan yang kuat, dan keinginan itu tidak akan muncul kecuali adanya perasaan dalam diri. Maka untuk merasakan kelengahan ini perlu adanya kesibukan lain yang menjadikan seseorang lalai dari perbuata itu. 2. Kenapa wanita-wanita muslimah dalam ayat ini disifati dengan wanita yang lengah? seungguhnya itu adalah penyifatan yang lembut menggambar sifat masyarakat yang jauh dari keburukan, dan rumah yang bersih adalah yang menjaga wanita-wanitanya, bunga-bunga yang semerbak, mereka tidak mengenal dosa, mereka lengah dari kotoran-kotoran yang merusak harga diri."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "23. Sesungguhnya orang-orang yang menuduh wanita-wanita yang jauh dari kemaksiatan dan perbuatan keji, berlapang dada, dan beriman kepada Allah dan rasulNya melakukan zina yang hina, maka mereka ditolak dari rahmat Allah di akhirat dan dicecar dengan banyak tuduhan di dunia. Dan bagi mereka itu azab yang agung pada hari kiamat jika mereka tidak mau bertaubat. Ini adalah balasan akhirat bagi orang-orang yang suka menuduh. Ini adalah gambaran sayyidah Aisyah RA. Ayat ini diturunkan untuk isteri nabi SAW yang spesial."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang yang menuduh perempuan yang baik} yang suci {polos} yang tidak pernah terbesit dalam pikirannya perbuatan keji {dan beriman, maka mereka dilaknat} dibuang dari rahmat Allah {di dunia dan akhirat, dan bagi mereka itu azab yang besar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "23 kemudian Allah menyebutkan ancaman yang keras atas tindakan penuduhan kepada para wanita Mukminah yang menjaga kehormatannya (dari zina). Allah berfirman, ”sesungguhnya orang-orang yang menuduh wanita yang baik-baik,” maksudnya wanita-wanita yang menjaga kehormatannya dari perbuatan maksiat (zina) “yang lengah” yang tidak terlintas dalam hati mereka “lagi beriman (berbuat zina) mereka mendapat laknat di dunia dan akhirat,” laknat tidak jatuh kecuali pada perbuatan dosa besar. Kemudian, Allah menegaskan jatuhnya laknat dengan (memberitahukan) bahwa laknat tersebut berlangsung kontinyu pada mereka di dunia dan akhirat, “dan mereka mendapatkan azab yang besar,” ini sebagai tambahan atas laknat. Allah menjauhkan mereka dari rahmatNya dan menurunkan dahsyatnya hukumanNya kepada mereka. Inilah azab yang terjadi pada Hari Kiamat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nur ayat 23: Selanjutnya Allah menyebutkan ancaman kepada mereka yang menuduh wanita mukminah yang baik melakukan zina. Yang dimaksud dengan wanita-wanita yang lengah ialah wanita-wanita yang tidak teringat meskipun sekali melakukan perbuatan yang keji itu. Hal ini menunjukkan kebersihan dirinya. Adanya laknat terhadap suatu perbuatan menunjukkan bahwa perbuatan itu dosa besar. Di samping laknat di dunia dan akhirat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nur Ayat 23",
    "description": "23-25. Sungguh, orang-orang yang menuduh berzina kepada perempuan-perempuan yang baik, menjaga kehormatannya, dan menjauhi perbuatan maksiat; yang lengah, yaitu tidak pernah berpikir untuk berbuat keji; dan wanita yang beriman kepada Allah dan rasul-Nya, mereka, yakni para penuduh itu, dilaknat di dunia dan di akhirat, dan mereka akan mendapat azab yang besar pada hari kiamat ketika Allah menjadikan lidah, tangan, dan kaki mereka menjadi saksi atas mereka terhadap apa yang dahulu mereka kerjakan, termasuk tuduhan bohong mereka. Pada hari itu Allah menyempurnakan balasan yang sebenarnya bagi mereka secara setimpal, dan ketika itu mereka tahu dan sadar bahwa Allah mahabenar atas segala firman-Nya, maha menjelaskan segala sesuatu"
  }
]