[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Siksaan tersebut terjadi pada Hari Kiamat, yaitu hari dimana mulut-mulut mereka bersaksi melawan diri mereka dengan apa yang diucapkannya dan tangan-tangan serta kaki-kaki mereka juga akan berbicara dengan apa yang telah diperbuatnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. Azab tersebut akan ditimpakan kepada mereka di hari Kiamat kelak, yaitu pada hari ketika lidah mereka bersaksi tentang perkataan batil yang mereka ucapkan, serta tangan dan kaki mereka menjadi saksi atas mereka terhadap apa yang dahulu mereka kerjakan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "24. يَوْمَ تَشْهَدُ عَلَيْهِمْ أَلْسِنَتُهُمْ (pada hari (ketika), lidah, mereka menjadi saksi atas mereka) Yakni atas apa yang telah mereka ucapkan. وَأَيْدِيهِمْ وَأَرْجُلُهُم(serta tangan dan kaki mereka) Yakni atas apa yang telah mereka kerjakan di dunia. Allah menjadikan anggota badan itu dapat berucap untuk memberi kesaksian atas mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "24. Pada hari ketika lisan, kedua tangan dan kaki kalian bersaksi tentang apa yang kalian perbuat di dunia berupa kesalahan dan dosa. Allah menjadikan anggota-anggota tubuh ini bisa berbicara dengan memberikan alat bicara untuk bersaksi atas mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Pada hari (ketika) lidah, tangan, dan kaki mereka bersaksi atas mereka tentang apa yang dahulu mereka kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "24 “pada hari (ketika) lidah, tangan dan kaki mereka menjadi saksi atas mereka terhadap amal yang dahulu mereka kerjakan,” maksudnya setiap anggota badan bersaksi atas amal yang telah dilakukannya. Dzat yang membuatnya berbicara adalah Dzat yang memberikan kemampuan komunikasi kepada segala sesuatu (yaitu Allah), sehingga tidak mungkin ia dapat mengingkarinya. Allah telah berbuat adil kepada hambaNya dengan menjadikan saksi dari diri mereka sendiri."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nur ayat 24: Yaitu hari kiamat. Anggota badan ini akan dijadikan dapat berbicara oleh Allah ‘Azza wa Jalla."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nur Ayat 24",
    "description": "23-25. Sungguh, orang-orang yang menuduh berzina kepada perempuan-perempuan yang baik, menjaga kehormatannya, dan menjauhi perbuatan maksiat; yang lengah, yaitu tidak pernah berpikir untuk berbuat keji; dan wanita yang beriman kepada Allah dan rasul-Nya, mereka, yakni para penuduh itu, dilaknat di dunia dan di akhirat, dan mereka akan mendapat azab yang besar pada hari kiamat ketika Allah menjadikan lidah, tangan, dan kaki mereka menjadi saksi atas mereka terhadap apa yang dahulu mereka kerjakan, termasuk tuduhan bohong mereka. Pada hari itu Allah menyempurnakan balasan yang sebenarnya bagi mereka secara setimpal, dan ketika itu mereka tahu dan sadar bahwa Allah mahabenar atas segala firman-Nya, maha menjelaskan segala sesuatu"
  }
]