[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Pada hari tersebut, Allah menyempurnakan bagi mereka balasan mereka dengan sepenuhnya atas perbuatan-perbuatan mereka dengan adil, dan mereka tahu pada momen besar tersebut bahwa sesungguhnya Allah Dzat Yang Mahabenar lagi Maha Menjelaskan yang haq, janjiNya haq, ancamanNya haq, dan segala sesuatu dariNya adalah haq, Yang tidak menzhalimi siapa pun sebesar biji sawi sekalipun."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "25. Di hari itu, Allah akan memberi mereka balasan yang setimpal secara adil, dan (pada hari itu) menjadi tahu bahwa Allah-lah yang Maha Benar; segala sesuatu yang berasal dari-Nya berupa kabar berita, janji, atau ancaman memang benar-benar jelas dan betul, tanpa adanya keraguan terhadapnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "25. يَوْمَئِذٍ يُوَفِّيهِمُ اللهُ دِينَهُمُ الْحَقَّ (Di hari itu, Allah akan memberi mereka balasan yag setimpal menurut semestinya) Allah pasti akan memberi mereka balasan yang tidak kurang sedikitpun."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Kalau anda melihat kepada ayat-ayat al-Qur'an seluruhnya, dan memeriksa bagaimana orang-orang yang berlaku jahat dijanjikan siksaannya, anda tidak akan melihat Allah menjanjikan siksaan yang berat seperti yang terjadi pada peristiwa Ifk 'Aisyah, juga tidak ada ayat-ayat yang menjelaskan balasan-balasan yang berbeda selain untuk mereka yang melakukan kekejian dalam peristiwa ini. 1. Karena sesungguhnya mereka yang melemparka tuduhan keji itu telah dilaknat oleh Allah di dunia dan di akhirat 2. Djanjikan bagi mereka azab yang sangat pedih di akhirat kelak. 3. Bahwasanya lisan-lisan, tangan-tangan, dan kaki mereka akan bersaksi kelak di hari kiamat atas apa yang mereka tuduhkan. 4. Dan bahwasanya bagi mereka akan disiapkan balasan yang benar-benar akan nampak dhadapan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "25. Di hari kiamat Allah akan memberi mereka balasan yang pasti layak bagi mereka. Dan saat itu mereka tahu bahwa Allah adalah sebenar-benar Tuhan yang tidak berubah Dzat-nya, sudah pasti ketuhananNya dan tidak ada sekutu bagiNya dalam hal itu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Pada hari itu Allah menyempurnakan balasan mereka yang sebenarnya} perhitungan mereka dengan adil {dan mereka mengetahui bahwa sesungguhnya Allah itu Maha benar lagi Maha Menjelaskan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "25 “dihari itu, Allah akan memberi mereka balasan yang setimpal menurut semestinya,” maksudnya Allah memberi balasan atas perbuatan mereka dengan penuh keadilan dan tidak berat sebelah. Mereka mendapatkan balasan yang penuh, sedikitpun tidak ada yang dirasa hilang oleh mereka. Dan mereka berkata \"\"Aduhai celaka kami, kitab apakah ini yang tidak meninggalkan yang kecil dan tidak (pula) yang besar, melainkan ia mencatat semuanya; dan mereka dapati apa yang telah mereka kerjakan ada (tertulis). Dan Tuhanmu tidak menganiaya seorang jua pun\". (QS. Al-Kahfi:49) “dan tahulah mereka,” di tempat yang dahsyat itu “bahwa Allah-lah yang benar, lagi Yang menjelaskan (segala sesuatu menurut hakikat yang sebenarnya,)” mereka mengetahui bahwa kebenaran yang nyata terbatas pada Allah saja, sifat-sifatNya yang agung adalah benar, perbuatan-perbuatanNya merupakan kebenaran, peribadahan kepadaNya adalah kebenaran, pertemuan denganNya (juga) benar, [janjiNya) dan ancamanNya adalah benar, hukum agama dan ketetapannya balasanNya benar, rasulNya adalah benar, dan tidaklah disana ada kebenaran melainkan pada Dzat Allah dan segala sesuatu yang datang dariNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nur ayat 25: Mereka mendapatkan balasannya secara sempurna yang merupakan keadilan Allah. Sifat-sifat-Nya yang agung adalah benar, perbuatan-Nya benar, beribadah hanya kepada-Nya adalah benar, pertemuan dengan-Nya adalah benar, janji dan ancaman-Nya dalah benar, syari’at-Nya adalah benar, balasan-Nya adalah benar. Oleh karena itu, tidak ada satu pun kebenaran kecuali pada Allah dan berasal dari Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nur Ayat 25",
    "description": "23-25. Sungguh, orang-orang yang menuduh berzina kepada perempuan-perempuan yang baik, menjaga kehormatannya, dan menjauhi perbuatan maksiat; yang lengah, yaitu tidak pernah berpikir untuk berbuat keji; dan wanita yang beriman kepada Allah dan rasul-Nya, mereka, yakni para penuduh itu, dilaknat di dunia dan di akhirat, dan mereka akan mendapat azab yang besar pada hari kiamat ketika Allah menjadikan lidah, tangan, dan kaki mereka menjadi saksi atas mereka terhadap apa yang dahulu mereka kerjakan, termasuk tuduhan bohong mereka. Pada hari itu Allah menyempurnakan balasan yang sebenarnya bagi mereka secara setimpal, dan ketika itu mereka tahu dan sadar bahwa Allah mahabenar atas segala firman-Nya, maha menjelaskan segala sesuatu. 26. Pada ayat ketiga dari surah ini Allah menegaskan bahwa pezina tidak layak mengawini kecuali pezina. Sudah menjadi sunatullah bahwa seseorang selalu cenderung kepada orang yang memiliki kesamaan dengannya. Hal itu kembali ditegaskan pada ayat ini. Perempuan-perempuan yang keji jiwanya dan buruk perangainya adalah untuk laki-laki yang keji layaknya perempuan itu, dan laki-laki yang keji jiwanya dan buruk perangainya untuk perempuan-perempuan yang keji seperti itu pula; dan sebaliknya, perempuan-perempuan yang baik untuk laki-laki yang baik dan laki-laki yang baik untuk perempuan-perempuan yang baik pula. Rasulullah adalah manusia terbaik, maka istri-istrinya pastilah wanita yang baik dan terhormat. Mereka itu bersih dari apa yang dituduhkan orang. Mereka memperoleh ampunan atas kekhilafan mereka dan mendapat rezeki yang mulia di dunia dan akhirat."
  }
]