[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Setiap yang keji dari kaum lelaki dan kaum perempuan, ucapan-ucapan dan perbuatan-perbuatan akan cocok, sejalan dan sesuai dengan yang keji pula. Dan setiap yang baik dari kaum lelaki dan kaum perempuan, ucapan dan perbuatan akan cocok dan sesuai dengan yang baik-baik (pula). Para lelaki dan wanita yang baik-baik bersih dari tuduhan buruk yang dilontarkan oleh orang-orang keji. Mereka akan mendapatkan ampunan dari Allah yang akan menutupi dosa-dosa mereka dan mendapatka rizki yang baik di surga."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "26. Setiap yang keji dari kalangan laki-laki, wanita, perbuatan dan perkataan akan cocok dan sesuai dengan kekejian yang semisalnya, sebaliknya setiap yang baik itu cocok dan sesuai dengan yang baik juga. Mereka yang baik-baik lagi bersih itu terjauhkan dari apa yang dituduhkan oleh laki-laki keji dan wanita-wanita keji. Bagi mereka yang baik-baik dan bersih-bersih itu ampunan dari Tuhan mereka yang menghapus segala dosa mereka, dan bagi mereka juga rezeki yang mulia yaitu Surga."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "26. Para wanita yang keji untuk para lelaki yang keji, dan para lelaki yang keji untuk para wanita yang keji. Sedangkan para wanita yang baik untuk para lelaki yang baik, sedangkan para lelaki yang baik untuk para wanita yang baik; mereka adalah orang-orang yang jauh dari segala kekejian dan selamat dari segala apa yang dikatakan orang-orang yang menyebarkan tuduhan dusta. Mereka akan mendapat ampunan dari Tuhan mereka atas dosa-dosa mereka, dan rezeki yang luas di surga."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "26. الْخَبِيثٰتُ لِلْخَبِيثِينَ (Wanita-wanita yang keji adalah untuk laki-laki yang keji) Yakni para wanita yang buruk untuk para laki-laki yang buruk. وَالْخَبِيثُونَ لِلْخَبِيثٰتِ ۖ( dan laki-laki yang keji adalah buat wanita-wanita yang keji) Para laki-laki itu tidak akan mendapatkan selain para wanita yang buruk. وَالطَّيِّبٰتُ لِلطَّيِّبِينَ وَالطَّيِّبُونَ لِلطَّيِّبٰتِ ۚ( dan wanita-wanita yang baik adalah untuk laki-laki yang baik dan laki-laki yang baik adalah untuk wanita-wanita yang baik) Rasulullah adalah orang yang baik sehingga sangat pantas untuk mendapatkan wanita yang baik; dan Aisyah adalah wanita yang baik sehingga sangat pantas untuk mendapatkan lelaki yang baik. أُو۟لٰٓئِكَ (Mereka (yang dituduh) itu) Yaki para lelaki yang baik dan para wanita yang baik itu. مُبَرَّءُونَ(bersih dari apa yang dituduhkan) Yakni terlepas dari perkataan para lelaki dan wanita yang buruk itu. Dengan ayat ini Ummul Mu’minin Aisyah terbebas dari tuduhan mereka. لهُم مَّغْفِرَةٌ وَرِزْقٌ كَرِيمٌ (Bagi mereka ampunan dan rezeki yang mulia) Yakni rezeki berupa surga."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "26. Wanita-wanita yang buruk itu untuk lelaki yang buruk begitu juga sebaliknya. Setiap mereka tidak memberi kebaikan satu sama lain dalam hal itu dan memang dikhususkan untuk yang serupa dengannya. Dan wanita-wanita baik yang suci itu untuk laki-laki baik yang suci, begitu juga sebaliknya, sehingga masing-masing jenis itu sesuai dengan jenisnya. Rasulallah SAW adalah sebaik-baik manusia, dan isteri-isterinya adalah sebaik-baik wanita. Mereka itu adalah para lelaki dan wanita baik yang berlepas diri dari sesuatu yang diucapkan oleh orang-orang yang suka berbuat buruk dan berbohong dalam kebenaran mereka dengan membuat kepalsuan. Dan bagi mereka itu ampunan (penutup) dari Tuhan mereka atas dosa-dosa mereka dan rejeki surga."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Perempuan-perempuan yang keji untuk laki-laki yang keji, dan laki-laki yang keji untuk perempuan-perempuan yang keji, sedangkan perempuan-perempuan yang baik untuk laki-laki yang baik, dan laki-laki yang baik untuk perempuan-perempuan yang baik. Mereka itu bersih dari apa yang mereka tuduhkan} bersih dari apa yang dikatakan orang-orang yang suka berdusta tentang kebenaran mereka, berupa tuduhan dan berita bohong {Bagi mereka ampunan dan rezeki yang mulia"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "26 “wanita-wanita yang keji adalah untuk laki-laki yang keji, dan laki-laki yang keji adalah buat wanita-wanita yang keji (pula),” maksudnya, setiap yang keji dari kaum lelaki dan wanita (berupa) kata-kata dan perbuatan-perbuatan akan bersesuaian, sejalan dan serupa dengan yang keji. Dan setiap yang baik, dari kalangan lelaki dan wanita (berupa) kata-kata dan perbuatan-perbuatan akan selaras, bertalian dan menyerupai dengan kebaikan. Ini adalah ungkapn umum, dan pembingkaian yang tidak ada sesuatupun yang keluar darinya. Dan komponennya yang paling agung adalah bahwa para nabi, (khususnya dari kalangan ulul azmi, terutama penghulu mereka, Nabi Muhammad, yang merupakan sebaik-baik insan secara mutlak) mereka tidak sederajat kecuali dengan wanita-wanita yang baik. Jadi, mencoreng kehormatan aisyah dengan tuduhan ini (perzinaan) berarti telah mencoreng Nabi. Sebenarnya, beliaulah yang dibidik oleh orang-orang munafik dengan dusta mereka. Dengan status aisyah sebagi istri rasulullah semata sudah diketahui bahwa aisyah adalah wanita yang baik lagi bersih dari perkara yang nista itu. Bagaimana mungkin (fitnah) itu terjadi sedangkan dia adalah wanita yang paling besar kepercayaannya (kepada nabi), paling utama, paling berilmu, dan terbaik, seorang kekasih bagi utusan Allah yang tidak pernah terjadi wahyu diturunkan kepada beliau ketika berada dalam selimut bersama para istri-istri selain dia?! Kemudian Allah menegaskan hal ini, di mana tidak menyisakan komentar lagi para penolak, dan tidak ada ruang untuk ragu-ragu dan syubhat. Allah berfirman, ”mereka (yang dituduh) itu bersih dari apa yang dituduhkan oleh mereka (yang menuduh itu),” pada asalnya, isyarat ini mengarah kepada aisyah, sedangkan para wanita Mukminah yang baik-baik, yang tidak pernah berpikir untuk berbuat tak senonoh ikut masuk kedalam konteksnya yaitu mendapatkan “ampunan”, yang menghapuskan semua dosa ”dan rizki yang mulia,” di surga, yang berasal dari Rabb Yang Mahamulia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nur ayat 26: Demikian pula ucapan dan perbuatan yang keji. Oleh karena itulah, manusia-manusia mulia seperti para nabi dan rasul tidak ada yang menjadi pendamping hidupnya kecuali wanita-wanita yang baik, dan bahwa mencela istrinya sama saja mencela Nabi shallallahu 'alaihi wa sallam. Inilah maksud kaum munafik, mereka cela istrinya, agar Nabi shallallahu 'alaihi wa sallam terkena celaan pula, padahal dengan keadaannya sebagai istri Nabi shallallahu 'alaihi wa sallam sudah dapat diketahui kesuciannya. Seperti ‘Aisyah radhiyallahu 'anha dan termasuk pula wanita mukminah yang baik lagi lengah. Yang menghapuskan semua dosa. Ayat ini menunjukkan kesucian 'Aisyah radhiyallahu 'anhu. Rasulullah adalah orang yang paling baik, maka sudah pasti wanita yang baik pula yang menjadi istri beliau."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nur Ayat 26",
    "description": "Pada ayat ketiga dari surah ini Allah menegaskan bahwa pezina tidak layak mengawini kecuali pezina. Sudah menjadi sunatullah bahwa seseorang selalu cenderung kepada orang yang memiliki kesamaan dengannya. Hal itu kembali ditegaskan pada ayat ini. Perempuan-perempuan yang keji jiwanya dan buruk perangainya adalah untuk laki-laki yang keji layaknya perempuan itu, dan laki-laki yang keji jiwanya dan buruk perangainya untuk perempuan-perempuan yang keji seperti itu pula; dan sebaliknya, perempuan-perempuan yang baik untuk laki-laki yang baik dan laki-laki yang baik untuk perempuan-perempuan yang baik pula. Rasulullah adalah manusia terbaik, maka istri-istrinya pastilah wanita yang baik dan terhormat. Mereka itu bersih dari apa yang dituduhkan orang. Mereka memperoleh ampunan atas kekhilafan mereka dan mendapat rezeki yang mulia di dunia dan akhirat. 27. Ayat-ayat berikut ini berbicara tentang etika berkunjung. Wahai orang-orang yang beriman! janganlah kamu memasuki rumah tinggal yang bukan rumah tinggal-Mu sebelum meminta izin kepada orang yang berada di dalamnya, dan memberi salam kepada penghuninya. Yang demikian itu lebih baik bagimu daripada masuk tanpa izin, agar kamu selalu ingat bahwa cara itulah yang terbaik bagi kamu."
  }
]