[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang yang beriman kepada Allah dan RasulNya serta melaksanakan syariatNya, janganlah kalian memasuki rumah-rumah yang bukan milik kalian, hingga kalian meminta izin kepada penghuninya untuk masuk dan mengucapkan salam pada mereka. Dan bunyi ucapan slam dari as-Sunnah adalah, “Assalamu’alaikum, apakah saya boleh masuk?” permintaan izin masuk itu lebih baik bagi kalian, supaya kalian menjadi ingat perintah-perintah Allah dengan perbuatan kalian meminta izin, sehingga kalian taat kepadaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "27. \"Hai orang-orang yang beriman kepada Allah dan mengamalkan syariat-Nya, janganlah kalian memasuki rumah yang bukan rumah kalian sebelum meminta izin dari penghuninya untuk memasukinya dan memberi salam kepada penghuninya dengan menyatakan, Assalāmu'alaikum, bolehkah aku masuk? Adab minta izin yang diperintahkan kepada kalian ini lebih baik bagi kalian daripada memasuki rumah secara tiba-tiba, agar kalian selalu mengingat apa yang diperintahkan dan mengamalkannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "27. Allah mengajarkan orang-orang beriman adab meminta izin sebelum memasuki rumah, dan menjelaskan hukum-hukum menjaga pandangan pada lima ayat berikut: Janganlah kalian memasuki rumah orang lain sebelum meminta izin pemilik rumah dan mengucapkan salam: “Assalamualaikum, apakah aku boleh masuk?” Adab yang baik ini lebih baik bagi kalian daripada memasuki rumah secara tiba-tiba tanpa meminta izin terlebih dahulu; hal ini agar kalian belajar dan mengamalkan adab yang mulia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "27. يٰٓأَيُّهَا الَّذِينَ ءَامَنُوا۟ لَا تَدْخُلُوا۟ بُيُوتًا غَيْرَ بُيُوتِكُمْ حَتَّىٰ تَسْتَأْنِسُوا۟ (Hai orang-orang yang beriman, janganlah kamu memasuki rumah yang bukan rumahmu sebelum meminta izin) Yakni sampai tuan rumah mengetahui siapa kalian dan sampai kalian mengetahui tuan rumah telah memberi kalian izin untuk masuk. Jika kalian telah mengetahui hal itu maka masuklah. وَتُسَلِّمُوا۟ عَلَىٰٓ أَهْلِهَا ۚ( dan memberi salam kepada penghuninya) Yakni dengan mengucapkan ‘Assalamualaikum, apakah aku boleh masuk?’ kalimat ini diucapkan sekali, dua kali, atau tiga kali. ذٰلِكُمْ خَيْرٌ لَّكُمْ(Yang demikian itu lebih baik bagimu) Daripada langsung memasuki rumah itu. لَعَلَّكُمْ تَذَكَّرُونَ (agar kamu (selalu) ingat) Yang dimaksud adalah agar kalian mengambil nasehat ini dan mengamalkan apa yang diperintahkan kepada mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "27. Wahai orang-orang yang beriman, janganlah kalian memasuki rumah-rumah yang bukan rumah kalian sampai kalian meminta ijin untuk masuk dan mengucapkan salam kepada pemiliknya dengan mengucap: “Assalamu’alaikum, apakah saya boleh masuk?” Permintaan ijin itu lebih baik bagi kalian daripada masuk tanpa ijin, barangkali kalian bisa mendapatkan pelajaran, sehingga kalian mengetahui tentang apa yang diperintahkan untuk kalian. Ayat ini diturunkan untuk wanita anshar yang berkata: “Wahai Rasulallah, Aku berada di rumahku dalam keadaan yang aku sendiri tidak ingin dilihat orang lain, namun masih saja ada laki-laki dari keluargaku yang masuk rumahku sedangkan aku dalam kondisi tersebut. Lalu bagaimanakah yang harus saya lakukan?”Kemudian turunlah ayat ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, janganlah memasuki rumah yang bukan rumah kalian sebelum meminta izin} meminta izin untuk masuk {dan memberi salam kepada penghuninya. Demikian itu lebih baik bagi kalian agar kalian mengambil pelajaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "27 Allah mengarahkan para hambaNya yang Mukmin untuk tidak memasuki rumah orang lain tanpa izin, karena hal ini menyebabkan beberapa bahaya: Diantaranya yang pertama, apa yang nabi sebutkan “sesungguhnya diberlakukannya meminta izin (bagi kalian) untuk alasan (penjagaan) pandangan.” Lantaran meremehkan perkara ini, pandangan mata mengenai aurat-aurat (hal-hal yang tidak patut diketahui) dalam rumah. Sesungguhnya rumah itu bagi seorang manusia dalam menjaga auratnya, seperti kedudukan baju dalam menjaga aurat tubuhnya. Kedua, orang yang masuk tanpa izin akan memunculkan kecurigaan, ia akan disangka buruk sebagai pencuri dan lainnya. Karena mauk dengan sembunyi-sembunyi menunjukkan kejelekan. Allah melarang kaum Mukminin untuk memasuki selain rumah mereka “sehingga kalian meminta izin.” Meminta izin (untuk masuk) dinamakan isti’nas karena, melalui izin akan menghasilkan keramahan, sedangkan ketiadaannya akan mengakibatkan kekakuan. “dan memberi salam kepada penghuninya,” mekanismenya sebagimana yang tertuang dalam salah satu hadits, “ Assalamu’alaikum, apakah saya boleh masuk?” “yang demikian itu,” izin yang telah disinggung “lebih baik bagimu, agar kamu (selalu) ingat,” karena mengandung beberapa maslahat, termasuk budi pekerti mulia yang wajib dilakuka. Bila diizinkan, maka orang yang meminta izin itu boleh masuk ke dalam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nur ayat 27: Karena jika tidak meminta izin terdapat banyak mafsadat, di antaranya dapat melihat aurat yang ada dalam rumah, karena rumah merupakan aurat bagi seseorang seperti halnya pakaian yang menjadi penutup bagi auratnya. Di samping itu, tanpa meminta izin dapat menimbulkan keraguan, tuduhan buruk terhadapnya sebagai pencuri misalnya, dsb. Hal itu, karena masuk secara diam-diam menunjukka keburukan. Allah sebut meminta izin dengan isti’nas, karena dengan meminta izin, maka akan membuat nyaman penghuni rumah setelah merasakan ketidaknyamanan. Yaitu dengan mengucapkan, “As Salaamu ‘alaikum, bolehkah saya masuk?” Daripada masuk tanpa meminta izin, karena yang demikian menunjukkan akhlak yang mulia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nur Ayat 27",
    "description": "Ayat-ayat berikut ini berbicara tentang etika berkunjung. Wahai orang-orang yang beriman! janganlah kamu memasuki rumah tinggal yang bukan rumah tinggal-Mu sebelum meminta izin kepada orang yang berada di dalamnya, dan memberi salam kepada penghuninya. Yang demikian itu lebih baik bagimu daripada masuk tanpa izin, agar kamu selalu ingat bahwa cara itulah yang terbaik bagi kamu. 28. Jika kamu tidak menemui seorang pun di dalamnya, yaitu jika di dalam rumah yang kamu kunjungi itu tidak ada orang sama sekali atau tidak ada yang berwenang mengizinkan atau melarang kamu masuk, maka janganlah kamu masuk sebelum kamu mendapat izin. Dan jika dikatakan oleh penghuni rumah kepadamu, 'kembalilah!' maka hendaklah kamu kembali dan tidak bersikeras meminta izin. Yang demikian itu lebih suci bagimu karena menjauhkan kamu dari prasangka negatif. Dan Allah maha mengetahui apa yang kamu kerjakan, dan dia pun akan membalasnya."
  }
]