[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apabila kalian tidak menjumpai ada orang di rumah-rumah orang lain, maka janganlah kalian memasukinya sampai ada orang yang memberikan izin masuk kepada kalian. Jika tidak memberikan izin kepada kalian, sebaliknya dia berkata kepada kalian, “Kembalilah”, maka pulanglah dan janganlah kalian mendesak. Sesungguhnya sikap kembali pada waktu itu lebih suci bagi kalian. Sebab seseorang akan mengalami keadaan-keadaan yang mana dia tidak suka orang lain melihatnya dalam keadaan itu. Dan Allah Maha Mengetahui apa yang kalian perbuat, lalu memberikan balasan bagi setiap orang sesuai dengan perbuatannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "28. Jika dalam rumah itu kalian tidak mendapati seorangpun, maka janganlah kalian masuk ke dalamnya sebelum kalian mendapat izin dari orang yang berhak memberikannya. Dan jika pemiliknya berkata kepada kalian, \"Kembali sajalah\", maka hendaklah kalian kembali, dan jangan masuk ke dalamnya, karena hal itu lebih bersih bagimu di sisi Allah, dan Allah Maha Mengetahui apa yang kamu kerjakan, tidak ada sesuatupun darinya yang tersembunyi bagi-Nya, dan Dia akan memberikan balasan pada kalian atas hal tersebut."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "28. Dan jika kalian tidak mendapati seorangpun yang ada di rumah yang dapat memberi izin, maka janganlah kalian memasukinya, hingga kalian mendapatkan izin. Dan jika kalian tidak diperkenankan masuk dan diminta untuk kembali pulang, maka kembalilah karena itu lebih mulia bagi kalian. Allah Maha Mengetahui segala yang kalian lakukan, tidak ada yang tersembunyi dari-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "28. حَتَّىٰ يُؤْذَنَ لَكُمْ ۖ (sebelum kamu mendapat izin) Yakni izin memasuki rumah dari orang yang berhak memberi izin. وَإِن قِيلَ لَكُمُ ارْجِعُوا۟ فَارْجِعُوا۟ ۖ( Dan jika dikatakan kepadamu: “Kembali (saja)lah, maka hendaklah kamu kembali) Yakni jika tuan rumah berkata kepada kalian “pergilah” maka hendaklah kalian pergi dan jangan kembali meminta izin sekali lagi. هُوَ أَزْكَىٰ لَكُمْ ۚ( Itu lebih bersih bagimu) Yakni lebih suci dan bersih dari keburukan akibat memaksa untuk masuk. Sebab hal itu lebih melapangkan dada, lebih jauh dari hal yang meragukan, dan terhindar dari ketidak-sopanan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "28. Jika kalian tidak mendapati seorangpun dalam rumah itu yang memberi ijin kalian untuk masuk, maka janganlah kalian memasukinya sampai mereka memberi ijin kalian untuk masuk. Dan jika pemilik rumah berkata kepada kalian: “Kembalilah, kembalilah, jangan meminta ijin (untuk masuk) lagi”, maka kembali itu lebih baik dan lebih benar bagi kalian agar tidak mengganggu. Allah itu Maha Mengetahui Perbuatan kalian dan akan membalas kalian atas perbuatan itu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika kalian tidak mendapati seorang pun di dalamnya} di dalam rumah itu {maka janganlah memasukinya sampai kalian diberi izin. Jika dikatakan kepada kalian,“Kembalilah”, maka kembalilah} jika setelah meminta izin, penghuni rumah berkata kepada kalian, “pergilah”. Maka bergilah dan janganlah berbuat tipu daya untu mendapatkan izin {Itu lebih suci} lebih bersih {bagi kalian. Allah Maha Mengetahui apa yang kalian kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "28 “ jika kamu tidak menemui seorangpun di dalamnya,” maka janganlah kalian masuk kedalamnya “sehingga kamu mendapat izin. Dan jika dikatakan kepadamu,’kembali (saja)lah,’ maka hendaklah kamu kembali,” maksudnya, jangan kalian menampik untuk kembali dan jangan kalian marah karena tidak diizinkan. Karena, pemilik rumah tidak sedang menghalangi hak kalian yang harus dipenuhi. Pemberian izin sifatnya sukarela. Terserah dia, mau memberi izin atau menolaknya. Maka, janganlah sampai terbawa oleh kesombongan dan perasaan antipati dengan keadaan seperti ini. “itu lebih bersih bagimu,” maksudnya, lebih maksimal untuk membersihkan dari kejelekan dan menambah kebaikan-kebaikan kalian. “dan Allah MahaMengetahui apa yang kamu kerjakan,” Di akan membalas setiap orang sesuai dengan apa yang diamalkannya, tergantung banyak atau sedikit, baik atau jeleknya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nur ayat 28: Yang memberi izin kepadamu untuk masuk. Hal ini menunjukkan haramnya masuk tanpa meminta izin pada rumah yang berpenghuni. Setelah meminta izin. Yakni janganlah kamu enggan untuk kembali dan jangan pula marah karenanya, karena pemilik rumah tidak menghalangi hak kamu yang wajib dipenuhi, ia hanya bertabarru’ (memberikan kesediaan), jika dia menghendaki, dia bisa mengizinkan dan jika tidak, maka dia boleh tidak mengizinkan. Oleh karena itu, janganlah kamu malah merasa sombong dengan menolak untuk kembali. Sa’id bin Jubair berkata tentang ayat tersebut, “Janganlah kamu berdiri (terus) di depan pintu manusia.” Yakni lebih menyucikan kamu dari keburukan dan membina kamu di atas kebaikan. Oleh karena itu, Dia akan memberikan balasan kepada kamu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nur Ayat 28",
    "description": "Jika kamu tidak menemui seorang pun di dalamnya, yaitu jika di dalam rumah yang kamu kunjungi itu tidak ada orang sama sekali atau tidak ada yang berwenang mengizinkan atau melarang kamu masuk, maka janganlah kamu masuk sebelum kamu mendapat izin. Dan jika dikatakan oleh penghuni rumah kepadamu, 'kembalilah!' maka hendaklah kamu kembali dan tidak bersikeras meminta izin. Yang demikian itu lebih suci bagimu karena menjauhkan kamu dari prasangka negatif. Dan Allah maha mengetahui apa yang kamu kerjakan, dan dia pun akan membalasnya. 29. Usai menjelaskan etika memasuki rumah yang berpenghuni pada ayat-ayat sebelumnya, Allah lalu menguraikan etika memasuki rumah yang tak berpenghuni atau bangunan yang disediakan untuk umum. Tidak ada dosa atasmu memasuki rumah yang tidak dihuni yang tidak dibuat untuk tempat tinggal pribadi secara tetap, seperti masjid, kedai, dan pasar, yang di dalamnya ada kepentingan kamu, misalnya untuk beristirahat atau keperluan lain. Allah mengetahui apa yang kamu nyatakan dan apa yang kamu sembunyikan dalam dada, termasuk niat baik atau buruk kamu."
  }
]