[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Akan tetapi, tidak masalah bagi kalian untuk masuk tanpa izin ke dalam rumah-rumah yang tidak dikhususkan untuk pemukiman manusia secara pribadi. Akan tetapi, dibangun untuk dinikmati oleh orang yang membutuhkannya, seperti rumah-rumah yang diperuntukkan sebagai sedekah ibnu sabil yang berada di lintasan orang-orang yang menempuh perjalanan jauh dan fasilitas umum lainnya. Di situ terdapat fasilitas-fasilitas yang bermanfaat dan apa-apa yang diperlukan bagi orang yang memasukinya, dan meminta izin dalam kondisi seperti ini menyulitkan. Dan Allah mengetahui keadaan-keadaan kalian yang nyata dan tersembunyi."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "29. Tidak ada dosa atas kalian bila memasuki rumah umum -yang tidak dimiliki oleh seorangpun dan disediakan untuk umum- tanpa meminta izin, seperti perpustakaan, dan toko-toko di pasar. Allah mengetahui apa yang kalian tampakkan dan sembunyikan berupa amal perbuatan dan kondisi kalian, tidak ada sesuatupun dari itu yang tersembunyi bagi-Nya, dan Dia akan memberikan balasan pada kalian atas hal tersebut."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "29. Adapun jika bangunan itu milik umum dan tidak dikhususkan untuk hunian seseorang, seperti bangunan pos penjagaan dan tempat peristirahatan umum yang kalian juga memiliki hak pemanfaatannya, maka tidak mengapa kalian memasukinya tanpa meminta izin terlebih dahulu. Allah Maha Mengetahui apa yang kalian tampakkan dan kalian rahasiakan dalam hati."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "29. لَّيْسَ عَلَيْكُمْ جُنَاحٌ أَن تَدْخُلُوا۟ بُيُوتًا غَيْرَ مَسْكُونَةٍ (Tidak ada dosa atasmu memasuki rumah yang tidak didiami) Yakni bangunan seperti penginapan, warung, dan bangunan-bangunan umum lainnya, sebab pemiliknya membawa barang dagangan dan meletakkannya dalam bangunan tersebut, dan itu sebagai izin bagi semua orang. Imam ‘Atha berpendapat yang dimaksud dalam ayat ini adalah bangunan yang telah rusak dan ditinggal pemiliknya. فِيهَا مَتٰعٌ لَّكُمْ ۚ( yang di dalamnya ada keperluanmu) Makna (المتاع) adalah barang atau jasa yang diperjualbelikan. وَاللهُ يَعْلَمُ مَا تُبْدُونَ وَمَا تَكْتُمُونَ(dan Allah mengetahui apa yang kamu nyatakan dan apa yang kamu sembunyikan) Yakni apa yang kalian tampakkan dan apa yang kalian rahasiakan. Dalam potongan ayat ini terdapat ancaman bagi orang yang tidak menjaga adab yang Allah perintahkan dalam memasuki rumah orang lain."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "29. Kalian tidak berdosa jika kalian memasuki tempat-tempat yang tidak dihuni (fasilitas umum) seperti hotel, masjid dan toko, Di dalamnya ada hak yang bisa kalian nikmati manfaatnya seperti melihat barang, dan duduk untuk berinteraksi. Dan Allah mengetahui apa yang kalian tampakkan dan sembunyikan dalam dada kalian berupa maksud baik atau buruk. Dan terdapat ancaman bagi orang yang melanggar norma-norma di dalamnya. Saat turun ayat tentang permintaan ijin memasuki rumah, Abu Bakar berkata: “Wahai Rasulallah, lalu bagaimana para pedagang Quraisy yang selalu hilir mudik antara Mekah, Madinah, dan Syam, sedangkan mereka mempunyai rumah-rumah tertentu di sepanjang jalan. Bagaimana mereka meminta ijin dan memberi salam, padahal di dalamnya tidak ada penghuninya?” Kemudian turunlah ayat ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidak ada dosa} kesalahan {atas kalian memasuki rumah yang tidak dihuni yang di dalamnya ada kepentingan kamu} di dalamnya ada sesuatu yang bisa memberi kalian manfaat {Allah mengetahui apa yang kalian tampakkan dan apa yang kalian sembunyikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "29 hukum ini berlaku di rumah yang dihuni, baik didalamnya terdapat perabotan seseorang ataupun tidak. Juga berlaku di rumah yang tidak dihuni yang di dalamnya tidak tersimpan barang miliknya. Adapun, rumah yang tidak berpenghuni, yang di dalamnya terdapat barang keperluan orang yang masuk kedalamnya sementara tiada seorangpun yang dapat diminta izin demikian ini seperti rumah-rumah yang kosong dan sejenisnya. Maka, Allah menyebutkan dalam FirmanNya, ”tidak ada dosa atasmu,” maksudnya, (tidak ada) hukuman dan kesalahan. Hal ini menunjukkan bahwa memasuki rumah-rumah yang telah disebutkan sebelumnya (yang berpenghuni) tanpa izin hukumnya haram dan menimbulkan kesalahan. “memasuki rumah yang disediakan untuk didiami, yang di dalamnya ada keperluanmu,” ini termasuk bentuk pengecualian yang mengagumkan dalam al-qur’an, karena Firman Allah, “janganlah kamu memasuki rumah selain rumah kamu,” adalah lafazh umum, mencakup setiap rumah yang bukan hak milik seseorang, tetapi didalamnya terdapat barang keperluannya, dan tidak berpenghuni. Allah memperbolehkan memasukinya. “dan Allah mengetahui apa yang kamu nyatakan dan apa yang kamu sembunyikan,” yaitu keadaan kalian yang Nampak ataupun tidak, dan mengetahui kemaslahatan kalian. Karenanya, Allah mensyariatkan untuk kalian hukum-hukum syar’I yang kalian butuhkan dan perlukan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nur ayat 29: Seperti rumah-rumah (pos-pos) penjagaan, rumah yang disewakan, rumah-rumah untuk tamu, dan rumah-rumah ibnussabil. Seperti keinginan untuk masuk ke rumah tidak berpenghuni karena tujuan baik atau mubah. Allah mengetahui semua keadaan kita, baik yang nampak maupun yang tersembunyi, oleh karenanya Dia mensyariatkan kepada kita semua yang kita butuhkan berupa hukum-hukum syar’i."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nur Ayat 29",
    "description": "Usai menjelaskan etika memasuki rumah yang berpenghuni pada ayat-ayat sebelumnya, Allah lalu menguraikan etika memasuki rumah yang tak berpenghuni atau bangunan yang disediakan untuk umum. Tidak ada dosa atasmu memasuki rumah yang tidak dihuni yang tidak dibuat untuk tempat tinggal pribadi secara tetap, seperti masjid, kedai, dan pasar, yang di dalamnya ada kepentingan kamu, misalnya untuk beristirahat atau keperluan lain. Allah mengetahui apa yang kamu nyatakan dan apa yang kamu sembunyikan dalam dada, termasuk niat baik atau buruk kamu. 30. Usai menjelaskan etika berkunjung pada ayat sebelumnya, pada ayat ini Allah menguraikan etika berinteraksi antarsesama, baik saat di dalam rumah maupun di luar rumah. Wahai nabi Muhammad, katakanlah kepada laki-laki yang beriman dengan mantap agar mereka menjaga pandangannya dari melihat sesuatu yang tidak halal dilihat, dan perintahlah mereka memelihara kemaluannya dari apa yang tidak halal untuknya. Yang demikian itu lebih suci bagi jiwa mereka agar tidak terjatuh pada perbuatan haram. Sungguh, Allah maha mengetahui apa yang mereka perbuat."
  }
]