[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Lelaki pezina tidak rido kecuali menikah dengan wanita pezina atau seorang wanita musyrik yang tidak mengakui haramnya perzinaan. Dan wanita pezina tidak dinikahi, kecuali oleh lelaki pezina atau seorang lelaki musyrk yang tidak mengakui haramnya perzinaan. Adapun laki-laki dan perempuan yang menjaga kehoratan tidak akan rido dengan pernikahan tersebut. Dan pernikahan demikian diharamkan bagi kaum Mukminin. Ini merupakan dalil jelas tentang haramnya menikahi wanita pezina hingga dia bertaubat, demikian pula tentang haramnya menikahkan lelaki pezina, kecuali jika dia telah bertaubat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Lantaran kejinya perbuatan zina ini, Allah menyebutkan bahwa laki-laki pezina yang terbiasa melakukannya tidak ingin menikah kecuali dengan seorang wanita pezina seperti dirinya, atau dengan seorang wanita musyrik yang tidak menjaga diri dari zina, padahal ia tidak boleh untuk dinikahi. Demikian pula wanita pezina yang terbiasa melakukannya tidak ingin menikah kecuali dengan seorang laki-laki pezina seperti dirinya atau laki-laki musyrik yang tidak menjaga diri dari zina, padahal ia tidak boleh untuk dinikahi. Menikah dengan wanita pezina atau menikahkan laki-laki pezina; diharamkan atas orang-orang mukmin."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "3. Allah memperingatkan dari bahaya perzinaan yang dapat menodai kehormatan dan diri pelakunya. Allah menyampaikan bahwa pezina tidak boleh menikahi perempuan melainkan dengan perempuan pezina pula karena keadaan mereka sama, atau menikah dengan perempuan musyrik yang tidak mengakui keharaman zina. Begitu pula perempuan pezina tidak boleh dinikahi melainkan oleh laki-laki pezina. Adapun orang yang menjaga kehormatan maka dilarang menikahi mereka. Atau dinikahi oleh lelaki musyrik yang tidak mengakui keharaman zina. Dan orang-orang beriman diharamkan menikahi mereka, keculai mereka yang telah bertaubat. Abu Hurairah berkata, Rasulullah bersabda: “Pezina yang telah dicambuk tidak boleh menikah melainkan dengan pezina sepertinya.” (Diriwayatkan oleh Abu Daud dalam as-Sunan, kitab nikah, bab firman Allah [الزاني لا ينكح إلا زانية] no. 2052. Dishahihkan oleh al-Albani dalam Shahih Sunan Abu Daud no. 1807)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. الزَّانِى لَا يَنكِحُ إِلَّا زَانِيَةً (Laki-laki yang berzina tidak mengawini melainkan perempuan yang berzina) Yakni sebagian besar pezina laki-laki tidak ingin menikah kecuali dengan pezina sepertinya, begitu pula sebagian besar pezina perempuan tidak ingin menikah kecuali dengan pezina sepertinya. Maksud dari ayat ini adalah sebagai larangan bagi orang-orang beriman untuk menikahi para pelaku zina setelah Allah melarang mereka dari perbuatan zina, dan ini merupakan pendapat yang paling dekat dengan kebenaran. وَحُرِّمَ ذٰلِكَ عَلَى الْمُؤْمِنِينَ (dan yang demikian itu diharamkan atas oran-orang yang mukmin) Yakni diharamkan menikahi wanita-wanita pezina atau pelaku syirik, sebab dalam menikah dengan mereka terdapat tasyabbuh (menyerupai) orang-orang fasik, dan mengundang tuduhan, serta kemungkinan mendapat anak yang bukan darinya. Oleh sebab itu tidak halal bagi seorang muslim yang senantiasa menjaga kehormatan untuk menikahi perempuan yang tidak menjaga kehormatan padahal ia mengatahui keadaannya. Begitu pula tidak halal bagi perempuan muslim yang senantiasa menjaga kehormatan untuk menikahi lelaki yang tidak menjaga kehormatan padahal ia mengetahui keadaannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Keadaan yang lazim adalah bahwa pelaku zina atau yang berzina itu tidak mungkin dilakukan oleh seseorang yang senantiasa menjaga diri dan juga memiliki suami/istri. Adapun yang dimungkinkan melakukan zina adalah orang-orang yang semisalnya, ini dimaksudkan sebagai peringatan tentang kejinya perbuatan zina. Laki-laki pezina tidak mengawini melainkan perempuan pezina, atau perempuan musyrik; dan perempuan pezina tidak dikawini melainkan oleh laki-laki pezina atau laki-laki musyrik. dan yang demikian itu diharamkan atas orang-orang yang mukmin yang bertakwa, yang mana di dalamnya mengandung penyerupaan terhadap kerusakan. Maksud pengharaman itu adalah mensucikan dan menjauhkan diri dengan sungguh-sungguh dari golongan itu. Ayat ini diturunkan terkait Martsad Al-ghanawi yang ingin menikahi sahabatnya yang ada di Mekah, dia dipanggil 'Anaq. Dan hukum pengharaman itu dikhususkan dengan suatu ayat atau dicabut dengan firman Allah SWT {Wankihul ayyaamaa minkum} [An-Nur 24/32]"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Pezina laki-laki tidak pantas menikah, kecuali dengan pezina perempuan atau dengan perempuan musyrik. Dan pezina perempuan tidak pantas menikah, kecuali dengan pezina laki-laki atau dengan laki-laki musyrik. Yang demikian itu diharamkan} Allah mengharamkan yang demikian itu {bagi orang-orang mukmin"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3. ini merupakan keterangan betapa bejatnya perzinaan. Mengotori kehormatan pelakunya dan harga diri orang yang menyertai dan berinteraksi dengannya. Sebuah implikasi buruk yang tidak ditimbulkan oleh dosa-dosa yang lain. Allah mengabarkan bahwa seorang lelaki yang berzina tidak boleh menikahi wanita kecuali wanita yang berzina. Kondisi lelaki itu sejalan dengan seluk-beluk si wanita. Atau (menikahi) seorang wanita musyrik (yang menyekutukan Allah), tidak mengimani Hari Kebangkitan maupun pembalasan, tidak konsisten dengan perintah Allah. Begitu pula, wanita yang berzina, tidak akan dinikahi kecuali oleh lelaki pezina atau lelaki musyrik. “dan yang demikian itu diharamkan atas orang-orang yang Mukmin,” maksudnya, diharamkan atas mereka untuk menikahkan seorang lelaki yang berbuat zina (dengan anak perempuannya atau anak perempuan yang berada di bawah perwaliannya) maupun mengawini seorang perempuan pezina. Pengertian dari ayat ini, siapa saja yang menyandang sifat perzinaan, baik lelaki maupun perempuan dan belum bertaubat dari tindakan itu, bahwa orang yang menikah dengannya, kendati ada larangan dari Allah, tidak lepas dari kondisi, tidak berpegang teguh dengan hukum Allah,dan RasulNya, orang ini tidak lain seorang yang musyrik, atau orang itu sosok yang berpegang teguh dengan hukum Allah dan RasulNya, lalu melangkah untuk melangsungkan pernikahan dengannya, padahal mengetahui tindak perzinaan yang dilakukan (calonnya), maka sesungguhynya pernikahan ini adalah perzinaan. Lelaki yang menikahi seorang (wanita) pezina lagi pengobral nafsu bejat, seandainya dia beriman kepada Allah dengan sebenar-benarnya, niscaya dia tidak mau mencobanya. Keterangan ini adalah bukti tegas atas pengharaman menikahi wanita pezina, sampai dia bertaubat. Begitu pula(larangan) menikahkan lelaki pezina, sehingga bertaubat. Sesungguhnya bentuk kebersamaan antara suami dengan istrinya atau istri dengan suaminya merupakan interaksi dan perpaduan yang sangat kuat. Allah berfirman, “(kepada malaikat perintahkan),’ kumpulkanlah orang-orang yang zhalim beserta teman sejawat merea’.” ( ash-shaffat:22) Yaitu para istri yang menemani mereka. Karena itu, Allah mengharamkan praktik prostitusi ini. Melihat kandungan kejelekannya yang sangat besar. Dan pada perbuatan perzinaan terkandung sebagian dari minimnya kecemburuan (dari pasangan), serta menasabkan anak-anak yang bukan berasal drai suaminya, dan keadaan suami pezina yang tidak menjaga kehormatan istrinya karena sibuk dengan pelacur lain termasuk sebagian yang membuatnya diharamkan. Dalam ayat ini terdapat dalil bahwa sesorang yang melakukan perbuatan zina bukanlah seorang Mukmin (yang sempurna imannya). Senada dengan sabda Nabi, “tidaklah seorang pezina saat berzina dalam keadaan beriman (sempurna).\" Maka dia walaupunbukan orang musyrik, maka tidak layak baginya disematkan sebuah pujian sebagan seorang mukmin yang mutlak."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nur ayat 3: Tirmidzi meriwayatkan dengan sanadnya yang sampai kepada ‘Amr bin Syu’aib dari bapaknya dari kakeknya, ia berkata, “Ada seseorang yang bernama Martsad bin Abi Martsad. Ia adalah seorang yang biasa membawa para tawanan dari Mekah dan membawanya ke Madinah. Di Mekah ada seorang wanita pelacur bernama ‘Anaq yang menjadi temannya. Ia pernah berjanji akan membawa salah seorang tawanan yang berada di Mekah untuk dibawanya (ke Madinah). Martsad berkata, “Aku pun datang, sehingga sampai di salah satu bayangan dinding di antara dinding-dinding Mekah di malam yang terang bulan. ‘Anaq kemudian datang, dia melihat hitam bayanganku dari balik dinding. Ketika ia sampai kepadaku, ia pun mengenaliku dan berkata, “(Apakah ini) Martsad?” Aku menjawab, “Martsad.” Ia berkata, “Selamat datang, bermalamlah dengan kami malam ini.” Aku berkata, “Wahai ‘Anaq, Allah mengharamkan zina.” Maka ‘Anaq berkata, “Wahai penghuni kemah! Inilah orang yang akan membawa para tawananmu.” Maka aku dikejar oleh delapan orang, dan aku pun menempuh jalan Khandamah hingga aku sampai ke sebuah gua dan masuk ke dalamnya. Mereka pun datang sampai berdiri di atas kepalaku lalu buang air kecil sehingga menimpa ke kepalaku, namun Allah membutakan mereka sehingga tidak melihatku. Mereka pun balik dan aku kembali kepada kawanku dan membawanya, sedangkan dia adalah seorang yang cukup berat hingga aku sampai di rerumputan idzkhir, lalu aku lepas rantainya, aku pun membawanya dan ia cukup memberatkanku sehingga aku sampai ke Madinah. Aku pun datang kepada Rasulullah shallallahu 'alaihi wa sallam dan berkata, “Wahai Rasulullah, bolehkah aku menikahi ‘Anaq. Rasulullah shallallahu 'alaihi wa sallam pun diam dan tidak menjawab apa-apa kepadaku sehingga turun ayat, “Pezina laki-laki tidak boleh menikah kecuali dengan pezina perempuan, atau dengan perempuan musyrik; dan pezina perempuan tidak boleh menikah kecuali dengan pezina laki-laki atau dengan laki-laki musyrik; dan yang demikian itu diharamkan bagi orang-orang mukmin.” Lalu Rasulullah shallallahu 'alaihi wa sallam bersabda, “Wahai Martsad, Pezina laki-laki tidak boleh menikah kecuali dengan pezina perempuan, atau dengan perempuan musyrik; dan pezina perempuan tidak boleh menikah kecuali dengan pezina laki-laki atau dengan laki-laki musyrik.” Maka janganlah engkau nikahi.” (Tirmidzi berkata, “Hadits ini hasan gharib, tidak diketahui kecuali dari jalan ini. Hadits ini diriwayatkan pula oleh Abu Dawud, Nasa’i, Ibnu Jarir dan dalam sanad tersebut menurutnya ada orang yang mubham (tidak jelas namanya), Hakim secara singkat, Hakim berkata, “Shahih isnadnya.” Dan didiamkan oleh Adz Dzahabi). Syaikh As Sa’diy berkata, “Ayat ini menjelaskan buruknya perbuatan zina, dan bahwa ia dapat mengotori kehormatan pelakunya dan kehormatan orang yang menemani dan mencampurinya tidak seperti dosa-dosa yang lain. Allah memberitahukan, bahwa pezina laki-laki tidak ada yang maju menerima nikahnya dari kalangan wanita selain wanita pezina juga yang keadaannya sama atau wanita yang menyekutukan Allah, tidak beriman kepada kebangkitan, dan tidak beriman kepada pembalasan, serta tidak memegang teguh perintah Allah. Demikian juga pezina perempuan, tidak ada yang mau menikahinya selain pezina laki-laki atau laki-laki musyrik.” Menikahi wanita pezina, atau menikahkan puterinya dengan laki-laki pezina. Maksud ayat ini menurut Syaikh As Sa’diy adalah, “Bahwa barang siapa yang berbuat zina laki-laki atau wanita dan tidak bertobat daripadanya, maka orang yang maju menikahinya sedangkan Allah mengharamkannya, tidak lepas kemungkinan orangnya tidak berpegang teguh dengan hukum Allah dan Rasul-Nya, dan tidak ada yang seperti itu kecuali orang musyrik, bisa juga ia berpegang dengan hukum Allah dan Rasul-Nya, lalu ia memberanikan diri menikahinya padahal ia tahu orang itu sebagai pezina, maka pernikahan itu sesungguhnya zina, dan orang yang menikahinya adalah pezina. Kalau ia beriman kepada Allah dengan benat, tentu ia tidak akan maju melakukannya. Ini merupakan dalil yang tegas haramnya menikahi wanita pezina sampai ia bertobat dan demikian pula haramnya menikahkan (puteri kita) kepada laki-laki pezina sampai ia bertobat, karena hubungan suami dengan istrinya dan istri dengan suaminya adalah hubungan yang paling kuat dan paling sepasang. Allah Ta’ala telah berfirman, “(Kepada malaikat diperintahkan), \"Kumpulkanlah orang-orang yang zalim beserta teman sejawat mereka…dst,” (terj. Ash Shaffaat: 22) yakni teman penyerta mereka. Allah mengharamkan yang demikian karena di dalamnya terdapat keburukan yang besar, dan di sana menunjukkan sedikitnya rasa kecemburuan, menghubungkan anak-anak yang bukan berasal dari suami, dan karena pezina tidak akan menjaga istrinya karena sibuk dengan wanita lain, di mana sebagian ini sudah cukup menjadikannya haram. Dalam ayat ini terdapat dalil bahwa pezina bukanlah seorang mukmin (mutlak), sebagaimana sabda Nabi shallallahu 'alaihi wa sallam, “Tidaklah berzina seorang pezina sedangkan dia adalam keadaan mukmin.” Pezina meskipun bukan musyrik, namun tidak diberikan gelar yang terpuji, yaitu iman yang mutlak.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nur Ayat 3",
    "description": "Usai menjelaskan hukuman atas pezina, ayat ini mengingatkan keharusan menghindari pezina, khususnya untuk dijadikan pasangan hidup. Pezina laki-laki tidak boleh menikah kecuali dengan pezina perempuan atau dengan perempuan musyrik; dan demikian juga sebaliknya, pezina perempuan tidak boleh menikah kecuali dengan pezina laki-laki atau dengan laki-laki musyrik; dan yang demikian itu, yaitu menikah dengan pezina, diharamkan bagi orang-orang mukmin. 4-5. Usai menjelaskan hukuman bagi pezina dan hukum menikahinya, Allah lalu menguraikan sanksi hukum terhadap orang yang menuduh orang lain berbuat zina. Dan orang-orang yang menuduh perempuan-perempuan yang baik telah berbuat zina, dan mereka tidak dapat mendatangkan empat orang saksi yang menjadi saksi atas kebenaran tuduhannya di hadapan pengadilan, maka deralah mereka, wahai kaum mukmin melalui penguasa kamu, sebanyak delapan puluh kali. Hukuman ini berlaku jika penuduh adalah orang merdeka. Jika ia adalah seorang hamba sahaya maka deralah ia empat puluh kali (lihat juga: an-nis'/4: 25). Dan ja-nganlah kamu terima kesaksian mereka untuk selama-lamanya. Mereka itulah orang-orang yang fasik. Ketentuan ini berlaku atas semua orang yang berbuat demikian, kecuali mereka yang bertobat, menyesali perbuatannya, dan bertekad tidak akan mengulanginya setelah itu, yaitu setelah menerima hukuman itu, dan mereka membuktikan tobat mereka de-ngan memperbaiki diri dan beramal saleh. Jika mereka melakukannya maka sungguh, Allah maha pengampun, maha penyayang."
  }
]