[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah wahai Nabi, kepada laki-laki Mukmin agar mereka menundukkan pandangan-pandangan mereka dari wanita-wanita dan aurat-aurat yang tidak halal bagi mereka, memelihara kemaluan mereka dari perkara yang diharamkan Allah, seperti zina, homoseksual dan membuka aurat serta perkara terlarang lainnya. Yang demikian itu lebih suci bagi mereka. Sesungguhnya Allah Maha Mengetahui apa yang mereka perbuat terkait perkara yang Allah perintahkan kepada mereka dan perkara yang Allah melarang mereka darinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "30. \"Katakanlah -wahai Rasul- kepada kaum laki-laki yang beriman agar mereka menahan pandanganya dari melihat hal-hal yang tidak halal bagi mereka seperti wanita dan aurat, dan hendaknya memelihara kemaluan mereka agar tidak terjatuh dalam perkara yang haram dan (tidak) menyingkapnya. Menahan pandangan dari perkara haram itu adalah lebih suci bagi mereka di sisi Allah, sesungguhnya Allah Maha Mengetahui apa yang mereka perbuat, tidak ada sesuatupun dari hal itu yang tersembunyi bagi-Nya, dan Dia akan memberikan balasan pada kalian atas hal tersebut."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "30. Allah memerintahkan Rasulullah untuk menyampaikan kepada orang-orang beriman perintah agung yang sering disepelekan banyak orang, yaitu menundukkan pandangan dari apa yang tidak boleh dilihat dan menjaga kemaluan dengan menjauhi hal-hal yang diharamkan. Perintah yang agung ini lebih menjaga kehormatan mereka lahir dan batin. Allah Maha Mengetahui penundukan pandangan dan penjagaan kemaluan yang mereka lakukan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "30. قُل لِّلْمُؤْمِنِينَ يَغُضُّوا۟ مِنْ أَبْصٰرِهِمْ (Katakanlah kepada orang laki-laki yang beriman: “Hendaklah mereka menahan pandanganya) Setelah Allah menyebutkan hukum dalam meminta izin Dia kemudian melanjutkannya dengan menyebutkan hukum pandangan mata secara umum untuk menghindarkan hamba-Nya dari sebab-sebab yang dapat mengantarkan pada perbuatan zina. Makna (غض البصر) adalah menundukkan sebagian pandangannya agar tidak melihat hal yang dilarang. Dan yang dimaksud dengan sebagian pandangan adalah bahwa seseorang tidak berdosa dalam pandangan pertama yang tertuju pada hal yang dilarang tanpa disengaja. وَيَحْفَظُوا۟ فُرُوجَهُمْ ۚ( dan memelihara kemaluannya) Dari hal-hal yang diharamkan atas mereka. ذٰلِكَ(yang demikian itu) Yakni menundukkan pandangan dan menjaga kemaluan. أَزْكَىٰ لَهُمْ ۗ( adalah lebih suci bagi mereka) Yakni lebih suci dari kotornya keburukan dan lebih bersih dari perbuatan rendahan itu. إِنَّ اللهَ خَبِيرٌۢ بِمَا يَصْنَعُون(sesungguhnya Allah Maha Mengetahui apa yang mereka perbuat) Ini merupakan ancaman bagi orang yang tidak menundukkan pandangan dan tidak menjaga kemaluannya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Maka berhati-hatilah orang yang berakal ketika melemparkan pandangannya, karena mata ini bisa saja melihat apa-apa yang tidak dtakdirkan baginya dan bukan haknya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "30. Wahai Nabi, Katakanlah kepada orang-orang mukmin: “Tahanlah pandangan kalian dari sesuatu yang tidak dihalalkan untuk dipandang (Menahan pandangan adalah menundukkan sebagian pandangan yaitu menahan pandangan untuk menutup keinginan berzina) dan jagalah farji kalian dari sesuatu yang tidak halal bagi kalian. Menahan pandangan dan menjaga farji itu lebih baik baik bagi diri kalian daripada terlibat dalam sesuatu yang haram. Sesungguhnya Allah Maha Memberi Kabar tentang apa yang kalian perbuat berupa menahan pandangan dan menjaga farji.” Ini adalah peringatan bagi orang yang melanggar hal tersebut. Ayat ini diturunkan untuk seorang laki-laki yang berjalan di salah satu jalan Madinah, lalu dia saling bertukar pandang dengan wanita dan melanjutkan hal itu sampai dia menabrak tembok sehingga merusak hidungnya. Lalu dia mengabarkan hal ini kepada Nabi SAW tentang hal itu. Kemudian Nabi bersabda kepadanya: “Ini adalah akibat dari dosamu” Lalu Allah menurunkan ayat ini."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah kepada orang-orang yang beriman hendaklah mereka menjaga pandangan mereka} menahan pandangan mereka dari sesuatu yang dilarang untuk dipandang {dan memelihara kemaluan mereka. Demikian itu lebih suci} lebih suci {bagi mereka. Sesungguhnya Allah Maha teliti terhadap apa yang mereka perbuat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "30 maksudnya, berilah pengarahan dan katakan kepada kaum Mukminin, yang masih mempunyai keimanan yang dapat mencegah mereka terjerumus dalam perbuatan yang menodai keimanan mereka, “hendaklah mereka menahan pandangannya,” dari melihat aurat-aurat (hal-hal yang tak pantas dilihat) dan wanita-wanita asing (yang bukan mahram) dan anak-anak kecil yang rupawan, yang ditakutkan terjadi fitnah bila melihatnya, atau (menahan) dari melihat perhiasan dunia yang dapat memperdayai dan menjerumuskan pada perkara yang diharamkan “dan memelihara kemaluannya,” dari perbuatan jimak yang haram, baik lewat jalan depan (qubul) ataupun jalan belakang (dubur) atau selainnya, dan usaha untuk memegang dan melihat kepadanya (kemaluan). “yang demikian itu,” yaitu menjaga pandangan dan kemaluan “adalah lebih suci bagi mereka,” lebih suci, lebih baik serta lebih meningkatkan amal-amal mereka. Karena sesungguhnya orang yang menjaga kemaluan dan pandangannya, akan tersucikan dari kejelekan yang mengotori para pelaku kemaksiatan, amalan-amalan mereka menjadi bersih lantaran telah meninggalkan sesuatu yang haram, yang disukai oleh hawa nafsu secara bawaan dan mengajak kesana. Barangsiapa yang meninggalkan suatu kejelekan karena Allah, niscaya Allah akan memberikan ganti baginya dengan sesuatu yang lebih baik darinya. Barangsiapa yang menjaga pandangannya dari perkara haram, maka Allah akan menyinari mata hatinya. Dan lantaran seorang hamba jika dia berhasil menjaga kemaluan dan pandangannya dari perkara haram dan pencetus rangsangan syahwat, maka penjagaan terhadap perkara lainnya, akan lebih maksimal. Karenanya, Allah menyebutnya dengan istilah hifzh (penjagaan). Sesuatu yang terjaga, jika pemiliknya tidak serius dalam mengawasinya dan menjaganya, dan menempuh usaha-usaha yang akan membantu pemeliharaannya, maka tidak akan dapat terpelihara. Begitu pula pandangan dan kemaluannya, bila tidak ada usaha dari seorang hamba untuk menjaga keduanya, maka akan menjatuhkan dirinya kepada malapetaka dan musibah. Perhatikanlah, bagaimana Allah memerintahkan penjagaan kemaluan secara mutlak, karena ia tidak boleh (ditelantarkan) dalam keadaan apapun. Sementara itu, berkaitan dengan pandangan, Allah berfirman, ”hendaklah mereka menahan sebagian pandangannya,” Allah menggunakan kata yang menunjukan arti sebagian, karena dalam keadaan tertentu diperbolehkan untuk melihat (sesuatu yang diharamkan) untuk suatu kebutuhan, seperti melihatnya ketika menjadi saksi, orang yang mengoperasi, peminang dan lain sebagainya. Kemudian Allah mengingatkan mereka tentang ilmuNya terhadap amal-amal mereka, supaya mereka berusaha secara maksimal dalam menjaga diri mereka dari hal-hal yang diharamkan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nur ayat 30: Yakni bimbinglah orang-orang yang beriman, dan katakanlah kepada mereka yang memiliki iman agar iman mereka terpelihara dan sempurna. Dari melihat yang haram dilihat, seperti memandang wanita-wanita asing, memandang sesuatu yang dikhawatirkan timbul fitnah dan memandang perhiasan dunia yang dapat menggoda hatinya. Dari yang haram, seperti zina. Yani menjaga pandangan dan kemaluannya. Syaikh As Sa’diy berkata, “(Yakni) lebih suci, lebih baik dan lebih mengembangkan amal mereka, karena barang siapa yang menjaga kemaluan dan pandangannya, maka ia akan bersih dari kotoran yang menodai para pelaku perbuatan keji, dan amalnya pun akan bersih disebabkan meninggalkan hal yang haram yang diiinginkan hawa nafsu dan didorong olehnya. Barang siapa yang meninggalkan sesuatu karena Allah, maka Allah akan menggantinya dengan yang lebih baik darinya. Oleh karena itu, barang siapa yang menundukkan pandangannya dari yang haram, maka Allah akan menyinari bashirahnya (mata hatinya), dan lagi karena seorang hamba apabila menjaga kemaluan dan pandangannya dari yang haram serta pengantarnya meskipun ada dorongan syahwat kepadanya, maka tentu ia dapat menjaga yang lain. Oleh karena itulah Allah sebut sebagai penjagaan. Sesuatu yang dijaga jika penjaganya tidak berusaha mengawasi dan memeliharanya dan tidak melakukan sebab yang dapat membuatnya terjaga, maka sesuatu itu tidak akan terjaga. Demikian pula pandangan dan kemaluan, jika seorang hamba tidak berusaha menjaga keduanya, maka keduanya dapat menjatuhkannya ke dalam cobaan dan ujian. Perhatikanlah bagaimana Allah memerintahkan menjaga kemaluan secara mutlak, karena ia tidak diperbolehkan dalam salah satu di antara sekian keadaan, adapun pandangan, Dia berfirman, “Yaghuddhuu min abshaarihim (Agar mereka menundukkan pandangan).” Menggunakan huruf “min” yang menunjukkan sebagian, karena dibolehkan memandang dalam sebagian keadaan karena dibutuhkan, seperti melihatnya saksi, melihatnya pelaku, melihatnya seorang pelamar, dsb. Selanjutnya, Allah Subhaanahu wa Ta'aala mengingatkan kepada mereka pengetahuan-Nya terhadap amal mereka agar mereka berusaha menjaga diri mereka dari hal-hal yang diharamkan.” Oleh karena itu, Dia akan memberikan balasan terhadapnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nur Ayat 30",
    "description": "Usai menjelaskan etika berkunjung pada ayat sebelumnya, pada ayat ini Allah menguraikan etika berinteraksi antarsesama, baik saat di dalam rumah maupun di luar rumah. Wahai nabi Muhammad, katakanlah kepada laki-laki yang beriman dengan mantap agar mereka menjaga pandangannya dari melihat sesuatu yang tidak halal dilihat, dan perintahlah mereka memelihara kemaluannya dari apa yang tidak halal untuknya. Yang demikian itu lebih suci bagi jiwa mereka agar tidak terjatuh pada perbuatan haram. Sungguh, Allah maha mengetahui apa yang mereka perbuat. 31. Dan katakanlah pula, wahai nabi Muhammad, kepada para perempuan yang beriman dengan mantap, agar mereka menjaga pandangannya dan memelihara kemaluannya dari yang haram, dan janganlah mereka menampakkan perhiasannya kecuali yang biasa terlihat darinya menurut kebiasaan dan sulit untuk mereka sembunyikan, seperti baju luar, wajah, dan telapak tangan. Dan hendaklah mereka menutupkan jilbab atau kain kerudung ke kepala, leher, dan dadanya, dan janganlah menampakkan perhiasannya atau auratnya kecuali kepada suami mereka, atau ayah mereka, atau ayah suami mereka, atau putra-putra mereka, atau putra-putra suami me-reka, termasuk cucu, cicit, dan seterusnya, atau saudara-saudara laki-laki mereka, atau putra-putra saudara laki-laki mereka, atau putra-putra saudara perempuan mereka, atau para perempuan mereka sesama muslim, atau hamba sahaya yang mereka miliki, atau para pelayan laki-laki tua yang tidak lagi mempunyai keinginan dan syahwat kepada perempuan, atau anak-anak yang belum mengerti tentang aurat perempuan. Dan janganlah mereka menghentakkan kakinya agar diketahui perhiasan yang mereka sembunyikan. Dan bertobatlah kamu semua kepada Allah, wahai orang-orang yang beriman dari segala dosa, khususnya pandangan terlarang, agar kamu beruntung dan mendapat kebahagiaan di dunia dan akhirat."
  }
]