[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan katakanlah kepada wanita-wanita Mukminah, agar mereka menundukkan pandangan mereka terhadap aurat-aurat yang tidak boleh mereka lihat, dan agar memelihara kemaluan mereka dari perkara yang Allah haramkan. Dan janganlah mereka memperlihatkan perhiasan mereka dihadapan kaum lelaki. Akan tetapi, sebaliknya, hendaknya mereka berusaha keras untuk menyembunyikannya, kecuali pakaian luar yang biasa mereka kenakan, bila dalam pakaian itu tidak ada unsur yang membangkitkan fitnah, dan hendaknya mereka menurunkan tutup-tutup kepala mereka pada celah-celah terbuka di bagian atas baju mereka yang ada di bagian dada, dan menutup wajah-wajah mereka, sehingga akan tertutup lebih sempurna. Dan janganlah mereka mempertontonkan perhiasan mereka yang tersembunyi, kecuali pada suami-suami mereka, sebab suami-suami boleh melihat dari tubuh mereka hal-hal yang tidak boleh dilihat orang lain. Sementara sebagian bagian tubuh, seperti wajah, leher, dua tangan dan lengan, boleh dilihat oleh ayah-ayah mereka, ayah-ayah suami mereka, anak-anak mereka, anak-anak suami-suami mereka, saudara-saudara lelaki mereka, anak-anak saudara-saudara lelaki mereka, anak-anak saudara-saudara perempuan mereka, atau perempuan-perempuan yang beragama islam, bukan yang kafir, atau hamba-hamba sahaya yang mereka miliki, atau para pelayan laki-laki yang sudah tidak memiliki hasrat dan kebutuhan terhadap wanita, seperti orang-orang dungu yang sekedar mengikuti orang lain untuk makan dan minum semata, atau anak-anak laki-laki yang masih kecil yang belum mengerti tentang aurat-aurat wanita, dan belum ada pada mereka nafsu syahwat.dan janganlah mereka menghentak-hentakkan kaki mereka saat berjalan, supaya memperdengarkan suara perhiasan yang tersembunyi seperti gelang kaki dan lainnya. Dan kembalilah kalian (wahai kaum Mukminin) kepada ketaatan kepada Allah dalam perkara yang Dia memerintahkan kalian untuk itu, berupa sifat-sifat indah dan akhlak-akhlak terpuji ini, dan tinggalkanlah segala yang menjadi kebiasaan kaum jahiliyah, berupa perilaku-perilaku dan sifat-sifat rendah, dengan harapan kalian dapat beruntung memperoleh kebaikan dunia dan akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "31. Dan katakanlah kepada wanita-wanita yang beriman agar mereka menahan pandangannya dari melihat hal-hal yang tidak halal bagi mereka berupa aurat, dan agar mereka menjaga kemaluan mereka dengan menjauhi perbuatan keji dan dengan menutup aurat mereka, dan janganlah mereka menampakkan perhiasannya kepada laki-laki asing (yang bukan mahramnya) kecuali yang biasa nampak darinya yang tidak mungkin untuk disembunyikan seperti pakaian. Dan hendaklah mereka menutupkan kain kerudung ke dada mereka agar menutup rambut, kepala, wajah dan leher mereka. Dan janganlah menampakkan perhiasan mereka yang tersembunyi kecuali kepada suami, ayah mereka, ayah suami, putra-putra mereka, putra-putra suami mereka, saudara-saudara laki-laki mereka, putra-putra saudara lelaki mereka, putra-putra saudari mereka, wanita-wanita yang amanah dan terpercaya –baik muslimah atau kafir-, budak-budak yang mereka miliki –baik laki-laki atau wanita-, pelayan laki-laki yang tidak mempunyai keinginan syahwat terhadap wanita, atau anak-anak yang belum mengerti tentang aurat wanita lantaran masih kecil. Dan janganlah kaum wanita menghentakkan kakinya dengan tujuan agar diketahui perhiasan yang mereka sembunyikan seperti gelang kaki dan semisalnya. Dan bertobatlah kamu sekalian kepada Allah, hai orang-orang yang beriman dari pandangan kalian terhadap yang tidak halal dan maksiat lainnya, supaya kalian beruntung dengan meraih apa yang kalian citakan, dan selamat dari apa yang kalian takuti."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "31. Dan katakanlah juga kepada para wanita yang beriman agar mereka menundukkan pandangan dari apa yang tidak boleh dilihat dan menjaga kemaluan mereka dari apa yang Allah haramkan, dan janganlah mereka menampakkan keindahan mereka kepada para lelaki melainkan yang boleh ditampakkan yaitu pakaian yang nampak. Dan hendaklah mereka menggunakan penutup kepala mereka untuk sekaligus menutupi muka dan lubang pakaian pada bagian leher mereka. Dan janganlah mereka menampakkan perhiasan dan keindahan mereka yang tersembunyi melainkan bagi para suami mereka. Adapun perhiasan yang nampak seperti celak, kalung, anting, dan gelang, selama pada batas wajah dan dua telapak tangan maka boleh ditampakkan di rumah bagi ayah, ayah suami (mertua), anak kandung -termasuk di dalamnya cucu dari jalur anak laki-laki atau perempuan, cicit, dan seterusnya- anak suami, saudara laki-laki, anak saudara laki-laki (keponakan), anak saudara perempuan, wanita muslimah yang melayani mereka, budak laki-laki yang mereka miliki, atau pelayan laki-laki yang tidak memiliki syahwat terhadap aurat wanita. Adapun gelang kaki tidak boleh mereka tampakkan, dan mereka dilarang menghentakkan kaki mereka ketika berjalan yang bertujuan agar membunyikan suara gelang kaki yang tertutup di balik pakaian. Wahai orang-orang beriman, dan bertaubatlah kalian semua dari menyelisihi hukum-hukum yang agung ini agar kalian dapat meraih kebahagiaan dunia dan akhirat. Imam at-Thabari meriwayatkan dengan sanad hasan dari Ali bin Abi Thalhah, dari Ibnu Abbas: Dalam firman Allah: وَلَا يُبْدِينَ زِينَتَهُنَّ إِلَّا مَا ظَهَرَ مِنْهَا Dan janganlah mereka menampakkan perhiasannya, kecuali yang (biasa) nampak dari padanya. Yang dimaksud dengan perhiasan yang biasa nampak darinya adalah wajah, celak mata, heina tangan, dan cincin; perhiasan-perhiasan ini boleh nampak ketika di rumah oleh orang yang bertamu kepadanya. Demikianlah pernyataan Ibnu Abbas, akan tetapi banyak ulama yang menyebutkan perkataan Ibnu Abbas ini secara utuh, sehingga pernyataan Ibnu Abbas tentang maksud dari potongan ayat ini adalah wajah dan dua telapak tangan bukan secara mutlak, namun terikat bahwa wanita itu boleh menampakkan wajah dan dua telapak tangannya saat berada di rumahnya bagi orang yang bertamu kepadanya. Dan hal ini dikuatkan dengan penafsirannya tentang firman Allah: يَٰٓأَيُّهَا ٱلنَّبِىُّ قُل لِّأَزْوَٰجِكَ وَبَنَاتِكَ وَنِسَآءِ ٱلْمُؤْمِنِينَ يُدْنِينَ عَلَيْهِنَّ مِن جَلَٰبِيبِهِنَّ ۚ ذَٰلِكَ أَدْنَىٰٓ أَن يُعْرَفْنَ فَلَا يُؤْذَيْنَ ۗ وَكَانَ ٱللَّهُ غَفُورًا رَّحِيمًا Hai Nabi, katakanlah kepada isteri-isterimu, anak-anak perempuanmu dan isteri-isteri orang mukmin: \"Hendaklah mereka mengulurkan jilbabnya ke seluruh tubuh mereka\". Yang demikian itu supaya mereka lebih mudah untuk dikenal, karena itu mereka tidak di ganggu. Dan Allah adalah Maha Pengampun lagi Maha Penyayang. (al-Ahzab: 59). (at-Tafsir as-Shahih 4/334). Aisyah berkata, ketika turun ayat ketika turun ayat: وَلْيَضْرِبْنَ بِخُمُرِهِنَّ عَلَىٰ جُيُوبِهِنَّ Dan hendaklah mereka menutupkan kain kudung kedadanya Maka para wanita Muslimah ketika itu mengambil kain sarung mereka dan memotong bagian bawahnya untuk digunakan sebagai kain kudung. (Shahih al-Bukhari 8/347 no. 4759, kitab tafsir surat an-Nur, bab ayat ini)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "31. وَقُل لِّلْمُؤْمِنٰتِ يَغْضُضْنَ مِنْ أَبْصٰرِهِنَّ (Katakanlah kepada wanita yang beriman: “Hendaklah mereka menahan pandangannya) Ayat ini sebagai dalil diharamkannya para wanita melihat sesuatu yang dilarang baginya, dan wajib bagi mereka untuk menjaga kemaluan mereka sebagaimana yang telah disebutkan dalam perintah menjaga kemaluan bagi para lelaki. وَلَا يُبْدِينَ زِينَتَهُنَّ إِلَّا مَا ظَهَرَ مِنْهَا ۖ (dan janganlah mereka menampakkan perhiasannya, kecuali yang (biasa) nampak dari padanya) Yang biasa nampak pada mereka adalah pakaian, wajah, dan telapak tangan mereka. Ibnu ‘Abbas dan Qatadah berkata: perhiasan mereka yang biasa nampak adalah celak, gelang, henna, cincin, dan lain sebagainya; hal-hal ini dibolehkan bagi wanita untuk memperlihatkannya. Dan menurut Ibnu Umar dan pendapat lain dari Ibnu Abbas yang dimaksud adalah wajah dan kedua telapak tangan. وَلْيَضْرِبْنَ بِخُمُرِهِنَّ عَلَىٰ جُيُوبِهِنَّ ۖ( Dan hendaklah mereka menutupkan kain kudung kedadanya) Makna (الخمر) adalah kain yang dipakai wanita untuk menutupi kepalanya. Sedangkan (الجيب) adalah lubang dari gamis yang dipakai untuk tempat masuknya kepala. وَلَا يُبْدِينَ زِينَتَهُنَّ(janganlah menampakkan perhiasannya) Yakni perhiasan mereka yang tersembunyi seperti rambut atau dada bagian atas. إِلَّا لِبُعُولَتِهِنَّ(kecuali kepada suami mereka) Yakni suami-suami mereka. أو أبنائهن (atau anak-anak mereka) Termasuk dari mereka adalah para cucu mereka dan para keturunan mereka, begitu pula bapak dan kakek suami atau kakek dari jalur bapak atau ibu dan para pendahulu mereka; dan para anak suami mereka dan para keturunan mereka, serta anak-anak dari saudara laki-laki dan perempuan; begitu pula paman dari jalur bapak atau ibu juga seperti mahram yang lainnya dalam hal dibolehkannya melihat pada apa yang boleh dilihat oleh para mahram. Dan hukum bagi orang dengan hubungan persusuan sama hukumnya dengan orang yang memiliki hubungan nasab. أَوْ نِسَآئِهِنَّ (atau wanita-wanita islam) Mereka adalah wanita-wanita yang dikhususkan untuk dibolehkan dalam bergaul dengan mereka untuk memberi bantuan atau bersahabat. Terdapat pendapat mengatakan para wanita kafir tidak masuk dalam ayat ini baik itu para ahli dzimmah atau yang lainnya. Namun menurut madzhab hambali para wanita kafir dibolehkan melihat wanita Muslimah seperti yang dibolehkan bagi para wanita Muslimah lain. أَوْ مَا مَلَكَتْ أَيْمٰنُهُنَّ(atau budak-budak yang mereka miliki) Masuk didalamnya budak laki-laki dan perempuan baik itu kafir atau muslim. أَوِ التّٰبِعِينَ غَيْرِ أُو۟لِى الْإِرْبَةِ مِنَ الرِّجَالِ(atau pelayan-pelayan laki-laki yang tidak mempunyai keinginan (terhadap wanita)) Mereka adalah orang yang mengikuti tuan rumah, seperti pembantu, buruh, orang yang dikebiri, atau orang yang kurang akal yang tidak memiliki keinginan terhadap wanita. أَوِ الطِّفْلِ الَّذِينَ لَمْ يَظْهَرُوا۟ عَلَىٰ عَوْرٰتِ النِّسَآءِ ۖ( atau anak-anak yang belum mengerti tentang aurat wanita) Seorang manusia dikatakan sebagai anak kecil jika belum mencapai usia remaja dan belum memiliki syahwat untuk berjima’ serta belum mempedulikan aurat-aurat wanita. وَلَا يَضْرِبْنَ بِأَرْجُلِهِنَّ لِيُعْلَمَ مَا يُخْفِينَ مِن زِينَتِهِنَّ ۚ( Dan janganlah mereka memukulkan kakinyua agar diketahui perhiasan yang mereka sembunyikan) Yakni janganlah seorang wanita menghentakkan kakinya ketika berjalan agar suara gelang kakinya dapat terdengar. وَتُوبُوٓا۟ إِلَى اللهِ جَمِيعًا أَيُّهَ الْمُؤْمِنُونَ (Dan bertaubatlah kamu sekalian kepada Allah, hai orang-orang yang beriman) Dalam ayat ini terdapat perintah untuk bertaubat, tidak ada perbedaan pendapat dalam kewajiban bertaubat, dan ini merupakan bagian dari kewajiban-kewajiban agama."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Bukanlah merupakan suatu penyempitan wilayah hidup untuk seorang perempuan yang dijaga ketat oleh syariah dengan membatasi pergaulan mereka, larangan bercampur dengan kaum laki tanpa mahrom. Melainkan hal itu adalah upaya syariat dalam menjaga kemuliaan dan harga diri mereka, dan mewujudkan kebahagiaan yang hakiki bagi mereka; karena dengan menjaga diri dari ikhtilath akan tumbuh kehidupan yang indah dalam hati, dan dengan cara ini pula akan melahirkan hubungan kasih sayang yang erat antara dia dan suaminya serta hubungannya dengan kerabat. 2 ). Dari ayat ini diambil suatu qaidah yang penting dalam syari'at yaitu : { وَلَا يَضْرِبْنَ بِأَرْجُلِهِنَّ لِيُعْلَمَ مَا يُخْفِينَ مِن زِينَتِهِنَّ } \"Dan janganlah mereka memukulkan kakinyua agar diketahui perhiasan yang mereka sembunyikan\" sebagai dalil qaidah saddu dzari'ah, hal yang dibolehkan dapat membawa kepada perkara yang diharamkan jika tujuannya adalah untuk memamerkan sesuatu yang dimiliki dari perhiasan. 3 ). Tadabbur dari ayat : { وَلَا يَضْرِبْنَ بِأَرْجُلِهِنَّ لِيُعْلَمَ مَا يُخْفِينَ مِن زِينَتِهِنَّ } secara makna kaki dalam ayat ini telah tertutupi, sehingga dilarang adanya pergerakan yang menimbulkan nampaknya sesuatu yang telah tertutupi oleh kain. 4 ). Pada penghujung ayat ini Allah berfirman tentang perintah menundukkan pandangan bertaubat dari dosa karenanya, ayat ini bahkan ditujukan kepada orang-orang yang beriman kepada-Nya. Hal ini menunjukkan bahwa dosa dalam penglihatan dan kemaluan. 5 ). Ayat ini dijutukan kepada Ahli iman dan sebaik-baik makhluk ciptaan Allah agar mereka bertaubat setelah menyatakan keimanannya dan kesabaran serta jihad mereka kepada Allah. Kemudian kemenangan juga dikaitkan dengan taubat, sebagai syarat bahwa kemanangan hanya dapat diperoleh dengan senantiasa bertaubat kepada Allah ta'ala."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "31. Wahai Nabi, Katakanlah juga kepada orang-orang mukmin perempuan: “Tahanlah pandangan kalian dan jagalah farji kalian dari sesuatu yang haram. (Dua ayat itu menunjukkan pengharaman suatu pandangan). Sebaiknya mereka tidak menampakkan tempat-tempat yang penuh hiasan berupa perhiasan kecil dan sebagainya seperti pakaian (yang penuh hiasan), pewarna-pewarna penghias kecuali sesuatu yang sewajarnya dilihat, yaitu pakaian yang hanya menampakkan wajah dan dua telapak tangan, dan sesuatu yang sukar disembunyikan serta sudah sewajarnya ditampakkan seperti cincin, celak dan cat (kuku). Sedangkan gelang tangan, gelang kaki, kalung, dan mahkota/bando (sesuatu yang diletakkan di atas rambut kepala), maka itu tidak boleh ditampakkan. Sebaiknya mereka juga menutupi kepala, leher, dan sesuatu di atas dada dan bagian Jaib (celah di bagian atas baju yang menunjukkan sebagian dada) dengan himar (sesuatu yang digunakan wanita untuk menutupi kepalanya). Hal ini menunjukkan kewajiban menutup kepala dan dada. Dan sebaiknya mereka tidak menampakkan perhiasan-perhiasan tersembunyi mereka seperti bagian rambut atau yang di atas dada, kecuali untuk suami-suami mereka, bapak-bapak mereka, bapak-bapak suami mereka, anak-anak mereka (termasuk cucu-cucu mereka sekalipun mereka baru lahir), bapak-bapak suami dan bapak dari bapak, atau bapak dari ibu sekalipun mereka sudah tua, begitu juga anak-anak suami jika mereka sudah lahir, anak-anak saudara laki-laki dan saudara perempuan, paman dan bibi yang masih mahram, pengasuh yang sudah menjadi keluarga, atau wanita muslim yang melayani dan menemani (wanita kafir itu termasuk orang asing menurut para ulama, sedangkan mazhab Hanbali memperbolehkan wanita kafir melihat wanita muslim kecuali yang ada di antara pusar dan lutut) atau pelayan wanita atau laki-laki yang tidak menginginkan mereka seperti orang yang sudah tua renta, orang yang dikebiri, orang yang bersifat kewanita-wanitaan, dan orang yang agak gila, atau anak kecil yang belum remaja dan belum bisa membedakan antara aurat wanita dan yang lainnya karena masih kecil.” Ath-Thiflu digunakan untuk menunjukkan satu atau sejumlah anak. Para wanita juga sebaiknya tidak menghentakkan kakinya saat berjalan sehingga suara gelang kaki mereka terdengar. Dan seharusnya kalian bertaubat atas pandangan terlarang yang telah kalian lakukan wahai orang-orang mukmin, supaya kalian bisa mendapatkan kebahagiaan dunia akhirat. Ayat ini diturunkan untuk Asma’ binti Martsad yang menganggap buruk wanita-wanita yang mendatanginya tanpa memakai penutup, menampakkan bagian dada dan sanggul-sanggul mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah kepada para perempuan yang beriman, hendaklah mereka menjaga pandangan mereka} menahan pandangan mereka kepada sesuatu yang tidak diperbolehkan untuk mereka {memelihara kemaluan mereka, dan tidak menampakkan perhiasan mereka} dan tidak menampakkan sesuatupun berupa hiasan bagi orang asing {kecuali yang terlihat} kecuali sesuatu berupa perhiasan yang tampak yang tidak mungkin untuk disembunyikan, seperti menampakkan pakaian {Hendaklah mereka memakai} mengenakan {kain penutup} kain penutup di kepala mereka {ke dada mereka} ke bagian terbuka pakaian mereka di dada mereka {Hendaklah tidak menampakkan perhiasan mereka} dan tidak menampakkan perhiasan yang tersembunyi {kecuali kepada suami mereka} suami mereka {atau ayah mereka, ayah suami mereka, putra-putra mereka, putra-putra suami mereka, saudara-saudara laki-laki mereka, putra-putra saudara laki-laki mereka, putra-putra saudara perempuan mereka, para perempuan, hamba sahaya yang mereka miliki, atau para pelayan laki-laki yang tidak mempunyai keinginan} orang-orang yang tidak menginginkan wanita {atau anak-anak yang belum mengerti tentang aurat perempuan} belum mengetahui aurat perempuan dan tidak mengetahui keadaan mereka karena masih kecil {Hendaklah mereka tidak menghentakkan kakinya agar diketahui perhiasan yang mereka sembunyikan} perhiasan yang mereka sembunyikan seperti gelang kaki yang dipakai di kaki {Bertaubatlah kalian semua kepada Allah, wahai orang-orang yang beriman, agar kalian beruntung"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "31 setelah memerintahkan kaum Mukminin untuk menundukkan pandangan dan menjaga kemaluan mereka, Allah pun memerintahkan pada para wanita Mukminah dengannya. Allah berfirman, “katakanlah kepada wanita yang beriman,’ hendaklah mereka menahan pandangannya,’” dari melihat aurat-aurat dan lelaki dengan penuh syahwat dan pandangan lain yang terlarang. “dan menjaga kemaluannya,” dari (kesempatan) untuk dapat menyetubuhinya, menyentuh dan melihat yang diharamkan kepadanya. “dan janganlah mereka menampakkan perhiasannya,” seperti pakaian yang indah, perhiasan-perhiasan dan seluruh tubuhnya termasuk dalam pengertian perhiasan (zinah). Manakala baju luar harus mereka kenakan, maka Allah berfirman, ”kecuali yang biasa (Nampak) darinya,” baju luar yang biasa dipakai, selama tidak memicu munculnya fitnah. “dan hendaklah mereka menutupkan kain kudung ke dadanya,” demikian ini agar lebih sempurna dalam menutupi. Ini menunjukkan bahwa perhiasan yang haram untuk ditampakkan adalah mencakup seluruh tubuh wanita sebagaimana yang telah kami katakan sebelumnya. Kemudian Allah mengulang kembali larangan menampakkan perhiasan, guna mengecualikan sebagiannya. firman Allah, “keculai pada suami mereka,” terhadap para suami mereka “atau ayah, mereka atau ayah suami mereka,” yang mencakup bapa itu sendiri, kakek dan seterusnya “atau putra-putra mereka, atau putra-putra suami mereka,” termasuk anak laki-lakinya atau anak-anak suaminya dan seterusnya dari keturunan mereka “ atau saudara-saudara laki-laki mereka, atau putra-putra saudara lelaki mereka,” saudara kandung, atau saudara seayah atau seibu, “atau putra-putra saudari perempun mereka, atau wanita-wanita mereka,” maksudnya boleh bagi para wanita untuk melihat kepada wanita yang lain seacara mutlak. Dimungkinkan juga idhafah (penyandaran) ‘wanita mereka’ menunjukkan pengertian jenis wanita tertentu, yaitu wanita muslimah yang berasal dari jenis kalian. Di dalamnya, terdapat dalil bagi ulama yang bedrpendapat; Sesungguhnya(aurat) seorang musliman tidak boleh dilihat oleh wanita dzimmiyyah (non muslim) “atau budak-budak yang mereka miliki,” sehingga dibolehkan bagi budak lelaki (bila seluruh jiwanya milik seorang wanita), untuk melihat pada tuan wanitanya selama wanita tersebut memilikinya secara keseluruhan. Namun, bila kepemilikannya hilang atau sebagiannya saja, maka dia tidak di perbolehkan untuk melihatnya. “atau pelayan-pelayan lelaki yang tidak mempunyai keinginan (terhadap wanita),” maksudnya [atau] orang-orang yang mengikuti kalian, bergantung pada kalian, baik dari kaum lelaki yang tidak mempunyai gejolak nafsu terhadap syahwat ini, semisal orang gila yang tidak sadar dengan apa yang terjadi, atau lelaki yang impoten yang sudah tidak mempunyai birahi lagi, baik pada kemaluan ataupun hatinya, semua jenis lelaki ini tidak dilarang untuk dilihat. “atau anak-anak yang belum mengerti tentang aurat wanita,” maksudnya, anak-anak, yang belum memasuki usia tamyiz (kurang dari tujuh tahunan), mereka boleh melihat para wanita. Allah mengemukakan illatnya bahwa mereka “belum mengerti tentang aurat wanita” maksudnya belum mengerti aurat wanita,dan belum muncul nafsu syahwat pada mereka. Jadi, ini menunjukkan bahwa seorang wanita harus menutup auratnya dari pandangan seorang anak yang sudah memasuki usia tamyiz, karena ia telah memahami aurat wanita. “dan janganlah mereka memukulkan kakinya agar diketahui perhiasan yang mereka sembunyikan,” maksudnya janganlah menghentakkan kaki mereka ketanah agar perhiasan-perhiasan yang ada di kaki mereka bersuara semisal gelang kaki dan sejenisnya, hingga diketahui perhiasannya disebabkannya sehingga menjadi media menuju fitnah. Dapat dipetik dari ayat ini, dan ayat lain yang serupa, kaidah sad al-wasa’il (keharusan menutup akses kepada kejelekan). Sesungguhnya sebuah perkara yang mubah, akan tetapi dapat menghantarkan kepada perbuatan haram atau ditakutkan akan terjadi perbuatan yang dilarang, maka perkara tersebut terlarang. Menghentakkan kaki ketanah, pada asalnya boleh, namun lantaran ia menjadi jalan tersibaknya perhiasan, maka ia dilarang. Usai memerintahkan sekumpulan perintah yang baik dan mewasiatkan wasiat-wasiat yang indah, sudah tentu akan terjadi kelalian dalam pelaksanaannya dari seorang MUkmin dalam masalah itu, maka Allah memerintahkan mereka untuk bertaubat. Allah berfirman, “dan bertaubatlah kamu sekalian kepada Allah, hai orang-orang beriman,” [karena seorang mukmin, keimanannya mengajak kepada taubat]. Kemudian Allah mengaitkan kebahagiaan dengannya. Allah berfirman, “supaya kamu beruntung,” sehingga tidak ada jalan menuju keberuntungan kecuali dengan bertaaubat, yaitu kembali dari hal-hal yang dibenci oleh Allah, baik lahir atau yang batin menuju perkara-perkara yang Dia cintai, baik secara lahir maupun batin. Keterangan ini menandakan bahwa setiap Mukmin membutuhkan taubat, lantaran Allah telah mengarahkan pembicaraan pada seluruh kaum Mukiminin. Dalam ayat ini (juga) termuat anjuran untuk berbuat ikhlas dalam bertaubat pada FirmanNya, “maka bertaubatlah kamu sekalian kepada Allah,” maksudnya bukan untuk tujuan selian wajahNya, berupa keselamatan dari gangguan-gangguan keduniaan, riya, sum’ah, atau orientasi-orientasi rusak lain."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nur ayat 31: Setelah Allah memerintahkan kaum mukmin menjaga pandangan dan kemaluan, maka Dia memerintahkan kaum mukminat menjaga pula pandangan dan kemaluannya. Dari yang haram dilihat, seperti memandang laki-laki dengan syahwat. Dari yang haram. Menurut Syaikh As Sa’diy, seperti pakaian yang indah, perhiasan dan semua badan. Ulama memiliki beberapa penafsiran tentang ayat “kecuali yang (biasa) terlihat”, sbb: - Ada yang menafsirkan “kecuali perhiasan yang tampak tanpa disengaja” - Ada juga yang menafsirkan bahwa perhiasan yang tampak itu adalah pakaian. - Ada juga yang menafsirkan perhiasan yang biasa tampak itu adalah celak, cincin, pacar di jari tangan dsb., yakni yang tidak mungkin ditutupi. - Ada pula yang menafsirkan dengan, muka dan telapak tangannya jika tidak dikhawatirkan fitnah menurut salah satu di antara dua pendapat ulama, sedangkan menurut pendapat yang lain, bahwa muka haram dibuka karena ia tempat fitnah. Sehingga menutupi kepala, leher dan dada. Yang tersembunyi, yaitu selain muka dan telapak tangan. Dan seterusnya ke atas. Dan seterusnya ke bawah. Sekandung, sebapak atau seibu. Ini semua adalah mahram wanita, boleh bagi wanita menampakkan perhiasannya, akan tetapi tanpa bertabarruj. (Mahram bagi wanita adalah laki-laki yang boleh memandangnya, berduaan dan bepergian bersamanya). Tidak disebutkan paman dari pihak bapak (‘amm) juga dari pihak ibu (khaal) karena bila wanita terbuka di hadapan mereka dikhawatirkan mereka mensifatinya kepada anak-anaknya. Namun jumhur ulama berpendapat bahwa paman (baik dari pihak ayah maupun ibu) termasuk mahram seperti mahram lainnya meskipun tidak disebutkan pada ayat di atas. Termasuk juga mahram dari sepersusuan. Al Qurthubiy berkata, “Tingkatan para mahram berbeda-beda satu sama lain ditinjau dari segi pribadi secara manusiawi. Tidak diragukan lagi, keterbukaan seorang wanita di hadapan bapak dan saudara laki-lakinya lebih terjamin atau terpelihara daripada keterbukaannya di hadapan anak suami (anak tiri). Karena itu batas aurat yang boleh terbuka di hadapan masing-masing mahram berbeda-beda pula.”Ada yang berpendapat bahwa mahram boleh melihat anggota-anggota tubuh wanita yang biasa tampak seperti anggota tubuh yang dibasuh ketika berwudhu’.Madzhab Maliki berpendapat bahwa aurat wanita di hadapan laki-laki mahram adalah sekujur tubuhnya kecuali muka dan ujung-ujung anggota tubuh seperti kepala, kuduk, dua tangan dan dua kaki. Adapun madzhab Hanbali, mereka berpendapat bahwa aurat wanita di hadapan laki-laki mahram adalah sekujur tubuhnya kecuali muka, kuduk, kepala, dua tangan, kaki dan betis. Namun perlu diingat bahwa kebolehan melihat bagi mahram adalah bukan untuk bersenang-senang dan memuaskan nafsu. Sedangkan kepada suami maka tidak ada batasan aurat sama sekali, baik suami maupun isteri boleh melihat seluruh tubuh pasangannya. ulama tidak berbeda pendapat tentang aurat wanita di hadapan sesama wanita, yakni tidak haram bagi wanita muslimah tubuhnya terbuka di hadapan sesamanya kecuali bagian antara pusat dan lutut. Wanita di ayat tersebut adalah wanita muslimah, adapun wanita kafir tidak termasuk, karena mereka tidak memiliki aturan haramnya mensifati wanita kepada laki-laki mereka. Sedangkan wanita muslimah mengetahui bahwa mensifati wanita muslimah lain ke laki-laki adalah haram. Oleh karena itu, budak apabila seluruh dirinya adalah milik seorang wanita, maka ia boleh melihat tuan putrinya itu selama tuan putrinya memiliki dirinya semua, jika kepemilikan hilang atau hanya sebagian saja, maka tidak boleh dilihat, demikian menurut Syaikh As Sa’diy. Di mana ia tidak berhasrat kepada wanita baik di hatinya maupun di farjinya, disebabkan cacat akal atau fisik seperti karena tua, banci maupun impotensi (lemah syahwat) Adapun jika anak-anak itu sudah mendekati baligh, di mana ia sudah bisa membedakan antara wanita jelek dengan wanita cantik, maka hendaklah wanita tidak terbuka di hadapannya. Ke tanah atau lantai. Seperti gelang-gelang kaki. Setelah Allah Subhaanahu wa Ta'aala memerintahkan perintah-perintah yang bijaksana ini, dan sudah pasti seorang mukmin memiliki kekurangan sehingga tidak dapat melaksanakannya secara maksimal, maka Allah Subhaanahu wa Ta'aala memerintahkan mereka bertobat. Dari melihat sesuatu yang diharamkan dan dari dosa-dosa lainnya. Oleh karena itu, tidak ada cara lain agar seseorang dapat beruntung kecuali dengan tobat. Ayat ini menunjukkan bahwa setiap mukmin butuh bertobat, karena firman-Nya ini tertuju kepada semua mukmin, demikian pula terdapat anjuran agar ikhlas dalam bertobat, bukan karena riya’, sum’ah dan maksud-maksud duniawi lainnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nur Ayat 31",
    "description": "Dan katakanlah pula, wahai nabi Muhammad, kepada para perempuan yang beriman dengan mantap, agar mereka menjaga pandangannya dan memelihara kemaluannya dari yang haram, dan janganlah mereka menampakkan perhiasannya kecuali yang biasa terlihat darinya menurut kebiasaan dan sulit untuk mereka sembunyikan, seperti baju luar, wajah, dan telapak tangan. Dan hendaklah mereka menutupkan jilbab atau kain kerudung ke kepala, leher, dan dadanya, dan janganlah menampakkan perhiasannya atau auratnya kecuali kepada suami mereka, atau ayah mereka, atau ayah suami mereka, atau putra-putra mereka, atau putra-putra suami me-reka, termasuk cucu, cicit, dan seterusnya, atau saudara-saudara laki-laki mereka, atau putra-putra saudara laki-laki mereka, atau putra-putra saudara perempuan mereka, atau para perempuan mereka sesama muslim, atau hamba sahaya yang mereka miliki, atau para pelayan laki-laki tua yang tidak lagi mempunyai keinginan dan syahwat kepada perempuan, atau anak-anak yang belum mengerti tentang aurat perempuan. Dan janganlah mereka menghentakkan kakinya agar diketahui perhiasan yang mereka sembunyikan. Dan bertobatlah kamu semua kepada Allah, wahai orang-orang yang beriman dari segala dosa, khususnya pandangan terlarang, agar kamu beruntung dan mendapat kebahagiaan di dunia dan akhirat. 32. Setelah uraian tersebut, datanglah perintah untuk menikah sebagai salah satu cara memelihara kesucian nasab. Dan nikahkanlah, yaitu bantulah supaya bisa menikah, orang-orang yang masih membujang di antara kamu agar mereka dapat hidup tenang dan terhindar dari zina serta perbuatan haram lainnya, dan bantulah juga orang-orang yang layak menikah dari hamba-hamba sahayamu yang laki-laki dan perempuan. Jika mereka miskin, Allah akan memberi kemampuan kepada mereka dengan karunia-Nya. Dan Allah mahaluas pemberian-Nya; tidak akan berkurang khazanah-Nya seberapa banyak pun dia memberi hamba-Nya keka-yaan, lagi maha mengetahui."
  }
]