[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang yang tidak mampu menikah, lantaran alasan kefakirannya atau alasan alainnya, maka hendaklah mereka berusaha memelihara kehormatannya dari hal-hal yang diharamkan oleh Allah hingga Allah memberinya kecukupan dari karuniaNya, dan memudahkan bagi mereka urusan pernikahan. Dan orang-orang yang ingin merdeka dari hamba-hamba sahaya lelaki dan perempuan dengan cara mukatabah (menebus diri mereka) dari tuan-tuan pemilik mereka dengan sejumlah harta yang mereka bayarkan pada tuan-tuan mereka tersebut, maka kewajiban tuan-tuan pemilik mereka untuk menerima proses mukatabah dari mereka dengan nominal tersebut, bila mereka mengetahui ada kebaikan pada mereka, seperti kematangan berpikir dan kemampuan mencari penghasilan sendiri serta kemaslahatan agama. Dan kewajiban tuan-tuan pemilik mereka dan orang-orang lain untuk membantu mereka dengan harta untuk tujuan tersebut atau dengan mengurangi jumlah mukatabah darinya. Dan tidak boleh bagi kalian memaksa budak-budak perempuan kalian untuk berbuat zina demi mencari harta. Bagaimana tindakan itu bisa terjadi pada diri kalian, sedang mereka menghendaki untuk menjaga kehormatan mereka, padahal kalian sendiri menolak melakukannya? Di sini terkandung celaan terburuk terhadap tindakan tercela mereka. Dan barangsiapa memaksa mereka untuk berbuat zina, maka sesungguhnya Allah setelah mereka mengalami pemaksaan itu Maha Pengampun bagi mereka lagi Maha Penyayang terhadap mereka, sedang dosa menjadi tanggungan orang yang memaksa mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "33. \"Orang-orang yang tidak mampu menikah karena miskin hendaknya menjaga kesucian dirinya dari perbuatan zina, sehingga Allah memampukan mereka dengan karunia-Nya yang sangat luas. Dan para hamba sahaya yang menginginkan perjanjian merdeka dari tuan-tuan mereka dengan membayar sejumlah uang tertentu, hendaklah tuan-tuan mereka menerima hal tersebut jika diketahui bahwa para hamba sahaya tersebut sanggup untuk melakukan pembayaran dan memiliki kesalehan dari segi agama. Juga hendaknya tuan-tuan mereka memberikan kepada mereka sebahagian dari harta Allah yang dikaruniakan-Nya kepada mereka dengan mengurangi jumlah uang tebusan yang mereka bayar agar merdeka. Dan janganlah kalian paksa hamba-hamba wanita kalian untuk melakukan pelacuran dengan tujuan meraih harta duniawi dengan pelacuran tersebut sebagaimana yang dilakukan oleh Abdullah bin Ubay dengan dua hamba sahaya wanitanya padahal keduanya telah memohon agar disucikan dan dijauhkan dari zina. Dan barangsiapa diantara kalian memaksa mereka untuk melakukan hal tersebut, maka sesungguhnya Allah adalah Maha Pengampun kepada mereka sesudah mereka dipaksa, juga Maha Pengasih terhadap mereka; karena terpaksa melakukannya, dan dosa hanya didapatkan oleh orang yang memaksa mereka.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "33. Setelah Allah menjanjikan orang yang menikahkan budak yang miskin berupa kekayaan, sedangkan salah satu cara menjadi kaya adalah dengan bekerja, maka kemudian Allah memerintahkan para pemilik budak menerima permintaan budaknya untuk memerdekakan diri demi memenuhi tujuan syariat dalam berusaha menyebarkan kemerdekaan dan memperlebar jalan keluar dari perbudakan. Dan orang yang tidak mampu menanggung biaya pernikahan hendaklah berpuasa untuk menjaga kehormatannya dari perbuatan haram. Dan budak-budak yang ingin membebaskan diri dari perbudakan hendaklah membayar kepada tuan mereka secara bertahap, dan wajib bagi kalian menerima permintaan ini selama kalian mengetahui sifat amanah mereka. Dan bantulah mereka dalam membayar cicilan yang harus mereka bayar. Dan janganlah kalian memaksa budak wanita kalian untuk melakukan zina, jika mereka ingin menjaga kehormatan -dan jika budak itu tidak ingin menjaga kehormatannya maka pemiliknya wajib melarangnya berbuat zina-. Pemilik budak dilarang memaksa budak wanitanya melakukan zina agar mendapatkan uang dan memperbanyak budak dari keturunannya. Dan barangsiapa yang memaksa para budak wanita melakukan zina maka Allah Maha Mengampuni dan Maha Mengasihi budak-budak wanita itu, sedangkan dosa perzinaannya akan menjadi tanggungan orang yang memaksan mereka. Ibnu ‘Asyur berkata: Penyebutan pemaksaan di sini harus dipahami sebagaimana kejadian yang menjadi sebab turunnya ayat. (at-Tahrir wa at-Tanwir). Jabir berkata: Abdullah bin Ubay bin Salul berkata kepada seorang budak wanita miliknya, “Pergilah agar mendapat sesuatu bagi kami.” Maka Allah menurunkan ayat: وَلَا تُكْرِهُوا۟ فَتَيَٰتِكُمْ عَلَى ٱلْبِغَآءِ إِنْ أَرَدْنَ تَحَصُّنًا لِّتَبْتَغُوا۟ عَرَضَ ٱلْحَيَوٰةِ ٱلدُّنْيَا ۚ وَمَن يُكْرِههُّنَّ فَإِنَّ ٱللَّهَ مِنۢ بَعْدِ إِكْرَٰهِهِنَّ غَفُورٌ رَّحِيمٌ Dan janganlah kamu paksa budak-budak wanitamu untuk melakukan pelacuran, sedang mereka sendiri mengingini kesucian, karena kamu hendak mencari keuntungan duniawi. Dan barangsiapa yang memaksa mereka, maka sesungguhnya Allah adalah Maha Pengampun lagi Maha Penyayang (kepada budak-budak wanita itu) sesudah mereka dipaksa itu. (Shahih Muslim 4/2320, kitab tafsir, bab firman Allah [وَلَا تُكْرِهُوا۟ فَتَيَٰتِكُمْ عَلَى ٱلْبِغَآءِ])."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "33. وَلْيَسْتَعْفِفِ الَّذِينَ لَا يَجِدُونَ نِكَاحًا (Dan orang-orang yang tidak mampu kawin hendaklah menjaga kesucian (diri)nya) Yakni hendaklah menjaga diri dari perbuatan zina dan hal yang haram orang yang tidak memiliki biaya untuk menikah seperti mahar dan nafkah, atau orang yang belum mendapatkan pasangan yang sesuai. حَتَّىٰ يُغْنِيَهُمُ اللهُ مِن فَضْلِهِۦ ۗ( sehingga Allah memampukan mereka dengan karunia-Nya) Yakni sampai Allah memberi mereka rezeki yang baik yang mencukupinya dan menjadikannya mampu untuk menikah. وَالَّذِينَ يَبْتَغُونَ الْكِتٰبَ مِمَّا مَلَكَتْ أَيْمٰنُكُمْ(Dan budak-budak yang kamu miliki yang memginginkan perjanjian) Makna (الكتاب) adalah kesepakatan antara seseorang dengan budaknya atas suatu harta yang harus dibayar oleh budak itu dengan bertahap, apabila harta itu telah terlunasi maka hamba itu menjadi merdeka. إِنْ عَلِمْتُمْ فِيهِمْ خَيْرًا ۖ (jika kamu mengetahui ada kebaikan pada mereka) Makna (الخير) adalah kemampuan budak itu untuk membayar. وَءَاتُوهُم مِّن مَّالِ اللهِ الَّذِىٓ ءَاتَىٰكُمْ ۚ( dan berikanlah kepada mereka sebahagian dari harta Allah yang dikaruniakan-Nya kepadamu) Yakni dengan mengembalikan sebagian harta yang disepakati untuk dibayarkan, dan hal ini dilakukan jika budak itu telah membayar penuh harta itu. وَلَا تُكْرِهُوا۟ فَتَيٰتِكُمْ عَلَى الْبِغَآءِ(Dan janganlah kamu paksa budak-budak wanitamu untuk melakukan pelacuran) Yakni dimaksud dengan (فتيات) di sini adalah para budak wanita. Dan makna (البغاء) adalah perbuatan zina dengan imbalan harta. إِنْ أَرَدْنَ تَحَصُّنًا(sedang mereka sendiri mengingini kesucian) Pada zaman dahulu orang-orang memaksa mereka untuk menjadi pelacur, padahal mereka ingin menjaga kehormatan. لِّتَبْتَغُوا۟ عَرَضَ الْحَيَوٰةِ الدُّنْيَا ۚ( karena kamu hendak mencari keuntungan duniawi) Yakni apa yang didapat budak wanita dari hasil menjual kehormatannya. Ini merupakan kebiasaan orang-orang pada zaman jahiliyah. وَمَن يُكْرِههُّنَّ فَإِنَّ اللهَ مِنۢ بَعْدِ إِكْرٰهِهِنَّ غَفُورٌ(Dan barangsiapa yang memaksa mereka, maka sesungguhnya Allah adalah Maha Pengampun (kepada mereka) sesudah mereka dipaksa itu) Karena bisa jadi paksaan untuk berbuat zina itu tidak lepas dari suatu kerelaan untuk melakukannya karena dorongan tabiat manusia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "33. Dan sebaiknya orang yang tidak mampu menanggung beban pernikahan seperti mahar dan nafkah itu bersungguh-sungguh untuk menjaga diri dari zina dan perbuatan haram, sampai Allah memberi rejeki mereka dari keutamaanNya dan melapangkan pemberianNya kepada mereka, sehingga mereka mendapatkan sesuatu yang bisa digunakan untuk menikah. Dan hamba-hamba yang mau membuat perjanjian, yaitu tuan dan hambanya sepakat atas harta yang diberikan dengan adil. Jika dia (tuan) menyetujuinya, maka dia (hambanya) bebas. Maka buatlah perjanjian dengan mereka jika kalian mengetahui bahwa kalian mampu melakukannya. Berilah mereka zakat harta kalian untuk membantu pembebasan diri dari perbudakan dan kurangilah sebagian sesuatu (pembayaran harta) yang dijanjikan kepada mereka saat menunaikan perjanjian. Dan janganlah kalian memaksa pelayan wanita untuk berbuat zina dengan memberinya upah, jika mereka ingin memelihara diri dari dosa atau tidak (Ini adalah kondisi untuk menjelaskan yang terjadi di masa Jahiliyyah) supaya kalian menghasilkan dan mendapatkan keuntungan yang haram. Al-‘Aradhu adalah kenikmatan sementara. Dan barangsiapa yang memaksa mereka untuk berzina maka sesungguhnya Allah Maha Pengampun bagi wanita-wanita yang dipaksa itu dan Maha Penyayang bagi mereka dan dosanya itu untuk orang yang memaksanya. Ayat {Walladzina yabtaghuna} diturunkan terkait perkara anak laki-laki Huwaithib bin Abdul Uzza yang dimintai budaknya untuk melakukan perjanjian (untuk dimerdekakan) dengannya, kemudian dia menolaknya. Dan ayat {Wa laa tukrihuu} diturunkan terkait dua budak Abdullah bin Ubay yang dipaksa untuk berbuat zina"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Hendaklah menjaga kesucian} hendaklah mengendalikan diri dari perbuatan haram dan zina {orang-orang yang belum menikah yang belum mampu menikah karena kesulitan baik mahar maupun memberi nafkah, merkipun dia memerlukannya {sampai Allah memberi kemampuan kepada mereka dengan karuniaNya. dan hamba sahaya yang kalian miliki menginginkan perjanjian (menebus diri)} Hamba yang kalian miliki baik laki-laki maupun perempuan menginginkan akad mukatabah (menebus diri), dimana hamba laki-laki berkata kepada tuannya, aku ingin melakukan perjanjian (menebus diri) denganmu menggunakan harta untuk perkara ini, maka putuskanlah hal itu terhadapku dan bebaskanlah aku, lalu tuannya berkata,”Aku menerimanya” atau hal semacam itu {hendaklah kalian membuat perjanjian dengan mereka} maka buatlah perjanjian dengan mereka dengana akad mukatabah {jika kalian mengetahui ada kebaikan} amanah dan kemampuan untuk berusaha {pada mereka. Berilah mereka sebagian harta Allah yang dikaruniakan kepada kalian. Janganlah memaksa hamba sahaya perempuan kalian} hamba sahaya perempuan kalian {untuk melakukan pelacuran} melakukan zina {jika mereka menginginkan kesucian} menjaga diri dari hal itu {karena kalian mencari} mencari {keuntungan kehidupan duniawi. Siapa saja yang memaksa mereka, maka sesungguhnya Allah Maha Pengampun lagi Maha Penyayang setelah mereka dipaksa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "33 “dan orang-orang yang tidak mampu menikah hendaklah menjaga kesucian (diri)nya, sehingga Allah memampukan mereka dengan karuniaNYa.” Hukum ini bagi orang yang tidak mampu untuk menikah. Allah memerintahkannya menjaga kehormatan, menahan diri dari perbuatan yang haram, dan menempuh cara-cara yang menghalangi dirinya dari perbuatan buruk itu, seperti menepis dorongan-dorongan hatinya dari pikiran-pikiran yang terbetik untuk menjerumuskan dirinya kedalamnya. (hendaknya) juga mengerjakan seperti yang disampaikan oleh nabi, “wahai para pemuda, barangsiapa yang sanggup untuk menikah, maka menikahlah,dan barangsaiapa belum mampu, hendaknya dia berpuasa, karena puasa itu perisai baginya,” Firman Allah, “dan orang-orang yang tidak mampu menikah,” maksudnya, tidak mampu menikah karena miskin, atau kepapaan para wali atau tuan mereka, atau penolakan para wali dan sayyid untuk menikahkan mereka, sementara mereka tidak memiliki kemampuan untuk memaksa para wali dan tuan melakukannya. Penafsiran ini lebih baik daripada penafsiran mereka yang menafsirkannya ‘tidak mendapatkan mahar nikah’. (dengan keterangan ini) mereka telah menjadikan mudhaf ‘ilaih (benda yang disandari) sebagai na’ib manab al-mudhaf (pengganti kedudukan mudhaf). Sesungguhnya dalam perlakuan ini mengandung dua larangan; pertama, membuang (suatu bagian) dalam perkataan. Padahal, pada asalnya, tidak boleh terjadi pembuangan. Yang kedua; makna (penafsiran itu) hanya terbatas orang yang mempunyai dua keadaan; keadaan kecukupan harta, dan keadaan tiada berharta. Akibatnya, budak lelaki, perempuan dan orang-orang yang pernikahannya berada dalam hak wali tidak masuk dalam konteks ini, sebagaimana telah kami sebutkan, “sehingga Allah memampukan mereka dengan karuniaNya,” sebagai janji terhadap orang yang menjaga dirinya, bahwa Allah akan mencukupi (kebutuhan) nya dan memudahkan urusannya, dan perintah baginya untuk menunggu jalan keluar agar keadaanya itu tidak membuatnya merasa keberatan. Firman Allah, “dan budak-budak yang kamu miliki yang menginginkan perjanjian, hendaklah kamu buat perjanjian dengan mereka, jika kamu mengetahui ada kebaikan pada mereka,” maksudnya barangsiapa ingin dan meminta pada kalian mukatabah (perjanjian pembebasan dengan syarat penebusan), budak lelaki atau perempuan, maka sambutlah permintaannya, dan buatlah perjanjian. “jika kamu mengetahui pada mereka,” yaitu orang-orang yang meminta untuk diadakan perjanjian “ada kebaikan,” yaitu kemampuan untuk mencari penghasilan dan kebaikan agamanya. karena, pada proses perjanjian ini terdapat dua mashlahat; maslahat pembebasan dan kemerdekaan, dan maslahat transaksi yang akan ia berikan kepada sang pemilik untuk menebus dirinya. barangkali ia akan giat dan bersungguh-sungguh dan mendaptkan (sejumlah) uang untuk tuannya yang tidak dia peroleh (bagi tuannya) ketika masih budak, sehingga tidak merugikan pemiliknya dalam masalah perjanjian ini, disertai manfaat yang sangat besar yang diperoleh budak tersebut. Karenanya, Allah memerintahkan perjanjian ini dalam bentuk perintah yang wajib sebagaimana terlihat dari zahirnya, atau perintah tersebut bersifat Sunnah menurut pendapat yang lain. Dan allah memerintahkan untuk membantu mereka (menyelesaikan) perjanjiannya. Pasalnya, mereka itu termasuk orang-orang yang membutuhkan pertolongan lantaran tidak mempunyai harta. Allah berfirman, “dan berikanlah kepada mereka sebagian dari harta Allah yang dikaruniakanNya kepadamu.” Masuk dalam kategori ini adalah perintah kepada tuannya yang mengadakan perjanjian agar memberinya sedikit (keringanan) dari perjanjiannya atau menggugurkan sebagian pembayarannya dan memerintahkan orang-orang untuk menolong mereka. Karena itu, Allah menetapkan bagian zakt bagi budak-budak yang telah membuat perjanjian dan menganjurkan penyerahannya dengan FirmanNya, “dari harta Allah yang dikaruniakanNya kepadamu,” maksudnya sebagaimana harta adalah milik Allah, kekayaan yang ada pada tangan kalian hanyalah anugerah dari Allah untuk kalian dan murni sebagai karuniaNya, maka bertaubat baiklah kepada hamba-hamba Allah sebagaimana Dia telah berbuat baik kepada kalian. Makna tersirat dari ayat ini bahwa seorang budak apabila dia tidak meminta mukatabah (perjanjian kebebasan), maka tuannya tidak diperintahkan untuk memulai perjanjian tersebut, dan bahwa apabila dia tidak mengetahui kebaikan padanya, dengan cara, mengetahui latar belakangnya yang tidak baik, mengetahui si budak tidak dapat mencari uang, hingga menyebabkan menjadi benalu bagi orang lain dan terseok-seok. Atau dia khawatir bila dimerdekakan, maka (dalam kebebsaannya ini) ia akan menyebabkan kerusakan. Maka sipemilik tidak diperintahkan untuk membuat perjanjian dengannya. Bahkan dilarang untuk melakukannya, karena mengandung bahaya yang telah disebutkan. Kemudian Allah berfirman, ”dan janganlah kamu paksa budak-budak wanitamu,” yakni, dari budak-budak perempuan kalian “untuk melakukan pelacuran,” maksudnya untuk menjadi wanita pezina “sedang mereka sendiri menginginkan kesucian,” karena pemaksaan terhadapnya tidak dapat dibayangkan kecuali dalam keadaan seperti ini. Namun bila tidak ada keinginan untuk menjaga dirinya, maka sesungguhnya wanita tersebut seorang pelacur yang wajib atas tuannya untuk melarangnya dari perbuatan itu. Sesungguhnya larangan ini disebabkan kebiasaan yang mereka kerjakan dimasa jahiliyyah, yaitu seorang pemilik budak memaksa budak wanitanya untuk melakukan zina, agar memperoleh upah dari perbuatan tersebut. Karenanya, Allah berfirman, ”karena kamu hendak mencari keuntungan duniawi,” maka tidak pantas bagi kalian bila budak kalian lebih baik daripada diri kalian, dan lebih menjaga diri dari perbuatan zina daripada kalian. Sementara itu kalian melakukannya pada mereka demi meraih keuntungan duniawi dan kenikmatan sedikit yang datang lalu akan sirna. Penghasilan kalian dengan cara mulia, bersih dan baik, (terlepas dari keberadaan balasan akhirat) adalah lebih utama daripada usaha kalian memperoleh kenikmatan yang sepele yang akan menghasilkan kehinaan dan kerendahan bagi kalian. Kemudian Allah menyeru orang yang melakukan pemaksaan untuk bertaubat, seraya berfirman,” dan barangsiapa yang memaksa mereka, maka sesungguhnya Allah MahaPengampun lagi Mahapenyayang (kepada mereka) sesudah mereka di paksa itu.” Hendaknya dia bertaubat kepada Allah, melepaskan diri dari segala yang muncul darinya yang menimbulkan kemurkaanNya. Bila dia melakukan hal ini, maka Allah akan mengampuni dosa-dosanya dan akan menyayanginya, sebagaimana dia telah menyayangi dirinya sendiri dengan membebaskannya dari azab, karena ia telah memberikan kasih sayang kepada budaknya dengan tidak memaksanya untuk melakukan sesuatu yang dapat membahayakan dirinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nur ayat 33: Ayat ini berkenaan dengan orang yang tidak mampu menikah, Allah memerintahkannya untuk menjaga kesucian dirinya dan mengerjakan sebab-sebab yang dapat menyucikan dirinya, seperti mengalihkan pikirannya dengan menyibukkan dirinya dan melakukan saran Nabi shallallahu 'alaihi wa sallam, yaitu berpuasa. Baik karena miskinnya mereka (tidak sanggup menyiapkan mahar atau memberikan nafkah), atau miskinnya.wali atau sayyid mereka atau karena keengganan mereka (wali atau sayyid) menikahkan mereka. Sehingga mereka dapat menikah. Salah satu cara dalam agama Islam untuk menghilangkan perbudakan adalah mukatabah, yaitu seorang hamba sahaya boleh meminta kepada tuannya untuk dimerdekakan, dengan perjanjian bahwa budak itu akan membayar jumlah uang yang ditentukan. Pemilik budak itu hendaklah menerima perjanjian itu kalau budak itu menurut pandangannya sanggup melunasi perjanjian itu dengan harta yang halal. Untuk mempercepat lunasnya perjanjian itu hendaklah budak-budak itu ditolong baik oleh tuannya dengan diringankan sedikit bebannya atau oleh orang lain dengan harta yang diambilkan dari zakat atau dari harta mereka. Disebutkan, “Harta Allah yang dikaruniakan-Nya kepadamu” untuk mengingatkan bahwa harta yang ada di tangan kita adalah berasal dari Allah, oleh karena itu berbuat baiklah kepada hamba-hamba Allah sebagaimana Allah telah berbuat baik kepada kita. Syaikh As Sa’diy berkata, “Mafhum ayat ini adalah, bahwa seorang hamba sahaya apabila tidak meminta mukatabah, maka majikannya tidak diperintahkan memulai menawarkan mukatabah, dan bahwa apabila dia tidak mengetahui kebaikan pada budaknya, bahkan yang diketahui malah sebaliknya, seperti ia tidak punya usaha sehingga menjadi beban orang lain, terlantar, atau ada sesuatu yang dikhawatirkan jika dimerdekakan seperti membuatnya melakukan kerusakan, maka majikannya tidak diperintahkan melakukan mukatabah, bahkan dilarang melakukannya karena di dalamnya terdapat sesuatu yang dikhawatirkan tersebut.” Imam Muslim meriwayatkan dengan sanadnya yang sampai kepada Jabir, ia berkata, “Abdullah bin Ubay bin Salul berkata kepada hamba sahayanya yang perempuan, “Pergilah! Lakukanlah pelacuran untuk kami.” Maka Allah menurunkan ayat, “Dan janganlah kamu paksa hamba sahaya perempuanmu untuk melakukan pelacuran, sedang mereka sendiri menginginkan kesucian, karena kamu hendak mencari keuntungan kehidupan duniawi.” Yakni memperoleh upah dari pelacuran itu, karena di zaman Jahiliyyah terkadang wanita budak dipaksa melakukan pelacuran agar majikannya memperoleh upah. Selanjutnya Allah Subhaanahu wa Ta'aala mengajak orang yang telah memaksa tersebut untuk bertobat. Oleh karena itu, hendaknya dia bertobat kepada Allah dan menghentikan perbuatannya itu. Apabila dia telah bertobat dan berhenti dari melakukan hal itu, maka Allah akan mengampuni dosa-dosanya dan merahmatinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nur Ayat 33",
    "description": "Bila arahan pada ayat sebelumnya ditujukan kepada para wali atau pihak yang dapat membantu pernikahan, arahan pada ayat ini ditujukan kepada pria agar tidak mendesak wali untuk buru-buru menikahkannya. Dan orang-orang yang tidak mampu menikah hendaklah menjaga kesucian diri-Nya dengan berpuasa atau aktivitas lain, sampai Allah memberi kemampuan kepada mereka dengan karunia-Nya dan memberi mereka kemudahan untuk menikah. Dan jika hamba sahaya yang kamu miliki menginginkan perjanjian, yaitu kesepakatan untuk memerdekakan diri dengan membayar tebusan, hendaklah kamu buat perjanjian kepada mereka jika kamu mengetahui ada kebaikan pada mereka, yaitu jika kamu tahu mereka akan mampu melaksanakan tugas dan kewajiban mereka, mampu menjaga diri, serta mampu menjalankan tuntunan agama mereka; dan berikanlah kepada mereka sebagian dari harta Allah yang dikaruniakan-Nya kepadamu berupa zakat untuk membantu pembebasan mereka dari perbudakan. Dan janganlah kamu paksa hamba sahaya perempuanmu untuk melakukan pelacuran, sedang mereka sendiri menginginkan kesucian, hanya karena kamu hendak mencari keuntungan kehidupan duniawi dari pelacuran itu. Barang siapa memaksa mereka untuk melakukan perbuatan tercela itu maka sungguh, Allah maha pengampun terhadap perempuan-perempuan yang dipaksa itu, maha penya-yang kepada mereka setelah mereka dipaksa, dan dia akan memikulkan dosa kepada orang yang memaksa mereka. 34. Ayat ini menutup uraian kelompok ayat-ayat tentang kabar bohong yang menimpa keluarga nabi serta petunjuk-petunjuk yang berkaitan dengan isu tersebut. Dan sungguh, kami telah menurunkan kepada kamu ayat-ayat yang memberi penjelasan, tuntunan hidup, dan contoh-contoh yang serupa dengan apa yang kamu alami dari orang-orang yang terdahulu sebelum kamu, seperti maryam dan yusuf yang dituduh berzina dan menerima pembebasan dari tuduhan itu; dan sebagai pelajaran bagi mereka yang mau membuka pikiran dan hatinya, yaitu orang-orang yang bertakwa."
  }
]