[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sesungguhnya Kami telah menurunkan kepada kalian (wahai sekalian manusia) ayat-ayat al-Qur’an sebagai petunju-petunjuk nyata terhadap kebenaran dan perumpamaan umat-umat terdahulu baik yang beriman maupun yang kafir dan segala kebaikan ataupun keburukan yang menimpa mereka merupakan perumpamaan dan pelajaran bagi kalian, dan nasihat yang akan bermanfaat bagi orang yang bertakwa kepada Allah dan takut akan siksaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "34. Dan sesungguhnya Kami telah menurunkan kepada kalian -wahai manusia- ayat-ayat yang memberi penerangan, yang tidak ada keraguan di dalamnya, dan juga menurunkan kepada kalian contoh-contoh dari orang-orang yang terdahulu sebelum kalian baik orang-orang mukmin maupun kafir, serta Kami menurunkan pelajaran yang hanya bisa dipetik oleh orang-orang yang bertakwa kepada Tuhan mereka dengan mengerjakan perintah-Nya dan menjauhi larangan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "34. Sungguh Kami telah menurunkan kepadamu ayat-ayat yang jelas hukum-hukumnya, dan Kami telah membuat banyak contoh bagi kalian dengan umat-umat sebelum kalian, dan Kami juga telah menurunkan kepadamu pelajaran dan ibrah yang dapat melembutkan hati orang-orang yang bertakwa."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "34. وَلَقَدْ أَنزَلْنَآ إِلَيْكُمْ ءَايٰتٍ مُّبَيِّنٰتٍ (Dan sesungguhnya Kami telah menurunkan kepada kamu ayat-ayat yang memberi penerangan) Yakni penerangan yang jelas. وَمَثَلًا مِّنَ الَّذِينَ خَلَوْا۟ مِن قَبْلِكُمْ(dan contoh-contoh dari orang-orang yang terdahulu sebelum kamu) Yakni seperti perumpamaan-perumpamaan dari kisah-kisah menakjubkan yang diceritakan bagi mereka dalam kitab-kitab terdahulu. وَمَوْعِظَةً لِّلْمُتَّقِينَ(dan pelajaran bagi orang-orang yang bertakwa) Yakni hanya orang-orang yang bertakwa saja yang dapat mengambil manfaat darinya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "34. Wahai orang-orang mukmin, sungguh Kami telah menurunkan untuk kalian ayat-ayat pemisah dalam Al-Qur’an yang menjelaskan hukum, batasan, adab, dan kisah menakjubkan yang menyerupai kisah lainnya. Kisah ini yaitu kisah Sayyidah ‘Aisyah yang menyerupai kisah Maryam dan Yusuf yang dibebaskan oleh Allah SWT. Kisah atau perumpamaan itu seperti perumpamaan-perumpamaan orang-orang terdahulu sebelum kalian di kitab-kitab terdahulu dan merupakan pelajaran bagi orang-orang yang takut dengan azab Allah dan suka berdzikir karena mereka mengambil manfaat dari pelajaran itu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh Kami telah menurunkan kepada kalian ayat-ayat yang jelas} jelas {contoh-contoh} kabar-kabar {dari orang-orang yang terdahulu} terdahulu {sebelum kalian dan pelajaran bagi orang-orang yang bertakwa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "34 ini merupakan bentuk pengagungan dan pemuliaan terhadap ayat-ayat yang telah dibacakan kepada para hambaNya, supaya mereka mengetahui kedudukannya dan menjalankan haknya. Allah berfirman,” dan sungguh kami telah menurunkan kepada kamu ayat-ayat yang memberi penerangan,” yaitu petunjuk yang jelas terhadap setiap perkara yang kalian butuhkan, baik perkara yang ushul ataupun yang furu’, sehingga tidak tersisa satu masalah rancu dan syubhat pun didalmnya. “dan” kami turunkan kepada kalian juga “contoh-contoh dari orang-orang yang terdahulu sebelum kamu,” berupa kisah orang-orang terdahulu, baik yang shalih ataupun yang durhaka, sifat-sifat amal perbuatan mereka, peristiwa yang baik yang terjadi pada mereka atau malapetaka yang menimpa mereka. Kalian merenungkannya sebagai bahan permisalan dan sumber pelajaran abgi orang yang melakukan hal serupa dengan amal mereka sehingga akan dibaalas dengan apa yang telah mereka terima. “dan pelajaran bagi orang-orang yang bertakwa,” maksudnya kami telah menurunkan buat kalian nasihat bagi oranmg-orang yang bertakwa, berupa janji (baik), ancaman, anjuran dan peringatan, sebagai nasihat bagi orang yang bertakwa, sehingga mereka akan menahan diri dari sesuatu yang Allah benci kepada sesuatu yang Allah cintai."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nur ayat 34: Ayat ini merupakan pengagungan terhadap ayat-ayat Al Qur’an ini yang diturunkan-Nya kepada hamba-hamba-Nya agar mereka mengetahui kedudukannya dan melaksanakan haknya. Terhadap semua yang kamu butuhkan, baik perkara ushul (dasar) maupun furu’ (cabang) sehingga tidak ada lagi kemusykilan dan syubhat (kesamaran). Baik yang saleh maupun yang tidak dan menerangkan sifat amal mereka serta apa yang menimpa mereka agar kamu menjadikannya pelajaran, bahwa orang yang melakukan hal yang sama akan mendapatkan balasan yang serupa. Seperti nasehat-Nya agar rasa belas kasihan tidak menghalanginya dari menegakkan hukum Allah, dan nasehat agar tidak berburuk sangka kepada orang yang baik, dsb. Di samping itu, di dalamnya pun terdapat janji dan ancaman, targhib dan tarhib. Dikhususkan kepada orang-orang yang bertakwa, karena merekalah yang dapat mengambil manfaat daripadanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nur Ayat 34",
    "description": "Ayat ini menutup uraian kelompok ayat-ayat tentang kabar bohong yang menimpa keluarga nabi serta petunjuk-petunjuk yang berkaitan dengan isu tersebut. Dan sungguh, kami telah menurunkan kepada kamu ayat-ayat yang memberi penjelasan, tuntunan hidup, dan contoh-contoh yang serupa dengan apa yang kamu alami dari orang-orang yang terdahulu sebelum kamu, seperti maryam dan yusuf yang dituduh berzina dan menerima pembebasan dari tuduhan itu; dan sebagai pelajaran bagi mereka yang mau membuka pikiran dan hatinya, yaitu orang-orang yang bertakwa. 35. Allah adalah pemberi cahaya, karenanya dia menurunkan Al-Qur'an untuk menjadi cahaya bagi kehidupan manusia. Allah adalah pemberi cahaya pada langit dan bumi, baik cahaya material yang kasat mata maupun cahaya immaterial seperti keimanan, pengetahuan, dan lainnya. Perumpamaan kecerlangan cahaya-Nya yang menerangi hati orang-orang mukmin seperti sebuah lubang yang tidak tembus sehingga tidak diterpa angin yang dapat memadamkan cahaya, dan membantu mengumpulkan cahaya lalu memantulkannya; yang di dalamnya ada pelita besar. Pelita itu di dalam tabung kaca dan tabung kaca itu bagaikan bintang yang berkilauan, yang dinyalakan dengan minyak dari pohon yang diberkahi, yaitu pohon zaitun, yang tumbuh tidak di timur dan tidak pula di barat, sehingga pohon itu selalu mendapat sinar matahari sepanjang hari. Kejernihan minyaknya saja hampir-hampir menerangi, walaupun tidak disentuh api. Cahaya di atas cahaya, berlapis-lapis; pelita adalah cahaya, demikian pula kaca dan minyak yang begitu jernih, sehingga sempurnalah sinarnya. Allah memberi petunjuk kepada cahaya-Nya bagi orang yang dia kehendaki, yaitu siapa saja yang mengikuti petunjuk Al-Qur'an, dan Allah membuat perumpamaan-perumpamaan bagi manusia agar mereka mudah memahami kandungannya dan mengambil pela-jaran darinya hingga akhirnya mau beriman. Dan Allah maha mengetahui segala sesuatu; tidak ada sedikit pun yang tersembunyi dari-Nya."
  }
]