[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah adalah cahaya langit dan bumi, Dia mengatur urusan pada keduanya, dan memberikan petunjuk bagi para penghuni keduanya. Dia adalah cahaya, dan penutupNya adalah cahaya, dengan itu langit dan bumi serta apa yang ada di keduanya terang bersinar. Dan Kitabullah dan hidayahNya merupakan cahaya dari Allah, seandainya bukan karena cahaya Allah, niscaya kegelapan-kegelapan akan bertumpuk-tumpuk, sebagiannya berada di atas sebagian yang lain. Dan perumpamaan cahayaNya yang Dia memandu (manusia) kepadanya, yaitu iman dan al-Qur’an yang berada di dalam hati seorang Mukmin, adalah seperti tempat lampu, yaitu lubang tidak tembus yang ada di dinding, padanya terdapat pelita cahaya. Lubang tersebut memagari pancaran sinarnya, sehingga tidak memancar kemana-mana. Pelita cahaya itu terdapat di dalam kaca, yang dikarenakan amat bening, seakan-akan tampak seperti bintang bercahaya layaknya sebuah mutiara. Cahaya pelita itu dinyalakan dengan minyak pohon yang diberkahi, yaitu pohon zaitun, yang tidak tumbuh di arah timur saja sehingga tidak terkena cahaya matahari di sore hari, juga tidak tumbuh di arah barat saja sehingga tidak terpancari sinar matahari di pagi hari. Akan tetapi, ia berada ditempat pertengahan di satu dataran di bumi, tidak condong ke timur, dan tidak condong ke arah barat. Minyaknya, lantaran kemurniannya, bercahaya sendiri sebelum disulut nyala api. Ketika telah disulut nyala api, maka akan memancarkan cahaya yang terang-benderang. Cahaya di atas cahaya. Yaitu cahaya dari pancaran minyak itu sendiri ditambah dengan cahaya nyala api. Itulah perumpamaan hidayah, menyinari hati seorang Mukmin. Aalh memberikan hidayah dan taufik kepada orang-orang yang Dia kehendaki untuk mengikuti al-Qur’an. Dan Allah mengadakan perumpamaan-perumpamaan bagi manusia supaya mereka mau memikirkan tentang perumpamaan dan hokum dariNya. Dan Allah Maha Mengetahui segala sesuatu, tidak ada sesuatu pun yang samar bagiNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "35. Allah adalah cahaya langit dan bumi, pemberi petunjuk kepada semua makhluk yang tinggal pada keduanya. Perumpamaan cahaya Allah dalam hati seorang mukmin adalah seperti satu lubang yang tak tembus di suatu dinding,yang di dalamnya ada pelita. Pelita itu ditempatkan dalam kaca bening seakan-akan bintang yang bercahaya seperti mutiara, yang dinyalakan dengan minyak yang berasal dari pohon yang berkah, yaitu pohon zaitun yang tumbuh di tempat yang tidak dihalangi oleh sesuatupun dari sinar matahari, baik di pagi atau sore hari. Lantaran kemurnian minyaknya, maka ia hampir saja bercahaya dan menerangi walaupun tidak disentuh api, lalu bagaimana bila disentuh oleh api?! Cahaya lampu berada dalam cahaya kaca (cahaya yang berlapis-lapis). Beginilah perumpamaan hati seorang mukmin bila di dalamnya bersinar cahaya petunjuk. Allah membimbing kepada cahaya-Nya, yaitu Al-Qur`ān, siapa yang Dia kehendaki dari hamba-hamba-Nya. Dan Allah menjelaskan banyak perkara dengan membuat perumpamaan-perumpamaan. Dan Allah Maha Mengetahui segala sesuatu, tidak ada sesuatupun yang tersembunyi dari-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "35. Allah adalah pemberi petunjuk bagi para penghuni langit dan bumi. Perumpamaan petunjuk keumanan dan al-Qur’an dalam hati orang-orang beriman seperti ruang di dinding yang di dalamnya terdapat lampu yang meneranginya, dan lampu ini terdapat di dalam kaca yang seperti bintang yang bersinar layaknya mutiara. Lampu ini dinyalakan terus menerus dengan minyak murni yang keluar dari pohon zaitun yang diberkahi yang tidak tumbuh di timur sehingga tidak tertimpa sinar matahari pada sore hari, tidak pula tumbuh di barat sehingga terhalang dari sinar matahari pada pagi hari; oleh sebab itu pohon tersebut menghasilkan minyak yang paling berkualitas, kejernihannya menjadikannya hampir bersinar dengan sendirinya tanpa harus dinyalakan dengan api; dan jika dinyalakan dengan api, maka cahayanya berada di atas sinarnya sendiri, inilah cahaya di atas cahaya karena memiliki banyak sebab penimbul cahaya. Demikianlah perumpamaan keimanan dan al-Qur’an yang berkumpul di hati orang beriman; Allah memberi petunjuk kepada cahaya ini bagi hamba-hamba-Nya yang Dia kehendaki. Allah menjelaskan berbagai perumpamaan bagi para hamba agar mereka mengambil ibrah. Allah Maha Mengetahui segala sesuatu, tidak ada yang tersembunyi dari-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "35. اللهُ نُورُ السَّمٰوٰتِ وَالْأَرْضِ ۚ (Allah (Pemberi) cahaya (kepada) langit dan bumi) Makna (النور) yakni cahaya, yaitu yang menjadikan suatu benda menjadi terlihat karena pantulan cahaya yang mengenai benda tersebut dan ditangkap oleh mata. Allah menjadikan langit dan bumi bersinar dengan keistiqamahan penghuni keduanya dan dengan kesempurnaan pengaturan Allah dan hidayah-Nya. مَثَلُ نُورِهِۦ(Perumpamaan cahaya Allah) Yakni cahaya yang berasal dari-Nya dan cahaya yang Dia jadikan di hati setiap hamba-Nya yang beriman. كَمِشْكَوٰةٍ(seperti sebuah lubang yang tak tembus) Makna (المشكاة) adalah celah di dinding yang tidak tembus ke sisi sebelahnya yang dipakai untuk meletakkan lentera, celah ini digunakan agar cahaya dari lentera dan semisalnya dapat lebih kuat. فِيهَا مِصْبَاحٌ ۖ( yang di dalamnya ada pelita besar) Yakni lentera. الْمِصْبَاحُ فِى زُجَاجَةٍ ۖ( Pelita itu di dalam kaca) Sehingga lentera itu dapat lebih terang cahayanya. الزُّجَاجَةُ كَأَنَّهَا كَوْكَبٌ دُرِّىٌّ((dan) kaca itu seakan-akan bintang (yang bercahaya) seperti mutiara) Yakni menyerupai mutiara. Menurut Dhahhak yang dimaksud dengan (كوكب دري) adalah planet Venus. يُوقَدُ(yang dinyalakan) Yakni lentera itu dinyalakan. مِن شَجَرَةٍ مُّبٰرَكَةٍ زَيْتُونَةٍ(dengan minyak dari pohon yang berkahnya, (yaitu) pohon zaitun) Terdapat pendapat mengatakan bagian dari keberkahan pohon ini adalah buahnya dapat dipakai sebagai lauk, minyak, penyamakan kulit, dan bahan bakar, dan tidak ada bagian pohon pun yang tidak memiliki manfaat. لَّا شَرْقِيَّةٍ وَلَا غَرْبِيَّةٍ(yang tumbuh tidak di sebelah timur (sesuatu) dan tidak pula di sebelah barat(nya)) Yakni yang tidak terhalang dari cahaya matahari baik itu di waktu matahari terbit maupun tenggelam. يَكَادُ زَيْتُهَا يُضِىٓءُ وَلَوْ لَمْ تَمْسَسْهُ نَارٌ (yang minyaknya (saja) hampir-hampir menerangi, walaupun tidak disentuh api) Hal ini karena kemurniannya. Ibnu Abbas berkata: maksud dari ayat ini adalah minyak yang jernih seakan-akan mengeluarkan cahaya sebelum dinyalakan dengan api, dan jika telah dinyalakan minyak itu akan bertambah terang cahayanya. Begitu pula hati seorang mukmin yang beramal dengan tuntunan hidayah sebelum ia memperoleh ilmu, dan jika ia telah mendapat ilmu maka hidayahnya akan semakin bertambah dan cahayanya akan semakin terang. نُّورٌ عَلَىٰ نُورٍ ۗ( Cahaya di atas cahaya) Pelita itu mengeluarkan cahaya, kaca mengeluarkan cahaya, dan celah di dinding memantulkan cahaya. وَيَضْرِبُ اللهُ الْأَمْثٰلَ لِلنَّاسِ ۗ (dan Allah memperbuat perumpamaan-perumpamaan bagi manusia) Yakni Allah menjelaskan segala sesuatu dengan hal yang serupa dengannya untuk lebih memudahkan pemahaman."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). { ٱللَّهُ نُورُ ٱلسَّمَٰوَٰتِ وَٱلْأَرْضِ } \"Allah (Pemberi) cahaya (kepada) langit dan bumi\" Ketika para ahli qur'an duduk bermajlis dengan al-Qur'an mereka, dan menyibukkan diri dengan ayat-ayat Allah yang mulia. Sesungguhnya pada hakikatnya mereka sedang menyampaikan ruh-ruh mereka dengan tali Allah, dan menghubungkannya lampu hati hati mereka dengan sumber cahaya yang paling agung, maka ketika itu mereka sedang mengharapkan cahaya kepada sang pemilik cahaya yang tiada tandingan dan bandingnya. 2 ). Tidakkah kamu bertanya dan mencari tahu tentang dirimu ketika ia merasakan suatu kegelapan, apa yang menghalanginya dari dari cahaya mulia yang menerangi seluruh alam?! { وَمَن لَّمْ يَجْعَلِ ٱللَّهُ لَهُۥ نُورًا فَمَا لَهُۥ مِن نُّورٍ } \"(dan) barangsiapa yang tiada diberi cahaya (petunjuk) oleh Allah tiadalah dia mempunyai cahaya sedikitpun\" (An-Nur: 40) 3 ). Pada firman Allah: { ٱلزُّجَاجَةُ كَأَنَّهَا كَوْكَبٌ } \"Pelita itu di dalam kaca (dan) kaca itu seakan-akan bintang (yang bercahaya) seperti mutiara\" Allah menyerupakan pelita dengan bintang-bintang, dan tidak menyerupakannya dengan matahari atau bulan, karena matahari dan bulan diikuti oleh gerhana, sedangkan bintang-bintang tidak demikian. 4 ). { يَهْدِى ٱللَّهُ لِنُورِهِۦ مَن يَشَآءُ } \"Allah membimbing kepada cahaya-Nya siapa yang dia kehendaki\" Betapa banyak manusia diharamkan bagi dirinya cahaya ini, padahal mereka lebih cerdas dari kalian, lebih cermat, lebih kaya, dan lebih kuat, maka tetaplah kalian berada dalam terangnya cahaya ini sampai datannga hari kebangkitan bersama orang-orang yang tidak akan padaham cahaya mereka atas karunia Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "35. Allah adalah Dzat yang menerangi langit, bumi dan penghuninya. Dan seluruh alam itu diberi petunjuk ddengan cahayaNya. Gambaran cahayaNya yang menakjubkan yang digunakan untuk menerangi hati orang-orang mukmin sehingga mereka ditunjukkan menuju kebenaran dan hidayah itu seperti lubang kecil pada dinding yang tidak memiliki jendela (yaitu seperti suatu energi) yang mengumpulkan cahaya dan merefleksikannya. Di dalamnya terdapat lampu yang berkilauan. Lampu itu berada dalam kaca bening (kristal). Kaca dan cahaya itu di dalamnya seakan-akan seperti bintang yang bersinar terang benderang. Ad-Durriyyu berasal dari kata Ad-Durru yang merupakan salah satu jenis batu mulia. Lampu itu dinyalakan (lampu) menggunakan minyak dari pohon yang diberkahi yaitu pohon zaitun yang terpapar sinar matahari sepanjang siang karena pohon itu berada di tengah antara arah timur dan barat sehingga menjadikan minyaknya menjadi minyat terbaik di antara minyak lainnya. Hampir minyaknya itu menerangi dirinya sendiri tanpa api untuk meneranginya dan memantulkan cahaya untuknya. Cahaya di atas cahaya. Penerangan itu cahaya, lampu itu cahaya, dan kilauan minyak itu juga cahaya, sehingga pancarannya saling menyempurnakan. Allah selalu mengawasi Al-Qur’anNya dan menjelaskan berbagai perumpamaan untuk manusia untuk lebih membuat paham mereka, supaya mereka mau mengambil pelajaran lalu beriman. Allah adalah Dzat yang Maha Mengetahui setiap sesuatu. Tidak ada yang tersembunyi dariNya. Di dalamnya terdapat janji dan peringatan. Janji (baik) bagi orang yang mengambil pelajaran dari hal itu dan peringatan bagi orang yang mengabaikannya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah (pemberi) cahaya (kepada) langit dan bumi. Perumpamaan cahayaNya seperti sebuah lubang yang tidak tembus} seperti lubang pada dinding yang tidak bisa ditembus {yang di dalamnya ada pelita} pelita {Pelita itu di dalam tabung kaca. Tabung kaca itu bagaikan bintang (yang berkilau seperti) mutiara} berkilau seperti mutiara karena kemurian dan keindahannya {yang dinyalakan dengan minyak dari pohon yang diberkahi, (yaitu) pohon zaitun} pelita itu menghasilkan cahayanya dari minyak pohon yang diberkahi yaitu pohon zaitun {yang tumbuh tidak di timur dan tidak pula di barat} tidak di bagian timur sehingga tidak terkena sinar matahari ketika terbenam, dan tidak pula di barat sehingga tidak terkena sinar matahari ketika terbit, namun pohon itu tumbuh di tengah-tengaah sehingga terkena matahari sepanjang siang, sehingga minyaknya murni dan berkilau {yang minyaknya hampir menerangi walaupun tidak disentuh api. Cahaya di atas cahaya. Allah memberi petunjuk menuju cahayaNya kepada orang yang Dia kehendaki. Dan Allah membuat} menjelaskan {perumpamaan-perumpamaan bagi manusia. Allah Maha Mengetahui segala sesuatu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "35 “Allah (pemberi) cahaya (kepada) langit dan bumi,” yang inderawi dan non inderawi. Demikian itu, karena Dzat Allah sendiri adalah cahaya, tiraiNya merupakan cahaya, bila Allah menyingkapnya, niscaya pancaran (sinar) wajahNya akan membakar makhluk-makhluk sejauh pandangan mataNya memandang. Dengan (cahaya) Nya, maka Arasy, al-kursi, matahari dan bulan bercahaya. Surga menjadi terang dengan (caha)Nya. Begitu pula [cahaya] yang non inderawi yang kembali bersumber kepada Allah. kitabNya adalah cahaya, syariatNya adalah cahaya, iman dan ma’rifah yang ada di dalam hati para rasul dan para hambaNYa yang beriman adalah cahaya. Sekiranya tidak ada cahaya Allah, maka kegelapan-kegelapan akan bertumpuk-tumpuk. Oleh karena itu, semua tempat yang kehilangan cahayaNya, maka disanalah kegelapan dan pemasungan. “perumpamaan cahaya Allah,” yang memadu kepadaNya; yaitu cahaya iman dan al-qur’an dalam hati orang-orang Mukmin “seperti sebuah lubang (yang tak tembus),” lumbang dinding “yang di dalamnya ada pelita besar,” karena lubang dinding menghimpun cahaya dari lampu sehingga tidak tercerai-berai, membias. Hal itu karena “pelita itu didalam kaca, (dan) kaca itu,” lantaran kejernihan dan keindahannya “seakan-akan bintang (yang bercahaya) seperti mutiara,” maksudnya bersinar seperti batu mutiara “yang dinyalakan” lampu tersebut yang terdapat di dalam kaca yang bening dinyalakan “dengan minyak dari pohon yang diberkahi, (yaitu) pohon zaitun,” maksudnya dinyalakan dengan minyak zaitun yang cahayanya merupakan cahaya yang paling cemerlang “tidak disebelah timur (sesuatu),” saja, hingga tidak terkena (pancaran) matahari di akhir siang “tidak pula disebelah barat (nya),” saja, hingga tidak terkena matahari [di permulaan] siang. Bila dua kondisi tersebut tidak ada, maka ia berada ditengah dari bumi, seperti zaitun dari wilayah syam, yang terkenal matahari pada permulaan siang dan penghujungnya, sehingga bertambah baik dan bagus serta berdampak pada perolehan minyaknya yang lebih jernih. Karena itu, Allah mengatakan, “yang minyaknya (saja) hampir-hampir,” karena kejernihannya “menerangi, walalupun tidak disentuh api,” lalu bila terkenal api, amaka akan semakin menerangi. “cahaya diatas cahaya (berlapis-lapis),” cahaya dari api dan cahaya dari minyak. Sisi (persamaan) dari permisalan ini yang mana Allah memisalkan dan menerapkannya pada keadaan seorang Mukmin yang aman cahaya Allah yang berada dalam hatinya, bahwasannya fitrah Mukmin itu yang mana dia diciptakan dalam bentuknya adalah seperti kedudukan minyak yang sangat jernih. Fitrah Mukmin itu jernih, telah siap untuk (menerima) ajaran-ajaran ilahi dan amal yang disyariatkan. Lalu, apabila ilmu dan iman telah menembus hatinya, maka cahaya yang ada dalam hatinya akan menyala sebagimana nyala api di lentera yang ada didalam lampu tersebut. Hatinya jenih dari tujuan jelek dan pemahaman yang jelek tentang Allah. Bila keimanan telah sampai kepadanya, niscaya akan menyinari dengan pancaran yang besar karena sterilitasnya dari kotoran-kotoran. Hal ini ibarat beningnya kaca yang bersinar, sehingga akan terkumpullah padanya cahaya fitrah, cahaya iman, cahaya ilmu dan beningnya ma’rifah, cahaya diatas cahaya yang lain. Tatkala ini berasal dari cahaya Allah, sementara tidak setiap orang pantas menerimanya, maka Allah berfirman, ”Allah membimbing siapa yang Dia kehendaki kepada cahayaNya,” dari orang-orang yang diketahui kesucian dan kebersihannya, dia bersih dan tumbuh bersamaNya. “dan Allah memperbuat perumpamaan-perumpamaan bagi manusia,” supaya mereka berpikir dan dapat memahami, sebagai (cerminan) kelembutan dari Allah dan kebaiakanNya kepada mereka, supaya semakin jelas kebenaran dari kebatilan. Karena permisalan-permisalan dapat mendekatkan makna yang masih abstark kepada makna yang dapat dicerna panca indera. Sehingga para hamba mengerahuinya dengan sejelas-jelasnya. ”dan Allah MahaMengetahui segala sesuatu,” ilmunya mencakup segala sesuatu, supaya kalian mengetahui bahwa permisalan yang dipaparkan adalah permisalah oleh Dzat yang mengetahui hakikat-hakikat permasalahan dan perinciannya, dan itu merupakan kemaslahatan bagi para hamba. Maka hendaknya kesibukan kalian (diungkapkan) dengan cara menghayati dan selalu berhubungan dengannya, bukan dengan cara berpaling dan menentangnya. Karena sesungguhnya Allah mengetahui, sedangkan kalian tidak mengetahuinya. Tatkala cahaya iman dan al-qur’an itu, kebanyakan faktor-faktornya teraih didalam masjid, maka Allah menyebutkannya guna mengangkat arti pentingnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nur ayat 35: Dia menyinari langit dan bumi baik secara hissiy (konkrit) maupun maknawi (abstrak). Yang demikian karena Allah Subhaanahu wa Ta'aala pada Zat-Nya bercahaya dan hijab-Nya –yang jika bukan karena kelembutan-Nya tentu cahaya zat-Nya akan membakar semua makhluk-Nya- juga cahaya. Dengan cahaya itu ‘Arsy dan Kursi bersinar, demikian pula matahari dan bulan serta cahaya dapat bersinar, dan dengannya pula surga bersinar. Dia juga yang memberikan cahaya secara maknawi, kitab-Nya bercahaya, syariat-Nya bercahaya, iman dan ma’rifat (mengenal Allah) di hati para rasul dan hamba-hamba-Nya adalah cahaya. Jika tidak ada cahaya-Nya, tentu yang ada kegelapan di atas kegelapan. Oleh karena itulah, setiap tempat yang tidak mendapatkan cahaya-Nya, maka jadi gelap. Yang menunjukkan kepada-Nya, yaitu cahaya iman dan Al Qur’an yang ada di hati seorang muslim. Yang dimaksud lubang yang tidak tembus (misykat) ialah suatu lobang di dinding rumah yang tidak tembus sampai ke sebelahnya, biasanya digunakan untuk tempat lampu, atau barang-barang lain. Karena bersih dan indahnya. Maksudnya, pohon zaitun itu tumbuh di puncak bukit, ia mendapat sinar matahari baik di waktu matahari terbit maupun di waktu matahari akan terbenam, sehingga pohonnya subur dan buahnya menghasilkan minyak yang baik. Jika tersentuh api, tentu sinarnya lebih terang lagi. Cahaya dari apinya dan cahaya dari minyaknya. Menurut Syaikh As Sadiy, inti pada perumpamaan yang dibuat Allah ini dan prakteknya pada keadaan orang mukmin dan pada cahaya Allah di hatinya adalah bahwa fitrah-Nya yang manusia diciptakan di atasnya seperti minyak yang bersih. Fitrahnya bersih dan siap menerima pengajaran dari Allah serta mengamalkannya. Jika ilmu sampai kepadanya, maka menyala cahaya yang ada di hatinya seperti halnya sumbu yang menyala di dalam lampu itu, hatinya bersih dari maksud yang buruk dan paham yang buruk. Apabila iman sampai kepadanya, maka akan bersinar lagi hatinya dengan sinar yang terang karena bersih dari kotoran, dan hal itu seperti bersihnya kaca yang berkilau, sehingga berkumpullah cahaya fitrah, cahaya iman, cahaya ilmu, dan bersihnya ma’rifat (mengenal Allah), sehingga cahaya tersebut di atas cahaya. Oleh karena cahaya tersebut berasal dari Allah Ta’ala, dan tidak setiap orang berhak mendapatkannya, maka Allah menerangkan bahwa Allah memberi petunjuk kepada cahaya-Nya bagi orang yang Dia kehendaki, di mana Dia mengetahui kebersihan dan kesucian dirinya. Agar mereka dapat lebih memahami sebagai kelembutan dan ihsan dari-Nya kepada mereka, dan agar kebenaran semakin jelas. Ilmu-Nya meliputi segala sesuatu. Oleh karena itu, hendaklah kamu mengetahui bahwa perumpamaan itu adalah perumpamaan dari yang mengetahui hakikat segala sesuatu dan rinciannya, dan bahwa perumpamaan itu adalah untuk maslahat bagi hamba. Oleh karena itu, hendaknya kesibukanmu adalah memikirkannya dan memahaminya, tidak malah membantahnya dan mempertentangkannya, karena Dia mengetahui sedangkan kamu tidak mengetahui."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nur Ayat 35",
    "description": "Allah adalah pemberi cahaya, karenanya dia menurunkan Al-Qur'an untuk menjadi cahaya bagi kehidupan manusia. Allah adalah pemberi cahaya pada langit dan bumi, baik cahaya material yang kasat mata maupun cahaya immaterial seperti keimanan, pengetahuan, dan lainnya. Perumpamaan kecerlangan cahaya-Nya yang menerangi hati orang-orang mukmin seperti sebuah lubang yang tidak tembus sehingga tidak diterpa angin yang dapat memadamkan cahaya, dan membantu mengumpulkan cahaya lalu memantulkannya; yang di dalamnya ada pelita besar. Pelita itu di dalam tabung kaca dan tabung kaca itu bagaikan bintang yang berkilauan, yang dinyalakan dengan minyak dari pohon yang diberkahi, yaitu pohon zaitun, yang tumbuh tidak di timur dan tidak pula di barat, sehingga pohon itu selalu mendapat sinar matahari sepanjang hari. Kejernihan minyaknya saja hampir-hampir menerangi, walaupun tidak disentuh api. Cahaya di atas cahaya, berlapis-lapis; pelita adalah cahaya, demikian pula kaca dan minyak yang begitu jernih, sehingga sempurnalah sinarnya. Allah memberi petunjuk kepada cahaya-Nya bagi orang yang dia kehendaki, yaitu siapa saja yang mengikuti petunjuk Al-Qur'an, dan Allah membuat perumpamaan-perumpamaan bagi manusia agar mereka mudah memahami kandungannya dan mengambil pela-jaran darinya hingga akhirnya mau beriman. Dan Allah maha mengetahui segala sesuatu; tidak ada sedikit pun yang tersembunyi dari-Nya. 36. Cahaya itu Allah pancarkan di langit dan bumi, seperti disebutkan dalam ayat sebelumnya. Namun, tidak semua orang dapat meraih cahaya itu. Cahaya itu di rumah-rumah ibadah yang di sana telah diperintahkan Allah untuk memuliakan dan menyebut nama-Nya; di sana bertasbih-lah orang-orang yang menyucikan nama-Nya melalui berbagai ibadah, seperti azan, salat, dan tilawah Al-Qur'an, pada waktu pagi dan petang, ."
  }
]