[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Cahaya yang terang itu adalah di masjid-masjid, yang Allah memerintahkan untuk ditinggikan urusan tentangnya dan bangunannya, di mana di dalamnya namaNya disebut-sebut dengan membaca al-Qur’an, tasbih, tahlil dan jenis-jenis dzikir lainnya. Orang-orang mengerjakan shalat di dalamnya karena Allah di waktu pagi dan sore hari."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "36. Lampu penerang tersebut dinyalakan dalam masjid-masjid yang Allah perintahkan untuk diagungkan kemuliaan dan bangunannya, dan disebut nama-Nya di dalamnya dengan azan, zikir dan salat, serta (laki-laki yang tidak lalai) mendirikan salat di dalamnya demi meraih rida Allah pada waktu pagi dan petang hari."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "36. Cahaya ini bersinar di masjid-masjid. Allah memerintahkan agar mengagungkan bangunan, penjagaan, dan pemakmurannya bagi orang-orang yang shalat; di dalamnya disebutkan nama Allah dengan azan, bacaan al-Qur’an, dan zikir-zikir berupa tasbih dan tahmid pada pagi dan sore hari yang memenuhi timbangan amal."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "36. فِى بُيُوتٍ (di masjid-masjid) Yakni lentera-lentera tersebut di dalam masjid-masjid. أَذِنَ اللهُ أَن تُرْفَعَ(Allah telah memerintahkan untuk dimuliakan) Yakni dibangun dengan tinggi dan megah, serta dimuliakan dan disucikan dari segala najis dan kotoran. وَيُذْكَرَ فِيهَا اسْمُهُۥ(dan disebut nama-Nya di dalamnya) Yakni dengan azan, tasbih, dan zikir lainnya; masjid-masjid adalah bangunan terbaik di bumi. يُسَبِّحُ لَهُۥ فِيهَا بِالْغُدُوِّ وَالْاٰصَالِ(Bertasbih kepada Allah pada waktu pagi dan waktu petang) Yakni di awal-awal dan akhir-akhir siang."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "36. Allah memerintahkan dan mewajibkan supaya masjid-masjid dibangun dan diagungkan dengan mengagungkanNya, disucikan dari kotoran-kotoran, supaya namaNya diulang-ulang di dalamnya dengan mengumandangkan adzan, bertasbih, berdzikir, bershalawat, dan membaca Al-Qur’an, dan supaya di dalalmnya manusia shalat kepada Allah, mensucikanNya di permulaan dan di akhir siang"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah (pemberi) cahaya (kepada) langit dan bumi. Perumpamaan cahayaNya seperti sebuah lubang yang tidak tembus} seperti lubang pada dinding yang tidak bisa ditembus {yang di dalamnya ada pelita} pelita {Pelita itu di dalam tabung kaca. Tabung kaca itu bagaikan bintang (yang berkilau seperti) mutiara} berkilau seperti mutiara karena kemurian dan keindahannya {yang dinyalakan dengan minyak dari pohon yang diberkahi, (yaitu) pohon zaitun} pelita itu menghasilkan cahayanya dari minyak pohon yang diberkahi yaitu pohon zaitun {yang tumbuh tidak di timur dan tidak pula di barat} tidak di bagian timur sehingga tidak terkena sinar matahari ketika terbenam, dan tidak pula di barat sehingga tidak terkena sinar matahari ketika terbit, namun pohon itu tumbuh di tengah-tengaah sehingga terkena matahari sepanjang siang, sehingga minyaknya murni dan berkilau {yang minyaknya hampir menerangi walaupun tidak disentuh api. Cahaya di atas cahaya. Allah memberi petunjuk menuju cahayaNya kepada orang yang Dia kehendaki. Dan Allah membuat} menjelaskan {perumpamaan-perumpamaan bagi manusia. Allah Maha Mengetahui segala sesuatu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "36 maksudnya peribadahan karena Allah dilakukan “di masjid-masjid,” yang agung dan penuh keutamaan, ia adalah tempat yang paling Allah cintai, yaitu masjid-masjid “yang telah Allah perintahkan,” maksudnya Allah menyuruh dan memerintahkan “untuk dimuliakan dan disebut namaNYa di dalamnya,” dua hal ini merupakan himpunan hukum-hukum masjid. Termasuk tindakan memuliakannya adalah, membangunnya, menyapunya, membersihkannya dari segala najis dan kotoran, menjaganya dari orang-orang gila, anak-anak yang tidak bisa memelihara diri dari najis, dan dari orang kafir, serta harus dijaga drai perkara-perkara yang melalaikan, dan teriakan suara selain dzikir kepada Allah, “disebut namaNya didalamnya,” termasuk dalam maknanya adalah seluruh shalat, baik yang wajib ataupun yang Sunnah, membaca al-qur’an, bertasbih, tahlil, dan macam-macam dzikir yang lain, mempelajari ilmu dan mengajarkannya, saling mendiskusikan ilmu, I’tikaf, dan ibadah-ibadah yang lain yang dilakukan dimasjid. Karenanya, memakmurkan masjid itu ada dua macam; memakmurkan bangunan dan pemeliharaannya secara fisik, dan menyemarakkannya dengan cara berdzikir kepada Allah yaitu dengan cara shalat dan yang lain. Yang terakhir inilah yang paling baik diantara keduanya. Oleh sebab itu, telah disyariatkan shalat lima waktu dan shalat jum’at di masjid, secara wajib menurut pendapat mayoritas para ulama, dan Sunnah menurut ulama yang lainnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nur ayat 36: Oleh karena cahaya iman dan Al Qur’an sebabnya paling sering muncul di masjid, maka Allah menyebutkan masjid itu sambil meninggikannya. Masjid adalah tempat yang paling dicintai Allah Subhaanahu wa Ta'aala. Rasulullah shallallahu 'alaihi wa sallam bersabda: « أَحَبُّ الْبِلاَدِ إِلَى اللَّهِ مَسَاجِدُهَا وَأَبْغَضُ الْبِلاَدِ إِلَى اللَّهِ أَسْوَاقُهَا » . “Tempat yang paling dicintai Allah adalah masjid dan tempat yang paling dibenci Allah adalah pasar.” (HR. Muslim) Kedua hal ini “meninggikan dan menyebut nama Allah” adalah keseluruhan hukum-hukum masjid. Termasuk ke dalam meninggikannya adalah membangunnya, menyapunya, membersihkannya dari kotoran dan najis, serta menjaganya dari orang gila dan anak-anak yang biasa tidak menjaga dirinya dari najis (namun hadits yang memerintahkan menjauhkan orang gila dan anak kecil dari masjid adalah dha’if), demikian juga menjaganya dari orang kafir dan dari membuat kegaduhan di dalamnya serta mengeraskan suara selain dzikrullah. Termasuk ke dalam menyebut nama Allah adalah semua shalat, yang fardhu maupun yang sunat, membaca Al Qur’an, berdzikr, mendalami ilmu dan mengajarkannya, mudzaakarah (mengingat-ingat pelajaran) di sana, i’tikaf dan ibadah lainnya yang dilakukan di masjid. Oleh karena itu, memakmurkan masjid terbagi dua; memakmurkan dalam arti membangunkannya dan memeliharanya, dan memakmurkannya dengan dzikrullah, seperti shalat dan lain-lain. Yang kedua lebih utama, bahkan sebagai tujuannya. Oleh karenanya menurut sebagian ulama wajib shalat yang lima waktu dan shalat Jum’at di masjid (tidak di selain masjid), sedangkan menurut yang lain hanya sunat saja. Faedah: Sebagaimana dijelaskan, bahwa membangun masjid termasuk ke dalam makna ‘memakmurkan masjid’, maka dari itu pahala orang yang membangunnya begitu besar, Allah berjanji akan membangunkan rumah untuknya di surga sebagaimana dalam hadits riwayat Bukhari dan Muslim. Masjid memiliki peranan penting dalam membina umat dan masyarakat dan merupakan bangunan yang diberkahi, dari masjidlah kebaikan muncul dan tersebar. Oleh karena itulah, saat Rasulullah shallallahu 'alaihi wa sallam hijrah ke Madinah, maka bangunan yang pertama kali Beliau bangun adalah masjid. Di masjid itulah, Beliau mendidik umat, mengajarkan kepada mereka aqidah yang benar, ibadah yang benar, akhlak yang benar dan bermu'amalah yang benar sehingga para sahabat Beliau menjadi umat yang terbaik. Allah Subhaanahu wa Ta'aala berfirman, \"Kamu adalah umat yang terbaik yang dilahirkan untuk manusia, menyuruh kepada yang ma'ruf, dan mencegah dari yang munkar, dan beriman kepada Allah…dst.\" (Terj. Ali Imran: 110) Selanjutnya Allah Subhaanahu wa Ta'aala memuji orang-orang yang memakmurkannya dengan ibadah. Yang bertasbih ialah laki-laki yang tersebut pada ayat 37 berikut. Disebutkan kedua waktu ini secara khusus karena keutamaannya dan karena longgar dan mudahnya beribadah dilakukan di waktu itu. Oleh karena itu, disyariatkan dzikr pagi dan petang, yang di antaranya adalah mengucapkan subhaanallahi wa bihamdih sebanyak 100 kali. Rasulullah shallallahu 'alaihi wa sallam bersabda: « مَنْ قَالَ حِينَ يُصْبِحُ وَحِينَ يُمْسِى سُبْحَانَ اللَّهِ وَبِحَمْدِهِ مِائَةَ مَرَّةٍ . لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلاَّ أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ عَلَيْهِ » . “Barang siapa yang berkata di waktu pagi dan sore hari, “Subhaanallahi wa bihamdih.” Sebanyak 100 kali, maka tidak ada seorang pun pada hari kiamat yang datang membawa amalan yang lebih utama daripada apa yang dia bawa kecuali seorang yang mengucapkan sebanyak itu atau lebih.” (Muslim) Arti Subhaanallah bihamdih adalah aku menyucikan Allah dari semua kekurangan dan memuji-Nya dengan semua kesempurnaan. Ada pula yang menafsirkan tasbih di sini dengan shalat. Ibnu Abbas radhiyallahu 'anhuma berkata, “Semua tasbih dalam Al Qur’an adalah shalat.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nur Ayat 36",
    "description": "Cahaya itu Allah pancarkan di langit dan bumi, seperti disebutkan dalam ayat sebelumnya. Namun, tidak semua orang dapat meraih cahaya itu. Cahaya itu di rumah-rumah ibadah yang di sana telah diperintahkan Allah untuk memuliakan dan menyebut nama-Nya; di sana bertasbih-lah orang-orang yang menyucikan nama-Nya melalui berbagai ibadah, seperti azan, salat, dan tilawah Al-Qur'an, pada waktu pagi dan petang, 37. Mereka yang bertasbih itu adalah orang-orang yang hatinya tidak dilalaikan oleh perdagangan dan jual beli dari mengingat Allah, betapa pun besar dan penting usaha mereka; dan tidak pula lalai dari melaksanakan salat dengan baik, benar, serta konsisten, dan demikian pula menunaikan zakat secara sempurna. Mereka takut kepada hari ketika pada hari itu hati bergoncang antara harap dan cemas, dan penglihatan menjadi gelap akibat kecemasan dan ketakutan yang amat besar terkait tempat kembali yang belum diketahuinya, antara surga atau neraka. Itulah hari kiamat. 37. Mereka yang bertasbih itu adalah orang-orang yang hatinya tidak dilalaikan oleh perdagangan dan jual beli dari mengingat Allah, betapa pun besar dan penting usaha mereka; dan tidak pula lalai dari melaksanakan salat dengan baik, benar, serta konsisten, dan demikian pula menunaikan zakat secara sempurna. Mereka takut kepada hari ketika pada hari itu hati bergoncang antara harap dan cemas, dan penglihatan menjadi gelap akibat kecemasan dan ketakutan yang amat besar terkait tempat kembali yang belum diketahuinya, antara surga atau neraka. Itulah hari kiamat."
  }
]