[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Yaitu orang-orang yang tidak dilalaikan oleh perniagaan dan perdagangan dari mengingat Allah, menegakkan shalat, dan menunaikan zakat kepada orang-orang yang berhak menerimanya, mereka takut kepada Hari Kiamat yang hati akan tergoncang antara harapan untuk selamat dan takut dari kebinasaan, dan pandangan-pandangan berbolak-bailk pada hari itu untuk melihat ke mana tempat kembali mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "37. (Mereka yang mendirikan salat di masjid itu adalah) laki-laki yang tidak dilalaikan oleh perniagaan dari mengingat Allah, mendirikan salat secara sempurna, dan dari membayarkan zakat. Mereka takut akan hari Kiamat, hari saat hati menjadi goncang antara mengharapkan keselamatan dari azab, dan rasa takut terhadap azab tersebut; serta penglihatan juga menjadi goncang, senantiasa memandang ke arah mereka digiring."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "37-38. Allah memuji hamba-hamba-Nya yang memakmurkan masjid dengan zikir dan shalat; keuntungan perdagangan tidak melalaikan mereka dari berzikir kepada Allah dengan merendahkan suara atau mengeraskannya, dan tidak melalaikan mereka dari menjaga pelaksanaan shalat pada waktunya dan penunaian zakat bagi orang yang berhak menerimannya. Mereka takut dari hari kiamat yang membuat hati bergoncang antara mengharap rahmat dan takut dari siksaan, dan membuat pandangan terbelalak ketika melihat kengeriannya sambil menunggu tempat kesudahannya. Hal ini agar Allah memberi pahala terbaik atas amal shalih yang telah mereka kerjakan and menambah kenikmatan bagi mereka. Allah memberi hamba-Nya yang Dia kehendaki dengan pemberian yang banyaknya tak terkira."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "37. رِجَالٌ لَّا تُلْهِيهِمْ تِجٰرَةٌ وَلَا بَيْعٌ (laki-laki yang tidak dilalaikan oleh perniagaan dan tidak (pula) oleh jual beli) Ibnu Abbas berkata: mereka adalah para lelaki yang mengharap karunia Allah dengan jual beli, namun jika mereka mendengar azan sebagai panggilan untuk shalat mereka meletakkan apa yang ada di tangan mereka kemudian berdiri dan berangkat ke masjid untuk menunaikan shalat. عَن ذِكْرِ اللهِ(dari mengingati Allah) Dengan nama-nama-Nya yang baik. وَإِقَامِ الصَّلَوٰةِ (dan (dari) mendirikan sembahyang) Yakni mendirikannya pada waktunya masing-masing tanpa menunda-nunda. وَإِيتَآءِ الزَّكَوٰةِ ۙ (dan (dari) membayarkan zakat) Yakni zakat yang wajib mereka tunaikan. يَخَافُونَ يَوْمًا(Mereka takut kepada suatu hari) Yakni hari kiamat. تَتَقَلَّبُ فِيهِ الْقُلُوبُ (yang (di hari itu) hati menjadi goncang) Yakni hati menjadi terombang-ambing antara harapan untuk dapat selamat dan takut dari kebinasaan. وَالْأَبْصٰرُ (begitu pula penglihatan) Adapun penglihatan yang tergoncang adalah ketika mereka melihat dari mana mereka berasal dan ke mana mereka akan di bawa."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Penutupan tempat-tempat dagang pada waktu shalat; adalah sebagai penghormatan terhadap syi'ar yang mulia ini, dan juga sebagai motifasi bagi kaum muslimin untuk shalat berjamaah adalah suatu hal yang menjadi kebiasaan para Salaf."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "37. Laki-laki yang tidak disibukkan oleh perniagaan dan akad jual beli bertasbih kepada Allah di dalam masjid-masjid. Tidak ada kesibukan lain yang mengganggunya dari berdzikir kepada Allah dalam hati dan lisan, mendirikan shalat pada waktunya, dan menunaikan zakat bagi orang-orang yang berhak menerimanya. Mereka takut pada hari kiamat yang dapat membuat hati terganggu antara takut dan berharap, begitu juga penglihatan karena sangat khawatir tentang tempt kembali yang belum diketahui."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Orang-orang yang tidak dilalaikan} tidak disibukkan {oleh perniagaan} perdagangan {dan jual beli dari mengingat Allah, mendirikan shalat, dan menunaikan zakat itu Mereka takut kepada hari ketika menjadi terguncang} kacau dan berubah-ubah {hari dan penglihatan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "37 kemudian Allah memuji hamba-hambaNya yang telah memakmurkan masjid-masjidNya dengan ibadah. Dia berfirman, ”Dia bertasbih kepada Allah,” secara ikhlas ”pada waktu pagi,” yaitu pada permulaan hari ”dan waktu petang,” penghujung siang, “laki-laki,” Allah mengkhususkan dua waktu ini karena kemuliaan keduanya, kemudahan dan kegampangan untuk beribadah kepada Allah pada dua waktu itu. Termasuk dalam hal ini, bertasbih ketika shalat dan lainnya. Oleh karena itu, disyariatkan dzikir pada waktu pagi dan sore hari dan wirid-wiridnya yang di baca di pagi hari dan sore hari. Pengertiannya, kaum lelaki bertasbih kepadaNya pada waktu itu. Siapakah kaum lelaki yang dimaksud? Mereka bukanlah orang-orang yang lebih memperhatikan dunia (daripada Rabb mereka), yang memiliki kelezatan-kelezatan, perniagaan dan usaha-usaha yang menyibukkan (manusia) dari Allah, yaitu ‘(laki-laki) yang tidak dilalaikan oleh perniagaan,” ini mencakup setiap pekerjaan yang ditunjukkan untuk mencari timbal-balik, maka jadilah firman Allah, ”dan tidak (pula) oleh jual beli,” masuk dalam kategori ‘Athf al-khas ala al-am’ (menghubungkan kata yang khusus dengan jenis umumnya), karena banyaknya kesibukkan dalam perdagangan daripada yang lainnya. Walaupun para laki-laki itu berdagang dan jual-beli, yaitu menjalankan urusan yang tidak dilarang, akan tetapi perkara-perkara itu tidak melalikan mereka sampai menyebabkan mereka lebih mengutamakan dan mementingkannya daripada “mengingat Allah, menegakkan shalat, dan menunaikan zakat,” bahkan mereka menjadikan ketaatan dan ibadah kepada Allah sebagai sasaran bidikan dan penghujung tujuan mereka. Maka, setiap urusan yang menghalangi mereka dari tujuan mereka, niscaya akan mereka tampik. Tatkala menyampingkan dunia akan berat dirasa kebanyakan jiwa manusia, sementara kecintaan kepada pekerjaan dengan berbagai perniagaannya menjadi urusan yang disukai, maka sangatlah sulit untuk melepaskannya pada umumnya dan tertuntut untuk bekerja keras untuk mendahulukan hak Allah daripada itu, maka Allah menyebutkan sesuatu yang dapat merangsang kepadanya, sebagai bentuk ajakan sekaligus ancaman dariNya. Allah berfirman, “mereka takut pada suatu hari yang (di hari itu) hati dan penglihatan menjadi goncang,” karena dahsyatnya kengerian dan membuat hati dan badan merinding dengan kejadian itu. Oleh sebab itu, mereka takut akan hari itu, hingga mudah bagi mereka untuk beramal dan meninggalkan sesuatu yang dapat menyibukkan dirinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nur ayat 37: Mencakup semua bisnis dan usaha yang menghasilkan keuntungan. Dihubungkan yang khusus dengan yang umum sebelumnya, karena yang biasa terjadi adalah jual beli. Mereka itu meskipun berdagang dan berjual beli, namun tidak dibuat lalai olehnya sampai lupa mengingat Allah. Bahkan mereka menjadikan ketaatan kepada Allah sebagai tujuan dan maksud mereka, jika ada sesuatu yang menghalangi mereka dari menjalankan ketaatan kepada Allah, maka mereka tolak. Oleh karena meninggalkan dunia sangat berat bagi jiwa dan meraihkan keuntungan sangat dicintai olehnya dan berat untuk ditinggalkan, maka disebutkan targhib (pendorong) mereka melakukannya sekaligus tarhibnya. Mereka takut kepada hari yang saking dahsyatnya sampai membuat hati dan pandangan berguncang, sehingga mereka pun ringan dalam beramal dan meninggalkan kesibukannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nur Ayat 37",
    "description": "Mereka yang bertasbih itu adalah orang-orang yang hatinya tidak dilalaikan oleh perdagangan dan jual beli dari mengingat Allah, betapa pun besar dan penting usaha mereka; dan tidak pula lalai dari melaksanakan salat dengan baik, benar, serta konsisten, dan demikian pula menunaikan zakat secara sempurna. Mereka takut kepada hari ketika pada hari itu hati bergoncang antara harap dan cemas, dan penglihatan menjadi gelap akibat kecemasan dan ketakutan yang amat besar terkait tempat kembali yang belum diketahuinya, antara surga atau neraka. Itulah hari kiamat. 37. Mereka yang bertasbih itu adalah orang-orang yang hatinya tidak dilalaikan oleh perdagangan dan jual beli dari mengingat Allah, betapa pun besar dan penting usaha mereka; dan tidak pula lalai dari melaksanakan salat dengan baik, benar, serta konsisten, dan demikian pula menunaikan zakat secara sempurna. 38. Orang-orang yang hatinya tidak terlalaikan oleh kesibukan duniawi itu berbuat demikian agar Allah memberi balasan kepada mereka dengan balasan yang terbaik atas apa yang telah mereka kerjakan, dan agar dia menambah karunia-Nya kepada mereka selain balasan yang telah dijanjikan itu"
  }
]