[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang yang melontarkan tuduhan keji kepada pribadi-pribadi yang bersih, baik dari kaum lelaki maupun kaum wanita, tanpa ada empat orang saksi yang adil yang menyertai mereka (para penuduh), maka deralah mereka dengan cambuk sebanyak 80 kali, dan janganlah kalian terima persaksian mereka selamanya.dan mereka itu adalah orang-orang yang keluar dari ketaatan kepada Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Dan orang-orang yang menuduh para wanita baik-baik berzina, dan para lelaki baik-baik berzina, lalu mereka tidak mendatangkan empat orang saksi atas tuduhan tersebut, maka deralah para penuduh itu -wahai para penguasa- dengan delapan puluh kali dera, dan janganlah kamu terima kesaksian mereka buat selama-lamanya. Dan mereka yang menuduh orang-orang yang baik-baik itulah orang-orang yang fasik lagi keluar dari ketaatan pada Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "4-5. Dan orang-orang yang menuduh perbuatan zina kepada laki-laki dan perempuan yang menjaga kehormatan, namun mereka tidak membuktikan perzinaannya dengan empat orang saksi yang adil, maka cambuklah mereka 80 kali cambukan, dan janganlah kalian menerima kesaksian mereka selamanya selama mereka belum bertaubat kepada Allah. Mereka yang jauh dari kebenaran itu telah berpaling dari ketaatan kepada Allah, kecuali mereka yang telah bertaubat dari penuduhan, menyesal, dan menarik tuduhannya, serta memperbaiki amalan dan segala yang telah mereka rusak. Sungguh Allah Maha Mengampuni dosa mereka, dan Maha Mengasihi mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. وَالَّذِينَ يَرْمُونَ الْمُحْصَنٰتِ (Dan orang-orang yang menuduh wanita-wanita yang baik-baik (berbuat zina)) Tuduhan perbuatan keji ini disebut dengan ‘qadzaf’. Makna (المحصنات) adalah para perempuan yang beriman dan selalu menjaga kehormatan mereka. Penyebutan ini dikhususkan bagi mereka karena tuduhan yang diarahkan kepada mereka menjadi lebih buruk dan aibnya lebih besar. Dan kaum lelaki juga mengikuti hukum bagi kaum perempuan dalam hal ini tanpa ada perbedaan pendapat di antara para ulama. Para ulama memiliki banyak pembahasan yang panjang mengenai syarat orang tertuduh dan penuduh yang mungkin dapat di kitab-kitab fiqih. Tidak ada hukuman bagi orang yang menuduh (qadzaf) orang kafir laki-laki maupun perempuan. ثُمَّ لَمْ يَأْتُوا۟ بِأَرْبَعَةِ شُهَدَآء(dan mereka tidak mendatangkan empat orang saksi) Yakni para saksi yang menyaksikan terjadinya zina. Jika para saksi tidak mencapai empat orang maka mereka akan dianggap sebagai para penuduh, dan pada kekhilafahan Umar bin Khattab ia mencambuk tiga saksi yang bersaksi bahwa Mughirah melakukan zina. فَاجْلِدُوهُمْ ثَمٰنِينَ جَلْدَةً(maka deralah mereka (yang menuduh itu) delapan puluh kali dera) Yakni cambuklah masing-masing mereka sebanyak 80 kali. وَلَا تَقْبَلُوا۟ لَهُمْ شَهٰدَةً أَبَدًا ۚ( dan janganlah kamu terima kesaksian mereka buat selama-lamanya) Yakni jadikan bagi mereka dua hal, yaitu hukuman cambuk dan tidak diterimanya kesaksian mereka. وَأُو۟لٰٓئِكَ هُمُ الْفٰسِقُونَ(Dan mereka itulah orang-orang yang fasik) Kefasikan yakni berpaling dari ketaatan Allah. Orang-orang yang menuduh orang lain melakukan zina akan dikelompokkan ke dalam golongan orang-orang fasik."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Orang-orang yang menuduh wanita-wanita yang baik-baik berbuat zina dan mereka tidak mendatangkan empat orang saksi, maka deralah mereka yang menuduh itu delapan puluh kali dera, dan janganlah kamu terima kesaksian mereka buat selama-lamanya. Dan mereka itulah orang-orang yang fasik yang keluar dari ketaatan kepada Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang menuduh} menuduh berzina {perempuan yang baik-baik} perempuan muslimah yang bebas dan suci {dan mereka tidak mendatangkan empat orang saksi, maka cambuklah mereka delapan puluh kali cambukan dan janganlah menerima kesaksian mereka selamanya. Mereka itulah orang-orang yang fasik} orang-orang yang tidak menaati Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4. setelah membesarkan masalah perzinaan dengan (penetapan) kewajiban hukuman cambuk (seratus kali), dan dengan penegakkan hukuman rajam bila pelaku adalah muhsan (sudah menikah), serta (larangan) tidak boleh mengadakan hubungan dan pergaulan bersamanya dalam bentuk apapun yang mana seseorang tidak selamat dari (imbas) kejelekannya, Allah menerangkan bahaya besar yang muncul dari kelancangan menjatuhkan harga diri orang lain dengan tuduhan perzinaan. Allah berfirman, ”dan orang-orang yang menuduh wanita-wanita yang baik-baik,” yaitu wanita-wanita merdeka yang terjaga kehormatannya. Demikian juga berlaku pada lelaki-lelaki (yang baik-baik). Tidak ada bedanya antara kedua belah pihak. Yang dimaksudkan dengan kata menuduh (disini) yakni tuduhan berzina. Berdasarkan susunan kalimat ayat ini yaitu, “kemudian mereka tidak mendatangkan,” atas tuduhan yang mereka lontarkan “empat orang saksi,” yaitu para lelaki yang adil (bersih) yang mempersaksikannya secara meyakinkan “maka deralah mereka (yang menuduh itu) delapan puluh kali dera,” dengan cambuk ukuran sedang yang dapat membekaskan rasa sakit pada tubuhnya, (namun) tidak berlebihan dalam memukul, sehingga bisa membinasakannya. Pasalnya, tujuannya adalah mengenakan sanksi, bukan membinasakan. Dalam ayat ini tertuang penetapan hukuman atas tuduhan zina (yang dilancarkan pada orang lain). Dengan catatan, pihak yang tertuduh sebagaimana yang difirmankan oleh Allah, seorang yang berstatus muhsan (sudah pernah menikah) lagi Mukmin. Sedangkan menuduh orang yang belum pernah menikah, maka menyebabkan hukuman ta’zir (sangsi yang ditetapkan penguasa). “dan janganlah kamu terima kesaksian mereka buat selama-lamanya,” maksudnya, mereka dikenai hukuman lainnya, yakni persaksian qadzif (orang yang menuduh) tidak diterima. Kendatipun dia telah menjalani hukuman atas tuduhannya sehingga bertaubat, sebagaimana yang akan dipaparkan. “dan mereka itulah orang-orang yang fasik,” yaitu orang-orang yang keluar dari ketaatan kepada Allah, yang kejelekan mereka telah merajalela. Realita yang demikian ini disebkan oleh pelanggaran mereka terhadap hal-hal yang diharamkan oleh Allah, penodaan terhadap saudaranya, menggiring orang-orang untuk memperbincangkan apa yang dia katakan, pemutusan tali persaudaraan yang sudah Allah canangkan diantara para kaum Mukminin, tendensitas terhadap penyebaran tindakan keji di tengah kaum mukminin. Hal ini menjadi bukti bahwa perbuatan qadzaf (menuduh orang lain berzina) merupakan bagian dari dosa besar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nur ayat 4: Setelah Allah Subhaanahu wa Ta'aala menerangkan begitu besarnya keburukan perkara zina sehingga wajib didera, dan dirajam jika sudah menikah, demikian pula tidak boleh menemaninya serta bergaul dengannya yang seseorang dapat terimbas oleh keburukannya, maka Allah Subhaanahu wa Ta'aala menerangkan besarnya keburukan merusak kehormatan orang lain dengan menuduhnya berzina. Yang dimaksud wanita-wanita yang baik di sini adalah wanita-wanita yang suci, akil (berakal), balig dan muslimah. Tetapi jika wanita yang dituduh itu bukan muhshan, yakni kurang baik, maka cukup penuduhnya diberi ta’zir, demikian menurut Syaikh As Sa’diy. Yang melihat langsung perzinaan itu. Yakni dengan cambuk yang pertengahan, yang membuatnya merasakan sakit tetapi tidak membuatnya binasa. Karena mengerjakan dosa besar itu, di mana di dalamnya terdapat pelanggaran terhadap larangan Allah, merusak kehormatan saudaranya, menyebarkan isu buruk terhadapnya serta memutuskan persaudaraan yang telah Allah ikat serta berkeinginan agar perbuatan keji tersebar di tengah-tengah kaum mukmin. Ayat ini menunjukkan bahwa menuduh zina merupakan dosa yang besar."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nur Ayat 4",
    "description": "4-5. Usai menjelaskan hukuman bagi pezina dan hukum menikahinya, Allah lalu menguraikan sanksi hukum terhadap orang yang menuduh orang lain berbuat zina. Dan orang-orang yang menuduh perempuan-perempuan yang baik telah berbuat zina, dan mereka tidak dapat mendatangkan empat orang saksi yang menjadi saksi atas kebenaran tuduhannya di hadapan pengadilan, maka deralah mereka, wahai kaum mukmin melalui penguasa kamu, sebanyak delapan puluh kali. Hukuman ini berlaku jika penuduh adalah orang merdeka. Jika ia adalah seorang hamba sahaya maka deralah ia empat puluh kali (lihat juga: an-nis'/4: 25). Dan ja-nganlah kamu terima kesaksian mereka untuk selama-lamanya. Mereka itulah orang-orang yang fasik. Ketentuan ini berlaku atas semua orang yang berbuat demikian, kecuali mereka yang bertobat, menyesali perbuatannya, dan bertekad tidak akan mengulanginya setelah itu, yaitu setelah menerima hukuman itu, dan mereka membuktikan tobat mereka de-ngan memperbaiki diri dan beramal saleh. Jika mereka melakukannya maka sungguh, Allah maha pengampun, maha penyayang"
  }
]