[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Atau perbuatan-perbuatan mereka itu diumpamakan seperti kegelapan-kegelapan di laut yang dalam, yang di atasnya ada gelombang, dan tertutupi gelombang lainnya, dan di atasnya terdapat awan tebal. Kegelapan-kegelapan pekat, yang sebagiannya berada di atas sebagian yang lain. Apabila orang yang melihat mengeluarkan tangannya, ia hampir-hampir tidak dapat melihatnya, lantaran pekatnya kegelapan-kegelapan itu. Orang-orang kafir telah bertumpuk-tumpuk pada mereka kegelapan syirik, kesesatan dan rusaknya amal perbuatan mereka. Karenanya, barangsiapa yang Allah tidak menjadikan cahaya baginya, melalui kitab suciNya dan sunnah NabiNya yang dapat ia jadikan sumber petunjuk, maka tidak ada pemberi petunjuk baginya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "40. Atau amalan mereka seperti kegelapan di lautan yang dalam, yang diliputi oleh ombak, di atas ombak itu ada ombak lagi, di atasnya lagi ada awan yang menghalangi dari petunjuk bintang-bintang; kegelapan yang berlapis-lapis. Apabila ia mengeluarkan tangannya dalam kondisi gelap ini, ia tidak dapat melihatnya lantaran gelapnya. Demikianlah perumpamaan orang kafir yang berada dalam kegelapan; kejahilan, kebingungan, dan hatinya terkunci. Siapa yang tiada diberi petunjuk dan ilmu tentang kitab-Nya oleh Allah maka ia tidak akan mempunyai petunjuk yang bisa menunjukinya, dan tidak pula mempunyai kitab yang menerangi jalannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "40. Atau amalan mereka seperti kegelapan yang berlapis-lapis dalam dasar lautan; di atasnya terdapat ombak-ombak yang saling bertumpang tindih, dan di atas ombak yang paling tinggi terdapat awan pekat yang menghalangi penglihatan, hingga ketika dia mengeluarkan tangannya hampir-hampir dia tidak dapat melihatnya. Demikianlah orang kafir terjerumus di dalam kesesatan dan kemaksiatan. Dan barangsiapa yang tidak Allah beri petunjuk kepada keimanan maka tidak ada yang dapat memberinya petunjuk."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "40. أَوْ كَظُلُمٰتٍ (Atau seperti gelap gulita) Allah membuat perumpamaan lain dalam amalan orang-orang kafir, yakni amalan mereka seperti kegelapan. فِى بَحْرٍ لُّجِّىٍّ(di lautan yang dalam) Yakni lautan yang tidak diketahui kedalamannya karena begitu dalam. يَغْشَىٰهُ مَوْجٌ(yang diliputi oleh ombak) Yakni lautan itu diliputi oleh ombak sampai tertutup seluruhnya oleh ombak tersebut. مِّن فَوْقِهِۦ مَوْجٌ(yang di atasnya ombak (pula)) Yakni diatas ombak itu terdapat ombak yang lain. مِّن فَوْقِهِۦ سَحَابٌ ۚ( di atasnya (lagi) awan) Sehingga terkumpul pada mereka ketakutan pada lautan dan ombak-ombaknya, serta awan tinggi di atasnya sebab awan itu menutupi bintang-bintang yang mereka jadikan sebagai penunjuk arah di lautan. ظُلُمٰتٌۢ بَعْضُهَا فَوْقَ بَعْضٍ(gelap gulita yang tindih-bertindih) Yakni gelapnya kejahilan, keraguan, kebingungan, serta hati yang tertutup dan terkunci. إِذَآ أَخْرَجَ(apabila dia mengeluarkan tangannya) Yakni orang yang berada dalam kegelapan di lautan itu. يَدَهُۥ لَمْ يَكَدْ يَرَىٰهَا ۗ(tiadalah dia dapat melihatnya) Ia tidak dapat melihatnya kecuali dengan susah payah. وَمَن لَّمْ يَجْعَلِ اللهُ لَهُۥ نُورًا فَمَا لَهُۥ مِن نُّورٍ((dan) barangsiapa yang tiada diberi cahaya oleh Allah tiadalah dia mempunyai cahaya sedikitpun) Dan barangsiapa yang tidak diberi Allah hidayah maka dia tidak akan mendapatkan hidayah. Kegelapan yang ada dalam hati orang kafir ini adalah kebalikan dari cahaya yang ada dalam hati orang beriman, hal ini telah dijelaskan seperti pada ayat: 35."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Al-Qur'an tidak menunjukkan hal berharga dari rahasia-rahasianya kecuali kepada orang-orang yang diizinkan oleh Allah عز وجل, dan izin itu tidak akan diberikan bagi orang-orang yang hatinya masih terpaut kepada kesombongan dan hawa nafsu,"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "40. Atau amal perbuatan orang-orang kafir itu menyerupai kegelapan yang pekat di laut yang sangat dalam yang tertutup ombak, di atas ombak itu ada ombak lainnya dan di atas ombak yang tertinggi ada awan-awan tebal. Kegelapan berlapis tiga atau empat, yaitu kegelapan laut, kegelapan ombak pertama dan kedua, kegelapan awan, dan kegelapan malam. Hal itu menyerupai kegelapan dari kebodohan, penolakan, keburukan, segel dan kunci atas hati orang kafir. Ketika orang yang melihat menjulurkan tangannya ke dalam kegelapan-kegelapan ini, maka dia hamper tidak bisa melihatnya, meskipun itu adalah sesuatu yang paling dekat dengannya. Dan orang yang tidak diberi hidayah oleh Allah dalam hatinya maka dia tidak diberi petunjuk, yaitu orang yang tidak dituntun Allah menuju sebab-sebab suatu hidayah, maka dia buka orang yang ditunjukkan. Kegelapan-kegelapan ini menutupi hati orang kafir dan sebagai kebalikan dari cahaya-cahaya dalam hati orang mukmin di ayat sebelumnya {Matsalu Nurihi} [35]."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Atau seperti gelap gulita} atau perumpamaan amal perbuatan mereka dalam hal kerusakannya yaitu seperti kegelapan {di lautan yang dalam} dalam {yang diliputi} lautan yang dalam itu diliputi {oleh gelombang demi gelombang yang di atasnya ada awan gelap. Itulah kegelapan yang berlapis-lapis} kegelapan awan, kegelapan ombak, dan kegelapan laut {Apabila dia mengeluarkan tangannya, dia benar-benar tidak dapat melihatnya} dia benar-benar tidak bisa melihatnya karena sangat gelap {Siapa yang tidak diberi cahaya oleh Allah, maka dia tidak ada baginya cahaya sedikit pun"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "40 perumpamaan kedua tentang kebatilan amalan orang-orang kafir “atau seperti gelap gulita di lautan yang dalam,” dasarnya dalam dan jangkauannya luas “yang diliputi oleh ombak, yang diatasnya ombak (pula), diatasnya (lagi) awan; gelap gulita yang bertindih-tindih,” kegelapan laut yang dalam, kemudian dipermukaannya kegelapan gelombang yang bergulung-gulung, dan (dinaungi) di atasnya kegelapan awan yang hitam, lantas diselimuti kegelapan malam yang pekat. Maka, kegelapan semakin parah sekali, dimana keadaan seseorang pada saat itu “apabila dia mengeluarkan tanggannya, tiadalah dia dapat melihatnya,” walaupun tangannya begitu dekat dengan dirinya. Lalu bagaimana dengan benda lain? Begitu pula kaum kafir, kegelapan telah bertumpuk-tumpuk dalam hati mereka; sebuh kegelapan sifat bawaan yang tidak mengandung kebaikan sama sekali, ditambah dengan kegelapan kekufuran (nya), disusul kegelapan kebodohan(nya), dan dilanjutkan oleh kegelapan dari perbuatan yang muncul sebagaimana yang telah disebutkan. Merekapun mengalami kebingungan dalam kegelapannya, tidak bisa melihat dalam kesesatan mereka, membelakangi jalan yang lurus, mondar-mandir pada jalur-jalur kekeliruan dan kesesatan. Demikian ini, lantaran Allah telah menelantarkan mereka tanpa hidayah dan tidak memberikan bagian dari cahayaNya kepada mereka. “(dan) barangsiapa yang tiada diberi cahaya (petunjuk) oleh Allah, tiadalah dia mempunyai cahaya sedikitpun,” karena dirinya zhalim lagi bodoh, tidak ada kebaikan dan cahaya padanya kecuali apa yang telah Allah berikan dan anugerahkan. Dua permisalan ini mengandung kemungkinan berlaku untuk amalan seluruh orang kafir. Keduanya bersesuain dengannya (hakikat amalan orang-orang kafir). Allah telah menyebutkannya secara terperinci lantaran perbedaan karakternya. Dimungkinkan juga, setiap perumpamaan itu diperuntukkan bagi kelompok dan golongan tertentu. Perumpamaan pertama untuk orang-orang yang diikuti dan permisalan yang kedua bagi para pengikutnya. Wallahu’alam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nur ayat 40: Dan berada dalam kegelapan malam. Padahal tangannya dekat dengannya, lalu bagaimana dengan yang berada jauh? Demikianlah orang-orang kafir, kegelapan di atas kegelapan menumpuk di hati mereka; gelapnya tabiat, di atasnya lagi gelapnya kekafiran, di atasnya lagi gelapnya kebodohan dan di atasnya lagi gelapnya amal yang muncul daripadanya. Sehingga mereka pun berada dalam kegelapan dan kebingungan, karena Allah telah meninggalkan mereka dan tidak memberikan cahaya-Nya. Kedua perumpamaan ditujukan kepada amal orang-orang kafir, atau yang satu untuk salah satu golongan orang kafir, sedangkan yang satu lagi untuk golongan yang lain; perumpamaan yang pertama ditujukan kepada orang-orang yang diikuti, sedangkan perumpamaan yang kedua ditujukan kepada orang-orang yang mengikuti, wallahu a’lam. Oleh karena itu, barang siapa yang tidak diberi petunjuk oleh Allah, maka ia tidak akan memperoleh petunjuk."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nur Ayat 40",
    "description": "Allah menyajikan perumpamaan lain terkait betapa sia-sianya amal orang kafir itu. Atau keadaan orang-orang kafir itu seperti gelap gulita di lautan yang dalam, yang tidak dapat dijangkau kedalamannya, yang diliputi oleh gelombang demi gelombang, di atasnya yaitu di atas gelom-bang yang bertumpuk dan bergulung-gulung itu ada lagi awan gelap yang menutupi sinar matahari. Itulah gelap gulita yang berlapis-lapis; perpaduan antara laut yang begitu dalam, ombak yang bergulung-gulung, dan awan yang kelam. Begitu pekat kegelapan itu hingga apabila dia mengeluarkan tangannya untuk didekatkannya ke mata, hampir saja dia tidak dapat melihatnya. Barang siapa tidak diberi cahaya petunjuk oleh Allah maka dia tidak mempunyai cahaya sedikit pun. 41. Allah menguraikan bukti kebesaran dan kekuasaan-Nya pada ayat berikut agar manusia beribadah kepada-Nya dan mengakui keesaan-Nya. Tidakkah engkau tahu, wahai nabi Muhammad, bahwa kepada Allah-lah bertasbih apa yang di langit dan di bumi dengan keadaan atau cara masing-masing, dan bersama mereka bertasbih juga burung yang mengembangkan sayapnya; tidak ada yang mencegahnya jatuh kecuali atas kuasa dan izin Allah. Masing-masing makhluk itu sungguh telah me-ngetahui cara berdoa dan bertasbih-Nya sendiri, tetapi kamu tidak me-ngetahuinya (lihat juga: surah al-isr'/17: 44). Allah maha mengetahui apa yang mereka kerjakan. Allah pada ayat ini secara istimewa menyebut burung karena penciptaan burung dan kemampuannya terbang terasa nyata menunjukkan keajaiban penciptaan dan kesempurnaan Allah."
  }
]