[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah kamu (wahai Rasul) belum mengetahui bahwa sesungguhnya semua yang ada di langit dan di bumi dari makhluk-makhluk dan burung-burung yang melebarkan sayap-sayapnya di langit, bertasbih menyucikan Tuhannya? Setiap makhluk, Allah telah memberinya petunjuk bagaimana ia shalat dan bertasbih kepadaNya. Dan Dia Maha Mengetahui, tahu semua yang diperbuat hamba-hambaNya yang tengah shalat dan makhluk yang tengah bertasbih, tidak ada sesuatu dari mereka tersembunyi bagiNya sedikit pun. Dan Dia akan membalas mereka dengan itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "41. Tidaklah kamu tahu -wahai Rasulullah- bahwasanya Allah, kepada-Nya bertasbih semua makhluk yang di langit dan di bumi dan juga burung dengan mengembangkan sayapnya di udara. Masing-masing makhluk tersebut, Allah mengetahui siapa yang salat di antara mereka seperti manusia, dan Allah juga mengetahui tasbih makhluk yang bertasbih di antara mereka seperti tasbih burung. Allah Maha Mengetahui apa yang mereka kerjakan, tidak ada sesuatupun pekerjaan mereka yang tersembunyi dari-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "41. Setelah disebutkan perumpamaan kesesatan orang yang sesat dan bagaimana mereka Allah jauhkan dari petunjuk, maka kemudian Allah memerintahkan untuk memperhatikan dan mengambil ibrah dari yang dilihat, bagaimana Allah memberi petunjuk kepada banyak penghuni langit dan bumi untuk menyucikan Allah sebagai bentuk keimanan kepada-Nya. Allah berfirman kepada Nabi: Apakah kamu tidak mengetahui dengan yakin bahwa segala yang ada di tujuh langit dan bumi, dan yang ada di antara keduanya, serta burung-burung yang mengepakkan sayapnya di langit, semua itu bertasbih kepada Allah? Seluruh makhluk telah mengetahui bagaimana shalat dan bertasbih. Allah Maha Mengetahui perbuatan makhluk-makhluk tersebut."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "41. أَلَمْ تَرَ أَنَّ اللهَ يُسَبِّحُ لَهُۥ (Tidaklah kamu tahu bahwasanya Allah: kepada-Nya bertasbih) Makna tasbih adalah menyucikan Allah dari segala hal yang tidak layak bagi-Nya. مَن فِى السَّمٰوٰتِ وَالْأَرْضِ(apa yang di langit dan di bumi) Baik itu makhluk yang berakal atau yang lainnya. Adapun bentuk tasbih makhluk Allah yang tidak berakal adalah berupa suara yang terdengar darinya dan bentuk ciptaannya yang menakjubkan yang dapat disaksikan. وَالطَّيْرُ صٰٓفّٰتٍ ۖ( dan (juga) burung dengan mengembangkan sayapnya) Dan ini adalah hal yang paling menakjubkan dari burung, keadaannya mengembangkan sayapnya di angkasa adalah bentuk tasbihnya, dan bukan ketika ia dalam keadaan mengepakkan sayap atau ketika ia berada di tanah, ini merupakan sebagian paling agung dari ciptaan Allah yang menciptakan segala sesuatu dengan penuh kesempurnaan. كُلٌّ قَدْ عَلِمَ صَلَاتَهُۥ وَتَسْبِيحَهُۥ (Masing-masing telah mengetahui (cara) sembahyang dan tasbihnya) Yakni Allah telah mengajarkan dan mengilhamkannya kepada mereka, hal ini terjadi bukan karena kebetulan tanpa perencanaan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "41. Wahai Nabi, apakah kamu tidak mengetahui dengan yakin dan penuh perhatian (penglihatan yang dimaksud adalah penglihatan dengan ilmu) bahwa sesungguhnya Allah itu disucikan dari setiap sesuatu yang tidak sesuai denganNya berupa sifat-sifat yang kurang oleh makhluk-makhluk di langit dan bumi baik yang berakal dengan mengucapkan sesuatu yang sudah dimengerti atau yang tidak berakal dengan suara yang terdengar dari mereka. Dan lihatlah jejak-jejak ciptaan yang telah dibuat di dalamnya, begitu juga burung-burung yang dalam kondisinya dia membentangkan sayapnya sehingga bisa tetap berada di udara itu juga wujud bertasbih kepada Allah dan membuktikan keberadaan sang Pencipta dan kekuasaanNya menggunakan sesuatu yang diberikan Allah untuknya yaitu kemampuan untuk terbang di langit. Sungguh masing-masing makhluk ini telah diketahui oleh Allah tata cara shalatnya (doanya) dan bertasbihnya (bertasbih kepada Tuhannya) dengan cara yang diajarkan oleh Allah kepadanya. Dan Allah itu Maha mengetahui apa yang mereka perbuat dan membalas mereka atas perbuatan itu. Burung dikhususkan karena bentuknya, keadaan membentangkan dan menutup sayapnya itu termasuk ciptaan yang menakjubkan dan sempurna."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah kamu tidak mengetahui} apakah kamu tidak mengetahui {bahwa sesungguhnya apa yang di langit dan di bumi dan burung-burung yang merentangkan saya} membentangkan sayap-sayapnya di udara {itu senantiasa bertasbih kepada Allah. Masing-masing sungguh telah mengetahui doa dan tasbihnya. Allah Maha Mengetahui apa yang mereka lakukan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "41 Allah mengingatkan hambaNya atas kebesaran dan kesempurnaan kekuasaanNya, dan kebutuhan seluruh makhluk kepadaNya dalam rububiyyah dan peribadahan kepadaNya. Dia berfirman,” tidaklah kamu tahu bahwasannya Allah kepadaNya bertasbih apa yang di langit dan di bumi,” dari bangsa hewan-hewan dan benda mati, “dan (juga) burung dengan mengembangkan sayapnya,” maksudnya mengepak-ngepak sayapnya di angkasa dengan bertasbih memuji Rabbnya. “masing-masing,” dari mahluk ini “telah mengetahui (cara) shalat dan tasbihnya,” maksudnya masing-masing mempunyai cara shalat dan ibadah sesuai dengan keadaannya yang pantas. Allah telah memberikan ilhamNya kepada mereka tentang cara shalat, bertasbih dan ibadah lainnya, baik dengan perantaraan para utusan, seperti jin, manusia, serta malaikat. Atau melalui ilham dari Allah sebagaimana makhluk lainnya. Pengertian model ini lebih kuat, sebagaimana firman Allah, “Allah MahaMengetahui apa yang mereka kerjakan,” maksudnya, Dia mengetahui semua perbuatan mereka, tidak ada sesuatu yang tersembunyi dariNYa, dan Allah akan membalas mereka dengan dasar amalan mereka tersebut. Atas dasar ini, Allah telah menggabungkan atara ilmuNya tentang amal-amal mereka, -dalam bentuk mengerjakannya- dengan ilmuNya tentang perbuatan-perbuatan mereka yang mendatangkan balasan. Dhamir (kata ganti ketiga) pada Firman Allah, ”ia telah mengetahui (cara) shalat dan tasbihnya,” bisa diarahkan kepada Allah, dan bahwasannya Allah telah mengetahui ibadah-ibadah mereka. Walaupun kalian para hamba, tidak mengetahuinya kecuali apa yang telah Allah perlihatkan kepada kalian. Ayat ini sebagaimana FirmanNya, “langit yang tujuh, bumi dan semua yang ada didalamnya bertasbih kepada Allah. Dan taka da sesuatupun melainkan bertasbih dengan memujiNya, tetapi kamu sekalian tidak mengeti tasbih mereka. Sesungguhnya Dia Maha Penyantun lagi Maha Pengampun.” ( al-isra:44)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nur ayat 41: Allah Subhaanahu wa Ta'aala mengingatkan kepada hamba-hamba-Nya tentang keagungan-Nya, sempurnanya kekuasaan-Nya dan butuhnya semua makhluk kepada-Nya serta beribadah kepada-Nya. Baik makhluk hidup maupun benda mati. Masing-masing makhluk mengetahui cara shalat dan tasbih kepada Allah dengan ilham dari Allah sesuai keadaannya masing-masing. Kata “Qad ‘alima shalaatahu wa tasbiihah” bisa juga kembalinya kepada Allah, sehingga maksudnya Allah mengetahui shalat dan tasbih masing-masing makhluk-Nya. Hal ini seperti dalam ayat lain yang berbunyi, “Langit yang tujuh, bumi dan semua yang ada di dalamnya bertasbih kepada Allah. dan tidak ada suatu pun melainkan bertasbih dengan memuji-Nya, tetapi kamu sekalian tidak mengerti tasbih mereka. Sesungguhnya Dia adalah Maha Penyantun lagi Maha Pengampun.” (Terj. Al Israa’: 44) Dia mengetahui semua perbuatan mereka dan tidak ada satu pun dari perbuatan mereka yang samar, dan Dia akan memberikan balasan terhadapnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nur Ayat 41",
    "description": "Allah menguraikan bukti kebesaran dan kekuasaan-Nya pada ayat berikut agar manusia beribadah kepada-Nya dan mengakui keesaan-Nya. Tidakkah engkau tahu, wahai nabi Muhammad, bahwa kepada Allah-lah bertasbih apa yang di langit dan di bumi dengan keadaan atau cara masing-masing, dan bersama mereka bertasbih juga burung yang mengembangkan sayapnya; tidak ada yang mencegahnya jatuh kecuali atas kuasa dan izin Allah. Masing-masing makhluk itu sungguh telah me-ngetahui cara berdoa dan bertasbih-Nya sendiri, tetapi kamu tidak me-ngetahuinya (lihat juga: surah al-isr'/17: 44). Allah maha mengetahui apa yang mereka kerjakan. Allah pada ayat ini secara istimewa menyebut burung karena penciptaan burung dan kemampuannya terbang terasa nyata menunjukkan keajaiban penciptaan dan kesempurnaan Allah. 42. Itulah contoh kecil dari kekuasaan dan kepemilikan Allah. Dan sesungguhnya hanya milik Allah-lah kerajaan langit dan bumi; dia yang menciptakan, memiliki, dan mengaturnya. Dengan demikian, Allah adalah sumber segala sesuatu dan hanya kepada Allah-lah seluruh makhluk akan kembali."
  }
]