[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kepunyaan Allah semata kerajaan langit dan bumi, kepunyaanNya kekuasaan pada keduanya, dan kepadaNya-lah kembali (segala sesuatu) pada Hari Kiamat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "42. Dan kepunyaan Allah sajalah kerajaan langit dan bumi, dan kepada-Nya semua makhluk akan kembali pada hari Kiamat kelak untuk dihisab dan diberi balasan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "42. Dan milik Allah seluruh kerajaan di tujuh langit dan bumi, dan hanya kepada-Nya tempat kembali pada hari kiamat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "42. وَلِلّٰهِ مُلْكُ السَّمٰوٰتِ وَالْأَرْضِ ۖ (Dan kepunyaan Allah-lah kerajaan langit dan bumi) Hanya milik-Nya semata. وَإِلَى اللهِ الْمَصِيرُ (dan kepada Allah-lah kembali (semua makhluk)) Kembali setelah kematian tidak kepada selain-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "42. Dan hanya milik Allah itu (bukan selainNya) kerajaan langit dan bumi karena Dialah yang menciptakan dan mengaturnya. Dan hanya kepada Allahlah tempat kembali setelah mati."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Milik Allahlah kerajaan langit dan bumi, dan hanya kepada Allahlah tempat kembali"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "42 setelah menerangkan penghambaan diri mereka dan kebutuhan mereka kepadaNya dari sisi ibadah dan tauhid, Allah menjelaskan (bagaimana) kebutuhan mereka pada sisi kekuasaan, tarbiyyah (pemeliharaan) dan pengaturan (Nya). Allah berfirman, ”dan kepunyaan Allah-lah kerajaan langit dan bumi,” Allah menciptakan, memberi rizki dan Dzat pengatur langit dan bumi dalam hukum syar’I dan hukum qadariNya didunia ini dan nketetapan balasanNya di akhirat kelak, berdasarkan Firman Allah, “dan kepada Allah-lah (semua makhluk) kembali,” maksudnya tempat kembali dan tempat bergantung para makhluk untuk memberikan balasan kepada mereka sesuai dengan amal-amal mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nur ayat 42: Setelah Allah Subhaanahu wa Ta'aala menerangkan ibadah mereka dan butuhnya mereka kepada-Nya dari sisi ibadah dan mentauhidkan-Nya, Dia menerangkan butuhnya mereka dari sisi kepemilikan, pengaturan dan pengurusan-Nya. Yakni, Dialah Pencipta keduanya, Pemberi rezekinya dan Pengaturnya baik dengan hukum syar’i-Nya maupun hukum qadari-Nya di kehidupan dunia ini, serta Pengaturnya dengan hukum jaza’i(pembalasan)-Nya di akhirat. Untuk diberikan balasan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nur Ayat 42",
    "description": "Itulah contoh kecil dari kekuasaan dan kepemilikan Allah. Dan sesungguhnya hanya milik Allah-lah kerajaan langit dan bumi; dia yang menciptakan, memiliki, dan mengaturnya. Dengan demikian, Allah adalah sumber segala sesuatu dan hanya kepada Allah-lah seluruh makhluk akan kembali. 43. Salah satu bukti bahwa semua makhluk akan kembali kepada Allah adalah kuasa-Nya mengatur hujan yang airnya bermula dari laut dan sungai di darat, kemudian menguap, lalu turun kembali ke darat. Tidakkah engkau melihat bahwa Allah yang mahakuasa menjadikan awan bergerak perlahan ke tempat yang dia kehendaki, kemudian dia mengumpulkan bagian-bagian-Nya yang ringan itu, lalu dia menjadikannya bertumpuk-tumpuk sehingga menjadi berat, lalu engkau lihat hujan keluar dari celah-celahnya dan turun ke bumi; dan dia juga menurunkan butiran-butiran es dari langit, yaitu dari gumpalan-gumpalan awan yang serupa gunung-gunung, maka ditimpakan-Nya butiran-butiran es atau hujan itu kepada siapa yang dia kehendaki sebagai rahmat atau azab, dan dihindarkan-Nya dari siapa yang dia kehendaki. Kilauan kilatnya yang timbul akibat gesekan arus listrik di awan itu begitu cemerlang dan menyilaukan sehingga hampir-hampir saja ia menghilangkan penglihatan."
  }
]