[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidakkah kamu menyaksikan bahwa sesungguhnya Allah menggiring awan ke tempat mana saja yang Dia kehendaki, kemudian menyatukan (bagian-bagiannya) setelah terpisah-pisah, kemudian Dia menjadikannya bertumpuk-tumpuk, dan kemudian menurunkan hujan darinya? Dan Dia menurunkan butiran es dari awan yang menyerupai gunung-gunung itu dalam kebesaran bentuknya, lalu menimpakannya pada hamba-hambaNya yang Dia kehendaki dan memalingkannya dari orang yang Dia kehendaki dari mereka, sesuai dengan hikmah dan pengaturanNya. Hampir-hampir cahaya kilat di awan menghilangkan penglihatan orang-orang yang melihatnya dikarenakan kedahsyatan kilauannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "43. Tidaklah kamu mengetahui -wahai Rasulullah- bahwa Allah mengarak awan, kemudian mengumpulkan bagian-bagiannya yang terpisah-pisah, kemudian menjadikannya bertumpuk-tumpuk, maka tampaklah olehmu hujan yang keluar dari celah-celahnya. Dan Allah menurunkan dari arah langit, yaitu dari awan yang tebal laksana gunung karena kebesarannya, butiran-butiran es sebesar kerikil. Dia timpakan butiran-butiran es itu kepada siapa yang Dia kehendaki dan Dia hindarkan dari siapa yang Dia kehendaki. Kilauan kilat awan itu hampir saja menghilangkan penglihatan lantaran kuatnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "43. Setelah menyebutkan bukti pemberian petunjuk bagi makhluk selain manusia dan jin, Allah menyebutkan bukti penciptaan keistimewaan pada benda mati, bahwa benda-benda itu berjalan tanpa perubahan sesuai dengan ketetapan Allah, dan itu lebih mendapat petunjuk daripada orang-orang kafir yang memiliki akal dan panca indra namun enggan mendapat petunjuk untuk mengenal Allah. Maka firman ini disampaikan bagi seluruh makhluk yang berakal: Tidakkah kamu saksikan bahwa Allah mengarahkan awan sebagaimana perintah-Nya, kemudian mengumpulkannya setelah saling terpisah dan menjadikannya saling bertumpang tindih, lalu kamu akan melihat air hujan keluar di antara kumpulan awan itu? -dan itu terjadi setelah proses koalensi ketika angin berhembus-. Dan dari awan yang bentuk dan ukurannya menyerupai gunung-gunung, Allah menurunkan butiran es, dengan butiran es itu Allah menimpakan kebaikan atau keburukan bagi hamba-Nya yang Dia kehendaki, dan menghalangi es itu dari hamba-Nya yang Dia kehendaki. Dan cahaya kilat dari awan itu hampir-hampir menghilangkan penglihatan karena sangat terang."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "43. أَلَمْ تَرَ أَنَّ اللهَ يُزْجِى سَحَابًا (Tidaklah kamu melihat bahwa Allah mengarak awan) Yakni Allah mengarahkan awan dengan lembut ke arah yang Allah kehendaki. ثُمَّ يُؤَلِّفُ بَيْنَهُۥ(kemudian mengumpulkan antara (bagian-bagian)nya) Yakni mengumpulkannya setelah terpisah-pisah agar menjadi besar, bersambung dan pekat. ثُمَّ يَجْعَلُهُۥ رُكَامًا(kemudian menjadikannya bertindih-tindih) Yakni saling bertumpuk-tumpuk. فَتَرَى الْوَدْقَ(maka kelihatanlah olehmu hujan) Yakni kemudian kamu akan melihat hujan. يَخْرُجُ مِنْ خِلٰلِهِۦ(keluar dari celah-celahnya) Yakni dari dalam awan tersebut. وَيُنَزِّلُ مِنَ السَّمَآءِ(dan Allah (juga) menurunkan dari langit) Yakni dari arah atas. مِن جِبَالٍ(dari (gumpalan-gumpalan awan seperti) gunung-gunung) Yakni dari potongan-potongan awan yang besar yang menyerupai gunung-gunung. مِنۢ بَرَدٍ ((butiran-butiran) es) Yakni dari awan-awan itu turun butiran es. فَيُصِيبُ بِهِۦ(maka ditimpakan-Nya (butiran-butiran) es itu) Yakni butiran es yang turun itu. مَن يَشَآء(kepada siapa yang dikehendaki-Nya) Untuk ditimpakan. وَيَصْرِفُهُۥ عَن مَّن يَشَآءُ ۖ(dan dipalingkan-Nya dari siapa yang dikehendaki-Nya) Dari mereka. يَكَادُ سَنَا بَرْقِهِۦ يَذْهَبُ بِالْأَبْصٰرِ(Kilauan kilat awan itu hampir-hampir menghilangkan penglihatan) Yakni cahaya petir dari awan itu hampir membutakan penglihatan karena begitu kuat cahaya dan kilatannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "43. Apakah kalian tidak melihat bahwa Allah itu menggerakkan awan dengan perlahan atau lambat menuju tempat yang dikehendakiNya lalu berkumpul satu sama lain, kemudian menjadikannya bertumpuk-tumpuk satu sama lain sehingga kamu bisa melihat hujan keluar di antara celah-celah awan yang berada di antara bagian-bagian lainnya. Allah juga menurunkan salju dingin dari awan yang bentuk dan ukurannya menyerupai gunung dari arah langit atau hujan saja jika hawa dinginnya tidak dahsyat, Lalu Dia (Allah) memberikan salju itu dan mencegahnya bagi hamba-hambaNya yang dikehendaki. Kilat yang ada di awan itu hamper menyambar penglihatan karena kedahsyatan pantulan dan pancarannya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakag kamu tidak melihat bahwa sesungguhnya Allah mengarahkan} menggerakkan {awan kemudian mengumpulkannya} mengumpulkan di antara bagian-bagiannya {lalu menjadikannya bertumpuk-tumpuk} bertumpuk satu sama lain {Lalu kamu melihat hujan} hujan {keluar dari celah-celahnya} dari celah-celah awan dan tempat keluarnya {Dia menurunkan butiran es seperti gunung} butiran-butiran yang besarnya menyerupai gunung-gunung yang besar {dari langit. Lalu Dia menimpakannya} butiran-butiran es itu {kepada siapa saja yang Dia kehendaki dan memalingkannya dari siapa yang Dia kehendaki. Kilauan kilatnya hampir-hampir} kilauan dan kilatan kilat dari awan-awan itu {menghilangkan penglihatan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "43 maksudnya, apakah kamu tidak menyaksikan dengan penglihatanmu akan keagungan kemampuan Allah, bagaimana Dia “mengarak,” maksudnya menggiring “awan,” dalam bentuk potongan yang terpisah-pisah “kemudian menjadikannya bertindih-tindih,” antara potongan-potongan tersebut. Kemudian Allah menjadikan awan bertumpuk-tumpuk seperti gunung “maka terlihatlah olehmu hujan,” yaitu gerimis air dan hujan yang muncul dari celah-celah awan dalam bentuk rintik-rintikan yang terpisah agar dapat digunakan tanpa adanya unsur bahaya. Parit-parit menjadi penuh, sungai-sungai mengalir deras, laembah-lembah mengalirkan air, tanah-tanah ditumbuhi tumbuhan yang indah. Terkadang Allah menurunkan dari awan itu salju yang merusak obyek yang ditimpanya “maka ditimpakanNya (butiran-butiran) es itu kepada siapa yang dikehendakiNya dan dipalingkanNya dari siapa yang dikehendakiNya,” maksudnya sesuai dengan ketetapan takdirNya dan hikmah-hikmahNya yang terpuji. “kilauan kilat awan itu hampir-hampir,” maksudnya hampir saja kilatan cahaya awan karena dahsyatnya “menghilangkan penglihatanmu,” bukankah Dzat yang mengadakan dan mengaraknya untuk para hambaNYa yang membutuhkan dan menurunkannya dengan cara yang menyebabkan mudah dimanfaatkan tanpa mendatangkan bahaya adalah (Dzat) Yang Mahasempurna kekuasaanNya, terlaksana setiap kehendakNya dan luas rahmatNya?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nur ayat 43: Besarnya keagungan Allah. Yakni turun rintikan-rintikan secara berhamburan agar terwujud manfaat tanpa menimbulkan bahaya. Sesuai hukum qadari-Nya dan kebijaksanaan-Nya yang terpuji. Dengan demikian, bukankah Allah -yang mengadakan awan mendung dan mengirimkannya kepada hamba-hamba-Nya yang membutuhkan, dan menurunkannya secara bermanfaat dan tidak menimbulkan bahaya- Mahasempurna kekuasaan-Nya, Mahaberlaku kehendak-Nya dan luas rahmat-Nya?"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nur Ayat 43",
    "description": "Salah satu bukti bahwa semua makhluk akan kembali kepada Allah adalah kuasa-Nya mengatur hujan yang airnya bermula dari laut dan sungai di darat, kemudian menguap, lalu turun kembali ke darat. Tidakkah engkau melihat bahwa Allah yang mahakuasa menjadikan awan bergerak perlahan ke tempat yang dia kehendaki, kemudian dia mengumpulkan bagian-bagian-Nya yang ringan itu, lalu dia menjadikannya bertumpuk-tumpuk sehingga menjadi berat, lalu engkau lihat hujan keluar dari celah-celahnya dan turun ke bumi; dan dia juga menurunkan butiran-butiran es dari langit, yaitu dari gumpalan-gumpalan awan yang serupa gunung-gunung, maka ditimpakan-Nya butiran-butiran es atau hujan itu kepada siapa yang dia kehendaki sebagai rahmat atau azab, dan dihindarkan-Nya dari siapa yang dia kehendaki. Kilauan kilatnya yang timbul akibat gesekan arus listrik di awan itu begitu cemerlang dan menyilaukan sehingga hampir-hampir saja ia menghilangkan penglihatan. 44. Allah mempergantikan secara terus-menerus malam yang penuh kegelapan dan siang yang terang benderang, sehingga pergantian itu melahirkan panas dan dingin. Sesungguhnya pada yang demikian itu pasti terdapat pelajaran yang berharga tentang kekuasaan dan anugerah Allah, bagi orang-orang yang mempunyai penglihatan mata hati dan pikiran yang tajam."
  }
]