[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan di antara bukti Kuasa Allah, Dia mempergantikan malam dan siang, dengan kedatangan salah satunya setelah yang lain, dan pergantian keduanya dalam panjang pendek waktunya. Sesungguhnya pada hal tersebut benar-benar terdapat petunjuk yang dapat dipetik oleh orang yang memiliki mata hati."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "44. Allah mempergantikan antara malam dan siang dari segi panjang pendek waktu keduanya, serta datang dan perginya. Sesungguhnya pada ayat-ayat yang disebutkan itu terdapat bagian dari tanda-tanda rububiyah (ketuhanan) Allah sebagai pelajaran yang besar bagi orang-orang yang mempunyai penglihatan terhadap kekuasaan dan keesaan Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "44. Salah satu keagungan ayat-ayat kauniyah Allah, Dia saling mempergantikan antara siang dan malam dan di antara keduanya tedapat perbedaan panjang pendeknya, cahaya dan kegelapannya, dan panas dinginnya. Sungguh pada pergantian ini terdapat bukti yang agung, yang akan menjadi pelajaran dan ibrah bagi orang yang berakal."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "44. يُقَلِّبُ اللهُ الَّيْلَ وَالنَّهَارَ ۚ (Allah mempergantikan malam dan siang) Yakni Allah mempergantikan antara siang dan malam. Pendapat lain mengatakan yakni Allah mempergantikan antara panas dan dingin. إِنَّ فِى ذٰلِكَ لَعِبْرَةً(Sesungguhnya pada yang demikian itu terdapat pelajaran yang besar) Makna (العبرة) adalah bukti yang jelas yang mengandung pelajaran. لِّأُو۟لِى الْأَبْصٰرِ(bagi orang-orang yang mempunyai penglihatan) Yakni bagi semua orang yang memiliki penglihatan agar dapat memahami ayat-ayat Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "44. Allah mengubah keadaan malam dan siang dengan membuatnya lama dan singkat, dingin dan panas, serta bertambah dan berkurang. Sesungguhnya dalam perubahan dan pengaturan ini terdapat petunjuk yang terang atas adanya sang Pencipta, kesempurnaan kuasaNya, dan kelengkapan ilmuNya untuk orang-orang yang mempunyai penglihatan dan akal yang digunakan untuk berpikir."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Allah membolak-bali} mempergantikan {malam dan siang. Sesungguhnya pada yang demikian itu pasti terdapat pelajaran bagi orang-orang yang mempunyai penglihatan} petunjuk bagi orang yang memiliki akal dan penglihatan terhadap kuasa Allah SWT"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "44 “Allah mempergantikan malam dan siang,” dari cuaca panas ke hawa dingin, dan dari hawa dingin ke hawa panas, dari malam ke siang dan dari siang ke malam, dan memutar hari-hari di antara para hambaNya. “sesungguhnya pada yang demikian itu, terdapat pelajaran yang besar bagi orang-orang yang mempunyai penglihatan,” yaitu para pemilik mata hati dan akal yang mampu menembus perkara-perkara yang diinginkan, sebagaimana pandangan mata mengenai obyek-obyek konkret inderawi. Orang yang memiliki penglihatan mata hati menyaksikan makhluk-makhluk ciptaan ini dengan pandangan perenungan, berpikir dan penghayatan tentang tujuan (penciptaan) dan (kegunaan) nya. Sementara itu, orang yang berpaling lagi bodoh, pandangannya terhadap cipataan Allah adalah pandangan kelalaian, ibarat pandangan hewan-hewan ternak."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nur ayat 44: Demikian pula panas ke dingin, dingin ke panas, malam ke siang, dan siang ke malam serta menggilirkan hari-hari kepada hamba-hamba-Nya. Sehingga ia memperhatikan pula hikmah di balik itu, berbeda dengan orang yang jahil yang memandangnya seperti binatang memandang."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nur Ayat 44",
    "description": "Allah mempergantikan secara terus-menerus malam yang penuh kegelapan dan siang yang terang benderang, sehingga pergantian itu melahirkan panas dan dingin. Sesungguhnya pada yang demikian itu pasti terdapat pelajaran yang berharga tentang kekuasaan dan anugerah Allah, bagi orang-orang yang mempunyai penglihatan mata hati dan pikiran yang tajam. 45. Dan selain bukti-bukti kekuasaan Allah yang telah dikemukakan sebelumnya, Allah juga menciptakan semua jenis hewan dari air yang memancar sebagaimana dia menciptakan tumbuhan dari air yang tercurah, maka sebagian dari hewan itu ada yang berjalan di atas perutnya dengan merayap, seperti ular, ulat, dan hewan melata lainnya, dan sebagian berjalan dengan dua kaki seperti manusia dan unggas, sedang sebagian yang lain berjalan dengan empat kaki seperti sapi, kambing, dan lainnya. Allah yang mahakuasa menciptakan apa yang dia kehendaki dari makhluk yang disebutkan dan yang tidak disebutkan pada ayat ini, se-perti hewan yang berjalan dengan lebih dari empat kaki seperti kalajengking dan laba-laba. Sungguh, Allah mahakuasa atas segala sesuatu; tiada sesuatu pun yang sulit bagi-Nya."
  }
]