[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Allah telah menciptakan semua yang hidup berjalan di muka bumi dari air. Air adalah asal penciptaan makhluk-makhlukNya. Dan diantara makhluk-makhluk yang berjalan itu, ada yang berjalan melata dengan perutnya, seperti ular-ular dan sejenisnya, dan sebagian ada yang berjalan dengan dua kaki, seperti manusia, dan sebagian ada yang berjalan dengan empat kaki, seperti binatang-binatang ternak dan semacamnya. Dan Allah menciptakan apa saja yang Dia kehendaki. Dan Dia MahaKuasa atas segala sesuatu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "45. Dan Allah telah menciptakan semua jenis makhluk yang berjalan di muka bumi ini berasal dari mani, maka sebagian dari makhluk itu ada yang berjalan di atas perutnya, merayap seperti ular, dan sebagian berjalan dengan dua kaki seperti manusia dan burung, sedang sebagian yang lain berjalan dengan empat kaki seperti binatang ternak. Allah menciptakan apa yang Dia kehendaki, baik yang telah disebutkan itu ataupun belum disebutkan, sesungguhnya Allah Maha Kuasa atas segala sesuatu, tiada sesuatupun yang membuat-Nya lemah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "45. Allah telah menciptakan segala makhluk yang berjalan di muka bumi berupa manusia dan hewan dari air. Di antara makhluk-makhluk ini ada yang berjalan dengan perutnya seperti reptil, berjalan dengan dua kaki seperti manusia, dan berjalan dengan empat kaki seperti hewan ternak. Allah menciptakan apa yang Dia kehendaki, seperti makhluk-makhluk ini dan makhluk lainnya. Sungguh Allah memiliki kekuasaan yang Maha Besar, tidak ada yang sulit bagi-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "45. وَاللهُ خَلَقَ كُلَّ دَآبَّةٍ (Dan Allah telah menciptakan semua jenis hewan) Yakni semua hewan yang berjalan di bumi. مِّن مَّآءٍ (dari air) Yakni dari air mani. فَمِنْهُم مَّن يَمْشِى عَلَىٰ بَطْنِهِۦ(maka sebagian dari hewan itu ada yang berjalan di atas perutnya) Seperti ular, ikan paus, cacing, dan lain sebagainya. وَمِنْهُم مَّن يَمْشِى عَلَىٰ رِجْلَيْنِ(dan sebagian berjalan dengan dua kaki) Seperti manusia dan burung. وَمِنْهُم مَّن يَمْشِى عَلَىٰٓ أَرْبَعٍ ۚ(sedang sebagian (yang lain) berjalan dengan empat kaki) Seperti hewan-hewan lainnya. يَخْلُقُ اللهُ مَا يَشَآءُ ۚ(Allah menciptakan apa yang dikehendaki-Nya) Yakni seperti apa yang telah disebutkan atau yang belum disebutkan di sini yang berjalan menggunakan kaki yang lebih dari empat seperti kepiting, laba-laba, dan serangga-serangga."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "45. Allah menciptakan setiap makhluk yang melata di atas bumi berupa manusia dan hewan dari air khusus yaitu sperma. Dan di antara mereka ada yang berjalan (merangkak) di atas perutnya yaitu ular, cacing, paus dan hewan yang serupa dengan itu (hewan-hewan itu ditunjukkan menggunakan dhamir hum. Dan penggunaan man yang biasanya untuk yang berakal itu sebagai bentuk pemberian kemuliaan. Dan pemilihan kata “zahfu” untuk menunjukkan makna “berjalan” itu menggunakan cara isti’arah). Di antara mereka ada yang berjalan di atas dua kaki yaitu manusia dan burung. Di antara mereka juga ada yang berjalan di atas empat kaki, yaitu kebanyakan hewan. Allah menciptakan apa yang diinginkanNya, yaitu makhluk yang disebutkan disini dan makhluk yang belum disebutkan, yaitu makhluk yang berjalan di atas kaki yang lebih dari empat seperti kepiting dan laba-laba. Sesungguhnya Allah Maha Kuasa atas segala sesuatu dan tidak ada yang mampu melemahkanNya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Allah menciptakan semua jenis hewan dari air} air mani {Sebagian berjalan ada dengan perutnya, sebagian berjalan dengan dua kaki, dan sebagian berjalan dengan empat kaki. Allah menciptakan apa yang Dia kehendaki. Sesungguhnya Allah Maha kuasa atas segala sesuatu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "45 Allah mengingatkan para hambaNya tentang apa yang mereka lihat bahwasanya Dia menciptakan semua makhluk melata yang berada di permukaan bumi “dari air,” semua medianya berasal dari air, sebagaimana Allah berfirman, ”kami jadikan setiap sesuatu yang hidup dari air,” (al-anbiya: 30) Hewan-hewan yang berkembang biak, bahan (penciptaan)nya berasal dari nuthfah ketika sel jantan membuahi betina. Hewan-hewan yang berkembang biak dari tanah tidaklah lahir kecuali dari benda cair, seperti serangga-serangga. Tidak (satupun) dijumpai serangga yang tercipta selain dari air. Bahan (penciptaan) sama, akan tetapi rupa penciptaannya berbeda dengan perbedaan yang banyak. “maka sebagian dari hewan itu ada yang berjalan di atas perutnya,” semisal ular dan sejenisnya “dan sebagian berjalan dengan dua kaki,” seperti manusia dan kebanyakan jenis burung. “sedang sebagian (yang lain) berjalan dengan empat kaki,” misalnya hewan-hewan ternak dan lain-lain. Perbedaan yang ada –walaupun pada asalnya satu (bahan penciptaan)- menunjukkan (kepastian) terlaksananya kehendak Allah dan kekuasaanNya yang merata. Karena inilah Allah berFirman, ”Allah menciptakan sesuatu yang dikehendakiNya,” maksudnya Dia menciptakan para makhlukNya sesuai bentuk-bentuk yang dikehendakiNya. “sesungguhnya Allah Mahakuasa atas segala sesuatu,” sebagaimana Allah menurunkan hujan di bumi, bentuk penyerbukan yang satu jenis dan induknya satu yaitu tanah sementara keturunan-keturunannya memiliki jenis dan sifat yang berbeda-beda, “dan di bumi ini terdapat bagian-bagian yang berdampingan, dan kebun-kebun anggur, tanaman-tanaman dan pohon kurma yang bercabang dan yang tidak bercabang, disirami denagn air yang sama. Mkami melebihkan sebagian tanam-tanaman itu atas sebagian yang lain tentang rasanya. sesungguhnya pada yang demikian itu terdapat tanda-tanda (kebesaran Allah) bagi kaum yang berpikir.” (ar-rad:4)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nur ayat 45: Yakni dari mani, dengan bercampurnya sperma dan ovum. Meskipun materinya sama, yaitu air, namun hasilnya berbeda-beda, di antaranya ada yang berjalan di atas perut, ada yang berjalan di atas kedua kaki, dst. Ini semua menunjukkan berlakunya kehendak Allah ‘Azza wa Jalla. Seperti ular dan cacing. Seperti manusia dan burung. Seperti hewan ternak. Seperti halnya Dia turunkan hujan dari langit, kemudian air hujan itu bersatu dengan bumi, maka tumbuhlah beraneka macam tumbuh-tumbuhan. Allah Subhaanahu wa Ta'aala berfirman, “Dan di bumi ini terdapat bagian-bagian yang berdampingan, dan kebun-kebun anggur, tanaman-tanaman dan pohon korma yang bercabang dan yang tidak bercabang, disirami dengan air yang sama. Kami melebihkan sebagian tanam-tanaman itu atas sebagian yang lain tentang rasanya. Sesungguhnya pada yang demikian itu terdapat tanda-tanda (kekuasaan Allah) bagi kaum yang berfikir.” (Terj. Ar Ra’d: 4)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nur Ayat 45",
    "description": "Dan selain bukti-bukti kekuasaan Allah yang telah dikemukakan sebelumnya, Allah juga menciptakan semua jenis hewan dari air yang memancar sebagaimana dia menciptakan tumbuhan dari air yang tercurah, maka sebagian dari hewan itu ada yang berjalan di atas perutnya dengan merayap, seperti ular, ulat, dan hewan melata lainnya, dan sebagian berjalan dengan dua kaki seperti manusia dan unggas, sedang sebagian yang lain berjalan dengan empat kaki seperti sapi, kambing, dan lainnya. Allah yang mahakuasa menciptakan apa yang dia kehendaki dari makhluk yang disebutkan dan yang tidak disebutkan pada ayat ini, se-perti hewan yang berjalan dengan lebih dari empat kaki seperti kalajengking dan laba-laba. Sungguh, Allah mahakuasa atas segala sesuatu; tiada sesuatu pun yang sulit bagi-Nya. 46. Menutup uraian tentang bukti-bukti kekuasaan-Nya pada ayat-ayat yang lalu, Allah menyatakan sebagai berikut, sungguh, kami telah menurunkan baik pada surah ini maupun surah yang lain, ayat-ayat yang memberi penjelasan berupa bukti, hukum, nasihat, dan permisalan yang dibutuhkan oleh manusia untuk kebahagiaan hidup di dunia dan akhirat. Dan Allah memberi petunjuk siapa yang dia kehendaki ke jalan yang luas, lurus dan tidak menyimpang."
  }
]