[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sungguh Kami telah menurunkan di dalam al-Qur’an ini petunjuk-petunjuk nyata yang mengarahkan menuju kebenaran. Dan Allah memberikan hidayah dan taufik kepada hamba-hambaNya yang Dia kehendaki menuju jalan yang lurus, yaitu Islam."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "46. Sesungguhnya Kami telah menurunkan kepada Muhammad -ṣallallāhu 'alaihi wa sallam- ayat-ayat yang jelas, yang tidak ada keraguan di dalamnya. Dan Allah menuntun siapa yang Dia kehendaki ke jalan yang lurus, jalan yang tidak menyimpang, sehingga mengantarkannya ke Surga."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "46. Sungguh Kami telah menurunkan bukti-bukti yang jelas yang menunjukkan jalan yang benar. Dan Allah memberi petunjuk bagi siapa yang Dia kehendaki kepada agama Islam dengan taufik-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "46. لَّقَدْ أَنزَلْنَآ ءَايٰتٍ مُّبَيِّنٰتٍ ۚ (Sesungguhnya Kami telah menurunkan ayat-ayat yang menjelaskan) Dan Kami tidak membiarkan sesuatupun tidak tercantum dalam kitab. وَاللهُ يَهْدِى مَن يَشَآءُ(Dan Allah memimpin siapa yang dikehendaki-Nya) Dengan memberinya taufik untuk memikirkan ayat-ayat itu dengan cara yang benar dan memberinya petunjuk untuk merenungkannya dengan sebenar-benarnya. إِلَىٰ صِرٰطٍ مُّسْتَقِيمٍ(kepada jalan yang lurus) Yakni jalan lurus yang dapat mengantarkannya kepada kenikmatan surga."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "46. Wahai Nabi, sungguh Kami telah menurunkan dalam Al-Qur’an ini ayat-ayat yang menjelaskan tentang halal, haram, syariat dan hukum-hukum. Allah membantu orang yang dikehendaki agar dapat melihat dengan benar dan belajar dengan benar menuju jalan lurus tanpa ada penyimpangan di dalamnya, seraya dibimbing menuju surga, yaitu dengan agama Islam."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh, Kami telah menurunkan ayat-ayat yang memberi penjelasan} yang terang yang menjelaskan kepada kebenaran {Allah memberi petunjuk kepada siapa saja yang Dia kehendaki ke jalan yang lurus"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "46 maksudnya, sungguh kami telah merahmati hamba-hamba kami dan menurunkan kepada mereka ayat-ayat yang terang, yaitu begitu jelas petunjuknya tentang seluruh orientasi-orientasi syar’I dan adab-adab yang terpuji serta berbagai pengetahuan yang sarat petunjuk sehingga menjadi jelaslah jalan-jalan tersebut, menjadi jelaslah (perbedaan) antara petunjuk dari kesesatan, dan hidayah dari kesesatan. Tiada tersisa sedikit syubhat pun untuk membatalkan hal yang berkaitan dengannya, sehingga tiada suatu syubhat sekecil apapun (yang dapt dijadiakn pegangan) oleh orang yang ingin merontokkannya dan tidak ada kerancuan bagi pencari kebenaran. Karena ia turun dari Dzat Yang Mahasempurna ilmu, rahmat dan penjelasanNya, tidak ada penjelasan (yang lebih terang) setelah penjelasanNya. Tujuannya, agar binasalah orang yang binasa dengan keterangan yang nyata dan (supaya) tetap hiduplah orang yang hidup dengan bukti yang nyata. “dan Allah memberi petunjuk kepada siapa yang dikehendakiNya,” dari kalangan orang-orang yang (sebelumnya) telah diputuskan ketetapan baik baginya dan berpijak benar “kepada jalan yang lurus,” yaitu jalan yang terang (yang pintas) yang menghantarkan kepada Allah dan kepada tempat kemuliaanNya (surga), jalan yang berisi ilmu tentang kebenaran dan pengutamaan serta pengalaman kebenaran. Allah memeratakan keterangan yang sempurna bagi semua makhlukNya dan mengistimewakan dengan (pemberian) hidayah bagi orang-orang yang Dia kehendaki. Inilah karunia dan kebaikanNya. Dan karunia Allah tidak akan terputus. Itulah keadilanNya, memotong hujjah bagi orang yang berdalih. Allah lebih mengetahui di mana meletakkan sumber-sumber kebaikanNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nur ayat 46: Yakni telah menyayangi hamba-hamba Kami. Yakni jelas dilalah(maksud)nya yang menunjukkan maksud-maksud syar’i, adab-adab yang terpuji, dan pengetahuan yang baik, sehingga menjadi jelaslah jalan yang harus ditempuh, semakin jelas mana yang hak dan mana yang batil sehingga tidak ada lagi syubhat dan kemusykilan, karena ia turun dari Tuhan yang ilmu-Nya sempurna, rahmat-Nya sempurna dan penjelasan-Nya pun sempurna. Yaitu mereka yang sudah tecatat sejak dahulu akan memperoleh kebaikan. Yang menyampaikan seseorang kepada Allah dan kepada tempat istimewa dari-Nya (surga), itulah jalan Islam yang di dalamnya terdapat pengetahuan terhadap yang hak (benar) dan pengamalannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nur Ayat 46",
    "description": "Menutup uraian tentang bukti-bukti kekuasaan-Nya pada ayat-ayat yang lalu, Allah menyatakan sebagai berikut, sungguh, kami telah menurunkan baik pada surah ini maupun surah yang lain, ayat-ayat yang memberi penjelasan berupa bukti, hukum, nasihat, dan permisalan yang dibutuhkan oleh manusia untuk kebahagiaan hidup di dunia dan akhirat. Dan Allah memberi petunjuk siapa yang dia kehendaki ke jalan yang luas, lurus dan tidak menyimpang. 47. Dan mereka, yakni orang-orang munafik, berkata, 'kami telah beriman kepada Allah yang maha esa dan rasul Muhammad, dan kami menaati perintah dan tuntunan keduanya. ' kemudian sungguh mengherankan, apabila mereka diperintahkan untuk melaksanakan suatu kewajiban maka sebagian dari mereka berpaling setelah ucapan dan pengakuannya itu. Sekali-kali mereka itu bukanlah orang-orang beriman karena keeng-ganan mereka menerima hukum yang ditetapkan oleh rasulullah."
  }
]