[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang munafik berkata, “Kami beriman kepada Allah dan kepada apa yang dibawa oleh RasulNya, dan kami menaati perintah keduanya.” Kemudian sebagian golongan dari mereka berpaling setelah itu, tidak mau menerima putusan hokum Rasul. Dan mereka itu bukanlah orang-orang beriman."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "47. Dan mereka orang-orang munafik itu berkata, \"Kami telah beriman kepada Allah dan Rasul, dan kami mentaati Allah dan Rasul-Nya\". Kemudian sekelompok dari mereka berpaling sesudah itu, mereka sama sekali tidak mentaati Allah dan Rasul-Nya dalam perintah jihad di jalan Allah atau selainnya, padahal sebelumnya mereka mengklaim bahwa diri mereka beriman kepada Allah dan Rasul-Nya serta taat kepada keduanya. Dan sungguh sekali-kali orang-orang yang berpaling itu bukanlah orang-orang yang beriman meskipun mereka mengaku bahwa mereka beriman."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "47. Allah memberi peringatan terhadap dosa-dosa orang-orang munafik, dan memuji kebaikan orang-orang beriman. Orang-orang munafik mengaku telah beriman dan patuh kepada Allah dan rasul-Nya, namun sebagian mereka menolak ketetapan hukum dari Rasulullah setelah pengakuan mereka itu; orang-orang yang jauh dari kebenaran itu sebenarnya bukanlah orang-orang beriman."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "47. وَيَقُولُونَ ءَامَنَّا بِاللهِ وَبِالرَّسُولِ وَأَطَعْنَا (Dan mereka berkata: “Kami telah beriman kepada Allah dan rasul, dan kami mentaati) Mereka adalah orang-orang munafik yang menampakkan keimanan dan menyembunyikan kekafiran mereka. Mereka mengatakan perkataan yang tidak sesuai dengan apa yang ada dalam hati mereka, dan mereka taat kepada Allah dan Rasul-Nya hanya di lisan mereka saja bukan berdasarkan kepercayaan mereka yang sebenarnya. ثُمَّ يَتَوَلَّىٰ فَرِيقٌ مِّنْهُم(Kemudian sebagian dari mereka berpaling) Yakni sebagian orang munafik berpaling dan tidak mentaati Rasulullah dalam apa yang diperintahkan kepada mereka, seperti perintah berjihad dan lainnya. مِّنۢ بَعْدِ ذٰلِكَ ۚ( sesudah itu) Yakni setelah mengklaim keimanan dan ketaatan ada pada diri mereka. وَمَآ أُو۟لٰٓئِكَ بِالْمُؤْمِنِينَ(sekali-kali mereka itu bukanlah orang-orang yang beriman) Kalimat ini ditujukan pada orang-orang yang bepaling tersebut."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "47. Dan orang-orang munafik berkata: “Kami beriman kepada Allah dan rasulNya Muhammad” Kemudian sebagian dari mereka menolak dan enggan menerima hukum rasulullah setelah menampakkan keimanannya. Dan orang-orang yang menolak itu bukanlah orang-orang mukmin karena penolakan mereka terhadap hukum rasulallah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata,“Kami telah beriman kepada Allah dan Rasul, dan kami menaati (keduanya)” Kemudian sebagian dari mereka berpaling} berpaling {setelah itu} setelajh perkataan mereka,”Kami beriman dan taat” {Mereka itu bukanlah orang-orang mukmin"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "47 Allah mengabarkan keadaan orang-orang yang zhalim, (yaitu) orang-orang yang di dalam hatinya terdapat penyakit, kelemahan iman, nifak, keraguan dan kelesuan. Allah mengetahui bahwa mereka mengucapkan dengan lisan-lisan mereka, (berencana) berpegang teguh dengan beriman dan taat kepada Alllah. Tapi, kemudian mereka tidak melaksanakan apa yang telah mereka katakan. Sekelompok dari mereka berpaling secara keterlaluan, berdasarkan Firman Allah, “sedang mereka berpaling,” sesungguhnya orang yang berpaling terkadang punya niatan untuk kembali pada sesuatu yang telah dia tinggalkan. Namun, orang yang telah berpaling ini (benar-benar) telah membelok, tidak ada (niat) untuk menoleh dan melihat apa yang telah dia campakkan. Anda memperhatikan keadaan ini bersesuaian dengan kondisi mayoritas orang yang mengklaim diri beriman dan taat kepada Allah, padahal dia seorang yang lemah imannya. Anda menyaksikannya tidak mau melaksanakan kebanyakan dari ibadah-ibadah, khususnya ibadah yang memberatkan banyak orang seperti membayar zakat, infak yang wajib dan Sunnah, jihad di jalan Allah, dan lain-lain."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nur ayat 47: Allah Subhaanahu wa Ta'aala memberitahukan keadaan orang-orang zalim yang dalam hatinya ada penyakit atau kelemahan iman atau ada kemunafikan, keraguan dan kelemahan ilmu, bahwa mereka mengatakan bahwa diri mereka memegang teguh keimanan kepada Allah dan ketaatan, namun kenyataannya mereka tidak melakukan apa yang mereka katakan, dan sebagian dari mereka berpaling jauh dari ketaatan sebagaimana disebutkan dalam ayat di atas, “mu’ridhuun” (berpaling), karena orang yang meninggalkan terkadang memiliki niat untuk kembali, namun orang ini malah berpaling. Kita dapat menemukan keadaan seperti ini, yakni mengaku beriman dan taat namun tidak melakukan banyak ketaatan, khususnya ibadah yang berat bagi jiwa, seperti zakat, nafkah yang wajib maupun yang sunat, jihad fii sabilillah, dsb."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nur Ayat 47",
    "description": "Dan mereka, yakni orang-orang munafik, berkata, 'kami telah beriman kepada Allah yang maha esa dan rasul Muhammad, dan kami menaati perintah dan tuntunan keduanya. ' kemudian sungguh mengherankan, apabila mereka diperintahkan untuk melaksanakan suatu kewajiban maka sebagian dari mereka berpaling setelah ucapan dan pengakuannya itu. Sekali-kali mereka itu bukanlah orang-orang beriman karena keeng-ganan mereka menerima hukum yang ditetapkan oleh rasulullah. 48-49. Demikianlah perilaku kaum munafik. Dan apabila mereka diajak oleh siapa pun kepada tuntunan dan hukum Allah dan rasul-Nya agar rasul memutuskan perkara di antara mereka, yaitu mengadili perselisihan di antara mereka, maka tiba-tiba dan tanpa berpikir panjang sebagian dari mereka menolak menerima hukum yang ditetapkan oleh rasulullah jika itu merugikan mereka. Tetapi, jika kebenaran itu di pihak mereka dan mendatangkan keuntungan, mereka akan datang kepada rasulullah dengan patuh dan sangat gembira."
  }
]