[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apabila mereka diseru dalam perselisihan-perselisihan mereka kepada Kitabullah dan kepada RasulNya, supaya Rasul menetapkan keputusan ditengah mereka, tiba-tiba satu golongan dari mereka berpaling, tidak mau menerima putusan Allah dan putusan RasulNya, padahal itu merupakan kebenaran yang tidak diragukan lagi."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "48. Dan apabila orang-orang munafik itu dipanggil kepada Allah dan Rasul-Nya, agar Rasul menetapkan hukuman dan mengadili perkara yang mereka saling berselisih di dalamnya, tiba-tiba sebagian dari mereka menolak dan berpaling darinya lantaran sifat kemunafikan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "48-50. Dan jika mereka diajak untuk mengikuti ketetapan hukum dari Allah dan rasul-Nya agar dapat menyelesaikan perselisihan di antara mereka, maka sekelompok dari mereka akan berpaling dan menolak untuk menghadiri ketetapan itu di majelis Rasulullah, akan tetapi jika hukum itu membawa kemaslahatan bagi mereka maka mereka akan hadir dengan taat. Kemudian disebutkan pengingkaran dan olokan bagi mereka akibat keberpalingan mereka: Apakah dalam hati mereka ada kemunafikan, ragu terhadap kerasulan Nabi Muhammad, atau takut ketetapan hukum dari Allah dan rasul-Nya itu tidak adil? Tidak demikian, namun mereka yang jauh dari kebenaran itulah orang-orang yang zalim."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "48. وَإِذَا دُعُوٓا۟ إِلَى اللهِ وَرَسُولِهِۦ لِيَحْكُمَ بَيْنَهُمْ (Dan apabila mereka dipanggil kepada Allah dan rasul-Nya, agar rasul menghukum di antara mereka) Yakni agar Rasulullah menetapkan hukum di antara mereka. إِذَا فَرِيقٌ مِّنْهُم مُّعْرِضُونَ(tiba-tiba sebagian dari mereka menolak untuk datang) Yakni mereka enggan untuk menyerahkan keputusan hukum kepada Rasulullah jika mereka sebagai pihak yang bersalah, dan ini merupakan bagian dari kemunafikan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "48. Dan ketika orang-orang munafik diajak untuk menaati hukum Allah dan rasulNya, supaya Nabi bisa menghakimi di antara mereka. Seketika (menunjukkan sesuatu yang terjadi setelahnya secara seketika) sekelompok di antara mereka menolak meminta ketentuan hukum kepada rasulallah jika kebenaran itu menghakimi mereka dan jika kebenaran itu diperuntukkan untuk mereka, seketika mereka bergegas untuk meminta keentuan hukum kepada rasulallah. Ayat ini dan dua ayat setelahnya diturunkan terkait perkara orang munafik yang berdebat dengan orang Yahudi. Lalu orang munafik itu berusaha meminta ketentuan hukum kepada Ka’b bin Asyraf dan orang Yahudi itu meminta ketentuan hukum kepada rasulallah, karena dia tahu bahwa rasulullah tidak akan menentukan suatu hukum kecuali dengan benar."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apabila mereka diseru kepada Allah dan RasulNya agar dia memutuskan perkara di antara mereka, tiba-tiba sebagian dari mereka berpaling"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "48 ”dan apabila mereka dipanggil kepada Allah dan RasulNya, agar rasul itu menghukum (mengadili) di antara mereka,” maksudnya bila terjadi di antara mereka dengan seseorang tarik menarik tentang (kepastian) hukum, lalu mereka telah diseru untuk berhukum dengan hukum Allah dan rasulnya “tiba-tiba sebagian dari mereka menolak untuk datang,” maksudnya mereka menginginkan hukum-hukum jahiliyah dan lebih mengutamakan hukum undang-undang (konvensional) yang tidak sesuai dengan ajaran agama daripada hukum-hukum syar’i. karena mereka tahu bahwa kebenaran akan menyalahkan mereka dan syariat Allah tidak menetapkan hukum kecuali yang selaras dengan fakta yang terjadi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nur ayat 48: Maksudnya, dipanggil utnuk berhukum kepada Kitabullah dan sunnah Rasul-Nya. Mereka menginginkan hukum jahiliyyah, mereka mengutamakan undang-undang yang tidak syar’i karena mereka tahu bahwa mereka akan disalahkan, di mana hukum syara’ tidaklah memutuskan kecuali sesuai kenyataan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nur Ayat 48",
    "description": "48-49. Demikianlah perilaku kaum munafik. Dan apabila mereka diajak oleh siapa pun kepada tuntunan dan hukum Allah dan rasul-Nya agar rasul memutuskan perkara di antara mereka, yaitu mengadili perselisihan di antara mereka, maka tiba-tiba dan tanpa berpikir panjang sebagian dari mereka menolak menerima hukum yang ditetapkan oleh rasulullah jika itu merugikan mereka. Tetapi, jika kebenaran itu di pihak mereka dan mendatangkan keuntungan, mereka akan datang kepada rasulullah dengan patuh dan sangat gembira"
  }
]