[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tapi apabila kebenaran dipihak mereka,sesungguhnya mereka akan datang kepada Nabi dengan taat lagi patuh terhadap keputusannya, karena mereka tahu beliau hanya memutuskan dengan dasar kebenaran."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "49. Tetapi jika mereka yakin bahwa kebenaran akan berpihak pada mereka, dan bahwa keputusan itu akan mendatangkan kemaslahatan bagi mereka, mereka akan datang kepada Rasul dengan patuh dan tunduk."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "49. وَإِن يَكُن لَّهُمُ الْحَقُّ يَأْتُوٓا۟ إِلَيْهِ مُذْعِنِينَ (Tetapi jika keputusan itu untuk (kemaslahatan) mereka, mereka datang kepada rasul dengan patuh) Yakni mereka menunjukkan kepatuhan sebab mereka mengetahui bahwa keputusannya akan menguntungkan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "49. Dan jika ada suatu kebenaran bagi orang-orang munafik, maka mereka akan mendatangi rasulallah dengan taat dan tunduk, barangkali rasulallah menentukan suatu hukum bagi mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika kebenaran itu bagi mereka, maka mereka datang kepadanya dengan patuh} taat dan tunduk kepada keputusannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "49 “tetapi jika keputusan itu untuk (kemaslahatan) mereka, maka mereka datang kepada Rasul,” maksudnya kepada hukum syar’I “dengan patuh” bukan karena ketetapan itu adalah hukum syar’I, akan tetapi hanyalah karena keputusan tersebut selaras dengan hawa nafsu mereka. Dalam hal ini, mereka bukan termasuk orang-orang yang (patut) dipuji, walaupun mereka datang kepada beliau dengan patuh. Karena, hamba yang sejati, adalah insan yang mengikuti kebenaran, pada masalah yang dia suka atau yang dia benci, yang menyenangkan atau yang menyedihkannya. Adapun orang-orang yang mengikuti syariat ketika sejalan dengan hawa nafsunya dan mencampakkannya ketika bertentangan dengan dirinya, lebih mengedepankan nafsunya di atas syariat, maka dia bukanlah seorang hamba yang hakiki."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nur ayat 49: Mereka tunduk kepadanya bukan karena ia adalah hukum syar’i, akan tetapi karena sesuai dengan hawa nafsu mereka. Oleh karenanya mereka dalam hal ini tidaklah terpuji meskipun mereka datang dengan tunduk, karena hamba yang hakiki adalah orang yang mengikuti yang hak baik dalam hal yang ia suka maupun tidak, baik yang membuatnya senang maupun sedih. Adapun orang yang mengikuti syariat karena sesuai hawa nafsu saja, maka ia bukanklah hamba hakiki. Oleh karena itu, dalam ayat selanjutnya Allah Subhaanahu wa Ta'aala berfirman mencela mereka karena berpaling dari hukum syar’i."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nur Ayat 49",
    "description": "48-49. Demikianlah perilaku kaum munafik. Dan apabila mereka diajak oleh siapa pun kepada tuntunan dan hukum Allah dan rasul-Nya agar rasul memutuskan perkara di antara mereka, yaitu mengadili perselisihan di antara mereka, maka tiba-tiba dan tanpa berpikir panjang sebagian dari mereka menolak menerima hukum yang ditetapkan oleh rasulullah jika itu merugikan mereka. Tetapi, jika kebenaran itu di pihak mereka dan mendatangkan keuntungan, mereka akan datang kepada rasulullah dengan patuh dan sangat gembira. 50. Perilaku mereka sungguh mengherankan. Apakah keberpalingan mereka dari hukum yang ditetapkan oleh rasulullah itu karena dalam hati mereka ada penyakit, atau karena mereka ragu-ragu terkait keadilan dan kebenaran hukum rasulullah itu, ataukah karena mereka takut kalau-kalau Allah dan rasul-Nya berlaku zalim kepada mereka' sebenarnya, keberpalingan mereka itu adalah kezaliman yang nyata karena mereka itu adalah orang-orang yang zalim dengan sesungguh'nya."
  }
]