[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Akan tetapi, orang yang bertaubat dan menyesal, dan mencabut tuduhannya, serta memperbaiki dirinya, maka sesungguhnya Allah akan mengampuni dosanya,merahmatinya, dan menerima taubatnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Kecuali orang-orang yang bertobat kepada Allah sesudah melemparkan tuduhan tersebut dan memperbaiki amalan mereka, karena Allah akan menerima tobat dan kesaksian mereka lagi. Sesungguhnya Allah Maha Pengampun atas hamba yang bertobat kepada-Nya, lagi Maha Penyayang terhadap mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. إِلَّا الَّذِينَ تَابُوا۟ مِنۢ بَعْدِ ذٰلِكَ (kecuali orang-orang yang bertaubat sesudah itu) Yakni sesudah dosa mereka melakukan tuduhan (qadzaf). وَأَصْلَحُوا۟( dan memperbaiki (dirinya)) Yakni memperbaiki amalan-amalan mereka yang diantaranya adalah qadzaf; mereka mengganti dosa itu dengan taubat dan rela dihukum had. Jika orang yang telah melakukan qadzaf bertaubat maka kesaksiannya kembali diterima dan sifat kefasikannya tidak lagi disematkan kepadanya. Namun pertaubatan tidak dapat membebaskannya dari hukuman had, dan pertaubatan ini tidak diterima kecuali dengan mengakui bahwa ia telah melakukan kebohongan pada tuduhannya itu serta telah ditegakkan padanya hukuman had. فَإِنَّ اللهَ غَفُورٌ رَّحِيمٌ (maka sesungguhnya Allah Maha Pengampun lagi Maha Penyayang) Oleh sebab itu Allah tidak menyiksa orang yang melakukan qadzaf setelah ia bertaubat dan meridhai kalian untuk menerima kesaksiannya kembali."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Kecuali orang-orang yang bertaubat sesudah itu dan memperbaiki dirinya, maka sesungguhnya Allah Maha Pengampun lagi Maha Penyayang. Inilah batasan dari itu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{kecuali mereka yang bertaubat setelah itu dan memperbaiki diri, maka sesungguhnya Allah Maha Pengampun lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5. FirmanNya, “kecuali orang-orang yang bertaubat sesudah itu dan memperbaiki (dirinya),” bertaubat dalam tema ini, dalam bentuk qadzif (penuduh) menyatakan dusta dirinya sendiri, dan menungkapkan pengakuan bahwa dirinya (dahulu) telah berkata dusta tentang apa yang pernah disampaikan. Dia wajib menyatakan kedustaan dirinya, meskipun dia yakin kebenaran peristiwanya. Lantaran dia tidak berkutik untuk menghadap empat orang saksi. Jika qadzhif (penuduh) bertaubat dan mengoreksi amalannya serta merubah perbuatan buruknya dengan kebaikan, maka predikat kefasikan lepas darinya. Begitu pula, persaksiannya diterima (kembali) menurut pendapat yang paling shahih. “maka sesungguhnya Allah Maha Pengampun lagi maha Penyayang.” Mengampuni dosa secara keseluruhan bagi orang yang bertaubat dan kembali (kejalan yang benar). Qadzif (pelaku tuduhan) dikenai hukuman dera bila tidak sanggup mendatangkan empat orang saksi dan ia bukan suami (wanita tertuduh). Tetapi bia si penuduh adalah suaminya,"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nur ayat 5: Menurut Syaikh As Sa’diy, tobat dalam hal ini adalah dengan ia mendustakan dirinya sendiri, mengakui bahwa ucapanya dusta, dan hal ini wajib baginya, yakni mendustakan dirinya meskipun ia merasa yakin terjadi perbuatan itu, karena ia tidak mendatangkan empat orang saksi. Jika penuduh itu telah bertobat dan memperbaiki amalnya, maka ia ganti perbuatan buruknya dengan perbuatan baik, sehingga kefasikannya pun hilang. Demikian pula persaksiannya akan kembali diterima menurut pendapat yang sahih, karena Allah Maha Pengampun lagi Maha Penyayang, Dia mengampuni dosa-dosa semuanya bagi orang yang bertobat dan kembali. Dideranya si penuduh ini, jika ia tidak mendatangkan empat orang saksi dan jika ia bukan suaminya. Apabila ia sebagai suaminya, maka berlaku hukum yang lain baginya, yaitu li’an sebagaimana diterangkan dalam ayat selanjutnya. Dengan inilah kefasikan mereka hilang dan persaksiannya diterima."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nur Ayat 5",
    "description": "4-5. Usai menjelaskan hukuman bagi pezina dan hukum menikahinya, Allah lalu menguraikan sanksi hukum terhadap orang yang menuduh orang lain berbuat zina. Dan orang-orang yang menuduh perempuan-perempuan yang baik telah berbuat zina, dan mereka tidak dapat mendatangkan empat orang saksi yang menjadi saksi atas kebenaran tuduhannya di hadapan pengadilan, maka deralah mereka, wahai kaum mukmin melalui penguasa kamu, sebanyak delapan puluh kali. Hukuman ini berlaku jika penuduh adalah orang merdeka. Jika ia adalah seorang hamba sahaya maka deralah ia empat puluh kali (lihat juga: an-nis'/4: 25). Dan ja-nganlah kamu terima kesaksian mereka untuk selama-lamanya. Mereka itulah orang-orang yang fasik. Ketentuan ini berlaku atas semua orang yang berbuat demikian, kecuali mereka yang bertobat, menyesali perbuatannya, dan bertekad tidak akan mengulanginya setelah itu, yaitu setelah menerima hukuman itu, dan mereka membuktikan tobat mereka de-ngan memperbaiki diri dan beramal saleh. Jika mereka melakukannya maka sungguh, Allah maha pengampun, maha penyayang. 6-7. Setelah menjelaskan ketentuan hukum terhadap penuduh zina secara umum, Allah lalu menguraikan hukum apabila seorang suami menuduh istrinya berzina. Dan orang-orang yang menuduh istrinya berzina, padahal mereka tidak mempunyai saksi-saksi yang menguatkan tu-duhan itu selain diri mereka sendiri, maka kesaksian masing-masing orang itu, yaitu suami, ialah empat kali bersumpah dengan nama Allah, bahwa sesungguhnya dia termasuk orang yang berkata benar. Dan sumpah yang kelima adalah bahwa laknat Allah akan menimpanya jika dia termasuk orang yang berdusta dalam tuduhan yang dialamatkan kepada istrinya."
  }
]