[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah sebab mereka berpaling itu adalah penyakit kemunafikan yang ada pada hati mereka ataukah karena mereka meragukan kenabian Muhammad? Ataukah sebabnya adalah ketakutan mereka bahwa hokum Allah dan RasulNya akan zhalim (semena-mena)? Sekali-kali tidak, lantaran mereka tidak takut kezhaliman, akan tetapi, sebabnya ialah karena mereka orang-orang yang berbuat zhalim lagi jahat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "50. Apakah dalam hati mereka ada penyakit yang terus-menerus menjangkitinya, ataukah karena mereka ragu-ragu bahwa dia itu Rasulullah, ataukah karena mereka takut kalau-kalau Allah dan Rasul-Nya berlaku zalim dalam menetapkan hukuman kepada mereka? Sungguh semua yang disebutkan ini bukanlah sebab berpalingnya mereka, namun sebabnya adalah penyakit yang ada dalam diri mereka yang disebabkan oleh sikap berpaling dan pembangkangan mereka dari hukum Allah dan Rasul-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "50. أَفِى قُلُوبِهِم مَّرَضٌ (Apakah (ketidak datangan mereka itu karena) dalam hati mereka ada penyakit) Yakni apakah keengganan mereka untuk menyerahkan hukum kepada Nabi disebabkan kemunafikan yang ada di hati mereka. أَمِ ارْتَابُوٓا۟( atau (karena) mereka ragu-ragu) Atau karena mereka ragu terhadap kenabiannya dan keadilannya dalam memberi keputusan. أَمْ يَخَافُونَ أَن يَحِيفَ اللهُ عَلَيْهِمْ وَرَسُولُهُۥ ۚ( ataukah (karena) takut kalau-kalau Allah dan rasul-Nya berlaku zalim kepada mereka?) Makna (الحيف) adalah condong kepada salah satu pihak dalam memberi keputusan. بَلْ أُو۟لٰٓئِكَ هُمُ الظّٰلِمُونَ(Sebenarnya, mereka itulah orang-orang yang zalim) Yakni itu bukan karena hal-hal yang telah disebutkan itu, namun karena kezaliman dan kebebalan mereka. Wajib atas setiap muslim apabila diajak untuk menyerahkan hukum kepada orang qadhi dan ulama yang memahami hukum Allah dan adil dalam putusannya untuk menerima ajakan tersebut, sebab para ulama adalah pewaris para nabi, dan hukum dari para qadhi muslim yang memahami hukum Allah dan mengerti al-Qur’an dan as-Sunnah serta adil dalam putusannya adalah hukum yang diputuskan dengan hukum Allah dan hukum Rasul-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "50. Apakah dalam hati mereka itu ada kekufuran dan kemunafikan (Istifham di sini adalah istifham inkary) ataukah mereka terganggu dengan kenabianmu dan kemampuanmu dalam menentukan kebenaran, ataukah mereka khawatir Allah dan RasulNya itu menekan dan menzalimi mereka? Tidak, tetapi orang-orang munafik itu menzalimi diri mereka sendiri. Dan {bal} adalah huruf untuk meniadakan kalimat sebelumnya dan menguatkan sesuatu setelahnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apakah dalam hati mereka ada penyakit} penyakit yang membuat hati mereka dari kebenaran, dan enggan menerima kebenaran {atau mereka ragu-ragu} ragu tentang kenabiannya {ataukah takut kalau Allah dan RasulNya berbuat zalim} melampaui batas {kepada mereka. Sebaliknya, mereka itulah orang-orang yang zalim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "50 Allah berfirman dalam nada celaan terhadap mereka atas pembelokan mereka dari hukum syar’I “apakah dalam hati mereka ada penyakit,” yaitu penyakit yang mengeluarkan hati dari kesehatannya, menghilangkan sensitivitasnya, sehingga dia bagaikan orang yang sakit yang menolak hal-hal yang bermanfaat bagi dirinya dan (justru) mengarah kepada sesuatu yang dapat mencelakakannya “atau (karena) mereka ragu-ragu,” maksudnya mereka ragu dan hati mereka bimbang mengenai hukum Allah dan RasulNya, dan mereka melancarkan tuduhan bahwa RasulNya tidak menghukumi secara benar, “ataukah (karena) takut kalau-kalau Allah dan rasulNya berlaku zhalim kepada mereka,” maksudnya menetapkan keputusan hukum atas mereka dengan hukuman yang zhalim dan curang. sesungguhnya, inilah sifat-sifat mereka, “sebenarnya, mereka itulah orang-orang yang zhalim,” adapun hukum Allah dan RasulNya, pastilah berada di level puncak keadilan dan kebenaran serta selaras dengan hikmah. Allah berfirman,” dan (hukum) siapakah yang lebih baik daripada (hukum) Allah bagi orang-orang yang yakin.” (al-maidah:50). Pada ayat-ayat ini terdapat dalil bahwa iman tidaklah sekedar ucapan (sehingga perlu disertai dengan amalan). Karena itu Allah meniadakan keimanan dari seseorang yang telah berpaling dari ketaatan dan kewajiban tunduk kepada hukum Allah dan RasulNya pada setiap keadaan, dan bahwasanya orang yang tidak patuh kepadanya (hukum itu), menandakan (eksistensi) penyakit pada hatinya dan keraguan dalam keimanannya, dan bahwa diharamkan berburuk sangka terhadap hukum-hukum syari’at, dengan menyangka bahwa hukum syari’at bersebrangan dengan spirit keadilan dan hikmah. Dan setelah menyebutkan keadaan orang-orang yang telah berpaling dari hukum syar’I, Dia lalu menyebutkan keadaan orang-orang Mukmin yang terpuji."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nur ayat 50: Yang membuat hatinya tidak sehat. Meragukan kebenaran hukum Allah dan Rasul-Nya. Karena hukum Allah dan Rasul-Nya adalah adil dan tepat (hikmah). Dalam ayat ini terdapat dalil bahwa iman tidak sebatas di lisan saja bahkan amal pun menjadi bagiannya. Oleh karenanya, Allah menyebut mereka bukan mukmin karena berpaling dari ketaatan. Ayat ini juga menunjukkan wajibnya tunduk kepada hukum Allah dan Rasul-Nya dalam setiap keadaan, dan bahwa orang yang mengkritiknya berarti ada penyakit dalam hatinya dan ragu-ragu dalam keimanannya. Demikian juga menunjukkan haramnya berburuk sangka terhadap hukum-hukum syariat atau menyangkanya tidak adil atau tidak tepat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nur Ayat 50",
    "description": "Perilaku mereka sungguh mengherankan. Apakah keberpalingan mereka dari hukum yang ditetapkan oleh rasulullah itu karena dalam hati mereka ada penyakit, atau karena mereka ragu-ragu terkait keadilan dan kebenaran hukum rasulullah itu, ataukah karena mereka takut kalau-kalau Allah dan rasul-Nya berlaku zalim kepada mereka' sebenarnya, keberpalingan mereka itu adalah kezaliman yang nyata karena mereka itu adalah orang-orang yang zalim dengan sesungguh'nya. 51. Lain halnya dengan penolakan kaum munafik saat diajak berhukum kepada Allah dan rasul-Nya. Sesungguhnya ucapan orang-orang mukmin yang beriman dengan mantap apabila mereka diajak kepada Allah dan rasul-Nya agar rasul memutuskan perkara di antara mereka, mereka berkata, 'kami mendengar, dan kami taat pada keputusan apa pun yang ditetapkan oleh rasul. ' mereka itulah orang-orang mukmin sejati, dan mereka itulah orang-orang yang beruntung dalam kehidupan dunia dan akhirat."
  }
]