[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Adapun orang-orang Mukmin yang sebenarnya, maka sikap pasti mereka jika diseru untuk menetapkan hokum dalam perselisihan mereka kepada Kitabullah dan ketetapan RasulNya, mereka menerima keputusan hukumnya dan mengatakan, “Kami mendengar apa yang disampaikan kepada kami dan mentaati orang yang menyeru kami kepadanya.” Mereka itulah orang-orang yang beruntung memperoleh keinginan mereka di surga-surga yang penuh kenikmatan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "51. \"Sesungguhnya jawaban orang-orang mukmin, bila mereka dipanggil kepada Allah dan Rasul-Nya agar Rasul mengadili di antara mereka ialah ucapan, 'Kami mendengar perkataannya, dan kami patuh terhadap perintahnya.' Dan orang-orang yang memiliki sifat seperti ini adalah orang-orang yang beruntung di dunia dan di Akhirat.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "51-52. Perkataan yang benar dari orang-orang beriman ketika diajak untuk mengikuti ketetapan hukum dari Allah dan rasul-Nya agar menyelesaikan perselisihan di antara mereka adalah dengan menyambut ketetapan hukum yang bijaksana itu, dan dengan terus terang berkata ‘Kami mendengar apa yang engkau katakan, dan kami akan mentaati Allah dan Rasulullah’, mereka yang memiliki derajat yang tinggi itu adalah orang-orang yang akan meraih kebahagiaan di dunia dan di akhirat. Dan barangsiapa yang mentaati Allah dan rasul-Nya dalam segala perintah dan larangan, bertakwa kepada Allah dalam menjalankan hukum-hukum-Nya, dan takut dari azat-Nya; maka mereka yang memiliki derajat yang tinggi itu adalah orang-orang yang akan meraih keridhaan Allah Yang Maha Mulia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "51. إِنَّمَا كَانَ قَوْلَ الْمُؤْمِنِينَ إِذَا دُعُوٓا۟ إِلَى اللهِ وَرَسُولِهِۦ لِيَحْكُمَ بَيْنَهُمْ أَن يَقُولُوا۟ سَمِعْنَا وَأَطَعْنَا ۚ (Sesungguhnya jawaban oran-orang mukmin, bila mereka dipanggil kepada Allah dan rasul-Nya agar rasul menghukum (mengadili) di antara mereka ialah ucapan. “Kami mendengar, dan kami patuh”) Yakni sepatutnya bagi orang-orang beriman untuk berlaku demikian, yaitu apabila mengengar seruan tersebut maka ia harus menanggapinya dengan ketaatan dan ketundukan; mereka tetap mengatakan “kami mendengar perkataannya dan mentaati perintahnya” meski hal itu adalah sesuatu yang tidak mereka suka dan merugikan mereka. وَأُو۟لٰٓئِكَ(Dan mereka itulah) Yakni orang-orang beriman yang mengatakan perkataan itu. هُمُ الْمُفْلِحُونَ(orang-orang yang beruntung) Orang-orang yang berhasil meraih kebaikan dunia dan akhirat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "51. Sesungguhnya ucapan: “Kami mendengarkan hukumNya, menaati perintahNya, dan meridhai hukumNya” adalah ucapan orang-orang mukmin saat diajak mematuhi hukum Allah dan rasulNya supaya bisa menentukan hukum di antara mereka. Orang-orang yang mendeklarasikan diri untuk taat itu adalah orang-orang yang memenangkan kebaikan dunia akhirat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya yang merupakan ucapan orang-orang mukmin, ketika mereka diseru kepada Allah dan RasulNya agar dia memutuskan (perkara) di antara mereka, mereka berkata,“Kami mendengar dan kami taat”} Kami mendengar ucapannya, dan Kami menaati perintahnya {Mereka itulah orang-orang beruntung"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "51 maksudnya “sesungguhnya jawaban orang-orang Mukmin,” yang hakiki, yang membenarkan iman mereka dengan amal-amal mereka tatkala diseru “kepada Allah dan RasulNya agar rasul menghukum (mengadili) diantara mereka,” baik sesuai dengan nafsu mereka atau menyelisihinya, “ialah ucapan,’ kami mendengar, dan kami patuh’.” Maksudnya kami dengarkan hukum Allah dan rasulNya, kami menjawab orang yang menyeru kepadanya, kami menaati dengan ketaatan yang penuh tanpa rasa keberatan, “dan mereka itulah orang-orang yang beruntung.” Allah melingkupkan kemuliaan untuk mereka, karena (hakikat) kebahagiaan itu adalah mendapatkan sesuatu yang dipinta dan selamat dari hal-hal yang dibenci. Dan tidaklah berbahagia kecuali orang yang berhukum dan taat kepada Allah dan RasulNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nur ayat 51: Setelah Allah menyebutkan keadaan orang-orang yang berpaling dari hukum syar’i, Dia menyebutkan keadaan orang-orang mukmin. Yang hakiki; yang membenarkan iman mereka dengan amal saleh. Maksudnya, di antara kaum muslimin dengan kaum muslimin atau di antara kaum muslimin dengan non muslim. Baik sesuai hawa nafsu mereka maupun tidak. Yang mendapatkan apa yang dicita-citakan dan selamat dari yang dikhawatirkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nur Ayat 51",
    "description": "Lain halnya dengan penolakan kaum munafik saat diajak berhukum kepada Allah dan rasul-Nya. Sesungguhnya ucapan orang-orang mukmin yang beriman dengan mantap apabila mereka diajak kepada Allah dan rasul-Nya agar rasul memutuskan perkara di antara mereka, mereka berkata, 'kami mendengar, dan kami taat pada keputusan apa pun yang ditetapkan oleh rasul. ' mereka itulah orang-orang mukmin sejati, dan mereka itulah orang-orang yang beruntung dalam kehidupan dunia dan akhirat. 52. Dan barang siapa taat kepada Allah dan rasul-Nya dalam segala hal, tidak hanya dalam menerima keputusan nabi terkait hal yang mereka perselisihkan, serta takut kepada Allah dengan seluruh jiwanya terkait dosa-dosa yang pernah dilakukan, dan bertakwa kepada-Nya, mereka itulah orang-orang yang mendapat kemenangan karena memperoleh ampun-an dari Allah dan surga-Nya."
  }
]