[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan barangsiapa taat kepada Allah dan RasuNya dalam perintah dan larangan, serta takut dampak buruk pelanggaran dan khawatir terhadap siksaan Allah, maka mereka itu adalah orang-orang yang beruntung memperoleh kenikmatan di dalam surga."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "52. Dan barang siapa yang taat kepada Allah dan Rasul-Nya, berserah diri kepada hukum Allah dan Rasul-Nya, takut terhadap akibat maksiat, dan bertaqwa kepada Allah dengan mengerjakan perintah dan menjauhi larangan-Nya, mereka itulah orang-orang yang meraih kemenangan dengan mendapatkan kebaikan dunia dan Akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "52. وَمَن يُطِعِ اللهَ وَرَسُولَهُۥ وَيَخْشَ اللهَ وَيَتَّقْهِ فَأُو۟لٰٓئِكَ هُمُ الْفَآئِزُونَ (Dan barang siapa yang taat kepada Allah dan rasul-Nya dan takut kepada Allah dan bertakwa kepada-Nya, maka mereka adalah orang-orang yang mendapat kemenangan) Yakni mereka sajalah yang akan meraih kenikmatan dunia dan akhirat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "52. Dan barangsiapa menaati Allah dan rasulNya dalam menjalankan perintah dan hukumNya, takut kepadaNya, dan menghindari azabNya, maka mereka itu adalah orang-orang yang memenangkan kenikmatan dunia"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Siapa saja yang taat kepada Allah dan RasulNya serta takut kepada Allah} takut kepada Allah dengan pengetahuan dan pengagungan {dan bertakwa kepadaNya, mereka itulah orang-orang yang mendapat kemenangan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "52 tatkala Allah menyebutkan keutamaan taat dalam berhukum secara khusus, maka Dia menyebutkan keutamaan taat secara umum pada seluruh keadaan. Allah berfirman, ”dan barangsiapa yang taat kepada Allah dan RasulNya,” lalu membenarkan al-khabar dan mengikuti perintah Allah dan RasulNya “dan takut kepada Allah,” maksudnya takut kepadaNya dengan ketakutan yang berkaitan dengan pengetahuan, sehingga dia meninggalkan apa yang dilarang, menahan dirinya dari apa yang diinginkan nafsunya “dan bertakwa kepadaNya,” dengan meninggalkan perkara-perkara yang dilarang. Karena, hakikat takwa secara umum, mencakup melakukan perintah dan menjauhi larangan. Tatkala lafazh at-taqwa bersanding dengan lafazh al-birr (kebaikan) atau ath-tha’ah (ketaatan) –sebagaimana dalam pembahasan di sini- maka ditafsirkan dengan membentengi diri dari azab Allah dengan cara meninggalkan kemaksiatan kepadaNya. “maka mereka,” yang telah memadukan antara ketaatan kepada Allah dan RasulNya, rasa takut dan takwa kepadaNya “adalah orang-orang yang mendapat kemenangan,” dengan selamatnya mereka dari azab karena mereka meninggalkan perkara-perkara pemicunya sehingga meraih pahala karena telah menempuh sebab kausalitasnya. Kemenangan hanya terbatas bagi mereka (saja). Adapun orang yang belum menyandangi diri dengan sifat-sifat mereka, maka sungguh dia akan kehilangan kemenangan ini sesuai dengan kadar kekurangan untuk menyempurnakaan sifat-sifat ini. Ayat ini mencakup hak kolektif antara Allah dan RasulNya. Yaitu, ketaatan yang berkonsekuensi kepada keimanan dan (mengandung) hak khusus untuk Allah yaitu rasa takut dan ketakwaan. Masih tersisa (jenis hak) ketiga yang khusus bagi RasulNya, yaitu pemberian dukungan dan pengagungan, sebagaimana Allah telah menggabungkan tiga hak ini dalam surah al-fath. “supaya kamu sekalian beriman kepada Allah dan RasulNya, menguatkan (agama) Nya, membesarkannya dan bertasbih kepadaNya di waktu pagi dan petang.” (al-fath:9)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nur ayat 52: Setelah Allah menyebutkan keutamaan taat dalam hal hukum, maka Allah Subhaanahu wa Ta'aala menyebutkan keutamaan taat kepada Allah dan Rasul-Nya dalam segala hal. Dia membenarkan berita keduanya dan melaksanakan perintahnya. Dia takut kepada Allah dengan adanya ma’rifat (mengenal Allah), ia pun meninggalkan apa yang dilarang dan menahan hawa nafsunya. Ada yang berpendapat, bahwa yang dimaksud dengan takut kepada Allah ialah takut kepada Allah disebabkan dosa-dosa yang telah dikerjakannya, dan yang dimaksud dengan takwa ialah memelihara diri dari segala macam dosa-dosa yang mungkin terjadi. Kata takwa apabila disebutkan secara mutlak, maka maksudnya melaksanakan perintah dan menjauhi larangan, dan apabila disebutkan bersamaan dengan melaksanakan perintah, maka takwa diartikan dengan takut kepada azab Alah dengan meninggalkan maksiat. Dan selamat dari neraka. Ayat ini mencakup hak yang di sana terdapat hak Allah dan Rasul-Nya, yaitu taat. Hak yang khusus bagi Allah, yaitu takut dan takwa, dan hak yang khusus bagi Rasul, yaitu membela dan memuliakannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nur Ayat 52",
    "description": "Dan barang siapa taat kepada Allah dan rasul-Nya dalam segala hal, tidak hanya dalam menerima keputusan nabi terkait hal yang mereka perselisihkan, serta takut kepada Allah dengan seluruh jiwanya terkait dosa-dosa yang pernah dilakukan, dan bertakwa kepada-Nya, mereka itulah orang-orang yang mendapat kemenangan karena memperoleh ampun-an dari Allah dan surga-Nya. 53. Menyambung kembali penyebutan sifat-sifat orang munafik, Allah menyatakan sebagai berikut, dan selain sikap orang munafik yang menolak hukum darimu, wahai nabi Muhammad, mereka juga bersumpah dengan nama Allah dengan sumpah sungguh-sungguh bahwa jika engkau suruh mereka untuk berperang, pastilah mereka akan pergi. Demikian sumpah mereka. Untuk merespons sumpah mereka, katakanlah wahai nabi, \"janganlah kamu bersumpah palsu karena yang diminta oleh Allah dari kamu adalah ketaatan yang baik dan tulus, bukan ketaatan di mulut saja. Sungguh, Allah mahateliti terhadap apa yang kamu kerjakan, baik pekerjaan lahir maupun batin. \"."
  }
]