[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang munafik bersumpah dengan Nama Allah dengan keseriusan tinggi dalam sumpah-sumpah yang kuat, “jika kamu (wahai rasul) memerintahkan kami untuk keluar berperang bersamamu, pastilah kami akan keluar.” Katakanlah kepada mereka, “Janganlah kalian bersumpah dengan dusta. Sebab ketaatan kalian sudah bukan rahasia lagi, hanya sebatas dengan lisan saja. Sesungguhnya Allah Maha Mengetahui apa yang kalian perbuat dan akan membalas kalian dengan itu.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "53. Dan orang-orang munafik itu bersumpah dengan nama Allah seberat-berat sumpah yang bisa mereka sanggupi untuk bersumpah dengannya, jika engkau suruh mereka keluar untuk berjihad, pastilah mereka akan pergi. Katakanlah kepada mereka wahai Rasul, \"Janganlah kalian bersumpah, karena kedustaan sumpah kalian sudah diketahui, dan dustanya ketaatan yang kalian katakan juga sudah diketahui.\" Sesungguhnya Allah Maha Mengetahui apa yang kalian kerjakan, tiada suatu amalan kalian pun yang tersembunyi bagi-Nya meskipun kalian menyembunyikannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "53. Orang-orang munafik itu akan bersumpah dengan nama Allah dengan penuh kesungguhan: “Hai Rasulullah, jika kamu memerintahkan kami berjihad di jalan Allah pasti kami akan pergi berjihad bersamamu.” Namun Allah membantah dan membongkar aib mereka: “Hai Rasulullah, katakanlah kepada mereka, ‘janganlah kalian bersumpah kerena hakikat diri kalian telah tersingkap, sebab ketaatan yang kalian katakan itu sudah diketahui hanya sebatas ucapan saja. Allah Maha Mengetahui apa yang kalian rencanakan’.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "53. وَأَقْسَمُوا۟ بِاللهِ جَهْدَ أَيْمٰنِهِمْ لَئِنْ أَمَرْتَهُمْ (Dan mereka bersumpah dengan nama Allah sekuat-kuat sumpah, jika kamu suruh mereka) Yakni jika kamu memerintahkan mereka untuk pergi berjihad. لَيَخْرُجُنَّ ۖ( pastilah mereka akan pergi) Makna (جهد أيمانهم) adalah mereka bersaksi dengan segenap kemampuan mereka, padahal perkataan mereka adalah perkataan bohong dan sumpah mereka adalah sumpah palsu; maka dari itu Allah membalas mereka dengan firman-Nya: قُل لَّا تُقْسِمُوا۟ قُل لَّا تُقْسِمُوا۟ ۖ( Katakanlah: “Janganlah kamu bersumpah) Yakni janganlah kalian bersumpah atas pengakuan kalian untuk taat dan ikut pergi berjihad sebagaimana kalian diperintahkan. طَاعَةٌ مَّعْرُوفَةٌ ۚ((karena ketaatan yang diminta ialah) ketaatan yang sudah dikenal) Yakni ketaatan sebagaimana yang seharusnya adalah lebih baik bagi kalian daripada sumpah kalian. إِنَّ اللهَ خَبِيرٌۢ بِمَا تَعْمَلُونَ (Sesungguhnya Allah Maha Mengetahui apa yang kamu kerjakan) maka untuk apa kalian bersumpah kalau kalian memang jujur dalam perkataan kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "53. Orang-orang munafik itu bersumpah demi Allah di hadapan rasulallah dengan memberikan sekuat tenaga untuk menegaskan keimanan mereka: “Sungguh jika kamu memerintah mereka untuk berhjihad, mereka benar-benar akan keluar bersamamu”, akan tetapi keimanan mereka itu hanya kepalsuan. Lalu Allah membalas mereka: “Katakanlah kepada mereka wahai Nabi: “Janganlah kalian bersumpah palsu. Ketaatan kalian hanya di lisan saja, bukan dengan tindakan. Atau kalian dianggap bahwa ketaatan (kalian) yang telah diketahui itu lebih utama daripada keimanan. Sesungguhnya Allah Maha Memberi Kabar tentang amal kalian sehingga tidak ada rahasia kalian yang dapat disembunyikan.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka bersumpah} orang-orang munafik bersumpah {atas (nama) Allah dengan sungguh-sungguh} dengan sungguh-sungguh dalam sumpah mereka dengan kesungguhan yang paling kuat {jika kamu menyuruh mereka, sungguh mereka akan berangkat} Jika nabi Muhammad memerintahkan kami untuk pergi berperang, maka sungguh kami akan berperang bersamanya {Katakanlah,“Janganlah bersumpah} Janganlah bersumpah {karena ketaatan telah diketahui} karena ketaatan kalian itu kepura-puraan yang hanya diketahui di lisan saja bukan tertancap di dalam hati {Sesungguhnya Allah Maha Mengetahui terhadap apa yang kalian kerjakan”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "53 Allah mengabarkan keadaan orang-orang yang tidak ikut berperang bersama Rasulullah ketika berjihad, dari kalangan orang-orang munafik dan orang-orang yang dalam hatinya terdapat penyakit dan kelemahan iman bahwasannya mereka bersumpah atas nama Allah “jika kamu suruh mereka,” (melakukan) hal-hal yang akan dihadapi atau engkau mengeluarkan pernyataan kepada mereka ketika engkau akan keluar (berjihad), “pastilah mereka akan pergi,” makna yang pertama lebih utama. Allah berfirman untuk membantah mereka, “katakanlah, janganlah kamu bersumpah,” kami tidak butuh terhadap sumpah dan dalih alasan kalian. Karena Allah telah memberitahu kami tentang keadaan kalian. Ketaatan kalian telah jelas, tidak tersembunyi bagi kami. Kami mengetahui perasaan berat dan kemalasan pada kalian tanpa ada dalih alasan. Maka tidak perlu lagi alasan dan sumpah kalian. Sesungguhnya orang yang memerlukan sumpah ialah orang yang keadaan jati dirinya masih belum jelas dan kondisinya masih meragukan. Barangkali orang semacam ini alasannya bermanfaat baginya untuk berlepas diri (dari kesalahan). Adapun kalian, maka tidak (diterima) dan tidak (diterima). Perkara yang ditunggu buat kalian dan ditakutkan (terjadi) atas kalian adalah tibanya siksa dan murka Allah. Karena itu, Allah akan mengancam dengan FirmanNya, “sesungguhnya Allah Maha Mengetahui apa yang kamu kerjakan,” lalu Dia akan membalas kalian dengan balasan yang sempurna."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nur ayat 53: Allah Subhaanahu wa Ta'aala memberitahukan keadaan orang-orang yang meninggalkan Rasulullah shallallahu 'alaihi wa sallam yang berangkat jihad, yaitu golongan kaum munafik, serta orang yang dalam hatinya ada penyakit dan lemah iman. Di peperangan selanjutnya. Yakni kami tidak butuh kepada sumpah dan udzurmu, karena Allah telah memberitahukan kepada kami berita kamu. Ada yang menafsirkan, ketaatan kamu sudah diketahui dan tidak samar bagi kami, yaitu hanya di mulut dan tidak sampai dilakukan. Kami telah mengetahui rasa berat dan malas dari kamu tanpa adanya udzur, sehingga kami tidak butuh kepada uzur dan sumpahmu. Kami butuh kepada sumpah adalah kepada orang yang tidak seperti kamu, yaitu orang yang masih mengandung kemungkinan untuk selalu taat. Adapun kamu, maka tidak. Bahkan yang dinantikan untukmu adalah keputusan Allah dan hukuman-Nya. Oleh karena itu, lanjutan ayatnya mereka diancam dengan firman-Nya, “Allah Mahateliti terhadap apa yang kamu kerjakan”, yakni Dia akan memberi balasan kepadamu dengan sempurna. Seperti perkataanmu untuk taat, tetapi kenyataannya menyelisihi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nur Ayat 53",
    "description": "Menyambung kembali penyebutan sifat-sifat orang munafik, Allah menyatakan sebagai berikut, dan selain sikap orang munafik yang menolak hukum darimu, wahai nabi Muhammad, mereka juga bersumpah dengan nama Allah dengan sumpah sungguh-sungguh bahwa jika engkau suruh mereka untuk berperang, pastilah mereka akan pergi. Demikian sumpah mereka. Untuk merespons sumpah mereka, katakanlah wahai nabi, \"janganlah kamu bersumpah palsu karena yang diminta oleh Allah dari kamu adalah ketaatan yang baik dan tulus, bukan ketaatan di mulut saja. Sungguh, Allah mahateliti terhadap apa yang kamu kerjakan, baik pekerjaan lahir maupun batin. \"54. Setelah itu Allah mengingatkan orang-orang mukmin agar tidak teperdaya oleh ulah orang-orang munafik. 'katakanlah, wahai nabi Muhammad, \"taatlah kepada Allah dan taatlah kepada rasul dalam semua perintah dan larangan mereka dengan ketaatan yang tulus. Jika kamu berpaling maka kamu akan tersesat dan merugi, karena sesungguhnya kewajiban rasul itu hanyalah apa yang dibebankan kepadanya, yaitu menyampaikan risalah Allah, dan kewajiban kamu hanyalah apa yang dibebankan kepadamu, yaitu menerima dengan tulus tuntunan rasul tersebut. Jika kamu taat kepadanya dan melaksanakan tuntunannya, niscaya kamu mendapat petunjuk menuju kebahagiaan hidup di dunia dan akhirat. Kewajiban rasul hanyalah menyampaikan amanat Allah dengan jelas melalui ucapan, pembenaran, dan keteladanannya. '."
  }
]