[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai Rasul) kepada sekalian manusia, “Taatilah Allah dan taatilah Rasul. Kemudian bila kalian berpaling, maka sesungguhnya kewajiban seorang Rasul hanyalah mengerjakan apa yang diperintahkan kepadanya, yaitu menyampaikan risalah, dan kewajiban semua umatnya ialah mengerjakan hal-hal yang dibebankan kepada mereka, yaitu melaksanakannya. Dan jika kalian taat kepadanya, niscaya kalian mendapat petunjuk lurus menuju kebenaran. Dan tidaklah menjadi kewajiban seorang rasul kecuali menyampaikan risalah tuhannya dengan penjelasan yang nyata.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "54. Katakanlah -wahai Rasul- kepada orang-orang munafik itu, \"Taatlah kalian kepada Allah dan kepada Rasul, baik dalam perkara lahir ataupun batin; dan jika kalian berpaling dari perkara yang diperintahkan pada kalian berupa ketaatan kepada keduanya, maka sesungguhnya kewajiban Rasul itu adalah apa yang dibebankan kepadanya berupa penyampaian wahyu, adapun kewajiban kamu sekalian adalah semata-mata apa yang dibebankan kepadamu berupa sikap taat, dan beramal sesuai perintah yang disampaikannya. Dan jika kalian taat kepadanya dengan mengerjakan amalan yang diperintahkannya, dan menjauhi larangan yang dia peringatkan, niscaya kalian akan mendapat petunjuk ke jalan yang benar. Dan tidak lain kewajiban Rasul itu melainkan menyampaikan amanat Allah dengan terang, dan dia tidak ditugaskan menganugerahkan kepada kalian petunjuk maupun memaksa kalian untuk itu\"."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "54. Allah menjelaskan keutamaan ketaatan, dengan memerintahkan Rasulullah untuk menyampaikan kepada para hamba: “Taatilah Allah dengan menjalankan hukum-hukum-Nya dan taatilah Rasullah dengan berpegang teguh pada petunjuknya.” Jika kalian enggan dan berpaling maka tugas Rasulullah hanya menyampaikan risalah, sedangkan kalian wajib mentaati apa yang diperintahkan kepada kalian; dan jika kalian mentaati Rasulullah maka kalian akan mendapat petunjuk menuju kebenaran. Dan kewajiban Rasulullah hanya menyampaikan risalah Tuhannya dengan jelas."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "54. قُلْ أَطِيعُوا۟ اللهَ وَأَطِيعُوا۟ الرَّسُولَ ۖ (Katakanlah: “Taat kepada Allah dan taatlah kepada rasul) Yakni dengan ketaatan lahir batin yang berdasarkan keyakinan yang suci dan niat yang benar. فَإِن تَوَلَّوْا۟( dan jika kamu berpaling) Kalimat ini ditujukan bagi orang-orang yang diperintah untuk taat tersebut. Dan asal kata ini adalah (فإن تتولوا). فَإِنَّمَا عَلَيْهِ مَا حُمِّلَ(maka sesungguhnya kewajiban rasul itu adalah apa yang dibebankan kepadanya) Yakni maka ketahuilah bahwa perintah yang dibebankan kepada Nabi adalah menyampaikan risalah, dan beliau telah menjalankannya. وَعَلَيْكُم مَّا حُمِّلْتُمْ ۖ( dan kewajiban kamu sekalian adalah semata-mata apa yang dibebankan kepadamu) Yakni kewajiban kalian adalah mentaati sebagaimana kalian diperintahkan. وَإِن تُطِيعُوهُ(Dan jika kamu taat kepadanya) Dalam segala apa yang diperintahkan dan apa yang dilarang bagi kalian. تَهْتَدُوا۟ ۚ( niscaya kamu mendapat petunjuk) Kalian akan mendapat petunjuk kepada kebenaran dan kebaikan dan kalian akan meraih pahala. وَمَا عَلَى الرَّسُولِ إِلَّا الْبَلٰغُ الْمُبِينُ (Dan tidak lain kewajiban rasul itu melainkan menyampaikan (amanat Allah) dengan terang) Sehingga Rasul tidak mampu memaksa hati kalian untuk beriman, maka dari itu mulailah dengan amal dari diri kalian untuk menjawab seruannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "54. Wahai Nabi, katakanlah kepada orang-orang munafik itu dan yang lainnya: “Taatilah Allah dan rasulNya di setiap perintah dan laranganNya dengan ketaatan yang benar, secara zhahir maupun bathin. Dan jika orang-orang yang diperintah itu berpaling, maka tidak ada yang ditanggung nabi kecuali beban yang dibebankan kepadanya berupa penyampaian risalah. Dan kalian wajib melakukan apa yang diperintahkan kepada kalian berupa ketaatan dan penanggungan beban. Dan jika kalian menaati rasulallah dengan menaati hukum, perintah dan larangannya, maka kalian akan ditunjukkan menuju kebenaran, kebaikan, dan hidayah, dan kalian akan mendapatkan ridha Tuhan. Dan tidak ada kewajiban atas rasul kecuali menyampaikan dengan benar risalah Tuhannya yang terkandung dalam apa yang dibebankan kepada kalian."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Taatlah kepada Allah dan taatlah kepada Rasul. Jika kalian berpaling} berpaling {sesungguhnya kewajiban Rasul} kewajiban Rasul SAW {hanya apa yang dibebankan kepadanya} sesuatu yang dibebankan kepadanya berupa menyampaikan risalah {dan kewajiban kalian hanyalah apa yang dibebankan kepada kalian} apa yang dibebankan kepada kalian berupa ketaatan dan tunduk {Jika kalian taat kepadanya, niscaya kalian mendapat petunjuk} jika kalian taat kepada Rasulullah SAW, maka kalian akan dibimbing menuju kebaikan dan akan mendapatkan kebenaran {Kewajiban Rasul tidak lain hanyalah menyampaikan dengan jelas ”} menyampaikan dengan jelas"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "54 beginilah keadaan mereka dalam aspek yang sama. Adapun tugas Rasulullah adalah memerintahkan dan melarang kalian. Oleh karena itu, Allah berfirman, ”katakanlah, ’taatlah kepada Allah dan taatlah kepada rasul; dan jika’,” mereka melaksanakannya, maka itu adalah keberuntungan dan kebahagian kalian. Dan bila “kalian berpaling, maka sesungguhnya kewajiban rasul itu adalah apa yang dibebankan kepadanya,” berupa (penyampaian) risalah, sementara Rasulullah telah menunaikan tugasnya “dan kewajiban kamu sekalian adalah semata-mata apa yang dibebankan kepadamu,” dalam bentuk ketaatan. Keadaan kalian sudah jelas dan nyata. Kesesatan dan kekeliruan kalian serta azab yang berhak kalian terima (semuanya) telah jelas, “dan jika kamu taat kepadanya, niscaya kamu mendapat petunjuk,” ke jalan yang lurus, dalam ucapan dan amalan. Maka, tidak ada jalan buat kalian menuju hidayah kecuali dengan cara menaatinya. Tidak mungkin itu terjadi tanpa ketaatan, bahkan sesuatu yang mustahil. “dan tidaklah kewajiban rasul itu melainkan menyampaikan (amanat Allah) dengan terang,” maksudnya menyampaikan kepada kalian secara jelas yang tiada menyisakan keraguan dan syubhat. Sungguh Rasulullah telah melakukannya. Beliau telah menyampaikan (risalah) dengan sejelas-jelasnya. Sesungguhnya Dzat yang akan memperhitungkan (amalan) kalian dan memberikan balasan bagi kalian adalah Allah. Rasulullah tiada memiliki kekuasaan sedikitpun dalam hal ini. Dan beliau telah menunaikan tugasnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nur ayat 54: Itulah letak kebahagiaan kamu. Yaitu menyampaikan, dan Beliau telah melakukannya. Yaitu menaati. Namun ternyata kamu tidak berbuat demikian, maka jelas kamu dalam kesesatan dan berhak mendapat azab. Ke jalan yang lurus. Yang tidak menyisakan keraguan dan syubhat (kesamaran). Tugas Beliau adalah menerangkan dengan jelas, adapun menghisab, maka hal itu adalah urusan Allah Subhaanahu wa Ta'aala."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nur Ayat 54",
    "description": "Setelah itu Allah mengingatkan orang-orang mukmin agar tidak teperdaya oleh ulah orang-orang munafik. 'katakanlah, wahai nabi Muhammad, \"taatlah kepada Allah dan taatlah kepada rasul dalam semua perintah dan larangan mereka dengan ketaatan yang tulus. Jika kamu berpaling maka kamu akan tersesat dan merugi, karena sesungguhnya kewajiban rasul itu hanyalah apa yang dibebankan kepadanya, yaitu menyampaikan risalah Allah, dan kewajiban kamu hanyalah apa yang dibebankan kepadamu, yaitu menerima dengan tulus tuntunan rasul tersebut. Jika kamu taat kepadanya dan melaksanakan tuntunannya, niscaya kamu mendapat petunjuk menuju kebahagiaan hidup di dunia dan akhirat. Kewajiban rasul hanyalah menyampaikan amanat Allah dengan jelas melalui ucapan, pembenaran, dan keteladanannya. '55. Allah menjanjikan hidayah bagi mereka yang taat kepada-Nya dan rasul-Nya. Melalui ayat ini Allah menegaskan janji lainnya bagi yang beriman dan beramal salih. Allah telah menjanjikan secara pasti kepada orang-orang di antara kamu yang beriman dan yang membuktikan ke-imanannya dengan mengerjakan kebajikan, yaitu semua aktivitas yang bermanfaat sesuai tuntunan agama, bahwa dia sungguh akan menjadikan mereka berkuasa di bumi seperti kuasa raja atas kerajaannya, seba-gaimana dia telah menjadikan orang-orang sebelum mereka berkuasa, dan sungguh, dia akan meneguhkan bagi mereka dengan agama yang telah dia ridai. Dan dia benar-benar mengubah keadaan mereka setelah berada dalam ketakutan yang mencekam menjadi aman sentosa. Mereka menyembah-ku dengan tidak mempersekutukan-ku dengan sesuatu apa pun, baik secara nyata atau tersembunyi. Tetapi, barang siapa tetap kafir setelah janji yang pasti itu maka mereka itulah orang-orang yang fasik dan keluar dari koridor agama. Melalui ayat ini Allah menetapkan dua syarat bagi orang-orang yang ingin memperoleh kekuasaan dan rasa aman, yaitu beriman dengan benar dan berbuat kebajikan. Bila kedua syarat itu terpenuhi dalam suatu masyarakat, pasti janji Allah itu akan menjadi nyata."
  }
]