[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah menjanjikan kemenangan bagi orang-orang yang beriman dari kalian dan mengerjakan amal-amal shalih, dengan mewariskan kepada mereka tanah kekuasaan kaum musyrikin dan menjadikan mereka penguasa padanya, sebagaimana Allah memperlakukan para pendahulu mereka dari kalangan kaum Mukminin yang beriman kepada Allah dan rasul-rasulNya, dan menjadikan agama mereka yang diridhaiNya bagi mereka (yaitu Islam) sebagai agama mulia lagi kuat dan menggantikan keadaan mereka dari ketakutan menuju keadaan aman, bila mereka beribadah kepada Allah semata dan istiqamah di atas ketaatan kepadaNya, tidak mempersekutukan sesuatu pun bersamaNya. Dan barangsiapa kafir setelah mengambil alih kekuasaan kaum Musyrikin, keadaan aman, penguasaan dan kekuasaan yang penuh dan mengingkari nikmat-nikmat Allah, maka mereka itu adalah orang-orang yang telah keluar dari ketaatan kepada Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "55. Allah telah berjanji kepada orang-orang yang beriman terhadap Allah dan mengerjakan amal-amal yang saleh di antara kalian bahwa Dia sungguh akan menolong mereka untuk mengalahkan musuh-musuh mereka, dan akan menjadikan mereka berkuasa di muka bumi, sebagaimana Dia telah menjadikan orang-orang sebelum mereka dari kalangan kaum mukminin untuk berkuasa, dan sungguh Dia berjanji akan meneguhkan bagi mereka agama yang telah diridai-Nya untuk mereka yaitu Islam, serta berjanji benar-benar akan menukar keadaan mereka, sesudah mereka dalam ketakutan menjadi aman sentosa. Mereka tetap menyembah-Ku semata, dengan tiada mempersekutukan sesuatu apapun dengan-Ku. Dan barangsiapa yang tetap kafir sesudah adanya nikmat dan karunia itu, maka mereka itulah orang-orang yang fasik lagi keluar dari ketaatan kepada Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "55. Allah memberi kabar gembira berupa kemenangan bagi orang-orang beriman yang mentaati-Nya. Allah menjanjikan mereka dengan janji yang pasti bahwa Allah akan menjadikan mereka penguasa dunia yang dapat berkuasa seperti raja terhadap budak-budaknya, sebagaimana Allah telah menjadikan orang-orang beriman dari umat-umat terdahulu sebagai penguasa dunia. Dan Allah akan memberi kejayaan bagi agama Islam sebagai agama Dia ridhai bagi mereka, dan memberi keamanan dan ketentraman setelah ketakutan mereka terhadap para musuh. Hal ini jika mereka hanya menyembah Allah semata, tanpa menyekutukan-Nya dengan sesuatu apapun. Dan barangsiapa yang enggan mensyukuri kenikmatan-kenikmatan ini maka mereka telah jauh dari kebenaran dan berpaling dari ketaatan Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "55. لَيَسْتَخْلِفَنَّهُمْ فِى الْأَرْضِ (bahwa Dia sungguh-sungguh akan menjadikan mereka berkuasa dimuka bumi) Sungguh Allah akan menjadikan mereka sebagai pengusa di bumi agar mereka berkuasa seperti kekuasaan seorang raja pada budak-budaknya. كَمَا اسْتَخْلَفَ الَّذِينَ مِن قَبْلِهِمْ (sebagaimana Dia telah menjadikan orang-orang sebelum mereka berkuasa) Seperti orang-orang Bani Israil dan lainnya. وَلَيُمَكِّنَنَّ لَهُمْ دِينَهُمُ الَّذِى ارْتَضَىٰ لَهُمْ(dan sungguh Dia akan meneguhkan bagi mereka agama yang telah diridhai-Nya untuk mereka) Yakni Allah akan menjadikannya kuat dan kokoh serta meluaskan daerah kekuasaan mereka, kemudian memenangkan agama Islam atas agama-agama lainnya, agar kekuasaan menjadi milik mereka dan penerus mereka selama mereka tetap teguh di atas keimanan dan amal shaleh. وَلَيُبَدِّلَنَّهُم مِّنۢ بَعْدِ خَوْفِهِمْ أَمْنًا ۚ( dan Dia benar-benar akan menukar (keadaan) mereka, sesudah mereka dalam ketakutan menjadi aman sentausa) Yakni mengganti ketakutan mereka dari para musuh dengan rasa aman, sehingga mereka tidak merasa takut melainkan kepada Allah dan tidak berharap kecuali kepada-Nya. Dahulu kaum muslimin sebelum hijrah dan beberapa waktu setelahnya berada dalam ketakutan yang besar dari orang-orang musyrik, mereka tidak keluar rumah melainkan dengan membawa senjata, tiada hari bagi mereka melainkan selalu dalam kesiagaan dari mudharat yang akan ditimpakan orang-orang kafir kepada mereka. Kemudian setelah itu mereka berada dalam keamanan dan ketentraman yang luar biasa, dan Allah menghinakan bagi mereka setan-setan dari kaum musyrikin, menakhlukkan berbagai negeri bagi mereka, serta mengokohkan mereka di muka bumi, walhamdulillah. يَعْبُدُونَنِى لَا يُشْرِكُونَ بِى شَيْـًٔا ۚ( Mereka tetap menyembahku-Ku dengan tiada mempersekutukan sesuatu apapun dengan Aku) Yakni ini adalah yang wajib mereka lakukan agar Aku memenuhi janji yang Aku berikan bagi mereka tersebut. وَمَن كَفَرَ بَعْدَ ذٰلِكَ(Dan barangsiapa yang (tetap) kafir sesudah (janji) itu) Yakni barangsiapa yang ingkar terhadap kenikmatan-kenikmatan itu setelah janji yang benar ini. فَأُو۟لٰٓئِكَ(maka mereka itulah) Yakni orang-orang yang ingkar itu. هُمُ الْفٰسِقُونَ(orang-orang yang fasik) Yakni orang-orang yang benar-benar fasik, yaitu yang tidak taat dan sangat kafir."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "55. Allah memberikan orang-orang dari golongan kalian yang beriman kepadaNya dan rasulNya suatu janji yang pasti, bahwa Dia benar-benar akan menjadikan mereka para khalifah yang mengatur kerajaan-kerajaan mereka di bumi, sebagaimana menjadikan khalifah orang-orang sebelum mereka, yaitu Bani Israil sebagai perumpamaan pengganti Fir’aun dan kaumnya dan menetapkan bagi mereka kaidah-kaidah agama mereka dengan cara yang tepat. Agama yang menyenagkan bagi mereka yaitu agama islam. Dan membuat mereka aman dan tenang setelah ketakutan karena musuh. Mereka menyembah hanya kepadaKu, tidak menyekutukanKu dengan satu pun makhluk. Dan orang yang mengingkari nikmat ini setelah itu, maka mereka itu adalah orang-orang kafir yang digambarkan dengan tidak memiliki moral, yaitu keluar dari ketaatan. Ayat ini diturunkan terkait hak orang-orang mukmin yang berhijrah dari Mekah menuju Madinah. Ketika mereka berkerumun dengan orang-orang Arab, mereka merasa gelisah dan tidak bisa tidur kecuali dengan membawa pedang, Kemudian mereka (orang mukmin) berkata: “Kapan engkau melihat kami bisa hidup tenang sehingga kami bisa bermalam dengan aman dan tenang, dan tidak takut kecuali hanya kepada Allah?” kemudian turunlah ayat ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Allah telah berjanji kepada orang-orang yang beriman di antara kalian dan yang beramal shalih bahwa Dia sungguh akan menjadikan mereka berkuasa} menjadikan mereka khalifah {di bumi sebagaimana Dia telah menjadikan orang-orang sebelum mereka berkuasa; Dia sungguh akan meneguhkan bagi mereka agama mereka} dan sungguh Dia akan meneguhkan bagi mereka agama Islam dengan menampakkan dan menguatkan pemeluknya {yang telah Dia ridhai} yang telah Dia pilih {untuk mereka dan Dia sungguh akan mengubah mereka setelah berada dalam ketakutan menjadi aman. Mereka menyembahKu dengan tidak menyekutukanKu dengan sesuatu apa pun. Siapa saja yang ingkar setelah tersebut, mereka itulah orang-orang fasik"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "55 ini termasuk janjiNya yang benar, yang telah dapat disaksikan penafsiran dan kenyataannya, bahwasannya Dia telah menjanjikan orang yang menegakkan iman dan amal shalih dari umat ini, untuk menjadikan mereka penguasa di muka bumi. Mereka akan menjadi para pemimpin di bumi, yang memegang kendali pengaturannya. Sesungguhnya Allah (juga) akan memantapkan “bagi mereka agama yang telah diridhaiNya untuk mereka,” yaitu agama islam yang menggungguli seluruh agama. Allah meridhainya untuk umat ini karena keutamaan umat ini, kemuliaan dan curahan kenikmatan bagi mereka, dalam wujud, mereka sanggup menegakkan agam islam, syariatNya yang zahir atau yang batin, dalam diri-diri mereka dan orang lain. Pasalnya, orang-orang selain mereka, seperti para pemeluk agama-agama dan orang-orang kafir akan terkalahkan dan menjadi hina. Allah akan menggantikkan keadaan mereka “setelah ketakutan mereka,” (dahulu) salah seorang dari mereka tidak dapat menampakkan agamanya, tiada lain disebabkan gencarnya gangguan dari banyak orang kafir dan keberadaan jamaah kaum muslimin yang berjumlah sedikit sekali bila dibandingkan jumlah mereka. Penduduk bumi telah sepakat memerangi kaum Muslimin. Mereka telah berbuat melampaui batas dengan berbagai macam kezhaliman. Allah menjanjikan kaum Mukminin peristiwa-peristiwa di atas ketika ayat ini turun. Padahal umat islam belum menyaksikan pengendalian kekuasaan di bumi dan pendudukan posisi di sana, serta kesanggupan untuk menegakkan agam islam dan stabilitas keamanan yang sempurna, lantaran mereka menyembah Allah dan tidak menyekutukanNya dengan sesuatu apa pun tanpa merasa takut kepada seorang pun kecuali hanya kepada Allah saja. Generasi awal umat ini melaksanakan keimanan dan amal shalih yang menggungguli umat lain, maka Allah meneguhkan mereka (untuk menguasai) negeri-negri dan umat manusia. Penjuru timur dan barat bumi telah ditaklukkan, sehingga diperoleh stabilitas keamanan yang sempurna dan pendudukan yang kuat. Ini termasuk ayat-ayat Allah yang menakjubkan dan menawan. Perkara ini akan terus berlaku sampai Hari Kiamat. Selama mereka menegakkan iman dan amal shalih, pasti janji Allah kepada mereka akan terwujud. Orang-orang kafir dan munafik hanya mampu menguasai (kaum muslimin) dan dimenangkan pada sebagian waktu lantaran kesalahan yang dilakukan kaum Muslimin terhadap keimanan dan amal shalih. “dan barangsiapa yang (tetap) kafir sesudah (janji) itu,” yaitu kedudukan dan kekuasaan yang sempurna bagi kalian, wahai kaum muslimin. “maka mereka itulah orang-orang yang fasik,” orang-orang yang keluar dari ketaatan kepada Allah dan mengalami kerusakan (jiwa dan hati), mereka tidak pantas dengan kebaikan serta tidak ada kemampuan menerima perbaikan. Karena, seseorang yang meninggalkan keimannanya ketika dalam keadaan perkasa dan kuat serta tidak adanya sebab yang menghalanginya untuk beriman, ini menunjukkan kerusakan niat dan kejelekan jiwanya. Pasalnya, tidak ada faktor yang mendorong untuk meninggalkan agama ini kecuali perkara-perkara tersebut. Ayat ini menunjukkan bahwa Allah telah menundukkan orang-orang sebelum kita dan menjadikan mereka pimpinan di bumi ini, sebagimana yang dikatakan Musa kepada kaumnya, “dan menjadikan kamu khalifah di bumi (Nya), maka Dia akan melihat bagaimana perbuatanmu,” (al-a’raf :129) Dan firman Allah, “dan kami hendak memberi karunia kepada orang-orang yang tertindas di bumi (mesir) itu [dan hendak menjadikan mereka pemimpin dan menjadikan mereka orang-orang yang mewarisi (bumi)], dan kami teguhkan kedudukan mereka di bumi,” (al-qashash :5-6)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nur ayat 55: Hakim meriwayatkan dengan sanadnya yang sampai kepada Ubay bin Ka’ab radhiyallahu 'anhu ia berkata, “Ketika Rasulullah shallallahu 'alaihi wa sallam dan para sahabatnya datang ke Madinah, maka orang-orang Anshar mendatangi mereka. Orang-orang Arab kemudian melempar panah dari satu busur, di mana mereka tidak bermalam kecuali dengan senjata dan tidak berada di pagi hari kecuali dengannya, maka mereka berkata, “Tidakkah kamu melihat bahwa kita bangun sampai tidur malam dalam keadaan aman, tenang dan tidak takut kecuali kepada Allah.” Maka turunlah ayat, “Wa’adalahulladziina aamanuu minkum…dst.” (Hadits ini menurut Hakim shahih isnadnya, namun keduanya (Bukhari-Muslim) tidak menyebutkannya, dan didiamkan oleh Adz Dzahabi). Syaikh Muqbil menjelaskan dalam Ash Shahihul Musnad min Asbaabin Nuzul, “Hadits ini dalam sanadnya terdapat Ali bin Al Husain bin Waqid, ia didha'ifkan oleh Abu Hatim, dan ditinggalkan oleh Bukhari, ia berkata, “Ishaq berpikiran buruk terhadapnya,” namun ditsiqahkan oleh Ibnu Hibban. Sedangkan Nasa’i berkata, “Dia tidak mengapa.” Akan tetapi Al Haitsami dalam Majma’uzzawaa’id juz 7 hal. 83 berkata, “Diriwayatkan oleh Thabrani dalam Al Awsath dan para perawinya adalah tsiqah.” Thabari juga menyebutkan hadits ini pada juz 18 hal. 159 secara mursal dari Abul ‘Aliyah. Menggantikan orang-orang kafir. Ini termasuk janji-janji Allah yang benar; yang kenyataannya dapat disaksikan, Dia menjanjikan kepada orang yang beriman dan beramal saleh dari umat ini, bahwa Dia akan menjadikan mereka berkuasa di bumi, mereka akan menjadi khalifah-khalifahnya di sana dan yang mengaturnya, dan bahwa Dia akan meneguhkan agama yang Dia ridhai untuk mereka, yaitu Islam dan mereka akan dapat menegakkan perintah-perintah dalam agama ini dan menegakkan syiar-syiarnya yang sebelumnya dihalangi. Oleh karena itu, ketika generasi pertama umat ini beriman dan beramal saleh, maka Allah memberikan kekuasaan kepada mereka untuk menguasai negeri dan rakyatnya, mereka berhasil menaklukkan negeri yang berada di bagian timur maupun di bagian barat. Ketika itu, tercapai keamanan dan kekuasaan yang sempurna. Hal ini termasuk ayat-ayat Allah yang mengagumkan dan jelas, dan hal ini akan tetap ada sampai hari kiamat selama mereka beriman dan beramal saleh, oleh karenanya apa yang dijanjikan Allah akan terwujud, Dia memberikan kekuasaan kepada kaum kafir dan munafik adalah sebagai pergiliran untuk mereka dalam sebagian waktu disebabkan kaum muslimin tidak memperhatikan iman dan amal saleh. Seperti berkuasanya Bani Israil terdahulu menggantikan raja-raja yang kejam. Yaitu dengan mengunggulkannya di atas agama yang lain dan membukakan negeri-negeri untuk mereka. Yakni setelah kaum muslimin berkuasa. Yakni keluar dari ketaatan kepada Allah dan mengadakan kerusakan, dan tidak cocok untuk kebaikan, karena orang yang meninggalkan keimanan saat dalam keadaan mulia dan berkuasa, dan tidak ada yang menghalanginya untuk beriman menunjukkan niatnya yang rusak dan maksudnya yang buruk."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nur Ayat 55",
    "description": "Allah menjanjikan hidayah bagi mereka yang taat kepada-Nya dan rasul-Nya. Melalui ayat ini Allah menegaskan janji lainnya bagi yang beriman dan beramal salih. Allah telah menjanjikan secara pasti kepada orang-orang di antara kamu yang beriman dan yang membuktikan ke-imanannya dengan mengerjakan kebajikan, yaitu semua aktivitas yang bermanfaat sesuai tuntunan agama, bahwa dia sungguh akan menjadikan mereka berkuasa di bumi seperti kuasa raja atas kerajaannya, seba-gaimana dia telah menjadikan orang-orang sebelum mereka berkuasa, dan sungguh, dia akan meneguhkan bagi mereka dengan agama yang telah dia ridai. Dan dia benar-benar mengubah keadaan mereka setelah berada dalam ketakutan yang mencekam menjadi aman sentosa. Mereka menyembah-ku dengan tidak mempersekutukan-ku dengan sesuatu apa pun, baik secara nyata atau tersembunyi. Tetapi, barang siapa tetap kafir setelah janji yang pasti itu maka mereka itulah orang-orang yang fasik dan keluar dari koridor agama. Melalui ayat ini Allah menetapkan dua syarat bagi orang-orang yang ingin memperoleh kekuasaan dan rasa aman, yaitu beriman dengan benar dan berbuat kebajikan. Bila kedua syarat itu terpenuhi dalam suatu masyarakat, pasti janji Allah itu akan menjadi nyata. 56. Melanjutkan perintah Allah kepada orang-orang mukmin untuk menaati Allah dan rasul-Nya, Allah berfirman, 'dan laksanakanlah salat dengan khusyuk, berkesinambungan, dan memenuhi semua rukun, syarat, dan sunnahnya; tunaikanlah zakat secara sempurna sesuai tuntunan agama, dan taatlah kepada rasul agar kamu diberi rahmat."
  }
]