[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan tegakkanlah shalat dengan sempurna, dan tunaikanlah zakat kepada orang-orang yang berhak menerimanya dan taatilah Rasul, mudah-mudahan kalian dirahmati oleh Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "56. Dan dirikanlah salat secara sempurna, tunaikanlah zakat harta kalian, dan taatlah kepada Rasul dengan mengerjakan perintah dan meninggalkan larangannya, supaya kalian mendapatkan rahmat Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "56. Hai orang-orang beriman, dirikanlah shalat dengan menyempurnakan rukun-rukunnya dan pada waktu yang telah ditentukan, tunaikanlah zakat kepada orang-orang yang berhak menerimannya, dan taatilah Rasulullah dengan berpegang teguh kepada petunjuknya, agar kalian meraih rahmat Allah yang luas."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "56. لَعَلَّكُمْ تُرْحَمُونَ (supaya kamu diberi rahmat) Yakni laksanakanlah apa yang disebutkan itu dengan penuh harapan agar Allah merahmati kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "56. Taatlah kepada Allah dan RasulNya, dirikanlah shalat pada waktunya, tunaikanlah zakat kepada yang berhak menerimanya, dan taatlah kepada Rasulallah dalam apa yang diperintahkan dan dilarang. Supaya kalian disayang dan memenangkan surga dan keridhaan Allah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dirikanlah shalat, tunaikanlah zakat, dan taatlah kepada Rasul agar kalian dirahmati"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "56 Allah memerintahkan penegakan shalat beserta (melengakapi) rukun, syarat dan adab-adabnya secara lahir dan batin, dan memberikan zakat dari harta-harta yang Allah titipkan dan berikan kepada para hamba dengan cara menyerahkannya kepada orang-orang fakir dan selain mereka yang disebutkan Allah termasuk golongan yang berhak menerima zakat. Dua ibadah ini merupakan ketaatan yang paling agung dan mulia, yang menggabungkan antara hakNya dan hak makhlukNya, dan supaya ikhlas kepada Dzat yang disembah dan berbuat baik kepada sesama manusia. Kemudian Allah menambahkan perintah umum setelah dua perkara tadi, seraya berfirman, “dan taatlah kamu kepada Rasul,” dengan melaksanakan perintah-perintahnya dan menjauhi larangan-larangannya, “barangsiapa yang taat kepada Rasul, maka sungguh dia telah menaati Allah,” (an-nisa:80) “supaya kalian,” ketika kalian melaksanakan perkara itu “diberi rahmat,” maka siapa yang menginginkan rahmat, inilah jalannya. Dan barangsiapa yang mengharapkannya tanpa menegakkan shalat dan membayarkan zakat serta taat kepada rasul, maka dia hanyalah seorang yang mengkhayal lagi berdusta. Nafsunya telah memberinya angan-angan dusta."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nur ayat 56: Allah Subhaanahu wa Ta'aala memerintahkan mendirikan shalat, yakni dengan melaksanakan rukun, syarat dan adab-adabnya zahir maupun batin, serta menunaikan zakat dari harta yang diberikan Allah kepada mereka. Keduanya adalah ketaatan yang paling besar dan paling agung, menggabung hak-Nya dan hak hamba-hamba-Nya, yaitu berbuat ikhlas kepada Allah dan berbuat ihsan kepada hamba-hamba Allah. Di samping itu, apabila seseorang telah menjalankan keduanya, maka akan mudah menjalankan perintah-perintah yang lain. Oleh karena itu, pada lanjutan ayatnya Allah Subhaanahu wa Ta'aala memerintahkan dengan perintah umum, yaitu menaati Rasul dalam segala urusan, dengan melaksanakan perintah dan menjauhi larangan. Ketika melakukan semua itu. Oleh karena itu, barang siapa yang menginginkan rahmat, maka itulah jalannya. Maka dari itu, barang siapa yang mengharap rahmat, namun tidak shalat, tidak zakat dan tidak taat kepada rasul, maka ia hanyalah orang yang berangan-angan lagi dusta."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nur Ayat 56",
    "description": "Melanjutkan perintah Allah kepada orang-orang mukmin untuk menaati Allah dan rasul-Nya, Allah berfirman, 'dan laksanakanlah salat dengan khusyuk, berkesinambungan, dan memenuhi semua rukun, syarat, dan sunnahnya; tunaikanlah zakat secara sempurna sesuai tuntunan agama, dan taatlah kepada rasul agar kamu diberi rahmat. 57. Janganlah engkau mengira bahwa orang-orang yang kafir itu dapat melemahkan Allah di bumi, sehingga mereka dapat menghindar dari siksa dan ketetapan-Nya. Ketahuilah bahwa hal itu mustahil terjadi, sedang tempat kembali mereka di akhirat nanti adalah neraka. Dan itulah seburuk-buruk tempat kembali."
  }
]