[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Janganlah kamu menyangka bahwa orang-orang kafir mampu melemahkan Allah di muka bumi, bahkan sebaliknya, Allah Maha kuasa untuk membinasakan mereka. Dan tempat kembali mereka di akhirat kelak adalah neraka. Dan itulah seburuk-buruk tempat kembali dan tempat berpulang. Ayat ini merupakan taujih yang umum bagi seluruh umat, walaupun khiyabnya ditujukan kepada nabi Muhammad"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "57. Janganlah engkau menyangka -wahai Rasul- bahwa orang-orang yang kafir kepada Allah itu dapat melemahkan-Ku ketika Aku hendak menurunkan kepada mereka azab di bumi ini, sedang tempat tinggal mereka pada hari Kiamat kelak adalah neraka Jahanam. Dan sungguh amat jeleklah tempat kembali orang-orang yang dikembalikan ke Neraka Jahanam."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "57. Hai Rasulullah, janganlah kamu mengira orang-orang kafir akan mengalahkan Allah sehingga Dia tidak mampu menyiksa mereka, Dia Maha Kuasa untuk menghancurkan mereka, dan tempat mereka di akhirat adalah di neraka, dan neraka adalah seburuk-buruk tempat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "57. لَا تَحْسَبَنَّ الَّذِينَ كَفَرُوا۟ مُعْجِزِينَ فِى الْأَرْضِ ۚ (Janganlah kamu kira bahwa orang-orang yang kafir itu dapat melemahkan (Allah dari mengazab mereka) di bumi ini) Yakni janganlah kamu mengira mereka akan dapat menghindar dari-Ku jika Aku hendak menimpa mereka dengan azab."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "57. Wahai Rasul, janganlah kalian mengasumsikan bahwa orang-orang kafir bisa mengalahkan Allah SWT sehingga Dia tidak bisa menghukum mereka, yaitu mereka bisa melarikan diri di bumi saat Dia akan disiksa. Dan tempat kembali mereka atau tempat peristirahatan mereka di akhirat adalah neraka. Dan seburuk-buruk tempat kembali adalah neraka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Janganlah mengira}janganlah mengira {bahwa orang-orang yang ingkar itu dapat melemahkan (Allah)} luput dari azab dengan melarikan diri {di bumi. Tempat kembali mereka adalah neraka. Itulah seburuk-buruk tempat kembali"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "57 “janganlah kamu kira bahwa orang-orang yang kafir itu dapat melemahkan (Allah dari mengazab mereka) di bumi ini.” Janganlah kalian terpedaya dengan kenikmatan yang telah mereka nikmati pada kehidupan dunia. Karena sesungguhnya Allah hanya mengulur mereka tapi tidak melalikan mereka. “kami biarkan mereka bersenang-senang sebentar, kemudian kami paksa mereka (masuk) ke dalam siksa yang keras,”(luqman:34) Karenanya, Dia berfirman, ”sedang tempat tinggal mereka (di akhirat) adalah neraka. Dan sungguh amat jeleklah tempat kembali itu,” maksudnya tempat kesudahan yang paling jelek adalah tempat kembali bagi orang-orang kafir, tempat kembali yang jelek, penuh derita dan hukuman yang abadi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nur ayat 57: Oleh karena itu, janganlah kamu tertipu hanya karena mereka diberi kesenangan dalam kehidupan dunia, karena Allah Subhaanahu wa Ta'aala meskipun menunda mereka, tetapi tidak membiarkan. Allah Subhaanahu wa Ta'aala berfirman, “Kami biarkan mereka bersenang-senang sebentar, kemudian Kami paksa mereka (masuk) ke dalam siksa yang keras.” (Terj. Luqman: 24) Karena di dalamnya penuh keburukan, penuh penyesalan dan penuh derita dan azab yang kekal."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nur Ayat 57",
    "description": "Janganlah engkau mengira bahwa orang-orang yang kafir itu dapat melemahkan Allah di bumi, sehingga mereka dapat menghindar dari siksa dan ketetapan-Nya. Ketahuilah bahwa hal itu mustahil terjadi, sedang tempat kembali mereka di akhirat nanti adalah neraka. Dan itulah seburuk-buruk tempat kembali. 58. Kembali berbicara tentang etika dalam pergaulan, Allah menegaskan, 'wahai orang-orang yang beriman! hendaklah hamba sahaya yang kamu miliki, baik laki-laki maupun perempuan yang telah atau hampir balig, dan orang-orang yaitu anak-anak yang sudah paham tentang aurat meskipun belum balig di antara kamu, hendaklah mereka semua meminta izin kepada kamu pada tiga kali atau tiga kesempatan dalam satu hari, yaitu sebelum salat subuh, ketika kamu menanggalkan pakaian luarmu di tengah hari untuk sekadar berbaring atau beristirahat, dan setelah salat isya hingga sepanjang malam karena ketika itu kamu bersiap atau sedang tidur. Itulah tiga waktu yang biasa kamu gunakan untuk mengganti pakaian sehingga kemungkinan aurat terlihat bagi kamu. Tidak ada dosa bagi kamu dan tidak pula bagi mereka bila masuk tanpa meminta izin selain dari tiga waktu itu; mereka sering keluar masuk melayani kamu, sebagian kamu ada keperluan atas sebagian yang lain, dan interaksi semacam ini tidak mudah dihindari. Demikianlah Allah menjelaskan ayat-ayat itu kepadamu. Dan Allah maha mengetahui apa yang bermanfaat bagi hamba-Nya, mahabijaksana dalam ketentuan dan bimbingan-Nya."
  }
]