[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang yang beriman kepada Allah dan RasulNya serta melaksanakan syariatNya, perintahkanlah budak-budak laki-laki kalian dan hamba-hamba sahaya wanita kalian, serta anak-anak yang merdeka sebelum usia baligh untuk meminta izin ketika akan menemui kalian di tiga waktu di mana aurat kalian biasa terbuka, yaitu sebelum shalat shubuh, sebab ia merupakan dilepasnya pakaian tidur dan mengenakan pakaian keseharian, waktu melepas pakaian untuk untuk istirahat siang di waktu siang hari dan setelah shalat isya, karena merupakan saat untuk tidur. Tiga waktu ini merupakan aurat bagi kalian, di mana pada waktu-waktu tersebut kalian jarang mengenakan pakaian tertutup. Adapun pada waktu selain itu, maka tidak masalah jika mereka masuk tanpa izin, karena kebutuhan mereka untuk menemui kalian. Mereka mondar-mandir untuk melayani kalian dan kerena kebiasan berjalan bulak-balik sebagian kepada sebagian yang yang lain untuk menunaikan kemaslahatan. Dan sebagaimana Allah telah menerangkan kepada kalian hukum-hukum tentang meminta izin, Dia juga menerangkan kepada kalian ayat-ayat dan hokum-hukumNYa, serta hujjah-hujjah dan aturan-aturan agamaNya. Dan Allah Maha Mengetahui segala perkara yang memperbaiki keadaan makhlukNya, Mahabijaksana dalam pengaturan urusan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "58. \"Wahai orang-orang yang beriman kepada Allah dan beramal dengan syariat-Nya, hendaknya hamba sahaya lelaki dan wanita yang kalian miliki, serta anak-anak merdeka yang belum mencapai usia dewasa atau balig di antara kalian meminta izin kepada kalian dalam tiga waktu (dalam sehari) yaitu: sebelum salat subuh yang merupakan waktu pergantian pakaian tidur dengan pakaian biasa; ketika waktu tengah hari yang merupakan waktu menanggalkan pakaian luarmu untuk beristirahat siang; dan sesudah salat isya yang merupakan waktu tidur dan waktu mengganti pakaian biasa dengan pakaian tidur. Tiga waktu ini merupakan tiga aurat bagi kalian, mereka tidak boleh ada yang boleh masuk kamar kalian kecuali atas izin kalian. Tidak ada dosa atas kalian dan tidak pula atas mereka bila mereka memasuki ruangan kalian selain dari tiga waktu itu tanpa izin. Mereka banyak melayani kalian, sebagian kalian punya keperluan kepada sebagian yang lain sehingga sangat susah bila mereka dilarang untuk menemui kalian di setiap waktu dengan izin dahulu. Sebagaimana Allah menjelaskan kepada kalian hukum-hukum perizinan ini bagi kalian, maka Dia juga menjelaskan ayat-ayat yang menunjukkan hukum-hukum syariat-Nya kepada kalian. Dan Allah Maha Mengetahui maslahat hamba-hamba-Nya, lagi Maha Bijaksana dalam menetapkan hukum-hukum syariat bagi mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "58. Allah mengajarkan orang-orang beriman adab-adab yang mulia dan hukum-hukum yang bijaksana, yaitu dalam meminta izin ketika dalam rumah agar dapat menjaga penutupan aurat. Allah memerintahkan mereka dengan tegas agar para budak laki-laki dan perempuan, dan anak-anak yang belum baligh untuk meminta izin sebelum masuk ke ruangan mereka pada tiga waktu; waktu tidur sebelum shalat subuh, waktu siang ketika mereka melepas pakaian untuk tidur siang, dan waktu setelah shalat isya ketika bersiap dan saat tidur malam. Pada tiga waktu ini terdapat kemungkinan besar dapat terlihatnya aurat. Adapun pada selain tiga waktu ini maka kalian dan mereka tidak ada larangan untuk masuk tanpa meminta izin, karena mereka adalah pembantu kalian yang sering keluar masuk kepada kalian dan kalian saling mengitari. Demikianlah hukum-hukum syariat yang Allah jelaskan kepada kalian agar kalian menjadi orang yang beradab. Allah Maha Mengetahui perkataan dan perbuatan kalian, dan Maha Bijaksana dalam mengatur kemaslahatan kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "58. يٰٓأَيُّهَا الَّذِينَ ءَامَنُوا۟ لِيَسْتَـْٔذِنكُمُ الَّذِينَ مَلَكَتْ أَيْمٰنُكُمْ (Hai orang-orang yang beriman, hendaklah budak-budak yang kamu miliki) Yakni budak-budak laki-laki dan perempuan. وَالَّذِينَ لَمْ يَبْلُغُوا۟ الْحُلُمَ مِنكُمْ(dan orang-orang yang belum balig di antara kamu) Yakni anak-anak kecil laki-laki dan perempuan. ثَلٰثَ مَرّٰتٍ ۚ( meminta izin kepada kamu tiga kali) Yakni tiga waktu dalam sehari semalam. Pendapat lain mengatakan yang dimaksud adalah tiga kali izin setiap kali mereka memintanya. Yakni tidak lebih dari tiga kali. مِّن قَبْلِ صَلَوٰةِ الْفَجْر(yaitu: sebelum sembahyang subuh) Sebab ini adalah waktu bangun tidur dan mengganti baju tidur dengan baju biasa, atau bahkan seseorang tidur dalam keadaan telanjang atau dalam keadaan yang tidak ia sukai untuk dilihat orang lain. وَحِينَ تَضَعُونَ ثِيَابَكُم مِّنَ الظَّهِيرَةِ (ketika kamu menanggalkan pakaian (luar)mu di tengah hari) Sebab mereka mungkin saja dalam keadaan melepas pakaian untuk tidur siang. وَمِنۢ بَعْدِ صَلَوٰةِ الْعِشَآءِ ۚ( dan sesudah sembahyang Isya’) Sebab ini adalah waktu melepas pakaian dan bercengkrama dengan keluarga. ثَلٰثُ عَوْرٰتٍ لَّكُمْ ۚ( (Itulah) tiga aurat bagi kamu) Yakni waktu-waktu yang terdapat aurat ketika itu, yaitu tiga waktu yang seseorang sering tidak menutup aurat. Terdapat pendapat mengatakan bahwa hukum yang terkandung dalam ayat ini telah dinasakh (dihapus), hal ini karena hukum ini berlaku ketika rumah-rumah belum memiliki pintu, dan setelah rumah-rumah itu berpintu maka sudah tidak perlu untuk meminta izin lagi. Pendapat lain mengatakan hukum ini tetap berlaku sehingga bagi setiap laki-laki dan perempuan harus memerintahkan anak-anak dan budak-budak mereka untuk meminta izin pada waktu-waktu tersebut apabila ingin masuk kamar mereka, dan anak-anak dan budak-budak itu tidak boleh masuk tanpa seizin mereka. لَيْسَ عَلَيْكُمْ وَلَا عَلَيْهِمْ جُنَاحٌۢ بَعْدَهُنَّ ۚ( Tidak ada dosa atasmu dan tidak (pula) atas mereka selain dari (tiga waktu) itu) Yakni tidak ada dosa jika mereka masuk tanpa izin diluar tiga waktu ini. طَوّٰفُونَ عَلَيْكُم(Mereka melayani kamu) Yakni mereka adalah para pembantu kalian, maka tidak mengapa mereka masuk ke ruangan kalian diluar waktu-waktu ini tanpa izin. بَعْضُكُمْ عَلَىٰ بَعْضٍ ۚ( sebahagian kamu (ada keperluan) kepada sebahagian (yang lain)) Yakni sebagian kalian melayani sebagian lainnya. كَذٰلِكَ يُبَيِّنُ اللهُ لَكُمُ الْاٰيٰتِ ۗ( Demikianlah Allah menjelaskan ayat-ayat bagi kamu) Yakni ayat-ayat yang menunjukkaan hukum-hukum yang Allah syariatkan bagi kalian. وَاللهُ عَلِيمٌ حَكِيمٌ (Dan Allah Maha Mengetahui lagi Maha Bijaksana) Memiliki ilmu yang banyak dan hikmah yang tinggi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "58. Wahai orang-orang yang beriman, sebaiknya budak, pelayan, anak-anak kecil yang umurnya belum baligh di antara pengikut kalian dan kerabat kalian yang hendak menemui kalian itu meminta ijin kalian sebanyak tiga kali di siang dan malam karena mengandung potensi terlihatnya aurat dan terlepasnya pakaian, yaitu waktu sebelum shalat subuh yang merupakan waktu bangun tidur, waktu zhuhur dan istirahat siang, dan waktu setelah shalat isya’. Itu adalah 3 waktu yang mengandung potensi terlihatnya aurat. Dan jam-jam ini disebut aurat karena saat itu manusia (sering) melepas pakaiaannya sehingga tampaklah auratnya. Tidak ada dosa bagi kalian atau mereka saat masuk setelah waktu-waktu ini atau pada waktu 3 aurat itu. Mereka seringkali canggung atau ragu untuk melayani kalian. Sebagian kalian meliputi (meminta dilayani) sebagian lainnya (saat dibutuhkan saja) sehingga tidak butuh bergaul (terus menerus). Seperti penjelasan yang telah disebutkan itulah Allah menjelaskan (menerangkan) kepada kalian ayat-ayat hukum. Dan Allah adalah Dzat yang Maha Mengetahui lagi Maha Bijaksana. Ayat ini diturunkan terkai Umar RA yang mendatangi seorang anak kaum Anshar. Dia melihat kondisi yang dibenci oleh pndangannya, lalu Umar menginginkan jika sekiranya Allah memerintahkan atau memberi larangan dalam perkara perizinan. Atau ini juga diturunkan terkait Asma’ binti Abu Martsad yang ditemui oleh anak-laki-laki yang sudah besar di waktu yang dibencinya. Lalu dia mengadukan masalah itu kepada Rasulallah SAW. Kemudian turunlah ayat ini."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, hendaklah hamba sahaya yang kalian miliki dan orang-orang yang belum balig di antara kalian} anak-anak yang merdeka yang belum mencapai usia balig {meminta izin kepada kalian tiga kali} tiga kali dalam sehari semalam {yaitu sebelum shalat Subuh, ketika kalian menanggalkan pakaian kalian di tengah hari, dan setelah shalat Isya. Tiga aurat bagi kalian} tiga waktu aurat kalian dimana penutup kalian tidak lengkap dan minim, sehingga jangan sampai mereka memasuki ruangan kalian melainkan dengan izin (kalian) {Tidak ada dosa} kesalahan {bagi kalian dan tidak pula bagi mereka} bagi tuan, pelayaan dan anak-anak {selain dari itu} setelah tiga waktu ini {Mereka sering menemui kalian} mereka seringkali menemui kalian untuk memberi pelayanan dan memberikan kebaikan {Sebagian kalian (sering bertemu) atas sebagian lain} sebagian kalian sering bertemu dengan sebagian lain {Demikianlah Allah menjelaskan} menerangkan {ayat-ayat kepada kalian. Allah Maha Mengetahui lagi Maha bijaksana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "58 Allah memerintahkan Kaum Mukminin agar para budak dan anak-anak yang belum mencapai usia baligh meminta izin dari mereka. Allah telah menyebutkan hikmahNya. Ada tiga aurat (tiga waktu saat orang bisa membuka auratnya) bagi orang-orang yang seharusnya di minta izin kepada mereka, yaitu waktu tidur pada malam hari setelah shalat isya, waktu terjaga mereka sebelum shalat shubuh. Biasanya, orang yang tidur di malam hari mengenakan pakaian yang tidak biasa dipakai. Adapun tidur siang,[tatkala] umumnya jarang dilakukan seseorang memakai pakaian yang wajar pada waktu itu, maka Allah mengaitkannya dengan FirmanNya, “ ketika kalian menganggalkan pakaian (luar)mu di tengah hari,” bagi yang tidur ditengah hari. Pada tiga kondisi ini para budak dan anak-anak kecil berkedudukan seperti orang-orang (pada umumnya) agar tidak masuk kecuali dengan izin. Adapun diluar keadaan ini, Allah berfirman, ”tidak ada dosa atasmu dan tidak (pula) atas mereka selain dari (tiga waktu) itu,” maksudnya, (kedudukan) mereka tidaklah sama dengan selain mereka. Karena, mereka selalu dibutuhkan sehingga menjadi beban bila mesti meminta izin setiap waktu. Oleh karena itu, Allah berfirman ”mereka melayani kalian, sebagian kalian (ada keperluan) kepada sebagian (yang lain),” maksudnya mondar-mandir untuk menyelesaikan kesibukkan dan kebutuhan kalian. “demikianlah Allah menjelaskan ayat-ayat bagi kalian,” yaitu sebagai penjelasan yang disertai dengan hikmahNya agar lebih meyakinkan dan menguatkan serta mengetahui rahmat dan hikmah Dzat yang telah membuat syari’at. Oleh sebab itu, Allah berfirman, ”dan Allah MahaMengetahui, lagi Mahabijaksana,” bagiNya ilmu yang meliputi perkara-perkara yang mesti ada, [hal-hal yang mustahil], kemungkinan-kemungkinan, dan hikmah yang meletakkan sesuatu pada tempatnya. Allah telah memberikan kepada para makhluk bentuk penciptaan yang sesuai. Dan memberikan kepada setiap hukum syari’I ketetapan hukum yang selaras. Termasuk hukum-hukum ini yang mana Allah sudah menerangkan dan menjelaskan sumber dan keelokannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nur ayat 58: Dan mereka telah mengenal urusan tentang wanita. Di mana pada tiga waktu ini, biasanya kamu memakai pakaian yang tidak biasanya. Yakni waktu Zhuhur. Maksudnya, tiga waktu yang biasanya badan banyak terbuka. Oleh sebab itu Allah melarang budak-budak dan anak-anak di bawah umur untuk masuk ke kamar tidur orang dewasa tanpa izin pada waktu-waktu tersebut. Maksudnya, tidak berdosa kalau mereka tidak dicegah masuk tanpa izin, dan tidak pula mereka berdosa kalau masuk tanpa meminta izin."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nur Ayat 58",
    "description": "Kembali berbicara tentang etika dalam pergaulan, Allah menegaskan, 'wahai orang-orang yang beriman! hendaklah hamba sahaya yang kamu miliki, baik laki-laki maupun perempuan yang telah atau hampir balig, dan orang-orang yaitu anak-anak yang sudah paham tentang aurat meskipun belum balig di antara kamu, hendaklah mereka semua meminta izin kepada kamu pada tiga kali atau tiga kesempatan dalam satu hari, yaitu sebelum salat subuh, ketika kamu menanggalkan pakaian luarmu di tengah hari untuk sekadar berbaring atau beristirahat, dan setelah salat isya hingga sepanjang malam karena ketika itu kamu bersiap atau sedang tidur. Itulah tiga waktu yang biasa kamu gunakan untuk mengganti pakaian sehingga kemungkinan aurat terlihat bagi kamu. Tidak ada dosa bagi kamu dan tidak pula bagi mereka bila masuk tanpa meminta izin selain dari tiga waktu itu; mereka sering keluar masuk melayani kamu, sebagian kamu ada keperluan atas sebagian yang lain, dan interaksi semacam ini tidak mudah dihindari. Demikianlah Allah menjelaskan ayat-ayat itu kepadamu. Dan Allah maha mengetahui apa yang bermanfaat bagi hamba-Nya, mahabijaksana dalam ketentuan dan bimbingan-Nya. 59. Dan apabila anak-anak kamu telah sampai umur dewasa, maka hendaklah mereka juga meminta izin untuk masuk ke kamar kamu, seperti halnya orang-orang yang lebih dewasa harus meminta izin seperti ketentuan yang telah dijelaskan sebelumnya. Demikianlah Allah menjelaskan ayat-ayat-Nya kepada kamu. Allah maha mengetahui, mahabijaksana."
  }
]