[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apabila anak-anak kecil dari kalian telah mencapai usia baligh dan masa mukallaf untuk mengemban kewajiban hokum-hukum syariat, maka mereka harus meminta izin bila akan masuk di seluruh waktu, sebagaimana orang-orang dewasa meminta izin dahulu. Dan sebagaimana Alllah telah menjelaskan adab-adab meminta izin, Allah juga menjelaskan ayat-ayatNya kepada kalian. Dan Allah Maha mengetahui hal-hal yang mendatangkan kemaslahatan hamba-hambaNya, lagi Mahabijaksana dalam penetapan syariatNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "59. Dan apabila anak-anak kalian telah sampai umur balig, maka hendaklah mereka meminta izin ketika masuk rumah dalam setiap waktu seperti adab izin orang-orang dewasa yang disebutkan sebelumnya. Sebagaimana Allah menjelaskan hukum-hukum perizinan bagi kalian, maka demikian pula Dia menjelaskan ayat-ayat-Nya. Dan Allah Maha Mengetahui maslahat hamba-hamba-Nya, lagi Maha Bijaksana dalam syariat yang ditetapkan bagi mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "59. Dan jika anak-anak merdeka telah mencapai usia baligh maka ajarilah mereka adab meminta izin, agar mereka meminta izin sebelum memasuki ruangan kalian setiap saat, sebagaimana telah diwajibkan bagi orang-orang yang telah baligh sebelumnya. Demikianlah Allah menjelaskan ayat-ayat yang mengandung syariat kepada kalian, Allah Maha Mengetahui perkataan dan perbuatan kalian, dan Maha Bijaksana dalam mengatur kemaslahatan kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "59. وَإِذَا بَلَغَ الْأَطْفٰلُ مِنكُمُ الْحُلُمَ (Dan apabila anak-anakmu telah sampai umur balig) Dalam ayat ini Allah menjelaskan hukum bagi anak-anak yang telah mencapai usia baligh. كَمَا اسْتَـْٔذَنَ الَّذِينَ مِن قَبْلِهِمْ ۚ (maka hendaklah mereka meminta izin, seperti orang-orang yang sebelum mereka meminta izin) Yakni mereka harus meminta izin setiap saat sebagaimana orang-orang dewasa sebelum mereka diperintahkan untuk meminta izin, baik itu di tiga waktu tersebut maupun di waktu-waktu lainnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "59. Dan ketika anak-anak yang merdeka telah mencapai masa pubertas melalui mimpi atau masa baligh yaitu 15 tahun, maka sebaiknya mereka meminta ijin, sebagaimana orang-orang sebelum mereka meminta ijin, yaitu orang-orang yang sudah mencapai masa purbetas sebelum mereka dan sudah menjadi dewasa. Mereka juga diperintahkan untuk meminta ijin untuk bertemu di waktu 3 aurat itu dan waktu lainnya atau di setiap kondisi. Seperti penjelasan yang telah disebutkan itulah Allah menjelaskan kepada kalian ayat-ayat hukum. Dan Allah itu Maha Mengetahui perkara-perkara dan keaaan ciptaanNya dan Maha Bijaksana terhadap sesuatu yang diatur dan ditentukan untuk mereka. Hal tersebut diulang-ulang sebagai bentuk penegasan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apabila anak-anak di antara kalian telah sampai usia dewasa} usia dewasa {hendaklah mereka meminta izin seperti halnya orang-orang yang sebelum mereka} orang-orang dewasa yang merdeka {Demikianlah Allah menjelaskan ayat-ayatNya kepada kalian. Allah Maha Mengetahui lagi Maha bijaksana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "59 “dan apabila anak-anakmu telah sampai umur baligh,” yaitu keluarnya air mani, baik dalam keadaan terjaga atau ketika mimpi “maka hendaklah mereka meminta izin, seperti orang-orang yang sebelum mereka meminta izin,” yaitu pada setaip waktu. (yang dimaksud dengan) ‘orang-orang sebelum mereka’ adalah mereka yang Allah sebutkan dalam FirmanNya, “wahai orang-orang yang beriman, janganlah kamu memasuki rumah selain rumah kamu sampai kamu meminta izin terlebih dahulu…” (an-nur:27) “demikianlah Allah menjelaskan ayat-ayatNya.” Allah menerangkan dan menjelaskan hukum-hukumNya secara rinci. “dan Allah MahaMengetahui lagi MahaBijaksana.” Pada dua ayat di atas terkandung beberapa faidah (pelajaran penting). Diantaranya: 1. Bahwa seorang tua dan orang tua wali dari anak kecil diperintahkan untuk mengajarkan ilmu dan adab-adab syari kepada budaknya dan orang-orang yang berada di bawah kekuasaannya. Karena Allah telah mengarahkan pembicaraan kepada mereka berdasarkan FirmanNYa, “hai orang-orang yang beriman, hendaklah budak-budak (lelaki dan wanita) yang kamu miliki, dan orang-orang yang belum baligh dari kalian…” Hal ini tidak mungkin (terwujud) kecuali melalui pengajaran dan pembinaan adab. Dan berdasarkan FirmanNya, “tidak ada dosa atasmu dan tidak (pula) atas mereka selain drai (tiga waktu) itu,” 2. Perintah untuk menjaga aurat dan berhati-hati dengannya dari segala sesuatu. Dan lokasi dan tempat yang diperkirakan aurat seseorang bisa terlihat, maka dilarang mandi dan cebok disana. 3. Bolehnya membuka aurat bila diperlukan, seperti saat tidur, kencing, buang air besar dan lain-lain. 4. Kaum muslimin dahulu terbiasa dengan tidur sebentar pada tengah hari, sebagimana mereka terbiasa tidur di malam hari, karena Allah berbicara kepada mereka untuk menceritakan keadaan yang ada pada mereka. 5. Seorang anak kecil yang belum baligh tidak boleh diberi kesempatan melihat aurat, dan auratnyapun tidak boleh terlihat. Karena Allah tidaklah memerintahkan mereka untuk meminta izin melainkan pasti bertentangan dengan perkara yang dilarang. 6. Seorang budak juga tidak boleh melihat aurat tuannya, begitu pula tuannya tidak boleh melihat aurat budaknya. Sebagaimana yang telah kita sebutkan di masalah anak kecil. 7. Hendaknya pemberi nasihat, guru, dan orang-orang yang serupa dengan mereka dari kalangan yang berbicara tentang ilmu syar’I, hendaknya menghubungkan hukum dengan keterangan sumber dan sisi pengambilan hukum. Tidak sekedar menyebutkan hukum tanpa membawakan dalil dan alasannya. Karena Allah ketika menerangkan hukum yang dimaksud, selalu mengemukakan alasan-alasannya dengan FirmanNya, “(itulah) tiga aurat bagi kamu,” 8. Anak kecil dan budak sahaya menjadi obyek pengarahan aturan, sebagaimana halnya wali mereka menjadi obyek pengarahan (aturan) berdasarkan Firman Allah, “tidak ada dosa atasmu dan tidak (pula) atas mereka selain dari (tiga waktu) itu.” 9. Sucinya air liur anak kecil, walaupun keluar setelah barang yang najis, seperti muntahnya, berdasarkan Firman Allah,” mereka melayani kamu,” (diqiyaskan) dengan sabda nabi ketika ditanya tentang kucing,“ ia tidaklah najis, ia termasuk binatang jantan dan betina yang sering mondar-mandir bersama kalian,” 10. Bolehnya seseorang memperkerjakan orang-orang yang berada dibawah kekuasaannya sebagai pembantu, seperti anak-anak dengan cara yang wajar dan tidak memberatkan sang anak, berdasarkan FirmanNYa,”mereka melayani kamu,” 11. Bahwasannya hukum yang disebutkan di atas dengan terperinci ditunjukkan untuk anak-anak yang belum baligh. Adapun anak-anak yang sudah baligh, maka harus meminta izin. 12. Bahwasannya masa baligh (anak) terjadi dengan keluarnya mani. Setiap hukum syari dikaitkan dengan masa baligh. Masuknya (masa baligh) disebabkan keluarnya air mani. Ini telah disepakati para ulama. Sedangkan perbedaan yang terjadi adalah apakah masa baligh itu berdasarkan umur tertentu atau dengan tumbuhnya rambut kemaluan (atau tidak)? Wallahu’alam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nur ayat 59: Dalam semua waktu. Ada yang mengartikan dengan, “orang-orang yang lebih dewasa.” Maksudnya, anak-anak dari orang-orang yang merdeka yang bukan mahram, yang telah balig haruslah meminta izin lebih dahulu kalau hendak masuk seperti orang-orang yang tersebut dalam ayat 27 dan 28 surat ini. Alqamah berkata, “Seorang laki-laki datang menemui Abdullah bin Mas’ud sambil bertanya, “Apakah saya harus meminta izin sebelum masuk ke kamar ibuku?” Abdullah bin Mas’ud menjawab, “Tidak setiap saat ibumu senang kamu melihatnya.” (HR. Bukhari) Dia menjelaskannya dan merincikan hukum-hukumnya. Dari kedua ayat di atas (ayat 58 & 59) terdapat beberapa faedah, di antaranya: - Bahwa sayyid (majikan) dan wali bagi anak kecil hendaknya mengajarkan budak dan orang yang berada di bawah kekuasaan mereka, seperti anak-anak ilmu dan adab-ada syar’i. - Perintah menjaga aurat dan memeliharanya dari berbagai sisi, dan bahwa tempat yang biasanya aurat seseorang dapat terlihat dilarang untuk mandi di situ. - Boleh membuka aurat karena keperluan, seperti karena hendak tidur, buang air kecil dan buang air besar. - Kaum muslimin sejak dahulu mempunyai kebiasaan istirahat di siang hari sebagaimana mereka memiliki kebiasaan tidur di malam hari. Kebiasaan ini merupakan kebiasaan yang baik dank arena badan butuh beristirahat. - Anak kecil yang belum baligh tidak diperbolehkan diberikan kesempatan melihat aurat. - Budak tidak diperbolehkan melihat aurat majikannya. - Sepantasnya bagi penasehat, pengajar dsb. yang biasa membicarakan tentang ilmu syar’i memberikan dalil dan alasan. - Bolehnya memanfaatkan orang yang berada di bawah kekuasaannya, seperti anak kecil namun tidak sampai memberatkannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nur Ayat 59",
    "description": "Dan apabila anak-anak kamu telah sampai umur dewasa, maka hendaklah mereka juga meminta izin untuk masuk ke kamar kamu, seperti halnya orang-orang yang lebih dewasa harus meminta izin seperti ketentuan yang telah dijelaskan sebelumnya. Demikianlah Allah menjelaskan ayat-ayat-Nya kepada kamu. Allah maha mengetahui, mahabijaksana. 60. Bila sebelumnya Allah melarang para perempuan secara umum untuk menampakkan hiasan mereka, maka pada ayat ini Allah memberi pengecualian kepada perempuan tua. Dan para perempuan tua yang telah berhenti dari haid dan hamil, yang tidak ingin menikah lagi, maka tidak ada dosa bagi mereka untuk menanggalkan pakaian luar yang biasa mereka pakai di atas pakaian lain yang menutup aurat mereka, asalkan hal itu dilakukan dengan tidak ditujukan untuk menampakkan perhiasan yang tersembunyi pada anggota tubuh yang wajib ditutup; tetapi memelihara kehormatan dengan memakai pakaian lengkap adalah lebih baik bagi mereka daripada menanggalkannya. Allah maha mendengar, maha mengetahui."
  }
]