[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "6-7. Dan suami-suami yang melontarkan tuduhan zina kepada istri-istri mereka, akan tetapi mereka tidak memiliki saksi-saksi yang mendukung tuduhan mereka, kecuali mereka sendiri, maka suami harus bersaksi di hadapan hakim sebanyak empat kali dengan mengatakan, ”Saya bersaksi dengan Nama Allah bahwa sesungguhnya saya benar dalam tuduhan zina yang saya alamatkan kepadanya.” Dan pada persaksian kelima, dia menambahkan doa buruk pada dirinya untuk mendapatkan laknat Allah, jika dia dusta dalam ucapannya itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Dan laki-laki yang menuduh isteri-istri mereka berzina, padahal mereka tidak mempunyai saksi-saksi yang bersaksi tentang kebenaran tuduhan tersebut selain diri mereka sendiri, maka hendaklah laki-laki tersebut bersumpah dengan nama Allah sebanyak empat kali Allah bahwa \"dia benar-benar jujur dalam tuduhannya terhadap perzinaan istrinya.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "6-7. Dan para suami yang menuduh para istri mereka dengan tuduhan zina, sedangkan mereka tidak memiliki saksi atas tuduhan itu melainkan diri mereka sendiri, maka mereka harus bersaksi agar tidak mendapat hukuman karena telah menuduh dengan bersumpah dengan nama Allah di hadapan hakim sebanyak empat kali sumpah bahwa tuduhan mereka terhadap istri mereka adalah benar; kemudian mereka harus mengucapkan sumpah yang kelima bahwa laknat Allah akan menimpa mereka jika mereka berbohong."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. وَالَّذِينَ يَرْمُونَ أَزْوٰجَهُمْ وَلَمْ يَكُن لَّهُمْ شُهَدَآءُ إِلَّآ أَنفُسُهُمْ (Dan orang-orang yang menuduh isterinya (berzina), padahal mereka tidak ada mempunyai saksi-saksi selain diri mereka sendiri) Yakni tidak memiliki saksi-saksi yang memberi kesaksian atas zina yang dilakukan oleh istrinya. فَشَهٰدَةُ أَحَدِهِمْ أَرْبَعُ شَهٰدٰتٍۭ بِاللهِ ۙ( maka persaksian orang itu ialah empat kali bersumpah dengan nama Allah) Yakni orang itu wajib bersaksi dengan nama Allah sebanyak empat kali bahwa ia adalah orang yang benar agar terbebas dari hukum had. إِنَّهُۥ لَمِنَ الصّٰدِقِينَ(sesungguhnya dia adalah termasuk orang-orang yang benar) Yakni benar dalam tuduhan zina yang ia tuduhkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Orang-orang yang menuduh isterinya berzina, padahal mereka tidak mempunyai saksi-saksi selain diri mereka sendiri, maka cara persaksian bagi orang seperti itu ialah empat kali bersumpah dengan nama Allah, bahwa sesungguhnya dia adalah termasuk orang-orang yang benar. Ayat ini turun ketika Hilal bin Umayah menuduh istrinya berzina dengan ibn Sahma’. Dalam riwayat disebutkan ayat ini turun ketika Uwaimir Al ‘ajlan menuduh istrinya berzina dengan seorang laki-laki yang kakeknya ada bersama istrinya. Ini yang sahih."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang menuduh istrinya} menuduh istri mereka berzina {padahal mereka tidak mempunyai saksi-saksi selain diri sendiri} saksi selain dirinya {maka kesaksian masing-masing mereka itu} ketentuan kesaksian masing-masing mereka itu {empat kali sumpah atas (nama) Allah, bahwa sesungguhnya dia termasuk orang yang benar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6-7. persaksian-persaksian suami atas (tuduhan perzinaan) istri-istri berfungsi menahan (penegakan) hukum hudud atas dirinya karena jamaknya, seorang suami tidak boleh lancang untuk menuduh istri (berzina) yang mana perkara menodai cinta istrinya akan menodai suami itu sendiri kecuali jika dia seorang yang jujur, dank arena dia juga mempunyai hak dalam masalah ini, sereta kekhawatiran terjadinya penisbatan anak-anak yang bukan berasal darinya, dan kekhawatiran lainnya dari hukum-hukum yang hilang pada selainnya. Allah berfirman, “dan orang-orang yang menuduh istrinya (berzina),” yaitu orang-orang yang merdeka, bukan para budak. “padahal mereka tidak mempunyai,” atas tuduhan mereka tentang perzinaan itu “saksi-saksi selain diri mereka sendiri,” mereka tidak dapat menghadirkan para saksi atas apa yang mereka tuduhkan, “ maka persaksian orang itu ialah empat kali bersumpah dengan nama Allah, sesungguhnya dia adalah termasuk orang-orang yang benar,” Allah menyebutnya dengan persaksian karena dia menggantikan posisi para saksi. Dengan cara mengatakan, ”saya bersaksi dengan nama Allah, bahwa saya adalah termasuk orang-orang yang jujur dalam perkara yang saya tuduhkan kepadanya.” “dan sumpah yang kelima; bahwa laknat Allah atasnya, jika dia termasuk orang-orang yang berdusta,” maksudnya dia menambahkan pada kali yang kelima, bersama persaksian yang telah disebutkan guna menguatkan persaksian-persaksian sebelumnya, dengan mendoakan (buruk) atas dirinya dengan laknat bila dia berdusta. Bila proses pelaknatannya (li’an) telah berlangsung, maka hukuman qadzaf (menuduh orang lain berzina) menjadi gugur darinya. Zahir ayat-ayat ini, walaupun sang suami menyebutkan nama lelaki yang mana dia menuduh istrinya (melakukan perzinaan) dengan lelaki itu, maka haknya pun menjadi gugur karena mengikuti keadaan si wanita. Apakah akan dijatuhkan hukuman terhadap wanita tersebut hanya dengan dasar tuduhan dan peringatan kepada siwanita atau ia harus dipenjarakan? Mengenai hal ini para ulama mempunyai dua pendapat; pendapat yang ditunjukan oleh dalil adalah bahwa hukuman pidana harus ditegakan terhadap wanita tersebut, denagn dalil,”istrinya itu dihindarkan dari hukuman oleh sumpahnya…,” sampai selesai. Kalu bukan karena azab itu –had- telah wajib dilaksanakan disebabkan laknatnya, niscaya laknatnya (sang istri) tidak menjadi penolak laknat suami."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nur ayat 6: Imam Bukhari meriwayatkan dengan sanadnya yang sampai kepada Sahl bin Sa’ad, bahwa ‘Uwaimir datang kepada ‘Ashim bin ‘Addiy tokoh Bani ‘Ajlan, ia berkata, “Bagaimana menurutmu tentang seorang laki-laki yang mendapati istrinya bersama laki-laki lain, apakah ia perlu membunuhnya sehingga kamu membunuhnya atau bagaimana yang ia lakukan? Tanyakanlah tentang hal itu kepada Rasulullah shallallahu 'alaihi wa sallam untukku.” Maka ‘Ashim mendatangi Nabi shallallahu 'alaihi wa sallam dan berkata, “Wahai Rasulullah,” Rasulullah shallallahu 'alaihi wa sallam (tampak) tidak suka terhadap pertanyaan itu, maka ‘Uwaimir menanyakan (hal tersebut) kepadanya (‘Ashim), ‘Ashim menjawab, “Sesungguhnya Rasulullah shallallahu 'alaihi wa sallam tidak suka pertanyaan itu dan mencelanya.” ‘Uwaimir berkata, “Demi Allah, saya tidak akan berhenti sampai saya bertanya kepada Rasulullah shallallahu 'alaihi wa sallam tentang hal itu.” ‘Uwaimir pun datang dan berkata, “Wahai Rasulullah, ada seseorang yang mendapati istrinya bersama laki-laki lain, apakah ia harus membunuh sehingga kamu membunuhnya atau apa yang ia lakukan?” Rasulullah shallallahu 'alaihi wa sallam bersabda, “Allah telah menurunkan Al Qur’an tentang dirimu dan istrimu.” Maka Rasulullah shallallahu 'alaihi wa sallam memerintahkan mereka berdua melakukan li’an sesuai yang Allah sebutkan dalam kitab-Nya, lalu ‘Uwaimir melakukannya. Kemudian ‘Uwaimir berkata, “Wahai Rasulullah, jika aku menahannya, maka aku sama saja telah menzaliminya,” ia pun menalaknya, dan hal itu pun menjadi sunnah bagi orang-orang setelahnya yang melakukan li’an. Kemudian Rasulullah shallallahu 'alaihi wa sallam bersabda, “Lihatlah! Jika anak itu lahir dalam keadaan berkulit hitam dan matanya lebar dan hitam, besar bokongnya, dan berisi (gemuk) betisnya, maka aku mengira bahwa ‘Uwaimir berkata benar tentangnya. Tetapi jika anaknya agar kemerah-merahan seperti (warna) waharah (binatang sejenis tokek), maka menurutku ‘Uwaimir dusta. Ternyata anak itu lahir sesuai yang disifatkan Rasulullah shallallahu 'alaihi wa sallam yang menunjukkan kebenaran ‘Uwamir, oleh karenanya anak itu dinasabkan kepada ibunya.” Imam Bukhari juga meriwayatkan dengan sanadnya yang sampai kepada Ibnu Abbas radhiyallahu 'anhuma, bahwa Hilal bin Umayyah pernah menuduh istrinya berbuat serong dengan Syarik bin Sahmaa’ di hadapan Nabi shallallahu 'alaihi wa sallam, lalu Nabi shallallahu 'alaihi wa sallam bersabda, “Mana buktinya, atau jika tidak ada maka punggungmu diberi had?” Hilal berkata, “Wahai Rasulullah, apakah apabila seseorang di antara kami melihat ada orang lain yang berjalan dengan istrinya butuh mendatangkan bukti?” Nabi shallallahu 'alaihi wa sallam tetap berkata, “Mana buktinya, atau jika tidak ada maka punggungmu diberi had?” Hilal berkata, “Demi Allah yang mengutusmu dengan kebenaran, sesungguhnya aku benar-benar jujur. Alah tentu akan menurunkan ayat yang menghindarkan had dari punggungku.” Jibril kemudian turun dan menurunkan kepada Beliau ayat, “Walladziiyna yarmuuna azwaajahum…dst. sampai in kaana minash shaadiqin.” Maka Nabi shallallahu 'alaihi wa sallam pergi dan mengirimkan orang kepadanya (Hilal dan istrinya), maka Hilal datang, lalu bersaksi, sedangkan Nabi shallallahu 'alaihi wa sallam bersabda, “Sesungguhnya Allah mengetahui bahwa salah seorang di antara kamu berdua ada yang berdusta, adakah yang mau bertobat?” Lalu istrinya bangkit dan bersaksi. Ketiika ia bersaksi pada yang kelimanya, maka orang-orang menghentikannya dan berkata kepadanya, bahwa ucapan itu akan menimpanya. Ibnu Abbas berkata, “Istrinya agak lambat dan hampir mundur sehingga kami mengira bahwa ia akan mundur, lalu ia berkata, “Aku tidak akan mempermalukan kaumku sepanjang hari.” Maka ia melanjutkan (persaksian yang kelima). Nabi shallallahu 'alaihi wa sallam bersabda, “Lihatlah wanita itu, jika anaknya lahir dalam keadaan matanya seperti bercelak, besar bokongnya dan berisi (gemuk) kedua betisnya, maka ia anak Syarik bin Sahma’, ternyata anak itu lahir seperti itu. Lalu Nabi shallallahu 'alaihi wa sallam bersabda, “Kalau bukan karena apa yang berlaku di kitab Allah, tentu antara aku dengan wanita itu ada urusan.” Disebutkan dalam ‘Aunul Ma’bud menukil dari Fathul Bari, “Para imam berselisih tentang hal ini. Di antara mereka ada yang menguatkan, bahwa ayat tersebut turun berkenaan dengan ‘Uwaimir, di antara mereka ada yang menguatkan, bahwa ayat tersebut turun berkenaan dengan Hilal, dan di antara mereka ada yang menggabung antara kedua hadits itu, bahwa kejadian pertama menimpa pada Hilal dan ternyata bersamaan dengan kedatangan ‘Uwaimir, sehingga ayat tersebut turun berkenaan dengan keduanya dalam waktu yang sama. Imam Nawawi lebih cenderung kepadanya, dan sebelumnya Al Khathib telah mendahului, ia berkata, “Mungkin keduanya sama-sama datang secara bersamaan dalam waktu yang sama. Tidak ada penghalang dengan adanya beberapa kisah namun turunnya hanya satu. Bisa juga, bahwa ayat tersebut telah lebih dulu turun karena sebab Hilal. Ketika ‘Uwaimir datang, sedangkan dia belum mengetahui peristiwa yang menimpa Hilal, maka Nabi shallallahu 'alaihi wa sallam memberitahukan hukumnya. Oleh karena itu, dalam kisah Hilal disebutkan, “Jibril pun turun.”, sedangkan dalam kisah ‘Uwaimir disebutkan, “Sungguh, Allah telah menurunkan berkenaan denganmu”, Maksud, “Sungguh, Allah telah menurunkan berkenaan denganmu” yakni berkenaan orang-orang yang sepertimu. Inilah yang dijawab oleh Ibnu Shabbagh dalam Asy Syaamil, dan Al Qurthubi lebih cenderung bahwa mungkinnya ayat tersebut turun dua kali. Al Haafizh berkata, “Kemungkinan-kemungkinan ini meskipun dipandang jauh lebih layak didahulukan daripada menyalahkan rawi-rawi yang hafizh.” (Demikianlah perkataan Al Haafizh secara singkat). Yang merdeka, bukan budak. Persaksian suami terhadap istrinya dapat menolak had qadzaf, karena biasanya suami tidaklah berani menuduh istrinya yang sesungguhnya juga mengotori dirinya, kecuali apabila ia benar, dan lagi ia memiliki hak di sana serta karena takut dinisbatkan anak kepadanya padahal bukan anaknya, dsb. Allah sebut syahadah (kesaksian) karena ia menduduki posisi para saksi. Yaitu dengan mengatakan, “Aku bersaksi dengan nama Allah, sesungguhnya aku sungguh benar dalam tuduhanku kepadanya.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nur Ayat 6",
    "description": "6-7. Setelah menjelaskan ketentuan hukum terhadap penuduh zina secara umum, Allah lalu menguraikan hukum apabila seorang suami menuduh istrinya berzina. Dan orang-orang yang menuduh istrinya berzina, padahal mereka tidak mempunyai saksi-saksi yang menguatkan tu-duhan itu selain diri mereka sendiri, maka kesaksian masing-masing orang itu, yaitu suami, ialah empat kali bersumpah dengan nama Allah, bahwa sesungguhnya dia termasuk orang yang berkata benar. Dan sumpah yang kelima adalah bahwa laknat Allah akan menimpanya jika dia termasuk orang yang berdusta dalam tuduhan yang dialamatkan kepada istrinya"
  }
]