[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan wanita-wanita tua yang sudah tidak memiliki keinginan untuk berhubungan badan dan pupus nafsu syahwatnya karenan usia senja mereka, sehingga mereka tidak berhasrat menikah dengan laki-laki dan kaum lelaki tidak berhasrat menikahi mereka, maka tidak masalah bagi mereka untuk menanggalkan sebagian pakaian mereka, seperti kain luar yang menutup pakaian mereka, tanpa memperlihatkan dan menampakkan perhiasan. Dan pakaian mereka dengan mengenakan kain-kain ini, untuk menutupi diri dan menjaga kehormatan, itu lebih baik bagi mereka. Dan Allah Maha mendengar ucapan- ucapan kalian, lagi Maha Mengetahui niat-niat dan perbuatan-perbuatan kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "60. Dan wanita-wanita tua yang telah mengalami menopause dan tidak hamil lagi karena sudah tua, yang tidak ingin menikah lagi, mereka tiadaklah berdosa jika menanggalkan sebagian pakaian mereka seperti selendang dan cadar dengan tidak bermaksud menampakkan perhiasan tersembunyi yang diperintahkan untuk disembunyikan. Dan apabila mereka tidak menanggalkan sebagian pakaian tersebut maka itu lebih baik bagi mereka sebagai bentuk kesungguhan dan kehati-hatian yang lebih dalam menutup diri dan menjaga kesucian. Dan Allah Maha Mendengar apa yang kalian ucapkan, lagi Maha Mengetahui apa yang kalian kerjakan, tiada sesuatupun yang tersembunyi bagi-Nya, dan Dia pasti akan memberi kalian ganjaran atasnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "60. Dan wanita-wanita yang telah tua dan tidak mengharapkan pernikahan lagi karena telah lanjut usia, maka tidak berdosa bagi mereka jika melepas pakaian atas mereka seperti kerudung dan selendang mereka dengan syarat mereka tidak menampakkan perhiasan yang tersembunyi mereka seperti gelang kaki dan sebagainya. Namun menutup diri dengan memakai kerudung dan selendang sebagaimana yang dipakai para wanita muda lebih baik dan lebih terhormat bagi mereka. Allah Maha Mendengar perkataan kalian dan Maha Melihat perbuatan kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "60. وَالْقَوٰعِدُ مِنَ النِّسَآءِ (Dan perempuan-perempuan tua yang telah terhenti (dari haid dan mengandung)) Yakni wanita-wanita yang sudah tidak dapat haidh dan hamil karena usia mereka yang telah lanjut. الّٰتِى لَا يَرْجُونَ نِكَاحًا(yang tiada ingin kawin (lagi)) Yakni mereka tidak lagi menginginkannya kerena usia mereka yang telah tua. فَلَيْسَ عَلَيْهِنَّ جُنَاحٌ أَن يَضَعْنَ ثِيَابَهُنَّ(tiadalah atas mereka dosa menanggalkan pakaian mereka) Sebab para lelaki sudah tidak lagi memiliki keinginan untuk menikahi mereka. Yakni mereka boleh menanggalkan pakaian yang ada menutupi tubuh mereka yang nampak seperti jilbab dan lainnya, dan bukan pakaian yang menutupi aurat utama mereka. غَيْرَ مُتَبَرِّجٰتٍۭ بِزِينَةٍ ۖ( dengan tidak (bermaksud) menampakkan perhiasan) Yakni tanpa menampakkan perhiasan mereka yang diperintahkan untuk ditutupi yang disebutkan dalam firman-Nya (ولا يبدين زينتهن). Maksud ayat ini adalah mereka melepas jilbab mereka tidak untuk menampakkan perhiasan mereka dan tidak bertujuan untuk memamerkannya pada para lelaki. وَأَن يَسْتَعْفِفْنَ خَيْرٌ لَّهُنَّ ۗ( dan berlaku sopan adalah lebih baik bagi mereka) Yakni tidak melepaskan pakaian mereka lebih baik bagi mereka. وَاللهُ سَمِيعٌ عَلِيمٌ(Dan Allah Maha Mendengar lagi Maha Mengetahui) Maha Mendengar dan Maha Mengetahui."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "60. Dan wanita-wanita tua yang telah terhenti dari haid, hamil dan melahirkan, dan tidak berkeinginan untuk menikah karena umur senja mereka, maka tidak ada bagi mereka itu dosa, sehingga mereka dibebaskan untuk menanggalkan pakaian yang nampak, seperti jilbab, kain, dan penutup di atas khimar. Tidak ada aurat (bagi mereka) jika tidak bermaksut menampakkan perhiasan yang tersembunyi seperti gelang tangan, kalung dan gelang kaki. Dan memilih menahan diri dan mengenakan pakaian lengkap itu lebih baik bagi mereka daripada menanggalkannya, Dan Allah itu Maha Mendengar ucapan-ucapan kalian dan Maha Mengetahui maksud kalian. Dan At-Tabarruj adalah agak membuka bagian yang seharusnya ditutup."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Para perempuan tua yang telah berhenti} perempuan-perempuan yang lemah yang telah berhenti haid dan hamil, karena sudah tua {yang tidak lagi berhasrat menikah} tidak berkeinginan untuk menikah {maka tidak ada dosa bagi mereka menanggalkan pakaian (luar)} menanggalkan sebagian pakaian mereka seperti selendang dan kerudung {dengan tidak menampakkan perhiasan} tanpa menampakkan perhiasan mereka yang tersembunyi {dan memelihara kehormatan} dan menjaga kesucian dengan tetap mengenakan penutup dan tidak menanggalkan pakaian-pakaian itu {lebih baik bagi mereka. Allah Maha Mendengar lagi Maha Mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "60 “dan perempuan-perempuan tua yang telah terhenti (dari haid dan mengandung),” maksudnya para wanita yang telah berhenti dari persetubuhan dan syahwat. “yang tiada ingin (kawin) lagi,” maksudnya tidak ingin menikah dan tidak menarik untuk dinikahi. Karena keadaannya yang sudah tua sehingga tidak memiliki hasrat atau lantaran fisiknya jelek sehingga tidak menarik lagi untuk dinikahi dan iapun tidak punya hasrat. “tiadalah atas mereka dosa,” maksudnya salah dan dosa “menanggalkan pakaian mereka,” yaitu baju yang Nampak seperti khimar (penutup wajah) dan semisalnya, yang telah Allah perintahkan kepada para wanita, “supaya mereka menurunkan khimar mereka di atas dada mereka,” (an-nur:24) Mereka diperbolehkan untuk membuka wajahnya karena aman dari kekhawatiran, baik yang muncul darinya atau mengarah kepadanya. Tatkala diperbolehkannya menanggalkan pakaian, barangkali terpahami darinya atas bolehnya memakai segala sesuatu, maka Allah mencegah kekhawatiran ini dengan berfirman, ”dengan tidak (bermaksud) menampakkan perhiasan,” maksudnya tidak menampakkan perhiasannya kepada orang lain berupa tindakan menghiasi diri dengan baju yang tampak (mencolok), menutup wajahnya, dan (tidak) menghentakkan kaki ke tanah supaya diketahui perhiasan yang tersembunyi. Karena dengan perhiasan itu semata yang ada pada diri wanita, (walalupun ia sudah menutup dirinya, dan walalupun merupakan wanita yang sudah tidak diminati) dapat menimbulkan fitnah, dan menjerumuskan orang yang melihatnya ke dalam dosa. “dan berlaku sopan adalah lebih baik bagi mereka,” kata isti’faf maknanya menciptakan ‘iffah (kehormatan) dengan melakukan sebab kausalitas yang dapat merealisasikannya seperti menikah dan meninggalkan hal-hal yang ditakutkan menimbulkan fitnah. “dan Allah MahaMendengar,” semua suara “lagi MahaMengetahui,” niat-niat dan tujuan-tujuan. Hendaknya mereka mewaspadai setiap perkataan dan tujuan yang jelek, dan hendaknya mereka mengetahui bahwa Allah membalas perbuatan tersebut."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nur ayat 60: Demikian pula sudah tidak suka bersenang-senang dan tidak ada rasa syahwatnya, karena keadaannya sudah tua atau jelek fisiknya. Maksudnya, pakaian luar yang kalau dibuka tidak menampakkan aurat mereka, seperti baju kurung (gamis), demikian pula cadarnya. Seperti berpakaian yang menarik, menggerakkan anggota badannya agar diketahui perhiasannya yang tersembunyi seperti kalung, gelang tangan dan gelang kaki. Dengan tidak melepas pakaian luar atau meninggalkan sesuatu yang dikhawatirkan timbul fitnah. Semua suara. Niat dan maksud seseorang. Oleh karena itu, hendaknya orang yang berniat dan bermaksud buruk serta yang berkata jelek takut terhadap sikap itu, karena Allah mengetahuinya dan akan memberikan balasan terhadapnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nur Ayat 60",
    "description": "Bila sebelumnya Allah melarang para perempuan secara umum untuk menampakkan hiasan mereka, maka pada ayat ini Allah memberi pengecualian kepada perempuan tua. Dan para perempuan tua yang telah berhenti dari haid dan hamil, yang tidak ingin menikah lagi, maka tidak ada dosa bagi mereka untuk menanggalkan pakaian luar yang biasa mereka pakai di atas pakaian lain yang menutup aurat mereka, asalkan hal itu dilakukan dengan tidak ditujukan untuk menampakkan perhiasan yang tersembunyi pada anggota tubuh yang wajib ditutup; tetapi memelihara kehormatan dengan memakai pakaian lengkap adalah lebih baik bagi mereka daripada menanggalkannya. Allah maha mendengar, maha mengetahui. 61. Usai memberi kemudahan kepada perempuan tua dalam hal berpakaian, pada ayat ini Allah menjalankan prinsip kemudahan kepada orang yang memiliki halangan tertentu. Tidak ada halangan, yakni tidak ada dosa dan tidak pula menjadi kemaksiatan bagi orang buta, tidak pula bagi orang pincang, tidak pula bagi orang sakit, dan tidak pula bagi dirimu untuk makan bersama mereka di rumah kamu atau di rumah bapak-bapak kamu, di rumah ibu-ibu kamu, di rumah saudara-saudara kamu yang laki-laki, di rumah saudara-saudara kamu yang perempuan, di rumah saudara-saudara bapak kamu yang laki-laki, di rumah saudara-saudara bapak kamu yang perempuan, di rumah saudara-saudara ibu kamu yang laki-laki, di rumah saudara-saudara ibu kamu yang perempuan, demikian juga di rumah yang kamu miliki atau dititipi kuncinya, atau di rumah kawan-kawan kamu, karena seorang kawan tentu tidak berkeberatan menjamu kawannya. Tidak ada halangan bagi kamu makan bersama-sama mereka atau sendiri-sendiri. Apabila kamu memasuki rumah-rumah hendak-lah kamu memberi salam kepada penghuninya, yang itu berarti kamu memberi salam kepada dirimu sendiri, dengan salam yang penuh berkah dan baik dari sisi Allah, bukan seperti salam pada masa jahiliah. Demikianlah Allah menjelaskan ayat-ayat-Nya bagimu agar kamu mengerti, menghayati, dan mengamalkannya dengan baik."
  }
]