[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidak mengapa atas orang-orang yang memiliki udzur, seperti orang-orang buta, orang-orang cacat dan orang-orang sakit untuk meninggalkan perkara-perkara wajib yang mereka tidak mampu melaksanakannya seperti jihad dan lainnya, yang amat bergantung pada kenormalan penglihatan orang yang buta, atau kenormalan fisik orang yang pincang dan kesehatan jasmani orang yang sakit. Dan tidak masalah atas kalian, (wahai kaum Mukminin) untuk makan di rumah-rumah anak-anak kalian, atau dirumah bapak-bapak kalian, saudara-saudara perempuan kalian, paman-paman kalian (dari pihak ayah), paman-paman kalian (dari pihak ibu), atau di rumah-rumah yang kalian diserahi untuk menjaganya saat para pemiliknya tidak ada ditempat dengan izin mereka atau dirumah-rumah teman. Tidak masalah bagi kalian untuk makan secara bersama-sama maupun sendiri-sendiri. Dan apabila kalian memasuki rumah-rumah yang berpenghuni atau tidak ada penghuninya, hendaknya kalian mengucapkan salam kepada sebagian yang lain dengan salam Islam, yaitu, “assalamu ’alaikum warahmatullah wa barakatuh”, atau “ assalamu‘alaina wa ‘ala ‘ibadillaahish shalihin”, bila tidak dijumpai orang di dalam. Ucapan salam ini telah disyariatkan oleh Allah, yang merupakan ucapan salam yang diberkahi, yang akan menumbuhkan kasih-sayang dan cinta, baik lagi dicintai oleh orang yang mendengar. Dan dengan penjelasan seperti ini, Allah menjelaskan kepada kalian rambu-rambu agamaNya dan ayat-ayatNya, agar kalian memahaminya dan mengamalkannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "61. Tidak ada dosa bagi orang buta yang kehilangan penglihatannya, tidak pula ada dosa bagi orang pincang, dan tidak pula bagi orang sakit; bila meninggalkan kewajiban yang mereka tidak sanggup laksanakan seperti jihad di jalan Allah. Dan tidak ada dosa bagi diri kalian -wahai orang-orang beriman- makan di rumah kalian sendiri, termasuk juga rumah anak laki-laki kalian, atau makan di rumah bapak-bapak kalian, di rumah ibu-ibu kalian, di rumah saudara laki-laki kalian, di rumah saudari kalian, di rumah saudara laki-laki bapak kalian, di rumah saudari bapak kalian, di rumah saudara laki-laki ibu kalian, di rumah saudari ibu kalian, di rumah yang kalian miliki kuncinya seperti penjaga kebun. Tidak ada dosa untuk kalian makan di rumah kawan-kawan kalian karena biasanya hal itu terjadi lantaran kerelaannya untuk itu, tidak ada pula dosa bagi kalian makan bersama-sama atau sendirian. Maka apabila kalian memasuki suatu rumah seperti rumah-rumah yang di sebutkan di atas, atau rumah selainnya; hendaklah kalian memberi salam kepada penghuninya dengan mengucapkan, Assalāmu 'alaikum\", dan apabila di dalamnya tidak terdapat seorang pun penghuninya, maka ucapkanlah salam kepada dirimu sendiri dengan mengucapkan, \"Assalāmu'alainā wa 'alā 'ibādillāhiṣ ṣālihīn\" sebagai ucapan salam dari sisi Allah yang disyariatkan-Nya untuk kalian, yang diberi berkah; karena ia menebarkan sikap saling mencintai, dan persatuan di antara kalian, juga baik karena bisa menenangkan hati pendengarnya. Dengan penjelasan-penjelasan seperti ini yang juga disebutkan sebelumnya dalam surah ini, Allah menjelaskan ayat-ayat-Nya agar kalian memahaminya, dan mengamalkan kandungannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "61. Tidak berdosa bagi orang-orang yang memiliki uzur -seperti orang buta, orang pincang, dan orang sakit- untuk makan bersama orang-orang yang sehat. Hal ini karena dahulu mereka merasa segan melakukannya agar orang-orang yang sehat tidak merasa terganggu. Tidak berdosa pula orang-orang beriman untuk makan di rumah mereka yang di dalamnya terdapat istri dan anak-anak mereka. Hai orang-orang beriman, tidak berdosa pula bagi kalian untuk makan di rumah anak-anak kalian, rumah ayah kalian, rumah ibu kalian, rumah saudara kalian, rumah saudari kalian, rumah paman dan bibi kalian baik dari jalur ayah maupun jalur ibu, atau rumah orang yang telah kalian dapatkan izin dari mereka seperti bagi orang yang telah mendapat amanah atau bagi pembantu, atau di rumah teman-teman kalian yang telah kalian ketahui bahwa mereka akan mengizinkan. Dan tidak berdosa bagi kalian jika kalian makan secara berkumpul maupun berpencar. Dan jika kalian memasuki rumah-rumah tersebut maka hendaklah kalian mengucapkan salam terlebih dahulu kepada penghuninya -jika rumah itu dihuni- dengan ucapan salam dalam Islam: “Assalamualaikum warahmatullah wabarakatuh”, dan jika rumah itu tidak dihuni maka ucapkanlah salam: “Assalamualaina wa’ala ibadillahi as-sholihin”. Ucapan salam yang Allah perintahkan ini mengandung banyak kebaikan, dan mampu menentramkan jiwa orang yang mendengarnya. Demikianlah Allah menjelaskan ayat-ayat yang mengandung berbagai hukum kepada kalian, agar kalian dapat memahami dan mengamalkannya, sehingga kalian mendapat penerangan dari petunjuknya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "61. لَّيْسَ عَلَى الْأَعْمَىٰ حَرَجٌ وَلَا عَلَى الْأَعْرَجِ حَرَجٌ وَلَا عَلَى الْمَرِيضِ حَرَجٌ (Tidak ada halangan bagi orang buta, tidak (pula) bagi orang pincang, tidak (pula) bagi orang sakit) Terdapat pendapat mengatakan: dahulu kaum muslimin apabila pergi berperang mereka meninggalkan orang-orang yang sakit menahun dan menyerahkan kunci rumah-rumah mereka kepada orang-orang sakit tersebut. Mereka berpesan kepada orang-orang sakit itu: “kami telah merelakan bagi kalian untuk memakan apa yang ada dalam rumah-rumah kami,” namun mereka merasa segan untuk melakukan itu, mereka berkata “kami tidak akan memasuki rumah-rumah itu sedangkan pemiliknya tidak ada.” Maka turunlah ayat ini sebagai izin bagi mereka. Pendapat lain mengatakan yang dimaksud adalah mereka dibolehkan untuk tidak ikut pergi berperang. وَلَا عَلَىٰٓ أَنفُسِكُمْ(dan tidak (pula) bagi dirimu sendiri) Yakni bagi diri kalian dan bagi orang-orang beriman yang seperti kalian. أَن تَأْكُلُوا۟( untuk makan) Yakni kalian dan orang-orang yang bersama kalian. مِنۢ بُيُوتِكُمْ(dirumah kamu sendiri) Yakni rumah-rumah yang terdapat harta dan keluarga mereka didalamnya, sehingga termasuk rumah-rumah anak mereka, begitu pula menurut para ahli tafsir bahwa rumah cucu perempuan seseorang termasuk rumah orang tersebut, dengan dalil hadits yang menyatakan “kamu dan hartamu adalah milik ayahmu.” أَوْ بُيُوتِ ءَابَآئِكُمْ(atau dirumah bapak-bapakmu) Allah menyebutkan kerabat-kerabat yang paling dekat karena mereka lebih besar kemungkinannya untuk memberi izin. أَوْ مَا مَلَكْتُم مَّفَاتِحَهُۥٓ (dirumah yang kamu miliki kuncinya) Yakni rumah-rumah yang kalian kuasai dengan izin pemiliknya; seperti para wakil, budak, dan penjaga gudang, mereka adalah orang-orang yang memiliki kuasa untuk berbuat sesuatu dalam ruangan yang diizinkan untuk mereka masuki dan diserahi kuncinya; termasuk juga penjaga kebun, mereka dibolehkan untuk memakan buahnya. Terdapat pendapat mengatakan orang-orang tersebut dibolehkan untuk memakan makanan yang sudah direlakan untuk dimakan, adapun makanan yang belum diberikan untuk mereka maka itu masih dilarang untuk mereka makan. أَوْ صَدِيقِكُمْ ۚ( atau dirumah kawan-kawanmu) Karena seorang teman biasanya mengizinkan temannya untuk memakan makanannya dan merelakan hal itu. لَيْسَ عَلَيْكُمْ جُنَاحٌ أَن تَأْكُلُوا۟( Tidak ada halangan bagi kamu untuk memakan) Yakni makanan yang ada di rumah-rumah tersebut. جَمِيعًا أَوْ أَشْتَاتًا ۚ( makan bersama-sama mereka atau sendirian) Dan sebagian orang Arab dahulu merasa segan jika harus makan sendirian sampai ia mendapatkan teman untuk makan bersamanya. فَإِذَا دَخَلْتُم بُيُوتًا(Maka apabila kamu memasuki (suatu rumah dari) rumah-rumah (ini)) Yakni rumah-rumah tersebut atau rumah-rumah lainnya. فَسَلِّمُوا۟ عَلَىٰٓ أَنفُسِكُمْ (hendaklah kamu memberi salam kepada dirimu sendiri) Yakni kepada pemilik dan penghuninya yang berasal dari golongan kalian. Terdapat pendapat mengatakan yang dimaksud dengan rumah di sini adalah semua rumah baik itu rumah yang dihuni maupun tidak; ia memberi salam bagi pemilik rumah jika rumah itu berpenghuni dan memberi salam bagi dirinya sendiri jika rumah itu tidak berpenghuni. Umar bin Khattab dan Ibnu Abbas berkata “jika kamu hendak masuk masjid atau rumah yang tidak berpenghuni maka ucapkanlah السلام علينا وعلى عباد الله الصالحين (semoga keselamatan tercurah kepada kami dan kepada hamba-hamba Allah yang shaleh). تَحِيَّةً(salam) Yakni ucapkanlah salam. مِّنْ عِندِ اللهِ(yang ditetapkan dari sisi Allah) Yakni Allah akan memberi kalian keselamatan dengan salam itu sebab kalian telah melaksanakan apa yang diperintahkan-Nya kepada kalian. مُبٰرَكَةً(yang diberi berkat) Yakni keberkahan dan kebaikan yang banyak dan terus menerus. طَيِّبَةً ۚ( lagi baik) Yakni jiwa orang yang mendengar salam itu akan merasa baik. Atau makna ayat ini adalah: katakanlah “Assalamualaikum warahmatullahi wabarakatuh” كَذٰلِكَ يُبَيِّنُ اللهُ لَكُمُ الْاٰيٰتِ لَعَلَّكُمْ تَعْقِلُونَ(Demikianlah Allah menjelaskan ayat-ayatnya(Nya) bagimu, agar kamu memahaminya) Yakni agar kalian dapat memahami ayat-ayat Allah dan maknanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "61. Tidak ada dosa dan kemaksiatan bagi orang-orang yang uzur yaitu orang buta, orang pincang, dan orang sakit. Tidak juga bagi diri kamu untuk makan di rumah-rumah kalian yang di dalamnya terdapat harta benda dan keluarga kalian, atau di rumah anak-anak kalian karena usaha anak termasuk usaha bapaknya. Atau di rumah bapak, ibu, saudara-saudara, paman, bibi (saudara bapak), om, atau tante kalian (saudara ibu), atau rumah-rumah yang kalian urus dengan seijin pengurusnya seperti seorang wakil (rumah), pembantu, penjaga keamanan, dan penjaga gudang. Atau rumah teman-teman yang kalian ketahui ridhanya (ash-shadiq digunakan untuk menyebut satu orang atau lebih seperti kata Al-‘Aduw dan Ath-Thiflu. Dan kata itu digunakan untuk menamai orang yang dapat dipercaya persahabatannya). Tidak ada dosa dan kemaksiatan bagi kalian untuk makan secara bersama-sama atau berkelompok-kelompok. Dan jika kalian memasuki salah satu rumah yang disebutkan ini, maka sampaikanlah salam kepada penghuninya, sebaiknya kalian mengucapkan salam untuk penghuni rumah yang berpenghuni maupun tidak berpenghuni dengan maksud memberi salam untuk diri sendiri dengan mengucapkan: “Assalamu’alaina wa ‘ala ‘ibaadillahish shalihin.” Maka Malaikat akan membalas salam kalian. Dan ucapkanlah salam yang merupakan salam dari sisi Allah yang mengandung banyak kebaikan dan menyenangkan hati orang yang mendengarnya. Seperti penjelasan itulah Allah menjelaskan bagi kalian ayat-ayat hukum supaya kalian memikirkan ayat-ayat Allah, memahami makna-maknanya dan mengetahui apa yang terkandung di dalamnya. Said bin Musayyib berkata: “Ayat ini diturunkan terkait orang-orang yang ketika keluar dengan nabi SAW menitipkan kunci-kunci rumahnya kepada orang buta, orang pincang dan orang sakit, serta kerabat mereka. Dan mereka (orang yang mendapat titipan) diperintah untuk memakan apa yang ada di dalam rumah mereka (orang yang menitipkan), mereka membutuhkan hal itu, namun mereka takut untuk memakan sesuatu dari rumah itu dan berkata: “Kami khawatir tidak boleh melakukan hal itu” Kemudian Allah SWT menurunkan ayat ini.” Hal itu telah didahului oleh Ath-Thabariy. Dikatakan bahwa tidak ada dosa atas mereka dalam meninggalkan jihad. Dan itu adalah perkataan Hasan Al-Bashriy."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidak ada dosa} dosa {bagi orang buta, orang pincang, orang sakit, dan diri kalian untuk makan di rumah kalian, di rumah-rumah ayah kalian, di rumah-rumah iibu kalian, di rumah saudara-saudara laki-laki kalian, di rumah saudara-saudara perempuan kalian, di rumah saudara-saudara laki-laki ayah kalian, di rumah saudara-saudara perempuan ayah kalian, di rumah saudara-saudara laki-laki ibu kalian, di rumah saudara-saudara perempuan ibu kalian, rumah yang kalian miliki kuncinya} rumah yang diwakilkan kepada kalian untuk dijaga {atau kawan-kawan kalian} rumah-rumah teman dan kawan kalian, sehingga kalian tidak bersalah untuk memakan di sana {Tidak ada kesalahan bagi kalian untuk makan bersama-sama mereka semua atau sendiri-sendiri} terpisah dengan, dimana kalian sendiri-sendiri {Apabila kalian memasuki rumah-rumah itu, hendaklah kalian memberi salam} maka hendaklah memberi salam satu sama lain {dengan salam yang penuh berkah dan baik dari sisi Allah. Demikianlah Allah menjelaskan ayat-ayat kepada kalian agar kamu mengerti"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "61 Allah mengabarkan tentang kenikmatan yang dikaruniakan kepada hambaNya. Dia tidak menjadikan atas mereka dalam agama ini sesuatu yang memberatkan, bahkan telah memudahkannya dengan semaksimal mungkin. Dia berfirman, ”tidak ada halangan bagi orang buta, tidak (pula) bagi orang pincang, tidak (pula) bagi orang sakit,” maksudnya tidak ada dosa bagi mereka meninggalkan perkara-perkara yang wajib bergantung pada salah satu dari sebab-sebab di atas. Hal itu seperti berjihad dan ibadah serupa lainnya yang tergantung pada penglihatan orang yang buta, kenormalan orang cacat dan kesehatan orang yang sakit. Untuk tujuan makna umum ini yang telah kami sebutkan, Allah menyebutkan keterangan ini secara mutlak, tidak mengikatnya sebagaimana Allah mengikat FirmanNya,”dan tidak (pula) bagi dirimu sendiri,” dosa “untuk makan (bersama-sama mereka) di rumah kamu sendiri,” yaitu rumah anak-anak kalian. Hal ini senada dengan hadits shahih yang tsabit, “kamu dan hartamu adalah milik bapakmu,” Dan dengan hadits yang lain,” sesungguhnya sebaik-baik yang kamu makan adalah dari jerih payahmu, dan sesungguhnya anak-anakmu adalah dari jerih payahmu.” Bukan yang dimaksudkan dari Firman Allah, “dari rumah-rumah kamu,” rumah orang itu sendiri. Karena hal ini termasuk menyampaikan sesuatu yang sudah diketahui, yang tidaklah patut ada dalam Firman Allah, dan karena merupakan bentuk peniadaan dosa dari sesuatu yang diperkirakan timbulnya satu dosa dari mereka yang telah disebutkan. Adapun rumah seseorang itu sendiri, tidak ada anggapan keliru sedikit pun tentangnya, ”atau di rumah bapak-bapakmu, di rumah ibu-ibumu, dirumah saudara-saudaramu yang laki-laki, dirumah saudaramu yang perempuan, di rumah saudara bapakmu yang laki-laki, di rumah saudara bapakmu yang perempuan, di rumah saudara ibumu yang laki-laki, di rumah saudara ibumu yang perempuan.” Mereka adalah orang-orang yang telah diketahui. “atau di rumah yang kamu milki kuncinya,” maksudnya rumah-rumah yang kalian urusi baik disebabkan perwakilan, pemberian wewenang atau hak lainnya. Adapun penafsiran ini dengan para budak, tidaklah tepat. Karena dua alasan: pertama, (kepemilikan terhadap) seorang budak tidaklah dikatakan, “kamu memiliki kunci-kuncinya,” bahkan dikatakan,”apa-apa yang kalian miliki, apa-apa yang dimilki tanganmu,” karena mereka memilikinya secara utuh, tidak hanya sekedar kuncinya. Yang kedua, bahwa rumah-rumah para budak tidak terlepas dari rumah orang itu sendiri (tuannya). Karena seorang budak dan sesuatu yang dimilkinya merupakan milik tuannya. Sehingga tidak ada alasan untuk menepiskan halangan darinya. “atau dirumah kawan-kawanmu,” kesempitan yang dihilangkan adalah berupa makan di rumah-rumah ini. Semua itu berlaku bila tanpa izin. Hikmah yang terkandung telah jelas melalui redaksi ayat ini. Orang-orang yang disebutkan itu, berdasarkan kebiasaan dan adat memilki toleransi besar tentang masalah makan di rumah-rumah mereka, disebabkan adanya tali kekerabatan yang dekat, wewenang yang sempurna, atau hubungan persahabatan. Kalau seandainya salah satu dari mereka ditakdirkan tidak punya toleransi, bakhil dalam masalah makan di rumahnya, maka tidak boleh makan di rumahnya dan kesempitan (dosa) pun belum hilang, dengan mempertimbangkan hikmah dan norma yang ada. Dan FirmanNya, “tidak ada halangan bagi kamu makan bersama-sama mereka atau sendirian,” setiap cara itu boleh, seluruh penghuni rumah itu boleh makan berbarengan atau mereka makan sendiri-sendiri. Hal ini hanya untuk menghilangkan rasa kesalahan, bukan untuk menafikan keutamaan. Jika tidak demikian, maka cara yang paling utama adalah berkumpul bersama ketika makan. “maka apabila kamu memasuki (suatu rumah dari) rumah-rumah (ini),” kata nakirah (indefinite) pada susunan kalimat syarat, berarti mencakup rumah seseorang dan rumah lainnya, baik di rumah tersebut ada penghuninya atau tidak. Maka bila seorang memasukinya, “hendaklah kamu memberi salam (kepada penghuninya yang berarti memberi salam) kepada dirimu sendiri,” hendaknya sebagian kalian mengucapkan salam terhadap sebagian lainnya. Karena kaum Muslimin itu seakan-akan pribadi yang satu, dalam rasa saling cinta, kasih sayang dan saling menolong, jadi, mengucapkan salam diperintahkan ketika akan masuk kerumah orang lain, tanpa ada perbedaan antara rumah satu dengan lainnya. Sementara hukum meminta izin ada perincian pada hukum-hukumnya seperti pada penjelasan yang lalu. Kemudian Allah memuji ucapan salam ini dengan FirmanNYa, ”salam yang ditetapkan dari sisi Allah, yang diberi berkat lagi baik,” maksudnya ungkapan salam dengan mengucap “assalamualaikum warahmatullahi wabarakatuh,” atau “assalamu’alaina wa’ala ibadillahish shalihin,” ketika kalian memasuki rumah “salam yang ditetapkan dari sisi Allah,” maksudnya, Allah telah mensyariatkannya buat kalian, dan Allah menjadikan salam sebagai ungkapan selamat bagi kalian “penuh berkah” karena mencakup keselamatan dari kekurangan dan raihan rahmat, berkah, perkembangan dan pertambahan “yang baik,” karena salam ini berasal dari kalimat yang baik yang dicintai Allah, yang mengandung keramahan jiwa dan rasa sayang kepada orang yang menerima salam, dan melahirkan kecintaan. Sesudah menerangkan hukum-hukum yang mulia ini bagi kita, Allah berfirman, ”demikianlah Allah menjelaskan ayat-ayat(Nya) bagimu,” yang menunjukkan kepada hukum-hukum syar’iNya dan hikmah-hikmahNya “agar kamu memahaminya,” tentang hukum tersebut. Kalian memahaminya dan mencernanya dengan hati kalian, supaya kalian menjadi pemilik akal dan hati yang matang. Sesungguhnya mengenali hukum syar’iNya dengan benar akan menumbuhkan akal dan mengembangkan akal pikiran. Dikarenakan nilai-nilainya merupakan nilai-nilai yang paling mulia dan adab-adabnya adalah adab yang sangat luhur, dan lantaran bentuk balasan itu berasal dari amalan sejenis, maka seseorang yang menggunakan akalnya untuk memikirkan Rabbnya merenungi ayat-ayat yang mana Allah menyerukan kepadanya, niscaya Allah akan menambahkan kemampuannya. pada ayat-ayat ini, teradapat dalil tentang kaidah umum universal yaitu bahwa kebiasaan dan adat dapat mengkhususkan lafazh-lafazh, sebagimana pengkhususan satu lafazh dengan lafazh lain. Pada asalnya, seseorang dilarang untuk mengambil makanan orang lain, sementara Allah membolehkan makan di rumah-rumah mereka berdasarkan norma kebiasaan dan adat. Setiap masalah ini tergantung dengan izin pemiliknya, bila diketahui dia memberika izinnya, baik melalui kata-kata atau kebiasaan setempat, maka boleh melakukannya. Di dalamnya terdapat dalil bahwa seorang bapak boleh mengambil dan memilki harta anaknya, selama tidak mengganggunya. Karena Allah menamakan rumah sianak sebagai rumah buat seseorang. Ayat-ayat ini (juga) memuat dalil bahwa pemegang kewenangan dalam rumah seseorang semisal istri, saudara perempuan dan orang-orang yang semisal dengan mereka, boleh makan berdasarkan hukum kebiasaan dan memberi makan para peminta berdasarkan kebiasaan pula. Juga mengandung dalil atas bolehnya bergabung dalam masalah makan, baik mereka makan bersama atau secara terpisah. Walaupun hal itu mengakibatkan sebagian mereka makan lebih banyak daripada yang lainnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nur ayat 61: Al Bazzar meriwayatkan (sebagaimana disebutkan dalam Kasyful Astaar juz 3 hal. 61) dengan sanadnya yang sampai kepada Aisyah radhiyallahu 'anha ia berkata, “Kaum muslimin ingin sekali berangkat perang bersama Rasulullah shallallahu 'alaihi wa sallam, lalu mereka serahkan kunci (rumah) mereka kepada orang-orang yang sakit dan mereka berkata kepadanya, “Kami telah halalkan kepada kamu memakan apa saja yang kamu sukai,” tetapi mereka (orang yang diserahi kunci rumah) malah berkata, “Sesungguhnya tidak halal bagi kami jika mereka mengizinkan tanpa ada kerelaan dari dirinya, “ maka Allah menurunkan ayat, “Laisa ‘alal a’maa…dst. Sampai, “Aw maa malaktum mafaatihah.” (Al Bazzar berkata, “Kami tidak mengetahui yang meriwayatkan dari Az Zuhri selain Shalih.” Al Haitsami dalam Al Majma’ juz 8 hal. 84 berkata, “Diriwayatkan oleh Al Bazzar, dan para perawinya adalah para perawi hadits shahih.” As Suyuthi berkata dalam Lubaabunnuqul, “Sanadnya shahih.”). Allah Subhaanahu wa Ta'aala memberitahukan nikmat-Nya kepada hamba-hamba-Nya dan bahwa Dia tidak menjadikan kesulitan dalam agama-Nya, bahkan memudahkannya semudah-mudahnya. Bagi mereka ini tidak ada dosa meninggalkan kewajiban yang terkait dengan kondisi fisiknya, seperti jihad, dsb. Termasuk pula makan di rumah anak-anakmu. Maksudnya, rumah yang diserahkan kepadamu mengurusnya. Yakni tidak mengapa memakan makanan yang ada di rumah orang-orang yang disebutkan meskipun mereka tidak ada jika telah diketahui ridhanya mereka terhadapnya. Yang demikian, karena uruf berlaku, bahwa mereka itu biasanya mempersilahkan makan. Qatadah berkata, “Apabila kamu masuk ke rumah kawanmu, maka tidak mengapa kamu memakan (makanannya) tanpa izinnya.” Ayat ini tertuju kepada orang yang sebelumnya merasa berdosa makan sendiri, yakni ketika tidak ada yang menemaninya makan di rumah orang-orang yang disebutkan, sehingga ia pun tidak makan. Baik rumahnya maupun rumah orang lain, baik di dalamnya ada orang maupun tidak. Jika tidak ada orang di dalamnya dan kamu berhak masuk ke dalamnya, maka ucapannya adalah, “As Salaamu ‘alainaa wa ‘alaa ‘ibaadillahish shaalihiin.” Sebagaimana yang dilakukan Ibnu Umar radhiyallahu 'anhuma. Karena kandungannya berupa selamat dari kekurangan, mendapatkan rahmat, berkah dan tambahan. Yang akan diberikan pahala terhadapnya, karena ia termasuk ucapan yang baik (al kalimuth thayyib) yang dicintai Allah. Yakni rambu-rambu agama-Nya. Dan bertambah cerdas. Yang demikian, karena mengetahui hukum-hukum syar’i dan hikmah-hikmahnya dapat menambah akal menjadi cerdas. Dalam ayat ini terdapat dalil terhadap kaidah yang umum, yaitu: الْعُرْفُ وَالْعَادَةُ مُخَصِّصٌ لِلْألْفَاظِ، كَتَخْصِيْصِ اللَّفْظِ اللَّفْظَ “‘Uruf dan adat mentakhshis lafaz, seperti lafaz ditakhshis oleh lafaz.” Yang demikian adalah karena pada asalnya, seseorang dilarang mengambil makanan orang lain, namun Allah membolehkan memakan makanan mereka yang disebutkan itu karena uruf dan kebiasaan. Oleh karena itu, setiap masalah yang tergantung oleh izin dari pemilik sesuatu, maka apabila diketahui izinnya melalui ucapan atau uruf, maka boleh maju mengambilnya. Selain yang disebutkan di atas, ayat ini juga menunjukkan beberapa hal berikut: - Bapak boleh mengambil dan memiliki harta anaknya selama tidak sampai memadharratkannya. - Orang yang mengurus rumah seseorang, seperti istrinya, saudarinya, dsb. boleh makan dan memberikan makan kepada peminta-minta secara biasanya. - Bolehnya ikut serta dalam suatu makanan meskipun sampai mengakibatkan sebagiannya memakan lebih daripada yang lain."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nur Ayat 61",
    "description": "Usai memberi kemudahan kepada perempuan tua dalam hal berpakaian, pada ayat ini Allah menjalankan prinsip kemudahan kepada orang yang memiliki halangan tertentu. Tidak ada halangan, yakni tidak ada dosa dan tidak pula menjadi kemaksiatan bagi orang buta, tidak pula bagi orang pincang, tidak pula bagi orang sakit, dan tidak pula bagi dirimu untuk makan bersama mereka di rumah kamu atau di rumah bapak-bapak kamu, di rumah ibu-ibu kamu, di rumah saudara-saudara kamu yang laki-laki, di rumah saudara-saudara kamu yang perempuan, di rumah saudara-saudara bapak kamu yang laki-laki, di rumah saudara-saudara bapak kamu yang perempuan, di rumah saudara-saudara ibu kamu yang laki-laki, di rumah saudara-saudara ibu kamu yang perempuan, demikian juga di rumah yang kamu miliki atau dititipi kuncinya, atau di rumah kawan-kawan kamu, karena seorang kawan tentu tidak berkeberatan menjamu kawannya. Tidak ada halangan bagi kamu makan bersama-sama mereka atau sendiri-sendiri. Apabila kamu memasuki rumah-rumah hendak-lah kamu memberi salam kepada penghuninya, yang itu berarti kamu memberi salam kepada dirimu sendiri, dengan salam yang penuh berkah dan baik dari sisi Allah, bukan seperti salam pada masa jahiliah. Demikianlah Allah menjelaskan ayat-ayat-Nya bagimu agar kamu mengerti, menghayati, dan mengamalkannya dengan baik. 62. Setelah menjelaskan izin dan etika pertemuan, kini Allah meng-uraikan etika perpisahan. Orang mukmin sejati adalah orang yang ber-iman kepada Allah dan rasul-Nya, yaitu nabi Muhammad, dan apabila mereka berada bersama-sama dengan beliau dalam suatu urusan bersama, mereka tidak meninggalkan beliau sebelum meminta izin kepadanya lalu diizinkan olehnya. Sesungguhnya orang-orang yang meminta izin kepadamu, wahai nabi Muhammad, dalam urusan penting, mereka itulah orang-orang yang benar-benar beriman kepada Allah dan rasul-Nya. Maka apabila mereka meminta izin kepadamu karena suatu keperluan, berilah izin kepada siapa yang engkau kehendaki di antara mereka dan tidak mengapa jika engkau tidak memberi izin sesuai maslahat yang engkau perhitungkan, dan mohonkanlah ampunan untuk mereka kepada Allah atas kepergian mereka. Sungguh, Allah maha pengampun kepada orang-orang yang engkau mintakan ampunan untuknya, maha penyayang kepada mereka yang engkau mintakan rahmat untuknya. Demikian mulia kedudukan nabi sehingga para sahabat harus meminta izin apabila hendak meninggalkan majelis beliau."
  }
]