[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan janganlah kalian (wahai kaum Mukminin) ketika kalian memanggil Rasulullah, kalian mengatakan, “Wahai Muhammad”, atau “Wahai Muhammad putra Abdullah”, sebagaimana sebagian kalian memanggil sebagian yang lain. Akan tetapi, muliakanlah dia, dan ucapkanlah, “Wahai Nabi Allah”, “Wahai Rasulullah”. Allah telah mengetahui orang-orang munafik yang keluar meninggalkan majelis Rasulullah, sebagian mereka bersembunyi di belakang sebagian yang lain. Maka hendaknya orang-orang yang menyalahi perintah Rasulullah takut akan turun pada mereka cobaan dan keburukan atau akan menimpa mereka siksaan pedih lagi menyakitkan di akhirat kelak."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "63. Wahai orang-orang mukmin! Muliakanlah Rasulullah bila kalian memanggilnya. Janganlah kalian memanggilnya seperti panggilan sebagian kalian kepada sebagian yang lain yaitu dengan menyebut namanya, seperti, ‘Wahai Muhammad’, atau dengan menyebut nama ayahnya, seperti, Wahai putra Abdullah. Akan tetapi katakanlah, Wahai Rasulullah, Wahai Nabi Allah. Dan apabila dia menyeru kalian untuk perkara umum, maka janganlah kalian menjadikan seruannya seperti seruan sebagian kalian kepada sebagian yang lain yang biasanya terjadi dalam perkara-perkara yang kurang penting, akan tetapi bersegeralah untuk memenuhi seruannya. Sesungguhnya Allah mengetahui orang-orang yang berangsur-angsur pergi di antara kalian secara sembunyi-sembunyi tanpa izin, maka hendaklah orang-orang yang menyalahi perintah Rasulullah -ṣallallāhu 'alaihi wa sallam- takut akan ditimpa cobaan dan bencana, atau ditimpa azab yang pedih, yang mereka tidak sanggup menahannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "63. Allah memberi petunjuk kepada orang-orang beriman dalam adab berbicara dan menghormati Nabi, yaitu dengan memanggilnya ‘wahai Rasulullah’ atau ‘wahai nabiyullah’ dengan penuh adab dan kerendahan hati; serta adab ketika pergi dari majelisnya yaitu dengan meminta izin terlebih dahulu sebelum pergi. Sesungguhnya tidak tersembunyi dari Allah kepergian orang-orang munafik dari majelis Rasulullah secara diam-diam tanpa meminta izin; Allah mengetahui mereka. Kemudian Allah memberi peringatan keras terhadap orang-orang yang melanggar hukum-hukum-Nya, karena pelanggaran itu dapat mendatangkan berbagai musibah di dunia atau menjadikan mereka mendapat azab neraka yang sangat pedih di akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "63. لَّا تَجْعَلُوا۟ دُعَآءَ الرَّسُولِ بَيْنَكُمْ كَدُعَآءِ بَعْضِكُم بَعْضًا ۚ (Janganlah kamu jadikan panggilan Rasul diantara kamu seperti panggilan sebahagian kamu kepada sebahagian (yang lain)) Yakni janganlah kalian jadikan seruan beliau kepada kalian seperti seruan sebagian kalian kepada sebagian lainnya dalam hal menyepelekan jawabannya atau meninggalkannya tanpa meminta izin atau dengan menjawabnya dengan suara yang keras. Pendapat lain mengatakan maknanya adalah panggillah ia dengan panggilan ‘wahai Rasulullah’ dengan penuh kelembutan, dan janganlah kalian memanggilnya dengan panggilan ‘hai Muhammad’ dengan penuh kekasaran. Allah memerintahkan mereka agar memuliakan dan menghormati beliau. Pendapat lain mengatakan maknanya adalah janganlah kalian membuat Rasulullah marah sehingga ia mendoakan kalian agar mendapat keburukan, sebab doa beliau mustajab. قَدْ يَعْلَمُ اللهُ الَّذِينَ يَتَسَلَّلُونَ مِنكُمْ لِوَاذًا ۚ( Sesungguhnya Allah telah mengetahui orang-orang yang berangsur-angsur pergi di antara kamu dengan berlindung (kepada kawannya)) Mereka adalah orang-orang munafik yang meninggalkan shalat jum’at dengan mengendap-endap, mereka saling menempel di belakang temannya agar Rasulullah tidak melihatnya; begitu pula ketika mereka dalam pertemuan yang membahas urusan jihad dan lainnya. Makna (اللواذ) adalah berpaling secara diam-diam. فَلْيَحْذَرِ الَّذِينَ يُخَالِفُونَ عَنْ أَمْرِهِۦٓ( maka hendaklah orang-orang yang menyalahi perintah Rasul takut) Yakni melanggar perintah Rasulullah dengan tidak menjalankannya, dan pergi mengendap-endap agar tidak mengerjakan ketaatan kepadanya. أَن تُصِيبَهُمْ فِتْنَةٌ أَوْ يُصِيبَهُمْ عَذَابٌ أَلِيمٌ(akan ditimpa cobaan atau ditimpa azab yang pedih) Makna (الفتنة) adalah pembunuhan dan gempa bumi. Pendapat lain mengatakan maknanya adalah terkuncinya hati mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "63. Wahai orang-orang muslim, janganlah kalian samakan panggilan terhadap rasulallah seperti panggilan sebagian kalian terhadap sebagian lainnya dalam meminta perijinan, jangan meremehkan dalam memberi jawaban, jangan meninggikan suara, dan jangan berkata: “Wahai Muhammad” namun katakanlah “Wahai Nabi Allah dan wahai Rasulallah” dengan lembut penuh kerendah hatian. Sesungguhnya mendahulukan diri untuk menjawab beliau adalah wajib, dan keluar tanpa seijinnya adalah haram. Allah mengetahui orang yang melepaskan diri atau pergi secara bertahap dan sembunyi-sembunyi dari majelis Rasulallah SAW, ketidak dia sedang sibuk dengan mereka. Liwadz adalah usaha saling menutupi satu sama lain yang dilakukan mereka, Dan Qad adalah untuk memastikan. Dan sebaiknya orang-orang yang menentang dan menolak perintah rasulallah serta pergi tanpa seijinnya itu takut bahwa mereka akan ditimpa bala’ dan kesengsaraan di dunia, seperti pembantaian dan gempa bumi, atau azab yang pedih di akhirat. Ibnu Abbas berkata: “Mereka berkata:”Wahai Muhammad, wahai ayahnya Qasim” Lalu Allah menurunkan ayat {Laa Taj’aluu Du’aa’ar Rasuul …}, lalu mereka berkata: “Wahai Nabi Allah, Wahai Rasulallah”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Janganlah menjadikan panggilan Rasul} panggilan Rasulallah SAW {di antara kalian seperti panggilan sebagian kalian kepada sebagian lain} seperti panggilan sebagian kalian kepada yang lain dengan namanya, tetapi agungkanlah dan muliakanlah dia, maka katakanlah,”Ya Rasulallah, Ya nabiyallah, dengan lembut dan tunduk {Sungguh Allah mengetahui orang-orang yang menyelinap keluar di antara kalian dengan berlindung} meninggalkan kalian dengan sembunyi tanpa meminta izin dengan berlindung pada sesuatu karena takut dilihat seseorang {Maka hendaklah orang-orang yang menyalahi perintah Rasul} perintah Rasulullah SAW {takut akan mendapat cobaan} cobaan dan ujian {atau ditimpa azab yang pedih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "63 “janganlah kamu jadikan panggilan Rasul diantara kamu seperti panggilan sebagian kaum kepada sebagian (yang lain),” [maksudnya jangan kalian jadikan panggilan Rasul kepada kalian atau panggilan kalian kepada Rasul sebagimana panggilan sebagian kalian kepada sebagian yang lain]. Apabila beliau memanggil kalian, maka sambutlah sebagai bentuk kewajiban. Bahkan bila kalian shalat pun, wajib bagi kalian untuk menyambutnya. Tiada seorangpun yang mengatakan suatu perkataan yang menjadi kewajiban atas umat untuk menerima dan mengamalkannya kecuali perkataan Rasulullah, lantaran beliau terjaga dari kesalahan sementara kita diperintahkan untuk mengikuti beliau. Allah berfirman, ”hai orang-orang yang beriman, penuhilah seruan Allah dan seruan rasul apabila Rasul menyeru kamu kepada suatu yang memberi kehidupan kepada kamu.” (al-anfal:24) Demikan pula, janganlah kalian menjadikan panggilan kalian kepada Rasul sebagimana panggilan sebagian kalian kepada sebagian lainnya. Jangan kalian berkata, ”wahai Muhammad,” saat kalian memanggil beliau atau, ”wahai Muahmmad bin Abdillah!” sebagaimana kalian berkata kepada sesama kalian. Akan tetapi, karena kemuliaan dan keutamaan, serta keistimewaan Rasulullah dari orang lain, hendaklah dipanggil dengan, ”wahai Rasulullah, wahai Nabi Allah,” “sesungguhnya Allah telah mengetahui orang-orang yang berangsur-angsur pergi dari kalian dengan berlindung (kepada kawannya),” ketika Allah memuji kaum yang beriman kepada Allah dan RasulNya yang mana apabila mereka bersama Rasulullah dan suatu urusan yang memerlukan pertemuan, maka mereka tidak pergi (kecuali) setelah mereka meminta izin kepada beliau. Allah mengancam orang-orang yang tidak mau melakukannya dan pergi tanpa izin, walaupun kalian tidak mengetahui kepergiannya (yang dilakukan) dengan sembunyi-sembunyi. Inilah yang dimaksud dengan FirmanNYa, ”orang-orang yang berangsur-angsur pergi dari kalian dengan berlindung (kepada kawannya),” maksudnya berlindung diri ketika mereka menyelinap keluar dan pergi dengan sesuatu yang dapat menghalangi pandangan mata, maka Allah mengetahui mereka dan akan memberikan balasan kepada mereka dengan balasan yang setimpal. Oleh karena itu, Allah mengancam mereka dengan FirmanNYa, “maka hendaklah orang-orang yang menyalahi perintahNya takut,” yaitu mereka yang pergi untuk memenuhi sebagian keperluan mereka dengan berpaling dari Allah dan RasulNya, lalu bagaimana dengan orang-orang yang pergi tanpa ada urusan sama sekali? Ia meninggalkan urusan Allah tanpa ada kesibukkan “mereka akan ditimpa cobaan,” berupa kesyirikan dan kejahatan “atau ditimpa azab yang pedih,”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nur ayat 63: Maksudnya adalah jangan memanggil Rasulullah shallallahu 'alaihi wa sallam seperti memanggil antara sesama, misalnya memanggil Beliau dengan mengatakan, “Wahai Muhammad,” tetapi katakanlah, “Wahai Nabiyullah,” atau “Wahai Rasulullah,” dengan ucapan yang lembut dan tawadhu’ dan dengan merendahkan suara. Qatadah berkata, “Allah memerintahkan agar Nabi-Nya shallallahu 'alaihi wa sallam disegani, dimuliakan, dibesarkan dan dituakan.”Bisa juga maksud ayat ini adalah, tidak menjadikan panggilan (seruan) Rasulullah shallallahu 'alaihi wa sallam seperti seruan antara sesama kita yang bisa dipenuhi dan bisa tidak. Oleh kaena itu, apabila Beliau memanbggil kita, maka kita wajib mendatangi bahkan meskipun kita sedang shalat sunat. Misalnya dengan keluar dari masjid diam-diam disangkanya tidak ada yang tahu, padahal Allah mengetahui mereka dan akan memberikan balasan yang setimpal. Oleh karena itulah, pada lanjutan ayatnya Dia mengancam mereka. Dengan pergi diam-diam (tanpa menampakkan dirinya) dan meminta izin karena ada urusan atau bahkan tidak ada urusan sama sekali, tetapi hanya mengikuti hawa nafsunya saja. Di hatinya, seperti kekufuran, kemunafikan atau kebid’ahan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nur Ayat 63",
    "description": "Usai menjelaskan tata cara berpamitan kepada nabi, Allah lalu menegaskan keharusan memenuhi undangan dari nabi. Wahai orang-orang beriman, janganlah kamu jadikan panggilan rasul Muhammad di antara kamu seperti panggilan sebagian kamu kepada sebagian yang lain. Kamu harus memenuhi panggilan beliau, tidak dibenarkan bagi kamu mengabaikannya sebagaimana kamu diperkenankan tidak memenuhi panggilan orang lain. Sungguh, Allah mengetahui orang-orang yang keluar dari majelis nabi secara sembunyi-sembunyi di antara kamu dengan berlindung kepada kawannya. Maka, hendaklah orang-orang yang menyalahi perintah rasul-Nya, yakni berpaling dari perintahnya dan meninggalkannya tanpa izin, takut akan mendapat cobaan berat di dunia atau ditimpa azab yang pedih di akhirat. 64. 'ketahuilah bahwa sesungguhnya milik Allah-lah apa yang di langit dan di bumi serta segala isinya. Sungguh, dia mengetahui keadaan kamu sekarang, baik kamu beriman maupun kamu ingkar. Dan dia mengetahui pula keadaan manusia di hari ketika mereka dikembalikan kepada-Nya, lalu diterangkan-Nya kepada mereka apa yang telah mereka kerjakan selama di dunia. Dan Allah maha mengetahui segala sesuatu di alam semesta. []."
  }
]