[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Telah dekat terjadinya hari kiamat dan keputusan Allah untuk mengazab kalian (wahai orang-orang kafir), maka janganlah kalain meminta untuk disegerakan datangnya azab itu lantaran hasrat memperolok ancaman rasul kepada kalian. Allah maha suci dari perbuatan syirik dan sekutu-sekutu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Azab yang Allah putuskan untuk kalian - wahai orang-orang kafir- sudah dekat, maka janganlah meminta disegerakan sebelum waktunya. Mahasuci Allah lagi Mahatinggi dari sekutu-sekutu yang diangkat oleh kaum musyrikin itu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "91. Mereka adalah orang-orang yang melanggar hak al-Qur'an karena menjadikannya bagian-bagian yang terpisah; mereka mengimani sebagian isinya dan mengingkari sebagian yang lain tergantung hawa nafsu dan kemaslahatan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. أَتَىٰٓ أَمْرُ اللهِ (Telah pasti datangnya ketetapan Allah) Yakni datang waktu diutusnya Nabi Muhammad. Pendapat lain mengatakan yang dimaksud adalah datangnya siksaan Allah bagi orang-orang musyrik. Dan menurut pendapat beberapa ahli tafsir, yakni hari kiamat pasti akan datang. فَلَا تَسْتَعْجِلُوهُ ۚ( maka janganlah kamu meminta agar disegerakan) Yakni maka janganlah kalian mengharap kedatangannya sebelum waktunya. سُبْحٰنَهُۥ وَتَعٰلَىٰ عَمَّا يُشْرِكُونَ(Maha Suci Allah dan Maha Tinggi dari apa yang mereka persekutukan) Maha Tinggi dan Maha Suci Allah dari memiliki sekutu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "1. Datangnya ketetapan Allah telah menjadi kepastian, yaitu pertolongan kepada nabi dan mengazab orang-orang kafir. Maka janganlah kamu meminta agar disegerakan sebab itu sudah ditetapkan. Maha Suci Allah dan Maha Tinggi dari apa yang mereka persekutukan dengan berhala-berhala. Orang-orang musyrik telah meminta agar hari kiamat atau kebinasaan bagi mereka disegerakan. Mereka berkata, jika memang perkataan itu benar maka berhala kami akan menolong dan menyelamatkan kami dari itu. Maka turunlah ayat ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketetapan Allah} hukuman Allah untuk orang-orang musyrik {pasti datang} sangat dekat {Maka janganlah meminta agar dipercepat. Maha suci dan Maha tinggi Dia dari apa yang mereka sekutukan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1. Allah berfirman dalam rangka mendekatkan (waktu) kedatangan ketetapanNYa yang telah Dia janjikan dan memastikan maka janganlah kamu meminta minta agar disegerakan (datang) nya” sesungguhnya ia akan tiba. Dan setiap sesuatu yang pasti datang, berarti dekat. “Mahasuci Allah dan Mahatinggi dari apa yang mereka persekutukan” yang berbentuk penisbatan sekutu, anak, istri, padanan, dan lain sebagainya, yang dilekatkan oleh kaum musyrikin kepada Allah, yang tidak pantas dengan keagungan Allah dan menafikan kesempurnaanNYa."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna Kata: (أَتَىٰٓ أَمۡرُ ٱللَّهِ) ataa amrullah : telah datang dan mendekat keputusan Allah untuk mengazab kalian, wahai orang-orang musyrik, maka tidak perlu kalian meminta dipercepat. Makna ayat: Kaum Musyrikin Mekah telah meminta percepatan azab dan bahkan memintanya lebih dari sekali, maka Allah menurunkan Firman-Nya “Telah datang keputusan Allah.” Yaitu untuk mengazab kalian, wahai orang-orang yang memintanya. Azab itu telah dekat dan akan datang, An-Nadhr bin Al-Harits yang berkata, “Ya Allah, seandainya ini merupakan kebenaran dari-Mu maka hujanilah kami dengan batu dari langit atau datangkanlah kepada kami azab yang pedih.” Telah datang kepadanya setelah beberapa tahun, maka ia binasa pada perang Badar, dan menuju Jahanam. Azab hari kiamat bagi yang meminta percepatannya, telah dekat waktunya, oleh karena itu perkataan ini diungkapkan dengan bentuk lampau, karena kepastian dan dekatnya azab itu, maka tidak perlu meminta percepatan, sehingga Allah berfirman “maka janganlah kamu meminta agar disegerakan (datang)nya.” Firman-Nya “Maha Suci Allah dan Maha Tingga Dia dari apa yng mereka persekutukan.” Suci dan bersih dari apa yang mereka persekutukan berupa sesembahan yang batil, karena tidak ada sesembahan yang berhak disembah kecuali Dia. Pelajaran dari ayat: • Dekatnya hari kiamat, oleh karena itu tidak perlu memintanya untuk disegerakan, karena hari itu pasti akan datang dan setiap yang akan datang adalah dekat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 1: Dalam ayat ini, Allah Ta’ala menerangkan dekatnya waktu azab yang diancamkan-Nya kepada orang-orang kafir dan menerangkan bahwa hal itu pasti terwujud. Yang demikian karena sesuatu yang akan datang adalah dekat. Ketetapan Allah di sini adalah hari kiamat yang telah diancamkan kepada orang-orang musyrikin. Dalam ayat tersebut digunakan fi’il madhi (kata kerja lampau) untuk menunjukkan benar-benar terjadi atau pasti. Sebelum tiba waktunya. Seperti perbuatan mereka, menisbatkan sekutu, anak, istri, dan tandingan kepada-Nya serta penisbatan lainnya yang sesungguhnya tidak layak dengan kebesaran-Nya, dan menafikan kesempurnaan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 1",
    "description": "Allah menegaskan bahwa ketetapan Allah, yaitu hari kiamat dan masa ketika para pendurhaka akan menerima azab, pasti datang, maka janganlah kamu, wahai para pendurhaka, meminta agar dipercepat kedatangan-Nya. Mahasuci Allah dari segala aib, kesyirikan, dan kekurangan, dan mahatinggi dia dari apa yang mereka sembah, berupa berhala atau apa pun juga yang mereka persekutukan dengan dia. Menjelaskan kesempurnaan ketetapan dan penciptaan-Nya, Allah berfirman, dia menurunkan para malaikat, yakni malaikat jibril, membawa wahyu dengan perintah-Nya kepada siapa yang dia kehendaki untuk diberi wahyu di antara hamba-hamba-Nya yang taat dan suci jiwanya. Inti wahyu itu ialah pesan yang berisi, peringatkanlah oleh kalian, wahai hamba-hamba yang aku beri wahyu, bahwa tidak ada tuhan, penguasa alam raya, pencipta langit dan bumi yang berhak disembah selain aku yang mahaesa dan mahakuasa, tidak ada sekutu bagi-ku, maka hendaklah kamu bertakwa kepada-ku. Berimanlah kepada-ku, laksanakanlah semua perintah-ku, dan tinggalkanlah segala laranganku. (lihat: surah ga'fir/40: 15 dan asy-syura'/42: 52)."
  }
]