[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dia-lah yang menurunkan bagi kalian hujan dari awan, lalu menjadikan darinya bagi kalian air yang kalian minum, dan menumbuhkan bagi kalian pepohonan yang kalian mengembalakan ternak-ternak kalian padanya, dan kembali untuk kalian air susunya dan manfaatnya juga."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Allah -Subḥānahu- menurunkan hujan dari awan, dengannya kalian mendapatkan air tawar untuk kalian minum dan juga diminum oleh hewan-hewan kalian, air ini juga menumbuhkan pohon-pohon yang menjadi makanan bagi ternak-ternak kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "10-11. Hanya Allah yang menurunkan hujan dari awan bagi kalian dengan kekuasaan-Nya yang besar, agar kalian dapat minum darinya dan menyirami tanaman-tanaman yang ada di tempat menggembalakan hewan ternak. Air hujan itu mengeluarkan berbagai macam tanaman bagi kalian, dan menumbuhkan pohon zaitun, kurma, anggur, dan seluruh jenis buah-buahan. Sungguh dalam kenikmatan yang mulia ini terdapat tanda-tanda yang nampak bagi orang-orang yang memikirkan besarnya kenikmatan yang menjadi bukti keesaan Allah yang telah menciptakannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. لَّكُم مِّنْهُ شَرَابٌ (sebahagiannya menjadi minuman) Yang diminum manusia dan hewan-hewan, diantaranya adalah air sumur dan mata air. Dan sebagian lainnya diserap oleh pepohonan yang dimakan oleh hewan-hewan. فِيهِ تُسِيمُونَ(yang pada (tempat tumbuhnya) kamu menggembalakan ternakmu) Yakni pada tumbuh-tumbuhan yang kalian gunakan untuk menggembalakan hewan ternak kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10. Dialah, Yang telah menurunkan air hujan dari langit untuk kamu, sebahagiannya menjadi minuman dan sebagian dari air itu bisa menyuburkan tumbuh-tumbuhan, dan pada tempat tumbuhnya tumbuhan-tumbuhan itu kamu dapat menggembalakan ternakmu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dialah yang telah menurunkan air dari langit untuk kalian. Sebagiannya menjadi minuman dan sebagiannya untuk tumbuhan} dari air itu tumbuhlah pohon {yang dengannya kalian menggembalakan ternak kalian"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "10-11. (kalian memikirkan) dengan itu, tentang sempurnanya kekuasaan Allah yang telah menurunkan air ini dari awan yang tipis lagi lembut, dan (tentang sempurnanya) rahmatNya. Buktinya, Allah menjadikannya air yang tercurah banyak, mereka minum darinya, dan binatang binatang ternak merekapun minum dadrinya. Mereka mengairi tanah tanah pertanian mereka dengan sebagiannya. Sehingga keluarlah buah buahan yang banyak dan kenikmatan kenikmatan yang melimpah."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (وَمِنۡهُ شَجَرٞ) wa minhu syajar : “dan sebagiannya (menyuburkan) tumbuhan” karena sebabnya muncullah tetumbuhan, yaitu tetumbuhan secara umum. (فِيهِ تُسِيمُونَ) fiihi tusiimuun : “dan padanya kamu menggembalakan ternakmu.” Kalian menggembala hewan ternak kalian. Makna ayat: Dan di antara tanda-tanda rububiyah-Nya yang menjadikan-Nya Tuhan yang berhak untuk disembah, ada pada ayat-ayat berikut, 10, 11, 12, 13, 14, dan 15, sebagaimana Firman-Nya “Dialah yang menurukan air dari langit untuk kamu, sebagiannya menjadi minuman” yang kalian minum dan bersuci dengannya “dan sebagiannya” dari air tersebut yang turun dari langit untuk menyuburkan tanaman karena—asy-syajar artinya seluruh jenis tanaman—keberadaannya tergantung pada air. Firman-Nya “padanya kamu menggembalakan ternakmu.” Kalian menggembalakn ternak kalian kepada tanaman tersebut. Dikatankan, سَامَ المَاشِيَةَ yaitu menggiringnya menuju ladang untuk gembala dan سَامَتِ المَاشِيَةُ yaitu hewan itu pergi dengan sendirinya menuju ladang (untuk makan)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 10: Bagi kamu dan hewan ternakmu. Sehingga keluar beraneka ragam buah-buahan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 10",
    "description": "Ayat-ayat berikut menjelaskan berbagai nikmat yang Allah anugerahkan kepada manusia. Dialah yang telah menurunkan air hujan dari arah langit untuk kamu manfaatkan guna memenuhi kebutuhan kamu. Sebagiannya menjadi minuman bagi kamu dan binatang-binatang peliharaanmu, dan sebagiannya yang lain dapat kamu gunakan untuk menyirami tumbuhan, yang padanya, yaitu pada tumbuhan hijau itu, kamu menggembalakan ternakmu sehingga mereka dapat makan dan menghasilkan produk yang kamu butuhkan, seperti susu, daging, dan bulu. Dengan air hujan itu pula dia menumbuhkan untuk kamu beragam tanam-tanaman yang dapat kamu manfaatkan untuk memenuhi kebutuhan kamu. Dengan air hujan itu pula dia menumbuhkan pohonpohon penghasil buah, seperti zaitun, kurma, anggur, dan segala macam buah-buahan dari pohon-pohon yang tidak disebutkan. Sungguh, pada yang demikian itu, yakni turunnya hujan dan kenikmatan yang ditimbulkannya, benar-benar terdapat tanda yang nyata mengenai kebesaran, keagungan, dan kekuasaan Allah bagi orang yang berpikir. (lihat: surah ar-ra'd/13: 4)."
  }
]