[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "99-100. Sesungguhnya setan tidak mempunyai kemampuan menguasai orang-orang yang beriman kepada Allah dan RasulNya, dan kepada tuhan mereka saja, mereka itu bersandar. Sesungguhnya kekuasaan setan hanyalah pada orang-orang yang menjadikannya sebagai penolong bagi mereka dan mereka juga menaatinya, dan juga terhadap orang-orang yang karena taat kepada setan, mereka mepersekutukan Allah ."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "100. Kekuasaan setan melalui was-was hanya atas orang-orang yang menjadikan setan sebagai penolongnya, menaatinya dalam penyesatannya, dan orang-orang yang karena penyesatannya berbuat syirik kepada Allah dengan menyembah selain Allah bersama penyembahan Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "100. إِنَّمَا سُلْطٰنُهُۥ (Sesungguhnya kekuasaannya (syaitan) hanyalah) Yakni kekuasaannya untuk menyesatkan. عَلَى الَّذِينَ يَتَوَلَّوْنَهُۥ(atas orang-orang yang mengambilnya jadi pemimpin) Yakni yang menjadikannya panutannya, yang mengikuti godaan setan dan bermaksiat kepada Allah. وَالَّذِينَ هُم بِهِۦ مُشْرِكُونَ(dan atas orang-orang yang mempersekutukannya dengan Allah) Yakni orang-orang yang diakibatkan oleh godaan setan mereka menjadi orang-orang yang menyekutukan Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "100. Sesungguhnya setan mampu menggoda orang-orang yang meminta pertolongan kepadanya dengan menaati gangguannya. Dan akibat ganguan setan, mereka syirik kepada Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kuasanya hanyalah} kuasanya {terhadap orang-orang yang menjadikannya pemimpin} yang menjadikannya pemimpin yang ditaati {dan orang-orang yang menjadi musyrik karena dia"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "98-100. Maksudnya, jika kamu hendak membaca Kitabullah yang merupakan kitab termulia dan paling agung, -di dalamnya terkandung muatan yang memperbaiki hati dan ilmu yang banyak-, maka sesungguhnya setan sangat antusias menggoda seorang hamba saat ia akan memulai mengerjakan amalan-amalan yang utama, lalu berusaha untuk membelokannya dari tujuan dan nilai-nilainya. Jalan menuju keselamatan dari gangguan setan ialah kembali kepada Allah dan berlindung kepada Allah dari kejahatannya, membaca Taawudz dengan merenungi maknanya dan hatinya berserah diri kepada Allah agar menyingkirkan setan darinya, tekun untuk mengenyahkan bisikan-bisikan dan imajinasi-imajinasinya, mengerahkan tenaga untuk menempuh faktor paling kuat guna mengusirnya. Yaitu menghiasi diri dengan baju iman dan tawakal. Sesungguhnya setan itu “tidak ada kekuasaannya,” maksudnya, penguasaan “atas orang-orang yang beriman, dan kepada Rabbnya,” semata, tiada sekutu bagiNya “mereka bertawakal,” maka Allah menyingkirkan keburuukan setan dari kaum Mukminin yang bertawakal kepadaNya, sehingga tiada celah tersisa baginya atas mereka. “Sesungguhnya kekuasaannya (setan) hanyalah,” maksudnya penguasaannya “atas orang-orang yang menjadikannya sebagai pemimpin,” menjadikannya sebagai pemimpin bagi mereka. Demikian itu, dengan cara melepaskan diri dari (bimbingan) kepemimpinan Allah dan masuk ke dalam ketaatan kepada setan serta bergabung dengan pasukannya. Mereka sendirilah yang memberikan (tongkat) kepemimpinan bagi setan atas diri mereka. Maka setan betul-betul mendorong mereka ke kubangan maksiat dan menghalau mereka ke neraka dengan sungguh-sungguh."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat: “Kekuasaannya hanyalah atas orang-orang yang menjadikannya pemimpin” dengan taat kepadanya dan mengerjakan keburukan dan kebatilan yang telah dibuat menjadi indah dalam pandangan mereka. “dan atas orang-orang yang menyekutukannya dengan Rabb mereka.” Mereka adalah orang-orang yang dikuasai oleh setan, sehingga menyesatkan mereka hingga binasa. Pelajaran dari ayat: • Penjelasan bahwa setan mampu menguasai wali-wali mereka yang menaatinya dan berbuat syirik kepada Rabb mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 100: Dengan menaatinya dan ikut ke dalam golongannya. Jika setan sebagai pemimpinnya, maka dia akan menggiring mereka ke dalam neraka, wal ‘iyaadz billah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 100",
    "description": "Betapapun setan berupaya menggoda dan menjerumuskan orang yang beriman dan bertawakal kepada Allah, ia tidak akan berhasil. Kekuasaan dan pengaruhnya, yakni bisikan, rayuan, dan godaan setan hanyalah berdampak negatif terhadap orang yang menjadikannya pemimpin serta mendengar dan mengikuti bisik rayunya, dan berpengaruh negatif pula terhadap orang yang mempersekutukannya dengan Allah, yakni menjadikan setan sebagai sekutu-sekutu bagi Allah. Usai meminta pembaca Al-Qur'an untuk memohon perlindungan Allah dari setan, melalui ayat ini Allah lalu meyakinkan kepada nabi Muhammad dan umatnya dengan menjelaskan bahwa penggantian suatu ayat dengan ayat yang lain adalah inisiatif dari Allah, bukan dari nabi Muhammad. Allah menyatakan, dan apabila kami, Allah, mengganti suatu ayat Al-Qur'an dengan ayat yang lain, dan Allah yang maha mengetahui lebih mengetahui apa yang diturunkan-Nya, antara lain terkait kapan dan di mana ayat itu diturunkan, ayat yang diganti dan yang menggantikannya, serta maslahat apa yang terkandung dalam penggantian ayat tersebut. Allah menyatakan hal ini karena mereka, yakni orang-orang kafir, berkata, 'sesungguhnya engkau, wahai Muhammad, pembohong dan hanya mengada-ada saja. Engkau mengaku penggantian ayat bersumber dari Allah, padahal itu dari kemauanmu sendiri. Ketahuilah, wahai nabi Muhammad, bahwa sebenarnya kebanyakan mereka yang kafir dan musyrik tidak mengetahui apa yang mereka ucapkan."
  }
]