[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apabila Kami menggantikan satu ayat dengan ayat yang lain, dan Allah maha pencipta lebih mengetahui kemaslahatan makhluk-makhlukNya melalui hukum-hukum yang diturunkanNYa dalam berbagai waktu yang berbeda-beda, orang-orang kafir berkata, ”sesungguhnya kamu (wahai Muhammad), seorang pembohong yang mengada-adakan kedustaan atas nama Allah yang tidak pernah Dia firmankan,” padahal Muhammad bukanlah seperti orang yang mereka duga-duga. akan tetapi, karena kebanyakan mereka tidak mempunyai ilmu tentang tuhan mereka, syariat dan hukum-hukumNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "101. Jika Kami menghapus hukum satu ayat dari Al-Qur`ān dengan ayat lainnya, dan Allah lebih mengetahui tentang apa yang Dia hapus dari Al-Qur`ān karena hikmah-Nya, Dia Maha mengetahui apa yang tidak dihapus darinya, maka mereka berkata, kamu wahai Muhammad adalah pendusta yang berbohong atas nama Allah. Mereka berkata demikian karena mereka tidak mengetahui bahwa nasakh (menghapus ) terjadi karena hikmah Ilahiyah yang mendalam."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "101-102. Dan jika Kami mengganti suatu ayat dengan ayat yang lain -dan Allah Maha Mengetahui kemaslahatan hamba-hamba-Nya dalam al-Qur'an yang diturunkan- maka orang-orang kafir akan berkata tanpa menghormati Rasulullah: “Hai Muhammad, Sungguh kamu telah berdusta terhadap Allah!” Dan kebanyakan mereka tidak mengetahui kedudukan Rasulullah. Maka Allah membantah mereka: “Hai Rasulallah, katakanlah kepada mereka, al-Qur'an adalah Firman Allah yang diturunkan melalui Malaikat Jibril dengan kebenaran yang teguh, al-Qur'an tidak tercampur dengan kebatilan dan ia merupakan peneguh orang-orang beriman di atas agama Islam, hidayah bagi hati agar tidak tersesat, dan penyampai kabar gembira berupa surga bagi orang-orang yang tunduk dan patuh kepada Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "101. وَإِذَا بَدَّلْنَآ ءَايَةً مَّكَانَ ءَايَةٍ ۙ (Dan apabila Kami letakkan suatu ayat di tempat ayat yang lain sebagai penggantinya) Yakni menasakhnya (mengganti/menghapusnya) dengan ayat yang lain. Penjelasan tentang nasakh telah disebutkan dalam surat al-Baqarah: 106. قَالُوٓا۟ (mereka berkata) Yakni orang-orang kafir Quraisy yang tidak memahami hikmah adanya nasakh mengatakan. إِنَّمَآ أَنتَ (Sesungguhnya kamu) Yakni kamu hai Muhammad. مُفْتَرٍۭ (orang yang mengada-ada) Yakni seorang pendusta yang mengada-ada atas nama Allah padahal Dia tidak mengatakannya, dengan mengaku bahwa Allah memerintahkanmu dengan sesuatu, kemudian kamu mengatakan bahwa Allah memerintahkanmu dengan sesuatu yang menyelisihi perintah yang sebelumnya. بَلْ أَكْثَرُهُمْ لَا يَعْلَمُونَ (Bahkan kebanyakan mereka tiada mengetahui) Yakni tidak mengetahui hikmah dari adanya nasakh; yaitu bisa jadi dalam disyariatkannya sesuatu itu terdapat kemaslahatan, namun seiring berjalannya waktu kemaslahatan itu menjadi lebih besar dengan disyariatkannya hal yang lain."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "101. Dan jika Kami menjadikan suatu ayat menempati tempat ayat lain yang serupa, sebagaimana mengganti ayat taurat yang ditemui di Baitul Maqdis dengan ayat yang ditemui di Ka’bah, maka itu berdasarkan hikmah Tuhan dan kemashlahataan dalam hal agama dan dunia. Dan Allah itu Maha mengetahui tentang ayat-ayat yang diturunkanNya. Orang-orang musyrik berkata kepada Nabi SAW: “Sesungguhnya kamu adalah pendusta. Kamu membuat rekayasa ayat itu, sedangkan Allah tidak memfirmankanya.” Namun kebanyakan mereka tidak mengetahui tentang hikmah dari penggantian itu. Ayat ini turun ketika orang-orang musyrik berkata: “Sesungguhnya Muhammad telah menyihir sahabat-sahabatnya. Hari ini dia memerintah mereka untuk melakukan suatu perkara, lalu dia melarang mereka melakukan hal itu besok. Atau dia mendatangkan sesuatu yang lebih mudah bagi mereka. Hal itu tidak lain kecuali rekayasa. Dia mengeluarkan ucapan itu dari dirinya sendiri” Kemudian Allah SWT menurunkan ayat ini dan ayat setelahnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apabila Kami ganti suatu ayat di tempat ayat yang lain} Kami menasakh ayat dan menjadikannya di tempat ayat lainnya {padahal Allah lebih mengetahui apa yang diturunkanNya, mereka berkata,“Sesungguhnya kamu adalah pembuat kebohongan”} pembohong membuat-buat sesuatu tentang Allah {Bahkan kebanyakan mereka tidak mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "101. Allah memperingatkan bahwa kaum yang mendustakan al-Quran ini, mencari-cari ayat yang bisa mereka pakai untuk pembelaan diri, yaitu bahwa Allah adalah Dzat Yang Maha Menetapkan lagi Bijaksana, mensyariatkan hukum-hukum dan mengganti hukum di tempat lainnya karena (dorongan) sifat bijaksana dan rahmatNya. Bila mereka menyaksikan pergantian ini, maka mereka mencela kehormatan Rasulullah dan risalah yang beliau bawa. “Mereka berkata, ‘Sesungguhnya kamu adalah orang yang mengada-adakan saja’ ,” maka Allah membantah mereka dengan berfirman, “Bahkan kebanyakan mereka tiada mengetahui,” mereka itu bodoh (tentang masalah ini), tidak mempunyai ilmu tentang Rabb mereka dan syariatNya. Sudah diketahui (bersama), bahwasanya tuduhan yang dilancarkan orang bodoh, tanpa dasar ilmu, adalah tidak perlu diperhitungkan. Sesungguhnya komentar (miring) tentang sesuatu merupakan bagian dari pengetahuannya tentang masalah tersebut dan merupakan isi kandungannya yang menghasilkan keluarnya pujian atau cemoohan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (وَإِذَا بَدَّلۡنَآ ءَايَةٗ مَّكَانَ ءَايَةٖ) wa idzaa baddalnaa aayatam makaana aayah : dengan menghapusnya atau menurunkan ayat yang lain karena kepentingan umat. Makna ayat: Firman-Nya “Dan apabila Kami mengganti suatu ayat dengan ayat yang lain” Kami mengganti suatu hukum yang hukum lain atau ayat dengan ayat yang lain, kaum musyrikin yang mendustakan wahyu ilahi berkata “Sesungguhnya engkau” wahai Muhammad “hanya mengada-ngada saja.” Engkau berkata dusta dan bohong, hari ini berkata sesuatu esok berkata sebaliknya. Firman-Nya “Dan Allah lebih mengetahui apa yang diturunkan-Nya” karena Allah menurunkannya karena maslahat para hamba-Nya, Allah menghapus dan menetapkan karena kemaslahatan kaum mukminin. Pelajaran dari ayat: • Penjelasan bahwa adanya nasikh (penetapan) dan mansukh (penghapusan) dalam Al-Qur’an."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 101: Syaikh As Sa’diy berkata, “Allah Subhaanahu wa Ta'aala menerangkan, bahwa orang-orang yang mendustakan Al Qur’an berusaha mencari sesuatu yang bisa menjadi hujjah bagi mereka, padahal Allah Subhaanahu wa Ta'aala adalah hakim yang Mahabijaksana yang menetapkan hukum-hukum dan mengganti hukum yang satu dengan hukum yang lain karena hikmah dan rahmat-Nya. Ketika mereka melihat seperti itu, mereka pun mencela Rasulullah shallallahu 'alaihi wa sallam dan mencela apa yang Beliau bawa.” Dengan menasakh(hapus)nya, dan menurunkan ayat yang lain untuk maslahat hamba. Yakni tidak mengetahui tentang Tuhan mereka yang Mahabijaksana dan syari’at-Nya serta faedah naskh."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 101",
    "description": "Usai meminta pembaca Al-Qur'an untuk memohon perlindungan Allah dari setan, melalui ayat ini Allah lalu meyakinkan kepada nabi Muhammad dan umatnya dengan menjelaskan bahwa penggantian suatu ayat dengan ayat yang lain adalah inisiatif dari Allah, bukan dari nabi Muhammad. Allah menyatakan, dan apabila kami, Allah, mengganti suatu ayat Al-Qur'an dengan ayat yang lain, dan Allah yang maha mengetahui lebih mengetahui apa yang diturunkan-Nya, antara lain terkait kapan dan di mana ayat itu diturunkan, ayat yang diganti dan yang menggantikannya, serta maslahat apa yang terkandung dalam penggantian ayat tersebut. Allah menyatakan hal ini karena mereka, yakni orang-orang kafir, berkata, 'sesungguhnya engkau, wahai Muhammad, pembohong dan hanya mengada-ada saja. Engkau mengaku penggantian ayat bersumber dari Allah, padahal itu dari kemauanmu sendiri. Ketahuilah, wahai nabi Muhammad, bahwa sebenarnya kebanyakan mereka yang kafir dan musyrik tidak mengetahui apa yang mereka ucapkan. Katakanlah kepada mereka, wahai nabi Muhammad, aku tidak mengada-ada, bukan pula pembohong seperti tuduhan kamu. Penggantian itu merupakan kehendak Allah. Katakanlah pula, rohulkudus, yakni jibril, menurunkan Al-Qur'an itu secara berangsur kepadaku, dari tuhanmu, bukan dari jibril sendiri dan bukan pula dari manusia. Dia menurunkan Al-Qur'an dengan benar, membawa dan berisi kebenaran, serta dengan tujuan yang benar, untuk meneguhkan hati orang yang telah beriman, dan menjadi petunjuk yang jelas menuju jalan kebenaran serta memberi kabar gembira tentang kebahagiaan di akhirat bagi orang yang berserah diri dengan ikhlas kepada Allah."
  }
]