[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah kepada mereka (wahai rasul), ”al-qur;an bukanlah sesuatu yang diada-adakan dari diriku. Akan tetapi, jibril turun membawanya dari tuhanmu dengan benar dan adil, demi meneguhkan kaum mukminin dan petunjuk dari kesesatan, serta kabar gembira yang baik bagi orang-orang yang berserah diri dan tunduk kepada Allah, rabbul ‘alamin."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "102. Katakanlah kepada mereka wahai Rasul, “Yang menurunkan Al-Qur`ān ini adalah Jibril -'alaihissalām- dari sisi Allah -Subḥānahu- dengan kebenaran yang tidak ada kesalahan, pergantian maupun penyelewengan padanya, untuk meneguhkan orang-orang yang beriman kepada Allah atas iman mereka setiap ada bagian dari Al-Qur`ān turun dan sebagian darinya dinasakh (hapus), agar ia menjadi hidayah bagi mereka kepada kebenaran dan kabar gembira bagi kaum Muslimin karena apa yang mereka dapatkan darinya yaitu pahala yang mulia.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "102. قُلْ نَزَّلَهُۥ (Katakanlah: Al Quran itu diturunkan) Yakni al-Qur’an. رُوحُ الْقُدُسِ(Ruhul Qudus (Jibril)) Yakni malaikat Jibril yang disucikan dari kotoran-kotoran sifat manusia. مِن رَّبِّكَ (dari Tuhanmu) Yakni diturunkan dari Allah. بِالْحَقِّ (dengan benar) Yang tidak ada kesalahan di dalamnya, dan diturunkan dengan hikmah yang dalam. لِيُثَبِّتَ الَّذِينَ ءَامَنُوا۟( untuk meneguhkan (hati) orang-orang yang telah beriman) Di atas keimanannya. وَهُدًى وَبُشْرَىٰ لِلْمُسْلِمِينَ (dan menjadi petunjuk serta kabar gembira bagi orang-orang yang berserah diri) Al-Qur’an memberi petunjuk kepada mereka tentang hukum-hukum nasikh (hukum baru yang menghapus hukum lama) dan memberi mereka kabar gembira atas keimanan mereka terhadap nasikh dan Mansukh dan lainnya yang terkandung dalam al-Qur’an."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "102. Katakanlah wahai Nabi: “Jibril AS yang suci dari dosa membawa turun Al-Qur’an dari sisi Allah, yang pasti memiliki kebenaran dan tidak ada kesalahan di dalamnya, sesuai hikmah yang ditetapkan kepadanya untuk meneguhkan keimanan orang-orang mukmin, sebagai petunjuk bagi manusia dari kesesatan dan kabar gembira bagi orang-orang muslim tentang surga dan keridhaan tuhan.” Al-Qudsu adalah kesucian dan yang dimaksud di sini adalah suci"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Ruhul kudus} Jibril AS {menurunkannya} menurunkan Al-Qur’an {dari Tuhanmu dengan hak untuk meneguhkan orang-orang yang telah beriman dan menjadi petunjuk serta kabar gembira bagi orang-orang muslim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "102. Oleh karena itu, Allah menyebutkan (sifat) hikmahNya dalam perkara ini. Allah berfirman, “Katakanlah, ‘Ruhul Qudus menurunkan al-Quran itu’ ,” yaitu Jibril, utusan yang suci lagi bebas dari sifat cacat, penghianatan dan kekurangan yang lain, “dengan benar,” maksudnya turunnya dengan kebenaran, berisi kebenaran dalam berita-beritanya, perintah-perintahnya dan larangan-larangannya. Tidak ada cara bagi siapa pun untuk melancarkan kritikan (miring) kepadanya dengan alasan yang akurat. Pasalnya, bila telah diketahui bahwa al-Quran adalah kebenaran, maka diketahui pula bahwa yang melawan dan menentangnya berarti batil. “untuk meneguhkan (hati) orang-orang yang telah beriman,” ketika ayat turun dan datang kepada mereka, dari waktu ke waktu. Kebenaran senantiasa mengalir ke kalbu-kalbu mereka sedikit demi sedikit, sampai keimanan mereka lebih kokoh daripada gunung yang terpancang kokoh. Begitu pula, mereka mengetahui bahwa al-Quran adalah sebuah kebenaran, jika Allah mensyariatkan sebuah hukum kemudian menghapusnya (diganti dengan hukum yang lain) niscaya mereka mengetahui bahwa Allah menggantinya dengan yang semisalnya atau yang lebih baik darinya bagi mereka, dan mereka meyakini bahwasanya penggantian hukum tersebut itulah yang sejalan dengan hikmah ilahi dan korelasi yang rasional “dan menjadi petunjuk serta kabar gembira bagi orang-orang yang berserah diri (kepada Allah),” maksudnya, petunjuk yang menuntun mereka kepada inti-inti permasalahan, menjellaskan bagi mereka kebenaran dari kebatilan, hidayah dari kesesatan, memberi kabar gembira kepada mereka bahwa mereka mendapatkan pahala yang baik, menetap di sana selama-lamanya. Begitu pula, setiap sesuatu turun sedikit demi sedikit, maka itu menjadi lebih besar pengaruh hidayah dan kabar gembiranya bagi mereka, daripada datang kepada mereka sekali saja secara sekaligus. Pikiran pun tercerai berai menghadapinya. Akan tetapi, (cara yang ditempuh), Allah menurunkan satu hukum atau kadang-kadang lebih. Bila mereka telah memahami dan mencernanya serta mengetahui maksud kandungan dari hukum tersebut dan telah menguasainya, maka Allah menurunkan hukum yang semisalnya… demikian seterusnya. Karena itu, para sahabat telah mencapai tingkatan tinggi dalam menguasainya. Perilaku dan tabiat mereka berubah baik, beralih ke akhlak dan kebiasaan serta tindak-tanduk yang sanggup mengalahkan generasi pertama manusia dan generasi terakhir dengannya. Maka, idealnya dan sepatutnya generasi setelah mereka terdidik dengan ilmu-ilmu al-Quran, dan menghiasi diri dengan akhlaknya, mencari bimbingan malalui cahayanya di dalam kegelapan kesesatan dan kebodohan-kebodohan, mendaulatnya sebagai panutan mereka dalam seluruh kondisi. Dengan itu, urusan-urusan agama dan duniawi mereka akan lurus."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (قُلۡ نَزَّلَهُۥ رُوحُ ٱلۡقُدُسِ) qul nazzalahuu ruuhul qudus : yaitu Jibril ‘alaihis salam. (لِيُثَبِّتَ ٱلَّذِينَ ءَامَنُواْ) liyutsabbital ladziina aamanuu : untuk meneguhkan orang yang beriman di atas iman mereka. Makna ayat: Allah ta’ala mengajarkan rasul-Nya bagaimana menjawab kerancuan ini, firman-Nya “Katakanlah, “Ruhul Qudus (Jibril) menurunkan Al-Qur’an itu dari Rabb mu dengan kebenaran” engkau tidak mengatakan sesuatu kehendakmu, namun itu berdasarkan wahyu Allah dan firman-Nya yang turun dengan perantara Jibril ‘alaihissalam dari sisi Rabb mu dengan kebenaran yang tetap tidak akan berubah. Yang demikian berfungsi untuk menguatkan orang-orang yang beriman untuk tegar di atas keimanan dan keislaman mereka. maka setiap kali ayat turun, bertambahlah iman kaum mukminin, ia bagaikan hujan yang turun ke bumi, setiap kali hujan turun, bumi akan semakin subur, hijau, dan indah. Begitu pula turunnya Al-Qur’an menghidupkan hati orang-orang yang beriman, karena Al-Qur’an adalah petunjuk dari segala kesesatan dan kabar gembira bagi setiap muslim dengan kebahagiaan dunia dan kemenangan di akhirat. Pelajaran dari ayat: • Penjelasan faidah turunnya Al-Qur’an dengan nasikh dan mansukh, yaitu untuk menguatkan orang-orang beriman di atas iman mereka. serta petunjuk dari kesesatan dan kabar gembira untuk kaum muslimin dengan kebahagiaan di dunia dan akhirat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 102: Jibril disebut rohulkudus, karena Dia bersih dari aib, khianat, dan penyakit. Yakni turunnya benar-benar dari sisi Allah, di dalamnya mengandung kebenaran, baik pada beritanya, perintah maupun larangannya. Jika telah diketahui, bahwa Al Qur’an adalah kebenaran, maka berarti sesuatu yang bertentangan atau berlawanan dengannya adalah batil. Oleh karena kebenaran senantiasa sampai ke dalam hati mereka sedikit demi sedikit, maka iman mereka akan semakin kokoh bagai gunung kokoh yang menancap. Di samping itu, dengan turunnya ayat sedikit-demi sedikit, maka lebih siap diterima oleh jiwa daripada turun secara sekaligus yang seakan-akan mereka menerima banyak beban. Oleh karena itulah, dengan Al Qur’an keadaan para sahabat berubah; akhlak, tabi’at, kebiasaan dan amal mereka berubah sampai mengalahkan orang-orang terdahulu dan yang akan datang kemudian. Maka dari itu, sepatutnya generasi yang datang setelah para sahabat terdidik di atas ilmu-ilmu yang ada dalam Al Qur;an, berakhlak dengan akhlaknya, menggunakannya sebagai penerang dalam gelapnya kesesatan dan kebodohan, ehingga dengannya urusan agama dan dunia mereka menjadi baik. Yang menunjukkan kepada mereka hakikat segala sesuatu, menerangkan mana yang benar dan mana yang batil, mana petunjuk dan mana kesesatan. Yang memberikan kabar gembira kepada mereka, bahwa mereka akan memperoleh kebaikan, yaitu surga dan mereka akan kekal di sana selama-lamanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 102",
    "description": "Katakanlah kepada mereka, wahai nabi Muhammad, aku tidak mengada-ada, bukan pula pembohong seperti tuduhan kamu. Penggantian itu merupakan kehendak Allah. Katakanlah pula, rohulkudus, yakni jibril, menurunkan Al-Qur'an itu secara berangsur kepadaku, dari tuhanmu, bukan dari jibril sendiri dan bukan pula dari manusia. Dia menurunkan Al-Qur'an dengan benar, membawa dan berisi kebenaran, serta dengan tujuan yang benar, untuk meneguhkan hati orang yang telah beriman, dan menjadi petunjuk yang jelas menuju jalan kebenaran serta memberi kabar gembira tentang kebahagiaan di akhirat bagi orang yang berserah diri dengan ikhlas kepada Allah. Dan sesungguhnya kami mengetahui bahwa mereka yang tidak mempercayai datangnya Al-Qur'an dari Allah berkata, sesungguhnya alqur'an itu bukanlah kitab dari Allah yang dibawa turun oleh jibril sebagaimana pengakuan Muhammad, melainkan hanya diajarkan oleh seorang manusia, yakni pria dari romawi atau persia, kepadanya, yakni Muhammad. Tuduhan mereka batil karena bahasa yang digunakan oleh orang yang mereka tuduhkan kepadanya adalah bahasa 'ajam, bukan bahasa arab, padahal Al-Qur'an ini adalah dalam bahasa arab yang jelas dan memiliki keindahan susunan dan makna yang tidak mampu ditandingi bahkan oleh sastrawan hebat sekalipun."
  }
]