[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya Kami mengetahui bahwa kaum musyrikin mengatakan ”sesungguhnya nabi memperoleh al-qur’an dari seseorang yang berasal dari anak keturunan adam.” mereka dusta (dalam pernyataannya itu). Sebab sesungguhnya bahasa orang yang mereka kaitkan Nabi belajar kepadanya adalah bahasa ‘ajam (selain bahasa arab) yang tidak fasih, sedangkan al-qur’an berbahasa arab yang berada dalam puncak kefasihan dan kejelasan"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "103. Dan Kami mengetahui bahwa orang-orang musyrikin berkata, Muhammad -ṣallallāhu 'alaihi wa sallam- diajari Al-Qur`ān oleh seseorang. Mereka berdusta dalam tuduhan mereka, karena bahasa orang yang mereka tuduhkan mengajari Muhammad Al-Qur`ān adalah bahasa Asing, sedangkan Al-Qur`ān ini turun dengan bahasa Arab yang jelas dengan tingkat balagah yang tinggi, bagaimana mereka bisa menuduh bahwa orang asing mengajari Muhammad Al-Qur`ān?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "103. Allah bersumpah: “Sungguh orang-orang musyrik banyak menyebarkan kedustaan bahwa Rasulullah mendapatkan al-Qur'an dari seorang manusia yang memiliki pengetahuan tentang kitab-kitab Samawi terdahulu.” Maka Allah membantah mereka bahwa bahasa orang yang telah mengajari Rasulullah al-Qur'an adalah bahasa selain bahasa Arab, sedangkan al-Qur'an menggunakan bahasa Arab yang sangat fasih."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "103. وَلَقَدْ نَعْلَمُ أَنَّهُمْ يَقُولُونَ إِنَّمَا يُعَلِّمُهُۥ بَشَرٌ ۗ (Dan sesungguhnya Kami mengetahui bahwa mereka berkata: “Sesungguhnya Al Quran itu diajarkan oleh seorang manusia kepadanya (Muhammad)”) Yakni Kami sungguh mengetahui bahwa orang-orang kafir itu berkata “sebenarnya orang yang mengajarkan Muhammad al-Qur’an adalah seorang manusia dan bukan malaikat”. Orang tersebut menurut pengakuan mereka adalah budak milik Fakih bin Mughirah yang bernama Jabar, dulunya ia beragama Nasrani kemudian masuk Islam. لِّسَانُ الَّذِى يُلْحِدُونَ إِلَيْهِ أَعْجَمِىٌّ(Padahal bahasa orang yang mereka tuduhkan (bahwa) Muhammad belajar kepadanya bahasa ‘Ajam) Yakni bahasa orang yang mereka anggap sebagai orang yang menajarkanmu al-Qur’an adalah bahasa ‘ajam yang tidak memiliki kefasihan. وَهٰذَا(sedang ini (Al Quran)) Yakni al-Qur’an. لِسَانٌ عَرَبِىٌّ مُّبِينٌ(dalam bahasa Arab yang terang) Yakni memiliki kefasihan tinggi dan penjelasan yang jelas. kalian mengatakan bahwa orang yang mengajarkannya al-Qur’an itu berasal dari kaum ‘ajam, sedangkan kalian sendiri tidak mampu menandingi salah satu surat dalam al-Qur’an, padahal kalian adalah ahli kefasihan dan raja dalam ilmu balaghah; bagaimana kalian bisa mengatakan tuduhan ini?"
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Ada i'tikad buruk dari orang-orang kafir untuk menjatuhkan kehormatan al-Qur'an dari diri mukminin, perhatikan firman Allah : { وَلَقَدْ نَعْلَمُ أَنَّهُمْ يَقُولُونَ إِنَّمَا يُعَلِّمُهُ بَشَرٌ } \"Dan sesungguhnya Kami mengetahui bahwa mereka berkata: \"Sesungguhnya Al Quran itu diajarkan oleh seorang manusia kepadanya (Muhammad)\""
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "103. Dan Kami sangat tahu bahwa orang-orang musyrik itu berkata: “Sesungguhnya yang mengajari Muhammad Al-Qur’an adalah manusia dari anak cucu Adam, dia adalah anak laki-laki Al-Faqih Ibnul Mugirah yang bernama Jabar yang merupakan orang Nasrani Roma dari daerah Sisilia. Dia membuat pedang kemudian masuk Islam. Lalu Allah membalas mereka: ”Bahasa orang-orang yang dituduh dan dihubung-hubungkan atau diindikasikan sebagai yang mengajari Nabi itu adalah bahasa asing, sedangkan Al-Qur’an ini menggunakan bahasa Arab yang mengandung penjelasan dan fashahah, lalu bagaimana bisa kalian menglaim bahwa orang Arab diajari oleh orang asing yang bukan orang Arab?!”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh Kami mengetahui bahwa mereka berkata,“Sesungguhnya yang mengajarnya itu} yang mengajarkan Al-Qur’an kepada Muhammad {seorang manusia} manusia {padahal Bahasa} bahasa {orang yang mereka tuduh} mereka menuduh bahwa dia mengajari nabi Muhammad {adalah bahasa ajam. Padahal ini} Al-Qur’an {adalah bahasa Arab yang jelas"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "103. Allah mengabarkan mengenai komentar kaum musyrikin yang mendustakan RasulNya, “Bahwa mereka berkata, ‘Sesungguhnya al-Quran itu diajarkan kepadanya (Muhammad)’ ,” maksudnya kitab yang ia bawa ini (diajarkan oleh) “seorang manusia,” padahal orang yang mereka maksud adalah berbahasa Ajam. “Sedang ini,” yaitu al-Quran “adalah dalam Bahasa Arab yang terang,” apakah ucapan semacam ini mungkin terjadi atau masih mengandung sisi kebenaran? Akan tetapi, seorang pendusta hanya ingin berbohong, tanpa berpikir tentang muara omongan dustanya. Karena itu, dalam ungkapannya terkandung unsur saling bertolak belakang dan kerusakan yang mengharuskan penolakannya, dengan hanya mengimajinasikan faktanya (yang tidak mungkin terjadi)."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (بَشَرٞۗ) basyar : yang dimaksud manusia di sini adalah seorang pandai besi Nasrani di kota Mekah. (لِّسَانُ ٱلَّذِي يُلۡحِدُونَ إِلَيۡهِ) lisaanul ladzii yulhiduuna ilaih : bahasa yang mereka tuduhkan kepadanya (Muhammad). (وَهَٰذَا لِسَانٌ عَرَبِيّٞ مُّبِينٌ) wa haadzaa lisaanun ‘arabiyy : yaitu Al-Qur’an, bagaimana seorang non-Arab mengajarkannya? Makna ayat: Konteks ayat ini masih mengenai bantahan untuk kaum musyrikin yang menuduh Rasulullah shallallahu ‘alaihi wa sallam berbuat dusta, maka Allah ta’ala berfirman “Dan sesungguhnya Kami mengetahui bahwa mereka berkata, “Sesungguhnya Al-Qur’an itu hanya diajarkan oleh seorang manusia kepadanya” yang mengajari Muhammad adalah manusia, dari golongan manusia, bukan wahyu yang didapatkan dari Allah. Allah berfirman membantah kedustaan mereka “bahasa yang mereka tuduhkan kepadanya” yang mereka sangka-sangka bahwa dia yang mengajarkan Muhammad, bahasanya adalah “’Ajam” bahasa asing, karena ia adalah seorang budak berkebangsaan Romawi “padahal ini” yaitu Al-Qur’an “dalam bahasa arab yang jelas.” Yang memiliki kefasihan, sastra, dan gaya bahasa yang tinggi, bagaimana mungkin ada kesamaan antara ini dengan yang mereka katakan? Pelajaran dari ayat: • Pembelaan Allah ta’ala kepada Rasul-Nya dan menutup segala celah tuduhan kepada Rasulullah shallallahu ‘alaihi wa sallam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 103: Ibnu Jarir berkata: Telah menceritakan kepadaku Al Mutsanna, ia berkata, “Telah menceritakan kepada kami ‘Amr bin ‘Aun.” Ia berkata, “Telah mengabarkan kepada kami Hasyiim dari Hushain, yaitu Ibnu Abdirrahman dari Abdullah bin Muslim Al Hadhramiy, bahwa mereka (sebagian Bani Hadhrami) memiliki dua orang budak dari penduduk selain Yaman. Keduanya masih kecil, yang satu bernama Yasar, sedangkan yang satu lagi bernama Jabr. Keduanya suka membaca Taurat. Rasulullah shallallahu 'alaihi wa sallam terkadang duduk dengan keduanya, lalu orang-orang kafir Quraisy berkata, “Beliau duduk dengan keduanya adalah untuk belajar dari kedua anak itu.” Maka Allah Subhaanahu wa Ta'aala menurunkan firman-Nya, “Padahal bahasa orang yang mereka tuduhkan (bahwa Muhammad belajar) kepadanya bahasa 'Ajam, sedangkan Al Quran adalah dalam bahasa Arab yang jelas.” Syaikh Muqbil berkata, “Hadits ini para perawinya adalah para perawi hadits shahih selain Al Mutsanna, yaitu Ibnu Ibrahim Al Amiliy. Saya tidak menemukan orang yang menyebutkan biografinya. Akan tetapi, ia dimutaba’ahkan oleh Sufyan bin Waki’, dan di sana terdapat pembicaraan. Adapun Hasyim, dia adalah Ibnu Basyir seorang mudallis dan tidak menyebutkan secara tegas kata “haddatsanaa (telah menceritakan kepada kami)”, akan tetapi ia dimutaba’ahkan oleh Khalid bin Abdullah Ath Thahhan dan Muhammad bin Fudhail. Dari sinilah, Al Haafizh dalam Al Ishaabah setelah menyebutkan hadits ini berkata, “Demikian pula hadits setelahnya dengan sanad hadits ini, dan sanadnya shahih.” (Juz 2 hal. 439). Tentang nama sahabat yang meriwayatkan hadits ini diperselisihkan, menurut Ibnu Jarir adalah Abdullah bin Muslim, menurut Ibnu Abi Hatim dalam Al Jarh wat Ta’dil adalah Ubaidullah bin Muslim, dalam At Tahdzib seperti dalam Al Jarh wat Ta’dil, di sana disebutkan, “Dan disebut pula Abdullah.” Al Hafizh telah mengisyaratkan tentang adanya perselisihan ini dalam Al Ishabah juz 2 hal. 439. Syaikh Muqbil juga berkata, “Hadits ini memiliki syahid (penguat dari jalan lain) dari hadits Ibnu Abbas radhiyallahu 'anhuma, Hakim rahimahullah berkata (dalam Al Mustadrak) juz 2 hal. 357: Telah menceritakan kepada kami Abdurrahman bin Al Hasan bin Ahmad Al Asadiy di Hamdan. Telah menceritakan kepada kami Ibrahim bin Husain. Telah menceritakan kepada kami Adam bin Abi Iyas. Telah menceritakan kepada kami Warqa’ dari Ibnu Abi Najiih dari Mujahid dari Ibnu Abbas radhiyallahu 'anhuma tentang firman Allah ‘Azza wa Jalla, “Sesungguhnya Al Quran itu hanya diajarkan oleh seorang manusia kepadanya (Muhammad).\" Padahal bahasa orang yang mereka tuduhkan (bahwa Muhammad belajar) kepadanya bahasa 'Ajam, sedangkan Al Quran adalah dalam bahasa Arab yang jelas.” Mereka (orang-orang musyrik) berkata, “Sesungguhnya yang mengajarkan Muhammad adalah budak Ibnul Hadhrami; seorang yang suka membaca kitab-kitab.” Maka Allah Subhaanahu wa Ta'aala berfirman, “Dan sesungguhnya Kami mengetahui bahwa mereka berkata, \"Sesungguhnya Al Quran itu hanya diajarkan…dst.\" Hadits ini shahih isnadnya, namun keduanya (Bukhari-Muslim) tidak menyebutkannya. Lihat Ash Shahihul Musnad Min Asbaabin Nuzuul karya Syaikh Muqbil Bahasa 'Ajam adalah bahasa selain bahasa Arab dan dapat juga berarti bahasa Arab yang tidak baik. Hal itu, karena orang yang dituduh mengajarkan kepada Nabi Muhammad shallallahu 'alaihi wa sallam itu bukan orang Arab dan hanya tahu sedikit tentang bahasa Arab. Oleh karena itu, bagaimana mungkin Beliau diajarkan oleh orang ‘ajam (luar Arab)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 103",
    "description": "Dan sesungguhnya kami mengetahui bahwa mereka yang tidak mempercayai datangnya Al-Qur'an dari Allah berkata, sesungguhnya alqur'an itu bukanlah kitab dari Allah yang dibawa turun oleh jibril sebagaimana pengakuan Muhammad, melainkan hanya diajarkan oleh seorang manusia, yakni pria dari romawi atau persia, kepadanya, yakni Muhammad. Tuduhan mereka batil karena bahasa yang digunakan oleh orang yang mereka tuduhkan kepadanya adalah bahasa 'ajam, bukan bahasa arab, padahal Al-Qur'an ini adalah dalam bahasa arab yang jelas dan memiliki keindahan susunan dan makna yang tidak mampu ditandingi bahkan oleh sastrawan hebat sekalipun. Usai menceritakan keingkaran kaum kafir atas ayat-ayat yang rasulullah sampaikan, Allah lalu menyebut azab bagi mereka, sesungguhnya orang yang tidak beriman kepada ayat-ayat Allah, yaitu Al-Qur'an dan tanda-tanda kebesaran-Nya di alam semesta, Allah tidak akan memberi petunjuk kepada mereka menuju keimanan dan mengamalkan tuntunan-Nya, padahal dia telah menganugerahi mereka potensi iman dan menjelaskan kepada mereka ayat-ayat itu melalui rasul-Nya. Dan akibat keingkaran mereka itu mereka akan mendapat azab yang pedih jika tidak bertobat."
  }
]