[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang kafir yang tidak mengimani al-qur’an, Allah tidak memberikan taufik kepada mereka untuk mencapai kebenaran, dan bagi mereka di akhirat siksaan menyakitkan lagi pedih."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "104. Sesungguhnya orang-orang yang tidak membenarkan ayat-ayat Allah bahwa ia turun dari sisi-Nya maka Allah tidak membimbing mereka kepada petunjuk selama mereka bersikukuh di atas kesesatan. Bagi mereka azab yang menyakitkan karena kekufuran mereka kepada Allah dan pendustaan mereka kepada ayat-ayat-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "104-105. Sungguh orang-orang yang tidak beriman kepada al-Qur'an tidak akan Allah beri petunjuk menuju kebenaran, dan di akhirat mereka akan mendapat azab yang pedih. Orang-orang yang tidak beriman kepada ayat-ayat quraniyah dan kauniyah itu sengaja membuat kedustaan. Orang-orang yang jauh dari kebenaran itu merupakan para pendusta."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "104. إِنَّ الَّذِينَ لَا يُؤْمِنُونَ بِـَٔايٰتِ اللهِ (Sesungguhnya orang-orang yang tidak beriman kepada ayat-ayat Allah) Yakni yang tidak membenarkannya. لَا يَهْدِيهِمُ اللهُ(Allah tidak akan memberi petunjuk kepada mereka) Menuju kebenaran yang merupakan jalan keselamatan dari kesengsaraan mereka. وَلَهُمْ عَذَابٌ أَلِيمٌ(dan bagi mereka azab yang pedih) Akibat dari kekafiran dan pendustaan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "104. Sesungguhnya orang-orang yang tidak mengimani ayat-ayat Al-Qur’an, maka Allah tidak akan menolong mereka untuk beriman. Dan bagi mereka itu azab yang pedih di akhirat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang yang tidak beriman kepada ayat-ayat Allah itu tidak akan diberi petunjuk} tidak dibimbing {Allah dan bagi mereka ada azab yang sangat pedih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "104. “Sesungguhnya orang-orang yang tidak beriman kepada ayat-ayat Allah (al-Quran),” yang menunjukkan dengan tegas kepada kebenaran yang nyata, maka mereka justru menolak dan tidak (sudi) menerimanya. “Allah tidak akan memberi petunjuk kepada mereka,” lantaran hidayah telah datang kepada mereka, namun mereka menolak. Akibatnya, mereka didera hukuman, berupa tehalangi (dari rahmat) dan dibiarkan oleh Allah tanpa bimbingan. “Dan mereka mendapatkan,” di akhirat “azab yang pedih.”"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat: Mereka hanyalah berdusta, tidak lebih. Firman-Nya ta’ala “Sesungguhnya orang yang tidak beriman kepada ayat-ayat Allah (Al-Qur’an) ia adalah cahaya, petunjuk, dan argumentasi yang kuat, serta bukti yang jelas “Allah tidak akan memberikan petunjuk kepada mereka” untuk mengetahui kebenaran dan jalan kebenaran, karena mereka berpaling dari jalur hidayah dan menghalangi dari jalan petunjuk. Firman-Nya ta’ala “Dan bagi mereka azab yang pedih.” Yaitu balasan atas kekufuran mereka kepada ayat-ayat Allah. Pelajaran dari ayat: • Orang-orang yang mendustakan ayat-ayat Allah tidak akan mendapatkan hidayah. Karena jalan menuju hidayah adalah iman kepada Al-Qur’an, ketika mereka mengingkarinya, dengan apa mereka bisa mendapatkan hidayah? • Orang-orang yang beriman tidak akan berbohong dikarenakan iman mereka terhadap pahala kejujuran dan hukuman kebohongan. Namun, orang kafir adalah orang-orang yang berdusta karena tidak ada yang menghalangi mereka untuk berbohong, karena mereka tidak mengharapkan pahala dan tidak takut akan hukuman."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 104: Yang menunjukkan kebenaran secara tegas, lalu mereka menolaknya dan tidak mau menerimanya. Ketika datang hidayah irsyad (bimbingan) karena mereka menolaknya, sehingga diberi hukuman dengan terhalang mendapatkan hidayah dan dibiarkan oleh Allah Subhaanahu wa Ta'aala."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 104",
    "description": "Usai menceritakan keingkaran kaum kafir atas ayat-ayat yang rasulullah sampaikan, Allah lalu menyebut azab bagi mereka, sesungguhnya orang yang tidak beriman kepada ayat-ayat Allah, yaitu Al-Qur'an dan tanda-tanda kebesaran-Nya di alam semesta, Allah tidak akan memberi petunjuk kepada mereka menuju keimanan dan mengamalkan tuntunan-Nya, padahal dia telah menganugerahi mereka potensi iman dan menjelaskan kepada mereka ayat-ayat itu melalui rasul-Nya. Dan akibat keingkaran mereka itu mereka akan mendapat azab yang pedih jika tidak bertobat. Selain menuduh nabi Muhammad sebagai pembohong, orang kafir juga meyakini ayat-ayat yang beliau sampaikan adalah hasil karyanya sendiri, bukan dari Allah. Menepis tuduhan itu Allah menegaskan sesungguhnya yang mengada-adakan kebohongan hanyalah orang-orang yang tidak mau beriman kepada ayat-ayat Allah, baik yang termaktub dalam Al-Qur'an maupun terbentang di alam semesta, dan mereka itulah pembohong sejati, bukan nabi Muhammad."
  }
]