[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya yang mengada-adakan kedustaan hanyalah orang-orang yang tidak beriman kepada Allah dan ayat-ayatNya. Dan mereka itu adalah orang-orang yang berdusta dalam pernyataan mereka itu. Sedangkan Muhammad yang beriman kepada tuhannya lagi tunduk kepadaNya, maka mustahil baginya untuk berdusta atas nama Allah dan mengucapkan apa yang tidak difirmankanNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "105. Muhammad -ṣallallāhu 'alaihi wa sallam- bukan pendusta dalam risalah yang dia bawa dari sisi Tuhannya. Yang membuat kebohongan hanyalah orang-orang yang tidak membenarkan ayat-ayat Allah, karena mereka tidak takut kepada azab Allah dan tidak berharap akan pahala-Nya, mereka yang disifati dengan kekufuran itulah orang-orang pendusta, karena kedustaan sudah menjadi kebiasaan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "105. إِنَّمَا يَفْتَرِى الْكَذِبَ الَّذِينَ لَا يُؤْمِنُونَ بِـَٔايٰتِ اللهِ ۖ (Sesungguhnya yang mengada-adakan kebohongan, hanyalah orang-orang yang tidak beriman kepada ayat-ayat Allah) Lalu bagaimana mungkin Rasulullah melakukan kebohongan sedangkan beliau adalah pemimpin orang-orang beriman. Kebohongan hanya muncul dari orang kafir yang tidak beriman kepada Allah, dan tidak mengharapkan pahala keimanan, serta tidak takut dari dosa kedustaan. وَأُو۟لٰٓئِكَ(dan mereka itulah) Yakni orang-orang yang memiliki sifat-sifat tersebut. هُمُ الْكٰذِبُونَ(orang-orang pendusta) Yakni berbuat bohong adalah sifat dan kebiasaan yang selalu mereka lakukan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "105. Sesungguhnya yang merekayasa kebohongan terhadap Allah dan rasulNya adalah orang-orang yang tidak mengimani ayat-ayat Allah. Mereka itu adalah para pendusta yang menuduh dengan kebohongan. Lalu bagaimana bisa mereka menuduh rasul itu berbohong sedangkan dia adalah pemimpun orang-orang mukmin?!"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya yang mengada-adakan} membuat-buat {kebohongan adalah orang-orang yang tidak beriman kepada ayat-ayat Allah. Mereka itulah para pembohong"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "105. “Sesungguhnya yang mengada-adakan kebohongan hanyalah,” maksudnya aksi kebohongan semata-mata muncul dari “orang-orang yang tidak beriman kepada ayat-ayat Allah,” semisal para penentang Rasulullah, setelah datang kepada mereka bukti-bukti yang nyata “dan mereka itulah orang-orang pendusta,” maksudnya praktik kedustaan sudah terpola pada mereka. Predikat ini lebih pantas dilontarkan kepada mereka daripada orang lain. Sementara itu, Muhammad yang beriman kepada ayat-ayat Allah, yang patuh kepada Rabbnya, mustahil beliau berdusta atas nama Allah dan mengada-adakan perkataan atas NamaNya yang tidak pernah difirmankanNya. Para musuh menuduh beliau dengan kedustaan yang sebenarnya menjadi predikat mereka. Maka, Allah memperlihatkan kehinaan mereka dan menerangkan keburukan-keburukan mereka. BagiNya segala pujian."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat: Firman-Nya “Sesungguhnya yang mengada-adakan kebohongan hanyalah orang yang tidak beriman kepada ayat-ayat Allah, dan mereka itulah pembohong.” Yang membuat dan berlaku dusta hanyalah orang yang ingkar kepada ayat-ayat Allah, karena ia tidak mengharapkan balasan dan tidak takut kepada hukuman Allah. Sehingga tidak ada yang menghalanginya untuk berbuat dusta. Adapun seorang mukmin, ia mengharapkan pahala dari kejujuran serta takut akan hukuman dusta, sehingga ia tidak berani berdusta sampai kapan pun. Oleh karena itu, ayat ini menjelaskan bahwa Nabi shallallahu ‘alaihi wa sallam tidak berdusta, yang berbuat dusta hanya mereka orang-orang yang ingkar kepada ayat-ayat Allah, merekalah pendusta yang sebenarnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 105: Yang mengatakan, bahwa Al Qur’an itu ucapan manusia. Yakni kedustaan ada dalam diri mereka, dan mereka lebih layak disebut pendusta daripada selain mereka. Diulangi kata-kata “dusta” terhadap mereka untuk menguatkan dan sebagai bantahan terhadap perkataan mereka kepada Nabi shallallahu 'alaihi wa sallam, “Sesungguhnya engkau (Muhammad) hanya mengada-ada saja.” Adapun Nabi Muhammad shallallahu 'alaihi wa sallam, maka Beliau beriman kepada ayat-ayat Allah dan tunduk kepada Tuhannya. Oleh karena itu, mustahil jika Beliau berdusta atas nama Allah dan berkata apa yang tidak difirmankan-Nya. Oleh karena musuh-musuh Beliau menuduh Beliau berdusta, maka Allah menampakkan kehinaan dan menerangkan aib mereka, fa lillahil hamd."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 105",
    "description": "Selain menuduh nabi Muhammad sebagai pembohong, orang kafir juga meyakini ayat-ayat yang beliau sampaikan adalah hasil karyanya sendiri, bukan dari Allah. Menepis tuduhan itu Allah menegaskan sesungguhnya yang mengada-adakan kebohongan hanyalah orang-orang yang tidak mau beriman kepada ayat-ayat Allah, baik yang termaktub dalam Al-Qur'an maupun terbentang di alam semesta, dan mereka itulah pembohong sejati, bukan nabi Muhammad. Barang siapa kembali kafir kepada Allah setelah dia beriman kepada ajaran-Nya dengan bukti-bukti kebenaran-Nya'kecuali orang yang dipaksa kafir lalu menyatakan kekafirannya di bawah paksaan itu, padahal hatinya tetap tenang dalam beriman, maka dia tidaklah berdosa'tetapi orang yang melapangkan dadanya untuk kekafiran dan menyatakannya dengan suka rela, maka kemurkaan Allah yang amat besar akan menimpanya di dunia, dan mereka pun akan mendapat azab yang besar berupa siksa neraka di akhirat."
  }
]