[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "106-107. Sesungguhnya orang-orang yang mengada-adakan kedustaan tiada lain hanyalah orang yang mengucapkan kata-kata kekafiran dan telah murtad meninggalkan keimanannya. Maka kemurkaan dari Allah akan menimpa mereka kecuali orang yang dipaksa mengucapkan kata-kata kekafiran, lalu mengucapkannya lantaran takut akan binasa, sedang hatinya tetap teguh di atas keimanan, maka tidak ada celaan atas dirinya. Akan tetapi orang yang mengucapkan kata-kata kekafiran, sedang hatinya tenang-tenang saja dengannya, maka mereka mendapatkan kemurkaan besar dari Allah , dan bagi mereka siksaan yang besar. Demikian itu, disebabkan oleh kehendak mereka untuk mengedepankan dunia dan pesonanya dan mengutamkannya diatas akhirat dan balasan pahalanya. Dan bahwasannya Allah tidak memberikan hidayah kepada orang-orang kafir, dan tidak mencurahkan taufik kepada mereka menuju kebenaran dan jalan lurus."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "106. Barangsiapa kafir kepada Allah sesudah beriman, kecuali orang yang dipaksa melakukan kekafiran, dia mengucapkan kalimat kufur dengan lisannya, sedangkan hatinya tetap kokoh dengan keimanan dan hakikatnya, (maka ia tetap Mukmin). Akan tetapi orang yang hatinya tenteram dengan kekufuran, dan lebih memilih kekufuran dibandingkan keimanan, dia mengucapkan kekufuran secara sukarela, maka dia telah murtad dari Islam. Untuk mereka kemurkaan Allah dan azab Akhirat yang berat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "106-107. Allah menjelaskan 4 ayat yang akan disebutkan ini bahaya keluar dari agama Islam dan besarnya siksaan di dunia dan di akhirat bagi orang-orang murtad: Barangsiapa yang murtad setelah beriman maka baginya kemurkaan Allah, kecuali orang yang dipaksa untuk mengucapkan kalimat kekafiran karena takut akan dibunuh, akan tetapi hatinya masih teguh di atas keimanan kepada Allah, maka tidak ada dosa baginya ketika melakukan itu. Akan tetapi orang yang mengucapkan kalimat kekafiran sedangkan hatinya merelakan hal itu, maka baginya kemurkaan dari Allah dan azab yang sangat menyakitkan. Azab yang pedih itu karena dia lebih memilih kehidupan dunia daripada kehidupan akhirat. Dan Allah tidak akan memberi taufiq kepada orang-orang kafir menuju keimanan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "106. مَن كَفَرَ بِاللهِ مِنۢ بَعْدِ إِيمٰنِهِۦٓ (Barangsiapa yang kafir kepada Allah sesudah dia beriman) Ayat ini menjelaskan tentang orang yang murtad akibat perkataan kafir yang ia ucapkan atau perbuatan yang mengeluarkannya dari keimanan setelah ia masuk Islam. Namun dalam hal itu terdapat dua kemungkinan: Pertama, orang yang dipaksa untuk kafir dengan paksaan yang menjadikannya khawatir akan dibunuh; maka orang ini tidak mendapatkan dosa akibat perkataan kafir yang ia ucapkan atau perbuatan yang mengeluarkannya dari keimanan, misal: jika ia dipaksa melakukan sujud kepada selain Allah namun dengan hati yang tetap teguh dalam keimanan, maka ia tidak dinyatakan sebagai orang yang kafir atau murtad. Namun Imam Hasan al-Bashri, Imam al-Auza’i, Imam Syafi’i, dan Imam Sahnun berpendapat bahwa rukhshah (keringanan) ini hanya pada perkataan saja (paksaan untuk mengatakan kalimat yang mengandung kekafiran), adapun perbuatan maka tidak ada rukhshah bagi pelakunya. Kedua, orang yang sengaja dan rela untuk mengucapkan atau berbuat sesuatu yang mengandung kekafiran, maka hukum orang seperti ini adalah murtad dari keimanannya, dan orang yang mendapat ancaman dari lanjutan ayat ini. وَلٰكِن مَّن شَرَحَ بِالْكُفْرِ صَدْرًا(akan tetapi orang yang melapangkan dadanya untuk kekafiran) Yakni yang rela dan berlapang dada untuk mengucapkan atau berbuat sesuatu yang mengandung kekafiran setelah dulunya ia termasuk dalam barisan orang-orang beriman. Orang seperti ini akan mendapatkan kemurkaan Allah menimpanya dan baginya azab yang besar. Sebuah riwayat yang dikeluarkan oleh Abdur Razzaq, Ibnu sa’ad, dan Ibnu Jarir: bahwa orang-orang musyrik menangkap seorang sahabat bernama ‘Ammar bin Yasir, mereka tidak akan melepaskannya sampai ia mau menghina Nabi dan memuji berhala-berhala mereka, setelah itu mereka baru melepaskannya. Ketika ia mendatangi Nabi beliau bersabda: “berita apa yang kamu bawa?”. Ia menjawab: “berita buruk wahai Rasulullah”. –setelah ia menceritakannya— Rasulullah bersabda: “jika mereka memaksamu lagi, maka lakukanlah sebagaimana yang telah kamu lakukan itu”. Maka turunlah ayat ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "106. Dan barangsiapa murtad dari Islam setelah beriman, kecuali orang yang terpaksa mengucapkan kekufuran sedangkan hatinya masih teguh dalam beriman kepada Allah dan rasulNya, dan dia bahagia,ridha dan tenang dengan kekufuran itu, maka baginya itu murka Allah. dan baginya itu azab yang agung di neraka Jahanam. Keterpaksaan untuk kafir itu karena ancaman akan dibunuh atau disakiti dan dipukul, sekalipun perkara terpaksa itu hanya sebatas ucapan atau perbuatan seperti bersujud kepada selain Allah. Imam Syafi’i dan pengikutnya menentukan keringanan dalam hal ucapan saja. Ayat ini turun terkait perkara Amar bin Yasir yang disiksa orang-orang musyrik dan dipaksa untuk melaknat nabi SAW serta menyebutkan tuhan-tuhan mereka dengan baik. Kemudian dia berikrar di depan Nabi bahwa dia masih teguh dalam beriman"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Siapa yang ingkar kepada Allah setelah beriman kecuali orang yang dipaksa} dipaksa untuk mengucapkan keingkaran sehingga dia melafalkannya, karena takud dibinasakan {dan hatinya tetap tenang dengan keimanannya. Akan tetapi, siapa yang berlapang dada pada kekufuran} lapang dadanya untuk menerima kekufuran dan berpegang teguh padanya dan senang dengan itu {niscaya kemurkaan Allah menimpa mereka, dan bagi mereka itu azab yang besar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "106-108. Allah memberitahukan tentang kebejatan kondisi orang yang mengingkariNya setelah sebelumnya pernah beriman. Ia menjadi buta setelah dapat memandang (dengan matanya), ia kembali kepada kesesatan sesudah (mengenyam) hidayah, melapangkan dadanya untuk kekufuran dalam keadaan ridha dan tenang dengannya, mereka itu mendapatkan kemurkaan yang besar dari Rabb yang Maha Penyayang, yang jika Dia marah, maka tidak ada sesuatu pun yang bisa menahan kemarahanNya, dan semua akan ikut memurkai mereka. “Dan mereka mendapatkan azab yang besar,” yaitu pada puncak kedahsyatannya, serta bersifat abadi selama-lamanya. Demikian itu, karena mereka, “lebih mencintai kehidupan dunia daripada akhirat,” mereka berbalik murtad lagi, lantaran rakus untuk mengais secuil harta dunia dan menyukainya, kurang perhatian terhadap kebaikan akhirat. Ketika mereka lebih memilih kekufuran dibandingkan keimanan, maka Allah menghalangi hidayah dari mereka, lalu tidak menunjuki mereka. Karena kekufuran sudah menjadi sifat mereka sehingga terpatri pada hati-hati mereka, maka kebaikan pun terpatri. Maka hal-hal yang bermanfaat bagi mereka tidak bisa masuk pada alat indera itu dan tidak bisa mencapai hati mereka. Kelalaian telah menyelimuti mereka dan keterlantaran (dari perhatian Allah) telah melingkupi mereka. Maka, mereka terganjal (untuk dapat meraih) rahmat Allah yang meliputi segala sesuatu. Demikian ini, karena telah datang hidayah kepada mereka, namun mereka tolak. Dan telah disuguhkan kepada mereka, akan tetapi mereka tidak sudi menerimanya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (إِلَّا مَنۡ أُكۡرِهَ) illaa man ukrih : kecuali mereka mengucapkan kalimat kufur, lalu mereka mengucapkannya karena terpaksa. (وَلَٰكِن مَّن شَرَحَ بِٱلۡكُفۡرِ صَدۡرٗا) wa laakim man syaraha bil kufr shadraa : membuka dadanya untuk kekufuran dan menerimanya dengan senang hati. Makna ayat: Firman-Nya ta’ala “Barangsiapa kafir kepada Allah setelah dia beriman, kecuali orang yang dipaksa” untuk mengucapkan kalimat kufur “padahal hatinya tetap tenang dalam keimanan” tidak ragu, goyah, tidak pula khawatir, sehingga ia hanya mengucapkan kalimat kufur itu di lisan saja, sebagaimana yang terjadi pada Ammar bin Yasir. Dahulu Quraisy memaksanya untuk mengucapkan kalimat kufur, dan Rasulullah shallallahu ‘alaihi wa sallam mengizinkan mengucapkannya hanya di lisan. Namun yang pantas mendapatkan ancaman adalah “orang yang melapangkan dadanya untuk kekafiran” ridha dan hatinya tenang dengan kekufuran “maka kemurkaan Allah menimpanya dan mereka akan mendapat azab yang besar.” Mereka kembali dengan kemurkaan Allah, dan bagi mereka di akhirat azab yang besar. Pelajaran dari ayat: • Boleh mengucapkan kata-kata kufur tatkala dalam keadaan tersiksa, dengan syarat hati tetap tenang di dalam keimanan dan tidak menerima kalimat kufur itu dengan lapang dada."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 106: Allah Subhaanahu wa Ta'aala menerangkan tentang buruknya keadaan orang yang kafir kepada Allah setelah beriman. Seakan-akan mereka adalah orang yang buta setelah melihat dan kembali kepada kesesatan setelah mendapat petunjuk. Dan boleh baginya mengucapkan kata-kata kufur ketika dipaksa. Fiqih yang dapat diambil dari ayat ini adalah bahwa ucapan orang yang dipaksa tidaklah dipandang dan tidak membuah hukum syar’i, baik dalam urusan talak, memerdekakan, jual-beli dan akad lainnya. Hal ini, karena apabila seseorang tidak berdosa mengucapkan kata-kata kufur ketika dipaksa, maka urusan lain tentu lebih berhak tidak mendapatkan dosa. Yakni hatinya rela dengan kekafiran. Jika Dia murka, maka tidak ada satu pun makhluk yang berani berdiri, dan segala sesuatu akan ikut murka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 106",
    "description": "Barang siapa kembali kafir kepada Allah setelah dia beriman kepada ajaran-Nya dengan bukti-bukti kebenaran-Nya'kecuali orang yang dipaksa kafir lalu menyatakan kekafirannya di bawah paksaan itu, padahal hatinya tetap tenang dalam beriman, maka dia tidaklah berdosa'tetapi orang yang melapangkan dadanya untuk kekafiran dan menyatakannya dengan suka rela, maka kemurkaan Allah yang amat besar akan menimpanya di dunia, dan mereka pun akan mendapat azab yang besar berupa siksa neraka di akhirat. Yang demikian itu, yaitu kemurtadan dan kekafiran mereka, disebabkan karena mereka lebih mencintai dan mengutamakan kehidupan dunia daripada kehidupan akhirat, padahal kehidupan akhirat dengan segala kenikmatannya jauh lebih baik daripada kehidupan dunia, dan Allah tidak memberi petunjuk kepada kaum yang kafir."
  }
]