[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "106-107. Sesungguhnya orang-orang yang mengada-adakan kedustaan tiada lain hanyalah orang yang mengucapkan kata-kata kekafiran dan telah murtad meninggalkan keimanannya. Maka kemurkaan dari Allah akan menimpa mereka kecuali orang yang dipaksa mengucapkan kata-kata kekafiran, lalu mengucapkannya lantaran takut akan binasa, sedang hatinya tetap teguh di atas keimanan, maka tidak ada celaan atas dirinya. Akan tetapi orang yang mengucapkan kata-kata kekafiran, sedang hatinya tenang-tenang saja dengannya, maka mereka mendapatkan kemurkaan besar dari Allah , dan bagi mereka siksaan yang besar. Demikian itu, disebabkan oleh kehendak mereka untuk mengedepankan dunia dan pesonanya dan mengutamkannya diatas akhirat dan balasan pahalanya. Dan bahwasannya Allah tidak memberikan hidayah kepada orang-orang kafir, dan tidak mencurahkan taufik kepada mereka menuju kebenaran dan jalan lurus."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "107. Mereka murtad dari Islam karena mereka mementingkan kepentingan dunia yang mereka dapatkan sebagai balasan atas kekufuran mereka di atas pahala Akhirat. Dan Allah tidak membimbing kaum yang kafir menuju keimanan, tetapi sebaliknya menghinakan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "107. ذلك (Yang demikian itu) Yakni kekafiran setelah keimanan. بأنهم استحبوا الحياة الدنيا (disebabkan karena sesungguhnya mereka mencintai kehidupan di dunia) Yakni akibat kehidupan dunia yang lebih mereka utamakan. وأن الله لا يهدي القوم الكافرين (dan bahwasanya Allah tiada memberi petunjuk kepada kaum yang kafir) Yakni tidak memberi mereka petunjuk kepada keimanan kepada-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "107. Kekufuran setelah keimanan dan azab yang agung itu disebabkan karena kecenderungan mereka terhadap dunia daripada akhirat. Dan kecintaan mereka yang dahsyat terhadap kehidupan dunia itu membutakan mereka dari cinta terhadap sesuatu yang bisa menyelamatkan mereka dari azab akhirat. Dan karena Allah itu tidak menolong orang-orang kafir untuk beriman"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Yang demikian itu karena mereka lebih mencintai} lebih suka dan memilih {kehidupan dunia daripada akhirat dan sesungguhnya Allah tidak memberi petunjuk kepada kaum yang kafir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "106-108. Allah memberitahukan tentang kebejatan kondisi orang yang mengingkariNya setelah sebelumnya pernah beriman. Ia menjadi buta setelah dapat memandang (dengan matanya), ia kembali kepada kesesatan sesudah (mengenyam) hidayah, melapangkan dadanya untuk kekufuran dalam keadaan ridha dan tenang dengannya, mereka itu mendapatkan kemurkaan yang besar dari Rabb yang Maha Penyayang, yang jika Dia marah, maka tidak ada sesuatu pun yang bisa menahan kemarahanNya, dan semua akan ikut memurkai mereka. “Dan mereka mendapatkan azab yang besar,” yaitu pada puncak kedahsyatannya, serta bersifat abadi selama-lamanya. Demikian itu, karena mereka, “lebih mencintai kehidupan dunia daripada akhirat,” mereka berbalik murtad lagi, lantaran rakus untuk mengais secuil harta dunia dan menyukainya, kurang perhatian terhadap kebaikan akhirat. Ketika mereka lebih memilih kekufuran dibandingkan keimanan, maka Allah menghalangi hidayah dari mereka, lalu tidak menunjuki mereka. Karena kekufuran sudah menjadi sifat mereka sehingga terpatri pada hati-hati mereka, maka kebaikan pun terpatri. Maka hal-hal yang bermanfaat bagi mereka tidak bisa masuk pada alat indera itu dan tidak bisa mencapai hati mereka. Kelalaian telah menyelimuti mereka dan keterlantaran (dari perhatian Allah) telah melingkupi mereka. Maka, mereka terganjal (untuk dapat meraih) rahmat Allah yang meliputi segala sesuatu. Demikian ini, karena telah datang hidayah kepada mereka, namun mereka tolak. Dan telah disuguhkan kepada mereka, akan tetapi mereka tidak sudi menerimanya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat: Kemudian Allah menjelaskan sebab balasan yang besar ini dengan firman-Nya, “Yang demikian itu disebabkan karena mereka lebih mencintai kehidupan dunia daripada akhirat.” Karena kekafiran dan mereka tidak beriman kepada-Nya, sehingga mereka bisa bebas beribadah sekehendak mereka, tidak ada ketaatan, halal, dan haram. Firman-Nya “Dan sesungguhnya Allah tidak memberi petunjuk kepada kaum yang kafir.” Ini merupakan ancaman dari-Nya ta’ala, yang telah Allah ketahui bahwa kaum yang kafir tidak akan mendapatkan taufik kepada hidayah sebagai hukuman untuk mereka, karena telah memilih kekufuran dan terus berada di atasnya. Pelajaran dari ayat: • Lebih mencintai dunia ketimbang akhirat adalah jalan menuju kekufuran, kesesatan, serta kehancuran."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 107: Yakni murtadnya mereka dari agama Islam. Mereka lebih memilih kekafiran daripada keimanan karena mencintai kesenangan dunia, maka Allah mencegah mereka dari beriman."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 107",
    "description": "Yang demikian itu, yaitu kemurtadan dan kekafiran mereka, disebabkan karena mereka lebih mencintai dan mengutamakan kehidupan dunia daripada kehidupan akhirat, padahal kehidupan akhirat dengan segala kenikmatannya jauh lebih baik daripada kehidupan dunia, dan Allah tidak memberi petunjuk kepada kaum yang kafir. Mereka yang berpaling dari kebenaran dan mengesampingkan iman dan petunjuk itulah orang yang hati, pendengaran, dan penglihatannya telah dikunci oleh Allah. Allah membiarkan mereka larut dalam kesesatan dan kekufuran sesuai kemauan mereka sehingga hati mereka terkunci mati, pendengaran mereka tidak lagi mampu mendengar bimbingan, dan penglihatan mereka tidak dapat melihat tanda-tanda kebesaran Allah. Mereka itulah orang yang benar-benar lalai dari memperhatikan kehidupan mereka."
  }
]