[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka itu adalah orang-orang yang Allah telah mengunci hati mereka dengan kekafiran dan lebih mendahulukan dunia di atas akhirat, sehingga cahaya hidayah tidak sampai kepada mereka, dan menyumbat pendengaran mereka dari ayat-ayat Allah, sehingga tidak dapat mendengarnya dengan penuh perenungan serta membutakan penglihatan mereka, sehingga tidak dapat memperhatikan bukti-bukti kebenaran yang menunujukan uluhiyah Allah. Dan mereka itulah orang-orang lalai dari siksaan yang Allah siapakan bagi mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "108. Orang-orang yang murtad sesudah mereka beriman itu adalah orang-orang yang Allah tutup hati mereka rapat-rapat sehingga mereka tidak memahami nasihat, Allah menyumbat pendengaran mereka sehingga tidak mendengar apa yang bermanfaat bagi mereka, Allah menutup penglihatan mereka sehingga mereka tidak melihat petunjuk-petunjuk kepada iman. Mereka adalah orang-orang yang lalai dari sebab-sebab kebahagiaan dan kesengsaraan, dan lalai dari apa yang Allah ancamkan bagi mereka yaitu azab."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "108-109. Mereka adalah orang-orang yang jauh dari rahmat Allah, Allah telah menutup hati mereka dengan kekafiran. Allah telah membuat pendengaran mereka tuli sehingga tidak dapat mendengar kebenaran, dan membuat penglihatan mereka buta sehingga mereka tidak dapat melihat ayat-ayat kauniyah yang menjadi bukti kekuasaan Allah. Orang-orang yang jauh dari kebenaran itu merupakan orang-orang yang lalai dari kebaikan di dunia dan di akhirat, dan tidak diragukan lagi ketika di akhirat mereka adalah orang-orang yang akan binasa."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "108. أُو۟لٰٓئِكَ (Mereka itulah) Yakni orang-orang murtad yang lebih mengutamakan kehidupan dunia daripada perintah Allah dan keimanan kepada-Nya. الَّذِينَ طَبَعَ اللهُ عَلَىٰ قُلُوبِهِمْ وَسَمْعِهِمْ وَأَبْصٰرِهِمْ ۖ (orang-orang yang hati, pendengaran dan penglihatannya telah dikunci mati oleh Allah) Sehingga mereka tidak dapat memahami nasehat dan pelajaran, dan tidak dapat mendengar dan melihat tanda-tanda yang menunjukkan kepada kebenaran. وَأُو۟لٰٓئِكَ هُمُ الْغٰفِلُونَ(dan mereka itulah orang-orang yang lalai) Lalai dari tujuan penciptaan mereka. Tidak ada kelalaian yang melebihi kelalaian seperti yang terjadi pada mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "108. Orang-orang yang kafir setelah beriman itu adalah orang-orang yang telah dikunci oleh Allah hati, pendengaran dan penglihatannya, sehingga keimanan itu tidak bisa masuk ke dalam hati mereka. Mereka tidak bisa merenungi dan melihat ayat-ayat kebenaran dan jalan keberhasilan. Dan mereka itu adalah orang-orang yang lupa tentang azab Allah yang sangat dahsyat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka itulah orang-orang yang dikunci} dikunci {Allah hati, pendengaran, dan penglihatan mereka. Mereka itulah orang-orang yang lalai"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "106-108. Allah memberitahukan tentang kebejatan kondisi orang yang mengingkariNya setelah sebelumnya pernah beriman. Ia menjadi buta setelah dapat memandang (dengan matanya), ia kembali kepada kesesatan sesudah (mengenyam) hidayah, melapangkan dadanya untuk kekufuran dalam keadaan ridha dan tenang dengannya, mereka itu mendapatkan kemurkaan yang besar dari Rabb yang Maha Penyayang, yang jika Dia marah, maka tidak ada sesuatu pun yang bisa menahan kemarahanNya, dan semua akan ikut memurkai mereka. “Dan mereka mendapatkan azab yang besar,” yaitu pada puncak kedahsyatannya, serta bersifat abadi selama-lamanya. Demikian itu, karena mereka, “lebih mencintai kehidupan dunia daripada akhirat,” mereka berbalik murtad lagi, lantaran rakus untuk mengais secuil harta dunia dan menyukainya, kurang perhatian terhadap kebaikan akhirat. Ketika mereka lebih memilih kekufuran dibandingkan keimanan, maka Allah menghalangi hidayah dari mereka, lalu tidak menunjuki mereka. Karena kekufuran sudah menjadi sifat mereka sehingga terpatri pada hati-hati mereka, maka kebaikan pun terpatri. Maka hal-hal yang bermanfaat bagi mereka tidak bisa masuk pada alat indera itu dan tidak bisa mencapai hati mereka. Kelalaian telah menyelimuti mereka dan keterlantaran (dari perhatian Allah) telah melingkupi mereka. Maka, mereka terganjal (untuk dapat meraih) rahmat Allah yang meliputi segala sesuatu. Demikian ini, karena telah datang hidayah kepada mereka, namun mereka tolak. Dan telah disuguhkan kepada mereka, akan tetapi mereka tidak sudi menerimanya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (وَأُوْلَٰٓئِكَ هُمُ ٱلۡغَٰفِلُونَ) wa ulaa`ika humul ghaafiluun : merekalah orang-orang yang lalai dari tujuan mereka. Makna ayat: Firman-Nya “Mereka itulah orang-orang yang hatinya telah Allah kunci” begitu pula pendengaran dan pengelihatan mereka. Mereka itulah orang-orang yang Allah ancam tidak mendapatkan hidayah, merekalah yang hatinya telah tertutup sehingga mereka tidak mengetahui. “dan pendengaran mereka”, tidak mendengar nasehat dan seruan-seruan para da’i yang mengajak kepada Allah ta’ala “dan pengelihatan mereka” tidak melihat ayat-ayat Allah dan bukti-bukti yang ada di alam semesta. Penyebab keadaan mereka sekarang karena mereka berpaling secara sengaja dan lebih mencintai dunia, menentang, sombong, serta menghalang-halangi dakwah yang benar ini. Firman-Nya “dan merekalah orang-orang yang lalai.” Dari tujuan penciptaan mereka dan apa yang akan mereka hadapi di akhirat kelak berupa hukuman dan azab yang pedih."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 108: Oleh karena itu, hatinya tidak bisa dimasuki kebaikan, sedangkan pendengaran dan penglihatan tidak bisa menerima manfaat yang akan sampai ke dalam hati mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 108",
    "description": "Mereka yang berpaling dari kebenaran dan mengesampingkan iman dan petunjuk itulah orang yang hati, pendengaran, dan penglihatannya telah dikunci oleh Allah. Allah membiarkan mereka larut dalam kesesatan dan kekufuran sesuai kemauan mereka sehingga hati mereka terkunci mati, pendengaran mereka tidak lagi mampu mendengar bimbingan, dan penglihatan mereka tidak dapat melihat tanda-tanda kebesaran Allah. Mereka itulah orang yang benar-benar lalai dari memperhatikan kehidupan mereka. Pastilah, tidak diragukan lagi, mereka yang kembali kepada kekafiran setelah menyatakan beriman itu termasuk orang yang rugi di akhirat nanti. Mereka akan menyesali apa yang telah diperbuatnya, padahal penyesalan di hari itu tidak lagi berguna."
  }
]