[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Adalah benar bahwasannya di akhirat kelak mereka adalah orang-orang yang merugi lagi binasa, yaitu orang-orang yang telah memalingkankan hidup mereka dalam perkara yang berujung siksaaan dan kebinasaan bagi mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "109. Benar, sesungguhnya mereka itu pada hari Kiamat adalah orang-orang yang merugi, orang-orang yang merugikan diri mereka karena kekufuran mereka sesudah mereka beriman yang seandainya mereka memegangnya niscaya mereka masuk Surga."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "109. لَا جَرَمَ أَنَّهُمْ فِى الْاٰخِرَةِ هُمُ الْخٰسِرُونَ (Pastilah bahwa mereka di akhirat nanti adalah orang-orang yang merugi) Yakni sungguh mereka benar-benar dalam kerugian yang paling besar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "109. Sungguh mereka itu manusia paling merugi di akhirat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidak diragukan} tidak diragukan {bahwa mereka adalah orang-orang yang rugi di akhirat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "109. “Pastilah bahwa mereka di akhirat nanti adalah orang-orang yang merugi,” orang-orang yang merugi atas dirinya, jiwa, dan kekayaan, serta keluarga di Hari Kiamat. Kenikmatan yang lestari telah terlewatkan oleh mereka. Mereka memperoleh siksaan yang pedih. Kondisi ini berbeda dengan orang yang dipaksa untuk berbuat kufur dan dipecundangi untuk melakukannya, sedangkan hatinya masih tenang dengan keimanannya dan mencintainya, maka sesungguhnya hal itu tidak masalah baginya dan tidak ada dosa. Ia boleh berbicara dengan kalimat kekufuran saat dipaksa untuk melakukannya. Hal ini menunjukkan bahwa perkataan orang yang dipaksa untuk mentalak, memerdekakan budaknya, menjual atau membeli dan (pemaksa di) seluruh bentuk akad tidaklah bisa dijadikan pedoman dan tidak berdampak munculnya hukum syar’i. Sebab, jika ia saja tidak dihukum atas ucapan kekufurannya ketika dipaksa, maka permasalahan lain lebih utama dan lebih pantas lagi (untuk tidak dikenai sanksi)."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (لَا جَرَمَ) laa jaram : pastilah (هُمُ ٱلۡخَٰسِرُونَ) humul khaasiruun : mereka lah orang yang merugi, karena tempat kembali mereka pasti adalah neraka, kekal abadi di dalamnya. Makna ayat: Mereka akan mendapati diri mereka berada di dalam azab yang pedih lagi kekal, tidak dapat keluar darinya, tidak pula lari, dan mereka berputus asa di dalamnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 109: Karena tempat kembali mereka ke neraka dan mereka kehilangan nikmat yang kekal."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 109",
    "description": "Pastilah, tidak diragukan lagi, mereka yang kembali kepada kekafiran setelah menyatakan beriman itu termasuk orang yang rugi di akhirat nanti. Mereka akan menyesali apa yang telah diperbuatnya, padahal penyesalan di hari itu tidak lagi berguna. Setelah mengancam orang yang kembali kepada kekafiran, Allah lalu beralih menghibur nabi Muhammad dengan balasan bagi orang yang berhijrah, kemudian tuhanmu, wahai nabi Muhammad, adalah pembimbing dan pelindung bagimu dan bagi orang yang berhijrah demi menyelamatkan jiwa dan agama mereka setelah menderita cobaan dan penganiayaan dari orang kafir, kemudian mereka berjihad mempertahankan agama dan keyakinanan mereka dan bersabarmenghadapi tantangan dan rintangan serta melaksanakan tugas keagamaan mereka. Sungguh, tuhanmu setelah itu, yaitu setelah mereka diuji dengan cobaan yang berat, benar-benar maha pengampun atas dosa dan kesalahan mereka, maha penyayang atas pelanggaran mereka."
  }
]