[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dia mengeluarkan bagi kalian dari bumi dengan satu jenis air ini berbagai tanaman yang bermacam-macam, dan Dia mengeluarkan dengannya zaitun, pohon kurma dan anggur, dan mengeluarkan dengannya beragam hasil panen gan buah-buahan. Sesungguhnya pada kejadian munculnya berbagai macam buah-buahan terdapat pentunjuk yang jelas bagi kaum yang merenungi dan mau mengambil pelajaran."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Allah menumbuhkan dengan air hujan tanaman-tanaman, sumber makanan kalian. Allah juga menumbuhkan zaitun, kurma dan anggur. Allah menumbuhkan segala bentuk buah-buahan. Sesungguhnya air hujan dan apa yang ditumbuhkannya mengandung petunjuk atas kekuasaan Allah bagi kaum yang memikirkan ciptaan-Nya, lalu mereka menjadikannya sebagai bukti kemahaagungan Allah -Subḥānahu-."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "11. وَمِن كُلِّ الثَّمَرٰتِ ۗ (dan segala macam buah-buahan) Yakni seluruh jenis buah-buahan. إِنَّ فِى ذٰلِكَ(Sesungguhnya pada yang demikian itu) Yakni pada penurunan hujan dan penumbuhan tanaman. لَاٰيَةً (benar-benar ada tanda (kekuasaan Allah)) Yakni tanda besar yang menunjukkan kesempurnaan kuasa Allah dan keesaan-Nya. لِّقَوْمٍ يَتَفَكَّرُونَ (bagi kaum yang memikirkan) Memikirkan tentang makhluk-makhluk Allah dan tidak lalai dalam bertafakkur tentang hal itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Dengan air hujan itu Dia menumbuhkan bagi kamu bermacam tanaman seperti zaitun, korma, anggur dan segala macam buah-buahan lainnya. Sesungguhnya pada semua itu benar-benar ada tanda kekuasaan Allah bagi kaum yang mau berfikir"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia menumbuhkan untuk kalian dengan air itu} dengan air yang turun itu {tumbuh-tumbuhan, zaitun, kurma, anggur, dan segala macam buah-buahan. Sesungguhnya pada yang demikian itu benar-benar terdapat tanda-tanda bagi orang yang berpikir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "10-11. (kalian memikirkan) dengan itu, tentang sempurnanya kekuasaan Allah yang telah menurunkan air ini dari awan yang tipis lagi lembut, dan (tentang sempurnanya) rahmatNya. Buktinya, Allah menjadikannya air yang tercurah banyak, mereka minum darinya, dan binatang binatang ternak merekapun minum dadrinya. Mereka mengairi tanah tanah pertanian mereka dengan sebagiannya. Sehingga keluarlah buah buahan yang banyak dan kenikmatan kenikmatan yang melimpah."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat: Firman-Nya “dengan itu Dia menumbuhkan untuk kamu” dengan air yang Allah turunkan dari langit “tanam-tanaman, zaitun, kurma, anggur, dan segala jenis buah-buahan.” Buah-buahan dan sayuran dengan segala jenisnya, karena semuanya tergantung kepada air. Firman-Nya “sungguh, pada yang demikian” pada hal yang telah disebutkan berupa turunnya air dari langit dan diperolehnya berbagai manfaat darinya, “benar-benar terdapat tanda” tanda yang jelas akan keberadaan Allah, kekuasaan, ilmu, hikmah, dan kasih sayang-Nya yang mengharuskan untuk beribadah kepada-Nya dan meniggalkan peribadatan selain-Nya, namun itu semua “bagi orang yang berpikir.” Lalu mereka mengambil pelajaran. Namun orang-orang yang mirip dengan hewan ternak yaitu orang-orang yang tidak berpikir, mereka tidak akan mendapatkan suatu tandapun atau yang semisalnya pada alam ini, padahal mereka hidup di dalamnya. Pelajaran dari ayat: • Keutamaan berfikir, memahami, dan menggunakan akal, serta celaan dari lawan hal yang disebutkan, karena ayat-ayat alam sama seperti ayat-ayat Al-Qur’an, jika seorang hamba tidak berpikir, ia tidak akan mendapatkan petunjuk untuk mengetahui kebenaran yang diperintahkan, yaitu ma’rifatullah (mengenal Allah) agar ia hanya beribadah kepada-Nya dengan berdzikir dan syukur."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 11",
    "description": "Dengan air hujan itu pula dia menumbuhkan untuk kamu beragam tanam-tanaman yang dapat kamu manfaatkan untuk memenuhi kebutuhan kamu. Dengan air hujan itu pula dia menumbuhkan pohonpohon penghasil buah, seperti zaitun, kurma, anggur, dan segala macam buah-buahan dari pohon-pohon yang tidak disebutkan. Sungguh, pada yang demikian itu, yakni turunnya hujan dan kenikmatan yang ditimbulkannya, benar-benar terdapat tanda yang nyata mengenai kebesaran, keagungan, dan kekuasaan Allah bagi orang yang berpikir. (lihat: surah ar-ra'd/13: 4). Dia pula yang telah menundukkan malam sehingga menjadi gelap agar kamu dapat beristirahat, dan menundukkan siang sehingga menjadi terang agar kamu dapat berkarya. Allah pula yang telah menundukkan matahari yang menghangatkan dan menyinari bumi, dan menundukkan bulan untukmu agar dapat kamu jadikan pedoman penanggalan dan perhitungan. Dan bintang-bintang di langit dikendalikan dengan perintahnya untuk kemaslahatan kamu. Sungguh, pada yang demikian itu, yaitu penundukan dan pengendalian tersebut, benar-benar terdapat tanda-tanda yang nyata tentang keesaan dan kekuasaan Allah bagi orang yang mengerti."
  }
]