[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian tuhanmu terhadap orang-orang yang tertindas tanpa daya di makkah yang disiksa oleh orang-orang musyrikin hingga mereka(terpaksa) menuruti mereka secara zhahir dalam keyakinan mereka yakini, lalu menguji mereka dengan menyuruh mereka mengucapkan perkataan yang membuat orang-orang tersebut (kaum musyrikin) senang, sedang hati-hati mereka tetap tentram dengan keimanan, dan tatkala memungkinkan bagi mereka melepaskan diri, mereka pun berhijrah ke madinah, kemudian berjihad di jalan Allah, dan bersabar menghadapi beban-beban taklif, sesungguhnya tuhanmu, (setelah mereka bertaubat), benar-benar maha pengampun lagi maha penyayang terhadap mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "110. Kemudian Tuhanmu -wahai Rasul- adalah Maha Pengampun lagi Maha Penyayang kepada orang-orang Mukmin yang lemah yang berhijrah dari Makkah ke Madinah sesudah orang-orang musyrikin menyiksa mereka hingga mereka terpaksa mengucapkan kalimat kekufuran sekalipun hati mereka tetap tenang dengan iman mereka, kemudian mereka berjihad di jalan Allah agar kalimat Allah adalah yang tertinggi, dan kalimat orang-orang kafir adalah yang paling rendah, mereka bersabar atas penderitaan yang mereka alami, sesungguhnya Rabbmu sesudah fitnah yang menimpa mereka tersebut dan penyiksaan yang mendera mereka hingga mereka mengucapkan kalimat kekufuran adalah Maha Pengampun kepada mereka, lagi Maha Penyayang kepada mereka, karena mereka tidak mengucapkan kalimat kekufuran kecuali mereka dalam keadaan terpaksa."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "110. Hai Rasulallah, ketahuilah orang-orang yang berhijrah setelah mendapat berbagai ujian dari orang-orang kafir sehingga lisan mereka terpaksa mengucapkan kalimat kekafiran akan tetapi hati mereka tetap damai dalam keimanan; kemudian mereka berhasil berhijrah menuju Madinah dan ikut berjihad di jalan Allah dan bersabar di atas ketaatan kepada-Nya; maka setelah berbagai amal saleh yang mereka kerjakan setelah mereka mendapat banyak cobaan ini maka Allah Maha Pengampun atas dosa-dosa mereka dan Maha Mengasihi mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "110. ثُمَّ إِنَّ رَبَّكَ لِلَّذِينَ هَاجَرُوا۟ (Dan sesungguhnya Tuhanmu (pelindung) bagi orang-orang yang berhijrah) Berhijrah dari negeri kafir menuju negeri Islam. مِنۢ بَعْدِ مَا فُتِنُوا۟( sesudah menderita cobaan) Dengan siksaan orang-orang kafir atas mereka agar mereka kembali kepada kekafiran. ثُمَّ جٰهَدُوا۟( kemudian mereka berjihad) Di jalan Allah. وَصَبَرُوٓا۟( dan sabar) Sabar dalam berjihad dan dalam menjalankan kewajiban syariat. إِنَّ رَبَّكَ مِنۢ بَعْدِهَا لَغَفُورٌ رَّحِيمٌ(sesungguhnya Tuhanmu sesudah itu benar-benar Maha Pengampun lagi Maha Penyayang) Yakni Maha Pengampun lagi Maha Penyayang bagi orang-orang yang dipaksa untuk mengucapkan kalimat kekafiran sedangkan hati mereka tidak rela dengan kekafiran tersebut, namun jika mereka memperbaiki amalan mereka dan berjihad di jalan Allah serta bersabar. Pendapat lain mengatakan yakni Allah Maha Pengampun lagi Maha Penyayang bagi orang-orang yang disiksa kemudian mereka mengucapakan kalimat kekafiran karena khawatir atas diri mereka sehingga hati mereka juga terbuka dalam mengucapkannya, Allah akan mengampuni dan menyayangi mereka jika mereka bertaubat kepada Allah dan berhijrah menuju Rasulullah serta berjihad bersamanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "110. Wahai Nabi, sesungguhnya Tuhanmu itu Maha Pengampun dan Maha Pengasih bagi mereka yang behijrah dari rumah-rumah mereka menuju Islam dengan mengharap ridha Allah seusai mereka keluar dari agama mereka karena telah ditipu oleh orang-orang kafir dan disiksa oleh mereka (orang kafir). Kemudian mereka berjihad di jalan Allah dan bersabar untuk berjihad dan tetap melaksanakan syariat. Sesungguhnya mereka itu diampuni dan mereka itu tidak dihukum atas apa yang dipaksakan terhadap mereka. Ayat ini turun terkait golongan orang-orang lemah, yaitu Amar, Shuhaib, Abu Fakihah, Bilal, Amar bin Fuhairah dan orang-orang muslim lain yang disiksa penduduk (kafir) Mekah sampai mereka tidak menyadari apa yang mereka ucapkan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kemudian sesungguhnya Tuhanmu bagi orang-orang yang berhijrah setelah menderita cobaan} disiksa dan melafalkan kekufuran disertai dengan ketenangan hati mereka pada keimanan {Lalu, mereka berjihad dan bersabar. Sesungguhnya Tuhanmu setelah itu} setelah respon terhadap fitnah itu {benar-benar Maha Pengampun lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "110. Kemudian “sesungguhnya Rabbmu,” yang telah memelihara para hambaNya yang ikhlas (kepadaNya) dengan sifat kelembutan dan kebaikanNya, “benar-benar Maha pengampun lagi maha penyayang”, bagi orang-orang yang berhijrah di jalanNya, meninggalkan kampung halaman dan harta bendanya demi mencari keridhoan Allah dan ditimpa ujian fitnah pada agamanya agar mau kufur kemali, laludia tetap teguh di atas keimanan, dan keyakinan telah meresap, kemudian dia berjihad memerangi musuh-musuh Allah untuk tujuan memasukan mereka ke dalam agama Allah dengan lisan dan kekuatannya, bersabar atas ibadah-ibadah yang berat menurut kebanyakan orang, maka semua ini adalah faktor terpenting dalam meraih anugrah terbesan dan pemberian paling istimewa yaitu ampunan Allah terhadap dosa-dosa, kecil maupun besar yang mencakup sirnanya semua hal yang dibenci dan rahmatNya yang agung yang menjadi sumber kabiakan kondisi-kondisi mereka, lurusnya urusan agama dan dunia mereka. Mereka mendapat rahmat dari Allah di hari kiamat."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (هَاجَرُواْ) haajaruu : berhijrah menuju Madinah. (مِنۢ بَعۡدِ مَا فُتِنُواْ) mim ba’di maa futinuu : mereka disiksa oleh kaum musyrikin Mekah sehingga mereka mengucapkan kalimat kufur karena terpaksa. (إِنَّ رَبَّكَ مِنۢ بَعۡدِهَا) inna rabbaka mim ba’dihaa : setelah mereka berhijrah, berjihad, dan bersabar di atas iman dan jihad. (لَغَفُورٞ رَّحِيمٞ ) laghafuurur rahiim : Maha Pengampun atas dosa mereka dan Maha Penyayang kepada mereka. Makna ayat: Setelah Allah ta’ala menyebutkan keringanan untuk mengucapkan kata-kata kufur tatkala terdesak dengan syarat tidak mengerimanya dengan lapang dada, kemudian mengabarkan tentang sebagian kaum mukminin yang tertinggal dari hijrah setelah Rasulullah shallallahu ‘alaihi wa sallam, tatkala mereka ingin berhijrah Quraisy menahan dan menyiksa mereka hingga mereka mengucapkan kalimat kufur, kemudian setelah mereka mampu berhijrah, merekapun berhijrah, berjihad, dan bersabar, Allah ta’ala mengabarkan perihal mereka bahwa bagi mereka ampunan dan kasih sayang-Nya, maka janganlah takut dan bersedih. Allah ta’ala berfirman “kemudian mereka berjihad dan bersabar, sungguh Rabbmu setelah itu benar-benar Maha Pengampun, Maha Penyayang.” Maha Pengampun atas dosa mereka dan Maha Penyayang kepada mereka. Pelajaran dari ayat: • Keutamaan hijrah, jihad, dan sabar, serta ibadah ini dapat menghapus dosa dan kesalahan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 110: Ibnu Jarir meriwayatkan dengan sanadnya yang sampai kepada Ikrimah dari Ibnu Abbas radhiyallahu 'anhuma, ia berkata, “Ada segolongan kaum di antara penduduk Mekah yang masuk Islam. Mereka meremehkan Islam, maka orang-orang musyrik memaksa mereka keluar bersama mereka pada perang Badar. Sebagian di antara mereka tertangkap, dan sebagian lagi terbunuh. Maka kaum muslimin berkata, “Para tawanan kita ini adalah kaum muslimin, mereka dipaksa, maka mintakanlah ampunan untuk mereka.” Maka turunlah ayat kepada mereka, “Innalladziina tawaffaahumum malaa’ikatu zhaalimii anfusihim…dst.” (An NIsaa’: 97) Ibnu Abbas berkata, “Maka dikirimlah surat berisi ayat tersebut kepada kaum muslimin yang tinggal di Mekah. Mereka (kaum muslimin) pun keluar, lalu ditemui oleh kaum musyrik, kemudian mereka menimpakan fitnah (gangguan kepada kaum muslimin), maka turunlah ayat ini, “Dan di antara manusia ada orang yang berkata: \"Kami beriman kepada Allah\", maka apabila ia disakiti (karena ia beriman) kepada Allah, ia menganggap fitnah manusia itu sebagai azab Allah…dst.” (terj. Al ‘Ankabut: 10), maka kaum muslimin mengirimkan surat kepada mereka berisikan ayat tersebut. Mereka pun keluar (dari Mekah) dan nampak beputus asa dari semua kebaikan, kemudian turunlah ayat tentang mereka, “Kemudian Tuhanmu (pelindung) bagi orang yang berhijrah setelah menderita cobaan, kemudian mereka berjihad dan bersabar, sungguh, Tuhanmu setelah itu benar-benar Maha Pengampun lagi Maha Penyayang.” Kaum muslimin kemudian mengirimkan surat berisikan ayat tersebut dan menerangkan kepada mereka, “Bahwa Allah telah memberikan jalan keluar kepada kamu.” Mereka pun keluar dan ditemui oleh kaum musyrik, lalu mereka diperangi, di antara mereka ada yang selamat dan di antara mereka ada yang terbunuh. Syaikh Muqbil berkata, “Hadits ini menurut Al Haitsami dalam Majma’uzzawaa’id juz 7 hal. 10, “Para perawinya adalah para perawi hadits shahih selain Muhammad bin Syuraik, namun dia tsiqah.” Di atas ketaatan. Allah Subhaanahu wa Ta'aala mengurus hamba-hamba-Nya yang ikhlas dengan kelembutan dan ihsan-Nya, Dia Maha Pengampun lagi Maha Penyayang bagi orang yang berhijrah di jalan-Nya, meninggalkan tempat tinggal dan hartanya karena mencari keridhaan-Nya. Meskipun ia mendapat gangguan dalam menjalankan agamanya agar kembali kafir, namun ia tetap berada di atas keimanan, dan dapat pergi membawa iman, kemudian dia berjihad melawan musuh-musuh Allah untuk memasukkan mereka ke dalam agama Allah dengan lisan dan tangannya, dan bersabar dalam melakukan ibadah-ibadah yang berat itu. Ini merupakan sebab paling besar untuk memperoleh pemberian yang paling baik, yaitu ampunan Allah terhadap semua dosa besar maupun kecil. Di dalamnya mengandung selamat dari setiap perkara yang tidak diinginkan dan memperoleh rahmat-Nya yang besar, di mana dengan rahmat-Nya keadaan mereka menjadi baik, urusan agama dan dunia mereka semakin lurus. Demikian pula mereka akan mendapatkan rahmat Allah di hari kiamat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 110",
    "description": "Setelah mengancam orang yang kembali kepada kekafiran, Allah lalu beralih menghibur nabi Muhammad dengan balasan bagi orang yang berhijrah, kemudian tuhanmu, wahai nabi Muhammad, adalah pembimbing dan pelindung bagimu dan bagi orang yang berhijrah demi menyelamatkan jiwa dan agama mereka setelah menderita cobaan dan penganiayaan dari orang kafir, kemudian mereka berjihad mempertahankan agama dan keyakinanan mereka dan bersabarmenghadapi tantangan dan rintangan serta melaksanakan tugas keagamaan mereka. Sungguh, tuhanmu setelah itu, yaitu setelah mereka diuji dengan cobaan yang berat, benar-benar maha pengampun atas dosa dan kesalahan mereka, maha penyayang atas pelanggaran mereka. Ingatkanlah umatmu, wahai nabi Muhammad, pada hari ketika setiap orang datang kepada Allah untuk membela dirinya sendiri dengan berbagai alasan dari kesalahan dan dosanya. Dan bagi setiap orang, baik mukmin maupun kafir, yang taat maupun yang durhaka, diberi balasan penuh sesuai dengan apa yang telah dikerjakannya, dan mereka tidak dizalimi atau dirugikan sedikit pun. Allah akan membalas sekecil apa pun amal baik dan buruk yang telah manusia lakukan."
  }
]