[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan peringatkanlah mereka (wahai rasul), terhadap hari kiamat ketika setiap jiwa datang mendebat dirinya sendiri dan mengajukan berbagai alasan. Dan Allah akan menyempurnakan bagi setiap jiwa balasan semua yang ia perbuat, tanpa menzhaliminya. Dan tidak menambahi mereka hukuman dan tidak mengurangi pahala mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "111. Ingatlah -wahai Rasul- akan Hari di saat setiap orang datang membela dirinya sendiri dan tidak membela orang lain karena beratnya keadaan, setiap jiwa diberi balasan atas perbuatannya, kebaikan atau keburukan, mereka tidak dizalimi dengan dikurangi kebaikan mereka atau ditambah keburukan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "111. Allah menyebutkan kejadian pada hari kiamat, ketika setiap manusia membela diri mereka sendiri. Dan Allah akan menyempurnakan balasan bagi setiap manusia atas perbuatan mereka, dan mereka sama sekali tidak dizalimi sedikitpun."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "111. يَوْمَ تَأْتِى كُلُّ نَفْسٍ تُجٰدِلُ عَن نَّفْسِهَا ((Ingatlah) suatu hari (ketika) tiap-tiap diri datang untuk membela dirinya sendiri) Yakni setiap orang membela dirinya masing-masing agar mereka dapat selamat, tanpa mempedulikan orang lain."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "DIbawa kepada Hisyam bin Abdul Malik, seorang laki-laki, yang sampai kepada Hisyam, ada urusan yagn tidak senangi oleh Hisyam. Tatkala laki-laki tersebut disuruh berdiri dihadapan Hisyam, lalu ia berbicara dengan mengemukakan alasan. Maka Hisyam berkata kepada orang tadi: \"Engkau berbicara pula?\". Orang itu menjawab: \"Wahai Amirul-mu'minin ! Allah 'Azza wa Jalla berfirman: { يَوْمَ تَأْتِي كُلُّ نَفْسٍ تُجَادِلُ عَنْ نَفْسِهَا } \"(Ingatlah) suatu hari (ketika) tiap-tiap diri datang untuk membela dirinya sendiri\" Apakah kita akan membela diri dihadapan Allah Ta'ala dan tiada berkata -kata, sepatah katapun dihadapan engkau ?\" Hisyam menjawab: \"Ya, berbicaralah !\""
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "111. Dan ingatlah wahai Rasul ketika setiap manusia berdebat tentang diri sendiri supaya mereka selamat dari siksa pada hari kiamat, tidak ada yang membingungkan mereka selain hal itu. Dan setiap orang diberi balasan atas apa yang dikerjakan. Dan seseorang tidak akan dizalimi maupun dikurangi sedikitpun pahalanya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Hari (ketika) setiap orang datang untuk berdebat} berbantah-bantahan dan berargumen {tentang dirinya dan setiap orang disempurnakan (balasan) apa yang telah dia kerjakan} setiap orang diberi balasan atas apa yang mereka kerjakan berupa kebaikan dan keburukan {dan mereka tidak dizalimi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "111. Manakala “tiap-tiap jiwa datang untuk membela dirinya sendiri.” Setiap orang berkata, “Urusanku sendiri, urusanku sendiri.” Tidak terpikirkan kecuali dirinya sendiri, maka pada hari itu, seorang hamba membutuhkan kebaikan walaupun hanya seberat biji dzarrah “Dan bagi tiap-tiap jiwa disempurnakan (balasan) perbuatan yang telah dikkerjakannya,” berupa amal kebaikan atau kejelekan “sedang mereka tidak dianiaya (dirugikan),” tidak ditambahi pada kejelekan mereka dan tidak dikurangi pada kebaikan-kebaikan mereka. \"Maka pada hari itu seseorang tidak akan dirugikan sedikitpun dan kamu tidak dibalasi, kecuali dengan apa yang telah kamu kerjakan.\" (QS Yasin : 54)"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (يَوۡمَ تَأۡتِي) yauma ta`tii : ingatlah wahai Muhammad “hari setiap orang membela dirinya sendiri”. Makna ayat: Firman-Nya “Ingatlah pada hari setiap orang membela dirinya sendiri” ingatkanlah kaum mukminin akan hal ini, ketika setiap orang membela dirinya untuk keselamatan dirinya “dan bagi setiap orang diberi balasan penuh sesuai dengan apa yang mereka lakukan” berupa keburukan atau keburukan “dan mereka tidak dizalimi.” Karena Allah Maha Adil tidak ada ketidak adilah atau kezaliman pada hukum-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 111: Hari itu adalah hari kiamat. Ketika itu, tidak ada yang diperhatikan selain dirinya. Baik atau buruk. Keburukan mereka tidak ditambah, dan kebaikan mereka tidak dikurangi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 111",
    "description": "Ingatkanlah umatmu, wahai nabi Muhammad, pada hari ketika setiap orang datang kepada Allah untuk membela dirinya sendiri dengan berbagai alasan dari kesalahan dan dosanya. Dan bagi setiap orang, baik mukmin maupun kafir, yang taat maupun yang durhaka, diberi balasan penuh sesuai dengan apa yang telah dikerjakannya, dan mereka tidak dizalimi atau dirugikan sedikit pun. Allah akan membalas sekecil apa pun amal baik dan buruk yang telah manusia lakukan. Jika ayat sebelumnya menjelaskan hukuman bagi orang yang mengingkari ayat-ayat Allah dan tanda-tanda kekuasaan-Nya di alam, maka pada ayat berikut Allah menyebut balasan bagi orang yang mengingkari nikmat-Nya. Allah berfirman, dan Allah telah membuat suatu perumpamaan berupa sebuah negeri yang dahulu penduduk-Nya merasa aman dari segala ancaman lagi tenteram dengan segala kesenangan hidup di dalamnya; rezeki datang kepadanya melimpah ruah dari segenap tempat dengan berbagai cara, tetapi penduduknya mengingkari nikmat-nikmat Allah, yakni tidak menggunakannya sesuai tuntunan Allah. Karena kedurhakaan itu, Allah mengubah kondisi mereka dengan menimpakan kepada mereka bencana kelaparan dan ketakutan, disebabkan apa yang mereka perbuat."
  }
]