[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Allah telah membuat satu perumpamaan negeri makkah yang sebelumnya aman dari penindasan dan terbebas dari kesulitan hidup, yang mana rizkinya datang melimpah ruah lagi mudah ke negeri itu dari segala penjuru, tetapi penduduknya mengingkari nikmat-nikmat Allah yang tercurah pada mereka, dan mereka mempersekurukan (sesuatu) denganNya, serta tidak mensyukurinya, maka Allah menimpakan pada mereka hukuman kelaparan dan ketakuatn terhadap pasukan-pasukan ekspedisi dan bala tentara Rasululah yang membuat nyali mereka ciut. Demikian itu disebabkan kekafiran dan tindakan batil mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "112. Allah membuat perumpamaan suatu negeri, yaitu Makkah sebagai negeri yang aman, penduduknya tidak ketakutan, mereka hidup tenang sementara manusia di sekitarnya hidup dalam ketakutan, rezeki penduduk Makkah datang dengan mudah dari segala penjuru, namun penduduknya kufur kepada nikmat-nikmat yang Allah berikan kepada mereka dan mereka tidak mensyukurinya, maka Allah membalas mereka dengan kelaparan dan ketakutan berat yang dampaknya terlihat pada tubuh mereka sehingga ketakutan dan keguncangan itu seperti pakaian pada mereka karena kekufuran dan pendustaan yang mereka lakukan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "112. Perumpamaan ini dimaksudkan bagi para penduduk Makkah; dahulu mereka mendapat keamanan dari segala kesedihan dan terbebas dari segala kesulitan hidup, karena kota ini selalu didatangi rezeki yang lapang dari segala penjuru. Akan tetapi penduduknya mengingkari kenikmatan-kenikmatan yang telah Allah berikan kepada mereka dan menyekutukan-Nya, maka Allah menghukum mereka dengan kekeringan dan ketakutan dari pasukan Rasulullah akibat kekafiran dan kemaksiatan mereka itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "112. وَضَرَبَ اللهُ مَثَلًا قَرْيَةً (Dan Allah telah membuat suatu perumpamaan (dengan) sebuah negeri) Ini merupakan perumpamaan yang menggambarkan penduduk negeri-negeri yang zalim yang Allah buat bagi penduduk Makkah agar kaum Quraisy dapat mengambil pelajaran darinya sehingga mereka tidak terus-menerus dalam kesesatan. Pendapat lain mengatakan bahwa yang dimaksud dengan negeri tersebut adalah negeri Makkah itu sendiri, yang Allah jadikan perumpamaan bagi penduduk negeri lain; hal ini setelah Rasulullah mendoakan keburukan bagi mereka dengan doanya: “Ya Allah, kuatkanlah tekananmu atas Bani Mudhar (penduduk Makkah), dan turunkanlah kepada mereka paceklik seperti paceklik yang terjadi pada zaman Nabi Yusuf.” Maka terjadilah kekeringan sampai mereka hanya bisa memakan tulang. Perumpamaan ini adalah sebagai peringatan bagi selain penduduk Makkah agar tidak menimpa mereka apa yang telah menimpa penduduk Makkah. كَانَتْ ءَامِنَةً مُّطْمَئِنَّةً(yang dahulunya aman lagi tenteram) Yakni penduduknya tidak merasa takut atau terganggu. يَأْتِيهَا رِزْقُهَا رَغَدًا مِّن كُلِّ مَكَانٍ(rezekinya datang kepadanya melimpah ruah dari segenap tempat) Yakni rezeki yang luas dari setiap tempat sumber rezeki. فَكَفَرَتْ(tetapi (penduduk)nya mengingkari) Yakni penduduknya mengingkari. بِأَنْعُمِ اللهِ(nikmat-nikmat Allah) Yang Allah berikan kepada mereka. Dan keingkaran mereka merupakan bentuk kekafiran mereka kepada Allah dan pendustaan mereka terhadap para rasul-Nya. فَأَذٰقَهَا اللهُ لِبَاسَ الْجُوعِ وَالْخَوْفِ(karena itu Allah merasakan kepada mereka pakaian kelaparan dan ketakutan) Yakni penampakan yang terlihat dari mereka adalah kurus, pucat, dan memprihatinkan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Sungguh sangat salah orang yang mengira bahwa sebidang tanah akan melindungi pemiliknya dari malapetaka karena dianggap di tanah itu kuburan orang shalih atau wali, sebaik-baik tanah adalah Makkah, namun orang berdosa di dalamnya juga telah diazab oleh Allah, Allah befirman: { وَضَرَبَ اللَّهُ مَثَلًا قَرْيَةً كَانَتْ آمِنَةً مُطْمَئِنَّةً يَأْتِيهَا رِزْقُهَا رَغَدًا مِنْ كُلِّ مَكَانٍ فَكَفَرَتْ بِأَنْعُمِ اللَّهِ فَأَذَاقَهَا اللَّهُ لِبَاسَ الْجُوعِ وَالْخَوْفِ بِمَا كَانُوا يَصْنَعُونَ } \"Dan Allah telah membuat suatu perumpamaan (dengan) sebuah negeri yang dahulunya aman lagi tenteram, rezekinya datang kepadanya melimpah ruah dari segenap tempat, tetapi (penduduk)nya mengingkari nikmat-nikmat Allah; karena itu Allah merasakan kepada mereka pakaian kelaparan dan ketakutan, disebabkan apa yang selalu mereka perbuat\". 2 ). Perhatikan hikmah dari didahulukannya \"al-Amnu\" sebelum \"ath-Thuma'ninah\" dalam firman Allah : { وَضَرَبَ اللَّهُ مَثَلًا قَرْيَةً كَانَتْ آمِنَةً مُطْمَئِنَّةً } \"Dan Allah telah membuat suatu perumpamaan (dengan) sebuah negeri yang dahulunya aman lagi tenteram\"; hal itu karena ketentraman tidak diraih tanpa adanya rasa aman, sebagaimana ketakutan menyebabkan kegelisahan dan kegalauan, dan pada firman Allah : { فَأَذَاقَهَا اللَّهُ لِبَاسَ الْجُوعِ وَالْخَوْفِ بِمَا كَانُوا يَصْنَعُونَ } rahasia yang menakjubkan; yaitu bahwasanya penisbatan pakaian kepada rasa lapar dan takut telah menjad hal yang lumrah yang sering dirasaan oleh sebagian besar manusia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "112. Allah membuat perumpamaan bagi setiap kaum yang diberi nikmat olehNya, lalu nikmat itu membuat mereka angkuh, kemudian ingkar. Dan mereka itu bukanlah penduduk Mekah. (menurut Ar-Razi) negeri mereka itu aman dari musuh, tenang, nyaman, penduduknya tidak khawatir, tidak merasa kesulitan sedikitpun. Negeri itu diberi rejeki yang melimpah ruah dari segala sisi. Kemudian penduduknya mengingkari nikmat Allah yang telah diberikan kepada mereka. Lalu kemudian mereka semua ditimpa kelaparan, kemiskinan, ketakutan dan kepanikan. Penderitaan mereka bertambah dahsyat akibat kekufuran dan pengingkaran mereka terhadap nikmat dengan tidak mau bersyukur kepada Tuhan mereka, melupakan keutamaanNya, dan permintaan pertolongan mereka terhadap selainNya. Perumpamaan ini adalah pelajaran bagi setiap negeri"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah telah membuat perumpamaan sebuah negeri yang dahulu aman dan tenteram} tenang {yang rezekinya datang secara berlimpah} dengan nyaman dan mudah {dari setiap tempat, tetapi (penduduknya) mengingkari nikmat-nikmat Allah. Maka Allah menimpakan kepada mereka bencana kelaparan dan ketakutan karena apa yang selalu mereka perbuat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "112-113. Negeri yang dimaksud ini adalah Makkah al-Mukarramah, yang sebelumnya diliputi rasa aman dan ketentraman, tidak ada seorang pun terusik di tempat itu. Bangsa Jahiliyah yang berkubang dalam kebodohan pun menghormatinya. Bahkan (penghormatan mereka sampai pada level bila) salah seorang dari mereka menjumpai pembunuh ayah atau pembunuh saudaranya, maka ia tidak akan mengusiknya, kendatipun patriotism mereka begitu dahsyat dan sikap arogansi Arab masih ada. Maka tumbuhlah rasa aman yang sempurna di sana yang tidak terjadi di tempat lain. Begitu pula rizki yang melimpah. Sebelumnya, Makkah merupakan kota tanpa tanaman, atau pepohonan. Akan tetapi, Allah memudahkan rizki datang kepadanya dari setiap penjuru. Lantas, datang seorang rasul kepada mereka dari kalangan mereka sendiri, yang mereka ketahui sifat amanah dan kejujurannya, mengajak mereka kepada perkara yang paling sempurna, melarang dari hal-hal yang buruk. Tetapi, mereka mendustakannya dan mengingkari kenikmatan Allah atas mereka. Akibatnya, Allah menimpakan pada mereka keadaan yang berlawanan dengan kehidupan yang enak “dan ketakutan” yang berlawanan dengan stabilitas keamanan. Demikian itu, karena ulah dan kekufuran mereka serta sikap mereka yang tidak mensyukuri (nikmat Allah). Allah tidak menganiaya mereka. Akan tetapi, mereka itulah yang menganiaya diri mereka sendiri."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (مَثَلًا قَرۡيَةٗ) matsalan qaryah : Mekah. (رِزۡقُهَا رَغَدٗا) rizquhaa raghadaa : luas (فَكَفَرَتۡ بِأَنۡعُمِ ٱللَّهِ) fakafarat bi`an’umillah : mereka ingkar dengan Rasul, Al-Qur’an, keamanan, dan rezeki yang luas. (فَأَذَٰقَهَا ٱللَّهُ لِبَاسَ ٱلۡجُوعِ) fa adzâqahallaahu libaasal juu’ : karena peceklik yang menimpa mereka, sehingga mereka memakan kapas selama tujuh tahun. (وَٱلۡخَوۡفِ) wal khauf : karena kedatangan pasukan Islam yang menyerang mereka serta memotong jalur perdagangan mereka. Makna ayat: Firman-Nya “Dan Allah telah membuat suatu perumpamaan sebuah negeri” yaitu Mekah “dahulunya aman” dari serangan musuh “lagi tentram” tidak terganggu oleh kekhawatiran dan takut, karena Allah ta’ala menjadikan kota Mekah dan penduduknya sesuatu yang diagungkan oleh bangsa Arab. “rezeki datang melimpah ruah” luas “dari segenap tempat” datang dari Syam dan Yaman melalui perjalanan musim panas dan dingin mereka. “Tetapi penduduknya mengingkari nikmat-nikmat Allah” yaitu mendustakan Rasulullah shallallahu ‘alaihi wa sallam dan mengingkari tauhid, kokoh di atas kesyirikan, dan memerangi Islam “karena itu Allah menimpakan kepada mereka bencana kelaparan” Rasul mendoakan keburukan kepada mereka Ya Allah, berikanlah kepada mereka tahun-tahun kekeringan sebagaimana tujuh tahun Yusuf yang berat. Maka merekapun tertimpa kekeringan selama tujuh tahun, sehingga mereka kelaparan dan memakan bangkai dan kapas, serta mereka tertimpa ketakutan karena pasukan Islam telah menghadang jalur perdagangan mereka bahkan memerangi mereka di tengah negeri. Firman-Nya ta’ala “disebabkan apa yang mereka perbuat” Allah membalas mereka dengan kelaparan dan ketakutan karena perbuatan mereka yang merusak, yaitu menindas kaum muslimin, melakukan kesyirikan dan terus menerus melakukannya. Pelajaran dari ayat: • Wajib mengingatkan akan hari akhir, pahala, dan hukuman agar tidak rakus terhadap dunia dan bersegera menuju akhirat. • Ahli ilmu dianjurkan untuk membuat permisalan. • Ingkar akan nikmat akan menyebabkan hilangnya nikmat serta sebab datangnya hukuman bagi pelakunya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 112: Yaitu Mekah. Dari serangan musuh. Yakni tidak butuh pindah darinya karena sempit atau khawatir sesuatu. Dengan mendustakan Rasulullah shallallahu 'alaihi wa sallam yang mereka kenal amanah dan kejujurannya. Maksudnya, kelaparan dan ketakutan itu meliputi mereka seperti halnya pakaian meliputi tubuh mereka. Mereka merasakan kemarau panjang selama tujuh tahun. Dengan sariyyah (pasukan kecil) yang dikirim Nabi shallallahu 'alaihi wa sallam. Berupa kufur dan tidak bersyukur. Allah tidaklah menzalimi mereka, akan tetapi merekalah yang menzalimi diri mereka sendiri. Ayat ini menunjukkan bahwa jalan keluar dari musibah yang menimpa di berbagai negeri adalah dengan bersyukur kepada Allah, yakni dengan beriman kepada rasul dan bertakwa kepada Allah (masuk Islam dan mengamalkan ajaran-ajarannya), dan bahwa musibah yang menimpa tidak lain disebabkan melakukan yang sebaliknya, lihat pula surah Al A’raaf: 96-99, surah Saba’: 15-17, dan surah Yunus: 98. Ada banyak faidah dari musibah, di antaranya sebagai penebus dosa bagi orang mukmin, sebagai azab bagi orang kafir, dan sebagai pelajaran bagi orang-orang yang masih hidup agar mereka tidak melakukan hal yang sama. Orang yang cerdas adalah orang yang dapat mengambil pelajaran dari musibah yang menimpa orang lain."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 112",
    "description": "Jika ayat sebelumnya menjelaskan hukuman bagi orang yang mengingkari ayat-ayat Allah dan tanda-tanda kekuasaan-Nya di alam, maka pada ayat berikut Allah menyebut balasan bagi orang yang mengingkari nikmat-Nya. Allah berfirman, dan Allah telah membuat suatu perumpamaan berupa sebuah negeri yang dahulu penduduk-Nya merasa aman dari segala ancaman lagi tenteram dengan segala kesenangan hidup di dalamnya; rezeki datang kepadanya melimpah ruah dari segenap tempat dengan berbagai cara, tetapi penduduknya mengingkari nikmat-nikmat Allah, yakni tidak menggunakannya sesuai tuntunan Allah. Karena kedurhakaan itu, Allah mengubah kondisi mereka dengan menimpakan kepada mereka bencana kelaparan dan ketakutan, disebabkan apa yang mereka perbuat. Dan Allah tidak menimpakan azab itu secara tiba-tiba tanpa memberi peringatan sebelumnya. Allah menegaskan, sungguh, telah datang kepada mereka seorang rasul yang berasal dari kalangan mereka sendiri untuk mengingatkan mereka. Mereka mengenalnya dengan baik; bagaimana asal-usulnya dan kepribadiannya yang mulia, tetapi mereka mendustakan, mengingkari, dan menolak peringatan yang disampaikan-Nya sebagaimana kalian, wahai kaum musyrik mekah, melakukan hal yang sama. Karena kedurhakaan itu mereka ditimpa azab, dan mereka adalah orang yang zalim kepada diri mereka sendiri."
  }
]