[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sungguh Allah telah mengutus kepada penduduk makkah seorang rasul dari kalangan mereka sendiri, yaitu nabi Muhammad , yang mereka kenal garis nasabnya, kejujuran dan amanahnya, namun mereka enggan menerima risalah yang dibawa olehnya dan tidak mengimaninya, maka hukuman menerjang mereka, berupa kesengsaraan-kesengsaaraan hiidup, kelaparan, cekaman rasa takut dan terbunuhnya para pembesar mereka di perang badar, sedang mereka adalah orang-orang zhalim terhadap diri mereka dengan kesyirikan kepada Allah dan menghalangi (orang) dari jalan Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "113. Telah datang kepada penduduk Makkah seorang Rasul dari kalangan mereka sendiri, mereka mengenalnya amanah dan jujur, dialah Muhammad -ṣallallāhu 'alaihi wa sallam-, tetapi mereka mendustakannya tentang risalah yang diturunkan oleh Tuhannya kepadanya, maka azab Allah turun menimpa mereka berupa kelaparan dan ketakutan. Mereka adalah orang-orang yang menzalimi diri mereka dengan menjerumuskan diri mereka ke dalam kubangan kebinasaan manakala mereka menyekutukan Allah dan mendustakan Rasul-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "113. Sungguh seorang rasul dari kaum mereka telah datang kepada mereka yaitu Nabi Muhammad, akan tetapi mereka mendustakan dan memusuhinya sehingga mereka ditimpa azab kelaparan, ketakutan, dan terbunuhnya para pemimpin mereka pada Perang Badar. Dan mereka adalah orang-orang yang zalim terhadap hak-hak orang lain."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "113. وَلَقَدْ جَآءَهُمْ (Dan sesungguhnya telah datang kepada mereka) Yakni kepada penduduk Makkah atau penduduk negeri yang dijadikan perumpamaan ini. رَسُولٌ مِّنْهُمْ(seorang rasul dari kaum mereka sendiri) Yakni dari golongan mereka; mereka mengenalnya dan mengetahui nasabnya. فَكَذَّبُوهُ(tetapi mereka mendustakannya) Terhadap risalah yang ia bawa. فَأَخَذَهُمُ الْعَذَابُ(karena itu mereka dimusnahkan azab) Azab dari Allah yang menimpa mereka. وَهُمْ ظٰلِمُونَ (dan mereka adalah orang-orang yang zalim) Zalim kepada diri mereka sendiri karena menjerumuskan diri mereka ke dalam azab yang kekal."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "113. Dan sungguh telah datang kepada penduduk Mekah seorang rasul dari golongan mereka yang telah diketahui dengan benar, lalu mereka mendustakan apa yang dia bawa, kemudian azab dari Allah menimpa mereka, yaitu kelaparan dan ketakutan. Mereka itu menzalimi diri sendiri dengan mengarahkan dirinya kepada azab yang abadi"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh telah datang kepada mereka seorang rasul dari (kalangan) mereka} rasul dari jenis mereka yang mereka kenal asal mula dan nasabnya, yaitu nabi Muhammad SAW {tetapi mereka mendustakannya. Maka mereka ditimpa azab dan mereka itulah orang-orang zalim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "112-113. Negeri yang dimaksud ini adalah Makkah al-Mukarramah, yang sebelumnya diliputi rasa aman dan ketentraman, tidak ada seorang pun terusik di tempat itu. Bangsa Jahiliyah yang berkubang dalam kebodohan pun menghormatinya. Bahkan (penghormatan mereka sampai pada level bila) salah seorang dari mereka menjumpai pembunuh ayah atau pembunuh saudaranya, maka ia tidak akan mengusiknya, kendatipun patriotism mereka begitu dahsyat dan sikap arogansi Arab masih ada. Maka tumbuhlah rasa aman yang sempurna di sana yang tidak terjadi di tempat lain. Begitu pula rizki yang melimpah. Sebelumnya, Makkah merupakan kota tanpa tanaman, atau pepohonan. Akan tetapi, Allah memudahkan rizki datang kepadanya dari setiap penjuru. Lantas, datang seorang rasul kepada mereka dari kalangan mereka sendiri, yang mereka ketahui sifat amanah dan kejujurannya, mengajak mereka kepada perkara yang paling sempurna, melarang dari hal-hal yang buruk. Tetapi, mereka mendustakannya dan mengingkari kenikmatan Allah atas mereka. Akibatnya, Allah menimpakan pada mereka keadaan yang berlawanan dengan kehidupan yang enak “dan ketakutan” yang berlawanan dengan stabilitas keamanan. Demikian itu, karena ulah dan kekufuran mereka serta sikap mereka yang tidak mensyukuri (nikmat Allah). Allah tidak menganiaya mereka. Akan tetapi, mereka itulah yang menganiaya diri mereka sendiri."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat: Firman-Nya ta’ala “dan sungguh, telah datang kepada mereka seorang rasul dari kalangan mereka sendiri” yaitu Muhammad shallallahu ‘alaihi wa sallam “tetapi mereka mendustakannya” menentang risalahnya, menentang kenabiannya, dan memerangi dakwahnya “karena itu mereka ditimpa azab” azab kelaparan dan rasa takut dalam keadaan “mereka adalah orang yang zalim.” Yaitu berbuat syirik dan zalim terhadap diri mereka sendiri, karena kekufuran mereka mengantarkan diri mereka munju azab kelaparan dan rasa takut. Pelajaran dari ayat: • Mendustakan apa yang dibawa Rasulullah shallallahu ‘alaihi wa sallam, sekalipun hanya enggan mengamalkannya akan membawa petaka dan azab."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 113: Yakni Nabi Muhammad shallallahu 'alaihi wa sallam. Yakni kelaparan dan ketakutan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 113",
    "description": "Dan Allah tidak menimpakan azab itu secara tiba-tiba tanpa memberi peringatan sebelumnya. Allah menegaskan, sungguh, telah datang kepada mereka seorang rasul yang berasal dari kalangan mereka sendiri untuk mengingatkan mereka. Mereka mengenalnya dengan baik; bagaimana asal-usulnya dan kepribadiannya yang mulia, tetapi mereka mendustakan, mengingkari, dan menolak peringatan yang disampaikan-Nya sebagaimana kalian, wahai kaum musyrik mekah, melakukan hal yang sama. Karena kedurhakaan itu mereka ditimpa azab, dan mereka adalah orang yang zalim kepada diri mereka sendiri. Agar azab Allah tidak menimpa kamu lantaran tidak mensyukuri nikmat-Nya, maka janganlah kamu, wahai orang mukmin, berbuat seperti halnya orang musyrik, dan makanlah yang halal lagi baik, lezat, bergizi, sesuai, dan bermanfaat bagi tubuh dan kesehatan dari rezeki yang telah diberikan Allah kepadamu, dan syukurilah nikmat yang telah Allah anugerahkan kepada kamu dengan memanfaatkannya sesuai tuntunan Allah, jika kamu benar-benar hanya menyembah kepada-Nya sebagai perwujudan imanmu."
  }
]