[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka makanlah wahai oarang-orang mukmin, dari apa yang Allah rizkikan kepada kalian dan menjadikannya halal lagi baik bagi kalain, dan syukurilah nikmat-nikmat Allah yang terlimpah pada kalian, dengan mengakuinya dan mempergunakannya dalam ketaatan kepada Allah, jika kalian adalah orang-orang yang tunduk kepada perintahNya, juga mendengar dan taat kepadaNya, kalian hanya beribadah kepadaNya semata, tidak ada sekutu bagiNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "114. Makanlah wahai hamba-hamba dari apa yang Allah -Subḥānahu- rezekikan kepada kalian selama ia halal dari jenis yang baik untuk dimakan, syukurilah nikmat Allah yang Dia berikan kepada kalian dengan mengakuinya bahwa itu adalah dari Allah dan memakainya untuk hal-hal yang Allah ridai bila kalian menyembah Allah semata tidak menyekutukan-Nya dengan sesuatu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "114-115. Hai orang-orang beriman, makanlah makanan-makanan yang halal dan lezat yang telah Kami berikan kepada kalian, dan bersyukurlah kepada Allah atas segala kenikmatan-Nya dengan perkataan dan perbuatan jika kalian benar-benar mentaati-Nya dan hanya menyembah-Nya Semata. Allah telah mengharamkan atas kalian bangkai yang tidak disembelih sesuai syariat, yaitu selain bangkai hewan laut dan belalang. Dan Allah mengharamkan bagi kalian darah yang memancar kecuali hati dan limpa, dan juga mengharamkan daging babi dan hewan yang disembelih untuk selain Allah. Dan barangsiapa yang berada dalam keadaan yang sangat lapar namun tidak mendapatkan makanan halal sedikitpun sehingga memaksanya memakan makanan-makanan yang haram tersebut tanpa berlebih-lebihan dan melewati batas kedaruratannya, maka tidak berdosa baginya memakan makanan tersebut. Sungguh Allah Maha Mengampuni dosa-dosa para hamba-Nya dan Maha Mengasihi mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "114. فَكُلُوا۟ مِمَّا رَزَقَكُمُ اللهُ حَلٰلًا طَيِّبًا (Maka makanlah yang halal lagi baik dari rezeki yang telah diberikan Allah kepadamu) Yakni makanlah makanan yang halal dan baik yang Allah ciptakan bagi kalian yang tidak Allah haramkan; dan tinggalkanlah makanan yang buruk yaitu makanan yang Allah haramkan atas kalian seperti bangkai dan darah. وَاشْكُرُوا۟ نِعْمَتَ اللهِ(dan syukurilah nikmat Allah) Yang telah Allah berikan kepada kalian, dan ketahuilah hak dari kenikmatan itu (yakni rasa syukur). إِن كُنتُمْ إِيَّاهُ تَعْبُدُونَ(jika kamu hanya kepada-Nya saja menyembah) Dan tidak menyembah selain-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "114. Wahai orang-orang mukmin, makanlah dari rejeki Allah yang diberikan kepada kalian yang halal lagi baik, dan menjauhlah dari kotoran-kotoran seperti bangkai dan darah, lalu bersyukurlah atas nikmat Allah yang diberikan kepada kalian dengan menaatiNya, jika kalian hanya menyembah kepadaNya dan ikhlas dalam menyembahNya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Makanlah sebagian apa yang telah dianugerahkan Allah kepada kalian yang halal lagi baik dan syukurilah nikmat Allah jika kalian hanya menyembah kepadaNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "114. Allah memerintahkan para hambaNya untuk mengonsumsi rizki yang telah Allah berikan, yang berbentuk binatang, biji-bijian, buah-buahan dan lainnya, “yang halal lagi baik,” yaitu keadaan yang memenuhi dua sifat ini, bukan termasuk yang diharamkan oleh Allah atau hasil dari ghasab dan cara perolehan yang buruk lainnya. Bersenang-senanglah dengan sesuatu yang Allah ciptakan bagi kalian tanpa unsur boros maupun melampaui batas. “Dan syukurilah nikmat Allah,” melalui pengakuan dengan hati, pujian kepada Allah atas nikmat itu dan menggunakannya dalam ketaatan kepada Allah “jika kamu menyembah hanya kepadaNYa saja,” maksudnya jika kalian benar-benar memurnikan ibadah bagiNya. Jangalah bersyukur kecuali kepadaNya dan jangan sekali-kali engkau melupakan Dzat Yang Memberi kenikmatan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (فَكُلُواْ) fakuluu : makanlah wahai manusia. (حَلَٰلٗا طَيِّبٗا) halaalan thayyibaa : tidak haram dan tidak kotor. (وَٱشۡكُرُواْ نِعۡمَتَ ٱللَّهِ) wasykuruu ni’matallah : bersyukurlah kepada Allah atas nikmat-Nya kepada kalian dengan beribadah hanya kepada-Nya, serta hanya memakan yang halal, tidak yang diharamkan untuk kalian. (إِن كُنتُمۡ إِيَّاهُ تَعۡبُدُونَ) inkuntum iyyaahu ta’buduun : jika kalian hanya beribadah hanya kepada-Nya, maka ikutilah perintah-Nya, makanlah dari apa yang dihalalkan dan tinggalkan apa yang diharamkan untuk kalian. Makna ayat: Allah azza wa jalla telah memberikan karunia kepada hamba-hamba-Nya, dengan mengizikan mereka untuk makan dari apa yang telah diberikan kepada mereka berupa yang halal dan baik, lalu bersyukur kepada-Nya dengan beribadah hanya kepada-Nya. Ini adalah keadaan orang yang hanya menyembah Allah ta’ala saja, ia bersyukur atas segala karunia-Nya. Pelajaran dari ayat: • Harus membalas nikmat dengan syukur. Dan tidak adil jika seorang hamba mengingkari nikmat-nikmat Allah ta’ala kepadanya, enggan bersyukur, berdzikir, memuji, dan menaati-Nya; melakukan perkara yang Allah cintai dan meninggalkan hal yang dimurkai-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 114: Yakni bersenang-senanglah dengan apa yang diciptakan Allah untuk kamu tanpa berlebihan dan melampaui batas. Yaitu dengan mengakuinya di hati, memuji Allah di lisan, dan mengarahkan nikmat itu untuk ketaatan kepada Allah Subhaanahu wa Ta'aala."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 114",
    "description": "Agar azab Allah tidak menimpa kamu lantaran tidak mensyukuri nikmat-Nya, maka janganlah kamu, wahai orang mukmin, berbuat seperti halnya orang musyrik, dan makanlah yang halal lagi baik, lezat, bergizi, sesuai, dan bermanfaat bagi tubuh dan kesehatan dari rezeki yang telah diberikan Allah kepadamu, dan syukurilah nikmat yang telah Allah anugerahkan kepada kamu dengan memanfaatkannya sesuai tuntunan Allah, jika kamu benar-benar hanya menyembah kepada-Nya sebagai perwujudan imanmu. Ketahuilah, wahai nabi Muhammad dan orang mukmin, bahwa sesungguhnya Allah hanya mengharamkan atasmu memakan bangkai, yaitu binatang yang mati tanpa disembelih, kecuali binatang air dan belalang. Dia juga mengharamkan kamu meminum darah yang mengalir, bukan yang membeku seperti limpa dan hati; memakan daging babi dan seluruh bagian tubuhnya, dan memakan hewan yang disembelih dengan menyebut nama selain Allah. Meski ketentuan Allah ini ketat, tetapi Allah juga memberi kelonggaran, yaitu barang siapa terpaksa memakannya akibat mengalami kondisi darurat, bukan karena menginginkannya dan tidak pula makan secara berlebihan dan melampaui batas yang diperbolehkan dalam kondisi demikian, maka dia tidaklah berdosa, karena sungguh, Allah maha pengampun atas kesalahan yang dilakukannya tanpa karena keinginannya sendiri, maha penyayang atas kesalahan yang sengaja dilakukannya, bila ia bertobat."
  }
]