[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya Allah hanya mengharamkan atas kalian bangkai binatang darah yang mengalir dari hewan sembelihan ketika disembelih, daging babi, dan binatang yang disembelih untuk selain Allah. Akan tetapi orang yang terjepit oleh keadaan darurat akibat raasa takut terhadap kematian sehingga terpaksa memakan sesuatu dari hal-hal yang diharamkan ini, sedang ia tidak berbuat kezhaliman, dan tidak berbuat melampaui batas kriteria keadaan darurat, maka sesunggguhnya Allah maha pengampun baginya lagi maha penyayang terhadapnya, tidak menghukumnya atas perbuatan yang ia lakukan itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "115. Allah mengharamkan sebagian makanan atas kalian berupa hewan yang mati tanpa disembelih padahal ia masuk jenis yang harus disembelih, darah yang mengalir, seluruh tubuh babi, dan hewan yang disembelih untuk mendekatkan diri kepada selain Allah. Pengharaman ini berlaku dalam kondisi lapang, karena itu barangsiapa terdesak oleh keadaan darurat untuk makan apa yang disebutkan ini, lalu dia makan tanpa ada keinginan untuk makan yang haram, tanpa melebihi batas kebutuhan maka ia tak berdosa atasnya, karena sesungguhnya Allah Maha Pengampun, mengampuninya atas apa yang dia makan, lagi Maha Penyayang kepadanya manakala Dia membolehkan untuknya hal itu dalam keadaan darurat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "115. إِنَّمَا حَرَّمَ عَلَيْكُمُ الْمَيْتَةَ وَالدَّمَ وَلَحْمَ الْخِنزِيرِ وَمَآ أُهِلَّ لِغَيْرِ اللهِ بِهِۦ ۖ (Sesungguhnya Allah hanya mengharamkan atasmu (memakan) bangkai, darah, daging babi dan apa yang disembelih dengan menyebut nama selain Allah) Tafsir dari ayat ini telah disebutkan dalam surat al-Baqarah: 173."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "115. Sesungguhnya Allah mengharamkan kalian untuk memakan bangkai yang mati tanpa disembelih tidak sesuai syariat kecuali ikan dan belalang, (diharamkan juga) darah yang mengalir selain hati dan limpa, daging babi dan lemaknya, dan hewan yang disembelih dengan nama selain Allah. Dan barangsiapa terpaksa memakan salah satu yang diharamkan itu karena sangat kelaparan, kehausan atau tersiksa tanpa adanya maksud memakannya dan tidak melewati batas keadaan darurat, maka sesungguhnya Allah Maha Pengampun dan Maha Penyayang orang yang makan karena terpaksa, sehingga dia tidak disalahkan atas apa yang diperbuat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya Allah hanya mengharamkan atas kalian bangkai, darah, daging babi, dan (hewan) yang disembelih dengan (menyebut) selain Allah. Siapa saja yang terpaksa bukan karena menginginkan dan tidak melampaui batas, sesungguhnya Allah Maha Pengampun lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "115. Sesungguhnya Alllah hanya mengharamkan atasmu,” hal-hal yang menyebabkan kemudaratan, dalam rangka membersihkan kalian, contohnya bangkai. Termasuk dalam kategori bangkai, semua binatang yang kematiannya tidak melalui penyembelihan syar’I, dengan pengecualian bangkai belalang dan ikan. “dan darah” yang mengalir. Sementara darah yang masih tersisa (menempel) di aliran-aliran darah dan daging, tidak masalah, “dan daging babi,” lantaran kekotoran dan keburukan yang terdapat padanya. Hal ini mencakup daging, lemak, dan seluruh bagian tubuhnya, “dan hewan yang disembelih dengan menyebut nama selain Allah,” seperti binatang yang disembelih untuk berhala-berhala, kuburan, dan lainnya, karena ia dimaksudkan untuk suatu kesyirikan. “Tetapi barangsiapa yang terpaksa memakannya,” yaitu memakan barang yang diharamkan, karena keadaan darurat menjeratnya dan khawatir akan binasa bila tidak makan, maka tidak masalah baginya (untuk memakannya) selama tidak berbuat aniaya dan tidak pula melampaui batas. Maksudnya, tidak berkehendak makan yang haram ketika kondisi yang tidak memaksa, dan tanpa melampaui batas yang dihalalkan ke barang yang diharamkan, atau melewati batas dengan menambah kadar yang diperbolehkan dalam kondisi darurat. Inilah yang diharamkan oleh Allah dari barang-barang yang diperbolehkan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (ٱلۡمَيۡتَةَ) al-maitah : hewan yang mati bukan dengan disembelih secara syar’i. (وَٱلدَّمَ) wad dam : darah yang mengalir tidak bercampur dengan daging atau tulang. (وَمَآ أُهِلَّ لِغَيۡرِ ٱللَّهِ بِهِۦۖ) wa maa uhilla lighairillahi bih : hewan yang disembelih dengan menyebut nama selain Allah. (غَيۡرَ بَاغٖ وَلَا عَادٖ) ghaira baaghin wa laa ‘aad : tidak menganiaya seseorang dan melampaui batas darurat. Makna ayat: Firman-Nya “Sesungguhnya Allah hanya mengharamkan atasmu bangkai, darah, daging babi, dan hewan yang disembelih dengan menyebut nama selain Allah” maka jangalah kalian mengharamkan apa yang tidak diharamkan atas kalian, seperti saa`ibah, bahirah, washilah yang dibuat-buat oleh kaum musyrikin sebagai kedustaan atas nama Allah. Firman-Nya “Barangsiapa yang terpaksa” di antara kalian, yaitu khawatir mati kelaparan, “tidak berlebihan” tidak menganiaya seseorang atau berpaling dari apa yang dihalalkan menuju kepada yang haram, hendaknya ia makan sekedar yang dapat menghilangkan lapar dan tidak ada dosa baginya “Sungguh Allah Maha Pengampun, Maha Penyayang.” Mengampuni orang yang terpaksa sebagaimana mengampuni orang yang bertaubat dan menyayangi orang yang terdesak, lalu membolehkannya untuk makan sesuatu yang haram untuk menghindari bahaya, sebagaimana Allah menyayangi orang yang bertaubat kepada-Nya. Pelajaran dari ayat: • Penjelasan makanan yang diharamkan, seperti; bangkai, darah, daging babi, dan apa yang disembelih selain menyebut nama Allah. • Penjelasan boleh memakan makanan haram yang telah disebutkan sebelumnya untuk menghindari kematian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 115: Sesuatu yang mengandung madharrat (bahaya), seperti bangkai, dst. Termasuk pula binatang yang matinya tanpa disembelih. Namun dikecualikan daripadanya bangkai ikan dan belalang. Yani darah yang mengalir. Adapun darah yang menempel di urat dan di daging, maka tidak mengapa. Baik dagingnya, lemaknya maupun anggota badannya yang lain. Termasuk pula yang disembelih untuk patung, kuburan dsb. Karena maksud daripadanya adalah perbuatan syirk. Di mana ia khawatir akan binasa jika tidak memakannya. Seperti melebihi batas darurat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 115",
    "description": "Ketahuilah, wahai nabi Muhammad dan orang mukmin, bahwa sesungguhnya Allah hanya mengharamkan atasmu memakan bangkai, yaitu binatang yang mati tanpa disembelih, kecuali binatang air dan belalang. Dia juga mengharamkan kamu meminum darah yang mengalir, bukan yang membeku seperti limpa dan hati; memakan daging babi dan seluruh bagian tubuhnya, dan memakan hewan yang disembelih dengan menyebut nama selain Allah. Meski ketentuan Allah ini ketat, tetapi Allah juga memberi kelonggaran, yaitu barang siapa terpaksa memakannya akibat mengalami kondisi darurat, bukan karena menginginkannya dan tidak pula makan secara berlebihan dan melampaui batas yang diperbolehkan dalam kondisi demikian, maka dia tidaklah berdosa, karena sungguh, Allah maha pengampun atas kesalahan yang dilakukannya tanpa karena keinginannya sendiri, maha penyayang atas kesalahan yang sengaja dilakukannya, bila ia bertobat. Usai merinci makanan yang diharamkan, Allah lalu melarang manusia mengatakan hal yang tidak berdasar atas nama Allah. Allah berfirman, dan janganlah kamu mengatakan terhadap apa yang disebutsebut oleh lidahmu secara dusta, baik tentang binatang maupun hal-hal lain, tanpa dasar dan tanpa merujuk pada ketentuan Allah dan rasulnya bahwa 'ini halal dan ini haram. Janganlah kamu mengatakan yang demikian itu untuk mengada-adakan kebohongan terhadap Allah. Ketahuilah bahwa sesungguhnya orang yang mengada-adakan kebohongan terhadap Allah tidak akan beruntung dan tidak akan membawa kebaikan bagi dirinya di dunia dan akhirat."
  }
]