[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan janganlah kalain (wahai kaum musyrikin) mengatakan pernyataan dusta yang disebut oleh lisan-lisan kalian bahwa ini halal terhadap perkara yang diharamkan Allah, dan ini haram terhadap perkara yang dihalalkan Allah demi mengadakan kebohongan atas nama Allah dengan menisbatkan penghalalan dan pengharaman itu kepadaNya. Sesungguhnya orang-orang yang mengada-adakan kedustaan atas nama Allah, mereka tidak akan beruntung mendapatkan kebaikan di dunia dan di akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "116. Jangan kalian mengatakan -wahai orang-orang musyrikin- berdasarkan apa yang diucapkan oleh lisan-lisan kalian berupa kebohongan atas nama Allah, “Ini halal dan itu haram”, dengan maksud membuat-buat kebohongan atas nama Allah dengan mengharamkan apa yang tidak Allah haramkan atau menghalalkan apa yang tidak Allah halalkan. Sesungguhnya orang-orang yang membuat kebohongan atas nama Allah tidak mendapatkan apa yang mereka inginkan, dan tidak selamat dari apa yang mereka khawatirkan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "116-117. Allah melarang untuk menghalalkan dan mengharamkan sesuatu tanpa dalil, maka janganlah kalian berkata: “Ini halal dan ini haram”, agar kalian membuat kedustaan terhadap Allah. Sungguh orang yang sengaja membuat kedustaan terhadap Allah tidak akan mendapat keberuntungan di dunia dan di akhirat; di dunia mereka dapat sedikit menikmati kenikmatan yang fana, akan tetapi di akhirat mereka akan mendapat azab yang pedih."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "116. وَلَا تَقُولُوا۟ لِمَا تَصِفُ أَلْسِنَتُكُمُ الْكَذِبَ (dan janganlah kamu mengatakan terhadap apa yang disebut-sebut oleh lidahmu secara dusta) Yakni janganlah kalian mengharamkan atau menghalalkan sesuatu dengan dasar pendapat yang kalian ucapakan tanpa adanya dalil; yakni dengan mengatakan “ini halal dan ini haram.” هٰذَا حَلٰلٌ وَهٰذَا حَرَامٌ لِّتَفْتَرُوا۟ عَلَى اللهِ الْكَذِبَ ۚ( “ini halal dan ini haram”, untuk mengada-adakan kebohongan terhadap Allah) Sehingga hal ini menjadi kedustaan kalian terhadap Allah dengan menghalalkan atau mengharamkan sesuatu, dan menyandarkan perkataan tersebut kepada Allah padahal itu bukan dari Allah. Pengharaman, penghalalan, dan pensyariatan hukum-hukum agama adalah hak Allah semata; tidak ada seorangpun yang boleh mensyariatkan sendiri agamanya. Apabila ada orang yang mensyariatkan sendiri agamanya kemudian ia menisbatkannya kepada Allah maka baginya dosa kebohongan terhadap Allah dan dosa telah menghalalkan dan mengharamkan sesuatu. إِنَّ الَّذِينَ يَفْتَرُونَ عَلَى اللهِ الْكَذِبَ لَا يُفْلِحُونَ (Sesungguhnya orang-orang yang mengada-adakan kebohongan terhadap Allah tiadalah beruntung) Dan dalam ayat yang lain disebutkan bahwa orang-orang yang mengada-adakan kebohongan terhadap Allah adalah orang-orang yang paling besar kezalimannya. Yaitu dalam firman-Nya: ومن أظلم ممن افترى على الله كذبا “Dan siapakah yang lebih aniaya daripada orang yang membuat-buat suatu kedustaan terhadap Allah” (al-An’am: 21) Makna (الفلاح) yakni dapat meraih sesuatu yang dituju. Terdapat sebuah riwayat dari Abu Nadhrah menyebutkan bahwa ia berkata: “aku membaca ayat dalam surat an-Nahl ini, sehingga sampai sekarang aku masih takut untuk memberi fatwa.” Sungguh tepat perkataannya ini, sebab ayat ini dengan keumuman lafadznya mencakup setiap orang yang memberi fatwa yang tidak sesuai dengan apa yang ada dalam al-Qur’an dan sunnah Rasulullah; seperti yang banyak dilakukan oleh orang-orang yang lebih mengutamakan pendapat akalnya daripada al-Qur’an dan sunnah Rasulullah, atau orang-orang yang tidak memiliki ilmu tentang al-Qur’an dan sunnah Rasulullah, mereka sangat layak untuk dicegah dari memberi fatwa dan dari kebodohan mereka sebab mereka telah berfatwa tanpa dasar pengetahuan, petunjuk, dan kitab, sehingga mereka menjadi sesat dan menyesatkan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Ketika satu ayat merubah arah hidup seseorang, diriwayatkan dari Abi Nudhroh beliau berkata : tatkala aku membaca ayat ini, samapi saat ini aku terus takut dalam berfatwa."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "116. Wahai manusia, janganlah kalian mengharamkan dan menghalalkan sesuatu hanya dengan menggunakan lisan tanpa menunjukkan dalil, sehingga kalian berkata: “Ini halal dan ini haram, sedangkan Allah tidak menghalalkan dan tidak mengharamkannya, supaya kalian bisa menisbahkan suatu kebohongan kepada Allah. Sesungguhnya orang-orang yang merekayasa kebohongan atas nama Allah, maka tidak akan mendapatkan apa yang mereka inginkan.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Janganlah mengatakan terhadap apa yang diucapkan} disebutkan {oleh lidahmu secara bohong,“Ini halal dan ini haram,” agar kalian bisa mengada-adakan} membuat-buat {kebohongan terhadap Allah. Sesungguhnya orang-orang yang mengada-adakan} membuat-buat {kebohongan terhadap Allah tidak akan beruntung"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "116. “Dan janganlah kamu mengatakan terhadap apa yang disebut-sebut oleh lidahmu secara dusta, ‘Ini halal dan ini haram’ .” maksudnya janganlah kalian mengharamkan dan menghalalkan sendiri sebagai bentuk kedustaan, kebohongan dan mengada-adakan perkataan atas Nama Allah “untuk mengada-adakan kebohongan terhadap Allah. Sesungguhnya orang yang mengada-adakan kebohongan terhadap Allah tiadalah beruntung,” di dunia maupun akhirat. Allah pasti akan memperlihatkan kehinaan mereka."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (وَلَا تَقُولُواْ لِمَا تَصِفُ أَلۡسِنَتُكُمُ ٱلۡكَذِبَ) wa laa taquuluu lima tashifu alsinatukumul kadzib : janganlah kalian berdusta atas nama Allah, menghalalkan dan mengharamkan dengan lisan kalian, ini halal dan ini haram tanpa adanya hukum dari Allah ta’ala. Makna ayat: Firman-Nya “Dan janganlah kamu mengatakan terhadap apa yang disebut-sebut oleh lisanmu secara dusta “Ini halal dan ini haram” untuk mengada-adakan kebihingan terhadap Allah.” Allah melarang mereka mengharamkan dan menghalalkan sesuatu sekehendak mereka, seperti mengatakan bahwa sesuatu itu halal atau haram dengan berdusta, ini halal dan ini haram, sebagaimana yang dilakukan oleh orang-orang musyrik, mereka menghalalkan dan mengharamkan tanpa wahyu ilahi tidak pula syariat langit. Perbuatan dan kelakuan mereka ini semua berdasarkan mengada-ada dan dusta atas nama Allah. Dan orang yang berdusta atas nama Allah tidak akan beruntung selamanya, sesuai firman-Nya “Sesungguhnya orang yang mengada-adakan kebohongan terhadap Allah tidak akan beruntung. Pelajaran dari ayat: • Haram mengharamkan dan menghalalkan sesuatu tanpa dalil syar’I yang jelas, bukan perkiraan, kecuali dengan dugaan kuat akan keharamannya. • Haram berbuat dusta atas nama Allah, dan pelakunya tidak akan beruntung di akhirat kelak. Keberuntungannya di dunia, hanya serpihan kecil yang tidak ada gunanya. Itu jika ia beruntung di dunia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 116: Terhadap apa yang diharamkan Allah Subhaanahu wa Ta'aala. Terhadap apa yang dihalalkan Allah Subhaanahu wa Ta'aala, atau menghalalkan dan mengharamkan berasal dari dirinya. Baik di dunia maupun di akhirat, dan Allah akan menampakkan kehinaannya meskipun mereka bersenang-senang di dunia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 116",
    "description": "Usai merinci makanan yang diharamkan, Allah lalu melarang manusia mengatakan hal yang tidak berdasar atas nama Allah. Allah berfirman, dan janganlah kamu mengatakan terhadap apa yang disebutsebut oleh lidahmu secara dusta, baik tentang binatang maupun hal-hal lain, tanpa dasar dan tanpa merujuk pada ketentuan Allah dan rasulnya bahwa 'ini halal dan ini haram. Janganlah kamu mengatakan yang demikian itu untuk mengada-adakan kebohongan terhadap Allah. Ketahuilah bahwa sesungguhnya orang yang mengada-adakan kebohongan terhadap Allah tidak akan beruntung dan tidak akan membawa kebaikan bagi dirinya di dunia dan akhirat. Jika mereka mengada-adakan kebohongan terhadap Allah lalu memperoleh kebaikan, ingatlah bahwa sesungguhnya itu hanyalah kesenangan yang sedikit dan segera musnah; dan ingatlah pula bahwa setelah itu mereka akan mendapat azab yang pedih sebagai balasan atasnya."
  }
]