[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kekayaan mereka di dunia adalah kekayaan yang akan sirna lagi sedikit, dan bagi mereka di akhirat siksaan yang menyakitkan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "117. Bagi mereka kesenangan yang sedikit dan rendah, hasil dari hawa nafsu yang mereka ikuti, dan bagi mereka azab yang pedih pada hari Kiamat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "117. مَتٰعٌ قَلِيلٌ (kesenangan yang sedikit) mereka mendapatkan sedikit kesenangan dengan perkataan mereka yang menghalalkan dan mengharamkan sesuai hawa nafsu mereka. وَلَهُمْ عَذَابٌ أَلِيمٌ (dan bagi mereka azab yang pedih) Yang mereka masuki di akhirat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "117. Bagi mereka itu sedikit nikmat yang akan sirna di dunia. Dan bagi mereka itu azab yang sangat pedih di akhirat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kesenangan yang sedikit dan bagi mereka azab yang pedih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "117. Jika mereka sempat bersenang-senang di dunia, maka sesungguhnya “itu (adalah) kesenangan yang sedikit,” dan tempat kembali mereka adalah neraka “dan mereka mendapatkan azab yang pedih.”"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat: Kesenangan yang sedikit” sekalipun mereka bersenang-senang sedikit dengan harta, anak keturunan, kemuliaan, dan kekuasaan, itu semua hanyalah kesenangan yang sangat sedikit sekali. Seorang yang memiliki ini tidak serta merta dianggap sebagai orang yang bahagia dan beruntung, karena apa yang akan ia hadapi adalah azab akhirat yang pedih lagi abadi yang tidak ada habisnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 117: Di dunia. Di akhirat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 117",
    "description": "Jika mereka mengada-adakan kebohongan terhadap Allah lalu memperoleh kebaikan, ingatlah bahwa sesungguhnya itu hanyalah kesenangan yang sedikit dan segera musnah; dan ingatlah pula bahwa setelah itu mereka akan mendapat azab yang pedih sebagai balasan atasnya. Dan ingatlah, wahai nabi Muhammad, bahwa terhadap orang yahudi kami haramkan banyak hal, di antaranya apa yang telah kami ceritakan dahulu kepadamu di ayat yang lain (al-an'a'm/6: 146). Kami tidak menzalimi mereka dengan mengharamkan semua itu, justru merekalah yang menzalimi diri sendiri dengan berbuat berbagai kemaksiatan."
  }
]