[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan terhadap orang-orang yahudi, kami mengharamkan apa yang telah kami beritahukan kepadamu (wahai rasul) sebelumnya, yaitu setiap binatang yang berkuku, lemak-lemak sapi dan kambing, kecuali apa yang melekat pada punggung-punggung dan usus besarnya atau yang bercampur dengan tulang. Dan kami tidaklah menzhalimi mereka dengan mengharamkan itu bagi mereka, akan tetapi mereka itu telah menzhalimi diri mereka dengan kekafiran dan tindakan melampaui batas, sehingga mereka pantas atas diharamkan semua itu sebagai hukuman bagi mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "118. Dan untuk orang-orang Yahudi secara khusus, Kami mengharamkan apa yang telah Kami beritakan kepadamu, (sebagaimana dalam surah Al-An'ām ayat 146). Kami tidak menzalimi mereka manakala Kami mengharamkan hal itu atas mereka, akan tetapi mereka adalah orang-orang yang menzalimi diri mereka sendiri ketika mereka melakukan hal-hal yang mendatangkan hukuman, maka Kami membalas mereka atas pelanggaran mereka, Kami mengharamkan hal itu bagi mereka sebagai hukuman atas mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "118. Dan Kami mengharamkan bagi orang-orang Yahudi apa yang telah Kami Sebutkan kepadamu sebelumnya pada surat Al-An'am ayat 146. Pada ayat itu disebutkan pengharaman segala hewan yang berkuku seperti burung unta dan unta, dan lemak sapi dan kambing. Kami tidak menzalimi mereka dengan pengharaman ini, akan tetapi merekalah yang telah menzalimi diri mereka sendiri dengan kekafiran dan pembangkangan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "118. وَعَلَى الَّذِينَ هَادُوا۟ حَرَّمْنَا (Dan terhadap orang-orang Yahudi, Kami haramkan) Yakni Kami haramkan atas mereka saja. مَا قَصَصْنَا عَلَيْكَ(apa yang telah Kami ceritakan dahulu kepadamu) Yakni dengan firman Kami: وَعَلَى الَّذِينَ هَادُوا حَرَّمْنَا كُلَّ ذِي ظُفُرٍ ۖ وَمِنَ الْبَقَرِ وَالْغَنَمِ حَرَّمْنَا عَلَيْهِمْ شُحُومَهُمَا إِلَّا مَا حَمَلَتْ ظُهُورُهُمَا أَوِ الْحَوَايَا أَوْ مَا اخْتَلَطَ بِعَظْمٍ ۚ ذَٰلِكَ جَزَيْنَاهُمْ بِبَغْيِهِمْ ۖ وَإِنَّا لَصَادِقُونَ “Dan kepada orang-orang Yahudi, Kami haramkan segala binatang yang berkuku dan dari sapi dan domba, Kami haramkan atas mereka lemak dari kedua binatang itu, selain lemak yang melekat di punggung keduanya atau yang di perut besar dan usus atau yang bercampur dengan tulang. Demikianlah Kami hukum mereka disebabkan kedurhakaan mereka; dan sesungguhnya Kami adalah Maha Benar.” (Al-An’am: 146) Yakni inilah makanan-makanan yang diharamkan Allah dalam al-Qur’an dan Taurat; lalu dari mana kalian dapat mengharamkan selain makanan-makanan tersebut? وَمَا ظَلَمْنٰهُمْ (dan Kami tiada menganiaya mereka) Yakni Kami tidak menzalimi orang-orang Yahudi dengan mengharamkan hal-hal ini, namun ini merupakan balasan atas kedurhakaan mereka. وَلٰكِن كَانُوٓا۟ أَنفُسَهُمْ يَظْلِمُونَ(akan tetapi merekalah yang menganiaya diri mereka sendiri) Sebab mereka melakukan perbuatan-perbuatan yang menyebabkan pengharaman itu, sehingga Kami haramkan atas mereka sebagi hukuman bagi mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "118. Dan Kami mengharamkan khusus untuk orang-orang Yahudi, bukan selain mereka terkait apa yang Kami kisahkan kepadamu sebelumnya di surah Al-An’am [6/146] berupa makanan-makanan yang diharamkan Allah di Taurat. Dan Kami tidak menzalimi mereka dengan mengharamkan hal itu, namun mereka menzalimi diri sendiri dengan melakukan kemaksiatan yang mengakibatkan suatu pengharaman. Dan pengharaman itu merupakan akibat yang mereka terima"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Terhadap orang Yahudi} orang-orang Yahudi {Kami mengharamkan apa yang telah Kami ceritakan kepadamu sebelumnya. Kami tidak menzalimi mereka, tetapi merekalah yang menzalimi diri sendiri"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "118. Tidaklah Allah mengharamkan sesuatu melainkan pasti itu adalah hal-hal yang buruk sebagai bentuk kemurahan dariNya dan perlindungan (bagi kalian) dari segala yang menjijikkan. Sedangkan orang-orang Yahudi, Allah mengharamkan barang-barang yang baik atas mereka yang sebelumnya halal bagi mereka, lantaran ulah kezhaliman mereka dan sebagai hukuman bagi mereka. Sebagaimana telah Allah ceritakan kisah ini dalam Surat al-An’am ayat 146. \"Dan kepada orang-orang Yahudi, Kami haramkan segala binatang yang berkuku dan dari sapi dan domba, Kami haramkan atas mereka lemak dari kedua binatang itu, selain lemak yang melekat di punggung keduanya atau yang di perut besar dan usus atau yang bercampur dengan tulang. Demikianlah Kami hukum mereka disebabkan kedurhakaan mereka; dan sesungguhnya Kami adalah Maha Benar.\" (QS. al-An’am ayat 146)"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (وَعَلَى ٱلَّذِينَ هَادُواْ) wa ‘alal ladziina haaduu : Yahudi (حَرَّمۡنَا مَا قَصَصۡنَا عَلَيۡكَ مِن قَبۡلُۖ) harramnaa maa qashashnaa ‘alaika min qabl : yaitu pada surat Al-An’am. Makna ayat: Firman-Nya “Idan terhadap orang Yahudi, Kami haramkan apa yang telah Kami ceritakan kepadamu (Muhammad).” Allah ta’ala mengajak bicara Rasul-Nya seraya berfirman, sebagaimana Kami telah mengharamkan untuk umat ini bangkai, darah, babi, dan hewan yang disembelih dengan nama selain Allah, Kami juga mengharamkan untuk Yahudi apa yang telah Kami ceritakan kepadamu sebelumnya pada surat Al-An’am, firman-Nya “Dan kepada orang-orang Yahudi, Kami haramkan kepada mereka lemak sapi dan domba, kecuali yang melekat di punggungnya atau dalam isi perut, atau yang bercampur dengan tulang.” Allah mengharamkan ini semua di sebabkan kezaliman mereka, Allah pun menghukum mereka dengan mengharamkan yang baik-baik untuk mereka yang dihalalkan untuk hamba-hamba-Nya yang beriman. Oleh karena itu Allah ta’ala berfirman “Kami tidak menzalimi mereka, justru merekalah yang menzlimi diri sendiri.” Pelajaran dari ayat: • Terkadang seorang hamba terhalang dari sesuatu yang halal di karenakan kezalimannya. Betapa banyak umat Islam terhalang dari kenikmatan karena kezaliman yang mereka lakukan di masa kemundurannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 118: Allah Subhaanahu wa Ta'aala tidaklah mengharamkan kepada kita kecuali yang kotor sebagai karunia-Nya. Adapun orang-orang Yahudi, maka kepada mereka Allah haramkan sesuatu yang baik yang sebelumnya dihalalkan kepada mereka sebagai hukuman terhadap kezaliman mereka. Lihat surat Al An'aam ayat 146. Dengan mengharamkan hal itu. Dengan mengerjakan maksiat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 118",
    "description": "Dan ingatlah, wahai nabi Muhammad, bahwa terhadap orang yahudi kami haramkan banyak hal, di antaranya apa yang telah kami ceritakan dahulu kepadamu di ayat yang lain (al-an'a'm/6: 146). Kami tidak menzalimi mereka dengan mengharamkan semua itu, justru merekalah yang menzalimi diri sendiri dengan berbuat berbagai kemaksiatan. Kemudian ketahuilah, wahai nabi, sesungguhnya tuhan-Mu selalu membuka pintu ampunan bagi orang yang mengerjakan kesalahan karena kebodohan dan kecerobohan mereka, kemudian mereka bertobat setelah itu dan memperbaiki dirinya dengan meninggalkan perbuatan dosa sembari mengerjakan amal saleh, sungguh, tuhanmu setelah itu, yakni setelah mereka tobat, benar-benar maha pengampun, maha penyayang."
  }
]