[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudain sesungguhnya tuhanmu terhadap orang-orang yang berbuat maksiat-maksiat saat dalam ketidaktahuannya tentang dampak buruknya dan penyebab datangnya kemurkaan dari Allah, (setiap orang yang berbuat maksiat kepada Allah tanpa sengaja atau disengaja, ia adalah orang bodoh ditinjau dari sisi ini walaupun ia mengetahui pengharamannya) kemudian mereka kembali kepada Allah dari dosa-dosa yang mereka perbuat dan memperbaiki diri dan perbuatan-perbuatan mereka, sesungguhnya tuhanmu (setelah mereka bertaubat dan memperbaiki diri) benar-benar mahapengampun lagi maha penyayang terhadap mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "119. Kemudian Rabbmu -wahai Rasul- kepada orang-orang yang melakukan keburukan-keburukan karena tidak tahu akibatnya sekalipun mereka sengaja melakukannya, lalu mereka bertobat kepada Allah sesudah melakukan keburukan-keburukan, memperbaiki amal perbuatan mereka yang rusak, sesungguhnya Rabbmu sesudah mereka bertobat Maha Pengampun bagi dosa-dosa mereka dan Maha Penyayang kepada mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "119. Hai Rasulallah, sesungguhnya orang-orang yang melakukan kemaksiatan karena ketidaktahuannya baik itu mereka lakukan secara Sengaja maupun tidak, kemudian mereka bertaubat dan memperbaiki amalannya; maka Tuhanmu -setelah pertobatan dan perbaikan amalan mereka- Maha Mengampuni dosa-dosa mereka dan Maha Mengasihi mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "119. ثُمَّ إِنَّ رَبَّكَ لِلَّذِينَ عَمِلُوا۟ السُّوٓءَ بِجَهٰلَةٍ (Kemudian, sesungguhnya Tuhanmu (mengampuni) bagi orang-orang yang mengerjakan kesalahan karena kebodohannya) Tafsir dari ayat ini telah disebutkan dalam surat an-Nisa: 17. ثُمَّ تَابُوا۟ مِنۢ بَعْدِ ذٰلِكَ(kemudian mereka bertaubat sesudah itu) Yakni setelah perbuatan buruk mereka. وَأَصْلَحُوٓا۟( dan memperbaiki (dirinya)) Yakni memperbaiki amalan mereka yang sebelumnya terdapat keburukan. إِنَّ رَبَّكَ مِنۢ بَعْدِهَا(sesungguhnya Tuhanmu sesudah itu) Yakni setelah pertaubatan itu benar-benar Maha Pengampun lagi Maha Penyayang."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "119. Wahai Nabi, sesungguhnya Tuhanmu itu Maha Pengampun bagi orang-orang yang berbuat syirik dan maksiat karena ketidaktahuan mereka terhadap akibatnya, kemudian mereka bertaubat setelah berbuat keburukan dan memperbaiki amal-amal buruk dan niat mereka yang kotor. Sesungguhnya Tuhanmu itu Maha Pengampun dan Maha Penyayang bagi orang yang bertaubat dari dosa dan kesalahan, sehingga mereka tidak disalahkan atas perbuatan sebelum bertaubat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kemudian sesungguhnya Tuhanmu terhadap orang-orang yang melakukan keburukan} keburukan {karena kebodohan} karena tidak menyadari dan tidak mengetahui akibatnya {lalu bertaubat dan memperbaiki} amal mereka dan beristoqamah setelah taubat mereka {Sesungguhnya Tuhanmu setelah itu benar-benar Maha Pengampun lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "119. Ini merupakan anjuran bagi para hamba untuk bertaubat kepada Allah dan ajakan bagi mereka untuk kembali (kepada Allah). Dia mengabarkan bahwa siapa saja yang berbuat keburukan, “karena kebodohannya,” maksudnya bodoh pada akibat buruk yang akan dia petik, meskipun dia sengaja melakukannya, maka sesungguhnya pasti ilmu yang ada di dalam hatinya berkurang saat berbuat dosa. Bila dia bertaubat dan memperbaiki diri, dengan meninggalkan dosa dan menyesalinya serta memperbaiki amalnya, maka sesungguhnya Allah akan mengampuninya dan merahmatinya serta menerima taubatnya dan mengembalikan dirinya kepada keadaan semula atau lebih tinggi."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (ثُمَّ إِنَّ رَبَّكَ لِلَّذِينَ عَمِلُواْ ٱلسُّوٓءَ بِجَهَٰلَةٖ) tsumma rabbaka lilladziina ya’amaluunas suu`a bi jahaalah : Sungguh Rabbmu Maha Pengampun, Maha Penyayang kepada orang-orang yang melakukan keburukan karena tidak tahu, kemudian mereka bertaubat. (مِنۢ بَعۡدِهَا) mim ba’dihaa : setelah ketidak tahuan dan taubat. Makna ayat: Setelah ayat-ayat membahas panjang lebar mengenai syirik dan pengingkaran kepada kebangkitan dan kenabian yang dilakukan oleh kaum musyrikin. Ketika surat ini hampir sampai pada akhirnya, Allah ta’ala membuka pintu taubat untuk mereka “Kemudian, sesungguhnya Rabbmu” dengan ampunan dan rahmat-Nya “kepada orang-orang yang mengerjakan kesalahan karena kebodohannya” mereka berbuat syirik kepada Allah, mengingkari wahyu, dan mendustakan pertemuan dengan-Nya “kemudian mereka bertaubat setelah itu” mereka mengesakan-Nya dalam ibadah, meyakini kenabian rasul-Nya, beriman dengan pertemuan dengan-Nya dan mempersiapkan untuk hal itu dengan amal-amal saleh “dan memperbaiki” apa yang dahulu telah mereka rusak berupa hati, amal, dan keadaan mereka “sungguh, Rabbmu setelah itu” setelah taubat yang benar “benar-benar Maha Pengampun, Maha Penyayang.” Kepada mereka, kabar gembira untuk mereka disampaikan melalui kitab Rabb mereka. Pelajaran dari ayat: • Pintu taubat selalu terbuka bagi setiap yang berdosa, baik banyak atau sedikit, dengan syarat; jujur dalam taubatnya, langsung berlepas dari dosa tersebut, menyesal, senantiasa memohon ampun, dan memperbaiki yang rusak."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 119: Ayat ini merupakan dorongan dari Allah Subhaanahu wa Ta'aala kepada hamba-hamba-Nya untuk bertobat, mengajak mereka kembali kepada-Nya dan tidak berputus asa. Seperti syirk. Dengan meninggalkan dosa itu dan menyesali perbuatannya. Yakni setelah tobat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 119",
    "description": "Kemudian ketahuilah, wahai nabi, sesungguhnya tuhan-Mu selalu membuka pintu ampunan bagi orang yang mengerjakan kesalahan karena kebodohan dan kecerobohan mereka, kemudian mereka bertobat setelah itu dan memperbaiki dirinya dengan meninggalkan perbuatan dosa sembari mengerjakan amal saleh, sungguh, tuhanmu setelah itu, yakni setelah mereka tobat, benar-benar maha pengampun, maha penyayangayat ini dan ayat-ayat berikutnya menjelaskan keteladanan nabi ibrahim yang selalu patuh kepada Allah dan mengikuti tuntunan-Nya. Sungguh, ibrahim adalah seorang imam, pemimpin, dan sosok panutan bagi umat-umat sesudahnya. Ia patuh kepada Allah dan mempunyai sifat hanif, yakni memegang teguh dan melaksanakan kebenaran, dan dia sejak dahulu dan secara terus-menerus bukanlah termasuk orang musyrik. Ia tidak pernah sekalipun menyekutukan Allah."
  }
]