[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Dia menundukan malam bagi kalian untuk waktu istirahat kalian dan siang hari untuk mencari kehidupan bagi kalian, dan Dia menundukan bagi kalian matahari yang bersinar yang menerangi dan bulan sebagai cahaya, serta guna mengetahui tahun-tahun dan perhitungan waktu dan manfaat-manfaat lainya, dan binatang-binatang dikendalikan bagi kalian berdasarkan perintah Allah untuk mngenali waktu-waktu, dan untuk mengetahi waktu masaknya buah-buahan dan hasil-hasil tanaman, serta sebagai arah petunjuk dalam kegelapan malam. Sesungguhnya dalam pengendalian semua itu terdapat petunjuk yang jelas bagi kaum-kaum yang memahami hujjah-hujjah dan bukti-bukti kebenaran dari Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Allah menundukkan malam agar kalian bisa beristirahat padanya dan mendapatkan ketenangan. Allah menundukkan siang untuk kalian agar kalian berusaha mendapatkan penghidupan. Allah menundukkan matahari untuk kalian dan menjadikannya bersinar dan Allah menjadikan rembulan bercahaya. Allah menundukkan bintang-bintang untuk kalian dengan perintah-Nya yang terukur dengan cermat, dengannya kalian terbimbing dalam kegelapan-kegelapan darat dan laut, dengannya kalian mengetahui waktu dan lainnya. Sesungguhnya di dalam penundukan semua itu mengandung petunjuk-petunjuk yang nyata atas kekuasaan Allah bagi kaum yang menggunakan akal mereka, mereka adalah orang-orang yang mengetahui hikmah di belakangnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "12. Dan Allah menundukkan siang dan malam bagi kalian, keduanya silih berganti sebagai waktu tidur dan mencari nafkah. Menundukkan matahari dan bulan yang beredar untuk kemaslahatan kalian, dan bintang-bintang yang beredar pada orbitnya dengan perintah Allah agar kalian dapat menggunakannya sebagai petunjuk dalam kegelapan ketika kalian berada di darat maupun di laut. Sungguh dalam penciptaan yang agung ini terdapat tanda-tanda yang dapat dilihat oleh orang-orang yang memikirkan keagungan Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "12. وَسَخَّرَ لَكُمُ الَّيْلَ وَالنَّهَارَ (Dan Dia menundukkan malam dan siang) Penundukannya bagi manusia adalah dengan menjadikannya bermanfaat bagi mereka sesuai dengan kemaslahatan mereka. Siang dan malam itu selalu silih berganti seperti seorang hamba yang taat pada tuannya. إِنَّ فِى ذٰلِكَ (Sesungguhnya pada yang demikian itu) Yakni dalam penundukan siang dan malam. لَاٰيٰتٍ لِّقَوْمٍ يَعْقِلُونَ(benar-benar ada tanda-tanda (kekuasaan Allah) bagi kaum yang memahami(nya)) Yakni yang menggunakan akal mereka untuk memahami tanda-tanda yang menunjukkan wujud Sang Pencipta dan keesaan-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12. Dia menundukkan malam dan siang agar dapat memberi manfaat, serta menundukkan matahari, bulan dan bintang-bintang itu untukmu dengan perintah-Nya. Sesungguhnya pada yang demikian itu benar-benar ada tanda-tanda kekuasaan Allah bagi kaum yang memahaminya,"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia menundukkan} menundukkan {malam dan siang, matahari dan bulan untuk kalian, dan bintang-bintang ditundukkan} ditundukkan {dengan perintahNya. Sesungguhnya pada yang demikian itu benar-benar terdapat tanda-tanda bagi orang yang berpikir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "12. maksudnya, Dia menundukan hal hal tersebut bagi kalian, semata mata untuk berbagai macam kepentingan dan jenis jenis kemaslahatan kalian, yang kalian tidak mungkin mengesampingkannya sama sekali. Dimalam hari, kalian berada dalam ketenangan, tidur dan beristirahat. Di siang hari, kalian bertebaran untuk mengais mata pencaharian dan kebaikan agama dan duniawi. Dan dengan keberadaan matahari dan bulan, (kalian menikmati) pancaran cahaya dan sinar, kehangatan dipagi hari, (dapat melakukan) rebosisasi pada pohon pohon, tanaman tanaman dan tumbuh tumbuhan, mengeringkan benda benda yang basah, menghilangkan kelembapan yang membahayakan tanah dan tubuh dan lain sebagainya, yang merupakan bagian dari kebutuhan kebutuhan primer dan sekunder, yang tergatung sekali dengan eksistensi matahari dan bulan. Pada matahari, bulan dan bintang bintang terdapat unsur keindahan bagi langit, petunjuk arah dalam kegelapan di daratan maupun di lautan, mengetahui waktu dan perhitungan masa, yang mana kandungan petunjuk dan tanda tandanya sangat beragam. untuk itu Allah menyatukan firmanNYa ”sesungguhnya pada yang demikian itu benar benar ada tanda tanda (kekuasaan Allah) bagi kaum yang memahamiNya” yaitu bagi mereka yang mempunyai akal akal yang mereka manfaatkan untuk merenungi dan memikirkan segala sesuatu yang telah disiapkan untuknya, dia bisa memikirkan segala sesuatu yang dilihat dan didengarnya. Bukan seperti pandangan kaum yang lalai yang porsi analisanya adalah sebagaimana analisa hewan yang tidak berakal."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (مُسَخَّرَٰتُۢ بِأَمۡرِهِۦٓۚ) musakhkharaatum bi`amrih : “dikendalikan dengan perintah-Nya.” Dengan izin dan kekuasaan-Nya. Makna ayat: Firman-Nya “Dan Dia menundukkan malam dan siang” malam hari untuk ketenangan dan istirahat kemudian siang hari untuk bekerja dan mencari rizki, Allah menundukkan keduanya karena keduanya selalu ada terus menerus dan tidak pernah terpisah satu sama lain selamanya, hingga Allah mengizinkan keduanya untuk berhenti. Firman-Nya “matahari dan bulan” mengaturnya untuk agar manusia memanfaatkan sinar dan panasnya, cahaya bulan untuk perhitungan tahun dan peredaran. Firman-Nya “dan bintang-bintang dikendalikan dengan perintah-Nya.” Di antara kegunaan bintang adalah, untuk menjadi petunjuk arah, baik ketika berjalan di bumi atau lautan pada kegelapan malam dan sebagai hiasan langit yang merupakan atap bumi. Firman-Nya “Sungguh pada yang demikian” hal yang telah disebutkan berupa pengaturan malam dan siang, matahari dan bulan serta bintang-bintang. “tanda-tanda” yang banyak, yang menunjukkan adanya Sang Pencipta dan keharusan dalam mempersembahkan ibadah hanya kepada-Nya, namun hanya untuk “bagi orang yang berakal.” Mereka yang menggunakan kekuatan akal mereka dalam memahami sesuatu serta mencari rahasia dan hakikatnya. Adapun orang yang mirip dengan hewan ternak dan orang gila, yang mereka tidak berpikir dan berakal, maka bagi mereka tidak ada satu pun tanda di alam semseta ini yang menunjukkan keberadaan Rabb mereka, kasih sayang-Nya kepada mereka, dan kenikmatan-Nya kepada mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 12: Dia menundukkan semua itu untuk manfaat dan maslahat kamu, di mana kamu selalu membutuhkannya. Dengan adanya malam, kamu dapat tidur dan beristirahat serta menenangkan pikiranmu, dengan adanya siang hari kamu dapat bertebaran di muka bumi untuk mencari ma’isyah (penghidupan), dengan adanya matahari dan bulan ada sinar dan cahaya, dengannya tanaman dan buah-buahan kamu menjadi matang, biji-bijian menjadi kering serta menyingkirkan rasa dingin yang menimpa permukaan bumi dan badan, serta memenuhi kebutuhan penting kamu lainnya. Dengan matahari, bulan dan bintang kita memperoleh petunjuk dalam perjalanan di malam hari di darat maupun lautan, mengetahui waktu-waktu, perhitungan zaman, dan lain-lain. Yakni mereka yang menggunakan akalnya untuk berpikir dan mentadaburi ayat-ayat Allah baik yang ada di alam semesta maupun yang ada dalam kitab-Nya. Hati mereka tidak seperti hati orang-orang yang lalai, yang memandang alam sekitar sebatas memandang saja seperti hewan memandang tanpa memikirkan di balik itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 12",
    "description": "Dia pula yang telah menundukkan malam sehingga menjadi gelap agar kamu dapat beristirahat, dan menundukkan siang sehingga menjadi terang agar kamu dapat berkarya. Allah pula yang telah menundukkan matahari yang menghangatkan dan menyinari bumi, dan menundukkan bulan untukmu agar dapat kamu jadikan pedoman penanggalan dan perhitungan. Dan bintang-bintang di langit dikendalikan dengan perintahnya untuk kemaslahatan kamu. Sungguh, pada yang demikian itu, yaitu penundukan dan pengendalian tersebut, benar-benar terdapat tanda-tanda yang nyata tentang keesaan dan kekuasaan Allah bagi orang yang mengerti. Dan Allah pula yang menundukkan apa yang dia ciptakan untukmu di bumi ini, seperti binatang dan tumbuhan, dengan berbagai jenis dan macam warna serta bentuk-Nya. Sungguh, pada yang demikian itu, yaitu pengembangbiakan binatang dan tumbuhan ke dalam berbagai warna, bentuk, dan macamnya itu, benar-benar terdapat tanda keesaan dan kekuasaan Allah bagi kaum yang mau mengambil pelajaran."
  }
]