[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "120-122. Sesungguhnya ibrahim adalah seorang imam (panutan) dalam kebaikan, orang yang taat dan tunduk kepada Allah, tidak miring dari agama islam, seorang yang mengesakan Allah, tidak mempersekutukanNya, dan ia seorang yang bersyukur terhadap nikmat-nikmat Allah padanya. Allah memilihnya untuk mengemban risalahnya, dan menunjukinya kedalam jalan yang lurus, yaitu jalan islam, dan kami berikan kepadanya di dunia ini berupa kenikmatan yang baik, berupa sanjungan terhadapnya di tengah orang-orang yang datang belakangan, juga sebagai teladan baik, dan juga putra yang shalih. Sesungguhnya dia di sisi Allah di akhirat kelak benar-benar termasuk orang-orang yang shalih, orang-orang yang mendapatkan kedudukan yang tinggi."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "120. \"Sesungguhnya Ibrahim adalah orang yang menyatukan sifat-sifat kebaikan, senantiasa taat kepada Rabbnya, cenderung dari semua agama batil menuju agama Islam, dia tak pernah termasuk orang-orang musyrikin."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "120-122. Nabi Ibrahim merupakan panutan yang memiliki akhlak yang baik, taat kepada Allah, istiqomah di atas agama Islam, mengesakan Allah tanpa menyekutukan-Nya, dan ikhlas dalam mensyukuri segala nikmat Allah. Allah memilihnya sebagai seorang nabi dan memberinya petunjuk menuju agama Islam serta menjadikannya terpuji di dunia, sedangkan di akhirat dia termasuk orang-orang yang mendapat derajat yang tinggi."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "120. إِنَّ إِبْرٰهِيمَ كَانَ أُمَّةً (Sesungguhnya Ibrahim adalah seorang imam) Yakni ia adalah seorang yang mengajarkan kebaikan, atau yang memiliki sifat-sifat yang baik, atau orang yang memiliki ilmu tentang syariat yang telah Allah ajarkan kepadanya. قَانِتًا لِّلّٰهِ(patuh kepada Allah) Makna (القانت) yakni orang yang taat yang dadanya penuh dengan ketakukan kepada Allah dan dapat mengendalikan perbuatannya. حَنِيفًا(dan lurus) Yakni orang yang menjauhi agama-agama yang batil menuju agama yang benar. وَلَمْ يَكُ مِنَ الْمُشْرِكِينَ (Dan sekali-kali bukanlah dia termasuk orang-orang yang mempersekutukan(Allah)) Bukan seperti anggapan orang-orang kafir Quraisy yang mengatakan bahwa Nabi Ibrahim berada dalam agama mereka yang batil itu."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "\"al-Hanafu\" yakni, beralih dari kesesatan menuju keistiqomahan, seperti dalam firman Allah: { قَانِتًا لِلَّهِ حَنِيفًا } \"teladan lagi patuh kepada Allah dan hanif\" sebaliknya \"al-Janaf\" adalah berpaling dari haq ke jalan yang sesat, seperti dalam firman Allah yang berbicara tentang wasiat: { فَمَنْ خَافَ مِنْ مُوصٍ جَنَفًا } \"(Akan tetapi) barangsiapa khawatir terhadap orang yang berwasiat itu, berlaku berat sebelah\" [ al-Baqarah : 182 ]."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "120. Sesungguhnya Ibrahim adalah laki-laki yang mengumpulkan kebaikan dan mengetahui syariat, layaknya seorang imam dan pemimpin kelompok karena dia digambarkan dengan banyak sifat. Dia juga orang yang taat kepada Allah dengan menjalankan perintahNya, penuh ketakutan terhadap Allah dan berpaling dari agama-agama batil dan mengarah kepada agama yang benar, dan beriman hanya kepada Allah, serta tidak termasuk orang-orang-orang musyrik."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya Ibrahim adalah imam} imam, guru dan penghimpun kebiasaan baik {yang patuh kepada Allah} selalu taat kepada Allah {lurus} menghindari segala agama menuju agama Islam {dan bukan termasuk orang-orang musyrik"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "120. Allah memberitahukan tentang hal-hal yang membuat Allah mengutamakan kekasihNya, Ibrahim dengan itu dan perkara-perkara yang Allah mengistimewakan beliau dengannya, berupa keutamaan yang luhur dan kebaikan-kebaikan yang sempurna. Allah berfirman, “Sesunggguhnya Ibrahim adalah seorang imam yang dapat dijadikan teladan,” maksudnya imam panutan, yang menghimpun sifat-sifat kebaikan, memberi petunjuk dan penuh dengan hidayah “lagi patuh kepada Allah,” maksudnya, selalu sibuk dalam keaatan kepada Rabbnya, mengikhlaskan agama bagiNya “dan hanif,” selalu menghadap kepada Allah dengan mahabbah, inabah, dan ubudiyah, serta berpaling dari selainNya “dan sekali-kali bukanlah dia termmasuk orang-orang yang mempersekutukan,” di seluruh ucapan, perbuatan, dan semua kondisinya. Sebab beliau adalah panutan kaum muwahhidin (orang-orang yang bertauhid) yang lurus."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (إِنَّ إِبۡرَٰهِيمَ كَانَ أُمَّةٗ) inna ibraahima kaana ummah : pemimpin yang memiliki berbagai sifat yang baik dan panutan yang ditiru pada kebaikan. (قَانِتٗا لِّلَّهِ) qaanitallillah : taat kepada Allah (حَنِيفٗا) haniifaa : condong kepada agama yang lurus yaitu Islam. Makna ayat: Firman-Nya “Sungguh, Ibrahim adalah seroang imam yang dapat dijadikan teladan, patuh kepada Allah dan hanif. Dan dia bukanlah termasuk orang musyrik. Dia mensyukuri nikma-nikmat-Nya. Allah telah memilihnya dan menunjukinya ke jalan yang benar. Dan Kami berikan kepadanya kebaikan di dunia, dan sesungguhnya di akhirat dia termasuk orang yang saleh. Kemudian Kami wahyukan kepadamu (Muhammad), “Ikutilah agama Ibrahim yang lurus, dan dia bukanlah termasuk orang musyrik.” Termasuk dari kerancuan kaum musyrikin, bahwa mereka berada di atas agama ayah mereka Ibrahim; yang membangun Ka’bah, yang melakukan manasik pertama kali, serta mengharamkan hal yang diharamkan. Yahudi dan Nasrani juga mengklaim bahwa mereka berada di atas agama Ibrahim, dan masing-masing bersikeras bahwa mereka adalah pengikut agama Ibrahim dan di atas agamanya, lalu mereka pun menolak Islam dengan alasan bahwa mereka berada di atas agama Allah; ajaran Ibrahim ayah para nabi ‘alaihimus salam. Untuk menghilangkan kebatilan, menyingkap tirai kerancuan, dan menyucikan kebenaran untuk dakwah dan agama yang benar, Allah menyebutkan sedikit dari kehidupan rohani dan agama Ibrahim sebagai contoh nyata bagi setiap orang yang berakal bagi yang melihat kepadanya, maka akan diketahui apa dia pengikut Ibrahim yang hidup di atas agamanya atau hidup di atas selainnya. Allah ta’ala berfirman “Sungguh Ibrahim adalah imam” imam shaleh yang memiliki sifat-sifat kebaikan, yang diikuti setiap yang menginginkan kebaikan, ini pertama. Kedua, ia merupakan “patuh” yaitu taat kepada Rabbnya, tidak bermaksiat kepada-Nya melanggar perintah atau melanggar larangan, ketiga; ia bukan orang yang musyrik bagaimana pun juga, bahkan ia berlepas diri dari syirik dan pelakunya, Pelajaran dari ayat: • Penegasan tauhid dan penjelasan perihal Ibrahim ‘alaihis salam, serta penjelasan kesempurnaan dan nikmat-nikmat Allah ta’ala kepadanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 120: Dalam ayat ini disebutkan karunia Allah Subhaanahu wa Ta'aala kepada Nabi Ibrahim dan keutamaan serta keistimewaannya. Yakni senantiasa taat kepada Allah Subhaanahu wa Ta'aala dan ikhlas. Hanif maksudnya, seorang yang selalu berpegang kepada kebenaran dan tidak pernah meninggalkannya. Ada pula yang berpendapat, bahwa hanif itu menghadap kepada Allah dengan mencintai-Nya, kembali dan beribadah kepada-Nya, serta berpaling dari selain-Nya. Baik dalam ucapan, amalnya dan semua keadaannya, karena Beliau adalah imam muwahhid (orang yang mentauhidkan Allah)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 120",
    "description": "Ayat ini dan ayat-ayat berikutnya menjelaskan keteladanan nabi ibrahim yang selalu patuh kepada Allah dan mengikuti tuntunan-Nya. Sungguh, ibrahim adalah seorang imam, pemimpin, dan sosok panutan bagi umat-umat sesudahnya. Ia patuh kepada Allah dan mempunyai sifat hanif, yakni memegang teguh dan melaksanakan kebenaran, dan dia sejak dahulu dan secara terus-menerus bukanlah termasuk orang musyrik. Ia tidak pernah sekalipun menyekutukan Allah. Nabi ibrahim bukan sekadar sosok panutan, dia juga senantiasa mensyukuri nikmat-nikmat-Nya baik secara lisan maupun perbuatan. Allah telah memilihnya sebagai teladan dan panutan yang sempurna, baik sebagai imam maupun sebagai nabi dan rasul, dan menunjukinya dengan bimbingan dan petunjuk-Nya ke jalan yang lurus."
  }
]