[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "120-122. Sesungguhnya ibrahim adalah seorang imam (panutan) dalam kebaikan, orang yang taat dan tunduk kepada Allah, tidak miring dari agama islam, seorang yang mengesakan Allah, tidak mempersekutukanNya, dan ia seorang yang bersyukur terhadap nikmat-nikmat Allah padanya. Allah memilihnya untuk mengemban risalahnya, dan menunjukinya kedalam jalan yang lurus, yaitu jalan islam, dan kami berikan kepadanya di dunia ini berupa kenikmatan yang baik, berupa sanjungan terhadapnya di tengah orang-orang yang datang belakangan, juga sebagai teladan baik, dan juga putra yang shalih. Sesungguhnya dia di sisi Allah di akhirat kelak benar-benar termasuk orang-orang yang shalih, orang-orang yang mendapatkan kedudukan yang tinggi."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "121. Dia adalah orang yang bersyukur atas nikmat-nikmat yang Allah berikan kepadanya, Allah memilihnya untuk menjadi Nabi dan membimbingnya kepada agama Islam yang lurus."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "121. شَاكِرًا لِّأَنْعُمِهِ ۚ (yang mensyukuri nikmat-nikmat Allah) Yang Allah berikan kepadanya. اجْتَبَىٰهُ(Allah telah memilihnya) Yang Allah pilih dan istimewakan dengan kenabian. وَهَدَىٰهُ إِلَىٰ صِرٰطٍ مُّسْتَقِيمٍ(dan menunjukinya kepada jalan yang lurus) Yakni kepada agama Islam dan kepercayaan yang benar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "121. Ibrahim AS adalah orang yang bersyukur atas nikmat Allah yang sedikit maupun yang banyak. Dia dipilih Tuhan untuk menjadi Nabi dan ditunjukkan menuju jalan yang lurus, yaitu bertauhid dan Islam"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bersyukur atas nikmat-nikmatNya (dan Allah) telah memilih} (Allah) memilihnya untuk suatu kenabian {serta menunjukinya ke jalan yang lurus"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "121. “(Lagi) yang mensyukuri nikmat-nikmat Allah,” maksudnya Allah menganugerahkan kepada belliau kebaikan di dunia dan mencurahkan pada beliau kenikmatan yang zahir maupun batin. Beliau pun melaksanakan kewajiban mensyukurinya, maka hal itu menjadi buah dari kebaikan-kebaikan yang utama ini. “Allah telah memilihnya,” Rabbnya telah memilihnya dan mengistimewakannya sebagai kekasihNya dan menjadikannya golongan terpilih dari makhlukNya dan kalangan terpilih dari para hambaNya yang berkedudukan dekat denganNya. “Dan menunjukinya kepada jalan yang lurus,” pada amalan dan perbuatannya. Beliau mengetahui kebenaran, lalu lebih mengutamakannya daripada orang lain."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat: keempat; ia merupakan orang yang bersyukur atas nikmat-nikmat Allah ta’ala kepadanya; menggunakan nikmat-nikmat Allah untuk keridhaan-Nya, kelima; “Allah telah memilihnya” untuk risalah-Nya dan menjadi kekasih-Nya, karena ia mencintai-Nya lebih dari segala sesuatu, sehingga kecintaan kepada Allah telah meresap ke dalam hatinya, tidak ada tempat bagi selain-Nya di dalam hatinya, lalu Allah menjadikannya kekasih-Nya; Khalilur Rahman, keenam; “Dan memberinya petunjuk menuju jalan yang lurus.” Yaitu Islam,"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 121: Oleh karena Beliau orang yang patuh kepada Allah, bersyukur, bersabar, dan tidak berbuat syirk, maka Allah Subhaanahu wa Ta'aala memilihnya, menjadikannya sebagai kekasih-Nya dan sebagai makhluk pilihan-Nya serta menunjukinya ke jalan yang lurus baik dalam ilmu maupun amal."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 121",
    "description": "Nabi ibrahim bukan sekadar sosok panutan, dia juga senantiasa mensyukuri nikmat-nikmat-Nya baik secara lisan maupun perbuatan. Allah telah memilihnya sebagai teladan dan panutan yang sempurna, baik sebagai imam maupun sebagai nabi dan rasul, dan menunjukinya dengan bimbingan dan petunjuk-Nya ke jalan yang lurus. Dan selain memberinya anugerah yang banyak, kami juga telah berikan kepadanya kebaikan, yakni keagungan dan kelebihan di dunia, dan sesungguhnya di akhirat kelak dia termasuk orang yang saleh yang akan mendapat kebahagiaan ukhrawi."
  }
]