[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "120-122. Sesungguhnya ibrahim adalah seorang imam (panutan) dalam kebaikan, orang yang taat dan tunduk kepada Allah, tidak miring dari agama islam, seorang yang mengesakan Allah, tidak mempersekutukanNya, dan ia seorang yang bersyukur terhadap nikmat-nikmat Allah padanya. Allah memilihnya untuk mengemban risalahnya, dan menunjukinya kedalam jalan yang lurus, yaitu jalan islam, dan kami berikan kepadanya di dunia ini berupa kenikmatan yang baik, berupa sanjungan terhadapnya di tengah orang-orang yang datang belakangan, juga sebagai teladan baik, dan juga putra yang shalih. Sesungguhnya dia di sisi Allah di akhirat kelak benar-benar termasuk orang-orang yang shalih, orang-orang yang mendapatkan kedudukan yang tinggi."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "122. Kami memberi Ibrahim di dunia kenabian, sanjungan yang baik dan anak yang saleh, sesungguhnya dia di Akhirat termasuk orang-orang saleh yang Allah siapkan bagi mereka derajat-derajat yang tinggi di Surga."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "122. وَءَاتَيْنٰهُ فِى الدُّنْيَا حَسَنَةً ۖ (Dan Kami berikan kepadanya kebaikan di dunia) Yakni sifat yang baik. Pendapat lain mengatakan, yakni anak yang shalih. Pendapat lain mengatakan, yakni kenabian. Pendapat lain mengatakan bahwa dia dahulu dijadikan pemimpin dari pemeluk setiap agama, dan dahulu dia memiliki banyak harta dan hewan ternak."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "122. Dan kami telah memberikan kebaikan di dunia kepada Ibrahim, yaitu cinta kasih dan pujian baik dari seluruh pemeluk agama. Sesungguhnya dia di akhirat itu termasuk orang-orang yang memiliki derajat tinggi di surga"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami memberikan kepadanya kebaikan} nubuwwah, kedekatan, anak, pujian dan kebaikan {di dunia dan sesungguhnya di akhirat dia termasuk orang-orang yang shalih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "122. “Dan Kami berikan kepadanya kebaikan di dunia,” rizki yang melimpah ruah, istri-istri yang cantik, dan keturunan-keturunan yang shalih, serta budi pekerti yang diridhai “Dan sesungguhnya dia di akhirat benar-benar termasuk orang-orang yang shalih,” yaitu orang-orang yang meraih kedudukan yang tinggi dan kedekatan yang agung dengan Allah."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (وَءَاتَيۡنَٰهُ فِي ٱلدُّنۡيَا حَسَنَةٗۖ) wa`aatainaahu fid dunyaa hasanah : yaitu pujian yang baik dari seluruh pemeluk agama langit. Makna ayat: ketujuh; “Kami memberikannya kebaikan di dunia” yaitu pujian yang baik dan sebutan yang indah dari seluruh penganut agama langit, kedelapan; “Dan dia di akhirat termasuk orang yang saleh.” Yaitu orang-orang yang Allah firmankan “Aku menyiapkan untuk hamba-hamba-Ku yang saleh, hal yang belum pernah dilihat oleh mata, tidak pernah didengar oleh telinga, tidak pula terbersit di dalam hati seorang pun.” Sebuah kedudukan yang paling mulia dan paling tinggi,"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 122: Yaitu pujian yang baik di setiap umat, rezeki yang banyak, istri yang cantik, keturunan yang saleh dan akhlak yang diridhai. Yang mendapatkan derajat yang tinggi dan dekat dengan Allah Subhaanahu wa Ta'aala."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 122",
    "description": "Dan selain memberinya anugerah yang banyak, kami juga telah berikan kepadanya kebaikan, yakni keagungan dan kelebihan di dunia, dan sesungguhnya di akhirat kelak dia termasuk orang yang saleh yang akan mendapat kebahagiaan ukhrawi. Kemudian kami wahyukan kepadamu, wahai nabi Muhammad, ikutilah agama, yaitu sikap hidup dan akhlak nabi ibrahim yang lurus dan selalu dalam kebenaran, dan dia bukanlah termasuk orang musyrik."
  }
]