[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian kami wahyukan kepadamu (wahai rasul), agar kamu mengikuti ajaran islam sebagaimana ibrahim telah mengikutinya dan agar kamu istiqamah (lurus) diatasnya. Dan jangan menyimpang darinya. Sesungguhnya ibrahim bukanlah termasuk orang-orang musyrik yang mempersekutukan sesuatu dengan Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "123. Kami mewahyukan kepadamu -wahai Rasul- agar kamu mengikuti agama Ibrahim dalam Tauhid dan berlepas diri dari orang-orang musyrikin, berdakwah kepada Allah dan mengamalkan syariat-Nya, cenderung dari segala agama menuju agama Islam, dia bukan termasuk orang-orang musyrikin sebagaimana yang dituduhkan oleh orang-orang musyrikin, sebaliknya dia adalah orang yang mentauhidkan Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "123. Hai Rasulallah, Kemudian kami mewahyukan kepadamu: “Ikutilah ajaran agama Islam dan beristiqomahlah di atasnya. Dan Nabi Ibrahim sama sekali tidak pernah menyekutukan Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "123. ثُمَّ أَوْحَيْنَآ إِلَيْكَ (Kemudian Kami wahyukan kepadamu) Disamping derajatmu yang Kami tinggikan, wahai Muhammad. أَنِ اتَّبِعْ مِلَّةَ إِبْرٰهِيمَ(Ikutilah agama Ibrahim) Dalam hal tauhid dan dakwah kepadanya, dan dalam hal berlepas diri dari berhala-berhala, serta dalam memeluk agama Islam dan menjalankan syariatnya kecuali yang telah dinasakh (dihapus/diganti)."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "123. Lalu Kami mewahyukan kepadamu wahai nabi untuk mengikuti millah (keyakinan) Ibrahim dalam bertauhid dan berdakwah dengan halus, berpaling dari agama lain dan menghadap kepada agama yang benar, beribadah hanya kepada Allah dan tidak termasuk orang-orang musyrik, melainkan menjadi teladan bagi orang-orang yang bertauhid, berbeda dengan anggapan orang-orang Musyrik Quraisy bahwa mereka mengikuti millah Ibrahim"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kemudian Kami wahyukan kepadamu,“Ikutilah agama Ibrahim yang lurus dan tidak termasuk orang-orang musyrik”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "123. Dan di antara keutamaan beliau yang luar biasa, bahwa Allah mewahyukan kepada penghulu para makhluk dan insan yang paling sempurna Muhammad untuk mengikuti ajaran Ibrahim dan agar beliau dan umat Islam meneladaninya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat: kesembilan; Allah ta’ala memerintahkan Nabi Muhammad shallallahu ‘alaihi wa sallam dengan kedudukan yang mulia dan tinggi untuk mengikuti agama Ibrahim yang lurus. Ini adalah Ibrahim, siapakah yang lebih pantas untuk dinisbatkan kepadanya? Kaum musyrikin?, tidak! Yahudi ?, tidak! Nasrani?, tidak! Kaum muslimin yang bertauhid?, iya, benar! Ya Allah, jadikanlah kami dari kalangan mereka, kumpulkanlah kami dalam rombongan mereka, dan muliakanlah kami tatkala Engkau memuliakan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 123: Di antara keutamaan Beliau lainnya adalah, bahwa Allah memerintahkan kepada pemimpin manusia Nabi Muhammad shallallahu 'alaihi wa sallam untuk mengikuti agama Nabi Ibrahim, demikian pula umatnya. Diulangi lagi kata-kata “dia bukanlah termasuk orang musyrik” untuk membantah orang-orang Yahudi dan Nasrani yang menganggap bahwa Beliau di atas agama mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 123",
    "description": "Kemudian kami wahyukan kepadamu, wahai nabi Muhammad, ikutilah agama, yaitu sikap hidup dan akhlak nabi ibrahim yang lurus dan selalu dalam kebenaran, dan dia bukanlah termasuk orang musyrik. Sesungguhnya pengagungan dan larangan berburu pada hari sabtu bukanlah ajaran nabi ibrahim, melainkan hanya diwajibkan atas orang yahudi yang memperselisihkannya, yakni menyangkut hari yang harus diagungkan. Dan sesungguhnya tuhanmu yang maha memberi petunjuk dan keputusan pasti akan memberi keputusan di antara mereka pada hari kiamat terhadap apa yang telah mereka perselisihkan itu."
  }
]