[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya Allah hanya mewajibkan menghormati hari sabtu untuk berkonsentrasi dalam ibadah atas orang-orang yahudi yang telah berselisih padanya tentang nabi mereka, dan lebih memilihnya sebagai ganti hari jumat yang mereka sebenarnya diperintah untuk mengagungkannya. Dan sesungguhnya tuhanmu (wahai rasul), benar-benar akan memutuskan ketetapan diantara orang-orang yang berselisih pada hari kiamat, dalam perkara yang mereka berselisih paham padanya terhadap nabi mereka dan akan memberikan balasan bagi masing-masing sesuai dengan balasan yang berhak diterimnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "124. Pengagungan hari Sabtu ditetapkan sebagai kewajiban atas orang-orang Yahudi ketika mereka berselisih tentangnya agar mereka meninggalkan kesibukan hidup untuk fokus kepada ibadah sesudah mereka tersesat dari hari Jumat yang mereka diperintahkan agar mengkhususkan beribadah pada hari itu. Sesungguhnya Rabbmu -wahai Rasul- benar-benar akan menetapkan keputusan-Nya di antara mereka yang berselisih pada hari Kiamat tentang apa yang mereka perselisihkan, lalu membalas masing-masing sesuai dengan amal perbuatannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "124. Allah memuliakan hari Sabtu sebagai waktu beribadah bagi orang-orang Yahudi yang saling berselisih tentang kemuliaannya; sebagian mereka melanggar kehormatan hari itu, dan sebagian lainnya tetap menjaga kehormatannya sebagai ganti kehormatan hari Jum’at yang mereka diperintahkan untuk memuliakannya. Hai Rasulallah, Tuhanmu akan memberi keputusan antara orang-orang yang berselisih itu pada hari kiamat tentang apa yang mereka perselisihkan terhadap Nabi mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "124. إِنَّمَا جُعِلَ السَّبْتُ عَلَى الَّذِينَ اخْتَلَفُوا۟ فِيهِ ۚ (Sesungguhnya diwajibkan (menghormati) hari Sabtu atas orang-orang (Yahudi) yang berselisih padanya) Yakni sesungguhnya akibat dari pelanggaran hari sabtu yang berupa kutukan menjadi kera dan babi adalah bagi orang-orang yang saling berselisih tentangnya. Atau maknanya adalah sesungguhnya kewajiban menghormati hari sabtu adalah bagi orang-orang yang saling berselisih tentangnya, yakni tentang Nabi Ibrahim. Orang-orang yang saling berselisih ini adalah orang-orang Yahudi yang mengatakan bahwa penghormatan terhadap hari sabtu adalah bagian dari syariat Nabi Ibrahim. Maka Allah menjelaskan bahwa penghormatan pada hari sabtu hanyalah kewajiban atas orang-orang Yahudi, dan bukan termasuk dari kewajiban dan agama Nabi Ibrahim atau keturunannya, namun hanya kewajiban atas bani Israil saja. وَإِنَّ رَبَّكَ لَيَحْكُمُ بَيْنَهُمْ(Dan sesungguhnya Tuhanmu benar-benar akan memberi putusan di antara mereka) Yakni keputusan antara orang-orang yang saling berselisih di hari kiamat terhadap apa yang telah mereka perselisihkan itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "124. Sesungguhnya diwajibkan bagi orang-orang yang berselisih terhadap Ibrahim, yaitu kaum Yahudi dan Nasrani untuk mengagungkan dan memuliakan hari sabtu, meninggalkan pekerjaan di dalamnya dan membaktikan diri untuk beribadah. Mereka adalah kaum Yahudi dan Nasrani, atau mereka berselisih tentang hari sabtu. Mereka itu adalah kaum Yahudi yang menganggap bahwa itu merupakan termasuk syariat yang ditetapkan Ibrahim. Lalu Allah membalas pernyataan mereka bahwa itu bukan termasuk millah Ibrahim. Dan sesungguhnya Tuhanmu wahai Nabi, menentukan hukum antara orang-orang yang berselisih tentang hal itu pada hari kiamat, lalu setiap orang dibalas dengan apa yang layak baginya berupa pahala dan hukuman"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya hari Sabtu diwajibkan} diwajibkan mengagungkan hari Sabtu, dan membaktikan diri untuk beribadah di dalamnya {bagi orang-orang yang memperselisihkannya} orang-orang Yahudi yang menentang nabi mereka karena hari sabtu ketika mereka diperintah untuk mengagungkan hari Jumat lalu mereka meminta keadilan tentang itu dan memilih hari Sabtu {Sesungguhnya Tuhanmu benar-benar akan memberi keputusan di antara mereka pada hari Kiamat tentang apa yang mereka perselisihkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "124. Allah berfirman, “Sesungguhnya di wajibkan (menghormati) hari Sabtu,” sebagai kewajiban “atas orang-orang (Yahudi) yang berselisih padanya,” ketika mereka menyimpang dari pilihan hari Jum’at. Mereka itu adalah bangsa Yahudi. Maka, pertentangan mereka menjelma sebagai faktor penyebab agar hari Sabtu harus mereka hormati dan agungkan. Apabila tidak demikian, maka keutamaan yang hakiki adalah bagi hari Jum’at yang Allah menunjuki ummat ini (untuk mengagungkannya). “Dan sesungguhnya Rabbmu benar-benar akan memberi keputusan di antara mereka pada Hari KIamat terhadap apa yang mereka perselisihkan itu,” lalu menerangkan bagi mereka orang yang benar dan yang keliru, orang yang berhak menerima pahala dan orang yang berhak disiksa."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (إِنَّمَا جُعِلَ ٱلسَّبۡتُ عَلَى ٱلَّذِينَ ٱخۡتَلَفُواْ فِيهِۚ) innamaa ju’ilas sabtu ‘alalladziinakhtalafuu fiih : Sesungguhnya Yahudi diperintahkan untuk mengagungkan hari Jum’at, lalu mereka menolak dan memilih hari sabtu, lalu Allah wajibkan dan memberatkan mereka sebagai hukuman untuk mereka. Makna ayat: Firman-Nya ta’ala “Sesungguhnya hari Sabtu hanya diwajibkan kepada orang (Yahudi) yang berselisih di dalamnya.” Terdapat bukti akan batilnya klaim Yahudi bahwa mereka berada di atas ajaran dan agama Ibrahim yang agung, karena penghormatan pada hari Sabtu tidak ada pada agama Ibrahim. Sebabnya adalah Allah ta’ala mewahyukan kepada salah satu nabi mereka, agar Bani Israil mengagungkan hari Jumat, lalu mereka berselisih pendapat, kemudian mereka memilih hari Sabtu karena mereka sombong dan keras kepala. Maka Allah mewajibkan mereka mengagungkan hari Sabtu. Firman-Nya “Dan sesungguhnya Rabbmu pasti akan memberi keputusan di antara mereka pada hari kiamat terhadap apa yang telah mereka perselisihkan.” Pada ayat ini terdapat ancaman untuk mereka, bahwa Allah akan membalas mereka dengan keburukan jika mereka menentang nabi-nabi mereka. Pelajaran dari ayat: • Penjelasan bahwa hari sabtu untuk orang Yahudi merupakan hukuman dari Allah kepada mereka bukan nikmat atau karunia-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 124: Menghormati hari Sabtu adalah dengan memperbanyak ibadah dan amalan-amalan yang saleh serta meninggalkan pekerjaan sehari-hari. Kepada nabi mereka. Saat mereka diperintahkan memperbanyak ibadah pada hari Jum’at, lalu mereka berkata, “Kami tidak mau hari Jum’at.” Mereka kemudian memilih hari Sabtu, padahal hari Jum’at memiliki keutamaan, maka Nabi mereka memberatkan mereka pada hari Sabtu. Tentang perintah-Nya, yaitu dengan menerangkan siapa yang yang benar dan siapa yang salah, memberikan pahala kepada orang yang taat dan mengazab orang yang bermaksiat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 124",
    "description": "Sesungguhnya pengagungan dan larangan berburu pada hari sabtu bukanlah ajaran nabi ibrahim, melainkan hanya diwajibkan atas orang yahudi yang memperselisihkannya, yakni menyangkut hari yang harus diagungkan. Dan sesungguhnya tuhanmu yang maha memberi petunjuk dan keputusan pasti akan memberi keputusan di antara mereka pada hari kiamat terhadap apa yang telah mereka perselisihkan itu. Usai menyebut keteladanan nabi ibrahim sebagai imam, nabi, dan rasul, dan meminta nabi Muhammad untuk mengikutinya, pada ayat ini Allah meminta beliau menyeru manusia ke jalan Allah dengan cara yang baik, wahai nabi Muhammad, seru dan ajak-lah manusia kepada jalan yang sesuai tuntunan tuhanmu, yaitu islam, dengan hikmah, yaitu tegas, benar, serta bijak, dan dengan pengajaran yang baik. Dan berdebatlah dengan mereka, yaitu siapa pun yang menolak, menentang, atau meragukan seruanmu, dengan cara yang baik. Sesungguhnya tuhanmu yang maha memberi petunjuk dan bimbingan, dialah yang lebih mengetahui siapa yang sesat dan menyimpang dari jalan-Nya, dan dialah pula yang lebih mengetahui siapa yang mendapat petunjuk dan berada di jalan yang benar."
  }
]