[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Serulah (wahai rasul) oleh mu dan orang-orang yang mengikutimu kepada agama tuhanmu dan jalanNya yang lurus dengan cara bijakasana yang telah Allah wahyukan kepadamu di dalam al-qur’an dan -sunnah. Dan bicaralah kepada manusia dengan metode yang sesuai dengan mereka, dan nasihati mereka dengan baik-baik yang akan mendorong mereka menyukai kebaikan dan menjauhkan mereka dari keburukan. Dan debatlah mereka dengan cara perdebatan yang terbaik, dengan halus dan lemah lembut. sebab tidak ada kewajiban atas dirimu selain menyampaikan, Dan sungguh engkau telah menyampaikan, adapun hidayah bagi mereka terserah kepada Allah semata. Dia lebih tahu siapa saja yang sesat dari jalanNya dan Dia lebih tahu orang-orang yang akan mendapatkan hidayah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "125. Ajaklah -wahai Rasul- kepada agama Islam, kamu dan orang-orang beriman yang mengikutimu dengan cara yang sesuai dengan keadaan objek dakwah, pemahaman dan ketundukannya, melalui nasihat yang mengandung motivasi dan peringatan, debatlah mereka dengan cara yang lebih baik dari sisi perkataan, pemikiran dan pengkondisian. Kamu tidak bertugas memberi manusia hidayah, akan tetapi tugasmu hanya menyampaikan kepada mereka. Sesungguhnya Rabbmu lebih mengetahui siapa yang tersesat dari agama Islam dan Dia lebih mengetahui siapa yang mendapatkan petunjuk, karena itu jangan sia-siakan dirimu dengan kesedihan mendalam atas mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "125. Allah memerintahkan nabi Muhammad untuk menyuruh jin dan manusia menuju agama Islam dengan cara yang penuh kebijaksanaan sebagaimana yang telah Allah wahyukan kepadanya, dan memberi mereka pelajaran yang bermanfaat dengan penuh kelembutan, serta mendebat orang-orang yang menyelisihinya dengan cara yang baik dan dengan dalil-dalil yang kuat. Sungguh Allah Maha Mengetahui hamba-Nya yang ingin menuju jalan yang benar."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "125. ادْعُ إِلَىٰ سَبِيلِ رَبِّكَ (Serulah (manusia) kepada jalan Tuhan-mu) Jalan Allah yakni agama Islam. بِالْحِكْمَةِ(dengan hikmah) Yakni dengan ucapan yang benar dan mengandung hikmah. Pendapat lain mengatakan, yakni dengan bukti-bukti yang menimbulkan keyakinan. وَالْمَوْعِظَةِ الْحَسَنَةِ ۖ( dan pelajaran yang baik) Yakni ucapan yang baik dan indah bagi pendengarnya yang meresap ke dalam hati sehingga dapat meyakinkannya dan menjadikannya mau untuk mengamalkannya. وَجٰدِلْهُم بِالَّتِى هِىَ أَحْسَنُ ۚ( dan bantahlah mereka dengan cara yang baik) Yakni dengan cara terbaik dalam berdebat. إِنَّ رَبَّكَ هُوَ أَعْلَمُ بِمَن ضَلَّ عَن سَبِيلِهِۦ ۖ( Sesungguhnya Tuhanmu Dialah yang lebih mengetahui tentang siapa yang tersesat dari jalan-Nya) Allah menjelaskan dalam ayat ini bahwa petunjuk dan hidayah bukan urusan Nabi namun urusan Allah semata. وَهُوَ أَعْلَمُ بِالْمُهْتَدِينَ(dan Dialah yang lebih mengetahui orang-orang yang mendapat petunjuk) Yakni orang-orang yang mencari kebenaran kemudian menerimanya tanpa keras kepala."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). { ادْعُ إِلَىٰ سَبِيلِ رَبِّكَ } \"Serulah (manusia) kepada jalan Tuhan-mu\" maka hendaklah bagi setiap Da'i merasa dalam dirinya bahwa ia sedang menyerukan kepada jalan Allah, bukan karena kewajiban kekuasaan, atau mengindahkan kata-kata, atau menarik perhatian orang lain; karena semua ini tujuannya salah, melainkan { إِنَّ هَٰذَا الْقُرْآنَ يَهْدِي لِلَّتِي هِيَ أَقْوَمُ } \"Sesungguhnya Al Quran ini memberikan petunjuk kepada (jalan) yang lebih lurus\". 2 ). Ayat ini menunjukkan bahwa tidak semestinya penisbatan \"al-Amri bil ma'ruf\" dengan penisbatan yang muthlaq, kecuali kepada orang yang mengumpulkan semuanya antara ilmu dan hikmah dan sabar diatas kekejian orang-orang, karena untuk menegakkan \"al-Amru bil ma'ruf\" harus siap dengan kekejian mereka, karena sudah menjadi tabi'at mereka akan melawan siapa saja yang menghalangi misi hawa nafsu mereka yang keji itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "125. Wahai Nabi, serulah manusia menuju agama Allah yang benar, yaitu Islam dengan perkataan yang penuh hikmah yang menjelaskan tentang kebenaran, yaitu dengan dalil nyata dan tidak samar, dengan pelajaran yang bermanfaat serta ucapan yang baik dan lemah lembut tanpa menyakiti. Dan bebicaralah atau bercakap-cakaplah kamu dengan mereka menggunakan cara percakapan paling baik berupa keramahan dan kelembutan, dan ucapan yang penuh kedamaian. Sesungguhnya Tuhanmu itu lebih tahu tentang orang yang menyimpang dari jalan keimanan. Dia juga lebih tahu tentang orang yang mendapat petunjuk, lebih tahu tentang kebenaran, serta menghendaki dakwah dan risalahmu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Serulah (manusia) ke jalan Tuhanmu} agama Islam {dengan hikmah dan pengajaran yang baik serta debatlah mereka dengan cara yang lebih baik. Sesungguhnya Tuhanmu Dialah yang paling mengetahui siapa yang tersesat dari jalanNya dan Dialah yang paling tahu orang-orang yang mendapat petunjuk"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "125. Hendaknya ajakanmu kepada umat manusia, yang Muslim maupun kafir tertuju kepada jalan Rabbmu yang lurus yang mengandung ilmu yang bermanfaat dan amalan shalih. “Dengan hikmah” maksudnya, setiap orang sesuai dengan keadaan dan pemahaman serta sambutan dan ketaatannya. Termasuk hikmah dalam berdakwah adalah berdakwah dengan dasar ilmu, bukan kebodohan, memulai dengan perkara yang paling penting (sesuai dengan skala prioritas), lalu yang lebih penting daripada (yang sesudahnya) dan yang lebih dekat dengan alam pikiran mereka dan mudah dipahami, dengan cara (simpatik) yang lebih mendatangkan sambutan lebih baik, dengan penuh kelembutan dan persuasive. Bila sudah tuunduk dengan cara hikmah, (maka itu sangat bagus). Jika tidak mempan, maka beralih kepada metode dakwah dengan pelajaran yang baik. Yaitu dengan perintah dan larangan, yang diiringi dengan targhib (anjuran keutamaan) dan tarhib (ancaman). Baik dengan (menyampaikan) kemaslahatan yang terkandung oleh perintah-petintah dan menghitung-hitungnya dan bahaya yang terkandung dalam larangan-larangan dan menginventariskannya, atau dengan menyebutkan kemuliaan yang diraih oleh orang-orang yang menegakkan agama Allah dan penghinaan dan diterima orang yang tidak menjalankannya. Maupun dengan menyebutkan sesuatu yang telah Allah sediakan bagi orang-orang yang taat berupa balasan baik di dunia dan akhirat, dan sesuatu yang dipersiapkan oleh Allah bagi para pelaku maksiat, berupa hukuman dunia dan akhirat. Bila obyek dakwah mengklaim keyakinan yang dipegang teguh olehnya merupakan kebenaran (padahal salah) atau ia seorang propagandis kebatilan, maka ditempuh cara bantahan dengan cara yang lebih baik. Yaitu cara-cara yang bisa lebih efektif agar dia menyambut dakwah secara nalar maupun lewat dalil naqli. Termasuk, mengemukakan argumentasi untuk menyerangnya dengan membawakan dalil-dalil yang dia yakini (selanjutnya dibantah satu persatu). Sesungguhnya metode ini lebih efektif merealisasikan tujuan dakwah, dan jangan sampai adu argumentasi mengarah kepada pertikaian atau saling mencela yang akan memupus tujuan dakwah itu sendiri dan tidak muncul manfaat darinya. Akan tetapi, sasarannya adalah memberi hidayah kepada umat manusia, bukan untuk mengalahkan mereka atau tujuan buruk lainnya. Firman Allah, “SEsungguhnya Rabbmu Dialah yang lebih mengetahui tentang siapa yang tersesat dari jalanNYa,” Maha Mengetahui latar belakang yang menyeretnya kepada kesesatan, dan Mengetahui perbuatan-perbuatan yang menyebabkannya kepada kesesatannya, dan Allah akan membalasnya dengan setimpal. “Dan Di-lah yang lebih mengetahui orang-orang yang mendapat petunjuk,” Allah mengetahui bahwa mereka pantas menerima hidayah, lantas menganugerahkannya kepada mereka dan memilih mereka."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (إِلَىٰ سَبِيلِ رَبِّكَ) ilaa sabiili rabbik : yaitu menuju ketaatan-Nya, karena ketaatan kepada Allah akan mengantarkan kepada keridhaan-Nya dan nikmat-Nya, itulah jalan Allah. (بِٱلۡحِكۡمَةِ) bil hikmah : dengan Al-Qur’an dan perkataan yang bijak dan benar, berdasarkan dalil yang menjelaskan kebenaran. (وَٱلۡمَوۡعِظَةِ ٱلۡحَسَنَةِۖ) wal mau’izhatil hasanah : yaitu pelajaran-pelajaran dari Al-Qur’an, dan perkataan lembut dan baik. (وَجَٰدِلۡهُم بِٱلَّتِي هِيَ أَحۡسَنُۚ) wa jaadilhum billatii hiya ahsan : dengan perdebatan yang baik. Makna ayat: Allah ta’ala berdialog kepada rasul-Nya sebagai pemuliaan serta perintah “Serulah manusia menuju jalan Rabbmu” yaitu menuju agama-Nya; Islam, dan hendaknya ajakanmu “dengan hikmah” yaitu Al-Qur’anul Karim Hakim “dan pelajaran yang baik” yaitu pelajaran Al-Qur’an, kisah-kisahnya, perumpamaan, motivasi, dan peringatannya “dan debatlah mereka dengan cara yang baik” berdebatlah dengan mereka dengan cara yang baik, tidak ada celaan, ejekan, dan menginginkan keburukan. Karena hal ini lebih memudahkan lawan untuk menerima kebenaran dan ajakan kepadanya. Firman-Nya ta’ala “Sesungguhnya Rabbmu, Dialah yang lebih mengetahui siapa yang sesat dari jalan-Nya” dari manusia “dan Dialah yang lebih mengetahui siapa yang mendapat petunjuk.” Dia akan membalas orang yang mendapat hidayah karena hidayahnya dan orang yang sesat karena kesesatannya, dan engkau tidak ada andil dalamnya. Bahkan Rabbmu lah yang memberi hidayah kepada yang Dia kehendaki dan menyesatkan yang Dia kehendaki, tugasmu hanyalah menyampaikan dengan cara yang telah diterangkan kepadamu, dengan hikmah, pelajaran yang baik, dan dengan bantahan dengan cara yang baik. Pelajaran dari ayat: • Wajib mengajak kepada jalan Allah; Islam, yaitu wajib kifayah. Jika sudah ada yang melakukannya maka yang lain tidak terbebankan. • Penjelasan tata cara berdakwah. Yaitu hendaknya dengan Al-Qur’an dan Sunnah, serta kosong dari kekerasan, serta berdebat dengan cara yang baik."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 125: Yang lurus; yang di dalamnya mengandung ilmu yang bermanfaat dan amal yang saleh. Hikmah artinya tepat sasaran; yakni dengan memposisikan sesuatu pada tempatnya. Termasuk ke dalam hikmah adalah berdakwah dengan ilmu, berdakwah dengan mendahulukan yang terpenting, berdakwah memperhatikan keadaan mad’u (orang yang didakwahi), berbicara sesuai tingkat pemahaman dan kemampuan mereka, berdakwah dengan kata-kata yang mudah dipahami mereka, berdakwah dengan membuat permisalan, berdakwah dengan lembut dan halus. Adapula yang menafsirkan hikmah di sini dengan Al Qur’an. Yani nasehat yang baik dan perkataan yang menyentuh. Termasuk pula memerintah dan melarang dengan targhib (dorongan) dan tarhib (menakut-nakuti). Misanya menerangkan maslahat dan pahala dari mengerjakan perintah dan menerangkan madharrat dan azab apabila mengerjakan larangan. Jika orang yang didakwahi menyangka bahwa yang dipegangnya adalah kebenaran atau sebagai penyeru kepada kebatilan, maka dibantah dengan cara yang baik; yakni cara yang dapat membuat orang tersebut mau mengikuti secara akal maupun dalil. Termasuk di antaranya menggunakan dalil yang diyakininya, karena hal itu lebih dapat mencapai kepada maksud, dan jangan sampai perdebatan mengarah kepada pertengkaran dan caci-maki yang dapat menghilangkan tujuan serta tidak menghasilkan faedah darinya, bahkan tujuannya adalah untuk menunjukkan manusia kepada kebenaran, bukan untuk mengalahkan atau semisalnya. Ibnul Qayyim rahimahullah berkata, “Allah ‘Azza wa Jalla menjadikan tingkatan (dalam) berdakwah sesuai tingkatan manusia; bagi orang yang menyambut, menerima dan cerdas, di mana dia tidak melawan yang hak (benar) dan menolaknya, maka didakwahi dengan cara hikmah. Bagi orang yang menerima namun ada sisi lalai dan suka menunda, maka didakwahi dengan nasehat yang baik, yaitu dengan diperintahkan dan dilarang disertai targhib (dorongan) dan tarhib (membuat takut), sedangkan bagi orang yang menolak dan mengingkari didebat dengan cara yang baik.” Dia mengetahui sebab yang dapat mengarah kepada kesesatan, Dia mengetahui pula amal-amal yang timbul dari kesesatannya, dan Dia akan memberikan balasan terhadapnya. Dia mengetahui orang yang cocok memperoleh hidayah, maka Dia menunjukkan mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 125",
    "description": "Usai menyebut keteladanan nabi ibrahim sebagai imam, nabi, dan rasul, dan meminta nabi Muhammad untuk mengikutinya, pada ayat ini Allah meminta beliau menyeru manusia ke jalan Allah dengan cara yang baik, wahai nabi Muhammad, seru dan ajak-lah manusia kepada jalan yang sesuai tuntunan tuhanmu, yaitu islam, dengan hikmah, yaitu tegas, benar, serta bijak, dan dengan pengajaran yang baik. Dan berdebatlah dengan mereka, yaitu siapa pun yang menolak, menentang, atau meragukan seruanmu, dengan cara yang baik. Sesungguhnya tuhanmu yang maha memberi petunjuk dan bimbingan, dialah yang lebih mengetahui siapa yang sesat dan menyimpang dari jalan-Nya, dan dialah pula yang lebih mengetahui siapa yang mendapat petunjuk dan berada di jalan yang benar. Ayat ini memberi tuntunan kepada nabi Muhammad tentang tata cara berdakwah dan membalas perbuatan orang yang menyakitinya, dan jika kamu membalas terhadap siapa pun yang telah menyakiti atau menyiksamu dalam berdakwah, maka balas dan hukum-lah mereka dengan balasan yang sama, yakni setimpal, dengan siksaan atau kesalahan yang ditimpakan kepadamu; jangan kaubalas mereka lebih dari itu. Tetapi jika kamu bersabar dan tidak membalas apa yang mereka lakukan kepadamu, sesungguhnya itulah yang lebih baik bagi orang yang sabar."
  }
]