[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan bila kalian (wahai kaum mukmimin) hendak membalas terhadap orang-orang yang bertindak zhalim kepada kalian, maka janganlah membalas melebihi apa yang mereka perbuat terhadapt kalian. Dan bila kalian mau bersabar itu benar-benar lebih baik bagi kalian di dunia dengan mendapat kemenangan, dan di akhirat dengan mendapat pahala besar."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "126. Bila kalian hendak menghukum perlakukan musuh kalian maka hukumlah dengan hukuman seperti yang mereka lakukan terhadap kalian tidak lebih, namun bila kalian bersabar dengan tidak membalas mereka padahal kalian mampu untuk membalasnya, maka hal itu lebih baik bagi orang-orang yang sabar di antara kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "126-128. Hai orang-orang beriman, jika kalian bertekad untuk membalas orang yang menzalimi kalian, maka balaslah dengan balasan yang setimpal dan jangan melebihi kezaliman yang kalian terima. Namun sungguh jika kalian memaafkan dan tidak membalas maka itu lebih baik bagi kalian, sehingga dengan begitu kalian dapat meraih derajat orang-orang yang bersabar. Hai Muhammad, Bersabarlah atas apa yang menimpamu di jalan Allah karena kamu tidak akan meraih derajat yang tinggi kecuali dengan pertolongan Allah. Dan janganlah kamu bersedih terhadap orang-orang kafir yang tidak beriman kepadamu, serta janganlah kamu gundah akibat makar dan tipu daya mereka. Sungguh Allah bersama orang-orang yang bertakwa kepada-Nya dengan mematuhi segala perintah dan menjauhi segala larangan-Nya. Dan Allah bersama orang-orang yang baik dalam perkataan dan perbuatannya melalui pertolongan dan bantuan-Nya; dan cukuplah hal itu sebagai kebanggaan dan kemenangan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "126. وَإِنْ عَاقَبْتُمْ (Dan jika kamu memberikan balasan) Yakni jika kalian ingin membalas seseorang. فَعَاقِبُوا۟ بِمِثْلِ مَا عُوقِبْتُم بِهِۦ ۖ( maka balaslah dengan balasan yang sama dengan siksaan yang ditimpakan kepadamu) Yakni seperti apa yang dilakkukan terhadapmu tanpa melebihkannya. وَلَئِن صَبَرْتُمْ(Akan tetapi jika kamu bersabar) Dan tidak mengambil hak kalian atas orang yang telah menzalimi kalian pada saat kalian mampu membalasnya. لَهُوَ خَيْرٌ لِّلصّٰبِرِينَ(sesungguhnya itulah yang lebih baik bagi orang-orang yang sabar) Yakni kesabaran lebih baik bagi kalian daripada menuntut balas."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "126. Dan jika kalian menghendaki untuk memberi balasan wahai orang-orang muslim, maka balaslah dengan tindakan dan balasan buruk yang serupa. Dan jika kalian memilih sabar dan tidak membalas, maka kesabaran itu lebih baik dari pada balas dendam. Ayat ini turun ketika Hamzah mati syahid di tangan seseorang dan disiksa, lalu Nabi SAW bersabda: “Sungguh aku akan kulakukan hal serupa kepada 70 orang di antara mereka seperti yang mereka lakukan kepada Hamzah” lalu Nabi bertaubat dari janjinya dan tidak jadi balas dendam. Dan kalimat {‘Uuqibtum bihi} yaitu kalian disakiti dengan hal serupa itu. Hal ini untuk menamai penyebab menggunakan nama akibat dan hasil dari tindakan itu, seperti contoh: Langit menyirami tanaman. Maksudnya yaitu air hujan yang menyebabkan tumbuhnya tanaman."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika kalian membalas, maka balaslah dengan (balasan) yang sama dengan siksaan yang ditimpakan kepada kalian. Sungguh jika kalian bersabar, hal itu benar-benar lebih baik bagi orang-orang yang sabar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "126. Allah berfirman untuk memperbolehkan (pembalasan yang) adil dan menganjurkan sikap utama dan kebaikan, “Dan jika kamu memberikan balasan,” barangsiapa yang melancarkan perbuatan buruk kepada kalian lewat ucapan dan tindakan, “maka balaslah dengan balasan yang sama dengan apa yang dia perlakukan kepada kalian. “Akan tetapi jika kamu bersabar,” (untuk tidak melakukan) pembalasan, dan kalian memaafkan kejahatannya, “sesungguhnya itulah yang lebih baik bagi orang-orang yang sabar,” daripada melancarkan pembalasan. Pahala di sisi Allah lebih baik bagi kalian, dan lebih baik kesudahannya, sebagaimana Firman Allah, \"barang siapa yang memafkan dan berbuat islah maka pahalanya disisi Allah\" (Asy-Syura :40)."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (لَهُوَ خَيۡرٞ لِّلصَّٰبِرِينَ) lahuwa khairul lish shaabiriin : lebih baik dari pada menghukum sebagai sanksi. Makna ayat: Firman-Nya ta’ala “Dan jika kalian membalas, maka balaslah dengan balasan yang sama dengan siksaan yang ditimpakan kepada kalian” tidak lebih “Tetapi jika kalian bersabar,” kalian tidak membalasnya “yang demikian” kesabaran kalian “lebih baik” bagi kalian dari membalas keburukan dan kejahatan. Pelajaran dari ayat: • Boleh menghukum dengan menyiksa sesuai dengan kadar yang dilakukan. Meninggalkannya karena kesabaran dan mengharap pahala adalah lebih baik."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 126: Tirmidzi meriwayatkan dengan sanadnya yang sampai kepada Ubay bin Ka’ab ia berkata, “Ketika perang Uhud, 64 orang Anshar mendapat musibah (terbunuh), sedangkan dari kalangan muhajirin (yang terbunuh) ada enam orang, di antaranya Hamzah. Orang-orang musyrik mencincang mereka, maka orang-orang Anshar berkata, “Sungguh, jika suatu hari kami berhasil membunuh mereka, maka kami akan mencincang melebihi mereka.” Saat tiba penaklukkan Mekah, Allah Subhaanahu wa Ta'aala menurunkan ayat, “Dan jika kamu membalas, maka balaslah dengan (balasan) yang sama dengan siksaan yang ditimpakan kepadamu. Tetapi jika kamu bersabar, sesungguhnya itulah yang lebih baik bagi orang yang sabar.” Lalu ada seorang yang berkata, “Tidak ada orang Quraisy setelah hari ini.” Maka Rasulullah shallallahu 'alaihi wa sallam bersabda, “Tahanlah terhadap mereka selain empat orang.” (Hadits ini hadits hasan gharib dari hadits Ubay bin Ka’ab. Syaikh Muqbil berkata, “Hadits ini disebutkan pula dalam Musnad Ahmad dari Zawaa’id Abdullah juz 5 hal. 135, Ibnu Hibban sebagaimana dalam Al Mawaarid hal. 411, Thabrani dalam Al Kabir juz 3 hal. 157, Hakim juz 2 hal. 359 dan 446, dan pada kedua tempat itu, ia berkata, “Shahih isnadnya”, dan didiamkan oleh Adz Dzahabi). Maksudnya pembalasan yang dijatuhkan atas mereka janganlah melebihi dari siksaan yang ditimpakan kepada kita. Dengan tidak membalas dendam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 126",
    "description": "Ayat ini memberi tuntunan kepada nabi Muhammad tentang tata cara berdakwah dan membalas perbuatan orang yang menyakitinya, dan jika kamu membalas terhadap siapa pun yang telah menyakiti atau menyiksamu dalam berdakwah, maka balas dan hukum-lah mereka dengan balasan yang sama, yakni setimpal, dengan siksaan atau kesalahan yang ditimpakan kepadamu; jangan kaubalas mereka lebih dari itu. Tetapi jika kamu bersabar dan tidak membalas apa yang mereka lakukan kepadamu, sesungguhnya itulah yang lebih baik bagi orang yang sabar. Sabar adalah sikap yang mulia, karena itu Allah memerintahkan nabi Muhammad untuk bersabar. Allah berfirman, dan bersabarlah, wahai nabi Muhammad, dalam menghadapi tantangan dan cobaan hidup serta penolakan orang kafir terhadap seruanmu, dan ketahuilah bahwa kesabaranmu itu semata-mata dengan pertolongan Allah. Dan janganlah engkau bersedih hati terhadap penolakan dan kekafiran mereka, dan jangan pula engkau bersempit dada terhadap tipu daya yang mereka rencanakan untuk menghalagi seruanmu."
  }
]