[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan besabarlah kamu (wahai rasul), terhadap gangguan yang menimpamu di jalan Allah sampai datang kepadamu jalan keluar. Dan tidaklah kesabaranmu melainkan dengan pertolongan Allah yang menolongmu untuk tetap bersabar dan meneguhkan(hati) mu, dan janganlah kamu bersedih menghadapi orang yang menentangmu dan tidak menyambut dakwahmu, dan janganlah kamu berduka terhadap makar dan tipu daya mereka. Sesunggguhnya tindakan mereka itu akan berbalik kepada mereka dengan keburukan dan kejelekan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "127. Bersabarlah -wahai Rasul- atas apa yang menimpamu berupa gangguan mereka, pertolongan untuk sabar yang kamu dapatkan hanya karena taufik dari Allah kepadamu, maka jangan bersedih karena orang-orang kafir berpaling darimu, jangan sempit dada karena ulah mereka berupa tipu daya dan makar."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "127. وَاصْبِرْ (Bersabarlah) Atas segala yang ditimpakan kepadamu yang bertujuan untuk menyakitimu. وَمَا صَبْرُكَ إِلَّا بِاللهِ ۚ( dan tiadalah kesabaranmu itu melainkan dengan pertolongan Allah) Yakni dengan taufik dan peneguhan dari Allah. وَلَا تَحْزَنْ عَلَيْهِمْ(dan janganlah kamu bersedih hati terhadap (kekafiran) mereka) Yakni terhadap orang-orang kafir yang berpaling darimu. وَلَا تَكُ فِى ضَيْقٍ (dan janganlah kamu bersempit dada) Yakni janganlah merasa sempit dadamu. مِّمَّا يَمْكُرُونَ (terhadap apa yang mereka tipu dayakan) Tipu daya yang diarahkan kepadamu di masa mendatang."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ وَاصْبِرْ وَمَا صَبْرُكَ إِلَّا بِاللَّهِ } \"Bersabarlah (hai Muhammad) dan tiadalah kesabaranmu itu melainkan dengan pertolongan Allah\" mintalah dengan sabarmu pertolongan kepada Allah, dan keridhoan terhadap semua taqdir yang ditetapkan oleh-Nya, dan selalu menunggu kelapangan dari-Nya, dan mengharap balasan hanya dari-Nya saja: { إِنَّمَا يُوَفَّى الصَّابِرُونَ أَجْرَهُمْ بِغَيْرِ حِسَابٍ } \"Sesungguhnya hanya orang-orang yang bersabarlah Yang dicukupkan pahala mereka tanpa batas\" [ az-Zumar : 10 ] ."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "127. Wahai Nabi, bersabarlah atas penderitaan di jalan dakwahmu. Dan kesabaranmu itu tidak lain karena pertolongan dan penguatan Allah. Janganlah bersedih atas penolakan orang kafir terhadap dakwahmu. Dan jangan sampai hatimu ciut karena tipu daya mereka terhadapmu. Sesungguhnya Allah menolongmu atas mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bersabarlah dan kesabaranmu itu semata-mata dengan (pertolongan) Allah} dengan pertolongan dan bantuan Allah {dan janganlah bersedih terhadap mereka, dan janganlah} dan janganlah {bersempit hati} berduka {terhadap tipu daya yang mereka rencanakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "127-128. kemudian Allah memerintahkan RosulNya untuk bersabar ketika mendakwahi umat manusia menuju Alah dan meminta pertolongan kepadaNya dalam menjalankannya, serta tidak bersandar pada diri sendiri semata. Allah berfirman “bersabarlah (hai Muhammad dan tiadalah kesabaranmu itu melainkan dengan pertolongan Allah,” Allah-lah yang menolong dan meneguhkanmu “dan janganlah kamu bersedih hati terhadap (kekafiran) mereka” jika engkau telah menyeru mereka, namun tidak melihat gejala sambutan terhadap dakwahmu. Maka sesungguhnya kesedihan sama sekali tidak berguna bagimu. “dan janganlah kamu bersempit dada: maksudnya kegetiran dan ketidaknyamanan “terhadap apa yang mereka tipudayakan”, karena susungguhnya perbuatan makar mereka hanya berbalik kepada mereka. Engkau sendiri termasuk orang-orang yang bertaqwa lagi berbuat baik. Allah bersama orang-orang yang bertakwa lagi berbuat baik dengan pertolongan, taufik dan bimbinganNya. Mereka itu adalah orang-orang yang menjaga diri dari kekufuran dan maksiat, dan telah berbuat baik dalam ibadah mereka kepada Allah, dengan cara menyembahNYa seolah-olah melihatNYa, lalu jika mereka tidak melihatNya, maka (mereka yakin) bahwa Allah melihat mereka, dan mereka berbuat ihsan kepada sesame dengan mencurahkan kemanfaatan bagi mereka dari semua sisi. Kami memohon kepada Allah untuk menjadikan kita sekalian dari kalangan orang-orang yang bertakwa dan berbuat ihsan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (وَلَا تَكُ فِي ضَيۡقٖ مِّمَّا يَمۡكُرُونَ) wa laa taku fi dhaiqim mimmaa yamkuruun : jangan hiraukan makar mereka dan janganlah hatimu menjadi sempit. Makna ayat: Firman-Nya ta’ala “Dan bersabarlah” untuk tidak menyiksa kaum musyrikin sebagaimana yang mereka lakukan kepada pamanmu Hamzah. Allah memerintahkannya untuk bersabar, dan mengaruskannya untuk tidak membalas dan menyiksa mereka pada waktu yang sama. Firman-Nya ta’ala “dan kesabaranmu itu semata-mata dengan pertolongan Allah” dengan taufik dan bantuan-Nya, maka berdoalah kepada Rabbmu kesabaran, sebagaimana Dia telah memberikan engkau pertolongan dan kemenangan. Firman-Nya ta’ala “dan janganlah engkau bersedih hati” karena mereka tidak mendapat hidayah menuju kebenaran dan meniti jalan-Nya; Islam “dan jangan pula bersempit dada” sehingga menyakitkanmu “terhadap tipu daya yang mereka rencanakan.” Untukmu, karena Allah ta’ala yang akan menjagamu dari makar dan keburukan mereka, Allah bersamamu, maka janganlah takut dan bersedih hati, karena Allah bersama orang-orang yang berbuat kebaikan, dan engkau termasuk dari mereka"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 127: Allah Subhaanahu wa Ta'aala memerintahkan Rasul-Nya untuk bersabar ketika mengajak manusia kepada Allah serta meminta pertolongan kepada-Nya dan tidak bersandar kepada diri. Yakni Dialah yang membantumu untuk bersabar dan meneguhkanmu di atasnya. Yakni jangan bersedih ketika kamu berdakwah kemudian dakwahmu ditolak. Yakni jangan pedulikan. Karena makar tersebut kembalinya kepada mereka. Adapun engkau, maka engkau termasuk orang-orang yang bertakwa dan berbuat ihsan, sedangkan Allah bersama orang-orang yang bertakwa dan berbuat ihsan. Bertakwa adalah dengan menjauhi kufur dan kemaksiatan, sedangkan berbuat ihsan adalah dengan beribadah kepada Allah seakan-akan melihat-Nya, atau merasakan pengawasan dari-Nya. Termasuk pula berbuat ihsan kepada manusia, yaitu dengan memberikan manfaat dari berbagai sisi. Kita meminta kepada Allah agar Dia menjadikan kita termasuk orang-orang yang bertakwa dan berbuat ihsan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 127",
    "description": "Sabar adalah sikap yang mulia, karena itu Allah memerintahkan nabi Muhammad untuk bersabar. Allah berfirman, dan bersabarlah, wahai nabi Muhammad, dalam menghadapi tantangan dan cobaan hidup serta penolakan orang kafir terhadap seruanmu, dan ketahuilah bahwa kesabaranmu itu semata-mata dengan pertolongan Allah. Dan janganlah engkau bersedih hati terhadap penolakan dan kekafiran mereka, dan jangan pula engkau bersempit dada terhadap tipu daya yang mereka rencanakan untuk menghalagi seruanmu. Ketahuilah bahwa sungguh, Allah beserta orang-orang yang bertakwa, yang menjaga diri dari murka-Nya dengan melaksanakan perintah-Nya dan meninggalkan larangan-Nya, dan bersama orang-orang yang berbuat kebaikan kepada orang lain yang pernah berbuat buruk kepada mereka."
  }
]