[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya Allah dengan taufik, pertolongan, dan pembelaanNya , bersama orang-orang yang takut kepadaNya dengan melaksanakan perintah-perintahNya dan menjauhi apa-apa yang Dia larang, dan juga bersama orang-orang yang berbuat baik dalam menunaikan apa-apa yang Dia fardhukan dan melaksanakan hak-hakNYa, dan senantiasa taat kepadaNYa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "128. Sesungguhnya Allah bersama orang-orang bertakwa yang tidak bermaksiat kepada-Nya, dan orang-orang yang berbuat baik dengan melakukan ketaatan, melaksanakan apa yang diperintahkan kepada mereka, Allah bersama mereka dengan pertolongan dan dukungan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "128. إِنَّ اللهَ مَعَ الَّذِينَ اتَّقَوا۟ (Sesungguhnya Allah beserta orang-orang yang bertakwa) Yakni yang bertakwa kepada Allah dengan meninggalkan perbuatan maksiat. وَّالَّذِينَ هُم مُّحْسِنُونَ(dan orang-orang yang berbuat kebaikan) Dengan menjalankan ketaatan dan mendirikan apa yang diperintahkan kepada mereka. Merekalah orang-orang yang akan diberi pertolongan oleh Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "128. Sesungguhnya Allah bersama orang-orang yang takut dari perbuatan maksiat dan hal-hal yang diharamkan dengan meminta pertolongan dan penguatan. Dia juga bersama orang-orang yang selalu baik dalam melaksanakan ketaatan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya Allah bersama orang-orang yang bertakwa dan yang berbuat kebaikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "127-128. kemudian Allah memerintahkan RosulNya untuk bersabar ketika mendakwahi umat manusia menuju Alah dan meminta pertolongan kepadaNya dalam menjalankannya, serta tidak bersandar pada diri sendiri semata. Allah berfirman “bersabarlah (hai Muhammad dan tiadalah kesabaranmu itu melainkan dengan pertolongan Allah,” Allah-lah yang menolong dan meneguhkanmu “dan janganlah kamu bersedih hati terhadap (kekafiran) mereka” jika engkau telah menyeru mereka, namun tidak melihat gejala sambutan terhadap dakwahmu. Maka sesungguhnya kesedihan sama sekali tidak berguna bagimu. “dan janganlah kamu bersempit dada: maksudnya kegetiran dan ketidaknyamanan “terhadap apa yang mereka tipudayakan”, karena susungguhnya perbuatan makar mereka hanya berbalik kepada mereka. Engkau sendiri termasuk orang-orang yang bertaqwa lagi berbuat baik. Allah bersama orang-orang yang bertakwa lagi berbuat baik dengan pertolongan, taufik dan bimbinganNya. Mereka itu adalah orang-orang yang menjaga diri dari kekufuran dan maksiat, dan telah berbuat baik dalam ibadah mereka kepada Allah, dengan cara menyembahNYa seolah-olah melihatNYa, lalu jika mereka tidak melihatNya, maka (mereka yakin) bahwa Allah melihat mereka, dan mereka berbuat ihsan kepada sesame dengan mencurahkan kemanfaatan bagi mereka dari semua sisi. Kami memohon kepada Allah untuk menjadikan kita sekalian dari kalangan orang-orang yang bertakwa dan berbuat ihsan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (مَعَ ٱلَّذِينَ ٱتَّقَواْ) ma’al ladziinat taqau : yaitu mereka menjauh dari syirik dan maksiat. (وَّٱلَّذِينَ هُم مُّحۡسِنُونَ) wal ladziina hum muhsinuun : yaitu dalam ketaatan kepada Allah, kebersamaan-Nya ta’ala yaitu pertolongan dan bantuan-Nya kepada mereka di dunia. Makna ayat: “Sungguh Allah bersama dengan orang-orang yang bertakwa dan yang berbuat baik.” Allah ta’ala mengkabarkan rasul-Nya dan kaum mukminin bahwasanya, pertolongan, bantuan, dan taufik-Nya bersama dengan orang-orang yang menjauhi syirik dan maksiat, tidak meninggalkan kewajiban agamanya, tidak melanggar hal-hal yang haram. Dan orang-orang yang berbuat baik dengan taat kepada Rabb mereka, dengan niat dan tujuan yang ikhlas, serta mengerjakannya sesuai dengan apa yang Allah syariatkan dan dijelaskan Rasulullah shallallahu ‘alaihi wa sallam. Pelajaran dari ayat: • Kebersamaan Allah ta’ala benar adanya bagi orang-orang yang bertakwa dan berbuat baik. Yaitu pertolongan, bantuan, dan taufik bersama mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 128: Dengan memberikan bantuan, pertolongan dan taufiq-Nya.."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 128",
    "description": "Ketahuilah bahwa sungguh, Allah beserta orang-orang yang bertakwa, yang menjaga diri dari murka-Nya dengan melaksanakan perintah-Nya dan meninggalkan larangan-Nya, dan bersama orang-orang yang berbuat kebaikan kepada orang lain yang pernah berbuat buruk kepada mereka. Pada akhir surah an-nahl mengandung pesan kepada nabi Muhammad agar bersabar dan tidak bersedih hati disebabkan tipu daya dan penolakan orang-orang yang menentang dakwahnya. Di saat beliau mengalami kesulitan menghadapi orang-orang kafir yang menolak dakwahnya, ayat pertama dari surah ini menyatakan bahwa beliau mempunyai kedudukan yang mulia di sisi Allah, di mana Allah memperjalankannya dari masjidilharam ke masjidil aqsha dan memperlihatkan kepadanya tanda-tanda kekuasaan dan kebesarannya. Ayat pertama ini menyatakan, maha suci Allah, yang telah memperjalankan hamba-Nya, yakni nabi Muhammad, pada malam hari dari masjidilharam, yang berada di mekah ke masjidil aqsa, yang berada di palestina, yang telah kami berkahi sekelilingnya, dengan tanahnya yang subur yang menghasilkan aneka tanaman dan buah-buahan serta menjadi tempat turunnya para nabi, agar kami perlihatkan kepadanya dengan mata kepala atau mata hati sebagian dari tanda-tanda kebesaran dan kekuasaan kami. Sesungguhnya dia, yaitu Allah adalah maha mendengar perkataan hamba-Nya, maha mengetahui tingkah laku dan perbuatannya."
  }
]