[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Dia menundukan bagi kalian apa yang diciptakaNya di bumi berupa binatang-binatang ternak, buah-buahan, bahan-bahan tambang dan lain-lain yang berbeda-beda warna dan kegunaanya. Sesungguhnya dalam penciptaan obyek-obyek tesebut dan perbedaan warna dan kegunaanya benar-benar terdapat pelajaran bagi orang-orang yang mau mengambil pelajaran dan menyadari bahwa dalam pengendalian hal-hal tersebut terdapat tanda-tanda keesaan Allah dan keesaaNya untuk diibadahi."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "13. Allah -Subḥānahu- menundukkan untuk kalian apa yang Dia ciptakan di bumi, yaitu berbagai macam barang tambang, hewan-hewan, pohon-pohon dan tanaman-tanaman. Sesungguhnya pada penciptaan dan penundukan tersebut terkandung petunjuk yang jelas atas kekuasaan Allah -Subḥānahu- bagi kaum yang mau mengambil pelajaran darinya dan mengetahui bahwa Allah Mahakuasa dan Maha memberi nikmat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "13. Dan Allah menciptakan bagi kalian makhluk-makhluk di bumi yang berbeda-beda ukuran, warna, dan manfaatnya, baik itu berupa tanaman, hewan, atau benda mati. Sungguh dalam ciptaan yang banyak itu terdapat ibrah bagi orang yang mau mengambil pelajaran darinya dan beriman kepada Penciptanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "13. وَمَا ذَرَأَ لَكُمْ فِى الْأَرْضِ مُخْتَلِفًا أَلْوٰنُهُۥٓ ۗ (dan Dia (menundukkan pula) apa yang Dia ciptakan untuk kamu di bumi ini dengan berlain-lainan macamnya) Yakni dan makhluk-makhluk di bumi yang Allah ciptakan bagi kalian dengan warna yang berbeda-beda merupakan tanda besar yang menunjukkan wujud Sang Pencipta dan keesaan-Nya. Allah menciptakannya dengan berbagai warna agar dapat menimbulkan kesenangan dalam diri manusia; berbeda halnya jika makhluk-makhluk ini hanya memiliki satu warna. لَاٰيَةً (terdapat tanda (kekuasaan Allah)) Yang jelas. لِّقَوْمٍ يَذَّكَّرُونَ(bagi kaum yang mengambil pelajaran) Dan orang yang mengambil pelajaran akan menggunakannya sebagai petunjuk kepada tujuan hakiki."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13. Dia juga menundukkan apa yang Dia ciptakan untuk kamu di bumi ini dengan segala macamnya baik berupa hewan tumbuhan dan benda mati. Sesungguhnya pada yang demikian itu benar-benar terdapat tanda kekuasaan Allah bagi kaum yang mengambil pelajaran dan mensyukuri nikmat Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan apa yang Dia ciptakan} ciptakan {untuk kalian di bumi ini dengan berbagai jenis dan macam warnanya. Sesungguhnya pada yang demikian itu benar-benar terdapat tanda bagi kaum yang mengambil pelajaran} mengambil pelajaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "13. maksudnya, pada benda benda yang Allah ciptakan dan tebar bagi para hambaNya, berupa semua wujud yang berada dipermukaan bumi, seperti binatang binatang, pepohonan, tanam tanaman dan lain sebagainya, yang berbeda beda warnanya dan bervariasi kegunaannya terdapat bukti kesempurnaan kekuasaan Allah dan meratanya curahan kebaikan dan luasnya kebajikannya, dan bahwa Dialah Dazat yang tidak sepatutnya ibadah (dikerjakan) kecuali bagiNya semata, tiada sekutu bagiNya. “bagi kaum yang mengambil pelajaran” yaitu yang membayangkan dalam ingatan mereka hal hal yang bermanfaat bagi mereka, berupa ilmu yang berguna dan merenungkan obyek obyek yang Allah mengajak mereka untuk merenunginya. Dengan itu, mereka memikirkan hal hal yang menjadi bukti tentang Allah."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (وَمَا ذَرَأَ لَكُمۡ فِي ٱلۡأَرۡضِ) wa maa dzara`a lakum fil ardhi : “dan apa yang Dia ciptakan untukmu di bumi ini” segala sesuatu yang Allah ciptakan untuk kalian di bumi, berupa hewan dan tetumbuhan yang bermacam-macam. Makna ayat: Firman-Nya “Apa yang telah Dia ciptakan bagi kalian di bumi” apa yang telah Alah ciptakan untuk kalian di bumi berupa: manusia, hewan, dan tumbuhan “dengan berbagai jenis dan macam warnanya.” Kelebihan, bentuk, manfaat, dan pengaruhnya. “Sungguh pada yang demikian itu” penciptaan yang mengagumkan “benar-benar terdapat tanda kebesaran Allah” tanda-tanda yang jelas akan keberadaan Sang Pencipta ‘azza wa jalla serta keharusan beribadah kepada-Nya, dan meninggalkan peribadatan kepada selain-Nya “bagi kaum yang mengambil pelajaran.” Mengambil pelajaran kemudian mematuhi Rabb mereka dengan beribadah kepada-Nya, mengikuti perintah-Nya dan menjauhi larangan-Nya, sehingga mereka bisa mendapatkan kesempurnaan dan kebahagiaan dengannya di dunia dan akhirat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 13: Seperti hewan, tumbuh-tumbuhan dan lain-lain. Dan meratanya ihsan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 13",
    "description": "Dan Allah pula yang menundukkan apa yang dia ciptakan untukmu di bumi ini, seperti binatang dan tumbuhan, dengan berbagai jenis dan macam warna serta bentuk-Nya. Sungguh, pada yang demikian itu, yaitu pengembangbiakan binatang dan tumbuhan ke dalam berbagai warna, bentuk, dan macamnya itu, benar-benar terdapat tanda keesaan dan kekuasaan Allah bagi kaum yang mau mengambil pelajaran. Dan dia-lah yang menundukkan untukmu lautan yang terhampar luas dan menjadikannya tempat tinggal bagi binatang-binatang laut dan tumbuh kembang aneka perhiasan. Hal ini dimaksudkan agar kamu dapat menangkap ikan-ikannya dan memakan daging yang segar darinya, dan dari lautan itu pula kamu dapat mengeluarkan benda-benda yang bernilai tinggi, seperti mutiara, permata, dan semacamnya untuk menjadi perhiasan yang kamu pakai. Di samping itu, kamu juga melihat perahu pembawa barang-barang berat dan bahan-bahan makanan dapat berlayar padanya dengan mudah atas izin Allah. Dan dia menundukkan laut agar kamu dapat memanfaatkannya dan mencari rezeki dari sebagian karunia-Nya yang terdapat di sana, dan agar kamu selalu bersyukur atas nikmat-nikmat yang dianugerahkan-Nya kepada kamu serta memanfaatkannya sesuai tujuan penciptaannya."
  }
]