[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Dia-lah yang menundukan laut bagi kalian, agar dapat mengomsumsi daging yang segar dari apa yang kalian buru dari hasli ikannya, dan kalian dapat menambang dari jenis perhiasan yang kalian kenakan seperti intan dan permata, dan kamu melihat kapal-kapal besar mambelah permukaan air laut, berlayar pergi dan datang, dan kalian menumpanginya, untuk mencari rizki Allah melalui perniagaan dan meraup keuntungan di dalamnya. Dan mudah-mudahan kalian mensyukuri Allah atas besarnya kenikmatanNya kapada kalian, sehingga tidak menyembah selainNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Allah -Subḥānahu- menundukkan lautan untuk kalian. Allah membuat kalian mampu berlayar dan mengeluarkan isi kandungannya untuk kalian makan dari apa yang kalian tangkap berupa daging ikan yang lembut lagi segar, dan darinya kalian mengeluarkan perhiasan yang dipakai oleh kaum wanita kalian seperti mutiara. Kamu melihat kapal-kapal membelah ombak lautan, kalian menaiki perahu-perahu untuk mencari karunia Allah berupa laba perdagangan dan dengan harapan kalian mau bersyukur kepada Allah atas apa yang telah Dia limpahkan sebagai nikmat kepada kalian dan kalian mengesakan-Nya dengan menyembah hanya kepada-Nya semata."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "14. Allah menundukkan lautan bagi kalian agar kalian dapat memakan daging yang lembut dan nikmat dari ikan dan sejenisnya, dan agar kalian dapat mengeluarkan perhiasan setelah menyelam untuk mendapatkan mutiara dan marjan. Dan kamu melihat kapal-kapal yang membelah ombak lautan ketika pulang dan pergi mengangkut barang-barang kalian. Dan agar kalian dapat mencari rezeki dengan berniaga sehingga kalian dapat bersyukur kepada Tuhan kalian dengan perkataan dan perbuatan atas segala kenikmatan yang tidak terhitung ini."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "14. وَهُوَ الَّذِى سَخَّرَ الْبَحْرَ (Dan Dialah, Allah yang menundukkan lautan (untukmu)) Dengan memberi kalian kemampuan untuk berlayar diatasnya dan mengeluarkan kandungannya berupa ikan-ikan dan perhiasan. لِتَأْكُلُوا۟ مِنْهُ لَحْمًا طَرِيًّا(agar kamu dapat memakan daripadanya daging ikan yang segar) Allah menyebutkan sifat segar bagi ikan itu untuk menunjukkan kelembutan dan kasih sayang-Nya. وَتَسْتَخْرِجُوا۟ مِنْهُ حِلْيَةً تَلْبَسُونَهَا(dan kamu mengeluarkan dari lautan itu perhiasan yang kamu pakai) Yakni Mutiara dan batu mulia, yang boleh dipakai oleh kaum pria sebagaimana dibolehkan bagi kaum wanita. Pendapat lain mengatakan yang dimaksud adalah agar dapat dipakai oleh para kaum wanita, dan Allah menyebutkan تَلْبَسُونَهَا (yang kamu (laki-laki) pakai) karena para wanita memakainya demi kaum pria. وَتَرَى الْفُلْكَ مَوَاخِرَ فِيهِ(dan kamu melihat bahtera berlayar padanya) Yakni kamu melihat kapal-kapal berlayar di lautan yang membelah permukaan air dengan bagian depannya. وَلِتَبْتَغُوا۟ مِن فَضْلِهِۦ(dan supaya kamu mencari (keuntungan) dari karunia-Nya) Yakni agar kalian dapat berdagang dengannya sehingga kalian dapat mendapatkan keuntungan yang merupakan bagian dari karunia Allah. وَلَعَلَّكُمْ تَشْكُرُونَ(dan supaya kamu bersyukur) Yakni jika kalian mendapati karunia Allah dilimpahkan kepada diri kalian dan kalian mengakuinya maka kalian akan bersyukur dengan lisan dan perbuatan kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14. Dialah, Allah yang menundukkan lautan untukmu, agar kamu dapat memakan daging yang segar berupa ikan dari hasil pancingan. Kamu juga dapat mengeluarkan berbagai perhiasan yang dapat kamu pakai berupa mutiara dan marjan dari lautan itu. Kamu dapat melihat perahu-perahu berlayar di atasnya, dan supaya kamu bisa mencari keuntungan dari karunia-Nya, serta supaya kamu bersyukur atas nikmat-Nya sehingga dapat mengetahui hak-hak-Nya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dialah yang menundukkan lautan agar kalian dapat memakan daging yang segar darinya} ikan yang enak dan lembut {dan kalian mengeluarkan darinya perhiasan} perhiasan {yang kalian pakai. Kalian melihat perahu} bahtera {berlayar di atasnya} membelah lautan dengan berlayar di atasnya {dan agar kalian mencari sebagian karuniaNya, dan agar kalian bersyukur"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "14. maknanya “Dan” Dialah Dzat yang sendiri, tidak ada sekutu bagiNya “yang menundukkan lautan (untukmu)” dan menyediakannya demi kemanfaatan kemanfaatan kalian yang variatif, ”agar kamu dapat memakan darinya daging yang segar (ikan)” yaitu ikan ikan dan binatang air yang kalian buru, ”dan kamu mengeluarkan dari lautan itu perhiasan yang kamu pakai” sehingga menambah keindahan dan kelokan kalian atas pesona yang sudah melekat pada kalian. “dan kamu melihat bahtera” yaitu kapal kapal dan perahu perahu “berlayar padanya” yaitu membelah lautan yang bergelombang lagi menakutkan, dengan moncong bagian depannya sehingga dapat berlalu di atasnya dari satu wilayah ketempat lain, membawa para penumpang, hasil hasil rizki mereka, barang bawaan serta perniagaan mereka yang mereka jadikan sarana untuk mengais rizki rizki dan kemurahan Allah atas mereka. “dan supaya kamu bersyukur” (kepada Dzat) yang telah memudahkan semua ini bagi kalian dan menyuguhkannya, dan menyanjung Allah atas karuniaNya atas kalian. Bagi Allah segala pujian, syukur dan sanjungan. Pasalnya, Allah telah memberikan bagi hamba hambaNya hal hal yang menjadi kemaslahatan dan kepentingan mereka, melebihi apa yang mereka cari dan lebih tinggi daripada sesuatu yang mereka harapkan. Dia menganugrahi mereka segala yang mereka minta. Kita tidak dapat menghitung sanjungan atasNya, akan tetapi Dia adalah sebagaimana Dia menyanjung diriNya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (حِلۡيَةٗ تَلۡبَسُونَهَاۖ) hilyatan talbasuunahaa : “perhiasan yang kamu pakai.” Mutiara dan marjan. (مَوَاخِرَ فِيهِ) mawaakhira fiih : “berlayar padanya” berlayar di atasnya pulang dan pergi dengan angin yang sama, dan dengan uap pada hari itu. (مِن فَضۡلِهِۦ) min fadhlih : “sebagian karunia-Nya” dari karunia Allah ta’ala dengan perdagangan. Makna ayat: Konteks ayat yang mulia masih dalam menjelaskan tanda-tanda kekuasaan Allah, ilmu, hikmah, dan kasih sayang-Nya, itu merupakan tanda-tanda yang berkonsekuensi mengesakan-Nya, hanya mempersembahkan ibadah kepada-Nya, bersyukur, dan mengingat-Nya. Firman-Nya “Dan Dialah yang menundukkan lautan.” Yaitu seluruh air yang melimpah dan banyak baik tawar atau asin, Dia menundukkanya agar mempermudah menyelam di dalamnya dan kapal dapat berlayar di atasnya. Firman-Nya “agar kalian memakan daging yang segar darinya dan mengeluarkan darinya perhiasan yang kalian pakai.” Menjelaskan sebab menundukkan lautan, yaitu agar manusia memancing darinya ikan untuk dimakan dan mengeluarkan mutiara dan marjan untuk perhiasan wanita mereka. Firman-Nya “dan engkau melihat bahtera-bahtera berlayar di atasnya.” Engkau akan melihat kapal-kapal membelah air, pulang-pergi. Firman-Nya “dan agar kalian mencari” Dia menundukkan lautan dan kapal, agar kalian dapat mencari rizki dengan berdagang dengan memindah barang dagangan dari daerah ke daerah yang lain, ini semua merupakan karunia dari Allah dan kekuatan-Nya “dan agar kalian bersyukur.” Agar kalian bersyukur kepada Allah ta’ala, Dia menundukkan laut agar kalian mencari rizki dari karunia-Nya, kalian makan darinya kemudian bersyukur kepada Allah atas hal itu. Syukur bisa berupa dengan memuji Allah dan mengakui segala nikmat-Nya dan menggunakannya untuk mencari ridha-Nya. Pelajaran dari ayat: • Penjelasan sebab adanya rizki, yaitu syukur. Allah subhanahu wa ta’ala memberi rizki agar manusia bersyukur kepada-Nya. • Boleh memakan daging ikan dan seluruh hewan laut. • Tidak ada zakat untuk mutiara dan marjan, karena keduanya adalah perhiasan untuk wanita."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 14: Agar dapat dilalui dengan perahu dan dapat diselami. Seperti mutiara dan marjan. Seperti dengan berdagang. Karena Dia telah memberikan kepada manusia segala maslahat dan kebutuhannya, bahkan menambah melebihi kebutuhan mereka, serta memberikan semua yang mereka minta. Sungguh kita tidak sanggup menjumlahkan pujian untuk-Nya, bahkan Dia sebagaimana pujian-Nya terhadap diri-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 14",
    "description": "Dan dia-lah yang menundukkan untukmu lautan yang terhampar luas dan menjadikannya tempat tinggal bagi binatang-binatang laut dan tumbuh kembang aneka perhiasan. Hal ini dimaksudkan agar kamu dapat menangkap ikan-ikannya dan memakan daging yang segar darinya, dan dari lautan itu pula kamu dapat mengeluarkan benda-benda yang bernilai tinggi, seperti mutiara, permata, dan semacamnya untuk menjadi perhiasan yang kamu pakai. Di samping itu, kamu juga melihat perahu pembawa barang-barang berat dan bahan-bahan makanan dapat berlayar padanya dengan mudah atas izin Allah. Dan dia menundukkan laut agar kamu dapat memanfaatkannya dan mencari rezeki dari sebagian karunia-Nya yang terdapat di sana, dan agar kamu selalu bersyukur atas nikmat-nikmat yang dianugerahkan-Nya kepada kamu serta memanfaatkannya sesuai tujuan penciptaannya. Dan dia yang mahakuasa itu pula yang telah menancapkan gunung dengan kukuh dan kuat di bumi tempat kamu tinggal agar bumi itu tidak goncang bersama kamu. Dan dia pula yang menciptakan sungai-sungai yang mengalirkan air untuk dimanfaatkan oleh makhluk hidup, dan di atas bumi itu pula Allah menciptakan jalan-jalan yang terbentang agar kamu mendapat petunjuk, baik menuju arah yang benar maupun menuju pengakuan atas keesaan Allah."
  }
]