[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Dia menancapkan di dalam bumi gunung-gunung yang menguatkannya sehingga bumi tetap stabil bersama kalian, dan menjadikan di dalamnya sungai-sungai agar kalian dapat minum darinya, dan menjadikan padanya jalan-jalan agar kalian dapat minum darinya, dan menjadikan padanya jalan-jalan agar kalian memperoleh petunjuk, sehingga kalian dapat mencapai tempat-tempat yang kalian tuju."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Allah menjadikan gunung-gunung yang mengokohkan bumi agar ia tidak goncang dan miring. Allah yang mengalirkan sungai-sungai agar kalian bisa minum dan memberi minum hewan-hewan dan tanaman-tanaman kalian, Allah yang membelah di bumi jalan-jalan yang kalian lalui sehingga kalian bisa sampai ke tujuan kalian tanpa tersesat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "15-16. Dan di bumi Allah meneguhkan gunung-gunung yang kokoh agar bumi tidak menggoncang kalian; mengalirkan sungai-sungai air tawar dan membuat jalan-jalan yang mudah dilewati agar kalian dapat sampai pada tujuan. Gunung-gunung, sungai-sungai, dan jalan-jalan yang Allah ciptakan ini dapat kalian gunakan sebagai tanda-tanda penunjuk jalan pada siang hari. Dan Allah menciptakan bintang-bintang sebagai tanda-tanda penunjuk jalan pada malam hari."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15. وَأَلْقَىٰ فِى الْأَرْضِ رَوٰسِىَ (Dan Dia menancapkan gunung-gunung di bumi) Yakni gunung-gunung yang kokoh. أَن تَمِيدَ بِكُمْ(supaya bumi itu tidak goncang bersama kamu) Agar tidak menggoncang kalian. وَأَنْهٰرًا وَسُبُلًا((dan Dia menciptakan) sungai-sungai dan jalan-jalan) Yakni jalanan yang Allah perjelas agar kalian tidak tersesat dalam perjalanan kalian."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ) Cobalah mengamati bagaimana bumi diciptakan dengan tenang tanpa ia bergerak dan berguncang; Allah menciptakannya dengan sifatnya seperti agar memungkinkan setiap makhluk hidup dengan tenang di atasnya. 2 ). Semakin besar tinggi gunung dan semakin ia berakar, maka akan semakin memperkuat ketetapan bumi, dan tidak menguncang penduduknya, tadabburilah dua ayat ini : { وَأَلْقَىٰ فِي الْأَرْضِ رَوَاسِيَ أَنْ تَمِيدَ بِكُمْ } \"Dan Dia menancapkan gunung-gunung di bumi supaya bumi itu tidak goncang bersama kamu\" { وَجَعَلْنَا فِيهَا رَوَاسِيَ } \"dan Kami jadikan padanya gunung-gunung yang tinggi\" [ Al-Mursalat : 27 ]. Seperti itulah halnya seorang 'alim dalam menguatkan keyakinan ummat pada masa-masa firnah ini, semua tergantung kemantapan ilmunya dan perhatiannya kepada ummat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "15. Dia telah menancapkan gunung-gunung di bumi supaya bumi itu tidak bergoncang, dan Dia menciptakan sungai-sungai dan jalan yang bermacam agar kamu bisa mendapat petunjuk untuk sampai pada berbagai negeri,"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia memancangkan gunung-gunung di bumi agar tidak bergoncang} agar tidak miring dan bergoncang {bersama kalian serta sungai-sungai dan jalan-jalan} jalan-jalan {agar kalian mendapat petunjuk"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "15-16. “dan Dia menancapkan”, Allah yang menancapkan untuk (kebaikan) para hambaNya, ”gunung gunung dibumi” yaitu gunung gunung yang besar, supaya bumi tidak bergerak gerak dan tergoncang bersama manusia. Hingga mereka mampu bercocok tanam, membangun rumah dan berjalan di atas permukaannya. Diantara rahmatNya adalah Dia menjadikan sungai sungai yang digiring dari wilayah yang jauh menuju tanah yang membutuhkannya, sebagai minuman mereka dan binatang binatang mereka serta (pengairan) tanaman tanaman pertanian mereka; sungai sungai itu (ada yang berada dipermukaan tanah dan (ada) sungai sungai yang terpendam di dalamnya (artesis) mereka mengeksplorasinya dengan mengggalinya (terlebih dahulu) hingga menemukannya dengan bantuan penggerek timba dan alat alat lainnya. Bukti rahmatNya yang lain, Allah menciptakan jalur jalur di bumi, yaitu jalan jalan yang menghubungkan keperkampungan yang saling berjauhan “agar kamu mendapat petunjuk” jalan menuju kearahnya. Sampai sampai engkau akan menjumpai daratan yang bergandengan dengan gunung gunung, yang membentuk barisan padanya, dan Allah telah membuatkan celah celah dan lintasan lintasan di tengah tengahnya bagi para peniti jalan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (أَن تَمِيدَ بِكُمۡ) an tamiida bikum : “agar bumi tidak bergoncang bersama kamu” miring dan bergerak sehingga merobohkan dan menghancurkan apa yang ada di atasnya. Makna ayat: Firman-Nya (وَأَلۡقَىٰ فِي ٱلۡأَرۡضِ رَوَٰسِيَ) meletakkan di bumi gunung-gunung yang kokoh. Firman-Nya “agar ia tidak bergerak bersama kamu.” Karena jika bumi bergerak niscaya tidak ada kehidupan di atasnya. Firman-Nya “dan sungai-sungai” dan mengalirkan untuk kalian sungai-sungai, seperti Nil, Eufrat, dan yang lain. “dan jalan-jalan” dan membuat untuk kalian jalan “agar kalian mendapat petunjuk.” Menuju rumah kalian di negeri kalian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 15: Sehingga kamu dapat menggarap tanahnya, membuat bangunan dan berjalan di atasnya dengan tenang. Baik di permukaan bumi maupun di perutnya, di mana untuk mengeluarkannya butuh digali. Ke tempat yang kamu tuju."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 15",
    "description": "Dan dia yang mahakuasa itu pula yang telah menancapkan gunung dengan kukuh dan kuat di bumi tempat kamu tinggal agar bumi itu tidak goncang bersama kamu. Dan dia pula yang menciptakan sungai-sungai yang mengalirkan air untuk dimanfaatkan oleh makhluk hidup, dan di atas bumi itu pula Allah menciptakan jalan-jalan yang terbentang agar kamu mendapat petunjuk, baik menuju arah yang benar maupun menuju pengakuan atas keesaan Allah. Dan Allah juga menciptakan tanda-tanda, yaitu penunjuk-penunjuk jalan, agar manusia dapat mencapai tujuannya dengan benar. Dan dengan bintang-bintang yang bertaburan dan gemerlapan di langit mereka, yakni para penghuni bumi tidak terkecuali kaum musyrik, mendapat petunjuk menuju arah yang benar."
  }
]