[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Dia menjadikan di muka bumi bermacam-macam tanda yang kalain manfaatkan untuk mengetahui arah-arah jalan pada siang hari, dan menjadikan bintang-bintang sebagai sumber petunjuk di malam hari."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Allah meletakkan rambu-rambu yang jelas di muka bumi yang bisa kalian gunakan untuk penunjuk jalan di siang hari dan Allah menjadikan bintang-bintang di langit agar kalian gunakan untuk penunjuk jalan di malam hari."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "16. وَعَلٰمٰتٍ ۚ (dan (Dia ciptakan) tanda-tanda (penunjuk jalan)) Yakni Allah juga menciptakan tanda-tanda sebagai penunjuk jalan. وَبِالنَّجْمِ هُمْ يَهْتَدُونَ(Dan dengan bintang-bintang itulah mereka mendapat petunjuk) Mendapat petunjuk jalan dari berbagai bintang yang beraneka ragam, sehingga mereka dapat mengetahui arah dan kiblat, mereka menjadikannya petunjuk jalan di darat dan di laut pada malam hari. Pendapat lain mengatakan yang dimaksud adalah gugusan bintang Capricorn."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Berikut ini adalah hikmah dibalik penggunaan kata bintang dalam pemberian petunjuk; karena bintang merupakan titik tolak yang tetap dan tidak dapat berubah, dan tidak pula tertutup, dan cahayanya selalu tetap dan tidak dapat berubah dengan sendirinya, kecuali dengan pengaruh lain, juga untuk mengetahuinya lebih mudah dibanding manazil qomar, dan jika kita benar-benar faham dengan petunjuk dari bintang akan lebih mudah sampai ke tujuan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16. Dia telah ciptakan tanda-tanda sebagai penunjuk jalan pada waktu siang berupa gunung-gunung , lembah dan wadi. Dan dengan bintang-bintang itulah mereka mendapat petunjuk jalan dan arah kiblat ketika malam hari."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan tanda-tanda} tanda-tanda yang nyata yang bisa kalian gunakan sebagai petunjuk menuju jalan-jalan di siang hari {Dan dengan bintang-bintang mereka mendapat petunjuk"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "15-16. “dan Dia menancapkan”, Allah yang menancapkan untuk (kebaikan) para hambaNya, ”gunung gunung dibumi” yaitu gunung gunung yang besar, supaya bumi tidak bergerak gerak dan tergoncang bersama manusia. Hingga mereka mampu bercocok tanam, membangun rumah dan berjalan di atas permukaannya. Diantara rahmatNya adalah Dia menjadikan sungai sungai yang digiring dari wilayah yang jauh menuju tanah yang membutuhkannya, sebagai minuman mereka dan binatang binatang mereka serta (pengairan) tanaman tanaman pertanian mereka; sungai sungai itu (ada yang berada dipermukaan tanah dan (ada) sungai sungai yang terpendam di dalamnya (artesis) mereka mengeksplorasinya dengan mengggalinya (terlebih dahulu) hingga menemukannya dengan bantuan penggerek timba dan alat alat lainnya. Bukti rahmatNya yang lain, Allah menciptakan jalur jalur di bumi, yaitu jalan jalan yang menghubungkan keperkampungan yang saling berjauhan “agar kamu mendapat petunjuk” jalan menuju kearahnya. Sampai sampai engkau akan menjumpai daratan yang bergandengan dengan gunung gunung, yang membentuk barisan padanya, dan Allah telah membuatkan celah celah dan lintasan lintasan di tengah tengahnya bagi para peniti jalan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat: Firman-Nya “dan alamat-alamat” menjadikan bagi kalian alamat jalan dan tanda-tanda, seperti dataran tinggi, lembah-lembah, pepohonan, dan seluruh yang bisa digunakan sebagai tanda dan arah. Firman-Nya “dan dengan bintang” bintang-bintang “mereka mendapat petunjuk.” Arah pada perjalanan di lautan dan perjalanan pada malam hari tidak dapat diketahui kecuali dengan bintang-bintang, begitu juga para musafir yang melewati padang pasir dan dataran rendah, mereka tidak mengetahui arah perjalanan kecuali dengan bintang, dan ini sebelum ditemukannya kompas, dan mereka tidak punya petunjuk arah kecuali dengan bintang."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 16: Seperti dapat mengetahui adanya gunung dengan memperhatikan sungai. Yakni mengetahui jalan-jalan dan dapat mengetahui arah kiblat di malam hari."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 16",
    "description": "Dan Allah juga menciptakan tanda-tanda, yaitu penunjuk-penunjuk jalan, agar manusia dapat mencapai tujuannya dengan benar. Dan dengan bintang-bintang yang bertaburan dan gemerlapan di langit mereka, yakni para penghuni bumi tidak terkecuali kaum musyrik, mendapat petunjuk menuju arah yang benar. Usai menyebut berbagai nikmat dan bukti kekuasaan-Nya di alam semesta, Allah lalu menanyai manusia, maka, wahai kaum kafir, apakah Allah yang menciptakan semua itu dengan kekuasaan-Nya sama keadaan dan kedudukannya dengan sesembahanmu yang tidak dapat menciptakan apa pun' tentu tidak sama! mengapa kamu tidak mau mengambil pelajaran dari apa yang kamu saksikan di alam raya ini'."
  }
]