[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah pantas kalian menjadikan Allah yang menciptakan segala sesuatu ini dan obyek-obyek ciptaan lainnya dalam keberhakan untuk diibadahi berkedudukan sama dengan tuhan-tuhan fiktif yang tidak menciptakan apapun? tidakah kalian mengingat keagungan Allah, lalu kalian mengesakanNya dalam peribadahan?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Apakah yang menciptakan benda-benda ini dan lainnya sama dengan sembahan-sembahan yang tidak menciptakan suatu apa pun? Apakah kalian tidak merenungkan keagungan Allah yang telah menciptakan segala sesuatu dan mengesakan-Nya dengan beribadah dan tidak menyekutukan-Nya dengan sesuatu apapun?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "17. Allah mengingkari dan mengolok orang-orang musyrik: “Apakah kalian menyamakan antara yang menciptakan makhluk-makhluk yang agung ini dengan tuhan-tuhan yang kalian anggap itu yang tidak dapat menciptakan sesuatu? Apakah kalian tidak mengingat kuasa Allah sehingga kalian mendapat beriman kepada-Nya?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "17. أَفَمَن يَخْلُقُ (Maka apakah (Allah) yang menciptakan itu) Yakni yang menciptakan makhluk-makhluk yang agung itu dan melakukan hal-hal menakjubkan ini. كَمَن لَّا يَخْلُقُ ۗ( sama dengan yang tidak dapat menciptakan) Yakni yang tidak dapat menciptakan sama sekali meski hanya satu ciptaan saja. Yang dimaksud adalah berhala-berhala."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17. Maka apakah Allah yang telah menciptakan itu semua lalu pantas disamakan dengan yang tidak dapat menciptakan apa-apa yaitu para berhala?. Lalu mengapa kamu tetap tidak mau mengingat kuasa Allah dan juga mengambil pelajaran, sehingga kamu memahami sifat wujud-Nya dan kekuasaan-Nya sehingga kamu menjadi beriman? Artinya bahwa jangan disamakan antara kekuasaan Allah untuk menciptakan berbagai makhluk dengan berhala yang tidak mampu berbuat apa-apa meskipun hanya kecil"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka apakah yang bisa menciptakan sama dengan yang tidak dapat menciptakan, Apakah kalian tidak mengambil pelajaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17. setelah Allah menyampaikan tentang makhluk makhluk ciptaanNYa yang besar dan kenikatan kenikmatan yang Allah limpahkan, maka Dia menyebutkan bahwa tidak ada satupun mahkluk yang menyerupaiNya, tiada padanan dan tandingan bagiNYa. Dia berfirman ”maka apakah (Allah) yang menciptakan” seluruh mahkluk ciptaan, dan Dia mahakuasa melaksnakan apa yang dikehendakiNya” sama dengan yang tidak dapat menciptakan” apapun, sedikit maupun banyak. ”maka mengapa kamu tidak mengambil pelajaran” sehingga kalianpun menyadari bahwa satu satunya Dzat yang menciptakan itu adalah Dzat yang paling berhak menerima seluruh ibadah. Sebagaimana halnya Alllah Maha Esa dalam penciptaan dan pengaturan, maka Dia juga Maha Esa dalam penyembahan, pengesaan, dan peribadahan. Seperti halnya, Dia tidak memiliki sekutu, saat menciptakan kalian dan orang lainnya, maka jangan sekali kali kalian menjadikan tandingan tandingan bagiNya dalam peribadahan kepadaNya. bahkan, murnikanlah ibadah bagiNya semata."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat: Firman-Nya pada ayat (17) : “Apakah yang menciptakan sama dengan yang tidak menciptakan? Apakah mereka tidak ingat?” Ini adalah celaan yang sangat besar bagi mereka orang-orang yang terus menerus menyembah berhala dan membelanya, apakah peribadatan kepada yang telah menciptakan, memberikan rizki, serta mengatur kehidupan manusia, yaitu Allah Rabb semesta alam, sama dengan peribadatan kepada yang tidak menciptakan sesuatupun, memberikan rizki, atau mengatur? Apakah orang yang berakal akan menyamakan antara Dzat Yang Maha Hidup dan Menghidupkan, yang melakukan apapun yang Dia kehendaki, yang memberikan kehidupan seluruhnya, dengan batu-batuan dan berhala? Oleh karena itu ayat ini ditutup dengan Firman-Nya “apakah kalian tidak ingat?” agar kalian ingat dan mengetahui bahwa peribadahan kepada berhala adalah batil, dan beibadah hanya kepada Allah adalah kebenaran, maka bertaubatlah kalian kepada Rabb kalian, berserah dirilah kepada-Nya sebelum datangnya azab. Pelajaran dari ayat: • Perbandingan antara Dzat Yang Maha Hidup, Maha Pencipta, dan Maha Mengetahui dengan berhala-berhala yang mati lagi diciptakan, untuk menegaskan kebatilan peribadatan kepada selain Allah ta’ala, karena yang menciptakan tidak sama dengan yang tidak menciptakan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 17: Setelah Allah Ta’ala menyebutkan ciptaan-Nya dan menyebutkan nikmat-nikmat yang diberikan-Nya, Allah menyebutkan bahwa tidak ada yang serupa dan sebanding dengan-Nya. Seperti halnya patung-patung. Sehingga kamu dapat menyadari bahwa yang menciptakan itulah yang berhak untuk diibadati."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 17",
    "description": "Usai menyebut berbagai nikmat dan bukti kekuasaan-Nya di alam semesta, Allah lalu menanyai manusia, maka, wahai kaum kafir, apakah Allah yang menciptakan semua itu dengan kekuasaan-Nya sama keadaan dan kedudukannya dengan sesembahanmu yang tidak dapat menciptakan apa pun' tentu tidak sama! mengapa kamu tidak mau mengambil pelajaran dari apa yang kamu saksikan di alam raya ini'begitu banyak nikmat dan karunia yang Allah anugerahkan kepada kalian, baik di langit, darat, air, maupun dalam diri manusia; semua demi kemaslahatan dan kebaikan manusia. Dan jika kamu, wahai manusia, berkumpul dan bersama-sama memakai alat-alat tercanggih sekalipun untuk menghitung nikmat Allah kepada kalian, niscaya kamu sam-pai kapan pun tidak akan mampu menghitung jumlah-Nya. Sungguh, Allah benar-benar maha pengampun atas kesalahan-kesalahanmu, maha penyayang kepadamu sehingga dia tidak memutus nikmat-Nya kepadamu meski kamu mendurhakai dan mengingkari-Nya."
  }
]