[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Jika kalian berusaha untuk menghitung jumlah nikmat-nikmat yang tercurah pada kalian, niscaya kalian tidak akan sanggup memenuhi hitungan jumlahnya, dikarenakan jumlah dan jenisnya yang banyak. Sesungguhnya Allah benar-benar maha pengampun terhadap kalian lagi maha penyayang kepada kalian, sebab Dia memaafkan kekurangan kalian dalam mengerjakan kewajiban bersyukur, tetap tidak menghentikannya dari kalian meskipun kalian kurang bersyukur, dan tidak menyegerakan dalam menimpakan siksaan pada kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Jika kalian -wahai manusia- berusaha untuk menghitung nikmat-nikmat Allah yang berjumlah banyak yang Dia limpahkan kepada kalian niscaya tidak akan sanggup melakukannya karena saking banyaknya dan aneka ragamnya. Sesungguhnya Allah Maha Pengampun, Dia tidak menghukum kalian atas kelalaian kalian dalam bersyukur, lagi Maha Penyayang karena Dia tidak memutuskan nikmat-nikmat itu karena sebab kemaksiatan kalian dan keterbatasan kalian dalam mensyukurinya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "18. kenikmatan-kenikmatan Allah sangat banyak, dan jika kalian berusaha menghitungnya niscaya kalian tidak akan mampu melakukannya karena jumlahnya yang tidak terhingga. Sungguh Allah Maha Pengampun bagi orang yang bertaubat dan Maha Pengasih bagi hamba-hamba-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "18. وَإِن تَعُدُّوا۟ نِعْمَةَ اللهِ لَا تُحْصُوهَآ ۗ (Dan jika kamu menghitung-hitung nikmat Allah, niscaya kamu tak dapat menentukan jumlahnya) Dan di setiap anggota tubuh manusia apabila terdapat sedikit saja kesalahan didalamnya niscaya kenikmatan orang tersebut tidak akan sempurna lagi, dan berharap dapat menebus seluruh isi dunia andai ia memilikinya agar kesalahan itu hilang. إِنَّ اللهَ لَغَفُورٌ رَّحِيمٌ(Sesungguhnya Allah benar-benar Maha Pengampun lagi Maha Penyayang) Sehingga Allah tidak menghukum kelalaian kalian dalam mensyukuri nikmat-Nya. Ya Allah aku bersyukur kepadamu sebanyak jumlah orang-orang yang bersyukur kepadamu dengan sebenar-benarnya pada tiap zaman."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ وَإِنْ تَعُدُّوا نِعْمَةَ اللَّهِ لَا تُحْصُوهَا } Jika suatu saat kamu sedang duduk di depan suatu hidangan makanan, cobalah untuk menghitung jumlah anggota keluargamu dan jumlah beberapa jenis makanan yang tersedia, semua kenikmatan itu tersedia dalam waktu yang sangat singkat, dan di atas kenikmatan itu ada nikmat kesehatan dan keamanan, dan nikamt terbesar dari itu semua adalah nikmat iman."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "18. Jika kamu menghitung-hitung nikmat Allah yang sangat banyak ini, niscaya kamu tak akan pernah dapat menentukan jumlahnya. Maka lebih baik hendaknya kamu bersyukur atas nikmat itu Sesungguhnya Allah benar-benar Maha Pengampun atas dosa-dosa lagi Maha Penyayang kepada para hamba-Nya dengan bukti pencurahan nikmat kepada mereka, sekalipun mereka tidak mensyukurinya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika kalian menghitung nikmat Allah, niscaya kalian tidak akan mampu menghitungnya. Sesungguhnya Allah benar-benar Maha Pengampun lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "18. “dan jika kamu menghitung hitung nikmat Allah” (menghitung jumlahnya tanpa disertai rasa syukur “niscaya kamu akan tidak dapat menentukan jumlahnya” apalagi bila (tergerak) untuk mensyukurinya. Sungguh, nikmat nikmatNYa yang lahiriah dan batiniah bagi hamba hambaNya adalah sebanyak jumlah tarikan nafas dan detik detik waktu dari segala macam kenikmatan, yang diketahui oleh mereka dan yang tidak mereka ketahui, dan keburukan keburukan yang telah Allah singkirkan dari mereka, maka terlalu banyak bila akan diperhitungkan. “sesungguhnya Allah benar benar Maha pengampun lagi Maha penyayang” Dia ridha dengan rasa syukur kalian yang sedikit, meskipun curahan nikmatNya sangat banyak."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (لَا تُحۡصُوهَآۗ) laa tuhshuuhaa : “niscaya kamu tidak akan mampu menghitungnya.” Jumlahnya secara pasti, terlebih dari mensyukuri nikmat dari Sang Pemberi Nikmat ta’ala. Makna ayat: Firman-Nya “Dan seandainya kalian menghitung nikmat-nikmat Allah, kalian tidak akan mampu menghitungnya.” Setelah menyebutkan banyak nikmat pada ayat-ayat sebelumnya, Allah mengkabarkan kepada manusia bahwa seandainya mereka ingin menghitung nikmat Allah, niscaya mereka tidak akan mampu, terlebih lagi mensyukuri seluruhnya, oleh karena itu Allah berfirman “Sesungguhnya Allah Maha Pengampun lagi Maha Penyayang.” Jika saja Allah tidak seperti ini, niscaya Dia akan menghukum seluruh kelalaian mereka karena kurang mensyukuri nikmat-nikmat-Nya, dan mencabutnya dari mereka tatkala mereka mengingkari nikmat tersebut dan enggan mengakui Allah sebagai pemberi kenikmatan ‘azza wa jalla. Pelajaran dari ayat: • Ketidakmampuan manusia untuk mensyukuri seluruh nikmat Allah ta’ala. Seorang hamba dituntut untuk mensyukuri apa yang dia mampu (untuk disyukuri), dan perkataan Alhamdulillah termasuk dari inti dari syukur. Pengakuan akan ketidak mampuan untuk bersyukur termasuk bagian dari syukur. Dan termasuk syukur adalah menggunakan nikmat untuk memperoleh kembali nikmat Allah ta’ala."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 18: Apalagi sampai mensyukuri semua nikmat itu. Dia tetap memberimu nikmat meskipun kamu meremehkan perintah-Nya dan mendurhakai-Nya. Dia juga ridha dengan syukur kalian meskipun sedikit padahal nikmat-nikmat-Nya begitu banyak."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 18",
    "description": "Begitu banyak nikmat dan karunia yang Allah anugerahkan kepada kalian, baik di langit, darat, air, maupun dalam diri manusia; semua demi kemaslahatan dan kebaikan manusia. Dan jika kamu, wahai manusia, berkumpul dan bersama-sama memakai alat-alat tercanggih sekalipun untuk menghitung nikmat Allah kepada kalian, niscaya kamu sam-pai kapan pun tidak akan mampu menghitung jumlah-Nya. Sungguh, Allah benar-benar maha pengampun atas kesalahan-kesalahanmu, maha penyayang kepadamu sehingga dia tidak memutus nikmat-Nya kepadamu meski kamu mendurhakai dan mengingkari-Nya. Dan tidak saja mahakuasa dan maha pencipta, ketahuilah wahai manusia bahwa Allah mengetahui apa yang kamu rahasiakan dan sembunyikan dalam hatimu, dan dia mengetahui pula apa yang kamu lahirkan dan nyatakan dalam bentuk ucapan dan tindakan. Tidak satu hal pun yang dapat kamu sembunyikan dari Allah."
  }
]