[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Allah mengetahui seluruh amal perbuatan kalian, baik yang kalian rahasiakan pada jiwa kalain maupun yang kalian tampakkan kepada orang lain, dan Dia akan memberikan balasan kepada kalain atas perbuatan-perbuatan tersebut."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Allah mengetahui -wahai para hamba- amalan yang kalian sembunyikan dan amalan yang kalian perlihatkan, tidak ada sesuatu yang tesembunyi bagi Allah, dan Dia akan membalas kalian karenanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "19. Allah mengetahui segala perkataan dan perbuatan yang kalian rahasiakan maupun yang kalian tampakkan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "19. وَاللهُ يَعْلَمُ مَا تُسِرُّونَ (Dan Allah mengetahui apa yang kamu rahasiakan) Yakni urusan-urusan yang kalian rahasiakan. وَمَا تُعْلِنُونَ(dan apa yang kamu lahirkan) Yakni urusan-urusan yang kalian nampakkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19. Allah Maha Mengetahui atas segala apa yang kamu rahasiakan maupun yang kamu ungkapkan dari akidah, niat, batin maupun amal-amal. Ini adalah janji atas kesyirikan dan amal-amal yang buruk"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah mengetahui apa yang kalian rahasiakan dan apa yang kalian tampakkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "19-20. sebagaimana rahmatNya luas, kebaikanNya merata, dan ampunannya menghampiri seluruh hambaNYa, maka ilmuNya pun meliputi mereka semua. Dia mengetahui ungkapan yang mereka sembuyikan dan ucapan yang mereka nyatakan. Berbeda halnya dengan obyek yang disembah selain Allah, sesungguhnya mereka ini, ”tidak dapat membuat sesuatu appaun” sedikit ataupun banyak. ”sedang berhala berhala itu (sendiri) dibuat orang” bagaimana mungkin mereka bisa membuat sesuatu kalau masih membutuhkan Allah untuk mengadakan wujud mereka?"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata; (مَا تُسِرُّونَ وَمَا تُعۡلِنُونَ) maa tusirruuna wa maa tu’linuun : “apa yang kamu rahasiakan dan apa yang kamu tampakkan.” Berupa makar kepada Nabi shalallahu ‘alaihi wa sallam serta gangguan secara terang-terangan kepadanya, ini jika dilihat dari sisi penduduk kota Mekah, namun pembicaraan mengarah kepada mereka pertama dan secara umum berdasarkan lafaz. Maka Allah ta’ala mengetahui segala yang disembunyikan dan ditampakkan dari seseorang. Makna ayat: Firman-Nya “Dan Allah mengetahui apa yang kalian rahasia dan tampakkan.” Ini adalah tanda lain dari kekuatan, ilmu, hikmah, dan nikmat pada pada konteks ayat yang mulian ini. Hanya Allah-lah yang mengetahui rahasia dan zahir manusia, dan Dia mengetahui kebutuhan dan permintaan mereka, jika mereka memusuhi dan kufur kepada-Nya, bagaimana bisa mereka hidup dengan nyaman? Karena konteks ayat adalah dalam rangka mendakwahi kaum musyrikin Mekah menuju iman dan tauhid, maka ayat ini merupakan peringatan bagi mereka, bahwa Allah mengetahui makar mereka kepada Rasul-Nya, rencana jahat di malam hari, dan gangguan mereka di kala siang hari. Ayat ini mengandung ancaman bagi kepada orang-orang kafir Mekah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 19: Sebagaimana rahmat-Nya begitu luas, kepemurahan-Nya merata, dan ampunan-Nya mengena kepada semua hamba, demikian pula ilmu-Nya meliputi mereka. Dia mengetahui apa yang mereka sembunyikan dan apa yang mereka tampakkan, berbeda dengan sesembahan selain-Nya, di mana mereka (berhala-berhala) tidak sanggup mencipta, sedangkan mereka sendiri dicipta."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 19",
    "description": "Dan tidak saja mahakuasa dan maha pencipta, ketahuilah wahai manusia bahwa Allah mengetahui apa yang kamu rahasiakan dan sembunyikan dalam hatimu, dan dia mengetahui pula apa yang kamu lahirkan dan nyatakan dalam bentuk ucapan dan tindakan. Tidak satu hal pun yang dapat kamu sembunyikan dari Allah. Dan berhala-berhala yang mereka seru, sembah, dan mintai pertolongan selain Allah itu tidak akan dapat membuat dan menciptakan sesuatu apa pun untuk mereka, sedang berhala-berhala itu dibuat oleh orang, bahkan tidak jarang oleh penyembahnya sendiri."
  }
]