[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah menurunkan malaikat denagn membawa wahyu berdasar perintahNya kepada siapa saja yang dikehendakiNya dari hamba-hambaNya yang diutus sebagai rasul-rasul (yang berisi perintah) ”peringatkanlah manusia dari perbuatan syirik, dan bahwasannya tidak ada sesembahan yang berhak diibadahi kecuali Aku. Maka takutlah kepadaku dengan menjalankan kewajiban-kewajiban yang Aku tetapkan dan mengesakan Aku dalam pereibadahan dan keikhlasan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Allah menurunkan para Malaikat membawa wahyu sesuai dengan keputusannya kepada siapa yang Dia kehendaki dari para Rasul-Nya, Allah berpesan kepada para Rasul, “Wahai para Rasul, peringatkanlah manusia dari syirik terhadap Allah, karena tidak ada sesembahan yang hak kecuali Aku, maka bertakwalah kalian -wahai manusia- dengan melaksanakan perintah-perintah-Ku dan menjauhi larangan-larangan-Ku."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "2. Allah menurunkan para malaikat dengan membawa wahyu yang mengandung perintah-Nya kepada para Rasul yang Dia kehendaki, agar mereka memperingatkan manusia bahwa tidak ada Tuhan yang berhak disembah selain Allah. Maka bertakwalah kepada-Ku dengan mentaati segala perintah dan menjauhi segala larangan-Ku."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. يُنَزِّلُ الْمَلٰٓئِكَةَ بِالرُّوحِ مِنْ أَمْرِهِۦ (Dia menurunkan para malaikat dengan (membawa) wahyu dengan perintah-Nya) Yakni Allah menyampaikan wahyu-Nya kepada para Nabi dengan perantara para malaikat, para malaikat membawa wahyu itu kepada orang yang diistimewakan dengan kenabian tersebut. أَنْ أَنذِرُوٓا۟ (yaitu: “Peringatkanlah olehmu sekalian) Yakni sampaikanlah kepada manusia. أَنَّهُۥ لَآ إِلٰهَ إِلَّآ أَنَا۠ (bahwasanya tidak ada Tuhan (yang hak) melainkan Aku) Yakni perintahkanlah mereka untuk mengesakan Aku dan peringatkanlah mereka. فَاتَّقُونِ (maka hendaklah kamu bertakwa kepada-Ku”) Ini merupakan peringatan bagi manusia agar tidak menyekutukan Allah."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Siapa saja yang mentadabburi al-Qur'an akan jelas baginya bahwa nikmat paling besar yang Allah karuniakan kepada hamba-Nya adalah al-Qur'an dan tauhid, Allah berfirman : { الرَّحْمَٰنُ , عَلَّمَ الْقُرْآنَ } \"(Tuhan) Yang Maha Pemurah , Yang telah mengajarkan al Quran\" Allah memulai surah dengan ayat ini sebelum kemudian Ia menyebutkan ayat penciptaan manusia, dan dalam surah (An-Nahl) yang juga disebut dengan surah nikmat Allah berfirman : { يُنَزِّلُ الْمَلَائِكَةَ بِالرُّوحِ مِنْ أَمْرِهِ عَلَىٰ مَنْ يَشَاءُ مِنْ عِبَادِهِ أَنْ أَنْذِرُوا أَنَّهُ لَا إِلَٰهَ إِلَّا أَنَا فَاتَّقُونِ } ini adalah nikmat pertama yang Allah tunjukkan kepada hamba-hamba Nya, oleh karena itu Ibnu 'Uyainah mengatakan : tidak ada nikmat terbesar yang Allah keruniakan kepada hamba-Nya selain daripada Ia mengajarkan mereka لا إله إلا الله."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Allah menurunkan para malaikat membawa wahyu dengan perintah-Nya kepada hamba-hamba-Nya yang Dia kehendaki, yaitu: “Peringatkanlah bahwasanya tidak ada Tuhan yang haq disembah melainkan Aku, maka hendaklah kamu bertakwa kepada-Ku dan takut kepada azab-Ku”."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia menurunkan para malaikat dengan membawa wahyu} dengan wahyu {atas perintahNya kepada siapa saja yang Dia kehendaki di antara hamba-hambaNya, yaitu “Peringatkanlah bahwa tidak ada tuhan selain Aku. Maka bertakwalah kepadaKu”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2. Sesudah Allah menyucikan diriNya dari sifat sifat yang disandangkan oleh para musuhNya bagiNya, maka Allah menebutkan wahyu yang Dia turunkan kepada para nabiNYa yang mesti diikuti dalam aspek penyebutan sifat sifat kesempurnaan yang dinisbatkan kepada Allah. Allah berfirman ”Dia menurunkan para malaikat dengan (membawa) wahyu dengan perintahNya” yaitu dengan wahyu yang menjadi sumber kehidupan jiwa jiwa manusia, ”kepada siapa Dia kehendaki dari hamba hambaNya” yaitu insan insan yang Allah ketahui layak mengemban risalah. Dan substansi dakwah dan protes para rasul secara keseluruhan tertuang dalam firmanNya “peringatkanlah olehmu sekalian, bahwasannya tidak ada tuhan (yang berhak disembah) melainkan aku” yaitu bertumpu pada ma’rifatullah (pengenalan Allah), pengesaanNYa dalam sifat sifat keagungan yang merupakan sifat sifat uluhiyah (ketuhanan) dan peribadahan kepadaNYa semata tidak ada sekutu bagiNya. inilah alasan mengapa Allah menurunkan kitab kitabNya, mengutus para rasul dan menggariskan (aturan aturan) seluruh syariat yang menyeru dan mengarahkan kepadanya, melawan pihak pihak yang memerangi dan melancarkan perlawanan terhadapnya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (يُنَزِّلُ ٱلۡمَلَٰٓئِكَةَ بِٱلرُّوحِ) yunazzilul malaaikata birruuh : “Dia menurunkan malaikat dengan ar-ruh” yaitu wahyu, dengannya hidup seluruh jiwa, adapun Ar-Ruh dari kalangan malaikat adalah Jibril. Makna ayat: Firman-Nya “Dia menurunkan para malaikat membawa wahyu dengan perintah-Nya” dengan kehendak dan perintah-Nya “kepada siapa yang Dia kehendaki dari hamba-hamba-Nya” mengutus Jibril ‘alaihissalam membawa wahyu kepada yang Dia kehendaki dari hamba-hamba-Nya yaitu Muhammad shalallahu ‘alaihi wa sallam. Firman-Nya “Peringatkanlah, bahwa tiada tuhan yang berhak disembah kecuali Aku, maka bertakwalah kalian kepada-Ku.” Peringatkanlah mereka, buat mereka takut akan akhir buruk dari perbuatan syirik mereka, bahwa sekutu mereka adalah batil yang niscaya akan membawa mereka menuju azab yang tidak mampu mereka tahan, karena tidak ada Tuhan yang berhak disembah kecuali Allah, seluruh sesembahan selain-Nya adalah batil, maka bertakwalah kalian kepada Allah dengan meninggalakan kesyirikan dan maksiat, jika tidak kalian telah menghadapkan diri kalian kepada azab yang pedih. Pada dua ayat ini terdapat penetapan wahyu dan nubuwah Nabi shalallahu ‘alaihi wa sallam, serta penegasan tauhid. Pelajaran dari ayat: • Penamaan wahyu dengan ruh, karena ia menghidupkan hati, sebagaimana jasad hidup dengan ruh."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 2: Setelah Alah menyucikan diri-Nya dari penyifatan musuh-musuh-Nya, maka Allah Ta’ala menyebutkan wahyu yang diturunkan kepada para nabi-Nya yang wajib untuk diikuti, yang di sana menyebutkan sifat sempurna yang memang dinisbatkan kepada-Nya. Wahyu disebut ruh, karena dengannya jiwa manusia hidup. Yaitu orang yang Dia ketahui cocok mengemban risalah-Nya. Mereka itulah para nabi. Inilah inti dakwah para nabi, di mana karena inilah Allah Ta’ala menurunkan kitab-kitab dan mengutus para rasul. Dalam ayat selanjutnya Allah Ta’ala menyebutkan bukti dan dalil yang menunjukkan keberhakan-Nya untuk diibadati, tidak selain-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 2",
    "description": "Menjelaskan kesempurnaan ketetapan dan penciptaan-Nya, Allah berfirman, dia menurunkan para malaikat, yakni malaikat jibril, membawa wahyu dengan perintah-Nya kepada siapa yang dia kehendaki untuk diberi wahyu di antara hamba-hamba-Nya yang taat dan suci jiwanya. Inti wahyu itu ialah pesan yang berisi, peringatkanlah oleh kalian, wahai hamba-hamba yang aku beri wahyu, bahwa tidak ada tuhan, penguasa alam raya, pencipta langit dan bumi yang berhak disembah selain aku yang mahaesa dan mahakuasa, tidak ada sekutu bagi-ku, maka hendaklah kamu bertakwa kepada-ku. Berimanlah kepada-ku, laksanakanlah semua perintah-ku, dan tinggalkanlah segala laranganku. (lihat: surah ga'fir/40: 15 dan asy-syura'/42: 52)Allah mengingatkan manusia bahwa dia adalah tuhan yang telah menciptakan langit tempat kalian berteduh bersama benda-benda yang menghiasinya, dan menciptakan bumi tempat kalian berpijak bersama apa saja yang terhampar di atasnya dan terkandung di dalamnya. Semua itu Allah ciptakan dengan kebenaran, yaitu sesuai dengan hikmah dan kebijaksanaan-Nya. Mahatinggi Allah dalam segala hal, sifat, dan perbuatan-Nya, dari apa yang mereka persekutukan dengan-Nya berupa berhala-berhala itu."
  }
]