[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan tuhan-tuhan sesembahan yang disembah oleh kaum musyrikin tidak mampu menciptakan apapun, meskipun barang yang amat kecil. Sebab tuhan-tuhan sesembahan itu(juga) makhluk-makhluk yang diciptakan sendiri oleh orang-orang kafir dengan tangan-tangan mereka. Bagaimana bisa mereka menyembahnya?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "20. Berhala-berhala yang disembah orang-orang musyrikin tidak menciptakan apa pun walaupun hanya sedikit, apa yang mereka sembah selain Allah adalah benda yang mereka buat sendiri. Bagaimana mereka menyembah berhala yang mereka buat dengan tangan mereka sendiri?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "20-21. sedangkan berhala berhala yang disembah orang-orang musyrik tidak mampu menciptakan sesuatu apapun, bahkan berhala-berhala itu sendiri merupakan ciptaan orang-orang yang menyembahnya. Berhala-berhala itu hanyalah benda mati yang tidak memiliki nyawa dan tidak mengetahui kapan terjadinya hari kebangkitan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "20. وَالَّذِينَ يَدْعُونَ مِن دُونِ اللهِ (Dan berhala-berhala yang mereka seru selain Allah) Yakni tuhan-tuhan yang disembah oleh orang-orang kafir. لَا يَخْلُقُونَ شَيْـًٔا(tidak dapat membuat sesuatu apapun) Baik itu ciptaan yang kecil maupun yang besar. وَهُمْ يُخْلَقُونَ(sedang berhala-berhala itu (sendiri) dibuat orang) Dibuat oleh orang-orang kafir dari kayu, batu, dan lain sebagainya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20. Berhala-berhala yang mereka sembah selain Allah itu tidak dapat berbuat atau menciptakan apapun, sedangkan berhala-berhala itu sendiri diciptakan oleh orang dari batu, kayu maupun lainnya. Inilah keseimbangan yang menekankan isi dari ayat 17 yang mendeskripsikan sifat orang berakal dalam hal beribadah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan yang mereka seru selain Allah tidak dapat menciptakan sesuatu apa pun, bahkan mereka itu diciptakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "19-20. sebagaimana rahmatNya luas, kebaikanNya merata, dan ampunannya menghampiri seluruh hambaNYa, maka ilmuNya pun meliputi mereka semua. Dia mengetahui ungkapan yang mereka sembuyikan dan ucapan yang mereka nyatakan. Berbeda halnya dengan obyek yang disembah selain Allah, sesungguhnya mereka ini, ”tidak dapat membuat sesuatu appaun” sedikit ataupun banyak. ”sedang berhala berhala itu (sendiri) dibuat orang” bagaimana mungkin mereka bisa membuat sesuatu kalau masih membutuhkan Allah untuk mengadakan wujud mereka?"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (وَهُمۡ يُخۡلَقُونَ) wahum yukhlaquun : “bahkan mereka diciptakan.” Dibentuk dari batu atau yang lain. Makna ayat: Pada ayat ini terdapat bantahan yang jelas untuk kaum musyrikin setelah berlalu dalil-dalil yang menunjukkan kesyirikan dan kesesatan mereka, sehingga Allah ta’ala berfirman: “dan orang-orang yang menyembah selain Allah” kalian menyembah mereka, wahai kaum musyrikin Pelajaran dari ayat: • Batilnya syirik dan penegasan tauhid."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 20",
    "description": "Dan berhala-berhala yang mereka seru, sembah, dan mintai pertolongan selain Allah itu tidak akan dapat membuat dan menciptakan sesuatu apa pun untuk mereka, sedang berhala-berhala itu dibuat oleh orang, bahkan tidak jarang oleh penyembahnya sendiri. Berhala-berhala itu hanyalah benda mati, tidak hidup. Mereka tidak dapat mengetahui, merasa, tumbuh, bahkan untuk sekadar bergeser sendiri. Dan berhala-berhala itu juga tidak dapat mengetahui sedikit pun kapankah penyembahnya akan dibangkitkan."
  }
]