[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tuhan-tuhan sesembahan itu seluruhnya adalah benda-benda mati, tidak ada kehidupan padanya, dan tidak mengetahui kapan waktu Allah membangkitkan para penyembahnya.Tuhan-tuhan sesembahan itu bersama mereka supaya dilempar bersama-sama kedalam neraka pada hari kiamat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Di samping mereka itu dibuat oleh tangan-tangan para penyembahnya, mereka juga benda mati yang tidak mempunyai kehidupan maupun ilmu, mereka tidak mengetahui kapan akan dibangkitkan bersama para penyembah mereka pada kari Kiamat untuk selanjutnya dicampakkan ke dalam api Neraka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "21. وَمَا يَشْعُرُونَ أَيَّانَ يُبْعَثُونَ (dan berhala-berhala tidak mengetahui bilakah penyembah-penyembahnya akan dibangkitkan) Yakni berhala-berhala ini tidak mengetahui kapan dirinya dan orang-orang yang menyembahnya akan dibangkitkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "21. Berhala-berhala itu adalah benda mati yang tidak memiliki ruh, dan Apakah berhala-berhala itu tidak mengetahui kapan para penyembahnya itu akan dibangkitkan?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "(Berhala-berhala itu) mati, tidak hidup, dan tidak mengetahui kapankah} kapan {mereka dibangkitkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21-22. kendatipun demikian, tida ada sifat kesempurnaan yang melekat pada mereka, tidak ilmu dan tidak pula sesuatu lainnya. ”(berhala berhala itu) benda mati tidak hidup” tidak bisa mendengar, tidak mampu melihat dan tidak dapat memahami sediktpun. Apakah makhluk semacam ini patut dijadikan sesembahan selain Rabb semesta alam? kecelakaanlah bagi akal akal kaum musyrikin, alangkah sesat dan rusaknya, ia mengalami kesesatan pada masalah yang sangat nyata kepincangannya, ia menyamakan antara benda yang mempunyai kekurangan dan tidak memiliki (kemampuan) berbuat apapun, dibandingkan dengan yang Maha sempurna dipandang dari segala aspek, yang mempunyai setiap sifat kesempurnaan. Dia memiliki kesempurnaan dan keagungan yang puncak pada sifat sifat tersebut Dia mempunyai ilmu yang meliputi segala sesuatu, kekuasaan yang merata, rahmat yang luas (yang melingkupi seluruh sisi alam semesta) , pujian, kemuliaan, kesombongan dan keagungan yang tidak ada satu makhlukpun yang berkutik untuk meliputi pada sebagian sifat sifatNya itu. Karena itu, Dia berfirman ”tuhanmu adalah tuhan yang Maha Esa” Dialah Allah al –ahad (yang mahasatu) , alfard (yang maha tunggal) lagi tempat bergantung segala sesuatu, yang tidak beranak dan tidak pula diperanakan, dan tiada ada seorangpun yang setara denganNya. Orang orang yang beriman dan mempunyai akal akal sehat, kalbu kalbu mereka memuliakan dan mengagungkan Allah serta mencintaiNya dengan kecintaan yang besar. Mereka mengarahkan bagiNya seluruh apa yang mereka bisa lakukan, berupa ibadah ibadah badaniyyah (fisik) dan maliyyah (dengan pengeluaran materi) amalan amalan hati dan anggota tubuh lainnya, dan menyanjung Allah dengan nama namaNya yang baik dan sifat sifatNya yang suci. “maka orang orag yang tidak beriman kepada hari kiamat, hati mereka mengingkari (keesan Allah)” untuk perkara yang besar ini yang tidak diingkari kecuali oleh makhluk ciptaan yang paling parah kebodohan dan pertentangannya, yaitu mengenai tauhidullah (keesan Allah) “sedangkan mereka sendiri adalah orang orang yang sombong” untuk beribadah kepadaNya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (وَمَا يَشۡعُرُونَ أَيَّانَ يُبۡعَثُونَ) wa maa yasy’uruuna ayyaana yub’atsuun : “dan mereka tidak mengetahui kapan akan dibangkitkan.” Berhala itu tidak sadar dan mengetahui kapan dia akan dibangkitkan, yaitu hari kiamat, dan tidak ada dari mereka yang membangkitkan penyembah-penyembah mereka selain Allah. Makna ayat: “mereka mati dan tidak hidup.” Mereka adalah benda mati karena mereka tidak punya kehidupan, buktinya adalah mereka tidak mendengar, tidak melihat, dan tidak pula berbicara. Firman-Nya “dan mereka tidak mengetahui kapan akan dibangkitkan.” Mereka tidak tahu kapan akan dibangkitkan sebagaimana kalian tidak mengetahuinya, wahai para penyembah mereka, kalian tidak mengetahui kapan kalian akan dibangkitkan. Bagaimana mungkin bisa dibenarkan beribadah kepada mereka, sedangkan mereka adalah benda mati yang tidak hidup."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 21: Bagaimana berhala-berhala itu disembah, sedangkan mereka bukan pencipta, mereka tidak hidup, dan lagi tidak mengetahui yang gaib. Sungguh sesat dan rusak akal orang-orang musyrk, mereka menyamakan sesuatu yang memiliki kekurangan dari berbagai sisi dengan yang memiliki kesempurnaan dari berbagai sisi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 21",
    "description": "Berhala-berhala itu hanyalah benda mati, tidak hidup. Mereka tidak dapat mengetahui, merasa, tumbuh, bahkan untuk sekadar bergeser sendiri. Dan berhala-berhala itu juga tidak dapat mengetahui sedikit pun kapankah penyembahnya akan dibangkitkan. Setelah menjabarkan bukti-bukti keesaan dan kekuasaan-Nya di langit dan bumi, Allah lalu menegaskan pada ayat ini bahwa tuhan yang seharusnya kamu sembah adalah tuhan yang maha esa dalam zat, sifat, dan perbuatan-Nya. Jika demikian maka tidak ada alasan bagi orang yang menyaksikan bukti-bukti tersebut untuk tidak beriman kepada Allah dan hari akhirat. Hati mereka yang tidak beriman mengingkari hakikat-hakikat kebenaran tentang keesaan Allah, dan mereka adalah orang yang sangat sombong karena mendustakan risalah nabi Muhammad."
  }
]