[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tuhan sesembahan kalian yang berhak diibadahi, Dialah Allah, sesembahan yang maha Esa maka orang-orang yang tidak beriman kepada hari kebangkitan, hati mereka mengingkari keesaan Allah , karena ketidak takutan mereka kepada siksaan Allah. Mereka menyombongkan diri untuk menerima kebenaran dan (juga tidak mau) beribadah hanya kepada Allah semata."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "22. Sesembahan kalian yang benar hanya satu tidak ada sekutu bagi-Nya, yaitu Allah. Dan orang-orang yang tidak mempercayai hari Kebangkitan untuk pembalasan, hati mereka mengingkari keesaan Allah karena ia memang tidak merasa takut, ia tidak beriman kepada hisab maupun hukuman, mereka menyombongkan diri tidak menerima kebenaran dan tidak tunduk kepada kebenaran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "22. Hai manusia, Tuhan kalian yang berhak disembah hanya satu, Dia tidak memiliki sekutu. Dan orang-orang yang mengingkari akhirat itu, hati mereka mendustakan keesaan Allah dan enggan menerima kebenaran."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "22. إِلٰهُكُمْ إِلٰهٌ وٰحِدٌ ۚ (Tuhan kamu adalah Tuhan Yang Maha Esa) Allah menjelaskan kebenaran yang sesungguhnya yaitu keesaan Allah. فَالَّذِينَ لَا يُؤْمِنُونَ بِالْاٰخِرَةِ قُلُوبُهُم مُّنكِرَةٌ(Maka orang-orang yang tidak beriman kepada akhirat, hati mereka mengingkari) Yakni mengingkari keesaan Allah, hati mereka tidak dapat menerima nasehat dan peringatan. وَهُم مُّسْتَكْبِرُونَ (sedangkan mereka sendiri adalah orang-orang yang sombong) Sehingga tidak mau menerima kebenaran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "22. Tuhan kamu adalah Tuhan Yang Maha Esa dan tidak punya sekutu. Maka orang-orang yang tidak beriman kepada akhirat, hati mereka akan mengingkari keesaaan Allah, sedangkan mereka sendiri adalah orang-orang yang sombong dari keimanan dan kebenaran"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tuhan kalian adalah Tuhan Yang Maha Esa. Maka orang-orang yang tidak beriman kepada akhirat itu hatinya ingkar. Mereka adalah orang-orang yang sombong"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21-22. kendatipun demikian, tida ada sifat kesempurnaan yang melekat pada mereka, tidak ilmu dan tidak pula sesuatu lainnya. ”(berhala berhala itu) benda mati tidak hidup” tidak bisa mendengar, tidak mampu melihat dan tidak dapat memahami sediktpun. Apakah makhluk semacam ini patut dijadikan sesembahan selain Rabb semesta alam? kecelakaanlah bagi akal akal kaum musyrikin, alangkah sesat dan rusaknya, ia mengalami kesesatan pada masalah yang sangat nyata kepincangannya, ia menyamakan antara benda yang mempunyai kekurangan dan tidak memiliki (kemampuan) berbuat apapun, dibandingkan dengan yang Maha sempurna dipandang dari segala aspek, yang mempunyai setiap sifat kesempurnaan. Dia memiliki kesempurnaan dan keagungan yang puncak pada sifat sifat tersebut Dia mempunyai ilmu yang meliputi segala sesuatu, kekuasaan yang merata, rahmat yang luas (yang melingkupi seluruh sisi alam semesta) , pujian, kemuliaan, kesombongan dan keagungan yang tidak ada satu makhlukpun yang berkutik untuk meliputi pada sebagian sifat sifatNya itu. Karena itu, Dia berfirman ”tuhanmu adalah tuhan yang Maha Esa” Dialah Allah al –ahad (yang mahasatu) , alfard (yang maha tunggal) lagi tempat bergantung segala sesuatu, yang tidak beranak dan tidak pula diperanakan, dan tiada ada seorangpun yang setara denganNya. Orang orang yang beriman dan mempunyai akal akal sehat, kalbu kalbu mereka memuliakan dan mengagungkan Allah serta mencintaiNya dengan kecintaan yang besar. Mereka mengarahkan bagiNya seluruh apa yang mereka bisa lakukan, berupa ibadah ibadah badaniyyah (fisik) dan maliyyah (dengan pengeluaran materi) amalan amalan hati dan anggota tubuh lainnya, dan menyanjung Allah dengan nama namaNya yang baik dan sifat sifatNya yang suci. “maka orang orag yang tidak beriman kepada hari kiamat, hati mereka mengingkari (keesan Allah)” untuk perkara yang besar ini yang tidak diingkari kecuali oleh makhluk ciptaan yang paling parah kebodohan dan pertentangannya, yaitu mengenai tauhidullah (keesan Allah) “sedangkan mereka sendiri adalah orang orang yang sombong” untuk beribadah kepadaNya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (قُلُوبُهُم مُّنكِرَةٞ) quluubuhum munkirah : “hati mereka mengingkari.” Menentang keesaan Allah, nubuwah, dan kebangkitan serta pembalasan. (وَهُم مُّسۡتَكۡبِرُونَ) wa hum mustakbiruun : “dan mereka berlaku sombong.” Karena gelapnya hati mereka disebabkan kekufuran. Makna ayat: Firman-Nya “Tuhan kalian adalah tuhan yang satu.” Ini adalah bukti yang tidak akan diingkari oleh orang yang berakal, yaitu sesembahan hanyalah satu dan tidak ada sekutu baginya, yaitu Allah jalla jalaaluhu. Karena Dia-lah Sang Pencipta, Yang Memberi Rizki, Yang Maha Mengatur, Yang Menghidupkan, Yang Mematikan, Yang memiliki sifat-sifat yang tinggi, dan nama-nama yang indah, adapun selain-Nya, ia tidak menciptakan, tidak memberikan rizki, tidak dapat mengatur, tidak menghidupkan dan mematikan, maka menjadikannya sesembahan adalah hal yang kebodohan dan sesat. Setelah menetapkan uluhiyah Allah ta’ala dan menguatkannya dengan dalil yang benar. Allah ta’ala berfirman “Adapun orang yang tidak beriman kepada akhirat, hati mereka mengingkari lagi sombong.” Kemudian Allah menyebutkan sebab kekufuran orang yang kafir dan kerusakan orang yang merusak, yaitu pengingkaran kepada hari akhir, karena seorang hamba tidak akan tegar di atas jalan kebenaran dan kebaikan sedangkan dia tidak beriman kepada hari akhir, hari pembalasan atas segala amal selama di dunia. Allah ta’ala mengkabarkan bahwa orang yang tidak beriman kepada hari akhir hati mereka mengingkari seluruh kebenaran yang didakwahkan oleh Rasulullah shalallahu ‘alaihi wa sallam serta peringatan dari Al-Qur’anul Karim, selain mereka mengingkari apa yang mereka dengar berupa kebenaran, mereka juga berbuat angkuh dalam menerima dan mengikuti kebenaran. Pelajaran dari ayat: • Pengingkaran terhadap hari akhir, kebangkitan, dan pembalasan amal adalah sebab dari segala keburukan serta kerusakan yang dilakukan oleh seorang hamba."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 22: Tidak ada tandingan bagi-Nya baik dalam zat maupun sifat. Tidak mau beriman dan beribadah kepada-Nya. Adapun orang-orang yang beriman dan berakal, maka mereka memuliakan-Nya, mengagungkan-Nya, mencintai-Nya, dan mengarahkan kepada-Nya semua ibadah yang mampu mereka lakukan baik berupa ibadah hati, ibadah ucapan dan perbuatan maupun ibadah harta, dan mereka memuji-Nya karena nama-nama-Nya yang indah, sifat-sifat dan perbuatan-Nya yang suci."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 22",
    "description": "Setelah menjabarkan bukti-bukti keesaan dan kekuasaan-Nya di langit dan bumi, Allah lalu menegaskan pada ayat ini bahwa tuhan yang seharusnya kamu sembah adalah tuhan yang maha esa dalam zat, sifat, dan perbuatan-Nya. Jika demikian maka tidak ada alasan bagi orang yang menyaksikan bukti-bukti tersebut untuk tidak beriman kepada Allah dan hari akhirat. Hati mereka yang tidak beriman mengingkari hakikat-hakikat kebenaran tentang keesaan Allah, dan mereka adalah orang yang sangat sombong karena mendustakan risalah nabi Muhammad. Tidak diragukan lagi bahwa Allah yang maha esa mengetahui apa yang mereka rahasiakan dan sembunyikan dalam hati berupa kebohongan, dan apa yang mereka lahirkan dalam bentuk sikap dan perbuatan. Sesungguhnya dia yang maha pengasih dan penyayang tidak menyukai orang yang sombong dan tidak menganugerahkan ganjaran kepada orang yang congkak dalam ucapan dan tingkah laku mereka."
  }
]