[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sudah pasti, bahwa sesungguhnya Allah mengetahui apa yang mereka sembunyikan, dari bentuk-bentuk keyakinan, ucapan-ucapan dan tindakan-tindakan, dan apa yang mereka tampakan darinya, dan Dia akan memberikan balasan kepada mereka atas perkara-perkara tersebut. Sesungguhnya Dia tidak menyukai orang-orang yang menyombongkan diri untuk beribadah dan tunduk kepadaNya dan akan memberikan balasan kepada mereka atas hal-hal tersebut."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "23. Sungguh Allah mengetahui amal perbuatan yang mereka sembunyikan sebagaimana Allah mengetahui apa yang mereka perlihatkan. Tidak ada sesuatu pun yang samar bagi Allah dan Allah akan membalas mereka atas perbuatannya. Sesungguhnya Allah -Subḥānahu- tidak menyukai orang-orang yang menyombongkan diri dari ibadah dan ketundukan kepada-Nya, sebaliknya Allah memurkai mereka dengan murka yang berat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "23- 24. Tidak diragukan bahwa Allah Maha Mengetahui segala niat dan maksud yang kalian rahasiakan dan yang kalian tampakkan. Allah tidak menyukai orang-orang yang berpaling dari kebenaran, yaitu orang-orang yang jika dikatakan kepada mereka: “Apa yang diturunkan Tuhan kalian kepada rasul-Nya?” Mereka akan menjawab: “Yang diturunkan kepadanya hanyalah kedustaan-kedustaan dari umat-umat terdahulu!”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "23. لَا جَرَمَ أَنَّ اللهَ يَعْلَمُ مَا يُسِرُّونَ وَمَا يُعْلِنُونَ ۚ (Tidak diragukan lagi bahwa sesungguhnya Allah mengetahui apa yang mereka rahasiakan dan apa yang mereka tampakkan) Yakni suatu kebenaran bahwa Allah mengetahui segala perkataan dan perbuatan yang mereka rahasiakan dan yang mereka tampakkan. إِنَّهُۥ لَا يُحِبُّ الْمُسْتَكْبِرِينَ(Sesungguhnya Allah tidak menyukai orang-orang yang sombong) Yakni Allah tidak suka terhadap setiap orang yang menyombongkan diri, diantaranya adalah orang yang menolak untuk mengesakan Allah."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Diantara kisah tentang tarbiyah hati dengan al-Qur'an : Suatu ketika Hasan bin 'Ali melewati sekelompok orang-orang miskin yang sedang makan kemudian mereka memanggilnya; beliau pun menjawab panggilan itu dan makan bersama mereka, kemudian beliau membacakan satu ayat dari al-Qur'an : { إِنَّهُ لَا يُحِبُّ الْمُسْتَكْبِرِينَ } \"Sesungguhnya Allah tidak menyukai orang-orang yang sombong\" kemudian di hari yang lain Hasan memanggil mereka ke rumahnya untuk menjamu mereka dengan makanan sebagai balasan untuk kebaikan yang telah mereka lakukan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "23. Tidak diragukan lagi bahwa sesungguhnya Allah mengetahui apa yang mereka rahasiakan dan apa yang mereka ungkapkan. Sesungguhnya Allah tidak menyukai orang-orang yang sombong. Maka Allah akan membalas perbuatan sombong mereka yang enggan mengesakan Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidak diragukan} tidak diragukan {bahwa Allah mengetahui apa yang mereka rahasiakan dan apa yang mereka tampakkan. Sesungguhnya Dia tidak menyukai orang-orang yang sombong"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "23. “tidak diragukan lagi” dengan seyakin yakinnya, pasti “bahwa Allah mengetahui apa yang mereka rahasiakan dan apa yang mereka lahirkan” berupa amalan amalan yang buruk. ”sesungguhnya Allah tidak menyukai orang orang yang sombong” bahkan Dia sangat membenci mereka dan akan memberi balasan kepada mereka dengan balasan yang serupa dengan tingkah polah mereka (yaitu) “sesungguhnya orang orang yang menyombongkan diri dari menyembahKu akan masuk Neraka jahanam dalam keadaan hina dina”."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (لَا جَرَمَ) laa jaram : pasti Makna ayat: Firman-Nya “Sungguh Allah mengetahui apa yang mereka sembunyi dan tampakkan, sungguh Dia tidak menyukai orang yang sombong.” Yaitu, sungguh Allah mengetahui apa yang disembunyikan dan ditampakkan oleh mereka para pendusta hari akhir, Dia akan menghitungnya dan pasti akan membalasnya pada hari yang dahulu mereka dustakan (kedatangannya), sungguh mereka sangat merugi lagi menyesal. Balasan bagi mereka adalah azab neraka yang disebabkan karena murka dan tidak kebencian Allah kepada orang-orang yang sombong. Pelajaran dari ayat: • Ancaman perihal buruknya kesombongan dan enggan mengikuti kebenaran."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 23: Berupa amal-amal buruk. Bahkan Dia membencinya dan akan membalas amal perbuatan mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 23",
    "description": "Tidak diragukan lagi bahwa Allah yang maha esa mengetahui apa yang mereka rahasiakan dan sembunyikan dalam hati berupa kebohongan, dan apa yang mereka lahirkan dalam bentuk sikap dan perbuatan. Sesungguhnya dia yang maha pengasih dan penyayang tidak menyukai orang yang sombong dan tidak menganugerahkan ganjaran kepada orang yang congkak dalam ucapan dan tingkah laku mereka. Kesombongan mereka terbukti dengan penolakan mereka terhadap Al-Qur'an. Dan hal ini terbukti apabila dikatakan kepada mereka oleh nabi Muhammad atau siapa pun, apakah yang telah diturunkan tuhanmu yang telah menganugerahkan nikmat dan kebaikan-Nya untuk kemaslahatan kamu' dengan penuh kesombongan dan keangkuhan mereka menjawab, Allah tidak menurunkan apa pun. Apa yang disampaikan oleh Muhammad hanyalah dongeng-dongeng orang dahulu."
  }
]