[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apabila kaum musyrikin ditanya soal wahyu yang turun kepada nabi Muhammad , mereka dengan dusta dan bohong mengatakan, ”tidaklah ia datang membawa sesuatu kecuali kisah-kisah orang-orang terdahulu dan dongeng-dongeng kebatilan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. Bila dikatakan kepada orang-orang yang mengingkari keesaan Khalik dan mendustakan kebangkitan, “Apa yang Allah turunkan kepada Muhammad -ṣallallāhu 'alaihi wa sallam-?” Mereka menjawab, “Tidak ada suatu apa pun, dia datang membawa sesuatu dari dirinya sendiri kisah-kisah manusia terdahulu dan kebohongan mereka.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "24. وَإِذَا قِيلَ لَهُم مَّاذَآ أَنزَلَ رَبُّكُمْ ۙ (Dan apabila dikatakan kepada mereka “Apakah yang telah diturunkan Tuhanmu?”) Terdapat pendapat mengatakan bahwa orang yang berkata adalah orang-orang beriman. Lalu orang-orang musyrik lagi ingkar dan sombong menjawab: “itu hanyalah dongeng-dongeng orang terdahulu.” قَالُوٓا۟ أَسٰطِيرُ الْأَوَّلِينَ(Mereka menjawab: “Dongeng-dongengan orang-orang dahulu”) Yakni hai orang-orang yang beriman, apa yang kalian akui diturunkan kepada kalian itu hanyalah dongeng-dongeng dan omong kosong yang diucapkan oleh umat-umat yang telah binasa."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "24. Dan apabila dikatakan kepada mereka para orang musyrik “Apakah yang telah diturunkan Tuhanmu?” Mereka menjawab: “Dongeng-dongengan orang-orang dahulu”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apabila dikatakan kepada mereka,“Apa yang telah diturunkan Tuhan kalian” Mereka menjawab,“Dongeng-dongeng} cerita dan mitos {orang terdahulu”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "24. Allah berfirman untuk mengabarkan tentang dahsyatnya pendustaan kaum musyrikin terhadap ayat ayat Allah ”dan apabila dikatakan terhadap mereka ’apakah yang telah diturunkan Rabbmu” maksudnya, bila mereka disodosri pertanyaan mengenai al qur’an dan wahyu yang merupakan anugerah terbesar yang dicurahkan oleh Allah kepada para hambaNYa ”apakah komentar kalian tentangnya? apakah kalian akan mensyukuri karunia ini dan mengakuinya, ataukah mengingkari dan memeranginya?” ternyata, jawaban mereka merupakan respon teburuk dan paling kasar. Mereka mengatakan, ”dongeng dongeng orang orang dahulu” maksudnya, merupakan kebohongan yang direkayasa oleh Muhammad atas nama Allah. Tidaklah al qur’an itu melainkan hanya kumpulan kisah orang orang terdahulu yang tersebar dikalangan orang orang dari generasi, sebagian kisahnya nyata dan sebagian lagi (hanya) dusta."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (أَسَٰطِيرُ ٱلۡأَوَّلِينَ) asaathiirul awwaliin : “dongeng orang terdahulu.” Cerita bohong orang terdahulu. Makna ayat: Firman-Nya “Apabila dikatakan kepada mereka, ‘Apa yang telah diturunkan oleh Rabb kalian?, mereka berkata, dongeng-dongeng orang terdahulu.” Allah mengabarkan perihal mereka yang hatinya mengingkari wahyu ilahi dan ajaran yang dibawa oleh Rasulullah ﷺ, mereka orang-orang yang sombong ketika ditanya tentang Al-Qur’an oleh orang-orang yang ingin mengetahui mengenai dakwah Muhammad, mereka datang dari negeri-negeri ingin mengetahui hal tersebut, lalu mereka menjawab pertanyaan mereka, “dongeng-dongeng orang terdahulu.” Kisah-kisah bohong orang terdahulu yang tersebar di masyarakat, kemudian dia menceritakannya. Dengan hal ini mereka mereka memalingkan orang-orang dari Islam serta menghalangi dari jalan Allah. Pelajaran dari ayat: • Penjelasan dosa dan akibat orang yang menghalangi jalan Allah, dengan menjauhkan manusia dari Islam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 24: Allah Subhaanahu wa Ta'aala memberitahukan tentang kerasnya pendustaan orang-orang musyrik terhadap ayat-ayat Allah. Yakni ketika mereka ditanya (dimintai pendapatnya) tentang Al Qur’an yang merupakan nikmat terbesar bagi manusia, mereka menjawabnya dengan jawaban yang paling buruk, yang di dalamnya terdapat pendustaan dan penghinaan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 24",
    "description": "Kesombongan mereka terbukti dengan penolakan mereka terhadap Al-Qur'an. Dan hal ini terbukti apabila dikatakan kepada mereka oleh nabi Muhammad atau siapa pun, apakah yang telah diturunkan tuhanmu yang telah menganugerahkan nikmat dan kebaikan-Nya untuk kemaslahatan kamu' dengan penuh kesombongan dan keangkuhan mereka menjawab, Allah tidak menurunkan apa pun. Apa yang disampaikan oleh Muhammad hanyalah dongeng-dongeng orang dahulu. Pengingkaran mereka terhadap Al-Qur'an menyebabkan mereka sesat dan kafir, sehingga pada hari kiamat mereka akan memikul dosa-dosanya sendiri secara sempurna tanpa dikurangi, diampuni, maupun diringankan sedikit pun, dan mereka bahkan memikul sebagian dosa-dosa orang yang mereka sesatkan yang tidak mengetahui sedikit pun bahwa mereka telah disesatkan. Ingatlah, alangkah buruknya dosa yang mereka pikul itu karena tidak akan ada pengurangan dan pengampunan atasnya."
  }
]