[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kesudahan mereka adalah akan memikul dosa-dosa mereka secara penuh pada hari kiamat, (tidak ada apapun yang diampuni dari mereka), dan sekaligus memikul dosa-dosa orang-orang yang mereka kelabui untuk menjauhkan orang-orang tersebut dari islam, tanpa mengurangi dosa-dosa mereka sendiri. Ingatlah, amat buruklah apa yang mereka pikul berupa dosa-dosa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "25. Mereka akan memikul dosa-dosa mereka tanpa dikurangi dan mereka juga akan memikul dosa-dosa dari orang-orang yang mereka sesatkan menjauh dari Islam karena tidak tahu atau taklid. Betapa buruk apa yang mereka pikul berupa dosa-dosa mereka dan dosa-dosa dari orang-orang yang mereka sesatkan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "25. Orang-orang yang sesat itu akan memikul dosa-dosa mereka pada hari kiamat dan ditambah dengan dosa-dosa dari orang-orang yang mereka sesatkan dengan kedustaan yang mereka buat. Maka berhati-hatilah wahai manusia, itulah seburuk-buruk tumpukan dosa yang mereka pikul."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "25. لِيَحْمِلُوٓا۟ أَوْزَارَهُمْ كَامِلَةً (agar mereka memikul dosa-dosanya dengan sepenuh-penuhnya pada hari kiamat) Yakni akibat dari kedustaan mereka terhadap al-Qur’an dan ucapan mereka bahwa itu hanya dongeng-dongeng maka dosa dari semua itu mereka pikul sepenuhnya di hari kiamat, sama sekali tidak dihapuskan sedikitpun dari dosa mereka karena mereka tidak masuk Islam, yang mana Islam merupakan sebab terhapusnya dosa. وَمِنْ أَوْزَارِ الَّذِينَ يُضِلُّونَهُم (dan sebahagian dosa-dosa orang yang mereka sesatkan) Dan mereka juga memikul sebagian dosa orang-orang yang mereka sesatkan, yaitu orang-orang yang mempercayai kedustaan mereka terhadap al-Qur’an; sebab orang yang mengawali perbuatan buruk akan mendapatkan dosanya dan dosa orang yang mengikutinya. بِغَيْرِ عِلْمٍ ۗ( yang tidak mengetahui sedikitpun (bahwa mereka disesatkan)) Yakni mereka menyesatkan manusia yang tidak mengetahui sama sekali dosa yang diakibatkan perbuatan tersebut."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Sebagian besar orang tua meninggalkan ditangan-tangan keluarga atau anak-anaknya chanel tontonan yang buruk, seakan-akan perkara itu tidak penting baginya, padahal ia tahu bahwa tontonan-tontonan itu berdampak buruk bagi mereka, atau mungkin ia sedang mengelabui dirinya sendiri bahwa ia menaruh kepercayaan kepada mereka. Sesungguhnya Rasulullah SAW telah melaknat transaksi yag mengandung riba : pemakan riba, wakilnya dan penulisnya, dan juga dalam sogok menyogok : Rasûlullâh melaknat pemberi suap, penerima suap, dan perantaranya, dan seburuk-buruk orang yang berperan dalam munculnya chanel-chanel itu adalah mereka yang dengan sengaja mendatangkannya dan juga mereka yang dengan sengaja melihatnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "25. Ucapan mereka menyebabkan mereka memikul dosa-dosanya dengan sepenuh-penuhnya nanti pada hari kiamat, sebab kekufuran dan tidak adanya iman. Juga akan memikul sebagian dosa orang yang telah mereka sesatkan dan mereka tidak mengetahui sedikitpun bahwa mereka disesatkan. Ingatlah, amat buruklah dosa yang mereka pikul itu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Menyebabkan mereka memikul dosa-dosa mereka sendiri} dosa-dosa mereka {secara utuh pada hari kiamat dan sebagian dosa} dosa {orang-orang yang mereka sesatkan yang tidak mengetahui. Ingatlah, alangkah buruknya yang mereka pikul} apa yang mereka pikul"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "25. mereka melontarkan omongan ini dan membujuk para pengikut mereka untuk membenarkannya serta (nekat) memikul dosa dosa orang orang yang patuh kepada mereka sampai hari kiamat. Firman Allah “dan sebagian dosa dosa orang orang yang mengikuti mereka (muqalidin) yang tidak berbekal ilmu apa pun kecuali hanya mengikuti ajakan mereka. Akibatnya mereka harus memikul dosa ajakan yang mereka arahkan kepada muqalidin. Adapun orang orang yang mengetahui persoalan ini, maka masing masing bertanggung jawab atas kesalahannya, lantaran dia telah mengetahui apa yang mereka ketahui. ”ingatlah, amat buruklah dosa yang mereka pikul itu,” maksudnya betapa buruknya beban dosa yang memayahkan punggung punggung mereka yang mesti mereka pikul, yang terdiri dari dosa dosa mereka sendiri dan dosa dosa dari orang orang yang telah berhasil mereka sesatkan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (لِيَحۡمِلُوٓاْ أَوۡزَارَهُمۡ) liyahmiluu awzaarahum : “mereka membawa dosa mereka” pada hari kiamat. (أَلَا سَآءَ مَا يَزِرُونَ) alaa saa`a maa yaziruun : “sungguh buruk apa yang mereka pikul.” Seburuk-buruk hal yang dipikul. Makna ayat: Firman-Nya “mereka akan memikul dosa-dosa mereka” sebab karena dosa mereka serta dosa orang-orang yang telah mereka halangi dari jalan Allah, secara sempurna serta tidak dikurangi sama sekali kelak pada hari kiamat, sedangkan mereka tidak menyadarinya, karena barangsiapa yang mengajak kepada kesesatan maka ia akan memikul dosa orang yang melakukannya tanpa mengurangi dosa pelakunya sedikitpun, begitu pula bagi yang mengajak kepada hidayah, baginya pahala orang yang mengerjakannya tanpa mengurangi pahala pelakunya sedikitpun. Firman-Nya “Sungguh buruk apa yang mereka pikul.” sungguh buruk apa yang mereka bawa, karena ia akan menggiringnya menuju tempat kehancuran mereka yaitu neraka Jahanam. Pelajaran dari ayat: • Penjelasan akibat orang yang mengajak kepada kesesatan, karena ia akan menanggung dosa setiap orang yang melakukannya"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 25",
    "description": "Pengingkaran mereka terhadap Al-Qur'an menyebabkan mereka sesat dan kafir, sehingga pada hari kiamat mereka akan memikul dosa-dosanya sendiri secara sempurna tanpa dikurangi, diampuni, maupun diringankan sedikit pun, dan mereka bahkan memikul sebagian dosa-dosa orang yang mereka sesatkan yang tidak mengetahui sedikit pun bahwa mereka telah disesatkan. Ingatlah, alangkah buruknya dosa yang mereka pikul itu karena tidak akan ada pengurangan dan pengampunan atasnya. Setelah membincang kesesatan kaum musyrik dan upaya mereka menyesatkan orang lain, Allah lalu mengancam mereka dengan hukuman dan azab yang pedih. Allah menegaskan bahwa sungguh, orangorang yang kafir dan ingkar sebelum mereka telah mengadakan tipu daya untuk mengingkari dan menentang ajaran Allah, maka sebab perbuatan mereka itu Allah menghancurkan rumah-rumah mereka mulai dari pondasinya, lalu atap rumah-rumah itu jatuh menimpa mereka dari atas dan membuat mereka tertimbun, dan siksa itu datang kepada mereka secara tiba-tiba dari arah yang tidak mereka sadari, padahal mereka yakin rumah-rumah mereka begitu kuat dan dapat melindungi mereka dari ancaman apa pun."
  }
]