[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sesungguhnya orang-orang kafir telah merencanakan berbagai tipu daya terhadap rasul-rasul yang diutus kepada mereka dan misi mendakwahkan kebenaran yang mereka bawa. Kemudian Allah datang menghancurkan bangunan-bangunan rumah mereka dari dasar dan pondasinya, sehingga atapnya menjatuhi mereka dari atas mereka, dan datanglah kepada mereka kebinasaan melalui tempat tinggal mereka yang aman, lantaran mereka tidak berpikir dan tidak menyangka-nyangka kebinasaan mereka muncul dari dalam rumah mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "26. Orang-orang kafir sebelum mereka telah melakukan tindakan makar terhadap rasul-rasul mereka, maka Allah menghancurkan bangunan-bangunan mereka dari dasarnya, lalu atapnya jatuh menimpa mereka, azab datang kepada mereka dari arah yang tidak mereka sangka. Mereka menyangka bahwa bangunan-bangunan mereka bisa melindungi mereka, namun mereka malah binasa karena tertimpa bangunan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "26. Sebelum orang-orang sesat itu, juga telah berlalu orang-orang yang seperti mereka. Mereka mengatur tipu daya untuk para nabi dan orang-orang beriman, akan tetapi Allah menggagalkan tipu daya mereka dengan menghancurkan negeri mereka; Allah menghancurkan rumah-rumah mereka sampai ke pondasinya sehingga atapnya menimpa mereka. Allah membinasakan mereka ketika mereka tidak menyangka kedatangannya. Ini merupakan perumpamaan yang jelas untuk menjelaskan kegagalan tipudaya yang telah mereka buat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "26. قَدْ مَكَرَ الَّذِينَ مِن قَبْلِهِمْ (Sesungguhnya orang-orang yang sebelum mereka telah mengadakan makar) Mereka merencanakan berbagai tipu daya agar menjadikan orang lain mendustakan apa yang dibawa oleh para Rasul. Mayoritas ahli tafsir berpendapat bahwa yang dimaksud dalam ayat ini adalah Namrud bin Kan’an, dia membangun bangunan yang tinggi di negeri Babil, dengan bangunan itu ia bermaksud untuk naik ke langit agar ia dapat memerangi penghuni langit; maka Allah mengirimkan angin sehingga bangunan itu runtuh menimpa dirinya dan kaumnya hingga mereka semua binasa. فَأَتَى اللهُ بُنْيٰنَهُم مِّنَ الْقَوَاعِدِ(maka Allah menghancurkan rumah-rumah mereka dari pondasinya) Yakni Allah mengirim angin ke sisi pondasinya agar bangunan itu goyah. فَخَرَّ عَلَيْهِمُ السَّقْفُ مِن فَوْقِهِمْ(lalu atap (rumah itu) jatuh menimpa mereka dari atas) Yakni runtuh menimpa mereka. وَأَتَىٰهُمُ الْعَذَابُ(dan datanglah azab itu kepada mereka) Yakni kebinasaan mendatangi mereka. من حيث لا يشعرون (dan datanglah azab itu kepada mereka dari tempat yang tidak mereka sadari) Akan tetapi mereka merasa dalam keamanan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "26. Sesungguhnya orang-orang yang sebelum mereka yaitu kafir Makkah Namrudz bin Kan’an telah mengadakan makar, maka Allah menghancurkan dengan angin dan menggoncakan rumah-rumah mereka dari pondasinya, lalu atap rumah itu jatuh menimpa mereka dari atas. Adapun azab itu datang kepada mereka dari tempat yang tidak mereka sadari. Inilah janji untuk orang-orang kafir dan orang-orang yang hidup pada zaman Nabi SAW bahwa perbuatan membangkang mereka itu akan mereka terima kembali berupa balasan untuk mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sungguh orang-orang sebelum mereka telah melakukan tipu daya. Lalu Allah menghancurkan rumah-rumah mereka mulai dari pondasinya} pondasinya {lalu atapnya jatuh} jatuh {menimpa mereka dari atas. Azab itu datang kepada mereka dari arah yang tidak mereka sadari"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "26-27. “sesungguhnya orang orang yang sebelum mereka telah mengadakan makar” terhadap para rasul mereka dan ingin mengecoh dengan berbagai rekayasa untuk menolak risalah yang dibawa oleh para rasul kepada mereka. Diantara bentuk makar mereka adalah, membangun istana istana yang luar biasa besarnya ”maka Allah menghancurkan rumah rumah mereka dari pondasinya” maksudnya, Allah mendatangkan hukuman bencana yang menerjang rumah rumah itu dari dasar dan pondasinya, ”lalu atap (rumah itu) jatuh menimpa mereka dari atas” maka gedung yang mereka bangun berubah menjad siksaan, mereka tersiksa karenanya, ”dan datanglah azab itu kepada mereka dari tempat yang tidak mereka sadari”. demikian itu, lantaran mereka menyangka bahwa bangunan itu akan bermanaat bagi mereka dan melindungi mereka dari azab. Akhirnya, siksaan (yang menimpa) mereka bersumber dari rumah yang mereka bangun dan mereka dirikan sendiri. ini termasuk bentuk perumpamaan terbaik perihal Allah menggugurkan makar pada musuhNya. Mereka telah memeras pikiran dan memperkirakan tentang risalah yang disampaikan oleh para rasul ketika mereka mendustakannya. Untuk menghadapi para rasul, mereka membuat asas asas dan kaidah kaidah yang batil, yang mereka jadikan rujukan untuk menolak risalah yang dibawa oleh para rasul. mereka juga menerapkan siasat untuk menimpakan hal hal buruk dan bahaya pada para rasul dan para pengikut mereka. Maka, uasaha makar mereka ini justru berubah menjadi sumber kehancuran mereka. Hal ini karena usaha makar mereka sungguh tidak baik, dan tidaklah tindakan makar itu melainkan akan kembali menimpa pelakunya. Ini akibat buruk mereka di dunia, dan sungguh siksaan akhirat lebih menghinakan lagi. Untuk itu Allah berfirman ”kemudian Allah menghinakan mereka di hari kiamat” maksudnya mempermalukan mereka di hadapan seluruh makhluk dan menjelaskan kedustaan dan kebohongan mereka yang mengatasnamakan Allah. \"dan berfirman ’Dia manakah sekutu sekutuKu itu (yang karena membelanya) kamu selalu memusuhi mereka (nabi nabi dan orang orang mukmin)”, maksudnya kalian memerangi dan memusuhi Allah dan golonganNya. Karena mereka (sekutu sekutu itu) kalian mempunyai asumsi bahwa mereka merupakan sekutu sekutu bagi Allah. Apabila Allah menanyakan hal ini kepada mereka, niscaya mereka tidak mempunyai jawaban selain pengakuan atas kesesatan dan permusuhan mereka. Mereka mengakui ”berhala berhala itu semuanya telah lenyap dari kami, dan mereka mengakui terhadap diri mereka bahwa mereka adalah orang orang yang kafir” “berkatalah orang orang yang telah diberi ilmu” yaitu para ulama Rabbani “sesungguhnya kehinaan pada hari ini” yaitu hari kiamat, ”dan keburukan” yaitu azab “ditimpakan atas orang orang yang kafir”. Dalam ayat ini termuat keterangan tentang keutamaan pada ulama, dan bahwa mereka adalah para juru bicara yang menyampaikan kebenaran di dunia ini dan pada hari ketika para saksi hadir, dan ucapan mereka memiliki tempat di sisi Allah dan para mahkluk."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 26: Mereka sebelumnya mengira, bahwa bangunan yang mereka buat akan bermanfaat bagi mereka dan akan mencapaikan maksud yang mereka inginkan, namun ternyata bangunan itu berubah menjadi azab bagi mereka yang rubuh menimpa mereka. Ini merupakan perumpamaan yang sangat bagus, ketika mereka berpikir dan mengatur siasat untuk menimpakan makar kepada para rasul dan apa yang mereka bawa, sampai mereka membuat perencanaan yang matang, dan mereka buat pondasinya dan kemudian mereka tegakkan bangunan di atasnya (dengan melancarkan makar tersebut), hingga ketika telah tinggi bangunan yang mereka buat, maka Allah hancurkan pondasinya, sehingga bangunan yang telah mereka bangun atau rencana yang telah mereka matangkan dan hampir saja selesai ternyata runtuh, bahkan menimpa mereka. Ini ketika di dunia, sedangkan di akhirat ada lagi azab yang lebih keras."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 26",
    "description": "Setelah membincang kesesatan kaum musyrik dan upaya mereka menyesatkan orang lain, Allah lalu mengancam mereka dengan hukuman dan azab yang pedih. Allah menegaskan bahwa sungguh, orangorang yang kafir dan ingkar sebelum mereka telah mengadakan tipu daya untuk mengingkari dan menentang ajaran Allah, maka sebab perbuatan mereka itu Allah menghancurkan rumah-rumah mereka mulai dari pondasinya, lalu atap rumah-rumah itu jatuh menimpa mereka dari atas dan membuat mereka tertimbun, dan siksa itu datang kepada mereka secara tiba-tiba dari arah yang tidak mereka sadari, padahal mereka yakin rumah-rumah mereka begitu kuat dan dapat melindungi mereka dari ancaman apa pun. Tidak saja di dunia, azab dan hukuman bagi orang kafir dan durhaka juga diikuti oleh azab yang lebih pedih lagi di akhirat. Allah menjelaskan, kemudian Allah menghinakan mereka pada hari kiamat dengan siksaan yang pedih di neraka jahanam, dan ketika itu Allah berfirman, 'di manakah sesembahan yang kamu jadikan sekutu-sekutu-ku itu yang karena membelanya kamu selalu memusuhi mereka, yakni para nabi yang aku utus kepada kamu dan kaum mukmin' orang-orang yang diberi ilmu, yakni para malaikat, nabi, dan kaum mukmin dengan tegas berkata, sesungguhnya kehinaan dan azab pada hari kiamat ini ditimpakan kepada orang yang kafir dan menentang ajaran Allah."
  }
]