[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian pada hari kiamat, Allah akan mempermalukan mereka dengan menjatuhkan siksaan dan menghinakan mereka dengannya, dan Dia berfirman ”Manakah sekutu-sekutuKu dari tuhan-tuhan selain Aku yang kalain sembah, agar mereka mencegah siksaan dari kalian sedang kalian dulu menyerang nabi-nabi dan kaum mukminin dan memusuhi mereka untuk membela tuhan-tuhan itu? Para ulama rabbani mengatakan “sesungguhnya kehinaan dan siksaan pada hari ini menimpa orang-orang yang kafir kepada Allah dan rasul-rasulNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "27. Kemudian pada hari Kiamat Allah menghinakan dan merendahkan mereka dengan azab. Allah berfirman kepada mereka, “Mana sekutu-sekutu-Ku yang kalian setarakan dengan-Ku dalam ibadah, dan karena mereka kalian berani memusuhi nabi-nabi-Ku dan orang-orang Mukmin?” Para ulama Rabbani menjawab, “Sesungguhnya kehinaan dan azab pada hari Kiamat akan menimpa orang-orang kafir.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "27. Kemudian pada hari kiamat Allah menghinakan mereka dengan olokan: “Dimanakah sekutu-sekutu yang kalian sembah dahulu yang menjadi sebab kalian memusuhi para nabi dan orang-orang beriman?” Orang-orang berilmu dari kalangan orang-orang beriman berkata: “Inilah hari datangnya kehinaan dan azab bagi orang-orang yang mendustakan Allah dan para rasul-Nya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "27. ثُمَّ يَوْمَ الْقِيٰمَةِ يُخْزِيهِمْ (Kemudian Allah menghinakan mereka di hari kiamat) Dan merendahkan mereka dengan memasukkan mereka ke dalam neraka. وَيَقُولُ أَيْنَ شُرَكَآءِىَ(dan berfirman: “Di manakah sekutu-sekutu-Ku itu) Sebagaimana yang kalian klaim dan kalian ucapkan. الَّذِينَ كُنتُمْ تُشٰٓقُّونَ فِيهِمْ ۚ( (yang karena membelanya) kamu selalu memusuhi mereka (nabi-nabi dan orang-orang mukmin)?) Sehingga kalian memusuhi para nabi dan orang-orang beriman demi membela mereka. قَالَ الَّذِينَ أُوتُوا۟ الْعِلْمَ(Berkatalah orang-orang yang telah diberi ilmu) Terdapat pendapat mengatakan bahwa mereka adalah para ulama, mereka mengatakan ini kepada umat mereka sebagai ejekan bagi orang-orang kafir. إِنَّ الْخِزْىَ الْيَوْمَ(Sesungguhnya kehinaan hari ini) Yakni kehinaan di hari kiamat. وَالسُّوٓءَ(serta azab) Yakni azab. عَلَى الْكٰفِرِينَ(ditimpakan atas orang-orang yang kafir) Yakni hanya bagi mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "27. Kemudian Allah menghinakan mereka di hari kiamat dengan mengazab mereka, dan berfirman sebagai hinaaan: “Di manakah sekutu-sekutu-Ku itu yang karena membelanya kamu selalu memusuhi para nabi dan orang-orang mukmin?” Orang-orang yang telah diberi ilmu yaitu para nabi dan orang mukmin berkata: “Sesungguhnya kehinaan dan azab hari ini hanya ditimpakan atas orang-orang yang kafir”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kemudian pada hari kiamat Dia menghinakan mereka} menghinakan dan merendahkan mereka dengan azab {dan berfirman,“Di manakah sekutu-sekutuKu (yang mana karena itu) kalian memusuhi mereka} kalian memusuhi nabi-nabiku dan orang-orang mukmin karena itu {Orang-orang yang dianugerahi ilmu berkata,“Sesungguhnya kehinaan} kehinaan {dan azab} azab {pada hari ini ditimpakan kepada orang-orang kafir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "26-27. “sesungguhnya orang orang yang sebelum mereka telah mengadakan makar” terhadap para rasul mereka dan ingin mengecoh dengan berbagai rekayasa untuk menolak risalah yang dibawa oleh para rasul kepada mereka. Diantara bentuk makar mereka adalah, membangun istana istana yang luar biasa besarnya ”maka Allah menghancurkan rumah rumah mereka dari pondasinya” maksudnya, Allah mendatangkan hukuman bencana yang menerjang rumah rumah itu dari dasar dan pondasinya, ”lalu atap (rumah itu) jatuh menimpa mereka dari atas” maka gedung yang mereka bangun berubah menjad siksaan, mereka tersiksa karenanya, ”dan datanglah azab itu kepada mereka dari tempat yang tidak mereka sadari”. demikian itu, lantaran mereka menyangka bahwa bangunan itu akan bermanaat bagi mereka dan melindungi mereka dari azab. Akhirnya, siksaan (yang menimpa) mereka bersumber dari rumah yang mereka bangun dan mereka dirikan sendiri. ini termasuk bentuk perumpamaan terbaik perihal Allah menggugurkan makar pada musuhNya. Mereka telah memeras pikiran dan memperkirakan tentang risalah yang disampaikan oleh para rasul ketika mereka mendustakannya. Untuk menghadapi para rasul, mereka membuat asas asas dan kaidah kaidah yang batil, yang mereka jadikan rujukan untuk menolak risalah yang dibawa oleh para rasul. mereka juga menerapkan siasat untuk menimpakan hal hal buruk dan bahaya pada para rasul dan para pengikut mereka. Maka, uasaha makar mereka ini justru berubah menjadi sumber kehancuran mereka. Hal ini karena usaha makar mereka sungguh tidak baik, dan tidaklah tindakan makar itu melainkan akan kembali menimpa pelakunya. Ini akibat buruk mereka di dunia, dan sungguh siksaan akhirat lebih menghinakan lagi. Untuk itu Allah berfirman ”kemudian Allah menghinakan mereka di hari kiamat” maksudnya mempermalukan mereka di hadapan seluruh makhluk dan menjelaskan kedustaan dan kebohongan mereka yang mengatasnamakan Allah. \"dan berfirman ’Dia manakah sekutu sekutuKu itu (yang karena membelanya) kamu selalu memusuhi mereka (nabi nabi dan orang orang mukmin)”, maksudnya kalian memerangi dan memusuhi Allah dan golonganNya. Karena mereka (sekutu sekutu itu) kalian mempunyai asumsi bahwa mereka merupakan sekutu sekutu bagi Allah. Apabila Allah menanyakan hal ini kepada mereka, niscaya mereka tidak mempunyai jawaban selain pengakuan atas kesesatan dan permusuhan mereka. Mereka mengakui ”berhala berhala itu semuanya telah lenyap dari kami, dan mereka mengakui terhadap diri mereka bahwa mereka adalah orang orang yang kafir” “berkatalah orang orang yang telah diberi ilmu” yaitu para ulama Rabbani “sesungguhnya kehinaan pada hari ini” yaitu hari kiamat, ”dan keburukan” yaitu azab “ditimpakan atas orang orang yang kafir”. Dalam ayat ini termuat keterangan tentang keutamaan pada ulama, dan bahwa mereka adalah para juru bicara yang menyampaikan kebenaran di dunia ini dan pada hari ketika para saksi hadir, dan ucapan mereka memiliki tempat di sisi Allah dan para mahkluk."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 27: Yang dimaksud dengan orang-orang yang diberi ilmu adalah para nabi dan para ulama. Dalam ayat ini terdapat keutamaan ahli ilmu, dan bahwa mereka akan mengatakan yang hak di akhirat sebagaimana mereka telah mengatakan yang hak di dunia, dan bahwa perkataan mereka dipandang di sisi Allah dan di sisi makhluk-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 27",
    "description": "Tidak saja di dunia, azab dan hukuman bagi orang kafir dan durhaka juga diikuti oleh azab yang lebih pedih lagi di akhirat. Allah menjelaskan, kemudian Allah menghinakan mereka pada hari kiamat dengan siksaan yang pedih di neraka jahanam, dan ketika itu Allah berfirman, 'di manakah sesembahan yang kamu jadikan sekutu-sekutu-ku itu yang karena membelanya kamu selalu memusuhi mereka, yakni para nabi yang aku utus kepada kamu dan kaum mukmin' orang-orang yang diberi ilmu, yakni para malaikat, nabi, dan kaum mukmin dengan tegas berkata, sesungguhnya kehinaan dan azab pada hari kiamat ini ditimpakan kepada orang yang kafir dan menentang ajaran Allah. Orang kafir yang mendapat kehinaan dan azab itu adalah orang yang pada saat dicabut nyawanya oleh para malaikat tetap dalam keadaan zalim kepada diri sendiri, lalu mereka menyerahkan diri kepada malaikat maut dalam keadaan tidak berdaya seraya membela diri, kami tidak pernah mengerjakan sesuatu kejahatan pun. Malaikat menjawab, pernah! apa yang kamu katakan adalah dusta belaka. Kamu tidak dapat berbohong dan membela diri karena sesungguhnya Allah maha mengetahui apa, yaitu kejahatan dan dosa, yang telah kamu kerjakan."
  }
]