[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Yaitu orang-orang yang malaikat menacabut ruh-ruh mereka dalam keadaan mereka berbuat kezhaliman kepada diri mereka dengan kekafiran. Lalu mereka berserah diri kepada ketetapan Allah ketika melihat kematian (tiba) dan mereka mengingkari semua yang mereka sembah selain Allah, sembari berkata, ”kami tidaklah berbuat maksiat apapun.” Lalu dikatakan kepada mereka, ”kalian dusta, sebab sesungguhnya kalain dahulu melakukannya. Sesungguhnya Allah Mahamengetahui perbuatan-perbuatan kalian semuanya, dan akan memberikan balasan kepada kalain karena itu.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "28. Yaitu orang-orang yang ketika nyawa mereka dicabut oleh Malaikat maut dan para asistennya saat mereka sedang berbuat zalim terhadap diri mereka dengan kekufuran kepada Allah, maka orang-orang itu tunduk berserah diri manakala maut datang kepada mereka, sambil berlepas diri dari apa yang selama ini mereka lakukan, yaitu kekufuran dan kemaksiatan, karena mereka menyangka bahwa berlepas diri dalam keadaan demikian bermanfaat bagi mereka, maka dikatakan kepada mereka, “Kalian dusta! Kalian adalah orang-orang kafir yang bergelimang dosa. Sesungguhnya Allah Maha mengetahui perbuatan yang kalian lakukan di dunia, tidak ada sesuatu yang samar bagi Allah, dan Dia akan membalas perbuatan kalian.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "28- 29. Orang-orang yang mendustakan itu dicabut nyawa mereka oleh para malaikat yang bertugas untuk mencabut nyawa ketika mereka dalam keadaan menzalimi diri sendiri dengan kekafiran yang mereka perbuat. Mereka tidak berkutik ketika kematian telah datang namun mereka tetap berdusta dengan berkata: “Kami tidak pernah melakukan kekafiran atau kesyirikan sedikitpun”. Maka dikatakan kepada mereka: “Allah Maha Mengetahui dosa-dosa yang telah kalian perbuat dan karena dosa-dosa itu kalian akan diperintahkan untuk memasuki pintu-pintu neraka jahanam dan kalian akan tinggal di dalamnya selama-lamanya.” Itulah seburuk-buruk tempat bagi orang-orang yang berpaling dari kebenaran."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "28. الَّذِينَ تَتَوَفَّىٰهُمُ الْمَلٰٓئِكَةُ ظَالِمِىٓ أَنفُسِهِمْ ۖ ((yaitu) orang-orang yang dimatikan oleh para malaikat dalam keadaan berbuat zalim kepada diri mereka sendiri) Dengan melakukan kekafiran terhadap apa yang diturunkan Allah. فَأَلْقَوُا۟ السَّلَمَ(lalu mereka menyerah diri) Yakni mereka mengakui ketuhanan Allah, dan meninggalkan permusuhan ketika mereka melihat malaikat maut. مَا كُنَّا نَعْمَلُ مِن سُوٓءٍۭ ۚ( Kami sekali-kali tidak ada mengerjakan sesuatu kejahatanpun) Mereka mengatakan ini sebagai kebohongan. Lalu para ulama itu menjawab: بَلَىٰٓ إِنَّ اللهَ عَلِيمٌۢ بِمَا كُنتُمْ تَعْمَلُونَ بَلَىٰٓ إِنَّ اللهَ عَلِيمٌۢ بِمَا كُنتُمْ تَعْمَلُونَ(tidak, sesungguhnya Allah Maha Mengetahui apa yang telah kamu kerjakan) Yakni, tidak demikian, akan tetapi kalian dahulu selalu melakukan kejahatan, dan tidak akan bermanfaat sedikitpun bagi kalian kebohongan ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "28. Yaitu orang-orang yang dimatikan oleh para malaikat dalam keadaan berbuat zalim kepada diri mereka sendiri dengan kekufuran, lalu mereka menyerah dengan meyakini ketuhanan Allah sambil berkata dusta; “Kami sekali-kali tidak ada mengerjakan sesuatu kejahatanpun, baik itu kekufuran kesyirikan maupun permusuhan”. Malaikat menjawab: “Iya, sesungguhnya Allah Maha Mengetahui kejahatan yang telah kamu kerjakan, namun dustamu ini tidak akan memberi manfaat apapun kepadamu, Allah akan membalas semua perbuatan kalian”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang dicabut nyawanya} dicabut nyawa mereka {oleh malaikat dalam keadaan menzalimi diri sendiri} keadaan mereka itu selalu dalam kekufuran {lalu mereka menyerahkan diri} lalu mereka menyerahkan diri dan tunduk ketika mati seraya berkata {“Kami tidak pernah mengerjakan suatu kejahatan pun”} kekufuran dan kemaksiatan {“Pernah, sesungguhnya Allah Maha Mengetahui apa yang telah kalian kerjakan”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "28. berikutnya, dibeberkan kejadian kejadian yang ditimpakan kepada mereka di saat kematian dan hari kiamat “(yaitu) orang orang yang dimatikan oleh para malaikat dalam keadaan berbuat zhalim kepada diri mereka sendiri”, maksudnya orang orang yang dimatikan oleh para malaikat dalam kondisi tersebut, adalah orang yang sarat dengan tindak kezhaliman dan kesesatan mereka. Dan sungguh, sudah dimaklumi bersama segala sesuatu yang mendera orang orang yang berbuat aniaya pada momen itu, berupa aneka macam bentuk siksa, kehinaan, dan kenistaan. “lalu mereka menyerah diri” maksudnya mereka berpasrah diri dan mengingkari sesembahan yang dahulu mereka sembah selain Allah. Mereka berkata ”kami sekali kali tidak mengerjakan suatu kejahatan pun” maka dikatakan kepada mereka “ya, ada” kalian memang pernah berbuat kejelekan. Maka “sesungguhnya Allah Maha Mengetahui apa yang telah kamu kerjakan” pengingkaran kalian tidak berguna sama sekali. Dialog ini terjadi pada sebagian peristiwa di hari kiamat, mereka tidak mengakui apa yang mereka perbuat di dunia, dengan asumsi akan bermanfaat bagi mereka. Manakala angota anggota tubuh bersaksi buruk atas mereka, maka menjadi jelaslah fakta tindakan mereka terdahulu. Mereka (akhirnya) mengamini dan mengakui(nya). Oleh karena itu, mereka tidak dimasukkan neraka sampai mengeluarkan pengakuan atas dosa dosa mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 28: Dengan berbuat kekufuran. Yakni melakukan perbuatan syirk. Oleh karena itu, pengingkaran mereka tidaklah berguna. Hal ini pada sebagian tempat di hari kiamat, mereka mengingkari perbuatan mereka selama di dunia karena mengira bahwa pengingkaran itu bermanfaat bagi mereka, namun ketika anggota badan mereka bersaksi terhadap diri mereka, maka mereka akan mengaku. Oleh karenanya, mereka tidak dimasukkan ke dalam neraka sampai mereka benar-benar mengakui kesalahannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 28",
    "description": "Orang kafir yang mendapat kehinaan dan azab itu adalah orang yang pada saat dicabut nyawanya oleh para malaikat tetap dalam keadaan zalim kepada diri sendiri, lalu mereka menyerahkan diri kepada malaikat maut dalam keadaan tidak berdaya seraya membela diri, kami tidak pernah mengerjakan sesuatu kejahatan pun. Malaikat menjawab, pernah! apa yang kamu katakan adalah dusta belaka. Kamu tidak dapat berbohong dan membela diri karena sesungguhnya Allah maha mengetahui apa, yaitu kejahatan dan dosa, yang telah kamu kerjakan. Maka malaikat berkata kepada mereka, wahai orang kafir, masukilah pintu-pintu neraka jahanam yang telah dijanjikan dan disiapkan sebagai tempat kembalimu beserta siksa yang amat pedih di dalamnya. Kamu tinggal dengan kekal di dalamnya. Pasti, neraka jahanam itu adalah seburuk-buruk tempat orang yang menyombongkan diri."
  }
]