[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka masuklah kalain kedalam pintu-pintu neraka jahanam, kalian tidak akan keluar darinya selamanya. itulah seburuk-buruk tempat tinggal bagi orang-orang yang sombong untuk beriman kepada Allah semata dan beribadah serta taat kepadaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "29. Dikatakan kepada mereka, “Masuklah kalian ke dalam pintu-pintu Jahanam berdasarkan amal-amal kalian untuk tinggal di dalamnya selama-lamanya”. Ia adalah seburuk-buruk tempat tinggal bagi orang-orang yang menyombongkan diri, enggan beriman kepada Allah dan penyembahan kepada-Nya semata."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "29. فَلَبِئْسَ مَثْوَى الْمُتَكَبِّرِينَ (Maka amat buruklah tempat orang-orang yang menyombongkan diri itu) Yakni neraka Jahannam. dan yang dimaksud adalah kesombongan mereka sehingga enggan untuk beriman dan beribadah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "29. Lalu ketika mereka menghadapi sakaratul maut dikatakan kepada mereka: “Maka masukilah setiap dari kalian ke pintu-pintu neraka Jahannam, kamu kekal di dalamnya. Maka amat buruklah tempat orang-orang yang menyombongkan diri itu dari ketaatan dan iman, yaitu neraka Jahanam”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka masukilah pintu-pintu neraka Jahanam dengan keadaan kekal di dalamnya. Sungguh seburuk-buruk tempat tinggal} tempat tinggal {orang yang sombong"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "29. Apabila mereka memasuki pintu pintu Neraka jahanam, maka setiap orang yang mengamalkan suatu amalan akan memasuki pintunya yang sesuai dengan kondisinya. Maka, itu adalah sejelek jelek “tempat orang orang yang menyombongkan diri” yaitu neraka jahanam. Sesungguhnya ia merupakan tempat kesedihan dan penyesalan, hunian (yang sarat) kesengsaraan dan kepedihan, sumber kegelisahan dan kerisauan, pusat kemurkaan dari Dzat yang Mahahidup kekal lagi terus mengurusi (makhlukNya). Siksaan tidak dikendorkan atas mereka, dan kepedihan hukumannya tidak pernah dihentikan bagi mereka. Rabb yang Maha Penyayang telah berpaling dari mereka, dan menimpakan siksaan berat pada mereka."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (فَلَبِئۡسَ مَثۡوَى ٱلۡمُتَكَبِّرِينَ) falabi`sa mastwal mutakabbiriin : “pasti itu seburuk-buruk tempat orang yang menyombongkan diri.” Matswal mutakabbirin adalah tempat orang-orang yang sombong kelak di neraka Jahanam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 29: Masing-masing orang kafir masuk melalui pintu yang sesuai dengan keadaan mereka. Ya, karena tempat itu adalah tempat penyesalan dan penderitaan, tempat kesengsaraan dan kepedihan, tempat kesedihan dan keputusasaan. Azabnya tidak dihentikan meskipun sehari, Tuhan Yang Maha Penyayang telah berpaling dari mereka dan merasakan kepada mereka azab yang pedih."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 29",
    "description": "Maka malaikat berkata kepada mereka, wahai orang kafir, masukilah pintu-pintu neraka jahanam yang telah dijanjikan dan disiapkan sebagai tempat kembalimu beserta siksa yang amat pedih di dalamnya. Kamu tinggal dengan kekal di dalamnya. Pasti, neraka jahanam itu adalah seburuk-buruk tempat orang yang menyombongkan diri. Usai menyebut hukuman dan azab di dunia dan akhirat bagi orang kafir, Allah melalui ayat-ayat berikut menjelaskan pahala bagi orang yang bertakwa, baik di dunia maupun akhirat. Allah berfirman, dan kemudian dikatakan oleh para malaikat kepada orang yang bertakwa yang selalu taat dan patuh kepada Allah, apakah yang telah diturunkan oleh tuhanmu kepada kamu' mereka menjawab, tuhan kami telah menurunkan kebaikan. Bagi orang yang berbuat baik dengan didasari iman dan takwa pada masa hidup mereka di dunia ini pasti mendapat balasan yang baik. Dan sesungguhnya balasan yang baik di dunia itu belumlah seberapa karena balasan di negeri akhirat pasti lebih baik. Dan itulah sebaik-baik tempat tinggal bagi orang yang bertakwa. Mereka kekal di dalamnya."
  }
]