[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah menciptakan langit dan bumi dengan haaq, agar para hamba dapat mengambil petunjuk dengan keduanya tentang keagungan pencipta keduanya, dan bahwasannya Dia satu-stuNya Dzat yang berhak diibadahi. Allah maha suci dan maha agung dari perbuatan syirik mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Allah menciptakan langit dan bumi tanpa contoh sebelumnya dengan benar, Allah tidak menciptakan keduanya secara batil, tetapi Allah menciptakan keduanya agar dijadikan sebagai bukti atas keagungan-Nya. Mahasuci Allah dari penyekutuan mereka kepada-Nya dengan selain-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "3. Allah menciptakan tujuh langit dan bumi dengan benar. Maha Tinggi Allah dari segala sekutu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. خَلَقَ السَّمٰوٰتِ وَالْأَرْضَ بِالْحَقِّ ۚ (Dia menciptakan langit dan bumi dengan hak) Yakni Allah menciptakan keduanya dengan sifat ini agar menjadi tanda kekuasaan dan keesaan-Nya. تَعٰلَىٰ عَمَّا يُشْرِكُونَ (Maha Tinggi Allah daripada apa yang mereka persekutukan) Yakni Maha Tinggi dan Maha Suci Allah dari sekutu yang mereka ada-adakan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Dia menciptakan langit dan bumi dengan haq bukan dengan main-main. Maha Tinggi Allah daripada apa yang mereka persekutukan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia menciptakan langit dan bumi dengan benar. Maha tinggi Dia dari apa yang mereka sekutukan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3. Allah memberitahukan bahwasanya “Dia menciptakan langit dan bumi dengan haq” supaya hamba hambaNYa menjadikan keduanya sebagai bukti keagungan sang pencipta keduanya, dan sifat sifat kesempurnaan milikNya, serta agar mengetahui bahwa Dia menciptakan keduanya untuk tempat kediaman bagi hamba hambaNya yang menyembahNya berdasarkan sesuatu yang Allah titahkan kepada mereka, berupa aturan aturan syariat yang allah turunkan melalui keterangan para RasulNya. Untuk itu, Dia menyucikan diriNya dari bentuk syirik kaum yang musyrikin yang menyekutukan (sesuatu denganNya). Allah berfirman ”Maha Tinggi Allah daripada sesuatu yang mereka persekutukan” maksudnya Allah berepas diri dan Maha agung dari kesyirikan mereka. Sesungguhnya Dia adalah tuhan yang sebenarnya. Tidak seyogyanya peribadahan, mahabbah (rasa kecintaan) dan ketundukan diperuntukkan melainkan kepadaNya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat: Firman-Nya pada ayat-ayat selanjutnya “Dia menciptakan langit dan bumi dengan kebenaran, Maha Tinggi Allah dari apa yang mereka persekutukan.” Ini merupakan bukti akan kebenaran tauhid dan kebatilan syirik, maka yang telah menciptakan langit dan bumi sendirian tanpa bantuan dengan kekuasaan dan ilmu-Nya, pantas untuk disembah, bukan tuhan-tuhan yang mati, tidak mendengar, melihat, dan juga berbicara, “Maha Tinggi Allah dari apa yang mereka persekutukan.” Bersih dan suci, lagi Maha Tinggi dari apa yang mereka persekutukan berupa patung dan berhala."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 3: Syaikh As Sa’diy berkata, “Surat ini dinamakan pula surat nikmat; karena Allah menyebutkan di awalnya ushul (dasar-dasar) nikmat dan kaedahnya, sedangkan di akhirnya penyempurna dan pelengkapnya. Allah Ta’ala memberitahukan, bahwa Dia yang menciptakan langit dan bumi dengan kebenaran agar semua hamba menjadikannya sebagai dalil yang menunjukkan keagungan Penciptanya, serta menunjukkan sifat-sifat sempurna yang dimiliki-Nya, dan agar mereka mengetahui bahwa Dia menciptakan keduanya sebagai tempat tinggal bagi hamba-hamba-Nya yang beribadah kepada-Nya sesuai syari’at yang diperintahkan-Nya melalui lisan para rasul-Nya. Oleh karena itu, Allah Ta’ala menyucikan diri-Nya dari sikap orang-orang musyrikin menyekutukan-Nya.” Lihat pula surat Yunus ayat 5."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 3",
    "description": "Allah mengingatkan manusia bahwa dia adalah tuhan yang telah menciptakan langit tempat kalian berteduh bersama benda-benda yang menghiasinya, dan menciptakan bumi tempat kalian berpijak bersama apa saja yang terhampar di atasnya dan terkandung di dalamnya. Semua itu Allah ciptakan dengan kebenaran, yaitu sesuai dengan hikmah dan kebijaksanaan-Nya. Mahatinggi Allah dalam segala hal, sifat, dan perbuatan-Nya, dari apa yang mereka persekutukan dengan-Nya berupa berhala-berhala itu. Dia yang mahaesa dan mahakuasa itu juga telah menciptakan manusia dari setetes mani yang secara lahiriah tampak remeh, tidak berarti, dan tidak berdaya, ternyata dia berubah menjadi manusia yang kuat dan tangguh, bahkan dia berubah menjadi pembantah yang nyata tentang tuhan dan hakikat dirinya."
  }
]