[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apabila dikatakan kepada orang-orang mukmin yang takut kepada Allah “apakah yang diturunkan oleh Allah kepada nabi muhammad ?” mereka menjawab ”Allah menurunkan padanya kebaiakan dan kebenaran.” Bagi orang-orang yang beriman kepada Allah dan rasulNya di dunia ini, dan mengajak hamba-hamba Allah untuk beriman dan beramal shalih, ada kemuliaan yang agung berupa kemenangan bagi mereka di dunia dan keluasan rizki. Dan sunggguh negeri akhirat lebih baik dan lebih agung bagi mereka daripada apa yang diberikan kepada mereka di dunia. Dan sesungguhnya sebaik-baik tempat tinggal bagi orang-orang yang takut kepada Allah di dunia dan takut siksaanNya dengan melaksanakan kewajibannya dan menjauhi laranganNya adalah negeri akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "30. Dan dikatakan kepada orang-orang yang bertakwa kepada Rabb mereka dengan melaksanakan perintah-perintah-Nya dan menjauhi larangan-larangan-Nya, “Apa yang Rabb kalian turunkan kepada Nabi kalian Muhammad -ṣallallāhu 'alaihi wa sallam-?” Mereka menjawab, “Allah menurunkan kepada Nabi kebaikan yang besar.” Bagi orang-orang yang beribadah kepada Allah dengan baik dan bergaul dengan hamba-hamba-Nya dengan baik pula di kehidupan dunia ini balasan pahala yang baik, di antaranya adalah kemenangan dan keluasan rezeki, dan apa yang Allah siapkan bagi mereka berupa pahala di Akhirat adalah lebih baik dibandingkan dengan apa yang Allah segerakan di dunia, dan sebaik-baik kehidupan bagi orang-orang yang bertakwa kepada Rabb mereka dengan melaksanakan perintah-perintah-Nya dan menjauhi larangan-larangan-Nya adalah kehidupan Akhirat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "30-31. Dikatakan kepada orang-orang yang bertakwa: “Apa yang Tuhan kalian turunkan kepada rasul-Nya?” Mereka menjawab: “Allah menurunkan kepadanya kebaikan yang agung berupa al-Qur'an.” Orang-orang yang baik perkataan dan perbuatannya akan mendapatkan kehidupan yang bahagia di dunia; Sedangkan kenikmatan surga yang akan mereka dapatkan di akhirat lebih baik daripada karunia yang diberikan kepada mereka di dunia. Sungguh sebaik-baik tempat tinggal di akhirat adalah tempat tinggal bagi orang-orang yang bertakwa. Mereka akan memasuki surga-surga dan kekal di dalamnya; di dalam surga mereka akan mendapat segala yang mereka inginkan tanpa harus bersusah payah. Demikianlah balasan yang Allah berikan kepada hamba-hamba-Nya yang bertakwa."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "30. وَقِيلَ لِلَّذِينَ اتَّقَوْا۟ (Dan dikatakan kepada orang-orang yang bertakwa) Mereka adalah orang-orang yang beriman. Akan dikatakan kepada mereka perkataan ini ketika datang kematian. مَاذَآ أَنزَلَ رَبُّكُمْ ۚ قَالُوا۟ خَيْرًا (Apakah yang telah diturunkan oleh Tuhanmu? Mereka menjawab: “kebaikan”) Yakni Allah telah menurunkan kebaikan. لِّلَّذِينَ أَحْسَنُوا۟ فِى هٰذِهِ الدُّنْيَا حَسَنَةٌ ۚ (Orang-orang yang berbuat baik di dunia ini mendapat (pembalasan) yang baik) Yakni mereka mengatakan “ini adalah firman yang diturunkan Allah”. Pendapat lain mengatakan bahwa ini termasuk firman Allah. Makna dari perkataan ini adalah bagi orang-orang yang berbuat kebaikan di dunia akan mendapatkan balasan yang baik di dunia. وَلَدَارُ الْاٰخِرَةِ(Dan sesungguhnya kampung akhirat) Yakni balasan di akhirat. خَيْرٌ ۚ( adalah lebih baik) Daripada yang telah diberikan kepada mereka di dunia. وَلَنِعْمَ دَارُ الْمُتَّقِينَ(dan itulah sebaik-baik tempat bagi orang yang bertakwa) Yakni negeri akhirat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "30. Dan dikatakan kepada orang-orang mukmin yang bertakwa dengan menjauhi kesyirikan: “Apakah yang telah diturunkan oleh Tuhanmu kepada rasul-Nya?” Mereka menjawab: “Allah telah menurunkan kebaikan menyeluruh di dunia dan akhirat. Yaitu Alquran. Bagi orang-orang yang berbuat baik di dunia dengan melakukan amal baik ini mendapat pembalasan yang baik di dunia. Dan sesungguhnya negeri akhirat adalah lebih baik dan itulah sebaik-baik tempat bagi orang yang bertakwa, Firman Allah untuk orang-orang yang berbuat ihsan adalah kalimat adalah yang telah Allah turunkan. Itu adalah janji untuk orang-orang yang bertakwa atas balasan atas perkataan dan iman mereka. Adapun yang berkata buruk itu adalah beberapa kabilah di sekitar Makkah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kemudian dikatakan kepada orang yang bertakwa,“Apa yang telah diturunkan Tuhanmu” Mereka menjawab,“Kebaikan”} Datanglah suatu kebaikan {bagi orang-orang yang berbuat baik di dunia ini (balasan) kebaikan. Sungguh negeri akhirat pasti lebih baik. Sungguh sebaik-baik tempat orang-orang yang bertakwa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "30. Ketika Allah menemukakan komentar orang orang yang mendustakan risalah yang Allah turunkan, maka Allah menyebutkan ungkapan kaum muttaqin (orang orang yang bertakwa) bahwa mereka mengakui dan menetapkan bahwa risalah yang diturunkan oleh Allah adalah nikmat yang besar dan kebaikan yang agung yang Allah limpahkan kepada para hambaNya, mereka menerima karunia itu, merengkuhnya dengan tulus dan kepatuhan, dan mereka mensyukurinya. Mereka menyadari kenikmatan itu dan mengaplikasikan ajarannya. “orang orang yang berbuat baik mendapat” maksudnya, didalam beribadah kepada Allah, orang orang yang berbuat baik mendapatkan, ”didunia ini (pembalasan) yang baik” yaitu rizki yang lapang, kehidupan yang nyaman, ketentraman hati, dan rasa aman serta kebahagiaan. ”dan sesungguhnya kampung akhirat adalah lebih baik” daripada kampung (dunia) ini dan seluruh isinya yang berupa kelezatan kelezatan dan hal hal yang mengasyikan. Sesungguhnya kenikmatan dunia Cuma sedikit, penuh dengan kerusakan, lagi bersifat terputus (fana). Berbeda halnya dengan kenikmatan akhirat. Karena itu, Allah berfirman ”dan itulah sebaik baik tempat bagi orang yang bertakwa”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 30: Setelah Allah menyebutkan tentang orang-orang yang mendustakan, maka Allah menyebutkan tentang orang-orang yang bertakwa, bahwa ketika mereka ditanya tentang Al Qur’an yang diturunkan, maka mereka mengakuinya bahwa ia merupakan nikmat dan kebaikan yang besar yang dilimpahkan Allah kepada makhluk-Nya. Mereka menerima nikmat itu, tunduk kepadanya dan mensyukurinya. Mereka pun mempelajarinya dan mengamalkannya. Dengan berbuat ihsan dalam beribadah kepada Allah dan berbuat ihsan terhadap hamba-hamba Allah. Ada yang menafsirkan dengan mendapatkan kehidupan yang baik seperti rezeki yang lapang, kehidupan yang menyenangkan, ketenteraman, keamanan dan kegembiraan. Yakni surga. Dari kehidupan dunia dan kenikmatannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 30",
    "description": "Usai menyebut hukuman dan azab di dunia dan akhirat bagi orang kafir, Allah melalui ayat-ayat berikut menjelaskan pahala bagi orang yang bertakwa, baik di dunia maupun akhirat. Allah berfirman, dan kemudian dikatakan oleh para malaikat kepada orang yang bertakwa yang selalu taat dan patuh kepada Allah, apakah yang telah diturunkan oleh tuhanmu kepada kamu' mereka menjawab, tuhan kami telah menurunkan kebaikan. Bagi orang yang berbuat baik dengan didasari iman dan takwa pada masa hidup mereka di dunia ini pasti mendapat balasan yang baik. Dan sesungguhnya balasan yang baik di dunia itu belumlah seberapa karena balasan di negeri akhirat pasti lebih baik. Dan itulah sebaik-baik tempat tinggal bagi orang yang bertakwa. Mereka kekal di dalamnya. Ganjaran di negeri akhirat itu di antaranya berupa surga-surga 'adn yang mereka masuki, yang mengalir di bawahnya sungai-sungai. Di dalam surga-surga itu mereka mendapat segala apa yang diinginkan. Demikianlah Allah memberi balasan kepada orang yang bertakwa dengan sepenuh hati."
  }
]