[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "31-32. Yaitu surga-surga tempat hunian bagi mereka, tempat mereka bermukim di sana, mereka tidak keluar darinya selamanya, sungai-sungai mengalir di bawah pepohonan dan istana-istananya. Bagi mereka di dalamnya apa saja yang diinginkan oleh jiwa-jiwa mereka. Dengan balasan yang baik seperti ini, Allah akan membalas orang-orang yang takut kepadaNYa dan bertakwa kepadaNYa. Yaitu orang-orang yang malaikat mencabut ruh-ruh merreka, sedang hati mereka bersih dari kekafiran. Malaikat berkata kepada mereka, ”salamun ‘alaikum, ini merupakan penghormatan khusus bagi kalian, dan semoga kalian mendapat keselamatan dari seluruh keburukan. Masuklah kalain ke dalam surga berkat apa yang kalain perbuat berupa keimanan kepada Allah dan ketundukan terhadap perintahNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "32. Yaitu orang-orang yang ketika nyawa mereka dicabut oleh Malaikat maut dan para asistennya hati mereka dalam keadaan bersih dari kekufuran, para Malaikat berkata kepada mereka, “Keselamatan untuk kalian, silakan masuk ke dalam Surga karena apa yang kalian perbuat di dunia berupa keyakinan yang sahih dan amal yang saleh.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "32. Nyawa orang-orang bertaqwa akan dicabut oleh para malaikat agar mereka menghadap Allah. Para malaikat mengucapkan salam kepada mereka dan memberi kabar gembira bahwa mereka akan memasuki surga sebagai balasan atas keimanan dan amal baik yang telah mereka lakukan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "32. الَّذِينَ تَتَوَفَّىٰهُمُ الْمَلٰٓئِكَةُ طَيِّبِينَ ۙ ((yaitu) orang-orang yang diwafatkan dalam keadaan baik oleh para malaikat) Yakni orang-orang yang terbebas dari kesyirikan, atau orang-orang yang shalih, atau yang baik perkataan dan perbuatannya, atau yang memiliki hati yang suci yang percaya terhadap pahala yang akan mereka dapatkan dari Allah. يَقُولُونَ سَلٰمٌ عَلَيْكُمُ(dengan mengatakan (kepada mereka): “Salaamun’alaikum) Yakni para malaikat memberi salam kepada mereka sebagai kabar gembira bagi mereka atas surga yang akan mereka dapatkan, karena makna salam adalah keselamatan dan keamanan. ادْخُلُوا۟ الْجَنَّةَ بِمَا كُنتُمْ تَعْمَلُونَ(masuklah kamu ke dalam surga itu disebabkan apa yang telah kamu kerjakan) Yakni karena amalan kalian, atau balasan atas amalan kalian. Dalam hadits shahih disebutkan: “hendaklah kalian istiqamah dan menetapi yang benar dan ketahuilah bahwasanya amal tidak akan memasukkan seseorang ke dalam surga”. Kemudian beliau ditanya: “Tidak pula anda wahai Rasulullah?” Beliau menjawab: “Ya, Termasuk aku, hanya saja Allâh meliputi diriku dengan rahmat-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "32. Yaitu orang-orang yang diwafatkan dalam keadaan baik oleh para malaikat dengan mengatakan kepada mereka: “Salaamun ’alaikum keselamatan untuk kalian, masuklah kamu ke dalam surga itu atas apa yang telah kamu kerjakan dengan rahmat Allah”. Sebagaimana dijelaskan dalam hadis sahih bahwa: “Amal adalah keadilan, dan rahmat adalah anugerah.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "(Yaitu) orang-orang yang diwafatkan oleh malaikat dalam keadaan baik} dalam keadaan bersih dari kemusyrikan {Mereka berkata} para malaikat berkata kepada mereka{ semoga keselamatan tercurah kepada kalian. Masuklah ke dalam surga karena apa yang telah kalian kerjakan”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "31-32. “(yaitu) surge ’adn yang mereka masuk kedalamnya, mengalir dibawahnya sungai sungai. Di dalam surge itu mereka mendapat segala apa yang mereka kehendaki” maksudnya apapun yang mereka angan angankan dan kehendak mereka telah terpaku dengannya, niscaya akan terealisasikan bagi mereka dalam bentuk yang paling sempurna lagi lengkap. Tidaklah mereka mencari suatu jenis kenikmatan yang membekaskan kesenangan hati dan kebahagiaan jiwa melainkan pasti muncul di hadapan mereka. Oleh sebab itu, Allah memberi kepada para penghuni surge apa saja yang mereka idam idamkan. Sampai sampai Allah mengingatkan mereka sekian banyak kenikmatan yang tidak pernah terbetik dalam hati mereka. Maha berkah Allah yang tiada penghujung bagi kemurahanNya dan tiada batas bagi kedermawananNya, yang tiada sesuatupun yang serupa denganNya dalam sifat sifat DzatNya, sifat sifat perbuatanNya dan pengaruh pengaruh sifat sifat tersebut serta keagungan kepemilikan dan kerajaanNya. ”demikianlah Allah memberi balasan kepada orang orang yang bertakwa” (yang memelihara diri) dari kemurkaan Allah dan siksaNya dengan cara mengerjakan kewajiban kewajiban dan kefardhuan kefardhuan yang Allah tetapkan pada mereka, yang berhubungan dengan hati, jasmani, dan lisan yang menjadi hak Allah dan hak sesama manusia, dan meninggalkan hal hal yang dilarang oleh Allah. “yaitu orang orang yang diwafatkan oleh para malaikat” senantiasa menjaga ketakwaan mereka “dalam keadaan baik” maksudnya, suci dan menyucikan dari segala aib dan kotoran yang mengenai mereka dan menorehkan dampak buruk pada iman mereka. Hati mereka menjadi baik karena ma’rifatullah dan kecintaannya kepadaNya, lisan lisan mereka menjadi baik lantaran mengingat Allah dan memujiNya, dan anggota tubuh mereka baik dengan ketaatan dan menghadapkan wajah kepadaNya. “dengan mengatakan (kepada mereka) ‘semoga keselamatan tercurahkan kepada kalian’” maksudnya ucapan penghormatan yang sempurna diperuntukan bagi kalian dan keselamatan dari setiap gangguan. Sungguh, kalian telah bebas dari segala yang kalian benci “masuklah kalian ke dalam surge itu disebabkan apa yang telah kalian kerjakan” dalam bentuk keimanan kepada Allah, kepatuhan kepada perintahNya. Sesungguhnya amalan merupakan penyebab, materi dan asas untuk masuk surga dan selamat dari api neraka. Amalan itu bisa terlaksana bagi mereka atas dasar rahmat Allah dan karuniaNYa, bukan atas daya dan kekuatan mereka."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (طَيِّبِينَ) thayyibiin : “dalam keadaan baik.” Arwahnya, karena tumbuh dengan keimanan dan amal saleh serta menjauhi kesyirikan dan maksiat. (يَقُولُونَ سَلَٰمٌ عَلَيۡكُمُ) yaquuluuna salaamun ‘alaikum : “berkata kepada mereka ‘Salaamun ‘alaikum’” malaikat maut dan pembantunya berkata kepada mereka. Makna ayat: Firman-Nya “mereka berkata” yaitu malaikat maut dan para pembantunya “Salamun ‘alaikum” memberi salam kepada mereka pada kondisi itu sebagai kabar gembira bagi mereka dengan ridha dari Rabb mereka dan kemuliaan kedekatan bersama-Nya. “masuklah ke dalam surga” dengan jiwa-jiwa mereka sekarang, dan dengan tubuh mereka kelak pada hari kiamat, Firman-Nya “karena apa yang telah kamu kerjakan.” Karena apa yang telah kalian kerjakan berupa ketaatan dan berlomba-lomba dalam kebaikan, setelah mereka mengamalkan amalan hati mereka berupa iman, yakin, mencintai karena Allah serta membenci karena-Nya ‘azza wa jalla, harap, dan tawakkal kepada-Nya. Ini adalah isi dari ayat (31,32),"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 32: Maksudnya: wafat dalam keadaan bersih dari kekafiran atau dapat juga berarti mereka mati dalam keadaan senang karena ada berita gembira dari malaikat bahwa mereka akan masuk surga. Hal ini menunjukkan bahwa mereka menjaga ketakwaan itu sampai akhir hayat. Ketika maut datang kepada mereka. Artinya: selamat sejahtera bagimu dari segala musibah dan malapetaka. Dan di akhirat akan dikatakan kepada mereka seperti yang disebutkan dalam ayat di atas. Berupa iman dan amal saleh. Amal merupakan sebab mereka masuk surga dan selamat dari neraka, akan tetapi amal tersebut dilakukan mereka berkat rahmat Allah dan karunia-Nya; bukan karena usaha dan kemampuan mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 32",
    "description": "Mereka yang mendapat anugerah dari Allah berupa surga-surga adalah orang yang diwafatkan oleh para malaikat dalam keadaan berbuat baik. Di akhirat mereka, yakni para malaikat, mengatakan kepada mereka, sala'mun 'alaikum; keselamatan, kesejahteraan, dan kedamaian bagi kalian! masuklah ke dalam surga yang telah Allah siapkan untuk kamu karena apa yang telah kamu kerjakan berupa amal-amal baik di dunia. Setelah membandingkan azab bagi orang kafir dengan balasan pahala bagi orang yang bertakwa, Allah lalu menyusulinya dengan kembali membicarakan keadaan orang-orang kafir. Allah berfirman, tidak ada yang ditunggu oleh mereka, yakni orang kafir, selain datangnya para malaikat yang membawa azab kepada mereka atau mencabut nyawa mereka, atau datangnya perintah, ketentuan, dan ketetapan tuhanmu kepada mereka, wahai nabi Muhammad. Sama halnya dengan perlakuan buruk kaum musyrik kepadamu, demikianlah pula yang telah diperbuat oleh orang-orang kafir sebelum mereka kepada rasul mereka. Allah tidak menzalimi mereka karena Allah telah menjelaskan kepada mereka petunjuk menuju jalan kebaikan, justru merekalah yang selalu menzalimi diri mereka sendiri karena enggan menerima petunjuk itu."
  }
]