[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kaum musyrikin tidaklah menunggu-nunngu kecuali maliakat yang datang kepada mereka untuk mencabut ruh-ruh mereka dalam keadaaan mereka kfir, atau ketetapan Allah yang datang dengan membawa siksaan yang disegerakan yang membinasakan mereka. Sebagaimana mereka telah mendustakan orang-orang kafir sebelumnya juga telah mendustakan, lalu Allah membinasaakn mereka. Dan tidaklah Allah menzhalimi mereka saat membinsakaan mereka dan menimpakan siksaan pada mereka, akan tetapi merekalah yang menzhalimi diri mereka sendiri dengan perbuatan yang menjadikan mereka pantas dikenai siksaan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "33. Orang-orang musyrikin yang mendustakan itu tidak menunggu kecuali kedatangan Malaikat maut dan para asistennya untuk mencabut nyawa mereka dan memukul wajah dan punggung mereka, atau datang kepada mereka keputusan azab Allah yang memberangus mereka di dunia. Perbuatan yang dilakukan oleh orang-orang musyrikin di Makkah sama dengan perbuatan yang dilakukan oleh orang-orang musyrikin sebelum mereka, maka Allah membinasakan mereka, Allah tidak menzalimi mereka manakala Dia membinasakan mereka, akan tetapi mereka yang menzalimi diri mereka sendiri dengan menjerumuskan diri ke dalam lubang kebinasaan berupa kekufuran kepada Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "33-34. Alah mengingkari orang-orang musyrik atas kebebalan mereka di dalam kebatilan: “Tidak ada yang menunggu mereka kecuali dua perkara; datangnya malaikat untuk mencabut nyawa mereka atau datangnya ketetapan Allah berupa azab yang disegerakan. Demikianlah kekafiran yang dilakukan oleh umat-umat sebelum mereka. Allah tidak menzalimi mereka dengan kebinasaan yang ditetapkan bagi mereka, akan tetapi mereka menzalimi diri mereka sendiri dengan kesyirikan dan kemaksiatan, sehingga mereka ditimpa balasan atas perbuatan tersebut dan dikepung oleh azab yang pedih yang selalu mereka hina dan mereka ingkari kedatangannya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "33. هَلْ يَنظُرُونَ (Tidak ada yang ditunggu-tunggu orang kafir) Yakni tidaklah mereka menunggu dalam mempercayai kenabianmu. إِلَّآ أَن تَأْتِيَهُمُ الْمَلٰٓئِكَةُ (selain dari datangnya para malaikat kepada mereka) Yang memberi kesaksian atas hal itu. أَوْ يَأْتِىَ أَمْرُ رَبِّكَ ۚ (atau datangnya perintah Tuhanmu) Dengan azab yang ditimpakan kepada mereka yang dapat membinasakan mereka semua. كَذٰلِكَ فَعَلَ الَّذِينَ مِن قَبْلِهِمْ ۚ( Demikianlah yang telah diperbuat oleh orang-orang (kafir) sebelum mereka) Yakni terus-menerus dalam kekafiran, pendustaan, dan ejekan sampai datang azab Allah hingga mereka semua binasa. وَمَا ظَلَمَهُمُ اللهُ(Dan Allah tidak menganiaya mereka) Karena telah membinasakan mereka dengan azab, namun azab tersebut menimpa mereka karena mereka berhak mendapatkannya disebabkan kekafiran mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "33. Tidak ada yang ditunggu-tunggu oleh orang kafir selain datangnya para malaikat maut kepada mereka atau datangnya perintah Tuhanmu untuk mencabut ruh mereka. Atau mendatangkan azab di dunia yang mereka minta atau azab ketika hari kiamat. Demikianlah yang telah diperbuat oleh orang-orang kafir sebelum mereka. Dan Allah tidak menganiaya mereka, akan tetapi merekalah yang selalu menganiaya diri mereka sendiri dengan kekafiran dan kemaksiatan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Adakah yang mereka tunggu} yang mereka tunggu {selain kedatangan para malaikat kepada mereka atau perintah Tuhanmu} azab Allah yang menumbangkan mereka di dunia {Demikianlah orang-orang sebelum mereka berbuat. Allah tidak menzalimi mereka, tetapi mereka yang menzalimi diri sendiri"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "33. Allah berkata “tidaklah mereka (yang didatangi oleh ayat ayat, namun mereka tidak beriman dan telah diingiatkan, namun tidak sudi mengambil pelajaran) menunggu, ”selain dari datangnya para malaikat kepada mereka” untuk mencabut nyawa nyawa mereka ”atau datangnya perintah Rabbmu” dengan membawa siksa yang akan menghampiri mereka. Sesungguhnya mereka sudah pantas untuk diberi siksa. ”demikianlah yang telah diperbuat oleh orang orang (kafir) sebelum mereka” mereka mendustakan dan mengingkari. Lantas tidak sudi beriman sampai siksaan turun menerjang mereka, ”dan Allah tidak menganiaya mereka” ketika menimpakan siksaan pada mereka “akan tetapi merekalah yang selalu menganiaya diri mereka sendiri” karena mereka itu diciptakan untuk misi beribadah kepada Allah, agar tempat kembalinya di tempat kemuliaan Allah. Mereka telah berbuat aniaya kepada jiwa jiwa mereka, mengesampingkan tujuan penciptaannya dan menyodorkannya dibawah ancaman kehinaan yang abadi dan kesengsaraan yang selalu membuntuti."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 33: Yang telah datang kepada mereka ayat-ayat, namun mereka tidak beriman, dan telah diperingatkan, namun tidak sadar. Yakni untuk mencabut nyawa mereka. Yakni kedatangan azab dari Allah untuk memusnahkan mereka atau kedatangan kiamat, karena sesungguhnya mereka telah berhak menerimanya. Mereka mendustakan rasul-rasul, lalu dibinasakan. Ketika mengazab mereka. Dengan kekafiran, padahal mereka tidaklah diciptakan kecuali untuk beribadah kepada-Nya agar mereka mendapatkan kenikmatan yang sempurna di akhirat. Mereka menzalimi diri mereka dan meninggalkan sesuatu yang karenanya mereka diciptakan serta menjatuhkan dirinya kepada kehinaan yang kekal dan kesengsaraan selamanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 33",
    "description": "Setelah membandingkan azab bagi orang kafir dengan balasan pahala bagi orang yang bertakwa, Allah lalu menyusulinya dengan kembali membicarakan keadaan orang-orang kafir. Allah berfirman, tidak ada yang ditunggu oleh mereka, yakni orang kafir, selain datangnya para malaikat yang membawa azab kepada mereka atau mencabut nyawa mereka, atau datangnya perintah, ketentuan, dan ketetapan tuhanmu kepada mereka, wahai nabi Muhammad. Sama halnya dengan perlakuan buruk kaum musyrik kepadamu, demikianlah pula yang telah diperbuat oleh orang-orang kafir sebelum mereka kepada rasul mereka. Allah tidak menzalimi mereka karena Allah telah menjelaskan kepada mereka petunjuk menuju jalan kebaikan, justru merekalah yang selalu menzalimi diri mereka sendiri karena enggan menerima petunjuk itu. Karena keengganan mereka itulah maka wajar bila mereka ditimpa azab sebagai balasan atas perbuatan mereka dan diliputi oleh azab yang tidak mungkin mereka hindari sebagai akibat dari apa yang dulu selalu mereka perolok-olokkan."
  }
]