[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang Musyrik berkata, “Sekiranya Allah menghendaki kami hanya menyembahNya saja, pastilah kami tidak menyembah siapapun selainNya, baik kami maupun bapak-bapak kami sebelumnya, dan kami tidak pula mengharamkan sesuatu yang tidak diharamkanNya.” Dengan dalih batil seperti ini, orang-orang kafir terdahulu membela diri, sedangkan mereka adalah orang-orang yang berbohong. Sebab sesungguhnya Allah telah memerintahkan mereka dan melarang mereka, serta memberikan kepada mereka kemampuan untuk melaksanakan kewajiban yang di bebankanya kepada mereka, dan mengadakan bagi mereka kekuatan dan kehendak yang menjadi pangkal perbuatan-perbuatan mereka. Maka pembelaan diri mereka dengan menggunakan Qadha dan Qada, adalah usaha yang paling batil setelah adanya peringatan para Rasul kepada mereka. Tidaklah ada kewajidan atas rasul-rasul yang memperingatkan mereka kecuali hanya menyampaikan dengan jelas apa yang di bebankan terhadap mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "35. Orang-orang yang menyandingkan selain Allah dengan Allah dalam ibadah berkata, “Seandainya Allah berkehendak agar kami menyembah-Nya semata dan tidak menyekutukan-Nya dengan sesuatu selain-Nya niscaya kami tidak menyembah selain-Nya bersama-Nya, tidaklah kami dan tidak pula nenek moyang kami sebelum kami. Seandainya Allah berkehendak agar kami tidak mengharamkan sesuatu niscaya kami tidak mengharamkannya.” hujah batil ini diucapkan oleh orang-orang kafir terdahulu. Tugas para Rasul hanya menyampaikan dengan jelas risalah yang mereka diperintahkan agar menyampaikannya. Tidak ada hujah bagi orang-orang kafir dalam beralasan dengan takdir sesudah Allah memberi mereka kehendak dan keinginan di samping telah mengutus para Rasul kepada mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "35. Orang-orang musyrik beralasan dengan takdir dan ketetapan Allah atas kesyirikan yang mereka lakukan, dan mereka mengatakan, seandainya Allah menghendaki niscaya mereka tidak akan menyekutukan-Nya dan tidak mengharamkan hewan-hewan yang Allah halalkan bagi mereka. Ini merupakan alasan yang batil, karena seandainya alasan itu benar niscaya Allah tidak akan menyiksa orang-orang terdahulu yang menyekutukan-Nya, akan tetapi Allah telah menyiksa mereka. Seandainya Allah memang menghendaki kesyirikan mereka, niscaya Allah tidak akan menyiksa mereka. Dan kewajiban seorang rasul hanya menyampaikan dakwah dengan penuh hikmah dan kebijaksanaan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "35. وَقَالَ الَّذِينَ أَشْرَكُوا۟ (Dan berkatalah orang-orang musyrik) Dari penduduk Makkah. لَوْ شَآءَ اللهُ مَا عَبَدْنَا مِن دُونِهِۦ مِن شَىْءٍ(Jika Allah menghendaki, niscaya kami tidak akan menyembah sesuatu apapun selain Dia) Yakni seandainya Allah menghendaki kami tidak menyembah selain-Nya niscaya kami tidak akan menyembah sekutu tersebut. نَّحْنُ وَلَآ ءَابَآؤُنَا(baik kami maupun bapak-bapak kami) Yakni nenek moyang kami yang berada dalam kesyirikan seperti kami sekarang ini. وَلَا حَرَّمْنَا مِن دُونِهِۦ مِن شَىْءٍ ۚ( dan tidak pula kami mengharamkan sesuatupun tanpa (izin)-Nya”) Baik itu mengharamkan Saibah, Bahirah, atau yang lainnya. Mereka berdalil dengan kesyirikan dan pengharaman yang mereka lakukan sebagai bukti keridhaan Allah kepada perbuatan tersebut. Padahal Allah tidak meridhai kekafiran dan kedustaan terhadap-Nya. كَذٰلِكَ فَعَلَ الَّذِينَ مِن قَبْلِهِمْ ۚ( Demikianlah yang diperbuat orang-orang sebelum mereka) Yakni orang-orang dari golongan-golongan orang kafir. Mereka menyekutukan Allah dan mengharamkan sesuatu yang tidak diharamkan Allah, serta membantah dan menghina para rasul. فَهَلْ عَلَى الرُّسُلِ إِلَّا الْبَلٰغُ (maka tidak ada kewajiban atas para rasul, selain dari menyampaikan) Adapun perhitungan mereka adalah urusan Allah dan bukan urusan para rasul."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Al-haq hakikatnya telah kuat dengan sendirnya; oleh karena itu jika seorang da'i yang bijaksana menyampaikan kebenaran itu pada porsinya; sesungguhnya ia telah menang walaupun dengan sebatas kata, karena tabligh sesungguhnya hal utama yang menjadi tugas para nabi dan Rasul : { فَهَلْ عَلَى الرُّسُلِ إِلَّا الْبَلَاغُ الْمُبِينُ } \"maka tidak ada kewajiban atas para rasul, selain dari menyampaikan (amanat Allah) dengan terang\" maka tidaklah bagian dari kebaikan seseorang merendahkan kekuatan kata yang mengajak kepada kebaikan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "35. Orang-orang musyrik Makkah dengan maksud mengolok-olok dan mengingkari kenabian dan tugas Nabi berkata: “Jika Allah menghendaki, niscaya kami tidak akan menyembah sesuatu apapun selain Dia berupa berhala, baik kami maupun bapak-bapak kami. Tidak pula kami mengharamkan sesuatupun berupa hewan ternak tanpa izin-Nya”. Itu semua adalah atas izin Allah, dan Allah meridhoi itu. Maka Allah menjawab: “Demikianlah yang diperbuat orang-orang sebelum mereka; maka tidak ada kewajiban atas para rasul, selain dari menyampaikan amanat Allah dengan terang, bukan untuk memberi hidayah kepada mereka.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang musyrik berkata,“Seandainya Allah menghendaki, niscaya kami dan nenek moyang kami tidak akan menyembah sesuatu apa pun selain Dia dan tidak mengharamkan sesuatu pun tanpa (ketetapan)-Nya” Demikianlah} seperti itulah dusta dan ejekan {orang-orang sebelum mereka berbuat. Bukankah kewajiban para rasul hanya menyampaikan dengan jelas"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "35. kaum musyrikin membela diri atas tindakan syirik mereka dengan (dalih) masyi’atullah (kehendak Allah) bahwa, sekiranya Allah tidak menghendaki, niscaya mereka tidak akan berbuat syirik dan tidak mengharamkan sesuatu apa pun dari binatang binatang ternak yang Allah halalkan. Seperti mengharamkan bahirah, washilah, ham dan binatang lain bukan karena Allah. Ini merupakan argumentasi yang batil. Sekiranya pembelaan jenis ini tepat, niscaya Allah tidak akan menghukum orang orang sebelum mereka yang telah menyekutukan suatu obyek denganNya. Allah menghukum mereka dengan siksa yang sangat berat. Seandainya Allah menyukai praktik itu, maka Dia tidak menyiksa mereka. Tidaklah maksud mereka dengan ungkapan itu melainkan untuk menampik kebenaran yang dibawa oleh para rasul. Kalau tidak untuk tujuan demikian, sebetulnya mereka itu mengetahui bahwa tidak ada hujjah (pembelaan diri) bagi mereka untuk menggugat Allah. Allah sudah memerintahkan dan melarang mereka, serta memudahkan mereka untuk menjalankan beban yang mesti mereka pikul. Dia telah menciptakan kekuatan dan kehendak bagi mereka yang menjadi sumber perbuatan mereka. Gugatan mereka dengan menggunakan (dalih) ketentuan qadha dan qadar adalah termasuk kebatilan yang fatal. Demikianlah, dengan inderanya, setiap orang mengetahui kemampuan orang lain untuk mengerjakan sebuah perbuatan yang ia inginkan tanpa ada pihak yang menghambatnya. Maka mereka telah menggabungkan antara sikap pendustaan kepada Allah dan pendustaan terhadap rasul dan pendustaan terhadap perkara perkara yang dapat dicerna oleh akal dan indera. “maka tidaklah kewajiban atas para rasul, melainkan menympaikan (amanat Allah) dengan terang” yaitu yang jelas lagi tampak yang sampai menembus ke dalam hati, dan yang tidak menyisakan alasan bagi seseorang di hadapan Allah. Apabila para rasul telah menyampaikan kepada mereka perintah dan larangan yang berasal dari Rabb mereka, sementara mereka mengelak di hadapan para rasul dengan argumentasi bahwa takdir telah tertuliskan, maka tidak ada wewenang bagi para rasul sedikitpun. perhitungan tentang mereka di sisi Allah."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (وَقَالَ ٱلَّذِينَ أَشۡرَكُواْ) wa qaalal ladziina asyrakuu : “dan berkata orang-orang yang berbuat syirik” mereka adalah kaum kafir dan musyrik Quraisy (وَلَا حَرَّمۡنَا مِن دُونِهِۦ مِن شَيۡءٖۚ) wa laa harramnaa min duunihii min syaii` : “dan tidak pula kami mengharamkan sesuatu tanpa izin-Nya.” Seperti S¬¬aibah, Bahirah, Washilah, dan Ham. (فَهَلۡ عَلَى ٱلرُّسُلِ إِلَّا ٱلۡبَلَٰغُ ٱلۡمُبِينُ) fahal ‘alar rusuli illal balaaghul mubiin : “Bukankah kewajiban para rasul hanya menyampaikan dengan jelas.” Kata tanya di sini adalah untuk peniadaan. Makna ayat: Pembahasan ayat masih seputar penegakkan hujjah kepada kaum musyrikin Quraisy, Allah ta’ala berfirman mengabarkan perihal mereka “dan orang musyrik berkata” mereka yang menjadikan sesembahan selain Allah berupa berhala-berhala, seperti Hubal, Latta, dan Uzza, dan mereka berkata, “Jika Allah berkehendak kami tidak berbuat syirik, pasti kami dan nenek moyang kami tidak akan melakukannya, dan tidak pula kami mengharamkan sesuatu tanpa pengharaman dari-Nya. Namun, apakah mereka mengatakan ini karena keimanan kepada kehendak Allah ta’ala? Atau mereka mengatakannya sebagai ejekan dan sindiran, serta sebagai pembelaan atas kesyirikan mereka dan agama mereka yang batil tentang pengharaman dan penghalalan sesuai hawa nafsu, dan kedua perkara ini bisa menjadi kemungkinan. Kemudian Allah membantah mereka dengan dua perkara, yang pertama: selama Allah melarang mereka dari berbuat syirik dan membuat-buat syariat, maka ini adalah bukti terbesar bahwa Allah melarang dan mengharamkan syirik serta pantangan-pantangan yang mereka buat, seperti: Saibah, Bahirah, dan selainnya, lalu yang kedua, Allah belum mengazab mereka bukan tanda bahwa Allah ridha dengan perkara tersebut, dengan alasan bahwa umat dan bangsa yang kafir sebelumnya juga melakukan apa yang mereka lakukan untuk membela kebatilan mereka, mereka terus seperti itu hingga Allah mengazab mereka. Ini adalah bukti terkuat bahwa Allah tidak ridha dengan kesyirikan dan aturan mereka, sebagaimana firman-Nya pada surat Al-An’am membantah kerancuan yang mereka buat, begitulah yang dikatakan oleh orang-orang sebelum mereka sampai mereka marasakan azab Kami, karena mereka mendustakan rasul-rasul Kami dan berdusta atas nama Kami. Firman-Nya “Demikianlah yang dieprbuat oleh orang sebelum mereka.” dari umat-umat terdahulu yang mengatakan perkataan mereka kepada rasul-rasul, dan melakukan apa yang mereka lakukan, hingga Allah mengazab mereka. Firman-Nya “Bukankah kewajiban para rasul hanya menyampaikan dengan jelas.” Para rasul tidak diperintahkan untuk memaksa orang yang musyrik untuk meninggalkan kesyirikannya atau melaksanakan syariat, akan tetapi menyampaikan perintah Allah ta’ala serta larangan-Nya, tidak lebih. Oleh karena itu, ini merupakan hiburan bagi Rasulullah shalallahu ‘alaihi wa sallam serta penguat kesabarannya agar tetap menyampaikan dakwah Rabbnya, hingga datang perolongan-Nya atas musuh beliau. Ini adalah isi dari ayat pertama (ayat 35). Pelajaran dari ayat: • Bantahan terhadap kerancuan kaum musyrikin dalam berargumen menggunakan kehendak Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 35: Orang-orang musyrik beralasan terhadap perbuatan syirk mereka dengan kehendak Allah, yakni jika Allah menghendaki tentu mereka tidak akan berbuat syirk serta tidak mengharamkan sesuatu yang dihalalkan-Nya, seperti bahiirah, washilah, ham, dsb. (lihat Al Maa’idah: 103). Ini adalah alasan yang batil. Hal itu, karena jika alasan ini benar, tentu Allah tidak akan menyiksa orang-orang sebelum mereka yang telah berbuat syirk. Bahkan maksud mereka dengan mengatakan hal itu tidak lain untuk menolak kebenaran yang dibawa para rasul. Karena jika tidak demikian, sesungguhnya mereka mengetahui bahwa mereka tidak memiliki alasan di hadapan Allah. Bukankah Allah telah memerintah dan melarang mereka? Membuat mereka mampu memikul yang dibebankan kepada mereka, memberikan kepada mereka kemampuan dan kehendak yang daripadanya muncul perbuatan mereka. Oleh karena itu, alasan mereka dengan taqdir ketika berbuat maksiat adalah alasan yang paling batil. Semua manusia merasakan, bahwa mereka dalam perbuatannya tidak dipaksa, karena Allah telah memberi mereka kemampuan dan kehendak. Jika seandainya perbuatan mereka dipaksa, maka tentu Allah tidak akan menghukum mereka. Oleh karena itu, pernyataan mereka bertentangan dengan dalil wahyu maupun dalil akal. Dan tidak ditugaskan memberi hidayah. Dengan demikian, tidak ada alasan sedikit pun bagi seseorang di hadapan Allah jika Dia mengazab mereka, karena Dia telah mengutus para rasul-Nya untuk mengingatkan mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 35",
    "description": "Dan betapa buruk ucapan orang musyrik itu. Mereka berkata, jika Allah menghendaki, niscaya kami tidak akan menyembah sesuatu apa pun selain dia. Baik kami maupun bapak-bapak kami tidak akan melakukan hal itu jika memang Allah menghendakinya. Dan jika Allah menghendaki, tidak pula kami akan mengharamkan sesuatu pun yang telah dihalalkan oleh-Nya tanpa izin dan kehendak-Nya. Ucapan, sikap, dan perbuatan kaum musyrik itu bukanlah hal baru, karena demikian pula-lah yang telah diperbuat oleh orang kafir sebelum mereka. Mereka selalu mencaricari alasan untuk menolak tuntunan Allah yang disampaikan oleh para rasul. Bukankah kewajiban para rasul itu hanya menyampaikan amanat dan tuntunan Allah dengan jelas kepada kaumnya'Allah menegaskan bahwa dia selalu mengirim utusan kepada setiap kaum untuk menjelaskan kebenaran. Allah berfirman, dan sungguh, kami telah mengutus seorang rasul untuk setiap umat sebelum kamu, wahai nabi Muhammad, untuk menuntun dan menyeru kaum masing-masing, 'sembahlah Allah dengan penuh taat dan patuh dan jangan kamu menyekutukan-Nya dengan apa pun. Jauhilah ta'gut, yakni perbuatan maksiat yang melampaui batas, sesuatu atau benda yang dijadikan sembahan, dan apa saja yang memalingkan kamu dari kebenaran. Kemudian di antara mereka yang menerima pesan itu ada yang diberi petunjuk oleh Allah sehingga mereka beriman dan taat, dan ada pula yang keras kepala dan tetap dalam kesesatan karena keingkaran dan kesombongan mereka. Maka untuk membuktikan apa yang telah Allah timpakan kepada mereka, berjalanlah kamu di bumi, wahai umat nabi Muhammad, dan perhatikanlah sekelilingmu serta renungkanlah bagaimana kesudahan orang yang mendustakan para rasul itu."
  }
]