[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sungguh kami telah mengutus di tengah setiap umat yang telah berlalu seorang rasul yang memerintahkan mereka untuk beribadah kepada Allah dan taat kepadaNya semata serta meninggalkan penyembahan kepada selainNya, seperti kepada setan-setan, patung-patung dan orang-orang mati dan lain sebagainya yang dijadikan sebagai penolong selain Allah. Maka diantara mereka terdapat orang yang diberi petunjuk oleh Allah sehingga dia mengikuti para rosul, dan diantara mereka terdapat juga para penentang keras yang mengikuti jalan menyimpang, sehingga jatuhlah ketetapan sesat padanya. Allah tidak memberikan taufik kepadanya. Maka berjalanlah di muka bumi dan saksikanlah dengan mata kepala kalian bagaimana angan-angan orang-orang yang mendustakan dan kehancuran yang menimpa mereka, agar kalian dapat mengambil pelajaran."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "36. Sungguh Kami telah mengutus pada setiap umat terdahulu seorang Rasul yang mengajak umatnya untuk menyembah Allah semata dan meninggalkan penyembahan kepada selain-Nya, berupa berhala, setan dan lainnya. Di antara mereka ada yang Allah beri taufik lalu dia beriman kepada-Nya, mengikuti apa yang dibawa oleh Rasul-Nya. Di antara mereka ada yang kafir kepada Allah, mendurhakai Rasul-Nya maka Allah tidak memberinya taufik lalu ia pun tersesat. Maka berjalanlah di muka bumi agar kalian melihat dengan mata kepala kalian bagaimana akibat orang-orang yang mendustakan sesudah mereka ditimpa hukuman dan azab."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "36. Sungguh kami telah mengutus seorang rasul kepada setiap umat untuk mengajak menyembah Allah Semata dan memberi peringatan dari penyembahan berhala-berhala dan godaan setan. Kemudian manusia terbagi menjadi dua golongan; sebagian mereka Allah beri petunjuk sehingga mereka mengikuti para rasul, dan sebagian mereka mengikuti jalan kesesatan sehingga mereka layak tersesat dan hidup menderita. Berjalanlah di atas muka bumi dengan penuh penghayatan, dan lihatlah kesudahan orang-orang terdahulu yang mendustakan para rasul."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "36. وَلَقَدْ بَعَثْنَا فِى كُلِّ أُمَّةٍ رَّسُولًا (Dan sungguhnya Kami telah mengutus rasul pada tiap-tiap umat) Untuk menegakkan hujjah atas mereka. أَنِ اعْبُدُوا۟ اللهَ وَاجْتَنِبُوا۟ الطّٰغُوتَ ۖ( Sembahlah Allah (saja), dan jauhilah Thaghut itu) Yakni tinggalkanlah seluruh sesembahan selain Allah seperti setan, dukun, berhala, serta semua orang yang mengajak kepada kesesatan. فَمِنْهُم(maka di antara umat itu) Yakni diantara umat-umat yang Allah utus kepada mereka para Rasul. مَّنْ هَدَى اللهُ(ada orang-orang yang diberi petunjuk oleh Allah) Yakni Allah beri mereka petunjuk kepada agama dan tauhid serta Allah jauhkan dari thaghut. وَمِنْهُم مَّنْ حَقَّتْ عَلَيْهِ الضَّلٰلَةُ ۚ( dan ada pula di antaranya orang-orang yang telah pasti kesesatan baginya) Yakni layak untuk tersesat, karena mereka bersikeras diatas kekafiran dan kedurhakaan. Padahal kewajiban mereka adalah mentaati perintah Allah dan menerima seruan-Nya, dan bukan malah membantah hujjah yang telah disebutkan tadi. Allah memerintahkan seluruh hamba-Nya untuk beriman, namun tidak semuanya dikehendaki Allah untuk mendapat hidayah, sebab seandainya Allah menghendakinya niscaya seluruh hamba-Nya tidak akan ada yang kafir. فَسِيرُوا۟ فِى الْأَرْضِ(Maka berjalanlah kamu dimuka bumi) Dengan tujuan mengambil pelajaran. فَانظُرُوا۟ كَيْفَ كَانَ عٰقِبَةُ الْمُكَذِّبِينَ (dan perhatikanlah bagaimana kesudahan orang-orang yang mendustakan) Dari umat-umat terdahulu, ketika kalian menyaksikan sisa-sisa peradaban mereka seperti kaum ‘Aad dan Tsamud, kesudahan mereka adalah peradaban yang hancur setelah kebinasaan diri mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "36. Sungguhnya Kami telah mengutus rasul pada tiap-tiap umat untuk menyerukan: “Sembahlah Allah saja, dan jauhilah Thaghut itu yaitu segala yang disembah selain Allah, seperti setan dan lain-lain yang mengajak pada kesesatan”, Maka di antara umat manusia ada orang-orang yang diberi petunjuk oleh Allah dan ada pula yang telah ditetapkan menjadi sesat. Sehingga mereka tidak beriman tanpa ada yang mampu mencegah, dan menjadi orang-orang yang kafir dan membangkang. Maka berjalanlah dimuka bumi dan perhatikanlah bagaimana kesudahan orang-orang yang mendustakan rasul-rasul yaitu kaum Tsamud, kaum Luth dan penduduk Madyan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh Kami telah mengutus seorang rasul kepada setiap umat (untuk menyeru)“Sembahlah Allah dan jauhilah tagut”} tinggalkanlah menyembah setiap sesembahan selain Dia {Di antara mereka ada yang diberi petunjuk oleh Allah dan ada pula yang ditetapkan} ditetapkan {dalam kesesatan. Maka berjalanlah di bumi dan perhatikanlah bagaimana kesudahan} akhir {para pendusta"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "36. Allah memberitahukan bahwa hujjahNya telah tegak di hadapan seluruh umat manusia, dan bahwa tidaklah ada sebuah umat yang telah berlalu atau datang belakangan, melainkan Allah pasti telah mengutus seorang rasul di tengah mereka. mereka semua sepakat pada satu dakwah dan satu ajaran, yaitu beribadah kepada Allah semata, tiada sekutu bagiNya. ”sembahlah Allah (saja) dan jauhilah thagut itu”. maka umat manusia terbagi bagi berdasarkan sambutan baiknya kepada para rasul atau tidak menjadi dua golongan; ”maka diantara umat itu ada orang orang yang diberi petunjuk oleh Allah” mereka mengikuti para utusan Allah dalam aspek ilmu dan amalan ”dan ada pula diantaranya orang orang yang telah pasti kesesatan baginya,” lalu dia menelusuri jalan kesesatan ”maka berjalanlah kamu dimuka bumi” dengan raga dan hati kalian ”dan perhatikanlah bagaimana kesudahan orang orang yang mendustakan (rasul rasul)” karena kalian bakal menyaksikan keanehan keanehan. Tidaklah engkau jumpai orang yang mendustakan (rasul) melainkan pasti kesudahannya adalah kebinasaan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (وَٱجۡتَنِبُواْ ٱلطَّٰغُوتَۖ) waj tanibuth thaaghuut : “dan jauhilah thagut” yaitu menyembah patung dan berhala. (حَقَّتۡ عَلَيۡهِ ٱلضَّلَٰلَةُۚ) haqqat ‘alaihidh dhalaalah : “tetap dalam kesesatan.” telah ditetapkan melalui ilmu Allah yang azali. Makna ayat: Firman-Nya pada ayat yang kedua (36) : “Dan sungguh, Kami telah mengutus seorang rasul untuk setiap umat untuk menyerukan, “Sembahlah Allah, dan jauhilah Thaghut.” Allah ta’ala mengabarkan tidak suatu umat melainkan telah diutus seorang rasul kepada mereka sebagai petunjuk dan penerang jalan keselamatan, serta pemberi peringatan dari jalan-jalan kesesatan dan kehancuran. Disebutkan juga persamaan dakwah para rasul, yaitu “laa ilaaha illaah” yang ditafsirkan: hanya beribadah kepada Allah dan menjauhi Thaghut. Dan seruan ini ajakan setan agar manusia menyembahnya dengan membuat indah perkara syirik melalui wali-walinya dari kalangan manusia atau yang lain. Firman-Nya “Maka di antara mereka” yaitu umat-umat yang telah diutus kepada mereka “ada orang-orang yang diberi petunjuk oleh Allah” maka dia mengetahui, mempercayainya, mengamalkannya, maka ia selamat dan bahagia. “dan ada pula yang tetap dalam kesesatan.” Yaitu telah ditulis dalam kitab takdir, karena dia terus menerus di atas kesesatan, membelanya, serta mempertahankannya dengan pilihan dan kebebasannya, maka Allah mengharamkannya dari taufiq sehingga dia sesat tidak ada lagi harapan untuk mendapat petunjuk. Firman-Nya “Maka berjalanlah kamu di bumi dan perhatikanlah bagaimana kesudahan orang yang mendustakan rasul-rasul.” Perintah kepada kafir Quraisy yang berdebat dengan kebatilan, orang-orang yang berhujjah dengan kesyirikan dan syariat mereka yang batil, perintah agar mereka melakukan perjalanan di bumi ke arah utara dan selatan, lalu melihat bagaimana akhir dari orang-orang yang mendustakan para rasul seperti mereka seperti: ‘Ad yang ada di utara dan Tsamud di selatan, Madyan, Kaum Luth, dan Fir’aun di barat. Pelajaran dari ayat: • Penjelasan makna Laa ilaaha illaah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 36: Allah Ta’ala memberitahukan bahwa hujjah-Nya telah ditegakkan kepada semua umat dengan mengutus kepada setiap umat seorang rasul yang menyerukan untuk beribadah kepada Allah dan menjauhi sesembahan selain Allah. Terhadap seruan rasul tersebut, manusia terbagi menjadi dua golongan; ada yang mengikuti para rasul baik dalam hal ilmu maupun amal, dan ada pula yang tidak mengikutinya, dan inilah orang yang disesatkan Allah ‘Azza wa Jalla. Thaghut adalah setan dan apa saja yang disembah selain Allah Subhaanahu wa Ta'aala. Kamu tidak menemukan seorang pun yang mendustakan rasul kecuali akhir kehidupannya dengan dibinasakan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 36",
    "description": "Allah menegaskan bahwa dia selalu mengirim utusan kepada setiap kaum untuk menjelaskan kebenaran. Allah berfirman, dan sungguh, kami telah mengutus seorang rasul untuk setiap umat sebelum kamu, wahai nabi Muhammad, untuk menuntun dan menyeru kaum masing-masing, 'sembahlah Allah dengan penuh taat dan patuh dan jangan kamu menyekutukan-Nya dengan apa pun. Jauhilah ta'gut, yakni perbuatan maksiat yang melampaui batas, sesuatu atau benda yang dijadikan sembahan, dan apa saja yang memalingkan kamu dari kebenaran. Kemudian di antara mereka yang menerima pesan itu ada yang diberi petunjuk oleh Allah sehingga mereka beriman dan taat, dan ada pula yang keras kepala dan tetap dalam kesesatan karena keingkaran dan kesombongan mereka. Maka untuk membuktikan apa yang telah Allah timpakan kepada mereka, berjalanlah kamu di bumi, wahai umat nabi Muhammad, dan perhatikanlah sekelilingmu serta renungkanlah bagaimana kesudahan orang yang mendustakan para rasul itu. Nabi Muhammad sangat berharap kaum kafir mendapat petunjuk. Allah lalu menegaskan, jika engkau berusaha sekuat tenaga dan sangat mengharapkan agar mereka mendapat petunjuk, maka itu tidak akan berhasil karena sesungguhnya Allah tidak akan memberi petunjuk kepada orang yang disesatkan-Nya, yakni dibiarkan sesat karena lebih memilih jalan kesesatan itu, dan mereka tidak mempunyai penolong yang dapat menyelamatkan mereka. (lihat: surah al-qashash/28: 56)."
  }
]