[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Jika kamu (wahai Rasul) mengerahkan usaha dengan habis-habisan untuk menuntun orang-orang yang musyrik menuju hidayah, maka ketahuilah bahwa sesungguhnya Allah tidak memberikan petunjuk pada orang yang sesat, dan mereka sekali-kali tidak mempunyai penolong selain Allah yang akan meolong mereka dan menolak siksaan dari mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "37. Jika kamu -wahai Rasul- bersungguh-sungguh dengan segenap kemampuanmu mendakwahi mereka dan berusaha keras untuk memberi mereka hidayah dan melakukan sebab-sebabnya, maka sesungguhnya Allah tidak membimbing kepada hidayah siapa yang Allah sesatkan, mereka tidak mempunyai satu pun yang menolong dan menepis azab dari mereka selain Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "37. Hai Rasulallah, Jika kamu sangat menginginkan petunjuk bagi orang-orang musyrik dan mengerahkan seluruh upayamu, maka ketahuilah bahwa Allah tidak akan memberi petunjuk kepada orang yang lebih memilih kesesatan, dan tidak ada yang dapat menolong mereka dari azab Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "37. إِن تَحْرِصْ عَلَىٰ هُدَىٰهُمْ (Jika kamu sangat mengharapkan agar mereka dapat petunjuk) Kamu sangat berusaha untuk itu. فَإِنَّ اللهَ لَا يَهْدِى مَن يُضِلُّ ۖ (maka sesungguhnya Allah tiada memberi petunjuk kepada orang yang disesatkan-Nya) Yakni Allah tidak memberi petunjuk bagi orang yang disesatkan-Nya dan telah ditetapkan baginya kesesatan. وَمَا لَهُم مِّن نّٰصِرِين(dan sekali-kali mereka tiada mempunyai penolong) Yang dapat membantu orang yang telah disesatkan Allah, untuk mendapatkan petunjuk. Atau menolong mereka dengan menghindarkan azab agar tidak menimpa mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "37. Jika kamu sangat mengharapkan agar mereka orang-orang musyrik mendapat petunjuk, maka sesungguhnya Allah tidak memberi petunjuk kepada orang yang telah disesatkan-Nya, dan sekali-kali mereka tidak mempunyai penolong dari azab."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika kamu berusaha keras untuk memberi mereka petunjuk, maka sesungguhnya Allah tidak akan memberi petunjuk kepada orang yang telah Dia sesatkan dan mereka tidak mempunyai penolong"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "37. “jika kamu sangat mengharapkan agar mereka mendapat petunjuk” dan kamu mengerahkan kemapuanmu dalam usaha itu “maka sesungguhnya Allah tidak memberi petunjuk kepada orang yang disesatkanNYa” meskipun rasul telaah melakukan berbagai usaha sebab (kausalitas) tidak ada yang memberinya petunjuk kecuali Allah. ”dan sekali kali mereka tiada mempunyai penolong”yang akan mengentaskan mereka dari azab Allah dan melindungi mereka dari sisiNya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat: Firman-Nya kepada Rasul-Nya sebagai hiburan dan meringankan kesedihannya “Jika engkau sangat mengharapkan” wahai Rasul Kami “agar mereka mendapat hidayah” petunjuk menuju kebenaran “Allah tidak akan memberi petunjuk kepada orang yang disesatkan-Nya.” Maka tenangkanlah jiwamu, dan janganlah bersedih, dan berdakwahlah menuju jalan Rabbmu tanpa memaksakan diri. Firman-Nya “tidak akan memberi petunjuk kepada orang yang disesatkan-Nya.” Tidak ada seorang pun yang mampu memberikan hidayah kepada orang yang telah Allah sesatkan, karena Allah ta’ala menyesatkan seseorang berdasarkan sunnah-sunnah-Nya yang tidak dapat diganti atau diubah karena kekuatan kekuasaan-Nya dan keluasan Ilmu-Nya. Firman-Nya “dan mereka tidak mempunyai penolong.” Tidak ada bagi mereka—orang-orang yang telah Allah sesatkan berdasarkan ilmu-Nya—penolong yang dapat menyelamatkan mereka dari azab yang akan datang kepada mereka serta kerugian ada dihadapan mereka. Pelajaran dari ayat: • Peringatan untuk tidak menyengaja terjun, mencari, dan bersemangat dalam kesesatan. Karena barangsiapa yang sesat, lalu Allah sesatkan, maka hidayah sudah tidak dapat diharapkan lagi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 37: Padahal Allah telah menyesatkan mereka, maka sesungguhnya engkau tidak akan sanggup. Dari azab Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 37",
    "description": "Nabi Muhammad sangat berharap kaum kafir mendapat petunjuk. Allah lalu menegaskan, jika engkau berusaha sekuat tenaga dan sangat mengharapkan agar mereka mendapat petunjuk, maka itu tidak akan berhasil karena sesungguhnya Allah tidak akan memberi petunjuk kepada orang yang disesatkan-Nya, yakni dibiarkan sesat karena lebih memilih jalan kesesatan itu, dan mereka tidak mempunyai penolong yang dapat menyelamatkan mereka. (lihat: surah al-qashash/28: 56)bukti-bukti keesaan Allah yang telah disaksikan oleh orang kafir tidak membuat mereka beriman kepada Allah dan hari kebangkitan. Dan mereka bersumpah dengan nama Allah dengan sumpah yang sungguhsungguh, Allah tidak akan membangkitkan orang yang mati. Tidak demikian halnya! Allah pasti akan membangkitkannya sebagai suatu janji yang benar dari-Nya. Dia pasti akan menepatinya, tetapi kebanyakan manusia tidak mengetahui."
  }
]