[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah akan membangkitkan semua hamba untuk menerangkan kepada mereka kebenaran perkara kebangkitan yang mereka perselisihkan. Kemudian orang-orang mukmin akan mengetahui bahwa mereka sesungguhnya berada diatas kebenaran, dan orang-orang kafir akan sadar dan bahwa sesungguhnya mereka berada di atas kebatilan dan sesungguhnya mereka telah berbohong ketika dahulu bersumpah soal tidak ada kebangkitan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "39. Allah membangkitkan mereka semuanya pada hari Kiamat untuk menjelaskan kepada mereka hakikat perkara yang mereka perselisihkan yaitu Tauhid, kebangkitan dan kenabian. Dan agar orang-orang kafir mengetahui bahwa mereka adalah orang-orang yang berdusta tentang pengakuan mereka bahwa Allah mempunyai sekutu-sekutu, dan pada pengingkaran mereka terhadap kebangkitan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "39. لِيُبَيِّنَ لَهُمُ (agar Allah menjelaskan kepada mereka) Yakni, tetapi Allah akan membangkitkan mereka untuk menjelaskan kepada mereka. الَّذِى يَخْتَلِفُونَ فِيهِ(apa yang mereka perselisihkan itu) Yakni perkara yang mereka perselisihkan. وَلِيَعْلَمَ الَّذِينَ كَفَرُوٓا۟( agar orang-orang kafir itu mengetahui) Yakni orang-orang kafir terhadap Allah dan mengingkari kebangkitan. أَنَّهُمْ كَانُوا۟ كٰذِبِينَ (bahwasanya mereka adalah orang-orang yang berdusta) Dalam keimanan mereka. Dan karena keingkaran mereka terhadap kebangkitan dengan berkata: لَا يَبْعَثُ اللهُ مَن يَمُوتُ ۚ “Allah tidak akan akan membangkitkan orang yang mati”, maka berarti mereka telah berdusta."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "39. Agar Allah menjelaskan kepada mereka apa yang mereka perselisihkan bersama orang mukmin itu berupa urusan agama, hari kebangkitan, pahala, hukuman, surga dan neraka. Juga agar orang-orang kafir yang mendustakan hari kebangkitan itu mengetahui bahwasanya mereka adalah orang-orang yang berdusta"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Supaya Dia menjelaskan} supaya Dia menunjukkan {kepada mereka apa yang mereka perselisihkan, dan supaya orang-orang yang ingkar mengetahui bahwa mereka adalah para pendusta"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "39-40. Kemudian Allah menyebutkan hikmah kenapa diadakan hari pembalasan dan hari kebangkitan. Allah berfirman “agar Allah menjelaskan kepada mereka apa yang mereka perselisihkan itu” berupa persoalan persoalan yang besar dan kecil. Allah menjelaskaan hakikat (kebenarannya) dan memaparkannya “dan agar orang orang kafir itu mengetahui bahwasannya mereka adalah orang orang yang berdusta” sampai akhirnya mereka menyaksikan amalan amalan mereka sebagai penyesalan bagi diri mereka. tuhan tuhan sesembahan mereka yang dahuu mereka seru (diibadahi) bersama dengan Allah tidaklah bermanfaat sama sekali ketika telah datang keputusan Rabbmu. Dan tatkala mereka menyaksikan sesembahan sesembahan mereka menjadi kayu bakar bagi neraka jahanam, saat matahari dan bulan digulung, dan bintang bintang berhamburan dan saat sesembahan itu telah jelas bahwa ia adalah hamba yang tunduk lagi membutuhkan bantuan Allah dalam setiap kondisi sementara hal itu bukan merupakan perkara yang sulit atau pelik bagi Allah maka di sisi yang lain, apabila DIa menghendaki sesuatu, niscaya Dia (cukup) berfirman ”jadilah, maka akan terjadi ’tanpa ada perlawanan atau pencegahan. Bahkan benar benar akan terjadi persis seperti yang diinginkan dan dikehendakiNya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (يَخۡتَلِفُونَ فِيهِ) yakhtalifuuna fiih : “apa yang mereka perselisihkan itu” berselisih dengan kaum mukminin dalam masalah tauhid dan syirik. (أَنَّهُمۡ كَانُواْ كَٰذِبِينَ) annahum kaanuu kaadzibiin : “bahwa mereka adalah orang yang dusta.” Yaitu mengenai perkataan mereka, “Kami tidak akan dibangkitkan setelah kematian.” Makna ayat: Maka Allah menunjukkan salah satu dari sebab-sebab tersebut pada Firman-Nya “agar Dia menjelaskan kepada mereka apa yang mereka perselisihkan itu,” kalau bukan karena hari kebangkitan, niscaya kebenaran dan kebatilan tidak akan dikenal di dunia ini, dan perselisihan ini akan terus ada di antara manusia, ini yang pertama. Yang kedua, “agar orang kafir itu mengetahui bahwa mereka adalah orang berdusta.” Dalam keyakinan, amalan, serta mengingkaran mereka terhadap kehidupan kedua untuk pembalasan amal yang telah dilakukan di dunia, adapun pengingkaran mereka terhadap kebangkitan maka itu disebabkan oleh beberapa hal, Allah ta’ala telah memberitahukan kepada mereka bahwa perkara ini bukan seperti yang kalian kira dan pikirkan, ia hanya tergantung kepada kehendak Kami atas hal tersebut."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 39: Di ayat ini, Allah Subhaanahu wa Ta'aala menerangkan hikmah dibangkitkan-Nya mereka. Dengan kaum mukmin tentang perkara agama (baik perkara besar seperti ‘aqidah, maupun perkara yang ringan, seperti masalah furu’/cabang). Pada hari itu, Allah Subhaanahu wa Ta'aala menerangkan yang benarnya. Dalam mengingkari kebangkitan. Mereka akan mengetahui kedustaan mereka saat mereka melihat amal mereka menjadi penyesalan bagi mereka, sesembahan yang mereka sembah ternyata tidak memberi mereka manfaat apa-apa, dan ketika mereka melihat apa yang mereka sembah menjadi bahan bakar api neraka, matahari dan bulan di gulung lalu dijatuhkan ke dalam neraka, demikian juga bintang-bintang, dan ketika itu jelaslah bagi penyembahnya bahwa semua itu adalah makhluk yang ditundukkan, dan bahwa semuanya butuh kepada Allah. Memenuhi semua kebutuhan mereka tidaklah sulit bagi Allah, bukankah apabila Dia berkehendak kepada sesuatu cukup mengatakan, “Jadilah!” Maka jadilah ia, tanpa ada yang menghalangi dan menolaknya, bahkan akan terjadi sesuai yang dikehendaki-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 39",
    "description": "Kedatangan hari kebangkitan dimaksudkan agar dia menjelaskan kepada mereka, yakni manusia, apa yang mereka perselisihkan itu, tentang berbagai hal, seperti keesaan Allah dan datangnya hari akhir, dan agar orang kafir itu mengetahui bahwa mereka adalah orang yang berdusta akibat mengingkari tuntunan Allah yang disampaikan oleh para rasul. Tidak sulit bagi Allah untuk melakukan apa saja yang dikehendakinya, tidak terkecuali membangkitkan manusia pada hari kiamat. Allah menyatakan, sesungguhnya firman kami terhadap sesuatu apabila kami menghendakinya terjadi, kami hanya mengatakan kepadanya, jadilah! maka jadilah sesuatu itu sesuai kehendak dan sunah kami. Semudah itulah kami mewujudkan apa yang kami kehendaki."
  }
]