[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dia menciptakan manusia dari setetes air yang hina, tiba-tiba dia kemudian menjadi bertenaga kuat lagi terpedaya dengan dirinya, lalu menjelma menjadi manusia yang amat besar permusuhan dan perdebatannya kepada tuhannya dalam mengingkari hari kebangkitan dan perkara lainnya, seperti dalam firmanNya : قَالَ مَنْ يُحْيِي الْعِظَامَ وَهِيَ رَمِيمٌ ia berkata: \"Siapakah yang dapat menghidupkan tulang belulang, yang telah hancur luluh?\" Dan melupakan Allah yang telah menciptakannya dari ketiadaan"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Allah menciptakan manusia dari setetes air yang hina, lalu ia tumbuh dari satu fase ke fase berikutnya, ternyata kemudian manusia itu gigih dalam mendebat untuk melenyapkan kebenaran, terang-terangan dalam mendebatnya dengan kebatilan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "4. Allah menciptakan manusia dari air yang hina -yaitu air mani-; akan tetapi mereka menjadi makhluk yang sangat mengingkari hari kebangkitan dan perhitungan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. خَلَقَ الْإِنسٰنَ مِن نُّطْفَةٍ (Dia telah menciptakan manusia dari mani) Kemudian Allah menumbuhkannya lewat beberapa fase sampai sempurna bentuk rupanya, dan meniupkan ruh kepadanya, serta mengeluarkannya dari perut ibunya ke dunia ini untuk hidup di sana. فَإِذَا هُوَ(tiba-tiba ia) Setelah diciptakan dengan cara yang begitu menakjubkan. خَصِيمٌ(menjadi pembantah) Yakni seakan-akan ia menjadi penantang Allah dalam kekuasaan-Nya. مُّبِينٌ(yang nyata) Yakni dengan permusuhan yang jelas."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Dia telah menciptakan manusia dari mani, namun dengan tiba-tiba ia menjadi pembantah dan pengingkar hari kebangkitan dan hari pembalasan yang nyata"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia telah menciptakan manusia dari mani} air yang hina yaitu mani {lalu ternyata dia menjadi pembantah} pembantah dengan kebathilan {yang nyata} menunjukkan pertentangannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4. usai membicarakan penciptaan langit (dan bumi) Allah menyebutkan penciptaan segenap makhluk yang menghuni keduanya. Dia mengawalinya, ”dia telah menciptakan manusia dari mani” Allah senantiasa mengatur, menumbuhkan dan mengembangkan (nuthfah tersebut) sampai menjadi manusia yang sempurna, lengkap angota angota tubuh luar ataupun dalamnya. Dia telah memolesnya dengan beragam karunia yang melimpah. sampai manakala ia telah menjelma manusia dewasa, maka ia membanggakan diri dan terpesona dengan dirinya. ”tiba tiba ia memusuhi Rabbnya, mengingkariNya, menyanggah para RasulNya dan mendustakan ayat ayatNya serta melupakan penciptaan dirinya pertama kali serta curahan kenikmatan Allah padanya. Ia justru memanfaatkannya untuk bermaksiat kepadaNya. Ayat tersebut juga mengandung pengertian makna, bahwasannya Allah menciptakan seorang manusia dari cairan mani. Selanjutnya Dia senantiasa mentransfernya dari satu fase menuju fase berikutnya sampai terbentuk manusia yang berakal lagi dapat berbicara, mempunyai akal dan pemikiran, yang bisa menentang dan membantah. Maka hendaknya yang telah mengantarkannya menuju kondisi demikian ini, yang sedikitpun dia tidak mempunyai kemampuan nelakukan nya sendiri."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (خَلَقَ ٱلۡإِنسَٰنَ مِن نُّطۡفَةٖ) khalaqal insaan minnuthfah : “Dia menciptakan manusia dari nuthfah.” Setetes air mani.(خَلَقَ ٱلۡإِنسَٰنَ مِن نُّطۡفَةٖ) khalaqal insaan minnuthfah : “Dia menciptakan manusia dari nuthfah.” Setetes air mani. Makna ayat: Firman-Nya “Dia menciptakan manusia dari air mani” dari hal yang paling lemah dan rendah, yaitu setetes mani, Dia menciptakannya di dalam tiga kegelapan, kemudian Dia mengeluarkannya dari perut ibunya dalam keadaan tidak mengetahui apa-apa, sampai hingga dia merawatnya, kemudian ia menjadi penentang Allah, membantah dan mengingkari-Nya, dan ia berkata: Siapa yang akan menghidupkan kembali tulang-belulang yang sudah hancur ini? Pelajaran dari ayat: • Penetapan tauhid, nubuwah, dan kebangkitan dengan menyebutkan tanda-tanda kekuasaan ilahi, ilmu, hikmah, kelembutan, dan kasih sayang-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 4: Setelah Allah menyebutkan tentang penciptaan langit dan bumi, Dia menyebutkan ciptaan-Nya yang ada di dalamnya, terutama sekali adalah manusia. Dia senantiasa mengurusnya, mengaturnya, dan mengembangkannya sehingga menjadi manusia sempurna yang lengkap dengan anggota badannya luar dan dalam, dicurahkan kepadanya nikmat-nikmat-Nya sampai ketika ia mendapatkan berbagai kenikmatan, ia pun merasa bangga dan ujub dengan dirinya. Kepada Tuhannya yang telah menciptakannya, dia kufur kepada Tuhannya, mendebat para utusan-Nya dan mendustakan ayat-ayat-Nya serta lupa terhadap kejadiannya dari apa ia diciptakan, seperti kata-katanya ketika mengingkari kebangkitan, \"Siapakah yang dapat menghidupkan tulang belulang, yang telah hancur luluh?\" Lebih dari itu, dia gunakan kenikmatan-kenikmatan yang diberikan Allah untuk bermaksiat kepada-Nya. Padahal pantaskah makhluk yang diciptakan dari sesuatu yang hina menetang Tuhannya yang Mahamulia? Dia memberikan kepada mereka berbagai kebaikan, namun mereka membalasnya dengan keburukan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 4",
    "description": "Dia yang mahaesa dan mahakuasa itu juga telah menciptakan manusia dari setetes mani yang secara lahiriah tampak remeh, tidak berarti, dan tidak berdaya, ternyata dia berubah menjadi manusia yang kuat dan tangguh, bahkan dia berubah menjadi pembantah yang nyata tentang tuhan dan hakikat dirinya. Dan tidak saja menciptakan langit, bumi, dan manusia, hewan ternak juga telah diciptakan-Nya, untuk kamu padanya ada bulu dan kulit yang dapat kamu jadikan pakaian yang menghangatkan badan kamu dan berbagai manfaat lain yang dapat kamu ambil dalam kehidupan kamu, dan sebagian dari-Nya juga dapat kamu makan."
  }
]