[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya urusan membangkitkan(orang-orang yang telah mati) merupakan perkara mudah bagi Kami. Sesungguhnya Kami bila menghendaki sesuatu, kami hanya berfirman, ”jadilah”, maka kemudian ia terjadi dan terwujud."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "40. Bila Kami hendak menghidupkan dan membangkitkan orang-orang mati maka tidak ada penghalang apa pun yang menghalangi Kami. Kami hanya tinggal berkata kepada sesuatu yang Kami kehendaki, “Jadilah!” Maka ia pun jadi, tidak bisa tidak."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "40. إِنَّمَا قَوْلُنَا لِشَىْءٍ إِذَآ أَرَدْنٰهُ أَن نَّقُولَ لَهُۥ كُن فَيَكُونُ (Sesungguhnya perkataan Kami terhadap sesuatu apabila Kami menghendakinya, Kami hanya mengatakan kepadanya: “kun (jadilah)”, maka jadilah ia) Ayat ini untuk menjelaskan bagaimana Allah memulai penciptaan dan mengulanginya, setelah menjelaskan kemudahan bagi Allah untuk membangkitkan makhluk-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "40. Sesungguhnya perkataan Kami terhadap sesuatu apabila Kami menghendakinya, Kami hanya mengatakan kepadanya: “Kun (jadilah)”, maka jadilah ia.” Begitu juga penciptaan awal maupun pembangkitan kembali"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya firman Kami terhadap sesuatu apabila Kami menghendakinya, maka berfirman kepadanya,“Jadilah!” Maka jadilah sesuatu itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "39-40. Kemudian Allah menyebutkan hikmah kenapa diadakan hari pembalasan dan hari kebangkitan. Allah berfirman “agar Allah menjelaskan kepada mereka apa yang mereka perselisihkan itu” berupa persoalan persoalan yang besar dan kecil. Allah menjelaskaan hakikat (kebenarannya) dan memaparkannya “dan agar orang orang kafir itu mengetahui bahwasannya mereka adalah orang orang yang berdusta” sampai akhirnya mereka menyaksikan amalan amalan mereka sebagai penyesalan bagi diri mereka. tuhan tuhan sesembahan mereka yang dahuu mereka seru (diibadahi) bersama dengan Allah tidaklah bermanfaat sama sekali ketika telah datang keputusan Rabbmu. Dan tatkala mereka menyaksikan sesembahan sesembahan mereka menjadi kayu bakar bagi neraka jahanam, saat matahari dan bulan digulung, dan bintang bintang berhamburan dan saat sesembahan itu telah jelas bahwa ia adalah hamba yang tunduk lagi membutuhkan bantuan Allah dalam setiap kondisi sementara hal itu bukan merupakan perkara yang sulit atau pelik bagi Allah maka di sisi yang lain, apabila DIa menghendaki sesuatu, niscaya Dia (cukup) berfirman ”jadilah, maka akan terjadi ’tanpa ada perlawanan atau pencegahan. Bahkan benar benar akan terjadi persis seperti yang diinginkan dan dikehendakiNya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat: Kami mengatakan kepadanya, “Kun” maka jadilah apa yang Dia kehendaki, dan kebangkitan termasuk dalam hal itu. Ini adalah apa yang ditunjukkan oleh ayat (40) “Sesungguhnya firman Kami terhadap sesuatu apa bila Kami mengendakinya, Kami hanya mengatakan kepadanya, “Jadilah!” maka jadilah sesuatu itu.” Tidak boleh seseorang berkata: “Bagaimana Allah mengajak bicara sesuatu yang tidak ada menjadi ada?” karena Allah ta’ala jika berkehendak akan sesuatu Dia telah mengetahuinya, kemudian Dia berfirman “Kun” maka jadilah. Pelajaran dari ayat: • Tidak ada satu pun hal yang sulit untuk Allah ciptakan, karena hal itu terwujud hanya dengan satu kata saja."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 40: Dalam tafsir Al Jalaalain diterangkan, bahwa ayat ini dimaksudkan untuk menguatkan kekuasaan Allah dalam membangkitkan manusia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 40",
    "description": "Tidak sulit bagi Allah untuk melakukan apa saja yang dikehendakinya, tidak terkecuali membangkitkan manusia pada hari kiamat. Allah menyatakan, sesungguhnya firman kami terhadap sesuatu apabila kami menghendakinya terjadi, kami hanya mengatakan kepadanya, jadilah! maka jadilah sesuatu itu sesuai kehendak dan sunah kami. Semudah itulah kami mewujudkan apa yang kami kehendaki. Usai berbicara tentang pengingkaran kaum musyrik mekah dan kezaliman mereka kepada nabi Muhammad dan kaum muslim, Allah lalu beralih menjelaskan ketentuan hijrah dan pahala bagi orang yang berhijrah, dan orang yang berhijrah meninggalkan kerabat dan kampung halamannya karena mengikuti perintah Allah setelah mereka dizalimi, pasti kami akan memberikan tempat, suasana, dan ganjaran yang baik kepada mereka di dunia. Dan pahala yang kami berikan kepada mereka di akhirat kelak pasti lebih besar dan baik. Sekiranya mereka, orang kafir, mengetahui betapa besar pahala yang kami berikan kepada orang yang beriman dan berhijrah, niscaya mereka beriman dan berhijrah."
  }
]