[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang yang meninggalkan negeri mereka karena Allah, lalu mereka berhijrah setelah mengalami tindakan kezhaliman pastilah kami akan menempatkan mereka di dunia ke dalam tempat tinggal yang baik, dan ganjaran akhirat itu lebih besar, sebab pahala mereka disana adalah surga, seandainya orang-orang yang tidak berhijrah mengetahui seyakin-yakinnya ganjaran dan pahala yang ada di sisi Allah bagi orang-orang yang berhijrah di jalanNya, niscaya tidak ada seorangpun yang tertinggal dari berhijrah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "41. Orang-orang yang meninggalkan negeri, keluarga dan harta mereka dalam rangka berhijrah dari negeri kekufuran menuju negeri Islam guna mencari rida Allah setelah orang-orang kafir itu menyiksa dan menekan hidup mereka, niscaya Kami akan menempatkan mereka di negeri tempat mereka hidup dengan mulia, dan sungguh pahala Akhirat adalah lebih besar karena di antaranya adalah Surga. Seandainya orang-orang yang tertinggal dari hijrah mengetahui pahala orang-orang yang berhijrah niscaya mereka tidak tertinggal darinya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "41-42. Orang-orang yang berhijrah yang meninggalkan negeri dan harta mereka demi meraih keridhaan Allah setelah mereka mendapat siksaan dan gangguan, maka sungguh Kami akan memberi mereka rezeki yang baik di dunia, dan sungguh pahala akhirat di surga lebih besar bagi mereka seandainya orang-orang yang enggan berhijrah mengetahui keutamaan orang-orang yang berhijrah, yang telah bersabar menghadapi gangguan orang-orang musyrik dan bersabar dalam mentaati perintah perintah Allah; dan hanya kepada Allah mereka bertawakal."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "41. وَالَّذِينَ هَاجَرُوا۟ (Dan orang-orang yang berhijrah) Hijrah yakni meninggalkan keluarga dan tanah air. فِى اللهِ(karena Allah) Yakni di jalan menolong agama Allah. مِنۢ بَعْدِ مَا ظُلِمُوا۟( sesudah mereka dianiaya) Yakni setelah mereka disiksa dan dihinakan. Para penduduk Makkah menyiksa sekolompok orang Islam hingga mereka mau mengatakan yang orang-orang kafir inginkan. Setelah mereka membebaskan orang-orang islam tersebut, mereka lalu pergi berhijrah. لَنُبَوِّئَنَّهُمْ فِى الدُّنْيَا حَسَنَةً ۖ( pasti Kami akan memberikan tempat yang bagus kepada mereka di dunia) Yakni perpindahan mereka ke Madinah, dan negeri-negeri yang mereka takhlukkan sehingga mereka memiliki wilayah yang luas, serta pujian yang terus mengalir bagi mereka sehingga penerus mereka ikut mendapatkan kemuliaan dan kehormatan. وَلَأَجْرُ الْاٰخِرَةِ(Dan sesungguhnya pahala di akhirat) Yakni balasan amalan mereka di akhirat nanti. أَكْبَرُ ۚ( adalah lebih besar) Yakni lebih besar daripada kebaikan dunia yang didapatkan oleh orang-orang yang berhijrah. لَوْ كَانُوا۟ يَعْلَمُونَ(kalau mereka mengetahui) Jika orang-orang agung tersebut mengetahui hal itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "41. Orang-orang yang berhijrah atau meninggalkan rumah dan harta hanya karena Allah, dan menolong agama Allah, sesudah mereka dianiaya oelh orang musyrik, pasti Kami akan memberikan tempat tinggal yang baik kepada mereka di dunia yaitu Madinah, serta pahala akhirat atas amal mereka yaitu surga. Dan sesungguhnya pahala di akhirat adalah lebih besar, kalau mereka mengetahui, Pada berita gembira tentang hijrah dari Makkah ke Madinah ini adalah suatu kewajiban dalam Islam, sebab dengan hijrah itu diharapkan Islam akan lebih kuat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan orang-orang yang berhijrah karena Allah setelah mereka dizalimi} disiksa dan disakiti karena Allah {sungguh Kami akan memberikan kepada mereka} sungguh Kami akan memberi mereka {di dunia tempat yang bagus} tempat yang bagus {Sungguh pahala di akhirat itu lebih besar, sekiranya mereka mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "41. Allah memberitahukan keutamaan orang orang Mukmin yang telah di uji “dan orang orang yang berhijrah karena Allah” di jalanNya dan dalam upaya mencari keridhaanNya “sesudah mereka dianiaya” dengan gangguan kepada mereka untuk mengembalikan mereka kedalam kekufuran dan kesyirikan. Lalu mereka rela meninggalkan kampung halaman dan orang orang tercinta, pindah meninggalkannya demi ketaatan kepada ar-rahman. maka Allah menyebutkan bagi mereka dua pahala (pertama) pahala yang bersifat segera di dunia, berupa rizki yang luas, penghidupan yang enak yang telah mereka saksikan dengan mata kepala mereka sendiri setelah berhijrah, menang atas para musuh mereka dan mampu menaklukan berbagai wilayah negeri, serta mendapatkan berbagai harta rampasan yang banyak sehingga mereka mempunyai harta yang berlimpah. Allah pun menganugerahi mereka kebaikan di dunia ini. (kedua) “dan sesungguhnya pahala di akhirat” yang sudah Allah janjikan bagi mereka melalui lisan rasulNya adalah lebih baik dan “lebih besar” daripada pahala duniawi. sebagaimana Firman Allah: \"orang-orang yang beriman dan berhijrah serta berjihad di jalan Allah dengan harta, benda dan diri mereka, adalah lebih tinggi derajatnya di sisi Allah; dan itulah orang-orang yang mendapat kemenangan. Tuhan mereka menggembirakan mereka dengan memberikan rahmat dari pada-Nya, keridhaan dan surga, mereka memperoleh didalamnya kesenangan yang kekal, mereka kekal di dalamnya selama-lamanya. Sesungguhnya di sisi Allah-lah pahala yang besar.\" (QS. At-Taubah ; 20-22) “kalau mereka mengetahui” maksudnya, seandainya mereka memiliki ilmu dan keyakinan tentang kenikmatan yang ada di sisi Allah berupa ganjaran dan pahala buat orang yang beriman kepadaNya dan berhijrah di jalanNya maka tidak aka nada seorangpun yang mengurungkan diri darinya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (وَٱلَّذِينَ هَاجَرُواْ فِي ٱللَّهِ) walladziina haajaruu fillaah : “dan orang yang berhijrah karena Allah” yaitu keluar dari Mekah fii sabilillah untuk menolong agama-Nya dan menegakkannya di tengah-tengah manusia. (لَنُبَوِّئَنَّهُمۡ فِي ٱلدُّنۡيَا حَسَنَةٗۖ) lanubawwi`annahum fid dunyaa hasanah : “pasti Kami akan memberikan tempat yang baik kepada mereka di dunia” Kami akan memberikan tempat tinggal yang baik yaitu Madinah Nabawiyah, ini jika berdasarkan sebab turun ayat. Makna ayat: Setelah gangguan semakin berat terhadap orang-orang yang beriman karena penentangan dan kezaliman kaum musyrikin, Allah ta’ala mengizinkan melalui lisan Rasul-Nya kepada kaum mukminin untuk hijrah dari Mekah menuju Habasyah, kemudian menuju Madinah. Maka berhijrahlah baik laki-laki maupun perempuan, kemudian Allah ta’ala menyebutkan pujian kepada mereka serta penyemangat untuk berhijrah dari negeri kafir, Allah ta’ala berfirman “Dan orang yang berhijrah karena Allah” karena Allah dan untuk beribadah kepada Allah serta menolong agama-Nya “setelah mereka dizalimi” oleh kaum musyrikin “Kami akan memberikan kepada mereka tempat” akan Kami tempatkan mereka “tempat yang baik di dunia.” Yaitu Madinah Nabawiyah dan Kami akan memberikan merkea rizki yang baik di sana, ini jika ditinjau dari sebab turunnya ayat. Adapun jika tidak, maka setiap orang yang berhijrah karena Allah, maka Allah akan menyiapkan baginya janji ini sebagaimana Firman-Nya “Dan barang siapa yang berhijrah di jalan Allah, niscaya mereka akan mendapatkan di bumi ini tampat hijrah yang luas dan banyak.” [An-Nisa`:100] yaitu kehidupan dan rezeki yang banyak. “dan pahala di akhirat” yang telah disediakan bagi yang berhijrah di jalan Allah “lebih besar, sekiranya mereka mengetahui.” Ini adalah penjelasan keadaan mereka serta pujian dengan kebaikan, karena mereka bersabar atas gangguan ketika di Mekah, kemudian ketika mereka diperintahkan untuk hijrah, mereka berhijrah bertawakal kepada Allah ta’ala seraya menyerahkan seluruh urusan kepada-Nya dan yakin akan janji-Nya. ini apa yang ditunjukkan oleh ayat (41,42). Pelajaran dari ayat : • Keutamaan berhijrah, terutama ketika seorang mukmin tertekan dan tidak mampu beribadah kepada Allah ta’ala."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 41: Di jalan Allah dan karena mencari keridhaan-Nya serta untuk dapat menegakkan agama-Nya. Mereka ini adalah Rasulullah shallallahu 'alaihi wa sallam dan para sahabatnya. Mereka rela meninggalkan tanah air dan orang yang mereka cintai karena mencari keridhaan Allah, maka Allah akan memberikan dua balasan kepada mereka; balasan yang segera di dunia berupa rezeki yang luas dan kehidupan yang menyenangkan yang mereka lihat setelah hijrah, menang terhadap musuh mereka, berhasil menaklukkan negeri-negeri, mendapat banyak ghanimah dan Allah memberikan kebaikan lainya kepada mereka di dunia. Yaitu Madinah. Yaitu yang telah dijanjikan Allah melalui lisan para rasul-Nya. Dari balasan di dunia. Yakni orang-orang kafir dan orang-orang yang tidak ikut berhijrah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 41",
    "description": "Usai berbicara tentang pengingkaran kaum musyrik mekah dan kezaliman mereka kepada nabi Muhammad dan kaum muslim, Allah lalu beralih menjelaskan ketentuan hijrah dan pahala bagi orang yang berhijrah, dan orang yang berhijrah meninggalkan kerabat dan kampung halamannya karena mengikuti perintah Allah setelah mereka dizalimi, pasti kami akan memberikan tempat, suasana, dan ganjaran yang baik kepada mereka di dunia. Dan pahala yang kami berikan kepada mereka di akhirat kelak pasti lebih besar dan baik. Sekiranya mereka, orang kafir, mengetahui betapa besar pahala yang kami berikan kepada orang yang beriman dan berhijrah, niscaya mereka beriman dan berhijrah. Pahala yang besar dan baik itu hanya diperoleh oleh orang yang sabar dalam melaksanakan tuntunan Allah dan menghadapi berbagai cobaan, dan orang yang hanya kepada tuhan yang mahakuasa dan maha mengatur mereka bertawakal serta menyerahkan urusan mereka setelah berupaya mewujudkannya sekuat kemampuan."
  }
]