[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang yang berhijrah di jalan Allah mereka itulah orang-orang yang besabar dalam menjalankan perintah-perintah Allah menghadapi larangan-laranganNya, dan menjalani takdir-takdirNya yang menyakitkan.Dan kepada tuhan mereka saja mreka bergantung, sehingga mereka berhak menggapai kedudukan yang agung ini."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "42. Orang-orang yang berhijrah di jalan Allah adalah orang-orang yang sabar atas gangguan kaum mereka dan berpisah dengan negeri dan keluarga mereka, juga sabar di atas ketaatan kepada Allah. Mereka hanya bersandar kepada Rabb mereka dalam segala urusan, maka Allah memberi mereka pahala yang agung."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "42. الَّذِينَ صَبَرُوا۟ وَعَلَىٰ رَبِّهِمْ يَتَوَكَّلُونَ ((yaitu) orang-orang yang sabar dan hanya kepada Tuhan saja mereka bertawakkal) Yakni mereka hanya bertawakkal kepada Tuhan mereka semata dalam segala urusan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "42. Orang-orang yang berhijrah dan senantiasa sabar atas siksa orang musyrik dan hanya bersandar kepada Tuhan mereka saja mereka menyerahkan urusan mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang sabar dan hanya kepada Tuhan mereka bertawakal"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "42. kemudian Allah menyebutkan sifat sifat para kekasihNya (para waliNya) dengan berfirman \"(yaitu) orang orang yang sabar” dalam melaksanakan perintah perintah Allah dan larangan laranganNya, sabar atas takdir takdir Allah yang tidak mengenakan dan bersabar atas gangguan dan cobaan cobaan. ”dan hanya kepada Rabb saja mereka bertawakal” maksudnya bersandar kepadaNya dalam menjalankan hal hal yang dicintaiNya tidak bersandar pada diri mereka sendiri. Dengan ini, urusan urusan mereka lancar dan kondisi kondisi mereka stabil. Sesungguhnya kesabaran dan tawakal adalah kekuatan segala perkara. Tidaklah ada kebaikan yang lepas dari seseorang melainkan pasti lantaran ketidaksabarannya dan tidak adanya pengerahan kemampuan untuk mewujudkan apa yang diinginkannya atau tidak bertawakal dan berserah diri kepadaNya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (ٱلَّذِينَ صَبَرُواْ وَعَلَىٰ رَبِّهِمۡ يَتَوَكَّلُونَ) alladziina shabaruu wa ‘alaa rabbihim yatawakkaluun : “yaitu orang yang sabar dan hanya kepada Rabb mereka bertawakal.” Bersabar atas gangguan kaum musyrikin dan berhijrah bertawakal kepada Rabb mereka menuju tujuan hijrah mereka (Madinah). Makna ayat: Setelah gangguan semakin berat terhadap orang-orang yang beriman karena penentangan dan kezaliman kaum musyrikin, Allah ta’ala mengizinkan melalui lisan Rasul-Nya kepada kaum mukminin untuk hijrah dari Mekah menuju Habasyah, kemudian menuju Madinah. Maka berhijrahlah baik laki-laki maupun perempuan, kemudian Allah ta’ala menyebutkan pujian kepada mereka serta penyemangat untuk berhijrah dari negeri kafir, Allah ta’ala berfirman “Dan orang yang berhijrah karena Allah” karena Allah dan untuk beribadah kepada Allah serta menolong agama-Nya “setelah mereka dizalimi” oleh kaum musyrikin “Kami akan memberikan kepada mereka tempat” akan Kami tempatkan mereka “tempat yang baik di dunia.” Yaitu Madinah Nabawiyah dan Kami akan memberikan merkea rizki yang baik di sana, ini jika ditinjau dari sebab turunnya ayat. Adapun jika tidak, maka setiap orang yang berhijrah karena Allah, maka Allah akan menyiapkan baginya janji ini sebagaimana Firman-Nya “Dan barang siapa yang berhijrah di jalan Allah, niscaya mereka akan mendapatkan di bumi ini tampat hijrah yang luas dan banyak.” [An-Nisa`:100] yaitu kehidupan dan rezeki yang banyak. “dan pahala di akhirat” yang telah disediakan bagi yang berhijrah di jalan Allah “lebih besar, sekiranya mereka mengetahui.” Ini adalah penjelasan keadaan mereka serta pujian dengan kebaikan, karena mereka bersabar atas gangguan ketika di Mekah, kemudian ketika mereka diperintahkan untuk hijrah, mereka berhijrah bertawakal kepada Allah ta’ala seraya menyerahkan seluruh urusan kepada-Nya dan yakin akan janji-Nya. ini apa yang ditunjukkan oleh ayat (41,42)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 42: Terhadap gangguan orang-orang musyrik, dan sabar melakukan hijrah agar dapat menampakkan agama. Bisa juga sabar dalam arti yang lebih luas, yaitu sabar dalam menjalankan perintah Allah, sabar dalam menjauhi larangan Allah, sabar dalam menerima taqdir Allah yang cukup pedih serta sabar dalam menerima gangguan dan cobaan. Mereka bersandar kepada Allah dalam mewujudkan apa yang mereka inginkan, tidak bersandar kepada diri mereka. Oleh karena itu, jika kebaikan luput dari seseorang, maka hal itu tidak lain karena tidak ada kesabaran, kurang sungguh-sungguh dan tidak bertawakkal kepada Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 42",
    "description": "Pahala yang besar dan baik itu hanya diperoleh oleh orang yang sabar dalam melaksanakan tuntunan Allah dan menghadapi berbagai cobaan, dan orang yang hanya kepada tuhan yang mahakuasa dan maha mengatur mereka bertawakal serta menyerahkan urusan mereka setelah berupaya mewujudkannya sekuat kemampuan. Pengutusan para nabi dan rasul adalah sesuatu yang hak dan benar adanya. Dan kami tidak mengutus kepada umat manusia sebelum engkau, wahai Muhammad, melainkan orang laki-laki terpilih yang memiliki keistimewaan dan ketokohan dari kalangan manusia, bukan malaikat, yang kami beri wahyu kepada mereka melalui utusan kami, jibril agar disampaikannya kepada umat mereka; maka bertanyalah, wahai orang yang meragukan keesaan Allah dan tidak mengetahui tuntunan-Nya, kepada orang yang mempunyai pengetahuan tentang nabi dan kitab-kitab Allah, jika kamu tidak mengetahui. (lihat: surah al-anbiya'/21: 7'8 dan al-jinn/72: 6)."
  }
]