[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan tidaklah kami mengutus di tengah orang-orang terdahulu sebelummu (wahai rasul), kecuali utusan-utusan dari kaum lelaki bangsa manusia, bukan dari kalangan malaikat, yang kami berikan wahyu kepada mreka. Dan bila kalian (wahai kaum musyrikin quraisy), tidak mengimaninya, maka tanyakanlah kepada umat-umat terdahulu yang diberi kitab suci, supaya mereka mengabarkan kepada kalian bahwa sesungguhnya nabi-nabi terdahulu berwujud manusia-manusia biasa juga, jika kalian tidak mengetahui bahwasanya mereka itu manusia. Ayat ini bersifat umum pada setiap masalah-masalah agama, jika seorang manusia tidak memiliki pengetahuan tentangnya, hendaknya ia bertanya kepada orang yang mengetahuinya dari ulama-ulama yang berilmu mendalam."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "43. Kami tidak mengutus sebelummu wahai Rasul kecuali kaum laki-laki dari manusia yang Kami beri wahyu, Kami tidak mengutus para Rasul dari kalangan Malaikat. Ini adalah ketentuan Kami yang berlaku umum, jika kalian mengingkarinya, maka bertanyalah kepada orang-orang yang diberi kitab sebelum kalian niscaya mereka akan mengatakan kepada kalian bahwa para Rasul adalah manusia dan bukan Malaikat bila kalian tidak mengetahui bahwa mereka adalah manusia."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "43. Hai Rasulallah, tidaklah Kami mengutus seorang rasul sebelummu melainkan dia berasal dari golongan manusia laki-laki, dan bukan dari para malaikat. Kami memberi mereka wahyu dengan perantara para malaikat. Hai orang-orang musyrik Quraisy, jika kalian tidak mempercayai hal ini, Maka tanyakanlah kepada orang-orang yang memiliki ilmu tentang kitab-kitab jika kalian tidak mengetahui kebenaran."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "43. وَمَآ أَرْسَلْنَا مِن قَبْلِكَ إِلَّا رِجَالًا نُّوحِىٓ إِلَيْهِمْ ۚ (Dan Kami tidak mengutus sebelum kamu, kecuali orang-orang lelaki yang Kami beri wahyu kepada mereka) Ini merupakan bantahan terhadap kaum Quraisy yang mengatakan bahwa Allah tidak pantas untuk mengutus seorang rasul dari golongan manusia. فَسْـَٔلُوٓا۟ أَهْلَ الذِّكْرِ إِن كُنتُمْ لَا تَعْلَمُونَ(maka bertanyalah kepada orang yang mempunyai pengetahuan jika kamu tidak mengetahui) Yakni hai orang-orang musyrik, bertanyalah kepada para ahli kitab yang beriman jika kalian tidak mengetahui, karena mereka akan memberitahu kalian bahwa seluruh nabi berasal dari golongan manusia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "43. Wahai Rasul, kami tidak mengutus para rasul sebelummu kecuali mereka adalah para laki-laki bukan malaikat, maka bertanyalah kalian wahai orang-orang musyrik yang membangkang kepada orang-orang yang memiliki pengetahuan kitab-kitab Allah terdahulu seperti Taurat dan Injil tentang kemanusiaan para rasul, jika kalian memang tidak mengetahui bahwa seluruh rasul itu manusia"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami tidak mengutus sebelummu, melainkan laki-laki yang Kami beri wahyu kepada mereka. Maka bertanyalah kepada orang-orang yang mempunyai pengetahuan} memiliki pengetahuan tentang kitab {jika kalian tidak mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "43. Allah berkata kepada NabiNya, Muhammad, ”dan kami tidak mengutus sebelum kamu, kecuali orang orang lelaki” maksudnya engkau bukanlah orang baru dari kalangan rasul. Kami tidak pernah mengutus malaikat sebelummu, tetapi kaum lelaki yang sempurna, bukan kalangan wanita, ”yang kami beri wahyu kepada mereka” berupa syariat syariat dan hukum hukum yang menjadi bagian kemurahan dan curahan kebaikan Allah kepada para hambaNya tanpa menyodorkan sesuatu dari diri mereka pribadi, ”maka bertanyalah kepada orang yang mempunyai pengetahuan” maksudnya orang orang yang mempunyai pengetahuan kitab kitab terdahulu. “jika kamu tidak mengetahui” sejarah orang orang terdahulu dan kalian dihinggapi keraguan, apakah Allah itu mengutus kaum lelaki (dari bangsa manusia)? maka tanyakanlah kepada orang orang yang berpengetahuan mengenai itu, yang mana kitab kitab dan bukti bukti yang nyata telah diturunkan kepada mereka, lalu mereka mengetahui dan memahaminya. Sesungguhnya telah mapan pada keyakinan mereka bahwasannya Allah tidak mengutus kecuali kaum lelaki yang telah diwahyukan kepada mereka (wahyu) dari kalangan penduduk kampung setempat. Di dalam kandungan umum ayat ini terdapat pujian bagi para ahli ilmu, dan bahwasannya jenis ilmu yang paling tinggi kedudukannya ialah ilmu tentang kitabullah yang diturunkan. Sesungguhnya Allah telah menyuruh orang yang tidak berilmu (tidak tahu) untuk mendatangi para ahli ilmu dalam semua permasalahan. Dalam keterangan ini, termuat ta’dil (penetapan citra baik) bagi mereka, lantaran Allah memerintahkan untuk bertanya kepada mereka. Dengan tindakan ini, seorang yang jahil (tidak tau) akan keluar dari lingkaran ikut ikutan saja. maka hal ini menunjukan bahwa Allah mempercayakan mereka atas wahyu dan kitab yang diturunkanNya, dan (menandakan) bahwa mereka diperintah untuk membersihkan jiwa jiwa mereka dan menghiasi diri dengan sifat sifat yang baik."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (فَسۡ‍َٔلُوٓاْ أَهۡلَ ٱلذِّكۡرِ) fas`aluu ahladz dzikr : “maka bertanyalah kepada orang yang mempunyai pengetahuan.” Yaitu wahai orang-orang yang ragu akan apa yang dibawa oleh Muhammad shalallahu ‘alaihi wa sallam, tanyalah para ahli Taurat dan Injil untuk menghilangkan keraguan kalian serta untuk menemukan kebenaran, bahwa yang dibawa oleh Muhammad shalallahu ‘alaihi wa sallam adalah kebenaran, dan seluruh rasul sebelumnya adalah manusia sepertinya. Makna ayat: adapun ayat yang ketiga (43) dan empat (44) mengandung isi yang sama, yaitu penegasan kebenaran secara ilmiah dan peniadaan kerancuan kaum musyrikin yang berkata, “Bagaimana Allah mengutus Muhammad sebagai rasul, sedangkan dia adalah manusia seperti kita, kenapa Dia tidak mengutus malaikat?” ayat tersebut adalah yang Allah firmankan : “Dan Kami tidak mengutus sebelum engkau (Muhammad)” mengutus para rasul “melainkan laki-laki” bukan malaikat “yang Kami beri wahyu kepada mereka” dengan perintah Kami “maka bertanyalah” wahai kaum musyrikin yang mengingkari adanya rasul dari kalangan manusia, bertanyalah kepada Ahli Az-Zikr yaitu kitab yang pertama, mereka adalah Ahlul Kitab dari kalangan Yahudi dan Nasrani: “Apakah dahulu Allah ta’ala pernah mengutus para rasul dari selain kalangan manusia?” ”jika kamu tidak mengetahui.” Karena mereka akan memberitahu kalian, tidaklah Musa dan Isa kecuali seorang manusia. Pelajaran dari ayat: • Kewajiban bertanya kepada Ahlul Ilmi jika seseroang tidak mengetahui perkara agamanya, seperti dalam hal aqidah, ibadah, dan hukum."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 43: Bukan malaikat, dan bukan wanita. Berupa syari’at dan hukum-hukum sebagai karunia dan ihsan-Nya kepada hamba-hamba-Nya, dan lagi bukan dari sisi (menurut keinginan) mereka bentuk syari’at itu. Yakni orang yang mempunyai pengetahuan tentang nabi dan kitab-kitab. Tentang berita orang-orang terdahulu, dan jika kamu masih meragukan apakah nabi yang Allah utus itu malaikat atau manusia? Dalam ayat ini terdapat pujian bagi ahli ilmu, terutama sekali yang memiliki ilmu terhadap kitab Allah (Al Qur’an), karena Allah memerintahkan untuk merujuk kepada mereka dalam semua peristiwa. Di dalam ayat ini juga terdapat tazkiyah (rekomendasi) terhadap ahli ilmu, karena Allah memerintahkan orang yang tidak tahu untuk bertanya kepada mereka, dan bahwa tugas orang awam adalah bertanya keada ahli ilmu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 43",
    "description": "Pengutusan para nabi dan rasul adalah sesuatu yang hak dan benar adanya. Dan kami tidak mengutus kepada umat manusia sebelum engkau, wahai Muhammad, melainkan orang laki-laki terpilih yang memiliki keistimewaan dan ketokohan dari kalangan manusia, bukan malaikat, yang kami beri wahyu kepada mereka melalui utusan kami, jibril agar disampaikannya kepada umat mereka; maka bertanyalah, wahai orang yang meragukan keesaan Allah dan tidak mengetahui tuntunan-Nya, kepada orang yang mempunyai pengetahuan tentang nabi dan kitab-kitab Allah, jika kamu tidak mengetahui. (lihat: surah al-anbiya'/21: 7'8 dan al-jinn/72: 6)para rasul itu kami utus dengan membawa keterangan-keterangan berupa mukjizat yang membuktikan kenabian dan kerasulan mereka. Dan sebagian dari mereka membawa kitab-kitab yang berisi hukum, nasihat, dan aturan yang menjadi pedoman bagi kehidupan kaumnya. Dan kami turunkan adz-dzikr, yakni Al-Qur'an, kepadamu, wahai nabi Muhammad, agar engkau menerangkan kepada umat manusia apa yang telah diturunkan kepada mereka berupa tuntunan dan petunjuk dalam kitab tersebut agar mereka tahu dan mengikuti jalan yang benar dan agar mereka memikirkan hal-hal yang menjadi pelajaran untuk kemaslahatan mereka di dunia dan akhirat."
  }
]