[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kami utus rasul-rasul terdahulu dengan membawa bukti-bukti jelas dan kitab-kitab suci dari langit, dan kami turunkan al-qur’an kepadamu (wahai rasul), supaya kamu menjelaskan kepada manusia makana-makna dan hukumnya yang masih samar dan agar mereka merenunginya dan memperoleh petunjuk dengannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "44. Kami mengutus para Rasul dari kalangan manusia tersebut dengan membawa bukti-bukti yang nyata dan kitab-kitab yang diturunkan. Kami menurunkan kepadamu -wahai Rasul- Al-Qur`ān agar kamu menjelaskan kepada manusia apa yang memerlukan penjelasan supaya mereka mau menggunakan akal pikiran mereka lalu mengambil pelajaran dari kandungannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "44. Para rasul tersebut datang dengan berbagai mukjizat yang menakjubkan dan dengan kitab-kitab yang diturunkan dari Allah. Hai Rasulallah, dan Kami turunkan al-Qur'an kepadamu agar kamu menjelaskan kepada manusia hukum-hukum Allah dan segala sesuatu yang membutuhkan penjelasan agar mereka memahami pelajaran-pelajaran yang dikandungnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "44. بِالْبَيِّنٰتِ وَالزُّبُرِ ۗ (keterangan-keterangan (mukjizat) dan kitab-kitab) Yakni Kami mengutus mereka dengan membawa kererangan-keterangan dan bukti-bukti. Makna (الزبر) yakni kitab-kitab. وَأَنزَلْنَآ إِلَيْكَ الذِّكْرَ(Dan Kami turunkan kepadamu Al Quran) Yakni al-Qur’an. لِتُبَيِّنَ لِلنَّاسِ (agar kamu menerangkan pada umat manusia) Kepada umat manusia seluruhnya, dengan perkataan dan perbuatanmu. مَا نُزِّلَ إِلَيْهِمْ (apa yang telah diturunkan kepada mereka) Dalam al-Qur’an ini, berupa hukum-hukum syar’i, kabar gembira, dan ancaman. وَلَعَلَّهُمْ يَتَفَكَّرُونَ(dan supaya mereka memikirkan) Agar mereka berfikir dan menggunakan akal mereka untuk mengambil pelajaran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "44. Kami mengutus mereka dengan mukjizat yang membuktikan tentang kebenaran nubuwwah mereka dan kitab-kitab ilahiyyah yang mengandung syariat dan tanggung jawab. Dan Kami menurunkan Al-Qur’an kepadamu wahai Rasul supaya kamu menjelaskan kepada manusia tentang apa yang diturunkan Allah berupa rahasia syariat dan hukum-hukumNya, janji dan ancamanNya, dan supaya mereka berpikir dan merenung tentang apa yang terkandung di dalamnya serta menyadari dan mengambil pelajaran dari hakikat-hakikat yang ada"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dengan (membawa) bukti-bukti yang nyata} Kami mengutus mereka dengan dalil-dalil dan bukti-bukti {dan kitab-kitab} kitab-kitab {Kami menurunkan kepadamu sunnah} sunnah {agar kamu bisa menerangkan kepada manusia apa yang telah diturunkan kepada mereka} Al-Qur’an {dan agar mereka berpikir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "44. orang berpengetahuan yang paling utama, ialah orang yang menguasai al-qur’an yang agung. Sesungguhnya mereka itu orang yang berpengetahuan dengan sebenarnya, dan lebih pantas menyandang predikat ini dibandingkan pihak yang lain. Oleh Karena itu, Allah berfirman ”dan Kami turunkan kepadamu ad dzikr” yaitu al qur’an yang berisikan peringatan tentang apa saja yang dibutuhkan para hamba, yang bertalian dengan urusan agama dan duniawi mereka, yang zahir maupun yang batin. ”agar kamu menerangkan kepada umat manusia apa yang telah diturunkan kepada mereka” tujuan ini mencakup penjelasan lafazh lafazh dan makna maknanya, ”dan supaya mereka memikirkan” memikirkannya, hingga berhasil mengekspolrasi segala perbendaharaan (manfaat) dan ilmu ilmunya sesuai dengan bekal dan atensi mereka kepada al qur’an."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (بِٱلۡبَيِّنَٰتِ وَٱلزُّبُرِۗ) bil bayyinaati waz zubur : “dengan membawa keterangan-keterangan dan kitab-kitab.” Kami mengutus mereka dengan bukti-bukti dan az-zubur untuk memberi manusia petunjuk. (وَأَنزَلۡنَآ إِلَيۡكَ ٱلذِّكۡرَ) wa anzalnaa ilaikadz dzikr : “dan Kami turunkan Az-Zikr kepadamu.” Yaitu Al-Qur’an. (لِتُبَيِّنَ لِلنَّاسِ) litubayyina linnaas : “agar engkau menerangkan kepada manusia” ini adalah sebab diturunkannya Az-Zikr, karena tugas para rasul adalah sebagai penjelas. Makna ayat: Firman-Nya “dengan membawa keterangan-keterangan dan Az-Zubur.” Kami mengutus mereka para rasul dari kalangan manusia dengan bukti-bukti, hujjah dan dalil yang menunjukkan kewajiban hanya beribadah kepada kami dan meninggalkan peribadatan selain Kami. Az-Zubur yaitu kitab-kitab, kemudian Allah ta’ala berfirman kepada rasul-Nya dan Kami turunkan Az-Zikr kepadamu agar engkau menerangkan kepada manusia apa yang telah diturunkan kepada mereka” ini adalah penegasan akan kenabiannya, dan Firman-Nya “dan agar mereka berpikir” sehingga mereka mengetahui kebenaran apa yang engkau bawa, lalu mereka beriman dan bertaubat kepada Rabb mereka, kemudian mereka selamat dan bahagia. Pelajaran dari ayat: • As-Sunnah tidak bisa diabaikan, karena ia adalah penjelas makna dan hal-hal yang masih global dalam Al-Qur’an."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 44: Al Qur’an disebut Adz Dzikr, Karena di sana disebutkan semua yang dibutuhkan hamba tentang urusan agama maupun dunia. Yakni perintah-perintah, larangan-larangan, aturan dan lain-lain yang terdapat dalam Al Quran. Ayat ini menunjukkan bahwa di antara fungsi As Sunnah adalah menerangkan Al Qur’an, dan bahwa Al Qur’an butuh kepada Sunah Rasulullah shallallahu 'alaihi wa sallam. Ayat ini juga sebagai bantahan terhadap orang-orang yang mengingkari sunnah Nabi shallallahu 'alaihi wa sallam (kaum ingkar sunnah). Sehingga mereka dapat menggali daripadanya berbagai ilmu sesuai kapasitasnya dan sejauh mana mereka memberikan perhatian terhadapnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 44",
    "description": "Para rasul itu kami utus dengan membawa keterangan-keterangan berupa mukjizat yang membuktikan kenabian dan kerasulan mereka. Dan sebagian dari mereka membawa kitab-kitab yang berisi hukum, nasihat, dan aturan yang menjadi pedoman bagi kehidupan kaumnya. Dan kami turunkan adz-dzikr, yakni Al-Qur'an, kepadamu, wahai nabi Muhammad, agar engkau menerangkan kepada umat manusia apa yang telah diturunkan kepada mereka berupa tuntunan dan petunjuk dalam kitab tersebut agar mereka tahu dan mengikuti jalan yang benar dan agar mereka memikirkan hal-hal yang menjadi pelajaran untuk kemaslahatan mereka di dunia dan akhirat. Kaum musyrik mekah menganggap Al-Qur'an tidak lebih dari sekadar sebagai syair yang digubah oleh nabi Muhammad, maka apakah orang yang membuat tipu daya yang jahat seperti itu dan tidak beriman kepada nabi Muhammad dan Al-Qur'an merasa aman dari bencana akibat perbuatan mereka berupa dibenamkannya bumi oleh Allah bersama mereka, sehingga mereka tertimbun hidup-hidup di perut bumi' ataukah mereka merasa aman dari datangnya siksa secara tiba-tiba kepada mereka dari arah yang tidak mereka sadari pada saat mereka tinggal di rumah'."
  }
]