[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "45-47. Apakah orang-orang kafir yang merencanakan berbagai macam tipu daya merasa aman kalau Allah membenamkan mereka ke dalam bumi sebagaimana yang Dia lakukan kepada qarun, atau Dia mendatangkan kepada mereka siksaan di tempat yang tidak mereka duga dan tidak mereka sangka-sangka atau siksaan akan menimpa mereka, sedang mereka itu tengah mondar-mandir dalam perjalanan dan aktivitas mereka? Mereka tidakbisa mendahului Allah dan tidak bisa lolos dariNya serta selamat dari siksaanNya. Sebab Allah maha kuat yang tidak ada sesuatu pun yang melemahkanNYa atau Allah akan menyiksa mereka dengan berkurangnya harta benda mereka dan kebinasaan sebagian mereka, serta berkurangnya buah-buahan, atau dalam ketakutan mereka atas siksaannYa terhadap mereka. Sesungguhnya tuhan kalian sayang terhadap makhluk-makhlukNya dengan kasih sayang yang luas di dunia dan di akhirat mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "45. Apakah orang-orang yang merencanakan makar jahat untuk menghalang-halangi dari jalan Allah merasa aman dari longsor bumi sebagaimana yang menimpa Karun atau ditimpa azab dari arah yang tidak mereka sangka-sangka kedatangannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "45-47. Allah mengingkari makar yang dilakukan orang-orang kafir: “Apakah orang-orang yang membuat makar terhadap Rasulullah dan orang-orang beriman itu merasa aman jika Allah menenggelamkan mereka ke dalam tanah? Atau mereka tertimpa azab secara tiba-tiba Tanpa mereka sadari? Atau Allah membinasakan mereka ketika mereka dalam perjalanan sehingga mereka sama sekali tidak dapat menyelamatkan diri? Atau membinasakan mereka ketika mereka benar-benar takut dan waspada dari turunnya azab? Sungguh Tuhan kalian memiliki kasih sayang terhadap hamba-hamba-Nya sehingga Dia tidak mempercepat turunnya azab bagi mereka.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "45. أَفَأَمِنَ الَّذِينَ مَكَرُوا۟ السَّيِّـَٔاتِ (maka apakah orang-orang yang membuat makar yang jahat itu) Mereka membuat makar untuk menyesatkan manusia dari keimanan kepada Nabi. Yakni mereka membuat makar jahat untuk menyakiti Rasulullah dan para sahabatnya dengan tersembunyi, dan untuk menghancurkan islam dan pemeluknya. أَن يَخْسِفَ اللهُ بِهِمُ(merasa aman (dari bencana) ditenggelamkannya bumi oleh Allah) Sebagaimana Qarun yang ditenggelamkan ke dalam bumi. أَوْ يَأْتِيَهُمُ الْعَذَابُ مِنْ حَيْثُ لَا يَشْعُرُونَ (atau datangnya azab kepada mereka dari tempat yang tidak mereka sadari) Ketika mereka dalam keadaan lalai. Sebagaimana siksaan yang diberikan kepada kaum nabi Luth dan lainnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "45. Apakah orang yang menyusun rencana-rencana tersembunyi yang berakibat buruk seperti menyakiti rasulullah SAW dan sahabat-sahabatnya, berusaha merusak Islam, dan menghindari ajakan kepada Allah, akan aman jika Allah akan menenggelamkan mereka ke dalam bumi layaknya menenggelamkan Qarun, atau mendatangkan kepada mereka azab dengan seketika dimana mereka tidak mengantisipasi hal itu dengan tidak memikirkan itu di benak mereka, sebagaimana yang dilakukan kaum Luth, serta sebagaimana orang-orang musyrik dibinasakan saat perang Badar"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah orang-orang yang membuat tipu daya jahat itu merasa aman} mereka merencanakan tipu daya yang buruk berupa membunuh nabi dan memadamkan cahaya Allah {ketika Allah membenamkan bumi bersama mereka atau datangnya siksa kepada mereka dari arah yang tidak mereka sadari"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "45-47. ini adalah intimidasi dari Allah terhadap orang orang yang kufur, mendustakan dan suka berbuat berbagai jenis maksiat berupa siksaan yang Allah timpakan kepada mereka dalam kelengahan mereka tanpa mereka sadari, baik dengan menimpakan siksaan kepada mereka dari arah atas atau dari bawah mereka dengan cara menenggelamkan bumi atau bentuk lainnya. Atau saat mereka mondar mandir, sibuk, tanpa terbetik datangnya siksaan pada benak mereka. atau manakala mereka dirundung rasa takut oleh siksa. Mereka tidak mampu melumpuhkan Allah dalam setiap kondisi diatas. Mereka itu berada di bawah genggamanNya. Ubun ubun mereka berada di tengahNya. Akan tetapi, Dia Maha pemurah lagi penyayang, tidak menyegerakan siksa pada orang orang yang berbuat maksiat bahkan memberikan penangguhan bagi mereka dan memafkan mereka dan tetap mencurahkan rizki kepada mereka sementara itu, mereka masih saja menyakiti Allah dan mengganggu wali waliNya. Walaupun demikian (sepak terjang mereka) Allah masih membukakan pintu taubat bagi mereka, mengajak mereka untuk meninggalkan perbuatan perbuatan jelek yang membahayakan mereka, dan memberikan janji kepada mereka dengan kemuliaan yang paling tinggi dan ampunan atas dosa dosa yang berasal dari mereka. Hendaknya orang orang jahat malu kepada Rabbnya, ketika nikmat nikmatNya senantiasa terkucurkan pada dirinya setiap (detik), sedangkan maksiat maksiatnya selalu mengarah kepada Rabbnya setiap waktu. Hendaknya dia mengetahui bahwasannya Allah sedang memberikan penangguhan, bukan mengesampingkannya. Bila Allah mulai menyiksa orang yang bermaksiat, maka Dia menyiksanya dengan siksaan Dzat yang Maha perkasa lagi Mahakuasa. Mestinya dia bertaubat kepadaNya dan kembali dalam seluruh urusannya kepadaNya. Sesungguhnya Dia Maha Pemurah lagi Maha Penyayang. Bersegeralah, bersegeralah menjemput rahmat Allah yang luas dan kebaikanNya yang merata, dan meniti jalan jalan yang menghubungkan kepada kemurahan Allah Rabb yang Maha Pengasih. Ketahuilah, itu adalah ketakwaan kepadaNya dan mengamalkan amalan yang Dia cintai dan ridhai."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (مَكَرُواْ ٱلسَّيِّ‍َٔاتِ) makarus sayyi`aat : “mereka membuat tipu daya yang jahat” mereka membuat makar-makar yang jahat, Sayyiaat adalah sifat untuk makar yang dibenci. Makna ayat: Makna ayat: Konteks masih mengenai ancaman kepada kaum musyrikin serta peringatan kepada mereka, agar mereka kembali dengan taubat dari kesyirikan dan penentangan kenabian, kebangkitan, dan pembalasan. Allah ta’ala berfirman : “Maka apakah orang yang berbuat makar” makar-makar “tipu daya yang jahat” seperti percobaan pembunuhan Nabi shallahu ‘alaihi wa sallam, syirik, pengingkaran kenabian, kebangkitan, serta menzalimi dan menyiksa kaum mukminin, mereka aman “dari bencana dibenamkannya bumi oleh Allah” dari bawah mereka sehingga mereka tenggelam di dasarnya, “atau terhadap datangnya siksa kepada mereka dari arah yang tidak mereka sadari.” Azab yang tidak mereka duga seperti angin kencang yang menerbangkan mereka, wabah yang menyelimuti, atau paceklik yang menghilangkan harta mereka. Pelajaran dari ayat: • Haramnya merasa aman dari makar Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 45: Dalam ayat ini, Allah Ta’ala menakut-nakuti orang-orang kafir, orang-orang yang mendustakan dan para pelaku maksiat, bahwa bisa saja mereka ditimpa azab secara tiba-tiba tanpa disadari, dari atas atau dari bawah mereka, atau ketika mereka sedang dalam perjalanan atau sedang sibuk, dan mereka tidak dapat lolos dari azab Allah ketika datang, bahkan mereka dalam genggaman-Nya. Terhadap Nabi shallallahu 'alaihi wa sallam ketika berada di Darunnadwah, dengan hendak mengikatnya, membunuhnya atau mengusirnya sebagaimana yang disebutkan dalam surah Al Anfal: 30. Seperti halnya Qarun. Mereka (tokoh-tokoh kafir Quraisy) pun telah dibinasakan Allah dalam perang Badar."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 45",
    "description": "Kaum musyrik mekah menganggap Al-Qur'an tidak lebih dari sekadar sebagai syair yang digubah oleh nabi Muhammad, maka apakah orang yang membuat tipu daya yang jahat seperti itu dan tidak beriman kepada nabi Muhammad dan Al-Qur'an merasa aman dari bencana akibat perbuatan mereka berupa dibenamkannya bumi oleh Allah bersama mereka, sehingga mereka tertimbun hidup-hidup di perut bumi' ataukah mereka merasa aman dari datangnya siksa secara tiba-tiba kepada mereka dari arah yang tidak mereka sadari pada saat mereka tinggal di rumah'atau-kah mereka merasa aman apabila Allah mengazab mereka dengan siksa yang tidak mereka sangka pada waktu mereka dalam perjalanan meninggalkan rumah' jika Allah menghendaki niscaya azab itu akan menimpa mereka sehingga mereka tidak akan berdaya menolak-Nya dengan cara apa pun."
  }
]