[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "45-47. Apakah orang-orang kafir yang merencanakan berbagai macam tipu daya merasa aman kalau Allah membenamkan mereka ke dalam bumi sebagaimana yang Dia lakukan kepada qarun, atau Dia mendatangkan kepada mereka siksaan di tempat yang tidak mereka duga dan tidak mereka sangka-sangka atau siksaan akan menimpa mereka, sedang mereka itu tengah mondar-mandir dalam perjalanan dan aktivitas mereka? Mereka tidakbisa mendahului Allah dan tidak bisa lolos dariNya serta selamat dari siksaanNya. Sebab Allah maha kuat yang tidak ada sesuatu pun yang melemahkanNYa atau Allah akan menyiksa mereka dengan berkurangnya harta benda mereka dan kebinasaan sebagian mereka, serta berkurangnya buah-buahan, atau dalam ketakutan mereka atas siksaannYa terhadap mereka. Sesungguhnya tuhan kalian sayang terhadap makhluk-makhlukNya dengan kasih sayang yang luas di dunia dan di akhirat mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "46. Atau azab menimpa mereka saat mereka melakukan perjalanan dan saat berusaha mencari penghidupan mereka, dan mereka tidak akan lolos maupun selamat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "46. أَوْ يَأْخُذَهُمْ فِى تَقَلُّبِهِمْ (atau Allah mengazab mereka diwaktu mereka dalam perjalanan) Yakni saat mereka bepergian dan berdagang, saat mereka datang atau pergi, baik itu di malam atau siang hari. فَمَا هُم بِمُعْجِزِينَ(maka sekali-kali mereka tidak dapat menolak (azab itu)) Yakni mereka tidak akan bisa lolos atau menghindar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "46. Ataukah mereka akan ditimpa azab di tengah perjalanan mereka untuk berdagang atau kegiatan lainnya, maka mereka itu tidak akan luput dan tidak akan bisa melarikan diri serta terlindungi dari hukuman Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Atau Allah mengazab mereka pada waktu perjalanan mereka} waktu perjalanan dan waktu sibuk mereka untuk mencari sumber kehidupan {sehingga mereka tidak bisa menolak (azab itu)} membuat Allah lengah bagaimanapun keadaan mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "45-47. ini adalah intimidasi dari Allah terhadap orang orang yang kufur, mendustakan dan suka berbuat berbagai jenis maksiat berupa siksaan yang Allah timpakan kepada mereka dalam kelengahan mereka tanpa mereka sadari, baik dengan menimpakan siksaan kepada mereka dari arah atas atau dari bawah mereka dengan cara menenggelamkan bumi atau bentuk lainnya. Atau saat mereka mondar mandir, sibuk, tanpa terbetik datangnya siksaan pada benak mereka. atau manakala mereka dirundung rasa takut oleh siksa. Mereka tidak mampu melumpuhkan Allah dalam setiap kondisi diatas. Mereka itu berada di bawah genggamanNya. Ubun ubun mereka berada di tengahNya. Akan tetapi, Dia Maha pemurah lagi penyayang, tidak menyegerakan siksa pada orang orang yang berbuat maksiat bahkan memberikan penangguhan bagi mereka dan memafkan mereka dan tetap mencurahkan rizki kepada mereka sementara itu, mereka masih saja menyakiti Allah dan mengganggu wali waliNya. Walaupun demikian (sepak terjang mereka) Allah masih membukakan pintu taubat bagi mereka, mengajak mereka untuk meninggalkan perbuatan perbuatan jelek yang membahayakan mereka, dan memberikan janji kepada mereka dengan kemuliaan yang paling tinggi dan ampunan atas dosa dosa yang berasal dari mereka. Hendaknya orang orang jahat malu kepada Rabbnya, ketika nikmat nikmatNya senantiasa terkucurkan pada dirinya setiap (detik), sedangkan maksiat maksiatnya selalu mengarah kepada Rabbnya setiap waktu. Hendaknya dia mengetahui bahwasannya Allah sedang memberikan penangguhan, bukan mengesampingkannya. Bila Allah mulai menyiksa orang yang bermaksiat, maka Dia menyiksanya dengan siksaan Dzat yang Maha perkasa lagi Mahakuasa. Mestinya dia bertaubat kepadaNya dan kembali dalam seluruh urusannya kepadaNya. Sesungguhnya Dia Maha Pemurah lagi Maha Penyayang. Bersegeralah, bersegeralah menjemput rahmat Allah yang luas dan kebaikanNya yang merata, dan meniti jalan jalan yang menghubungkan kepada kemurahan Allah Rabb yang Maha Pengasih. Ketahuilah, itu adalah ketakwaan kepadaNya dan mengamalkan amalan yang Dia cintai dan ridhai."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (فِي تَقَلُّبِهِمۡ) fii taqallubihim : “dalam perjalanan” yaitu pada suatu daerah sebagai musafir untuk berdagang atau yang lain. Makna ayat: Firman-Nya “atau Allah mengazab mereka pada waktu mereka dalam perjalanan” untuk perdagangan dan safar, pulang dan pergi dari negeri ke negeri lain. “sehingga mereka tidak berdaya menolak.” Tidak mampu menolak Allah ta’ala, seandainya Dia menyiksa mereka dan menghancurkan mereka"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 46",
    "description": "Atau-kah mereka merasa aman apabila Allah mengazab mereka dengan siksa yang tidak mereka sangka pada waktu mereka dalam perjalanan meninggalkan rumah' jika Allah menghendaki niscaya azab itu akan menimpa mereka sehingga mereka tidak akan berdaya menolak-Nya dengan cara apa pun. Atau-kah mereka merasa aman jika Allah mengazab mereka dengan azab yang diturunkan secara berangsur-angsur sampai mereka binasa' maka Allah tidak segera menurunkan azab-azab itu guna memberi mereka kesempatan untuk sadar dan bertobat, karena sungguh, tuhanmu yang mahakuasa atas segala sesuatu adalah maha pengasih, maha penyayang."
  }
]