[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah orang-orang kafir itu buta mata, sehingga mereka tidak bisa melihat segala sesuatu yang Allah ciptakan yang memiliki bayangan, seperi gunung-gunung dan pepohonan, terkadang bayangannya condong ke arah kanan dan kadang ke kiri, lantaran mengikuti pergerakan matahari diwaktu siang hari dan perjalanan bulan di malam hari, semuanya tunduk pada keagungan dan kebesaran tuhannya, dan semua berada di bawah pengendalian, dan pengaturan dan kekuasaanNya?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "48. Mengapa orang-orang yang mendustakan itu tidak melihat dengan mata perenungan kepada makhluk-makhluk Allah, bayangannya bergerak ke kanan dan ke kiri mengikuti gerakan matahari dan perjalanannya siang hari dan gerakan rembulan di malam hari, makhluk-makhluk tersebut tunduk kepada Rabbnya seraya bersujud dengan sujud hakiki dalam kondisi hina."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "48. Apakah mereka tidak mengambil pelajaran dari makhluk-makhluk yang lain. Tidaklah segala benda seperti pegunungan, pepohonan, dan bangunan yang memiliki bayangan yang condong ke sisi kanan atau kiri, melainkan bayangan itu bersujud kepada Allah dengan penuh ketundukan dan kepatuhan terhadap perintah dan ketetapan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "48. أَوَلَمْ يَرَوْا۟ إِلَىٰ مَا خَلَقَ اللهُ مِن شَىْءٍ (Dan apakah mereka tidak memperhatikan segala sesuatu yang telah diciptakan Allah) Seperti pegunungan, pepohonan, dan lain sebagainya. يَتَفَيَّؤُا۟ ظِلٰلُهُۥ(yang bayangannya berbolak-balik) Condong dari satu sisi ke sisi lain; di awal siang bayangan itu panjang dan menyusut sedikit demi sedikit, kemudian di akhir siang bayangan itu berada di sisi yang lain. عَنِ الْيَمِينِ وَالشَّمَآئِلِ(ke kanan dan ke kiri) Yakni bergerak dari satu sisi ke sisi lainnya. سُجَّدًا لِّلّٰهِ(dalam keadaan sujud kepada Allah) Yakni benda-benda ini diciptakan untuk ketaatan sesuai dengan yang Allah kehendaki. وَهُمْ دٰخِرُونَ(sedang mereka berendah diri) Yakni bayangan ini tunduk dan merendahkan diri kepada Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "48. Apakah orang-orang kafir itu tidak merenungi apa ciptaan Allah yang memiliki bayang-bayang seperti gunung, pepohonan dan lain-lain. Bayang-bayang benda itu condong dari satu sisi ke sisi lainnya atau berpindah dari kanan ke kiri karena tunduk kepada hukum dan perintah Allah. Bayang-bayang itu tunduk dan merendah sesuai kehendakNya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah mereka tidak memperhatikan segala sesuatu yang diciptakan Allah, bayang-bayang mereka berbolak-balik} bayangannya berpindah dari satu sisi ke sisi lain {ke kanan dan ke kiri dalam keadaan sujud kepada Allah, dan mereka berendah diri} berendah diri"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "48. Allah berfirman “dan apakah mereka tidak memperhatikan” yaitu orang orang yang dilanda keraguan tentang keesan Rabb mereka, dan keagungan serta kesempurnaanNya, ”kepada seluruh makhlukNya\" yakni kepada seluruh makhluk ciptaan-Nya dan bagaimana bayangannya berbolak balik, ”ke kanan dan ke kiri dalam keadaan sujud kepada Allah” maksudnya semua bersujud kepada Rabbnya, tunduk kepada keagungan dan kebesaranNya, ”sedang mereka berendah diri” maksudnya, dalam keadaan hina dan dina, berada di bawah pengendalian, pengaturan, dan kekuatanNya. tiada seorangpun dari mereka kecuali ubun ubunnya berada di tangan Allah, dan pengaturannya berada di sisiNya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (يَتَفَيَّؤُاْ ظِلَٰلُهُۥ) yatafayya`u zhilaaluh : “bayang-bayangnya berbolak-balik” miring dari sisi ke sisi yang lain. (سُجَّدٗا لِّلَّهِ) sujjadal lillaah : “dalam keadaan sujud kepada Allah” tunduk kepada Allah, seperti yang Dia perintahkan kepada mereka. (دَٰخِرُونَ) daakhiruun : “dan mereka bersikap rendah hati.” Kecil dan rendah. Makna ayat: Firman-Nya “dan apakah mereka tidak memperhatikan suatu benda yang diciptakan Allah” seperti pohon, gunung, manusia, dan hewan, “bayang-bayangnya berbolak-balik” pagi dan sore hari “ke kanan dan ke kiri” syamaa`il jamak dari syimaal (kiri) “sujud kepada Allah” tunduk beserta bayangan mereka “dan mereka bersikap rendah hati.” Rendah dan kecil. Apakah ini tidak cukup untuk menjadi tanda atas tunduknya dan merendahnya mereka kepada Allah, kemudian mereka beriman, menyembah-Nya, serta mentauhidkan-Nya, sehingga mereka selamat dari azab-Nya dan berbahagia dengan rahmat-Nya. Pelajaran dari ayat: • Segala sesuatu sujud kepada Allah, yaitu merendah kepada perintah-Nya. Akan tetapi hanya sujud karena ketaatanlah yang mendapatkan pahala, adapun sujud iradiyah maka tidak diberi balasan dan dihukum. • Keutamaan sujud karena ketaatan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 48: Yakni orang-orang yang meragukan keesaan-Nya, keagungan-Nya dan kesempurnaan-Nya. Yang memiliki bayangan seperti pohon dan gunung."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 48",
    "description": "Dan kaum musyrik tetap mengingkari kerasulan nabi Muhammad dan menolak ayat-ayat yang beliau sampaikan, meski mereka telah menyaksikan bukti-bukti kekuasaan Allah. Apakah mereka tidak memperhatikan suatu benda yang diciptakan Allah, baik yang besar maupun kecil, yang bergerak maupun diam, yang hidup maupun mati; bayang-bayangnya berbolak-balik ke kanan dan ke kiri, semua dalam keadaan sujud dan tunduk kepada Allah. Mereka patuh terhadap hukum-hukum alam yang telah ditetapkan-Nya, dan mereka bersikap rendah hati menerima ketetapan itu. Tidakkah mereka memperhatikan sehingga mereka sadar dan mau beriman kepada nabi Muhammad'dan tidakkah mereka memperhatikan pula bahwa segala apa yang ada di langit dan di bumi hanya bersujud kepada Allah' yaitu semua makhluk yang hidup dan bergerak di bumi ini, dan demikian juga para malaikat, dan mereka (malaikat) tidak pernah menyombongkan diri dan membangkang perintah Allah."
  }
]