[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kepada Allah semata bersujud segala yang ada di langit dan semua yang ada di bumi dan malaikat juga bersujud kepada Allah, dan mereka tidak sombong untuk beribadah kepadaNya, Allah menyebut malaikat secara khusus setelah lafazh yang umum, karena keutamaan, kemuliaan, dan banyaknya ibadah mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "49. Hanya kepada Allah semata bersujud segala apa yang ada di langit dan segala apa yang ada di bumi, yaitu makhluk-makhluk yang melata. Hanya kepada Allah semata bersujud para Malaikat, mereka tidak menyombongkan diri dari ibadah dan ketaatan kepada Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "49-50. Kepada Allah senantiasa bersujud segala yang ada pada tujuh langit dan segala yang ada ada di muka bumi berupa makhluk-makhluk dan para malaikat semuanya. Mereka sama sekali tidak merasa enggan untuk menyembah dan mentaati Allah; Bahkan mereka takut kepada Allah yang ada di atas mereka dengan Dzat dan kesempurnaan sifat-Nya. Mereka senantiasa menjalankan apa yang diperintahkan Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "49. وَلِلّٰهِ يَسْجُدُ مَا فِى السَّمٰوٰتِ وَمَا فِى الْأَرْضِ مِن دَآبَّةٍ (Dan kepada Allah sajalah bersujud segala apa yang berada di langit dan semua makhluk yang melata di bumi) Yakni hanya kepada-Nya tunduk dan patuh segala yang ada di langit dan seluruh makhluk melata di bumi. وَالْمَلٰٓئِكَةُ وَهُمْ لَا يَسْتَكْبِرُونَ(dan (juga) para ma]aikat, sedang mereka (malaikat) tidak menyombongkan diri) Yakni tidak enggan untuk menyembah dan bersujud kepada Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "49. Dan hanya kepada Allahlah segala sesuatu di langit dan bumi itu dari makhluk yang melata di bumi dan malaikat yang selalu bersujud dan beribadah itu tunduk dan patuh. Mereka itu tidak enggan untuk taat, beribadah dan bersujud kepadaNya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Hanya kepada Allah segala sesuatu yang ada di langit dan yang ada di bumi bersujud, yaitu semua makhluk yang bergerak dan juga para malaikat, dan mereka tidak menyombongkan diri"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "49. “dan kepada Allah sajalah bersujud segala apa yang berada di langit dan semua makhluk yang melata di bumi” dari bangsa makhluk yang bisa berkomunikasi maupun yang tidak bisa berbicara “dan juga para malaikat” yang mulia. Allah menyebutkan mereka secara khusus setelah konteks yang umum, lantaran keutamaan dan kemuliaan serta tigginya intensitas ibadah mereka. Karena itu, Allah berfirman “sedang mereka (malaikat) tidak menyombongkan diri” dari beribadah kepadaNya , meski mereka berjumlah banyak, berakhlak agung dan berkekuatan (penuh)"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat: Firman-Nya “dan segala apa yang ada di langit dan apa yang ada di bumi berupa semua makhluk yang bergerak, hanya sujud kepada Allah” mereka hanya bersujud kepada Allah, tidak kepada yang lain. Yaitu tunduk dan taat kepada perintah Allah ta’ala seperti hidup, mati, sehat, sakit, kebaikan, atau yang lain. “berupa semua makhluk yang bergerak” segala sesuatu yang berjalan di atas muka bumi “dan malaikat” mereka bersujud meskipun mereka mulia “dan mereka tidak menyombongkan diri.” Dari beribadah kepada Rabb mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 49: Perlu diketahui, bahwa sujudnya semua makhluk kepada Allah Ta’ala terbagi menjadi dua: pertama, sujud terpaksa dan menunjukkan kepada sifat sempurna yang dimiliki-Nya. Sujud ini umum dilakukan semua makhluk, baik yang mukmin maupun yang kafir, orang yang baik maupun orang yang jahat, manusia mapun hewan dan lainnya. Kedua, sujud atas dasar pilihan. Sujud ini hanya khusus dilakukan oleh wali-wali-Nya dan hamba-hamba-Nya yang mukmin, baik malaikat, orang-orang beriman maupun makhluk lainnya. Disebutkan para malaikat setelah keumuman lafaz karena keutamaan dan kemuliaan mereka, serta banyaknya mereka beribadah. Dari beribadah kepada-Nya meskipun jumlah mereka banyak dan memiliki kekuatan yang besar."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 49",
    "description": "Dan tidakkah mereka memperhatikan pula bahwa segala apa yang ada di langit dan di bumi hanya bersujud kepada Allah' yaitu semua makhluk yang hidup dan bergerak di bumi ini, dan demikian juga para malaikat, dan mereka (malaikat) tidak pernah menyombongkan diri dan membangkang perintah Allah. Mereka, para malaikat, selalu takut kepada tuhan yang kekuasaannya berada di atas kekuasaan mereka, dan mereka senantiasa melaksanakan apa saja yang diperintahkan. Tidak pernah sekali pun mereka menyepelekan apalagi melanggarnya."
  }
]