[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan binatang-binatang ternak, yaitu unta, sapi dan kambing, Allah menciptakannya bagi kalain (wahai sekalain manusia), dan Dia menjadikan pada bulu domba dan bulu unta sumber kehangatan dan manfaat-manfaat lainnya yang berasal dari air susu, kulit dan sebagi tunggangan, dan sebagian kalian konsumsi."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Allah menciptakan hewan-hewan ternak berupa unta, sapi dan domba untuk kemaslahatan kalian wahai manusia. Di antara kemaslahatan tersebut adalah menggunakan wol dan bulunya untuk pakaian hangat, di samping kemaslahatan lain pada susu, kulit, punggung dan dagingnya yang kalian makan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "5-6. Allah memberi karunia kepada hamba-hamba-Nya berupa apa yang telah Dia ciptakan bagi mereka seperti unta, sapi, kambing, domba, dan segala hal yang dapat mereka manfaatkan darinya. Mereka dapat membuat pakaian dan karpet dari bulu dan rambut hewan-hewan tersebut, dapat meminum air susunya dan memakan dagingnya; mereka juga dapat menikmati keindahan ketika mereka kembali memasukkan hewan-hewan tersebut ke dalam kandangnya dari tempat penggembalaan pada sore hari, dan ketika mereka mengeluarkannya pada pagi hari."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. وَالْأَنْعٰمَ خَلَقَهَا ۗ (Dan Dia telah menciptakan binatang ternak) Yakni unta, sapi, dan kambing. لَكُمْ فِيهَا دِفْءٌ(padanya ada (bulu) yang menghangatkan) Yaitu apa yang dipakai untuk menghangatkan badan seperti bulu domba, bulu unta, dan bulu kambing. وَمَنٰفِعُ(dan berbagai-bagai manfaat) Seperti untuk diambil air susunya, ditunggangi, diternakkan, dipakai untuk mengolah tanah perkebunan, dan lain sebagainya. وَمِنْهَا تَأْكُلُونَ(dan sebahagiannya kamu makan) Dari daging dan lemaknya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Suhu dingin telah membunuh puluhan manusia di kawasan timur Eropa, sedangkan suhu panas sampai -35 derajat. Seorang mukmin jika tinggal di daerah dingin , atau mendengar kabar tentangnya, ia akan ingat firman firman Allah : { وَالْأَنْعَامَ خَلَقَهَا ۗ لَكُمْ فِيهَا دِفْءٌ } \"Dan Dia telah menciptakan binatang ternak untuk kamu; padanya ada (bulu) yang menghangatkan\" ayat ini menjelaskan nikmat hangat dari Allah, sedangkan nikmat wiqoyah dan panas juga disebutkan dalam surah ini pada bagian akhir, ALlah berfirman : { وَجَعَلَ لَكُمْ سَرَابِيلَ تَقِيكُمُ الْحَرَّ } \"dan Dia jadikan bagimu pakaian yang memeliharamu dari panas\" [ An-Nahl :81 ]. maka tatkala perlindungan dari dingin termasuk inti dari kenikmatan disebutkan pada bagian awal surah, Allah kemudian menyebutkan penyempurna nikmat-Nya dengan perlindungan dari panas."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Dia telah menciptakan binatang ternak untuk kamu seperti unta, sapi dan domba. Dari ternak itu ada bulu yang dapat menghangatkan dan memberi berbagai-bagai manfaat seperti sebagai kendaraan, dan juga dapat kamu makan daging dan lemaknya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia telah menciptakan hewan ternak untuk kalian. Pada hewan itu ada (bulu) yang menghangatkan} sesuatu yang bisa kalian gunakan untuk menghangatkan berupa bulu domba, bulu unta dan bulu-bulu hewan ternak lain {dan berbagai manfaat} dan hal-hal yang bisa dimanfaatkan berupa susu, anak-anaknya, kendaraan, pembawa barang dan lain-lain {serta sebagiannya kalian makan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5. “dan Dia telah menciptakan binatang ternak untuk kamu” maksudnya bagi kalian dan untuk kemanfaatan dan kebaikan kalian. Diantara bentuk kegunaannya yang penting, ”padanya ada (bulu) yang menghangatkan” kalian membuat pakaian pakaian, permadani rumah yang (bahan bahannya) berasal dari bulu bulu domba, kapas, rambut dan kulit kulitnya “dan” bagi kalian “berbagai jenis manfaat” yang lainnya “dan sebagiannya kamu makan”"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (دِفۡءٞ وَمَنَٰفِعُ) dif’uw wa manaafi’ : bisa digunakan untuk menghangatkan diri dan kebutuhan seperti, madu, susu, daging, dan dikendarai. Makna ayat: Firman-Nya “Dan hewan ternak telah Dia ciptakan untuk kamu padanya ada bulu yang menghangatkan dan berbagai manfaat, dan sebagiannya kamu makan.” Ini adalah tanda-tanda kekuasaan ilahi, ilmu, hikmah, dan kasih sayang yang mengharuskan untuk beribadah kepada-Nya dan meninggalkan peribadahan selain-Nya. Hewan ternak yaitu, unta, sapi, dan kambing telah Allah ta’ala ciptakan untuk keturunan Adam dan tidak menciptakannya untuk selain mereka. “padanya (bulu) yang menghangatkan” darinya kalian membuat pakaian, kasur, dan selimut dari bulu domba, dan bulu unta, dan padanya pula berbagai manfaat, seperti susu, mentega, minyak lemak, keju, dan peternakan sebagaimana ia selalu melahirkan setiap tahunnya, sehingga mereka mendapat manfaat dari anak-anaknya. Dan darinya kalian makan daging yang bermacam-macam, maka Yang Memberi Nikmat wajib untuk disembah, bukan selain-Nya dari kalangan makhluk."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 5: Yaitu unta, sapi, dan kambing. Untuk manfaat dan maslahat kamu, di antaranya kamu memperoleh kehangatan dari bulunya, dan memperoleh manfaat lainnya. Bisa diternakkan, diambil susunya, dan ditunggangi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 5",
    "description": "Dan tidak saja menciptakan langit, bumi, dan manusia, hewan ternak juga telah diciptakan-Nya, untuk kamu padanya ada bulu dan kulit yang dapat kamu jadikan pakaian yang menghangatkan badan kamu dan berbagai manfaat lain yang dapat kamu ambil dalam kehidupan kamu, dan sebagian dari-Nya juga dapat kamu makan. Dan selain manfaat-manfaat tersebut kamu juga dapat memperoleh keindahan padanya, yakni pada hewan ternak itu, ketika kamu membawanya kembali ke kandang pada sore hari dan ketika kamu melepaskannya ke tempat penggembalaan pada pagi hari."
  }
]