[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah berfirman kepada hamba-hambaNYa, ”janganlah kalain menyembah dua sembahan. sesungguhnya tuhan sesembahan kalian hanyalah tuahn yang maha tunggal maka takutlah kepadaKu, tidak kepada selainKU.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "51. Allah -Subḥānahu- berfirman kepada semua hamba-Nya, “Jangan kalian mengangkat dua sesembahan, karena sesembahan yang benar hanya satu, tidak ada yang kedua dan tidak ada sekutu bagi-Nya, hanya kepada-Ku hendaknya kalian semua takut dan jangan takut kepada selain-Ku.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "51-52. Allah melarang seluruh hamba-Nya menyembah dua Tuhan atau lebih, karena Tuhan yang berhak disembah hanyalah Allah Semata. Kemudian Allah memerintahkan mereka agar hanya takut kepada-Nya, karena Dialah yang memiliki seluruh kerajaan tujuh langit dan bumi, dan hanya bagi-Nya semua ibadah. Kemudian Allah mengingkari orang-orang kafir: “Apakah kalian takut kepada selain Allah?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "51. وَقَالَ اللهُ لَا تَتَّخِذُوٓا۟ إِلٰهَيْنِ اثْنَيْنِ ۖ إِنَّمَا هُوَ إِلٰهٌ وٰحِدٌ (Allah berfirman: “Janganlah kamu menyembah dua tuhan; sesungguhnya Dialah Tuhan Yang Maha Esa) Allah melarang penyembahan terhadap dua tuhan, seperti yang dilakukan oleh orang-orang yang menyembah tuhan cahaya dan tuhan kegelapan. Kemudian Allah menjelaskan bahwa tuhan hanya ada satu yaitu Allah. فَإِيّٰىَ فَارْهَبُونِ(maka hendaklah kepada-Ku saja kamu takut) Yakni jika kalian takut terhadap sesuatu maka takutlah kalian terhadap-Ku."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "51. Allah berfirman, seraya mencegah kesyirikan: “Janganlah kalian mengambil dua Tuhan, sebagaimana dua Tuhan yang mereka ucapkan bahwa ada Tuhan yang menguasai cahaya dan Tuhan yang menguasai kegelapan. Sesungguhnya Tuhan itu satu, tidak ada sekutu bagiNya. Maka takutlah hanya kepadaKu, bukan selainKu, serta waspadalah terhadap siksaKu”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah berfirman,“Janganlah kalian menyembah} Janganlah kalian menyembah {dua tuhan. Sesungguhnya hanya Dialah Tuhan Yang Maha Esa. Maka hendaklah kepadaKu saja kalian takut”} kalian takut"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "51. Allah memerintahkan (para makhluk) untuk beribadah kepadaNya saja, tiada sekutu bagiNya. Dia menunjukan bukti petunjuk dengan kemampuanNya mencurahkan kenikmatan sendirian (tanpa bantuan orang lain) dan (keesaanNya). Lalu Allah berfirman, ”janganlah kamu menyembah dua tuhan” maksudnya engkau menjadikan sekutu bagiNya dalam uluhiyahNya padahal, ”sesunguhnya Dialah tuhanmu yang Maha Esa” esa dalam sifat sifat keagunganNya dan tunggal dengan semua perbuatanNya. Sebagaimana Dia Esa dalam DzatNya, nama nama dan sifat sifat serta perbuatan perbuatanNya, maka esakanlah Dia dalam ibadah. Karena itu, Allah berfirman ”maka hendaklah kepadaKu saja kamu takut” maksudnya, takutlah kepadaKu, taatilah perintahKu, jauhilah laranganKu, tanpa menyekutukanKu dengan suatu makhluk pun, karena ia semuanya adalah makhlukku."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (لَا تَتَّخِذُوٓاْ إِلَٰهَيۡنِ) laa tattakhidzuu ilaahain : “janganlah kamu menyembah dua tuhan” kalian menyembah keduanya, karena kalian tidak memiliki tuhan kecuali hanya satu. Makna ayat: Setelah menegakkan hujjah atas kebenaran tauhid dan kebatilan syirik, Allah ta’ala mengabarkan bahwa Rabb mereka adalah pemilik segala sesuatu, Dia berfirman : “Wahai manusia, “Janganlah kamu menyembah dua tuhan” maka lafaz “dua” adalah penegasan atas kata “dua tuhan”, yaitu janganlah kalian menyembah dua tuhan, namun sembahlah satu tuhan yaitu Allah, karena tidak ada Tuhan yang berhak disembah kecuali Dia. Bagaimana kalian menyembah dua Tuhan, sedangkan Dia adalah “Dia-lah Tuhan Yang Maha Esa” tidak ada yang lain, Dia-lah Allah Yang Maha Pencipta, Maha Pemberi Rezeki, dan Maha Pemilik. Selain-Nya adalah makhluk-Nya, bagaimana kalian menyamakan-Nya dan menyembah tuhan bersama-Nya. Firman-Nya “hanya kepada Aku sajalah kamu takut” takutlah hanya kepada-Ku, jangan kalian takut kepada selain-Ku, karena di Tangan-Ku lah segala sesuatu dan yang selain-Ku tidak memiliki apapun. Aku-lah Yang Maha Menghidupkan, Yang Maha Mematikan, Yang Memberi Manfaat dan Yang Maha Pemberi keburukan. Allah mencela orang-orang yang takut kepada selain-Nya subhanahu wa ta’ala yang tidak pantas untuk ditakuti karena kelemahannya serta ketidak mampuannya untuk memberikan manfaat dan mudharat. Pelajaran dari ayat: • Penegasan tauhid dengan mempersembahkan ibadah hanya kepada Allah ta’ala. • Wajib takut kepada Allah, bukan kepada selain-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 51: Di ayat ini, Allah Subhaanahu wa Ta'aala memerintahkan untuk beribadah hanya kepada-Nya, dan Dia menguatkan perintah-Nya itu dengan sendiri-Nya Dia memberikan nikmat. Oleh karena Dia Mahaesa dalam zat-Nya, sifat-Nya, nama-Nya dan perbuatan-Nya, maka beribadahlah hanya kepada-Nya. Yakni takutlah kepada-Ku saja, kerjakanlah perintah-Ku, dan jauhilah larangan-Ku dengan tanpa menyekutukan-Ku dengan suatu makhluk pun, karena semuanya milik Allah Ta’ala."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 51",
    "description": "Bukti-bukti ini menunjukkan betapa Allah mahakuasa dan maha esa, tidak ada sekutu bagi-Nya. Dan Allah memperingatkan manusia untuk mengesakan-Nya dengan berfirman, janganlah sekali-kali kamu menyembah dua tuhan dengan menyekutukan Allah dengan yang lain. Ketahuilah bahwa hanyalah dia tuhan yang hak dan maha esa dalam zat, sifat, dan perbuatan-Nya. Maka hendaklah kepada-ku saja kamu takut karena hanya aku yang dapat memberi kamu kebaikan dan pertolongan. Janganlah kamu takut kepada yang lain, seperti berhalaberhala yang kamu sembah, karena mereka tidak berdaya menyelamatkan kamu dari azab-ku. Dan ketahuilah, begitu besar kekuasaan Allah atas alam semesta. Milik-Nya meliputi segala apa yang ada di langit dan di bumi, yang kamu ketahui maupun tidak, yang hidup maupun mati, yang besar maupun kecil. Dan hanya kepada-Nyalah kamu beribadah dan menyatakan ketaatan selama-lamanya. Mengapa kamu mesti takut kepada selain Allah, padahal kamu sudah menyaksikan tanda-tanda kekuasaan-Nya'."
  }
]