[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan milik Allah lah semua yang ada di langit dan dibumi sebagai ciptaan, milik dan hambaNya. Dan baginya semata peribadahan, ketaatan dan keikhlasan secara teus-menerus. Apakah pantas bagi kalian untuk takut kepada selain Allah dan menyembahnya?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "52. Hanya kepunyaan Allah semata segala yang di langit dan yang ada di bumi, Dia lah Pencipta, Pemilik dan Pengaturnya. Hanya untuk-Nya semata ketaatan, ketundukan, keikhlasan sebagai hak yang tetap selama-lamanya. Apakah kalian takut kepada selain Allah? Jangan, akan tetapi takutlah kepada Allah saja."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "52. وَلَهُ الدِّينُ وَاصِبًا ۚ (dan untuk-Nya-lah ketaatan itu selama-lamanya) Yakni selalu dan selama-lamanya. Makna (الدين) yakni ketaatan dan keikhlasan. Tidak ada sesuatu yang ditaati kecuali ketaatan itu akan terhenti dengan kehancuran atau kematian sesuatu tersebut, kecuali Allah yang ketaatan-Nya akan terus-menerus bagi-Nya. أَفَغَيْرَ اللهِ تَتَّقُونَ(Maka mengapa kamu bertakwa kepada selain Allah?) Yakni apakan kalian takut kepada selain Allah yang diklaim sebagai tuhan dan nantinya akan hancur? Takutlah kalian kepada Allah semata yang ketaatan akan selama-lamanya untuk-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "52. Segala sesuatu di langit dan bumi berupa kerajaan, makhluk dan aturan itu hanya milik Allah SWT. Dan hanya kepadaNyalah ketaatan dan keikhlashan itu senantiasa dipersembahkan. Apakah kalian tetap takut kepada selain Allah yang bahkan tidak memberi manfaat dan mahdharat?!"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Hanya milikNya segala sesuatu yang ada di langit dan di bumi serta hanya kepadaNya ketaatan} dan hanya kepada Allah ketaatan dan keikhlasan {selamanya} selamanya {Mengapa kepada selain Allah kalian takut} kalian takut"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "52. “dan kepunyaanNyalah segala sesuatu yang ada di langit dan yang ada di bumi, dan untukNya lah ketaatan itu selama lamanya” maksudnya agama, ibadah, perendahan diri di seluruh waktu adalah bagi Allah semata. Kewajiban para makhluk untuk memurnikannya bagi Allah, dan tenggelam dalam berubudiyah kepadaNya “maka mengapa kamu bertakwa kepada selain Allah” dari kalangan penghuni bumi atau langit. Sesungguhnya mereka itu tidak memegang kendali bahaya dan kemanfaatan bagi kalian. Allah lah satu satunya Dzat yang memberi dan mencurahkan kebaikan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (وَلَهُۥ مَا فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ) wa lahuu maa fis samaawaati wal ardh : “dan milik-Nya meliputi segala apa yang ada di langit dan di bumi.” Sebagai ciptaan-Nya dan berada di bawa kekuasaan-Nya, segala sesuatu yang kalian sembah bersama Allah, maka ia adalah milik-Nya dan Dia tidak mengizinkan untuk menyembahnya. (وَلَهُ ٱلدِّينُ وَاصِبًاۚ) wa lahud diinu waashibaa : “dan kepada-Nyalah ibadah dan ketaantan selama-lamanya.” Murni, selamanya, dan wajib. Makna ayat: Firman-Nya “Dan kepunyaan-Nya-lah segala apa yang ada di langit dan di bumi” ini adalah bukti yang jelas atas kesalahan sikap takut dan berharap kepada selain Allah ta’ala, selagi apa yang ada di langit dan bumi adalah milik-Nya dan ciptaan-Nya. Firman-Nya “dan untuk-Nya-lah ketaatan itu selama-lamanya” wajib beribadah dan taat kepada-Nya, hanya milik Allah-lah ketaatan yang murni. Firman-Nya “Maka mengapa kamu takut kepada selain Allah?” Allah mencela rasa takut kepada selain-Nya, karena hanya Allah-lah yang pantas untuk ditakuti. Karena Dia adalah Raja yang sebenar-benarnya, yang mampu memberikan kenikmatan serta mengambilnya, oleh kerena itu mengapa harus takut kepada yang tidak memiliki mudharat dan manfaat lalu membangkang dari yang memiliki segala sesuatu dan kepada-Nya-lah segala sesuatu akan kembali, apa pun yang Dia kehendaki pasti terjadi dan apa yang tidak Dia kehendaki tidak akan terjadi? Pelajaran dari ayat: • Kewajiban untuk taat kepada Allah, karena Dia-lah tuhan yang benar, bukan selain-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 52: Milik-Nya, ciptaan-Nya, dan hamba-Nya. Padahal mereka tidak kuasa menolak madharrat dan memberi manfaat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 52",
    "description": "Dan ketahuilah, begitu besar kekuasaan Allah atas alam semesta. Milik-Nya meliputi segala apa yang ada di langit dan di bumi, yang kamu ketahui maupun tidak, yang hidup maupun mati, yang besar maupun kecil. Dan hanya kepada-Nyalah kamu beribadah dan menyatakan ketaatan selama-lamanya. Mengapa kamu mesti takut kepada selain Allah, padahal kamu sudah menyaksikan tanda-tanda kekuasaan-Nya'dan bagaimana bisa kamu tidak beribadah dan taat kepada-Nya, padahal segala nikmat, baik yang ada pada diri-Mu maupun yang kamu nikmati dalam kehidupanmu, bersumber dari Allah yang maha pemurah' jika dia mencabut nikmat-nikmat itu, tentu kamu tidak akan bisa hidup. Kemudian apabila kamu ditimpa sedikit kesengsaraan, maka kepada-Nyalah kamu segera meminta pertolongan agar kesengsaraan itu dihilangkan dari kamu."
  }
]