[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apa saja yang ada pada kalain beruapa kenikmatan hidayah kesehatan jasmani keluasan rizki dan anak dan lain-lain, maka itulah adalah dari Allah semata, Dia lah pemberi kenikmatan-kenikmatan itu kepada kalian. Kemudian bila turun kepada kalian penyakit, bala dan paceklik, maka kepada Allah lah kalian riuh dengan doa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "53. Nikmat apapun yang ada pada kalian -wahai manusia-, baik nikmat agama atau dunia, maka itu semua dari Allah, bukan dari selain-Nya. Kemudian manakala kalian ditimpa ujian, sakit atau kemiskinan, maka hanya kepada Allah semata kalian berdoa dengan merendahkan diri agar Dia menghilangkannya dari kalian. Siapa yang memberikan kenikmatan dan menghilangkan kesulitan, maka Dia lah semata yang berhak disembah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "53-54. Hai manusia, apa yang telah Allah berikan kepada kalian merupakan bentuk karunia dan kebaikan-Nya; namun mengapa jika kalian tertimpa musibah maka hanya kepada-Nya kalian meminta pertolongan, dan jika Allah telah mengabulkan permintaan kalian dan menghilangkan musibah tersebut, sebagian kalian berpaling dengan menyekutukan-Nya?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "53. وَمَا بِكُم مِّن نِّعْمَةٍ (Dan apa saja nikmat yang ada pada kamu) Berupa segala kenikmatan dengan segala jenisnya. فَمِنَ اللهِ ۖ( maka itu dari Allah-lah) Baik itu kenikmatan agama, yaitu pengetahun tentang kebenaran yang sesungguhnya dan pengetahuan tentang kebaikan untuk dapat diamalkan; maupun kenikmatan dunia seperti kenikmatan pada jiwa, jasad, atau dari faktor luar seperti dari harta benda dan lainnya. Segala kenikmatan ini berasal dari Allah. Oleh sebab itu wajib bagi orang yang berakal untuk bersyukur kepada Pemberi segala kenikmatan tersebut. ثُمَّ إِذَا مَسَّكُمُ الضُّرُّ فَإِلَيْهِ تَجْـَٔرُونَ(dan bila kamu ditimpa oleh kemudharatan, maka hanya kepada-Nya-lah kamu meminta pertolongan) Yakni memohon agar itu dihilangkan. Makna (الضر) yakni penyakit, musibah, kemiskinan, kekeringan, dan segala yang memberi kemudharatan kepada manusia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "53. Dan kalian itu tidak memiliki nikmat agama dan nikmat dunia kecuali hanya dari Allah. Lalu ketika kalian ditimpa penderitaan berupa sakit, kefakiran dan kebutuhan (mendesak), maka hanya kepadaNyalah kalian mengemis agar diangkat penderitaan itu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Segala nikmat yang ada pada kalian itu dari Allah. Kemudian apabila kalian ditimpa} kalian ditimpa {kemudaratan, maka kepadaNyalah kalian meminta pertolongan} kalian menyeru memohon pertolongan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "53. “dan apa saja nikmat yang ada padamu” nikmat lahiriah ataupun batiniah, ”maka dari Allah lah (datangnya)” tiada seorangpun yang menyertai Allah di dalamnya, ”kemudian bila kamu ditimpa oleh kemudaratan” baik berupa kemiskinan, penyakit, dan keadaan yang menyulitkan, ”maka hanya kepadaNyalah kamu meminta pertolongan” maksudnya mendengung dengungkan doa dan permohonan karena kalian mengetahui, bahwa tidak ada yang sanggup menyingkirkan keburukan dan kesengsaraan selain Dia. Dialah satu satunya Dzat yang memegang kendali pencurahan karunia kepada kalian berupa apa saja yang kalian inginkan, dan membelokkan apa saja yang kalian benci. Dialah Dzat yang tidak sepatutnya ibadah dikerjakan kecuali diarahkan kepadaNya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (فَإِلَيۡهِ تَجۡ‍َٔرُونَ) fa`ilaihi taj`aruun : “maka kepada-Nyalah kamu meminta pertolongan.” Kalian mengangkat suara ketika berdoa kepada-Nya memohon kesembuhan. Makna ayat: Firman-Nya “Dan apa saja nikmat yang ada pada kamu maka dari Allah.” Allah ta’ala mengabarkan tentang kenyataan orang-orang yang mengingkari-Nya kemudian menjelaskan kepada mereka bahwa segala nikmat yang ada pada mereka baik besar maupun kecil seperti kesehatan, harta, dan anak, maka itu semua adalah dari Allah ta’ala Yang Menciptakan mereka, dan Pemberi kehidupan kepada mereka bukan salah satu dari mereka (berhala). Kemudian dalil yang menunjukkan pada hal itu, yaitu naluri alami mereka, ketika mereka tertimpa keburukan seperti kemiskinan dan sakit atau perubahan keadaan seperti takut tenggal di laut mereka mengangkat suara seraya meminta pertolongan kepada Allah, memohon kepada-Nya agar menghilangkan keburukan atau menyelamatkan mereka dari kebinasaan. Firman-Nya “Dan apabila kamu ditimpa oleh kemudharatan maka hanya kepada-Nya-lah” tidak kepada yang lain “kamu meminta pertolongan” mengangkat suara mereka untuk berdoa dan memohon pertolongan kepada-Nya subhanahu wa ta’ala. Pelajaran dari ayat: • Seluruh nikmat yang ada pada seorang hamba, baik kecil maupun besar adalah dari Allah subhanahu wa ta’ala."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 53: Baik yang nampak maupun yang tersembunyi. Bukan dari selain-Nya. Seperti kemiskinan dan penyakit. Dengan mengeraskan suara, karena kamu mengetahui, bahwa hanya Dia saja yang mampu menghindarkan bahaya. Oleh karena Dia yang memberikan apa yang kamu cintai dan menghindarkan apa yang kamu benci, maka hanya Dia saja yang berhak diibadahi. Akan tetapi, kebanyakan manusia menzalimi diri mereka sendiri, mereka ingkari nikmat Allah yang telah menyelamatkan mereka dari musibah, sehingga ketika telah hilang musibah itu, sebagian di antara mereka menyekutukan-Nya dengan sesuatu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 53",
    "description": "Dan bagaimana bisa kamu tidak beribadah dan taat kepada-Nya, padahal segala nikmat, baik yang ada pada diri-Mu maupun yang kamu nikmati dalam kehidupanmu, bersumber dari Allah yang maha pemurah' jika dia mencabut nikmat-nikmat itu, tentu kamu tidak akan bisa hidup. Kemudian apabila kamu ditimpa sedikit kesengsaraan, maka kepada-Nyalah kamu segera meminta pertolongan agar kesengsaraan itu dihilangkan dari kamu. Kemudian apabila dia yang mahakuasa dan maha esa telah menghilangkan bencana dan kesengsaraan itu dari kamu, ketaatanmu kepadanya bukannya bertambah, malah sebagian kamu berpaling lalu mempersekutukan tuhan penolongmu dengan yang lain."
  }
]