[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "kemudian bila Dia mengangkat musibah dan wabah penyakit dari mereka, ternyata segologan dari kalian yang telah dianugerahi keselamatan oleh tuhan mereka malah mengadakan sekutu-sekutu dan penolng-penolong bersamaNYa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "54. Kemudian bila Allah menjawab doa kalian, mengangkat kesulitan yang menimpa kalian, ternyata ada sekelompok orang dari kalian yang menyekutukan Rabb mereka, yang mereka sembah bersama-Nya sesembahan selain-Nya. Benar-benar tidak tahu balas budi."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "54. ثُمَّ إِذَا كَشَفَ الضُّرَّ عَنكُمْ إِذَا فَرِيقٌ مِّنكُم بِرَبِّهِمْ يُشْرِكُونَ (Kemudian apabila Dia telah menghilangkan kemudharatan itu dari pada kamu, tiba-tiba sebahagian dari pada kamu berbuat syirik) Yakni menempatkan kesyirikan terhadap Allah sebagai ganti dari rasa syukur kepada-Nya yang telah menghilangkan kemudharatan yang menimpa mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "54. Lalu ketika Allah telah mengangkat penderitaan itu (penderitaan dan mushibah) dari kalian, maka sebagian dari kalian, yaitu orang-orang kafir, akan menyekutukanNya dengan Tuhan lain dalam ibadah, yang mana mereka mengubah nikmat menjadi amarah dan syukur menjadi syirik kepada Allah. Mereka melupakan yang memberi nikmat dan keselamatan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kemudian apabila Dia telah menghilangkan kemudaratan dari kalian, tiba-tiba segolongan dari kalian menyekutukan Tuhan mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "54-55. Namun, kebanyakan orang masih berbuat aniaya kepada diri sendiri dan mengingkari nikmat Allah pada mereka, bila telah diselamatkan oleh Allah dari kondisi buruk mereka. Lalu ketika dalam suasana kegembiraan, mereka menjadi orang orang yang menyekutukan Allah dengan sebagian makhluk yang tiada punya apa apa. untuk itu Allah berfirman “biarlah mereka mengingkari nikmat yang telah kami berikan kepada mereka” maksudnya sesuatu yang kami berikan kepada mereka dimana kami menyelamatkan mereka dari kesengsaraan dan membebaskan mereka dari kesulitan, ”maka bersenang senanglah kamu\" sejenak di dunia kalian, ”kelak kamu akan mengetahui (akibatnya) yaitu akibat kekufuran mereka.\""
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat: Firman-Nya “Kemudian apabila Dia telah menghilangkan kemudharatan itu dari pada kamu, tiba-tiba sebagian” besar “dari kalian mempersekutukan Rabbnya dengan yang lain.” Mereka menyembah selain-Nya dengan berbagai macam ibadah, seraya melupakan Allah yang telah menghilangkan bahaya pada diri mereka serta menyelamatkan mereka dari kebinasaan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 54",
    "description": "Kemudian apabila dia yang mahakuasa dan maha esa telah menghilangkan bencana dan kesengsaraan itu dari kamu, ketaatanmu kepadanya bukannya bertambah, malah sebagian kamu berpaling lalu mempersekutukan tuhan penolongmu dengan yang lain. Begitu banyak nikmat yang kami anugerahkan, tetapi biarlah mereka mengingkari nikmat yang telah kami berikan kepada mereka. Akan kami katakan kepada mereka, bersenang-senanglah kamu dengan nikmatnikmat itu dan berhala-berhala yang kamu sembah. Ketahuilah, kelak kamu pasti akan mengetahui akibat dari perbuatanmu."
  }
]