[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Biarlah mereka mengingkari nikmat-nikmat Kami pada mereka, yang diantara bentuknya ialah mengangkat musibah dari mereka. Maka bersenang-senanglah kalain dengan kehidupan dunia kalian, yang kesudahannya ialah akan sirna. Kalian akan mengetahui akibat tindakan kekafiran dan kedurhakaan kalian itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "55. Kemusyrikan menjadikan mereka mengingkari nikmat-nikmat Allah yang di antaranya adalah diangkatnya kesulitan, karena itu dikatakan kepada mereka, “Silakan kalian bersenang-senang dengan kenikmatan yang kalian dapatkan hingga azab Allah mendatangi kalian, cepat atau lambat.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "55-56. Allah mengancam orang-orang yang memohon kepada-Nya kemudian menyekutukan-Nya dengan mengingkari kenikmatan yang telah diberikan kepada mereka, yang diantaranya adalah Allah telah menyelamatkan mereka dari kebinasaan: “Biarkan saja mereka ersenang-senang dengan kenikmatan dunia yang mereka miliki, karena mereka akan mengetahui akibat dari kekafiran yang telah mereka lakukan; dan bagian dari kekafiran mereka adalah mereka selalu menganggap berhala-berhala yang tidak memiliki ilmu itu sebagai bagian dari kenikmatan yang telah Allah berikan kepada mereka.” Kemudian Allah bersumpah dengan Dzat-Nya yang mulia bahwa mereka pasti akan ditanya tentang perbuatan tersebut."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "55. لِيَكْفُرُوا۟ بِمَآ ءَاتَيْنٰهُمْ ۚ (Biarlah mereka mengingkari nikmat yang telah Kami berikan kepada mereka) Yakni kesudahan dari permohonan mereka hanyalah kekafiran. فَتَمَتَّعُوا۟ ۖ( maka bersenang-senanglah kamu) Dengan menyembah selain Allah. فَسَوْفَ تَعْلَمُونَ(Kelak kamu akan mengetahui) Yakni Mengetahui kesudahan urusan kalian dan azab yang akan menimpa kalian di dunia dan di akhirat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "55. Dan akibat bagi mereka yang mengemis kemudian berbuat syirik dengan mengingkari nikmat yang Kami berikan, lalu menikmati beribadah kepada para berhala, maka kalian akan mengetahui akibat dari perbuatan kalian dan azab yang akan menimpa kalian. Ini merupakan ancaman dan peringatan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Agar mereka mengingkari} mengingkari {apa yang telah Kami anugerahkan kepada mereka} Kami berikan kepada mereka berupa kenikmatan dan penghilangan kemudaratan {Bersenang-senanglah, kelak kalian akan mengetahui (akibatnya)"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "54-55. Namun, kebanyakan orang masih berbuat aniaya kepada diri sendiri dan mengingkari nikmat Allah pada mereka, bila telah diselamatkan oleh Allah dari kondisi buruk mereka. Lalu ketika dalam suasana kegembiraan, mereka menjadi orang orang yang menyekutukan Allah dengan sebagian makhluk yang tiada punya apa apa. untuk itu Allah berfirman “biarlah mereka mengingkari nikmat yang telah kami berikan kepada mereka” maksudnya sesuatu yang kami berikan kepada mereka dimana kami menyelamatkan mereka dari kesengsaraan dan membebaskan mereka dari kesulitan, ”maka bersenang senanglah kamu\" sejenak di dunia kalian, ”kelak kamu akan mengetahui (akibatnya) yaitu akibat kekufuran mereka.\""
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (فَتَمَتَّعُواْ فَسَوۡفَ تَعۡلَمُونَ) fatamatta’uu fasaufa ta’lamuun : “kelak kamu akan mengetahui akibatnya.” Ancaman karena kekufuran, syirik, dan keengganan mereka untuk berdoa kepada Allah ta’ala. Makna ayat: Firman-Nya “Biarlah mereka mengingkari nikmat yang telah Kami berikan kepada mereka” biarkan mereka kembali mengingkari dan melupakan apa yang telah Allah ta’ala berikan berupa nikmat dan keselamatan dari bencana. Apakah dengan cara ini mereka berterima kasih? Apakah seseorang yang telah diberikan kenikmatan dengan berbagai jenis nikmat, diselamatkan dari bencana, kemudian melupakan seluruhnya lalu menyembah selain-Nya? bahkan memerangi agama dan rasul-Nya? jika demikian, “Maka bersenang-senanglah kamu” wahai orang-orang yang kafir “kelak kamu akan mengetahui.” Akhir dari kekufuran kalian dan ketidak inginan kalian untuk taat kepada-Nya, enggan mengingat-Nya dan mensyukuri-Nya. Pelajaran dari ayat: • Ancaman untuk kaum musyrikin jika mereka terus berada di atas kesyirikan dan tidak mau bertaubat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 55: Sementara di dunia!. Perintah ini adalah untuk mengancam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 55",
    "description": "Begitu banyak nikmat yang kami anugerahkan, tetapi biarlah mereka mengingkari nikmat yang telah kami berikan kepada mereka. Akan kami katakan kepada mereka, bersenang-senanglah kamu dengan nikmatnikmat itu dan berhala-berhala yang kamu sembah. Ketahuilah, kelak kamu pasti akan mengetahui akibat dari perbuatanmu. Dan tidak saja mengingkari nikmat dan keesaan Allah, mereka (kaum musyrik) menyediakan sebagian dari rezeki yang telah kami berikan kepada mereka sebagai persembahan untuk berhala-berhala yang mereka tidak mengetahui kekuasaannya. Demi Allah yang mahakuasa, kamu, wahai orang musyrik, pasti akan ditanyai dan dimintai pertanggungjawaban oleh Allah tentang apa yang telah kamu ada-adakan."
  }
]