[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan diantara bentuk buruknya perbuatan mereka, bahwa sesungguhnya mereka memperuntukan berhala-berhala yang mereka jadikan sebagai tuhan sesembahan, (padahal tuhan-tuhan itu tidak dapat mendatangkan manfaat dan mencelakai) bagian dari harta benda mereka yang Allah rizkikan kepada mereka, sebagai sarana mendekatkan diri kepada sesembahan-sesembahan tersebut. Demi Allah kalian akan dimintai pertanggungjawaban di hari kiamat atas kedustaan yang kalian ada-adakan terhadap Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "56. Orang-orang musyrikin menyisihkan sebagian harta mereka yang Kami rezekikan kepada mereka untuk mendekatkan diri kepadanya bagi berhala-berhala mereka yang tidak mengetahui apa pun, karena ia hanyalah benda mati, tidak mendatangkan manfaat dan mudarat. Demi Allah, Kami akan bertanya kepada kalian -wahai orang-orang musyrikin- pada hari Kiamat tentang apa yang kalian katakan bahwa berhala-berhala itu adalah Tuhan-tuhan dan bahwa mereka layak mendapatkan bagian dari harta kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "56. وَيَجْعَلُونَ لِمَا لَا يَعْلَمُونَ نَصِيبًا مِّمَّا رَزَقْنٰهُمْ ۗ (Dan mereka sediakan untuk berhala-berhala yang mereka tiada mengetahui (kekuasaannya), satu bahagian dari rezeki yang telah Kami berikan kepada mereka) Setelah mereka memohon kepada Allah untuk mengangkat kemudharatan yang menimpa mereka, kemudian mereka menyisihkan rezeki yang diberikan Allah bagi berhala mereka untuk mendekatkan diri kepada-Nya, padahal mereka tidak mengetahui hakikat dari berhala-berhala mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "56. Dan orang-orang musyrik itu menyediakan sebagian rejeki yang Kami berikan untuk mereka berupa haasil tani dan ternak kepada tuhan-tuhan yang sama sekali tidak mereka ketahui, karena mereka hanyalah benda mati dan setan. Demi Allah kalian akan diberi pertanyaan hinaan terkait pendustaan kalian kepada Allah bahwa Dia memerintahkan kalian untuk melakukan itu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka menyediakan bagian dari rezeki yang telah Kami anugerahkan kepada mereka untuk (berhala-berhala) yang tidak mereka ketahui} untuk tuhan-tuhan mereka yang tidak mereka ketahui sedikitpun tentangnya {Demi Allah, kalian pasti akan ditanyai tentang apa yang kalian ada-adakan} kebohongan yang kalian buat-buat terhadap Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "56. Allah memberitahukan tentang kebodohan kaum musyrikin dan tindakan kezhaliman mereka serta kedustaan mereka atas nama Allah. Mereka itu telah menyediakan bagian rizki yang Allah berikan dan karuniakan kepada mereka untuk berhala berhala yang tidak dapat mengetahui, tidak sanggup memberi manfaat dan kemudaratan. Jadi, mereka menggunakan (fasilitas) rizkiNya untuk berbuat syirik kepadNya dan mendekatkan diri dengannya kepada berhala berhala yang berpahat, sebagaimana, Firman Allah, ”Demi Allah, sesungguhnya kamu akan ditanyai tentang apa yang telah kamu ada adakan”, akan dikatakan kepada mereka, ”apakah Allah telah memberikan izin kepadamu (tentang ini) atau kamu mengada adakan saja terhadap Allah?” apakah dugaan orang orang yang mengadakan kebohongan terhadap Allah pada hari kiamat? akibatnya, Allah menyiksa mereka dengan hukuman yang sangat dahsyat."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (وَيَجۡعَلُونَ لِمَا لَا يَعۡلَمُونَ نَصِيبٗا) wa yaj’aluun limaa laa ya’lamuun nashiibaa : “dan mereka menyediakan sebagian” menjadikan untuk tuhan-tuhan mereka bagian dari pertanian dan hewan ternak. (عَمَّا كُنتُمۡ تَفۡتَرُونَ) ‘ammaa kuntum taftaruun : “tentang apa yang telah kamu ada-adakan.” Kalian buat-buat dengan berdusta atas nama Allah ta’ala. Makna ayat: Firman-Nya “Dan mereka menyediakan sebagian dari rezeki-rezeki yang telah Kami berikan, untuk berhala-berhala yang mereka tiada mengetahui (kekuasaannya).” Ini adalah bentuk aib dan kebatilan dari perbuatan mereka, mereka mempersembahkan harta untuk berhala-berhala yang tidak mengetahui manfaat, keburukan, memberi, menahan, dan mematikan atau menghidupkan—mereka melakukannya sebagai ketaatan kepada setan—bertaqarrub dengannya, lalu mereka menjadikan sawaa`ib dan bawaahir dari jenis hewan ternak, dan membuat pula dari hasil panen bagian untuk mereka, sebagaimana yang dijelaskan pada surat Al-An’am dan Al-Ma`idah. Firman-Nya “Demi Allah, kamu pasti akan ditanyai tentang apa yang telah kamu ada-adakan.” Allah Yang Maha Kuasa bersumpah seraya mengancam mereka bahwa mereka pasti akan ditanya pada hari kiamat perihal apa yang telah mereka ada-adakan, berupa membuat syariat yang batil, karena mereka mengharamkan, menghalalkan, dan memberi tuhan-tuhan mereka apa yang mereka inginkan, dan kelak mereka Allah akan mencela mereka dan menghinakan mereka karena hal itu di neraka Jahanam dan itulah seburuk-buruk tempat kembali. Pelajaran dari ayat: • Ancaman untuk kaum musyrikin karena syariat, penghalalan, pengharaman, pemberian, dan pantangan mereka yang batil."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 56: Allah Subhaanahu wa Ta'aala memberitahukan tentang kebodohan orang-orang musyrik, kezaliman mereka, dan membuat-buatnya mereka kedustaan terhadap Allah. Mereka sisihkan sebagian rezeki yang Allah berikan kepada patung-patung yang tidak dikenal berkuasa apa-apa. Mereka gunakan nikmat-nikmat Allah untuk berbuat syirk dan mendekatkan diri kepada patung-patung yang dipahat atau sesembahan lainnya. Yakni orang-orang musyrik. Seperti tanaman dan binatang ternak. Hal ini tidak beda jauh dengan keadaan di zaman kita, ada orang-orang yang membuat sesaji untuk selain Allah seperti yang terjadi di pesisir pantai di pulau Jawa, ada yang melempar sesajiannya ke laut dan ada yang menaruhnya di tempat tertentu menurut persangkaan mereka. Mereka tidak bersyukur kepada Allah yang telah memberikan rezeki kepada mereka berupa hasil panen dan berkembangbiaknya ternak mereka, bahkan mereka sisihkan sebagian panen atau binatang ternak mereka kepada selain Allah yang tidak memberi rezeki dan tidak menciptakan mereka, fa inaa lillahi wa innaa ilaihi raaji’uun. Karena kamu telah berdusta dengan mengatakan, bahwa Allah memerintahkan kamu melakukan hal itu. Oleh karena itu, Dia akan memberikan hukuman berat terhadap kamu jika kamu tetap terus berbuat seperti itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 56",
    "description": "Dan tidak saja mengingkari nikmat dan keesaan Allah, mereka (kaum musyrik) menyediakan sebagian dari rezeki yang telah kami berikan kepada mereka sebagai persembahan untuk berhala-berhala yang mereka tidak mengetahui kekuasaannya. Demi Allah yang mahakuasa, kamu, wahai orang musyrik, pasti akan ditanyai dan dimintai pertanggungjawaban oleh Allah tentang apa yang telah kamu ada-adakan. Kaum musyrik meyakini para malaikat berjenis perempuan dan mereka menetapkan para malaikat itu sebagai anak perempuan bagi Allah. Mahasuci dia dari apa yang mereka tetapkan; sedang untuk mereka sendiri mereka menetapkan apa yang mereka sukai, berupa anak laki-laki."
  }
]