[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang kafir mengadakan bagi Allah anak-anak perempuan. Mereka mengatakan ”malaikat adalah anak-anak perempuan Allah.” Maha suci Allah dari pernyataan mereka. Dan mereka menjadikan bagi diri mereka sesuatu yang mereka sukai, yaitu anak-anak kecil."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "57. Orang-orang musyrikin menisbahkan anak-anak perempuan kepada Allah, mereka meyakini bahwa anak-anak perempuan itu adalah para malaikat. Mereka menisbahkan peranakan kepada Allah. Mereka memilih untuk Allah apa yang tidak mereka sukai untuk diri mereka. Mahasuci Allah lagi Mahatinggi dari apa yang mereka nisbahkan kepada Allah, sementara mereka menjadikan untuk diri mereka apa yang mereka sukai berupa anak-anak lelaki. Adakah kezaliman yang lebih berat daripada tuduhan ini?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "57-59. Dan bagian dari kekafiran mereka adalah kepercayaan mereka bahwa para malaikat adalah anak-anak perempuan Allah -Maha Suci Allah dari apa yang mereka katakan ini-, padahal mereka sendiri selalu menginginkan anak-anak laki-laki. Dan jika seseorang dari mereka mendapat kabar kelahiran anak perempuan, wajahnya menjadi penuh dengan kesedihan dan menjadi murung karena besarnya kegalauan yang dia rasakan. Dia malu bertemu dengan kaumnya akibat kabar buruk yang dia dapatkan, dan dia bingung dengan nasib anak perempuannya tersebut; Apakah dia akan membiarkannya hidup dengan menanggung kehinaan, atau menguburnya hidup-hidup ke dalam tanah? Hai manusia, apakah kalian tidak memperhatikan perbuatan mereka; sungguh keketapan mereka menjadikan anak perempuan bagi Allah merupakan seburuk-buruk ketetapan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "57. وَيَجْعَلُونَ لِلّٰهِ الْبَنٰتِ (Dan mereka menetapkan bagi Allah anak-anak perempuan) Dahulu suku Khuza’ah dan Kinanah mengatakan bahwa pada malaikat adalah anak-anak perempuan Allah. سُبْحٰنَهُۥ ۙ( Maha Suci Allah) Allah menyucikan diri-Nya dari apa yang dituduhkan kepada-Nya oleh orang-orang yang ingkar tersebut. وَلَهُم مَّا يَشْتَهُونَ (sedang untuk mereka sendiri (mereka tetapkan) apa yang mereka sukai) Dan mereka menjadikan bagi diri mereka apa yang mereka sukai yaitu anak laki-laki."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "57. Dan sebagian orang-orang musyrik itu mengada-ada bahwa Allah memiliki puteri, mereka itu adalah Bani Khuza’ah dan Bani Kinanah yang berkata: “Para malaikat adalah puteri-puteri Allah”. Maha suci Allah dari apa yang mereka hubung-hubungkan kepadaNya, berupa anak dan sekutu. Dan mereka menjadikan sesuatu yang memang mereka inginkan untuk diri mereka sendiri, yaitu putera"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka menetapkan anak-anak perempuan bagi Allah; Maha suci Dia, sedangkan untuk mereka sendiri itu apa yang mereka sukai} sesuatu yang mereka sukai yaitu anak laki-laki"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "57-59. “dan mereka menetapkan bagi Allah anak anak perempuan” yang mana mengatakan tentang malaikat, para penyembah lagi yang dekat (dengan Allah), mereka itu putri putri Allah “sedang untuk mereka sendiri (mereka tetapkan) sesuatu yang mereka sukai” yaitu anak laki laki bagi diri mereka. Sampai membuat mereka membenci anak anak perempuan dengan kebencian yang besar. Salah seorang dari merekapun bersikap, ”apabila seseorang dari mereka diberi kabar dengan (kelahiran) anak perempuan, hitamlah (merah padamlah) mukanya” yaitu marah lantaran kesedihan dan penyesalan karena mendapat kabar (kelahiran) anak perempuan. Kejadian ini bahkan sampai berakibat dia (merasa) reputasinya dicemari di hadapan kaumnya, dan dia pun menyembunyikan diri dari orang banyak disebabkan buruknya berita yang disampaikan kepadanya. Lantas, ia mengarahkan pikiran dan nalarnya yang sudah rusak mengenai tindakan apa yang akan ia perbuat berkaitan dengan anak perempuan yang mana dia mendapat kabar dalam wujud itu. “apakah dia akan memeliharanya dengan menanggung kehinaan\" yakni membiarkannya tidak dibunuh diatas kehinaan dan kenistaan “ataukah akan menguburkannya ke dalam tanah (hidup hidup)” menguburnya dalam keadaan hidup. Tindakan itulah yang disebut penguburan (al wa’du) yang dicela oleh Allah pada kaum musyrikin. ”ketahuilah alangkah buruknya apa yang mereka tetapkan itu” lantaran mereka menyandangkan sifat kepada Allah dengan sifat sifat yang tidak pantas dengan kebesaranNya berupa penisbatan anak kepadaNya. Kemudian tidak berhenti di sini, bahkan mereka menisbatkan jenis anak perempuan yang mereka sangat antipasti dan membencinya (kepada Allah) mengapa mereka menisbatkannya kepada Allah? maka sejelek jelek ketetapan adalah ketetapan mereka."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (وَيَجۡعَلُونَ لِلَّهِ ٱلۡبَنَٰتِ) wa yaj’aluuna lillaahil banaat : “Dan mereka menetapkan anak perempuan bagi Allah.” Karena mereka berkata, Malaikat adalah anak perempuan Allah. (وَلَهُم مَّا يَشۡتَهُونَ) wa lahum maa yasytahuun : “sedang untuk mereka sendiri apa yang mereka sukai.” Anak laki-laki. Makna ayat: Konteks ayat ini masih menjelaskan tentang kesalahan kaum musyrikin dalam perkara keyakinan dan akhlak mereka. Allah ta’ala berfirman “dan mereka menjadikan anak perempuan bagi Allah, sedang untuk mereka sendiri apa yang mereka suka.” Ini adalah perkataan mereka yang buruk dan keyakinan yang jelek, mereka menisbatkan anak perempuan untuk Allah ta’ala, mereka berkata, malaikat adalah anak perempuan Allah, pada masa mereka tidak menyukai anak perempuan. Inilah yang terkandung pada ayat (57) Firman-Nya “Dan mereka menetapkan anak perempuan bagi Allah” mereka berkata, malaikat adalah anak perempuan Allah “Mahasuci Dia” Mahasuci Allah ta’ala dari memiliki anak dan istri, maka tidak mungkin memiliki seorang anak laki-laki atau perempuan, karena Dia adalah penguasa segala sesuatu, maka untuk apa Dia memiliki anak? Pelajaran dari ayat : • Penjelasan mengenai keadaan masyarakat kaum musyrikin yaitu ketidaksukaan terhadap anak perempuan khawatir menanggung aib."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 57: Mereka mengatakan bahwa Allah mempunyai anak perempuan yaitu malaikat-malaikat karena mereka sangat benci kepada anak-anak perempuan sebagaimana tersebut dalam ayat berikutnya. Dari mengambil atau memiliki anak."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 57",
    "description": "Kaum musyrik meyakini para malaikat berjenis perempuan dan mereka menetapkan para malaikat itu sebagai anak perempuan bagi Allah. Mahasuci dia dari apa yang mereka tetapkan; sedang untuk mereka sendiri mereka menetapkan apa yang mereka sukai, berupa anak laki-laki. Mereka menisbatkan para malaikat sebagai putri-putri Allah, padahal apabila seseorang dari mereka diberi kabar dengan kelahiran anak perempuan, ia malu dan kecewa sehingga wajahnya menjadi hitam, merah padam, dan kusut; dan dia sangat marah atas kabar tersebut."
  }
]