[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apabila ada seseorang yang menyampaikan berita kepada salah seorang dari mereka tentang kelahiran anak perempuannya, maka menghitamlah wajahnya, lantaran kebenciannya terhadap berita yang ia dengar, dan hatinya sesak dengan persaan gundah dan sedih."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "58. Bila seseorang dari orang-orang musyrikin itu dikabari tentang kelahiran anak perempuan, maka wajahnya menghitam karena membenci apa yang dikabarkan, hatinya sarat dengan kesedihan dan kegelisahan, lalu ia menisbahkan kepada Allah apa yang tidak ia ridai untuk dirinya sendiri."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "58. وَإِذَا بُشِّرَ أَحَدُهُم بِالْأُنثَىٰ (Dan apabila seseorang dari mereka diberi kabar dengan (kelahiran) anak perempuan) Jika dikabarkan kepada salah seorang diantara mereka dengan kelahiran anak perempuan bagi mereka. ظَلَّ وَجْهُهُۥ مُسْوَدًّا(hitamlah (merah padamlah) mukanya) Yakni akibat dari kabar tersebut wajah mereka berubah menjadi penuh kegundahan dan kesedihan. وَهُوَ كَظِيمٌ (dan dia sangat marah) Yakni penuh dengan kemarahan yang dipendam."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "58. Dan ketika diberitakan kepada salah satu orang musyrik itu tentang kelahiran anak perempuan, maka wajahnya akan berubah menjadi sedih dan murung. Dia dipenuhi dengan kemarahan dan kebencian"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apabila salah seorang dari mereka diberi kabar tentang (kelahiran) anak perempuan, maka wajahnya menjadi hitam} berubah {dan dia sangat marah} dipenuhi dengan kesedihan dan kemarahan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "57-59. “dan mereka menetapkan bagi Allah anak anak perempuan” yang mana mengatakan tentang malaikat, para penyembah lagi yang dekat (dengan Allah), mereka itu putri putri Allah “sedang untuk mereka sendiri (mereka tetapkan) sesuatu yang mereka sukai” yaitu anak laki laki bagi diri mereka. Sampai membuat mereka membenci anak anak perempuan dengan kebencian yang besar. Salah seorang dari merekapun bersikap, ”apabila seseorang dari mereka diberi kabar dengan (kelahiran) anak perempuan, hitamlah (merah padamlah) mukanya” yaitu marah lantaran kesedihan dan penyesalan karena mendapat kabar (kelahiran) anak perempuan. Kejadian ini bahkan sampai berakibat dia (merasa) reputasinya dicemari di hadapan kaumnya, dan dia pun menyembunyikan diri dari orang banyak disebabkan buruknya berita yang disampaikan kepadanya. Lantas, ia mengarahkan pikiran dan nalarnya yang sudah rusak mengenai tindakan apa yang akan ia perbuat berkaitan dengan anak perempuan yang mana dia mendapat kabar dalam wujud itu. “apakah dia akan memeliharanya dengan menanggung kehinaan\" yakni membiarkannya tidak dibunuh diatas kehinaan dan kenistaan “ataukah akan menguburkannya ke dalam tanah (hidup hidup)” menguburnya dalam keadaan hidup. Tindakan itulah yang disebut penguburan (al wa’du) yang dicela oleh Allah pada kaum musyrikin. ”ketahuilah alangkah buruknya apa yang mereka tetapkan itu” lantaran mereka menyandangkan sifat kepada Allah dengan sifat sifat yang tidak pantas dengan kebesaranNya berupa penisbatan anak kepadaNya. Kemudian tidak berhenti di sini, bahkan mereka menisbatkan jenis anak perempuan yang mereka sangat antipasti dan membencinya (kepada Allah) mengapa mereka menisbatkannya kepada Allah? maka sejelek jelek ketetapan adalah ketetapan mereka."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (ظَلَّ وَجۡهُهُۥ مُسۡوَدّٗا) zhalla wajhuhu muswadda : “wajahnya menjadi hitam” berubah menjadi hitam karena musibah yang didapati. (وَهُوَ كَظِيمٞ) wahuwa kazhiim : “dan dia sangat marah.” Penuh dengan kegundahan. Makna ayat: Bahkan ketika salah satu di antara mereka diberi kabar gembira akan seorang anak perempuan, berubahlah wajahnya sedih dan marah, “wajahnya menjadi hitam” penuh dengan kesedihan dan kesusahan. Pada ayat (58) yaitu firman Allah ta’ala “Padahal apabila seseroang dari mereka diberi kabar dengan kelahiran anak perempuan, wajahnya menjadi hitam, merah padam” wajahnya menahan malu dan sedih dan sangat marah.” Penuh dengan kesedihan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 58: Ia juga merasa malu dengan kawan-kawannya, bahkan berusaha menyembunyikan berita itu. Lalu mengapa mereka menisbatkan anak perempuan kepada-Nya, sedangkan mereka sendiri tidak suka?"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 58",
    "description": "Mereka menisbatkan para malaikat sebagai putri-putri Allah, padahal apabila seseorang dari mereka diberi kabar dengan kelahiran anak perempuan, ia malu dan kecewa sehingga wajahnya menjadi hitam, merah padam, dan kusut; dan dia sangat marah atas kabar tersebut. Dia lalu menyembunyikan diri dari orang banyak disebabkan kabar buruk yang disampaikan kepadanya berupa kelahiran anak perempuan. Dalam keadaan demikian, dia bingung apakah dia akan memeliharanya dengan menanggung malu dan kehinaan dalam diri, martabat, dan kehormatannya, atau akan membenamkannya hidup-hidup ke dalam tanah' ingatlah, alangkah buruknya putusan yang mereka tetapkan itu."
  }
]