[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dia akan menyembunyikan diri dari kaumnya dikarenakan dia tidak suka berjumpa dengan mereka dalam keadaan terbalut sesuatu yang memperburuk dirinya berupa kesedihan dan aib, disebabkan anak perempuan yang terlahir tersebut; dan bingung apakah akan mempertahankannya hidup-hidup dengan menanggung kehinaan dan aib, ataukah menguburnya hidup-hidup di dalam tanah? ingatlah, seburuk-buruk keputusan ialah ketetapan yang mereka ambil dengan menjadikan anak-anak perempuan bagi Allah dan anak-anak laki-laki bagi mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "59. Dia bersembunyi dari kaumnya karena kabar buruk yang diterimanya, yaitu kelahiran anak perempuan. Jiwanya berkata kepada dirinya, \"Apakah ia akan tetap mempertahankan anak perempuan itu dalam kehinaan dan kesedihan atau menguburnya sehingga anak perempuan tersebut tertanam di tanah?\" Betapa buruk keputusan orang-orang musyrikin itu, karena mereka menisbahkan untuk Tuhan mereka sesuatu yang mereka benci untuk diri mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "59. يَتَوٰرَىٰ مِنَ الْقَوْمِ (Ia menyembunyikan dirinya dari orang banyak) Yakni bersembunyi. مِن سُوٓءِ مَا بُشِّرَ بِهِۦٓ ۚ( disebabkan buruknya berita yang disampaikan kepadanya) Akibat musibah, aib, dan rasa malu karena kelahiran anak perempuan itu. أَيُمْسِكُهُۥ (Apakah dia akan memeliharanya) Yakni dia berada dalam kebingungan dalam menentukan dua pilihan; yaitu antara tetap memelihara anak perempuan itu atau menguburnya dalam tanah. عَلَىٰ هُونٍ (dengan menanggung kehinaan) Dengan menanggung kehinaan dan kesusahan. أَمْ يَدُسُّهُۥ فِى التُّرَابِ ۗ( ataukah akan menguburkannya ke dalam tanah) Yakni menguburnya ke dalam tanah dalam keadaan hidup sebagaimana yang biasa dilakukan oleh orang-orang Arab ketika itu. أَلَا سَآءَ مَا يَحْكُمُونَ(Ketahuilah, alangkah buruknya apa yang mereka tetapkan itu) Yaitu dengan menjadikan anak perempuan yang mereka benci itu untuk Allah dan menjadikan anak laki-laki bagi mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "59. Dia menyembunyikan diri karena malu menemui orang-orang sekitarnya karena berita dan kabar buruk yang dia terima, apakah dia akan membiarkannya dikurung tanpa perlu dibunuh dengan tetap menanggung aib dan kehinaan ataukah akan menguburnya hidup-hidup dalam tanah. Betapa buruknya pebuatan mereka. Dan seburuk-uruk aturan adalah aturan mereka dengan menghubungkan anak perempuan kepada Allah SWT"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia bersembunyi} bersembunyi dan menghilang {dari orang banyak karena kabar buruk yang disampaikan kepadanya. Apakah dia akan memeliharanya} apakah dia akan membiarkannya {dengan kehinaan} kehinaan dan kerendahan {atau akan menguburnya} menyembunyikannya {ke dalam tanah. Ingatlah, alangkah buruk yang mereka tetapkan itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "57-59. “dan mereka menetapkan bagi Allah anak anak perempuan” yang mana mengatakan tentang malaikat, para penyembah lagi yang dekat (dengan Allah), mereka itu putri putri Allah “sedang untuk mereka sendiri (mereka tetapkan) sesuatu yang mereka sukai” yaitu anak laki laki bagi diri mereka. Sampai membuat mereka membenci anak anak perempuan dengan kebencian yang besar. Salah seorang dari merekapun bersikap, ”apabila seseorang dari mereka diberi kabar dengan (kelahiran) anak perempuan, hitamlah (merah padamlah) mukanya” yaitu marah lantaran kesedihan dan penyesalan karena mendapat kabar (kelahiran) anak perempuan. Kejadian ini bahkan sampai berakibat dia (merasa) reputasinya dicemari di hadapan kaumnya, dan dia pun menyembunyikan diri dari orang banyak disebabkan buruknya berita yang disampaikan kepadanya. Lantas, ia mengarahkan pikiran dan nalarnya yang sudah rusak mengenai tindakan apa yang akan ia perbuat berkaitan dengan anak perempuan yang mana dia mendapat kabar dalam wujud itu. “apakah dia akan memeliharanya dengan menanggung kehinaan\" yakni membiarkannya tidak dibunuh diatas kehinaan dan kenistaan “ataukah akan menguburkannya ke dalam tanah (hidup hidup)” menguburnya dalam keadaan hidup. Tindakan itulah yang disebut penguburan (al wa’du) yang dicela oleh Allah pada kaum musyrikin. ”ketahuilah alangkah buruknya apa yang mereka tetapkan itu” lantaran mereka menyandangkan sifat kepada Allah dengan sifat sifat yang tidak pantas dengan kebesaranNya berupa penisbatan anak kepadaNya. Kemudian tidak berhenti di sini, bahkan mereka menisbatkan jenis anak perempuan yang mereka sangat antipasti dan membencinya (kepada Allah) mengapa mereka menisbatkannya kepada Allah? maka sejelek jelek ketetapan adalah ketetapan mereka."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (أَمۡ يَدُسُّهُۥ فِي ٱلتُّرَابِۗ) am yadussuhuu fit turaab : “atau akan membenamkannya ke dalam tanah hidup-hidup?” mengubur anak perempuan yang lahir hidup-hidup, itulah yang disebut al-wa`du. Makna ayat: “Dia bersembunyi” dari pandangan manusia karena takut akan terbukanya aib. Ini “disebabkan kabar buruk yang disampaikan kepadanya.” Yaitu anak perempuan, maka ia berada dalam dia pilihan terkait dengan kabar gembira ini, antara menjaganya atau mengurungnya di dalam rumah bersama anak-anaknya dengan menanggung kehinaan, atau menguburnya hidup-hidup, dan itu merupakan kebiasaan mereka. Makah berfirman mencela perbuatan jahat mereka, “Alangkah buruknya keputusan yang mereka buat.” Dari perbuatan mereka menasabkan anak perempuan kepada Allah namun mereka berlepas dari anak perempuan dan mengubur anak perempuan hidup-hidup atau menghinakannya, serta betapa buruknya hukum jahiliyah. “Dia bersembunyi dari orang banyak, disebabkan kabar buruk” yaitu seorang anak perempuan “Apakah ia akan memeliharanya dengan menanggung kehinaan atau akan membenamkannnya ke dalam tanah hidup-hidup. Sungguh buruk keputusan yang mereka tetapkan itu.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 59: Karena takut dihina sambil memikirkan sikapnya. Karena menisbatkan anak kepada Allah. Terlebih anak yang mereka nisbatkan kepada-Nya adalah anak yang mereka benci, yaitu anak perempuan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 59",
    "description": "Dia lalu menyembunyikan diri dari orang banyak disebabkan kabar buruk yang disampaikan kepadanya berupa kelahiran anak perempuan. Dalam keadaan demikian, dia bingung apakah dia akan memeliharanya dengan menanggung malu dan kehinaan dalam diri, martabat, dan kehormatannya, atau akan membenamkannya hidup-hidup ke dalam tanah' ingatlah, alangkah buruknya putusan yang mereka tetapkan itu. Allah menegaskan bahwa bagi orang-orang yang tidak beriman pada kehidupan akhirat, ada sifat, sikap, dan perbuatan yang buruk; dan Allah yang maha esa dan mahakuasa mempunyai sifat yang mahatinggi. Ketinggian, kesucian, dan kekuasaan-Nya tidak dapat dijangkau oleh siapa pun dari makhluk-Nya. Dan dia mahaperkasa atas segala sesuatu, mahabijaksana dalam kekuasaan-Nya dengan menempatkan sesuatu sesuai hikmah yang ditetapkan-Nya."
  }
]