[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan bagi kalian padanya ada sumber keindahan yang mendatangkan kebahagiaan bagi kalain, tatkala kalian membawanya pulang kembali ke kandang-kandangnya di waktu sore, dan ketika kalian mengeluarkannya ke tempat pengembalaan di waktu pagi hari."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Kamu juga mendapatkan perhiasan darinya manakala kalian memasuki sore hari dan saat kalian mengeluarkan mereka ke padang gembala di pagi hari."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. وَلَكُمْ فِيهَا جَمَالٌ (Dan kamu memperoleh pandangan yang indah padanya) Yakni pemandangan yang indah bagi orang-orang yang melihatnya. حِينَ تُرِيحُونَ وَحِينَ تَسْرَحُونَ (ketika kamu membawanya kembali ke kandang dan ketika kamu melepaskannya ke tempat penggembalaan) Yakni saat memasukkannya ke dalam kendang dan saat menggembalakannya kembali."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Sebab hewan ternak itu kamu memperoleh perhiasan dan pandangan yang indah dari manusia, ketika kamu membawanya kembali ke kandang di waktu sore dan ketika kamu melepaskannya ke tempat penggembalaan di waktu pagi"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan bagi kalian terdapat keindahan} hiasan {padanya ketika kalian membawanya kembali} mengembalikannya ke kandangnya di waktu senja {dan ketika kalian melepaskannya} mengeluarkannya ke tempat luar di waktu pagi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6. “dan kamu memperoleh pandangan yang indah padanya, ketika kamu membawanya kembali ke kandang dan ketika kamu melepaskannya ketempat pengembalaan” maksudnya pada waktu sore hari, saat istirahat dan diamnya serta waktu aktivitas dan berkeliarannya ditempat gembalaan. Lantaran pandangan yang indah itu tidak dirasakan oleh binatang tersebut sedikitpun. Kalianlah pihak yang memperindah diri dengannya sebagaimana kalian menghiasi diri dengan aneka pakaian, keberadaan anak anak dan harta kekayaan dan kalian terpesona dengannya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (حِينَ تُرِيحُونَ) hiina turiihuun : ketika kalian mengembalikannya ke dalam kandang. (وَحِينَ تَسۡرَحُونَ) wa hiina tasrahuun : ketika melepasnya dari kandang menuju ladang, tempat dia biasa dilepas. Makna ayat: Firman-Nya “Dan kamu memperoleh keindahan padanya,” pemandangan yang baik dan indah, ketika kamu menggiringnya dari ladang menuju kandang “dan ketika kamu melepasnya.” Menggiringnya di pagi hari dari kandang menuju tempat pengembalaan, ini adalah kenikmatan jiwa dengan pemandangan yang indah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 6: Di sore hari. Di pagi hari."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 6",
    "description": "Dan selain manfaat-manfaat tersebut kamu juga dapat memperoleh keindahan padanya, yakni pada hewan ternak itu, ketika kamu membawanya kembali ke kandang pada sore hari dan ketika kamu melepaskannya ke tempat penggembalaan pada pagi hari. Dan kamu pun bisa memperoleh manfaat lain dari hewan ternak itu karena ia sanggup mengangkut beban-bebanmu yang berat dan tidak mampu kamu pikul sendiri ke suatu negeri nun jauh yang kamu tidak sanggup mencapainya, kecuali dengan susah payah. Sungguh, tuhanmu yang telah menciptakan hewan ternak itu dan menyediakan berbagai manfaat darinya adalah tuhan yang maha pengasih kepada hamba yang taat dan mendekatkan diri kepada-Nya, maha penyayang kepada semua makhluk-Nya."
  }
]