[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan bagi orang-orang yang tidak beriman kepada akhirat dan tidak mengerjakan perbuatan baik untuknya, perangai yang buruk berupa sifat lemah, kekurangan, kejahilan dan kekafiran. Sedang Allah mempunyai sifat-sifat tinggi dalam kesempurnaan dan ketidakbutuhan terhadap makhluk. dan Dia maha perkasa dalam kerajaanNya, lagi mahabijaksana dalam pengaturanNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "60. Orang-orang kafir yang tidak beriman kepada Akhirat memiliki sifat keburukan yaitu hajat kepada anak, kebodohan dan kekufuran, sedangkan bagi Allah adalah sifat-sifat yang terpuji berupa kemuliaan, keagungan, kekayaan dan ilmu. Allah Maha Perkasa dalam kekuasaan-Nya yang tidak seorang pun mengalahkan-Nya, Maha Bijaksana dalam penciptaan, pengaturan dan syarak-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "60-61. Orang-orang kafir memiliki sebutan yang buruk dan penuh kekurangan, sedangkan Allah memiliki sifat-sifat yang mulia dan agung dan tidak membutuhkan makhluk-makhluk-Nya; Dia Maha Perkasa dalam kerajaan-Nya dan Maha Bijaksana dalam mengatur segala urusan makhluk-Nya. Seandainya Allah menyegerakan siksaan bagi manusia akibat kekafiran mereka, niscaya Dia akan membinasakan mereka semua. Akan tetapi Allah menangguhkan mereka hingga waktu turunnya azab yang telah ditetapkan atau hingga datang ajal mereka. Dan jika waktu turunnya azab atau datang ajal mereka, maka mereka tidak akan dapat menunda atau mempercepatnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "60. لِلَّذِينَ لَا يُؤْمِنُونَ بِالْاٰخِرَةِ مَثَلُ السَّوْءِ ۖ (Orang-orang yang tidak beriman kepada kehidupan akhirat, mempunyai sifat yang buruk) Ini merupakan bantahan lain terhadap orang yang mengatakan bahwa para malaikat adalah anak perempuan Allah; yaitu seorang anak akan meniru sifat ayahnya. Yakni, mengapa mereka menjadikan jenis yang lebih lemah bagi Allah, padahal dengan mereka menjadikan bagi Allah keburukan-keburukan ini maka mereka menjadi orang-orang yang memiliki sifat yang buruk, yaitu kebodohan dan kekafiran kepada Allah. وَلِلّٰهِ الْمَثَلُ الْأَعْلَىٰ ۚ( dan Allah mempunyai sifat yang Maha Tinggi) Seperti kekayaan yang Maha sempurna, kemurahan yang Maha luas, dan pengetahuan yang Maha dalam."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "60. Bagi orang-orang kafir itu sifat jahat dan buruk. As-Suu’u adalah setiap sesuatu yang jahat, yaitu mengubur hidup-hidup anak perempuaan dan terlalu mencintai anak laki-laki karena mereka sangat membutuhkan laki-laki untuk berperang dan perkara hidup lain. Dan sifat yang luhur itu hanya milik Allah. Dialah Dzat yang Sempurna secara mutlak dan tidak butuh kepada siapapun. Dialah Dzat yang berkuasa di kerajaanNya. Dia Maha Kuasa, Maha Sempurna Kekuasaannya dan disifati dengan kesempurnaan hikmah dalam ciptaan dan aturanNya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bagi orang-orang yang tidak beriman pada akhirat itu sifat yang buruk} sifat yang buruk, yaitu bergantung pada anak, bodoh dan kufur {sedangkan bagi Allah itu sifat Yang Maha tinggi} sifat yang Maha tinggi, Maha sempurna secara mutlak dari segala sisi {dan Dia Maha perkasa lagi Maha bijaksana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "60. Manakala ini termasuk perumpamaan buruk yang dilekatkan kepada Allah oleh para musuhNya dari kalangan kaum musyrikin, maka Allah berfirman “orang orang yang tidak beriman kepada kehidupan akhirat, mempunyai sifat yang buruk” yaitu sifat negatif dan aib yang klimaks “dan Allah mempunyai sifat yang Mahatinggi” maksudnya setiap sifat kesempurnaan. di alam semesta ini maka Allah lebih berhak dengannya tanpa mengakibatkan efek kekurangan dari sisi manapun. Dan Allah mempunyai sifat yang Maha tinggi di hati para waliNya, berupa pengagungan, penghormatan, kecintaan, inabah, dan ma’rifah, ”dan Dialah yang Maha perkasa” yang mengalahkan segala sesuatu, dan semua makhluk tunduk kepadaNya secara keseluruhan, ”lagi Maha bijaksana” yang telah meletakan segala sesuatu (persis) pada tempatnya, tidak menetapkan perintah atau berbuat kecuali yang berdampak pujian dan sanjungan atas kesempurnaanNya dalam urusan itu."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (مَثَلُ ٱلسَّوۡءِۖ) matsalus sau` : “sifat yang buruk” sifat yang jelek. (وَلِلَّهِ ٱلۡمَثَلُ ٱلۡأَعۡلَىٰۚ) walillaahil matsalul a’laa : “dan Allah mempunyai sifata Yang Mahatinggi” sifat yang tinggi yaitu tidak ada Tuhan yang berhak disembah kecuali Allah. Makna ayat: Allah berfirman : “Bagi orang-orang yang tidak beriman kepada akhirat, mempunyai sifat yang buruk.” Allah ta’ala mengabarkan bahwa orang-orang yang tidak beriman dengan akhirat lagi mengingkari hari kebangkitan mereka memiliki sifat yang buruk, karena kebodohan dan kegelapan jiwa mereka. Mereka tidak mengetahui kebaikan tidak pula meniggalkan keburukan, karena tidak adanya iman kepada hisab dan pembalasan, maka memiliki sifat yang buruk dari segala sisi. “dan Allah mempunya sifat Yang Maha Tinggi.” Sifat yang indah yaitu laa ilaaha ilallaah, Mahasuci dari segala kekurangan, Rabb segala sesuatu dan pemiliknya, di tangan-Nya-lah seluruh kebaikan dan Dia Maha Kuasa atas segala sesuatu, tidak ada sekutu bagi-Nya, tidak pula anak. Firman-Nya “Dan Dia Mahaperkasa, Mahabijaksana.” Pujian kepada diri-Nya dengan sifat keagungan dan kekuasaan atas segala sesuatu, serta hikmah yang tinggi dalam pengaturan kehidupan hamba-hamba-Nya serta hukum dan keputusan-Nya, tidak ada tuhan yang berhak disembah kecuali Dia. Pelajaran dari ayat: • Penjelasan kebodohan mereka terhadap Allah ta’ala mereka beriman dengan-Nya, namun tidak tahu tentang sifat-sifat-Nya hingga mereka menisbatkan anak dan sekutu kepada-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 60: Misalnya berani mengubur hidup-hidup bayi perempuan. Yaitu semua sifat sempurna. Semua kesempurnaan yang ada, maka Allah lebih berhak terhadapnya tanpa ada kekurangan sedikit pun dari berbagai sisi. Dia memiliki sifat yang tinggi di hati wali-wali-Nya, di mana mereka mengagungkan-Nya, memuliakan-Nya, mencintai-Nya, mengenali-Nya, dan kembali kepada-Nya. Ada pula yang menfasirkan dengan Laailaahaillalah (tidak ada tuhan yang berhak disembah selain Allah). Yang berkuasa terhadap semuanya, dan semua makhluk tunduk kepada-Nya. Dia menempatkan sesuatu pada tempatnya, Dia tidak memerintah dan melarang, serta tidak berbuat kecuali perintah, larangan dan perbuatan-Nya berhak mendapat pujian yang sempurna."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 60",
    "description": "Allah menegaskan bahwa bagi orang-orang yang tidak beriman pada kehidupan akhirat, ada sifat, sikap, dan perbuatan yang buruk; dan Allah yang maha esa dan mahakuasa mempunyai sifat yang mahatinggi. Ketinggian, kesucian, dan kekuasaan-Nya tidak dapat dijangkau oleh siapa pun dari makhluk-Nya. Dan dia mahaperkasa atas segala sesuatu, mahabijaksana dalam kekuasaan-Nya dengan menempatkan sesuatu sesuai hikmah yang ditetapkan-Nya. Salah satu bentuk kebijaksanaan Allah adalah tidak serta merta mengazab orang yang bersalah. Dan kalau Allah menghukum manusia secara langsung karena kezaliman dan dosa-Nya, seperti syirik dan kufur, niscaya tidak akan ada yang ditinggalkan-Nya di bumi ini dari makhluk yang melata sekalipun, tetapi Allah tidak melakukan hal demikian. Dia mampu melakukannya, tetapi karena kebijaksanaan-Nya, dia memilih untuk menangguhkan hukuman dan azab bagi mereka sampai waktu yang sudah ditentukan oleh-Nya. Maka apabila ajalnya tiba sesuai dengan waktu yang telah ditentukan, mereka tidak dapat meminta penundaan atau percepatan sesaat pun atas azab itu."
  }
]