[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan seandainya(secara langsung) Allah menghukum manusia atas kekafiran dan kedustaan mereka, pastilah Dia tidak akan menyisakan sesuatu yang bergerak di muka bumi ini. akan tetapi Dia memberikan kesempatan hidup kepada mereka sampai waktu tertentu yaitu akhir ajal mereka. Lalu apabila telah datang ajal mereka, mereka tidak akan mundur darinya, dan tidak maju barang sedikitpun."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "61. Seandainya Allah -Subḥānahu- menghukum manusia karena kekufuran dan kezaliman mereka, niscaya Dia tidak akan menyisakan apa yang ada di muka bumi berupa manusia dan hewan yang merangkak di atasnya, akan tetapi Allah -Subḥānahu- menunda hingga masa tertentu dalam ilmu-Nya. Bila masa tersebut datang maka mereka tidak bisa memajukan atau memundurkannya sedikit pun."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "61. وَلَوْ يُؤَاخِذُ اللهُ النَّاسَ بِظُلْمِهِم (Jikalau Allah menghukum manusia karena kezalimannya) Yang dimaksud dengan manusia di sini adalah orang-orang kafir dan pelaku kemaksiatan. Dan kezaliman mereka adalah perkataan orang-orang musyrik bahwa berhala-berhala merupakan anak-anak perempuan Allah. مَّا تَرَكَ عَلَيْهَا(niscaya tidak akan ditinggalkan-Nya di muka bumi) Yakni di atas muka bumi. مِن دَآبَّةٍ(sesuatupun dari makhluk yang melata) Makna (الدابة) yakni semua hewan yang merayap di muka bumi. Yakni Allah akan membinasakan orang zalim sebagai siksaan baginya dan membinasakan yang lainnya akibat keburukan perbuatan orang zalim; Allah akan mencegah turunnya hujan sehingga mereka semua binasa, atau menurunkan kepada mereka musibah-musibah lain. Imam Qatadah berkata: Allah telah melakukan hal tersebut pada zaman Nabi Nuh; Allah membinasakan binatang-binatang yang ada di muka bumi kecuali yang diangkut ke atas perahu. وَلٰكِن يُؤَخِّرُهُمْ إِلَىٰٓ أَجَلٍ مُّسَمًّى ۖ( tetapi Allah menangguhkan mereka sampai kepada waktu yang ditentukan) Yakni ujung kehidupan dan batas umur mereka, atau waktu turunnya azab mereka. فَإِذَا جَآءَ أَجَلُهُمْ لَا يَسْتَـْٔخِرُونَ سَاعَةً ۖ وَلَا يَسْتَقْدِمُونَ(Maka apabila telah tiba waktunya (yang ditentukan) bagi mereka, tidaklah mereka dapat mengundurkannya barang sesaatpun dan tidak (pula) mendahulukannya) Tafsir kalimat ini telah disebutkan pada surat al-A’raf: 34."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "61. Dan jika Allah langsung menghukum manusia yang kafir atau seluruh orang yang bermaksiat dan syirik, maka tidak ada satupun makhluk yang melata di bumi karena adanya pembinasaan orang-orang zalim. Namun Allah menghendaki untuk mengabaikan dan menunda hukuman mereka sampai waktu tertentu, yaitu waktu penyiksaan mereka. Dan jika siksa itu telah tiba bagi mereka atau waktu hidup mereka sudah berakhir, maka hal itu tidak akan ditunda dan didahulukan dari mereka meskipun hanya sesaat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika Allah menghukum manusia karena kezaliman mereka} karena kekufuran dan kemaksiatan mereka {niscaya Dia tidak meninggalkan satu makhluk melata pun di atasnya} di bumi {tetapi Dia menangguhkan mereka} menangguhkan mereka {sampai waktu yang sudah ditentukan. Maka apabila ajal mereka tiba, mereka tidak dapat meminta penundaan sesaat pun dan tidak bisa meminta percepatan} meteka tidak dapat memajukannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "61. usai menyebutkan kebohongan yang diadakan oleh orang orang yang zhalim terhadap Allah, maka Allah menyebutkan kesempurnaan sifat santun dan sabarNya. Allah berfirman ”jikalau Allah menghukum manusia karena kezhalimannya” tanpa penambahan maupun pengurangan “niscaya tidak akan ditinggalkanNya” di muka bumi “sesuatupun dari makhluk yang melata dan binatang binatang. Sesungguhnya, efek buruk kemaksiatan bisa mengakibatkan kehancuran tanaman dan kelangsungan makhluk hidup. ”tetapi Allah menangguhkan mereka” dari penyegaran hukuman pada mereka “sampai kepada waktu yang ditentukan” yaitu hari kiamat ”maka apabila telah tiba waktu yang telah ditentukan bagi mereka dapat mengundurkannya barang sesaatpun tidak (pula) mendahulukannya, maka hendaklah mereka berhati hati selama masih dalam masa penangguhan, sebelum datangnya waktu yang tiada penundaan lagi di dalamnya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (أَنَّ لَهُمُ ٱلۡحُسۡنَىٰۚ) anna lahumul husnaa : “bahwa yang sesungguhnya segala yang baik untuk mereka.” yaitu surga, mereka berkata “dan jika dikembalikan kepada Rabbku, sesungguhnya aku akan memperoleh kebaikan di sisi-Nya.” [Fushshilat:50]. Makna ayat: Firman-Nya “Dan kalau Allah menghukum manusia karena kezalimannya, niscaya tidak akan ada yang ditinggalkan-Nya” di atas bumi “dari makhluk yang melata sekalipun” jenis yang berjalan di atas bumi berupa manusia atau hewan. Ini adalah sebab tidak dihukumnya orang yang tidak beriman dengan hari akhir sedangkan mereka berbuat kerusakan dan kejahatan. Penangguhan ini berdasarkan hikmah yang tinggi yang dijelaskan pada Firman-Nya “tetapi Allah menangguhkan mereka sampai waktu yang sudah ditentukan.” Waktu tertentu yang telah ditentukan, bisa jadi ujung umur seseorang kemudian Allah membalas setiap amal buruk mereka dengan setimpal, dan Dia tidak pernah sekalipun zalim kepada hamba-Nya. Pelajaran dari ayat: • Penjelasan sebab dibiarkannya orang-orang zalim berbuat zalim, keburukan, serta kerusakan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 61: Setelah Allah Subhaanahu wa Ta'aala menyebutkan kedustaan orang-orang zalim terhadap-Nya, maka Allah menyebutkan sempurnanya santun-Nya dan kesabaran-Nya. Yakni karena maksiatnya. Yakni tentu Dia akan membinasakan para pelaku maksiat dan selainnya, termasuk hewan. Yaitu hari kiamat. Oleh karena itu, hendaknya mereka berhati-hati di waktu penangguhan sebelum datang waktu yang di sana tidak ada lagi penangguhan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 61",
    "description": "Salah satu bentuk kebijaksanaan Allah adalah tidak serta merta mengazab orang yang bersalah. Dan kalau Allah menghukum manusia secara langsung karena kezaliman dan dosa-Nya, seperti syirik dan kufur, niscaya tidak akan ada yang ditinggalkan-Nya di bumi ini dari makhluk yang melata sekalipun, tetapi Allah tidak melakukan hal demikian. Dia mampu melakukannya, tetapi karena kebijaksanaan-Nya, dia memilih untuk menangguhkan hukuman dan azab bagi mereka sampai waktu yang sudah ditentukan oleh-Nya. Maka apabila ajalnya tiba sesuai dengan waktu yang telah ditentukan, mereka tidak dapat meminta penundaan atau percepatan sesaat pun atas azab itu. Dan mereka menetapkan bagi Allah apa yang mereka sendiri membencinya, yaitu anak perempuan. Dan lidah mereka mengucapkan kebohongan'walaupun boleh jadi hati mereka sendiri tidak membenarkannya'bahwa sesungguhnya segala yang baik-baik dalam kehidupan dunia dan akhirat hanyalah untuk mereka. Allah menegaskan, tidaklah dapat diragukan bahwa nerakalah yang pantas menjadi tempat kembali dan tempat tinggal bagi mereka, dan sesungguhnya mereka segera akan dimasukkan ke dalamnya."
  }
]