[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan diantara bentuk keburukan perilaku mereka, bahwasannya mereka menjadikan bagi Allah anak-anak perempuan yang mereka benci, dan lisan mereka berkata dengan dusta: “bahwannya mereka akan mendapatkan kesudahan nasib yang baik. Sebenarnya, bagi mereka adalah neraka, dan bahwasannya mereka di dalamnya diabaikan lagi dilupakan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "62. Mereka menisbahkan kepada Allah -Subḥānahu- sesuatu yang mereka sendiri tidak suka bila hal tersebut dinisbahkan kepada diri mereka, yaitu anak perempuan. Lisan mereka mengucapkan kebohongan dengan mengaku bahwa mereka mempunyai kedudukan mulia bila memang benar mereka akan dibangkitkan sebagaimana yang mereka nyatakan. Benar, bagi mereka adalah Neraka, mereka dibiarkan di dalamnya, tidak keluar darinya untuk selama-lamanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "62. Dan bagian dari kekafiran mereka, mereka menganggap Allah memiliki anak-anak perempuan yang sebenarnya mereka sendiri tidak menyukainya. Dan lidah mereka mengatakan kedutaan besar bahwa kelak mereka akan mendapatkan surga. Tidak demikian, namun balasan mereka adalah neraka; di sana mereka akan dicampakkan dan dilupakan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "62. وَيَجْعَلُونَ لِلّٰهِ مَا يَكْرَهُونَ (Dan mereka menetapkan bagi Allah apa yang mereka sendiri membencinya) Yakni anak perempuan yang tidak mereka inginkan. وَتَصِفُ أَلْسِنَتُهُمُ الْكَذِبَ أَنَّ لَهُمُ الْحُسْنَىٰ ۖ( dan lidah mereka mengucapkan kedustaan, yaitu bahwa sesungguhnya merekalah yang akan mendapat kebaikan) Yakni mendapat anak laki-laki. Pendapat lain mengatakan yakni mendapat balasan yang baik. لَا جَرَمَ أَنَّ لَهُمُ النَّارَ(Tiadalah diragukan bahwa nerakalah bagi mereka) Yakni mereka benar-benar mereka akan mendapatkan neraka yang mereka siapkan untuk diri mereka sendiri. وَأَنَّهُم مُّفْرَطُونَ(dan sesungguhnya mereka segera dimasukkan) Yakni ditinggal dan dicampakkan di neraka. Imam Qatadah berpendapat yakni mereka didahulukan untuk memasuki neraka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "62. Mereka menisbahkan kepada Allah sesuatu yang mereka benci, yaitu anak perempuan. Dan mereka berdusta dengan mengklaim bahwa mereka akan mendapatkan tempat yang baik, yaitu surga. Sungguh bagi mereka itu neraka. Sesungguhnya mereka itu ditelantarkan di dalam neraka atau mereka didahulukan atau cepat-cepat dimasukkan ke dalamnya sebelum orang lain"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka menetapkan} menghubungkan {bagi Allah sesuatu yang mereka benci dan lidah mereka mengucapkan} menuduhkan {kebohongan bahwa sesungguhnya bagi merekalah (balasan) yang terbaik} kesudahan yang baik di sisi Allah {Tidak diragukan} tidak diragukan bahwa bagi mereka itu neraka dan sesungguhnya mereka akan segera dimasukkan} ditinggalkan dan dilupakan di dalamnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "62. Allah mengabarkan bahwasannya kaum musyrikin “menetapkan bagi Allah sesuatu yang mereka sendiri membencinya” berupa (penisbatan) anak perempuan dan sifat sifat buruk (kepadaNya) yaitu perbuatan syirik dengan mengarahkan sebagian dari peribadahan kepada sejumlah makhluk yang sebenar benarnya merupakan hamba Allah. Sebagaimana mereka itu benci dan tidak rela kalau budak mereka padahal mereka sejenis menjadi sekutu mereka dalam rizki yang Allah berikan kepada mereka, lalu kenapa mereka menetapkan beberapa sekutu bagi Allah yang berasal dari hambaNya? ”dan“ mereka bersama perbuatan buruk yang besar ini ”lidah mereka mengucapkan kedustaan, yaitu merekalah yang akan mendapatkan kebaikan” maksudnya bahwa mereka akan menjumpai keadaan yang baik di dunia dan akhirat. Maka Allah membantah mereka dengan berfirman ”tiadalah diragukan bahwa nerakalah bagi mereka, dan bahwa mereka segera dimasukkan (ke dalamnya)”, mereka didahulukan masuk ke neraka, tinggal di dalamnya, tidak keluar darinya selamanya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (وَأَنَّهُم مُّفۡرَطُونَ) wa`annahum mufrathuun : “dan mereka akan segera dimasukkan ke dalamnya.” Masuk dan ditinggalkan di dalam Jahanam. Makna ayat: Pada akhir ayat (62) terdapat ancaman dengan menjelaskan akhir yang buruk bagi orang yang tidak beriman kepada hari akhir. Itu terjadi karena kebodohan mereka terhadap Allah, serta buruknya pemahaman mereka karena jiwa mereka yang gelap. Mereka menjadikan untuk Allah apa yang mereka benci berupa anak perempuan, sekutu-sekutu, serta mencela Rasul dan merendahkannya serta menyombongkan diri dengan berdusta bahwa mereka akan mendapatkan balasan yang baik yaitu surga pada hari kiamat kelak. Maka Allah membalas kedustaan dan perkataan ngawur mereka dengan Firman-Nya “tidaklah diragukan” benar dan tidak dipungkiri lagi “bahwa bagi merekalah neraka” sebagai ganti dari surga “dan sesungguhnya mereka segera akan dimasukkan ke dalamnya.” Dimasukkan dan ditinggalkan di dalamnya menetap selamanya. Inilah kandungan dari Firman-Nya “Dan mereka menetapkan bagi Allah apa yang mereka sendiri membencinya, dan lidah mereka mngucapkan kebohongan, bahwa sesungguhnya segala yang baik-baik untuk mereka. tidak diragukan lagi bahwa nerekalah bagi mereka, dan sesungguhnya mereka segera akan dimasukkan ke dalamnya.” Jika dibaca dengan mufrithuun dengan bentuk fa’il (subjek) maka mereka adalah orang-orang yang berlebih-lebihan dalam berbuat kerusakan, keburukan, kekufuran, dan kesesatan serta kemerosotan yang jauh. Pelajaran dari ayat: • Penjelasan buruknya keyakinan orang-orang yang tidak beriman dengan hari akhir, mereka menyandarkan balasan yang baik untuk mereka dan memberikan hal yang tidak mereka sukai untuk Allah, berupa anak perempuan, sekutu-sekutu, dan penghinaan terhadap para rasul."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 62: Yakni orang-orang musyrik. Seperti anak perempuan, adanya sekutu dalam kepemimpinan, dan menghinakan para rasul. Yakni surga atau keadaan yang baik di dunia dan akhirat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 62",
    "description": "Dan mereka menetapkan bagi Allah apa yang mereka sendiri membencinya, yaitu anak perempuan. Dan lidah mereka mengucapkan kebohongan'walaupun boleh jadi hati mereka sendiri tidak membenarkannya'bahwa sesungguhnya segala yang baik-baik dalam kehidupan dunia dan akhirat hanyalah untuk mereka. Allah menegaskan, tidaklah dapat diragukan bahwa nerakalah yang pantas menjadi tempat kembali dan tempat tinggal bagi mereka, dan sesungguhnya mereka segera akan dimasukkan ke dalamnya. Kaum kafir mekah bukanlah umat pertama yang berbuat demikian. Demi Allah, sungguh kami telah mengutus para rasul, seperti hud, salih, musa, dan isa kepada umat-umat mereka sebelum kami mengutus engkau, wahai nabi Muhammad, kepada umatmu. Meski kaum-kaum itu mendapat dakwah dari para rasul, tetapi setan menjadikan terasa indah dan baik bagi mereka perbuatan buruk mereka seperti yang umatmu lakukan kepadamu. Setan berhasil menipu mereka sehingga dia menjadi pemimpin dan panutan mereka pada hari ini sebagaimana dia juga menjadi pemimpin dan panutan kaummu yang durhaka. Dan mereka semua yang telah, sedang, dan akan melakukan keburukan pasti akan mendapat azab yang sangat pedih di akhirat kelak."
  }
]