[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Demi Allah sesungguhnya kami telah mengutus rasul-rasul kepada umat-umat sebelummu (wahai rasul), lalu setan menjadikan mereka memandang baik apa yang mereka perbuat berupa kekafiran, pendustaan dan penyembahan kepada selain Allah. Setan menyetir penyimpangan mereka di dunia, dan bagi mereka di akhirat kelak siksaan menyakitkan lagi pedih."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "63. Demi Allah, Kami telah mengutus para rasul kepada umat-umat sebelummu wahai Rasul, lalu setan menghiasi untuk mereka amal perbuatan mereka yang buruk berupa kesyirikan, kekufuran dan kemaksiatan. Setan adalah penolong palsu mereka pada hari Kiamat maka silakan mereka meminta pertolongan kepadanya, dan bagi mereka pada hari Kiamat azab yang menyakitkan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "63. Allah bersumpah dengan Dzat-Nya yang agung untuk menegaskan bahwa Allah telah mengutus para rasul kepada umat-umat sebelum Nabi Muhammad; akan tetapi setan menghiasi keburukan dan dosa-dosa bagi mereka dan menjadikan mereka tersesat di dunia; dan di akhirat mereka akan mendapat azab yang menyakitkan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "63. فَزَيَّنَ لَهُمُ الشَّيْطٰنُ أَعْمٰلَهُمْ (tetapi syaitan menjadikan umat-umat itu memandang baik perbuatan mereka) Yakni perbuatan buruk mereka. فَهُوَ وَلِيُّهُمُ الْيَوْمَ(maka syaitan menjadi pemimpin mereka di hari itu) Yakni setan menjadi teman mereka di dunia. Pendapat lain mengatakan yakni setan adalah penolong mereka di hari kiamat, maka hendaklah mereka meminta pertolongan kepadanya jika ia dapat menolong."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "63. Demi Allah, sungguh Kami telah mengutus para rasul kepada umat-umat sebelummu, lalu setan menghiasi amal-amal buruk mereka, Setan memalingkan mereka dari perintah, penolong dan pembantu mereka di dunia. Dan bagi mereka itu azab yang sangat menyakitkan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Demi Allah, sungguh Kami telah mengutus (rasul-rasul) kepada umat-umat sebelummu. lalu setan menjadikan terasa indah} menghiasi {perbuatan mereka sehingga dia menjadi pemimpin mereka pada hari ini dan bagi mereka itu azab yang sangat pedih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "63. Allah menerangkan kepada RasulNya bahwa dia bukanlah utusan Allah yang pertama kali yang didustakan. Allah berfirman ”Demi Allah, sesungguhnya kami telah mengutus rasul rasul kami kepada umat umat sebelum kamu” beberapa rasul yang menyeru mereka kepada tauhid ”tetapi setan menjadikan umat umat itu memandang baik perbuatan mereka (yang buruk), maka jadilah setan itu “pemimpin mereka” di dunia. Mereka menaati setan, mengikutii dan mengangkatnya sebagai pemimpin. “dan mereka mendapatkan azab yang pedih” di akhirat (kelak) lantaran berbelok arah dari kepemimpinan ar Rahman dan rela dengan komando setan. Karena itu, mereka pantas untuk dihukum dengan siksaan kehinaan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (تَٱللَّهِ) tallaah : “Demi Allah” (أَرۡسَلۡنَآ إِلَىٰٓ أُمَمٖ مِّن قَبۡلِكَ) arsalnaa ilaa umamim min qablik : “sungguh Kami telah mengutus kepada umat-umat sebelum engkau.” Yaitu mengutus rasul-rasul. (فَزَيَّنَ لَهُمُ ٱلشَّيۡطَٰنُ أَعۡمَٰلَهُمۡ) fazayyana lahumusy syaithaan a’maalahum : “tetapi setan menjadikan terasa indah bagi mereka perbuatan mereka yang buruk.” Oleh karena itu mereka mendustakan para rasul. (فَهُوَ وَلِيُّهُمُ ٱلۡيَوۡمَ) fahuwa waliyyuhumul yaum : “sehingga dia menjadi pemimpin mereka pada hari ini.” Setan, menjadi pemimpin mereka hari ini, yaitu di dunia. Makna ayat: Allah ta’ala bersumpah kepada rasul-Nya, seraya berfirman Demi Allah wahai rasul Kami “sesungguhnya Kami telah mengutus” para rasul “kepada umat-umat terdahulu” mereka dahulu kaum musyrik dan kafir sebagaimana kaummu “Maka setan menghiasi perbuatan mereka” mereka melawan rasul-rasul Kami, memerangi mereka, dan terus menerus berada dalam kesyirikan dan kekufuran, lalu setan menguasai mereka, oleh karena itu “sehingga dia menjadi pemimpin mereka pada hari ini” di dunia “dan bagi mereka” di akhirat “azab yang sangat pedih.” Konteks ayat ini adalah untuk menghibur Rasulullah shalallahu ‘alaihi wa sallam, Pelajaran dari ayat: • Penjelasan bahwa Allah bersumpah dengan diri-Nya dan segala sesuatu yang Dia kehendaki. • Penjelasan bahwa Allah mengutus para rasul kepada umat-umat terdahulu dan setan menghiasi perbuatan mereka lalu meninggalkan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 63: Allah Subhaanahu wa Ta'aala menerangkan, bahwa Beliau bukanlah rasul pertama yang didustakan. Yang menyeru kepada tauhid. Yaitu mendustakan para rasul, dan mereka menyangka bahwa sikap mereka itu benar, sedangkan yang diserukan rasul adalah salah karena dihias oleh setan. Yakni di dunia atau pada hari kiamat. Pada hari kiamat setan menjadi wali mereka, padahal dia lemah; menolong dirinya dari azab saja tidak mampu, apalagi menolong orang lain. Karena mereka berpaling dari Allah, dan lebih ridha menjadikan setan -yang sebenarnya musuhnya- sebagai walinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 63",
    "description": "Kaum kafir mekah bukanlah umat pertama yang berbuat demikian. Demi Allah, sungguh kami telah mengutus para rasul, seperti hud, salih, musa, dan isa kepada umat-umat mereka sebelum kami mengutus engkau, wahai nabi Muhammad, kepada umatmu. Meski kaum-kaum itu mendapat dakwah dari para rasul, tetapi setan menjadikan terasa indah dan baik bagi mereka perbuatan buruk mereka seperti yang umatmu lakukan kepadamu. Setan berhasil menipu mereka sehingga dia menjadi pemimpin dan panutan mereka pada hari ini sebagaimana dia juga menjadi pemimpin dan panutan kaummu yang durhaka. Dan mereka semua yang telah, sedang, dan akan melakukan keburukan pasti akan mendapat azab yang sangat pedih di akhirat kelak. Kami mengutus para rasul untuk menjelaskan hukum-hukum Allah kepada kaum masing-masing, memberi mereka ketenangan batin, dan menyelesaikan perselisihan di antara mereka. Dan kami tidak menurunkan kitab Al-Qur'an ini kepadamu, wahai nabi Muhammad, melainkan agar engkau dapat menjelaskan kepada mereka (umatmu) apa yang mereka perselisihkan dalam hal agama, sehingga mereka dapat membedakan perkara yang benar dan yang salah. Kami menurunkan Al-Qur'an dengan tujuan tersebut serta menjadi petunjuk dan penuntun bagi manusia menuju jalan yang benar, dan menjadi rahmat bagi orangorang yang sudah dan hendak beriman."
  }
]