[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kami tidaklah menurunkan al-qur’an kepadamu (wahai rasul), kecuali supaya kamu menerangkan kepada manusia perkara agama dan hukum-hukum yang mereka perselisihkan, sehingga hujjah agak tegak di hadapan mereka melalui penjelasanmu, yang tidak meniggalkan satu jalanpun bagi kebatilan untuk merasuk kedalam jiwa. Dan juga karena al-qur’an adalah hidayah yang tidak meninggalkan satu celahpun untuk bimbang, serta sebagai rahmat bagi kaum mukminin dalam sikap mereka mengikuti petunjuk dan menjauhi kesesatan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "64. Kami tidak menurunkan Al-Qur`ān kepadamu -wahai Rasul- kecuali agar kamu menjelaskan kepada seluruh manusia apa yang mereka perselisihkan berupa urusan Tauhid, kebangkitan dan hukum-hukum syariat, agar Al-Qur`ān menjadi hidayah dan rahmat bagi orang-orang yang beriman kepada Allah dan rasul-rasul-Nya serta kepada apa yang Allah bawa, mereka adalah orang-orang yang mengambil faedah dari kebenaran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "64. Hai Nabi, tidaklah Kami menurunkan al-Qur'an kepadamu melainkan agar kamu menjelaskan kepada manusia dengan sejelas-jelasnya perkara agama yang mereka perselisihkan, dan agar al-Qur'an itu dapat menjadi hidayah bagi manusia dan rahmat bagi orang yang beriman kepada risalahmu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "64. لِتُبَيِّنَ لَهُمُ الَّذِى اخْتَلَفُوا۟ فِيهِ ۙ (agar kamu dapat menjelaskan kepada mereka apa yang mereka perselisihkan itu) Tentang keesaan Allah, hari kebangkitan, dan hukum-hukum syar’i lainnya. وَهُدًى وَرَحْمَةً لِّقَوْمٍ يُؤْمِنُونَ(dan menjadi petunjuk dan rahmat bagi kaum yang beriman) Yakni beriman kepada Allah dan mempercayai apa yang dibawa oleh para Rasul dan apa yang terkandung dalam kitab-kitab Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "64. Dan Kami tidak menurunkan Al-Qur’an kepadamu, Wahai nabi kecuali supaya kamu menerangkan kepada manusia tentang apa yang mereka perdebatkan dalam perkara agama, seperti tauhid, takdir, keadaan para musuh, perkara hukum terkait halal-haram dan sebagai petunjuk menuju cahaya serta rahmat bagi kaum yang beriman kepada Allah, kitab-kitabNya, rasul-rasulNya dan mengerjakan perintahNya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami tidak menurunkan kitab ini} Al-Qur’an {kepadamu, kecuali agar kamu menjelaskan kepada mereka apa yang mereka perselisihkan serta menjadi petunjuk dan rahmat bagi kaum yang beriman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "64-65. Menenai Allah melalui curahan nasihat nasihat dan peringatan peringatanNYa, maka orang orang mengambilnya sebagai dalil bahwasannya Allah, Dialah Dzat yang disembah yang peribadahan itu tidak patut dikerjakan kecuali bagiNya semata, sebab Dia Dzat yang mencurahkan kenikmatan dengan turunnya hujan, tumbuhnya seluruh jenis tanaman (dan sebagai dalil) bahwasannya Allah Mahakuasa atas segala sesuatu, dan Dzat yang mengidupkan bumi setelah kematiannya, sanggup untuk menghidupkan orang orang yang sudah mati, dan bahwa Dzat yang menebarkan kebaikan ini betul betul mempunyai rahmat yang luas dan kemurahan yang agung."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat: oleh karena itu Allah ta’ala berfirman pada ayat yang kedua “dan Kami tidak menurukan Kitab” untuk menyulitkan atau menyiksamu tetapi agar engkau menjelaskan kepada manusia yang mereka berselisih dalam tauhid dan syirik, dan petunjuk dan kesesatan. Sebagaimana Kami menurunkan kitab sebagai petunjuk yang digunakan kaum mukminin menuju jalan kebahagiaan dan keselamatan mereka, serta rahmat yang dapat diraih dengan mengamalkannya (kitab) dengan mempraktekkannya baik dari segi akidah, ibadah, akhlak, adab, dan hukum. Maka mereka hidup dengan saling menyayangi berdasarkan persaudaraan dan rasa sayang, serta rahmat dan keselamatan senantiasa meliputi mereka. Pelajaran dari ayat: • Penegasan kenabian dan hiburan bagi Rasulullah shalallahu ‘alaihi wa sallam dari apa yang beliau hadapi dari kaum musyrikin. • Penjelasan tugas Rasulullah shalallahu ‘alaihi wa sallam, yaitu sebagai penyampai apa yang Allah ta’ala turunkan kepad para hamba-Nya berupa wahyu dari kitab-Nya. • Penjelasan bahwa Al-Qur’an adalah petunjuk dan rahmat bagi kaum mukminin yang mengamalkannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 64: Tentang perkara agama, dan jalan mana yang benar."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 64",
    "description": "Kami mengutus para rasul untuk menjelaskan hukum-hukum Allah kepada kaum masing-masing, memberi mereka ketenangan batin, dan menyelesaikan perselisihan di antara mereka. Dan kami tidak menurunkan kitab Al-Qur'an ini kepadamu, wahai nabi Muhammad, melainkan agar engkau dapat menjelaskan kepada mereka (umatmu) apa yang mereka perselisihkan dalam hal agama, sehingga mereka dapat membedakan perkara yang benar dan yang salah. Kami menurunkan Al-Qur'an dengan tujuan tersebut serta menjadi petunjuk dan penuntun bagi manusia menuju jalan yang benar, dan menjadi rahmat bagi orangorang yang sudah dan hendak beriman. Dan Allah menurunkan air hujan dari arah langit sesuai kadar yang ditentukan-Nya. Dan dengan air itu dihidupkan-Nya bumi dengan tumbuhnya berbagai jenis tanaman dan tumbuhan di permukaannya yang tadinya sudah mati, kering, dan tampak tanpa tanda kehidupan. Sungguh, pada yang demikian itu, yaitu turunnya air dari langit beserta proses yang terjadi padanya dan akibat yang ditimbulkannya terhadap permukaan bumi, benar-benar terdapat tanda-tanda kebesaran, kekuasaan, dan keesaan Allah bagi orang-orang yang mau mendengarkan dan mengambil pelajaran."
  }
]