[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Allah Dialah yang menurunkan hujan dari awan, lalu mengeluarkan dengannya berbagai jenis tumbuh-tumbuhan dari tanah setelah sebelumnya tandus lagi kering. Sesungguhnya dalam kejadian diturunkannya air hujan dan ditumbuhkannya tanam-tanaman, benar-benar terdapat bukti petunjuk atas kuasa Allah untuk membangkitkan (yang sudah mati) dan (menunjukan) sifat keesaanNya bagi kaum yang mau mendengar dengan baik, merenung, taat kepada Allah dan bertakwa kepadaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "65. Allah menurunkan hujan dari ketinggian, dengannya Allah menghidupkan bumi yaitu menumbuhkan pepohonan di atasnya padahal sebelumnya bumi itu tandus dan kering. Sesungguhnya diturunkannya hujan dari arah langit dan ditumbuhkannya pepohonan di muka bumi dengan hujan tersebut mengandung bukti nyata atas kemahakuasaan Allah bagi kaum yang mendengar Firman Allah dan merenungkannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "65. Allah menyampaikan besarnya karunia-Nya yang telah diberikan kepada manusia agar mereka mau bersyukur dan menyembah-Nya, sebagaimana yang akan disebutkan dalam 9 ayat ini: Allah menurunkan hujan dari awan, kemudian dengan air hujan itu Allah menumbuhkan tanaman-tanaman dari tanah yang sebelumnya kering kerontang. Sungguh dalam air yang berkah dan kebaikan yang agung ini terdapat tanda kekuasaan Allah dalam membangkitkan dan tanda sifat ketuhanan-Nya bagi orang-orang yang mau mendengar kebenaran."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "65. فَأَحْيَا بِهِ الْأَرْضَ بَعْدَ مَوْتِهَآ ۚ (dan dengan air itu dihidupkan-Nya bumi sesudah matinya) Yakni Allah menghidupkannya dengan tanaman yang sebelumnya kering dan mati. إِنَّ فِى ذٰلِكَ(Sesungguhnya pada yang demikian itu) Yakni pada penurunan hujan dan penghidupan bumi. لَاٰيَةً (benar-benar terdapat tanda-tanda (kebesaran Tuhan)) Yang menunjukkan keesaan Allah dan kuasa-Nya untuk membangkitkan makhluk-makhluk-Nya dan membalas mereka. لِّقَوْمٍ يَسْمَعُونَ(bagi orang-orang yang mendengarkan) Yakni yang mendengar firman Allah dan memahami pelajaran-pelajaran yang dikandungnya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ إِنَّ فِي ذَٰلِكَ لَآيَةً لِقَوْمٍ يَسْمَعُونَ } \"Sesungguhnya pada yang demikian itu benar-benar terdapat tanda-tanda (kebesaran Tuhan) bagi orang-orang yang mendengarkan (pelajaran)\" Mendengarkan dengan tadabbur dan menghayati setiap makananya; karena mendengarkan dengan hati itulah yang bermanfaat, bukan sekedar mendengarkan dengarkan telinga, oleh karena itu barangsiapa yang mendengarkan ayat-ayat al-Qur'an dengan hatinya, dan senantiasa mentadabburi makananya dan bertafakkur tentangnya niscaya ia akan memperoleh manfaat yang banyak, sebaliknya jika mendengarkan ayat-ayat al-Qur'an tanpa hati, maka seakan-akan ia seperti orang yang tuli tidak mendengarkan apa-apa, dan ia tidak mendapatkan manfaat yang lebih."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "65. Dan Allah menurunkan hujan dari langit (awan), lalu dengan hujan itu, Dia menghidupkan bumi dengan berbagai tumbuhan yang mana sebelumnya tandus dan gersang tanpa ada kehidupan di dalamnya. Sesungguhnya dalam penurunan hujan dan penghidupan bumi itu terdapat tanda yang jelas dan hujjah yang menjelaskan tentang adanya Allah dan keesaan serta kuasaNya untuk membangkitkan bagi kaum yang merenung"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah menurunkan air dari langit dan dengan air itu Allah menghidupkan bumi sesudah kematianya} kekeringannya {Sesungguhnya pada yang demikian itu benar-benar terdapat tanda bagi kaum yang mendengarkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "64-65. Menenai Allah melalui curahan nasihat nasihat dan peringatan peringatanNYa, maka orang orang mengambilnya sebagai dalil bahwasannya Allah, Dialah Dzat yang disembah yang peribadahan itu tidak patut dikerjakan kecuali bagiNya semata, sebab Dia Dzat yang mencurahkan kenikmatan dengan turunnya hujan, tumbuhnya seluruh jenis tanaman (dan sebagai dalil) bahwasannya Allah Mahakuasa atas segala sesuatu, dan Dzat yang mengidupkan bumi setelah kematiannya, sanggup untuk menghidupkan orang orang yang sudah mati, dan bahwa Dzat yang menebarkan kebaikan ini betul betul mempunyai rahmat yang luas dan kemurahan yang agung."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ) inna fii dzaalika la`aayah : “Sungguh pada yang demikian itu benar-benar.” Tanda yang jelas akan kebenaran akidah adanya hari kebangkitan. (لِّقَوۡمٖ يَسۡمَعُون لَأٓيَةٗ) la`aayatal liqumiy yasma’uun : “tanda bagi orang-orang yang mendengarkan.” Mendengar, merenungi, dan memahami. Makna ayat: Setelah Allah menghibur Rasulullah shalallahu ‘alaihi wa sallam, konteks ayat kembali kepada ajakan untuk mengesakan Allah, serta meyakini adanya kebangkitan dan pembalasan, setelah penetapan nubuwah Nabi Muhammad shallallahu ‘alaihi wa sallam dengan Firman-Nya “Demi Allah, Kami telah mengutus rasul-rasul” hingga akhir ayat. Kemudian Firman-Nya “Dan Allah menurunkan air dari langit, kemudian menghidupkan bumi setelah matinya.” Yaitu air hujan, hidupnya bumi adalah dengan tumbuhnya tanaman, kemudian hujan pun turun setelah bumi itu mati, tidak ada tetumbuhan di atasnya. Firman-Nya “Seseungguhnya pada yang demikian itu, “ yaitu perkara yang telah disebutkan berupa turunnya air dari langit dan hidupnya bumi sesudah matinya “terdapat tanda” yang jelas akan wujud Allah ta’ala, kekuasaan, ilmu, dan rahmat-Nya, terlebih lagi ayat ini menunjukkan adanya kebangkitan setelah kematian. Pelajaran dari ayat: • Hidupnya bumi setelah kering adalah bukti akan adanya kebangkitan dan kehidupan kedua. Yang Mahakuasa untuk menghidupkan bumi sesudah kematiannya pasti mampu untuk menghidupkan kembali mayit-mayit yang telah hancur dan binasa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 65: Dengan tumbuhnya pepohonan. Yakni terdapat tanda yang menunjukkan mampunya Dia membangkitkan manusia yang telah mati. Di samping itu, di sana pun terdapat tanda bahwa hanya Dia yang berhak diibadahi, karena Dia yang telah menurunkan hujan dan menumbuhkan tanaman, dan bahwa Dia memiliki rahmat yang luas serta kepemurahan yang besar karena telah menyebarkan ihsan-Nya. Yakni mendengar yang disertai tadabur."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 65",
    "description": "Dan Allah menurunkan air hujan dari arah langit sesuai kadar yang ditentukan-Nya. Dan dengan air itu dihidupkan-Nya bumi dengan tumbuhnya berbagai jenis tanaman dan tumbuhan di permukaannya yang tadinya sudah mati, kering, dan tampak tanpa tanda kehidupan. Sungguh, pada yang demikian itu, yaitu turunnya air dari langit beserta proses yang terjadi padanya dan akibat yang ditimbulkannya terhadap permukaan bumi, benar-benar terdapat tanda-tanda kebesaran, kekuasaan, dan keesaan Allah bagi orang-orang yang mau mendengarkan dan mengambil pelajaran. Dan bukan saja pada air hujan, sungguh, pada hewan ternak yang kamu pelihara itu, seperti unta, sapi, kambing, dan domba, juga benarbenar terdapat pelajaran yang sangat berharga bagi kamu untuk mengakui kekuasan dan kebesaran-Nya jika kamu mau memperhatikan. Kami memberimu minum yang segar dan penuh gizi dari apa yang ada dalam perutnya, yakni hewan ternak betina, berupa susu murni yang tersarikan antara kotoran dan darah; susu yang bersih dari campuran keduanya, dan mudah ditelan bagi orang yang meminumnya."
  }
]