[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya bagi kalian (wahai sekalian manusia), (dalam hewan-hewan ternak), yaitu unta, sapi dan kambing, benar-benar terdapat nasihat. Sesungguhnya kalian telah menyaksikan bahwa kami memberikan minum kepada kalian dari kelenjar-kelenjar susunya, berupa air susu yang keluar dari antara kotran (yang ada di dalam usus besar) dan darah, yang steril dari semua unsur yang mencemarinya, lezat, tidak menyebabkan orang yang menemuinya merasa tersedak."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "66. Sesungguhnya pada unta, sapi dan domba terdapat pelajaran bagi kalian wahai manusia. Kami memberi minum kalian dari hewan-hewan tersebut susu segar yang keluar di antara apa yang dikandung oleh perutnya berupa kotoran dan apa yang ada di dalam jasadnya berupa daging, dari sana keluar susu yang murni bersih nikmat dan lezat bagi siapa yang meminumnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "66. Hai Manusia, sungguh pada unta, sapi, kambing, dan domba terdapat pelajaran bagi kalian. Kami memberi kalian minum dengan minuman berasal dari perut hewan-hewan ternak tersebut, yang keluar di antara darah dan kotorannya, yaitu berupa susu murni yang lezat dan mudah ditelan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "66. وَإِنَّ لَكُمْ فِى الْأَنْعٰمِ لَعِبْرَةً ۖ (Dan sesungguhnya pada binatang ternak itu benar-benar terdapat pelajaran bagi kamu) الأنعام yakni unta, sapi, dan kambing. نُّسْقِيكُم مِّمَّا فِى بُطُونِهِۦ مِنۢ بَيْنِ فَرْثٍ وَدَمٍ(Kami memberimu minum dari pada apa yang berada dalam perutnya antara kotoran dan darah) Makna (الفرث) yakni kotoran yang ada di dalam perut; namun apabila sudah keluar tidak lagi dinamakan (الفرث). Yakni apa yang kalian minum itu dulunya berada di atas kotoran dan di bawah darah, jadi susu tersebut berada di antara keduanya; darah mengalir ke pembuluh darah dan susu mengalir di kelenjar susu. خَالِصًا(yang murni) Yakni dimurnikan dari merahnya darah dan bau kotoran dimana sebelumnya semuanya terkumpul pada satu tempat. سَآئِغًا لِّلشّٰرِبِينَ(yang mudah ditelan bagi orang-orang yang meminumnya) Yakni lezat dan nikmat, tidak tersangkut di tenggorokan dan mudah dicerna serta bermanfaat bagi yang meminumnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "66. Dan sesungguhnya bagi kalian dalam berbagai jenis hewan ternak (unta, sapi, dan domba) itu ada pelajaran dan nasehat. Kami memberi minum kalian dari perut hewan-hewan ternak ini (Dan penyebutan dhamir yang merujuk kepada hewan ternak ini untuk menunjukkan jenis, sebagaimana penyebutan kata (hadza) pada surah Al-An’am [6/78] yang merujuk kepada (Asy-Syams) dengan maksud menyebut bintang) di antara aliran darah dan aliran sesuatu yang kotor, Kami memberi minum kalian dengan susu yang jernih, enak untuk diminum, mudah untuk ditelan dan di cerna serta tidak membuat peminumnya tersedak"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya pada hewan ternak itu benar-benar terdapat pelajaran} pelajaran dan dalil atas takdir dari penciptanya {bagi kalian. Kami memberi kalian minum dari sebagian yang ada dalam perutnya, dari sesuatu antara kotoran} sisa-sisa makanan yang ada di perut {dan darah (berupa) susu murni} yang murni dan bersih {yang mudah ditelan} enak dan nyaman {oleh orang-orang yang meminumnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "66. Maksudnya, ”dan sesungguhnya bagimu pada binatang ternak itu” yang Allah tundukan bagi kepentingan kepentingan kalian “benar benar terdapat pelajaran” dengan itu, engkau membuktikan kesempurnaan kekuasaan Allah dan luasnya kebaikan Allah, lantaran Allah memberikan minuman bagi kalian dari perut perut binatang binatang tersebut yang berisi kotoran dan darah. Allah mengalirkan dari tempat antara keduanya air susu yang bersih dari kekeruhan sehingga mudah ditelan oleh orang orang yang meminumnya untuk kesenangan. Susu ini memberikan cairan dan nutrisi. Bukankah kejadian ini tiada lain merupakan kekuasaan ilahi, bukan kejadian kejadian alam belaka? kekuatan alamiah apakah yang dapat menjelmakan pakan ternak yang dimakan oleh binatang ternak dan minuman yang ia minum, berasal dari air yang tawar dan zat asin menjadi air susu yang murni, mudah dikonsumsi oleh orang orang yang meminumnya?"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (لَعِبۡرَةٗۖ) la’ibrah : “pelajaran” bukti yang kuat, yang dapat mengantarkan dari kebodohan menuju ilmu. Karena ‘ibrah (pelajaran) dari kata ‘ubuur (melewati). (مِنۢ بَيۡنِ فَرۡثٖ) mim baini farts : yaitu kotoran yang ada pada perut. (لَّبَنًا خَالِصٗا) labanan khaalishaa : “susu yang bersih” tidak terdapat kotoran dan darah, baik warna, bau, dan rasanya. Makna ayat: Firman-Nya “Dan sesungguhnya pada binatang ternak itu benar-benar terdapat pelajaran.” Kalian dapat berpindah dari kebodohan menuju ilmu, yaitu dari kebodohan akan kekuasaan Allah, rahmat-Nya, dan kewajiban untuk beribadah kepada-Nya dengan berdzikir dan syukur, menuju pengetahuan akan hal-hal tersebut, lalu kalian beriman, mengesakan-Nya dan mentaati-Nya. kemudian Allah menjelaskan pelajaran yang besar dari hal itu, Firman-Nya “Kami memberimu minum dari apa yang berada dalam perutnya” yaitu perut hewan ternak yang telah disebutkan sebelumnya “susu yang bersih antara kotoran dan darah, yang mudah ditelan bagi orang-orang yang meminumnya.” Maka Mahasuci Allah yang memiliki kekuasaan yang luar biasa, ilmu yang luas, serta hikmah yang tidak terhingga. Susu yang terletak di antara kotoran dan darah. Darah berpindah jantung lalu menyebar melalui saluran darah keseluruh tubuh untuk kelangsungan hidup hewan, susu dialirkan menuju kantung susu, dan kotoran mengendap di dalam perut. Susu murni keluar diantara darah dan kotoran, namun tidak terlihat efek pada warna susu, tidak tercium bau (darah dan kotoran) pada susu tersebut, dan tidak pula pada rasanya, karena ia mudah untuk diminum, tidak membuat tersedak yang meminumnya. Sungguh, ini adalah pelajaran yang paling besar, yang dapat membawa seseorang menuju cahaya ilmu dan pengetahuan akan Allah mengenai keagungan dan kesempurnaan-Nya, serta menumbuhkan kecintaan kepada Allah dan memotivasi untuk taat dan bertaqarrub kepada-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 66: Yang ditundukkan Allah untuk memberimu manfaat. Dari sana kamu dapat mengetahui sempurnanya kekuasaan Allah, luasnya ihsan-Nya, di mana Dia memberikan kamu air susu dari perutnya yang keluar di antara kotoran dan darah, yang mudah diminum olehmu lagi bergizi. Bukankah semua ini merupakan qudrat (kuasa) Allah, dan bukan perkara tabi’at? Namun tidak tercampur oleh kotoran dan darah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 66",
    "description": "Dan bukan saja pada air hujan, sungguh, pada hewan ternak yang kamu pelihara itu, seperti unta, sapi, kambing, dan domba, juga benarbenar terdapat pelajaran yang sangat berharga bagi kamu untuk mengakui kekuasan dan kebesaran-Nya jika kamu mau memperhatikan. Kami memberimu minum yang segar dan penuh gizi dari apa yang ada dalam perutnya, yakni hewan ternak betina, berupa susu murni yang tersarikan antara kotoran dan darah; susu yang bersih dari campuran keduanya, dan mudah ditelan bagi orang yang meminumnya. Dan tidakkah pula kamu mengambil pelajaran dari buah kurma dan anggur yang sangat bermanfaat bagi kehidupan kamu' dari perasannya kamu dapat membuat minuman yang memabukkan, dan dari buah itu pula kamu bisa memperoleh rezeki yang baik, yakni tidak memabukkan. Sungguh, pada yang demikian itu benar-benar terdapat tanda kebesaran dan kekuasaan Allah bagi orang yang mengerti."
  }
]