[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan diantara bentuk nikmat kami pada kalian adalah apa yang kalian ambil dari bauh-bauh pohon kurma dan anggur lalu kalian proses menjadi minuman khamr yang memabukan, (ini sebelum turun ayat pengharamannya) dan makanan yang enak. Sesungguhnya dalam kenikmatan yang disebutkan terdapat bukti petunjuk tentang kekuasaan Allah bagi kaum yang memahami bukti-bukti kebenaran dan mengambil pelajaran darinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "67. Bagi kalian terdapat pelajaran pada rezeki yang Kami berikan kepada kalian berupa buah-buah kurma dan anggur. Darinya kalian membuat minuman memabukkan yang menutup kerja akal, dan ini tidak baik, namun darinya kalian mengambil rezeki yang baik dan kalian mengambil manfaat darinya seperti kurma, kismis, cuka dan sari kurma. Sesungguhnya apa yang tersebut mengandung bukti atas kemahakuasaan Allah dan nikmat-Nya kepada hamba-hamba-Nya bagi kaum yang berakal, mereka adalah orang-orang yang mengambil pelajaran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "67. Allah menciptakan bagi hamba-hamba-Nya buah kurma dan anggur yang sebagiannya mereka gunakan sebagai bahan untuk membuat khamr yang memabukkan -dan ini sebelum turun ayat pengharamannya- dan sebagian lagi mereka jadikan sebagai makanan yang lezat. Sungguh pada buah yang memiliki manfaat yang besar tersebut terdapat tanda kekuasaan Allah dalam memberi rezeki kepada hamba-hamba-Nya bagi orang-orang yang memahami kebenaran."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "67. وَمِن ثَمَرٰتِ النَّخِيلِ وَالْأَعْنٰبِ (Dan dari buah korma dan anggur) Yakni Kami memberi kalian minum dari perut binatang ternak dan dari buah kurma dan anggur. تَتَّخِذُونَ مِنْهُ سَكَرًا(mu buat minimuman yang memabukkan) Makna (السكر) yakni khamr yang memabukkan. Dan makna (الرزق الحسن) yakni semua yang dapat dimakan dari dua pohon ini seperti buah kurma dan anggur, sari kurma, kismis, dan cuka. إِنَّ فِى ذٰلِكَ لَاٰيَةً لِّقَوْمٍ يَعْقِلُونَ (Sesunggguhnya pada yang demikian itu benar-benar terdapat tanda (kebesaran Allah) bagi orang yang memikirkan) Saat memandang ayat-ayat kauniyah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "67. Kalian mengambil buah kurma dan anggur untuk dijadikan khamr yang memabukkan (Ini adalah instruksi awal tentang pengharaman khamr sebelum perintah haram yang mutlak) dan sebagai rejeki yang halal dengan memakannya dalam keadaan kering seperti sejenis kismis dan kurma kering, atau selain yang memabukkan seperti sirup atau cuka. Sesungguhnya dalam sesuatu yang disebutkan itu ada dalil yang menunjukkan kekuasaan Allah SWT bagi kaum yang merenungi dan memperhatikan ayat kauniyyah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan dari buah kurma dan anggur, kalian membuat minuman yang memabukkan} khamr yang memamukkan {dan rezeki yang baik. Sesungguhnya pada yang demikian itu benar-benar terdapat tanda bagi kaum yang berpikir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "67. Dan Allah menciptakan bagi para hambaNya dari buah buah kurma dan anggur berbagai macam kegunaaan dan kemaslahatan bagi mereka, yang berbentuk rizki yang baik yang dikonsumsi oleh para manusia dalam keadaan segar, matang, siap saji dan bisa disimpan dan sebagai makanan dan minuman yang bisa dijadikan jus dan fermentasinya dan minuman keras yang sebelumnya halal diperbolehkan. Kemudian Allah menaskh (menghapus) halalnya minuman yang memabukkan dan menggantikannya dengan barang barang yang baik seperti jenis jenis nabidz (hasil fermentasi dari buah) dan berbagai macam minuman yang lezat dan diperbolehkan. Oleh karena itu ada orang yang berpendapat maksud ‘memabukkan' di sini adalah makanan dan minuman yang nikmat. pendapat ini lebih utama daripada pendapat yang pertama. Allah berfirman ”sesungguhnya pada yang demikian itu benar benar terdapat tanda (kebesaran Allah) bagi orang yang memikirkan” Yaitu memikirkan tentang kesempurnaan kekuasaan Allah, karena Dia mengeluarkannya dari pepohonan yang mirip dengan kayu bakar, kemudian berubah menjadi buah buahan yang lezat, enak dimakan dan baik. Dan (itu membuktikan) meratanya cakupan rahmatNya karena ia mearat pada seluruh hambaNYa, memudahkannya bagi mereka, (menunjukan) bahwa Dialah sesembahan yang (berhak) diibadahi semata, sebab Allah satu satunya Dzat yang (mampu) melakukan itu."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (وَمِن ثَمَرَٰتِ ٱلنَّخِيلِ وَٱلۡأَعۡنَٰبِ) wa min tsamaraatin nakhiili wal a’naab : “dan dari buah kurma dan anggur,” dari sebagian buah kurma dan anggur, buah “kamu membuat minuman yang memabukkan” yaitu khamr, “dan rezeki yang baik.” Yaitu buah kurma, zaitun, cuka, dan sirup adalah rezeki yang baik. Makna ayat: Konteks ayat masih menyebutkan tanda-tanda kekuasaan Allah, ilmu, hikmah, dan rahmat-Nya yang mewajibkan seseorang untuk hanya menyembah-Nya, serta penegasan keyakinan akan kenabian dan kebangkitan di hari akhir. Allah ta’ala berfirman menjelaskan hal itu dengan memaparkan hal-hal yang mengharuskan seorang hamba bersyukur kepada-Nya “dan dari buah kurma dan anggur, kamu membuat minuman yang memabukkan dan rezeki yang baik” dari sebagian jenis buah kurma dan anggur, buah yang kalian jadikan minuman yang memabukkan, dan ini sebelum diharamkannya khamr. “rezeki yang baik” seperti zaitun, cuka anggur dan kurma, sirup dari madu dan kurma. Firman-Nya “Sungguh, pada yang demikian terdapat tanda bagi orang yang mengerti.” Sungguh pada hal yang telah Kami paparkan kepada kalian terdapat tanda yang jelas atas kekuasaan, ilmu, dan rahmat Kami bagi kaum yang mengerti akan perkara-perkara tersebut dan memahami hasil dari segala sesuatu. Dzat Yang memiliki kekuasaan, ilmu, dan rahmat adalah yang pantas untuk dijadikan sesembahan dan ibadah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 67: Ayat ini turun sebelum diharamkannya minuman yang memabukkan. Seperti buah kurma, kismis, sirup kurma dan membuat berbagai minum lezat lainnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 67",
    "description": "Dan tidakkah pula kamu mengambil pelajaran dari buah kurma dan anggur yang sangat bermanfaat bagi kehidupan kamu' dari perasannya kamu dapat membuat minuman yang memabukkan, dan dari buah itu pula kamu bisa memperoleh rezeki yang baik, yakni tidak memabukkan. Sungguh, pada yang demikian itu benar-benar terdapat tanda kebesaran dan kekuasaan Allah bagi orang yang mengerti. Dan di antara begitu banyak tanda-tanda kekuasaan dan kebesaran Allah di bumi ini adalah bahwa tuhanmu yang selalu membimbing dan berbuat baik kepadamu mengilhamkan kepada lebah, buatlah sarang dengan sungguh-sungguh di gua pada gunung-gunung, di lubang pada batang pohon-pohon kayu, dan di tempat-tempat yang dibikin manusia berupa sarang buatan."
  }
]