[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan tuhanmu (wahai nabi) telah mengilhamkan pada lebah, ”buatlah untukmu sarang-sarang di gunung-gunung dan di pohon-pohon dan dalam ruagan yang dibangun manusia seperti rumah-rumah dan atap-atap."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "68. Dan Rabbmu -wahai Rasul- telah mengilhamkan kepada lebah dan membimbingnya agar mengambil sarang di gunung-gunung, pepohonan dan pada tempat-tempat yang dibangun dan diberi atap oleh manusia."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "68-69. Dan bagian dari kenikmatan-kenikmatan Allah bagi hamba-hamba-Nya, Dia mengilhamkan kepada lebah: “Buatlah rumah-rumah di pegunungan, pepohonan, dan di tempat-tempat yang tinggi seperti atap rumah atau anjang-anjang yang diletakkan di atas tiang-tiang. Kemudian makanlah dari segala jenis bunga dan buah, dan lewatilah jalan-jalan yang telah Allah siapkan bagimu. Dari perut lebah itu keluar madu yang beraneka ragam warnanya, ada yang putih, coklat, merah, dan lain sebagainya. Madu itu mengandung kesembuhan bagi manusia dari berbagai penyakit. sungguh pada madunya memiliki banyak manfaat itu terdapat bukti yang agung atas kekuasaan Sang Pencipta bagi orang-orang yang mau memikirkan kenikmatan-kenikmatan ini kemudian mendapatkan banyak pelajaran darinya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "68. وَأَوْحَىٰ رَبُّكَ إِلَى النَّحْلِ (Dan Tuhanmu mewahyukan kepada lebah) Yakni mengilhamkan. أَنِ اتَّخِذِى مِنَ الْجِبَالِ بُيُوتًا وَمِنَ الشَّجَرِ(Buatlah sarang-sarang di bukit-bukit, di pohon-pohon kayu) Yakni sarang-sarang yang sesuai yang berada di lubang-lubang yang ada di pegunungan atau pepohonan. وَمِمَّا يَعْرِشُونَ(dan di tempat-tempat yang disiapkan manusia) Yakni panel-panel yang dibuat agar dipakai lebah untuk menjadi sarangnya, yang kebanyakan terbuat dari kayu."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Perhatikan begitu sempurnanya ketaatan lebah kepada tuhannya, dan setelah itu tidak ditemui rumah-rumah yang dibuat oleh binatang kecil ini melainkan kebanyakan di tiga tempat ini; maka setiap insan harusnya lebih utama lagi memperkuat ketaatannya kepada tuhanny."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "68. Dan Tuhanmu memberi ilham dan mengajarkan lebah untuk membuat rumah-rumah dan tempat tinggal di dalam gua-gua, celah-celah gunung, lubang-libang pohon, dan atap-atap bangunan yang didirikan manusia di bawah pohon atau atap rumah. Itu adalah sarang lebah yang dibangun dari tanah, kayu, atau selain itu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tuhanmu mengilhamkan} memberi ilham {kepada lebah,“Buatlah sarang-sarang di pegunungan, pepohonan, dan bangunan yang mereka bangun} rumah-rumah dan atap-atap yang mereka bangun"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "68-69. pada penciptaan binatang lebah yang mungil ini, yang Allah berikan petunjuk kepadanya dengan petunjuk yang mengagumkan, dan Dia memudahkan habitat makanannya, lantas kembali ke sarang sarangnya yang ia renovasi berdasarkan arahan dan petunjuk dari Allah kepadanya, kemudian mengeluarkan dari perut perutnya madu lezat yang beraneka warna, sesuai dengan latar belakang tanah dan habitatnya, yang mana pada madu itu terdapat penyembuh bagi umat manusia dari banyak penyakit, maka semua ini menjadi bukti kesempurnaan perhatian Allah dan kesempurnaan sifat kelembutanNya kepada para hambaNya, dan bahwa Dialah Dzat yang tidak patut ada pihak selainNya yang dicinta dan diseru dalam doa."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (وَأَوۡحَىٰ رَبُّكَ) wa awhaa rabbuka ilannahl : “dan Rabbmu mengilhamkan lebah” untuk melakukan apa yang telah diilhamkan kepadanya. (وَمِمَّا يَعۡرِشُونَ) wa mimmaa ya’risyuun : “dan di tempat-tempat yang dibuat manusia.” Bangunan buatan manusia. Makna ayat: Firman-Nya “dan Rabbmu mengilhamkan kepada lebah, buatlah sarang di gunung-gunung, di pohon-pohon, dan di tempat yang dibangun manusia.” Ini adalah tanda yang besar dari kekuasaan Allah ta’ala, ilmu, hikmat dan rahmat-Nya yang muncul dengan Dia mengajarkan kepada seekor lebah bagiamana untuk membuat madu, lalu memberikannya kepada manusia yang di dalamnya ada obat segala penyakit. Firman-Nya “Dan Rabbmu mengilhamkan” wahai rasul Kami “kepada lebah.” Yaitu untuk “buatlah sarang di gunung-gunung, pohon-pohon” “dan di tempat yang dibangun manusia.” Apa yang manusia buat untuk kalian, maka jadikanlah itu rumah kalian. Karena lebah membuat sarang pada tempat yang dibuat manusia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 68",
    "description": "Dan di antara begitu banyak tanda-tanda kekuasaan dan kebesaran Allah di bumi ini adalah bahwa tuhanmu yang selalu membimbing dan berbuat baik kepadamu mengilhamkan kepada lebah, buatlah sarang dengan sungguh-sungguh di gua pada gunung-gunung, di lubang pada batang pohon-pohon kayu, dan di tempat-tempat yang dibikin manusia berupa sarang buatan. Melanjutkan ilhamnya kepada lebah, Allah berfirman, kemudian makanlah, yakni isaplah, dari segala macam bunga dari buah-buahan pada pepohonan yang besar maupun kecil, lalu tempuhlah jalan yang telah ditentukan oleh tuhan pencipta dan pemelihara-Mu, yang telah dimudahkan bagimu. Dengan izin dan kekuasaan Allah, dari perut lebah itu keluar sejenis minuman yang amat lezat berupa madu yang bermacammacam warna dan rasa-Nya. Di dalamnya terdapat kandungan yang bermanfaat bagi daya tahan tubuh dan obat yang dapat menyembuhkan bagi beberapa penyakit manusia. Sungguh, pada yang demikian itu benar-benar terdapat suatu tanda kekuasaan dan kebesaran Allah bagi orang yang berpikir."
  }
]