[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kemudian makanlah dari setiap buah apa yang kamu sukai lalu tempuhlah jalan-jalan tuhanmu yang telah ditundukan bagimu untuk mendapatkan rizki di gunung-gunung dan sela-sela antara pepohonan, Sesungguhnya Allah telah menjadikannya mudah bagimu kamu tidak akan salah jalan untuk kembali meskipun berjarak jauh. Akan keluar dari perut-peru lebah itu cairan madu dengan berbagi warna yang berbeda-beda seperti putih, kuning, merah, dan warna lainnya. Didalamnya terdapat sumber kesembuhan bagi manusia dari penyakit-penyakit. Sesunggguhnya dalam hal-hal yang dilakukan oleh lebah benar-benar terkandung bukti kuat yang menunjukan kuasa penciptanya bagi orang yang berpikir dan kemudian mengambil pelajaran."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "69. Kemudian makanlah makanan yang kalian inginkan berupa buah-buahan, titilah jalan-jalan yang diilhamkan oleh Tuhanmu agar kamu menitinya dengan mudah. Dari perut lebah itu keluar madu yang warnanya berbeda-beda, ada yang putih, kuning dan lainnya, ia mengandung kesembuhan bagi manusia, dengannya mereka mengobati berbagai macam penyakit. Sesungguhnya dalam ilham Tuhanmu kepada lebah dan pada madu yang keluar dari perutnya terdapat bukti kemahakuasaan Allah dan pengaturan-Nya terhadap urusan makhluk-makhluk-Nya bagi kaum yang memikirkan, mereka adalah orang-orang yang mengambil pelajaran."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "69. ثُمَّ كُلِى مِن كُلِّ الثَّمَرٰتِ (kemudian makanlah dari tiap-tiap (macam) buah-buahan) Yakni dari berbagai macam bunga dan buah. فَاسْلُكِى سُبُلَ رَبِّكِ(dan tempuhlah jalan Tuhanmu) Yakni olahlah apa yang kamu makan di jalan Tuhanmu; yakni apa yang ada di perut lebah yang Allah olah menjadi madu dengan kekuasaan-Nya. Atau maknanya adalah apabila kamu memakan sari buah-buahan di tempat yang jauh maka tempuhlah jalan Tuhanmu kembalilah ke sarangmu dan janganlah kamu tersesat. ذُلُلًا ۚ( yang telah dimudahkan) Yakni yang tidak sulit ditempuh. شَرَابٌ (minuman) Yakni madu. مُّخْتَلِفٌ أَلْوٰنُهُۥ(yang bermacam-macam warnanya) Ada yang berwarna putih, merah, biru, dan kuning. فِيهِ شِفَآءٌ لِّلنَّاسِ ۗ( di dalamnya terdapat obat yang menyembuhkan bagi manusia) Menurut beberapa ulama bahwa ini hanya untuk beberapa penyakit. إِنَّ فِى ذٰلِكَ(Sesungguhnya pada yang demikian itu) Yakni pada fenomena yang ada pada lebah ini. لَاٰيَةً لِّقَوْمٍ يَتَفَكَّرُونَ (benar-benar terdapat tanda (kebesaran Tuhan) bagi orang-orang yang memikirkan) Yakni yang menggunakan fikiran mereka untuk memikirkan ciptaan-ciptaan Allah yang menakjubkan. Dan lebah termasuk ciptaan yang paling menakjubkan, mengherankan, paling teliti, dan teratur."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "69. Dan lebah itu diberi ilham agar memakan sari bunga dan buah-buahan seraya berjalan keluar masuk melalui jalan menuju sarang dengan tunduk kepada kemudahan yang diberikan Allah untuk mengisap sari bunga dan buah dan mengubah nektar menjadi madu yang baik dengan kuasa Allah. Dari perut lebah itu keluar madu dengan warna yang berbeda-beda, yaitu putih, kuning dan merah sesuai jenis bunganya. Di dalamnya terdapat obat penyakit bagi manusia sesuai izin Allah, seperti penyakit pencernaan. Sesungguhnya di dalam hal yang disebutkan itu, berupa perkara lebah dan proses pembuatan madu dan sarang-sarang itu merupakan petunjuk yang jelas atas kekuasaan Allah bagi kaum yang merenungi keajaiban makhluk-makhluk Allah SWT."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kemudian makanlah dari segala (macam) buah-buahan lalu tempuhlah} masukilah {jalan-jalan} jalan-jalan {Tuhanmu yang telah dimudahkan} yang dibuat mudah untuk dilewati” {Dari perutnya itu keluar minuman} madu {yang beragam warnanya. Di dalamnya} di dalam madu {terdapat obat bagi manusia. Sesungguhnya pada yang demikian itu benar-benar terdapat tanda bagi kaum yang berpikir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "68-69. pada penciptaan binatang lebah yang mungil ini, yang Allah berikan petunjuk kepadanya dengan petunjuk yang mengagumkan, dan Dia memudahkan habitat makanannya, lantas kembali ke sarang sarangnya yang ia renovasi berdasarkan arahan dan petunjuk dari Allah kepadanya, kemudian mengeluarkan dari perut perutnya madu lezat yang beraneka warna, sesuai dengan latar belakang tanah dan habitatnya, yang mana pada madu itu terdapat penyembuh bagi umat manusia dari banyak penyakit, maka semua ini menjadi bukti kesempurnaan perhatian Allah dan kesempurnaan sifat kelembutanNya kepada para hambaNya, dan bahwa Dialah Dzat yang tidak patut ada pihak selainNya yang dicinta dan diseru dalam doa."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (سُبُلَ رَبِّكِ ذُلُلٗاۚ) subula rabbiki dzululaa : “jalan Rabbmu yang telah dimudahkan bagimu.” Tidak sulit untuk dilalui dan engkau tidak akan tersesat. (شَرَابٞ) syaraab : “minuman” yaitu madu. (فِيهِ شِفَآءٞ لِّلنَّاسِۚ) fiihi syifaa`ul linnaas : “di dalamnya redapat obat yag menyembuhkan bagi manusia.” Dari penyakit-penyakit, jika ia menginginkan kesembuhan, atau dicampurkan ke dalam obat-obatan. Makna ayat: Firman-Nya “Kemudian makanlah dari segala jenis buah-buahan” Allah mengilhamkan kepada lebah untuk makan dari segala jenis bunga dan tanaman yang mereka temukan. Dan Firman-Nya “Maka tempuhlah jalan yang telah dimudahkan oleh Rabbmu.” Allah mengilhamkan untuk berjalan pada jalan yang telah dimudahkan oleh Allah untuk berpindah tempat mencari sari makanan untuk dibawa pulang menuju sarangnya, ia tidak akan kesulitan atau tersesat karena Allah telah memudahkan dan mengatur jalur untuknya, sehingga ia tidak lupa dan tidak salah jalan. Firman-Nya “Keluar dari perutnya” yaitu perut lebah “minuman” madu yang diminum “warnanya berbeda-beda” putih, merah, dan hitam atau putih kemerah-merahan, dan kekuning-kuningan. Firman-Nya “di dalamnya terdapat kesembuhan” yaitu obat-obatan. Penyebutan ini dalam firman Nya “terdapat kesembuhan” menunjukkan bahwa madu merupakan salah satu bagian pengobatan, dapat dicampur dengan obat yang lain apabila diperlukan. Jika seorang mukmin meminumnya dengan niat kesembuhan, maka ia akan menjadi obat dari segala penyakit tanpa perlu dicampur dengan bahan yang lain. Dalam sebuah hadits shahih, yang ringkasannya, bahwa seseorang mengadu kepada Rasulullah shalallahu ‘alaihi wa sallam mengenai perut saudaranya, maka beliau berkata : “Berikan ia madu!” maka ia pun diberi minum madu, lalu ia kembali namun ia tidak melihat hasil darinya, kemudian beliau memerintahkan sebagaimana yang di awal sebanyak tiga kali. Lalu pada yang keempat atau yang ketiga kalinya Rasulullah shalallahu ‘alaihi wa sallam bersabda, “Mahabenar Allah dan perut saudaramu telah berdusta, berikan ia madu.” Lalu ia pun memberinya minum madu, kemudian sembuh seakan-akan ia terlepas dari kekangan. Firman-Nya “sungguh pada yang demikian” yaitu pada hal yang telah disebutkan berupa pengilhaman Allah serta pengajaran-Nya kepada lebah bagaimana cara membuat madu, kemudian keluar dari perutnya minuman dengan berbagai macam warna yang terdapat kesembuhan di dalamnya bagi manusia. Ini adalah tanda yang jelas akan ilmu Allah, kekuasaan, rahmat, dan hikmah-Nya yang berkonsekuensi seorang hamba hanya beribadah kepada-Nya, serta hanya menjadikan-Nya sesembahan, namun itu semua bagi kaum yang memikirkan sesuatu dengan seksama, maka ia akan mendapat petunjuk menuju apa yang diminta dari mereka berupa agar mereka ingat dan mengambil pelajaran serta bertaubat kepada Pencipta mereka dan menyerahkan diri hanya beribadah kepada-Nya. Pelajaran dari ayat: • Penjelasan mengenai pemberian Allah ta’ala kepada para hamba-Nya dengan menyebutkan beberapa rezeki yang diberikan kepada mereka, agar mereka bersyukur kepada Allah atas nikmat-nikmat tersebut. • Penjelasan tanda-tanda kekuasaan Allah ta’ala yang menunjukkan kekuasaan, ilmu, dan hikmah-Nya, seperti menciptakan minuman, makanan, dan obat untuk manusia. • Keutamaan akal dan fikiran agar dapat berfikir dan memahami."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 69: Oleh karena itu, kamu (yakni lebah) tidak merasa sulit mencari padang rumput meskipun sukar dilalui, dan kamu tidak akan tersesat jika pulang kembali meskipun perjalananmu jauh karena telah dimudahkan Allah. Hal ini menunjukkan sempurnanya perhatian dan kelembutan Allah Ta’ala kepada hamba-hamba-Nya. Oleh karena itu, tidak ada yang berhak diberikan kecintaan dan ibadah selain Dia. Untuk memikirkan ciptaan Allah, seperti memikirkan lebah yang kecil tersebut."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 69",
    "description": "Melanjutkan ilhamnya kepada lebah, Allah berfirman, kemudian makanlah, yakni isaplah, dari segala macam bunga dari buah-buahan pada pepohonan yang besar maupun kecil, lalu tempuhlah jalan yang telah ditentukan oleh tuhan pencipta dan pemelihara-Mu, yang telah dimudahkan bagimu. Dengan izin dan kekuasaan Allah, dari perut lebah itu keluar sejenis minuman yang amat lezat berupa madu yang bermacammacam warna dan rasa-Nya. Di dalamnya terdapat kandungan yang bermanfaat bagi daya tahan tubuh dan obat yang dapat menyembuhkan bagi beberapa penyakit manusia. Sungguh, pada yang demikian itu benar-benar terdapat suatu tanda kekuasaan dan kebesaran Allah bagi orang yang berpikir. Dan di antara tanda-tanda kekuasaan Allah adalah bahwa dia telah menciptakan kamu, wahai manusia, dari sumber yang satu yaitu tanah sehingga kamu ada dan dapat hidup di dunia ini. Kemudian dengan kekuasaan-Nya pula dia mewafatkanmu dengan berbagai cara dan dalam usia yang berbeda sesuai waktu yang telah ditentukan-Nya. Di antara kamu ada yang dimatikan pada usia muda dan ada pula yang dikembalikan kepada usia yang tua renta, pikun, dan lemah kembali bagaikan bayi, sehingga pada usia itu dia tidak mengetahui lagi sesuatu yang dulu pernah diketahuinya. Sungguh, Allah maha mengetahui segala sesuatu dan rahasia dari ciptaan-Nya, mahakuasa melakukan apa saja yang dikehendaki-Nya."
  }
]