[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan binatang-binatang ternak ini mengangkut barang-barang bawaan kalian yang berat menuju negri yang jauh, tempat yang kalian tidak mampu untuk mencapainya kecuali tenaga besar dari kalian dan susah payah. Sesungguhnya tuhan kalian Maha Pengasih lagi Maha Penyayang dikarenakan dimemudahkan bagi kalian apa yang kalian butuhkan. Maka bagiNya segala Puji dan bagiNya rasa syukur."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Hewan-hewan yang Kami ciptakan itu mengangkut barang-barang kalian yang berat dalam perjalanan ke negeri yang kalian tidak menjangkaunya kecuali dengan beban yang sangat berat bagi jiwa. Sesungguhnya Tuhan kalian -wahai manusia- Maha Pengasih lagi Maha Penyayang kepada kalian di mana Dia menundukkan hewan-hewan ini."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "7. Sebagian hewan ternak ini dapat mengangkut barang-barang berat kalian menuju negeri yang jauh yang tidak dapat kalian tempuh kecuali dengan usaha dan tenaga yang sangat besar. Sungguh Pencipta kalian dan Pengatur urusan kalian memiliki kasih sayang dan rahmat yang luas bagi kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. وَتَحْمِلُ أَثْقَالَكُمْ (Dan ia memikul beban-bebanmu) Yakni kebutuhan-kebutuhan musafir seperti makanan dan lainnya. Pendapat lain mengatakan yakni ia memikul diri kalian. إِلَىٰ بَلَدٍ لَّمْ تَكُونُوا۟ بٰلِغِيهِ إِلَّا بِشِقِّ الْأَنفُسِ ۚ( ke suatu negeri yang kamu tidak sanggup sampai kepadanya, melainkan dengan kesukaran) Yakni kalian tidak akan sampai ke tempat itu kecuali dengan penuh kesusahan jika tidak dengan unta yang mengangkut barang-barang kalian."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Allah berfirman tentang keadaan di dunia {وَتَحْمِلُ أَثْقَالَكُمْ إِلَىٰ بَلَدٍ لَمْ تَكُونُوا بَالِغِيهِ إِلَّا بِشِقِّ الْأَنْفُسِ ۚ إِنَّ رَبَّكُمْ لَرَءُوفٌ رَحِيمٌ} seperti inilah kamu di dunia kamu berpindah dari satu tempat ke tempat lainnya dengan mudah atas bantuan hewan-hewan itu, lalu bagaimana dengan perpindahanmu dari dunia menuju akhirat?!"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Hewan-hewan ternak itu memikul beban bawaanmu yang berat menuju suatu negeri yang jauh. Kamu tidak akan bisa sampai pada negeri jauh itu melainkan dengan kesukaran-kesukaran yang sangat melelahkan. Sesungguhnya Tuhanmu benar-benar Maha Pengasih lagi Maha Penyayang atas yang telah dia ciptakan untukmu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Hewan itu mengangkut beban-beban kalian} barang-barang kalian yang berat {ke suatu negeri yang kalian tidak sanggup mencapainya, kecuali dengan susah payah} dengan susah payah dan membebani diri {Sesungguhnya Tuhan kalian Maha Pengasih lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7. “dan ia memikul beban bebanmu” yaitu beban beban yang berat, bahkan (juga) membawa kalian, ”kesuatu negeri yang kamu tidak sanggup sampai kepadanya, melainkan dengan kesukaran kesukaran (yang memayahkan) diri” akan tetapi Allah menundukkan binatang binatang tersebut bagi kalian. Diantaranya, terdapat binatang yang kalian tunggangi sebagai kendaraan, dan ada pula yang kalian beri beban dengan barang barang berat yang kalian inginkan, menuju negeri negeri yang jauh dan wilayah wilayah yang luas. “sesungguhnya Rabbmu benar benar Maha Pengasih lagi Maha Penyayang” lantaran menudukan (fasilitas) bagi kalian yang memang sangat kalian perlukan dan butuhkan. BagiNya sanjungan, sesuai dengan keagungan wajahNya dan besarnya kekuasaanNya serta atas luasnya kemurahan dan kebaikanNya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (إِلَّا بِشِقِّ ٱلۡأَنفُسِۚ) illaa bisyiqqil anfus : dengan kepayahan dan kesulitan yang berat. Makna ayat: Firman-Nya “Dan ia mengangkut beban-bebanmu ke suatu negeri yang kamu tidak sanggup mencapainya, kecuali dengan susah payah,” kecuali dengan kesulitan dan kepayahan yang besar, unta ketika berada di padang pasir bagaikan kapal-kapal laut yang mengangkut barang muatan dari negeri ke negeri lain. Dan terkadang jarak perjalanan cukup jauh yang seseorang tidak mungkin bisa sampai kecuali dengan kesulitan, usaha, dan tenaga yang besar, jikalau bukan karena unta “kapal padang pasir”. Hewan selain unta contohnya; kuda, bigal, dan keledai yang mampu membawa barang. Maka Pencipta hewan-hewan ini, yaitu Rabb kalian, tidak ada sesembahan yang berhak disembah kecuali Dia, maka beribadahlah hanya kepada-Nya, jangan kalian sekutukan Dia dengan sesuatu apapun. Firman-Nya “Sungguh Rabb kalian.” Pencipta, Pemberi Rizki, Yang Merawat, dan sesembahan kalian yang benar, tidak ada tuhan bagi kalian kecuali Dia, sungguh Dia adalah Yang Maha Pengampun lagi Maha Penyayang. Bukti-bukti kasih sayang dan lemah lembut-Nya terlihat pada seluruh lini kehidupan, jika bukan karena kelembutan dan kasih sayang Allah kepada manusia, niscaya mereka tidak akan mampu hidup di dunia ini walaupun hanya sesaat, maka segala puji dan nikmat hanya milik Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 7: Jika tidak menggunakan unta. Lebih dari itu, ia pun mengangkut kamu. Oleh karena itu, Dia menciptakan hewan tersebut untuk kamu serta menyiapkan segala yang kamu butuhkan dan kamu perlukan, maka segala puji bagi Allah sesuai dengan keagungan wajah-Nya, besarnya kekuasaan-Nya dan luasnya kepemurahan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 7",
    "description": "Dan kamu pun bisa memperoleh manfaat lain dari hewan ternak itu karena ia sanggup mengangkut beban-bebanmu yang berat dan tidak mampu kamu pikul sendiri ke suatu negeri nun jauh yang kamu tidak sanggup mencapainya, kecuali dengan susah payah. Sungguh, tuhanmu yang telah menciptakan hewan ternak itu dan menyediakan berbagai manfaat darinya adalah tuhan yang maha pengasih kepada hamba yang taat dan mendekatkan diri kepada-Nya, maha penyayang kepada semua makhluk-Nya. Dan dia telah pula menciptakan untuk kalian kuda, bagal (yaitu binatang hasil perkawinan antara kuda dengan keledai), dan keledai. Itu semua diciptakan Allah untuk kamu tunggangi dan menjadi perhiasan. Allah menciptakan untuk kalian apa yang kamu ketahui dan apa yang tidak kamu ketahui pada saat ini namun kelak akan kamu ketahui manfaat dan kegunaannya."
  }
]