[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Allah menciptakan kalian kemudian mematikan kalian pada akhir umur kalian. Dan diantara kalian ada orang yang dikembalikan kepada masa usia terburuk, yaitu masa pikun, sebagaimna keadaannya pada masa kanak-kanak, ia menjadi tidak mengetahui apa-apa dari apa yang telah diketahuinya. Sesungguhnya Allah maha mengetahui lagi maha kuasa, dan ilmu serta kekuasaannya meliputi segala sesuatu, maka Allah lah yang mengembalikan manusia kepada keadaan ini, Dia mahakuasa untuk mematikan dan kemudian membangkitkannya kembali."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "70. Allah menciptakan kalian tanpa contoh sebelumnya, kemudian mematikan kalian manakala ajal kalian habis, di antara kalian ada yang Allah panjangkan umurnya hingga dia mencapai fase umur yang buruk, yaitu pikun, sehingga dia tidak mengetahui apa yang pernah diketahuinya, sesungguhnya Allah Maha mengetahui. Tidak ada sesuatu pun dari amal manusia yang samar bagi-Nya. Dia Mahakuasa sehingga tidak ada sesuatu pun yang melemahkan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "70. Dan bagian dari bukti kekuasaan Allah adalah Dia telah menciptakan kalian dari ketidakadaan kemudian mematikan kalian setelah umur kalian habis. Dan sebagian kalian mencapai umur yang paling buruk akibat melemahnya akal dan panca indra sehingga dia kembali bodoh sebagaimana ketika dia masih kecil. Sungguh Allah Maha Mengetahui dalam mengatur hamba-hamba-Nya dan Maha Kuasa untuk melakukan apa yang Dia kehendaki."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "70. يُرَدُّ إِلَىٰٓ أَرْذَلِ الْعُمُرِ (dikembalikan kepada umur yang paling lemah (pikun)) Yakni saat manusia menjadi pikun, seperti anak kecil yang belum berakal. لِكَىْ لَا يَعْلَمَ بَعْدَ عِلْمٍ (supaya dia tidak mengetahui lagi yang pernah diketahuinya) Yakni ilmu yang pernah ia dapatkan. شَيْـًٔا ۚ (sesuatupun) Baik itu ilmu yang banyak maupun sedikit."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "70. Dan di antara dalil-dalil kuasa Allah SWT adalah mengadakan dari ketiadaan, kemudian mematikan kalian di akhir ajal kalian, dan di antara kalian ada yang menentang karena melemahnya umur, dan lemahnya akal dan perasaan saat sudah tua sehingga lupa ingatan, tidak mengetahui sedikitpun tentang ilmu. Sesungguhnya Allah Maha Mengetahui makhlukNya dan Maha Kuasa atas apa yang dikehendakiNya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah telah menciptakan kalian, kemudian mewafatkan kalian. Di antara kalian ada yang dikembalikan pada usia yang paling lemah} umur yang paling lemah dan paling rendah, yaitu usia tua {sehingga dia tidak mengetahui lagi sesuatu yang pernah dia ketahui. Sesungguhnya Allah Maha Mengetahui lagi Maha kuasa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "70. Allah memberitahukan bahwa Dialah Dzat yang menciptakan manusia dan mentransper mereka dalam proses penciptaan dari satu fase ke fase berikutnya. Selanjutnya, ketika mereka telah menepati semua ajal ajal, maka Allah mewafatkan mereka. Dia antara mereka adea yang dipanjangkan usianya, sampai dikembalikan ”kepada umur yang paling lemah (pikun)” yaitu usia yang paling nista. Yang mana pada usia itu, manusia mencapai batas kelemahan dari kekuatan fisik zahir dan batin. Bahkan akal yang menjadi permata manusiapun mengalami pertambahan kelemahan. Hingga diapun lupa apa saja yang dahulu ia ketahui. Daya tangkap akalnya ibarat daya tangkap seorang anak kecil. Oleh karena itu Allah berfirman ”supaya dia tidak mengetahui lagi sesuatu pun yang diketahuinya. Sesungguhnya Allah Maha Mengetahui lagi Mahakuasa” maksudnya ilmu dan kekuasaan Allah meliputi seluruh perkasa. Termasuk dalam kategori itu adalah, keadaan yang memindahkan seorang anak manusia dari proses penciptaan berikutnya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (ِإلَىٰٓ أَرۡذَلِ ٱلۡعُمُرِ) ilaa `ardzalil ‘umur : “kepada usia tua renta (pikun)” yang paling rendah karena faktor usia dan pikun. Pikun adalah kerusakan pada akal. Makna ayat: Firman-Nya pada ayat yang lain “Allah yang menciptakan kamu, kemudian Dia yang mewafatkanmu, dan di antara kamu ada yang dikembalikan kepada umur yang paling rendah, sehingga ia tidak mengetahui lagi sesuatu pun yang pernah diketahuinya.” Ini adalah ayat lain yang menunjukkan kebesaran dan keagungan kekuasaan Allah, ilmu, hikmah, dan rahmat-Nya yang mengharuskan para hamba-Nya hanya menyembah kepada-Nya, serta melazimkan keimanan kepada hari akhir. Allah menciptakan kita sendirian, hanya Dia-lah yang menciptakan sedangkan kita sebagai ciptaan-Nya tidak terhitung jumlahnya, kemudian Dia mematikan kita dengan kematian yang sebenarnya dengan mencabut arwah kita, tidak ada satu pun yang tidak akan mati selamanya. Kemudian di antara tanda hikmah-Nya, Dia mewafatkan kita dengan waktu yang berbeda-beda, sesuai dengan hikmah-Nya, agar manusia bisa terus ada dan hidup hingga akhir dunia. Di antara manusia ada yang diwafatkan pada usia kanak-kanak, ada pula pada masa remaja, dan itu semua berdasarkan hikmah dari cobaan dan tarbiyah ilahiyah. Tanda yang lain, ada sebagian yang kembali kepadaa umur yang paling rendah, sehingga ia menjadi tua renta dan pikun, telah hilang kekuatan yang dahulu dimilikinya, tidak ada seorang pun yang dapat lolos dari hal ini kecuali Allah. Tanda kekuasaan dan rahmat-Nya, tidakkah kita melihat, seandainya Allah berkehendak untuk mengembalikan seluruh manusia kepada umur yang paling rendah, sekalipun manusia hidup dalam satu abad atau dua abad, bagaimana kiranya kehidupan kala itu? Firman-Nya “Sungguh Allah Maha Mengetahui dan Maha Kuasa.” Penegasan akan ilmu dan kekuasaan-Nya. Karena semua yang telah disebutkan berupa penciptaan dan kematian kita serta kembalinya sebagian manusia menuju umur yang paling rendah, adalah bagian dari kekuasaan Yang Maha Kuasa, ilmu Yang Maha Mengetahui, yaitu Allah Yang Maha Kuasa lagi Maha Mengetahui. Pelajaran dari ayat: • Penegasan keimanan kepada hari akhir yang menunjukkan kekuasaan dan ilmu ilahi, karena yang menciptakan dan mematikan tidak diragukan lagi mampu menciptakannya sekali lagi dan tidak akan mati."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 70: Padahal kamu sebelumnya tidak ada. Ketika sudah tiba ajalnya. Akalnya seperti akal anak-anak. Ilmu dan kekuasaan-Nya meliputi segala sesuatu, di antaranya adalah Dia memindahkan kejadian kamu dari lemah menjadi kuat, dan kembali lagi melemah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 70",
    "description": "Dan di antara tanda-tanda kekuasaan Allah adalah bahwa dia telah menciptakan kamu, wahai manusia, dari sumber yang satu yaitu tanah sehingga kamu ada dan dapat hidup di dunia ini. Kemudian dengan kekuasaan-Nya pula dia mewafatkanmu dengan berbagai cara dan dalam usia yang berbeda sesuai waktu yang telah ditentukan-Nya. Di antara kamu ada yang dimatikan pada usia muda dan ada pula yang dikembalikan kepada usia yang tua renta, pikun, dan lemah kembali bagaikan bayi, sehingga pada usia itu dia tidak mengetahui lagi sesuatu yang dulu pernah diketahuinya. Sungguh, Allah maha mengetahui segala sesuatu dan rahasia dari ciptaan-Nya, mahakuasa melakukan apa saja yang dikehendaki-Nya. Demikianlah, Allah berkuasa menciptakan perbedaan dalam umur manusia. Dan Allah yang maha mengetahui, mahabijaksana, dan mahakuasa pun berkuasa melebihkan sebagian kamu atas sebagian yang lain dalam hal rezeki, kedudukan, jabatan, kekayaan, dan semisalnya. Allah telah membagi rezeki dengan cara demikian kepada manusia, tetapi di antara orang yang dilebihkan rezekinya ada yang tidak mau memberikan sebagian dari rezekinya kepada para hamba sahaya yang mereka miliki, padahal mereka sama-sama manusia, sehingga kalau saja mereka mau saling berbagai niscaya mereka sama-sama merasakan kenikmatan rezeki itu. Mengapa mereka mengingkari nikmat Allah'."
  }
]