[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Allah telah mengutamakan sebagian dari kalian atas sebagian yang lain di kehidupan dunia dalam urusan rizki yang Dia berikan kepada kalian. Maka diantara kalian ada orang yang kaya, dan diantara kalian ada orang yang kekurangan. Dan diantara kalian ada orang yang menjadi tuan dan diantara kalian ada yang menjadi sahaya. Para tuan tidak ingin memberikan kepada sahaya-sahaya miliknya dari karunia yang Allah anugerahkan kepada tuan-tuan itu sesuatu yang menjadikan sahaya-sahaya itu sekutu-sekutu bagi mereka yang sederajat dengan mereka dalam urusan kekayaan. Apabila tuan-tuan itu tidak menerima hal tersebut bagi diri mereka, maka bagaiamana mereka bisa ridha mengadakan sekutu-sekutu bagi Allah dari hamba-hambaNYa? sesungguhnya tindakan ini benar-benar termasuk bentuk kezhaliman dan pengingkaran terbesar terhadap nikmat-nikmat Allah"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "71. Allah -Subḥānahu wa Ta'ālā- melebihkan sebagian kalian atas sebagian lainnya dalam urusan rezeki yang Dia berikan kepada kalian. Allah menjadikan sebagian kalian kaya dan sebagian lainnya miskin, ada pemimpin dan ada rakyat. Orang-orang yang Allah lebihkan dalam urusan rezeki tidak akan memberikan rezeki yang Allah berikan kepada mereka itu kepada hamba-hamba sahaya mereka, sehingga hamba-hamba sahaya tersebut berserikat dengan mereka dalam urusan kepemilikan. Bagaimana mereka rela menisbahkan sekutu bagi Allah dari hamba-hamba-Nya, sementara mereka tidak merelakan hal itu untuk diri mereka sendiri, mereka tidak rela budak-budak mereka sama dengan mereka. Adakah kezaliman yang lebih besar dari ini, adakah pengingkaran terhadap nikmat Allah lebih besar dari ini?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "71. Hai Manusia, Allah telah melebihkan rezeki sebagian kalian di atas bagian lainnya. Diantara kalian ada yang kaya dan ada yang miskin, ada yang menjadi tuan dan ada yang menjadi budak sehingga yang menjadi tuan tidak rela memberi kepada budaknya harta yang dapat menjadikan mereka sama derajatnya. Dan jika mereka tidak rela disamakan dengan budak mereka, mengapa mereka rela membuat sekutu-sekutu bagi Allah dari hamba-hamba-Nya? Kemudian Allah mengingkari orang-orang musyrik: Apakah mereka menyekutukan-Nya dengan yang lain padahal Dia yang telah memberi mereka kenikmatan?!"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "71. وَاللهُ فَضَّلَ بَعْضَكُمْ عَلَىٰ بَعْضٍ فِى الرِّزْقِ ۚ (Dan Allah melebihkan sebahagian kamu dari sebagian yang lain dalam hal rezeki) Allah melapangkan rezeki bagi sebagian hamba-Nya, dan menyempitkan bagi sebagian yang lain bahkan sampai tidak memiliki makanan pokok, dan itu semua atas hikmah-Nya yang dalam. Pendapat lain mengatakan bahwa Allah memberi rezeki lebih banyak kepada tuan daripada yang diberikan kepada budak, dengan dalil firman-Nya: فَمَا الَّذِينَ فُضِّلُوا۟ بِرَآدِّى رِزْقِهِمْ عَلَىٰ مَا مَلَكَتْ أَيْمٰنُهُمْ فَهُمْ فَمَا الَّذِينَ فُضِّلُوا۟ بِرَآدِّى رِزْقِهِمْ عَلَىٰ مَا مَلَكَتْ أَيْمٰنُهُمْ فَهُمْ(tetapi orang-orang yang dilebihkan (rezekinya itu) tidak mau memberikan rezeki mereka kepada budak-budak yang mereka miliki) Yakni antara tuan dan budak. فِيهِ(dalam rezeki itu) Yakni dalam rezeki tersebut. سَوَآءٌ ۚ( sehingga mereka sama) Yakni mereka tidak memberikan rezeki kepada budak-budak mereka hingga mereka memiliki harta yang sama banyaknya. Yakni maka bagaimana kalian menjadikan hamba-Ku sebagai sekutu-sekutu-Ku yang sama dengan-Ku, sehingga kalian menyembah mereka; padahal kalian tidak menjadikan hamba-hamba (budak-budak) kalian sebagai sekutu dalam harta kalian. أَفَبِنِعْمَةِ اللهِ يَجْحَدُونَ(Maka mengapa mereka mengingkari nikmat Allah) Yakni dengan kesyirikan yang mereka lakukan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Sesungguhnya rezekimu yang telah ditentukan tidak akan mampu seorang pen menjauhkannya darimu, dan rezeki orang lain yang telah ditentukan untuknya tidak satupun yang mampu memindahkannya kepadamu, semua yang dtaqdrikan menjadi milikmu akan datang selemah apapun kondisimu, dan apa pun yang ditaqdirkan menjadi milik orang lain, sesungguhnya kamu tidak akan mampu memindahkannya sekuat apapun caramu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "71. Dan Allah itu melebihkan rejeki di antara manusia, sehingga di antara mereka ada yang kaya, fakir, yang menjadi tuan dan yang menjadi budak. (Dalam hal itu) Sungguh merupakan hikmah nyata yang disampaikan Allah sesuai dengan apa yang bisa memberikan kemashlahatan bagi manusia, namun orang-orang kaya yang menjadi tuan itu tidak rela memberikan harta mereka kepada orang-orang fakir yang menjadi budak, sehingga semuanya, yaitu tuan dan hambanya sama-sama merasakan rejeki itu, bagaimana bisa mereka menjadikan hamba-hamba Allah itu sekutu-sekutuNya sedangkan mereka tidak menghendaki hal itu untuk diri mereka sendiri? Dan bagaimana bisa mereka kufur atas nikmat Allah dengan membuat sekutu-sekutu bagi Allah? Karena siapa yang menetapkan seorang sekutu bagi Allah, maka sungguh dia telah mendapatkan sebagian nikmat dan kebaikan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah melebihkan sebagian kalian atas sebagian lain dalam hal rezeki. dan orang-orang yang dilebihkan itu tidak mau memberikan rezekinya kepada para hamba sahaya yang mereka miliki} lalu orang-orang yang dilebihkan oleh Allah dengan kelapangan rezeki atas orang lain itu tidak mau memberikan rezeki mereka kepada hamba sahaya mereka {sehingga mereka sama} sehingga mereka sama dengan hamba sahaya mereka dalam hal rezeki {Mengapa terhadap nikmat Allah mereka ingkar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "71. ini bagian dari dalil dalil tauhid dan buruknya syirik kepada Allah. Allah berfirman, sebagaimana kalian sama dengan yang lain, makhluk ciptaan dan mendapat kucuran rizki. Hanya saja Allah “melebihkan sebagian kamu dari sebagian yang lain dalam hal rizki” Dia menjadikan sebagain kalian orang orang yang merdeka, mempunyai uang dan harta. Sebagian lagi, budak belian, tidak memiliki hak milik terhadap dunia sedikitpun, sebagaimana para tuan yang telah kami utamakan atas mereka dengan (kucuran) rizki (tapi) mereka itu tidak mau “memberikan rizki mereka kepada budak budak yang mereka miiki, agar mereka sama (merasakan) rizki itu” para tuan itu memandang santunan ini termasuk perkara yang dilarang. Maka, begitu pula, makhluk yang engkau sekutukan bersama Allah karena ia hanyalah budak, tidak memegang kendali kerajaan sebesar biji dzarrah sekalipun. Mengapa kalian menjadikannya sebagai sekutu sekutu bagi Allah? tidaklah perbuatan itu melainkan termasuk kezhaliman yang paling besar dan pengingkaran terhadap kenikmatan kenikmatan yang paling besar dan pengingkaran terhadap kenikmatan kenikmatan Alah. oleh sebab itu, Allah berfirman ”maka mengapa mereka mengingkari nikmat Allah? Sekiranya mereka itu mau mengakui nikmat Allah dan menisbatkannya kepada Dzat yang memberikannya niscaya mereka tidak akan menyekutukan sesuatupun dengan Allah."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (فَضَّلَ بَعۡضَكُمۡ عَلَىٰ بَعۡضٖ فِي ٱلرِّزۡقِۚ) fadhdhala ba’dhaakum ‘alaa ba’dhin fir rizzq : “yang melebihkan satu di atas yang lainnya dalam rezeki.” Di antara kalian kaya, maupun miskin, seorang raja, dan juga seorang budak. (بِرَآدِّي رِزۡقِهِمۡ عَلَىٰ مَا مَلَكَتۡ أَيۡمَٰنُهُمۡ) biraaddii rizqihim ‘alaa maa malakat aimaanuhum : “tetapi orang yang dilebihkan tidak mau memberikan rezekinya kepada para hamba sahaya yang mereka miliki,” membagikan apa yang telah Kami berikan kepada mereka dan hamba sahaya mereka. Makna ayat: Konteks ayat masih berputar pada penegasan tauhid dan penghilangan segala sekutu, Allah ta’ala berfirman : “Dan Allah melebihkan sebagian kamu atas sebgian yang lain dalam hal rezeki” diantara kalian ada yang Dia jadikan kaya dan ada pula yang miskin, wahai para manusia. Terkadang di antara kalian wahai orang-orang yang kaya, ada para hamba sahaya, lalu dia tidak ingin budaknya ikut serta mengatur hartanya, sehingga mereka pun menjadi sama tingkatannya? Adapun realitanya, kalian mengingkari hal ini seraya berkata, “Bagaimana mungkin aku menyamakan budakku dalam hal rezeki lalu dia menjadi sama denganku? Ini tentu tidak masuk akal. Namun, bagaimana mungkin kalian menjadikan tuhan-tuhan kalian setara dengan Rabb kalian dalam ibadah, sedangkan berhala-berhala itu adalah di bawah kekuasaan-Nya ta’ala. Dialah yang menciptakan berhala-berhala itu serta yang menguasai kalian, kemana perginya akal sehat kalian wahai orang-orang musyrik? Firman-Nya “Maka mengapa mereka mengingkari nikmat Allah?” sungguh mereka telah mengingkari kenikmatan akal, ini yang pertama, mereka tidak mengakui kenikmatan ini, tidak menggunakannya untuk berpikir, kemudian mereka mengingkari nikmat Allah atas mereka karena Allah telah menciptakan mereka dan memberikan mereka rezeki, namun mereka tidak beribadah kepada-Nya dengan berdzikir dan bersyukur, tetapi malah menyembah selain-Nya berupa berhala-berhala yang tidak memiliki apa pun, tidak memberikan bahaya dan kebaikan. Inilah apa yang dikandung ayat pertama. Pelajaran dari ayat: • Bantahan telak untuk kaum musyrikin dengan persamaan yang ada pada ayat : “Dan Allah melebihkan sebagian kalian dari yang lain dalam rezeki.” • Wajib bersyukur kepada Allah ta’ala atas nikmat-nikmat-Nya, yaitu dengan berdzikir, bersyukur, serta ikhlas dalam hal tersebut."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 71: Ayat ini termasuk dalil tentang keberhakan Allah saja untuk diibadahi; tidak selain-Nya, dan dalil terhadap buruknya perbuatan syirk. Oleh karena itu, di antara kamu ada yang kaya dan ada yang miskin, ada yang merdeka dan ada yang menjadi budak. Yakni jika mereka saja tidak ingin hartanya dibagi rata kepada hamba sahaya mereka atau mereka tidak ingin ada yang bersekutu dalam harta mereka, maka mengapa mereka menjadikan sebagian makhluk milik-Nya sebagai sekutu bagi-Nya. Dengan mengadakan sekutu-sekutu bagi-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 71",
    "description": "Demikianlah, Allah berkuasa menciptakan perbedaan dalam umur manusia. Dan Allah yang maha mengetahui, mahabijaksana, dan mahakuasa pun berkuasa melebihkan sebagian kamu atas sebagian yang lain dalam hal rezeki, kedudukan, jabatan, kekayaan, dan semisalnya. Allah telah membagi rezeki dengan cara demikian kepada manusia, tetapi di antara orang yang dilebihkan rezekinya ada yang tidak mau memberikan sebagian dari rezekinya kepada para hamba sahaya yang mereka miliki, padahal mereka sama-sama manusia, sehingga kalau saja mereka mau saling berbagai niscaya mereka sama-sama merasakan kenikmatan rezeki itu. Mengapa mereka mengingkari nikmat Allah'dan di antara tanda kekuasaan Allah adalah bahwa dia menjadikan bagimu pasangan suami atau istri dari jenis kamu sendiri agar kamu dapat menggapai ketenangan hidup. Dan dia menjadikan anak dan kemudian cucu laki-laki dan perempuan dari pasanganmu, serta memberimu rezeki dari berbagai anugerah yang baik dan sesuai dengan kebutuhan hidup kamu. Jika manusia mengetahui kekuasaan Allah yang demikian besar, lalu mengapa mereka yang kafir tetap saja menyekutukan Allah dan beriman kepada yang batil, yakni berhala-berhala, dan mengingkari nikmat Allah yang telah mereka terima dan rasakan'."
  }
]