[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah menciptakan istri-istri dari jenis kalian supaya jiwa kalian tentram bersama mereka, dan Dia menciptakan dari istri-istri itu anak-anak dan dari keturunan mereka cucu-cucu. Dan Dia memberikan rizki kepada kalian berupa makanan-makanan yang baik-baik dari jenis buah-buahan, biji-bijian dan daging-daging dan lain sebagainya. Apakah terhadap kebatilan dari tuhan-tuhan sekutu mereka beriman sedang mereka mengingkari nikmat-nikmat Allah yang tidak terhitung banyaknya, dan tidak bersyukur kepadaNya dengan mengesakan Allah dengan peribadahan?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "72. Allah menjadikan untuk kalian -wahai manusia- pasangan-pasangan hidup dari jenis kalian sendiri yang dengan mereka kalian hidup tenang. Allah menjadikan untuk kalian dari pasangan-pasangan kalian itu anak-anak dan cucu-cucu. Allah memberi kalian rezeki dalam bentuk makanan seperti daging, biji-bijian dan buah-buahan yang baik. Apakah mereka beriman kepada kebatilan berupa berhala dan patung (yang disembah) sedangkan kepada nikmat-nikmat Allah yang tidak sanggup mereka hitung mereka mengingkari, tidak mensyukuri Allah dengan beriman kepada-Nya semata?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "72. Allah menyebutkan kenikmatan-kenikmatan besar yang telah diberikan kepada manusia: “Allah telah menciptakan bagi kalian pasangan-pasangan agar kalian dapat merasa tenang, dan menciptakan anak-anak dan cucu-cucu dari pasangan-pasangan kalian itu. Dan Allah memberi kalian makanan dan minuman yang lezat dan halal. Maka apakah kalian beriman kepada berhala-berhala dan patung-patung, dan mengingkari segala kenikmatan yang telah Allah berikan kepada kalian?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "72. وَاللهُ جَعَلَ لَكُم مِّنْ أَنفُسِكُمْ أَزْوٰجًا (Allah menjadikan bagi kamu isteri-isteri dari jenis kamu sendiri) Yakni Allah menciptakan wanita-wanita dari jenis manusia, sehingga kalian dapat menikahi mereka dan mendapat ketenangan dari mereka. وَجَعَلَ لَكُم مِّنْ أَزْوٰجِكُم بَنِينَ وَحَفَدَةً(dan menjadikan bagimu dari isteri-isteri kamu itu anak-anak dan cucu-cucu) Makna (الحفدة) yakni keturunan dari anak kita. Pendapat lain mengatakan yakni anak-anak yang merawat kita. وَرَزَقَكُم مِّنَ الطَّيِّبٰتِ ۚ( dan memberimu rezeki dari yang baik-baik) Yakni rezeki yang kalian nikmati dan sukai. أَفَبِالْبٰطِلِ يُؤْمِنُونَ(Maka mengapakah mereka beriman kepada yang bathil) Makna (الباطل) yakni kepercayaan mereka terhadap berhala-berhala mereka bahwa itu dapat mendatangkan kemudharatan dan manfaat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "72. Dan Allah telah memberi kalian istri-istri dari jenis kalian lalu memberi kalian anak melalui istri kalian, lalu cucu dari anak-anak. Dia juga telah memberi kalian kebaikan rejeki yang dapat kalian nikmati. Apakah kalian akan tetap mengimani sesuatu yang bathil, yaitu bahwa berhala-berhala itu memberi kemahdharatan dan kemanfaatan, dan bisa memberi syafaat di sisi Allah? Dan apakah kalian masih akan mengingkari nikmat Allah yang luhur, sehingga menisbahkan nikmat itu terhadap berhala dan patung?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah menjadikan bagi kalian pasangan dari jenis kalian} jenis dan tipe kalian {dan menjadikan bagi kalian dari pasangan kalian anak-anak dan cucu-cucu} anak dari anak {serta menganugerahkan kepada kalian rezeki yang baik-baik. Mengapa terhadap yang bathil mereka beriman, sedangkan terhadap nikmat Allah mereka ingkar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "72. Allah mengabarkan tentang anugerahNya yang agung kepada para hambaNya. Dia telah menjadikan istri istri bagi mereka supaya mereka merasa tentram kepada mereka, dan menjadikan bagi mereka dan istri istri mereka itu anak anak yang membuat pandangan mata mereka menjadi sejuk, anak anak itu pun melayani orang tua dan menyelesaikan kebutuhan kebutuhan orang tua dan dapat berguna bagi orang tua dari sisi yang banyak. Allah memberikan rizki yang baik baik bagi mereka, berupa makanan makanan dan minuman miuman serta beraneka kenikmatan lahiriah yang tidak mampu dihitung oleh para hamba. “maka mengapakah mereka beriman kepada yang batil” maksudnya apakah mereka justru mengimani kebatilan yang sebelumnya bukan menjadi sesuatu yang pernah disebut sebut. Kemudian Allah menciptakannya di saat ia tidak memiliki wujud kecuali ketidaktiadaan? sesembahan sesembahan itu tidak mampu menciptakan, memberi rizki, dan tidak mengatur urusan urusan sedikitpun. Hukum ini umum pada semua objek yang disembah selain Allah, ”dan mengingkari nikmat Allah” mengingkarinya dan malah menggunakannya untuk bermaksiat kepada Allah dan berbuat kufur kepadaNya? tidaklah ini melainkan termasuk kezhaliman yang paling besar, tindakan kejahatan yang paling parah kebodohan yang paling fatal."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (وَٱللَّهُ جَعَلَ لَكُم مِّنۡ أَنفُسِكُمۡ أَزۡوَٰجٗا) wallaahu ja’alalakum min anfusikum azwaajaa : “Dan Allah menjadikan bagimu pasangan (suami dan istri)” karena Hawa tercipta dari Adam, dan seluruh perempuan berasal dari sperma laki-laki. (وَحَفَدَةٗ) wa hafadah : anak dan cucu. (أَفَبِٱلۡبَٰطِلِ يُؤۡمِنُونَ) afabil baathili yu`minuun : “mengapa mereka beriman kepada yang batil” beriman dengan menyembah berhala-berhala. Makna ayat: Adapun ayat yang kedua Allah ta’ala berfirman menegaskan kenikmatan yang telah diberikan kepada orang-orang musyrik setelah mencela mereka karena tidak menggunakan akal mereka pada ayat yang pertama, serta pengingkaran mereka kepada nikmat Rabb mereka, Firman-Nya “Dan Allah” hanya Dia “yang menjadikan bagi kamu istri-istri dari jenis kamu sendiri dan menjadikan bagimu dari istr-istri kamu itu, anak-anak dan cucu-cucu, dan memberikan rezeki dari yang baik-baik.” Dia-lah yang menjadikan istri-istri dari kalanganmu sendiri, manusia yang sama, kalian merasa tenang Bersama mereka, saling memahami dan tolong-menolong sesuai dengan kodrat seorang manusia, dan ini adalah nikmat yang besar. Dia menjadikan dari istri-istri kalian anak-anak dengan jalan nasab dan kelahiran serta cucu-cucu. Yang dimaksud hafadah di sini: orang-orang yang akan segera membantu anda, karena Allah ta’ala telah mengatur mereka untukmu. Yang ketiga : “dan memberikan rezeki dari yang baik-baik.” Berbagai jenis makanan serta minuman yang halal, bermacam-macam rasanya. Inilah Allah, kalian diajak untuk hanya menyembah-Nya namun kalian ingkar, sehingga kalian beriman dengan kebatilan yaitu berhala-berhala, serta beribadah kepadanya, mengingkari Yang Memberikan nikmat dan kenikmatan-Nya, oleh karena itu mereka pantas untuk medapat celaan ini. Firman-Nya “Apakah mereka beriman dengan kebatilan dan menginkari nikmat Allah?” Penyebab mereka tidak mensyukuri nikmat Allah ta’ala adalah karena mereka tidak beribadah kepada-Nya ‘azza wa jalla. Pelajaran dari ayat: • Buruknya mengingkari nikmat serta tidak menganggap yang memberikan kenikmatan dengan tidak bersyukur kepadanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 72: Allah Subhaanahu wa Ta'aala memberitahukan terntang nikmat-Nya yang besar kepada hamba-hamba-Nya, di mana Dia menjadikan untuk mereka pasangan-pasangan agar mereka merasa tenteram kepadanya. Demikian juga menjadikan dari pasangan mereka anak dan cucu yang menyenangkan pandangan mereka, yang membantu dan memenuhi kebutuhan mereka serta memberi banyak manfaat bagi mereka. Allah Subhaanahu wa Ta'aala juga memberikan kepada mereka rezeki dari yang baik-baik, berupa makanan, minuman, nikmat-nikmat yang nampak maupun tersembunyi yang mereka tidak sanggup menjumlahkannya. Oleh karena itu, Hawa diciptakan-Nya dari tulang rusuk Adam, sedangkan semua wanita diciptakan dari air mani laki-laki dan wanita. Yaitu patung dan berhala. Dengan menggunakan nikmat-Nya untuk bermaksiat kepada Allah dan berbuat kufur serta syirk kepada-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 72",
    "description": "Dan di antara tanda kekuasaan Allah adalah bahwa dia menjadikan bagimu pasangan suami atau istri dari jenis kamu sendiri agar kamu dapat menggapai ketenangan hidup. Dan dia menjadikan anak dan kemudian cucu laki-laki dan perempuan dari pasanganmu, serta memberimu rezeki dari berbagai anugerah yang baik dan sesuai dengan kebutuhan hidup kamu. Jika manusia mengetahui kekuasaan Allah yang demikian besar, lalu mengapa mereka yang kafir tetap saja menyekutukan Allah dan beriman kepada yang batil, yakni berhala-berhala, dan mengingkari nikmat Allah yang telah mereka terima dan rasakan'dan orang kafir serta musyrik tetap enggan menyembah Allah yang telah memberi mereka berbagai rezeki dan anugerah. Mereka justru menyembah selain Allah, sesuatu yang sama sekali tidak dapat memberikan rezeki dalam bentuk apa pun kepada mereka, yang bersumber dari langit seperti air dan yang bersumber dari bumi, seperti tanah tempat mereka bercocok tanam dan menggembalakan ternak. Dan sesembahan mereka itu tidak akan sanggup mendatangkan mudarat bagi mereka dan tidak pula sanggup menolong dan melindungi mereka dari azab Allah."
  }
]