[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang musyrik menyembah berhala-berhala yang tidak kuasa untuk memberikan kepada mereka sesuatu dari rizki, baik dari langit seperti air hujan maupun dari bumi seperi hasil tanaman. Berhala-berhala itu tidak memiliki apapun dan tidak ada jalan dari mereka untuk memiliknya, sebab mereka sesungguhnya tidak mempunyai kuasa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "73. Orang-orang musyrikin itu menyembah selain Allah yakni berhala-berhala yang tidak mampu memberi mereka rezeki dari langit atau dari bumi, dan mereka memang tidak akan pernah memilikinya, karena mereka adalah benda mati yang tidak hidup dan tidak berilmu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "73. Orang-orang musyrik itu menyembah patung-patung dan berhala-berhala yang tidak mendatangkan manfaat sedikitpun bagi mereka. Dan sekutu-sekutu itu tidak akan mampu mendatangkannya meskipun mereka menghendaki."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "73. وَيَعْبُدُونَ مِن دُونِ اللهِ مَا لَا يَمْلِكُ لَهُمْ رِزْقًا (Dan mereka menyembah selain Allah, sesuatu yang tidak dapat memberikan rezeki kepada mereka sedikitpun) Yakni orang-orang kafir tersebut menyembah sesembahan yang tdiak dapat memberi mereka rezeki dari langit dan bumi. وَلَا يَسْتَطِيعُونَ (dan tidak berkuasa) Yakni tidak dapat berbuat apapun karena mereka hanyalah benda mati yang tidak dapat bergerak."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "73. Dan orang-orang musyrik itu menyembah sembahan-sembahan selain Allah, yaitu berhala dan patung, sesuatu yang tidak bisa memberi rejeki mereka dari langit dan bumi, meskipun hanya sedikit. Mereka (berhala) juga tidak mampu mengatur sesuatu di masa yang akan datang. Kata {Syaian} merupakan badal dari {rizqan}. Maknanya adalah memberi rejeki meskipun sedikit"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka menyembah selain Allah, sesuatu yang sama sekali tidak bisa memberikan rezeki sedikit pun kepada mereka, baik dari langit maupun dari bumi, dan tidak akan sanggup (berbuat)} tidak berkuasa terhadap sesuatu apapun"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "73-74. Allah memberitahukan tentang kebodohan kaum musyrikin dan kezhaliman mereka, bahwa mereka itu menyembah sesembahan selain Allah, yang mereka daulat sebagai sekutu bagi Allah. padahal, realitanya, sesembahan sesembahan tersebut tidak dapat memberikan rizki kepada mereka sedikitpun dari langit dan bumi, tidak sanggup menurunkan hujan dan rizki, tidak menumbuhkan tanaman apapun dari tanah, tidak mempunyai (kekuasaan) seukuran biji dzarah sekalipun di langit dan di bumi mereka itu tidak berdaya, sekiranya mau melakukannya. Sesungguhnya orang yang bukan pemilik (dari) sesuatu, boleh jadi dia bisa mempunyai kekuatan dan kekuasaan untuk menyalurkan manfaat bagi orang yang berhubungan dengan dirinya. Akan tetapi, sesembahan sesembahan itu tidak mempunyai (kekuasaan) dan tidak berkuasa. Inilah karakter sesembahan mereka. Bagaimana bisa mereka menjadikannya (sekutu) bersama Allah dan menyerupakannya dengan pemilik bumi dan langit, yang mana Dia memiliki seluruh kerajaan dan semua sanjungan dan segenap kekuatan? Untuk itu, Allah berfirman ”maka janganlah kamu mengadakan sekutu sekutu bagi Allah” yang memuat unsur makna penyerupaan antara Allah dengan makhlukNya ”sesungguhnya Allah mengetahui, sedang kamu tidak mengetahui”. kewajiban kita adalah mendengarkan perumpaan yang telah ditetapkan oleh Allah yang maha mengetahui. Karena itu, Allah menetapkan dua permisalan bagiNya dan objek yang disembah selainNya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (رِزۡقٗا مِّنَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ) “rizqam minas samaawaat wal `ardh : “rezeki dari langit dan bumi” dengan menurunkan hujan dari langit dan menumbuhkan tanaman dari bumi. Makna ayat: Firman-Nya “Mereka menyembah selain Allah” berhala-berhala yang tidak memiliki “rezeki dari langit” yaitu menurunkan hujan “dan bumi” menumbuhkan tanaman dan buah-buahan sekalipun sedikit, dan mereka tidak mampu melakukan hal-hal itu karena mereka lemah, mereka hanyalah patung-patung dari batu atau kayu yang dipahat. Di sini terdapat peringatan untuk mereka perihal kesalahan mereka yang sangat besar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 73: Yaitu patung-patung dan berhala. Seperti hujan. Seperti tumbuhnya tanaman. Seperti inilah sifat berhala dan patung yang mereka sembah. Lalu mengapa mereka menyamakannya dengan Allah Penguasa langit dan bumi, di mana milik-Nya semua kerajaan, semua pujian dan semua kekuatan? Oleh karena itu, di ayat selanjutnya Allah Subhaanahu wa Ta'aala memerintahkan agar jangan mengadakan tandingan atau sekutu bagi-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 73",
    "description": "Dan orang kafir serta musyrik tetap enggan menyembah Allah yang telah memberi mereka berbagai rezeki dan anugerah. Mereka justru menyembah selain Allah, sesuatu yang sama sekali tidak dapat memberikan rezeki dalam bentuk apa pun kepada mereka, yang bersumber dari langit seperti air dan yang bersumber dari bumi, seperti tanah tempat mereka bercocok tanam dan menggembalakan ternak. Dan sesembahan mereka itu tidak akan sanggup mendatangkan mudarat bagi mereka dan tidak pula sanggup menolong dan melindungi mereka dari azab Allah. Maka janganlah kamu, wahai manusia, mengadakan sekutu-sekutu bagi Allah dengan menyembah dan mempertuhankan apa pun selain dia serta menisbatkan sifat-sifat buruk kepada-Nya. Sungguh, Allah mengetahui segala sesuatu, sedang kamu tidak mengetahui kecuali yang telah Allah ajarkan kepada kamu. Karena itu, berbuatlah sesuai arahan Allah sebab hal itu tentu baik bagi kehidupanmu."
  }
]