[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan jika kalian telah mengetahui berhala-berhala dan patung-patung tidak berkuasa memberikan manfaat, maka janganlah kalian (wahai sekalian manusia), mengadakan bagi Allah tandingan-tandingan yang diserupakan denganNya dari makhlukNya, yang kalian persekutukan mereka dengan Allah dalam peribadahan. Sesungguhnya Allah mengetahui apa yang kalain perbuat, sedang kalian lalai, tidak menyadari kekeliruan dan buruknya kesudahan kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "74. Wahai manusia, jangan jadikan sekutu-sekutu bagi Allah dari berhala-berhala yang tidak mampu mendatangkan manfaat maupun mudarat, karena Allah tidak mempunyai padanan sehingga kalian boleh menjadikannya sebagai sekutu-Nya dalam beribadah. Sesungguhnya Allah mengetahui sifat-sifat keagungan dan kesempurnaan yang dimiliki-Nya sedangkan kalian tidak mengetahui. Akibatnya kalian terjatuh ke dalam kesyirikan kepada Allah dan mengaku bahwa berhala-berhala kalian setara dengan Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "74. Maka janganlah kalian membuat sekutu-sekutu bagi Allah dan janganlah kalian menyerupakan-Nya dengan apapun; karena tidak ada yang serupa dan menjadi sekutu dengan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "74. فَلَا تَضْرِبُوا۟ لِلّٰهِ الْأَمْثَالَ ۚ (Maka janganlah kamu mengadakan sekutu-sekutu bagi Allah) Yakni janganlah kalian membuat sekutu bagi Allah, sebab Dia-lah Yang Maha Esa. Dahulu mereka beranggapan bahwa Tuhan alam semesta terlalu mulia untuk disembah oleh salah seorang dari kami secara langsung tanpa perantara; oleh sebab itu mereka bertawassul dengan patung-patung dan bintang-bintang, sebagaimana manusia rendahan melayani para pembesar dan para pembesar melayani sang raja."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "74. Maka janganlah kalian menjadikan perumpamaan berupa pembanding dan sekutu-ekutu. Sesungguhnya Allah mengetahui segala hakikat dan sesungguhnya Dialah Tuhan yang Maha Esa, sedangkan kalian tidak mengetahui itu karena kebodohan kalian"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka janganlah mengadakan} janganlah menjadikan {sekutu-sekutu} tandingan dan sekutu {bagi Allah. Sesungguhnya Allah mengetahui, sedangkan kalian tidak mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "73-74. Allah memberitahukan tentang kebodohan kaum musyrikin dan kezhaliman mereka, bahwa mereka itu menyembah sesembahan selain Allah, yang mereka daulat sebagai sekutu bagi Allah. padahal, realitanya, sesembahan sesembahan tersebut tidak dapat memberikan rizki kepada mereka sedikitpun dari langit dan bumi, tidak sanggup menurunkan hujan dan rizki, tidak menumbuhkan tanaman apapun dari tanah, tidak mempunyai (kekuasaan) seukuran biji dzarah sekalipun di langit dan di bumi mereka itu tidak berdaya, sekiranya mau melakukannya. Sesungguhnya orang yang bukan pemilik (dari) sesuatu, boleh jadi dia bisa mempunyai kekuatan dan kekuasaan untuk menyalurkan manfaat bagi orang yang berhubungan dengan dirinya. Akan tetapi, sesembahan sesembahan itu tidak mempunyai (kekuasaan) dan tidak berkuasa. Inilah karakter sesembahan mereka. Bagaimana bisa mereka menjadikannya (sekutu) bersama Allah dan menyerupakannya dengan pemilik bumi dan langit, yang mana Dia memiliki seluruh kerajaan dan semua sanjungan dan segenap kekuatan? Untuk itu, Allah berfirman ”maka janganlah kamu mengadakan sekutu sekutu bagi Allah” yang memuat unsur makna penyerupaan antara Allah dengan makhlukNya ”sesungguhnya Allah mengetahui, sedang kamu tidak mengetahui”. kewajiban kita adalah mendengarkan perumpaan yang telah ditetapkan oleh Allah yang maha mengetahui. Karena itu, Allah menetapkan dua permisalan bagiNya dan objek yang disembah selainNya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat: Firman-Nya “Maka janganlah kalian menjadikan untuk Allah sekutu-sekutu. Sungguh, Allah megetahui sedang kamu tidak mengetahui.” Allah ta’ala melarang mereka untuk menjadikan sekutu-sekutu untuk Allah dengan menyebut patung-patung itu sebagai sesembahan, sedangkan Allah tidak ada satu pun yang setara dengan-Nya, meyakini bahwa berhala-berhala itu bisa memberikan syafa’at untuk mereka di sisi Allah, atau dapat mendekatkan mereka kepada-Nya ta’ala, seakan-akan seorang menteri dan pemimpin atau yang sejenisnya, Allah juga melarang mereka untuk membuat permisalan seperti ini, karena Dia ‘azza wa jalla telah mengetahui tidak ada yang setara dengan-Nya, Dia-lah Allah yang tidak ada Tuhan yang berhak disembah selain-Nya, Maha tinggi Allah dari penyerupaan dan persamaan, sedangkan mereka tidak mengetahui. Oleh karena itu mereka bingung dan tersesat di dalam kegelapan syirik dan lembah-lembah kesesatan. Pelajaran dari ayat: • Ancaman untuk orang-orang yang membuat persamaan dengan Allah ta’ala—sedangkan mereka tidak mengetahui—membuat perantara-perantara untuk-Nya merupakan penyerupaan-Nya dengan para hamba-Nya. Mereka membuat perantara dengan para wali dan para nabi, dengan berdoa dan memohon bantuan kepada mereka, beralasan karena mereka adalah orang-orang yang dekat dengan Allah ta’ala, dan Allah mengabulkan doa-doa mereka sedangkan yang lain tidak."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 74: Oleh karena itu, kita tidak boleh berkata tentang-Nya tanpa ilmu dan harus menyimak perumpamaan yang dibuat oleh-Nya Al ‘Aliim."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 74",
    "description": "Maka janganlah kamu, wahai manusia, mengadakan sekutu-sekutu bagi Allah dengan menyembah dan mempertuhankan apa pun selain dia serta menisbatkan sifat-sifat buruk kepada-Nya. Sungguh, Allah mengetahui segala sesuatu, sedang kamu tidak mengetahui kecuali yang telah Allah ajarkan kepada kamu. Karena itu, berbuatlah sesuai arahan Allah sebab hal itu tentu baik bagi kehidupanmu. Usai melarang manusia menyekutukan-Nya dan menetapkan sifatsifat buruk bagi-Nya, Allah lalu membuat perumpamaan buruknya sikap dan sesatnya tindakan orang kafir bagaikan seorang hamba sahaya yang berada di bawah kekuasaan orang lain; seorang hamba sahaya yang tidak berdaya bertindak dan berbuat sesuatu, dan seorang yang merdeka yang kami beri rezeki yang baik, halal, dan melebihi kebutuhannya lalu dia menginfakkan di jalan kami sebagian dari rezeki itu secara sembunyi-sembunyi dan secara terang-terangan. Samakah mereka yang keadaannya bertolak belakang itu' tentu tidak. Segala puji hanya bagi Allah yang maha esa, maha mengetahui. Kamu, wahai kaum muslim, mengetahui bahwa segala puji hanya bagi Allah, tetapi kebanyakan mereka yang kafir tidak mengetahui hal itu."
  }
]