[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah mengadakan perumpamaan yang Dia menjelasakan melalui perumpaan itu kerusakan keyakinan orang-orang musyrik(yaitu): ada seorang lelaki yang berstatus budak belian, tidak berdaya untuk bertindak bagi dirinya sendiri, tidak memiliki apa-apa dan seorang lelaki lain yang merdeka, ia mempunyai harta yang halal yang Allah rizkikan kepadanya, kendali pengaturan keuangannya di tangannya, ia menginfakan dari uangnya secara sembunyi-sembunyi dan terang-terangan. Apakah akan ada orang yang berakal yang mengatakan sama antara keadaan dua orang lelaki tersebut? Demikian pula Allah yang maha pencipta maha memiliki , yang maha berbuat apa saja, Dia tidak sama dengan makhluk dan hamba-hambaNya, bagiamana bisa kalian menyetarakan antara Allah dan makhlukNya? segala puji bagi Allah semata. Dialah satu-satunya Dzat yang berhak dipuji dan disanjung. Namun kebanyakan orang-orang musyrik tidak menyadari bahwa segala pujian dan kenikmatan itu milik Allah, dan sesungguhnya Dialah semata yang berhak diibadahi."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "75. Allah membuat perumpamaan untuk membantah orang-orang musyrikin, “Seorang hamba sahaya yang tidak mampu bertindak, tidak memiliki apa pun untuk dirinya dan seorang laki-laki merdeka yang Kami beri harta halal yang banyak, lalu dia menggunakan harta tersebut sesuai dengan kehendaknya, dia memberikan apa yang dia kehendaki secara rahasia dan terbuka. Apakah kedua orang itu sama? Bagaimana kalian menyamakan Allah Pemilik yang bertindak terhadap apa yang Dia miliki sekehendak-Nya dengan berhala-berhala kalian yang tidak memiliki kuasa apa pun?” Pujian bagi Allah yang memang berhak untuk dipuji, akan tetapi kebanyakan orang-orang musyrikin tidak mengetahui keesaan Allah dalam uluhiyah (hak dituhankan) dan bahwa Dia lah yang berhak untuk disembah semata."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "75. Allah membuat perumpamaan dari kebatilan perbuatan syirik dengan dua orang laki-laki, salah satunya adalah budak yang tidak memiliki dirinya sendiri dan tidak memiliki harta sedikitpun; sedangkan laki-laki yang lain adalah orang yang merdeka dan kaya, Allah telah memberinya rezeki yang baik dari segala jenis harta, dan dia menginfakkan hartanya secara rahasia dan terang-terangan. Apakah sama antara budak dan orang kaya tersebut? Segala pujian yang sempurna hanya milik Allah Semata. Mayoritas orang-orang musyrik tidak mengerti dan tidak dapat membedakan antara budak dan orang kaya tersebut."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "75. ضَرَبَ اللهُ مَثَلًا عَبْدًا مَّمْلُوكًا لَّا يَقْدِرُ عَلَىٰ شَىْءٍ ا (Allah membuat perumpamaan dengan seorang hamba sahaya yang dimiliki yang tidak dapat bertindak terhadap sesuatupun) Yakni tidak dapat bertindak apapun sehingga ia tidak memiliki sesuatu apapun. وَمَن رَّزَقْنٰهُ مِنَّ (dan seorang yang Kami beri rezeki dari Kami) Yakni dari sisi Kami. رِزْقًا حَسَنًا(dengan rezeki yang baik) Yakni dia adalah orang yang merdeka yang memiliki harta dan dapat menggunakan harta tersebut sesuai kehendaknya. فَهُوَ يُنفِقُ مِنْهُ(lalu dia menafkahkan sebagian dari rezeki itu) Yakni menafkahkannya untuk dirinya dan mensedekahkannya untuk hal-hal yang baik. سِرًّا وَجَهْرًا ۖ( secara sembunyi dan secara terang-terangan) Yakni menyedekahkannya pada waktu yang ia kehendaki. هَلْ يَسْتَوُۥنَ ۚ( adakah mereka itu sama?) Yakni apakah sama antara budak dan orang yang merdeka yang memiliki sifat yang telah disebutkan tersebut? Maka demikian pula antara Tuhan Sang Pencipta dan Pemberi rezeki tidak sama dengan berhala-berhala yang merupakan benda mati yang kalian sembah, yang tidak dapat memberi mudharat dan manfaat. الْحَمْدُ لِلّٰهِ ۚ( Segala puji hanya bagi Allah) Segala puji bagi Allah atas kesempurnaan-Nya. بَلْ أَكْثَرُهُمْ لَا يَعْلَمُونَ(tetapi kebanyakan mereka tiada mengetahui) Yakni tidak mengetahui hal tersebut, sehingga mereka dapat menyembah siapa yang berhak disembah dan mengetahui Sang Pemberi kenikmatan kepada mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "75. Wahai orang-orang musyrik, perumpamaan kalian dalam menyekutukan Allah bersama berhala dan patung itu seperti orang yang menyamakan antara hamba dengan tuannya, antara hamba yang tidak memiliki hak mengatur dengan tuan yang bebas mengatur kuasa dan hartanya yang mana bisa menafkahkannya dan mengaturnya sesuai kehendaknya secara sembunyi-sembunyi maupun terang-terangan. Yang pertama adalah perumpamaan tentang berhala yang lemah dan kedua adalah perumpamaan Tuhan yang Maha Kuasa. Lalu bagaimana bisa yang lemah itu sama dengan yang berkuasa? Sehingga Tuhan yang Maha Pencipta lagi Maha Pemberi rejeki itu tidak sama dengan berhala yang tidak bisa memberi kemahdharatan dan kemanfaatan. Segala puji bagi Allah karena telah menampakkan kebenaran, namun kebanyakan orang-orang musyrik tidak bisa membedakan. Dan kalian harus tahu bahwa tidak ada yang layak mendapatkan ucapan syukur dan pujian kecuali hanya Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah membuat perumpamaan seorang hamba sahaya yang dimiliki yang tidak berdaya berbuat sesuatu, dengan seorang yang Kami anugerahi rezeki yang baik dari Kami. Lalu dia menginfakkan sebagian rezeki itu secara sembunyi-sembunyi dan secara terang-terangan. Apakah mereka itu sama. Segala puji bagi Allah Kebanyakan mereka tidak mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "75. pertama, budak yang dimiliki (orang) yaitu orang yang tidak merdeka, tidak memiliki dirinya sendiri dan juga tidak bisa memiliki hak kepemilikan harta maupun dunia sedikitpun, kedua orang yang merdeka lagi mempunyai keyakinan ia telah menerima rizki yang baik baik dari Allah dan berbagai bentuk kekayaaan orang ini, dermawan, suka berbuat baik menyumbang secara sembunyi sembunyi dan terang terangan. Apakah dua orang ini sama? tidak sama, padahal keduanya makhluk yang tidak menutup kemungkinan terjadinya sifat persamaan antara keduanya. Apabila dua obyek ini saja tidak sama, lalu bagaimana bisa seorang makhluk yang dimiliki yang tidak mempunyai kerajaan kekuasaan dan kemampuan, bahkan makhluk ini sangat mebutuhkan (pertolongan pihak lain) dari segala aspek, disamakan dengan Rabb pencipta, pemiliki segenap kerajaan dan Mahakuasa atas segala sesuatu?. karena itu Allah menyanjung Dzatnya dan memegang sendiri keistimewaan pujian dengan segala jenisnya. Allah berfirman “segala puji hanya bagi Allah” jadi, seolah olah dikatakan ”bila faktanya demikian, mengapa kaum musyrikin menyamakan sesembahan sesembahan mereka dengan Allah?. Allah berfirman “tetapi kebanyakan mereka tidak mengetahui” sekiranya mereka mengetahui dengan sebenarnya, niscaya mereka tidak akan berani berbuat kesyirikan yang besar."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (ضَرَبَ ٱللَّهُ مَثَلًا) dharaballahu matsalaa : “Allah membuat sebuah permisalan” yaitu seorang hamba sahaya....sampai akhir ayat. (عَبۡدٗا مَّمۡلُوكٗا) ‘abdam mamluukaa : “seorang hamba sahaya” bukan orang yang merdeka, bahkan budak milik orang lain. (هَلۡ يَسۡتَوُۥنَۚ) hal yastawuun : “apakah mereka semua sama?” yaitu seorang budak yang tidak punya kekuatan dan orang yang bebas? Tentu jawabannya adalah tidak. Makna ayat: Konteks pembahasan masih mengenai penegasan tauhid serta ajakan kepadanya dan penjelasan kebatilan syirik dan peringatan dari hal itu. Telah lalu, bahwa Allah ta’ala menghukumi kaum musyrikin dengan kebodohan karena mereka menjadikan untuk-Nya tandingan-tandingan, sedangkan Dia tidak memiliki tandingan atau yang setara dengan-Nya. Pada ayat ini, Allah membuat dua permisalan, Dia-lah Yang Maha Mengetahui dan Maha Teliti. Yang pertama; Allah ta’ala berfirman : “Allah membuat sebuah permisalan seorang hamba sahaya” bukan orang yang merdeka “tidak mampu berbuat sesuatu” karena dia adalah seorang budak yang tidak bisa mengatur harta majikannya kecuali atas izinnya. Oleh karena itu ia tidak mampu memberi atau menahan sesuatu. Ini adalah awal dari permisalan. Kemudian yang kedua “antara orang yang telah Kami beri rezeki yang baik” yang baik dan luas “dan dia bisa berinfak dengannya baik terang-terangan atau bersembunyi.” Siang atau malam, karena ia bebas mengatur hartanya, karena posisinya sebagai pemilik. “apakah keduanya sama?” jawabannya adalah: tidak sama. Oleh karena itu “Segala puji bagi Allah, namun kebanyakan dari mereka tidak mengetahui.” Permisalan ini sebagai perbandingan antara seorang mukmin dan kafir. Orang kafir adalah tawanan dan budak bagi berhala-berhala, tidak mengetahui yang baik, tidak pula mengingkari yang buruk, tidak beramal karena Allah, tidak berinfak karena ia tidak beriman dengan hari akhir dan balasan pada hari itu. Adapun seorang mukmin, ia adalah orang yang merdeka, beramal ketaatan kepada Allah, berinfak di jalan Allah terang-terangan atau dengan sembunyi mengharap hari akhir dan balasan dari Allah, orang yang beriman memiliki ilmu, ia tidak takut kecuali kepada Allah dan tidak mengharap kecuali kepada-Nya subhanahu wa ta’ala. Pelajaran dari ayat: • Bolehnya membuat permisalan. Yaitu menyamakan keadaan suatu dengan yang lain, dengan syarat orang yang membuat permisalan itu paham akan permisalan itu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 75: Ibnu Jarir meriwayatkan dengan sanadnya yang sampai kepada Ibnu Abbas radhiyallahu 'anhuma, tentang firman Allah Ta’ala, “Allah membuat perumpamaan seorang hamba sahaya…dst.” (An Nahl: 75) ia berkata, “Ayat ini turun tentang seorang laki-laki dari kaum Quraisy dan budaknya.” Sedangkan firman-Nya, “Dan Allah (juga) membuat perumpamaan, dua orang laki-laki, yang seorang bisu, tidak dapat berbuat sesuatu” sampai, “dan dia berada di jalan yang lurus?” Ia berkata, “Dia adalah Utsman bin Affan. Sedangkan yang bisu, yang jika diarahkan tidak mendatangkan kebaikan adalah Maula (budak yang dimerdekakan) Utsman bin ‘Affan, di mana Utsman menafkahinya, membebaninya dan mencukupkan kebutuhan pangannya, namun maulanya membenci Islam, melarang bersedekah dan melarang berbuat yang ma’ruf (baik).” Syaikh Muqbil menjelaskan, bahwa para perawinya adalah para perawi hadits shahih. Yang merdeka. Yakni antara budak yang lemah dengan yang merdeka yang bebas bertindak? Tentu tidak sama. Jika kedua makhluk itu saja tidak sama, maka apakah sama antara makhluk yang tidak memiliki kekuasaan dan kemampuan, bahkan ia butuh dari berbagai sisi dengan Yang Maha Pencipta yang memiliki segala sesuatu, yang Maha Kaya, lagi Maha Kuasa? Tentu tidak sama. Oleh karena itu, Dia memuji Diri-Nya. Perumpamaan di ayat tersebut adalah untuk membantah orang-orang musyrikin yang menyamakan Allah Tuhan yang memberi rezeki dengan berhala-berhala yang tidak berdaya. Seakan-akan sebelum kalimat di atas ada perkataaan, “Jika demikian keadaannya, maka mengapa orang-orang musyrik menyamakan sesembahan mereka dengan Allah?” Jawabnya adalah kalimat di atas. Jika sekiranya mereka mengetahui, tentu mereka idak berani berbuat syirk."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 75",
    "description": "Usai melarang manusia menyekutukan-Nya dan menetapkan sifatsifat buruk bagi-Nya, Allah lalu membuat perumpamaan buruknya sikap dan sesatnya tindakan orang kafir bagaikan seorang hamba sahaya yang berada di bawah kekuasaan orang lain; seorang hamba sahaya yang tidak berdaya bertindak dan berbuat sesuatu, dan seorang yang merdeka yang kami beri rezeki yang baik, halal, dan melebihi kebutuhannya lalu dia menginfakkan di jalan kami sebagian dari rezeki itu secara sembunyi-sembunyi dan secara terang-terangan. Samakah mereka yang keadaannya bertolak belakang itu' tentu tidak. Segala puji hanya bagi Allah yang maha esa, maha mengetahui. Kamu, wahai kaum muslim, mengetahui bahwa segala puji hanya bagi Allah, tetapi kebanyakan mereka yang kafir tidak mengetahui hal itu. Dan selain perumpamaan itu, Allah juga membuat perumpamaan yang lain, yaitu mengenai dua orang laki-laki yang seorang dari keduanya bisu dan tidak dapat berbuat sesuatu yang bermanfaat bagi dirinya dan orang lain, serta tidak pula dapat memberi maupun menerima informasi. Dan di samping itu, dia menjadi beban bagi penanggungnya. Ke mana saja dia disuruh oleh penanggungnya dan apa pun yang diminta olehnya, dia sama sekali tidak dapat melaksanakannya dan tidak pula dapat mendatangkan suatu kebaikan pun. Samakah orang yang bisu itu dengan orang yang memiliki pikiran sehat, bijaksana dalam ucapan, dapat bertindak baik sesuai keinginannya, tidak menjadi beban bagi orang lain, dapat menyuruh orang lain berbuat keadilan, dan dia berada di jalan yang lurus dengan mematuhi aturan Allah' tentu tidak sama. Lalu bagaimana mungkin kamu, wahai kaum musyrik, menyamakan berhala yang bisu, tuli, dan tidak berkuasa apa pun dengan Allah yang maha melihat, maha mendengar, dan mahakuasa'."
  }
]