[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Allah mengadakan perumpamaan lain terkait kebatilan kesyirikan, yaitu; dua orang, salah satunya bisu lagi buta tidak dapat memahami dan tidak dapat memahamkan, ia tidak dapat bermanfaat bagi diri sendiri atau bagi orang lain, justru ia menjadi beban berat bagi orang yang menangani urusannya dan menghidupinya, bila diutus untuk suatu urusan yang harus diselesaikannya, ia tidak berhasil, dan ia tidak kembali dengan membawa kebaikan. Dan seseorang yang lain, berpanca indra normal, bermanfaat bagi dirinya dan orang lain, memerintahkan untuk berbuat adil, dan dia berada di atas jalan yang lurus yang jelas tanpa ada kebengkokan padanya, apakah sama dua orang tersebut dalam pandangan orang-orang berakal? mengapa kalian mempersamakan antara berahala-berhala yang bisu lagi buta dengan Allah yang maha kuasa lagi maha pemberi segala kebaikan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "76. Allah -Subḥānahu- membuat perumpamaan lain untuk membantah orang-orang musyrikin, “Dua orang laki-laki, yang pertama bisu, tidak berbicara, tuli tidak mendengar dan tidak mengerti, ia tidak bisa mendatangkan manfaat untuk dirinya sendiri apalagi untuk orang lain, ia hanya menjadi beban yang memberatkan orang lain yang mengurusinya, bila orang yang mengurusinya mengutusnya untuk satu kepentingan, maka dia kembali tanpa membawa kebaikan apapun, tidak menunaikan hajat yang harus ditunaikan, apakah orang yang keadaannya demikian ini sama dengan orang yang mendengar dan berbicara, bisa memberi manfaat kepada orang lain, dia mengajak manusia kepada keadilan, dia orang yang jujur dengan dirinya, berjalan di atas jalan yang terang tidak ada kebengkokan padanya. Bagaimana kalian -wahai orang-orang musyrikin- menyamakan Allah Pemilik sifat-sifat keagungan dan kesempurnaan dengan berhala-berhala kalian yang tidak mendengar dan tidak berbicara, tidak mendatangkan manfaat dan tidak mengangkat mudarat?”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "76. Dan Allah membuat perumpamaan lain dari kebatilan perbuatan syirik dengan dua orang lelaki. Salah satunya adalah orang bisu yang tidak dapat berbicara, tidak dapat memahami, dan tidak mampu melakukan apapun; dia hanya menjadi beban bagi orang yang menanggungnya, jika dia diperintahkan melakukan sesuatu, dia tidak dapat melakukannya dengan baik. Sedangkan lelaki yang lain adalah orang yang cerdas dan kuat yang senantiasa memerintahkan orang lain untuk berbuat adil dan selalu menyampaikan nasehat, dia berada di atas jalan yang benar. Apakah sama antara dua lalaki tersebut? Maka mengapa kalian menyamakan antara berhala yang tidak dapat berbicara dengan Allah yang Maha Pemurah?!"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "76. وَضَرَبَ اللهُ مَثَلًا (Dan Allah membuat (pula) perumpamaan) Yakni perumpamaan lain yang lebih jelas dari sebelumnya. رَّجُلَيْنِ أَحَدُهُمَآ أَبْكَمُ(dua orang lelaki yang seorang bisu) Makna (الأبكم) yakni orang yang tidak mampu membantah perkataan. Pendapat lain mengatakan yakni orang yang berlidah pendek, yang tidak dapat berbicara dengan baik. لَا يَقْدِرُ عَلَىٰ شَىْءٍ(tidak dapat berbuat sesuatupun) Karena ia tidak mampu memahami dan tidak mampu berbicara. وَهُوَ كَلٌّ عَلَىٰ مَوْلَىٰهُ(dan dia menjadi beban atas penanggungnya) Yang bergantung pada wali dan kerabatnya. أَيْنَمَا يُوَجِّههُّ لَا يَأْتِ بِخَيْرٍ ۖ( ke mana saja dia disuruh oleh penanggungnya itu, dia tidak dapat mendatangkan suatu kebajikanpun) Sebab ia tidak dapat melakukan sesuatu dengan baik dan tidak mampu berbicara. هَلْ يَسْتَوِى هُوَ(Samakah orang itu) Yang mempunyai sifat-sifat tersebut. وَمَن يَأْمُرُ بِالْعَدْلِ ۙ( dengan orang yang menyuruh berbuat keadilan) Yakni yang menyuruh manusia untuk belaku adil. وَهُوَ(dan dia) Yakni orang tersebut. عَلَىٰ صِرٰطٍ مُّسْتَقِيمٍ(berada pula di atas jalan yang lurus) Yakni berada diatas agama yang benar dan perilaku yang baik. Maksud dari ayat ini adalah untuk menyatakan bahwa tidak mungkin sama antara Allah dan berhala-berhala yang mereka jadikan sekutu-Nya yang tidak dapat berbicara dan tidak pula mampu untuk menciptakan apapun."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "76. Dan bagi kalian itu ada perumpamaan lain yang lebih jelas dari sebelumnya wahai orang-orang musyrik yang menjelaskan perbedaan antara Allah dengan berhala yang disembah selain Dia, yaitu perumpamaan tentang dua laki-laki. Salah satunya bisu, tidak bisa berucap dengan baik, tidak berkuasa atas sesuatu yang berkaitan dengan dirinya maupun orang lain karena dia berpengetahuan dan berpemahaman lemah, dia juga menjadi beban bagi wali dan kerabatnya, dimana ketika dia diutus maka dia akan kembali tanpa membawa suatu manfaat karena dia tidak mampu mengatur apapun. Apakah laki-laki yang memiliki karakter ini sama dengan laki-laki yang memiliki kesempurnaan bakat dan intuisi. Dia memberi manfaat bagi dirinya atau orang lain, memerintahkan keadilan di antara manusia dan dia berada berada di jalan yang jelas? Maksudnya adalah untuk menunjukkan tidak adanya persamaan antara Allah SWT yang berkuasa atas segala sesuatu dengan berhala yang tidak mampu atas sesuatu apapun. Ayat [75] diturunkan untuk seorang laki-laki Quraisy dan hambanya. Dan ayat [76] diturunkan untuk Utsman dan tuannya yang kafir yang membenci dan menolak Islam"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah membuat perumpamaan dua orang laki-laki, salah satunya bisu tidak dapat berbuat sesuatu sehingga dia menjadi beban} beban yang berat {bagi penanggungnya} orang yang mengurus perkaranya {Ke mana saja dia disuruh} dia disuruh {dia sama sekali tidak mendatangkan suatu kebaikan. Apakah orang itu sama dengan orang yang menyuruh berbuat adil dan dia berada di jalan yang lurus"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "76. perumpamaan kedua yaitu permisalan “dua orang lelaki yang seorang bisu” tidak dapat mendengar lagi tidak dapat berbicara ”tidak dapat berbuat sesuatupun” perbuatan yang sedikit maupun banyak, ”dan dia menjadi beban atas penangunggnya” sang tuan justru melayaninya, ia tidak mampu mengurus diri sendiri, mempunyai kekurangan dalam setiap aspek. Apakah sama orang ini dengan “orang yang menyuruh berbuat keadilan dan dia berada di jalan yang lurus” ucapan ucapannya adil dan perbuatan perbuatannya lurus. sebagaimana dua orang ini tidak sama maka tidak sama pula obyek yang disembah selain Allah, padahal ia tidak mampu berbuat sesuatu untuk memenuhi kemaslahatan kemaslahatannya. kalau bukan karena bantuan dari Allah, niscaya dia tidak bisa melakukan apapun, tidak bisa menjadi penyetara maupun tandingan bagi Dzat yang tidak berbicara melainkan dengan kebenaran dan tidak berbuat melainkan perbuatan yang terpuji."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (وَضَرَبَ ٱللَّهُ مَثَلٗا) wa dharaballahu matsalaa : “dan Allah membuat sebuah permisalan” yaitu dua orang laki-laki... (أَبۡكَمُ) abkam : seorang yang terlahir bisu dan tuli, tidak bisa mendengar. (لَا يَقۡدِرُ عَلَىٰ شَيۡءٖ) laa yaqdiru ‘alaa syai` : “tidak mampu berbuat apa-apa” tidak bisa memahami dan memahamkan orang lain. Makna ayat: Firman-Nya “Dan Allah membuat sebuah permisalan” dua orang laki-laki” yaitu permisalan yang kedua pada ayat ini, Allah ta’ala berfirman : “Dan Allah membuat sebuah permisalan” yaitu “dua orang laki-laki, salah satunya bisu” kalimat Al-Abkam (bisu) terkadang juga menunjukkan bahwa orang itu tuli, karena kebanyakan orang bisu tidak bisa mendengar, “tidak mampu berbuat apa-apa” tidak bisa memahami orang lain karena dia tuli, tidak pula memahamkan orang lain karena dia bisu “dan ia adalah beban bagi walinya” yaitu keponakan pamannya, atau orang lain yang mengurusnya dari para kerabatnya yang menghidupi dan menjaganya, karena ia tidak mampu berbuat apa-apa. Firman-Nya “kemanampun ia mengarahkannya, ia tidak membawa kebaikan.” Kemanapun walinya atau keponakannya mengerahkannya untuk sesuatu, ia tidak membawa sesuatu, bahkan terkadang membawa petaka. Adapun kebaikan dan manfaat, ia tidak memperolehnya sama sekali. Ini adalah permisalan bagi berhala-berhala yang disembah selain Allah, mereka tidak mendengar, tidak melihat, tidak pula paham apa yang dikatakan kepada mereka, tidak juga memahamkan para penyembahnya. Berhala-berhala itu butuh kepada mereka untuk membuat, meletakkan, membawa, dan menjaga berhala-berhala itu. Firman-Nya “apakah dia sama dengan yang mengajak kepada keadilan lagi berada di jalan yang lurus.” Yaitu Allah ta’ala, Dia mengajak kepada keadilan; tauhid dan istiqamah dalam segala hal, Dia-lah yang mengurus segala sesuatu, Dia-lah yang berada di jalan yang benar, menyeru manusia untuk meniti jalan itu sehingga mereka bahagia di dunia dan akhirat. Tentu jawabanya adalah tidak sama, maka bagaimana bisa kaum musyrikin menyembah dan setia kepada benda yang bisu yang tidak bisa melakukan apa pun dan meninggalkan penyembahan kepada Yang Maha Mendengar lagi Maha Melihat, Yang Maha Kuat, Yang Maha Kuasa, yang menyeru mereka menuju kesempurnaan dan kebahagiaan di dua kehidupan mereka. Ini adalah perintah dalam konteks takjub, namun tidak mengherankan untuk kekuasaan Allah dan pengaturan Yang Maha Bijaksana lagi Maha Mengetahui. Pelajaran dari ayat: • Penjelasan kesempurnaan seorang mukmin dan kekurangan seorang kafir. • Penjelasan permisalan berhala-berhala yang mati serta kepayahan para penyembahnya dalam menjaga berhala tersebut, serta tidak adanya manfaat yang mereka dapatkan dari berhala-berhala itu. Serta permisalan Allah tabaraka wa ta’ala dalam keadilan, seruan-Nya kepada manusia kepada Islam serta menegakkannya, mengabulkan doa dan menjaga para wali-Nya, ilmu dan pendengaran-Nya yang mendengar doa para hamba-Nya, serta pertolongan, kemuliaan, dan kenikmatan untuk mereka di kehidupan di dunia dan akhirat, dan milik Allah-lah sifat yang tinggi, Dialah Yang Maha Perkasa lagi Maha Bijaksana."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 76: Bisu dan tuli. Dia tidak paham dan tidak memberi pemahaman kepada orang lain. Dia tidak kreatif, dan menjadi beban bagi orang lain. Allah Subhaanahu wa Ta'aala membuatkan perumpamaan yang mudah dicerna oleh manusia agar mereka paham. Sebagaimana tidak sama antara dua makhluk di atas, maka tidak sama pula antara sesembahan selain Allah yang tidak mampu mendatangkan maslahat baik bagi diri maupun orang lain dengan Allah Yang Mahakuasa. Oleh karena itu, sesembahan itu selamanya tidak sebanding dengan Allah; yang firman-Nya adalah hak dan tidak berbuat kecuali perbuatan yang menjadikan-Nya berhak mendapat pujian. Ada pula yang menfasirkan, bahwa ayat ini menerangkan perumpamaan orang kafir dan orang mukmin. Namun ada yang menafsirkan, bahwa ayat ini menerangkan perumpamaan Allah Subhaanahu wa Ta'aala, sedangkan yang bisu dan tidak mampu mendengar adalah patung dan berhala, sedangkan ayat sebelumnya menerangkan perumpamaan orang mukmin dengan orang kafir. Wallahu a’lam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 76",
    "description": "Dan selain perumpamaan itu, Allah juga membuat perumpamaan yang lain, yaitu mengenai dua orang laki-laki yang seorang dari keduanya bisu dan tidak dapat berbuat sesuatu yang bermanfaat bagi dirinya dan orang lain, serta tidak pula dapat memberi maupun menerima informasi. Dan di samping itu, dia menjadi beban bagi penanggungnya. Ke mana saja dia disuruh oleh penanggungnya dan apa pun yang diminta olehnya, dia sama sekali tidak dapat melaksanakannya dan tidak pula dapat mendatangkan suatu kebaikan pun. Samakah orang yang bisu itu dengan orang yang memiliki pikiran sehat, bijaksana dalam ucapan, dapat bertindak baik sesuai keinginannya, tidak menjadi beban bagi orang lain, dapat menyuruh orang lain berbuat keadilan, dan dia berada di jalan yang lurus dengan mematuhi aturan Allah' tentu tidak sama. Lalu bagaimana mungkin kamu, wahai kaum musyrik, menyamakan berhala yang bisu, tuli, dan tidak berkuasa apa pun dengan Allah yang maha melihat, maha mendengar, dan mahakuasa'dan hanya milik Allah-lah apa saja yang tersembunyi di langit dan di bumi, termasuk di dalamnya perihal kiamat. Kiamat adalah hal gaib, tetapi niscaya terjadi. Hanya Allah yang tahu kapan dan bagaimana kiamat terjadi. Urusan kejadian kiamat itu bukanlah hal yang sulit baginya. Kejadiannya begitu cepat, hanya seperti sekejap mata atau lebih cepat lagi, dalam perkiraan dan pemikiran kamu. Bagi Allah, tidak ada perhitungan waktu dalam kejadian hari kiamat karena sesungguhnya Allah mahakuasa atas segala sesuatu."
  }
]