[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan bagi Allah lah pengetahuan semua yang ghaib di langit dan di bumi. Dan tidaklah perihal hari kiamat terkait kecepatan kejadiannya kecuali seperti penglihatan sekilas dengan pandangan mata, bahkan lebih cepat dari itu, sesungguhnya Allah maha kuasa atas segala sesuatu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "77. Hanya Allah semata yang mengetahui hal yang gaib di langit dan di bumi, ilmu tentang yang gaib hanya milik Allah secara khusus, tidak seorang makhluk pun yang berserikat dengan-Nya. Urusan hari Kiamat termasuk perkara gaib yang hanya Dia saja yang mengetahuinya, dalam urusan kedatangannya yang cepat bila Allah menghendakinya hanyalah seperti membuka dan menutup kelopak mata bahkan lebih cepat dari itu. Sesungguhnya Allah Mahakuasa atas segala sesuatu, tidak ada sesuatu yang dapat melemahkan Allah, bila Allah berkehendak pada sesuatu maka dia hanya berfirman, “Jadilah!” maka jadilah ia."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "77. Dan hanya milik Allah ilmu tentang hal yang ghaib yang ada di langit dan bumi. Dan perkara hari kiamat tidak lain hanyalah seperti kedipan mata dalam hal kecepatan dan kemudahannya bagi-Nya, dan bahkan lebih cepat dari itu. Sungguh Allah Maha Kuasa atas segala sesuatu, tidak ada yang sulit bagi-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "77. وَلِلّٰهِ غَيْبُ السَّمٰوٰتِ وَالْأَرْضِ ۚ (Dan kepunyaan Allah-lah segala apa yang tersembunyi di langit dan di bumi) Hanya Allah yang memilikinya, tidak ada yang menjadi sekutu dalam hal ini. وَمَآ أَمْرُ السَّاعَةِ(Tidak adalah kejadian kiamat itu) Yang termasuk hal ghaib yang hanya diketahui oleh Allah. إِلَّا كَلَمْحِ الْبَصَرِ أَوْ هُوَ أَقْرَبُ ۚ( melainkan seperti sekejap mata atau lebih cepat (lagi)) Yakni Allah memiliki kekuasaan untuk mendatangkannya dalam sekejap mata, sebab jika Allah hendak menciptakan sesuatu Dia hanya perlu mengatakan “kun” (jadilah), maka sesuatu itupun telah jadi. إِنَّ اللهَ عَلَىٰ كُلِّ شَىْءٍ قَدِيرٌ (Sesungguhnya Allah Maha Kuasa atas segala sesuatu) Dan kedatangan kiamat yang sangat cepat merupakan bagian dari kekuasaan-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "77. Dan Allah itu memiliki pengetahuan tentang perkara ghaib di langit dan bumi. Itu hanya khusus miliknya tanpa dibantu siapapun. Dan tidaklah perkara kiamat yang merupakan salah satu dari perkara ghaib yang kejadiannya sangat cepat itu tidak lain hanya seperti kedipan mata yang sangat cepat, mudah dan sangat dekat. Dan Allah itu Maha kuasa untuk mendatangkannya dengan berfirman {Kun Fayakun} [QS Al-Baqarah 2/117 dan juga di beberapa surah lainnya] Sesungguhnya Allah itu memiliki kuasa penuh atas segala sesuatu termasuk kiamat. Dan tanda-tanda itu terkumpul di antara kesempurnaan ilmu dan kekuasaan yang hanya dimiliki Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Milik Allah (segala) yang tersembunyi di langit dan di bumi. Dan perkara kiamat itu hanya seperti sekejap mata} pandangan sekejap saja {atau lebih cepat. Sesungguhnya Allah Maha kuasa atas segala sesuatu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "77. maksudnya, Dialah Dzat satu satunya yang mengetahui alam ghaib di langit dan di bumi. Tidak ada yang mengetahui hal hal yang tersembunyi, sesuatu yang batin dan rahasia keuali Dia. Termasuk juga ilmu tentang hari kiamat, tiada seorangpun yang mengetahui kapan datang masanya kecuali Allah. Jika telah tiba dan muncul, maka tidaklah kejadian kiamat itu, ”melainkan seperti sekejap mata atau lebih cepat (lagi)” dari kedipan mata. Orang orang bangkit dari kubur kubur mereka pada hari kebangkitan dan penyebaran mereka. dan kesempatan sudah hilang bagi orang yang menginginkan penangguhan waktu lagi. ”sesungguhnya Allah maha kuasa atas segala sesuatu” maka jangan dianggap aneh kekuasaanNya yang sempurna untuk menghidupkan orang orang yang telah mati."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (وَلِلَّهِ غَيۡبُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ) wa lillaah ghaibus samaawaati wal ardh : “dan milik-Nya lah segala yang tersembunyi di langit dan di bumi.” (وَمَآ أَمۡرُ ٱلسَّاعَةِ) wa maa `amrus saa’ati : “tidaklah perkara hari kiamat” yaitu kejadiannya, yaitu matinya seluruh makhluk hidup dan dihidupkannya yang telah mati, serta perubahan yang terjadi pada alam semesta. Makna ayat: Firman-Nya pada ayat [77] “Milik Allah-lah segala yang tersembunyi di langit dan bumi.” Hanya Dia yang mengetahui apa yang tersembunyi dari kita yang ada di langit dan bumi. Dia mengetahui siapa yang telah ditetapkan untuknya kebahagiaan, dan siapa yang telah ditetapkan celaka, siapa yang mendapat hidayah, siapa yang tidak, dan balasan akan datang dengan tegaknya hari kiamat. “Tidaklah perkara kiamat” yaitu kedatangannya “kecuali seperti sekejap mata atau lebih dekat lagi.” Karena hal itu hanya tergantung pada sebuah kalimat “jadilah”, kemudian kehidupan ini akan berhenti dan dilanjutkan dengan kehidupan baru, serta segala sesuatu telah diubah bentuknya. “Sungguh, Allah Maha Kuasa atas segala sesuatu.” Di antara hal itu adalah hari kiamat dan kedatangannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 77: Oleh karena itu, tidak ada yang mengetahui hal yang tersembunyi lagi samar kecuali Dia. Termasuk di antaranya adalah pengetahuan tentang kapan kiamat. Yang demikian, karena Dia cukup berkata, “Kun” (terjadilah), maka terjadilah dia, dan Dia Mahakuasa atas segala sesuatu. Ketika itu, manusia bangkit dari kuburnya dan telah hilang kesempatan bagi orang yang meminta penangguhan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 77",
    "description": "Dan hanya milik Allah-lah apa saja yang tersembunyi di langit dan di bumi, termasuk di dalamnya perihal kiamat. Kiamat adalah hal gaib, tetapi niscaya terjadi. Hanya Allah yang tahu kapan dan bagaimana kiamat terjadi. Urusan kejadian kiamat itu bukanlah hal yang sulit baginya. Kejadiannya begitu cepat, hanya seperti sekejap mata atau lebih cepat lagi, dalam perkiraan dan pemikiran kamu. Bagi Allah, tidak ada perhitungan waktu dalam kejadian hari kiamat karena sesungguhnya Allah mahakuasa atas segala sesuatu. Allah mahakuasa dan maha mengetahui; tidak ada yang luput dari pengetahuan-Nya. Dan di antara bukti kekuasaan dan pengetahuan Allah adalah bahwa dia telah mengeluarkan kamu, wahai manusia, dari perut ibumu. Kamu sebelumnya tidak ada, kemudian terjadilah suatu proses yang mewujudkanmu dalam bentuk janin yang hidup dalam kandungan ibu dalam waktu yang ditentukan-Nya. Ketika masanya telah tiba, Allah lalu mengeluarkanmu dari perut ibumu dalam keadaan tidak mengetahui sesuatu pun, baik tentang dirimu sendiri maupun tentang dunia di sekelilingmu. Dan dia memberimu pendengaran agar dapat mendengar bunyi, penglihatan agar dapat melihat objek, dan hati nurani agar dapat merasa dan memahami. Demikianlah, Allah menganugerahkan itu semua kepadamu agar kamu bersyukur."
  }
]