[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Allah telah mengeluarkan kalian dari perut-perut ibu-ibu kalian sesudah masa kehamilan sedang kalian tidak mengetahui apapun yang ada di sekitar kalian, kemudia Allah menjadikan bagi kalian sarana-sarana pengetahuan berupa pendengeran, penglihatan, dan hati. Mudah-mudahan kalian beryukur kepada Allah , atas nikmat-nikmat tersebut. Dan mengesakan Allah dengan ibadah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "78. Allah mengeluarkan kalian wahai manusia dari perut ibu kalian sesudah habis masa kehamilan dalam bentuk anak-anak yang tidak tahu apa pun. Allah memberi kalian pendengaran untuk mendengar, penglihatan untuk melihat dan hati untuk memikirkan, dengan harapan kalian akan bersyukur kepada Allah atas kenikmatan yang Dia berikan kepada kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "78. Dan salah satu bukti kebesaran kuasa-Nya, Allah mengeluarkan kalian dari rahim ibu kalian dalam keadaan masih bayi yang tidak mengetahui apapun, dan Allah menciptakan bagi kalian alat-alat untuk mendapat ilmu berupa pendengaran, penglihatan, dan akal. Hal ini agar kalian bersyukur kepada Allah atas karunia tersebut dengan perkataan dan perbuatan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "78. وَاللهُ أَخْرَجَكُم مِّنۢ بُطُونِ أُمَّهٰتِكُمْ لَا تَعْلَمُونَ شَيْـًٔا (Dan Allah mengeluarkan kamu dari perut ibumu dalam keadaan tidak mengetahui sesuatupun) Yakni bayi-bayi yang tidak mengetahui sesuatu apapun. وَجَعَلَ لَكُمُ السَّمْعَ وَالْأَبْصٰرَ وَالْأَفْـِٔدَةَ ۙ( dan Dia memberi kamu pendengaran, penglihatan dan hati) Yakni Allah menciptakan pada diri kalian hal-hal ini, agar dengannya kalian dapat mendapatkan ilmu. لَعَلَّكُمْ تَشْكُرُونَ(agar kamu bersyukur) Yakni agar kalian menggunakan setiap anggota tubuh sesuai dengan tujuannya masing-masing, sehingga kalian mengetahui nilai kenikmatan yang Allah berikan kepada kalian, kemudian dengan begitu kalian akan mensyukuri-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "78. Dan di antara kuasa-kuasa Allah SWT yaitu mengeluarkan kalian dari rahim ibu-ibu kalian sebagai anak kecil yang tidak memiliki pengetahuan apapun, lalu menciptakan untuk kalian media untuk belajar dan memahami yaitu pendengaran, penglihatan dan hati, supaya kalian beriman kepada Dzat yang Maha Pencipta dengan keyakinan dan keilmuan yang semburna serta supaya kalian bersyukur atas nikmatnya dengan memfungsikan setiap anggota tubuh kalian untuk melakukan sesuatu yang baik"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah mengeluarkan kalian dari perut ibu kalian dalam keadaan tidak mengetahui apa pun dan Dia memberi kalian pendengaran, penglihatan, dan hati nurani agar kalian bersyukur"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "78. Dialah Dzat satu satunya yang mencurahkan kenikmatan kenikmatan ini, yang mana “mengeluarkan kamu dari perut ibumu dalam keadaan tidak mengetahui sesuatupun” tidak berdaya untuk berbuat apapun. Kemudian Dia “memberi kamu pendengaran, penglihatan dan hati” secara khusus, Allah menyebutkan tiga anggota tubuh ini, karena nilai kemuliaan dan keutamaannya (yang lebih) dan karena ketiganya merupakan kunci pembuka ilmu. Tidak ada ilmu yang sampai kepada seorang hamba melainkan melalui salah satu dari tiga pintu itu. Apabila tidak demikian, maka seluruh anggota tubuh dan kekuatan lahiriah dan batiniah, Allah lah yang memberikannya kepada mereka. Dia senantiasa menumbuhkannya sedikit demi sedikit, sampa seorang berada dalam kondisinya yang ideal. Hal itu, tujuannya agar mereka bersyukur kepada Allah dengan cara memakai piranti anggota tubuh yang Allah berikan kepada mereka dalam rangka ketaatan kepada Allah. Siapa saja yang menggunakannya untuk tujuan selain itu, maka anggota tubuh itu akan menjadi penggugat buruk atas dirinya yang telah membalas kenikmatan dengan timbal balik yang buruk."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (ٱلۡأَفۡ‍ِٔدَةَ) al-`af`idah : “hati” Makna ayat: Firman-Nya “Allah yang mengeluarkan kalian dari perut ibu kalian dalam keadaan kalian tidak mengetahui apa-apa” ini adalah kenyataan yang tidak bisa diingkari, Allah-lah yang telah mengeluarkan kita dari perut ibu kita setelah Dia membentuk kita di dalam rahim dan menumbuhkan kita, hingga menjadi seorang manusia, lalu mengizinkan kita untuk dilahirkan, maka lahirlah kita dan kita keluar tanpa mengetahui apa pun. Ini adalah ayat yang menunjukkan kekuatan, ilmu, dan pengaturan ilahi, apakah berhala-berhala itu bisa melakukan hal ini? Tentu jawabannya “Tidak”. kemudian Allah memberikan kepada kita pendengaran, pengelihatan, dan hati sebagai nikmat yang lain, karena jika bukan karena hal itu niscaya kita tidak akan bisa mendengar, melihat, tidak pula berpikir, dan kehidupan kita menjadi tidak berarti, karena lebih baik tidak ada dari pada hidup dengan kondisi seperti ini. Firman-Nya “Agar kalian bersyukur.” Inti dari rahasia kenikmatan ini. Allah menjadikan kita dapat mendengar, melihat, dan berpikir untuk dapat mengemban beban, dengan perintah dan larangan, agar kita mengikuti-Nya dengan mentaati perintah dan menjauhi larangan. Inilah bentuk syukur yang diminta dari kita, dan syukur adalah sebuah kebaikan, karena ia adalah perbekalan untuk meraih kebahagiaan di dunia dan akhirat. Maka, adakah orang yang mau ingat akan hal ini, wahai para hamba Allah?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 78: Disebutkan ketiga hal ini karena kelebihannya, meskipun anggota badan yang lain juga merupakan pemberian Allah Subhaanahu wa Ta'aala. Ketiga hal ini merupakan kunci bagi setiap ilmu. Seorang hamba tidaklah mendapatkan ilmu kecuali melalui salah satu pintu ini. Yakni terhadapnya sehingga kamu beriman. Bersyukur terhadapnya adalah dengan menggunakan pemberian itu untuk ketaatan kepada Allah. Barang siapa yang tidak menggunakan untuk berpikir mencari kebenaran atau untuk ketaatan kepada Allah, maka semua itu akan menjadi hujjah terhadapnya (berbalik menimpanya), dan sama saja membalas nikmat dengan keburukan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 78",
    "description": "Allah mahakuasa dan maha mengetahui; tidak ada yang luput dari pengetahuan-Nya. Dan di antara bukti kekuasaan dan pengetahuan Allah adalah bahwa dia telah mengeluarkan kamu, wahai manusia, dari perut ibumu. Kamu sebelumnya tidak ada, kemudian terjadilah suatu proses yang mewujudkanmu dalam bentuk janin yang hidup dalam kandungan ibu dalam waktu yang ditentukan-Nya. Ketika masanya telah tiba, Allah lalu mengeluarkanmu dari perut ibumu dalam keadaan tidak mengetahui sesuatu pun, baik tentang dirimu sendiri maupun tentang dunia di sekelilingmu. Dan dia memberimu pendengaran agar dapat mendengar bunyi, penglihatan agar dapat melihat objek, dan hati nurani agar dapat merasa dan memahami. Demikianlah, Allah menganugerahkan itu semua kepadamu agar kamu bersyukur. Bukti wujud dan kuasa Allah begitu banyak, tetapi mengapa tidak sedikit manusia yang tetap enggan beriman kepada-Nya' tidakkah mereka memperhatikan burung-burung yang dapat terbang di angkasa dengan mudah atas izin dan kuasa-Nya. Tidak ada yang dapat menahannya tetap melayang di angkasa tanpa terjatuh selain Allah. Sungguh, pada yang demikian itu benar-benar terdapat tanda-tanda kebesaran dan kekuasaan Allah bagi orang-orang yang beriman."
  }
]