[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidakkah orang-orang musyrik itu memandang burung-burung yang dimudahkan untuk beterbangan di udara antara langit dan bumi dengan ketetapan Allah? tidak ada yang menahan mereka dari terjatuh kebawah, kecuali Allah dengan kekuatan yang diciptakanNya bagi burung-burung itu berupa sayap-sayap dan ekor sehingga mebiuatnya mampu untuk melakukan hal tersebut. Sesungguhnya pada kejadian memudahkan terbang dan menahan dari jatuh terdapat petunjuk-petunjuk kebenaran bagi orang-orang yang beriman dengan bukti-bukti kebenaran yang menunjukan kuasa Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "79. Apakah orang-orang musyrikin tidak melihat burung-burung yang siap terbang dengan leluasa di angkasa dengan sayap pemberian Allah dan angin yang berhembus lembut. Allah mengilhamkan kepada burung agar mengepakkan sayap dan menariknya, tidak ada yang membuatnya bisa terbang dan tidak jatuh kecuali Allah yang Mahakuasa, sesungguhnya kemampuan burung yang merupakan pemberian dari Allah mengandung petunjuk bagi orang-orang yang beriman kepada Allah, karena mereka adalah orang-orang yang mengambil faedah dari petunjuk dan pelajaran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "79. Apakah para hamba Allah tidak melihat kepada burung-burung yang dapat terbang di udara antara langit dan bumi? Tidak ada yang dapat membuat mereka tidak terjatuh kecuali Allah dengan kuasa-Nya yang besar. Sungguh dalam perkara kelahiran kalian dan kemampuan burung untuk terbang terdapat bukti-bukti nyata bagi orang-orang yang beriman kepada Allah dan kuasa-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "79. أَلَمْ يَرَوْا۟ إِلَى الطَّيْرِ مُسَخَّرٰتٍ (Tidakkah mereka memperhatikan burung-burung yang dimudahkan terbang) Yakni dimudahkan untuk terbang dengan kedua sayap yang Allah karuniakan kepadanya dan dengan faktor-faktor lain yang membantunya untuk terbang, seperti angin yang tenang, dan ilham yang diberikan kepada burung itu agar mengepakkan kedua sayapnya seperti orang yang berenang di air. فِى جَوِّ السَّمَآءِ (diangkasa bebas) Yakni di angkasa yang jauh tinggi dari permukaan tanah. مَا يُمْسِكُهُنَّ (Tidak ada yang menahannya) Di angkasa. إِلَّا اللهُ ۗ( selain daripada Allah) Dengan kuasa-Nya yang Maha Besar."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "AL-Qosimy meriwayatkan dari al-Ghazali : Perhatikan bagaimana Allah menciptakan seekor burung dengan bentuk tubuhnya yang ringan ia bawa saat terbang, Allah tidak menjadikan pada tubuh burung sesuatu yang memberatkannya, dan ia menjadikan kulit tulang keringnya yang tebal dan kuat; agar ditumbuhi bulu yang tebal yang menjaganya pada cuaca yang dingin dan panas, dan Allah menciptakan sekor burung dengan perkembang biakannya dengan cara bertelur agar tidak memberatkannya ketika terbang. Maka apakah kamu memperhatikan begitu banyak ciptaan Allah dengan hikmah yang begitu indah dibaliknya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "79. Apakah orang-orang yang mengingkari adanya Allah itu tidak melihat burung-burung yang terbang di udara atau ruang terbuka antara langit dan bumi menggunakan sayap dan ekornya. Tidak ada yang menahan mereka di udara kecuali Allah menggunakan kuasaNya yang menakjubkan. Sesungguhnya dalam penggunaan sayap itu terdapat dalil atas keesaan dan kekuasaan Allah bagi kaum yang beriman kepada Allah, kitab-kitabNya, dan rasul-rasulNya karena mereka itu mengambil manfaat dari hal itu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah mereka tidak memperhatikan burung-burung yang dapat terbang} yang diberi kendali untuk terbang {di angkasa dengan mudah. Tidak ada yang menahannya selain Allah. Sesungguhnya pada yang demikian itu benar-benar terdapat tanda-tanda bagi kaum yang beriman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "79. maksudnya, mereka itulah kaum yang bisa meraih manfaat dengan ayat ayat Allah, yang memikirkan tentang ayat ayat yang dijadikan petunjuk kepadaNya. Sementara itu, selain kaum Mukminin, maka sesungguhnya pandangan mereka itu adalah pandangan main main dan kelalaian. Kolerasinya dengan ayat ini, bahwa Allah telah menciptakan burung dalam rupa penciptaan yang mendukungnya untuk terbang. Kemudian Allah mengondisikan angin yang lembut untuknya. Selanjutnya memasang kekuatan gerakan pada burung itu yang bisa membuatnya terbang. Ini merupakan petunjuk atas hikmah dan ilmu Allah yang luas serta perhatian rabbaniNya terhadap seluruh makhluk dan (pertanda) kesempurnaan kekuasaanNya terhadap seluruh makhluk dan (pertanda) kesempurnaan kekuasaanNya, mahaberkah Allah, penguasa alam semesta."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata (مُسَخَّرَٰتٖ فِي جَوِّ ٱلسَّمَآءِ) Musakhkharaatin fii jawwis samaa` : yang tunduk, terbang di antara langit dan bumi, yaitu udara. (مَا يُمۡسِكُهُنَّ) maa yumsikuhunn : “tidak ada yang menahannya” yaitu yang menahan burung itu agar tidak jatuh ketika ia melipat atau mengepakkan sayapnya kecuali Allah ta’ala dengan kekuasaan dan aturan-Nya untuk seluruh makhluk-Nya. Makna ayat: Ayat yang mulia ini masih menjelaskan penegasan tauhid dan ajakan kepadanya, serta penjelasan kebatilan syirik dan ajakan untuk menjauhinya, Allah ta’ala berfirman : “Apakah mereka tidak melihat burung-burung yang tunduk terbang di langit, tidak ada yang menahan mereka kecuali Allah.” Sungguh pada penciptaan burung dengan segala jenis dan spesiesnya serta terbangnya di atas langit, bagaimana ia melipat dan mengepakkan kedua sayapnya, namun ia tidak jatuh ke bumi, siap lagi yang menahannya jika bukan Allah sesuai dengan pengaturannya kepada makhluknya serta alam ciptaan-Nya. Sungguh pada hal yang telah disebutkan itu terdapat tanda-tanda yang banyak akan wujud Sang Pencipta, kekuasaan dan ilmu-Nya, itu semua mewajibkan seorang hamba untuk mengetahui diri-Nya, bertaqarrub dan taat dengan beribadah hanya kepada-Nya. Ayat ini juga menunjukkan kebatilan menjadikan tuhan dan menyembah kepada selain-Nya. Ayat-ayat ini menjadi tanda-tanda bagi kaum mukminin karena mereka memiliki hati yang hidup, sehingga mereka dapat memahami dan menangkap pelajaran, berbeda dengan orang kafir, hati mereka mati, mereka tidak dapat memahami tidak pula mengambil pelajaran, sehingga ayat ini bukan menjadi tanda untuk mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 79: Ketika burung-burung itu menutup sayapnya atau membuka. Allah Subhaanahu wa Ta'aala yang menciptakan burung yang membuatnya dapat terbang, Dia menciptakan pula angkasa yang memudahkan burung-burung terbang di sana dan Dia yang menahannya agar tidak jatuh. Yakni tanda yang menunjukkan sempurnanya kebijaksanaan Allah, ilmu-Nya yang luas, dan perhatian-Nya kepada semua makhluk serta sempurnanya kekuasaan-Nya. Karena kepada mereka (orang-orang beriman) ayat-ayat Allah bermanfaat, adapun selain mereka, maka pandangan mereka hanya sebatas pandangan main-main dan kelalaian."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 79",
    "description": "Bukti wujud dan kuasa Allah begitu banyak, tetapi mengapa tidak sedikit manusia yang tetap enggan beriman kepada-Nya' tidakkah mereka memperhatikan burung-burung yang dapat terbang di angkasa dengan mudah atas izin dan kuasa-Nya. Tidak ada yang dapat menahannya tetap melayang di angkasa tanpa terjatuh selain Allah. Sungguh, pada yang demikian itu benar-benar terdapat tanda-tanda kebesaran dan kekuasaan Allah bagi orang-orang yang beriman. Setelah pada beberapa ayat sebelumnya Allah berbicara tentang burung-burung di angkasa sebagai tanda kekuasaan-Nya, pada ayatayat berikut Allah menunjukkan beberapa nikmat- nya yang langsung manusia rasakan setiap saat. Dia menyatakan, dan Allah menjadikan rumah-rumah bagimu yang kamu buat dari berbagai bahan yang telah Allah siapkan untuk itu, seperti kayu, besi, batu, dan tanah; Allah menjadikannya sebagai tempat tinggal yang memberi kamu ketenangan dari berbagai gangguan lahir dan batin. Dan selain itu, dia menjadikan bagimu rumah-rumah dalam bentuk kemah-kemah yang secara khusus terbuat dari kulit hewan ternak, seperti kulit unta, sapi, kambing, dan hewan-hewan halal lainnya, yang kamu merasa ringan dan mudah membawanya pada waktu kamu bepergian dan pada waktu kamu bermukim di tempat tertentu. Dan ingat pula bahwa Allah juga menjadikan bagi kamu dari bulu domba, bulu unta, dan bulu kambing, alat-alat rumah tangga, seperti alas lantai, tikar, wadah air dan menjadi perhiasan-perhiasan, seperti tas, sepatu, dan dompet, yang dapat memberi kesenangan bagi kalian sampai waktu tertentu."
  }
]