[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Dia menciptakan bagi kalian kuda, baghal dan keledai, agar kalian menungganginya dan berpungsi sebagai perhiasan dan pesona indah bagi kalian. Dan Dia menciptakan bagi kalian berbagai sarana tranportasi dan lain-lain yang kalian tidak memiliki pengetahuan tentang itu sama sekali, agar kalian bertambah syukur dan iman kepadaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Allah menciptakan bagi kalian kuda, bigal dan keledai guna kalian kendarai dan kalian gunakan untuk mengangkut barang-barang kalian, di samping sebagai penunjang penampilan di depan manusia. Allah menciptakan apa yang Dia kehendaki untuk diciptakan-Nya sementara kalian tidak mengetahuinya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "8. Dan Allah menciptakan bagi kalian hewan-hewan seperti kuda, baghal, dan keledai agar dapat kalian tunggangi untuk bepergian dan berhias; terlebih lagi dengan kuda pilihan. Dan Allah menciptakan makhluk-makhluk yang tidak kalian ketahui namun bermanfaat bagi kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. وَالْخَيْلَ وَالْبِغَالَ وَالْحَمِيرَ (dan (Dia telah menciptakan) kuda, bagal dan keledai) Yakni Allah menciptakan bagi kalian tiga jenis hewan ini. لِتَرْكَبُوهَا(agar kamu menungganginya) Dan juga agar kalian manfaatkan untuk hal selain menungganginya, seperti untuk mengangkut barang-barang. وَزِينَةً ۚ( dan (menjadikannya) perhiasan) Yakni sebagai perhiasan dan angkutan bagi kalian sehingga kalian mendapati kesenangan dalam diri kalian. وَيَخْلُقُ مَا لَا تَعْلَمُون(Dan Allah menciptakan apa yang kamu tidak mengetahuinya) Yakni Allah juga menciptakan makhluk-makhluk yang tidak kalian ketahui selain dari yang telah Dia sebutkan baik itu di darat maupun di laut, yang belum pernah dilihat dan didengar oleh manusia. Bisa juga yang dimaksud adalah bahwa Allah terus menciptakan makhluk-makhluk yang lain seperti sarana-sarana transportasi dan bahan-bahan untuk perhiasan yang belum diketahui oleh manusia."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Penemuan apapun yang terlintas dalam benakmu yang menggambarkan segala tekhnologi modern, melainkan al-Qur'an lebih awal telah menyinggung hal itu sebelumnya, perhatikan firman Allah : { وَيَخْلُقُ مَا لَا تَعْلَمُونَ } \"Dan Allah menciptakan apa yang kamu tidak mengetahuinya\", meskipun ayat ini mengandung makna umum, namun seseorang yang mentadabburinya akan mengerti luasnya makna dari firman Allah ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8. Dia telah menciptakan kuda, bighal (peranakan kuda) dan keledai, agar kamu dapat menungganginya, membawa beban bawaan juga menjadikannya sebagai perhiasan. Dan Allah menciptakan apa hal menakjubkan yang kamu tidak mengetahuinya. Seperti alat transportasi modern seperti mobil pesawat kapal dan roket yang sangat besar"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan kuda, baghal, dan keledai untuk kalian tunggangi dan menjadi perhiasan. Allah menciptakan apa yang tidak kalian ketahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8. “dan (Dia telah menciptakan) kuda, bagal, dan keledai” Kami menundukkannya bagi kalian “agar kamu menungganginya dan (menjadikannya) perhiasan” maksudnya suatu waktu, kalian menggunakannya untuk keperluan tunggangan, kadang kadang memfungsikannya untuk keindahan dan perhiasan. Manfaat konsumsi tidak disebutkan (oleh Allah) karena bagol (peranakan kuda dan keledai) dan keledai haram dikonsumsi. Sedangkan kuda, pada umumnya tidak dimanfaatkan untuk dikonsumsi. Bahkan muncul larangan penyembelihannya untuk tujuan konsumsi, karena dikhawatirkan akan menyebabkan kelangkaannya. Dan bila bukan karena (alasan ini), maka sebetulnya terdapat riwayat dalam ash-shahihin, bahwasannya Nabi mengizinkan (mengonsumsi) daging daging kuda. “dan Dia menciptakan apa yang kamu tidak ketahui” yang muncul setelah al qur’an turun, berupa jenis jenis alat transportasi yang dikendarai manusia di daratan, lautan, dan udara, dan mereka mempergunakannya untuk kepentingan kepentingan dan kemaslahatan mereka. Sesungguhnya jenis jenis alat transportasi itu belum disebutkan oleh Allah satu persatu. Sebab, Allah hanya mengungkapkan dalam kitabNya hal hal yang diketahui oleh para hambaNya atau mereka mengerti obyek yang serupa dengannya. Tentang obyek yang tidak ada padanannya, maka bila disampaikan, niscaya mereka tidak mengenalnya dan tidak memahami maksud yang terkandung di dalamnya. maka Allah menyebutkan satu kaidah dasar yang menyeluruh sehingga tercakup di dalamnya segala yang mereka ketahui dan yang tidak mereka ketahui. Sebagaimana Allah menyebutkan kenikmatan di surga. Dia menyebutkan –dari surge- hal hal yang kita ketahui dan dapat menyaksikan obyek yang serupa dengannya, seperti pohon kurma, anggur dan delima. Dan Dia menyebutkan secara global obyek obyek yang kita tidak mengenal padanannya. ”diadalam kedua surga itu terdapat segala macam buah buahan yang berpasang pasangan” Begitu pula disini, Allah memerinci aneka tunggangan yang kita mengenalnya, seperti kuda, bagal, keledai, dan unta serta kapal laut. dan Dia menyebutkan (alat transportasi lain) secara global dalam firmanNYa “dan Dia menciptakan sesuatu yang kamu tidak ketahui”"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (وَيَخۡلُقُ مَا لَا تَعۡلَمُونَ) wa yakhluqu maa laa ta’lamuun : “dan Dia menciptakan apa yang tidak kalian ketahui.” Berupa hewan-hewan, termasuk mobil, pesawat, dan kereta. Makna ayat: Konteks ayat ini masih menjelaskan penegasan tauhid dengan menyebutkan tanda-tanda kekuasaan Allah, ilmu, hikmah, dan kasih sayang-Nya, sebagaimana Firman-Nya “dan Dia menciptakan kuda, bagal, dan keledai” Allah telah menciptakannya, Dia-lah pencipta segala sesuatu, agar mereka bisa mengendarainya. Sebagaimana Firman-Nya “untuk kamu tunggangi dan sebagai perhiasan.” Agar ia bisa menjadi perhiasan bagi kalian dalam kehidupan. Firman-Nya “Allah menciptakan apa yang tidak kamu ketahui.” Segala sesuatu yang bisa kalian tunggangi atau tidak berupa makhluk-makhluk yang hebat, contoh yang bisa ditunggangi: mobil dengan berbagai jenis dan modelnya, pesawat, dan kereta-kereta yang cepat serta pelan. Ini semua merupakan karunia dan kenikmatan dari-Nya kepada hamba-hamba-Nya, oleh karena itu, apakah pantas bagi mereka untuk kufur dan menyekutukan-Nya? Apakah pantas bagi mereka untuk menyekutukan-Nya dalam perkara ibadah? Pelajaran dari ayat: • Kuda, bighal, dan keledai diciptakan untuk dikendarai dan sebagai perhiasan, namun itu tidak menghilangkan manfaat lain seperti: mengkonsumsi daging kuda, sebagai mana yang tertera dalam hadits, yang menunjukkan bolehnya memakan daging kuda, dan melarang memakan daging bighal dan keledai, sebagaimana yang tertera pada ash-shahihain."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 8: Bagal yaitu anak dari perkawinan kuda dengan keledai. Tidak disebutkan “untuk dimakan” karena bagal dan keledai negeri haram dimakan, adapun kuda diizinkan oleh Nabi shallallahu 'alaihi wa sallam untuk dimakan. Berupa menciptakan sesuatu yang menarik dan ajaib. Tidak disebutkan contohnya oleh Allah Subhaanahu wa Ta'aala, karena Dia tidaklah menyebutkan di dalam kitab-Nya selain sesuatu yang diketahui hamba-hamba-Nya atau yang serupa dengannya, karena jika tidak begitu hamba-hamba-Nya tidak akan tahu dan tidak akan memahami maksudnya, Dia menyebutkan asal (dasar) yang mencakup apa yang mereka ketahui dan yang tidak mereka ketahui. Misalnya menyebutkan kenikmatan surga, disebutkan di antaranya yang kita ketahui dan yang kita saksikan persamaannya, seperti pohon kurma, anggur dan delima, sedangkan yang tidak kita ketahui, Dia menyebutkan secara garis besar, seperti dalam firman-Nya, “Di dalam kedua surga itu terdapat aneka buah-buahan yang berpasang-pasangan.” (terj. Ar Rahman: 52)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 8",
    "description": "Dan dia telah pula menciptakan untuk kalian kuda, bagal (yaitu binatang hasil perkawinan antara kuda dengan keledai), dan keledai. Itu semua diciptakan Allah untuk kamu tunggangi dan menjadi perhiasan. Allah menciptakan untuk kalian apa yang kamu ketahui dan apa yang tidak kamu ketahui pada saat ini namun kelak akan kamu ketahui manfaat dan kegunaannya. Usai menjelaskan tanda-tanda yang menunjukkan betapa dia maha pencipta dan mahakuasa, Allah lalu beralih menjelaskan bahwa dia juga maha memberi petunjuk ke jalan yang benar. Karena itu, dialah yang patut disembah, dan menjadi hak bagi Allah yang maha mengetahui dan memberi petunjuk untuk menerangkan jalan yang lurus, yakni keimanan yang harus diikuti oleh manusia untuk membawa mereka menuju kebahagiaan di dunia dan akhirat. Dan menjadi hak Allah pula untuk menerangkan bahwa di antaranya ada jalan yang menyimpang, berkelok, dan berliku, yakni kekufuran, yang harus dijauhi karena menjerumuskan manusia ke jurang kesengsaraan di dunia dan akhirat. Dan jika dia menghendaki untuk menjadikan semua manusia menempuh jalan yang lurus, maka tidak ada halangan bagi-Nya untuk melakukan hal itu karena Allah mahakuasa, dan dalam keadaan demikian tentu dia memberi petunjuk kamu semua ke jalan yang lurus tersebut."
  }
]