[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Allah menjadikan bagi kalian melalui rumah-rumah kalian ketenangan dan ketentraman bersama keluarga kalian, ketika kalian tengah bermukim di kampung halaman sendiri, dan Dia juga menjadikan bagi kalian dalam safar kalian kemah-kemah dan tenda-tenda tinggi dari bahan kulit-kulit binatang ternak, yang ringan bagi kalian untuk mengangkutnya ketika kalian berpindah tempat, dan ringan bagi kalian untuk mendirikannya ketika kalian memutuskan tinggal di suatu tempat setelah berpindah dari satu tempat ke temapt lain. Dan Dia juga menjadikan bagi kalian dari bulu-bulu domba, kulit-kulit unta dan kulit-kulit kambing perabotan yang kalian gunakan berupa kain-kain, pakaian-pakaian dan penutup-penutup, hamparan tikar, hiasan yang kalian nikmati hingga ajal dan waktu tertentu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "80. Allah -Subḥānahu- menjadikan rumah-rumah yang kalian bangun dari batu dan lainnya sebagai tempat tinggal dan istirahat. Allah menjadikan untuk kalian dari kulit unta, sapi dan domba tenda-tenda dan kubah-kubah di pedalaman seperti rumah-rumah di kota-kota, mudah bagi kalian membawa tenda-tenda tersebut saat kalian harus pergi dan pindah dari satu tempat ke tempat lainnya. Allah menjadikan dari bulu domba, bulu unta dan bulu kambing peralatan untuk rumah kalian, selimut dan pakaian yang kalian pakai untuk masa tertentu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "80. Allah menyampaikan kenikmatan-kenikmatan yang telah Dia berikan kepada hamba-hamba-Nya, berupa ketenangan mereka dalam tempat tinggal mereka. Dan Allah menciptakan bagi kalian kemah-kemah yang terbuat dari kulit hewan-hewan ternak yang ringan sehingga mudah untuk kalian bawa dalam perjalanan dan mudah didirikan ketika kalian pakai. Dan Allah menciptakan bagi kalian karpet, pakaian, kain penutup, dan perlengkapan lainnya dari bulu domba dan unta serta dari rambut kambing. Barang-barang ini dapat kalian manfaatkan hingga rusak atau sampai kalian meninggal."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "80. وَاللهُ جَعَلَ لَكُم مِّنۢ بُيُوتِكُمْ سَكَنًا (Dan Allah menjadikan bagimu rumah-rumahmu sebagai tempat tinggal) Agar kalian tinggal di dalamnya dan diri kalian dapat beristirahat dari kegiatan. وَجَعَلَ لَكُم مِّن جُلُودِ الْأَنْعٰمِ بُيُوتًا(dan Dia menjadikan bagi kamu rumah-rumah (kemah-kemah) dari kulit binatang ternak) Yakni rumah-rumah bagi orang badui dan orang yang bepergian seperti kemah dan kubah. تَسْتَخِفُّونَهَا(yang kamu merasa ringan (membawa)nya) Yakni ringan bagi kalian untuk membawanya pada saat bepergian dan lainnya. يَوْمَ ظَعْنِكُمْ(di waktu kamu berjalan) Makna (الظعن) yakni perjalanan kaum badui untuk berpindah dari satu tempat ke tempat lain. وَمِنْ أَصْوَافِهَا وَأَوْبَارِهَا وَأَشْعَارِهَآ أَثٰثًا (dan (dijadikan-Nya pula) dari bulu domba, bulu unta dan bulu kambing, alat-alat rumah tangga) Makna (الأصواف) yakni bulu domba, (الأوبار) yakni bulu unta, (الأشعار) yakni bulu kambing, (الأثاث) yakni perlengkapan rumah tangga, dan (المتاع) yakni apa yang dihamparkan di dalam rumah untuk hiasan dan diambil manfaatnya. وَمَتٰعًا إِلَىٰ حِينٍ(dan perhiasan (yang kamu pakai) sampai waktu (tertentu)) Sampai habis kebutuhan kalian darinya. Atau sampai barang itu rusak."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "80-81 Allah ta'ala berfirman : { وَاللَّهُ جَعَلَ لَكُمْ مِنْ بُيُوتِكُمْ سَكَنًا } , dan di ayat setelahnya : { وَاللَّهُ جَعَلَ لَكُمْ مِمَّا خَلَقَ ظِلَالًا وَجَعَلَ لَكُمْ مِنَ الْجِبَالِ أَكْنَانًا وَجَعَلَ لَكُمْ سَرَابِيلَ تَقِيكُمُ الْحَرَّ وَسَرَابِيلَ تَقِيكُمْ بَأْسَكُمْ ۚ كَذَٰلِكَ يُتِمُّ نِعْمَتَهُ عَلَيْكُمْ لَعَلَّكُمْ تُسْلِمُونَ } Allah mengumpulkan dalam ayat-ayat an-Nahl antara tempat tinggla dan pakaian' karena tempat tinggal merupakan satu kesatuan dengan bakaian, keduanya dijadkan sebagai wasilah untuk melindungi diri, dan menolak keburukan, sebagaimana Allah menciptakan minuman dan makanan sebgai pemberi kekuatan, intinya adalah bahwasanya pakaian sebagai pelindung bagi manusia dar cuaca dingin dan panas, dan juga sebagai pelindung dari serangan musuh, sedangkan tempat tinggal sebagai pelindung dari cuaca dingin dan panas, dan juga sebagai tempat persembunyian dari serangan musuh."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "80. Dan Allah menjadikan bagi kalian rumah-rumah kalian sebagai tempat yang bisa kalian tinggali. Dan menciptakan dari kulit hewan-hewan ternak itu sebagai rumah-rumah, yaitu tenda-tenda yang digunakan sebagai tempat singgah bangsa Arab di tengah padang pasir, yang mudah kalian bawa saat melakukan perjalanan atau mudah kalian bawa di saat bepergian dari satu tempat menuju tempat lain untuk berlindung dan mencari air. Kalian juga bisa mengambil wol dari domba, bulu dari onta, dan juga dari bulu kambing sebagai alas yang dibentangkan di rumah-rumah (tenda), dan bisa dinikmati dan diambil manfaatnya sebagai pakaian dan diperjual belikan sampai waktu yang sangat lama, yaitu karena kekerasan kulit itu sehingga awet sampai waktu yang lama"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah menjadikan bagi kalian rumah sebagai tempat tinggal} tempat untuk tinggal dan beristirahat {dan Dia menjadikan bagi kalian dari kulit binatang ternak sebagai rumah} tenda berbentuk kubah di padang pasir {yang kalian merasa ringan membawanya} terasa ringan bagi kalian membawanya {pada waktu perjalanan kalian} perjalanan kalian {dan bermukim} waktu tinggal kalian. Dan (dibuat) dari bulu domba} bulu domba {bulu unta} bulu unta {dan bulu kambing} bulu kambing {sebagai peralatan rumah tangga} peralatan rumah seperti permadani dan peralatan lain {serta kesenangan} kesenangan yang bisa kalian manfaatkan {sampai waktu tertentu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "80. Allah mengingatkan para hambaNya kepada nikmat nikmatNya dan mengundang mereka untuk mensyukuri dan mengakuinya, Allah berfirman ”dan Allah menjadikan bagimu rumah rumahmu sebagai tempat tinggal” di apartemen apartemen, istana istana dan tempat tinggal yang lain yang serupa yang melindungi kalian dari sengatan panas dan dingin, dan menutupi kalian, anak anak dan harta benda kalian. Di sana, kalian membuat rumah rumah dan kamar kamar. Rumah fungsinya untuk berbagai macam kepentingan dan kemaslahatan kalian. Di dalamnya kekayaan dan istri istri kalian terlindung, dan fungsi fungsi lainnya yang dapat disaksikan bersama. “dan Dia menjadikan bagimu dari kulit binatang ternak” baik dari kulit itu sendiri atau dari bulu yang tumbuh darinya, seperti bulu domba, bulu unta maupun bulu kambing “rumah rumah kemah kemah yang kamu merasa ringan (membawanya)” maksudnya membawanya sangat ringan saat kalian dalam perjalan jauh, dan ditempat tempat tinggal yang kalian tidak berniat untuk menetap disana. Maka kemah itu mampu melindungi kalian dari panas dan dingin, serta hujan, dan melindungi barang barang kalian dari air hujan. ”dan” menjadikan bagi kalian “dari bulu domba” yaitu binatang binatang ternak “bulu unta dan bulu kambing alat alat rumah tangga” ini umum, mencakup semua peralatan yang digunakan, seperti bejana, kantung kantung, kasur kasur, pakaian pakian dan lain lain. ”dan perhiasan (yang kamu pakai) sampai waktu (tertentu)” maksudnya kalian menikmatinya di kehidupan dunia ini dan meraih kemanfaatan darinya. Ini termasuk yang Allah kerahkan bagi para hambaNya untuk diproduksi dan dibuat."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (مِّنۢ بُيُوتِكُمۡ سَكَنٗا) min buyuutikum sakanaa : “dari rumah-rumah kalian tempat untuk tinggal” tempat tinggal dan menetap kalian untuk beristirahat. (مِّن جُلُودِ ٱلۡأَنۡعَٰمِ بُيُوتٗا) min juluudil an’aam buyuutaa : “rumah-rumah dari kulit hewan” kemah-kemah dan tenda. (يَوۡمَ ظَعۡنِكُمۡ) yauma zha’nikum : ketika kalian bersafar. (أَثَٰثٗا وَمَتَٰعًا إِلَىٰ حِينٖ) atsaatsaw wa maata’an ilaa hiin : “perkakas dan peralatan hingga waktu tertentu.” Seperti karpet dan keranjang, ia akan pudar warnanya, robek, dan akhirnya dibuang. Makna ayat: Firman-Nya : “Allah menjadikan rumah-rumah kalian sebagai tempat tinggal” tempat istirahat dan menetap “dan menjadikan dari kulit-kulit hewan ternak” unta, sapi, dan kambing “rumah-rumah” tenda-tenda dan kemah “yang kamu merasa ringan membawanya” mudah untuk dibawa “pada waktu kamu berpergian” ketika perjalanan dan berpindah “dan pada waktu kamu bermukim” di suatu tempat. Firman-Nya ta’ala “dan dari bulu domba, bulu unta, dan bulu kambing” Allah membuat untuk kalian dari benda-benda tersebut “alat-alat rumah tangga” seperti karpet, kasur, dan pakaian “dan kesenangan” yang kamu nikmati hingga ia hancur atau rusak."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 80: Di ayat ini dan setelahnya, Allah Subhaanahu wa Ta'aala mengingatkan kepada hamba-hamba-Nya nikmat-nikmat-Nya, mengajak mereka untuk mensyukuri-Nya dan mengakui-Nya. Yang melindungi kamu dari panas dan dingin. Seperti wadah, permadani, pakaian, keranjang, dll. Sehingga membuatnya menjadi usang. Ini semua termasuk yang ditundukkan Allah kepada hamba-hamba-Nya sehingga mereka mampu membuatnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 80",
    "description": "Setelah pada beberapa ayat sebelumnya Allah berbicara tentang burung-burung di angkasa sebagai tanda kekuasaan-Nya, pada ayatayat berikut Allah menunjukkan beberapa nikmat- nya yang langsung manusia rasakan setiap saat. Dia menyatakan, dan Allah menjadikan rumah-rumah bagimu yang kamu buat dari berbagai bahan yang telah Allah siapkan untuk itu, seperti kayu, besi, batu, dan tanah; Allah menjadikannya sebagai tempat tinggal yang memberi kamu ketenangan dari berbagai gangguan lahir dan batin. Dan selain itu, dia menjadikan bagimu rumah-rumah dalam bentuk kemah-kemah yang secara khusus terbuat dari kulit hewan ternak, seperti kulit unta, sapi, kambing, dan hewan-hewan halal lainnya, yang kamu merasa ringan dan mudah membawanya pada waktu kamu bepergian dan pada waktu kamu bermukim di tempat tertentu. Dan ingat pula bahwa Allah juga menjadikan bagi kamu dari bulu domba, bulu unta, dan bulu kambing, alat-alat rumah tangga, seperti alas lantai, tikar, wadah air dan menjadi perhiasan-perhiasan, seperti tas, sepatu, dan dompet, yang dapat memberi kesenangan bagi kalian sampai waktu tertentu. Dan di samping itu, Allah juga menjadikan tempat-tempat bernaung dan berlindung bagimu dari berbagai bahaya dan situasi yang tidak menyenangkan, yang terbuat dari apa yang telah dia ciptakan untuk kalian, seperti pepohonan yang rindang dan bangunan yang tinggi. Selain itu, dia menjadikan bagimu tempat-tempat tinggal di gunung-gunung, seperti gua, lorong, dan terowongan yang dapat kamu jadikan tempat tinggal untuk waktu yang lama atau tempat berteduh untuk sementara waktu. Dan dia menjadikan pakaian bagimu yang terbuat dari bahan lunak yang telah diciptakan-Nya, seperti kapas dan katun dari tumbuh-tumbuhan dan wol dari bulu binatang, yang semuanya dapat memeliharamu dari panas dan dingin; dan Allah juga menjadikan bagimu pakaian yang terbuat dari bahan keras, seperti baju zirah yang dapat memelihara kamu dalam peperangan. Demikianlah, Allah menyempurnakan berbagai nikmatnya kepadamu agar kamu berserah diri kepada-Nya dengan tunduk dan mematuhi aturan-Nya."
  }
]