[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Allah menjadikan bagi kalian sesuatu yang kalian berteduh dengannya berupa pepohonan dan lain-lain, dan menjadikan bagi kalian di gunung-gunung berupa lorong-lorong dan gua-gua tempat kalian berlindung di sana saat kalain butuhkan, dan menjadikan bagi kalian pakaian-pakaian dari bahan kapas, bulu domba, dan lain-lain yang melindungi kalian dari terik panas dan hawa dingin. Dan menjadikan bagi kalian dari bahan besi perangkat yang menghindarkan kalian dari tikaman dan serangan dari dalam perang-perang kalian. Sebagaimana Dia telah melimpahkan kenikmatan pada kalian dengan nikmat-nikmat ini, Dia (juga) menyempurnakan nikmatnya bagi kalain dengan menerangkan Agama yang haq, supaya kalian berserah diri kepada perintah Allah semata, dan tidak mempersekutukan sesuatu denganNya dalam beribadah kepadaNYa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "81. Allah menjadikan untuk kalian naungan pelindung panas berupa bangunan dan pepohonan. Allah menjadikan untuk kalian gua dan lorong yang bisa kalian tinggali untuk melindungi diri dari panas dan dingin serta dari musuh. Allah menjadikan untuk kalian pakaian dan baju dari kapas untuk menolak panas dan dingin dari kalian. Allah menjadikan untuk kalian baju-baju besi yang melindungi kalian dari senjata musuh dalam peperangan, sehingga senjata mereka tidak melukai tubuh kalian. Allah telah melimpahkan kenikmatan-kenikmatan kepada kalian dan akan menyempurnakannya untuk kalian, dengan harapan kalian mau tunduk kepada Allah semata dan tidak menyekutukan-Nya dengan apa pun."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "81. Dan bagian dari kenikmatan-kenikmatan-Nya, Allah menciptakan bayangan pada pegunungan dan pepohonan sehingga kalian dapat berteduh dari panas matahari. Dan menciptakan di gunung-gunung itu tempat tinggal dan benteng yang dapat kalian tinggali, serta gua-gua yang dapat melindungi kalian dari panas, dingin, dan hujan. Dan Allah menciptakan bagi kalian pakaian dari kapas dan wol untuk melindungi kalian dari panas dan dingin; dan menciptakan bagi kalian baju besi dan sejenisnya untuk melindungi kalian dari ancaman musuh-musuh kalian dalam peperangan. Sebagaimana Allah telah menciptakan berbagai kenimatan ini, Allah juga menyempurnakan kenikmatan dunia dan agama bagi kalian agar kalian mengikhlaskan diri dalam menyembah-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "81. وَاللهُ جَعَلَ لَكُم مِّمَّا خَلَقَ ظِلٰلًا (Dan Allah menjadikan bagimu tempat bernaung dari apa yang telah Dia ciptakan) Yakni hal-hal yang kalian gunakan untuk bernaung dari panas matahari. وَجَعَلَ لَكُم مِّنَ الْجِبَالِ أَكْنٰنًا(dan Dia jadikan bagimu tempat-tempat tinggal di gunung-gunung) Makna (أكنان) yakni apa yang digunakan untuk berlindung dari hawa panas. وَجَعَلَ لَكُمْ سَرٰبِيلَ(dan Dia jadikan bagimu pakaian) Yakni pakaian yang terbuat dari wol, katun, rami, dan lain sebagainya. تَقِيكُمُ الْحَرَّ(yang memeliharamu dari panas) Yakni yang melindungi kalian dari panas. Allah hanya menyebutkan panas tanpa menyebutkan dingin karena ayat ini hanya menyebutkan kenikmatan dalam perlingdungan dari panas. وَسَرٰبِيلَ تَقِيكُم بَأْسَكُمْ ۚ( dan pakaian (baju besi) yang memelihara kamu dalam peperangan) Yakni pakaian besi yang melindungi kalian dari tusukan, pukulan, dan lemparan senjata. كَذٰلِكَ يُتِمُّ نِعْمَتَهُۥ عَلَيْكُمْ(Demikianlah Allah menyempurnakan nikmat-Nya atasmu) Dengan berbagai macam kenikmatan yang disebutkan dalam ayat ini dan lainnya. لَعَلَّكُمْ تُسْلِمُونَ(agar kamu berserah diri) Karena orang yang benar-benar memikirkan kenikmatan-kenikmatan ini pasti akan masuk Islam dan mengikuti kebenaran."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "80-81 Allah ta'ala berfirman : { وَاللَّهُ جَعَلَ لَكُمْ مِنْ بُيُوتِكُمْ سَكَنًا } , dan di ayat setelahnya : { وَاللَّهُ جَعَلَ لَكُمْ مِمَّا خَلَقَ ظِلَالًا وَجَعَلَ لَكُمْ مِنَ الْجِبَالِ أَكْنَانًا وَجَعَلَ لَكُمْ سَرَابِيلَ تَقِيكُمُ الْحَرَّ وَسَرَابِيلَ تَقِيكُمْ بَأْسَكُمْ ۚ كَذَٰلِكَ يُتِمُّ نِعْمَتَهُ عَلَيْكُمْ لَعَلَّكُمْ تُسْلِمُونَ } Allah mengumpulkan dalam ayat-ayat an-Nahl antara tempat tinggla dan pakaian' karena tempat tinggal merupakan satu kesatuan dengan bakaian, keduanya dijadkan sebagai wasilah untuk melindungi diri, dan menolak keburukan, sebagaimana Allah menciptakan minuman dan makanan sebgai pemberi kekuatan, intinya adalah bahwasanya pakaian sebagai pelindung bagi manusia dar cuaca dingin dan panas, dan juga sebagai pelindung dari serangan musuh, sedangkan tempat tinggal sebagai pelindung dari cuaca dingin dan panas, dan juga sebagai tempat persembunyian dari serangan musuh."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "81. Dan Allah meciptakan untuk kalian rumah-rumah, pepohonan dan awan sebagai naungan yang bisa kalian gunakan untuk bernaung dari panasnya matahari. Dia juga menciptakan untuk kalian gunung-gunung yang di dalamnya terdapat ruang untuk tinggal, berupa goa atau lobang, atau lorong, dimana kalian bisa berlindung dari panas, dingin dan hujan. Dia juga menciptakan untuk kalian pakaian-pakaian dan baju dari wol, kapas, linen dan lain-lain, yang bisa melindungi kalian dari panas dan dingin, dan menjadi pelindung bagi kalian dari tusukan, pukulan dan lemparan ketika perang. Seperti halnya menyempurnakan nikmat-nikmat yang disebutkan di sini, Allah juga menyempurnakan nikmatNya untuk kalian di dunia dengan menciptakan sesuatu yang kalian butuhkan supaya kalian ikhlas dalam beribadah dan taat, serta supaya kalian mengesakanNya dan mengimaniNya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah menjadikan tempat bernaung} naungan yang bisa kalian gunakan untuk bernaung dari terik matahari {bagi kalian dari apa yang telah Dia ciptakan. Dia menjadikan bagi kalian tempat-tempat tertutup} tempat yang bisa digunakan untuk tinggal berupa rumah yang dipahat seperti goa-goa {di gunung-gunung. Dia menjadikan pakaian} baju dan pakaian dari bahan katun dan bahan lain {bagi kalian untuk melindungimu dari panas dan pakaian} baju besi {untuk melindungi kalian dalam peperangan kalian} peperangan kalian {Demikian Allah menyempurnakan nikmatNya kepada kalian agar kalian berserah diri} kalian berserah diri dan tunduk kepada Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "81. “dan Allah menjadikan bagimu dari sesuatu yang telah Dia ciptakan” yaitu dari makhluk makhluk ciptaanNya, tidak ada andil tangan kalian padanya “tempat berenung” seperti naungan pepohonan, gunung gunung, perbukitan dan lain lain. ”dan Dia jadikan bagimu tempat tempat tinggal di gunung gunung” yaitu gua gua yang melindungi kalian dari sengatan panas, dingin, dan hujan hujan serta para musuh “dan Dia jadikan bagimu pakaian” yaitu pakaian pakian dan baju baju “yang memeliharamu dari panas” Allah tidak menyebutkan dingin (dalam konteks ini) Karena pada ayat sudah berlalu menyebutkan bahwasanya surat ini dari permulaannya terfokuskan pada penjelasan inti inti kenikmatan Karena itu termasuk kebutuhan yang mendesak, sementara Allah telah menyebutkannya di awal surat ini dengan berfirman ”padanya ada (bulu) yang menghangatkan dan berbagai manfaat” “dan pakaian (baju besi) yang memeliharamu dalam peperangan” maksudnya baju yang menjaga kalian dari senjata saat terjadinya pertempuran dan peperangan, berupa persenjataan pakaian besi yang berantai dan lain lain. “demikianlah Allah menyempurnakan nikmatNya atasmu” dengan menyempurnakan nikmat nikmatNya pada kalian yang tidak bisa dibatasi “agar kalian” jika kalian mengingat nikmat Allah dan menyaksikaannya begitu berlimpah bagi kalian dari semua sisi “berserah diri (kepadaNya)” kepada keagunganNya, dan patuh terhadap perintahNya dan mempergunakannya dalam ketaatan kepada dzat yang memberi dan mencurahkannya. Banyaknya kenikmataan Allah termasuk faktor penyebab yang mendatangkan tambahan syukur dan pujiannya kepada Allah atas nikmat tersebut dari hamba hambaNya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (ظِلَٰلٗا وَجَعَلَ لَكُم مِّنَ ٱلۡجِبَالِ أَكۡنَٰنٗا) zhilaalaw wa minal jibaali aknaanaa : kalian berteduh dari teriknya matahari dan gua-gua gunung yang kalian tempati. (سَرَٰبِيلَ) saraabiil : pakaian yang melindungi kalian dari panas dan dingin. (سَرَٰبِيلَ تَقِيكُمُ ٱلۡحَرَّ) saraabiila taqiikum ba`sakum : baju besi yang melindungi kalian dari sabetan dan tusukkan selama berperang. (لَعَلَّكُمۡ تُسۡلِمُونَ) la’allakum tuslimuun : “Agar kalian menyerahkan diri.” Harapan agar hati dan wajah kalian tunduk kepada-Nya, lalu kalian hanya menyembah ke kepadanya Makna ayat: Firman-Nya “ Dan Allah menjadikan untuk kalian dari apa yang telah Dia ciptakan” dari sesuatu yang banyak “tempat bernaung” dari teriknya sinar matahari “Dan Dia menjadikan bagimu gunung-gunung sebagai tempat tinggal” kalian melindungi diri di sana dari hujan, dingin, atau panas. Yaitu di gua-gua dan lembah gunung. “Dan menjadikan untukmu pakaian” baju-baju “menjaga kalian dari panas” dan dingin “dan pakaian” yaitu baju zirah “yang memelihara kamu” ketika perang kalian berlindung dengannya dari tebasan pedang dan tusukan tombak. Bukankah yang telah menjadikan hal-hal ini lebih pantas untuk kalian sembah dan taati, begitulah “Dia menyempurnakan nikmat-Nya untuk kalian” sehingga Dia mengutus kepada kalian rasul-Nya dan menurunkan kepada kalian kitab-Nya untuk agar kalian menyerahkan diri (berislam). Pelajaran dari ayat: • Ayat-ayat ini tidak akan bermanfaat kecuali untuk orang-orang yang beriman, karena hati mereka hidup. Adapun orang-orang kafir, mereka berada di dalam kegelapan kekufuran, tidak melihat dan merasakan apapun dari ayat-ayat. • Tanda-tanda kekuasaan Allah, ilmu, hikmah, rahmat, dan nikmat-Nya yang dijelaskan pada empat ayat di atas. Namun, yang menakjubkan, bahwa orang-orang musyrik—mereka sama dengan orang kafir—buta, tidak melihat apapun darinya, sedangkan kebanyakan dari mereka ingkar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 81: Yang melindungi diri dari terik panas matahari. Tanpa ada tindakan dari kamu, seperti bukit, pepohonan, awan, dsb. Seperti gua di gunung yang dapat melindungi diri dari panas, dingin, hujan dan serangan musuh. Demikian pula dari dingin. Tidak disebutkan di ayat ini kata-kata “dingin” karena sebagaimana diterangkan sebelumnya, bahwa bagian pertama surah ini menerangkan ushul (pokok-pokok) nikmat, sedangkan di akhirnya pelengkap dan penyempurna kenikmatan, sedangkan perlindungan dari dingin jelas termasuk ushul nikmat. Sebagaimana Dia menciptakan semua itu. Dengan menciptakan semua yang kamu butuhkan. Yakni mentauhidkan-Nya, tunduk kepada perintah-Nya dan mengarahkan nikmat-nikmat yang diberikan-Nya untuk ketaatan kepada-Nya. Banyaknya nikmat yang diberikan seharusnya semakin menambah hamba bersyukur dan memuji-Nya, akan tetapi orang-orang zalim tidak menghendaki selain kedurhakaan. Oleh karena itu, di ayat selanjutnya, Dia berfirman, “Jika mereka berpaling…dst.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 81",
    "description": "Dan di samping itu, Allah juga menjadikan tempat-tempat bernaung dan berlindung bagimu dari berbagai bahaya dan situasi yang tidak menyenangkan, yang terbuat dari apa yang telah dia ciptakan untuk kalian, seperti pepohonan yang rindang dan bangunan yang tinggi. Selain itu, dia menjadikan bagimu tempat-tempat tinggal di gunung-gunung, seperti gua, lorong, dan terowongan yang dapat kamu jadikan tempat tinggal untuk waktu yang lama atau tempat berteduh untuk sementara waktu. Dan dia menjadikan pakaian bagimu yang terbuat dari bahan lunak yang telah diciptakan-Nya, seperti kapas dan katun dari tumbuh-tumbuhan dan wol dari bulu binatang, yang semuanya dapat memeliharamu dari panas dan dingin; dan Allah juga menjadikan bagimu pakaian yang terbuat dari bahan keras, seperti baju zirah yang dapat memelihara kamu dalam peperangan. Demikianlah, Allah menyempurnakan berbagai nikmatnya kepadamu agar kamu berserah diri kepada-Nya dengan tunduk dan mematuhi aturan-Nya. Untuk menghibur nabi Muhammad, Allah melalui ayat ini mengingatkan beliau bahwa tugasnya hanya sekadar menyampaikan dakwah. Allah berfirman, maka jika mereka berpaling dari tuntunan-tuntunan yang engkau sampaikan, maka ketahuilah bahwa sesungguhnya kewajiban yang dibebankan atasmu hanyalah menyampaikan amanat Allah dengan terang, dengan segala kemampuanmu, baik melalui lisan maupun keteladanan. Dengan begitu, pembangkangan mereka adalah tanggung jawab mereka sendiri. Engkau tidak akan sedikit pun dituntut bertanggung jawab atas penolakan mereka tersebut."
  }
]