[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian bila mereka berpaling darimu (wahai rasul), setelah menyaksikan bukti-bukti kekuasan Allah, maka janganlah kamu bersedih. TIdak ada kewajiban atasmu selain menyampaiakan dengan jelas risalah yang kamu diutus untuk mengembannya. sedangkan hidayah urusannya terserah kepada kami."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "82. Jika mereka berpaling dari iman dan menolak membenarkan apa yang kamu -wahai Rasul- bawa maka tugasmu hanyalah menyampaikan risalah yang kamu diperintahkan untuk menyampaikannya dengan jelas. Bukan tugasmu membawa mereka untuk menerima hidayah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "82-83. Hai Nabi, jika orang-orang musyrik itu berpaling dari risalahmu, maka sesungguhnya kamu telah menyampaikan dakwahmu, dan kewajibanmu hanya menyampaikannya dengan jelas; maka tetaplah beristiqamah dalam menjalankannya. Mereka mengetahui kenikmatan Allah dengan mengutusmu kepada mereka dan mengetahui berbagai kenikmatan yang telah disebutkan dalam ayat-ayat sebelumnya, namun kemudian mereka mengingkarinya; dan mayoritas mereka mati dalam keadaan kafir."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "82. فَإِن تَوَلَّوْا۟ فَإِنَّمَا عَلَيْكَ الْبَلٰغُ الْمُبِينُ (Jika mereka tetap berpaling, maka sesungguhnya kewajiban yang dibebankan atasmu (Muhammad) hanyalah menyampaikan dengan terang) Dan tidak ada kewajiban lain atasmu. Allah tidak membebanimu untuk menjadikan mereka beriman dan memasukkan keimanan ke dalam hati mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "82. Dan jika mereka menolak untuk masuk Islam, maka sesungguhnya kewajibanmu adalah menyampaikan dengan jelas apa yang diwahyukan kepadamu. Dan kamu tidak harus melakukan sesuatu selain itu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Jika mereka berpaling} berpaling {sesungguhnya kewajibanmu hanyalah sebagai penyampai yang jelas"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "82. Akan tetapi, kaum yang berbuat zhalim enggan melakukan syukur kecuali pelanggaran dan penentangan. Karena itu, Allah berfirman tentang mereka, ”jika mereka tetap berpaling” dari Allah dan dari ketaatan kepadaNya setelah diingatkan dengan kenikmatan kenikmatan serta ayat ayatNya ”maka sesungguhnya kewajiban yang dibebankan atasmu (Muhammad) hanyalah menyampaikan (amanat Allah) dengan terang” tiada ganguan apa pun atas dirimu untuk memberikan hidayah dan taufik bagi mereka. Engkau hanya di tuntut untuk menasihati, mengingatkan, memberi peringatan dan acaman."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat: Setelah penjelasan yang jelas dan peringatan yang menyentuh, Allah berfirman kepada rasul-Nya “Seandainya mereka berpaling” dari apa yang telah disebutkan, maka janganlah bersedih dan berberat hati, karena engkau tidak punya kewajiban untuk memberikan mereka hidayah, “karena tugasmu hanyalah menjelaskan dengan nyata.” Dan engkau telah menyampaikan dan menjelaskannya. Sehingga setelah ini engkau tidak ada beban atau kewajiban lagi. Pelajaran dari ayat: • Tugas Rasulullah shalallahu ‘alaihi wa sallam bukan memberikan hidayah kepada hati, namun hanya sebagai penjelas jalan dengan penyampaian yang nyata."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 82: Dari masuk ke dalam Islam, atau dari Allah, dari menaati-Nya setelah disebutkan nikmat-nikmat dan ayat-ayat-Nya. Maksudnya, Nabi Muhammad shallallahu 'alaihi wa sallam tidak dapat memberi taufiq untuk mengikuti hidayah kepada seseorang sehingga dia beriman. Menurut penyusun tafsir Al Jalaalain, ayat ini sebelum turun perintah memerangi orang-orang kafir."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 82",
    "description": "Untuk menghibur nabi Muhammad, Allah melalui ayat ini mengingatkan beliau bahwa tugasnya hanya sekadar menyampaikan dakwah. Allah berfirman, maka jika mereka berpaling dari tuntunan-tuntunan yang engkau sampaikan, maka ketahuilah bahwa sesungguhnya kewajiban yang dibebankan atasmu hanyalah menyampaikan amanat Allah dengan terang, dengan segala kemampuanmu, baik melalui lisan maupun keteladanan. Dengan begitu, pembangkangan mereka adalah tanggung jawab mereka sendiri. Engkau tidak akan sedikit pun dituntut bertanggung jawab atas penolakan mereka tersebut. Ketahuilah, wahai nabi Muhammad, bahwa tuntunan yang kausampaikan kepada mereka sudah amat jelas. Mereka sendiri yang eng-gan mengikuti tuntunanmu itu. Mereka mengetahui bahwa semua nikmat yang mereka dapatkan bersumber dari Allah dan mereka mengakui itu hanya dengan lisan mereka, kemudian mereka mengingkarinya dengan sikap, tingkah laku, dan keyakinan mereka yang sesat. Dan kebanyakan mereka adalah orang yang ingkar kepada Allah atas segala nikmat-Nya dan abai terhadap tuntunan-Nya."
  }
]