[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang musyrik mengetahui nikmat Allah bagi mereka dengan diutusnya Muhammad kepada mereka. Kemudian mereka mengingkari kenabiannya. Dan kebanyakan dari kaumnya adalah orang-orang yang mengingkarinya, tidak mengakui kebenarannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "83. Orang-orang musyrik mengetahui nikmat-nikmat Allah yang Dia berikan kepada mereka, di antaranya adalah Dia utus Nabi kepada mereka, kemudian mereka mengingkari nikmat-nikmat Allah dengan tidak mensyukurinya dan dengan mendustakan Rasulullah -ṣallallāhu 'alaihi wa sallam-. Memang kebanyakan dari mereka adalah orang-orang yang mengingkari nikmat-nikmat Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "83. يَعْرِفُونَ نِعْمَتَ اللهِ ثُمَّ يُنكِرُونَهَا (Mereka mengetahui nikmat Allah, kemudian mereka mengingkarinya) Mereka mengingkarinya dengan perbuatan buruk mereka yaitu dengan menyembah selain Allah; dan dengan perkataan mereka yang batil bahwa berhala-berhala tersebut dapat memberi syafaat dan mereka mendapatkan segala kenikmatan dari warisan nenek moyang mereka serta mereka memakai kenikmatan ini untuk mencari keridhaan Allah. وَأَكْثَرُهُمُ الْكٰفِرُونَ(dan kebanyakan mereka adalah orang-orang yang kafir) Yakni orang-orang yang mengingkari kenikmatan-kenikmatan dari Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "83. Orang-orang kafir dan musyrik itu mengetahui nikmat Allah yaitu pengutusan Rasulullah Muhammad SAW, kemudian mereka mengingkari kenabiannya karena kebodohan dan kekerasan mereka dalam perkataan dan perbuatan, yang mana mereka menganggap bahwa pertolongan itu miliknya (berhala) dan mereka menyembahnya. Dan kebanyakan mereka itu menolak dan menentang. Ayat ini turun untuk orang Arab yang mendatangi Nabi SAW, lalu Nabi membacakan untuknya ayat-ayat sebelumnya [ayat 80-81]. Kemudian dia berkata “Benar” lalu berpaling, pergi, dan tidak jadi masuk Islam"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka mengetahui nikmat Allah, kemudian mengingkarinya} menyangkalnya {dan kebanyakan mereka adalah orang-orang kafir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "83. apabila engkau menjalankan kewajibanmu maka kamu tidak berdosa, lalu perhitungan untuk mereka adalah menjadi urusan Allah, padahal mereka itu menyaksikan curahan kebaikan dan mengetahui kenikmatan Allah, akan tetapi mereka mengingkari dan menampik (pengakuan)nya ”dan kebanyakan mereka adalah orang orang yang kafir” tidak ada kebaikan pada mereka, tanda tanda kebesaran Allah yang datang bergantian tidak bermanfaat bagi mereka, lantaran rusaknya perasaan mereka dan buruknya niatan mereka. Mereka akan menghadapi balasan Allah bagi setiap orang yang sombong, sangat keras kepala dan sangat mengingkari nikmat nikmatNya serta menentang Allah dan para RasulNya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat: Firman-Nya ”Mereka mengetahui nikmat Allah” nikmat Allah atas mereka sebagaimana yang telah dijelaskan sebelumnya, “kemudian mereka mengingkarinya” lalu mereka menyembah kepada selain Yang Memberikan Nikmat (Allah), “dan kebanyakan dari mereka adalah orang yang ingkar” yaitu mengingkari dan mendustakan kenabianmu, risalahmu, dan Islam yang engkau bawa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 83: Bahwa nikmat-nikmat yang mereka peroleh itu berasal dari-Nya. Dengan berbuat syirk kepada-Nya. Syaikh Muhammad bin ‘Abdul Wahhab menyebutkan tentang tafsir ayat di atas di kitab Tauhidnya sebagai berikut: Dalam menafsiri ayat di atas Mujahid mengatakan bahwa maksudnya adalah kata-kata seseroang, “Ini adalah harta kekayaan yang aku warisi dari nenek moyangku.” Aun bin Abdullah mengatakan, “Yakni perkataan mereka ‘kalau bukan karena fulan, tentu tidak akan menjadi begini.” Ibnu Qutaibah berkata menafsiri ayat di atas: “Mereka mengatakan, ‘ini adalah sebab syafaat sesembahan-sesembahan kami.” Abul Abbas (Syaikhul Islam Ibnu Taimiyah) - setelah menyebutkan hadits yang diriwayatkan oleh Zaid bin Kholid yang di dalamnya terdapat sabda Nabi, “Sesungguhnya Allah berfirman, “Pagi ini sebagian hambaku ada yang beriman kepada-Ku dan ada yang kufur …, sebagaimana yang telah disebutkan sebelumnya ia mengatakan, “Hal ini banyak terdapat dalam Al Qur’an maupun As Sunnah, Allah Subhaanahu wa Ta'aala mencela orang yang menyekutukan-Nya dengan menisbatkan nikmat yang telah diberikan kepada selain-Nya.” Sebagian ulama salaf mengatakan, “Yaitu seperti ucapan mereka, “Anginnya bagus, nahkodanya cerdik pandai, dan sebagainya, yang biasa muncul dari ucapan banyak orang.” Tidak ada kebaikan dalam diri mereka, dan pengulangan ayat-ayat-Nya tidaklah bermanfaat bagi mereka, karena sudah rusaknya perasaan dan tujuan mereka. Kelak mereka akan melihat balasan Allah terhadap orang yang sombong lagi keras, kufur nikmat lagi dirhaka kepada Allah dan Rasul-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 83",
    "description": "Ketahuilah, wahai nabi Muhammad, bahwa tuntunan yang kausampaikan kepada mereka sudah amat jelas. Mereka sendiri yang eng-gan mengikuti tuntunanmu itu. Mereka mengetahui bahwa semua nikmat yang mereka dapatkan bersumber dari Allah dan mereka mengakui itu hanya dengan lisan mereka, kemudian mereka mengingkarinya dengan sikap, tingkah laku, dan keyakinan mereka yang sesat. Dan kebanyakan mereka adalah orang yang ingkar kepada Allah atas segala nikmat-Nya dan abai terhadap tuntunan-Nya. Setelah menjelaskan keengganan kaum kafir mengikuti tuntunan nabi Muhammad, pada ayat ini Allah memperingatkan semua orang akan apa yang dialami oleh orang-orang kafir pada suatu hari ketika mereka tidak dapat membela diri. Allah menyatakan, dan ingatkanlah semua orang, wahai nabi Muhammad, pada suatu hari ketika kami bangkitkan seorang saksi, yakni rasul, yang dipilih dari setiap umat untuk memberi kesaksian terhadap apa yang telah orang-orang kafir lakukan. Kemudian pada hari itu tidak diizinkan kepada orang yang kafir untuk membela diri dan tidak pula mereka dibolehkan memohon ampunan atas dosa-dosa yang telah mereka lakukan. Itu karena kesempatan untuk memohon ampun semasa hidup sudah mereka lewatkan."
  }
]