[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sebutkanlah kepada mereka (wahai rasul), peristiwa yang akan terjadi pada hari kiamat tatkala kami membangkitkan dari setiap umat rasulnya masing-masing sebagai saksi atas keimanan orang yang beriman dari umat itu dan kekafiran orang-orang kafir. Kemudian tidak diizinkan lagi bagi orang-orang kafir untuk mengajukan permohonan maaf atas tindakan yang muncul dari mereka dan tidak diminta dari mereka unuk membuat tuhan mereka ridha kepada mereka dengan bertaubat dan beramal shalih, karena sesungguhnya telah berlalu kesempatan utuk itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "84. Ingatlah wahai Rasul akan Hari di saat Allah membangkitkan seorang rasul dari setiap umat yang dia diutus kepada mereka, untuk bersaksi tentang keimanan orang-orang Mukmin dan kekufuran orang-orang kafir di antara mereka, kemudian sesudahnya orang-orang kafir tidak diberi kesempatan untuk beralasan dari kekufuran yang mereka jalani di dunia, mereka juga tidak dipulangkan ke dunia untuk melakukan apa yang diridai oleh Tuhan mereka, karena Akhirat adalah alam hisab bukan alam amal."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "84-85. Allah mengingatkan perkara hari kiamat, ketika setiap umat didatangkan nabi mereka untuk menjadi saksi atas keimanan dan kekafiran mereka; dan orang-orang kafir tidak diizinkan untuk menyampaikan alasan atas apa yang telah mereka lakukan dan mereka tidak diminta untuk meminta maaf kepada Tuhan mereka. Dan ketika mereka melihat azab neraka di akhirat, azab itu sama sekali tidak diringankan dan tidak diakhirkan bagi mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "84. وَيَوْمَ نَبْعَثُ مِن كُلِّ أُمَّةٍ شَهِيدًا (Dan (ingatlah) akan hari (ketika) Kami bangkitkan dari tiap-tiap umat seorang saksi) Dan saksi bagi setiap umat adalah nabi mereka; bersaksi bagi mereka dalam keimanan dan bersaksi atas mereka dalam kekafiran dan kedustaan mereka. Hal ini terjadi di hari kiamat. ثُمَّ لَا يُؤْذَنُ لِلَّذِينَ كَفَرُوا۟( kemudian tidak diizinkan kepada orang-orang yang kafir) Untuk mengajukan uzur dan alasan. Atau untuk kembali ke kehidupan dunia. وَلَا هُمْ يُسْتَعْتَبُونَ(dan tidak (pula) mereka dibolehkan meminta teguran) Sebab teguran hanya bagi orang yang diharapkan dapat kembali kepada hal yang diridhai; adapun orang yang telah dimurkai maka tidak ada lagi manfaat dari teguran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "84. Dan ingatlah wahai Rasulullah ketika Kami membangkitkan dari setiap kumpulan itu seorang saksi bagi mereka, yaitu nabi mereka yang bersaksi untuk orang yang beriman dan untuk orang yang kafir dengan kekufuran, penolakan dan pendustaannya, kemudian orang-orang kafir itu tidak diperbolehkan untuk membela diri dan tidak pula keluhan mereka itu diterima, yaitu dengan menghilangkan sebab-sebab terjadinya keluhan itu dan kembali kepada apa yang diridhai Allah dengan kembali berharap agar bisa kembali ke dunia."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Hari (ketika) Kami mengutus seorang saksi dari setiap umat} seorang rasul yang bersaksi untuk umatnya terkait jawaban mereka terhadap apa yang telah dia sampaikan tentang Allah {Kemudian orang-orang yang ingkar tidak diizinkan} tidak diperbolehkan bagi orang-orang kafir untuk beralasan {dan tidak dibolehkan meminta maaf} dan mereka tidak diminta untuk membuat ridha Tuhan mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "84-85. Allah mengabarkan mengenai kondisi orang orang kafir di hari kiamat, dan bahwa dalih alasan tidak diterima dari mereka dan tidak (pula) dihilangkan hukuman dari mereka, para sekutu mereka berlepas diri dari mereka (para penyembahnya) dan mengakui bahwa mereka berbuat kekufuran dan mengadakan kedustaan kepada Allah, Allah berfirman ”dan (ingatlah) akan hari ketika kami bangkitkan dari tiap tiap umat seorang saksi (rasul)” yang akan bersaksi atas mereka terhadap amal perbuatan manusia, dan apakah jawaban yang mereka sampaikan terhadap pada penyeru kepada hidayah. saksi yang Allah yang Allah bangkitkan adalah saksi terbersih dan adil. mereka itu adalah para rasul yang bila telah mengeluarkan persaksian mereka. Maka jatuhlah keputuan atas orang orang kafir tersebut. “kemudian tidak diizinkan kepada orang orang yang kafir” untuk mengajukan alasan. Sebab pengajuan alasan pasca mereka mengetahui kebatilan keyakinan yang mereka pegangi, merupakan alasan yang dusta, tiada berguna bagi mereka sama sekali. Seandainya mereka meminta untuk (diberi kesempatan) kembali ke dunia lagi, untuk mengoreksi diri, niscaya tidak akan dikabulkan dan tidak diberi masa penundaan. Akan tetapi, siksa yang dahsyat akan segera menghampiri mereka, tidak diringankan atas mereka, tanpa ada masa penungguan maupun penangguhan sejak pertama kali mereka melihat siksa itu. Karena mereka tidak mempunyai kebaikan. Amal perbuatan buruk mereka akan dihitung. Mereka disuruh berdiri mempertanggung jawabkan amalan amalannya, (disebutkan satu persatu) agar mereka dibuat mengakuinya lalu dipermalukan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (وَيَوۡمَ نَبۡعَثُ) wa yauma nab’atsu : “pada hari Kami membangkitkan” yaitu ingatlah pada hari Kami membangkitkan. (شَهِيدٗا) syahiidaa : “saksi” yaitu Nabi umat tersebut. (لَا يُؤۡذَنُ لِلَّذِينَ كَفَرُواْ) laa yu`dzanu lilladziina kafaruu : “tidak diizinkan untuk orang kafir” untuk memohon ampun, lalu mereka diampuni. (وَلَا هُمۡ يُسۡتَعۡتَبُونَ) wa laahum yusta’tabuun : “dan tidak pula mereka diringankan.” Mereka tidak diperbolehkan untuk kembali dan menyakini, berkata, dan beramal apa yang Allah ridhoi. Makna ayat: Konteks enam ayat berikut hanya membahas penegasan kebangkitan, pembalasan, dan kenabian. Firman-Nya “pada hari Kami membangkitkan” ingatlah wahai Rasul Kami Muhammad shalallahu ‘alaihi wa sallam hari Kami membangkitkan “dari setiap umat” “saksi” yaitu nabi yang telah diutus kepada umat tersebut “kemudian tidak diizinkan untuk orang-orang kafir” untuk meminta ampun, sehingga mereka diampuni “tidak pula mereka diminta membela diri” mereka tidak diminta untuk kembali kepada keyakinan, perkataan, dan perbuatan yang Allah ridhai, ingatkanlah ini kepada kaummu, semoga mereka ingat lalu mengambil pelajaran darinya, bertaubat sehingga mereka selamat dan berbahagia. Pelajaran dari ayat: • Penegasan keyakinan kebangkitan akhir tanpa tambahan penjelasan, karena berbagai macam kejadian yang akan terjadi di masa itu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 84: Di ayat ini dan setelahnya, Allah Subhaanahu wa Ta'aala menerangkan keadaan orang-orang kafir pada hari kiamat, dan bahwa Dia tidak akan menerima uzur mereka serta tidak akan mengangkat siksa dari mereka, dan bahwa para sekutu mereka akan berlepas diri dari mereka, dan mereka akan mengakui kekafiran mereka kepada Allah serta berdusta atas nama-Nya. Rasul akan menjadi saksi pada hari kiamat terhadap kebaikan dan keburukan umatnya, serta apa sikap yang mereka lakukan terhadap seruan rasul."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 84",
    "description": "Setelah menjelaskan keengganan kaum kafir mengikuti tuntunan nabi Muhammad, pada ayat ini Allah memperingatkan semua orang akan apa yang dialami oleh orang-orang kafir pada suatu hari ketika mereka tidak dapat membela diri. Allah menyatakan, dan ingatkanlah semua orang, wahai nabi Muhammad, pada suatu hari ketika kami bangkitkan seorang saksi, yakni rasul, yang dipilih dari setiap umat untuk memberi kesaksian terhadap apa yang telah orang-orang kafir lakukan. Kemudian pada hari itu tidak diizinkan kepada orang yang kafir untuk membela diri dan tidak pula mereka dibolehkan memohon ampunan atas dosa-dosa yang telah mereka lakukan. Itu karena kesempatan untuk memohon ampun semasa hidup sudah mereka lewatkan. Dan apabila orang zalim dengan berbuat syirik dan kufur semasa di dunia ini telah menyaksikan tempat azab dan siksaan yang telah Allah siapkan bagi mereka di akhirat, maka mereka merasa ketakutan dan menyesali keingkaran yang telah mereka lakukan. Dalam keadaan demikian, mereka tidak mendapat keringanan sedikit pun dari azab tersebut, dan tidak pula diberi penangguhan."
  }
]