[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apabila orang-orang kafir telah menyaksikan siksaan Allah di akhirat, maka tidak diringankan bagi mereka dari siksaan itu sedikitpun, dan mereka tidak diberi penangguhan serta tidak di tunda lagi siksaan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "85. Dan apabila orang-orang zalim musyrikin itu menyaksikan azab, maka azab tidak diringankan dari mereka, tidak juga mereka ditangguhkan dari azab yang ditetapkan atas mereka, sebaliknya mereka memasukinya, kekal di dalamnya selama-lamanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "85. وَإِذَا رَءَا الَّذِينَ ظَلَمُوا۟ الْعَذَابَ (Dan apabila orang-orang zalim telah menyaksikan azab) Yakni azab neraka jahannam, akibat perbuatan syirik mereka. فَلَا يُخَفَّفُ (maka tidaklah diringankan bagi mereka) Azab itu. وَلَا هُمْ يُنظَرُونَ (dan tidak puIa mereka diberi tangguh) Dan mereka tidak ditangguhkan agar dapat bertaubat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "85. Dan ketika orang-orang kafir itu melihat azab pada hari kiamat, niscaya azab itu tidak akan menjadi ringan dengan pembelaan mereka. Dan mereka itu tidak akan diperlambat atau ditunda (untuk menerimanya) ketika sudah melihatnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apabila orang-orang yang zalim} orang-orang musyrik {telah menyaksikan azab, maka tidak akan diringankan bagi mereka dan tidak pula diberi penangguhan} ditangguhkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "84-85. Allah mengabarkan mengenai kondisi orang orang kafir di hari kiamat, dan bahwa dalih alasan tidak diterima dari mereka dan tidak (pula) dihilangkan hukuman dari mereka, para sekutu mereka berlepas diri dari mereka (para penyembahnya) dan mengakui bahwa mereka berbuat kekufuran dan mengadakan kedustaan kepada Allah, Allah berfirman ”dan (ingatlah) akan hari ketika kami bangkitkan dari tiap tiap umat seorang saksi (rasul)” yang akan bersaksi atas mereka terhadap amal perbuatan manusia, dan apakah jawaban yang mereka sampaikan terhadap pada penyeru kepada hidayah. saksi yang Allah yang Allah bangkitkan adalah saksi terbersih dan adil. mereka itu adalah para rasul yang bila telah mengeluarkan persaksian mereka. Maka jatuhlah keputuan atas orang orang kafir tersebut. “kemudian tidak diizinkan kepada orang orang yang kafir” untuk mengajukan alasan. Sebab pengajuan alasan pasca mereka mengetahui kebatilan keyakinan yang mereka pegangi, merupakan alasan yang dusta, tiada berguna bagi mereka sama sekali. Seandainya mereka meminta untuk (diberi kesempatan) kembali ke dunia lagi, untuk mengoreksi diri, niscaya tidak akan dikabulkan dan tidak diberi masa penundaan. Akan tetapi, siksa yang dahsyat akan segera menghampiri mereka, tidak diringankan atas mereka, tanpa ada masa penungguan maupun penangguhan sejak pertama kali mereka melihat siksa itu. Karena mereka tidak mempunyai kebaikan. Amal perbuatan buruk mereka akan dihitung. Mereka disuruh berdiri mempertanggung jawabkan amalan amalannya, (disebutkan satu persatu) agar mereka dibuat mengakuinya lalu dipermalukan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat: Pada firman-Nya di ayat yang kedua “dan ketika orang-orang yang zalim melihat adzab” yaitu pada hari kiamat “maka mereka tidak diringankan adzabnya dan tidak pula ditangguhkan” diundur. Ingatkanlah ini dengan sebenar-benarnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 85: Apabila telah melihatnya. Mereka tidak butuh dihisab, karena mereka tidak memiliki kebaikan, bahkan amal mereka akan dijumlahkan, lalu dihadapkan kepada mereka dan mereka mengakuinya, lalu dipermalukan di hadapan yang lain."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 85",
    "description": "Dan apabila orang zalim dengan berbuat syirik dan kufur semasa di dunia ini telah menyaksikan tempat azab dan siksaan yang telah Allah siapkan bagi mereka di akhirat, maka mereka merasa ketakutan dan menyesali keingkaran yang telah mereka lakukan. Dalam keadaan demikian, mereka tidak mendapat keringanan sedikit pun dari azab tersebut, dan tidak pula diberi penangguhan. Selain siksaan, kepada orang yang berbuat syirik juga diperlihatkan sekutu-sekutu yang mereka sembah. Dalam kaitan itu Allah menyatakan, dan apabila orang yang mempersekutukan Allah melihat sekutu-sekutu, yakni berhala atau sesembahan yang mereka persekutukan kepada Allah, mereka berkata, ya tuhan kami, mereka inilah sekutu-sekutu-Mu dalam pandangan dan sangkaan kami yang di dunia dahulu kami sembah selain engkau. Kami mengira dengan begitu mereka dapat mendekatkan kami kepada-Mu. Harapan itu ternyata tidak benar. Karena itu, ringankanlah siksa kami dan timpakanlah sebagian siksa itu kepada mereka. Mendengar ucapan tersebut, lalu sekutu mereka menyatakan dengan tegas kepada mereka, kamu benar-benar pendusta. Kamu menjadikan kami sebagai sekutu Allah, padahal kami bukanlah sekutu-Nya. Kalianlah menyembah kami atas kehendak nafsu kalian sendiri."
  }
]