[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apabila pada hari kiamat kaum musyrikin melihat tuhan-tuhan sesembahan mereka yang dahulu mereka sembah bersama Allah (didunia), mereka berkata, ”wahai tuhan kami mereka itu adalah sekutu-sekutu kami yang dahulu kami sembah selain Engkau,” maka tuhan-tuhan sesembahan itu berbicara mendustakan orang-orang yang menyembahnya, dan berkata, ”sesungguhnya kalian itu (wahai kaum musyrikin), benar-benar berbohong tatkala menjadikan kami sebagai sekutu-sekutu bagi Allah dan menyembah kami bersamaNya. Kami tidak pernah meminta kalian untuk itu, dan kami tidak pula beranggapan bahwa kami behak dipertuhankan. jadi, celaan hanya terhadap kalian saja."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "86. Dan apabila orang-orang musyrikin melihat sesembahan yang mereka sembah di dunia selain Allah, mereka berkata, “Ya Tuhan kami, mereka adalah tuhan-tuhan kami yang kami sembah selain-Mu”. Mereka berkata demikian agar Allah melimpahkan dosa-dosa mereka kepada sesembahan-sesembahan mereka. Maka Allah membuat sesembahan-sesembahan itu berkata untuk menjawab mereka, “Sesungguhnya kalian -wahai orang-orang musyrik- berdusta dalam penyembahan kalian terhadap sekutu bersama Allah, karena Allah tidak memiliki sekutu yang berhak disembah bersama-Nya.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "86-87. Ketika orang-orang musyrik melihat tuhan-tuhan mereka pada hari kiamat, mereka berkata: “Ya Tuhan kami, mereka adalah sekutu-sekutu kami yang dahulu kami sembah selain-Mu.” Maka sekutu-sekutu itu membantah mereka: “Sungguh kalian telah berdusta dengan menjadikan kami sebagai sekutu-sekutu Allah.” Kemudian orang-orang musyrik itu menampakkan ketundukan dan kepasrahan kepada Allah pada hari kiamat, dan segala kedustaan yang mereka buat di dunia berpaling dari mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "86. وَإِذَا رَءَا الَّذِينَ أَشْرَكُوا۟ شُرَكَآءَهُمْ (Dan apabila orang-orang yang mempersekutukan (Allah) melihat sekutu-sekutu mereka) Yakni melihat berhala-berhala yang mereka sembah. Sebab berhala-berhala itu akan dibangkitkan bersama orang-orang musyrik. قَالُوا۟ رَبَّنَا هٰٓؤُلَآءِ شُرَكَآؤُنَا الَّذِينَ كُنَّا نَدْعُوا۟ مِن دُونِكَ (mereka berkata: “Ya Tuhan kami mereka inilah sekutu-sekutu kami yang dahulu kami sembah selain dari Engkau”) Tujuan mereka adalah agar dosa-dosa mereka dapat ditanggung oleh berhala-berhala tersebut. فَأَلْقَوْا۟ إِلَيْهِمُ الْقَوْلَ(Lalu sekutu-sekutu mereka mengatakan kepada mereka) Yakni Allah menjadikan berhala-berhala dan setan-setan itu dapat berkata kepada orang-orang musyrik. إِنَّكُمْ لَكٰذِبُونَ(Sesungguhnya kamu benar-benar orang-orang yang dusta) Dalam perkataan kalian bahwa dosa-dosa kalian akan kami tanggung, sebaliknya dosa itu adalah dosa kalian. Pendapat lain mengatakan bahwa kedustaan mereka adalah dalam perkataan mereka bahwa berhala-berhala itu adalah sekutu-sekutu Allah, karena Allah tidak mempunyai sekutu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "86. Dan ketika orang-orang musyrik itu melihat sekutu-sekutu mereka atau sesembahan mereka, berupa berhala, patung, setan dan lain-lain pada hari kiamat, mereka akan berkata: “Itulah sekutu-sekutu yang kami sembah selain Engkau” Maksud mereka adalah ingin memindahkan dosanya kepada mereka (sesembahan) dan mengklaim bahwa mereka (orang musyrik) itu diminta untuk melakukan penyembahan itu. Lalu tuhan-tuhan yang diklaim oleh mereka itu berkata: “Sesungguhnya kalian berbohong dalam memberikan tuduhan kepada kami, Dosa itu adalah dosa kalian, dan kami tidak meminta kalian untuk menyembah kami”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apabila orang-orang musyrik melihat sekutu-sekutu mereka} tuhan-tuhan yang mereka sembah {mereka berkata,“Wahai Tuhan kami, mereka inilah sekutu-sekutu kami yang dahulu kami sembah selain Engkau” Lalu sekutu-sekutu mereka melontarkan ucapan kepada mereka} lalu tuhan-tuhan melontarkan ucapan kepada mereka {“Sesungguhnya kalian benar-benar para pendusta”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "86. “dan apabila orang orang yang mempersektukan (Allah) melihat sekutu sekutu mereka” pada hari kiamat, dan mereka menyadari kebatilannya, tanpa mampu mengingkarinya, ”mereka berkata ‘ya Rabb kami, mereka inilah sekutu sekutu kami yang mereka dahulu kami sembah selain dariMu” Mereka itu tidak mempunyai kemanfatan dan bantuan pertolongan. Mereka mengisyaratkan pada (aspek) kebatilannya dan mengingkarinya. Mulailah benih kebencian dan permusuhan antara mereka dan sekutu sekutu itu. ”lalu sekutu sekutu mereka mengatakan kepada mereka” maksudnya para sekutu itupun membantah perkataan mereka, dan berkta kepada mereka, ”sesungguhnya kamu benar benar orang yang dusta” lantaran menjadikan kami sebagai sekutu bagi Allah dan menyembah kami bersamaNya. Kami tidak pernah menyuruh kalian untuk melakukannya, dan kamipun tidak pernah mengklaim bahwa kami atas menyandang uluhiyah. Celaan itu hanya tertuju pada kalian (saja)."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (وَإِذَا رَءَا ٱلَّذِينَ أَشۡرَكُواْ شُرَكَآءَهُمۡ) wa idzaa ra`al ladziina asyrakuu syurakaa`ahum : “dan ketika orang-orang musyrik melihat sekutu-sekutu mereka.” yaitu orang-orang yang dahulu menyembah mereka selain Allah, seperit berhala dan setan. (فَأَلۡقَوۡاْ إِلَيۡهِمُ ٱلۡقَوۡلَ) fa`alqau ilaihimul qaul : “maka mereka (sekutu-sekutu) mengatakan kepada mereka.” membalas perkataan mereka bahwa mereka adalah orang-orang yang berdusta. Makna ayat: Dan ingatkanlah mereka “ketika orang-orang musyrik melihat sekutu-sekutu mereka”pada hari kiamat atau di dalam neraka Jahanam mereka berkata “Waha Rabb kami” “merekalah sekutu-sekutu yang dahulu kami sembah selain engkau.” Kami menyembah mereka dengan berdoa dan meminta pertolongan kepada mereka. “maka mereka mengatakan kepada mereka” seketika “sungguh kalian adalah pendusta.” Pelajaran dari ayat: • Berlepasnya setan dan berhala yang dahulu manusia jadikan sekutu dalam beribadah kepada Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 86: Yang dimaksud dengan sekutu mereka di sini adalah apa yang mereka sembah selain Allah atau setan-setan yang mengajak mereka menyembah selain Allah Subhaanahu wa Ta'aala. Mereka menyebutkan kebatilannya, mengingkarinya, dan tampak kebencian dan permusuhan antara mereka dengan yang mereka sembah, seakan-akan mereka menimpakan kesalahan kepada sesembahan mereka. Yakni bukankah kamu yang menjadikan kami sebagai sekutu bagi Allah, kamu yang menyembah kami, kami tidak memerintahkan demikian, dan kami tidak menyatakan bahwa kami berhak disembah. Oleh karena itu, kamulah yang salah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 86",
    "description": "Selain siksaan, kepada orang yang berbuat syirik juga diperlihatkan sekutu-sekutu yang mereka sembah. Dalam kaitan itu Allah menyatakan, dan apabila orang yang mempersekutukan Allah melihat sekutu-sekutu, yakni berhala atau sesembahan yang mereka persekutukan kepada Allah, mereka berkata, ya tuhan kami, mereka inilah sekutu-sekutu-Mu dalam pandangan dan sangkaan kami yang di dunia dahulu kami sembah selain engkau. Kami mengira dengan begitu mereka dapat mendekatkan kami kepada-Mu. Harapan itu ternyata tidak benar. Karena itu, ringankanlah siksa kami dan timpakanlah sebagian siksa itu kepada mereka. Mendengar ucapan tersebut, lalu sekutu mereka menyatakan dengan tegas kepada mereka, kamu benar-benar pendusta. Kamu menjadikan kami sebagai sekutu Allah, padahal kami bukanlah sekutu-Nya. Kalianlah menyembah kami atas kehendak nafsu kalian sendiri. Permohonan keringanan siksa yang mereka ajukan kepada Allah menjadi sia-sia belaka. Dan pada hari itu pula mereka menyatakan tunduk dan berserah diri kepada Allah semata, dan lenyaplah segala yang mereka ada-adakan; batAllah keyakinan mereka selama di dunia bahwa sesembahan itu dapat menolong dan menyelamatkan mereka dari azab Allah."
  }
]