[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang musyrik menampakan penyerahan diri dan ketundukan kepada Allah pada hari kiamta dan sirnalah dari mereka apa yang dahulu mereka ada-adakan berupa kebohongan-kebohongan bahwa sesungguhnya sesembahan mereka dapat memberi syafaat untuk mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "87. Orang-orang musyrikin itu menyerah, mereka tunduk kepada Allah semata. Apa yang mereka dakwahkan, yaitu bahwa berhala-berhala mereka memberi syafaat di hadapan Allah lenyaplah sudah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "87. وَأَلْقَوْا۟ إِلَى اللهِ يَوْمَئِذٍ السَّلَمَ ۖ (Dan mereka menyatakan ketundukannya kepada Allah pada hari itu) Yakni tunduk dan menyerahkan diri pada azab Allah dan keperkasaan-Nya. وَضَلَّ عَنْهُم مَّا كَانُوا۟ يَفْتَرُونَ(dan hilanglah dari mereka apa yang selalu mereka ada-adakan) Yakni sirna apa yang mereka dahulu sembah, tidak dapat melakukan apapun bagi mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "87. Dan orang-orang musyrik itu menerima untuk tunduk kepada Allah dan hukumNya pada hari kiamat, mereka tunduk kepada keagunganNya. Telah hilang dan pergi dari mereka sesuatu yang mereka buat-buat, yaitu bahwa tuhan-tuhan mereka tidak memberi pertolongan dan keselamatan mereka serta tidak melindungi mereka dari azab"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Pada hari itu mereka menyatakan} orang-orang musyrik itu menyatakan {tunduk} berserah diri dan tunduk kepada perintah dan keputusanNya {kepada Allah dan lenyaplah} lenyap {dari mereka apa yang selalu mereka ada-adakan} mereka buat-buat bahwa Allah memiliki sekutu-sekutu yang bisa menyelamatkan dan memberi syafaat untuk mereka di sisiNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "87. Pada saat itulah, mereka pasrah kepada Allah, tunduk terhadap keputusanNya, meyakini bahwa mereka pantas menerima siksa “dan hilanglah dari mereka apa yang selalu mereka ada adakan” maksudnya mereka masuk neraka, dalam keadaan hati mereka tersesak kegeraman terhadap diri sendiri, dan sarat dengan pujian kepada Rabb mereka, dan bahwa Dia tidak menghukum kecuali disebabkan peruatan mereka."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (وَأَلۡقَوۡاْ إِلَى ٱللَّهِ يَوۡمَئِذٍ ٱلسَّلَمَۖ) wa `alqau ilallahi yauma`idzinis salam : “dan mereka pada hari itu menyerahkan diri kepada Allah.” Merendahkan diri kepada-Nya, tunduk kepada hukum-Nya dan menyerahkan diri. Makna ayat: “Dan mereka pada hari itu menyerahkan diri.” Mereka menyerahkan diri dan tunduk kepada ketentuan-Nya “dan hilanglah apa yang dahulu mereka ada-adakan.” Ketika mereka di dunia berupa berbagai jenis kedustaan dan rekayasa seperti perkataan mereka, bahwa mereka adalah penolong kami di sisi Allah, dan mereka akan selamat dari neraka dengan syafa’at mereka, serta mereka adalah perantara kepada Allah. Ini semua akan hilang dan tidak akan bermanfaat sama sekali."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 87: Yang mereka ada-adakan itu adalah kepercayaan, bahwa Allah Subhaanahu wa Ta'aala mempunyai sekutu-sekutu, dan bahwa sekutu-sekutu itu dapat memberi syafa'at kepada mereka di hadapan Allah Subhaanahu wa Ta'aala."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 87",
    "description": "Permohonan keringanan siksa yang mereka ajukan kepada Allah menjadi sia-sia belaka. Dan pada hari itu pula mereka menyatakan tunduk dan berserah diri kepada Allah semata, dan lenyaplah segala yang mereka ada-adakan; batAllah keyakinan mereka selama di dunia bahwa sesembahan itu dapat menolong dan menyelamatkan mereka dari azab Allah. Orang yang kafirdanmenzalimi diri sendiri dengan mempersekutukan Allah dan mengingkari dakwah para rasul, dan menzalimi orang lain dengan menghalangi mereka dari mengikuti jalan Allah, yakni jalan kebaikan dan kebenaran yang membawa mereka menuju keselamatan, kami tambahkan kepada mereka siksaan demi siksaan yang diberikan kepada orang kafir. Siksaan yang lebih itu ditimpakan kepada mereka disebabkan mereka selalu berbuat kerusakan di bumi."
  }
]