[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang yang mengingkari keesaan Allah dan kenabianmu (wahai rasul), dan mendustakan kamu dan menghalng-halangi kamu dan menghalang-halangi orang lain untuk beriman kepada Allah dan rasulNya, kami tambahkan kepada mereka siksaan akibat kekafiran mereka dan siksaan atas tindakan mereka menghalangi manusia dari mengikuti kebenaran. Siksaan demikian ini disebabkan kesengajaan mereka untuk melakukan kerusakan dan menyesatkan para hamba dengan kekafiran dan maksiat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "88. Orang-orang yang kafir kepada Allah dan memalingkan orang lain dari jalan Allah, Kami akan menambah azab atas mereka karena mereka rusak dan merusak dengan menyesatkan orang lain atas azab yang menjadi hak mereka karena kekufuran mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "88. Allah menyampaikan azab tambahan bagi orang-orang kafir; mereka akan mendapatkan azab akibat pendustaan yang mereka lakukan, dan ditambah dengan azab karena mereka telah menghalangi orang lain beriman kepada Allah, yakni akibat kerusakan yang mereka buat di dunia dengan berbagai kekafiran dan kemaksiatan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "88. الَّذِينَ كَفَرُوا۟ (Orang-orang yang kafir) Yakni diri mereka kafir. وَصَدُّوا۟( dan menghalangi) Mengahalangi orang lain. عَن سَبِيلِ اللهِ(dari jalan Allah) Yakni jalan keislaman. Mereka mengalangi orang lain yang akan melaluinya, dan menyeret mereka kepada kekafiran dengan godaan-godaan mereka, atau menyeret mereka secara paksa agar kafir kepada Allah dan memusuhi para Nabi dan kekasih-Nya. زِدْنٰهُمْ عَذَابًا فَوْقَ الْعَذَابِ(Kami tambahkan kepada mereka siksaan di atas siksaan) Allah menambah azab mereka sebab mereka menyesatkan orang lain, tambahan atas azab yang mereka dapatkan akibat kesesatan mereka sendiri."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Seorang penjahat yang kerap melakukan kejahatan dan kemungkaran tidak akan mungkin bisa bergaul dengan cara yang sama kepada orang yang tidak pernah melakukan kejahatan kecuali dengan orang macam ini : { الَّذِينَ كَفَرُوا وَصَدُّوا عَنْ سَبِيلِ اللَّهِ زِدْنَاهُمْ عَذَابًا فَوْقَ الْعَذَابِ بِمَا كَانُوا يُفْسِدُونَ } \"Orang-orang yang kafir dan menghalangi (manusia) dari jalan Allah, Kami tambahkan kepada mereka siksaan di atas siksaan disebabkan mereka selalu berbuat kerusakan\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "88. Orang-orang yang mengingkari Islam dan mencegah manusia untuk masuk Islam, maka karena pembangkangan mereka, Allah akan menambahkan untuk mereka pada hari kiamat azab melebihi azab atas kekufuran mereka, karena kerusakan yang mereka perbuat di bumi, yaitu dengan mencegah manusia untuk beriman"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Orang-orang yang ingkar dan menghalangi dari jalan Allah, Kami menambahkan kepada mereka siksaan demi siksaan karena mereka selalu berbuat kerusakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "88. Lantaran mereka sendiri berbuat kekufuran, mendustakan ayat ayat Allah dan memerangi para RasulNya serta menghalang halangi orang dari jalan Allah, dengan itu, mereka menjadi para penyeru kepada kesesatan, hingga berhak untuk menerima siksaan yang berlipat ganda sebagaimana kejahatan mereka juga bertumpuk tumpuk dan sebagaimana mereka telah melakukan kerusakan di bumi Allah."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (عَذَابٗا فَوۡقَ ٱلۡعَذَابِ) ‘adzaaban fauqal ‘adzaab : “adzab di atas adzab” kalajengking dan ular bagai pohon kurma yang tinggi, dan keledai yang besar. Makna ayat: Firman-Nya “orang-orang yang menghalangi dari jalan Allah” dengan mengajak kepada kekufuran dan segala yang sebabnya, serta memaksanya dengan iming-iming dan teror “Kami tambahkan bagi mereka azab di atas azab.” Mereka pantas mendapatkannya karena kekufuran mereka. Dijelaskan bahwa tambahan azab yang dimaksud adalah kalajengking yang seukuran keledai yang gemuk dan ular yang besar bagaikan pohon kurma—semoga Allah menyelamatkan kita dari neraka—serta berbagai jenis azab. Pelajaran dari ayat: • Tambahan azab bagi yang menyeru kepada kesyirikan dan kekufuran serta memaksa manusia untuk mengikutinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 88: Yakni dari agama-Nya. Maksudnya, mendapatkan siksaan yang berlipatganda, sebagaimana kesalahan mereka juga berlipatganda. Dengan menghalangi manusia dari beriman."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 88",
    "description": "Orang yang kafirdanmenzalimi diri sendiri dengan mempersekutukan Allah dan mengingkari dakwah para rasul, dan menzalimi orang lain dengan menghalangi mereka dari mengikuti jalan Allah, yakni jalan kebaikan dan kebenaran yang membawa mereka menuju keselamatan, kami tambahkan kepada mereka siksaan demi siksaan yang diberikan kepada orang kafir. Siksaan yang lebih itu ditimpakan kepada mereka disebabkan mereka selalu berbuat kerusakan di bumi. Dan ingatlah pada hari ketika kami bangkitkan pada setiap umat seorang saksi atas mereka, yaitu seorang nabi atau tokoh yang diakui kesalehan dan ketakwaannya, dari golongan mereka sendiri, yang memberi kesaksian dengan jujur; dan kami datangkan pula engkau, wahai nabi Muhammad, menjadi saksi atas mereka semua. Dan kami turunkan kitab Al-Qur'an kepadamu secara berangsur untuk menjelaskan kepada manusia prinsip-prinsip umum segala sesuatu, sebagai petunjuk menuju jalan kebenaran dan kedamaian, serta rahmat dan kabar gembira bagi orang yang berserah diri sepenuh hati kepada Allah."
  }
]