[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ingatlah (wahai rasul), ketika pada hari kiamat kami akan membangkitkan dari setiap umat dari umat-umat manusia seorang saksi atas mereka, yaitu rasul yang Allah utus kepada mereka yang berasal dari mereka sendiri dan berbicara dengan bahasa mereka. Dan Kami datangkan kamu (wahai rasul) sebagai saksi atas umatmu. Dan sesungguhnya Kami telah menurunkan al-qur’an kepadamu sebagai penjelas setiap perkara yang membutuhkan keterangan, seperti hukum-hukum halal dan haram, pahala dan hukuman, dan lain sebaginya, dan agar menjadi sumber hidayah dari jalan kesesatan dan rahmat bagi orang yang mengimaninya dan melaksanakannya dan kabar gembira yang baik bagi kaum mukminin tentang baiknya tempat kembali mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "89. Ingatlah -wahai Rasul- akan hari di saat Kami membangkitkan seorang Rasul pada setiap umat yang bersaksi atas mereka terhadap apa yang mereka perbuat berupa iman atau kufur. Rasul tersebut dari kalangan mereka sendiri, berbahasa dengan bahasa mereka. Dan Kami mendatangkanmu wahai Rasul sebagai saksi atas seluruh umat. Kami menurunkan Al-Qur`ān kepadamu agar kamu menjelaskan apa yang memerlukan penjelasan berupa halal dan haram, pahala dan hukuman dan selainnya. Dan Kami menurunkannya sebagai hidayah bagi manusia kepada kebenaran, rahmat bagi siapa yang beriman kepadanya dan mengamalkan kandungannya, dan sebagai berita gembira bagi orang-orang yang beriman kepada Allah dengan apa yang mereka tunggu-tunggu yaitu kenikmatan abadi."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "89. Hai Rasulullah, sampaikanlah kepada manusia, ketika pada hari kiamat Kami mendatangkan kepada seluruh umat nabi-nabi mereka agar menjadi saksi atas mereka. Dan Kami mendatangkanmu untuk menjadi saksi atas umatmu. Dan Kami menurunkan al-Qur’an kepadamu sebagai penjelasan yang jelas atas segala sesuatu yang butuh penjelasan, sebagai hidayah dari kesesatan bagi hati, rahmat bagi orang-orang beriman, dan penyampai kabar gembira berupa surga bagi orang-orang yang memeluk Islam dan mendapat petunjuk."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "89. وَيَوْمَ نَبْعَثُ فِى كُلِّ أُمَّةٍ شَهِيدًا عَلَيْهِم ((Dan ingatlah) akan hari (ketika) Kami bangkitkan pada tiap-tiap umat seorang saksi atas mereka) Yakni seorang saksi yang akan bersaksi atas mereka. مِّنْ أَنفُسِهِمْ ۖ (dari mereka sendiri) Yakni dari kaum mereka sendiri agar tidak menjadi alasan dan hujjah bagi mereka. وَجِئْنَا بِكَ (dan Kami datangkan kamu) Wahai Muhammad. شَهِيدًا عَلَىٰ هٰٓؤُلَآءِ ۚ (menjadi saksi atas seluruh umat manusia) Yakni sebagai saksi atas umat-umat tersebut dan bagi mereka. Pendapat lain mengatakan yakni saksi atas umatmu saja. Telah disebutkan ayat yang serupa pada surat al-Baqarah: 143 dan surat an-Nisa: 33. وَنَزَّلْنَا عَلَيْكَ الْكِتٰبَ (Dan Kami turunkan kepadamu Al Kitab) Yakni al-Qur’an. تِبْيٰنًا لِّكُلِّ شَىْءٍ(untuk menjelaskan segala sesuatu) Yakni didalamnya terkandung banyak penjelasan berbagai hukum, dan terkandung perintah untuk mentaati Rasulullah yang membawa syariat ini. Pendapat lain mengatakan yakni dalam al-Qur’an sendiri mengandung penjelasan seluruh hukum, yakni asas-asas hukum tersebut baik itu secara tekstual maupun kontekstual. Ibnu Jarir dan Ibnu Hatim mengeluarkan sebuah riwayat dari Ibnu Mas’ud, ia berkata: sesungguhnya Allah menurunkan al-Qur’an untuk menjelaskan segala sesuatu, namun pengetahuan kita tidak mampu menjangkau segala yang dijelaskan bagi kita dalam al-Qur’an. وَهُدًى (dan petunjuk) Bagi hamba-hamba-Nya. وَرَحْمَةً (serta rahmat) Bagi mereka. وَبُشْرَىٰ لِلْمُسْلِمِينَ(dan kabar gembira bagi orang-orang yang berserah diri) Hanya bagi orang-orang Islam, sebab merekalah orang-orang yang mendapatkan manfaat darinya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Masruq berkata : tidaklah kami bertanya kepada sahabat Rasulullah tentang satu perkara, melainkan ilmunya ada dalam al_Qur'an. 2 ). Berhenti sejenak dan tdabburi ayat in : { وَنَزَّلْنَا عَلَيْكَ الْكِتَابَ تِبْيَانًا لِكُلِّ شَيْءٍ } \"Dan Kami turunkan kepadamu Al Kitab (Al Quran) untuk menjelaskan segala sesuatu\" kemudian amatilah setiap kejadian yang berlaku dan ada kaitannya dengan ayat-ayat semacam ini, kamu akan mendapati ada kenyataan yang membenarkan ayat ini, dan seakan-akan ia baru saja diturunkan hari ini!"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "89. Ingatlah wahai Nabi, ketika Kami mengutus dari setiap umat itu seorang saksi dari golongan mereka, yaitu nabi mereka. Dan Kami mendatangkanmu wahai Rasul sebagai seorang saksi atas kaummu dan umat-umat yang tersisa, bahwa kamu telah menyampaikan risalah. Aku mengulang hal itu untuk mengancam orang-orang kafir Quraisy bahwa kesaksian itu berlaku untuk mengadili mereka bukan membenarkan mereka, dan untuk mengina mereka atas pendustaan mereka terhadal rasulallah. Dan Kami telah menurunkan kepadamu Al-Qur’an yang menjelaskan secara terperinci tentang setiap sesuatu yang dibutuhkan manusia berupa hukum-hukum agama dan syariat, petunjuk dari kesesatan, penyebab rahmat dan keberhasilan bagi orang yang beriman, dan kabar gembira tentang surga bagi orang-orang muslim yang menunaikan syariat Allah SWT."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Hari (ketika) Kami mengutus seorang saksi untuk setiap umat dari (kalangan) mereka sendiri dan Kami mendatangkan kamu sebagai saksi atas mereka. Kami menurunkan kitab} Al-Qur’an {kepadamu untuk menjelaskan} menjelaskan {segala sesuatu, sebagai petunjuk, rahmat, dan kabar gembira bagi orang-orang muslim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "89. setelah Allah menyampaikan pada keterangan sebelumnya, bahwa Dia membangkitkan seorang saksi pada setiap umat manusia, maka di sini Allah juga menyebutkan perihal tersebut. Secara khusus Allah membicarakan RasulNya yang mulia (Muhammad) Allah berfirman “dan kami datangkan kamu (Muhammad) menjadi saksi atas (seluruh) umat manusia” maksudnya atas umatmu, bersaksi atas mereka dengan kebaikan dan keburukan. Ini termasuk kesempuraan sifat keadilan Allah, bahwa setiap rasul bersaksi atas umatnya (sendiri). pasalnya, dia adalah orang yang paling mengetahui amalan perbuatan umatnya daripada rasul lainnya, dan lebih adil lagi lebih sayang untuk (tidak) bersaksi atas mereka kecuali yang sesuai dengan apa yang berhak mereka terima. Keterangan ini seperti firman Allah “dan demikian (pula) kami telah mejadikan kamu (umat islam), umat yang adil dan pilihan agar kamu menjadi saksi atas (perbuatan) manusia, dan agar Rasul (Muhammad) menjadi saksi atas (perbuatan) kamu.\" Dan Allah berfirman \"Maka bagaimanakah (halnya orang kafir nanti), apabila Kami mendatangkan seseorang saksi (rasul) dari tiap-tiap umat dan Kami mendatangkan kamu (Muhammad) sebagai saksi atas mereka itu (sebagai umatmu). Di hari itu orang-orang kafir dan orang-orang yang mendurhakai rasul, ingin supaya mereka disamaratakan dengan tanah, dan mereka tidak dapat menyembunyikan (dari Allah) sesuatu kejadianpun.\" (QS. An-Nisa : 41-42) FirmanNya ”dan kami turunkan kepadamu al-kitab (al qur’an) untuk menjelaskan segala sesuatu\" dalam perkara pokok ataupun cabang, dalam hokum-hukum di dua tempat (dunia dan akhirat) dan segala seuatu yang diperlukan oleh para hamba. Ia benar benar telah di jelaskan dengan paripurna, dengan teks-teks yang jelas dan makna makna yang terang. Bahkan Allah kerap mengulang ngulang persoalan persoalan besar yang di butuhkan oleh hati karena (sering) bersentuhan dengannya setiap saat dan bolak balik (mengerjakannya) setiap waktu, dan (dia) menyuguhkan kembali dan memperlihatkannya dengan lafazh lafazh yang berbeda beda dan bukti bukti (nyata) yang beraneka ragam, agar meresap dalam hati, sehingga membuahkan kebaikan dan kebajikan sesuai dengan konsistensinya di dalam hati. bahkan Allah juga menyatukan dalam sebuah ungkapan ringan yang jelas, maknanya banyak, sehingga lafazh tersebut berperan sebagai kaidah dan dasar. Masuk dalam kategori ini, yaitu ayat ayat yang datang setelah ayat ini, yang mengandung berbagai macam perintah dan larangan yang tudak terhitung banyaknya. Ketika Alqur’an adalah penjelas bagi segala sesuatu, maka ia menjadi hujjah Allah di hadapan para hambaNya seluruhnya, akibatnya hujjah hujjah orang orang yang berbuat aniaya terlumpuhkan. Sementara kaum muslimin mereguk kemanfaatan drainya, hingga menjadi sumber hidayah bagi mereka. menuntun dalam masalah agama dan dunia, dan sebagai rahmat yang mengantarkan mereka dapat menggapai kebaikan dunia dan akhirat. Hidayah yang mereka rengkuh berupa ilmu yang bermanfaat dan amal shalih. sedangkan bentuk rahmatnya adalah dampak (baik) dari hidayah tersebut, berupa pahala dunia dan akhirat, seperi keshalihan, kebaikan dan ketenangan hati, kematangan akal yang tidak terwujud kecuali dengan membinanya berdasarkan nilai nilainya yang merupakan nilai nilai yang paling agung dan luhur, perbuatan perbuatan yang mulia, akhlak yang utama, rizki yang lapang kemenangan atas para musuh dengan ucapan dan perbuatan, dan menggapai keridhaan Allah serta (suguhan) kemuliaanNya yang agung yang kenikmatan abadi di dalamnya tidak diketahui kecuali oleh Allah Rabb yang maha penyayang."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (وَنَزَّلۡنَا عَلَيۡكَ ٱلۡكِتَٰبَ) wa nazzalnaa ‘alaikal kitaab : “dan Kami turunkan kepadamu Al-Kitab” yaitu Al-Qur’an. (تِبۡيَٰنٗا لِّكُلِّ شَيۡءٖ) tibyaanan likulli syai` : “penjelas segala sesuatu” penjelas atas apa yang setiap umat butuhkan, seperti mengetahui yang halal dan haram, kebenaran dan kebatilan, ganjaran dan hukuman. Makna ayat: Firman-Nya “dan pada hari Kami membangkitkan” ingatlah wahai Rasul Kami, hari Kami membangkitkan “dari setiap umat” yaitu pada hari kiamat “saksi dari diri mereka sendiri, dan Kami menjadikan saksi atas mereka.” kepada siapa engkau diutus. Bayangkanlah bagaimana keadaan itu, ketika engkau bersaksi untuk ahli iman atas iman mereka, orang-orang kafir atas kekafiran mereka, dan orang-orang musyrik atas kesyirikan mereka, sungguh ini merupakan situasi yang berat, sungguh besar kerugian pada hari itu dan penyesalan semakin menjadi. Firman-Nya ketika berbicara kepada rasul-Nya seraya menegaskan kenabiannya dan wahyu yang turun kepadanya, “Dan Kami turunkan kepadamu Al-Kitab” yaitu Al-Qur’an “sebagai penjelas atas segala sesuatu” yang dibutuhkan oleh setiap umat berupa mengetahui hal yang halal dan haram, hukum, dan dalil “petunjuk” dari segala kesesatan “dan rahmat” yang khusus bagi orang-orang yang mengamalkan dan merealisasikannya pada diri dan kehidupan mereka, sehingga ia menjadi rahmat yang menyeluruh “dan kabar gembira bagi orang-orang yang menyerahkan diri.” Taat kepada perintah Allah dan larangan-Nya, kabar gembira bagi mereka dengan pahala yang besar dan ganjaran yang banyak pada hari kiamat kelak, dengan pertolongan, kemenangan, serta kemuliaan di dunia. Setelah Kami menurunkan kepadamu kitab ini, tidak tersisa lagi alasan bagi mereka yang ingin mencari alasan pada hari kiamat, sehingga kesaksianmu atas umatmu merupakan kesaksian yang paling besar, serta mempunyai pengaruh yang besar akan keselamatan mereka yang akan selamat dan kecelakaan mereka yang celaka, dan tidak ada seorangpun yang binasa di sisi Allah, kecuali ia merupakan orang yang benar-benar binasa. Pelajaran dari ayat: • Tidak ada lagi alasan setelah Allah menurunkan Al-Qur’an sebagai penjelas atas segala sesuatu, petunjuk, rahmat, dan kabar gembira bagi orang-orang yang menyerahkan diri."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 89: Yakni nabi mereka. Yakni kaummu. Beliau akan menjadi saksi terhadap umatnya; baik atau buruk sikap mereka. Hal ini termasuk keadilan Allah Subhaanahu wa Ta'aala, yakni setiap rasul menjadi saksi terhadap umatnya, karena para rasul lebih tahu daripada orang lain tentang umatnya, lebih adil dan lebih sayang; sehingga tidak mungkin rasul bersaksi melebihi yang Beliau saksikan dengan menambah-nambah atau bahkan mengurangi. Yang dibutuhkan manusia tentang urusan syari’at; baik tentang ushuluddin maupun cabangnya. Al Quran menerangkan secara jelas, dengan lafaz-lafaznya yang jelas dan maknanya yang terang, sehingga Allah Ta’ala mengulang perkara-perkara besar di dalamnya yang memang dibutuhkan hati karena biasa dilalui di setiap waktu, terulang di setiap saat, ditampilkan dengan lafaz yang berbeda-beda dan dalil yang bermacam-macam agar menancap di hati, sehingga membuahkan kebaikan yang banyak tergantuh sejauh mana hal itu menancap di hatinya. Bahkan Allah Subhaanahu wa Ta'aala menggabung dalam lafaz yang sedikit lagi jelas makna-makna yang banyak, sehingga lafaznya seperti kaidah dan asas. Oleh karena Al Qur’an menerangkan segala sesuatu, maka dia merupakan hujjah Allah terhadap hamba-hamba-Nya. Agar mereka tidak tersesat dalam meniti hidup ini. Yang dengannya mereka mendapatkan kebaikan dan pahala di dunia dan akhirat, seperti menjadi baik hatinya dan tenteram, akalnya menjadi sempurna karena menyelami makna-maknanya, amalnya mulia, akhlaknya utama, mendapatkan rezeki yang luas, mendapat pertolongan terhadap musuh, mendapatkan keridhaan Allah dan karamah (kemuliaan) yang besar, yaitu surga. Dengan surga."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 89",
    "description": "Dan ingatlah pada hari ketika kami bangkitkan pada setiap umat seorang saksi atas mereka, yaitu seorang nabi atau tokoh yang diakui kesalehan dan ketakwaannya, dari golongan mereka sendiri, yang memberi kesaksian dengan jujur; dan kami datangkan pula engkau, wahai nabi Muhammad, menjadi saksi atas mereka semua. Dan kami turunkan kitab Al-Qur'an kepadamu secara berangsur untuk menjelaskan kepada manusia prinsip-prinsip umum segala sesuatu, sebagai petunjuk menuju jalan kebenaran dan kedamaian, serta rahmat dan kabar gembira bagi orang yang berserah diri sepenuh hati kepada Allah. Ayat sebelumnya menjelaskan bahwa Al-Qur'an adalah penjelasan, petunjuk, rahmat, dan kabar gembira bagi orang yang berserah diri kepada Allah. Ayat ini kemudian mengiringinya dengan petunjuk-petunjuk dalam Al-Qur'an bagi mereka. Petunjuk pertama adalah perintah untuk berlaku adil dan berbuat kebajikan. Allah menyatakan, sesungguhnya Allah selalu menyuruh semua hamba-Nya untuk berlaku adil dalam ucapan, sikap, tindakan, dan perbuatan mereka, baik kepada diri sendiri maupun orang lain, dan dia juga memerintahkan mereka berbuat kebajikan, yakni perbuatan yang melebihi perbuatan adil; memberi bantuan apa pun yang mampu diberikan, baik materi maupun nonmateri secara tulus dan ikhlas, kepada kerabat, yakni keluarga dekat, keluarga jauh, bahkan siapa pun. Dan selain itu, dia melarang semua hamba-Nya melakukan perbuatan keji yang tercela dalam pandangan agama, seperti berzina dan membunuh; melakukan kemungkaran yaitu hal-hal yang bertentangan dengan nilai-nilai dalam adat kebiasaan dan agama; dan melakukan permusuhan dengan sesama yang diakibatkan penzaliman dan penganiayaan. Melalui perintah dan larangan ini dia memberi pengajaran dan tuntunan kepadamu tentang hal-hal yang terkait dengan kebajikan dan kemungkaran agar kamu dapat mengambil pelajaran yang berharga."
  }
]