[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan tanggung jawab Allah untuk mejelaskan jalan yang lurus untuk menunjuki kalian, yaitu islam. Dan di antara jalan, ada lorong bengkok yang tidak mengantarkan menuju hidayah, yaitu setiap ajaran yang bertentangan dengan islam, dari berbagai bentuk ideologi dan keyakinan. Dan Kalau seandainya Allah menghendaki memberikan hidayah, niscaya Dia memberikan kalian semuanya hidayah kepada Iman."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Hak Allah menjelaskan jalan lurus yang menyampaikan kepada rida-Nya, yaitu Islam. Di antara jalan-jalan, ada jalan yang merupakan jalan setan yang menyimpang dari kebenaran. Semua jalan selain Islam adalah jalan yang menyimpang. Seandainya Allah berkehendak untuk membimbing kalian semuanya kepada iman niscaya Allah melakukannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "9. Dengan karunia-Nya Allah menjelaskan jalan kebenaran bagi kalian yaitu agama Islam. Dan diantara banyak jalan terdapat jalan yang bengkok yang tidak dapat mengantarkan kepada jalan yang benar namun mengantarkan kepada kesesatan dan kebinasaan. Seandainya Allah berkehendak untuk memberi kalian hidayah, niscaya Dia akan memberi kalian semua hidayah menuju kebenaran."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. وَعَلَى اللهِ قَصْدُ السَّبِيلِ (Dan hak bagi Allah (menerangkan) jalan yang lurus) Dan wajib bagi Allah untuk menjelaskan jalan menuju tujuan dengan penuh kemudahan. وَمِنْهَا جَآئِرٌ ۚ( dan di antara jalan-jalan ada yang bengkok) Yakni sebagian dari hewan ternak, kuda, dan tunggangan lain yang berbelok dari tujuan, sehingga jalan menjadi semakin jauh bagi mereka dan terlambat untuk sampai ke tempat-tempat yang kalian tuju dan ke petunjuk Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9. Dan sudah menjadi hak bagi Allah untuk menerangkan jalan yang lurus, dan di antara jalan-jalan ada yang bengkok sehingga tidak bisa menuntun kepada petunjuk. Dan jikalau Dia menghendaki, pasti Dia memimpin kamu semuanya kepada jalan yang benar. Namun Dia menetapkan hikmah-Nya dan membiarkan kalian memilih jalan bagi kalian sendiri, agar kesungguhan dan niat seorang hamba bisa terlihat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9. Setelah Allah menceritakan jalan hissi (inderawi) dan Dia telah menciptakan –bagi para hambaNya- sarana untuk menempuhnya, berupa binatang unta dan hewan tunggangan lainnya, maka Dia menyebutkan jalan maknawi (abstrak) yang akan mengantarkan kepadaNya “dan hak bagi Allah (menerangkan) jalan yang lurus” yaitu jalan yang lurus, yang merupakan lintasan paling pintas dan pendek, menuju kepada Allah dan ketempat kemuliaanNya. Tentang jalan yang menyimpang dari akidah dan amalannya, maka itu adalah setiap jalan yang bertentangan dengan jalan yang lurus. Jalan ini memutuskan akses menju kepada Allah menyeret ketempat kebinasaan. Orang orang yang telah meraih hidayah, menelusuri jalan yang lurus dengan izin Rabb mereka, sementara orang orang yang sesat mengalami salah jalan darinya dan berjalan di atas jalan jalan yang menyimpang. “dan jikalau Dia menghendaki tentulah Dia memberi petunjuk kamu semuanya (kepada jalan yang lurus)” akan tetapi, Dia hanya memberikan hidayah bagi sebagian manusia, sebagai bentuk pemuliaan dan pengutamaan (dariNya) dan tidak mencurahkan hidayah kepada sebagian lain lantaran terkandung unsur hikmah dan keadilan dariNya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (وَعَلَى ٱللَّهِ قَصۡدُ ٱلسَّبِيلِ) wa ‘alallaahi qashdus sabiil : “Dan hak Allah menerangkan jalan yang lurus,” sebagai bentuk karunia dan nikmat-Nya, Allah menjelaskan jalan yang lurus, yaitu Islam. (وَمِنۡهَا جَآئِرٞۚ) wa minhaa jaa`ir : “dan di antaranya ada yang menyimpang.” Menjauh dari tujuan, yaitu seluruh agama seperti: Yahudi dan Nashrani. Makna ayat: Firman-Nya “dan hak Allah untuk menerangkan jalan yang lurus,” dan Firman-Nya “tentu Dia memberi petunjuk kamu semua ke jalan yang benar.” Kalau seandainya kalian bergantung kepada kehendak-Nya untuk memberikan seluruh manusia hidayah, niscaya Dia akan memberikan mereka hidayah. Ini karena kesempurnaan kekuasaan dan ilmu-Nya. Namun, karena hikmah-Nya, hidayah tidak menyapa setiap manusia, Dia memberikan hidayah kepada yang menginginkan petunjuk itu dan menyesatkan siapa yang menginginkan kesesatan. Pelajaran dari ayat: • Islam, merupakan jalan yang telah Allah jelaskan, sebagai bentuk karunia dan kasih sayang dari-Nya. Adapun selain jalan itu, maka itu jalan yang menyimpang dari keadilan dan kebenaran."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 9: Yaitu jalan yang menyampaikan kepada Allah dan kepada surga-Nya. Dia menunjukkan sebagian kamu karena kepemurahan dan karunia-Nya, dan tidak menunjuki yang lain karena hikmah dan keadilan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 9",
    "description": "Usai menjelaskan tanda-tanda yang menunjukkan betapa dia maha pencipta dan mahakuasa, Allah lalu beralih menjelaskan bahwa dia juga maha memberi petunjuk ke jalan yang benar. Karena itu, dialah yang patut disembah, dan menjadi hak bagi Allah yang maha mengetahui dan memberi petunjuk untuk menerangkan jalan yang lurus, yakni keimanan yang harus diikuti oleh manusia untuk membawa mereka menuju kebahagiaan di dunia dan akhirat. Dan menjadi hak Allah pula untuk menerangkan bahwa di antaranya ada jalan yang menyimpang, berkelok, dan berliku, yakni kekufuran, yang harus dijauhi karena menjerumuskan manusia ke jurang kesengsaraan di dunia dan akhirat. Dan jika dia menghendaki untuk menjadikan semua manusia menempuh jalan yang lurus, maka tidak ada halangan bagi-Nya untuk melakukan hal itu karena Allah mahakuasa, dan dalam keadaan demikian tentu dia memberi petunjuk kamu semua ke jalan yang lurus tersebut. Ayat-ayat berikut menjelaskan berbagai nikmat yang Allah anugerahkan kepada manusia. Dialah yang telah menurunkan air hujan dari arah langit untuk kamu manfaatkan guna memenuhi kebutuhan kamu. Sebagiannya menjadi minuman bagi kamu dan binatang-binatang peliharaanmu, dan sebagiannya yang lain dapat kamu gunakan untuk menyirami tumbuhan, yang padanya, yaitu pada tumbuhan hijau itu, kamu menggembalakan ternakmu sehingga mereka dapat makan dan menghasilkan produk yang kamu butuhkan, seperti susu, daging, dan bulu."
  }
]