[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya Allah memerintahakan hamba-hambaNya di dalam al-qur’an ini untuk berbuat adil dan berlaku obyektif terhadap hakNya, dengan mengesakanNya dan tidak mempersekutukanNya, dan juga terhadap hak-hak hamba-hambaNYa dengan memberikan hak kepada orang yang berhak mendapatkannya, juga memerintahkan (orang lain) untuk berbuat baik terhadap hakNya dalam beribadah kepadaNya dan menjalankan kewajiban-kewajiabnNya sebagaimana yang disyariatkannya dan kepada sesama makhluk dalam ucapan-ucapan dan perbuatan-perbuatan, memerintahakan untuk memberi orang-orang yang masih memiliki hubungan kekerabatan sesuatu yang mewujudkan silaturahmi dan kebaikan bagi mereka, dan melarang dari setiap yang buruk baik ucapan maupun perbuatan dan semua yang diingkari dan tidak disukai oleh syariat seperti zhalim kepada manusia dan menindas mereka. Dan melalui perintah dan larangan ini, Allah menasihati kalian dan mengingkatkan dampaknya supaya kalian mengingat-ingat perintah-perintah Allah dan memperoleh manfaat darinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "90. Sesungguhnya Allah memerintahkan keadilan pada hamba-hamba-Nya dengan menunaikan hak-hak Allah dan hak-hak para hamba, tidak mengutamakan seseorang di atas orang lain dalam hukum kecuali karena satu hak yang mengharuskan demikian. Allah memerintahkan berbuat kebaikan dengan memberikan apa yang tidak wajib atas seorang hamba seperti infak suka rela atau memaafkan orang zalim. Allah memerintahkan membantu hajat kebutuhan para kerabat. Allah melarang segala sesuatu yang buruk, baik berupa perkataan seperti perkataan yang buruk atau perbuatan seperti zina. Allah melarang apa yang diingkari oleh syariat, yaitu segala bentuk kemaksiatan. Allah melarang berbuat zalim dan sombong di hadapan manusia. Allah menasihati kalian dengan apa yang Dia perintahkan kepada kalian dan apa yang Dia larang dalam ayat ini dengan harapan kalian mau mengambil pelajaran dari nasihat Allah tersebut."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "90. Allah memerintahkan hukum-hukum yang agung yang mengandung kebaikan dan hal-hal mulia yang mencegah keburukan dalam 9 ayat yang akan disebutkan ini: Allah memerintahkan untuk berbuat keadilan dan kebaikan dalam beribadah kepada Allah dengan menunaikan hak-hak manusia dengan perkataan dan perbuatan yang baik. Dan Allah memerintahkan untuk berbuat baik terhadap para kerabat, dan melarang perbuatan dan perkataan yang buruk, serta kezaliman dan permusuhan. Hal ini agar kalian mengambil pelajaran dari hukum-hukum yang ditetapkan Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "90. إِنَّ اللهَ يَأْمُرُ بِالْعَدْلِ وَالْإِحْسٰنِ (Sesungguhnya Allah menyuruh (kamu) berlaku adil dan berbuat kebajikan) Makna (العدل) yakni berlaku adil kepada semua orang tanpa condong kepada sebagiannya kecuali dengan alasan yang mewajibkan itu. Dan termasuk dari perbuatan adil adalah bersikap pertengahan antara sikap berlebih-lebihan dan kelalaian. Dan makna (الإحسان) yakni melakukan sesuatu diluar kewajiban yang dituntut atasnya, seperti bersedekah dan segala perbuatan yang tidak diwajibkan Allah namun berpahala jika dilakukan. وَإِيتَآئِ ذِى الْقُرْبَىٰ( memberi kepada kaum kerabat) Yakni memenuhi kebutuhan para kerabat. وَيَنْهَىٰ عَنِ الْفَحْشَآءِ(dan Allah melarang dari perbuatan keji) Makna (الفحشاء) yakni perkataan atau perbuatan yang sangat buruk seperti perbuatan zina atau kikir. وَالْمُنكَرِ(kemungkaran) Yakni segala yang dilarang oleh syari’at yang meliputi segala kemaksiatan. وَالْبَغْىِ ۚ( dan permusuhan) Yakni kesombongan dan kezaliman. يَعِظُكُمْ لَعَلَّكُمْ تَذَكَّرُونَ (Dia memberi pengajaran kepadamu agar kamu dapat mengambil pelajaran) Yakni agar kalian senantiasa ingat setiap perintah dan larangannya dalam ayat ini, sehingga kalian dapat mengambil pelajaran yang diberikan Allah kepada kalian."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Ayat ini merupakan ayat dalam al-Qur'an yang paling lengkap mengingatkan tentang kemaslahatan seluruhnya, dan pemberontakan terhadap kemungkaran. 2 ). { إِنَّ اللَّهَ يَأْمُرُ بِالْعَدْلِ وَالْإِحْسَانِ } al-Ihsan kedudukannya di atas al-'Adl, karena al-'Adl adalah memberikan hak orang lain yang menjadi beban baginya dan mengambil sesuatu yang juga menjadi hak mliknya, sedangkan al-Ihsan adalah memberi sesuatu di atas jumlah yang diwajibkan dan mengambil sesuatu lebih sedikit dari jumlah yang menjad haknya, maka kesimpulannya adalah bahwasanya menegakkan keadilah merupakan kewajiban, dan memberikan kebaikan merupakan anjuran; oleh karena itu Allah meninggikan balasan bagi pelaku kebaikan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "90. Sesungguhnya Allah memerintahkan seluruh manusia untuk jujur dan adil dalam segala perkara, membalas kebaikan dengan sesiatu yang lebih baik, membalas keburukan dengan memberi maaf dan ampunan, dan memberikan hak-hak kepada kerabat berupa silaturahmi dan berbuat baik. Dan Allah melarang dari setiap keburukan dalam perkataan ataupun perbuatan seperti ghibah, namimah, zina, pelit, dan dari setiap sesuatu yang dilarang syariat dan tidak sesuai dengan akal sehat, yaitu seluruh perbuatan maksiat, serta dari kezaliman dan permusuhan. Allah mengingatkan kalian dengan hukum-hukumNya supaya kalian mengambil pelajaran dan mengerjakan apa yang diperintahkan dan menjauhi apa yang dilarang. Semua itu mencakup keseluruhan ayat dalam kitab Allah tentang kebaikan dan keburukan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya Allah memerintahkan untuk berlaku adil, berbuat kebajikan, dan memberikan bantuan kepada kerabat} memberi kerapat sesuatu yang mereka butuhkan {Dia melarang perbuatan keji} segala sesuatu yang buruk baik ucapan maupun tindakan {kemungkaran} sesuatu yang tidak diperbolehkan syariat dengan melarangnya {dan permusuhan} zalim dan sombong {Dia memberi pelajaran kepada kalian agar kalian mengambil pelajaran} mengambil pelajaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "90. sikap keadilan yang Allah perintahkan mencakup keadilan dalam hak Allah dan hak hamba-hambaNya, keadilan dalam masalah itu, dengan cara menjalankan hak hak secara sempurna dengan cara memenuhi hak hamba yang Allah wajibkan yang berkaitan dengan kekayaan, fisik dan kombinasi antara keduanya berhubungan dengan hakNya dan hak hak para hambaNYa, bergaul dengan manusia dengan keadilan yang utuh. Setiap pemegang tanggung jawab harus menjalankan kewajiban yang berada dibawah tanggungannya, baik ia memegang kekuasaan tertinggi atau keuasaan peradilan, atau wakil penguasa maupun wakil hakim. jadi keadilan hakikatnya adalah segala yang Allah wajibkan atas para hamba dalam kitabNya melalui lisan RasulNya dan memerintahkan mereka untuk menjalankannya. Termasuk (cermin) keadilan dalam bermuamalah, adalah engkau berinteraksi dengan mereka pada trsnsaksi jual beli dan transaksi timbal balik lainnya dengan memenuhi segala yang menjadi kewajibanmu jangan sekali kali mengurangi hak mereka, jangan menipu mereka atau memperdayai mereka dan jangan pula menzhalimi mereka. Keadilan wajib (ditegakkan). Dan ihksan merupakan suatu keutamaan yang dianjurkan, hal itu seperti dengan memberi manfaat kepada orang lain dengan harta, fisik, ilmu dan yang lainnya dari berbagai jenis manfaat, sehingga masuk ke dalamnya adalah berbuat ihsan kepada binatang ternak yang dimakan dagingnya ataupun tidak. Secara khusus Allah menyinggung pemberian kepada kaum kerabat, kendatipun suda masuk dalam konteks umum, untuk menekankan tentang hak mereka dan keharusan untuk menjalin hubungan dengan mereka dan bersikap baik kepada mereka serta bersemangat untuk memenuhinya, masuk dalam pengertian ini, seluruh kaum kerabat, yang dekat ataupun yang jauh. Akan tetapi, semakin dekat hubungn darahnya dengan kita maka ia semakin berhak menerima kebaikan. Firman Allah, ”dan Allah melarang dari perbuatan keji” yaitu seluruh perbuatan dosa besar yang dinilai bejat oleh syariat dan fitrah manusia, semisal perbuatan syirik kepada Allah, membunuh tanpa alasan yang diberikan, zina, pencurian, bangga diri , sombong, menghinakan orang lain dan perbuatan keji lainnya. Termasuk dalam makna kemungkaran adalah, setiap dosa dan maksiat yang berkaitan dengan hak Allah sedangkan tindakan permusuhan yaitu setia permusuhan yaitu setiap permusuhan terhadap sesame menyangkut darah, harta, dan kehormatan. Maka ayat ini menghimpun seluruh perintah dan larangan, tidak ada yang tersisa melainkan pasti masuk kedalamnya. Ini merupakan kaidah yang menjadi acuan dalam perkara perkara parsial lainnya. Setiap persoalan yang menyangkut keadilan, kebaikan atau pemberian kepada kaum kerabat, maka itu termasuk perkara yang Allah perintahkan. (sebaliknya) setiap masalah yang memuat unsur kekejian, kemungkaran atau permusuhan, maka termasuk perkara yang Allah larang. Melalui ayat ini, dapat diketahui keindahan perintah yang Allah tetapkan, dan keburukan sesuatu yang Allah larang dengan dasar ayat ini pula, ucapan ucapan dan tindakan tindakan yang ada pada orang orang diperhitungkan dan diacukan kepadanya di setiap kondisi. Mahaberkah Allah Dzat yang menjadikan pada firman firmanNya unsur hidayah, penyembuh dan cahaya serta pembeda antara segala sesuatu. Karenanya Allah berfirman ”Dia memberi pengajaran kepadamu” dengannya. maksudnya dengan penjelasan yang disampaikan olehNya kepada kalian dalam kitabNya, maka Dia memerintahkan kalian perkara yang berisi kebaikan bagi kalian dan melarang kalian dari perbuatan yang mengandung bahaya bagi kalian ”agar kamu dapat mengambil pelajaran” yaitu sesuatu yang memberimu pelajaran, sehingga kamu memahami dan penyerapnya. Sesungguhnya kalian jika dapat mengambil pelajaran dan memahaminya dan mengetahui isi kandungannya. maka kalianpun akan berbahagia dengan kebahagiaan yang tidak disertai oleh celaka. setelah memerintahkan perkara yang wajib dalam substansi syariat, maka Allah memerintahkan untuk memenuhi apa yang diwajibkan seorang hamba pada dirinya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (ٱلۡعَدۡلِ) al-‘adl : “keadilan” dan diantaranya tauhid. (ٱلۡإِحۡسَٰنِ) al-ihsan : “kebaikan” melaksanakan ketaatan dan meninggalkan larangan dengan senantiasa merasa diawasi oleh Allah ta’ala. (وَإِيتَآيِٕ ذِي ٱلۡقُرۡبَىٰ) wa iitaa`i dzilqurbaa : “dan menunaikan hak orang yang terdekat” memberikan hak kepada kerabat-kerabat berupa silaturahmi dan kebaikan. (عَنِ ٱلۡفَحۡشَآءِ) ‘anil fahsyaa` : “dari perbuatan keji” zina. (يَعِظُكُمۡ) ya’izhukum : “Dia menasihatikan kalian” memerintah dan melarang. (تَذَكَّرُونَ) tadzakkaruun : “agar mereka ingat.” Yaitu mengambil pelajaran. Makna ayat: Firman-Nya “Sesungguhnya Allah memerintahkan kepada keadilan” bahwa Allah memerintahkan dalam Al-Kitab yang Dia turunkan sebagai penjelas atas segala sesuatu, memerintahkan kepada keadilan, dan di antaranya dengan menyembah Allah dengan berzikir dan bersyukur kepada-Nya, karena Dia adalah Yang Maha Pencipta dan Yang Maha Memberikan Nikmat, dan engkau meninggalkan peribadatan selain-Nya, karena selain-Nya tidak menciptakan tidak pula memberikan rezeki dan nikmat. Oleh karena itu lafaz ini ditafsirkan dengan Laa ilaaha illallaah. “kebaikan” menunaikan kewajiban dan menjauhi larangan dengan terus merasa diawasi oleh Allah ta’ala, sehingga kewajiban ditunaikan sesuai dengan kriteria yang diminta secara totalitas dan baik, serta menjauhi larangan karena takut kepada Allah serta malu kepada-Nya. firman-Nya “dan memberikan hak-hak kerabat” menunaikan hak-hak kerabat dengan kebaikan dan silaturahmi. Ini adalah apa yang Allah ta’ala perintahkan pada kitab-Nya, di antara yang Dia larang adalah perbuatan keji, yaitu zina, liwath (homoseksual), dan segala sesuatu yang menjijikan dan keji bahkan sifat pelit “dan kemungkaran.” Yaitu segala sesuatu yang syariat larang dan diingkari oleh fitrah yang sehat dan akal yang benar. Dan Allah melarang dari melampaui batas, yaitu kezaliman dan berlebihan dalam segala hal, firman-Nya “Agar kamu dapat mengambil pelajaran.” Allah memerintahkan hal itu dalam kitab-Nya agar kalian ingat, mengambil pelajaran dan melaksanakan perintah dan menjauhi larangan, sehingga dengannya kalian mendapatkan kesempurnaan dan kebahagiaan. Oleh karena itu ayat ini “Sesungguhnya Allah menyuruh (kamu) berlaku adil dan berbuat kebajikan” sampai “agar kamu dapat mengambil pelajaran.” Merupakan ayat Al-Qur’an yang paling mencakup perihal kebaikan dan keburukan, sehingga tidak ada satu pun kebaikan kecuali telah diperintahkan pada ayat ini, begitu pula, segala keburukan telah dilarang dalam ayat ini. Pelajaran dari ayat: • Menjelaskan ayat yang berkaitan dengan kebaikan dan keburukan “sesungguhnya Allah memerintahkan untuk berbuat adil dan kebajikan” • Wajib berbuat adil dan kebaikan, serta menunaikan hak-hak kerabat berupa berbuat baik dan silaturahmi. • Diharamkannya zina dan homoseksual, serta setiap keburukan dan perbuatan keji baik yang tampak atau tidak. • Pengharaman sikap melampaui batas, yaitu berbuat zalim dalam bentuk apapun."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 90: Adil artinya menempatkan sesuatu pada tempatnya dan memberikan hak kepada masing-masing yang mempunyai hak. Adil yang diperintahkan Allah ini mencakup adil terhadap hak-Nya dan adil terhadap hak hamba-Nya. Caranya adalah dengan menunaikan kewajibannya secara sempurna. Kepada Allah Subhaanahu wa Ta'aala, misalnya dengan mentauhidkan-Nya dan tidak berbuat syirk, menaati-Nya dan tidak mendurhakai, mengingat-Nya dan tidak melupakan, serta bersyukur kepada-Nya dan tidak kufur. Kepada manusia, misalnya dengan memenuhi haknya. Jika sebagai pemimpin, maka ia memenuhi kewajibannya terhadap orang yang berada di bawah kepemimpinannya, baik ia sebagai pemimpin dalam ruang lingkup yang besar (imamah kubra), menjabat sebagai qadhi (hakim), wakil khalifah atau wakil qadhi. Adil juga berlaku dalam mu’amalah, yaitu dengan bermu’amalah dalam akad jual beli dan tukar-menukar dengan memenuhi kewajiban kita, tidak mengurangi hak orang lain (seperti mengurangi takaran dan timbangan), tidak menipu dan tidak menzalimi. Adil hukumnya wajib, sedangkan ihsan adalah keutamaan dan disukai, misalnya dengan memberikan lebih dari yang diwajibkan, seperti memberikan manfaat kepada orang lain dengan harta, badan, ilmu atau lainnya. Jika dalam ibadah, maka dengan mengerjakan kewajiban atau beribadah kepada Allah seakan-akan melihat-Nya. Disebutkan memberikan sesuatu kepada kerabat meskipun masuk dalam keumuman, agar mendapatkan perhatian lebih. Kerabat di sini mencakup kerabat dekat maupun jauh, akan tetapi semakin dekat, maka semakin berhak mendapat kebaikan. Yaitu dosa besar yang dianggap keji baik oleh syara’ maupun fitrah, seperti syirk, membunuh dengan tanpa hak, zina, mencuri, ‘ujub, sombong, merendahkan manusia, dan lain-lain. Yaitu perbuatan dosa yang terkait dengan hak Allah. Ada yang menafsirkan baghyu dengan, “perbuatan dosa yang terkait dengan manusia.” Dengan perintah dan larangan. Ayat ini mencakup semua perintah dan larangan, di mana tidak ada sesuatu pun kecuali masuk di dalamnya. Ayat ini merupakan kaidah, di mana masalah juz’iyyah (satuan) masuk ke dalamnya. Oleh karena itu, setiap perkara yang mengandung keadilan, ihsan, dan memberi kepada kerabat, maka hal ini termasuk yang diperintahkan Allah, sedangkan setiap perkara yang mengandung perkara keji, munkar atau zalim kepada manusia, maka hal ini termasuk yang dilarang Allah. Maka Mahasuci Allah, yang menjadikan dalam firman-Nya petunjuk, cahaya, dan pembeda antara sesuatu. Karena apabila kamu sudah mengambil pelajaran darinya, memahami dan mengerti, maka kamu dapat mengamalkan konsekwensinya, sehingga kamu dapat berbahagia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 90",
    "description": "Ayat sebelumnya menjelaskan bahwa Al-Qur'an adalah penjelasan, petunjuk, rahmat, dan kabar gembira bagi orang yang berserah diri kepada Allah. Ayat ini kemudian mengiringinya dengan petunjuk-petunjuk dalam Al-Qur'an bagi mereka. Petunjuk pertama adalah perintah untuk berlaku adil dan berbuat kebajikan. Allah menyatakan, sesungguhnya Allah selalu menyuruh semua hamba-Nya untuk berlaku adil dalam ucapan, sikap, tindakan, dan perbuatan mereka, baik kepada diri sendiri maupun orang lain, dan dia juga memerintahkan mereka berbuat kebajikan, yakni perbuatan yang melebihi perbuatan adil; memberi bantuan apa pun yang mampu diberikan, baik materi maupun nonmateri secara tulus dan ikhlas, kepada kerabat, yakni keluarga dekat, keluarga jauh, bahkan siapa pun. Dan selain itu, dia melarang semua hamba-Nya melakukan perbuatan keji yang tercela dalam pandangan agama, seperti berzina dan membunuh; melakukan kemungkaran yaitu hal-hal yang bertentangan dengan nilai-nilai dalam adat kebiasaan dan agama; dan melakukan permusuhan dengan sesama yang diakibatkan penzaliman dan penganiayaan. Melalui perintah dan larangan ini dia memberi pengajaran dan tuntunan kepadamu tentang hal-hal yang terkait dengan kebajikan dan kemungkaran agar kamu dapat mengambil pelajaran yang berharga. Petunjuk berikutnya adalah perintah untuk menepati janji. Allah berpesan, dan tepatilah janji yang telah kalian ikrarkan dengan Allah secara sungguh-sungguh apabila kamu berjanji, dan janganlah kamu melanggar sumpah, yaitu perjanjian yang kamu teguhkan setelah janji itu diikrarkan dengan menyebut nama-Nya. Bagaimana kamu tidak menepati janji dan sumpah yang telah diikrarkan dan diteguhkan, sedang kamu telah menjadikan Allah sebagai saksimu atas janji dan sumpah tersebut. Sesungguhnya Allah mengetahui segala apa yang kamu perbuat. Baik niat yang terpintas dalam hati maupun tindakan dan perbuatan yang kamu lakukan, baik yang rahasia maupun yang nyata, termasuk janji dan sumpah yang kamu ikrarkan, tidak ada yang samar bagi Allah."
  }
]