[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan janganlah kalain membatalkan perjanjian-perjanjian kalian, sehingga perumpamaan kalian seperi seorang wanita yang telah memintal benang-benang dan merapikannya, kemudian ia mengurainya. Kalian menjadikan sumpah-sumpah yang kalian ucapkan ketika membuat perjanjian sebagai alat tipuan terhadap pihak yang kalian menjalin perjanjian dengannya, dan kalian membatalkan perjanjian kalian tatkala kalian menjumpai golongan yang lebih banyak harta dan manfaatnya daripada orang-orang yang kalian jalin perjanjian dengan mereka(sebelumnya). Sesungguhnya Allah menguji kalian dengan perintah yang tertuju kepada kalian untuk memenuhi janji-janji dan Dia melarang kalian dari melanggarnya, dan supaya Dia menjelaskan kepada kalian pada hari kiamat apa yang kalian perselisihkan di dunia, yaitu untuk beriman kepada Allah dan kenabian Muhammad ."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "92. Jangan menjadi orang-orang bodoh yang kurang akal dengan membatalkan perjanjian, seperti wanita dungu yang telah lelah menenun kainnya atau wolnya, ia menenunnya dengan baik, namun sesudah itu ia membongkar dan mengurainya kembali seperti sediakala. Sehingga dia lelah menenun dan membongkarnya tanpa hasil yang diinginkan. Kalian menjadikan sumpah kalian sebagai tameng untuk menipu sebagian dari kalian, agar umat kalian lebih banyak dan lebih kuat daripada musuh kalian. Allah menguji kalian dengan memenuhi perjanjian, apakah kalian memenuhinya atau melanggarnya? Allah pasti akan menjelaskan kepada kalian pada hari Kiamat apa yang kalian perselisihkan di dunia, Allah menjelaskan siapa yang benar dan siapa yang salah, yang jujur dari siapa yang dusta."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "92. Hai manusia, Janganlah perbuatan kalian melanggar janji seperti seorang perempuan jahil yang menenun benang wol dengan tenunan yang kuat akan tetapi dia kemudian menguranginya kembali. Hal ini jika kalian menjadikan janji dan sumpah-sumpah kalian sebagai alat untuk menipu orang lain karena telah menemukan orang yang lebih banyak hartanya dan lebih mendatangkan kemaslahatan bagi kalian daripada orang yang kalian beri janji terlebih dahulu. Sesungguhnya Allah ketika itu sedang menguji kesetiaan kalian dalam memenuhi janji. Hai manusia, sungguh Allah akan menjelaskan bagi kalian pada hari kiamat tentang kebenaran dan kebatilan yang kalian perselisihkan di dunia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "92. وَلَا تَكُونُوا۟ كَالَّتِى نَقَضَتْ غَزْلَهَا (Dan janganlah kamu seperti seorang perempuan yang menguraikan benangnya) Yakni benang yang telah kalian pintal baik itu dari katun, wol, atau lainnya. مِنۢ بَعْدِ قُوَّةٍ(yang sudah dipintal dengan kuat) Yakni setelah menguatkan pintalannya. أَنكٰثًا(menjadi cerai berai kembali) Yakni jika kalian melakukan hal itu maka kalian layaknya perempuan yang memintal benang dengan kuat kemudian menguraikannya kembali karena sikap bodohnya. Makna (أنكاثا) yakni terurai kembali seperti sedia kala. تَتَّخِذُونَ أَيْمٰنَكُمْ دَخَلًۢا بَيْنَكُمْ(kamu menjadikan sumpah (perjanjian)mu sebagai alat penipu di antaramu) Makna (الدخل) yakni makar dan penipuan. أَن تَكُونَ أُمَّةٌ هِىَ أَرْبَىٰ مِنْ أُمَّةٍ ۚ( disebabkan adanya satu golongan yang lebih banyak jumlahnya dari golongan yang lain) Yakni lebih banyak jumlah anggotanya dan harta bendanya. Terdapat pendapat mengatakan bahwa ini merupakan peringatan bagi orang-orang beriman agar tidak tertipu oleh harta kafir Quraisy yang sangat banyak sehingga mereka membatalkan baiat yang telah mereka berikan kepada Rasulullah. Imam Mujahid berkata: dahulu mereka membuat perjanjian dengan kongsinya, lalu jika mereka mendapatkan orang yang lebih banyak hartanya dan lebih kuat, mereka membatalkan perjanjian dengan kongsi mereka dan mengikat perjanjian baru dengan orang yang lebih banyak hartanya tersebut. Dan akhirnya mereka dilarang untuk berbuat demikian. إِنَّمَا يَبْلُوكُمُ اللهُ بِهِۦ ۚ( Sesungguhnya Allah hanya menguji kamu dengan hal itu) Yakni menguji kalian apakah kalian akan berpegang teguh pada perjanjian atau malah membatalkannya karena terlena oleh harta yang lebih banyak. وَلَيُبَيِّنَنَّ لَكُمْ يَوْمَ الْقِيٰمَةِ مَا كُنتُمْ فِيهِ تَخْتَلِفُونَ(Dan sesungguhnya di hari kiamat akan dijelaskan-Nya kepadamu apa yang dahulu kamu perselisihkan itu) Dengan menjelaskan kebenaran dan para pelaku kebenaran untuk meninggikan derajat mereka, dan menjelaskan kebatilan dan para pelakunya lalu menurunkan azab yang berhak mereka dapatkan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Penghianatan dapat mencabut kepercayaan, dan menimbulkan kekacauan, dan dapat merobek hubungan kekerabatan, bahkan ia bisa saja mengembalikan kekuatan seseorang menjadi lemah tak berdaya : { وَلَا تَكُونُوا كَالَّتِي نَقَضَتْ غَزْلَهَا مِنْ بَعْدِ قُوَّةٍ أَنْكَاثًا } \"Dan janganlah kamu seperti seorang perempuan yang menguraikan benangnya yang sudah dipintal dengan kuat\". 2 ). Wahai engkau yang telah melaksanan haji di Baitullah, kalian datang dari tempat ang jauh, bahkan dengan usaha yang keras kalian juga telah melakukan talbiah dari semua arah walaupun jauh dari pintu kakbah, namun dengan semua itu haji kalian telah sempurna, dan tibalah saatnya kalian untuk kembali ke rmah masing-masing, waspadalah dari kepulanganmu yang dapat mengembalikan suasana haji menjadi kotor karena perkara-perkara haram, { وَلَا تَكُونُوا كَالَّتِي نَقَضَتْ غَزْلَهَا مِنْ بَعْدِ قُوَّةٍ أَنْكَاثًا } Hati-hatilah dengan dirimu karena ia dapat menghancurkan apa yang telah ia bangun sendiri, dan menghamburkan apa yang telah ia kumpul, dan melumpuhkan apa yang telah kamu kokohkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "92. Dan janganlah kalian membatalkan sumpah wahai orang-orang mukmin, seperti perempuan bodon dan gila yang telah membatalkan perjanjian yang telah dia buat sendiri setelah menyetujuinya. Lalu dia menjadikan perjanjian itu batal dan tercerai berai sebagaimana sebelum terjadi ikatan perjanjian. Kalian menggunakan perjanjian yang seharusnya ditepati sebagai tipu muslihat bagi orang lain dan memperdaya mereka. Kalian seakan-akan memuliakan perjanjian itu dan menyembunyikan niat pembatalan dan condong kepada orang selain mereka (yang ditipu) karena mereka lebih kuat dan lebih kaya. Sesungguhnya Allah menguji kalian untuk menepati janji. Dan sungguh pada hari kiamat, Allah akan menjelaskan kepada kalian tentang sesuatu yang kalian perselisihkan di dunia berupa yang haq dan bathil. Keseimbangan yang kuat dan pengaruh dari kebaikan-kebaikan yang terbatas. Ayat ini turun untuk memberi perumpamaan berupa perempuan bodoh dari penduduk Mekah yang bernama Saidah Al-Asadiyah yang mengumpulkan serat dan bulu, lalu dia mengikatnya kemudian mencerai beraikannya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Janganlah seperti seorang perempuan yang menguraikan tenunannya yang sudah dipintal dengan kuat} setelah memintal dan mengikatnya {menjadi cerai-berai kembali} tercerai berai setelah mengikatnya {Kalian menjadikan} kalian menjadikan {sumpah kalian sebagai alat menipu} alat untuk berkhianat dan menipu {di antara kalian karena ada} karena ada satu golongan yang lebih banyak kelebihannya} yang lebih banyak jumlahnya dan lebih melimpah hartanya {daripada golongan lain. Sesungguhnya Allah hanya menguji kalian} menguji kalian {dengan hal itu} dengan perkara kalian yaitu memenuhi janji {dan sungguh Allah akan menjelaskan kepada kalian pada hari kiamat tentang sesuatu yang selalu kalian perselisihkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "92. “Dan janganlah kamu,” saat membatalkan perjanjian-perjanjian, menjadi masuk dalam perumpamaan yang terburuk, paling jelek dan benar-benar menunjukkan kebodohan orang yang menjalankannya. Yaitu “seperti seorang perempuan,” yang memintal (benang) dengan pintalan yang kuat, lalu ketika telah kokoh dan terealisasikan apa yang ia inginkan, maka dia menguraikannya dan menjadikannya “bercerai berai kembali.” Sudah kepayahan dalam memintal dan kelelahan untuk menguraikannya, namun dia tidak mendapatkan manfaat (dari perbuatannya) selain kegagalan, kepayahan, dan ketololan akalnya serta kepincangan pikiran. Begitu pula orang yang mengrai perjanjian yang telah dia tetapkan. Ia adalah orang yang berbuat zhalim, bodoh, idiot, kurang agama, dan tatakrama. Firman Allah, “kamu menjadikan sumpah (perjanjian) mu sebagai alat penipu di antaramu, disebabkan adanya satu golongan yang lebih banyak jumlahnya dari golongan yang lain,” maksudnya, kondisi demikian ini tidak pantas terjadi pada kalian, yaitu menetapkan sumpah-sumpah yang diteguhkan dan menunggu-nunggu kesempatan, lalu ketika pembuat perjanjian lemah, tidak mampu mengalahkan pihak lain, maka dia memenuhi perjanjian tersebut, bukan karena niatan untuk mengagungkan perjanjian dan sumpah, tetapi untuk melemahkannya. Apabila posisinya kuat dan melihat adanya kepentingan duniawi dalam pembatalannya, maka dia menggugurkannya tanpa peduli dengan janji dan sumpahnya kepada Allah. Kejadian-kejadian itu semua terjadi berdasarkan hawa nafsu jiwanya dan lebih mengutamakannya daripada keinginan Allah dan norma-norma kemanusiaan dan moral yang terpuji. Agar kalian menjadi umat yang lebih besar jumlah dan kekuatannya dibandingkan umat lainnya. Ini merupakan ujian dan cobaan dari Allah agar (Allah) menguji kalian dengannya melalui cara mendatangkan berbagai sebab kausalitas terjadinya cobaan yang menjadi alat penguji bagi orang yang jujur lagi menepati (janjinya) (dibedakan) dari orang yang jahat lagi celaka. “Dan sesungguhnya di Hari Kiamat akan dijelaskanNya kepadamu apa yang dahulu kamu perselisihkan itu,” maka Allah memberi alasan kepada setiap orang dengan amalannya, dan menghinakan orang yang melanggar janji."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (نَقَضَتۡ غَزۡلَهَا) naqdhat ghazlahaa : “yang melepaskan ikatannya” merusak ikatannya setelah ia ikat. (مِنۢ بَعۡدِ قُوَّةٍ) mim ba’di quwwah : “setelah sebelumnya kuat” setelah menguatkan dan mengokohkan (أَنكَٰثٗا) ankaatsaa : bentuk jamak dari nakatsa—yankutsu yaitu membatalkan dan mengurai kembali setelah terikat. (كَٱلَّتِي نَقَضَتۡ غَزۡلَهَا) kallatii naqodhot ghazlahaa : “seperti perempuan yang memutuskan ikatannya” yaitu perempuan bodoh Mekah Rabthah binti Sa’d bin Taim Qurasyiyah. (دَخَلَۢا بَيۡنَكُمۡ) dakhalam bainakum : ad-dakhl adalah sesuatu yang masuk pada sesuatu yang bukan darinya untuk merusak dan menipu. (أَرۡبَىٰ مِنۡ أُمَّةٍۚ) arbaa min ummah : lebih banyak kekuatan dan jumlahnya. Makna ayat: Firman-Nya “Dan janganlah kalian seperti seorang perempuan yang menguraikan benangnya” yaitu seorang perempuan Mekah yang bodoh, dia memintal kemudian menguraikannya lagi setelah ikatan itu kuat, maka Allah ta’ala melarang kaum mukminin mengingkari janji mereka setelah dikuatkan, sehingga mereka sama seperti perempuan bodoh tersebut. Firman-Nya “Kamu menjadikan sumpah (perjanjian) mu sebagai alat penipu di antara kalian” untuk merusak dan menipu, seperti kalian bersumpah kepada sekelompok orang lalu kalian teguhkan sumpah itu dengan nama Allah kemudian kalian melanggarnya dan melepaskan apa yang sudah kalian kuatkan dari sumpah tersebut. Dan kalian membuat sumpah kepada sekelompok karena mereka lebih kuat dan kalian mengambil manfaat dari mereka. Inilah makna dari firman-Nya ta’ala : “Disebabkan adanya satu golongan yang lebih banyak jumlahnya dari golongan yang lain” lebih banyak pengikut, senjata, harta dan manfaat. Firman-Nya “Sesungguhnya Allah hanya menguji kamu dengan hal itu” Dia menguji kalian, menghadapkan kalian pada permasalahan ini, dan kalian dapati diri kalian condong kepadanya, kemudian kalian ingat akan larangan Rabb kalian untuk tidak melanggar sumpah dan janji, dan kalian meninggalkannya karena ketaatan kepada Rabb kalian, atau memilih tidak melakukannya karena lebih mencintai dunia ketimbang akhirat “Dan sesungguhnya di hari kiamat Dia akan menjelaskannya kepadamu apa yang dahulu kalian perselisihkan itu.” Kemudian Allah memutuskan hukum di antara kalian dan membalas kalian; orang yang baik akan dibalas karena kebaikannya, dan orang yang buruk akan dibalas karena keburukannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 92: Seperti halnya wanita dungu di Mekah yang telah sekian lama mengikat benangnya lalu diuraikannya. Ia hanya memperoleh kekecewaan. Oleh karena itu, barang siapa yang telah mengadakan perjanjian, lalu dilanggarnya, maka ia adalah orang yang zalim, bodoh dan kurang akal, kurang agama dan kehormatannya. Ada yang menafsirkan, bahwa kaum muslimin yang jumlahnya masih sedikit itu telah mengadakan perjanjian yang kuat dengan Nabi shallallahu 'alaihi wa sallam. Ketika mereka melihat orang-orang Quraisy berjumlah banyak, lalu timbullah keinginan mereka untuk membatalkan perjanjian dengan Nabi Muhammad shallallahu 'alaihi wa sallam itu. Perbuatan tersebut dilarang oleh Allah Subhaanahu wa Ta'aala. Ada pula yang menafsirkan, bahwa kaum muslimin bersekutu dengan golongan lain, namun ketika mereka mendapatkan golongan yang lebih banyak jumlahnya dan lebih kuat, mereka membatalkan perjanjiannya dengan golongan yang lama, dan mengikat perjanjian baru dengan golongan yang lebih banyak itu. Semua itu dilakukan mengikuti hawa nafsu dan kepentingan duniawi, wallahu a’lam. Yakni dengan perintah-Nya untuk memenuhi janji, agar Dia melihat siapa di antara kamu yang taat dan siapa yang bermaksiat. Bisa juga maksudnya, bahwa Dia menguji kamu dengan golongan yang lebih banyak dan lebih kuat, agar Dia melihat apakah kamu tetap memenuhi janji atau tidak. Tentang masalah perjanjian maupun lainnya, yaitu dengan mengazab orang yang melanggar janji dan memberi balasan orang yang memenuhinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 92",
    "description": "Dan janganlah kamu, dalam hal mengingkari janji yang telah diikrarkan dan sumpah yang telah diucapkan, seperti halnya seorang perempuan yang menguraikan kembali benangnya yang sudah dipintal dengan kuat sehingga menjadi cerai berai kembali. Sesungguhnya kamu tahu bahwa itu adalah tindakan bodoh dan buruk. Tindakan seperti itu sama halnya dengan kamu menjadikan sumpah dan perjanjian-Mu sebagai alat penipu di antaramu, disebabkan adanya satu golongan yang lebih banyak jumlahnya, lebih banyak hartanya, lebih kuat kedudukannya, atau lebih tinggi posisinya dari golongan yang lain. Allah hanya menguji kamu dengan hal itu, yakni dengan adanya kelompok manusia yang lebih kaya dan berkedudukan lebih tinggi, dapatkah kamu tetap menepati janji dan memenuhi sumpahmu. Dan pasti pada hari kiamat kelak akan dijelaskan-Nya kepadamu apa yang dahulu kamu perselisihkan itu. Allah akan memberi balasan sesuai perbuatan yang telah kamu lakukan. Usai mengisyaratkan adanya perselisihan di antara umat manusia dalam beberapa persoalan kehidupan, pada ayat ini Allah menyatakan kekuasaannya untuk menghilangkan perselisihan itu seandainya dia berkehendak. Dan jika Allah menghendaki kamu menjadi satu umat, niscaya dia menjadikan kamu satu umat yang memiliki satu pendapat saja, tanpa ada perselisihan sedikit pun di antara kamu, tetapi Allah tidak berbuat demikian karena dia memberi manusia kebebasan untuk memilih jalan sesuai kemauannya: yang sesat atau yang lurus. Dia menyesatkan siapa yang dia kehendaki atas pilihannya memilih jalan kesesatan, dan memberi kemampuan untuk melaksanakan petunjuk kepada siapa yang dia kehendaki, juga atas pilihannya memilih jalan petunjuk. Tetapi, kamu pasti akan ditanya tentang apa yang telah kamu kerjakan. Kamu akan diminta pertanggungjawaban dan mendapat balasan atas amal perbuatan kamu."
  }
]