[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sekiranya Allah menghendaki, pastilah Dia akan memberikan taufik kepada kalain semuanya, lalu menjadikan kalian diatas satu ajaran agama, yaitu islam dan iman dan memastikan kalian dengannya. Akan tetapi, Dia menyesatkan siapa saja yang Dia kehendaki dari orang yang Dia mengetahui dirinya lebih menyukai kesesatan, sehingga DIa tidak memberikan hidayah kepadanya sebagai bentuk keadilan dariNya, dan Dia memberikan hidayah kepada siapa saja yang dikehendakiNya dari orang yang Dia ketahui bahwa orang tersebut lebih mementingkan kebenaran, lalu memberikan taufik kepadanya sebagai karunia dariNya. Dan sungguh Allah akan benar-benar bertanya kepada kalian semua pada hari kiamat tentang apa yang kalian perbuat di dunia terkait perkara apa yang diperintahkanNya kepada kalian dan perkara yang Dia larang kalian darinya, dan akan membalas kalian atas dasar semua itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "93. Seandainya Allah berkehendak niscaya Dia menjadikan kalian umat yang satu sepakat di atas kebenaran, akan tetapi Allah menyesatkan siapa yang Dia kehendaki dengan tidak membimbingnya kepada kebenaran maupun memenuhi perjanjian dengan keadilan-Nya, Dia membimbing siapa yang Dia kehendaki pada kebenaran dengan karuina-Nya. Kalian pasti akan ditanya tentang apa yang kalian lakukan di dunia."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "93. Hai Manusia, seandainya Allah menghendaki niscaya Dia akan menjadikan kalian satu umat yang tidak saling berselisih, akan tetapi Allah tidak menghendaki hal itu agar kalian dapat memilih apakah kalian akan bersama orang-orang beriman atau orang-orang kafir. Sehingga dengan kehendak-Nya, Allah menyesatkan orang yang Allah ketahui akan memilih kesesatan dan memberi petunjuk kepada orang yang Allah ketahui akan memilih kebenaran dan hidayah. Sungguh pada hari kiamat kalian akan ditanya tentang amal perbuatan yang telah kalian kerjakan di dunia, kemudian Allah akan membalas amalan tersebut."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "93. وَلَوْ شَآءَ اللهُ لَجَعَلَكُمْ أُمَّةً وٰحِدَةً (Dan kalau Allah menghendaki, niscaya Dia menjadikan kamu satu umat) Yakni yang bersepakat dalam kebenaran. وَلٰكِن(tetapi) Dengan ketetapan Allah. يُضِلُّ مَن يَشَآءُ(Allah menyesatkan siapa yang dikehendaki-Nya) Dengan menghinakan mereka sebagai bentuk keadilan Allah bagi mereka, sehingga mereka menganggap remeh pelanggaran terhadap perjanjian. وَيَهْدِى مَن يَشَآءُ ۚ( dan memberi petunjuk kepada siapa yang dikehendaki-Nya) Dengan memberi mereka taufik-Nya sebagai bentuk kemurahan-Nya. وَلَتُسْـَٔلُنَّ (Dan sesungguhnya kamu akan ditanya) Di hari kiamat. عَمَّا كُنتُمْ تَعْمَلُونَ (tentang apa yang telah kamu kerjakan) Yakni tentang amalan-amalan mereka di dunia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "93. Dan jika berkehendak, sungguh Allah akan menjadikan kalian berada pada satu agama. Akan tetapi Dia membiarkan kalian untuk memilih jalan sendiri sehingga di antara kalian ada yang mukmin da nada yang kafir. Dan sesuai ketentuanNya yang umum, Allah menjadikan manusia itu untuk sengsara, tersesat dan rusak. Mereka itu belum tersentuh dengan sebab-sebab terjadinya pemberian hidayah. Dia juga menjadikan manusia lainnya untuk bahagia, dan mendapat petunjuk menuju kebenaran. Mereka itu adalah orang-orang yang mendapatkan petunjuk dengan ayat-ayat Allah. Melalui sudut pandang inilah Allah menciptakan kesesatan dan petunjuk. Dan akan ada pertanggungjawaban atas perbuatan yang kalian usahakan di dunia"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika Allah berkehendak, niscaya Dia menjadikan kalian satu umat} pemeluk satu agama yaitu Islam {Akan tetapi Dia menyesatkan siapa saja yang Dia kehendaki dan memberi petunjuk siapa saja yang Dia kehendaki. Sungguh kalian akan ditanya tentang apa yang kalian kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "93. Maksudnya, “Dan kalau Allah menghendaki,” niscaya Dia menyatukan manusia di atas petunjuk dan menjadikan kalian “satu umat (saja),” akan tetapi, Allah-lah satu-satunya yang memegang kendali hidayah dan penyesatan. Pemberian hidayah dan penyesatanNya termasuk dalam perbatan-perbuatan Allah yang mengacu pada ilmu dan hikmahNya. Dia memberikan hidayah kepada orang yang berhak sebagai bentuk keutamaanNya, dan Dia menghalang-halangi hidayah dari orang yang tidak pantas menerimanya sebagai bentuk keadilanNya. “Dan sesungguhnya kamu akan ditanya tentang apa yang telah kamu kerjakan,” berupa perbuatan yang baik dan buruk. Allah akan membalas mereka atas amal perbuatan mereka dengan balasan yang seetimpal dan paling adil."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat: Firman-Nya “Dan kalau Allah menghendaki, niscaya Dia menjadikan kamu satu umat (saja)” berada di atas tauhid dan hidayah, niscaya Allah akan melakukannya. Namun, karena hikmah-Nya yang tinggi, Dia memberikan petunjuk kepada yang Dia kehendaki, karena ia menginginkan dan mencarinya, serta menyesatkan siapa yang dia kehendaki, karena dia menginginkan dan mencarinya, serta terus berada di dalam kesesatan setelah dilarang darinya. Firman-Nya “Dan sesungguhnya kamu akan ditanya” yaitu pertanyaan celaan “tentang apa yang telah kamu kerjakan.” Berupa keburukan dan hal yang batil, yang demikian mengharuskan adanya balasan yang adil. “Barangsiapa yang mengerjakan kebaikan, maka baginya sepuluh kali lipat kebaikan, dan barangsiap yang berbuat kejelekan maka tidak akan dibalas melainkan dengan keburukan yang serupa dan mereka sama sekali tidak terzalimi.” [QS. Al-An’am:160]"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 93: Di atas satu agama, yaitu Islam. Akan tetapi hidayah dan penyesatan-Nya termasuk perbuatan-Nya yang mengikuti ilmu dan kebijaksanaan-Nya, Dia memberikan hidayah kepada yang berhak menerimanya kaena karunia-Nya, dan menyesatkan kepada yang layak disesatkan karena keadilan-Nya. Baik atau buruk, untuk diberi-Nya balasan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 93",
    "description": "Usai mengisyaratkan adanya perselisihan di antara umat manusia dalam beberapa persoalan kehidupan, pada ayat ini Allah menyatakan kekuasaannya untuk menghilangkan perselisihan itu seandainya dia berkehendak. Dan jika Allah menghendaki kamu menjadi satu umat, niscaya dia menjadikan kamu satu umat yang memiliki satu pendapat saja, tanpa ada perselisihan sedikit pun di antara kamu, tetapi Allah tidak berbuat demikian karena dia memberi manusia kebebasan untuk memilih jalan sesuai kemauannya: yang sesat atau yang lurus. Dia menyesatkan siapa yang dia kehendaki atas pilihannya memilih jalan kesesatan, dan memberi kemampuan untuk melaksanakan petunjuk kepada siapa yang dia kehendaki, juga atas pilihannya memilih jalan petunjuk. Tetapi, kamu pasti akan ditanya tentang apa yang telah kamu kerjakan. Kamu akan diminta pertanggungjawaban dan mendapat balasan atas amal perbuatan kamu. Dan janganlah kamu berkhianat dengan men-jadikan sumpah-sumpahmu sebagai alat penipu di antaramu, yang menyebabkan kaki-Mu tergelincir dan terjatuh setelah tegak dan mantap-Nya di jalan yang benar. Dan kamu akan terus merasakan keburukan di dunia karena dengan berkhianat maka kepercayaan kepadamu akan hilang. Bila hal itu terjadi maka kamu telah menghalangi siapa pun, baik dirimu sendiri maupun orang lain, dari jalan Allah, dan akibat dari perbuatan itu kamu akan mandapat azab yang besar di akhirat jika kamu tidak bertobat kepada Allah."
  }
]