[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan janganlah kalian menjadikan dari sumpah-sumpah yang kalian ucapkan sebagai alat tipu daya terhadap orang-orang yang kalian bersumpah di hadapan mereka, akibatnya kalian akan binasa setelah sebelumnya kalian menikmati keadaan aman, seperti orang yang terpeleset kakinya setelah berpijak teguh, dan kalian akan merasakan siksaan yang menyakiti kalian di dunia lantaran usaha yang kalain tempuh untuk menghalangi orang lain dari agama ini dikarenakan mereka menyaksikan penghianatan terhadap janji pada diri kalian, dan bagi kalian di akhirat kelak siksaan yang besar."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "94. Jangan jadikan sumpah kalian sebagai alat menipu oleh sebagian kalian atas sebagian lainnya, dengannya kalian mengikuti hawa nafsu, kalian membatalkan kapan kalian hendak membatalkan, kalian memenuhi kapan kalian hendak memenuhi, karena jika kalian melakukan demikian, niscaya kaki-kaki kalian terpeleset dari jalan yang lurus setelah sebelumnya ia kokoh di atasnya, kalian akan merasakan azab karena kesesatan kalian dari jalan Allah dan kalian menyesatkan orang lain dari jalan Allah, maka azab atas kalian berlipat ganda."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "94. Untuk penegasan, Allah mengulangi larangan-Nya tentang bersumpah dengan tujuan menipu dan membuat makar, karena hal ini dapat memalingkan seseorang dari keistiqomahan dan kebenara, dan dapat menyebabkan seseorang mendapat azab di dunia karena telah menjerumuskan orang lain dengan memberi contoh buruk dalam penipuan; dan di akhirat dia akan mendapat azab yang sangat menyakitkan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "94. وَلَا تَتَّخِذُوٓا۟ أَيْمٰنَكُمْ دَخَلًۢا بَيْنَكُمْ (Dan janganlah kamu jadikan sumpah-sumpahmu sebagai alat penipu di antaramu) Yang dimaksud adalah sumpah dalam berbaiat. Orang-orang yang telah membaiat Rasulullah dilarang untuk membatalkan perjanjian mereka untuk membela agama. فَتَزِلَّ قَدَمٌۢ بَعْدَ ثُبُوتِهَا(yang menyebabkan tergelincir kaki(mu) sesudah kokoh tegaknya) Yakni sehingga kalian melakukan kesalahan besar akibat melanggar perjanjian, dan bisa jadi itu akan menjadi sebab kebinasaannya, padahal sebelumnya ia telah teguh dalam memegang perjanjian. وَتَذُوقُوا۟ السُّوٓءَ بِمَا صَدَدتُّمْ عَن سَبِيلِ اللهِ ۖ( dan kamu rasakan kemelaratan (di dunia) karena kamu menghalangi (manusia) dari jalan Allah) Sebab orang yang melanggar baiat dan murtad akan menjadi panutan bagi orang lain dalam hal tersebut, sehingga perbuatannya menjadi contoh buruk bagi orang lain, dan menjadikannya harus memiluk dosanya dan dosa orang yang mengikutinya. وَلَكُمْ عَذَابٌ عَظِيمٌ (dan bagimu azab yang besar) Yakni azab di akhirat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "94. Dan janganlah kalian mengambil perjanjian dengan bersumpah, yaitu perjanjian jual beli yang bertujuan untuk menipu dan memperdaya, lalu kalian berlindung dengan mengkhianati dan membatalkannya. Kalian akan ditunjukkan kepada azab di dunia karena kalian tidak mau menepati janji dan membuat orang lain meniru kalian untuk melakukan pembatalan itu. Dan bagi kalian itu azab yang besar, yaitu azab akhirat. Perlu diperhatikan bahwa larangan untuk membatalkan janji pada ayat sebelumnya (91) adalah untuk menjelaskan penyebab suatu pembatalan janji, sedangkan ayat ini menjelaskan tentang akibatnya, yaitu merugi dan mendapatkan azab"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Janganlah menjadikan sumpah-sumpah kalian sebagai alat menipu} alat untuk berkhianat dan menipu {di antara kalian, yang menggelincirkan kaki} lalu kaki kalian menyimpang dari arah kebenaran {setelah tegaknya} tegak dan teguhnya kaki itu atas kebenaran {dan kalian akan merasakan keburukan} azab {karena kalian menghalangi dari jalan Allah dan bagi kalian azab yang besar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "94. “Dan janganlah kamu jadikan sumpah-sumpah padamu,” dan perjanjian-perjanjian serta fakta kerjasamamu memperturutkan hawa nafsu kalian. Kapan kalian mau menepatinya, maka kalian jalankan, dan kapan saja kalian ingin membatalkan, maka (langsung) kalian lakukan. Sesungguhnya jika kalian berbuat semacam ini, niscaya kaki kalian tergelincir sesudah kokoh tegaknya di atas jalan lurus “dan kamu rasakan keburukan,” maksudnya siksa yang memperburuk dan menyedihkan kalian “karena kamu menghalangi (manusia) dari jalan Allah,” lantaran kalian telah sesat dan menyesatkan orang lain “dan kamu mendapatkan azab yang pedih,” yang berlipat-lipat."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (دَخَلَۢا بَيۡنَكُمۡ) : “dakhalan bainakum” : untuk merusak dan menipu. (وَتَذُوقُواْ ٱلسُّوٓءَ) wa tadzuuqus suu` : kalian merasakan azab. Makna ayat: Pembahasan ayat masih seputar pendidikan bagi orang-orang yang beriman, mereka adalah ahlul qur’an, yang mana Al-Qur’an merupakan penjelas segala sesuatu, petunjuk, rahmat dan kabar gembira bagi orang-orang yang berserah diri. Allah ta’ala berfirman kepada mereka “Dan janganlah kalian menjadikan sumpah-sumpah kalian sebagai alat menipu di antara kalian” untuk mendapat hal duniawi yang rendah “yang menyebabkan kakii tergelincir sesudah kokoh tegaknya” salah satu di antara kalian terjatuh pada dosa besar karena hal ini, bersumpah atas nama Allah untuk menipu dan menyesatkan, sehingga kalian merasakan keburukan di dunia, karena kalian telah menghalangi orang-orang dari jalan Allah. Yaitu terhadap orang yang mengadakan perjanjian atau baiat lalu kalian bersumpah, akan tetapi kalian melanggarnya, sehingga mereka berpaling dari Islam dan kamu menanggung dosa-dosa itu, dan bagi kalian azab yang besar pada hari kiamat kelak. Maka berhati-hatilah dari terjatuh kepada hal ini, dan jangan sampai salah satu dari kalian tergelincir dari Islam setelah kalian kuat di atasnya. Pelajaran dari ayat: • Haram menjadikan sumpah sebagai jalan untuk berbuat curang, menipu, dan kerusakan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 94: Diulangi lagi larangan ini untuk menguatkan. Dari jalan Islam, di mana jika kamu mau, kamu akan memenuhi dan jika kamu mau, kamu melanggar sesuai hawa nafsumu sehingga kakimu tergelincir dari jalan yang lurus. Yakni hukuman. Yaitu karena kamu tersesat dan menyesatkan yang lain atau dengan menghalangi orang lain memenuhi janji."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 94",
    "description": "Dan janganlah kamu berkhianat dengan men-jadikan sumpah-sumpahmu sebagai alat penipu di antaramu, yang menyebabkan kaki-Mu tergelincir dan terjatuh setelah tegak dan mantap-Nya di jalan yang benar. Dan kamu akan terus merasakan keburukan di dunia karena dengan berkhianat maka kepercayaan kepadamu akan hilang. Bila hal itu terjadi maka kamu telah menghalangi siapa pun, baik dirimu sendiri maupun orang lain, dari jalan Allah, dan akibat dari perbuatan itu kamu akan mandapat azab yang besar di akhirat jika kamu tidak bertobat kepada Allah. Dan, wahai orang-orang yang beriman, janganlah kamu jual dan tukarkan perjanjian yang telah kamu ikrarkan dan kukuhkan dengan nama Allah dengan kenikmatan duniawi yang fana, sebanyak apa pun yang kamu dapatkan. Setinggi apa pun nilai yang kamu dapat dan sebanyak apa pun jumlah yang kamu peroleh dari penukaran itu, nilai dari semua itu adalah harga yang murah, sedikit, dan segera musnah, karena sesungguhnya apa yang ada di sisi Allah, yaitu pahala dan imbalan yang dia siapkan untukmu sebagai balasan atas keteguhanmu menjaga perjanjian dengan-Nya, adalah lebih baik bagimu jika kamu adalah orang yang benar-benar mengetahui."
  }
]