[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan janganlah kalian membatalkan perjanjian dengan Allah, untuk menggantinya dengan kekayaan yang sedikit dari kesenangan dunia. Sesungguhnya apa yang ada di sisi Allah berupa pahala atas menepati perjanjian adalah lebih utama bagi kalian daripada imbalan harga yang sedikit tersebut, jika kalian termasuk orang-orang yang berilmu. Maka renungilah perbedaan antara kebaikan dunia dan kebaikan akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "95. Jangan kalian menjual perjanjian Allah dengan uang yang tidak seberapa dengan membatalkan perjanjian tersebut dan tidak memenuhinya, karena sesungguhnya apa yang ada di sisi Allah berupa kemenangan dan harta rampasan perang di dunia, dan apa yang ada di sisi Allah di Akhirat berupa kenikmatan abadi adalah lebih baik bagi kalian daripada apa yang kalian dapatkan berupa uang yang tidak seberapa sebagai imbalan pembatalan kalian terhadap perjanjian, jika kalian mengetahui hal itu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "95. Dan janganlah kalian menukar pemenuhan janji kepada Allah dengan kenikmatan dunia yang tak seberapa ini, meskipun dalam pandangan kalian kenikmatan itu sangat besar. Karena sesungguhnya pahala di sisi Allah atas pemenuhan janji lebih berharga dan lebih mulia daripada kenikmatan dunia tersebut jika kalian benar-benar mengetahui perniagaan sesungguhnya yang dapat mendatangkan keuntungan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "95. وَلَا تَشْتَرُوا۟ بِعَهْدِ اللهِ ثَمَنًا قَلِيلًا ۚ (Dan janganlah kamu tukar perjanjianmu dengan Allah dengan harga yang sedikit) Yakni dengan imbalan murahan, yaitu segala imbalan keduniaan meskipun itu tampak banyak, sebab sebanyak apapun itu tetap saja tidak dapat mengimbangi akibat dari pengkhianatan terhadap janji. إِنَّمَا عِندَ اللهِ هُوَ خَيْرٌ لَّكُمْ (sesungguhnya apa yang ada di sisi Allah, itulah yang lebih baik bagimu) Berupa kemenangan, harta ghanimah, dan keluasan rezeki di dunia, serta kenikmatan surga di akhirat; hal-hal tersebut lebih baik daripada apa yang kalian harapkan dari hasil pengkhianatan dan pelanggaran perjanjian. إِن كُنتُمْ تَعْلَمُونَ (jika kamu mengetahui) Yakni jika kalian adalah orang-orang yang berilmu dan dapat membedakan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "95-96 1 ). Hafsoh binti Sirin pernah memiliki seorang anak laki-laki yang sangat berkat kepadanya, dan anak itu meninggal dunia, Hafsoh kemudian berkata : Sesungguhnya Allah telah memberikan rezeki kepadanya berupa kesabaran yang tinggi, namun ada susatu yang menganjal dalam hati atas kepergian anakku ini, dan pada suatu malam aku membaca surah an-Nahl, tatkala aku sampai pada ayat : { وَلَا تَشْتَرُوا بِعَهْدِ اللَّهِ ثَمَنًا قَلِيلًا ۚ إِنَّمَا عِنْدَ اللَّهِ هُوَ خَيْرٌ لَكُمْ إِنْ كُنْتُمْ تَعْلَمُونَ } \"Dan janganlah kamu tukar perjanjianmu dengan Allah dengan harga yang sedikit (murah), sesungguhnya apa yang ada di sisi Allah, itulah yang lebih baik bagimu jika kamu mengetahui\" { مَا عِنْدَكُمْ يَنْفَدُ ۖ وَمَا عِنْدَ اللَّهِ بَاقٍ ۗ وَلَنَجْزِيَنَّ الَّذِينَ صَبَرُوا أَجْرَهُمْ بِأَحْسَنِ مَا كَانُوا يَعْمَلُونَ } \"Apa yang di sisimu akan lenyap, dan apa yang ada di sisi Allah adalah kekal. Dan sesungguhnya Kami akan memberi balasan kepada orang-orang yang sabar dengan pahala yang lebih baik dari apa yang telah mereka kerjakan\" Maka akupun sadar bahwasanya Allah telah mengambil apa yang pernah aku punya. 2 ). Al-Ghazali mengatakan : aku melihat kepada alam ini, lalu aku memperhatikan segala sesuatu berharga yang ada di dalamnya, kemudian aku membaca ayat Allah : { مَا عِنْدَكُمْ يَنْفَدُ ۖ وَمَا عِنْدَ اللَّهِ بَاقٍ } \"Apa yang di sisimu akan lenyap, dan apa yang ada di sisi Allah adalah kekal\" maka setiap aku menemukan sesuatu yang berharga aku langsung mengembalikannya kepada Allah; agar semuanya terjaga di sisinya. 3 ). Siapapun yang bersiap untuk pertemuan dengan Allah; ia akan memutuskan semua ikatan hatinya dengan dunia dan semua tawaran-tawaran yang menggiurkan, lalu ia mengubur dari drinya api syahwat, dan mengalihkan hatinya kepada Allah, dan semua hasratnya didekasikan untuk Allah dan karena mengharap cinta dan keridhoan-Nya : { مَا عِنْدَكُمْ يَنْفَدُ ۖ وَمَا عِنْدَ اللَّهِ بَاقٍ } ."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "95. Janganlah kalian menukar janji Allah dan perniagaan rasulNya untuk beramal sesuai syariatNya dengan ganti yang murah, yaitu dengan membatalkan janji itu karena ganti tersebut. Kenikmatan dunia itu sedikit meskipun jumlahnya banyak. Sesungguhnya apa yang ada di sisi Allah berupa balasan atas pemenuhan janji dengan memberi pertolongan dan rampasan perang di dunia serta nikmat di surga itu lebih baik dan lebih utama bagi kalian daripada rejeki dunia. Jika kalian termasuk orang yang memiliki ilmu dan bisa membedakan (baik dan buruk) maka janganlah membatalkan janji"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Janganlah menjual} menukar {perjanjian (dengan) Allah dengan harga murah} barang yang remeh yaitu dunia {Sesungguhnya yang ada di sisi Allah itu yang lebih baik bagi kalian jika kalian mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "95. Allah memperingatkan para hambaNya dari (tindakan) membatalkan janji-janji dan sumpah-sumpah karena (ingin mendapatkan) kenikmatan dan kekayaan dunia. Allah berfirman, “Dan janganlah kamu tukar perjanjianmu dengan Allah dengan harga yang sedikit (murah),” yaitu kalian mendapatkan dunia (ditukar) dengan membatalkan dan tidak menepatinya. “Sesungguhnya apa yang ada di sisi Allah,” berupa balasan segera (di dunia) dan ganjaran menyusul (di akhirat) adalah bagi orang yang lebih mengutamakan ridha Allah dan menepati apa yang telah dia tetapkan kepada Allah “itulah yang lebih baik bagimu,” daripada kenikmatan dunia yang fana “jika kamu mengetahui.”"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat: Firman-Nya “Dan janganlah kalian menjual perjanjian kalian dengan Allah dengan harga yang sedikit” dan seluruh yang ada di dunia adalah sedikit. Firman-Nya “Dan apa yang ada di sisi Allah lebih baik bagi kalian” tentu. Pelajaran dari ayat: • Apa yang ada di sisi Allah lebih baik dari apa yang seorang peroleh dengan cara bermaksiat kepada Allah, karena segelintir dari dunia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 95: Dalam ayat ini, Allah Subhaanahu wa Ta'aala memperingatkan hamba-hamba-Nya agar tidak membatalkan perjanjian karena kepentingan duniawi. Yaitu perhiasan dunia. Berupa pahala dan balasan di dunia dan di akhirat bagi orang yang mengutamakan keridhaan-Nya dan memenuhi janjinya. Daripada perhiasan dunia yang akan lenyap."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 95",
    "description": "Dan, wahai orang-orang yang beriman, janganlah kamu jual dan tukarkan perjanjian yang telah kamu ikrarkan dan kukuhkan dengan nama Allah dengan kenikmatan duniawi yang fana, sebanyak apa pun yang kamu dapatkan. Setinggi apa pun nilai yang kamu dapat dan sebanyak apa pun jumlah yang kamu peroleh dari penukaran itu, nilai dari semua itu adalah harga yang murah, sedikit, dan segera musnah, karena sesungguhnya apa yang ada di sisi Allah, yaitu pahala dan imbalan yang dia siapkan untukmu sebagai balasan atas keteguhanmu menjaga perjanjian dengan-Nya, adalah lebih baik bagimu jika kamu adalah orang yang benar-benar mengetahui. Ketahuilah, wahai manusia, bahwa apa yang ada di sisimu, berupa kenikmatan duniawi, suatu saat nanti pasti akan lenyap, hancur, hilang, dan berakhir, dan apa yang ada di sisi Allah, berupa kenikmatan ukhrawi dan balasan amal baik yang akan kamu peroleh adalah kekal dan kamu akan senantiasa mendapatkannya secara abadi. Dan ketahuilah, wahai orang yang beriman, bahwa kami pasti akan memberi balasan yang setimpal kepada orang yang sabar dalam melaksanakan tuntunan Allah dan meninggalkan larangan-Nya, dengan pahala yang berlipat ganda dan lebih baik dari apa yang telah mereka kerjakan."
  }
]