[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "apa yang ada di sisi kalian berupa harta benda dunia akan lenyap. Sedangkaan apa yang ada di sisi Allah bagi kalian berupa rizki, dan pahala, tidak akan pernah sirna. Dan sungguh Kami akan memberikan balasan pahala bagi orang-orang yang mau bersusah payah mengemban beban-beban taklif, (termasuk di dalamnya menepati janji) dengan balasan yang lebih baik dari amal perbuatan mereka. Kami memberikan pahala kepada mereka atas amal perbuatan mereka yang terendah sebagaimana Kami pun memberikan balasan kepada mereka atas amal-amal tertinggi mereka sebagai karunia dari kami."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "96. Apa yang ada di sisi kalian wahai manusia berupa harta, kesenangan dan kenikmatan pasti akan berakhir sekalipun ia banyak, sedangkan apa yang ada di sisi Allah berupa balasan maka ia kekal. Bagaimana kalian mementingkan sesuatu yang fana atas sesuatu yang abadi? Kami akan membalas orang-orang yang sabar menjaga perjanjian mereka dengan tidak melanggarnya, dengan pahala yang lebih baik daripada apa yang mereka lakukan di dunia berupa ketaatan-ketaatan, Allah membalas kebaikan dengan sepuluh kebaikan, hingga tujuh ratus ataupun hingga kelipatan-kelipatan yang banyak."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "96. Harta yang kalian miliki di dunia seberapapun banyaknya, itu tetaplah sesuatu yang akan sirna. Namun apa yang ada di sisi Allah yang Maha Kaya itulah yang akan kekal. Sungguh kami akan membalas orang-orang yang sabar atas ketaatan mereka kepada Allah, dan pasti Kami akan memberi mereka balasan yang sempurna atas kebaikan amal perbuatan mereka dan Kami akan mengampuni kesalahan-kesalahan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "96. مَا عِندَكُمْ يَنفَدُ ۖ (Apa yang di sisimu akan lenyap) Akan sirna meski dengan jumlah yang tak terhitung. Adapun kenikmatan akhirat akan senantiasa kekal tak terputus. وَلَنَجْزِيَنَّ الَّذِينَ صَبَرُوٓا۟ أَجْرَهُم بِأَحْسَنِ مَا كَانُوا۟ يَعْمَلُونَ (sesungguhnya Kami akan memberi balasan kepada orang-orang yang sabar dengan pahala yang lebih baik dari apa yang telah mereka kerjakan) Yakni Kami pasti akan membalas mereka berkat kesabaran mereka untuk tetap teguh memegang perjanjian dengan Rasulullah dan keistiqamahan dalam menjalankan beban syariat, dan berjihad memerangi orang-orang kafir; serta kesabaran mereka atas permusuhan yang mereka dapatkan dari orang-orang kafir. Kami akan membalas mereka dengan sesuatu yang lebih baik dari ketaatan yang telah mereka kerjakan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "95-96 1 ). Hafsoh binti Sirin pernah memiliki seorang anak laki-laki yang sangat berkat kepadanya, dan anak itu meninggal dunia, Hafsoh kemudian berkata : Sesungguhnya Allah telah memberikan rezeki kepadanya berupa kesabaran yang tinggi, namun ada susatu yang menganjal dalam hati atas kepergian anakku ini, dan pada suatu malam aku membaca surah an-Nahl, tatkala aku sampai pada ayat : { وَلَا تَشْتَرُوا بِعَهْدِ اللَّهِ ثَمَنًا قَلِيلًا ۚ إِنَّمَا عِنْدَ اللَّهِ هُوَ خَيْرٌ لَكُمْ إِنْ كُنْتُمْ تَعْلَمُونَ } \"Dan janganlah kamu tukar perjanjianmu dengan Allah dengan harga yang sedikit (murah), sesungguhnya apa yang ada di sisi Allah, itulah yang lebih baik bagimu jika kamu mengetahui\" { مَا عِنْدَكُمْ يَنْفَدُ ۖ وَمَا عِنْدَ اللَّهِ بَاقٍ ۗ وَلَنَجْزِيَنَّ الَّذِينَ صَبَرُوا أَجْرَهُمْ بِأَحْسَنِ مَا كَانُوا يَعْمَلُونَ } \"Apa yang di sisimu akan lenyap, dan apa yang ada di sisi Allah adalah kekal. Dan sesungguhnya Kami akan memberi balasan kepada orang-orang yang sabar dengan pahala yang lebih baik dari apa yang telah mereka kerjakan\" Maka akupun sadar bahwasanya Allah telah mengambil apa yang pernah aku punya. 2 ). Al-Ghazali mengatakan : aku melihat kepada alam ini, lalu aku memperhatikan segala sesuatu berharga yang ada di dalamnya, kemudian aku membaca ayat Allah : { مَا عِنْدَكُمْ يَنْفَدُ ۖ وَمَا عِنْدَ اللَّهِ بَاقٍ } \"Apa yang di sisimu akan lenyap, dan apa yang ada di sisi Allah adalah kekal\" maka setiap aku menemukan sesuatu yang berharga aku langsung mengembalikannya kepada Allah; agar semuanya terjaga di sisinya. 3 ). Siapapun yang bersiap untuk pertemuan dengan Allah; ia akan memutuskan semua ikatan hatinya dengan dunia dan semua tawaran-tawaran yang menggiurkan, lalu ia mengubur dari drinya api syahwat, dan mengalihkan hatinya kepada Allah, dan semua hasratnya didekasikan untuk Allah dan karena mengharap cinta dan keridhoan-Nya : { مَا عِنْدَكُمْ يَنْفَدُ ۖ وَمَا عِنْدَ اللَّهِ بَاقٍ } ."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "96. Apa yang ada di sisi kalian berupa kebaikan dan nikmat dunia itu akan menghilang dan tiada sekalipun itu jumlahnya banyak. Dan apa yang ada di sisi Allah berupa kenikmatan akhirat itu abadi selamanya dan tidak akan sirna. Dan sungguh Kami akan membalas orang-orang yang bersabar untuk menepati janji dengan balasan yang lebih baik dari amal mereka karena kesabaran mereka untuk menunaikan janji mereka dengan Nabi."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apa yang ada di sisi kalian akan lenyap} akan hilang dan lenyap {dan apa yang ada di sisi Allah itu kekal. Kami benar-benar akan memberi balasan kepada orang-orang yang sabar dengan pahala yang lebih baik daripada apa yang selalu mereka kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "96. Maka utamakanlah kenikmatan yang lestari di atas kenikmatan yang fana. Sesungguhnya “apa yang ada di sisimu,” meskipun berjumlah banyak sekali, pasti akan lenyap dan hilang “dan apa yang ada di sisi Allah adalah kekal,” dengan keabadian yang Allah tetapkan baginya, tidak hilang dan tidak sirna. Maka bukanlah insan yang cerdik orang yang lebih mengedepankan barang yang (akan) sirna lagi bernilai rendah di atas kenikmatan yang lestari lagi bernilai tinggi. Pengertian ini senada dengan kandungan Firman Allah, \"Tetapi kamu (orang-orang kafir) memilih kehidupan duniawi. Sedang kehidupan akhirat adalah lebih baik dan lebih kekal.\" (Al-A’la:16-17) \"Dan apa yang di sisi Allah adalah lebih baik bagi orang-orang yang berbakti.\" (Ali Imran: 198). Padanya terdapat himbauan dan anjuran untuk bersifat zuhud di dunia, terutama sifat zuhud yang sudah semestinya ditempuh. Yaitu zuhud dari perkara-perkara yang akan menjadi bahaya pada seorang hamba dan menimbulkan kesibukan seorang hamba sehingga melupakan hal-hal yang diwajibkan Allah atas dirinya dan mendahulukannya atas hak Allah. Sesungguhnya zuhud inilah yang mesti ada. Di antara faktor pendorong untuk berzuhud, adalah hendanya seorang hamba membandingkan kenikmatan-kenikmatan dunia dan godaan-godaan syahwatnya dengan kebaikan-kebaikan di akhirat. (Dengan itu), dia akan menjumpai perbedaan dan jenjang yang berpotensi mengajaknya untuk lebih mengutamakan perkara yang paling luhur dari dua perkara itu. Bukanlah termasuk zuhud yang terpuji, yaitu dengan mengasingkan diri untuk beribadah saja dengan ibadah qashirah (yang hanya bermanfaat bagi dirinya sendiri), seperti Shalat, puasa, dzikir dan lainnya. Bahkan seorang hamba tidak disebut zuhud dengan cara yang benar, sampai dia mengerjakan perintah-perintah agama yang mampu dia kerjakan, yang zahir dan batin, dakwah kepada Allah dan kepada agamaNya melalui ucapan dan tindakan. Zuhud yang sebenarnya, ialah merasa tidak butuh kepada sesuatu yang tidak bermanfaat bagi agama dan dunia, dan beranimo serta berusaha berbuat yang bermanfaat. “Dan sesungguhnya Kami akan memberi balasan kepada orang-orang yang sabar,” atas ketaatan kepada Allah dan bersabar dari maksiat kepadaNya dan mengekang jiwa-jiwa mereka dari jeratan syahwat dunia yang berbahaya bagi agamanya, “dengan pahala yang lebih baik dari apa yang telah mereka kerjakan,” satu kebaikan diganjar sepuluh kali lipat sampai tujuh ratus kali lipat, sampai penggandaan hitungan yang banyak sekali. Sesungguhnya Allah tidak menyia-nyiakan pahala orang yang berbuat baik."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (مَا عِندَكُمۡ يَنفَدُ) maa ‘indakum yanfad : apa yang ada di sisi kalian akan hilang dan habis. Makna ayat: Karena apa yang kalian miliki berupa harta atau perhiasan akan habis dan hilang, “dan apa yang ada di sisi Allah adalah kekal” tidak akan habis, ingatlah itu, dan jangan jual sesuatu yang mahal dengan yang murah, dan yang kekal dengan yang fana. Firman-Nya “Dan sungguh Kami akan ganjar orang-orang yang sabar” atas janji mereka “pahala mereka” atas kesabaran mereka “dengan pahala yang lebih baik dari apa yang mereka kerjakan” melipat gandakan pahala mereka, Allah memberikan dari setiap amalan kebaikan dan balasan yang lebih baik sesuai dengan keutamaan dan kesempurnaan amal tersebut, sehingga pahala ibadah sunnah setara dengan pahala ibadah wajib. Ini adalah janji dari Allah ta’ala untuk mereka yang bersabar di atas iman dan Islam, serta tidak menjual agama mereka dengan segelintir dari dunia. Pelajaran dari ayat: • Besarnya pahala sabar di atas ketaatan kepada Allah ta’ala dengan melaksanakan kewajiban dan meninggalkan larangan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 96: Dari perhiasan dunia. Oleh karena itu, utamakanlah yang kekal daripada yang fana. Dalam ayat ini terdapat dorongan untuk bersikap zuhud (tidak berlebihan) terhadap dunia, dan bahwa di antara cara untuk bersikap zuhud adalah dengan membandingkan kenikmatan dunia dengan kenikmatan akhirat, di mana dia akan menemukan perbedaan yang mencolok antara keduanya. Karena memenuhi janji, atau sabar dengan tetap menaati Allah dan tetap menjauhi maksiat. Satu kebaikan dilipatgandakan menjadi sepuluh, dan terus meningkat menjadi tujuh ratus dan meningkat sampai kelipatan yang banyak, karena Allah tidak akan menyia-nyiakan orang yang memperbagus amalan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 96",
    "description": "Ketahuilah, wahai manusia, bahwa apa yang ada di sisimu, berupa kenikmatan duniawi, suatu saat nanti pasti akan lenyap, hancur, hilang, dan berakhir, dan apa yang ada di sisi Allah, berupa kenikmatan ukhrawi dan balasan amal baik yang akan kamu peroleh adalah kekal dan kamu akan senantiasa mendapatkannya secara abadi. Dan ketahuilah, wahai orang yang beriman, bahwa kami pasti akan memberi balasan yang setimpal kepada orang yang sabar dalam melaksanakan tuntunan Allah dan meninggalkan larangan-Nya, dengan pahala yang berlipat ganda dan lebih baik dari apa yang telah mereka kerjakan. Barang siapa mengerjakan kebajikan sekecil apa pun, baik dia laki-laki maupun perempuan, dalam keadaan beriman dan dilandasi keikhlasan, maka pasti akan kami berikan kepadanya kehidupan yang baik di dunia dan akan kami beri dia balasan di akhirat atas kebajikannya dengan pahala yang lebih baik dan berlipat ganda dari apa yang telah mereka kerjakan."
  }
]