[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian, bila kamu (wahai orang mukmin) hendak membaca sebagian dari al-qur’an, maka mintalah perlindungan kepada Allah dari keburukan setan yang terusir dari rahmat Allah dengan membaca, ”a’udzu billahi minasy syaithanirrajiim”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "98. Bila kamu hendak membaca Al-Qur`ān -wahai Mukmin- maka mintalah kepada Allah perlindungan dari was-was setan yang terusir dari rahmat Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "98-100. Hai orang yang beriman, Jika kamu hendak membaca al-Qur'an maka mintalah kepada Allah agar menjagamu dari godaan setan yang telah dijauhkan dari rahmat Allah yang mencegahmu untuk mentadaburi al-Qur'an, yaitu dengan mengucapkan: “Aku berlindung kepada Allah dari setan yang terkutuk”, dengan menghayati maknanya. Setan itu tidak dapat menguasai orang-orang yang beriman kepada Allah dan rasul-Nya dan senantiasa bertawakal kepada-Nya; akan tetapi setan itu hanya dapat menguasai orang-orang yang mentaatinya dan menjadikannya sebagai penolong, sehingga dengan godaan setan mereka menjadi orang-orang yang menyekutukan Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "98. فَإِذَا قَرَأْتَ الْقُرْءَانَ (Apabila kamu membaca Al Quran) Yakni jika kamu hendak membaca al-Qur’an. فَاسْتَعِذْ بِاللهِ (hendaklah kamu meminta perlindungan kepada Allah) Yakni mohonlah kepada Allah agar menjauhkanmu dari godaan setan yang terkutuk."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Dan diantara keajaiban \"isti'adzah\" sebagai pembersih bagi lisan yang kerap melontarkan kata-kata keji, juga sebagai pengantar sebelum membaca ayat-ayat Allah, ia sebagai permohonan bantuan kepada Allah, dan pengakuan untuk-Nya yang maha kuasa, dan bagi seorang hamba pasti akan lemah menghadapi musuh yang halus ini (syaithon) tanpa pertolongan dari Allah. 2 ). Diantara faidah lain dari \"isti'adzah\" adalah agar syaithon menjauh dari hati seseorang ketika akan membaca a-Qur'an, sehingga ia dapat menghadirkan penghayatan dalam mentadabburi ayat-ayat Allah dan memahami maknanya, dan tentunya semakin banyak manfaat yang akan ia dapatkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "98. Dan jika kamu hendak membaca Al-Qur’an maka meminta pertolonganlah kepada Allah agar menjagamu dari ganguan setan dalam membacanya, yaitu setan yang tertolak dari rahmat Allah, dengan mengucapkan “A’uudzu billahi minasy-syaithaanir rajiim”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apabila kamu hendak membaca Al-Qur’an} hendak membaca Al-Qur’an {maka mohonlah pelindungan kepada Allah dari setan yang terkutuk} yang terusir dari rahmat Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "98-100. Maksudnya, jika kamu hendak membaca Kitabullah yang merupakan kitab termulia dan paling agung, -di dalamnya terkandung muatan yang memperbaiki hati dan ilmu yang banyak-, maka sesungguhnya setan sangat antusias menggoda seorang hamba saat ia akan memulai mengerjakan amalan-amalan yang utama, lalu berusaha untuk membelokannya dari tujuan dan nilai-nilainya. Jalan menuju keselamatan dari gangguan setan ialah kembali kepada Allah dan berlindung kepada Allah dari kejahatannya, membaca Taawudz dengan merenungi maknanya dan hatinya berserah diri kepada Allah agar menyingkirkan setan darinya, tekun untuk mengenyahkan bisikan-bisikan dan imajinasi-imajinasinya, mengerahkan tenaga untuk menempuh faktor paling kuat guna mengusirnya. Yaitu menghiasi diri dengan baju iman dan tawakal. Sesungguhnya setan itu “tidak ada kekuasaannya,” maksudnya, penguasaan “atas orang-orang yang beriman, dan kepada Rabbnya,” semata, tiada sekutu bagiNya “mereka bertawakal,” maka Allah menyingkirkan keburuukan setan dari kaum Mukminin yang bertawakal kepadaNya, sehingga tiada celah tersisa baginya atas mereka. “Sesungguhnya kekuasaannya (setan) hanyalah,” maksudnya penguasaannya “atas orang-orang yang menjadikannya sebagai pemimpin,” menjadikannya sebagai pemimpin bagi mereka. Demikian itu, dengan cara melepaskan diri dari (bimbingan) kepemimpinan Allah dan masuk ke dalam ketaatan kepada setan serta bergabung dengan pasukannya. Mereka sendirilah yang memberikan (tongkat) kepemimpinan bagi setan atas diri mereka. Maka setan betul-betul mendorong mereka ke kubangan maksiat dan menghalau mereka ke neraka dengan sungguh-sungguh."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (فَإِذَا قَرَأۡتَ ٱلۡقُرۡءَانَ) Fa`idzaa qara`tal qur`aan : jika kamu hendak membaca Al-Qur’an. (فَٱسۡتَعِذۡ بِٱللَّهِ مِنَ ٱلشَّيۡطَٰنِ ٱلرَّجِيمِ ) Fasta’idz billaahi minasy syaithaanir rajiim : Katakanlah: `A’uudzu billahi minasy syaithaanir rajiim untuk melindungimu dari bisikannya. Makna ayat: Konteks ayat yang mulia ini masih mengenai hidayah bagi kaum muslimin dan menyempurnakan mereka. firman-Nya “Apabila engkau hendak membaca Al-Qur’an” Wahai Muhammad, atau salah seorang dari kaum mukminin pengikutmu “Hendaklah engkau meminta perlindungan dari Allah dari setan yang terkutuk.” Ketika engkau hendak akan membaca Al-Qur’an, maka katakanlah: a’uudzu billah minasy syaithaanir rajiim. Karena bacaan itu dapat melindungimu dari hal-hal yang dapat merusak bacaanmu. Pelajaran dari ayat: • Dianjurkan mengucapkan “A’uudzu billaahi minasy syaithaanir rajiim” ketika hendak membaca Al-Qur’an."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 98: Yang di dalamnya terdapat kebaikan bagi hati dan ilmu yang banyak. Yakni dengan mengucapkan, “A’uudzu billahi minasy syaithaanir rajiim” (artinya: Aku berlindung kepada Allah dari godaan setan yang terkutuk). Hal itu, karena setan berusaha memalingkan manusia dari maksud dan makna Al Qur’an, maka jalan keluarnya adalah dengan meminta perlindungan kepada Allah dari godaannya agar perhatian seseorang tertuju kepada Al Qur’an dan tidak berpaling daripadanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 98",
    "description": "Usai menjelaskan pahala yang disiapkan-Nya sebagai balasan amal saleh orang beriman, pada ayat ini Allah lalu menjelaskan bahwa membaca Al-Qur'an adalah salah satu dari amal saleh itu. Allah menyatakan, apabila engkau hendak membaca Al-Qur'an, mohonlah perlindungan dengan tulus kepada Allah dengan mengucapkan kalimat a'udzu billa'hi minasy syaitho'nir rajim, baik secara keras maupun lirih, agar engkau dihindarkan oleh Allah dari bisikan, rayuan, dan godaan setan yang terkutuk karena dijauhkan dari rahmat Allah. Dengan memohon perlindungan secara tulus, Allah pasti akan melindungimu. Sungguh, setan itu dengan segala bisikan, rayuan, dan godaannya tidak akan berpengaruh negatif terhadap orang yang beriman dengan mantap dan bertawakal kepada tuhan, sebagai pemelihara, penjaga, dan pelindung mereka."
  }
]