[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "99-100. Sesungguhnya setan tidak mempunyai kemampuan menguasai orang-orang yang beriman kepada Allah dan RasulNya, dan kepada tuhan mereka saja, mereka itu bersandar. Sesungguhnya kekuasaan setan hanyalah pada orang-orang yang menjadikannya sebagai penolong bagi mereka dan mereka juga menaatinya, dan juga terhadap orang-orang yang karena taat kepada setan, mereka mepersekutukan Allah ."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "99. Sesungguhnya setan tidak mempunyai kekuasaan atas orang-orang yang beriman dan bertawakal kepada Rabb mereka dalam segala urusan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "99. إِنَّهُۥ لَيْسَ لَهُۥ سُلْطٰنٌ (Sesungguhnya syaitan itu tidak ada kekuasaannya) Yakni setan tidak memiliki kekuasaan. عَلَى(atas) Yakni untuk menyesatkan. الَّذِينَ ءَامَنُوا۟ وَعَلَىٰ رَبِّهِمْ يَتَوَكَّلُونَ(orang-orang yang beriman dan bertawakkal kepada Tuhannya) Orang-orang yang menyerahkan urusan mereka kepada Allah dalam setiap perkataan dan perbuatan. Keimanan dan tawakkal kepada Allah dapat menjauhkan godaan setan dari mereka, dan apabila setan menggoda salah seorang dari mereka maka godaan itu tidak dapat mempengaruhinya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Jika bisikan-bisikan syaithon masih mengahantui hatimu, maka periksalah imanmu dan tawakkalmu kepada Allah, sesungguhnya Allah berfirman : { إِنَّهُ لَيْسَ لَهُ سُلْطَانٌ عَلَى الَّذِينَ آمَنُوا وَعَلَىٰ رَبِّهِمْ يَتَوَكَّلُونَ } \"Sesungguhnya syaitan itu tidak ada kekuasaannya atas orang-orang yang beriman dan bertawakkal kepada Tuhannya.\""
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "99. Hal itu membuat setan tidak mampu dan tidak kuasa untuk menggoda orang-orang mukmin yang menyerahkan setiap perkaranya kepada Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya setan tidak memiliki kuasa} tidak mampu {terhadap orang-orang yang beriman dan bertawakal kepada Tuhan mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "98-100. Maksudnya, jika kamu hendak membaca Kitabullah yang merupakan kitab termulia dan paling agung, -di dalamnya terkandung muatan yang memperbaiki hati dan ilmu yang banyak-, maka sesungguhnya setan sangat antusias menggoda seorang hamba saat ia akan memulai mengerjakan amalan-amalan yang utama, lalu berusaha untuk membelokannya dari tujuan dan nilai-nilainya. Jalan menuju keselamatan dari gangguan setan ialah kembali kepada Allah dan berlindung kepada Allah dari kejahatannya, membaca Taawudz dengan merenungi maknanya dan hatinya berserah diri kepada Allah agar menyingkirkan setan darinya, tekun untuk mengenyahkan bisikan-bisikan dan imajinasi-imajinasinya, mengerahkan tenaga untuk menempuh faktor paling kuat guna mengusirnya. Yaitu menghiasi diri dengan baju iman dan tawakal. Sesungguhnya setan itu “tidak ada kekuasaannya,” maksudnya, penguasaan “atas orang-orang yang beriman, dan kepada Rabbnya,” semata, tiada sekutu bagiNya “mereka bertawakal,” maka Allah menyingkirkan keburuukan setan dari kaum Mukminin yang bertawakal kepadaNya, sehingga tiada celah tersisa baginya atas mereka. “Sesungguhnya kekuasaannya (setan) hanyalah,” maksudnya penguasaannya “atas orang-orang yang menjadikannya sebagai pemimpin,” menjadikannya sebagai pemimpin bagi mereka. Demikian itu, dengan cara melepaskan diri dari (bimbingan) kepemimpinan Allah dan masuk ke dalam ketaatan kepada setan serta bergabung dengan pasukannya. Mereka sendirilah yang memberikan (tongkat) kepemimpinan bagi setan atas diri mereka. Maka setan betul-betul mendorong mereka ke kubangan maksiat dan menghalau mereka ke neraka dengan sungguh-sungguh."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (إِنَّهُۥ لَيۡسَ لَهُۥ سُلۡطَٰنٌ) innahuu laisa lahuu sulthaan : mereka tidak memiliki kekuatan untuk merusak dan menyesatkan orang-orang yang beriman, selama mereka bertawakkal kepada Allah. Makna ayat: Firman-Nya “sesungguhnya setan itu tidak memiliki kekuatan” kuasa “atas orang yang beriman dan mereka hanya bertawakkal kepada Rabb mereka.” ini adalah kabar gembira bagi kaum mukminin. Pelajaran dari ayat: • Penjelasan bahwa setan tidak memiliki daya atas orang-orang beriman yang bertawakkal kepada Rabb mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat An-Nahl ayat 99: Dengan tawakkal mereka kepada-Nya, Allah singkirkan gangguan setan, sehingga tidak ada jalan bagi setan untuk masuk menguasainya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nahl Ayat 99",
    "description": "Dengan memohon perlindungan secara tulus, Allah pasti akan melindungimu. Sungguh, setan itu dengan segala bisikan, rayuan, dan godaannya tidak akan berpengaruh negatif terhadap orang yang beriman dengan mantap dan bertawakal kepada tuhan, sebagai pemelihara, penjaga, dan pelindung mereka. Betapapun setan berupaya menggoda dan menjerumuskan orang yang beriman dan bertawakal kepada Allah, ia tidak akan berhasil. Kekuasaan dan pengaruhnya, yakni bisikan, rayuan, dan godaan setan hanyalah berdampak negatif terhadap orang yang menjadikannya pemimpin serta mendengar dan mengikuti bisik rayunya, dan berpengaruh negatif pula terhadap orang yang mempersekutukannya dengan Allah, yakni menjadikan setan sebagai sekutu-sekutu bagi Allah."
  }
]