[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1. Telah berlalu waktu yang panjang atas manusia sebelum ruh ditiupkan padanya, di mana saat itu dia bukan merupakan sesuatu apa pun yang dapat disebut, dan tidak diketahui jejaknya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Telah berlalu pada diri manusia masa yang panjang, sebelumnya ia tidak ada, tidak pernah disebut."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1. Telah berlalu masa yang sangat panjang bagi alam semesta tanpa ada wujud manusia di dalamnya; yaitu ketika manusia belum diciptakan, sehingga mereka belum ada dan belum dikenal. Sedangkan kata tanya (هل) pada ayat ini digunakan sebagai penetapan dan penegasan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. هَلْ أَتَىٰ عَلَى الْإِنسٰنِ (Bukankah telah datang atas manusia) Yakni telah datang kepada manusia saat masih dalam diri bapak mereka, Adam. حِينٌ مِّنَ الدَّهْرِ(satu waktu dari masa) Terdapat pendapat mengatakan: yakni empat puluh tahun sebelum ditiupkan ruh kepadanya, ia diciptakan dari tanah liat, kemudian dari tanah yang membatu dan kemudian dari tanah yang kering. لَمْ يَكُن شَيْـًٔا مَّذْكُورًا (sedang dia ketika itu belum merupakan sesuatu yang dapat disebut?) Yakni sebelum ditiupkan nyawa kepadanya. Pendapat lain mengatakan: yakni telah berlalu masa yang panjang sedangkan Adam sama sekali belum diciptakan dan belum disebut oleh makhluk manapun."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "1. Sudah pernah datang kepada manusia (anak adam) sebuah waktu di mana pada waktu itu segala sesuatu belum ada nama untuk menyebutnya. Dimana berawal dari setetes mani, kemudian menjadi segumpal darah, kemudian menjadi gumpalan daging, sehingga ditiupkan ruh, sampai bisa menjadi manusia yang sempurna. Fungsi hal yang bermakna apakah di sini adalah bermaksud mengungkapkan makna qad yang bermakna menegaskan kebenaran apa yang terjadi setelah itu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bukankah telah datang} telah berlalu {kepada manusia suatu waktu} waktu yang panjang {dari masa dimana belum ada sesuatu yang dapat disebut"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1. Dalam surat ini Allah menjelaskan kondisi di masa awal, pertengahan, dan akhir manusia. Allah menjelaskan bahwa manusia telah melewati masa yang panjang sebelum keberadaannya pada saat manusia belum ada, bahkan belum dikenal."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Insan ayat 1: 1-2. Allah mengabarkan bahwasanya telah lalu penciptaan manusia dan yang pertama kali adalah Adam, yaitu pada waktu ia (Adam) masih berupa jasad mati tanpa ruh di dalamnya. Dikatakan : Bahwasanya waktu (menjadi jasad tanpa ruh) adalah empat puluh tahun, baru kemudian ditiupkan ruh padanya. Allah menjelaskan bahwa penciptaan manusia adalah dari air manis laki-laki dan perempuan yang bercampur. Percampuran ini adalah yang kemudian berubah menjadi janin. Kemudian Allah mengujinya dengan dibebankannya syariat setelah sempurnanya proses tidur panjangnya (di rahim); Dimana Allah menjadikannya berakal yang memiliki ciri khas mendengar dan melihat; Untuk mendengar hujjah dan bukti-bukti yang menunjukkan atas Sang Pencipta (Allah). Pada surat ini dijelaskan proses penciptaan manusia yang mulia; Dimana Allah menciptakan Adam pertama kali, kemudian Allah ciptakan air mani yang menjadi cikal bakal diciptakannya seluruh manusia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala berfirman memberitahukan tentang manusia, bahwa Dia mengadakannya setelah sebelumnya ia (manusia) sebagai sesuatu yang belum bisa disebut karena hina dan lemahnya. Syaikh As Sa’diy berkata, “Allah menyebutkan dalam surah yang mulia ini keadaan pertama manusia; awalnya, pertengahannya dan akhirnya. Allah menyebutkan bahwa telah berlalu atasnya masa yang panjang yaitu sebelum ia terwujud, sedangkan ia dalam keadaan tidak ada, bahkan tidak bisa disebut. Kemudian ketika Allah Subhaanahu wa Ta'aala hendak menciptakan manusia, Dia menciptakan bapak mereka, yaitu Adam dari tanah, kemudian menjadikan keturunannya secara berturut-turut dari mani yang bercampur, yakni air yang hina dan dipandang kotor.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Insan Ayat 1",
    "description": "Surah ini diawali dengan peringatan kepada manusia tentang kehadirannya di pentas bumi sekaligus menjelaskan tentang tujuan penciptaannya. Bukankah, yaitu sungguh, pernah datang kepada manusia waktu dari masa yaitu sebelum ia diciptakan, yang ketika itu belum merupakan sesuatu yang dapat disebut' ketika itu manusia dalam ketiadaan, jangankan wujudnya, namanya pun belum ada. 2. Proses awal penciptaan manusia ditegaskan pada ayat ini. Sungguh, kami telah menciptakan manusia dari setetes mani yang bercampur yaitu dari sperma laki-laki dan indung telur perempuan yang tujuan utamanya kami hendak mengujinya dengan berbagai perintah dan larangan, karena itu kami jadikan dia mendengar dengan telinganya dan melihat dengan matanya."
  }
]