[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "11-14. Maka Allah melindungi mereka dari kesulitan-kesulitan di hari itu, Allah memberi mereka kebaikan dan cahaya pada wajah-wajah mereka, serta kebahagiaan dan suka cita dalam hati mereka. Allah memberi mereka pahala atas kesabaran mereka di dunia dalam menjalankan ketaatan berupa surga yang agung, di sana mereka makan apa yang mereka kehendaki, memakai kain sutra yang lembut, bersandar pada ranjang-ranjang yang terhias dengan kain-kain dan seprai-seprai yang indah. Di sana mereka tidak merasakan panasnya matahari dan tidak pula dingin yang berlebihan, pohon-pohon surga dekat kepada mereka, menaungi mereka, mudah bagi untuk memetiknya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Maka Allah menjaga mereka dengan karunia-Nya dari keburukan hari yang agung itu dan memberi mereka wibawa dan cahaya pada wajah-wajah mereka sebagai bentuk kemuliaan bagi mereka dan kegembiraan di hati mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "11-12. Allah menerima amal shalih dari orang-orang baik itu, sehingga Allah menjaga mereka dari kesulitan pada hari kiamat, mengamankan mereka dari ketakutan, memberi mereka wajah yang berseri-seri dan hari yang berbahagia, dan memasukkan mereka ke dalam surga yang penuh dengan kenikmatan yang kekal sebagai balasan atas kesabaran mereka, serta memakaikan mereka pakaian yang terbuat dari sutera."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "11. وَلَقَّىٰهُمْ نَضْرَةً وَسُرُورًا (dan memberikan kepada mereka kejernihan (wajah) dan kegembiraan hati) Yakni Allah memberi mereka selain dari wajah muram yang diberikan kepada orang-orang kafir; yaitu kecerahan wajah dan kesenangan hati. Makna (النضرة) adalah kebeningan wajah karena kenikmatan yang mereka rasakan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Pada hari itu, Allah memberikan perlindungan kepada mereka karena mereka telah takut atas bencana pada hari penuh kesuraman itu. Pada hari dimana kesuraman ditimpakan kepada orang kafir, Allah menggantikan untuk mereka (orang mukmin) dengan kesenangan dan keceriaan dalam hati. An nadlrah adalah wajah yang berbinar sebab mendapatkan nikmat dari Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka Allah melindungi mereka dari keburukan hari itu dan memberikan mereka} memberi mereka {keceriaan dan kegembiraan} kebaikan dan cahaya pada wajah mereka, dan kebahagian hati"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11. “Maka Allah memelihara mereka dari kesusahan hari itu,” ketakutan dahsyat tidak membuat mereka sedih. Para malaikat menyambut mereka, inilah hari dijanjikan pada kalian. “Dan memberikan kepada mereka kejernihan (wajah),” yakni memuliakan dan memberikan kejernihan wajah, “dan kegembiraan hati,” dalam sanubari mereka, sehingga menyatulah untuk mereka kenikmatan lahir dan batin."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Insan ayat 11: 11-12. Allah mengabarkan bahwasanya mereka yang selamat yaitu mereka yang memberikan makanan orang-orang miskin, anak-anak yatim dan tawanan perang karena kerasnya hari tersebut, dan Allah menyelamatkan mereka dari segala kondisinya (hari kiamat), dan juga memberikan dengan apa yang telah disebutkan dari macam-macam kenikmatan dimana Allah berikan kepada mereka semua. Dantara kenikmatan yang Allah berikan adalah, Allah mampukan mereka melihat wajah Allah dan Allah berikan kebahagiaan di hati-hati mereka. Allah juga masukkan sebab-sebab kesabaran dan keikhlasan (di dunia) untuk mendapatkan surga yang terkumpul segala kenikmatan, dan Allah juga berikan pakaian-pakaian dari bahan sutra kepada mereka di surga."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Di muka-muka mereka. Di hati-hati mereka. Dengan demikian, mereka menggabung antara kenikmatan luar dengan kenikmatan dalam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Insan Ayat 11",
    "description": "11-12. Sebagai imbalan atas perbuatan baik yang dilakukan seseorang, seperti yang disebut pada ayat di atas, maka Allah melindungi mereka dari kesusahan dan juga keburukan hari itu, dan memberikan kepada mereka aneka macam nikmat yang menimbulkan keceriaan pada wajah mereka dan kegembiraan pada hati mereka. Dan di samping yang telah disebut di atas, dia memberi juga balasan kepada mereka karena kesabarannya dalam aneka macam situasi, berupa surga dan pakaian sutera"
  }
]