[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "11-14. Maka Allah melindungi mereka dari kesulitan-kesulitan di hari itu, Allah memberi mereka kebaikan dan cahaya pada wajah-wajah mereka, serta kebahagiaan dan suka cita dalam hati mereka. Allah memberi mereka pahala atas kesabaran mereka di dunia dalam menjalankan ketaatan berupa surga yang agung, di sana mereka makan apa yang mereka kehendaki, memakai kain sutra yang lembut, bersandar pada ranjang-ranjang yang terhias dengan kain-kain dan seprai-seprai yang indah. Di sana mereka tidak merasakan panasnya matahari dan tidak pula dingin yang berlebihan, pohon-pohon surga dekat kepada mereka, menaungi mereka, mudah bagi untuk memetiknya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Dan Allah memberi balasan kepada mereka -atas kesabaran mereka dalam menjalankan ketaatan, kesabaran mereka atas takdir Allah dan kesabaran mereka dalam menahan diri dari kemaksiatan- berupa Surga, mereka bergelimang kenikmatan di dalamnya dan sutera yang mereka kenakan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12. Allah membalas dan memberi pahala atas dasar kesabaran mereka dalam mengerjakan perintah/kewajiban dan menjauhi larangan dengan balasan surga/taman untuk menjadi tempat tinggal mereka. Yang ditemani para bidadari di dalamnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia memberikan balasan kepada mereka atas kesabarannya dengan surga dan sutra"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "12. “Dan Dia memberi balasan kepada mereka karena kesabaran mereka,” karena menaatiNya dan mereka melakukan kebaikan. Mereka juga bersabar menahan diri dari kemaksiatan sehingga mereka meninggalkannya serta bersabar atas ketetapan (takdir) pahit, mereka tidak murka atas takdir itu. (Allah membalas mereka) “(dengan) surga,” yang menyatukan segala kenikmatan yang jauh dari berbagai hal yang mengeruhkan dan mengotori, “dan (pakaian) sutra,” sebagaimana disebutkan dalam Firman Allah, “dan pakaian mereka adalah sutera” -Al-Hajj: 23 dan “dan pakaian mereka didalamnya adalah sutera.” Fathir:33 Sepertinya Allah hanya menyebut sutra secara khusus karena itulah pakaian lahir mereka yang menunjukkan kondisi kemewahan pemakainya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Insan ayat 12: 11-12. Allah mengabarkan bahwasanya mereka yang selamat yaitu mereka yang memberikan makanan orang-orang miskin, anak-anak yatim dan tawanan perang karena kerasnya hari tersebut, dan Allah menyelamatkan mereka dari segala kondisinya (hari kiamat), dan juga memberikan dengan apa yang telah disebutkan dari macam-macam kenikmatan dimana Allah berikan kepada mereka semua. Dantara kenikmatan yang Allah berikan adalah, Allah mampukan mereka melihat wajah Allah dan Allah berikan kebahagiaan di hati-hati mereka. Allah juga masukkan sebab-sebab kesabaran dan keikhlasan (di dunia) untuk mendapatkan surga yang terkumpul segala kenikmatan, dan Allah juga berikan pakaian-pakaian dari bahan sutra kepada mereka di surga."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dalam mengerjakan perintah Allah, dalam menjauhi larangan Allah dan terhadap taqdir Allah yang pedih dengan tidak berkeluh kesah. Yang menghimpun semua kenikmatan dan selamat dari semua yang mengeruhkan atau mengurangi kenikmatannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Insan Ayat 12",
    "description": "11-12. Sebagai imbalan atas perbuatan baik yang dilakukan seseorang, seperti yang disebut pada ayat di atas, maka Allah melindungi mereka dari kesusahan dan juga keburukan hari itu, dan memberikan kepada mereka aneka macam nikmat yang menimbulkan keceriaan pada wajah mereka dan kegembiraan pada hati mereka. Dan di samping yang telah disebut di atas, dia memberi juga balasan kepada mereka karena kesabarannya dalam aneka macam situasi, berupa surga dan pakaian sutera. 13-14. Di sana yaitu di dalam surga, mereka duduk bersandar di atas dipan bersama pasangan mereka dan keluarga besar. Di sana mereka tidak melihat dan juga tidak merasakan teriknya matahari dan tidak pula merasakan udara dingin yang berlebihan. Dan anugerah tersebut semakin membahagiakan dengan adanya naungan pepohonannya dekat di atas mereka dan dimudahkan semudah-Mudahnya untuk memetik buahnya."
  }
]