[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "11-14. Maka Allah melindungi mereka dari kesulitan-kesulitan di hari itu, Allah memberi mereka kebaikan dan cahaya pada wajah-wajah mereka, serta kebahagiaan dan suka cita dalam hati mereka. Allah memberi mereka pahala atas kesabaran mereka di dunia dalam menjalankan ketaatan berupa surga yang agung, di sana mereka makan apa yang mereka kehendaki, memakai kain sutra yang lembut, bersandar pada ranjang-ranjang yang terhias dengan kain-kain dan seprai-seprai yang indah. Di sana mereka tidak merasakan panasnya matahari dan tidak pula dingin yang berlebihan, pohon-pohon surga dekat kepada mereka, menaungi mereka, mudah bagi untuk memetiknya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "13. Mereka bertelekan di atas kasur-kasur yang berhias. Mereka tidak mendapati di dalam Surga ini matahari yang teriknya menyakitkan bagi mereka, tidak juga hawa dingin yang menyengat, akan tetapi mereka senantiasa berada di dalam naungan, tidak merasa kepanasan tidak juga merasa kedinginan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "13-14. Dan salah satu kenikmatan surga, mereka dapat duduk bersandar di atas dipan-dipan dan bantal-bantal yang telah disiapkan bagi mereka. Dan untuk menambah kenikmatan bagi mereka, Allah menjadikan udara di sekitar mereka sangat sesuai, sehingga mereka tidak merasa terganggu oleh udara panas atau dingin. Dan meski matahari surga terbenam, namun surga selalu terang bagi penghuninya. Dan untuk menambah pemuliaan bagi para penghuni surga, naungan pepohonan di dekatkan kepada mereka, begitu pula dengan buah-buahannya, sehingga mereka tidak perlu berusaha keras untuk memetiknya, sehingga mereka benar-benar dalam kenikmatan dan kemewahan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "13. مُّتَّكِـِٔينَ فِيهَا عَلَى الْأَرَآئِكِ ۖ (di dalamnya mereka duduk bertelakan di atas dipan) Balasan mereka adalah surga sebagai tempat mereka bersandar di atas dipan yang memiliki bantal-bantal. لَا يَرَوْنَ فِيهَا شَمْسًا وَلَا زَمْهَرِيرًا (mereka tidak merasakan di dalamnya (teriknya) matahari dan tidak pula dingin yang bersangatan) Yakni mereka di surga tidak menyaksikan panas matahari atau hawa yang dingin."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13. Di surga itu, mereka duduk dan bersandar di atas dipan-dipan yang mulia disertai dengan berbagai makanan. Yang di dalamnya tidak terdapat cuaca panas dan dingin berlebih"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Di dalamnya mereka duduk bersandar di atas dipan} dipan yang berhias {Di sana mereka tidak merasakan terik matahari dan dingin yang menusuk} dingin yang dahsyat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "13. “Di dalamnya mereka duduk bertelekan di atas dipan-dipan.” Bertelekan adalah duduk nyaman dalam kondisi tenang, nikmat dan sejahtera, dan dipan adalah tempat tidur berhampar seprei yang dihiasi. “Mereka tidak merasakan di dalamnya,” yakni di dalam surga, “(teriknya) matahari,” yang panasnya mengganggu mereka, “dan tidak pula dingin yang menyengat,” yakni cuaca yang amat dingin, tapi seluruh waktu mereka berada di bawah naungan teduh, tidak panas dan tidak dingin yang membuat raga mereka merasa nikmat, yang tidak merasakan panas dan dingin."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Insan ayat 13: 13-14. Allah sebutkan sebagian dari kenikmatan penghuni surga; Allah mengabarkan bahwa mereka akan duduk di surga dengan duduk yang penuh ketenangan, yang duduk-duduk mereka bersandar di atas dipan yang mereka berpakaian dengan pakaian indah. Tidak akan terlihat di surga terika panas matahari yang sangat, tidak juga dingin yang sangat dari dingin musim dingin. Dan pohon-pohon surga akan menaunginya, dekat kepada mereka. Dan bahwasanya buah-buahnya telah masak, dekat jika ingin memamakannya, serta dimudahkan bagi mereka dengan segala kemudahan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan santai. Yang diberi kain penghias. Menurut penyusun tafsir Al Jalaalain, ‘zamharir’ di ayat tersebut artinya bisa juga bulan. Dengan demikian, surga sudah terang tanpa matahari dan bulan, di samping keadaannya yang tidak panas dan tidak dingin bahkan dengan keadaan yang membuat enak badan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Insan Ayat 13",
    "description": "13-14. Di sana yaitu di dalam surga, mereka duduk bersandar di atas dipan bersama pasangan mereka dan keluarga besar. Di sana mereka tidak melihat dan juga tidak merasakan teriknya matahari dan tidak pula merasakan udara dingin yang berlebihan. Dan anugerah tersebut semakin membahagiakan dengan adanya naungan pepohonannya dekat di atas mereka dan dimudahkan semudah-Mudahnya untuk memetik buahnya"
  }
]