[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "15-18. Mereka dikelilingi pelayan-pelayan dengan membawa nampan-nampan perak, gelas-gelas minuman dari kaca, kaca dari perak, para pemberi minum menakarnya dalam batas yang disukai oleh orang-orang yang meminumnya, tidak lebih, tidak kurang. Orang-orang baik itu diberi minum di surga dengan sebuah gelas yang penuh dengan khamar yang dicampur dengan jahe. Mereka minum dari mata air surga yang bernama Salsabila. Dinamakan demikian, karena airnya aman untuk diminum, mudah ditelan, dan lezat rasanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Mereka dikelilingi oleh pelayan-pelayan yang membawa bejana dari perak dan cangkir-cangkir yang bening warnanya saat mereka berkehendak untuk minum."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "15-16. Para pelayan di surga berjalan mendekati para penghuninya dengan membawa wadah-wadah makanan yang terbuat dari perak, dan gelas-gelas yang bening seperti kaca dan putih mengkilap seperti perak. Gelas-gelas ini terisi minuman yang sesuai dengan keinginan peminumnya, sehingga tidak ada yang tersisa setelah diminum dan tidak pula kurang dari yang seharusnya sehingga harus menambah lagi. Para pelayan yang mendatangi mereka itu merupakan bentuk penghormatan bagi mereka, karena mereka tidak harus datang mencari; namun segala yang mereka inginkan akan datang ke tempatnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15. وَيُطَافُ عَلَيْهِم بِـَٔانِيَةٍ مِّن فِضَّةٍ وَأَكْوَابٍ (Dan diedarkan kepada mereka bejana-bejana dari perak dan piala-piala yang bening laksana kaca) Yakni mereka dikelilingi para pembantu yang siap melayani jika mereka ingin minum dengan wadah dan gelas yang terbuat dari perak."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "15. Mereka dikelilingi para pelayan yang membawa bejana-bejana wadah makanan maupun minuman yang terbuat dari perak, mengkilap seperti kaca. Bening dan mengkilap bagaikan kilauan perak dan kaca. Al akwab bermakna wadah-wadah tanpa lubang"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Diedarkan kepada mereka} pelayan mengedarkan kepada mereka {bejana-bejana dari perak dan gelas-gelas yang sangat bening"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "15-16. “Dan diedarkan kepada mereka,” maksudnya anak-anak kecil dan para pelayan surga yang mengelilingi ahli surga “dengan membaca bejana-bejana dari perak, dan piala-piala yang bening laksana kristal, (yaitu) kristal-kristal (yang terbuat) dari perak,” yaitu bahannya terbuat dari perak dan bejana-bejana itu amat bening. Ini adalah salah satu dari berbagai hal yang menakjubkan. Perak tebal terbuat dari bahan putih dan baik berada di atas bejana bening. “Yang telah mereka ukur dengan sebaik-baiknya,” mereka ukur bejana-bejana itu sesuai ukuran pemiliknya, tidak kurang dan tidak lebih, sebab andai lebih banyak bisa mengurangi kenikmatannya dan andai kurang tidak cukup bagi pemiliknya. Kemungkinan lain yang dimaksud adalah penghuni surga mengukur dengan ukuran yang sesuai dengan selera mereka. Bejana-bejana hadir sesuai ukuran yang ditentukan oleh benak mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Insan ayat 15: 15-16. Allah menjelaskan bahwa pelayan yang muda-muda, mereka berkeliling melayani penghuni surga dengan membawa bejana-bejana yang berisi makanan yang bejana tersebut terbuat dari perak, dan gelas-gelasnya untuk minum juga terbuat dari perak; Akan tetapi tipis dan bening seperti gelas kaca yang terlihat isi di dalamnya. Pada wadah ini yaitu yang mereka minum atas keinginan-keinginan mereka yang isinya adalah kelezatan yang sesuai dengan apa yang mereka harapkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Insan Ayat 15",
    "description": "15-16. Setelah berbicara aneka fasilitas surga, kini giliran hidangan bagi para penghuni surga. Dan kepada mereka diedarkan oleh para pelayan surga bejana-bejana tempat minum yang terbuat dari perak dan piala-piala yang bening laksana kristal, kristal yang jernih terbuat dari perak saking jernihnya isinya nampak dari luar, mereka tentukan ukurannya yang sesuai dengan kehendak mereka, untuk disuguhkan bagi penghuni surga"
  }
]