[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "15-18. Mereka dikelilingi pelayan-pelayan dengan membawa nampan-nampan perak, gelas-gelas minuman dari kaca, kaca dari perak, para pemberi minum menakarnya dalam batas yang disukai oleh orang-orang yang meminumnya, tidak lebih, tidak kurang. Orang-orang baik itu diberi minum di surga dengan sebuah gelas yang penuh dengan khamar yang dicampur dengan jahe. Mereka minum dari mata air surga yang bernama Salsabila. Dinamakan demikian, karena airnya aman untuk diminum, mudah ditelan, dan lezat rasanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Kebeningan warnanya seperti kaca padahal itu terbuat dari perak, isinya sesuai dengan yang mereka inginkan, tidak lebih dan tidak pernah kurang."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "16. قَوَارِيرَا۟ مِن فِضَّةٍ ((yaitu) kaca-kaca (yang terbuat) dari perak) Yakni (القوارير) yakni kaca. Dan kaca yang ada di dunia terbuat dari pasir, maka Allah memberitahukan kelebihan kaca di surga yang terbuat dari perak yang bening sehingga terlihat isi yang ada di dalamnya. قَدَّرُوهَا تَقْدِيرًا (yang telah diukur mereka dengan sebaik-baiknya) Yakni wadah dan gelas itu dihidangkan kepada mereka dengan bentuk dan ukuran yang tepat sesuai yang mereka inginkan, tidak lebih dan tidak kurang."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16. Kristal-kristal dalam surga terbuat dari perak namun mengkilap seperti kaca. Mereka menentukan ukuran dan bentuk secara detail sesuai kehendak mereka, tanpa merubah menambah atau menguranginya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kaca yang sangat bening terbuat dari perak. Mereka menentukan ukurannya} orang yang memberi minum menentukan ukurannya sesuai aliran yang mereka inginkan, tidak lebih dan tidak kurang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "15-16. “Dan diedarkan kepada mereka,” maksudnya anak-anak kecil dan para pelayan surga yang mengelilingi ahli surga “dengan membaca bejana-bejana dari perak, dan piala-piala yang bening laksana kristal, (yaitu) kristal-kristal (yang terbuat) dari perak,” yaitu bahannya terbuat dari perak dan bejana-bejana itu amat bening. Ini adalah salah satu dari berbagai hal yang menakjubkan. Perak tebal terbuat dari bahan putih dan baik berada di atas bejana bening. “Yang telah mereka ukur dengan sebaik-baiknya,” mereka ukur bejana-bejana itu sesuai ukuran pemiliknya, tidak kurang dan tidak lebih, sebab andai lebih banyak bisa mengurangi kenikmatannya dan andai kurang tidak cukup bagi pemiliknya. Kemungkinan lain yang dimaksud adalah penghuni surga mengukur dengan ukuran yang sesuai dengan selera mereka. Bejana-bejana hadir sesuai ukuran yang ditentukan oleh benak mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Insan ayat 16: 15-16. Allah menjelaskan bahwa pelayan yang muda-muda, mereka berkeliling melayani penghuni surga dengan membawa bejana-bejana yang berisi makanan yang bejana tersebut terbuat dari perak, dan gelas-gelasnya untuk minum juga terbuat dari perak; Akan tetapi tipis dan bening seperti gelas kaca yang terlihat isi di dalamnya. Pada wadah ini yaitu yang mereka minum atas keinginan-keinginan mereka yang isinya adalah kelezatan yang sesuai dengan apa yang mereka harapkan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Bagian dalamnya dapat terlihat dari luar. Yakni bejana-bejana itu diukur oleh penghuni surga dengan ukuran yang sesuai kelezatan mereka, sehingga anak-anak itu membawakannya sesuai yang mereka (penghuni surga) inginkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Insan Ayat 16",
    "description": "15-16. Setelah berbicara aneka fasilitas surga, kini giliran hidangan bagi para penghuni surga. Dan kepada mereka diedarkan oleh para pelayan surga bejana-bejana tempat minum yang terbuat dari perak dan piala-piala yang bening laksana kristal, kristal yang jernih terbuat dari perak saking jernihnya isinya nampak dari luar, mereka tentukan ukurannya yang sesuai dengan kehendak mereka, untuk disuguhkan bagi penghuni surga. 17-18. Di dalam surga itu mereka mendapat suguhan minuman yang jenisnya di antaranya seperti yang disebut pada ayat ini. Dan di sana mereka diberi segelas minuman bercampur jahe, yang pastilah berbeda dengan rasa jahe yang ada di dunia. Karena air minum tersebut yang didatangkan dari sebuah mata air di surga yang dinamakan salsab'l."
  }
]