[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "15-18. Mereka dikelilingi pelayan-pelayan dengan membawa nampan-nampan perak, gelas-gelas minuman dari kaca, kaca dari perak, para pemberi minum menakarnya dalam batas yang disukai oleh orang-orang yang meminumnya, tidak lebih, tidak kurang. Orang-orang baik itu diberi minum di surga dengan sebuah gelas yang penuh dengan khamar yang dicampur dengan jahe. Mereka minum dari mata air surga yang bernama Salsabila. Dinamakan demikian, karena airnya aman untuk diminum, mudah ditelan, dan lezat rasanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Mereka meminumnya dari sumber mata air di Surga yang bernama Salsabil."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "18. عَيْنًا فِيهَا تُسَمَّىٰ سَلْسَبِيلًا ((Yang didatangkan dari) sebuah mata air surga yang dinamakan salsabil) Secara bahasa kata (السلسبيل) yakni nama bagi air yang sangat cair dan mudah ditelan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "18. Yang dicampur juga dengan air dari mata air yang bernama Salsabil yang menyejukkan dan mudah dalam melewati tenggoroka. As salsabil adalah air yang sangat sejuk dan lembut"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{(dari) sebuah mata air yang dinamakan Salsabil"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17-18. “Di dalam surga itu mereka diberi minum segelas (minuman),” yakni bejana yang berisi arak dan minuman nikmat, “yang campurannya adalah jahe,” agar rasa dan aromanya nikmat, “( yang didatangkan dari) sebuah mata air surga yang dinamakan salsabil,” disebut demikian karena silih berganti, rasa nikmat dan bagusnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Insan ayat 18: 17-18. Allah mengabarkan bahwa di surga mereka diberikan segelas minuman dari khamr yang bercampur dengan jahe. Mereka juga diberikan minum dari mata air surga yang dikatakan dengan Salsabil."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Insan Ayat 18",
    "description": "17-18. Di dalam surga itu mereka mendapat suguhan minuman yang jenisnya di antaranya seperti yang disebut pada ayat ini. Dan di sana mereka diberi segelas minuman bercampur jahe, yang pastilah berbeda dengan rasa jahe yang ada di dunia. Karena air minum tersebut yang didatangkan dari sebuah mata air di surga yang dinamakan salsab'l. 19. Setelah diuraikan apa yang disajikan di surga, kini dijelaskan siapa yang menyajikan hidangan tersebut. Dan mereka dikelilingi oleh para pemuda-pemuda yang tetap muda sambil membawa hidangan dan menawarkan pelayanan. Apabila kamu wahai penghuni surga, melihatnya dari arah mana saja melihatnya, akan kamu kira mereka, bukan anak muda melainkan mutiara yang bertaburan karena keindahan dan kebeningan penampilan mereka."
  }
]