[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "19. Orang-orang baik itu dikelilingi anak-anak yang keadaan mereka tidak berubah, mereka melayani orang-orang beriman tersebut. Bila kamu melihat mereka, kamu menyangka bahwa mereka adalah mutiara-mutiara yang tersebar dan berkilau, karena bersihnya kulit mereka dan berbinarnya wajah mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Di Surga mereka dikelilingi oleh anak-anak yang senantiasa muda, jika kamu melihat mereka niscaya kamu mengira mereka mutiara yang bertaburan karena kecerahan wajah, keindahan kulit, serta jumlah mereka yang banyak bertebaran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "19. Pada ayat ini disebutkan sifat para pelayan bagi penghuni surga; mereka adalah para pemuda yang selalu tampak berseri, tidak pernah menua atau berubah keadaannya. Cara berdiri dan pergerakan mereka seperti mutiara-mutiara yang tersebar karena begitu indah. Mereka diserupakan dengan mutiara yang tersebar karena jika mutiara tersebar maka akan saling memantulkan cahaya satu sama lain sehingga tampak begitu indah. Jika sifat para pelayan surga saja sedemikian indah, maka bagaimana dengan para penghuni surga?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "19. وَيَطُوفُ عَلَيْهِمْ وِلْدٰنٌ مُّخَلَّدُونَ (Dan mereka dikelilingi oleh pelayan-pelayan muda yang tetap muda) Yakni mereka tetap pada masa muda dan ketampanan mereka; tidak menjadi tua, berubah, atau mati. إِذَا رَأَيْتَهُمْ حَسِبْتَهُمْ لُؤْلُؤًا مَّنثُورًا (Apabila kamu melihat mereka, kamu akan mengira mereka, mutiara yang bertaburan) Yakni karena ketampanan dan kebeningan kulit mereka, Allah menyerupakan mereka dengan mutiara yang bertaburan, sebab mereka sangat cekatan dalam memberikan pelayanan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19. Para penghuni surga dikelilingi oleh para pemuda yang tetap muda dan tidak akan tetap hidup. Apabila mereka melihat para pemuda itu, mereka mengira bahwa mereka adalah mutiara-mutiara yang bertebaran di surga"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka dikelilingi oleh para pemuda yang kekal} muda selama-lamanya {Apabila melihatnya, kalian akan mengira bahwa mereka adalah mutiara yang bertaburan} mutiara yang memancarkan sinar bertaburan, karena keindahan wajahnya dan tersebar di tempat duduk mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "19. “Dan mereka dikelilingi,” para penghuni surga dengan makanan, minuman, dan para pelayan, “oleh pelayan-pelayan muda yang tetap muda,” yaitu mereka diciptakan dari surga untuk tetap ada selamanya. Mereka tidak berubah dan tidak beranjak tua, mereka amat rupawan. \"Apabila kamu melihat mereka,” yang bertebaran melayani kalian, “kamu akan mengira mereka,” karena kerupawanan mereka, “mutiara yang bertaburan.” Ini adalah salah satu kesempurnaan nikmat penghuni syurga. Para pelayan mereka adalah pemuda yang kekal, yang bila dilihat, membuat senang. Mereka masuk dalam kediaman penghuni surga dengan aman. Mereka datang ketika diinginkan oleh para penghuni surga dan dikehendaki oleh diri-diri mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Insan ayat 19: 19-20. Allah menjelaskan bahwa di antara kenikmatan penghuni surga adalah adanya pelayan-pelayan muda yang berkeliling atas mereka untuk melayani mereka, yang mereka tetap akan muda, dan mereka (penghuni surga) merasa nyaman melihatnya, jika mereka melihatnya, mereka akan menyangkan mutiara yang bertaburan. Dan jika pandanganmu mengarah di surga, engkau akan melihat kenikmatan di dalamnya, dan kerajaan yang besar yang tidak pernah dilihat oleh mata, tidak juga didengar oleh telingan dan tidak juga pernah dirasakan dalam hati manusia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang melayani mereka. Yakni karena indahnya dan bertebarannya mereka melayani."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Insan Ayat 19",
    "description": "Setelah diuraikan apa yang disajikan di surga, kini dijelaskan siapa yang menyajikan hidangan tersebut. Dan mereka dikelilingi oleh para pemuda-pemuda yang tetap muda sambil membawa hidangan dan menawarkan pelayanan. Apabila kamu wahai penghuni surga, melihatnya dari arah mana saja melihatnya, akan kamu kira mereka, bukan anak muda melainkan mutiara yang bertaburan karena keindahan dan kebeningan penampilan mereka. 20. Dan di samping para pelayan yang menakjubkan, maka apabila engkau melihat keadaan di sana yaitu di surga, niscaya engkau akan melihat berbagai macam kenikmatan yang sempurna dan kerajaan yang besar, luas tanpa batas yang belum pernah terlintas dalam benak manusia."
  }
]