[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "2-3. Sesungguhnya Kami menciptakan manusia dari setetes air yang merupakan gabungan antara sperma laki-laki dan sperma perempaun. Kami mengujinya dengan beban-beban syariat sesudah itu, karena itu Kami membuatnya mendengar dan melihat agar dia mendengar ayat-ayat dan melihat bukti-bukti. Sesungguhnya Kami menjelaskan dan mengenalkan kepadanya jalan hidayah dan kesesatan, kebaikan dan keburukan, agar dia menjadi Mukmin yang bersyukur atau kafir yang pengingkar."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Sesungguhnya Kami menciptakan manusia dari air mani yang bercampur dari air lelaki dan air wanita, Kami mengujinya dengan beban taklif yang kami wajibkan atasnya, lalu Kami jadikan ia bisa mendengar dan melihat agar dia menjalankan syariat yang kami bebankan kepadanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "2. Kemudian Allah menciptakan manusia, dan menjadikan penciptaannya melalui beberapa tahap; dimulai dengan air mani yang merupakan air yang hina, lalu air itu menetap di rahim, lalu bertemu dan bercampur dengan sel telur; hingga ia melewati tahap-tahap penciptaannya. Kemudian ia dilahirkan sebagai makhluk yang sempurna, dapat mendengar dan melihat. Dan hikmah dari penciptaan ini adalah sebagai ujian dan cobaan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. أَمْشَاجٍ (yang bercampur) Yakni campuran antara mani laki-laki dan mani perempuan. Pendapat lain mengatakan: yakni dari berbagai campuran, sebab ia berasal dari berbagai unsur yang menjadi bahan penciptaan manusia dengan tabiat yang berbeda-beda. نَّبْتَلِيهِ (yang Kami hendak mengujinya (dengan perintah dan larangan)) Yakni Kami menciptakannya karena Kami ingin mengujinya dengan kebaikan dan keburukan serta dengan beban syariat. فَجَعَلْنٰهُ سَمِيعًۢا بَصِيرًا (karena itu Kami jadikan dia mendengar dan melihat) Yakni Kami menciptakan baginya panca indra agar memudahkannya untuk memahami, sehingga memungkinkan untuk diberi ujian dan cobaan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Sesungguhnya Kami menciptakan manusia (anak Adam) dari setetes mani, yang bercampur. Mani laki-laki dan mani perempuan bercampur jadi satu. Kami akan menguji mereka dengan perintah dan larangan. Artinya, Kami menciptakan mereka untuk diuji dengan tanggung jawab tentang kebaikan dan keburukan, sehingga Kami jadikan mereka dapat melihat dan mendengar. Kelak, pada hari kiamat akan Kami mintai pertanggungjawaban atas bukti dan ayat-ayat yang telah mereka dengar dan saksikan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya Kami telah menciptakan manusia dari setetes mani yang bercampur} bercampurnya air dari laki-laki dan dari perempuan {Kami hendak mengujinya} Kami mengujinya dengan beban {sehingga menjadikannya dapat mendengar dan melihat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2. Selanjutnya pada saat Allah hendak menciptakan manusia, Allah menciptakan bapak moyang manusia, Adam, dari sari pati tanah. Selanjutnya Allah menjadikan keturunannya berseling-seling, “dari setetes mani yang bercampur,” yaitu dari air hina lagi menjijikan, “yang Kami hendak mengujinya (dengan perintah dan larangan)” dengan hal itu, agar Kami mengetahui apakah manusia mengetahui dan memahami kondisi pertamanya tersebut ataukah ia melupakannya dan tertipu oleh dirinya? Kemudian Allah menciptakannya dan memberinya kekuatan lahir dan batin, seperti pendengaran, penglihatan, dan seluruh anggota badan. Selanjutnya Allah menyempurnakannya yang memungkinkannya mencapai tujuan-tujuannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Insan ayat 2: 1-2. Allah mengabarkan bahwasanya telah lalu penciptaan manusia dan yang pertama kali adalah Adam, yaitu pada waktu ia (Adam) masih berupa jasad mati tanpa ruh di dalamnya. Dikatakan : Bahwasanya waktu (menjadi jasad tanpa ruh) adalah empat puluh tahun, baru kemudian ditiupkan ruh padanya. Allah menjelaskan bahwa penciptaan manusia adalah dari air manis laki-laki dan perempuan yang bercampur. Percampuran ini adalah yang kemudian berubah menjadi janin. Kemudian Allah mengujinya dengan dibebankannya syariat setelah sempurnanya proses tidur panjangnya (di rahim); Dimana Allah menjadikannya berakal yang memiliki ciri khas mendengar dan melihat; Untuk mendengar hujjah dan bukti-bukti yang menunjukkan atas Sang Pencipta (Allah). Pada surat ini dijelaskan proses penciptaan manusia yang mulia; Dimana Allah menciptakan Adam pertama kali, kemudian Allah ciptakan air mani yang menjadi cikal bakal diciptakannya seluruh manusia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya, bercampur antara benih lelaki dengan perempuan. Ada pula yang menafsirkan mengujinya dengan asal penciptaannya, yaitu dari mani. Yakni agar Kami mengetahui secara nyata apakah ia ingat kepada keadaan pertamanya dan sadar akhirnya mengikuti kebenaran dan tidak sombong ataukah ia lupa sehingga terpedaya oleh dirinya. Allah Subhaanahu wa Ta'aala mewujudkannya, menciptakan kemampuan luar dan dalam seperti pendengaran dan penglihatan serta anggota badan yang lain, lalu Allah menyempurnakannya dan menjadikannya tidak cacat sehingga ia dapat mencapai maksudnya. Kemudian Allah Subhaanahu wa Ta'aala mengutus rasul dan menurunkan kitab kepadanya untuk menunjukkan jalan kepada Allah, mendorongnya serta memberitahukan tentang apa yang akan diperolehnya ketika sampai kepada Allah. Demikian pula Allah memberitahukan jalan yang mengarah kepada kebinasaan, menakut-nakutinya dan memberitahukan tentang apa yang akan didapatkannya ketika jalan itu ditempuhnya. Dia menguji manusia dengan dua jalan itu, maka manusia terbagi menjadi dua; ada yang bersyukur kepada nikmat Allah itu sehingga ia pun melaksanakan hak-hak-Nya yang dibebankan kepadanya, dan ada pula yang kufur kepada nikmat Allah itu baik nikmat agama maupun dunia, ia menolaknya, kafir kepada Tuhannya dan malah menempuh jalan yang mengarah kepada kebinasaan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Insan Ayat 2",
    "description": "Proses awal penciptaan manusia ditegaskan pada ayat ini. Sungguh, kami telah menciptakan manusia dari setetes mani yang bercampur yaitu dari sperma laki-laki dan indung telur perempuan yang tujuan utamanya kami hendak mengujinya dengan berbagai perintah dan larangan, karena itu kami jadikan dia mendengar dengan telinganya dan melihat dengan matanya. 3. Potensi lainnya yang dianugerahkan Allah kepada manusia adalah berupa petunjuk, seperti yang ditegaskan pada ayat ini. Sungguh, kami telah menunjukkan kepadanya jalan yang jelas lagi lurus tidak ada jalan yang lurus selainnya, di antara manusia ada yang bersyukur atas nikmat dan petunjuk tuhannya dan ada pula yang kufur, menutupi kebenaran dan mengingkari nikmat-nikmat-Nya."
  }
]