[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "20. Bila kamu melihat bagian mana pun dari surga, niscaya kamu melihat kenikmatan yang tidak bisa dilukiskan, dan kerajaan agung luas yang tidak berbatas."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "20. Dan jika kamu melihat apa yang ada di Surga sana, niscaya kamu melihat kenikmatan yang tidak bisa dijelaskan dan kamu melihat kerajaan agung yang tidak ada kerajaan lain yang menyamainya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "20. Segala yang ada di surga adalah kenikmatan yang kekal, dan segala yang dinikmati para penghuninya adalah milik mereka. Dan jika kamu melihat kenikmatan yang ada di surga maka akan jelas bagimu betapa agung, banyak, dan beraneka ragam kenikmatan itu. Kerajaan milik orang beriman di surga sangat luas; kerajaan penghuni surga yang paling rendah lebih luas sepuluh kali lipat daripada luas bumi; maka bagaimana dengan kerajaan milik penghuni surga yang paling tinggi derajatnya?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "20. وَإِذَا رَأَيْتَ ثَمَّ (Dan apabila kamu melihat di sana (surga)) Yakni jika kamu mengarahkan pandanganmu ke surga. رَأَيْتَ نَعِيمًا(niscaya kamu akan melihat berbagai macam kenikmatan) Yang tidak dapat dibayangkan. وَمُلْكًا كَبِيرًا (dan kerajaan yang besar) Yang tidak dapat diukur kebesarannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20. Wahai Nabi, apabila engkau melihat keadaan di surga, engkau akan melihat berbagai macam kenikmatan dan kerajaan-kerajaan yang besar. Ayat ini turun ketika Umar melihat Nabi ﷺ alas tidur dari jerami, sehingga membekas di tubuh mulia Nabi ﷺ"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apabila kamu melihat di sana} Jika kamu melihat apa yang ada di surga sana {niscaya kamu akan melihat berbagai kenikmatan dan kerajaan yang besar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "20. “Dan apabila kamu melihat di sana (surga),” yaitu bila kau melihat kenikmatan sempurna penghuni surga, “niscaya kamu akan melihat berbagai macam kenikmatan dan kerajaan yang besar.” Engkau akan melihat masing-masing penghuni surga memiliki istana, kediaman, dan kamar-kamar yang dihiasi, yang tidak bisa dilukiskan dengan kata-kata, masing-masing memiliki kebun penuh bunga, tanaman dekat, buah-buahan nikmat, sungai mengalir, kebun menakjubkan, burung-burung berkicau yang menarik hati dan membahagiakan jiwa. Ia memiliki istri-istri yang amat cantik dan baik dan menyatukan antara kecantikan lahir dan batin. Mereka adalah wanita-wanita cantik dan baik yang memenuhi kebahagiaan dan kenikmatan hati. Di sekelilingnya banyak anak-anak yang kekal dan pelayan abadi, yang dengannya didapatkan kenikmatan dan ketenangan. Kenikmatan hidup menjadi sempurna. Dan yang paling agung dari semua itu adalah mendapatkan keridhaan Rabb Yang Maha Penyayang dan mendengarkan kata-kataNya, nikmatnya berada dekat denganNya serta berbahagia dengan keridhaan dan keabadian selamanya. Semua kenikmatan yang ada di dalam surga kian waktu kian bertambah. Mahasuci Allah Yang Menguasai kerajaan, Yang Mahabenar lagi Nyata, yang simpanan rahmatNya tidak pernah habis dan kebaikanNya tidak pernah berkurang sebagaimana sifat-sifatNya yang tidak ada akhirnya. Tidak ada kata akhir untuk kebaikan dan dermaNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Insan ayat 20: 19-20. Allah menjelaskan bahwa di antara kenikmatan penghuni surga adalah adanya pelayan-pelayan muda yang berkeliling atas mereka untuk melayani mereka, yang mereka tetap akan muda, dan mereka (penghuni surga) merasa nyaman melihatnya, jika mereka melihatnya, mereka akan menyangkan mutiara yang bertaburan. Dan jika pandanganmu mengarah di surga, engkau akan melihat kenikmatan di dalamnya, dan kerajaan yang besar yang tidak pernah dilihat oleh mata, tidak juga didengar oleh telingan dan tidak juga pernah dirasakan dalam hati manusia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni engkau akan melihat salah seorang di antara mereka mempunyai istana, tempat tinggal dan kamar-kamar yang indah yang sulit disifatkan. Demikian pula kebun-kebun yang indah, buah-buahan yang lezat yang mudah dipetik, sungai yang mengalir, dan lainnya yang menarik hati dan menggembirakan jiwa. Ia juga memiliki istri-istri yang sangat cantik dan baik yang menggabung antara keindahan luar dan dalam sehingga membuat hati senang, di samping dikelilingi para pelayan yang selalu melayani permintaannya sehingga ia merasakan ketenangan, ketenteraman dan kenyamanan. Dan yang paling besar di atas semua itu adalah dapat melihat Allah Subhaanahu wa Ta'aala, mendengar pembicaraan-Nya, merasakan kenikmatan di dekat-Nya serta meraih ridha-Nya. Maka Mahasuci Allah Yang Maharaja lagi Maha Memiliki, Yang Mahabenar lagi Maha Menerangkan yang tidak akan habis perbendaharaan-Nya dan tidak akan berkurang kebaikan-Nya. Oleh karena tidak akan habis sifat-sifat-Nya, maka tidak akan habis pula kebaikan dan ihsan-Nya. Ya Allah, masukkanlah kami ke dalam surgamu dan jauhkanlah kami dari neraka. Ya Allah, masukkanlah kami ke dalam surgamu dan jauhkanlah kami dari neraka. Ya Allah, masukkanlah kami ke dalam surgamu dan jauhkanlah kami dari neraka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Insan Ayat 20",
    "description": "Dan di samping para pelayan yang menakjubkan, maka apabila engkau melihat keadaan di sana yaitu di surga, niscaya engkau akan melihat berbagai macam kenikmatan yang sempurna dan kerajaan yang besar, luas tanpa batas yang belum pernah terlintas dalam benak manusia. 21. Hidangan dan pelayan sudah dijelaskan kini giliran dijelaskan tentang pakaian para penghuni surga. Mereka berpakaian sutera halus yang berwarna hijau dan sutera tebal dan juga memakai gelang terbuat dari perak masing-masing sesuai dengan kedudukannya, dan tuhan memberikan kepada mereka minuman yang bersih dan suci yang benar-benar berbeda dengan minuman selainnya."
  }
]