[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "21. Tubuh mereka menjadi indah dengan pakaian-pakaian yang bagian dalamnya adalah sutra lembut, sedangkan bagian luarnya adalah sutra tebal, mereka dihiasi dengan perhiasan dari gelang-gelang perak, di samping semua kenikmatan itu, Tuhan mereka memberi mereka minuman yang tidak ada noda dan kotoran padanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Badan-badan mereka terbungkus oleh baju hijau mewah yang terbuat dari sutera tipis dan sutera tebal. Mereka di Surga mengenakan gelang perak. Dan Allah memberi mereka minuman yang steril dari semua pencemaran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "21. Para penghuni surga akan memakai pakaian dari sutera tipis berwarna hijau, kemudian memakai di atasnya pakaian sutera tebal yang ditenun dengan campuran benang perak. Pada penghuni surga juga memakai perhiasan dari perak untuk menambah keindahan mereka. Dan Allah akan memberi mereka minuman yang sangat bersih dan murni yang dapat membersihkan badan dan hati mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "21. عٰلِيَهُمْ ثِيَابُ سُندُسٍ (Mereka memakai pakaian sutera halus) Makna (السندس) yakni sutra halus dan tipis. Sedangkan (الإستبرق) yakni sutra yang tebal. وَحُلُّوٓا۟ أَسَاوِرَ مِن فِضَّةٍ(dan sutera tebal dan dipakaikan kepada mereka gelang terbuat dari perak) sedangkan dalam surat al-Fatir disebutkan: “mereka dipakaikan gelang yang terbuat dari emas,” sebab setiap mereka akan dipakaikan gelang sesuai dari apa yang mereka sukai. وَسَقَىٰهُمْ رَبُّهُمْ شَرَابًا طَهُورًا(dan Tuhan memberikan kepada mereka minuman yang bersih) Abu Qalabah dan Ibrahim an-Nakha’i berkata: yakni mereka akan diberi makanan, dan jika mereka akan selesai makan maka mereka akan diberi minuman yang bersih, lalu mereka akan meminumnya sehingga masuk ke perut mereka dan keringat keluar dari tubuh mereka yang beraroma minyak Kasturi.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "21. Gambaran orang-orang yang mengelilingi mereka itu berpakaian sutera halus berwarna hijau dan tebal. Mereka dihiasi oleh Tuhan mereka dengan gelang-gelang perak, dan diberikan minuman yang bersih dan suci"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka} badan bagian atas mereka {berpakaian sutra halus yang hijau} pakaian yang bagian dalamnya terbuat dari sutra yang lembut berwarna hijau {sutra tebal} dan bagian luarnya dari sutra tebal {dan memakai} mengenakan {gelang perak. Tuhan memberikan kepada mereka minuman yang suci} yang bersih dari najis dan kotoran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21. “Mereka memakai pakaian sutra halus yang hijau,” yakni mereka mengenakan pakaian sutra tebal dan sutra halus berwarna hijau, di mana keduanya adalah jenis sutra paling mewah. Sundus adalah sutra tebal sedangkan istibraq adalah sutra tipis dan halus. “Dan dipakaikan kepada mereka gelang yang terbuat dari perak,” di tangan mereka diberi perhiasan gelang perak, baik yang lelaki maupun yang perempuan. Ini adalah janji Allah, dan janjiNya pasti terlaksana, sebab tidak ada yang lebih benar perkataannya melebihi Allah. Allah berfirman, “Dan Rabb mereka memberikan kepada mereka minuman yang bersih,” yakni minuman yang tidak ada kotorannya sama sekali sekaligus membersihkan perut mereka dari segala penyakit dan kotoran."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Insan ayat 21: Allah menjelaskan juga bahwa sebagian dari kenikmatan penghuni surga adalah mereka memakai pakain yang terbuat dari sutra yang lembut, dan tebal kainnya yang berwarna hijau. Sungguh sangat indah dan lembut bagi yang memakainya. Dan mereka dipakaikan oleh para malaikat gelang yang terbuat dari perak (baik perempuan maupun laki-laki). Allah juga memberikan mereka minuman yang suci, dan minuman ini adalah macam yang telah lalu dijelaskan. Semua itu adalah khusus bagi mereka, karena Allah lah yang memberikan mereka nikmat minuman."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dalam ayat lain diterangkan, bahwa mereka diberi gelang dari emas. Hal ini untuk memberitahukan, bahwa mereka diberi perhiasan emas dan perak secara bersamaan atau secara terpisah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Insan Ayat 21",
    "description": "Hidangan dan pelayan sudah dijelaskan kini giliran dijelaskan tentang pakaian para penghuni surga. Mereka berpakaian sutera halus yang berwarna hijau dan sutera tebal dan juga memakai gelang terbuat dari perak masing-masing sesuai dengan kedudukannya, dan tuhan memberikan kepada mereka minuman yang bersih dan suci yang benar-benar berbeda dengan minuman selainnya. 22. Semua kenikmatan tersebut disajikan sambil dikatakan kepada mereka, \"inilah balasan untukmu, dan segala usahamu diterima dan diakui Allah dengan memberi balasan yang sempurna melebihi amal-amal kamu. \"."
  }
]