[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "22. Dikatakan kepada mereka, “Sesungguhnya ini disiapkan bagi kalian sebagai balasan atas amal-amal shalih kalian, dan amal kalian ketika di dunia diridhai dan diterima oleh Allah.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "22. Dan dikatakan kepada mereka sebagai bentuk pemuliaan terhadap mereka, “Sesungguhnya kenikmatan yang diberikan kepada kalian ini merupakan balasan atas amal perbuatan saleh kalian, dan amal perbuatan kalian itu diterima di sisi Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "22. Segala kenikmatan bagi para penghuni surga ini merupakan balasan atas keimanan dan ketaatan mereka kepada Allah dalam keadaan senang maupun susah dan perjuangan mereka di dunia; sehingga mereka layak menerima syukur atas usaha, pengorbanan, dan kesabaran mereka. Sungguh begitu besar balasan dan begitu indah syukur bagi mereka!"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "22. وَكَانَ سَعْيُكُم مَّشْكُورًا (dan usahamu adalah disyukuri (diberi balasan)) Yakni kesyukuran Allah terhadap amalan hamba-Nya adalah dengan menerima amalan itu sebagai ketaatan bagi-Nya dan memuji hamba tersebut."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "22. Dikatakan kepada mereka: Ini semua adalah balasan atas perbuatan baik kalian. Amal kalian telah diterima dan diakui di sisi Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya ini adalah balasan} imbalan {untuk kalian dan usaha kalian} amal shalih kalian di dunia {diterima} diridhai dan diterima"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "22. “Sesungguhnya ini,” yakni balasan besar dan pemberian indah ini “adalah balasan untukmu,” atas amal perbuatan baik yang telah kalian lakukan. “Dan usahamu adalah disyukuri (diberi balasan),” yakni amal perbuatan baik meski sedikit akan dibalas oleh Allah dengan nikmat abadi bagimu yang tidak mungkin bisa dihitung."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Insan ayat 22: Kemudian dikatakan kepada penghuni surga dengan wujud pemuliaan : Sungguh kenikmatan ini aka nada selamanya yang disiapkan untuk kalian, di hamparkan untuk kalian, dan ia adalah balasan dari upah ganjaran untuk kalian, atas amalan shalih kalian yang telah lalu, karenan sebab amalan kalian diridhai dan diterima (Allah)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Terhadap amal yang kamu lakukan terdahulu. Meskipun sedikit. Yakni dengan amal itu Allah Subhaanahu wa Ta'aala jadikan untuk kamu kenikmatan yang kekal yang banyak jumlahnya dan tidak mungkin dihitung."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Insan Ayat 22",
    "description": "Semua kenikmatan tersebut disajikan sambil dikatakan kepada mereka, \"inilah balasan untukmu, dan segala usahamu diterima dan diakui Allah dengan memberi balasan yang sempurna melebihi amal-amal kamu. \"23-24. Setelah diuraikan tentang balasan bagi yang bertakwa, selanjutnya dijelaskan tentang bagaimana bertakwa secara baik itu. Allah menurunkan petunjuk-Nya melalui Al-Qur'an. Inilah yang disinggung oleh ayat ini. Sesungguhnya kamilah yang menurunkan Al-Qur'an kepadamu wahai nabi Muhammad secara berangsur-angsur agar mudah memahaminya. Maka bersabarlah setiap saat untuk menghadapi dan melaksanakan ketetapan tuhanmu, dan janganlah engkau ikuti orang yang berdosa dan orang yang kafir di antara mereka yang mencoba untuk menghentikan dakwahmu."
  }
]