[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "24-25. Maka bersabarlah dalam menerima keputusan Tuhanmu yang merupakan takdirNya dan hukumNya yang merupakan agama, serta berjalanlah di atasnya. Jangan taati orang-orang musyrik yang tenggelam dalam hawa nafsu atau terbenam dalam kekafiran dan kesesatan. Teruslah berdzikir menyebut Nama Tuhanmu dan berdoa kepadaNya di pagi dan sore hari."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. Maka bersabarlah atas apa yang diputuskan oleh Allah baik dalam takdir maupun syariat-Nya. Dan janganlah kamu mengikuti pendosa yang mengajak kepada dosanya, dan jangan pula mengikuti orang kafir yang mengajak kepada kekufurannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "24. وَلَا تُطِعْ مِنْهُمْ ءَاثِمًا أَوْ كَفُورًا (dan janganlah kamu ikuti orang yang berdosa dan orang yang kafir di antar mereka) Yakni janganlah kamu taati seorangpun dari pelaku maksiat atau yang tenggelam dalam kekafiran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "24. Maka bersabarlah untuk senantiasa menyampaikan risalah Tuhanmu dan bersabar atas perlakuan umatmu sampai tiba pertolongan dan perintah untuk berperang atau menyerang. Jangan tunduk kepada orang kafir yang bermaksiat secara terang-terangan, yang telah melewati batas kekufuran. Qatadah berkata, ada berita yang sampai padaiku bahwa Abu Jahal pernah berkata: Kalau aku melihat Muhammad shalat maka aku benar-benar akan merendahkan/menumpangi lehernya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka bersabarlah pada ketetapan Tuhanmu} pada ketetapan Tuhanmu yang merupakan takdir dan syariatNya {dan jangan mengikuti di antara mereka pendosa} orang yang berbuat dosa yang mengajak untuk melakukan hal tersebut {dan orang yang sangat kafir} orang yamg sangat kafir yang mengajak pada kekufuran itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "24. karena itu Allah berfirman, “Maka bersabarlah kamu untuk (melaksanakan) ketetapan Rabbmu, dan janganlah kamu ikuti orang yang berdosa dan orang yang kafir di antara mereka.” Yakni, bersabarlah atas ketetapan takdir Allah, jangan kau memurkainya dan bersabarlah atas ketetapan AgamaNya. Tetap laksanakan, jangan sampai ada yang menghalangi. “Dan janganlah kamu ikuti,” orang-orang yang menentang yang ingin menghalangimu, baik “orang yang berdosa,” yang mengerjakan dosa dan kemaksiatan, “atau orang kafir,” karena menuruti orang-orang kafir, keji, dan fasik pastilah merupakan kemaksiatan terhadap Allah, karena mereka tidak memerintah sesuatu kecuali berdasarkan keinginan hawa nafsu mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Insan ayat 24: Allah memerintahkan Nabi-Nya ﷺ agar bersabar atas kesulitan yang didapat dan dari musuh yang mengharuskan bersabar (bagi diri Nabi ﷺ). Dan agar menunggu hukuman dari Allah dan keputusan-Nya kepada mereka. Sebagaimana Allah pernah menyuruh agar tidak mentaati mereka orang-orang musyrik yang mereka larut dalam dosa dan syahwat, dan agar tidak mentaati mereka yang telah sampai pada puncak kekafiran dan pengingkaran. Berkata Ahli Tafsir : Orang yang berdosa dan kufur, keduanya ada pada Utbah bin Rabiah dan Al Walid bin Mughirah; Dimana mereka berdua menolak Rasul ﷺ dengan penolakan yang banyak, agar tidak mengikuti dakwah untuk beribadah kepada Allah saja."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu menyampaikan risalah-Nya. Atau maksudnya, bersabarlah kepada ketetapan Tuhanmu baik yang qadari (terhadap alam semesta) dengan tidak keluh kesah, maupun kepada ketetapan Tuhanmu yang syar’i (dalam agama), yakni lakukanlah dan jangan membuatmu berhenti meskipun ada yang menghalangi. Menurut sebagian mufassir, orang yang disebutkan dalam ayat tersebut adalah Utbah bin Rabii’ah dan Walid bin Mughirah yang meminta kepada Nabi shallallahu 'alaihi wa sallam agar berhenti menyampaikan risalahnya. Bisa juga maksudnya setiap orang yang berdosa dan orang kafir, yakni jangan taati keduanya siapa pun mereka berdua itu. Karena menaati mereka akan jatuh ke dalam maksiat dan mereka tidaklah memerintahkan kecuali yang sesuai dengan hawa nafsu mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Insan Ayat 24",
    "description": "23-24. Setelah diuraikan tentang balasan bagi yang bertakwa, selanjutnya dijelaskan tentang bagaimana bertakwa secara baik itu. Allah menurunkan petunjuk-Nya melalui Al-Qur'an. Inilah yang disinggung oleh ayat ini. Sesungguhnya kamilah yang menurunkan Al-Qur'an kepadamu wahai nabi Muhammad secara berangsur-angsur agar mudah memahaminya. Maka bersabarlah setiap saat untuk menghadapi dan melaksanakan ketetapan tuhanmu, dan janganlah engkau ikuti orang yang berdosa dan orang yang kafir di antara mereka yang mencoba untuk menghentikan dakwahmu. 25-26. Dan untuk lebih menguatkan hatimu menghadapi kesulitan dakwah, maka ingatlah selalu serta sebutlah nama tuhanmu di antaranya dengan melaksanakan salat pada waktu pagi yaitu subuh dan petang yaitu zuhur dan asar. Dan pada sebagian dari malam yaitu maghrib dan isya', maka bersujudlah kepada-Nya dan bertasbihlah kepada-Nya yaitu dengan melaksanakan salat tahajud pada bagian yang panjang di malam hari."
  }
]