[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "24-25. Maka bersabarlah dalam menerima keputusan Tuhanmu yang merupakan takdirNya dan hukumNya yang merupakan agama, serta berjalanlah di atasnya. Jangan taati orang-orang musyrik yang tenggelam dalam hawa nafsu atau terbenam dalam kekafiran dan kesesatan. Teruslah berdzikir menyebut Nama Tuhanmu dan berdoa kepadaNya di pagi dan sore hari."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "25. Dan sebutlah nama Rabbmu dengan mendirikan salat Fajar di awal siang dan salat Zuhur serta Asar di akhir siang."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "25-26. Dan sibukkanlah waktumu dengan berzikir dan mendekatkan diri kepada Allah dengan amalan shalih; dan ketika malam hari tambahlah ketaatanmu dengan memperbanyak tasbih dan sujud, karena malam hari lebih mudah untuk khusyu dan pengabulan doa."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "25. وَاذْكُرِ اسْمَ رَبِّكَ بُكْرَةً وَأَصِيلًا (Dan sebutlah nama Tuhanmu pada (waktu) pagi dan petang) Yakni shalatlah pada awal dan akhir siang, yaitu shalat subuh dan shalat ashar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "25. Istiqamahlah menyebut nama Tuhanmu di awal waktu siang dan akhirnya. Pada waktu shalat shubuh, dhuhur dan ashar"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sebutlah nama Tuhanmu pada pagi dan petang} permulaan dan akhir siang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "25. Karena sabar amat membantu dalam menunaikan ketaatan dan memperbanyak berdzikir (mengingat dan menyebut Allah), Allah memerintahkan hal itu seraya berfirman, “Dan sebutlah nama Rabbmu pada (waktu) pagi dan petang,” yakni, dipermulaan dan di akhir siang, termasuk di dalamnya shalat-shalat wajib dan shalat-shalat pengiring, berupa shalat sunnah, dzikir, tasbih, tahlil, dan takbir di waktu-waktu tersebut."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Insan ayat 25: Allah memerintahkan Nabi ﷺ agar terus menerus mengingat Allah dan memanjatkan doa kepada-Nya di awal waktu siang dan di akhirnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Oleh karena sabar perlu dibantu dengan menjalankan ibadah dan banyak berdzikr, maka Allah Subhaanahu wa Ta'aala memerintahkan demikian. Termasuk ke dalam apa yang disebutkan dalam ayat tersebut adalah menjalankan shalat yang lima waktu dan shalat-shalat sunah serta berdzikr pada waktu-waktu tersebut. Ada yang menafsirkan dengan melaksanakan shalat Subuh, Zhuhur dan ‘Ashar."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Insan Ayat 25",
    "description": "25-26. Dan untuk lebih menguatkan hatimu menghadapi kesulitan dakwah, maka ingatlah selalu serta sebutlah nama tuhanmu di antaranya dengan melaksanakan salat pada waktu pagi yaitu subuh dan petang yaitu zuhur dan asar. Dan pada sebagian dari malam yaitu maghrib dan isya', maka bersujudlah kepada-Nya dan bertasbihlah kepada-Nya yaitu dengan melaksanakan salat tahajud pada bagian yang panjang di malam hari"
  }
]