[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "26. Dan dari sebagian malam hari tunduklah kepada Tuhanmu dan shalatlah untukNya, bertahajudlah untukNya dalam waktu yang lama."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "26. Dan ingatlah Allah pada dua salat malam, yaitu salat Magrib dan Isya, lalu salatlah tahajjud setelah keduanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "26. Dari separoh malam, shalatlah kamu wahai Nabi bersama umatmu maghrib dan isya’. Adapun sisa malam yang panjang gunakanlah untuk shalat tahajjud"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Pada sebagian malam bersujudlah kepadaNya} shalatlah kepadaNya shalat maghrib dan isya' {dan bertasbihlah kepadaNya} dan shalat tahajjudlah kepadaNya {pada malam yang panjang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "26. “Dan pada sebagian dari malam, maka sujudlah kepadaNya,” yakni perbanyaklah bersujud padaNya, dan ini mencakup banyaknya shalat, “dan bertasbihlah kepadaNya pada malam yang panjang.” Telah disebutkan sebelumnya pembatasan terhadap kemutlakan ayat ini, “Hai orang yang berselimut (Muhammad),bangunlah (untuk sembahyang) di malam hari, kecuali sedikit (daripadanya), (yaitu) seperduanya atau kurangilah dari seperdua itu sedikit. atau lebih dari seperdua itu. Dan bacalah Al Quran itu dengan perlahan-lahan. -Al-Muzammil:1-4 –"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Insan ayat 26: Allah memerintahkan kepada Nabi-Nya ﷺ agar shalat malam, dan agar mensucikan Allah dan shalat tahajjud dengan waktu yang panjang."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ada yang menafsirkan dengan melaksanakan shalat Maghrib dan Isya. Yaitu mengerjakan shalat malam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Insan Ayat 26",
    "description": "25-26. Dan untuk lebih menguatkan hatimu menghadapi kesulitan dakwah, maka ingatlah selalu serta sebutlah nama tuhanmu di antaranya dengan melaksanakan salat pada waktu pagi yaitu subuh dan petang yaitu zuhur dan asar. Dan pada sebagian dari malam yaitu maghrib dan isya', maka bersujudlah kepada-Nya dan bertasbihlah kepada-Nya yaitu dengan melaksanakan salat tahajud pada bagian yang panjang di malam hari. 27. Di antara alasan utama mengapa manusia menolak dakwah karena sesungguhnya mereka, orang kafir, itu mencintai kehidupan dunia yang memang kasat mata dan cepat diraih, meskipun juga cepat musnahnya, dan meninggalkan hari yang berat yaitu hari akhirat di belakangnya."
  }
]