[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "27. Sesungguhnya orang-orang musyrik itu mencintai dunia dan menyibukkan diri dengannya, mencampakkan usaha untuk meraih akhirat di balik punggung mereka, dan melalaikan apa yang menjadi sebab keselamatan mereka pada hari yang kesulitannya besar."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "27. Sesungguhnya orang-orang musyrik itu menyukai kehidupan dunia dan berupaya keras untuk mendapatkannya serta meninggalkan di belakang mereka urusan hari Kiamat, yaitu hari yang berat, di mana pada hari itu terdapat berbagai kesusahan dan cobaan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "27-28. Dan janganlah kamu pedulikan orang-orang yang mendustakan dan mengingkarimu, karena mereka lebih mengutamakan kehidupan dunia daripada akhirat, tidak peduli dan tidak beriman kepada hari akhir, yaitu hari yang berat untuk dilalui karena terdapat berbagai peristiwa besar dan mengerikan. Mereka telah lalai dari Allah yang telah menciptakan mereka dari ketidakadaan dengan kuasa-Nya, membaguskan penciptaan mereka, dan memberi kemampuan kepada mereka untuk beramal. Dan jika Allah berkehendak, maka Dia berkuasa untuk membinasakan dan mengganti mereka dengan makhluk yang lain yang mau mentaati-Nya; namun dengan hikmah-Nya, Dia memberi kesempatan bagi mereka dan tidak segera menurunkan azab."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "27. إِنَّ هٰٓؤُلَآءِ يُحِبُّونَ الْعَاجِلَةَ (Sesungguhnya mereka (orang kafir) menyukai kehidupan dunia) Yakni kehidupan dunia. وَيَذَرُونَ وَرَآءَهُمْ يَوْمًا ثَقِيلًا(dan mereka tidak memperdulikan kesudahan mereka, pada hari yang berat (hari akhirat)) Yakni hari kiamat, disebut dengan hari yang berat karena terdapat berbagai musibah dan kengerian di dalamnya, sedangkan mereka tidak menyiapkan diri untuk menghadapinya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "27. Sesungguhnya orang kafir itu mencintai dunia, dan justru mengabaikan hari yang penuh dengan bencana besar yaitu hari kiamat. Mereka tidak menyiapkan diri atau bekal dengan iman dan amal shaleh"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya mereka itu mencintai kehidupan yang cepat dan meninggalkan di belakang mereka} mengabaikan yang ada di depan mereka {hari yang berat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "27. Allah berfirman, “Sesungguhnya mereka (orang kafir),” yakni orang-orang yang mendustakanmu wahai Rasul setelah tanda-tanda kebesaran Allah jelas bagi mereka dan setelah mereka diberi kabar gembira dan ancaman meski demikian hal itu tidak berguna bagi mereka sama sekali bahkan mereka tetap mengutamakan, “kehidupan dunia,” dan merasa tenang padanya, “dan mereka tidak memperdulikan,” yakni tidak beramal dan mengacuhkan, “kesudahan mereka,” yakni di hadapan mereka, “pada hari yang berat (Hari Akhirat),” yaitu Hari Kiamat yang ukurannya selama lima puluh ribu tahun dari hari-hari yang biasa kalian hitung. Allah berfirman, “mereka datang dengan cepat kepada penyeru itu. Orang-orang kafir berkata: \"Ini adalah hari yang berat\" - Al-Qamar: 8 – Seolah-olah mereka hanya diciptakan untuk hidup di dunia dan menetap di atasnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Insan ayat 27: Allah menjelaskan kepada Nabi-Nya ﷺ, bahwa mereka orang-orang musyrik sangat mencintai dunia dan mengutamakannya di atas kepentingan akhirat, dan mereka berpaling meninggalkan amalan untuk hari kiamat, dan dengan apa yang membuat mereka selamat dari hari kiamat yang memiliki urusan yang besar dan dahsyat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Meskipun engkau telah membacakan ayat-ayat Allah kepada mereka, mendorong dan menakut-nakuti, namun ayat-ayat itu tetap saja tidak bermanfaat bagi mereka, karena mereka lebih mengutamakan dunia dan merasa tenteram dengannya serta tidak mau beramal untuk menghadapi hari yang sangat berat, yaitu hari Kiamat seakan-akan mereka tidak diciptakan kecuali untuk dunia dan tinggal di sana. Dengan tidak beramal untuk menghadapinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Insan Ayat 27",
    "description": "Di antara alasan utama mengapa manusia menolak dakwah karena sesungguhnya mereka, orang kafir, itu mencintai kehidupan dunia yang memang kasat mata dan cepat diraih, meskipun juga cepat musnahnya, dan meninggalkan hari yang berat yaitu hari akhirat di belakangnya. 28. Ayat ini mengingatkan manusia akan kuasa Allah dalam menciptakan makhluk dari ketiadaan. Kami telah menciptakan mereka bukan ciptaan yang sembarangan dan juga menguatkan persendian tubuh mereka padahal tadinya hanyalah air mani yang begitu lemah dan hina. Tetapi, jika kami menghendaki untuk membinasakan mereka itupun mudah, dan kemudian kami dapat mengganti dengan yang serupa mereka."
  }
]