[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "28. Kami telah menciptakan mereka dan membaguskan penciptaan mereka. Bila Kami berkehendak, Kami dapat membinasakan mereka dan mendatangkan kaum lain yang taat dan melaksanakan perintah-perintah Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "28. Kami telah menciptakan mereka dan memperkuat penciptaan mereka dengan menguatkan sendi-sendi, anggota tubuh mereka dan lainnya. Seandainya Kami berkehendak membinasakan dan menggantikan mereka dengan orang-orang yang semisal dengan mereka niscaya Kami mampu membinasakan dan menggantikan mereka dengan orang-orang tersebut."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "28. وَشَدَدْنَآ أَسْرَهُمْ ۖ (dan menguatkan persendian tubuh mereka) Yakni kami rekatkan persendian mereka dengan urat dan saraf. وَإِذَا شِئْنَا بَدَّلْنَآ أَمْثٰلَهُمْ تَبْدِيلًا(apabila Kami menghendaki, Kami sungguh-sungguh mengganti (mereka) dengan orang-orang yang serupa dengan mereka) Yakni seandainya Kami menghendaki niscaya Kami akan membinasakan mereka dan mendatangkan makhluk yang lebih taat dari mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "28. Kami-lah yang telah menciptakan orang kafir dan musyrik, kemudian kami menjadikan tubuh mereka kuat, sendi-sendi bisa saling menguatkan, juga disempurnakan dengan kulit dan saraf. Apabila Kami berkehendak, akan Kami hancurkan/binasakan mereka kemudian Kami ganti dengan yang lain"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Hari yang berat yaitu hari kiamat {Kami telah menciptakan mereka dan menguatkan persendian tubuh mereka} Kami menguatkan penciptaan mereka {Jika berkehendak, Kami dapat mengganti dengan orang-orang yang serupa mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "28. Kemudian Allah menunjukkan dalil kepada mereka atas kebangkitan mereka dengan dalil aqli, yaitu dalil permulaan penciptaan seraya berfirman, “Kami telah menciptakan mereka,” yakni Kami menciptakan merekan setelah sebelumnya mereka tidak ada, “dan menguatkan persendian tubuh mereka,” yakni Kami kokohkan tubuh, urat, otot, nadi, kekuatan lahir dan kekuatan batin hingga tubuh sempurna, supaya mampu untuk melakukan apa saja yang diinginkan. Dzat Yang menciptakan mereka dalam kondisi seperti ini mampu untuk mengembalikan mereka setelah mereka mati untuk mendapatkan balasan atas amal perbuatan yang mereka lakukan. Dzat yang memindahkan mereka di alam ini dalam berbagai fase tentu tidak sepatutnya membiarkan mereka sia-sia, lalu tidak diperintah, tidak dilarang, tidak diberi pahala dan tidak disiksa. Karena itu Allah berfirman, “Apabila Kami menghendaki, Kami sungguh-sungguh mengganti (mereka) dengan orang-orang yang serupa dengan mereka,” yakni Kami akan menghidupkan kalian pada Hari Kebangkitan dengan kehidupan lain dan Kami kembalikan kalian dengan diri-diri kalian; mereka adalah orang-orang serupa dan memang diri mereka sendiri."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Insan ayat 28: Allah mengabarkan bahwa Dia menciptakan mereka orang-orang musyrik dari ketiadaan mereka, dan Allah menjadikan penciptaan bagi mereka dan menjadikan anggota badan mereka untuk ketaatan, atas kehendak-Nya. Allah juga menjadikan mereka kuat. Bersaamaan dengan ini semua, jika Allah menghendaki untuk membinasakan mereka dan mendatangkan yang serupa dengan mereka yang kuat (Allah mampu), akan tetapi Allah menghedaki demikian (agar supaya mereka) mentaati perintah-Nya, serta Allah memerintahkan mereka dengan tangannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala berdalih dengan dalil ‘aqli (akal) yang menunjukkan bahwa mereka sangat mungkin sekali dibangkitkan. Dari yang sebelumnya tidak ada. Oleh karena Allah Subhaanahu wa Ta'aala mampu berbuat demikian, maka Dia mampu pula menghidupkan mereka setelah mereka mati. Demikian pula Dia yang merubah kejadian mereka dari kejadian yang satu kepada kejadian selanjutnya sehingga tidak layak bagi-Nya membiarkan mereka begitu saja; tidak diperintah dan tidak dilarang serta tidak diberikan balasan. Maksudnya mengganti mereka dengan kaum yang lain. Bisa juga maksudnya mengadakan mereka kembali setelah mereka mati."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Insan Ayat 28",
    "description": "Ayat ini mengingatkan manusia akan kuasa Allah dalam menciptakan makhluk dari ketiadaan. Kami telah menciptakan mereka bukan ciptaan yang sembarangan dan juga menguatkan persendian tubuh mereka padahal tadinya hanyalah air mani yang begitu lemah dan hina. Tetapi, jika kami menghendaki untuk membinasakan mereka itupun mudah, dan kemudian kami dapat mengganti dengan yang serupa mereka. 29. Sebagai bagian akhir dari surah ini maka Allah mengingatkan tentang salah satu fungsi utama Al-Qur'an. Sungguh, ayat-ayat ini adalah peringatan tentang kuasa Allah, maka barangsiapa menghendaki kebaikan bagi dirinya tentu dia akan bersungguh-sungguh mengambil jalan menuju kepada tuhannya."
  }
]