[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "29-31. Sesungguhnya surat ini merupakan nasihat bagi seluruh manusia. Barangsiapa menginginkan kebaikan bagi dirinya di dunia dan akhirat, tentu dia mengambil iman dan takwa sebagai jalan yang menyampaikannya kepada ampunan Allah dan ridhaNya. Mereka tidak menginginkan sesuatu kecuali dengan takdir Allah dan kehendakNya, Mahabijaksana dalam pengaturan dan perbuatanNya. Allah memasukkan siapa yang Dia kehendaki dari hamba-hambaNya dalam rahmat dan ridhaNya, mereka adalah orang-orang Mukmin. Allah menyiapkan bagi orang-orang zhalim yang melampaui batasan-batasan Allah, azab yang pedih."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "29. Sesungguhnya Surah ini adalah nasihat dan peringatan, barangsiapa menghendaki untuk mengambil jalan yang mengantarkannya kepada keridaan Rabbnya maka ia mengambil jalan ini."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "29-30. Ayat-ayat yang diturunkan kepada Rasulullah ini mengandung pelajaran bagi seluruh makhluk; maka barangsiapa yang hendak menempuh jalan kebaikan dan petunjuk maka dia akan mengambil sebab-sebab yang dapat menuntunnya kepada jalan itu, mentaati Tuhannya, dan melaksanakan perintah-Nya. Dan kehendak manusia ini tidak akan ada kecuali jika Allah menghendaki-Nya; Dia Maha Pencipta dan Pengatur segala urusan alam semesta; seluruh kehendak makhluk mengikuti kehendak-Nya, dan Allah telah berkehendak untuk menyeru hamba-hamba-Nya agar mentaati dan mendekatkan diri kepada-Nya. Dia Maha Mengetahui segala keadaan seluruh makhluk-Nya dan Maha Bijaksana dalam ketetapan dan perintah-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "29. Sesungguhnya surat dan ayat Alquran ini adalah pelajaran dan peringatan. Barang siapa ingin selamat dari azab di akhirat maka dia akan menempuh jalan untuk mendekatkan diri kepada Tuhannya dengan baik"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya ini adalah peringatan} peringatan dan pelajaran {Maka siapa yang menghendi, maka mengambil jalan menuju Tuhannya} jalan menuju keridhaanNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "29. “Sesungguhnya (ayat-ayat ini) adalah suatu peringatan,” yang dijadikan peringatan bagi orang yang beriman sehingga bisa memanfaatkan peringatan dan kabar gembira yang ada di dalamnya. “Maka barangsiapa menghendaki (kebaikan bagi dirinya) niscaya dia mengambil jalan kepada RabbNya,” yakni, jalan yang mengantarkan padaNya. Allah telah menjelaskan kebenaran dan petunjuk, kemudian memberikan pilihan pada manusia antara menempuh jalan tersebut atau lari darinya; dan itu sebagai penegakkan hujjah baginya. Agar orang yang celaka binasa setelah ada penjelasan dan hiduplah orang yang hidup setelah ada penjelasan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Insan ayat 29: 29-31. Ketahuilah wahai manusia, bahwa surat ini dan yang di dalamnya adalah nasihat bagi kalian. Maka barangsiapa yang menginginkan nasihat, manfaatkanlah, ambillah pelajaran dan berbuatlah kebaikan dengan tauhid dan amal shalih yang akan mengantarkan kepada ampunan Allah dan keridhaannya. Dan ketahuilah juga bahwa kalian tidaklah menginginkan urusan dari urusan-urusan (di dunia) kecuali dengan takdir Allah dan kehendak-Nya; Kemudian Allah mengabarkan bahwa Dia Maha Mengetahui atas seluruh hamba-Nya, Dia adalah hakim atas akhir keadaan hamba dan ciptaan-Nya. Allah mengabarkan bahwa dia berkehendak menurut diri-Nya kepada hambanya yang shalih yang selaras dengan apa yang datang kepada Rasul-Nya untuk dimasukkan ke dalam surga. Adapun orang-orang yang dzalim yang melampaui batasan-batasan yang ditentukan oleh Allah, yang mereka lebih memilih jalan dosa dan kesesatan; Maka Allah telah siapkan bagi mereka adzab yang keras dan pedih. Dan firman Allah : وَمَا تَشَآءُونَ yaitu jika Aku menghendaki mereka (maka) itu adalah ujian dari Allah; Allah berikan kepada kalian pilihan dan jani berupa balasan jika kalian memilih petunjuk Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang seorang mukmin dapat sadar dengannya dan dapat mengambil manfaat dari targhib dan tarhib yang ada di dalamnya. Yakni jalan yang menyampaikan kepada Allah, dan Allah Subhaanahu wa Ta'aala telah menerangkan jalan tersebut serta memberikan pilihan kepada manusia untuk menempuhnya atau tidak."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Insan Ayat 29",
    "description": "Sebagai bagian akhir dari surah ini maka Allah mengingatkan tentang salah satu fungsi utama Al-Qur'an. Sungguh, ayat-ayat ini adalah peringatan tentang kuasa Allah, maka barangsiapa menghendaki kebaikan bagi dirinya tentu dia akan bersungguh-sungguh mengambil jalan menuju kepada tuhannya. 30. Terkadang ada yang merasa memiliki kemampuan untuk mewujudkan kehendaknya, Allah menampik anggapan tersebut. Tetapi kamu tidak mampu menempuh jalan itu, kecuali apabila dikehendaki Allah. Sungguh, Allah maha mengetahui segala sesuatu, mahabijaksana dalam seluruh kehendak dan ketetapan-Nya."
  }
]