[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "2-3. Sesungguhnya Kami menciptakan manusia dari setetes air yang merupakan gabungan antara sperma laki-laki dan sperma perempaun. Kami mengujinya dengan beban-beban syariat sesudah itu, karena itu Kami membuatnya mendengar dan melihat agar dia mendengar ayat-ayat dan melihat bukti-bukti. Sesungguhnya Kami menjelaskan dan mengenalkan kepadanya jalan hidayah dan kesesatan, kebaikan dan keburukan, agar dia menjadi Mukmin yang bersyukur atau kafir yang pengingkar."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Sesungguhnya Kami telah menjelaskan kepadanya melalui lisan para Rasul Kami jalan petunjuk, hingga dengan demikian jelaslah bagi mereka jalan kesesatan. Maka setelah itu ia bisa mendapat petunjuk ke jalan yang lurus lalu menjadi seorang hamba yang beriman dan bersyukur kepada Allah, atau menjadi sesat dari jalan yang lurus lalu menjadi hamba yang kafir dan menentang ayat-ayat Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "3. Setelah Allah menyampaikan hikmah penciptaan manusia adalah sebagai ujian, kemudian Allah menyampaikan bahwa Dia telah memudahkan bagi mereka jalan hidayah yang dapat menuntun mereka kepada ketauhidan dan ketaatan. Sebagian manusia menempuh jalan hidayah ini, sehingga mereka memuji dan bersyukur kepada Allah; dan sebagian lain tersesat sehingga mereka mengingkari Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. إِنَّا هَدَيْنٰهُ السَّبِيلَ إِمَّا شَاكِرًا وَإِمَّا كَفُورًا (Sesungguhnya Kami telah menunjukinya jalan yang lurus; ada yang bersyukur dan ada pula yang kafir) Yakni Kami tunjukkan dan jelaskan kepadanya jalan hidayah dan kesesatan, kebaikan dan keburukan; serta Kami jelaskan padanya manfaat dan mudharat yang dapat mereka ketahui dengan fitrah dan akalnya, baik itu ia adalah orang yang bersyukur maupun orang yang ingkar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Sungguh Kami telah menunjukkan kepada mereka jalan kebaikan dan jalan keburukan, Kami juga menunjukkan manfaat dan madharatnya. Adapun orang mukmin senantiasa bersyukur atas nikmat petunjuk itu, namun orang kafir tidak tahu berterimakasih dan syukur keapada Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya Kami telah menunjukkan kepadanya jalan} Kami telah menjelaskan kepadanya jalan menuju petunjuk dan kesesatan {ada yang bersyukur dan ada pula yang sangat ingkar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3. Selanjutnya Allah mengutus para rasul untuknya dan menurunkan kitab suci kepadanya serta menunjukannya pada jalan yang menghantarkannya kepada Allah. Allah menjelaskan, menganjurkan, dan memberitahukan dengan perangkat-perangkat yang ada dalam dirinya yang bisa menghantarkannya kepada Allah. Allah juga memberitahukan apa-apa yang akan diperolehnya bila ia menempuh jalan tersebut dan mengujinya dengan hal itu. Selanjutnya manusia terbagi menjadi tipe yang bersyukur atas nikmat Allah yang diberikan padanya dengan menunaikan kewajiban-kewajiban yang dibebankan Allah padanya dan tipe manusia yang kufur terhadap nikmat Agama dan dunia yang diberikan padanya. Manusia tipe ini menolaknya dan kufur terhadap Rabbnya serta menempuh jalan yang mengantarnya menuju kebinasaan. Allah menyebutkan kedua golongan tersebut pada saat pembalasan nanti seraya berfirman,"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Insan ayat 3: Kemudian Allah mengabarkan bahwa orang-orang yang diberikan beban syariat ini diberikan jalan petunjuk dan jalan kesesatan, kemudian diperintahkan untuk memilihnya; Maka siapa yang menjadi orang yang bersyukur atas nikmat Allah, mengetahui akan karunia-Nya, serta beramal dengan apa yang datang dari Rasul-Nya; Maka ia menjadi orang yang memilih jalan petunjuk. Dan siapa yang mengingkari dan kufur terhadap nikmat Allah; Maka menjadi orang yang memilih jalan kesesatan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan menurunkan kitab dan mengutus para rasul. Yakni beriman."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Insan Ayat 3",
    "description": "Potensi lainnya yang dianugerahkan Allah kepada manusia adalah berupa petunjuk, seperti yang ditegaskan pada ayat ini. Sungguh, kami telah menunjukkan kepadanya jalan yang jelas lagi lurus tidak ada jalan yang lurus selainnya, di antara manusia ada yang bersyukur atas nikmat dan petunjuk tuhannya dan ada pula yang kufur, menutupi kebenaran dan mengingkari nikmat-nikmat-Nya. 4. Bagi yang kufur maka Allah telah menyediakan balasan siksa yang mengerikan, seperti yang ditegaskan pada ayat ini. Sungguh, kami telah menyediakan bagi orang-orang kafir yang mantap kekafirannya, rantai yang digunakan untuk mengikat kaki, dan belenggu dan juga neraka yang menyala-Nyala."
  }
]