[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "29-31. Sesungguhnya surat ini merupakan nasihat bagi seluruh manusia. Barangsiapa menginginkan kebaikan bagi dirinya di dunia dan akhirat, tentu dia mengambil iman dan takwa sebagai jalan yang menyampaikannya kepada ampunan Allah dan ridhaNya. Mereka tidak menginginkan sesuatu kecuali dengan takdir Allah dan kehendakNya, Mahabijaksana dalam pengaturan dan perbuatanNya. Allah memasukkan siapa yang Dia kehendaki dari hamba-hambaNya dalam rahmat dan ridhaNya, mereka adalah orang-orang Mukmin. Allah menyiapkan bagi orang-orang zhalim yang melampaui batasan-batasan Allah, azab yang pedih."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "30. Dan tidaklah kalian menginginkan jalan yang mengantarkan kalian kepada rida Allah kecuali Allah menghendaki hal itu dari kalian. Semua perkara dikembalikan kepada-Nya. Sesungguhnya Allah Maha Mengetahui apa yang baik dan apa yang tidak baik bagi hamba-Nya, Maha Bijaksana di dalam penciptaan, takdir dan syariat-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "30. وَمَا تَشَآءُونَ إِلَّآ أَن يَشَآءَ اللَّـهُ (Dan kamu tidak mampu (menempuh jalan itu), kecuali bila dikehendaki Allah) Yakni kalian tidak menghendaki untuk menembuh jalan kepada Allah kecuali jika Allah menghendaki hal itu. ketetapan kembali kepada-Nya, dan kebaikan dan keburukan berada di tangan-Nya; sehingga kehendak makhluk semata tidak akan mampu mendatangkan kebaikan atau menolak keburukan, kecuali dengan kehendak dari Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "30. Namun kalian tidak akan mampu/bisa menempuh jalan ketaatan itu wahai manusia, kecuali pada waktu yang Allah kehendaki. Segala sesuatu adalah atas kehendak Allah, bukan atas kemauan kalian. Ilmu Allah Maha Luas terhadap makhluk-Nya dan apa yang sesuai untuk setiap individu dari mereka. Allah Maha Bijaksana dalam segala keputusan-Nya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kalian tidak menghendaki kecuali apabila dikehendaki Allah. Sesungguhnya Allah Maha Mengetahui lagi Maha bijaksana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "30. “Dan kamu tidak mampu (menempuh jalan itu), kecuali bila dikehendaki Allah” karena sesungguhnya kehendak Allah apsti terlaksana. “Sesunnguhnya Allah Maha Mengetahui lagi Mahabijaksana,” Allah memiliki kebijaksanaan dalam memberi petunjuk orang yang mendapatkan hidayah dan menyesatkan orang yang tersesat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Insan ayat 30: 29-31. Ketahuilah wahai manusia, bahwa surat ini dan yang di dalamnya adalah nasihat bagi kalian. Maka barangsiapa yang menginginkan nasihat, manfaatkanlah, ambillah pelajaran dan berbuatlah kebaikan dengan tauhid dan amal shalih yang akan mengantarkan kepada ampunan Allah dan keridhaannya. Dan ketahuilah juga bahwa kalian tidaklah menginginkan urusan dari urusan-urusan (di dunia) kecuali dengan takdir Allah dan kehendak-Nya; Kemudian Allah mengabarkan bahwa Dia Maha Mengetahui atas seluruh hamba-Nya, Dia adalah hakim atas akhir keadaan hamba dan ciptaan-Nya. Allah mengabarkan bahwa dia berkehendak menurut diri-Nya kepada hambanya yang shalih yang selaras dengan apa yang datang kepada Rasul-Nya untuk dimasukkan ke dalam surga. Adapun orang-orang yang dzalim yang melampaui batasan-batasan yang ditentukan oleh Allah, yang mereka lebih memilih jalan dosa dan kesesatan; Maka Allah telah siapkan bagi mereka adzab yang keras dan pedih. Dan firman Allah : وَمَا تَشَآءُونَ yaitu jika Aku menghendaki mereka (maka) itu adalah ujian dari Allah; Allah berikan kepada kalian pilihan dan jani berupa balasan jika kalian memilih petunjuk Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Karena kehendak Allah itu berlaku. Dia memiliki hikmah dalam memberikan petunjuk kepada orang yang mendapat petunjuk dan menyesatkan orang yang sesat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Insan Ayat 30",
    "description": "Terkadang ada yang merasa memiliki kemampuan untuk mewujudkan kehendaknya, Allah menampik anggapan tersebut. Tetapi kamu tidak mampu menempuh jalan itu, kecuali apabila dikehendaki Allah. Sungguh, Allah maha mengetahui segala sesuatu, mahabijaksana dalam seluruh kehendak dan ketetapan-Nya. 31. Dan dia akan memasukkan siapa pun yang dia kehendaki yang dinilai-Nya wajar menerimanya, ke dalam rahmat-Nya yaitu surga. Adapun bagi orang-orang zalim yang begitu mantap kezalimannya maka disediakan-Nya azab yang pedih."
  }
]