[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "5. Sesungguhnya ahli ketaatan dan keikhlasan yang menunaikan hak Allah akan minum pada Hari Kiamat dari gelas yang berisi khamar yang bercampur dengan wewangian paling bagus, yaitu air kafur."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Sesungguhnya orang-orang yang beriman dan taat kepada Allah pada hari Kiamat minum dari gelas yang berisi khamar yang penuh dan tercampur dengan air kafur yang wangi aromanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "5-6. Kemudian dimulailah pembahasan tentang balasan para penghuni surga yang merupakan orang-orang baik. Dalam kalimat ini terdapat isyarat mengenai sebab yang menjadikan mereka layak mendapat kenikmatan surga. Salah satu bentuk kenikmatan surga adalah para penghuninya dapat meminum khamr yang dicampur dengan kafur yang menjadikan minuman itu memiliki rasa dan aroma yang sedap. Minuman itu keluar dari mata air di surga sebagaimana mata air yang memancar. Mereka dapat menikmati minuman ini, dan dapat mengubah arah aliran mata airnya sesuai kehendak mereka untuk menambah kenimatan bagi mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. كَانَ مِزَاجُهَا كَافُورًا (yang campurannya adalah air kafur) Yakni itu adalah campurannya agar mempernikmat aroma dan rasa khamr itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Sesungguhnya orang-orang yang taat dan ikhlas, sedangkan mereka beriman dengan sepenuh hati, di surga mendapatkan minuman dari gelas yang dicampur dengan air kafur"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya orang-orang yang berbuat kebajikan akan minum dari gelas} cawan khamr {yang campurannya} campurannya {air kafur"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5. Sedangkan “orang-orang yang berbuat kebajikan,” mereka adalah orang-orang berhati baik, karena di dalamnya dipenuhi oleh ma’rifatullah, kecintaan kepada Allah, dan akhlak yang baik, sehingga amal perbuatan mereka baik dan mereka menggunakannya dengan amalan-amalan baik. Allah memberitahukan bahwa sesungguhnya mereka akan “minum dari gelas (berisi minuman),” yakni minuman nikmat dari arak yang “campurannya adalah air kafur,” yakni dicampurkan agar membuatnya dingin dan menghilangkan kerasnya arak. Kafur ini amat nikmat, terbebas dari berbagai unsur yang memperkeruh dan bau tajam seperti kafur dunia. Petaka dan bencana yang ada di dunia tidak terdapat dalam nama-nama benda yang disebutkan Allah dalam surga sebagaimana disebutkan dalam Firman Allah berikut, - “Berada di antara pohon bidara yang tak berduri, dan pohon pisang yang bersusun-susun (buahnya)” Al-Waqiah:29 - “dan (mereka dikaruniai) isteri-isteri yang disucikan serta keridhaan Allah” Ali imran : 15 - “Bagi mereka (disediakan) darussalam (surga) pada sisi Tuhannya” Al-An’am : 127 - “dan di dalam surga itu terdapat segala apa yang diingini oleh hati dan sedap (dipandang) mata” Az-Zukhruf: 71"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Insan ayat 5: Allah mengabarkan orang-orang yang selamat yaitu mereka yang ikhlas dalam ketaatan kepada Allah dan Rasul-Nya, mereka adalah orang-orang yang mencintai Allah dan Rasul-Nya ﷺ, mereka akan meminum khamr yang lezat pada hari kiamat yang bercampur dengan kapur, mereka meminum dengan minuman yang lezat rasanya, wangi aromanya, yang tidak memabukkan dan mengilangkan akal."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni orang-orang yang taat, atau orang-orang yang baik hatinya karena ada kecintaan kepada Allah dan mengenal-Nya dalam hatinya serta akhlak yang mulia sehingga anggota badan mereka menjadi baik dan mereka gunakan untuk berbuat baik. Untuk menyejukkannya dan mengurangi ketajaman minuman itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Insan Ayat 5",
    "description": "5-6. Bagi yang bertakwa Allah menyiapkan balasan yang sempurna. Di antaranya disebut pada ayat ini. Sungguh, orang-orang yang berbuat kebajikan akan minum dari gelas berisi minuman yang campurannya adalah air kafur, agar lebih menyegarkan dan menambah aroma lebih sedap. Kafur yang dimaksud adalah mata air dalam surga yang diminum oleh hamba-hamba Allah yang taat dan selalu berusaha mendekatkan diri kepada-Nya, dan mereka para penghuni surga tersebut dapat memancarkannya dengan sebaik-baiknya"
  }
]