[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "6-10. Minuman yang dicampur dengan kafur ini adalah mata air yang darinya para hamba Allah akan minum, mereka meng-alirkannya sebagaimana mereka kehendaki dengan mudah. Orang-orang itu dulu di dunia memenuhi apa yang mereka wajibkan atas diri mereka sendiri berupa ketaatan kepada Allah, mereka takut kepada azab Allah pada Hari Kiamat yang mudaratnya berat, keburukannya merata dan menyebar atas manusia, kecuali siapa yang dirahmati Allah. Mereka memberi makan, sekalipun mereka mencintai makanan itu karena mereka membutuhkannya, kepada orang miskin lemah yang tidak mampu berusaha yang tidak mempunyai apa yang mencukupinya, anak kecil yang bapaknya mati sementara dia belum baligh dan tidak berharta, serta tawanan yang ditawan dalam perang dari kalangan orang-orang kafir dan lainnya. Mereka berkata dalam diri mereka, “Kami berbuat baik kepada kalian demi mencari ridha dan pahala Allah, kami tidak mencari ganti, tidak menginginkan pujian dan sanjungan dari kalian. Sesungguhnya kami takut kepada (azab) Tuhan kami pada suatu hari yang padanya wajah-wajah menjadi muram durja, serta kening-kening berkerut karena bebannya yang berat dan ketakutannya yang mencekam.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Minuman yang disediakan untuk orang-orang yang taat ini berasal dari mata air yang mudah untuk digapai, mengalir deras dan tidak pernah kering, diminum oleh hamba-hamba Allah, mereka dapat mengalirkan dan menemukannya di mana saja mereka kehendaki."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. عَيْنًا يَشْرَبُ بِهَا عِبَادُ اللَّـهِ ((yaitu) mata air (dalam surga) yang daripadanya hamba-hamba Allah minum) Yakni mereka meminum khamr yang diambil dari mata air itu. atau maknanya adalah mereka meminum khamr itu dengan campuran air yang diambil dari mata air itu. يُفَجِّرُونَهَا تَفْجِيرًا(yang mereka dapat mengalirkannya dengan sebaik-baiknya) Yakni memancarkannya dengan deras, seperti air sungai yang memancar ke sana kemari."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Mereka meminum arak yang bercampur dengan air kafur. Yaitu air dari mata air yang diminum oleh hamba-hamba Allah yang saleh dan yang beruntung mendapatkan nikmat surga. Mereka berjalan-jalan di surga sesuka mereka dengan mudah, dan mereka menikmati nikmat surga itu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "(yaitu) mata air yang diminum oleh} yang diminum {hamba-hamba Allah dan dapat mereka pancarkan dengan mudah} Mereka mengalirkannya sesuai kehendak mereka dengan pancaran yang mudah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6. “(Yaitu) mata air (dalam surga) yang dari padanya hamba-hamba Allah minum,” yakni, air nikmat dalam gelas yang mereka minum itu tidak dikhawatirkan habis, tapi air tersebut memiliki bahan dasar yang tidak pernah terputus. Yaitu mata air abadi yang selalu meluap dan mengalir yang dipancarkan oleh hamba-hamba Allah kapan pun mereka mau dan bagaimana pun yang mereka inginkan. Bila mereka menginginkan, mereka bisa memindahkannya ke kebun penuh bunga atau dipindahkan ke taman-taman hijau ataupun di sisi-sisi istana dan tempat-tempat tinggal yang penuh hiasan, atau bisa dipindahkan ke tempat mana saja yang menurut mereka indah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Insan ayat 6: Allah menjelaskan bahwa minuman yang bercampur dengan kapur ini adalah dari mata air surga yang mengalir, hamba-hamba Allah yang berbahagia akan meminum darinya dan bisa melakukan apa saja sesuai dengan apa yang mereka kehendaki. Mereka juga dapat mengalirkannya menuju yang mereka mau dan mereka juga bisa memanfaatkannya menurut apa yang mereka senangi. Firman Allah يَشْرَبُ بِهَا yaitu mereka akan melihat, dan fi’il يَشْرَبُ muta’addi dengan huruf ba’ pada firman Allah بِهَا. Ba’ ini dinamakan ba’ yang disandarkan; Agar mengandung makna melihat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni minuman yang enak itu tidak perlu mereka takut kehabisan, bahkan minuman itu ada sumbernya yang tidak akan habis, yaitu mata air yang selalu melimpah dan mengalir yang dipancarkan oleh hamba-hamba Allah ke mana saja yang mereka mau. Yakni mengarahkannya ke tempat yang mereka mau, baik ke istana, ke rumah mereka, ke majlis-majlis mereka, ke kebun mereka atau ke tempat lainnya, dan airnya mengalir tanpa perlu parit (galian)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Insan Ayat 6",
    "description": "5-6. Bagi yang bertakwa Allah menyiapkan balasan yang sempurna. Di antaranya disebut pada ayat ini. Sungguh, orang-orang yang berbuat kebajikan akan minum dari gelas berisi minuman yang campurannya adalah air kafur, agar lebih menyegarkan dan menambah aroma lebih sedap. Kafur yang dimaksud adalah mata air dalam surga yang diminum oleh hamba-hamba Allah yang taat dan selalu berusaha mendekatkan diri kepada-Nya, dan mereka para penghuni surga tersebut dapat memancarkannya dengan sebaik-baiknya. 7. Di antara amal kebaikan yang akan diberikan balasan seperti di atas antara lain adalah bahwa mereka memenuhi nazar sebagai bukti mereka adalah orang-orang cenderung kepada kebaikan, dan takut akan suatu hari yang azabnya merata di mana-mana yaitu siksa neraka."
  }
]