[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "6-10. Minuman yang dicampur dengan kafur ini adalah mata air yang darinya para hamba Allah akan minum, mereka meng-alirkannya sebagaimana mereka kehendaki dengan mudah. Orang-orang itu dulu di dunia memenuhi apa yang mereka wajibkan atas diri mereka sendiri berupa ketaatan kepada Allah, mereka takut kepada azab Allah pada Hari Kiamat yang mudaratnya berat, keburukannya merata dan menyebar atas manusia, kecuali siapa yang dirahmati Allah. Mereka memberi makan, sekalipun mereka mencintai makanan itu karena mereka membutuhkannya, kepada orang miskin lemah yang tidak mampu berusaha yang tidak mempunyai apa yang mencukupinya, anak kecil yang bapaknya mati sementara dia belum baligh dan tidak berharta, serta tawanan yang ditawan dalam perang dari kalangan orang-orang kafir dan lainnya. Mereka berkata dalam diri mereka, “Kami berbuat baik kepada kalian demi mencari ridha dan pahala Allah, kami tidak mencari ganti, tidak menginginkan pujian dan sanjungan dari kalian. Sesungguhnya kami takut kepada (azab) Tuhan kami pada suatu hari yang padanya wajah-wajah menjadi muram durja, serta kening-kening berkerut karena bebannya yang berat dan ketakutannya yang mencekam.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Dan sifat-sifat para hamba yang meminumnya yaitu bahwa mereka menepati segala ketaatan yang mereka wajibkan atas diri mereka sendiri dan mereka takut terhadap suatu hari yang mana keburukannya merata ke mana-mana, yaitu hari Kiamat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "7. Salah satu amal shalih yang dilakukan orang-orang baik ini ketika di dunia sehingga mereka layak mendapatkan surga adalah memenuhi sumpah nadzar, yaitu sumpah seseorang untuk melaksanakan suatu ketaatan di samping ketaatan yang diwajibkan kepadanya; dan takut dari azab hari kiamat, yaitu hari yang sangat mengerikan yang akan meliputi seluruh makhluk."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. يُوفُونَ بِالنَّذْرِ (Mereka menunaikan nazar) Yakni mereka mendapat balasan itu sebab mereka telah menunaikan nazar mereka. Yaitu sesuatu yang dia wajibkan kepada dirinya sendiri untuk dipersembahkan kepada Allah, baik itu berupa shalat, puasa, penyembelihan hewan, atau lainnya, selama hal itu bukan termasuk hal yang memang diwajibkan baginya oleh syariat. وَيَخَافُونَ يَوْمًا كَانَ شَرُّهُۥ مُسْتَطِيرًا (dan takut akan suatu hari yang azabnya merata di mana-mana) Yakni mereka takut terhadap hari kiamat, bencana pada hari itu memenuhi langit dan bumi; langit terbelah, bintang-bintang berjatuhan, bumi bergoncang, dan gunung-gunung beterbangan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Mereka memenuhi nadzar mereka untuk sibuk dalam ketaatan. Nadzar itu antara lain adalah meneguhkan hati dan perilaku untuk senantiasa mendekatkan diri kepada Allah melalui berbagai ibadah yang disyariatkan seperti shalat, puasa, berkurban, bersedekah dan sebagainya. Dengan rasa takut akan datangnya hari kiamat, hari dimana terdapat azab yang merata dan menyeluruh"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka memenuhi nazar} sesuatu yang mereka wajibkan untuk diri mereka berupa ketaatan {dan takut akan suatu hari yang azabnya merata di mana-mana} tersebar kemana-mana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7. Selanjutnya Allah menyebutkan sebagian besar amal perbuatan mereka seraya berfirman, “Mereka menunaikan nadzar,” yaitu apa pun yang mereka wajibkan atas diri mereka sendiri untuk Allah yang pada asalnya tidak wajib bagi mereka kecuali jika mereka mewajibkannya pada diri mereka sendiri. Perbuatan wajib asli bagi mereka lebih utama dan lebih patut. “Dan mereka takut akan suatu hari hari yang azabnya merata di mana-mana,” yakni menyebar kemana-mana. Mereka takut mendapatkan keburukannya sehingga mereka meninggalkan segala sesuatu yang menyebabkannya mendapatkan keburukan itu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Insan ayat 7: 7-10. Allah menjelaskan tentang sebab-sebab kenikmatan yang mereka telah sampai padanya, dan di antara sebabnya : Mereka dahulu di dunia mununaikan nazar yang mereka telah wajibkan atas diri-diri mereka masing-masing. Mereka juga adalah orang-orang yang takut akan kejadian hari kiamat, dimana hari itu adalah hari puncak yang dahsyat. Mereka juga memberikan makanan (kepada faqir dan miskin) karena kebutuhan mereka dan kecintaan mereka sehingga membekas pada diri mereka masing-masing akan kebetuhan mereka terhadap orang-orang miskin, anak-anak yatim dan para tawanan perang; Mereka tidak bermaksud sombong maupun ingin terkenal. Kemudian mereka berkata pada masing-masing diri-diri mereka : Sesungguhnya kami memuliakan kalian dan berbuat baik kepada kalian untuk mencari ganjaran di sisi Allah dan menginginkan tempat di akhirat, kami tidak memandang ingin seorangpun mengupah kami dan memuji atas pemuliaan dan kebaikan kami. Mereka juga berkata : Kami memberikan makanan ini kepada kalian karena kebutuhan kami kepada Allah; Karena kami takut akan Rabb kami yaitu pada hari yang manusia bermuka masam karena sebab kengerian dan dahsyatnya hari itu, serta besarnya urusannya, dan panjang ujiannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala menyebutkan amal mereka secara garis besar sehingga mereka layak memperoleh balasan yang nikmat itu. Jika nadzar yang pada awalnya sunat lalu mereka wajibkan sendiri mereka penuhi lalu bagaimana dengan kewajiban yang asli (yang memang awalnya wajib)? Tentu mereka lebih memenuhi lagi. Mereka takut kalau-kalau azab itu menimpa mereka. Oleh karena itulah, mereka tinggalkan semua perbuatan yang dapat mendatangkan azab itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Insan Ayat 7",
    "description": "Di antara amal kebaikan yang akan diberikan balasan seperti di atas antara lain adalah bahwa mereka memenuhi nazar sebagai bukti mereka adalah orang-orang cenderung kepada kebaikan, dan takut akan suatu hari yang azabnya merata di mana-mana yaitu siksa neraka. 8-9. Dan amalan lain yang mereka lakukan adalah mereka memberikan makanan sesuai dengan kemampuannya yang disukainya kepada orang miskin yang amat membutuhkan, anak yatim dan orang yang ditawan baik tertawan karena peperangan maupun karena terbelenggu oleh perbudakan, sambil berkata, 'sesungguhnya kami memberi makanan kepadamu hanyalah karena mengharapkan keridaan Allah, kami tidak mengharap balasan dan terima kasih dari kamu."
  }
]