[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "6-10. Minuman yang dicampur dengan kafur ini adalah mata air yang darinya para hamba Allah akan minum, mereka meng-alirkannya sebagaimana mereka kehendaki dengan mudah. Orang-orang itu dulu di dunia memenuhi apa yang mereka wajibkan atas diri mereka sendiri berupa ketaatan kepada Allah, mereka takut kepada azab Allah pada Hari Kiamat yang mudaratnya berat, keburukannya merata dan menyebar atas manusia, kecuali siapa yang dirahmati Allah. Mereka memberi makan, sekalipun mereka mencintai makanan itu karena mereka membutuhkannya, kepada orang miskin lemah yang tidak mampu berusaha yang tidak mempunyai apa yang mencukupinya, anak kecil yang bapaknya mati sementara dia belum baligh dan tidak berharta, serta tawanan yang ditawan dalam perang dari kalangan orang-orang kafir dan lainnya. Mereka berkata dalam diri mereka, “Kami berbuat baik kepada kalian demi mencari ridha dan pahala Allah, kami tidak mencari ganti, tidak menginginkan pujian dan sanjungan dari kalian. Sesungguhnya kami takut kepada (azab) Tuhan kami pada suatu hari yang padanya wajah-wajah menjadi muram durja, serta kening-kening berkerut karena bebannya yang berat dan ketakutannya yang mencekam.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Dan mereka menyembunyikan di dalam diri mereka sendiri bahwa mereka tidak memberi makan kecuali karena menginginkan wajah Allah, mereka tidak menginginkan balasan dari orang-orang yang diberi maupun pujian atas perbuatan mereka memberi makan kepada yang membutuhkan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "9-10. Orang-orang baik itu menjadikan tujuan dari pemberian makan kepada orang-orang yang membutuhkan ini adalah untuk meraih keridhaan Allah, sehingga mereka tidak lagi mengharapkan balasan atas kebaikan yang telah mereka lakukan dan tidak pula mengharap ucapan terima kasih, sebab itu merupakan amalan yang ikhlas karena Allah demi mendapat keridhaan-Nya dan karena takut dari azab-Nya pada hari kiamat yang merupakan hari yang berat dan mengerikan, ketika itu wajah-wajah akan menjadi muram karena takut dari siksaan dan karena pengaruh kengerian yang telah mereka lihat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. إِنَّمَا نُطْعِمُكُمْ لِوَجْهِ اللَّـهِ (Sesungguhnya kami memberi makanan kepadamu hanyalah untuk mengharapkan keridhaan Allah) Yakni mereka tidak tidak mengharap imbalan dan tidak pula menginginkan pujian orang lain. Namun Allah mengetahui isi hati mereka sehingga Dia memuji mereka atas apa yang mereka lakukan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9. Para pemberi makanan itu berkata dalam hati: Kami memberikan makanan pada kalian dengan mengharap ridho Allah semata dan menharap balasan pahala dari-Nya. Kami tidak meminta bayaran atau balasan dari kalian"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "“Sesungguhnya kami memberi makanan kepada kalian karena Allah. Kami tidak mengharap dari kalian balasan} pahala {dan terima kasih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8-10. “Dan mereka memberikan makanan yang disukainya,” yakni, pada saat mereka menyukai harta dan makanan, tapi mereka lebih mementingkan kecintaan terhadap Allah daripada kecintaan terhadap diri sendiri, (maka mereka menginfaknnya). Dalam memberi makan, mereka selektif untuk memberikannya pada orang yang paling memerlukan, “kepada orang miskin, anak yatim, dan orang yang ditawan,” maksud mereka memberi makanan dan infak adalah demi mencari ridha Allah semata. Dengan bahasa kondisi seakan mereka menyatakan, “Sesungguhnya kami memberi makanan kepadamu hanyalah untuk mengharapkan keridhaan Allah, kami tidak menghendaki balasan dari kamu dan tidak pula (ucapan) terima kasih,” yakni, tidak mengharapkan balasan materi atau sanjungan. “Sesungguhnya kami takut akan (azab) Rabb kami pada suatu hari yang ( di hari itu) orang-orang bermuka masam, penuh kesulitan,” yakni sangat menyulitkan, amat buruk, dan sempit."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Insan ayat 9: 7-10. Allah menjelaskan tentang sebab-sebab kenikmatan yang mereka telah sampai padanya, dan di antara sebabnya : Mereka dahulu di dunia mununaikan nazar yang mereka telah wajibkan atas diri-diri mereka masing-masing. Mereka juga adalah orang-orang yang takut akan kejadian hari kiamat, dimana hari itu adalah hari puncak yang dahsyat. Mereka juga memberikan makanan (kepada faqir dan miskin) karena kebutuhan mereka dan kecintaan mereka sehingga membekas pada diri mereka masing-masing akan kebetuhan mereka terhadap orang-orang miskin, anak-anak yatim dan para tawanan perang; Mereka tidak bermaksud sombong maupun ingin terkenal. Kemudian mereka berkata pada masing-masing diri-diri mereka : Sesungguhnya kami memuliakan kalian dan berbuat baik kepada kalian untuk mencari ganjaran di sisi Allah dan menginginkan tempat di akhirat, kami tidak memandang ingin seorangpun mengupah kami dan memuji atas pemuliaan dan kebaikan kami. Mereka juga berkata : Kami memberikan makanan ini kepada kalian karena kebutuhan kami kepada Allah; Karena kami takut akan Rabb kami yaitu pada hari yang manusia bermuka masam karena sebab kengerian dan dahsyatnya hari itu, serta besarnya urusannya, dan panjang ujiannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan lisanul hal (keadaan) atau lisanul maqaal (ucapan). Baik balasan harta maupun pujian lisan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Insan Ayat 9",
    "description": "8-9. Dan amalan lain yang mereka lakukan adalah mereka memberikan makanan sesuai dengan kemampuannya yang disukainya kepada orang miskin yang amat membutuhkan, anak yatim dan orang yang ditawan baik tertawan karena peperangan maupun karena terbelenggu oleh perbudakan, sambil berkata, 'sesungguhnya kami memberi makanan kepadamu hanyalah karena mengharapkan keridaan Allah, kami tidak mengharap balasan dan terima kasih dari kamu. 10. Orang-orang yang disebut al-abr'r yang selalu berbuat baik juga menegaskan bahwa pemberian tersebut semata karena mengharap rida Allah dan rasa takut akan azab. Seperti yang disebut pada ayat ini. Sungguh, kami takut akan azab tuhan pada hari ketika orang-orang berwajah masam penuh kesulitan. '."
  }
]