[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1. Wahai orang-orang yang membenarkan Allah dan rasulNya serta melaksanakan syariatNya, jangan mengangkat musuhKu dan musuh kalian sebagai orang-orang terdekat dan terkasih kalian, yang mana kalian memberikan kasih sayang kepada mereka, kalian mengabari mereka tentang berita-berita Rasulullah dan rahasia-rahasia kaum Muslimin, padahal mereka telah kafir kepada kebenaran yang telah datang kepada kalian, yaitu iman kepada Allah dan rasulNya dan al-Quran yang turun kepada Rasulullah, dan mereka juga mengusir Rasulullah dan mengusir kalian (wahai orang-orang beriman) dari Makkah, karena kalian membenarkan Allah, Tuhan kalian dan mentauhidkanNya. Bila kalian (wahai orang-orang Mukmin) berhijrah dalam rangka berjihad di jalanNya, mencari ridhaKu kepada kalian, maka jangan memberikan loyalitas kepada musuh-musuhKu dan musuh-musuh kalian, yang kepada mereka kalian memberikan kasih sayang secara rahasia sedangkan Aku lebih mengetahui apa yang kalian rahasiakan dan yang kalian perlihatkan. Barangsiapa melakukannya di antara kalian, maka dia telah keliru dari jalan yang haq dan kebenaran serta tersesat dari jalan yang lurus."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Wahai orang-orang yang beriman kepada Allah dan mengamalkan apa yang disyariatkan kepada mereka! Janganlah kalian menjadikan musuh-musuh-Ku dan musuh-musuh kalian sebagai teman setia yang kalian loyal kepada mereka dan mencintai mereka, sementara mereka telah kafir terhadap agama yang datang kepada kalian melalui tangan Rasul kalian. Mereka telah mengusir Rasul dari rumahnya dan mereka pun mengusir kalian dari rumah-rumah kalian di Makkah, tanpa memperdulikan kekerabatan maupun ikatan keluarga di antara kalian. Tidak lain karena kalian beriman kepada Allah, Rabb kalian. Janganlah kalian lakukan itu, jika kalian keluar untuk tujuan jihad di jalan-Ku dan untuk mencari keridaan-Ku. Kalian secara sembunyi-sembunyi menyebarkan berita tentang kaum muslimin kepada mereka karena cinta kepada mereka, sementara Aku mengetahui apa yang kalian sembunyikan dari hal itu dan apa yang kalian tampakkan, tidak ada sesuatu pun dari hal itu ataupun dari yang lain yang luput dari-Ku. Dan barangsiapa menjadikan orang-orang kafir sebagai teman setia dan saling berkasih sayang dengan mereka maka ia telah melenceng dari tengah jalan dan telah tersesat dari yang haq dan meleset dari kebenaran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1. Allah memperingatkan dan melarang orang-orang beriman agar tidak mencintai musuh-musuh mereka: Janganlah kalian menjadikan musuh-Ku dan musuh kalian yang mendustakan Allah dan Rasulullah sebagai para penolong dan kekasih, yang kalian cintai dan kalian jadikan sebagai teman. Mereka telah mendustakan agama dan al-Qur’an, dan mengusir Rasulullah dan kalian dari kota Makkah karena kalian beriman kepada Allah dan Rasulullah. Jika kalian pergi meninggalkan rumah untuk berjihad demi membela agama Allah dan mencari keridhaan-Ku, maka janganlah kalian menjadikan mereka penolong-penolong, dengan menyampaikan rahasia kalian agar dapat menjadi orang terdekat mereka. Karena Aku Maha Mengetahui segala yang kalian rahasiakan dan kalian tampakkan. Dan barangsiapa yang melakukan perkara yang mengandung keburukan yang besar ini maka dia telah berpaling dari jalan yang benar."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. يٰٓأَيُّهَا الَّذِينَ ءَامَنُوا۟ لَا تَتَّخِذُوا۟ عَدُوِّى وَعَدُوَّكُمْ أَوْلِيَآءَ (Hai orang-orang yang beriman, janganlah kamu mengambil musuh-Ku dan musuhmu menjadi teman-teman setia) Ayat ini diturunkan untuk Hatib bin Abi Balta’ah ketika ia menulis surat kepada orang-orang musyrik Quraisy untuk mengabarkan kepada mereka perjalanan Rasulullah menuju Makkah; ini terjadi ketika perang penakhlukan kota Makkah pada tahun ke delapan Hijriyah. Ayat ini menunjukkan larangan untuk menjadi teman setia dengan orang-orang kafir dengan alasan apapun. تُلْقُونَ إِلَيْهِم بِالْمَوَدَّةِ(yang kamu sampaikan kepada mereka (berita-berita Muhammad), karena rasa kasih sayang) Yakni kalian menyampaikan kabar-kabar tentang Rasulullah kepada orang-orang kafir karena kasih sayang yang ada di antara kalian dengan mereka. وَقَدْ كَفَرُوا۟ بِمَا جَآءَكُم مِّنَ الْحَقِّ(padahal sesungguhnya mereka telah ingkar kepada kebenaran yang datang kepadamu) Yakni mereka kafir terhadap Allah, Rasulullah, dan al-Qur’an dan hidayah dari Allah yang beliau bawa kepada kalian. يُخْرِجُونَ الرَّسُولَ وَإِيَّاكُمْ ۙ( mereka mengusir Rasul dan (mengusir) kamu) Yakni mereka telah mengeluarkan Rasulullah dan kalian dari kota Makkah akibat kekafiran mereka terhadap kebenaran yang beliau bawa kepada kalian, maka untuk apa kalian mengasihi mereka? أَن تُؤْمِنُوا۟ بِاللهِ رَبِّكُمْ(karena kamu beriman kepada Allah, Tuhanmu) Yakni mereka mengusir kalian karena kalian beriman kepada Allah, atau karena benci terhadap keimanan kalian. إِن كُنتُمْ خَرَجْتُمْ جِهٰدًا فِى سَبِيلِى وَابْتِغَآءَ مَرْضَاتِى ۚ( Jika kamu benar-benar keluar untuk berjihad di jalan-Ku dan mencari keridhaan-Ku) Yakni jika kalian memang demikian maka janganlah kalian menjadikan musuh-Ku dan musuh kalian sebagai teman-teman setia. تُسِرُّونَ إِلَيْهِم بِالْمَوَدَّةِ(Kamu memberitahukan secara rahasia (berita-berita Muhammad) kepada mereka, karena rasa kasih sayang) Yakni kalian menyampaikan kabar-kabar berita kepada mereka karena kasih sayang kalian terhadap mereka. وَأَنَا۠ أَعْلَمُ بِمَآ أَخْفَيْتُمْ وَمَآ أَعْلَنتُمْ ۚ( Aku lebih mengetahui apa yang kamu sembunyikan dan apa yang kamu nyatakan) Yakni Aku mengetahui setiap apa yang kalian lakukan berupa pengiriman kabar kepada mereka. وَمَن يَفْعَلْهُ مِنكُمْ فَقَدْ ضَلَّ سَوَآءَ السَّبِيلِ(Dan barangsiapa di antara kamu yang melakukannya, maka sesungguhnya dia telah tersesat dari jalan yang lurus) Yakni salah dalam menempuh jalan menuju kebenaran dan tersesat dari jalan yang benar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "1. Wahai orang-orang yang beriman, janganlah kalian jadikan musuh-Ku dan sebernarnya musuh kalian juga, yaitu golongan kafir atau musyrik dan tidak beriman kepada Allah dan kitab-Nya sebagai sahabat dan penolong. Kata al aduwwu menunjukkan makna tunggal dan jamak. Kalian justru menyampaikan kabar tentang Muhammad dan orang mukmin kepada mereka dengan rasa persahabatan kepada mereka. Kalian menyampaikan rahasia kaum mukmin atas dasar rasa saling mencintai antara kalian dan orang-orang kafir. Padahal mereka telah mengingkari kebenaran yang Aku turunklan kepada kalian. Yaitu agama Islam dan kitab suci Alquran. Mereka juga telah mengusir kalian dan rasul dari kota Makkah. Maka jika kalian memang benar-benar berniat untuk jihad di jalan-Ku dan hanya mencari keridhoan-Ku, maka jangan jadikan musuh-Ku sebagai sahabat dan penolong bagi kalian. Kalian telah menyampaikan rahasia orang mukmin kepada mereka atas dasar rasa cinta kepada orang kafir. Sesungguhnya Allah Maha Tahu atas semua yang kalian sembunyikan dalam hati ataupun yang kalian tampakkan. Ini adalah ungkapan untuk menakuti mereka, bahwa Allah Maha Tahu atas segala apapun. Barang siapa menjadikan orang kafir sebagai sahabat atau penolong, maka sungguh dia telah menyimpang dari jalan kebenaran yang lurus. Ayat ini turun untuk Hatib bin Abi Baltaah ketika dia menyampaikan rahasia / informasi tentang Nabi mengenai penyerangan/perang alfath tahun 8 Hijriah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman. Janganlah menjadikan musuhKu dan musuh kalian sebagai teman setia} sahabat dan teman setia {Kalian menyampaikan kepada mereka karena rasa kasih sayang} kalian menyampaikan rasa kasih sayang kalian kepada mereka tanpa merlakukan perenungan {Sungguh mereka telah mengingkari kebenaran yang datang kepada kalian. Mereka mengusir Rasul dan kalian karena kalian beriman} karena kalian beriman {kepada Allah, Tuhan kalian. Jika kalian keluar untuk berjihad pada jalanKu dan mencari} mencari {keridhaanKu. Kalian memberitahukan kepada mereka secara rahasia karena rasa kasih sayang} kalian menyampaikan kepada mereka secara rahasia berita tentang orang-orang muslim, untuk mencari rasa kasih sayang dari mereka {Aku lebih tahu tentang apa yang kalian sembunyikan dan apa yang kalian nyatakan. Siapa saja di antara kalian yang melakukannya sungguh telah tersesat dari jalan yang lurus} menyalahi jalan yang benar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1. Allah berfirman, “Hai orang-orang yang beriman,” maksudnya, lakukanlah tuntutan keimanan kalian dengan bersikap loyal terhadap orang yang menunaikan keimanan dan memusuhi orang yang memusuhinya, karena sesungguhnya ia adalah musuh Allah dan musuh orang-orang yang beriman, “janganlah kamu mengambil musuhKu dan musuhmu menjadi teman-teman setia yang kamu sampaikan kepada mereka (berita-berita Muhammad), karena rasa kasih sayang,” maksudnya bersegera dalam mencintai mereka dan melakukan sebab-sebabnya karena kecintaan itu jika tulus akan disertai oleh pertolongan dan sikap loyal, dengan demikian seorang hamba akan keluar dari keimanan dan termasuk dalam kalangan orang-orang kafir. Maksudnya, terpisah dari orang-orang yang beriman. Orang Mukmin yang menjadikan orang kafir sebagai penolong juga tidak memiliki harga diri, sebab bagaimana bisa menjadikan musuh sebagai pemimpinnya yang hanya menghendaki keburukan baginya serta menentang RabbNya dan para kekasihNya yang menghendaki kebaikan padanya dengan memerintahkan dan mendorong pada kebaikan. Di antara faktor yang menyebabkan orang Mukmin memusuhi orang-orang kafir adalah karena orang-orang kafir mengingkari kebenaran yang dibawa oleh orang-orang Mukmin. Tidak ada pembangkangan yang lebih berat dari pengingkaran seperti ini. Karena mereka telah kufur dengan dasar agama kalian, mereka mengira bahwa kalian berada dalam kesesatan, tidak berada di atas petunjuk, padahal sebenarnya merekalah yang kafir terhadap kebenaran yang tidak ada keraguannya. Siapa pun yang menolak kebenaran, maka mustahil baginya memiliki dalil atau hujjah atas kebenaran pandangannya. Bahkan hanya dengan mengetahui kebenaran saja sudah bisa menunjukkan batilnya pandangan orang yang menolaknya. Di antara puncak permusuhan mereka adalah “mereka mengusir rasul dan (mengusir kamu),” wahai orang-orang yang beriman dari kampung halaman kalian dan mengusir Kalian dari negeri kalian, padahal kalian tidak bersalah selain hanya karena kalian beriman “kepada Allah, Rabbmu” Yang harus disembah oleh seluruh makhluk, karena Dia adalah Rabb mereka serta yang memberikan berbagai nikmat, baik yang lahir maupun yang batin. Dia-lah Allah. Ketika mereka berpaling dari hal ini yang merupakan kewajiban pertama dan utama sedangkan kalian menunaikannya, mereka pun memusuhi kalian dan mengusir kalian dari kampung halaman kalian karena keimanan. Lantas agama apa, harga diri yang mana serta akal mana yang masih tersisa bagi seorang hamba yang beriman yang menjadikan orang-orang kafir sebagai penolong, yang seperti itulah sifat mereka di setiap waktu dan tempat. Tidak ada yang menghalangi mereka dari permusuhan itu selain rasa takut atau adanya penghalang yang kuat. “Jika kamu benar-benar keluar untuk berjihad pada jalanKu dan mencari keridhoanKu (janganlah kamu berbuat demikian).” Maksudnya, jika kalian pergi berniat untuk jihad di jalan Allah untuk menegakkan kalimat Allah serta mencari ridhaNya, maka ketahuilah tuntutan hal ini dengan bersikap loyal terhadap para kekasih Allah dan memusuhi para musuh Allah, karena inilah jihad di jalan Allah yang paling agung dan di antara salah satu amalan yang bisa mendekatkan diri kepada Allah dan mencari keridhaanNya. “Kamu memberitahukan secara rahasia (berita-berita Muhammad) kepada mereka, karena rasa kasih sayang. Aku lebih mengetahui apa yang kamu sembunyikan dan apa yang kamu nyatakan.” Maksudnya, mengapa kalian menyembunyikan rasa kasih sayang terhadap orang-orang kafir padahal kalian mengetahui bahwa Allah mengetahui apa yang kalian sembunyikan dan apa yang kalian nyatakan. Meskipun hal itu tidak diketahui oleh orang-orang yang beriman tapi tidak samar bagi Allah. Allah akan memberi balasan pada hamba-hambaNya berdasarkan amalan yang diperbuat, baik dan buruknya. “Dan barangsiapa di antara kamu yang melakukannya,” yaitu loyal terhadap orang-orang kafir setelah diperingatkan Allah, “maka sungguh dia telah tersesat dari jalan yang lurus,” karena ia menempuh jalan yang berseberangan dengan syariat, akal, dan harga diri kemanusiaan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mumtahanah ayat 1: Surat ini dibuka dengan seruan kepada orang-orang yang beriman agar tidak mengambil musuh-musuh Allah sebagai penolong dan teman, dan agar orang-orang yang beriman tidak menampakkan kepada musuh-musuh Allah kecintaan dan kasih sayang, dan agar jangan mempercayai mereka, dimana kalian menyampaikan kabar-kabar tentang Rasul serta orang-orang beriman, yang itu semua tidak semestinya dikabarkan kepada musuh-musuh Allah; Sebagaimana perbuatan Hathib bin Abi Balta’ah ketika diutus mengirimkan surat kepada Quraisy, dia mengabarkan kepada mereka atas apa yang akan dilakukan oleh Rasul ﷺ dalam memerangi mereka. Semua itu disebabkan bahwa orang-orang musyrik akan menolak kebenaran yang datang dari Muhammad ﷺ, dan karena sebab mereka (kafir quraisy) Rasulullah ﷺ dan kaum muslimin keluar dari Mekkah karena keimanan dan keikhlasan mereka menyembah Allah saja. Kemudian jika keluarnya kalian wahai orang-orang yang beriman, tujuannya untuk hijrah dan berjihad di jalan Allah serta meminta keridhaan-Nya; Maka bagaimana tidak menjadikan hati kalian memiliki kasih sayang dan kecintaan yang tersembunyi, dan Dialah Allah yang Maha Mengetahui apa yang ada pada kalian dan mereka (musuh-musuh Allah), atas apa yang kalian sembunyikan di hati-hati kalian dari kebaikan dan keburukan. Oleh karena itu Rasul ﷺ dikabarkan (Allah) atas perbuatan Hathib dan memerintahkan Nabi untuk mengikut sertakan wanita yang membawa surat di suatu tempat, dikatakan tempat itu bernama kebun khaj. Ketahuilah barangsiapa yang mengerjakan hal ini di antara kalian, maka kalian telah menyimpang dari jalan yang benar, dan tersesat dari jalan yang benar. Dan pada ayat ini jelas agar tidak mempercayai musuh-musuh Allah, meskipun kerabat atau memiliki sebab yang lain. Sebab turunnya ayat ini : Bahwa Hathib bin Abi Balta’ah Al Abbasi menulis surat kepada Quraisy, ia mengatakan di dalam suratnya : Sungguh Muhammad ﷺ telah datang kepada kalian dengan tentara yang seperti malam, atau : Bahwasanya Muhammad mengerjakan amalan, yang pada hari ini disebut dengan khianat yang besar bagi umat. Dan ini adalah kejahatan yang mengharuskan ia (Hathib) dibunuh dan diadzab, akan tetapi Rasulullah ﷺ masih menjaga sikap kepadanya karena ia telah ikut berbaiat di bawah pohon, dan ikut berperang bersama kaum muslimin di perang badr; Khususnya ia (Rasul) telah bersumpah di depan (pejuang badr) bahwa tidak akan hilang keislamannya dan memiliki tujuan menjadikan tangannya bersama Quraisy hingga pantang mendatangi keluarganya di Mekkah. Dari kejahatannya sampai-sampai Umar bin Khatab berkata kepada Rasul ﷺ: Perintahkan aku untuk menebas lehernya, akan tetapi Rasul melarangnya dan mengatakan agar tidak membunuhnya. Para ahli tafsir mengambil hukum dari kisah ini bahwa membuka kejelekan dan dosa orang-orang yang berkhianat merupakan dosa besar yang tidak perlu dipergunjingkan, bahkan hal itu adalah wajib."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Hakim di juz 2 hal. 485 berkata: telah mengabarkan kepadaku Abdurrahman bin Al Hasan Qaadhi (hakim) di Hamdzaan, telah menceritakan kepada kami Ibrahim bin Al Husain, telah menceritakan kepada kami Adam bin Abi Iyas, telah menceritakan kepada kami Warqa’ dari Ibnu Abi Najih dari Mujahid dari Ibnu Abbas radhiyallahu 'anhuma tentang firman Allah ‘Azza wa Jalla, “Wahai orang-orang yang beriman! Janganlah kamu menjadikan musuh-Ku…sampai firman-Nya, “Dan Allah Maha Melihat apa yang kamu kerjakan (ayat ke-3 surah ini).” Bahwa ayat tersebut turun berkenaan dengan pengiriman surat dari Hathib bin Abi Balta’ah dan orang yang bersamanya kepada orang-orang kafir Quraisy untuk memperingatkan mereka. Firman-Nya, “Kecuali perkataan Ibrahim kepada ayahnya…(ayat ke-4).” Bahwa mereka (kaum muslimin) dilarang mengikuti permohonan ampun Nabi Ibrahim untuk ayahnya sehingga mereka (kaum muslimin ikut-ikutan) memohonkan ampunan untuk kaum musyrikin. Firman-Nya, “Ya Tuhan Kami, janganlah Engkau jadikan kami (sasaran) fitnah bagi orang-orang kafir.” Maksudnya, janganlah Engkau mengazab kami melalui tangan mereka dan jangan pula langsung mendapat azab dari sisi-Mu, sehingga mereka (musuh) berkata, “Kalau sekiranya mereka berada di atas kebenaran, tentu azab tidak akan menimpa mereka.” (Hakim berkata, “Hadits ini shahih sesuai syarat Bukhari dan Muslim, namun keduanya tidak meriwayatkan.” Hadits ini didiamkan oleh Adz Dzahabi. Syaikh Muqbil menjelaskan, bahwa Adam bin Abi Iyas bukan termasuk para perawi Muslim, sehingga hadits tersebut menurut syarat Bukhari. Beliau (Syaikh Muqbil) berkata, “Saya berpaling dari hadits Ali yang ada di Bukhari dan Muslim, karena Al Haafizh dalam Al Fat-h juz 10 hal. 260 berkata, “Susunan (hadits tersebut) menjelaskan bahwa tambahan ini (dalam hadits Ali) adalah mudraj (diselipkan oleh seorang rawi), Muslim juga meriwayatkan dari Ishaq bin Rahawaih dari Sufyan, dan ia menerangkan bahwa pembacaan ayat adalah dari ucapan Sufyan.” Dari sini diketahui, bahwa kisah tersebut ada dalam Shahih Bukhari dan Muslim, akan tetapi turunnya ayat dan disebutkannya ayat itu adalah terputus karena Sufyan termasuk atbaa’uttaabi’in. Demikian pula ayat, “Laa yanhaakumullah…dst (ayat ke-8).” Disebutkan turunnya ayat dari jalan Sufyan, maka itu juga termasuk ucapannya sebagaimana dalam Bukhari juz 13 hal. 17, demikian pula dalam Al Adabul Mufrad hal. 23, dan ada riwayat lagi dari jalan lain di sisi Thayalisi, Abu Ya’la, Ibnu Jarir dan yang lain, namun di sana terdapat Mush’ab bin Tsabit, ia juga dha’if sebagaimana dalam Al Miizan, oleh karenanya tidak saya (Syaikh Muqbil) tulis.” Kemudian di catatan kaki kitab Ash Shahiihul Musnad Syaikh Muqbil berkata, “Kemudian tampak bagiku kedha’ifan hadits tersebut (hadits Hakim di atas) karena Abdurrahman bin Al Hasan (hanya) mengaku mendengar dari Ibrahim bin Al Husain, yaitu Ibnu Daiziil, demikian pula Ibnu Najih tidak mendengar tafsir dari Mujahid.”) Banyak para mufassir rahimahumullah menerangkan, bahwa beberapa ayat yang mulia ini turun berkenaan dengan kisah Hathib bin Abi Balta’ah, yaitu ketika Nabi shallallahu 'alaihi wa sallam hendak menaklukkan Mekah dan merahasiakan perkara itu, maka Hathib menulis surat tentang maksud Nabi shallallahu 'alaihi wa sallam tersebut kepada orang-orang kafir Mekah bukan karena ia sebagai munafik, tetapi karena ia memiliki anak dan keluarga yang masih musyrik di sana, maka Nabi shallallahu 'alaihi wa sallam mengambil surat itu dari wanita yang menerima surat dari Hathib karena pemberitahuan Allah kepada Beliau, kemudian Beliau mencela Hathib, maka Hathib menyebutkan alasannya, lalu diterima alasannya itu. Di dalam ayat ini terdapat larangan berwala’ (memberikan cinta-kasih) kepada orang-orang kafir, dan bahwa yang demikian bertentangan dengan keimanan, menyelisihi ajaran Nabi Ibrahim ‘alaihis salam dan bertentangan dengan akal sehat yang mengharuskan untuk bersikap hati-hati terhadap musuh. Yakni kerjakanlah konsekwensi imanmu berupa memberikan wala’ kepada orang-orang yang beriman dan memusuhi orang-orang yang menolak beriman, karena sesungguhnya ia musuh Allah dan musuh kaum mukmin. Yaitu orang-orang kafir Mekah. Hal itu, karena kasih sayang apabila terjadi, maka akan diiringi dengan sikap menolong dan membela. Bagaimana seseorang mengambil orang-orang kafir yang menjadi musuhnya sebagai teman setianya, padahal mereka tidak menginginkan untuknya selain keburukan dan ia tinggalkan Tuhannya yang menginginkan kebaikan untuk dirinya. Di samping itu, orang-orang kafir telah ingkar kepada kebenaran yang dibawa kaum mukmin, bahkan mereka juga telah mengusir rasul dan kaum mukmin dari kampung halaman mereka tanpa kesalahan apa pun selain karena mereka beriman kepada Allah Tuhan mereka yang semua makhluk wajib beribadah kepada-Nya karena Dia telah mengurus mereka dan melimpahkan kepada mereka nikmat-nikmat yang tampak maupun yang tersembunyi. Yaitu agama Islam dan Al Qur’an. Dari Mekah. Yakni jika keluarmu dengan maksud berjihad di jalan Allah untuk meninggikan kalimat Allah dan mencari keridhaan-Nya, maka kerjakanlah konsekwensinya yaitu berwala’ kepada wali-wali Allah dan memusuhi musuh-musuh-Nya; yang demikian merupakan jihad fii sabilillah dan ia termasuk ibadah yang mendekatkan diri kepada Allah dan memperoleh keridhaan-Nya. Yakni bagaimana kamu memberitahukan secara rahasia (berita-berita Nabi Muhammad shallallahu 'alaihi wa sallam) kepada orang-orang kafir, karena rasa kasih sayang kepada mereka padahal kamu mengetahui bahwa Allah Subhaanahu wa Ta'aala mengetahui apa yang kamu sembunyikan dan apa yang kamu tampakkan. Perkara itu, meskipun tersembunyi bagi kaum mukmin, namun tidaklah tersembunyi bagi Allah Subhaanahu wa Ta'aala dan Dia akan memberikan balasan kepada hamba-hamba-Nya sesuai yang Dia ketahui dari mereka, baik atau buruk. Yani memberikan wala’ kepada orang-orang kafir setelah Allah Subhaanahu wa Ta'aala memperingatkannya. Hal itu, karena dia telah menempuh jalan yang menyelisihi syara’, akal dan jalan manusia sejati."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mumtahanah Ayat 1",
    "description": "Wahai orang-orang yang beriman di mana pun dan kapan pun kamu hidup! janganlah kamu menjadikan musuh-ku, yaitu mereka yang menolak ajaran-ku, dan musuhmu yang membenci, menganiaya, berencana membunuh dan mengusir kamu dari tanah kelahiran kamu hanya karena kamu beriman kepada-ku sebagai teman setia sehingga kamu merasa perlu menyampaikan kepada mereka informasi tentang nabi Muhammad yang membahayakan islam dan kaum muslim, karena kasih sayang kamu kepada mereka, padahal mereka telah ingkar kepada kebenaran, menolak beriman kepada Al-Qur'an yang disampaikan kepada kamu melalui rasulullah. Mereka mengusir rasul dan kamu sendiri, ketika kamu bersama rasulullah berada di mekah sebelum hijrah ke madinah, tanpa ada alasan apa pun hanya karena kamu beriman kepada Allah, tuhan kamu, yang memelihara kamu dan seluruh jagat raya. Janganlah kamu berbuat demikan, bersahabat dengan orang-orang kafir dan membocorkan rahasia kepada mereka, jika kamu benar-benar keluar dari kota kelahiran kamu, mekah dan berhijrah ke madinah bersama rasul untuk berjihad pada jalan-ku guna mengharumkan islam dan kaum muslim. Kamu benar-benar pengkhianat, karena kamu memberitahukan secara rahasia informasi-informasi tentang nabi Muhammad kepada mereka, yang membahayakan islam dan kaum muslim serta keamanan negara madinah, karena kecintaan kamu kepada mereka, dan aku lebih mengetahui apa yang kamu sembunyikan dari rasul dan kaum muslim dan apa yang kamu nyatakan secara terbuka di hadapan publik. Dan barang siapa di antara kamu, wahai orang-orang beriman, melakukannya, membocorkan rahasia kepada orang-orang kafir, maka sungguh dia telah tersesat dari jalan yang lurus hingga bertobat dan kembali setia kepada ajaran islam. 2. Allah lalu menjelaskan mengapa ia melarang kaum muslim membocorkan rahasia kepada kaum kafir. Jika mereka, orang-orang kafir yang memusuhi kamu, menangkap kamu atau mengalahkan kamu dalam perang, niscaya mereka bertindak sebagai musuh bagi kamu dengan berbuat kezaliman di luar batas kemanusiaan, karena orang kafir yang membenci islam dan kaum muslim tidak bisa dijadikan sahabat setia; lalu melepaskan tangan mereka dengan tindakan dan lidahnya dengan kata-kata kasar dan tajam kepada kamu untuk menyakiti perasaan kamu, menghujat ajaran islam, serta melukai kehormatan kamu sebagi muslim; dan mereka sangat menginginkan agar kamu kembali kafir, mengikuti keyakinan mereka."
  }
]