[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "10. Wahai orang-orang yang membenarkan Allah dan RasulNya serta melaksanakan syariatNya, bila ada kaum wanita yang beriman datang kepada kalian, berhijrah dari negeri kafir ke negeri Islam, maka ujilah mereka, agar kalian tahu kebenaran iman mereka, dan Allah lebih mengetahui hakikat iman mereka. Bila kalian mengetahui mereka adalah kaum wanita yang beriman sesuai bukti-bukti yang Nampak bagi kalian, maka janganlah memulangkan mereka kepada suami-suami mereka yang kafir, karena wanita-wanita beriman tidak halal menikah dengan orang-orang kafir dan orang kafir tidak halal menikahi wanita yang beriman, berikanlah mahar kepada para suami kafir yang para istri mereka masuk Islam, tidak ada dosa atas kalian bila kalian menikahi mereka bila kalian memberikan mahar kepada mereka. Jangan pula kalian mempertahankan ikatan pernikahan kalian dengan para istri kalian yang kafir, mintalah kepada orang-orang musyrik mahar yang telah kalian berikan kepada istri kalian yang murtad dan begabung kepada orang-orang kafir, agar mereka juga meminta kepada kalian mahar yang telah mereka berikan kepada para istri mereka yang masuk Islam dan hijrah kepada kalian. Hukum dalam ayat ini merupakan hukum Allah yang Dia tetapkan di antara hamba-hambaNya, maka janganlah kalian menyelisihinya. Allah Maha Mengetahui segala sesuatu, tidak ada yang samar bagiNya, dan Dia Mahabijaksana dalam perkataan dan perbuatannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Wahai orang-orang yang beriman kepada Allah dan menjalankan syariat yang di tetapkan untuk mereka, jika datang kepada kalian wanita-wanita yang beriman berhijrah dari negeri kafir menuju negeri Islam maka ujilah kejujuran iman mereka. Allah lebih mengetahui keimanan mereka, tidak ada sesuatu pun yang luput dari-Nya terkait apa yang tersembunyi di hati mereka. Jika kalian mengetahui mereka benar-benar wanita-wanita yang beriman setelah kalian uji dengan apa yang nampak begi kalian terkait kejujuran mereka maka janganlah kalian kembalikan mereka kepada suami-suami mereka yang kafir. Tidak halal bagi wanita-wanita yang beriman untuk menikah dengan orang-orang kafir, dan tidak halal bagi orang-orang kafir untuk menikahi wanita-wanita yang beriman, lalu berikanlah kepada suami-suami mereka apa yang telah mereka keluarkan untuk mahar mereka. Dan kalian -wahai orang-orang yang beriman- tidak berdosa untuk menikahi mereka setelah selesai iddah mereka jika kalian memberikan mahar mereka. Istri siapa saja yang menjadi kafir atau murtad dari Islam maka janganlah ia menahannya, karena nikah keduanya sudah terputus dengan kekufurannya. Dan mintalah kepada orang-orang kafir apa yang telah kalian berikan untuk mahar istri-istri kalian yang murtad, dan hendaklah mereka meminta apa yang telah mereka keluarkan untuk mahar istri-istri mereka yang masuk Islam. Yang disebutkan itu -yaitu mengembalikan mahar dari pihak kalian dan dari pihak mereka- adalah hukum Allah. Allah menghukum di antara kalian dengan apa yang dikehendaki-Nya. Allah Mahatahu dengan kondisi hamba-hamba-Nya dan amal perbuatan mereka, tidak ada sesuatu pun dari hal itu yang luput dari-Nya, Allah Maha Bijaksana atas apa yang disyariatkan-Nya untuk hamba-hamba-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "10. Hai orang-orang beriman, jika datang kepada kalian wanita-wanita beriman yang berhijrah dari negeri kafir menuju negeri Islam maka ujilah mereka agar kalian memastikan kesungguhan mereka dalam memeluk Islam. Allah Maha Mengetahui hakikat keimanan mereka. Jika setelah menguji mereka, kalian mengetahui mereka beriman maka janganlah kalian mengembalikan mereka kepada suami-suami mereka yang masih kafir, sebab wanita-wanita beriman itu tidak halal bagi orang-orang kafir; dan para lelaki beriman tidak halal untuk menikah dengan wanita-wanita kafir. Dan berilah suami-suami mereka yang masih kafir itu mahar yang telah diberikan kepada para wanita yang berhijrah kepada kalian itu. Dan tidak mengapa kalian menikahi para wanita yang berhijrah itu jika kalian memberi mereka maharnya. Dan janganlah kalian berpegang pada akad nikah dengan wanita-wanita kafir yang ada di negeri kafir atau pergi ke negeri kafir. Dan mintalah dari orang-orang kafir mahar yang telah kalian berikan kepada istri kalian yang keluar dari Islam dan bergabung dengan orang-orang kafir, dan hendaklah mereka meminta dari kalian mahar yang telah mereka berikan kepada istri-istri mereka yang masuk Islam dan bergabung dengan kalian. Demikianlah hukum Allah yang ditetapkan bagi kalian, maka laksanakanlah dengan sebaik-baiknya. Allah Maha Mengetahui segala keadaan dan Maha Bijaksana dalam perkataan dan perbuatan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. يٰٓأَيُّهَا الَّذِينَ ءَامَنُوٓا۟ إِذَا جَآءَكُمُ الْمُؤْمِنٰتُ مُهٰجِرٰتٍ (Hai orang-orang yang beriman, apabila datang berhijrah kepadamu perempuan-perempuan yang beriman) Yang datang dari orang-orang kafir. Setelah Rasulullah membuat perjanjian damai dengan kaum Quraisy pada perang Hudaibiyah, yang salah satu isi perjanjian itu adalah mengembalikan orang Islam yang datang kepada kaum muslimin di Madinah. Dan ketika para wanita berhijrah menuju Rasulullah, Allah melarang untuk mengembalikan mereka kepada orang-orang musyrik dan memerintahkan untuk menguji keimanan mereka. فَامْتَحِنُوهُنَّ ۖ( maka hendaklah kamu uji (keimanan) mereka) Yakni ujilah mereka, agar kalian mengetahui tingkat keinginan mereka terhadap Islam. Pendapat lain mengatakan, yakni wanita-wanita itu diminta untuk bersumpah kepada Allah bahwa mereka tidak berhijrah karena kebencian kepada suami mereka, atau sekedar ingin berpindah ke negeri lain, atau untuk mencari kehidupan dunia, namun karena kecintaan mereka kepada Allah dan Rasulullah serta kepada agama-Nya. jika ia bersumpah dengan hal itu maka Rasulullah akan memberi suaminya mahar dan nafkah yang telah ia berikan kepada istrinya itu, dan tidak mengembalikan wanita itu kepada suaminya. اللهُ أَعْلَمُ بِإِيمٰنِهِنَّ ۖ( Allah lebih mengetahui tentang keimanan mereka) Kalimat ini menjelaskan bahwa hakikat keimanan mereka tidak ada yang mengetahui kecuali Allah, dan Allah tidak menuntut kalian untuk mengetahuinya. Namun Allah hanya menuntut kalian untuk menguji mereka hingga nampak bagi kalian apa yang menunjukkan kebenaran pengakuan mereka tentang kecintaan mereka kepada Islam. فَإِنْ عَلِمْتُمُوهُنَّ مُؤْمِنٰتٍ(maka jika kamu telah mengetahui bahwa mereka (benar-benar) beriman) Sesuai dengan apa yang nampak setelah kalian menguji mereka sebagaiman yang diperintahkan. فَلَا تَرْجِعُوهُنَّ إِلَى الْكُفَّارِ ۖ( maka janganlah kamu kembalikan mereka kepada (suami-suami mereka) orang-orang kafir) Yakni kepada suami mereka yang masih kafir. لَا هُنَّ حِلٌّ لَّهُمْ وَلَا هُمْ يَحِلُّونَ لَهُنَّ ۖ( Mereka tiada halal bagi orang-orang kafir itu dan orang-orang kafir itu tiada halal pula bagi mereka) Sebab wanita beriman tidak halal bagi lelaki kafir, dan keislaman wanita itu mengharuskannya berpisah dari suaminya, bukan hanya karena ia berhijrah. وَءَاتُوهُم مَّآ أَنفَقُوا۟ ۚ( Dan berikanlah kepada (suami suami) mereka, mahar yang telah mereka bayar) Yakni dan berikanlah suami dari wanita yang berhijrah dan masuk Islam harta yang setara dengan mahar yang ia berikan kepada istrinya itu. Imam Syafi’i berkata: jika kerabat wanita selain suaminya itu meminta wanita itu untuk dikembalikan maka ia tidak boleh mengambilnya tanpa tebusan. وَلَا جُنَاحَ عَلَيْكُمْ أَن تَنكِحُوهُنَّ(Dan tiada dosa atasmu mengawini mereka) Yakni setelah selesai masa ‘iddah, sebab mereka telah menjadi bagian dari pemeluk agama kalian. إِذَآ ءَاتَيْتُمُوهُنَّ أُجُورَهُنَّ ۚ( apabila kamu bayar kepada mereka maharnya) Yakni jika telah selesai masa iddahnya. وَلَا تُمْسِكُوا۟ بِعِصَمِ الْكَوَافِرِ(Dan janganlah kamu tetap berpegang pada tali (perkawinan) dengan perempuan-perempuan kafir) Yakni barangsiapa yang memiliki istri yang kafir maka ia bukanlah istrinya sebab hubungan perkawinannya telah terputus karena perbedaan agama. Orang-orang kafir ketika itu menikahi wanita-wanita beriman, begitu pula orang-orang beriman menikahi wanita-wanita kafir musyrik. Kemudian hal ini dilarang dengan turunnya ayat ini. Wanita-wanita kafir ini khusus wanita-wanita kafir karena kemusyrikan, bukan wanita-wanita kafir Ahli Kitab. وَسْـَٔلُوا۟ مَآ أَنفَقْتُمْ(dan hendaklah kamu minta mahar yang telah kamu bayar) Yakni mintalah mahar istri kalian jika mereka kembali kepada orang-orang kafir. وَلْيَسْـَٔلُوا۟ مَآ أَنفَقُوا۟ ۚ( dan hendaklah mereka meminta mahar yang telah mereka bayar) Para ahli tafsir mengatakan: dahulu jika ada wanita Muslimah yang kembali kepada orang-orang kafir yang memiliki perjanjian dengan kaum muslimin, maka akan dikatakan kepada orang-orang kafir: “kembalikanlah mahar wanita ini.” Dan jika ada wanita kafir yang masuk Islam dan pergi kepada orang-orang beriman maka orang-orang kafir akan berkata kepada orang-orang beriman: “kembalikanlah maharnya kepada suaminya yang masih kafir.” ذٰلِكُمْ(Demikianlah) Yakni pengembalian mahar dari kedua belah pihak itu. حُكْمُ اللهِ ۖ( hukum Allah) Yakni hukum Allah terhadap orang-orang musyrik setelah perjanjian Hudaibiyah; berbeda dengan orang-orang musyrik yang tidak memiliki perjanjian. Terdapat pendapat mengatakan bahwa hukum ini telah dihapus. Imam al-Qurthubi mengatakan: “hukum ini khusus pada waktu itu dengan peristuwa khusus ketika itu –yakni hukum yang berkenaan dengan pengembalian mahar; bukan yang berkenaan dengan pemisahan pasangan suami istri karena salah satunya masuk Islam—."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10. Wahai orang orang yang beriman para perempuan yang beriman hijrah dari Makkah ke Madinah setelah gencatan senjata Hudaibiyah. Dimana di dalamnya mengandung perjanjian bagi para suami untuk menceraikan istri mereka. Maka ujilah iman mereka untuk menilai a[akah iman mereka benar sungguh-sungguh dalam menjalankan Islam. Allah lebih tahu akan keimanan para perempuan yang berhijrah itu. Maka jika kalian sudah tahu akan kesungguhan iman mereka, jangan lantas kalian menyuruh mereka kembali kepada suami mereka yang musyrik. Perempuan mukmin tidak halal bagi orang kafir dan sebaliknya. Mereka berbeda dalam agama. Maka berilah suami mereka mahar yang pernah diberikan. Tidak ada dosa, jika kalian menikahi mereka setelah mereka beriman dan kalian telah membayar mahar mereka. Janganlah kalian menikahi perempuan musyrik karena kalian berbeda keyakinan. Mintalah kembali mahar yang kalian berikan kepada istri kalian yang keluar dari Islam dan menjadi kafir. Hendaknya para suami yang kafir meminta mahar para mantan istri mereka yang hijrah itu kepada kalian. itulah hokum Allah yang menjadi ketetapan setelah diputuskannya Hudaibiyah. Terkecuali untuk orang-orang yang tidak termasuk dalam perjanjian itu. Allah Maha Adil dalam memberi hukum kepada kalian. Allah Maha Luas dalam pengetahuan-Nya tentang urusan hamba-Nya. Allah tidak mensyariatkan sesuatu kecuali di balik itu ada kemanfaatan bagi mereka baik perkataan maupun perbuatan. Diriwayatkan dari Bukhari dan Muslim dari Muswir dan Marwan bin Hakam bahwa rasul SAW ketika perjanjian Hudaibiyah dengan orang kafir, datanglah para istri orang kafir kepada mereka. Maka turunlah ayat ini."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, apabila perempuan-perempuan mukmin datang berhijrah kepadamu, hendaklah kalian menguji mereka} maka ujilah kebenaran iman mereka {Allah lebih mengetahui tentang keimanan mereka. Jika kalian telah mengetahui bahwa mereka itu perempuan-perempuan mukmin, maka janganlah mengembalikan mereka kepada orang-orang kafir. Mereka tidak halal bagi orang-orang kafir itu dan orang-orang kafir itu tidak halal pula bagi mereka. Berikanlah kepada mereka mahar yang telah (suami) mereka berikan} berilah mahar seperti yang telah suami mereka bayarkan {Tidak ada dosa} dosa {bagi kalian menikahi mereka apabila kalian membayar mahar kepada mereka} mahar mereka {dan janganlah tetap berpegang pada tali dengan perempuan-perempuan kafir} tali-tali pernikahan dengan istri-istri kalian yang kafir {Hendaklah kalian meminta kembali apa yang telah kalian berikan} mintalah dari orang-orng musyrik mahar istri kalian yang murtad yang telah berhubungan dengan mereka {Hendaklah mereka meminta kembali mahar yang telah mereka bayar. Demikianlah hukum Allah yang ditetapkan di antara kalian. Allah Maha Mengetahui lagi Maha bijaksana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "10. Pada saat terjadi perjanjian Hudaibiyah, Nabi mengadakan perjanjian dengan kaum musyrik; (yang di antara isi kesepakatannya adalah) bahwa siapa pun yang datang bergabung dengan kaum Muslimin dalam keadaan masuk Islam harus dikembalikan dalam barisan orang-orang musyrik. Kata-kata ini bersifat umum dan mutlak yang mencakup kalangan perempuan dan lelaki. Berkaitan dengan kalangan lelaki, Allah tiddak melarang RasulNya untuk mengembalikannya ke barisan orang-orang kafir sebagai pemenuhan atas syarat perjanjian serta penyempurna perjanjian yang termasuk perjanjian terbesar itu. Sedangkan berkaitan dengan golongan wanita, karena jika dikembalikan lagi ke barisan orang-orang kafir dapat membawa petaka besar, Allah memerintahkan orang-orang Mukmin jika “datang berhijrah kepadamu perempuan-perempuan yang beriman,” sedangkan mereka meragukan kebenaran iman wanita-wanita yang berhijrah ini, boleh diuji supaya diketahui kebenaran iman dan sikap mereka, sebab bisa jadi keimanan mereka tidak benar namun hanya sekedar menginginkan suami, tempat tinggal, atau tujuan-tujuan duniawi lain. Jika wanita-wanita yang datang berhijrah bersifat dan bertujuan seperti ini, harus dikembalikan lagi ke barisan orang-orang kafir untuk menepati syarat perjanjian tanpa harus menimbulkan dampak yang berbahaya. Tapi ketika diuji dan diketahui kebenaran iman mereka atau dapat diketahui kebenaran iman sebagian dari mereka tanpa ujian terlebih dahulu, maka tidak boleh dikembalikan dalam barisan orang-orang kafir, “mereka tiada halal bagi orang-orang kafir itu dan orang-orang kafir itu tiada halal bagi mereka.” Karena mengembalikan wanita-wanita beriman ke dalam barisan orang-orang kafir berdampak bahaya berdasarkan pandangan syariat, di samping untuk memenuhi persyaratan perjanjian dengan cara menggantikan belanja dan mahar atau yang lain untuk kemudian diserahkan pada orang-orang kafir sebagai ganti dari wanita-wanita beriman yang berhijrah. Pada saat itu, tidak berdosa bagi orang-orang Mukmin untuk menikahi mereka meski mereka memiliki suami di negeri kafir, dengan catatan, wanita yang dinikahi harus diberi nafkah serta mahar. Karena wanita Muslimah tidak halal bagi orang kafir, maka wanita kafir juga tidak halal bagi orang Muslim untuk dinikahi selama wanita tersebut berada dalam kekafiran, bukan ahli kitab. Karena itu allah berfirman, “Dan janganlah kamu tetap berpegang pada tali ( perkawinan) dengan perempuan-perempuan kafir,” karena Allah melarang untuk berpegang pada tali perkawinan dengan wanita-wanita kafir, maka memulai untuk menikahinya lebih terlarang. “Dan hendaklah kamu minta mahar yang telah kamu bayar,” hai orang-orang yang beriman, ketika istri-istri kalian murtad dan kembali lagi kepada kekafiran. Karena orang-orang kafir berhak mendapatkan kompensasi dari orang-orang Muslim karena ada wanita yang masuk Islam, kaum Muslimin juga berhak mendapatkan kompensasi dari orang-orang kafir jika ada wanita dari kalangan Muslimah yang murtad. Dalam ayat ini terdapat dalil yang menunjukkan bahwa pasangan suami-istri yang berlepas diri dari ikatan pernikahan harus dibayar. Maka jika ada hal-hal yang membatalkan pernikahan seperti karena penyusuan dan lainnya, maka pihak suami harus menanggung maharnya. Allah berfirman, “DEmikianlah hukum Allah,” maksudnya, hukum yang disebutkan oleh allah pada kalian itu adalah hukum Allah, allah menjelaskannya untuk kalian. “Dan Allah Maha Mengetahui lagi Maha bijaksana.” Allah mengetahui hukum yang bermanfaat bagi kalian kemudian disyariatkanNya sesuai hikmah dan kasih sayangNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mumtahanah ayat 10: 9-10. Wahai orang-orang yang beriman kepada Allah dan Rasul-Nya, jika datang kepada kalian wanita-wanita yang beriman, yaitu wanita-wanita muhajirin dari negeri kafir menuju negeri islam, maka wajib bagi kalian untuk menguji mereka, agar kalian mengetahui kejujuran iman mereka, dan telah diketahui bahwa tidaklah manusia mengetahui hakikat keimanan kecualai hanya Allah yang mengetahuinya; Maka jika dugaan kalian besar bahwasanya mereka adalah wanita-wanita yang beriman, janganlah kalian mengembalikan mereka ke negeri kafir. Kemudian Allah menjelaskan akan sebab larangan mengembalikan mereka, Allah mengabarkan bahwasanya tidak halal menikahkan wanita-wanita yang beriman dengan orang-orang kafir, dan tidak halal pula atas orang kafir menikahi wanita-wanita yang beriman, dan wajib bagi kalian memberikan mereka laki-laki yang telah masuk islam kepada wanita-wanita yang beriman, yang laki-laki itu menginfakkan kepada wanita-wanita itu mahar. Allah mengabarkan bahwa tidak ada larangan dan dosa bagi kalian untuk menikahi wanita-wanita beriman dari muhajirin jika engkau dapat membayar mahar kepada mereka. Allah memerintahkan hamba-Nya agar melepaskan akad-akad kepada istrinya yang masih kafir; Karena tidak ada kewajiban bagi kalian dan bagi wanita-wanita kafir perlindungan dan hubungan. Allah meminta kepada mereka untuk meminta mahar bagi istri-istri mereka apabila mereka ingin dikembalikan mahar tersebut kepada mereka. Mintalah kepada orang-orang kafir mahar bagi istri-istri kalian dari wanita-wanita muhajirin yang beriman, yang datang kepada kalian. Maksudnya adalah wajib bagi kalian menunaikan mahar itu. Dan ketahuilah wahai manusia, bahwa hukum ini adalah hukum Allah yang Allah berikan hukum ini kepada kalian, maka ikutilah jangan menyelisihi-Nya. Allahlah yang Maha Mengetahui kebaikan hamba, Yang Bijaksana dalam pensyariatan bagi para hambanya, Allah mensyariatkan atas apa yang mengandung hikmah yang jelas."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Imam Bukhari meriwayatkan dengan sanadnya yang sampai kepada Urwah bin Zubair, bahwa ia mendengar Marwan dan Al Miswar bin Makhramah radhiyallahu 'anhuma memberitahukan tentang para sahabat Rasulullah shallallahu 'alaihi wa sallam, katanya, “Ketika Suhail bin ‘Amr membuat perjanjian, maka di antara perjanjian Suhail bin ‘Amr kepada Nabi shallallahu 'alaihi wa sallam adalah, bahwa tidak ada seorang yang datang kepadamu dari kalangan kami meskipun ia masuk ke agama kamu kecuali engkau kembalikan kepada kami dan engkau biarkan kami terhadapnya. Maka kaum muslimin tidak suka hal itu dan tidak siap terhadapnya, tetapi Suhail tetap menginginkan seperti itu, lalu Nabi shallallahu 'alaihi wa sallam menurutinya. Ketika itu Nabi shallallahu 'alaihi wa sallam mengembalikan Abu Jandal kepada bapaknya Suhail bin ‘Amr dan tidak ada seorang pun yang datang (kepada Beliau) kecuali dikembalikan dalam masa perjanjian itu meskipun sudah masuk Islam. Ada wanita-wanita mukmin yang berhijrah, dimana salah satunya adalah Ummu Kultsum bintu ‘Uqbah bin Abi Mu’aith, ia berhijrah kepada Rasulullah shallallahu 'alaihi wa sallam dengan keadaannya masih gadis, lalu keluarganya meminta kepada Nabi shallallahu 'alaihi wa sallam agar Beliau mengembalikannya kepada mereka, namun Beliau tidak mengembalikannya kepada mereka karena Allah Subhaanahu wa Ta'aala telah menurunkan ayat berkenaan dengan kaum wanita, “Apabila perempuan-perempuan mukmin datang berhijrah kepadamu, maka hendaklah kamu uji (keimanan) mereka. Allah lebih mengetahui tentang keimanan mereka; sampai firman-Nya, “Mereka tidak halal bagi orang-orang kafir itu dan orang-orang kafir itu tidak halal bagi mereka.” Urwah berkata: Aisyah memberitahukan kepadaku bahwa Rasulullah shallallahu 'alaihi wa sallam menguji mereka dengan ayat ini, “Wahai orang-orang yang beriman! Apabila perempuan-perempuan mukmin datang berhijrah kepadamu, maka hendaklah kamu uji (keimanan) mereka. Sampai firman-Nya, “Allah Maha Pengampun lagi Maha Penyayang (ayat 12).” Urwah berkata: Aisyah berkata, “Maka barang siapa mengakui syarat (perjanjian) ini di antara mereka, Rasulullah shallallahu 'alaihi wa sallam bersabda kepadanya, “Aku bai’at kamu.” Terhadap ucapan yang Beliau ucapkan tersebut. Demi Allah, tangan Beliau tidak menyentuh tangan seorang wanita dalam berbai’at dan Beliau tidaklah membai’at mereka kecuali dengan kata-kata Beliau.” Oleh karena pada perdamaian Hudaibiyah, Nabi shallallahu 'alaihi wa sallam mengadakan perjanjian damai dengan kaum musyrikin, dimana di antara isi perjanjian itu adalah bahwa barang siapa yang datang dari mereka dalam keadaan muslim kepada kaum muslimin, maka harus dikembalikan kepada kaum musyrikin, dimana lafaz ini adalah lafaz mutlak yang berlaku baik bagi laki-laki maupun wanita. Untuk laki-laki, maka Allah Subhaanahu wa Ta'aala tidak melarang Rasul-Nya shallallahu 'alaihi wa sallam untuk mengembalikannya kepada kaum musyrikin sebagai pemenuhan terhadap syarat (perjanjian) tersebut yang terdapat maslahat terbesar. Adapun untuk wanita, karena mengembalikan mereka terdapat mafsadat yang besar, maka Allah Subhaanahu wa Ta'aala memerintahkan kaum mukmin bahwa apabila kaum wanita yang mukmin datang, sedangkan mereka masih meragukan keimanannya, maka hendaknya mereka menguji dan mengetes mereka dengan sesuatu yang dapat menunjukkan kejujuran mereka, yaitu dengan sumpah yang diperberat resikonya (mughallazhah) dan lainnya karena jika tidak demikian bisa saja iman mereka tidak benar, yakni ia berhijrah bisa karena tidak suka kepada suaminya atau negerinya dan maksud-maksud duniawi lainnya. Jika demikian (tujuannya adalah duniawi), maka mereka harus dikembalikan kepada suami mereka untuk memenuhi syarat (perjanjian) tanpa ada mafsadat yang timbul, namun jika setelah diuji ternyata mereka adalah wanita-wanita yang benar beriman atau dapat diketahui tanpa perlu diuji, maka jangan mengembalikan mereka kepada kaum kafir. Menurut Ibnu Abbas, ujian terhadap mereka adalah mereka bersaksi bahwa tidak ada Tuhan yang berhak disembah kecuali Allah dan bahwa Muhammad adalah hamba Allah dan Rasul-Nya. Menurut Mujahid, tanya mereka karena apa mereka datang? Jika datang karena marah kepada kepada suami mereka, benci atau lainnya dan mereka tidak beriman, maka kembalikanlah mereka kepada suami mereka. Menurut Qatadah, ujian mereka adalah mereka diminta bersumpah dengan nama Allah, bahwa mereka keluar bukan karena durhaka kepada suami, mereka tidak keluar kecuali karena cinta kepada Islam dan para pemeluknya dan sangat cinta kepadanya (Islam), jika mereka mau mengucapkannya, maka diterimalah hal itu dari mereka. Ibnu Jarir meriwayatkan dari Abu Nashr Al Asadiy ia berkata: Ibnu Abbas pernah ditanya tentang bagaimana ujian Rasulullah shallallahu 'alaihi wa sallam kepada kaum wanita? Dia menjawab, “Beliau menguji mereka dengan (mengucapkan), “Demi Allah, aku tidak keluar karena benci kepada suami. Demi Allah, aku tidak keluar karena tidak suka kepada daerah yang satu sehingga ke daerah lain. Demi Allah, aku tidak keluar karena mencari dunia. Demi Allah, aku tidak keluar kecuali karena cinta kepada Allah dan Rasul-Nya.” (HR. Ibnu Jarir, dan Al Bazzar juga meriwayatkan dari jalannya serta menyebutkan, bahwa yang menyumpah mereka terhadap perintah Rasulullah shallallahu 'alaihi wa sallam adalah Umar bin Khaththab radhiyallahu 'anhu). Yakni menurutmu. Mengembalikan mereka kepada orang-orang kafir terdapat mafsadat yang besar yang dilirik oleh syari’ (penetap syariat, yaitu Allah Subhaanahu wa Ta'aala). Meskipun begitu, syari’ juga memperhatikan kewajiban ‘memenuhi syarat (perjanjian)’ oleh karena itu memerintahkan agar suami-suami mereka yang masih kafir diberikan mahar dan sesuatu yang mengiringinya yang telah mereka (suami-suami yang masih kafir) berikan. Ketika itu, tidak ada dosa bagi kaum muslimin menikahi mereka meskipun mereka punya suami di negeri syirk, tetapi dengan syarat mereka diberi mahar. Oleh karena wanita muslimah tidak halal bagi orang kafir, demikian pula wanita kafir tidak halal bagi seorang muslim menahannya selama wanita itu tetap di atas kekafirannya selain Ahli Kitab. Oleh karena itu, Allah Subhaanahu wa Ta'aala berfirman, “Dan janganlah kamu tetap berpegang pada tali (pernikahan) dengan perempuan-perempuan kafir.” Apabila menahan saja dilarang, maka memulai menikahinya lebih dilarang lagi. Wahai kaum mukmin, ketika istri-istrimu murtad mendatangi orang-orang kafir. Jika orang-orang kafir saja mengambil dari kaum muslimin nafkah dari wanita mereka yang masuk Islam, maka kaum muslimin juga berhak mengambil ganti terhadap wanita-wanita mereka yang murtad mendatangi orang-orang kafir. Dia mengetahui hukum-hukum yang bermaslahat bagimu dan mensyariatkan untukmu hal yang sejalan dengan hikmah (kebijaksanaan)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mumtahanah Ayat 10",
    "description": "Melalui ayat ini Allah menjelaskan tentang tata cara yang harus dilakukan rasulullah apabila menerima perempuan yang berasal dari daerah kafir dan hukum perkawinan mereka. 'wahai orang-orang yang beriman! apabila perempuan-perempuan mukmin yang berasal daerah yang dikuasai orang-orang kafir datang berhijrah kepadamu ke madinah, maka hendaklah kamu uji keimanan mereka agar kamu mengetahui latar belakang dan motivasi kedatangan mereka, serta dapat memberikan perlindungan yang tepat kepada mereka. Allah lebih mengetahui tentang keimanan mereka, hakikat, kualitas, bahkan yang terbesit dalam hati mereka; namun, pengujian ini diperlukan untuk kewaspadaan. Jika kamu telah mengetahui, setelah kamu melakukan wawancara mendalam terhadap mereka bahwa mereka, perempuan-perempuan yang meminta perlindungan itu benar-benar beriman, maka janganlah kamu mengembalikan mereka kepada orang-orang kafir, yakni suami-suami mereka yang kafir, karena perkawinan mereka batal, ketika perempuan-perempuan itu masuk islam. Mereka, perempuan-perempuan muslimah itu tidak halal bagi orang-orang kafir itu, yakni bagi para suami mereka untuk berhubungan suami-istri dan orang-orang kafir itu pun, yakni para suami yang kafir, tidak halal bagi mereka, para istri yang sudah menjadi muslimah untuk berhubungan suami-istri. Dan berikanlah kepada suami mereka, yang masih tetap kafir itu mahar yang telah mereka berikan kepada mantan istrinya yang menjadi muslimah, jika mereka meminta. Dan tidak ada dosa bagi kamu, para laki-laki muslim untuk menikahi mereka, karena perempuan-perempuan itu berstatus janda, apabila kamu menikahinya setelah selesai masa iddah, mengikuti hukum Allah dan dengan tujuan pernikahan yang benar, serta membayarkan kepada mereka maharnya sesuai kesepakatan. ' sebaliknya jika perempuan-perempuan muslimah meninggalkan suami mereka, masuk ke daerah kafir dan menjadi kafir, maka Allah menegaskan, 'dan janganlah kamu, para laki-laki muslim tetap berpegang pada tali pernikahan dengan perempuan-perempuan kafir, karena pernikahan kamu dengan mereka batal setelah mereka murtad; dan hendaklah kamu, para laki-laki muslim meminta kembali mahar yang telah kamu berikan kepada mantan istri kamu yang murtad itu. ' sementara itu tentang perempuan beriman yang menghadap kepada nabi di madinah, Allah menegaskan, 'dan jika suaminya tetap kafir, sedangkan perempuan-perempuan itu benar-benar beriman, biarkanlah mereka, para suami itu, meminta kembali mahar yang telah mereka bayarkan kepada mantan istrinya yang telah beriman. Demikianlah hukum Allah yang ditetapkan-Nya di antara kamu tentang perceraian karena suami atau istri murtad atau istri masuk islam, serta larangan menikah beda agama. Dan Allah maha mengetahui semua yang tersimpan dalam hati, mahabijasana dalam menyikapi tingkah laku manusia. '11. Allah lalu menjelaskan cara-cara pengembalian mahar kepada para suami yang ditinggalkan istri mereka tersebut. Dan jika ada sesuatu tentang pengembalian mahar yang belum selesai dari istri-istri kamu yang lari kepada orang-orang kafir, karena para mantan istri kamu itu tidak memiliki niat baik untuk mengembalikan mahar kepada kamu, kemudian kamu berhasil mengalahkan mereka dalam perang, yakni mengalahkan orang-orang kafir yang kepada mereka mantan istri-istri kamu lari, maka berikanlah dengan mengambil dari harta rampasan perang kepada orang-orang yang istri-istri mereka lari kepada orang-orang kafir sebanyak mahar yang telah mereka berikan kepada mantan istri-istri mereka. Dan bertakwalah kamu, wahai para suami yang ditinggalkan istri, kepada Allah yang kepada-Nya kamu beriman agar kamu tetap tegar."
  }
]