[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "11. Bila sebagian istri-istri kalian murtad dan bergabung dengan orang-orang kafir, lalu orang-orang kafir tidak memberi kalian mahar yang kalian berikan kepada para istri tersebut, kemudian kalian mengalahkan orang-orang kafir itu atau selain mereka dan menang atas mereka, maka berikanlah kaum Muslimin yang istrinya pergi dari harta rampasan perang atau lainnya semisal dengan apa yang mereka berikan berupa mahar sebelumnya. Dan takutlah kalian kepada Allah yang kepadaNya kalian beriman."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Jika ditakdirkan sebagian dari istri-istri kalian lari kepada orang-orang kafir dalam keadaan murtad dan kalian meminta mahar mereka kepada orang-orang kafir, tapi mereka tidak mau memberikannya, lalu kalian berhasil mendapatkan harta rampasan perang dari orang-orang kafir, maka berikanlah suami-suami yang istri-istri mereka lari dalam keadaan murtad tersebut harta senilai dengan mahar yang telah mereka berikan. Dan bertakwalah kepada Allah yang kepada-Nya kalian beriman dengan mengerjakan segala perintah-perintah-Nya dan menjauhi segala larangan-larangan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "11. Dan jika sebagian istri kalian keluar dari islam dan bergabung dengan orang-orang kafir, sedangkan orang-orang kafir tidak memberi kalian mahar yang kalian berikan bagi istri kalian itu, kemudian kalian dapat mengalahkan orang-orang kafir; maka berikanlah orang yang kehilangan istrinya dari kalian itu sebagian harta ghanimah untuknya sesuai kadar mahar yang dia beri. Dan bertakwalah kepada Allah dengan mentaati hukum-hukum-Nya jika kalian benar-benar beriman kepada-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "11. وَإِن فَاتَكُمْ شَىْءٌ مِّنْ أَزْوٰجِكُمْ إِلَى الْكُفَّارِ (Dan jika seseorang dari isteri-isterimu lari kepada orang-orang kafir) Yakni dengan murtadnya wanita itu dan kembali ke negeri kafir, merki berasal dari Ahli kitab. فَعَاقَبْتُمْ(lalu kamu mengalahkan mereka) Yakni harta ghanimahnya adalah milik kalian. فَـَٔاتُوا۟ الَّذِينَ ذَهَبَتْ أَزْوٰجُهُم مِّثْلَ مَآ أَنفَقُوا۟ ۚ( maka bayarkanlah kepada orang-orang yang lari isterinya itu mahar sebanyak yang telah mereka bayar) Yakni mereka diperintakan untuk memberi kepada orang yang istrinya pergi itu setara dengan mahar yang dulu ia berikan kepada istrinya itu yang diambil dari harta fa’i dan ghanimah jika orang-orang musyrik belum mengembalikan maharnya. وَاتَّقُوا۟ اللهَ الَّذِىٓ أَنتُم بِهِۦ مُؤْمِنُونَ(Dan bertakwalah kepada Allah Yang kepada-Nya kamu beriman) Yakni berhati-hatilah agar kalian tidak melakukan hal yang mendatangkan siksaan bagi kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Apabila istri kalian lepas dari kalian dan murtad sehingga menjadi istri orang-orang kafir, maka harta rampasan perang terhadap mereka adalah untuk kalian. Maka berikanlah mahar kepada orang-orang yang ditinggal istri mereka murtad itu senilai dengan mahar mereka. Sebagai pengganti atas mahar yang mereka berikan dan belum dikembalikan oleh mantan istri mereka. Dan mereka takut kepada Allah atas apa yang kalian juga percayai, maka jangan perselisihi urusan mereka. Hasan berkata: Ayat ini turun untuk Ummul Hakam binti Abi Sufyan yang telah murtad. Kemudian dia dinikahi oleh seorang laki-laki yang mulia, dan tidak ada perempuan yang murtad selain dia. ’Aqabtum bermakna harta yang menjadi harta rampasan bagi kalian setelah mereka kalian kalahkan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika ada dari istri-istri kalian yang lari} jika sebagian istri kalian murtad {kepada orang-orang kafir, lalu kalian dapat mengalahkan mereka} lalu kalian berperang dan mendapatkan harta rampasan {berikanlah kepada orang-orang yang istrinya lari itu sebanyak mahar yang telah mereka berikan Bertakwalah kepada Allah yang kepadaNya kalian beriman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11. Fiman Allah, “dan jika seseorang dari istri-istrimu lari kepada orang kafir,’ karena murtad, “lalu kamu mengalahkan mereka maka bayarkanlah kepada orang-orang yang lari istrinya itu mahar sebanyak yang telah mereka bayar.” Ini sebagaimana yang disebutkan sebelumnya, karena orang-orang kafir berhak mendapatkan kompensasi atas istri-istri mereka yang bergabung dalam barisan orang-orang kafir juga Muslim. Sebaliknya, orang-orang Muslim yang kehilangan istri-istrinya karena bergabung dalam barisan orang-orang kafir juga berhak mendapatkan kompensasi dari orang-orang kafir sebagai ganti dari sejumlah uang yang pernah diberikan. “Dan bertakwalah kepada Allah Yang kepadaNya kami beriman.” Yakni, keimanan kalian terhadap Allah mengharuskan kalian untuk selalu bertakwa selamanya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mumtahanah ayat 11: Allah menjelaskan jika pergi sebagian dari istri-istri kalian wahai orang-orang yang beriman, kepada orang-orang kafir, maka para istri tersebut telah keluar dari islam dan kalian berhak meminta pengembalian mahar, maka jika tidak menyerahkan mahar, kalian perangi dan ghanimahnya milik kalian, berikan ghanimahnya oleh kalian sebelum kalian berpisah dengan istri-istri kalian yang pergi menuju ke negeri kafir dan jika tidak mendapatkan dari gantinya, maka berinfaklah. Takutlah kepada Allah yang kalian adalah orang-orang yang beriman, dengan itu kalian telah mengikuti perintah dan menjauhi larangan-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni mereka pergi dalam keadaan murtad kepada orang-orang kafir. Yakni sebagaimana orang-orang kafir mengambil ganti terhadap apa yang luput dari istri-istri mereka yang lari kepada kaum muslimin, maka barang siapa yang istrinya pergi kepada orang-orang kafir dan ia belum mengambil haknya, maka ia berhak diberi oleh kaum muslimin dari ghanimah sebagai ganti dari apa yang dikeluarkannya. Oleh karena itu, sebelum ghanimah dibagikan kepada lima golongan yang berhak, dibayar lebih dahulu mahar-mahar kepada suami-suami yang istri-istri mereka lari ke daerah kafir. Keimanan kamu kepada Allah Subhaanahu wa Ta'aala menghendaki kamu untuk tetap bertakwa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mumtahanah Ayat 11",
    "description": "Allah lalu menjelaskan cara-cara pengembalian mahar kepada para suami yang ditinggalkan istri mereka tersebut. Dan jika ada sesuatu tentang pengembalian mahar yang belum selesai dari istri-istri kamu yang lari kepada orang-orang kafir, karena para mantan istri kamu itu tidak memiliki niat baik untuk mengembalikan mahar kepada kamu, kemudian kamu berhasil mengalahkan mereka dalam perang, yakni mengalahkan orang-orang kafir yang kepada mereka mantan istri-istri kamu lari, maka berikanlah dengan mengambil dari harta rampasan perang kepada orang-orang yang istri-istri mereka lari kepada orang-orang kafir sebanyak mahar yang telah mereka berikan kepada mantan istri-istri mereka. Dan bertakwalah kamu, wahai para suami yang ditinggalkan istri, kepada Allah yang kepada-Nya kamu beriman agar kamu tetap tegar. 12. Ayat ini berbicara tentang perempuan yang berbaiat kepada nabi bahwa mereka berjanji setia tidak akan melakukan dosa-dosa besar. Wahai nabi! apabila perempuan-perempuan beriman dari berbagai kabilah datang kepadamu untuk berbaiat, berjanji setia, bahwa mereka tidak akan mempersekutukan Allah dengan sesuatu apa pun setelah mengokohkan dua kalimat syahadat; tidak akan mencuri milik orang lain dengan cara apa pun; tidak akan berzina dengan siapa pun; tidak akan membunuh anak-anak mereka seperti kebiasaan masyarakat arab sebelum zaman islam, tidak akan berbuat dusta yang mereka ada-adakan antara tangan dan kaki mereka dengan mengadakan pengakuan-pengakuan palsu mengenai hubungan antara laki-laki dan perempuan seperti tuduhan berzina, tuduhan bahwa anak seorang perempuan bukan anak suaminya; dan tidak akan mendurhakaimu dalam urusan kebaikan yang diperintahkan Allah dan rasul-Nya; maka terimalah janji setia mereka semoga menjadi momentum untuk perbaikan akhlak mereka dan mohonkanlah ampunan untuk mereka kepada Allah agar dosa-dosa mereka dihapuskan oleh Allah. Sesungguhnya Allah maha pengampun kepada siapa saja yang bertobat dengan tulus, maha penyayang kepada hamba-hamba-Nya yang beriman dan mendekatkan diri kepada-Nya."
  }
]