[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "12. Wahai Nabi, bila kaum wanita yang beriman kepada Allah dan rasulNya berjanji kepadamu untuk tidak mengangkat sekutu bagi Allah dalam beribadah, tidak mencuri, tidak berzina, tidak membunuh anak-anak mereka sebelum dan sesudah persalinan, tidak menasabkan anak-anak kepada para suami mereka yang bukan dari mereka, dan tidak menyelisihi perintahmu dalam hal-hal baik, maka terimalah janji mereka di atas itu, dan mintalah ampunan kepada Allah bagi mereka, sesungguhnya Allah Maha Pengampun bagi dosa-dosa para hambaNya dan Maha Penyayang kepada mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Wahai Rasul! Jika datang kepadamu wanita-wanita yang beriman untuk membaiatmu -sebagaimana yang terjadi pada penaklukan kota Makkah- untuk tidak menyekutukan sesuatu dengan Allah, hanya menyembah Allah semata, tidak mencuri, tidak berzina, tidak membunuh anak-anak mereka karena mengikuti adat jahiliyah, tidak menasabkan anak-anak hasil zina kepada suami-suami mereka dan tidak mendurhakaimu dalam perkara yang baik seperti larangan untuk meratap, menjambak rambut dan merobek baju maka baiatlah mereka dan mohonkan ampunan untuk mereka dari Allah atas dosa-dosa mereka setelah baiat mereka kepadamu. Sesungguhnya Allah Maha Pengampun atas orang yang bertobat dari hamba-hamba-Nya, Maha Penyayang terhadap mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "12. Hai Nabi, jika datang kepadamu wanita-wanita yang beriman kepada Allah dan rasul-Nya untuk berjanji kepadamu bahwa mereka tidak akan menyekutukan Allah, mencuri, berzina, membunuh anak mereka setelah lahir atau sebelumnya, menuduh suami mereka memiliki anak dari hasil perzinaan, dan menyelisihi perintahmu yang baik; maka ambillah perjanjian itu dari mereka. Dan mintalah ampunan dari Allah bagi mereka. Allah Maha Mengampuni dosa hamba-hamba-Nya yang bertaubat, dan Maha Besar ampunan dan rahmat-Nya. Diriwayatkan dari ‘Urwah bahwa ‘Aisyah, istri Nabi Muhammad menyampaikan kepadanya bahwa dahulu Rasulullah menguji wanita-wanita beriman yang menyusulnya berhijrah sesuai dengan firman Allah: “Hai Nabi, apabila datang kepadamu perempuan-perempuan yang beriman untuk mengadakan janji setia, bahwa mereka tiada akan menyekutukan Allah, tidak akan mencuri, tidak akan berzina, tidak akan membunuh anak-anaknya, tidak akan berbuat dusta yang mereka ada-adakan antara tangan dan kaki mereka dan tidak akan mendurhakaimu dalam urusan yang baik, maka terimalah janji setia mereka dan mohonkanlah ampunan kepada Allah untuk mereka. Sesungguhnya Allah maha Pengampun lagi Maha Penyayang.” Dan ‘Urwah meriwayatkan, ‘Aisyah berkata: Maka wanita-wanita beriman yang menerima syarat yang disebutkan dalam ayat ini maka Rasulullah akan berkata kepadanya: “Aku telah membai’atmu” secara lisan; dan demi Allah, tangan Rasulullah sama sekali tidak pernah menyentuh wanita ketika membaiatnya. Rasulullah hanya membaiat mereka dengan sabdanya: “Aku telah membaiatmu dalam hal ini.” (Shahih al-Bukhari 8/504, kitab tafsir, surat al-Mumtahanah, (ayat ini), no. 4891. Dan Shahih Muslim 3/1489, kitab kepemimpinan, bab cara membaiat wanita, no. 1866)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "12. يٰٓأَيُّهَا النَّبِىُّ إِذَا جَآءَكَ الْمُؤْمِنٰتُ يُبَايِعْنَكَ (Hai Nabi, apabila datang kepadamu perempuan-perempuan yang beriman untuk mengadakan janji setia) Yakni wanita-wanita yang hendak membaiatmu dalam Islam. عَلَىٰٓ أَن لَّا يُشْرِكْنَ بِاللهِ شَيْـًٔا(bahwa mereka tiada akan menyekutukan Allah) Ini terjadi di hari penakhlukan kota Makkah, wanita-wanita penduduk makkah mendatangi Rasulullah untuk membaiatnya. Maka Allah memerintahkan Rasulullah untuk mengambil janji mereka untuk tidak menyekutukan Allah. وَلَا يَقْتُلْنَ أَوْلٰدَهُنَّ(tidak akan membunuh anak-anaknya) Dan ini adalah kebiasaan mereka di zaman jahiliyah, yang mengubur anak perempuan hidup-hidup. وَلَا يَأْتِينَ بِبُهْتٰنٍ يَفْتَرِينَهُۥ بَيْنَ أَيْدِيهِنَّ وَأَرْجُلِهِنَّ(tidak akan berbuat dusta yang mereka ada-adakan antara tangan dan kaki mereka) Yakni tidak menisbatkan kepada suami mereka anak-anak yang bukan dari keturunan suami-suami tersebut. Imam al-Farra’ mengatakan: “Dahulu wanita mengambil anak dari jalanan lalu berkata kepada suaminya, “ini adalah anakku darimu”.” Sedangkan Ibnu Abbas mengatakan bahwa dahulu wanita jika melahirkan anak perempuan maka ia akan menukarnya dengan anak laki-laki. وَلَا يَعْصِينَكَ فِى مَعْرُوفٍ (dan tidak akan mendurhakaimu dalam urusan yang baik) Yakni dalam segala perintah yang merupakan ketaatan kepada Allah, seperti perintah untuk tidak berteriak-teriak saat ditinggal mati seseorang, atau dengan merobek-robek baju, menarik rambut, merobek kerah baju, melukai wajah, atau berdoa mengharap kebinasaan. فَبَايِعْهُنَّ وَاسْتَغْفِرْ لَهُنَّ اللهَ ۖ( maka terimalah janji setia mereka dan mohonkanlah ampunan kepada Allah untuk mereka) Yakni mohonlah ampun kepada Allah bagi mereka setelah pembaiatan ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12. Wahai Nabi, apabila ada perempuan yang beriman dating kepadamu dengan membawa maksud untuk bersyahadat dalam Islam. Berikrar untuk meninggalkan perbuatan syirik kepada Allah, mencuri, zina. Juga tidak membunuh anak-anak mereka karena takut miskin. Juga tidak berbuat dusta yang yang mereka ada-adakan. Maksudnya adalah setiap orang yang bersedia taat kepada Allah, menjalankan perintah-Nya dengan baik baik secara syariat dan aqal. Mereka bersedia untuk meninggalkan ratapan dan mengkoyak-koyak baju mereka, menjambak rambut, merobek saku dan segala tindakan yang mencerminkan perilaku zaman jahiliyah. Kemudian mereka berserah diri dalam naungan Islam dan ketaatan. Mintalah ampunan kepada Allah atas dosa-dosa mereka yang telah lalu. Sesungguhnya Allah Maha Luas dalam memberi ampunan dan rahmat. Ayat ini turun ketika fathu Makkah, ketika rasul telah selesai mengambil baiat para laki-laki untuk mengambil baiat para perempuan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai Nabi, apabila perempuan-perempuan mukmin datang kepadamu untuk mengadakan baiat} untuk berjanji setia kepadamu {bahwa mereka tidak akan menyekutukan Allah dengan sesuatu apapun, tidak akan mencuri, tidak akan berzina, tidak akan membunuh anak-anak mereka, tidak akan berbuat dusta yang mereka ada-adakan antara tangan dan kaki mereka} menasabkan kepada suami-suami mereka dengan anak-anak yang bukan mereupakan anak mereka {dan tidak akan mendurhakaimu dalam urusan yang baik, maka terimalah janji setia mereka dan mohonkanlah ampunan untuk mereka kepada Allah. Sesungguhnya Allah Maha Pengampun lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "12. Syarat-syarat yang disebutkan dalam ayat ini disebut sebagai mubahaya’at an-nisa’ (bai’at kaum wanita) yang pernah mereka buat agar kewajiban-kewajiban bersama antara kaum lelaki maupun perempuan ditunaikan di berbagai waktu. Adapun kaum lelaki, kewajiban-kewajiban mereka berbeda-beda sesuai kondisi, dan derajat, serta kewajiban yang harus mereka tunaikan. Nabi menunaikan apa yang diperintahkan Allah. Jika ada kaum wanita datang berbai’at dan komit terhadap syarat-syaratnya, Rasulullah membai’at mereka, menghibur hati mereka dan memintakan ampunan pada Allah untuk mereka dari segala kekurangan yang pernah mereka lakukan. Kemudian Rasulullah memasukkan mereka ke dalam golongan kaum Mukminin, dengan syarat “bahwa mereka tidak akan mempersekutukan sesuatu pun dengan allah,” dan wajib mengesakan Allah semata dalam beribadah, “dan tidak akan berzina,” sebagaimana yang dulunya banyak tersebar dan dilakukan oleh para pelacur, “tidak akan berbuat dusta yang mereka ada-adakan antara tangan dan kaki mereka.” ‘albuhtaanu’ adalah berkata dusta atas nama orang lain, maksudnya tidak berbuat dusta yang diada-adakan, baik yang berhubungan dengan suami-suami mereka atau yang berkaitan dengan orang lain, “dan tidak akan mendurhakaimu dalam urusan yang baik,” maksudnya, tidak mendurhakaimu dalam kebaikan yang kau perintahkan pada mereka, karena perintahmu adalah kebaikan, dan termasuk di antaranya mereka harus menaatimu dalam larangan untuk meratapi mayit, merobek saku baju, memukul-mukul muka serta mengucapkan doa-doa jahiliyah. “Maka terimalah janji setia mereka,” jika mereka komit terhadap semua hal yang telah disebutkan, “dan mohonkanlah ampunan kepada Allah untuk mereka,” dari kekurangan-kekurangan mereka dan juga sebagai pelipur lara bagi mereka. “Sesungguhnya Allah Maha Pengampun,” Yang banyak ampunanNya untuk orang-orang yang durhaka dan berbuat baik kepada para pendosa yang mau bertaubat. “Lagi Maha Penyayang,” yang kasih sayangNya meliputi segala sesuatu dan kebaikanNya meliputi seluruh makhluk."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mumtahanah ayat 12: Wahai Nabi, jika datang wanita-wanita yang beriman dengan suatu perjanjian kepadamu : Yaitu mereka tidak menyekutukan Allah dengan apapun, tidak berbuat dosa kejahatan mencuri, tidak berbuat kejahatan dengan berzina, yang itu adalah keburukan yang paling hina, dan yang tidak membunuh anak-anak mereka karena itu adalah perbuatan jahiliyyah; Karena sebab takut celaan dan faqir, dan yang mereka tidak menisbatkan anak mereka kepada suami-suami mereka yang padahal anak tersebut bukan anak mereka, dan yang mereka tidak menyelisihi kebenaran yang diperintahkan kepada mereka. Maka semua ini adalah syarat untuk mereka berbaiat kepadamu wahai Nabi ﷺ, dan mintalah ampunan dari Allah untuk mereka; Karena Dia maha pengampun atas dosa seorang hamba yang mereka bertaubat, yang Dia memiliki kasih sayang kepada para hamba."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Syarat-syarat yang disebutkan dalam ayat ini adalah syarat dalam pembai’atan wanita, dimana mereka berbai’at untuk menjalankan kewajiban yang berlaku bagi laki-laki maupun wanita di setiap waktu, adapun laki-laki maka kewajiban mereka berbeda-beda sesuai keadaan mereka dan tingkatan mereka dan yang harus mereka kerjakan. Maka Nabi shallallahu 'alaihi wa sallam menjalankan perintah Allah tersebut, oleh karenanya ketika wanita datang, maka Beliau membai’at mereka dan mewajibkan mereka memenuhi syarat-syarat itu, menutupi kesedihan mereka dan memintakan ampun kepada Allah untuk mereka terhadap hal yang mungkin terjadi berupa sikap kurang memenuhi hak, serta memasukkan mereka ke dalam golongan kaum mukmin. Seperti mengubur bayi hidup-hidup karena malu (dianggap sebagai aib) atau karena takut miskin. Perbuatan yang mereka ada-adakan antara tangan dan kaki mereka itu maksudnya, mengadakan pengakuan-pengakuan palsu terhadap orang lain seperti menuduh berzina, tuduhan bahwa anak si fulan bukan anak suaminya dan sebagainya. Yakni dalam semua yang diperintahkan Rasulullah shallallahu 'alaihi wa sallam seperti tidak meratap, tidak merobek baju, tidak mencukur rambut, tidak mencakar muka dan tidak menyeru dengan seruan jahiliyyah. Apabila mereka siap melaksanakan apa yang disebutkan. Terhadap sikap kurang mereka dan untuk menyejukkan hati mereka. Yakni banyak mengampuni orang-orang yang bermaksiat serta berbuat ihsan kepada orang-orang yang berdosa yang bertobat. Rahmat-Nya meliputi segala sesuatu dan ihsan-Nya mengena kepada seluruh makhluk."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mumtahanah Ayat 12",
    "description": "Ayat ini berbicara tentang perempuan yang berbaiat kepada nabi bahwa mereka berjanji setia tidak akan melakukan dosa-dosa besar. Wahai nabi! apabila perempuan-perempuan beriman dari berbagai kabilah datang kepadamu untuk berbaiat, berjanji setia, bahwa mereka tidak akan mempersekutukan Allah dengan sesuatu apa pun setelah mengokohkan dua kalimat syahadat; tidak akan mencuri milik orang lain dengan cara apa pun; tidak akan berzina dengan siapa pun; tidak akan membunuh anak-anak mereka seperti kebiasaan masyarakat arab sebelum zaman islam, tidak akan berbuat dusta yang mereka ada-adakan antara tangan dan kaki mereka dengan mengadakan pengakuan-pengakuan palsu mengenai hubungan antara laki-laki dan perempuan seperti tuduhan berzina, tuduhan bahwa anak seorang perempuan bukan anak suaminya; dan tidak akan mendurhakaimu dalam urusan kebaikan yang diperintahkan Allah dan rasul-Nya; maka terimalah janji setia mereka semoga menjadi momentum untuk perbaikan akhlak mereka dan mohonkanlah ampunan untuk mereka kepada Allah agar dosa-dosa mereka dihapuskan oleh Allah. Sesungguhnya Allah maha pengampun kepada siapa saja yang bertobat dengan tulus, maha penyayang kepada hamba-hamba-Nya yang beriman dan mendekatkan diri kepada-Nya. 13. Ayat ini berbicara tentang larangan memohon perlindungan kepada orang-orang kafir. Wahai orang-orang beriman kuatkanlah iman kamu, janganlah kamu menjadikan orang-orang yang dimurka Allah seperti orang-orang kafir, orang-orang munafik, dan orang-orang fasik, pelaku dosa besar secara terus-menerus sebagai penolong kamu ketika kamu mengalami kesulitan atau mempunyai masalah dunia atau agama. Sungguh mereka telah berputus asa terhadap akhirat sehingga kamu seperti berpegang kepada pohon yang tumbang atau dahan yang hanyut. Mereka tidak meyakini akhirat, bagaimana menolong kamu memperhatikan akhirat. Kehidupan mereka sebagaimana orang-orang kafir yang telah berada di dalam kubur berputus asa dari kasih sayang Allah. Mereka kehilangan asa untuk mendapatkan keselamatan."
  }
]