[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "13. Wahai orang-orang yang beriman kepada Allah dan RasulNya, janganlah kalian mengangkat orang-orang yang dimurkai Allah karena kekafiran mereka, sebagai rekan-rekan dan teman-teman dekat, mereka telah berputus asa dari pahala Allah di akhirat, sebagaimana orang-orang kafir penghuni kubur berputus asa dari rahmat Allah di akhirat, manakala mereka menyaksikan perkara sebenarnya, mengetahui dengan yakin bahwa mereka tidak mendapatkan bagian darinya, atau sebagaimana orang-orang kafir berputus asa dari dibangkitkannya penghuni kubur, karena mereka memang tidak mempercayai adanya kebangkitan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "13. \"Wahai orang-orang yang beriman kepada Allah dan menjalankan syariat yang ditetapkan untuk mereka! Janganlah kalian jadikan (penolong) kaum yang dimurkai Allah, mereka tidak percaya kepada Akhirat, bahkan mereka berputus asa dari Akhirat sebagaimana keputus asaan mereka dari kembalinya orang-orang mereka yang telah meninggal kepada mereka dikarenakan kekufuran mereka terhadap kebangkitan.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "13. Allah melarang orang-orang beriman menjadikan orang-orang yang Dia murkai karena kesyirikan dan kekafiran mereka, untuk menjadi para penolong dan teman. Dalam diri mereka telah tertanam keputus-asaan dari pahala Allah di akhirat kelak, seperti keputusasaan orang-orang kafir dari menghidupkan kembali orang mati."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "13. يٰٓأَيُّهَا الَّذِينَ ءَامَنُوا۟ لَا تَتَوَلَّوْا۟ قَوْمًا غَضِبَ اللهُ عَلَيْهِمْ (Hai orang-orang yang beriman, janganlah kamu jadikan penolongmu kaum yang dimurkai Allah) Yang dimaksud adalah semua kaum kafir yang ada. Pendapat lain mengatakan yang dimaksud adalah orang-orang Yahudi saja. قَدْ يَئِسُوا۟ مِنَ الْاٰخِرَةِ(Sesungguhnya mereka telah putus asa terhadap negeri akhirat) Yakni mereka sama sekali tidak beriman kepada hari akhir karena kekafiran mereka. كَمَا يَئِسَ الْكُفَّارُ مِنْ أَصْحٰبِ الْقُبُورِ(sebagaimana orang-orang kafir yang telah berada dalam kubur berputus asa) Yakni seperti hilangnya harapan mereka terhadap pembangkitan mereka karena mereka tidak mempercayainya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13. Wahai orang-orang yang beriman kepada Allah dam rasul-Nya, jangan kalian jadikan orang-orang yang dimurkai Allah sebagai penolong bagi kalian. Mereka telah putus asa terhadap nikmat akhirat dan segala keutamaannya karena kekufuran mereka atas akhirat. Mereka juga mengingkari hari kebangkitan, karena ketamakan mereka terhadap nikmat dunia. Orang-orang kafir adalah orang-orang yang terlaknat. Ini adalah gambaran yang mengungkapkan sebab mereka menjadi golongan yang terlaknat oleh Allah. Abdullah bin Umar dan Zaid bin Harits mencintai seorang pemuda Yahudi Maka turunlah ayat ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, janganlah menjadikan kaum yang dimurkai Allah sebagai teman-teman akrab. Sungguh mereka telah putus asa terhadap akhirat sebagaimana orang-orang kafir yang telah berada dalam kubur juga berputus asa}"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "13. Maksudnya, hai orang-orang yang beriman, jika kalian benar-benar beriman kepada Rabb kalian, meniti RidhaNya dan menjauhi murkaNya, “janganlah kamu jadikan penolongmu kaum yang dimurkai Allah,” yang dimurkai karena kekufuran mereka. Ini mencakup seluruh golongan orang-orang kafir. “Sungguh mereka telah putus asa terhadap negeri akhirat,” maksudnya, mereka terhalang dari kebaikan akhirat, mereka tidak mendapatkan bagian apa pun di akhirat. Waspadalah agar jangan menjadikan mereka sebagai penolongmu, supaya kalian tidak memiliki keburukan dan kesyirikan seperti halnya mereka. Firman Allah, “SEbagaimana orang-orang kafir yang telah berada dalam kubur berputus asa” ketika mereka menuju akhirat, menyaksikan kebenaran akhirat dan benar-benar mengetahui secara yakin bahwa mereka tidak mendapatkan bagian apa pun d akhirat. Kemungkinan makna orang-orang kafir berputus asa dari akhirat adalah karena mereka mengingkari dan mengkufurinya. Karena itu, tidaklah mengherankan jika orang-orang kafir pada saat itu menuju kemurkaan allah dan siksaNya. Mereka berputus asa dari akhirat sebagaimana orang-orang kafir yang mengingkari Hari Kebangkitan ketika berada di dunia mereka putus asa dari kembalinya penghuni kubur menuju Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mumtahanah ayat 13: Allah menutup surat ini dengan larangan seorang hamba yang beriman, yaitu mereka yang beriman kepada Allah dan Rasul-Nya ﷺ; dari berkasih sayang kepada yahudi dan nashrani dan bagi seluruh orang-orang kafir yang Allah benci atas mereka, Allah halau orang-orang beriman dari mereka karena kecintaan Allah terhadap orang-orang yang beriman. Karena sebab mereka kufur dan sesat (yahudi, nashrani, dll.); Maka Allah memperingatkan dari menyayangi mereka; Meskipun mereka teman atau saudara. Mereka orang-orang pendosa, sungguh mereka tidak ada harapan lagi dari balasan di akhirat dan kenikmatannya, sebagaimana orang kafir yang tidak memiliki harapan, yaitu yang mereka mendustakan hari kebangkitan dari pengembalian mayat-mayat mereka untuk bangkit dan hidup kedua kalinya setelah mereka semua mati."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Wahai orang-orang yang beriman, jika kamu memang beriman kepada Tuhanmu, mengikuti keridhaan-Nya dan menjauhi kemurkaan-Nya. Seperti orang-orang Yahudi dan orang-orang kafir lainnya. Mereka telah terhalang mendapatkan kebaikan akhirat dan mereka tidak memperoleh bagiannya. Oleh karena itu, berhati-hatilah dari berwala’ kepada mereka sehingga kalian sama dalam keburukan dan kekafiran mereka dan kamu pun terhalang dari memperoleh kebaikan akhirat sebagaimana mereka. Ketika mereka telah sampai ke negeri akhirat. Karena telah ditunjukkan kepada mereka tempat mereka di surga jika mereka di dunia beriman dan tempat kembali mereka nanti, yaitu neraka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mumtahanah Ayat 13",
    "description": "Ayat ini berbicara tentang larangan memohon perlindungan kepada orang-orang kafir. Wahai orang-orang beriman kuatkanlah iman kamu, janganlah kamu menjadikan orang-orang yang dimurka Allah seperti orang-orang kafir, orang-orang munafik, dan orang-orang fasik, pelaku dosa besar secara terus-menerus sebagai penolong kamu ketika kamu mengalami kesulitan atau mempunyai masalah dunia atau agama. Sungguh mereka telah berputus asa terhadap akhirat sehingga kamu seperti berpegang kepada pohon yang tumbang atau dahan yang hanyut. Mereka tidak meyakini akhirat, bagaimana menolong kamu memperhatikan akhirat. Kehidupan mereka sebagaimana orang-orang kafir yang telah berada di dalam kubur berputus asa dari kasih sayang Allah. Mereka kehilangan asa untuk mendapatkan keselamatan. 1. Apa yang ada di langit, bintang, bulan, matahari, dan seluruh planet; dan apa yang ada di bumi, hewan dan tetumbuhan bertasbih kepada Allah, mengakui dan menyatakan kemahasucian Allah yang berbeda dengan seluruh makhluk ciptaan-Nya; dan dialah yang mahaperkasa menciptakan dan menghancurkan jagat raya sekejap mata; mahabijaksana, tidak terburu menggunakan kekuasaan-Nya yang tiada terbatas untuk menghancurkan jagat raya atau menghukum manusia yang berdosa."
  }
]