[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "2. Bila orang-orang yang kalian memberikan kasih sayang kepada mereka secara rahasia tersebut mengalahkan kalian, niscaya mereka memerangi kalian, menggerakkan tangan-tangan mereka untuk membunuh dan menawan kalian, menggerakkan lidah-lidah mereka dengan mencaci dan mencela kalian, dan mereka berharap dalam keadaan apa pun, seandainya kalian kafir seperti mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Jika mereka menang atas kalian, mereka menampakkan permusuhan yang selama ini mereka sembunyikan di hati mereka, menjulurkan tangan-tangan mereka kepada kalian untuk menyakiti dan memukul kalian, mengeluarkan dari mulut-mulut mereka celaan dan cibiran serta mereka berangan-angan kiranya kalian kafir kepada Allah dan Rasul-Nya, sehingga kalian menjadi seperti mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "2-3. Jika orang-orang yang kalian sampaikan rahasia kepada mereka demi mendapat kecintaan mereka itu dapat menang atas kalian, niscaya mereka akan berlaku keras terhadap kalian dengan tangan mereka, dan menghina kalian dengan lisan mereka; dan lebih dari semua itu, mereka berharap agar kalian menjadi kafir seperti mereka, sehingga kalian menjadi sama dengan mereka. Para kerabat dan anak-anak kalian tidak akan bermanfaat bagi kalian ketika kalian menolong orang-orang kafir demi para kerabat dan anak-anak itu. Allah akan menetapkan perkara antara kalian dengan mereka pada hari kiamat, dengan memasukkan orang-orang beriman ke dalam surga-surga yang penuh dengan kenikmatan, dan memasukkan orang-orang yang penuh dosa ke dalam neraka Jahannam."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. إِن يَثْقَفُوكُمْ يَكُونُوا۟ لَكُمْ أَعْدَآءً (Jika mereka menangkap kamu, niscaya mereka bertindak sebagai musuh bagimu) Yakni jika mereka menjumpai kalian niscaya mereka akan menampakkan permusuhan yang ada dalam hati mereka. وَيَبْسُطُوٓا۟ إِلَيْكُمْ أَيْدِيَهُمْ وَأَلْسِنَتَهُم بِالسُّوٓءِ(dan melepaskan tangan dan lidah mereka kepadamu dengan menyakiti(mu)) Yakni mereka mengerahkan tangan mereka untuk memukul kalian dan sebagainya, serta memakai lidah mereka untuk mencaci dan sebagainya. وَوَدُّوا۟ لَوْ تَكْفُرُونَ(dan mereka ingin supaya kamu (kembali) kafir) Yakni mereka berharap kalian murtad dan kembali kepada kekafiran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Jika mereka kaum musyrik menangkap kalian, mereka mengaku/bertindak sebagai musuh kalian. Mereka akan menyerang/memerangi, membunuh dan memenjara kalian. Mereka mencaci dan menghina kalian, dan yang mereka harapkan hanyalah supaya kalian keluar dari agama kalian."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Jika mereka menangkap kalian} mengalahkan kalian {niscaya mereka menjadi musuh bagi kalian. Lalu mereka melemparkan} mereka melemparkan {tangan dan lidah mereka kepada kalian untuk menyakiti} untuk memukul, membunuh, mencaci, dan mengutuk {dan mereka ingin agar kalian ingkar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2. Kemudian Allah menjelaskan hebatnya permusuhan orang-orang kafir sebagai dorongan bagi orang-orang Mukmin agar memusuhi mereka. “Jika mereka menangkap kamu,” maksudnya, bertemu dengan kalian dan berkesempatan untuk mencelakai kalian, “niscaya mereka bertindak sebagai musuh bagimu” secara nyata, “dan mengumbar tangan dan lidah mereka kepadamu dengan menyakiti (mu),” dengan kata-kata yang menyakiti seperti celaan dan lainnya. “Dan mereka ingin supaya kamu (kembali) kafir.” Inilah puncak yang mereka inginkan darimu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mumtahanah ayat 2: Ketahuilah wahai orang-orang yang beriman, jika kalian masih memilki keinginan kepada musuh-musuh Allah yang menjadikan kalian berkasih sayang dan memiliki kecintaan, maka mereka akan menampakkan permusuhan mereka dan sebagian dari mereka kepada kalian; Dan urusannya tidak berhenti sampai situ; Bahkan mereka akan mengulur waktu dihadapan mereka untuk membunuh, mencela, dan menyesatkan kalian serta menguasai lisan-lisan kalian atas apa yang mereka olok-olok kepada kalian, dari celaan mereka, permusuhan mereka. Dan setelah itu mereka akan menjadi tenang karena kalian akan menjadik kafir semisal mereka; Mereka ingin menjadikan kalian sebagaimana mereka di atas kekafiran."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala menerangkan betapa besarnya permusuhan mereka untuk mendorong kaum mukmin memusuhi mereka. Dengan memukulmu atau membunuhmu atau melakukan perbuatan lainnya untuk menyakitimu. Dengan mencaci-makimu. Inilah maksud utama mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mumtahanah Ayat 2",
    "description": "Allah lalu menjelaskan mengapa ia melarang kaum muslim membocorkan rahasia kepada kaum kafir. Jika mereka, orang-orang kafir yang memusuhi kamu, menangkap kamu atau mengalahkan kamu dalam perang, niscaya mereka bertindak sebagai musuh bagi kamu dengan berbuat kezaliman di luar batas kemanusiaan, karena orang kafir yang membenci islam dan kaum muslim tidak bisa dijadikan sahabat setia; lalu melepaskan tangan mereka dengan tindakan dan lidahnya dengan kata-kata kasar dan tajam kepada kamu untuk menyakiti perasaan kamu, menghujat ajaran islam, serta melukai kehormatan kamu sebagi muslim; dan mereka sangat menginginkan agar kamu kembali kafir, mengikuti keyakinan mereka. 3. Kaum kerabat dan anak-anak kamu yang selama ini menjadi kebanggaan kamu tidak akan bermanfaat bagi kamu pada hari kiamat, karena kehidupan di akhirat bersifat individual, tidak ada jual beli, tidak ada persahabatan, dan tidak ada tolong menolong. (al-baqarah/2: 254); dan akhirat akan memisahkan hubungan di antara kamu, kecuali yang seiman akan dipertemukan di dalam surga. Dan Allah maha melihat apa yang kamu kerjakan, kebaikan maupun keburukan yang disembunyikan maupun yang dinyatakan secara terbuka."
  }
]