[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "3. Kekerabatan dan anak-anak kalian tidak berguna bagi kalian sedikit pun manakala kalian memberikan loyalitas kepada orang-orang kafir demi mereka, pada Hari Kiamat Allah memisahkan di antara kalian, Allah memasukkan orang-orang yang taat ke dalam surga dan orang-orang yang bermaksiat ke dalam neraka. Allah Maha Melihat apa yang kalian lakukan, tidak ada sedikit pun dari perbuatan-perbuatan dan perkataan-perkataan kalian yang samar bagiNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Kekerabatan kalian tidak berguna bagi kalian, anak-anak kalian tidak berguna bagi kalian jika kalian loyal kepada orang-orang kafir demi keuntungan mereka. Pada hari Kiamat nanti, Allah akan memisahkan antara kalian dan Dia memasukkan penghuni Surga dari kalian ke dalam surga dan penduduk Neraka ke dalam Neraka. Sebagian dari kalian tidak membawa manfaat bagi sebagian yang lain, dan Allah Maha Mengetahui apa yang kalian kerjakan, tidak ada sedikitpun dari amal perbuatan kalian yang luput dari-Nya dan Dia akan membalas kalian atas perbuatan tersebut."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. لَن تَنفَعَكُمْ أَرْحَامُكُمْ وَلَآ أَوْلٰدُكُمْ ۚ (Karib kerabat dan anak-anakmu sekali-sekali tiada bermanfaat bagimu) Yakni padahal anak keturunan dan kerabat kalian tidak akan bermanfaat bagi kalian pada hari kiamat, tapi mengapa kalian bersekutu dengan orang-orang kafir demi menyelamatkan anak keturunan dan kerabat kalian; sebagaimana yang terjadi pada kisah Hatib bin Abi Balta’ah. Namun yang dapat bermanfaat bagi kalian adalah dengan memusuhi orang-orang kafir, berjihad melawan mereka, dan tidak bersekutu dengan mereka, sebagaimana yang Allah perintahkan kepada kalian. يَوْمَ الْقِيٰمَةِ يَفْصِلُ بَيْنَكُمْ ۚ( pada Hari Kiamat Dia akan memisahkan antara kamu) Yakni memisahkan kalian dengan memasukkan orang-orang yang mentaati-Nya ke dalam surga dan memasukkan orang-orang yang bermaksiat kepada-Nya ke dalam neraka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Kedekatan kalian kepada mereka sungguh tidak akan memberi manfaat apapun. Anak-anak kalian yang kalian perintahkan untuk mengikuti mereka pun juga tidak akan mendatangkan manfaat apapun. Pada hari kiamat kelak kalian dan mereka akan Allah bedakan. Orang yang taat akan masuk surge, dan sebaliknya yang durhaka akan masuk neraka. Allah Maha Menampakkan segala amal kalian, tidak aka nada yang bisa tersembunya dari Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kaum kerabat kalian} kerabat kalian {dan anak-anak kalian tidak akan berguna bagi kalian pada hari kiamat. Kelak Dia akan memisahkan antara kalian} Dia memisahkan antara kalian sehingga Dia memasukkan orang-orang mukmin ke dalam surge dan orang-orang kafir ke dalam neraka {Allah Maha Melihat apa yang kalian kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3. Jika kalian beralasan bahwa kalian bersikap loyal terhadap orang-orang kafir karena kekerabatan dan bisnis, maka ingatlah bahwa harta dan anak-anak kalian sama sekali tidak berguna bagi kalian di hadapan Allah. “Dan Allah Maha Melihat apa yang kamu kerjakan.” Karena itu Allah memperingatkan kalian dengan keras agar tidak bersikap loyal terhadap orang-orang kafir,karena sikap seperti ini akan membahayakan kalian."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mumtahanah ayat 3: Kemudian ketahuilah wahai orang-orang yang beriman, tidaklah bermanfaat bagi kalian kerbat-kerabat kalian, tidak juga anak-anak kalian pada hari kiamat. Karena Allah pada hari ini memisahkan antara orang yang beriman dan yang kufur, dan Allah Maha Melihat atas amalan-amalan dan ucapan-ucapan kalian. Dan tidaklah tersembunyi atas-Nya sesuatu pun dari amalan dan ucapan kalian, sebagaimana tidak tersembunyi bagi-Nya apa yang ada di bumi dan di langit."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang masih musyrik. Untuk menolak azab-Nya pada hari Kiamat. Dengan mereka. Oleh karena itu, Dia memperingatkan kamu untuk tidak berwala’ kepada orang-orang kafir, dimana berwala’ kepada mereka dapat memberikan madharrat (kerugian) kepadamu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mumtahanah Ayat 3",
    "description": "Kaum kerabat dan anak-anak kamu yang selama ini menjadi kebanggaan kamu tidak akan bermanfaat bagi kamu pada hari kiamat, karena kehidupan di akhirat bersifat individual, tidak ada jual beli, tidak ada persahabatan, dan tidak ada tolong menolong. (al-baqarah/2: 254); dan akhirat akan memisahkan hubungan di antara kamu, kecuali yang seiman akan dipertemukan di dalam surga. Dan Allah maha melihat apa yang kamu kerjakan, kebaikan maupun keburukan yang disembunyikan maupun yang dinyatakan secara terbuka. 4. Melalui ayat ini, Allah memberikan pelajaran berharga dari hubungan nabi ibrahim dengan ayahnya. Sungguh, telah ada suri teladan yang baik bagi kamu, orang-orang beriman di akhir zaman, pada ibrahim dan orang-orang beriman yang bersama dengannya, para pengikut, dan sahabat-sahabatnya, ketika mereka berkata kepada kaumnya yang menyembah berhala dan mempertuhankan matahari, bulan, dan bintang, 'sesungguhnya kami berlepas diri dari kalian dan dari apa yang kalian sembah selain Allah, tidak menjadi sahabat kalian, dan mendukung perbuatan kalian, beribadah kepada selain Allah; kami mengingkari kekafiran kalian lahir batin, pernyataan, pikiran, perasaan, dan keyakinan, dan menurut kami telah nyata antara kami dan kalian ada permusuhan dan kebencian untuk selama-lamanya, karena kalian menolak beriman kepada Allah dan berusaha membunuh kami, orang-orang beriman, hingga kalian beriman kepada Allah saja dengan tauhid yang benar, sebab dengan beriman kalian menjadi saudara. 'Allah tidak membenarkan orang beriman memintakan ampunan untuk orang-orang kafir (lihat: surah an-nis'/4: 48), kecuali perkataan ibrahim kepada ayahnya yang bernama azar, 'sungguh aku akan memohonkan ampunan kepada Allah bagimu, karena cinta dan kasih sayang anak kepada orang tua, namun aku sebagai hamba Allah sama sekali tidak dapat menolak siksaan Allah kepadamu, karena aku tidak memiliki daya dan kekuatan apa pun. ' ibrahim berkata dalam doanya yang tulus, 'ya tuhan kami, hanya kepada engkau kami bertawakal, karena engkau menyukai orang yang bertawakal dan hanya engkau saja yang pantas menjadi tempat kami bertawakal; dan hanya kepada engkau kami bertobat, karena engkau menyukai hamba-hamba yang tobat dari dosa mereka dan hanya kepada engkau kami kembali, karena hanya engkau yang memiliki akhirat dan engkau pangkal seluruh kehidupan. '."
  }
]