[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "4. Bagi kalian (wahai orang-orang yang beriman) ada teladan yang baik pada diri Ibrahim dan orang-orang yang beriman bersamanya, manakala mereka berkata kepada kaum mereka yang kafir kepada Allah, “Sesungguhnya kami berlepasdiri dari kalian dan dari apa yang kalian sembah selain Allah, berupa sekutu-sekutu dan tandingan-tandingan, kami kafir kepada kalian dan mengingkari kekafiran yang kalian pegang. Telah tampak di antara kami dengan kalian permusuhan dan kebencian selamanya selama kalian tetap di atas kekafiran sehingga kalian beriman kepada Allah semata.” Akan tetapi permohonan Ibrahim kepada Allah agar mengampuni bapaknya tidak termasuk ke dalam yang diteladani (darinya), karena hal itu Ibrahim lakukan sebelum dia tahu bahwa bapaknya adalah musuh Allah, Ibrahim berlepasdiri darinya. Wahai Tuhan kami, hanya kepadaMu kami bersandar, hanya kepadaMu kami kembali dengan bertaubat dan hanya kepadaMu tempat kembali pada Hari Kiamat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Dan sungguh telah ada bagi kalian -wahai orang-orang yang beriman- suri teladan yang baik pada Ibrahim-'alaihissalām- dan orang-orang beriman yang bersamanya, tatkala mereka berkata kepada kaumnya yang kafir, “Sesungguhnya kami berlepas diri dari kalian dan dari berhala-berhala yang kalian sembah selain Allah. Kami mengingkari agama yang kalian anut dan telah tampak nyata permusuhan dan kebencian di antara kita, sampai kalian mau beriman kepada Allah semata dan tidak menyekutukan seorang pun dengan-Nya.\" Maka kalian harus berlepas diri dari kaum kalian yang kafir seperti mereka. Kecuali ucapan Ibrahim -'alaihissalām- kepada ayahnya, “Sungguh aku akan meminta ampunan untukmu kepada Allah,\" maka janganlah kalian mencontoh hal tersebut darinya, karena hal ini terjadi sebelum Ibrahim putus asa atas ayahnya, dan seorang mukmin tidak boleh memintakan ampunan untuk orang musyrik-, dan aku tidak mampu sedikitpun mencegah siksa Allah dari dirimu. Wahai Rabb kami, kepada-Mu-lah kami bersandar di dalam seluruh urusan kami, kepada-Mu-lah kami kembali dengan bertobat, dan kepada-Mu-lah tempat kembali pada Hari Kiamat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "4. Allah menganjurkan untuk meneladani Nabi Ibrahim dan orang-orang yang beriman kepadanya, ketika mereka berkata kepada kaum mereka dengan penuh keberanian: “Kami berlepas diri dari kalian dan dari berhala-berhala yang kalian sembah selain Allah itu. Kami kafir terhadap berhala-berhala yang kalian imani itu; dan telah tampak permusuhan antara kami dan kalian selama kalian tetap di atas kekafiran, hingga kalian mengakui keesaan Allah. Namun peneladanan kepada Nabi Ibrahim ini bukan termasuk permohonan ampun Nabi Ibrahim bagi ayahnya, Azar, ketika bersumpah dengan nama Allah: “Sungguh aku pasti akan memohon ampunan bagimu kepada Tuhanku; meski aku tidak dapat menlindungimu dari azab Allah sedikitpun -Janganlah kalian mengikutinya dalam hal ini, karena permohonan ini merupakan janjinya yang dia berikan kepada ayahnya-, Ya Tuhan kami, hanya kepada-Mu kami bertawakkal, hanya kepada-Mu kami bertaubat, dan hanya kepada-Mu kami kembali pada hari kiamat.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. قَدْ كَانَتْ لَكُمْ أُسْوَةٌ حَسَنَةٌ (Sesungguhnya telah ada suri tauladan yang baik bagimu) Yakni sifat yang baik yang dapat kalian ikuti. فِىٓ إِبْرٰهِيمَ وَالَّذِينَ مَعَهُۥٓ( pada Ibrahim dan orang-orang yang bersama dengan dia) Yakni tidakkah kamu meniru Ibrahim hai Hatib bin Abi Balta’ah dengan berlepas diri dari keluargamu sebagaimana Ibrahim berlepas diri dari ayah dan kaumnya. إِذْ قَالُوا۟ لِقَوْمِهِمْ إِنَّا بُرَءٰٓؤُا۟ مِنكُمْ(ketika mereka berkata kepada kaum mereka: “Sesungguhnya kami berlepas diri daripada kamu) Yakni kami bukan termasuk golongan kalian dan kalian bukan termasuk golongan kami karena kekafiran kalian kepada Allah. وَمِمَّا تَعْبُدُونَ مِن دُونِ اللهِ(dari apa yang kamu sembah selain Allah) Yakni berhala-berhala. كَفَرْنَا بِكُمْ(kami ingkari (kekafiran)mu) Dengan agama dan perbuatan kalian. وَبَدَا بَيْنَنَا وَبَيْنَكُمُ الْعَدٰوَةُ وَالْبَغْضَآءُ أَبَدًا(dan telah nyata antara kami dan kamu permusuhan dan kebencian buat selama-lamanya) Yakni inilah perlakuan kami terhadap kalian selama kalian tetap di atas kekafiran. حَتَّىٰ تُؤْمِنُوا۟ بِاللهِ وَحْدَهُۥٓ( sampai kamu beriman kepada Allah saja) Dan meninggalkan kemusyrikan kalian. Jika kalian telah melakukan hal tersebut maka permusuhan tadi akan menjadi persahabatan, dan kebencian akan menjadi rasa kasih sayang. إِلَّا قَوْلَ إِبْرٰهِيمَ لِأَبِيهِ لَأَسْتَغْفِرَنَّ لَكَ(Kecuali perkataan Ibrahim kepada bapaknya: “Sesungguhnya aku akan memohonkan ampunan bagi kamu) Yakni contoh yang baik bagi kalian ada pada setiap perkataan Ibrahim kecuali perkataannya kepada ayahnya, maka janganlah mengikuti hal itu dengan meminta ampun bagi orang-orang musyrik, sebab Ibrahim mengakatan itu karena telah menjanjikannya bagi ayahnya, namun setelah jelas baginya kekafiran ayahnya maka ia kemudian berlepas diri darinya. وَمَآ أَمْلِكُ لَكَ مِنَ اللهِ مِن شَىْءٍ ۖ( dan aku tiada dapat menolak sesuatupun dari kamu (siksaan) Allah”) Yakni dan aku tidak dapat menghalangi azab Allah darimu sedikitpun."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Kalian telah memiliki contoh mulia dari perilaku dan perkatan Ibrahim khalilullah, juga contoh dari orang-orang beriman di sekelilingnya. Ketika mereka berkata kepada kaum mereka orang-orang musyrik: Sesungguhnya kami tidak ikut campur atas kekafiran kalian dan penyembahan kalian terhadap berhala. Kami telah mengingkari keyakinan kalian kepada para berhala itu. Diantara kita sudah tampak jelas ada permusuhan dan kebencian, sampai kalian beriman kepad; a Allah. Namun ada pengecualian terhadap doa nabi Ibrahim kepada ayahnya Aku akan memintakan ampun kepada Allah untukmu, namun jangan engkau jadikan landasan untuk memintakan ampun untuk orang musyrik. Aku tidak bisa berbuat apa-apa untukmu atau bahkan menyelamatkanmu dari azab Allah. Ya Allah aku menyerahkan segala urusanku pada-Mu. Kami telah kembali dan taubat kepada-Mu. Engkaulah tempat kembali bagi kami"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh benar-benar ada suri teladan} teladan {yang baik bagi kalian pada (diri) Ibrahim dan orang-orang yang bersamanya ketika mereka berkata kepada kaumnya,“Sesungguhnya kami berlepas diri} berlepas diri {dari kalian dan dari apa yang kalian sembah selain Allah. Kami mengingkari kalian} Kami menyangkal dan mengingkari agama kalian {dan telah nyata} tampak {antara kami dan kalian permusuhan dan kebencian untuk selama-lamanya sampai kalian beriman hanya kepada Allah” Akan tetapi perkataan Ibrahim} Akan tetapi kalian tidak meniru Ibrahim ketika berkata {kepada ayahnya,“Sungguh aku akan memohonkan ampunan bagimu, tetapi aku sama sekali tidak dapat menolak (siksaan) dari Allah terhadapmu.” “Ya Tuhan kami, hanya kepada Engkau kami bertawakal, hanya kepada Engkaulah kami bertaubat} Kami kembali dengan bertaubat {dan hanya kepada Engkaulah kami kembali} kembali pada hari kiamat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4. Sungguh telah ada bagi kalian wahai orang-orang yang beriman “suri tauladan yang baik” maksudnya, panutan yang baik dan figur yang berguna bagi kalian wahai sekalian orang-orang Mukmin, “pada Ibrahim dan orang-orang yang bersama dengan dia,” dari kalangan orang-orang yang beriman karena kalian diperintahkan untuk mengikuti agama Ibrahim yang lurus, “ketika mereka berkata kepada kaum mereka,’Sesungguhnya kami berlepas diri (anti) dari kamu dan dari apa yang kamu sembah selain Allah’,” maksudnya, pada saat Nabi Ibrahim dan orang-orang yang beriman bersama beliau berlepas diri dari kaum mereka yang musyrik dan berlepas diri dari apa pun yang mereka sembah selain Allah, kemudian mereka benar-benar menegaskan sikap permusuhan mereka terhadap orang-orang kafir seraya berkata, “Kami ingkari (kekafiran) mu dan telah nyata antara kami dan kamu permusuhan dan kebencian,” maksudnya sikap benci di hati dan lenyapnya kasih sayang serta permusuhan dengan raga. Permusuhan dan kebencian tersebut tidak terbatas waktu, tapi berlaku “buat selama-lamanya,” selama kalian tetap berada dalam kekafiran, “sampai kamu beriman kepada Allah saja.” Maksudnya, jika kalian beriman pada Allah yang Esa, sikap permusuhan dan kebencian hilang dan berubah menjadi kasih sayang dan saling tolong menolong. Kalian wahai orang-orang yang beriman , memiliki teladan baik pada diri Nabi Ibrahim dan orang-orang yang beriman bersama beliau yang menunaikan keimanan dan tauhid serta menunaikan konsekuensi-konsekuensi iman dan tauhid dan dalam segala hal yang dengannya mereka beribadah kepada Allah semata. “Kecuali” dalam satu hal, yaitu “perkataan Ibrahim kepada bapaknya,” Azar, si musyrik lagi kafir dan penentang, ketika diajak untuk beriman dan bertauhid namun enggan, Ibrahim berkata padanya, “Sungguh aku akan memohonkan ampunan bagi kamu,” namun “aku tiada dapat menolak sesuatu pun dari (siksaan) Allah terhadapmu.” Akan tetapi aku berdoa pada Rabbku agar dengan doaku aku tidak menjadi orang yang sengsara. Dan Anda semua wahai orang-orang yang beriman, jangan mengikuti Ibrahim dalam hal ini yang berdoa untuk orang musyrik. Kalian tidak boleh mendoakan orang-orang musyrik dengan berkata, “Kami mengikuti agama Nabi Ibrahim dalam mendoakan udzur Ibrahim dalam FirmanNya, “Dan permintaan ampun dari Ibrahim (kepada Allah) untuk bapaknya tidak lain hanyalah karena suatu janji yang telah diikrarkannya kepada bapaknya itu. Maka, tatkala jelas bagi Ibrahim bahwa bapaknya itu adalah musuh Allah, maka Ibrahim berlepas diri dari padanya. Sesungguhnya Ibrahim adalah seorang yang sangat lembut hatinya lagi penyantun.” -At-taubah: 114- kalian juga memiliki teladan baik pada diri Nabi Ibrahim dan orang-orang yang beriman bersamanya ketika mereka berdoa pada Allah, bertawakal dan kembali padaNya, mereka juga mengakui kelemahan dan kurang menunaikan kewajiban dengan sempurna, mereka berkata “Hanya kepada Engkaulah kami bertawakal,” maksudnya, kami bergantung padaMu untuk mendapatkan apa pun yang berguna bagi kami dan menjauhi apa pun yang membahayakan kami, kami percaya padaMu wahai Rabb dalam hal itu, “dan hanya kepada Engkau-lah kami bertaubat,” maksudnya kami kembali pada ketaatan dan ridhaMu wahai Rabb kami dan segala sesuatu yang bisa mendekatkan kami padaMu. Kami menunaikan semua hal itu. Kami berusaha dengan sungguh-sungguh untuk menunaikan segala kebaikan. Kami mengetahui bahwa kepadaMu-lah kami kembali. Untuk itu kami mempersiapkan diri untuk mendatangiMu dan kami melakukan apa pun yang mendekatkan diri kami padaMu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mumtahanah ayat 4: 4-5. Dan ketahuilah wahai orang-orang yang beriman, bahwa wajib bagi kalian menjadikan bapak kalian Ibrahim Al Khalil sebaik-baik suri tauladan, dia dan yang bersamanya dari kalangan orang-orang yang beriman; Dimana sungguh mereka mengatakan kepada kaum mereka yang beribadah kepada berhala-berhala : Sungguh kami berlepas diri dari kalian dan apa yang kamu ibadahi selain Allah. Sungguh kami telah kafir kepada kalian dan tuhan-tuhan yang kalian sembah, dan sudah selayaknya bagi kami dan kalian adanya permusuhan dan kebencian selamanya, yaitu selama kalian di atas kekafiran kalian dan pengingkaran kalian, sampai kalian beriman kepada Allah saja, tanpa menyekutukan-Nya. Akan tetapi, kalian bukanlah termasuk orang-orang yang mengikuti Ibrahim dalam satu keadaan, dimana Ibrahim berkata kepada bapaknya yang menolong orang-orang muayrik : Sungguh aku akan memintakan ampunan kepada Rabbku atasmu; Dimana Ibrahim menjanjikan permohonan ampunan atas bapaknya dan berharap hidayah menyapanya. Kemudian Allah menjelaskan bahwa tidak berhak memohonkan ampun bagi bapaknya, karena bapaknya adalah penghuni nereka, dan permohonan ampun Ibrahim kepada bapaknya sebelum Ibrahim mendapat kejelasan bahwa bapaknya adalah musuh Allah; Maka ketika jelas bahwa bapaknya musuh Allah, Ibrahim berlepas diri darinya. Kemudian Allah memerintahkan hambanya untuk berdoa sebagaimana doa Ibrahim dan yang bersamanya : Rabb kami, janganlah Engkau jadikan musibah yang menimpa sebagaimana kekafiran mereka dengan kekafiran yang nyata bagi kami, yang kemudian Engkau mengadzab kami dan menimpakan musibah kepada agama kami, dan mereka (orang-orang musyrik) mengira bahwa mereka di atas kebenaran. Ampunilah kami wahai Tuhanku, atas dosa-dosa kami, dan atas keburukan-keburukan kami. Dan tolonglah kami agar senantiasa beribadah kepada-Mu. Wahai Rabb kami, sungguh Engkau yang maha kuat yang menaklukkan dan menguasai segala sesuatu, Engkaulah yang maha menghakimi, yang meletakkan sesuatu sesuai pada tempatnya. Maksud dari ayat ini : Allah melarang dengan keras untuk berkasih sayang kepada orang-orang kafir dan musyrik dan yang selainnnya yang menyelisihi jalan Allah, atau mencintai mereka (kafir dan musyrik). Sebagaimana yang dilarang kepada Ibrahim dan yang bersamanya dari orang-orang yang beriman; Karena Ibrahim berlepas diri dari kaumnya yang musyrik karena sebab apa yang dilakukan oleh bapaknya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Baik ucapannya maupun perbuatannya. Dari kalangan kaum mukmin. Selanjutnya mereka memperlihatkan permusuhan dengan jelas. Dengan badan. Dengan hati. Selama kamu berada di atas kekafiran. Yakni jika kamu beriman kepada Allah saja, maka hilanglah permusuhan dan kebencian itu dan berubah menjadi persaudaraan dan saling mencintai. Kalian wahai kaum mukmin dapat mengambil suri teladan yang baik dari Ibrahim dan orang-orang yang bersamanya dalam hal menegakkan keimanan dan tauhid, menegakkan bagian keimanan dan konsekwensinya. Yaitu Aazar ketika ia diajak Nabi Ibrahim ‘alaihis salam beriman dan mentauhidkan Allah, namun ia menolak, maka Nabi Ibrahim memintakan ampunan untuk ayahnya yang musyrik itu. Hal ini tidak boleh ditiru, karena Allah tidak membenarkan orang mukmin memintakan ampunan untuk orang-orang kafir (Lihat surah At Taubah ayat 113-114)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mumtahanah Ayat 4",
    "description": "Melalui ayat ini, Allah memberikan pelajaran berharga dari hubungan nabi ibrahim dengan ayahnya. Sungguh, telah ada suri teladan yang baik bagi kamu, orang-orang beriman di akhir zaman, pada ibrahim dan orang-orang beriman yang bersama dengannya, para pengikut, dan sahabat-sahabatnya, ketika mereka berkata kepada kaumnya yang menyembah berhala dan mempertuhankan matahari, bulan, dan bintang, 'sesungguhnya kami berlepas diri dari kalian dan dari apa yang kalian sembah selain Allah, tidak menjadi sahabat kalian, dan mendukung perbuatan kalian, beribadah kepada selain Allah; kami mengingkari kekafiran kalian lahir batin, pernyataan, pikiran, perasaan, dan keyakinan, dan menurut kami telah nyata antara kami dan kalian ada permusuhan dan kebencian untuk selama-lamanya, karena kalian menolak beriman kepada Allah dan berusaha membunuh kami, orang-orang beriman, hingga kalian beriman kepada Allah saja dengan tauhid yang benar, sebab dengan beriman kalian menjadi saudara. 'Allah tidak membenarkan orang beriman memintakan ampunan untuk orang-orang kafir (lihat: surah an-nis'/4: 48), kecuali perkataan ibrahim kepada ayahnya yang bernama azar, 'sungguh aku akan memohonkan ampunan kepada Allah bagimu, karena cinta dan kasih sayang anak kepada orang tua, namun aku sebagai hamba Allah sama sekali tidak dapat menolak siksaan Allah kepadamu, karena aku tidak memiliki daya dan kekuatan apa pun. ' ibrahim berkata dalam doanya yang tulus, 'ya tuhan kami, hanya kepada engkau kami bertawakal, karena engkau menyukai orang yang bertawakal dan hanya engkau saja yang pantas menjadi tempat kami bertawakal; dan hanya kepada engkau kami bertobat, karena engkau menyukai hamba-hamba yang tobat dari dosa mereka dan hanya kepada engkau kami kembali, karena hanya engkau yang memiliki akhirat dan engkau pangkal seluruh kehidupan. '5. 'ya tuhan kami, janganlah engkau jadikan kami, orang-orang beriman, menjadi sasaran fitnah bagi orang-orang kafir, karena keluguan kami. Dan ampunilah kami, seluruh dosa dan kekhilafan kami agar jiwa kami bersih, aib kami tertutup, dan hidup kami bahagia. Ya tuhan kami. Sesungguhnya engkaulah yang mahaperkasa, menyadarkan dan mengubah jalan hidup orang-orang berdosa; maha bijaksana, menghadapi perilaku hamba yang lalai."
  }
]