[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "5. Wahai Tuhan Kami, jangan menjadikan kami (sasaran) fitnah (cobaan dan keburukan) orang-orang kafir dengan mengazab kami dan menguasakan mereka atas kami, lalu mereka menimpakan keburukan pada kami terkait agama kami atau mereka mereka atas kami sehingga mereka menimpakan keburukan pada kami karenanya, dan mereka berkata ‘Bila orang-orang beriman itu di atas kebenaran, niscaya mereka tidak ditimpa azab’. Akibatnya mereka semakin kafir. Tutupilah dosa-dosa dengan memaafkannya bagi kami wahai Tuhan kami, sesungguhnya Engkau-lah Yang Mahaperkasa yang tidak dikalahkan, Yang Mahabijaksana dalam firman dan perbuatannya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Wahai Rabb kami, janganlah Engkau jadikan kami sasaran fitnah bagi orang-orang yang kafir dengan menjadikan mereka berkuasa atas kami, sehingga mereka berkata, \"Seandainya mereka berada dalam kebenaran, niscaya kami tidak akan menguasai mereka.\" Dan ampunilah dosa-dosa kami wahai Rabb kami, sesungguhnya Engkau Maha Perkasa, tidak bisa dikalahkan dan Maha Bijaksana dalam penciptaan-Mu, syariat-Mu dan takdir-Mu.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "5. Ya Tuhan kami, janganlah uji keteguhan kami di atas agama dengan menjadikan orang-orang kafir menguasai kami. Ya Tuhan kami, ampunilah dosa-dosa kami. Sungguh Engkau Maha Perkasa dalam memberi balasan dan Maha Bijaksana dalam mengatur."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. رَبَّنَا لَا تَجْعَلْنَا فِتْنَةً لِّلَّذِينَ كَفَرُوا۟ (“Ya Tuhan kami, janganlah Engkau jadikan kami (sasaran) fitnah bagi orang-orang kafir) Mujahid mengatakan: yakni janganlah Engkau menyiksa kami melalui tangan mereka dan jangan pula dengan azab dari-Mu, sehingga mereka akan mengatakan: “seandainya mereka di atas kebenaran niscaya mereka tidak akan tertimpa hal itu.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Ya Allah, jangan jadikan kami sebagai sasaran fitnah bagi agama kami atas apa yang dilakukan orang kafir yang memusuhi kami. Sehingga engkau menghukum kami atas apa yang tidak kami ketahui/lakukan. Ampunilah dosa kami Ya Allah. Sesungguhnya Engkau Maha Perkasa Maha Mengalahkan dan tidak akan terkalahkan. Yang Maha Sempurna Bijaksana dalam segala tindakan dan perbuatan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Ya Tuhan kami, janganlah Engkau menjadikan kami fitnah bagi orang-orang kafir} Janganlah kalian menjadikan kami sebagai sasaran ujian bagian orang-orang kafir dengan membuat mereka berkuasa atas kami, sehingga mereka berkata,”Jika orang-orang itu berada dalam kebenaran sesuai dengan apa yang mereka bawa ini” {Ampunilah kami, ya Tuhan kami. Sesungguhnya Engkau Yang Maha perkasa lagi Maha bijaksana”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5. “Ya Rabb kami, janganlah Engkau jadikan kami (sasaran) fitnah bagi orang-orang kafir.” Maksudnya, janganlah Engkau membuat mereka menguasai kami karena dosa-dosa kami sehingga mereka akan memfitnah kami dan menghalangi kami dari keimanan sehingga mereka sendiri juga terfitnah, karena jika mereka melihat diri mereka mendapatkan kemenangan, mereka akan mengira bahwa mereka berada di atas kebenaran dan kami berada di atas kebatilan sehingga mereka semakin kufur dan membangkang. “Dan ampunilah kami,” dosa-dosa dan kesalahan-kesalahan yang kami lakukan serta perintah-perintah yang tidak kami tunaikan secara sempurna. “Ya Rabb kami, sesungguhnya Engkau, Engkau-lah Yang Mahaperkasa.” Maha Memaksa segala sesuatu “lagi Mahabijaksana.” Yang meletakkan segala sesuatu di tempatnya. Dengan keperkasaan dan kebijaksanaanMu, tolonglah kami dari musuh-musuh kami, ampunilah dosa-dosa kami dan perbaikilah kekurangan-kekurangan kami."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mumtahanah ayat 5: 4-5. Dan ketahuilah wahai orang-orang yang beriman, bahwa wajib bagi kalian menjadikan bapak kalian Ibrahim Al Khalil sebaik-baik suri tauladan, dia dan yang bersamanya dari kalangan orang-orang yang beriman; Dimana sungguh mereka mengatakan kepada kaum mereka yang beribadah kepada berhala-berhala : Sungguh kami berlepas diri dari kalian dan apa yang kamu ibadahi selain Allah. Sungguh kami telah kafir kepada kalian dan tuhan-tuhan yang kalian sembah, dan sudah selayaknya bagi kami dan kalian adanya permusuhan dan kebencian selamanya, yaitu selama kalian di atas kekafiran kalian dan pengingkaran kalian, sampai kalian beriman kepada Allah saja, tanpa menyekutukan-Nya. Akan tetapi, kalian bukanlah termasuk orang-orang yang mengikuti Ibrahim dalam satu keadaan, dimana Ibrahim berkata kepada bapaknya yang menolong orang-orang muayrik : Sungguh aku akan memintakan ampunan kepada Rabbku atasmu; Dimana Ibrahim menjanjikan permohonan ampunan atas bapaknya dan berharap hidayah menyapanya. Kemudian Allah menjelaskan bahwa tidak berhak memohonkan ampun bagi bapaknya, karena bapaknya adalah penghuni nereka, dan permohonan ampun Ibrahim kepada bapaknya sebelum Ibrahim mendapat kejelasan bahwa bapaknya adalah musuh Allah; Maka ketika jelas bahwa bapaknya musuh Allah, Ibrahim berlepas diri darinya. Kemudian Allah memerintahkan hambanya untuk berdoa sebagaimana doa Ibrahim dan yang bersamanya : Rabb kami, janganlah Engkau jadikan musibah yang menimpa sebagaimana kekafiran mereka dengan kekafiran yang nyata bagi kami, yang kemudian Engkau mengadzab kami dan menimpakan musibah kepada agama kami, dan mereka (orang-orang musyrik) mengira bahwa mereka di atas kebenaran. Ampunilah kami wahai Tuhanku, atas dosa-dosa kami, dan atas keburukan-keburukan kami. Dan tolonglah kami agar senantiasa beribadah kepada-Mu. Wahai Rabb kami, sungguh Engkau yang maha kuat yang menaklukkan dan menguasai segala sesuatu, Engkaulah yang maha menghakimi, yang meletakkan sesuatu sesuai pada tempatnya. Maksud dari ayat ini : Allah melarang dengan keras untuk berkasih sayang kepada orang-orang kafir dan musyrik dan yang selainnnya yang menyelisihi jalan Allah, atau mencintai mereka (kafir dan musyrik). Sebagaimana yang dilarang kepada Ibrahim dan yang bersamanya dari orang-orang yang beriman; Karena Ibrahim berlepas diri dari kaumnya yang musyrik karena sebab apa yang dilakukan oleh bapaknya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni, jangan Engkau memenangkan mereka di atas kami, sehingga mereka menyangka bahwa mereka berada di atas kebenaran. Atau maksudnya, janganlah Engkau memberikan kekuasaan kepada mereka terhadap kami karena dosa-dosa kami sehingga mereka menindas kami dan menghalangi kami melakukan hal yang menjadi bagian dari keimanan, dan mereka juga tertipu oleh diri mereka, karena ketika mereka melihat bahwa mereka memperoleh kemenangan, maka mereka mengira bahwa mereka berada di atas kebenaran dan kami berada di atas kebatilan sehingga mereka bertambah kafir dan melampaui batas. Terhadap dosa dan maksiat yang kami kerjakan dan sikap kurangnya kami dalam menjalankan perintah-Mu. Yang menundukkan segala sesuatu. Yang meletakkan sesuatu pada tempatnya. Maka dengan keperkasaan-Mu dan kebijaksanaan-Mu ya Allah tolonglah kami dalam melawan musuh-musuh kami, ampunilah dosa-dosa kami dan perbaikilah aib kami."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mumtahanah Ayat 5",
    "description": "'ya tuhan kami, janganlah engkau jadikan kami, orang-orang beriman, menjadi sasaran fitnah bagi orang-orang kafir, karena keluguan kami. Dan ampunilah kami, seluruh dosa dan kekhilafan kami agar jiwa kami bersih, aib kami tertutup, dan hidup kami bahagia. Ya tuhan kami. Sesungguhnya engkaulah yang mahaperkasa, menyadarkan dan mengubah jalan hidup orang-orang berdosa; maha bijaksana, menghadapi perilaku hamba yang lalai. 6. Dari kisah nabi ibrahim itu, Allah menyatakan bahwa sungguh pada mereka itu, ibrahim dan umatnya yang beriman, terdapat suri teladan yang baik bagi kamu, berkenaan dengan sikap beragama, ketegasan, dan kekhusyukan dalam berdoa bagi orang-orang yang berharap kepada Allah, karena Allah tempat memohon dan bergantung seluruh makhluk, dan berharap mendapat keselamatan pada hari akhir, karena kebahagiaan sejati bukan di dunia, tetapi di akhirat ketika selamat dari azab Allah. Dan barang siapa berpaling dari Allah dengan menjauh dan menyimpang dari ajaran-Nya, maka sesungguhnya Allah, dialah yang mahakaya, tidak bertambah keagungan-Nya dengan ketaatan hamba dan tidak berkurang keagungan-Nya dengan kekufuran seluruh makhluk, maha terpuji, sifat dan perbuatan-Nya."
  }
]