[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "6. sungguh telah ada bagi kalian (wahai orang-orang yang beriman) pada Ibrahim dan orang-orang yang bersamanya teladan yang baik bagi siapa yang berharap kebaikan dari Allah di dunia dan akhirat. Barangsiapa berpaling dari apa yang Allah perintahkan, yaitu mengambil teladan dari para NabiNYa dan memberikan loyalitas kepada musuh-musuhNya, maka sesungguhnya Allah Mahakaya, tidak membutuhkan hamba-hambaNya, lagi Maha terpuji pada Dzat dan Sifat-sifatNya, serta terpuji dalam segala keadaan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Suri teladan yang baik ini hanyalah berguna bagi orang yang mengharapkan kebaikan dari Allah di dunia dan di Akhirat. Barangsiapa berpaling dari suri teladan yang baik ini, sesungguhnya Allah tidak butuh kepada hamba-hamba-Nya, tidak butuh kepada ketaatan mereka, Dia Maha Terpuji dalam segala hal."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "6. Hai orang-orang beriman, Sungguh Nabi Ibrahim dan orang-orang beriman yang bersamanya merupakan teladan mulia dalam perkara berlepas diri dari orang-orang kafir, yaitu teladan bagi orang yang mengharap pahala dari Allah dan takut dari azab-Nya di akhirat. Dan barangsiapa yang enggan beriman dan mentaati Allah, maka Allah Maha Kaya, tidak membutuhkan makhluk-Nya; dan Maha Terpuji Dzat dan sifat-Nya, dan Terpuji setiap saat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. لَقَدْ كَانَ لَكُمْ فِيهِمْ أُسْوَةٌ حَسَنَةٌ (Sesungguhnya pada mereka itu (Ibrahim dan umatnya) ada teladan yang baik bagimu) Yakni pada diri Ibrahim dan kaumnya terdapat teladan yang baik bagi kalian. لِّمَن كَانَ يَرْجُوا۟ اللهَ وَالْيَوْمَ الْاٰخِرَ ۚ((yaitu) bagi orang-orang yang mengharap (pahala) Allah dan Hari Kemudian) Yakni peneladanan itu hanya akan dilakukan oleh orang yang ingin mendapatkan kebaikan dari Allah di dunia dan di akhirat. وَمَن يَتَوَلَّ(Dan barangsiapa yang berpaling) Yakni yang enggan melakukan itu. فَإِنَّ اللهَ هُوَ الْغَنِىُّ(maka sesungguhnya Allah Dialah yang Maha kaya) Tidak membutuhkan makhluk-Nya. الْحَمِيدُ (lagi Maha Terpuji) Oleh kekasih-kekasih-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Telah ada contoh/teladan baik untuk kalian wahai orang mukmin pada diri Ibrahim dan orang-orang mukmin yang menyertainya. Teladan untuk kalian yang mengharap pahala Allah dan keutamaan di akhirat, juga keselamatan dari neraka. Barang siapa mengingkari itu atau di luar kriteria itu, maka sungguh Allah Maha Kaya atas makhluk-Nya, Yang memiliki segala pujian pada setiap keputusan-Nya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh pada mereka itu benar-benar terdapat suri teladan yang baik bagi kalian, bagi orang yang mengharap kepada Allah dan hari kemudian. Siapa saja yang berpaling} tidak mau meneladani nabi dan berteman dengan musuh-musuh Allah {sesungguhnya Allah, Dialah Yang Maha kaya lagi Maha Terpuji} Maha terpuji Dzat, Sifat dan TindakanNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6. Selanjutnya Allah mengulang kembali dorongan agar orang-orang yang beriman mengikuti teladan Nabi Ibrahim dan orang-orang yang bersama beliau seraya berfirman, “Sungguh pada mereka itu (Ibrahim dan umatnya) ada teladan yang baik bagimu.” Teladan ini tidak mudah bagi setiap orang namun akan terasa mudah bagi orang “yang mengharap (pahala) Allah dan (keselamatan pada) Hari kemudian.” Karena sesungguhnya iman dan mengharapkan pahala bisa memudahkan semua yang sulit bagi hamba, memperkecil semua yang banyak dan mengharuskannya untuk meneladani hamba-hamba Allah yang shalih dan para nabi serta rasul. Karena ia menilai dirinya amat memerlukan hal itu. “Dan barangsiapa yang berpaling” dari ketaatan terhadap Allah dan meneladani para rasulNya, itu hanya akan membahayakan dirinya sendiri, sama sekali tidak akan membahayakan Allah; “sesungguhnya Allah, Dia-lah Yang Mahakaya,” bagiNya kekayaan yang sempurna dan mutlak dari berbagai segi, tidak memerlukan satu pun dari makhlukNya sama sekali, “lagi Maha Terpuji,” dalam DzatNya, nama-namaNya, sifat-sifatNya dan perbuatanNya. Sesungguhnya Allah terpuji di atas semua itu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mumtahanah ayat 6: Allah mengulangi anjuran untuk mengikuti Ibrahim, dan barangsiapa yang ingin melakukannya, maka silahkan melakukan. Allah berkata : Sungguh bagi kalian ada Ibrahim dan orang-orang yang beriman seperti dia, sebagai suri tauladan dan contoh yang baik pada sikapnya terhadap orang-orang musyrik dan berlepas dirinya dari mereka dan apa yang mereka sembah; Maka ikutilah mereka, dan ini adalah petunjuk yang mudah bagi siapa yang tujuannya adalah keridhaan Allah dan keselamatan pada hari kiamat. Dan barangsipa yang menolak dari ketaatan kepada Allah dan mengikuti Rasul-Nya; Maka Allah sungguh Maha Kaya atas seluruh makhluk-Nya, Dialah yang memiliki kekayaan yang sempurna yang mutlak atas segala segi. Yang terpuji bagi nama-nama dan sifat-sifat-Nya, serta perbuatan Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala mengulangi lagi dorongan-Nya untuk mengikuti Ibrahim dan orang-orang yang bersamanya dari kalangan kaum mukmin. Orang inilah yang mudah beruswah (mengambil teladan) kepada mereka (Nabi Ibrahim ‘alaihis salam dan orang-orang yang bersamanya). Karena beriman kepada Allah dan mengharapkan pahala-Nya serta takut terhadap siksaan pada hari Kiamat akan membuat seorang hamba mudah melakukan sesuatu yang susah, membuat sedikit sesuatu yang banyak serta membuatnya banyak mengikuti hamba-hamba Allah yang saleh, yaitu para nabi dan para rasul. Dari taat kepada Allah dan beruswah kepada para rasul Allah, maka ia tidaklah memadharratkan (merugikan) siapa-siapa selain kepada dirinya sendiri, dan Allah Subhaanahu wa Ta'aala tidaklah terkena madharrat sedikit pun. Dia Mahakaya dari segala sisi sehingga Dia tidak butuh kepada seorang pun dari makhluk-Nya dari segala sisi. Baik pada Dzat-Nya, nama-Nya, sifat-Nya dan perbuatan-Nya. Dia terpuji dalam semua itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mumtahanah Ayat 6",
    "description": "Dari kisah nabi ibrahim itu, Allah menyatakan bahwa sungguh pada mereka itu, ibrahim dan umatnya yang beriman, terdapat suri teladan yang baik bagi kamu, berkenaan dengan sikap beragama, ketegasan, dan kekhusyukan dalam berdoa bagi orang-orang yang berharap kepada Allah, karena Allah tempat memohon dan bergantung seluruh makhluk, dan berharap mendapat keselamatan pada hari akhir, karena kebahagiaan sejati bukan di dunia, tetapi di akhirat ketika selamat dari azab Allah. Dan barang siapa berpaling dari Allah dengan menjauh dan menyimpang dari ajaran-Nya, maka sesungguhnya Allah, dialah yang mahakaya, tidak bertambah keagungan-Nya dengan ketaatan hamba dan tidak berkurang keagungan-Nya dengan kekufuran seluruh makhluk, maha terpuji, sifat dan perbuatan-Nya. 7. Ayat ini menjelaskan bahwa orang-orang beriman menaruh harapan kepada Allah untuk mengubah kebencian dengan kasih sayang. Mudah-Mudahan Allah menimbulkan kasih sayang yang tulus dan bersemi di antara kamu, orang-orang beriman dengan orang-orang yang pernah kamu musuhi di antara mereka, orang-orang kafir. Allah mahakuasa mengubah benci menjadi cinta dan permusuhan menjadi persahabatan. Dan Allah maha pengampun kepada yang tobat dari dosa-dosanya, maha penyayang kepada hamba yang taat kepada-Nya."
  }
]