[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "7. Semoga Allah menjadikan di antara kalian (wahai orang-orang beriman) dengan orang-orang yang kalian musuhi dari para kerabat kalian yang musyrik kecintaan sesudah kebencian, kasih sayang sesudah permusuhan dengan membuat dada mereka lapang menerima Islam. Allah Maha Pengampun bagi hamba-hambaNya, juga Maha Penyayang kepada mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Semoga Allah menjadikan rasa cinta di antara kalian -wahai orang-orang yang beriman- dan orang-orang kafir yang kalian musuhi, di mana Allah memberi petunjuk kepada mereka untuk masuk Islam, sehingga mereka menjadi saudara-saudara kalian seagama. Dan Allah Mahakuasa, mampu membalik hati mereka menjadi beriman. Sungguh Allah Maha Pengampun bagi orang yang bertobat dari hamba-hamba-Nya serta Maha Penyayang terhadap mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "7. Mudah-mudahan Allah menjadikan rasa cinta dan kasih sayang antara kalian dengan para kerabat kalian yang masih musyrik yang kalian musuh itu, yaitu dengan menjadikan mereka masuk Islam. Allah Maha Kuasa atas segala-Nya, tidak ada yang sulit bagi-Nya; dan Dia Maha Pengampun dan Pengasih bagi hamba-hamba-Nya yang bertaubat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. عَسَى اللهُ أَن يَجْعَلَ بَيْنَكُمْ وَبَيْنَ الَّذِينَ عَادَيْتُم مِّنْهُم مَّوَدَّةً ۚ (Mudah-mudahan Allah menimbulkan kasih sayang antaramu dengan orang-orang yang kamu musuhi di antara mereka) Yakni antara kalian dengan orang-orang musyrik Makkah, yaitu apabila mereka masuk Islam dan menjadi pemeluk agama kalian. Dan sebagian mereka masuk Islam setelah penakhlukan kota Makkah dan mereka sangat baik dalam keislamannya, sehingga antara mereka dan orang-orang yang lebih dahulu masuk Islam tumbuh rasa kasih sayang, dan mereka juga ikut berjihad dan menjalankan perbuatan-perbuatan yang dapat mendekatkan kepada Allah. Rasulullah menikahi Ummu Habibah, putri Abu Sufyan, namun tidak terjalin kasih sayang antara Ummu habibah dengan Abu Sufyan kecuali setelah ia masuk Islam saat penakhlukan kota Makkah dan setelah ia tidak lagi memerangi Rasulullah. Ibnu Mar’dawaih meriwayatkan dari Abu Hurairah, ia berkata: “orang pertama yang memerangi orang-orang yang murtad untuk menegakkan agama Allah adalah Abu Sufyan bin Harb, dan untuknya-lah ayat ini diturunkan: عَسَى اللهُ أَن يَجْعَلَ بَيْنَكُمْ وَبَيْنَ الَّذِينَ عَادَيْتُم مِّنْهُم مَّوَدَّةً وَاللهُ قَدِيرٌ ۚ( Dan Allah adalah Maha Kuasa) Yakni Maha Kuasa yang mampu menerima hati orang-orang yang mendurhakai-Nya untuk memasukkan mereka ke dalam ampunan dan rahmat-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Mudah-mudahan Allah menumbuhkan cinta diantara kalian wahai orang mukmin dengan orang musyrik. Barangkali dengan begitu mereka hendak masuk Islam dan menjadi saudara seiman kalian.Allah maha kuasa untuk membalikkan hati dan menancapkan hidayah menuju keimanan. Allah Maha Luas dalam memberi ampunan bagi siapa saja yang bertaubat, dan pengasih kepada orang-orang yang beriman. Ketika turun ayat sebelumnya, orang-orang mukmin mengajak para kerabatnya uyang musyrik kepada Allah. Maka Allah menurunkan ayat Mudah-mudahan Allah….. kemudian mereka melaksanakan perintah itu dan berimanlah sebagian besar kerabat mereka yang musyrik. Sehingga mereka menjadi sahabat atau kekasih mereka, dan mereka hidup berdampingan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mudah-mudahan Allah menimbulkan kasih sayang} kasih sayang {di antara kalian dengan orang-orang yang pernah kalian musuhi di antara mereka. Allah Maha kuasa dan Allah Maha Pengampun lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7. Kemudian Allah mengabarkan bahwa permusuhan yang diperintahkan oleh Allah kepada orang-orang musyrik serta diperintahkan agar dilakukan ini adalah selama mereka berada di dalam kesyirikan dan kekufuran. Jika mereka beriman, hukum pun berubah sesuai penyebabnya; maksudnya, rasa cinta dengan didasari keimanan kembali. Karena itu, janganlah kalian wahai orang-orang yang beriman berputus asa untuk menyeru mereka kembali pada keimanan, “mudah-mudahan Allah menimbulkan kasih sayang antaramu dengan orang-orang yang kamu musuhi di antara mereka,” yang disebabkan oleh kembalinya mereka pada keimanan. “dan Allah Mahakuasa” atas segala sesuatu, yang di antaranya adalah memberikan petunjuk pada hati dan merubah-rubahnya dari satu kondisi ke kondisi lain. “Dan Allah Maha Pengampun lagi Maha Penyayang.” Tidak ada dosa yang karena besarnya membuatNya tidak memberi ampunan dan tidak ada aib yang karena beratnya membuatNya tidak menutupinya. “ Katakanlah: \"Hai hamba-hamba-Ku yang malampaui batas terhadap diri mereka sendiri, janganlah kamu berputus asa dari rahmat Allah. Sesungguhnya Allah mengampuni dosa-dosa semuanya. Sesungguhnya Dialah Yang Maha Pengampun lagi Maha Penyayang.” -Az-Zumar: 53- Dalam ayat ini terdapat kabar gembira islamnya sebagian orang-orang musyrik yang pada saat itu memusuhi orang-orang Mukmin. Hal itu terjadi. Segala puji dan karunia hanya bagi Allah semata."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mumtahanah ayat 7: Setelah Allah memperingatkan hamba-hamba-Nya yang beriman dari kepercayaannya, kasih sayangnya serta kecintaannya kepada orang-orang musyrik, Allah kemudian berkata : Semoga Allah menjadikan antara kalian dan yang memusuhi mereka dari kerabat-kerabat kalian yang saling mencintai, jika Allah berikan petunjuk dan Allah masukkan mereka ke dalam islam, Allah menghilangkan peringatan-Nya kepada kalian, karena sebab mereka telah menjadi orang-orang muslim. Kemudian Allah mengabarkan bahwa Dia Maha Kuasa atas apa yang berubah dalam jiwa dan menjadikan hati terbuka merima islam. Dan Allah Maha Mengampuni bagi hamba-hamban-Nya yang beriman, dan mengasihi mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala memberitahukan bahwa permusuhan ini, yakni yang Allah perintahkan dilakukan terhadap orang-orang musyrik adalah selama mereka tetap di atas kekafiran dan kesyirkkannya, dan bahwa jika mereka berubah menjadi beriman, maka hukum sebagaimana berjalan bersama ‘illatnya (sebabnya), berubahlah mereka menjadi dicintai dan dikasihi. Yaitu dengan memberi mereka hidayah untuk beriman sehingga mereka menjadi orang-orang yang kamu kasihi. Untuk berbuat demikian (menjadikan mereka beriman) dan merubahnya dari satu keadaan kepada keadaan yang lain, dan ternyata Dia melakukannya setelah terjadi Fat-hu Makkah (penaklukkan Mekah). Tidak berat bagi-Nya mengampuni dosa dan tidak susah bagi-Nya menutupi aib, Dia berfirman, “Katakanlah, \"Wahai hamba-hamba-Ku yang malampaui batas terhadap diri mereka sendiri, janganlah kamu berputus asa dari rahmat Allah. Sesungguhnya Allah mengampuni dosa-dosa semuanya. Sesungguhnya Dia-lah yang Maha Pengampun lagi Maha Penyayang.” Ya Allah, sesungguhnya aku memohon kebaikan dan keselamatan di dunia dan akhirat. Ya Allah, sesungguhnya aku memohon kebaikan dan keselamatan dalam agama, dunia, keluarga dan hartaku. Ya Allah, tutupilah auratku (aib dan sesuatu yang tidak layak dilihat orang) dan tenteramkanlah aku dari rasa takut. Ya Allah, peliharalah aku dari depan, belakang, kanan, kiri dan atasku. Aku berlindung dengan kebesaran-Mu, agar aku tidak disambar dari bawahku Dalam ayat ini terdapat isyarat dan kabar gembira bahwa sebagian kaum musyrikin yang sebelumnya memusuhi kaum muslimin akan masuk ke dalam Islam, dan ternyata demikian wal hamdulillahi Rabbil ‘aalamiin."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mumtahanah Ayat 7",
    "description": "Ayat ini menjelaskan bahwa orang-orang beriman menaruh harapan kepada Allah untuk mengubah kebencian dengan kasih sayang. Mudah-Mudahan Allah menimbulkan kasih sayang yang tulus dan bersemi di antara kamu, orang-orang beriman dengan orang-orang yang pernah kamu musuhi di antara mereka, orang-orang kafir. Allah mahakuasa mengubah benci menjadi cinta dan permusuhan menjadi persahabatan. Dan Allah maha pengampun kepada yang tobat dari dosa-dosanya, maha penyayang kepada hamba yang taat kepada-Nya. 8. Allah tidak melarang kamu berbuat baik dan berlaku adil, karena kebaikan dan keadilan itu bersifat universal, kepada orang-orang kafir yang tidak memerangi kamu karena agama dengan menekankan kebebasan dan toleransi beragama; dan tidak mengusir kamu dari kampung halaman kamu, karena kamu beriman kepada Allah. Sesungguhnya Allah mencintai orang-orang yang berlaku adil baik terhadap dirinya sendiri maupun terhadap orang lain."
  }
]