[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "8. Allah tidak melarang kalian (wahai orang-orang beriman) untuk menghormati dan berlaku adil dengan berbuat baik dan melakukan kebajikan kepada orang-orang kafir yang tidak memerangi kalian disebabkan oleh agama dan mereka tidak mengusir kalian dari negeri kalian. Sesungguhnya Allah mencintai orang-orang yang adil dalam perkataan dan perbuatan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Allah tidak melarang kalian dari orang-orang yang tidak memerangi kalian karena keislaman kalian dan tidak mengusir kalian dari rumah-rumah kalian untuk berbuat baik kepada mereka dan adil di antara mereka dengan cara memberikan kepada mereka apa yang menjadi hak mereka atas kalian. Sebagaimana yang dilakukan Asma` binti Abu Bakar aṣ-Ṣiddiq terhadap ibunya ketika ia mengunjunginya setelah minta izin dari Nabi -ṣallallāhu 'alaihi wa sallam-, lalu beliau memerintahkannya untuk menyambung silaturrahim dengannya. Sesungguhnya Allah mencintai orang-orang yang adil, yang berbuat adil terhadap diri mereka sendiri, keluarga mereka dan orang-orang yang berada dibawah tanggung jawabnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "8-9. Hai orang-orang beriman, Allah tidak melarang kalian berbuat bagi dan adil kepada orang-orang yang tidak memerangi kalian karena keimanan kalian dan tidak mengeluarkan kalian dari negeri kalian. Allah Maha Mencintai orang-orang yang adil dalam setiap perkara. Yang Allah larang dari kalian adalah mencintai dan menjadikan penolong orang-orang yang memerangi kalian karena keimanan kalian dan mengeluarkan kalian dari negeri kalian serta membantu orang-orang kafir untuk mengusir kalian. Dan barangsiapa ang menjadikan mereka penolong untuk melawan orang-orang beriman maka orang-orang yang jauh dari kebenaran itu adalah orang-orang yang menzalimi diri sendiri dan orang lain. Diriwayatkan dari Asma binti Abu Bakar, ia berkata: Ibuku mendatangiku saat ia masih musyrik pada zaman Rasulullah. Maka aku bertanya kepada Rasulullah mengenai perkara ini: “Ibuku datang kepadaku dengan penuh perdamaian, apakah aku harus menjaga hubungan dengan ibuku?” Maka beliau menjawab: “Ya, jagalah hubungan dengan ibumu.” (Shahih al-Bukhari 5/275, kitab pemberian, bab hadiah untuk orang-orang musyrik, dan firman Allah (لَّا يَنْهَىٰكُمُ ٱللَّهُ عَنِ ٱلَّذِينَ لَمْ يُقَٰتِلُوكُمْ) no. 2620. Dan Shahih Muslim 2/696, kitab zakat, bab keutamaan nafkah dan sedekah kepada kerabat, pasangan, anak, dan orangtua, meskipun mereka masih musyrik, no. 1003)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. لَّا يَنْهَىٰكُمُ اللهُ عَنِ الَّذِينَ لَمْ يُقٰتِلُوكُمْ فِى الدِّينِ وَلَمْ يُخْرِجُوكُم مِّن دِيٰرِكُمْ (Allah tidak melarang kamu terhadap orang-orang yang tiada memerangimu karena agama dan tidak (pula) mengusir kamu dari negerimu) Yakni Allah tidak melarang kalian dari mereka. أَن تَبَرُّوهُمْ(untuk berbuat baik) Yakni melakukan kebaikan kepada mereka, seperti melakukan silaturrahim, menghormati tetangga, dan menjamu tamu. وَتُقْسِطُوٓا۟ إِلَيْهِمْ ۚ( dan berlaku adil) Yakni berbuat adil antara kalian dan mereka dengan menunaikan hak mereka, seperti menepati janji, dan menyampaikan amanat, memenuhi pembayaran dengan sempurna jika memberi dari mereka. إِنَّ اللهَ يُحِبُّ الْمُقْسِطِينَ(Sesungguhnya Allah menyukai orang-orang yang berlaku adil) Makna ayat ini adalah Allah tidak melarang kalian dari orang-orang yang kafir yang memiliki perjanjian dengan orang-orang beriman untuk tidak saling berperang dan tidak membantu orang kafir lain dalam memerangi mereka. Dan Allah tidak melarang untuk berinteraksi dengan mereka secara adil."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8. Allah tidak akan melarang kalian untuk berbuat baik kepada orang-orang yang tidak memerangi agama kalian dan tidak mengusir kalian dari kampong halaman kalian. Kalian diperbolehkan bersilaturrahim dengan mereka atau saling mengasihi sesama tetangga. Allah juga tidak melarang kalian memperlakukan mereka dengan adil. Allah mencintai orang-orang yang berlaku adil dan membersihkan jiwa mereka. Maksudnya adalah Allah tidak melarang untuk mencintai mereka dan memperlakukan mereka dengan adil."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah tidak melarang kalian berbuat baik} berbuat baik {dan berlaku adil} berlaku adil {terhadap orang-orang yang tidak memerangi kalian dalam urusan agama dan tidak mengusir kalian dari kampung halaman kalian. Sesungguhnya Allah mencintai orang-orang yang berlaku adil} berlaku adil"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8. Ketika turun ayat-ayat mulia ini yang mendorong orang-orang Mukmin untuk memusuhi orang-orang kafir, terjadilah berbagai peperangan di antara orang Mukmin dan orang kafir dan orang-orang Mukmin melakukannya dengan sempurna. Mereka merasa berdosa karena telah menyambung kekerabatan dengan keluarganya yang musyrik, mereka mengira bahwa itu termasuk dalam larangan Allah. Allah kemudian memberitahukan bahwa hal itu tidak termasuk dalam larangan seraya berfirman, “Allah tiada melarang kamu untuk berbuat baik dan berlaku adil terhadap orang-orang yang tiada memerangimu karena agama dan tidak (pula) mengusir kamu dari negerimu. Sesungguhnya Allah menyukai orang-orang yang berlaku adil.” Maksudnya, Allah tidak melarang kalian untuk berbuat baik, menyambung tali kekerabatan, memberi balasan baik dan berbuat adil terhadap orang-orang musyrik dari kalangan kerabat dan yang lainnya jika mereka tidak memerangi kalian karena agama dan tidak mengusir kalian dari kampung halaman dan negeri kalian. Kalian tidak berdosa jika menyambung tali kekerabatan dengan mereka, sebab menyambung tali kekerabatan dengan orang-orang musyrik dalam kondisi seperti ini tidak terlarang sebagaimana Firman allah tentang orang tua kafir yang memiliki anak Muslim, “Dan jika keduanya memaksamu untuk mempersekutukan dengan Aku sesuatu yang tidak ada pengetahuanmu tentang itu, maka janganlah kamu mengikuti keduanya, dan pergaulilah keduanya di dunia dengan baik, dan ikutilah jalan orang yang kembali kepada-Ku, kemudian hanya kepada-Kulah kembalimu, maka Kuberitakan kepadamu apa yang telah kamu kerjakan.” -Luqman: 15-"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mumtahanah ayat 8: Kemudian Allah kecualikan orang-orang islam di antara mereka dari kerabat-kerabat mereka yang tidak mencela orang-orang yang beriman, dan tidak juga memerangi orang-orang beriman, atau siapa pun yang mereka berinteraksi dengan kejujuran, dan mereka yang tidak menampakkan permusuhan kepada orang-orang islam; Allah mengabarkan bahwa tidak melarang kalian wahai orang-orang yang beriman, dari mereka (orang-orang kafir) yang tidak memerangi kalian dengan sebab agama kalian, dan tidak mengeluarkan kalian dari negeri kalian; Maka mereka ini tidak mengapa bagi kalian berbuat adil kepada mereka, dan berbuat baik, kemudian berhubungan dengan mereka karena mereka adalah kerabat kalian; Sesungguhnya Allah mewajibkan atas kalian berbuat adil kepada mereka dalam perkataan, perbuatan dan hukum. Dan Allah melarang kalian dari mereka yang memerangi dan memusuhi kalian, karena sebab agama kalian, yang mereka mengeluarkan kalian dan dari negeri kalian; Dan Allah melarang keras dari mencintai dan menolong mereka dengan perkataan dan perbuatan, dan barangsiapa yang berkasih sayang dengan menolong mereka dan mencintai mereka serta mendukung; Maka mereka adalah orang-orang yang dzalim kepada diri-diri mereka karena membolehkan menentang aturan Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ketika ayat-ayat yang mulia ini turun, dimana ayat-ayat tersebut mendorong untuk memusihi orang-orang kafir, maka kaum mumin mendapat pengaruh besar sekali sehingga mereka mau melaksanakannya dengan sebenar-benarnya dan mereka merasa berdosa ketika menyambung tali silaturrahim kepada kerabat mereka yang masih musyrik dan mereka mengira bahwa yang demikian termasuk ke dalam hal yang dilarang Allah, maka Allah Subhaanahu wa Ta'aala memberitahukan bahwa hal itu (berbuat baik dan bersikap adil terhadap orang-orang kafir yang tidak memerangi) tidak termasuk ke dalam hal yang dilarang Allah Subhaanahu wa Ta'aala, Dia berfirman, “Allah tidak melarang kamu berbuat baik dan berlaku adil terhadap orang-orang yang tidak memerangimu dalam urusan agama dan tidak mengusir kamu…dst.” Maksudnya, Allah Subhaanahu wa Ta'aala tidak melarang kamu berbuat baik, bersilaturrahim, membalas kebaikan dan berbuat adil kepada kaum musyrikin baik kerabatmu maupun selain mereka yang tidak memerangi kamu dalam urusan agama dan tidak mengusir kamu dari kampung halamanmu, maka tidak mengapa bagimu menyambung tali silaturrahim dengan mereka, karena menyambung tali silaturrahim dalam keadaan ini tidak ada mafsadatnya sebagaimana firman Allah Ta’ala tentang kedua orang tua yang masih musyrik, “Dan jika keduanya memaksamu untuk mempersekutukan dengan Aku sesuatu yang tidak ada pengetahuanmu tentang itu, maka janganlah kamu mengikuti keduanya, dan pergaulilah keduanya di dunia dengan baik, dan ikutilah jalan orang yang kembali kepada-Ku, kemudian hanya kepada-Kulah kembalimu, maka Kuberitakan kepadamu apa yang telah kamu kerjakan.” (Terj. Luqman: 15)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mumtahanah Ayat 8",
    "description": "Allah tidak melarang kamu berbuat baik dan berlaku adil, karena kebaikan dan keadilan itu bersifat universal, kepada orang-orang kafir yang tidak memerangi kamu karena agama dengan menekankan kebebasan dan toleransi beragama; dan tidak mengusir kamu dari kampung halaman kamu, karena kamu beriman kepada Allah. Sesungguhnya Allah mencintai orang-orang yang berlaku adil baik terhadap dirinya sendiri maupun terhadap orang lain. 9. 'sesungguhnya Allah hanya melarang kamu, orang-orang beriman, menjadikan mereka, orang-orang kafir yang tidak bersedia hidup berdampingan dengan kamu secara damai, yaitu mereka yang memerangi kamu karena agama, tidak ada kebebasan dan toleransi beragama; mengusir kamu dari tempat tinggal kamu, karena pembersihan ras, suku, dan agama, serta penguasaan teritorial, dan membantu pihak lain untuk mengusir kamu karena kerja sama yang sistemik dan terencana; sebagai sahabat dekat kamu lahir batin. Barang siapa yang menjadikan mereka sebagai kawan, karena kepentingan ekonomi, politik, dan keamanan; maka mereka itulah orang zalim terhadap perjuangan islam dan kaum muslim."
  }
]