[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "9. Sesungguhnya Allah hanya melarang kalian memberikan loyalitas, dukungan dan kaish sayang kepada orang-orang kafir yang memerangi kalian disebabkan oleh agama, mengusir kalian dari negeri kalian, dan membantu orang-orang kafir untuk mengusir kalian, dan barangsiapa mengangkat mereka sebagai penolong-penolong dan rekan-rekan dekat atas orang-orang beriman, maka mereka adalah orang-orang yang zholim terhadap diri mereka sendiri, yang keluar dari batasan-batasan Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Sesungguhnya Allah hanyalah melarang kalian dari orang-orang yang memerangi kalian karena keimanan kalian dan mengusir kalian dari rumah-rumah kalian dan membantu untuk mengusir kalian, Allah melarang kalian untuk menjadikan mereka sebagai teman setia. Barangsiapa di antara kalian menjadikan mereka teman setia maka mereka adalah orang-orang yang menganiaya diri mereka sendiri dengan meletakkan dirinya pada sumber-sumber kehancuran disebabkan karena membangkang kepada perintah Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. إِنَّمَا يَنْهَىٰكُمُ اللهُ عَنِ الَّذِينَ قٰتَلُوكُمْ فِى الدِّينِ وَأَخْرَجُوكُم مِّن دِيٰرِكُمْ (Sesungguhnya Allah hanya melarang kamu terhadap orang-orang yang memerangimu karena agama dan mengusir kamu dari negerimu) Mereka adalah pemimpin-pemimpin kafir Quraisy dan semisalnya yang memerangi kaum muslimin. وَظٰهَرُوا۟ عَلَىٰٓ إِخْرَاجِكُمْ(dan membantu (orang lain) untuk mengusirmu) Yakni membantu orang-orang yang memerangi dan mengusir kalian, yaitu para penduduk Makkah seluruhnya dan orang-orang yang memiliki perjanjian dengan mereka. أَن تَوَلَّوْهُمْ ۚ(untuk kamu jadikan sebagai kawanmu) Yakni untuk kalian jadikan sebagai sekutu dan untuk kalian tolong. وَمَن يَتَوَلَّهُمْ فَأُو۟لٰٓئِكَ هُمُ الظّٰلِمُونَ(Dan barangsiapa menjadikan mereka sebagai kawan, maka mereka itulah orang-orang yang zalim) Sebab mereka bersekutu dengan orang yang layak untuk diperangi karena ia adalah musuh Allah, Rasulullah, dan kitab-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9. Allah hanya melarang kalian wahai orang mukmin untuk berbuat baik kepada orang-orang yang memerangi agama kalian dan mereka yang mengusir kalian dari kampong halaman. Mereka adalah para pembesar kafir Quraiys. Kalian dilarang untuk memberi pertolongan kepada mereka yang telah mengusir kalian dari kampung halaman kalian, yaitu semua penduduk Makkah dan sekutu mereka. Jangan kalian jadikan mereka penolong dan sekutu kalian. Barang siapa yang tetap begitu maka mereka adalah orang yang mendholimi diri mereka sendiri dengan memusuhi Allah, rasul-Nya dan kitab suci Alquran"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya Allah hanya melarang kalian terhadap orang-orang yang memerangi kalian dalam urusan agama, mengusir kalian dari kampung halaman kalian, dan membantu} membantu {dalam mengusir kalian itu kalian jadikan teman} kalian membantu dan menjadikan mereka teman akrab {Siapa saja yang menjadikan mereka sebagai teman akrab} menjadikan mereka sebagai penolong dan teman dekat daripada orang-orang mukmin {maka mereka itulah orang-orang yang zalim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9. Allah berfirman, “Sesungguhnya Allah hanya melarang kamu menjadikan sebagai kawanmu orang-orang yang memerangi kamu karena Agama,” maksudnya, demi agama kalian, memusuhi agama kalian dan orang yang menegakkannya, “dan mengusir kamu dari negerimu dan membantu,” yakni membantu orang lain, “untuk mengusirmu.” Allah melarang kalian menjadikan mereka sebagai pemimpin kalian dan memberikan bantuan dan sikap kasih sayang, baik dengan perkataan maupun perbuatan. Adapun perbuatan baik kalian terhadap orang-orang kafir di luar koridor sikap loyalitas tidaklah terlarang, namun termasuk dalam keumuman perintah berbuat baik terhadap kerabat dan orang lain bahkan terhadap selain manusia. “Dan barangsiapa menjadikan mereka sebagai kawan,” dari kalangan kalian, “maka mereka itulah orang-orang yang zhalim.” Kezhaliman itu berdasarkan sikap menjadikan mereka sebagai kawan. Jika hal itu dilakukan secara penuh, maka perbuatan itu adalah suatu kekufuran yang mengeluarkan pelakunya dari Islam. Dan di bawah tingakatan ini ada juga tingkatan yang besar dan yang lebih kecil dari itu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mumtahanah ayat 9: 9-10. Wahai orang-orang yang beriman kepada Allah dan Rasul-Nya, jika datang kepada kalian wanita-wanita yang beriman, yaitu wanita-wanita muhajirin dari negeri kafir menuju negeri islam, maka wajib bagi kalian untuk menguji mereka, agar kalian mengetahui kejujuran iman mereka, dan telah diketahui bahwa tidaklah manusia mengetahui hakikat keimanan kecualai hanya Allah yang mengetahuinya; Maka jika dugaan kalian besar bahwasanya mereka adalah wanita-wanita yang beriman, janganlah kalian mengembalikan mereka ke negeri kafir. Kemudian Allah menjelaskan akan sebab larangan mengembalikan mereka, Allah mengabarkan bahwasanya tidak halal menikahkan wanita-wanita yang beriman dengan orang-orang kafir, dan tidak halal pula atas orang kafir menikahi wanita-wanita yang beriman, dan wajib bagi kalian memberikan mereka laki-laki yang telah masuk islam kepada wanita-wanita yang beriman, yang laki-laki itu menginfakkan kepada wanita-wanita itu mahar. Allah mengabarkan bahwa tidak ada larangan dan dosa bagi kalian untuk menikahi wanita-wanita beriman dari muhajirin jika engkau dapat membayar mahar kepada mereka. Allah memerintahkan hamba-Nya agar melepaskan akad-akad kepada istrinya yang masih kafir; Karena tidak ada kewajiban bagi kalian dan bagi wanita-wanita kafir perlindungan dan hubungan. Allah meminta kepada mereka untuk meminta mahar bagi istri-istri mereka apabila mereka ingin dikembalikan mahar tersebut kepada mereka. Mintalah kepada orang-orang kafir mahar bagi istri-istri kalian dari wanita-wanita muhajirin yang beriman, yang datang kepada kalian. Maksudnya adalah wajib bagi kalian menunaikan mahar itu. Dan ketahuilah wahai manusia, bahwa hukum ini adalah hukum Allah yang Allah berikan hukum ini kepada kalian, maka ikutilah jangan menyelisihi-Nya. Allahlah yang Maha Mengetahui kebaikan hamba, Yang Bijaksana dalam pensyariatan bagi para hambanya, Allah mensyariatkan atas apa yang mengandung hikmah yang jelas."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mereka inilah orang-orang yang kita dilarang Allah Subhaanahu wa Ta'aala memberikan kecintaan, pembelaan baik dengan ucapan maupun perbuatan. Adapun perbuatan baikmu dan ihsanmu yang tidak termasuk berwala’ kepada kaum musyrikin, maka Allah Subhaanahu wa Ta'aala tidaklah melarangnya, bahkan yang demikian termasuk ke dalam keumuman perintah berbuat ihsan kepada kerabat dan manusia lainnya. Kezaliman ini tergantung tingkat wala’ yang diberikannya, jika sempurna (seperti menolong mereka memerangi agama Islam dan kaum muslimin) maka dapat menjadikannya keluar dari Islam, namun jika di bawahnya, maka ada yang berat, dan ada yang di bawahnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mumtahanah Ayat 9",
    "description": "'sesungguhnya Allah hanya melarang kamu, orang-orang beriman, menjadikan mereka, orang-orang kafir yang tidak bersedia hidup berdampingan dengan kamu secara damai, yaitu mereka yang memerangi kamu karena agama, tidak ada kebebasan dan toleransi beragama; mengusir kamu dari tempat tinggal kamu, karena pembersihan ras, suku, dan agama, serta penguasaan teritorial, dan membantu pihak lain untuk mengusir kamu karena kerja sama yang sistemik dan terencana; sebagai sahabat dekat kamu lahir batin. Barang siapa yang menjadikan mereka sebagai kawan, karena kepentingan ekonomi, politik, dan keamanan; maka mereka itulah orang zalim terhadap perjuangan islam dan kaum muslim. 10. Melalui ayat ini Allah menjelaskan tentang tata cara yang harus dilakukan rasulullah apabila menerima perempuan yang berasal dari daerah kafir dan hukum perkawinan mereka. 'wahai orang-orang yang beriman! apabila perempuan-perempuan mukmin yang berasal daerah yang dikuasai orang-orang kafir datang berhijrah kepadamu ke madinah, maka hendaklah kamu uji keimanan mereka agar kamu mengetahui latar belakang dan motivasi kedatangan mereka, serta dapat memberikan perlindungan yang tepat kepada mereka. Allah lebih mengetahui tentang keimanan mereka, hakikat, kualitas, bahkan yang terbesit dalam hati mereka; namun, pengujian ini diperlukan untuk kewaspadaan. Jika kamu telah mengetahui, setelah kamu melakukan wawancara mendalam terhadap mereka bahwa mereka, perempuan-perempuan yang meminta perlindungan itu benar-benar beriman, maka janganlah kamu mengembalikan mereka kepada orang-orang kafir, yakni suami-suami mereka yang kafir, karena perkawinan mereka batal, ketika perempuan-perempuan itu masuk islam. Mereka, perempuan-perempuan muslimah itu tidak halal bagi orang-orang kafir itu, yakni bagi para suami mereka untuk berhubungan suami-istri dan orang-orang kafir itu pun, yakni para suami yang kafir, tidak halal bagi mereka, para istri yang sudah menjadi muslimah untuk berhubungan suami-istri. Dan berikanlah kepada suami mereka, yang masih tetap kafir itu mahar yang telah mereka berikan kepada mantan istrinya yang menjadi muslimah, jika mereka meminta. Dan tidak ada dosa bagi kamu, para laki-laki muslim untuk menikahi mereka, karena perempuan-perempuan itu berstatus janda, apabila kamu menikahinya setelah selesai masa iddah, mengikuti hukum Allah dan dengan tujuan pernikahan yang benar, serta membayarkan kepada mereka maharnya sesuai kesepakatan. ' sebaliknya jika perempuan-perempuan muslimah meninggalkan suami mereka, masuk ke daerah kafir dan menjadi kafir, maka Allah menegaskan, 'dan janganlah kamu, para laki-laki muslim tetap berpegang pada tali pernikahan dengan perempuan-perempuan kafir, karena pernikahan kamu dengan mereka batal setelah mereka murtad; dan hendaklah kamu, para laki-laki muslim meminta kembali mahar yang telah kamu berikan kepada mantan istri kamu yang murtad itu. ' sementara itu tentang perempuan beriman yang menghadap kepada nabi di madinah, Allah menegaskan, 'dan jika suaminya tetap kafir, sedangkan perempuan-perempuan itu benar-benar beriman, biarkanlah mereka, para suami itu, meminta kembali mahar yang telah mereka bayarkan kepada mantan istrinya yang telah beriman. Demikianlah hukum Allah yang ditetapkan-Nya di antara kamu tentang perceraian karena suami atau istri murtad atau istri masuk islam, serta larangan menikah beda agama. Dan Allah maha mengetahui semua yang tersimpan dalam hati, mahabijasana dalam menyikapi tingkah laku manusia. '."
  }
]