[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-10. Allah bersumpah dengan matahari dan waktu siangnya, dan waktu terbitnya (waktu dhuha). Allah bersumpah Juga dengan rembulan yang mengikutinya dalam terbit dan terbenam, Allah bersumpah Juga dengan siang yang melenyapkan dan mengangkat kegelapan, Allah bersumpah Juga dengan malam saat ia menutupi bumi sehingga ia pun gelap, Allah bersumpah Juga dengan langit dan bangunannya yang kokoh. Allah bersumpah Juga dengan bumi dan hamparannya, Allah bersumpah Juga dengan setiap jiwa yang Allah ciptakan dengan sempurna untuk menunaikan tugasnya, Lalu Allah menjelaskan untuknya jalan keburukan dan jalan kebaikan, Sungguh beruntung siapa yang menyucikannya dan menumbuhkan nya dengan kebaikan, Dan sungguh merugi siapa yang menjerumuskannya ke dalam kemaksiatan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Dan orang yang mengotori jiwanya dengan kemaksiatan dan dosa secara sembunyi-sembunyi telah merugi."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. وَقَدْ خَابَ مَن دَسَّىٰهَا (dan sesungguhnya merugilah orang yang mengotorinya) Yakni merugilah orang yang menyesatkan dan memalingkan jiwanya dari Allah dan tidak membawanya kepada ketaatan kepada Allah dan amalan shalih."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "9-10 Jiwa jika engkau meninggalkannya, iblis akan menjadikannya pintu masuk untuk merusak dirimu, dan jika engkau menggantukkan untuknya nasehat terus-menerus serta penyesalan atas segala kesalahan dan dosa, dan kamu Istiqomah dalam hal itu, maka iblis akan menjauh dari dirimu, jiwa akan tenang, dan kemenangan akan menjadi milikmu, sebagaimana yang dikatakan dalam ayat ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9-10. Sungguh beruntung orang menyucikan jiwanya dari dosa dan mengembangkannya dengan ketaatan dan ketakwaan, dan sungguh merugi orang yang lalai untuk mendidik jiwanya melainkan malah menggodanya (untuk keburukan). Ini adalah jawaban dari qasam (sumpah) itu. At-Tadsiyah (Penodaan) adalah mengurangi dan menyembunyikan, dan itu merupakan lawan kata Tazkiyah (Penyucian)."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan sungguh rugi} merugi {orang yang mengotorinya} menyembunyikan jiwanya dalam kekufuran dan kemaksiatan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9-10. “Sungguh beruntunglah orang yang menyucikan jiwa itu,” yakni, menyucikan dirinya dari berbagai dosa, membersihkannya dari berbagai aib, dan meningkatkannya dengan ketaatan dan ilmu yang bermanfaat serta amal baik. “Dan sungguh merugilah orang yang mengotorinya,” yakni, menyembunyikan jiwanya yang mulia yang tidak sebenarnya dengan menghempaskannya dan menyembunyikannya dengan kekotoran, kerendahan, dan mendekatkannya dengan berbagai aib dan dosa, meninggalkan sesuatu yang bisa menyempurnakan dan menumbuhkannya, serta menggunakan sesuatu yang memperkeruh dan mengotorinya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ وَقَدْ خَابَ مَنْ دَسَّاهَا ) Dan merugilah orang yang telah mengotori jiwanya, yaitu dengan kemaksiatan kepada Allah ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَقَدْ خَابَ مَنْ دَسَّاهَا \" dan sesungguhnya merugilah orang yang mengotorinya.\"Maknanya: Siapa saja yang menginginkan jiwanya terjerumus kepada kebinasaan-kebinasaan dan kemaksiatan-kemaksiatan, ini butuh berdpa kepada Allah subhaanahu waTa'ala agar seorang insan diteguhkan di atas ketaatan kepada-Nya, dan di atas ucapan yang kokoh di kehidupan dunia dan akhirat, maka hendaknya anda selalu meminta kepada Allah keteguhan, ilmu yang bermanfaat dan amalan shaleh. Sesungguhnya Allah Ta'ala berfirman: وَإِذَا سَأَلَكَ عِبَادِي عَنِّي فَإِنِّي قَرِيبٌ أُجِيبُ دَعْوَةَ الدَّاعِ إِذَا دَعَانِ فَلْيَسْتَجِيبُوا لِي وَلْيُؤْمِنُوا بِي لَعَلَّهُمْ يَرْشُدُونَ \" Dan apabila hamba-hamba-Ku bertanya kepadamu tentang Aku, maka (jawablah), bahwasanya Aku adalah dekat. Aku mengabulkan permohonan orang yang berdoa apabila ia memohon kepada-Ku, maka hendaklah mereka itu memenuhi (segala perintah) Ku dan hendaklah mereka beriman kepada-Ku, agar mereka selalu berada dalam kebenaran.\"(Al-Baqarah: 186)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syams ayat 10: 9-10. Kemudian (pada ayat ini) datang jawaban atas sumpah (pada ayat sebelumnya) dengan sebelas keyakinan yang dijelaskan oleh Allah bahwasanya telah berhasil dan sukses barangsiapa yang mensucikan dirinya dari dosa dan aib kemudian mensucikan dirinya. Dan barangsiapa yang mengotori (dirinya) dan merugi siapa yang tersesat dan menyesatkan serta beramal dengan apa yang (Allah) larang dan barangsiapa yang membolehkan dari perbuatan dosa dan maksiat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan maksiat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syams Ayat 10",
    "description": "Dan sungguh rugi orang yang menutupi kemuliaan jiwa itu, mengotorinya dengan sifat-sifat buruk, dan mematikan potensinya untuk berbuat baik. Dengan melakukan hal itu, manusia tidak malu lagi berperilaku buruk, berbuat dosa, dan merugikan orang lain. 11. Kaum samud, yang dahulu tinggal di sebelah selatan madinah, adalah contoh manusia yang mengotori jiwa dengan kekafiran dan maksiat. Kaum 'amud telah mendustakan rasulnya, yaitu nabi saleh, karena mereka melampaui batas dalam keingkaran terhadap ajakan nabi mereka dan melakukan tindakan yang penuh dosa."
  }
]