[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "11-15. Kaum Tsamud mendustakan nabi mereka,mereka durhaka dengan sangat, Manakala orang paling sengsara dari mereka bangkit untuk membunuh unta, Maka Rasul Allah, shallallahu 'alaihi wa sallam berkata kepada mereka, “jangan berbuat buruk kepada unta ini,karena ia hanyalah mukjizat allah yang dia kirim kepada kalian yang membuktikan kebenaran nabi kalian. Jangan mengganggu air minumnya,karena dia mempunyai giliran minum satu hari dan kalian di hari lain.”. Hal ini terasa berat bagi mereka,maka mereka mendustakannya dalam ancaman yang dia ucapkan,lalu mereka menyembelihnya. Maka tuhan mereka menimpakan hukuman akibat kejahatan mereka, Allah meratakannya atas mereka semua, tidak ada seorang pun yang selamat. Allah tidak takut terhadap akibat dari azab besar yang DIA turunkan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. \"Kaum Ṡamūd telah mendustakan Nabi mereka, Ṣāleḥ, karena mereka telah melampaui batas dalam melakukan kemaksiatan dan dosa.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "11-12. Kemudian Allah menyebutkan contoh orang-orang kafir seperti kaum Tsamud yang mendustakan Nabi Shalih, Allah membinasakan mereka karena mereka sangat zalim dan banyak bermaksiat; ketika orang yang paling zalim di antara mereka -yaitu Qaddar bin Salif- menyembelih unta betina yang merupakan mukjizat Nabi Shalih, ia melakukan ini karena godaan dari kaumnya, dan perbuatan itu merupakan tanda keberanian mereka dalam menentang Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "11. كَذَّبَتْ ثَمُودُ بِطَغْوَىٰهَآ ((Kaum) Tsamud telah mendustakan (rasulnya) karena mereka melampaui batas) Yakni akibat mereka banyak melakukan kemaksiatan sehingga itu mendorongnya untuk mendustakan rasul."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Kaum Tsamud, kaum nabi Shalih AS berdusta akibat kesewenang-wenangan mereka, yaitu melampaui batas yang semestinya, begitu juga kaum ‘Aad, kaum nabi Luth dan Fir’aun"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kaum Tsamud telah mendustakan (rasul) karena mereka melampaui batas} karena mereka melampaui batas dalam berbuat maksiat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11-15. (Kaum) Tsamud telah mendustakan (rasulnya) karena melampaui batas,” yakni karena tindakan mereka yang melampaui batas dan merasa tinggi hati terhadap kebenaran serta sombong terhadap rasul mereka. “Ketika bangkit orang yang paling celaka di antara mereka,” yakni orang paling sengsara di antara penduduk kabilah tersebut yaitu Qudar bin Salif karena menyembelih unta ketika mereka sepakat untuk itu dan mereka menyuruhnya lalu ia menunaikan perintah mereka. “Lalu Rasul Allah, (Shaleh) berkata kepada mereka,” memberi peringatan, “(Biarkanlah) unta betina Allah dan minumannya.” Artinya, waspadalah kalian, jangan sampai menyembelih unta Allah yang dijadikan sebagai tanda-tanda kebesaran Allah untuk kalian. Jangan kalian batasi nikmat Allah berupa meminum susunya dengan menyembelihnya. Mereka pun mendustakan nabi mereka, Shaleh, “dan menyembelih unta itu, maka Rabb mereka membinasakan mereka disebabkan dosa mereka.” Allah membinasakan mereka dan meratakan siksaan pada mereka semua. Allah mengirim suara keras dari atas mereka dan goncangan dari bawah mereka hingga mereka pun berjongkok di atas lutut tanpa seorang pun yang memanggil dan menyahut. “Lalu Allah menyama-ratakan mereka (dengan tanah),” yakni Allah meratakan mereka dalam siksaan, “dan Allah tidak takut terhadap akibat tindakanNya itu,” yakni apa-apa yang menjadi akibat setelah itu. Bagaimana Dzat Yang Maha Memaksa yang tidak satiu pun makhluk bisa terlepas dari paksaan dan tindakanNya merasa takut. Mahabijaksana Allah dalam segala hal yang diputuskan dan disyariatkanNya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Kaum Tsamud telah mendustakan risalah yang diturunkan kepada Nabi mereka. Kaum tsamud adalah salah satu kaum yang telah musnah yang dibinasakan oleh Allah, kaum Nuh, 'Aad, Tsamud, kaum Nabi Ibrahim, dan penghuni kota madyan, mereka adalah ummat yang telah dibinasakan oleh Allah karena pembangkangan mereka terhadap agama Allah. Allah karuniakan kepada mereka berbagai kenikmatan, akan tetapi dengan kenikmata itu mereka kafir kepada Allah, mereka menyembah berhala, tiada kesyukuran yang mereka persembahkan untuk Allah sang pemberi nikmat itu. { كَذَّبَتْ ثَمُودُ بِطَغْوَاهَا } Kaum tsamud telah mendustakan Nabinya, disebabkan oleh perilaku mereka yang melampaui batas, mereka enggan beribadah kepada Allah, ketika Allah mengutus kepada mereka Nabi Shalih, Nabi yang berasal dari golongan mereka, mengajak kepada kebenaran yang datang dari Allah, mereka mengatakan : dia hanyalah manusia biasa seperti kita, bagaimana mungkin kita mentaatinya, bahkan mereka pun menantang Nabi shalih untuk mendatangkan satu bukti akan kebenaran yang beliau sampaikan, dan ketika bukti itu terwujud mereka tetap saja pada kekafiran yang telah merusak jiwa mereka."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "كَذَّبَتْ ثَمُودُ بِطَغْوَاهَا \"(Kaum) Tsamud telah mendustakan (rasulnya) karena mereka melampaui batas,\" كَذَّبَتْ ثَمُودُ \"(Kaum) Tsamud telah mendustakan \" Tsamud adalah nama sebuah suku (kaum), nabi mereka bernama Saleh 'alaihissholaatu wassalaam, negeri tempat tinggal mereka terkenal di jalan manusia. Mereka mendustakan nabinya Saleh. Nabi mereka, Shaleh 'alahissholaatu was salaam, seperti nabi-nabi yang lain, ia menyeru untuk beribadah kepada Allah seemata tidak ada sekutu bagi-Nya, sebagaimana Allah Ta'ala berfirman: وَمَا أَرْسَلْنَا مِنْ قَبْلِكَ مِنْ رَسُولٍ إِلَّا نُوحِي إِلَيْهِ أَنَّهُ لَا إِلَهَ إِلَّا أَنَا فَاعْبُدُونِ \" Dan Kami tidak mengutus seorang rasul pun sebelum kamu, melainkan Kami wahyukan kepadanya: Bahwasanya tidak ada Tuhan (yang hak) melainkan Aku, maka sembahlah olehmu sekalian akan Aku \" (Al-Anbiya: 25) Ia menyeru umatnya untuk beribadah kepada Allah semata tidak ada sekutu bagi-Nya, Allah memberikan kepadanya tanda kebesaran-Nya yang menunjukan kenabiannya, yaitu unta yang besar yang minum air dari sumur sehari dan mengeluarkan susu untuk mereka di hari berikutnya. Sebagian ulama mengatakan: Bahwa setiap kali manusia memberinya air dalam jumlah tertentu, unta itu pun akan mengeluarkan susu sebanding dengan air yang diberikan kepadanya, tetapi yang Nampak dari pernyataan zahir AL-Quran tidaklah demikian, berdasarkan firman firman Allah Ta'ala: لَهَا شِرْبٌ وَلَكُمْ شِرْبُ يَوْمٍ مَعْلُومٍ \"ia mempunyai giliran untuk mendapatkan air, dan kamu mempunyai giliran pula untuk mendapatkan air di hari yang tertentu. \"(Asy-Syu'ara: 155) Unta tersebut minum dari sumur sehari kemudian ia mengeluarkan susunya dihari kedua, namun tanda kebesaran Allah ini tidak bermanfaat baginya. كَذَّبَتْ ثَمُودُ بِطَغْوَاهَا \"(Kaum) Tsamud telah mendustakan (rasulnya) karena mereka melampaui batas,\" Maknanya: Dengan melampau batas dan pembangkangannya, dan huruf ba di sini adalah ba sababiyah (yang menjelaskan sebab). Maknanya: disebabkan karena kelakuan mereka melampaui batas, mereka mendustakan rasul."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syams ayat 11: 11-12. Allah mengabarkan bahwasanya Tsamud telah mendustakan Nabinya (Shalih) dengan sebab melampaui batas, ketika bangkit orang yang paling celaka dari kaumnya dan ia bernama Qadar bin Salif yang kemudian bergegas menyembelih unta betina. Dan berkata Shalih dengan nada menyindir : Kami telah mengundang adzab Allah jika aku termasuk orang-orang yang benar."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syams Ayat 11",
    "description": "Kaum samud, yang dahulu tinggal di sebelah selatan madinah, adalah contoh manusia yang mengotori jiwa dengan kekafiran dan maksiat. Kaum 'amud telah mendustakan rasulnya, yaitu nabi saleh, karena mereka melampaui batas dalam keingkaran terhadap ajakan nabi mereka dan melakukan tindakan yang penuh dosa. 12. Puncak perilaku buruk mereka tampak ketika bangkit orang yang paling celaka di antara mereka untuk melakukan tindakan yang sangat buruk akibatnya bagi mereka semua, yaitu membantai unta mukjizat nabi saleh."
  }
]