[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "11-15. Kaum Tsamud mendustakan nabi mereka,mereka durhaka dengan sangat, Manakala orang paling sengsara dari mereka bangkit untuk membunuh unta, Maka Rasul Allah, shallallahu 'alaihi wa sallam berkata kepada mereka, “jangan berbuat buruk kepada unta ini,karena ia hanyalah mukjizat allah yang dia kirim kepada kalian yang membuktikan kebenaran nabi kalian. Jangan mengganggu air minumnya,karena dia mempunyai giliran minum satu hari dan kalian di hari lain.”. Hal ini terasa berat bagi mereka,maka mereka mendustakannya dalam ancaman yang dia ucapkan,lalu mereka menyembelihnya. Maka tuhan mereka menimpakan hukuman akibat kejahatan mereka, Allah meratakannya atas mereka semua, tidak ada seorang pun yang selamat. Allah tidak takut terhadap akibat dari azab besar yang DIA turunkan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Ketika orang paling celaka di antara mereka berdiri setelah kaumnya mewakilkan itu padanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "12. إِذِ انۢبَعَثَ أَشْقَىٰهَا (ketika bangkit orang yang paling celaka di antara mereka) Yakni ketika Qaddar bin Salif, orang yang paling celaka di antara mereka dan di antara manusia semuanya berdiri untuk menyembelih unta betina yang merupakan mukjizat nabi Shalih."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12-13. Ketika bergegas berangkat untuk membantai unta, ada seorang kaum Tsamud yang merasa tidak senang, dia adalah Qudar bin Salif karena utusan Allah Shalih AS berkata kepada mereka : “Pergilah kalian dan janganlah membantai dan menyakit unta Allah itu, biarkan dia minum pada hari yang dikhususkan untuknya, maka janganlah kalian mencegahnya!”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{ketika bangkit} bangkit untuk menyembelih unta {orang yang paling celaka di antara mereka bangkit} orang paling celaka di antara kaum Tsamud yaitu Qudar bin Salif"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11-15. (Kaum) Tsamud telah mendustakan (rasulnya) karena melampaui batas,” yakni karena tindakan mereka yang melampaui batas dan merasa tinggi hati terhadap kebenaran serta sombong terhadap rasul mereka. “Ketika bangkit orang yang paling celaka di antara mereka,” yakni orang paling sengsara di antara penduduk kabilah tersebut yaitu Qudar bin Salif karena menyembelih unta ketika mereka sepakat untuk itu dan mereka menyuruhnya lalu ia menunaikan perintah mereka. “Lalu Rasul Allah, (Shaleh) berkata kepada mereka,” memberi peringatan, “(Biarkanlah) unta betina Allah dan minumannya.” Artinya, waspadalah kalian, jangan sampai menyembelih unta Allah yang dijadikan sebagai tanda-tanda kebesaran Allah untuk kalian. Jangan kalian batasi nikmat Allah berupa meminum susunya dengan menyembelihnya. Mereka pun mendustakan nabi mereka, Shaleh, “dan menyembelih unta itu, maka Rabb mereka membinasakan mereka disebabkan dosa mereka.” Allah membinasakan mereka dan meratakan siksaan pada mereka semua. Allah mengirim suara keras dari atas mereka dan goncangan dari bawah mereka hingga mereka pun berjongkok di atas lutut tanpa seorang pun yang memanggil dan menyahut. “Lalu Allah menyama-ratakan mereka (dengan tanah),” yakni Allah meratakan mereka dalam siksaan, “dan Allah tidak takut terhadap akibat tindakanNya itu,” yakni apa-apa yang menjadi akibat setelah itu. Bagaimana Dzat Yang Maha Memaksa yang tidak satiu pun makhluk bisa terlepas dari paksaan dan tindakanNya merasa takut. Mahabijaksana Allah dalam segala hal yang diputuskan dan disyariatkanNya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ إِذِ انْبَعَثَ أَشْقَاهَا } Tatkala orang yang paling buruk diantara mereka keluae untuk membunuh unta itu. Rasulullah telah menjelaskan pembunuh unta itu di dalam salah satu hadis, bah wa dia adalah laki-laki berkulit merah. Rasulullah pernah bersabda kepada Ali bin Abi Thalib dan Ammar Ra, beliau mengatakan, Maukah kalian berdua aku beri tahu siapa manusia paling celaka dari dua orang laki-laki? Kami menjawab, 'Ya, wahai Rasulullah.' Nabi ber sabda, 'Seorang laki-laki berkulit merah di kalangan Tsamud. Dialah pembunuh unta dan orang yang memukulmu, ya Ali, di sini (ubun-ubunnya) hingga basah oleh darah. (HR Ahmad). Dalam hadis lain, Rasulullah menyatakan, dia adalah seorang pembesar yang berasal dari kaum Tsamud. Kitab Shahihain menyebutkan, Rasulullah bersabda Ketika bangkit orang yang paling cela ka, Rasulullah shallallahu 'alaihi wa sal lam bersabda, 'Bangkitlah seorang laki-laki yang kotor, busuk, perusak, mulia di antara kaumnya, seperti Abu Zam'ah.' (HR al-Bukhari, 6/378, no. 3377 dan Muslim, 4/2191 no. 2855)."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "إِذِ انْبَعَثَ أَشْقَاهَا \" ketika bangkit orang yang paling celaka di antara mereka,\" Ini adalah penjelasan dari pelampauan batasan mereka yang Allah 'Azza Wa Jalla sebutkan. Itu ketika orang yang paling celaka dari mereka (kaum tsamud) melakukannya dengan segera, wal-'iyadzu billah, ia ingin segera membunuh unta tersebut."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syams ayat 12: 11-12. Allah mengabarkan bahwasanya Tsamud telah mendustakan Nabinya (Shalih) dengan sebab melampaui batas, ketika bangkit orang yang paling celaka dari kaumnya dan ia bernama Qadar bin Salif yang kemudian bergegas menyembelih unta betina. Dan berkata Shalih dengan nada menyindir : Kami telah mengundang adzab Allah jika aku termasuk orang-orang yang benar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Untuk membunuh unta itu dengan keridhaan mereka. Orang yang membunuh itu menurut para mufassir bernama Qudar bin Salif."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syams Ayat 12",
    "description": "Puncak perilaku buruk mereka tampak ketika bangkit orang yang paling celaka di antara mereka untuk melakukan tindakan yang sangat buruk akibatnya bagi mereka semua, yaitu membantai unta mukjizat nabi saleh. 13. Melihat gelagat buruk itu lalu rasul Allah, nabi saleh, berkata kepada mereka, 'biarkanlah unta betina dari Allah ini dengan minumannya. ' janganlah kamu mengusik apalagi membunuh'nya. Jangan pula kamu larang unta itu mengambil jatah air minumnya sesuai kesepakatan kita satu hari untuk unta dan hari berikutnya untuk kaum 'amud."
  }
]