[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "11-15. Kaum Tsamud mendustakan nabi mereka,mereka durhaka dengan sangat, Manakala orang paling sengsara dari mereka bangkit untuk membunuh unta, Maka Rasul Allah, shallallahu 'alaihi wa sallam berkata kepada mereka, “jangan berbuat buruk kepada unta ini,karena ia hanyalah mukjizat allah yang dia kirim kepada kalian yang membuktikan kebenaran nabi kalian. Jangan mengganggu air minumnya,karena dia mempunyai giliran minum satu hari dan kalian di hari lain.”. Hal ini terasa berat bagi mereka,maka mereka mendustakannya dalam ancaman yang dia ucapkan,lalu mereka menyembelihnya. Maka tuhan mereka menimpakan hukuman akibat kejahatan mereka, Allah meratakannya atas mereka semua, tidak ada seorang pun yang selamat. Allah tidak takut terhadap akibat dari azab besar yang DIA turunkan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "13. Maka Rasul Allah, Ṣāleḥ -'alaihissalām-, berkata kepada mereka, “Biarkan unta Allah ini dan minumnya pada waktunya, janganlah kalian mengganggunya.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "13-14. Kaum Tsamud mendustakan Nabi Shalih, maka beliau menampakkan mukjizat unta betina dan memperingatkan mereka agar tidak mengganggu unta itu dan menghalanginya dari meminum air di hari yang telah ditetapkan baginya; hal ini setelah kesepakatan Nabi Shalih dengan kaum mereka untuk memberi satu hari bagi unta betina itu untuk minum, dan di hari setelahnya giliran unta kaumnya. Akan tetapi mereka menyelisihi kesepakatan dengan nabi mereka, dan tidak mempedulikan peringatannya berupa azab dan kebinasaan. Mereka akhirnya bersepakat untuk menyembelih unta betina itu; dan apa yang selanjutnya terjadi? Allah murka terhadap mereka, sehingga mereka tertimpa azab berupa suara keras dan gempa bumi yang membinasakan mereka, dan mereka semua tertimbun tanah tanpa terkecuali, tidak ada satupun dari mereka yang selamat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "13. فَقَالَ لَهُمْ رَسُولُ اللَّـهِ (lalu Rasul Allah berkata kepada mereka) Yakni Nabi Shalih. نَاقَةَ اللَّـهِ ((“Biarkanlah) unta betina Allah) Ia memperingatkan mereka dari unta tersebut. وَسُقْيٰهَا (dan minumannya”) Yakni air yang unta itu minum, dengan tidak mengusirnya pada hari gilirannya untuk minum."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "13-14. Jika azab mereka seperti yang diterangkan oleh ayat ini, padahal dosa mereka selain kesyirikan adalah membunuh onta yang Allah jadikan untuk mereka sebagai salah satu ayat-ayat keagungan-Nya, maka bagaimana dengan orang-orang yang senantiasa memperburuk hidupnya dengan kemaksiatan dan perbuatan yang diharamkan, serta memojokkan perintah dan larangan Allah, tentunya mereka akan menerima balasan yang jauh lebih mengerikan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12-13. Ketika bergegas berangkat untuk membantai unta, ada seorang kaum Tsamud yang merasa tidak senang, dia adalah Qudar bin Salif karena utusan Allah, Shalih AS berkata kepada mereka : “Pergilah kalian dan janganlah membantai dan menyakiti unta Allah itu, biarkan dia minum pada hari yang dikhususkan untuknya, maka janganlah kalian mencegahnya!”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Rasul Allah} Shalij AS {berkata kepada mereka,“(Biarkanlah) unta betina Allah ini beserta minumannya”} biarkanlah unta betina Allah ini dan biarkanlah minumannya pada hari dia minum, serta jangan mengganggunya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11-15. (Kaum) Tsamud telah mendustakan (rasulnya) karena melampaui batas,” yakni karena tindakan mereka yang melampaui batas dan merasa tinggi hati terhadap kebenaran serta sombong terhadap rasul mereka. “Ketika bangkit orang yang paling celaka di antara mereka,” yakni orang paling sengsara di antara penduduk kabilah tersebut yaitu Qudar bin Salif karena menyembelih unta ketika mereka sepakat untuk itu dan mereka menyuruhnya lalu ia menunaikan perintah mereka. “Lalu Rasul Allah, (Shaleh) berkata kepada mereka,” memberi peringatan, “(Biarkanlah) unta betina Allah dan minumannya.” Artinya, waspadalah kalian, jangan sampai menyembelih unta Allah yang dijadikan sebagai tanda-tanda kebesaran Allah untuk kalian. Jangan kalian batasi nikmat Allah berupa meminum susunya dengan menyembelihnya. Mereka pun mendustakan nabi mereka, Shaleh, “dan menyembelih unta itu, maka Rabb mereka membinasakan mereka disebabkan dosa mereka.” Allah membinasakan mereka dan meratakan siksaan pada mereka semua. Allah mengirim suara keras dari atas mereka dan goncangan dari bawah mereka hingga mereka pun berjongkok di atas lutut tanpa seorang pun yang memanggil dan menyahut. “Lalu Allah menyama-ratakan mereka (dengan tanah),” yakni Allah meratakan mereka dalam siksaan, “dan Allah tidak takut terhadap akibat tindakanNya itu,” yakni apa-apa yang menjadi akibat setelah itu. Bagaimana Dzat Yang Maha Memaksa yang tidak satiu pun makhluk bisa terlepas dari paksaan dan tindakanNya merasa takut. Mahabijaksana Allah dalam segala hal yang diputuskan dan disyariatkanNya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Maka berkatalah seorang Rasul yang diutus kepada mereka, yakni Nabi shalih : biarkanlah unta itu bersama minumannya, hari ini adalah harinya untuk minum, janganlah kalian mengganggunya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Maka Rasul mereka Shalih 'alaihissholaatu wassalaam نَاقَةَ اللَّهِ وَسُقْيَاهَا \"(\"Biarkanlah) unta betina Allah dan minumannya \" Biarkanlah unta itu, berdasarkan firman Allah dalam ayat lain فَذَرُوهَا تَأْكُلْ فِي أَرْضِ اللَّهِ \" maka biarkanlah dia makan di bumi Allah, \"(Al-A'raf: 73) Maksudnya: Biarkanlah unta itu, jangan membunuhnya dan jangan ganggu dia. Tetapi mereka malah tidak mendengarkan pesan ini."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syams ayat 13: Allah menjelaskan bahwa Nabi mereka (Shalih) telah melarang mereka dari berbuat jahat kepada unta betinya (Nya). Shalih memperingatkan bagi siapa yang melanggarnya dan meminum air minumannya. Dan Shalih memperingatkan dari adzab Allah karena kemarahan-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni janganlah membunuh unta dari Allah itu, yang Dia jadikan sebagai ayat-Nya yang besar bagi kamu, dan janganlah kamu balas nikmat Allah kepadamu dengan menjadikan kamu dapat mengambil air susu unta itu dengan malah membunuhnya. Sehari untuknya (unta itu) dan sehari untuk mereka secara bergiliran."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syams Ayat 13",
    "description": "Melihat gelagat buruk itu lalu rasul Allah, nabi saleh, berkata kepada mereka, 'biarkanlah unta betina dari Allah ini dengan minumannya. ' janganlah kamu mengusik apalagi membunuh'nya. Jangan pula kamu larang unta itu mengambil jatah air minumnya sesuai kesepakatan kita satu hari untuk unta dan hari berikutnya untuk kaum 'amud. 14. Kaum samud tidak rela dengan pembagian jatah air itu. Nabi saleh telah menasihati mereka, namun mereka mengabaikan serta mendustakannya, dan dengan beringas pria paling celaka itu menyembelih' unta tersebut dan membantainya atas perintah kaum samud. Karena itu tuhan membinasakan mereka karena dosanya, lalu diratakan-Nya mereka dengan tanah. Hanya nabi saleh dan orang beriman yang selamat dari azab itu. Kejadian ini memberi pesan kepada generasi setelahnya bahwa aturan agama Allah harus diindahkan. Mereka yang menentang dan melakukan dosa akan mendapatkan sanksi yang keras dari Allah di dunia sebelum sanksi yang lebih keras lagi di akhirat."
  }
]