[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "11-15. Kaum Tsamud mendustakan nabi mereka,mereka durhaka dengan sangat, Manakala orang paling sengsara dari mereka bangkit untuk membunuh unta, Maka Rasul Allah, shallallahu 'alaihi wa sallam berkata kepada mereka, “jangan berbuat buruk kepada unta ini,karena ia hanyalah mukjizat allah yang dia kirim kepada kalian yang membuktikan kebenaran nabi kalian. Jangan mengganggu air minumnya,karena dia mempunyai giliran minum satu hari dan kalian di hari lain.”. Hal ini terasa berat bagi mereka,maka mereka mendustakannya dalam ancaman yang dia ucapkan,lalu mereka menyembelihnya. Maka tuhan mereka menimpakan hukuman akibat kejahatan mereka, Allah meratakannya atas mereka semua, tidak ada seorang pun yang selamat. Allah tidak takut terhadap akibat dari azab besar yang DIA turunkan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Lalu mereka mendustakan Rasul dalam perkara unta ini, kemudian orang paling celaka dari mereka membunuh unta itu dengan restu dari mereka terhadap perbuatannya. Maka sebenarnya mereka itu sekutu dalam perbuatan dosa, lalu Allah pun menimpakan siksa-Nya kepada mereka dan menghancurkan mereka dengan suara keras yang menggelegar karena dosa-dosa mereka, dan Allah menyamaratakan mereka dalam hukuman yang Allah gunakan untuk menghancurkan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "14. فَدَمْدَمَ عَلَيْهِمْ رَبُّهُم (maka Tuhan mereka membinasakan mereka) Yakni Allah menimpakan mereka azab. فَسَوَّىٰهَا(lalu Allah menyama-ratakan mereka (dengan tanah)) Yakni Allah meratakan mereka dengan tanah, dengan menjadikan mereka tenggelam dalam tanah."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "13-14. Jika azab mereka seperti yang diterangkan oleh ayat ini, padahal dosa mereka selain kesyirikan adalah membunuh onta yang Allah jadikan untuk mereka sebagai salah satu ayat-ayat keagungan-Nya, maka bagaimana dengan orang-orang yang senantiasa memperburuk hidupnya dengan kemaksiatan dan perbuatan yang diharamkan, serta memojokkan perintah dan larangan Allah, tentunya mereka akan menerima balasan yang jauh lebih mengerikan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14-15. Lalu mereka berdusta kepada Shalih AS dan mengingkari apa yang sebaiknya mereka hindari. Kemudian mereka membunuh unta itu, karena hal itu dapat memenuhi perjanjian di antara golongan mereka dan memuaskan (nafsu) mereka. Maka turunlah azab dari Tuhan kepada mereka akibat dosa mereka. Maka berlakulah siksa itu kepada mereka dan menghancurkan mereka semua atau melenyapkan suku tersebut dari bumi, sehingga mereka semua lenyap dari permukaan bumi. Dan Allah tidak mengkhawatirkan tentang akibat penghancuran atau pembinasaan itu karena Dialah Dzat yang Maha Melindungi lagi Maha Kuasa atas segala sesuatu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Lalu mereka mendustakannya dan menyembelih unta betina itu} menyembelihnya {Maka Tuhan membinasakan mereka} lalu Tuhan mereka menetapkan azab untuk mereka {karena dosa-dosa mereka} karena mereka memdustakan rasul dan menyembelih unta betina {lalu meratakan mereka} Dia meratakan mereka dalam menerima azab baik orang-orang yang lemah di antara mereka maupun pembesar mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11-15. (Kaum) Tsamud telah mendustakan (rasulnya) karena melampaui batas,” yakni karena tindakan mereka yang melampaui batas dan merasa tinggi hati terhadap kebenaran serta sombong terhadap rasul mereka. “Ketika bangkit orang yang paling celaka di antara mereka,” yakni orang paling sengsara di antara penduduk kabilah tersebut yaitu Qudar bin Salif karena menyembelih unta ketika mereka sepakat untuk itu dan mereka menyuruhnya lalu ia menunaikan perintah mereka. “Lalu Rasul Allah, (Shaleh) berkata kepada mereka,” memberi peringatan, “(Biarkanlah) unta betina Allah dan minumannya.” Artinya, waspadalah kalian, jangan sampai menyembelih unta Allah yang dijadikan sebagai tanda-tanda kebesaran Allah untuk kalian. Jangan kalian batasi nikmat Allah berupa meminum susunya dengan menyembelihnya. Mereka pun mendustakan nabi mereka, Shaleh, “dan menyembelih unta itu, maka Rabb mereka membinasakan mereka disebabkan dosa mereka.” Allah membinasakan mereka dan meratakan siksaan pada mereka semua. Allah mengirim suara keras dari atas mereka dan goncangan dari bawah mereka hingga mereka pun berjongkok di atas lutut tanpa seorang pun yang memanggil dan menyahut. “Lalu Allah menyama-ratakan mereka (dengan tanah),” yakni Allah meratakan mereka dalam siksaan, “dan Allah tidak takut terhadap akibat tindakanNya itu,” yakni apa-apa yang menjadi akibat setelah itu. Bagaimana Dzat Yang Maha Memaksa yang tidak satiu pun makhluk bisa terlepas dari paksaan dan tindakanNya merasa takut. Mahabijaksana Allah dalam segala hal yang diputuskan dan disyariatkanNya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ فَكَذَّبُوهُ } Maka kaum tsamud mendustakan Nabinya ketika dia datang dengan bukti-bukti kebenaran Allah, mereka tidak meyakini apa yang Nabi shalih sampaikan, { فَعَقَرُوهَا } kemudian mereka pun membunuh unta itu, seorang yang paling kuat diantara mereka yang membunuh unta itu, Allah berfirman tentang mereka ; { فَنَادَوْا صَاحِبَهُمْ فَتَعَاطَىٰ فَعَقَرَ } ( Maka mereka memanggil kawannya, lalu kawannya menangkap (unta itu) dan membunuhnya. ) [ Al-Qomar : 29 ]. Setelah mereka meolak perintah Allah, dan mendustakan Nabi-Nya, maka Nabi shalih memberikan peringatan bahwa mereka akan binasa dalam waktu yang sangat dekat, : { فَقَالَ تَمَتَّعُوا فِي دَارِكُمْ ثَلَاثَةَ أَيَّامٍ ۖ ذَٰلِكَ وَعْدٌ غَيْرُ مَكْذُوبٍ } ( maka berkata Shaleh: “Bersukarialah kamu sekalian di rumahmu selama tiga hari, itu adalah janji yang tidak dapat didustakan”.) [ Hud : 65 ] setelah tiga hari kalian akan ditimpa azab yang akan memusnahkan kalian semua. Pada hari ketiga datanglah azab berupa suara yang menggelegar. Surah Fushilat ayat 13 menjelaskan, Jika mereka berpaling, maka katakanlah, 'Aku telah memperingatkan kamu dengan petir, seperti petir yang menimpa kaum 'Ad dan kaum Tsamud,\". Suara menggelegar itu telah membinasakan semua yang ada di bumi dari kabilah itu, tanpa ada beda antara yang ting gal di daerahnya dan sedang bepergi an ke daerah lain yang jauh."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "فَكَذَّبُوهُ بِذَنْبِهِمْ فَسَوَّاهَا \" Lalu mereka mendustakannya \" Maknanya: Mereka mendustakan Nabi Saleh dan mereka mengatakan: Sesungguhnya kamu bukan rasul. Begitulah semua rasul-rasul yang diutus kepada kaum mereka, qaumnya meresponnya dengan tuduhan aib (keurangan), sebagaimana Allah Ta'ala berfirman كَذَلِكَ مَا أَتَى الَّذِينَ مِنْ قَبْلِهِمْ مِنْ رَسُولٍ إِلَّا قَالُوا سَاحِرٌ أَوْ مَجْنُونٌ \" Demikianlah tidak seorang rasul pun yang datang kepada orang-orang yang sebelum mereka, melainkan mereka mengatakan: \"Ia adalah seorang tukang sihir atau orang gila \" (QS. Adz-Dzariyat: 52) semua rasul, akan dikatakan kepada mereka: Penyihir atau orang gila, sebagaimana juga dikatakan kepada Rasulullah shallallaahu 'alaihi wa sallam: Dia adalah penyihir, pendusta, gila, pujangga, dukun, tetapi julukan-julukan buruk yang disematkan oleh musuh kepada wali-wali Allah tidak membahayakan mereka sama sekali. Namun itu malah menambah kedudukan tinggi mereka di sisi Allah subhanahu wa Ta'ala, dan jika mereka mengharapkan pahala mereka akan memperolehnya. Lalu Allah 'Azza Wa Jalla berfirman فَعَقَرُوهَا \" dan mereka menyembelih unta itu,\" Maknanya: mereka menyembelih unta tersebut yang menyebabkan kebinasaan فَدَمْدَمَ عَلَيْهِمْ رَبُّهُمْ \" maka Tuhan mereka membinasakan mereka \" Yakni: Menimpakan siksa dan membinasakan mereka, sebagaimana engkau mengatakan دَمْدَمَتِ الْبِئْر. [sumur itu ditumbun] maknanya: menimbunnya dengan tanah, karena sebab dosa mereka, karena Allah Subhaanahu wa Ta'ala tidak pernah sedikit pun menzalimi manusia, tapi merekalah yang menzalimi diri mereka sendiri. Karena dosa-dosa adalah sebab yang mengundang, kebinasaan kehancuran dan kerusakan sebagaimana dalam firman Allah Tabaraka wa Ta'ala: ظَهَرَ الْفَسَادُ فِي الْبَرِّ وَالْبَحْرِ بِمَا كَسَبَتْ أَيْدِي النَّاسِ لِيُذِيقَهُمْ بَعْضَ الَّذِي عَمِلُوا لَعَلَّهُمْ يَرْجِعُونَ \" Telah nampak kerusakan di darat dan di laut disebabkan karena perbuatan tangan manusia, supaya Allah merasakan kepada mereka sebahagian dari (akibat) perbuatan mereka, agar mereka kembali (ke jalan yang benar). \"(Ar-Rum: 41) Allah juga berfirman: وَإِذَا أَرَدْنَا أَنْ نُهْلِكَ قَرْيَةً أَمَرْنَا مُتْرَفِيهَا فَفَسَقُوا فِيهَا فَحَقَّ عَلَيْهَا الْقَوْلُ فَدَمَّرْنَاهَا تَدْمِيرًا \" Dan jika Kami hendak membinasakan suatu negeri, maka Kami perintahkan kepada orang-orang yang hidup mewah di negeri itu (supaya menaati Allah) tetapi mereka melakukan kedurhakaan dalam negeri itu, maka sudah sepantasnya berlaku terhadapnya perkataan (ketentuan Kami), kemudian Kami hancurkan negeri itu sehancur-hancurnya. \"(Al-Isra: 16) Allah Ta'alah berfirman mengajak bicara manusia termulia dan generasi terbaik: أَوَلَمَّا أَصَابَتْكُمْ مُصِيبَةٌ قَدْ أَصَبْتُمْ مِثْلَيْهَا قُلْتُمْ أَنَّى هَذَا قُلْ هُوَ مِنْ عِنْدِ أَنْفُسِكُمْ \" Dan mengapa ketika kamu ditimpa musibah (pada peperangan Uhud), padahal kamu telah menimpakan kekalahan dua kali lipat kepada musuh-musuhmu (pada peperangan Badar) kamu berkata: \"Dari mana datangnya (kekalahan) ini?\" Katakanlah: \"Itu dari (kesalahan) dirimu sendiri\". \"(Ali Imran: 165) Manusia ditimpa berbagai musibah karena sebab diri mereka sendiri, oleh karenanya Allah berfirman: فَدَمْدَمَ عَلَيْهِمْ رَبُّهُمْ بِذَنْبِهِمْ \" maka Tuhan mereka membinasakan mereka disebabkan dosa mereka,\" maknanya: karena sebab dosa mereka فَسَوَّاهَا \" lalu Allah menyama-ratakan mereka (dengan tanah).\" Maknanya: Menyeluruhkan mereka dengan kebinasaan, hingga tidak tersisa seorang pun dari mereka, sehingga mereka menjadi mayat-mayat berghelimpangan di kampung mereka itu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syams ayat 14: Allah menjelaskan bahwa mereka adalah orang-orang yang mendustakan Nabi mereka (Shalih) dan menyembelih untanya; Maka Allah celakakan mereka dengan sebab kejahatan mereka, dimana Allah meratakan (tanah) di atas mereka dan menimpakan musibah bagi mereka, dan tidak ada yang selamat dari adzab kecuali hanya Shalih dan mereka yang beriman kepada Allah dan yang mendapatkan karunia dan rahmat-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Agar jatah minum unta itu untuk mereka. Allah Subhaanahu wa Ta'aala mengirimkan kepada mereka suara keras yang mengguntur dari atas mereka dan gempa dari bawah mereka, maka mereka pun mati bergelimpangan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syams Ayat 14",
    "description": "Kaum samud tidak rela dengan pembagian jatah air itu. Nabi saleh telah menasihati mereka, namun mereka mengabaikan serta mendustakannya, dan dengan beringas pria paling celaka itu menyembelih' unta tersebut dan membantainya atas perintah kaum samud. Karena itu tuhan membinasakan mereka karena dosanya, lalu diratakan-Nya mereka dengan tanah. Hanya nabi saleh dan orang beriman yang selamat dari azab itu. Kejadian ini memberi pesan kepada generasi setelahnya bahwa aturan agama Allah harus diindahkan. Mereka yang menentang dan melakukan dosa akan mendapatkan sanksi yang keras dari Allah di dunia sebelum sanksi yang lebih keras lagi di akhirat. 15. Allah membinasakan mereka dan dia tidak takut terhadap akibatnya. Allah tidak diminta pertanggungjawaban atas tindakan-Nya oleh siapa pun. Tindakan Allah, apa pun bentuknya, adalah keadilan sejati. Makhluk harus menaati aturan-Nya dan mempertanggungjawabkan amal perbuatannya di hadapan Allah di akhirat nanti."
  }
]