[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "11-15. Kaum Tsamud mendustakan nabi mereka,mereka durhaka dengan sangat, Manakala orang paling sengsara dari mereka bangkit untuk membunuh unta, Maka Rasul Allah, shallallahu 'alaihi wa sallam berkata kepada mereka, “jangan berbuat buruk kepada unta ini,karena ia hanyalah mukjizat allah yang dia kirim kepada kalian yang membuktikan kebenaran nabi kalian. Jangan mengganggu air minumnya,karena dia mempunyai giliran minum satu hari dan kalian di hari lain.”. Hal ini terasa berat bagi mereka,maka mereka mendustakannya dalam ancaman yang dia ucapkan,lalu mereka menyembelihnya. Maka tuhan mereka menimpakan hukuman akibat kejahatan mereka, Allah meratakannya atas mereka semua, tidak ada seorang pun yang selamat. Allah tidak takut terhadap akibat dari azab besar yang DIA turunkan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Allah menimpakan siksa yang membinasakan mereka ini tanpa takut dengan akibat yang timbul darinya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "15. Allah Maha Perkasa, tidak ada yang dapat menentang ketetapan-Nya. Azab yang menimpa orang-orang kafir itu tidak dapat ditolak seorangpun dan tidak ada yang mampu membalas-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15. وَلَا يَخَافُ عُقْبٰهَا (dan Allah tidak takut terhadap akibat tindakan-Nya itu) Yakni Allah melakukan itu tanpa takut terhadap akibat dari hal itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14-15. Lalu mereka berdusta kepada Shalih AS dan mengingkari apa yang sebaiknya mereka hindari. Kemudian mereka membunuh unta itu, karena hal itu dapat memenuhi perjanjian di antara golongan mereka dan memuaskan (nafsu) mereka. Maka turunlah azab dari Tuhan kepada mereka akibat dosa mereka. Maka berlakulah siksa itu kepada mereka dan menghancurkan mereka semua atau melenyapkan suku tersebut dari bumi, sehingga mereka semua lenyap dari permukaan bumi. Dan Allah tidak mengkhawatirkan tentang akibat penghancuran atau pembinasaan itu karena Dialah Dzat yang Maha Melindungi lagi Maha Kuasa atas segala sesuatu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia tidak takut terhadap akibatnya} Dia tidak takut kepada Allah atas akibat dari perbuatanyannya ini."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11-15. (Kaum) Tsamud telah mendustakan (rasulnya) karena melampaui batas,” yakni karena tindakan mereka yang melampaui batas dan merasa tinggi hati terhadap kebenaran serta sombong terhadap rasul mereka. “Ketika bangkit orang yang paling celaka di antara mereka,” yakni orang paling sengsara di antara penduduk kabilah tersebut yaitu Qudar bin Salif karena menyembelih unta ketika mereka sepakat untuk itu dan mereka menyuruhnya lalu ia menunaikan perintah mereka. “Lalu Rasul Allah, (Shaleh) berkata kepada mereka,” memberi peringatan, “(Biarkanlah) unta betina Allah dan minumannya.” Artinya, waspadalah kalian, jangan sampai menyembelih unta Allah yang dijadikan sebagai tanda-tanda kebesaran Allah untuk kalian. Jangan kalian batasi nikmat Allah berupa meminum susunya dengan menyembelihnya. Mereka pun mendustakan nabi mereka, Shaleh, “dan menyembelih unta itu, maka Rabb mereka membinasakan mereka disebabkan dosa mereka.” Allah membinasakan mereka dan meratakan siksaan pada mereka semua. Allah mengirim suara keras dari atas mereka dan goncangan dari bawah mereka hingga mereka pun berjongkok di atas lutut tanpa seorang pun yang memanggil dan menyahut. “Lalu Allah menyama-ratakan mereka (dengan tanah),” yakni Allah meratakan mereka dalam siksaan, “dan Allah tidak takut terhadap akibat tindakanNya itu,” yakni apa-apa yang menjadi akibat setelah itu. Bagaimana Dzat Yang Maha Memaksa yang tidak satiu pun makhluk bisa terlepas dari paksaan dan tindakanNya merasa takut. Mahabijaksana Allah dalam segala hal yang diputuskan dan disyariatkanNya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَلَا يَخَافُ عُقْبَاهَا \" dan Allah tidak takut terhadap akibat tindakan-Nya itu.\" Yakni: Bahwa Allah tidak takut kesudahan mereka yang telah tertimpa azab, dan tidak takut terhadap orang yang mengikuti jejak mereka, karena milik-Nyalah segala kakuasaan dan di tangan-Nyalah segala sesuatu, berbeda dengan raja-raja lain, jika mereka berhasil mengalahkan yang lain, atau menghukum yang lain, engkau akan mendapati mereka ketakutan, khawatir dan balasan menimpa mereka juga. Sedangkan Allah 'Azza wa Jalla, sungguh Dia tidak akan takut sesudah mengazab mereka, karena milik-Nya semua kerajaan, dan pujian. Maha suci dan Maha Tinggi Allah, betapa agung dan mulianya kekuasaan-Nya. **** Dan Allah sekali-kali tidak takut dengan akibat yang telah Ia lakukan, yaitu dengan membinasakan kaum tsamud dengan azab-Nya, karena Dialah yang maha kuasa melakukan apapun yang Dia kehendaki, Dia tidak takut kepada siapapun yang menentang-Nya, walau sejuat apapun mereka, dan sekaya apapun mereka, akan tetapi jika mereka tetap saja mendustakan perintah Allah, maka untuk membinsakakan mereka sangat mudah bagi Allah. Ketika Allah memerintahkan Jibril untuk meneriakkan suara yang menggelagar, seketika mereka marti semuanya, sedangkan Nabi Shalih beserta orang-orang yang beriman bersamanya mendapat pertolongan dari Allah. Inilah kisah kaum tsamud, yaitu kaum Nabi shalih- عليه السلام - kekuatan mereka tidak bermanfaat untuk menyelamatkan diri dari azab, dan tidak pula kekayaan kota mereka menjadikan mereka kaya, mereka binasa hanya dalam waktu yang sangat singkat, dan dikahirat azab mereka akan lebih pedih dibandingkan azab yang ditimpakan kepada mereka didunia. Orang-orang yang beriman kepada Allah, mereka menyerukan kepada kebenaran, dan melarang dari kemaksiatan, ketika azab datang di daerah mereka, maka mereka akan selamat, dan ini berlaku bagi Nabi atau pengikutnya, sedangkan mereka yang tidak melakukan hal yang sama akan merasakan azab itu, dan akan binasa dengan kematian yang hina. semua ini merupakan tanda kekusaan Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syams ayat 15: Kemudian Allah tutup surat ini dengan menjelaskan bahwa Allah tidak takut menghukum dan menimpakan musibah kepada mereka orang-orang kafir dan menghancurkan mereka, sebagaimana hakim yang takut untuk menghukum mereka karena takut membahayakan dirinya; Karena mereka takut rakyatnya memberontak."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Bagaimana Allah Subhaanahu wa Ta'aala Yang Mahakuasa dan perkasa takut terhadap akibat tindakan-Nya, padahal tidak ada satu pun makhluk yang keluar dari kekuasaan dan pengaturan-Nya, dan Dia Mahabijaksana terhadap ketetapan-Nya di alam semesta dan syariat-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syams Ayat 15",
    "description": "Allah membinasakan mereka dan dia tidak takut terhadap akibatnya. Allah tidak diminta pertanggungjawaban atas tindakan-Nya oleh siapa pun. Tindakan Allah, apa pun bentuknya, adalah keadilan sejati. Makhluk harus menaati aturan-Nya dan mempertanggungjawabkan amal perbuatannya di hadapan Allah di akhirat nanti. 1. Demi malam apabila menutupi cahaya siang. Malam yang gelap gulita dan hening menjadi waktu bagi manusia untuk beristirahat dari kepenatan kerja di siang hari."
  }
]