[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-10. Allah bersumpah dengan matahari dan waktu siangnya, dan waktu terbitnya (waktu dhuha). Allah bersumpah Juga dengan rembulan yang mengikutinya dalam terbit dan terbenam, Allah bersumpah Juga dengan siang yang melenyapkan dan mengangkat kegelapan, Allah bersumpah Juga dengan malam saat ia menutupi bumi sehingga ia pun gelap, Allah bersumpah Juga dengan langit dan bangunannya yang kokoh. Allah bersumpah Juga dengan bumi dan hamparannya, Allah bersumpah Juga dengan setiap jiwa yang Allah ciptakan dengan sempurna untuk menunaikan tugasnya, Lalu Allah menjelaskan untuknya jalan keburukan dan jalan kebaikan, Sungguh beruntung siapa yang menyucikannya dan menumbuhkan nya dengan kebaikan, Dan sungguh merugi siapa yang menjerumuskannya ke dalam kemaksiatan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Dan bersumpah dengan bulan apabila mengiringi jejaknya setelah matahari tenggelam."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. وَالْقَمَرِ إِذَا تَلَىٰهَا (dan bulan apabila mengiringinya) Yakni mengikutinya setelah matahari terbenam."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "1-2. Aku bersumpah demi matahari dan cahayanya di permulaan siang, dan demi bulan yang membuntutinya (matahari) langsung setelah terbenam"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{demi bulan saat mengiringinya} Aku bersumpah demi bulan yang mengiringi matahari yang muncul setelah matahari terbenam"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-6. Allah bersumpah dengan ayat-ayat agung ini atas jiwa yang beruntung dan jiwa-jiwa lain yang keji seraya berfirman, “Demi matahari dan cahayanya di pagi hari,” yakni, cahayanya dan manfaat yang bersumber darinya. “Dan demi bulan apabila mengiringinya,” yakni mengiringinya dalam peredaran dan cahaya. “Dan demi siang apabila menampakannya,” yaitu menampakkan segala sesuatu yang ada di atas muka bumi dan membuatnya jelas. “Dan demi malam apabila menutupinya,” yaitu menutupi permukaan bumi sehingga menjadi gelap. Silih bergantinya gelap dan terang, matahari dan rembulan di alam ini dengan keteraturan, kesempurnaan, dan memberi berbagai manfaat untuk manusia, merupakan bukti terbesar bahwa Allah Maha Mengetahui lagi Mahakuasa atas segala sesuatu. Maka hanya Dia-lah yang berhak disembah dan semua sembahan selainNya adalah batil. “Dan demi langit serta pembinaannya,” kemungkinan ‘Maa’ dalam ayat ini adalah kata sambung sehingga sumpah berlaku untuk langit dan bangunannya yang amat sempuna indah. Hal ini sama seperti Firman Allah, “Dan demi bumi serta penghamparannya,” yakni Allah membentangkan dan memperluasnya sehingga memungkinkan seluruh makhluk untuk memanfaatkan bumi dengan berbagai seginya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ وَالْقَمَرِ إِذَا تَلَاهَا } Dan apabila bulan mengiringi matahari, ketika matahari terbenam dan alam menjadi gelap, datanglah bulan sebagai cahaya dikegelapan itu menjadi penerang bagi manusia dimalam hari, begitulah pergantian siang dan malam, pergatian tugas antara matahari dan bulan, peristiwa ini akan terus berlanjut sampai masa yang telah ditentukan oleh Allah ﷻ , bulan mengiringi matahari pada pertengahan bulan pertama, kemudian sebaliknya matahari mengiringi bulan dan bulan mendahuluinya pada pertengahan bulan yang terakhir. Selain gerhana yang terjadi pada matahari, bulan juga memiliki masa yang terjadi padanya gerhana seprti yang terjadi pada matahari, maka ketika terjadi gerhana bulan disyari'atkan pula saat itu shalat gerhana."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَالْقَمَرِ إِذَا تَلَاهَا \" dan bulan apabila mengiringinya,\" Dikatakan: Jika bulan mengiringinya dalam beredar. Dikatakan juga: JIka mengiringinya dalam memberikan cahaya. Selama ayat ini memiliki dua kemungkinan makna tersebut, maka jika dilihat dalam kaedah ilmu tafsir: Bahwa apabila sebuah ayat memiliki dua kemungkinan makna yang tidak saling bertentangan, maka maknanya harus diambil dengan kedua makna tersebut, karena dengan mengambil keduanya, makna ayat akan lebih luas. Karenanya kita katakana: Jika bulan mengiringi matahari dalam edarannya, karena bulan datang setiap harinya setelah matahari, ketika di awal bulan anda akan dapati bulan berdekatan dengan matahari di barat, tepi ketika dia berada di bertengahan bulan ia lebih jauh letaknya dari matahari, ia berada di timur, karena ia akan semakin terlambat setiap harinya. Atau dimaknai: Jika ia mengiringi matahari dalam cahayanya, karena ketika matahari telah terbenam maka cahaya bulan akan muncul, apalagi pada pertengan antara pecan kedua hingga akhir pecan ketiga setiap bulan, cahaya rembulan akan nampak sangat jelas. Yaitu ketika sudah berlalu tujuh hari pertama hingga sebelum masuk tujuh hari terakhir, cahaya akan terlihat kuat, sedangkan tujuh hari pertama dan tujuh hari terakhir maka cahaya akan terlihat redup. Yang terpenting adalah bahwa cahaya bulan tidak akan muncul kecuali setelah perginya cahaya matahari, sebagaimana terlihat jelas. Allah Ta'ala bersumpah dengan matahari karena matahari adalah tanda siang hari dan dengan bulan karena ia adalah tanda malam hari."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syams ayat 2: 1-8. Allah memulai surat ini dengan keimanan; Dimana Allah bersumpah dengan matahari dan sinarnya, yaitu waktu naiknya setelah munculnya. Allah juga bersumpah dengan bulan ketika mengikuti matahari, ketika matahari tenggelam, bulan muncul. Allah bersumpah dengan siang ketika nampak jelas dengan cahayanya dan sinarnya dan menyingkap kegelapan. Allah bersumpah dengan malam jika telah menyelimutinya, dan kegelapan yang ada padanya. Allah juga bersumpah dengan langit dan aturan-aturan Allah atas makhluknya dan Ia lah yang menguasai. Allah bersumpah dengan bumi dan hamparannya dari semua arah. Allah bersumpah atas setiap jiwa yang Allah ciptakan dan sempurna ciptaan-Nya. Dan Allah lah yang mengetahui keadaan ciptaan-Nya dan apa yang baik maupun yang buruk."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang terbit ketika matahari tenggelam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syams Ayat 2",
    "description": "Demi bulan apabila mengiringinya dan menggantikan tugasnya menerangi bumi setelah matahari itu terbenam. Bulan muncul dalam bentuk bulan sabit, kemudian seiring pergantian hari berubah menjadi purnama, dan kembali ke bulan sabit lagi pada akhir bulan. 3. Demi siang apabila menampakkannya, yakni menampakkan matahari. Siang yang terang menjadi waktu bagi manusia untuk beraktivitas."
  }
]