[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-10. Allah bersumpah dengan matahari dan waktu siangnya, dan waktu terbitnya (waktu dhuha). Allah bersumpah Juga dengan rembulan yang mengikutinya dalam terbit dan terbenam, Allah bersumpah Juga dengan siang yang melenyapkan dan mengangkat kegelapan, Allah bersumpah Juga dengan malam saat ia menutupi bumi sehingga ia pun gelap, Allah bersumpah Juga dengan langit dan bangunannya yang kokoh. Allah bersumpah Juga dengan bumi dan hamparannya, Allah bersumpah Juga dengan setiap jiwa yang Allah ciptakan dengan sempurna untuk menunaikan tugasnya, Lalu Allah menjelaskan untuknya jalan keburukan dan jalan kebaikan, Sungguh beruntung siapa yang menyucikannya dan menumbuhkan nya dengan kebaikan, Dan sungguh merugi siapa yang menjerumuskannya ke dalam kemaksiatan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Dan bersumpah dengan siang hari apabila telah menyingkap apa yang berada di atas permukaan bumi dengan cahayanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. وَالنَّهَارِ إِذَا جَلَّىٰهَا (dan siang apabila menampakkannya) Yakni jika matahari bersinar terang, yaitu ketika matahari berada di tengah siang yang nampak jelas."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3-4. Dan demi siang, ketika menampakkan matahari dengan terang benderang dan demi malam, ketika menutupi cahaya matahari dengan kegelapannya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{demi siang saat menampakkannya} Aku bersumpah demi siang yang menyingkap dan melenyapkan kegelapan malam"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-6. Allah bersumpah dengan ayat-ayat agung ini atas jiwa yang beruntung dan jiwa-jiwa lain yang keji seraya berfirman, “Demi matahari dan cahayanya di pagi hari,” yakni, cahayanya dan manfaat yang bersumber darinya. “Dan demi bulan apabila mengiringinya,” yakni mengiringinya dalam peredaran dan cahaya. “Dan demi siang apabila menampakannya,” yaitu menampakkan segala sesuatu yang ada di atas muka bumi dan membuatnya jelas. “Dan demi malam apabila menutupinya,” yaitu menutupi permukaan bumi sehingga menjadi gelap. Silih bergantinya gelap dan terang, matahari dan rembulan di alam ini dengan keteraturan, kesempurnaan, dan memberi berbagai manfaat untuk manusia, merupakan bukti terbesar bahwa Allah Maha Mengetahui lagi Mahakuasa atas segala sesuatu. Maka hanya Dia-lah yang berhak disembah dan semua sembahan selainNya adalah batil. “Dan demi langit serta pembinaannya,” kemungkinan ‘Maa’ dalam ayat ini adalah kata sambung sehingga sumpah berlaku untuk langit dan bangunannya yang amat sempuna indah. Hal ini sama seperti Firman Allah, “Dan demi bumi serta penghamparannya,” yakni Allah membentangkan dan memperluasnya sehingga memungkinkan seluruh makhluk untuk memanfaatkan bumi dengan berbagai seginya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Dan siang apabila menampakkan alam yang gelap saat malam hari, ia menampakkannya dengan cahaya dan sinarnya, inilah tanda kekuasaan Allah ﷻ ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَالنَّهَارِ إِذَا جَلَّاهَا (3) وَاللَّيْلِ إِذَا يَغْشَاهَا \"dan siang apabila menampakkannya, dan malam apabila menutupinya,\" Siang dan malam silih berganti وَالنَّهَارِ إِذَا جَلَّاهَا \" dan siang apabila menampakkannya,\" Apabila siang hari menampakkan bumi, menjelaskan dan menerangkannya, karena dengan siang hari akan jelas dan nampak segala sesuatu وَاللَّيْلِ إِذَا يَغْشَاهَا \" dan malam apabila menutupinya,\" Apabila menutupi bumi hingga seperti kain yang menyelimuti segala sesuatu, ini akan terlihat jelas ketika matahari terbenam dan anda sedang berada di pesawat, anda akan mendapati bumi gelap dibawahmu, karena saat naik pesawat anda menyaksikan matahari karena anda tinggi, tetapi bumi yang berada di bawah anda, matahari sudah terbenam, anda akan mendapatinya seakan tertutup dengan pakaian hitam, inilah makna firman Allah وَاللَّيْلِ إِذَا يَغْشَاهَا : dan malam apabila menutupinya,\""
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syams ayat 3: 1-8. Allah memulai surat ini dengan keimanan; Dimana Allah bersumpah dengan matahari dan sinarnya, yaitu waktu naiknya setelah munculnya. Allah juga bersumpah dengan bulan ketika mengikuti matahari, ketika matahari tenggelam, bulan muncul. Allah bersumpah dengan siang ketika nampak jelas dengan cahayanya dan sinarnya dan menyingkap kegelapan. Allah bersumpah dengan malam jika telah menyelimutinya, dan kegelapan yang ada padanya. Allah juga bersumpah dengan langit dan aturan-aturan Allah atas makhluknya dan Ia lah yang menguasai. Allah bersumpah dengan bumi dan hamparannya dari semua arah. Allah bersumpah atas setiap jiwa yang Allah ciptakan dan sempurna ciptaan-Nya. Dan Allah lah yang mengetahui keadaan ciptaan-Nya dan apa yang baik maupun yang buruk."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ke permukaan bumi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syams Ayat 3",
    "description": "Demi siang apabila menampakkannya, yakni menampakkan matahari. Siang yang terang menjadi waktu bagi manusia untuk beraktivitas. 4. Demi malam apabila menutupinya sehingga suasana menjadi gelap gulita. Malam menjadi waktu istirahat bagi manusia guna mengembalikan kekuatan untuk kembali beraktivitas esok hari."
  }
]