[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-10. Allah bersumpah dengan matahari dan waktu siangnya, dan waktu terbitnya (waktu dhuha). Allah bersumpah Juga dengan rembulan yang mengikutinya dalam terbit dan terbenam, Allah bersumpah Juga dengan siang yang melenyapkan dan mengangkat kegelapan, Allah bersumpah Juga dengan malam saat ia menutupi bumi sehingga ia pun gelap, Allah bersumpah Juga dengan langit dan bangunannya yang kokoh. Allah bersumpah Juga dengan bumi dan hamparannya, Allah bersumpah Juga dengan setiap jiwa yang Allah ciptakan dengan sempurna untuk menunaikan tugasnya, Lalu Allah menjelaskan untuknya jalan keburukan dan jalan kebaikan, Sungguh beruntung siapa yang menyucikannya dan menumbuhkan nya dengan kebaikan, Dan sungguh merugi siapa yang menjerumuskannya ke dalam kemaksiatan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Dan bersumpah dengan langit dan bersumpah dengan pembangunannya yang teliti."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5-6. Dan demi langit dan Dzat yang membangunnya yaitu Allah SWT, itu adalah bukti keberadaanNya, dan demi bumi dan Dzat yang membentangkannya dan membuatnya layak untuk ditempati"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{demi langit serta pembuatannya} Aku bersumpah demi langit dan juga demi pembuatannya yang kokoh"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-6. Allah bersumpah dengan ayat-ayat agung ini atas jiwa yang beruntung dan jiwa-jiwa lain yang keji seraya berfirman, “Demi matahari dan cahayanya di pagi hari,” yakni, cahayanya dan manfaat yang bersumber darinya. “Dan demi bulan apabila mengiringinya,” yakni mengiringinya dalam peredaran dan cahaya. “Dan demi siang apabila menampakannya,” yaitu menampakkan segala sesuatu yang ada di atas muka bumi dan membuatnya jelas. “Dan demi malam apabila menutupinya,” yaitu menutupi permukaan bumi sehingga menjadi gelap. Silih bergantinya gelap dan terang, matahari dan rembulan di alam ini dengan keteraturan, kesempurnaan, dan memberi berbagai manfaat untuk manusia, merupakan bukti terbesar bahwa Allah Maha Mengetahui lagi Mahakuasa atas segala sesuatu. Maka hanya Dia-lah yang berhak disembah dan semua sembahan selainNya adalah batil. “Dan demi langit serta pembinaannya,” kemungkinan ‘Maa’ dalam ayat ini adalah kata sambung sehingga sumpah berlaku untuk langit dan bangunannya yang amat sempuna indah. Hal ini sama seperti Firman Allah, “Dan demi bumi serta penghamparannya,” yakni Allah membentangkan dan memperluasnya sehingga memungkinkan seluruh makhluk untuk memanfaatkan bumi dengan berbagai seginya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ وَالسَّمَاءِ } Demi langit dan bangunanya yang kokoh, Allah ﷻ besumpah dengan langit yang tujuh tingkat, { وَمَا بَنَاهَا } dan bangunan langit itu yang ditinggikan degan kokohnya, Allah ﷻ menempatkan langit itu berada di atas sebagai atap bagi bumi, Allah ﷻ berfirman : { وَالسَّمَاءَ بَنَيْنَاهَا بِأَيْدٍ وَإِنَّا لَمُوسِعُونَ , وَالْأَرْضَ فَرَشْنَاهَا فَنِعْمَ الْمَاهِدُونَ } ( Dan langit itu Kami bangun dengan kekuasaan (Kami) dan sesungguhnya Kami benar-benar berkuasa , Dan bumi itu Kami hamparkan, maka sebaik-baik yang menghamparkan (adalah Kami). ) [ Az-Zariyat : 47-48 ] ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَالسَّمَاءِ وَمَا بَنَاهَا (5) \" dan langit serta pembinaannya, \" Langit dan bumi saling berhadapan وَالسَّمَاءِ وَمَا بَنَاهَا Para ahli tafsir mengatakan: Bahwa ما [ma] di sini adalah ma mashdariyah. Maka artinya, Demi langit dan bangunannya. Karena langit ini besar dengan ketinggian, keluasan, dan kekokohannya dan sifat besar lainnya, yang itu semua adalah tanda-tanda keangungan Allah yang ada padanya. Begitu juga bangunannya dengan bangunan yang teratur, sebagaimana Allah Tabaaraka wa Ta'ala: مَا تَرَى فِي خَلْقِ الرَّحْمَنِ مِنْ تَفَاوُتٍ فَارْجِعِ الْبَصَرَ هَلْ تَرَى مِنْ فُطُورٍ (3) ثُمَّ ارْجِعِ الْبَصَرَ كَرَّتَيْنِ يَنْقَلِبْ إِلَيْكَ الْبَصَرُ خَاسِئًا وَهُوَ حَسِيرٌ \" kamu sekali-kali tidak melihat pada ciptaan Tuhan Yang Maha Pemurah sesuatu yang tidak seimbang. Maka lihatlah berulang-ulang, adakah kamu lihat sesuatu yang tidak seimbang? Kemudian pandanglah sekali lagi niscaya penglihatanmu akan kembali kepadamu dengan tidak menemukan sesuatu cacat dan penglihatanmu itu pun dalam keadaan payah. \"(Al-Mulk: 3-4)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syams ayat 5: 1-8. Allah memulai surat ini dengan keimanan; Dimana Allah bersumpah dengan matahari dan sinarnya, yaitu waktu naiknya setelah munculnya. Allah juga bersumpah dengan bulan ketika mengikuti matahari, ketika matahari tenggelam, bulan muncul. Allah bersumpah dengan siang ketika nampak jelas dengan cahayanya dan sinarnya dan menyingkap kegelapan. Allah bersumpah dengan malam jika telah menyelimutinya, dan kegelapan yang ada padanya. Allah juga bersumpah dengan langit dan aturan-aturan Allah atas makhluknya dan Ia lah yang menguasai. Allah bersumpah dengan bumi dan hamparannya dari semua arah. Allah bersumpah atas setiap jiwa yang Allah ciptakan dan sempurna ciptaan-Nya. Dan Allah lah yang mengetahui keadaan ciptaan-Nya dan apa yang baik maupun yang buruk."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kata ‘maa’ di ayat tersebut bisa sebagai isim maushul yang berarti ‘yang’, sehingga Allah Subhaanahu wa Ta'aala bersumpah dengan langit dan yang membangunnya, yaitu Allah Subhaanahu wa Ta'aala. Bisa juga ‘maa’ di sini sebagai mashdariyyah (kata kerja yang dibendakan), sehingga Allah Subhaanahu wa Ta'aala bersumpah dengan langit dan pembinaannya yang menakjubkan. Demikian pula pada kata ‘maa’ pada ayat selanjutnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syams Ayat 5",
    "description": "Demi langit serta pembinaannya yang menakjubkan. Langit yang kukuh laksana atap yang melindungi manusia di bawahnya. Langit menjadi tempat bagi miliaran benda langit yang beredar pada orbit masing-masing. Tidak ada benturan antara satu benda langit dengan lainnya. Semuanya mencerminkan kekuasaan zat yang mahakuasa dan mahaperkasa. 6. Demi bumi serta penghamparannya sehingga menjadi tempat makhluk hidup berpijak. Karena bumi terhampar luas, manusia dapat dengan mudah berpindah dari satu ke tempat lain."
  }
]