[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-10. Allah bersumpah dengan matahari dan waktu siangnya, dan waktu terbitnya (waktu dhuha). Allah bersumpah Juga dengan rembulan yang mengikutinya dalam terbit dan terbenam, Allah bersumpah Juga dengan siang yang melenyapkan dan mengangkat kegelapan, Allah bersumpah Juga dengan malam saat ia menutupi bumi sehingga ia pun gelap, Allah bersumpah Juga dengan langit dan bangunannya yang kokoh. Allah bersumpah Juga dengan bumi dan hamparannya, Allah bersumpah Juga dengan setiap jiwa yang Allah ciptakan dengan sempurna untuk menunaikan tugasnya, Lalu Allah menjelaskan untuknya jalan keburukan dan jalan kebaikan, Sungguh beruntung siapa yang menyucikannya dan menumbuhkan nya dengan kebaikan, Dan sungguh merugi siapa yang menjerumuskannya ke dalam kemaksiatan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Dan Allah memahamkan kepadanya tanpa belajar segala yang buruk agar ia menghindarinya dan segala yang baik agar ia melakukannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. فَأَلْهَمَهَا فُجُورَهَا وَتَقْوَىٰهَا (maka Allah mengilhamkan kepada jiwa itu (jalan) kefasikan dan ketakwaannya) Yakni Allah mengenalkan dan memahamkannya tentang ketakwaan dan kebaikannya, dan kefasikan dan keburukan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7-8 dan demi jiwa manusia dan Dzat yang mengatur penciptaannya dan susunan tubuhnya, lalu mengenalkannya kepada jalan kefasikan agar dihindari, dan jalan kebaikan dan ketakwaan agar disenangi. Ibnu Abbas berkata”Allah menjelaskan kepadanya tentang baik-buruk, ketaatan dan kemaksiatan, dan mengenalkan sesuatu yang (sebaiknya) didatangi dan dihindari”. Para ahli tafsir berkata: “Allah SWT bersumpah demi 7 hal itu untuk menampakkan keagungan kuasaNya dan keesaanNya dengan sifat ketuhanan”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{lalu kejahatan dan ketakwaannya} jalan keislaman dan jalam kekufuran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7-8. “Dan demi jiwa serta penyempurnaan (ciptaan) nya.” Kemungkinan yang dimaksudkan adalah jiwa seluruh makhluk hidup sebagaimana dikuatkan oleh keumuman ayat ini. Dan kemungkinan yang dimaksudkan adalah sumpah dengan jiwa manusia mukallaf saja, dengan dalil yang akan disebutkan berikutnya. Secara keseluruhan, jiwa adalah salah satu tanda-tanda kebesaran Allah yang berhak untuk dijadikan obyek sumpah, karena jiwa adalah sesuatu yang amat lembut dan tidak kelihatan, amat cepat berpindah dan bergerak, cepat berubah, terpengaruh oleh emosi-emosi diri seperti sedih, berkeinginan, cinta, dan benci. Tanpa jiwa, raga hanyalah patung yang tidak ada gunanya. Dibentuknya ia secara sempurna merupakan salah satu tanda kebesaran Allah."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Jiwa itu terbagi menjadi dua macam, jiwa yang rusak karena keluar dari ketaatan kepada Allah ﷻ , atau jiwa yang bersih dengan ketaqwaanya kepada Allah, jiwa-jiwa tidak diciptakan pada kedudukan yang sama, dan ini merupakan tanda kekuasaan Allah ﷻ , Dialah yang menjadikan jiwa-jiwa itu dalam ketaqwaan atau kefasikan. Setiap jiwa diciptakan dalam keadaan suci dari dosa, akan tetapi pemiliknya lah yang merubahnya, sebagaimana yang dikatakan oleh Rasulullah : (( كُلُّ مَوْلُوْدٍ يُوْلَدُ عَلَى الْفِطْرَةِ، حَتَّى يُعْرِبَ عَنْهُ لِسَانُهُ، فَأَبَوَاهُ يُهَوِّدَانِهِ أَوْ يُنَصِّرَانِهِ أَوْ يُمَجِّسَانِهِ )) “Setiap anak yang lahir dilahirkan di atas fitrah hingga ia fasih (berbicara), maka kedua orang tuanya lah yang menjadikannya Yahudi, Nasrani, atau Majusi.” [ Hadits ini diriwayatkan oleh al-Baihaqi ] . Jika tarbiyah seseorang itu baik maka akan baik pula jiwanya, tetapi jika tarbiyahnya rusak maka akan rusak jiwanya, oleh sebab itu mengambil sebab kebaikan itu wajib dilakukan untuk menjadikan jiwa setiap insan lebih baik, perlunya tarbiyah yang baik dari kedua orang tua sejak anak usia dini, dan kesadaran dari diri sendiri untuk memperbaiki diri ketika usia telah dewasa dan berakal sehat. Maka setiap insan harus pandai memilih jalan yang ia tempuh, apakah jalan itu baik ataukah sebaliknya, karena setiap langkah dan amalan hamba akan dipertanggung jawabkan di hari kiamat kelak, Allah berfirman : { مَنْ عَمِلَ صَالِحًا فَلِنَفْسِهِ ۖ وَمَنْ أَسَاءَ فَعَلَيْهَا ۗ وَمَا رَبُّكَ بِظَلَّامٍ لِلْعَبِيدِ } ( Barangsiapa yang mengerjakan amal yang saleh maka (pahalanya) untuk dirinya sendiri dan barangsiapa mengerjakan perbuatan jahat, maka (dosanya) untuk dirinya sendiri; dan sekali-kali tidaklah Rabb-mu menganiaya hamba-hamba-Nya. ) [ Fussilat : 46 ] ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "فَأَلْهَمَهَا \" maka Allah mengilhamkan kepada jiwa itu \" Maknanya: Allah 'Azza Wa Jalla memberikan ilham kepada jiwa-jiwa tersebut فُجُورَهَا وَتَقْوَاهَا \"(jalan) kefasikan dan ketakwaannya,\" Allah mendahulukan kefasikan sebelum takwa, padahal katakwaan tidak diragukan lagi lebih baik. Para ulama mengatakan: Ini adalah bentuk perhatian kepada penggalan-penggalan ayat-ayat فُجُورَهَا وَتَقْوَاهَا \"(jalan) kefasikan dan ketakwaannya,\" Kefasikan adalah lawan dari ketakwaan, ketakwaan adalah ketaatan kepada Allah, sedangkan kefasikan adalah kemaksiatan kepada Allah, setiap orang yang bermaksiat dia adalah fajir (fasik). Meskipun orang yang fajir, secara kebiasaan adalah orang yang tidak menjaga kehormatan diri. Tetapi secara syari'at maknanya mencakup semua orang yang keluar dari ketaatan kepada Allah, sebagaimana Allah Ta'ala berfirman: كَلَّا إِنَّ كِتَابَ الْفُجَّارِ لَفِي سِجِّينٍ \"karena sesungguhnya kitab orang yang durhaka tersimpan dalam sijjin.\" Maksudnya adalah orang-orang kafir. Memberikan ilham dengan ketakwaannya adalah (menunjukinya kepada) yang sesuai dengan fitrah, karena kefajiran (kefasikan) adalah keluar dari fitrah, tapi terkadang Allah memberikan ilham kepada sebagian jiwa mengarah ke penyimpangannya, sebagaimana dalam firman-Nya فَلَمَّا زَاغُوا أَزَاغَ اللَّهُ قُلُوبَهُمْ \"Maka tatkala mereka berpaling (dari kebenaran), Allah memalingkan hati mereka;\"(Ash-Shaf: 5) Allah tidak akan menzalimi siapa pun, tetapi Allah tahu bahwa ia tidak menginginkan kebaikan maka Allah palingkan hatinya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Asy-Syams ayat 8: 1-8. Allah memulai surat ini dengan keimanan; Dimana Allah bersumpah dengan matahari dan sinarnya, yaitu waktu naiknya setelah munculnya. Allah juga bersumpah dengan bulan ketika mengikuti matahari, ketika matahari tenggelam, bulan muncul. Allah bersumpah dengan siang ketika nampak jelas dengan cahayanya dan sinarnya dan menyingkap kegelapan. Allah bersumpah dengan malam jika telah menyelimutinya, dan kegelapan yang ada padanya. Allah juga bersumpah dengan langit dan aturan-aturan Allah atas makhluknya dan Ia lah yang menguasai. Allah bersumpah dengan bumi dan hamparannya dari semua arah. Allah bersumpah atas setiap jiwa yang Allah ciptakan dan sempurna ciptaan-Nya. Dan Allah lah yang mengetahui keadaan ciptaan-Nya dan apa yang baik maupun yang buruk."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Asy-Syams Ayat 8",
    "description": "Setelah menyempurnakan ciptaan jwia itu maka dia mengilhamkan kepadanya jalan kejahatan dan ketakwaannya. Jiwa manusia laksana wadah bagi nilai-nilai yang diembannya. Jiwa bisa menjadi baik atau buruk tergantung nilai mana yang manusia pilih dan aktualisasikan. 9. Sungguh beruntung orang yang membersihkan jiwa itu dan menyucikannya dari segala keko'toran seperti syirik, kufur, takabur, iri, dengki, kikir, tamak, dan sebagainya, lalu menghiasinya dengan sifat-sifat baik seperti iman, ikhlas, sabar, syukur, dan sebagainya."
  }
]