[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Merugilah kedua tangan Abu Lahab dan sengsara, karena dia telah menyakiti Rasulullah sholallohu alaihi wasallam. Sungguh kerugian Abu Lahab telah terwujud."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Telah merugi kedua tangan paman Nabi -ṣallallāhu 'alaihi wa sallam- Abu Lahab bin Abdul Muṭṭalib karena perbuatannya, karena ia telah menyakiti Nabi -ṣallallāhu 'alaihi wa sallam-, dan gagallah usahanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1. Allah mencela orang sesat yang telah menyakiti Rasulullah: Binasalah kedua tangan Abu Lahab (Abdul ‘Uzza bin Abdul Mutthalib) dan binasalah dia bersama keduanya karena telah menyakiti Rasulullah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. تبَّتۡ يَدَاۤ اَبِىۡ لَهَبٍ (Binasalah kedua tangan Abu Lahab) Yakni binasa dan merugilah kedua tangannya. وَّتَبَّؕ‏( dan sesungguhnya dia akan binasa) Dan dia juga akan binasa. Dan kebinasaan ini telah menimpanya, dia adalah Abu Lahab, paman Rasulullah, dan namanya adalah Abdul ‘Uzza."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Ada pelajaran bahwasanya nasab tidaklah berpengaruh dalam menentukan nasib seseorang selamat dari azab Allah, bahkan nabi yang mulia pun ketika pelanggaran syariat terjadi diantara keluarganya maka akibat yang akan mereka terima lebih besar, sebagaimana Allah berfirman : { يَا نِسَاءَ النَّبِيِّ مَنْ يَأْتِ مِنْكُنَّ بِفَاحِشَةٍ مُبَيِّنَةٍ يُضَاعَفْ لَهَا الْعَذَابُ ضِعْفَيْنِ ۚ وَكَانَ ذَٰلِكَ عَلَى اللَّهِ يَسِيرًا } \"Hai isteri-isteri Nabi, siapa-siapa di antaramu yang mengerjakan perbuatan keji yang nyata, niscaya akan di lipat gandakan siksaan kepada mereka dua kali lipat. Dan adalah yang demikian itu mudah bagi Allah\". [ al-Ahzab : 30 ]."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "1. Hancur dan merugilah Abu Lahab (yaitu Abu Al-Uzza bin Abdul Muthallib, paman Nabi SAW, namun dia adalah orang yang paling memusuhinya), maka sungguh merugilah dia. Ini adalah berita untuknya. Abu Lahab adalah julukan baginya karena saking merahnya wajahnya, julukan ini disebutkan untuk mengolok-olok dia. Kalimat pertama adalah doa yang abadi untuk Abu Lahab sampai hari kiamat. Ditetapkan dalam dua hadits shahih dan lainnya bahwa sesungguhnya Nabi SAW saat mengajak kaumnya di bukit Shafa untuk masuk Islam, Abu Lahab berkata:”Cih, apakah kamu mengumpulkan kami kecuali hanya untuk ini?” kemuidian turunlah surah ini."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Binasalah} celaka dan merugilah {kedua tangan Abu Lahab dan benar-benar binasa dia} Benar-benar celaka dan merugi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Abu lahab adalah paman Nabi. Ia amat memusuhi dan menyakiti beliau. Ia tidak memiliki adan tidak memiliki semangat kekerabatan. Semoga Allah memberinya balasan buruk. Karena itu Allah amat mencelanya yang merupakan kehinaan baginya hingga Hari Kiamat seraya berfirman, “Binasalah kedua tangan Abu Lahab,” yakni rugi dan celakalah kedua tangannya, “Dan sungguh dia akan binasa,” sehingga ia tidak akan beruntung."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Allah - عز وجل - mengutus Nabi-Nya Muhammad ﷺ dengan membawa risalah yang mulia kepada ummat manusia, mengajak mereka kepada tauhid mengesakan Allah , berjihad dijalan Allah memperjuangkan agama islam sejak beliau diangkat menjadi Rasul hingga mendekati masa-masa penaklukan kota Makkah. Allah - عز وجل - telah menolong Rasul-Nya dalam segala urusan, dan beliau bersama sahabatnya sering menemukan kesulitan dan rintangan dalam perjuangan dakwah beliau pada masa-masa itu, dan dakwah beliau diawal risalah islam disebarkan hanya dalam bentuk dakwah lisan tanpa adanya jihad, karena pada masa itu Allah - عز وجل - belum menurunkan perintah untuk berjihad, walaupun keadaan kaum muslim ketika itu sangat memprihatinkan, ancaman datang silih berganti, serangan-serangan dari kaum kuffar quraisy dan Yahudi, cercaan demi cercaan di hadapi oleh kaum muslim dengan sabar, akan tetapi mereka tetap berada diatas keimananmereka yang kokoh. Diawal-awal datangnya islam penduduk kota Makkah sangat membenci keberadaan kaum muslimin di kota itu, mereka mencaci maki kaum muslimin yang masih minoritas, akan tetapi Rasulullah ﷺ bersama sahabatnya sabar menerima semua cobaan itu dan mereka terus istiqomah dalam dakwah mereka, bahkan paman Rasulullah ﷺ sendiri Abu lahab sangat membeci dakwah yang dilakukan oleh Rasulullah ﷺ , dia kerap membuntuti Rasulullah ﷺ kemanapun beliau berjalan untuk menyampaikan dakwah islam, Abu mengikuti Nabi Muhammad setiap kali beliau menyampaikan dakwahnya Abu lahab terus mengatakan kepada orang-orang : \"jangan kalian dengarkan ucapan orang ini sesungguhnya dia adalah pembohong, begitupun dengan istri Abu lahab yaitu Ummu jamil binti harb yang juga merupakan saudari abu sufyan, perempuan yang juga sering melakukan perlawanan terhadap dakwah Rasulullah ﷺ . Suatu ketika Rasulullah saw naik ke bukit Shafa sambil berseru :”Mari berkumpul pada pagi hari ini !” maka berkumpullah kaum Quraisy. Rasulullah bersabda :”Bagaimana pendapat kalian, seandainya aku beritahu bahwa musuh akan datang besok pagi atau petang, apakah kalian percaya padaku?” Kaum Quraisy menjawan: “Pasti kami percaya”. Rasulullah bersabda: “Aku peringatkan kalian bahwa siksa Allah yang dasyat akan datang.” Berkatalah Abu Lahab:”Celakalah engkau ! apakah hanya untuk ini, engkau kumpulkan kami ?” Maka turunlah ayat ini (surat Al-Lahab ayat 1-5). Berkenaan dengan peristiwa tersebut, yang melukiskan bahwa kecelakaan itu akan menimpa orang yang memfitnah dan menghalang-halangi agama Allah. { تَبَّتْ يَدَا أَبِي لَهَبٍ وَتَبَّ } Binasalah kedua tangan Abu lahab, Yang dimaksud dengan kedua tangan Abu Lahab ialah Abu Lahab sendiri, hal itu karena tangan adalah alat yang dipakai setiap manusia untuk melakukan apapun yang ia inginkan baik itu kejahatan ataupun kebaikan. Abu lahab yang bernama asli 'Abdul 'uzza bin Abdul muththolib, al-'uzza adalah nama dari salah satu patung berhala penduduk kota Makkah, sedangkan kunyahnya yaitu Abu lahab diambil dari sifat wajahnya yang terang tanpan, yang diserupakan dengan kemerah merahan bara abi, Ayat ini merupakan balasan untuknya yang mengatakan : \"binasalah kamu wahai Muhammad\" . { تَبَّتْ يَدَا أَبِي لَهَبٍ وَتَبَّ } Ayat ini juga merupakan doa agar kebinasaan dan kerugian tertimpa kepadanya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Dalam Al-Quran banyak bukti yang sangat jelas menunjukkan bahwa Rasul shallallaahu ‘alaihi wa sallam adalah benar, beliau tidak menyeru untuk kekuasaan dan jabatan, dan tidak untuk memperoleh ketokohan pada kaumnya. Dan paman-paman Rasulullah ‘alaihissholaatu wassalaam dalam mereka berinteraksi dengan beliau dan dengan Allah ‘Azza Wa Jalla terbagi menjadi tiga golongan: Pertama: Paman beliau yang beriman dan berjihad bersamanya, dan berserah diri kepada Rabbul-‘aalamiin. Kedua: Menjadi penopang dan membantu, tetapi tetap dalam kekafiran. Ketiga: Menentang dan berpaling, dia pun kafir. Yang pertama: Dialah Abbas Bin Abdulmuthalib dan Hamzah Bin Abdulmuthalib. Hamzah lebih utama dari pada Abbas, karena yang kedua adalah di antara para syuhada yang terbaik di sisi Allah ‘Azza Wa Jalla, Nabi shallallaahu ‘alaihi wa sallam menyebutnya dengan singa Allah dan singa Rasul-Nya (1) beliau mati syahid radhiyallaahu ‘anhu pada saat perang uhud pada tahun ke 2 hijriyah. Sedangkan pamannya yang mendukung dan membantunya meski tetap dalam kekufuran, ialah Abu THalib. Abu Thalib berdiri Bersama Nabi shallallahu ‘alaihi wa sallam dengan sebaik-bainya dalam membela dan mendukungnya akan tetapi ia wal-‘iyaadzu billaah telah ditetapkan kalimat azab baginya, tidak masuk islam hingga akhir hayatnya. Pada akhir hayatnya Nabi shallallahu ‘alaihi wa sallam menawarkan agar ia masuk islam tetapi ia enggan dan mati dalam keadaan ucapannya: Ia berada di atas millah Abdulmuthalib(2). Lalu Nabi shallallaahu ‘alaihi wa sallam memberikan syafaat sehingga ia berada di neraka atas, yang mana ia mengenakan dua sandal yang mendidihkan otaknya. Ketiga: Paman beliau yang menentang dan berpaling, dia adalah Abu Lahb. Allah menurunkan tentang kondisinya dalam sebuah surat yang sempurna, yang dibaca saat shalat-shalat baik yang wajib mau pun sunnah, baik shalat yang bacaannya dilirihkan maupun dikeraskan suranya. Seseorang akan diberi pahala dengan membacanya, di setiap huruf yang dibaca akan mendapatkan sepuluh kebaikan. Allah ‘Azza Wa Jalla berfirman: تَبَّتْ يَدَا أَبِي لَهَبٍ وَتَبَّ “Merugilah kedua tangan Abu Lahab dan sesungguhnya dia akan binasa.” Ini adalah bantahan kepada Abu Lahab ketika Nabi shallallaahu ‘alaihi wa sallam mengumpulkan mereka untuk mengajak kepada (agama) Allah, beliau memberi kabar kembira dan peringatan. Abu Lahab mengatakan: تَبًّا لَكَ أَلِهذَا جَمَعْتَنَا؟ “Celaka kamu, apakah untuk ini kamu mengumpulkan kami?!” Perkataannya: أَلِهذَا جَمَعْتَنَا؟ “apakah untuk ini kamu mengumpulkan kami?!” mengandung unsur pelecehan, yakni: Ini perkara yang sepele, tidak perlu mengumpulkan tokoh-tokoh untuknya, ini sebanding dengan firman-Nya: أَهَذَا الَّذِي يَذْكُرُ آلِهَتَكُمْ “Apakah ini orang yang mencela tuhan-tuhanmu?”(QS. Al-Anbiya: 36) Maknanya: Menghinakan, tidak berharga dan tidak penting, sebagaimana mereka mengatakan: وَقَالُوا لَوْلَا نُزِّلَ هَذَا الْقُرْآنُ عَلَى رَجُلٍ مِنَ الْقَرْيَتَيْنِ عَظِيمٍ “Dan mereka berkata: \"Mengapa Al Qur'an ini tidak diturunkan kepada seorang besar dari salah satu dua negeri (Mekah dan Taif) ini?”(QS. Az-Zukhruf: 31) Akhirnya, Abu Lahab mengatakan: تَبًّا لَكَ أَلِهذَا جَمَعْتَنَا؟ “Celaka kamu, apakah untuk ini kamu mengumpulkan kami?!” maka Allah membantahnya dengan surat ini: تَبَّتْ يَدَا أَبِي لَهَبٍ وَتَبَّ “Merugilah kedua tangan Abu Lahab dan sesungguhnya dia akan binasa.” Makna اَلتَّبَابُ [At-Tabaab] adalah rugi. Kerugian itu dimulai dari kedua tangannya sebelum dirinya, kerena kedua tangan adalah alat untuk bekerja, bergerak, mengambil dan memberi juga sebagainya. Julukan Abu Lahab (Tukang api) adalah julukan yang sangat pantas untuknya, karena keadaan dan tempat kembalinya. Keserasian itu adalah ia akan berada di neraka yang menyala-nyala, menyala-nyala dengan kobaran api yang besar sesuai dengan keadaan dan tempat kembalinya. Seorang pujangga bersenandung: قُلْ إِنْ أَبْصَرَتْ عَيْنَاكَ ذَا لَقَبٍ إِلَّا وَمَعْنَاهُ إِنْ فَكَّرْتَ فِي لَقَبِه Katakanlah: Jika kedua matamu memandang yang punya julukan. Kecuali ia memiki sifat sesuai dengan julukannya jika anda cermati. Ketika Suhail Bin Amer menghadap kepada rasulullah pada kisah perjanjian Hudaibiyah, Rasulullah shallallaahu ‘alaihi wa sallam bersabda: هَذاَ سُهَيْلٌ بن عَمْرٍو، وَماَ أَرَاكُمْ إِلَّا سَهَّلَ لَكُمْ مِنْ أَمْرِكُمْ “ Ini adalah Suhail Bin Amer, dan aku tidak melihatnya melainkan ia akan memudahkan urusan untuk kalian”(3) karena nama serasi dengan perbuatan (seseorang). (1) Lihat: Al-Ishabah: 2/121-122 (2) Dikeluarkan Bukhari (1360) dan Muslim (23) dari hadits Abu Sa’iid al-Makhzumiy radhiyallaahu ‘anhu (3) Dikeluarkan oleh Bukhari (2731) dari hadits Al-Miswar Bin Makhramah radhiyallaahu ‘anhu, dan Marwan Bin Al-Hakam."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Lahab ayat 1: 1-2. Surat ini dimulai dengan celaan terhadap Abu Lahab, Allah berkata : Sungguh celaka kedua tangan orang yang celaka itu (yaitu Abu Lahab). Sia-sia dan merugi karena sebab memusuhi Nabi ﷺ. Dan sebagian celaannya kepada Nabi, ia (Abu Lahab) mengikuti Rasul ﷺ yang menuju ke Mina untuk berdakwah kepada orang-orang yang berhaji, kemudia Abu Lahab berkata : Jangan kalian percaya kepadanya, sesungguhnya ia adalah anak kami dan masih ingusan. Kemudian Allah mengabarkan bahwa harta yang dikumpulkan Abu Lahab dari hasil perdagangannya tidaklah memiliki manfaat, begitu juga dengan anaknya yang ia banggakan, tidak akan menolongnya dari adzab Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Imam Bukhari meriwayatkan dengan sanadnya yang sampai kepada Ibnu Abbas radhiyallahu 'anhuma ia berkata: Ketika turun ayat, “Dan berilah peringatan kepada kerabat-kerabatmu yang terdekat,” (Terj. Asy Syu’araa: 214) Maka Nabi shallallahu 'alaihi wa sallam naik ke atas Shafa dan menyeru, “Wahai Bani Fihr, wahai Bani ‘Addiy.” Beliau menyebut beberapa suku orang Quraisy, sehingga mereka semua berkumpul, dan orang yang tidak bisa keluar mengirim utusan untuk melihat ada apa, lalu Abu Lahab dan orang-orang Quraisy datang, maka Beliau bersabda, “Bagaimana menurutmu jika aku beritahukan kepadamu, bahwa ada sebuah pasukan berkuda di sebuah lembah yang hendak menyerangmu, apakah kamu akan membenarkanku?” Mereka menjawab, “Ya, kami belum pernah mendapatkanmu selain berkata benar.” Beliau pun bersabda, “Sesungguhnya aku seorang yang memberi peringatan kepadamu sebelum datang azab yang keras.” Lalu Abu Lahab berkata, “Celakalah kamu sepanjang hari! Apakah untuk hal ini engkau kumpulkan kami?” Maka turunlah surah, “Binasalah kedua tangan Abu Lahab dan benar-benar binasa dia!-- Tidaklah berguna baginya hartanya dan apa yang dia usahakan…dst.” (Hadits ini diriwayatkan pula oleh Muslim, Tirmidzi, Ahmad, Ibnu Jarir dalam At Taarikh juz 2 hal. 216 dan dalam At Tafsir juz 19 hal. 121 dan juz 30 hal. 337, dan Baihaqi dalam Dalaa’ilun Nubuwwah juz 1 hal. 431. Dalam ‘Umdatul Qaari juz 16 hal. 93 diterangkan, bahwa hadits ini mursal, karena Ibnu Abbas ketika itu masih kecil; bisa belum lahir atau sebagai anak-anak sebagaimana dipastikan oleh Al Ismaa’iliy, namun mursal tersebut adalah mursal shahabi, sedangkan mursal shahabiy tidaklah mengapa dan tidak mencacatkannya. Wallahu Ta’aala a’lam bish shawab.) Abu Lahab adalah paman Nabi Muhammad shallallahu 'alaihi wa sallam sendiri, namun sangat memusuhi Beliau shallallahu 'alaihi wa sallam dan menyakitinya. Oleh karena itulah, Allah Subhaanahu wa Ta'aala mencelanya dengan celaan yang keras ini yang merupakan celaan dan kehinaan yang berkelanjutan untuknya sampai hari Kiamat. Yang dimaksud dengan kedua tangan Abu Lahab ialah Abu Lahab itu sendiri. Digunakan kata “kedua tangan” karena pada umumnya tindakan manusia dilakukan oleh kedua tangannya. Kalimat ini merupakan doa kerugian dan kecelakaan untuk Abu Lahab."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Lahab Ayat 1",
    "description": "Karena kebenciannya kepada nabi dan penentangannya terhadap dakwah beliau dengan cara yang menyakitkan, maka celaka dan binasalah kedua tangan abu lahab yakni diri ab' lahab, yang bernama 'abdul 'uzz' bin 'abdul muttalib; dan benar-benar binasa dia!2. Ketika azab Allah menimpanya maka tidaklah berguna baginya hartanya yang dia kumpulkan dan banggakan, dan tidak pula bermanfaat apa yang dia usahakan seperti jabatan dan keturunan untuk menyelamatkan dirinya dari azab itu. Hanya iman dan amal saleh yang dapat menyelamatkan seseorang dari murka Allah."
  }
]