[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Harta dan anaknya tidak berguna baginya,keduanya tidak bisa melindunginya dari azab Allah sedikit pun bila ia turun kepadanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Apa faedah harta dan anaknya baginya? Keduanya tidak bisa mencegah siksa dari dirinya dan tidak pula keduanya mampu mendatangkan rahmat terhadapnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "2. Hartanya tidak berguna dan tidak dapat menolongnya dari azab Allah, begitu pula dengan kedudukan dan keturunannya tidak bermanfaat baginya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. مَاۤ اَغۡنٰى عَنۡهُ مَالُهٗ وَمَا كَسَبَؕ‏ (Tidaklah berfaedah kepadanya harta bendanya dan apa yang ia usahakan) Yakni harta yang dia kumpulkan dan keuntungan usahanya serta kedudukannya tidak dapat menjauhkannya dari kebinaasan dan azab Allah yang menimpanya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Ayat ini turun ketika Abu Lahab menyangka ia akan menebus siksaan Allah dengan harta dan anaknya, sebagaimana yang juga diakatakan oleh anak pamannya : { لَأُوتَيَنَّ مَالًا وَوَلَدًا } \" “Pasti aku akan diberi harta dan anak\" [ Maryam : 77 ] , maka dikatakanlah kepadanya : { وَنَرِثُهُ مَا يَقُولُ وَيَأْتِينَا فَرْدًا } \"dan Kami akan mewarisi apa yang ia katakan itu, dan ia akan datang kepada Kami dengan seorang diri\" [ Maryam : 80 ] , Mahasuci Allah, lihatlah bagaimana hati-hati musuh Rasul yang serempak berbangga dengan harta dan anak-anak mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Apa yang dia kumpulkan berupa harta, tidak akan berguna, tidak akan bermanfaat dan tidak akan mencegahnya dari siksa Allah. Apa yang dia usahakan berupa perbuatan buruk untuk memerangi Nabi SAW itu gagal."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Tidaklah berguna baginya} tidak bisa menjaganya dari kerugian {hartanya dan apa yang dia usahakan} yang dia hasilkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2. “Tidaklah berfaidah kepadanya harta bendanya” yang dimilikinya sehingga ia bisa berlaku semena-mena dan tidak pula berguna baginya, “dan apa yang ia usahakan” tidak akan bisa menangkal azab Allah sedikit pun bila datang menimpa."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Dia memiliki harta yang berlimpah akan tetapi selama ia tetapi berada dalam kekafiran dia tetap dalam kesesatan yang nyata Allah berfirman : { وَلَا تُعْجِبْكَ أَمْوَالُهُمْ وَأَوْلَادُهُمْ ۚ إِنَّمَا يُرِيدُ اللَّهُ أَنْ يُعَذِّبَهُمْ بِهَا فِي الدُّنْيَا وَتَزْهَقَ أَنْفُسُهُمْ وَهُمْ كَافِرُونَ } ( Dan janganlah harta benda dan anak-anak mereka menarik hatimu. Sesungguhnya Allah menghendaki akan mengazab mereka di dunia dengan harta dan anak-anak itu dan agar melayang nyawa mereka, dalam keadaan kafir. ) [ At Taubah : 85 ]."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Allah ‘Azza Wa Jalla berfirman: مَا أَغْنَى عَنْهُ مَالُهُ “Tidaklah berfaedah kepadanya harta bendanya” Kata مَا [Ma] disini bias jadi bermakna pertanyaan, sehingga maknnya: Apa yang menjadikannya kaya dari harta dan hasil usahanya? Jawabannya: Tidak ada. Dan bisa juga bermakna Ma peniadaan, maksudnya, tidak ada yang bermanfaat. Bermakna: Tidak ada harta dan hasil usahanya yag bermanfaat baginya. Kedua makna ini saling berkaitan. Kedua makna tersebut: adalah bahwa harta dan hasil usahanya, tidak berguna sama sekali baginya, padahal biasanya harta memberikan manfaat. Harta bisa menjadi tebusan seseorang insan ketika ia sedang ditawan musuh dengan mengatakan: saya akan memberimu sekian sekian dari harta, bebaskan saya. Musuh akan membebaskannya, hanya saja musuh terkada meminta harta banyak atau sedikit. Kalau ia sakit, ia bisa mengambil manfaat dari hartanya. Namun manfaat disini adalah yang tidak bisa menyelamatkan pemiliknya dari api nereka, ini bukanlah manfaat. Oleh kerenanya Allah berfirman: مَا أَغْنَى عَنْهُ مَالُهُ “Tidaklah berfaedah kepadanya harta bendanya” yakni: dari Allah sedikit pun, lalu firman-Nya: وَمَا كَسَبَ “dan apa yang ia usahakan.” Dikatakan: Maknanya adalah yang ia usahakan berupa anak, seakan akan Allah berfirman: tidak bermanfaat harta dan anaknya. Seperti ucapannya Nabi Nuh: وَاتَّبَعُوا مَنْ لَمْ يَزِدْهُ مَالُهُ وَوَلَدُهُ إِلَّا خَسَارًا “dan mereka telah mengikuti orang-orang yang harta dan anak-anaknya tidak menambah kepadanya melainkan kerugian belaka,”(QS. Nuh: 21) Mereka memaknai firman Allah وَمَا كَسَبَ “dan usahanya” dengan makna anak. Mereka menguatkan pendapat mereka ini dengan sabda Nabi shallallaahu ‘alaihi wa sallam: إِنَّ أَطْيَبَ مَا أَكَلْتُمْ مِنْ كَسْبِكُمْ، وَإِنَّ أَوْلَادَكُمْ مِنْ كَسْبِكُمْ “Sesungguh hasil makan terbaik yang kalian makan adalah berasal dari hasil usaha kalian. Dan Anak-anak kalian adalah dari hasil usaha kalian”(1) Yang benar: Ayat tersebut lebih luas maknanya dari pendapat itu, ayat ini mencakup anak-anak, harta hasil usaha yang tidak ia pegang saat sekarang, mencakup juga hasil usaha berupa kemuliaan dan kedudukan jabatan. Seluruh hasil usahanya yang bisa menmbah kedudukan dan kemuliaan, itu semua tidak bermanfaat baginya sedikit pun مَا أَغْنَى عَنْهُ مَالُهُ وَمَا كَسَبَ “Tidaklah berfaedah kepadanya harta bendanya dan apa yang ia usahakan.” (1) Dikeluarkan Tirmidziy (1358) dan Ibnu Majah (2290) dari hadits ‘Aisyah radhiyallahu ‘anha. Dan dinyatakan shahih oleh al-Albaniy dalam al-Jaami’ (1566)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Lahab ayat 2: 1-2. Surat ini dimulai dengan celaan terhadap Abu Lahab, Allah berkata : Sungguh celaka kedua tangan orang yang celaka itu (yaitu Abu Lahab). Sia-sia dan merugi karena sebab memusuhi Nabi ﷺ. Dan sebagian celaannya kepada Nabi, ia (Abu Lahab) mengikuti Rasul ﷺ yang menuju ke Mina untuk berdakwah kepada orang-orang yang berhaji, kemudia Abu Lahab berkata : Jangan kalian percaya kepadanya, sesungguhnya ia adalah anak kami dan masih ingusan. Kemudian Allah mengabarkan bahwa harta yang dikumpulkan Abu Lahab dari hasil perdagangannya tidaklah memiliki manfaat, begitu juga dengan anaknya yang ia banggakan, tidak akan menolongnya dari adzab Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu anaknya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Lahab Ayat 2",
    "description": "Ketika azab Allah menimpanya maka tidaklah berguna baginya hartanya yang dia kumpulkan dan banggakan, dan tidak pula bermanfaat apa yang dia usahakan seperti jabatan dan keturunan untuk menyelamatkan dirinya dari azab itu. Hanya iman dan amal saleh yang dapat menyelamatkan seseorang dari murka Allah. 3. Sebagai balasan atas kekejiannya kepada nabi Muhammad dan dosa-dosanya yang lain, kelak dia akan masuk ke dalam api yang bergejolak dan membakar seluruh tubuhnya secara terus-menerus. Dia tidak akan pernah mati di dalamnya dan tidak pula akan keluar darinya."
  }
]