[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "3-4. Dia akan masuk api neraka jahanam yang menyala nyala, Begitu juga istriya yang membawa duri-duri lalu meletakkannya di jalan yang dilalui oleh Rasulullah shallallahu alaihi wasallam untuk menyakiti beliau."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Ia akan masuk pada hari Kiamat ke dalam Neraka yang apinya bergejolak, ia bakal merasakan panasnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "3-4. Dia akan masuk neraka Jahannam yang sangat membara bersama dengan istrinya (Ummu Jamil, saudari Abu Sufyan) yang dahulu suka menyebarkan aib orang lain untuk membuat kerusakan, dan dia senantiasa membawa duri-duri untuk disebar di jalan yang dilewati Rasulullah agar dapat menyakitinya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. سَيَصۡلٰى نَارًا ذَاتَ لَهَبٍ (Kelak dia akan masuk ke dalam api yang bergejolak) Yakni dia akan diazb di neraka jahannam yang bergejolak yang membakar kulitnya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Surah ini merupakan bukti atas kenabian Muhammad, yaitu pada ayat yang Allah firmankan : { سَيَصْلَىٰ نَارًا ذَاتَ لَهَبٍ } \"Kelak dia akan masuk ke dalam api yang bergejola\", maka Allah pun mengabarkan tentang keduanya atas kegelisahan hati dan tidak adanya iman dalam hati, baik secara zohir maupun bathin, tersembunyi maupun yang nyata, oleh karena itu pernyataan ini yang menjadi bukti atas kenabian Muhammad yang jelas. Dan ayat ini pun menjadi salah satu sebab keislaman seorang ilmuan Amerika."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Dia akan masuk ke neraka Jahanam yang menyala-nyala sangat panas. Perumpamaan “memiliki gejolak api” sesuai dengan julukan Abu Lahab."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kelak dia akan memasuki api} dia akan masuk api yang sangat panas {yang bergejolak} yang membara dan menyala-nyala"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3-5. “Kelak dia akan masuk ke dalam api yang bergejolak,” yakni neraka akan mengelilinginya dari segenap penjuru, dia “dan istrinya, pembawa kayu bakar.” Istrinya juga amat menyakiti Rasulullah. Abu lahab dan istrinya saling bahu membahu dalam dosa dan permusuhan. Ia menimpakan keburukan dan berusaha sekuat tenaga menyakiti Rasulullah sehingga dosa-dosanya menumpuk di atas punggungnya, sama seperti orang yang menumpuk kayu bakar dengan tali yang telah disiapkan di lehernya, “dari sabut,” yaitu dari pintalan sabut atau ia membawa kayu bakar di neraka untuk suaminya dengan mengalungi tali dari sabut di lehernya. Bagaimana pun juga dalam ayat ini terdapat tanda-tanda kebesaran Allah yang nyata, karena allah menurunkan surat ini ketika Abu Lahab dan istrinya belum mati. Allah memberitahukan bahwa keduanya akan disiksa di neraka dan itu pasti. Sebagai konsekuensinya, keduanya tidak masuk Islam. Dan terjadilah seperti yang diberitahukan oleh Dzat Yang Maha Mengetahui yang ghaib dan yang nyata."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Niscaya Abu lahab akan masuk kedalam Neraka Jahannam yang menyala-nyala, pada hakikatnya jika disebutkan \" سَيَصْلَىٰ نَارًا \" adalah cukup dan mengisyaratkan bahwasanya neraka itu sangatlah panas, akan dalam ayat ini disebutkan \" ذَاتَ لَهَبٍ \" sebagai penekanan bahwasanya api neraka itu benar-benar sangat panas."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "سَيَصْلَى نَارًا ذَاتَ لَهَبٍ “Kelak dia akan masuk ke dalam api yang bergejolak.” Huruf Sin dalam firman-Nya سَيَصْلَى berfungsi untuk menunjukkan makna kedekatan yang bermakna kenyataan sesungguhnya dan dekat terjadinya (peristiwa itu). Yakni: Allah Ta’ala mengancamnya bahwa dia akan dimasukkan ke api neraka yang bergejolak di waktu yang dekan. Karena kenikmatan dan menetap di dunia, bagaimana pun lamanya, maka akhirat itu tetap dekat. Sampai pun manusia yang berada di alam barzakh, meskipun ia melewati tahun-tahun yang lama, maka itu semua serasa sesat saja: كَأَنَّهُمْ يَوْمَ يَرَوْنَ مَا يُوعَدُونَ لَمْ يَلْبَثُوا إِلَّا سَاعَةً مِنْ نَهَارٍ بَلَاغٌ فَهَلْ يُهْلَكُ إِلَّا الْقَوْمُ الْفَاسِقُونَ “Pada hari mereka melihat azab yang diancamkan kepada mereka (merasa) seolah-olah tidak tinggal (di dunia) melainkan sesaat pada siang hari. (Inilah) suatu pelajaran yang cukup, maka tidak dibinasakan melainkan kaum yang fasik.”(QS. Al-Ahqaf: 35) sesuatu yang lamanya sesaat di siang hari maka itu sebantar."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Lahab ayat 3: 3-4. Allah mengabarkan bahwa Abu Lahab akan merasakan panasannya api neraka dan diadzab dengan nyala apinya, (dia dan isterinya Ummu Jamil) sebagai balasan permusuhannya dan celaannya kepada Nabi ﷺ, serta penghinaan dan ragu kepada jalan Nabi ﷺ."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Api neraka akan mengelilinginya dari segala penjuru, demikian pula mengelilingi istrinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Lahab Ayat 3",
    "description": "Sebagai balasan atas kekejiannya kepada nabi Muhammad dan dosa-dosanya yang lain, kelak dia akan masuk ke dalam api yang bergejolak dan membakar seluruh tubuhnya secara terus-menerus. Dia tidak akan pernah mati di dalamnya dan tidak pula akan keluar darinya. 4. Abu lahab akan masuk neraka, dan demikian pula istrinya, ummu jam'l arw' binti harb bin umayyah, sang pembawa kayu bakar berduri. Dia meletakkannya di sepanjang jalan yang dilalui nabi untuk menjebak beliau. Dia juga gemar menyebar fitnah kepada nabi dan para pengikutnya."
  }
]