[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "3-4. Dia akan masuk api neraka jahanam yang menyala nyala, Begitu juga istriya yang membawa duri-duri lalu meletakkannya di jalan yang dilalui oleh Rasulullah shallallahu alaihi wasallam untuk menyakiti beliau."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Dan istrinya, Ummu Jamil yang telah menyakiti Nabi -ṣallallāhu 'alaihi wa sallam- dengan menabur duri di jalan beliau, juga akan masuk ke dalam Neraka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. وَّامۡرَاَ تُهٗ ؕ حَمَّالَةَ الۡحَطَبِ (Dan (begitu pula) istrinya, pembawa kayu bakar) Begitu pula istrinya akan masuk ke neraka yang bergejolak, istrinya bernama Ummu Jamil binti Harb, yang merupakan saudara perempuan Abu Sufyan. Dia sering membawa bara api dan duri pada malam hari untuk dia letakkan di jalan yang dilalui Rasulullah."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Dia ayat ini ada pelajaran bagi mereka yang saling tolong menolong dalam keburukan, atau dalam perbuatan dosa, dan permusuhan. 2 ). Seorang istri yang membantu suaminya dalam kekafiran dan pembangkangan, niscaya dia juga akan menjadi penolongnya yang menghantarkannya kedalam siksaan api neraka jahannam ! coba untuk membandingkan keadaan yang pertama dengan keadaan khadijah, ketika ia mentiapkan kehangatan dalam rumah tangganya untuk suaminya yaitu Rasulullah Muhammad, dikabarkan kepadnya berita gembira bahwa rumah disurga telah disiapkan untuknya, rumah yang tiada hiruk-pikuk dan kepenatan dilamanya, betapa besar pengaruh peran seorang istri dalam kehidupan suaminya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4-5. Begitu juga Istrinya Ummu Jamil, yaitu saudara perempuan Abu Sufyan akan masuk neraka Jahanam bersamanya. Dia adalah wanita yang memikul batang-batang pohon berduri dan meletakkannya di jalan (yang dilewati) Rasulallah SAW untuk menyakitinya. Kata “Hammalah” I’rabnya adalah manshub oleh fiil yang dikira-kirakan, yaitu “Uriidu” (aku menghendaki) atau “Adzummu” (aku mengecam). Di lehernya terdapat tali yang terbuat dari serat yang dililitkan sangat kencang. Dia disiksa dengan itu di dalam neraka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan istrinya, pembawa kayu bakar} dan akan memasukinya juga istrinya, Ummu Jamil yang membawa seikat duri lalu menyebarnya di jalan nabi Muhammad SAW agar bisa menyakitinya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3-5. “Kelak dia akan masuk ke dalam api yang bergejolak,” yakni neraka akan mengelilinginya dari segenap penjuru, dia “dan istrinya, pembawa kayu bakar.” Istrinya juga amat menyakiti Rasulullah. Abu lahab dan istrinya saling bahu membahu dalam dosa dan permusuhan. Ia menimpakan keburukan dan berusaha sekuat tenaga menyakiti Rasulullah sehingga dosa-dosanya menumpuk di atas punggungnya, sama seperti orang yang menumpuk kayu bakar dengan tali yang telah disiapkan di lehernya, “dari sabut,” yaitu dari pintalan sabut atau ia membawa kayu bakar di neraka untuk suaminya dengan mengalungi tali dari sabut di lehernya. Bagaimana pun juga dalam ayat ini terdapat tanda-tanda kebesaran Allah yang nyata, karena allah menurunkan surat ini ketika Abu Lahab dan istrinya belum mati. Allah memberitahukan bahwa keduanya akan disiksa di neraka dan itu pasti. Sebagai konsekuensinya, keduanya tidak masuk Islam. Dan terjadilah seperti yang diberitahukan oleh Dzat Yang Maha Mengetahui yang ghaib dan yang nyata."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Dan begitu pula dengan istri Abu Lahab yang membawa kayu bakar, maksud dari ayat ini bukan berarti bahwa istri Abu lahab benar-benar membawa kayu bakar, akan tetapi sebagai kiasan untuk orang yang sering menjadi provokator atas kebencian satu sama lain yang terjadi diantara masyarakat."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَامْرَأَتُهُ حَمَّالَةَ الْحَطَبِ “Dan (begitu pula) istrinya, pembawa kayu bakar.” Ykni: Begitu juga istrinya bersamanya. Ia adalah wanita di Antara tokoh-tokoh Quraisy, tapi kemuliaannya itu tidak bermanfaat baginya, karena ia ikut bersama suaminya dalam permusuhan dan dosa, dan tetap dalam kekufuran. حَمَّالَةَ الْحَطَبِ “pembawa kayu bakar.” Dapat dibaca dengan dinashabkan dan dirofa’kan. Jika dinashobkan (dibca dengan harkat fathah pada ta marbuthahnya) maka ia menjadi hal (kata yang menunjukkan keadaan) bagi امْرَأَة wanita itu. Yakni: dan istrinya memiliki keadaan sebagai pembawa kayu bakar. Atau dimanshubkan sebagai celaan. Karena na’at (sifat) yang diputus (dari yang sifatinya) boleh dinashabkan untuk mengungkapkan celaan. Maknanya: pembawa kayu bakar yang paling tercela. Sedangkan jika dibaca rafa’ (didhommahkan), maka dia menjadi sifat bagi امْرَأَة wanita حَمَّالَةُ الْحَطَبِ [Hammalata] adalah shighah mubalaghoh (hiperbola). Maknanya: ia membawa kayu itu dengan banyak. Para mufassir menyebutkan bahwa ia telah membawa kayu berduri dan menaruhnya di jalan tempat Nabi shallallaahu ‘alaihi wa sallam berjalan, untuk menyakiti Rasul shallallaahu ‘alaihi wa sallam."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Lahab ayat 4: 3-4. Allah mengabarkan bahwa Abu Lahab akan merasakan panasannya api neraka dan diadzab dengan nyala apinya, (dia dan isterinya Ummu Jamil) sebagai balasan permusuhannya dan celaannya kepada Nabi ﷺ, serta penghinaan dan ragu kepada jalan Nabi ﷺ."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Pembawa kayu Bakar dalam bahasa Arab adalah kiasan bagi penyebar fitnah. Isteri Abu Lahab yang bernama Ummu Jamil sama seperti suaminya sangat keras permusuhannya kepada Nabi Muhammad shallallahu 'alaihi wa sallam, disebut sebagai pembawa kayu bakar karena dia selalu menyebarkan fitnah untuk memperburuk citra Nabi Muhammad shallallahu 'alaihi wa sallam dan kaum Muslim. Ada pula yang menafsirkan, bahwa pembawa kayu bakar di sini maksudnya pembawa duri, yakni karena ia biasa menaruh duri di jalan yang dilalui Nabi Muhammad shallallahu 'alaihi wa sallam. Ada pula yang menafsirkan, bahwa ia (istri Abu Lahab) akan membawa kayu bakar untuk menimpakan kepada suaminya di neraka dengan berkalungkan tali dari sabut. Dalam surah ini terdapat salah satu di antara tanda kekuasaan Allah Subhaanahu wa Ta'aala, karena Allah menurunkan surah ini ketika Abu Lahab dan istrinya belum binasa, dan Dia memberitahukan, bahwa keduanya akan disiksa di neraka, termasuk bagian daripadanya adalah bahwa berarti ia tidak akan masuk Islam, ternyata terjadi demikian sebagaimana yang diberitakan oleh Allah Subhaanahu wa Ta'aala Tuhan Yang Mengetahui yang gaib dan nyata."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Lahab Ayat 4",
    "description": "Abu lahab akan masuk neraka, dan demikian pula istrinya, ummu jam'l arw' binti harb bin umayyah, sang pembawa kayu bakar berduri. Dia meletakkannya di sepanjang jalan yang dilalui nabi untuk menjebak beliau. Dia juga gemar menyebar fitnah kepada nabi dan para pengikutnya. 5. Bentuk azab yang akan diterimanya di neraka sesuai dengan perilakunya sendiri. Di lehernya ada tali dari sabut yang dipintal. Dengan tali itu Allah menjerat lehernya dan mengangkatnya tinggi-tinggi, lalu mencampakkannya ke dasar neraka."
  }
]