[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dileher istrinya ada tali yang kuat dari sabut yang kasar dan keras, dia diangkat dengannya di dalam api neraka jahanam kemudian di lemparkan kebawahnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Di lehernya terdapat tali yang kuat ikatannya, menggiringnya menuju Neraka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "5. Pada leher wanita ini terdapat tali yang besar dan keras yang diikatkan padanya dan untuk mengazabnya di neraka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. فِىۡ جِيۡدِهَا حَبۡلٌ مِّنۡ مَّسَدٍ (Yang di lehernya ada tali dari sabut) Makna (المسد) yakni sabut yang dipilin menjadi tali. Wanita ini dahulu memiliki kalung mewah yang terbuat dari batu-batu mulia. Ia berkata: “Demi Laata dan Uzza, aku akan menafkahkan kalung ini untuk memusuhi Muhammad.” Maka balasan baginya adalah Allah menjadikan pada hari kiamat tali itu di lehernya sebagai ganti dari kalungnya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Diriwayatkan bahwasanya Ummu jamil ( istri Abi Lahab ) pernah menjual sebuah kalung dengan harga 10.000 dirham, kemudian ia infakkan hasil penjualannya untuk kebathilan, yang kemudian balasan dari perbuatannya itu adalah : { حَبْلٌ مِنْ مَسَدٍ } tali sabuk yang dipasangkan dilehernya, maka bagaimana dengan orang yang menghadiahkan api rokok untuk orang lain disekitarnya, tidakkah ia berfikir sejenak tentang hadiah (azab) yang akan diterima oleh mulutnya pada hari kiamat ? 2 ). Perhatikanlah ayat berikut : { فِي جِيدِهَا حَبْلٌ مِنْ مَسَدٍ } Allah menjanjikan untuk istri Abu Lahab ancaman azab yang sesuai dengan perbuatannya di dunia, yaitu kalung yang ia kalungkan dilehernya dari api yang dengannya Abu lahab disiksa di neraka jahannam, dan diantara kehinaan kedua insan ini adalah dijadikan untuk sang suami azab yang pedih diatas tangan orang yang paling cinta kepadanya, dan dijadikan darinya sebab atas azab orang yang paling kuat melindunginya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4-5. Begitu juga Istrinya Ummu Jamil, yaitu saudara perempuan Abu Sufyan akan masuk neraka Jahanam bersamanya. Dia adalah wanita yang memikul batang-batang pohon berduri dan meletakkannya di jalan (yang dilewati) Rasulallah SAW untuk menyakitinya. Kata “Hammalah” I’rabnya adalah manshub oleh fiil yang dikira-kirakan, yaitu “Uriidu” (aku menghendaki) atau “Adzummu” (aku mengecam). Di lehernya terdapat tali yang terbuat dari serat yang dililitkan sangat kencang. Dia disiksa dengan itu di dalam neraka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Di lehernya} di lehernya {ada tali dari sabut yang dipintal} Serabut yang diikatkan untuk menggiringnya menuju neraka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3-5. “Kelak dia akan masuk ke dalam api yang bergejolak,” yakni neraka akan mengelilinginya dari segenap penjuru, dia “dan istrinya, pembawa kayu bakar.” Istrinya juga amat menyakiti Rasulullah. Abu lahab dan istrinya saling bahu membahu dalam dosa dan permusuhan. Ia menimpakan keburukan dan berusaha sekuat tenaga menyakiti Rasulullah sehingga dosa-dosanya menumpuk di atas punggungnya, sama seperti orang yang menumpuk kayu bakar dengan tali yang telah disiapkan di lehernya, “dari sabut,” yaitu dari pintalan sabut atau ia membawa kayu bakar di neraka untuk suaminya dengan mengalungi tali dari sabut di lehernya. Bagaimana pun juga dalam ayat ini terdapat tanda-tanda kebesaran Allah yang nyata, karena allah menurunkan surat ini ketika Abu Lahab dan istrinya belum mati. Allah memberitahukan bahwa keduanya akan disiksa di neraka dan itu pasti. Sebagai konsekuensinya, keduanya tidak masuk Islam. Dan terjadilah seperti yang diberitahukan oleh Dzat Yang Maha Mengetahui yang ghaib dan yang nyata."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ فِي جِيدِهَا } Pada lehernya itu dihari kiamat, , { حَبْلٌ مِنْ مَسَدٍ } terikat tali dari api, pada hakikatnya makna \"masad\" adalah sabut yakni tali yang terbuat dari sabut, akan tetapi maksud yang paling tetap untuk ayat ini adalah talinyang terbuat dari api melilit dileher istri Abu lahab. Abu lahab bersama istrinya dikumpulkan oleh Allah pada berbagai macam siksaan, karena keduanya telah mencelakai Rasulullah bersama sahabtnya dalam berdakwah."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "فِي جِيدِهَا حَبْلٌ مِنْ مَسَدٍ “Yang di lehernya ada tali dari sabut.” Al-Jiid: Lehar, al-habl tali dan al-masad: serabut. Yakni: Ia mengalungkan tali yang terbuat dari serabut, ia keluar membawanya ke padang pasir, untuk mengikat bakar yang ia bawa untuk diletakkan di jalan yang dilalui Nabi shallallaahu ‘alaihi wa sallam, na’uudzu billaahi min dzaalik. Ini menunjukkan betapa dangkalnya pemikirannya, ia menghinakan dirinya sendiri. Wanita dari suku Quraisy, di antara suku-suku besar Quraisy, keluar ke padang pasir, dan menngalungkan tali tambang ke lehernya, yang terbuat dari serabut, tetapi ia rela melakukannya demi menyakiti Nabi shallallaahu ‘alaihi wa sallam, nas’aalullaah al-‘aafiyah. Dengan ini telah selesai pembahasan tentang surat ini dengan kemudahan dari Allah ‘Azza Wa Jalla **** ﷻ ﷺ - عز وجل - - تعالى - - عليه السلام - - رضي الله عنه -"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Lahab ayat 5: Kemudian Allah jelaskan bahwa Ummu Jamil akan diikat diseputar lehernya dengan tali yang terbuat dari serabut kayu yang keras hingga binasa dengan adzab pada hari kiamat; Sebab pernah ia membawa tali yang terbuat dari (serabut) pohon yang tajam dan, kemudian di letakkan pada jalan yang dilewati oleh Nabi ﷺ; Maka dengan perbuatannya ini Allah jadikan adzab yang semisal dengannya di neraka jahannam, karena balasan sesuai dengan amalan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Lahab Ayat 5",
    "description": "Bentuk azab yang akan diterimanya di neraka sesuai dengan perilakunya sendiri. Di lehernya ada tali dari sabut yang dipintal. Dengan tali itu Allah menjerat lehernya dan mengangkatnya tinggi-tinggi, lalu mencampakkannya ke dasar neraka. 1. Wahai nabi Muhammad, katakanlah kepada kaum musyrik yang menanyakan sifat dan nasab Allah dengan tujuan mengejek, 'dia lah Allah, yang maha esa. Tidak ada sekutu bagi-Nya. Dia tidak berbilang dalam nama, sifat, dan ketuhanan-Nya."
  }
]