[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka Nuh berdoa kepada Tuhannya, “Aku lemah, tidak sanggup melawan mereka, tolonglah aku dengan menimpakan hukuman dari sisiMu kepada mereka karena kekafiran mereka kepadaMu.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Maka Nuh berdoa kepada Rabbnya dengan berkata, “Sesungguhnya kaumku telah mengalahkan aku dan tidak menerima seruanku, maka menangkanlah aku terhadap mereka dengan menurunkan siksa kepada mereka.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. فَدَعَا رَبَّهُۥٓ أَنِّى مَغْلُوبٌ فَانتَصِرْ (Maka dia mengadu kepada Tuhannya: “bahwasanya aku ini adalah orang yang dikalahkan, oleh sebab itu menangkanlah (aku)”) Yakni balaslah mereka untukku. Nabi Nuh meminta pertolongan terhadap mereka karena ia telah mengetahui kedurhakaan dan kebebalan mereka dalam kesesatan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10. Kemudian Nuh berdoa kepada Tuhannya bahwa sesungguhnya Aku telah dikalahkan: “Kaumku telah mengalahkanku, maka buatlah agamaMu menang (atas mereka), dan balaslah apa yang mereka lakukan kepadaku”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Lalu dia berdoa kepada Tuhannya,“Sesungguhnya aku telah dikalahkan} Aku telah dikalahkan kaumku dengan kedurhakaan mereka, sehingga dia tidak mendengarkanku {maka tolonglah} lalu balaslah mereka dengan azab yang Engkau kirim kepada mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "10. Pada saat itu Nabi Nuh berdoa kepada Rabbnya, “Bahwasanya aku ini adalah orang ynag dikalahkan, oleh sebab itu tolonglah (aku),” sebab hanya sedikit yang beriman dari kaumnya, mereka tidak memiliki kemampuan untuk melawan kaum mereka, “maka tolonglah (aku),” dari mereka. Dalam ayat lain Nuh berkata, \"Ya Tuhanku, janganlah Engkau biarkan seorangpun di antara orang-orang kafir itu tinggal di atas bumi.” -Nuh:26-"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qamar ayat 10: Ketika telah keterlaluan (mereka) menyakiti Nuh, Nuh berdoa kepada Tuhannya : Wahai Tuhanku sungguh aku orang yang lemah dalam bertarung terhadap tipu daya orang-orang kafir yang mendustakan, maka tolonglah aku wahai Tuhanku atas mereka dan balaslah untuk mereka. Allah berkata ketika Nuh putus asa dari keimanan mereka (kaumnya) : أَنَّهُۥ لَن يُؤْمِنَ مِن قَوْمِكَ إِلَّا مَن قَدْ ءَامَنَ, yang artinya : bahwasanya sekali-kali tidak akan beriman di antara kaummu, kecuali orang yang telah beriman (saja). {Hud : 36}."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni tidak ada kemampuan pada Beliau untuk membela diri, karena tidak ada yang mengikuti Beliau kecuali sedikit sekali. Dalam ayat lain Nabi Nuh ‘alaihis salam berdoa, “Ya Tuhanku, janganlah Engkau biarkan seorangpun di antara orang-orang kafir itu tinggal di atas bumi.” (Terj. Nuh: 26) Maka Allah Subhaanahu wa Ta'aala mengabulkan doanya dan menolongnya terhadap kaumnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qamar Ayat 10",
    "description": "Pembangkangan kaum nabi nuh makin menjadi. Meski sudah didakwahi sekian ratus tahun, hanya segelintir kaumnya yang beriman. Maka dia menengadahkan tangan, mengadu kepada tuhannya, 'sesungguhnya aku telah dikalahkan dengan keingkaran dan perlakuan buruk kaumku, maka tolonglah aku, wahai tuhan pemeliharaku. '11-12. Allah meperkenankan doa nabi nuh, lalu kami bukakan pintu-pintu langit, yaitu awan yang mencurahkan hujan dan membanjiri permukiman kaum nabi nuh dengan air yang tercurah deras, dan selain itu kami jadikan bumi menyemburkan mata-mata air. Karena dahsyatnya peristiwa itu, maka bertemulah air-air yang tercurah dari langit dan tersembur dari bumi itu sehingga meluap dan menimbulkan keadaan dan bencana yang telah ditetapkan untuk menghukum kaum yang mengingkari rasulnya."
  }
]