[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "11-12. Kami mengabulkan doa Nuh, Kami membuka pintu-pintu langit dengan air hujan lebat. Kami membelah bumi yang memancarkan mata air yang deras. Air langit bertemu dengan air bumi sehingga membinasakan mereka yang sudah Allah tetapkan bagi mereka sebagai balasan atas kesyirikan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Maka Kami buka pintu-pintu langit dengan air yang mengucur deras mengalir."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "11. فَفَتَحْنَآ أَبْوٰبَ السَّمَآءِ بِمَآءٍ مُّنْهَمِرٍ (Maka Kami bukakan pintu-pintu langit dengan (menurunkan) air yang tercurah) Yakni air yang tercurah dengan deras."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Lalu kami bukakan pintu-pintu langit dan menurunkan hujan yang sangat lebat dan berkelanjutan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Lalu Kami membukakan pintu-pintu langit dengan air yang tercurah} tercurah terus-menerus"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11. Allah mengabulkan doanya dan memberinya pertolongan atas kaumnya seraya berfirman, “Maka Kami bukakan pintu-pintu langit dengan (menurunkan) air yang tercurah,” yaitu sangat lebat dan terus-menerus."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qamar ayat 11: 11-12. Allah mengabarkan mengabulkan doa Nuh, maka Allah buka pintu-pintu langit, atau awan dan ditimpakan air dari langit dengan cucuran yang banyak, dan meluaplah bumi dan bumi pada saat itu memuntahkan air yang sangat banyak deras. Maka bertemulah air dari langit dan dari bumi atas ketetapan Allah dan kuasa-Nya, dan air itu membinasakan ereka orang-orang kafir yang sombong."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qamar Ayat 11",
    "description": "11-12. Allah meperkenankan doa nabi nuh, lalu kami bukakan pintu-pintu langit, yaitu awan yang mencurahkan hujan dan membanjiri permukiman kaum nabi nuh dengan air yang tercurah deras, dan selain itu kami jadikan bumi menyemburkan mata-mata air. Karena dahsyatnya peristiwa itu, maka bertemulah air-air yang tercurah dari langit dan tersembur dari bumi itu sehingga meluap dan menimbulkan keadaan dan bencana yang telah ditetapkan untuk menghukum kaum yang mengingkari rasulnya"
  }
]