[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "11-12. Kami mengabulkan doa Nuh, Kami membuka pintu-pintu langit dengan air hujan lebat. Kami membelah bumi yang memancarkan mata air yang deras. Air langit bertemu dengan air bumi sehingga membinasakan mereka yang sudah Allah tetapkan bagi mereka sebagai balasan atas kesyirikan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Dan Kami pancarkan air dari bumi sehingga menjadi mata air-mata air yang memancarkan air. Lalu air yang turun dari langit bertemu dengan air yang memancar dari bumi atas perintah dari Allah yang telah ditakdirkan dari semula, kemudian Allah menenggelamkan semuanya kecuali yang diselamatkan oleh Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "12. وَفَجَّرْنَا الْأَرْضَ عُيُونًا (Dan Kami jadikan bumi memancarkan mata air-mata air) Yakni Kami jadikan bumi menjadi mata air yang memancar. فَالْتَقَى الْمَآءُ عَلَىٰٓ أَمْرٍ قَدْ قُدِرَ (maka bertemulah air-air itu untuk suatu urusan yang sungguh telah ditetapkan) Yakni air dari langit bertemu dengan air dari bumi untuk urusan yang telah ditetapkan bagi mereka. Qatadah mengatakan bahwa Allah mentakdirkan mereka akan tenggelam akibat kekafiran mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12. Dan Kami pancarkan mata air-mata air bumi sehingga air langit dan bumi saling bertemu sesuai perintah yang telah ditetapkan dan ditakdirkan oleh Allah dahulu dan itu adalah banjir bandang. {‘Ala amr} untuk menunjukkan telah berlakunya suatu perintah (Allah) yaitu menenggelamkan mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kami menjadikan bumi menyemburkan} Kami menjadikan memancarkan {banyak mata air. Maka berkumpullah air itu} maka air langit dan langit bumi itu bertemu {sesuai perintah yang telah ditetapkan} takdir Allah pada zaman azali, yaitu pembinasaan mereka dengan banjir bandang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "12. “Dan kami jadikan bumi memancarkan mata air-mata air,” langit pun menurunkan hujan yang tidak seperti biasanya dan seluruh bagian bumi juga memancarkan air hingga tungku pun memancarkan air sebab tungku adalah tempat perapian. “Maka bertemulah api-api itu,” air dari langit dan air dari bumi. “untuk satu urusan,” dari Allah untuk sesuatu “yang sungguh telah ditetapkan,” yaitu telah ditulis Allah sejak zaman azali serta ditakdirkan sebagai hukuman untuk mereka yang zhalim dan melampaui batas."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qamar ayat 12: 11-12. Allah mengabarkan mengabulkan doa Nuh, maka Allah buka pintu-pintu langit, atau awan dan ditimpakan air dari langit dengan cucuran yang banyak, dan meluaplah bumi dan bumi pada saat itu memuntahkan air yang sangat banyak deras. Maka bertemulah air dari langit dan dari bumi atas ketetapan Allah dan kuasa-Nya, dan air itu membinasakan ereka orang-orang kafir yang sombong."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Langit menurunkan air yang di luar kebiasaan dan bumi pun menyemburkan air sampai bagian dapur yang biasanya tidak ada air karena menjadi tempat api malah memancarkan air. Baik air dari langit maupun air dari bumi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qamar Ayat 12",
    "description": "11-12. Allah meperkenankan doa nabi nuh, lalu kami bukakan pintu-pintu langit, yaitu awan yang mencurahkan hujan dan membanjiri permukiman kaum nabi nuh dengan air yang tercurah deras, dan selain itu kami jadikan bumi menyemburkan mata-mata air. Karena dahsyatnya peristiwa itu, maka bertemulah air-air yang tercurah dari langit dan tersembur dari bumi itu sehingga meluap dan menimbulkan keadaan dan bencana yang telah ditetapkan untuk menghukum kaum yang mengingkari rasulnya. 13-14. Limpahan air dari langit dan pancarannya dari bumi merupakan azab bagi kaum nabi nuh yang ingkar. Dan kami angkut serta selamatkan dia bersama orang-orang yang beriman ke atas kapal yang terbuat dari papan yang disusun dan diikat dengan pasak, yang berlayar dengan pemeliharaan dan pengawasan kami, sebagai ganjaran dan balasan bagi orang yang telah diingkari oleh kaumnya."
  }
]