[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "13-14. Kami mengangkat Nuh dan orang-orang (yang beriman) bersamanya dalam sebuah kapal yang terbuat dari papan-papan kayu yang disatukan dengan pasak-pasak, yang berjalan dibawah pengawasan Mata Kami dan penjagaan dari Kami. Kami menenggelamkan orang-orang yang mendustakan itu sebagai balasan bagi mereka atas kekafiran mereka dan pertolongan kepada Nuh. Ayat ini menetapkan sifat dua mata bagi Allah sesuai dengan kemuliaanNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Kapal ini berlayar di atas ombak yang bergelora dalam pantauan dan penjagaan Kami, untuk membela Nuh yang didustakan oleh kaumnya, dan mereka kafir terhadap apa yang dibawanya dari sisi Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "14. تَجْرِى بِأَعْيُنِنَا (Yang berlayar dengan pemeliharaan Kami) Yakni dengan pengawasan dan penjagaan Kami. جَزَآءً لِّمَن كَانَ كُفِرَ(sebagai balasan bagi orang yang diingkari (Nuh)) Yakni balasan untuk Nabi Nuh, dan dia sebenarnya adalah kenikmatan bagi kaumnya namun mereka mengingkarinya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14. Kapal itu berlayar dengan perlindungan dan penjagaan Kami, sedangkan mereka (orang-orang kafir) ditenggelamkan sebagai hukuman atas kekufuran dan penentangan mereka terhadap Nuh serta pendustaan mereka terhadap risalahnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{yang berlayar dengan pengawasan Kami} dengan pengawasan dari Kami {sebagai balasan bagi orang yang telah diingkari} Kami telah melakukan itu kepada mereka, sebagai balasan bagi orang yang diingkari dan dilanggar perintahnya yaitu Nuh AS"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "14. “Yang berlayar dengan (pengawasan) Mata Kami,” yakni berlayar membawa Nuh dan orang-orang yang beriman bersama beliau serta berbagai jenis hewan yang dibawa dengan pengawasan dan penjagaan dari Allah agar tidak tenggelam, serta berada di bawah pengawasan malaikat-malaikat yang ditugaskan oleh Allah dan Allah adalah sebaik-baik penjaga dan yang menangani. “Sebagai balasan bagi orang-orang yang diingkari (Nuh),” artinya, Kami perlakukan Nuh seperti yang Kami lakukan terhadap orang-orang yanhg selamat dari air bah sebagai balasan baginya karena didustakan dan diingkari oleh kaumnya. Nabi Nuh bersabar dalam menyeru mereka dan tetap berjalan di atas perintah Allah sehingga tidak ada yang bisa menentang dan menghalanginya dari jalan dakwah, sebagaimana yang difirmankan Allah dalam ayat lain, “Difirmankan: \"Hai Nuh, turunlah dengan selamat sejahtera dan penuh keberkatan dari Kami atasmu dan atas umat-umat (yang mukmin) dari orang-orang yang bersamamu. Dan ada (pula) umat-umat yang Kami beri kesenangan pada mereka (dalam kehidupan dunia), kemudian mereka akan ditimpa azab yang pedih dari Kami\"”-Hud:48- Kemungkinan maksud ayat ini adalah Kami membinasakan kaum Nabi Nuh dan Kami timpakan azab dan penghinaan kepada mereka sebagai balasan atas kekufuran dan pembangkangan mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qamar ayat 14: 13-14. Allah menjelaskan bahwa Allah menyelamatkan Nuh dan orang-orang yang beriman kepadanya, yang dia bawa di atas kapal yang terbuat dari kayu yang besar kokoh dengan paku-paku yang tertancap, kapal ini berjalan dengan pertolongan Allah dan Allah yang menjaganya. Allah mengabarkan bahwa orang-orang kafir ditenggelamkan yang mereka mengingkari hari pembalasan bagi kekufuran mereka dan kedustaan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni berlayar membawa Nabi Nuh ‘alaihis salam dan orang-orang yang beriman bersamanya serta membawa hewan yang berpasang-pasangan dengan pengawasan dari Allah Subhaanahu wa Ta'aala dan penjagaan-Nya, dan Dia sebaik-baik Pemelihara dan Penjaga. Yaitu Nuh ‘alaihis salam. Yakni Allah Subhaanahu wa Ta'aala melakukan hal itu; menyelamatkan dia (Nabi Nuh) dari banjir yang merata adalah sebagai balasan untuknya karena dia telah didustakan kaumnya, namun ia tetap bersabar dengannya dan tetap berada di atas perintah Alah Subhaanahu wa Ta'aala meskipun orang-orang menghalangi dan mencegahnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qamar Ayat 14",
    "description": "13-14. Limpahan air dari langit dan pancarannya dari bumi merupakan azab bagi kaum nabi nuh yang ingkar. Dan kami angkut serta selamatkan dia bersama orang-orang yang beriman ke atas kapal yang terbuat dari papan yang disusun dan diikat dengan pasak, yang berlayar dengan pemeliharaan dan pengawasan kami, sebagai ganjaran dan balasan bagi orang yang telah diingkari oleh kaumnya. 15-16. Dan sungguh, kapal itu telah kami awetkan dan kami jadikan sebagai tanda dan pelajaran bagi kaum yang datang kemudian. Maka, adakah orang yang mau dan bersungguh-sungguh mengambil pelajaran dari peristiwa itu' bila hal itu tidak menyadarkannya untuk menaati ajakan rasul, maka perhatikan betul-betul betapa dahsyatnya azab-ku dan peringatan-ku."
  }
]