[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "15-16. Sungguh Kami membiarkan kisah Nuh dan kaumnya, sebagai bahan pelajaran dan bukti atas Kuasa Kami bagi orang-orang sesudah Nuh agar mereka mengambil nasihat dan pelajaran dari apa yang menimpa umat yang kafir kepada tuhannya. Maka adakah orang yang mengambil nasihat dan pelajaran? Bagaimana azab dan siksaKu atas orang-orang yang mendustakanKu dan tidak beriman kepada para utusanKu, apakah mereka mengambil pelajaran dari apa yang terjadi? Sesungguhnya azabKu itu teramat keras dan menyakitkan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Dan sesungguhnya Kami telah jadikan siksa yang kami timpakan kepada mereka itu sebagai palajaran dan nasihat, lalu adakah orang yang mau mengambil pelajaran dari hal itu?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "15-16. Sungguh Kami jadikan kisah banjir besar itu sebagai pelajaran, apakah ada orang yang mendapat pelajaran darinya? Bagaimana azab dan peringatan-Ku ketika itu bagi orang yang mendustakan para rasul-Ku dan tidak mengambil pelajaran dari ayat-ayat-Ku?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15. وَلَقَد تَّرَكْنٰهَآ ءَايَةً (Dan sesungguhnya telah Kami jadikan kapal itu sebagai pelajaran) Yakni kapal itu Allah kekalkan di atas gunung Judiy sebagai pelajaran bagi orang-orang yang mau mengambil pelajaran. Pendapat lain mengatakan maknanya adalah Kami telah menjadikan siksaan yang Kami timpakan kepada mereka sebagai ibrah dan pelajaran. فَهَلْ مِن مُّدَّكِرٍ(maka adakah orang yang mau mengambil pelajaran?) Yakni apakah ada orang yang mau mengambil pelajaran dari ayat ini?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "15. Sungguh kami abadikan cerita tentang kapal itu sebagai pelajaran dan petunjuk bagi orang yang mau mengambil pelajaran dari hal itu. Lalu apakah ada yang mengingat dan mengambil pelajaran darinya?!"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sungguh Kami benar-benar telah menjadikannya sebagai tanda} Kami mengabadikan perbuatan yang telah Kami lakukan kepada mereka ini sebagai teladan dan pelajaran {Maka adakah orang yang mau mengambil pelajaran} orang yang mengambil teladan dan mengambil pelajaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "15. “Dan sungguh telah Kami jadikan kapal itu sebagai pelajaran, maka adakah orang yang mau mengambil pelajaran?” artinya, Kami jadikan kisah Nabi Nuh dan kaumnya sebagai tanda-tanda kebesaran yang bisa dijadikan pelajaran. Siapa saja yang durhaka serta menentang para rasul pasti akan dibinasakan oleh Allah dengan siksaan yang keras. Atau kata ganti dalam ayat ini kembali pada perahu dan sejenisnya. Asal mula pembuatannya adalah pengajaran Allah untuk RasulNya Nuh, kemudian Allah mengabadikan perahu itu tetap ada di antara manusia, agar hal itu menunjukkan rahmat dan pertolonganNya terhadap makhlukNya serta sempurnanya Kuasa Allah dan indahnya ciptaanNya. “Maka adakah orang yang mau mengambil pelajaran?” artinya adakah orang yang mengambil pelajaran dari tanda-tanda kebesaran Allah dengan menggunakan akal dan pikirannya ketika tanda-tanda kebesaran itu berada di atas puncak kejelasan dan kemudahan?"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qamar ayat 15: Allah mengabarkan bahwasanya Dia mengabadikan kisah Nuh bersama dengan kaumnya sebagai pelajaran dan bukti bagi siapa yang datang setelah mereka, maka apakah ada yang mau mengambil nasihat dan pelajaran ?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni Kami tinggalkan pada kisah Nuh bersama kaumnya ayat bagi orang-orang yang mengambil pelajaran, bahwa orang-orang yang mendurhakai Rasul dan membangkang terhadapnya, maka Allah Subhaanahu wa Ta'aala akan membinasakan mereka dengan azab yang merata lagi keras. Atau dhamir (kata ganti nama) dari kata “Haa” kembalinya kepada kapal yang dibuat Nabi Nuh ‘alaihis salam, dan bahwa asal pembuatannya adalah pengajaran dari Allah Subhaanahu wa Ta'aala kepada hamba-Nya Nuh ‘alaihis salam untuk menunjukkan rahmat-Nya kepada makhluk-Nya dan perhatian-Nya, sempurnanya kekuasaan-Nya dan indah-Nya ciptaan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qamar Ayat 15",
    "description": "15-16. Dan sungguh, kapal itu telah kami awetkan dan kami jadikan sebagai tanda dan pelajaran bagi kaum yang datang kemudian. Maka, adakah orang yang mau dan bersungguh-sungguh mengambil pelajaran dari peristiwa itu' bila hal itu tidak menyadarkannya untuk menaati ajakan rasul, maka perhatikan betul-betul betapa dahsyatnya azab-ku dan peringatan-ku"
  }
]