[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sungguh Kami telah memudahkan lafazh al-Quran untuk dibaca dan dihafal, serta memudahkan makna-maknanya untuk dipahami dan direnungkan, bagi siapa yang ingin memahami dan mengambil pelajaran. Adakah orang yang mengambil pelajaran? Dalam ayat ini dan ayat-ayat lain yang serupa terkandung dorongan memperbanyak membaca al-Quran, mempelajarinya dan mengajarkannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Dan sungguh telah Kami mudahkan Al-Qur`ān untuk diingat dan diambil pelajarannya, maka adakah orang yang mengambil petuah dari pelajaran dan nasihat yang ada di dalamnya?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "17. Sungguh Kami telah menjadikan al-Qur’an mudah untuk ditadabburi, dibaca, dan dihafal bagi orang yang ingin menjadikannya peringatan. Maka adakah orang yang menjadikannya pelajaran?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "17. وَلَقَدْ يَسَّرْنَا الْقُرْءَانَ لِلذِّكْرِ (Dan sesungguhnya telah Kami mudahkan Al-Quran untuk pelajaran) Yakni Kami mudahkan al-Qur’an untuk dihafal, dan Kami akan bantu orang yang ingin menghafalnya. Pendapat lain mengatakan, yakni Kami mudahkan untuk diambil pelajaran dan ibrahnya. فَهَلْ مِن مُّدَّكِرٍ (maka adakah orang yang mengambil pelajaran?) Yakni adakah orang yang mau mengambil pelajaran darinya? Dalam ayat ini terdapat dorongan untuk mempelajari al-Qur’an dan memperbanyak membacanya serta bersegera dalam mempelajarinya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17. Kami mudahkan Al-Quran itu untuk dihafal, diingat dan digunakan sebagai nasehat. Lalu apakah ada yang mengingat, mempelajari dan mengambil nasehat-nasehatnya?!"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sungguh Kami benar-benar telah memudahkan} Kami memudahkan {Al-Qur’an sebagai pelajaran} peringatan dan pelajaran {Maka adakah orang yang mau mengambil pelajaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17. “Dan sungguh telah Kami mudahkan al-Quran untuk pelajaran, maka adakah orang yang mengambil pelajaran?” artinya, Kami mudahkan kata-kata al-Quran untuk dihafal dan dijelaskan untuk dipahami dan diketahui, karena al-Quran adalah kata-kata terbaik, maknanya paling benar dan penjelasannya paling gamblang. Siapa saja yang mempelajarinya, maka akan diberi kemudahan oleh Allah untuk mencapai maksudnya secara amat mudah. Al-Quran adalah peringatan menyeluruh untuk semua hal yang perlu diingat oleh seluruh alam, berupa halal, haram, berbagai hukum, perintah, larangan, hukum balasan, nasihat, pelajaran, akidah yang bermanfaat dan berita-berita benar, serta paling luhur secara mutlak. Al-Quran adalah ilmu yang bermanfaat jika dicari oleh seseorang, akan diberi pertolongan. Sebagian ulama -Salaf mengatakan tentang ayat ini, “Tidaklah orang menuntut ilmu, melainkan pasti ditolong.” Karena itu Allah menyeru hamba-hambaNya untuk mengarah padaNya dan mengingat FirmanNya, “Maka adakah yang mau mengambil pelajaran?”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qamar ayat 17: Allah menjelaskan dari yang nampak pada karunia dan rahmat-Nya, dimana Dia telah menadikan Al Qur’an mudah dan ringan; Yang ia diturunkan dengan bahasa yang fasih dan sesuai dengan lisan, Al Qur’an adalah fasih, terang dan jelas. Oleh karenanya didapati siapa yang mereka berharap islam dari orang-orang non arab, akan paham dari setiap rahasinya dan kemudahannya; Maka adakah yang mengambil nasihat dan pelajaran dari kisah-kisah tersebut ?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni untuk dibaca, dihapal, dipahami, dipelajari dan direnungi. Allah Subhaanahu wa Ta'aala telah memudahkan lafaznya untuk dibaca dan dihapal, maknanya untuk dipahami dan diiketahui. Hal itu, karena Al Qur’an adalah sebaik-baik perkataan, paling benar maknanya dan paling jelas keterangannya. Ibnu Abbas radhiyallahu 'anhuma berkata, “Kalau bukan karena Allah telah memudahkan Al Qur’an pada lisan manusia, tentu tidak satu pun makhluk yang dapat berbicara dengan firman Allah ‘Azza wa Jalla.” Oleh karena itu, siapa saja yang mendatanginya, maka Allah Subhaanahu wa Ta'aala akan memudahkan maksudnya itu semudah-mudahnya. Adz Dzikr (pelajaran atau peringatan) di ayat ini mencakup semua yang diingat dan dipelajari oleh orang-orang yang berilmu seperti halal-haram, hukum-hukum perintah dan larangan, hukum-hukum jaza’i (pembalasan), nasihat, pelajaran, aqidah yang bermanfaat dan berita-berita yang benar. Sebagian kaum salaf berkata tentang ayat ini, “Adakah orang yang ingin mengetahui ilmu lalu dibantu untuk memperolehnya?” Oleh karena itulah Allah mengajak hamba-hamba-Nya untuk mendatangi Al Qur’an dan mempelajarinya dengan firman-Nya, “Maka adakah orang yang mau mengambil pelajaran?"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qamar Ayat 17",
    "description": "Dan sungguh, telah kami mudahkan Al-Qur'an untuk menjadi pelajaran dan peringatan bagi semua manusia, maka adakah di antara mereka yang mau mengambil pelajaran sehingga Allah melimpahkan karunia kepada-Nya dan membantunya memahami kitab suci ini'18. Sebagaimana kaum nabi nuh, kaum 'ad pun mengingkari dakwah nabi mereka, nabi hud. Kaum 'ad pun telah mendustakan nabi hud yang telah kami utus kepada mereka. Kami binasakan mereka, maka lihatlah betapa dahsyatnya azab-ku dan peringatan-ku yang telah kusampaikan melalui rasul-rasul-ku."
  }
]