[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kaum Ad telah mendustakan Hud, maka Kami mengazab mereka. Bagaimana azabKu atas mereka karena kekafiran mereka dan hukumanKu atas pendustaan mereka terhadap utusan mereka dan tidak beriman kepadanya? Sesungguhnya ia amat pedih dan menyakitkan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Kaum 'Ād telah mendustakan Rasul mereka, Hūd -'alaihissalām-. Maka perhatikanlah -wahai penduduk Makkah- bagaimana siksa-Ku terhadap mereka? Dan bagaimana peringatan-Ku terhadap yang lain dengan siksaan terhadap mereka?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "18-21. Kaum ‘Ad telah mendustakan Nabi mereka, Hud; sehingga Kami membinasakan mereka. Maka bagaimana azab dan peringatan-Ku ketika itu bagi orang yang kafir terhadap-Ku? Kami telah mengirim kepada mereka angin yang sangat dingin pada hari yang penuh kesulitan dan terus-menerus memberi mereka azab dan siksaan. Angin itu menghempaskan mereka dari tempat tinggal mereka, lalu menjatuhkan mereka dengan kepala yang jatuh terlebih dahulu ke tanah, sehingga mereka menjadi seperti pohon kurma yang tercabut dari akarnya. Maka bagaimana azab dan peringatan-Ku ketika itu bagi mereka?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "18. Kabilah ‘Aad mendustakan nabi mereka yaitu Hud AS. Maka lihatlah bagaimana azab dan ancamanKu terhadap mereka?!"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kaum ‘Ad telah mendustakan Maka betapa dahsyatnya azab dan peringatanKu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "18-19. ‘Ad adalah kabilah terkenal di Yaman, Allah mengutus Nabi Hud kepada mereka yang menyerukan mereka untuk mengesakan dan menyembah Allah, mereka mendustakannya, kemudian Allah mengutus “angin yang sangat kencang,” yaitu sangat kuat, “pada hari nahas,” yakni kerasnya siksaan dan penderitaan begitu dahsyat menimpa mereka “yang terus menerus,” selama tujuh malam delapan hari berturut-turut."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qamar ayat 18: Allah mengabarkan kaum Ad yang mendustakan Nabi mereka Hud, dan tidak beriman kepadanya, dan tidak mengambil pelajaran dari peringatannya, apakah kalian tahu keadaan mereka ketika diadzab dan dibinasakan? Sungguh mereka ditimpakan adzab yang pedih."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu Nabi mereka Hud ‘alaihis salam. Kaum ‘Aad adalah sebuah kabilah yang tinggal di Yaman, Allah mengutus kepada mereka Nabi Hud ‘alaihis salam mengajak mereka untuk beribadah kepada Allah, tetapi mereka malah mendustakannya, maka Allah Subhaanahu wa Ta'aala mengirimkan kepada mereka angin yang sangat kencang selama tujuh malam dan delapan hari terus-menerus yang membuat mereka terangkat ke udara lalu mereka dijatuhkan ke bumi di atas kepalanya sehingga kepala mereka pecah dan mereka mati dengan kepala terpisah dari jasad."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qamar Ayat 18",
    "description": "Sebagaimana kaum nabi nuh, kaum 'ad pun mengingkari dakwah nabi mereka, nabi hud. Kaum 'ad pun telah mendustakan nabi hud yang telah kami utus kepada mereka. Kami binasakan mereka, maka lihatlah betapa dahsyatnya azab-ku dan peringatan-ku yang telah kusampaikan melalui rasul-rasul-ku. 19. Sebagai hukuman atas keingkaran kaum 'ad, sesungguhnya kami telah mengembuskan angin yang sangat kencang kepada mereka pada hari yang mereka anggap sebagai hari nahas. Embusan yang tidak ada bandingannya itu terjadi secara terus-menerus."
  }
]