[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bila orang-orang musyrik itu melihat bukti dan dalil atas kebenaran Rasul Muhammad, mereka tetap berpaling, tidak beriman, dan tidak membenarkan, sebaliknya, mereka terus mengingkari dan mendustakan. Dan mereka berkata sesudah bukti itu Nampak, “Ini hanya sihir yang akan sirna dan lenyap, tidak akan tetap.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Dan jika orang-orang musyrik melihat dalil dan bukti kebenaran Nabi -ṣallallāhu 'alaihi wa sallam-, mereka berpaling dari menerimanya dan berkata, “Hujah-hujah dan bukti-bukti yang kami saksikan merupakan sihir yang batil.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. وَإِن يَرَوْا۟ ءَايَةً (Dan jika mereka (orang-orang musyrikin) melihat suatu tanda (mukjizat)) Para ahli tafsir mengatakan bahwa ketika bulan telah terbelah, orang-orang musyrik berkata: “Kami telah disihir oleh Muhammad.” Maka Allah berfiman: “وَإِن يَرَوْا۟ ءَايَةً” يُعْرِضُوا۟( mereka berpaling) Yakni enggan untuk percaya dan mengimani mukjizat itu. وَيَقُولُوا۟ سِحْرٌ مُّسْتَمِرٌّ (dan berkata: “(Ini adalah) sihir yang terus menerus”) Yakni sihir yang sangat kuat yang mengalahkan sihir-sihir lainnya. Pendapat lain mengatakan, yakni yang terus berlanjut."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Saat orang-orang musyrik melihat mukjizat yang menunjukkan kebenaran Nabi SAW, mereka menolak membenarkannya dan beriman kepadanya. Mereka berkata: “Ini adalah sihir yang sangat sempurna"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Jika mereka melihat suatu tanda, mereka berpaling dan berkata,“sihir yang terus-menerus\"} kepalsuan yang akan lenyap, tidak akan ada selamanya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2. Ini bukanlah satu-satunya pengingkaran mereka terhadap tanda-tanda kebesaran Allah, semua tanda-tanda kebesaran yang datang pada mereka, mereka selalu siap untuk mendustakan dan menolaknya, karena itulah Allah berfirman, “Dan jika mereka (orang-orang musyrikin) melihat sesuatu tanda (mukjizat), mereka berpaling,” tidak disebutkan dhamir yang kembali pada terbelahnya bulan, karena dalam ayat ini Allah tidak berfirman, “JIka mereka melihat terbelahnya bulan,” namun “Dan jika mereka (orang-orang musyrikin) melihat sesuatu tanda (mukjizat), mereka berpaling,” karena niat mereka bukanlah untuk mengikuti kebenaran dan petunjuk tapi mengikuti hawa nafsu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qamar ayat 2: 2-3. Ketahuilah wahai Nabi Allah bahwa mereka orang-orang musyrik sebagaiamana yang mereka melihat dari tanda-tanda mukjizat yang menunjukkan kebenaran akan dirimu, akan tetapi mereka pasti akan menolak dan tidak akan beriman kepada Allah dan Rasul-Nya ﷺ; Bahkan mereka akan berkata dengan pengingkaran : Sungguh yang engkau datangkan kepada kami tidak lain hanyalah sihir. Kemudian Allah mengabarkan bahwa mereka mendustakan Nabi ﷺ, dan mengikuti dakwahan dari hawa nafsu mereka berupa pengingkaran. Kemudian Allah menjelaskan bahwa sesungguhnya setiap urusan itu pasti telah ada ketetapan akhirnya. Inilah akhir dari orang-orang yang kafir, yang di akhir kehidupannya mereka akan merugi, adapun urusan orang-orang yang beriman akan berakhir dengan kemenangan dan ridha Allah bagi mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ucapan dusta mereka ini hanyalah laris di tengah-tengah orang yang kurang akal dan tersesat dari petunjuk, dan sesungguhnya hal ini bukanlah pengingkaran terhadap ayat (mukjizat) itu saja, bahkan setiap ayat yang datang kepada mereka, mereka telah mempersiapkan diri untuk menghadapinya dengan kebatilan dan penolakan terhadapnya. Oleh karena itulah Allah Subhaanahu wa Ta'aala berfirman di ayat selanjutnya, “Dan jika mereka (orang-orang musyrikin) melihat suatu tanda (mukjizat), mereka berpaling dan berkata, \"(Ini adalah) sihir yang terus menerus.”Allah Subhaanahu wa Ta'aala tidak menyebutkan, “Wa iy yarauhaa” tetapi menyebutkan, “Wa iy yarau aayat…dst.” Yang menunjukkan bahwa setiap ayat yang datang kepada mereka, maka mereka berpaling darinya, dan hal ini menunjukkan bahwa tidak ada maksud mereka untuk mencari yang hak dan mencari petunjuk, akan tetapi maksud mereka adalah mengikuti hawa nafsunya sebagaimana firman-Nya di ayat selanjutnya, “Dan mereka mendutakan (Nabi Muhammad shallallahu 'alaihi wa sallam) dan mengikuti keinginannya,”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qamar Ayat 2",
    "description": "Orang musyrik selalu enggan memercayai berita yang dibawa oleh nabi Muhammad. Dan jika mereka melihat dengan mata kepala satu tanda dan mukjizat yang membuktikan kebenaran ajaran beliau, mereka tetap berpaling seraya menolak kebenaran itu dan berkata, 'semua yang terjadi ini sesungguhnya hanya sihir yang bersifat terus-menerus. '3. Demikianlah sikap orang musyrik, dan mereka memang senantiasa mendustakan kebenaran dari-Nya. Mereka cenderung menyimpang dari fitrah dan mengikuti keinginannya yang menjerumuskan mereka pada kesesatan, padahal setiap urusan yang terjadi pasti telah ada ketetapannya."
  }
]