[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "19-20. Sesungguhnya Kami mengutus kepada mereka angin yang sangat dingin di hari kesialan bagi mereka yang membawa azab dan kebinasaan. Angin itu menerbangkan mereka dari bumi, lalu mencampakkan mereka tersungkur dengan leher patah dan terpenggal dari tubuh mereka, ia meninggalkan mereka seperti batang pohon kurma yang terpisah dari pangkalnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "20. Yang mencabut manusia dari bumi dan melemparkan mereka dengan kepala duluan, seakan-akan mereka adalah batang pohon kurma yang tercabut sampai ke akar-akarnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "20. تَنزِعُ النَّاسَ (yang menggelimpangkan manusia) Mujahid mengatakan bahwa angin itu menghempaskan mereka dari tanah dan menjatukan mereka dengan posisi kepala terlebih dahulu, sehingga leher mereka hancur dan kepala mereka terlepas dari tubuh mereka. Pendapat lain mengatakan bahwa angin itu menghempaskan manusia dari rumah-rumah mereka. كَأَنَّهُمْ أَعْجَازُ نَخْلٍ مُّنقَعِرٍ (seakan-akan mereka pokok korma yang tumbang) Allah menyerupakan tubuh mereka yang jangkung ketika dihempas oleh angin dan dilemparkan di atas wajah mereka dengan pohon-pohon kurma yang tidak memiliki kepala yang tumbah di atas tanah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20. Angin yang menghempaskan manusia dari tempat-tempat mereka, seakan-akan mereka adalah akar-akar pohon kurma yang dicabut dari tanahnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{membuat manusia bergelimpangan} mengangkat manusia dari bumi lalu melemparkan mereka di atas kepala mereka, lalu menghantam leher mereka {seakan-akan mereka itu pohon-pohon kurma} batang pohon kurma {yang tumbang dengan akar-akarnya} yang tumbang dari akarnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "20. “Yang menggelimpangkan manusia,” karena terlalu kerasnya hingga terpelanting ke atas dan terhempas ke tanah dan membinasakan mereka sehingga mereka menjadi “seakan-akan mereka pokok kurma yang tumbang,” artinya bangkai mereka setelah binasa seperti pangkal kurma yang tumbang yang tercabut oleh angin kencang dan jatuh ke tanah. Alangkah hinanya makhluk jika mendurhakai perintah Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qamar ayat 20: Allah menjelaskan bahwa angin ini mencerai beraikan manusia karena saking dahsyatnya dan menumbangkan mereka serta mengangkat mereka kemudian meluluh lantahkan leher-leher mereka dan membinasakan mereka, mereka menjadi mayat hidup setelah binasa sebgaimana batang pohon kurma yang ditimpa angin besar sehingga tercaput dari akarnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sungguh lemah keadaan mereka, padahal sebelumnya mereka (kaum ‘Aad) mengatakan, “Siapakah yang lebih kuat daripada kami?” Mereka tidak menyadari, bahwa Allah yang menciptakan mereka tentu lebih kuat dari mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qamar Ayat 20",
    "description": "20-21. Allah mengembuskan angin mahadahsyat yang membuat manusia durhaka itu bergelimpangan seakan-akan mereka bagaikan pohon-pohon kurma yang tumbang dengan akar-akarnya. Maka perhatikanlah betapa dahsyatnya azab-ku dan peringatan-ku kepada orang-orang yang ingkar dan durhaka"
  }
]