[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bagaimana azab dan siksaKu atas siapa yang kafir kepadaKu, mendustakan para utusanKu dan tidak beriman kepada mereka? Sesungguhnya azabKu itu besar dan pedih."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Maka perhatikanlah -wahai penduduk Makkah- bagaimana siksa-Ku atas mereka? Dan bagaimana peringatan-Ku terhadap yang lain dengan siksaan terhadap mereka?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "21. Alangkah dahsyatnya azab dan ancamanKu terhadap mereka. Allah mengulang-ulangnya sebagai bentuk peringatan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka betapa dahsyatnya azab dan peringatanKu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21. “Maka betapakah dahsyatnya azab dan ancaman-ancamanKu.” Demi Allah, siksaNya amat pedih dan ancamanNya tidak membiarkan seorang pun memiliki alasan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qamar ayat 21: 21-22. Telah berlalu tafsir dari dua ayat yang sebelumnya pada ayat 16 dan 17 dari surat ini."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qamar Ayat 21",
    "description": "20-21. Allah mengembuskan angin mahadahsyat yang membuat manusia durhaka itu bergelimpangan seakan-akan mereka bagaikan pohon-pohon kurma yang tumbang dengan akar-akarnya. Maka perhatikanlah betapa dahsyatnya azab-ku dan peringatan-ku kepada orang-orang yang ingkar dan durhaka. 22. Peristiwa yang menimpa kaum 'ad merupakan pelajaran berharga bagi orang yang mau memperhatikan. Dan sungguh, telah kami mudahkan Al-Qur'an untuk menjadi pelajaran dan peringatan bagi semua manusia. Maka, adakah di antara mereka orang yang mau mengambil pelajaran sehingga Allah melimpahkan karunia kepadanya dan membantunya memahami kitab suci ini'."
  }
]