[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "23-24. Kaum Tsamud (yaitu kaum Shaleh) mendustakan ayat-ayat yang dengannya mereka diperingatkan. Mereka berkata, “Apakah kami mengikuti seorang manusia sedangkan kami adalah jamaah yang berjumlah besar? Bila demikian, maka sesungguhnya kami benar-benar jauh dari kebenaran dan kami benar-benar dalam kegilaan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "23. Kaum Ṡamūd mendustakan apa yang diperingatkan oleh nabi mereka, Ṣāleḥ -'alaihissalām-."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "23-27. Kaum Tsamud telah mendustakan Nabi mereka, Shalih yang memperingatkan mereka dengan berbagai ayat. Mereka mengingkarinya dengan berkata: “Mengapa kami harus mengikuti manusia seperti kami? Jika kami melakukan itu maka kami berada dalam kesesatan dan kegilaan. Apakah dia mendapat wahyu dan dipilih menjadi rasul, dan bukan kami yang dipilih? Sungguh dia hanya seorang pembohong dan angkuh.” Maka Allah mengancam dan mengolok mereka: “Di akhirat mereka akan mengetahui siapa yang pembohong dan angkuh. Sungguh Kami akan mengeluarkan unta betina dari batu, sebagai ujian bagi mereka. Hai Shalih, tunggu saja akibat dari kekafiran mereka dan bersabarlah dalam menghadapi gangguan dari mereka.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "23. كَذَّبَتْ ثَمُودُ بِالنُّذُرِ (Kaum Tsamudpun telah mendustakan ancaman-ancaman (itu)) Yakni mendustakan Nabi Shalih, dan barangsiapa yang mendustakan satu rasul maka ia sama saja dengan mendustakan seluruh rasul, sebab mereka menyeru kepada asas-asas syariat yang sama."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "23. Kabilah Tsamud mendustakan nabi mereka Shalih AS dengan ancaman-ancaman dan nasehat yang didatangkan untuk mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kaum Tsamud juga telah mendustakan peringatan-peringatan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "23. “Kaum Tsamud pun telah mendustakan.” Mereka adalah kabilah terkenal yang berada di daratan al-Hijr, nabi mereka bernama Shaleh. Mereka mendustakan beliau ketika menyeru mereka untuk menyembah Allah semata, yang tidak ada sekutu bagiNya, dan Nabi Shaleh menyampaikan ancaman dengan siksaan jika mereka membangkang."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qamar ayat 23: Allah mengabarkan bahwa kaum Tsamud mendustakan Nabi mereka Shalih, dan tidak beriman kepadanya, dan tidak mengambil pelajaran dari peringatan Shalih."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kaum Tsamud adalah sebuah kabilah yang terkenal di daerah Hijr. Nabi yang Allah utus kepada mereka adalah Shalih ‘alaihis salam, dia mengajak mereka beribadah kepada Allah saja serta memperingatkan mereka dengan azab Allah jika mereka mendurhakai-Nya, namun mereka malah mendustakannya dan bersikap sombong terhadapnya sambil berkata, “\"Bagaimana kita akan mengikuti seorang manusia (biasa) di antara kita?\""
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qamar Ayat 23",
    "description": "23-24. Seperti kaum nabi nuh dan kaum 'ad, kaum samud pun mengingkari dakwah nabi mereka, nabi saleh. Kaum samud pun telah mendustakan rasul Allah dan peringatan itu. Maka mereka berkata, 'bagaimana kita akan mengikuti seorang manusia biasa di antara kita yang tidak memiliki keistimewaan dan pengikut, sedang dia mengajarkan sesuatu yang bertentangan dengan keyakinan nenek moyang kita' sungguh, kalau begitu kita benar-benar telah sesat dan gila"
  }
]