[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "23-24. Kaum Tsamud (yaitu kaum Shaleh) mendustakan ayat-ayat yang dengannya mereka diperingatkan. Mereka berkata, “Apakah kami mengikuti seorang manusia sedangkan kami adalah jamaah yang berjumlah besar? Bila demikian, maka sesungguhnya kami benar-benar jauh dari kebenaran dan kami benar-benar dalam kegilaan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. Mereka berkata dengan sombong, “Apakah kita akan mengikuti satu orang biasa dari jenis kita sendiri? Sesungguhnya bila kita mengikutinya dalam kondisi ini pastilah kita berada dalam kesesatan dari kebenaran dan dalam kesusahan"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "24. فَقَالُوٓا۟ أَبَشَرًا مِّنَّا وٰحِدًا نَّتَّبِعُهُۥٓ (Maka mereka berkata: “Bagaimana kita akan mengikuti seorang manusia (biasa) di antara kita?”) Yakni bagaimana kami akan mengikuti manusia seperti kami, yang hanya sendirian dan tidak memiliki pengikut. إِنَّآ إِذًا لَّفِى ضَلٰلٍ(Sesungguhnya kalau kita begitu benar-benar berada dalam keadaan sesat) Yakni jika kami mengikutinya maka kami sungguh telah melakukan kesalahan dan menjauh dari kebenaran. وَسُعُرٍ(dan gila”) Yakni dalam siksaan dan kesusahan. Pendapat lain mengatakan, yakni dalam keadaan gila."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "24. {Mereka berkata}: “Apakah kita akan mengikuti seorang laki-laki lemah dari jenis dan golongan kita sendiri yang tidak lebih istimewa dari kita? Sesungguhnya jika kita mengikutinya, kita akan berada dalam kesalahan dan semakin jauh dari kebenaran serta berada dalam kegilaan”. Ucapan mereka {waahidan} maknanya adalah lemah dan kekuatannya tidak perlu dikhawatirkan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata,“Bagaimana kita akan mengikuti seorang manusia di antara kita. Sesungguhnya jika begitu kita benar-benar dalam kesesatan} setelah dari kebenaran {dan gila} sakit"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "24. Mereka mendustakannya dan bersikap tinggi hati terhadap beliau seraya menyombongkan diri dan sesat, “Bagaimanakah kita akan mengikuti saja seorang manusia (biasa) di antara kita?” artinya, bagaimana kita bisa mengikuti seorang manusia dan bukan malaikat, seorang manusia dari kalangan kita sendiri, bukan dari kalangan orang lain yang paling banyak memiliki karunia di antara sesama, sudah demikian dia juga hanya satu orang saja, “Sesungguhnya kalau kita begitu,” artinya, jika kita mengikutinya dalam kondisi seperti ini, “benar-benar berada dalam keadaan sesat dan gila.” Artinya, tentu kami adalah orang-orang sesat dan sengsara. Ucapan mereka ini dikarenakan kesesatan dan kesengsaraan mereka, mereka enggan mengikuti rasul dari kalangan manusia, namun mereka tidak enggan menjadi pemuja pohon, batu, dan lukisan-lukisan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qamar ayat 24: Allah mengabarkan bahwa kaum Tsamud berkata dengan sombong : Bagaimana mungkin kami mengikuti manusia semisal dengan kami yang raja juga bukan, bahkan dia sama seperti kami, dia satu sedangkan kami adalah kaum yang besar?! Kalau saja kami turuti dia, sungguh kami adalah orang-orang gila setelah kami di atas kebenaran."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni bagaimana kita akan mengikuti manusia yang bukan raja kita, bukan selain kita yang dianggap besar oleh kita, dan lagi dia hanya seorang diri? Maksudnya, jika kita mengikutinya sedangkan dia seperti itu keadaannya, maka kita benar-benar telah sesat dan gila. Ucapan mereka ini tidak lain karena kebodohan mereka, mereka enggan dengan sombong untuk mengikuti Rasul mereka dari kalangan manusia, tetapi mereka tidak enggan menjadi penyembah makhluk yang lebih lemah dari mereka, yaitu pohon, batu dan rupaka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qamar Ayat 24",
    "description": "23-24. Seperti kaum nabi nuh dan kaum 'ad, kaum samud pun mengingkari dakwah nabi mereka, nabi saleh. Kaum samud pun telah mendustakan rasul Allah dan peringatan itu. Maka mereka berkata, 'bagaimana kita akan mengikuti seorang manusia biasa di antara kita yang tidak memiliki keistimewaan dan pengikut, sedang dia mengajarkan sesuatu yang bertentangan dengan keyakinan nenek moyang kita' sungguh, kalau begitu kita benar-benar telah sesat dan gila. 25-26. Apakah wahyu itu justru diturunkan kepadanya, bukan kepada orang lain di antara kita yang lebih istimewa dan berpengaruh' pastilah dia seorang pendusta besar lagi sombong. ' Allah membantah, 'kelak, saat bukti-bukti yang menguatkan kenabiannya ditampakkan, mereka akan mengetahui siapa yang sebenarnya layak disebut sangat pendusta dan sombong itu. '."
  }
]