[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "25-26. Apakah dia menerima wahyu dan diangkat sebagai nabi di antara kami, padahal dia hanya salah seorang dari kami? Dia banyak dusta dan menyombongkan diri.” Mereka akan melihat saat azab menimpa mereka di dunia dan Hari Kiamat, siapa yang pendusta dan sombong itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "25. Apakah wahyu diturunkan kepadanya sendirian tanpa melibatkan kami semua? Tidak mungkin, justru dia adalah seorang pendusta dan sombong.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "25. أَءُلْقِىَ الذِّكْرُ عَلَيْهِ مِنۢ بَيْنِنَا (Apakah wahyu itu diturunkan kepadanya di antara kita?) Yakni bagaimana ia diistimewakan dengan wahyu dan kenabian sedangkan kami tidak, padahal di antara kami terdapat orang yang lebih berhak mendapatkan hal tersebut. بَلْ هُوَ كَذَّابٌ أَشِر(Sebenarnya dia adalah seorang yang amat pendusta lagi sombong) Makna (الأشر) yakni orang yang giat menyebar kedustaannya, atau orang yang angkuh dan sombong."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "25. Apakah dia menerima wahyu? Bagaimana bisa Nubuwah itu diperuntukkan kepadanya daripada kami, sedangkan di antara kami ada yang lebih baik darinya untuk menerima wahyu itu? Atau dia berdusta atas wahyu yang diberikan kepadanya sehingga dia berlaku sombong"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apakah wahyu itu} wahyu {diturunkan} diturunkan {kepadanya di antara kita. Pastilah dia seorang yang sangat berdusta lagi sombong”} angkuh lagi sombong"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "25-26. “Apakah wahyu itu diturunkan kepadanya di antara kita?” artinya, bagaimana bisa Allah mengkhususkan dia di antara kita semua dengan diberi peringatan (wahyu)? Apa keistimewaan dia sehingga diberi kekhususan di antara kita sekalian? Ini merupakan bantahan dari orang-orang yang mendustakan Allah, mereka senantiasa menjadikan perkataan seperti itu untuk membantah seruan para Rasul. Allah menanggapi syubhat tersebut melalui perkataan para rasul terhadap kaumnya, “Rasul-rasul mereka berkata kepada mereka: \"Kami tidak lain hanyalah manusia seperti kamu, akan tetapi Allah memberi karunia kepada siapa yang Dia kehendaki di antara hamba-hamba-Nya.”-Ibrahim:11- Para rasul dikaruniai Allah sifat-sifat dan akhlak yang sempurna, dengan sifat dan akhlak itu mereka layak menerima risalah Rabb mereka serta mendapatkan wahyu secara khusus. Di antara rahmat dan hikmah Allah adalah mengutus rasul dari kalangan manusia, andai para rasul berasal dari golongan malaikat, tentu Allah akan segera menimpakan azab bagi orang-orang yang mendustakan. Maksud dari perkataan kaum Tsamud kepada nabi mereka, Shaleh adalah sebagai pendustaan, karena itulah mereka diberi hukum seperti itu. Mereka berkata, “Sebenarnya dia adalah seorang yang amat pendusta lagi sombong.” Artinya, orang yang banyak berdusta dan sombong. Semoga Allah memperburuk mereka; alangkah bodohnya pemikiran mereka dan alangkah zhalimnya mereka karena menanggapi orang-orang yang benar dan memberi nasihat dengan perkataan buruk."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qamar ayat 25: 25-26. Kemudian berkata kaum Shalih : Apakah laki-laki ini dikhususkan untuk kami dan diturunkan wahyu kepadanya bukan kepada kami ?!! Sungguh dia adalah pembohong sangat, maka dia akan tahu rasa besok (semoga Allah menjelekkan mereka). Dimana telah diturunkan atas mereka adzab bagi kedustaan mereka yang sangat dan kesombongan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni apa kelebihan dia dari kita sehingga Allah menurunkan wahyu-Nya kepadanya? Ini merupakan sanggahan dan syubhat yang biasa digunakan oleh orang-orang yang mendustakan para rasul, dan Allah Subhaanahu wa Ta'aala telah menjawabnya dengan ucapan para rasul terhadap kaum mereka: Rasul-rasul mereka berkata kepada kaum mereka, \"Kami tidak lain hanyalah manusia seperti kamu, akan tetapi Allah memberi karunia kepada siapa yang Dia kehendaki di antara hamba-hamba-Nya.” (lihat surah Ibrahim: 11) Para rasul, Allah berikan sifat, akhlak dan kesempurnaan agar mereka dapat mengemban risalah Tuhan mereka dan diistimewakan-Nya dengan wahyu-Nya. Termasuk rahmat Allah dan kebijaksanaan-Nya adalah Dia mengangkat rasul dari kalangan manusia. Kalau sekiranya mereka dari kalangan malaikat, tentu manusia tidak dapat mengambil ilmu dari mereka, dan kalau sekiranya para rasul dari kalangan malaikat tentu Allah Subhaanahu wa Ta'aala akan menyegerakan azab bagi orang-orang yang mendustakan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qamar Ayat 25",
    "description": "25-26. Apakah wahyu itu justru diturunkan kepadanya, bukan kepada orang lain di antara kita yang lebih istimewa dan berpengaruh' pastilah dia seorang pendusta besar lagi sombong. ' Allah membantah, 'kelak, saat bukti-bukti yang menguatkan kenabiannya ditampakkan, mereka akan mengetahui siapa yang sebenarnya layak disebut sangat pendusta dan sombong itu"
  }
]