[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya Kami mengeluarkan seekor unta betina yang mereka minta dari batu sebagai ujian bagi mereka. Maka lihatlah (wahai Shaleh) azab yang menimpa mereka dan bersabarlah dalam berdakwah kepada mereka dan (dalam menghadapi) gangguan mereka terhadapmu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "27. Sesungguhnya Kami telah mengeluarkan unta betina dari batu dan membangkitkannya sebagai ujian bagi mereka, maka tunggulah -wahai Ṣāleḥ- dan perhatikanlah apa yang akan mereka perbuat dengan unta betina itu dan apa yang akan terjadi pada mereka, dan bersabarlah menghadapi gangguan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "27. إِنَّا مُرْسِلُوا۟ النَّاقَةِ (Sesungguhnya Kami akan mengirimkan unta betina) Yakni Kami mengeluarkan unta betina itu dari batu sebagaimana yang mereka minta. فِتْنَةً لَّهُمْ(sebagai cobaan bagi mereka) Yakni sebagai ujian bagi mereka. فَارْتَقِبْهُمْ(maka tunggulah (tindakan) mereka) Yakni tunggu apa yang akan mereka lakukan. وَاصْطَبِر(dan bersabarlah) Bersabarlah atas gangguan yang kamu dapatkan dari mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "27. Sesungguhnya kami mengutus dan mengeluarkan unta sebagai mana yang mereka inginkan sebagai bentuk ujian terhadap mereka. Tunggulah mereka dan bersabarlah atas sakit yang diberikan oleh mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya Kami akan mengirimkan} mengeluarkan {unta betina sebagai ujian bagi mereka} ujian bagi mereka {maka tunggulah mereka} maka tunggulah apa yang akan mereka lakukan terhadapnya dan apa yang akan menimpa mereka wahai Shalih {dan bersabarlah} dan bersabarlah atas hal menyakitkan dari mereka kepadamu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "27. Tidak ada salahnya jika mereka disiksa oleh Allah ketika tindakan mereka yang melampaui batas itu semakin menjadi-jadi. Maka Allah mengirimkan unta yang merupakan binatang ternak terbesar kepada mereka sebagai salah satu tanda kekuasaan Allah dan sebagai nikmat untuk mereka, di mana mereka memeras susu yang mencukupi mereka semua, “sebagai cobaan bagi mereka.” Artinya, sebagai ujian dari Allah untuk mereka, “maka tunggulah (tindakan) mereka dan bersabarlah,” artinya, bersabarlah dalalm menyeru mereka dan tunggulah apakah mereka mau beriman atau tetap kufur?"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qamar ayat 27: Allah mengabarkan bahwasanya Dia akan menguji mereka dengan mengeluarkan unta betina kepada mereka, dan unta tersebut akan menjadi cobaan bagi mereka. Allah memerintah Shalih agar bersabar dalam berdakwah kepada mereka, dan dari celaan mereka dan agar menunggu, apakah mereka akan beriman atau malah kufur, kemudia Shalih menunggu apa yang akan mereka perbuat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Di samping sebagai mukjizat Nabi Shalih dan nikmat untuk mereka, dimana mereka dapat memerah susunya yang mencukupi mereka semua. Yakni tunggulah apa yang mereka lakukan, atau tunggulah apa yang menimpa mereka, atau tunggulah apakah mereka beriman atau kafir. Terhadap gangguan mereka dan tetap teruslah berdakwah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qamar Ayat 27",
    "description": "Sesungguhnya kami akan menciptakan dan mengirimkan seekor unta betina sebagai mukjizat yang membuktikan kebenaran nabi saleh dan sebagai cobaan bagi mereka, apakah mereka beriman atau tidak. Maka sesudah kami kirimkan unta itu, tunggulah tindakan mereka kepadanya dan bersabarlah menanti tindakan kami terhadap mereka. 28. Wahai nabi saleh, dan beritahukanlah kepada mereka, yaitu kaum samud, bahwa air sumur yang menjadi sumber minum mereka itu dibagi di antara mereka dengan unta betina itu; setiap orang berhak mendapat giliran minum dan hanya bisa mengambil jatah sesuai giliran tersebut."
  }
]