[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kabarkanlah kepada mereka bahwa air terbagi antara kaummu dengan unta itu. Satu hari untuk unta dan satu hari untuk mereka. Yang berhak meminum adalah pihak yang mendapatkan gilirannya, sedangkan yang bukan gilirannya dilarang."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "28. Dan kabarkan kepada mereka bahwa air sumur mereka dibagi untuk mereka dan untuk unta betina itu, sehari untuk unta itu dan sehari untuk mereka, setiap bagian hanya dihadiri oleh yang berhak pada hari yang telah ditentukan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "28-31. Sampaikanlah kepada mereka berita besar, bahwa air telaga itu terbagi untuk mereka dan unta betina itu; satu hari untuk itu akan datang untuk minum, dan satu hari berikutnya mereka dapat datang untuk minum. Namun mereka mengajak dan mendorong seseorang di antara kaum yang jahat itu, agar dia menyembelih unta betina. Maka orang itu akhirnya menyembelih unta tersebut. Maka bagaimana azab-Ku ketika itu akibat kekafiran mereka dan peringatan-Ku bagi mereka yang telah mendustakan rasul? Kami mengirim azab kepada mereka berupa satu kali suara keras, maka mereka menjadi seperti rumput kering yang hancur."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "28. وَنَبِّئْهُمْ أَنَّ الْمَآءَ قِسْمَةٌۢ بَيْنَهُمْ ۖ (Dan beritakanlah kepada mereka bahwa sesungguhnya air itu terbagi antara mereka (dengan unta betina itu)) Yakni terbagi antara kaum Tsamud dan unta betina tersebut, sehari untuk mereka dan sehari untuk unta itu. sebagaimana disebutkan dalam firman-Nya: لها شرب ولكم شرب يوم معلوم “ ia mempunyai giliran untuk mendapatkan air, dan kamu mempunyai giliran pula untuk mendapatkan air di hari yang tertentu. (Asy-Syu'ara':155) كُلُّ شِرْبٍ مُّحْتَضَرٌ (tiap-tiap giliran minum dihadiri (oleh yang punya giliran)) Makna (الشرب) yakni jatah air yang didapat. Mujahid mengatakan bahwa kaum Tsamud datang ke sumber air di hari giliran mereka untuk minum air, dan mereka juga datang di hari giliran unta itu untuk memeras air susunya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "28. Kabarkanlah kepada mereka air sumur atau sungai kecil yang biasa mereka gunakan untuk minum itu dibagi menjadi dua yaitu untuk mereka dan untuk unta itu. Masing-masing porsi (minum) air tersebut dihadiri oleh pihak yang meminumnya pada gilirannya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Beri tahulah mereka} kabarkanlah kepada mereka {bahwa air itu} air sumur itu {dibagi di antara mereka} dibagi diantara kaum Tsamud dan unta betina itu {Setiap bagian minuman itu} setiap bagian dari air itu {ada pihak orang berhak atasnya} pihak yang menghadirinya sesuai giliran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "28. “Dan beritakanlah kepada mereka bahwa sesungguhnya air itu terbagi antara mereka (dengan unta betina itu).” Artinya, beritahukanlah kepada mereka bahwa sunber air tempat mereka mendapatkan air adalah milik bersama di antara mereka dan mereka juga memiliki jatah minum di hari yang berbeda. “Tiap-tiap giliran minum dihadiri (oleh yang punya giliran),” artinya, didatangi oleh orang yang memiliki gilirannya dan bagi yang bukan gilirannya tidak dibolehkan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qamar ayat 28: 28-29. Allah berkata kepada Nabi-Nya Shalih dengan maksud memberi petunjuk dan pelajaran : Kabarkan wahai Shalih kepada kaummu, bahwa air itu terbagi antara mereka dan unta betina itu. Bagian mereka sehari, dan bagian unta betina sehari. Akan tetapi kaum Shalih tidak melaksanakan perintah Allah, dengannya mereka menyeru kepada teman-temannya meminum (air itu) bersama-sama dan membunuh unta betina, mereka menangkap unta tersebut dan membunuhnya dengan pedang, mereka tidak memperdulikan akan musibah dari urusan yang besar ini."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sehari untuk mereka dan sehari lagi untuk unta betina. Lama-kelamaan mereka bosan dengannya lalu berniat membunuh unta betina itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qamar Ayat 28",
    "description": "Wahai nabi saleh, dan beritahukanlah kepada mereka, yaitu kaum samud, bahwa air sumur yang menjadi sumber minum mereka itu dibagi di antara mereka dengan unta betina itu; setiap orang berhak mendapat giliran minum dan hanya bisa mengambil jatah sesuai giliran tersebut. 29-30. Mereka merasa kecewa dengan pembagian jatah air itu. Maka mereka memanggil kawannya yang dikenal kuat dan kejam untuk membunuh unta itu, lalu dia menangkap unta itu dan memotongnya. Akibat kedurhakaan ini, maka lihatlah betapa dahsyatnya azab-ku dan peringatan-ku kepada mereka."
  }
]