[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka mendustakan Nabi, mengikuti kesesatan mereka dan apa yang diserukan oleh hawa nafsu mereka, yaitu mendustakan. Segala urusan, yang baik dan yang buruk, pasti menimpa pelakunya di Hari Kiamat saat pahala dan hukuman sudah tampak."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Mereka mendustakan kebenaran yang datang kepada mereka dan mengikuti hawa nafsu mereka dalam pendustaan ini, sedang setiap perkara, yang baik maupun yang buruk, akan mengenai orang-orang yang melakukannya pada hari Kiamat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. وَكُلُّ أَمْرٍ مُّسْتَقِرٌّ (sedang tiap-tiap urusan telah ada ketetapannya) Yakni setiap urusan itu benar; urusan di dunia akan akan nampak dan urusan akhirat akan diketahui."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3-4. Mereka mendustakan Nabi SAW dan mengikuti hawa nafsu mereka yang batil. Yaitu hawa nafsunya dihiasi oleh setan dengan kewas-wasan. Setiap sesuatu yang telah mencapai tujuannya itu sudah ditetapkan, baik itu baik atau buruk. Sungguh telah datang kepada orang-orang musyrik Quraisy tentang kabar-kabar umat terdahulu yang pendusta sebagai peringatan kepada mereka tentang kesyirikan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka mendustakan dan mengikuti keinginan mereka, padahal setiap urusan telah ada ketetapannya} menimpa orang yang memilikinya pada hari kiamat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3. Karena itu Allah berfirman, “Dan mereka mendustakan (Nabi) dan mengikuti hawa nafsu mereka,” seperti yang disebutkan dalam Firman Allah, “Maka jika mereka tidak menjawab (tantanganmu) ketahuilah bahwa sesungguhnya mereka hanyalah mengikuti hawa nafsu mereka (belaka)” -Al-Qasash:50 Sebab andai saja mereka berniat untuk mengikuti petunjuk, tentu mereka pasti beriman dan mengikuti Nabi Muhammad, karena Allah memperlihatkan berbagai bukti nyata dan hujjah tegas melalui tangan beliau yang menunjukkan seluruh tuntutan ilahiah dan maksud syariat. “Sedang tiap-tiap urusan telah ada ketetapannya,” artinya hingga kini masalah itu belum sampai pada ambang batasnya dan akan tetap berjalan hingga pada batas akhir. Orang-orang yang membenarkan akan berada di surga yang penuh kenikmatan dan ampunan serta ridha Allah, sedangkan orang yang mendustakan akan jungkir balik berada dalam kemurkaan dan azab Allah kekal selama-lamanya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qamar ayat 3: 2-3. Ketahuilah wahai Nabi Allah bahwa mereka orang-orang musyrik sebagaiamana yang mereka melihat dari tanda-tanda mukjizat yang menunjukkan kebenaran akan dirimu, akan tetapi mereka pasti akan menolak dan tidak akan beriman kepada Allah dan Rasul-Nya ﷺ; Bahkan mereka akan berkata dengan pengingkaran : Sungguh yang engkau datangkan kepada kami tidak lain hanyalah sihir. Kemudian Allah mengabarkan bahwa mereka mendustakan Nabi ﷺ, dan mengikuti dakwahan dari hawa nafsu mereka berupa pengingkaran. Kemudian Allah menjelaskan bahwa sesungguhnya setiap urusan itu pasti telah ada ketetapan akhirnya. Inilah akhir dari orang-orang yang kafir, yang di akhir kehidupannya mereka akan merugi, adapun urusan orang-orang yang beriman akan berakhir dengan kemenangan dan ridha Allah bagi mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Hal ini seperti dalam firman Allah Ta’ala di surah Al Qashas ayat 50, “Maka jika mereka tidak menjawab (tantanganmu) ketahuilah bahwa sesungguhnya mereka hanyalah mengikuti hawa nafsu mereka (belaka). Dan siapakah yang lebih sesat daripada orang yang mengikuti hawa nafsunya dengan tidak mendapat petunjuk dari Allah sedikit pun. Sesungguhnya Allah tidak memberi petunjuk kepada orang-orang yang zalim.” (Terj. Al Qashash: 50) Kalau seandainya maksud mereka adalah mengikuti petunjuk, tentu mereka akan beriman dan mengikuti Nabi Muhammad shallallahu 'alaihi wa sallam, karena Allah telah memperlihatkan kepada mereka melalui tangan Beliau petunjuk, bukti dan keterangan yang nyata yang menunjukkan kepada semua tuntutan ilahi dan maksud syariat. Maksudnya bahwa segala urusan itu pasti berjalan sampai waktu yang telah ditetapkan terjadinya, seperti urusan Rasulullah shallallahu 'alaihi wa sallam dalam meninggikan kalimat Allah pasti sampai pada akhirnya, yaitu kemenangan di dunia dan kebahagiaan di akhirat, sedangkan urusan orang yang mendustakannya pasti sampai pula pada akhirnya, yaitu kekalahan di dunia dan siksaan di akhirat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qamar Ayat 3",
    "description": "Demikianlah sikap orang musyrik, dan mereka memang senantiasa mendustakan kebenaran dari-Nya. Mereka cenderung menyimpang dari fitrah dan mengikuti keinginannya yang menjerumuskan mereka pada kesesatan, padahal setiap urusan yang terjadi pasti telah ada ketetapannya. 4. Dan sungguh, telah datang kepada mereka beberapa kisah yang di dalamnya terdapat ancaman bagi mereka untuk tidak berbuat ingkar dan syirik."
  }
]