[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "34-35. Sesungguhnya Kami mengirimkan kepada mereka angin yang kencang yang melempari mereka dengan batu kecuali keluarga Luth, Kami menyelamatkan mereka dari azab di akhir malam, sebagai nikmat Kami kepada mereka, sebagaimana Kami membalas Luth dan keluarganya dan memberi mereka nikmat, Kami juga menyelamatkan mereka dari azab Kami, Kami juga membalas siapa yang beriman kepada Kami dan bersyukur kepada Kami."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "34. Sesungguhnya Kami mengirimkan angin yang melemparkan batu-batu kepada mereka, kecuali kepada keluarga Nabi Lūṭ, mereka tidak terkena siksa dan Kami telah menyelamatkan mereka dari siksa itu, saat mereka pergi pada malam hari sebelum terjadinya siksa itu di ujung malam."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "34. إِنَّآ أَرْسَلْنَا عَلَيْهِمْ حَاصِبًا(Sesungguhnya Kami telah menghembuskan kepada mereka angin yang membawa batu-batu) Yakni angin yang melempari mereka dengan bebatuan kecil. إِلَّآ ءَالَ لُوطٍ ۖ نَّجَّيْنٰهُم بِسَحَرٍ(kecuali keluarga Luth. Mereka Kami selamatkan sebelum fajar menyingsing) Yakni kecuali Nabi Luth dan pengikutnya. Dan makna (السحر) yakni pada akhir malam."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "34. Kami mengirimkan untuk mereka angina kencang yang melmpari mereka bebatuan (Pada awalnya Al-Hasib adalah angina yang melampari orang di sekitarnya dengan kerikil, yaitu bebatuan kecil), Akan tetapi Kami menolong keluarga Luth kecuali istrinya di malam hari sebelum waktu fajar, yaitu sepereman terakhir dari waktu malam"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya Kami menimpakan atas mereka badai batu} angina yang melempari mereka dengan bebatuan {kecuali pengikut Luth. Kami menyelamatkan mereka di akhir malam} di akhir malam"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "33-40. “Kaum Luth pun telah mendustakan,” Luth ketika menyeru mereka untuk menyembah Allah semata, yang tidak ada sekutu bagiNya, ketika Luth melarang mereka melakukan kesyirikan dan kekejian yang belum pernah dilakukan seorang pun dari seluruh alam, mereka mendustakan Nabi Luth dan tetap berada dalam kesyirikan dan perbuatan keji hingga para malaikat yang datang menemui Luth dalam wujud tamu pun ketika berita itu terdengar oleh kaumnya, mereka segera mendatangi dan ingin melakukan kekejian terhadap mereka, semoga Allah melaknat dan memperburuk mereka, dan Nabi Luth pun menyembunyikan tamu-tamunya dari kaumnya. Kemudian Allah memerintahkan Jibril, kemudian Jibril mencolok mata mereka dengan sayapnya dan Luth juga mengancam mereka akan hantaman dan siksaan Allah. “Maka mereka membantah ancaman-ancaman.” “Sesungguhnya Kami telah menghembuskan kepada mereka angin yang membawa batu-batu (yang menimpa mereka),” Allah membalik tanah mereka, yang atas dijadikan bawah dan mereka dihujani batu yang berasal dari neraka yang menyala-nyala yang diberi tanda dari sisi Rabbmu bagi orang-orang yang melampaui batas. Allah menyelamatkan Nabi Luth dan keluarganya dari siksaan besar sebagai balasan bagi mereka dan rasa syukur mereka terhadap Rabb mereka serta ibadah mereka kepada Allah semata, yang tidak ada sekutu bagiNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qamar ayat 34: 34-35. Allah mengabarkan bahwa Dia mengutus angin yang dahsyat (yang membawa batu kerikil) kemudian melempari mereka dengan batu kerikil tersebut maka binasalah mereka; Kecuali keluarga Luth yakni Luth dan anak-anaknya. Mereka diselamatkan oleh Allah dengan dikeluarkan dari negeri tersebut menuju negei yang lain pada malam hari sebelum turunnya adzab yang berlangsung saat waktu subuh. Allah mengabarkan bahwa Dia menyelamatkan keluarga Luth dan siapa yang beriman kepadanya dengan diberikan nikmat dan kemuliaan bagi mereka. Dan yang semisal dengan ini, Allah berikan keselamatan bagi yang bersyukur atas nikmat Allah yang diberikan kepadanya, dan yang dia mentauhidkan dan beriman serta taat kepada Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qamar Ayat 34",
    "description": "34-35. Akibat keingkaran mereka, sesungguhnya kami kirimkan kepada mereka badai yang berembus amat kencang dan membawa batu-batu untuk kami timpakan kepada mereka, kecuali keluarga lut. Kami selamatkan mereka dari bencana itu sebelum fajar menyingsing. Kami lakukan itu semua sebagai nikmat dari kami. Demikianlah kami selalu memberi balasan kepada orang-orang yang bersyukur. 34-35"
  }
]