[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Luth sudah memperingatkan kaumnya terhadap azab Allah dan siksaNya, tetapi mereka tidak mendengarnya, sebaliknya mereka meragukan dan mendustakannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "36. Dan sungguh Nabi Lūṭ telah menakuti mereka dengan siksa Kami, akan tetapi mereka membantah peringatannya dan mendustakannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "36. وَلَقَدْ أَنذَرَهُم بَطْشَتَنَا (Dan sesungguhnya dia (Luth) telah memperingatkan mereka akan azab-azab Kami) Yakni Luth telah memperingatkan mereka dari azab Allah yang sangat keras. فَتَمَارَوْا۟ بِالنُّذُرِ(maka mereka mendustakan ancaman-ancaman itu) Yakni mereka meragukan peringatan itu dan tidak mempercayainya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "36. Sungguh Luth AS telah memperingatkan mereka bahwa Kami akan memberikan mereka azab yang sangat dahsyat, namun mereka mencaci dan mendustakan peringatan-peringatan itu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh dia benar-benar telah memperingatkan mereka tentang hukuman Kami} Luth telah memperingatkan mereka tentang hukuman Kami dengan azab {tetapi mereka membantah peringatan itu} lalu mereka membantah dan mendustakaan peringatannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "33-40. “Kaum Luth pun telah mendustakan,” Luth ketika menyeru mereka untuk menyembah Allah semata, yang tidak ada sekutu bagiNya, ketika Luth melarang mereka melakukan kesyirikan dan kekejian yang belum pernah dilakukan seorang pun dari seluruh alam, mereka mendustakan Nabi Luth dan tetap berada dalam kesyirikan dan perbuatan keji hingga para malaikat yang datang menemui Luth dalam wujud tamu pun ketika berita itu terdengar oleh kaumnya, mereka segera mendatangi dan ingin melakukan kekejian terhadap mereka, semoga Allah melaknat dan memperburuk mereka, dan Nabi Luth pun menyembunyikan tamu-tamunya dari kaumnya. Kemudian Allah memerintahkan Jibril, kemudian Jibril mencolok mata mereka dengan sayapnya dan Luth juga mengancam mereka akan hantaman dan siksaan Allah. “Maka mereka membantah ancaman-ancaman.” “Sesungguhnya Kami telah menghembuskan kepada mereka angin yang membawa batu-batu (yang menimpa mereka),” Allah membalik tanah mereka, yang atas dijadikan bawah dan mereka dihujani batu yang berasal dari neraka yang menyala-nyala yang diberi tanda dari sisi Rabbmu bagi orang-orang yang melampaui batas. Allah menyelamatkan Nabi Luth dan keluarganya dari siksaan besar sebagai balasan bagi mereka dan rasa syukur mereka terhadap Rabb mereka serta ibadah mereka kepada Allah semata, yang tidak ada sekutu bagiNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qamar ayat 36: Allah mengabarkan bahwa Luth telah memperingatkan kaumnya, agar mereka takut terhadap adzab Allah yang keras, dan pedih. Akan tetapi mereka tidak menjawab peringatan Luth. Mereka meragukan seruan tersebut dan tidak membenarkannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qamar Ayat 36",
    "description": "Allah tidak menimpakan azab itu kepada kaum nabi lut secara tiba-tiba karena sebelumnya mereka telah diberi peringatan. Dan sungguh, dia telah memperingatkan mereka agar berhenti dari kedurhakaan yang akan menyebabkan jatuhnya hukuman kami, tetapi mereka tetap mendustakan peringatan-ku. 37. Puncak keingkaran kaum nabi lut adalah kebiasaan mereka berhubungan seksual sesama jenis. Suatu hari nabi lut kedatangan tamu pria. Mereka pun bergegas ke rumah nabi lut. Dan sungguh, mereka telah membujuknya agar menyerahkan tamunya itu kepada mereka untuk diajak berhubungan seksual, lalu kami butakan mata mereka akibat kedurhakaan ini, maka rasakanlah betapa pedih azab-ku dan peringatan-ku!."
  }
]