[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka meminta Luth agar membolehkan mereka melakukan perbuatan keji terhadap tamu-tamunya dari malaikat, maka Kami membutakan mata mereka sehingga tidak melihat apa pun. Kepada mereka dikatakan, “rasakanlah azab dan siksaKu yang telah diperingatkan Luth kepada kalian!”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "37. Dan sungguh kaum Nabi Lūṭ telah merayunya untuk membiarkan mereka bersama tamunya dari malaikat untuk melakukan perbuatan keji, maka Kami membutakan mata mereka sehingga tidak bisa melihat tamu Nabi Lūṭ dan Kami katakan kepada mereka, ”Rasakanlah siksa-Ku dan akibat dari peringatan-Ku kepada kalian.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "37. وَلَقَدْ رٰوَدُوهُ عَن ضَيْفِهِۦ (Dan sesungguhnya mereka telah membujuknya (agar menyerahkan) tamunya) Yakni mereka ingin dibiarkan untuk melakukan perbuatan keji dengan para malaikat yang mendatangi Nabi Luth sebagaimana kebiasaan mereka berbuat keji. فَطَمَسْنَآ أَعْيُنَهُمْ(lalu Kami butakan mata mereka) Yakni Kami hilangkan mata mereka hingga tidak ada belahan kelopak mata mereka, sebagaimana angin yang menghapus jalan-jalan dengan tanah yang dihembuskannya. Pendapat lain mengatakan, yakni Allah menghilangkan kemampuan melihat mereka saja, sedangkan mata mereka tetap ada."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "37. Sungguh mereka memintanya untuk menyerahkan tamu-tamunya kepada mereka dengan maksud untuk diajak berbuat keji. Lalu kami tutup penglihatan mereka dan kami jadikan mereka tidak bisa melihat apa yang mereka inginkan, sehingga mereka tidak melihat satu orang pun. Kami berkata kepada mereka melalui lisan malaikat: “Rasakanlah ancama dan peringatanKu melalui Luth AS. Akhirnya mereka menerima akibatnya”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sungguh mereka benar-benar telah membujuknya untuk memberikan tamunya} mereka memintanya untuk menyerahkan tamu-tamunya kepada mereka, agar mereka bisa melakukan perbuatan keji terhadapnya {Lalu Kami membutakan} Lalu Kami membutakan dan menutupi {mata mereka. Maka rasakanlah azabKu dan peringatan-peringatanKu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "33-40. “Kaum Luth pun telah mendustakan,” Luth ketika menyeru mereka untuk menyembah Allah semata, yang tidak ada sekutu bagiNya, ketika Luth melarang mereka melakukan kesyirikan dan kekejian yang belum pernah dilakukan seorang pun dari seluruh alam, mereka mendustakan Nabi Luth dan tetap berada dalam kesyirikan dan perbuatan keji hingga para malaikat yang datang menemui Luth dalam wujud tamu pun ketika berita itu terdengar oleh kaumnya, mereka segera mendatangi dan ingin melakukan kekejian terhadap mereka, semoga Allah melaknat dan memperburuk mereka, dan Nabi Luth pun menyembunyikan tamu-tamunya dari kaumnya. Kemudian Allah memerintahkan Jibril, kemudian Jibril mencolok mata mereka dengan sayapnya dan Luth juga mengancam mereka akan hantaman dan siksaan Allah. “Maka mereka membantah ancaman-ancaman.” “Sesungguhnya Kami telah menghembuskan kepada mereka angin yang membawa batu-batu (yang menimpa mereka),” Allah membalik tanah mereka, yang atas dijadikan bawah dan mereka dihujani batu yang berasal dari neraka yang menyala-nyala yang diberi tanda dari sisi Rabbmu bagi orang-orang yang melampaui batas. Allah menyelamatkan Nabi Luth dan keluarganya dari siksaan besar sebagai balasan bagi mereka dan rasa syukur mereka terhadap Rabb mereka serta ibadah mereka kepada Allah semata, yang tidak ada sekutu bagiNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qamar ayat 37: Allah menjelaskan kejahatan mereka yan buruk yang mereka layak untuk diadzab, dan kaum tersebut berbuat sesuatu yang menjijikkan yaitu sodomi. Oleh sebab itu turun para malaikat untuk mengadzab mereka; Dimana mereka (kaum Luth) datang kepada Luth dengan segera agar tamu Luth mau diajak untuk melakukan sesuatu yang menjijikkan sebagaimana kebiasaan buruk mereka. Maka Allah butakan mata-mata mereka masing-masing dan Allah hilangkan penglihatannya, sehingga mereka tidak melihat apa-apa, kemudian dikatakan kepada mereka : Rasakanlah adzab-Ku, yang kalian telah meragukannya, tidak membenarkannya, dan tidak peduli dengan peringatan dari Nabi kalian Luth."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qamar Ayat 37",
    "description": "Puncak keingkaran kaum nabi lut adalah kebiasaan mereka berhubungan seksual sesama jenis. Suatu hari nabi lut kedatangan tamu pria. Mereka pun bergegas ke rumah nabi lut. Dan sungguh, mereka telah membujuknya agar menyerahkan tamunya itu kepada mereka untuk diajak berhubungan seksual, lalu kami butakan mata mereka akibat kedurhakaan ini, maka rasakanlah betapa pedih azab-ku dan peringatan-ku!38-39. Tidak hanya membutakan mata mereka, Allah juga menimpakan kepada mereka azab yang lebih pedih. Dan sungguh, pada esok harinya mereka benar-benar ditimpa azab yang tetap sehingga binasalah mereka semua. Maka rasakanlah betapa pedihnya azab-ku dan bukti dari peringatan-ku!."
  }
]