[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "38-39. Dan sungguh telah datang kepada mereka di waktu pagi sebuah azab yang berlangsung terus-menerus hingga membawa mereka ke azab akhirat. Azab tersebut adalah merajam mereka dengan batu dan membalik negeri mereka, hingga bagian atasnya menjadi bagian bawah. Kepada mereka dikatakan, “rasakanlah azabKu yang Aku timpakan kepada kalian karena kekafiran dan pendustaan kalian, serta rasakanlah hukumanKu yang telah diperingatkan Luth kepada kalian.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "39. Dan dikatakan kepada mereka, “Rasakanlah siksa-Ku yang Aku turunkan kepada kalian sebagai hasil dari peringatan Nabi Lūṭ kepada kalian.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "39. Rasakanlah kedahsyatan azabKu dan buah dari ancamanKu. Pengulangan ini sebagai bentuk penegasan dan penguatan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka rasakanlah azabKu dan peringatan-peringatanKu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "33-40. “Kaum Luth pun telah mendustakan,” Luth ketika menyeru mereka untuk menyembah Allah semata, yang tidak ada sekutu bagiNya, ketika Luth melarang mereka melakukan kesyirikan dan kekejian yang belum pernah dilakukan seorang pun dari seluruh alam, mereka mendustakan Nabi Luth dan tetap berada dalam kesyirikan dan perbuatan keji hingga para malaikat yang datang menemui Luth dalam wujud tamu pun ketika berita itu terdengar oleh kaumnya, mereka segera mendatangi dan ingin melakukan kekejian terhadap mereka, semoga Allah melaknat dan memperburuk mereka, dan Nabi Luth pun menyembunyikan tamu-tamunya dari kaumnya. Kemudian Allah memerintahkan Jibril, kemudian Jibril mencolok mata mereka dengan sayapnya dan Luth juga mengancam mereka akan hantaman dan siksaan Allah. “Maka mereka membantah ancaman-ancaman.” “Sesungguhnya Kami telah menghembuskan kepada mereka angin yang membawa batu-batu (yang menimpa mereka),” Allah membalik tanah mereka, yang atas dijadikan bawah dan mereka dihujani batu yang berasal dari neraka yang menyala-nyala yang diberi tanda dari sisi Rabbmu bagi orang-orang yang melampaui batas. Allah menyelamatkan Nabi Luth dan keluarganya dari siksaan besar sebagai balasan bagi mereka dan rasa syukur mereka terhadap Rabb mereka serta ibadah mereka kepada Allah semata, yang tidak ada sekutu bagiNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qamar ayat 39: 39-40. Telah berlalu tafsirnya pada ayat 16 dan 17 dari surat ini."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qamar Ayat 39",
    "description": "38-39. Tidak hanya membutakan mata mereka, Allah juga menimpakan kepada mereka azab yang lebih pedih. Dan sungguh, pada esok harinya mereka benar-benar ditimpa azab yang tetap sehingga binasalah mereka semua. Maka rasakanlah betapa pedihnya azab-ku dan bukti dari peringatan-ku!40. Allah menuturkan kisah ini untuk mengingatkan betapa besar nikmat-Nya kepada manusia. Allah ingin agar manusia mau mengambil dari kisah itu pelajaran bagi kehidupannya. Dan sungguh, telah kami mudahkan Al-Qur'an untuk dijadikan peringatan, maka adakah orang yang secara sungguh-sungguh mau mengambil pelajaran darinya sehingga Allah melimpahkan karunia dan membantunya memahami isinya'."
  }
]