[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang Quraisy itu sudah didatangi oleh sebagian dari berita-berita umat-umat yang mendustai rasul-rasul mereka dan azab yang menimpa mereka, yang cukup untuk menghardik mereka dari kekafiran dan kesesatan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Dan telah datang kepada mereka berita tentang umat-umat yang telah dihancurkan Allah karena kekufuran dan kezalimannya, yang cukup untuk menakuti mereka dari kekafiran dan kezaliman mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "4-6. Sungguh telah sampai kepada mereka berita-berita besar yang cukup untuk menjadikan mereka berhenti dari kesesatan. Al-Qur’an merupakan hikmah yang sangat agung, namun peringatan apa lagi yang bermanfaat bagi orang yang bersikeras untuk tetap di atas kekafiran? Hai Rasulullah, berpalinglah dari mereka, dan biarkan mereka hingga hari ketika malaikat menyeru kepada perkara besar, saat hati akan ketakutan karena menyaksikan hari kiamat hari perhitungan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. وَلَقَدْ جَآءَهُم مِّنَ الْأَنۢبَآءِ مَا فِيهِ مُزْدَجَرٌ (Dan sesungguhnya telah datang kepada mereka beberapa kisah yang di dalamnya terdapat cegahan (dari kekafiran)) Yakni telah diberitakan kepada orang-orang kafir Makkah kabar-kabar tentang umat-umat pendusta yang diceritakan dalam al-Qur’an yang cukup untuk menghentikan keburukan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3-4. Mereka mendustakan Nabi SAW dan mengikuti hawa nafsu mereka yang batil. Yaitu hawa nafsunya dihiasi oleh setan dengan kewas-wasan. Setiap sesuatu yang telah mencapai tujuannya itu sudah ditetapkan, baik itu baik atau buruk. Sungguh telah datang kepada orang-orang musyrik Quraisy tentang kabar-kabar umat terdahulu yang pendusta sebagai peringatan kepada mereka tentang kesyirikan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sungguh benar-benar telah datang kepada mereka beberapa berita} kabar umat-umat yang mendustakan {yang di dalamnya terdapat ancaman} kesudahan untuk mencegah mereka dari kekufuran mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4. Allah berfirman, menjelaskan bahwa mereka itu tidak memiliki I’tikad baik dan niat untuk mengikuti petunjuk. “Dan sungguh telah datang kepada mereka beberapa kisah,” yaitu berita-berita sebelumnya dan yang akan datang serta berbagai mukjizat nyata, “yang di dalamnya terdapat cegahan (dari kekafiran),” artinya sesuatu yang dapat mencegah mereka dari kesesatan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qamar ayat 4: Ketahuilah wahai Nabi Allah bahwa telah datang pada kafir Quraisy kabar-kabar dari umat-umat sebelum mereka. Sebagiannya adalah kabar tentang mukjizat yang nyata dan bukti-bukti yang jelas; Yang menghalangi mereka, dari melanggar aturan-aturan Allah, dan keberlangsungan kekafiran mereka serta kesyirikan, dan cukuplah persaksian akan hal itu dari kebinasaan negeri mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala juga berfirman menerangkan bahwa mereka tidak memiliki maksud yang baik dan keinginan mengikuti petunjuk. Yaitu kisah dibinasakannya umat-umat yang mendustakan rasul mereka. Sehingga mereka tidak berbuat kafir lagi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qamar Ayat 4",
    "description": "Dan sungguh, telah datang kepada mereka beberapa kisah yang di dalamnya terdapat ancaman bagi mereka untuk tidak berbuat ingkar dan syirik. 5-6. Wahai nabi Muhammad, peristiwa-peristiwa yang engkau sam-paikan kepada umatmu adalah hikmah, yaitu ilmu amaliah dan amal ilmiah, yang sempurna kebenaran dan kejelasannya. Tetapi, sesungguhnya peringatan-peringatan itu tidak berguna bagi mereka. Maka, berpalinglah engkau dari mereka! orang musyrik itu akan menghadapi masa yang mengerikan, yaitu pada hari ketika penyeru, ketika malaikat atau utusan-Nya, mengajak mereka kepada sesuatu yang tidak menyenangkan, yaitu datangnya kiamat dan keharusan setiap orang mempertanggung jawabkan perbuatannya."
  }
]