[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sungguh Kami telah memudahkan lafazh al-Quran ini untuk dibaca dan dihafal, juga makna-maknanya untuk dipahami dan direnungkan bagi siapa yang ingin mengambil pelajaran. Maka adakah orang yang mau mengambil nasihat?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Dan sungguh telah Kami mudahkan Al-Qur`ān untuk diingat dan diambil pelajarannya, maka adakah orang yang mengambil petuah dari pelajaran dan nasihat yang ada di dalamnya?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "40. Dan sungguh Kami telah menjadikan al-Qur’an mudah untuk ditadabburi, dibaca, dan dihafal bagi orang yang ingin menjadikannya pelajaran. Maka adakah orang yang menjadikannya pelajaran?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "40. Kami mudahkan Al-Quran itu untuk dihafal, diingat dan digunakan sebagai nasehat. Lalu apakah ada yang mengingatnya?!"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh Kami benar-benar telah memudahkan Al-Qur’an sebagai pelajaran. Maka adakah orang yang mau mengambil pelajaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "33-40. “Kaum Luth pun telah mendustakan,” Luth ketika menyeru mereka untuk menyembah Allah semata, yang tidak ada sekutu bagiNya, ketika Luth melarang mereka melakukan kesyirikan dan kekejian yang belum pernah dilakukan seorang pun dari seluruh alam, mereka mendustakan Nabi Luth dan tetap berada dalam kesyirikan dan perbuatan keji hingga para malaikat yang datang menemui Luth dalam wujud tamu pun ketika berita itu terdengar oleh kaumnya, mereka segera mendatangi dan ingin melakukan kekejian terhadap mereka, semoga Allah melaknat dan memperburuk mereka, dan Nabi Luth pun menyembunyikan tamu-tamunya dari kaumnya. Kemudian Allah memerintahkan Jibril, kemudian Jibril mencolok mata mereka dengan sayapnya dan Luth juga mengancam mereka akan hantaman dan siksaan Allah. “Maka mereka membantah ancaman-ancaman.” “Sesungguhnya Kami telah menghembuskan kepada mereka angin yang membawa batu-batu (yang menimpa mereka),” Allah membalik tanah mereka, yang atas dijadikan bawah dan mereka dihujani batu yang berasal dari neraka yang menyala-nyala yang diberi tanda dari sisi Rabbmu bagi orang-orang yang melampaui batas. Allah menyelamatkan Nabi Luth dan keluarganya dari siksaan besar sebagai balasan bagi mereka dan rasa syukur mereka terhadap Rabb mereka serta ibadah mereka kepada Allah semata, yang tidak ada sekutu bagiNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qamar ayat 40: 39-40. Telah berlalu tafsirnya pada ayat 16 dan 17 dari surat ini."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qamar Ayat 40",
    "description": "Allah menuturkan kisah ini untuk mengingatkan betapa besar nikmat-Nya kepada manusia. Allah ingin agar manusia mau mengambil dari kisah itu pelajaran bagi kehidupannya. Dan sungguh, telah kami mudahkan Al-Qur'an untuk dijadikan peringatan, maka adakah orang yang secara sungguh-sungguh mau mengambil pelajaran darinya sehingga Allah melimpahkan karunia dan membantunya memahami isinya'41-42. Dari kisah kaum nabi lut Allah beralih menyebut kisah fira'un dan kaumnya. Dan sungguh, peringatan kami telah datang kepada keluarga fira'un dan kaumnya agar mereka beriman kepada Allah yang esa. Namun, mereka mendustakan mukjizat-Mukjizat kami semuanya yang ditunjukkan oleh nabi musa, maka kami azab mereka dengan azab dari Allah yang mahaperkasa, lagi mahakuasa."
  }
]