[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka mendustakan semua bukti-bukti Kami yang menunjukkan atas keesaan Kami dan kenabian nabi-nabi Kami, maka Kami mengazab mereka dengan azab sebagai hukuman dari yang Mahaperkasa yang tidak terkalahkan, lagi Mahakuasa atas apa yang Dia kehendaki."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "42. Mereka mendustakan bukti-bukti dan hujah-hujah yang datang kepada mereka dari sisi Kami, maka Kami siksa mereka kerena pendustaan mereka terhadap bukti-bukti itu sebagai balasan dari Yang Maha Perkasa yang tidak ada seorang pun yang mampu mengalahkan-Nya, Mahakuasa tidak ada sesuatu pun yang melemahkan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "42. كَذَّبُوا۟ بِـَٔايٰتِنَا كُلِّهَا (Mereka mendustakan mukjizat Kami semuanya) Yang dimaksud adalah sembilan mukjizat yang telah disebutkan sebelumnya. فَأَخَذْنٰهُمْ أَخْذَ عَزِيزٍ مُّقْتَدِرٍ(lalu Kami azab mereka sebagai azab dari Yang Maha Perkasa lagi Maha Kuasa) Yakni Kami mengazab mereka dengan azab yang penuh pembalasan dan kemampuan untuk membinasakan mereka, tidak ada yang dapat lolos darinya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "42. Namun mereka mendustakan mukjizat dan ayat-ayat Sembilan yang disampaikan semua oleh Musa. Lalu Kami timpakan kepada mereka azab dari Dzat yang Maha Kuat lagi Maha Kuasa atas segala sesuatu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka mendustakan semua ayat-ayat Kami. Maka Kami mengazab mereka dengan azab Dzat Yang Maha perkasa} yang Maha Perkasa dalam membalas {lagi Maha kuasa} Maha Kuasa tidak ada apa pun yang bisa melemahkanNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "41-42. “Dan sungguh telah datang kepada kaum Fir”un ,” yakni Fir’aun dan kaumnya, “ancamna-ancaman.” Allah mengutus Nabi Musa, kalimullah, kepada mereka dan dikuatkan dengan berbagai tanda-tanda kebesaran, penjelasan-penjelasan, dan berbagai mukjizat nyata. Nabi Musa menunjukkan berbagai pelajaran yang belum pernah ditunjukkan pada yang lain, namun mereka mendustakan seluruh tanda-tanda kebesaran Allah sehingga mereka disiksa dengan siksaan Dzat Yang Mahaperkasa lagi Mahakuasa, Allah menenggelamkan Fir’aun dan kaumnya di lautan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qamar ayat 42: 42. كَذَّبُوا۟ بِـَٔايٰتِنَا كُلِّهَا (Mereka mendustakan mukjizat Kami semuanya) Yang dimaksud adalah sembilan mukjizat yang telah disebutkan sebelumnya. فَأَخَذْنٰهُمْ أَخْذَ عَزِيزٍ مُّقْتَدِرٍ(lalu Kami azab mereka sebagai azab dari Yang Maha Perkasa lagi Maha Kuasa) Yakni Kami mengazab mereka dengan azab yang penuh pembalasan dan kemampuan untuk membinasakan mereka, tidak ada yang dapat lolos darinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya 9 buah mukjizat yang diberikan Allah kepada Nabi Musa ‘alaihis salam. Maksud dari disebutkannya kisah-kisah ini adalah untuk memperingatkan manusia dan orang-orang yang mendustakan Nabi Muhammad shallallahu 'alaihi wa sallam. Oleh karena itulah, Allah Subhaanahu wa Ta'aala berfirman, “Apakah orang-orang kafir di lingkunganmu (kaum musyrikin) lebih baik dari mereka.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qamar Ayat 42",
    "description": "41-42. Dari kisah kaum nabi lut Allah beralih menyebut kisah fira'un dan kaumnya. Dan sungguh, peringatan kami telah datang kepada keluarga fira'un dan kaumnya agar mereka beriman kepada Allah yang esa. Namun, mereka mendustakan mukjizat-Mukjizat kami semuanya yang ditunjukkan oleh nabi musa, maka kami azab mereka dengan azab dari Allah yang mahaperkasa, lagi mahakuasa. 43. Allah kemudian mengalihkan arah komunikasi kepada kaum musyrik mekah. Wahai kaum musyrik, apakah orang-orang kafir di lingkunganmu yang lebih baik daripada mereka yang telah dikisahkan itu, ataukah kamu telah mempunyai jaminan kebebasan dari azab seperti yang tercantum dalam kitab-kitab terdahulu, sehingga kamu bersikeras untuk ingkar'"
  }
]