[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah orang-orang kafir kalian (wahai orang-orang Quraisy) lebih baik daripada orang-orang yang telah disebutkan di atas yang telah binasa karena pendustaan mereka, atau kalian punya jaminan pembebasan dari azab Allah adalam kitab-kitab suci yang diturunkan kepada para nabi bahwa kalian akan selamat dari azab?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "43. Apakah orang-orang kafir dari kalian -wahai penghuni Makkah- lebih baik daripada orang-orang kafir yang telah disebutkan itu; kaum Nabi Nuh, kaum 'Ād, Ṡamūd, kaum Nabi Lūṭ, Fir'aun dan kaumnya? Ataukah kalian mempunyai jaminan kebebasan dari siksa Allah yang disebutkan dalam kitab-kitab samawi?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "43-45. Allah mengingkari orang-orang kafir Makkah: “Apakah orang-orang kafir kalian itu lebih baik dan lebih kuat daripada umat-umat terdahulu yang telah binasa dan jauh dari rahmat Allah itu? Atau kalian telah memiliki jaminan keselamatan dari azab Allah yang telah tertulis dalam kitab-kitab yang telah diturunkan? Atau mereka berkata, ‘Kami adalah orang-orang yang yakin -dengan jumlah dan kekuatan kami- dapat mengalahkan Muhammad’? Sungguh orang-orang itu akan terkalahkan dan lari ketakutan, sebagaimana yang terjadi pada perang Badar."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "43. أَكُفَّارُكُمْ خَيْرٌ مِّنْ أُو۟لٰٓئِكُمْ (Apakah orang-orang kafirmu (hai kaum musyrikin) lebih baik dari mereka itu) Yakni kalian tidak lebih baik dari mereka sehingga kalian dapat merasa aman dari azab yang menimpa mereka saat mereka mendustakan rasul mereka. أَمْ لَكُم بَرَآءَةٌ فِى الزُّبُرِ(atau apakah kamu telah mempunyai jaminan kebebasan (dari azab) dalam Kitab-kitab yang dahulu) Ini merupakan pengingkaran bahwa mereka memiliki jaminan akan terbebas dari azab Allah yang tercantum dalam kitab-kitab para Nabi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "43. Apakah orang-orang kafir kalian lebih baik dan lebih kuat daripada kaum-kaum terdahulu yang telah dihancurkan wahai suku Quraisy. Atau kalian tidak mau tahu tentang azab Allah yang terkandung dalam kitab-kitab yang telah diturunkan sebelumnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apakah orang-orang kafir di lingkungan kalian} Wahai penduduk Mekkah {lebih baik daripada mereka ataukah kalian telah mempunyai kebebasan} kebebasan dari hukuman dan azab {dalam kitab-kitab} kitab-kitab samawi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "43. Maksud dari pemaparan kisah-kisah ini adalah sebagai peringatan bagi manusia dan orang-orang yang mendustakan Nabi Muhammad, dan karena itu Allah berfirman, “Apakah orang-orang kafirmu (hai kaum musyrikin) lebih baik dari mereka itu,” artinya, apakah mereka yang mendustakan Rasul terbaik lebih baik dari orang-orang yang mendustakan rasul-rasul sebelumnya yang dibinasakan Allah dan ditimpa berbagai azab itu? Jika orang-orang kafir Makkah lebih baik dari mereka, maka mereka memiliki kemungkinan untuk bisa selamat dari azab dan tidak akan tertimpa siksaan yang menimpa orang-orang buruk sebelum mereka. Namun tidak demikian halnya, orang-orang kafir Makkah tidak lebih buruk dari mereka dan tidak pula lebih baik dari mereka. “Atau apakah kamu telah mempunyai jaminan kebebasan (dari azab) dalam kitab-kitab yang dahulu?” artinya, apakah Allah memberikan kalian janji dalam kitab-kitab yang diturunkan pada para nabi sebelumnya, kalian pada saat itu mengadakan perjanjian bahwa kalian akan selamat berdasarkan pemberitahuan dan janji Allah? Tidak demikian halnya, bahkan mustahil secara akal dan syariat jika mereka mendapatkan jaminan bebas azab yang tertulis dalam kitab-kitab samawi yang mencakup keadilan dan hikmah. Bukanlah termasuk hikmah jika orang-orang seperti itu menentang dan mendustakan rasul terbaik dan paling mulia di sisi Allah itu mendapatkan keselamatan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qamar ayat 43: Allah menakuti-nakuti orang-orang kafir Mekkah dengan berkata : Apakah kalian wahai orang-orang yang mendustkan lagi sombong dimana kalian telah mendustkan Rasulullah Muhammad ﷺ; Lebih baik dan lebih banyak pelindung dan penghalang (dari adzab) kalian daripada umat-umat sebelum kalian ?, tentu jawabannya adalah tidak, kalian tidaklah lebih kuat dibandungkan mereka (umat-umat yang terdahulu), tidak juga jumlah kalian, atau apakah kalaian memiliki kitab-kitab suci yang diturunkan oleh Allah sehingga mengokohkan pendirian kalian yang berlepas diri dari Rasul ﷺ, dan kalian tidak mau mengambil dari Rasul ﷺ karena sebab kekufuran kalian ?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kaum Nuh dan kaum-kaum setelahnya yang mendustakan. Jika mereka (kaum musyrikin) lebih baik dari mereka, maka mereka bisa selamat dari azab dan tidak tertimpa azab seperti yang menimpa generasi sebelum mereka, tetapi kenyataannya mereka sama atau bahkan lebih buruk dari mereka. Ataukah Allah memberikan kepadamu perjanjian-Nya dan jaminan-Nya untuk selamat dari azab yang tertera dalam kitab-kitab yang Allah turunkan, sehingga ketika itu kamu bisa meyakini bahwa kamu akan selamat karena berita Allah dan janji-Nya? Ternyata tidak ada, bahkan tidak mungkin secara akal maupun syara’ tertulis jaminan bebas dari azab untuk mereka dalam kitab-kitab samawi yang mengandung keadilan dan hikmah, karena tidak termasuk hikmah orang-orang seperti mereka yang mendustakan lagi membangkang rasul yang paling mulia (Nabi Muhammad shallallahu 'alaihi wa sallam) akan mendapat jaminan selamat dari azab. Tinggallah yang mereka miliki, yaitu kekuatan pada diri mereka untuk membela diri dari azab. Oleh karena itu, Allah Subhaanahu wa Ta'aala memberitahukan, bahwa mereka mengatakan, “Kami ini golongan yang bersatu yang pasti menang.\" Pertanyaan di ayat ini adalah untuk menafikan, yakni bahkan tidak demikian."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qamar Ayat 43",
    "description": "Allah kemudian mengalihkan arah komunikasi kepada kaum musyrik mekah. Wahai kaum musyrik, apakah orang-orang kafir di lingkunganmu yang lebih baik daripada mereka yang telah dikisahkan itu, ataukah kamu telah mempunyai jaminan kebebasan dari azab seperti yang tercantum dalam kitab-kitab terdahulu, sehingga kamu bersikeras untuk ingkar' 44. Peringatan itu tidak diperhatikan oleh kaum musyrik mekah. Atau mereka mengatakan dengan penuh kesombongan, 'kami ini golongan yang sangat kompak dan selalu bersatu. Kami adalah golongan yang pasti menang dalam menghadapi siapa saja. '."
  }
]