[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bahkan apakah orang-orang kafir Makkah itu berani berkata, “Kami adalah orang-orang yang berakal dan bersikap tegas, kami bersatu, kami adalah kelompok yang menang, siapa yang ingin menimpakan keburukan kepada kami pasti tidak akan sanggup melakukannya?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "44. Bahkan apakah orang-orang kafir dari penduduk Makkah itu berkata, “Kami adalah golongan bersatu yang pasti menang menghadapi orang-orang yang ingin berbuat jahat terhadap kami dan ingin memecah belah kesatuan kami.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "44. أَمْ يَقُولُونَ نَحْنُ جَمِيعٌ مُّنتَصِرٌ (Atau apakah mereka mengatakan: “Kami adalah satu golongan yang bersatu yang pasti menang”) Yakni pasukan yang tidak mungkin dilawan karena jumlah dan kekuatannya yang besar; atau kami adalah golongan yang tidak mungkin terkalahkan oleh musuh."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "44. Ataukan mereka seolah-olah berkata: “kami adalah kelompok yang bersatu dan akan menang atas musuh-musuh kami, karena jumlah dan kekuatan kami banyak”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Atau apakah mereka mengatakan,“Kami adalah golongan yang pasti menang”} Kami adalah golongan yang bersatu melawan orang yang melawan kami dan kami pasti akan mengalahkan musuh-musuh kami"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "44. Tidak tersisa apa pun pada mereka selain kekuatan yang mereka jadikan penolong, maka Allah memberitahukan bahwa mereka berkata, “Kami adalah satu golongan yang bersatu yang pasti menang.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qamar ayat 44: 44-45. Allah mengabarkan mereka orang-orang kafir karena sebab keangkuhan mereka, mereka berkata : Kami semua berada dalam satu kelompok, kami akan saling menolong satu sama lain bagi siapa yang memusuhi kami. Allah mencerai beraikan mereka, dan Allah mengabarkan bahwa seluruh musyrik Mekkah akan ditaklukkan dan dipukul mundur di hadapan kaum muslimin, dan ini adalah apa yang terjadi di perang badar. Sungguh sempurna petolongan Allah atas islam; Dipukul mundur seluruh musuh dan terbunuh dedengkot mereka seperti Abu Jahl dan yang semisal dengannya, dengan ditawan tujuh puluh orang dari mereka, inilah keadaan orang-orang kafir dan keangkuhannya, celaka mereka semua."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qamar Ayat 44",
    "description": "Peringatan itu tidak diperhatikan oleh kaum musyrik mekah. Atau mereka mengatakan dengan penuh kesombongan, 'kami ini golongan yang sangat kompak dan selalu bersatu. Kami adalah golongan yang pasti menang dalam menghadapi siapa saja. '45-46. Allah menegasikan keyakinan kaum kafir itu. Golongan itu pasti akan dikalahkan oleh kaum yang beriman dan mereka akan mundur ke belakang sambil berlari pontang-panting. Kekalahan mereka di dunia bukan akhir segalanya karena di akhirat mereka juga akan menerima azab atas kekafirannya. Bahkan, hari kiamat itulah hari paling sulit yang dijanjikan oleh Allah kepada mereka, dan hari kiamat itu lebih dahsyat daripada semua bencana dunia dan lebih pahit karena siksa itu berlanjut tanpa akhir."
  }
]