[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang kafir Makkah itu akan kalah oleh orang-orang yang beriman, mereka akan melarikan diri dan memberikan punggung mereka kepada orang-orang beriman. Dan ini telah terjadi dalam Perang Badar."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "45. Kesatuan orang-orang kafir itu akan dikalahkan dan mereka melarikan diri di hadapan orang-orang yang beriman. Dan ini telah terjadi pada perang Badar."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "45. سَيُهْزَمُ الْجَمْعُ (Golongan itu pasti akan dikalahkan) Yakni golongan orang-orang kafir Makkah, atau orang-orang Arab secara umum. وَيُوَلُّونَ الدُّبُرَ (dan mereka akan mundur ke belakang) Dan Allah telah menjadikan mereka kalah pada perang Badar dan lari ke belakang, para pemimpin kemusyrikan dan kekafiran terbunuh pada perang tersebut. Walhamdulillah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "45. Pasukan Quraisy yang kuat itu akan ditaklukan sehingga mereka lari karena dikalahkan. Dan Allah telah menaklukkan mereka saat perang Badar. Saat perang Badar, orang-orang Musyrik berkata: {Kami semua akan menang} lalu turunlah ayat: {Sayuhzamul jam’u wa yuwalluunad dubura}"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Golongan itu pasti akan dikalahkan} golongan kafir Mekkah dihadapan golongan orang mukmin {dan mereka berbalik ke belakang} mereka melarikan diri dalam keadaan dikalahkan, hal itu terjadi pada hari perang Badar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "45. Allah berfirman seraya menjelaskan kelemahan mereka dan mereka akan dikalahkan, “Golongan itu pasti akan dikalahkan dan mereka akan mundur ke belakang” dan terjadilah seperti yang diberitakan Allah. Allah mengalahkan golongan mereka yang lebih besar dalam peristiwa Badar. Para centeng dan pembesar mereka terbunuh dan mereka pun takluk. Allah memberikan kemenangan untuk Agama, Nabi dan golonganNya yang beriman."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qamar ayat 45: 44-45. Allah mengabarkan mereka orang-orang kafir karena sebab keangkuhan mereka, mereka berkata : Kami semua berada dalam satu kelompok, kami akan saling menolong satu sama lain bagi siapa yang memusuhi kami. Allah mencerai beraikan mereka, dan Allah mengabarkan bahwa seluruh musyrik Mekkah akan ditaklukkan dan dipukul mundur di hadapan kaum muslimin, dan ini adalah apa yang terjadi di perang badar. Sungguh sempurna petolongan Allah atas islam; Dipukul mundur seluruh musuh dan terbunuh dedengkot mereka seperti Abu Jahl dan yang semisal dengannya, dengan ditawan tujuh puluh orang dari mereka, inilah keadaan orang-orang kafir dan keangkuhannya, celaka mereka semua."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala berfirman menerangkan kelemahan mereka dan bahwa mereka akan kalah. Ternyata demikian. Mereka kalah dalam perang Badar, tokoh-tokoh mereka mati dalam perang itu, sedangkan Rasulullah shallallahu 'alaihi wa sallam dan para sahabatanya memperoleh kemenangan. Di samping itu, mereka mempunyai waktu yang telah dijanjikan, yaitu hari Kiamat sebagaimana firman Allah Ta’ala di ayat 46, “Bahkan hari Kiamat itulah hari yang dijanjikan kepada mereka dan hari Kiamat itu lebih dahsyat dan lebih pahit.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qamar Ayat 45",
    "description": "45-46. Allah menegasikan keyakinan kaum kafir itu. Golongan itu pasti akan dikalahkan oleh kaum yang beriman dan mereka akan mundur ke belakang sambil berlari pontang-panting. Kekalahan mereka di dunia bukan akhir segalanya karena di akhirat mereka juga akan menerima azab atas kekafirannya. Bahkan, hari kiamat itulah hari paling sulit yang dijanjikan oleh Allah kepada mereka, dan hari kiamat itu lebih dahsyat daripada semua bencana dunia dan lebih pahit karena siksa itu berlanjut tanpa akhir"
  }
]