[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Hari Kiamat adalah hari yang dijanjikan kepada mereka, di mana mereka akan dibalas dengan apa yang memang berhak mereka terima. Hari kiamat itu lebih besar dan lebih berat dari azab yang mereka derita di Perang Badar."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "46. Bahkan hari Kiamat yang mereka dustakan adalah hari yang dijanjikan kepada mereka yang mana pada saat itu mereka disiksa. Dan hari Kiamat lebih agung dan lebih menyengsarakan dibanding dengan apa yang mereka dapatkan dari siksa dunia pada perang Badar."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "46-50. Namun hari kiamat adalah waktu yang dijanjikan untuk kedatangan azab mereka, dan azab pada hari kiamat berupa neraka Jahannam lebih menyakitkan daripada azab dunia. Sungguh orang-orang kafir itu sangat jauh dari kebenaran dan berada dalam neraka yang membara pada hari ketika malaikat menyeret mereka dengan kasar ke dalam azab. Dan akan dikatakan kepada mereka: ‘Rasakanlah beratnya azab neraka Jahannam.’ Selurun makhluk Kami ciptakan dengan ketetapan yang telah Kami ketahui dan telah tercatat. Dan jika Kami menghendaki sesuatu maka Kami cukup mengatakan ‘Jadilah’, maka hal itu akan segera terjadi."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "46. بَلِ السَّاعَةُ مَوْعِدُهُمْ (Sebenarnya hari kiamat itulah hari yang dijanjikan kepada mereka) Yakni waktu azab mereka di akhirat. Dan bukan azab yang mereka dapatkan di dunia berupa mati terbunuh, tertawan, atau terkalahkan merupakan puncak azab yang dijanjikan bagi mereka, namun itu hanyalah pembukaan dan pendahuluannya saja. وَالسَّاعَةُ أَدْهَىٰ( dan kiamat itu lebih dahsyat) Yakni azab di hari kiamat lebih menyakitkan dan menghinakan mereka. وَأَمَرُّ(dan lebih pahit) Yakni lebih pahit dari azab di dunia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "46. Namun pada hari kiamat, mereka telah disiapkan azab dan hisab. Azab hari kiamat itu lebih dahsyat derita dan kegetirannya daripada azab dunia"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Bahkan hari kiamat itulah hari yang dijanjikan kepada mereka. Hari kiamat itu lebih dahsyat} lebih agung dan lebih keras {dan lebih pahit} lebih pahit daripada pembunuhan dan penawanan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "46. Meski demikian, mereka memiliki janji di mana seluruh manusia dari yang pertama hingga terakhir akan dikumpulkan begitu pula seluruh orang yang mendapat ujian di dunia dan orang yang menikmati kelezatan dunia, karena itulah Allah berfirman, “Sebenarnya Hari Kiamat itulah hari yang dijanjikan kepada mereka.” Di hari itu mereka akan dibalas dan diperlakukan secara adil. “Dan kiamat itu lebih dahsyat dan lebih pahit,” artinya, lebih agung, lebih berat dan lebih besar dari yang diperkirakan atau yang ada dalam bayangan angan-angan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qamar ayat 46: Allah memperingatan orang-orang kafir dan mengabarkan bahwasanya apa yang turun kepadanya dari adzab di dunia hanyalah pembukaan (mukaddimah) dari apa yang mereka akan tunggu dari adzab di hari kiamat, dan adzab itu tidak diragukan lagi lebih besar, buruk dan keras dari apa yang mereka alami pada perang badar; Adzab tersebut adalah bagian yang kekal di neraka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dari apa yang dibayangkan di pikiran atau yang terlintas di hati. Dari azab di dunia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qamar Ayat 46",
    "description": "45-46. Allah menegasikan keyakinan kaum kafir itu. Golongan itu pasti akan dikalahkan oleh kaum yang beriman dan mereka akan mundur ke belakang sambil berlari pontang-panting. Kekalahan mereka di dunia bukan akhir segalanya karena di akhirat mereka juga akan menerima azab atas kekafirannya. Bahkan, hari kiamat itulah hari paling sulit yang dijanjikan oleh Allah kepada mereka, dan hari kiamat itu lebih dahsyat daripada semua bencana dunia dan lebih pahit karena siksa itu berlanjut tanpa akhir. 47. Uraian tentang peringatan terhadap kaum kafir mekah diikuti oleh penjelasan mengenai siksa bagi pendosa dan pahala bagi orang yang bertakwa. Sungguh, orang-orang yang berdosa berada dalam kesesatan saat di dunia, dan di akhirat kelak akan berada dalam neraka yang penuh siksa pedih."
  }
]