[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "47-48. Sesungguhnya orang-orang yang gemar berbuat dosa itu dalam kesesatan dari jalan yang benar, azab dan kesengsaraan, di hari mereka diseret di dalam neraka di atas wajah mereka. Dikatakan kepada mereka, “Rasakanlah kerasnya siksa api Neraka Jahanam.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "47. Sesungguhnya orang-orang yang melakukan dosa dengan kekufuran dan perbuatan maksiat itu berada dalam kesesatan dari kebenaran, siksa dan kesusahan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "47. إِنَّ الْمُجْرِمِينَ فِى ضَلٰلٍ وَسُعُرٍ (Sesungguhnya orang-orang yang berdosa berada dalam kesesatan (di dunia) dan dalam neraka) Telah disebutkan fatsir ayat yang serupa pada surat ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "47. Sesungguhnya orang-orang kafir dan orang-orang musyrik yang suka menentang itu berada dalam kesalahan, sangat jauh dari kebenaran, dan dalam neraka Jahanam mereka dibakar. Imam Muslim dan Tirmidzi dari Abu Hurairah berkata: “Orang-orang musyrik Quraisy mendatangi Rasulallah dan menentangnya dalam jumlah yang banyak, lalu Allah SWT menurunkan ayat {Innatl mujrimiina fii dhalaalin wa su’urin} sampai ayat {sesungguhnya kami menciptakan segala sesuatu sesuai ukurannya}”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya orang-orang yang durhaka berada dalam kesesatan dan neraka Sa‘ir} penderitaan dan azab"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "47. “Sesungguhnya orang-orang yang berdosa,” yaitu orang-orang yang banyak berbuat dosa-dosa besar berupa kesyirikan dan kemaksiatan lain, “berada dalam kesesatan (di dunia) dan dalam neraka,” artinya, mereka tersesat di dunia; sesat di akhirat. Pada Hari Kiamat mereka berada dalam siksaan yang pedih dan api yang dinyalakan pada tubuh mereka hingga merasuk ke dalam hati mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qamar ayat 47: 47-48. Allah menjelaskan bahwa orang-orang pendosa dan yang melanggar aturan-aturan Allah dengan syirik dan maksiat; Mereka dalam kesesatan dan dosa serta keangkuhan dan kesombongan di kehidupan dunia, dan mereka di akhirat di neraka yang menyala-nyala yang akan membakar tubuh-tubuh mereka dan juga hati-hati mereka. Muka mereka akan diseret menuju jahannam dengan penghinaan, dan dikatakan kepada mereka dengan maksud menyiksa dan kasar : Rasakanlah oleh kalian dari adzab panasnya api neraka dan siksaannya sebagai balasan yang layak atas pendustaan kalian kepada Rasulullah dari setiap apa yang datang kepadanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni banyak melakukan dosa-dosa besar seperti syirk dan maksiat lainnya. Yakni dalam kebingungan dan kesengsaraan. Mereka tidak memiliki ilmu untuk mengetahui perbuatan apa yang dapat menyampaikan mereka ke surga apalagi sampai mengamalkannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qamar Ayat 47",
    "description": "Uraian tentang peringatan terhadap kaum kafir mekah diikuti oleh penjelasan mengenai siksa bagi pendosa dan pahala bagi orang yang bertakwa. Sungguh, orang-orang yang berdosa berada dalam kesesatan saat di dunia, dan di akhirat kelak akan berada dalam neraka yang penuh siksa pedih. 48. Pada hari mereka yang kafir itu diseret ke neraka pada wajahnya, dikatakan kepada mereka, 'rasakanlah sentuhan api neraka yang sangat panas itu. '."
  }
]