[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "47-48. Sesungguhnya orang-orang yang gemar berbuat dosa itu dalam kesesatan dari jalan yang benar, azab dan kesengsaraan, di hari mereka diseret di dalam neraka di atas wajah mereka. Dikatakan kepada mereka, “Rasakanlah kerasnya siksa api Neraka Jahanam.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "48. Pada hari di saat mereka diseret di atas wajah mereka dan dikatakan kepada mereka sebagai bentuk penghinaan terhadap mereka, “Rasakanlah siksa Neraka.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "48. يَوْمَ يُسْحَبُونَ فِى النَّارِ عَلَىٰ وُجُوهِهِمْ (Ingatlah) pada hari mereka diseret ke neraka atas muka mereka) Pada hari itu akan dikatakan pada mereka: ذُوقُوا۟ مَسَّ سَقَر((Dikatakan kepada mereka): “Rasakanlah sentuhan api neraka!”) Yakni rasakanlah panas dan beratnya azab neraka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "48. Hari dimana mereka direbahkan di neraka di atas wajah mereka. Dikatakan pada mereka “Rasakanlah panasnya neraka dan deritanya”. Saqar adalah nama neraka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Pada hari (ketika) mereka diseret} mereka diserat {ke neraka di atas wajah mereka,“Rasakanlah sentuhan Saqar”} dikatakan kepada mereka,”rasakanlah kekerasan azab neraka Jahanam"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "48. “(Ingatlah) pada hari mereka diseret ke neraka atas muka mereka,” yang merupakan bagian tubuh mereka yang terhormat, kepedihan neraka jauh lebih pedih dari yang lainnya. Mereka pun bersedih dan berduka karena siksaan itu. “(Dikatakan kepada mereka), ‘Rasakanlah sentuhan api neraka’,” artinya, rasakanlah kepedihan, hamburan, kemurkaan, serta kobaran api neraka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qamar ayat 48: 47-48. Allah menjelaskan bahwa orang-orang pendosa dan yang melanggar aturan-aturan Allah dengan syirik dan maksiat; Mereka dalam kesesatan dan dosa serta keangkuhan dan kesombongan di kehidupan dunia, dan mereka di akhirat di neraka yang menyala-nyala yang akan membakar tubuh-tubuh mereka dan juga hati-hati mereka. Muka mereka akan diseret menuju jahannam dengan penghinaan, dan dikatakan kepada mereka dengan maksud menyiksa dan kasar : Rasakanlah oleh kalian dari adzab panasnya api neraka dan siksaannya sebagai balasan yang layak atas pendustaan kalian kepada Rasulullah dari setiap apa yang datang kepadanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Muslim meriwayatkan dengan sanadnya yang sampai kepada Abu Hurairah ia berkata, “Kaum musyrikin Quraisy pernah datang berbantah-bantahan dengan Rasulullah shallallahu 'alaihi wa sallam tentang masalah qadar, maka turunlah ayat, “Pada hari mereka diseret ke neraka pada wajahnya. (Dikatakan kepada mereka), \"Rasakanlah sentuhan api neraka.\"-- Sungguh, Kami menciptakan segala sesuatu menurut ukuran.” (Terj. Al Qamar: 48-19) Hadits ini diriwayatkan pula oleh Tirmidzi juz 3 hal. 204, juz 4 hal. 191 dan ia berkata dalam kedua tempat itu, “Hasan shahih,” Ibnu Majah juga meriwayatkan di no. 83, Ahmad juz 2 hal. 444 dan 476, Ibnu Jarir juz 27 hal. 110, Baihaqi dalam Syu’abul Iman juz 1 hal. 136, dan Bukhari dalam Khalqu Af’aalil ‘Ibaad hal. 19, dan ia menyebutkan syahidnya di sana. Semuanya meriwayatkan dari jalan Ziyad bin Isma’il Al Makhzumi, Ibnu Ma’in berkata, “Ia adalah dha’if,” ‘Ali bin Al Madiniy berkata, “Ia seorang yang dikenal, berasal dari penduduk Mekah,” Abu Hatim berkata, “Haditsnya dicatat.” Nasa’i berkata, “Tidak apa-apa,” (diambil dari Tahdzibut Tahdzib). Dari keseluruhan perkataan para imam itu dapat disimpulkan bahwa haditsnya turun dari derajat hasan, akan tetapi menjadi kuat karena syahid-syahid yang telah disebutkan, wallahu a’lam. Syahid yang disebutkan oleh Bukhari dalam Khalqu Af’aalil ‘Ibaad adalah sbb. ia (Bukhari) berkata, “Telah menceritakan kepada kami Muhammad bin Yusuf, telah menceritakan kepada kami Yunus bin Al Harits, telah menceritakan kepada kami ‘Amr bin Syu’aib dari bapaknya dari kakeknya, ia berkata, “Ayat ini, “Sungguh, orang-orang yang berdosa berada dalam kesesatan (di dunia) dan akan berada dalam neraka (di akhirat).” (terj. Al Qamar: 47) turun tentang orang-orang yang memperdebatkan qadar.” Selanjutnya Imam Bukhari rahimahullah berkata, “Diriwayatkan dari Ibnu Abbas, Mu’adz bin Anas radhiyallahu 'anhum.” Thabrani juga meriwayatkan dalam Al Kabir juz 5 hal. 319 dari hadits Zurarah tanpa dinasabkan, dan dalam sanadnya terdapat Ibnu Zurarah seorang yang mubham (tidak jelas).” Wajah adalah anggota badan yang paling mulia dan jika dilukai tentu lebih menyakitkan daripada anggota badan yang lain. Mereka dihinakan di sana dan direndahkan, wal ‘iyaadz billah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qamar Ayat 48",
    "description": "Pada hari mereka yang kafir itu diseret ke neraka pada wajahnya, dikatakan kepada mereka, 'rasakanlah sentuhan api neraka yang sangat panas itu. '49-50. Apa yang terjadi pada semua makhluk sudah ditetapkan oleh Allah. Sungguh, kami menciptakan segala sesuatu menurut ukuran, yaitu suatu sistem dan ketentuan yang telah ditetapkan. Dan ketahuilah bahwa semua perintah kami yang menyangkut apa pun hanyalah diungkapkan dengan satu perkataan yang mudah dan cepat, seperti kejapan mata."
  }
]