[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Al-Quran yang datang kepada mereka ini adalah hikmah besar dan mendalam sekali. Maka peringatan apakah yang berguna bagi kaum yang berpaling dan mendustakannya?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Dan yang datang kepada mereka adalah hikmah yang sempurna agar hujah sampai ke mereka, maka peringatan tidak berguna bagi orang-orang yang tidak beriman kepada Allah dan hari akhir."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. حِكْمَةٌۢ بٰلِغَةٌ ۖ (Itulah suatu hikmah yang sempurna) Yakni al-Qur’an merupakan hikmah yang sempurna yang tidak ada kekuarangan di dalamnya. فَمَا تُغْنِ النُّذُرُ(maka peringatan-peringatan itu tidak berguna (bagi mereka)) Yakni peringatan tidak akan bermanfaat bagi orang-orang yang durhaka, karena kedurhakaan mereka memalingkan mereka dari menerima kebenaran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Al-Qur’an ini beserta ayat-ayat yang terkandung di dalamnya adalah pelajaran yang jelas dan hikmah yang sempurna bagi setiap orang yang berakal. Lalu apakah peringatan-peringatan itu akan berguna bagi orang yang bersikeras, teguh dan tetap pada kekufuran?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{hikmah yang sempurna} Al-Qur’an itu merupakan hikmah yang sempurna {tetapi peringatan-peringatan itu tidak berguna"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5. Itulah “suatu hikmah,” dari Allah yang “sempurna,” agar hujjah tegak untuk seluruh alam sehingga tidak seorang pun memiliki alasan kepada Allah setelah diutusnya para rasul. “Maka peringatan-peringatan itu tiada berguna (bagi mereka).” Seperti yang disebut dalam Firman Allah “meskipun datang kepada mereka segala macam keterangan, hingga mereka menyaksikan azab yang pedih.”–Yunus:97-"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qamar ayat 5: Allah menjelaskan bahwa Al Qur’an ini terdapat hikmah yang nyata dan sempurna yang datang dari Allah kepada mereka, untuk menegakkan hujjah kepada mereka para pengingkar, sehingga mereka tidak memiliki udzur, tidak juga berguna janji mereka dan kesombongan mereka sedikitpun; Karena sebab kesombongan mereka, menyebabkan mereka berpaling dari kebenaran."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Agar hujjah menjadi tegak terhadap orang-orang yang meyelisihi, dan tidak ada seorang pun yang dapat beralasan lagi di hadapan Allah Subhaanahu wa Ta'aala. Ayat ini seperti firman Allah Ta’ala di surah Yunus: 97: “Meskipun datang kepada mereka segala macam keterangan, hingga mereka menyaksikan azab yang pedih.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qamar Ayat 5",
    "description": "5-6. Wahai nabi Muhammad, peristiwa-peristiwa yang engkau sam-paikan kepada umatmu adalah hikmah, yaitu ilmu amaliah dan amal ilmiah, yang sempurna kebenaran dan kejelasannya. Tetapi, sesungguhnya peringatan-peringatan itu tidak berguna bagi mereka. Maka, berpalinglah engkau dari mereka! orang musyrik itu akan menghadapi masa yang mengerikan, yaitu pada hari ketika penyeru, ketika malaikat atau utusan-Nya, mengajak mereka kepada sesuatu yang tidak menyenangkan, yaitu datangnya kiamat dan keharusan setiap orang mempertanggung jawabkan perbuatannya. 5-6"
  }
]