[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Perintah Kami terhadap sesuatu manakala Kami menghendakinya hanyalah ucapan Kami sekali saja kepadanya, “Jadilah.” Maka ia pun terjadi seperti kedipan mata, tidak tertunda sekejap mata pun."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "50. Dan tidaklah perintah Kami jika Kami menginginkan sesuatu melainkan Kami hanya mengucapkan satu kalimat, yaitu, “Jadilah!”, maka jadilah apa yang Kami inginkan secara cepat, seperti kejapan mata."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "50. وَمَآ أَمْرُنَآ إِلَّا وٰحِدَةٌ كَلَمْحٍۭ بِالْبَصَرِ (Dan perintah Kami hanyalah satu perkataan seperti kejapan mata) Yakni hanya sekali perintah atau dengan satu kata, kecepatannya seperti kedipan mata, yaitu seperti ketika menutup kemudian membuka mata kembali."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "50. Kami tidak memerintahkan penciptaan sesuatu yang kami kehendaki kecuali hanya dengan satu kata yaitu {Kun Fayakuun} [QS Al-Baqarah 2/117 dan ayat-ayat lainnya] maka jadilan ciptaan itu secepat kedipan mata"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Perintah Kami tidak lain hanya sekali saja} kecuali satu kali ucapan, yaitu “Kun” {seperti kedipan mata} sehingga sesuatu tersebut terjadi dengan cepat seperti kedipan mata"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "50. Itu mudah bagi Allah, karena itu Allah berfirman, “Dan perintah Kami hanyalah satu perkataan seperti kejapan mata.” Jika Allah menghendaki sesuatu, Allah berfirman, “Jadilah,” maka jadilah sesuatu itu sesuai kehendakNya dalam sekejap mata tanpa letih dan susah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qamar ayat 50: Allah mengabarkan dengan agungnya kuasa-Nya dengan berkata : Dan tidaklah urusan Kami dalam menciptakan dan mewujudkan kecuali hanya Kami katakan “jadilah” maka jadi, maka datang seperti sekejap mata."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu ucapan “Kun” (Jadilah!) maka terjadilah dia. Allah Subhaanahu wa Ta'aala berfirman, “Sesungguhnya keadaan-Nya apabila Dia menghendaki sesuatu hanyalah berkata kepadanya, \"Jadilah!\" Maka terjadilah dia.” (Terj. Yaasin: 82)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qamar Ayat 50",
    "description": "49-50. Apa yang terjadi pada semua makhluk sudah ditetapkan oleh Allah. Sungguh, kami menciptakan segala sesuatu menurut ukuran, yaitu suatu sistem dan ketentuan yang telah ditetapkan. Dan ketahuilah bahwa semua perintah kami yang menyangkut apa pun hanyalah diungkapkan dengan satu perkataan yang mudah dan cepat, seperti kejapan mata. 51. Azab atas kaum-kaum terdahulu membuktikan betapa Allah mahakuasa. Dan sungguh, telah kami binasakan orang yang kekafirannya serupa dengan kamu, wahai kaum musyrik mekah. Maka, adakah di antara kamu orang yang mau mengambil pelajaran dari peristiwa-peristiwa itu'."
  }
]