[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sungguh Kami telah membinasakan orang-orang yang seperti mereka dalam kekafiran dari umat-umat yang telah berlalu. Apakah ada orang yang mengambil pelajaran dari apa yang menimpa mereka berupa azab dan hukuman?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "51. Dan sungguh telah Kami hancurkan orang-orang seperti kalian dalam kekufuran dari umat-umat yang terdahulu, adakah orang yang mengambil pelajaran dari hal itu dan meninggalkan kekufurannya?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "51-53. Sungguh Kami telah membinasakan orang-orang kafir seperti kalian yang ada di umat-umat terdahulu; maka adakah orang yang hendak mengambil pelajaran dari mereka? Dan segala perbuatan mereka, baik itu yang baik atau yang buruk, yang besar maupun yang kecil, telah tercatat dalam kitab catatan amalan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "51. وَلَقَدْ أَهْلَكْنَآ أَشْيَاعَكُمْ (Dan sesungguhnya telah Kami binasakan orang yang serupa dengan kamu) Yakni orang-orang dari umat terdahulu yang serupa dengan kalian dalam kekafiran hai orang-orang Quraisy. Pendapat lain mengatakan yang dimaksud adalah Kami telah membinasakan para pengikut dan penolong kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "51. Sunggah kami telah menghancurkan orang-orang yang menyeru[ai kalian kekufurannya dari golongan umat-umat terdahulu. Apakah ada (dari kalian) yang mengingat dan mempelajarinya?! Istifham tersebut bermakna perintah. Ingatlah dan pelajarilah nasehat-nasehat itu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sungguh Kami benar-benar telah membinasakan orang yang serupa dengan kalian} orang-orang yang menyerupai kalian dalam kekufuran dari golongan umat-umat terdahulu {Maka adakah orang yang mau mengambil pelajaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "51. “Dan sungguh telah Kami binasakan orang yang serupa dengan kamu,” dari kalangan umat-umat sebelum kalian yang mengetahui seperti halnya kalian dan mendustakan seperti halnya kalian, “maka adakah orang yang mau mengambil pelajaran?” orang yang mau mengambil pelajaran yang mengetahui sunnatullah dalam membinasakan orang-orang buruk, karena mereka itu sama, tidak ada perbedaan antara kedua golongan tersebut."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qamar ayat 51: Ketahuilah wahai orang-orang Quraisy bahwa Kami membinasakan yang semisal dengan kalian dari orang-orang yang mendustakan para Nabi mereka dari umat-umat tedahulu, dan memusnahkan dari akar-akarnya sebagaiamana sunnah Kami pada kaum-kaum semisal mereka, dengan adzab yang keras dan dengan beraneka ragam wasilah; Apakah kalian pada kaum-kaum ini tidak mengambil pelajaran ?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sehingga dia mengetahui bahwa Sunnatullah pada generasi terdahulu maupun yang akan datang adalah sama dan bahwa hikmah-Nya sebagaimana menghendaki untuk membinasakan orang-orang yang buruk itu, maka sama pula kepada mereka yang buruk yang serupa dengan generasi sebelum mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qamar Ayat 51",
    "description": "Azab atas kaum-kaum terdahulu membuktikan betapa Allah mahakuasa. Dan sungguh, telah kami binasakan orang yang kekafirannya serupa dengan kamu, wahai kaum musyrik mekah. Maka, adakah di antara kamu orang yang mau mengambil pelajaran dari peristiwa-peristiwa itu'52-53. Kami juga mengetahui apa saja yang berkaitan dengan mereka. Dan untuk membuktikan perilaku mereka, segala sesuatu yang telah mereka perbuat kapan dan di mana pun tercatat dengan rinci oleh malaikat kami dalam buku-buku catatan. Dan di samping itu, segala sesuatu baik yang kecil dan remeh maupun yang besar dan penting tertulis di sana dengan rinci."
  }
]