[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Amal-amal mereka, yang besar ataupun yang kecil, tercatat pada lembaran-lembaran mereka, dan mereka akan dibalas dengannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "53. Setiap hal kecil dari perbuatan dan ucapan, setiap hal besar dari perbuatan dan ucapan semuanya tertulis di lembaran-lembaran catatan perbuatan dan di Lauḥul Maḥfuẓ, dan mereka akan mendapatkan balasan atas perbuatan tersebut."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "53. وَكُلُّ صَغِيرٍ وَكَبِيرٍ مُّسْتَطَرٌ (Dan segala (urusan) yang kecil maupun yang besar adalah tertulis) Yakni segala amalan makhluk baik itu perkataan maupun perbuatan telah tertulis di lauhul mahfuhz, baik itu amalan yang kecil maupun yang besar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "53. Dan setiap perbuatan dan ucapan makhluk baik kecil maupun besar itu dicatat dan ditulis di lauhil mahfudz."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Segala yang kecil atau yang besar tertulis} tertulis dalam lembaran-lembaran amal dan Lauhil Mahfudz"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "53. “Dan segala (urusan) yang kecil maupun yang besar adalah tertulis,” artinya telah tercatat dan inilah hakikat Qadha’ dan Qadar, semua hal telah diketahui Allah dan ditulis di lauhil mahfuzh. Apa pun yang dikehendaki Allah pasti terjadi dan yang tidak dikehendakiNya tidak akan ada. Apa pun yang akan menimpa manusia tidak akan luput dan yang ditakdirkan luput tidak akan menimpanya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qamar ayat 53: 52-53. Allah menjelaskan bahwa seluruh amalan mereka orang-orang kafir telah dihitung; Maka segala yang mereka perbuat dari kaum (yang ada) baik maupun buruk telah tercatat dan terjaga dan akan dihisab oleh malaikat pencatat amalan. Kemudian Allah menjelaskan bahwa seluruh dari amalan-amalan makhluk, ucapannya, perbuatannya dan tindak-tanduk dari makhluk telah ditetapkan di Lauhul Mahfudz baik urusan kecil maupun besar, yang nampak maupun tersembunyi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dalam Al Lauhul Mahfuzh. Inilah hakikat qadha’ dan qadar, yakni segala sesuatu telah diketahui oleh Allah Subhaanahu wa Ta'aala, telah ditulis-Nya di sisi-Nya dalam Al Lauhul Mahfuzh, telah diciptakan-Nya, dan telah dikehendaki-Nya, sehingga apa yang dikehendaki-Nya pasti terjadi dan yang tidak dikehendaki-Nya tidak akan terjadi. Apa yang akan menimpa seseorang, maka tidak akan melesat, dan apa yang tidak akan menimpanya, maka tidak akan mengenainya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qamar Ayat 53",
    "description": "52-53. Kami juga mengetahui apa saja yang berkaitan dengan mereka. Dan untuk membuktikan perilaku mereka, segala sesuatu yang telah mereka perbuat kapan dan di mana pun tercatat dengan rinci oleh malaikat kami dalam buku-buku catatan. Dan di samping itu, segala sesuatu baik yang kecil dan remeh maupun yang besar dan penting tertulis di sana dengan rinci. 54-55. Bila orang-orang musyrik diseret pada wajahnya ke arah neraka, maka sungguh, orang-orang yang benar-benar bertakwa secara tulus berada di taman-taman dan sungai-sungai yang beragam. Mereka tinggal di tempat yang disenangi dan penuh kebahagiaan, di sisi tuhan yang mahakuasa."
  }
]