[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sesungguhnya orang-orang yang bertakwa berada dalam taman-taman yang besar dan sungai-sungai yang luas di Hari Kiamat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "54. Sesungguhnya orang-orang yang bertakwa dengan mengerjakan segala perintah-Nya dan menjauhi segala larangan-Nya berada di Surga-surga merasakan kenikmatan di dalamnya dan berada di sungai-sungai yang mengalir."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "54-55. Sungguh pada hari kiamat, orang-orang yang bertakwa kepada Allah dengan melakukan ketaatan akan berada dalam surga-surga yang memiliki sungai-sungai air tawar, dan berada pada derajat yang mulia di sisi Allah, Raja Yang Maha Agung dan Berkuasa atas segalanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "54. إِنَّ الْمُتَّقِينَ فِى جَنّٰتٍ وَنَهَرٍ (Sesungguhnya orang-orang yang bertakwa itu di dalam taman-taman dan sungai-sungai) Yakni dalam taman-taman yang bermacam-macam dan sungai-sungai yang mengalirkan air dan minuman yang beraneka macam."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "54. Sesungguhnya orang-orang yang takut dengan azab Allah dengan menjalankan perintah-perintahNya dan menjauhi larangan-laranganNya itu berada di taman-taman yang berbeda-beda dan sungai-sungai yang bermacam-macam"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya orang-orang yang bertakwa berada di taman-taman dan sungai} dan sungai-sungai"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "54-55. “Sesungguhnya orang-orang yang bertakwa” kepada Allah dengan mengerjakan perintah-perintahNya dan meninggalkan larangan-laranganNya, mereka yang menjauhi kesyirikan, dosa-dosa besar dan dosa-dosa kecil “di dalam taman-taman dan sungai-sungai,” yakni berada di dalam surga penuh kenikmatan, yang di dalamnya terdapat segala sesuatu yang belum pernah dilihat mata, belum pernah didengar telinga dan belum pernah terbersit dalam benak manusia, berupa pepohonan dengan buah ranum, sungai-sungai mengalir, istana-istana menjulang tinggi, rumah-rumah indah, makanan dan minuman lezat, bidadari cantik, taman-taman indah di dalam kebun, keridhaan Allah Dzat Penguasa dan Pemberi balasan, serta mendapatkan kemenangan dengan berada di dekatNya. Karena itulah Allah berfirman, “Di tempat yang disenangi di sisi (Rabb) Yang Maha Berkuasa.” Anda jangan bertanya setelah ini apa saja yang diberikan oleh Rabb mereka dari kemuliaanNya dan apa saja yang dianugerahkan kepada mereka dari kebaikan dan karuniaNya. Semoga Allah memasukkan kita dalam golongan mereka dan semoga Allah tidak menahan kebaikan milikNya untuk kita karena keburukan yang ada pada diri kita."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qamar ayat 54: 54-55. Allah menutup surat ini dengan penyebutan kemuliaan-Nya dan kebaikan-Nya bagi orang-orang yang bertakwa dimana mereka takut kepada Allah, Allah mengabarkan bahwa mereka akan memasuki surga pada hari kiamat dan bersenang-senang di dalamnya yang terdapat kebun-kebun yang besar, dan sungai-sungai yang luas. Mereka duduk di tempat yang mulia, tidak ada kesia-siaan dan dosa, mereka dekat dengan Raja Yang Agung, Yang Maha Kuasa atas segala sesuatunya. Dan tidak diragukan bahwa kenikmatan itu tergantung dari apa yang dinikmati."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kepada Allah, dengan mengerjakan perintah Allah dan menjauhi larangan-Nya; yang menjaga dirinya dari syirk dan maksiat. Yakni mereka berada dalam surga-surga yang penuh kenikmatan yang di dalamnya terdapat sesuatu yang belum pernah terlihat oleh mata, terdengar oleh telinga dan terlintas di hati manusia, berupa pohon-pohon yang berbuah, sungai-sungai yang mengalir, istana-istana yang tinggi, tempat-tempat yang indah, makanan dan minuman yang lezat, taman-taman yang menarik, keridhaan Allah dan memperoleh kedekatan dengan-Nya. Oleh karena itu, Dia berfirman, “Di tempat yang disenangi di sisi Tuhan Yang Mahakuasa.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qamar Ayat 54",
    "description": "54-55. Bila orang-orang musyrik diseret pada wajahnya ke arah neraka, maka sungguh, orang-orang yang benar-benar bertakwa secara tulus berada di taman-taman dan sungai-sungai yang beragam. Mereka tinggal di tempat yang disenangi dan penuh kebahagiaan, di sisi tuhan yang mahakuasa"
  }
]