[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka berpalinglah (wahai Rasul) dari mereka, dan tunggulah mereka pada satu hari yang besar, yaitu hari yang mana malaikat memanggil dengan tiupan sangkakala untuk menuju kepada urusan yang berat lagi menakutkan, yaitu tempat perhitungan amal."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Maka jika mereka tidak mengambil hidayah itu, tinggalkanlah mereka -wahai Rasul- dan berpalinglah dari mereka sambil menunggu hari ketika Malaikat yang ditugaskan untuk meniup sangkakala memanggil kepada sesuatu yang dahsyat yang sebelumnya tidak pernah diketahui oleh seluruh makhluk."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. فَتَوَلَّ عَنْهُمْ ۘ (Maka berpalinglah kamu dari mereka) Yakni berpalinglah dari mereka hai Muhammad, karena peringatan sudah tidak berguna lagi bagi mereka. يَوْمَ يَدْعُ الدَّاعِ إِلَىٰ شَىْءٍ نُّكُرٍ((Ingatlah) hari (ketika) seorang penyeru (malaikat) menyeru kepada sesuatu yang tidak menyenangkan (hari pembalasan)) Yakni ingatlah hai Muhammad hari itu. Penyeru tersebut adalah malaikat Israfil. Dan sesuatu yang tidak menyenangkan adalah hal buruk yang mereka ingkari karena mereka belum pernah melalui hari yang seperti itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Jauhilah mereka dan jangan berdebat dengan mereka tentang hari dimana Israfil membunyikan tiupan kedua yang menimbulkan ketakutan amat dahsyat yang tidak dapat dipungkiri oleh jiwa-jiwa (mereka). An-Nukru yaitu sesuatu yang sangat dahsyat yang tidak bisa mereka pungkiri keagungannya itu karena tidak ada yang menyerupainya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka berpalinglah} berpalinglah {dari mereka, pada hari (ketika) penyeru menyeru menuju sesuatu yang tidak menyenangkan} perkara yang buruk lagi tidak menyenangkan, yaitu tempat perhitungan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6. Allah berfirman kepada RasulNya bahwa telah jelas tidak ada cara untuk memberi petunjuk kepada orang-orang yang mendustakan, sehingga tidak ada yang bisa dilakukan selain berpaling dari mereka. Allah berfirman, “Maka berpalinglah kamu dari mereka,” dan tunggulah bersama mereka akan datangnya hari yang besar dan huruhara yang dahsyat, yaitu ketika “seorang penyeru (malaikat) menyeru,” yaitu malaikat Israfil, “kepada sesuatu yang tidak menyenangkan (Hari Pembalasan),” yakni, kepada sesuatu yang mengerikan yang tidak disukai oleh manusia, engkau tidak akan melihat pemandangan yang lebih mengerikan dan menyakitkan selainnya. Israfil meniup sangkakala, dengan tiupan itu manusia yang berada di kubur bangkit untuk menuju tempat pemberhentian pada Hari Kiamat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qamar ayat 6: Jika urusannya sudah demikian maka berpalinglah wahai Nabi Allah dari mereka dan tinggalkanlah; Karena sungguh engkau telah menyampaikan risalah dan menjelaskan kebenaran untuk merubah keadaan mereka orang-oang kafir. Mereka orang-orang kafir akan didatangi dengan hari yang besar dan besar pula keadaannya. Hari dimana ditiupnya sangkakala, mereka diseru untuk dibalas dan dihisab, dan mereka akan melihat urusan yang mengerikan yang mereka ingkari."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala berfirman kepada Rasul-Nya shallallahu 'alaihi wa sallam bahwa orang-orang yang mendustakan itu sudah tidak bisa lagi diharapkan keimanannya, maka tinggallah sikap yang terakhir, yaitu berpaling dari mereka. Dan tunggulah untuk mereka hari yang besar, yaitu hari dimana malaikat Israfil mengajak kepada sesuatu yang tidak menyenangkan, dimana tidak ada suatu pemandangan yang lebih buruk dan menyakitkan daripadanya. Ketika itu, malaikat Israfil meniup sangkakala yang kedua kalinya, maka manusia yang telah mati keluar dari kuburnya untuk menghadapi persidangan pada hari Kiamat. Yaitu malaikat Israfil."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qamar Ayat 6",
    "description": "5-6. Wahai nabi Muhammad, peristiwa-peristiwa yang engkau sampaikan kepada umatmu adalah hikmah, yaitu ilmu amaliah dan amal ilmiah, yang sempurna kebenaran dan kejelasannya. Tetapi, sesungguhnya peringatan-peringatan itu tidak berguna bagi mereka. Maka, berpalinglah engkau dari mereka! orang musyrik itu akan menghadapi masa yang mengerikan, yaitu pada hari ketika penyeru, ketika malaikat atau utusan-Nya, mengajak mereka kepada sesuatu yang tidak menyenangkan, yaitu datangnya kiamat dan keharusan setiap orang mempertanggung jawabkan perbuatannya. 7-8. Orang yang diseru itu akan datang pandangan mereka tertunduk, ketika mereka keluar dari kuburan dengan ketakutan. Keadaan ini menyebabkan mereka berjalan serampangan, seakan-akan mereka belalang yang beterbangan. Dengan patuh dan penuh rasa takut mereka segera datang kepada penyeru itu. Dalam keadaan seperti ini orang-orang kafir terus saja berkata, 'ini adalah hari yang sangat sulit dihadapi. '"
  }
]