[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "7-8. pandangan mata mereka tertunduk hina, di mana mereka keluar dari kubur, yang saat berhamburan dan cepatnya mereka berjalan ke tempat perhitungan amal bagaikan belalang yang menyebar di berbagai arah, bergegas menuju seruan. Orang-orang kafir itu akan berkata, “Ini adalah hari yang sulit dan sangat menakutkan.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Dengan pandangan-pandangan mereka yang terhina, mereka keluar dari kubur-kubur mereka, seakan-akan mereka seperti belalang yang beterbangan saat mereka berusaha menuju tempat perhitungan amal."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "7-8. Mereka akan tertunduk hina, tidak mampu mengangkat pandangan karena ketakutan. Mereka keluar dari kubur dan menyebar seakan-akan gerombolan belalang yang menyebar di ufuk; mereka menyebar dengan cepat untuk memenuhi seruan malaikat yang menyeru mereka. Orang-orang kafir itu akan berkata: “Ini adalah hari yang sangat menakutkan.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. خُشَّعًا أَبْصٰرُهُمْ يَخْرُجُونَ مِنَ الْأَجْدَاثِ كَأَنَّهُمْ جَرَادٌ مُّنتَشِرٌ (sambil menundukkan pandangan-pandangan mereka keluar dari kuburan seakan-akan mereka belalang yang beterbangan) Yakni mereka keluar dari kubur dengan pandangan yang lesu karena kehinaan mereka. Dan karena jumlah mereka yang begitu banyak, mereka seperti belalang yang beterbangan dan saling bercampur baur."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Penglihatan mereka lemah. Mereka tidak mampu mengangkat pandangannya karena saking dahsyatnya (peristiwa itu). Mereka keluar dari kubur, layaknya belalang yang sangat banyak yang menyebar dan berhamburan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{pandangan mereka tertunduk} tertunduk {Mereka keluar dari kubur} kubur {seperti belalang yang beterbangan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7. “Sambil menundukkan pandangan-pandangan mereka,” karena huru hara dan rasa takut yang sampai di hati mereka, pandangan mereka menunduk dan merendah serta penuh khidmat, mereka “keluar dari kuburan seakan-akan mereka,” karena banyak dan ramainya, “belalang yang beterbangan,” beterbangan di bumi dengan jumlah yang begitu banyak."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qamar ayat 7: Allah menjelaskan bahwa orang-orang kafir yang mereka menantang akan balasan dan hisab pada diri-diri mereka, mereka akan melihatnya sambil terhina, tertunduk dan malu. Mereka akan dikeluarkan dari kubur-kubur mereka menuju ke padang mahsyar dengan cepat; Seolah-olah mereka adalah belalang yang berhamburan di padang mahsyar yang jumlahnya sangat banyak, untuk memisahkan mereka, menyebarkan mereka dan mencampur mereka satu sama lain."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Karena peristiwa yang dahsyat dan mengerikan yang masuk sampai ke hati, sehingga diri mereka menjadi tunduk, demikian pula pandangan mata mereka. Karena banyaknya jumlah mereka dan ramainya. Mereka tidak mengetahui ke mana mereka pergi karena takut dan bingung."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qamar Ayat 7",
    "description": "7-8. Orang yang diseru itu akan datang pandangan mereka tertunduk, ketika mereka keluar dari kuburan dengan ketakutan. Keadaan ini menyebabkan mereka berjalan serampangan, seakan-akan mereka belalang yang beterbangan. Dengan patuh dan penuh rasa takut mereka segera datang kepada penyeru itu. Dalam keadaan seperti ini orang-orang kafir terus saja berkata, 'ini adalah hari yang sangat sulit dihadapi"
  }
]