[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "7-8. pandangan mata mereka tertunduk hina, di mana mereka keluar dari kubur, yang saat berhamburan dan cepatnya mereka berjalan ke tempat perhitungan amal bagaikan belalang yang menyebar di berbagai arah, bergegas menuju seruan. Orang-orang kafir itu akan berkata, “Ini adalah hari yang sulit dan sangat menakutkan.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Mereka tergesa-gesa menghadap sang penyeru menuju ke tempat itu, orang-orang kafir berkata, “Hari ini adalah hari yang berat karena adanya kesusahan dan penderitaan.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. مُّهْطِعِينَ إِلَى الدَّاعِ ۖ (mereka datang dengan cepat kepada penyeru itu) Yakni bergegas menuju penyeru tersebut, yaitu malaikat Israfil."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8. Mereka bergegas menuju sang penyeru, yaitu Israfil. Orang-orang kafir berkata: “Ini adalah hari dimana kesulitan yang sangat mengerikan menimpa orang-orang kafir”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka bersegera} mereka bersegera dalam ketakutan {menuju penyeru itu} suara Israfil AS {Orang-orang kafir berkata,“Ini adalah hari yang sulit”} sangat sulit"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8. “Mereka datang dengan cepat kepada penyeru itu.” Artinya, mereka bersegera menyambut panggilan malaikat Israfil yang menyeru tersebut. Ini menunjukkan bahwa penyeru itu menyeru mereka dan memerintahkan mereka untuk mendatangi tempat pemberhentian Kiamat. Mereka memenuhi panggilannya dan bergegas datang. “Orang-orang kafir berkata,” yakni, orang-orang yang akan tiba siksaannya, “Ini adalah hari yang berat,” seperti yang disebutkan dalam Firman Allah yang lain, “agi orang-orang kafir lagi tidak mudah.”-Al-Mudatsir:10- Mafhumnya, nagi orang-orang yang beriman akan terasa mudah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qamar ayat 8: Allah menjelaskan bahawa mereka akan keluar dengan cepat memenuhi seruan yang menyeru agar mereka menuju ke padang mahsyar, yang mereka tidak akan dapat menolak dan datang terlambat. Pada kondisi ini berkata orang-orang kafir : Ini adalah hari yang sulit dan keras serta tidak mudah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Bagi orang-orang kafir. Mafhum ayat ini adalah, bahwa hari itu ringan dan mudah bagi orang-orang mukmin."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qamar Ayat 8",
    "description": "7-8. Orang yang diseru itu akan datang pandangan mereka tertunduk, ketika mereka keluar dari kuburan dengan ketakutan. Keadaan ini menyebabkan mereka berjalan serampangan, seakan-akan mereka belalang yang beterbangan. Dengan patuh dan penuh rasa takut mereka segera datang kepada penyeru itu. Dalam keadaan seperti ini orang-orang kafir terus saja berkata, 'ini adalah hari yang sangat sulit dihadapi. ' 9. Ayat-ayat berikut menguraikan siksaan duniawi atas orang-orang yang mengingkari para rasul. Sebelum mereka, yaitu kaum musyrik mekah, sebagian besar kaum nabi nuh juga telah mendustakan dan menolak dakwah hamba kami. Maka mereka mendustakan nabi nuh, hamba kami yang terpilih, dan mengatakan, 'dia adalah orang gila!' lalu diusirnya dengan ancaman, ejekan, dan makian dari hampir seluruh kaumnya. '."
  }
]