[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Telah mendustakan sebelum kaummu (wahai Rasul) kaum Nuh, mereka mendustakan hamba Kami, Nuh. Mereka berkata, “Dia orang gila.” Mereka menghardik Nuh dan mengancamnya dengan berbagai bentuk gangguan bila Nuh tidak menghentikan dakwahnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Sebelum para pendusta terhadap seruanmu itu -wahai Rasul- mendustakanmu, kaum Nuh pun telah mendustakan hamba Kami, Nuh -'alaihissalām-, ketika dia Kami utus kepada mereka dan mereka berkata tentangnya, “Dia gila.” Mereka menimpakan kepadanya berbagai celaan, hinaan dan ancaman jika ia tidak mau meninggalkan dakwahnya terhadap mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "9-13. Hai Rasulullah, sebelum kaummu mendustakanmu, juga terdapat kaum Nabi Nuh yang mendustakan hamba Kami, Nuh, dan menuduhnya sebagai orang gila dan memperlakukannya dengan kasar serta mengancam akan membunuhnya. Maka Nabi Nuh berdoa kepada Tuhannya: “Ya Tuhanku, aku tidak mampu menghadapi mereka, maka tolonglah aku.” Kami-pun mengabulkan doanya, maka Kami buka pintu-pintu langit dengan turunnya air hujan yang sangat deras, dan Kami jadikan di bumi mata air-mata air yang menyembur deras, maka bertemulah air dari langit dan air di bumi, sehingga menjadi banjir besar yang Allah tetapkan untuk membinasakan mereka. Dan Kami naikkan Nuh dan orang-orang beriman yang bersamanya di atas perahu yang terbuat dari papan-papan kayu yang disatukan dengan paku. Perahu itu bergerak dengan pengawasan dan penjagaan Kami. Dan Kami binasakan orang-orang yang mendustakan, sebagai balasan atas kekafiran mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. وَقَالُوا۟ مَجْنُونٌ (dan mengatakan: “Dia seorang gila) Mereka menuduh Nabi Nuh sebagai orang yang gila. وَازْدُجِرَ (dan dia sudah pernah diberi ancaman) Yakni dia diancam karena kenabiannya dan risalah yang dia sampaikan dengan olokan dan gangguan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9. Sebelum orang-orang musyrik Quraisy, kaum Nuh telah berdusta kepada para rasul. Mereka mendustakan hamba kami yaitu Nuh AS. Mereka berkata tentangnya: “Sesungguhnya dia adalah orang gila atas risalah yang dia sampaikan tentang berbagai macam siksaan dan kutukan” Orang-orang kafir itu mencacinya dengan sangat kasar, kemudian mencegah dan menghentikan dakwahnya tentang risalah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sebelum mereka, kaum Nuh juga telah mendustakan. Mereka mendustakan hamba Kami dan mengatakan,“Orang gila” Lalu dia dibentak} mereka mencacinya dengan berbagai jenis hal yang menyakitkan jika dia tidak berhenti pada dakwah itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9. Setelah Allah menyebutkan kondisi orang-orang yang mendustakan RasulNya dan sesungguhnya tanda-tanda kebesaran tidak berguna bagi mereka sama sekali, Allah kemudian mengancam dan menakutkan mereka dengan berbagai siksaan yang menimpa umat-umat terdahulu yang mendustakan para rasul dan bagaimanakah Allah membinasakan mereka serta menimpakan azab pada mereka?. Allah menyebut kaum Nuh, Nabi Nuh adalah rasul pertama yang diutus Allah untuk kaum yang menyembah berhala, Nuh menyerukan mereka untuk mengesakan Allah dan menyembahNya semata, yang tidak ada sekutu bagiNya. Mereka enggan meninggalkan kesyirikan dan berkata, “Dan mereka berkata: \"Jangan sekali-kali kamu meninggalkan (penyembahan) tuhan-tuhan kamu dan jangan pula sekali-kali kamu meninggalkan (penyembahan) wadd, dan jangan pula suwwa', yaghuts, ya'uq dan nasr\".”-Nuh:23- Meski demikian, Nabi Nuh tetap menyeru kepada Allah siang dan malam, secara rahasia dan terang-terangan. Hal itu ternyata semakin membuat mereka membangkang, melampaui batas dan mencela nabi mereka. Karena itulah dalam surat ini Allah berfirman, “Maka mereka mendustakan hamba Kami (Nuh) dan mengatakan, ‘Dia seorang gila’,” karena tuduhan mereka bahwa jalan kesyirikan dan kesesatan yang mereka dan nenek moyang mereka tempuh itu ditunjukkan oleh akal sedangkan jalan yang ditempuh oleh Nuh adalah kebodohan, kesesatan dan hanya berasal dari orang-orang gila. Mereka dusta dalam tuduhan itu dan memutarbalikkan kebenaran-kebenaran kokoh, baik secara syariat maupun akal. Syariat yang dibawa Nuh adalah benar dan kokoh, yang menunjukkan orang-orang berakal dan lurus menuju petunjuk dan cahaya, sedangkan jalan yang mereka tempuh adalah kebodohan dan kesesatan yang nyata. Allah berfirman, “Dan dia sudah pernah diberi ancaman,” artinya diancam dan diperlakukan jahat oleh kaumnya karena seruannya kepada Allah, belum cukup bagi mereka, semoga Allah memburukkan mereka, untuk tidak beriman dan mendustakan Nuh saja, mereka bahkan menyakiti Nuh semampu mereka. Memang seperti itulah musuh-musuh para rasul terhadap rasul dan nabi mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qamar ayat 9: Allah menyebutkan berita tentang umat-umat yang mendustakan dan keadaan mereka yang tertimpa adzab dan sebagai peringatan dan penghibur bagi Rasul-Nya ﷺ serta peringatan bagi orang-orang kafir Mekkah, Allah berkata : Sungguh mereka (banyak kaum) telah mendustakan sebelum kaummu, dan sebagian dari kaum-kaum ini ada kaum Nuh; Dimana mereka mendustakan hamba Kami Nuh, yang mereka berkata kepada Nuh : Sungguh Nuh adalah orang gila seraya mereka membentak dan merendahkan Nuh serta mengancam untuk menyakiti dan menakut-nakuti jika tidak berhenti dari dakwahnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala menyebutkan keadaan orang-orang yang mendustakan Rasul-Nya, dan bahwa semua ayat tidaklah bermanfaat bagi mereka, maka Allah Subhaanahu wa Ta'aala memperingatkan mereka dengan azab yang menimpa umat-umat terdahulu yang mendustakan para rasul, bagaimana Allah Subhaanahu wa Ta'aala membinasakan mereka. Allah Subhaanahu wa Ta'aala sebutkan kaum Nuh, dimana Dia mengutus kepada mereka Nuh seorang rasul pertama yang diutus kepada orang-orang yang menyembah patung, dia mengajak mereka mentauhidkan Allah dan beribadah kepada-Nya saja, namun mereka engggan meninggalkan syirk dan berkata kepada sesama mereka, “Janganlah kamu meninggalkan sembahan kamu dan jangan pula meninggalkan Wad, Suwa’, Yaghuts, Ya’uuq dan Nasr.” Semua itu adalah nama patung yang mereka sembah. Nabi Nuh ‘alaihis salam tetap berdakwah mengajak mereka kepada Allah di malam dan siang, sembunyi-sembunyi maupun terang-terangan, namun dakwah Beliau tidak menambah mereka selain tetap sikap membangkang, melampaui batas dan mencela Nabi mereka. Mereka menganggap bahwa apa yang dipegang oleh mereka dan nenek moyang mereka selama ini berupa syirk dan kesesatan adalah sesuatu yang didukung oleh akal, dan bahwa apa yang dibawa Nabi Nuh ‘alaihis salam adalah kejahilan dan kesesatan; yang tidak muncul kecuali dari orang-orang gila. Mereka telah berdusta dalam hal itu dan memutarbalikkan hakikat yang telah tetap berdasarkan syara’ maupun akal, yaitu bahwa apa yang dibawa Nabi Nuh ‘alaihis salam adalah kebenaran yang membimbing akal kepada petunjuk, cahaya dan jalan yang lurus, sedangkan yang mereka pegang selama ini adalah kebodohan dan kesesatan yang nyata. Kaumnya menyanggahnya dan bersikap keras terhadapnya saat Beliau mengajak mereka kepada Allah Subhaanahu wa Ta'aala. Mereka tidak hanya menolak beriman dan mendustakannya, bahkan sampai menimpakan kepada Beliau gangguan yang mereka sanggup lakukan. Demikianlah keadaan musuh-musuh para rasul. Saat itulah Nabi Nuh ‘aaihis salam berdoa, “Sesungguhnya aku telah dikalahkan, maka tolonglah (aku).\""
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qamar Ayat 9",
    "description": "Ayat-ayat berikut menguraikan siksaan duniawi atas orang-orang yang mengingkari para rasul. Sebelum mereka, yaitu kaum musyrik mekah, sebagian besar kaum nabi nuh juga telah mendustakan dan menolak dakwah hamba kami. Maka mereka mendustakan nabi nuh, hamba kami yang terpilih, dan mengatakan, 'dia adalah orang gila!' lalu diusirnya dengan ancaman, ejekan, dan makian dari hampir seluruh kaumnya. '10. Pembangkangan kaum nabi nuh makin menjadi. Meski sudah didakwahi sekian ratus tahun, hanya segelintir kaumnya yang beriman. Maka dia menengadahkan tangan, mengadu kepada tuhannya, 'sesungguhnya aku telah dikalahkan dengan keingkaran dan perlakuan buruk kaumku, maka tolonglah aku, wahai tuhan pemeliharaku. '."
  }
]