[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai rasul) kepada orang orang yang kafir kepada Allah dan rasul NYA, “wahai orang-orang yang kafir kepada Allah.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Katakan wahai Rasul, “Wahai orang-orang yang kafir kepada Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1-2. Allah memerintahkan Nabi Muhammad untuk menyampaikan kepada orang-orang kafir yang mengajaknya untuk menyembah berhala: Aku tidak menyembah apa yang kalian sembah selain Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. قُلۡ يٰۤاَيُّهَا الۡكٰفِرُوۡنَۙ‏ (Katakanlah: “Hai orang-orang kafir) Sebab turunnya surat ini adalah orang-orang kafir meminta Rasulullah agar menyembah tuhan-tuhan mereka satu tahun, kemudian mereka akan menyembah Tuhannya satu tahun selanjutnya. Maka Allah memerintahkannya untuk mengatakan kepada mereka: ”Aku tidak akan menyembah apa yang kamu sembah”"
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Di ayat ini ada pernyataan tentang kekafiran mereka dan penamaan mereka dengan kafir adalah penamaan yang Allah sebutkan untuk mereka, dan sebagian dari mereka yang sejalan dengan sikap orang-orang kafir; tidak dapat menamakan orang-orang kafir dengan sebutan kafir kecuali dengan gelar lain."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Keutamaan surah: Imam Muslim dari Jabir mengatakan bahwa Rasulallah SAW membaca surah ini dan surah {Qul huwallaahu ahad} [QS Al-Ikhlas: 112/1] dalam dua rakaat (shalat) setelah melakukan thawaf. Dikatakan juga dari Abu Hurairah bahwa Rasulallh SAW membaca kedua surah tersebut dalam dua rakaat shalat fajar (subuh) dan tetap membacanya pada dua rakaat shalat maghrib. Maka hubungkanlah surah ini dengan surah {Sabbih} [QS Al-A’la: 87/1] dan {Qul huwallahu ahad} [QS Al-Ikhlas: 112/1]. 1. Katakanlah wahai Nabi kepada orang-orang musyrik: “Wahai orang-orang yang ingkar kepada Allah dan RasulNya”. Surah ini diturunkan saat orang-orang kafir meminta Rasulallah SAW untuk menyembah Tuhan mereka dalam satu tahun, kemudian mereka akan menyembah Allah selama satu tahun, lalu Allah memberikan perintah melalui surah ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah“Wahai orang-orang kafir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-6. Yaitu, katakanlah pada orang-orang kafir dengan lantang dan jelas, “Aku tidak akan menyembah apa yang kamu sembah,” yakni bebaskan dirimu dari apa yang mereka sembah selain Allah secara lahir dan batin. “Dan kamu bukan penyembah Tuhan yang aku sembah,” karena tidak adanya keikhlasan kalian dalam menyembah Allah. Ibadah kalian disertai kesyirikan sehingga tidak patut disebut sebagai ibadah. Kemudian Allah mengulang-ulang hal itu dengan tujuan : Pertama, menunjukkan tidak adanya pekerjaan, dan kedua, menunjukkan bahwa hal itu menjadi sifat yang melekat. Karena itulah Allah membedakan di antara kedua golongan tersebut seraya berfirman, “Untukmulah agamamu, dan untukkulah agamaku,” sebagaimana firman-Nya : \"Tiap-tiap orang berbuat menurut keadaannya masing-masing\" (QS. Al-Isro : 84) \"Bagiku pekerjaanku dan bagimu pekerjaanmu. Kamu berlepas diri terhadap apa yang aku kerjakan dan akupun berlepas diri terhadap apa yang kamu kerjakan\" (QS. yunus-ayat-41)"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Allah - عز وجل - berkata kepada Nabi-Nya Muhammad : { قُلْ يَا أَيُّهَا الْكَافِرُونَ } Katakanlah wahai Muhammad kepada semua orang-orang kafir, baik mereka yang hidup dizamanmu maupun yang akan hidup setelah kepergianmu sampai tiba saatnya hari kiamat bergejolak."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Surat ini adalah salah satu dari dua surat al-Ikhlas. Karena dua surat adalah قُلْ يَا أَيُّهَا الْكَافِرُونَ \" Katakanlah: \"Hai orang-orang yang kafir,\"(Surat Al-Kafirun) dan قُلْ هُوَ اللَّهُ أَحَدٌ \"Katakanlah: \"Dia-lah Allah, Yang Maha Esa,\"(Surat al-Ikhlas). Nabi shallallaahu 'alaihi wa sallam senantiasa membaca keduanya saat shalat qabliyah subuh(1), dua rakaat setelah maghrib (2) dan dua rakaat sebelum thowaf(3) karena kandungan ke dua surat tersebut berupa keikhlasan (pemurnian tauhid) kepada Allah 'Azza dan pijian kepada-Nya dengan penyebutan sifat-sifat sempurna dalam surat قُلْ هُوَ اللَّهُ أَحَدٌ قُلْ يَا أَيُّهَا الْكَافِرُونَ \" Katakanlah: \"Hai orang-orang yang kafir,\" Memanggil mereka dan menyeru mereka dengan panggilan tinggi قُلْ يَا أَيُّهَا الْكَافِرُونَ \" Katakanlah: \"Hai orang-orang yang kafir,\" Ini mencakup semua orang kafir, baik itu dari kalangan orang-orang musyrik, orang-orang yahudi atau Nasrani atau pun atheis dan yang lainnya, setiap orang kafir wajib bagimu memanggilnya dengan hati mau pun lisanmu, ketika ia hadir, agan anda berlepas darinya dan dari peribadatannya. 1) Dikeluarkan Muslim (726) dari hadits Abu Hurairah radhiyallaahu 'anhu 2) Dikeluarkan Tirmidziy (431) dan Ibnu Majah (1166) dari hadits Abdullah Bin Mas'ud radhiyallaahu 'anhu, Al-Albaniy mengatakan dalam shahih at-Tirmidziy: Hasan shahih. 3) Dikeluarkan Muslom (1218) dari hadits Jabir Bin Abdillah radhiyallaahu 'anhuma"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Kafirun ayat 1: 1-2. Allah memerintahkan Nabi-Nya ﷺ agar berkata (kepada mereka orang-orang kafir, yang mereka menyeru untuk beribadah kepada berhala dan batu) : Ketahuilah oleh kalian wahai orang-orang kafir, bahwasanya aku beribadah kepada Allah saja dan aku tidak mengibadahi tuhan-tuhan kalian dan berhala-berhala kalian selamanya, dan jika kalian masih terus kafir, sungguh aku berlepas diri dari sesembahan kalian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Secara tegas dan terang-terangan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kafirun Ayat 1",
    "description": "Wahai nabi Muhammad, katakanlah, 'wahai orang-orang yang me-milih kafir sebagai jalan hidup!1. Wahai nabi Muhammad, katakanlah, 'wahai orang-orang yang memilih kafir sebagai jalan hidup! 1. Wahai nabi Muhammad, katakanlah, 'wahai orang-orang yang memilih kafir sebagai jalan hidup!2. Sampai kapan pun aku tidak akan menyembah apa yang kamu sembah selain Allah, seperti berhala-berhala itu. Tuhan bukanlah ciptaan manusia dan dia tidak menjelma menjadi suatu yang kasat mata sebagaimana sembahanmu itu."
  }
]