[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Aku tidak menyebah apa yang kalian sembah, yaitu berhala-berhala dan sembahan sembahan yang palsu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Aku tidak akan menyembah baik saat ini maupun yang akan datang berhala-berhala yang kalian sembah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. لَاۤ اَعۡبُدُ مَا تَعۡبُدُوۡنَۙ (Aku tidak akan menyembah apa yang kamu sembah) Yakni aku tidak akan melakukan apa yang kalian minta dengan menyembah berhala yang kalian sembah. Dan aku sekarang tidak menyembah tuhan-tuhan kalian."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Ibnu taimiyah berkata : Rasulullah pernah membandingkan antara surah al-kafirun dan surah al-Ikhlas dalam beberapa riwayat, pada surah al-Ikhlash : ada pernyataan tentang pentauhidaan Allah dengan perkataan ilmiyah, sedangkan di surah al-Kafirun ada pernyataan yang menjelaskan tentang tauhid qosdi ilmiyah, yakni tauhid yang diketahui dari makna ayat yang belum zohir : { لَا أَعْبُدُ مَا تَعْبُدُونَ }, maka dengan ini dapat diketahui siapa yang menyembah Allah dari orang yang menyembah selain-Nya, walaupun keduanya menyatakan ketuhanan Allah dan kekuasaan-Nya diatas segala sesuatu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Aku tidak akan menyembah apa yang kalian sembah, yaitu berhala sampai besok pun. {maa} bermakna “alladzi”, yaitu Tuhan yang kalian sembah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Aku tidak akan menyembah apa yang kalian sembah} Aku sekarang tidak akan menyembah berhala-berhala yang kalian sembah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-6. Yaitu, katakanlah pada orang-orang kafir dengan lantang dan jelas, “Aku tidak akan menyembah apa yang kamu sembah,” yakni bebaskan dirimu dari apa yang mereka sembah selain Allah secara lahir dan batin. “Dan kamu bukan penyembah Tuhan yang aku sembah,” karena tidak adanya keikhlasan kalian dalam menyembah Allah. Ibadah kalian disertai kesyirikan sehingga tidak patut disebut sebagai ibadah. Kemudian Allah mengulang-ulang hal itu dengan tujuan : Pertama, menunjukkan tidak adanya pekerjaan, dan kedua, menunjukkan bahwa hal itu menjadi sifat yang melekat. Karena itulah Allah membedakan di antara kedua golongan tersebut seraya berfirman, “Untukmulah agamamu, dan untukkulah agamaku,” sebagaimana firman-Nya : \"Tiap-tiap orang berbuat menurut keadaannya masing-masing\" (QS. Al-Isro : 84) \"Bagiku pekerjaanku dan bagimu pekerjaanmu. Kamu berlepas diri terhadap apa yang aku kerjakan dan akupun berlepas diri terhadap apa yang kamu kerjakan\" (QS. yunus-ayat-41)"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Aku tidak akan menyembah dan beribada kepada yang kamu sembah, rasul hanyalah meyembah Allah - عز وجل - semata tiada sekutu baginya, dan Rasul tidak pula menyembah apapun yang disembah oleh orang-orang kafir semacam berhala dan bebatuan dan pepohnan serta kuburan orang terpandang diantara mereka, seorang Rasul hanyalah menyembah Allah - عز وجل - tuhan pencipta semesta alam."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "2-3. قُلْ يَا أَيُّهَا الْكَافِرُونَ (1) لَا أَعْبُدُ مَا تَعْبُدُونَ (2) وَلَا أَنْتُمْ عَابِدُونَ مَا أَعْبُدُ (3) وَلَا أَنَا عَابِدٌ مَا عَبَدْتُمْ (4) وَلَا أَنْتُمْ عَابِدُونَ مَا أَعْبُدُ \" Katakanlah: \"Hai orang-orang yang kafir, aku tidak akan menyembah apa yang kamu sembah. Dan kamu bukan penyembah Tuhan yang aku sembah. Dan aku tidak pernah menjadi penyembah apa yang kamu sembah. Dan kamu tidak pernah (pula) menjadi penyembah Tuhan yang aku sembah.\" Kalimat-kalimat ayat-ayat ini diulang dua kali: لَا أَعْبُدُ مَا تَعْبُدُونَ Maknanya: Aku tidak menyembah sesembahan-sesembahan yang kalian sembah. Sesembahan-sesembahan mereka itu adalah berhala-berhala وَلَا أَنْتُمْ عَابِدُونَ مَا أَعْبُدُ \" Dan kamu tidak pernah (pula) menjadi penyembah Tuhan yang aku sembah \" Dialah Allah, مَا [Maa: apa] di sini, dalam firman-Nya مَا أَعْبُدُ bermakna مَنْ [Man: siapa] Karena isim maushul bila kembali kepada Allah maka ia datang dengan lafaz مَنْ [Man: siapa]. لَا أَعْبُدُ مَا تَعْبُدُونَ (2) وَلَا أَنْتُمْ عَابِدُونَ مَا أَعْبُدُ \" aku tidak akan menyembah apa yang kamu sembah. Dan kamu bukan penyembah Tuhan yang aku sembah.\" Yakni: Saya tidak menyembah berhala-berhala kalian dan kalian tidak menyembah Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Kafirun ayat 2: 1-2. Allah memerintahkan Nabi-Nya ﷺ agar berkata (kepada mereka orang-orang kafir, yang mereka menyeru untuk beribadah kepada berhala dan batu) : Ketahuilah oleh kalian wahai orang-orang kafir, bahwasanya aku beribadah kepada Allah saja dan aku tidak mengibadahi tuhan-tuhan kalian dan berhala-berhala kalian selamanya, dan jika kalian masih terus kafir, sungguh aku berlepas diri dari sesembahan kalian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni saat ini."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kafirun Ayat 2",
    "description": "Sampai kapan pun aku tidak akan menyembah apa yang kamu sembah selain Allah, seperti berhala-berhala itu. Tuhan bukanlah ciptaan manusia dan dia tidak menjelma menjadi suatu yang kasat mata sebagaimana sembahanmu itu. 3. Dan kamu bukan penyembah apa yang aku sembah, yaitu tuhan yang maha esa, penguasa alam semesta. Berhala sembahanmu itu sifat-sifat-Nya sangat berbeda dari sifat-sifat sempurna tuhan yang aku sembah."
  }
]