[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kalian juga tidak menyemabah apa yang aku sembah, yaitu Allah yang maha esa, Dia adalah tuhan alam semesta yang hanya Dia semata yang berhak di sembah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Kalian pun tidak menyembah apa yang aku sembah, yaitu Allah semata."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "3. Dan kalian -hai orang-orang musyrik- tidak menyembah yang aku sembah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. وَلَاۤ اَنۡـتُمۡ عٰبِدُوۡنَ مَاۤ اَعۡبُدُ‌ ۚ‏ (Dan kamu bukan penyembah Tuhan yang aku sembah) Dan kalian tidak menyembah Allah yang aku sembah selama kalian tetap pada kemusyrikan dan kekafiran kalian."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Ayat ini diturankan pada orang-orang tertentu, yakni : kalian tidak menyembah Allah sekarang ini, dan kalian tidak akan menyembah Allah di masa yang akan datang, dan ini adalah tanda akan kebenaran kenabian Muhammad dan kebenaran wahyu yang diturunkan kepadanya, sungguh telah binasa mereka itu diatas kekafiran tanpa ada iman kepada Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Dan kalian sampai besok pun tidak akan menyembah Tuhan yang Aku sembah, Dialah Tuhan yang Maha Benar. Allah SWT disebutkan sebanyak satu kali menggunakan {man} seperti yang terdapat dalam ayat {A’amintum man fis samaaa’i} [QS Al-Mulk: 67/16] atau dengan {Maa} sebagaimana yang telah disebutkan disini, di ayat {Maa Ta’buduuna min ba’di} [QS Al-Baqarah: 2/133] dan di ayat {wa nafsin wa maa sawwaahaa} [QS Asy-Syams: 91/8]."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kalian juga bukan penyembah apa yang aku sembah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-6. Yaitu, katakanlah pada orang-orang kafir dengan lantang dan jelas, “Aku tidak akan menyembah apa yang kamu sembah,” yakni bebaskan dirimu dari apa yang mereka sembah selain Allah secara lahir dan batin. “Dan kamu bukan penyembah Tuhan yang aku sembah,” karena tidak adanya keikhlasan kalian dalam menyembah Allah. Ibadah kalian disertai kesyirikan sehingga tidak patut disebut sebagai ibadah. Kemudian Allah mengulang-ulang hal itu dengan tujuan : Pertama, menunjukkan tidak adanya pekerjaan, dan kedua, menunjukkan bahwa hal itu menjadi sifat yang melekat. Karena itulah Allah membedakan di antara kedua golongan tersebut seraya berfirman, “Untukmulah agamamu, dan untukkulah agamaku,” sebagaimana firman-Nya : \"Tiap-tiap orang berbuat menurut keadaannya masing-masing\" (QS. Al-Isro : 84) \"Bagiku pekerjaanku dan bagimu pekerjaanmu. Kamu berlepas diri terhadap apa yang aku kerjakan dan akupun berlepas diri terhadap apa yang kamu kerjakan\" (QS. yunus-ayat-41)"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Walau sekalipun mereka menyembah Allah - عز وجل - dengan mengerjakan beberapa macam ibadah, akan tetapi mereka juga menyembah selain Allah - عز وجل - sesungguhnya ibadah mereka seluruhnya batal, karena syirik merupakan pembatal ibadah yang paling besar, seperti itulah keadaan orang-orang musyrikin mereka beribadah kepada Allah - عز وجل - akan tetapi kepada selain-Nya mereka juga menyembah, ibadah mereka tidak akan diterima disisi Allah ﷻ"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "2-3. قُلْ يَا أَيُّهَا الْكَافِرُونَ (1) لَا أَعْبُدُ مَا تَعْبُدُونَ (2) وَلَا أَنْتُمْ عَابِدُونَ مَا أَعْبُدُ (3) وَلَا أَنَا عَابِدٌ مَا عَبَدْتُمْ (4) وَلَا أَنْتُمْ عَابِدُونَ مَا أَعْبُدُ \" Katakanlah: \"Hai orang-orang yang kafir, aku tidak akan menyembah apa yang kamu sembah. Dan kamu bukan penyembah Tuhan yang aku sembah. Dan aku tidak pernah menjadi penyembah apa yang kamu sembah. Dan kamu tidak pernah (pula) menjadi penyembah Tuhan yang aku sembah.\" Kalimat-kalimat ayat-ayat ini diulang dua kali: لَا أَعْبُدُ مَا تَعْبُدُونَ Maknanya: Aku tidak menyembah sesembahan-sesembahan yang kalian sembah. Sesembahan-sesembahan mereka itu adalah berhala-berhala وَلَا أَنْتُمْ عَابِدُونَ مَا أَعْبُدُ \" Dan kamu tidak pernah (pula) menjadi penyembah Tuhan yang aku sembah \" Dialah Allah, مَا [Maa: apa] di sini, dalam firman-Nya مَا أَعْبُدُ bermakna مَنْ [Man: siapa] Karena isim maushul bila kembali kepada Allah maka ia datang dengan lafaz مَنْ [Man: siapa]. لَا أَعْبُدُ مَا تَعْبُدُونَ (2) وَلَا أَنْتُمْ عَابِدُونَ مَا أَعْبُدُ \" aku tidak akan menyembah apa yang kamu sembah. Dan kamu bukan penyembah Tuhan yang aku sembah.\" Yakni: Saya tidak menyembah berhala-berhala kalian dan kalian tidak menyembah Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Kafirun ayat 3: Dan agar Nabi ﷺ berkata (kepada musyrik) : Tidaklah kalian wahai orang-orang musyrik, menyembah Tuhanku secara benar, yaitu beribadah kepada Allah saja, tidak sebagaimana kalian, sungguh aku (hanya memerintahkan) agar kalian beribadah kepada-Nya saja. Sebab ibadah kalian memiliki keterikatan dengan kesyirikan, maka tidaklah kalian dianggap telah beribadah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kafirun Ayat 3",
    "description": "Dan kamu bukan penyembah apa yang aku sembah, yaitu tuhan yang maha esa, penguasa alam semesta. Berhala sembahanmu itu sifat-sifat-Nya sangat berbeda dari sifat-sifat sempurna tuhan yang aku sembah. 4. Jika dua ayat sebelumnya menerangkan ketidaksamaan tuhan nabi Muhammad dan tuhan orang kafir, dua ayat berikut menjelaskan ketidaksamaan peribadahan kepada keduanya. Dan aku tidak pernah menjadi penyembah apa yang kamu sembah karena kamu adalah orang-orang musyrik. Aku menyembah tuhanku dengan bertauhid seperti yang dia ajarkan kepadaku."
  }
]