[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kalian juga tidak akan pernah menyembah apa yang aku sembah,” Ayat ini turun berkaitan dengan orang orang musyrik tertentu yang Allah telah mengetahui bahwa mereka tidak akan beriman selamanya,"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Kalian pun tidak menyembah apa yang aku sembah, yaitu Allah semata."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "5. Dan kalian tidak menyembah Allah yang aku sembah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. وَ لَاۤ اَنۡـتُمۡ عٰبِدُوۡنَ مَاۤ اَعۡبُدُ (dan kamu tidak pernah (pula) menjadi penyembah Tuhan yang aku sembah) Yakni dan kalian di masa mendatang tidak akan menyembah Allah selama kalian tetap pada kekafiran dan penyembahan kepada berhala-berhala itu. sebab ibadah orang kafir dan musyrik tidak akan diterima. Pendapat lain mengatakan bahwa pengulangan ayat ini adalah untuk memberi penekanan untuk menghilangkan keinginan orang-orang kafir agar Rasulullah menerima permintaan mereka menyembah tuhan-tuhan mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "4-6 1 ). { وَلَا أَنْتُمْ عَابِدُونَ مَا أَعْبُدُ } al-kafirun : 3 , { فَأَعْقَبَهُمْ نِفَاقًا فِي قُلُوبِهِمْ إِلَىٰ يَوْمِ يَلْقَوْ } \" Maka Allah menimbulkan kemunafikan pada hati mereka sampai kepada waktu mereka menemui Allah\" [ at-Taubah : 77 ] , { لَنْ تَخْرُجُوا مَعِيَ أَبَدًا وَلَنْ تُقَاتِلُوا مَعِيَ عَدُوًّا } \"Kamu tidak boleh keluar bersamaku selama-lamanya dan tidak boleh memerangi musuh bersamaku\" [ at-taubah : 83 ] , { لَمْ يَكُنِ اللَّهُ لِيَغْفِرَ لَهُمْ وَلَا لِيَهْدِيَهُمْ طَرِيقًا } \"Allah sekali-kali tidak akan mengampuni (dosa) mereka dan tidak (pula) akan menunjukkan jalan kepada mereka\" [ an-Nisa ; 168 ] , jika kita mengamati ayat-ayat diatas dan sejenisnya kalian akan dapati bahwa semua ayat itu sepakat untuk menjelaskan solusi untuk kaum-kaum yang di rendahkan oleh Allah karena kemaksiatan mereka, maka Allah pun membatasi antara hati-hati mereka dan hidayah-Nya : { وَاعْلَمُوا أَنَّ اللَّهَ يَحُولُ بَيْنَ الْمَرْءِ وَقَلْبِ } \"ketahuilah bahwa sesungguhnya Allah membatasi antara manusia dan hatinya\" [ al-Anfal : 24 ]. maka hendaklah kita menyambutnya sebelum masa terhenti. 2 ). Seorang pentadabbur berkata : pada suatu ketika aku berada di negara india dan bersamaku seorang teman, kami berdua masuk kedalam sebuah pasar rakyat yang cukup besar didalamnya penjual patung bertebaran, aku kemudian memperhatikan pemandngan ini, seketika lisanku berucap : { قُلْ يَا أَيُّهَا الْكَافِرُونَ , لَا أَعْبُدُ مَا تَعْبُدُونَ } sampai akhir surah, dan seakan-akan aku membaca surah ini pertama kalinya, dan aku terus mengulanginya dan seakan-akan aku berbicara kepada mereka, sampai akhirnya kami keluar dari pasar, sedangkan temanku menangis menghadapi keadaan ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Dan kalian bukanlah penyembah Tuhanku di waktu yang sama ketika Aku menyembahNya. Kalian tidak beribadah sesuai peribadatanku yang benar."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kalian tidak pernah menjadi penyembah apa yang aku sembah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-6. Yaitu, katakanlah pada orang-orang kafir dengan lantang dan jelas, “Aku tidak akan menyembah apa yang kamu sembah,” yakni bebaskan dirimu dari apa yang mereka sembah selain Allah secara lahir dan batin. “Dan kamu bukan penyembah Tuhan yang aku sembah,” karena tidak adanya keikhlasan kalian dalam menyembah Allah. Ibadah kalian disertai kesyirikan sehingga tidak patut disebut sebagai ibadah. Kemudian Allah mengulang-ulang hal itu dengan tujuan : Pertama, menunjukkan tidak adanya pekerjaan, dan kedua, menunjukkan bahwa hal itu menjadi sifat yang melekat. Karena itulah Allah membedakan di antara kedua golongan tersebut seraya berfirman, “Untukmulah agamamu, dan untukkulah agamaku,” sebagaimana firman-Nya : \"Tiap-tiap orang berbuat menurut keadaannya masing-masing\" (QS. Al-Isro : 84) \"Bagiku pekerjaanku dan bagimu pekerjaanmu. Kamu berlepas diri terhadap apa yang aku kerjakan dan akupun berlepas diri terhadap apa yang kamu kerjakan\" (QS. yunus-ayat-41)"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Sebagai penekanan dan penguatan, juga sebagai pembantah atas keinginan mereka yang mencampur adukkan ibadah yang berbeda, diriwayatkan bahwasanya orang-orang usyrikin berkata kepada Rasulullah : \"kami akan menyembah tuhanmu wahai Muhammad selama satu tahun, kemudian kami akan kembali kepada tuhan kemi selama satu tahun juga, maka Allah pun menurunkan surah ini."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "4-5. وَلَا أَنَا عَابِدٌ مَا عَبَدْتُمْ (4) وَلَا أَنْتُمْ عَابِدُونَ مَا أَعْبُدُ \" Dan aku tidak pernah menjadi penyembah apa yang kamu sembah. Dan kamu tidak pernah (pula) menjadi penyembah Tuhan yang aku sembah.\" Mungkin akan ada yang menduga bahwa konteks ayat tersebut berulang untuk taukid (kata penegasan), namun tidak seperti itu, karena bentuk kalimatnya berbeda: لَا أَعْبُدُ مَا تَعْبُدُونَ \" aku tidak akan menyembah apa yang kamu sembah.\" Berupa fi'il (أَعْبُدُ) sedangkan وَلَا أَنَا عَابِدٌ مَا عَبَدْتُمْ \" Dan aku tidak pernah menjadi penyembah apa yang kamu sembah.\" عَابِدٌ ['Aabidun] dan عَابِدُونَ ['Aabiduuna] Isim, sedangkan taukid kalimat kedua harus sama persis bentuknya seperti kalimat sebelumnya, dengan demikian maka pendapat yang mengatakan bahwa itu berfungsi sebagai taukid adalah pendapat yang lemah. Maka apa tujuan pengulangan ini? Sebagian ulama mengatakan: لَا أَعْبُدُ مَا تَعْبُدُونَ \" aku tidak akan menyembah apa yang kamu sembah.\" Maknanya: Sekarang (aku tidak akan menyembah) sedangkan وَلَا أَنَا عَابِدٌ مَا عَبَدْتُمْ \" Dan aku tidak pernah menjadi penyembah apa yang kamu sembah.\" Waktu yang akan datang, maka makna لَا أَعْبُدُ مَا تَعْبُدُونَ \" aku tidak akan menyembah apa yang kamu sembah.\" Adalah saat ini dan وَلَا أَنَا عَابِدٌ مَا عَبَدْتُمْ \" Dan aku tidak pernah menjadi penyembah apa yang kamu sembah.\" Maksudnya adalah di waktu yang akan datang. Karena fi'il mudhari' menunjukkan perbuatan yang sedang diperbuat, sedangkan isim fail menunjukkan perbuatan yang diperbuat mendatang dengan bukti bahwa isim fa'il ini beramal (seperti fi'il), dan isim fa'il tidak beramal kecuali jika ia menunjukkan perbuatan yang akan datang لَا أَعْبُدُ مَا تَعْبُدُونَ \" aku tidak akan menyembah apa yang kamu sembah.\" Maknanya: Sekarang (aku tidak akan menyembah) وَلَا أَنْتُمْ عَابِدُونَ مَا أَعْبُدُ \" Dan kamu tidak pernah (pula) menjadi penyembah Tuhan yang aku sembah.\" Yakni: Sekarang وَلَا أَنَا عَابِدٌ مَا عَبَدْتُمْ \" Dan aku tidak pernah menjadi penyembah apa yang kamu sembah.\" Maksudnya adalah di waktu yang akan datang. وَلَا أَنْتُمْ عَابِدُونَ مَا أَعْبُدُ \" Dan kamu tidak pernah (pula) menjadi penyembah Tuhan yang aku sembah.\" Maksudnya di waktu yang akan datang. Akan tetapi pendapat ini menimbulkan pertanyaan, Allah berfirman وَلَا أَنْتُمْ عَابِدُونَ مَا أَعْبُدُ \" Dan kamu tidak pernah (pula) menjadi penyembah Tuhan yang aku sembah.\" Padahal mereka bisa saja menjadi beriman lalu menyembah Allah?! Dengan demikian pendapat ini ada kelemahannya. Para ulama menjawab pernyataan ini: Bahwa firman Allah وَلَا أَنْتُمْ عَابِدُونَ مَا أَعْبُدُ \" Dan kamu tidak pernah (pula) menjadi penyembah Tuhan yang aku sembah.\" Berinteraksi dengan orang-orang musyrik yang Allah mengetahui bahwa mereka tidak akan beriman, maka konteks ayat ini tidak umum, dan ini sedikit melemahkan pendapat ini. Kita di sini mendapatkan dua pendapat: Pertama: Mengatakan untuk taukid Kedua: Ini untuk menejalaskan di waktu yang akan datang. Pendapat yang ke empat: لَا أَعْبُدُ مَا تَعْبُدُونَ \" aku tidak akan menyembah apa yang kamu sembah.\" Maknanya: Aku tidak menyembah patung-patung yang kalian sembah وَلَا أَنْتُمْ عَابِدُونَ مَا أَعْبُدُ \" Dan kamu tidak pernah (pula) menjadi penyembah Tuhan yang aku sembah.\" Maknanya: Kalian tidak menyembah Allah. وَلَا أَنَا عَابِدٌ مَا عَبَدْتُمْ (4) وَلَا أَنْتُمْ عَابِدُونَ مَا أَعْبُدُ \" Dan aku tidak pernah menjadi penyembah apa yang kamu sembah. Dan kamu tidak pernah (pula) menjadi penyembah Tuhan yang aku sembah.\" Maknanya: Dalam peribadatan. Maksudnya adalah ibadahku tidak seperti ibadah kalian, dan ibadah kalian tidak sama seperti ibadahku, sehingga peniadaan di sini adalah peniadan fi'il (yaitu ibadah) bukan maf'ul bihnya (yang diibadahi). Yaitu ini bukan peniadaan yang disembah (diibadahi) tetapi ini adalah peniadaan ibadah. Maknyanya: Aku tidak beribadah seperti ibadahnya kalian dan kalian tidak beribadah seperti ibadahku. Karena ibadahku murni untuk Allah sedangkan ibadah kalian ibadah syirik (menyekutukan Allah). Pendapat yang ke empat: Yang dipilih oleh Syaikhul Islam Ibnu Taimiyah rahimahullaah bahwa firman Allah: لَا أَعْبُدُ مَا تَعْبُدُونَ (2) وَلَا أَنْتُمْ عَابِدُونَ مَا أَعْبُدُ \" aku tidak akan menyembah apa yang kamu sembah. Dan kamu bukan penyembah Tuhan yang aku sembah.\" Adalah fi'il (beribadah), maka ini berkesusuaian dengan pendapat pertama dalam penggalan dua ayat ini: وَلَا أَنَا عَابِدٌ مَا عَبَدْتُمْ (4) وَلَا أَنْتُمْ عَابِدُونَ مَا أَعْبُدُ \" Dan aku tidak pernah menjadi penyembah apa yang kamu sembah. Dan kamu tidak pernah (pula) menjadi penyembah Tuhan yang aku sembah.\" Maknanya: Dalam penerimaan, yaitu dan aku tidak akan menerima selain ibadahku dan tidak akan pernah menerima ibadah kalian, kalian pun demikian, tidak akan pernah menerima ibadahku. Maka dua ayat pertama (ayat 2-3) kembali kepada fi'il (perbuatan ibadah) sedangkan dua ayat berikutnya (ayat 4-5) kembali pada penerimaan dan kerelaan (terhadap ibadah itu) yaitu: Aku tidak akan menyembahnya dan aku tidak meridhainya, kalian pun demikian, kalian tidak akan menyembah Allah dan kalian tidak akan ridha terhadap ibadah kepada-Nya saja. Jika kita mencermati pendapat ini, maka kita akan dapati bahwa pendapat ini tidak tersanggah dengan sanggahan-sanggahan yang disebutkan pada pendapat-pendapat sebelumnya. Maka pendapat ini adalah pendapat yang bagus dan baik`. Dari sini kita mengambil faedah bahwa al-Quran al-Karim tidak terdapat sesuatu yang berulang tanpa faedah sama sekali. Tidak ada satu pun yang berulang kecuali terdapat faedah, karena jika kita katakan: Bahwa dalam al-Quran terdapat yang diulang tanpa faedah, maka konsekuansinya dalah di al-Quran terdapat sesuatu yang sia-sia, sedangkan Al-Quran suci dari ini, dengan demikian maka pengulangan yang terdapat pada surat Ar-Rahman: فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ \" Maka nikmat Tuhan kamu yang manakah yang kamu dustakan?\"(Ar-Rahman) dan dalam surat al-Mursalat: وَيْلٌ يَوْمَئِذٍ لِلْمُكَذِّبِينَ \"Kecelakaan yang besarlah pada hari itu bagi orang-orang yang mendustakan.\" adalah pengulangan yang mengandung faedah yang besar, yaitu bahwa di setiap ayat yang terletang pada ayat-ayat yang berulan ini, mencakup nikmat-nikat yang besar dan melimpah, kemudian di antara faedah tertulis adalah memberikan peringatan kepada lawan bicara, dengan pengulangan kalimat padanya: فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ \" Maka nikmat Tuhan kamu yang manakah yang kamu dustakan?\" dan \"Kecelakaan yang besarlah pada hari itu bagi orang-orang yang mendustakan.\""
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Kafirun ayat 5: Dan Allah memerintahkan juga agar Nabi ﷺ berkata kepada mereka : Kalian juga demikian, tidak akan mengibadahi Tuhanku yang Maha Benar, selama kalian tetap dalam keadaan kafir."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kafirun Ayat 5",
    "description": "Dan kamu tidak pernah pula menjadi penyembah apa yang aku sembah. Kamu tidak tunduk pada perintah dan syariat Allah dalam menyembah-Nya. Kamu bahkan menyembah tuhan dengan penuh kemusyrikan dan cara-cara yang kamu buat-buat berdasarkan hawa nafsumu. 6. Tidak ada tukar-menukar dengan pengikut agama lain dalam hal peribadahan kepada tuhan. Wahai orang kafir, untukmu agamamu, yakni kemusyrikan yang kamu yakini, dan untukku agamaku yang telah Allah pilihkan untukku sehingga aku tidak akan berpaling ke agama lain. Inilah jalan terbaik dalam hal toleransi antar umat beragama dalam urusan peribadahan kepada tuhan."
  }
]