[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bagi kalian agama kalian yang kalian bersikukuh mempertahankannya, dan bagiku agamaku yang aku tidak akan mencari selainnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Bagi kalian agama kalian yang telah kalian buat untuk diri kalian sendiri dan bagiku agamaku yang diturunkan Allah q kepadaku."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "6. Bagi kalian agama kalian, yaitu kesyirikan kalian itu; dan bagiku agamaku, yaitu agama Islam yang diridhai Allah bagiku."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. لَـكُمۡ دِيۡنُكُمۡ وَلِىَ دِيۡنِ (Untukmu agamamu, dan untukkulah, agamaku) Yakni jika kalian telah rela dengan agama kalian, maka aku juga telah rela dengan agamaku. Dan agama kemusyrikan kalian itu hanya bagi kalian dan tidak akan mempengaruhiku; begitu pula agama ketauhidanku hanya bagiku dan tidak akan sampai kepada kalian pahalanya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "4-6 1 ). { وَلَا أَنْتُمْ عَابِدُونَ مَا أَعْبُدُ } al-kafirun : 3 , { فَأَعْقَبَهُمْ نِفَاقًا فِي قُلُوبِهِمْ إِلَىٰ يَوْمِ يَلْقَوْ } \" Maka Allah menimbulkan kemunafikan pada hati mereka sampai kepada waktu mereka menemui Allah\" [ at-Taubah : 77 ] , { لَنْ تَخْرُجُوا مَعِيَ أَبَدًا وَلَنْ تُقَاتِلُوا مَعِيَ عَدُوًّا } \"Kamu tidak boleh keluar bersamaku selama-lamanya dan tidak boleh memerangi musuh bersamaku\" [ at-taubah : 83 ] , { لَمْ يَكُنِ اللَّهُ لِيَغْفِرَ لَهُمْ وَلَا لِيَهْدِيَهُمْ طَرِيقًا } \"Allah sekali-kali tidak akan mengampuni (dosa) mereka dan tidak (pula) akan menunjukkan jalan kepada mereka\" [ an-Nisa ; 168 ] , jika kita mengamati ayat-ayat diatas dan sejenisnya kalian akan dapati bahwa semua ayat itu sepakat untuk menjelaskan solusi untuk kaum-kaum yang di rendahkan oleh Allah karena kemaksiatan mereka, maka Allah pun membatasi antara hati-hati mereka dan hidayah-Nya : { وَاعْلَمُوا أَنَّ اللَّهَ يَحُولُ بَيْنَ الْمَرْءِ وَقَلْبِ } \"ketahuilah bahwa sesungguhnya Allah membatasi antara manusia dan hatinya\" [ al-Anfal : 24 ]. maka hendaklah kita menyambutnya sebelum masa terhenti. 2 ). Seorang pentadabbur berkata : pada suatu ketika aku berada di negara india dan bersamaku seorang teman, kami berdua masuk kedalam sebuah pasar rakyat yang cukup besar didalamnya penjual patung bertebaran, aku kemudian memperhatikan pemandngan ini, seketika lisanku berucap : { قُلْ يَا أَيُّهَا الْكَافِرُونَ , لَا أَعْبُدُ مَا تَعْبُدُونَ } sampai akhir surah, dan seakan-akan aku membaca surah ini pertama kalinya, dan aku terus mengulanginya dan seakan-akan aku berbicara kepada mereka, sampai akhirnya kami keluar dari pasar, sedangkan temanku menangis menghadapi keadaan ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Bagi kalianlah agama kalian, yaitu kemusyrikan yang kalian yakini. Dan bagiku agamaku yaitu tauhid dan Islam yang Aku yakini dan tidak akan Aku ingkari. Kesimpulannya yaitu bahwa Tuhan yang kita sembah tidak sama, dan peribadatan kita juga tidak sama. Bagi kalian agama kalian dan kalian bertanggung jawab atas hal itu, dan bagiku agamaku dan aku bertanggung jawab atas hal itu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Untuk kalian agama kalian} kesyirikan dan kekufuran kalian {dan untukku agamaku} kemurnianku dan ketauhidanku"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-6. Yaitu, katakanlah pada orang-orang kafir dengan lantang dan jelas, “Aku tidak akan menyembah apa yang kamu sembah,” yakni bebaskan dirimu dari apa yang mereka sembah selain Allah secara lahir dan batin. “Dan kamu bukan penyembah Tuhan yang aku sembah,” karena tidak adanya keikhlasan kalian dalam menyembah Allah. Ibadah kalian disertai kesyirikan sehingga tidak patut disebut sebagai ibadah. Kemudian Allah mengulang-ulang hal itu dengan tujuan : Pertama, menunjukkan tidak adanya pekerjaan, dan kedua, menunjukkan bahwa hal itu menjadi sifat yang melekat. Karena itulah Allah membedakan di antara kedua golongan tersebut seraya berfirman, “Untukmulah agamamu, dan untukkulah agamaku,” sebagaimana firman-Nya : \"Tiap-tiap orang berbuat menurut keadaannya masing-masing\" (QS. Al-Isro : 84) \"Bagiku pekerjaanku dan bagimu pekerjaanmu. Kamu berlepas diri terhadap apa yang aku kerjakan dan akupun berlepas diri terhadap apa yang kamu kerjakan\" (QS. yunus-ayat-41)"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Bagimu agamu dan bagiku agamaku. Surah ini mengandung kewajiban seorang muslim agar menghindar dan berlepas diri dari agama dan keyakinan kaum musyrikin secara keseluruhan, dan hendaknya setiap muslim menyampaikan perkara ini kepada masyarakat luas, sebagaimana orang-orang musyrikin berlepas diri dari perkara agama Allah - تعالى - . Dan tidak seperti yang diyakini oleh sebagian besar orang tidak berilmu dengan baik, atau bahkan mereka yang sesat yang berkata : janganlah kalian mengingkari agama yang diyakini oleh orang lain, biarlah mereka pada agama mereka dan kamu pada agama kalian. Tidak, perkara ini hanyalah sebagai keleuasaan kita untuk berlepas diri dari agama kaum musyrikin, dan tidak ada kaitannya dengannya keridhoan kita terhadap agama mereka, dan tidak pula bertujuan mensamakan kedudukan kita dan kaum kuffar, kareka sesungguhnya jika mereka bersusah payah melakukan ibadah dengan tujuan kepada Allah - عز وجل - , akan tetapi ibadah mereka itu sama sekali tidak memberikan manfaat bagi diri mereka sendiri."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Kemudian Allah 'Azza Wa Jalla berfirman: لَكُمْ دِينُكُمْ وَلِيَ دِينِ \" Untukmulah agamamu dan untukkulah agamaku \" لَكُمْ دِينُكُمْ \" Untukmulah agamamu \" yang kamu tempuh dan kamu anut وَلِيَ دِينِ \" untukkulah agamaku \" Aku berlepas dari agama kalian dan kalian berlepasa dari agamaku. Sebagian Ahlul Ilmi mengatakan: Bahwa surat ini turun sebelum ditetapkan kewajiban jihad, karena setelah jihad, orang kafir tidak dibiarkan kecuali dengan membayar jizyah, jika mereka dari golongan ahlul kitab dan menurut pendapat yang kuat, atau selain ahlulkitab. Tetapi yang lebih tepat: Bahwa surat ini tidak menafikan perintah untuk berjihad, sehingga dikatakan: Ayat ini sudah mansukh (hukumnya tidak berlaku lagi). Tetapi hokum dalam surat ini tetap berlaku, dan wajib bagi kita berlepas dari agama yahudi, nasrani dan agama orang-orang musyrik, pada setiap waktu, kapan pun juga. Oleh kerananya kita membiarkan yahudi dan nasrani di atas agama mereka dengan kewajiban jizyah, dan kita hanya menyembah Allah saja, mereka menyembah sesembahan mereka. Surat ini mengandung perintah untuk berlepasa dari peribadatan kepada selain Allah 'Azza Wa Jalla, baik itu berlapas dari sesembahan (selain Allah) atau dari peribadatannya, di dalamnya mengandung keikhlasan ibadah hanya untuk Allah 'Azza Wa Jalla, dan kita tidak menyembah kecuali kepada Allah semata tidak ada sekutu bagi-Nya. Sampai di sini selasai pembahasan tafsir sederhana tentang surat ini."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Kafirun ayat 6: Ketahuilah wahai orang-orang musyrik, sesungguhnya bagi kalian balasan atas amalan-amalan kalian dan agama kalian, yang kalian meridhainya atas diri-diri kalian. Dan bagiku balasan atas amalan dan agamaku, yang Allah ridha kepadaku. Berkata Syaikh Ibnu Utsaimin : Yakni bagi kalian amalan kalian, dan bagiku amalanku dimana Allah ridha denganku; Dan kalian berlepas diri dari agamaku, dan aku berlepas diri dari agama kalian. Dan terputusnya ini setelah penolakan keimanan atas mereka, sebagaimana Allah berfirman : وَإِن كَذَّبُوكَ فَقُل لِّى عَمَلِى وَلَكُمْ عَمَلُكُمْ ۖ أَنتُم بَرِيٓـُٔونَ مِمَّآ أَعْمَلُ وَأَنَا۠ بَرِىٓءٌۭ مِّمَّا تَعْمَلُونَ {Yunus : 41}, yang artinya : Jika mereka mendustakan kamu, maka katakanlah: Bagiku amalanku dan bagimu amalanmu. Kamu berlepas diri terhadap apa yang aku kerjakan dan akupun berlepas diri terhadap apa yang kamu kerjakan. Dan pengulangan dalam surat Al Kafirun sebagai penegasan, dan penegasan di dalam Al Qur’an sangat banyak."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu syirk. Yaitu Islam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kafirun Ayat 6",
    "description": "Tidak ada tukar-menukar dengan pengikut agama lain dalam hal peribadahan kepada tuhan. Wahai orang kafir, untukmu agamamu, yakni kemusyrikan yang kamu yakini, dan untukku agamaku yang telah Allah pilihkan untukku sehingga aku tidak akan berpaling ke agama lain. Inilah jalan terbaik dalam hal toleransi antar umat beragama dalam urusan peribadahan kepada tuhan. 1. Wahai nabi Muhammad, apabila telah datang pertolongan Allah kepadamu dan pengikutmu dalam menghadapi kaum kafir quraisy, dan telah datang pula kemenangan kepadamu dengan penaklukan mekah menjadi kota yang suci kembali dari kesyirikan dan kekafiran, ."
  }
]