[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-2. Allah Yang Maha Pengasih, Yang mengajari manusia al-Quran dengan memudahkan membaca dan menghafalnya serta memahami makna-maknanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Ar-Raḥmān, yang memiliki rahmat yang luas."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1-2. Allah Maha Pengasih kepada jin dan manusia. Allah mengajarkan mereka al-Qur’an dengan memudahkan bacaan dan pemahamannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1-2. الرَّحْمٰنُ عَلَّمَ الْقُرْءَانَ (Yang Maha Pemurah Yang telah mengajarkan al Quran) Karena surat ini menyebutkan berbagai kenikmatan yang diberikan Allah bagi hamba-hamba-Nya, maka Allah mendahulukan kenikmatan yang paling agung, yang paling bermanfaat, dan paling berguna yaitu kenikmatan pengajaran al-Qur’an; kerena al-Qur’an adalah kunci kebahagiaan dunia dan akhirat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "1-2. Allah SWT adalah Dzat yang Maha Pengasih lagi Maha Pemberi Nikmat dengan keagungan-keagungan nikmat dunia dan akhirat. Dzat yang mengajarkan rasulNya Al-Qur’an dengan memberinya wahyu untuk disampaikan kepada manusia."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dzat Yang Maha Pengasih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1. Surat yang mulia nan agung ini Allah awali dengan (salah satu) NamaNya, yaitu ar-Rahman (Yang Maha Pengasih), yang menunjukkan betapa luas rahmat dan pemberianNya, serta betapa melimpah kebaikan dan karuniaNya. Kemudian Allah menyebutkan apa yang menunjukkan rahmatNya serta pengaruh yang Allah berikan kepada para hamba berupa nikmat keduniaan, keagamaan, dan keakhiratan. Setelah Allah menyebutkan segala macam dan jenis kenikmatanNya, selanjutnya Dia memperingatkan jin dan manusia untuk bersyukur kepadaNYa, dengan berfirman, “Maka nikmat Rabb kamu yang manakah yang kamu dustakan?”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rahman ayat 1: Allah membuka surat ini dengan nama yang agung yaitu Ar Rahman, yang ia adalah nama Allah, pemilik rahmah (Yang Maha Pemurah) yang sempurna di dunia dan akhirat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surah yang mulia ini dimulai dengan nama Allah Ar Rahman yang menunjukkan luasnya rahmat-Nya, meratanya ihsan-Nya, banyaknya kebaikan-Nya dan luasnya karunia-Nya. Selanjutnya Allah Subhaanahu wa Ta'aala menyebutkan sesuatu yang menunjukkan rahmat-Nya dan atsar(pengaruh)nya yang Allah sampaikan kepada hamba-hamba-Nya berupa nikmat-nikmat agama, dunia maupun akhirat, dan setelah itu Allah Subhaanahu wa Ta'aala mengingatkan manusia dan jin yang mendapatkan nikmat itu agar bersyukur kepada-Nya dengan firman-Nya, “Maka nikmat Tuhanmu yang manakah yang kamu dustakan?”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rahman Ayat 1",
    "description": "Uraian pada akhir surah al-qamar tentang keagungan kuasa Allah dan kesempurnaan kodrat-Nya disusul dengan penjelasan mengenai limpahan rahmat Allah kepada makhluk-Nya, yang disebutkan dalam surah ar-rahm'n. Surah ini diawali dengan nama-Nya yang indah. Dialah Allah yang maha pengasih kepada makhluk, baik jin, manusia, hewan, tumbuhan, dan lainnya dalam kehidupan mereka di dunia. 2. Allah menyebut rahmat-Nya yang paling agung. Dialah tuhan yang telah mengajarkan Al-Qur'an kepada siapa saja yang dia kehendaki."
  }
]