[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "10-12. Dia juga menciptakan bumi dan membentengkannya agar makhluk-makluk bisa tinggal di atasnya. Di sana ada buah-buahan, pohon kurma yang memiliki kelopak-kelopak mayang buah, ada biji-bijian yang berkulit, semua itu sebagai rizki bagi kalian dan ternak-ternak kalian, di sana ada tanam-tanaman yang berbau harum."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Dan Allah telah meletakkan bumi yang dipersiapkan untuk tempat tinggal makhluk di atasnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "10-12. Dan Allah melapangkan dan menghamparkan bumi, agar para makhluk dapat tinggal di atasnya. Di bumi terdapat berbagai jenis buah-buahan, pohon kurma yang memiliki wadah bagi buahnya, biji-bijian yang berkulit, dan segala tanaman yang memiliki aroma yang harum."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. وَالْأَرْضَ وَضَعَهَا لِلْأَنَامِ (Dan Allah telah meratakan bumi untuk makhluk(Nya)) Yakni Allah meratakannya agar dapat ditinggali oleh manusia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10. Dan Allah meratakan dan membentangkan bumi untuk manusia agar dapat hidup dan tinggal di sana."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia telah membentangkan bumi untuk makhluk} membentangkannya bagi makhluk agar mereka bisa tinggal di atas permukaannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "10. “Dan Allah telah meratakan bumi,” yang memiliki ketebalan, kepadatan, keberagaman sifat dan kondisi, “untuk makhluk (Nya),” agar mereka tinggal di atasnya dan bumi itu menjadi tempat tidur bagi mereka. Di sana mereka menggali (sumur), menapaki jalan-jalan yang luas, memanfaatkan hasil tambang, dan (memanfaatkan) segala sesuatunya yang menjadi kebutuhan mereka. Kemudian Allah menyebutkan sebagian makanan pokok yang ada di atas bumi, dengan FirmanNya,"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rahman ayat 10: 10-12. Nikmat yang lain bagi hamba yang Allah sebutkan yaitu bahwasanya Allah menciptakan bumi dan menghamparkannya dan menyediakan di dalamnya unsur-unsur untuk kehidupan, dan Allah menakdirkan di dalamnya rizki bagi makhluk. Allah menciptakan di dalamnya beraneka macam buah-buahan yang lezat untuk dimakan, di antaranya adalah buah kurma yang memiliki kulit tipis yang menutupi daging buahnya hingga nantinya masak, retak kulitnya dan keluar sari buah. Berkata Ibnu Katsir : Allah menyendirikan penyebutan kurma karena sebab kemuliaan buah tersebut dan bermanfaat baik kurma kering maupun basah, sebagaimana Allah berfirman : dan pohon kurma yang tinggi-tinggi yang mempunyai mayang yang bersusun-susun, untuk menjadi rezeki bagi hamba-hamba (Kami). {Qaf : 10-11}. Kemudian Allah menjelaskan bahwa Dia menciptakan biji-bijian yang berkulit dan bisa dikupas sebagai makanan bagi kalian dan anugerah bagi kalian. Dan Allah juga ciptakan tumbuh-tumbuhan yang bermacam-macam dengan ber-aroma harum."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Agar mereka dapat tinggal di atasnya, dapat mendirikan bangunan, dapat menggarap tanahnya, bercocok tanam, membuat jalan, menggalinya, memanfaatkan barang tambangnya dan segala yang perlu mereka lakukan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rahman Ayat 10",
    "description": "Usai menjelaskan neraca keseimbangan di alam semesta, Allah kemudian berbicara tentang bumi. Dan di samping langit yang diatur dengan baik, bumi pun telah dibentangkan dan dihamparkan-Nya untuk kenyamanan semua makhluk yang menghuninya. 11-12. Bumi tidak hanya dihamparkan. Di dalamnya ada buah-buahan dan pohon kurma yang mempunyai kelopak mayang, tempat buah sebelum kemunculannya, dan ada pula biji-bijian yang berkulit pelindung dan bunga-bunga yang harum baunya."
  }
]