[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka nikmat manakah dari nikmat-nikmat Tuhan kalian berdua (wahai jin dan manusia) baik nikmat dunia atau nikmat akhirat, yang kalian dustakan? Dan betapa bagus jawaban jin saat Nabi membacakan surat ini kepada mereka, setiap kali beliau membaca ayat ini, mereka berkata, “Tidak, tidak ada satu pun dari nikmat-nikmatMu, wahai Tuhan kami, yang kami dustakan. Segala puji bagiMu.” Demikian sepatutnya seorang hamba, bila nikmat-nikmat dan karunia-karunia Allah dibacakan kepadanya, hendaknya dia mengakuinya, mensyukurinya, dan memujiNya karenanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "13. Maka dengan nikmat Allah yang banyak untuk kalian -wahai jin dan manusia- yang mana yang kalian dustakan?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "13. Maka kenikmatan mana yang Tuhan kalian berikan, yang kalian ingkari wahai jin dan manusia? Dan seorang muslim harus mengakui segala kenikmatan Allah dan mensyukurinya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "13. فَبِأَىِّ ءَالَآءِ رَبِّكُمَا تُكَذِّبَانِ (Maka nikmat Tuhan kamu yang manakah yang kamu dustakan?) Ayat ini ditujukan kepada jin dan manusia. Makna (الآلاء) yakni kenikmatan-kenikmatan. Allah menyebutkan dalam surat ini berbagai kenikmatan, dan mengingatkan makhluk-makhluk-Nya tentang kenikmatan-kenikmatan itu. kemudian Allah menyandingkan setiap penyebutan suatu kenikmatan dengan ayat ini, dan menjadikannya pemisah antara kenikmatan yang lain yang disebutkan dalam surat ini agar menjadi pengingat bagi hamba-hamba-Nya tentang kenikmatan-kenikmatan tersebut. Sebagaimana ketika kamu berkata kepada orang yang kamu beri banyak kebaikan kepadanya namun dia mengingkari kebaikanmu: Bukankah dulu kamu miskin kemudian aku membantumu? Apakah kamu mengingkarinya? Bukankah dulu kamu lemah lalu aku menguatkanmu? Apakah kamu mengingkarinya? Bukankah kamu sebelumnya berjalan kaki, lalu aku membawamu bersamaku? Apakah kamu mengingkari itu? pengulangan pada hal seperti ini merupakan sesuatu yang baik."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13. Maka nikmat Tuhan mana yang kalian dustakan wahai para manusia dan jin? Istifham itu berfungsi sebagai bentuk pemberitahuan. Kalian tidak akan bisa mendustakannya. Dalam sunnah beliau bersabda setelah ayat itu: “Tidak satupun dari nikmat Tuhan yang kami dustakan, Maka segala puji bagiMu”. Pengulangan ayat ini merupakan perkara yang bagus untuk menyebut satu per satu nikmat (Allah). untuk memberi perhatian terhadap nikmat-nikmat itu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka nikmat Tuhan kalian yang manakah} nikmat Tuhan kalian {yang kalian dustakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "13. Setelah Allah menyebutkan banyak dari nikmat-nikmatNya yang dapat disaksikan dengan mata dan pandangan hati, di mana pesan ini ditujukan kepada jin dan manusia, Dia menyatakan nikmat-nikmatNya kepada mereka dengan berfirman, “Maka nikmat Rabb kamu yang manakah yang kamu dustakan?” yakni, nikmat din dan keduniaan manakah yang kalian dustakan? Dan alangkah bagusnya jawaban jin ketika Nabi membacakan surat ini kepada mereka, setiap sampai kepada Firman Allah, “Maka nikmat Rabb kamu yang manakah yang kamu dustakan?” mereka menjawab, “Tidak ada satu pun nikmat dariMu yang kami dustakan wahai Rabb kami, maka bagiMulah segala pujian. Demikianlah yang seharusnya dilakukan oleh hamba, apabila disebutkan kepadanya nikmat dan karunia Allah, hendaknya ia mengakui dan mensyukurinya serta memuji Allah atasnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rahman ayat 13: Kemudian Allah mengarahkan firman-Nya kepada jin dan manusia dengan pengulangan dan kepastian, Allah berkata : Maka nikmat Tuhan kalian yang mana wahai jin dan manusia yang kalian dustakan ?! Bahwasanya jin dan manusia tidak mungkin mendustakannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala menyebutkan sekian nikmat-nikmat-Nya yang dapat dilihat oleh mata dan dipikirkan oleh hati, maka Allah Subhaanahu wa Ta'aala mentaqrir mereka (membuat mereka (jin dan manusia) mengakuinya) dengan firman-Nya di atas. Sungguh bagus jawaban jin ketika Nabi shallallahu 'alaihi wa sallam membacakan kepada mereka surah ini, dimana Beliau tidak membacakan ayat, “Maka nikmat Tuhanmu yang manakah yang kamu dustakan?” kecuali mereka mengatakan, “Tidak ada satu pun dari nikmat-nikmat Engkau wahai Tuhan kami yang kami dustakan. Maka untuk-Mulah segala puji.” Demikianlah yang seharusnya dilakukan seorang hamba, yakni ketika disebutkan kepada mereka nikmat-nikmat Allah, maka ia mengakuinya dan mensyukurinya serta memuji Allah Ta’ala terhadapnya. Pertanyaan di sini adalah untuk mengokohkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rahman Ayat 13",
    "description": "Setelah memaparkan nikmat dan anugerah-Nya, Allah lalu menantang jin dan manusia, 'wahai manusia dan jin, nikmat-nikmat Allah begitu banyak, maka nikmat tuhanmu yang manakah yang kamu dustakan, apakah nikmat yang sudah disebutkan ataukah yang lainnya'14-16. Setelah menjelaskan penciptaan langit dan bumi seisinya, Allah menjelaskan penciptaan manusia dan jin. Dia menciptakan jenis manusia dari tanah kering seperti tembikar, dan dia menciptakan jenis jin dari nyala api yang murni tanpa asap. Maka, wahai manusia dan jin, nikmat tuhanmu yang manakah yang kamu dustakan'."
  }
]