[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "14-15. Allah menciptakan bapak manusia, yaitu Adam, dari tanah basah yang mengering seperti tembikar, dan menciptakan iblis, yang berasal dari kalangan jin, dari kobaran api yang sebagian bercampur dengan sebagian yang lain."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Allah menciptakan Adam -'alaihissalām- dari tanah kering yang mengeluarkan suara mendidih seperti tanah yang dimasak (tembikar)."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "14-16. Allah menciptakan bapak para manusia, Adam, dari tanah kering seperti tembikar; dan menciptakan jin dari kobaran api berwarna-warni yang bersusun. Maka kenikmatan mana yang Tuhan kalian berikan, yang kalian ingkari wahai jin dan manusia?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "14. خَلَقَ الْإِنسٰنَ مِن صَلْصٰلٍ كَالْفَخَّارِ (Dia menciptakan manusia dari tanah kering seperti tembikar) Makna (الصلصال) yakni tanah yang kering yang dapat mengeluarkan suara bergetar. Dan (الفخار) adalah tembikar yang telah dibakar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14. Dia menciptakan manusia dari tanah kering yang mengandung dentingan atau suara, seperti tembikar, yaitu tanah yang dipanaskan untuk dibentuk."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia telah menciptakan manusia} Adam AS {dari tanah kering} tanah kering yang dapat mengeluarkan suara ketika ditiup {seperti tembikar} seperti tanah yang dibakar dengan api"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "14. Ini merupakan nikmat-nikmat Allah yang Dia anugerahkan kepada para hambaNya, dimana Dia memperlihatkan kepada mereka di antara bukti KuasaNya dan keindahan ciptaanNya, dengan “menciptakan” bapak moyang “manusia” yaitu Nabi Adam, “dari tanah kering seperti tembikar,” maksudnya dari tanah basah yang telah Dia kokohkan sampai kering sehingga kemudian menjadi tanah yang memiliki kekeringan dan suara seperti suara tembikar, yaitu tanah yang terbakar."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rahman ayat 14: 14-15. Allah mengabarkan bahwa Allah menciptakan Adam sebagai bapaknya manusia dari tanah kering yang memiliki suara pecahan seperti tembikar, yaitu tanah yang dibentuk dengan cara dibakar menggunakan api. Allah juga mengabarkan bahwa Dialah yang menciptakan iblis, dan dia adalah bapaknya jin, yang diciptakan dari nyala api murni."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Termasuk nikmat-nikmat-Nya kepada hamba-hamba-Nya adalah Dia memperlihatkan kepada mereka atsar (pengaruh) dari qudrah(kekuasaan)-Nya dan indahnya ciptaan-Nya. Bapak manusia yaitu Adam ‘alaihis salam. Yaitu tanah yang basah, yang dikokohkan sehingga menjadi kering dan berbunyi seperti suara tembikar yang dibakar di atas api."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rahman Ayat 14",
    "description": "14-16. Setelah menjelaskan penciptaan langit dan bumi seisinya, Allah menjelaskan penciptaan manusia dan jin. Dia menciptakan jenis manusia dari tanah kering seperti tembikar, dan dia menciptakan jenis jin dari nyala api yang murni tanpa asap. Maka, wahai manusia dan jin, nikmat tuhanmu yang manakah yang kamu dustakan'14-16"
  }
]