[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "14-15. Allah menciptakan bapak manusia, yaitu Adam, dari tanah basah yang mengering seperti tembikar, dan menciptakan iblis, yang berasal dari kalangan jin, dari kobaran api yang sebagian bercampur dengan sebagian yang lain."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Dan menciptakan bapaknya jin dari nyala api murni tidak mengandung asap."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15. وَخَلَقَ الْجَآنَّ مِن مَّارِجٍ مِّن نَّارٍ (dan Dia menciptakan jin dari nyala api) Makna (المارج) adalah nyala api yang meninggi yang memiliki kobaran yang sangat panas."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "15. Dia juga menciptakan jin. Asal usul jin yaitu dari nyala api neraka yang tidak mengeluarkan asap sedikitpun."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia juga telah menciptakan jin} Iblis {dari nyala} nyala yang tidak mengandung asap {dari api"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "15. “Dia menciptakan jin” maksudnya, bapak moyang jin, yaitu iblis- semoga Allah melaknatnya- “dari nyala api,” maksudnya, dari nyala api yang tulen, atau yang telah bercampur dengan asap. Ini menunjukkan kemuliaan unsur manusia yang diciptakan dari tanah yang merupakan tempat kemantapan, berat, dan sarat dengan manfaat. Berbeda halnya dengan unsur jin yaitu api yang merupakan keringanan (enteng), keburukan, dan kerusakan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rahman ayat 15: 14-15. Allah mengabarkan bahwa Allah menciptakan Adam sebagai bapaknya manusia dari tanah kering yang memiliki suara pecahan seperti tembikar, yaitu tanah yang dibentuk dengan cara dibakar menggunakan api. Allah juga mengabarkan bahwa Dialah yang menciptakan iblis, dan dia adalah bapaknya jin, yang diciptakan dari nyala api murni."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Bapak jin yaitu Iblis yang terlaknat. Yakni kobaran api yang bersih. Hal ini menunjukkan keutamaan unsur (bahan baku) manusia yang diciptakan dari tanah, dimana tanah dapat dimanfaatkan, seperti dengan digarap dan ditanam tumbuh-tumbuhan. Berbeda dengan api, yang keadaannya ringan, tidak tentu arah, buruk dan merusak."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rahman Ayat 15",
    "description": "14-16. Setelah menjelaskan penciptaan langit dan bumi seisinya, Allah menjelaskan penciptaan manusia dan jin. Dia menciptakan jenis manusia dari tanah kering seperti tembikar, dan dia menciptakan jenis jin dari nyala api yang murni tanpa asap. Maka, wahai manusia dan jin, nikmat tuhanmu yang manakah yang kamu dustakan'14-16"
  }
]