[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah adalah Tuhan dua timur, yaitu tempat terbit matahari saat musim dingin dan saat musim panas, Tuhan dua barat, yaitu tempat terbenamnya pada kedua musim itu. Semuanya berada di bawah pengaturan Allah dan rububiyahNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Yang memelihara dua tempat terbitnya matahari dan dua tempat tenggelamnya pada musim dingin dan musim panas."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "17-18. Allah adalah Tuhan dua tempat terbit dan dua tempat tenggelamnya matahari pada musim dingin dan musim panas. Maka kenikmatan mana yang Tuhan kalian berikan, yang kalian ingkari wahai jin dan manusia?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "17. رَبُّ الْمَشْرِقَيْنِ وَرَبُّ الْمَغْرِبَيْنِ (Tuhan yang memelihara kedua tempat terbit matahari dan Tuhan yang memelihara kedua tempat terbenamnya) Yakni tempat terbit matahari di waktu musim dingin dan musim panas, dan tempat terbenamnya pada dua musim tersebut."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17. Tuhannya dua tempat terbit dan tenggelamnya matahari saat musim dingin dan musim panas."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tuhan kedua tempat terbit dan Tuhan kedua tempat terbenam} dua tempat terbit dan terbenam matahari pada musim dingin dan musim panas"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17-18. Maksudnya, Allah adalah Rabb segala sesuatu yang matahari, bulan, dan bintang-bintang yang bercahaya terbit terhadapnya, dan Rabb segala sesuatu yang apa saja terbenam darinya, serta segala sesuatu yang keduanya ada padanya. Semuanya berada di bawah pengaturan dan rububiyahNYa. Di dalam ayat ini Allah menyebutkan timur dan barat dalam bentuk mutsanna (dua) menurut tempat terbit musim dingin dan musim panas."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rahman ayat 17: Allah mengabarkan bahwa yang mengawali (dari yang sebelumnya tiada) dari kenikmatan-kenikmatan ini adalah Allah Tuhan pemilik matahari yang terbit dari timur dan barat, pemilik musim dingin dan panas."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya tempat terbit dan terbenam matahari di musim panas dan di musim dingin."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rahman Ayat 17",
    "description": "17-18. Allah yang maha pencipta itu adalah tuhan yang memelihara dan mengendalikan dua timur, yaitu dua tempat terbit matahari pada musim panas dan musim dingin, dan dia pula tuhan yang memelihara dan mengendalikan dua barat, yaitu tempat terbenamnya matahari pada kedua musim tersebut. Maka, wahai manusia dan jin, nikmat tuhanmu yang manakah yang kamu dustakan'17-18"
  }
]