[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "19-20. Allah mencampur air dua laut (tawar dan asin) keduanya bertemu, tidak ada pemisah di antara keduanya di depan mata, sekalipun begitu di antara keduanya tetap ada pembatasnya, salah satunya tidak mempengaruhi yang lain dan melenyapkan ciri khasnya, yang tawar tetap tawar dan yang asin tetap asin, sekalipun keduanya bertemu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Allah mencampurkan antara dua lautan, yang asin dan yang tawar saling bertemu yang tampak dilihat dengan mata."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "19-23. Salah satu kenikmatan-Nya, Allah menciptakan dua lautan; laut air asin dan air tawar, yang saling bersebelahan. Allah mendatangkan laut air tawar pada laut air asin, dan menjadikan pemisah di antara keduanya sehingga laut air tawar tetap tawar dan laut air asin tetap asin. Maka kenikmatan mana yang Tuhan kalian berikan, yang kalian ingkari wahai jin dan manusia? Dari dua laut itu dihasilkan mutiara yang beraneka ragam dan marjan dengan beraneka ukuran. Maka kenikmatan mana yang Tuhan kalian berikan, yang kalian ingkari wahai jin dan manusia?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "19. مَرَجَ الْبَحْرَيْنِ يَلْتَقِيَانِ (Dia membiarkan dua lautan mengalir yang keduanya kemudian bertemu) Yakni saling berdempetan tanpa ada pembatas di antara keduanya dalam pandangan mata, namun demikian keduanya tidak dapat tercampur."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19. Tuhan yang mempertemukan dan mengalirkan dua lautan, yaitu lautan yang manis dan asin agar bertemu. Maknanya keduanya mengalir bersamaan tanpa ada pemisah antara keduanya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia membiarkan dua laut bertemu} Dia membiarkan dua lautan yang asin dan yang tawar berdampingan yang bisa dilihat dengan mata"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "19-23. Yang dimaksud dengan dua lautan adalah lautan tawar dan laut asin, keduanya saling bertemu sehingga yang tawar mengenai yang asin dan bercampur. Akan tetapi Allah telah menjadikan di antara keduanya batas pemisah dari tanah sehingga salah satunya tidak melampaui yang lain dan keduanya memiliki manfaat masing-masing. Laut tawar sebagai minuman jin dan manusia, pepohonan, serta ladang sawah mereka. Sedangkan laut yang asin menjadikan udara segar dan menghasilkan berbagai macam ikan, mutiara serta marjan, dan menjadi tempat berlayar bagi kapal dan perahu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rahman ayat 19: Kemudian Allah memberikan kepada hamba-Nya apa yang ada di dalam lautan; Diamana telah diutus dan mengalir dua laut (laut dengan air tawar dan asin), yang keduanya saling bertemu dan satu sama lain mengalir membaur pada sisi masing-masing laut."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rahman Ayat 19",
    "description": "19-21. Dia membiarkan bebas dua laut mengalir berdampingan yang kemudian keduanya bertemu pada permukaannya. Di antara keduanya ada batas yang diciptakan Allah sehingga batas itu tidak dilampaui oleh masing-masing. Keduanya tidak bercampur atau melampaui batas tersebut. Maka, wahai manusia dan jin, nikmat tuhanmu yang manakah yang kamu dustakan'19-21"
  }
]