[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-2. Allah Yang Maha Pengasih, Yang mengajari manusia al-Quran dengan memudahkan membaca dan menghafalnya serta memahami makna-maknanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Yang telah mengajarkan Al-Qur`ān kepada manusia dengan memudahkannya untuk dihafal dan memudahkan pemahaman makna-maknanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "1-2. Allah SWT adalah Dzat yang Maha Pengasih lagi Maha Pemberi Nikmat dengan keagungan-keagungan nikmat dunia dan akhirat. Dzat yang mengajarkan rasulNya Al-Qur’an dengan memberinya wahyu untuk disampaikan kepada manusia."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Telah mengajarkan Al-Qur’an"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2. Allah menyebutkan (dalam ayat ini) bahwa Dia “telah mengajarkan al-Quran,” yakni mengajarkan para hambaNya lafazh-lafazh dan makna al-Quran serta memudahkannya untuk mereka. Hal ini merupakan karunia teragung dan kasih sayang yang Dia anugerahkan kepada hamba-hambaNya, di mana Dia telah menurunkan al-Quran berbahasa Arab dengan lafazh paling indah dan makna paling jelas, yang mencakup segala bentuk kebaikan dan mencegah dari segala kejahatan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rahman ayat 2: Kemudian Allah menyebutkan sejumlah nikmat atas hambanya, dan memulai dengan menyebutkan sebesar-besar kenikmatan yaitu Al Qur’an; Allah menyebutkan telah memberi pengajaran kepada Nabi untuk membaca ayat; Dimana Jibril yang mengajarkan secara langsung kepada Rasul ﷺ Al Qur’an atas perintah Allah, kemudian Rasul mengajarkan kepada umatnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala menyebutkan, bahwa Dia telah mengajarkan Al Qur’an, yakni Dia telah mengajarkan lafaz dan maknanya serta memudahkannya kepada hamba-hamba-Nya. Ini adalah nikmat dan rahmat yang paling besar yang Allah limpahkan kepada hamba-hamba-Nya, dimana Dia menurunkan kepada mereka Al Qur’an berbahasa Arab dengan lafaz dan keterangan yang paling baik yang mengandung semua kebaikan dan melarang semua keburukan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rahman Ayat 2",
    "description": "Allah menyebut rahmat-Nya yang paling agung. Dialah tuhan yang telah mengajarkan Al-Qur'an kepada siapa saja yang dia kehendaki. 3-4. Dia juga yang menciptakan manusia, makhluk yang paling memerlukan tuntunan-Nya, dan kemudian mengajarnya pandai berbicara untuk mengungkapkan ide dalam benaknya."
  }
]