[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "19-20. Allah mencampur air dua laut (tawar dan asin) keduanya bertemu, tidak ada pemisah di antara keduanya di depan mata, sekalipun begitu di antara keduanya tetap ada pembatasnya, salah satunya tidak mempengaruhi yang lain dan melenyapkan ciri khasnya, yang tawar tetap tawar dan yang asin tetap asin, sekalipun keduanya bertemu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "20. Di antara dua laut itu terdapat penghalang yang menghalangi salah satu dari keduanya untuk melampaui ke yang lainnya, sehingga yang asin tetap asin dan yang tawar tetap tawar."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "20. بَيْنَهُمَا بَرْزَخٌ (antara keduanya ada batas) Yakni pembatas yang membatasi keduanya. لَّا يَبْغِيَانِ(yang tidak dilampaui masing-masing) Yakni masing-masing tidak dapat bercampur dengan yang lain. Ibnu Juraij mengatakan yang dimaksud adalah lautan air asin dan aliran sungai air tawar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20. Di amtara keduanya itu ada batas dari Allah SWT yang tidak dapat ditembus satu sama lain, sehingga keduanya terpisah dan tidak tercampur"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Di antara keduanya ada pembatas} penghalang {yang tidak dilampaui oleh keduanya} yang membuat keduanya tidak bercampur"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "19-23. Yang dimaksud dengan dua lautan adalah lautan tawar dan laut asin, keduanya saling bertemu sehingga yang tawar mengenai yang asin dan bercampur. Akan tetapi Allah telah menjadikan di antara keduanya batas pemisah dari tanah sehingga salah satunya tidak melampaui yang lain dan keduanya memiliki manfaat masing-masing. Laut tawar sebagai minuman jin dan manusia, pepohonan, serta ladang sawah mereka. Sedangkan laut yang asin menjadikan udara segar dan menghasilkan berbagai macam ikan, mutiara serta marjan, dan menjadi tempat berlayar bagi kapal dan perahu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rahman ayat 20: Allah menjelaskan bahwa Dia menjadikan di antara dua laut penghalang (sekat), Allah jadikan antara (laut tawar dan asin) tidak bercampur satu sama lain."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sehingga tidak bercampur. Di antara ahli tafsir ada yang berpendapat bahwa la yabghiyan maksudnya masing-masingnya tidak menghendaki. Dengan demikian maksud ayat 19-20 ialah bahwa ada dua laut yang keduanya terpisah karena dibatasi oleh tanah genting, tetapi tanah genting itu tidaklah dikehendaki (tidak diperlukan), maka pada akhirnya, tanah genting itu dibuang (digali untuk keperluan lalu lintas), maka bertemulah dua lautan itu, seperti terusan Suez dan terusan Panama. Menurut Syaikh As Sa’diy, maksud dua buah laut adalah; laut yang terasa tawar dan laut yang terasa asin, keduanya bertemu bersama, sehingga laut yang berair tawar mengena kepada laut yang berair asin sehingga keduanya bercampur. Akan tetapi, Allah Subhaanahu wa Ta'aala menjadikan di antara keduanya ada batas pemisah dari daratan sehingga yang satu tidak dapat dilampaui oleh masing-masing, namun tercapai manfaat dari keduanya. Dari air yang tawar dapat dimanfaatkan dengan diminum oleh manusia dan hewan serta digunakan menyirami tanaman, sedangkan dari air laut yang asin ada udara menjadi sejuk, ikan, mutiara dan marjan. Demikian pula menjadi tempat berlayar perahu dan kapal-kapal."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rahman Ayat 20",
    "description": "19-21. Dia membiarkan bebas dua laut mengalir berdampingan yang kemudian keduanya bertemu pada permukaannya. Di antara keduanya ada batas yang diciptakan Allah sehingga batas itu tidak dilampaui oleh masing-masing. Keduanya tidak bercampur atau melampaui batas tersebut. Maka, wahai manusia dan jin, nikmat tuhanmu yang manakah yang kamu dustakan'19-21"
  }
]