[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka nikmat manakah dari nikmat-nikmat Tuhan kalian berdua (wahai jin dan manusia) yang kalian dustakan?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Maka dengan nikmat Allah yang banyak untuk kalian -wahai jin dan manusia- yang mana yang kalian dustakan?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "21. Maka nikmat Tuhan mana yang kalian dustakan wahai jin dan manusia?!"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka nikmat Tuhan kalian yang manakah yang kalian dustakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "19-23. Yang dimaksud dengan dua lautan adalah lautan tawar dan laut asin, keduanya saling bertemu sehingga yang tawar mengenai yang asin dan bercampur. Akan tetapi Allah telah menjadikan di antara keduanya batas pemisah dari tanah sehingga salah satunya tidak melampaui yang lain dan keduanya memiliki manfaat masing-masing. Laut tawar sebagai minuman jin dan manusia, pepohonan, serta ladang sawah mereka. Sedangkan laut yang asin menjadikan udara segar dan menghasilkan berbagai macam ikan, mutiara serta marjan, dan menjadi tempat berlayar bagi kapal dan perahu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rahman ayat 21: Telah berlalu tafsirnya pada ayat 13 dalam surat ini."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rahman Ayat 21",
    "description": "19-21. Dia membiarkan bebas dua laut mengalir berdampingan yang kemudian keduanya bertemu pada permukaannya. Di antara keduanya ada batas yang diciptakan Allah sehingga batas itu tidak dilampaui oleh masing-masing. Keduanya tidak bercampur atau melampaui batas tersebut. Maka, wahai manusia dan jin, nikmat tuhanmu yang manakah yang kamu dustakan'22-23. Demikianlah Allah membiarkan kedua laut itu mengalir berdampingan. Dari keduanya keluar atau ditemukan mutiara dan marjan yang indah. Maka, wahai manusia dan jin, nikmat tuhanmu yang manakah yang kamu dustakan'."
  }
]