[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka nikmat manakah dari nikmat-nikmat Tuhan kalian berdua (wahai jin dan manusia) yang kalian dustakan?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "25. Maka dengan nikmat Allah yang banyak untuk kalian -wahai jin dan manusia- yang mana yang kalian dustakan?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "25. Maka nikmat Tuhan mana yang kalian dustakan wahai jin dan manusia?!"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka nikmat Tuhan kalian yang manakah yang kalian dustakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "24-25. Maksudnya, Allah menciptakan bagi para hambaNya bahtera-bahtera yang mengarungi dan memecah lautan dengan izin Allah, yang mana bahtera-bahtera tersebut dibuat oleh manusia sehingga karena besarnya laksana al-A’lam, yaitu gunung-gunung yang menjulang tinggi. Kemudian manusia menaikinya dan membawa di atasnya segala macam barang dagangan mereka serta segala sesuatu yang menjadi kebutuhan pokok mereka. Dan sungguh Allah Sang Penjaga langit dan bumi telah menjaga dan memeliharanya, hal itu merupakan nikmat Allah yang sangat agung. Oleh sebab itu Dia berfirman, “Maka nikmat Rabb kamu yang manakah yang kamu dustakan?”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rahman ayat 25: Telah berlalu tafsirnya pada ayat 13 dalam surat ini."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rahman Ayat 25",
    "description": "24-25. Hanya milik-Nyalah kapal-kapal yang berlayar di lautan yang tampak bagaikan gunung-gunung yang menjulang tinggi. Maka, wahai manusia dan jin, nikmat tuhanmu yang manakah yang kamu dustakan'26-28. Usai menjelaskan anugerah-Nya bagi kelangsungan hidup makhluk di bumi, Allah mengingatkan bahwa semua itu tidak akan membuat mereka kekal. Semua yang ada di bumi itu akan binasa, mati dan meninggalkan dunia ini, tetapi wajah atau zat tuhanmu yang memiliki kebesaran dan kemuliaan itu tetap kekal. Maka, wahai manusia dan jin, nikmat tuhanmu yang manakah yang kamu dustakan'."
  }
]