[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "26-27. Semua makhluk yang ada di bumi akan binasa, dan yang tetap hidup adalah Wajah Tuhanmu, Pemilik Keagungan, kebesaran, keutamaan dan kemurahan. Dalam ayat ini terkandung penetapan sifat “wajah” bagi Allah sesuai dengan keagunganNYa, tanpa menyamakan dan menentukan bentuknya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "26. Setiap yang makhluk yang ada di muka bumi pasti akan binasa, tidak disangsikan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "26-28. Seluruh makhluk yang ada di muka bumi pasti akan binasa, dan yang tetap kekal hanyalah Wajah Tuhanmu yang Maha Agung dan Maha Mulia. Maka kenikmatan mana yang Tuhan kalian berikan, yang kalian ingkari wahai jin dan manusia?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "26. كُلُّ مَنْ عَلَيْهَا فَانٍ (Semua yang ada di bumi itu akan binasa) Yakni semua yang berada di bumi akan mati suatu hari nanti baik itu manusia maupun hewan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "26. Semua yang ada di atas permukaan bumi dari golongan manusia dan hewan itu pasti binasa dan mati"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Semua yang ada di atasnya} di atas permukan bumi {akan binasa} binasa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "26-28. Maksudnya, semua yang ada di bumi, baik manusia, jin, binatang maupun semua makhluk akan mati dan binasa, dan tetap kekallah Allah Yang Mahahidup (Kekal) Yang tidak akan mati. “Yang mempunyai kebesaran dan kemuliaan,” maksudnya memiliki keagungan, kebesaran, dan kemuliaan, yang diagungkan, dibesarkan dan dimuliakan karenanya. Dan memiliki kemuliaan, yakni keluasan anugerah dan derma, di mana Dia memuliakan para kekasih dan para hamba istimewaNya dengan berbagai macam kemuliaan. Dan para waliNya memuliakan, membesarkan, mengagungkan, mencintaiNya serta kembali dan beribadah kepadaNya. “Maka nikmat Rabb kamu yang manakah yang kamu dustakan?”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rahman ayat 26: 26-27. Allah mengabarkan setiap apa yang ada di bumi dari makhluk yang hidup adalah sementara (fana) dan akan berakhir, dan tidaklah tersisa kecuali hanya Allah tidak ada yang lain."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Baik manusia, jin, hewan dan makhluk-makhluk lainnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rahman Ayat 26",
    "description": "26-28. Usai menjelaskan anugerah-Nya bagi kelangsungan hidup makhluk di bumi, Allah mengingatkan bahwa semua itu tidak akan membuat mereka kekal. Semua yang ada di bumi itu akan binasa, mati dan meninggalkan dunia ini, tetapi wajah atau zat tuhanmu yang memiliki kebesaran dan kemuliaan itu tetap kekal. Maka, wahai manusia dan jin, nikmat tuhanmu yang manakah yang kamu dustakan'26-28"
  }
]