[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "26-27. Semua makhluk yang ada di bumi akan binasa, dan yang tetap hidup adalah Wajah Tuhanmu, Pemilik Keagungan, kebesaran, keutamaan dan kemurahan. Dalam ayat ini terkandung penetapan sifat “wajah” bagi Allah sesuai dengan keagunganNYa, tanpa menyamakan dan menentukan bentuknya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "27. Dan wajah Rabbmu -wahai Rasul- yang mempunyai kebesaran, kebaikan dan kemuliaan terhadap hamba-hamba-Nya tetap kekal, tidak tersentuh oleh kefanaan selamanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "27. وَيَبْقَىٰ وَجْهُ رَبِّكَ ذُو الْجَلٰلِ وَالْإِكْرَامِ (Dan tetap kekal Dzat Tuhanmu yang mempunyai kebesaran dan kemuliaan) Yang dimaksud dengan (الوجه) adalah Dzat dan wujud Allah Ta’ala. Dan (الجلال) yakni kebesaran dan keagungan. Sedangkan (الإكرام) yakni berlepas diri dari segala yang tidak layak bagi-Nya, dan memiliki sifat yang paling mulia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "27-28. Dan hanya Dzat Allah dan wajahNya yang abadi. Dialah Dzat yang hidup abadi dan tidak pernah mati. Dialah Dzat yang memiliki keagungan dan kebesaran. Dzat yang memiliki keutamaan dan nikmat yang dilimpahkan untuk hamba-hambaNya yang beriman. Maka mana nikmat Tuhan yang telah disebutkan sebelumnya itu yang kalian dustakan wahai jin dan manusia?!"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dzat Tuhanmu yang memiliki kebesaran} yang memiliki keagungan dan kebeasaran {dan kemuliaan } keutamaan dan kemuliaan {tetap kekal"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "26-28. Maksudnya, semua yang ada di bumi, baik manusia, jin, binatang maupun semua makhluk akan mati dan binasa, dan tetap kekallah Allah Yang Mahahidup (Kekal) Yang tidak akan mati. “Yang mempunyai kebesaran dan kemuliaan,” maksudnya memiliki keagungan, kebesaran, dan kemuliaan, yang diagungkan, dibesarkan dan dimuliakan karenanya. Dan memiliki kemuliaan, yakni keluasan anugerah dan derma, di mana Dia memuliakan para kekasih dan para hamba istimewaNya dengan berbagai macam kemuliaan. Dan para waliNya memuliakan, membesarkan, mengagungkan, mencintaiNya serta kembali dan beribadah kepadaNya. “Maka nikmat Rabb kamu yang manakah yang kamu dustakan?”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rahman ayat 27: 26-27. Allah mengabarkan setiap apa yang ada di bumi dari makhluk yang hidup adalah sementara (fana) dan akan berakhir, dan tidaklah tersisa kecuali hanya Allah tidak ada yang lain."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni yang mempunyai keagungan dan kebesaran; yang diagungkan dan dibesarkan. Ikraam artinya yang luas karunia dan kemurahan-Nya, serta yang menghendaki untuk memuliakan para wali dan makhluk pilihan-Nya dengan berbagai bentuk pemuliaan, dimana Dia dimuliakan, diagungkan, dicintai dan diibadahi oleh para wali-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rahman Ayat 27",
    "description": "26-28. Usai menjelaskan anugerah-Nya bagi kelangsungan hidup makhluk di bumi, Allah mengingatkan bahwa semua itu tidak akan membuat mereka kekal. Semua yang ada di bumi itu akan binasa, mati dan meninggalkan dunia ini, tetapi wajah atau zat tuhanmu yang memiliki kebesaran dan kemuliaan itu tetap kekal. Maka, wahai manusia dan jin, nikmat tuhanmu yang manakah yang kamu dustakan'26-28"
  }
]