[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "29-30. Penghuni langit dan bumi memohon kepadaNya hajat-hajat mereka, tidak seorang pun yang tidak membutuhkanNya. Setiap hari Allah dalam urusan, memuliakan dan menghinakan, memberi dan menghalangi. Maka nikmat manakah dari nikmat-nikmat Tuhan kalian berdua (wahai jin dan manusia) yang kalian dustakan?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "29. Semua malaikat yang ada di langit, manusia dan jin yang ada di muka bumi memohon hajat mereka kepada-Nya. Setiap hari Dia mengurusi segala permasalahan hamba-hamba-Nya, dari mulai menghidupkan, mematikan, memberi rezeki dan sebagainya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "29-30. Seluruh makhluk yang ada di tujuh langit dan bumi meminta kepada Allah segala yang mereka butuhkan. Setiap hari Allah berada dalam urusan; menjadikan kaya dan miskin, dan menghidupkan dan mematikan. Maka kenikmatan mana yang Tuhan kalian berikan, yang kalian ingkari wahai jin dan manusia?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "27. وَيَبْقَىٰ وَجْهُ رَبِّكَ ذُو الْجَلٰلِ وَالْإِكْرَامِ (Dan tetap kekal Dzat Tuhanmu yang mempunyai kebesaran dan kemuliaan) Yang dimaksud dengan (الوجه) adalah Dzat dan wujud Allah Ta’ala. Dan (الجلال) yakni kebesaran dan keagungan. Sedangkan (الإكرام) yakni berlepas diri dari segala yang tidak layak bagi-Nya, dan memiliki sifat yang paling mulia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "29-30. Seluruh makhluk yang ada di langit dan bumi meminta kepadaNya segala sesuatu yang mereka butuhkan berupa kebahagiaan, rejeki serta kehidupan. Setiap waktu Dia mengatur segala sesuatu. Dia menciptakan manusia dan memperbarui keadaan-keadaannya sesuai ketentuanNya yang terdahulu, berupa kehidupan dan kematian, pemberian keagungan dan kehinaan, pemberian kekayaan dan kefakiran, serta pengabulan permintaan, pengharaman sesuatu dan lain-lain. Maka nikmat Tuhan mana yang kalian dustakan wahai jin dan manusia, yaitu nikmat pengaturan segala urusan-urusan yang berbeda untuk hamba-hambaNya?!"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Siapa saja yang ada di langit dan bumi selalu meminta kepadaNya. Setiap hari Dia menangani urusan} perkara, Dia meninggikan dan menundukkan, memberi dan menahan, menghidupkan dan mematikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "29-30. Maksudnya, Dia Mahakaya dengan DzaNya (tidak membutuhkan apa pun) dari semua makhlukNya. Dia Maha Luas kedermawanan dan kemuliaanNYa. Semua makhluk membutuhkanNya, di mana mereka selalu memohon segala macam kebutuhan mereka kepadaNya, baik dengan kondisi maupun dengan ucapan mereka. Mereka akan selalu membutuhkanNya setiap waktu setiap saat, dan Dia “setiap waktu dalam kesibukan,” mencukupkan orang fakir, menutupi kebutuhan orang yang sedang kekurangan, memberi kepada suatu kaum dan menahan dari kaum yang lain, mematikan dan menghidupkan, merendahkan dan mengangkat, namun tidak ada satu urusanpun yang menyibukanNya dari urusan yang lain. Tidak akan membuatNya marah dengan banyaknya permintaan, tidak akan jemu dengan orang yang selalu dan terus menerus memohon kepadaNya. Mahasuci Allah Yang Mahamulia lagi Maha Memberi, yang pemberianNYa meliputi seluruh penghuni bumi dan langit, dan kemurahanNya meliputi seluruh makhluk di setiap waktu dan masa. Mahatinggi Allah yang anugerahNya tidak terhenti oleh kemaksiatan orang yang bermaksiat dan sikap ketidakbutuhan orang-orang fakir yang bodoh kepadaNya dan kepada kedermawananNYa. Kesibukan-kesibukan yang Allah kabarkan melalui FirmanNYa, “Setiap waktu Dia dalam kesibukan” adalah: ketentuan takdir dan segala pengaturanNya yang telah Dia takdirkan dan Dia tentukan sejak zaman azali. Dia selalu menakdirkan dan melaksanakan ketentuan-ketentuan tersebut pada waktu-waktunya yang sesuai dengan tuntutan hikmahNya. Yaitu hukum-hukumNYa yang berkenaan dengan agama yang mencakup perintah dan larangan, dan takdir yang Dia berlakukan terhadap para hambaNya selama mereka hidup di dunia ini. Hingga tatkala sempurna (usai) semua perkara tersebut, Allah akan membinasakan mereka dan kemudian memberlakukan pembalasan atas segala amal perbuatan mereka dan memperlihatkan kepada mereka keadilan dan karunia serta kebaikanNya yang berlimpah, yang dengannya mereka mengetahui dan mentauhidkanNya. Dia memindahkan makhluk yang dibebani syariat dari tempat ujian dan cobaan menuju tempat kehidupan yang sebenarnya. Ketika itulah dilaksanakan keputusan (pengadilan) yang telah datang waktunya, dan inilah yang dimaksudkan dalam FirmanNYa,"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rahman ayat 29: Allah mengabarkan bahwa setiap apa yang ada di langit dan di bumi fakir membutuh Allah, dan semua makhluk membutuhkan-Nya, mereka selalu meminta kepada Allah; Maka penghuni langit meminta ampunan, dan penghuni bumi meminta ampunan dan rizki. Kemudian Allah menjelaskan, bahwa pada setiap waktum setiap penantian dalam segala urusan pasti ada yang meminta di antara makhluk-Nya. Allah jadikan mereka kaya dan miskin, Allah hinakan dan tinggikan, dan Allah ampunkan dosa-dosa mereka dan Allah hamparkan kesedihan serta Allah hidupkan dan matikan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Baik dengan lisaanul maqaal (lisan) maupun lisaanul haal (keadaan). Allah Subhaanahu wa Ta'aala Mahakaya zat-Nya tidak membutuhkan semua makhluk-Nya dan Mahaluas kemurahan-Nya. Semua makhluk butuh kepada-Nya meminta dipenuhi kebutuhannya dan mereka tidak pernah cukup terhadapnya sekejap mata pun atau kurang dari itu. Dia mengayakan yang miskin, menutupi hati yang sedih, memberi kepada suatu kaum dan menghalangi yang lain, menciptakan, menghidupkan dan mematikan, memuliakan dan menghinakan, meninggikan dan merendahkan, memelihara, memberi rezki, mengabulkan doa dan lain lain. Dia tidak pernah lelah terhadapnya dan tidak pernah bosan terhadap permintaan makhluk-Nya yang begitu banyak dan terus menerus. Dia senantiasa menampilkan apa yang telah ditetapkan-Nya di zaman azali (yang tidak ada awalnya) pada waktu-waktunya yang sesuai hikmah-Nya, baik ketetapan agama yang berupa perintah dan larangan, ketetapan qadari terhadap hamba-hamba-Nya selama mereka tinggal di dunia, sehingga ketika telah sempurna makhluk itu dan Allah telah membinasakan mereka, Dia menampilkan ketetapan jaza’i(pembalasan)-Nya dan memperlihatkan kepada mereka keadilan, karunia dan ihsan-Nya yang banyak, dimana dengannya mereka dapat mengenal-Nya dan mentauhidkan-Nya. Dia memindahkan manusia dari tempat ujian (dunia) menuju kepada kehidupan yang sesungguhnya. Allah Subhaanahu wa Ta'aala berfirman, “Tidaklah kehidupan dunia ini melainkan senda gurau dan main-main. Dan sesungguhnya akhirat itulah kehidupan yang sebenarnya, kalau mereka mengetahui.” (Al ‘Ankabut: 64) Maka Mahasuci Allah Tuhan Yang Maha Pemberi yang pemberian-Nya merata kepada penduduk langit dan bumi, dan kelembutan-Nya mengena kepada semua makhluk di setiap waktu dan setiap saat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rahman Ayat 29",
    "description": "29-30. Dalam kehidupan ini, apa saja yang ada di langit dan di bumi selalu meminta kepada-Nya untuk memenuhi hajat hidup mereka. Karenanya, setiap waktu dia terus berada dalam kesibukan mengatur dan memenuhi kebutuhan makhluk-Nya. Maka, wahai manusia dan jin, nikmat tuhan-Mu yang manakah yang kamu dustakan'29-30"
  }
]