[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "3-4. Dia menciptakan manusia dan mengajarinya Penjelasan apa yang ada dalam jiwanya sebagai pembeda antara ia dengan makhluk lainnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Dia menciptakan manusia dengan sempurna dan memperbagus bentuknya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "3-4. Allah menciptakan manusia dengan rupa yang terbaik, dan mengajarkannya berbagai macam cara penjelasan, karena dengannya dapat terpenuhi maksud dan keinginan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. خَلَقَ الْإِنسٰنَ (Dia menciptakan manusia) Kemudian Allah menyebutkan kenikmatan penciptaan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3-4. Dzat yang menciptakan manusia dan mengajarkannya untuk mengungkapkan (ekspresi) dirinya dan memahamkan orang lain dengan menyampaikan perkataan yang jelas."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia menciptakan manusia"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3-4. “Dia menciptakan manusia” dalam bentuk yang sebaik-baiknya, dengan anggota badan yang terbaik dan bentuk tubuh yang sempurna. Allah benar-benar telah menciptakannya dengan sempurna, dan telah memberinya keistimewaan sehingga berbeda dengan binatang, di mana Dia “mengajarnya pandai berbicara,” untuk dapat menjelaskan apa yang ada di dalam hatinya. Hal ini mencakup pengajaran berbicara dan menulis. Oleh karena itu, kemampuan berbicara (menjelaskan) yang dengannya Allah mengistimewakan manusia daripada makhluk lainnya, adalah di antara nikmat yang paling agung dan paling besar."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rahman ayat 3: Allah menyebutkan bahwa Dialah yang menciptakan Al Qur’an, yaitu mewujudkannya dan keadaannya dalam bentuk yang dimaui oleh Pencipta dengan tanpa meniru."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dia telah menciptakan manusia dalam bentuk yang sebaik-baiknya; sempurna anggota badannya dan tepat bagian-bagiannya (seperti meletakkan mata di kepala tidak di anggota badan yang lain), Allah Subhaanahu wa Ta'aala telah merapihkan dan menyempurnakannya serta membedakannya dengan makhluk-makhluk yang lain, yaitu dengan mengajarkannya pandai berbicara."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rahman Ayat 3",
    "description": "3-4. Dia juga yang menciptakan manusia, makhluk yang paling memerlukan tuntunan-Nya, dan kemudian mengajarnya pandai berbicara untuk mengungkapkan ide dalam benaknya"
  }
]