[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "29-30. Penghuni langit dan bumi memohon kepadaNya hajat-hajat mereka, tidak seorang pun yang tidak membutuhkanNya. Setiap hari Allah dalam urusan, memuliakan dan menghinakan, memberi dan menghalangi. Maka nikmat manakah dari nikmat-nikmat Tuhan kalian berdua (wahai jin dan manusia) yang kalian dustakan?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "30. Maka dengan nikmat Allah yang banyak untuk kalian -wahai jin dan manusia- yang mana yang kalian dustakan?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "29-30. Seluruh makhluk yang ada di langit dan bumi meminta kepadaNya segala sesuatu yang mereka butuhkan berupa kebahagiaan, rejeki serta kehidupan. Setiap waktu Dia mengatur segala sesuatu. Dia menciptakan manusia dan memperbarui keadaan-keadaannya sesuai ketentuanNya yang terdahulu, berupa kehidupan dan kematian, pemberian keagungan dan kehinaan, pemberian kekayaan dan kefakiran, serta pengabulan permintaan, pengharaman sesuatu dan lain-lain. Maka nikmat Tuhan mana yang kalian dustakan wahai jin dan manusia, yaitu nikmat pengaturan segala urusan-urusan yang berbeda untuk hamba-hambaNya?!"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka nikmat Tuhan kalian yang manakah yang kalian dustakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "29-30. Maksudnya, Dia Mahakaya dengan DzaNya (tidak membutuhkan apa pun) dari semua makhlukNya. Dia Maha Luas kedermawanan dan kemuliaanNYa. Semua makhluk membutuhkanNya, di mana mereka selalu memohon segala macam kebutuhan mereka kepadaNya, baik dengan kondisi maupun dengan ucapan mereka. Mereka akan selalu membutuhkanNya setiap waktu setiap saat, dan Dia “setiap waktu dalam kesibukan,” mencukupkan orang fakir, menutupi kebutuhan orang yang sedang kekurangan, memberi kepada suatu kaum dan menahan dari kaum yang lain, mematikan dan menghidupkan, merendahkan dan mengangkat, namun tidak ada satu urusanpun yang menyibukanNya dari urusan yang lain. Tidak akan membuatNya marah dengan banyaknya permintaan, tidak akan jemu dengan orang yang selalu dan terus menerus memohon kepadaNya. Mahasuci Allah Yang Mahamulia lagi Maha Memberi, yang pemberianNYa meliputi seluruh penghuni bumi dan langit, dan kemurahanNya meliputi seluruh makhluk di setiap waktu dan masa. Mahatinggi Allah yang anugerahNya tidak terhenti oleh kemaksiatan orang yang bermaksiat dan sikap ketidakbutuhan orang-orang fakir yang bodoh kepadaNya dan kepada kedermawananNYa. Kesibukan-kesibukan yang Allah kabarkan melalui FirmanNYa, “Setiap waktu Dia dalam kesibukan” adalah: ketentuan takdir dan segala pengaturanNya yang telah Dia takdirkan dan Dia tentukan sejak zaman azali. Dia selalu menakdirkan dan melaksanakan ketentuan-ketentuan tersebut pada waktu-waktunya yang sesuai dengan tuntutan hikmahNya. Yaitu hukum-hukumNYa yang berkenaan dengan agama yang mencakup perintah dan larangan, dan takdir yang Dia berlakukan terhadap para hambaNya selama mereka hidup di dunia ini. Hingga tatkala sempurna (usai) semua perkara tersebut, Allah akan membinasakan mereka dan kemudian memberlakukan pembalasan atas segala amal perbuatan mereka dan memperlihatkan kepada mereka keadilan dan karunia serta kebaikanNya yang berlimpah, yang dengannya mereka mengetahui dan mentauhidkanNya. Dia memindahkan makhluk yang dibebani syariat dari tempat ujian dan cobaan menuju tempat kehidupan yang sebenarnya. Ketika itulah dilaksanakan keputusan (pengadilan) yang telah datang waktunya, dan inilah yang dimaksudkan dalam FirmanNYa,"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rahman ayat 30: Telah berlalu tafsirnya pada ayat 13 dalam surat ini."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rahman Ayat 30",
    "description": "29-30. Dalam kehidupan ini, apa saja yang ada di langit dan di bumi selalu meminta kepada-Nya untuk memenuhi hajat hidup mereka. Karenanya, setiap waktu dia terus berada dalam kesibukan mengatur dan memenuhi kebutuhan makhluk-Nya. Maka, wahai manusia dan jin, nikmat tuhan-Mu yang manakah yang kamu dustakan'31-32. Kami bersama para malaikat akan memberi perhatian sepenuhnya kepadamu, wahai golongan manusia dan jin. Kami akan melakukan perhitungan secara cermat atas semua perbuatanmu. Maka, wahai manusia dan jin, nikmat tuhanmu yang manakah yang kamu dustakan'."
  }
]