[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "33-34. Wahai jin dan manusia, bila kalian mampu menembus perintah Allah dan hukumNya dengan berlari dari ujung langit dan bumi, maka lakukanlah. Kalian tidak sanggup melakukannya kecuali dengan kekuatan dan hujjah serta izin dari Allah. Mana mungkin kalian lakukan, sedangkan kalian sendiri tidak memiliki kuasa untuk mendatangkan manfaat dan mudarat untuk diri kalian? Maka nikmat manakah dari nikmat-nikmat Tuhan kalian berdua (wahai jin dan manusia) yang kalian dustakan?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "34. Maka dengan nikmat Allah yang banyak untuk kalian -wahai jin dan manusia- yang mana yang kalian dustakan?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "33-34. Wahai jin dan manusia, jika kalian bisa keluar dari area langit dan bumi untuk lari dari ketentuan dan takdir Allah, maka (cobalah) keluar dari takdirNya. Kalian tidak akan bisa menembus takdirNya kecuali dengan kekuatan dan kekuasaan Allah SWT. Maka nikmat Tuhan mana yang kalian dustakan wahai jin dan manusia?!"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka,nikmat Tuhan kalian yang manakah yang kalian dustakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "33-34. Maksudnya, apabila Allah mengumpulkan mereka semua di Hari Kiamat kelak, Allah kemudian mengabarkan kepada mereka akan ketidakberdayaan dan kelemahan mereka serta kesempurnaan kekuatan Allah dan berlakunya kehendak dan kekuasaanNya. Dia berfirman dengan menyatakan ketidakberdayaan mereka, “Hai jamaah jin dan manusia, jika kamu sanggup menembus (melintasi) penjuru langit dan bumi,” maksudnya, (jika kalian) menemukan jalan keluar sehingga kalian bisa melewatinya untuk keluar dari kerajaan dan kekuasaan Allah, “maka lintasilah, kamu tidak dapat menembusnya kecuali dengan kekuatan” maksudnya, kalian tidak akan bisa keluar darinya melainkan dengan kekuatan dan kemampuan yang sempurna. Namun bagaimana mungkin mereka bisa melakukan itu semua, sedangkan mereka sendiri sama sekali tidak mampu mendatangkan suatu kemanfaatan pun bagi dirinya, tidak memiliki kuasa untuk (menolak) kemudaratan dari dirinya, tidak kuasa mematikan, menghidupkan dan tidak pula membangkitkan. Pada hari itu, tidak ada yang berbicara seorangpun kecuali dengan seizin-Nya, dan tidak bisa mendengar kecuali hanya bisikan, dan pada waktu itu akan sama antara raja dengan rakyat, antara pimpinan dengan yang dipimpin dan antara yang kaya dengan yang miskin. Kemudian Allah menyebutkan apa yang telah Dia siapkan untuk mereka di hari itu,"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rahman ayat 34: Telah berlalu tafsirnya pada ayat 13 dalam surat ini."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rahman Ayat 34",
    "description": "33-34. Allah menegaskan bahwa manusia dan jin tidak akan dapat menghindar dari pertanggung jawaban. Wahai golongan jin dan manusia! jika kamu sanggup menembus atau melintasi penjuru langit dan bumi untuk menghindari pertanggung jawaban dan balasan yang akan menimpamu, maka keluar dan tembuslah keduanya. Ketauhilah, kamu tidak akan mampu menembusnya kecuali dengan kekuatan, sedangkan kamu sama sekali tidak mempunyai kekuatan itu. Maka, wahai manusia dan jin, nikmat tuhanmu yang manakah yang kamu dustakan'35-36. Wahai jin dan manusia, bila kamu berupaya menembus langit dan bumi, maka kepada kamu akan dikirim nyala api dan cairan tembaga panas yang meleleh sehingga kamu tidak dapat menyelamatkan diri dari-Nya. Maka, wahai manusia dan jin, nikmat tuhanmu yang manakah yang kamu dustakan'."
  }
]