[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "35-36. Akan dikirimkan bongkahan api kepada kalian dan tembaga panas meleleh yang dituangkan di atas kepala kalian. Sebagian dari kalian (wahai jin dan manusia) tidak bisa menolong sebagian yang lain. Maka nikmat manakah dari nikmat-nikmat Tuhan kalian berdua (wahai jin dan manusia) yang kalian dustakan?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "35. Dikirimkah kepada kalian -wahai jin dan manusia- nyala api yang tidak mengandung asap, dan asap yang tidak mengandung api, maka kalian tidak akan mampu menahan hal itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "35. يُرْسَلُ عَلَيْكُمَا شُوَاظٌ مِّن نَّارٍ (Kepada kamu, (jin dan manusia) dilepaskan nyala api) Makna (الشواظ) adalah nyala api yang tidak mengeluarkan asap. وَنُحَاسٌ(dan cairan tembaga) Yakni tembaga yang dilelehkan dengan api, lalu dituangkan ke atas kepala mereka. Pendapat lain mengatakan makna (النحاس) adalah asap yang tidak berasal dari nyala api, dan ini merupakan pendapat al-Khalil. فَلَا تَنتَصِرَانِ (maka kamu tidak dapat menyelamatkan diri) Yakni kalian tidak mampu menghindar dari azab Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "35. Jika kalian berusaha untuk keluar dan menembus takdirNya, maka akan dikirimkan untuk kalian nyala api neraka yang tidak berasap dan cairan tembaga panas yang dapat membakar kulit dan perut mereka. Kalian tidak akan mampu mencegah azab Allah dan tidak akan ada yang bisa menolong kalian."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dikirimkan kepada kalian nyala api} nyala yang tidak mengandung asap {dan cairan tembaga} asap yang tidak ada nyala api di dalamnya {sehingga kalian tidak dapat menyelamatkan diri} sehingga kalian tidak bisa menghindari dari hal itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "35-36. “Kepada kamu, (jin dan manusia) dilepaskan nyala api,” yaitu jilatan api neraka “dan an-Nuhas,” yaitu nyala api yang telah bercampur dengan asap. Maknanya adalah, bahwa dua hal yang sangat mengerikan itu dilepaskan kepada kalian wahai segenap bangsa jin dan manusia sehingga keduanya meliputi kalian, maka kalian tidak akan dapat menyelamatkan diri. Kalian tidak dapat menyelamatkan diri dan tidak ada seorang pun yang dapat menyelamatkan diri kalian kecuali Allah. Dan tatkala peringatan yang menakutkan dari Allah bagi para hambaNya adalah merupakan bentuk kenikmatan dariNya atas mereka dan sebagai cambuk yang akan mengantarkan mereka kepada keinginan tertinggi dan cita-cita termulia, maka kemudian Allah menyebutkan karuniaNya akan hal itu seraya berfirman, “Maka nikmat Rabb kamu yang manakah yang kamu dustakan?”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rahman ayat 35: 35-36. Allah mengabarkan bahwa jika mereka mencoba lari, maka akan diutus kepada mereka api murni yang menyala dari neraka yang tanpa asap dan tembaga yang meleleh akan ditimpakan di atas kepala-kepala mereka, dan tidak akan ada yang menolong satu sama lain, dan juga tidak akan ada yang menghalangi satu sama lain dari adzab Allah. Kemudian arah pembicaraan Allah tertuju kepada jin dan manusia dengan pengulangan dan kepastian, Allah berkata : Maka nikmat yang mana wahai jin dan manusia yang kalian dustakan ? atau bahwasanya nikmat tersebut tidak dapat mereka ingkari. Dan secara dzahir, ini bukanlah nikmat, akan tetapi pengkabaran dengan yang telah disebutkan bahwa ketika di dunia diberikan banyak nikmat dengan kesempatan untuk bertaubat dan beramal shalih."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala menyebutkan apa yang disiapkan-Nya untuk mereka di tempat itu. Syaikh As Sa’diy menerangkan tentang syuwaazh, yaitu nyala api yang bersih, sedangkan nuhaas, yaitu nyala api yang bercampur asap. Maksudnya kedua ini adalah bahwa keduanya akan dikirimkan untuk mengepung jin dan manusia agar tidak melarikan diri. Mujahid berkata, “Tembaga adalah kuningan yang dilebur lalu dituangkan di atas kepala mereka.” Maksudnya, Kalau kamu (wahai jin dan manusia) pergi melarikan diri pada hari Kiamat, tentu para malaikat dan malaikat Zabaniyah akan mengembalikan kamu dengan mengirimkan nyala api dan tembaga yang dileburkan yang akan ditimpakan kepada kamu agar kamu kembali (ke padang mahsyar)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rahman Ayat 35",
    "description": "35-36. Wahai jin dan manusia, bila kamu berupaya menembus langit dan bumi, maka kepada kamu akan dikirim nyala api dan cairan tembaga panas yang meleleh sehingga kamu tidak dapat menyelamatkan diri dari-Nya. Maka, wahai manusia dan jin, nikmat tuhanmu yang manakah yang kamu dustakan'35-36"
  }
]