[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "35-36. Akan dikirimkan bongkahan api kepada kalian dan tembaga panas meleleh yang dituangkan di atas kepala kalian. Sebagian dari kalian (wahai jin dan manusia) tidak bisa menolong sebagian yang lain. Maka nikmat manakah dari nikmat-nikmat Tuhan kalian berdua (wahai jin dan manusia) yang kalian dustakan?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "36. Maka dengan nikmat Allah yang banyak untuk kalian -wahai jin dan manusia- yang mana yang kalian dustakan?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "36. Maka nikmat Tuhan mana yang kalian dustakan wahai jin dan manusia?!"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka,nikmat Tuhan kalian yang manakah yang kalian dustakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "35-36. “Kepada kamu, (jin dan manusia) dilepaskan nyala api,” yaitu jilatan api neraka “dan an-Nuhas,” yaitu nyala api yang telah bercampur dengan asap. Maknanya adalah, bahwa dua hal yang sangat mengerikan itu dilepaskan kepada kalian wahai segenap bangsa jin dan manusia sehingga keduanya meliputi kalian, maka kalian tidak akan dapat menyelamatkan diri. Kalian tidak dapat menyelamatkan diri dan tidak ada seorang pun yang dapat menyelamatkan diri kalian kecuali Allah. Dan tatkala peringatan yang menakutkan dari Allah bagi para hambaNya adalah merupakan bentuk kenikmatan dariNya atas mereka dan sebagai cambuk yang akan mengantarkan mereka kepada keinginan tertinggi dan cita-cita termulia, maka kemudian Allah menyebutkan karuniaNya akan hal itu seraya berfirman, “Maka nikmat Rabb kamu yang manakah yang kamu dustakan?”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rahman ayat 36: 35-36. Allah mengabarkan bahwa jika mereka mencoba lari, maka akan diutus kepada mereka api murni yang menyala dari neraka yang tanpa asap dan tembaga yang meleleh akan ditimpakan di atas kepala-kepala mereka, dan tidak akan ada yang menolong satu sama lain, dan juga tidak akan ada yang menghalangi satu sama lain dari adzab Allah. Kemudian arah pembicaraan Allah tertuju kepada jin dan manusia dengan pengulangan dan kepastian, Allah berkata : Maka nikmat yang mana wahai jin dan manusia yang kalian dustakan ? atau bahwasanya nikmat tersebut tidak dapat mereka ingkari. Dan secara dzahir, ini bukanlah nikmat, akan tetapi pengkabaran dengan yang telah disebutkan bahwa ketika di dunia diberikan banyak nikmat dengan kesempatan untuk bertaubat dan beramal shalih."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Oleh karena penakutan-Nya kepada hamba-hamba-Nya merupakan nikmat-Nya kepada mereka sekaligus sebagai cemeti untuk menggiring mereka ke tempat yang tinggi dan untuk memperoleh pemberian yang paling baik yang diberikan-Nya kepada mereka, maka Dia berfirman, “Maka nikmat Tuhanmu yang manakah yang kamu dustakan?”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rahman Ayat 36",
    "description": "35-36. Wahai jin dan manusia, bila kamu berupaya menembus langit dan bumi, maka kepada kamu akan dikirim nyala api dan cairan tembaga panas yang meleleh sehingga kamu tidak dapat menyelamatkan diri dari-Nya. Maka, wahai manusia dan jin, nikmat tuhanmu yang manakah yang kamu dustakan'37-38. Usai menjelaskan ketidakmampuan manusia menghindar dari pertanggung jawaban, Allah menguraikan keadaan pada hari kemudian. Maka apabila langit telah terbelah karena takut dengan balasan Allah dan menjadi merah mawar seperti kilauan minyak akibat panas yang menerpanya. Maka, wahai manusia dan jin, nikmat tuhanmu yang manakah yang kamu dustakan'."
  }
]