[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "37-38. Bila langit pecah dan terbelah di Hari Kiamat, ia memerah seperti warna bunga mawar, seperti minyak mendidih dan timah panas karena beratnya urusan dan kengerian Hari Kiamat. Maka nikmat manakah dari nikmat-nikmat Tuhan kalian berdua (wahai jin dan manusia) yang kalian dustakan?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "37. Maka jika langit telah terbelah karena turunnya malaikat darinya, dan menjadi merah seperti kilauan minyak warnanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "37-40. Dan jika langit telah terbelah pada hari kiamat maka akan berwarna merah seperti bunga mawar dan seperti tembaga yang meleleh. Maka kenikmatan mana yang Tuhan kalian berikan, yang kalian ingkari wahai jin dan manusia? Pada hari yang sulit itu, seluruh makhluk dibangkitkan, dan jin dan manusia tidak akan ditanya tentang dosanya, ‘Kamu orang yang berbuat dosa?’, karena tanda-tandanya telah terlihat dengan jelas di wajah mereka. Maka kenikmatan mana yang Tuhan kalian berikan, yang kalian ingkari wahai jin dan manusia?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "37. فَإِذَا انشَقَّتِ السَّمَآءُ (Maka apabila langit telah terbelah) Yakni terpecah akibat malaikat yang turun pada hari kiamat. فَكَانَتْ وَرْدَةً كَالدِّهَانِ (dan menjadi merah mawar seperti (kilapan) minyak) Yakni seperti mawar merah yang berubah menjadi seperti minyak karena meleleh. Pendapat lain mengatakan makna (الدهان) adalah kulit yang berwarna merah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "37. Saat langit terbelah pada hari kiamat, maka akan tampak seperti mawar merah dan minyak yang mendidih"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka apabila langit terbelah, lalu menjadi merah mawar} menjadi mereka seperti warna mawar {seperti (kilauan) minyak} seperti kilauan minyak"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "37-38. “Maka apabila langit telah terbelah” yaitu pada Hari Kiamat karena kengerian, kedahsyatan, dan ketakutan yang sangat, sehingga matahari dan bulan mengalami gerhana, dan bintang-bintang jatuh berserakan “sehingga menjadi” karena begitu dahsyat dan menakutkannya “merah mawar seperti (kilapan) minyak” seperti perak yang diluluhkan dan semisalnya, “maka nikmat Rabb kamu yang manakah yang kamu dustakan?”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rahman ayat 37: Pada hari ini adalah hari dimana keadaan alam berubah, langit terbelah, dan turunlah para malaikat dan berada di sisi para makhluk. Maka langit menjadi seperti mawar merah karena panasnya api neraka, itu adalah gambaran dari dahsyatnya pada hari itu. Kemudian Allah mengembalikan keadaan mereka yang abadi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Pada hari Kiamat karena dahsyatnya keadaan ketika itu, banyaknya kegelisahan, rasa takut tidak kunjung henti, matahari dan bulan diredupkan dan bintang-bintang berjatuhan maka langit menjadi merah mawar seperti (kilauan) minyak, yakni seperti cairan logam dan timah yang mencair. Menjadi pintu-pintu untuk turunnya malaikat. Jika demikian, maka sungguh dahsyat dan mengerikan kejadian ketika itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rahman Ayat 37",
    "description": "37-38. Usai menjelaskan ketidakmampuan manusia menghindar dari pertanggung jawaban, Allah menguraikan keadaan pada hari kemudian. Maka apabila langit telah terbelah karena takut dengan balasan Allah dan menjadi merah mawar seperti kilauan minyak akibat panas yang menerpanya. Maka, wahai manusia dan jin, nikmat tuhanmu yang manakah yang kamu dustakan'37-38"
  }
]