[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "39-40. Di hari itu para malaikat tidak bertanya kepada para pendosa dari kalangan jin manusia tentang dosa-dosa mereka. Maka nikmat manakah dari nikmat-nikmat Tuhan kalian berdua (wahai jin dan manusia) yang kalian dustakan?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "39. Dan di hari yang agung itu manusia dan jin tidak ditanya tentang dosa-dosa mereka, karena Allah telah mengetahui amal perbuatan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "39. Hari terbelahnya langit itu bertepatan dengan waktu kalian dikeluarkan dari kubur. Tidak ada satupun dari manusia dan jin yang ditanya dosanya. Setelah itu, hisab akan dilakukan di padang mahsyar."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka pada hari itu manusia dan jin tidak ditanya tentang dosanya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "39-40. “Pada waktu itu manusia dan jin tidak ditanya tentang dosanya,” maksudnya, pertanyaan untuk mengetahui apa yang telah terjadi, karena Allah Maha Mengetahui yang ghaib dan yang nampak, yang telah berlalu maupun yang akan datang. Dan Allah akan membalas (segala perbuatan) para hamba dengan apa yang Dia ketahui dari segala kondisi mereka. Dan pada Hari Kiamat telah dijadikan tanda-tanda yang dengannya dapat diketahui para pelaku kebaikan dan para pelaku kejahatan, sebagaimana Firman Allah dalam ayat lain, pada hari yang di waktu itu ada muka yang putih berseri, dan ada pula muka yang hitam muram. -Ali Imran: 106-"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rahman ayat 39: Allah menjelaskan bahwa pada hari itu sungguh mengerikan yang mereka para pendosa tidak ditanya sama sekali tentang dosa mereka dari jin dan manusia; Karena sebab mereka akan mengetahui diri mereka secara khusus, dan juga karena segala sesuatunya telah tetap di lembaran-lembaran amalan-amalan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Tetapi pada waktu yang lain. Atau maksudnya, bahwa pada hari itu manusia dan jin tidak dimintai informasi tentang apa yang terjadi karena Allah Subhaanahu wa Ta'aala mengetahui yang gaib dan yang tampak, yang lalu dan yang akan datang. Dia ingin memberikan balasan kepada hamba sesuai yang diketahui-Nya terhadap keadaan mereka, dan Dia telah mengadakan tanda pada hari Kiamat untuk orang-orang yang baik dan orang-orang yang buruk yang dengannya mereka dapat dikenali sebagaimana firman-Nya di ayat lain, “Pada hari yang di waktu itu ada muka yang putih berseri, dan ada pula muka yang hitam muram. (Terj. Ali Imran: 106)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rahman Ayat 39",
    "description": "39-40. Maka pada hari ketika langit terbelah itu manusia dan jin tidak ditanya tentang dosanya, melainkan ditanya untuk diminta pertanggung jawabannya. Maka, wahai manusia dan jin, nikmat tuhanmu yang manakah yang kamu dustakan'39-40"
  }
]