[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "3-4. Dia menciptakan manusia dan mengajarinya Penjelasan apa yang ada dalam jiwanya sebagai pembeda antara ia dengan makhluk lainnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Mengajarkan kepadanya bagaimana menyampaikan apa yang ada di hatinya dengan ucapan dan tulisan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. عَلَّمَهُ الْبَيَانَ (Mengajarnya pandai berbicara) Kemudian menyebutkan kenikmatan pengajaran berbicara yang menjadi azab pemahaman dan pembicaraan. Dan yang dimaksud dengan (البيان) adalah nama-nama segala sesuatu. Atau menurut pendapat lain adalah berbagai bahasa."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3-4. Dzat yang menciptakan manusia dan mengajarkannya untuk mengungkapkan (ekspresi) dirinya dan memahamkan orang lain dengan menyampaikan perkataan yang jelas."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia telah mengajarinya menjelaskan} berucap dan menulis"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3-4. “Dia menciptakan manusia” dalam bentuk yang sebaik-baiknya, dengan anggota badan yang terbaik dan bentuk tubuh yang sempurna. Allah benar-benar telah menciptakannya dengan sempurna, dan telah memberinya keistimewaan sehingga berbeda dengan binatang, di mana Dia “mengajarnya pandai berbicara,” untuk dapat menjelaskan apa yang ada di dalam hatinya. Hal ini mencakup pengajaran berbicara dan menulis. Oleh karena itu, kemampuan berbicara (menjelaskan) yang dengannya Allah mengistimewakan manusia daripada makhluk lainnya, adalah di antara nikmat yang paling agung dan paling besar."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rahman ayat 4: Allah menyebutkan bahwa Dialah yang mengajarkan manusia pandai berbicara yang dengannya sempurna pemahaman di antara makhluk atas segala urusan mereka, dan Allah mengawali penyebutan Al Qur’an di dalamnya karena ada petunjuk bahwa Allah memiliki cara sebelum menciptakan makhluk, dan Al Qur’an adalah sebesar-besar nikmat yang layak untuk disyukuri dan ditaati."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Al Bayaan artinya menerangkan, sehingga termasuk pula menerangkan dengan lisan maupun tulisan. Al Bayaan yang Allah lebihkan manusia dengannya termasuk nikmat yang besar yang diberikan kepadanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rahman Ayat 4",
    "description": "3-4. Dia juga yang menciptakan manusia, makhluk yang paling memerlukan tuntunan-Nya, dan kemudian mengajarnya pandai berbicara untuk mengungkapkan ide dalam benaknya. 5-6. Di antara tanda kekuasaan-Nya adalah bahwa matahari dan bulan beredar pada porosnya menurut perhitungan yang sangat teliti dan tepat tanpa cacat; dan tetumbuhan tak berbatang dan pepohonan berbatang pun keduanya tunduk kepada ketentuan-Nya."
  }
]