[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "42. Maka nikmat manakah dari nikmat-nikmat Tuhan kalian berdua (wahai jin dan manusia) yang kalian dustakan?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "42. Maka dengan nikmat Allah yang banyak untuk kalian -wahai jin dan manusia- yang mana yang kalian dustakan?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "42. Maka nikmat Tuhan mana yang kalian dustakan wahai jin dan manusia?!"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka nikmat Tuhan kalian yang manakah yang kalian dustakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "41-42. Di sini kemudian Allah berfirman, “Orang-orang yang berdosa dikenal dengan tanda-tandanya, lalu dipegang ubun-ubun dan kaki mereka. Maka nikmat Rabb kamu yang manakah yang kamu dustakan?” maksudnya, ubun-ubun dan kaki mereka dipegang untuk kemudian mereka diseret dan dilemparkan ke dalam api neraka. Pertanyaan Allah dalam ayat ini hanyalah sebagai celaan dan pembuktian akan apa yang telah mereka lakukan. Pada hakikatnya Dia lebih mengetahui daripada mereka, hanya saja Allah menghendaki agar keagungan hujjah dan hikmahNya tampak disaksikan oleh seluruh makhlukNYa."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rahman ayat 42: Kemudian Allah menujukan perkataan-Nya kepada jin dan manusia dengan penegasan dan pengulangan, Allah berkata : Maka nikmat Tuhan kalian yang mana yang kalian dustakan ? yaitu mereka tidak dapat mengingkari nikmat yang telah diberikan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rahman Ayat 42",
    "description": "41-42. Orang-orang yang berdosa itu diketahui dengan tanda-tandanya, lalu dengan mudah mereka direnggut ubun-ubun dan kakinya untuk dilempar ke neraka. Ini merupakan peringatan keras Allah kepada para jin dan manusia. Maka, wahai manusia dan jin, nikmat tuhanmu yang manakah yang kamu dustakan'43-45. Kepada mereka dikatakan, 'inilah neraka jahanam yang selalu di dustakan oleh orang-orang yang berdosa, termasuk olehmu. ' mereka ber-keliling berulang kali di sana, di antara neraka itu, dan di antara air yang mendidih karena panas api neraka. Maka, wahai manusia dan jin, nikmat tuhanmu yang manakah yang kamu dustakan'."
  }
]