[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "43-44. Dikatakan kepada orang-orang yang berbuat dosa tersebut sebagai celaan dan hinaan, “Inilah Neraka Jahanam yang dulu didustakan oleh orang-orang yang berbuat dosa di dunia. Terkadang mereka disiksa di api yang menyala, dan terkadang diberi minum air mendidih, yaitu minuman yang sangat panas, yang menghancurkan perut dan usus."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "43. Dan dikatakan kepada mereka sebagai bentuk hinaan, “Inilah neraka Jahanam yang didustakan oleh orang-orang yang berdosa di dunia ada di depan mata mereka, tidak bisa mereka ingkari.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "43. هٰذِهِۦ جَهَنَّمُ الَّتِى يُكَذِّبُ بِهَا الْمُجْرِمُونَ (Inilah neraka Jahannam yang didustakan oleh orang-orang berdosa) Yakni akan dikatakan kepada mereka ketika itu: “yang kalian saksikan ini adalah jahannam yang dulu kalian dustakan.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "43. Dikatakan kepada mereka: “Yang kalian saksikan ini adalah neraka Jahanam, yaitu neraka yang didustakan oleh orang-orang kafir dan orang-orang yang mengingkari hari kebangkitan”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Inilah neraka Jahanam yang didustakan oleh para pendosa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "43-45. Maksudnya, dikatakan kepada orang-orang yang mendustakan janji dan ancaman Allah ketika neraka dinyalakan, “Inilah Neraka Jahanam yang didustakan oleh orang-orang berdosa,” kehinaanlah yang mereka rasakan akibat pendustaan tersebut, dan biarlah mereka merasakan azab, kengerian, nyala api, dan belenggu Neraka Jahanam yang merupakan balasan atas pengingkaran mereka. Mereka berkeliling di antara jilatan api neraka, “dan di antara air yang mendidih yang memuncak panasnya,” yaitu air sangat dingin yang tellah sampai pada puncak kedinginannya. “Maka nikmat Rabb kamu yang manakah yang kamu dustakan?” Dan setelah Allah menyebutkan apa-apa yang ditimpakan terhadap orang-orang yang berdosa, maka Dia kemudian menyebutkan balasan bagi orang-orang yang bertakwa lagi takut kepadaNya, maka FirmanNya,"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rahman ayat 43: 43-45. Kemudian dikatakan kepada mereka para pendosa dengan merendahkan : Inilah neraka yang kalian telah dustakan. Maka inilah sekarang kalian melihat dengan mata telanjang kalian dan mengelilingi mereka air yang mendidih di antara mereka dan memuncak panasnya, maka kalian akan dibakar dengan api dan meminum dari air ini. Kemudian Allah menujukkan perkataan-Nya kepada jin dan manusia dengan pengulangan dan penegasan, Allah berkata : Maka nikmat Tuhan kalian yang mana yang kalian dustakan ?"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rahman Ayat 43",
    "description": "43-45. Kepada mereka dikatakan, 'inilah neraka jahanam yang selalu di dustakan oleh orang-orang yang berdosa, termasuk olehmu. ' mereka ber-keliling berulang kali di sana, di antara neraka itu, dan di antara air yang mendidih karena panas api neraka. Maka, wahai manusia dan jin, nikmat tuhanmu yang manakah yang kamu dustakan'43-45"
  }
]