[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "46. Hamba-hamba Allah yang bertakwa dari kalangan jin dan manusia, yang takut kepada saat menghadap kepadaNya, lalu menaati perintahNya dan meninggalkan laranganNya, akan mendapatkan dua surga."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "46. Dan bagi orang yang takut beridiri di hadapan Rabbnya di Akhirat sehingga ia beriman dan melakukan amal saleh ada dua Surga."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "46-53. Dan hamba yang takut terhadap kedudukan Tuhannya, sehingga dia mentaati perintah-Nya dan tidak melakukan kemaksiatan, akan mendapatkan dua surga yang luas. Maka kenikmatan mana yang Tuhan kalian berikan, yang kalian ingkari wahai jin dan manusia? Dua surga ini pepohonannya memiliki tangkai-tangkai yang berbuah lezat. Maka kenikmatan mana yang Tuhan kalian berikan, yang kalian ingkari wahai jin dan manusia? Di dalam dua surga ini terdapat dua mata air yang mengalir, Maka kenikmatan mana yang Tuhan kalian berikan, yang kalian ingkari wahai jin dan manusia? Dan setiap buah-buahan yang ada di dalam dua surga ini memiliki dua jenis. Maka kenikmatan mana yang Tuhan kalian berikan, yang kalian ingkari wahai jin dan manusia? Abdullah bin Qais meriwayatkan bahwa Rasulullah bersabda: “Dua surga yang wadah-wadah dan segala yang ada di dalamnya terbuat dari perak; dan dua surga yang wadah-wadah dan segala yang ada di dalamnya terbuat dari emas. Dan yang menghalangi para penghuni surga ‘Adn dari melihat Tuhan mereka adalah selendang kebesaran yang ada di wajah-Nya.” (Shahih al-Bukhari 8/491, kitab tafsir, bab [ومن دونهما جنتان] no. 3878. Dan shahih Muslim, kitab iman, bab penegasan tentang perkara orang-orang beriman yang dapat menatap Tuhan mereka di akhirat, no. 180)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "44. يَطُوفُونَ بَيْنَهَا (Mereka berkeliling di antaranya) Yakni di antara Jahannam, sehingga mereka terbakar. وَبَيْنَ حَمِيمٍ ءَانٍ(dan di antara air mendidih yang memuncak panasnya) Maka air itu dituangkan ke wajah mereka. Makna (الحميم) adalah air yang panas. Dan (الآني) adalah air yang dipuncak titik didihnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "46. Bagi orang yang takut terhadap hisab Tuhannya di tempat penghisaban itu dengan menaati perintah-perintahNya dan menjauhi kemaksiatan, maka ada dua surga yang disediakan Allah SWT."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bagi siapa saja yang takut pada keagungan Tuhannya} takut di hadapan Tuhannya untuk dihisab, sehingga dia melaksanakan kewajiban-kewajiban dari Allah dan menjauhi hal-hal yang diharamkanNya {disediakan dua surga"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "46-47. Maksudnya, orang yang takut kepada Rabbnya dan takut saat akan menghadap kepadaNya, sehingga dengan itu dia meninggalkan apa yang dilarang Allah dan menunaikan apa yang diperintahkanNya, maka baginya “ada dua surga” yang terbuat dari emas, berupa bejana-bejana, perhiasan dan bangunan maupun segala sesuatu yang ada di dalam keduanya. Salah satu surga adalah sebagai balasan meninggalkan larangan-larangan, sedangkan surga yang lain adalah sebagai balasan melakukan ketaatan-ketaatan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rahman ayat 46: Allah menyebutkan nikmat di akhirat bagi orang-orang yang beriman, Allah mengabarkan bahwa mereka adalah orang yang takut kepada Allah, dan takut akan hari perhitungan, yang Allah akan menghisab mereka; Maka mereka adalah orang-orang yang memiliki dua surga."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni berdiri di hadapan-Nya untuk dihisab. Yakni bagi orang yang takut kepada Tuhannya dan takut berhadapan dengan-Nya, dimana hal itu membuatnya mengerjakan perintah dan menjauhi larangan, maka dia memperoleh dua surga. Menurut Syaikh As Sa’diy, dia akan mendapatkan dua surga dari emas, baik bejana, perhiasan, bangunan dan apa yang ada di sana (dari emas); surga yang satu sebagai balasan karena meninggalkan larangan, sedangkan surga yang satu lagi karena mengerjakan ketaatan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rahman Ayat 46",
    "description": "46-47. Selain menyediakan siksa bagi pendurhaka, Allah juga menjanjikan pahala bagi orang yang bertakwa. Dan bagi siapa yang takut akan keagungan dan kekuasaan-Nya pada saat menghadap tuhannya sehingga ia terdorong untuk beramal saleh, baginya ada dua surga. Maka, wahai manusia dan jin, nikmat tuhanmu yang manakah yang kamu dustakan'46-47"
  }
]