[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "47. Maka nikmat manakah dari nikmat-nikmat Tuhan kalian berdua (wahai jin dan manusia) yang kalian dustakan?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "47. Maka dengan nikmat Allah yang banyak untuk kalian -wahai jin dan manusia- yang mana yang kalian dustakan?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "47. Maka nikmat Tuhan mana yang kalian dustakan wahai jin dan manusia?!"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka nikmat Tuhan kalian yang manakah yang kalian dustakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "46-47. Maksudnya, orang yang takut kepada Rabbnya dan takut saat akan menghadap kepadaNya, sehingga dengan itu dia meninggalkan apa yang dilarang Allah dan menunaikan apa yang diperintahkanNya, maka baginya “ada dua surga” yang terbuat dari emas, berupa bejana-bejana, perhiasan dan bangunan maupun segala sesuatu yang ada di dalam keduanya. Salah satu surga adalah sebagai balasan meninggalkan larangan-larangan, sedangkan surga yang lain adalah sebagai balasan melakukan ketaatan-ketaatan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rahman ayat 47: Telah berlalu tafsirnya pada ayat 13 dalam surat ini."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rahman Ayat 47",
    "description": "46-47. Selain menyediakan siksa bagi pendurhaka, Allah juga menjanjikan pahala bagi orang yang bertakwa. Dan bagi siapa yang takut akan keagungan dan kekuasaan-Nya pada saat menghadap tuhannya sehingga ia terdorong untuk beramal saleh, baginya ada dua surga. Maka, wahai manusia dan jin, nikmat tuhanmu yang manakah yang kamu dustakan'48-49. Kedua surga yang Allah janjikan kepada orang yang bertakwa itu mempunyai aneka pepohonan yang rindang dan buah-buahan yang beraneka ragam dan menyenangkan. Maka, wahai manusia dan jin, nikmat tuhanmu yang manakah yang kamu dustakan'."
  }
]