[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": ". Matahari dan rembulan berjalan bergantian dengan perhitungan yang akurat, tidak berubah dan tidak goncang."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Matahari dan bulan, keduanya Kami takdirkan berputar dengan hitungan yang teliti agar manusia mengerti bilangan tahun dan perhitungan waktu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "5. Matahari dan bulan bergerak pada porosnya masing-masing dengan teratur."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. الشَّمْسُ وَالْقَمَرُ بِحُسْبَانٍ (Matahari dan bulan (beredar) menurut perhitungan) Yakni bergerak dengan perhitungan dan tidak akan keluar dari garis edarnya, dan itu menjadi petunjuk untuk perhitungan hari, bulan, dan tahun."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Matahari dan Bulan beredar dengan perhitungan rinci yang teratur, sehingga keduanya menunjukkan perhitungan bulan dan tahun"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Matahari dan bulan (beredar) sesuai dengan perhitungan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5. “Matahari dan bulan (beredar) menurut perhitungannya,” yakni Allah menciptakan matahari dan bulan serta menundukkan keduanya untuk beredar sesuai dengan perhitungan yang cermat dan terencana sebagai bentuk rahmat dan perhatian Allah kepada para hamba, sebagai kemaslahatan bagi mereka, dan agar mereka mengetahui bilangan tahun dan perhitungan (waktu)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rahman ayat 5: Allah menyebutkan nikmat yang lain yang Dia telah berikan kepada makhluk-Nya, yang bahwasanya Dia menciptakan matahari dan bulan, yang keduanya mendatangkan manfaat dan berotasi menurut perederannya menurut ketetapan yang tidaka akan saling berselisih dan bertabrakan, juga tidak melampaui batasan masing-masing sesuai ketetapan. Di antara faidah-faidah diciptakan keduanya yaitu keduanya sebagai pengganti atas bulan, tahun, musim dan waktu-waktu untuk menanam dan bercocok tanam serta memetik buah-buahan dan juga sebagai waktu-waktu untuk ibadah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala menciptakan matahari dan bulan dan menundukkannya untuk beredar menurut perhitungan sebagai rahmat kepada hamba-hamba-Nya dan perhatian-Nya kepada mereka dan agar maslahat mereka dapat tegak dengannya, demikian juga agar mereka dapat mengetahui perhitungan tahun."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rahman Ayat 5",
    "description": "5-6. Di antara tanda kekuasaan-Nya adalah bahwa matahari dan bulan beredar pada porosnya menurut perhitungan yang sangat teliti dan tepat tanpa cacat; dan tetumbuhan tak berbatang dan pepohonan berbatang pun keduanya tunduk kepada ketentuan-Nya"
  }
]