[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "51. Maka nikmat manakah dari nikmat-nikmat Tuhan kalian berdua (wahai jin dan manusia) yang kalian dustakan?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "51. Maka dengan nikmat Allah yang banyak untuk kalian -wahai jin dan manusia- yang mana yang kalian dustakan?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "50-51. Di dalamnya ada dua mata air yang mengalir sesuai kehendak mereka. Maka nikmat Tuhan mana yang kalian dustakan?!"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka nikmat Tuhan kalian yang manakah yang kalian dustakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "50-51. Di dalam dua surga tersebut “ada dua buah mata air yang mengalir “ di mana mereka (para penghuni surga) dapat mengalirkannya sesuai dengan kemauan dan keinginan mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rahman ayat 51: Telah berlalu tafsirnya pada ayat 13 dalam surat ini."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rahman Ayat 51",
    "description": "50-51. Tidak hanya pepohonan dengan buahnya yang beraneka ragam, di dalam kedua surga itu ada pula dua buah mata air yang memancar, mengeluarkan air yang jernih. Maka, wahai manusia dan jin, nikmat tuhanmu yang manakah yang kamu dustakan'52-53. Selain itu, di dalam kedua surga itu terdapat aneka buah-buahan yang berpasang-pasangan. Maka, wahai manusia dan jin, nikmat tuhanmu yang manakah yang kamu dustakan'."
  }
]