[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "54. Orang-orang yang takut kepada perjumpaan dengan Tuhan mereka akan mendapatkan dua surga, mereka mendapatkan kenikmatan pada keduanya, mereka bersandar di atas permadani yang bagian dalamnya dari sutra tebal, dan buah dua surga tersebut dekat kepada mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "54. Mereka bertelekan di atas permadani-permadani yang bagian dalamnya terbuat dari sutera yang tebal, dan buah-buahan yang dipetik dari kedua surga itu letaknya dekat, bisa diambil oleh orang yang berdiri, duduk maupun tiduran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "54-59. Para penghuni surga itu bersandar di atas dipan-dipan yang terisi dengan sutera yang tebal. Buah-buahan yang ada dalam dua surga itu mudah dipetik. Maka kenikmatan mana yang Tuhan kalian berikan, yang kalian ingkari wahai jin dan manusia? Dalam surga-surga ini terdapat bidadari-bidadari yang hanya memandang pasangan mereka; mereka semua masih perawan, tidak pernah didatangi manusia dan jin sebelumnya. Maka kenikmatan mana yang Tuhan kalian berikan, yang kalian ingkari wahai jin dan manusia? Bidadari-bidadari itu kecantikannya seperti permata dan marjan. Maka kenikmatan mana yang Tuhan kalian berikan, yang kalian ingkari wahai jin dan manusia?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "54. مُتَّكِـِٔينَ عَلَىٰ فُرُشٍۭ بَطَآئِنُهَا مِنْ إِسْتَبْرَقٍ ۚ (Mereka bertelekan di atas permadani yang sebelah dalamnya dari sutera) Yakni mereka mendapat berbagai kenikmatan sambil bersandar di atas permadani. Makna (البطائن) adalah bagian bawahnya. Sedangkan (الإستبرق) adalah sutera yang tebal. Dan jika bagian bawah permadani itu berasal dari sutera tebal, maka bagaimana dengan bagian atasnya? وَجَنَى الْجَنَّتَيْنِ دَانٍ (Dan buah-buahan di kedua surga itu dapat (dipetik) dari dekat) Makna (الجني) adalah buah yang dipetik. Dikatakan bahwa pohon surga akan berkeliling agar buahnya dapat dipetik oleh orang yang menginginkannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "54-55. Mereka duduk bersandar di atas permadani yang terbuat dari sutera tebal. Buah-buahan dari surga itu sangat dekat untuk dipetik. Maka nikmat Tuhan mana yang kalian dustakan?!"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka bersandar di atas permadani yang bagian dalamnya} bagian dalamnya {dari sutera tebal} sutera tebal {Buah-buahan} Buah-buahan {di kedua surga itu dipetik dari dekat} dekat sehingga bisa dipetik oleh orang yang berdiri"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "54-55. “Mereka bertelekan di atas permadani yang sebelah dalamnya dari sutra.” Ini adalah ciri-ciri permadani penghuni surga dan bagaimana mereka duduk di atasnya, yaitu mereka bertelekan di atas permadani tersebut, duduk nyaman, tenang dan menyenangkan, sebagaimana duduknya raja di atas singgasana. Permadani-permadani itu tidak ada yang mengetahui gambaran ciri khas dan keindahannya kecuali Allah, sampai sebelah dalamnya yang langsung bersentuhan dengan tanah terbuat dari kain sutra yang paling bagus dan paling mewah, maka bagaimana halnya dengan bagian atasnya yang langsung bersentuhan dengan mereka? “dan buah-buahan surga itu dapat (dipetik) dari dekat.” ‘aljanaa’ adalah buah-buahan yang datar, yakni, buah-buahan yang ada di dua surga ini dekat (mudah) untuk dipetik, di mana dapat diambil oleh orang yang (dalam keadaan) berdiri, duduk maupun berbaring."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rahman ayat 54: Dan di antara nikmat yang diberikan oleh Allah kepada penghuni surga, mereka dapat duduk bersandar dengan sebaik-baik posisi duduk, bertelekan alas yang mewah, dengan selimut dari kain sutra yang tebal, maka bagaimana dengan kelembutannya ? Dengan penegasan bahwa itu adalah selimut yang lembut, begitu juga dengan buah-buah surga yang memetiknya dekat dari penghuni surga, mereka memakan kapanpun mereka kehendaki, dan bagaimanapun yang mereka inginkan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Syaikh As Sa’diy menerangkan, ini adalah sifat permadani penghuni surga dan sifat duduknya mereka di atasnya, dan bahwa mereka sambil bersandar sambil santai. Permadani ini tidak diketahui sifatnya kecuali oleh Allah Subhaanahu wa Ta'aala, sampai-sampai bagian dalamnya dari sutera tebal yang merupakan sutera terbaik dan dibanggakan, lalu bagaimana dengan luarnya yang bersentuhan langsung dengan kulit mereka? Ibnu Mas’ud berkata, “Ini bagian dalamnya, lalu bagaimana kalau kamu melihat bagian luarnya?” Yakni bisa dipetik sambil berdiri, sambil duduk dan sambil berbaring."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rahman Ayat 54",
    "description": "54-55. Para penghuni surga itu sangat menikmati anugerah Allah. Mereka bersandar dengan santai di atas permadani yang bagian dalamnya terbuat dari sutera tebal. Dan buah-buahan di kedua surga itu sangat dekat sehingga dapat dipetik dari dekat, tanpa perlu beranjak dari tempat mereka bersandar. Maka, wahai manusia dan jin, nikmat tuhanmu yang manakah yang kamu dustakan'54-55"
  }
]