[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "56. Di atas hamparan permadani itu ada istri-istri yang pandangan mata mereka hanya terbatas pada suami-suami mereka. Mereka tidak melihat kepada selain suami-suami mereka, hanya bergantung kepada mereka. Para istri itu tidak pernah disentuh oleh manusia dan tidak juga oleh jin."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "56. Di dalamnya ada bidadari-bidadari yang hanya memandang kepada suami-suami mereka saja, keperawanan mereka belum terambil oleh manusia dan jin sebelum suami-suami mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "54. مُتَّكِـِٔينَ عَلَىٰ فُرُشٍۭ بَطَآئِنُهَا مِنْ إِسْتَبْرَقٍ ۚ (Mereka bertelekan di atas permadani yang sebelah dalamnya dari sutera) Yakni mereka mendapat berbagai kenikmatan sambil bersandar di atas permadani. Makna (البطائن) adalah bagian bawahnya. Sedangkan (الإستبرق) adalah sutera yang tebal. Dan jika bagian bawah permadani itu berasal dari sutera tebal, maka bagaimana dengan bagian atasnya? وَجَنَى الْجَنَّتَيْنِ دَانٍ (Dan buah-buahan di kedua surga itu dapat (dipetik) dari dekat) Makna (الجني) adalah buah yang dipetik. Dikatakan bahwa pohon surga akan berkeliling agar buahnya dapat dipetik oleh orang yang menginginkannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "56-57. Di dalam kedua surga yang telah disebutkan kenikmatan dan permadaninya itu ada wanita-wanita yang menundukkan pandangannya kepada suami-suaminya yang duduk di atas permadani. Belum ada satupun manusia atau jin yang pernah menyentuhnya. Maka nikmat Tuhan mana yang kalian dustakan?!"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Di dalamnya ada (bidadari) yang membatasi pandangan} perempuan-perempuan yang membatasi pandangan mereka hanya untuk pasangan mereka {yang tidak pernah disentuh} yang keperawanan mereka belum diambil {oleh manusia sebelum mereka dan tidak pula oleh jin"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "56-59. “Di dalam surga itu ada bidadari-bidadari yang sopan menundukkan pandangannya,” maksudnya, mereka hanya memandang suami-suami mereka karena ketampanan dan keindahan wajah (para suami) serta kesempurnaan cinta mereka terhadap para suami mereka. Dan mereka juga menjadikan para suami menundukkan pandangan, sehingga hanya memandang mereka karena kecantikan dan keindahan wajah mereka dan kesenangan untuk selalu berhubungan dengan mereka serta kecintaan yang begitu mendalam kepada mereka. “Tidak pernah disentuh oleh manusia sebelum mereka (penghuni-penghuni surga yang menjadi suami mereka) dan tidak pula oleh jin” maksudnya, mereka tidak pernah dijamah oleh seorang pun sebelum para penghuni surga yang menjadi suami mereka, baik dari manusia maupun jin, bahkan mereka adalah para perawan yang ramah dan penuh kasih kepada suami-suami mereka, dengan bersikap baik dalam bergaul, riang, manis dan manja, oleh karena itu Allah berfirman, “Seakan-akan bidari-bidadari itu permata yakut dan marjan.” Yang demikian itu karena kejernihan mereka dan keindahan serta kecantikan wajah dan penampilan mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rahman ayat 56: Allah menyebutkan di dalam dua surga ini terdapat wanita-wanita yang tunduk kepada selain dari suami-suami mereka dan penghuni surga tersebut tidak pernah melihat wanita sesempurna wanita-wanita di surga. Wanita-wanita tersebut masih perawan yang tidak pernah digauli oleh seorangpun sebelum mereka (penghuni-penghuni surga. Tidak dari jin dan tidak pula dari manusia. Pada ayat ini disebutkan tentang darah yang ia adalah darah yang keluar ketika keperawanannya hilang, dikatakan : Seorang laki-laki menjadikan istrinya keluar darah, ketika telah dijima’ olehnya. Dan asal dari darah ini adalah ketika wanita muda berjima’ setelah menikah pada awal pertama kali."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kepada suami mereka karena cakep dan gantengnya suami mereka, dan cintanya mereka kepadanya. Mereka masih sebagai gadis."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rahman Ayat 56",
    "description": "56-57. Tidak saja buah-buahan, di dalam surga itu ada bidadari-bidadari yang menjadi pasangan para pria penghuni surga, dan bagi wanita ada pula pasangannya, yang amat santun sehingga membatasi pandangan dan tidak menoleh kecuali kepada pasangannya. Mereka itu perawan yang tidak pernah disentuh oleh manusia maupun jin sebelumnya. Maka, wahai manusia dan jin, nikmat tuhanmu yang manakah yang kamu dustakan'56-57"
  }
]