[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "57. Maka nikmat manakah dari nikmat-nikmat Tuhan kalian berdua (wahai jin dan manusia) yang kalian dustakan?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "57. Maka dengan nikmat Allah yang banyak untuk kalian -wahai jin dan manusia- yang mana yang kalian dustakan?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "56-57. Di dalam kedua surga yang telah disebutkan kenikmatan dan permadaninya itu ada wanita-wanita yang menundukkan pandangannya kepada suami-suaminya yang duduk di atas permadani. Belum ada satupun manusia atau jin yang pernah menyentuhnya. Maka nikmat Tuhan mana yang kalian dustakan?!"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka nikmat Tuhan kalian yang manakah yang kalian dustakan"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rahman ayat 57: Telah berlalu tafsirnya pada ayat 13 dalam surat ini."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rahman Ayat 57",
    "description": "56-57. Tidak saja buah-buahan, di dalam surga itu ada bidadari-bidadari yang menjadi pasangan para pria penghuni surga, dan bagi wanita ada pula pasangannya, yang amat santun sehingga membatasi pandangan dan tidak menoleh kecuali kepada pasangannya. Mereka itu perawan yang tidak pernah disentuh oleh manusia maupun jin sebelumnya. Maka, wahai manusia dan jin, nikmat tuhanmu yang manakah yang kamu dustakan'58-59. Para bidadari itu demikian cantik dan sedap dipandang seakan-akan mereka itu permata yakut dan marjan. Maka, wahai manusia dan jin, nikmat tuhanmu yang manakah yang kamu dustakan'."
  }
]