[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "59. Maka nikmat manakah dari nikmat-nikmat Tuhan kalian berdua (wahai jin dan manusia) yang kalian dustakan?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "59. Maka dengan nikmat Allah yang banyak untuk kalian -wahai jin dan manusia- yang mana yang kalian dustakan?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "58-59. Seakan-akan wanita-wanita itu memiliki kulit putih bersih kemerah-merahan seperti yaqut, yaitu batu permata yang sangat halus dan bersih. Mereka juga layaknya marjan, yaitu batu permata merah yang diambil dari lautan. Maka nikmat Tuhan mana yang kalian dustakan?!"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka nikmat Tuhan kalian yang manakah yang kalian dustakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "56-59. “Di dalam surga itu ada bidadari-bidadari yang sopan menundukkan pandangannya,” maksudnya, mereka hanya memandang suami-suami mereka karena ketampanan dan keindahan wajah (para suami) serta kesempurnaan cinta mereka terhadap para suami mereka. Dan mereka juga menjadikan para suami menundukkan pandangan, sehingga hanya memandang mereka karena kecantikan dan keindahan wajah mereka dan kesenangan untuk selalu berhubungan dengan mereka serta kecintaan yang begitu mendalam kepada mereka. “Tidak pernah disentuh oleh manusia sebelum mereka (penghuni-penghuni surga yang menjadi suami mereka) dan tidak pula oleh jin” maksudnya, mereka tidak pernah dijamah oleh seorang pun sebelum para penghuni surga yang menjadi suami mereka, baik dari manusia maupun jin, bahkan mereka adalah para perawan yang ramah dan penuh kasih kepada suami-suami mereka, dengan bersikap baik dalam bergaul, riang, manis dan manja, oleh karena itu Allah berfirman, “Seakan-akan bidari-bidadari itu permata yakut dan marjan.” Yang demikian itu karena kejernihan mereka dan keindahan serta kecantikan wajah dan penampilan mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rahman ayat 59: Telah berlalu tafsirnya pada ayat 13 dalam surat ini."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rahman Ayat 59",
    "description": "58-59. Para bidadari itu demikian cantik dan sedap dipandang seakan-akan mereka itu permata yakut dan marjan. Maka, wahai manusia dan jin, nikmat tuhanmu yang manakah yang kamu dustakan'60-61. Tidak ada balasan untuk amal kebaikan selain anugerah ilahi yang berupa kebaikan pula. Maka, wahai manusia dan jin, nikmat tuhanmu yang manakah yang kamu dustakan'."
  }
]