[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bintang-bintang di langit atau tumbuhan yang tumbuh dan muncul dari bumi yang tidak memiliki batang dan pohon bumi yang memiliki batang mengetahui Tuhannya dan sujud kepadaNya, tunduk kepada tujuan ia ditundukkan, yaitu kemaslahatan dan manfaat bagi hamba-hambaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Tumbuh-tumbuhan yang tidak mempunyai batang dan pepohonan keduanya bersujud kepada Allah -Subḥānahu-, tunduk dan pasrah kepada-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "6. Bintang-bintang di langit dan pepohonan di bumi, seluruhnya bersujud kepada Allah dan tunduk kepada-Nya yang telah menciptakan mereka untuk kemaslahatan hamba-hamba-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. وَالنَّجْمُ وَالشَّجَرُ يَسْجُدَانِ (Dan tumbuh-tumbuhan dan pohon-pohonan kedua-duanya tunduk kepada-Nya) Makna (النجم) adalah tumbuhan yang tidak berbatang kayu. Sedangkan (الشجر) adalah tumbuhan yang berbatang kayu. Dan yang dimaksud dengan sujud keduanya adalah ketundukannya kepada Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. An-najm, yaitu tumbuh-tumbhan yang tidak memiliki tangkai, dan pohon-pohonan, yaitu tumbuhan yang memiliki batang dan ranting. An-Najm juga disebut sebagai bintang yang terlihat di langit. Keduanya (tumbuhan dan pepohonan) tunduk kepada Allah sesuai peintahNya dan kepada apa yang dikehendakiNya untuk keduanya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Beredar sesuai perhitungan yang sempurna {Tumbuhan} tumbuhan yang tidak memiliki batang {dan pepohonan tunduk"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6. “Dan bintang-bintang dan pohon-pohonan kedua-duanya tunduk kepadaNya,” yakni bintang-bintang di langit adan pohon-pohon di bumi, semuanya mengetahui Rabb mereka, sujud kepadaNya, taat, tunduk dan patuh (dengan melaksanakan) tujuan ia diciptakan dan ditundukkan sebagai kemaslahatan bagi para hamba."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rahman ayat 6: Di antara nikmat juga bagi hamba adalah bintang yang Allah ciptaka sebagai penghias langit dan sebagai panah-panah bagi setan, dan juga sebagai petunjuk di kegelapan malam baik di daratan maupun di lautan. Di antara nikmat dari pepohonan yang tumbuh di bumi dan yang Allah tetapkan keseluruhannya tidaklah Allah tetapkan kecuali diberikan beban yang sesuai, semisal dengan para makhluk yang sujud kepada Allah dengan sujud yang hakiki yang tidaklah mengetahui sujudnya kecuali hanya Allah, semisal juga bertasbihnya seluruh makhluk. Allah berfirman : أَلَمْ تَرَ أَنَّ ٱللَّهَ يَسْجُدُ لَهُۥ مَن فِى ٱلسَّمَـٰوَ‌ٰتِ وَمَن فِى ٱلْأَرْضِ, yang artinya : Apakah kamu tiada mengetahui, bahwa kepada Allah bersujud apa yang ada di langit, di bumi. {Al Haaj : 18}."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ada yang menafsirkan ‘najm’ dengan tumbuhan yang tidak berbatang, sedangkan ‘syajar’ dengan tumbuhan yang memiliki batang. Ada pula yang menafsirkan najm di sini dengan bintang, yakni bintang yang ada di langit dan pepohonan yang ada di bumi mengenal Tuhannya, sujud, taat dan tunduk kepada-Nya. Dia menundukkannya untuk maslahat dan manfaat hamba-hamba-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rahman Ayat 6",
    "description": "5-6. Di antara tanda kekuasaan-Nya adalah bahwa matahari dan bulan beredar pada porosnya menurut perhitungan yang sangat teliti dan tepat tanpa cacat; dan tetumbuhan tak berbatang dan pepohonan berbatang pun keduanya tunduk kepada ketentuan-Nya. 7-9. Dan dia telah menciptakan langit. Langit itu telah ditinggikan-Nya setelah sebelumnya menyatu dengan bumi dalam bentuk gumpalan, dan dia ciptakan keseimbangan dengan mantap agar kamu jangan merusak keseimbangan itu dengan berbuat melampaui batas, dan karenanya tegakkanlah keseimbangan itu dalam segala bentuknya, termasuk kepada dirimu atau keluargamu, dengan adil sehingga menguntungkan semua pihak, dan janganlah kamu mengurangi keseimbangan itu dengan cara dan bentuk apa pun."
  }
]