[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "60-61. Bukankah balasan bagi orang yang berbuat kebaikan di dunia adalah kebaikan di surga di akhirat? Maka nikmat manakah dari nikmat-nikmat Tuhan kalian berdua (wahai jin dan manusia) yang kalian dustakan?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "60. Tidak ada pahala bagi orang yang berbuat baik dengan menaati Rabbnya kecuali Allah membalasnya dengan pahala yang baik."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "60-61. Bukankah balasan bagi orang yang baik perkataan dan perbuatannya di dunia tidak lain adalah kebaikan baginya berupa surga di akhirat? Maka kenikmatan mana yang Tuhan kalian berikan, yang kalian ingkari wahai jin dan manusia?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "60. هَلْ جَزَآءُ الْإِحْسٰنِ إِلَّا الْإِحْسٰنُ (Tidak ada balasan kebaikan kecuali kebaikan (pula)) Yakni tidak ada balasan bagi orang yang berbuat baik di dunia melainkan diperlakukan dengan baik di akhirat. Dan dua surga ini adalah untuk orang-orang yang mendahului orang lain dalam keimanan dan amal shalih. Mereka memiliki kedudukan yang paling tinggi diantara penghuni surga."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "60-61. Tidaklah balasan kebaikan amal dunia kecuali imbalan kebaikan akhirat, yaitu surga. Maka nikmat Tuhan mana yang kalian dustakan?!"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Adakah balasan kebaikan selain kebaikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "60-61. “Tidak ada balasan kebaikan kecuali kebaikan (pula),” maksudnya, tidak ada balasan bagi seseorang yang telah beribadah kepada sang Pencipta dengan baik dan memberikan manfaat bagi hambaNya yang lain, melainkan dia akan dibalas dengan kebaikan (pula) dengan pahala yang melimpah, kemenangan besar, kenikmatan abadi, dan kehidupan sejahtera. Maka dua surga yang tinggi ini adalah bagi orang-orang didekatkan (kepada Allah)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rahman ayat 60: Allah menutup penyebutan nikmat-nikmat ini dan kemudian menjelaskan bahwa tidaklah Dia membalas amalan dengan sebaik-baik balasan akan amalan tauhid dan ikhlas dalam beribadah kecuali kebaikan sebagai balasannya, dengan masuk surga dan kekal dalam kenikmatan dan tempat tinggalnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni tidak ada balasan bagi orang yang berbuat ihsan dalam beribadah kepada Allah dan berbuat ihsan dalam bergaul dengan manusia kecuali dibalas dengan kebaikan, berupa pahala yang besar, keberuntungan yang besar, kenikmatan yang kekal, dan kehidupan yang sentosa. Kedua surga yang tinggi yang terbuat dari emas ini diperuntukkan bagi orang-orang yang didekatkan dengan Allah Subhaanahu wa Ta'aala (Al Muqarrabiin). Dengan kenikmatan surga."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rahman Ayat 60",
    "description": "60-61. Tidak ada balasan untuk amal kebaikan selain anugerah ilahi yang berupa kebaikan pula. Maka, wahai manusia dan jin, nikmat tuhanmu yang manakah yang kamu dustakan'60-61"
  }
]