[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "62-63. Selain dua surga itu ada dua surga lainnya. Maka nikmat manakah dari nikmat-nikmat Tuhan kalian berdua (wahai jin dan manusia) yang kalian dustakan?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "62. Dan di samping dua surga yang sudah disebutkan ada lagi dua surga lainnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "62-67. Dan di bawah dua surga yang telah disebutkan itu terdapat dua surga yang derajatnya lebih rendah. Maka kenikmatan mana yang Tuhan kalian berikan, yang kalian ingkari wahai jin dan manusia? Dua surga ini sangat hijau, maka kenikmatan mana yang Tuhan kalian berikan, yang kalian ingkari wahai jin dan manusia? Di dalam dua surga ini terdapat dua mata air yang memancarkan air tawar terus menerus. Maka kenikmatan mana yang Tuhan kalian berikan, yang kalian ingkari wahai jin dan manusia?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "62. وَمِن دُونِهِمَا جَنَّتَانِ (Dan selain dari dua surga itu ada dua surga lagi) Yakni di bawah dua surga yang telah disebutkan sebelumnya itu terdapat dua surga yang lain, yang diperuntukkan bagi orang-orang yang berada di bawah tingkat orang-orang yang menghuni dua surga sebelumnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "62-63. Selain dua surga yang telah disebutkan untuk orang-orang yang dekat (dengan Allah) itu ada dua surga lain yang lebih kecil yang diperuntukkan untuk orang-orang yang menerima catatan amal dengan tangan kanan. Maka nikmat Tuhan mana yang kalian dustakan?!"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Selain dari keduanya} selain dua surga sebelumnya yang utama itu {ada dua surga"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "62-69. “Dan selain dari surga itu ada dua surga lagi” yang terbuat dari perak, yakni bentuk bangunan, perhiasan, bejana-bejana dan dan apa yang ada pada keduanya yang diperuntukkan bagi golongan kanan. Kedua surga tersebut “(kelihatan) hijau tua warnanya,” yakni keduanya berwarna hijau pekat karena sangat hijau dan subur. “Di dalam kedua surga itu ada dua mata air yang memancar,” yakni memancur. “Di dalam keduanya ada (macam-macam) buah-buahan” dari berbagai macam jenis buah-buahan, khususnya kurma dan delima yang memiliki sangat banyak manfaat dan kegunaannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rahman ayat 62: Allah mengabarkan bahwa terdapat selain dari dua surga yang lain bagi siapa yang takut kepada Rabbnya dan bagi siapa yang amalannya lebih sedikit dari penghuni dua surga yang disebutkan sebelumnya. Allah menempatkan hambanya di tempat yang sesuai dengan amalan yang diterima di sisi-Nya; Dan itu semua sesuai dengan keimanan dan amalan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selain dari dua surga yang tersebut di atas ada dua surga lagi yang disediakan untuk orang-orang mukmin yang derajatnya di bawah orang-orang mukmin yang dimasukkan ke dalam kedua surga yang pertama. Menurut Syaikh As Sa’diy, kedua surga yang lain itu dari perak, baik bangunannya, bejananya, perhiasannya, dan apa yang ada di dalamnya. Kedua surga ini diperuntukkan kepada As-habul Yamin (Golongan kanan)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rahman Ayat 62",
    "description": "62-63. Bila pada ayat yang lalu Allah menjelaskan keadaan surga, pada ayat ini dia menerangkan suasana surga yang lain lagi. Dan selain dari dua surga yang telah dijelaskan itu masih ada dua surga lagi. Maka, wahai manusia dan jin, nikmat tuhanmu yang manakah yang kamu dustakan'62-63"
  }
]