[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "66-67. Pada keduanya ada dua mata air yang memancar deras yang tidak berhenti. Maka nikmat manakah dari nikmat-nikmat Tuhan kalian berdua (wahai jin dan manusia) yang kalian dustakan?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "66. Di dua surga ini ada dua mata air yang memancarkan air dengan kuat, pancaran airnya tidak berhenti."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "66. فِيهِمَا عَيْنَانِ نَضَّاخَتَانِ (Di dalam kedua surga itu ada dua buah mata air yang memancar) Makna (النضخ) yakni mata air yang memancar. Yakni dua surga ini memiliki dua mata air yang memancar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "66-67. Di dalmnya ada dua mata air yang memancarkan air. Maka nikmat Tuhan mana yang kalian dustakan?!"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Di dalam keduanya ada dua mata air yang memancar tanpa henti} dua pancuran air yang tidak ada hentinya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "62-69. “Dan selain dari surga itu ada dua surga lagi” yang terbuat dari perak, yakni bentuk bangunan, perhiasan, bejana-bejana dan dan apa yang ada pada keduanya yang diperuntukkan bagi golongan kanan. Kedua surga tersebut “(kelihatan) hijau tua warnanya,” yakni keduanya berwarna hijau pekat karena sangat hijau dan subur. “Di dalam kedua surga itu ada dua mata air yang memancar,” yakni memancur. “Di dalam keduanya ada (macam-macam) buah-buahan” dari berbagai macam jenis buah-buahan, khususnya kurma dan delima yang memiliki sangat banyak manfaat dan kegunaannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rahman ayat 66: Pada kedua surga ini terdapat mata air ayng muncul seketika dengan air murni yang abadi yang tidak penah terputus."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rahman Ayat 66",
    "description": "66-67. Di dalam keduanya ada dua buah mata air yang memancar dan mengeluarkan air yang jernih dan segar. Maka, wahai manusia dan jin, nikmat tuhanmu yang manakah yang kamu dustakan'66-67"
  }
]