[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah meninggikan langit di atas bumi, dan Allah meletakkan di bumi dasar keadilan yang Dia perintahkan dan syariatkan bagi hamba-hambaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Dan langit dinaikkan-Nya di atas bumi sebagai atap baginya dan Dia menetapkan keadilan di bumi serta memerintahkan hamba-hamba-Nya untuk adil."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "7-9. Dan Allah meninggikan langit di atas bumi sebagai atapnya, dan menetapkan keadilan dalam perkataan dan perbuatan di antara para hamba, agar mereka tidak mengurangi timbangan. Timbanglah dengan sempurna, dan jangan kalian mengurangi timbangan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. وَالسَّمَآءَ رَفَعَهَا (Dan Allah telah meninggikan langit) Allah menjadikan langit tinggi di atas bumi. وَوَضَعَ الْمِيزَانَ(dan Dia meletakkan neraca (keadilan)) Yakni Allah meletakkan keadilan di bumi sesuai yang Dia perintahkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Dia juga menciptakan langit yang di angkat tanpa menggunakan pilar dan menurunkan sistem keadilan di bumi untuk ditetapkan sebagai dasar hukum."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia telah meninggikan langit dan Dia telah menciptakan timbangan} dan menetapkan keseimbangan di bumi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7-8. “Dan Allah telah meninggikan langit,” sebagai atap bagi makhluk bumi, “dan Dia meletakkan neraca (keadilan),” yakni keadilan di antara para hamba, baik dalam ucapan maupun perbuatan. Bukan hanya neraca (mizan) yang kita ketahui, akan tetapi yang dimaksudkan dalam ayat ini adalah seperti yang kami kemukakan, termasuk di dalamnya mizan tersebut, juga alat untuk menakar barang, alat-alat untuk mengetahui segala sesuatu yang belum diketahui, serta hakikat kebenaran yang dengannya diputuskan perkara makhluk dan ditegakkan keadilan di antara mereka. Oleh sebab itu Allah berfirman, “Supaya kamu jangan melampaui batas tentang neraca itu,” yakni Allah meletakkan neraca (keadilan) agar mereka tidak melampaui batas di dalam timbangan, karena apabila perkara ini dikembalikan kepada akal dan pemikiran kalian, niscaya akan terjadi kekacauan yang Allah Mahatahu akan hal itu, dan akan rusaklah langit dan bumi serta apa yang ada pada keduanya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rahman ayat 7: 7-9. Nikmat yang lain bagi hamba yang Allah sebutkan yaitu bahwasanya Dia menciptakan langit ini dan meninggikannya tanpa tiang yang dapat dilihat, maka Allah jadikan sebagai atap bagi bumi dan juga kuasa-Nya di antara keduanya. Kemudian Allah mengabarkan bahwa Allah menciptakannya dengan adil dan memerintahkan dengan bermacam-macam urusan; Agar tidak saling melanggar batasan bagi yang lainnya, yang kemudian menjadikan sebuah kedzaliman dan kesewenang-wenangan. Allah juga memerintahkan agar menimbang dengan keadilan, dan tidak mengurangi timbangan manusia jika menimbang untuk manusia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sebagai atap untuk makhluk-makhluk di bumi. Yakni keadilan di antara hamba-hamba-Nya baik dalam ucapan maupun perbuatan. Mizan (timbangan atau keseimbangan) di sini bukan hanya sekedar timbangan saja, akan tetapi termasuk pula takaran yang dengannya dapat diukur segala sesuatu, pengukur untuk mengukur sesuatu yang belum jelas dan hakikat yang dengannya dipisahkan di antara makhluk serta ditegakkan keadilan di antara mereka. Oleh karena itulah, Allah Subhaanahu wa Ta'aala berfirman di ayat selanjutnya, “Agar kamu jangan merusak keseimbangan itu,”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rahman Ayat 7",
    "description": "7-9. Dan dia telah menciptakan langit. Langit itu telah ditinggikan-Nya setelah sebelumnya menyatu dengan bumi dalam bentuk gumpalan, dan dia ciptakan keseimbangan dengan mantap agar kamu jangan merusak keseimbangan itu dengan berbuat melampaui batas, dan karenanya tegakkanlah keseimbangan itu dalam segala bentuknya, termasuk kepada dirimu atau keluargamu, dengan adil sehingga menguntungkan semua pihak, dan janganlah kamu mengurangi keseimbangan itu dengan cara dan bentuk apa pun"
  }
]