[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "75. Maka nikmat manakah dari nikmat-nikmat Tuhan kalian berdua (wahai jin dan manusia) yang kalian dustakan?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "75. Maka dengan nikmat Allah yang banyak untuk kalian -wahai jin dan manusia- yang mana yang kalian dustakan?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "74-75. Belum ada satupun manusia dan jin yang berkumpul dengan mereka (bidadari-bidadari itu) Maka nikmat Tuhan mana yang kalian dustakan?!"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka nikmat Tuhan kalian yang manakah yang kalian dustakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "70-75. “Di dalamnya” maksudnya di dalam semua surga tersebut “ada bidadari-bidadari yang baik-baik lagi cantik-cantik,” yakni memiliki akhlak yang mulia dan wajah yang rupawan, di mana mereka telah mengumpulkan antara keindahan lahir dan batin serta keelokan bentuk penciptaan dan akhlak. “(Bidadari-bidadari) yang jelita, putih bersih dipingit dalam rumah,” maksudnya dipingit di kemah-kemah yang terbuat dari mutiara, yang telah menyiapkan diri mereka untuk (menyambut kedatangan) suami-suami mereka, akan tetapi hal itu tidak menutup kemungkinan bagi mereka untuk keluar ke kebun-kebun dan taman-taman sebagaimana yang biasa dilakukan oleh anak-anak raja yang dipingit. “Mereka tidak pernah disentuh oleh manusia sebelum mereka (penghuni-penghuni surga yang menjadi suami mereka) dan tidak pula oleh jin. Maka nikmat Rabb kamu yang manakah yang kamu dustakan?”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rahman ayat 75: Telah berlalu tafsirnya pada ayat 13 dalam surat ini."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rahman Ayat 75",
    "description": "74-75. Para bidadari itu terjaga dengan baik. Mereka tidak pernah disentuh oleh manusia maupun oleh jin sebelumnya. Maka, wahai manusia dan jin, nikmat tuhanmu yang manakah yang kamu dustakan'76-77. Mereka, para bidadari, bersandar pada bantal-bantal empuk yang berwarna hijau dan permadani-permadani yang indah. Maka, wahai manusia dan jin, nikmat tuhanmu yang manakah yang kamu dustakan'."
  }
]