[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka nikmat manakah dari nikmat-nikmat Tuhan kalian berdua (wahai jin dan manusia) yang kalian dustakan?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "77. Maka dengan nikmat Allah yang banyak untuk kalian -wahai jin dan manusia- yang mana yang kalian dustakan?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "76-77. Mereka bersandar di atas bantal-bantal yang tebal dan permadani-permadani yang diukir dengan hiasan warna-warni yang indah dan menarik. Maka nikmat Tuhan mana yang kalian dustakan?! Al-‘Abqariy yaitu setiap hal yang memiliki kualitas mengagumkan, kata yang digunakan untuk satu hal atau lebih, seperti kata Thifl dan Falak."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka nikmat Tuhan kalian yang manakah yang kalian dustakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "76-77. “Mereka bertelekan pada bantal-bantal yang hijau,” maksudnya, mereka para penghuni dua surga itu duduk bertelekan di atas bantal-bantal yang berwarna hijau, yaitu bantal (alas) yang berada di bawah tempat duduk yang tinggi, yang menambah (ketinggian) tempat duduk mereka, sehingga terlihat bertumpuk rapi dari arah belakang tempat duduk mereka, karena bertambahnya keelokan dan keindahan pemandangan. “Dan permadani yang indah.” ‘al-‘abqoriyyu’ adalah penisbatan segala sesuatu yang ditenun dengan tenunan indah dan mewah, oleh karena itu Allah menyifatinya dengan keindahan yang menyeluruh disebabkan karena ia memiliki sifat yang indah, elok dipandang dan halus disentuh. Dua surga tersebut berbeda dengan dua surga yang disebutkan di awal tadi, sebagaimana hal itu disebutkan oleh Allah dalam FirmanNya, “Dan selain dari sua surga itu ada dua surga lagi.” Dan sebagaimana juga Allah telah menyifati (menggambarkan) dua surga yang pertama dengan berbagai sifat yang berbeda dengan sifat dua surga lainnya, Dia berfirman tentang dua surga pertama, “Di dalam kedua surga itu ada dua buah mata air yang memancar,” dan tentunya telah diketahui adanya perbedaan antara mengalir dan memancar. Kemudian Allah berfirman tentang kedua surga yang pertama, “Kedua surga itu mempunyai pohon-pohonan dan buah-buahan” dan Dia tidak menyebutkan hal itu dalam dua surga lainnya, sebagaimana Dia juga berfirman tentang dua surga yang pertama, “Di dalam kedua surga itu terdapat segala macam buah-buahan yang berpasang-pasangan” sedangkan tentang dua surga lainnya Dia berfirman, “Di dalam keduanya ada (macam-macam) buah-buahan dan kurma serta delima,” dan telah diketahui pula adanya perbedaan yang jauh antara dua penyifatan di atas. Allah berfirman tentang dua surga yang pertama, “Mereka bertelekan di atas permadani yang sebelah dalamnya dari sutra, dan buah-buahan surga itu dapat (dipetik) dari dekat” dan tidak menyatakan hal itu dalam menyifati dua surga lainnya, akan tetapi Dia berfirman, “Mereka bertelekan pada bantal-bantal yang hijau dan permadani yang indah.” Dia berfirman tentang dua surga pertama, “Di dalam surga itu ada bidadari-bidadari yang sopan menundukkan pandangannya, tidak pernah disentuh oleh manusia sebelum mereka (penghuni-penghuni surga yang menjadi suami mereka) dan tidak pula oleh jin” sedangkan tentang dua surga lainnya Dia berfirman, “(Bidadari-bidadari) yang jelita, putih bersih dippingit dalam rumah,” dan pada kedua penyifatan tersebut terdapat perbedaan sebagaimana telah diketahui. Tentang dua surga yang pertama Dia juga berfirman “Tidak ada balasan kebaikan kecuali kebaikan (pula).” Ayat ini menunjukkan bahwa dua surga yang pertama tersebut adalah sebagai balasan bagi orang-orang yang berbuat kebaikan (al-Muhsinin), dan Allah tidak menyatakan akan hal itu dalam menyifati dua surga terakhir. Dengan menyebutkan dua surga pertama itu terlebih dahulu menunjukkan akan keutamaan kedua surga tersebut. Dengan beberapa aspek yang telah disebutkan di atas, dapat diketahui bahwa dua surga pertama adalah lebih utama daripada dua surga yang disebutkan selanjutnya. Kedua surga tersebut telah dipersiapkan bagi orang-orang yang didekatkan kepada Allah (al-Muqarrabin) dari kalangan para nabi, para shiddiqin, dan orang-orang pilihan dari hamba-hamba Allah yang shalih. Sedangkan kedua surga lainnya dipersiapkan bagi orang-orang yang beriman secara umum. Dan di setiap dari surga-surga tersebut (terdapat berbagai macam kenikmatan) yang tidak pernah dilihat oleh mata, tidak pernah didengar oleh telinga, dan tidak pernah terbesit dalam benak manusia, di dalamnya terdapat segala sesuatu yang diinginkan oleh jiwa-jiwa dan nikmat dipandang, para penghuninya berada pada puncak kenikmatan, keridhaan, ketenangan dan tempat tinggal yang membahagiakan, hingga setiap dari mereka tidak melihat ada orang lain yang keadaannya lebih baik darinya dan tidak melihat ada orang lain yang mendapatkan kenikmatan lebih melimpah daripada yang sedang  rasakan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rahman ayat 77: Telah berlalu tafsirnya pada ayat 13 dalam surat ini."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rahman Ayat 77",
    "description": "76-77. Mereka, para bidadari, bersandar pada bantal-bantal empuk yang berwarna hijau dan permadani-permadani yang indah. Maka, wahai manusia dan jin, nikmat tuhanmu yang manakah yang kamu dustakan'78. Demikianlah nikmat-nikmat tuhanmu, wahai manusia dan jin. Akhirnya, wahai nabi Muhammad, mahasuci nama tuhanmu, pemilik keagungan dan kemuliaan."
  }
]