[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sungguh banyak keberkahan nama Tuhanmu dan melimpah kebaikanNya, Pemilik keagungan yang mencengangkan, kemuliaan sempurna dan pemuliaan kepada para kekasihNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "78. Mahaagung dan begitu banyak kebaikan nama Rabbmu yang mempunyai keagungan dan kebaikan serta karunia atas hamba-hamba-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "78. Maha Agung dan Maha Suci nama Allah, yaitu DzatNya, yang memiliki keagungan dan kenikmatan untuk hamba-hambaNya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maha berkah nama Tuhanmu Pemilik keagungan dan kemuliaan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "78. Tatkala Allah menyebutkan keluasan anugerah dan karuniaNya, Dia berfirman, “Mahaagung nama Rabbmu Yang Mempunyai Kebesaran dan Karunia.” Yakni, betapa agung dan melimpah karunia kebaikan Allah Yang memiliki keagungan yang gemilang, kemuliaan yang sempurna, dan karunia bagi hamba-hamba kesayanganNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rahman ayat 78: Allah menutup akhir surat ini dengan menyebutkan nama-nama Allah yang penuh berkah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala menyebutkan luasnya karunia dan ihsan-Nya, maka Dia berfirman, “Mahasuci nama Tuhanmu Pemilik Keagungan dan Kemuliaan.” Yakni Mahaagung dan banyak kebaikan Allah Subhaanahu wa Ta'aala yang memiliki kebesaran yang unggul di atas segalanya, Mahamulia secara sempurna, serta memuliakan para wali-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rahman Ayat 78",
    "description": "Demikianlah nikmat-nikmat tuhanmu, wahai manusia dan jin. Akhirnya, wahai nabi Muhammad, mahasuci nama tuhanmu, pemilik keagungan dan kemuliaan. 1-3. Allah mengawali surah ini dengan penjelasan tentang hari akhir yang dia tetapkan sebagai tanda dimulainya balasan bagi hamba. Apabila terjadi hari kiamat pada akhir kehidupan dunia kelak, terjadinya peristiwa dahsyat ini tidak dapat didustakan atau disangkal oleh siapa pun. Peristiwa ini merupakan ketetapan Allah yang pasti terjadi. Peristiwa itu akan merendahkan golongan yang ingkar kepada Allah dan meninggikan golongan lain yang beriman, melaksanakan perintah Allah, dan meninggalkan larangan-Nya."
  }
]