[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "8-9. Agar kalian tidak melanggar dan mencurangi orang yang kalian menimbang untuknya. Tegakkanlah timbangan secara adil, jangan mencuranginya bila kalian menimbang untuk orang-orang."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Dan tegakkan timbangan di antara kalian dengan adil dan janganlah kalian mengurangi timbangan atau takaran jika kalian menimbang atau menakar untuk orang lain."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. وَأَقِيمُوا۟ الْوَزْنَ بِالْقِسْطِ (Dan tegakkanlah timbangan itu dengan adil) Yakni timbanglah dengan penuh keadilan. وَلَا تُخْسِرُوا۟ الْمِيزَانَ (dan janganlah kamu mengurangi neraca itu) Yakni janganlah mengurangi timbangannya. Allah pertama-tama memerintahkan untuk menyempurnakan timbangan, kemudian melarang melampaui batas dengan melebihkan timbangan, dan kemudian melarang mengurang timbangan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9. Tegakkankanlah timbangan itu dengan memberikan keadilan untuk segala sesuatu. Janganlah kalian mengurangi timbangan sehingga kalian merendahkan hak-hak manusia."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Tegakkanlah timbangan itu dengan adil} adil {dan janganlah mengurangi} Janganlah mengurangi {timbangan itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9. “Dan tegakkanlah timbangan itu dengan adil,” artinya, jadikanlah timbangan itu untuk menegakkan keadilan, yang mana kemampuan dan kecakapan kalian sampai kepadanya. “Dan janganlah kamu mengurangi neraca itu,” yakni janganlah menguranginya dan melakukan sebaliknya, yakni ketidakadilan, kezhaliman, dan kesewenang-wenangan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ar-Rahman ayat 9: 7-9. Nikmat yang lain bagi hamba yang Allah sebutkan yaitu bahwasanya Dia menciptakan langit ini dan meninggikannya tanpa tiang yang dapat dilihat, maka Allah jadikan sebagai atap bagi bumi dan juga kuasa-Nya di antara keduanya. Kemudian Allah mengabarkan bahwa Allah menciptakannya dengan adil dan memerintahkan dengan bermacam-macam urusan; Agar tidak saling melanggar batasan bagi yang lainnya, yang kemudian menjadikan sebuah kedzaliman dan kesewenang-wenangan. Allah juga memerintahkan agar menimbang dengan keadilan, dan tidak mengurangi timbangan manusia jika menimbang untuk manusia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni jangan kamu kurangi keseimbangan itu dan kamu kerjakan hal yang bertentangan dengannya, yaitu zalim, aniaya dan melampaui batas."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Rahman Ayat 9",
    "description": "7-9. Dan dia telah menciptakan langit. Langit itu telah ditinggikan-Nya setelah sebelumnya menyatu dengan bumi dalam bentuk gumpalan, dan dia ciptakan keseimbangan dengan mantap agar kamu jangan merusak keseimbangan itu dengan berbuat melampaui batas, dan karenanya tegakkanlah keseimbangan itu dalam segala bentuknya, termasuk kepada dirimu atau keluargamu, dengan adil sehingga menguntungkan semua pihak, dan janganlah kamu mengurangi keseimbangan itu dengan cara dan bentuk apa pun. 10. Usai menjelaskan neraca keseimbangan di alam semesta, Allah kemudian berbicara tentang bumi. Dan di samping langit yang diatur dengan baik, bumi pun telah dibentangkan dan dihamparkan-Nya untuk kenyamanan semua makhluk yang menghuninya."
  }
]