[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidak kamu mengatahui (wahai rosul) apa yang telah dilakukan Tuhanmu terhadap pasukan gajah, yaitu Abrahah Al-habsyi bersama bala tentaranya yang hendak menghancurkan ka’bah yang diberkahi?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Tidakkah engkau -wahai Rasul- mengetahui bagaimana Rabbmu bertindak terhadap Abrahah dan kawanannya, pasukan gajah ketika mereka hendak menghancurkan ka'bah?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1. Allah mengingatkan Rasulullah dan umatnya tentang kisah pasukan bergajah yang dipimpin oleh Abrahah al-Habasyi, yaitu bala tentara yang disokong oleh pasukan-pasukan yang mengendarai gajah. Mereka berangkat dari Yaman menuju kota Makkah dengan tujuan meruntuhkan Ka’bah. Hai Rasulullah, kamu telah mengetahui kebinasaan yang akhirnya didapat oleh pasukan itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. اَلَمۡ تَرَ كَيۡفَ فَعَلَ رَبُّكَ بِاَصۡحٰبِ الۡفِيۡلِؕ‏ (Apakah kamu tidak memperhatikan bagaimana Tuhanmu telah bertindak terhadap tentara bergajah) Tentara bergajah adalah kaum Nasrani yang berasal dari Habasyah yang mengusai negeri Yaman. Mereka berjalan dari Yaman untuk menghancurkan Ka’bah, ketika mereka akan memasuki kota Makkah, Allah mengirim kepada mereka burung-burung yang disebutkan pada surat ini untuk membinasakan mereka. Dan ini adalah suatu mukjizat, terjadi 40 tahun sebelum Nabi Muhammad diutus sebagai Rasul, dan sebagian orang yang menyaksikan kejadian ini masih hidup ketika Rasulullah diutus."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Jika anda memperhatikan secara teliti konteks kisah tentara gajah dalam surah ini, anda akan memahami bahwasanya hikmah terbesar dari diutusnya burung ababil untuk perlindungan ka'bah, adalah agar tidak ada tempat bagi bagi kaum musyrikin dalam penguasaan rumah Allah ini, dan pada hakikatnya mereka sebelumnya tidak pernah ada peran dalam perlindungan ka'bah, yakni dengan cara mereka melindungi ka'bah dengan kejahilan pun tidak ada, bahkan jika Nabi tidak mengajak mereka kedalam islam pun mereka tidak akan berasalan untuk melindungi ka'bah. 2 ). Penyebutan kisah kehancuran tentara gajah tidak berulang dalam al-Qur'an, dengan dua aspek : ..... 1. Bahwasanya kehancuran tentara gajah belum masuk pada pembahasan penentangan dan pendustaan mereka terhadap Rasulullah -shallahu 'alaihi wasallam-. ..... 2. Agar orang-orang musyrik tidak berbuat tipu daya dengan kedudukan mereka disisi Allah sebagaimana mereka berbuat tipu daya dengan perkataan mereka yang dijelaskan dalam ayat berikut : { أَجَعَلْتُمْ سِقَايَةَ الْحَاجِّ وَعِمَارَةَ الْمَسْجِدِ الْحَرَامِ كَمَنْ آمَنَ بِاللَّهِ وَالْيَوْمِ الْآخِرِ } \" Apakah (orang-orang) yang memberi minuman orang-orang yang mengerjakan haji dan mengurus Masjidilharam kamu samakan dengan orang-orang yang beriman kepada Allah dan hari kemudian\" [ at-Taubah : 19 ] . 3 ). Apakah hikmah dari pembinasaan ashabul fil ( tentara gajah ), dan minimnya pembinasaan terhadap orang-orang yang bermaksud menghancurkan ka'bah dizaman-zaman terakhir ini ? perlu diketahui bahwasanya kisah tentara gajah adalah merupakan awal dari diutusnya Rasulullah sebagai pembawa risalah Allah yang dengannya rumah Allah ini diagungkan, adapun peristiwa usaha pengrusakan ka'bah diakhir zaman ini; sesungguhnya orang-orang kafir yang menginginkan kehancuran ka'bah dan kehancuran islam dengan kezholiman dan kekufuran, sampai titik akhir mereka tidak sadar dengan perbuatan mereka, maka pada saat itulah Allah akan menjatuhkan dan membinasakan mereka, hingga akhirnya tidak tersisa satupun dari orang-orang kafir itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "1-2. Bukankah kamu mengetahui wahai Nabi bagaimana Tuhanmu memperlakukan pasukan gajah yang besar itu, yaitu kaum Nasrani dari Habsyah yang sedang memimpin negeri Yaman. Mereka datang dengan dipimpin oleh Abrahah untuk menghancurkan Ka’bah yang mulia itu. Agar bangsa Arab beralih untuk mengagungkan gereja yang mereka bangun di Sana (Ibukota Negeri Yaman). Peristiwa itu terjadi 40 tahun sebelum Nabi SAW diutus. Istifham pada kalimat itu sebagai pemberitahuan. Bukankah Allah membuat tindakan buruk mereka dan pemikiran mereka yang busuk untuk menghancurkan Ka’bah itu sia-sia. Kata Adh-Dhalal asalnya bermakna menjadikan suatu perbuatan menjadi sia-sia."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidakkah kamu memperhatikan} tidakkah kamu mengetahui {bagaimana Tuhanmu telah melakukan sesuatu terhadap pasukan bergajah} terhadap Abrahah Al-Habsy dan pasukannya yang hendak merobohkan Ka'bah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-5. Maksudnya, apakah kau tidak melihat Kuasa dan keagungan Allah, serta rahmatNya pada hamba-hambaNYa? Dan bukti-bukti atas keesaanNya dan kebenaran RasulNya, Muhammad, adalah apa yang dilakukan Allah terhadap para tentara bergajah yang berniat jahat terhadap Baitullah (Ka’bah) dan ingin menghancurkannya. Mereka mempersiapkan tentara untuk tujuan itu dan menyertakan gajah untuk menghancurkan Ka’bah. Mereka datang dengan rombongan yang tidak ada tandingannya bagi bangsa Arab kala itu, dari kalangan Habasyah dan Yaman. Ketika mereka sampai di dekat Makkah –kala itu bangsa Arab tidak memiliki pertahanan- para penduduk Makkah keluar meninggalkan Makkah karena takut terhadap mereka. Kemudian Allah mengirim burung yang berbondong-bondong pada mereka dengan membawa bebatuan membara yang berasal dari tanah yang terbakar. Burung-burung itu melemparkan bebatuan itu pada mereka. Bebatuan itu mengincar mereka, baik yang jauh maupun yang dekat hingga mereka semua binasa dan mereka pun seperti dedaunan yang dimakan ulat. Allah menjaga dari keburukan mereka dan membalas tipudaya mereka dalam pasukan mereka, Kisah mereka masyhur, dan itulah tahun saat dilahirkannya Rasulullah. Dan hal itu menjadi salah satu penguat dakwah dan sebagai bukti risalah beliau. Segala puji syukur hanya bagi Allah semata."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Tidakkah kamu memperhatikan bagaimana tuhanmu berlaku kepada pasukan gajah ? Dengan ayat ini Allah berbicara kepada Nabi ﷺ , dan riwayat lain mengatakan : bahkan ayat ini berbicara kepada semua manusia yang berakal sehat. Ulama berpendapat : sesungguhnya peristiwa yang diceritakan oleh surah ini adalah sebagai isyarat akan diutusnya Manusia yang mulia dengan membawa risalah yang mulia Muhammad ﷺ , karena beliau dilahirkan pada tahun terjadinya peristiwa ini, hal itulah yang menjadi isyarat akan diutusnya Rasulullah sebagai pembawa kebenaran."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "أَلَمْ تَرَ كَيْفَ فَعَلَ رَبُّكَ بِأَصْحَابِ الْفِيلِ \" Apakah kamu tidak memperhatikan bagaimana Tuhanmu telah bertindak terhadap tentara bergajah?\" Allah Ta'ala berinteraksi dengan Nabi shallallaahu 'alaihi wa sallam, atau berinteraksi dengan setiap orang yang cocok dalam konteks ayat ini. Berdasarkan pemaknaan pertama, konteks ayat yang dimaknai bahwa Allah berinteraksi dengan Nabi maka ini tertuju kepadanya dan umatnya, karena umatnya mengikutinya. Sedang kan berdasarkan pemaknaan kedua, maka konteks interaksi ayat ini umum mencakup Rasul shallallaahu 'alaihi wa sallam, umatnya dan seluruh manusia. Allah Ta'ala menetapkan apa yang diperbuat-Nya kepada pasukan gajah. Pasukan gajah ini adalah penduduk yaman yang datang untuk menghancurkan ka'bah, dengan gajah yang besar, yang dikirimkan oleh Raja habasyah kepada mereka. Sebabnya adalah bahwa raja Yaman ingin menghalangi orang-orang berhaji ke ka'bah, Baitullaah 'Azza Wa Jalla, ia membangun rumah yang menyerupai ka'bah, dan mengajak manusia untuk berhaji ke sana dan melarang mereka dari berhaji ke rumah Allah. Maka orang-orang arab marah kerenanya. Salah seorang dari mereka pergi ke rumah tersebut yang dibuat oleh Raja Yaman sebagai gantinya ka'bah, ia buang air besar di dalamnya lalu melumuri dindingnya dengan kotoran. Maka raja yaman marab besar, lalu ia mengabarkan kejadian ini kepada raja Habasyah. Kemudian Raja habasyah mengirimkan gajah besar itu kepada Raja Yaman. Disebutkan bahwa gajah besar itu bersama enam ekor gajah lainya untuk membantu. Lalu Raja Yaman datang datang membawa bala tentaranya untuk meruntuhkan ka'bah sesuai rencana ia. Tetapi Allah Subhaanahu menjaga rumah-Nya. Maka ketika pasukan itu sampai ke sebuah tempat yang disebut mughommas, gajah itu berhenti, dan mengelak (tidak mau melanjutkan perjalanan), ia enggan menuju ka'bah, maka penunggangnya menggertaknya, tetapi ia tetap enggan. Jika mereka mengarahkan gajah itu ke Yaman ia pergi berjalan cepat, jika mereka mengarahkannya ke Mekah, ia berhenti. Ini adalah di antara tanda-tanda kekuasaan Allah 'Azza Wa Jalla, mereka terhenti hingga Allah menurunkan kepada mereka burung-burung ababil, yang melemparkan batu dari sijjil."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Fil ayat 1: Surat ini dimulai dengan ditujukan kepada Nabi ﷺ, Allah berkata : Apakah engkau tahu wahai Nabi Allah apa yang Tuhanmu perbuat terhadap tentara bergajah ? Dan kisah dari tentara bergajah ini adalah, Abraham pada waktu itu membangung gereja besar di Shan’a (Yaman); Tujuannya agar manusia berpindah haji mereka dari Ka’bah menuju ke gereja, dimana hal tersebut membuat manusia yang berhaji ke Mekkah marah. Kemudian Abraham dengan mudahnya mengutus pasukan besar menuju Mekkah, maka ketika pasukan telah sampai di lembah Muhassir yang terletak antara Muzdalifah dan Mina, maka Allah utus bagi mereka adzab yang disebutkan dalam surat ini, dan binasalah mereka semua."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kekuasaan Allah Subhaanahu wa Ta'aala, keagungan-Nya, rahmat-Nya kepada hamba-hamba-Nya, dalil-dalil terhadap keesaan-Nya, dan benarnya Rasul-Nya Muhammad shallallahu 'alaihi wa sallam pada peristiwa tentara bergajah; bagaimana tindakan Allah Subhaanahu wa Ta'aala terhadap mereka yang hendak menghancurkan rumah-Nya itu ketika penduduk di sekitar rumah-Nya itu tidak sanggup menghadapi tentara itu. Yang dimaksud dengan tentara bergajah ialah tentara yang dipimpin oleh Abrahah Gubernur Yaman yang hendak menghancurkan Ka'bah. Sebelum masuk ke kota Mekah tentara tersebut diserang burung-burung yang melemparinya dengan batu-batu sehingga mereka musnah. Disebutkan dalam riwayat, bahwa Abrahah Al Asyram membangun gereja yang megah, mewah, indah dan tinggi di Shan’a (ibukota Yaman). Orang-orang Arab menamainya dengan Al Qulayyas karena bangunannya yang tinggi, dimana orang yang melihatnya bisa membuat pecinya jatuh. Abrahah bermaksud mengalihkan hajinya orang-orang Arab dari ke Ka’bah di Mekah menuju ke gereja itu, bahkan ia umumkan hal itu di kerajaannya, namun orang-orang Arab tidak suka hal itu, bahkan orang-orang Quraisy marah karenanya, sehingga di antara mereka ada yang pergi mendatangi gereja itu dan masuk ke dalamnya lalu meletakkan kotoran di dalamnya. Ketika para juru kuncinya melihat hal itu, maka mereka melaporkan kejadikan itu kepada raja mereka, yaitu Abrahah dan mereka memberitahukan, bahwa yang melakukannya adalah sebagian orang Quraisy karena marah demi membela rumah mereka yang hendak disaingi. Maka Abrahah bersumpah akan berangkat menuju Ka’bah dan merobohkan batu-batunya satu persatu, ia pun mempersiapkan pasukannya yang terdiri dari tentara bergajah dengan maksud menghancurkan Ka’bah kemudian berangkat menuju Mekah, hingga ketika ia hampir tiba di kota Makkah, gajah-gajah malah diam dan tidak mau beranjak maju ke Ka’bah. Tetapi ketika gajah tersebut diarahkan ke arah lain, gajah-gajah tersebut bangkit dan bergegas melangkah. Saat diarahkan lagi ke Ka’bah, gajah-gajah tersebut diam. Ketika itulah, Allah Subhaanahu wa Ta'aala mengirimkan burung yang berbondong-bondong untuk melempari mereka dengan batu yang berasal dari tanah yang terbakar, dan membuat mereka seperti daun-daun yang dimakan ulat. Pada tahun terjadinya penyerangan tentara bergajah itu, lahir pula Nabi Muhammad shallallahu 'alaihi wa sallam sehingga yang demikian merupakan permulaan risalah Beliau shallallahu 'alaihi wa sallam. Maka segala puji bagi Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Fil Ayat 1",
    "description": "Wahai nabi Muhammad atau siapa saja, tidakkah engkau perhatikan bagaimana tuhanmu telah bertindak terhadap tentara bergajah dengan menghancurkan mereka, yaitu tentara abrahah dari ethiopia yang hendak menghancurkan kakbah'2. Bukankah dia telah menjadikan tipu daya dan usaha mereka menghancurkan kakbah itu sia-sia, meski mereka datang dengan pasukan yang kuat dan persenjataan yang lengkap'."
  }
]