[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "3-4. Dia mengirimkan burung-burung yang datang silih berganti, Melempari mereka dengan tanah basah yang mengeras."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Yang melempar mereka dengan bebatuan dari tanah membara."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "4-5. Burung-burung itu melempari pasukan Abrahah dengan tanah yang keras, sehingga mereka menjadi seperti dedaunan kering yang dimakan dan diinjak hewan gembalaan sehingga hancur lebur dan binasa. Diriwayatkan at-Thabari dari Qatadah, yang dimaksud dengan (كعصف مأكول) yakni seperti kulit biji-bijian. (Tafsir at-Thabari 24/644, at-Tafsir as-Shahih 4/670)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. تَرۡمِيۡهِمۡ بِحِجَارَةٍ مِّنۡ سِجِّيۡلٍ (yang melempari mereka dengan batu (berasal) dari tanah yang terbakar) Dikatakan bahwa batu-batu ini merupakan tanah yang dibakar dengan api neraka, tertulis padanya nama-nama kaum tersebut; jika batu ini mengenai salah seorang dari mereka maka akan mengakibatkan cacar. Batu-batu ini seukuran kacang Arab."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3-4. Dan Allah mengirimkan kepada mereka gerombolan makhluk terbang yang sangat banyak dan beragam. Ath-Thair adalah setiap hal yang terbang di udara, baik kecil maupun besar, termasuk lalat dan nyamuk. Makhluk-makhluk itu melempari mereka menggunakan batu fosil, maka hancurlah mereka. Fiil Madhi diungkapkan menggunakan fiil mudhari’ pada kata {tarmiihim} untuk memberikan gambaran yang menakjubkan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{yang melempari mereka dengan batu dari tanah liat yang dibakar} tanah yang membatu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-5. Maksudnya, apakah kau tidak melihat Kuasa dan keagungan Allah, serta rahmatNya pada hamba-hambaNYa? Dan bukti-bukti atas keesaanNya dan kebenaran RasulNya, Muhammad, adalah apa yang dilakukan Allah terhadap para tentara bergajah yang berniat jahat terhadap Baitullah (Ka’bah) dan ingin menghancurkannya. Mereka mempersiapkan tentara untuk tujuan itu dan menyertakan gajah untuk menghancurkan Ka’bah. Mereka datang dengan rombongan yang tidak ada tandingannya bagi bangsa Arab kala itu, dari kalangan Habasyah dan Yaman. Ketika mereka sampai di dekat Makkah –kala itu bangsa Arab tidak memiliki pertahanan- para penduduk Makkah keluar meninggalkan Makkah karena takut terhadap mereka. Kemudian Allah mengirim burung yang berbondong-bondong pada mereka dengan membawa bebatuan membara yang berasal dari tanah yang terbakar. Burung-burung itu melemparkan bebatuan itu pada mereka. Bebatuan itu mengincar mereka, baik yang jauh maupun yang dekat hingga mereka semua binasa dan mereka pun seperti dedaunan yang dimakan ulat. Allah menjaga dari keburukan mereka dan membalas tipudaya mereka dalam pasukan mereka, Kisah mereka masyhur, dan itulah tahun saat dilahirkannya Rasulullah. Dan hal itu menjadi salah satu penguat dakwah dan sebagai bukti risalah beliau. Segala puji syukur hanya bagi Allah semata."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Burung-burung itu melempari Abarahah dan bala tentaranya dengan batu yang mereka bawa dari neraka."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "2-4. أَلَمْ يَجْعَلْ كَيْدَهُمْ فِي تَضْلِيلٍ (2) وَأَرْسَلَ عَلَيْهِمْ طَيْرًا أَبَابِيلَ (3) تَرْمِيهِمْ بِحِجَارَةٍ مِنْ سِجِّيلٍ \" Bukankah Dia telah menjadikan tipu daya mereka (untuk menghancurkan Kakbah) itu sia-sia? Dan Dia mengirimkan kepada mereka burung yang berbondong-bondong, yang melempari mereka dengan batu (berasal) dari tanah yang terbakar,\" Para Ulama mengatakan: طَيْرًا أَبَابِيلَ Maknanya: (burung-burung) yang berbondong-bondong, setiap burung membawa dengan paruhnya betu yang keras مِنْ سِجِّيلٍ Yaitu tanah liat yang dibakar, karena dengan begitu ia menjadi lebih keras, batu ini tidaklah besar, tapi ia kecil. Dilemparkan ke atas kepala salah seorang dari mereka lalu keluar dari pantat mereka wal-'iyaadzu billaah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Fil ayat 4: 2-4. Mereka ini menginginkan untuk merobohkan Ka’bah wahai Nabi Allah, Bukankah Allah membuat mereka binasa dan menjadikan tipu daya mereka serta usaha mereka dalam menghancurkan Ka’bah sia-sia dan kerugian (bagi mereka) ? Dimana Allah telah mengutus burung-burung yang mendatangi (pasukan Abraham) secara bergerombol antara satu sama lainnya menjatuhkan adzab yang masing-masing burung membawa tiga buah batu, setiap satu burung melemparkannya dan bagi setiap pasukan dijatuhkan satu batu. Dan masing-masing batunya telah tertulis masing-masing nama yang akan dibinasakan. Dikatakan juga tertulis (bagaimana/cara) di adzabnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Fil Ayat 4",
    "description": "3-4. Allah mempunyai cara untuk menggagalkan tipu daya mereka, dan dia mengirimkan kepada mereka salah satu makhluk-Nya yang dijadikan bala tentara untuk menghancurkan mereka, yaitu burung yang berbondong-bondong dan tidak terhitung banyaknya. Allah mengirim burung-burung yang melempari mereka dengan batu yang berasal dari tanah liat yang terbakar. 5. Batu-batu yang dijatuhkan oleh burung-burung itu tepat mengenai tentara abrahah sehingga mereka dijadikan-Nya bergelimpangan tak berdaya dan binasa seperti daun-daun yang dimakan ulat. Itulah balasan bagi orang yang angkuh dan hendak menghancurkan kakbah, simbol agama Allah."
  }
]