[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka dia menghancurkan mereka sehingga mereka seperti daun daun kering yang disantap hewan ternak kemudian mengeluarkannya dalam bentuk kotoran."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Maka Allah menjadikan mereka seperti daun tanaman yang dimakan dan dihancurkan oleh ulat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. فَجَعَلَهُمۡ كَعَصۡفٍ مَّاۡكُوۡلٍ (lalu Dia menjadikan mereka seperti daun-daun yang dimakan (ulat)) Yakni seperti dedaunan yang dimakan hewan kemudian dimuntahkan ke tanah. Pendapat lain mengatakan: yakni seperti dedaunan yang dimakan hewan dan menyisakan tangkainya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Berapa dalil yang tertera dalam surah ini yang menerangkan akan kuasa dan keagungan Allah ? burung-burung kecil yang melemparken batuan panas kecil diatas para penantang Allah, dan gajah-gajah besar, yang membuat mereka semua seperti dedaunan yang dimakan ulat : { فَجَعَلَهُمْ كَعَصْفٍ مَأْكُولٍ } . 2 ). Perhatikanlah bagaimana surah ini menjelaskan keagungan Allah dengan gaya bahasa yang sagat indah : { فَجَعَلَهُمْ كَعَصْفٍ مَأْكُولٍ } al-Qur'an tidak menggunakan kalimat : ( كروث الدواب ) ; agar kita mempelajari betapa indahnya kalimat-kalimat yang dikeluarkan oleh al-Qur'an, dan hal itu merupakan manhaj yang murni dari kecacatan dalam al-Qur'an, sebagaimana yang juga didunakan dalam kisah istri raja mesir : { وَلَقَدْ هَمَّتْ بِهِ ۖ وَهَمَّ بِهَا } , maka hendaklah setiap dari kita mentadabburi ayat-ayat semacam ini dan konsisten dengan hukum yang diperintahkan olehnya; agar kita menjadi bagian dari orang-orang yang : { وَهُدُوا إِلَى الطَّيِّبِ مِنَ الْقَوْلِ وَهُدُوا إِلَىٰ صِرَاطِ الْحَمِيدِ } \" Dan mereka diberi petunjuk kepada ucapan-ucapan yang baik dan ditunjuki (pula) kepada jalan (Allah) yang terpuji\". [ al-Hajj : 24 ]."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Hal itu menjadikan mereka seperti dedaunan pohon yang tertiup angin, kemudian dimakan oleh hewan peliharaan lalu dirobek olehnya. Allah menghancurkan mereka semua"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{sehingga Dia menjadikan mereka seperti daun-daun yang dimakan} seperti daun tanaman yang dimakan dan diinjak binatang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-5. Maksudnya, apakah kau tidak melihat Kuasa dan keagungan Allah, serta rahmatNya pada hamba-hambaNYa? Dan bukti-bukti atas keesaanNya dan kebenaran RasulNya, Muhammad, adalah apa yang dilakukan Allah terhadap para tentara bergajah yang berniat jahat terhadap Baitullah (Ka’bah) dan ingin menghancurkannya. Mereka mempersiapkan tentara untuk tujuan itu dan menyertakan gajah untuk menghancurkan Ka’bah. Mereka datang dengan rombongan yang tidak ada tandingannya bagi bangsa Arab kala itu, dari kalangan Habasyah dan Yaman. Ketika mereka sampai di dekat Makkah –kala itu bangsa Arab tidak memiliki pertahanan- para penduduk Makkah keluar meninggalkan Makkah karena takut terhadap mereka. Kemudian Allah mengirim burung yang berbondong-bondong pada mereka dengan membawa bebatuan membara yang berasal dari tanah yang terbakar. Burung-burung itu melemparkan bebatuan itu pada mereka. Bebatuan itu mengincar mereka, baik yang jauh maupun yang dekat hingga mereka semua binasa dan mereka pun seperti dedaunan yang dimakan ulat. Allah menjaga dari keburukan mereka dan membalas tipudaya mereka dalam pasukan mereka, Kisah mereka masyhur, dan itulah tahun saat dilahirkannya Rasulullah. Dan hal itu menjadi salah satu penguat dakwah dan sebagai bukti risalah beliau. Segala puji syukur hanya bagi Allah semata."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Allah kemudian menjadikan mereka setelah ditempa dengan batu-batun api, tubuh mereka perlahan hancur seperti dedaunan dimakan ulat, itulah akibat bagi orang-orang yang mnentang keesaan Allah - عز وجل - , sebesar apapun kesombongan mereka tidak akan bertahan sampai musibah datang menghancurkan mereka. Peristiwa-peristiwa seperti diatas adalah pelajaran yang sangat berharga bagi siapa yang mau mempelajarinya, Allah - عز وجل - tidak akan tinggal diam saat rumah-Nya yang suci itu akan dihancurkan oleh orang-orang yang hina. Dan diantara ayat-ayat Allah - عز وجل - bahwasanya sejak zaman Nabi Ibrahim sampai saat ini dan sampai masa yang diinginkan oleh Allah - عز وجل - dan Dia ﷻ akan ada selamanya, sebesar apapun rencana kejahatan orang-orang kafir terhadap rumah Allah yang suci ini mereka tidak akan mampu untuk berbuat jahat kepadanya, bahkan orang-orang yang tinggal di sekitar Al-Harom sekalipun tidak akan mampu untuk berbuat jahat kepada rumah Allah itu."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "فَجَعَلَهُمْ كَعَصْفٍ مَأْكُولٍ \" lalu Dia menjadikan mereka seperti daun-daun yang dimakan (ulat).\" Maknanya: Seperti tumbuhan yang dimakan oleh binatang-binatang dan diinjak dengan kaki-kakinya sehingga lebur. Inilah tafsir global surat ini, yang di dalamnya Allah Subhaanahu wa Ta'ala menjelaskan tentang pasukan gajah, dan makar mereka kembali leher-leher mereka, dan begitulah bagi semua yang ingin menentang kebenaran, maka Allah Ta'ala menjadikan makarnya kembali kepadanya. Allah 'Azza Wa Jalla telah menjaga ka'bah dari gajah tersebut, walau pun nanti di akhir zaman akan dikuasai oleh seseorang dari habasyah yang akan menghancurkannya dengan lembaran batu demi batu hingga rata dengan tanah, karena kisah pasukan gajah terjadi sebelum diutusnya Rasul shallallaahu 'alaihi wa sallam yang di dalamnya terdapat pengagungan al-Bait (ka'bah) Sedangkan di akhir zaman kelak, apabila penduduk sekitar ka'bah menghinakannya, dan gemar melakukan penympangan dengan kezaliman, dan tidak lagi mengemperhatikan kehormatannya, saat itulah Allah akan menjadikan mereka dijajah oleh yang hendak meruntuhkannya, sampai nanti akan tidak tersisa di atas bumi. Oleh karenya wajib bagi penduduk Mekkah secara khusus untuk menghidari kemaksiatan-kemaksiatan dan dosa-dosa baik kecil mau pun besar, sehingga mereka tidak menghinakan ka'bah dan Allah 'Azza Wa Jalla merendahkan mereka. Kita meminta kepada Allah Ta'ala agar menjaga agama kita dan baitullaah al-haram dari makar setiap pembuat makar, sesungguhnya Dia Maha Kuasa atas segala sesuatu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Fil ayat 5: Allah menjelaskan ketika batu-batu ini dijatuhkan kepada masing-masing pasukan, mereka di uji dengan penyakit cacar dan Aku jadikan mereka orang binasa sebagaimana kertas-kertas kering yang bertaburan yang jatuh ke bumi, dan dengan ringan disapu oleh angin dan berhamburanlah. Nabi dilahirkan setelah kejadian pasukan bergajah ini atau di tahun gajah ini."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Fil Ayat 5",
    "description": "Batu-batu yang dijatuhkan oleh burung-burung itu tepat mengenai tentara abrahah sehingga mereka dijadikan-Nya bergelimpangan tak berdaya dan binasa seperti daun-daun yang dimakan ulat. Itulah balasan bagi orang yang angkuh dan hendak menghancurkan kakbah, simbol agama Allah. 1. Wahai manusia, kamu akan dibuat kagum karena kebiasaan orang-orang quraisy, suatu kabilah besar yang mempunyai peranan sentral pada masyarakat arab dalam bidang politik dan sosial."
  }
]