[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-4. Allah bersumpah dengan negeri al-haram (yaitu Makkah). Dan kamu (wahai nabi) halal di negeri al-haram, kamu boleh melakukan apa yang kamu kehendaki padanya,dan tidak dihalalkan bagi nabi kecuali sesaat dari siang hari. Ayat ini merupakan kabar gembira bagi nabi sholallohu alaihi wasallam bahwa Allah akan menaklukan kota Makkah melalui beliau dan menghalalkan perang bagi beliau. Allah juga bersumpah dengan bapak manusia(adam) dan anak keturunannya, Sungguh kami menciptakan manusia dalam kelelahan dan kesulitan dalam menjani dunia."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Allah bersumpah dengan tanah haram yaitu Makkah al-Mukarramah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1-4. Allah mengagungkan kota Makkah al-Mukarramah, dengan bersumpah menggunakan kota agung yang menjadi tempat tinggalmu -hai Rasulullah-, sebagai pemuliaan bagi derajatmu. Dan Allah juga bersumpah dengan Nabi Adam dan para keturunannya. Isi dari sumpah ini adalah: Kami telah menciptakan manusia untuk menghadapi berbagai musibah dunia dan kesulitan akhirat, dan hal ini tidak terlepas dari dua hal; harus bersyukur dalam menghadapi kebahagiaan, dan harus bersabar dalam menghadapi kesusahan; sehingga manusia selalu berada dalam dua hal yang sulit."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. لَآ أُقْسِمُ بِهٰذَا الْبَلَدِ (Aku benar-benar bersumpah dengan kota ini (Mekah)) Yakni Aku bersumpah demi kota haram yaitu Makkah. Sumpah ini sebagai peringatan terhadap kemuliaan Ummul Qura (Makkah) di sisi Allah, karena di dalamnya terdapat Baitul haram, serta merupakan negeri Nabi Ismail dan Nabi Muhammad, serta di dalamnya dilaksanakan manasik haji."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "1-2. Aku bersumpah demi Negeri yang mulia yaitu Makkah Al-Mukarramah. Kamu wahai Nabi SAW boleh tinggal di NegerI ini, dimana orang-orang musyrik Mekah tidak boleh menyakitimu, Ucapan itu mengandung teguran bagi mereka dan pembolehan dirimu untuk tinggal di dalamnya. Hal ini untuk menampakkan limpahan anugerahNya dan memberitahukan bahwa kemuliaan suatu tempat sesuai kemuliaan penduduknya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Aku bersumpah demi negeri ini} Aku bersumpah demi negeri yang mulia ini, yaitu Mekkah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-3. Allah bersumpah “dengan kota ini,” yang aman, yaitu Makkah al-Mukarramah. Negeri yang paling mulia secara mutlak, khususnya pada saat munculnya Rasulullah di negeri itu. “Dan demi bapak dan anaknya,” yaitu Adam dan keturunannya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ لَا أُقْسِمُ بِهَٰذَا الْبَلَدِ } Aku benar-benar bersumpah dengan kota ini, yaitu Kota Makkah yang dimuliakan, kota ini dinamakan juga dengan \"Al-Balad\" atau \"Ummul Quro' \" , Allah berfirman : { إِنَّمَا أُمِرْتُ أَنْ أَعْبُدَ رَبَّ هَٰذِهِ الْبَلْدَةِ الَّذِي حَرَّمَهَا وَلَهُ كُلُّ شَيْءٍ } ( Aku hanya diperintahkan untuk menyembah Tuhan negeri ini (Mekah) Yang telah menjadikannya suci dan kepunyaan-Nya-lah segala sesuatu, ) [ An-Naml : 91 ] , sebagaimana yang juga dikatakan oleh Allah dalam sumpah-Nya di surah At-Tin ayat 2 , kota yang suciyang dimuliakan dan diagungkan oleh Allah."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "لَا أُقْسِمُ بِهَذَا الْبَلَدِ \"Aku benar-benar bersumpah dengan kota ini (Mekah),\" Kata [Laa] di sini untuk pembuka, maksudnya: Pembuka pembicaraan dan untuk penagasannya, dan tidak bermakna peniadaan. Karena tujuannya adalah untuk meneguhkan sumpah, yakni: Saya bersumpah dengan negeri ini. Tetapi Laa di sini datang untuk peringatan dan penegasan, sedangkan arti أُقْسِمُ adalah sumpah, menegaskan sesuatu dengan menyebutkan sesuatu yang diagungkan dengan cara (gaya bahasa) tertentu. Segala yang digunakan namanya untuk bersumpah pasti diagungkan oleh yang bersumpah, dan bisa juga tidak memiliki keagungan jika dilihat dari hakikat zatnya, contohnya orang-rang musyrik yang bersumpah dengan latta dan uzza, karena kedua berhala tersebut agung di sisi mereka. Tapi kenyataannya tidak agung tidak juga diagungkan. Karenanya sumpah (baik halif, qosam atau yamiin –dalam bahasa arab-) adalah menegaskan suatu perkara dengan menyebut suatu yang diagungkan oleh yang bersumpah dengan sifat (gaya bahasa) tertentu, huruf-huruf untuk besumpah dalam bahasa arab adalah, huruf Ba, Waw, dan Ta. Dan yang ada dalam ayat yang mulia ini لَا أُقْسِمُ بِهَذَا الْبَلَدِ adalah huruf Ba بِهَذَا الْبَلَدِ Negeri yang dimaksdukan di sini adalah Mekkah. Allah bersumpah dengannya karena kemuliaan dan keagungannya. Mekkah adalah tempat termulia di bumi, secara kehormatan (keharamannya) dan tempat di bumi yang paling Allah 'Azza Wa Jalla cintai. Oleh karenanya, dari negeri tersebutlah Allah mengutus Rasulullah shallallah 'alaihi wa sallam, yang berstatus sebagai tuannya manusia shalawaatullaah wa salaamuhu 'alaih. Maka sangat pantas jika negeri ini dijadikan sebagai penyebutan sumpah, tetapi kita tidak boleh bersumpah dengannya, karena dia adalah makhluk, dan kita tidak mempunyai hak atau wewenang untuk bersumpah dengan makhluk, sebagaimana Nabi shallallaahu 'alaihi wa sallam bersabda: مَنْ حَلَفَ بِغَيْرِ اللهِ فَقَدْ كَفَرَ أَوْ أَشْرَكَ \"Barang siapa yang bersupah dengan menyebut nama selain Allah maka dia kafir atau berbuat syirik (menyekutukan Allah)\" (1) sedangkan Allah 'Azza Wa Jalla maka Dia berhak bersumpah dengan apapun yang Dia kehendaki, oleh karenanya dalam ayat ini di sini bersumpah dengan kota Mekkah. (1) Dikeluarkan Tirmizi (1535) dari hadits Ibnu Umar radhiyallallaahu 'anhuma dinyatakan shahih oleh Al-Albaniy dalah Ash-Shahih al-Jami' (7204)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Balad ayat 1: 1-3. Allah memulai surat ini dengan bersumpah (dengan) kota ini yaitu Mekkah Al Mukarramah dengan sumpah yang tegas. Dan firman-Nya لَآ sebagai peringatan dan penegasan. Kemudian Allah berkata : Dan engkau wahai Nabi tinggal di kota ini, meskipun kaum musyrikin menghalalkan berdusta atasmu, menyerangmu, menganggapmu gila, penyihir dan penyair. Kemudian Allah bersumpah dengan Adam dan anak keturunannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu negeri Mekah yang merupakan negeri yang paling utama secara mutlak, khususnya ketika Nabi shallallahu 'alaihi wa sallam berada di sana."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Balad Ayat 1",
    "description": "1-3. Aku bersumpah dengan negeri ini, yakni kota mekah, kota kelahiran nabi dan kota suci umat islam. Dan engkau, wahai nabi, bertempat tinggal di negeri mekah ini, membuatnya bertambah mulia. Dan demi pertalian bapak dan anaknya, demi adam dan anak cucunya. Manusia dengan kehendak Allah mengalami siklus dari kanak-kanak menuju dewasa, berkeluarga, beranak pinak, dan berakhir dengan kematian. Inilah fenomena kehidupan yang perlu direnungi"
  }
]