[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "8-10. Bukankah kami telah memberinya sepasang mata untuk melihat, Lidah dan dua bibir untuk berkata, Kami jelaskan baginya dua jalan: kebaikan dan keburukan?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Dan kami tunjukkan kepadanya jalan kebaikan dan jalan kebatilan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "10. Tuhannya telah menjelaskan jalan kebaikan dan keburukan, dan membedakan antara keduanya; serta memahamkanya hal yang berbahaya dan yang bermanfaat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. وَهَدَيْنٰهُ النَّجْدَيْنِ (Dan Kami telah menunjukkan kepadanya dua jalan) Yakni bukankah Kami telah menunjukkan kepadanya jalan kebaikan dan jalan keburukan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Penggunaan kata { النجدين } dalam surah ini adalah penyesuaian dengan keadaan surah yang awalannya menggunakan kata { كبد } yang masing-masing saling berkaitan dengan makna kesusah payahan atau usaha yang keras, adapun kata \" النجدين \" berarti dataran tinggi atau tanah yang tinggi, dan jika sesorang ingin mencapai puncaknya harus dengan usaha yang keras, sedangkan makna \" الكبد \" adalah keras atau susah yang dengan cara itu manusia diciptakan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10. Kami jelaskan kepadanya dua jalan yaitu kebaikan dan keburukan, dan kami perkenalkan kepadanya akibat dari masing-masing jalan itu agar bisa memilihnya?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami juga telah menunjukkan kepadanya} Kami telah menjalaskan kepadanya {dua jalan} dua jalan yaitu jalan Islam dan jalan kufur"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8-10. Kemudian Allah menegaskannya dengan berbagai nikmat seraya berfirman, “BUkankah Kami telah memberikan kepadanya dua buah mata, lidah, dan dua buah bibir,” untuk keindahan, penglihatan, untuk berbicara, dan manfaat-manfaat penting lainnya. Semua ini adalah kenikmatan dunia. Selanjutnya Allah berfirman tentang kenikmatan agama, “Dan Kami telah menunjukkan kepadanya dua jalan,” yaitu jalan kebaikan dan keburukan. Kami menjelaskan antara petunjuk dan kesesatan padanya. Kenikmatan-kenikmatan besar ini mengharuskan manusia untuk menunaikan hak-hak Allah serta bersukur atas segala nikmatNya, serta tidak digunakan untuk mendurhakai Allah."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ وَهَدَيْنَاهُ } Dan kami tunjukkan kepadanya { النَّجْدَيْنِ } dua jalan yang berbeda, yaitu jalan yang benar agar ia berjalan diatasnya, dan jalan yang sesat agar dia menjauh darinya, dikatakan dalam riwayat lain : yakni kami bimbing anak bayi yang baru lahir untuk meraih kedua susu ibunya, siapakah yang membimbingnya, dialah Allah yang maha pengasih lagi maha pemurah."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Dikatakan bahwa maknanya adalah kami telah menjelaskan kepadanya jalan kebaikan dan jalan keburukan. Pendapat yang kedua mengatakan وَهَدَيْنَاهُ النَّجْدَيْنِ Kami tunjukkan kepadanya jalan masuk makanan gizinya yaitu dua payudara, keduanya disebut najdaani (dua yang menonjol) karena keduanya menonjol di atas dada. Allah memberinya petunjuk saat ia masih bayi, ia tidak sadar, sejak ia keluar dilahirkan ia meminta asi, yang memberitahunya adalah Allah 'Azza Wa Jalla. Allah 'Azza wa Jalla menjelaskan karunianya ini kepada manusia dari sejak keluar, ia mendapat petunjuk untuk mendapatkan kedua asi, ketika di perut ibunya ia mendapatkan asupan dari jalan pusar, karena dia tidak dapat makan kecuali melalui jalan tersebut, seandainya dia makan melalui mulut maka nantinya dia akan kencing dan buang air besar, bagaimana ia bisa? Tetapi ia makan melalu pusar, mengalir darah kepadanya melaui darah ibunya kemudia menyebar ke urat-uratnya sehingga ia bisa hidup sampai datang waktunya Allah mengizinkannya untuk keluar."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Balad ayat 10: 8-10. Kemudian Allah menjelaskan dengan menyebutkan sebagaian nikmat yang telah ia berikan kepada manusia sesat dan tertipu, Allah berkata : Apakah ia tidak mengetahui bahwa Kami yang menciptakan kedua matanya sehingga ia dapat melihat denganya ? Dan lisannya yang memiliki dua bibir (atas dan bawah) yang ia berbicara dengannya ? Dan Kami telah beri petunjuk kepadanya menuju jalan kebaikan dan keburukan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni kebaikan dan kejahatan serta mana petunjuk dan mana kesesatan. Hal ini merupakan nikmat yang sangat besar yang seharusnya seorang hamba mau memenuhi hak-hak Allah Subhaanahu wa Ta'aala, bersyukur kepada-Nya atas nikmat-nikmat-Nya dan tidak menggunakan nikmat tersebut untuk bermaksiat kepada-Nya. Namun sayang, sebagaimana diterangkan pada ayat selanjutnya, ia tidak mau melakukannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Balad Ayat 10",
    "description": "8-10. Allah-lah yang berkuasa atasnya dan melihat setiap perbuatannya. Bukankah kami telah menjadikan untuknya sepasang mata untuk membantunya melihat sekeliling, dan lidah dan sepasang bibir untuk memungkinkannya mencecap, berbicara, dan memberi penjelasan kepada orang lain, dan bukankah kami juga telah menunjukkan kepadanya dua jalan, yaitu kebaikan dan keburukan, kebenaran dan kebatilan, melalui fitrah, akal, dan petunjuk lain' kami sudah memberinya petunjuk, lalu manusia itu sendiri yang akan memutuskan jalan hidupnya; apakah memilih jalan kesesatan atau kebenaran. 11. Kami telah menganugerahkan itu semua kepada manusia, tetapi mengapa dia tidak mau menempuh jalan yang mendaki dan sukar, padahal itu baik baginya' melakukan kebaikan tidak jarang memerlukan perjuangan dan kesabaran. Begitulah kehidupan dunia, semuanya terasa berat."
  }
]