[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mengapa dia tidak meringankan kesulitan akhirat dengan hartanya agar dia aman?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Dan dia diminta untuk melewati rintangan yang memisahkannya dengan Surga, agar dia melalui dan melewatinya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "11-12. Ini merupakan perumpamaan bagi perlawanan terhadap hawa nafsu dalam melakukan amal kebaikan. Mengapa manusia tidak berusaha melaksanakannya dan menghadapi segala kesulitan yang ada demi mencapai amal kebaikan yang dapat menyelamatkannya dari api neraka. Penyebutan ‘Aqabah’ pada perbuatan yang dapat mengantarkan kepada amal kebaikan karena Aqabah merupakan puncak dari suatu tempat. Dan apa yang kamu ketahui tentang menempuh ‘Aqabah’? Itu adalah perkara berat yang membutuhkan penuntun. Allah mengumpamakan pelaksanaan amal shalih dengan penempuhan puncak dari suatu tempat (Aqabah) karena itu merupakan hal yang berat untuk dilakukan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. وَهَدَيْنٰهُ النَّجْدَيْنِ (Dan Kami telah menunjukkan kepadanya dua jalan) Yakni bukankah Kami telah menunjukkan kepadanya jalan kebaikan dan jalan keburukan, yang juga dijelaskan dalam dua kitab sebelumnya dua jalan yang tinggi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Kemudian dia tidak menyeberangi atau melewati jalan yang sulit, yaitu memikul beban syariat dengan menjalankan kebaikan dan meninggalkan keburukan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka tidakkah sebaiknya dia menempuh} maka tidakkah sebaiknya dia melewati {jalan yang mendaki dan sukar} jalan keselamatan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11. Tapi orang itu tidak melakukannya, “tetapi dia tiada menempuh jalan yang mendaki lagi sukar,” yaitu menempuh dan menyebranginya, karena ia mengikuti hawa nafsunya, dan jalan tersebut amat sukar baginya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Setelah Allah menganugerahkan kepadanya berbagai kenikmatan didunia, Allah merngankan bebannya dengan harta itu didunia, dan menjelaskan kepadanya jalan yang benar dan jalan yang sesat, mengapa ia tidak bersusah payah dengan hartanya untuk meraih kebaikan yang lebih banyak di akhirat, karena sesungguhnya untuk meraih surga hatus dengan bersusah payah, yakni berjuangan dalam kebaikan wlaupun jalan yang ditempuh sangat menanjak tinggi. Sedangkan untuk meraih keburukan neraka, tidak memerlukan perjuangan dan susah payah, Rasulullah bersabda : (( حُفَّتِ الْجَنَّةُ بِالْمَكَارِهِ وَحُفَّتِ النَّارُ بِالشَّهَوَاتِ )) “Surga itu diliputi perkara-perkara yang dibenci (oleh jiwa) dan neraka itu diliputi perkara-perkara yang disukai syahwat.”(HR. Muslim) untuk meraih kenikmatan surga membutuhkan kesabaran yang ekstra, dan perjuangan yang besar dengan amalan shalih."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "فَلَا اقْتَحَمَ الْعَقَبَةَ \"Maka tidakkah sebaiknya (dengan hartanya itu) ia menempuh jalan yang mendaki lagi sukar?\" Maksudnya: Manusia yang sebelumnya mengatakan أَهْلَكْتُ مَالًا لُبَدًا \"Aku telah menghabiskan harta yang banyak\" فَلَا اقْتَحَمَ الْعَقَبَةَ Maksudnya: Tidakkah ia mendaki aqabah? Mendaki dengan berjalan dengan susah payah. Aqabah adalah jalan yang berada di pegunungan yang terjal, tidak diragukan lagi bahwa melintasi jalan seperti ini menyusahkan diri, tidak mungkin bisa dilampaui dan melakukannya kecuali yang mempunyai niat yang jujur dalam melampaui jalur sukar tersebut."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Balad ayat 11: Setelah Allah menyempurnakan kekuatan dan akal pada manusia pendosa dan keras kepala ini, ia tidak juga bersungguh-sungguh (memperbaiki) dirinya, menjauhi setan dan berinfak dengan harta serta beramal dengan amalan yang baik agar terhindar dari adzab, dan adzab itu (datang) pada kondisi hari kiamat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Karena ia lebih mengutamakan hawa nafsunya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Balad Ayat 11",
    "description": "Kami telah menganugerahkan itu semua kepada manusia, tetapi mengapa dia tidak mau menempuh jalan yang mendaki dan sukar, padahal itu baik baginya' melakukan kebaikan tidak jarang memerlukan perjuangan dan kesabaran. Begitulah kehidupan dunia, semuanya terasa berat. 12. Dan tahukah kamu apakah jalan yang mendaki dan sukar itu, sehingga manusia merasa berat untuk menempuhnya'."
  }
]