[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Adakah yang memberitahumu tentang kesulitan akhirat? dan apa yang membantu mengatasinya?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Tahukah kamu -wahai Rasul- apakah rintangan yang harus ia lewati agar bisa masuk Surga?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12 Apakah kamu mengetahui tentang apa itu menerjang rintangan?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apakah kamu tahu jalan yang mendaki dan sukar itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "12-16. Kemudian kesukaran di atas dijelaskan oleh FirmanNya, “(Yaitu) melepaskan budak dari perbudakan,” yakni membebaskannya dari perbudakan atau membantunya melunasi angsurannya untuk membebaskan diri dari perbudakan. Dan tentu lebih utama lagi membebaskan tawanan Muslim dari tangan orang-orang kafir. “Atau memberi makan pada hari kelaparan,” yaitu pada hari kelaparan hebat dengan memberi makanan pada saat diperlukan untuk orang yang memerlukan, “(kepada) anak yatim yang memiliki kerabat,” yakni menyatukan antara kondisi sebagai anak yatim, fakir, dan masih kerabat, “atau orang miskin yang sangat fakir,” yakni amat memerlukan uluran tangan dan terpaksa."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ وَمَا أَدْرَاكَ مَا الْعَقَبَةُ } Dan tahukah kamu apakah jalan yang mendaki itu ? , dan untuk meraih ketaqwaan itu harus dengan usaha yang tinggi ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَمَا أَدْرَاكَ مَا الْعَقَبَةُ \" Tahukah kamu apakah jalan yang mendaki lagi sukar itu?\" Ini adalah pertanyaan yang tujuannya menarik perhatian dan pengagungan juga, maksudnya: apa yang memberitahumu tentang jalan terjal yang disebutkan oleh Allah ini فَلَا اقْتَحَمَ الْعَقَبَةَ \"Maka tidakkah sebaiknya (dengan hartanya itu) ia menempuh jalan yang mendaki lagi sukar?\" Allah menjelaskannya dalam firman-Nya فَكُّ رَقَبَةٍ (13) أَوْ إِطْعَامٌ فِي يَوْمٍ ذِي مَسْغَبَةٍ (14) يَتِيمًا ذَا مَقْرَبَةٍ (15) أَوْ مِسْكِينًا ذَا مَتْرَبَةٍ (yaitu) melepaskan budak dari perbudakan, atau memberi makan pada hari kelaparan, (kepada) anak yatim yang ada hubungan kerabat, atau orang miskin yang sangat fakir."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Balad ayat 12: Allah berkata dengan sesuatu yang besar dan tegas : Dan tidaklah engkau mengetahui wahai manusia, urusan adzab ini, dan bagaimana cara agar terhindar darinya, dan tak diragukan lagi bahwa agar terhindar dari adzab ini adalah dengan keimanan kepada Allah, kepada Rasul ﷺ dan memperbanyak amalan yang shalih."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Balad Ayat 12",
    "description": "Dan tahukah kamu apakah jalan yang mendaki dan sukar itu, sehingga manusia merasa berat untuk menempuhnya' 13-16. Jalan yang mendaki dan sukar itu adalah melepaskan hamba sahaya dari perbudakan atau membantunya untuk membebaskan diri, karena perbudakan tidak sesuai dengan nilai-nilai kemanusiaan, atau memberi makan pada hari terjadi kelaparan kepada orang yang sangat membutuhkannya, yakni kepada anak yatim yang ada hubungan kerabat sehingga dia akan mendapat dua pahala kebaikan sekaligus, yakni pahala sedekah dan silaturrahim, atau kepada orang miskin yang sangat fakir. Kepedulian kepada anak yatim dan orang miskin adalah akhlak yang sangat terpuji, namun butuh sifat kedermawanan agar seseorang bisa melakukannya."
  }
]