[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Yaitu memerdekakan hamba sahaya yang beriman dari cengkraman perbudakan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "13. Yaitu membebaskan budak baik laki-laki maupun perempuan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "13-17. Yakni usaha untuk melaksanakan berbagai amal kebaikan; di antaranya memerdekakan budak yang beriman dari belenggu perbudakan; memberi makanan di saat terjadi kelaparan dan krisis makanan, pada masa seperti ini kepelitan seseorang akan terlihat karena takut jatuh miskin, sehingga memberi bantuan makanan pada masa seperti ini memiliki keutamaan yang besar, dan ini merupakan bentuk ‘Menempuh Aqabah’, dan di bawah derajat Aqabah ini terdapat beberapa tingkatan yang berbeda-beda. Kemudian menyalurkan makanan itu bagi anak yatim yang masih memiliki hubungan kekerabatan, atau orang miskin yang tidak memiliki apapun bahkan alas tidur di atas tanah. Orang yang menghendaki amal baik ini juga termasuk orang-orang beriman yang hanya menyembah kepada Allah, dan senantiasa saling berwasiat kepada sesama untuk bersabar dalam melakukan ketaatan dan dalam menjauhi kemaksiatan, serta saling berpesan untuk saling mengasihi."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "13. فَكُّ رَقَبَةٍ ((yaitu) melepaskan budak dari perbudakan) Yakni memerdekakan budak laki-laki atau perempuan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13. Sesungguhnya itu adalah membebaskan (belenggu) di leher atau membebaskannya (budak) dari ikatan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "(yaitu) melepaskan} membebaskan {budak"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "12-16. Kemudian kesukaran di atas dijelaskan oleh FirmanNya, “(Yaitu) melepaskan budak dari perbudakan,” yakni membebaskannya dari perbudakan atau membantunya melunasi angsurannya untuk membebaskan diri dari perbudakan. Dan tentu lebih utama lagi membebaskan tawanan Muslim dari tangan orang-orang kafir. “Atau memberi makan pada hari kelaparan,” yaitu pada hari kelaparan hebat dengan memberi makanan pada saat diperlukan untuk orang yang memerlukan, “(kepada) anak yatim yang memiliki kerabat,” yakni menyatukan antara kondisi sebagai anak yatim, fakir, dan masih kerabat, “atau orang miskin yang sangat fakir,” yakni amat memerlukan uluran tangan dan terpaksa."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Salah satu diantara jalan yang susah ditempuh adalah bersedekah, harta yang telah dikumpulkan dengan susah payah, juga akan terasa sulit untuk dikeluarkan, terlebih lagi jika dikeluarkan untuk ketaatan kepada Allah, tetapi sangat mudah jika dikeluarkan untuk kemasiatan, begitulah manusia. { فَكُّ رَقَبَةٍ } Dan diantara contoh mengeluarkan harta dijalan Allah adalah dengan membebaskan seorang budak, dengan niat mendekatan diri kepada Allah, membebaskan budak juga termasuk amalan yang tinggi pahalanya, atau dengan cara . Memerdekakan karena mukatabah, yaitu memerdekakan karena keinginan budak sendiri, dengan cara membayar imbalan yang telah disepakati oleh tuan dan budak secara berangsur. Allah berfirman : { وَالَّذِينَ يَبْتَغُونَ الْكِتَابَ مِمَّا مَلَكَتْ أَيْمَانُكُمْ فَكَاتِبُوهُمْ إِنْ عَلِمْتُمْ فِيهِمْ خَيْرًا ۖ وَآتُوهُمْ مِنْ مَالِ اللَّهِ الَّذِي آتَاكُمْ ۚ} ( dan jika hamba sahaya yang kamu miliki menginginkan perjanjian (kebebasan), hendaklah kamu buat perjanjian kepada mereka, jika kamu mengetahui ada kebaikan pada mereka, dan berikanlah kepada mereka sebagian dari harta Allah yang di karuniakan-Nya kepadamu ) [ An Nur : 33 ] Dan diantara macam memerdekakan budak adalah Memerdekakan budak atas tanggungan daulah/Negara, Ini termasuk sarana optimal dalam memerdekakan budak, karena negara yang turun langsung dan menghandle dalam memerdekakan budak. Islam telah menetapakan bagi negara dana khusus yang } ( Sesungguhnya zakat itu hanyalah untuk orang-orang fakir, orang miskin, amil zakat, yang dilunakkan hatinya (muallaf), untuk (memerdekakan) hambasahaya, untuk membebaskan orang-orang berutang, untuk jalan Alllah dan untuk orang yang sedang dalam perjalanan, sebagai kewajiban dari Allah. Dan Allah maha mengetahui, maha bijaksana ) [ At Taubah : 60 ] ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Firman-Nya فَك رَقَبَة adalah khobar yang tersembunyi, yaitu هيَ فك رقبة hiya fakku raqabah \" (Aqabah) Itu adalah membebaskan budak\" Melepaskan budak memiliki dua makna: Makna yang pertama: Melepaskannya dari status budak, yaitu dengan cara seseorang memerdekakan budak-budak yang menjadi miliknya atau milik orang lain yang ia beli kemudian ia merdekakan. Makna yang kedua: Melepaskan budak dari penawanan, sesungguhnya membebaskan tawanan-tawanan perang di antara perbuatan yang paling utama di sisi Allah 'Azza Wa Jalla, bisa jadi tawanan-tawanan perang tidak akan dibebaskan oleh musuh kecuali dengan membayar tebusan harta, dan bisa jadi jumlah tebusan yang diminta sangat besar tidak mampu dilakukan kecuali yang memiliki keimanan yang kuat kepada Allah 'Azza Wa Jalla bahwa Allah akan menggantikannya infaknya itu atau memberikan pahala atas sedekahnya itu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Balad ayat 13: 13-16. Allah menjelaskan urusan bagi manusia yang berhasil menghindar dari adzab, Allah berkata : Sesungguhnya keberhasilan mengindar dari adzab yaitu dengan melepaskan jeratan tali (dosa) menuju kepada Allah, dengan kata lain melepaskan penyembahan (kepada slain Allah) atau amalan-amalan (Su’u) serta kokoh di atas kesulitan. Dan memberikan makan pada orang faqir (untuk selamat) dihari yang sulit dan kelaparan terjadi dimana-mana. Dan memberi makan disini (mungkin) ia berikan kepada anak yatim yang tidak memiliki bapak dan belum sampai usia remaja serta seakan-akan (yang memberi) menjadi (seperti) saudaranya. Atau memberikan kepada orang miskin yang sangat membutuhkan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Baik dengan memerdekakannya atau membantu agar ia (budak) dapat melunasi pemerdekaan dirinya kepada tuannya. Yang lebih patut lagi adalah memerdekakan tawanan yang muslim yang ditangkap oleh orang kafir."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Balad Ayat 13",
    "description": "13-16. Jalan yang mendaki dan sukar itu adalah melepaskan hamba sahaya dari perbudakan atau membantunya untuk membebaskan diri, karena perbudakan tidak sesuai dengan nilai-nilai kemanusiaan, atau memberi makan pada hari terjadi kelaparan kepada orang yang sangat membutuhkannya, yakni kepada anak yatim yang ada hubungan kerabat sehingga dia akan mendapat dua pahala kebaikan sekaligus, yakni pahala sedekah dan silaturrahim, atau kepada orang miskin yang sangat fakir. Kepedulian kepada anak yatim dan orang miskin adalah akhlak yang sangat terpuji, namun butuh sifat kedermawanan agar seseorang bisa melakukannya"
  }
]