[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "14-16. Atau memberi makan pada satu hari yang terjadi kelaparan berat padanya. Kepada anak yatim, yaitu yang anak bapaknya wafat saat dia kecil,dari kerabat sehingga dia menyatukan keutamaan sedekah dan silaturahmi. Atau orang miskin yang tidak punya apapun."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Atau memberi makan saat terjadi kelaparan, saat makanan sulit didapat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "14. أَوْ إِطْعٰمٌ فِى يَوْمٍ ذِى مَسْغَبَةٍ (atau memberi makan pada hari kelaparan) Yakni ketika terjadi kelaparan, karena krisis makanan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14 Atau memberi makan seseorang pada hari saat dia lapar"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Atau memberi makan pada hari terjadi kelaparan} kelaparan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "12-16. Kemudian kesukaran di atas dijelaskan oleh FirmanNya, “(Yaitu) melepaskan budak dari perbudakan,” yakni membebaskannya dari perbudakan atau membantunya melunasi angsurannya untuk membebaskan diri dari perbudakan. Dan tentu lebih utama lagi membebaskan tawanan Muslim dari tangan orang-orang kafir. “Atau memberi makan pada hari kelaparan,” yaitu pada hari kelaparan hebat dengan memberi makanan pada saat diperlukan untuk orang yang memerlukan, “(kepada) anak yatim yang memiliki kerabat,” yakni menyatukan antara kondisi sebagai anak yatim, fakir, dan masih kerabat, “atau orang miskin yang sangat fakir,” yakni amat memerlukan uluran tangan dan terpaksa."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ أَوْ إِطْعَامٌ } Atau memberi makan { فِي يَوْمٍ ذِي مَسْغَبَةٍ } kepada orang yang pada hari tertimpa musibah kelaparan yang sangat berat, dan ini termasuk amalan yang memiliki keutamaan yang tinggi dalam islam."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "أَوْ إِطْعَامٌ فِي يَوْمٍ ذِي مَسْغَبَةٍ \" atau memberi makan pada hari kelaparan,\" أو [Aw -atau-] untuk menunjukkan macam bentuk (amalan lain). Maksudnya: Bisa jadi إِطْعَامٌ فِي يَوْمٍ ذِي مَسْغَبَةٍ Maknanya: Masa terjadinya kelaparan, karena terkadang manusia tertimpa wabah kelaparan, baik karena sedikitnya hasil pertanian, atau dikarenakan wabah penyakit yang menimpa tubuh mereka. Manusia makan namun tidak kenyang, dan ini pernah terjadi di negeri-negeri Najed, dan barangkali etrjadi juga di negeri lainnya, orang-orang makan namun mereka tidak merasa kenyang. Seorang memakan sepuluh porsi namun ia tidak merasa kenyang, mereka mati kelaparan di pasar-pasar, mereka mati kelaparan bergelimpangan di pasar-pasar. Wabah kelaparan seperti ini, atau sedikitnya hasil pertanian karena pohon-pohon tidak berbuah, kebun-kebin tani tidak tumbuh sehingga hasilnya pun sedikit dan terjadilah kelaparan, dan orang-orang mati kelaparan, barang kali mereka akan meninggalkan negeri mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Balad ayat 14: 13-16. Allah menjelaskan urusan bagi manusia yang berhasil menghindar dari adzab, Allah berkata : Sesungguhnya keberhasilan mengindar dari adzab yaitu dengan melepaskan jeratan tali (dosa) menuju kepada Allah, dengan kata lain melepaskan penyembahan (kepada slain Allah) atau amalan-amalan (Su’u) serta kokoh di atas kesulitan. Dan memberikan makan pada orang faqir (untuk selamat) dihari yang sulit dan kelaparan terjadi dimana-mana. Dan memberi makan disini (mungkin) ia berikan kepada anak yatim yang tidak memiliki bapak dan belum sampai usia remaja serta seakan-akan (yang memberi) menjadi (seperti) saudaranya. Atau memberikan kepada orang miskin yang sangat membutuhkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Balad Ayat 14",
    "description": "13-16. Jalan yang mendaki dan sukar itu adalah melepaskan hamba sahaya dari perbudakan atau membantunya untuk membebaskan diri, karena perbudakan tidak sesuai dengan nilai-nilai kemanusiaan, atau memberi makan pada hari terjadi kelaparan kepada orang yang sangat membutuhkannya, yakni kepada anak yatim yang ada hubungan kerabat sehingga dia akan mendapat dua pahala kebaikan sekaligus, yakni pahala sedekah dan silaturrahim, atau kepada orang miskin yang sangat fakir. Kepedulian kepada anak yatim dan orang miskin adalah akhlak yang sangat terpuji, namun butuh sifat kedermawanan agar seseorang bisa melakukannya"
  }
]