[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "14-16. Atau memberi makan pada satu hari yang terjadi kelaparan berat padanya. Kepada anak yatim, yaitu yang anak bapaknya wafat saat dia kecil,dari kerabat sehingga dia menyatukan keutamaan sedekah dan silaturahmi. Atau orang miskin yang tidak punya apapun."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Atau memberi makan kepada orang fakir yang tidak mempunyai apa-apa."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "16. أَوْ مِسْكِينًا ذَا مَتْرَبَةٍ (atau kepada orang miskin yang sangat fakir) Yakni dia tidak memiliki apapun, seakan-akan dia telah tergeletak di atas tanah karena kemiskinannya. Mujahid berpendapat: ia adalah orang yang tidak memiliki pakaian atau lainnya yang dapat melindungi badannya dari tanah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16 Atau memberi makan orang miskin yang tidak memiliki apapun seakan-akan dia meletakkan tangannya di tanah sebagai kiasan tentang kefakirannya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{atau orang miskin yang sangat membutuhkan} sangat membutuhkan, sehingga seakan-akan dia sudah dekat dengan tanah karena kefakirannya itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "12-16. Kemudian kesukaran di atas dijelaskan oleh FirmanNya, “(Yaitu) melepaskan budak dari perbudakan,” yakni membebaskannya dari perbudakan atau membantunya melunasi angsurannya untuk membebaskan diri dari perbudakan. Dan tentu lebih utama lagi membebaskan tawanan Muslim dari tangan orang-orang kafir. “Atau memberi makan pada hari kelaparan,” yaitu pada hari kelaparan hebat dengan memberi makanan pada saat diperlukan untuk orang yang memerlukan, “(kepada) anak yatim yang memiliki kerabat,” yakni menyatukan antara kondisi sebagai anak yatim, fakir, dan masih kerabat, “atau orang miskin yang sangat fakir,” yakni amat memerlukan uluran tangan dan terpaksa."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Atau kepada orang miskin yang sama sekali tidak memiliki apa-apa, dalam segi istilah fiqh \"miskin\" itu lebih tinggi diatas \"faqir\" , orang miskin itu masih memiliki sedikit harta yang bisa dia manfaatkan, akan tetapi Faqir adalah orang sama sekali tidak memiliki harta yang bisa ia gunakan, tetapi yang dimaksud dalam ayat ini adalah { أَوْ مِسْكِينًا ذَا مَتْرَبَةٍ } yaitu orang miskin yang tidak memiliki harta apapun, yakni faqir yang membutuhkan bantuan darurat. Maka perhatikanlah sedekamu agar kamu mengeluarkannya untuk mereka lebih awal kemudian selainnya, dari 4 ayat sebelumnya merupakan contoh dari kerja keras seorang hamba dalam meraih kebaikan, dan kebanyakan dari manusia belum sampai kepada derajat ini."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "أَوْ مِسْكِينًا ذَا مَتْرَبَةٍ Maksudnya: Atau memberi makan orang miskin yang sangat melarat saat hari kelaparan, orang miskin adalah orang yang tidak memperoleh makanan pokok untuk dirinya dan juga keluarganya. Al-Matrabah: Artinya tempat untuk tanah. Maknanya adalah orang miskin yang tidak ada di kedua tangannya kecuali tanah, sudah dimaklumi bahwa jika dikatakan tentang seseorang: ia tidak mempuanyai apa pun kecuali tanah, maknanya adalah ia sangat fakir, ia tidak punya makanan, ia tidak punya pakaian, tidak punya harta, ia orang miskin yang sangat melarat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Balad ayat 16: 13-16. Allah menjelaskan urusan bagi manusia yang berhasil menghindar dari adzab, Allah berkata : Sesungguhnya keberhasilan mengindar dari adzab yaitu dengan melepaskan jeratan tali (dosa) menuju kepada Allah, dengan kata lain melepaskan penyembahan (kepada slain Allah) atau amalan-amalan (Su’u) serta kokoh di atas kesulitan. Dan memberikan makan pada orang faqir (untuk selamat) dihari yang sulit dan kelaparan terjadi dimana-mana. Dan memberi makan disini (mungkin) ia berikan kepada anak yatim yang tidak memiliki bapak dan belum sampai usia remaja serta seakan-akan (yang memberi) menjadi (seperti) saudaranya. Atau memberikan kepada orang miskin yang sangat membutuhkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Balad Ayat 16",
    "description": "13-16. Jalan yang mendaki dan sukar itu adalah melepaskan hamba sahaya dari perbudakan atau membantunya untuk membebaskan diri, karena perbudakan tidak sesuai dengan nilai-nilai kemanusiaan, atau memberi makan pada hari terjadi kelaparan kepada orang yang sangat membutuhkannya, yakni kepada anak yatim yang ada hubungan kerabat sehingga dia akan mendapat dua pahala kebaikan sekaligus, yakni pahala sedekah dan silaturrahim, atau kepada orang miskin yang sangat fakir. Kepedulian kepada anak yatim dan orang miskin adalah akhlak yang sangat terpuji, namun butuh sifat kedermawanan agar seseorang bisa melakukannya. 17. Kemudian, bila dia mau menempuh jalan yang mendaki dan sukar itu maka dia termasuk orang-orang yang beriman dengan kukuh dan saling berpesan untuk bersabar dalam berbuat baik, menjauhi maksiat, serta menghadapi kesusahan hidup, dan saling berpesan untuk berkasih sayang kepada sesama makhluk."
  }
]