[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian disamping apa yang dilakukannya diatas,dia termasuk orang orang yang mengikhlaskan iman kepada Allah,sebagian dari mereka berwasiat kepada sebagian lainnya agar sabar menjalankan ketaatan kepada Allah dan menjauhi kemaksiatan kepadaNYA,serta mereka saling berwasiat agar berkasih sayang dengan sesama makhluk Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Kemudian dia juga termasuk orang yang beriman kepada Allah, saling berwasiat satu sama lain untuk sabar melakukan ketaatan, sabar tidak melakukan maksiat dan sabar menghadapi musibah, serta saling berwasiat satu sama lain agar berkasih sayang di antara sesama hamba Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "17. ثُمَّ كَانَ مِنَ الَّذِينَ ءَامَنُوا۟ (Dan dia (tidak pula) termasuk orang-orang yang beriman) Yakni kebaikan-kebaikan tersebut hanya bermanfaat bagi orang yang beriman yang mengerjakannya kerena mengharap keridhaan Allah. وَتَوَاصَوْا۟ بِالصَّبْرِ(dan saling berpesan untuk bersabar) Yakni bersabar dalam ketaatan kepada Allah dan dari kemaksiatan, serta bersabar atas musibah dan cobaan yang menimpanya. وَتَوَاصَوْا۟ بِالْمَرْحَمَةِ(dan saling berpesan untuk berkasih sayang) Yakni untuk mengasihi hamba-hamba Allah yang lain."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ وَتَوَاصَوْا بِالصَّبْرِ } Kesabaran adalah salah satu bagian yang paling utama untuk mewujudkan akhlak yang baik dalam diri setiap insan, karena sesungguhnya untuk meraih kesempurnaan akhlak yang terpuji seseorang harus mampu menghalangi dirinya dari kepatuhan terhadap syahwat dan buruknya nafsu, untuk mewujudkan hal itu harus dengan kerja keras yang dikuatkan oleh kesabaran yang ekstra, sehingga kemuliaan akhlak yang baik menjadi hak milik bagi mereka yang ridho terhadap dirinya untuk menyelisihi syahawatnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17. Agar (dia) termasuk orang-orang yang beriman kepada Allah dan RasulNya, dan saling mengingatkan dengan sabar dalam ketaatan, menghindari kemaksiatan dan mengasihi manusia atau saling saling mengasihi satu sama lain. Kata {Tsumma} berfungsi untuk menunjukkan tahapan sesuatu yang berurutan, yaitu setelah melaksanakan apa yang telah disebutkan (sebelumnya), seseorang akan menjadi orang mukmin, sehingga amal perbuatannya diterima"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kemudian dia juga termasuk orang-orang yang beriman dan saling berpesan untuk bersabar serta saling berpesan untuk berkasih sayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17. “Dan dia (tidak pula) termasuk orang-orang yang beriman,” dan mengerjakan perbuatan-perbuatan baik. Yakni, beriman dengan hati mereka kepada apa-apa yang wajib diimani dan mengerjakan amal baik dengan anggota badan. Dan semua perkataan dan perbuatan wajib dan yang dianjurkan termasuk dalam hal ini. “Dan saling berpesan dengan kesabaran,” untuk taat pada Allah dan menjauhi kemaksiatan serta bersabar atas ketentuan-ketentuanNya yang tidak berkenan, dengan saling mendorong satu sama lain untuk tunduk pada ketentuan Allah serta menunaikannya dengan sempurna, lapang dada serta dengan ketenangan jiwa. “Dan saling berpesan dengan kasih sayang” terhadap manusia dengan membantu mereka yang memerlukan uluran tangan, mengajari mereka yang tidak tahu, menunaikan apa saja yang mereka perlukan dari segala sisinya, serta membantu mereka untuk kepentingan-kepentingan dunia dan akhirat, mencintai untuk mereka seperti halnya untuk diri sendiri serta membenci atas mereka seperti halnya atas diri sendiri."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ ثُمَّ كَانَ مِنَ الَّذِينَ آمَنُوا } Kemudian jika dia mau melewati jalan yang sukar itu, maka dia termasuk golongan orang-orang yang beriman { وَتَوَاصَوْا بِالصَّبْرِ وَتَوَاصَوْا بِالْمَرْحَمَةِ } dan golongan orang-orang yang saling mengajak kepada kesabaran dan saling mengajak kepada kebaikan, dan iman yang benar adalah dengan menyatakannya dengan lisan, dan meyakininya dengan hati, serta mengamalkannya dengan tindakan, dalam isitlah para ulama iman adalah : diucapkan dengan lisan , membenarkan dengan hati, dan diamalkan dengan tindakan (perbuatan) . Dan bukanlah iman itu hanya diucapkan dilisan saja, dan tidak termasuk didalamnya tindakan, inilah keyakinan kelompok murji'ah yang sesat, dan iman itu memiliki beberapa cabang, RAsulullah bersabda : (( عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ قَالَ رَسُوْلُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : الْإِيمَانُ بِضْعٌ وَسَبْعُونَ، أَوْ بِضْعٌ وَسِتُّونَ شُعْبَةً، فَأَفْضَلُهَا قَوْلُ : لَا إِلَهَ إِلَّا اللَّهُ، وَأَدْنَاهَا إِمَاطَةُ الْأَذَى عَنِ الطَّرِيقِ، وَالْحَيَاءُ شُعْبَةٌ مِنَ الْإِيمَانِ )) Dari Abu Hurairah Radhiyallahu anhu, ia berkata, “Rasûlullâh Shallallahu ‘alaihi wa sallam bersabda, ‘Iman itu ada tujuh puluh cabang lebih, atau enam puluh cabang lebih. Yang paling utama yaitu perkataan Lâ ilâha illallâh, dan yang paling ringan yaitu menyingkirkan gangguan dari jalan.Dan malu itu termasuk bagian dari iman\" . [ Diriwayatkan Oleh Imam Bukhori ] , sertiap amal shalih adalah termasuk keimanan, dan diantaranya ada yang paling ringan. { وَتَوَاصَوْا بِالصَّبْرِ } Tidak cukup jika seseorang melakukan amal shalih dan beriman, tapi juga harus mengajak orang lain kepada keimanan dan ketaqwaan kepada Allah, mengajak orang lain kepada agama Allah, kepada tauhid, mengajak orang lain untuk beribadah hanya untuk Allah dan menjauh dari kesyirikan, menyerukan kepada amalan-amalan sunnah, selain dari pada perkara-perkara di atas hal yang perlu diperhatikan oleh setiap muslim adalah kesabaran dalam menjalankan perintah Allah itu, sabar dalam menjauh dari segala larangan, dan sabar atas cobaan yang diterima. { وَتَوَاصَوْا بِالْمَرْحَمَةِ } Kemudian mengajak kepada kasih sayang sesama mereka, juga kasih sayang kepada orang lemah dan miskin."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "ثُمَّ كَانَ مِنَ الَّذِينَ آمَنُوا وَتَوَاصَوْا بِالصَّبْرِ وَتَوَاصَوْا بِالْمَرْحَمَةِ ثُمَّ كَانَ Maksudnya: Kemudian setelah itu, ia tidak sekedar berbuat baik kepada anak-anak yatim dan orang-orang miskin saja, ia juga beriman. Ia beriman kepada segala perkara yang wajib dia imani. Rasulullah shallallaahu 'alaihi wa sallam telah menjelaskan perkara yang harus diimani, beliau menjawab ketika Jibril bertanya kepadanya tentang keimanan: الإيْماَنُ أَنْ تُؤْمِنَ بِاللهِ وَمَلاَئِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ وَالْيَومِ الْآخِرِ وَالْقَدَرِ خَيْرِهِ وَشَرِّهِ \" Keimanan adalah, engkau beriman kepada Allah, malaikat-malaikat-Nya, kitab-kitab-Nya, rasul-rasul-Nya, hari akhir dan taqdir baik dan buruknya\"(1) Firman-Nya: وَتَوَاصَوْا بِالصَّبْرِ Maknanya: Mereka saling mewasiatkan satu sama lainnya dengan kesabaran. Kesabaran ada tiga macam: kesabaran dalam ketaatan kepada Allah, kesabaran dari kemaksiatan kepada Allah dan bersabar atas taqdir Allah yang pedih. Mereka bersabdar dan saling mewasiatkan untuk bersabar dengan tiga macam kesabaran ini, bersabar dalam ketaatan kepada Allah , bersabar meninggalkan kemaksiatan kepada Allah dan bersabar atas takdir ketentuan Allah yang pahit. Tiga jenis kesabaran ini terkumpul pada jiwa para rasul 'alaihimussholaatu wassalaam dan para pengikutnya. Inilah Rasulullah shallallaahu 'alaihi wa sallam, yang bersabar dalam ketaatan kepada Allah, berjuang di jalan Allah, berdakwah menyeru kepada Allah, beliau disakiti diganggu dengan pukulan, hingga orang-orang musyrik berkeinginan untuk membunuhnya. Walau pun demikian beliau bersabar dan berharap pahala, beliau juga bersabar dalam meninggalkan kemaksiatan kepada Allah, ia tidak mungkin ingkar janji kepada siapa pun, berdusta kepada siapa pun, mengkhianati siapa pun, beliau juga bertaqwa kepada Allah sampai batas ujung kesanggupannya. Beliau juga bersabar atas ketentuan-ketentuan taqdir Allah, betapa seringnya beliau disakiti karena Allah 'Azza Wa Jalla karena mentaati Allah. Bukankah Quraisy telah menyakitinya, sampai suatu ketika ketika mereka melihat beliau sujud di depan ka'bah, menyuruh agar menaruh kotoran unta di atas punggungnya, sedangkan beliau sedang bersujud?! Beliau tetap bersabar atas itu semua. Nabi Yusuf 'alaissholaatu wassalaam, beliau juga bersabar atas ketentuan taqdir Allah, beliau dilempar kedalam sumur, beliau disakiti karena taat kepada Allah, dimasukkan ke penjara . walaupun demikian beliau tetap bersabar dan mengharap pahala, tidak berkeluh kesah dan tidak mengingkari apa yang telah terjadi padanya. Firman-Nya وَتَوَاصَوْا بِالْمَرْحَمَةِ maknanya: Saling mewasiatkan untuk saling menyayangi satu sama lain. Kasih saying manusia bisa kepada hewan-hewan dan bisa kepada sesamanya, ia menyayangi bapak-bapaknya, ibu-ibunya, anak-anak laki-laki dan perempuannya, saudara-saudara laki-laki dan perempuannya, paman-pamannya, bibi-bibinya dan begitu seterusnya, ia pun menyayangi semua manusia, ia juga menyayangi hewan ternak. Ia menyayangi untanya, kudanya, keledainya, sapinya, kambingnya dan hewan lainnya, Nabi shallallaahu 'alaihi wa sallam bersabda: ارْحَمُوا مَنْ فِي الأَرْضِ يَرْحَمُكُمْ مَنْ فِي السَّماَءِ \"Sayangilah yang ada di bumi Maka yang dilangit akan menyayangi kalian\"(2) (1) dikeluarkan oleh Bukhari (50) dan Muslim (9) dari hadits abu hurairoh radhiyallaah 'anhu. (2) Dikeluarkan Abu Daud (4941) dan Tirmidziy (1924) dari hadits Abdullah Bin Umar Radhiyallaahu 'anhuma, dinyatakan shahih oleh Al-Albaniy dalam shahih al-Jami' (3522)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Balad ayat 17: Allah menjelaskan bahwa wajib bagi pendosa ini jika menginginkan menebus dosa-dosanya agar mengerjakan amalan-amalan shalih dan juga beriman kepada Allah dan Rasul-Nya ﷺ, sebab jika amalan shalih tanpa keimanan tidak akan bermanfaat atas amalan tersebut dan bagi yang mengerjakannya. (Selanjutnya) adalah bersabar dan berwasiat kepada selain dirinya untuk bersabar di atas ketaatan kepada Allah, bersabar agar tidak bermaksiat kepada Allah, bersabar atas takdir-takdir Allah yang tidak disenangi, berwasiat pula kepada selain dirinya untuk berkasih sayang kepada sesame makhluk dan berbuat baik kepada mereka semua."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan hati mereka kepada semua yang wajib diimani, dan mengerjakan amal saleh dengan anggota badan mereka baik yang berupa ucapan maupun perbuatan; yang wajib maupun yang sunat. Untuk tetap taat kepada Allah, menjauhi maksiat dan menerima tanpa keluh kesah takdir Allah yang perih serta melakukan semua itu dengan lapang dada dan jiwa yang tenang. Kepada makhluk, seperti memberi orang yang membutuhkan, mengajarkan orang yang tidak tahu, membantu mereka untuk maslahat agama dan dunia mereka, mencintai kebaikan untuk mereka seperti mencintai kebaikan untuk dirinya sendiri, membenci sesuatu yang tidak disukai menimpa mereka sebagaimana ia membenci hal itu menimpa dirinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Balad Ayat 17",
    "description": "Kemudian, bila dia mau menempuh jalan yang mendaki dan sukar itu maka dia termasuk orang-orang yang beriman dengan kukuh dan saling berpesan untuk bersabar dalam berbuat baik, menjauhi maksiat, serta menghadapi kesusahan hidup, dan saling berpesan untuk berkasih sayang kepada sesama makhluk. 18. Apabila mereka berkenan menempuh jalan yang sukar, beriman, dan saling berpesan untuk bersabar dan berkasih sayang, mereka adalah golongan kanan yang akan menemui kebahagiaan di akhirat berupa surga dengan segala kenikmatan di dalamnya."
  }
]