[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang yang melakukan hal hal diatas, mereka adalah golongan kanan, yang digiring kearah kanan surga."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Orang-orang yang mempunyai sifat-sifat tersebut adalah golongan kanan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "18. Perbuatan-perbuatan tersebut merupakan bagian dari perbuatan orang-orang beriman yang akan menerima kitab catatan amalnya dengan tangan kanan, dan dimasukkan ke dalam surga. Dan sisi kanan merupakan sisi yang mulia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "18. أُو۟لٰٓئِكَ أَصْحٰبُ الْمَيْمَنَةِ (Mereka itu adalah golongan kanan) Yakni termasuk golongan kanan. Lihat surat al-Waqi’ah: 26-40."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "18. Mereka yang memiliki ciri-ciri yang telah disebutkan adalah orang-orang golongan kanan yang mengambil buku catatan amal mereka menggunakan tangan kanan pada hari kiamat dan memperoleh surga"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka itulah golongan kanan} kanan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "18. ‘Mereka itu,” yakni orang-orang yang menunaikan sifat-sifat tersebut adalah mereka yang diberi taufik oleh Allah untuk menempuh jalan yang sukar itu. Mereka adalah “golongan kanan,” karena mereka menunaikan hak-hak Allah dan hak-hak manusia yang diperintahkan serta meninggalkan apa pun yang dilarang. Inilah tanda-tanda kebahagiaan."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Mereka itulah orang-orang yang termasuk dalam golongan kanan, karena pada hari kiamat manusia akan terbagi menjadi 3 golongan : { وَكُنْتُمْ أَزْوَاجًا ثَلَاثَةً , فَأَصْحَابُ الْمَيْمَنَةِ مَا أَصْحَابُ الْمَيْمَنَةِ , وَأَصْحَابُ الْمَشْأَمَةِ مَا أَصْحَابُ الْمَشْأَمَةِ , وَالسَّابِقُونَ السَّابِقُونَ } ( Dan kamu menjadi tiga golongan , Yaitu golongan kanan. Alangkah mulianya golongan kanan itu , Dan golongan kiri. Alangkah sengsaranya golongan kiri itu , Dan orang-orang yang beriman paling dahulu ) [ Al-Waqi'ah : 7-10 ] Golongan pertama, yang disebut ashab al yamin yang masing-masing diberi kitab dengan tangan kanan dan mendapat ridha dan pahala Allah yang abadi di surga. Golongan kedua, yang disebut ashab asy-syimal yang masing-masing diberi kitab dengan tangan kirinya dan mendapatkan murka dan siksa Allah yang abadi di neraka. Golongan ketiga, yang disebut al muqarrabun dan as-sabbiqun as-sabiqun yang didekati Allah di surga dan menyempurnakan kepada mereka rahmat dan bau harum."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "أُولَئِكَ أَصْحَابُ الْمَيْمَنَةِ \" Mereka (orang-orang yang beriman dan saling berpesan itu) adalah golongan kanan.\" Mereka yang disifati dengan sifat-sifat tersebut adalah golongan kanan, yang akan diberikan kitab-kitab amalan mereka dengan tangan kanan pada hari kiamat, Siapa saja yang menerima kitabnya dengan tangan kanan maka ia akan dihisab dengan hisab yang ringan, dan akan bertemu kembali dengan keluarganya dengan kebahagiaan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Balad ayat 18: Allah menjelaskan bahwa mereka yang mentaati Allah dan tidak menyangkal adanya adzab-Nya dan mereka mengerjakan amalan-amalan terpuji yang mulia, maka mereka adalah golongan kanan. Penghuni surga yag kekal di dalamnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Karena mereka mengerjakan perintah-perintah Allah, baik yang terkait dengan hak-hak-Nya maupun yang terkait dengan hak hamba-hamba-Nya, serta mereka tinggalkan larangan Allah Subhaanahu wa Ta'aala. Inilah tanda kebahagiaan dan keberuntungan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Balad Ayat 18",
    "description": "Apabila mereka berkenan menempuh jalan yang sukar, beriman, dan saling berpesan untuk bersabar dan berkasih sayang, mereka adalah golongan kanan yang akan menemui kebahagiaan di akhirat berupa surga dengan segala kenikmatan di dalamnya. 19. Dan sebaliknya, orang-orang yang kafir kepada ayat-ayat kami, baik dengan ucapan maupun tindakan, mereka itu adalah golongan kiri yang akan celaka dan menjumpai azab yang pedih."
  }
]