[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang yang kafir kepada al-qur’an, pada hari kiamat mereka digiring ke kiri ke api neraka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Dan orang-orang yang ingkar kepada ayat-ayat Kami yang diturunkan kepada Rasul Kami, adalah golongan kiri."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "19-20. Adapun orang-orang kafir akan diseret ke arah kiri pada hari kiamat menuju neraka, dan kiri merupakan sisi yang hina. Mereka akan ditarikkan dan di seret ke dalam neraka di atas wajah mereka, kemudian pintu-pintunya akan ditutup."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "19. هُمْ أَصْحٰبُ الْمَشْـَٔمَةِ (mereka itu adalah golongan kiri) Yakni golongan kiri yang merupakan penghuni neraka. Dan penjelasannya secara terperinci dapat dilihat pada surat al-Waqi’ah: 41-56."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19-20. Dan orang-orang yang menyangkal ayat-ayat kami, baik yang terkandung dalam Al-Qur’an atau di alam semesta, mereka adalah orang-orang golongan kiri yang mengambil buku catatan amal mereka menggunakan tangan kiri dan dimasukkan ke dalam neraka. Bagi mereka adalah neraka yang sangat mengerikan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Adapun orang-orang yang kufur pada ayat-ayat Kami, merekalah golongan kiri} kiri"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "19-20. “Dan orang-orang yang kafir kepada ayat-ayat Kami,” dengan mencampakkan hal-hal ini di balik punggung mereka ( tidak menghiraukan) dan tidak membenarkan Allah, tidak beriman padaNya, tidak melakukan amal baik dan tidak bersikap kasih sayang terhadap hamba-hamba Allah, mereka itulah “golongan kiri, mereka berada dalam neraka yang tertutup rapat,” yakni tertutup. Berada di tempat yang amat luas yang terbentang dari belakangnya agar pintu-pintunya tidak terbuka hingga mereka berada dalam kesempitan, kesedihan, dan kesusahan."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ وَالَّذِينَ كَفَرُوا بِآيَاتِنَا } Dan orang-orang yang telah kafir kepada ayat-ayat kami { هُمْ أَصْحَابُ الْمَشْأَمَةِ } mereka itulah golongan kiri yang akan diseret kedalam neraka, mereka mengatakan bahwa Al-Qur'an adalah dongeng yang menceritakan tentang orang-orang terdahulu, mereka juga mengataan bahwa Al-Qur'an tidak lain kecuali perkataaan manusia biasa, yakni perkataan Muhammad, mereka inilah yang akan dibinasakan didalam neraka."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَالَّذِينَ كَفَرُوا بِآيَاتِنَا \" Dan orang-orang yang kafir kepada ayat-ayat Kami,\" Maknanya: orang-orang yang menentang ayat-ayat kami هُمْ أَصْحَابُ الْمَشْأَمَةِ \"Mereka adalah golongan kiri\" Dhamir (kata ganti) Hum (mereka) berfungsi sebagai penegasan, seandainya di selain al-Quran dikatakan وَالَّذِينَ كَفَرُوا بِآيَاتِنَا أَصْحَابُ الْمَشْأَمَةِ (dengan meniadakan Hum) ini benar, namun dalam ayat ini didatangkan untuk menegaskan الْمَشْأَمَةِ Maksudnya adalah kiri atau buruk."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Balad ayat 19: Allah menjelaskan bahwa mereka yang mendustakan ayat-ayat Allah dan menolak kenabian Muhammad ﷺ, mereka adalah golongan kiri, atau mereka adalah golongan yang mengambil buku catatan amal merek dengan tangan kiri."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Menolak perkara-perkara yang telah disebutkan; tidak beriman kepada Allah dan tidak beramal saleh serta tidak sayang kepada hamba-hamba Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Balad Ayat 19",
    "description": "Dan sebaliknya, orang-orang yang kafir kepada ayat-ayat kami, baik dengan ucapan maupun tindakan, mereka itu adalah golongan kiri yang akan celaka dan menjumpai azab yang pedih. 20. Mereka berada dalam neraka yang ditutup rapat dari semua sisinya. Tidak ada jalan keluar bagi mereka dari neraka itu dan tidak pula mereka diberi kesempatan untuk sekadar beristirahat dari siksanya."
  }
]