[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Balasan mereka adalah jahanam yang tertutup rapat atas mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "20. Mereka berada dalam Neraka yang tertutup pada hari Kiamat, mereka disiksa di dalamnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "20. عَلَيْهِمْ نَارٌ مُّؤْصَدَةٌۢ (Mereka berada dalam neraka yang ditutup rapat) Yakni ditutup dan dikunci."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19-20. Dan orang-orang yang menyangkal ayat-ayat kami, baik yang terkandung dalam Al-Qur’an atau di alam semesta, mereka adalah orang-orang golongan kiri yang mengambil buku catatan amal mereka menggunakan tangan kiri dan dimasukkan ke dalam neraka. Bagi mereka adalah neraka yang sangat mengerikan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka berada dalam neraka yang ditutup rapat} tertutup"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "19-20. “Dan orang-orang yang kafir kepada ayat-ayat Kami,” dengan mencampakkan hal-hal ini di balik punggung mereka ( tidak menghiraukan) dan tidak membenarkan Allah, tidak beriman padaNya, tidak melakukan amal baik dan tidak bersikap kasih sayang terhadap hamba-hamba Allah, mereka itulah “golongan kiri, mereka berada dalam neraka yang tertutup rapat,” yakni tertutup. Berada di tempat yang amat luas yang terbentang dari belakangnya agar pintu-pintunya tidak terbuka hingga mereka berada dalam kesempitan, kesedihan, dan kesusahan."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Mereka akan ditempatkan didalam neraka yang ditutup rapat, dan mereka sekali-kali tidak akan mampu keluar dan meloloskan diri dari tempat itu, mereka tidak akan berharap bisa melewati pagar-pagar untuk keluar dari neraka itu, karena semuanya telah ditutup dengan rapat, tidak ada harapan untuk mereka, diatas neraka itu ada penjaga dari para Malaikat yang sangat bengis. Sedangkan orang-orang masuk kedalam neraka karena kemaksiatan tetapi tetap berada dalam tauhidnya kepada Allah, maka mereka akan dikeluarkan dari neraka itu dengan syaf'at dari Allah, yaitu setelah berakhirnya siksaan dengan terhapusnya semua dosa-dosanya. Adapun orang-orang yang kafir kepada Allah, medustakan firman-firman Nya, mendustakan Nabi-Nya, mereka akan kekal tinggal didalam neraka itu selamanya, Surah yang agung ini, dan semua surah dalam Al-Qur'an adalah mulia dan agung, sangat diajurkan untuk kita mentadabburinya, memikirkan tentang kekuasan Allah yang tertulis didalamnya, memahami arti dan maknanya secaa keseluruhan, sehingga setiap kita yang mempelajarinya dapat mengamalkan isi Al-Qur'an ini dengan baik."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "عَلَيْهِمْ نَارٌ مُؤْصَدَةٌ Maknanya: Mereka akan memasuki neraka yang tertutup, mereka tidak bisa keluar darinya, mereka tidak akan bisa mencari jalan keluar. Kita memohon kepada Allah agar menjadikan kita menjadi orang-orang yang beriman, beramal shalih , saling berwasiat dalam kesabaran dan saling berwasiat dengan kasih saying, sesungguhnya Dia Mahamendengar dan Mengabulkan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Balad ayat 20: Allah menjelaskan golongan kiri, Allah kabarkan bahwa mereka tempatnya di neraka yang bertingkat-tingkat dan terkunci rapat-rapat (di dalamnya), dan tidak dapat keluar darinya selama-lamanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sehingga mereka tidak dapat keluar darinya dan berada dalam kesempitan, penderitaan dan siksa, wal ‘iyaadz billah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Balad Ayat 20",
    "description": "Mereka berada dalam neraka yang ditutup rapat dari semua sisinya. Tidak ada jalan keluar bagi mereka dari neraka itu dan tidak pula mereka diberi kesempatan untuk sekadar beristirahat dari siksanya. 1. Demi matahari dan semburat sinarnya pada pagi hari. Penciptaan matahari, peredarannya pada poros dan orbitnya membuktikan kuasa Allah. Sinarnya yang terang dan panas sangat berman'faat bagi kehidupan manusia di bumi."
  }
]