[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-4. Allah bersumpah dengan negeri al-haram (yaitu Makkah). Dan kamu (wahai nabi) halal di negeri al-haram, kamu boleh melakukan apa yang kamu kehendaki padanya,dan tidak dihalalkan bagi nabi kecuali sesaat dari siang hari. Ayat ini merupakan kabar gembira bagi nabi sholallohu alaihi wasallam bahwa Allah akan menaklukan kota Makkah melalui beliau dan menghalalkan perang bagi beliau. Allah juga bersumpah dengan bapak manusia(adam) dan anak keturunannya, Sungguh kami menciptakan manusia dalam kelelahan dan kesulitan dalam menjani dunia."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Dan Allah bersumpah dengan bapak manusia, dan bersumpah dengan anak-anak turunannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. وَوَالِدٍ وَمَا وَلَدَ (dan demi bapak dan anaknya) Allah bersumpah dengan bapak dan anaknya, dengan Adam dan keturunannya serta dengan seluruh hewan dengan anaknya. Ini sebagai peringatan terhadap kebesaran tanda kekuasaan Allah serta hikmah dan ilmu-Nya pada proses keturunan dan perkembangbiakan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Aku juga bersumpah demi makhluk yang melahirkan dan makhluk-makhluk yang dilahirkan yang mengalami perkembang biakan, karena dengan perkembang biakan, suatu jenis (makhluk) dapat bertahan hidup dan sebagai petunjuk atas kekuasaan Allah dan hikmahNya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{demi bapak dan anaknya} Aku bersumpah demi Adam dan anak cucunya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-3. Allah bersumpah “dengan kota ini,” yang aman, yaitu Makkah al-Mukarramah. Negeri yang paling mulia secara mutlak, khususnya pada saat munculnya Rasulullah di negeri itu. “Dan demi bapak dan anaknya,” yaitu Adam dan keturunannya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ وَوَالِدٍ وَمَا وَلَدَ } Dan demi bapak dan anaknya, maksud dari bapak disini adalah : Adam - عليه السلام - dan anaknya yakni : keturunannya, dikatakan dalam riwayat lain : yaitu Nabi Ibrahim dan anaknya dari para Nabi yang datang setelahnya - عليهم السلام - , Allah berfirman : { وَجَعَلْنَا فِي ذُرِّيَّتِهِ النُّبُوَّةَ وَالْكِتَابَ } ( dan Kami jadikan kenabian dan Al Kitab pada keturunannya ) [ Al-Ankabut : 27 ]. Dan pendapat lain mengatakan : bahwa maksud ayat ini adalah umum untuk para ayah da anak-anak nya, yang padanya itu pelajaran yang sangat bermanfaat, dan pendapat ini yang dipilih oleh Imam Ibnu Jarir - رحمه الله - ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَوَالِدٍ وَمَا وَلَدَ \"dan demi bapak dan anaknya.\" Yakni: Allah juga bersumpah dengan bapak dan apa yang dilahirkan, siapakah yang dimaksudkan dengan bapak dan siapakah yang dimaksudkan dengan yang dilahirkan pada ayat ini? Dikatakan: Yang dimaksudkan dengan bapak di sini adalah Adam sedangkan anak disini adalah anak-anak Adam sehingga kata ما [Ma -apa-] di sini bemakna مَن [Man -siapa-] sehingga maknanya adalah \"dan bapak dan anak yang dilahirkan , karena Man kata tanya untuk menanyakan orang yang berakal sedangkan ma untuk yang tidak berakal. Dikatakan juga bahwa yang dimaksudkan dengan bapak dan apa yang dilahirkan adalah semua yang menjadi bapak dan semua yang dilahirkan, baik manusia, binatang ternak dan yang lainnya, karena yang dilahirkan dan bapaknya, semuanya adalah di antara tanda-tanda kebesaran Allah 'Azza Wa Jalla, bagaimana keluarnya sang anak menjadi hidup, sempurna, bisa mendengar dan melihat dan setetes air mani, ini adalah suatu tanda yang menunjukkan atas sempurnanya kuasa Allah 'Azza Wa Jalla, anak yang sempurna ini keluar dari air sperma: أَوَلَمْ يَرَ الْإِنْسَانُ أَنَّا خَلَقْنَاهُ مِنْ نُطْفَةٍ فَإِذَا هُوَ خَصِيمٌ مُبِينٌ \" Dan apakah manusia tidak memperhatikan bahwa Kami menciptakannya dari setitik air (mani), maka tiba-tiba ia menjadi penantang yang nyata! \"(Yasin: 77) Begitu juga serangga-serangga kecil dan yang lainnya keluar dalam kondisi lemah kecil, kemudian membesar sampai memiliki batas ukuran yang Allah 'Azza Wa Jalla kehendaki. Penafsiran yang benar : Bahwa ini mencakup semua induk dan semua yang dilahirkan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Balad ayat 3: 1-3. Allah memulai surat ini dengan bersumpah (dengan) kota ini yaitu Mekkah Al Mukarramah dengan sumpah yang tegas. Dan firman-Nya لَآ sebagai peringatan dan penegasan. Kemudian Allah berkata : Dan engkau wahai Nabi tinggal di kota ini, meskipun kaum musyrikin menghalalkan berdusta atasmu, menyerangmu, menganggapmu gila, penyihir dan penyair. Kemudian Allah bersumpah dengan Adam dan anak keturunannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni Adam dan keturunannya. Isi sumpahnya adalah apa yang disebutkan pada ayat selanjutnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Balad Ayat 3",
    "description": "1-3. Aku bersumpah dengan negeri ini, yakni kota mekah, kota kelahiran nabi dan kota suci umat islam. Dan engkau, wahai nabi, bertempat tinggal di negeri mekah ini, membuatnya bertambah mulia. Dan demi pertalian bapak dan anaknya, demi adam dan anak cucunya. Manusia dengan kehendak Allah mengalami siklus dari kanak-kanak menuju dewasa, berkeluarga, beranak pinak, dan berakhir dengan kematian. Inilah fenomena kehidupan yang perlu direnungi. 4. Sungguh, kami telah menciptakan manusia berada dalam susah payah. Siapa pun, termasuk nabi, dalam masa hidupnya pasti menemui kepayahan, sejak dalam kandungan sampai masa dewasa. Manusia mesti bersusah payah mencari nafkah, mengalami sakit, dan mati. Dalam alam kubur menuju alam mahsyar pun manusia menghadapi kepayahan. Manusia harus mengisi kehidupannya di dunia dengan amal saleh agar tidak menemukan kepayahan lagi di akhirat."
  }
]