[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "6-7. Dia berbangga, “aku telah mengeluarkan harta yang banyak.” Apakah dia menyangka dengan perbuatannya ini bahwa Allah tidak melihatnya, serta tidak menghisab perbuatannya yang remeh dan yang besar?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Ia berkata, “Aku telah menginfakkan harta yang banyak, bertumpuk-tumpuk sebagiannya di atas sebagian yang lain.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. يَقُولُ أَهْلَكْتُ مَالًا لُّبَدًا (Dan mengatakan: “Aku telah menghabiskan harta yang banyak”) Yakni harta yang melimpah ruah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5-6. Apakah dia menganggap bahwa tidak ada satupun yang bisa bangkit dari hal itu? Tentu saja, dan Allah itu Maha berkuasa dan mampu atas hal itu. Ayat ini diturunkan untuk Abu Asyhad bin Kaladah Al-Jamhiy yang mana dengan badannya yang kuat dia berkata: “Aku menafkahkan harta yang banyak”, untuk menunjukkan kesombongannya atas hartanya yang melimpah dan kekayaannya yang sangat banyak. Ibnu Abbas berkata: “Abu Al-Asyaddin berkata: Aku menafkahkan banyak harta untuk melawan Muhammad” Dalam hal itu dia adalah pendusta."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia berkata,“Aku telah menghabiskan} aku telah membelanjakan {harta yang banyak} yang sangat banyak terus menerus"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4-7. Yang menjadi obyek sumpah adalah Firman Allah, “Sungguh Kami telah menciptakan manusia berada dalam susah payah.” Kemungkinan yang dimaksudkan adalah segala kesusahan yang menderanya ketika berada di dunia, di alam barzakh dan pada hari berlakunya kesaksian. Seharusnya manusia mengerjakan perbuatan yang bisa membuatnya terbebas dari berbagai kesusahan itu dan mengharuskannya berbahagia selama-lamanya. Bila ia tidak mengerjakannya, berarti ia senantiasa didera siksaan berat selama-lamanya. Kemungkinan lain, makna ayat ini adalah Allah menciptakan manusia dalam bentuk dan wujud yang paling sempurna yang membuatnya mampu berbuat apa saja serta mengerjakan perbuatan-perbuatan berat. Meski demikian, manusia tetap saja tidak mau bersyukur kepada Allah atas nikmat yang agung itu. Bahkan ia merasa sombong karena diberi kesehatan serta bersikap angkuh terhadap Penciptanya. Dengan kebodohan dan kezhalimannya, ia mengira kondisi itu akan bertahan lama baginya dan dikira kekuasaannya untuk bertindak tidak akan hilang darinya. Karena itulah Allah berfirman, “Apakah manusia itu menyangka bahwa sekali-kali tiada seorang pun yang berkuasa atasnya,” hingga ia pun bertindak melampaui batas dan merasa bangga atas harta yang dibelanjakan untuk keinginan-keinginan dirinya, “lalu berkata, Aku telah menghabiskan harta yang banyak,” yakni yang amat banyak, sebagian mereka diatas sebagian yang lain. Allah menyebut membelanjakan harta untuk keinginan syahwat dan maksiat dengan kata membinasakan, karena orang yang membelanjakan tersebut tidak mendapatkan guna dari harta yang dibelanjakan. Hanya ada penyesalan, kerugian, kelelahan, dan kekurangan yang didapatkan. Tidak sama seperti orang yang membelanjakan hartanya dalam keridhaan Allah dan untuk kebajikan. Karena orang tersebut pada hakikatnya melakukan perdagangan dengan Allah dan mendapatkan keuntungan berlipat-lipat dari harta yang dibelanjakannya. Allah berfirman seraya memberi ancaman kepada orang yang membelajakan hartanya untuk memenuhi keinginan syahwatnya didasari sifat kesombongan “apakah dia mengira tidak akan ada yang melihatnya seorangpun?”, maksudnya, apakah dia menyangka dalam perbuatannya ini bahwa sanya Allah tidak melihatnya dan menghitungnya baik kecil maupun besar? Bahkan Allah sungguh telah melihatnya, dan menjaga nya dengan memeperhatiakan perbuatanya, dan mewaakilkan hal itu kepada dua malaikat yang mulia yang masing-masing memperhatikan amalan yang baik dan yang buruk."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Dan berkata : Aku telah menginfakkan harta terlalu banyak, dia menyesal dengan hartanya yang ia keluarkan dalam jumlah yang banyak, hal ini menunjukkan kenakhilannya, tidakkah ia mengetahui bahwa harta adalah ujian yang Allah berikan kepada setiap hamba-Nya, Allah menguji hamba-Nya dengan harta itu, apakah dia akan mempergunakannya dengan baik atau justru sebaliknya, dan harta itu akan dipertanggung jawabkan kelak dihari kiamat tentang bagaimana ia mendapatkannya dan untuk apa ia gunakan harta itu. Harta yang dimiliki oleh anak Adam hanyalah sebatas titipan dari Allah untuk menguji hamba-Nya, dan akan tiba masanya harta itu akan kembali kepada-Nya, dan mereka yang mendapatkan titipan ini akan dimintai pertanggung jawaban dari harta itu."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "يَقُولُ \" Dia mengatakan:\" Maknanya: Manusia mengatakan juga ketika ia dalam kondisi kaya dan diluaskan rejekinya أَهْلَكْتُ مَالًا لُبَدًا \"Aku telah menghabiskan harta yang banyak\" Maknanya: Harta yang banyak dalam memenuhi syahwatnya dan mendapatkan kelezatan-kelezatan untuk dirinya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Balad ayat 6: 6-7. Kemudian Allah mengabarkan bahwa manusia yang bermaksiat dank eras kepala ini penah berkatan dengan gaya bahasa sombong : Sungguh aku telah menginfakkan harta dalam jumlah banyak kepada musuhku yaitu Muhammad dan kawan-kawannya. Maka apakah kafir keras kepala ini menyangka bahwa Allah tidak akan menampakkan (kemaksiatannya) ketika ia (pernah) menginfakkan hartanya, dan apakah ia menyangka Allah tidak akan menghisabnya atau bertanya kepadanya, atas hartanya yang ia dapatkan dan yang ia infaqkan ?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ia bersikap melampaui batas dan berbangga diri dengan harta yang dikeluarkannya dalam jumlah besar untuk memuaskan hawa nafsunya. Allah Subhaanahu wa Ta'aala menyebut di ayat ini mengeluarkan harta untuk memuaskan hawa nafsu dan bermaksiat dengan ‘ihlaak’ (membinasakan atau menghabiskan), karena pengeluaran tersebut tidak bermanfaat bagi orang yang mengeluarkannya, bahkan hanya membuatnya menyesal, rugi, kelelahan dan membuat hartanya berkurang. Berbeda dengan orang yang mengeluarkan hartanya untuk mencari keridhaan Allah di jalan-jalan kebaikan, maka ia akan mendapatkan keuntungan dari infaknya itu dan Allah Subhaanahu wa Ta'aala akan menggantinya dengan berlipat ganda."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Balad Ayat 6",
    "description": "Dia dengan angkuh mengatakan, 'aku telah menghabiskan harta yang banyak. ' sikap ini sangat tidak terpuji, apalagi jika dia membelanjakan harta untuk memusuhi Allah dan rasul-Nya. 7. Apakah dia bermaksud pamer dengan perbuatannya itu lalu mengira bahwa tidak ada sesuatu pun yang melihatnya' tidak demikian. Semua gerak-gerik manusia, kecil maupun besar, selalu dalam pantauan Allah. Dia akan membalas sekecil apa pun perbuatan manusia."
  }
]