[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "8-10. Bukankah kami telah memberinya sepasang mata untuk melihat, Lidah dan dua bibir untuk berkata, Kami jelaskan baginya dua jalan: kebaikan dan keburukan?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Bukankah Aku telah menjadikan dua mata baginya untuk melihat?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "8-9. Orang yang lalai dari kuasa Allah dan ilmu-Nya yang meliputi segalanya ini telah Allah ciptakan baginya indra penglihatan berupa dua mata, dan alat berbicara berupa lisan dan dua bibir. Maka bagaimana mungkin Dzat Yang telah memberi kenikmatan bagi manusia ini tidak mampu membalas mereka?"
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "8-9. Sesorang yang mentadabburi ayat-ayat al-Qur'an dapat diketahui dari air matanya yang mengalir, hal ini dikuatkan dengan kisah al-Fudhoil tatkala membaca ayat ini : { أَلَمْ نَجْعَلْ لَهُ عَيْنَيْنِ , َلِسَانًا وَشَفَتَيْن } kemudian dia menangis, maka ditanyakan kepadanya sebab yang membuatnya menangis, dia pun berkata : \"pernahkah kamu melewati satu malam dengan penuh kesyukuran kepada Allah atas nikmat penglihatan yang ia berikan kepadamu ? pernahkah kamu melewati satu malam hanya bersyukur kepada Allah atas nikmat lisan yang dengannya kamu berbicara ?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8. Bukankah kami menciptakan bagi manusia dua mata untuk melihat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bukankah Kami telah menjadikan untuknya sepasang mata"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8-10. Kemudian Allah menegaskannya dengan berbagai nikmat seraya berfirman, “BUkankah Kami telah memberikan kepadanya dua buah mata, lidah, dan dua buah bibir,” untuk keindahan, penglihatan, untuk berbicara, dan manfaat-manfaat penting lainnya. Semua ini adalah kenikmatan dunia. Selanjutnya Allah berfirman tentang kenikmatan agama, “Dan Kami telah menunjukkan kepadanya dua jalan,” yaitu jalan kebaikan dan keburukan. Kami menjelaskan antara petunjuk dan kesesatan padanya. Kenikmatan-kenikmatan besar ini mengharuskan manusia untuk menunaikan hak-hak Allah serta bersukur atas segala nikmatNya, serta tidak digunakan untuk mendurhakai Allah."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ أَلَمْ نَجْعَلْ لَهُ عَيْنَيْنِ } Bukankah kami telah menciptakan kedua mata untuknya, yang dengannya dia melihat untuk maslahat dirinya, denga kedua mata itu dia melihat ciptaan Allah dan berfikir tentangnya, dua mata ini merupakan salah satu nikmat Allah yang paling besar, dua mata manusia tidak sama halnya dengan mata yang dimiliki oleh binatang, yang mereka pergunakan untuk sekedar hidup, tapi mata manusia manfaatnya lebih dari hanya sekedar melihat alam semsta ini, akan tetapi kedua mata ini adalah bukti akan kekauasaan Allah."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Allah Ta'ala berfirman: (7) أَلَمْ نَجْعَلْ لَهُ عَيْنَيْنِ (8) وَلِسَانًا وَشَفَتَيْنِ (9) وَهَدَيْنَاهُ النَّجْدَيْنِ \"Bukankah Kami telah memberikan kepadanya dua buah mata, lidah dan dua buah bibir. Dan Kami telah menunjukkan kepadanya dua jalan.\" Tiga perkara tersebut adalah kenikmatan, di antara nikmatan terbesar bagi manusia. أَلَمْ نَجْعَلْ لَهُ عَيْنَيْنِ Maksudnya: Dapat melihat dan memandang dengan keduanya, kedua mata ini menyampaikan ke dalam hati apa yang manusia lihat. Jika ia memandang sesuatu yang diharamkan maka ia berdosa, dan jika ia melihat sesuatau yang dapat mendekatkan dirinya kepada Allah ia akan memperoleh pahala. Dan jika ia melihat sesuatu yang mubah maka ia tidak terpuji juga tidak tercela selama pandangannya ini tidak mengantarkan kepada suatu yang dilarang syari'at sehingga dengannya ia berdosa."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Balad ayat 8: 8-10. Kemudian Allah menjelaskan dengan menyebutkan sebagaian nikmat yang telah ia berikan kepada manusia sesat dan tertipu, Allah berkata : Apakah ia tidak mengetahui bahwa Kami yang menciptakan kedua matanya sehingga ia dapat melihat denganya ? Dan lisannya yang memiliki dua bibir (atas dan bawah) yang ia berbicara dengannya ? Dan Kami telah beri petunjuk kepadanya menuju jalan kebaikan dan keburukan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala menyebutkan nikmat-nikmat-Nya agar dia mengakuinya. Untuk keindahan dan untuk melihat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Balad Ayat 8",
    "description": "8-10. Allahlah yang berkuasa atasnya dan melihat setiap perbuatannya. Bukankah kami telah menjadikan untuknya sepasang mata untuk membantunya melihat sekeliling, dan lidah dan sepasang bibir untuk memungkinkannya mencecap, berbicara, dan memberi penjelasan kepada orang lain, dan bukankah kami juga telah menunjukkan kepadanya dua jalan, yaitu kebaikan dan keburukan, kebenaran dan kebatilan, melalui fitrah, akal, dan petunjuk lain' kami sudah memberinya petunjuk, lalu manusia itu sendiri yang akan memutuskan jalan hidupnya; apakah memilih jalan kesesatan atau kebenaran. 8-10"
  }
]