[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "(Ha Mim). Pembicaraan tentang huruf-huruf terpenggal ( di awal surat seperti ini) telah lewat di awal Surat al-Baqarah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Ḥā Mīm. Pembahasan tentang huruf-huruf semacam ini sudah ada di awal surah Al-Baqarah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1. Pada awal surat al-Baqarah telah dijelaskan tentang huruf muqattha’ah, dan hikmah dari penyebutan huruf muqattha’ah ini adalah untuk menjelaskan sisi mukjizat al-Qur’an."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Keutamaan dan turunnya surah al-Jatsiyah: dari Ibnu ‘Abbas: “Surah al-Jatsiyah diturunkan di Makkah sebelum Hijrah pada masa Umar Ibn Khattab, ketika itu, Umar dicaci oleh salah seorang laki-laki musyrik, ketika itu, Umar hendak membalasnya, lantas Allah menurunkan ayat (14): 1. Haa, miiim, sebagaimana yang tersebut dalam surah sebelumnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ḥā Mīm"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-2. Allah mengabarkan suatu kabar yang mengandung perintah untuk mengagungkan dan memperhatikan al-qur’an. Al-qur’an “kitab (ini) diturunkan dari Allah,” yang diibadahi dan disembah karena memiliki sifat-sifat sempurna serta hanya Dia sendiri yang memilki berbagai nikmat, yang bagiNyalah keperkasaan serta hikmah (kebijaksanaan) yang sempurna."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Jatsiyah ayat 1: (Ha Mim) hanya Allah sajalah yang mengetahui arti dan maksudnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Jatsiyah Ayat 1",
    "description": "H' m'm2. Kitab, yaitu Al-Qur'an ini diturunkan secara berangsur-angsur dari Allah yang mahaperkasa terhadap ketentuan-Nya, lagi mahabijaksana terhadap semua keputusan dan ketentuan-Nya."
  }
]