[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Di depan orang-orang yang menghina ayat-ayat Allah itu ada Jahanam. Harta dan anak yang mereka miliki tidak berguna bagi mereka sedikitpun, tidak pula tuhan-tuhan yang mereka sembah selain Allah, dan mereka akan mendapatkan azab yang besar dan menyakitkan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Di hadapannya terdapat neraka Jahanam yang menunggunya di Akhirat. Harta benda yang mereka dapatkan tidak berguna bagi mereka sedikitpun untuk mencegah dari siksa Allah, dan berhala-berhala yang mereka jadikan sebagai sesembahan di samping Allah tidak mampu menghalangi mereka sedikitpun dari siksa Allah, dan bagi mereka siksa yang besar pada hari Kiamat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. مِّن وَرَآئِهِمْ جَهَنَّمُ ۖ (Di hadapan mereka neraka Jahannam) Yakni dibalik kebanggaan dengan dunia dan keangkuhan mereka terhadap kebenaran terdapat Jahannam bagi mereka, dan pasti akan meliputi mereka. Pendapat lain mengatakan bahwa yang dimaksud adalah di depan mereka, sebab mereka menghadap kepada Jahannam. وَلَا يُغْنِى عَنْهُم مَّا كَسَبُوا۟ شَيْـًٔا(dan tidak akan berguna bagi mereka sedikitpun apa yang telah mereka kerjakan) Yakni harta dan anak keturunan mereka sama sekali tidak dapat menjauhkan mereka dari azab Allah, serta tidak bermanfaat bagi mereka sedikitpun. وَلَا مَا اتَّخَذُوا۟ مِن دُونِ اللهِ أَوْلِيَآءَ ۖ( dan tidak pula berguna apa yang mereka jadikan sebagai sembahan-sembahan (mereka) dari selain Allah) Yakni patung-patung dan tuhan-tuhan yang mereka sembah selain Allah juga tidak bermanfaat bagi mereka, padahal mereka berhadap dapat memberi mereka manfaat dan menjauhkan mereka dari mudharat. وَلَهُمْ عَذَابٌ عَظِيمٌ (Dan bagi mereka azab yang besar) Yakni azab neraka Jahannam yang ada di depan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10. Tunggulah! Neraka jahannam, dimana harta benda dan keturunan tidak ada lagi yang tidak dapat meringankan siksa mereka, ptung-patung mereka tidak lagi bermanfaat bagi mereka, yang mereka sembah, karena tidak ada penolong selain Allah dan bagi mereka siksa yang pedih di dalam jahanam"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Di hadapan mereka} di hadapan mereka {ada neraka Jahanam. Tidak akan berguna sedikit pun bagi mereka apa yang telah mereka kerjakan dan tidak pula apa yang mereka jadikan sebagai penolong selain Allah} berhala-berhala yang mereka harapkan manfaat dan pertolongannya {Bagi mereka itu azab yang sangat berat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6-10. selanjutnya Allah membagi manusia menjadi dua golongan dalam kaitannya apakah mereka mau memanfaatkan tanda-tanda kebesaranNya ataukah tidak; Golongan pertama adalah mereka yang mau menjadikan ayat-ayat Allah sebagai petunjuk, direnungkan dan dimanfaatkan sehingga derajat mereka menjadi tinggi. Mereka adalah orang-orang yang beriman secara sempurna kepada Allah, malaikat-malaikat, kitab-kitab, para rasul, dan hari Akhir. Keimanan mereka ini mencapai tingkatan yakin, sehingga akal mereka menjadi bersih dan pengetahuan, akal sehat, serta ilmu mereka pun bertambah. Golongan kedua adalah mereka yang mau mendengar ayat-ayat Allah yang dengan pendengaran itu hujjah telah ditegakkan kepada mereka, namun kemudian mereka berpaling dan merasa tinggi hati, seolah-olah mereka tidak mendengarnya, sebab ayat-ayat tersebut tidak bisa membersihkan hati mereka, bahkan karena kesombongan mereka terhadap ayat-ayat itu mereka semakin melampaui batas. Apabila mereka mengetahui sesuatu dari ayat-ayat hingga Allah, mereka menjadikannya sebagai bahan olok-olokan, sehingga Allah pun menjanjikkan kecelakaan bagi mereka melalui firmanNYa, ”kecelakaan yang besarlah bagi tiap-tiap orang yang banyak berdusta lagi banyak berdosa,” yakni, berdusta dalam perkataannya dan berdosa dalam perbuatannya. Dan Allah memberitahukan mereka bahwa mereka akan mendapatkan siksaan yang pedih. Dan sesungguhnya “di hadapan mereka neraka jahanam,”sebagai balasan mereka dan “tidak akan berguna bagi mereka sedikitpun apa yang telah mereka kerjakan,” yang mereka raih dari harta-harta mereka, “dan tidak pula berguna apa yang mereka jadikan sebagai sesembhaan-sesembahan (mereka) dari selain Allah,” mereka pun meminta pertolongan kepada sesmbahan-sesembahan selain Allah namun sesembahan-sesembahan selain Allah, namun sesembahan-sesembhaan itu ternyata menghinakan mereka pada saat-saat diperlukan andai bisa mendatangkan manfaaat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Jatsiyah ayat 10: (Di hadapan mereka) di sini diartikan di hadapan mereka sekalipun lafalnya mengatakan Min Waraa-ihim yakni di belakang mereka, hal ini mengingat mereka masih hidup di dunia (neraka Jahanam dan tidak akan berguna bagi mereka apa yang telah mereka upayakan) berupa harta benda dan hasil-hasil kerja mereka (barang sedikit pun, dan tidak pula berguna apa yang mereka jadikan selain dari Allah) yang dimaksud adalah berhala-berhala (sebagai sesembahan-sesembahan. Dan bagi mereka azab yang besar.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang cukup sebagai hukuman yang dahsyat baginya. Seperti harta dan perbuatan. Yaitu patung-patung dan berhala-berhala yang mereka sembah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Jatsiyah Ayat 10",
    "description": "Di hadapan mereka kini sudah disiapkan neraka jahanam dan tidak akan berguna bagi mereka sedikit pun apa yang telah mereka kerjakan, dan tidak pula bermanfaat apa yang mereka jadikan sebagai pelindung-pelindung mereka, yaitu sesembahan mereka selain Allah. Dan mereka akan mendapat azab yang besar sebagai akibat dari perbuatan dosa yang mereka lakukan. 11. Al-qur'an ini adalah petunjuk yang menunjukkan dan mengarahkan mereka ke jalan yang benar. Dan orang-orang yang mengingkari ayat-ayat tuhan mereka akan mendapat azab berupa siksaan yang sangat pedih."
  }
]