[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Al-Quran yang Kami turunkan kepadamu ini (wahai rasul), adalah petunjuk dari kesesatan, dalil kepada kebenaran, membimbing orang yang mengikuti dan mengamalkannya ke jalan yang lurus, sedangkan orang-orang yang mengingkari apa yang ada di dalam al-Quran berupa ayat-ayat yang menunjukan kepada kebenaran dan tidak membenarkannya, bagi mereka azab yang pedih lagi menyakitkan yang termasuk ke dalam jenis azab yang paling buruk di Hari Kiamat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Kitab yang Kami turunkan kepada Rasul Kami Muhammad ini memberi petunjuk kepada jalan kebenaran, dan bagi orang-orang yang kafir terhadap ayat-ayat Rabb mereka yang diturunkan kepada Rasul-Nya ada siksa yang buruk dan menyakitkan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "11. Al-Qur’an ini merupakan petunjuk menuju jalan yang lurus. Dan orang-orang yang mengingkari ayat-ayatnya akan mendapat azab yang paling menyakitkan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "11. هٰذَا هُدًى ۖ (Ini (Al Quran) adalah petunjuk) Yakni ayat-ayat yang telah disebutkan dalam surat ini merupakan petunjuk bagi orang-orang yang berpegang pada al-Qur’an dan menerima kandungannya. وَالَّذِينَ كَفَرُوا۟ بِـَٔايٰتِ رَبِّهِمْ(Dan orang-orang yang kafir kepada ayat-ayat Tuhannya) Yakni ayat-ayat qur’aniyah. لَهُمْ عَذَابٌ مِّن رِّجْزٍ أَلِيمٌ(bagi mereka azab yaitu siksaan yang sangat pedih) Makna (الجزر) yakni azab yang paling berat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Al-qur’an merupakan hidayah dan petunjuk bagi kebenaran dan yang haq, mereka yang kufur dan berdusta pada ayat-ayat al-Qur’an dan bagi mereka sepedih-pedihnya siksa"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Inilah petunjuk} Al-Qur’an ini adalah sesuatu yang mengantarkan lagi sempurna dalam memberi petunjuk {Orang-orang yang mengingkari ayat-ayat Tuhan mereka. Bagi mereka itu azab berupa siksaan yang sangat pedih} azab paling buruk dan paling dahsyat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11. tatkala Allah menjelaskan tanda-tanda kebesaranNya, baik yang dibaca maupun yang dilihat, dan ketika Allah membagi manusia menjadi dua golongan, Allah memberitahukan bahwa al-qur’an yang mencakup berbagai tuntutan luhur itu adalah sebagai petunjuk. Allah berfirman, “ini (al-qur’an) adalah petunjuk,” ini adalah sifat umum untuk keseluruhan al-qur’an, karena al-qur’an memberikan petunjuk untuk mengetahui Allah dengan sifat-sifatNya yang suci dan perbuatan-perbuatanNya yang terpuji. Al-qur’an juga memberikan petunjuk untuk mengenal para rasul, wali dan musuh-musuh Allah serta menjelaskan sifat-sifat mereka. Memberikan petunjuk untuk berbuat amal shalih serta menyerukan kepada amal tersebut. Al-qur’an juga menjelaskan berbagai perbuatan tidak baik serta melarangnya, menjelaskan berbagai macam balasan atas berbagai perbuatan. Menjelaskan balasan-balasan baik di dunia maupun di akhirat. Orang-orang yang mendapatkan hidayah adalah mereka yang menjadikan al-qur’an sebagai petunjuk dan mereka itulah orang-orang yang berbahagia. “dan orang-orang yang kafir kepada ayat-ayat Rabbnya,” kufur terhadap ayat-ayat yang jelas lagi tegas yang hanya diingkari oleh mereka yang benar-benar tersesat dan sangat melampaui batas,”bagi mereka azab yaitu siksaan yang sangat pedih,”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Jatsiyah ayat 11: (Ini) Alquran ini (adalah petunjuk) dari kesesatan. (Dan orang-orang yang kafir kepada ayat-ayat Rabbnya bagi mereka azab) yakni bagian (yaitu siksa) atau azab (yang sangat pedih) sangat menyakitkan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala menerangkan ayat-ayat-Nya baik yang ada dalam Al Qur’an atau yang ada di alam semesta yang mereka saksikan, dan bahwa manusia dalam hal tersebut terbagi menjadi dua golongan, maka Dia memberitahukan bahwa Al Qur’an yang mengandung tuntutan-tuntutan yang tinggi ini adalah sebagai petunjuk. Petunjuk merupakan sifat yang merata kepada seluruh isi Al Qur’an. Al Qur’an menunjuki ma’rifatullah (mengenalkan Allah) dengan sifat-sifat-Nya yang suci dan perbuatan-Nya yang terpuji. Demikian pula menunjuki kepada mengenal para rasul-Nya, para wali-Nya, musuh-musuh-Nya serta sifat-sifat mereka. Ia (Al Qur’an) juga menunjuki amal yang saleh dan mengajak kepadanya, demikian pula menerangkan amal yang buruk serta melarangnya, serta menunjuki dengan menerangkan balasan terhadap amal serta menerangkan balasan di dunia dan akhirat. Orang-orang yang mendapat petunjuk mengambil petunjuk darinya sehingga mereka beruntung dan berbahagia. Yang begitu jelas, dimana tidak ada yang mengingkarinya kecuali orang yang sudah terlalu zalim dan banyak sikap melampaui batasnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Jatsiyah Ayat 11",
    "description": "Al-qur'an ini adalah petunjuk yang menunjukkan dan mengarahkan mereka ke jalan yang benar. Dan orang-orang yang mengingkari ayat-ayat tuhan mereka akan mendapat azab berupa siksaan yang sangat pedih. 12. Tidakkah kalian perhatikan, wahai manusia, bahwa Allah yang maha esa lagi mahakuasa lah yang telah menundukkan laut, yakni memudahkannya untuk kemaslahatan kamu agar kapal-kapal dapat berlayar di atasnya membawa kamu dan barang-barang keperluanmu hingga ke tempat tujuan dengan izin dan perintah-Nya, dan agar kamu dapat mencari sebagian karunia-Nya, yang berupa hasil laut, seperti ikan dan hasil laut lainnya, dan juga agar kamu bersyukur atas nikmat-nikmat Allah yang di anugerahkan-Nya itu."
  }
]