[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah-lah Yang menundukkan lautan bagi kalian sehingga kapal-kapal berjalan di atasnya dengan perintahNya, agar kalian bisa mencari karuniaNYa melalui berbagai bentuk perniagaan dan mata pencaharian, dan agar kalian bersukur kepada Tuhan kalian karena Dia telah menundukkan hal itu untuk kalian, maka sembahlah Dia semata dan taatilah Dia dalam apa yang Dia perintahkan dan apa yang Dia larang."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Hanya Allah sendiri yang menundukkan lautan untuk kalian -wahai manusia- agar kapal-kapal bisa berjalan di atasnya dengan perintah-Nya, agar kalian mencari anugerah Allah dengan berbagai pekerjaan yang diperbolehkan dan agar kalian mensyukuri nikmat Allah atas kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "12-13. Allah menyebutkan kenikmatan-kenikmatan yang telah Dia berikan kepada hamba-hamba-Nya: Allah telah menundukkan lautan bagi kalian agar kalian dapat berlayar dengan kapal di atasnya dengan izin-Nya; dan agar kalian dapat mencari karunia Allah dengan berdagang dan manfaat lainnya; serta agar kalian dapat bersyukur kepada-Nya atas segala kenikmatan dari-Nya dengan perkataan dan perbuatan. Dan Allah menundukkan bagi kalian apa yang ada di tujuh langit dan bumi serta kebaikan-kebaikan yang ada di antara keduanya. Sungguh pada karunia yang luas ini terdapat tanda-tanda kekuasaan Allah bagi orang-orang yang memikirkan ayat-ayat kauniyah-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "12. اللهُ الَّذِى سَخَّرَ لَكُمُ الْبَحْرَ (Allah-lah yang menundukkan lautan untukmu) Yakni Allah menjadikan lautan itu dapat kalian mengarunginya, yaitu dengan menaiki kapal yang Allah ajarkan kalian dalam pembuatannya. لِتَجْرِىَ الْفُلْكُ فِيهِ بِأَمْرِهِۦ(supaya kapal-kapal dapat berlayar padanya dengan seizin-Nya) Yakni dengan izin Allah dan kemampuan yang Dia berikan kepada kalian. وَلِتَبْتَغُوا۟ مِن فَضْلِهِۦ(dan supaya kamu dapat mencari karunia -Nya) Dengan perdagangan, mengambil mutiara di dasar laut, berburu ikan, dan lain sebagainya. وَلَعَلَّكُمْ تَشْكُرُونَ(dan mudah-mudahan kamu bersyukur) Yakni bersyukur atas nikmat yang kalian dapatkan karena penundukan lautan bagi kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12. Allah lah yang menundukkan lautan sehingga perahu bisa melaluinya dengan perahu, agar perahu bisa berlayar dengan izin Nya, menghinakannya, dan dengan izin Allah, mereka berniaga, berburu dan menyelam, dan agar mereka bersyukur kepada Allah atas nikmat-nikmat dari Allah melalui lautan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Allahlah Dzat yang telah menundukkan laut untuk kalian agar kapal-kapal} bahtera {dapat berlayar di atasnya dengan perintahNya, agar kalian dapat mencari} agar kalian dapat mencari {sebagian karuniaNya, dan agar kalian bersyukur"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "12. Allah mengabarkan karunia dan kebaikanNya pada para hamba melalui ditundukannya samudera agar bisa dilaui oleh perahu dan kapal atas perintah dan izinNYa.”supaya kamu dapat mencari sebagian karuniaNya,” dengan berbagai macam perdagangan dan pekerjaan, “dan mudah-mudhan kamu bersyukur,” kepada Allah, Karen apabila kalian mau bersyukur, niscaya akan diberi tambahan nikmati oleh Allah serta memberikan pahala besar atas rasa syukur kalian."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Jatsiyah ayat 12: (Allahlah yang menundukkan lautan untuk kalian supaya bahtera-bahtera dapat berlayar) yaitu perahu-perahu (padanya dengan perintah-Nya) dengan seizin-Nya (dan supaya kalian dapat mencari) melalui berdagang (sebagian karunia-Nya dan mudah-mudahan kalian bersyukur.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan karunia dan ihsan-Nya kepada hamba-hamba-Nya dengan menundukkan lautan agar dapat dilintasi kapal dan perahu dengan perintah dan kemudahan-Nya. Yaitu dengan melakukan perdagangan dan bisnis. Kepada Allah Subhaanahu wa Ta'aala, karena dengan bersyukur kepada-Nya, maka Dia akan menambahkan nikmat-nikmat-Nya serta membalas dengan pahala yang besar terhadap sikap syukur itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Jatsiyah Ayat 12",
    "description": "Tidakkah kalian perhatikan, wahai manusia, bahwa Allah yang maha esa lagi mahakuasa lah yang telah menundukkan laut, yakni memudahkannya untuk kemaslahatan kamu agar kapal-kapal dapat berlayar di atasnya membawa kamu dan barang-barang keperluanmu hingga ke tempat tujuan dengan izin dan perintah-Nya, dan agar kamu dapat mencari sebagian karunia-Nya, yang berupa hasil laut, seperti ikan dan hasil laut lainnya, dan juga agar kamu bersyukur atas nikmat-nikmat Allah yang di anugerahkan-Nya itu. 13. Dan hanya dia yang maha esa lagi mahakuasa yang dapat menundukkan bagi kemaslahatan kamu apa yang ada di langit, seperti bintang-bintang dan planet-planet serta apa yang ada di bumi, seperti tanah yang subur, air, dan lain-lainnya untuk kemaslahatan kamu semuanya sebagai rahmat dari-Nya. Sesungguhnya, dalam hal yang demikian itu benar-benar terdapat tanda-tanda kekuasaan dan kebesaran Allah bagi orang-orang yang berpikir dan merenungkan ayat-ayat-Nya."
  }
]