[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dia menundukkan untuk kalian segala apa yang ada di langit berupa matahari, rembulan dan bintang-bintang, dan segala yang ada di bumi berupa hewan, pohon, kapal dan lain-lainnya untuk kemanfaatan kalian. Seluruh nikmat ini merupakan karunia dari Allah semata, Dia melimpahkannya kepada kalian sebagai nikmat, memberikannya kepada kalian sebagai karunia, maka hanya kepadaNya-lah hendaknya kalian beribadah, jangan mengangkat sekutu bagiNya. Sesungguhnya dalam apa yang Dia tundukkan bagi kalian itu terkandung tanda-tanda dan petunjuk-petunjuk atas keesaan Allah bagi kaum yang merenungkan ayat-ayat, hujjah-hujjah dan dalil-dalil Allah lalu mereka mengambil pelajaran darinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "13. Dan Allah -Subḥānahu- menundukkan bagi kalian apa yang ada di langit berupa matahari, bulan dan bintang-bintang, dan apa yang ada di bumi berupa sungai-sungai, pepohonan, langit-langit dan lain-lain. Sesungguhnya dalam hal ditundukkannya semua itu untuk kalian benar-benar terdapat bukti-bukti atas kekuasaan Allah dan keesaan-Nya bagi orang-orang yang berfikir tentang ayat-ayatnya dan mengambil pelajaran darinya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "13. وَسَخَّرَ لَكُم مَّا فِى السَّمٰوٰتِ وَمَا فِى الْأَرْضِ جَمِيعًا مِّنْهُ ۚ (Dan Dia telah menundukkan untukmu apa yang di langit dan apa yang di bumi semuanya, (sebagai rahmat) daripada-Nya) Yakni Allah menundukkan segala makhluk-Nya di langit seperti matahari, bulan, bintang, komet, hujan, awan, dan angin; dan makhluk-makhluk yang ada di bumi. Semua itu merupakan rahmat Allah bagi hamba-hamba-Nya sebagai kenikmatan dan karunia bagi mereka. إِنَّ فِى ذٰلِكَ(Sesungguhnya pada yang demikian itu) Yakni pada penundukan itu. لَاٰيٰتٍ لِّقَوْمٍ يَتَفَكَّرُونَ(benar-benar terdapat tanda-tanda (kekuasaan Allah) bagi kaum yang berfikir) Sehingga dengan berfikir mereka dapat sampai pada petunjuk kepada tauhid. Sedangkan orang yang tidak berfikir maka mereka tidak akan mendapat petunjuk dari tanda-tanda tersebut."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13. Allah telah menundukkan makhlukNya, dari apa yang ada di langit, dari matahari, bulan, hujan dan angin, dan apa yang ada di bumi dari kebaikan, ilmu dan kemanfaatan, sesungguhnya semua itu adalah bukti yang jelas atas kekuasaan dan keesaan Allah bagi orang-orang yang berfikir"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia telah menundukkan untuk kalian apa yang ada di langit dan apa yang ada di bumi semuanya (sebagai rahmat) dariNya. Sesungguhnya pada yang demikian itu benar-benar terdapat ayat-ayat bagi kaum yang berpikir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "13. “dan Dia menundukkan untukmu apa yang ada di langit dan apa yang ada di bumi semuanya,” artinya, dari karunia dan kebaikanNya. Karunia dan kebaikan tersebut mencakup semua yang ada di langit dan di bumi, berupa matahari, bulan, bintang, meteor dan lainnya yang terdapat di langit dan di bumi, berupa matahari, bulan, bintang, meteor dan lainnya yang terdapat di langit serta berbagai macam binatang, tumbuh-tumbuhan, buah-buahan serta berbagai macam barang tambang dan lain sebagainya yang dipersiapkan untuk kepentingan dan kebutuhan pokok manusia. Semua karunia dan kebaikan tersebut mengharuskan manusia untuk mencurahkan semua daya upayanya untuk mensyukuri nikmat Allah serta menggerakkan pikiran dalam merenungkan tanda-tanda kebesaran dan berbagai hikmah yang diciptakan Allah. Karena itulah Allah berfirman,”sesungguhnya pada yang demikian itu benar-benar terdapat tanda-tanda (kekuasaan Allah) bagi kaum yang berpikir.” Secara garis besar, penciptaan semua yang tersebut di atas serta pengaturannya menunjukkan atas terlaksananya kehendak dan sempurnanya kuasa Allah. Kesetaraan, kerapian, indahnya ciptaan dan bentuk yang terdapat dalam penciptaan langit dan bumi adalah sebagai petunjuk atas kesempurnaan hikmah dan ilmu Allah. Keluasan, keagungan serta banyaknya makhluk ciptaan Allah menunjukkan atas kesempurnaannya kuasa Allah. Berbagai manfaat serta kepentingan, baik yang bersifat ukhrawi maupun duniawi yang terdapat dalam penciptaan langit dan bumi menunjukkan bahwa Allah berbuat apa pun yang Dia kehendaki. Dan semua itu menunjukkan bahwa hanya Allah semata yang Mahatinggi dan berhak disembah, dimana semua ibadah, ketundukkan dan kecintaan hanya patut untukNya. Semua berita yang dibawa oleh para rasul adalah benar. Semua hal tersebut adalah dalil aqli yang jelas dan tidak meragukan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Jatsiyah ayat 13: (Dan Dia menundukkan untuk kalian apa yang ada di langit) berupa matahari bulan bintang-bintang, air hujan dan lainlainnya (dan apa yang ada di bumi) berupa binatang-binatang, pohon-pohonan, tumbuh-tumbuhan, sungai-sungai dan lainlainnya. Maksudnya, Dia menciptakan kesemuanya itu untuk dimanfaatkan oleh kalian (semuanya) lafal Jamii'an ini berkedudukan menjadi Taukid, atau mengukuhkan makna lafal sebelumnya (dari-Nya) lafal Minhu ini menjadi Hal atau kata keterangan keadaan, maksudnya semuanya itu ditundukkan oleh-Nya. (Sesungguhnya pada yang demikian itu benar-benar terdapat tanda-tanda kekuasaan dan keesaan Allah bagi kaum yang berpikir) mengenainya, karena itu lalu mereka beriman."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Seperti matahari, bulan, bintang dan benda-benda langit lainnya baik yang diam maupun yang bergerak. Seperti binatang melata, pepohonan, sungai, barang tambang dan lainnya. Semua itu diciptakan untuk manfaat dan maslahat manusia. Hal ini tentunya mengharuskan mereka banyak bersyukur kepada Allah Subhaanahu wa Ta'aala atas nikmat-nikmat-Nya dan berusaha memikirkan ayat-ayat-Nya dan hikmah-hikmah-Nya. Ya, pada penciptaan, pengaturan dan penundukan-Nya kepada alam semesta terdapat dalil yang menunjukkan berlakunya kehendak Allah dan sempurnanya kekuasaan-Nya. Demikian pula kerapihan, keserasian dan indahnya ciptaan-Nya juga menunjukkan sempurnanya hikmah-Nya dan ilmu-Nya. Apa yang terlihat di alam semesta berupa luas, besar dan banyak juga menunjukkan luasnya kerajaan-Nya. Pengkhususan yang diberikan-Nya serta adanya sesuatu yang berlawanan juga menunjukkan bahwa Dia berbuat apa yang Dia kehendaki. Manfaat dan maslahat baik yang terkait dengan agama maupun dunia menunjukkan luasnya rahmat-Nya, meratanya karunia dan ihsan-Nya, dan pada indahnya kelembutan-Nya dan kebaikan-Nya dan pada semua yang disebutkan tadi juga menunjukkan bahwa Dia yang berhak disembah, dimana tidak pantas ibadah, penghinaan diri dan kecintaan kecuali kepada-Nya, dan bahwa apa yang dibawa para rasul-Nya adalah benar. Ini adalah dalil ‘aqli (akal) yang begitu jelas, yang tidak menerima lagi keraguan dan kebimbangan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Jatsiyah Ayat 13",
    "description": "Dan hanya dia yang maha esa lagi mahakuasa yang dapat menundukkan bagi kemaslahatan kamu apa yang ada di langit, seperti bintang-bintang dan planet-planet serta apa yang ada di bumi, seperti tanah yang subur, air, dan lain-lainnya untuk kemaslahatan kamu semuanya sebagai rahmat dari-Nya. Sesungguhnya, dalam hal yang demikian itu benar-benar terdapat tanda-tanda kekuasaan dan kebesaran Allah bagi orang-orang yang berpikir dan merenungkan ayat-ayat-Nya. 14. Katakanlah, wahai nabi Muhammad, kepada orang-orang yang ber iman kepada Allah dan rasul-Nya, hendaklah mereka memaafkan orang-orang yang melakukan perbuatan jahat yang tidak takut akan hari-hari di mana Allah menimpakan siksaan kepada mereka karena dia akan membalas suatu kaum di akhirat nanti sesuai dengan apa yang telah mereka kerjakan di dunia ini."
  }
]