[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sungguh Kami telah memberi Bani Israil Taurat dan Injil dan mewajibkan mereka berhukum dengan apa-apa yang terkandung pada keduanya, dan Kami menjadikan mayoritas nabi-nabi dari anak keturunan Ibrahim diutus kepada mereka, dan Kami memberi mereka rizki dari yang baik-baik, berupa makanan pokok, buah-buahan dan berbagai macam makanan, dan Kami mengunggulkan mereka atas manusia-manusia di zaman mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Dan Kami telah memberikan Taurat kepada Bani Israil dan memberi kaputusan di antara manusia dengan hukumnya, dan Kami jadikan sebagian besar para nabi dari kalangan mereka, dari keturunan Ibrahim -'alaihissalām-. Dan Kami telah memberikan rezeki kepada mereka dari berbagai macam rezeki yang baik dan Kami berikan mereka kelebihan di atas seluruh manusia pada jaman mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "16-17. Sungguh Kami telah memberi Bani Israil kitab Taurat, Injil, dan kekuasaan; dan Kami angkat Nabi-Nabi dari mereka, Kami beri mereka rezeki yang nikmat, Kami lebihkan mereka atas manusia lainnya pada zaman mereka, dan Kami datangkan kepadda mereka bukti-bukti yang jelas dalam perkara agama. Akan tetapi mereka tidak berselisih melainkan setelah mereka mendapat pengetahuan dari Allah, yang di antaranya adalah tentang pengutusan Nabi Muhammad. Sebab timbulnya perselisihan ini adalah kezaliman dan ketamakan mereka terhadap kekuasaan. Hai Rasulullah, Tuhanmu akan memutuskan pada hari kiamat antara Bani Israil yang saling berselisih atas apa yang mereka perselisihkan di dunia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "16. وَلَقَدْ ءَاتَيْنَا بَنِىٓ إِسْرٰٓءِيلَ الْكِتٰبَ (Dan sesungguhnya telah Kami berikan kepada Bani Israil Al Kitab) Yakni kitab Taurat. وَالْحُكْمَ (kekuasaan) Yakni ilmu dan pemahaman yang menjadikan mereka berkuasa atas manusia dan untuk menyelesaikan perselisihan mereka. وَالنُّبُوَّةَ(dan kenabian) Yakni nabi-nabi yang Allah utus kepada mereka. وَرَزَقْنٰهُم مِّنَ الطَّيِّبٰتِ(dan Kami berikan kepada mereka rezeki-rezeki yang baik) Yakni makanan-makanan lezat yang Allah halalkan bagi mereka, diantaranya adalah al-mann dan as-salwa. وَفَضَّلْنٰهُمْ عَلَى الْعٰلَمِينَ(dan Kami lebihkan mereka atas bangsa-bangsa (pada masanya)) Yakni Kami memberi mereka apa yang tidak Kami berikan kepada umat yang lain, seperti terbelahnya lautan bagi mereka, taurat, dan keimanan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16. Sungguh Kami telah memberi Bani Israil kitab Taurat dan beberapa cara untuk meredam pertengkaran berupa pemahaman dan hukum agama. Kami menjadikan para nabi dan rasul dari golongan mereka. Kami memberi mereka rejeki makanan halal yang lezat seperti Manna dan Salwa. Kami juga mengutamakan mereka di atas seluruh manusia pada masa mereka dengan beberapa kelebihan seperti membelah lautan, kitab Taurat, dan kuatnya keimanan dan keyakinan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh Kami benar-benar telah menganugerahkan kepada Bani Israil kitab} Taurat {hukum} ketentuan di antara manusia {dan kenabian. Kami telah menganugerahkan kepada mereka rezeki yang baik dan Kami telah melebihkan mereka di atas alam semesta"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "16. maksudnya kami (allah) telah memberikan berbagai nikmat kepada bani israil yang belum pernah diperoleh kaum lain dan kami telah memberikan mereka “al-kitab” yaitu taurat dan injil serta kami berikan kekuasaan dan kenabian, yang dengan berbagai nikmat itulah mereka menjadi kaum yang istimewa. Kenabian yang terdapat dalam keturunan Ibrahim kebanyakan berasal dari kaum bani israil. “dan kami berikan kepada mereka rizki-rizki yang baik,” berupa makanan, minuman, pakaian dan diturunkannya al-manna wa as-salwa kepada mereka, “dan kami lebihkan mereka atas bangsa-bangsa,” atas semua manusia dengan berbagai nikmat itu. Namun keumuman teks tersebut tidak mencakup umat islam, karena umat islam adalah umat terbaik yang dikeluarkan di tengah-tengah manusia. Tekstual ayat menunjukan bahwa yang diumaksud bukan umat islam, karena Allah dalam ayat ini mengisahkan berbagai nikmat yang diberikan kepada bani israil sereta keistimewaan yang diberikan yang membedakan mereka dengan yang lain. Dari sisi lain, berbagai karunia yang membuat bani israil unggul seperti karunia kitab, kekuasaan, kenabian serta lainnya juga dimiliki oleh umat islam, bahkan umat islam memilki berbagai karunia lain yang lebih banyak. Seyariat bani israil hanyalah sebagian kecil dari isyarat islam, sebab kita al-qur’an mencakup atas kitab-kitab sebelumnya dan Muhammad rasul yang membenarkan semua rasul yang diutus sebelumnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Jatsiyah ayat 16: (Dan sesungguhnya telah Kami berikan kepada Bani Israel Alkitab) yakni Taurat (dan hukum) yakni kitab Taurat sebagai sumber hukum untuk memutuskan perkara di antara orang-orang Bani Israel (dan kenabian) kepada Musa dan Harun, di antara mereka (dan Kami berikan kepada mereka rezeki-rezeki yang baik) atau rezeki-rezeki yang halal, yaitu manna dan salwa (dan Kami lebihkan mereka atas bangsa-bangsa) atas orang-orang pandai di zamannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni Kami telah memberi berbagai nikmat kepada Bani Israil yang tidak diberikan kepada bangsa yang lain; Kami beri mereka kitab, yaitu Taurat dan Injil, kekuasaan terhadap manusia, dan kenabian. Oleh karena itu, banyak para nabi yang berasal dari Bani Israil. Seperti makanan, minuman, pakaian, manna dan salwa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Jatsiyah Ayat 16",
    "description": "Dan sungguh, kepada bani israil telah kami berikan kitab, yaitu taurat, injil, dan zabur masing-masing melalui nabi musa, nabi isa, dan nabi daud, kekuasaan, syariat dan ketetapan hukum, dan kenabian, yaitu kami jadikan sebahagian di antara mereka sebagai nabi. Kami anugerahkan kepada mereka aneka macam rezeki yang baik-baik, seperti al-mann dan al-salwa, dan kami lebihkan mereka atas seluruh alam, yakni atas bangsa-bangsa lain pada masa itu. 17. Dan juga kami telah berikan kepada mereka keterangan-keterangan, sebagai bukti-bukti yang jelas tentang urusan agama; maka sangat buruk sikap mereka karena mereka tidak berselisih kecuali setelah datang kepada mereka ilmu, pengetahuan yang sebenarnya dapat menyatukan mereka. Perselisihan mereka itu terjadi karena kedengkian yang ada di antara me-reka. Sungguh, tuhanmu, yang memelihara dan membimbingmu, wahai nabi Muhammad, akan memberi putusan kepada mereka pada hari kiamat terhadap apa yang selalu mereka perselisihkan sewaktu mereka hidup di dunia."
  }
]