[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Kami memberi Bani Israil syariat-syariat yang jelas dalam perkara halal dan haram dan petunjuk-petunjuk yang menjelaskan kebenaran dan kebatilan, dan mereka tidak berselisih kecuali setelah ilmu datang kepada mereka dan hujjah tegak atas mereka. Yang mendorong mereka demikian adalah pelanggaran sebagian dari mereka atas sebagian yang lainnya untuk mendapatkan kedudukan dan kepemimpinan. Sesungguhnya Tuhanmu (wahai rasul) akan memberikan keputusan di antara orang-orang yang berselisih dari Bani Israil di Hari Kiamat dalam perkara yang mereka perselisihkan di dunia. Dalam ayat Ini terdapat peringatan bagi umat ini agar tidak mengambil jalan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Dan Kami telah memberikan kepada mereka bukti-bukti yang memperjelas kebenaran dari kebatilan, dan tidaklah mereka berselisih kecuali setelah tegaknya hujah (bukti kebenaran) atas mereka dengan diutusnya Nabi kita Muhammad -ṣallallāhu 'alaihi wa sallam-. Dan tidak ada yang menarik mereka kepada perselisihan ini kecuali kedengkian sebagian kepada sebagian yang lain karena tamak terhadap kekuasaan dan kedudukan. Sesungguhnya Rabbmu -wahai Rasul- memberi keputusan di antara mereka pada hari Kiamat tentang apa yang mereka perselisihkan di dunia hingga jelaslah siapa yang benar dan siapa yang salah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "17. وَءَاتَيْنٰهُم بَيِّنٰتٍ مِّنَ الْأَمْرِ ۖ (Dan Kami berikan kepada mereka keterangan-keterangan yang nyata tentang urusan (agama)) Yakni tentang syari’at-syari’at yang jelas dalam masalah halal dan haram, atau mukjizat-mukjizat yang jelas. Pendapat lain mengatakan yakni pengetahuan tentang pengutusan Rasulullah Muhammad dan bukti-bukti kenabiannya. فَمَا اخْتَلَفُوٓا۟ إِلَّا مِنۢ بَعْدِ مَا جَآءَهُمُ الْعِلْمُ (maka mereka tidak berselisih melainkan sesudah datang kepada mereka pengetahuan) Yakni perselisihan yang terjadi di antara mereka tidak lain adalah setelah datangnya ilmu kepada mereka dengan jelas, namun sesuatu yang seharusnya sebagai sebab terselesaikannya perselisihan mereka menjadikan sebagai sebab terus terjadinya perselisihan di antara mereka itu. بَغْيًۢا بَيْنَهُمْ ۚ (karena kedengkian yang ada di antara mereka) Yakni karena sebagian mereka menzalimi sebagian yang lain karena mengharap kekuasaan. إِنَّ رَبَّكَ يَقْضِى بَيْنَهُمْ يَوْمَ الْقِيٰمَةِ فِيمَا كَانُوا۟ فِيهِ يَخْتَلِفُونَ(Sesungguhnya Tuhanmu akan memutuskan antara mereka pada hari kiamat terhadap apa yang mereka selalu berselisih padanya) Yakni berselisih tentang urusan agama mereka. Dan Allah akan membalas kebaikan orang yang berbuat baik dan membalas keburukan orang yang berbuat buruk, dan membedakan antara orang yang benar dan orang yang salah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17. Kami memberi mereka bukti-bukti nyata tentang urusan-urusan agama di antaranya adalah mukjizat atau bukti-bukti penegas tentang nubuwwah penutup para nabi, sehingga tidak terjadi pertentangan di antara mereka tentang urusan agama kecuali setelah turunnya pengetahuan kepada mereka tentang penjelasan prinsip-prinsip agama dan hukum-hukum halal-haram, lalu terjadilah permusuhan dan kedengkian di antara sebagian mereka, dan mereka mencari-cari pemimpin. Wahai Nabi, sesungguhnya Tuhanmu menentukan hukum tentang keyakinan yang berbeda-beda di antara mereka pada hari kiamat. Dia membalas setiap manusia dengan sesuatu yang layak bagi mereka, baik ataupun buruk. {Yaqdhi} maknanya adalah keputusan dengan menegur dan membalas."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami telah menganugerahkan kepada mereka keterangan-keterangan yang jelas tentang perkata} dalil-dalil tentang perkara agama yang menjelaskan tentang yang benar daripada yang bathil {Lalu mereka tidak berselisih, kecuali setelah datang ilmu kepada mereka karena kedengkian} kedengkian dan permusuhan {di antara mereka. Sesungguhnya Tuhanmu akan memutuskan di antara mereka pada hari kiamat apa yang selalu mereka perselisihkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17. “dan kami berikan kepada mereka,” yakni, kami memberikan untuk bani israil “keterangan-keterangan yang nyata,” yakni berbagai bukti yang membedakan antara kebenaran dan kebatilan,”tentang urusan (agama),” yang disampaikan oleh Allah kepada mereka. Tanda-tanda kebesaran itulah mukjizat yang disaksikan oleh bani israil melalui tangan nabi musa, semua nikmat yang diberikan oleh Allah untuk bani israil tersebut mengharuskan mereka supaya menggunakannya sebaik mungkin dan supaya mereka bersatu di atas kebenaran yang telah dijelaskan oleh Allah. Namun ternyata tidak demikian halnya. Justru sebaliknya, dimana mereka menyikapinya dengan lawan dari yang seharusnya. Mereka terpecah-pecah justru pada prinsip di mana mereka diperintahkan untuk bersatu padaanya, “maka mereka tidak berselisih melainkan sesudah datang kepada mereka pengetahuan,” yakni, yang mengharuskan tidak adanya perpecahan, dan yang membuat mereka berpecah hanya karena dengki di antara mereka serta kezhaliman. “sesungguhnya Rabbmu akan memutuskan antara mereka pada hari kiamat terhadap apa yang mereka selalu berselisih padanya,” Allah akan membedakan orang-orang yang benar dan orang-orang yang salah, berikut yang menyebabkan mereka bercerai berai menyelisihi kebenaran, hawa nafsu atau lainnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Jatsiyah ayat 17: (Dan Kami berikan kepada mereka keterangan-keterangan yang nyata tentang urusan) agama, menyangkut masalah halal dan haram, serta berita tentang akan diutusnya Nabi Muhammad saw. (maka mereka tidak berselisih) tentang diutusnya Nabi Muhammad (melainkan sesudah datang kepada mereka pengetahuan karena permusuhan di antara mereka) karena permusuhan yang ada di antara mereka sebab mereka dengki kepada Nabi Muhammad. (Sesungguhnya Rabbmu akan memutuskan antara mereka pada hari kiamat terhadap apa yang mereka selalu berselisih padanya.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Seperti tentang yang halal dan yang haram dan tentang pengutusan Nabi Muhammad shallallahu 'alaihi wa sallam. Ayat ini bisa juga diartikan dengan, “Dan Kami berikan kepada mereka keterangan-keterangan yang jelas dari perkara (qadari).” Yakni yang Allah Subhaanahu wa Ta'aala sampaikan kepada mereka. Keterangan yang jelas ini menurut Syaikh As Sa’diy adalah mukjizat-mukjizat yang mereka lihat di tangan Nabi Musa ‘alaihis salam. Nikmat-nikmat yang Allah Subhaanahu wa Ta'aala berikan kepada Bani Israil ini menghendaki mereka mengikuti yang hak secara sempurna dan berkumpul di atas yang hak yang telah Allah terangkan kepada mereka, akan tetapi kenyataannya berbeda, mereka malah melakukan sebaliknya; mereka berpecah belah dalam hal yang mereka diperintahkan untuk berkumpul di atasnya. Oleh karena itu, Allah Subhaanahu wa Ta'aala berfirman, “Maka mereka tidak berselisih kecuali setelah datang ilmu kepada mereka, karena kedengkian yang ada di antara mereka.” Ilmu yang datang kepada mereka menghendaki mereka agar tidak berselisih, tetapi mereka malah berselisih disebabkan kedengkian mereka antara yang satu dengan yang lain dan disebabkan kezaliman. Tentang kerasulan Muhammad shallallahu 'alaihi wa sallam. Seperti kedengkian mereka kepada Nabi Muhammad shallallahu 'alaihi wa sallam. Dia akan memisahkan yang hak dengan yang batil."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Jatsiyah Ayat 17",
    "description": "Dan juga kami telah berikan kepada mereka keterangan-keterangan, sebagai bukti-bukti yang jelas tentang urusan agama; maka sangat buruk sikap mereka karena mereka tidak berselisih kecuali setelah datang kepada mereka ilmu, pengetahuan yang sebenarnya dapat menyatukan mereka. Perselisihan mereka itu terjadi karena kedengkian yang ada di antara me-reka. Sungguh, tuhanmu, yang memelihara dan membimbingmu, wahai nabi Muhammad, akan memberi putusan kepada mereka pada hari kiamat terhadap apa yang selalu mereka perselisihkan sewaktu mereka hidup di dunia. 18. Kemudian setelah terjadi perselisihan di antara mereka, kami jadikan engkau, wahai nabi Muhammad, mengikuti syariat peraturan dari agama itu yang mengantarkan engkau kepada kebenaran, maka ikutilah, yakni laksanakanlah syariat yang diturunkan kepadamu itu dan janganlah engkau ikuti keinginan orang-orang kafir quraisy dan orang-orang yang ingkar seperti mereka yang tidak mengetahui kebenaran, ke-esaan Allah, dan syariat yang di turunkan kepadamu."
  }
]