[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian Kami menjadikanmu (wahai Rasul) di atas jalan yang terang dalam perkara agama, maka ikutilah syariat dimana Kami menjadikanmu di atasnya, jangan mengikuti hawa nafsu orang-orang yang tidak mengetahui syariat Allah yang tidak mengetahui kebenaran. Ayat ini mengandung dalil besar atas kesempurnaan agama ini dan kemuliaannya, serta kewajiban untuk tunduk kepada hukumnya dengan tidak condong kepada hawa nafsu orang-orang kafir lagi ingkar."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Kemudian Kami jadikan kamu -wahai Rasul- berada di atas syariat, sunah dan metode Islam seperti rasul-rasul sebelummu. Engkau mengajak kepada keimanan dan amal saleh. Maka ikutilah syariat ini dan janganlah engkau mengikuti hawa nafsu orang-orang yang tidak mengerti kebenaran, karena hawa nafsu mereka menyesatkan dari kebenaran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "18-19. Hai Rasulullah, Kami syariatkan bagimu syariat yang sempurna dari perintah dan wahyu Kami, yang mengajak kepada segala kebaikan dan melarang segala keburukan; maka ikutilah syariat itu dengan sekuat tenaga, dan janganlah kamu mengikuti kesesatan orang-orang musyrik dan tidak berilmu, karena mereka tidak akan mampu menjauhkan sedikitpun azab dari Allah jika kamu mengikuti hawa nafsu mereka. Ayat ini merupakan peringatan bagi umat Nabi Muhammad, karena beliau terjaga dan tidak mungkin melakukan hal itu. Dan orang-orang yang menzalimi diri sendiri dengan melakukan kesyirikan dan dosa-dosa besar adalah orang-orang yang saling tolong menolong. Namun Allah akan menolong orang-orang yang bertakwa dan mentaati-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "18. ثُمَّ جَعَلْنٰكَ عَلَىٰ شَرِيعَةٍ مِّنَ الْأَمْرِ (Kemudian Kami jadikan kamu berada di atas suatu syariat (peraturan) dari urusan (agama itu)) Kami menjadikanmu hai Muhammad, di atas jalan yang jelas dalam agama, yang dapat mengantarkanmu kepada kebenaran. فَاتَّبِعْهَا(maka ikutilah syariat itu) Yakni kerjakanlah hukum-hukum dalam syariat itu terhadap umatmu. وَلَا تَتَّبِعْ أَهْوَآءَ الَّذِينَ لَا يَعْلَمُونَ (dan janganlah kamu ikuti hawa nafsu orang-orang yang tidak mengetahui) Yakni yang tidak mengetahui keesaan Allah dan syari’at-syari’at Allah bagi hamba-hamba-Nya. Mereka adalah orang-orang yang tidak mengikuti syariat Islam."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "18. Wahai Rasulallah, kemudian kami menjadikanmu berada di atas jalan yang terang dalam urusan agama. Jalan yang akan membuatmu sampai kepada kebenaran. Maka tunaikanlah syariat-syariat yang diturunkan kepadamu dan janganlah mengikuti hawa nafsu orang-orang kafir Quraisy dan orang-orang yang tidak mengesakan Allah dan tidak mengerjakan syariatNya yang menyeru agar kamu mengikuti keyakinan mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kemudian Kami menjadikan kamu mengikuti syariat dari urusan itu} cara dan jalan dari urusan agama itu {Maka ikutilah dan janganlah mengikuti hawa nafsu orang-orang yang tidak mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "18. maksudnya, kemudian kami menetapkan syariat yang sempurna untukmu yang menyerukan pada semua kebaikan dan mencegah perbuatan buruk dari syariat yang kami perintahkan “maka ikutilah syariat itu,” karena mengikuti syariat akan dapat membawa kebahagiaan abadi, kebaikan, dan kemenangan. “dan janganlah kamu ikuti hawa nafsu orang-orang yang tidak mengetahui,” yaitu orang-orang yang keinginannya tidak mengikuti ilmu dan tidak berjalan di belakang ilmu. Mereka adalah semua orang yang keinginannya hanya untuk menentang syariat Rasulullah. Itulah di antara keinginan dan hawa nafsu orang-orang yang tidak berilmu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Jatsiyah ayat 18: (Kemudian Kami jadikan kamu) hai Muhammad (berada di atas suatu syariat) yakni peraturan (dari urusan itu) dari urusan agama (maka ikutilah syariat itu dan janganlah kamu ikuti hawa nafsu orang-orang yang tidak mengetahui) untuk menyembah kepada selain Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni kemudian Kami mensyariatkan kepadamu syariat yang sempurna yang mengajak kepada semua kebaikan dan melarang semua keburukan yang berasal dari perintah Kami yang syar’i. Karena dengan mengikutinya seseorang akan bahagia, baik dan beruntung. Yaitu mereka yang keinginannya tidak mengikuti ilmu dan tidak berjalan di belakangnya. Mereka ini adalah orang-orang yang hawa nafsunya tidak sejalan dengan syariat Rasulullah shallallahu 'alaihi wa sallam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Jatsiyah Ayat 18",
    "description": "Kemudian setelah terjadi perselisihan di antara mereka, kami jadikan engkau, wahai nabi Muhammad, mengikuti syariat peraturan dari agama itu yang mengantarkan engkau kepada kebenaran, maka ikutilah, yakni laksanakanlah syariat yang diturunkan kepadamu itu dan janganlah engkau ikuti keinginan orang-orang kafir quraisy dan orang-orang yang ingkar seperti mereka yang tidak mengetahui kebenaran, ke-esaan Allah, dan syariat yang di turunkan kepadamu. 19. Sungguh, mereka yang kafir dan tidak mengikuti kebenaran itu tidak akan dapat menghindarkan engkau, wahai nabi Muhammad, sedikit pun dari azab Allah. Dan sungguh, orang-orang yang zalim itu sebagian mereka menjadi pelindung atas sebagian yang lain dalam melakukan perbuatan dosa, sedangkan Allah pelindung bagi orang-orang yang bertakwa."
  }
]