[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang yang menyekutukan Tuhan mereka yang mengajakmu untuk memgikuti hawa nafsu mereka, sama sekali tidak membantumu (wahai rasul) di depan hukum allah bila kamu mengikuti hawa nafsu mereka. Dan sesungguhnya orang-orang zhalim yang melampaui batasan-batasan Allah dari kalangan orang-orang munafik, Yahudi dan lainnya, sebagian adalah pendukung sebagian yang lainnya untuk melawan orang-orang yang beriman kepada Allah yang menaatiNya, dan Allah adalah penolong orang-orang yang bertakwa kepada Tuhan mereka dengan menjalankan apa yang Dia perintahkan dan menjauhi apa yang Dia larang."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Sesungguhnya orang-orang yang tidak mengerti kebenaran sedikitpun tidak akan mampu menahan siksa Allah dari dirimu jika engkau mengikuti hawa nafsu mereka. Dan sesungguhnya orang-orang yang zalim pada setiap agama dan aliran, sebagian dari mereka merupakan penolong atas sebagian yang lain dan menjadi pembelanya dalam menghadapi orang-orang yang beriman. Dan Allah adalah penolong bagi orang-orang yang bertakwa kepada-Nya dengan mengerjakan segala perintah-Nya dan menjauhi segala larangan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "19. إِنَّهُمْ لَن يُغْنُوا۟ عَنكَ مِنَ اللهِ شَيْـًٔا ۚ (Sesungguhnya mereka sekali-kali tidak akan dapat menolak dari kamu sedikitpun dari siksaan Allah) Yakni mereka tidak akan dapat melindungimu sedikitpun dari apa yang dikehendaki Allah jika kamu mengikuti mereka. وَإِنَّ الظّٰلِمِينَ بَعْضُهُمْ أَوْلِيَآءُ بَعْضٍ ۖ( Dan Sesungguhnya orang-orang yang zalim itu sebagian mereka menjadi penolong bagi sebagian yang lain) Yakni mereka saling tolong menolong. وَاللهُ وَلِىُّ الْمُتَّقِينَ(dan Allah adalah pelindung orang-orang yang bertakwa) Yakni penolong mereka. Dan yang dimaksud dengan orang-orang yang bertakwa yakni orang-orang yang menjauhi kemusyrikan dan kemaksiatan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19. Sesungguhnya orang-orang musyrik itu adalah orang-orang bodoh yang tidak tahu apa-apa. Jika kamu mengikuti hawa nafsu mereka, maka mereka tidak akan pernah melindungimu dari azab Allah. Sesungguhnya orang-orang kafir itu saling menolong satu sama lain dalam kebathilan dan Allah adalah penolong orang-orang bertakwa yang menjauhi kesyirikan dan kemaksiatan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya mereka sekali-kali tidak akan dapat menghindarkan kamu sedikit pun dari (azab) Allah} tidak dapat melindungimu dari azab Allah {Sesungguhnya orang-orang zalim itu sebagian mereka menjadi pelindung bagi sebagian yang lain. Adapun Allah adalah pelindung orang-orang bertakwa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "19. “sesungguhnya mereka sekali-kali tidak akan dapat menolak dari kamu sedikitpun dari (siksaan) Allah,” artinya, mereka tidak berguna untukmu di hadapan Allah sehingga mencegah keburukan darimu jika engkau mengikuti keinginan-keinginan mereka. Engkau dan mereka amat berbeda dan sevagian dari mereka adalah penolong atas sebaian yang lain. “dan Allah adalah pelindung orang-orang yang bertakwa,” yang akan mengeluarkan mereka dari kegelapan menuju cahaya karena ketakwaan dan ketaan mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Jatsiyah ayat 19: (Sesungguhnya mereka sekali-kali tidak akan dapat memberikan manfaat) mereka tidak akan dapat menolak (atas kamu dari siksaan Allah) yakni azab-Nya (barang sedikit pun. Dan sesungguhnya orang-orang yang zalim itu) orang-orang kafir itu (sebagian mereka menjadi penolong bagi sebagian yang lain dan Allah adalah Pelindung orang-orang yang bertakwa.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya mereka tidak bermanfaat bagimu di sisi Allah; mereka tidak dapat memberikan kebaikan kepadamu dan tidak dapat menghindarkan keburukan darimu jika kamu mengikuti keinginan mereka. Oleh karena itu, kamu tidak pantas sejalan dan sepakat dengan mereka karena kamu dan mereka berbeda, sedangkan mereka menjadi pelindung antara sesama mereka. Dia akan mengeluarkan mereka dari kegelapan kepada cahaya disebabkan ketakwaan mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Jatsiyah Ayat 19",
    "description": "Sungguh, mereka yang kafir dan tidak mengikuti kebenaran itu tidak akan dapat menghindarkan engkau, wahai nabi Muhammad, sedikit pun dari azab Allah. Dan sungguh, orang-orang yang zalim itu sebagian mereka menjadi pelindung atas sebagian yang lain dalam melakukan perbuatan dosa, sedangkan Allah pelindung bagi orang-orang yang bertakwa. 20. Wahyu berupa Al-Qur'an ini dan tuntunan yang diturunkan kepadamu adalah pedoman dan bukti bagi manusia, petunjuk dan rahmat bagi kaum yang meyakini adanya tuhan yang maha esa."
  }
]