[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Al-Quran yang Kami turunkan kepadamu ini (wahai Rasul) adalah penerang, dengannya manusia melihat antara yang haq dengan yang batil, dengannya mereka mengetahui jalan yang lurus, petunjuk dan rahmat bagi kaum yang meyakini kebenaran sejatinya dan bahwa ia diturunkan dari Allah yang Maha perkasa lagi Maha bijaksana."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "20. Al-Qur`ān yang diturunkan kepada Rasul kita ini adalah pedoman yang digunakan oleh manusia untuk melihat kebenaran dari kebatilan, petunjuk menuju kebenaran serta rahmat bagi orang-orang yang meyakininya, karena merekalah yang mendapat petunjuk dengannya menuju jalan yang lurus karena rida dari Rabb mereka, lalu Dia memasukkan mereka ke dalam Surga dan menjauhkan mereka dari Neraka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "20. Al-Qur’an ini merupakan wahyu yang diturunkan sebagai petunjuk bagi para hamba, sehingga mereka dapat mengetahui apa yang medatangkan manfaat dan apa yang membawa mudharat, dan memberi mereka petunjuk menuju jalan yang benar, dan ia merupakan rahmat yang luas dari Allah bagi orang-orang yang mengimani adanya hari perhitungan, pahala, dan siksaan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "20. هٰذَا (Al Quran ini) Yakni pengabaran ini yang disampaikan lewat lisanmu agar mengikuti syariat Allah dan Dia adalah pelindung orang-orang yang mengikuti syariat itu dan pelindung syariat itu sendiri adalah بَصٰٓئِرُ لِلنَّاسِ(adalah pedoman bagi manusia) Yakni bukti-bukti dan petunjuk-petunjuk mereka dalam urusan agama yang mereka butuhkan. وَهُدًى(petunjuk) Yang menuntun orang-orang yang mengamalkannya menuju surga. وَرَحْمَةٌ(dan rahmat) Rahmat dari Allah di akhirat kelak. لِّقَوْمٍ يُوقِنُونَ(bagi kaum yang meyakini) Yakni mereka selalu yakni tanpa keraguan dan kegoncangan akibat syubhat-syubhat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20. Al-Qur’an dan ayat-ayatnya ini merupakan pemberi pengelihatan dan pencahaya bagi hati, bukti-bukti tentang hukum agama, petunjuk dari kesesatan, pembimbing menuju jalan kemenangan berupa surga dan ridha Allah, dan nikmat dari Allah bagi kaum yang mencari keyakinan dan benar-benar beriman terhadap hari kebangkitan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ini adalah pedoman bagi manusia} pengetahuan bagi manusia yang memperlihatkan pada kebenaran daripada kebathilan {petunjuk, dan rahmat bagi kaum yang meyakini"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "20. artinya, al-qur’an dan peringatan yang bijak “ini” adalah “pedoman bagi manusia,” artinya, dengan al-qur’an tersebut manusia mendapat petunjuk untuk berbagai hal sehingga orang-orang yang beriman akan mendapatkan manfaat, dan juga sebagai, “petunjuk dan rahmat bagi kaum yang meyakini,” dengan al-qur’an ini orang-orang yang beriman akan mendapat petunjuk menuju jalan yang lurus diberbagai masalah-masalah pkok agama maupun cabangnya. Dengan al-qur’an tersebut orang-orang yang beriman mendapatkan kebaikan dan kebahagiaan di dunia dan di akhirat. Inilah yang dimaksudkan kasih sayang. Dengan kasih sayang tersebut jiwa mereka menjadi bersih, akal sehat mereka bertambah dan keimanan mereka juga meningkat, sekaligus sebagai hujjah atas mereka yang menentang."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Jatsiyah ayat 20: (Inilah) Alquran ini (adalah pedoman bagi manusia) artinya, sebagai pedoman yang dijadikan sumber bagi mereka dalam masalah hukum-hukum dan hudud (petunjuk dan rahmat bagi kaum yang meyakini) adanya hari berbangkit."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan Al Qur’an diperoleh pandangan yang jelas dalam menyikapi semua masalah, sehingga orang-orang mukmin akan mendapatkan manfaat, petunjuk dan rahmat. Dengan Al Qur’an mereka memperoleh petunjuk ke jalan yang lurus baik dalam masalah ushul (dasar) maupun furu’ (cabang), demikian pula tercapai kebaikan, kesenangan, kebahagiaan di dunia dan akhirat, dan inilah rahmat. Dengannya jiwa mereka menjadi bersih, kecerdasan mereka bertambah, demikian pula keimanan dan keyakinan mereka dan dengannya hujjah pun menjadi tegak kepada orang yang tetap membangkang."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Jatsiyah Ayat 20",
    "description": "Wahyu berupa Al-Qur'an ini dan tuntunan yang diturunkan kepadamu adalah pedoman dan bukti bagi manusia, petunjuk dan rahmat bagi kaum yang meyakini adanya tuhan yang maha esa. 21. Allah kemudian mempertanyakan sikap orang-orang kafir apakah orang-orang yang melakukan kejahatan itu di dunia ini mengira bahwa kami akan memperlakukan mereka di akhirat kelak sama seperti orang-orang yang ber iman dan yang mengerjakan kebajikan, yaitu sama dalam kehidupan dan kematian mereka' tentulah tidak sama. Alangkah buruknya penilaian mereka itu."
  }
]