[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah orang-orang yang melakukan keburukan-keburukan, mendustakan para Rasul, menyelisihi perintah Tuhan mereka dan menyembah selainNya mengira bahwa Kami menjadikan mereka seperti orang-orang yang beriman kepada Allah, membenarkan para RasulNya dan mengerjakan amal shalih serta mengikhlaskan ibadah hanya kepadaNya semata tidak kepada selainNya, apakah Kami menyamakan kedua kubu terdebut di dunia dan di akhirat? Keputusan mereka benar-benar buruk saat mereka menyamakan orang-orang durhaka dengan orang-orang shalih di akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Apakah orang-orang yang melakukan kekufuran dan kemaksiatan dengan anggota tubuhnya menyangka bahwa dalam hal pembalasan Kami akan menjadikan mereka sama seperti orang-orang yang beriman kepada Allah dan mengerjakan amal saleh sehingga menyamakan mereka di dunia dan di Akhirat. Alangkah buruknya persangkaan mereka itu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "21-22. Allah mengingkari para pelaku kemaksiatan: Apakah orang-orang yang melakukan dosa-dosa besar dan kejahatan itu mengira Kami akan menjadikan mereka seperti orang-orang beriman yang mengerjakan alam shalih dan menyamakan mereka dalam memberi perhitungan di dunia dan di akhirat? Sungguh itu adalah seburuk-buruk perkiraan. Allah menciptakan tujuh langit dan bumi dengan adil. Dan setiap jiwa akan mendapat balasan di akhirat atas kebaikan atau keburukan yang telah dia perbuat. Mereka sama sekali tidak terzalimi dengan pengurangan pahala atau penambahan siksaan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "21. أَمْ حَسِبَ الَّذِينَ اجْتَرَحُوا۟ السَّيِّـَٔاتِ (Apakah orang-orang yang membuat kejahatan itu menyangka) Yakni orang-orang yang melakukan keburukan dan dosa dengan sengaja. أَن نَّجْعَلَهُمْ كَالَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ الصّٰلِحٰتِ(bahwa Kami akan menjadikan mereka seperti orang-orang yang beriman dan mengerjakan amal saleh) Yakni Kami samakan antara mereka yang melakukan keburukan dengan orang-orang yang berbuat kebaikan. سَوَآءً مَّحْيَاهُمْ وَمَمَاتُهُمْ ۚ( yaitu sama antara kehidupan dan kematian mereka?) Yakni di kehidupan dunia dan kehidupan akhirat? Sungguh mereka tidak sama. Karena keadaan orang-orang baik di akhirat tidak sama dengan keadaan orang jahat. Keadaan mereka di dunia mungkin saja sama, bahkan bisa jadi orang-orang jahat memiliki harta yang lebih banyak; oleh sebab itu, jika mereka juga sama ketika di akhirat maka itu bukanlah hal yang adil. Maka janganlah kalian ketidakadilan itu akan terjadi. سَآءَ مَا يَحْكُمُونَ (Amat buruklah apa yang mereka sangka itu) Yakni amat buruklah ketetapan orang yang menetapkan sesuai dengan persangkaan mereka itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "21. Ataukah orang-orang yang melakukan kekufuran dan kemaksiatan itu beranggapan bahwa Kami akan menjadikan mereka di akhirat layaknya orang-orang yang beriman kepada Allah, rasulNya, kitab-kitabNya dan hari kiamat, serta mengerjakan amal ibadah yang diperintahkan oleh Allah. Mereka beranggapan bahwa kami akan menyamakan orang-orang yang berbuat keburukan dengan orang-orang yang berbuat kebaikan, atau kami menjadikan mereka sama dalam penghisaban di kehidupan setelah mati. Ini adalah seburuk-buruk ketentuan yang mereka tentukan dengan menyamakan dua golongan. {Am} berfungsi untuk pengingkaran dan memutus kalimat sebelumnya. Maknanya adalah pengingkaran terhadap asumsi atau anggapan itu, maknanya adalah Ataukah. Ayat ini diturunkan untuk tiga orang musyrik yaitu Utbah, Syaibah dan Walid bin Utbah. Mereka berkata kepada tiga orang mukmin: “Kondisi kami di akhirat lebih baik daripada kondisi kalian, sebagaimana sesungguhnya keadaan kami lebih baik daripada kalian di dunia”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ataukah orang-orang yang melakukan} yang mengerjakan {keburukan itu mengira} mengira {bahwa Kami akan menjadikan mereka seperti orang-orang yang beriman dan beramal shalih, yaitu sama dalam kehidupan dan kematian mereka. Betapa buruk apa yang mereka tetapkan itu} betapa buruk apa yang mereka putuskan itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21. maksudnya, apakah orang-orang yang bergelimang dalam dosa dan malas dalam menunaikan hak-hak Rabb mereka mengira, “kami akan menjadikan mereka seperti orang-orang yang beriman dan mengerjakan amal yang shalih,” seperti orang-orang yang menunaikan hak-hak Rabb mereka dan menjauhi larangan-laranganNYa. Orang-orang yang berbuat dosa itu tetap saja mengedepankan hawa nafsu diri mereka. Dengan kata lain, apakah mereka mengira kedua golongan tersebut sama saja, baik di dunia maupun di akhirat? Termasuk buruk perkiraan dan dugaan mereka dana mat buruk keputusan mereka. Hukum tersebut bertentangan dengan hukum yang dibuat oleh hakim yang paling adil dan juga bersebrangan dengan akal dan fitrah sehat. Bertentangan dengan berbagai kitab yang diberitakan oleh para rasul. Hukum pasti menyebutkan, bahwa orang-orang yang beriman dan mengerjakan amal kebaikan akan mendapatkan pertolongan, kebahagiaan, dan pahala, baik di dunia maupun di akhirat berdasarkan kebaikan dan mereka lakukan, sedangkan orang-orang yang bergelimang dosa akan mendapatkan azab, murka, penghinaan, dan kesengsaraan, baik di dunia maupun di akhirat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Jatsiyah ayat 21: . (Apakah) lafal Am di sini maknanya sama dengan Hamzah yang menunjukkan makna ingkar (berprasangka orang-orang yang mengerjakan) orang-orang yang melakukan (kejahatan) kekafiran dan kemaksiatan (bahwa Kami akan menjadikan mereka seperti orang-orang yang beriman dan mengerjakan amal yang saleh, yaitu sama) lafal Sawaa-an ini menjadi Khabar (antara kehidupan dan kematian mereka?) menjadi Mubtada dan Ma'thuf, sedangkan Jumlah kalimat ini menjadi Badal dari huruf Kaf yang ada pada lafal Kalladziina, dan kedua Dhamirnya kembali kepada orang-orang kafir. Makna ayat, apakah mereka berprasangka bahwasanya Kami menjadikan mereka di akhirat sama dengan orang-orang mukmin, yaitu mereka hidup dalam kesejahteraan yang sama dengan kehidupan mereka sewaktu di dunia. Karena mereka telah mengatakan kepada orangorang mukmin: \"Sungguh jika kami dibangkitkan hidup kembali, niscaya kami akan diberi kebaikan seperti apa yang diberikan kepada kalian.\" Lalu Allah berfirman menyangkal dugaan mereka sesuai dengan pengertian ingkar yang terkandung di dalam permulaan ayat. (Amat buruklah apa yang mereka sangka itu) maksudnya, perkara yang sebenarnya tidaklah demikian, karena sesungguhnya mereka di akhirat berada di dalam azab, berbeda dengan keadaan kehidupan mereka sewaktu di dunia. Sedangkan orang-orang mukmin di akhirat, mereka mendapatkan pahala yang berlimpah disebabkan amal perbuatan mereka sewaktu di dunia, yaitu berupa amal salat, amal zakat, amal puasa dan amal-amal lainnya. Huruf Maa pada ayat ini adalah Mashdariyah, yakni, seburuk-buruknya keputusan adalah keputusan mereka itu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu mereka yang banyak dosa dan meremehkan hak Tuhan mereka. Yaitu mereka yang memenuhi hak-hak Tuhan mereka, menjauhi kemurkaan-Nya, dan senantiasa mengutamakan keridhaan Tuhan mereka daripada hawa nafsu mereka. Maksudnya, apakah orang-orang kafir mengira bahwa mereka akan disamakan dengan kaum mukmin di akhirat, yakni berada dalam kebaikan dan kenikmatan seperti halnya orang-orang mukmin. Bahkan tidak demikian, mereka (orang-orang kafir) di akhirat berada dalam azab, kehinaan, dan kesengsaraan tidak seperti keadaan mereka ketika di dunia, sedangkan kaum mukmin di akhirat mendapatkan pahala, kemenangan, keberuntungan, kebahagiaan karena amal mereka ketika di dunia, seperti shalat, zakat, puasa, dsb. Hal itu karena keputusan tersebut menyelisihi kebijaksanaan hakim yang paling baik dan paling adil, yaitu Allah Subhaanahu wa Ta'aala. Keputusan tersebut juga bertentangan dengan akal yang sehat dan fitrah yang lurus, bertentangan dengan kitab-kitab yang diturunkan dan bertentangan dengan apa yang dibawa para rasul."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Jatsiyah Ayat 21",
    "description": "Allah kemudian mempertanyakan sikap orang-orang kafir apakah orang-orang yang melakukan kejahatan itu di dunia ini mengira bahwa kami akan memperlakukan mereka di akhirat kelak sama seperti orang-orang yang ber iman dan yang mengerjakan kebajikan, yaitu sama dalam kehidupan dan kematian mereka' tentulah tidak sama. Alangkah buruknya penilaian mereka itu. 22. Dan Allah menciptakan langit dan bumi dengan tujuan yang benar, yakni penuh hikmah dan aturan untuk menunjukkan ke-esaan dan kekuasaan-Nya, dan agar setiap jiwa, yakni manusia, diberi balasan sesuai dengan apa, yakni amal yang dikerjakannya, dan mereka tidak akan di rugikan dalam menerima balasan amalnya itu."
  }
]