[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah menciptakan langit dan bumi dengan kebenaran, keadilan dan hikmah, dan agar Dia membalas setiap jiwa di akhirat sesuai dengan apa yang diusahakannya, baik atau buruk, dan mereka tidak dizhalimi, sebagai balasan atas amal perbuatan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "22. Dan Allah menciptakan langit dan bumi dengan hikmah yang tinggi dan Dia tidak menciptakan keduanya dengan sia-sia, dan agar setiap jiwa mendapatkan balasannya atas perbuatannya yang baik maupun yang buruk. Dan Allah tidak menganiaya mereka dengan mengurangi kebaikan mereka tidak pula dengan menambah kejahatan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "22. Allah meciptakan langit dan bumi dengan haq. Ciptaan yang haq itu memerlukan keadilan dan adanya perbedaan antara orang yang berbuat kebaikan dan orang yang berbuat keburukan. Maknanya bahwa sesungguhnya Allah menakdirkan hal tersebut untuk menyempurnakan keadilan, agar setiap jiwa dibalas sesuai dengan apa yang dikerjakannya berupa ketaatan dan kemaksiatan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Allah menciptakan langit dan bumi dengan benar dan agar setiap jiwa diberi balasan sesuai dengan apa yang diusahakan dan mereka tidak akan dizalimi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "22. maknanya, Allah menciptakan langit dan bumi berdasarkan hikmah dan agar hanya Allah semata yang disembah, yang tidak ada bagiNya. Kemudian setelah itu Allah memberikan balasan bagi orang yang diperintahkan untuk beribadah kepadaNYa dan dikaruniai berbagai nikmat yang nampak dan tidak; apakah mereka mau bersyukur kepada Allah dan melaksanakan yang diperintahkan ataukah mereka justru kufur sehingga layak mendapatkan balasan orang-orang kafir?"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Jatsiyah ayat 22: (Dan Allah menciptakan langit dan) menciptakan (bumi dengan tujuan yang benar) lafal Bil haqqi ber-ta'alluq kepada lafal Khalaqa; penciptaan langit dan bumi itu dimaksud untuk menunjukkan kekuasaan dan keesaan-Nya (dan agar dibalasi tiap-tiap diri terhadap apa yang dikerjakannya) yaitu kemaksiatan dan ketaatan yang dilakukannya, maka tidaklah sama balasan yang diterima orang kafir dan orang mukmin (dan mereka tidak akan dirugikan.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Untuk menunjukkan kekuasaan dan keesaan-Nya. Atau maksud “bil haq” adalah dengan hikmah (kebijaksanaan) dan agar Dia diibadahi saja, selanjutnya Dia akan menghisab mereka setelah itu, yakni setelah mereka diperintahkan beribadah dan dikaruniakan berbagai nikmat, apakah mereka bersyukur dan mengerjakan perintah-Nya atau tidak? Atau bahkan mereka malah kufur dan meninggalkan perintah-Nya? Baik berupa ketaatan atau kemaksiatan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Jatsiyah Ayat 22",
    "description": "Dan Allah menciptakan langit dan bumi dengan tujuan yang benar, yakni penuh hikmah dan aturan untuk menunjukkan ke-esaan dan kekuasaan-Nya, dan agar setiap jiwa, yakni manusia, diberi balasan sesuai dengan apa, yakni amal yang dikerjakannya, dan mereka tidak akan di rugikan dalam menerima balasan amalnya itu. 23. Maka pernahkah kamu, wahai nabi Muhammad, melihat dan menyaksikan orang yang menyimpang dari fitrahnya dengan menjadikan hawa nafsunya sebagai tuhannya, dengan mengikuti dan menurutinya dan Allah membiarkannya sesat dan larut dalam kesesatannya itu dengan sepengetahuan-Nya, yakni ilmu Allah yang mahaluas, dan Allah telah mengunci pendengaran sehingga mereka tidak dapat mendengar kebenaran dan mengunci hatinya sehingga dia enggan meyakini kebenaran serta meletakkan tutup atas penglihatannya sehingga tidak dapat melihat bukti-bukti ke-esaan Allah di muka bumi ini' maka siapakah yang mampu memberinya petunjuk setelah Allah berpaling dan membiarkannya sesat' mengapa kamu, wahai kaum musyrik atau siapa pun juga, tidak meng-ambil pelajaran dari apa yang terjadi pada orang-orang yang sesat itu'."
  }
]