[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah kamu (wahai Rasul) tidak melihat orang yang menjadikan hawa nafsunya sebagai tuhannya, yang mana dia tidak menginginkan sesuatu kecuali dia melakukannya dan Allah menyesatkannya setelah sampainya ilmu kepadanya dan tegaknya hujjah atasnya, sehingga dia tidak mendengar nasihat-nasihat Allah dan tidak mengambil pelajaran darinya, Allah menutup rapat hatinya sehingga dia tidak memahami apa pun dengannya, dan Allah meletakkan penutup pada penglihatannya sehingga dia tidak melihat hujjah-hujjah Allah? maka siapa yang akan memberinya taufik untuk mendapatkan kebenaran dan jalan yang lurus setelah Allah menyesatkannya? Apakah kalian tidak mengingat (wahai manusia) sehingga kalian mengetahui bahwa siapa yang diperlakukan demikian oleh Allah, maka dia tidak akan mendapatkan petunjuk selamanya dan dia tidak akan menemukan penolong dan pembimbing untuk dirinya. Ayat ini adalah dasar yang memperingatkan agar jangan sampai hawa nafsu mendorong orang-orang Mukmin untuk amal-amal mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "23. Lihatlah -wahai Rasul- kepada orang yang mengikuti hawa nafsunya dan menjadikannya seperti sesembahan baginya yang ditaatinya. Allah telah menyesatkannya berdasarkan ilmu dari-Nya karena ia pantas untuk disesatkan, dan Allah mengunci hatinya sehingga ia tidak bisa mendengar sesuatu yang bermanfaat baginya, dan Allah menjadikan penutup pada mata hatinya yang menghalanginya dari melihat kebenaran. Maka siapakah orang yang mendapat kebenaran setelah disesatkan oleh Allah? Apakah mereka tidak memikirkan bahayanya mengikuti hawa nafsu dan manfaat dari mengikuti syariat Allah?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "23. Hai Rasulullah, sampaikan kepada-Ku tentang orang yang berpaling dari menyembah Allah lalu menyembah hawa nafsunya! Dan Allah menyesatkannya padahal dia mengetahui kebenaran, dan Allah menutup pendengaran dan hatinya sehingga dia tidak dapat mengambil pelajaran dan menghayatinya, dan Allah menutup penglihatannya sehingga dia tidak mampu melihat petunjuk; siapakah yang dapat memberinya petunjuk setelah dia dalam kesesatan itu?! Sungguh tidak ada yang mampu melakukan itu. mengapa kalian tidak mengambil pelajaran dari petunjuk ini?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "23. أَفَرَءَيْتَ مَنِ اتَّخَذَ إِلٰهَهُۥ هَوَىٰهُ (Maka pernahkah kamu melihat orang yang menjadikan hawa nafsunya sebagai tuhannya) Yakni orang kafir berbuat dalam agamanya sesuai dengan hawa nafsunya, tidaklah dia menginginkan sesuatu melainkan akan melampiaskannya tanpa memandang rasa cinta dari Allah dan keridhaan-Nya atau kebencian dan kemurkaan-Nya. Atau yang dimaksud adalah dia menyembah apa yang dia inginkan dan dia anggap baik. وَأَضَلَّهُ اللهُ عَلَىٰ عِلْمٍ(dan Allah membiarkannya berdasarkan ilmu-Nya) Yakni dia mengetahui mana kebenaran, dan mengetahui mana petunjuk dan kesesatan; namun dia meninggalkan kebenaran demi menuruti hawa nafsunya. وَخَتَمَ عَلَىٰ سَمْعِهِۦ وَقَلْبِهِۦ(dan Allah telah mengunci mati pendengaran dan hatinya) Yakni Allah menutup pendengarannya sehingga tidak dapat lagi mendengar nasehat, dan mengunci hatinya sehingga tidak dapat memahami petunjuk. وَجَعَلَ عَلَىٰ بَصَرِهِۦ غِشٰوَةً (dan meletakkan tutupan atas penglihatannya?) Yakni memberi penutup agar tidak dapat melihat petunjuk. فَمَن يَهْدِيهِ مِنۢ بَعْدِ اللهِ ۚ (Maka siapakah yang akan memberinya petunjuk sesudah Allah (membiarkannya sesat)) Yakni setelah Allah menyesatkan-Nya. أَفَلَا تَذَكَّرُونَ (Maka mengapa kamu tidak mengambil pelajaran?) Yakni apakah mereka tidak mengambil pelajaran dan ibrah, sehingga mereka meninggalkan hawa nafsu dan kesesatan dari petunjuk."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "23. Kabarkanlah kepadaku tentang jawaban dari pertanyaan berikut: “Siapa orang kafir yang menyembah sesuatu sesuai hawa nafsunya dan tidak menyembah tuhan yang sebenarnya?” Allah menelantarkannya, tidak membimbingnya menuju pengetahuan yang benar dan memilihkan kesesatan untuknya serta mengunci pendengaran dan hatinya sehingga dia tidak mendengar bimbingan yang bermanfaat baginya, tidak dapat berpikir dan memahami petunjuk. Dia juga menjadikan penglihatannya tertutup sehingga tidak dapat melihat suatu tuntunan. Lalu siapa yang akan menunjukkan dan membimbingnya setelah Allah menyesatkannya? Apakah kalian tidak mengambil pelajaran? {Man} adalah isim istifham yang berfungsi sebagai nafi. Maknanya adalah tidak ada satupun yang menunjukkannya. Maka sebaiknya kita merenung sampai kita benar-benar mengetahui hakikat suatu keadaan. Maqatil berkata: “Ayat ini diturunkan untuk Harits bin Qays As-Sahmiy yang merupakan salah satu orang yang mengolok-olok, karena dia menyembah sesuatu sesuai hawa nafsunya”. Sa’id bin Jabir berkata: ”Ayat ini diturunkan untuk kaum Quraisy yang terkadang menyembah batu. Jika mereka menemukan sesuatu yang lebih baik, mereka mengabaikan sesuatu yang pertama dan menyembah yang akhir. Adapun orang yang dikunci pendengaran dan hatinya adalah Abu Jahal”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah kamu melihat} Apakah kamu melihat {orang yang menjadikan hawa nafsunya sebagai Tuhannya dan dibiarkan sesat oleh Allah dengan pengetahuanNya dan telah mengunci} mengunci {pendengaran dan hatinya serta meletakkan penglihatannya penutup} penutup {maka siapakah yang mampu memberinya petunjuk setelah Allah. Apakah kalian tidak mengambil pelajaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "23. Allah berfirman, “maka pernahkah kamu melihat,” orang tersesat, “yang menjadikan hawa nafsunya sebagai sesembahannya?” semua yang diinginkan dilakukan tanpa peduli apakah bisa mendatangkan keridaahn Allah ataukah kemurkaanNYa. “dan Allah membiarkannya sesat berdasarkan ilmuNya.” Yakni, dari Allah dan orang tersebut tidak pantas mendapatkan hidayah dan tidak bisa dibersihkan hatinya di atas hidayah, “dan Allah telah mengunci mati pendengarannya,” sehingga tidak bisa mendengar hal-hal yang berguna,”dan hatinya,” sehingga tidak bisa mencerna kebaikan, “dan meletakkan tutupan atas penglihatannya,” yang menghalanginya untuk melihat kebenaran. “maka siapakah yang akan memberinya petunjuk sesudah Allah (membiarkannya sesat).” Artinya, tidak ada seorangpun yang memberinya petunjuk, karena Allah telah menutup baginya semua pintu hidayah dan membuka pintu kesesatan untuknya. Allah tidak menzhaliminya, tapi dia sendirilah yang menzhalimi dirinya dan yang melakukan berbagai hal yang mencegah rahmat Allah. “maka mengapa kamu tidak mengambil pelajaran,” yang berguna bagimu sehingga bisa kalian kerjakan dan pelajaran yang membahayakan kalian sehingga bisa kalian hindari."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Jatsiyah ayat 23: (Apakah kamu pernah melihat) maksudnya ceritakanlah kepadaku (orang yang menjadikan hawa nafsunya sebagai tuhannya) maksudnya, yang disukai oleh hawa nafsunya, yaitu batu demi batu ia ganti dengan yang lebih baik sebagai sesembahannya (dan Allah membiarkan-Nya sesat berdasarkan ilmu-Nya) berdasarkan pengetahuan Allah swt. Dengan kata lain Dia telah mengetahui, bahwa orang itu termasuk orang yang disesatkan sebelum ia diciptakan (dan Allah telah mengunci mati pendengaran dan hatinya) maka, karena itu ia tidak dapat mendengar petunjuk dan tidak mau memikirkannya (dan meletakkan tutupan atas penglihatannya) mengambil kegelapan hingga ia tidak dapat melihat petunjuk. Pada ayat ini diperkirakan adanya Maf'ul kedua bagi lafal Ra-ayta, yaitu lafal ayat tadi, yang artinya; apakah ia mendapat petunjuk? (Maka siapakah yang akan memberinya petunjuk sesudah Allah) membiarkannya sesat? Maksudnya, tentu saja ia tidak dapat petunjuk. (Maka mengapa kalian tidak mengambil pelajaran?) atau mengapa kalian tidak mau mengambilnya sebagai pelajaran buat kalian. Lafal Tadzakkaruuna asalnya salah satu dari huruf Ta-nya diidgamkan kepada huruf Dzal."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni apa yang diinginkan hawa nafsunya dia kerjakan, baik mendatangkan keridhaan Allah atau kemurkaan-Nya. Maksudnya Allah membiarkan orang itu sesat, karena Allah telah mengetahui bahwa orang itu tidak mau menerima petunjuk yang diberikan kepadanya sebelum ia diciptakan. Sehingga dia tidak dapat mendengar petunjuk dan tidak dapat memahami. Sehingga ia tidak dapat melihat petunjuk. Tidak ada seorang pun yang dapat memberinya hidayah ketika Allah Subhaanahu wa Ta'aala telah menutup pintu-pintu hidayah dan membuka pintu-pintu kesesatan. Allah tidaklah menzaliminya, akan tetapi dialah yang menzalimi dirinya dan yang mengadakan sebab untuk terhalang dari rahmat Allah. Bisa juga diartikan, “Tidakkah kamu ingat?” Yakni ingat sesuatu yang bermanfaat bagimu lalu kamu mengerjakannya dan ingat sesuatu yang bermadharrat sehingga kamu dapat menjauhinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Jatsiyah Ayat 23",
    "description": "Maka pernahkah kamu, wahai nabi Muhammad, melihat dan menyaksikan orang yang menyimpang dari fitrahnya dengan menjadikan hawa nafsunya sebagai tuhannya, dengan mengikuti dan menurutinya dan Allah membiarkannya sesat dan larut dalam kesesatannya itu dengan sepengetahuan-Nya, yakni ilmu Allah yang mahaluas, dan Allah telah mengunci pendengaran sehingga mereka tidak dapat mendengar kebenaran dan mengunci hatinya sehingga dia enggan meyakini kebenaran serta meletakkan tutup atas penglihatannya sehingga tidak dapat melihat bukti-bukti ke-esaan Allah di muka bumi ini' maka siapakah yang mampu memberinya petunjuk setelah Allah berpaling dan membiarkannya sesat' mengapa kamu, wahai kaum musyrik atau siapa pun juga, tidak meng-ambil pelajaran dari apa yang terjadi pada orang-orang yang sesat itu'24. Dan mereka, orang-orang musyrik dan yang mengingkari kebangkitan, berkata, 'ia, yakni kehidupan ini, tidak lain hanyalah kehidupan dunia kita saja, tidak ada kehidupan akhirat, sebahagian kita mati karena sampai ajalnya dan sebahagian kita hidup, yakni lahir lagi dan tidak ada yang membinasakan kita selain masa, yakni akhir dari kehidupan kita. ' tetapi mereka tidak mempunyai ilmu, yakni pengetahuan yang pasti, tentang itu, mereka hanyalah menduga-duga saja."
  }
]