[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang musyrik itu berkata, “Kehidupan hanyalah kehidupan dunia yang kami rasakan saat ini, tidak ada kehidupan sesudahnya.” Mereka mendustakan kebangkitan sesudah kematian. Mereka berkata, “Yang membinasakan kami hanyalah berlalunya hari-hari dan umur yang tua.” Mereka mengingkari adanya Tuhan yang membuat mereka fana dan membinasakan mereka. Padahal mereka tidak memiliki ilmu tentang hal ini, mereka hanya berbicaara dengan dasar dugaan, perkiraan daan khayalan belaka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. Orang-orang kafir yang mengingkari adanya kebangkitan berkata, “Tidak ada kehidupan kecuali kehidupan di dunia ini saja, tidak ada kehidupan lagi setelahnya. Banyak generasi telah meninggal, tidak ada yang kembali, dan tumbuhlah generasi-generasi lainnya. Dan tidaklah mematikan kami kecuali pergantian siang dan malam.” Mereka tidak mempunyai pengetahuan atas pengingkaran mereka terhadap adanya Hari Kebangkitan, mereka tiada lain hanyalah menduga-duga saja, sesungguhnya prasangka itu sedikitpun tidak berguna untuk mencapai kebenaran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "24-26. Orang-orang musyrik meyakini bahwa tidak ada kehidupan selain kehidupan di dunia ini; satu kaum akan mati kemudian kaum lain akan menggantikannya. Dan mereka meyakini bahwa tidak ada yang mematikan mereka melainkan perjalanan waktu. Akan tetapi mereka tidak memiliki bukti sesuai akal atau wahyu atas keyakinan itu, mereka hanya menerka-nerka tanpa memiliki bukti. Dan jika dibacakan kepada mereka ayat-ayat al-Qur’an yang jelas yang menunjukkan bukti-bukti keimanan kepada hari kebangkitan, mereka hanya dapat beralasan: “Bangkitkanlah nenek moyang kami yang telah mati jika perkataan kalian itu benar.” Hai Rasulullah, katakanlah kepada mereka: “Allah Yang telah menciptakan kalianlah yang akan mematikan kalian saat ajal kalian telah tiba, kemudian Dia akan membangkitkan kalian semua pada hari kiamat, hal itu tidak diragukan lagi. Akan tetapi kebanyakan manusia tidak mengetahui kuasa Allah untuk membangkitkan.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "24. وَقَالُوا۟ مَا هِىَ إِلَّا حَيَاتُنَا الدُّنْيَا (Dan mereka berkata: “Kehidupan ini tidak lain hanyalah kehidupan di dunia saja) Orang-orang yang percaya bahwa kehidupan hanya hasil dari berjalannya waktu mengatakan: kehidupan hanyalah kehidupan yang kita jalani sekarang saja. نَمُوتُ وَنَحْيَا (kita mati dan kita hidup) Kita akan hidup dan mati dalam kehidupan ini, namun tidak ada kehidupan setelahnya. Pendapat lain mengatakan, yakni kita akan mati dan anak keturunan kita akan melanjutkan kehidupan kita, kemudian mereka akan mati dan akan dilanjutkan oleh anak keturunan mereka, dan begitu seterusnya. وَمَا يُهْلِكُنَآ إِلَّا الدَّهْرُ ۚ(dan tidak ada yang akan membinasakan kita selain masa”) Yakni tidak lain hanyalah berjalannya siang dan malam. وَمَا لَهُم بِذٰلِكَ مِنْ عِلْمٍ ۖ(dan mereka sekali-kali tidak mempunyai pengetahuan tentang itu) Yakni mereka mengatakan hal ini melainkan karena mereka masih ragu dan tidak mengatahui kenyataan sebenarnya. إِنْ هُمْ إِلَّا يَظُنُّونَ(mereka tidak lain hanyalah menduga-duga saja) Yakni mereka hanya menyangka, dan hanya menyandarkan keyakinan mereka pada sangkaan saja."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "24. Orang-orang musyrik yang mengingkari hari kebangkitan berkata: “Tidak ada kehidupan selain kehidupan dunia yang sekarang ini. Kita akan mengalami kematian dan kelahiran. Di dalamnya sebagian orang mati dan sebagian lainnya lahir, dan tidak ada kehidupan yang lain. Tidak ada yang membinasakan kami kecuali seiring berjalannya waktu (karena sebagian bangsa Arab menghubungkan setiap peristiwa dengan waktu)” Lalu Allah menanggapi mereka: “Sesungguhnya mereka tidak mengatakan hal itu berdasarkan ilmu yang sebenarnya, melainkan hanya berdasarkan keragu-raguan atau hanya anggapan dan spekulasi” Abu Hurairah berkata: “Penduduk Arab Jahiliyah berkata: “Sesungguhnya yang membinasakan kami adalah malam dan siang”, kemudian Allah menurunkan ayat ini”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata,“Kehidupan ini tidak lain hanyalah kehidupan kami di di dunia saja, kita mati dan kita hidup, dan tidak ada yang membinasakan kita} tidak ada yang membinasakan kita {selain masa} selain masa silih bergantinya malam dan siang {Padahal mereka tidak mempunyai ilmu tentang itu. Mereka itu tidak lain kecuali menduga-duga"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "24. “dan mereka berkata,” yakni, mereka yang mengingkari hari kebangkitan, “kehidupan ini tidak lain hanyalah kehidupan di dunia saja, kita mati dan kita hidup dan tidak ada yang membinasakan kita selain masa.” Kehidupan ini tidak lain hanyalah kebiasaan rutin setiap hari dan setiap malam. Ada orang yang hidup dan ada orang yang mati dan orang yang sudah mati tidak akan kembali kepada Allah dan amal perbuatannya tidak akan diberi balasan. Perkataan yang mereka ucapakan ini tidak didasari ilmu, “mereka tidak lain hanyalah menduga-duga saja,” sehingga mereka pun mengingkari kebangkitan dan mendustkan para rasul tanpa didasari bukti dan dalil selain hanya didasarkan pada dugaan dan khayalan yang jauh dari kebenaran."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Jatsiyah ayat 24: (Dan mereka berkata) yaitu orang-orang yang ingkar akan adanya hari berbangkit, (\"Kehidupan ini) kehidupan yang sebenarnya (tiada lain hanyalah kehidupan kita) yang kita alami (di dunia saja, kita mati dan kita hidup) sebagian dari kita mati kemudian sebagian yang lain hidup karena mereka dilahirkan (dan tiada yang membinasakan kita selain masa\") atau berlalunya masa. Lalu Allah berfirman menyangkal perkataan mereka melalui firman-Nya: (dan mereka tidak mempunyai mengenai hal itu) mengenai perkataan mereka yang demikian tadi (pengetahuan sedikit pun, tiada lain) tidak lain (mereka hanyalah mendugaduga saja.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ibnu Jarir meriwayatkan dengan sanadnya yang sampai kepada Abu Hurairah dari Nabi shallallahu 'alaihi wa sallam, Beliau bersabda, “Orang-orang jahiliyyah mengatakan bahwa yang membinasakan kami adalah malam dan siang, itulah yang membinasakan kami, mematikan dan menghidupkan kami.” Maka Allah Subhaanahu wa Ta'aala berfirman dalam kitab-Nya, “Dan mereka berkata, \"Kehidupan ini tidak lain hanyalah kehidupan di dunia saja, kita mati dan kita hidup, dan tidak ada yang membinasakan kita selain masa.\" Beliau bersabda, “Mereka mencaci-maki masa, maka Allah Tabaaraka wa Ta'aala berfirman, “Anak Adam menyakiti-Ku karena mencaci-maki masa. Aku adalah masa; di tangan-Ku segala urusan; Aku mengatur malam dan siang.” (Hadits ini disebutkan As Suyuthi dalam Al Lubab secara mauquf sampai kepada Abu Hurairah dan ia menisbatkan kepada Ibnul Mundzir, dan di sana disebutkan, maka Allah menurunkan ayat, dan disebutkanlah ayat itu. Al Hafizh Ibnu Katsir berkata dalam tafsirnya juz 4 hal. 151, “Ibnu Jarir menyebutkan dengan susunan yang asing sekali,” lalu ia menyebutkannya dan berkata, “Demikian pula Ibnu Abi Hatim dari Ahmad bin Manshur dari Suraih bin Nu’man dari Ibnu Uyaynah.” Syaikh Muqbil berkata, “Saya tidak mengetahui sisi gharib (asing) pada susunannya. Adapun sanad, maka para perawinya perawi hadits shahih, Al Haafizh menyebutkannya dalam Al Fath-h juz 10 hal. 195 dan ia mendiamkannya.” Sambil mengingkari kebangkitan. Yakni sebagian kita mati, sedangkan sebagian lagi hidup (lahir). Yakni berlalunya waktu. Oleh karena itu, menurut mereka setelah seorang mati, maka ia tidak akan kembali kepada Allah dan tidak akan dibalas amalnya. Yakni tentang ucapan itu. Oleh karena mereka hanya menduga-duga saja sehingga mereka mengingkari akhirat, mendustakan para rasul tanpa dalil dan bukti yang menguatkan sikap mereka itu. Hal itu hanyalah sangkaan-sangkaan mereka saja yang kosong dari hakikat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Jatsiyah Ayat 24",
    "description": "Dan mereka, orang-orang musyrik dan yang mengingkari kebangkitan, berkata, 'ia, yakni kehidupan ini, tidak lain hanyalah kehidupan dunia kita saja, tidak ada kehidupan akhirat, sebahagian kita mati karena sampai ajalnya dan sebahagian kita hidup, yakni lahir lagi dan tidak ada yang membinasakan kita selain masa, yakni akhir dari kehidupan kita. ' tetapi mereka tidak mempunyai ilmu, yakni pengetahuan yang pasti, tentang itu, mereka hanyalah menduga-duga saja. 25. Dan apabila kepada mereka dibacakan ayat-ayat kami yang sangat jelas pembuktiannya, yaitu ayat-ayat Al-Qur'an atau tanda-tanda keesaan dan kekuasaan Allah di alam ini, tidak ada bantahan mereka terhadap ayat-ayat itu selain mengatakan, 'datangkanlah atau hidupkanlah kembali, wahai para pembaca ayat-ayat itu, nenek moyang kami yang sudah mati, jika kamu orang yang benar meyakini bahwa di akhirat nanti ada kebangkitan. '."
  }
]