[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apabila ayat-ayat Kami yang jelas dibacakan kepada orang-orang musyrik yang mendustakan kebangkitan itu, maka mereka tidak memiliki hujjah kecuali ucapan mereka kepada Rasul, “Hidupkanlah olehmu dan oleh orang-orang yang beriman bersamamu nenek moyang kami yang telah mati, bila kalian adalah orang-orang yang benar dalam apa yang kalian ucapkan.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "25. Dan jika dibacakan ayat-ayat Kami yang nyata kepada orang-orang musyrik yang mengingkari adanya Hari Kebangkitan, mereka tidak mempunyai hujah lain yang mereka gunakan sebagai alasan, kecuali hanya ucapan mereka kepada Rasul -ṣallallāhu 'alaihi wa sallam- dan para sahabatnya, “Hidupkan lagi bapak-bapak kami yang telah mati jika kalian adalah orang-orang yang benar dalam pengakuan kalian bahwa kami akan dibangkitkan lagi setelah mati.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "25. Jika kamu membacakan untuk mereka ayat-ayat Al-Qur’an yang jelas maknanya dan terang-terang menunjukkan bahwa Kami mampu untuk membangkitkan (kehidupan), maka mereka tidak akan memiliki hujjah, kecuali hanya berkata: “Datangkanlah kepada kami leluhur kami yang sudah meninggal dan kembalikan mereka hidup lagi sebagaimana bukti tentang hari kebangkitan, jika anggapanmu tentang adanya hari kebangkitan itu benar.” Sungguh mereka akan bersaksi kepada Kami tentang hal itu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apabila dibacakan kepada mereka ayat-ayat Kami yang jelas} yang jelas memberi petunjuk {tidak ada bantahan mereka, kecuali berkata,“Hidupkanlah kembali nenek moyang kami jika kalian adalah orang-orang benar”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "25. karena itulah Allah berfirman, ”dan apabila dibacakan kepada mereka ayat-ayat kami yang jelas, tidak ada bantahan dari mereka selain dari mengatakan,’datangkanlah nenek moyang kami jika kamu adalah orang-oang yang benar’,” inilah tindakan sembrono mereka terhadap Allah yang mengada-adakan perkataan tersebut dan mereka dengan membawa tanda-tanda kebesaraan Allah, tentu mereka tidak akan beriman kecuali jika para rasul itu mengikuti perkataan mereka, sedangkan perkataan mereka itu semuanya hanyalah dusta belaka, yang mereka maksudkan hanyalah menentang dakwah para rasul, bukan untuk menjelaskan kebenaran."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Jatsiyah ayat 25: (Dan apabila dibacakan kepada mereka ayat-ayat Kami) dari Alquran yang menunjukkan akan kekuasaan Kami yang mampu membangkitkan makhluk menjadi hidup kembali (yang jelas) yang keadaannya jelas sekali (tidak ada bantahan mereka selain dari mengatakan, \"Datangkanlah nenek moyang kami) dalam keadaan hidup (jika kalian adalah orang-orang yang benar\") bahwasanya kami benar-benar akan dibangkitkan menjadi hidup kembali sesudah kami mati."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni yang menunjukkan bahwa Kami berkuasa membangkitkan. Ini adalah sikap beraninya mereka kepada Allah Subhaanahu wa Ta'aala, dimana mereka mengusulkan usulan ini dan menyangka bahwa untuk membuktikan kebenaran para rasul Allah tergantung apakah mereka (para rasul tersebut) mampu mendatangkan nenek moyang mereka atau tidak, dan meskipun para rasul telah mendatangkan semua ayat, mereka tidak akan beriman kecuali jika rasul mengikuti usulan mereka. Mereka telah berdusta dalam ucapannya itu, maksud mereka hanyalah untuk menolak dakwah Rasulullah shallallahu 'alaihi wa sallam, bukan untuk diterangkannya yang hak."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Jatsiyah Ayat 25",
    "description": "Dan apabila kepada mereka dibacakan ayat-ayat kami yang sangat jelas pembuktiannya, yaitu ayat-ayat Al-Qur'an atau tanda-tanda keesaan dan kekuasaan Allah di alam ini, tidak ada bantahan mereka terhadap ayat-ayat itu selain mengatakan, 'datangkanlah atau hidupkanlah kembali, wahai para pembaca ayat-ayat itu, nenek moyang kami yang sudah mati, jika kamu orang yang benar meyakini bahwa di akhirat nanti ada kebangkitan. '26. Keingkaran mereka terhadap kebangkitan ini dibantah oleh Allah, wahai nabi Muhammad, katakanlah kepada mereka yang mengingkari kebangkitan itu, 'Allah yang mahakuasa yang menciptakan dan menghidupkan kamu padahal kamu sebelumnya tidak ada, kemudian dia pulalah yang mematikan kamu pada saat ajalmu datang, setelah itu dia mengumpulkan kamu untuk dihisab pada hari kiamat yang tidak diragukan lagi, pasti akan terjadi; tetapi kebanyakan manusia tidak mengetahui kekuasaan Allah untuk membangkitkan mereka. '."
  }
]