[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kamu melihat (wahai Rasul) di saat Kiamat tiba, setiap pengikut agama berdiri di atas lutut mereka, setiap umat dipanggil kepada buku catatan amalnya dan kepada mereka dikatakan, “Hari ini kalian diberi balasan sesuai dengan apa yang kalian kerjakan, baik atau buruk.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "28. Dan engkau lihat -wahai Rasul- pada hari itu semua umat berlutut di atas lutut mereka menunggu apa yang akan terjadi pada mereka, setiap umat dipanggil menuju kitab catatan amal perbuatan mereka yang ditulis oleh para Malaikat penjaga. Pada hari ini kalian -wahai manusia- mendapatkan balasan atas kelakuan kalian di dunia, yang baik maupun yang buruk."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "28-29. Hai Rasulullah, kamu akan melihat setiap umat akan berlutut. Setiap umat akan dipanggil menuju kitab catatan amal mereka, dan akan dikatakan kepada mereka: “Hari ini kalian akan dibalas atas kebaikan atau keburukan yang telah kalian lakukan di dunia. Ini adalah kitab catatan amal perbuatan kalian yang menjadi saksi dengan sebenar-benarnya tanpa ada penambahan atau pengurangan; dahulu Kami memerintahkan para malaikat untuk mencatat amal perbuatan kalian.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "28. وَتَرَىٰ كُلَّ أُمَّةٍ (Dan (pada hari itu) kamu lihat tiap-tiap umat) Suatu umat yakni orang-orang yang memiliki satu agama yang sama. جَاثِيَةً ۚ(berlutut) Yakni duduk dengan mengangkat pantatnya tanpa meletakkannya di atas tanah kecuali lutut dan ujung jari jemari kakinya. Dan manusia karena keadaan yang sangat menakutkan, mereka berlutut di hadapan Allah sambil menunggu hisab. Al-Hasan mengatakan (الجاثية) yakni duduk dengan bertumpu pada lutut. كُلُّ أُمَّةٍ تُدْعَىٰٓ إِلَىٰ كِتٰبِهَا (Tiap-tiap umat dipanggil untuk (melihat) buku catatan amalnya) Yakni kitab yang diturunkan kepada mereka. Pendapat lain mengatakan yang dimaksud adalah kitab cacatan amal mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "28. Kamu akan melihat para pengikut kepercayaan dan agama itu berlutut seakan menunjukkan ketakutan dan ketundukan. Setiap umat akan dipanggil untuk menerima catatan amalnya satu per satu. Dikatakan kepada mereka: “Pada hari ini kalian akan dibalas sesuai apa yang telah kalian perbuat di dunia”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kamu akan melihat setiap umat berlutut} berlutut secara berkelompok {Setiap umat dipanggil untuk (melihat) catatannya} catatan amalnya {Pada hari itu kalian diberi balasan atas apa yang telah kalian kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "28. selanjutnya Allah melukiskan kedahsyatan serta huru hara hari kiamat, agar semua hambaNya waspada dan mempersiapkan diri untuk menghadapinya seraya berfirman, ”dan (pada hari itu) kamu lihat,” wahai semua yang melihat pada hari itu “tiap-tiap umat berlutut,” di atas lutut mereka karena merasa takut dan menanti keputusan Allah yang maha menguasai dan maha pemurah. “tiap-tiap umat dipanggil untuk (melihat) buku catatan amalnya,” yakni, untuk menyaksikan syariat nabi mereka yang diutus oleh Allah, apakah mereka melaksanakan syariat itu sehingga akan mendapatkan pahala dan keselamatan, ataukah mereka menyia-nyiakan syariat tersebut sehingga akan mendapatkan kerugian nyata? Umat nabi musa dipanggil untuk melihat syariat nabi Musa, umat nabi Isa juga demikian, umat nabi Muhammad juga demikian dan seluruh umat nabi lainnya. Semua umat dipanggil untuk melihat syariat yang dibebankan. Inilah salah satu kemungkinan yang terdapat dalam ayat ini yang benar secara makna dan tidak perlu diragukan. Kemungkinan lain yang dimaksudkan firman Allah “tiap-tiap umat dipanggil untuk (melihat) buku catatan amalnya,” yakni dipanggil untuk melihat catatan amal perbuatannya serta takdir yang digariskan untuk mereka, apakah kebaikan ataulah keburukan. Setiap orang akan dibalas sesuai perbuatannya sendiri. Sama seperti yang disebutkan Allah “barangsiapa yang berbuat kebaikan, maka (balasan kebaiakn itu) untuk dirinya sendiri dan barangsiapa yang berubuat keburukan, maka (balasan keburukan itu) akan menimpa dirinya sendirinya.” (fushilat:46). Kemungkinan kedua makna tersebut yang dimaksudkan oleh ayat di atas."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Jatsiyah ayat 28: (Dan pada hari itu kamu lihat tiap-tiap umat) tiap-tiap pemeluk suatu agama (berlutut) mereka berdiri pada lututnya, atau mereka membentuk kumpulan. (Tiap-tiap umat dipanggil untuk melihat kitabnya) untuk melihat catatan amalnya, lalu dikatakan kepada mereka, (\"Pada hari ini kalian diberi balasan terhadap apa yang telah kalian kerjakan\") sebagai pembalasannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala menyifati dahsyatnya hari Kiamat untuk memperingatkan hamba dan agar mereka bersiap-siap menghadapinya. Karena takut dan khawatir sambil menunggu keputusan Ar Rahman. Menurut Syaikh As Sa’diy, setiap umat dipanggil kepada syariat nabi mereka yang datang kepada mereka dari sisi Allah, apakah mereka mengerjakannya sehingga mereka mendapatkan pahala dan keselamatan atau mereka malah menyia-nyiakannya sehingga mereka memperoleh kerugian? Umat Nabi Musa ‘alaihis salam akan dipanggil kepada syariat Nabi Musa, demikian pula umat Nabi Isa ‘alaihis salam dan umat Nabi Muhammad shallallahu 'alaihi wa sallam. Setiap umat dipanggil kepada syariat yang dibebankan kepadanya. Ini salah satu tafsir ayat tesebut, dan tafsir ini benar. Bisa juga maksudnya, bahwa setiap umat dipanggil kepada catatan amalnya dan apa yang tertulis di sana baik atau buruk, dan bahwa setiap orang akan dibalas sesuai amal yang dikerjakannya seperti dalam firman Allah Ta’ala, “Barang siapa yang mengerjakan amal saleh, maka itu adalah untuk dirinya sendiri, dan barang siapa yang mengerjakan kejahatan, maka itu akan menimpa dirinya sendiri, kemudian kepada Tuhanmulah kamu dikembalikan.” (Terj. Al Jaatsiyah: 15) Bisa jadi kedua tafsir ini merupakamn maksud ayat tersebut. Hal ini ditunjukkan oleh firman-Nya di ayat selanjutnya, “(Allah berfirman), \"Inilah kitab (catatan) Kami yang menuturkan kepadamu dengan sebenar-benarnya.” Yakni ini adalah kitab yang Kami turunkan kepadamu yang akan memutuskan di antara kamu dengan hak atau adil. Firman-Nya lagi, “Sesungguhnya Kami telah menyuruh mencatat apa yang telah kamu kerjakan.” Ini adalah catatan amal. Oleh karena itu, pada ayat selanjutnya lagi Allah Subhaanahu wa Ta'aala menerangkan secara rinci tindakan Allah terhadap dua golongan; golongan mukminin dan golongan kafirin."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Jatsiyah Ayat 28",
    "description": "Dan pada hari itu engkau, wahai nabi Muhammad, akan melihat setiap umat, penganut agama dan kepercayaan apa pun, yang berbuat baik maupun yang berbuat jahat, berlutut di hadapan Allah untuk menghadapi hari yang dahsyat untuk di hisab dan di adili. Setiap umat dipanggil untuk menerima dan melihat buku catatan amalnya, yang baik dan yang buruk, yang besar maupun yang kecil, semuanya tercantum di dalamnya. Pada hari itu kamu di beri balasan sesuai dengan apa yang dahulu telah kamu kerjakan. 29. Ketika kitab amal itu di serahkan kepada setiap umat, Allah berfirman, 'inilah kitab catatan kami yang menuturkan kepadamu segala sesuatu yang telah kamu kerjakan di dunia dahulu dengan sebenar-benar-Nya tanpa di kurangi dan di tambah sedikit pun. Sesungguhnya kami telah menyuruh para malaikat pencatat amal untuk mencatat apa yang dahulu telah kamu kerjakan. '."
  }
]