[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ini adalah buku catatan Kami yang akan berbicara kepada kalian dengan segala amal perbuatan kalian tanpa tambahan dan pengurangan. Sesunggunya Kami memerintahkan para malaikat penjaga agar mencatat amal perbuatan kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "29. Inilah kitab Kami, para malaikat Kami telah menuliskan di dalamnya amal perbuatan kalian, menuturkan kepada kalian dengan sebenarnya, maka bacalah ia. Sesungguhnya Kami telah memerintahkan para malaikat penjaga untuk mencatat segala perbuatan kalian di dunia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "29. إِنَّا كُنَّا نَسْتَنسِخُ مَا كُنتُمْ تَعْمَلُونَ (Sesungguhnya Kami telah menyuruh mencatat apa yang telah kamu kerjakan) Yakni Kami perintahkan para malaikat untuk mencatat amal perbuatan kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "29. Ini adalah kumpulan catatan yang kami tulis untuk kalian yang akan bersaksi untuk kalian dengan benar tanpa ditambah-tambahi dan dikurangi. Sesungguhnya kami mendikte malaikat untuk mencatat amal ibadah kalian dan menjaganya dalam buku catatan amal kalian"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "“Inilah kitab Kami} catatan malaikat penjaga {yang menuturkan} memberi kesaksian {kepada kalian dengan benar. Sesungguhnya Kami telah memerintah untuk mencatat apa yang telah kalian kerjakan”} Kami memerintahkan malaikat penjaga untuk mencatat apa yang selalu kalian kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "29. hal ditunjukkan oleh firman Allah “inilah kitab (catatan) kami yang menuturkan terhadapmu dengan benar,” artinya, catatan kami ini yang kami turunkan kepada kalian akan menghukumi di antara kalian secara benar atau adil. “sesungguhnya kami telah menyuruh mencatat apa yang telah kamu kerjakan,” inilah buku amal perbuatan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Jatsiyah ayat 29: (Inilah kitab catatan Kami) yakni kitab catatan malaikat pencatat amal perbuatan manusia (yang menuturkan terhadap kalian dengan benar. Sesungguhnya Kami telah menyuruh mencatat) menulis dan mengarsipkan (apa yang telah kalian kerjakan.)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Jatsiyah Ayat 29",
    "description": "Ketika kitab amal itu di serahkan kepada setiap umat, Allah berfirman, 'inilah kitab catatan kami yang menuturkan kepadamu segala sesuatu yang telah kamu kerjakan di dunia dahulu dengan sebenar-benar-Nya tanpa di kurangi dan di tambah sedikit pun. Sesungguhnya kami telah menyuruh para malaikat pencatat amal untuk mencatat apa yang dahulu telah kamu kerjakan. '30. Maka adapun orang-orang yang beriman kepada Allah dan rasul-Nya serta mengerjakan kebajikan-kebajikan yang telah di perintahkan Allah dan rasul-Nya, maka tuhan memasukkan mereka ke dalam rahmat-Nya, yakni surga. Demikian itulah kemenangan yang nyata yang di peroleh oleh orang-orang beriman."
  }
]