[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya pada langit yang tujuh dan bumi yang darinya asal-usul manusia berikut makhluk-makhluk yang ada padanya dengan keanekaragaman jenisnya, merupakan bukti dan hujjah bagi orang-orang yang beriman."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Sesungguhnya di langit dan bumi benar-benar terdapat bukti-bukti kekuasaan Allah dan keesaan-Nya bagi orang-orang yang beriman, karena merekalah yang mengambil pelajaran dari tanda-tanda itu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "3-4. Sungguh pada penciptaan tujuh langit dan bumi terdapat tanda-tanda besar kekuasaan dan keesaan Allah bagi orang-orang yang beriman kepada-Nya dan mengakui keesaan-Nya. Hai para hamba, pada penciptaan kalian melalui fase-fase yang berbeda dan pada hewan-hewan yang berjalan di muka bumi terdapat pula tanda-tanda kuasa Allah dalam mengatur urusan makhluk-Nya bagi orang-orang yang percaya keesaan-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Sesungguhnya dalam penciptaan langit dan bumi adalah sebagai bukti kebijaksanaan Allah ta’ala, kekuasaanNya dan KeesaanNya bagi mereka yang beriman kepadaNya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya di langit dan bumi benar-benar terdapat tanda-tanda} dalil-dalil atas kekuasaan Allah {bagi orang-orang mukmin"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3-5. kemudian Allah mengukuhkan hal itu dengan tanda-tanda kekuasaan Allah yang ada di alam semesta (al ayat al-ufuqiyah) dan yang ada di dalam diri manusia (al ayat an nafsiyyah), berupa penciptaan langit dan bumi serta binantang melata yang menyebar pada keduanya serta berbagai manfaat yang disimpan oleh Allah di langit dan di bumi. Demikian juga air yang diturunkan oleh Allah, dengan air itulah Allah menghidupkan bumi dan manusia. Semua itu merupakan tanda-tanda kebesaran Allah serta bukti-bukti jelas yang menunjukkan kebenaran al-qur’an yang agung ini serta kebenaran berbagai hikmah dan hukum yang terkandung di dalamnya. Juga sebagai bukti atas kesempurnaan Allah dan kekuasaan untuk membangkitkan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Jatsiyah ayat 3: (Sesungguhnya pada langit dan bumi) pada penciptaan keduanya (benar-benar terdapat tanda-tanda) yang menunjukkan kepada kekuasaan dan keesaan Allah swt. (bagi orang-orang yang beriman.)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Jatsiyah Ayat 3",
    "description": "Sesungguhnya, pada penciptaan langit dan bumi benar-benar terdapat tanda-tanda ke-esaan, kekuasaan, dan kebesaran Allah bagi orang-orang mukmin yang imannya mantap. 4-5. Dan juga pada penciptaan dirimu, wahai manusia, dengan bentuk yang fungsi yang sempurna dan pada apa yang di tebarkan-Nya di permukaan bumi dari aneka jenis binatang melata, terdapat tanda-tanda keesaan, kekuasaan, dan kebesaran Allah untuk kaum yang meyakini, dan pada perbedaan malam dan siang, yang datang silih berganti, malam datang lalu siang pergi, dan pada apa yang di turunkan Allah dari langit, seperti hujan sebagai rezeki lalu dengan air hujan itu di hidupkan-Nya bumi setelah matinya, yaitu kering, dan demikian pula pada perkisaran angin ke berbagai arah, perbedaan suhu dan kekuatannya serta manfaat dan bahayanya, terdapat pula tanda-tanda keesaan, kekuasaan, dan kebesaran Allah bagi kaum yang mengerti."
  }
]