[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bila dikatakan kepada kalian, “Sesungguhnya janji Allah untuk membangkitkan manusia dari kubur mereka adalah haq dan bahwa Kiamat tidak ada keraguan padanya,” maka kalian menjawab, “Kami tidak tahu apa itu kiamat? Kami tidak yakin ia terjadi kecuali dugaan lemah saja. Kami tidak yakin bahwa Kiamat akan datang.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "32. Dan jika dikatakan kepada mereka, “Sesungguhnya janji Allah -yang dijanjikan kepada hamba-hamba-Nya bahwa Dia akan membangkitkan mereka dan membalas amal perbuatan mereka- adalah benar, tidak ada keraguan padanya, dan hari Kiamat adalah benar, tidak ada keraguan padanya, maka lakukan amal untuk menyongsongnya.” Kalian menjawab, “Kami tidak mengerti apa itu hari Kiamat, tidaklah kami menduga, melainkan hanya dugaan yang lemah bahwa Kiamat akan datang, dan kami tidak yakin bahwa Kiamat pasti datang.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "32. وَإِذَا قِيلَ إِنَّ وَعْدَ اللهِ حَقٌّ (Dan apabila dikatakan (kepadamu): “Sesungguhnya janji Allah itu adalah benar) Yakni dikatakan kepada orang-orang kafir itu. Yakni jika Rasulullah memberitahu mereka dari Allah tentang janji-Nya dalam hari kebangkitan dan perhitungan, atau semua janji yang berhubungan dengan sesuatu yang akan terjadi yang itu pasti akan terjadi. وَالسَّاعَةُ(dan hari berbangkit itu) Yakni hari kiamat. لَا رَيْبَ فِيهَا(tidak ada keraguan padanya) Tentang kejadiannya. قُلْتُم مَّا نَدْرِى مَا السَّاعَةُ (niscaya kamu menjawab: “Kami tidak tahu apakah hari kiamat itu) Yakni apa itu hari kiamat? إِن نَّظُنُّ إِلَّا ظَنًّا(kami sekali-kali tidak lain hanyalah menduga-duga saja) Yakni kami hanya mengira-ngira tanpa ada pengetahuan. وَمَا نَحْنُ بِمُسْتَيْقِنِينَ (dan kami sekali-kali tidak meyakini(nya)”) Yakni kami tidak memiliki keyakinan; kami hanya mengira bahwa hari kiamat akan datang."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "32. Ketika dikatakan untuk orang-orang kafir: “Sesungguhnya janji Allah tentang hari kebangkitan dan hari perhitungan itu pasti terjadi dan bukan mustahil. Kiamat itu tidak diragukan kejadiannya” Kalian akan berkata: “Apakah kami mengetahui setiap hal tentang kiamat? Apa yang kami asumsikan tentang terjadinya kiamat itu tidak lain kecuali hanya asumsi. Maknanya kami hanya berimajinasi dan kami tidak meyakini atau membenarkan bahwa kiamat itu pasti terjadi”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apabila dikatakan,“Sesungguhnya janji Allah itu benar dan hari kiamat itu tidak ada keraguan tentangnya” kalian menjawab,“Kami tidak mengtahui apakah hari kiamat itu, kami hanya menduga-duga} Kami mengharapkan kejadiannya hanya dalam angan-angan saja {dan kami tidak berupaya meyakininya”} tidak membenarkan bahwa hari itu akan datang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "32. mereka juga dicela melalui Firman Allah “dan apabila dikatakan (kepadamu),’sesungguhnya janji Allah itu adalah benar dan hari berbangkit itu tidak ada keraguan padanya,’niscaya kamu menjawab.’” Seraya memungkiri hal itu, “kami tidak tahu apakah hari kiamat itu kami sekali kali tidak lain hanyalah menduga-duga saja dan kami sekali-kali tidak meyakini(nya).” Inilah kondisi mereka di dalam dunia serta pengingkaan mereka terhadap hari kebangkitan seta mereka pun membantah perkataan rasul yang menjelaskan hari kiamat tersebut."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Jatsiyah ayat 32: (Dan apabila dikatakan) kepada kalian hai orang-orang kafir, (\"Sesungguhnya janji Allah itu) mengenai hari berbangkit (adalah benar dan hari kiamat itu) dapat dibaca Was Saa'atu atau Was Saa'ata (tidak ada keraguan) tidak ada keragu-raguan (padanya,\" niscaya kalian menjawab, \"Kami tidak tahu apakah hari kiamat itu, tidak lain) tiada lain (kami hanya menduga-duga saja) menurut Iman Mubarrad, bahwa asal dari lafal In Nazhunnu Illaa Zhannan adalah In Nahnu Illaa Nazhunnu Zhannan, yang artinya: kami sekali-kali tidak lain hanyalah menduga-duga saja (dan Kami sekali-kali tidak meyakini\") bahwa hari kiamat itu benar-benar akan datang."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mereka juga dicela lagi dengan ayat ini. Ia akan datang."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Jatsiyah Ayat 32",
    "description": "Dan apabila di katakan kepadamu oleh siapa pun, 'sungguh, janji Allah yang mahakuasa itu adalah benar, dan hari kiamat yang merupakan salah satu janji-Nya itu tidak di ragukan lagi adanya, ' kamu menjawab, 'kami tidak tahu apakah hari kiamat itu, persoalan hari kiamat itu adalah sesuatu yang kami tidak mengerti, kami sekali-kali tidak lain hanyalah menduga-duga saja, pengetahuan kami tentang itu sangat terbatas dan kami tidak meyakininya. '33. Dan apa yang mereka nyatakan di dalam ayat di atas maka nyatalah bagi mereka keburukan-keburukan yang mereka kerjakan, dan berlakulah azab terhadap mereka yang dahulu mereka perolok-olokkan."
  }
]