[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Nampak bagi orang-orang musyrik yang dulu di dunia mendustakan ayat-ayat Allah apa yang mereka kerjakan di dunia berupa perbuatan-perbuatan buruk. Azab Allah pasti turun menimpa mereka sebagai balasan atas apa yang mereka olok-olokan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "33. Dan nampaklah bagi mereka keburukan-keburukan kekufuran dan maksiat yang pernah mereka lakukan selama di dunia dan turunlah kepada mereka siksa yang pernah mereka olok-olok ketika mereka diperingatkan darinya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "33-34. Lalu nampak kepada orang-orang jahat itu kitab-kitab catatan amal mereka yang dipenuhi dengan keburukan dan dosa; dan azab yang dahulu mereka hina itu menimpa mereka. Dikatakan kepada mereka: “Hari ini Kami membiarkan kalian di dalam azab neraka, sebagaimana dahulu kalian berpaling dari beriman kepada hari akhir. Tempat kalian adalah dalam neraka, dan kalian tidak akan mendapat orang yang dapat menolong kalian.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "33. وَبَدَا لَهُمْ سَيِّـَٔاتُ مَا عَمِلُوا۟ (Dan nyatalah bagi mereka keburukan-keburukan dari apa yang mereka kerjakan) Yakni keburukan amal mereka ditampakkan kepada mereka sesuai dengan kenyataannya. وَحَاقَ بِهِم مَّا كَانُوا۟ بِهِۦ يَسْتَهْزِءُونَ (dan mereka diliputi oleh (azab) yang mereka selalu memperolok-olokkannya) Yakni mereka terkepung dan tertimpa balasan amal perbuatan mereka dengan masuk ke dalam neraka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "33. Dan benar nyata di akhirat, yaitu hukuman atas apa yang telah mereka lakukan di dunia. Balasan atas amal perbuatan telah turun dan menyelimuti mereka setelah mereka dimasukkan ke neraka, neraka yang telah mereka hina-hina di dunia"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Tampak nyata} tampak jelas {bagi mereka keburukan-keburukan yang mereka kerjakan dan berlakulah terhadap mereka} dan meliputi mereka {apa yang selalu mereka perolok-olok"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "33. Allah berfirman “dan nyatalah bagi mereka keburukan-keburukan dari apa yang mereka kerjakan.” Artinya, balasan perbuatan-perbuatan mereka pun nampak pada hari kiamat, “dan mereka diliputi,” yakni, akan turun “(azab) yang mereka selalu memperolok-oloknya,” artinya, mereka akan ditimpa azab yang mereka olok-olok sewaktu di dunia."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Jatsiyah ayat 33: (Dan nyatalah) jelaslah (bagi mereka) di akhirat nanti (keburukan-keburukan dari apa yang mereka kerjakan) sewaktu di dunia, yang dimaksud adalah pembalasannya (dan menimpalah) turunlah (kepada mereka apa yang mereka selalu memperolok-olokkannya) yaitu, azab yang dahulu mereka selalu memperolok-olokkannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Di akhirat. Di dunia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Jatsiyah Ayat 33",
    "description": "Dan apa yang mereka nyatakan di dalam ayat di atas maka nyatalah bagi mereka keburukan-keburukan yang mereka kerjakan, dan berlakulah azab terhadap mereka yang dahulu mereka perolok-olokkan. 34. Dan ketika itu kepada mereka di katakan, 'pada hari ini kami memperlakukan kamu dengan perlakuan orang yang melupakan kamu sebagaimana kamu dahulu ketika di dunia telah melupakan pertemuanmu dengan harimu ini, yakni hari yang amat celaka bagimu; dan akibat dari perbuatan dosa yang kamu lakukan dahulu di dunia maka tempat kembalimu sekarang ialah neraka dan sekali-kali tidak akan ada penolong bagimu dalam menghadapi semua siksaan di neraka itu."
  }
]