[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Azab Allah yang menimpa kalian ini disebabkan kalian menjadikan ayat-ayat Allah dan hujjah-hujjahNya sebagai bahan penghinaan dan permainan. Dan kehidupan dunia berikut kenikmatannya telah mengecoh kalian.” Hari ini mereka tidak dikeluarkan dari neraka dan mereka juga tidak dikembalikan ke dunia untuk bertaubat dan beramal shalih."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "35. Itulah siksa yang dengannya kalian disiksa karena kalian menjadikan ayat-ayat Allah sebagai ejekan, kalian mengolok-oloknya dan kalian tertipu oleh kenikmatan dan syahwat dunia. Maka pada hari ini orang-orang kafir yang mengolok-alok ayat-ayat Allah tidak akan keluar dari Neraka, bahkan mereka tetap di dalamnya kekal abadi dan tidak dikembalikan ke kehidupan dunia untuk melakukan amal saleh dan tidak pula Rabb mereka rida terhadap mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "35. Azab yang berat itu mereka dapatkan karena mereka telah menghina ayat-ayat Allah dan telah tertipu oleh syahwat dunia. Maka hari ini mereka tidak dapat keluar dari azab neraka, dan mereka tidak diminta untuk mencari keridhaan Allah dengan taubat atau ketaatan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "35. ذٰلِكُم بِأَنَّكُمُ اتَّخَذْتُمْ ءَايٰتِ اللهِ هُزُوًا (ang demikian itu, karena sesungguhnya kamu menjadikan ayat-ayat Allah sebagai olok-olokan) Yakni azab itu menimpa kalian karena kalian menjadikan al-Qur’an sebagai bahan hinaan dan permainan. وَغَرَّتْكُمُ الْحَيَوٰةُ الدُّنْيَا ۚ(dan kamu telah ditipu oleh kehidupan dunia) Yakni menipu kalian dengan perhiasan dan kepalsuannya, sehingga kalian mengira tidak ada kehidupan setelahnya dan tidak pula ada hari kebangkitan dan hari dikumpulkan. Dan kalian hidup dengan dasar seperti itu. فَالْيَوْمَ لَا يُخْرَجُونَ مِنْهَا(maka pada hari ini mereka tidak dikeluarkan dari neraka) Yakni dari neraka. وَلَا هُمْ يُسْتَعْتَبُونَ (dan tidak pula mereka diberi kesempatan untuk bertaubat) Yakni mereka tidak ditawari dan tidak diminta untuk kembali kepada ketaatan kepada Allah, sebab di hari itu tidak diterima lagi taubat, dan tidak berguna lagi alasan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "35. Azab untuk kalian ini disebabkan perbuatan kalian yang menggunakan ayat Allah sebagai olok-olokan, atau kalian menggunakannya untuk olok-olokan. Kalian juga telah tertipu oleh kehidupan dunia, sampai kalian berkata: “Tidak akan pernah ada hari kebangkitan dan perhitungan.” Maka pada hari ini mereka tidak akan dikeluarkan dari neraka. Mereka juga tidak akan diberikan kesempatan untuk memohon ampunan dan taubat untuk melakukan ketaatan kepada tuhannya. Allah berkata: Mereka tidak akan diberi kesempatan, bermakna mereka tidak akan diberi keridhaan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Yang demikian itu karena sesungguhnya kalian telah menjadikan ayat-ayat Allah sebagai bahan olok-olok dan kalian telah diperdaya} ditipu {oleh kehidupan dunia” Maka pada hari ini mereka tidak dikeluarkan dari sana dan tidak pula mereka diberi kesempatan kembali} tidak pula merek dikembalikan di dunia sehingga mereka bisa bertaubat dan beramal shalih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "35. “yang demikian itu,” yakni, azab yang menimpa kalian itu adalah disebabkan oleh “karena sesungguhnya kamu menjadikan ayat-ayat Allah sebagai olok-olokan,” padahal sebenarnya ayat-ayat tersebut adalah serius dan diterima dengan penuh kebahagiaan dan kegembiraan. “dan kamu telah ditipu oleh kehidupan dunia,” dengan berbagai perhiasan, kelezatan serta kenikmatan dunia sehhingga kalian merasa tenang dan bekerja hanya untuk dunia, sementara itu kalian meninggalkan usaha dan amal untuk kehidupan akhiat. “maka pada hari ini mereka tidak dikeluarkan dari neraka dan tidak pula mereka diberi kesempatan (untuk bertaubat),” yakni, mereka tidak diberi kesempatan untuk kembali ke dunia dan berbuat kebajikan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Jatsiyah ayat 35: (Yang demikian itu, karena sesungguhnya kalian menjadikan ayat-ayat Allah) Alquran (sebagai olok-olokan dan kalian telah ditipu oleh kehidupan dunia) sehingga kalian berani mengatakan bahwa tidak ada hari berbangkit dan tidak ada hari hisab (maka pada hari ini mereka tidak dikeluarkan) dapat dibaca Yukhrajuuna dan Yakhrujuuna, kalau dibaca Yakhrujuuna artinya mereka tidak dapat keluar (daripadanya) dari neraka (dan tidak pula mereka diberi kesempatan untuk bertobat) tidak dituntut untuk membuat amal keridaan terhadap Rabbnya, yaitu berupa tobat dan ketaatan kepada-Nya, karena pada hari itu hal-hal tersebut sudah tidak bermanfaat lagi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Padahal ayat-ayat Allah itu seharusnya diseriusi dan diterima dengan senang hati. Sehingga kamu katakan, bahwa kebangkitan itu tidak ada dan neraka juga tidak ada. Karena ketika itu sudah tidak bermanfaat dan mereka tidak akan dikembalikan ke dunia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Jatsiyah Ayat 35",
    "description": "Yang demikian itu, yakni apa yang kamu alami sekarang ini, karena sesungguhnya kamu telah menjadikan ayat-ayat Allah yang telah di bacakan kepadamu sewaktu di dunia dahulu sebagai olok-olokan dan kamu telah di tipu oleh kehidupan dunia. ' maka untuk menjalani siksaan yang amat pedih pada hari ini mereka tidak dikeluarkan dari neraka dan tidak pula mereka di beri kesempatan untuk bertobat karena masa untuk bertobat telah berlalu. 36. Maka segala puji hanya bagi Allah, tuhan pencipta, pemilik, dan pemelihara langit dan bumi, tuhan yang mahakuasa atas seluruh alam."
  }
]