[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Hanya milik Alalah semata segala pujian atas nikmat-nikmatNya yang tidak terhitung kepada makhlukNya; Tuhan langit dan bumi, Pencipta keduanya dan Pengatur keduanya, Tuhan seluruh makhluk."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "36. Dan hanya milik Allah sajalah segala pujian, Rabb langit dan Rabb bumi serta Rabb seluruh makhluk."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "36-37. Bagi Allah segala puji dan syukur yang sempurna, Pencipta rujuh langit dan bumi serta seluruh semesta, dan Pengatur urusan seluruh makhluk. Hanya Dia Pemilik keagungan, kekuasaan, dan kebesaran di langit dan bumi. Dia Maha Perkasa dalam balasan dan kerajaan-Nya, dan Maha Bijaksana dalam mengatur urusan makhluk-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "36. Segala syukur dan pujian yang indah hanya bagi Allah atas pemenuhan janji-Nya. Allah Sang Pencipta langit dan bumi. Segala sesuatu selain Allah adalah makhluk, semua itu adalah nikmat dan bukti atas sempurnanya kekuasaan Allah. Tuhan seluruh alam, adalah penekanan dan peuniversalan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka segala puji hanya bagi Allah, Tuhan langit dan Tuhan bumi, Tuhan semesta alam"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "36. “maka bagi Allah lah segala puji,” sesuai dengan keagungan wajahNya dan keagungan kekuasaanNYa ”Rabb langit dan bumi, Rabb semesta alam,” artinya, segala puji bagi Allah semata atas rububiyahNya pada seluruh makhluk, karena Allah telah menciptakan, mengatur dan memberi mereka berbagai nikmat, baik yang nampak maupun tidak."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Jatsiyah ayat 36: (Maka bagi Allahlah segala puji) sanjungan yang baik atas ketepatan ancaman-Nya terhadap orang-orang yang mendustakan-Nya (Rabb langit dan bumi, Rabb semesta alam) Pencipta hal-hal yang telah disebutkan tadi. Pengertian kata Al- 'Aalam adalah semua yang selain Allah, diungkapkan dalam bentuk jamak mengingat jenisnya yang bermacam-macam dan lafal Rabb adalah Badal."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sebagaimana yang sesuai dengan keagungan dan kebesaran kerajaan-Nya. Dia berhak mendapat segala puji karena rububiyyah (pengurusan)-Nya terhadap semua makhluk, Dia yang menciptakan mereka dan mengurus mereka serta mengaruniakan berbagai nikmat kepada mereka yang tampak maupun yang tersembunyi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Jatsiyah Ayat 36",
    "description": "Maka segala puji hanya bagi Allah, tuhan pencipta, pemilik, dan pemelihara langit dan bumi, tuhan yang mahakuasa atas seluruh alam. 37. Dan hanya bagi-Nya segala kebesaran dan ke agungan di langit dan di bumi, dan dialah yang mahaperkasa dalam kekuasaan-Nya, mahabijaksana dalam pengaturan-Nya."
  }
]