[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Hanya milikNya semata segala keagungan,kebesaran, kesombongan, kekuasaan, kuasa dan kesempurnaan di langit dan di bumi, Dia-lah yang Mahaperkasa yang tidak terkalahkan, Mahabijaksana dalam perkataan-perkataan, perbuatan-perbuatan, takdir dan syariatNya. Maha tinggi lagi Mahasuci Allah, tiada tuhan yang berhak disembah kecuali Dia."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "37. Dan baginya segala kebesaran dan keagungan di langit dan di bumi, dan Dia Maha Perkasa yang tidak ada seorang pun yang bisa mengalahkan-Nya, Maha Bijaksana dalam penciptaan-Nya, takdir-Nya, pengaturan-Nya dan Syariat-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "37. وَلَهُ الْكِبْرِيَآءُ فِى السَّمٰوٰتِ وَالْأَرْضِ ۖ (Dan bagi-Nya-lah keagungan di langit dan bumi) Yakni keagungan, kebesaran, dan kekuasaan. وَهُوَ الْعَزِيزُ(Dialah Yang Maha Perkasa) Dalam kekuasaan-Nya, sehingga tidak ada yang dapat mengalahkan-Nya. الْحَكِيمُ (lagi Maha Bijaksana) Dalam segala perbuatan dan firman-Nya serta seluruh ketetapan-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "37. Keagungan dan kerajaan hanyalah milik Allah. Allah Maha Perkasa Yang tidak akan terkalahkan, Maha Bijaksana dalam hukum, kekuasaan dan ketetapan-Nya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Hanya bagiNyalah segala kebesaran} ketinggian dan keagungan {di langit dan bumi. Dialah Dzat Yang Maha perkasa lagi Maha bijaksana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "37. ”dan bagiNya-lah keagungan di langit dan di bumi,” artinya, hanya milikNYa keluhuran, keagungan. Dan pujian. Pujian mencakup sanjungan untuk Allah karena sifatNya yang sempurna, kecintaan, kemuliaan dan keagungganNYa yang mencakup kebesaran dan keagunganNYa. Ibadah dibangun diatas dua rukun;rasa cinta kepada Allah dan tunduk kepadaNya. keduanya berasal dari pengetahuan tentang pujian, keluhuran dan kebesaran Allah. “Dialah yang Mahaperkasa” atas segala sesuatu, “lagi Mahabijaksana,” yakni meletakkan segala sesuatu pada tempatnya, dan Dia tidak mensyariatkan Apa yang disyariatkan kecuali dengan hikmah dan maslahat. Dan Dia tidak menciptakan apa yang Dia ciptakan kecuali untuk suatu manfaat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Jatsiyah ayat 37: (Dan bagi-Nyalah keagungan) kebesaran (di langit dan bumi) lafal Fis Samaawaati Wal Ardhi ini berkedudukan menjadi Hal atau kata keterangan keadaan; yakni keagungan yang ada pada keduanya. (Dialah Yang Maha Perkasa lagi Maha Bijaksana) sebagaimana yang telah dijelaskan pada penafsiran-penafsiran sebelumnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dalam pujian terdapat sanjungan bagi Allah Subhaanahu wa Ta'aala karena sifat-Nya yang sempurna, kecintaan kepada-Nya dan pengagungan-Nya. Sedangkan pada keagungan terdapat pengagungan dan pembesaran-Nya. Dan ibadah itu dibangun di atas dua rukun, yaitu cinta kepada Allah Subhaanahu wa Ta'aala dan menghinakan diri kepada-Nya, dan keduanya muncul dari pengetahuan terhadap keberhakan Allah untuk dipuji, keagungan dan kebesaran-Nya. Dia menundukkan segala sesuatu. Dia menempatkan sesuatu pada tempatnya, Dia tidaklah mensyariatkan suatu syariat kecuali karena hikmah dan maslahat dan tidaklah mencipta kecuali karena faedah dan manfaat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Jatsiyah Ayat 37",
    "description": "Dan hanya bagi-Nya segala kebesaran dan ke agungan di langit dan di bumi, dan dialah yang mahaperkasa dalam kekuasaan-Nya, mahabijaksana dalam pengaturan-Nya. 1. Surah ini diawali dengan dua huruf arab ha m'm, sebagaimana beberapa surah lainnya, untuk menunjukkan mukjizat Al-Qur'an yang tersusun dari huruf-huruf arab serupa itu, dan untuk memberikan peringatan akan pentingnya apa yang diwahyukan dalam ayat-ayat sesudahnya. (surah-surah yang dimulai dengan huruf ha m'm ada tujuh surah, yaitu : surah al-Mu'min, surah as-sajdah, surah asy-sy'r', surah az-zukhruf, surah ad-dukh'n, surah al-j'iyah dan surah al-ahq'f)."
  }
]