[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan pada penciptaan kalian (wahai manusia) dan penciptaan berbagai macam makhluk-makhluk hidup lainnya di muka bumi, terkandung hujjah-hujjah dan dalil-dalil bagi kaum yang meyakini Allah dan syariatNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Dan di dalam penciptaan kalian -wahai manusia- mulai dari air mani, kemudian dari segumpal darah, kemudian dari segumpal daging, dan dalam penciptaan hewan-hewan melata yang disebarkan Allah, yang melata di atas bumi, terdapat bukti-bukti keesaan Allah bagi orang-orang yang meyakini bahwa Allah adalah Pencipta."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. وَفِى خَلْقِكُمْ (Dan pada penciptakan kamu) Yakni penciptaan kalian dalam fase yang berbeda-beda; dimulai dari tanah kemudian air mani sampai menjadi manusia, dan dalam pembentukan anggota tubuh kalian serta menciptakan bagi kalian kekuatan jiwa dan raga yang ada dalam diri kalian. وَمَا يَبُثُّ مِن دَآبَّةٍ(dan pada binatang-binatang yang melata yang bertebaran) Dan dalam penciptaan hewan-hewan melata yang tersebar di seluruh penjuru bumi, baik itu di wilayah yang panas, tropis, maupun dingin, serta di tempat yang basah atau kering; dan pada setiap tempat di bumi, Allah menempatkan hewan yang sesuai. ءَايٰتٌ لِّقَوْمٍ يُوقِنُونَ(terdapat tanda-tanda (kekuasaan Allah) untuk kaum yang meyakini) Yakni tanda-tanda yang sangat jelas, yang menunjukkan keagungan kuasa dan kebijaksanaan Sang Pencipta, sehingga menjadi pelajaran bagi orang-orang yang yakin yang mau menerima kebenaran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Wahai manusia, Allah menciptakan kalian dalam kondisi dan keadaan yang berbeda-beda, apa yang tersebar dan tumbuh dari perut bumi, yang meliputi binatang melata diatas bumi, merupakan bukti yang jelas atas kekuasaan Allah bagi mereka yang mempercayai kekuasaan Allah dan percaya adanya hari kebangkitan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Pada penciptaan kalian dan apa yang Dia sebar} yang Dia sebarkan dan pisahkan {berupa makhluk yang bergerak terdapat tanda-tanda bagi kaum yang meyakini"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3-5. kemudian Allah mengukuhkan hal itu dengan tanda-tanda kekuasaan Allah yang ada di alam semesta (al ayat al-ufuqiyah) dan yang ada di dalam diri manusia (al ayat an nafsiyyah), berupa penciptaan langit dan bumi serta binantang melata yang menyebar pada keduanya serta berbagai manfaat yang disimpan oleh Allah di langit dan di bumi. Demikian juga air yang diturunkan oleh Allah, dengan air itulah Allah menghidupkan bumi dan manusia. Semua itu merupakan tanda-tanda kebesaran Allah serta bukti-bukti jelas yang menunjukkan kebenaran al-qur’an yang agung ini serta kebenaran berbagai hikmah dan hukum yang terkandung di dalamnya. Juga sebagai bukti atas kesempurnaan Allah dan kekuasaan untuk membangkitkan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Jatsiyah ayat 4: (Dan pada penciptaan kalian) penciptaan masing-masing di antara kalian, yaitu mulai dari air mani, lalu berupa darah kental, kemudian segumpal daging, lalu menjadi manusia (dan) penciptaan (apa yang bertebaran) di muka bumi (berupa makhluk-makhluk yang melata) arti kata Ad-Daabbah adalah makhluk hidup yang melata di permukaan bumi, yaitu berupa manusia dan lain-lainnya (terdapat tanda-tanda kekuasaan Allah dan keesaan-Nya bagi kaum yang meyakini) adanya hari berbangkit."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dari mani, lalu berubah menjadi segumpal darah dan berubah menjadi segumpal daging sehingga kemudian menjadi manusia. Adanya kebangkitan. Mereka ini adalah orang-orang mukmin."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Jatsiyah Ayat 4",
    "description": "4-5. Dan juga pada penciptaan dirimu, wahai manusia, dengan bentuk yang fungsi yang sempurna dan pada apa yang di tebarkan-Nya di permukaan bumi dari aneka jenis binatang melata, terdapat tanda-tanda keesaan, kekuasaan, dan kebesaran Allah untuk kaum yang meyakini, dan pada perbedaan malam dan siang, yang datang silih berganti, malam datang lalu siang pergi, dan pada apa yang di turunkan Allah dari langit, seperti hujan sebagai rezeki lalu dengan air hujan itu di hidupkan-Nya bumi setelah matinya, yaitu kering, dan demikian pula pada perkisaran angin ke berbagai arah, perbedaan suhu dan kekuatannya serta manfaat dan bahayanya, terdapat pula tanda-tanda keesaan, kekuasaan, dan kebesaran Allah bagi kaum yang mengerti"
  }
]