[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan pada silih bergantinya malam dengan siang dan saling menyusul di antara keduanya, hujan yang Allah turunkan dari langit lalu dengannya Dia menghidupkan bumi setelah sebelumnya ia kering, lalu ia pun bergerak dengan tumbuhnya tanaman dan pohon-pohonan, dan pada berhembusnya angin untuk kalian dari segala arah dan pengaturannya untuk manfaat kalian, semua itu mengandung bukti-bukti dan hujjah-hujjah bagi kaum yang memahami hujjah-hujjah dan bukti-bukti Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Dan di dalam pergantian siang dan malam, di dalam hujan yang diturunkan Allah dari langit lalu dengannya Allah menghidupkan bumi, dengan menghidupkan tumbuh-tumbuhan setelah sebelumnya berupa tanah mati, tidak ada tumbuh-tumbuhan padanya, dan di dalam perkisaran angin dengan mendatangkannya sesekali dari satu arah dan sesekali dari arah yang lain agar engkau mendapat manfaat, terdapat bukti-bukti bagi orang-orang yang berakal, lalu dengannya mereka menjadikan dalil atas keesaan Allah dan kekuasaan-Nya untuk membangkitkan serta kekuasaan-Nya atas segala sesuatu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "5. Dan pada perbedaan dan pergantian siang dan malam, pada penurunan hujan yang mengandung rezeki bagi manusia karena dapat menumbuhkan tanaman di bumi, dan pada pergerakan angin untuk kemaslahatan kalian terdapat tanda-tanda besar atas kuasa Allah bagi orang yang memahami kebenaran."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. وَاخْتِلٰفِ الَّيْلِ وَالنَّهَارِ (dan pada pergantian malam dan siang) Yakni dalam pergantian keduanya, perbedaan keduanya dari sisi panjang dan pendek, panas dan dingin, dan terang dan gelap, ini juga merupakan tanda-tanda dan pelajaran. وَمَآ أَنزَلَ اللهُ مِنَ السَّمَآءِ مِن رِّزْقٍ(dan rezeki yang diturunkan Allah dari langit) Yang dimaksud dengan rezeki di sini adalah air hujan, sebab hujan adalah sebab dari seluruh rezeki yang diberikan Allah kepada hamba-hamba-Nya. Dan yang dimaksud dengan menghidupkan bumi yakni mengeluarkan tumbuh-tumbuhannya. بَعْدَ مَوْتِهَا (sesudah matinya) Yakni setelah bersih dari tumbuhan. وَتَصْرِيفِ الرِّيٰحِ(dan pada perkisaran angin) Yakni angin yang kadang bertiup ke suatu arat dan kadang ke arah yang lain, kadang membawa hawa panas dan kadang membawa hawa dingin, serta kadang bermanfaat dan kadang berbahaya. ءَايٰتٌ لِّقَوْمٍ يَعْقِلُونَ(terdapat tanda-tanda (kekuasaan Allah) bagi kaum yang berakal) Yakni tanda-tanda yang besar ini menunjukkan keesaan dan kekuasaan Allah bagi orang-orang yang memiliki akal yang sehat, namun tidak bermanfaat bagi orang-orang jahil dan durhaka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Adanya pergantian siang dan malam, panjang dan pendek, yang keduanya saling mengiringi satu dengan lainnya, yang menurunkan yang mendatangkan riaqi, dan setelah gersang Allah tumbuhkan tanaman dari dalam bumi, merubah iklim, cuaca dari satu tempat dengan tempat yang lain, dari segala arah, utara dan selatan, panas dan dingin, badai dan lembut, sebagai bukti yang jelas akan keesan Allah dan kekuasaanNya, bagi mereka yang berfikir."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan pergantian} pergantian {malam dan siang serta rezeki yang diturunkan Allah dari langit} hujan {lalu dengan itu Dia menghidupkan bumi sesudah mati, dan pada perputaran} perputaran {angin terdapat tanda-tanda bagi kaum yang mengerti"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3-5. kemudian Allah mengukuhkan hal itu dengan tanda-tanda kekuasaan Allah yang ada di alam semesta (al ayat al-ufuqiyah) dan yang ada di dalam diri manusia (al ayat an nafsiyyah), berupa penciptaan langit dan bumi serta binantang melata yang menyebar pada keduanya serta berbagai manfaat yang disimpan oleh Allah di langit dan di bumi. Demikian juga air yang diturunkan oleh Allah, dengan air itulah Allah menghidupkan bumi dan manusia. Semua itu merupakan tanda-tanda kebesaran Allah serta bukti-bukti jelas yang menunjukkan kebenaran al-qur’an yang agung ini serta kebenaran berbagai hikmah dan hukum yang terkandung di dalamnya. Juga sebagai bukti atas kesempurnaan Allah dan kekuasaan untuk membangkitkan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Jatsiyah ayat 5: (Dan) pada (pergantian malam dan siang) yaitu datang dan perginya kedua waktu itu (dan rezeki yang diturunkan Allah dari langit) berupa hujan, dikatakan rezeki karena hujan itu merupakan penyebab rezeki (lalu dihidupkan-Nya dengan air hujan itu bumi sesudah matinya, dan pada pertukaran angin) atau pergantiannya, terkadang bertiup ke arah selatan, terkadang bertiup ke arah utara, terkadang datang membawa udara dingin, dan terkadang datang membawa udara panas (terdapat tandatanda pula bagi kaum yang berakal) yaitu tanda-tanda yang menunjukkan kekuasaan dan keesaan Allah, karenanya mereka beriman."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Jatsiyah Ayat 5",
    "description": "4-5. Dan juga pada penciptaan dirimu, wahai manusia, dengan bentuk yang fungsi yang sempurna dan pada apa yang di tebarkan-Nya di permukaan bumi dari aneka jenis binatang melata, terdapat tanda-tanda keesaan, kekuasaan, dan kebesaran Allah untuk kaum yang meyakini, dan pada perbedaan malam dan siang, yang datang silih berganti, malam datang lalu siang pergi, dan pada apa yang di turunkan Allah dari langit, seperti hujan sebagai rezeki lalu dengan air hujan itu di hidupkan-Nya bumi setelah matinya, yaitu kering, dan demikian pula pada perkisaran angin ke berbagai arah, perbedaan suhu dan kekuatannya serta manfaat dan bahayanya, terdapat pula tanda-tanda keesaan, kekuasaan, dan kebesaran Allah bagi kaum yang mengerti. 6. Itulah ayat-ayat Allah yang dihamparkan di alam ini untuk menggambarkan keesaan, kekuasaan, dan kebesaran-Nya yang kami bacakan melalui malaikat jibril kepadamu, wahai nabi Muhammad, dengan sebenarnya untuk engkau sampaikan kepada umatmu; maka dengan perkataan mana lagi mereka akan beriman setelah firman Allah dan ayat-ayat-Nya itu' kalau ayat-ayat Al-Qur'an dan tanda-tanda kekuasaan Allah di muka bumi tidak mereka percayai, maka yang lain pun mereka lebih tidak percaya lagi."
  }
]