[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ayat-ayat dan hujjah-hujjah ini Kami bacakan kepadamu (wahai Rasul) dengan benar. Maka kepada pembicaraan apa setelah Allah dan ayat-ayatNya serta dalil-dalilNya yang menunjukkan bahwa Dia adalah Tuhan yang haq semata, yang tiada sekutu bagiNya, yang akan mereka imani, mereka benarkan dan mereka amalkan?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Tanda-tanda dan petunjuk-petunjuk ini Kami bacakan kepadamu -wahai Rasul- dengan sebenarnya. Apabila mereka tidak beriman kepada firman Allah yang diturunkan kepada hamba-Nya dan kepada kebenaran hujahnya, maka kepada perkataan mana lagi sesudah firman Allah itu mereka akan beriman? Maka kepada hujah yang mana lagi sesudah hujah itu mereka akan percaya?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "6. Demikianlah ayat-ayat Allah yang mulia yang memiliki berbagai manfaat besar yang Kami bacakan kepadamu wahai Rasulullah, ayat-ayat itu mengandung kebenaran dalam hukum-hukum dan kisah-kisahnya. Kepada perkataan siapa lagi mereka akan percaya jika tidak percaya kepada firman dan bukti-bukti dari Allah?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. فَبِأَىِّ حَدِيثٍۭ بَعْدَ اللهِ وَءَايٰتِهِۦ يُؤْمِنُونَ (maka dengan perkataan manakah lagi mereka akan beriman sesudah (kalam) Allah dan keterangan-keterangan-Nya) Yakni Allah adalah paling benar perkataan-Nya, jika mereka tidak mempercayai-Nya lalu kepada siapa lagi mereka akan percaya? Dan jika mereka tidak beriman kepada ayat-ayat dalam kitab-Nya, lalu kepada kitab siapa mereka akan beriman?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Itulah bukti-bukti dan ayat-ayat al-Qur’an yang kami bacakan padamu, yang mengandung yang haq dan kebenaran yang tidak ada kebatilan didalamnya tidak pula ada dusta didalamnya. Maka apakah ada kalam selain kalam Allah beserta bukti dan ayat-ayanya yang kalian percaya?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Itulah ayat-ayat Allah yang Kami bacakan kepadamu dengan benar. Maka pada perkataan mana lagi mereka akan beriman setelah (kalam) Allah dan ayat-ayatNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6-10. selanjutnya Allah membagi manusia menjadi dua golongan dalam kaitannya apakah mereka mau memanfaatkan tanda-tanda kebesaranNya ataukah tidak; Golongan pertama adalah mereka yang mau menjadikan ayat-ayat Allah sebagai petunjuk, direnungkan dan dimanfaatkan sehingga derajat mereka menjadi tinggi. Mereka adalah orang-orang yang beriman secara sempurna kepada Allah, malaikat-malaikat, kitab-kitab, para rasul, dan hari Akhir. Keimanan mereka ini mencapai tingkatan yakin, sehingga akal mereka menjadi bersih dan pengetahuan, akal sehat, serta ilmu mereka pun bertambah. Golongan kedua adalah mereka yang mau mendengar ayat-ayat Allah yang dengan pendengaran itu hujjah telah ditegakkan kepada mereka, namun kemudian mereka berpaling dan merasa tinggi hati, seolah-olah mereka tidak mendengarnya, sebab ayat-ayat tersebut tidak bisa membersihkan hati mereka, bahkan karena kesombongan mereka terhadap ayat-ayat itu mereka semakin melampaui batas. Apabila mereka mengetahui sesuatu dari ayat-ayat hingga Allah, mereka menjadikannya sebagai bahan olok-olokan, sehingga Allah pun menjanjikkan kecelakaan bagi mereka melalui firmanNYa, ”kecelakaan yang besarlah bagi tiap-tiap orang yang banyak berdusta lagi banyak berdosa,” yakni, berdusta dalam perkataannya dan berdosa dalam perbuatannya. Dan Allah memberitahukan mereka bahwa mereka akan mendapatkan siksaan yang pedih. Dan sesungguhnya “di hadapan mereka neraka jahanam,”sebagai balasan mereka dan “tidak akan berguna bagi mereka sedikitpun apa yang telah mereka kerjakan,” yang mereka raih dari harta-harta mereka, “dan tidak pula berguna apa yang mereka jadikan sebagai sesembhaan-sesembahan (mereka) dari selain Allah,” mereka pun meminta pertolongan kepada sesmbahan-sesembahan selain Allah namun sesembahan-sesembahan selain Allah, namun sesembahan-sesembhaan itu ternyata menghinakan mereka pada saat-saat diperlukan andai bisa mendatangkan manfaaat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Jatsiyah ayat 6: (Itulah) yakni tanda-tanda yang telah disebutkan itu (ayat-ayat Allah) maksudnya, hujah-hujah-Nya yang menunjukkan kepada keesaan-Nya (yang Kami membacakannya) yang Kami ceritakan (kepadamu dengan sebenarnya) lafal Bil haqqi berta'aluq kepada lafal Natluuhaa (maka dengan perkataan mana lagi sesudah Allah) sesudah firman-Nya, yang dimaksud adalah Alquran (dan keterangan-keterangan-Nya) atau hujah-hujah-Nya (mereka beriman) orang-orang kafir Mekah itu mereka tidak beriman. Menurut suatu qiraat lafal Yu'minuuna dibaca Tu'minuuna."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang menunjukkan keesaan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Jatsiyah Ayat 6",
    "description": "Itulah ayat-ayat Allah yang dihamparkan di alam ini untuk menggambarkan keesaan, kekuasaan, dan kebesaran-Nya yang kami bacakan melalui malaikat jibril kepadamu, wahai nabi Muhammad, dengan sebenarnya untuk engkau sampaikan kepada umatmu; maka dengan perkataan mana lagi mereka akan beriman setelah firman Allah dan ayat-ayat-Nya itu' kalau ayat-ayat Al-Qur'an dan tanda-tanda kekuasaan Allah di muka bumi tidak mereka percayai, maka yang lain pun mereka lebih tidak percaya lagi. 7-8. Kecelakaan yang amat besar bagi setiap orang yang banyak berdusta, yaitu mengada-adakan kebohongan terhadap Allah, lagi banyak berdosa, yakni melakukan pelanggaran, yaitu orang yang selalu mendengar ayat-ayat Allah dengan begitu jelas ketika di bacakan kepadanya dengan lisan, namun tetap saja dia tidak mempercayainya, bahkan kemudian dia tetap mengingkarinya sambil menyombongkan diri seakan-akan dia tidak pernah mendengarnya. Karena sikap dan tindakannya yang demikian itulah, maka wahai nabi Muhammad, peringatkanlah dia dengan azab yang pedih akibat perbuatan buruknya."
  }
]