[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kebinasaan besar bagi setiap pembohong lagi banyak dosa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Siksa dari Allah dan kehancuranlah bagi setiap pendusta dan pendosa yang banyak."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "7-10. Allah memberi ancaman berupa keburukan dan azab bagi setiap orang yang membuat kedustaan terhadap Allah dan banyak melakukan kejahatan dan dosa besar. Ia mendengar ayat-ayat Allah dibacakan, akan tetapi ia tetap kafir dan enggan beriman kepada ayat-ayat itu seakan-akan belum mendengarnya. Hai Rasulullah, kabarkanlah kepadanya azab yang berat dan menyakitkan. Dan jika orang-orang ini mengetahui sebagian ayat-ayat Allah, maka mereka menjadikannya sebagai olokan. Mereka adalah orang-orang jauh dari rahmat Allah, yang akan mendapat azab yang menghinakan. Mereka telah merasa puas dengan kehidupan dunia, dan lupa terhadap neraka Jahannam yang menunggu mereka setelah itu, ketika tidak bermanfaat lagi harta dan keturunan yang mereka miliki di dunia, tidak berguna juga berhala-berhala yang mereka sembah selain Allah. Mereka akan mendapatkan azab api neraka yang berkobar."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. وَيْلٌ لِّكُلِّ أَفَّاكٍ أَثِيمٍ (Kecelakaan besarlah bagi tiap-tiap orang yang banyak berdusta lagi banyak berdosa) Yakni bagi setiap pendusta dan banyak berbuat dosa yang melanggar setiap kewajibannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Ini menjadi dosa dan kehancuran bagi pendusta kepada Allah, banyak dosanya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Celakalah} binasalah {setiap pembohong} pembohong {lagi berdosa} memiliki banyak dosa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6-10. selanjutnya Allah membagi manusia menjadi dua golongan dalam kaitannya apakah mereka mau memanfaatkan tanda-tanda kebesaranNya ataukah tidak; Golongan pertama adalah mereka yang mau menjadikan ayat-ayat Allah sebagai petunjuk, direnungkan dan dimanfaatkan sehingga derajat mereka menjadi tinggi. Mereka adalah orang-orang yang beriman secara sempurna kepada Allah, malaikat-malaikat, kitab-kitab, para rasul, dan hari Akhir. Keimanan mereka ini mencapai tingkatan yakin, sehingga akal mereka menjadi bersih dan pengetahuan, akal sehat, serta ilmu mereka pun bertambah. Golongan kedua adalah mereka yang mau mendengar ayat-ayat Allah yang dengan pendengaran itu hujjah telah ditegakkan kepada mereka, namun kemudian mereka berpaling dan merasa tinggi hati, seolah-olah mereka tidak mendengarnya, sebab ayat-ayat tersebut tidak bisa membersihkan hati mereka, bahkan karena kesombongan mereka terhadap ayat-ayat itu mereka semakin melampaui batas. Apabila mereka mengetahui sesuatu dari ayat-ayat hingga Allah, mereka menjadikannya sebagai bahan olok-olokan, sehingga Allah pun menjanjikkan kecelakaan bagi mereka melalui firmanNYa, ”kecelakaan yang besarlah bagi tiap-tiap orang yang banyak berdusta lagi banyak berdosa,” yakni, berdusta dalam perkataannya dan berdosa dalam perbuatannya. Dan Allah memberitahukan mereka bahwa mereka akan mendapatkan siksaan yang pedih. Dan sesungguhnya “di hadapan mereka neraka jahanam,”sebagai balasan mereka dan “tidak akan berguna bagi mereka sedikitpun apa yang telah mereka kerjakan,” yang mereka raih dari harta-harta mereka, “dan tidak pula berguna apa yang mereka jadikan sebagai sesembhaan-sesembahan (mereka) dari selain Allah,” mereka pun meminta pertolongan kepada sesmbahan-sesembahan selain Allah namun sesembahan-sesembahan selain Allah, namun sesembahan-sesembhaan itu ternyata menghinakan mereka pada saat-saat diperlukan andai bisa mendatangkan manfaaat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Jatsiyah ayat 7: (Kecelakaan yang besarlah) lafal Al-Wail menunjukkan kalimat azab (bagi tiap-tiap orang yang banyak berdusta) atau 318 pendusta (lagi banyak berdosa) banyak dosanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala membagi manusia dari sisi dapat mengambil manfaat dari ayat-ayat-Nya atau tidak kepada dua golongan: Pertama, golongan yang dapat mengambil dalil darinya, yang memikirkan ayat-ayat-Nya, mereka dapat mengambil manfaat darinya sehingga keadaan mereka menjadi tinggi. Mereka adalah orang-orang yang beriman kepada Allah, malaikat-Nya, kitab-kitab-Nya, para rasul-Nya, dan hari akhir dengan keimanan yang sempurna yang sampai kepada derajat yakin, sehingga akal mereka menjadi bersih, pengetahuan dan pandangan mereka semakin bertambah dan tajam. Kedua, golongan yang mendengar ayat-ayat Allah yang hanya sebagai penegak hujjah saja bagi mereka, ia lalu berpaling dan sombong seakan-akan belum pernah mendengarnya karena hatinya tidak menjadi bersih karenanya, bahkan dengan sebab kesombongannya maka bertambahlah sikap melampaui batasnya. Bahkan ketika ia mengetahui sedikit ayat-ayat Allah, maka ia menjadikannya sebagai bahan olok-olokkan sehingga Allah Subhaanahu wa Ta'aala mengancam celaka kepadanya. Dalam ucapannya. Dalam perbuatannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Jatsiyah Ayat 7",
    "description": "7-8. Kecelakaan yang amat besar bagi setiap orang yang banyak berdusta, yaitu mengada-adakan kebohongan terhadap Allah, lagi banyak berdosa, yakni melakukan pelanggaran, yaitu orang yang selalu mendengar ayat-ayat Allah dengan begitu jelas ketika di bacakan kepadanya dengan lisan, namun tetap saja dia tidak mempercayainya, bahkan kemudian dia tetap mengingkarinya sambil menyombongkan diri seakan-akan dia tidak pernah mendengarnya. Karena sikap dan tindakannya yang demikian itulah, maka wahai nabi Muhammad, peringatkanlah dia dengan azab yang pedih akibat perbuatan buruknya"
  }
]