[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dia mendengar ayat-ayat Allah dibacakan kepadanya, kemudian dia tetap bersikukuh di atas kekafirannya dan menyombongkan diri sehingga menolak untuk tunduk kepada Allah dan RasulNya, seolah-olah dia tidak mendengar ayat-ayat Allah yang dibacakan kepadanya. Sampaikan kepada pendusta lagi pendosa ini (wahai rasul) bahwa dia akan mendapat azab yang pedih dan menyakitkan di dalam Neraka Jahanam di Hari KIamat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Orang kafir itu mendengar ayat-ayat Allah di dalam Al-Qur`ān dibacakan kepadanya, kemudian ia tetap dengan kekufuran dan kemaksiatan yang sebelumnya, merasa dirinya tinggi untuk mengikuti kebenaran seakan-akan ia belum pernah mendengar ayat-ayat yang dibacakan kepadanya, maka berilah kabar kepadanya -wahai Rasul- dengan keburukan di Akhiratnya, yaitu siksa pedih yang menunggunya di sana."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. يَسْمَعُ ءَايٰتِ اللهِ تُتْلَىٰ عَلَيْهِ ثُمَّ يُصِرُّ (dia mendengar ayat-ayat Allah dibacakan kepadanya kemudian dia tetap) Yakni dia tetap di dalam kekafirannya dan perbuatan yang biasa dia lakukan, dia enggan mengambil pelajaran dari kalamullah yang dia dengar. مُسْتَكْبِرًا(menyombongkan diri) Yakni bersikeras di atas kekafirannya dan karena keangkuhannya dia enggan mengikuti kebenaran yang berupa ayat-ayat dari Tuhannya dan Penciptanya. كَأَن لَّمْ يَسْمَعْهَا ۖ( seakan-akan dia tidak mendengarnya) Yakni keadaannya seperti keadaan orang yang tidak mendengarnya sehingga tidak menengoknya sama sekali. فَبَشِّرْهُ بِعَذَابٍ أَلِيمٍ (Maka beri khabar gembiralah dia dengan azab yang pedih) Yakni beritahukan kepadanya bahwa baginya azab yang sangat menyakitkan dari Allah sebagai balasan atas kebebalan, keangkuhan, dan keengganannya mendengar ayat-ayat Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8. Dia mendengar ayat-ayat Allah uang kamu bacakan padanya, kemudian yang tersisa hanyalah debu merah kekufuran dan dustanya, takabbur dan sombong akan dirinya dari ketundukan pada kebenaran yaitu kalam Allah, seakan-akan dia tidak mendengar apa yang telah dijanjikan dan balasannya, kamudian al-Qur’an memberi khabar padanya, bahwa Allah memiliki adzab yang pedih untuknya di hari kiamat kelak, kabar gembira ini menjadi terngiang-ngiang padanya, maksudnya: “peringatan dan rasa takut”, dikatakan pada Nadhar Ibn Harits yang telah membeli hadits-hadits dari Arab ‘Ajam, kemudian ia menjadikan orang-orang sibuk dengannya dari mendengarkan al-Qur’an”."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Yang mendengar ayat-ayat Allah yang dibacakan} dibacakan {kepadanya kemudian dia tetap} dia tetap pada kekufurannya {menyombongkan diri seakan-akan tidak mendengarnya} seakan-akan dia tidak mendengarkannya {Peringatkanlah dia dengan azab yang pedih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6-10. selanjutnya Allah membagi manusia menjadi dua golongan dalam kaitannya apakah mereka mau memanfaatkan tanda-tanda kebesaranNya ataukah tidak; Golongan pertama adalah mereka yang mau menjadikan ayat-ayat Allah sebagai petunjuk, direnungkan dan dimanfaatkan sehingga derajat mereka menjadi tinggi. Mereka adalah orang-orang yang beriman secara sempurna kepada Allah, malaikat-malaikat, kitab-kitab, para rasul, dan hari Akhir. Keimanan mereka ini mencapai tingkatan yakin, sehingga akal mereka menjadi bersih dan pengetahuan, akal sehat, serta ilmu mereka pun bertambah. Golongan kedua adalah mereka yang mau mendengar ayat-ayat Allah yang dengan pendengaran itu hujjah telah ditegakkan kepada mereka, namun kemudian mereka berpaling dan merasa tinggi hati, seolah-olah mereka tidak mendengarnya, sebab ayat-ayat tersebut tidak bisa membersihkan hati mereka, bahkan karena kesombongan mereka terhadap ayat-ayat itu mereka semakin melampaui batas. Apabila mereka mengetahui sesuatu dari ayat-ayat hingga Allah, mereka menjadikannya sebagai bahan olok-olokan, sehingga Allah pun menjanjikkan kecelakaan bagi mereka melalui firmanNYa, ”kecelakaan yang besarlah bagi tiap-tiap orang yang banyak berdusta lagi banyak berdosa,” yakni, berdusta dalam perkataannya dan berdosa dalam perbuatannya. Dan Allah memberitahukan mereka bahwa mereka akan mendapatkan siksaan yang pedih. Dan sesungguhnya “di hadapan mereka neraka jahanam,”sebagai balasan mereka dan “tidak akan berguna bagi mereka sedikitpun apa yang telah mereka kerjakan,” yang mereka raih dari harta-harta mereka, “dan tidak pula berguna apa yang mereka jadikan sebagai sesembhaan-sesembahan (mereka) dari selain Allah,” mereka pun meminta pertolongan kepada sesmbahan-sesembahan selain Allah namun sesembahan-sesembahan selain Allah, namun sesembahan-sesembhaan itu ternyata menghinakan mereka pada saat-saat diperlukan andai bisa mendatangkan manfaaat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Jatsiyah ayat 8: (Dia mendengar ayat-ayat Allah) yakni Alquran (dibacakan kepadanya kemudian dia tetap) atas kekafirannya (menyombongkan diri) takabur tidak mau beriman (seakan-akan dia tidak mendengarnya. Maka beri kabar gembiralah dia dengan azab yang pedih) azab yang menyakitkan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dari beriman."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Jatsiyah Ayat 8",
    "description": "7-8. Kecelakaan yang amat besar bagi setiap orang yang banyak berdusta, yaitu mengada-adakan kebohongan terhadap Allah, lagi banyak berdosa, yakni melakukan pelanggaran, yaitu orang yang selalu mendengar ayat-ayat Allah dengan begitu jelas ketika di bacakan kepadanya dengan lisan, namun tetap saja dia tidak mempercayainya, bahkan kemudian dia tetap mengingkarinya sambil menyombongkan diri seakan-akan dia tidak pernah mendengarnya. Karena sikap dan tindakannya yang demikian itulah, maka wahai nabi Muhammad, peringatkanlah dia dengan azab yang pedih akibat perbuatan buruknya. 9. Dan apabila dia telah mengetahui dengan cara apa pun sedikit tentang ayat-ayat kami, maka dia menjadikannya sebagai bahan olok-olokan. Merekalah, yaitu para pembohong dan pendosa itu, yang akan menerima azab yang menghinakan."
  }
]