[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bila pendusta lagi pendosa ini mengetahui sebagian dari ayat-ayat Kami, maka dia menjadikannya bahan olok-olokan dan hinaan. Mereka akan mendapat azab yang merendahkan dan menghinakan mereka di Hari Kiamat sebagai balasan atas penghinaan mereka terhadap al-Quran."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Dan jika sampai kepadanya sesuatu dari Al-Qur`ān maka ia menjadikannya bahan olok-olokan. Orang-orang yang mengolok-olok Al-Qur`ān itu akan mendapatkan siksa yang menghinakan pada hari Kiamat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. وَإِذَا عَلِمَ مِنْ ءَايٰتِنَا شَيْـًٔا (Dan apabila dia mengetahui barang sedikit tentang ayat-ayat Kami) Yakni jika sampai kepadanya suatu pengetahuan tentang ayat-ayat Allah. اتَّخَذَهَا (maka ayat-ayat itu dijadikan) Yakni ia menjadikan ayat-ayat itu. هُزُوًا ۚ (sebagai olok-olok) Yakni sebagai bahan hinaan dan olokan yang mereka ambil dari makna yang ditunjukkan oleh ayat-ayat itu. أُو۟لٰٓئِكَ(Mereka) Yakni para pendusta dengan sifat-sifat tersebut. لَهُمْ عَذَابٌ مُّهِينٌ(memperoleh azab yang menghinakan) Yakni azab yang dapat menghinakan dan mempermalukan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9. Dan saat ia tidak mendengar ayat-ayat al-Qur’an, tetapi ia mengetahui ilmu lainnya, mereka mengambil ayat al qur’an untuk merendahkan dan mengejek, merekalah pendusta dan pencemooh dan bagi mereka siksa yang pedih di hari kiamat kelak"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apabila dia mengetahui} mendengar {sesuatu dari ayat-ayat Kami, dia menjadikannya bahan olok-olok} bahan untuk diolok-olok {Mereka itulah yang akan menerima azab yang menghinakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6-10. selanjutnya Allah membagi manusia menjadi dua golongan dalam kaitannya apakah mereka mau memanfaatkan tanda-tanda kebesaranNya ataukah tidak; Golongan pertama adalah mereka yang mau menjadikan ayat-ayat Allah sebagai petunjuk, direnungkan dan dimanfaatkan sehingga derajat mereka menjadi tinggi. Mereka adalah orang-orang yang beriman secara sempurna kepada Allah, malaikat-malaikat, kitab-kitab, para rasul, dan hari Akhir. Keimanan mereka ini mencapai tingkatan yakin, sehingga akal mereka menjadi bersih dan pengetahuan, akal sehat, serta ilmu mereka pun bertambah. Golongan kedua adalah mereka yang mau mendengar ayat-ayat Allah yang dengan pendengaran itu hujjah telah ditegakkan kepada mereka, namun kemudian mereka berpaling dan merasa tinggi hati, seolah-olah mereka tidak mendengarnya, sebab ayat-ayat tersebut tidak bisa membersihkan hati mereka, bahkan karena kesombongan mereka terhadap ayat-ayat itu mereka semakin melampaui batas. Apabila mereka mengetahui sesuatu dari ayat-ayat hingga Allah, mereka menjadikannya sebagai bahan olok-olokan, sehingga Allah pun menjanjikkan kecelakaan bagi mereka melalui firmanNYa, ”kecelakaan yang besarlah bagi tiap-tiap orang yang banyak berdusta lagi banyak berdosa,” yakni, berdusta dalam perkataannya dan berdosa dalam perbuatannya. Dan Allah memberitahukan mereka bahwa mereka akan mendapatkan siksaan yang pedih. Dan sesungguhnya “di hadapan mereka neraka jahanam,”sebagai balasan mereka dan “tidak akan berguna bagi mereka sedikitpun apa yang telah mereka kerjakan,” yang mereka raih dari harta-harta mereka, “dan tidak pula berguna apa yang mereka jadikan sebagai sesembhaan-sesembahan (mereka) dari selain Allah,” mereka pun meminta pertolongan kepada sesmbahan-sesembahan selain Allah namun sesembahan-sesembahan selain Allah, namun sesembahan-sesembhaan itu ternyata menghinakan mereka pada saat-saat diperlukan andai bisa mendatangkan manfaaat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Jatsiyah ayat 9: (Dan apabila dia mengetahui tentang ayat-ayat Kami) yakni Alquran (barang sedikit, maka ayat-ayat itu dijadikannya olokolok) yakni menjadi bahan ejekan mereka. (Merekalah) orang-orang yang banyak mendustakan ayat-ayat Kami itu (yang memperoleh azab yang menghinakan) artinya, siksaan yang mengandung kehinaan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Jatsiyah Ayat 9",
    "description": "Dan apabila dia telah mengetahui dengan cara apa pun sedikit tentang ayat-ayat kami, maka dia menjadikannya sebagai bahan olok-olokan. Merekalah, yaitu para pembohong dan pendosa itu, yang akan menerima azab yang menghinakan. 10. Di hadapan mereka kini sudah disiapkan neraka jahanam dan tidak akan berguna bagi mereka sedikit pun apa yang telah mereka kerjakan, dan tidak pula bermanfaat apa yang mereka jadikan sebagai pelindung-pelindung mereka, yaitu sesembahan mereka selain Allah. Dan mereka akan mendapat azab yang besar sebagai akibat dari perbuatan dosa yang mereka lakukan."
  }
]