[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1. Sungguh banyak kebaikan dan karunia Allah kepada semua makhlukNya. Allah Yang di TanganNya kerajaan dunia dan akhirat dan kekuasaan atas keduanya, perintah dan ketetapannya berlaku pada keduanya. Allah Mahakuasa atas segala sesuatu. Ayat ini menetapkan sifat “tangan” bagi Allah sesuai dengan keagunganNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Kebaikan Allah sangat Agung dan banyak, yang hanya di tangan-Nya saja terdapat kerajaan. Dan Dia Mahakuasa atas segala sesuatu, tidak ada sesuatu pun yang melemahkan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1. Surat yang mulia ini dimulai dengan penjelasan tentang keagungan Allah; bahwa Dia adalah Pemilik seluruh kebaikan dan Dia memberi keberkahan bagi hamba-Nya yang Dia kehendaki. Dan Dia Semata yang berkuasa di alam semesta; kekuasaan-Nya tidak ada batasnya, tidak ada yang sulit bagi-Nya; berbuat segala yang Dia kehendaki di kerajaan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. تَبٰرَكَ الَّذِى بِيَدِهِ الْمُلْكُ (Maha Suci Allah Yang di tangan-Nya-lah segala kerajaan) Makna (تبارك) yakni kebaikan Allah sangat berlimpah dan agung. Sedangkan (الملك) yakni kerajaan langit dan bumi di dunia dan di akhirat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Keutamaan: Imam Ahmad dan Ashabus Sunan yang empat meriwayatkan dari Abu Hurairah bahwa Rasulallah SAW bersabda: “Sesungguhnya ada satu surah dalam Al-quran yang memiliki 30 ayat. Dia dapat menolong pembacanya agar diampuni (Allah), yaitu {Tabaarakalladzi biyadihil mulku}” 1. Dzat yang Maha Tinggi KuasaNya dan Maha Agung kebaikanNya yang menguasai kerajaan langit dan bumi. Dialah Dzat yang sempurna kekuasaanNya atas segala sesuatu. Tidak ada satupun yang dapat melemahkanNya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maha berkah} Maha agung dan Maha banyak kebaikanNya {Dzat yang menguasai (segala) kerajaan dan Dia Maha kuasa atas segala sesuatu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1. “Mahasuci Allah yang di TanganNya-lah segala kerajaan.” Maksudnya, Mahaagung lagi Mahatinggi dan kebaikanNya yang banyak dan menyeluruh. Di antara keagunganNya adalah kerajaan alam langit dan bumi berada di TanganNya. Dia-lah yang menciptakannya dan mengatur sekehendakNya dengan menerapkan hukum takdir dan hukum Agama berdasarkan kebijaksanaanNya. Di antara keagunganNya adalah KuasaNya yang sempurna atas segala sesuatu. Dengan KuasaNya, Allah menciptakan seluruh makhluk-makhluk besar yang ada, seperti langit dan bumi."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mulk ayat 1: Surat ini Allah mulai dengan memuliakan diri-Nya, dan Allah kabarkan bahwa dengan tangan-Nya dan kekuasaan-Nya yaitu kerajaan baik di langit maupun di bumi dan apa yang meliputi keduanya di dunia maupun di akhirat; Allah perbanyak kebaikan (padanya) dan Allah lah yang memiliki keagungan. Ia (Allah), dengan tangan-Nya memerintahkan seluruh makhluk dan semuanya di bawah kekuasaan-Nya; Allah berbuat menurut apa yang Dia inginkan, yang terkandung dalam perbuatannya hikmah. Tidak ada satupun baik di langit maupun di bumi yang mampu melemahkan-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni Mahaagung, Mahatinggi, Mahabanyak kebaikan-Nya dan merata ihsan-Nya. Di antara keagungan-Nya adalah di Tangan-Nya kerajaan alam bagian atas maupun alam bagian bawah, Dia yang menciptakannya, bertindak sesuai kehendak-Nya dengan hukum-hukum qadari-Nya (taqdir) dan hukum-hukum agama-Nya (syariat) yang mengikuti hikmah(kebijaksanaan)-Nya. Di antara keagungan-Nya juga adalah sempurnanya kekuasaan-Nya dimana dengan kekuasaan itu Dia menaqdirkan segala sesuatu dan dengannya Dia menciptakan makhluk-makhluk yang besar seperti langit dan bumi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mulk Ayat 1",
    "description": "Surah sebelumnya yaitu at-tahr'm, diakhiri dengan uraian tentang kebinasaan yang menimpa siapa yang durhaka tanpa dapat ditolong oleh siapa pun, seperti halnya istri nuh dan lut. Dan kebahagiaan akan diraih bagi yang taat tanpa dapat diganggu oleh siapa pun, seperti halnya istri fir'aun dan maryam. Ini disebabkan yang mengatur itu semua adalah Allah yang mahakuasa, karena itu awal surah ini menguraikan kuasa Allah serta limpahan anugerah-Nya: mahasuci Allah yang menguasai segala kerajaan, di langit dan di bumi, dan dia mahakuasa atas segala sesuatu, tidak ada satu perkara pun yang melemahkan-Nya. 2. Salah satu bukti kekuasaan-Nya adalah dia yang menciptakan mati dan menentukan ajalnya, dan hidup dengan menentukan kadar-kadarnya, untuk menguji kamu, siapa di antara kamu yang lebih baik amalnya dengan seikhlas mungkin. Dan dia mahaperkasa tidak ada satu pun yang dapat mengalahkan-Nya, maha pengampun dengan menghapus dosa bagi orang-orang yang bertobat."
  }
]