[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "10. Mereka berkata mengakui, “Seandainya dulu kami mendengar untuk mencari kebenaran atau memikirkan apa yang diserukan kepada kami, niscaya saat ini kami tidak menjadi penghuni api neraka.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Orang-orang kafir berkata, “Kalau seandainya kami dulu mendengar dengan pendengaran yang bermanfaat dan berfikir dengan akal orang yang membedakan kebenaran dari kebatilan, tentulah kami tidak menjadi bagian dari penghuni Neraka, akan tetapi kami akan beriman kepada para Rasul dan membenarkan apa yang mereka bawa sehingga kami menjadi penghuni Surga.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "10. Para penghuni neraka mulai menyesali diri mereka sendiri, mereka berkata satu sama lain: “Andai saja dulu kita memakai akal dan pendengaran kita, dan mengikuti ajakan rasul menuju kebaikan dan petunjuk, niscaya kita dapat selamat dari azab neraka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. وَقَالُوا۟ لَوْ كُنَّا نَسْمَعُ أَوْ نَعْقِلُ مَا كُنَّا فِىٓ أَصْحٰبِ السَّعِيرِ (Dan mereka berkata: “Sekiranya kami mendengarkan atau memikirkan (peringatan itu) niscaya tidaklah kami termasuk penghuni-penghuni neraka yang menyala-nyala”) Seandainya kami mendengar seperti pendengaran yang yang perhatian atau memikirkan seperti pemikiran orang yang menghayati, niscaya kami tidak akan menjadi penghuni neraka, namun tentu kami akan beriman kepada apa yang diturunkan Allah dan kami menjadi pengikut rasul."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10. Mereka juga berkata: “Jika saja kami mendengar sesuatu yang kami pahami dari para Rasul, atau kami memahami apa yang mereka serukan kepada kami dan memikirkan ayat-ayat kauniyah (ayat yang ada di alam semesta), kami sekarang tidak akan termasuk para penduduk neraka”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka juga berkata,“Andai saja dahulu kami mendengarkan atau memikirkannya, sungguh kami tidak termasuk para penghuni neraka Sa‘ir} neraka yang menyala-nyala"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "10. “Dan mereka berkata,” mengakui tidak berhak mendapatkan petunjuk dan arahan, “Sekiranya kami mendengarkan atau memikirkan (peringatan itu), niscaya tidaklah kami termasuk penghuni neraka yang menyala-nyala ini.” Mereka menafikan jalan petunjuk dari diri mereka sendiri yaitu tidak mau mendengarkan apa yang diturunkan Allah dan dibawa oleh para rasul. Mereka juga tidak berpikir dengan akal yang seharusnya bisa membawa manfaat bagi mereka, mengakui berbagai kebenaran, lebih mengedepankan kebaikan serta menjauhi berbagai hal yang berakibat tercela. Orang-orang kafir tidak memiliki pendengaran dan akal. Lain halnya dengan orang yang memiliki keyakinan, pengetahuan, kejujuran, dan keimanan. Mereka menguatkan keimanan mereka dengan dalil-dalil naqli. Mereka mendengarkan apa pun yang datang dari sisi Allah dan yang dibawa Rasulullah untuk diketahui, dimengerti, dan diamalkan. Mereka juga menguatkan keimanan mereka dengan dalil-dalil aqli yang membedakan antara petunjuk dengan kesesatan, kebaikan dengan keburukan. Ukuran keimanan mereka berdasarkan keteladanan terhadap dalil naqli dan aqli yang Allah berikan pada mereka. Mahasuci Allah yang mengkhususkan karuniaNya pada siapa saja yang dikehendaki dan diberikan pada hamba-hambaNya yang dikehendaki, serta merendahkan orang yang tidak layak untuk kebaikan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mulk ayat 10: Kemudian penghuni nereka mencerca dan menyalahkan dirinya masing-masing, dengan berkata : Seandainya kami di dunia mendengar sungguh-sungguh kepada siapa yang membawa kebenaran dan menginginkan jawaban, atau menyadari dan berpikir atas apa yang ia (Rasul ﷺ) seru kepada kami, dari hidayah dan petunjuk, maka tidaklah kami tertimpa api nereka yang menyala-nyala."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mengakui ketidaklayakan mendapat petunjuk. Mereka singkirkan jalan-jalan petunjuk yaitu mendengar apa yang Allah turunkan dan apa yang dibawa para rasul serta akal yang bermanfaat bagi pemiliknya, yang mengarahkannya kepada hakikat segala sesuatu, mengutamakan kebaikan, membuat berhenti terhadap semua yang berakibat buruk, sehingga mereka tidak memiliki pendengaran dan akal lagi. Berbeda dengan orang-orang yang yakin dan berilmu; orang-orang yang jujur dan beriman, mereka perkuat keimanan mereka dengan dalil-dalil yang sam’i (naqli), mereka dengar semua yang datang dari Allah dan yang dibawa Rasulullah shallallahu 'alaihi wa sallam dengan mengilmuinya dan mengamalkannya. Demikian pula mereka perkuat iman mereka dengan dalil-dalil ‘aqli (akal) sehingga mereka dapat mengetahui mana petunjuk dan mana kesesatan, mana yang baik dan mana yang buruk, mana yang indah dan mana yang jelek, maka Mahasuci Allah yang telah memberikan karunia-Nya kepada siapa yang Dia kehendaki dan menelantarkan siapa yang tidak layak memperoleh kebaikan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mulk Ayat 10",
    "description": "10-11. Dan mereka orang-orang yang tersiksa di neraka itu berkata, 'sekiranya dahulu kami mendengarkan dengan sungguh-sungguh atau memikirkan dengan serius peringatan itu tentulah kami tidak termasuk penghuni neraka yang menyala-Nyala yang azabnya sungguh tidak terbayang oleh kami. ' maka dengan ucapan itu mereka mengakui dosanya. Namun itu pengakuan yang tidak berguna. Tetapi kebinasaanlah yaitu jauhlah dari rahmat Allah bagi penghuni neraka yang menyala-Nyala itu"
  }
]