[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "11. Mereka mengakui pendustaan dan kekafiran mereka yang karenanya mereka berhak atas azab di neraka, sungguh jauh bagi penghuni neraka dari rahmat Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Mereka mengakui dengan sendirinya akan kekafiran dan pendustaan, maka mereka pantas untuk mendapatkan Neraka, lalu kebinasaanlah bagi penghuni Neraka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "11. Namun penyesalan para penghuni neraka ini tidak berguna lagi karena mereka melakukannya pada waktu yang tidak tepat. Mereka berhak mendapat kebinasaan dan azab berat yang sedang mereka rasakan itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "11. فَاعْتَرَفُوا۟ بِذَنۢبِهِمْ (Mereka mengakui dosa mereka) Yakni yang menjadikan mereka layak mendapatkan azab neraka, yaitu dosa kekafiran dan pendustaan para Nabi. فَسُحْقًا لِّأَصْحٰبِ السَّعِيرِ (Maka kebinasaanlah bagi penghuni-penghuni neraka yang menyala-nyala) Yakni mereka amatlah jauh dari Allah dan rahmat-Nya. Allah mengazab mereka setelah mengakui dosa mereka, sebab dengan begitu telah habis hujjah mereka dan tidak tersisa lagi alasan bagi mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Kemudian dibacakanlah dosa-dosa mereka sehingga pengakuan mereka tidak berguna. Maka para penduduk neraka itu jauh dari rahmat Allah SWT"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka mengakui dosa mereka. Maka jauhlah} jauh {bagi para penghuni neraka Sa‘ir itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11. Allah berfirman tentang mereka yang masuk neraka dan mengakui kezhaliman serta pembangkangan mereka, “Mereka mengakui dosa mereka. Maka kebinasaanlah bagi penghuni-penghuni neraka yang menyala-nyala,” maksudnya, amat jauh, rugi dan sengasaralah mereka. Alangkah sengsara dan hinanya mereka karena tidak mendapatkan pahala dari Allah. Mereka selamanya berada didalam siksaan neraka yang menyala-nyala yang membakar jasad mereka hingga sampai ke hati."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mulk ayat 11: Allah menjelaskan bahwa mereka mengakui atas dosa-dosa besar yang mereka lakukan, yaitu mereka menyekutukan Allah dan kufur kepada Allah serta mendustakan para Nabi mereka, Maka sungguh sangat jauh, dan kaliab terhalau dari rahmat Allah wahai penguhuni nereka yang menyala-nyala."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu mendustakan para pemberi peringatan. Sungguh sengsara dan binasa mereka karena tidak memperoleh pahala Allah, menetap terus di neraka yang membakar badan mereka dan menembus sampai ke hati."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mulk Ayat 11",
    "description": "10-11. Dan mereka orang-orang yang tersiksa di neraka itu berkata, 'sekiranya dahulu kami mendengarkan dengan sungguh-sungguh atau memikirkan dengan serius peringatan itu tentulah kami tidak termasuk penghuni neraka yang menyala-Nyala yang azabnya sungguh tidak terbayang oleh kami. ' maka dengan ucapan itu mereka mengakui dosanya. Namun itu pengakuan yang tidak berguna. Tetapi kebinasaanlah yaitu jauhlah dari rahmat Allah bagi penghuni neraka yang menyala-Nyala itu. 12. Bagi orang yang mengingkari kekuasaan Allah, ancamannya dije-laskan pada ayat sebelumnya. Pada ayat ini diterangkan siapa yang akan meraih pahala yang besar, sesungguhnya orang-orang yang takut kepada tuhannya yang tidak terlihat oleh mereka, atau mereka takut kepada-Nya walau mereka itu sendirian tidak terlihat oleh siapa pun, mereka memperoleh ampunan dan pahala yang besar."
  }
]