[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "12. Sesungguhnya orang-orang yang takut kepada Tuhan mereka, di mana mereka menyembahNya sekalipun tidak ada manusia yang melihat mereka, serta mereka takut kepada azab di akhirat sebelum mereka menyaksikannya, bagi mereka ampunan dari Allah dari dosa-dosa mereka dan pahala besar, yaitu surga."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Sesungguhnya orang-orang yang takut kepada Allah saat menyendiri, bagi mereka ampunan atas dosa-dosa mereka dan bagi mereka pahala yang besar, yaitu Surga."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "12. Setelah dijelaskan kesudahan orang-orang kafir; maka pada ayat ini dijelaskan kesudahan orang-orang beriman yang mengagungkan Allah di dunia dan takut dari azab-Nya meskipun mereka belum melihatnya. Mereka berhak mendapat ampunan atas dosa-dosa mereka, dan pahala yang besar sebagai balasan atas keimanan mereka kepada Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12. Sesungguhnya orang-orang yang takut dengan azab Tuhannya, berada dalam ketenangan. Bagi mereka ampunan atas dosa-dosanya dan pahala yang agung yaitu surga"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang yang takut kepada Tuhannya dengan tanpa melihatNya} dengan tanpa melihat {bagi mereka itu ampunan dan pahala yang besar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "12. Setelah menyebutkan keadaan orang-orang yang celaka dan durjana, selanjutnya Allah menyebutkan kondisi orang-orang baik dan berbahagia seraya berfirman, “Sesungguhnya orang-orang yang takut kepada Rabbnya yang tidak tampak oleh mereka,” takut kepada Allah dalam berbagai kondisi mereka hingga dalam keadaan tidak ada seorang pun tahu selain Allah, mereka tidak mendurhakaiNya dan tidak bersikap asal-asalan dalam menunaikan perintah Allah “mereka akan memperoleh ampunan” atas dosa-dosa mereka, Allah pun melindungi mereka dari keburukan dan siksa neraka, “dan pahala yang besar,” yang disediakan oleh Allah bagi mereka di dalam surga, berupa kenikmatan abadi, kerajaan besar, kenikmatan-kenikmatan yang saling berkaitan, istana, kediaman tinggi, bidadari, pelayan dari anak-anak beliau, dan yang lebih besar serta lebih agung dari semua itu, adalah keridhaan Allah Yang Maha Pemurah yang diberikan pada penghuni surga."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mulk ayat 12: Kemudian Allah menyebutkan pemuliaan-Nya dan balasan dari-Nya untuk orang-orang shalih yang beiman dengan hal ghaib, yaitu mereka manusia-manusia yang memiliki rasa takut; Yang mereka sungguh takut kepada Tuhan-Nya, yang olehnya menjadikan mereka menjalankan kewajiban-kewajiban dan meninggalkan kemungkaran. Mereka Allah ampunkan dan Allah ganjar dengan ganjaran yang besar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala menyebutkan keadaan orang-orang yang sengsara, maka Dia menyebutkan keadaan orang-orang yang berbahagia. Sehingga dalam keadaan tersembunyi, mereka tetap menaati Allah, dan sudah barang tentu dalam keadaan terang-terangan mereka lebih menaati lagi. Dengan demikian, mereka taat kepada Allah dalam semua keadaan. Terhadap dosa-dosa mereka. Apabila Allah Subhaanahu wa Ta'aala telah mengampuni dosa-dosa mereka, Dia menjaga mereka dari keburukannya serta menjaga mereka dari azab neraka. Yaitu semua yang Allah siapkan untuk mereka di surga berupa kenikmatan yang kekal, kesenangan yang terus-menerus, istana dan tempat-tempat tinggi, bidadari yang cantik dan para pelayan mereka. Dan yang paling besarnya adalah keridhaan Allah Subhaanahu wa Ta'aala untuk mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mulk Ayat 12",
    "description": "Bagi orang yang mengingkari kekuasaan Allah, ancamannya dije-laskan pada ayat sebelumnya. Pada ayat ini diterangkan siapa yang akan meraih pahala yang besar, sesungguhnya orang-orang yang takut kepada tuhannya yang tidak terlihat oleh mereka, atau mereka takut kepada-Nya walau mereka itu sendirian tidak terlihat oleh siapa pun, mereka memperoleh ampunan dan pahala yang besar. 13. Gunjingan kaum musyrik yang ternyata diketahui oleh rasulullah, menjadikan mereka saling merendahkan bahkan merahasiakan ucapan di antara mereka agar tidak didengar tuhan nabi Muhammad. Ayat ini turun untuk meresponss sikap tersebut. Dan rahasiakanlah perkataanmu atau nyatakanlah. Sungguh, dia maha mengetahui segala isi hati dan segala apa yang kamu rahasiakan."
  }
]