[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "13. Silakan kalian (wahai manusia) merendahkan ucapan kalian dalam suatu urusan apa pun atau umumkanlah terang-terangan, keduanya bagi Allah adalah sama. Sesungguhnya Allah Maha Mengetahui apa yang disimpan oleh dada, maka bagaimana perkataan dan perbuatan kalian bisa samar bagi Allah?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "13. Dan rahasiakanlah -wahai manusia- ucapan kalian atau keraskanlah, maka Allah tetap mengetahuinya, sesungguhnya Dia Maha Mengetahui apa yang ada di dalam hati para hamba-hamba-Nya, tidak ada sesuatu pun dari hal itu yang luput dari-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "13. Ayat ini menjelaskan keluasan ilmu Allah yang meliputi hal yang tersembunyi dan yang terlihat; termasuk segala yang dapat dirahasiakan dan ditampakkan seperti niat, keyakinan, keinginan, pengetahuan, dan perbuatan. Allah Maha Mengetahui perkara yang tersembunyi di dalam hati sebagaimana Dia Mengetahui perkara yang terlihat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "13. وَأَسِرُّوا۟ قَوْلَكُمْ أَوِ اجْهَرُوا۟ بِهِۦٓ ۖ (Dan rahasiakanlah perkataanmu atau lahirkanlah) Sebab semua itu tetap diketahui Allah, karena tidak ada sesuatupun yang tersembunyi dari-Nya. إِنَّهُۥ عَلِيمٌۢ بِذَاتِ الصُّدُورِ(sesungguhnya Dia Maha Mengetahui segala isi hati) Yakni segala yang ada dalam lubuk hati."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13. Wahai manusia, kalian (boleh) menyembunyikan dan menampakkan ucapan kalian, namun sesungguhnya Allah SWT Maha Mengetahui sesuatu yang tersembunyi dalam hati. Ibnu Abbas berkata: “Ayat ini diturunkan untuk orang-orang musyrik dan mereka mendengarnya dari Rasulallah SAW, kemudian Jibril AS memberitahu Muhammad tentang apa yang mereka ucapkan dan mereka terima. Kemudian mereka saling berbicara: “Sembunyikanlah ucapan kalian supaya Tuhan Muhammad tidak mendengarnya”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Rahasiakanlah} sembunyikanlah {perkataanmu atau nyatakanlah} Nyatakanlah {Sesungguhnya Dia Maha Mengetahui segala isi hati"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "13. Ini adalah pemberitahuan Allah tentang keluasan ilmu dan FirmanNYa. Allah berfirman, “Dan rahasiakanlah perkataanmu atau tampakkanlah,” maksudnya, sama saja bagi Allah, tidak ada sesuatu pun yang samar bagiNya karena “sesungguhnya Dia Maha Mengetahui segala isi hati.” Yakni, Mengetahui segala niat dan kehendak hati dan lebih mengetahui perkataan serta perbuatan yang bisa didengar dan dilihat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mulk ayat 13: Ketahuilah wahai orang-orang kafir, bahwasanya apa yang kalian rahasiakan dan tampakkan untuk menyerang (menyakiti) Muhamamad ﷺ, (Sungguh) Allah telah mendengarnya; Ia Maha Mengetahui atas apa yang ada dalam dada-dada kalian sebelum kalian mengucapkannya; Berkata Ibnu Abbas : Telah turun ayat untuk sebagian kaum musyrikin yang mereka mengatakan kepada sebagian diantara mereka : Sembunyikan pembicaraan kalian, agar tak terdengar oleh Rabb Muhammad ﷺ, kemudian Allah kabarkan akan hal ini."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini merupakan berita dari Allah tentang luasnya ilmu-Nya dan meratanya kelembutan-Nya. Semuanya sama bagi-Nya, tidak ada sesuatu pun yang tersembunyi bagi-Nya. Baik berupa niat, keinginan maupun keyakinan. Jika Dia mengetahui isi hati, maka tentu mengetahui apa yang kamu ucapkan dan kamu lakukan yang didengar dan dilihat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mulk Ayat 13",
    "description": "Gunjingan kaum musyrik yang ternyata diketahui oleh rasulullah, menjadikan mereka saling merendahkan bahkan merahasiakan ucapan di antara mereka agar tidak didengar tuhan nabi Muhammad. Ayat ini turun untuk meresponss sikap tersebut. Dan rahasiakanlah perkataanmu atau nyatakanlah. Sungguh, dia maha mengetahui segala isi hati dan segala apa yang kamu rahasiakan. 14. Ayat ini masih kelanjutan sanggahan Allah terhadap sikap kaum musyrik: apakah pantas Allah yang menciptakan semua makhluk termasuk kamu, wahai manusia, itu tidak mengetahui apa yang kamu lahirkan dan rahasiakan' padahal dia mahahalus, maha mengetahui. Sungguh dia pasti maha mengetahui segalanya."
  }
]