[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "14. Mengapa Tuhan semesta alam tidak mengetahui makhlukNya dan urusan-urusan mereka, sedangkan Dia adalah yang menciptakan mereka dan membaguskan penciptaannya? Allah Mahalembut kepada hamba-hambaNya, Mahateliti terhadap mereka dan amal-amal mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Apakah Allah yang menciptakan semua makhluk tidak mengetahui rahasia atau yang lebih tersembunyi dari rahasia? Dan Dia Mahalembut terhadap hamba-hamba-Nya dan Maha Mengetahui segala urusan mereka, tidak ada sesuatu pun dari hal itu yang luput dari-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "14. Bagaimana Allah tidak mengetahui segala hal yang tersembunyi dan rahasia, sedangkan Dia yang menciptakannya dan menciptakan segalanya? Salah satu tanda kekuasaan-Nya adalah Dia Mengetahui dengan pasti segala rahasia dan perkara yang tersembunyi."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "14. أَلَا يَعْلَمُ مَنْ خَلَقَ (Apakah Allah Yang menciptakan itu tidak mengetahui) Yakni tidakkah Dzat yang menciptakan semua itu tidak mengetahui rahasia dan apa yang ada di dalam lubuk hati? Allah telah menciptakan manusia dengan tangan-Nya dan yang paling mengetahui sesuatu adalah penciptanya. وَهُوَ اللَّطِيفُ الْخَبِيرُ (dan Dia Maha Halus lagi Maha Mengetahui?) Yang ilmu-Nya mengetahui rahasia yang disimpan dan disembunyikan dalam hati, tidak ada yang tersembunyi bagi-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14. Apakah Dzat yang telah menciptakan segala sesuatu dan membuatnya berfungsi (semestinya) itu tidak mengetahui sesuatu yang tersembunyi dan yang tampak. Sedangkan Dia Dzat yang Maha Mengetahui detail segala hal, Dzat yang Maha mengabarkan dan menampakkan semua hal yang tampak dan tersembunyi? {Hamzah dalam A Laa} adalah istifham inkary yang menunjukkan fungsi negasi, sedangkan {Laa} berfungsi negasi. Penegasian fungsi negasi adalah untuk memunculkan suatu verifikasi. Maksudnya yaitu bahwa hal itu sudah mutlak diketahui (Allah)"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah pantas Dzat yang menciptakan itu tidak mengetahui, sedangkan Dia Maha lembut lagi Maha Mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "14. Kemudian Allah berfirman mengutarakan dalil aqli yang menunjukkan ilmuNya, “Apakah Allah yang menciptakan itu tidak mengetahui (yang kamu lahirkan dan rahasiakan)?” siapa lagi yang menciptakan, menyempurnakan, dan mengindahkan makhluk, bagaimana Dia tidak tahu yang kalian tampakkan dan kalian sembunyikan? “Dan Dia Maha Halus lagi Maha Mengetahui.” Yang detil ilmu dan pengetahuanNya hingga mengetahui rahasia, segala yang samar, dan yang ghaib. Dan di antara makna Maha Halus adalah Allah memperlakukan hamba-hamba dan orang-orang yang dikasihiNya dengan lemah lembut. Allah mendorong mereka menuju kebaikan padahal mereka tidak merasakan hal itu. Allah menjaga mereka dari keburukan padahal mereka tidak mengira, dan mengangkat mereka ke tingkatan tinggi dengan berbagai sebab yang sama sekali tidak dikira oleh manusia. Bahkan Allah membuat mereka merasakan berbagai hal yang tidak disukai untuk menyampaikan mereka pada harapan tertinggi dan keinginan-keinginan mulia."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mulk ayat 14: Allah mengabarkan bahwa Allah lah yang lebih mengetahui urusan makhluknya, dan Maha Mengetahui atas apa yang disembunyikan setiap makhluknya di dada-dada mereka. Dialah yang Maha Lembut dan Mengetahui, dimana lembut yang mengetahui segalanya dan Maha Mengetahui sampai tahu segala sesuatu yang rahsia dan yang disembunyikan. Maka tidaklah tersembunyi bagi-Nya, sesuatu yang sembunyi (tidak nampak), Dialah Allah yang Maha Mengetahui sesuatu yang rahasia dan yang tersembunyi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala berfirman berdalih dengan dalil ‘aqli (akal) untuk menunjukkan ilmu-Nya. Yakni bagaimana mungkin Allah Subhaanahu wa Ta'aala yang menciptakan makhluk, merapihkannya dan memperbagusnya tidak mengetahui makhluk ciptaan-Nya? Yang halus ilmu-Nya sehingga mengena kepada semua yang rahasia dan tersembunyi serta semua yang gaib. Termasuk makna Lathiif adalah Yang Mahalembut kepada hamba dan wali-Nya, Dia mengarahkan kebaikan dan ihsan kepadanya dari arah yang tidak ia sadari serta melindunginya dari keburukan dari arah yang tidak diduga-duga dan meninggikannya ke derajat yang tinggi dengan sebab-sebab yang tidak telintas dalam hati seorang hamba, bahkan Allah Subhaanahu wa Ta'aala menimpakan berbagai hal yang tidak disukainya agar dia mencapai hal-hal agung yang dicintainya dan kedudukan yang mulia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mulk Ayat 14",
    "description": "Ayat ini masih kelanjutan sanggahan Allah terhadap sikap kaum musyrik: apakah pantas Allah yang menciptakan semua makhluk termasuk kamu, wahai manusia, itu tidak mengetahui apa yang kamu lahirkan dan rahasiakan' padahal dia mahahalus, maha mengetahui. Sungguh dia pasti maha mengetahui segalanya. 15. Setelah ditegaskan bahwa Allah adalah mahahalus dan maha luas pengetahuan-Nya, kini diuraikan kembali tentang kuasa-Nya. Dialah Allah yang menjadikan bumi untuk kamu yang mudah dijelajahi untuk melakukan aneka aktifitas yang bermanfaat, maka jelajahilah di segala penjurunya, berkelanalah ke seluruh pelosoknya, dan makanlah sebagian dari rezeki-Nya yang disediakan untuk kamu, serta bersyukurlah dengan segala karunia-Nya itu. Dan karena pada akhirnya, hanya kepada-Nyalah kamu kembali setelah dibangkitkan."
  }
]