[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "15. Hanya Allah semata yang menjadikan bumi mudah dijelajahi dan terbentang untuk kalian, yang kalian bisa tinggal di atasnya. Berjalanlah di penjuru-penjuru dan ujung-ujungnya. Makanlah rizki Allah yang Dia keluarkan untuk kalian dari bumi. Hanya kepada Allah semata kebangkitan dari alam kubur untuk perhitungan amal dan pembalasan. Dalam ayat ini terkandung dorongan mencari rizki dan bekerja. Dan di dalam ayat ini juga terkandung petunjuk bahwa Allah adalah satu-satunya Tuhan yang haq, tidak ada sekutu bagiNya, juga menunjukkan kuasaNya, mengingatkan nikmat-nikmatNya, dan memperingatkan dari kecenderungan kepada dunia."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Dia lah yang menciptakan bumi itu mudah dan empuk bagi kalian untuk ditinggali, maka berjalanlah di sisi-sisi dan ujung-ujungnya, dan makanlah dari rezeki yang disiapkan-Nya untuk kalian di dunia, dan hanya kepada-Nya sajalah kalian dibangkitkan untuk perhitungan dan pembalasan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "15. Hai manusia, Allah menciptakan bumi bagi kalian, dan menjadikannya mudah ditapaki, maka berjalanlah di berbagai penjurunya untuk mencari nafkah dan rezeki, dan carilah nikmat-nikmat Allah yang ada padanya. Makan dan manfaatkanlah rezeki yang telah Allah berikan kepada kalian, dan ketahuilah bahwa kalian akan kembali kepada Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15. هُوَ الَّذِى جَعَلَ لَكُمُ الْأَرْضَ ذَلُولًا (Dialah Yang menjadikan bumi itu mudah bagi kamu) Yakni mudah untuk kalian tinggali, dan tidak menjadikannya terjal sehingga menyusahkan kalian untuk tinggal dan berjalan di atasnya. فَامْشُوا۟ فِى مَنَاكِبِهَا(maka berjalanlah di segala penjurunya) Yakni di jalan-jalan dan penjurunya. وَكُلُوا۟ مِن رِّزْقِهِۦ ۖ (dan makanlah sebahagian dari rezeki-Nya) Dari rezeki yang diberikan Allah bagi kalian di bumi. Allah mengaruniakan manusia dengan menempatkan mereka di bumi dan memberi mereka kemampuan untuk mendapatkan rezeki di bumi, namun yang harus mereka ketahui bahwa hanya kepada-Nya mereka akan kembali, oleh karena itu Allah berfirman dalam ayat ini: وَإِلَيْهِ النُّشُورُ(Dan hanya kepada-Nya-lah kamu (kembali setelah) dibangkitkan) Yakni kepada-Nya kalian dibangkitkan dari kubur."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "15. Allah SWT adalah Dzat yang menciptakan bumi agar mudah bagimu untuk hidup dan mengambil manfaat darinya. Maka berjalanlah di sisi-sisinya, di jalan-jalannya dan kunjungilah setiap penjurunya. Makanlah apa yang diberikan oleh Allah di bumi. Dan hanya kepadaNyalah (para mayat) yang dibangkitkan dari kubur itu dikembalikan untuk dihisab dan dibalas (amalnya)"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dialah yang menjadikan bumi untuk kalian dalam keadaan mudah dimanfaatkan} mudah lagi gampang {Maka berjalanlah segala penjurunya} ke segala penjuru dan pelosoknya {dan makanlah sebagian dari rezekiNya. Hanya kepadaNya kalian dibangkitkan} dibangkitkan dari kubur kalian untuk dihisab"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "15. Maksudnya, Dia-lah yang menundukkan bumi untuk kalian agar kalian bisa mendapatkan apa pun yang kalian perlukan, seperti bercocok tanam, mendirikan bangunan, membuat jalan yang menghubungkan ke tempat yang jauh dan berbagai negara. \"Maka berjalanlah di segala penjurunya,” maksudnya, untuk mencari rizki dan penghasilan, “dan makanlah sebagian dari rizkinya. Dan hanya kepadaNya-lah kamu (kembali setelah) dibangkitkan.” Maksudnya, setelah kalian berpindah dari dunia ini yang dijadikan Allah sebagai tempat ujian dan penghantar menuju akhirat. Setelah kalian meninggal dunia, kalian akan dibangkitkan dan dikumpulkan menuju Allah untuk membalas amal perbuatan kalian, baik dan buruknya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mulk ayat 15: Allah menyebutkan kebaikan-Nya dan dan karunia-Nya bagi makhluk-Nya. Allah berkata : Dialah yang menjadikan bagi kalian bumi yang datar, terhampar dan luas dimana-mana, hingga kalian dapat tinggal di atasnya, kalian dapat berpindah-pindah semau yang kalian inginkan, kalian juga dapat bercocok-tanam dengan kekuatan-kekuatan kalian, dan kalian dapat berjalan menyusuri bagian ujungnya dan sisi-sisinya, makanlah oleh kalian atas pemberian dari rizki Allah, yang Allah telah keluarkan dari bumi. Kemudian ketahuilah oleh kalian bahwa kepada-Nya lah kalian kembali dan dibangkitkan dari kuburan-kuburan kalian untuk dihisab dan dibalas."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dialah Allah yang menundukkan bumi untukmu agar kamu dapat memperoleh kebutuhanmu, seperti menanam, membangun, menggarap dan jalan-jalan untuk menyampaikan ke negeri yang jauh. Untuk mencari rezeki. Yakni setelah kamu berpindah dari tempat yang Allah jadikan sebagai ujian dan sebagai penyambung untuk melanjutkan ke negeri akhirat, maka kamu akan dibangkitkan dan dikumpulkan kepada Allah untuk diberi-Nya balasan terhadap amalmu yang baik dan yang buruk."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mulk Ayat 15",
    "description": "Setelah ditegaskan bahwa Allah adalah mahahalus dan maha luas pengetahuan-Nya, kini diuraikan kembali tentang kuasa-Nya. Dialah Allah yang menjadikan bumi untuk kamu yang mudah dijelajahi untuk melakukan aneka aktifitas yang bermanfaat, maka jelajahilah di segala penjurunya, berkelanalah ke seluruh pelosoknya, dan makanlah sebagian dari rezeki-Nya yang disediakan untuk kamu, serta bersyukurlah dengan segala karunia-Nya itu. Dan karena pada akhirnya, hanya kepada-Nyalah kamu kembali setelah dibangkitkan. 16-17. Bukti kekuasaan dan keluasan ilmu-Nya sudah dipaparkan, kalau manusia tetap durhaka maka Allah menegaskan dalam ayat ini: sudah merasa amankah kamu, bahwa dia Allah yang di langit tidak akan membuat kamu ditelan bumi ketika tiba-tiba ia terguncang'. Mestinya kamu tidak merasa aman dengan tetap durhaka. Karena orang sebelum kamu seperti karun karena kedurhakaannya dia ditelan bumi. Atau sudah merasa amankah kamu, bahwa dia Allah yang di langit yang mengendalikan sepenuhya semua makhluk, tidak akan mengirimkan badai yang berbatu kepadamu yang dapat membinasakan kamu' namun kalau kamu tetap durhaka, kelak kamu akan mengetahui bagaimana akibat mendustakan peringatan-ku."
  }
]