[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "16-17. Apakah kalian (wahai orang-orang kafir Makkah) merasa aman dari Allah yang di atas langit yang bisa membenamkan kalian ke dalam bumi, di mana tiba-tiba bumi berguncang lalu membinasakan kalian? Apakah kalian merasa aman dari Allah yang bisa mengirimkan angin kepada kalian yang melempari kalian dengan batu-batu kecil? Kalian akan tahu, wahai orang-orang kafir, bagaimana peringatanKu kepada kalian manakala kalian menyaksikan azab. Saat itu ilmu kalian tentangnya tidak bermanfaat. Ayat ini menetapkan sifat uluw (ketinggian) bagi Allah sesuai dengan keagunganNYa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Apakah kalian merasa aman terhadap Allah yang berada di langit bahwa Dia akan membelah bumi dari bawah kalian sebagaimana Dia membelahnya dari bawah Qārūn, setelah tadinya (bumi itu) mudah dan terhampar untuk ditinggali, lalu tiba-tiba bumi bergoncang setelah stabil?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "16. Ayat ini ditujukan bagi orang-orang kafir, setelah ayat sebelumnya ditujukan bagi seluruh manusia. Hai orang-orang kafir, apakah kalian merasa aman dari siksaan Allah atas kekafiran kalian, dan dari kekuasaan-Nya untuk mengoncangkan bumi dan memporak-porandakannya?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "16. ءَأَمِنتُم مَّن فِى السَّمَآءِ (Apakah kamu merasa aman terhadap yang (berkuasa) di langit) Yaitu Allah. أَن يَخْسِفَ بِكُمُ الْأَرْضَ(bahwa Dia akan menjungkir balikkan bumi bersama kamu) Yakni menenggelamkan kalian ke dalam tanah sebagaimana yang Allah lakukan kepada Qarun, padahal sebelumnya Allah menjadikan bumi itu mudah untuk kalian berjalan di atasnya. فَإِذَا هِىَ تَمُورُ(sehingga dengan tiba-tiba bumi itu bergoncang?) Yakni bergoncang, berbeda dengan biasanya yang tenang dan mudah di lewati."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16. Apakah kalian tidak akan mengimani Allah yang memiliki kekuasaan di langit (kalian harus beriman). Dzat yang menurunkan kalian di bumi dan mengubur kalian di dalamnya, sebagaimana yang dilakukan kepada Qarun saat bumi diguncangkan?!"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apakah kalian sudah merasa aman} apakah kalian merasa aman {dari Dzat yang di langit} Allah yang ada di atas langit {yaitu membenamkan bumi bersama kalian ketika tiba-tiba terguncang} terguncang bersama kalian sehingga kalian binasa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "16. Ini adalah peringatan dan ancaman bagi orang yang terus menerus melampaui batas dan durhaka, yang mengharuskan mereka mendapatkan siksaan dan mengundang azab. Allah berfirman, “Apakah kamu merasa aman terhadap Yang di langit,” Yaitu Allah Mahatinggi di atas makhlukNya, “bahwa Dia menjungkir balikkan bumi bersama kamu, sehingga dengan tiba-tiba bumi itu bergoncang,” menggoncangkan kalian hingga kalian binasa dan lenyap."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mulk ayat 16: Allah menegur orang-orang kafir, Allah berkata : Apakah kalian beriman wahai orang-orang kafir, akan kemarahan Allah yang besar dan mulia, dimana Allah ada di atas langit dan akan menimpakan bagi kalian bumi, maka kalian akan terhantam dan terhimpit, dengan kuasa Allah dan engkau akan binasa ? Atau apakah kalian beriman terhadap siapa yang ada di langit, yang akan menimpakan kepada kalian angin dahsyat yang mebawa kerikil batu, kemudian kalian akan binasa dan teradzab ? Sebagaimana binasanya kaum Luth, Ad dan pasukan bergajah yang sebelum kalian, kalian juga akan mengetahui adzab yang sudah Allah peringatkan dengan mata-mata kalian sendiri."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini merupakan ancaman terhadap orang yang tetap melampaui batas dan mendurhakai Allah dimana yang demikian mendatangkan azab Allah dan hukuman-Nya. Yaitu Allah Subhaanahu wa Ta'aala Yang Mahatinggi di atas seluruh makhluk-Nya. Imam Malik rahimahullah berkata, “Sesungguhnya Allah di (atas) langit dan ilmu-Nya di semua tempat.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mulk Ayat 16",
    "description": "16-17. Bukti kekuasaan dan keluasan ilmu-Nya sudah dipaparkan, kalau manusia tetap durhaka maka Allah menegaskan dalam ayat ini: sudah merasa amankah kamu, bahwa dia Allah yang di langit tidak akan membuat kamu ditelan bumi ketika tiba-tiba ia terguncang'. Mestinya kamu tidak merasa aman dengan tetap durhaka. Karena orang sebelum kamu seperti karun karena kedurhakaannya dia ditelan bumi. Atau sudah merasa amankah kamu, bahwa dia Allah yang di langit yang mengendalikan sepenuhya semua makhluk, tidak akan mengirimkan badai yang berbatu kepadamu yang dapat membinasakan kamu' namun kalau kamu tetap durhaka, kelak kamu akan mengetahui bagaimana akibat mendustakan peringatan-ku"
  }
]