[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "16-17. Apakah kalian (wahai orang-orang kafir Makkah) merasa aman dari Allah yang di atas langit yang bisa membenamkan kalian ke dalam bumi, di mana tiba-tiba bumi berguncang lalu membinasakan kalian? Apakah kalian merasa aman dari Allah yang bisa mengirimkan angin kepada kalian yang melempari kalian dengan batu-batu kecil? Kalian akan tahu, wahai orang-orang kafir, bagaimana peringatanKu kepada kalian manakala kalian menyaksikan azab. Saat itu ilmu kalian tentangnya tidak bermanfaat. Ayat ini menetapkan sifat uluw (ketinggian) bagi Allah sesuai dengan keagunganNYa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Apakah kalian merasa aman terhadap Allah yang berada di langit bahwa Dia akan mengirimkan kepada kalian bebatuan dari langit sebagaimana Dia mengirimkannya kepada kaum Lūṭ? Maka kalian akan tahu peringatan-Ku ketika kalian melihat secara langsung siksaan-Ku, akan tetapi perintangan tersebut tidak berguna lagi bagi kalian setelah melihat siksa-Ku."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "17. Hai orang-orang kafir, apakah kalian merasa aman dari siksaan Allah atas kekafiran kalian, dengan menurukankan batu-batu dari langit yang menghujam kalian sebagaimana yang terjadi pada beberapa umat terdahulu? Jika kalian telah melihat hal itu maka kalian akan menjadi yakin bahwa peringatan dan ancaman dari Allah itu benar, dan Dia Maha Kuasa untuk melaksanakan ancaman-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "17. أَمْ أَمِنتُم مَّن فِى السَّمَآءِ أَن يُرْسِلَ عَلَيْكُمْ حَاصِبًا ۖ (atau apakah kamu merasa aman terhadap Allah yang (berkuasa) di langit bahwa Dia akan mengirimkan badai yang berbatu) Yakni batu-batu dari langit, sebagaimana yang dikirimkan kepada kaum Luth dan pasukan gajah. Pendapat lain mengatakan: yakni angin yang membawa bebatuan. فَسَتَعْلَمُونَ كَيْفَ نَذِيرِ(Maka kelak kamu akan mengetahui bagaimana (akibat mendustakan) peringatan-Ku?) Yakni ketika kalian telah melihat azab ini, sedangkan pengetahuan kalian itu tidak bermanfaat lagi bagi kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17. Atau kalian mengimani Allah yang berada di langit dan mengatur (segala sesuatu) di sana. Dzat yang mengirimkan kepada kalian angin kencang yang mengandung kerikil. Angin tiu melempari kalian dengan kerikil itu dan menghancurkan kalian. Saat kalian diuji melalui azab, kalian akan mengetahui bagaimana Aku memperingatkan bahwa azabKu itu benar adanya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Atau kalian sudah merasa aman dari Dzat yang di langit, yaitu mengirimkan kepada kalian badai batu} angin yang melempari kalian batu-batu kecil {Kelak kamu akan mengetahui bagaimana peringatanKu} peringatanKu terhadap kalian ketika kalian melihat azab"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17-18. “Atau apakah kamu merasa aman terahadap (Allah) Yang di langit bahwa Dia akan mengirimkan badai yang berbatu,” yakni azab dari langit yang menimpa kalian sebagai pembalasan Allah terhadap kalian? “Maka kelak kamu akan mengetahui bagaimana (akibat mendustakan) peringatan-peringatanKu,” maksudnya, bagaimana ancamanKu yang disampaikan oleh para rasul dan kitab-kitab sampai pada kalian. Janganlah kalian mengira amannya kalian dari siksaan dunia dan siksaan dari langit itu berguna bagi kalian. Cepat atau lambat kalian akan merasakan akibat buruk dari perbuatan kalian. Orang-orang sebelum kalian juga berdusta seperti halnya kalian, Allah membinasakan mereka, maka perhatikanlah bagaimanakah pengingkaran (pembalasan) Allah terhadap mereka. Allah menyegerakan siksaan duniawi sebelum siksaan akhirat. Maka waspadalah agar kalian tidak tertimpa azab yang pernah menimpa orang-orang sebelum kalian."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mulk ayat 17: Allah menegur orang-orang kafir, Allah berkata : Apakah kalian beriman wahai orang-orang kafir, akan kemarahan Allah yang besar dan mulia, dimana Allah ada di atas langit dan akan menimpakan bagi kalian bumi, maka kalian akan terhantam dan terhimpit, dengan kuasa Allah dan engkau akan binasa ? Atau apakah kalian beriman terhadap siapa yang ada di langit, yang akan menimpakan kepada kalian angin dahsyat yang mebawa kerikil batu, kemudian kalian akan binasa dan teradzab ? Sebagaimana binasanya kaum Luth, Ad dan pasukan bergajah yang sebelum kalian, kalian juga akan mengetahui adzab yang sudah Allah peringatkan dengan mata-mata kalian sendiri."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ketika melihat azab. Allah Subhaanahu wa Ta'aala menyegerakan untuk mereka hukuman dunia sebelum hukuman akhirat. Oleh karena itu, berhati-hatilah jangan sampai kamu ditimpa hukuman seperti yang menimpa mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mulk Ayat 17",
    "description": "16-17. Bukti kekuasaan dan keluasan ilmu-Nya sudah dipaparkan, kalau manusia tetap durhaka maka Allah menegaskan dalam ayat ini: sudah merasa amankah kamu, bahwa dia Allah yang di langit tidak akan membuat kamu ditelan bumi ketika tiba-tiba ia terguncang'. Mestinya kamu tidak merasa aman dengan tetap durhaka. Karena orang sebelum kamu seperti karun karena kedurhakaannya dia ditelan bumi. Atau sudah merasa amankah kamu, bahwa dia Allah yang di langit yang mengendalikan sepenuhya semua makhluk, tidak akan mengirimkan badai yang berbatu kepadamu yang dapat membinasakan kamu' namun kalau kamu tetap durhaka, kelak kamu akan mengetahui bagaimana akibat mendustakan peringatan-ku. 18. Jangan ada yang menduga bahwa ancaman yang dikemukakan pada ayat-ayat yang lalu hanya 'gertak sambal' yaitu ancaman yang tanpa bukti. Sungguh ancaman itu dapat juga menimpa kaum musyrik mekah. Ayat ini menegaskan: dan sungguh, orang-orang yang sebelum mereka kaum musyrik mekah itu pun telah mendustakan dan mendurhakai rasul-rasul-Nya. Maka betapa hebatnya kemurkaan-ku!."
  }
]