[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "18. Orang-orang sebelum kaum kafir Makkah telah mendustakan para rasul mereka, seperti kaum Nuh, Ad dan Tsamud. Maka lihatlah, bagaimana pengingkaranKu atas mereka dan perubahan kenikamatan yang mereka dapatkan menjadi azab yang Aku turunkan dalam membinasakan mereka?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Dan sungguh umat-umat yang mendahului orang-orang musyrik itu telah mendustakan, lalu turunlah atas mereka siksa Allah karena kebandelan mereka dalam kekufuran dan pendustaan, maka bagaimana murka-Ku kepada mereka? Sungguh murka-Ku amat keras."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "18. Ayat ini berisi sumpah bahwa umat-umat terdahulu sebelum orang-orang kafir ini telah mendustakan para Rasul mereka, sehingga mereka mendapat siksaan yang menyakitkan; telah turun kepada mereka berbagai jenis azab sebagai basalan dan pengingkaran Allah terhadap mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "18. فَكَيْفَ كَانَ نَكِيرِ (Maka alangkah hebatnya kemurkaan-Ku) Yakni bagaimana kemurkaan-Ku terhadap mereka sehingga Aku menimpakan kepada mereka azab yang begitu mengerikan?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "18. Sungguh orang-orang kafir terhadulu sebelum kaum musyrik Mekah telah mendustakan (ayat Allah), lalu bagaimanakah azabKu bagi mereka?!"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sungguh orang-orang sebelum mereka juga benar-benar telah mendustakan. Maka betapa hebatnya kemurkaanKu} terhadap mereka dengan menurunkan azab kepada mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17-18. “Atau apakah kamu merasa aman terahadap (Allah) Yang di langit bahwa Dia akan mengirimkan badai yang berbatu,” yakni azab dari langit yang menimpa kalian sebagai pembalasan Allah terhadap kalian? “Maka kelak kamu akan mengetahui bagaimana (akibat mendustakan) peringatan-peringatanKu,” maksudnya, bagaimana ancamanKu yang disampaikan oleh para rasul dan kitab-kitab sampai pada kalian. Janganlah kalian mengira amannya kalian dari siksaan dunia dan siksaan dari langit itu berguna bagi kalian. Cepat atau lambat kalian akan merasakan akibat buruk dari perbuatan kalian. Orang-orang sebelum kalian juga berdusta seperti halnya kalian, Allah membinasakan mereka, maka perhatikanlah bagaimanakah pengingkaran (pembalasan) Allah terhadap mereka. Allah menyegerakan siksaan duniawi sebelum siksaan akhirat. Maka waspadalah agar kalian tidak tertimpa azab yang pernah menimpa orang-orang sebelum kalian."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mulk ayat 18: Sungguh telah berdusta mereka sebelum orang-orang kafir Mekkah dari ummat yang terdahulu, dimana diadzab dengan halilintar, dengan ditimpa dari atas, dan dengan ditenggelamkan dan yang selainnya. Apakah kalian tidak melihat bagaimana mereka yang ingkar kepada Allah, yang bahwasanya mereka tumbang dan binasa dengan kebinasaan yang sempurna, dengan sebab mereka mendustakan ayat-ayat Allah ?"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mulk Ayat 18",
    "description": "Jangan ada yang menduga bahwa ancaman yang dikemukakan pada ayat-ayat yang lalu hanya 'gertak sambal' yaitu ancaman yang tanpa bukti. Sungguh ancaman itu dapat juga menimpa kaum musyrik mekah. Ayat ini menegaskan: dan sungguh, orang-orang yang sebelum mereka kaum musyrik mekah itu pun telah mendustakan dan mendurhakai rasul-rasul-Nya. Maka betapa hebatnya kemurkaan-ku!19. Pada bagian awal surah ini telah disinggung kuasa Allah di langit. Ayat ini menegaskan kembali hal tersebut: tidakkah mereka yaitu kaum musyrik mekah dan siapa saja yang meragukan kuasa Allah, memperhatikan burung-burung ketika terbang yang selalu mengembangkan dan mengatupkan sayapnya di atas mereka' tidak ada yang menahannya burung-burung itu di udara selain yang maha pengasih tuhan pelimpah rahmat bagi segala makhluk. Sungguh, dia maha melihat segala sesuatu dan maha mengetahui bagaimana menciptakan segala sesuatu."
  }
]