[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "19-21. Apakah orang-orang kafir itu lalai dan tidak melihat kepada burung-burung yang ada di atas mereka, burung-burung itu membentangkan sayap-sayapnya saat terbang di angkasa dan terkadang merapatkannya? Hanya Allah yang Maha Pengasih yang menahannya ( di udara) sehingga ia tidak jatuh. Sesungguhnya Allah Maha Melihat segala sesuatu, tidak ada kekurangan dan perbedaan pada makhlukNya. Siapakah orang yang menurut klaim kalian (wahai orang-orang kafir) merupakan sekutu kalian yang akan menolong kalian selain Allah manakala Allah menghendaki keburukan atas kalian? Orang-orang kafir dalam klaimnya ini hanya dalam kesesatan dan mereka tertipu oleh setan. Atau siapakah yang memberi rizki untuk kalian manakala Allah menahan rizki itu dan tidak memberikannya kepada kalian? Orang-orang kafir itu justru bersikukuh dalam kesesatan dan pelanggaran, kesombongan dan penentangan, menjauh dari kebenaran, tidak mendengarkannya dan tidak mengikutinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Tidakkah orang-orang yang mendustakan itu melihat burung yang ada di atas mereka ketika terbang? Kadang-kadang dia mengembangkan sayapnya di udara, dan terkadang menguncupkannya. Tidak ada yang memegangnya agar tidak jatuh ke bumi kecuali Allah. Sesungguhnya Dia Maha Melihat, tidak ada sesuatu pun yang luput dari-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "19. Ayat ini mengalihkan pandangan para makhluk kepada salah satu kenikmatan Allah dan tanda kekuasaan-Nya, dan ayat ini mengajak mereka untuk melihat hal ini dengan penuh penghayatan. Allah telah menciptakan udara yang menjadikan burung dapat terbang, sesekali ia membentangkan sayapnya dan sesekali ia menurunkannya. Ini semua merupakan rahmat dan kuasa Allah, Dia dengan rahmat-Nya menjaga burung-burung itu agar tidak terjatuh, dan Dia Maha Melihat segalanya dan Maha Mengetahui segala keadaan, serta Dia menciptakan makhluk-Nya dengan luar biasa."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "19. أَوَلَمْ يَرَوْا۟ إِلَى الطَّيْرِ فَوْقَهُمْ صٰٓفّٰتٍ (Dan apakah mereka tidak memperhatikan burung-burung yang mengembangkan sayapnya di atas mereka?) Yakni mengembangkan sayapnya di udara ketika sedang terbang. وَيَقْبِضْنَ ۚ( dan mengatupkannya) Dan mengepakkan sayapnya. مَا يُمْسِكُهُنَّ(Tidak ada yang menahannya) Ketika sedang terbang di udara. إِلَّا الرَّحْمٰنُ ۚ( selain Yang Maha Pemurah) Yang Mampu melakukan segala sesuatu. Dia menciptakan burung dengan penciptaan yang detail, dengan tubuh yang ringan yang diselimuti bulu yang tumbuh dengan susunan tertentu, jika burung itu menggerakkan sayapnya maka ia akan terbang إِنَّهُۥ بِكُلِّ شَىْءٍۭ بَصِيرٌ (Sesungguhnya Dia Maha Melihat segala sesuatu) Tidak ada yang tersembunyi bagi-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19. Ataukah orang-orang kafir itu tidak melihat burung yang terbang di udara yang kadang-kadang mengembangkan dan mengatupkan sayap-sayapnya ketika terbang. Tidak ada yang menahannya melakukan dua hal itu kecuali Dzat yang Maha Pengasih dengan kuasaNya. Sesungguhnya Allah SWt, Maha Melihat segala sesuatu, Dzat yang mengetahui bagaimana menciptakan segala sesuatu yang asing dan mengatur segala sesuatu yang menakjubkan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apakah mereka tidak memperhatikan burung-burung di atas mereka yang mengembangkan} yang membentagkan sayapnya ketika terbang di udara {dan mengatupkan sayapnya} dan terkadang menutupnya {Tidak ada yang menahannya selain Dzat Yang Maha Pengasih. Sesungguhnya Dia Maha Melihat segala sesuatu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "19. Ini adalah teguran dan dorongan agar memperhatikan kondisi burung yang ditundukkan Allah, Allah menundukkan udara dan angin untuknya. Burung mengepakkan sayapnya untuk terbang dan menjaganya agar tidak jatuh ke tanah. Burung tetap bertasbih ketika berada di udara dan mengulang-ulangnya sesuai kehendak dan keperluannya. “Tidak ada yang menahannya (di udara) selain Yang Maha Pemurah.” Dia-lah yang menundukkan langit bagi burung, anatomo tubuhnya dirancang oleh Allah dalam bentuk yang bisa membuatnya terbang. Siapa pun yang memperhatikan dan merenungkan kondisi burung, akan mengetahui bahwa burung itu menunjukkan kekuasaan Allah Yang Maha Pencipta serta perhatianNya. Hanya Dia semata yang berhak disembah. “Sesungguhnya Dia Maha Melihat segala sesuatu.” Dia-lah yang mengatur hamba-hambaNya dengan segala sesuatu yang sesuai bagi mereka sebagaimana tuntutan hikmahNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mulk ayat 19: Apakah ia tidak melihat (yaitu orang-orang kafir) terhadap sekumpulan burung yang terbang tinggi di langit, mengepak-ngepakkan sayapnya di udara ? Tidak ada yang menjaganya supaya tidak terjatuh, kecuali Ar Rahman yang kasih sayang-Nya sangat luas dan kuasa atas segala sesuatu. Bukankah hanya Allah yang pantas melimpahkan kuasa yang besar ini, yang Dia Maha Mulia, dan (Manusia) wajib beriman kepada-Nya ?. Sesungguhnya Allah mengetahui atas kondisi ciptaan-Nya, menjaga segala urusannya (agar tetap di atas kebaikan) dan membalas (amalan) nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini merupakan teguran dan dorongan untuk melihat keadaan burung yang telah Allah tundukkan, dan Dia tundukkan pula udara untuknya, burung tersebut mengembangkan sayapnya untuk dapat terbang dan menggenggamnya untuk turun, ia selalu melayang di udara berkeliling sesuai keinginan dan kebutuhannya. Syaikh As Sa’diy menerangkan, Allah Subhaanahu wa Ta'aala yang menundukkan udara untuknya, menjadikan jasad dan fisik mereka dalam keadaan siap untuk terbang. Siapa saja yang memperhatikan keadaan burung dan mengambil pelajaran dari sana tentu hal itu akan menunjukkannya kepada kekuasaan Allah dan perhatian-Nya kepada makhluk, dan bahwa Dia Mahaesa; tidak ada yang berhak disembah selain Dia. Ada pula yang menafsirkan, maksud ayat ini adalah apakah mereka tidak mengambil dalih dengan tetapnya burung di udara untuk menunjukkan kekuasaan Allah, dimana Dia mampu bertindak terhadap mereka apa yang dilakukan-Nya terhadap orang-orang yang sebelum mereka berupa penimpaan azab. Oleh karena itu, Dia yang mengatur untuk hamba-hamba-Nya dengan sesuatu yang sesuai dengan mereka dan dikehendaki hikmah-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mulk Ayat 19",
    "description": "Pada bagian awal surah ini telah disinggung kuasa Allah di langit. Ayat ini menegaskan kembali hal tersebut: tidakkah mereka yaitu kaum musyrik mekah dan siapa saja yang meragukan kuasa Allah, memperhatikan burung-burung ketika terbang yang selalu mengembangkan dan mengatupkan sayapnya di atas mereka' tidak ada yang menahannya burung-burung itu di udara selain yang maha pengasih tuhan pelimpah rahmat bagi segala makhluk. Sungguh, dia maha melihat segala sesuatu dan maha mengetahui bagaimana menciptakan segala sesuatu. 20. Kaum musyrik mekah sering kali mengandalkan kekuatan material atau berhala-berhala yang mereka sembah sebagai pembela mereka. Ayat ini menampik klaim tersebut atau siapakah yang akan kamu andalkan untuk menjadi bala tentara dan pembela bagimu yang dapat membelamu selain Allah yang maha pengasih' orang-orang kafir itu hanyalah dalam keadaan tertipu."
  }
]