[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "2. Allah Yang menciptakan kematian dan kehidupan agar Dia menguji kalian (wahai manusia) siapa di antara kalian yang lebih baik dan lebih ikhlas amalnya. Allah Mahaperkasa yang tidak ada sesuatu yang melemahkanNya. Ayat ini mengandung dorongan berbuat kebaikan dan hardikan dari berbuat maksiat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Dia yang menciptakan kematian dan kehidupan untuk menguji kalian -wahai manusia- siapa di antara kalian yang paling baik amalnya. Dia Maha Perkasa, tidak ada sesuatu pun yang bisa mengalahkan-Nya, Maha Pengampun atas dosa-dosa hamba-Nya yang bertobat kepada-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "2. Salah satu tanda kekuasaan Allah adalah Dia yang menghidupkan dan mematikan; kehidupan dan kematian merupakan bagian dari makhluk-Nya. Dia memberi kehidupan bagi yang Dia kehendaki dengan menghidupkan sesuatu yang sebelumnya mati, dan setelah itu mematikannya tanpa ada kehendak dari makhluk itu; karena kehendak menghidupkan dan mematikan hanyalah milik Allah. Dan ayat ini menjelaskan hikmah dari adanya kehidupan dan kematian; yaitu sebagai ujian bagi hamba-hamba-Nya, agar jelas kebaikan orang yang baik dan keburukan orang yang buruk. Allah Maha Kuasa, keputusan dan perintah-Nya pasti terlaksana, dan Dia Maha Pengampun bagi orang yang bertaubat dan memperbaiki diri."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. الَّذِى خَلَقَ الْمَوْتَ وَالْحَيَوٰةَ (Yang menjadikan mati dan hidup) Makna (الموت) yakni terputus dan terpisahnya antara ruh dengan jasad. Sedangkan (الحياة) yakni terhubungnya antara ruhdan jasad, sehingga yang dimaksud adalah Allah menciptakan manusia dan menjadikan ditubuhnya ruh. لِيَبْلُوَكُمْ أَيُّكُمْ أَحْسَنُ عَمَلًا ۚ( supaya Dia menguji kamu, siapa di antara kamu yang lebih baik amalnya) Yakni Allah akan membebani kalian (dengan perintah dan larangan) kemudian menjadikannya ujuan, lalu membalas kalian atas apa yang kalian perbuat. Dan tujuan dari ujian ini adalah agar nampak kebaikan orang yang baik dan ketaatan orang yang taat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Dzat yang menciptakan kematian dan dengan kuasaNya Dia abadi. Dia juga Dzat yang menciptakan kehidupan dan berkuasa di atasnya supaya kalian dapat bermuamalah, untuk menguji siapa di antara kalian yang amal ibadahnya paling ikhlas di sisi Allah dan paling taat kepadaNya. Dialah Dzat yang Maha Kuat dan Maha Perkasa sehingga tidak ada satupun yang lebih perkasa dariNya. Dzat yang Maha Besar ampunanNya bagi orang-orang yang bertaubat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dzat yang menciptakan kematian dan kehidupan untuk menguji kalian} menguji kalian {siapa di antara kalian yang lebih baik amalnya} lebih ikhlas dan lebih benar amalnya {Dia Maha perkasa lagi Maha Pengampun"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2. “Yang menjadikan mati dan hidup,” Allah menakdirkan hidup dan mati untuk hamba-hambaNya, “supaya Dia menguji kamu, siapa di antara kamu yang lebih baik amalnya.” Yakni, siapa yang amalannya paling ikhlas dan paling benar. Allah menciptakan para hambaNya dan dimunculkan di alam dunia ini. Mereka diberitahu akan dipindahkan dari alam ini. Allah memberlakukan berbagai perintah dan larangan untuk mereka dan diuji dengan berbagai keinginan hawa nafsu yang memalingkan mereka dari perintahNya. Barangsiapa yang tunduk pada perintah Allah, dan melakukan amalan baik, maka Allah akan memberinya pahala yang baik di dunia dan di akhirat. Namun siapa pun yang condong pada hawa nafsunya dan tidak menghiraukan perintah Allah, maka akan mendapatkan balasan buruk. “Dan Dia Mahaperkasa,” Yang bagiNya seluruh keperkasaan, dan dengan keperkasaan itu Allah memaksa segala sesuatu dan seluruh makhlukNYa tunduk padaNya, “lagi Maha Pengampun,” yang mengampuni orang-orang yang melakukan keburukan, mereka yang tidak menunaikan kewajiban secara baik dan orang-orang yang berdosa khususnya, jika mereka bertaubat dan kembali kepada Allah, maka Allah akan mengampuni dosa-dosa mereka meski sampai sebanyak kolong langit, Allah menutupi aib mereka meski sepebuh bumi."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mulk ayat 2: Allah menyebutkan dari yang nampak atas kekuasaan-Nya adalah Allah menciptakan maut, dimana ia adalah berpisahnya ruh dari jasad, dan menciptakan kehidupan, dimana ia adalah menyatukan ruh bagi badan dari jin dan manusia serta selainnya. Ketahuilah oleh kalian bahwa Allah menciptakan maut dan kehidupan untuk menguji kalian, yaitu siapa di antara kalian yang baik dalam beramal, dan juga sebagai balasan atas amalan kalian atas apa yang pantas didapatkan (oleh amalan kalian) berupa pahala. Dan sebaik-baik amalan adalah yang ikhlas mencari wajah Allah, dan benar yaitu mengikuti apa yang diperintahkan Allah dan Rasul-Nya ﷺ, atau yang paling ikhlas dan benar (amalannya), dan Allah tidak mengatakan yang paling banyak; Sebab ungkapan kebenaran (dari sebuah amalan), adalah tergantung pada metode (manhaj) yang Rasulullah ﷺ telah ajarkan. Dan Ia (Allah) Maha Kuat yang tidak dikuasai sesuatu apapun, dan Maha Pengampun atas orang-orang yang banyak dosa jika mereka bertaubat dan mau memperbaiki dirinya. Allah menyebutkan ampunan setelah menyebutkan kemuliaannya, karena sebab kemuliaan yaitu kekuasaan dan pembalasan, dan Maha Pengampun yaitu pengampunan dari dosa bagia siapa yang telah bertaubat dan beramal shalih."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni kematian di dunia dan kehidupan di akhirat. Atau, Dia menetapkan untuk hamba-hamba-Nya hidup di dunia kemudian mati. Yakni lebih ikhlas dan lebih sesuai dengan sunnah Rasulullah shallallahu 'alaihi wa sallam. Hal itu, karena Allah Subhaanahu wa Ta'aala menciptakan hamba-hamba-Nya, mengeluarkan mereka ke tempat ini (dunia) dan memberitahukan bahwa mereka akan berpindah darinya; Dia memerintah dan melarang mereka serta menguji mereka dengan berbagai syubhat yang bertentangan dengan perintah-Nya, maka barang siapa yang tunduk kepada perintah Allah dan memperbagus amalnya, maka Allah akan memperbagus balasan-Nya di dunia dan akhirat, sebaliknya barang siapa yang mengikuti hawa nafsu dan menolak mengikuti perintah Allah, maka dia akan memperoleh balasan yang buruk. Milik-Nya semua keperkasaan, dimana dengan keperkasaan-Nya Dia tundukkan segala sesuatu. Terhadap orang-orang yang bersalah dan berdosa, khususnya apabila mereka bertobat dan kembali, maka sesungguhnya Dia mengampuni dosa-dosa mereka meskipun dosa mereka setinggi langit, dan Dia akan menutup aib mereka meskipun sepenuh dunia. Ya Allah, ampunilah kami dan tutupilah aib kami."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mulk Ayat 2",
    "description": "Salah satu bukti kekuasaan-Nya adalah dia yang menciptakan mati dan menentukan ajalnya, dan hidup dengan menentukan kadar-kadarnya, untuk menguji kamu, siapa di antara kamu yang lebih baik amalnya dengan seikhlas mungkin. Dan dia mahaperkasa tidak ada satu pun yang dapat mengalahkan-Nya, maha pengampun dengan menghapus dosa bagi orang-orang yang bertobat. 3-4. Kuasa Allah menciptakan hidup dan mati dikaitkan dengan kuasa-Nya menciptakan alam raya. Yang menciptakan tujuh langit berlapis-lapis sangat serasi dan harmonis. Tidak akan kamu lihat sesuatu yang tidak seimbang aib atau tidak sempurna, pada ciptaan tuhan yang maha pengasih tuhan yang rahmat-Nya mencakup seluruh wujud, baik pada ciptaan-Nya yang kecil maupun yang besar. Maka lihatlah sekali lagi dan berulang-ulang disertai dengan berpikir yang keras, maka adakah kamu lihat atau menemukan padanya sesuatu yang cacat atau retak' kemudian setelah sekian lama kamu serius memperhatikannya, maka ulangi pandanganmu sekali lagi dan sekali lagi yaitu berkali-kali, niscaya pandanganmu akan kembali kepadamu dalam keadaan kecewa karena tanpa menemukan cacat yang kamu usahakan untuk menemukannya, dan ia, pandanganmu, dalam keadaan letih dan ada batasnya."
  }
]