[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "19-21. Apakah orang-orang kafir itu lalai dan tidak melihat kepada burung-burung yang ada di atas mereka, burung-burung itu membentangkan sayap-sayapnya saat terbang di angkasa dan terkadang merapatkannya? Hanya Allah yang Maha Pengasih yang menahannya ( di udara) sehingga ia tidak jatuh. Sesungguhnya Allah Maha Melihat segala sesuatu, tidak ada kekurangan dan perbedaan pada makhlukNya. Siapakah orang yang menurut klaim kalian (wahai orang-orang kafir) merupakan sekutu kalian yang akan menolong kalian selain Allah manakala Allah menghendaki keburukan atas kalian? Orang-orang kafir dalam klaimnya ini hanya dalam kesesatan dan mereka tertipu oleh setan. Atau siapakah yang memberi rizki untuk kalian manakala Allah menahan rizki itu dan tidak memberikannya kepada kalian? Orang-orang kafir itu justru bersikukuh dalam kesesatan dan pelanggaran, kesombongan dan penentangan, menjauh dari kebenaran, tidak mendengarkannya dan tidak mengikutinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "20. Tidak ada tentara bagi kalian -wahai orang-orang kafir- yang mampu melindungi kalian dari siksa Allah apabila Dia berkehendak untuk menyiksa kalian. Orang-orang kafir itu hanyalah orang-orang yang tertipu, ditipu oleh setan lalu mereka terpedaya olehnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "20. Ayat ini ditujukan kepada orang-orang musyrik dan bertanya kepada mereka tentang siapa yang dapat melindungi mereka dari azab Allah ketika azab itu turun. Dan telah diketahui bahwa tidak ada yang dapat melindungi mereka, akan tetapi orang-orang kafir itu selalu sombong dan merasa berada dalam perlindungan dari azab Allah dan berhala-berhala yang mereka sembah dapat menjaga mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "20. أَمَّنْ هٰذَا الَّذِى هُوَ جُندٌ لَّكُمْ يَنصُرُكُم مِّن دُونِ الرَّحْمٰنِ ۚ (Atau siapakah dia yang menjadi tentara bagimu yang akan menolongmu selain daripada Allah Yang Maha Pemurah?) Yakni tidak ada pasukan yang dapat menghalangi azab Allah dari kalian, bahkan siapakah yang akan menolong kalian jika Allah tidak menolong kalian dengan rahmat dan pertolongan-Nya. إِنِ الْكٰفِرُونَ إِلَّا فِى غُرُورٍ (Orang-orang kafir itu tidak lain hanyalah dalam (keadaan) tertipu) Yakni dalam kesombongan yang dibisikkan oleh setan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20. Siapakah dia yang menjadi tentara bagimu, yang menolongmu dan melindungimu dari dari siksa, selain Dzat yang Maha Pengasih. Tidak ada penolong bagi bagi kalian. Orang-orang Kafir yang menyimpang itu bukanlah apa-apa kecuali berlaku sombong dan tipu daya. Setan memperdaya mereka bahwa azab tidak akan diturunkan kepada mereka. Kata {Amman} asalnya adalah “Am” dan “Man”. “Am” disini bermakna “bal” yang menunjukkan perpindahan dari makna teguran dan intimidasi yang tidak dapat dibayangkan kepada makna teguran dan intimidasi lainnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Atau siapakah} bahkan siapakah ini {yang akan menjadi bala tentara bagi kalian} prajurit bagi kalian {yang dapat menolongmu selain Dzat Yang Maha Pengasih} selain Dzat Yang Maha Pengasih {Orang-orang kafir itu tidak lain hanyalah dalam keadaan tertipu} tipuan dan kesesatan dari setan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "20. Allah berfirman untuk orang-orang yang membangkang dan lari dari perintahNya serta berpaling dari kebenaran, “Atau siapakah dia yang menjadi tentara bagimu yang akan menolongmu selain dari pada Allah Yang Maha Pemurah,” maksudnya, siapakah yang akan menolongmu dan bisa menangkal keburukan darimu jika Allah Yang Maha Pemurah menghendaki keburukan bagimu. Maksudnya, siapa yang bisa menolongmu dari musuh-musuhmu selain Allah Yang Maha Pemurah Hanya allah semata yang memberi pertolongan, yang memberi kejayaan dan kehinaan. Sedangakn lainnya dari kalangan makhluk, andai semuanya bersatu padu untuk menolong seorang hamba, tentu mereka tidak bisa membawa manfaat sedikit pun dari musuh. Terus-menerusnya orang-orang kafir dalam kekufuran padahal mereka telah mengetahui tidak ada yang bisa menolong mereka selain Allah Yang maha Pemurah merupakan kebodohan dan bualan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mulk ayat 20: Kabarkan kepada-Ku wahai orang-orang kafir, apakah kalian memiliki pasukan yang kuat, yang dapat menghalangi kemarahan Ar Rahman ? Atau mampu menjaga adzab Allah atas kalian, jika Allah mengingkan kepada kalian keburukkan ?. Dan tidaklah orang kafir kecuali terputus dari kebaikan, sesat dalam kesesatan yang besar dan bodoh secara sempurna."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala berfirman kepada orang-orang yang sombong, yang lari dari perintah-Nya dan berpaling dari kebenaran. Yang dapat menghindarkan kamu dari azab-Nya, tentu tidak ada. Menurut Syaikh As Sa’diy, maksud ayat ini adalah, siapakah yang menolongmu terhadap musuhmu selain Allah Yang Maha Pengasih? Karena sesungguhnya Allah Ta’ala, Dialah yang menolong, yang memuliakan dan menghinakan, sedangkan selain-Nya adalah makhluk, dimana jika mereka semua berkumpul untuk menolong seorang hamba, maka mereka tidak dapat melakukannya. Oleh karena itu, tetap terusnya orang-orang kafir di atas kekafiran mereka setelah mereka mengetahui bahwa tidak ada yang dapat menolong mereka selain Allah Yang Maha Pengasih merupakan kebodohan dan keadaan yang tertipu. Setan menipu mereka bahwa azab tidak akan turun menimpa mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mulk Ayat 20",
    "description": "Kaum musyrik mekah sering kali mengandalkan kekuatan material atau berhala-berhala yang mereka sembah sebagai pembela mereka. Ayat ini menampik klaim tersebut atau siapakah yang akan kamu andalkan untuk menjadi bala tentara dan pembela bagimu yang dapat membelamu selain Allah yang maha pengasih' orang-orang kafir itu hanyalah dalam keadaan tertipu. 21. Setelah menampik adanya sumber pembelaan selain Allah, kini diteruskan dengan menampik adanya sumber pemberi rezeki. Atau siapakah yang dapat memberimu rezeki secara terus menerus, jika dia yang maha pengasih, menahan rezeki-Nya' pastilah tidak ada. Meskipun bukti sudah sangat jelas, kaum musyrik itu tetap durhaka, bahkan mereka terus-menerus dalam kesombongan dan menjauhkan diri dari kebenaran."
  }
]