[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "19-21. Apakah orang-orang kafir itu lalai dan tidak melihat kepada burung-burung yang ada di atas mereka, burung-burung itu membentangkan sayap-sayapnya saat terbang di angkasa dan terkadang merapatkannya? Hanya Allah yang Maha Pengasih yang menahannya ( di udara) sehingga ia tidak jatuh. Sesungguhnya Allah Maha Melihat segala sesuatu, tidak ada kekurangan dan perbedaan pada makhlukNya. Siapakah orang yang menurut klaim kalian (wahai orang-orang kafir) merupakan sekutu kalian yang akan menolong kalian selain Allah manakala Allah menghendaki keburukan atas kalian? Orang-orang kafir dalam klaimnya ini hanya dalam kesesatan dan mereka tertipu oleh setan. Atau siapakah yang memberi rizki untuk kalian manakala Allah menahan rizki itu dan tidak memberikannya kepada kalian? Orang-orang kafir itu justru bersikukuh dalam kesesatan dan pelanggaran, kesombongan dan penentangan, menjauh dari kebenaran, tidak mendengarkannya dan tidak mengikutinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Dan tidak ada seorangpun yang mampu memberi rezeki kepada kalian jika Allah menahan rezeki-Nya untuk sampai kepada kalian. Tapi nyatanya orang-orang kafir itu terus menerus dalam kedegilan dan kesombongan serta menolak kebenaran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "21. Ayat ini memberi pertanyaan kepada orang-orang musyrik: “Apakah ada seseorang yang dapat memberi kalian rezeki ketika Allah menghalangi rezeki dari kalian?” Dan jawaban pertanyaan ini sangat jelas, tidak ada yang dapat melakukannya; akan tetapi orang-orang kafir itu tidak pernah mengakui hal itu, dan selalu bersikap angkuh dan enggan menerima kebenaran."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "21. أَمَّنْ هٰذَا الَّذِى يَرْزُقُكُمْ إِنْ أَمْسَكَ رِزْقَهُۥ ۚ (Atau siapakah dia yang memberi kamu rezeki jika Allah menahan rezeki-Nya?) Yakni siapakah yang melimpahkan rezeki bagi kalian berupa hujan dan lainnya, jika Allah menahan rezeki itu dari kalian? بَل لَّجُّوا۟ فِى عُتُوٍّ وَنُفُورٍ (Sebenarnya mereka terus menerus dalam kesombongan dan menjauhkan diri?) Mereka"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "21. Siapakah dia yang akan memberi kalian rejeki selain Allah, ketika Dia menghentikan rejekiNya untuk kalian? Namun mereka tetap enggan menerima kebenaran dan malah menjauhinya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Atau siapakah yang dapat memberi kalian rezeki jika Dia menahan rezekiNya. Sebaliknya mereka terus-menerus} berlanjut {dalam kesombongan} keras kepala dan kesombongan dan lari} menjauhkan diri dari kebenaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21. “Atau siapakah dia ini yang memberi kamu rizki jika Allah menahan rizkiNya?” maksudnya, semua rizki berasal dari Allah. Jika Allah menahan rizki dari kalian, siapa gerangan yang bisa memberikannya pada kalian? Manusia tidak mampu memberi rizki pada dirinya sendiri, lantas bagaimana bisa memberikannya pada orang lain? Yang Maha Memberi Rizki dan Memberi Nikmat itulah yang berhak untuk disembah, bukan lainNya. Namun oranng-orang kafir “terus menerus dalam kesombongan,” kekerasan hati, dan tidak tunduk pada kebenaran, “dan menjauhkan diri,” lari dari kebenaran."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mulk ayat 21: Kabarkan kepada-Ku wahai orang-orang kafir, dari yang kalian klaim mampu menghamparkan rizki jika Allah menginginkan menahannya untuk kalian ? Sungguh orang-orang kafir itu keterlaluan dalam berdrbat dan mengusung kebathilan, dalam kesombongan dan melampaui batas, dan dalam menjauhkan (dirinya) dari hidayah. Mereka tidak mengambil pelajaran dari umat-umat yang sebelumnya, mereka juga tidak berpikir akan keselamatan mereka (di akhirat), mereka telah tenggelam dalam kebodohan dan kesombongan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni tidak ada yang dapat memberimu rezeki selain Dia. Hal itu, karena rezeki semuanya berasal dari Allah, jika Dia menahan rezeki-Nya dari kamu, siapakah yang dapat memberimu rezeki selain-Nya? Sedangkan makhluk tidak dapat memberi rezeki terhadap diri mereka, lalu bagaimana mereka memberi rezeki kepada selain mereka. Dengan demikian, Allah Yang memberi rezeki dan nikmat, dimana tidak ada satu pun nikmat yang diperoleh hamba kecuali dari-Nya, maka Dialah yang berhak diibadahi saja. Akan tetapi, orang-orang kafir sebagaimana diterangkan dalam lanjutan ayat di atas tetap berada di atas kesombongan dan menjauhkan diri dari kebenaran."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mulk Ayat 21",
    "description": "Setelah menampik adanya sumber pembelaan selain Allah, kini diteruskan dengan menampik adanya sumber pemberi rezeki. Atau siapakah yang dapat memberimu rezeki secara terus menerus, jika dia yang maha pengasih, menahan rezeki-Nya' pastilah tidak ada. Meskipun bukti sudah sangat jelas, kaum musyrik itu tetap durhaka, bahkan mereka terus-menerus dalam kesombongan dan menjauhkan diri dari kebenaran. 22. Kaum musyrik yang durhaka itu dilukiskan pada ayat ini dan dibandingkan dengan kaum yang selalu taat kepada Allah dengan ungkapan yang tegas. Apakah orang yang merangkak dengan wajah tertelungkup sehingga terjungkal jatuh, yang lebih terpimpin dalam kebenaran ataukah orang yang berjalan tegap di atas jalan yang luas lagi lurus' tentu saja keduanya tidak sama. Hanya orang yang bodoh yang menilainya sama."
  }
]