[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "22. Apakah orang yang berjalan terjungkal-jungkal di atas wajahnya, tidak mengetahui ke mana hendak berjalan dan tidak tidak pula bagaimana dia pergi, lebih kuat istiqamahnya dan lebih mendapatkan hidayah daripada orang yang berjalan lurus, tegak dan selamat di atas jalan yang jelas tidak bengkok? Ini adalah perumpamaan dari Allah bagi orang kafir dan orang Mukmin."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "22. Maka apakah orang yang berjalan dengan wajah terjungkal -yaitu orang musyrik- lebih mendapatkan petunjuk daripada orang mukmin yang berjalan tegak di atas jalan yang lurus?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "22. Dalam ayat ini dijelaskan perbedaan antara orang musyrik yang berjalan tanpa petunjuk dan jatuh tersungkur karena jalannya sangat buruk dan sesat; dengan orang beriman yang berjalan dengan tegap dan dapat melihat jalannya dengan jelas sehingga dia dapat sampai pada tempat tujuannya. Apakah sama antara orang musyrik dengan orang beriman itu?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "22. أَفَمَن يَمْشِى مُكِبًّا عَلَىٰ وَجْهِهِۦٓ أَهْدَىٰٓ (Maka apakah orang yang berjalan terjungkal di atas mukanya itu lebih banyak mendapatkan petunjuk) Yakni orang kafir yang tenggelam dalam kemaksiatan di dunia, yang akan dibangkitkan Allah di hari kiamat dengan tertelungkup di atas mukanya. أَمَّن يَمْشِى سَوِيًّا(ataukah orang yang berjalan tegap) Yakni berjalan tegap memandang ke depan. عَلَىٰ صِرٰطٍ مُّسْتَقِيمٍ (di atas jalan yang lurus?) Di atas jalan yang tidak berkelok. Yakni orang mukmin yang berjalan di atas jalan Allah di dunia dalam hidayah dan petunjuk, sehingga akan dibangkitkan di akhirat dengan berada di jalan yang lurus menuju ke surga."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "22. Perumpamaan orang kafir dan orang mukmin itu seperti orang yang berjalan sambil menundukkan kepalanya ke bawah, tenggelam dalam kegelapan dan kemaksiatan dan itulah orang kafir. Apakah dia orang yang dibimbing menuju jalan (kebenaran)? Atau orang yang berjalan normal dan berdiri tegak menapaki yang lurus itu orang mukmin?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apakah orang yang berjalan dengan menelungkupkan} meletakkan {wajahnya itu lebih mendapatkan petunjuk ataukah orang yang berjalan tegap} biasa {di atas jalan yang lurus} jalan lurus yang tidak ada bengkokan di dalamnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "22. Maksudnya, manakah di antara dua orang itu yang lebih mendapatkan hidayah, orang yang bimbang di dalam kesesatan dan tenggelam dalam kekufuran, hatinya terbalik, hingga yang benar menjadi batil dan yang batil menjadi benar, ataukah orang yang mengetahui, terpengaruh, dan mengamalkan kebenaran,serta berjalan di atas jalan yang lurus dalam perkataan, perbuatan, dan di seluruh hal-ihwalnya? Hanya dengan memperhatikan kondisi kedua orang tersebut saja dapat diketahui perbedaannya; mana yang tersesat dan mana yang mendapat petunjuk. Dan kondisi (tingkah laku) itu memberikan kesaksian lebih besar daripada perkataan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mulk ayat 22: Kemudian Allah memberikan permisalan terhadap orang yang beriman dan yang kufur, yang di atas kebenaran yang berbuat keburukan. Allah berkata : Bukankah seseorang yang berjalan mundur akan menjadi orang yang tenggelam ke dalam gelapnya kebodohan dan ketidakjelasan, maka alangkah baiknya dan utamanya bagi siapa yang berjalan, berjalan mengikuti wahyu di atas shiratal mustaqim yang jelas, yang tiada kebengkokan padanya ?!. Berkata Qatadah : Orang yang kafir adalah orang yang paling menyimpang di atas kemaksiatannya di dunia, dan Allah bangkitkan (di akhirat) menuju ke neraka, dan orang yang beriman yang kokoh di atas perintah Allah di dunia, akan dibangkitkan menuju ke surga."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ini adalah perumpamaan untuk orang-orang yang kafir. Ini adalah perumpamaan untuk orang-orang mukmin. Maksud ayat ini adalah siapakah di antara kedua orang ini yang lebih mendapatkan petunjuk? Apakah orang yang berada dalam kesesatan, tenggelam dalam kekafiran, terbalik hatinya sehingga kebenaran menurutnya batil dan kebatilan menurutnya benar ataukah orang yang mengetahui kebenaran, mengutamakannya, mengamalkannya, berjalan di atas jalan yang lurus dalam ucapan, perbuatan dan dalam semua keadaannya? Dengan memperhatikan dua orang ini sudah dapat diketahui perbedaan di antara keduanya, siapakah yang mendapat petunjuk dan siapakah yang sesat? Sesungguhnya keadaan merupakan saksi terbesar daripada perkataan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mulk Ayat 22",
    "description": "Kaum musyrik yang durhaka itu dilukiskan pada ayat ini dan dibandingkan dengan kaum yang selalu taat kepada Allah dengan ungkapan yang tegas. Apakah orang yang merangkak dengan wajah tertelungkup sehingga terjungkal jatuh, yang lebih terpimpin dalam kebenaran ataukah orang yang berjalan tegap di atas jalan yang luas lagi lurus' tentu saja keduanya tidak sama. Hanya orang yang bodoh yang menilainya sama. 23. Kaum musyrik yang telah diberikan aneka potensi yang semestinya dapat digunakan untuk meraih petunjuk ternyata justru mengabaikannya. Ayat ini memerintahkan kepada nabi Muhammad dan seluruh manusia untuk menyadari potensi itu. Katakanlah, 'dialah yang menciptakan kamu tahap demi tahap dan menjadikan pendengaran, penglihatan dan hati nurani bagi kamu agar kamu menggunakannya secara baik sebagai tanda syukur kepada-Nya. Tetapi sedikit sekali kamu bersyukur. '."
  }
]