[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "23-24. Katakanlah kepada mereka (wahai Rasul) “Allah-lah Yang menciptakan kalian dari ketiadaan, Allah membuatkan untuk kalian pendengaran agar kalian bisa mendengar, penglihatan agar kalian bisa melihat, hati agar kalian bisa memikirkan. Hanya sedikit dari kalian (wahai orang-orang kafir) yang mensyukuri nikmat-nikmat ini kepada Tuhan kalian yang memberikannya kepada kalian.” Katakanlah kepada mereka, “Allah yang menciptakan kalian dan menyebarkan kalian di muka bumi. Hanya kepada Allah semata kalian dikumpulkan sesudah penyebaran ini untuk perhitungan amal dan pembalasan.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "23. Katakanlah -wahai Rasul- kepada orang-orang musyrik yang mendustakan, “Allah-lah yang menciptakan kalian dan menciptakan untuk kalian pendengaran yang kalian pakai untuk mendengarkan, penglihatan yang kalian pakai untuk melihat dan hati yang kalian pakai untuk memikirkan. Sangat sedikit kalian mensyukuri nikmat yang telah diberikan-Nya pada kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "23. Ini merupakan perintah untuk menyampaikan kepada seluruh makhluk bahwa Allah-lah yang telah menciptakan mereka semua dan menyempurnakan penciptaannya dengan menjadikan mereka dapat mendengar, melihat, dan berfikir; oleh sebab itu Allah berhak untuk disembah, ditaati, dan disyukuri segala nikmat-nikmat-Nya yang agung. Akan tetapi sedikit sekali dari hamba-hamba-Nya yang mengetahui nilai dari kenikmatan-kenikmatan itu, menjaganya, dan mensyukurinya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "23. Katakanlah wahai Nabi SAW kepada semua orang yang mengingkari Allah: “Allah adalah Dzat yang menciptakan kalian, Dzat yang membuatkan kalian pendengaran sehingga kalian dapat menggunakannya untuk mendengar, Dzat yang membuatkan kalian pennglihatan sehingga kalian dapat menggunakannya untuk melihat, dan menciptakan hati yang kalian gunakan untuk berpikir dan menalar. Lalu kalian tidak bersyukur kepada Tuhan kalian atas nikmat ini kecuali hanya sedikit.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Katakanlah,“Dialah Dzat yang menciptakan kalian} menciptakan kalian {dan menjadikan bagi kalian pendengaran, penglihatan, dan hati nurani} hati {sedikit sekali kalian bersyukur.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "23. Allah berfirman mengingatkan bahwa Dia sematalah yang berhak disembah dan Dia menyeru hamba-hambaNya untuk mensyukuriNya dan mengesakanNya dalam ibadah. “Dia-lah yang menciptakan kamu,” maksudnya, menciptakan kalian dari ketiadaan, dan tidak ada yang membantu dan menolongNya. Ketika Allah menciptakan kalian, Allah menyempurnakan wujud kalian kalian dengan pendengaran, penglihatan, dan pikiran. Ketiga hal inilah anggota badan terbaik dan kekuatan jasmani yang paling sempurna. Tapi, meski kalian mendapatkan nikmat seperti ini “amat sedikit kamu bersyukur,” terhadap Allah. Amat sedikit yang bersyukur dan amat sedikit rasa syukur dari kalian."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mulk ayat 23: 23-24. Katakanlah wahai Nabi Allah kepada mereka orang-orang musyrik : Ketahuilah oleh kalian bahwa Allah, Dialah yang menjadikan diri-diri kalian dari yang tidak wujud sebelumnya, Allah jadikan kalian sempuran secara jasad dan akal, Allah jadikan kalian memiliki pendengaran untuk mendengar-Nya, dan mata agar kalian melihat dengan keduanya, dan hati untuk merenung dengannya. Akan tetapi kalian sangat sedikit yang bersyukur kepada Allah, yang Ia berikan nikmat ini kepada kalian. Kemudian katakan juga kepada mereka orang-orang musyrik wahai Nabi Allah : Sesungguhnya Allahlah yang menciptakan kalian, yang menempatkan dan menyebarkan kalian di bumi, dan Ia akan mengembalikanmu sekali lagi di hari kebangkitan; Untuk menghisab kalian atas amalan-amalan kalian dan membalas kalian atas amalan tersebut."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala berfirman menerangkan bahwa Dia yang berhak disembah satu-satunya dan mengajak hamba-hamba-Nya untuk bersyukur kepada-Nya serta mengesakan-Nya dalam ibadah. Yakni Dialah yang mengadakan kamu dari yang sebelumnya tidak ada tanpa ada yang membantu-Nya. Ketika Dia menciptakan kamu, maka Dia sempurnakan wujudmu dengan pendengaran, penglihatan dan hati, dimana anggota badan tersebut adalah anggota yang paling bermanfaat. Akan tetapi, setelah diberikan nikmat yang besar itu, sedikit sekali di antara manusia yang bersyukur."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mulk Ayat 23",
    "description": "Kaum musyrik yang telah diberikan aneka potensi yang semestinya dapat digunakan untuk meraih petunjuk ternyata justru mengabaikannya. Ayat ini memerintahkan kepada nabi Muhammad dan seluruh manusia untuk menyadari potensi itu. Katakanlah, 'dialah yang menciptakan kamu tahap demi tahap dan menjadikan pendengaran, penglihatan dan hati nurani bagi kamu agar kamu menggunakannya secara baik sebagai tanda syukur kepada-Nya. Tetapi sedikit sekali kamu bersyukur. '24. Manusia diingatkan melalui ayat ini bahwa pada akhirnya semua akan kembali kepada-Nya, maka tidak sewajarnya menyombongkan diri dan mendurhakai perintah-Nya. Katakanlah, 'dialah yang menjadikan kamu berkembang biak di muka bumi, dan hanya kepada-Nya kamu akan dikumpulkan di mahsyar untuk mempertanggungjawabkan semua perbuatan kamu ketika di dunia dan akan memberikan balasan sesuai dengan amal kamu. '."
  }
]