[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "23-24. Katakanlah kepada mereka (wahai Rasul) “Allah-lah Yang menciptakan kalian dari ketiadaan, Allah membuatkan untuk kalian pendengaran agar kalian bisa mendengar, penglihatan agar kalian bisa melihat, hati agar kalian bisa memikirkan. Hanya sedikit dari kalian (wahai orang-orang kafir) yang mensyukuri nikmat-nikmat ini kepada Tuhan kalian yang memberikannya kepada kalian.” Katakanlah kepada mereka, “Allah yang menciptakan kalian dan menyebarkan kalian di muka bumi. Hanya kepada Allah semata kalian dikumpulkan sesudah penyebaran ini untuk perhitungan amal dan pembalasan.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. Katakanlah -wahai Rasul- kepada orang-orang musyrik yang mendustakan, “Allah-lah yang menyebarkan kalian di muka bumi, bukan berhala-berhala kalian yang tidak mampu menciptakan apa pun. Dan hanya kepada-Nya saja kalian dikumpulkan pada hari Kiamat untuk perhitungan dan pembalasan, bukan kepada berhala-berhala kalian. Maka takutlah kepada-Nya dan sembahlah Dia semata."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "24. Dan Allah-lah yang menyebarkan makhluk di muka bumi ke segala penjurunya, agar mereka memakmurkan bumi dengan kehidupan. Dan seluruh makhluk itu hanya akan kembali kepada Allah pada hari kiamat, dengan membangkitkan, memberi perhitungan, dan balasan atas mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "24. قُلْ هُوَ الَّذِى ذَرَأَكُمْ فِى الْأَرْضِ (Katakanlah: “Dialah Yang menjadikan kamu berkembang biak di muka bumi) Yakni Allah menciptakan di dunia dan menyebarkan mereka ke berbagai penjuru bumi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "24. Katakanlah wahai Rasulallah: “Allah adalah Dzat yang menciptakan kalian dan menjadikan kalian berkembang biak di bumi. KepadaNyalah kalian dikumpulkan setelah dibangkitkan dari kubur untuk dihisab.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Katakanlah,“Dialah yang menjadikan kamu berkembang biak} membuat kalian berkembang biak dan menyebar {di muka bumi dan kepadaNyalah kalian akan dikumpulkan.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "24. “Katakanlah, ‘Dia-lah yang menjadikan kamu berkembang biak di muka bumi’,” maksudnya, menyebarkan kalian di berbagai penjuru bumi dan menempatkan kalian di berbagai penjuru bumi dan menempatkan kalian di berbagai penjuru. Allah memerintah dan melarang kalian serta mengaruniai kalian nikmat yang berguna bagi kalian. Kemudian setelah itu Allah akan mengumpulkan kalian pada Hari Kiamat. Namun ancaman pemberian balasan ini diingkari oleh mereka yang membangkang."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mulk ayat 24: 23-24. Katakanlah wahai Nabi Allah kepada mereka orang-orang musyrik : Ketahuilah oleh kalian bahwa Allah, Dialah yang menjadikan diri-diri kalian dari yang tidak wujud sebelumnya, Allah jadikan kalian sempuran secara jasad dan akal, Allah jadikan kalian memiliki pendengaran untuk mendengar-Nya, dan mata agar kalian melihat dengan keduanya, dan hati untuk merenung dengannya. Akan tetapi kalian sangat sedikit yang bersyukur kepada Allah, yang Ia berikan nikmat ini kepada kalian. Kemudian katakan juga kepada mereka orang-orang musyrik wahai Nabi Allah : Sesungguhnya Allahlah yang menciptakan kalian, yang menempatkan dan menyebarkan kalian di bumi, dan Ia akan mengembalikanmu sekali lagi di hari kebangkitan; Untuk menghisab kalian atas amalan-amalan kalian dan membalas kalian atas amalan tersebut."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni Dialah yang menyebarkan kamu di muka bumi dan menempatkan kamu di berbagai penjurunya, Dia memerintahkan dan melarang serta melimpahkan berbagai nikmat yang dengannya kamu dapat mengambil manfaat. Setelah itu, Dia mengumpulkan kamu pada hari Kiamat untuk memberimu balasan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mulk Ayat 24",
    "description": "Manusia diingatkan melalui ayat ini bahwa pada akhirnya semua akan kembali kepada-Nya, maka tidak sewajarnya menyombongkan diri dan mendurhakai perintah-Nya. Katakanlah, 'dialah yang menjadikan kamu berkembang biak di muka bumi, dan hanya kepada-Nya kamu akan dikumpulkan di mahsyar untuk mempertanggungjawabkan semua perbuatan kamu ketika di dunia dan akan memberikan balasan sesuai dengan amal kamu. '25. Penegasan Allah bahwa semua manusia akan dibangkitkan dan dikumpulkan seperti ditegaskan pada ayat di atas, direspons oleh kaum musyrik, seperti yang terekam dalam ayat ini. Dan kaum musyrik itu berkata sambil berolok-olok, 'kapan datangnya janji ancaman tentang hari kebangkitan itu jika kamu, wahai nabi Muhammad, adalah orang yang benar'' tentu kamu mengetahui dan dapat memberitahukan kepada kami. \"."
  }
]