[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "25-26. orang-orang kafir berkata, “Kapan janji kebangkitan ini terlaksana, wahai Muhammad? Katakanlah waktunya kepada kami, wahai orang-orang beriman, bila kalian adalah orang-orang yang benar dalam apa yang kalian klaim.” Katakanlah kepada mereka (wahai Rasul) “Sesungguhnya ilmu tentang kapan waktu Hari Kiamat merupakan kekhususan Allah, karena aku hanyalah pemberi peringatan kepada kalian yang memperingatkan akibat dari kekafiran kalian dan menjelaskan kepada kalian apa yang Allah perintahkan kepadaku agar menjelaskannya sejelas-jelasnya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "26. Katakanlah -wahai Rasul-, \"Sesungguhnya pengetahuan tentang Kiamat itu hanya ada pada Allah, tidak ada yang mengetahui kapan terjadinya selain Allah, dan sesungguhnya aku hanyalah memberi peringatan kepada kalian, jelas dan nyata peringatanku.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "26. Datanglah jawaban atas pertanyaan mereka dengan perintah Allah kepada Nabi untuk berkata kepada mereka: “Ilmu tentang hari kebangkitan dan pembalasan hanya Allah yang mengetahuinya, dan tugasku hanya menyampaikan kepada kalian bahwa itu pasti akan terjadi, serta menjelaskan dan menyeru kalian kepada kebenaran.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "26. قُلْ إِنَّمَا الْعِلْمُ عِندَ اللَّـهِ (Katakanlah: “Sesungguhnya ilmu (tentang hari kiamat itu) hanya pada sisi Allah) Yakni waktu terjadinya hari kiamat tidak diketahui kecuali Allah. وَإِنَّمَآ أَنَا۠ نَذِيرٌ مُّبِينٌ(Dan sesungguhnya aku hanyalah seorang pemberi peringatan yang menjelaskan”) Yakni aku peringatkan kalian dari akibat buruk kekafiran kalian, dan aku jelaskan bagi kalian apa yang Allah perintahkan untuk aku jelaskan, dan Allah tidak memerintahkanku untuk memberitahukan kalian kapan terjadi hari kiamat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "26. Katakanlah wahai Rasulallah: “Sesungguhnya pengetahuan tentang terjadinya kiamat itu hanya di sisi Allah. Aku hanya pemberi peringatan yang menjelaskan akhirnya”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Sesungguhnya pengetahuan tentang itu hanya ada pada Allah. Aku hanyalah seorang pemberi peringatan yang jelas.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "26. “Sesungguhnya ilmu (tentang Hari Kiamat itu) hanya pada sisi Allah,” tidak diketahui oleh seorang pun dan tidak ada korelasi antara berita ini dan berita kapan kejadiannya, sebab kebenaran bisa diketahui dengan bukti-buktinya. Allah telah menegakkan berbagai dalil dan bukti nyata atas kebenarannya yang tidak menyisakan keraguan sedikit pun bagi mereka yang mau mendengarkan dan menyaksikannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mulk ayat 26: 25-26. Allah mengabarkan bahwa orang-orang kafir mengatakan dengan nada mengejek dan mengingkari : Kapan balasan ini dan ancaman dengan kebangkitan ini bena-benar terjadi ? Coba engkau kabarkan (ancaman-ancaman) itu kepada kami jika engkau adalah orang yang jujur. Katakan wahai Rasulullah kepada mereka : Sesungguhnya pengetahuan akan waktu tegaknya hari kiamat telah ditentukan oleh Allah saja, dan tidaklah Allah membebani (manusia) dalam penjelasannya, yang terpenting adalah aku telah memberi peringatan, mengancam dan menjelaskan atas apa yang akan kalian lihat nanti dari adzab Allah jika dari kalian masih tetap dalam kekufuran."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mulk Ayat 26",
    "description": "Menanggapi ucapan kaum musyrik tersebut nabi Muhammad diperintahkan Allah seperti yang ditegaskan pada ayat ini: katakanlah wahai nabi Muhammad, 'sesungguhnya ilmu tentang hari kiamat itu hanya ada pada Allah. Dan aku hanyalah seorang pemberi peringatan yang menjelaskan. '27. Keadaan kaum musyrik yang mengolok kedatangan kiamat dan mendurhakai Allah digambarkan dalam ayat ini. Maka ketika mereka melihat azab yang mereka dustakan itu sudah dekat kehadirannya yaitu pada hari kiamat, wajah orang-orang kafir itu menjadi muram. Dan dikatakan kepada mereka, 'inilah azab yang dahulunya selalu kamu minta untuk disegerakan. '"
  }
]