[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "27. Maka ketika orang-orang kafir melihat azab Allah sudah dekat kepada mereka dan menyaksikannya secara langsung, tampaklah kehinaan dan kemurungan pada wajah mereka. Kepada mereka dikatakan sebagai celaan, “Inilah yang kalian minta agar disegerakan di dunia.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "27. Ketika janji itu datang dan mereka melihat siksa sangat dekat pada hari Kiamat, maka wajah-wajah orang yang kafir kepada Allah berubah dan menjadi hitam, dan dikatakan kepada mereka, “Inilah yang pernah kalian tantang di dunia dan minta disegerakan.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "27. Pada hari pembalasan yang pasti akan datang itu -dan segala yang akan datang itu dekat kedatangannya- wajah orang-orang kafir akan menghitam dan tampak kehinaan padanya. Para malaikat akan berkata kepada mereka: “Ini adalah hari yang kalian ingkari, dan kalian inginkan agar segera terjadi sebagai bentuk hinaan dan kedustaan kalian terhadapnya. Dan sekarang ini telah terjadi”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "27. فَلَمَّا رَأَوْهُ زُلْفَةً (Ketika mereka melihat azab (pada hari kiamat) sudah dekat) Yakni ketika mereka melihat azat itu telah dekat. سِيٓـَٔتْ وُجُوهُ الَّذِينَ كَفَرُوا۟( muka orang-orang kafir itu menjadi muram) Yakni wajah mereka muram dan diliputi kegundahan dan kehinaan. وَقِيلَ هٰذَا الَّذِى كُنتُم بِهِۦ تَدَّعُونَ(Dan dikatakan (kepada mereka) inilah (azab) yang dahulunya kamu selalu meminta-mintanya) Yakni yang dulu kalian minta di dunia untuk disegerakan, sebagai cara kalian untuk memperolok-olok."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "27. Tatkala mereka mengetahui bahwa azab yang dijanjikan telah mendekat, wajah-wajah mereka tertutup oleh sesuatu yang membuatnya menjadi buruk, kemudian wajah mereka menghitam dan bersedih. Dengan nada mencemooh, malaikat penjaga (neraka) berkata kepada mereka: “Inilah azab yang kalian cari (dari Muhammad) dengan cara mengolok-olok dan mengingkari(nya)”. (Azab itu) digambarkan melalui fiil madhi (Raa’a) daripada fiil mustaqbal untuk menunjukkan bahwa azab itu benar-benar terjadi. Zulfah adalah mashdar dan maknanya adalah dekat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika mereka melihat azab itu sudah dekat} mereka melihat azab itu sangat dekat dengan mereka {wajah orang-orang kafir itu menjadi muram} memghitam {Dikatakan,“Ini adalah yang dahulu selalu kalian minta} kalian minta untuk dipercepat ketika di dunia"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "27. Maksudnya, kedustaan orang-orang kafir dan tipuan mereka berlaku di dunia, dan ketika Hari Pembalasan tiba, tatkala mereka melihat azab “sudah dekat,” siksaan itu membuat muka orang-orang kafir itu menjadi muram, membuat mereka takut dan menggelisahkan mereka. Karena itu wajah mereka berubah dan mereka pun dihina serta dicela atas kedustaan mereka. Dan dikatakan kepada mereka “Inilah (azab) yang dahulunya kamu selalu meminta-mintanya.” Pada hari ini kalian melihat sendiri azab ini dengan mata kepala kalian. Siksaan telah terlihat jelas bagi kalian. Semua sebab telah terputus dari kalian dan yang tersisa dari kalian hanyalah merasakan azab."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mulk ayat 27: Maka ketika orang-orang kafir melihat janji yang mereka minta dari-Nya, yaitu adzab Allah yang dekat untuk mereka; Nampaklah kehinaan dan ketakutan atas wajah-wajah mereka. Kemudian dikatakan kepada mereka dengan nada penghinaan dan celaan : Inilah janji dimana kalian (ketika di dunia) mengingkarinya dan mengacuhkannya, dan kalian terlalu Teresa-gesa di dunia sebab keras kepalanya kalian dan sombong serta menantang, bahkan kalian mengolok-olok dengan apa yang diperingatkan atas kalian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni mereka menjadi sedih, takut, guncang hatinya sehingga muka mereka pun berubah menjadi muram."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mulk Ayat 27",
    "description": "Keadaan kaum musyrik yang mengolok kedatangan kiamat dan mendurhakai Allah digambarkan dalam ayat ini. Maka ketika mereka melihat azab yang mereka dustakan itu sudah dekat kehadirannya yaitu pada hari kiamat, wajah orang-orang kafir itu menjadi muram. Dan dikatakan kepada mereka, 'inilah azab yang dahulunya selalu kamu minta untuk disegerakan. ' 28. Kaum musyrik karena kebenciannya kepada nabi Muhammad sering mengharapkan agar nabi Muhammad cepat mati. Katakanlah wahai nabi Muhammad, 'tahukah kamu jika Allah mematikan aku dan orang-orang yang bersamaku yaitu yang sama dalam keimanan sebagaimana yang kamu harapkan maka kami akan masuk surga, atau memberi rahmat kepada kami dengan memanjangkan usia kami sehingga menganugerahkan kemenangan kepada kami. Sedangkan kamu, wahai kaum musyrik, akan mendapat siksa, lalu siapa yang dapat melindungi kamu dan orang-orang kafir selain kamu dari azab yang pedih''."
  }
]