[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "28. Katakanlah (wahai Rasul) kepada orang-orang kafir, “Katakanlah kepadaku bila Allah mematikanku dan orang-orang beriman bersamaku sebagaimana yang kalian inginkan, atau Allah merahmati kami dengan menunda ajal kami dan memaafkan kami sehingga tidak mengazab kami. Lalu siapa yang melindungi dan menjaga kalian dari azab pedih yang menyakitkan?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "28. Katakanlah -wahai Rasul- kepada orang-orang musyrik yang mendustakan, untuk mengingkari mereka, “Kabarkan kepadaku apabila Allah telah mewafatkanku dan mewafatkan orang-orang beriman yang bersamaku, maka siapa yang menyelamatkan orang-orang kafir dari siksa Allah yang menyakitkan?” Sama sekali tidak ada seorang pun yang menyelamatkan mereka dari azab."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "28. Hai Nabi yang mulia, katakanlah kepada orang-orang musyrik yang mengharapkan kematianmu dan kematian orang-orang beriman yang bersamamu: “Sampaikanlah kepadaku, jika aku dan para pengikutku meninggal, atau aku tetap hidup berkat rahmat dan karunia Allah; apakah ada yang dapat melindungi kalian dari azab Allah ketika menimpa kalian?” Ungkapan ini merupakan hujjah atas orang-orang musyrik dengan menggunakan cara yang sangat kuat dan jelas; sebab azab mereka pasti akan datang, dan kedatangannya tidak terikat dengan keberadaan Nabi dan para pengikutnya atau kematian mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "28. قُلْ أَرَءَيْتُمْ إِنْ أَهْلَكَنِىَ اللَّـهُ(Katakanlah: “Terangkanlah kepadaku jika Allah mematikan aku) Dengan mati atau terbunuh sebagaimana yang kalian harapkan bagiku, dan yang selalu kalian tunggu. وَمَن مَّعِىَ(dan orang-orang yang bersamaku) Yaitu orang-orang beriman. أَوْ رَحِمَنَا(atau memberi rahmat kepada kami) Dengan mengakhirkan kematianku sampai batas waktu tertentu. Seandainya itu terjadi terhadap kami: فَمَن يُجِيرُ الْكٰفِرِينَ مِنْ عَذَابٍ أَلِيمٍ(maka siapakah yang dapat melindungi orang-orang yang kafir dari siksa yang pedih?”) Tidak ada yang mampu menyelamatkan mereka dari siksa itu, baik itu Allah membinasakan Rasulullah dan orang-orang beriman seperti yang mereka inginkan atau Allah mengakhirkan kebinasaan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "28. Katakanlah wahai Rasulallah: “Jelaskanlah kepadaku jika Allah mematikanku dan orang-orang mukmin yang bersamaku atau Allah memberi rahmat kepada kami dengan mengakhiri ajal kami, lalu siapa yang akan menolong orang-orang kafir dari azab yang sangat pedih?” Tidak ada satupun yang menolong mereka. Diriwayatkan bahwa kaum kafir Mekah menyeru untuk menghancurkan Rasulallah SAW dan orang-orang mukmin, kemudian turunlah ayat ini."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Katakanlah,“Apakah kalian mengetahui jika Allah mematikan aku} mematikan aku {dan orang-orang yang bersamaku atau memberi rahmat kepada kami lalu siapa yang dapat melindungi} menyelamatkan {orang-orang kafir dari azab yang pedih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "28. Karena orang-orang yang mendustakan Rasulullah, yang menolak seruannya itu menanti kematiannya seraya ragu, maka Allah memerintahkan Rasulullah untuk berkata pada mereka, “Jika kalian mendapatkan apa yang kalian inginkan, “dan Allah mematikan aku dan orang-orang yang bersama denganku,” hal itu tidak berguna sama sekali bagi kalian, karena kalian mengingkari tanda-tanda kebesaran Allah dan kalian pun berhak mendapatkan siksaan, lantas siapakah yang akan melindungi kalian “dari siksa yang pedih,” yang pasti terjadi pada kalian? Karena itu, usaha susah payah kalian dan keinginan keras kalian agar aku mati itu sama sekali tidak berguna bagi kalian."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mulk ayat 28: Katakanlah wahai Nabi Allah pada orang-orang kafir : Kabarkan kepadaku, karena memang Allahlah yang mematikanku dan di sisiku terdapat keimanan atau kasih sayang dengan karunia dan kebaikan dari-Nya dan Allah yang mengampuni kami dan memberi rizki kepada kami, serta menolong kami dari adzab-Nya; Lantas, siapa yang mampu melindungi kalian dan menahan kalian dari adzab Allah yang pedih dan menyakitkan, jika Ia ingin menurunkan kepada kalian ?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Oleh karena orang-orang yang mendustakan Rasulullah shallallahu 'alaihi wa sallam yang menolak dakwah Beliau menunggu-nunggu kebinasaan Beliau, maka Allah Subhaanahu wa Ta'aala memerintahkan Beliau untuk mengatakan kepada mereka yang maknanya, “Kamu wahai orang-orang musyrik! Meskipun angan-angan kamu tercapai, yaitu Allah membinasakan aku dan orang-orang yang bersamaku, namun hal itu tidaklah bermanfaat bagimu sedikit pun juga karena kamu telah kafir kepada ayat-ayat Allah dan berhak mendapatkan azab, padahal siapakah yang dapat melindungi kamu dari azab yang pedih yang mesti menimpamu? Dengan demikian, usaha keras kamu untuk membinasakan aku tidaklah berfaedah apa-apa. Dengan azab-Nya sebagaimana yang kamu maksudkan. Dan tidak mengazab kami."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mulk Ayat 28",
    "description": "Kaum musyrik karena kebenciannya kepada nabi Muhammad sering mengharapkan agar nabi Muhammad cepat mati. Katakanlah wahai nabi Muhammad, 'tahukah kamu jika Allah mematikan aku dan orang-orang yang bersamaku yaitu yang sama dalam keimanan sebagaimana yang kamu harapkan maka kami akan masuk surga, atau memberi rahmat kepada kami dengan memanjangkan usia kami sehingga menganugerahkan kemenangan kepada kami. Sedangkan kamu, wahai kaum musyrik, akan mendapat siksa, lalu siapa yang dapat melindungi kamu dan orang-orang kafir selain kamu dari azab yang pedih''29. Kaum musyrik itu tidak berkutik dengan pertanyaan itu. Katakanlah, wahai nabi, 'dialah saja bukan selain-Nya, yang maha pengasih, kami beriman kepada-Nya dan hanya kepada-Nya kami bertawakal dengan sepenuh hati. Maka kelak kamu akan tahu siapa yang berada dalam kesesatan yang nyata apakah golongan kami atau kamu. '."
  }
]