[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "29. Katakanlah, “Allah adalah yang Maha Pengasih, kami beriman kepadaNya, mengamalkan syariatNya, kami menaatiNya, hanya kepadaNya kami bersandar dalam segala urusan kami. Kalian, wahai orang-orang kafir, akan tahu manakala azab turun, siapa di antara kita, kami atau kalian yang jauh dari jalan Allah yang lurus?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "29. Katakanlah -wahai Rasul- kepada orang-orang musyrik, “Dia lah Yang Maha Pengasih yang menyeru kalian untuk menyembah-Nya semata, kami beriman kepada-Nya dan hanya kepada-Nya-lah kami menyandarkan urusan kami, maka kalian akan mengetahui -tanpa ada keraguan- siapa yang berada di dalam kesesatan yang nyata dari kebenaran dan siapa yang berada di jalan yang lurus.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "29. Hai Nabi yang mulia, katakanlah kepada orang-orang musyrik: “Kami benar-benar beriman kepada Tuhan kami Yang Maha Pengasih; dan kami benar-benar meyakini kekuasaan dan keagungan-Nya, sehingga kami hanya bertawakkal kepada-Nya, dan hanya memohon pertolongan dari-Nya; sedangkan kalian mengingkari-Nya. dan pada hari kiamat -ketika Allah menghisab seluruh makhluk- akan terlihat golongan yang merugi dan tenggelam dalam kesesatan.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "29. Katakanlah (Muhammad): “Dialah Allah yang Maha Pengasih. Kami membenarkanNya sebagai Tuhan yang Esa. Kami tidak akan menyekutukanNya. Hanya kepadanya (bukan selainNya) kami bersandar dan menyerahkan urusan-urusan kami. Kalian akan mengetahui wahai kaum musyrik, siapa yang jauh dari kebenaran, apakah kami atau kalian?”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Dialah Dzat Yang Maha Pengasih, kami beriman kepadaNya dan hanya kepadaNya kami bertawakal. Kelak kalian akan mengetahui siapa yang berada dalam kesesatan yang nyata.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "29. Di antara perkataan mereka menyatakan, bahwa mereka berada di atas petunjuk sedangkan Rasulullah berada di atas kesesatan. Mereka mengulang-ulang hal itu dan senantiasa seperti itu. Mereka pun berdebat dan berperang karena hal itu. Kemudian Allah memerintahkan NabiNya untuk memberitahukan tentang kondisinya dan kondisi para pengikutnya, dengan pemberitahuan itu, masing-masing orang akn terlihat jelas petunjuknya, yaitu mereka mengatakan, “Kami beriman kepadaNya dan kepadaNya-lah kami bertawakal.” Iman mencakup pembenaran batin dan amalan lahir batin. Mengingat kualitas dan kesempurnaan amalan tergantung pada tawakal, maka Allah mengistimewakan tawakal di antara berbagai amalan. Jika pun tidak demikian, tawakal tetap termasuk dalam keimanan dan termasuk salah satu konsekuensinya. Karena seperti inilah kondisi Rasulullah dan orang yang bersamanya, kondisi yang mengharuskan mereka mendapatkan keberuntungan dan kebahagiaan. Sedangkan kondisi para musuh Rasulullah adalah sebaliknya. Mereka tidak memiliki keimanan dan tawakal. Dengan demikian dapat diketahui siapa yang berada di atas petunjuk dan siapa yang berada di atas kesesatan yang nyata."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mulk ayat 29: Katakanlah wahai Nabi Allah kepada mereka yang menolak (seruanmu) : Sungguh aku berbicara kebenaran atas Ar Rahman, yang aku menyeru kalian untuk beribadah dan kepada-Nya dan berserah diri dari hukuman-Nya, serta beramal dengan syariat-Nya, mentaati-Nya, dan hanya kepada-Nya saja kami bergantung dan bertawakkal atas segala urusan kami; Dan jika kalian tidak menjawab seruanku dan beriman kepada-Nya, maka kalian akan segera mengetahui jika diturunkannya adzab Allah, bagi siapa yang meniti jalan kebenaran dan jalan yang lurus ? Kami atau kalian ?. Inilah ancaman atas setiap siapa yang kufur dan menyekutukan Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Oleh karena orang-orang kafir mengatakan bahwa mereka berada di atas petunjuk, sedangkan Rasulullah shallallahu 'alaihi wa sallam berada di atas kesesatan, maka Allah Subhaanahu wa Ta'aala memerintahkan Rasul-Nya shallallahu 'alaihi wa sallam untuk memberitahukan kepada orang-orang kafir keadaan Beliau dan para pengikutnya dimana dengannya semakin jelas bahwa mereka berada di atas petunjuk dan ketakwaan kepada Allah Subhaanahu wa Ta'aala. Beriman mencakup pembenaran di batin (dalam) serta amal dari batin dan zahir (luar). Oleh karena amal untuk terwujudnya dan sempurnanya tergantung tawakkal, maka Allah Subhaanahu wa Ta'aala mengkhususkan tawakkal di antara sekian amal, bahkan ia masuk bagian keimanan dan termasuk lawazim(bagian)nya sebagaimana firman Allah Ta’ala, “Wa ‘alalllahi fa tawakkaluu in kuntum mu’miniin.” (artinya: Maka kepada Allah hendaknya kamu bertawakkal jika kamu orang-orang yang beriman). Jika demikian keadaan Rasul dan orang-orang yang mengikutinya, yakni beriman dan bertawakkal yang merupakan penentu keberuntungan dan kebahagiaan, sedangkan keadaan musuh-musuh Beliau adalah tidak beriman dan tidak bertawakkal, maka dapat diketahui siapa di antara dua golongan ini yang berada di atas petunjuk dan siapa yang berada di atas kesesatan yang nyata. Ketika melihat azab."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mulk Ayat 29",
    "description": "Kaum musyrik itu tidak berkutik dengan pertanyaan itu. Katakanlah, wahai nabi, 'dialah saja bukan selain-Nya, yang maha pengasih, kami beriman kepada-Nya dan hanya kepada-Nya kami bertawakal dengan sepenuh hati. Maka kelak kamu akan tahu siapa yang berada dalam kesesatan yang nyata apakah golongan kami atau kamu. '30. Sebagai penutup surah ini, Allah memerintahkan kepada nabi Muhammad agar mengingat aneka nikmat Allah, terutama nikmat air yang merupakan sumber utama kehidupan (lihat surah al-anbiy'/21:30). Katakanlah wahai nabi Muhammad, 'terangkanlah kepadaku jika sumber air kamu dan sumber air lainnya menjadi kering. Maka siapa yang akan memberimu air yang mengalir''. Pasti tidak ada kecuali Allah, tuhan pemelihara seluruh alam. Maka sudah sewajarnya kalau manusia hanya menyembah kepada-Nya."
  }
]