[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "3. Allah Yang menciptakan tujuh langit yang rapi, sebagian darinya di atas sebagian yang lain. Kamu (wahai orang yang melihat) tidak melihat adanya perbedaan dan pertentangan pada ciptaan ar-Rahman itu. Lihatlah ulang ke langit, apakah di sana ada celah atau pecah?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Dia yang menciptakan tujuh langit. Setiap langit berada di atas langit yang sebelumnya tanpa bersinggungan antara satu langit dengan langit yang lain. Kamu tidak akan melihat -wahai manusia- pada ciptaan Allah ketimpangan atau ketidak teraturan. Maka perhatikan lagi, adakah kamu lihat suatu retakan atau tidak rata? Sekali-kali kamu tidak akan melihat itu, akan tetapi kamu hanya akan melihat ciptaan yang teratur dan detail."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "3. Dan salah satu tanda kekuasaan Allah adalah Dia menciptakan tujuh langit yang bertingkat-tingkat dan tanpa memiliki kecacatan, tidak berlubang atau retak, tidak memiliki kejanggalan atau ketidak-seimbangan. Hai manusia, lihatlah langit berkali-kali dan cermatilah makhluk yang besar ini, kamu tidak akan melihat padanya suatu kekurangan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. الَّذِى خَلَقَ سَبْعَ سَمٰوٰتٍ طِبَاقًا ۖ (Yang telah menciptakan tujuh langit berlapis-lapis) Yakni sebagiannya berada di atas lainnya. مَّا تَرَىٰ فِى خَلْقِ الرَّحْمٰنِ مِن تَفٰوُتٍ ۖ( Kamu sekali-kali tidak melihat pada ciptaan Tuhan Yang Maha Pemurah sesuatu yang tidak seimbang) Yakni tidak saling bertolak belakang, namun semuanya seimbang dan serasi yang menunjukkan pada kekuasaan Sang Pencipta. فَارْجِعِ الْبَصَرَ هَلْ تَرَىٰ مِن فُطُور(Maka lihatlah berulang-ulang, adakah kamu lihat sesuatu yang tidak seimbang?) Yakni arahkanlah pandanganmu ke langit lalu perhatikanlah apakah kamu menemukan keretakanp, adahal ia sangat besar dan luas?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Pencipta tujuh langit yang berlapis-lapis. Tidak ada pertentangan dan penjelasan dalam ciptaan Sang Maha Pengasih. Dan semua ciptaanNya itu saling menyesuaikan. Lalu mata berulang-ulang melihat langit dan berkhayal: “Apakah di sana ada kecacatan, keretakan dan perpecahan?”. Min berfungsi untuk menjelaskan keutuhan negasi kata setelahnya. Dan “Hal” merupakan pertanyaan yang meniadakan pengingkaran atau penegasian atau sesuatu yang tidak dapat dilihat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Yang menciptakan tujuh langit berlapis-lapis} tingkat demi tingkat, sebagian satu di atas bagian lain, tanpa saling bersentuhan {Kamu tidak akan melihat pada ciptaan Tuhan Yang Maha Pengasih ketidak seimbangan sedikit pun} berbeda dan bertentangan {Maka, lihatlah lagi} Maka lihatlah lagi {Adakah kamu melihat suatu celah} retakan dan celah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3. “Yang telah menciptakan tujuh langit berlapis-lapis.” Masing-masing bersusun rapi, di mana yang satu di atas yang lain dan bukan hanya satu lapis saja. Allah menciptakannya dengan amat baik dan sempurna. “Kamu sekali-kali tidak melihat pada ciptaan Rabb Yang Maha Pemurah sesuatu yang tidak seimbang..” yakni cela dan kekurangan. Karena terbebas dari kekurangan dari berbagai seginya, maka ciptaan tersebut menjadi baik, sempurna, dan serasi di berbagai halnya, baik dari segi warna, kondisi, ketinggian dan dengan adanya matahari, bulan, bintang yang bercahaya, bintang yang tetap berada di tempatnya dan yang berpindah. Karena kesempurnaan penciptaan langit dan bumi bisa dilihat dan diketahui, maka Allah memerintahkan agar selalu dipandangi dan direnungkan seluruh penjurunya seraya berfirman, “Maka lihatlah berulang-ulang,” maksudnya, pandanglah berulang-ulang seraya memetik pelajaran. “Adakah kamu lihat sesuatu yang tidak seimbang,” maksudnya, apakah ada kekurangan dan ketimpangan?"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mulk ayat 3: Allah menyebutkan dengan menampakkan kekuasaan-Nya yang lain. Allah menyebutkan bahwasanya Ia pencipta tujuh langit, Allah ciptakan dan jadikan bertingkat-tingkat, sebagiannya lebih tinggi daripada sebagian yang lain. Makhluk yang melihatnya, tidak akan mendapati keanehan atau pertentangan dan atau cacat (terbelah). Kemudian Allah memerintahkan untuk mengulangi penglihatannya, agar menjadikan pelajaran dan bertambah keyakinan, karena tidak akan didapati padanya retak atau memiliki celah atau adanya keanehan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Masing-masing lapisan di atas yang lain, Dia menciptakannya dalam keadaan yang sangat bagus dan rapi. Bisa juga diartikan dengan kerusakan dan kekurangan. Jika pada langit tidak terdapat kerusakan, maka berarti langit itu sangat indah dan sempurna, seimbang dan sesuai baik warnanya, bentuknya maupun tingginya, demikian pula apa yang ada di sana seperti matahari, bulan, bintang, benda langit yang diam dan yang bergerak. Oleh karena kesempurnaannya sudah dimaklumi, maka Allah Subhaanahu wa Ta'aala memerintahkan agar melihat sekali lagi dan memperhatikan segala penjurunya. Sambil memikirkan dan mengambil pelajaran."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mulk Ayat 3",
    "description": "3-4. Kuasa Allah menciptakan hidup dan mati dikaitkan dengan kuasa-Nya menciptakan alam raya. Yang menciptakan tujuh langit berlapis-lapis sangat serasi dan harmonis. Tidak akan kamu lihat sesuatu yang tidak seimbang aib atau tidak sempurna, pada ciptaan tuhan yang maha pengasih tuhan yang rahmat-Nya mencakup seluruh wujud, baik pada ciptaan-Nya yang kecil maupun yang besar. Maka lihatlah sekali lagi dan berulang-ulang disertai dengan berpikir yang keras, maka adakah kamu lihat atau menemukan padanya sesuatu yang cacat atau retak' kemudian setelah sekian lama kamu serius memperhatikannya, maka ulangi pandanganmu sekali lagi dan sekali lagi yaitu berkali-kali, niscaya pandanganmu akan kembali kepadamu dalam keadaan kecewa karena tanpa menemukan cacat yang kamu usahakan untuk menemukannya, dan ia, pandanganmu, dalam keadaan letih dan ada batasnya"
  }
]