[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "30. Katakanlah (wahai Rasul) kepada orang-orang musyrik, “Kabarkanlah kepadaku bila air yang kalian minum itu pergi ke dalam perut bumi, dan kalian tidak bisa menjangkaunya dengan cara apa pun; maka siapa selain Allah yang akan mendetangkan kepada kalian air yang mengalir di muka bumi dan terlihat oleh mata?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "30. Katakanlah -wahai Rasul- kepada orang-orang musyrik, “Kabarkan kepadaku jika sumber air yang kalian minum menjadi kering di muka bumi, kalian tidak bisa mencapainya, lalu siapakah yang akan mendatangkan kepada kalian air yang banyak dan mengalir?” Tidak seorang pun selain Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "30. Hai Nabi yang mulia, katakanlah kepada orang-orang musyrik: “Sampaikanlah kepadaku setelah kalian berfikir dan menghayati; jika kalian terhalang dari kenikmatan air karena air itu masuk ke dalam bumi, maka siapa yang dapat memberi kalian air tawar yang mengalir dan mudah didapatkan?” Ayat ini berakhir tanpa menyebutkan jawaban dari pertanyaan ini, sebab tidak ada yang dapat melakukan selain Allah Yang Maha Kuasa untuk mendatangkan air, karena hanya Allah yang mengusai alam semesta, tidak ada selain-Nya yang dapat melakukan hal besar seperti itu. Dan pada pertanyaan dan jawaban ini terdapat bukti akan keesaan dan keagungan Allah, dan kewajiban untuk menyembah-Nya Semata."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "30. قُلْ أَرَءَيْتُمْ إِنْ أَصْبَحَ مَآؤُكُمْ غَوْرًا (Katakanlah: “Terangkanlah kepadaku jika sumber air kamu menjadi kering) Yakni jelaskanlah kepadaku jika air yang Allah karuniakan kepada kalian di mata air, sumur, dan sungai-sungai menjadi lenyap ke dalam bumi sehingga tidak tersisa sama sekali atau surut sampai tidak dapat dijangkau oleh timba yang diulur. فَمَن يَأْتِيكُم بِمَآءٍ مَّعِينٍۭ (siapakah yang akan mendatangkan air yang mengalir bagimu?”) Yakni siapa yang dapat mendatangkan air yang banyak dan mengalir terus menerus? Tidak ada yang dapat mendatangkannya untuk kalian kecuali Allah dengan guyuran hujan atau aliran sungai, sehingga kalian dapat menikmatinya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "30. Katakanlah (Muhammad): “Terangkanlah kepadaku jika air galian kalian habis dalam kekeringan bumi, maka siapa yang akan mendatangkan untuk kalian air yang mengalir sangat deras? Dialah Allah, Tuhan Alam semesta”. “Ghauran” adalah mashdar dan maknanya adalah galian."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,\"Bagaimana pendapat kalian} Terangkanlah kepadaku {jika air kalian surut} hilang kke dalam tanah sehingga kalian tidak bisa mendapatkannya {maka siapa yang akan mendatangkan kepada kalian air yang mengalir} mengalir yang dapat dilihat mata."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "30. selanjutnya Allah memberitahukan bahwa hanya Dia sendiri yang memberi nikmat, khususnya air, yang dijadikan Allah sebagai cikal bakal semua kehidupan. Allah berfirman, “Katakanlah, ‘Terangkanlah kepadaku jika sumber airmu menjadi kering’,” yakni, habis kerontang, “maka siapakah yang akan mendatangkan air yang mengalir bagimu” yang kalian minum dan untuk memberi minum binatang ternak, pepohonan dan tanaman? Pertanyaan ini bermakna menafikan. Maksudnya, tidak ada yang mampu mengalirkan air selain Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mulk ayat 30: Katakanlah wahai Nabi Allah kepada mereka orang-orang musyrik : Apa pendapat kalian jika sumur-sumur dan sungai-sungai kalian kering dan tidak ada di dalamnya air untuk minum; Maka siapa selain Allah yang akan mendatangkan air yang mengalir di bawah tanah, yang mengairi dan menyirami dengannya kebun-kebun (kalian). (Disini) Allah mengkhususkan air karena tidak ada kehidupan tanpanya. Dan berkata orang-orang yang beriman : Sesungguhnya Allah lah yang mendatangkannya, jika Allah berkehendak."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala memberitahukan tentang sendiri-Nya Dia memberikan nikmat, khususnya air yang dari sana diciptakan segala sesuatu yang hidup. Yang kamu minum darinya, memberi minum ternakmu dan menyirami pohon dan tanaman kamu. Pertanyaan ini maksudnya adalah menafikan, yakni tidak ada seorang pun yang sanggup melakukan hal itu selain Allah Subhaanahu wa Ta'aala."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mulk Ayat 30",
    "description": "Sebagai penutup surah ini, Allah memerintahkan kepada nabi Muhammad agar mengingat aneka nikmat Allah, terutama nikmat air yang merupakan sumber utama kehidupan (lihat surah al-anbiy'/21:30). Katakanlah wahai nabi Muhammad, 'terangkanlah kepadaku jika sumber air kamu dan sumber air lainnya menjadi kering. Maka siapa yang akan memberimu air yang mengalir''. Pasti tidak ada kecuali Allah, tuhan pemelihara seluruh alam. Maka sudah sewajarnya kalau manusia hanya menyembah kepada-Nya. 1-4. Akhir surah sebelumnya, berbicara tentang dua kelompok yang saling bertolak belakang. Satu dibinasakan dan satu diselamatkan. Di awal surah ini dijelaskan sifat siapa yang akan mendapat keselamatan dan siapa yang akan mendapat azab. N'n. Demi pena yang biasa digunakan untuk menulis oleh malaikat atau oleh siapa pun, dan juga demi apa yang mereka tuliskan. Dengan karunia tuhanmu yang berupa risalah dan nubuwah, engkau, wahai nabi Muhammad sekali-kali bukanlah orang gila sebagaimana yang dituduhkan oleh kaum musyrik. Dan sesungguhnya berkat perjuangan dan kesabaranmu engkau pasti mendapat pahala yang besar yang tidak putus-putusnya. Dan sesungguhnya engkau benar-benar berbudi pekerti yang luhur. Karena tuhanmu yang mendidikmu dengan akhlak Al-Qur'an."
  }
]