[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "4. Kemudian lihatlah kembali, niscaya pandanganmu kembali kepadamu dalam keadaan tertunduk dan hina karena tidak melihat kekurangan, dan ia lelah dan tumpul."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Kemudian pandanglah berulang kali niscaya pandanganmu kembali kepadamu dengan menunduk tanpa mampu melihat aib atau cacat dalam penciptaan langit dan pandanganmu lemah tidak mampu memandang."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "4. Pada ayat ini Allah memerintahkan manusia untuk kembali melihat dan mengamati penciptaan langit dan betapa kokoh dan sempurnanya ia; dan Allah memerintahkan mereka untuk mencari kekurangan yang ada pada makhluk yang luar biasa ini. Hasil dari pencermatan dan pencarian kekurangan dari makhuk ini adalah keyakinan bahwa makhluk ini sangat luar biasa dan sempurna, dan barangsiapa yang mencoba untuk mencari kekurangannya maka hanya akan mendapat kekecewaan dan ketidakmampuan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. ثُمَّ ارْجِعِ الْبَصَرَ كَرَّتَيْنِ (Kemudian pandanglah sekali lagi) Yakni berkali-kali, agar itu lebih menekankan hujjah dan menghilangkan alasan. يَنقَلِبْ إِلَيْكَ الْبَصَرُ خَاسِئًا(niscaya penglihatanmu akan kembali kepadamu dengan tidak menemukan sesuatu cacat) Yakni penglihatan kalian akan kembali kepadamu dalam keadaan kecewa karena tidak menemukan aib pada penciptaan langit. وَهُوَ حَسِيرٌ(dan penglihatanmu itupun dalam keadaan payah) Yakni terputus harapannya untuk menemukan kekurangan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Kemudian mata berulang-ulang melihatnya lagi. Niscaya mata itu lemah dan tidak mampu melihat kecacatan (ciptaanNya). Mata itu lelah dan tidak mampu mengetahui sesuatu yang dicari setelah melakukan banyak pencarian yang berulang-ulang"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kemudian lihatlah dua kali lagi} lihatlah lagi dan lagi {niscaya pandanganmu akan kembali} kembali {kepadamu dengan kecewa} hina dan rendah {dan letih} letih dan berhenti melihat aib"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4. “Kemudian pandanglah sekali lagi,” maksudnya adalah dengan sering mengulang, “niscaya penglihatanmu akan kembali kepadamu dengan tidak menemukan suatu cacat dan penglihatanmu itu pun dalam keadaan payah.” Maksudnya, tidak berdaya melihat adanya ketimpangan dan ketidakseimbangan meski berusaha dengan sekuat tenaga."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mulk ayat 4: Allah memerintahkan manusia untuk melihatnya bukan hanya cukup melihat sekali saja; Bahkan Allah memerintahkan untuk melihat berkali-kali, agar ia dapat mencari kekurangannya, akan tetapi penglihatannya akan terulang untuk menatap ke langit kembali (setelah ia mencari-cari cacatnya), sambil merasa bosan dan hampa karena sebab gagal (mencari cacat); Karena tidak mungkin akan didapati pertentangan apapun atau celah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya adalah melihatnya berkali-kali. Ternyata tidak ada cacat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mulk Ayat 4",
    "description": "3-4. Kuasa Allah menciptakan hidup dan mati dikaitkan dengan kuasa-Nya menciptakan alam raya. Yang menciptakan tujuh langit berlapis-lapis sangat serasi dan harmonis. Tidak akan kamu lihat sesuatu yang tidak seimbang aib atau tidak sempurna, pada ciptaan tuhan yang maha pengasih tuhan yang rahmat-Nya mencakup seluruh wujud, baik pada ciptaan-Nya yang kecil maupun yang besar. Maka lihatlah sekali lagi dan berulang-ulang disertai dengan berpikir yang keras, maka adakah kamu lihat atau menemukan padanya sesuatu yang cacat atau retak' kemudian setelah sekian lama kamu serius memperhatikannya, maka ulangi pandanganmu sekali lagi dan sekali lagi yaitu berkali-kali, niscaya pandanganmu akan kembali kepadamu dalam keadaan kecewa karena tanpa menemukan cacat yang kamu usahakan untuk menemukannya, dan ia, pandanganmu, dalam keadaan letih dan ada batasnya. 5. Bukti kuasa Allah itu bukan hanya pada kesempurnaan penciptaan langit dan bumi. Dan kami bersumpah bahwa sungguh, telah kami hiasi langit yang dekat, yaitu yang dekat dengan bumi sehingga dapat dilihat dengan pandangan mata secara langsung. Kami menghiasinya dengan bintang-bintang dan kami jadikannya bintang-bintang itu sebagai alat-alat pelempar setan dari golongan jin, dan kami sediakan bagi mereka di akhirat nanti, azab neraka yang menyala-Nyala."
  }
]