[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "5. Sungguh Kami telah menghiasi langit yang dekat yang dilihat oleh mata dengan bintang-bintang yang agung dan bersinar. Kami menjadikannya bola api yang membakar para jin penyadap pendengaran. Kami sediakan bagi mereka di akhirat azab api neraka yang menyala-nyala yang mereka rasakan panasnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Dan Kami telah menghiasi langit yang terdekat dengan bumi dengan bintang-bintang yang bersinar dan Kami jadikan bintang-bintang itu sebagai bara api untuk melempar setan-setan yang sedang mencuri-curi dengar sehingga api itu membakar mereka, dan Kami telah menyiapkan bagi mereka di Akhirat siksa Neraka yang menyala-nyala."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "5. Setelah dijelaskan pada ayat sebelumnya tentang penciptaan langit yang tidak memiliki kekurangan, maka pada ayat ini dijelaskan sebagian keagungan dan kekuasaan Allah; yaitu penghiasan langit dunia dengan bintang-bintang dan benda langit lainnya yang dapat terlihat dari bumi seperti lampu-lampu yang bersinar. Dan bintang-bintang itu memiliki fungsi lain, yaitu untuk melempar setan-setan yang berusaha mendekati langit. Dan Allah telah menyiapkan azab yang berat di akhirat bagi setan-setan, yaitu api neraka yang membara."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. وَجَعَلْنٰهَا رُجُومًا لِّلشَّيٰطِينِ ۖ (dan Kami jadikan bintang-bintang itu alat-alat pelempar syaitan) Yakni dan Kami jadikan bintang-bintang untuk melempar setan-sertan; ini adalah manfaat lain darinya selain sebagai penghias langit dunia. Qatadah mengatakan: Allah menciptakan bintang-bintang untuk tiga hal: Hiasan di langit, untuk melempar setan, dan tanda untuk petunjuk di darat dan laut. وَأَعْتَدْنَا لَهُمْ عَذَابَ السَّعِيرِ(dan Kami sediakan bagi mereka siksa neraka yang menyala-nyala) Yakni dan Kami siapkan bagi setan-setan azab neraka di akhirat setelah Kami bakar mereka di dunia dengan lemparan bintang."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Demi Allah, sungguh Kami menghiasi langit dunia, yaitu langit dunia dengan planet-planet yang bersinar. Dan kami jadikan (planet-planet) itu sesuatu untuk melempari setan dari golongan jin dan manusia. Mereka dilempari layaknya dilempari batu. Kami menyiapkan dan menyediakan untuk mereka siksa neraka yang menyala-nyala"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sungguh Kami benar-benar telah menghiasi langit dunia} langit yang dekat dengan dunia {dengan bintang-bintang} bintang-bintang yang bersinar {menjadikannya sebagai alat untuk melempar setan} nyala api yang membakar setan yang mencuri dengar {dan Kami menyediakan bagi mereka} Kami menyiapkan {azab neraka Sa‘ir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5. Maksudnya, sungguh Kami telah memperindah “langit dunia (yang dekat),” yang kalian lihat dan meliputi kalian, “dengan bintang-bintang,” yaitu bintang-bintang dengan berbagai jenis cahaya dan pantulannya. Sebab andai langit tanpa berhias bintang akan menjadi atap yang gelap yang tidak memiliki keindahan. Tapi Allah menjadikan bintang-bintang tersebut sebagai perhiasan langit, keindahan, cahaya, dan petunjuk dalam kegelapan darat dan laut. Pemberitaan tentang perhiasan langit terdekat (paling bawah) dengan berbagai bintang tidak menafikan banyaknya bintang di tujuh langit yang lain, karena langit-langit itu bersifat transparan sehingga bintang-bintang terlihat di langit terendah meski lokasi bintang-bintang tersebut tidak terdapat di langit tersebut. “Dan Kami jadikan bintang-bintang itu alat-alat pelempar setan,” yang ingin mencuri berita langit. Allah menjadikan bintang-bintang tersebut sebagai penjaga langit agar setan tidak bisa mencuri berita-berita bumi. “Dan Kami sediakan bagi mereka,” yakni di akhirat, “siksa neraka yang menyala-nyala.” Karena mereka membangkang terhadap Allah dan menyesatkan hamba-hambaNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mulk ayat 5: Allah mengabarkan bahwa bintang-bintang adalah hiasan bagi langit dunia, yang ketika kita melihatnya dengan mata-mata kita menuju kepada bintang, galaxy dan matahari. Allah juga mengeluarkan dengan kekuasaan-Nya pada bintang-bintang ini meteor yang berpindah-pindah (posisinya), yang sebagian fungsinya adalah untuk membakar setan yang mencoba untuk mencuri (berita) dari langit. Dan inilah salah satu manfaat diciptakannya bintang pada langit dunia. Manfaat yang kedua dari bintang-bintang adalah sebagai penghias dan memperindah langit. Manfaat yang ketiga adalah sebagai petunjuk orang-orang yang melakukan safar baik di daratan maupun di lautan. Inilah tidak manfaat yagn disebutkan di dalam Al Qur’an, dan mungkin masih memiliki manfaat-manfaat yang lain, contohnya menerangin matahari kemudian mematangkan buah (di pepohonan) dan lainnya. Kemudian Allah menjelaskan bahwa Ia menyiapkan mereka para setan dan para pengikutnya (orang-orang kafir) dengan adzab neraka di akhirat yang diiringi dengan panasnya yang sangat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala menyebutkan secara tegas keindahannya. Dengan bumi. Dengan cahayanya yang beraneka ragam, dimana jika tidak ada bintang tentu langit menjadi atap yang gelap dan menjadi tidak indah dan tidak menarik. Allah Subhaanahu wa Ta'aala juga menjadikannya sebagai petunjuk bagi musafir di kegelapan daratan dan lautan. Apabila mereka (para setan) mencuri berita dari langit, yaitu dengan dilepasnya meteor dari bintang-bintang seperti suluh api yang diambil dari api, kemudian dilemparkan kepada jin sehingga jin yang mencuri berita itu terbunuh atau anggota badannya terpotong, bukan maksudnya bahwa bintang-bintang besar di langit jatuh menimpa setan. Dengan demikian, Allah Subhaanahu wa Ta'aala menjadikan bintang-bintang untuk menjaga langit. Di akhirat. Karena mereka durhaka kepada Allah dan menyesatkan hamba-hamba-Nya. Demikian pula para pengikut setan dari kalangan orang-orang kafir juga Allah siapkan azab neraka yang menyala-nyala sebagaimana diterangkan dalam ayat selanjutnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mulk Ayat 5",
    "description": "Bukti kuasa Allah itu bukan hanya pada kesempurnaan penciptaan langit dan bumi. Dan kami bersumpah bahwa sungguh, telah kami hiasi langit yang dekat, yaitu yang dekat dengan bumi sehingga dapat dilihat dengan pandangan mata secara langsung. Kami menghiasinya dengan bintang-bintang dan kami jadikannya bintang-bintang itu sebagai alat-alat pelempar setan dari golongan jin, dan kami sediakan bagi mereka di akhirat nanti, azab neraka yang menyala-Nyala. 6. Telah menjadi ketetapan Allah bahwa setiap orang yang menyekutu-kan dan mengingkari Allah, serta mendustakan para rasul akan dimasukkan ke dalam neraka di akhirat kelak. Inilah yang ditegaskan pada ayat ini. Dan orang-orang yang ingkar kepada tuhannya akan mendapat azab jahanam. Itulah tempat kediaman mereka. Dan itulah seburuk-buruk tempat kembali."
  }
]