[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "6. Orang-orang yang kafir kepada Pencipta mereka akan mendapat azab Jahanam, dan ia adalah seburuk-buruk tempat kembali bagi mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Dan bagi orang-orang yang kafir kepada Rabbnya pada hari Kiamat siksa Jahanam. Dan seburuk-buruk tempat kembali adalah tempat kembali mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "6. Ayat yang mulia ini menjelaskan bahwa orang-orang kafir dari golongan jin dan manusia akan mendapat azab di neraka Jahannam, mereka akan disiksa pada hari kiamat sebagai balasan atas kekafiran mereka. Dan sungguh buruk tempat kembali mereka itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Kami menyiapkan siksa neraka Jahanam untuk orang-orang kafir yang mengingkari Ketuhanan Allah. Itu adalah seburuk-buruk tempat kembali yang menunggu mereka. Itu adalah neraka Jahanam"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan bagi orang-orang yang ingkar kepada Tuhannya itu azab neraka Jahanam. Itulah seburuk-buruk tempat kembali} tempat kembali"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6. Karena itu para pengikut mereka dari kalangan orang-orang kafir juga seperti mereka, Allah menyediakan bagi mereka siksa neraka yang menyala-nyala. Karena itu Allah berfirman, “Dan orang-orang yang kafir kepada Rabbnya, memperoleh azab Jahanam. Dan itulah seburuk-buruk tempat kembali,” yang amat menghinakan penghuninya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Allah mengabarkan bahwa Ia akan menyiapkan bagi orang-orang yang kafir pada-Nya, dan mendustakan Rasul-Nya dengan adzab jahannam dan itulah seburuk-nuruk tmpat kembali bagi mereka, dan seburuk-buruk tempat di nereka bagi mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mulk Ayat 6",
    "description": "Telah menjadi ketetapan Allah bahwa setiap orang yang menyekutu-kan dan mengingkari Allah, serta mendustakan para rasul akan dimasukkan ke dalam neraka di akhirat kelak. Inilah yang ditegaskan pada ayat ini. Dan orang-orang yang ingkar kepada tuhannya akan mendapat azab jahanam. Itulah tempat kediaman mereka. Dan itulah seburuk-buruk tempat kembali. 7-8. Apabila mereka dilemparkan ke dalamnya mereka mendengar suara neraka yang mengerikan, karena kerasnya kobaran api, sedang neraka itu membara, dengan sangat dahsyatnya, hampir saja neraka meledak karena marah. Setiap kali ada sekumpulan orang-orang kafir dilemparkan ke dalamnya, para malaikat penjaga-penjaga neraka itu bertanya kepada mereka, 'apakah belum pernah ada orang yang datang memberi peringatan kepadamu di dunia tentang ancaman Allah''."
  }
]