[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "7. Bila orang-orang kafir itu dicampakkan ke dalam Jahanam, mereka mendengar darinya suara keras lagi buruk, ia mendidih dan bergejolak."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Jika mereka dilemparkan ke dalam Neraka mereka mendengar suara yang mengerikan, dan Neraka itu mendidih seperti mendidihnya tungku."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "7. Ketika orang kafir dilempar ke dalam neraka Jahannam maka akan menimbulkan suara yang sangat buruk dan mengerikan; dan ketika para penghuninya mendengar suara itu, azab dan ketakutan mereka semakin bertambah, dan neraka Jahannam ketika itu sangat bergejolak."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. إِذَآ أُلْقُوا۟ فِيهَا (Apabila mereka dilemparkan ke dalamnya) Yakni jika mereka dilempar ke neraka seperti kayu yang dilempar ke dalam kobaran api. سَمِعُوا۟ لَهَا شَهِيقًا(mereka mendengar suara neraka yang mengerikan) Yakni suara yang mirip suara keledai ketika pertama bersuara. وَهِىَ تَفُورُ(sedang neraka itu menggelegak) Yakni neraka mendidih bersama mereka seperti periuk yang mendidih."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Ketika mereka dilemparkan ke dalam neraka Jahanam. Di dalamnya mereka mendengar suara yang sangat mengerikan seperti suara keledai saat meringkik. Neraka itu menggodok mereka seperti panci penggodokan yang mendidih. Sebagian mereka berkata: “Yang dimaksud dengan Asy-Syahiq adalah sesuatu yang bergemirisik (suara misterius) yang disebutkan dalam ayat 1-2 surah Al-Anbiya’”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apabila mereka dilemparkan} mereka dilemparkan {ke dalamnya mereka pasti mendengar suaranya yang mengerikan} suara yang keras dan tidak menyenangkan {ketika membara} yang mendidih seperti mendidihnya tembaga dengan sesuatu yang ada di dalamnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7. “Apabila mereka dilemparkan ke dalamnya,” dengan cara dihina dan direndahkan, “mereka mendengar suara neraka yang mengerikan,” yaitu suara (jeritan) keras yang menakutkan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mulk ayat 7: Allah mengabarkan bahwa mereka orang-orang kafir jika bertemu dengan neraka ini (dengan wajah mereka yang tertunduk dan pasrah); Mereka akan mendengar suara yang keras, dahsyat dan mengerikan. Dan suara tersebut mengguncangkan mereka, sebagaimana ketetapan bagi mereka yang juga diberikan makanan dari api."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni dengan dihinakan dan direndahkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mulk Ayat 7",
    "description": "7-8. Apabila mereka dilemparkan ke dalamnya mereka mendengar suara neraka yang mengerikan, karena kerasnya kobaran api, sedang neraka itu membara, dengan sangat dahsyatnya, hampir saja neraka meledak karena marah. Setiap kali ada sekumpulan orang-orang kafir dilemparkan ke dalamnya, para malaikat penjaga-penjaga neraka itu bertanya kepada mereka, 'apakah belum pernah ada orang yang datang memberi peringatan kepadamu di dunia tentang ancaman Allah''7-8"
  }
]