[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "8. Hampir-hampir Jahanam itu terbelah karena marahnya yang besar terhadap orang-orang kafir, setiap kali segerombolan manusia dimasukkan kedalamnya, para malaikat penjaganya bertanya kepada mereka sebagai penghinaan, “Apakah di dunia tidak datang kepada kalian seorang rasul yang memperingatkan kalian dari azab yang kalian rasakan saat ini?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Sebagian dari Neraka itu hampir lepas dari sebagian yang lain dan terpisah karena kemarahan yang sangat kepada orang yang masuk ke dalamnya, setiap kali dilemparkan ke dalamnya sekumpulan penghuninya yang kafir, maka Malaikat yang ditugaskan untuk menjaganya bertanya kepada mereka dengan pertanyaan yang mengecam, “Tidakkah datang kepada kalian di dunia seorang Rasul yang menakuti kalian dengan siksa Allah?”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "8. Neraka Jahannam hampir-hampir terpecah belah karena besarnya kemurkaan dan kemarahannya kepada orang-orang kafir yang memang layak memasukinya akibat perbuatan buruk mereka. Hal ini menggambarkan betapa besarnya kobaran apinya. Setiap kali segolongan orang kafir memasukinya, para malaikat menjaga neraka segera bertanya untuk mengolok mereka: “Bukankah Allah telah mengutus kepada kalian seorang rasul yang mengajak kalian menuju petunjuk dan memerintahkan kalian untuk mengerjakan kebajikan, serta memperingatkan kalian dari azab yang menyakitkan?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. تَكَادُ تَمَيَّزُ مِنَ الْغَيْظِ ۖ (hampir-hampir (neraka) itu terpecah-pecah lantaran marah) Yakni neraka hampir-hampir terpecah akibat besarnya kemarahannya terhadap orang-orang kafir. كُلَّمَآ أُلْقِىَ فِيهَا فَوْجٌ(Setiap kali dilemparkan ke dalamnya sekumpulan (orang-orang kafir)) Makna (الفوج) adalah sekelompok manusia. سَأَلَهُمْ خَزَنَتُهَآ(penjaga-penjaga (neraka itu) bertanya kepada mereka) Yakni para malaikat penjaga neraka bertanya untuk memperolok mereka. أَلَمْ يَأْتِكُمْ(Apakah belum pernah datang kepada kamu) Ketika di dunia. نَذِيرٌ(seorang pemberi peringatan?”) Yang memperingatkan kalian dari hari ini?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8. Neraka itu hampir terpecah-pecah karena sangat marah kepada mereka (ini adalah penggambaran bahwa neraka itu sangat mendidih). Setiap kali kumpulan orang kafir dilemparkan ke dalamnya, Para malaikat penjaga yang merupakan pelayan-pelayan Malaikat Malik bertanya: “Bukankah Rasulallah sudah mendatangi kalian untuk mengingatkan kalian tentang azab Allah?”. Istifham ini berfungsi untuk mengolok-olok"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{(Neraka itu) hampir meledak karena marah} hampir meledak karena sangat marah terhadap orang-orang kafir {Setiap kali ada sekelompok} sekelompok orang-orang kafir {dilemparkan ke dalamnya, penjaga-penjaganya bertanya kepada mereka} para malaikat yang ditugaskan untuk hal itu {“Bukankah telah datang kepada kalian seorang pemberi peringatan} Rasul yang memperingatkan kalian tentang azab ini"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8. “Hampir-hampir (neraka) itu terpecah-pecah lantaran marah.” Maksudnya, karena saling berkumpul, hampir neraka saling terpecah satu sama lain dan terputus-putus karena marah terhadap orang-orang kafir. Lantas bagaimana dugaanmu, apa yang dilakukan terhadap mereka ketika mereka dimasukkan ke dalam neraka? Kemudian Allah menyebutkan celaan penjaga neraka terhadap penghuninya, “Setiap kali dilemparkan ke dalamnya sekumpulan (orang-orang kafir), penjaga-penjaga (neraka itu) bertanya kepada mereka, ‘apakah belum pernah datang kepada kamu (di dunia) seorang pemberi peringatan?’” maksudnya, dengan kondisi kalian seperti ini dan hak kalian mendapatkan neraka seperti ini, sepertinya kalian belum diberitahu tentang kondisi neraka dan tidak ada seorang pemberi peringatan pun yang mengingatkan kalian dari neraka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mulk ayat 8: Allah menjelaskan bahwa jahannam nyaris mencabik-cabik dan memisahkan sebagai dari sebagian yang lain karena dahsyatnya kemarahan dan amukannya bagi siapa yang dimasukkan Allah kedalamnya dari orang-orang kafir. Disini terdapat dalil bahwa neraka memiliki kepekaan. Kemudian Allah memberi penjelasan, yaitu ketika Allah masukkan sekelompok jin atau manusia, penjaga-penjaga neraka itu bertanya kepada mereka : Apakah belum datang peringatan dari utusan Allah, yang memperingatkanmu dari neraka dan mewanti-wanti kalian dari adzab neraka ?!"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kepada orang-orang kafir. Yaitu Rasul yang datang memberikan peringatan terhadap azab akhirat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mulk Ayat 8",
    "description": "7-8. Apabila mereka dilemparkan ke dalamnya mereka mendengar suara neraka yang mengerikan, karena kerasnya kobaran api, sedang neraka itu membara, dengan sangat dahsyatnya, hampir saja neraka meledak karena marah. Setiap kali ada sekumpulan orang-orang kafir dilemparkan ke dalamnya, para malaikat penjaga-penjaga neraka itu bertanya kepada mereka, ?Apakah belum pernah ada orang yang datang memberi peringatan kepadamu di dunia tentang ancaman Allah??9. Pertanyaan para penjaga neraka tersebut dijawab dengan jujur oleh para pendurhaka itu. Mereka menjawab, ?Benar, sungguh, seorang pemberi peringatan telah datang kepada kami, menyampaikan tentang adanya azab Allah, tetapi kami mendustakannya dan kami katakan, 'Allah tidak menurunkan sesuatu apa pun kepadamu, kamu wahai orang yang meng-ku sebagai utusan Allah, sebenarnya di dalam kesesatan yang besar.'?"
  }
]