[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1. Semua makhluk-makhluk Allah yang ada di langit dan di bumi menyucikan Allah dari segala keburukan. Allah Maha perkasa atas makhluk-makhlukNya, juga Mahabijaksana dalam mengatur urusan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Semua makhluk yang ada di langit dan di bumi menyucikan Allah dan membersihkan-Nya . Dia Maha Perkasa, tidak ada sesuatu pun yang mampu mengalahkan-Nya, Maha Bijaksana dalam penciptaan-Nya dan takdir-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1-2. Allah mengabarkan kebesaran kuasa-Nya dan keluasan kekuasaan-Nya: Seluruh makhluk yang ada di tujuh langit dan bumi mengucapkan tasbih dan tahmid bagi Tuhannya, menyucikan-Nya dari segala yang tidak layak bagi-Nya. Allah Maha Perkasa dalam kerajaan-Nya dan Maha Bijaksana dalam mengatur makhluk-Nya. Dia pemilik tujuh langit dan bumi, mengatur keduanya, Dia menghidupkan makhluk yang telah mati dengan kuasa-Nya dan mematikan makhluk hidup dengan cara yang Dia kehendaki. Dia Maha Kuasa atas segalanya, tidak ada yang sulit bagi-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. سَبَّحَ لِلّٰهِ مَا فِى السَّمٰوٰتِ وَالْأَرْضِ ۖ (Semua yang berada di langit dan yang berada di bumi bertasbih kepada Allah) Yakni bertasbih kepada Allah dengan lisannya para malaikat, manusia, dan jin; dan bertasbih dengan keadaannya makhluk-makhluk yang lain, sebab segala makhluk yang ada menunjukkan wujud Sang Pencipta. Pendapat lain mengatakan yang dimaksud adalah segala sesuatu bertasbih kepada Allah dengan lisannya, namun manusia tidak memahami tasbih mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Keutamaan: Diriwayatkan dari Imam Ahmad dan lainnya dari ‘Urbadh bin Sariyah bahwa rasul SAW selalu membaca dzikir tasbih sebelum beliau tidur. Dalam dzikir itu terdapat satu ayat yang keutamaan yang melebihi 1000 ayat, yaitu kalam Allah: Dia lah Allah Yang Maha Awal dan Maha Akhir. (3). 1. Allah Maha Suci dari segala apapun yang tidak sesuai dengan sifat dzat-Nya baik di langit maupun di bumi. Dia Maha Perkasa di seluruh kerajaan-Nya, Yang Maha Mengusai, Yang Maha Bijaksana dalam segala kehendak dan keputusan-Nya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apa yang ada di langit dan di bumi bertasbih kepada Allah} mensucikan Allah {Dialah Dzat Yang Maha perkasa lagi Maha bijaksana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1. Allah mengabarkan tentang keagungan dan kemuliaanNya, serta keluasan kekuasaanNya, bahwasanya “semua yang berada di langit dan yang berada di bumi,” dari makhluk yang dapat berbicara hingga yang tidak dapat berbicara, dan juga benda-benda padat, bertasbih memuji Rabbnya dan menyucikanNya dari segala sesuatu yang tidak pantas bagiNya. Semuanya taat kepada Rabbnya dan tunduk kepada kekuasaanNya. Pada semua benda tersebut terlihat pengaruh-pengaruh hikmahNya. Karena itulah Allah berfirman, “Dan Dia-lah Yang Maha perkasa lagi Mahabijaksana.” Di dalam ayat ini terdapat penjelasan bahwa seluruh makhluk yang ada di langit maupun di bumi memerlukan Allah di berbagai kondisinya secara umum, kekuasaan dan keperkasaan Allah atas segala sesuatu dan kebijaksanaan Allah dalam mencipta dan menetapkan urusan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Hadid ayat 1: Allah membuka surat ini dengan mengabarkan bahwasanya setiap yang di langit maupun di bumi mensucikan dan mengagungkan Allah, Dialah yang berhak untuk disucikan baik secara ucapan dan keyakinan serta amalan. Kemudian Allah mengabarkan bahwa Dia Yang Maha Kuat, yang bahwasanya Dia tidak ada yang merebut atas kekuasaan-Nya, dan Dia Yang Maha Bijaksa dalam mengurus urusan hamba-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan tentang keagungan-Nya, kebesaran-Nya dan luasnya kerajaan-Nya, yaitu bahwa semua yang ada di langit dan di bumi baik makhluk hidup yang bisa berbicara maupun yang diam dan lainnya serta benda-benda mati bertasbih dengan memuji Tuhannya serta mensucikan-Nya dari segala yang tidak layak dengan keagungan-Nya, dan bahwa semuanya taat kepada Allah Tuhannya dan tunduk kepada keperkasaan-Nya, dimana tampak di sana atsar (pengaruh) hikmah(kebijaksanaan)-Nya. Oleh karena itu, Dia berfirman, “Dialah Yang Mahaperkasa lagi Mahabijaksana.” Dalam ayat ini terdapat penjelasan meratanya rasa butuh makhluk baik yang berada di alam bagian atas maupun alam bagian bawah kepada Tuhannya dalam semua keadaannya. Demikian pula terdapat penjelasan meratanya keperkasaan-Nya kepada segala sesuatu dan meratanya kebijaksanaan-Nya pada ciptaan-Nya dan pada perintah-Nya. Dan pada ayat selanjutnya, Dia memberitahukan tentang meratanya kepemilikan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hadid Ayat 1",
    "description": "Apa yang di langit, baik makhluk hidup seperti burung maupun makhluk mati semisal planet, bintang, bulan, dan matahari, dan demi-kian juga makhluk di bumi; mereka bertasbih kepada Allah untuk mengakui kebesaran dan kesucian-Nya. Dialah yang mahaperkasa atas semua makhluk, lagi mahabijaksana dalam menetapkan ketentuan dan hukum bagi mereka. 2. Allah adalah pencipta semua makhluk, karena itu hanya milik-Nyalah kerajaan langit dan bumi serta semua yang ada di antara keduanya. Dia berkuasa menghidupkan dan mematikan apa saja sesuai kehendak-Nya, dan dia mahakuasa untuk menentukan apa yang dia inginkan atas segala sesuatu."
  }
]