[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "10. Apa yang menghalangi kalian untuk berinfak di jalan Allah? padahal hanya milik Allah warisan langit dan bumi, Allah mewarisi semua yang ada pada keduanya, tidak seorang pun yang memiliki apa pun pada keduanya. Tidak sama dalam urusan balasan dan pahala orang yang berinfak dan memerangi orang-orang kafir sebelim Fathu Makkah, mereka lebih besar derajatnya di sisi Allah daripada orang-orang kafir sesudahnya. Tetapi kedua kelompok mendapatkan janji surga dari Allah. Allah Maha Mengetahui amal-amal kalian, tidak ada sesuatu pun yang samar bagiNya, dan Dia akan membalas kalian atasnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Dan apakah yang menghalangi kalian untuk menafkahkan harta di jalan Allah? Hanya milik Allah saja kekayaan langit dan bumi. Tidak sama di antara kalian -wahai orang-orang yang beriman- orang yang menafkahkan hartanya di jalan Allah demi mendapat rida Allah sebelum penaklukan Makkah dan memerangi orang-orang kafir demi kemenangan Islam. Orang-orang yang menafkahkan hartanya sebelum penaklukan Makkah dan berjuang di jalan Allah lebih besar kedudukannya di sisi Allah dan lebih tinggi derajatnya daripada orang-orang yang menafkahkan hartanya di jalan Allah setelah penaklukan Makkah dan memerangi orang-orang kafir. Allah telah menjanjikan Surga kepada dua golongan ini, dan Allah Maha Mengetahui apa yang kalian kerjakan, tidak ada sesuatu pun dari amal perbuatan kalian yang luput dari-Nya, dan Dia akan membalas kalian atas amal perbuatan itu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "10. Dan apa yang menghalangi kalian untuk berinfak demi menolong agama Allah; padahal seluruh mahrta yang ada di langit dan di bumi berasal dari Allah? Tidak sama keutamaan dan pahala orang yang menginfakkan hartanya dan memerangi para musuh bersama Rasulullah sebelum penakhlukan kota Makkah, dengan orang yang menginfakkan hartanya dan berperang setelah penakhlukan kota Makkah. Orang-orang yang memiliki derajat yang tinggi itu lebih tinggi derajatnya di sisi Allah daripada orang-orang yang menginfakkan hartanya dan berperang setelah penakhlukan kota Makkah; namun Allah menjanjikan surga bagi kedua golongan itu. Allah Maha Mengetahui segala yang kalian perbuat, tidak ada yang tersembunyi dari-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. هُوَ الَّذِى يُنَزِّلُ عَلَىٰ عَبْدِهِۦٓ ءَايٰتٍۭ بَيِّنٰتٍ (Dialah yang menurunkan kepada hamba-Nya ayat-ayat yang terang) Yakni ayat-ayat yang jelas, yaitu ayat-ayat al-Qur’an; atau menurut pendapat lain yang dimaksud adalah mukjizat-mukjizat, dan yang paling agung adalah mukjizat al-Qur’an. لِّيُخْرِجَكُم مِّنَ الظُّلُمٰتِ إِلَى النُّورِ ۚ( supaya Dia mengeluarkan kamu dari kegelapan kepada cahaya) Yakni agar Allah mengeluarkan kalian dengan ayat-ayat tersebut atau dengan seruan rasulullah tersebut. وَإِنَّ اللهَ بِكُمْ لَرَءُوفٌ رَّحِيمٌ(Dan sesungguhnya Allah benar-benar Maha Penyantun lagi Maha Penyayang terhadapmu) Yakni Maha Lembut dan Penyayang; yang telah menurunkan kitab-kitab-Nya dan mengutus rasul-rasul-Nya sebagai petunjuk bagi hamba-hamba-Nya, dan tidak ada kelembutan dan kasih sayang yang melebihi hal itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10. Apa alasan kalian tidak menafkahkan harta dalam kebaikan? Aku meminta kalian berinfak untuk menjunjung tinggi kalimat Allah dengan cara berjihad dan lain-lain. Allah memiliki segala sesuatu di langit dan bumi dan hanya kepadanyalah segala sesuatu itu kembali. Tidak sama bagi orang yang berinfak dan berperang sebelum Fathu Makkah dan orang yang melakukan hal itu setelah Fathu Makkah. Mereka yang berinfak sebelum Fathu Makkah memiliki derajat lebih tinggi daripada orang-orang yang berinfak setelahnya. Dua golongan yang berbeda ini dijanjikan oleh Allah surga dengan perbedaan derajat mereka di dalamnya. Allah adalah Maha Memberi Kabar tentang apa yang kalian kerjakan dari amalan yang tampak maupun yang ada di dalm hati dan akan membalas kalian atas perbuatan itu. Ayat ini diturunkan untuk Abu Bakar As-Siddiq RA"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mengapa kalian tidak berinfak} apa yang menghalangi kalian untuk berinfak {di jalan Allah, padahal milik Allah semua pusaka langit dan bumi. Tidak sama orang yang berinfak di antara kalian dan berperang sebelum penaklukan} penaklukkan Mekka {Mereka lebih tinggi derajatnya daripada orang-orang yang berinfak dan berperang setelah itu. Allah menjanjikan yang baik} surga {kepada masing-masing} setiap kelompok dari mereka {Allah Maha Mengetahui apa yang kalian kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "10. “Dan mengapa kamu tidak menafkahkan (sebagian hartamu) pada jalan Allah, padahal Allah-lah yang mempusakai (mempunyai) langit dan bumi,” maksudnya, apa gerangan yang mencegah kalian untuk membelanjakan harta di jalan Allah yang merupakan jalan seluruh kebaikan, mengapa kalian bersikap kikir padahal kalian sama sekali tidak memiliki apapun, tapi “Allah-lah yang mempusakai (mempunyai) langit dan bumi,” dan seluruhnya akan berpindah dari tangan kalian atau dipindahkan dari kalian kemudian kepemilikannya akan berpindah pada Pemilik sejatiNya yang Mahasuci dan Mahatinggi. Untuk itu manfaatkan harta kalian untuk berinfak selagi masih berada di tangan kalian dan gunakanlah kesempatan tersebut secara maksimal. Kemudian Allah menjelaskan perbedaan tingkat amal berdasarkan kondisi dan hikmah ilahiyah seraya berfirman, “TIdak sama di antara kamu orang yang menafkahkan (hartanya) dan berperang sebelum penaklukan. Mereka lebih tinggi derajatnya daripada orang-orang yang menafkahkan (hartanya) dan berperang sesudah itu.” Yang dimaksud penaklukan (kemenangan) dalam ayat ini adalah perjanjian Hudaibiyah, pada saat terjadinya perjanjian antara Rasulullah dengan kaum Quraisy yang merupakan penaklukan (kemenangan) terbesar, sehingga Islam pun tersebar luas, kaum Muslimin juga berbaur dengan orang-orang kafir untuk diseru masuk ke dalam Agama Islam tanpa adanya halangan apa pun. Kala itu tidak sedikit orang-orang masuk Islam secara bergelombang, sehingga Islam menjadi kuat dan besar. Sebelum terjadinya perjanjian Hudaibiyah ini, kaum muslimin sama sekali tidak mampu menyeru orang-orang untuk masuk Islam selain di tempat-tempat yang penduduknya telah masuk Islam sebelumnya seperti Madinah dan sekelilingnya. Dan sebelum terjadinya perjanjian Hudaibiyah ini, orang-orang yang masuk Islam yang berada di kawasan kafir mendapatkan siksaan dan merasa takut. Karena itu, orang yang masuk Islam sebelum peristiwa Hudaibiyah, membelanjakan harta serta berjihad, itu pahalanya lebih besar dari orang yang masuk Islam, berperang dan membelanjakan hartanya setelah peristiwa Hudaibiyah sesuai kebijakan Allah. Karena itulah sebagian besar generasi pertama yang masuk Islam sebelum penaklukan Hudaibiyah. Mengingat pembedaan pahala amal antara kedua masa tersebut bisa menimbulkan kesalahpahaman yang membuat seseorang meremehkan amalan yang pahalanya lebih kecil, Allah mencegah pintu kesalahpahaman tersebut seraya berfirman, “Allah menjanjikan kepada masing-masing mereka (balasan) yang lebih baik.” Maksudnya, orang-orang yang masuk Islam, berjihad dan berinfak, baik sebelum maupun sesudah kemenangan Hudaibiyah, semuanya dijanjikan surga oleh Allah karena Allah bersaksi atas keimanan mereeka dan menjanjikan surga bagi mereka, “dan Allah mengetahui apa yang kamu kerjakan,” Allah akan membalas masing-masing dari kalian berdasarkan amalan yang dikerjakan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Hadid ayat 10: Allah berkata kepada mereka orang-orang yang menahan hartanya untuk diinfakkan di jalan Allah : Mengapa kalian wahai manusia tidak menginfakkan rezeki pemberian dari Allah sedangkan kalian mengetahui bahwa harta kalian adalah milik-Nya dan mengapa kalian tidak menginfakkan harta kalian di jalan Allah. Karena milik Allah lah perbendaharaan apa yang di langit dan di bumi, Allah memiliki semua yang ada dikeduanya. Ketahuilah bahwa tidak sama orang yang beriman, berhijrah dan menginfakkan hartanya dan yang perperang di jalan Allah sebelum penaklukkan Mekkah; Mereka adalah orang-orang yang tinggi kedudukannya di sisi Allah dan Allah tinggikan derajat bagi siapa yang menginfakkan hartanya di jalan Allah dan berperang sebelum penaklukkan setelah penaklukkan Mekkah. Allah telah menjanjikan keduanya (yang berperang sebelum dan sesudah penaklukkan Mekkah) dengan surga, Allah yang Maha Mengetahui, tidak tersembunyi sesuatupun bagi-Nya amalan-amalan kalian, dan Allah akan membalas kalian atas amalan-amalan tersebut, dengan apa yang layak bagi setiap manusia atas amalannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya, apa yang menghalangimu untuk berinfak di jalan Allah, yakni di semua jalan kebaikan, padahal kamu tidak memiliki apa-apa, bahkan milik Allah-lah pusaka langit dan bumi, dimana semua harta akan berpindah dari tanganmu atau kamu yang memindahkannya kemudian kepemilikan akan kembali kepada Pemiliknya yang sebenarnya, yaitu Allah Subhaanahu wa Ta'aala. Oleh karena itu, berinfaklah selama harta itu masih ada pada kamu dan Dia berjanji akan menggantinya untukmu dengan yang lebih baik. Selanjutnya Allah Subhaanahu wa Ta'aala menyebutkan tingkatan amal sesuai keadaan dan hikmah Allah Subhaanahu wa Ta'aala. Sebagian mufassir menafsirkan penaklukan di sini dengan perjanjian Hudaibiyah. Hal itu, karena dengan adanya perjanjian damai itu agama Islam menjadi tersebar, kaum muslimin dapat bercampur baur dengan orang-orang kafir dan bisa mendakwahi mereka sehingga ketika itu banyak manusia yang masuk ke dalam agama Allah, padahal sebelumnya kaum muslimin tidak bisa berdakwah pada selain tempat yang sudah masuk Islam seperti Madinah dan sekitarnya, namun setelah ada perjanjian itu, kaum muslimin dapat memperluas dakwah mereka. Demikian juga sebelum ada perjanjian itu, orang yang masuk ke dalam agama Islam disakiti dan diancam, berbeda dengan setelahnya. Oleh karena itulah, orang yang masuk Islam sebelum penaklukkan Fat-h (penaklukkan), berinfak dan berperang lebih besar derajat, pahala dan balasannya daripada orang yang masuk Islam setelahnya. Oleh karena kelebihan yang Allah berikan kepada orang-orang yang masuk Islam sebelum Fat-h (penaklukkan) bisa saja menimbulkan kesan terdapat kekurangan dan cela pada orang-orang yang yang masuk Islam setelah Fat-h, maka Allah Subhaanahu wa Ta'aala menghilangkan kesan ini dengan firman-Nya pada lanjutan ayat di atas. Yang masuk Islam sebelum dan setelah Fat-h. Ayat ini menunjukkan keutamaan para sahabat semuanya radhiyallahu 'anhum, karena Allah bersaksi terhadap keimanan mereka dan menjanjikan mereka surga. Dia akan memberikan balasan kepada masing-masing di antara kamu sesuai yang Dia ketahui dari amalmu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hadid Ayat 10",
    "description": "Dalam hartamu ada bagian Allah yang mesti kamu infakkan. Lalu, mengapa kamu kikir dan mengapa kamu tidak menginfakkan sebagian hartamu di jalan Allah, padahal milik Allah semua pusaka langit dan bumi' dialah yang menciptakannya dan semua yang ada di antara keduanya. Ketahuilah, tidak akan sama orang yang menginfakkan sebagian hartanya di jalan Allah di antara kamu dan berperang sebelum penaklukan mekah. Dengan kebajikan dan perjuangannya itu mereka lebih tinggi derajatnya daripada orang-orang yang menginfakkan sebagian hartanya dan berpe-rang setelah penaklukan kota mekah itu. Dan Allah menjanjikan kepada masing-masing mereka balasan yang lebih baik sesuai amal dan niat masing-masing. Dan Allah mahateliti terhadap apa yang kamu lakukan kapan dan di mana pun. Dia akan memberi balasan atasnya dengan setimpal. 11. Untuk mendorong agar manusia gemar bersedekah, Allah menetap-kan bahwa barang siapa meminjamkan kepada Allah dengan pinjaman yang baik, berupa kebajikan atau sedekah kepada orang lain, maka Allah akan mengembalikannya dengan jumlah yang berlipat ganda untuknya. Dan selain itu, baginya akan dikaruniakan pahala yang mulia dari Allah."
  }
]