[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "11. Siapa gerangan yang berkenan berinfak di jalan Allah dengan berharap pahala kepadaNya tanpa merasa berjasa dan menyakiti lalu Tuhannya melipatgandakan pahala dan balasannya, baginya balasan yang mulia, yaitu surga?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Barangsiapa yang mengeluarkan hartanya dengan sukarela untuk mencari wajah Allah, maka Allah akan memberinya pahala dari apa yang dikeluarkannya dengan berlipat ganda, dan baginya pada hari Kiamat pahala yang mulia, yaitu Surga."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "11. Allah memberi dorongan untuk berinfak demi menolong agama Allah: “Sungguh orang yang berinfak di jalan Allah, akan Allah lipatgandakan pahalanya, dan baginya balasan yang mulia di surga yang penuh dengan kenikmatan.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "11. مَّن ذَا الَّذِى يُقْرِضُ اللهَ قَرْضًا (Siapakah yang mau meminjamkan kepada Allah pinjaman) Yakni barangsiapa yang yang menginfakkan hartanya di jalan Allah maka ia seperti meminjamkannya kepada-Nya. حَسَنًا(yang baik) Yakni mengharap pahala dengan ketulusan hatinya, tanpa mengungkit-ungkit atau menyakiti hati orang lain. فَيُضٰعِفَهُۥ لَهُۥ وَلَهُۥٓ أَجْرٌ كَرِيمٌ (maka Allah akan melipat-gandakan (balasan) pinjaman itu untuknya) Yakni balasan surga. Dan penggandaan kebaikan ini adalah dengan menggandakannya sepuluh kali lipat sampai dengan tujuh ratus kali lipat, tergantung dari keadaan, sasaran, dan waktunya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Barang siapa yang menafkahkan hartanya di jalan Allah dengan baik tanpa mengharapkan pujian dan tanpa sakit hati, maka akan dilipatgandakan pahalanya dan baginya pahala yang agung di akhirat, yaitu surga."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Siapa yang memberi pinjaman kepada Allah} berinfak di jalan Allah {dengan pinjaman yang baik} infak dengan ikhlas dan baik bagi diri {Dia akan melipat gandakan untuknya} Dia akan memberinya pahala infaknya berlipaat-lipat {dan baginya imbalan yang sangat mulia"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11. Kemudian Allah menganjurkan untuk berinfak dijalanNya, sebab aktivitas jihad bergantung pada tersedianya dana serta harta untuk mempersiapkan jihad, seraya berfirman, “Barangsiapa meminjamkan kepada Allah dengan pinjaman yang baik,” yaitu infak yang baik yang diberikan secara ikhlas semata karena Allah dan demi mengharap ridhaNya yang berasal dari harta halal yang diberikan secara suka rela. Inilah di antara kemuliaan Allah yang menyebut infak dengan pinjaman, padahal harta yang dibelanjakan itu adalah harta Allah dan manusia pun milikNya. Allah menjanjikan pahala yang berlipat ganda padanya dan Dia-lah Yang Mahamulia lagi Maha Pemberi. Pahala yang dilipatgandakan tersebut berlaku di Hari Kiamat, yaitu suatu hari yang masing-masing orang terlihat dengan jelas kefakirannya yang amat memerlukan balasan baik meski sedikit."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Hadid ayat 11: Allah menganjurkan untuk berinfak di jalan-Nya; Dan menjelaskan yang barangsiapa yang menginfakkan harta di jalan Allah dengan berharap balasan atas harta yang dia telah habiskan di jalan Allah, dan siapa yang mengerjakan demikian berharap dengan balasan di sisi Allah, maka Allah akan memberikan balasan dengan balasan yang besar, dan Allah memiliki balasan yang lebih dari itu, yaitu dimasukkannya ke dalam surga-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala mendorong untuk berinfak di jalan-Nya, karena jihad membutuhkan infak dan pengorbanan harta. Yaitu dengan menginfakkan hartanya di jalan Allah. Dari sepuluh menjadi lebih dari tujuh ratus sebagaimana yang diterangkan di surah Al Baqarah: 261. Ini termasuk kemurahan Allah Subhaanahu wa Ta'aala, karena Dia menamainya pinjaman, padahal semua harta adalah milik-Nya dan semua hamba adalah hamba-Nya, namun Dia menyebutnya pinjaman dan menjanjikan ganti yang berlipat-ganda, sedangkan Dia Maha Pemurah lagi Maha Pemberi. Pelipatgandaan tersebut adalah pada hari Kiamat, hari dimana manusia tampak sekali kefakirannya dan butuh kepada balasan yang baik."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hadid Ayat 11",
    "description": "Untuk mendorong agar manusia gemar bersedekah, Allah menetap-kan bahwa barang siapa meminjamkan kepada Allah dengan pinjaman yang baik, berupa kebajikan atau sedekah kepada orang lain, maka Allah akan mengembalikannya dengan jumlah yang berlipat ganda untuknya. Dan selain itu, baginya akan dikaruniakan pahala yang mulia dari Allah. 12. Usai menerangkan fadilah berinfak di jalan Allah, melalui ayat berikut Allah menjelaskan balasan di akhirat bagi orang yang berinfak. Ingatlah pada hari ketika engkau akan melihat orang-orang yang beriman laki-laki dan perempuan di akhirat, betapa cahaya mereka yang terang bersinar di depan dan di samping kanan mereka sebagai balasan atas kebajikan dan kepatuhan mereka. Dikatakan kepada mereka, 'pada hari ini ada berita gembira untukmu. Allah menganugerahkan kepadamu surga-surga yang mengalir di bawahnya sungai-sungai dengan air, susu yang tidak berubah rasa, khamr yang lezat, dan madu. Mereka semua kekal di dalamnya. Demikian itulah anugerah dan kemenangan yang agung dari Allah. '."
  }
]