[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "12. Hari itu kamu melihat orang-orang beriman yang laki-laki dan perempuan, cahaya mereka bersinar di atas shirot di depan dan di kanan mereka sesuai dengan amal perbuatan mereka. Dikatakan kepada mereka, “Berbahagialah kalian dengan masuk surga yang luas, yang dibawah istana-istana dan pohon-pohonnya mengalir sungai-sungai, kalian tidak akan dikeluarkan darinya selamanya. Balasan tersebut adalah kemenangan besar bagi kalian di akhirat.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Pada hari di mana orang-orang lelaki dan perempuan yang beriman didahului oleh cahaya mereka di hadapan dan sebelah kanan mereka serta dikatakan kepada mereka pada hari itu, “Kabar gembira bagi kalian pada hari ini adalah surga-surga yang di bawah istana-istananya dan pepohonannya mengalir sungai-sungai, kalian menetap selamanya di dalamnya. Balasan itu adalah kemenangan besar yang tidak ada kemenangan lain yang menandinginya.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "12. Hai Rasulullah, pada kegelapan hari kiamat kamu akan melihat kaum mukminin dan mukminat memiliki cahaya yang membentang di depan dan sekitar mereka -berupa cahaya yang sesungguhnya- sesuai dengan kadar amal shalih mereka. Terdapat riwayat yang shahih dari Ibnu Mas’ud bahwa dia berkata, “Mereka akan diberi cahaya sesuai dengan kadar amalan mereka; ada dari mereka yang cahayanya sebesar gunung. Dan cahaya dari mereka yang paling kecil adalah yang hanya memiliki cahaya di atas jari jempol mereka, cahaya itu terkadang padam lalu menyala kembali.” (Diriwayatkan oleh al-Hakim dengan sanad hasan, dishahihkan dan disepakati oleh adz-Dzahabi dalam al-Mustadrak 2/478). Dan Rasulullah juga menjelaskan bahwa beliau mengenali mereka dari cahaya yang memancar di depan mereka. (Lihat: al-Mustadrak 2/478). Dan akan dikatakan kepada mereka: “Kabar gembira yang besar bagi kalian dalam setiap waktu yang akan kalian lewati, kalian akan memasuki surga-surga yang didalamnya terdapat sungai-sungai yang mengalir di bawah pepohonannya, dan kalian akan tinggal di sana selamanya. Kedudukan mulia ini merupakan kemenangan yang besar.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "12. يَسْعَىٰ نُورُهُم (sedang cahaya mereka bersinar) Makna (النور) yakni cahaya yang mereka lihat. بَيْنَ أَيْدِيهِمْ(di hadapan) Yakni ketika di atas sirath, pada hari kiamat. وَبِأَيْمٰنِهِم(dan di sebelah kanan mereka) Karena kitab catatan amal yang mereka terima. بُشْرَىٰكُمُ الْيَوْمَ جَنّٰتٌ تَجْرِى مِن تَحْتِهَا الْأَنْهٰرُ خٰلِدِينَ فِيهَا ۚ( “Pada hari ini ada berita gembira untukmu, (yaitu) surga yang mengalir di bawahnya sungai-sungai, yang kamu kekal di dalamnya) Dikatakan kepada mereka kalimat ini sebagai penghormatan bagi mereka. ذٰلِكَ(Itulah) Yakni berita gembira berupa surga dan kekekalan itu هُوَ الْفَوْزُ الْعَظِيمُ (keberuntungan yang besar)"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12. Wahai Nabi, saat hari kiamat kamu akan melihat orang-orang mukmin laki-laki dan perempuan yang jalannya disinari oleh cahaya keimanan dan amal shalih mereka yang merupakan sebab keberhasilan dan petunjuk mereka menuju surga. Para malaikat berkat kepada mereka: “Kabar gembira bagi kalian, yaitu surga-surga yang di bawah rumah-rumahnya mengalir sungai-sungai. Kalian menetap di dalamnya selama-lamanya” Cahaya dan kabar gembira tersebut adalah keberhasilan agung yang tidak ada taranya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Pada hari kamu akan melihat orang-orang mukmin laki-laki dan perempuan, cahaya mereka memancar di hadapan dan di sebelah kanan mereka. “Berita gembira kalian pada hari ini adalah surga yang mengalir di bawahnya sungai-sungai, dan mereka kekal di dalamnya. Demikian itulah kemenangan yang sangat agung”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "12. Allah berfirman seraya menjelaskan keutamaan iman serta keberuntungan para pemilik keimanan pada Hari KIamat sehingga yang lain merasa iri, “(Yaitu) pada hari ketika kamu melihat orang Mukmin laki-laki dan perempuan sedang cahaya mereka bersinar di hadapan dan disebelah karena mereka.” Maksudnya, ketika Hari KIamat terjadi, ketika matahari digulung, rembulan pun mengalami gerhana, manusia pun berada dalam kegelapan, shirath ditegakkan diatas Neraka Jahanam, pada hari itu orang-orang Mukmin, baik lelaki maupun perempuan terlihat cahayanya, cahaya mereka berjalan di hadapan di sebelah kanan mereka, mereka pun berjalan dengan cahaya di depan masing-masing orang berdasarkan keimanannya. Dan orang-orang yang beriman kala itu diberi kabar gembira besar seraya dikatakan “Pada hari ini ada berita gembira untukmu, (yaitu) surga yang mengalir di bawahnya sungai-sungai, yang kamu kekal di dalamnya. Itulah keberuntungan yang besar.” Demi Allah, alangkah bergembiranya hati mereka dengan kabar gembira ini dan alangkah nikmat terasa dalam diri mereka, karena mereka memperoleh segala yang diminta dan selamat dari segala keburukan dan semua yang ditakutkan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Hadid ayat 12: Allah menyebutkan manusia yang melihat di hari kebangkitan, yaitu hari ketika manusia melihat keadaan orang-orang yang beriman, yang bertakwa pada hari kiamat dan mereka menyeberangi jembatan; Cahaya-cahaya orang-orang beriman mendahului diri mereka di depan mereka dan di sisi kanan mereka, kemudia malaikat menerima mereka dan berkata : Kabar gembira bagi kalian, yang kalian akan memasuki surga yang luas, yang di bawah pohon dan istananya mengalir sungai-sungai, mereka tidak keluar di dalamnya selamanya, itulah balasan yang layak atas kuasa Allah dengan kemenangan yang besar bagi kalian di akhirat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala menerangkan keutamaan iman dan betapa orang-orang yang memiliknya sangat senang sekali memilikinya pada hari Kiamat. Pada hari Kiamat, ketika matahari digulung dan bulan diredupkan cahayanya sedangkan manusia berada dalam kegelapan, dan jembatan telah dibentangkan di atas neraka Jahanam, maka ketika itu engkau akan melihat orang-orang mukmin laki-laki dan perempuan bersinar cahayanya di depan dan di sebelah kanan mereka, lalu mereka berjalan dengan cahaya mereka pada tempat yang sungguh menegangkan itu. Masing-masing mendapatkan cahaya sesuai kadar keimanannya, dan ketika itu mereka diberi kabar gembira dengan kabar gembira yang paling besar. Demi Allah, sungguh manis kabar gembira ini di hati mereka dan sungguh nikmat dalam diri mereka, karena mereka mendapatkan semua yang diinginkan dan selamat dari keburukan dan apa yang ditakuti."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hadid Ayat 12",
    "description": "Usai menerangkan fadilah berinfak di jalan Allah, melalui ayat berikut Allah menjelaskan balasan di akhirat bagi orang yang berinfak. Ingatlah pada hari ketika engkau akan melihat orang-orang yang beriman laki-laki dan perempuan di akhirat, betapa cahaya mereka yang terang bersinar di depan dan di samping kanan mereka sebagai balasan atas kebajikan dan kepatuhan mereka. Dikatakan kepada mereka, 'pada hari ini ada berita gembira untukmu. Allah menganugerahkan kepadamu surga-surga yang mengalir di bawahnya sungai-sungai dengan air, susu yang tidak berubah rasa, khamr yang lezat, dan madu. Mereka semua kekal di dalamnya. Demikian itulah anugerah dan kemenangan yang agung dari Allah. '13. Balasan bagi orang yang memberi Allah pinjaman yang baik juga akan terlihat pada hari ketika orang-orang munafik laki-laki dan perempuan berkata kepada orang-orang yang beriman, 'tunggulah dan jangan tinggalkan kami! kami ingin mengambil cahayamu untuk menerangi kami. ' dikatakan kepada mereka dengan nada mengejak, 'kembalilah kamu ke belakang dan carilah sendiri cahaya yang menyinari dirimu. ' lalu di antara mereka dipasang dinding pemisah yang berpintu. Di sebelah dalam dinding itu ada rahmat dan anugerah bagi orang yang beriman dan beramal saleh, dan di luarnya hanya ada azab dan hukuman bagi orang munafik."
  }
]