[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "13. Hari itu orang-orang munafik laki-laki dan wanita berkata kepada orang-orang beriman saat mereka di atas ash-Shirath, “Tunggulah kami, kami mendapatkan penerangan dari cahaya kalian.” Para malaikat menjawab mereka dengan nada menghina mereka, “Mundurlah kalian ke belakang dan carilah cahaya.” Lalu mereka dipisahkan oleh sebuah pagar yang berpintu, bagian dalamnya dari arah orang-orang beriman ada rahmatnya, dan bagian luarnya dari arah orang-orang munafik ada azab."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "13. Pada hari di mana orang-orang munafik laki-laki dan perempuan berkata kepada orang-orang yang beriman kepada Allah dan Rasul-Nya, “Tunggulah kami -wahai orang-orang yang beriman laki-laki dan perempuan- agar kami bisa mendapatkan sebagian dari cahaya kalian yang bisa membantu kami untuk melewati titian ini.” Maka dikatakan kepada orang-orang muanfik itu dalam bentuk hinaan terhadap mereka, “Kembalilah ke belakang dan carilah cahaya yang bisa kalian jadikan penerang.” Lalu dibuatlah pagar pembatas yang mempunyai pintu di antara mereka, di bagian dalamnya ke arah orang-orang yang beriman terdapat rahmat, dan bagian luarnya ke arah orang-orang munafik terdapat siksa."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "13. Orang-orang munafik mencari penerangan dari cahaya orang-orang beriman ketika dalam kegelapan hari kiamat; mereka menyeru orang-orang beriman dan meminta sedikit cahaya mereka, namun mereka ditolak dengan terhina: “Kembalilah kalian ke dunia dan carilah cahaya sendiri.” Kemudian dihadirkan pemisah berpintu yang memisahkan antara orang-orang munafik dengan orang-orang beriman, bagian dalam pemisah itu berada di sisi orang-orang beriman, di dalamnya terdapat rahmat berupa kenikmatan surga; sedangkan bagian luarnya berada di sisi orang-orang munafik, di sana terdapat neraka Jahannam."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "13. انظُرُونَا (“Tunggulah kami) Mereka mengatakan ini karena melihat orang-orang beriman mendahului mereka menuju surga dengan cahaya yang menerangi mereka. نَقْتَبِسْ مِن نُّورِكُمْ(upaya kami dapat mengambil sebahagian dari cahayamu”) Yakni agar kami dapat ikut memanfaatkan cahaya itu. قِيلَ ارْجِعُوا۟ وَرَآءَكُمْ(Dikatakan (kepada mereka): “Kembalilah kamu ke belakang) Yakni kembalilah ke dunia. فَالْتَمِسُوا۟ نُورًا(dan carilah sendiri cahaya (untukmu)”) Dengan beriman dan beramal shalih. فَضُرِبَ بَيْنَهُم بِسُورٍ لَّهُۥ بَابٌۢ بَاطِنُهُۥ فِيهِ الرَّحْمَةُ(Lalu diadakan di antara mereka dinding yang mempunyai pintu. Di sebelah dalamnya ada rahmat) Yakni dibalik dinding tersebut, yaitu dinding yang di sebelah para penghuni surga, di sana terdapat rahmat berupa berbagai kenikmatan surga. وَظٰهِرُهُۥ(dan di sebelah luarnya) Yakni di sebelah para penghuni neraka. مِن قِبَلِهِ الْعَذَابُ(dari situ ada siksa) Yakni di sana terdapat azab neraka Jahannam."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13. Pada hari kiamat, orang-orang munafik sekaligus kafir berkata kepada orang-orang mukmin saat mereka bergegas menuju surga: “Tunggulah kami, kami minta penerangan cahaya kalian” Lalu dikatakan kepada mereka dengan mengolok-olok mereka: “Kembalilah kalian ke dunia dan carilah cahaya lainnya.” Diadakan antara mereka itu suatu dinding yang memiliki pintu. Di bagian dalamnya adalah golongan orang-orang mukmin yang mendapatkan rahmat berupa nikmat surga, sedangkan bagian luar adalah golongan orang munafik yang mendapatkan azab neraka Jahanam."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Pada hari, orang-orang munafik laki-laki dan perempuan berkata kepada orang-orang yang beriman,“Tunggulah kami} tunggulah kami {Kami ingin mengambil} Kami ingin mengambil {cahaya kalian” Dikatakan,“Kembalilah kamu ke belakang dan carilah} carilah {cahaya” Lalu di antara mereka dipasang} lalu disekatkan di antara orang-orang mukmin dan orang-orang munafir {dinding} pemisah yang menjulang tinggi {yang memiliki pintu di bagian dalamnya} dalamnya {di dalamnya ada rahmat dan di luarnya} di bagian luarnya {dari arahnya} dari arahnya {ada azab"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "13. Pada saat orang-orang munafik melihat orang-orang Mukmin berjalan dengan cahaya mereka, di mana cahaya orang-orang munafik kala itu padam dan mereka berada dalam kegelapan dan kebimbangan, mereka berkata pada orang-orang yang beriman, “Tunggulah kami supaya kami dapat mengambil sebagian dari cahayamu,” maksudnya, berjalanlah pelan-pelan dan tunggulah kami agar kami sedikit memperoleh cahaya kalian supaya dapat kami jadikan lentera untuk berjalan di dalam kegelapan dan agar kami selamat dari siksaan. “Dikatakan (kepada mereka), ‘Kembalilah kamu ke belakang dan carilah sendiri cahaya (untukmu)’” maksudnya, jika memang hal itu mungkin, padahal sebenarnya tidak mungkin dan mustahil. “Lalu diadakan di antara mereka dinding,” yaitu dinding yang menghalangi serta benteng yang menjaga, “yang mempunyai pintu. Di sebelah dalamnya ada rahmat dan di sebelah luarnya dari situ ada siksa.” Siksa itulah yang menyertai kaum munafik."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Hadid ayat 13: Ingatlah wahai manusia, pada hari orang-orang munafik yang menampakkan islam dan menyembunyikan kekafiran berkata kepada orang-orang beriman yang mereka (orang-orang beriman sedang di atas jembatan) dengan memelas dan menghinakan diri mereka : Berikan kami jalan, hingga kami dapat mengikuti kalian dan jalan kami dapat kebagian dari cahaya kalian. Maka berkatalah malaikat kepada mereka dengan penghinaan : Kembalilah kalian menuju dunia dan beramal lah dengan amalan shalih agar kalian dapat memperoleh cahaya semisal dengan ini, akan tetapi sungguh sangat jauh…jauh, karena pada hari ini dipisahkan antara orang-orang yang beriman dan munafik dengan penghalang (dinding) yang memiliki pintu, yang di dalamnya terdapat orang-orang yang beriman yang dirahmati yaitu di dalam surga. Dan yang nampak dari orang-orang munafik adalah adzab yaitu di dalam neraka yang mereka diadzab."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ketika itu cahaya orang-orang munafik padam dan mereka berada dalam kegelapan sambil merasa heran, sedangkan mereka melihat cahaya orang-orang mukmin tetap bersinar dan mereka berjalan dengannya, maka mereka berkata kepada orang-orang mukmin seperti yang disebutkan dalam ayat di atas. Agar kami dapat selamat dari azab. Yaitu yang berada dekat orang-orang mukmin. Yaitu yang dekat dengan orang-orang munafik."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hadid Ayat 13",
    "description": "Balasan bagi orang yang memberi Allah pinjaman yang baik juga akan terlihat pada hari ketika orang-orang munafik laki-laki dan perempuan berkata kepada orang-orang yang beriman, 'tunggulah dan jangan tinggalkan kami! kami ingin mengambil cahayamu untuk menerangi kami. ' dikatakan kepada mereka dengan nada mengejak, 'kembalilah kamu ke belakang dan carilah sendiri cahaya yang menyinari dirimu. ' lalu di antara mereka dipasang dinding pemisah yang berpintu. Di sebelah dalam dinding itu ada rahmat dan anugerah bagi orang yang beriman dan beramal saleh, dan di luarnya hanya ada azab dan hukuman bagi orang munafik. 14. Begitu mendapati azab, orang-orang munafik memanggil orang-orang mukmin, 'bukankah kami di dunia dahulu bersama kamu'' mereka yang beriman menjawab, 'benar, tetapi kamu selalu mencelakakan dirimu sendiri dengan melakukan perbuatan yang tidak patut dan hanya menunggu kehancuran kami dengan pengkhianatanmu, dan kamu meragukan janji Allah dan seringkali kamu ditipu oleh angan-angan kosong sampai pada akhirnya datanglah ketetapan Allah; dan setan penipu datang memperdaya kamu tentang Allah sehingga kamu terus berada dalam keraguan."
  }
]