[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "14. Orang-orang munafik memanggil orang-orang Mukmin, “Bukankah kami bersama kalian di dunia, kami menjalankan syiar-syiar agama seperti kalian?” orang-orang Mukmin menjawab, “Benar, kalian bersama kami secara lahir, tetapi kalian membinasakan diri kalian dengan kemunafikan dan kemaksiatan, kalian mengharapkan kematian bagi Nabi dan malapetaka bagi orang-orang beriman, kalian meragukan kebangkitan sesudah kematian, kalian ditipu oleh angan-angan batil kalian, kalian terus demikian hingga kematian datang kepada kalian, dan setan menipu kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Orang-orang munafik memanggil orang-orang yang beriman, sambil berkata, “Bukankah kami pernah bersama kalian dalam keimanan dan ketaatan?” Orang-orang yang beriman menjawab, “Betul, kalian pernah bersama kami, akan tetapi kalian telah mencelakai diri kalian sendiri dengan melakukan kemunafikan sehingga kalian membinasakan diri kalian sendiri, dan kalian menunggu orang-orang yang beriman dikalahkan lalu kalian mulai mengumumkan kekufuran kalian, serta kalian ragu-ragu terhadap pertolongan Allah kepada orang-orang yang beriman dan ragu terhadap kebangkitan setelah kematian, dan kalian tertipu oleh angan-angan hampa sehingga datang kematian menjemput kalian sedang kalian tetap dalam kondisi itu, dan setan telah menipu kalian terhadap Allah.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "14. Orang-orang munafik itu berteriak: “Bukankah kami dahulu di dunia bersama kalian menjalankan ajaran-ajaran Islam?” Maka orang-orang beriman menjawab: “Benar, namun kalian bersama kami secara dhahir saja, akan tetapi kalian menghancurkan diri kalian sendiri dengan kemunafikan, meragukan perkara-perkara dalam agama, tertipu oleh angan-angan batil, serta kalian berharap agar orang-orang beriman tertimpa musibah. Hal ini kalian lakukan hingga kalian meninggal, dan kalian tertipu oleh setan dengan menghiasi kepada kalian perbuatan kekafiran dan kemaksiatan.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "14. يُنَادُونَهُمْ أَلَمْ نَكُن مَّعَكُمْ ۖ (Orang-orang munafik itu memanggil mereka (orang-orang mukmin) seraya berkata: “Bukankah kami dahulu bersama-sama dengan kamu?”) Yakni orang-orang munafik memanggil orang-orang beriman: “Bukankah kami dahulu seperti kalian juga, kami shalat di masjid seperti shalat kalian dan menjalankan tuntunan agama Islam sebagaimana kalian menjalankannya?” قَالُوا۟ بَلَىٰ( Mereka menjawab: “Benar) Yakni “memang kalian secara kasat mata memang seperti kami. وَلٰكِنَّكُمْ فَتَنتُمْ أَنفُسَكُمْ(tetapi kamu mencelakakan dirimu sendiri) Dengan kemunafikan dan menyembunyikan kekafiran dalam hati kalian, sehingga kalian binasa karenanya, atau karena hawa nafsu dan syahwat kalian. وَتَرَبَّصْتُمْ(dan menunggu (kehancuran kami)) Yakni kalian menanti musibah menimpa Rasulullah dan orang-orang beriman. Pendapat lain mengatakan: yakni dan kalian menunda-nunda taubat. وَارْتَبْتُمْ(dan kamu ragu-ragu) Yakni kalian meragukan urusan agama dan tidak mempercayai al-Qur’an yang diturunkan, serta tidak beriman kepada mukjizat-mukjizat yang jelas kebenarannya. وَغَرَّتْكُمُ الْأَمَانِىُّ(serta ditipu oleh angan-angan kosong) yakni keinginan palsu atau angan kosong, yang diantaranya adalah penantian kalian terhadap musibah yang menimpa kami. حَتَّىٰ جَآءَ أَمْرُ اللهِ(sehingga datanglah ketetapan Allah) Yakni datang kematian. Qatadah berpendapat: yakni datang saat mereka dilempar ke dalam neraka. وغركم بالله الغرور (dan kalian telah ditipu terhadap Allah oleh yang amat penipu) Yakni setan menipu kalian, sehingga kalian tidak mengagungkan Allah dengan sebenar-benarnya dan kalian tidak mengetahui kuasa-Nya atas kalian, sehingga kalian mengira Allah tidak mengetahui kebanyakan perbuatan kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14. Orang-orang munafik itu memanggil-manggil orang-orang mukmin dengan berkata: “Bukankah di dunia kami bersama kalian masuk Islam dan melakukan ketaatan” maknanya (hanya bagian luarnya saja). Mereka menjawab: “Betul, kalian bersama kami pada bagian luar kalian saja, namun kalian menempatkan diri kalian dalam penderitaan, menghancurkannya dengan berbuat maksiat, menunggu untuk melakukan tipu daya kepada orang-orang mukmin, meragukan perintah agama (Islam, hari kebangkitan dan keimanan kepada Nabi SAW), dikelabui oleh harta benda yang bathil dengan meninggalkan islam dan sangat rakus terhadap kepalsuan sampai datanglah perintah Allah untuk mematikan kalian, namun kalian dikelabui oleh setan untuk tidak beriman kepada Allah dan dikelabui dengan keberhasilan yang berupa azab.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang (munafik) memanggil mereka} orang-orang munafik memanggil orang-orang mukmin {“Bukankah kami dahulu bersama kalian” Mereka menjawab,“Benar, tetapi kalian mencelakakan diri kalian sendiri} Kalian membinasakan diri kalian dengan berbuat kemunafikan {menunggu-nunggu} dan kalian menunggu kematian nabi Muhammad SAW dan giliran orang-orang mukmin {meragukan} kalian meragukan kebangkitan setelah kematian {dan ditipu oleh angan-angan kosong} kalian ditipu harapan-harapan palsu {sampai datang ketetapan Allah} kematian {penipu} setan {memperdayakan kalian terhadap Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "14. Orang-orang munafik pun memanggil-manggil orang-orang yang beriman, mereka berkata dengan suara rendah dan meminta belas kasih, “Bukankah kami dahulu bersama-sama dengan kamu,” ketika di dunia kami mengucapkan “Tidak ada sesembahan yang berhak disembah melainkan Allah, kami juga shalat, puasa dan mengerajakn amal seperti halnya kalian?” “Mereka menjawab, ‘Benar’,” kalian bersama-sama kami ketika di dunia dan kalian juga mengerjakan amalan secara zahir seperti yang kami lakukan, hanya saja amalan kalian adalah amalan orang-orang munafik tanpa didasari iman dan niat tulus serta baik, “tetapi kamu mencelakakan dirimu sendiri dan menunggu (kehancuran kami) dan kamu ragu-ragu,” kalian meragukan berita Allah yang seharusnya tidak diragukan, karena “kalian ditipu oleh angan-angan kosong” yang batil, dimana kalian hanya mengkhayalkan meraih apa yang diraih oleh orang-orang Mukmin padahal kalian tidak yakin, “sehingga datanglah ketentuan Allah,” hingga kematian pun menjemput kalian sedangkan kalian masih tetap berada dalam situasi tercela seperti itu, “dan kamu telah ditipu terhadap Allah oleh (setan) yang amat penipu.” Yaitu setan yang menghiasi kekufuran dan keraguan pada kalian sehingga kalian merasa aman dan kalian pun percaya pada janji setan dan membenarkan kabar yang disampaikan setan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Hadid ayat 14: Ingatlah wahai manusia, pada hari orang-orang munafik yang menampakkan islam dan menyembunyikan kekafiran berkata kepada orang-orang beriman yang mereka (orang-orang beriman sedang di atas jembatan) dengan memelas dan menghinakan diri mereka : Berikan kami jalan, hingga kami dapat mengikuti kalian dan jalan kami dapat kebagian dari cahaya kalian. Maka berkatalah malaikat kepada mereka dengan penghinaan : Kembalilah kalian menuju dunia dan beramal lah dengan amalan shalih agar kalian dapat memperoleh cahaya semisal dengan ini, akan tetapi sungguh sangat jauh…jauh, karena pada hari ini dipisahkan antara orang-orang yang beriman dan munafik dengan penghalang (dinding) yang memiliki pintu, yang di dalamnya terdapat orang-orang yang beriman yang dirahmati yaitu di dalam surga. Dan yang nampak dari orang-orang munafik adalah adzab yaitu di dalam neraka yang mereka diadzab."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni di dunia, kami sama seperti kamu mengucapkan Laailaahaillallah, kami shalat, kami puasa dan beramal seperti amal kamu? Ya, benar secara zhahir amalmu sama seperti amal kami, akan tetapi amalmu adalah amal orang-orang munafik yang tidak didasari iman dan niat yang benar. Dengan berbuat munafik. Bahwa kamu akan mendapatkan seperti yang didapatkan kaum mukmin, namun kamu tidak yakin. Yaitu kematian, sedangkan kamu dalam keadaan seperti itu. Setan telah menghias kekafiran dan keragu-raguan kepada kamu, lalu kamu merasa tenang dengannya dan kamu percayai janjinya yang dusta dan membenarkan beritanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hadid Ayat 14",
    "description": "Begitu mendapati azab, orang-orang munafik memanggil orang-orang mukmin, 'bukankah kami di dunia dahulu bersama kamu'' mereka yang beriman menjawab, 'benar, tetapi kamu selalu mencelakakan dirimu sendiri dengan melakukan perbuatan yang tidak patut dan hanya menunggu kehancuran kami dengan pengkhianatanmu, dan kamu meragukan janji Allah dan seringkali kamu ditipu oleh angan-angan kosong sampai pada akhirnya datanglah ketetapan Allah; dan setan penipu datang memperdaya kamu tentang Allah sehingga kamu terus berada dalam keraguan. 15. Wahai orang munafik, karena keraguanmu kepada Allah dan janji-Nya, maka pada hari ini, yaitu di akhirat, tidak akan diterima tebusan dari kamu maupun dari orang-orang kafir. Karena sikapmu itu maka tempat kamu yang sesuai adalah di neraka. Itulah tempat berlindungmu untuk selama-lamanya, dan itulah seburuk-buruk tempat kembali bagi orang yang ingkar. '."
  }
]