[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "15. Hari ini tidak diterima tebusan dari seorang pun dari kalian (wahai orang-orang munafik) untuk menebus dirinya dari azab Allah, tidak pula dari orang-orang yang kafir kepada Allah dan RasulNya. Tempat kembali kalian semuanya adalah api neraka, ia memang pantas bagi kalian, dan itu adalah seburuk-buruk tempat kembali.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Maka pada hari ini tidak diterima tebusan kalian -wahai orang-orang munafik- dari siksa Allah, dan tidak diterima tebusan dari orang-orang yang kafir terhadap Allah dengan terang-terangan. Tempat kembali kalian dan orang-orang kafir adalah Neraka, itu lebih cocok untuk kalian dan kalian lebih cocok di Neraka, sungguh Neraka itu adalah seburuk-buruk tempat kembali."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "15. Pada hari yang sulit ini tidak diterima harta tebusan dari kalian -hai orang-orang munafik- dan tidak pula dari orang-orang kafir. Tempat kalian semua adalah neraka Jahannam, sungguh itulah seburuk-buruk tempat kembali dan tempat tinggal."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15. فَالْيَوْمَ لَا يُؤْخَذُ مِنكُمْ فِدْيَةٌ (Maka pada hari ini tidak diterima tebusan dari kamu) Yang dapat menebus diri kalian dari neraka, hai orang-orang munafik. وَلَا مِنَ الَّذِينَ كَفَرُوا۟ ۚ( dan tidak pula dari orang-orang kafir) Yakni kafir kepada Allah lahir dan batin. مَأْوَىٰكُمُ النَّارُ ۖ( Tempat kamu ialah neraka) Yakni tempat kembali kalian adalah neraka. هِىَ مَوْلَىٰكُمْ ۖ( Dialah tempat berlindungmu) Yakni tempat itu lebih pantas bagi kalian. وَبِئْسَ الْمَصِيرُ(Dan dia adalah sejahat-jahat tempat kembali”) Yakni seburuk-buruk tempat kembali adalah neraka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "15. Wahai orang-orang munafik, pada hari itu tidak diterima tebusan yang kalian gunakan untuk menebus diri kalian dari neraka, hal itu tidak juga berlaku bagi orang-orang yang ingkar bagian luar dan dalamnya. Tempat kalian di neraka. Itu lebih baik bagi kalian atau kalian harapkan dengan mengolok-olok (nabi). Seburuk-buruk tempat kembali adalah neraka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Pada hari ini tidak akan diterima tebusan} pengganti dari azab Allah {dari kalian dan tidak pula dari orang-orang yang ingkar. Tempat kalian} tempat kembali kalian {adalah neraka. Itu adalah tempat berlindung kalian} tempat yang pantas bagi kalian {dan seburuk-buruk tempat kembali”} tempat kembali"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "15. “Maka pada hari ini tidak diterima tebusan dari kamu dan tidak pula dari orang-orang kafir.” Andaikan kalian menebus dengan emas sepenuh bumi dan sepertinya juga, tentu tidak akan diterima. “Tempat kamu ialah Neraka.” Maksudnya, tempat tinggal kalian. “Ialah tempat berlindungmu.” Yang meladeni dan mengitari kalian, “dan ia adalah seburuk-buruk tempat kembali,” yaitu neraka. Allah berfirman : “Dan adapun orang-orang yang ringan timbangan (kebaikan)nya, maka tempat kembalinya adalah neraka Hawiyah.Tahukah kamu apakah neraka Hawiyah itu? (Yaitu) api yang sangat panas.” -Al-Qariah:8-11-"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Hadid ayat 15: Ketahuilah wahai orang-orang munafik pada hari yang mengerikan ini, tidaklah diterima kalian sampai datang adzab pada diri-diri kalian, walaupun kalian mencoba melindungi diri kalian sebagaimana di dunia, dengan lari dll.; Tidak akan bermanfaat bagi kalian dan tidaklah diterima, tidak yang kalian nampakkan maupun sembunyikan dari kekufuran terhadap Allah. Ketahuilah bahwa tempat kalian yang kalian saling tolong menolong di dunia adalah neraka, neraka itu layak bagi kalian yang buruk, dan seburuk-buruknya tempat kalian kembali."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Meskipun kamu menebus dirimu dengan emas sepenuh bumi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hadid Ayat 15",
    "description": "Wahai orang munafik, karena keraguanmu kepada Allah dan janji-Nya, maka pada hari ini, yaitu di akhirat, tidak akan diterima tebusan dari kamu maupun dari orang-orang kafir. Karena sikapmu itu maka tempat kamu yang sesuai adalah di neraka. Itulah tempat berlindungmu untuk selama-lamanya, dan itulah seburuk-buruk tempat kembali bagi orang yang ingkar. '16. Usai menjelaskan balasan bagi orang munafik dan kafir, pada ayat ini Allah memberi teguran kepada orang mukmin yang lalai pada ibadahnya. Belum tibakah waktunya bagi orang-orang yang beriman, yaitu mereka yang tidak meragukan janji Allah, untuk secara khusyuk mengingat Allah dengan berzikir dan beribadah, dan mematuhi kebenaran Al-Qur'an yang telah diwahyukan kepada mereka' dan janganlah mereka berperilaku seperti orang-orang yang telah menerima kitab sebelum itu, di mana sebagia dari mereka mengingkari hukumnya dan sebagian yang lain menyembunyikan atau mengubah isinya, kemudian mereka melalui masa yang panjang tanpa adanya rasul yang mengingatkan mereka se-hingga pada akhirnya hati mereka menjadi keras. Dan banyak di antara mereka menjadi orang-orang fasik karena tidak ada yang mengingatkan kekeliruannya."
  }
]