[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "16. Apakah belum saatnya bagi orang-orang yang membenarkan Allah dan RasulNya dan mengikuti petunjuknya untuk melunakkan hati mereka manakala berdzikir (mengingat dan menyebut) Allah dan mendengar Al-Quran? Janganlah mereka seperti orang-orang yang diberi kitab sebelum mereka (yaitu orang-orang Yahudi dan Nasrani) dalam kerasnya hati, yaitu orang-orang yang masa berlalu panjang bagi mereka lalu mereka merubah Firman Allah, hingga hati mereka mengeras dan kebanyakan dari mereka keluar dari ketaatan kepada Allah. Ayat ini mendorong kelembutan hati dan kekhusyu’an kepada Allah saat mendengar kitab (al-Quran) dan as-Sunnah yang dibacakan, serta berhati-hati dari sikap menyerupakan diri dengan orang-orang Yahudi dan Nasrani dalam kekerasan hati mereka dan kebengalan mereka dari ketaatan kepada Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Belum tibakah waktunya bagi orang-orang yang beriman kepada Allah dan Rasul-Nya untuk lembut dan tenang hati mereka karena mengingat Allah -Subḥānahu- dan karena janji serta ancaman yang diturunkan di dalam Al-Qur`ān. Janganlah mereka menjadi seperti orang-orang Yahudi yang diberi kitab Taurat dan orang-orang Nasrani yang diberi kitab Injil dalam hal kekerasan hati, lalu berlalu waktu yang panjang antara mereka dengan diutusnya para Rasul kepada mereka, sehingga hati mereka menjadi keras karenanya, dan banyak dari mereka yang keluar dari ketaatan kepada Allah menuju kemaksiatan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "16. Bukankah telah datang waktunya hati orang-orang beriman menjadi lembut ketika berzikir kepada Allah Yang Maha Agung dan mendengar ayat-ayat al-Qur’an, dan tidak seperti hati orang-orang Yahudi dan Nasrani yang telah jauh masa antara mereka dengan para nabi mereka, sehingga mereka mengubah firman Allah dan banyak dari mereka yang menyelisihi perintah Allah?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "16. أَلَمْ يَأْنِ لِلَّذِينَ ءَامَنُوٓا۟ أَن تَخْشَعَ قُلُوبُهُمْ (Belumkah datang waktunya bagi orang-orang yang beriman, untuk tunduk hati mereka) Yakni bukankah telah datang waktu hati mereka untuk tunduk? Al-Hasan mengatakan: Allah menganggap mereka terlalu lama, padahal mereka adalah makhluk yang paling Dia cintai. لِذِكْرِ اللهِ(mengingat Allah) Yakni seharusnya dengan mengingat Allah menjadikan hati mereka tunduk dan lembut; bukan seperti orang yang tidak berubah hatinya setelah berzikir. وَمَا نَزَلَ مِنَ الْحَقِّ(dan kepada kebenaran yang telah turun) Yakni al-Qur’an. وَلَا يَكُونُوا۟ كَالَّذِينَ أُوتُوا۟ الْكِتٰبَ مِن قَبْلُ(dan janganlah mereka seperti orang-orang yang sebelumnya telah diturunkan Al Kitab kepadanya) Yakni orang-orang Yahudi dan Nasrani yang diberi kitab Taurat dan Injil sebelum turunnya al-Qur’an. فَطَالَ عَلَيْهِمُ الْأَمَدُ(kemudian berlalulah masa yang panjang atas mereka) Yakni berlalu masa yang panjang setelah kepergian Nabi mereka. فَقَسَتْ قُلُوبُهُمْ ۖ( lalu hati mereka menjadi keras) Akibat hal tersebut, sehingga mereka tidak mendapat manfaat dari firman Allah yang mereka baca, dan Allah melarang umat nabi Muhammad menjadi seperti mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16. Apakah belum datang waktu bagi orang-orang yang beriman kepada Allah dan rasulNya untuk hatinya takut saat mengingat tentang hisab, nasehat dan tuntunan, dan apa yang diturunkan dalam Al-Qur’an? Mereka tidak seperti ahli kitab (orang-orang Yahudi dan Nasrani) sebelumnya. Jarak waktu antara mereka dengan para nabi mereka sangat panjang sehingga hati mereka kaku dan tidak lembut saat mengingat Allah. Kebanyakan dari mereka tidak menaati Allah SWT dan melewati batas-batas agamaNya. Ayat ini diturunkan untuk para sahabat yang bersenda gurau dan tertawa."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apakah belum tiba} belum tiba {bagi orang-orang yang beriman agar hati mereka khusyuk} tunduk dan tenang {mengingat Allah dan apa yang turun berupa kebenaran. Janganlah mereka seperti orang-orang yang telah diberi kitab sebelum itu, kemudian mereka melalui masa yang panjang} masa {sehingga hati mereka menjadi keras. Banyak di antara mereka adalah orang-orang fasik"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "16. Pada saat Allah menjelaskan kondisi orang-orang Mukmin dan Munafik di akhirat, baik lelaki maupun perempuan, hal itu menyerukan hati agar khusyu’ terhadap Rabbnya serta merasa rendah karena keagunganNya. Allah mencela seraya mendidik orang Mukmin karena tidak mengkhusyukan dan merendahkan hati di hadapan keagunganNya seraya berfirman, “Belumkah datang waktunya bagi orang-orang yang beriman, untuk tunduk hati mereka terhadap dzikrullah dan kepada kebenaran yang telah turun (kepada mereka),” maksudnya, apakah belum tiba waktunya bagi hati untuk melunak dan merasa khusyu’ terhadap dzikrullah, yaitu al-Quran, serta taat terhadap perintah-perintah dan laranganNya dan kebenaran byang diturunkan pada Muhammad. Dalam ayat ini terdapat dorongan untuk mengkhusyukan hati kepada Allah secara sungguh-sungguh, mengkhusuyukan hati terhadap al-Quran dan as-Sunnah serta mengingat petuah-petuah ilahiyah serta hukum-hukum syariat di setiap waktu serta mengintrospeksi diri untuk hal itu, “Dan janganlah mereka seperti orang-orang yang sebelumnya telah diturunkan al-Kitab kepadanya, kemudian berlallulah masa yang panjang atas mereka,” maksudnya, jangan menjadi seperti orang-orang yang diberi Kitab sebelumnya yang mengharuskan mereka untuk khusyu dan taat secara total, namun mereka tidak bisa menunaikannya dengan lama bahkan masa pun berlalu, kelalaian mereka berlanjut hingga keimanan dan keyakinan mereka lenyap, “lalu hati mereka menjadi keras. Dan kebanyakan di antara mereka adalah orang-orang yang fasik.” Hati setiap saat memerlukan peringatan al-Quran yang diturunkan Allah dan berbicara dengan hikmah, tidak sepatutnya lalai dari hal itu, karena lalai dari al-Quran dan berdzikir merupakan sebab kerasnya hati dan membekunya air mata."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Hadid ayat 16: Allah menujukan perkataan-Nya kepada hamba-Nya yang beriman yang tunduk terus menerus di atas ketaatan, Allah berkata : Belumkah datang waktu bagi orang-orang yang beriman kepada Allah dan membenarkan Rasulullah ﷺ dan mereka yang mengikuti hidaya yang lembut hati mereka dengan mengingat Allah dan mendengarkan ayat-ayat-Nya, mereka tidak sebagaimana kondisi orang-orang yahudi dan nashrani yang telah panjang masa bagi mereka kemudian mereka ganti firman-firman Allah dan hati mereka menjadi keras; Kebanyakan dari mereka keluar dari ketaatan kepada Allah, akan tetapi Allah mengecualikan di antara mereka yang terbaik yang mereka menjaga kemulian dirinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Menurut penyusun tafsir Al Jalaalain, bahwa ayat ini turun berkenaan dengan para sahabat yang terlalu banyak bercanda. Ketika Allah Subhaanahu wa Ta'aala menyebutkan keadaan kaum mukmin laki-laki dan perempuan serta keadaan kaum munafik laki-laki dan perempuan di akhirat, dimana hal tersebut mendorong hati untuk khusyu’ kepada Tuhannya dan tunduk kepada kebesaran-Nya, maka Allah Subhaanahu wa Ta'aala mencela kaum mukmin karena tidak seperti itu. Maksudnya, belumkah datang waktu bagi orang-orang yang beriman untuk lunak dan khusyu’ hati berdzikr mengingat Allah, yaitu dalam membaca Al Qur’an, tunduk kepada perintahnya dan menjauhi larangannya, serta kepada kebenaran yang dibawa Nabi Muhammad shallallahu 'alaihi wa sallam. Dalam ayat ini terdapat dorongan untuk berusaha menjadikan hati khusyu’ kepada Allah Subhaanahu wa Ta'aala dan kepada yang diturunkan-Nya berupa Al Qur’an dan As Sunnah, dan agar kaum mukmin dapat mengingat nasihat-nasihat ilahi dan hukum-hukum syar’i di setiap waktu serta menghisab diri mereka dengannya. Yakni janganlah mereka seperti orang-orang sebelum mereka dari kalangan Yahudi dan Nasrani yang telah Allah turunkan kepada mereka kitab yang mengharuskan mereka khusyu’ hatinya dan tunduk sikapnya, namun mereka malah tidak istiqamah di atasnya, bahkan masa yang panjang berlalu kepada mereka namun membuat mereka tetap lalai sehingga iman mereka sedikit demi sedikit terkikis. Tidak lunak ketika berdzikr kepada Allah Subhaanahu wa Ta'aala. Dengan demikian, hati terus-menerus butuh mengingat apa yang Allah turunkan dan tidak lalai terhadapnya, karena jika tidak demikian maka dapat menyebabkan hati menjadi keras."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hadid Ayat 16",
    "description": "Usai menjelaskan balasan bagi orang munafik dan kafir, pada ayat ini Allah memberi teguran kepada orang mukmin yang lalai pada ibadahnya. Belum tibakah waktunya bagi orang-orang yang beriman, yaitu mereka yang tidak meragukan janji Allah, untuk secara khusyuk mengingat Allah dengan berzikir dan beribadah, dan mematuhi kebenaran Al-Qur'an yang telah diwahyukan kepada mereka' dan janganlah mereka berperilaku seperti orang-orang yang telah menerima kitab sebelum itu, di mana sebagia dari mereka mengingkari hukumnya dan sebagian yang lain menyembunyikan atau mengubah isinya, kemudian mereka melalui masa yang panjang tanpa adanya rasul yang mengingatkan mereka se-hingga pada akhirnya hati mereka menjadi keras. Dan banyak di antara mereka menjadi orang-orang fasik karena tidak ada yang mengingatkan kekeliruannya. 17. Wahai orang yang beriman, ketahuilah bahwa Allah berkuasa menghidupkan bumi setelah mati dan kering-Nya dengan menurunkan hujan sehingga bumi menjadi subur dan menjadi media tumbuh tanaman. Sungguh, telah kami jelaskan kepadamu sebagian dari tanda-tanda kebesaran kami, baik yang ada di alam semesta atau pada dirimu sendiri, agar kamu mengerti."
  }
]