[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "17. Ketahuilah bahwa Allah menghidupkan bumi dengan hujan sesudah bumi itu mati, lalu bumi mengeluarkan tanamannya, maka demikian juga Allah Mahakuasa menghidupkan orang-orang mati di Hari Kiamat. Allah Mahakuasa melunakkan hati setelah sebelumnya keras. Sungguh Kami telah menjelaskan kepada kalian dalil-dalil (bukti-bukti) Kuasa Kami agar kalian merenungkannya lalu mengambil pelajaran."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Ketahuilah bahwa Allah menghidupkan bumi dengan menumbuhkan tumbuh-tumbuhan setelah sebelumnya kering. Kami telah terangkan kepada kalian -wahai manusia- dalil-dalil dan bukti-bukti tentang kekuasaan Allah dan keesaan-Nya agar kalian memikirkannya dan kalian mengerti bahwa yang menghidupkan bumi setelah kematiannya mampu untuk menghidupkan kalian setelah kematian kalian serta mampu menjadikan hati kalian lembut setelah sebelumnya keras."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "17. Hai para hamba, ketahuilah bahwa Allah Yang Menghidupkan tanah yang tandus dengan air hujan; dan seperti itulah hati menjadi hidup dan tentram dengan berzikir kepada Allah Yang Maha Agung dan mendengar ayat-ayat al-Qur’an."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "17. اعْلَمُوٓا۟ أَنَّ اللهَ يُحْىِ الْأَرْضَ بَعْدَ مَوْتِهَا ۚ (Ketahuilah olehmu bahwa sesungguhnya Allah menghidupkan bumi sesudah matinya) Dan Allah berkuasa untuk membangkitkan jasad setelah kematiannya, dan menghaluskan hari setelah menjadi keras."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17. Ketahuilah wahai orang-orang mukmin sesungguhnya Allah memberi kehidupan bumi dengan air dan tumbuh-tumbuhan setelah membuatnya gersang. Begitu juga Allah melakukan hal itu di dalam hati kalian. Allah melembutkan dan mengembalikannya untuk khusyu’ dalam berdzikir dan membaca Al-Qur’an. Sungguh Kami telah menjelaskan kepada kalian tentang ayat-ayat dan bukti-bukti yang menunjukkan pada kekuasaan Kami supaya kalian berpikir dan merenungi nasehat-nasehat ini serta mengetahui hal-hal positifnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketahuilah bahwa Allah menghidupkan bumi setelah matinya. Sungguh Kami telah menjelaskan kepada kalian tanda-tanda agar kalian mengerti"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17. “Ketahuilah olehmu bahwa sesungguhnya Allah menghidupkan bumi sesudah matinya. Sesungguhnya Kami telah menjelaskan kepadamu tanda-tanda kebesaran (Kami) supaya kamu memikirkannya.” Karena tanda-tanda kebesaran Allah menunjukkan akal pada perintah-perintah ilahiyah. Dzat yang kuasa menghidupkan bumi setelah sebelumnya mati juga kuasa menghidupkan orang-orang mati setelah meninggal dunia kemudian diberi balasan atas amal perbuatannya. Dzat yang menghidupkan bumi dengan air hujan setelah sebelumnya mati juga kuasa menghidupkan hati yang mati dengan kebenaran yang diturunkan oleh Allah kepada RasulNya. Ayat ini menunjukkan bahwa orang-orang yang tidak berakal adalah orang yang tidak bisa mendapatkan petunjuk dari tanda-tanda kebesaran Allah dan tidak tunduk pada peraturan-peraturan Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Hadid ayat 17: Ketahuilah wahai manusia, bahwa Allah menghidupkan bumi yang tandus, kering dan mati dengan turunnya hujan atasnya; Maka tumbuhlah tumbuh-tumbuhan hijau dan menyuburkannya, begitu juga Allah kuasa membangkitkan jasad-jasad setelah kematiannya, dan menghidupkannya untuk kali yang lain. Allah telah menjelaskan buki kepada manusia dengan bukti yang menunjukkan atas kesempurnaan kuasa-Nya dan ke-esaan-Nya agar mereka berpikir dan mentadabburi apa yang telah Allah turunkan di dalam Al Qur’an."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan menjadikannya menumbuhkan tumbuhan. Demikian juga Dia berbuat terhadap hatimu dengan mengembalikan hatimu kepada kekhusyu’an. Hal itu, karena ayat-ayat itu menunjukkan kepada akal terhadap tuntutan-tuntutan ilahi. Allah Subhaanahu wa Ta'aala yang menghidupkan bumi setelah matinya tentu mampu menghidupkan orang-orang yang telah mati setelah mereka mati, lalu Dia memberi balasan terhadap amal mereka. Demikian pula karena Dia yang menghidupkan bumi setelah matinya dengan air hujan, maka Dia mampu pula menghidupkan hati-hati yang telah mati dengan kebenaran yang Allah turunkan kepada Rasul-Nya. Ayat ini menunjukkan, bahwa tidak ada akal bagi orang yang tidak dapat mengambil petunjuk dari ayat-ayat Allah serta tidak tunduk kepada syariat-syariat Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hadid Ayat 17",
    "description": "Wahai orang yang beriman, ketahuilah bahwa Allah berkuasa menghidupkan bumi setelah mati dan kering-Nya dengan menurunkan hujan sehingga bumi menjadi subur dan menjadi media tumbuh tanaman. Sungguh, telah kami jelaskan kepadamu sebagian dari tanda-tanda kebesaran kami, baik yang ada di alam semesta atau pada dirimu sendiri, agar kamu mengerti. 18. Sesungguhnya orang-orang yang bersedekah dengan menginfakkan sebagian hartanya, baik laki-laki maupun perempuan, dan mereka dengan ikhlas meminjamkan kepada Allah dengan pinjaman yang baik, niscaya akan dilipatgandakan balasan kebaikan bagi mereka; dan mereka akan mendapat pahala yang mulia dari sisi-Nya."
  }
]