[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "18. Sesungguhnya orang-orang yang menyedekahkan harta mereka, baik laki-laki maupun perempuan, dan berinfak di jalan Allah dengan nafkah yang jiwa mereka penuh kerelaan dalam rangka mendapatkan ridha Allah, maka pahala hal itu dilipatgandakan bagi mereka, lebih dari itu, mereka akan mendapatkan pahala yang besar, yaitu surga."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Sesungguhnya orang-orang yang menafkahkan sebagian harta mereka, baik laki-laki maupun perempuan, dengan sukarela tanpa disertai dengan mengungkit-ungkit pemberiannya dan tidak menyakiti perasaan orang yang menerima, maka pahala amal perbuatan mereka dilipat gandakan; kebaikan dengan sepuluh kali lipatnya hingga tujuh ratus kali lipat, hingga berlipat-lipat, dan di samping itu mereka mendapatkan pahala yang baik di sisi Allah, yaitu Surga."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "18. Orang-orang yang menyedekahkan hartanya bagi orang-orang fakir demi mengharap keridhaan Allah, dan menyedekahkannya untuk menolong agama Allah; maka pahala mereka akan dilipatgandakan, dan mereka akan mendapat surga-surga yang penuh dengan kenikmatan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "18. إِنَّ الْمُصَّدِّقِينَ وَالْمُصَّدِّقٰتِ (Sesungguhnya orang-orang yang membenarkan (Allah dan Rasul-Nya) baik laki-laki maupun perempuan) Yakni laki-laki dan perempuan yang bersedekah. وَأَقْرَضُوا۟ اللهَ قَرْضًا حَسَنًا(dan meminjamkan kepada Allah pinjaman yang baik) Pinjaman yang baik yakni sedekah dan infak di jalan Allah dengan penuh keikhlasan dan niat yang lurus serta mengharapkan pahala. يُضٰعَفُ لَهُمْ(niscaya akan dilipatgandakan kepada mereka) Yakni pahala mereka. وَلَهُمْ أَجْرٌ كَرِيمٌ(dan bagi mereka pahala yang banyak) Yakni berupa surga. Dan penggandaan kebaikan ini adalah dengan menggandakannya sepuluh kali lipat sampai dengan tujuh ratus kali lipat, atau lebih banyak dari itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "18. Sesungguhnya laki-laki dan perempuan yang menyedekahkan harta mereka dan menafkahkannya di jalan Allah dengan ikhlas maka pahalanya atas amal perbuata itu akan dilipat gandakan. Bagi mereka pahala yang baik di sisi Allah SWT yaitu surga."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang yang bersedekah, baik laki-laki maupun perempuan} laki-laki yang bersedekah dan perempuan yang bersedekah {dan meminjami Allah pinjaman yang baik, maka akan dilipat gandakan bagi mereka. Dan bagi mereka itu ganjaran yang sangat mulia"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "18. “Sesungguhnya orang-orang yang bersedekah, baik laki-laki maupun perempuan,” dengan tasydid pada kata ‘Almushoddiqiina’ dan ‘Almushoddiqooti’ yakni orang-orang yang banyak bersedekah yang ditetapkan syariat dan memberikan nafkah yang baik, “dan meminjamkan kepada Allah pinjaman yang baik,” dengan cara membelanjakan harta mereka untuk kebaikan yang menjadi simpanan bagi mereka di sisi Rabb mereka, “niscaya akan dilipat gandakan” pahala kebaikan sepuluh kali lipat hingga tujuh ratus kali sampai tidak terhingga, “dan bagi mereka pahala yang mulia,” yakni pahala yang disediakan Allah bagi mereka di surga yang tidak diketahui oleh jiwa."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Hadid ayat 18: Kemudian Allah mengulang pujian kepada orang-orang yang membenarkan jalan Allah dan Allah janjikan dengan ganjaran berlipat, dan Allah jadikan pembenaran mereka yang seolah-olah mereka meminjamkan pinjaman kepada Allah, maka Allah berikan balasan di sisi-Nya. Allah berkata : Ketahuilah wahai manusia bahwa mereka yang membenarkan baik laki-laki maupun perempuan dengan harta-harta mereka, yang mereka telah infakkan di jalan Allah demi mencari wajah Allah; Berlipat-lipat ganjaran bagi mereka atas infak mereka, dan mereka memiliki balasan lebih dari infak mereka dengan balasan yang baik yaitu surga."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni orang-orang yang banyak bersedekah dan mengeluarkan infak yang diridhai. Yaitu dengan memberikan harta mereka ke jalan-jalan kebaikan yang menjadi simpanan bagi mereka di sisi Tuhan mereka. Satu kebaikan dilipat-gandakan menjadi sepuluh, lalu menjadi tujuh ratus dan menjadi kelipatan yang banyak melebihi itu. Yaitu yang Allah Subhaanahu wa Ta'aala siapkan untuk mereka di surga berupa kenikmatan yang tidak diketahui oleh jiwa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hadid Ayat 18",
    "description": "Sesungguhnya orang-orang yang bersedekah dengan menginfakkan sebagian hartanya, baik laki-laki maupun perempuan, dan mereka dengan ikhlas meminjamkan kepada Allah dengan pinjaman yang baik, niscaya akan dilipatgandakan balasan kebaikan bagi mereka; dan mereka akan mendapat pahala yang mulia dari sisi-Nya. 19. Dan orang-orang yang beriman dengan mantap kepada Allah dan rasul-rasul-Nya serta tidak meragukan janji-Nya, mereka itu orang-orang yang tulus hati dan pecinta kebenaran, dan mereka menjadi saksi-saksi di sisi tuhan mereka. Karena keimanan dan kebaikan itu mereka berhak mendapat pahala dan cahaya dari sisi Allah. Tetapi, orang-orang yang kafir dan mendustakan ayat-ayat kami serta mengingkari ajaran-ajaran kami, mereka itu penghuni-penghuni neraka. Mereka kekal di dalamnya."
  }
]