[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "19. Orang-orang yang beriman kepada Allah dan para rasulNya dan tidak membedakan seorang pun di antara mereka, mereka adalah orang-orang yang shiddiqin (jujur dalam iman) yang pembenaran mereka kepada apa yang dibawa oleh para rasul sempurna, mencakup keyakinan perkataan dan perbuatan, dan juga para syuhada di sisi Tuhan mereka mendapatkan pahala mereka yang besar di sisi Allah, cahaya mereka besar di Hari Kiamat. Dan orang-orang yang kafir dan mendustakan ayat-ayat dan hujjah-hujjah Kami, mereka adalah penduduk Neraka Jahim, tidak ada pahala dan cahaya bagi mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Dan orang-orang yang beriman kepada Allah dan beriman kepada rasul-Nya tanpa membedakan di antara mereka, merekalah orang-orang ṣiddiqīn. Dan orang-orang yang menjadi saksi di sisi Allah akan mendapatkan pahala yang baik yang telah disiapkan untuk mereka dan bagi mereka cahaya yang menuntun mereka dari arah depan dan dari sisi kanan mereka pada hari Kiamat. Sedang orang-orang yang kafir terhadap Allah dan para rasul-Nya serta mendustakan ayat-ayat Kami yang diturunkan kepada Rasul Kami, mereka adalah penghuni neraka Jahim, yang akan mereka masuki pada hari Kiamat, lalu kekal di dalamnya selamanya, tidak keluar darinya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "19. Dan orang-orang yang beriman kepada Allah dan mengakui keesaan-Nya dan risalah para rasul-Nya, maka mereka telah mencapai derajat para shiddiqin dan syuhada, mereka akan mendapat pahala yang berlimpah dan diberi cahaya yang besar pada hari kiamat. Sedangkan orang-orang kafir dan mendustakan ayat-ayat kauniyah dan qur’aniyah Kami, maka orang-orang yang jauh dari rahmat Allah itu akan selamanya di dalam neraka Jahannam."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "19. وَالَّذِينَ ءَامَنُوا۟ بِاللهِ وَرُسُلِهِۦٓ( Dan orang-orang yang beriman kepada Allah dan Rasul-Nya) Mereka semuanya. أُو۟لٰٓئِكَ هُمُ الصِّدِّيقُونَ ۖ( mereka itu orang-orang Shiddiqin) Mujahid mengatakan: semua yang beriman kepada Allah dan para rasul-Nya adalah orang yang shiddiq. Pendapat lain mengatakan mereka adalah orang-orang yang tidak meragukan rasul ketika mengabarkan suatu kabar kepada mereka, namun mereka mempercayainya secara penuh. وَالشُّهَدَآءُ عِندَ رَبِّهِمْ(dan orang-orang yang menjadi saksi di sisi Tuhan mereka) Mereka adalah orang-orang yang terbunuh di jalan Allah. Yakni mereka akan mendapatkan derajat yang tinggi di sisi Allah. لَهُمْ أَجْرُهُمْ وَنُورُهُمْ ۖ (Bagi mereka pahala dan cahaya mereka) Yakni kedua golongan, yaitu para shiddiqin dan syuhada’ akan mendapatkan pahala dan cahaya yang telah dijanjikan kepada mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19. Orang-orang yang beriman kepada Allah dan rasulNya dengan keimanan yanga sempurna, mereka adalah orang-orang yang melebih-lebihkan diri untuk beriman. Mereka juga memperbanyak kebenaran sehingga itu menjadi watak alami bagi mereka. Dan orang-orang yang mati syahid, yaitu orang yang terbunuh di jalan Allah, maka bagi mereka itu pahala yang telah dijanjikan dalam kitab Alah. Cahaya mereka, menyinari jalan mereka menuju surga. Sedangkan orang-orang yang berkumpul untuk mengingkari Allah dan rasulNya serta mendustakan ayat-ayatNya, mereka adalah penduduk neraka Jahanam yang mana mereka akan disiksa di dalamnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang beriman kepada Allah dan rasul-rasulNya mereka itulah yang sangat benar} orang-orang yang sempurna pembenaran mereka terhadap apa yang dibawa para rasul dengan meyakini, mengucapkan dan melaksakannya {dan orang-orang yang bersaksi} orang-orang yang bersaksi atas umat-umat sebelumnya {di sisi Tuhan mereka. Bagi mereka itu pahala dan cahaya mereka. Adapun orang-orang yang ingkar dan mendustakan ayat-ayat Kami itulah penghuni neraka Jahim (19)"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "19. “Dan orang-orang yang beriman kepada Allah dan RasulNya.” Iman menurut Ahlussunnah sebagaimana yang ditunjukkan oleh al-Quran dan as-Sunnah, adalah ucapan hati dan lisan serta amalan hati, lisan dan raga. Semua itu mencakup seluruh syariat agama baik yang lahir maupun yang batin. Orang-orang yang melakukan semua hal ini “mereka itu orang-orang yang Shiddiqin,” yaitu orang-orang yang tingkatnya di atas orang-orang Mukmin secara umum dan berada di bawah tingkatan para nabi. Firman Allah “Dan orang-orang yang menjadi saksi di sisi Rabb mereka. Bagi mereka pahala dan cahaya mereka,” Sebsagsimsns disebutkan dalam hadits shohih “bahwasanya di surge itu ada 100 tingkatan, dan jarak antara setiap tingkatan adalah seperti jarak antara langit dan bumi, dan Allah menyiapkannya untuk para mujahid di jalan Allah” hal ini menunjukan begitu tinggi kedudukan mereka dan begitu dekatnya mereka dengan Allah. “Dan orang-orang yang kafir dan mendustakan ayat-ayat Kami, mereka itulah penghuni-penghuni neraka.” Ayat-ayat ini merangkum tingakatan-tingkatan manusia yaitu; orang-orang yang gemar bersedekah, orang-orang yang membenarkan, para syuhada dan para penghuni Neraka Jahim. Orang-orang yang gemar bersedekah, amal terbesar mereka adalah berbuat baik terhadap sesame serta mencurahkan segala sesuatu yang berguna bagi mereka, khususnya dalam membelanjakan harta di jalan Allah. Sedangkan orang-orang yang benar (Shiddiqun) adalah mereka yang menyempurnakan tingkatan-tingkatan iman, amal shalih, ilmu yang berguna dan keyakinan tulus. Para syuhada adalah mereka yang berjuang di jalan Allah untuk menjunjung tinggi kalimat Allah, mereka mencurahkan harta dan jiwa raga untuk berperang. Dan para penghuni Neraka Jahim itu adalah orang-orang kafir yang mendustakan ayat-ayat Allah. Masih ada lagi satu golongan yang disebutkan Allah dalam surat Fathir, yaitu para muqtashidun, yaitu mereka yang menunaikan kewajiban-kewajiban dan menjauhi semua yang diharamkan, hanya saja mereka melakukan beberapa kekurangan dalam menunaikan hak-hak Allah dan hak-hak sesame manusia. Tempat kembali tingkatan ini adalah surga meski ada di antara mereka yang mendapatkan hukuman terlebih dahulu sebagai balasan atas sebagian amal perbuatannya (yang buruk)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Hadid ayat 19: Ketahuilah wahai manusia bahwa mereka yang beriman kepada Allah dan menetapkan ke-Maha Tunggalan Allah; Dan membenarkan kerisalahan-Nya, mereka adalah orang-orang pada derajat shiddiq di sisi Allah; Karena sebab kuatnya keimanan mereka dan keyakinan mereka kepada Allah. Dan ketahuilah bahwa mereka yang bersaksi dalam peperangan-peperangan di jalan Allah; Mereka mendapatkan balasan yang besar di sisi Allah, dan cahaya memuliakan mereka. Adapun mereka yang kufur kepada ayat-ayat Allah dan hujjah-hujjah Allah, maka mereka adalah penghuni nereka, diadzab di dalamnya, tidak ada ganjaran bagi mereka dan cahaya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Syaikh As Sa’diy menerangkan, iman menurut Ahlussunnah wal Jamaah adalah ucapan hati dan lisan, demikian pula amalan hati, lisan dan anggota badan sehingga mencakup semua syariat agama yang tampak maupun yang tersembunyi. Orang yang menggabung antara perkara-perkara ini, maka mereka adalah shiddiqin yang kedudukan mereka di atas kedudukan kaum mukmin pada umumnya dan di bawah kedudukan para nabi. Yaitu mereka yang sangat teguh dan kuat keyakinannya kepada kebenaran rasul. Mereka ini termasuk di antara orang-orang yang dianugerahi nikmat oleh Allah sebagaimana yang disebutkan dalam surat Al Faatihah ayat 7. Hal ini sebagaimana yang diterangkan dalam hadits shahih, bahwa di surga ada seratus derajat, dimana antara dua derajat jaraknya antara langit dan bumi. Allah Subhaanahu wa Ta'aala menyiapkannya untuk para mujahid di jalan-Nya. Ayat ini menunjukkan tingginya kedudukan mereka dan dekatnya mereka dengan Allah Subhaanahu wa Ta'aala. Yang menunjukkan keesaan Kami. Ayat ini dan dua ayat sebelumnya menerangkan beberapa golongan orang, dari mulai al mushshaddiqin (orang-orang yang banyak bersedekah), shiddiqin (orang-orang yang sangat membenarkan), syuhada’ dan As-habul Jahim (penghuni neraka). Al Mushshaddiqin adalah mereka yang sebagian besar amalnya adalah berbuat ihsan kepada makhluk, memberikan manfaat kepada mereka sesuai kemampuan, khususnya memberikan manfaat dengan mengeluarkan harta di jalan Allah. Shiddiqin adalah mereka yang telah sempurna tingkatan iman dan amal saleh, ilmu yang bermanfaat dan keyakinan yang benar. Sedangkan para syuhada adalah orang-orang yang berperang di jalan Allah untuk meninggikan kalimatullah serta mengorbankan diri dan harta mereka lalu mereka terbunuh. Adapun Ash-habul jahiim adalah orang-orang kafir yang mendustakan ayat-ayat Allah. Tinggallah golongan yang disebutkan dalam surah Fathir, yaitu al muqtashiduun (yang pertengahan), yaitu mereka yang mengerjakan kewajiban dan meninggalkan larangan, hanyasaja mereka melakukan pengurangan pada sebagian hak Allah dan hak hamba. Mereka ini tempat kembalinya adalah ke surga meskipun mereka mendapatkan hukuman terhadap sebagian amal yang mereka kerjakan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hadid Ayat 19",
    "description": "Dan orang-orang yang beriman dengan mantap kepada Allah dan rasul-rasul-Nya serta tidak meragukan janji-Nya, mereka itu orang-orang yang tulus hati dan pecinta kebenaran, dan mereka menjadi saksi-saksi di sisi tuhan mereka. Karena keimanan dan kebaikan itu mereka berhak mendapat pahala dan cahaya dari sisi Allah. Tetapi, orang-orang yang kafir dan mendustakan ayat-ayat kami serta mengingkari ajaran-ajaran kami, mereka itu penghuni-penghuni neraka. Mereka kekal di dalamnya. 20. Wahai orang mukmin, ketahuilah sesungguhnya kehidupan dunia itu hanyalah permainan dan sendagurauan. Karena itu, jangan sampai kamu larut di dalamnya. Kehidupan dunia ini juga merupakan perhiasan bagimu dan saling berbangga di antara kamu serta berlomba dalam kekayaan dan anak keturunan. Semua itu seperti hujan yang menumbuhkan tanam-tanamannya sehingga mengagumkan para petani; kemudian tanaman itu menjadi kering saat kemarau dan kamu lihat warnanya kuning kemudian menjadi hancur. Itulah permisalan bagi kehidupan dunia yang fana. Dan ketahuilah, di akhirat nanti ada azab yang keras bagi mereka yang ingkar dan ampunan dari Allah serta keridaan-Nya bagi orang yang beriman dan mematuhi ajaran-Nya. Dan kehidupan dunia yang sekarang kamu nik-mati tidak lain hanyalah kesenangan yang palsu."
  }
]