[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "2. Milik Allah kerajaan langit dan bumi dan apa yang ada di antara keduanya. Dia adalah Pemilik yang bertindak atas makhlukNya, Yang menghidupkan dan mematikan, Dia Mahakuasa atas segala sesuatu, tidak ada sesuatu yang Allah kehendaki yang tidak terjadi, apa yang Allah kehendaki pasti terjadi, apa yang tidak Allah kehendaki terjadi, tidak akan terjadi."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Hanya milik-Nya semata kerajaan langit dan bumi. Dia menghidupkan siapa saja yang dikehendaki-Nya untuk dihidupkan dan mematikan siapa saja yang dikehendaki-Nya untuk dimatikan dan Dia Mahakuasa atas segala sesuatu, tidak ada sesuatu pun yang melemahkannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Yang Merajai langit dan bumi, Sang Pencipta keduanya. Tidak ada yang mampu melakukan sesuatu apapun di dalamnya kecuali Dia. Yang Menghidupkan yang mati dan mematikan yang hidup. Yang Maha Kuasa atas segala sesuatu dan tidak ada yang tidak dapat Dia lakukan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "MilikNyalah kerajaan langit dan bumi. Dia menghidupkan dan mematikan. Dia Maha kuasa atas segala sesuatu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2. Kemudian Allah mengabarkan kepemilikanNya yang menyeluruh seraya berfirman, “KepunyaanNya-lah kerajaan langit dan bumi. Dia menghidupkan dan mematikan.” Maksudnya, Dia-lah yang menciptakan semua itu, Yang Memberi rizki dan Mengatur dengan kekuasaanNya. “Dan Dia Mahakuasa atas segala sesuatu.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Hadid ayat 2: Allah mengabarkan Dialah pemilik langit dan bumi dan apa yang ada di dalamnya; Dia adalah raja yang berkuasa atas makhluk-Nya, menghidupkan dan mematikan ciptaan-Nya sebagaimana yang Dia kehendaki. Yang Berkuasa atas segala sesuatu; Tidak ada yang dapat melemahkan-Nya baik di bumi maupu di langit."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dia yang menciptakannya, memberi rezeki dan mengaturnya dengan kekuasaan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hadid Ayat 2",
    "description": "Allah adalah pencipta semua makhluk, karena itu hanya milik-Nyalah kerajaan langit dan bumi serta semua yang ada di antara keduanya. Dia berkuasa menghidupkan dan mematikan apa saja sesuai kehendak-Nya, dan dia mahakuasa untuk menentukan apa yang dia inginkan atas segala sesuatu. 3. Sebagai pencipta, dialah yang awal tanpa permulaan, dan dia pula yang akhir karena dia abadi tanpa batas akhir bagi eksistensinya. Selain itu, dia adalah yang zahir dan mengetahui apa saja yang tampak, dan yang batin dan mengetahui apa saja yang disembunyikan atau yang tersirat dalam hati. Dia lebih dekat kepada makhluk daripada dirinya sendiri, dan dia maha mengetahui segala sesuatu di alam semesta."
  }
]