[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "20. Ketahuilah (wahai manusia) bahwa kehidupan dunia hanyalah permainan dan kesenangan, jasmani bermain-main dan hati bersenda gurau, perhiasan yang kalian berhias dengannya, kalian saling berbangga dengan harta kalian, kalian berlomba memperbanyak harta dan anak-anak, perumpamaannya seperti hujan yang tanamannya menakjubkan para petani, kemudian tanaman tersebut menua dan mengering, menguning setelah sebelumnya hijau, kemudian ia rontok dan hancur. Dan di akhirat ada azab yang berat bagi orang-orang kafir, dan ampunan dan ridha Allah bagi ahli iman. Kehidupan dunia ini bagi siapa yang beramal untuknya dan melupakan akhiratnya, hanyalah kesenangan yang memperdaya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "20. Ketahuilah bahwa kehidupan dunia itu adalah permainan yang dimainkan oleh anggota tubuh, kelalaian yang melalaikan hati, perhiasan yang dengannya kalian menghias diri, bermegah-megahan di antara kalian dengan barang-barang dan kesenangan yang ada di dunia, dan berbangga-banggaan dengan banyaknya harta dan anak, seperti hujan yang tumbuh-tumbuhannya menakjubkan para penanamnya, tidak lama kemudian tanaman yang hijau itu menjadi kering. Maka engkau melihatnya -wahai orang yang melihat- setelah hijau menjadi kuning, kemudian Allah menjadikannya rontok lagi hancur. Sedang di Akhirat terdapat siksa yang pedih bagi orang-orang kafir dan munafik, serta ampunan dari Allah untuk dosa hamba-hamba-Nya yang beriman serta keridaan dari-Nya. Dan kehidupan dunia itu tidak lain hanyalah kesenangan yang fana, tidak abadi. Maka barangsiapa yang mendahulukan kesenangan yang punah atas kenikmatan Akhirat, maka ia adalah orang yang merugi dan tertipu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "20. Hai para hamba, Ketahuilah bahwa kehidupan dunia ini hanyalah senda gurau jasad, permainan hati, perhiasan dalam pakaian dan kendaraan, dan pembanggaan harta, anak keturunan, dan nasab. Kehidupan dunia bagaikan hujan lebat yang turun di suatu tempat, sehingga para petaninya merasa takjub terhadap tanaman yang tumbuh berkat hujan itu, namun kemudian tanaman itu mulai mengering, sehingga kamu melihatnya menguning dan hancur setelah benar-benar kering, lalu berhamburan terhembus angin. Dan balasan di akhirat berupa azab yang berat di neraka bagi orang-orang kafir. Sedangkan ampunan dan keridhaan Allah bagi orang-orang beriman. Dan kehidupan dunia hanyalah kesenangan sementara yang semu bagi orang yang merasa puas dengannya dan melalaikan akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "20. اعْلَمُوٓا۟ أَنَّمَا الْحَيَوٰةُ الدُّنْيَا لَعِبٌ وَلَهْوٌ (Ketahuilah, bahwa sesungguhnya kehidupan dunia ini hanyalah permainan dan suatu yang melalaikan) Makna (اللعب) yakni kebalikan dari kesungguhan, sedangkan (اللهو) adalah segala yang melalaikan lalu hilang. Pendapat lain mengatakan (اللعب) yakni koleksi, dan (اللهو) adalah wanita, sedangkan (الزينة) yakni menghias diri dengan kenikmatan dunia. وَتَفَاخُرٌۢ بَيْنَكُمْ(dan bermegah-megah antara kamu) Yakni saling menyombongkan diri. Pendapt lain mengatakan: yakni saling memamerkan ketampanan dan kekuatan serta segala yang mereka dapatkan dari kenikmatan dunia. Pendapat lain mengatakan: yakni saling membangga-banggakan nasab dan keturunan sebagaimana yang banyak dilakukan orang Arab pada zaman dahulu. وَتَكَاثُرٌ فِى الْأَمْوٰلِ وَالْأَوْلٰدِ ۖ( serta berbangga-banggaan tentang banyaknya harta dan anak) Yakni setiap mereka menginginkan harta dan keturunan yang banyak agar dia dapat merasa dirinya lebih baik daripada orang yang harta dan keturunannya lebih sedikit. كَمَثَلِ غَيْثٍ أَعْجَبَ الْكُفَّارَ نَبَاتُهُۥ(seperti hujan yang tanam-tanamannya mengagumkan para petani) Yakni seperti hujan yang membuat takjub para petani karena menumbuhkan tanaman yang baik. Yang dimaksud dengan (الكفار) di sini adalah para petani, sebab mereka menutup biji dengan tanah. ثُمَّ يَهِيجُ(kemudian tanaman itu menjadi kering) Yakni mengering setelah sebelumnya tampak hijau. ثُمَّ يَكُونُ حُطٰمًا ۖ( kemudian menjadi hancur) Yakni hancur lebur setelah kering. Demikianlah kehinaan dunia dan kecepatan sirnanya padahal sebelumnya sangat indah bagi setiap orang, bansa, dan umat manusia seluruhnya. وَفِى الْاٰخِرَةِ عَذَابٌ شَدِيدٌ(Dan di akhirat (nanti) ada azab yang keras) Yakni bagi musuh-musuh Allah. وَمَغْفِرَةٌ مِّنَ اللهِ وَرِضْوٰنٌ ۚ( dan ampunan dari Allah serta keridhaan-Nya) Yakni bagi para kekasih-Nya dan orang-orang yang taat. Dan manusia berada di antara dua tersebut, baik itu azab atau keridhaan Allah. وَمَا الْحَيَوٰةُ الدُّنْيَآ إِلَّا مَتٰعُ الْغُرُورِ(Dan kehidupan dunia ini tidak lain hanyalah kesenangan yang menipu) Yakni bagi orang yang tertipu olehnya dan tidak beramal untuk kehidupan akhirat. Adapun orang yang menggunakan dunia untuk mencari kehidupan akhirat, maka baginya kenikmatan yang lebih baik dari kenikmatan dunia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20. Ketahuilah wahai manusia, sesungguhnya kehidupan dunia itu hanya permainan yang tidak memberi manfaat apapun di akhirat, hiburan yang menghibur sementara lalu menghilang, hiasan yang hanya digunakan untuk berhias di dunia dan kebanggan yang dibanggakan oleh sebagian kalian kepada yang lainnya sehingga saling berlomba untuk memperbanyak sesuatu yang menyibukkannya dari akhirat yaitu mengumpulkan harta dan melahirkan anak, layaknya hujan yang diharapkan para petani untuk tanaman-tanaman dan bunga-bunga mereka, kemudian terjadi kekeringan setelah turunnya hujan itu lalu tanaman dan bunganya layu dan rusak. Di akhiran terdapat azab yang dahsyat bagi orang yang lebih mementingkan dunia daripada akhirat, yaitu orang-orang kafir dan orang-orang yang berbuat keji. Ampunan dan keridhaan yang penuh dari Allah itu diperuntukkan bagi orang yang lebih mementingkan akhirat dan lebih taat, yaitu orang mukmin. Kehidupan dunia tidak lain hanya sesuatu yang dinikmati oleh orang yang asing dengannya dan tertipu olehnya sehingga dia tidak sempat beramal untuk akhiratnya. Para petani itu disebut orang-orang kafir (orang yang menutup), karena mereka menutupi biji-bijian dalam tanah sebagaimana orang-orang kafir yang menutup-nutupi iman."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketahuilah bahwa kehidupan dunia itu hanyalah permainan} permainan yang dimainkan badan {kelengahan} kelengahan yang dimainkan hati {perhiasan, dan saling bermegah-megahan di antara kalian serta berlomba-lomba memperbanyak harta dan anak. Seperti hujan} hujan {yang tanamannya mengagumkan para petani} para petani {lalu mengering} menjadi kering {dan kamu melihatnya menguning, kemudian hancur} pecah dan hancur {Di akhirat ada azab yang keras serta ampunan dari Allah dan keridhaanNya. Tidaklah kehidupan dunia melainkan hanya kesenangan yang memperdaya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "20. Allah mengabarkan hakikat dunia dan seluruh isinya, dan Allah menjelaskan kesudahan dunia dan kesudahan manusia yang menghuninya, bahwa dunia adalah “permainan dan suatu yang melalaikan.” Raga manusia bermain-main dengan dunia dan hati mereka lalai. Hal ini terjadi dan berlaku bagi mereka yang mencintai dunia. Anda melihat mereka menghabiskan sebagian besar usia mereka dengan kelalaian hati serta lalai untuk mengingat Allah serta lalai akan janji dan ancaman yang ada di hadapan mereka. Anda juga melihat mereka menjadikan agama sebagai permainan dan kelalaian. Lain halnya dengan orang-orang yang sadar dan bekerja untuk akhirat. Hati mereka penuh dengan dzikir, ma’rifah dan mahabbah. Mereka gunakan sebagian besar waktu mereka untuk amalan-amalan yang mendekatkan mereka kepada Allah sehingga tidak sempat melakukan perbuatan-perbuatan yang kurang bermanfaat. Firman Allah, “perhiasan,” maksudnya berhias dalam pakaian, makanan, minuman, kendaraan, rumah, istana, penampilan, dan lainnya, “dan bermegah-megahan antara kamu,” maksudnya, masing-masing orang yang memiliki tiap-tiap perhiasan dunia saling membangga-banggakan diri terhadap yang lain dan selalu berusaha untuk menjadi yang terdepan di bidangnya dan yang kondisinya ternama, “serta berbangga-bangga tentang banyaknya harta dan anak,” maksudnya masing-masing ingin menjadi yang terbanyak dari segi harta dan anak dari yang lain. Ini terjadi pada mereka yang gila dunia dan merasa tenang terhadap dunia. Lain halnya orang yang mengetahui dunia dan hakikatnya. Mereka menjadikan dunia sebagai tempat berlalu, bukan dijadikan sebagai tempat tinggal. Mereka selalu berlomba-lomba dan menyaingi segala hal yang bisa mendekatkan diri kepada Allah dengan menggunakan berbagai media yang bisa mengantarkan menuju surga, tempat kemuliaan Allah, ketika melihat orang yang menyainginya dengan memperbanyak harta dan anak, dihadapinya dengan memperbanyak amalan-amalan shalih. Selanjutnya Allah membuat perumpamaan bagi dunia yaitu seperti air hujan yang turun ke bumi dan berbaur dengan tumbuh-tumbuhan yang dimakan oleh manusia dan juga hewan, hingga ketika bumi menampakkan keindahannya, tumbuh-tumbuhan itu pun membuat orang-orang kafir heran, tetapi lalai dari memperhatikannya, pandangan dan perhatian mereka hanya tertuju pada dunia. Kemudian datanglah sesuatu yang menghancurkan tanaman tersebut atas perintah dari Allah sehingga tanaman itu pun rusak, mongering dan kembali pada kondisi semula, seolah-olah sama sekali tidak pernah menghijau dan tidak pernah dilihat menarik. Seperti itu juga dunia, pada saat menyinari para penggilanya, apa pun yang diinginkan selalu terpenuhi, apa pun yang dikehendaki pasti pasti menemukan pintunya yang terbuka, di saat seperti itu, tiba-tiba takdirnya datang dan melenyapkan semua yang ada di tangannya, melenyapkan semua kekuasaan yang dimiliki dan menghilangkan semua itu darinya. Ia pun meninggalkan dunia dengan tangan hampa. Tidak berbekal apapun selain sehelai kain kafan. Amat celakalah orang yang menjadikan dunia sebagai tujuan dari angan-angannya serta tujuan dari segala usaha dan pekerjaannya. Adapun amalan-amalan akhirat yang berguna dan disimpan untuk para pemiliknya yang akan selalu menemani hamba selamanya. Karena itu Allah berfirman, “Dan di akhirat (nanti) ada azab yang keras dan ampunan dari Allah serta keridhaanNya.” Maksudnya, hanya ada kemungkinan di akhirat: siksaan pedih di NEraka Jahanam dengan belenggu, rantai dan kengeriannya bagi orang yang menjadikan dunia sebagai tujuan dan puncak keinginannya sehingga berlaku sembrono dengan berbagai kemaksiatan, mendustakan ayat-ayat Allah dan mengkufuri semua nikmat Allah, atau ampunan dari semua kesalahan dari Allah, penghapusan dari berbagai hukuman dan keridhaan Allah yang berhak diperoleh oleh orang yang berhak mendapatkannya, berada di tempat keridhaan bagi orang yang mengetahui hakikat dunia dan mengerahkan segenap usahanya untuk kepentingan akhirat. Karena itulah Allah berfirman, “Dan kehidupan dunia ini tidak lain hanyalah kesenangan yang menipu.” Maksudnya, tidak lain hanyalah kesenangan yang dinikmati dan dipakai untuk berbagai keperluan yang tidak akan menipu dan membuat tenang kecuali orang yang lemah akalnya, yaitu mereka yang tertipu oleh dunia terhadap Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Hadid ayat 20: Ketahuilah wahai manusia bahwasanya kehidupan dunia yang kalian tinggal di dalamnya, hanyalah permainan dan senda-gurau. Keindahannya hanyalah pada pakaian, rumah-rumah kalian dan saling berbangga diri di antara kalian, seperti berbangga dengan pasangan, harta, dan anak. Juga berbangga dengan kekayaan. Dunia ini seperti tanaman yang tumbuh, akan tetapi hanya sebentar umurnya, dipanen kemudian menjadi kering dan tertiup dengan angin. Allah menjelaskan bahwa barangsipa yang mementingkan dunia dan tidak berbekal dengan akhirat, maka di akhirat dia akan diadzab yang keras. Dan barangsiapa yang menggunakan dunia untuk keridhaan Allah dan menjadikan tangga untuk meraih akhirat, maka dia adalah orang yang diampuni atas dosanya dan diridhai Allah. Ketahuilah bahwa kehidupan dunia bagi siapa yang lalai dengan akhirat maka semua itu adalah kesenangan semu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala menerangkan hakikat dunia dan apa yang ada di atasnya, menerangkan akhirnya dan akhir para penghuninya, yaitu bahwa dunia merupakan permainan dan senda gurau, dimana jasad bermain-main dengannya dan hati terlalaikan olehnya. Hal ini seperti yang terjadi pada orang-orang yang mengejar dunia, dimana kita melihat mereka menghabiskan usia mereka dengan senda gurau serta lalai dari dzikrullah, demikian pula terhadap apa yang ada di hadapan mereka berupa janji Allah dan ancaman-Nya di akhirat. Bahkan kita melihat mereka menjadikan agama sebagai permainan dan senda gurau, berbeda dengan orang-orang yang sadar dan mengejar akhirat, dimana hati mereka dipenuhi mengingat Allah, mengenal dan mencintai-Nya, dan mereka menyibukkan waktu mereka dengan amal yang dapat mendekatkan mereka kepada Allah baik manfaatnya terbatas untuk diri mereka maupun mengena pula kepada orang lain. Yakni berhias, baik dalam pakaian, makanan, minuman, kendaraan, rumah, kedudukan dan lainnya. Maksudnya, masing-masing penghuninya ingin berbangga di hadapan orang lain dan agar dia lebih unggul dalam urusannya serta masyhur keadaannya. Masing-masing ingin jika dia lebih banyak daripada yang lain dalam harta dan anaknya seperti yang kita saksikan pada orang-orang yang mencintai dunia dan merasa tenteram dengannya. Berbeda dengan orang-orang yang telah mengenal dunia dan hakikatnya, dimana dia menjadikannya sebagai perjalanan, bukan sebagai tempat menetap, maka dia pun berlomba-lomba dalam hal yang mendekatkan dirinya kepada Allah serta menggunakan sarana yang dapat mengantarkannya kepada Allah, dan ketika dia melihat orang-orang berlomba-lomba dalam hal harta dan anak, maka dia berlomba-lomba dalam amal saleh. Selanjutnya Allah Subhaanahu wa Ta'aala membuat permisalan terhadap dunia dengan air hujan yang turun mengena kepada bumi, lalu bercampur dengan tanaman-tanaman bumi yang kemudian menjadi makanan manusia dan hewan. Ketika bumi telah berhias dengan indahnya dan tanamannya menakjubkan para penanam, yang cita-cita dan harapannya terbatas hanya sampai dunia saja, tiba-tiba datang perkara dari perintah Allah yang membinasakannya sehingga tanaman itu menjadi kering menguning dan menjadi seperti belum pernah tumbuh sama sekali. Demikianlah dunia, ketika ia berhias untuk penduduknya, dimana apa saja yang diinginkan penghuninya dapat diperolehnya dan apa yang dituju oleh penghuninya, maka akan ditemukan pintu-pintu ke arahnya dalam keadaan terbuka, namun qadar (taqdir) menimpanya sehingga menghilangkannya dari tangannya dan menyingkirkan kepemilikannya dan tangannya pun menjadi hampa, dimana ia tidak berbekal apa-apa selain kain kafan. Oleh karena itu, sungguh rugi orang yang menjadikan dunia sebagai akhir cita-citanya, dimana untuknya dia beramal dan berbuat. Padahal beramal untuk akhirat, itulah yang bermanfaat, menjadi simpanan pemiliknya dan akan ikut bersama hamba selama-lamanya. Oleh karena itu, Allah Subhaanahu wa Ta'aala berfirman, “Dan di akhirat (nanti) ada azab yang keras dan ampunan dari Allah serta keridhaan-Nya.” Maksudnya, keadaan di akhirat tidak lepas dari dua keadaan ini, bisa azab yang keras di neraka Jahannam, belenggu, rantai dan kedahsyatannya bagi orang yang menjadikan dunia sebagai cita-citanya dan akhir harapannya yang membuatnya berani bermaksiat kepada Allah, mendustakan ayat-ayat Allah dan mengingkari nikmat-nikmat Allah. Bisa juga mendapatkan ampunan dari Allah terhadap keburukannya, penyingkiran hukuman dan mendapatkan keridhaan-Nya bagi orang yang telah mengetahui hakikat dunia dan beramal untuk akhirat. Ini semua termasuk hal yang membantu untuk zuhud terhadap dunia dan berharap kepada akhirat. Tidak ada yang tertipu dan merasa tenang kepadanya selain orang-orang yang lemah akal yang ditipu oleh setan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hadid Ayat 20",
    "description": "Wahai orang mukmin, ketahuilah sesungguhnya kehidupan dunia itu hanyalah permainan dan sendagurauan. Karena itu, jangan sampai kamu larut di dalamnya. Kehidupan dunia ini juga merupakan perhiasan bagimu dan saling berbangga di antara kamu serta berlomba dalam kekayaan dan anak keturunan. Semua itu seperti hujan yang menumbuhkan tanam-tanamannya sehingga mengagumkan para petani; kemudian tanaman itu menjadi kering saat kemarau dan kamu lihat warnanya kuning kemudian menjadi hancur. Itulah permisalan bagi kehidupan dunia yang fana. Dan ketahuilah, di akhirat nanti ada azab yang keras bagi mereka yang ingkar dan ampunan dari Allah serta keridaan-Nya bagi orang yang beriman dan mematuhi ajaran-Nya. Dan kehidupan dunia yang sekarang kamu nik-mati tidak lain hanyalah kesenangan yang palsu. 21. Setelah kamu semua wahai orang beriman mengetahui hakikat kehidupan dunia, maka segera berlomba-lombalah kamu untuk mendapatkan ampunan dari tuhanmu dengan istigfar dan berlombalah untuk men-dapatkan surga yang luasnya seluas langit dan bumi dengan selalu melakukan kebaikan, yang disediakan bagi orang-orang yang beriman kepada Allah dan rasul-rasul-Nya. Itulah karunia tertinggi Allah yang diberikan kepada siapa yang dia dikehendaki. Dan Allah mempunyai karunia yang besar bagi mereka yang beriman dan berbuat kebajikan."
  }
]