[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "21. Bergegaslah wahai manusia, dalam meraih sebab-sebab ampunan, yaitu taubat nashuha dan menjauhi kemaksiatan, agar kalian mendapatkan ampunan dari Tuhan kalian dan surga yang luasnya seluas langit dan bumi, yang disiapkan bagi orang-orang yang mentauhidkan Allah dan mengikuti rasul-rasulNya. Itu adalah keutamaan dari Allah yang Dia berikan kepada siapa yang Dia kehendaki dari makhlukNya. Surga tidak diraih kecuali dengan rahmat dan karunia Allah dan amal shalih. Dan Allah adalah Pemilik kebaikan dan pemberian yang besar lagi melimpah bagi hamba-hambaNya yang beriman."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Berlomba-lombalah kalian -wahai manusia- melaksanakan amal saleh yang dengannya kalian mendapatkan ampunan atas dosa-dosa kalian, seperti tobat dan berbagai macam ibadah lainnya, dan agar kalian mendapatkan dengannya Surga yang luasnya seperti luas langit dan bumi. Surga ini disiapkan Allah untuk orang-orang yang beriman kepada-Nya dan beriman kepada rasul-rasul-Nya. Balasan ini adalah anugerah dari Allah yang diberikan kepada siapa yang dikehendaki-Nya dari hamba-hamba-Nya, dan Allah -Subḥānahu- mempunyai karunia yang agung untuk hamba-hamba-Nya yang beriman."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "21. Hai para hamba, bersegeralah menuju perlombaan di dunia dalam mencari sebab-sebab ampunan dan keridhaan Allah dengan bertaubat dan mentaati-Nya, dan berlomba-lombalah menuju surga yang agung, yang luasnya seperti luas langit dan bumi; surga ini disiapkan bagi orang-orang yang beriman kepada Allah dan rasul-Nya. Kedudukan mulia di surga ini merupakan karunia yang Allah beriman bagi hamba-Nya yang Dia kehendaki. Allah Maha Pemberi Karunia bagi orang-orang yang beriman."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "21. سَابِقُوٓا۟ إِلَىٰ مَغْفِرَةٍ مِّن رَّبِّكُمْ (Berlomba-lombalah kamu kepada (mendapatkan) ampunan dari Tuhanmu) Yakni saling bergegaslah beramal shalih yang dapat mengundang ampunan dari Tuhan kalian. Di antaranya adalah dengan bergegas menuju ke masjid agar dapat bertakbir bersama imam pada takbir yang pertama, dan juga berusaha mendapatkan shaf pertama dalam shalat, serta membaikkan segala amalan yang dikerjakan. وَجَنَّةٍ عَرْضُهَا كَعَرْضِ السَّمَآءِ وَالْأَرْضِ(dan surga yang luasnya seluas langit dan bumi) Dan jika luasnya demikian maka bagaimana dengan panjangnya. أُعِدَّتْ لِلَّذِينَ ءَامَنُوا۟ بِاللهِ وَرُسُلِهِۦ ۚ( yang disediakan bagi orang-orang yang beriman kepada Allah dan Rasul-rasul-Nya) Yakni tidak ada yang layak mendapatkannya kecuali orang yang menjalankan perintah Allah dan menjauhi larangan-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "21. Bergegaslah wahai manusia menusju hal-hal yang menyebabkan ampunan Allah dengan bertaubat dan beramal shalih. Bergegaslah kalian ke surga yang luasnya seperti luas langit dan bumi. Surga itu disiapkan dan diciptakan untuk orang-orang yang beriman kepada Allah dan rasulNya bukan untuk selain mereka. Janji berupa surga dan ampunan itu merupakan keutamaan Allah bagi orang-orang yang menaatiNya. Allah adalah pemilik keutamaan yang luas tanpa batas. Penyiapan surga tersebut adalah bukti surga itu benar-benar ada"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Berlombalah menuju ampunan dari Tuhan kalian dan surga yang lebarnya selebar langit dan bumi, yang telah disediakan bagi orang-orang yang beriman kepada Allah dan para rasulNya. Itulah karunia Allah yang dianugerahkan kepada siapa saja yang Dia kehendaki. Allah adalah pemilik karunia yang agung"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21. Selanjutnya Allah memerintahkan untuk berlomba-lomba menggapai ampunan, keridhaan, dan surgaNya. Hal itu bisa dicapai dengan melakukan berbagai sebab-sebab ampunan seperti taubat yang sungguh-sungguh, istighfar yang berguna, jauh dari dosa dan perantaranya, berlomba-lomba menggapai keridhaan Allah dengan amal shalih, berusaha terus melakukan semua amalan yang diridhai Allah berupa ibadah secara baik, bersikap baik terhadap sesame makhluk dengan berbagai perbuatan yang berguna. Karena itu Allah menyebutkan amalan-amalan yang mewajibkan pelakunya mendapatkan semua itu seraya berfirman, “Dan surga yang luasnya seluas langit dan bumi, yang disediakan bagi orang-orang yang beriman kepada Allah dan RasulNya.” Termasuk iman kepada Allah dan RasulNya adalah seluruh pokok-pokok agama dan cabang-cabangnya. “Itulah karunia Allah, diberikanNya kepada siapa yang dikehendakiNya.” Maksudnya, balasan untuk kalian yang Kami jelaskan ini berupa jalan yang mengantarkan kalian menuju surga dan jalan yang mengantarkan kalian menuju neraka, dan sesungguhnya pahala Allah yang diberikan dengan balasan yang besar merupakan pemberian dan karunia terbesar untuk hamba-hambaNya, “Dan Allah mempunyai karunia yang besar,” yang pujianNya tidak terhingga, seperti Dia memuji diriNya, lebih dari pujian seluruh makhlukNYa."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Hadid ayat 21: Allah menganjurkan untuk mendapatkan ridha Allah; Maka Allah memerintahkan agar bersegera dalam beramal kebaikan dan amalan shalih untuk menjadi sebab ampunan Allah, dan agar menjadi sebab masuk surga."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala memerintahkan untuk berlomba-lomba menggapai ampunan Allah, keridhaan-Nya dan surga-Nya. Tentunya hal itu dicapai dengan mengerjakan sebab-sebab untuk mendapatkan ampunan berupa tobat nasuha, istighfar yang bermanfaat dan menjauhi dosa, serta berlomba-lomba menggapai keridhaan Allah dengan amal saleh serta berusaha terus mengerjakan perbuatan yang menjadikan Allah ridha berupa berbuat ihsan dalam beribadah kepada Allah dan berbuat ihsan kepada makhluk dengan berbagai bentuk manfaat. Maksudnya, inilah yang telah Kami terangkan kepada kamu berupa jalan-jalan menuju surga serta jalan-jalan yang mengarah kepada neraka, dan bahwa karunia Allah berupa pahala yang besar termasuk nikmat-Nya yang terbesar yang diberikan kepada hamba-hamba-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hadid Ayat 21",
    "description": "Setelah kamu semua wahai orang beriman mengetahui hakikat kehidupan dunia, maka segera berlomba-lombalah kamu untuk mendapatkan ampunan dari tuhanmu dengan istigfar dan berlombalah untuk men-dapatkan surga yang luasnya seluas langit dan bumi dengan selalu melakukan kebaikan, yang disediakan bagi orang-orang yang beriman kepada Allah dan rasul-rasul-Nya. Itulah karunia tertinggi Allah yang diberikan kepada siapa yang dia dikehendaki. Dan Allah mempunyai karunia yang besar bagi mereka yang beriman dan berbuat kebajikan. 22. Usai menjelaskan karunia-Nya kepada orang memohon ampunan, Allah menerangkan bahwa semua yang terjadi di alam ini merupakan ketetapan Allah yang tertulis di lauh mahfuz. Setiap bencana yang menimpa di bumi, seperti gempa, banjir, erupsi, dan lainnya, dan demikian pula bencana yang menimpa dirimu sendiri, seperti sakit, kecelakaan, dan lainnya, semuanya telah tertulis dalam kitab yang disebut lauh mahfuz sebelum kami mewujudkannya. Sungguh, yang demikian itu, yaitu semua yang terjadi, sangat mudah bagi Allah."
  }
]