[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "22. Tidakkah menimpa kalian (wahai manusia) berupa musibah di bumi dan musibah pada diri kalian berupa penyakit, kelaparan, dan rasa sakit, kecuali ia tertulis di Lauhul Mahfuz sebelum makhluk diciptakan. Sesungguhnya hal itu adalah mudah bagi Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "22. Tiada bencana yang menimpa manusia di bumi seperti kekeringan dan lainnya, dan tidak ada bencana yang menimpa pada diri mereka melainkan hal itu telah ditetapkan di dalam Lauḥul Maḥfuẓ sebelum Kami menciptakan makhluk, sesungguhnya hal itu mudah bagi Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "22-24. Allah menenangkan hamba-hamba-Nya bahwa segala musibah yang menimpa mereka di bumi merupakan perkara yang telah ditetapkan dan tertulis dalam lauhul mahfuzh sebelum mereka diciptakan, dan penetapan yang agung ini sangat mudah bagi Allah. Hal ini agar kalian tidak bersedih akibat kenikmatan dunia yang tidak kalian dapatkan, dan agar kalian tidak merasa sombong karena mendapat kenikmatan itu. Allah tidak menyukai setiap orang yang menyombongkan rezeki yang Allah berikan kepadanya. Orang-orang yang menyombongkan diri itu adalah yang enggan menginfakkan harta mereka di jalan Allah dan yang mendorong orang lain agar tidak menginfakkan hartanya. Dan barangsiapa enggan menginfakkan hartanya, maka sungguh Allah Maha Kaya, tidak membutuhkan makhluk-Nya, dan Dia Maha Terpuji dalam segala hal."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "21. سَابِقُوٓا۟ إِلَىٰ مَغْفِرَةٍ مِّن رَّبِّكُمْ (Berlomba-lombalah kamu kepada (mendapatkan) ampunan dari Tuhanmu) Yakni saling bergegaslah beramal shalih yang dapat mengundang ampunan dari Tuhan kalian. Di antaranya adalah dengan bergegas menuju ke masjid agar dapat bertakbir bersama imam pada takbir yang pertama, dan juga berusaha mendapatkan shaf pertama dalam shalat, serta membaikkan segala amalan yang dikerjakan. وَجَنَّةٍ عَرْضُهَا كَعَرْضِ السَّمَآءِ وَالْأَرْضِ(dan surga yang luasnya seluas langit dan bumi) Dan jika luasnya demikian maka bagaimana dengan panjangnya. أُعِدَّتْ لِلَّذِينَ ءَامَنُوا۟ بِاللهِ وَرُسُلِهِۦ ۚ( yang disediakan bagi orang-orang yang beriman kepada Allah dan Rasul-rasul-Nya) Yakni tidak ada yang layak mendapatkannya kecuali orang yang menjalankan perintah Allah dan menjauhi larangan-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "22. Tidaklah yang menimpa kalian wahai manusia berupa musibah di bumi seperti kegersangan, kurangnya buah-buahan, wabah penyakit tanaman, mahalnya harga dan lainlain serta mushibah yang menimpa diri kalian seperti sakit, kefakiran dan kehilangan anak itu kecuali telah ditulis di Lauhil Mahfudz sebelum kami menciptakan apapun. Bagi Allah SWT, menetapkan hal itu dalam kitabNya merupakan perkara yang mudah dan gampang."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidak ada bencana yang menimpa di bumi dan tidak pula diri kalian, kecuali telah tertulis dalam kitab} Lauhil Mahfuz {sebelum Kami mewujudkannya} menciptakan suatu penciptaan {Sesungguhnya hal itu mudah bagi Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "22. Allah berfirman mengabarkan luasnya Qadha dan QadarNya, “Tiada sesuatu bencana pun yang menimpa di bumi dan (tidak pula) pada dirimu sendiri,” ini mencakup seluruh musibah yang menimpa makhluk, baik dan buruknya, semuanya, baik yang kecil maupun yang besar telah tertulis di Lauhul Mahfuzh. Ini merupakan sesuatu yang besar dana gung yang tidak bisa dicerna akal, bahkan bisa mengacaukan hati orang-orang berakal, namun hal itu mudah bagi Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Hadid ayat 22: Allah menjelaskan bahwa musibah yang menimpa hamba di bumi dari kekeringan dan gempa bumi, telah didahului oleh takdir dan kuasa-Nya, dan telah tertulis di lauhul mahfudz, sebelum diciptakannya seluruh makhluk."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala berfirman menerangkan meratanya qadha’ dan qadar-Nya. Seperti kemarau panjang. Ayat ini mencakup semua musibah yang menimpa makhluk, yang baik maupun yang buruk, dimana semuanya telah tertulis dalam Lauh Mahfuzh yang kecil maupun yang besar. Perkara ini adalah perkara besar yang tidak dapat dijangkau akal, bahkan hati orang-orang yang berakal sampai lalai di sini, tetapi bagi Allah yang demikian sangat mudah. Allah Subhaanahu wa Ta'aala telah memberitahukan kepada hamba-hamba-Nya yang demikian agar kaidah ini menetap pada mereka dan mereka mendasari di atasnya dalam semua yang mereka peroleh, baik atau buruk, sehingga mereka tidak berputus asa dan bersedih terhadap hal yang luput dari mereka dimana diri mereka rindu kepadanya karena mereka mengetahui bahwa hal itu tertulis dalam Lauh Mahfuzh, harus diberlakukan dan harus terjadi sehingga tidak ada jalan untuk menolaknya, demikian pula mereka tidak bergembira dengan sombong terhadap apa yang Allah berikan kepada mereka karena mereka tahu bahwa yang mereka peroleh itu bukan karena upaya dan kekuatan mereka, tetapi dengan karunia Allah dan nikmat-Nya, sehingga mereka pun menyibukkan diri dengan bersyukur kepada Allah yang melimpahkan nikmat itu dan menghindarkan bahaya dari mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hadid Ayat 22",
    "description": "Usai menjelaskan karunia-Nya kepada orang memohon ampunan, Allah menerangkan bahwa semua yang terjadi di alam ini merupakan ketetapan Allah yang tertulis di lauh mahfuz. Setiap bencana yang menimpa di bumi, seperti gempa, banjir, erupsi, dan lainnya, dan demikian pula bencana yang menimpa dirimu sendiri, seperti sakit, kecelakaan, dan lainnya, semuanya telah tertulis dalam kitab yang disebut lauh mahfuz sebelum kami mewujudkannya. Sungguh, yang demikian itu, yaitu semua yang terjadi, sangat mudah bagi Allah. 23. Kami beritahukan hal tersebut agar kamu tidak bersedih hati terhadap apa yang luput dari kamu dan tidak dapat kamu capai, dan jangan pula terlalu gembira dan sombong terhadap apa yang diberikan-Nya kepadamu. Dan ketahuilah, Allah tidak menyukai setiap orang yang sombong dan membanggakan diri dengan kelebihan atau anugerah yang dia karuniakan."
  }
]