[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "23-24. Agar kalian tidak bersedih atas dunia yang luput dari tangan kalian, kalian juga tidak berbangga dengan apa yang Allah berikan kepada kalian dengan kebanggaan yang mengandung keangkuhan dan kesombongan. Dan Allah tidak menyukai setiap orang yang menyombongkan diri dengan dunia yang dimilikinya, membanggakannya di depan orang lain. Orang- orang yang sombong itu adalah orang-orang yang kikir dengan harta mereka, mereka tidak menafkahkannya di jalan Allah, juga menyuruh orang-orang agar bersikap bakhil dengan menghiasinya bagi mereka. Barangsiapa berpaling dari ketaatan kepada Allah, ia tidak merugikan kecuali dirinya sendiri, dan sama sekali tidak merugikan Allah. sesungguhnya Allah Mahakaya, tidak membutuhkan mahklukNya, juga Maha Terpuji, Pemilik semua sifat yang baik dan sempurna, serta perbuatan baik yang berhak untuk dipuji karenanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "23. Hal itu agar kalian tidak bersedih -wahai manusia- atas apa yang tidak kalian dapatkan dan agar kalian tidak bergembira atas apa yang diberikan kepada kalian dengan kegembiraan yang melampaui batas. Sesungguhnya Allah tidak menyukai setiap orang yang sombong dan membanggakan diri atas manusia dengan apa yang diberikan Allah kepadanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "21. سَابِقُوٓا۟ إِلَىٰ مَغْفِرَةٍ مِّن رَّبِّكُمْ (Berlomba-lombalah kamu kepada (mendapatkan) ampunan dari Tuhanmu) Yakni saling bergegaslah beramal shalih yang dapat mengundang ampunan dari Tuhan kalian. Di antaranya adalah dengan bergegas menuju ke masjid agar dapat bertakbir bersama imam pada takbir yang pertama, dan juga berusaha mendapatkan shaf pertama dalam shalat, serta membaikkan segala amalan yang dikerjakan. وَجَنَّةٍ عَرْضُهَا كَعَرْضِ السَّمَآءِ وَالْأَرْضِ(dan surga yang luasnya seluas langit dan bumi) Dan jika luasnya demikian maka bagaimana dengan panjangnya. أُعِدَّتْ لِلَّذِينَ ءَامَنُوا۟ بِاللهِ وَرُسُلِهِۦ ۚ( yang disediakan bagi orang-orang yang beriman kepada Allah dan Rasul-rasul-Nya) Yakni tidak ada yang layak mendapatkannya kecuali orang yang menjalankan perintah Allah dan menjauhi larangan-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "23. Kami jelaskan hal itu kepada kalian supaya kalian tidak bersedih atas apa yang terlewat dari kalian berupa kenikmatan dunia dan janganlah kalian merasa senang atas apa yang kalian dapatkan dengan sombong karena Allah tidak suka. Dia akan menghukum setiap orang yang sombong atas apa yang didapatkannya dengan memamerkan harta dan ketenarannya kepada manusia."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Agar kalian tidak bersedih} bersedih {terhadap apa yang luput dari kalian dan tidak pula terlalu gembira} bergembira dengan angkuh dan sombong {terhadap apa yang Dia berikan kepada kalian. Allah tidak menyukai setiap orang yang sombong} yang sombong terhadap apa yang diberikan di dunia {lagi membanggakan diri} membanggakan diri terhadap orang lain"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "23. Allah mengabarkan hal itu kepada para hambaNya agar kaidah ini lekat di hati mereka. Agar mereka merujukkan semua kebaikan dan keburukan berdasarkan kaidah tersebut supaya mereka tidak merasa putus asa dan bersedih atas sesuatu yang luput dari mereka, di samping agar hati mereka tidak tamak dan memburu apa yang tidak didapatkan, karena mereka mengetahui bahwa hal itu telah tertulis di Lauhul Mahfuzh yang pasti berlaku dan terjadi; tidak ad acara untuk menolaknya. Tujuan lain adalah agar manusia tidak terlalu bergembira dengan bersikap sombong terhadap pemberian Allah, sehingga mereka sibuk bersyukur kepada Allah yang memberikan berbagai kenikmatan dan mencegah azab. Karena itu Allah berfirman, “Dan Allah tidak menyukai setiap orang yang sombong lagi membanggakan diri.” Yaitu, orang angkuh, berhati keras, kasar, merasa kagum terhadap diri sendiri, membanggakan diri dengan berbagai nikmat Allah yang dinyatakan sebagai hasil usahanya sendiri, hingga ia pun melampaui batas dan melalaikan kenikmatan-kenikmatan itu. Sebagaimana firman Allah : kemudian apabila Kami berikan nikmat Kami kepadanya dia berkata, “Sesungguhnya aku diberi nikmat ini hanyalah karena kepintaranku.” Sebenarnya, itu adalah ujian, tetapi kebanyakan mereka tidak mengetahui. Az-Zumar : 49"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Hadid ayat 23: Allah menjelaskan semisal ini agar kalian tidak bersedih atas apa yang luput dari dunia, dan agar kalian tidak terlalu bergembira atas apa yang telah Allah berikan dari dunia. Karena semua itu akan hilang dengan cepat dan Allah tidak menyukai orang-orang yang sombong akan dunia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang dimaksud dengan terlalu gembira, ialah gembira yang melampaui batas yang menyebabkan kesombongan, ketakaburan dan lupa kepada Allah, bahkan yang benar adalah gembira bersyukur. Terhadap apa yang diberikan kepadanya dan merasa ujub dengannya. Di hadapan manusia, ia menisbatkan nikmat itu kepada dirinya, tidak kepada Allah Subhaanahu wa Ta'aala."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hadid Ayat 23",
    "description": "Kami beritahukan hal tersebut agar kamu tidak bersedih hati terhadap apa yang luput dari kamu dan tidak dapat kamu capai, dan jangan pula terlalu gembira dan sombong terhadap apa yang diberikan-Nya kepadamu. Dan ketahuilah, Allah tidak menyukai setiap orang yang sombong dan membanggakan diri dengan kelebihan atau anugerah yang dia karuniakan. 24. Allah tidak menyukai orang sombong dan membanggakan diri, yaitu orang-orang yang kikir, yang enggan menginfakkan sebagian hartanya di jalan Allah, dan menyuruh orang lain berbuat kikir pula. Barang siapa berpaling dari perintah Allah dan mengingkari ajaran-Nya, maka sesungguhnya Allah, dia mahakaya dan tidak memerlukan sesuatu, maha terpuji dengan segala sifat kebaikan-Nya."
  }
]