[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "23-24. Agar kalian tidak bersedih atas dunia yang luput dari tangan kalian, kalian juga tidak berbangga dengan apa yang Allah berikan kepada kalian dengan kebanggaan yang mengandung keangkuhan dan kesombongan. Dan Allah tidak menyukai setiap orang yang menyombongkan diri dengan dunia yang dimilikinya, membanggakannya di depan orang lain. Orang- orang yang sombong itu adalah orang-orang yang kikir dengan harta mereka, mereka tidak menafkahkannya di jalan Allah, juga menyuruh orang-orang agar bersikap bakhil dengan menghiasinya bagi mereka. Barangsiapa berpaling dari ketaatan kepada Allah, ia tidak merugikan kecuali dirinya sendiri, dan sama sekali tidak merugikan Allah. sesungguhnya Allah Mahakaya, tidak membutuhkan mahklukNya, juga Maha Terpuji, Pemilik semua sifat yang baik dan sempurna, serta perbuatan baik yang berhak untuk dipuji karenanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. Orang-orang yang kikir dengan apa yang seharusnya mereka keluarkan dan memerintahkan orang lain untuk berbuat kikir, mereka adalah orang-orang yang merugi. Dan barangsiapa berpaling dari ketaatan terhadap Allah, maka sekali-kali dia tidak menimpakan mudarat kepada Allah, akan tetapi mereka menimpakan mudarat pada diri mereka sendiri. Sesungguhnya Allah Mahakaya, tidak butuh ketaatan hamba-hamba-Nya dan Maha Terpuji dalam setiap keadaan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "24. الَّذِينَ يَبْخَلُونَ وَيَأْمُرُونَ النَّاسَ بِالْبُخْلِ ۗ( (yaitu) orang-orang yang kikir dan menyuruh manusia berbuat kikir) Yakni enggan menunaikan hak Allah dan tidak mau bersedekah, dan mereka menghiasi kepada orang lain perbuatan kikir dengan perkataan dan perbuatan mereka, seperti dengan membanggakan diri dengan harta mereka sehingga orang lain ingin seperti mereka, dan menjadikan mereka kikir dan enggan melakukan kebaikan. وَمَن يَتَوَلَّ فَإِنَّ اللهَ هُوَ الْغَنِىُّ الْحَمِيدُ(Dan barangsiapa yang berpaling (dari perintah-perintah Allah) maka sesungguhnya Allah Dialah Yang Maha Kaya lagi Maha Terpuji) Yakni barangsiapa yang enggan berinfak maka sesungguhnya Allah tidak membutuhkannya dan Dia terpuji di antara makhluk-makhluk-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "24. Mereka adalah orang-orang yang kikir atas apa yang seharusnya mereka nafkahkan. Mereka juga memerontahkan orang-orang untuk berlaku kikir. Mereka suka meninggalkan hak-hak Allah dan menolak untuk menafkahkan harta yang diminta untuk diinfakkan. Maka sesungguhnya Allah Maha Kaya darinya dan nafkahnya, Dzat yang dipuji oleh makhluk-makhlukNya atas Dzat, Sifat, dan TindakanNya. Yang mereka lakukan itu tidak berpengaruh bagiNya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Orang-orang yang kikir dan menyuruh orang lain kikir. Siapa saja yang berpaling} berpaling dari ketaatan kepada Allah {sesungguhnya Allah, Dialah Dzat Yang Maha kaya lagi Maha Terpuji"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "24. “(Yaitu) orang-orang yang kikir dan menyuruh manusia berbuat kikir.” Maksudnya, mereka memadukan dua hal tercela yang masing-masing dari keduanya sudah cukup buruk, yaitu kikir dengan cara menahan hak yang wajib serta memerintahkan orang lain untuk bersikap serupa. Mereka tidak cukup hanya bersikap kikir saja hingga mereka pun memerintahkan orang lain untuk bersikap kikir pula dan mendorong mereka untuk bersikap tercela dengan perkataan dan perbuatan. Inilah salah satu dari bentuk berpaling dari ketaatan kepada Allah “dan barangsiapa yang berpaling” dari ketaatan kepada Allah, maka ia hanya membahayakan dirinya sendiri, sama sekali tidak akan membahayakan Allah, “maka sesungguhnya Allah, Dia-lah Yang Mahakaya lagi Maha Terpuji,” yang kekayaanNya merupakan kemestian dari DzatNya yang bagiNyalah kerajaan langit dan bumi, Dia-lah Yang memberi kecukupan hamba-hambaNya dan memberi mereka makan. Maha Terpuji, yang bagiNya nama baik dan sifat sempurna, serta perbuatan baik yang berhak dipuji, disanjung, dan diagungkan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Hadid ayat 24: Allah menjelaskan bahwa mereka yang telah diberikan dunia bakhil dari harta-harta mereka, mereka tidak menginfakkan harta-harta mereka di jalan Allah, dan lebih buruk dari ini, mereka memerintahkan manusia untuk bakhil. Kemudian Allah mengabarkan bahwa barangsiapa yang menolak infak di jalan Allah maka sungguh Allah Maha Kaya darinya, dan dari infak mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Terhadap yang wajib mereka keluarkan. Yakni bagi mereka ini azab yang pedih. Mereka menggabung antara dua perkara yang tercela, dimana salah satunya sesungguhnya sudah cukup menunjukkan keburukannya. Kedua perkara itu adalah yang pertama bakhil (kikir), yaitu menahan hak-hak yang wajib diberikan, dan yang kedua adalah memerintahkan manusia berbuat demikian dengan mendorong berbuat kikir baik dengan ucapan maupun perbuatan. Ini tidak lain karena berpaling dari menaati Allah, padahal barang siapa berpaling dari menaati Allah, maka tidak ada yang ia rugikan kecuali dirinya dan Allah tidaklah terkena madharrat sedikit pun, karena Dia Mahakaya lagi Maha Terpuji, dimana kekayaan menjadi lawazim (yang mesti) pada zat-Nya; milik-Nya kerajaan langit dan bumi, dan Dialah yang mengkayakan hamba-hamba-Nya dan mencukupkan mereka, dan Dia Maha Terpuji; Dia memiliki semua nama yang baik, sifat yang sempurna, perbuatan yang indah sehingga berhak untuk dipuji, disanjung dan diagungkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hadid Ayat 24",
    "description": "Allah tidak menyukai orang sombong dan membanggakan diri, yaitu orang-orang yang kikir, yang enggan menginfakkan sebagian hartanya di jalan Allah, dan menyuruh orang lain berbuat kikir pula. Barang siapa berpaling dari perintah Allah dan mengingkari ajaran-Nya, maka sesungguhnya Allah, dia mahakaya dan tidak memerlukan sesuatu, maha terpuji dengan segala sifat kebaikan-Nya. 25. Sungguh, kami telah mengutus rasul-rasul kami kepada umat manusia dengan bukti-bukti yang nyata, dan kami turunkan bersama mereka kitab sebagai pedoman hidup, dan kami turunkan pula neraca sebagai ukuran keadilan agar manusia dapat berlaku adil. Dan kami menciptakan besi sebagai kelengkapan hidup yang mempunyai kekuatan, hebat, dan banyak manfaat bagi manusia, dan kami ciptakan semua itu agar Allah mengetahui siapa yang menolong agama-Nya dan rasul-rasul-Nya dalam berdakwah, walaupun Allah tidak dilihatnya. Sesungguhnya Allah mahakuat terhadap segala sesuatu, mahaperkasa menghadapi semua yang mengingkari-Nya."
  }
]