[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "26. Sungguh Kami telah mengutus Nuh dan Ibrahim ke kaum mereka, Kami menjadikan pada anak keturunan keduanya kenabian dan kitab-kitab yang diturunkan. Diantara anak keturunan mereka ada yang mendapatkan petunjuk ke jalan yang benar, tetapi banyak juga dari mereka yang menyimpang dari ketaatan kepada Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "26. Dan sungguh Kami telah mengutus Nuh dan Ibrahim -‘alaihimasssalām- sebagai rasul, dan Kami jadikan kenabian di keturunan keduanya. Dan Kami menjadikan kenabian ada di keturunan keduanya, demikian juga dengan kitab-kitab yang diturunkan. Di antara keturunan keduanya ada orang yang mendapat petunjuk ke jalan yang lurus, ada yang mendapat taufik, dan banyak dari mereka yang keluar dari ketaatan kepada Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "26. Sungguh Kami telah mengutus Nabi Nuh dan Ibrahim kepada kaum mereka, dan Kami menjadikan banyak dari keturunan mereka sebagai nabi, serta Kami menurunkan kepada mereka kitab-kitab. Sebagian keturunan mereka menjadi hamba-hamba yang mendapat petunjuk, namun banyak juga dari mereka yang tidak mentaati Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "26. وَجَعَلْنَا فِى ذُرِّيَّتِهِمَا النُّبُوَّةَ وَالْكِتٰبَ ۖ( dan Kami jadikan kepada keturunan keduanya kenabian dan Al Kitab) Yakni Kami jadikan kenabian di antara mereka, karena seluruh nabi berasal dari keturunan Nabi Nuh dan Nabi Ibrahim, dan kitab-kitab yang diturunkan Allah tidak diturunkan kepada selain mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "26. Sungguh Kami telah mengutus Nuh dan Ibrahim sebagai rasul kepada kaum mereka. Kami juga memberikan kepada anak cucu mereka nubuwwah dan kitab-kitab yang diturunkan untuk disampaikan kepada umat manusia. Di antara anak cucunya itu ada yang mendapat petunjuk menuju keimanan dan kebanyakan dari mereka keluar dari jalan yang lurus."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sungguh Kami benar-benar telah mengutus Nuh dan Ibrahim serta Kami memberikan kenabian dan kitab kepada keturunan keduanya. Di antara mereka ada yang menerima petunjuk dan banyak di antara mereka yang fasik"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "26. Pada saat Allah menyebutkan kenabian para nabi secara umum, Allah menyebutkan secara khusus sua nabi mulia di antara mereka, yaitu Nabi Nuh dan Nabi Ibrahim yang pada keturunan mereka, Allah mengumpulkan kenabian dan kitab. Allah berfirman, “Dan sungguh Kami telah mengutus Nuh dan Ibrahim dan Kami jadikan pada keturunan keduanya kenabian dan al-KItab,” yakni para nabi yang terdahulu dan yang datang kemudian, semuanya berasal dari keturunan Nabi Nuh dan Nabi Ibrahim. Begitu juga semua kitab samawi, semuanya diturunkan pada keturunan kedua nabi mulia ini. “Maka di antara mereka,” yaitu kaum yang kepada mereka Kami utuskan para rasul, “ada yang menerima petunjuk,” atas seruan mereka, mematuhi perintah mereka dan menjadikan arahan mereka sebagai petunjuk, “dan banyak di antara mereka yang fasik,” yaitu melenceng dari ketaatan terhadap Allah dan ketaatan terhadap para rasulNya. Ini semakna dengan Firman Allah, Dan sebahagian besar manusia tidak akan beriman — walaupun kamu sangat menginginkannya. -Yusuf:103-"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Hadid ayat 26: Allah mengabarkan tentang nikmat fisik yang diberikan kepada para Nabi-Nya. Dan sesungguhnya Allah telah mengutus Nuh dan Ibrahim dan Allah jadikan kepada keturunan keduanya kenabian dan Al Kitab, maka di antara mereka ada yang menerima petunjuk dan banyak di antara mereka fasik."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala menyebutkan kenabian para nabi secara umum, maka Dia menyebutkan di antara mereka nabi pilihan seperti Nuh dan Ibrahim ‘alaihimas salam yang Allah jadikan kenabian dan kitab pada keturunannya. Oleh karena itu, para nabi yang terdahulu dan yang datang kemudian semuanya berasal dari keturunan Nabi Nuh dan Nabi Ibrahim ‘alaihimas salam. Yang diutus kepada mereka para rasul. Dengan dakwah para rasul, tunduk kepada perintah mereka dan mengambil petunjuk mereka. Yakni keluar dari ketaatan kepada Allah dan rasul."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hadid Ayat 26",
    "description": "Kehidupan kependetaan bukan ajaran Allah. Dan sungguh, kami telah mengutus nabi nuh dan ibrahim kepada umat masing-masing untuk mengajak mereka bertauhid, dan kami berikan pula kenabian dan kitab petunjuk kepada keturunan keduanya; di antara mereka ada yang menerima petunjuk itu sehingga beriman dan berbuat kebajikan sesuai perintah-Nya, dan banyak di antara mereka yang fasik akibat mengingkari petunjuk itu dan memilih kekafiran. 27. Sesudah nabi nuh dan ibrahim, kemudian kami susulkan rasul-rasul kami untuk mengikuti jejak mereka, yaitu dengan mengajak umatnya beriman dan mentaati perintah-Nya, dan kami susulkan pula isa putra maryam, dan kami berikan injil kepadanya sebagai pedoman bagi umatnya, dan kami jadikan rasa santun dan kasih sayang kepada sesama manusia dalam hati orang-orang yang mengikutinya. Sebagian dari mereka mengada-adakan rahb'niyyah, yaitu hidup membujang dan mengurung diri dalam biara, padahal kami tidak mewajibkannya kepada mereka. Ka-mi hanya mewajibkan mereka untuk mencari keridaan Allah, tetapi tuntunan itu tidak mereka pelihara dengan semestinya. Maka, kepada orang-orang yang beriman di antara mereka dan berbuat kebajikan, kami berikan pahalanya. Dan banyak di antara mereka yang fasik dengan mengingkari atau mengubah ajaran itu."
  }
]