[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "27. Kemudian Kami mengutus sesudah Nuh dan Ibrahim para utusan Kami yang Kami mengutus mereka dengan keterangan-keterangan yang nyata. Dan Kami susulkan juga Isa putra Maryam dan memberinya Injil. Kami menjadikan hati orang-orang yang mengikuti agamanya lunak dan mengasihi, mereka saling mengasihi di antara mereka, lalu mereka membuat kerahiban dengan bersikap ghuluw dalam beribadah yang tidak Kami wajibkan kepada mereka, sebaliknya merekalah yang merekayasanya sendiri, maksud mereka adalah meraih ridha Allah, tetapi mereka tidak menegakannya dengan benar, maka Kami memberi orang-orang yang beriman kepada Allah dan para RasulNya dari mereka pahala mereka menurut iman mereka, dan kebanyakan dari mereka keluar dari ketaatan kepada Allah, juga mendustakan Rasulullah, Muhammad."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "27. Kemudian Kami iringkan para Rasul Kami, dan Kami utus mereka secara berturut-turut kepada umat-umat mereka, lalu Kami iringkan mereka dengan Isa bin Maryam dan Kami berikan kepadanya Injil, dan Kami jadikan di hati orang-orang yang beriman kepadanya dan mengikutinya rasa iba dan sayang, mereka adalah orang-orang yang saling mencintai dan menyayangi di antara mereka. Dan mereka kemudian mengada-adakan sesuatu yang melampaui batas dalam agama, lalu mereka meninggalkan sebagian yang dihalalkan oleh Allah untuk mereka seperti nikah dan kenikmatan, padahal Kami tidak memintanya dari mereka, akan tetapi mereka mewajibkan diri mereka sendiri sebagai bentuk mengada-ada dalam agama dari mereka. Kami hanya meminta mencari keridaan Allah, akan tetapi mereka tidak melaksanakannya. Maka Kami berikan kepada orang-orang yang beriman dari mereka pahala, dan banyak dari mereka keluar dari ketaatan kepada Allah dengan mendustakan apa yang dibawa oleh rasul, Muhammad -ṣallallāhu 'alaihi wa sallam-, kepada mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "27. Kemudian Kami utus rasul-rasul yang lain setelah mereka, dan kami menjadikan Isa bin Maryam seorang rasul setelah rasul-rasul itu, Kami memberinya kitab Injil, dan Kami jadikan para pengikutnya memiliki hati yang lembut dan penyayang. Kemudian para rahib dan pendeta mereka membuat kerahiban dengan hidup hanya untuk peribadatan; padahal Kami tidak menetapkan hal itu, namun merekalah yang mengada-adakannya dengan niat mengharap keridhaan Allah, namun mereka tidak menjalankannya dengan benar. Kemudian Kami balas orang-orang beriman dari mereka dengan pahala yang berlimpah. Namun banyak pula dari mereka yang menyelisihi perintah Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "26. وَجَعَلْنَا فِى ذُرِّيَّتِهِمَا النُّبُوَّةَ وَالْكِتٰبَ ۖ( dan Kami jadikan kepada keturunan keduanya kenabian dan Al Kitab) Yakni Kami jadikan kenabian di antara mereka, karena seluruh nabi berasal dari keturunan Nabi Nuh dan Nabi Ibrahim, dan kitab-kitab yang diturunkan Allah tidak diturunkan kepada selain mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "27.Kemudian kami ikutkan atas anak cucu mereka, yaitu di jalan yang mereka lewati itu rasul-rasul kami yang diutus untuk menunjukkan mereka kepada kebenaran mereka. Kami sertakan kepada mereka Isa bin Maryam, yaitu cucu Ibrahim yang lahir dari Ibunya. Kami beri dia Injil. Dan kami berikan kebahagiaan dan kasih sayang dalam hati orang-orang yang beriman kepada riaslahnya dan mengikuti agamanya, yaitu Al-Hawariyun dan pengikut-pengikutnya. Yaitu mereka yang mengikuti hukum-hukum agama, batasan-batasan, dan hukum muamalah. Mereka mengadakan Rahbaniyyah, yaitu Ibadah yang berlebih dan diikuti dengan pengasingan diri. Kami tidak mewajibkan mereka melakukan itu, namun mereka melakukan dan mengadakan hal itu untuk diri mereka sendiri dengan maksud agar diridhai Allah. Mereka tidak memeliharanya dengan tepat, bahkan mereka melalaikan dan menyimpang dari hal itu. Lalu kami berikan kepada orang-orang yang beriman di antara mereka pahala yang layak, yaitu orang-orang yang ikhlas dalam keimanan mereka. Kebanyakan dari biarawan itu tidak mengikuti perintah-perintah Allah SWT. Ar-Ra’fatu adalah mencegah kejahatan dengan ketamahan dan kelembutan. Ar-Rahmah adalah memberikan kebaikan dan cinta dengan cara yang baik"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kemudian Kami meneruskan} Kami mengikti {jejak mereka dengan (mengutus) rasul-rasul Kami dan Kami meneruskan Isa putra Maryam serta Kami memberikan Injil kepadanya. Kami menjadikan dalam hati orang-orang yang mengikutinya kesantunan dan kasih sayang, serta Mereka mengada-adakan rahbaniah} berlebihan dalam beribadah {Padahal, Kami tidak mewajibkannya} Kami tidak mewajibkannya {kepada mereka, kecuali untuk mencari keridhaan Allah} akan tetapi mereka mengada-adakannya untuk mencari keridhaan Allah terhadap mereka {lalu mereka tidak memeliharanya dengan sebaik-baiknya} lalu mereka tidak menjaganya dengan sebenar-benarnya {Maka Kami memberikan kepada orang-orang yang beriman di antara mereka pahala mereka dan kebanyakan di antara itu orang-orang fasik"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "27. “Kemudian Kami iringi,” yakni, Kami sambung, “di belakang mereka dengan rasul-rasul Kami dan Kami iringi (pula) dengan Isa putra Maryam.” Allah secara khusus menyebut Nabi Isa, karena alur pembicaraan ini untuk orang-orang Nasrani, mereka yang mengklaim sebagai pengikut Nabi Isa, “Dan Kami berikan kepadanya Injil,” yang termasuk salah satu kitab Allah yang mulia, “ dan Kami jadikan dalam hati orang-orang yang mengikutinya rasa santun dan kasih sayang.” Ini sejalan dengan Firman Allah, -Almaidah:82- Karena itulah orang-orang Nasrani adalah orang-orang yang paling berhati lunak ketika mereka masih berada di atas syariat Nabi Isa, “dan mereka mengada-ngadakan rahbaniyyah.” Rahbaniyyah adalah ibadah; mereka membuat-buat ibadah sendiri. Ibadah-ibadah karangan mereka itu mereka wajibkan atas diri mereka, padahal Allah tidak mewajibkannya atas mereka, tapi mereka sendirilah yang mewajibkannya atas diri mereka sendiri dengan niat mendapatkan keridhaan Allah, namun demikian “mereka tidak memeliharanya dengan pemeliharaan yang semestinya.” Maksudnya, mereka tidak menunaikannya dan tidak melaksanakan hak-haknya. Dengan demikian mereka melakukan dua kelalaian. Mengarang-ngarang sendiri (ajaran agama) dan tidak menunaikan tugas yang mereka sendiri yang mewajibkannya pada diri mereka. Namun di antara mereka ada juga yang konsisten di atas perintah Allah, karena itulah Allah berfirman, “Maka Kami berikan kepada orang-orang yang beriman di antara mereka pahala-pahalanya.” Yaitu mereka yang beriman kepada Nabi Muhammad di samping beriman kepada Nabi Isa, masing-masing diberi balasan oleh Allah berdasarkan keimanannya. “Dan banyak di antara mereka orang-orang yang fasik.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Hadid ayat 27: Kemudian Allah iringi di belakang mereka dengan rasul-rasul dan Allah iringi (pula) dengan Isa putra Maryam; dan Allah berikan kepadanya Injil dan dijadikan dalam hati orang-orang yang mengikutinya rasa santun dan kasih sayang. Dan mereka mengada-adakan rahbaniyyah padahal Allah tidak mewajibkannya kepada mereka tetapi (mereka sendirilah yang mengada-adakannya) untuk mencari keridhaan Allah, lalu mereka tidak memeliharanya dengan pemeliharaan yang semestinya. Maka Allah berikan kepada orang-orang yang beriman di antara mereka pahalanya dan banyak di antara mereka orang-orang fasik."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala mengkhususkan Nabi Isa ‘alaihis salam, karena susunan ayat ini berkenaan dengan orang-orang Nasrani yang mengaku mengikuti Nabi Isa ‘alaihis salam. Yang termasuk di antara kitab-kitab Allah yang utama. Oleh karena itulah orang-orang Nasrani lebih lunak hatinya daripada yang lain ketika mereka berada di atas syariat Nabi Isa ‘alaihis salam. Yang dimaksud dengan Rahbaniyah ialah tidak beristri atau tidak bersuami dan mengurung diri dalam biara. Allah Subhaanahu wa Ta'aala tidak mewajibkan hal itu kepada mereka, bahkan merekalah yang mewajibkannya dari diri mereka sendiri dengan maksud mencari keridhaan Allah Subhaanahu wa Ta'aala. Yakni mereka tidak melakukannya dan memenuhi hak-haknya, sehingga mereka melakukan dua kesalahan; berbuat bid’ah dan tidak melakukan apa yang mereka wajibkan terhadap diri mereka. Keadaan inilah yang dilakukan mereka pada umumnya. Kepada Nabi Muhammad shallallahu 'alaihi wa sallam setelah beriman kepada Nabi Isa ‘alaihis salam, maka masing-masing mendapatkan pahala sesuai keimanannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hadid Ayat 27",
    "description": "Sesudah nabi nuh dan ibrahim, kemudian kami susulkan rasul-rasul kami untuk mengikuti jejak mereka, yaitu dengan mengajak umatnya beriman dan mentaati perintah-Nya, dan kami susulkan pula isa putra maryam, dan kami berikan injil kepadanya sebagai pedoman bagi umatnya, dan kami jadikan rasa santun dan kasih sayang kepada sesama manusia dalam hati orang-orang yang mengikutinya. Sebagian dari mereka mengada-adakan rahb'niyyah, yaitu hidup membujang dan mengurung diri dalam biara, padahal kami tidak mewajibkannya kepada mereka. Ka-mi hanya mewajibkan mereka untuk mencari keridaan Allah, tetapi tuntunan itu tidak mereka pelihara dengan semestinya. Maka, kepada orang-orang yang beriman di antara mereka dan berbuat kebajikan, kami berikan pahalanya. Dan banyak di antara mereka yang fasik dengan mengingkari atau mengubah ajaran itu. 28. Allah menerangkan keingkaran ahli kitab pada kenabian Muhammad. Wahai orang-orang yang beriman! bertakwalah kepada Allah. Laksa-nakan semua perintah-Nya dan jauhilah semua larangan-Nya, dan berimanlah kepada rasul-Nya, yaitu nabi Muhammad yang diutus untuk melengkapi dan meluruskan syariat terdahulul. Jika kamu melaksanakannya, niscaya Allah memberikan rahmat-Nya kepadamu dua bagian, yaitu kebahagiaan di dunia dan kemuliaan di akhirat, dan menjadikan cahaya terang untukmu yang dengan cahaya itu kamu dapat berjalan dengan tenang tanpa takut tersesat, serta dia akan mengampuni semua dosa kamu bila kamu bertobat dengan sungguh-sungguh. Dan Allah maha pengampun atas dosamu dan dosa seluruh manusia yang bertobat, maha penyayang kepada semua makhluk-Nya."
  }
]