[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "28. Wahai orang-orang yang beriman, laksanakanlah perintah-perintah Allah, jauhilah larangan-laranganNya, dan berimanlah kepada RasulNya, niscaya Allah memberi kalian dua kali lipat dari rahmatNya, memberi kalian cahaya yang membimbing kalian, dan mengampuni dosa-dosa kalian. Allah Maha Pengampun bagi hamba-hambaNya, juga Maha Penyayang kepada mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "28. Wahai orang-orang yang beriman kepada Allah dan melaksanakan apa yang disyariatkan kepada mereka! Bertakwalah kepada Allah dengan melaksanakan segala perintah-Nya dan menjauhi segala larangan-Nya, niscaya Dia memberikan kepada kalian dua bagian dari pahala dan balasan atas keimanan kalian terhadap Muhammad -ṣallallāhu 'alaihi wa sallam- dan kepada para rasul yang telah lalu, dan menjadikan untuk kalian cahaya yang kalian gunakan sebagai petunjuk di kehidupan dunia dan kalian gunakan sebagai penerang di atas titian pada hari Kiamat, dan Dia mengampuni dosa-dosa kalian sehingga Dia tidak menyiksa kalian karenanya. Dan Allah -Subḥānahu- Maha Pengampun lagi Maha Penyayang terhadap hamba-hamba-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "28-29. Allah menyampaikan kepada orang-orang beriman agar mereka takut kepada-Nya dengan menjalankan perintah-perintah-Nya dan menjauhi larangan-larangan-Nya, dan agar mereka beriman kepada Nabi Muhammad dan mengikuti sunnah-sunnah-Nya; sehingga Allah akan memberi mereka dua kali lipat balasan dari rahmat-Nya, dan memberi mereka cahaya sebagai petunjuk bagi mereka, serta mengampuni dosa-dosa mereka. Allah Maha Mengampuni dan Mengasihi hamba-hamba-Nya. Allah mengaruniakan hal itu agar orang-orang Yahudi dan Nasrani yang tidak beriman kepada Nabi Muhammad itu mengetahui bahwa mereka tidak dapat menjamin karunia Allah bagi mereka dan orang lain, dan karunia-Nya hanya ada di tangan-Nya semata, Dia mengarunikannya kepada hamba-Nya yang Dia kehendaki. Allah-lah yang memberi kerunia dan kebaikan yang besar bagi hamba-hamba-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "28. اتَّقُوا۟ اللهَ (bertakwalah kepada Allah) Dengan menjauhi apa yang Dia larang. وَءَامِنُوا۟ بِرَسُولِهِۦ(dan berimanlah kepada Rasul-Nya) Yakni kepada Muhammad. يُؤْتِكُمْ كِفْلَيْنِ مِن رَّحْمَتِهِۦ(niscaya Allah memberikan rahmat-Nya kepadamu dua bagian) Yakni dua kali lipat rahmat dari Allah, karena keimanan kalian kepada Nabi Muhammad setelah keimanan kalian kepada rasul sebelumnya; dan ini diperuntukkan bagi Ahli Kitab. Waallahu a’lam. وَيَجْعَل لَّكُمْ نُورًا تَمْشُونَ بِهِۦ(dan menjadikan untukmu cahaya yang dengan cahaya itu kamu dapat berjalan) Yakni berjalan di atas sirath sebagai menerang mereka. وَيَغْفِرْ لَكُمْ ۚ( dan Dia mengampuni kamu) Yakni dosa-dosa yang telah kalian lakukan. وَاللهُ غَفُورٌ رَّحِيمٌ (Dan Allah Maha Pengampun lagi Maha Penyayang) Yakni memiliki banyak ampunan dan kasih sayang."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "28. Wahai orang-orang beriman kepada Allah dan rasulNya, bertakwalah dalam apa yang telah diperintahkan kepada kalian dan dilarang untuk kalian. Berimanlah kepada Rasulallah Muhammad SAW. Allah akan mengantarkan kalian untuk beriman pada para rasul dengan penuh kasih dan anugrah dariNya. Dia akan menciptakan untuk kalian cahaya yang kalian gunakan untuk berjalan di atas jembatan Shirath. Dan mengampuni dosa-dosa kalian. Allahlah Dzat yang Maha Pengampun bagi orang-orang yang meminta ampunan dan bertaubat, Dzat yang Maha Mengasihi mereka. Ayat ini diturunkan untuk menjelaskan dua imbalan bagi orang-orang mukmin, yaitu serupa dengan imbalan orang-orang mukmin dari ahli kitab dan mereka ditambahi dengan cahaya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, bertakwalah kepada Allah dan berimanlah kepada RasulNya, niscaya Dia menganugerahkan kepada kalian dua bagian} dua bagian {dari rahmatNya dan menjadikan cahaya untuk kalian dimana dengan cahaya itu kalian berjalan} kalian mendapat petunjuk dengan itu {serta Dia memberi ampunan kepada kalian. Allah Maha Pengampun lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "28. Ada kemungkinan pembicaraan (pesan) ayat ini ditujukan kepada ahli kitab, yaitu orang-orang yang beriman kepada Nabi Musa, dan Nabi Isa. Allah memerintah mereka mengerjakan tuntutan keimanan mereka, yaitu bertakwa kepada Allah dan meninggalkan berbagai kemaksiatan serta beriman kepada RasulNya, Muhammad. Jika mereka mau mengerjakan hal itu, maka Allah memberi mereka “dua bagian dari rahmatNya.” Maksudnya, dua bagian pahala, satu bagian atas keimanan mereka terhadap para nabi terdahulu dan satu bagian lain atas keimanan mereka kepada Nabi Muhammad. Kemungkinan lain, ayat ini bersifat perintah umum yang mencakup ahli kitab dan lainnya dan inilah kemungkinan yang zahir. Allah memerintah semua manusia untuk beriman dan bertakwa yang mencakup seluruh bagian agama, baik secara lahir maupun batin, baik yang pokok maupun cabang-cabangnya. Jika mereka mau mengerjakan semua perintah agung ini, Allah pasti memberikan “dua bagian dari rahmatNya,” tidak ada yang mengetahui ukuran serta sifatnya kecuali hanya Allah semata. Satu bagian atas keimanan dan bagian lain atas ketakwaan. Atau satu bagian pahala atas pelaksanaan berbagai perintah dan satu bagian pahala lain karena meninggalkan berbagai larangan, atau keemungkinan bahwa penyebutan bentuk ganda dalam ayat ini menunjukkan pemberian pahala yang berulang. “Dan menjadikan untukmu cahaya, yang dengan cahaya itu kamu dapat berjalan,” maksudnya, memberi kalian ilmu dan cahaya yang kalian jadikan lentera untuk berjalan dalam gelapnya kebodohan dan agar penghuni langit dan bumi memintakan ampunan untuk kalian. “Dan Allah memiliki karunia yang besar.” Sehingga banyaknya pahala yang diberikan oleh Pemilik karunia yang besar itu tidak perlu diherani; karuniaNya meliputi seluruh penghuni langit dan bumi. Tidak ada satu makhluk pun yang terlepas dari karunia Allah barang sekejap mata sekalipun bahkan tidak lebih sedikit dari itu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Hadid ayat 28: Ini adalah seruan Allah kepada hamba-Nya yang beriman dengan sebenar-benarnya keimanan. Allah berkata : Hai orang-orang yang beriman (kepada para rasul), bertakwalah kepada Allah dan berimanlah kepada Rasul-Nya, niscaya Allah memberikan rahmat-Nya kepadamu dua bagian, dan menjadikan untukmu cahaya yang dengan cahaya itu kamu dapat berjalan dan Dia mengampuni kamu. Dan Allah Maha Pengampun lagi Maha Penyayang."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kepada Nabi Musa dan Isa ‘alaihimas salam. Ayat ini menurut sebagian mufassir tertuju kepada Ahli Kitab yang beriman kepada Nabi Musa ‘alaihis salam dan Nabi Isa ‘alaihis salam. Allah Subhaanahu wa Ta'aala memerintahkan mereka untuk melakukan konsekwensi iman mereka, yaitu bertakwa kepada Allah dengan meninggalkan bermaksiat kepada-Nya dan beriman kepada Rasul-Nya Muhammad shallallahu 'alaihi wa sallam, dan bahwa jika mereka melakukan yang demikian, maka Allah akan memberikan pahala dua kali, pahala terhadap keimanan mereka kepada para nabi sebelumnya dan pahala terhadap keimanan mereka kepada Nabi Muhammad shallallahu 'alaihi wa sallam. Namun ayat ini bisa juga umum mencakup Ahli Kitab dan selain mereka, dan inilah yang tampak, yakni Allah Subhaanahu wa Ta'aala memerintahkan mereka beriman dan bertakwa di mana semua bagian agama masuk ke dalamnya, zahir maupun batin, ushul (dasar) maupun furu’ (cabang) dan bahwa jika mereka melaksanakan perintah yang agung ini, maka Allah Subhaanahu wa Ta'aala akan memberikan rahmat-Nya dua bagian yang tidak diketahui sifat dan ukurannya kecuali oleh Allah Subhaanahu wa Ta'aala. Kedua bagian itu adalah pahala terhadap keimanan dan pahala terhadap ketakwaan atau pahala karena mengerjakan perintah dan pahala karena menjauhi larangan atau maksud dua kali di sini adalah diulangnya pemberian lagi setelahnya. Menurut sebagian mufassir, karena kamu beriman kepada dua nabi; Nabi Isa ‘alaihis salam dan Nabi Muhammad shallallahu 'alaihi wa sallam. Di atas shirath (jembatan). Atau maksudnya, Allah Subhaanahu wa Ta'aala memberikan kepadamu ilmu, petunjuk dan cahaya yang dengannya kamu dapat berjalan dalam gelapnya kebodohan. Terhadap keburukanmu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hadid Ayat 28",
    "description": "Allah menerangkan keingkaran ahli kitab pada kenabian Muhammad. Wahai orang-orang yang beriman! bertakwalah kepada Allah. Laksa-nakan semua perintah-Nya dan jauhilah semua larangan-Nya, dan berimanlah kepada rasul-Nya, yaitu nabi Muhammad yang diutus untuk melengkapi dan meluruskan syariat terdahulul. Jika kamu melaksanakannya, niscaya Allah memberikan rahmat-Nya kepadamu dua bagian, yaitu kebahagiaan di dunia dan kemuliaan di akhirat, dan menjadikan cahaya terang untukmu yang dengan cahaya itu kamu dapat berjalan dengan tenang tanpa takut tersesat, serta dia akan mengampuni semua dosa kamu bila kamu bertobat dengan sungguh-sungguh. Dan Allah maha pengampun atas dosamu dan dosa seluruh manusia yang bertobat, maha penyayang kepada semua makhluk-Nya. 29. Semua peringatan itu disampaikan agar ahli kitab mengetahui bahwa sedikit pun mereka tidak akan mendapat karunia Allah jika mereka tidak beriman kepada nabi Muhammad dan mengikuti sunahnya, dan agar mereka mengetahui bahwa karunia itu ada di tangan Allah; dia memberikannya kepada siapa yang dia kehendaki, yaitu mereka yang beriman dan berbuat kebajikan. Dan Allah mempunyai karunia yang besar bagi siapa saja yang mematuhi ajaran-Nya."
  }
]