[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "29. Allah memberi kalian semua itu agar ahli kitab yang tidak beriman kepada Muhammad mengetahui bahwa mereka tidak memiliki sedikitpun karunia Allah yang bisa mereka raih untuk diri mereka atau mereka berikan kepada orang lain. Dan bahwasanya seluruh karunia itu ada di Tangan Allah semata, Dia memberikannya kepada siapa yang Dia kehendaki dari hamba-hambaNya. Allah adalah pemilik kebaikan dan pemberian yang besar lagi luas kepada makhlukNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "29. Dan Kami telah menerangkan karunia Kami yang agung dengan apa yang telah kami siapkan untuk kalian -wahai orang-orang yang beriman- berupa pahala yang dilipatgandakan, agar ahli kitab terdahulu dari kalangan Yahudi dan Nasrani mengetahui bahwa mereka tidak mampu berbuat sedikitpun terhadap karunia Allah dengan memberikannya kepada orang yang mereka inginkan atau menahannya dari orang yang mereka inginkan, dan agar mereka mengetahui bahwa karunia hanya di tangan Allah -Subḥānahu-, diberikan kepada siapa yang dikehendaki-Nya dari hamba-hamba-Nya. Dan Allah mempunyai karunia besar yang dikhususkan untuk orang yang dikehendaki-Nya dari hamba-hamba-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "29. لِّئَلَّا يَعْلَمَ أَهْلُ الْكِتٰبِ أَلَّا يَقْدِرُونَ عَلَىٰ شَىْءٍ مِّن فَضْلِ اللهِ ۙ (supaya ahli Kitab mengetahui bahwa mereka tiada mendapat sedikitpun akan karunia Allah) Yakni agar Ahli Kitab mengetahui bahwa tidak ada yang mampu mendapatkan karunia Allah yang telah diberikan kepada orang yang beriman kepada Muhammad, dan tidak ada yang mampu menghalangi karunia itu yang diberikan kepada orang yang dikehendaki Allah. وَأَنَّ الْفَضْلَ بِيَدِ اللهِ (dan bahwasanya karunia itu adalah di tangan Allah) Di antaranya adalah kenabian, ilmu, dan ketakwaan. يُؤْتِيهِ مَن يَشَآءُ ۚ (Dia berikan karunia itu kepada siapa yang dikehendaki-Nya) Sebagaimana banyak karunia yang diberikan kepada Nabi Muhammad dan para sahabatnya serta umatnya dengan agama Islam."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "29. Agar ahli kitab yaitu orang-orang Yahudi yang tidak beriman kepada Nabi Muhammad SAW itu mengetahui bahwa mereka tidak akan mendapatkan sesuatu yang telah disebutkan yaitu keutamaan dan rahmat Allah. Sesungguhnya keutamaan itu ada di sisi Allah berupa nubuwwah, ilmu dan ketakwaan. Dia memberikannya kepada hamba yang dikehendakiNya. Allah adalah pemilik keutamaan yang Maha Agung. Qatadah berkata: “Telah sampai kepada kami yaitu saat ayat {Yu’tikum kiflaini min rahmatihi} [28] diturunkan, para ahli kitab iri dengan orang-orang muslim. Maka Allah menurunkan ayat {Li allaa ya’lama ahlul kitaabi}” Laa dalam {Li allaa} adalah Laa zaidah yang maknanya agar mengetahui. Sedangkan {Allaa yaqdiruuna} An Mukhaffafah min ats-tsaqilah, Maknanya yaitu mereka tidak mendapatkan apapun dari keutamaanNya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Agar Ahlulkitab mengetahui} agar mengetahui {bahwa mereka tidak akan mendapat karunia Allah sedikitpun dan bahwa karunia itu ada di tangan Allah. Dia menganugerahkannya kepada siapa saja yang Dia kehendaki. Allahlah Dzat yang memilik karunia yang agung"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "29. “(Kami terangkan yang demikian itu) supaya ahli Kitab mengetahui bahwa mereka tiada mendapat sedikit pun akan karunia Allah (jika mereka tidak beriman kepada Muhammad).” Maksudnya, karunia dan kebaikan Kami yang Kami jelaskan kepada kalian ini adalah untuk orang yang beriman secara umum dan bertakwa kepada Allah serta beriman kepada RasulNya, agar orang-orang ahli kitab mengetahui bahwa mereka sama sekali tidak mampu menguasai karunia Allah sedikit pun. Maksudnya, mereka tidak bisa menahan Allah karena keinginan dan akal mereka yang rusak. Mereka berkata, ““Sekali-kali tidak akan masuk surga kecuali orang-orang (yang beragama) Yahudi atau Nasrani” -albaqarah:111- Mereka juga berangan-angan terhadap Allah secara tidak benar. Kemudian Allah memberitahukan bahwa orang-orang yang beriman terhadap Rasulullah dan bertakwa kepada Allah akan mendapatkan dua bagian rahmat Allah dan juga mendapakan cahaya serta ampunan, meski ahli kitab memandang rendah, supaya mereka mengetahui “bahwasanya karunia itu adalah di Tangan Allah, yang Dia berikan kepada siapa yang dikehendakiNya,” berdasarkan kebijakan hikmahNya untuk memberikan karuniaNya. “Dan Allah mempunyai karunia yang besar,” yang ukurannya tidak diketahui."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Hadid ayat 29: Allah menutup surat ini dengan menjelaskan bahwa kenabian bukanlah menurut hawa nafsu manusia. Allah berkata : (Kami terangkan yang demikian itu) supaya ahli Kitab mengetahui bahwa mereka tiada mendapat sedikitpun akan karunia Allah (jika mereka tidak beriman kepada Muhammad ﷺ), dan bahwasanya karunia itu adalah di tangan Allah. Dia berikan karunia itu kepada siapa yang dikehendaki-Nya. Dan Allah mempunyai karunia yang besar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala menerangkan karunia dan ihsan-Nya kepada orang-orang yang beriman dengan iman yang menyeluruh (tanpa memilah-milah), bertakwa kepada Allah dan beriman kepada Rasul-Nya agar Ahli Kitab mengetahui bahwa mereka sedikit pun tidak akan mendapatkan karunia Allah (jika mereka tidak beriman kepada Nabi Muhammad shallallahu 'alaihi wa sallam), padahal mereka sebelumnya mengatakan bahwa tidak ada yang masuk ke surga kecuali orang-orang Yahudi dan Nasrani, dan mereka memiliki banyak angan-angan, maka Allah Subhaanahu wa Ta'aala di ayat ini menerangkan bahwa orang-orang yang beriman kepada Rasul-Nya Muhammad shallallahu 'alaihi wa sallam yang bertakwa kepada Allah itulah yang mendapatkan dua bagian dari rahmat-Nya, mendapatkan cahaya dan ampunan sebagai celaan terhadap Ahli Kitab yang menyangka sebaliknya. Yang demikian juga agar mereka mengetahui, bahwa karunia itu di Tangan Allah, Dia memberikan kepada siapa yang Dia kehendaki sesuai hikmah-Nya. Seperti dengan memberikan pahala dua kali bagi Ahli Kitab yang beriman kepada Nabi Muhammad shallallahu 'alaihi wa sallam. Sehingga tidak seorang pun yang dapat mengukur besarnya. Karunia-Nya merata kepada penghuni langit dan bumi, sehingga tidak ada satu pun makhluk yang lepas dari karunia-Nya meskipun sekejap mata atau kurang dari itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hadid Ayat 29",
    "description": "Semua peringatan itu disampaikan agar ahli kitab mengetahui bahwa sedikit pun mereka tidak akan mendapat karunia Allah jika mereka tidak beriman kepada nabi Muhammad dan mengikuti sunahnya, dan agar mereka mengetahui bahwa karunia itu ada di tangan Allah; dia memberikannya kepada siapa yang dia kehendaki, yaitu mereka yang beriman dan berbuat kebajikan. Dan Allah mempunyai karunia yang besar bagi siapa saja yang mematuhi ajaran-Nya. 1. Pada akhir surah al-had'd Allah menyeru orang-orang beriman agar taat kepada rasul-Nya, niscaya Allah akan memberikan cahaya dan mengampuni mereka. Pada ayat ini dijelaskan, sungguh, Allah telah mendengar ucapan perempuan yang mengajukan gugatan kepadamu tentang suaminya, yang telah menzihar dirinya, yaitu menganggap dirinya sama dengan ibu kandungnya sehingga haram digauli, dan dia pun mengadukan keadaan itu kepada Allah agar Allah memberikan kepastian hukum tentang kasus zihar tersebut dan Allah mendengar percakapan di antara kamu berdua bersama perempuan yang bernama khaulah binti 'a'labah yang dizihar suaminya tersebut. Sesungguhnya Allah maha mendengar semua jenis percakapan yang terbuka maupun tertutup, maha melihat yang tampak maupun yang tersembunyi."
  }
]