[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "3. Dia-lah Yang Maha awal yang sebelumNya tidak ada sesuatu, Maha akhir yang sesudahNya tidak ada sesuatu, Maha zhahir yang di atasNya tidak ada sesuatu, Maha batin yang tidak ada sesuatu pun yang lebih tidak terjangkau dariNya. Tidak ada sesuatu pun di bumi dan di langit yang samar bagi Allah. Dia Maha Mengetahui segala sesuatu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Dia lah Yang Awal, tiada sesuatu pun sebelum-Nya dan Dia lah Yang Akhir, tiada sesuatu pun sesudah-Nya, Dia lah Yang Ẓahir, tiada sesuatu pun di atas-Nya dan Dia lah Yang Baṭin, tiada susuatu pun tersembunyi dari-Nya, dan Dia Maha Mengetahui segala sesuatu, tidak ada yang luput dari-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "3. Dia-lah Yang Awal, tiada sesuatu pun sebelum-Nya dan Dia-lah Yang Akhir, tiada sesuatu pun sesudah-Nya, Dia-lah Yang Zhahir, tiada sesuatu pun di atas-Nya dan Dia-lah Yang Baṭin, tiada susuatu pun tersembunyi dari-Nya, dan Dia Maha Mengetahui segala sesuatu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. هُوَ الْأَوَّلُ (Dialah Yang Awal) Yakni sebelum ada segalanya. وَالْاٰخِرُ(dan Yang Akhir) Yakni akhir dari segalanya. Yakni Yang tetap ada setelah kehancuran seluruh makhluk-Nya. وَالظّٰهِرُ(Yang Zhahir) Yang berkuasa atas segala sesuatu. وَالْبَاطِنُ ۖ( dan Yang Bathin) Yakni yang mengetahui segala yang disembunyikan. Pendapat lain mengatakan, yakni Yang tidak dapat terlihat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Allah Maha Dahulu, tidak ada yang mendahului-Nya, dan Maha Akhir tidak ada yang lebih kekal dari pada Dia. Maha Nyata yang tidak ada sesuatu yang melebihi-Nya, Yang Maha memiliki segala bukti tentang kemahawujudan-Nya. Dia-lah Yang Maha Sirri yang tidak ada apapun yang bisa menjangkau-Nya baik itu akal. Dia-lah Yang Maha Luas Pengetahuannya atas segala sesuatu, tidak ada yang bisa luput dari pengawasan-Nya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dialah Yang Maha awal} Dzat yang tidak ada sesuatu pun sebelumNya {Maha akhir} Dzat yang tidak ada sesuatu pun setelahNya {Maha Nyata} Dzat yang tidak ada sesuatu apapun yang ada di atasNya {dan Maha bathin} Dzat yang tidak ada sesuatu apapun selain Dia {Dia Maha Mengetahui segala sesuatu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3. “Dia-lah Yang awal,” yang sebelumNya tidak ada sesuatu pun, “dan Yang Akhir,” yang sesudahNya tidak ada sesuatu pun, “Yang Zhahir,” yang di atasNya tidak ada sesuatu pun, “dan Dia Maha Mengetahui segala sesuatu,” pengetahuanNYa meliputi segala sesuatu yang Nampak dan yang tersembunyi, meliputi segala rahasia dan segala hal yang telah terdahulu dan yang akan terjadi kemudian."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Hadid ayat 3: Allah mengabarkan bahwa kerajaan-Nya abadi; Allah mengabarkan bahwa Dialah Yang Pertama, yang tidak ada sesuatu apapun sebelum-Nya, Dialah Yang Maha Tinggi yang tidak ada sesuatupun di atas-Nya, Dialah Al Bathin yang tidak ada sesuatupun (berkuasa) selain diri-Nya. Dialah Yang Maha Mengetahui segala sesuatu, yang tidak ada satupun yang luput dan tersembunyi bagi-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang dimaksud dengan Al Awal ialah, yang tidak ada sesuatu pun sebelum-Nya, Al Akhir ialah yang tidak ada sesuatu pun setelah-Nya. Maksud Azh Zhahir ialah, yang tidak ada sesuatu pun di atas-Nya, dan Al Bathin ialah yang tidak ada sesuatu pun di bawah-Nya. Dengan demikian, nama-Nya Azh Zhaahir menunjukkan tingginya Dia di atas semua makhluk-Nya, sedangkan nama-Nya Al Baathin menunjukkan bahwa ilmu-Nya meliputi segala sesuatu dan bahwa tidak ada sesuatu pun yang menghalangi-Nya, pendengaran-Nya mengena kepada semua suara dan penglihatan-Nya menembus semua makhluk-Nya (Lihat Anwaarul Hilaalain fit Ta’aqqubaat ‘alal Jalaalain oleh Dr. Abdurrahman Al Khumais). Ilmu-Nya meliputi segala yang tampak maupun yang tersembunyi, yang samar maupun yang tertutup, perkara yang dahulu maupun yang akan datang."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hadid Ayat 3",
    "description": "Sebagai pencipta, dialah yang awal tanpa permulaan, dan dia pula yang akhir karena dia abadi tanpa batas akhir bagi eksistensinya. Selain itu, dia adalah yang zahir dan mengetahui apa saja yang tampak, dan yang batin dan mengetahui apa saja yang disembunyikan atau yang tersirat dalam hati. Dia lebih dekat kepada makhluk daripada dirinya sendiri, dan dia maha mengetahui segala sesuatu di alam semesta. 4. Dialah yang menciptakan langit dan bumi beserta semua yang ada di dalam dan di antara keduanya dalam enam masa; kemudian setelah penciptaan itu dia bersemayam di atas 'arsy untuk mengatur urusan makhluk-Nya. Apa saja yang terjadi pada ciptaan-Nya tidak pernah luput dari pengetahuan-Nya. Dia mengetahui apa yang masuk ke dalam bumi, seperti hewan yang menyusup, dan apa yang keluar dari dalamnya, seperti tanaman yang tumbuh. Dia mengetahui pula apa yang turun dari langit, seperti air hujan, dan apa yang naik ke sana, seperti kebajikan dan doa manusia. Wajib diyakini bahwa Allah itu ada dan dia bersama kamu di mana saja kamu berada. Dan Allah maha melihat apa yang kamu kerjakan; tidak ada yang tersembunyi dari-Nya."
  }
]