[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "4. Dia-lah Yang menciptakan langit dan bumi dan apa yang ada di antara keduanya dalam enam hari, kemudian Dia bersemayam (Yakni tinggi dan jauh di atas sana) di atas ArasyNya di atas seluruh makhlukNya dengan bersemayam yang sesuai dengan kebesaranNya. Dia Mengetahui apa yang masuk ke dalam bumi berupa biji-bijian, hujan dan lainnnya, dan apa yang turun dari langit, yaitu hujan dan lainnya, dan apa yang naik kepadanya, yaitu para malaikat dan amal-amal. Dan Allah bersama kalian dengan ilmuNya di mana pun kalian berada. Allah Maha Melihat amal-amal kalian yang kalian kerjakan dan akan membalas kalian atasnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Dia lah yang menciptakan langit dan bumi dalam enam hari, dimulai dari hari Ahad dan berakhir pada hari Jumat, dan Dia Mahakuasa untuk menciptakannya lebih cepat dari kedipan mata. Kemudian Dia -Subḥānahu- bersemayam di atas Arasy dengan cara semayam yang patut bagi-Nya. Dia mengetahui apa yang masuk ke dalam bumi seperti hujan, benih-benih dan selain keduanya, apa yang keluar dari bumi seperti tumbuh-tumbuhan, barang-barang tambang dan selain keduanya, dan apa yang turun dari langit seperti hujan, wahyu dan selain keduanya serta mengetahui apa yang naik ke langit seperti malaikat, amal perbuatan manusia dan roh-roh mereka. Dan Dia bersama kalian di mana saja kalian berada -wahai manusia- dengan ilmu-Nya, tidak ada dari kalian sesuatu yang tersembunyi dari-Nya, dan Allah Maha Melihat apa yang kalian kerjakan, tidak ada dari amal perbuatan kalian yang tersembunyi dari-Nya, dan Dia akan membalas kalian atas amal perbuatan kalian itu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "4. Dia yang menciptakan tujuh langit dan bumi dalam enam hari, kemudian Dia bersemayam -sesuai dengan keagungan-Nya- di atas ‘arsy-Nya yang merupakan makhluk yang paling besar dan tinggi. Hanya Dia yang mengetahui kebaikan dan makhluk yang masuk ke tanah dan tanaman dan buah-buahan yang keluar darinya. Dan hanya Dia yang mengetahui keberkahan dan siksaan yang turun dari langit, dan malaikat dan amalan yang naik ke sana. Hai para hamba, Allah bersama kalian dengan ilmu, kekuasaan, dan pengawasan-Nya di manapun kalian berada. Allah Maha Melihat kebaikan atau keburukan yang kalian kerjakan. Ibnu Abbas berkata tentang firman Allah, “Dan Dia bersama kamu di mana saja kamu berada”, yakni Allah di atas ‘arsy, dan ilmu-Nya menyertai kalian. (Majmu’ al-Fatawa 5/495-496, para perawinya tsiqat dan sanadnya hasan)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. هُوَ الْأَوَّلُ (Dialah Yang Awal) Yakni sebelum ada segalanya. وَالْاٰخِرُ(dan Yang Akhir) Yakni akhir dari segalanya. Yakni Yang tetap ada setelah kehancuran seluruh makhluk-Nya. وَالظّٰهِرُ(Yang Zhahir) Yang berkuasa atas segala sesuatu. وَالْبَاطِنُ ۖ( dan Yang Bathin) Yakni yang mengetahui segala yang disembunyikan. Pendapat lain mengatakan, yakni Yang tidak dapat terlihat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Allah adalah Dzat yang menciptakan langit dan bumi dalam enam masa, kemudian beristiwa’ di atas ‘Arsy (Singgasana Raja), Istiwa’ yang sesuai dengan keagunganNya. Dia mengetahui apa yang memasuki bumi berupa hujan, hama dan hal lainnya. Dia juga mengetahui apa yang keluar dari permukaan bumi berupa tumbuh-tumbuhan, air, logam dan lainnya. Dia mengetahui apa yang turun dari langit berupa hujan, rahmat, malaikat, azab dan lain-lain. Dia juga mengetahui apa yang menaiki langit, yaitu asap, malaikat, amal perbuatan hamba dan doa-doa mereka. Dengan kuasa dan ilmuNya, dia bersama makhluk-makhlukNya dan tidak terpisah sedikitpun dari kalian. Maknanya adalah tidak bersama secara Dzat. Allah Maha mengetahui apa yang kalian kerjakan sehingga tidak ada satupun yang luput dariNya dan akan membalas kalian atas hal itu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dialah Dzat yang menciptakan langit dan bumi dalam enam masa. Kemudian Dia bersemayam di atas ʻArsy. Dia mengetahui apa yang masuk ke dalam bumi} sesuatu yang masuk ke dalam bumi berupa biji-bijian, hujan dan lain-lain {dan apa yang keluar darinya serta apa yang turun dari langit dan apa yang naik ke sana} dan apa yang naik ke sana yaitu para malaikat, amal dan nyawa {Dia bersama kalian di mana saja kalian berada. Allah Maha Melihat apa yang kalian kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4. “Dia-lah Yang menciptakan langit dan bumi dalam enam masa,” dimulai dari Hari Ahad dan berakhir pada Hari Jumat, “kemudian Dia bersemayam di atas ‘Arasy,” besemayam dengan cara yang sesuai dengan keagunganNya di atas seluruh makhlukNya. “Dia mengetahui apa yang masuk ke dalam bumi,” baik yang berupa biji-bijian, hewan, hujan, dan lainnya, “dan apa yang keluar darinya,” baik berupa tumbuh-tumbuhan, pepohonan, hewan, dan lainnya, “dan apa yang turun dari langit,” yaitu para malaikat, ruh, takdir, dan rizki, “dana pa yang naik kepadanya,” yaitu para malaikat, ruh, doa, amalan-amalan shalih, dan lainnya. “Dan Dia bersama kamu dimana saja kamu berada,” ini semakna dengan Firman Allah: “Tiada pembicaraan rahasia antara tiga orang, melainkan Dialah keempatnya. Dan tiada (pembicaraan antara) lima orang, melainkan Dialah keenamnya. Dan tiada (pula) pembicaraan antara jumlah yang kurang dari itu atau lebih banyak, melainkan Dia berada bersama mereka di manapun mereka berada.” –Mujadilah: 7- Allah bersama hambaNya maksudnya adalah Allah selalu mengetahui dan melihat (mereka). Karena itulah Allah memberikan peringatan akan adanya pembalasan atas segala perbuatan denga berfirman, “Dan Allah Maha Melihat apa yang kamu kerjakan.” Maksudnya, Allah mengetahui apa saja yang kalian kerjakan serta kebaikan dan keburukan yang muncul dari pekerjaan tersebut, selanjutnya kalian akan diberi balasan dan Allah memelihara balasan amal itu untuk kalian."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Hadid ayat 4: Allah mengabarkan bahwa diri-Nya lah yang menciptakan langit dan bumi dengan kuasa dan hikmah-Nya pada 6 masa, dikatakan : Yaitu masa ukuran dunia, dikatakan juga : Itu adalah masa yang sebagaimana Allah firmankan : وَإِنَّ يَوْمًا عِندَ رَبِّكَ كَأَلْفِ سَنَةٍۢ مِّمَّا تَعُدُّونَ, yang artinya : Sesungguhnya sehari disisi Tuhanmu adalah seperti seribu tahun menurut perhitunganmu. {Al Haaj : 47}, dan ini mungkin yang mendekati kebenaran. Kemudian Allah mengabarkan bahwa diri-Nya tinggi di atas arsy; Yang Beristiwa sebagaimana kemulian dan keagungan-Nya, tidak diketahui bagaimananya, inilah keyakinan Ahlus Sunnah wal Jama’ah, adapun selain mereka mentakwilnya dan berkata : Istiwa maknanya adalah Istaula (berkuasa). Jawaban bagi mereka : Bukankah Allah sebelum berkuasa telah berkuasa sebelum diciptakannya arsy, kemudian Allah mengabarkan bahwa Dia mengetahui urusan yang tersembunyi maupun yang nampak; Mengetahui apa yang di dalam bumi dari hewan, hujan, tambang dan selainnya, dan mengetahuil pula apa yang keluar dari bumi seperti tumbuhan, pertanian dan buah-buahan dan yang berasal dari langit semisal hujan dan selainnya. Dan juga mengetahui apa yang naik dari bumi segala sesuatu seperti malaikat dan amalan-amalan (hamba). Kemudian Allah mengabarkan bahwa ilmu-Nya bersama hamba-Nya di bumi dan di udara, di lautan dan di gela tempat. Di sana Allah memiliki dua maiyyah (kebersamaan) : Kebersamaan Allah secara khusus dengan orang-orang yang beriman yaitu kebersamaan dalam penjagaan, pemberian petunjuk kepada seorang hamba, dan (yang kedua) kebersamaan secara umum dengan manusia pada umumnya dan selain dari manusia yaitu kebersamaan dalam bentuk pengawasan, pengetahuan, penyertaan dan penjagaan amalan-amalan yang dicatat. Ketahuilah ketahuilah bahwa Allah melihat mereka, tidak tersembunyi sesuatupun dari amalan kalian dan ucapan kalian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dimulai dari hari Ahad dan diakhiri pada hari Jum’at. Adapun hari Sabtu, tidak terjadi penciptaan, karena ia adalah hari ketujuh, sehingga dari sanalah dinamakan Sabtu, yang artinya berhenti. Hari di sini menurut sebagian ulama seperti hari di dunia, namun ada yang berpendapat bahwa satu hari tersebut lamanya 1.000 tahun sebagaimana dinyatakan Mujahid dan Imam Ahmad, wallahu a’lam. Bersemayam di atas 'Arsy ialah satu sifat Allah yang wajib kita imani, sesuai dengan kebesaran Allah ‘Azza wa Jalla, di atas semua makhluk-Nya. Seperti air hujan, benih, orang-orang yang telah mati dan lainnya. Seperti tumbuhan, hewan dan barang tambang. Seperti malaikat, taqdir, rezeki, rahmat dan azab. Seperti malaikat, ruh, amal-amal, doa-doa hamba dan lainnya. Dengan ilmu-Nya. Hal ini seperti dalam firman Allah Ta’ala, “Tidakkah kamu perhatikan, bahwa sesungguhnya Allah mengetahui apa yang ada di langit dan di bumi? Tidak ada pembicaraan rahasia antara tiga orang, melainkan Dia-lah keempatnya. Dan tidak ada (pembicaraan antara) lima orang, melainkan Dia-lah keenamnya. Dan tidak ada (pula) pembicaraan antara jumlah yang kurang dari itu atau lebih banyak, melainkan Dia bersama mereka di mana pun mereka berada. Kemudian Dia akan memberitahukan kepada mereka pada hari kiamat apa yang telah mereka kerjakan. Sesungguhnya Allah Maha mengetahui segala sesuatu.” (Terj. Al Mujaadilah: 7) Oleh karena itu, pada akhir ayat Allah Subhaanahu wa Ta'aala menjanjikan untuk memberikan balasan terhadap amal yang dikerjakan hamba. Yakni Dia melihat amal yang muncul dari kamu dan apa yang muncul dari amal itu, baik atau buruk, lalu Dia akan memberikan balasan terhadapnya dan menjaganya untukmu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hadid Ayat 4",
    "description": "Dialah yang menciptakan langit dan bumi beserta semua yang ada di dalam dan di antara keduanya dalam enam masa; kemudian setelah penciptaan itu dia bersemayam di atas 'arsy untuk mengatur urusan makhluk-Nya. Apa saja yang terjadi pada ciptaan-Nya tidak pernah luput dari pengetahuan-Nya. Dia mengetahui apa yang masuk ke dalam bumi, seperti hewan yang menyusup, dan apa yang keluar dari dalamnya, seperti tanaman yang tumbuh. Dia mengetahui pula apa yang turun dari langit, seperti air hujan, dan apa yang naik ke sana, seperti kebajikan dan doa manusia. Wajib diyakini bahwa Allah itu ada dan dia bersama kamu di mana saja kamu berada. Dan Allah maha melihat apa yang kamu kerjakan; tidak ada yang tersembunyi dari-Nya. 5. Allah adalah pencipta semua makhluk, karena itu milik-Nyalah kerajaan langit dan bumi. Semua berasal dari-Nya dan hanya kepada Allah segala urusan yang terkait dengan makhluk dikembalikan."
  }
]