[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "5. Hanya milik Allah kerajaan langit dan bumi, hanya kepada Allah tempat kembali segala urusan makhluk di Hari Kiamat, dan Allah akan membalas mereka atas amal perbuatan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Hanya milik-Nya semata kerajaan langit dan bumi dan hanya kepada-Nya semata segala urusan dikembalikan, lalu Dia menghitung amal perbuatan semua makhluk pada hari Kiamat dan memberi balasan atas amal perbuatan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "5. Allah Pemilik kerajaan langit dan bumi yang tujuh, kepada-Nya kembali segala urusan dan perhitungan seluruh makhluk."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Miliknya kerajaan di langit dan di bumi. Dialah yang mengatur keduanya dan memberlakukan urusan segala sesuatu (Diulang-ulang sebagai bentuk penegasan). Hanya kepada Allah urusan-urusan makhluk dikembalikan pada hari kiamat, bukan pada selainNya, kemudian Dia menentukan hukum tentangnya dengan haqq dan adil."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "MilikNyalah kerajaan langit dan bumi. Hanya kepada Allah segala urusan dikembalikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5. “KepunyaanNya-lah kerajaan langit dan bumi,” kerajaan, makhluk, dan hamba. Allah mengatur semuanya sesuai dengan yang dikehendaki berupa takdir dan syariat yang berlaku berdasarkan hikmah Rabbani. “Dan kepada Allah-lah dikembalikan segala urusan,” segala pekerjaan dan perbuatan. Semua manusia akan memperlihatkan amalannya kepada Allah dan Allah membedakan antara yang buruk dan yang baik, kemudian orang yang berbuat baik dibalas karena kebaikannya dan yang berbuat buruk dibalas karena keburukannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Hadid ayat 5: Allah mengabarkan bahwasanya Dia sajalah yang yang memiliki langit dan bumi, dengan menguasai keduanya sesuai keinginan-Nya dan bagaimana yang Dia kehendaki dari urusan-urusan kekuasaan dan syariat yang nampak dengan hikmah rabbaniyyah dan kepada Allah lah kembali segala urusan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni milik-Nya, ciptaan-Nya dan hamba-Nya. Dia bertindak pada mereka dengan apa yang Dia kehendaki berupa perkara qadari maupun syar’i yang berjalan di atas hikmah (kebijaksanaan) Rabbani. Baik amal maupun orang-orang yang mengerjakannya, lalu Dia akan menunjukkan amalan itu kepada mereka. Dia akan memisahkan yang baik dan yang buruk dan akan memberi balasan kepada orang yang berbuat ihsan karena ihsannya dan orang yang berbuat buruk karena keburukannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hadid Ayat 5",
    "description": "Allah adalah pencipta semua makhluk, karena itu milik-Nyalah kerajaan langit dan bumi. Semua berasal dari-Nya dan hanya kepada Allah segala urusan yang terkait dengan makhluk dikembalikan. 6. Di antara tanda kekuasaan Allah adalah pergantian waktu. Dia memasukkan sebagian waktu malam ke dalam siang sehingga waktunya lebih panjang saat musim panas, dan memasukkan siang ke dalam malam sehingga waktunya lebih lama saat musim dingin. Dia mengatur semua yang ada dan dia maha mengetahui segala isi hati, baik yang kemudian diungkapkan maupun yang terus disembunyikan."
  }
]