[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "7. Berimanlah kepada Allah dan RasulNya, Muhammad, infakkanlah apa yang Allah rizkikan kepada kalian dan menjadikan kalian pemiliknya. Orang-orang yang beriman di antara kalian, wahai manusia, dan berinfak dari harta mereka mendapatkan pahala yang besar."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Berimanlah kepada Allah, berimanlah kepada Rasul-Nya dan berinfaqlah dengan harta yang Allah telah menjadikan kalian memilikinya dan menggunakannya sesuai dengan yang diperbolehkan untuk kalian. Dan orang-orang yang beriman kepada Allah dari kalian dan menyisihkan hartanya di jalan Allah, bagi mereka ada pahala yang besar di sisi Allah, yaitu Surga."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "7. Allah memerintahkan hamba-hamba-Nya agar beriman kepada-Nya dan mengikrarkan keesaan-Nya dan risalah rasul-Nya; dan Allah memerintahkan untuk menginfakkan harta mereka, yang telah Allah berikan kekuasaan bagi mereka untuk mengatur harta itu. Dan Allah menjanjikan bagi orang-orang yang mentaati perintah-perintah ini dengan pahala yang besar dan kenikmatan yang kekal di surga."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. ءَامِنُوا۟ بِاللهِ وَرَسُولِهِۦ (Berimanlah kamu kepada Allah dan Rasul-Nya) Yakni percayalah kepada keesaan Allah dan kebenaran risalah. وَأَنفِقُوا۟ مِمَّا جَعَلَكُم مُّسْتَخْلَفِينَ فِيهِ ۖ( dan nafkahkanlah sebagian dari hartamu yang Allah telah menjadikan kamu menguasainya) Yakni harta yang Allah berikan kuasanya kepada kalian tanpa memilikinya dengan sebenarnya, karena harta itu milik Allah, dan hamba-hamba-Nya dijadikan penguasa harta itu, maka hendaklah mereka menggunakannya dalam hal yang diridhai Allah. Pendapat lain mengatakan bahwa Allah menjadikan kalian penguasa harta itu dari orang sebelum kalian dengan mewarisinya, dan harta itu akan berpindah kepada selain kalian, maka janganlah kalian kikir terhadapnya. فَالَّذِينَ ءَامَنُوا۟ مِنكُمْ وَأَنفَقُوا۟ لَهُمْ أَجْرٌ كَبِيرٌ(Maka orang-orang yang beriman di antara kamu dan menafkahkan (sebagian) dari hartanya memperoleh pahala yang besar) yakni orang-orang yang beriman kepada Allah dan Rasulullah serta berinfak di jalan Allah, mereka akan mendapat pahala yang besar berupa surga."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Percayalah wahai manusia dengan adanya Allah, keesaanNya dan kebenaran risalah rasulNya. Nafkahkanlah atau sedekahkanlah sebagian harta-harta kalian yang membuat kalian terus mencarinya itu di jalan Allah. Pada hakikatnya, harta itu adalah milik Allah. Dia menitipkannya kepada kalian. Orang-orang yang bersih keimanannya kepada Allah dan rasulNya dan menafkahkan hartanya di jalan Allah, maka baginya itu pahala yang sangat besar, yaitu surga. Ayat ini diturunkan saat perang yang amat sulit yaitu perang Tabuk."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Berimanlah kepada Allah dan RasulNya serta infakkanlah sebagian dari apa yang Dia menjadikanmu berwenang di dalamnya} yang kalian miliki {Lalu orang-orang yang beriman di antara kalian dan berinfak maka bagi mereka itu pahala yang sangat besar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7. Allah memerintahkan seluruh hambaNya agar beriman padaNya, beriman kepada RasulNya dan risalah yang dibawanya. Allah juga memerintahkan agar para hambaNya membelanjakan harta yang dberikan Allah pada mereka dan juga menjadikan mereka sebagai khalifah dalam menggunakan harta itu. Allah mendorong mereka untuk membelanjakan harta tersebut di jalanNya dengan memberitahukan pahala yang akan didapatkan. Allah berfirman “Maka orang-orang yang beriman diantara kamu dan menafkahkan (sebagian) dari hartanya memperoleh pahala yang besar.” Dan pahala yang paling besar adalah keridhaan Rabb mereka serta memperoleh tempat kemuliaanNya yang berisi berbagai kenikmatan abadi yang disediakan Allah untuk mereka yang beriman dan berjihad tersebut."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Hadid ayat 7: Allah menganjurkan hamba-nya untuk beriman dan berinfak di jalan Allah, dan memerintakan mereka (hamba-Nya) agar beriman kepada Allah dan Rasul-Nya ﷺ, dan menginfakkan dari harta-harta mereka yang mereka menguasainya; Ini menunjukkan bahwa raja yang sesungguhnya adalah Allah, oleh karenanya wajib bagi orang yang memiliki harta agar berbuat baik teradapa apa yang diamanahkan harta oleh Allah, dan agar memberikan hartanya dengan tujuan yang diinginkan Allah. Kemudian Allah memuji orang-orang yang mentaati-Nya, dan mengabarkan bagi siapa yang beriman kepada-Nya dan menginfakkan harta-harta mereka di jalan Allah, mereka memiliki ganjaran yang besar, yang tidak diketahui besarnya kecuali hanya Allah yang mengetahui."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memerintahkan hamba-hamba-Nya beriman kepada Allah dan Rasul-Nya dan apa yang dibawanya. Demikian pula memrintahkan mereka berinfak di jalan-Nya dari harta yang Dia jadikan pada tangan mereka dan menjadikan mereka menguasainya agar Dia melihat apa yang mereka lakukan dengannya. Setelah Dia memerintahkan demikian, Dia mendorong mereka untuk melakukannya dengan menyebutkan pahala bagi orang yang melakukannya. Menurut sebagian mufassir adalah perintah untuk tetap beriman. Yang dimaksud dengan menguasai di sini ialah penguasaan yang bukan secara mutlak. Hak milik pada hakikatnya adalah pada Allah. Oleh karena itu, manusia menginfakkan hartanya harus mengikuti hukum-hukum yang telah disyariatkan Allah Subhaanahu wa Ta'aala, karena itu tidak boleh kikir dan boros. Menurut sebagian mufassir bahwa ayat ini turun berkenaan dengan perang Tabuk yang ketika itu membutuhkan banyak biaya. Orang yang menggabung antara beriman kepada Allah dan Rasul-Nya dengan berinfak di jalan-Nya, bagi mereka pahala yang besar, dimana yang paling besarnya adalah memperoleh keridhaan Tuhan mereka, mendapatkan tempat kemuliaan-Nya (surga) dengan kenikmatan yang kekal yang ada di dalamnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hadid Ayat 7",
    "description": "Bila sebelumnya Allah memperlihatkan bukti-bukti kekuasaan-Nya, pada ayat ini Allah menganjurkan orang mukmin untuk berinfak. Wahai manusia, berimanlah kamu kepada Allah yang telah menciptakanmu dan kepada rasul yang diutus-Nya untuk menyampaikan tuntunan-Nya, dan infakkanlah sebagian dari harta yang dia telah menjadikan kamu sebagai penguasanya, kepada orang yang berhak. Sesungguhnya dalam hartamu itu terdapat bagian Allah bagi mereka. Maka, orang-orang yang beriman kepada Allah dan rasul-Nya di antara kamu dan menginfakkan sebagian dari hartanya di jalan Allah akan memperoleh pahala yang besar, baik di dunia maupun akhirat. 8. Dan mengapa kamu, wahai manusia, tidak beriman kepada Allah yang maha pencipta, padahal rasul mengajak dan menyeru kamu beriman kepada tuhanmu' dan sungguh, dia telah mengambil janji setia-Mu untuk bertauhid kepada-Nya. Kamu tentu akan menepati janji itu jika kamu adalah orang-orang mukmin."
  }
]