[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "8. Apa alasan kalian tidak membenarkan keesaan Allah serta melaksanakan syariatNya, sementara Rasul mengajak kalian kepadanya dan Allah telah mengambil perjanjian dari kalian atasnya bila kalian beriman kepada Allah Pencipta kalian?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Dan apa yang menghalangi kalian untuk beriman kepada Allah, sementara Rasul menyeru kalian kepada Allah dengan harapan kalian beriman kepada Rabb kalian, dan Allah telah mengambil perjanjian dari kalian agar kalian beriman kepada-Nya ketika dikeluarkan dari punggung bapak-bapak kalian, jika kalian memang orang-orang yang beriman."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "8. Dan Allah menegaskan perintah-perintah ini dengan mengingkari orang yang tidak mentaatinya: “Dan apa yang menjadi alasan kalian sehingga tidak beriman kepada Allah, padahal Rasulullah telah menyeru kalian untuk beriman, dan Allah telah mengambil perjanjian yang tegas dari kalian bahwa kalian akan beriman kepada-Nya?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. وَمَا لَكُمْ لَا تُؤْمِنُونَ بِاللهِ ۙ (Dan mengapa kamu tidak beriman kepada Allah) Yakni apa alasan kalian dan apa yang menghalangi kalian sehingga tidak beriman. Padahal segala alasan telah dibantah dari kalian? وَالرَّسُولُ يَدْعُوكُمْ لِتُؤْمِنُوا۟ بِرَبِّكُمْ(padahal Rasul menyeru kamu supaya kamu beriman kepada Tuhanmu) Yakni telah mengajak dan memperingatkan kalian untuk beriman kepada Allah. وَقَدْ أَخَذَ مِيثٰقَكُمْ(Dan sesungguhnya Dia telah mengambil perjanjianmu) Yakni padahal Allah telah mengambil perjanjian dari kalian, ketika kalian dikeluarkan dari sulbi Adam, dan Allah telah menegakkan dalil dan bukti yang menunjukkan keesaan-Nya dan kewajiban beriman kepada-Nya. Dan kalian telah mengatakan sami’naa wa atha’naa (kami mendengarnya dan kami akan mentaati). إِن كُنتُم مُّؤْمِنِينَ (jika kamu adalah orang-orang yang beriman) Lewat perjanjian yang diambil dari kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8. Dan kenapa kalian tidak beriman wahai orang-orang kafir? Tidak ada yang melarang kalian untuk beriman. Sesungguhnya Rasulallah meminta kalian untuk mengimani adanya Allah dan keesaanNya. Dia telah mengambil janji atas kalian saat menciptakan kalian setelah leluhur kalian, Adam. Dia bersaksi atas keberadaan Allah. Jika kalian hendak beriman maka cepat-cepatlah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mengapa kalian tidak beriman kepada Allah, padahal Rasul mengajak kalian beriman kepada Tuhan kalian. Sungguh Dia telah mengambil janji kalian jika kalian adalah orang-orang mukmin"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8. Kemudian Allah menyebutkan sebab yang mendorong mereka untuk beriman dan jangan berpaling dari keimanan seraya berfirman, “Dan mengapa kamu tidak beriman kepada Allah padahal Rasul menyeru kamu supaya kamu beriman kepada Rabbmu. Dan sesungguhnya Dia telah mengambil perjanjianmu jika kamu adalah orang-orang yang beriman.” Maksudnya, apakah gerangan yang menghalangi kalian untuk beriman, padahal Muhammad adalah rasul terbaik dan penyeru paling mulia yang menyeru kalian menuju Allah. Inilah faktor yang seharusnya mengharuskan mereka untuk segera memenuhi seruan beliau menuju kebenaran yang dibawa beliau dan Allah telah mengambil perjanjian dari kalian untuk beriman, jika memang kalian adalah orang-orang yang beriman."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Hadid ayat 8: Allah berkata kepada mereka orang-orang musyrik dengan menjelekkan mereka : Udzur apa lagi bagi kalian wahai orang-orang musyrik yang kalian adala orang yang tidak beriman kepada Allah dan Rasul-Nya ﷺ ? Padahal utusan Allah telah ada di hadapan kalian, dan telah menjelaskan ayat-ayat AL Qur’an kepada kalian, yang di dalamnya terdapat hujjah bagi yang beriman kepada Allah. Dan Allah telah mengambil perjanjian kepada kalian dan kesepakatan atas keimanan ini, sebagaimana Allah berfiman : وَإِذْ أَخَذَ رَبُّكَ مِنۢ بَنِىٓ ءَادَمَ مِن ظُهُورِهِمْ ذُرِّيَّتَهُمْ وَأَشْهَدَهُمْ عَلَىٰٓ أَنفُسِهِمْ أَلَسْتُ بِرَبِّكُمْ ۖ قَالُوا۟ بَلَىٰ ۛ شَهِدْنَآ ۛ أَن تَقُولُوا۟ يَوْمَ ٱلْقِيَـٰمَةِ إِنَّا كُنَّا عَنْ هَـٰذَا غَـٰفِلِينَ, yang artinya : Dan (ingatlah), ketika Tuhanmu mengeluarkan keturunan anak-anak Adam dari sulbi mereka dan Allah mengambil kesaksian terhadap jiwa mereka (seraya berfirman): \"Bukankah Aku ini Tuhanmu?\" Mereka menjawab: \"Betul (Engkau Tuhan kami), kami menjadi saksi\". (Kami lakukan yang demikian itu) agar di hari kiamat kamu tidak mengatakan: \"Sesungguhnya kami (bani Adam) adalah orang-orang yang lengah terhadap ini (keesaan Tuhan)\". {Al A’raf : 172}. Kesimpulannya apa yang mengandung perintah untuk kalian beriman maka itulah yang menjadi sebab kalian harus beriman, dan puncak sebab ini adalah telah adanya Rasulullah ﷺ di tengah-tengah kalian yang menyampaikan keimanan ini, dan mewajibkan kalian untuk memegang keimanan ini."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala menyebutkan sebab yang mendorong mereka beriman. Yaitu dengan berbai’at kepada Nabi shallallahu 'alaihi wa sallam. Atau maksudnya, perjanjian ruh Bani Adam sebelum dilahirkan ke dunia bahwa Dia mengakui, bahwa Tuhannya ialah Allah dan tidak menyembah selain kepada-Nya (lihat surah Al A’raaf: 172). Yakni, apa yang menghalangimu untuk beriman, padahal Muhammad shallallahu 'alaihi wa sallam adalah rasul yang paling utama dan da’i paling mulia yang mengajak kamu kepada Allah. Yang demikian mengharuskan seseorang untuk segera memenuhi seruannya dan menyambutnya, dan lagi Dia (Allah) telah mengambil perjanjian dari kamu untuk beriman jika kamu memang orang-orang mukmin. Di samping itu, karena kelembutan dan perhatian-Nya kepada kamu, Dia tidak membatasi dengan seruan rasul yang mulia saja, bahkan Dia menguatkan rasul tersebut dengan mukjizat-mukjizat yang menunjukkan kebenaran yang dibawanya, terutama sekali adalah dengan Al Qur’an."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hadid Ayat 8",
    "description": "Dan mengapa kamu, wahai manusia, tidak beriman kepada Allah yang maha pencipta, padahal rasul mengajak dan menyeru kamu beriman kepada tuhanmu' dan sungguh, dia telah mengambil janji setia-Mu untuk bertauhid kepada-Nya. Kamu tentu akan menepati janji itu jika kamu adalah orang-orang mukmin. 9. Sungguh, dialah yang menurunkan ayat-ayat yang terang, yaitu Al-Qur'an, yang diwahyukan kepada hamba-Nya untuk mengeluarkan kamu dari kegelapan, yaitu kekafiran dan kemungkaran, kepada cahaya petunjuk menuju keimanan dan kebajikan. Dan sungguh, terhadap kamu Allah benar-benar maha penyantun lagi maha penyayang, baik di dunia maupun akhirat."
  }
]