[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "9. Dia-lah Yang menurunkan kepada hambaNya, Muhammad, ayat-ayat yang terperinci dan jelas yaitu al-Quran, untuk mengeluarkan kalian dari kegelapan kekufuran menuju cahaya iman, sesungguhnya Allah, dengan mengeluarkan kalian dari kegelapan menuju cahaya, benar-benar merahmati kalian dengan rahmat yang luas di dunia dan akhirat, lalu Allah akan membalas kalian dengan balasan yang paling baik."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Dan Dia lah yang menurunkan kepada hamba-Nya Muhammad -ṣallallāhu 'alaihi wa sallam- ayat-ayat yang jelas untuk mengeluarkan kalian dari kegelapan kekufuran dan kebodohan menuju cahaya iman dan pengetahuan. Sesungguhnya Allah Maha Penyantun terhadap kalian dan Maha Penyayang ketika mengirimkan Nabi-Nya kepada kalian sebagai pemberi petunjuk dan pemberi kabar gembira."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "9. Dia-lah yang menurunkan kepada Nabi Muhammad ayat-ayat al-Qur’an yang jelas dan mukjizat-mukjizat yang besar, agar dapat mengeluarkan kalian dari gelapnya kesesatan menuju cahaya petunjuk. Dan sungguh Allah Maha Lembut dan Maha Luas rahmat-Nya bagi kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. هُوَ الَّذِى يُنَزِّلُ عَلَىٰ عَبْدِهِۦٓ ءَايٰتٍۭ بَيِّنٰتٍ (Dialah yang menurunkan kepada hamba-Nya ayat-ayat yang terang) Yakni ayat-ayat yang jelas, yaitu ayat-ayat al-Qur’an; atau menurut pendapat lain yang dimaksud adalah mukjizat-mukjizat, dan yang paling agung adalah mukjizat al-Qur’an. لِّيُخْرِجَكُم مِّنَ الظُّلُمٰتِ إِلَى النُّورِ ۚ( supaya Dia mengeluarkan kamu dari kegelapan kepada cahaya) Yakni agar Allah mengeluarkan kalian dengan ayat-ayat tersebut atau dengan seruan rasulullah tersebut. وَإِنَّ اللهَ بِكُمْ لَرَءُوفٌ رَّحِيمٌ(Dan sesungguhnya Allah benar-benar Maha Penyantun lagi Maha Penyayang terhadapmu) Yakni Maha Lembut dan Penyayang; yang telah menurunkan kitab-kitab-Nya dan mengutus rasul-rasul-Nya sebagai petunjuk bagi hamba-hamba-Nya, dan tidak ada kelembutan dan kasih sayang yang melebihi hal itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9. Hanya Allah yang menurunkan kepada hambaNya Muhammad SAW ayat-ayat yang jelas dan nyata untuk mengeluarkan kalian wahai manusia dari gelapnya kekufuran dan kesesatan menuju cahaya kebenaran dan keimanan. Sesungguhnya dalam hal itu Allah Maha Santun lagi Maha Penyayang kepada kalian, saat mengutus para rasul di antara kalian dan menurunkan ayat-ayat dan kitab-kitab untuk menuntun kalian."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dialah yang menurunkan ayat-ayat yang terang kepada hambaNya untuk mengeluarkan kalian dari kegelapan menuju cahaya. Sesungguhnya Allah benar-benar Maha Penyantun lagi Maha Penyayang kepada kalian"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9. Namun demikian, meski Nabi Muhammad bersifat lemah lembut dan begitu memperhatikan kalian, tidak cukup hanya karena seruan rasul yang sebenarnya adalah makhluk paling mulia, akan tetapi Allah menguatkannya dengan berbagai mukjizat dan menunjukkan kalian akan kebenaran apa yang beliau bawa melalui ayat-ayat yang terang. Oleh karena itu Dia berfirman, “Dia-lah Allah yang menurunkan kepada hamba-hambaNya ayat-ayat yang terang (al-Quran)” maksudnya, tanda-tanda yang jelas yang menunjukkan orang-orang yang memiliki akal akan kebenaran seluruh yang beliau bawa, dan bahwasanya ia adalah kebenaran yang pasti. “Supaya Dia mengeluarkan kamu” dengan mengutus seorang Rasul kepada kalian, serta al-Kitab dan as-Sunnah yang diturunkan Allah di tangannya, “dari kegelapan kepada cahaya.” Maksudnya, dari gelapnya kebodohan dan kekufuran menuju cahaya ilmu dan iman. Inilah di antara kaish sayang dan cintaNya kepada kalian, karena DIa adalah Maha Pemurah kepada seluruh hambaNya melebihi cinta seorang ayah terhadap anaknya, “dan sesungguhnya Allah benar-benar Maha Penyantun lagi Maha Penyayang terhadapmu.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Hadid ayat 9: Allah menjelaskan di antara nikmat yang diberikan kepada hamba-Nya, adalah diturunkannya ayat-ayat Al Qur’an yang jelas kepada Muhammad ﷺ, untuk mengeluarkan (manusia) dari kegelapan menuju cahaya keimanan dan ilmu, dan Allah pemilik banyak kasih sayang dan murah hati kepada hamba-Nya yang beriman, dimana Allah menurunkan kepada kalian sebaik-baik kitab (Al Qur’an) dan mengutus sebaik-baik Rasul kepada kalian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang menunjukkan kepada akal bahwa apa yang dibawanya adalah benar. Dengan rasul yang diutus-Nya dan apa yang diturunkan-Nya kepadanya berupa kitab (Al Qur’an) dan hikmah (As Sunnah). Yakni dari gelapnya kebodohan dan kekafiran kepada cahaya ilmu dan keimanan. Ini termasuk rahmat dan kasih-Nya kepada kamu, dimana Dia lebih sayang kepadamu daripada sayangnya ibu kepada anaknya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hadid Ayat 9",
    "description": "Sungguh, dialah yang menurunkan ayat-ayat yang terang, yaitu Al-Qur'an, yang diwahyukan kepada hamba-Nya untuk mengeluarkan kamu dari kegelapan, yaitu kekafiran dan kemungkaran, kepada cahaya petunjuk menuju keimanan dan kebajikan. Dan sungguh, terhadap kamu Allah benar-benar maha penyantun lagi maha penyayang, baik di dunia maupun akhirat. 10. Dalam hartamu ada bagian Allah yang mesti kamu infakkan. Lalu, mengapa kamu kikir dan mengapa kamu tidak menginfakkan sebagian hartamu di jalan Allah, padahal milik Allah semua pusaka langit dan bumi' dialah yang menciptakannya dan semua yang ada di antara keduanya. Ketahuilah, tidak akan sama orang yang menginfakkan sebagian hartanya di jalan Allah di antara kamu dan berperang sebelum penaklukan mekah. Dengan kebajikan dan perjuangannya itu mereka lebih tinggi derajatnya daripada orang-orang yang menginfakkan sebagian hartanya dan berpe-rang setelah penaklukan kota mekah itu. Dan Allah menjanjikan kepada masing-masing mereka balasan yang lebih baik sesuai amal dan niat masing-masing. Dan Allah mahateliti terhadap apa yang kamu lakukan kapan dan di mana pun. Dia akan memberi balasan atasnya dengan setimpal."
  }
]