[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-6. Allah bersumpah dengan Thur, yaitu gunung dimana Allah berbicara kepada Musa, juga dengan kitab yang tertulis, yaitu al-Quran dalam shuhuf-shuhuf yang terbuka, juga dengan Baitul Ma’mur di langit yang ramai oleh para malaikat yang selalu menghadirinya, juga dengan atap yang terangkat, yaitu langit terdekat, dan dengan lautan yang bergejolak yang penuh dengan air,"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Allah bersumpah dengan gunung yang di sana Dia berbicara dengan Musa -'alaihissalām-."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1-10. Allah bersumpah dengan enam hal agung: Dengan bukit Thur yang ada di gurun Sina, dengan al-Qur’an yang tertulis pada lembaran kulit tipis, dengan Baitul Ma’mur yang ada di langit ke tujuh yang merupakan tempat para malaikat berthawaf, dengan langit dunia yang menjadi atap yang tinggi, dan dengan lautan yang penuh dengan air. Sungguh azab Tuhanmu -hai Rasulullah- pasti akan menimpa orang-orang kafir, tidak ada yang dapat melindungi mereka dari azab itu. Pada hari yang mengerikan itu langit akan berguncang dan gunung-gunung akan tercabut dari akarnya. Ali berkata, Baitul Ma’mur adalah bangunan yang ada di langit yang terletak sejajar dengan Ka’bah yang ada di bumi, bangunan ini disebut dengan ‘adh-Dhirah’. Kehormatannya di langit seperti kehormatan Ka’bah di bumi. Setiap hari 70.000 malaikat memasukinya, dan jika para malaikat itu telah keluar maka tidak akan kembali memasukinya lagi. (Ithaf al-Khiyarah: kitab tafsir surat ath-Thur, no. 295. Dishahihkan oleh al-Hakim dan disepakati oleh adz-Dzahabi, dalam al-Mustadrak 2/468. Dan diriwayatkan oleh al-Fakihi dalam Tarikh Makkah dengan riwayat yang serupa dari hadits Abdullah bin ‘Amr secara mauquf, dan sanadnya dishahihkan oleh Ibnu Hajar dalam Fathul Bari 6/309)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. وَالطُّورِ (Demi bukit) Kata (الطور) dalam bahasa suryani berarti gunung. Dan yang dimaksud dalam ayat ini adalah gunung Sinai yang merupakan tempat Allah berbicara kepada Musa. Allah bersumpah demi gunung ini sebagai penghormatan baginya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Keutamaan: Imam Bukhari dan lainnya dari Ummu Salamah mengatakan bahwa beliau mendengar Rasulallah SAW shalat di samping rumah tepatnya di bukit, lalu lembaran kitab terbuka. 1. Aku bersumpah demi gunung Thur. Gunung Thur di daerah Sinai yang digunakan Allah untuk berbicara dengan Musa, sebagai bentuk penghormatan pemuliaan terhadap gunung tersebut."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Demi gunung Sinai} Aku bersumpah demi gunung dimana Musa diajak bicara olehNya {demi kitab yang ditulis"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1. Allah bersumpah dengan berbagai hal agung yang mencakup berbagai hikmah tinggi atas adanya hari kebangkitan, Hari Pembalasan bagi orang-orang yang bertakwa dan orang-orang yang mendustakan. Allah bersumpah demi bukit Thursina, inilah bukit yang di atasnya Allah berbicara dengan Nabi Musa bin Imran serta diberi wahtu berbagai hukum. Dalam hal ini terdapat karunia Allah terhadap Muhammad dan umatnya berupa tanda-tanda kebesaran Allah serta nikmatNya yang tidak bisa dihitung dan dinilai oleh manusia."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tur ayat 1: Allah bersumpah dengan beberapa dari makhluk-Nya, maka Allah bersumpah dengan Thur, ia adalah gunung yang penuh berkah, yang padanya Musa diajak Allah berbicara."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala bersumpah dengan beberapa perkara yang besar terhadap hikmah-hikmah yang besar, terhadap kebangkitan, pembalasan kepada orang-orang yang bertakwa dan orang-orang yang mendustakan. Dia bersumpah dengan gunung Sinai; gunung dimana Allah Subhaanahu wa Ta'aala berbicara dengan Nabi Musa ‘alaihis salam dan mewahyukan kepadanya apa yang Dia wahyukan berupa hukum-hukum yang menjadi karunia bagi Beliau dan umatnya yang menjadi ayat atau tanda kekuasaan Allah dan nikmat-nikmat-Nya yang tidak dapat dinilai dan dihargakan oleh hamba."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tur Ayat 1",
    "description": "1-6. Surah a'-''riy't ditutup dengan penegasan jatuhnya ancaman Allah bagi mereka yang kafir. Surah at-t'r diawali dengan kepastian jatuhnya azab bagi mereka yang mengingkari ayat-ayat Allah. Penegasan tentang kepastian azab ini diawali dengan sumpah-sumpah Allah. Demi gunung sinai yang menjadi lokasi nabi musa menerima taurat, dan demi kitab Allah yang diwahyukan-Nya dan yang ditulis pada lembaran yang terbuka sehingga mudah dibaca dan dipahami maknanya, dan demi baitulma'mur, yaitu kakbah atau tempat yang menjadi lokasi para malaikat rukuk, sujud, dan tawaf, dan demi atap, yaitu langit, yang ditinggikan dan kukuh tanpa tiang penyangga, dan demi lautan yang penuh gelombang yang di dalam tanahnya terdapat api"
  }
]