[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "11-12. Kebinasaan pada hari itu menimpa orang-orang yang mendustakan, yaitu orang-orang yang membicarakan kebatilan dan bermain-main didalamnya, menjadikan agama mereka sebagai bahan olokan dan permainan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Yaitu orang-orang yang bermain-main dalam kesesatan dan tidak peduli dengan hari mereka dihidupkan dan dibangkitkan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "12. الَّذِينَ هُمْ فِى خَوْضٍ يَلْعَبُونَ ((yaitu) orang-orang yang bermain-main dalam kebathilan) Yakni mereka bermain-main dalam melakukan kebatilan dan selalu membelanya, tanpa mengingat hisab atau takut terhadap siksaan, serta tenggelam dalam pendustaan dan penghinaan terhadap urusan nabi Muhammad."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12. Yaitu orang-orang yang berada dalam kebathilan, mereka terjerumus dan bermain di dalamnya sehingga mereka tidak ingat tentang hisab akhirat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "(yaitu) orang-orang yang bermain-main dalam kebathilan} sibuk dalam kebathilan dan dusta"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "12. Selanjutnya Allah menyebutkan dan menggolongkan orang-orang yang mendustakan yang berhak mendapatkan kecelakaan “yaitu orang-orang yang bermain-main dalam kebatilan,” yaitu orang yang berada dalam kebatilan dan bermain-main dengan kebatilan itu; semua ilmu dan penelitian mereka terhadap hal-hal yang membahayakan, mencakup sikap pendustaan terhadap kebenaran serta membenarkan kebatilan. Perbuatan mereka sama seperti tindakan orang-orang bodoh, tolol dan orang yang suka bermain-main. Berbeda dengan orang-orang yang membenarkan serta beriman yang memiliki ilmu yang bermanfat dan amal shalih."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tur ayat 12: 11-12. Allah mengabarkan bahwa kecelakaan dan kesengsaraan pada hari itu bagi orang-orang yang mendustakan kebenaran; Yang mereka dalam kehidupannya (di dunia) dalam kondisi lalai dan tidak bermanfaat (bermain-main). Mereka tidak ingat akan hari perhitungan, dan mereka tidak takut akan adzab."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala menyebutkan sifat orang-orang yang mendustakan yang mendapatkan wail atau kecelakaan itu. Pengetahuan dan pengkajian mereka hanya berfokus pada pengetahuan yang memberikan madharrat (bahaya) yang isinya mengandung pendustaan kepada kebenaran, pembenaran kepada kebatilan, dan perbuatan mereka adalah perbuatan orang-orang yang bodoh; berbeda dengan orang-orang yang membenarkan dan beriman, dimana ilmu mereka bermanfaat dan amal mereka saleh."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tur Ayat 12",
    "description": "11-12. Ketika azab itu datang, maka celakalah pada hari itu bagi orang-orang yang mendustakan ayat-ayat Allah, terutama yang terkait dengan keesaan-Nya dan keniscayaan kiamat. Mereka itulah orang-orang yang terus bermain-main dalam kebatilan dan perbuatan dosa. 13. Datangnya azab kepada para pengingkar itu adalah suatu kepastian. Pada hari ketika siksa itu tiba, mereka didorong oleh para malaikat ke neraka jahanam dengan sekuat-kuatnya sehingga mereka masuk ke dalamnya."
  }
]