[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "13-14. Di hari itu orang-orang yang mendustakan akan didorong dengan keras dan terhina ke Neraka Jahanam. Kepada mereka dikatakan sebagai celaan, “Inilah api neraka yang dulu kalian dustakan”."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Dan dikatakan kepada mereka sebagai bentuk penghinaan atas mereka, “Inilah neraka yang dahulu kalian dustakan ketika Rasul kalian menakuti kalian dengannya.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13-14. Yaitu hari dimana malaikat mendorong mereka dengan sangat kasar dan kejam ke dalam neraka Jahanam. Inilah neraka yang mereka dustakan di dunia."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{“Inilah neraka yang dahulu kalian dustakan”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "14. “Inilah neraka yang dahulu kamu selalu mendustakannya,” pada hari ini rasakanlah azab yang kekal yang dahsyatnya tidak bisa dijangkau akal dan kepedihannya tidak bisa digambarkan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tur ayat 14: Kemudian dikatakan kepada mereka orang-orang yang mendustakan dengan nada mencela dan merendahkan: Inilah neraka yang kalian telah dustakan di dunia dan kalian akan tinggal di dalamnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dikatakan kepada mereka sambil dicela dengan keras."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tur Ayat 14",
    "description": "Saat para pengingkar itu dimasukkan ke neraka, dikatakan kepada mereka, 'inilah neraka yang di dunia dahulu kamu terus-menerus mendustakannya. '15. Begitu masuk neraka, para pengingkar itu mendapat ejekan dan kecaman. 'kamu sudah merasakan sendiri pedihnya azab neraka yang dauhlu kamu ingkari, maka dengan demikian, apakah neraka ini hanya merupakan sihir yang mengelabui mata ataukah kamu memang tidak melihat sehingga kamu akan terus mengingkari keberadaannya'."
  }
]