[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "15-16. Apakah azab yang kalian saksikan ini hanyalah sihir belaka atau kalian memang tidak melihat? Rasakanlah panasnya api neraka ini. Kalian bersabar dalam merasakan rasa sakit dan panasnya atau tidak ( itu sama saja), karena azab tidak akan diringankan dari kalian. Kalian tidak akan keluar darinya, sama saja kalian sabar atau tidak. Sesungguhnya kalian hanya dibalas atas apa yang kalian lakukan di dunia.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Apakah siksa yang sedang kalian lihat ini adalah sihir, ataukah kalian tidak menyaksikannya?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "15-16. Dan mereka akan diolok: “Apakah yang kalian saksikan ini adalah sihir, atau kalian tidak dapat menyaksikannya? Rasakanlah panas api neraka yang luar biasa ini; kalian dapat bersabar atau tidak dari panasnya maka itu sama saja, kalian tidak akan keluar darinya. Sungguh yang kalian dapatkan ini adalah balasan atas amal buruk kalian di dunia.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15. أَفَسِحْرٌ هٰذَآ (Maka apakah ini sihir?) Yakni yang kalian lihat dan saksikan ini, sebagaimana dahulu kalian menyebut rasul yang diutus dan kitab yang diturunkan sebagai sihir. أَمْ أَنتُمْ لَا تُبْصِرُونَ (Ataukah kamu tidak melihat?) Atau kalian buta tentang hal ini sebagaimana kalian dahulu di dunia buta terhadap kebenaran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "15. Malaikat berkata kepada mereka dengan celaan: “Apakah siksa yang kalian saksikan ini adalah sihir? Namun kalian buta, tidak dapat melihat azab ini juga, sebagaimana kalian juga tidak dapat melihat petunjuk (saat) di dunia”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah ini sihir ataukah kalian tidak melihat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "15. “Maka apakah ini sihir ataukah kamu tidak melihat?” kemungkinan uang diisryaratkan dalam ayat ini adalah neraka atau azab, sebagaimana yang ditunjukkan oleh redaksi ayat, yakni ketika mereka melihat azab dan neraka. Dikatakan kepada mereka dengan nada penghinaan, “Apakah ini sihir dan tidak nyata, kini kalian melihatnya? Ataukah karena pada saat di dunia kalian tidak melihatnya? Artinya, kalian tidak memiliki pandangan dan ilmu, kalian bodoh dan tidak mengetahui hal ini dan tidak ada hujjah yang ditegakkan pada kalian? Jawabannya adalah, keduanya tidak ada: bahwa siksa atau neraka itu sihir, maka saat itu telah nampak bagi mereka bahwa siksa atau neraka itu benar adanya yang menafikan sihir dari berbagai hal, ada kalanya mereka tidak melihat padahal tidak demikian halnya, para rasul menyeru mereka untuk beriman pada hal itu, berbagai dalil dan bukti nyata akan hal itu telah ditegakkan. Berita tentang azab dan neraka dijadikan sebagi hal terbesar yang jelas dan nyata. Kemungkinan lain dari isyarat yang terdapat dalam Firman Allah , “Maka apakah ini sihir ataukah kamu tidak melihat?”adalah kebenaran yang dibawa oleh Nabi Muhammad serta jalan yang lurus. Artinya, apakah orang yang berakal menganggap kebenaran serta jalan yang lurus itu sebagai sihir padahal kebenaran dan jalan yang lurus itu adalah kebenaran terbesar dan teragung, hanya saja karena mereka tidak memiliki bashirah sehingga mereka mengatakan seperti itu?"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tur ayat 15: Kemudian dikatakan kepada mereka orang-orang kafir dengan nada celaan : Apakah neraka dan adzab ini yang kalian telah saksikan adalah termasuk sihir ? Sebagaimana kalian telah katakan kepada Rasul dan kitab-Nya di dunia : Ini adalah sihir, ataukah kalian pura-pura buta dari ini, sebagaimana kalian buta dari kebenaran di dunia ?. Ketahuilah bahwa adzab ini ada nyata dan bukan sihir."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kata “ini” bisa tertuju kepada neraka dan azab sebagaimana ditunjukkan oleh susunan ayatnya, yakni ketika mereka melihat neraka dan azab, maka dikatakan kepada mereka secara keras, “Apakah ini sihir yang tidak ada hakikatnya, padahal kamu melihatnya ataukah kamu di dunia tidak melihatnya?” Maksudnya, kamu seakan-akan tidak memiliki bashirah dan ilmu, tidak mengetahui perkara ini sehingga belum tegak hujjah kepada kamu? Untuk menjawabnya adalah dengan dinafikan kedua perkara tersebut. Keadaannya sebagai sihir, maka telah tampak bagi mereka, bahwa ia merupakan kebenaran yang paling benar dan menyelisihi sihir dari berbagai sisi. Adapun keadaan mereka tidak melihatnya karena kenyataannya tidak demikian, bahkan hujjah Allah telah tegak bagi mereka, para rasul telah mengajak mereka beriman serta menegakkan dalil dan bukti terhadapnya yang menjadikan perkara itu sebagai perkara yang paling jelas dan tampak. Bisa juga kata “ini” dalam ayat di atas tertuju kepada apa yang dibawa Rasulullah shallallahu 'alaihi wa sallam berupa kebenaran yang jelas dan jalan yang lurus, yakni apakah yang dibawa Nabi Muhammad shallallahu 'alaihi wa sallam adalah sihir atau kamu tidak memiliki bashirah seingga perkara itu samar bagi kamu, padahal keadaannya lebih jelas dari segala sesuatu dan kebenarannya adalah kebenaran yang paling benar, dan bahwa hujjah Allah telah tegak atas mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tur Ayat 15",
    "description": "Begitu masuk neraka, para pengingkar itu mendapat ejekan dan kecaman. 'kamu sudah merasakan sendiri pedihnya azab neraka yang dauhlu kamu ingkari, maka dengan demikian, apakah neraka ini hanya merupakan sihir yang mengelabui mata ataukah kamu memang tidak melihat sehingga kamu akan terus mengingkari keberadaannya'16. Wahai para pengingkar, masuklah ke dalamnya dan rasakanlah panas apinya; maka baik kamu bersabar atas pedihnya siksa neraka itu atau tidak bersabar atasnya, keduanya akan sama saja akibatnya bagimu. Tetapi, ketahuilah bahwa Allah tidak menganiaya kamu dengan siksa itu. Sesungguhnya kamu hanya diberi balasan yang setimpal atas apa yang telah kamu kerjakan."
  }
]