[
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Rasakan panasnya Neraka ini dan cicipilah, bersabarlah dalam merasakan panasnya atau jangan bersabar merasakannya, sama saja bagi kalian bersabar atau tidak bersabar. Pada hari ini kalian tidak mendapat balasan melainkan apa yang telah kalian lakukan selama di dunia berupa kekafiran dan kemaksiatan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "16. اصْلَوْهَا فَاصْبِرُوٓا۟ أَوْ لَا تَصْبِرُوا۟ (Masukklah kamu ke dalamnya; maka baik kamu bersabar atau tidak) Yakni rasakanlah panas apinya, lalu bersabarlah atas azab itu atau tidak, dan lakukanlah apa yang kalian mau, سَوَآءٌ عَلَيْكُمْ ۖ(sama saja bagimu) Yakni keduanya sama saja, tidak akan bermanfaat bagi kalian. إِنَّمَا تُجْزَوْنَ مَا كُنتُمْ تَعْمَلُونَ(kamu diberi balasan terhadap apa yang telah kamu kerjakan) Karena balasan itu karena perbuatan mereka. Dan jika azab itu harus ditimpakan kepada mereka maka baik mereka bersabar maupun tidak itu sama saja bagi mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16. Masuklah ke dalam neraka dan rasakanlah panasnya. Kesabaran, kejenuhan dan kecemasan tidak berguna bagi kalian untuk menahan azab ini, dan tidak ada yang membebaskan kalian darinya. Kesabaran dan kecemasan (kalian) itu sama saja. Sesungguhnya kalian dibalas atas perbuatan kalian di dunia, berupa kekufuran kepada Allah dan mendustakan rasulNya. Maka balasannya adalah dengan memberi siksaan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Masuklah ke dalamnya} masuklah ke dalamnya dan rasakanlah panasnya {Baik kalian bersabar atau tidak bersabar itu sama saja bagi kalian. Sesungguhnya kalian hanya diberi balasan atas apa yang telah kalian kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "16. “Masuklah kamu ke dalamnya,” masuklah kalian ke dalam neraka yang meliputi kalian dan mencakup seluruh raga kalian hingga ke hati kalian, “maka baik kamu bersabar atau tidak, sama saja bagimu,” kesabaran kalian terhadap api neraka tidak berguna sama sekali untuk kalian, kalian tidak akan saling berempati satu sama lain,dan siksaan tidak akan diringankan dari kalian. Siksa neraka bukanlah termasuk hal di mana jika seseorang bersabar, maka bebannya akan terasa ringan dan kerasnya akan hilang, hal itu diperlakukan pada mereka karena perbuatan serta tindakan keji mereka, karena itulah Allah berfirman, “Kamu hanya diberi balasan terhadap apa yang kamu kerjakan.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tur ayat 16: Kemudian dikatakan kepada mereka : Masuklah kalian ke dalam neraka, dan cobalah apinya dan dahsyatnya, serta bersabar atau tidak kalian atasnya, sama saja. Karena tidak ada hentinya bagi kalian adzab sebagai balasan apa yang kalian kerjakan dari kesyirikan, kedustaan dan kemaksiatan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya, masukilah neraka yang meliputi kamu, membakar semua badanmu dan naik sampai ke hati kamu. Yakni sabarnya kamu terhadap neraka tidaklah berfaedah apa-apa bagimu, tidak meringankan azab itu dan tidak termasuk perkara yang jika seorang hamba bersabar terhadapnya, maka bebannya menjadi ringan. Allah Subhaanahu wa Ta'aala menghukum demikian kepada mereka adalah karena amal dan perbuatan mereka yang jelek. Oleh karena itu, Allah Subhaanahu wa Ta'aala berfirman, “Sesungguhnya kamu hanya diberi balasan atas apa yang telah kamu kerjakan.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tur Ayat 16",
    "description": "Wahai para pengingkar, masuklah ke dalamnya dan rasakanlah panas apinya; maka baik kamu bersabar atas pedihnya siksa neraka itu atau tidak bersabar atasnya, keduanya akan sama saja akibatnya bagimu. Tetapi, ketahuilah bahwa Allah tidak menganiaya kamu dengan siksa itu. Sesungguhnya kamu hanya diberi balasan yang setimpal atas apa yang telah kamu kerjakan. 17. Beralih dari penjelasan tentang azab bagi para pengingkar ayat-ayat Allah, pada ayat-ayat berikut Allah menjelaskan kenikmatan bagi mereka yang bertakwa. Sesungguhnya orang-orang yang bertakwa dan terus beribadah serta melakukan kebajikan, mereka itu berada dalam surga yang indah dan penuh kenikmatan ukhrawi yang tidak terlukiskan."
  }
]