[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "17-18. Sesungguhnya orang-orang bertakwa berada dalam surga-surga dan kenikmatan yang besar. Mereka menikmati apa yang Allah berikan kepada mereka dari berbagai bentuk kesenangan, dan Allah menyelamatkan mereka dari azab api neraka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Sesungguhnya orang-orang yang bertakwa kepada Rabb mereka -dengan menjalankan segala perintah-Nya dan menjauhi segala larangan-Nya- berada di surga-surga dan kenikmatan yang agung, tidak pernah berhenti."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "17-20. Allah memberi kabar gembira bagi orang-orang bertakwa yang takut kepada Allah dan mentaati-Nya, yaitu berupa kedudukan yang mulia di dalam surga yang penuh dengan kenikmatan yang dijanjikan bagi mereka. Mereka akan menikmati rezeki yang besar yang Allah berikan, dan Allah akan menyelamatkan mereka dari azab neraka Jahannam. Akan dikatakan kepada mereka: “Makan dan minumlah segala makanan lezat dan minuman nikmat yang kalian inginkan, sebagai balasan atas ketaatan yang telah kalian kerjakan.” Mereka akan bersandar berhadap-hadapan di atas dipan-dipan, dan Kami akan menikahkan mereka dengan wanita-wanita cantik menawan yang memiliki mata yang indah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17. Sesungguhnya orang-orang yang menjalankan perintah-perintah Allah dan menjauhi larangan-laranganNya itu berada di surga-surga dan kenikmatan yang berkelanjutan di akhirat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang yang bertakwa itu berada dalam surga dan kenikmatan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17. Setelah Allah menyebutkan hukuman bagi orang-orang yang zhalim, selanjutnya Allah menyebutkan kenikmatan orang-orang yang bertakwa supaya terangkum antara berita gembira dan ancaman sehingga hati manusia akan berada di antara rasa takut dan pengharapan. Allah berfirman, “Sesungguhnya orang-orang yang bertakwa,” yakni, kepada Rabb mereka, mereka yang takut akan murka dan azabNya yang mengerjakan sebab-sebabnya dengan mengerjakan segala perintah dan menjauhi segala laranganNya, “berada dalam surga” yakni, taman-taman yang di dalamnya terdapat pohon rindang, sungai dengan air yang memancar, istana yang dikelilingi taman dan rumah yang dihiasi “dan kenikmatan,” yang mencakup kenikmatan hati, ruh, dan raga."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tur ayat 17: 17-18. Ketika Allah telah jelaskan keadaan orang-orang yang berdosa, Allah menyebutkan keadaan orang-orang yang beriman yang bertakwa, yang mereka adalah orang-orang yang bertakwa ketika di dunia dengan mengerjakan perintah-perintah dan menjauhi larangan-larangan-Nya. Dimana Allah juga mengabarkan balasan bagi mereka dengan surga, yang mereka menikmati apa yang ada di dalamnya. Kemudian Allah mengabarkan keadaan mereka yang berlezat-lezat dan menikmati apa yang Allah berikan kepada mereka, yang mereka belum pernah melihat sebelumnya, belum pernah mendengar dan belum pernah terbesit dalam hati manusia. Mereka semua bergembira karena Allah jadikan mereka orang-orang yang berhasil lolos dari adzab Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ketika Allah Subhaanahu wa Ta'aala menyebutkan hukuman orang-orang yang mendustakan, maka Dia menyebutkan nikmat yang diberikan-Nya kepada orang-orang yang bertakwa agar berkumpul antara targhib dan tarhib, rasa cemas dan harap. Kepada Tuhan mereka; menjaga diri dari kemurkaan dan azab-Nya dengan mengerjakan perintah Allah dan menjauhi larangan-Nya. Jannat bisa diartikan kebun-kebun yang penuh dengan pohon-pohon yang lebat, sungai yang memancar, istana-istana dan tempat-tempat yang indah. Baik bagi hati, ruh maupun badan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tur Ayat 17",
    "description": "Beralih dari penjelasan tentang azab bagi para pengingkar ayat-ayat Allah, pada ayat-ayat berikut Allah menjelaskan kenikmatan bagi mereka yang bertakwa. Sesungguhnya orang-orang yang bertakwa dan terus beribadah serta melakukan kebajikan, mereka itu berada dalam surga yang indah dan penuh kenikmatan ukhrawi yang tidak terlukiskan. 18. Di surga itu mereka selalu bersuka ria dan berbahagia dengan apa yang diberikan tuhan yang maha pengasih kepada mereka; dan selain itu, tuhan yang maha pemberi senantiasa memelihara mereka dari azab neraka yang panas dan pedihnya tidak terkira."
  }
]