[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "17-18. Sesungguhnya orang-orang bertakwa berada dalam surga-surga dan kenikmatan yang besar. Mereka menikmati apa yang Allah berikan kepada mereka dari berbagai bentuk kesenangan, dan Allah menyelamatkan mereka dari azab api neraka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Mereka bersuka ria dengan apa yang diberikan Rabb mereka kepada mereka berupa segala kenikmatan makanan, minuman dan hubungan intim, dan Rabb mereka menjaga mereka dari siksa Neraka dan mereka beruntung dengan mendapatkan kesenangan-kesenangan yang mereka inginkan dan terjaga dari hal-hal yang merusaknya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "18. فٰكِهِينَ بِمَآ ءَاتَىٰهُمْ رَبُّهُمْ (mereka bersuka ria dengan apa yang diberikan kepada mereka oleh Tuhan mereka) Yakni mereka di surga memiliki buah-buahan surga. Dan pendapat lain mengatakan yakni mereka memiliki kenikmatan yang diberikan Allah kepada mereka, yang tidak pernah dilihat, didengar, atau terbesit dalam hati seseorang."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "18. Mereka menikmati apa yang diberikan Tuhan untuk mereka berupa kenikmatan di surga. Mereka dijauhkan dan dijaga oleh Tuhan mereka dari azab neraka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka bersenang-senang} mereka menikmati dan bersenang-senang {dengan apa yang dianugerahkan kepada mereka} yang diberikan kepada mereka {oleh Tuhan mereka. Tuhan menjaga mereka dari azab neraka Jahim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "18. “Mereka bersuka ria dengan apa yang diberikan kepada mereka oleh Rabb mereka.” Artinya mereka merasa takjub terhadap semua pemberian Rabb seraya menikmatinya dengan gembira dan suka cita terhadap kenikmatan yang diberikan yang tidak mungkin bisa digambarkan “Dan Rabb mereka memelihara mereka dari azab neraka.” Mereka diberi apa-apa yang disenangi dan diselamatkan dari apa-apa yang ditakuti, karena mereka mengerjakan yang dicintaai Allah dan menjauhi perbuatan yang bisa mendatangkan murkaNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tur ayat 18: 17-18. Ketika Allah telah jelaskan keadaan orang-orang yang berdosa, Allah menyebutkan keadaan orang-orang yang beriman yang bertakwa, yang mereka adalah orang-orang yang bertakwa ketika di dunia dengan mengerjakan perintah-perintah dan menjauhi larangan-larangan-Nya. Dimana Allah juga mengabarkan balasan bagi mereka dengan surga, yang mereka menikmati apa yang ada di dalamnya. Kemudian Allah mengabarkan keadaan mereka yang berlezat-lezat dan menikmati apa yang Allah berikan kepada mereka, yang mereka belum pernah melihat sebelumnya, belum pernah mendengar dan belum pernah terbesit dalam hati manusia. Mereka semua bergembira karena Allah jadikan mereka orang-orang yang berhasil lolos dari adzab Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mereka merasa bangga dan senang dengannya karena kenikmatan yang Allah berikan kepada mereka yang tidak bisa disifatkan. Yang demikian karena mereka mengerjakan apa yang dicintai Allah dan menjauhi apa yang dimurkai-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tur Ayat 18",
    "description": "Di surga itu mereka selalu bersuka ria dan berbahagia dengan apa yang diberikan tuhan yang maha pengasih kepada mereka; dan selain itu, tuhan yang maha pemberi senantiasa memelihara mereka dari azab neraka yang panas dan pedihnya tidak terkira. 19. Allah menyediakan di surga beragam makanan yang lezat dan minuman yang menyegarkan. Kemudian dikatakan kepada mereka yang bertakwa, 'makan dan minumlah dengan rasa nikmat semua yang sudah disediakan. Ini semua sebagai balasan dari apa, yaitu kebajikan, yang telah kamu kerjakan di dunia dengan ikhlas demi mengharap rida Allah. '."
  }
]