[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-6. Allah bersumpah dengan Thur, yaitu gunung dimana Allah berbicara kepada Musa, juga dengan kitab yang tertulis, yaitu al-Quran dalam shuhuf-shuhuf yang terbuka, juga dengan Baitul Ma’mur di langit yang ramai oleh para malaikat yang selalu menghadirinya, juga dengan atap yang terangkat, yaitu langit terdekat, dan dengan lautan yang bergejolak yang penuh dengan air,"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Dan bersumpah dengan Al-Qur`ān yang merupakan kitab yang tertulis."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. وَكِتٰبٍ مَّسْطُورٍ (dan Kitab yang ditulis) Yang dimaksud adalah al-Qur’an, atau Lauhul mahfudh, atau kitab nabi Musa."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Dan demi kitab yang tertulis dengan rapi di Lauhil Mahfudz, yaitu salah satu kitab samawiy seperti Taurat, Suhuf Musa, Zabur, Injil dan Al-Qur’an"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{demi kitab yang ditulis} Aku bersumpah dengan Al-Qur’an yang ditulis"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2. “Dan kitab yang ditulis.” Kemungkinan bahwa yang dimaksudkan adalah al-Lauh al-Mahfuzh, di situlah Allah menulis ketetapan segala sesuatu, dan kemungkinan juga yang dimaksudkan adalah al-Quran yang mulia yang merupakan kitab terbaik yang diturunkan oleh Allah yang berisi kisah tentang orang-orang terdahulu dan belakangan serta ilmu orang-orang terdahulu dan yang datang kemudian."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tur ayat 2: 2-3. Allah bersumpah dengan Al Qur’an Al Adzhim yang ditulis di kulit yang tipis, dan terhampar, sehingga nampak bagi siapapun yang melihatnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Bisa maksudnya Lauh Mahfuzh, bisa juga maksudnya adalah Al Qur’an yang merupakan kitab yang paling utama yang di dalamnya terdapat berita orang-orang yang terdahulu dan yang datang kemudian."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tur Ayat 2",
    "description": "1-6. Surah a'-''riy't ditutup dengan penegasan jatuhnya ancaman Allah bagi mereka yang kafir. Surah at-t'r diawali dengan kepastian jatuhnya azab bagi mereka yang mengingkari ayat-ayat Allah. Penegasan tentang kepastian azab ini diawali dengan sumpah-sumpah Allah. Demi gunung sinai yang menjadi lokasi nabi musa menerima taurat, dan demi kitab Allah yang diwahyukan-Nya dan yang ditulis pada lembaran yang terbuka sehingga mudah dibaca dan dipahami maknanya, dan demi baitulma'mur, yaitu kakbah atau tempat yang menjadi lokasi para malaikat rukuk, sujud, dan tawaf, dan demi atap, yaitu langit, yang ditinggikan dan kukuh tanpa tiang penyangga, dan demi lautan yang penuh gelombang yang di dalam tanahnya terdapat api"
  }
]