[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "19-20. Makanlah makanan yang nikmat dan minumlah minuman yang lezat, sebagai balasan atas amal-amal shalih yang kalian kerjakandi dunia. Mereka bersandar diatas ranjang-ranjang yang berhadap-hadapan. Kami memberi mereka pasangan wanita-wanita yang berkulit putih, bermata lebar dan cantik-cantik."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "20. Mereka bertelekan di atas dipan-dipan yang dihiasi yang dibikin berbaris. Dan Kami nikahkan mereka dengan bidadari-bidadari putih bermata lebar."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "20. مُتَّكِـِٔينَ عَلَىٰ سُرُرٍ مَّصْفُوفَةٍ ۖ (mereka bertelekan di atas dipan-dipan berderetan) Makna (المصفوفة) yakni berjejeran satu sama lain hingga membentuk barisan. وَزَوَّجْنٰهُم بِحُورٍ عِينٍ(dan Kami kawinkan mereka dengan bidadari-bidadari yang cantik bermata jeli) Yakni setiap mereka Kami pasangkan dengan wanita surga. Dan makna (الحور) yakni wanita yang memiliki mata yang sangat putih bening dengan pupil yang sangat hitam. Sedangkan (العين) yakni wanita yang memiliki mata yang lebar dan jelita."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20. Mereka bersandar di atas ranjang-ranjang yang saling berjejeran membentuk satu barisan. Kami kawinkan mereka dengan bidadari-bidadari yang putih, cantik dan menyenangkan pandangan. Bentuk mufrad Al-Huur adalah al-Huuraa’, Al-Huuraa’ adalah perempuan yang kelopak matanya sangat putih dan hitam. Al-‘Ain bentuk mufradnya adalah ‘Ainaa’, yaitu mata yang bulat lebar."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka bersandar di atas dipan-dipan yang tersusun} yang saling berhadapan {dan Kami menikahkan mereka dengan bidadari} perempuan-perempuan yang putih {yang bermata indah} yang lebar matanya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "20. “Mereka bertelekan di atas dipan-dipan berderetan.” Bertelekan adalah duduk secara nyaman, enak, dan tegak, sedangkan dipan yang dimaksud adalah bantal-bantal yang berhias dengan berbagai hiasan berupa kain mewah dan kasur yang mengembang. Allah menggambarkan dipan-dipan berderetan sebagai petunjuk akan banyaknya, penataannya yang rapi serta kebersamaan penghuninya serta kegembiraan mereka dengan pergaulan mereka yang baik serta saling bertamah-tamah satu sama lain. Setelah kenikmatan hati, ruh, dan raga bersatu yang belum pernah terlintas di benak dan belum pernah ada dalam khayalan berupa makanan dan minuman lezat serta tempat tinggal yang indah, maka tidak ada yang tersisa selain bersenang-senang dengan wanita sebagai pelengkap kegembiraan. Allah menyebutkan, para penduduk surga memiliki pasangan istri-istri yang sifat, bentuk tubuh, serta akhlak mereka paling sempurna, karena itulah Allah berfirman, “Dan Kami kawinkan mereka dengan bidadari-bidadari yang cantik bermata jeli.” Mereka adalah wanita-wanita yang memiliki kecantikan wujud nyata disertai akhlak yang baik sehingga siapa pun yang memandangnya akan terlena, mereka bisa menarik hati seluruh alam. Seluruh hati seolah terbang karena merindukan mereka serta keinginan agar bisa sampai pada mereka. Bermata jeli adalah bermata indah kelabu yang bening berwarna putih dan hitam."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tur ayat 20: Allah menjelaskan sebagian apa yang mereka dapat dari kenikmatan di surga; Allah mengabarkan bahwa mereka bertelekan di atas dipan-dipan mereka yang di hias dengan macam-macam hiasan; Berderet-deret sebagian yang lain bagi sebagian yang lainnya. Allah mengabarkan bahwa istri-istri mereka adalah bidadari, dan di sana terdapat para wanita yang terkumpul padanya sifat-sifat indah pada mereka, dan indah secara dzahir maupun bathin. Allah persiapkan para wanita itu bagi mereka hamba-Nya yang beriman yang diberikan nikmat di surga yang penuh kenikmatan; Mereka akan diberikan tambahan atas istrinya yang di dunia, dengan para wanita yang Allah ciptakan indah dari bidadari-bidadari."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala menyifati dipan-dipan tersebut bahwa ia tersusun yang menunjukan banyaknya, rapinya, berkumpulnya keluarganya dan senangnya mereka karena baiknya pergaulan mereka dan halusnya ucapan antara sesama mereka. Ketika kenikmatan hati, ruh maupun badan telah berkumpul pada mereka yang belum pernah terbayang berupa makanan dan minuman yang enak dan tempat duduk yang indah, tinggallah mereka bersenang-senang dengan wanita yang kesenangannya tidak sempurna tanpanya, maka Allah Subhaanahu wa Ta'aala menyebutkan bahwa untuk mereka ada istri-istri yang paling sempurna sifat, fisik dan akhlaknya. Oleh karena itu, Allah Subhaanahu wa Ta'aala berfirman, “dan Kami berikan kepada mereka pasangan bidadari yang bermata indah.” Wanita-wanita ini menggabung antara penampilan yang menarik dan akhlak yang utama, yang membuat orang-orang yang melihatnya tercengang karena begitu cantiknya, bahkan membuat hati melayang kepadanya karena rindunya. Mata mereka indah, dimana warna putih dan hitamnya begitu jelas."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tur Ayat 20",
    "description": "Saat menikmati anugerah Allah itu, mereka duduk dengan nyaman sambil bersandar di atas dipan-dipan yang tersusun dengan indah dan rapi. Kami anugerahi mereka berbagai kenikmatan yang sempurna dan kami berikan pula kepada mereka pasangan berupa bidadari yang bermata indah. 21. Di surga Allah akan mempertemukan orang tua dengan keturunannya yang seiman. Dan orang-orang yang beriman dan mendapat balasan surga, beserta anak cucu mereka atau ibu bapak mereka yang mengikuti mereka dalam keimanan, walaupun derajat keimanannya tidak serupa, akan kami pertemukan mereka dengan anak cucu mereka di surga sebagai anugerah atas ketakwaan mereka, dan kami tidak mengurangi sedikit pun pahala amal kebajikan yang telah mereka perbuat di dunia. Setiap orang terikat dan akan bertanggung jawab dengan apa yang dikerjakannya, dan dia tidak akan dihukum karena dosa orang lain."
  }
]