[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang beriman, dan anak-anak mereka juga ikut beriman, Kami menyusulkan anak-anak mereka dengan mereka dalam derajat mereka di surga sekalipun amal mereka tidak mencapai amal bapak-bapak mereka, agar para bapak berbahagia dengan anak-anak mereka yang mendapatkan kedudukan sama dengan mereka. Mereka dipersatukan dalam suasana yang membahagiakan. Kami tidak mengurangi sedikit pun dari balasan amal mereka. Setiap orang tergadaikan dengan amalnya, tidak memikul dosa orang lain."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Orang-orang yang beriman dan diikuti oleh anak-anak mereka dalam keimanan, maka Kami pertemukan mereka dengan anak-anak mereka agar hati mereka menjadi senang meski anak-anak mereka tidak mencapai amal perbuatan mereka. Dan Kami tidak mengurangi sedikitpun pahala amal perbuatan mereka. Setiap manusia terikat oleh amal perbuatan buruk yang dilakukannya, tidak ada sedikitpun dari amalnya itu yang diambil darinya oleh orang lain."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "21-28. Dan orang-orang beriman yang para keturunan mereka juga ikut beriman, maka para keturunan itu akan Kami kumpulkan bersama mereka di dalam surga, dan Kami tidak mengurangi sedikitpun pahala amal kebaikan mereka. Dan setiap hamba akan tertawan oleh amalannya sendiri, dia tidak akan dihukum akibat dosa orang lain. Dan Kami akan memberi mereka berbagai jenis buah-buahan dan daging yang mereka sukai. Di dalam surga, mereka akan mengabil gelas-gelas yang terisi khamr yang tidak memabukkan dan tidak mendatangkan dosa. Mereka akan dikelilingi para pelayan muda yang tampan seperti mutiara-mutiara yang tersimpan dalam kerangnya. Para penghuni surga saling berbincang menanyakan keadaan mereka di dunia, mereka berkata: “Dahulu di keluarga kami, kami adalah orang-orang yang takut kepada Allah, maka Allah memuliakan kami dengan petunjuk dan ampunan, dan melindungi kami dari neraka Jahannam dan dari panasnya yang membakar tubuh. Dahulu kami menyembah dan tunduk kepada Allah Semata, Dia Maha Lembut dan Pengasih kepada para hamba-Nya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "21. وَالَّذِينَ ءَامَنُوا۟ وَاتَّبَعَتْهُمْ ذُرِّيَّتُهُم بِإِيمٰنٍ أَلْحَقْنَا بِهِمْ ذُرِّيَّتَهُمْ (Dan orang-oranng yang beriman, dan yang anak cucu mereka mengikuti mereka dalam keimanan, Kami hubungkan anak cucu mereka dengan mereka) Yakni Allah mengangkat derajat keturunan orang yang beriman menuju derajatnya, meskipun keturunannya itu lebih sedikit amal kebaikannya, dan ini hanya bagi keturunannya yang beriman. وَمَآ أَلَتْنٰهُم مِّنْ عَمَلِهِم مِّن شَىْءٍ ۚ( dan Kami tiada mengurangi sedikitpun dari pahala amal mereka) Yakni Kami tidak mengurangi pahala amal seorang ayah disebabkan keturunan yang Kami angkat derajatnya kepadanya. كُلُّ امْرِئٍۭ بِمَا كَسَبَ رَهِينٌ(Tiap-tiap manusia terikat dengan apa yang dikerjakannya) Yakni tertawan oleh amalannya di hari kiamat. Jika ia menjalankan apa yang diperintahkan Allah kepadanya maka Allah akan membebaskannya, namun jika tidak maka Allah akan membinasakannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "21. Sedangkan orang-orang yang beriman kepada Allah dan rasulNya, serta pengikut-pengikut dan anak cucu mereka yang beriman, Kami sertakan mereka untuk masuk surga dan Kami berikan derajat (mulia). Jika mereka (anak-cucu mereka) belum sempat mengerjakan amal ibadah mereka, maka sebagai bentuk kemulian bagi leluhur mereka, Kami kumpulkan mereka bersama-sama, sehingga pandangan-pandangan dan jiwa mereka menjadi nyaman dan tenang. Kami tidak mengurangi sedikitpun pahala dari amal ibadah para leluhur mereka, namun kami tambahkan (pahala) amal ibadah anak-cucu mereka sebagai pentuk pengistimewaan bagi mereka. Setiap orang saling terikat atau terkait dengan amal ibadahnya pada hari kiamat, baik amal kebaikan ataupun keburukan. Seseorang tidak akan menanggung dosa orang lainnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Orang-orang yang beriman dan diikuti oleh keturunan mereka dalam beriman, Kami akan mengumpulkan mereka dengan keturunan yang. Kami tidak mengurangi} Kami tidak mengurangi {sedikit pun amal mereka. Setiap orang terikat dengan apa yang dikerjakannya} terikat dengan amalnya, sehingga dia tidak menanggung dosa orang lain"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21. Inilah di antara penyempurna kenikmatan penduduk surga yakni, Allah mempertemukan mereka dengan keturunan mereka yang seiman, mereka dipertemukan karena keimanan dari ayah-ayah mereka sehingga keturunan mereka menjadi pengikut ayah-ayah mereka karena keimanan. Lebih dari itu, karena keturunan mereka ikut serta karena keimanan mereka, maka keturunan mereka itu dipertemukan dengan ayah-ayah mereka di surga oleh Allah meski amalan mereka tidak setara dengan amalan orang tua mereka sebagai balasan baik untuk orang tua mereka dan sebagai tambahan atas pahala mereka. Meski demikian, Allah tidak mengurangi sama sekali amalan orang tua mereka. Dari sini mungkin saja orang yang salah memahami bahwa penduduk neraka akan dipertemukan Allah dengan keturunan mereka, Allah menyebutkan bahwa hukum kedua tempat (surga dan neraka) tidak sama. Neraka adalah tempat keadilan dan di antara keadilan Allah tidak menyiksa seorang pun kecuali karena dosa, karena itulah Allah berfirman, “Tiap-tiap manusia terikat dengan apa yang dikerjakannya,” artinya tergadai dengan amalannya. Orang tidak akan menanggung beban dosa orang lain. Paparan ini berguna untuk menghilangkan dugaan keliru di atas."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tur ayat 21: Allah mengabarkan mereka orang-orang yang beriman yang masuk surga, dan anak-anak keturunan mereka yang mengikuti mereka dengan keimanan; Maka sungguh Allah berikan kenikmatan kepada mereka dengan nikmat yang sempurna karena bahwasanya mereka diikuti oleh keturunan-keturunan mereka yang mencintai mereka dengan keimanan dimana keturunan-keturunan mereka memuliakan bapak-bapak mereka. Meskipun anak-anak keturunan mereka tidak sampai pada derajat amalan bapak-bapak meeka. Kemudian Allah menjelaskan bahwa Dia tidak mengurangi sedikitpun balasan dari amalan-amalan mereka, dan Allah menjelaskan bahwa segala urusan itu tergantung kepada amalan dan terhalangi dengan sebab amalan pula, dan Allah yang membalas amalan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya, anak cucu mereka yang beriman itu ditinggikan Allah derajatnya sebagaimana derajat bapak-bapak mereka, dan dikumpulkan dengan bapak-bapak mereka di dalam surga meskipun mereka tidak mengerjakan amal mereka (bapak-bapak mereka) sebagai penghormatan dan balasan kepada bapak-bapak mereka, serta sebagai tambahan terhadap pahala mereka. Ini termasuk di antara sempurnanya kenikmatan penghuni surga. Meskipun begitu Allah tidak mengurangi amal saleh bapak-bapak mereka. Allahumma innaa nas’alukal jannah wa na’uudzu bika minan naar (Ya Allah, kami meminta surga kepada-Mu dan berlindung kepada-Mu dari neraka). Allahumma innaa nas’alukal jannah wa na’uudzu bika minan naar. Allahumma innaa nas’alukal jannah wa na’uudzu bika minan naar. Rabbanagh firlanaa wa li waalidainaa kamaa rabbayaanaa shighaaraa. Terkadang timbul anggapan, bahwa penghuni neraka juga sama, yakni Allah pertemukan mereka dan keturunannya di neraka, maka Allah memberitahukan bahwa hukum di antara kedua tempat itu (surga dan neraka) tidak sama, karena neraka adalah tempat keadilan, dan di antara keadilan Allah ‘Azza wa Jalla adalah Dia tidak akan mengazab seorang pun kecuali karena dosanya. Oleh karena itu, Dia berfirman, “Setiap orang terikat dengan apa yang dikerjakannya.” Jika baik maka dibalas dengan kebaikan, dan jika buruk maka dibalas dengan keburukan, dan seseorang tidak akan menanggung dosa orang lain."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tur Ayat 21",
    "description": "Di surga Allah akan mempertemukan orang tua dengan keturunannya yang seiman. Dan orang-orang yang beriman dan mendapat balasan surga, beserta anak cucu mereka atau ibu bapak mereka yang mengikuti mereka dalam keimanan, walaupun derajat keimanannya tidak serupa, akan kami pertemukan mereka dengan anak cucu mereka di surga sebagai anugerah atas ketakwaan mereka, dan kami tidak mengurangi sedikit pun pahala amal kebajikan yang telah mereka perbuat di dunia. Setiap orang terikat dan akan bertanggung jawab dengan apa yang dikerjakannya, dan dia tidak akan dihukum karena dosa orang lain. 22. Dan selain itu, kami berikan pula kepada mereka tambahan berupa aneka buah-buahan yang lezat dan daging dari segala jenis hewan yang mereka inginkan."
  }
]