[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "22-23. Kami menambahkan disamping nikmat-nikmat tersebut buah-buahan dan daging yang nikmat dan disukai. Dan diantara kenikmatan itu, adalah mereka saling menyuguhkan gelas-gelas khamar, salah seorang dari mereka menyuguhkannya kepada rekannya, ini melengkapi kegembiraan mereka. Minuman ini tidak sama dengan khamar dunia, akal peminumnya tidak tertutup, tidak menyebarkan mabuk dan tidak mengakibatkan ucapan-ucapan batil dan maksiat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "23. Mereka saling memberikan gelas di Surga yang meminum darinya tidak berdampak sebagaimana dampak minum di dunia, seperti timbulnya ucapan-ucapan batil dan dosa akibat mabuk."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "23. يَتَنٰزَعُونَ فِيهَا كَأْسًا (Di dalam surga mereka saling memperebutkan piala (gelas)) Yakni mereka saling memberi dan mengabil gelas yang berisi khamr surga. لَّا لَغْوٌ فِيهَا وَلَا تَأْثِيمٌ(yang isinya tidak (menimbulkan) kata-kata yang tidak berfaedah dan tiada pula perbuatan dosa) Yakni tidak terjadi keributan atau dosa di antara mereka, tidak seperti yang terjadi pada orang-orang yang meminum khamr di dunia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "23. Di surga, mereka saling berebut gelas (piala) dari tiap tangan orang yang memegangnya dengan senang dan gembira. Mereka tidak mengucapkan ucapan yang bathil dan tidak baik dan tidak melakukan tindakan yang menimbulkan dosa, maknanya yaitu tindakan yang termasuk dalam dosa berupa ucapan yang keji atau semacamnya yang dibenci Allah, karena sesungguhnya khamr surga itu tidak menghilangkan akal mereka. Hal ini berlawanan dengan khamr di dunia."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Di dalamnya mereka saling mengulurkan} mereka saling memberi dan menerima {gelas} khamr {yang tidak ada kesia-siaan padanya} mereka tidak membicarakan perkataan sia-sia dan perkataan yang buruk ketika meminumnya {dan tidak (menimbulkan) perbuatan dosa} dan mereka tidak melakukan sesuatu yang menimbulkan dosa bagi orang yang mengerjakannya karena minuman itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "23. “Di dalam surga mereka saling memperebutkan piala (gelas),” artinya, gelas-gelas piala serta arak berputar mengelilingi mereka, penduduk surga saling memberi satu sama lain, anak-anak kecil mengelilingi mereka dengan membawa gelasa dan ceret, “yang isinya tidak (menimbulkan) kata-kata yang tidak berfaidah dan tiada pula perbuatan dosa.” Artinya tidak ada kata sia-sia di dalam surga yaitu kata-kata yang tidak berguna dan dosa yang bisa mendatangkan dosa dan maksiat. Karena dua hal tersebut tidak ada (perkataan tiada guna dan dosa), maka yang ada adalah perkataan salam, baik, suci, yang membuat hati bahagia, penduduk surga saling bergaul dengan baik, saling memberi minum satu sama lain dengan baik. Mereka tidak mendengan Firman Rabb mereka kecuali yang meneduhkan mata mereka, yang menunjukkan keridhaanNya keada mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tur ayat 23: 22-23. Allah menjelaskan dari sisi yang lain dari kenikmatan penghuni surga; Allah mengabarkan bahwa Dia menambahkan akan keinginan mereka dari buah-buahan yang lezat, dan daging yang baik, dan dari setiapa apa yang mereka inginkan dan minta. Mereka saling mengambil apa yang di antaa mereka dari gelas-gelas yang berisi khamr, dan mereka saling menikmatinya, Allah menambahkan kenikmatan pada mereka. Bahwasanya khamr surga tidak sama sebagaimana khamr di dunia, ia tidak menghilangkan akal, dan juga membuat akal kosong (mabuk); Di antara mereka tidak ada kesia-siaan dalam ucapan yang bathil, sebagaimana manusia yang meminum khamr di dunia, yang mereka (penghuni surga) merasakan kegembiraan dan kelezatan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Berbeda dengan khamr (arak) di dunia, yang menimbulkan ucapan yang sia-sia dan perbuatan dosa. Jika tidak ada ucapan yang sia-sia dan perbuatan dosa, maka yang ada adalah ucapan salam, baik dan suci, menyenangkan jiwa dan menggembirakan hati. Mereka tidak mendengar dari Tuhan mereka selain sesuatu yang menyenangkan mereka dan menunjukkan ridha dan cinta-Nya kepada mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tur Ayat 23",
    "description": "Di dalam surga itu mereka bersuka ria dan merasakan kegembiraan yang tiada habis. Mereka saling mengulurkan gelas yang isinya minuman yang tidak memabukkan dan tidak pula menyebabkan munculnya ucapan yang tidak berfaedah ataupun perbuatan dosa seperti halnya minuman keras di dunia. 24. Dan di surga itu, di sekitar mereka ada pelayan berupa anak-anak muda yang berkeliling untuk melayani keperluan mereka. Para pemuda itu tampak tampan dan berpakaian rapi seakan-akan mereka itu mutiara yang tersimpan di tempat yang terjaga."
  }
]