[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "25-28. Para penghuni surga datang, sebagian bertanya kepada sebagian yang lain tentang kenikmatan besar yang mereka dapatkan dan sebabnya. Mereka berkata, “kami di dunia saat berada berada di tengah keluarga kami adalah orang-orang yang takut kepada Tuhan kami, takut kepada azabNya di Hari Kiamat. Lalu Allah memberi kami nikmat hidayah dan taufik, Allah menjaga kami dari azab beracun Neraka Jahanam, yakni api dan panasnya. Sesungguhnya kami sebelum ini beribadah dengan rendah hati kepada Allah semata tidak menyekutukanNya dengan apa pun, maka Allah menjaga kami dari azab neraka dan menyampaikan kami ke surga yang penuh kenikmatan ini. Allah menjawab doa kami dan memberi kami apa yang kami minta. Sesungguhnya Allah Mahabaik lagi Maha Penyayang di antara kebaikan Allah dan dan rahmatNYa kepada kami adalah Dia memberikan ridha dan surgaNya, serta menjaga kami dari murkaNya dan neraka.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "25. Dan sebagian penghuni Surga menatap sebagian penghuni yang lain, sebagian bertanya kepada sebagian yang lain tentang keadaan mereka di dunia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "25. Di surga, mereka saling berhadap-hadapan dan bertanya-tanya tentang keadaan dan amal ibadah mereka di dunia"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sebagian mereka menghadap kepada sebagian yang lain saling bertegur sapa} mereka saling bertanya satu sama lain"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "25. “Dan sebagian mereka menghadap kepada sebagian yang lain saling tanya-menanya,” tentang masalah dan kondisi pada saat di dunia."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tur ayat 25: 25-28. Setelah Allah mensifatkan kenikmatan yang mereka hidup di dalam surga, Allah mengabarkan bahwa mereka (penghuninya) bertanya satu sama lain; Mereka berkata : Sungguh kami ketika berada di tengah-tengah keluarga kami, merasa takut dengan Allah, kami takut dari adzab dan hukuman-Nya; Sehingga Allah mempersilahkan kami dan membalas kami dengan adzab yang buruk yaitu neraka jahannam yang panas sangat apinya. Kemudian mereka berkata : Sesungguhnya kami sebelumnya hanyalah beribadah kepada Allah saja, tidak menyekutukan-Nya dengan sesuatu apapun. Dan kami memohon agar diselamatkan dari adzab neraka yang buruk. Sungguh Allah Maha Memiliki Kebaikan yang banyak dan Maha Lembut, Maha Kasih Sayang yang luas kasih sayang-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni tentang urusan dunia dan keadaannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tur Ayat 25",
    "description": "Orang-orang bertakwa itu sangat menikmati anugerah Allah, dan sebagian mereka berhadap-hadapan satu sama lain untuk bercengkerama dan saling bertegur sapa dalam keriangan. 26. Ketika para penghuni surga ditanya tentang sikap dan perbuatan apa yang membuat mereka mendapat ganjaran surga, dengan serentak mereka berkata, 'sesungguhnya kami di dunia dahulu, sewaktu kami masih berada di tengah-tengah keluarga, kami selalu merasa takut akan diazab di neraka, karena itu kami selalu melakukan kebaikan dan mendekatkan diri kepada Allah."
  }
]