[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "25-28. Para penghuni surga datang, sebagian bertanya kepada sebagian yang lain tentang kenikmatan besar yang mereka dapatkan dan sebabnya. Mereka berkata, “kami di dunia saat berada berada di tengah keluarga kami adalah orang-orang yang takut kepada Tuhan kami, takut kepada azabNya di Hari Kiamat. Lalu Allah memberi kami nikmat hidayah dan taufik, Allah menjaga kami dari azab beracun Neraka Jahanam, yakni api dan panasnya. Sesungguhnya kami sebelum ini beribadah dengan rendah hati kepada Allah semata tidak menyekutukanNya dengan apa pun, maka Allah menjaga kami dari azab neraka dan menyampaikan kami ke surga yang penuh kenikmatan ini. Allah menjawab doa kami dan memberi kami apa yang kami minta. Sesungguhnya Allah Mahabaik lagi Maha Penyayang di antara kebaikan Allah dan dan rahmatNYa kepada kami adalah Dia memberikan ridha dan surgaNya, serta menjaga kami dari murkaNya dan neraka.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "27. Kemudian Allah memberikan petunjuk kepada kami untuk memeluk Islam dan menjaga kami dari siksa yang panasnya sampai pada puncaknya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "27. فَمَنَّ اللهُ عَلَيْنَا (Maka Allah memberikan karunia kepada kami) Dengan ampunan dan rahmat, atau dengan taufik dari-Nya untuk menjalankan ketaatan. وَوَقَىٰنَا عَذَابَ السَّمُومِ(dan memelihara kami dari azab neraka) Yakni azab neraka. Dan makna (سموم جهنم) yakni hawa panas dari neraka Jahannam. Dikatakan hawa panas itu disebut dengan (سموم) karena panasnya menembus pori-pori."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "27. Maka Allah mengkaruniai kami ampunan dan rahmat, dan menjauhkan kamu (melindungi kami) dari azab dan panasnya api neraka. As-Samum adalah azab yang mereka dapatkan dari azab neraka Jahanam"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka berkata,“Sesungguhnya kami dahulu, ketika berada di tengah-tengah keluarga kami, adalah orang yang takut} orang-orang yang takut dengan azab"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "27. “Maka Allah memberikan karunia kepada kami,” dengan hidayah dan pertolongan, “dan memelihara kami dari azab neraka,” azab yang amat sangat panas."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tur ayat 27: 25-28. Setelah Allah mensifatkan kenikmatan yang mereka hidup di dalam surga, Allah mengabarkan bahwa mereka (penghuninya) bertanya satu sama lain; Mereka berkata : Sungguh kami ketika berada di tengah-tengah keluarga kami, merasa takut dengan Allah, kami takut dari adzab dan hukuman-Nya; Sehingga Allah mempersilahkan kami dan membalas kami dengan adzab yang buruk yaitu neraka jahannam yang panas sangat apinya. Kemudian mereka berkata : Sesungguhnya kami sebelumnya hanyalah beribadah kepada Allah saja, tidak menyekutukan-Nya dengan sesuatu apapun. Dan kami memohon agar diselamatkan dari adzab neraka yang buruk. Sungguh Allah Maha Memiliki Kebaikan yang banyak dan Maha Lembut, Maha Kasih Sayang yang luas kasih sayang-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan memberikan ampunan, hidayah dan taufiq kepada kami. Yaitu azab yang sangat panas."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tur Ayat 27",
    "description": "Sebagai rahmat dari dari Allah, maka Allah sesuai dengan janji-Nya memberikan karunia surga kepada kami dan senantiasa memelihara kami dari azab neraka yang tidak terkirakan pedihnya. 28. Sesungguhnya kami sebelum menerima anugerah ini selalu menyembah dan berdoa kepada-Nya sejak di dunia dahulu. Tuhan telah mengabulkan doa kami. Sesungguhnya hanya dialah yang maha melimpahkan kebaikan kepada orang yang bertakwa, lagi maha penyayang kepada semua makhluk-Nya. '."
  }
]