[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "25-28. Para penghuni surga datang, sebagian bertanya kepada sebagian yang lain tentang kenikmatan besar yang mereka dapatkan dan sebabnya. Mereka berkata, “kami di dunia saat berada berada di tengah keluarga kami adalah orang-orang yang takut kepada Tuhan kami, takut kepada azabNya di Hari Kiamat. Lalu Allah memberi kami nikmat hidayah dan taufik, Allah menjaga kami dari azab beracun Neraka Jahanam, yakni api dan panasnya. Sesungguhnya kami sebelum ini beribadah dengan rendah hati kepada Allah semata tidak menyekutukanNya dengan apa pun, maka Allah menjaga kami dari azab neraka dan menyampaikan kami ke surga yang penuh kenikmatan ini. Allah menjawab doa kami dan memberi kami apa yang kami minta. Sesungguhnya Allah Mahabaik lagi Maha Penyayang di antara kebaikan Allah dan dan rahmatNYa kepada kami adalah Dia memberikan ridha dan surgaNya, serta menjaga kami dari murkaNya dan neraka.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "28. Sesungguhnya ketika di kehidupan dunia kami menyembah-Nya dan berdoa kepada-Nya agar memelihara kami dari siksa Neraka, sesungguhnya Dia Maha baik dengan hamba-hamba-Nya dan Maha Penyayang terhadap mereka. Di antara kebaikan dan rahmat-Nya kepada kami, Dia memberi hidayah kami kepada keimanan dan memasukkan kami ke dalam Surga serta menjauhkan kami dari Neraka.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "28. إِنَّا كُنَّا مِن قَبْلُ نَدْعُوهُ ۖ (Sesungguhnya kami dahulu menyembah-Nya) Yakni kami mengesakan dan menyembah Allah, serta mengharapkan dari-Nya ampunan dan rahmat. إِنَّهُۥ هُوَ الْبَرُّ الرَّحِيمُ(Sesungguhnya Dialah yang melimpahkan kebaikan lagi Maha Penyayang) Yakni banyak memberi kebaikan dan rahmat bagi hamba-hamba-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "28. Sesungguhnya kami di dunia menyembah Allah dan bertauhid kepadaNya. Sesungguhnya Dialah Dzat yang banyak kebaikanNya dan luas rahmatNya bagi hamba-hambaNya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya kami menyembahNya sejak dahulu. Sesungguhnya hanya Dialah Yang Maha Baik} Maha Baik lagi Maha Benar janjiNya {lagi Maha Penyayang”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "28. “Sesungguhnya kami dahulu memohon padaNYa,” agar kami dijaga dari siksaan yang membara serta agar kami disampaikan pada kenikmatan. Permintaan tersebut mencakup doa ibadah dan doa meminta. Kami sewaktu di dunia menyembahNya di segala waktu. “Sesungguhnya Dia-lah yang melimpahkan kebaikan lagi Maha Penyayang,” dan di antara kebaikan dan rahamatNya kepada kami adalah kami mendapatkan ridha dan surgaNya serta menjaga kami dari kemurkaan dan nerakaNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tur ayat 28: 25-28. Setelah Allah mensifatkan kenikmatan yang mereka hidup di dalam surga, Allah mengabarkan bahwa mereka (penghuninya) bertanya satu sama lain; Mereka berkata : Sungguh kami ketika berada di tengah-tengah keluarga kami, merasa takut dengan Allah, kami takut dari adzab dan hukuman-Nya; Sehingga Allah mempersilahkan kami dan membalas kami dengan adzab yang buruk yaitu neraka jahannam yang panas sangat apinya. Kemudian mereka berkata : Sesungguhnya kami sebelumnya hanyalah beribadah kepada Allah saja, tidak menyekutukan-Nya dengan sesuatu apapun. Dan kami memohon agar diselamatkan dari adzab neraka yang buruk. Sungguh Allah Maha Memiliki Kebaikan yang banyak dan Maha Lembut, Maha Kasih Sayang yang luas kasih sayang-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni mentauhidkan-Nya. Bisa juga kata-kata “nad’uuhu” diartikan, “Kami berdoa kepada-Nya,” yakni berdoa kepada-Nya agar kami dihindarkan dari azab neraka dan dimasukkan ke dalam surga. Kami selalu mendekatkan diri kepada-Nya dengan berbagai ibadah dan berdoa kepada-Nya di setiap waktu. Termasuk kebaikan dan rahmat-Nya kepada kami adalah Dia memberikan kepada kami keridhaan-Nya dan surga-Nya serta menghindarkan kami dari kemurkaan-Nya dan dari neraka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tur Ayat 28",
    "description": "Sesungguhnya kami sebelum menerima anugerah ini selalu menyembah dan berdoa kepada-Nya sejak di dunia dahulu. Tuhan telah mengabulkan doa kami. Sesungguhnya hanya dialah yang maha melimpahkan kebaikan kepada orang yang bertakwa, lagi maha penyayang kepada semua makhluk-Nya. '29. Allah memerintahkan nabi Muhammad untuk melanjutkan dak-wahnya, 'bila kesudahan manusia itu sesuai amal dan perbuatan masing-masing, maka peringatkanlah orang-orang kafir itu karena dengan nikmat dari tuhanmu, engkau bukanlah seorang tukang tenung, seperti tuduhan mereka, yang menyampaikan berita gaib tanpa dasar yang jelas, dan engkau bukan pula orang gila yang berpikiran kacau."
  }
]