[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Peringatkanlah (wahai rasul) orang-orang yang kepada mereka kamu diutus. Kamu karena nikmat Tuhanmu kepadamu berupa kenabian dan kekuatan akal, bukanlah seorang dukun yang mengabarkan perkara ghaib tanpa ilmu, bukan pula orang gila yang tidak mengerti apa yang diucapkan sebagaimana yang mereka klaim."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "29. Maka berilah peringatan -wahai Rasul- dengan Al-Qur`ān, engkau -karena kenikmatan yang diberikan Allah kepadamu berupa akal dan iman- bukanlah seorang dukun yang mempunyai pembantu dari kalangan jin, dan engkau bukanlah orang yang gila."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "29. Hai Rasulullah, Teruslah memperingatkan para hamba dengan al-Qur’an. Dengan risalah dan amanah yang Allah karuniakan kepadamu itu, kamu bukanlah dukun yang menebak-nebak hal ghaib, dan kamu bukan pula orang gila seperti yang dituduhkan orang-orang musyrik."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "29. فَذَكِّرْ فَمَآ أَنتَ بِنِعْمَتِ رَبِّكَ بِكَاهِنٍ وَلَا مَجْنُونٍ (Maka tetaplah memberi peringatan, dan kamu disebabkan nikmat Tuhanmu bukanlah seorang tukang tenung dan bukan pula seorang gila) Yakni tetaplah kamu memberi peringatan dan pelajaran, karena dengan nikmat dari Tuhanmu berupa kenabian itu kamu bukanlah menjadi dukun atau orang gila. Dukun adalah orang yang mengaku mengetahui ilmu ghaib tanpa perantara wahyu. Yakni apa yang kamu katakan itu bukanlah suatu perdukunan, sebab kamu mengatakan itu dengan perantara wahyu yang Allah perintahkan untuk kamu sampaikan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "29. Dan tetaplah menyampaikan risalahmu, nasehatmu dan dzikirmu wahai Rasulallah. Dengan nikmat Tuhanmu yang berupa nubuwwah itu, kamu bukanlah seorang dukun, yaitu sesuatu yang dianggap sebagai ilmu ghaib selain wahyu ilahi yang tidak masuk akal sebagaimana yang dituhkan oleh orang-orang musyrik yang merupakan pendusta itu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sampaikanlah peringatan karena berkat nikmat Tuhanmulah} karena nikmat Tuhanmu kepadamu berupa kenabian dan kecerdasan akal {kamu bukan seorang dukun dan bukan pula orang gila"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "29. Allah memerintahkan RasulNya, Muhammad agar tetap mengingatkan seluruh manusia, baik yang beriman maupun yang kufur agar hujjah Allah tegak terhadap orang-orang yang zhalim dan supaya orang-orang yang mendapat pertolongan bisa mengambil petunjuk dari peringatan itu. Allah juga memerintahkan agar RasulNya tidak mempedulikan perkataan serta gangguan orang-orang musyrik dan yang mendustakan, mereka yang menghalangi –halangi orang untuk mengikuti RasulNya padahl mereka tahu bahwa Rasulullah adalah orang yang paling jauh dari apa yang mereka tuduhkan dan dustakan, karena itulah Allah menafikan semua kekurangan yang dituduhkan pada RasulNya. Allah berfirman, “Dan kamu, disebabkan nikmat Rabbmu bukanlah,” yakni karena karunia dan kelembutanNya, “seorang tukang tenung,” yang memiliki khadam dari bangsa jin yang memberitahukan sebagian berita ghaib yang dicampuri seratus kebohongan, “dan bukan pula seorang gila,” yang kehilangan akal, tapi engkau adalah orang yang paling sempurna akalnya, paling jauh dari setan, dan paling benar, engkau adalah orang yang paling mulia dan sempurna."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tur ayat 29: Allah memerintahkan Nabi-Nya ﷺ agar mengingatkan kaumnya dengan Al Qur’an yang agung ini, dan tidak perlu memperdulikan akan ucapan mereka (orang-orang musyrik), maka sungguh engkau (Muhammad ﷺ) diberikan kenikmatan berupa kenabian dan kekuatan akal, yang ngkau bukanlah dukun yang mengetahui sesuatu yang ghaib, atau orang yang gila yang tidak memiliki akal, sebagaimana mereka (orang-orang musyrik) klaim; Maka wajib bagimu untuk terus menerus berdakwah, dan kokoh di atas apa yang engkau sebagai peringatan, ancaman dan petunjuk, dan jangan engkau pedulikan ucapan mereka yang menuduh engkau gila atau tukang sihir atau pendusta."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memerintahkan Rasul-Nya agar tetap memberikan peringatan kepada manusia, baik yag muslim maupun yang kafir agar hujjah Allah tegak kepada mereka dan agar dengan peringatan itu orang-orang yang mendapatkan taufiq memperoleh petunjuk. Demikian pula agar Beliau tidak mempedulikan ucapan dan gangguan orang-orang musyrik untuk menghalangi manusia dari mengikuti Beliau, padahal mereka mengetahui bahwa Beliau tidak seperti apa yang mereka tuduhkan. Oleh karena itulah di ayat ini, Allah Subhaanahu wa Ta'aala menafikan kekurangan yang mereka tuduhkan kepada Beliau, “Karena dengan nikmat Tuhanmu engkau (Muhammad) bukanlah seorang tukang tenung dan bukan pula orang gila.” Maksudnya tetaplah memberikan peringatan kepada orang-orang musyrik dan jangan berhenti hanya karena mereka mengatakan bahwa engkau adalah seorang dukun atau seorang yang gila. Yaitu orang yang memiliki khadam (pelayan) dari kalangan jin yang datang kepadanya membawa sebagian berita gaib yang dicuri dari langit yang kemudian dicampur dengan seratus kedustaan. Yakni yang hilang akal. Bahkan engkau wahai Muhammad adalah manusia yang paling sempurna akalnya, paling jauh dari setan, paling jujur, paling mulia dan paling sempurna."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tur Ayat 29",
    "description": "Allah memerintahkan nabi Muhammad untuk melanjutkan dak-wahnya, 'bila kesudahan manusia itu sesuai amal dan perbuatan masing-masing, maka peringatkanlah orang-orang kafir itu karena dengan nikmat dari tuhanmu, engkau bukanlah seorang tukang tenung, seperti tuduhan mereka, yang menyampaikan berita gaib tanpa dasar yang jelas, dan engkau bukan pula orang gila yang berpikiran kacau. 30. Tidak hanya menuduhmu tukang tenung dan orang gila, bahkan mereka yang kafir itu juga berkata, 'dia adalah seorang penyair yang kami tunggu-tunggu kecelakaan, seperti musibah atau kematian, menimpanya. '."
  }
]