[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "30-31. Atau apakah orang-orang musyrik itu berkata kepadamu (wahai Rasul) “Dia penyair yang menunggu ajal kematian”? katakanlah kepada mereka, “Silakan menunggu kematianku, sesungguhnya aku bersama kalian menunggu azab Allah atas kalian. Kalian akan tahu akibat baik itu milik siapa.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "30. Ataukah orang-orang yang mendustakan itu berkata, “Muhammad bukanlah seorang Rasul, akan tetapi dia adalah seorang penyair. Kami menunggu kematian menjemputnya sehingga kami bisa tenang darinya.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "30-31. Allah mengingkari orang-orang musyrik dengan 15 kali pengingkaran dalam 14 ayat berikut: Apakah orang-orang musyrik itu berkata, ‘Dia adalah penyair yang kita tunggu kematiannya’? Hai Rasulullah, katakanlah kepada mereka: “Tunggu saja kematianku, karena aku juga menunggu kebinasaan kalian.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "30. أَمْ يَقُولُونَ شَاعِرٌ نَّتَرَبَّصُ بِهِۦ رَيْبَ الْمَنُونِ (Bahkan mereka mengatakan: “Dia adalah seorang penyair yang kami tunggu-tunggu kecelakaan menimpanya”) Yakni kami menunggu musibah menimpanya sehingga ia meninggal seperti orang lainnya, atau binasa sebagaimana orang sebelumnya binasa, sehingga urusannya dan agama yang dibawanya selesai."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "30. Bahkan orang-orang musyrik itu berkata: “Sesungguhnya kamu adalah penyair, yang kami tunggu-tunggu waktu terjadinya ucapannya sampai dia mati sebagaimana penyair-penyair lainnya?!” Ayat ini diturunkan saat orang-orang kafir Quraisy menyusun rencana di Darun Nadwah untuk mengikan nabi SAW dan meninggalkannya sampai beliau meninggal."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Atau} bahkan {mereka berkata,“Dia adalah seorang penyair yang kami tunggu-tunggu} yang Kami tunggu {kecelakaan menimpanya”} selesai usianya, sehingga dia binasa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "30. Terkadang “mereka mengatakan,” tentang Nabi Muhammad bahwa beliau adalah “seorang penyair,” yang bersyair dan yang dibawanya adalah syair, padahal Allah berfirman, Dan Kami tidak mengajarkan syair kepadanya (Muhammad) dan bersyair itu tidaklah layak baginya-Yasin: 69- “Yang Kami tunggu-tunggu kecelakaan menimpanya,” artinya, kami menanti kematiannya sehingga urusannya usia supaya kami merasa tenang."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tur ayat 30: Kemudian Allah mengingkari mereka orang-orang musyrik yang keras kepala atas apa yang mereka telah katakan kepada Muhammad ﷺ bahwa Muhammad adalah seorang penyair, dan Allah akan menimpakan kepada mereka fenomena-fenomena zaman, dari kematian dan kefanaan, dan dai akibat apa yang mereka telah perbuat dan yang telah diseru kepada mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dalam ayat lain, Allah Subhaanahu wa Ta'aala berfirman, “Dan Kami tidak mengajarkan syair kepadanya (Muhammad) dan bersyair itu tidaklah layak baginya. Al Quran itu tidak lain hanyalah pelajaran dan kitab yang memberi penerangan.” (Terj. Yaasin: 69) Sehingga kami dapat beristirahat darinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tur Ayat 30",
    "description": "Tidak hanya menuduhmu tukang tenung dan orang gila, bahkan mereka yang kafir itu juga berkata, 'dia adalah seorang penyair yang kami tunggu-tunggu kecelakaan, seperti musibah atau kematian, menimpanya. '31. Allah tidak memerintahkan nabi Muhammad untuk menanggapi tuduhan orang kafir yang tidak berdasar itu. Dia berfirman, 'katakanlah kepada mereka, 'wahai orang kafir, tunggulah ketetapan Allah atasmu! sesungguhnya aku pun termasuk orang yang sedang menunggu bersama kamu datangnya ketetapan Allah itu. '."
  }
]