[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bahkan apakah orang-orang yang mendustakan itu diperintahkan oleh akal mereka agar mengatakan kata-kata yang bertentangan ini? Hal itu karena kriteria dukun, penyair dan orang gila tidak mungkin terkumpul di saat yang sama. Mereka memang suatu kaum yang melampaui batas dalam kesombongan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "32. Apakah akal mereka yang menyuruh mereka berkata bahwa dia seorang dukun dan orang gila? Sehingga mereka menyatukan hal yang tidak mungkin bersatu pada seseorang. Justru mereka adalah kaum yang melampaui batas, tidak melandasi tindakannya dengan syariat maupun akal."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "32-34. Apakah akal mereka itu memerintahkan mereka untuk mengatakan kedustaan ini? Atau mereka adalah orang yang telah terbiasa berbuat sombong? Atau juga mereka berkata, ‘Muhammad telah membuat sendiri al-Qur’an’? Kenyataannya bukan seperti yang mereka katakan, namun itu karena mereka tidak mempercayai al-Qur’an. Hendaklah mereka mendatangkan perkataan yang seperti al-Qur’an jika perkataan mereka itu benar."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "32. أَمْ تَأْمُرُهُمْ أَحْلٰمُهُم بِهٰذَآ ۚ (Apakah mereka diperintah oleh fikiran-fikiran mereka untuk mengucapkan tuduhan-tuduhan ini) Apakah akal mereka menyuruh mereka untuk mengatakan kata-kata yang saling bertolak belakang ini? Yakni dengan mengatakan bahwa al-Qur’an adalah sihir, perdukunan, atau syair. Dahulu pembesar-pembesar kaum Quraisy sangat terkenal dengan akal dan kecerdasan mereka, maka Allah merendahkan dan mengolok kecerdasan mereka karena tidak dapat mengantarkan mereka untuk membedakan antara yang benar dan yang salah. أَمْ هُمْ قَوْمٌ طَاغُونَ(ataukah mereka kaum yang melampaui batas?) Yakni melampaui batas dalam kedurhakaan mereka, sehingga mereka mengatakan hal-hal tersebut."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "32. Atau apakah akal mereka menyuruh mereka untuk mengucapkan kalimat yang saling bertentangan ini, yaitu anggapan bahwa Al-Qur’an adalah sihir, ilmu perdukunan, atau syair? Ataukah karena mereka sangat zalim dan sangat keras kepala serta sombong sehingga mereka mengucapkan hal itu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apakah mereka diperintah oleh pikiran-pikiran mereka} akal mereka {untuk ini} atau apakah mereka kaum yang melampaui batas} melampaui batas dalam kesombongan dan keras kepala"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "32. “Apakah mereka diperintah oleh pikiran-pikiran mereka untuk mengucapkan tuduhan-tuduhan ini ataukah mereka kaum yang melampaui batas?” artinya, apakah kedustaan serta perkataan-perkataan itu berasal dari akal dan khayalan yang membuahkan perkataan seperti itu, karena akal-akal mereka menyebut orang yang paling sempurna akalnya sebagai orang gila dan menjadikan perkataan yang paling jujur serta kebenaran puncak sebagai kedustaan dan kebatilan. Sungguh itu merupakan akal yang tidak terdapat pada orang gila, ataukah karena kezhaliman serta tindakan mereka yang melampaui batas yang membuat mereka menyatakan kekejian itu? Dan inilah nyatanya. Orang yang melampaui batas tidak lagi memiliki aturan, sehingga tidak perlu heran terhadap semua perkataan dan perbuatan yang dilakukan oleh orang yang melampaui batas."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tur ayat 32: 32-34. Allah mencela mereka orang-orang musyrik dengan berkata : Apakah benar mereka diperintahkan oleh akal-akal mereka (dimana mereka mengklaim keselamatan bagi mereka) dengan sebesar-besar kedustaan dan mengada-ngada ?!. Ataukah mereka adalah kaum yang melampaui batas yang membolehkan melanggar batasan-batasan yang ditetapkan Allah dengan kafir, berdusta dan mengada-ngada ?!. Ataukah mereka mengatakan : Sungguh Muhammad ﷺ telah mengada-ngada akan Al Qur’an ini dari dirinya sendir ?! Dan sebab dari kebohongan mereka ini : Mereka kufur dan menolak, dan meninggalkan untuk beriman kepada Allah, dan mereka mengikuti atas apa yang ada pada nenek moyang mereka. Maka jika mereka orang-orang musyrik jujur atas ucapan mereka : Bahwa Muhammad telah mengada-ngada pada Al Qur’an ini dari dirinya sendiri, maka wajib bagi mereka (dan mereka adalah orang-orang yang fasih bahasa arab) untuk mendatangkan dengan wujud serupa dengan Al Qur’an, ini adalah batas akhir (yang mereka tidak akan mungkin bisa berupaya) dan kelemahan bagi mereka, serta menampakkan akan kebathilan ucapan mereka yang mengada-ngada dan kebohongan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu ucapan bahwa Beliau sebagai pesihir, dukun, orang gila atau penyair. Jika demikian, sungguh buruk akal mereka yang menghasilkan kesimpulan yang buruk pula. Karena akal yang baik tidaklah menganggap orang yang sempurna akalnya sebagai orang gila, orang yang paling jujur sebagai pendusta dan orang yang paling amanah sebagai orang yang khianat. Atau mungkin yang membuat mereka berkesimpulan seperti itu adalah kezaliman dan sikap melampaui batas mereka. Sepertinya inilah keadaan mereka. Orang yang melampaui batas sudah lepas dari aturan, maka tidak aneh jika keluar ucapan dan perbuatan yang tidak beraturan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tur Ayat 32",
    "description": "Tuduhan-tuduhan orang-orang kafir itu tidak berdasar. Apakah mereka diperintah oleh pikiran-pikiran mereka yang sesat untuk mengucapkan tuduhan-tuduhan yang tidak berdasar ini ataukah mereka memang kaum yang melampaui batas kewajaran sehingga tidak segan melancarkan tuduhan negatif itu'33. Ataukah mereka juga menuduhnya menggubah Al-Qur'an, dengan berkata, 'dia telah mereka-rekanya dengan pikirannya sendiri dan mengklaimnya sebagai wahyu Allah. ' tidak! semua yang mereka katakan itu tidaklah benar! sesungguhnya merekalah yang tidak beriman kepada ajaran Allah."
  }
]