[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bahkan apakah orang-orang musyrik itu berkata, “Muhammad membuat-buat al-Quran dari dirinya sendiri.” Sebenarnya mereka tidak beriman, bila mereka beriman, niscaya mereka tidak berkata demikian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "33. Ataukah mereka berkata bahwa Muhammad telah membuat-buat Al-Qur`ān ini, bukan diwahyukan kepadanya? Dia tidak membuat-buatnya, justru mereka lah yang merasa sombong tidak mau beriman kepadanya sehingga mereka berkata bahwa dia membuat-buatnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "33. أَمْ يَقُولُونَ تَقَوَّلَهُۥ ۚ (Ataukah mereka mengatakan: “Dia (Muhammad) membuat-buatnya”) Yakni dia hanya mengada-ada al-Qur’an itu. بَل لَّا يُؤْمِنُونَ(Sebenarnya mereka tidak beriman) Yakni sebab keluarnya perkataan-perkataan mereka yang saling bertentangan adalah karena mereka tidak beriman kepada Allah dan tidak percaya kepada apa yang didatangkan Rasulullah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "33. Ataukan orang-orang musyrik itu berkata: “Muhammad merekayasa Al-Qur’an, termasuk juga pertemuan dan hubungannya dengan Allah”? Tidak, kenyataannya tidak seperti yang mereka katakana. Akan tetapi (faktanya) merekalah kaum yang tidak beriman kepada Allah dan Rasulallah. Mereka mengeluarkan fitnah-fitnah ini akibat dari kekufuran dan kekerasan hati mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Atau apakah mereka berkata,“Dia mereka-rekanya”} Dia membuat-buat Al-Qur’an dari dirinya sendiri {Tidak. Merekalah yang tidak beriman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "33. “Ataukah mereka mengatakan, ‘Dia (Muhammad) membuat-buatnya’,” artinya Nabi Muhammad yang membuat-buat al-Quran dan disampaikan dari dirinya sendiri? “Sebenarnya mereka tidak beriman,” andai saja mereka beriman, tentu tidak mengatakan seperti itu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tur ayat 33: 32-34. Allah mencela mereka orang-orang musyrik dengan berkata : Apakah benar mereka diperintahkan oleh akal-akal mereka (dimana mereka mengklaim keselamatan bagi mereka) dengan sebesar-besar kedustaan dan mengada-ngada ?!. Ataukah mereka adalah kaum yang melampaui batas yang membolehkan melanggar batasan-batasan yang ditetapkan Allah dengan kafir, berdusta dan mengada-ngada ?!. Ataukah mereka mengatakan : Sungguh Muhammad ﷺ telah mengada-ngada akan Al Qur’an ini dari dirinya sendir ?! Dan sebab dari kebohongan mereka ini : Mereka kufur dan menolak, dan meninggalkan untuk beriman kepada Allah, dan mereka mengikuti atas apa yang ada pada nenek moyang mereka. Maka jika mereka orang-orang musyrik jujur atas ucapan mereka : Bahwa Muhammad telah mengada-ngada pada Al Qur’an ini dari dirinya sendiri, maka wajib bagi mereka (dan mereka adalah orang-orang yang fasih bahasa arab) untuk mendatangkan dengan wujud serupa dengan Al Qur’an, ini adalah batas akhir (yang mereka tidak akan mungkin bisa berupaya) dan kelemahan bagi mereka, serta menampakkan akan kebathilan ucapan mereka yang mengada-ngada dan kebohongan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni menagada-ada Al Qur’an dan berasal dari dirinya sendiri. Karena kesombongan. Kalau mereka beriman, tentu mereka tidak akan mengucapkan kata-kata itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tur Ayat 33",
    "description": "Ataukah mereka juga menuduhnya menggubah Al-Qur'an, dengan berkata, 'dia telah mereka-rekanya dengan pikirannya sendiri dan mengklaimnya sebagai wahyu Allah. ' tidak! semua yang mereka katakan itu tidaklah benar! sesungguhnya merekalah yang tidak beriman kepada ajaran Allah. 34. Bila orang-orang kafir itu bersikukuh dengan tuduhannya tentang Al-Qur'an, maka cobalah mereka, baik secara sendiri maupun berkelompok, membuat karya yang semisal dengannya, jika mereka memang merupakan orang-orang yang benar dalam tuduhan dan penilaiannya."
  }
]