[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Silakan mereka mendatangkan perkataan yang semisal al-Quran, bila klaim mereka memang benar bahwa Muhammad yang membuat al-Quran."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "34. Maka hendaknya mereka mendatangkan satu kalimat yang semisal dengan Al-Qur`ān ini kalau memang dia membuat-buatnya, jika mereka adalah orang-orang yang benar dalam tuduhan mereka bahwa dia membuat-buatnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "34. فَلْيَأْتُوا۟ بِحَدِيثٍ مِّثْلِهِۦٓ (Maka hendaklah mereka mendatangkan kalimat yang semisal Al Quran itu) Yakni seperti al-Qur’an dalam kefasihan, keindahan caranya dalam menjelaskan kandungannya. إِن كَانُوا۟ صٰدِقِينَ(jika mereka orang-orang yang benar) Yakni benar dalam tuduhan mereka bahwa Muhammad hanya mengada-ada al-Qur’an. Mereka tidak dapat mendatangkan yang semisalnya, padahal al-Qur’an menggunakan bahasa Arab, dan mereka adalah pemimpin orang-orang Arab dalam kefasihan yang terbiasa memakai gaya bahasa Arab yang tinggi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "34. Maka sebaiknya datangkanlah Al-Quran yang serupa dalam susunan dan maknanya, jika tuduhan mereka itu benar bahwa Muhammad merekayasa Al-Quran, sekalipun di dalam golongan mereka itu ada golongan orang-orang fasih."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka hendaknya mereka mendatangkan sesuatu yang serupa dengannya jika mereka adalah orang-orang benar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "34. “Maka hendaklah mereka mendatangkan kalimat yang semisal al-Quran itu jika mereka orang-orang yang benar.” Artinya, jika Muhammad membuat-buat al-Quran maka kalian wahai bangsa Arab, para orang-orang fasih, cerdas serta ahli bahasa, ia menantang kalian supaya kalian membuat yang sepertinya supaya sanggahan kalian dapat dibenarkan, atau sebaliknya kalian mengakui kebenarannya. Andai pun kalian semua mengumpulkan seluruh manusia dan jin untuk membuat seperti al-Quran, tentu kalian tidak akan mampu. Pada saat itu kalian berada di antara dua hal: Beriman kepada al-Quran dan meniti petunjuknya atau membangkang serta mengikuti kebatilan yang kalian ketahui."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tur ayat 34: 32-34. Allah mencela mereka orang-orang musyrik dengan berkata : Apakah benar mereka diperintahkan oleh akal-akal mereka (dimana mereka mengklaim keselamatan bagi mereka) dengan sebesar-besar kedustaan dan mengada-ngada ?!. Ataukah mereka adalah kaum yang melampaui batas yang membolehkan melanggar batasan-batasan yang ditetapkan Allah dengan kafir, berdusta dan mengada-ngada ?!. Ataukah mereka mengatakan : Sungguh Muhammad ﷺ telah mengada-ngada akan Al Qur’an ini dari dirinya sendir ?! Dan sebab dari kebohongan mereka ini : Mereka kufur dan menolak, dan meninggalkan untuk beriman kepada Allah, dan mereka mengikuti atas apa yang ada pada nenek moyang mereka. Maka jika mereka orang-orang musyrik jujur atas ucapan mereka : Bahwa Muhammad telah mengada-ngada pada Al Qur’an ini dari dirinya sendiri, maka wajib bagi mereka (dan mereka adalah orang-orang yang fasih bahasa arab) untuk mendatangkan dengan wujud serupa dengan Al Qur’an, ini adalah batas akhir (yang mereka tidak akan mungkin bisa berupaya) dan kelemahan bagi mereka, serta menampakkan akan kebathilan ucapan mereka yang mengada-ngada dan kebohongan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Bahwa Nabi Muhammad shallallahu 'alaihi wa sallam mengada-ada, karena kamu adalah orang-orang yang faseh dan ahli sastra. Dia (Nabi Muhammad shallallahu 'alaihi wa sallam) telah menantang kamu untuk mendatangkan yang semisal dengan Al Qur’an, sekarang kamu tinggal membenarkan pertentangan kamu atau mengakui kebenarannya, padahal jika kamu berkumpul bersama jin dan manusia yang lain untuk membuat yang semisalnya, tentu kamu tidak akan sanggup. Oleh karena itu, kamu berada antara dua keadaan; beriman dan mengambilnya sebagai petunjuk atau menentangnya dengan mengikuti kebatilan yang kamu pegang."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tur Ayat 34",
    "description": "Bila orang-orang kafir itu bersikukuh dengan tuduhannya tentang Al-Qur'an, maka cobalah mereka, baik secara sendiri maupun berkelompok, membuat karya yang semisal dengannya, jika mereka memang merupakan orang-orang yang benar dalam tuduhan dan penilaiannya. 35. Usai memberi bantahan atas tuduhan orang-orang musyrik, Allah lalu memberi bantahan atas keyakinan mereka. Allah berfirman, 'atau apakah mereka tercipta tanpa asal-usul yang jelas, ataukah mereka yang menciptakan diri mereka sendiri sehingga tidak mau mengakui Allah sebagai pencipta'."
  }
]