[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah orang-orang musyrik itu diciptakan tanpa pencipta ataukah mereka sendiri yang menciptakan diri mereka? Keduanya adalah batil dan mustahil. Dengan ini jelaslah dengan pasti bahwa hanya Allah semata Yang Mencipta mereka, hanya Dia semata yang berhak untuk disembah, dan ibadah tidak layak kecuali untukNYa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "35. Apakah mereka diciptakan tanpa ada pencipta yang menciptakannya? Ataukah mereka adalah pencipta bagi diri mereka sendiri? Tidak mungkin ada makhluk tanpa ada penciptanya, dan tidak mungkin ada makhluk yang menciptakan dirinya. Maka kenapa mereka tidak menyembah yang menciptakan mereka?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "35-36. Apakah mereka tercipta tanpa ada Tuhan atau Penciptanya? Atau mereka menciptakan diri mereka sendiri? Atau juga mereka yang menciptakan tujuh langit dan bumi? Sungguh tidak demikian, namun mereka benar-benar tidak beriman."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "35. أَمْ خُلِقُوا۟ مِنْ غَيْرِ شَىْءٍ (Apakah mereka diciptakan tanpa sesuatupun) Yakni apakah mereka diciptakan dengan penciptaan yang begitu menakjubkan tanpa ada Sang Pencipta? أَمْ هُمُ الْخٰلِقُونَ(ataukah mereka yang menciptakan (diri mereka sendiri)?) Yakni apakah mereka mengatakan bahwa merekalah yang menciptakan diri mereka sendiri? Jika mereka mengakui bahwa mereka tidak diciptakan tanpa Sang Pencipta dan mengakui bahwa mereka tidak menciptakan diri mereka sendiri, maka mereka harus mengakui bahwa mereka diciptakan oleh Sang Pencipta, yaitu Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "35. Ataukah mereka diciptakan oleh Sang Maha Penciipta lagi Maha Terdahulu, sehingga mereka tidak menyembahNya? Ataukah sesungguhnya mereka menciptakan diri mereka sendiri?!"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah mereka tercipta tanpa asal-usul ataukah mereka yang menciptakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "35. “Apakah mereka diciptakan tanpa sesuatupun ataukah mereka yang menciptakan (diri mereka sendiri).” Ini adalah dalil yang melawan mereka dengan sesuatu yang tidak memungkinkan bagi mereka kecuali menerima kebenaran atau (sebaliknya) melenceng dari tuntutan akal sehat dan Agama. Jelasnya, mereka mengingkari keesaan Allah, mendustakan RasulNya sehingga membuat mereka mengingkari bahwa Allah telah menciptakan mereka, padahal telah tertanam dalam akal dan dikuatkan oleh syariat bahwa hal itu tidak terlepas dari tiga hal : Karena mereka “diciptakan tanpa sesuatu pun,” artinya, tidak ada pencipta yang menciptakan mereka tapi mereka ada begitu saja tanpa ada yang mengadakannya, dan ini inti dari kemustahilan, “ataukah mereka yang menciptakan (diri mereka sendiri),” ini juga mustahil, sebab tidak bisa dibayangkan bagaimana seseorang menciptakan dirinya sendiri. Karena dua kemungkinan tersebut tidak benar dan jelas-jelas mustahil, maka yang tersisa adalah kemungkinan ketiga yaitu Allah lah yang menciptakan mereka. Karena hal ini telah diketahui, di mana tidak selayaknya ibadah diberikan kecuali hanya kepadaNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tur ayat 35: Kemudian Allah berpindah dengan mencela dengan celaan lain, Allah berkata : Apakah mereka orang-orang musyrik keluar untuk hidup dengan keindahan dan kesempurnaan yang tiba-tiba tanpa permulaan dari bentuk mereka yang kemudian mereka menjadi sebaik-baik rupa, sebagaimana penganut kepercayaan Dahriyyun (meyakini alam ada tanpa pencipta) dan Thabi’iyyun ? Ataukah mereka diciptakan oleh diri-diri mereka sendiri dengan bentuk sempurna dan sesempurna-sempurnanya bentuk ?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya, tanpa pencipta. Hal ini tidaklah mungkin. Sudah pasti adanya makhluk, maka ada yang menciptakan, yaitu Allah Subhaanahu wa Ta'aala. Maka mengapa mereka tidak mentauhidkan-Nya dan beriman kepada Rasul-Nya dan kitab-Nya. Ini adalah berdalih dengan sesuatu yang tidak memberikan kesempatan kepada mereka selain tunduk kepada kebenaran atau jika tidak ia keluar dari sesuatu yang sejalan dengan akal dan fitrahnya. Lebih jelasnya adalah sebagai berikut: Mereka mengingkari keesaan Allah dan mendustakan Rasul-Nya, dan hal ini sama saja mereka mengingkari bahwa Allah yang telah menciptakan mereka. Karena sudah maklum menurut akal bersama syara’, bahwa dalam hal ini tidak lepas dari tiga perkara: - Bisa bahwa mereka diciptakan tanpa sesuatu, yakni tidak ada yang menciptakan mereka, bahkan mereka ada tanpa ada yang mewujudkannya, dan hal ini jelas mustahil. - Bisa bahwa mereka yang menciptakan diri mereka. Hal ini juga sama termasuk mustahil, karena tidak dapat dibayangkan bahwa mereka yang mengadakan diri mereka sendiri. Jika kedua hal ini ditolak oleh akal dan dianggap mustahil, maka tinggallah perkara yang ketiga, yaitu: - Bahwa Allah yang telah menciptakan mereka. Jika demikian, maka dapat diketahui bahwa Allah Subhaanahu wa Ta'aala Dialah yang berhak disembah, dimana tidak pantas ditujukan ibadah selain kepada-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tur Ayat 35",
    "description": "Usai memberi bantahan atas tuduhan orang-orang musyrik, Allah lalu memberi bantahan atas keyakinan mereka. Allah berfirman, 'atau apakah mereka tercipta tanpa asal-usul yang jelas, ataukah mereka yang menciptakan diri mereka sendiri sehingga tidak mau mengakui Allah sebagai pencipta'36. Ataukah mereka enggan beriman karena merasa telah menciptakan langit dan bumi yang demikian indah dan rapi' sebenarnya mereka sendiri tidak meyakini apa yang mereka katakan, karena mereka memang tidak mengetahuinya."
  }
]