[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Atau apakah mereka menciptakan langit dan bumi dengan penciptaan yang indah ini? Sebaliknya mereka tidak percaya kepada azab Allah, maka mereka adalah orang-orang musyrik."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "36. Ataukah mereka yang menciptakan langit dan bumi? Justru mereka yang tidak yakin bahwa Allah lah yang menciptakan mereka, sebab jikalau mereka meyakini hal tersebut, tentulah mereka akan mengesakan-Nya dan beriman kepada Rasul-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "36. بَل لَّا يُوقِنُونَ (sebenarnya mereka tidak meyakini (apa yang mereka katakan)) Yakni mereka tidak merasa yakin, namun mereka tenggelam dalam gelapnya keraguan tentang janji dan ancaman Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "36. Ataukan mereka yang telah menciptakan langit dan bumi, sedangkan mereka tidak mampu melakukannya? Lalu kenapa mereka tidak mau menyembah Sang Maha Pencipta? Tapi bukan itu, Sesungguhnya mereka tidak benar-benar beriman kepada Allah. (Jika) mereka beriman kepadaNya dan nabiNya, mereka (pasti) mencurahkan dirinya untuk beribadah kepada Tuhan mereka (Allah)."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ataukah mereka menciptakan langit dan bumi. Sebenarnya mereka tidak meyakini"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "36. Allah berfirman, “Ataukah mereka telah menciptakan langit dan bumi,” pertanyaan ini berfungsi untuk menegaskan penafian, artinya, mereka tidak menciptakan langit dan bumi sehingga tidak patut menjadi sekutu Allah. Hal ini dapat diketahui secara jelas, “tapi,” orang-orang yang mendustakan “sebenarnya mereka tidak meyakini (apa yang mereka katakan),” artinya mereka tidak memiliki ilmu yang sempurna dan tidak pula keyakinan yang bisa menuntun mereka memanfaatkan dalil-dalil syariat dan akal."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tur ayat 36: Kemudian Allah berpindah dengan mencela dengan celaan lain, Allah berkata : Apakah mereka yang menciptakan langit dan bumi ? Karena tidak mungkin bagi akal berkata : Keduanya adalah ciptaanku, akan tetapi mereka bukanlah orang-orang yang yakin dengan adanya Tuhan bagi mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Padahal tidak ada yang sanggup menciptakan keduanya kecuali Allah Subhaanahu wa Ta'aala. Oleh kiarena itu, mengapa mereka tidak menyembah-Nya? Pertanyaan ini untuk menguatkan penafian, yakni mereka bukanlah yang menciptakan langit dan bumi, dan demikianlah kenyataannya. Maksudnya, mereka tidak memiliki ilmu yang sempurna dan keyakinan yang mengharuskan mereka mengambil manfaat dan pelajaran dari dalil-dalil syar’i dan ‘aqli (akal)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tur Ayat 36",
    "description": "Ataukah mereka enggan beriman karena merasa telah menciptakan langit dan bumi yang demikian indah dan rapi' sebenarnya mereka sendiri tidak meyakini apa yang mereka katakan, karena mereka memang tidak mengetahuinya. 37. Ataukah mereka ingkar karena merasa bahwa di sisi mereka ada per-bendaharaan tuhanmu, wahai nabi Muhammad, ataukah mereka yang berkuasa mengatur dan menggunakan perbendaharan Allah dengan semaunya sehingga mereka menolak risalahmu dan menuduhmu dengan ungkapan yang merendahkan'."
  }
]