[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Atau apakah mereka memiliki perbendaharaan Tuhanmu sehingga mereka bisa bertindak terhadapnya atau mereka adalah orang-orang berkuasa, yang menguasai makhluk Allah dengan menundukkan dan mengalahkan mereka? Perkaranya tidak demikian, sebaliknya mereka adalah orang-orang lemah yang tidak mampu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "37. Ataukah di sisi mereka terdapat perbendaharaan rezeki Rabbmu sehingga mereka memberikannya kepada orang yang mereka kehendaki? Atau perbendaharaan kenabian sehingga mereka memberikannya atau menahannya terhadap orang yang mereka inginkan? Ataukah mereka berkuasa, mampu berbuat sesuai dengan kemauan mereka?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "37. Apakah mereka memiliki seluruh harta Tuhanmu yang menjadi rezeki para hamba? Atau mereka adalah tuhan-tuhan yang mengatur seluruh makhluk?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "37. أَمْ عِندَهُمْ خَزَآئِنُ رَبِّكَ (Ataukah di sisi mereka ada perbendaharaan Tuhanmu) Yakni apakah kunci-kunci risalah Tuhanmu berada di tangan mereka, sehingga mereka dapat memberikannya kepada yang mereka inginkan? Pendapat lain mengatakan, yakni kunci-kunci hujan dan rezeki. أَمْ هُمُ الْمُصَۣيْطِرُونَ(atau merekakah yang berkuasa?) Yakni berkuasa atas makhluk-makhluk Allah di langit dan bumi, sehingga mereka dapat mengatur semuanya sesuai kemauan mereka?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "37. Ataukah di sisi mereka ada gudang-gudang rejeki Allah sehingga dapatt memberikan rejeki berupa nubuwah dan syuruwwah serta bentuk rejeki lainnya, lalu mereka dapat memberikannya kepada orang yang mereka kehendaki? Ataukah mereka adalah orang-orang yang berkuasa atas segala sesuatu yang mampu mengatur segalanya sesuai kehendak mereka?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ataukah di sisi mereka ada perbendaharaan Tuhanmu ataukah mereka yang berkuasa} yang berkuasa dan mengatus sesuai keinginan mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "37. “Ataukah di sisi mereka ada perbendaharaan Rabbmu atau merekalah yang berkuasa?” artinya, apakah mereka yang mendustakan itu memiliki perbendaharaan rahmat Rabbmu sehingga mereka bisa memberi siapa saja yang mereka kehendaki dan tidak memberi pada siapa saja yang mereka kehendaki? Karena itulah mereka menahan Allah agar tidak memberikan kenabian pada hamba dan RasulNya, Muhammad, seolah-olah mereka adalah para wakil yang diserahi perbendaharaan rahmat Allah, padahal sebenarnya mereka jauh lebih rendah dan hina dari hal itu, mereka sendiri tidak bisa membawa manfaat maupun bahaya pada dirinya sendiri, tidak memiliki kekuatan untuk menghidupkan dan tidak juga mematikan, apa lagi membangkitkan manusia, “Apakah mereka yang membagi-bagi rahmat Tuhanmu? Kami telah menentukan antara mereka penghidupan mereka dalam kehidupan dunia” -Az-Zukhruf:32. “Atau merekalah yang berkuasa?” artinya, menguasai makhluk Allah serta memilikinya dengan paksaan dan penaklukan? Tidak seperti itu, justru mereka adalah orang-orang lemah dan memerlukan bantuan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tur ayat 37: Kemudian Allah tetap mengulangi celaan-Nya kepada mereka : Apakah di sisi mereka orang-orang musyrik memiliki kunci-kunci dari perbendaharaan Rabbnya dari kenabian dan rizki; Sehingga mereka dapat memberikan sebagaimana yang mereka kehendakai dan menahannya ?! Ataukah mereka adalah orang-orang yang kuasa atas ciptaan Allah dan kerajaan-Nya dengan menguasai dan menaklukan semua itu?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya, apakah pada sisi mereka perbendaharaan rahmat Tuhanmu (seperti kenabian, rezeki dan lainnya), sehingga mereka memberikan dan menghalangi perbendahraan itu sesuai yang kehendak mereka, sehingga mereka bisa menghalangi Allah untuk memberikan kenabian kepada hamba dan Rasul-Nya Muhammad shallallahu 'alaihi wa sallam, dimana mereka seakan-akan sebagai wakil yang diserahi terhadap perbendahraan rahmat Allah, padahal mereka lebih hina dan rendah dari itu; mereka tidak berkuasa memberi manfaat, menimpakan madharrat, mematikan, menghidupkan dan membangkitkan. Dalam ayat lain Allah Subhaanahu wa Ta'aala berfirman, “Apakah mereka yang membagi-bagi rahmat Tuhanmu? Kami telah menentukan antara mereka penghidupan mereka dalam kehidupan dunia, dan Kami telah meninggikan sebagian mereka atas sebagian yang lain beberapa derajat, agar sebagian mereka dapat mempergunakan sebagian yang lain. Dan rahmat Tuhanmu lebih baik dari apa yang mereka kumpulkan.” (Terj. Az Zukhruf: 32) Yakni berkuasa terhadap makhluk Allah dan milik-Nya dengan menguasai dan mengalahkan? Bahkan mereka adalah orang-orang yang lemah dan fakir."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tur Ayat 37",
    "description": "Ataukah mereka ingkar karena merasa bahwa di sisi mereka ada per-bendaharaan tuhanmu, wahai nabi Muhammad, ataukah mereka yang berkuasa mengatur dan menggunakan perbendaharan Allah dengan semaunya sehingga mereka menolak risalahmu dan menuduhmu dengan ungkapan yang merendahkan'38. Atau apakah mereka, yaitu orang-orang musyrik, mempunyai tangga menuju langit untuk mendengarkan hal-hal gaib' bila demikian maka hendaklah orang yang mendengarkan berita gaib di antara mereka itu datang dengan membawa keterangan yang nyata yang didengarnya. Pasti tidak akan ada yang tampil untuk mengungkapkannya."
  }
]