[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Atau apakah mereka punya tangga ke langit yang dengannya mereka bisa mendengar wahyu langit bahwa apa yang mereka pegang merupakan kebenaran? Hendaknya mereka mendatangkan bukti yang nyata atas kebenaran apa yang mereka klaim."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "38. Ataukah mereka mempunyai tangga yang mereka gunakan naik ke langit untuk mendengarkan wahyu Allah yang mewahyukan bahwa mereka berada dalam kebenaran? Maka hendaklah orang yang mendengarkan wahyu dari kalangan mereka itu mendatangkan hujah yang jelas yang membenarkan mereka atas pengakuan mereka bahwa mereka berada dalam kebenaran?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "38. Apakah mereka memiliki tangga menuju langit sehingga mereka dapat mendengar perkataan para malaikat dan mendengar wahyu yang disampaikan, sehingga mereka dapat mengetahui bahwa mereka di atas kebenaran? Hendaklah orang yang mengakui hal itu mendatangkan hujjah yang jelas atas kebenaran pengakuannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "38. أَمْ لَهُمْ سُلَّمٌ يَسْتَمِعُونَ فِيهِ ۖ (Ataukah mereka mempunyai tangga (ke langit) untuk mendengarkan pada tangga itu (hal-hal yang gaib)?) Yakni apakah mereka mengatakan bahwa mereka memiliki tangga yang menuju ke langit yang dapat mereka naiki, sehingga mereka dapat mendengarkan perkataan malaikat dan apa yang diilhamkan kepada mereka, dan mereka dapat mengetahui ilmu ghaib sebagaimana yang diketahui oleh Nabi Muhammad lewat wahyu yang diturunkan kepadanya? فَلْيَأْتِ مُسْتَمِعُهُم(Maka hendaklah orang yang mendengarkan di antara mereka mendatangkan) Jika mereka mengatakan hal itu. بِسُلْطٰنٍ مُّبِينٍ(suatu keterangan yang nyata) Yakni dengan hujjah yang jelas dan terang."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "38. Ataukah mereka memiliki tangga menuju langit sehingga mereka mampu menaikinya dan mendengar ucapan-ucapan malaikat dan apa yang diwahyukan kepada mereka? (Jika benar) maka datangkanlah pendengar mereka dan sampaikanlah anggapan itu dengan hujjah yang jelas dan nyata."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ataukah di sisi mereka ada perbendaharaan Tuhanmu ataukah mereka yang berkuasa} yang berkuasa dan mengatus sesuai keinginan mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "38. “Ataukah mereka mempunyai tangga (ke langit) untuk mendengarkan pada tangga itu,” artinya, apakah mereka bisa mengetahui hal-hal ghaib serta mendengarkannya di antara malaikat yang tinggi sehingga mereka bisa memberitahukan berita yang tidak diketahui oleh yang lain? “Maka hendaklah orang yang mendengarkan di antara mereka mendatangkan,” yang mengaku hal itu “suatu keterangan yang nyata,” dari mana mereka mendapatkan semua itu, padahal Allah sematalah yang mengetahui hal ghaib dan hal nyata, dan tidak menampakkan keghaiban pada siapa pun kecuali orang yang diridhai dari kalangan para rasul di mana Allah memberitahukan berdasarkan kehendak dan ilmuNYa, karena Nabi Muhammad adalah rasul yang terbaik, yang paling tahu dan imam para rasul. Beliaulah yang memberitahukan kabar yang diberitakan kepada beliau, tentang mengesakan Allah, menyampaikan kabar gembira serta ancamanNya dan juga berita-berita benar lainnya. Sedangkan orang-orang yang mendustakan adalah mereka yang bodoh, sesat, dan membangkang. Siapa lagi yang beritanya lebih patut diterima? Lebih-lebih Rasulullah menegakkan berbagai dalil dan bukti nyata atas kebenaran yang beliau sampaikan. Berita yang disampaikan beliau adalah inti dari keyakinan serta kebenaran yang paling sempurna. Adapun orang-orang yang mendustakan itu sama sekali tidak menyebutkan suatu keserupaan pun, lebih-lebih menegakkan hujjah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tur ayat 38: Kemudian Allah mencela mereka dengan mengatakan : Apakah mereka memiliki tangga untuk membantu mereka naik ke langit dan mendengar ucapan para malaikat dan menampakkan pada mereka hal-hal yang ghaib ?! Maka silahkan mendatangkan apa yang mereka dengar dari sesuatu di langit dengan bukti yang nyata yang mereka saksikan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Di antara penghuni langit. Bagaimana mereka bisa membawakannya, padahal Allah-lah yang mengetahui yang gaib maupun yang tampak, Dia tidak memberitahukan perkara gaibnya itu kepada seorang pun selain kepada rasul yang diridhai-Nya. Jika Muhammad shallallahu 'alaihi wa sallam sebagai Rasul yang paling utama, paling berilmu dan sebagai pemimpin mereka; dia memberitahukan apa yang diberitakan Allah seperti tentang keesaan Allah, janji-Nya, ancaman-Nya dan lain sebagainya yang termasuk berita-berita gaib, sedangkan orang-orang yang mendustakan adalah tidak seperti itu (mereka tidak berilmu, tersesat lagi membangkang), maka berita manakah yang lebih berhak diikuti? Terlebih, Rasulullah shallallahu 'alaihi wa sallam telah menegakkan dalil-dalil dan bukti yang menguatkan berita Beliau dimana dalil dan bukti itu menjadikan berita itu sebagai berita yang yakin, benar, sedangkan mereka tidak membawakan bukti, bahkan yang syubhat saja tidak bisa mereka datangkan?"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tur Ayat 38",
    "description": "Atau apakah mereka, yaitu orang-orang musyrik, mempunyai tangga menuju langit untuk mendengarkan hal-hal gaib' bila demikian maka hendaklah orang yang mendengarkan berita gaib di antara mereka itu datang dengan membawa keterangan yang nyata yang didengarnya. Pasti tidak akan ada yang tampil untuk mengungkapkannya. 39. Allah mengecam kaum musyrik yang meyakini dia punya anak perempuan, yaitu para malaikat, 'ataukah pantas bila kalian mengatakan bahwa untuk dia yang maha esa itu anak-anak perempuan seperti yang kamu yakini, sedangkan untuk kamu anak-anak laki-laki' sungguh, itu semua merupakan anggapan yang sangat keji dan keliru. '."
  }
]