[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah anak perempuan untuk Allah sedangkan anak lelaki untuk kalian sebagaimana yang kalian ucapkan secara dusta dan bohong?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "39. Apakah untuk Allah -Subḥānahu- anak-anak perempuan yang kalian benci dan bagi kalian anak-anak lelaki yang kalian senangi?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "39. Apakah bagi Allah anak-anak perempuan, sedangkan bagi kalian anak-anak laki-laki sebagaimana yang kalian akui?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "39. أَمْ لَهُ الْبَنٰتُ وَلَكُمُ الْبَنُونَ (Ataukah untuk Allah anak-anak perempuan dan untuk kamu anak-anak laki-laki?) Yakni apakah kalian menjadikan bagi Allah anak-anak perempuan, sedangkan bagi kalian anak-anak lelaki? Jika itu yang menjadi pemikiran mereka maka mereka memang memiliki pemahaman yang lemah, sehingga tidak mustahil mereka kemudian mengingkari hari kebangkitan dan keesaan Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "39. Ataukah menurut kalian Allah memiliki anak perempuan dan kalian memiliki anak laki-laki?. Itu adalah tuduhan yang tidak wajar?!"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apakah (pantas) bagiNya anak-anak perempuan, sedangkan untuk kalian anak-anak laki-laki"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "39. Allah berfirman, “Ataukah untuk Allah anak-anak perempuan,” sebagaimana yang kalian tuduhkan, “dan untuk kamu anak-anak laki-laki?” sehingga kalian menerjang dua larangan; kalian menyatakan bahwa Allah memiliki anak dan pilihan yang kalian berikan pada Allah merupakan pilihan terjelek dari dua alternatif, lantas apakah ada ujungnya setelah celaan terhadap Rabb semesta alam ini, ataukah di bawah celaan tersebut ada batasannya?"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tur ayat 39: Kemudian Allah mencela mereka dengan mengatakan : Ataukah Allah memiliki anak perempuan? Sebagaimana klaim mereka yang mengada-ngada dengan kebohongan dan ataukah Allah memiliki anak laki-laki? Dan ini adalah pensucian Allah dari tuduhan tersebut yang mereka menggigau, dan sesat akal-akal mereka. Maka Allah cela mereka, karena mereka telah bersumpah dengan cara menghina Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Seperti yang kamu sangka wahai orang-orang musyrik. Kamu sama saja telah mengerjakan dua larangan; kamu jadikan untuk-Nya anak dan kamu pilih di antara anak itu yang paling buruknya? Bukankah ini merupakan pencacatan terhadap Allah Subhaanahu wa Ta'aala."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tur Ayat 39",
    "description": "Allah mengecam kaum musyrik yang meyakini dia punya anak perempuan, yaitu para malaikat, 'ataukah pantas bila kalian mengatakan bahwa untuk dia yang maha esa itu anak-anak perempuan seperti yang kamu yakini, sedangkan untuk kamu anak-anak laki-laki' sungguh, itu semua merupakan anggapan yang sangat keji dan keliru. '40. Allah lalu mengajak bicara nabi Muhammad, 'ataukah keengganan kaum musyrik untuk beriman adalah karena engkau meminta imbalan kepada mereka saat menyampaikan dakwah sehingga mereka dibebani de-ngan utang' tentu tidak. Engkau tidak pernah meminta upah pada mereka atas dakwahmu. '."
  }
]