[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-6. Allah bersumpah dengan Thur, yaitu gunung dimana Allah berbicara kepada Musa, juga dengan kitab yang tertulis, yaitu al-Quran dalam shuhuf-shuhuf yang terbuka, juga dengan Baitul Ma’mur di langit yang ramai oleh para malaikat yang selalu menghadirinya, juga dengan atap yang terangkat, yaitu langit terdekat, dan dengan lautan yang bergejolak yang penuh dengan air,"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Dan bersumpah dengan rumah yang diramaikan oleh para malaikat di langit dalam beribadah kepada Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. وَالْبَيْتِ الْمَعْمُورِ (dan demi Baitul Ma’mur) Yang ada di langit ke tujuh yang dipakai para malaikat untuk menyembah Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Dan demi Ka’bah yang dimakmurkan oleh orang-orang haji, para peziarah dan hamba-hamba untuk beribadah kepada Allah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{demi Baitul makmur (4)} Aku bersumpah demi rumah di langit yang berhadapan langsung dengan Ka’bah yang dimakmurkan oleh para malaikat dengan beribadah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4. “Dan demi al-Bait al-Ma’mur,” yaitu rumah yang berada di atas langit ketujuh yang dimakmurkan sepanjang waktu oleh para malaikat yang mulia, yang setiap harinya dimasuki sejumlah tujuh puluh ribu malaikat, di tempat itu mereka menyembah Rabb mereka kemudian tidak keluar lagi hingga Hari Kiamat. Ada yang mengatakan bahwa al-Bait al-Ma’mur adalah rumah Allah yang dimakmurkan oleh para malaikat yang berthawaf, shalat dan berdzikir di setiap waktu, mereka mendatangi rumah itu untuk berhaji dan berumrah, sebagaimana halnya sumpah Allah yang terdapat dalam FirmanNya, “dan demi kota (Mekah) ini yang aman,” -At-Tin:4 Rumah Allah yang ada di bumi adalah rumah terbaik. Di situlah para manusia datang berhaji dan berumrah yang merupakan salah satu rukun dan bangunan Islam yang terbesar. Tanpa haji, Islam seseorang belum sempurna, itulah rumah yang dibangun oleh Ibrahim dan dijadikan sebagai tempat berlindung dan keamanan bagi manusia. Allah bersumpah atas rumah itu serta menjelaskan keagungannya yang layak untuk dimuliakan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tur ayat 4: Allah bersumpah dengan Baitul Ma’mur yang para malaikat tinggal (di sana) dan berthawaf padanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Baitul Ma'mur ialah ka'bah karena ka'bah selalu mendapat kunjungan haji, 'umrah, tawaf dan lain-lain atau sebuah rumah di langit yang ketujuh yang setiap hari dimasuki oleh 70.000 malaikat; setelah mereka keluar, maka mereka tidak kembali lagi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tur Ayat 4",
    "description": "1-6. Surah a'-''riy't ditutup dengan penegasan jatuhnya ancaman Allah bagi mereka yang kafir. Surah at-t'r diawali dengan kepastian jatuhnya azab bagi mereka yang mengingkari ayat-ayat Allah. Penegasan tentang kepastian azab ini diawali dengan sumpah-sumpah Allah. Demi gunung sinai yang menjadi lokasi nabi musa menerima taurat, dan demi kitab Allah yang diwahyukan-Nya dan yang ditulis pada lembaran yang terbuka sehingga mudah dibaca dan dipahami maknanya, dan demi baitulma'mur, yaitu kakbah atau tempat yang menjadi lokasi para malaikat rukuk, sujud, dan tawaf, dan demi atap, yaitu langit, yang ditinggikan dan kukuh tanpa tiang penyangga, dan demi lautan yang penuh gelombang yang di dalam tanahnya terdapat api"
  }
]