[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Atau apakah kamu (wahai Rasul) meminta upah kepada orang-orang musyrik atas penyampaian risalah sehingga hal itu memberatkan dan menyusahkan mereka karena mereka harus memikul pembayaran yang kamu minta dari mereka?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "40. Ataukah engkau -wahai Rasul- meminta dari mereka upah terkait tugasmu untuk menyampaikan sesuatu kepada mereka dari Rabbmu? Dan karena hal itu mereka terbebani oleh beban yang tidak mampu mereka pikul."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "40. Hai Rasulullah, apakah kamu meminta upah dari mereka atas risalah yang kamu sampaikan, sehingga akibat beban itu mereka menjadi terpaksa?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "40. أَمْ تَسْـَٔلُهُمْ أَجْرًا(Ataukah kamu meminta upah kepada mereka) Yakni yang mereka bayarkan kepadamu sebagai upah penyampaian risalah. فَهُم مِّن مَّغْرَمٍ مُّثْقَلُونَ (sehingga mereka dibebani dengan hutang?) Yakni sehingga mereka menjadi berhutang kepadamu, dan tidak mampu menanggung hutang itu, sehingga mereka tidak mampu masuk agama Islam."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "40. Ataukah kamu meminta upah dari mereka sebagai ganti penyampaian risalah?! Niscaya mereka memikul sesuatu yang memberatkan mereka, yaitu berupa sesuatu yang merusak dan membebani (bagi mereka) sehingga hal itu akan membuat mereka kesulitan untuk mengerjakannya dan tidak mau menerima islam akibat hal itu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah kamu meminta imbalan kepada mereka sehingga mereka dibebani} dibebani dengan beban yang tidak sanggup mereka tanggung {dengan utang} hutang yang diminta dari mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "40. “Ataukah kamu meminta upah kepada mereka” wahai rasul atas penyampaian risalah, “sehingga mereka dibebani dengan hutang?” tidak demikian halnya, tapi engkau benar-benar getol mengajar mereka secara suka rela tanpa menginginkan imbalan apa pun, justru engkau banyak mengorbankan harta benda untuk mereka, agar mereka bisa menerima risalahmu dan menanggapi perintah serta seruanmu, engkau justru memberi harta pada orang yang hatinya memiliki kecenderungan pada Islam, agar ilmu dan iman menancap di hati mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tur ayat 40: Kemudian Allah mencela mereka dengan mengatakan : Apakah engkau meminta kepada mereka wahai Nabi Allah atas upah untuk menyampaikan kerisalahan Tuhanmu kepada mereka ?! Sehingga menjadikan mereka atas upah ini beban yang berat dan melelahkan ?!"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Karena menyampaikan risalah. Bahkan tidak demikian. Nabi Muhammad shallallahu 'alaihi wa sallam adalah orang yang sangat memperhatikan mereka, Beliau membimbing mereka secara suka rela tanpa mengharapkan imbalan, bahkan Beliau memberikan kepada mereka harta yang banyak agar mereka menerima risalahnya, memenuhi seruannya dan dakwahnya agar mereka yang lunak hatinya dapat mengambil ilmu darinya dan beriman."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tur Ayat 40",
    "description": "Allah lalu mengajak bicara nabi Muhammad, 'ataukah keengganan kaum musyrik untuk beriman adalah karena engkau meminta imbalan kepada mereka saat menyampaikan dakwah sehingga mereka dibebani de-ngan utang' tentu tidak. Engkau tidak pernah meminta upah pada mereka atas dakwahmu. '41. Ataukah mereka menolak beriman karena di sisi mereka mempunyai pengetahuan tentang yang gaib, lalu dengan pengetahuan itu mereka ingin menguasai segala hal dan menuliskannya untuk yang lain'."
  }
]