[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Atau apakah mereka punya ilmu ghaib lalu mereka menulisnya untuk manusia dan mengabarkannya kepada mereka? Tidak demikian, karena tidak ada yang mengetahui hal ghaib di langit dan di bumi kecuali Allah semata."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "41. Ataukah mereka punya ilmu gaib lalu mereka menuliskannya untuk manusia apa yang muncul kepada mereka dari hal-hal yang gaib lalu mereka mengabarkan darinya apa yang mereka kehendaki?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "41. Apakah mereka memiliki ilmu tentang hal ghaib sehingga mereka dapat mengetahui apa yang tidak diketahui Rasulullah, sehingga mereka mendustakannya, dan mereka menulis hal itu dan menyebarkannya kepada orang-orang?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "41. أَمْ عِندَهُمُ الْغَيْبُ فَهُمْ يَكْتُبُونَ (Apakah ada pada sisi mereka pengetahuan tentang yang gaib lalu mereka menuliskannya?) Yakni apakah mereka mengaku mengetahui ilmu ghaib, yaitu kejadian yang tercantum dalam kitab lauhul mahfuhz, sehingga mereka dapat menuliskan bagi orang lain ketantuan sesuai kehendak mereka?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "41. Ataukah mereka memiliki pengetahuan tentang sesuatu yang ghaib, lalu mereka menulis tentang itu dan menentukan hukum-hukumnya?!"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apakah mereka mempunyai (pengetahuan) tentang yang ghaib, lalu mereka menuliskannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "41. “Apakah ada pada sisi mereka pengetahuan tentang yang ghaib lalu mereka menuliskannya?” apakah mereka mengetahui hal itu dari alam ghaib sehingga mereka bisa melihat seseuatu yang tidak diketahui Rasulullah? Sehingga mereka menentang dan membangkang risalah yang dibawanya dari alam ghaib. Telah sama-sama diketahui bahwa mereka adalah kaum yang tidak bisa membaca dan menulis, serta bodoh dan tersesat, sedangkan Rasulullah lah yang memiliki ilmu yang jauh lebih luas dari yang lainnya. Allah memberitahukan berita yang berasal dari alam ghaib yang tidak diketahui oleh satu makhluk pun. Semua penjelasan tersebut melalui penalaran akal serta dalil naqli menunjukkan rusaknya perkataan dan gambaran mereka yang diketahui melalui cara yang paling jelas dan bebas dari sanggahan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tur ayat 41: Kemudian Allah mencela mereka dengan celaan yang lain dengan mengatakan : Apakah mereka menyeru mengetahui sesuatu yang ghain, kemudian mereka tulis untuk manusia dan mengabarkan akan pengetahuan ghaib mereka ?! Apakah sungguh demikia ?!"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni apakah mereka mengetahui yang gaib yang tidak diketahui Rasulullah shallallahu 'alaihi wa sallam, lalu pengetahuan itu mereka gunakan untuk menentang dan membangkang kepada Beliau? Sudah menjadi maklum, mereka adalah umat yang ummi (tidak tahu baca-tulis), tidak berpengetahuan dan teresat, sedangkan Rasulullah shallallahu 'alaihi wa sallam memiliki ilmu yang lebih dibanding mereka, dan Allah telah memberitakan kepadanya pengetahuan terhadap hal gaib yang tidak diketahui oleh orang lain. Semua yang disebutkan dalam ayat di atas adalah agar mereka beriman dengan metode akal maupun naql yang menunjukkan rusaknya pendapat mereka, sekaligus memberikan bayangan terhadap kebatilannya dengan cara yang paling baik, paling jelas dan paling selamat dari krtikan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tur Ayat 41",
    "description": "Ataukah mereka menolak beriman karena di sisi mereka mempunyai pengetahuan tentang yang gaib, lalu dengan pengetahuan itu mereka ingin menguasai segala hal dan menuliskannya untuk yang lain'42. Ataukah mereka dengan segala tindakan itu hendak melakukan tipu daya untuk memadamkan cahaya ilahi' sungguh, tipu daya mereka betapapun rapi dan kuat, pasti tidak akan berhasil. Tetapi, orang-orang yang kafir itu akan merasakan akibatnya karena justru merekalah yang terkena dampak buruk dari tipu daya mereka."
  }
]