[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bahkan mereka hendak berbuat makar terhadap Rasulullah dan orang-orang yang beriman, akan tetapi justru makar orang-orang kafir itu kembali menimpa mereka sendiri."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "42. Ataukah para pendusta itu menginginkan untuk melakukan tipu daya terhadapmu dan terhadap agamamu? Percayalah kepada Allah, orang-orang yang kafir kepada Allah dan Rasul-Nya itulah yang terkena tipu daya, bukan kamu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "42. Apakah mereka ingin memberikan makar bagi Rasulullah dan orang-orang beriman? Hanya orang-orang kafir-lah yang akan tertimpa makar mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "42. أَمْ يُرِيدُونَ كَيْدًا ۖ (Ataukah mereka hendak melakukan tipu daya?) Yakni apakah mereka ingin membuat makar terhadap Rasulullah, sehingga mereka dapat membinasakannya dengan makar itu? فَالَّذِينَ كَفَرُوا۟ هُمُ الْمَكِيدُونَ (Maka orang-orang yang kafir itu merekalah yang kena tipu daya) Yakni merekalah yang akan terkena makar mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "42. Ataukah mereka hendak menyusun tipu daya dan kejahatan di Darun Nadwah dengan berkonspirasi untuk membunuhmu wahai Rasul? Orang-orang yang mengingkari Allah dan RasulNya itu adalah orang-orang yang dikalahkan dan dihancurkan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ataukah mereka hendak melakukan tipu daya} tipu daya terhadapmu dan agamamu {Justru orang-orang kafir itulah yang terkena tipu daya} yang terkena tipu daya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "42. Allah berfirman, “Ataukah mereka hendak,” dengan mencelamu dan mencela kebenaran yang kau bawa, “melakukan tipu daya,” yang bisa menggugurkan agamamu dan merusak urusanmu? “Maka orang-orang yang kafir itu, merekalah yang kena tipu daya,” artinya, tipu daya mereka itu menimpa diri mereka sendiri, dampak bahayanya kembali pada diri mereka sendiri, Allah telah melakukan hal itu dan segala puji bagi Allah. Tidaklah tersisa kekuatan orang-orang kafir untuk menipu daya melainkan mereka pasti melakukannya, lalu Allah menolong nabiNya atas mereka, Allah memenangkan agamaNya dan merendahkan serta mengalahkan mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tur ayat 42: Allah masih terus mencela mereka dengan berkata : Apakah mereka menginginkan untuk mendustakanmu dan mengada-ngada atas namamu wahai Nabi Allah untuk mencela mu; Sehingga merusak dakwahmu ?! Kecelakaan dan makar yang mereka perbuat dan akan kembali kepada mereka, dan keburukan mereka akan kembali kepada mereka, mereka adalah orang-orang yang kalah dan terhantam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan mencacatkan kamu wahai Muhammad dan apa yang kamu bawa. Untuk membatalkan agamamu. Yakni tipu daya mereka akan kembali menimpa mereka. Al Hamdulillah, Allah Subhaanahu wa Ta'aala telah melakukannya. Orang-orang kafir telah mengerahkan segala tipu daya mereka, namun Allah Subhaanahu wa Ta'aala menolong nabi-Nya dan agama-Nya, Dia menjadikan mereka tidak berhasil dan kecewa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tur Ayat 42",
    "description": "Ataukah mereka dengan segala tindakan itu hendak melakukan tipu daya untuk memadamkan cahaya ilahi' sungguh, tipu daya mereka betapapun rapi dan kuat, pasti tidak akan berhasil. Tetapi, orang-orang yang kafir itu akan merasakan akibatnya karena justru merekalah yang terkena dampak buruk dari tipu daya mereka. 43. Ataukah penolakan itu karena mereka mempunyai tuhan yang berkuasa selain Allah, yang melarang mereka untuk mempercayaimu, wahai nabi Muhammad' sungguh, tidak ada tuhan selain dia, dan mahasuci Allah dari apa yang mereka persekutukan, apa pun bentuknya."
  }
]