[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Atau apakah mereka memiliki sesembahan yang berhak disembah selain Allah? Mahasuci lagi Mahatinggi Allah dari apa yang mereka sekutukan. Allah tidak mempunyai sekutu dalam kerajaan, Allah tidak mempunyai sekutu dalam kesaan dan ibadah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "43. Ataukah mereka mempunyai sesembahan yang haq selain Allah? Mahasuci Allah dan Mahabersih dari sekutu yang mereka nisbatkan kepada-Nya. Semua yang sudah disebutkan itu sama sekali tidak akan terjadi dan tidak terbayang bagaimanapun juga."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "43. Apakah mereka memiliki tuhan selain Allah yang mereka sembah? Maha Suci Allah dari apa yang mereka sekutukan dengan-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "43. Ataukah bagi mereka Tuhan selain Allah yang menjaga mereka dari azab di akhirat. Maha suci Allah dari kesyirikan mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apakah mereka mempunyai tuhan selain Allah. Mahasuci Allah dari apa yang mereka persekutukan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "43. “Ataukah mereka mempunyai sesembahan selain Allah,” artinya apakah mereka mempunyai tuhan yang disembah dan diharapkan bisa memberi manfaat serta siksanya ditakuti selain Allah “Mahasuci Allah dari apa yang mereka persekutukan.” Tidak ada sekutu bagi Allah dalam kerajaanNya, tidak ada sekutu bagiNya dalam keesaan dan berhak diibadahi. Dan inilah tujuan dari pemaparan kata-kata dalam ayat ini. Yaitu batilnya ibadah kepada selain Allah serta penjelasan ketidakbenarannya dengan dalil-dalil qath’I sekaligus menjelaskan bahwa jalan yang ditempuh orang-orang musyrik adalah batil. Yang wajib disembah, dan diseru dengan doa, baik doa permohonan maupun doa ibadah dan ibadah diikhlaskan untuknya adalah Allah semata, yang dipertuhankan dan disembah. Nama-nama dan sifat-sifatNya sempurna, memiliki sifat baik dan perbuatan indah, Pemilik keluruhan, kemuliaan, kekuatan yang tidak bisa dikalahkan, Yang Maha Esa lagi Tunggal, tempat bergantung segala sesuatu, Mahabesar, Maha terpuji dan Luhur."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tur ayat 43: Kemudian Allah mencela mereka dengan mengatakan : Apakah mereka memiliki tuhan yang berhak untuk diibadahi selain Allah? Allah mensucikan diri-Nya dari penyekutuan mereka dengan berhala-berhala mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang diminta dan diharakan manfaatnya serta dikhawatirkan bahayanya di samping Allah Ta’ala? Oleh karena itu, tidak ada sekutu bagi-Nya baik dalam kerajaan-Nya maupun dalam ibadah. Inilah sebenarnya maksud dari ayat-ayat sebelumnya, yaitu menyatakan batilnya menyembah selain Allah Subhaanahu wa Ta'aala dan menerangkan batilnya dengan dalil-dalil yang qath’i tadi dan bahwa apa yang dipegang kaum musyrikin selama ini adalah batil, dan bahwa yang berhak diibadahi, disembah, disujudi dan diminta adalah Allah Subhaanahu wa Ta'aala yang sempurna nama dan sifat-Nya, sifat-sifat-Nya indah, perbuatan-Nya bagus, Pemilik keagungan dan kemuliaan, kemuliaan-Nya tidak henti-hentinya, Mahaesa, yang dituju, Yang Mahabesar lagi Mahamulia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tur Ayat 43",
    "description": "Ataukah penolakan itu karena mereka mempunyai tuhan yang berkuasa selain Allah, yang melarang mereka untuk mempercayaimu, wahai nabi Muhammad' sungguh, tidak ada tuhan selain dia, dan mahasuci Allah dari apa yang mereka persekutukan, apa pun bentuknya. 44. Ayat-ayat berikut menerangkan keingkaran dan sikap kaum musyrik yang melampaui batas. Dan jika mereka melihat dengan mata kepala sendiri gumpalan-gumpalan awan berjatuhan dari langit ke bumi, mereka akan memandang remeh dan berkata, 'itu adalah awan yang bertumpuk-tumpuk sehingga membentuk butir-butir hujan yang tidak membahayakan. '."
  }
]