[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Seandainya orang-orang musyrik itu melihat pecahan langit turun kepada mereka sebagai azab, niscaya mereka tetap memegang teguh sikap mereka, dan niscaya mereka berkata, “Ini hanya awan yang sebagian darinya bertumpuk di atas sebagian yang lain.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "44. Andai mereka melihat sesuatu jatuh dari langit, mereka akan berkata tentangnya, “Ini adalah awan yang berlapis-lapis sebagian di atas sebagian yang lain sebagaimana biasanya,\" dan mereka tidak mengambil pelajaran darinya dan tidak beriman."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "44-47. Allah menjelaskan kebebalan orang-orang musyrik di atas kekafiran: Jika mereka melihat potongan langit yang jatuh sebagai siksaan bagi mereka, maka mereka akan berkata, ‘Itu hanyalah awan yang saling bertumpuk.’ Hai Rasulullah, biarkanlah mereka di dalam kesesatan hingga mereka berjumpa dengan hari kiamat yang membuat mereka binasa. Pada hari itu makar mereka tidak akan berguna untuk menghindar dari azab Allah, dan tidak ada seorangpun yang dapat melindungi mereka darinya. Orang-orang yang menzalimi diri sendiri dan orang lain itu akan mendapat azab yang mereka rasakan ketika di dunia, sebelum azab di hari kiamat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "44. وَإِن يَرَوْا۟ كِسْفًا مِّنَ السَّمَآءِ سَاقِطًا يَقُولُوا۟ سَحَابٌ مَّرْكُومٌ (Jika mereka melihat sebagian dari langit gugur, mereka akan mengatakan: “Itu adalah awan yang bertindih-tindih”) Yakni jika mereka melihat api yang turun dari langit, niscaya mereka juga tidak akan berhenti dari kekafiran mereka, namun mereka akan mengatakan bahwa itu hanyalah awan yang saling bertindihan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "44. Jika mereka menyaksikan balasan yang menimpa mereka dari langit untuk menyiksa mereka, yaitu azab awal yang mereka tunggu-tunggu kedatangannya, mereka akan berlaku sombong dan karena sangat keras kepala dan sangat ingkar mereka berkata: “Ini adalah awan yang saling tindih-menindih, (dahaga) kita akan terpuaskan olehnya” kemudian mereka tidak beriman-selama-lamanya. Inilah tabiat dari pembangkang. {Kisfan} berarti sebagian dan merupakan bentuk jamak dari kata Kisfah yang bermakna potongan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika mereka melihat gumpalan-gumpalan awan} potongan-potongan awan {berjatuhan dari langit, mereka berkata,“Itu adalah awan yang bertumpuk-tumpuk} yang bertumpuk satu sama lain"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "44. Allah berfirman seraya menjelaskan bahwa orang-orang musyrik dan mendustakan kebenaran yang jelas itu menentang kebenaran dan terus berada di atas kebatilan. Andai pun semua dalil menunjukkan kebenarannya, tentu mereka tidak mengikutinya dan pasti mereka menentangnya. “Jika mereka melihat sebagian dari langit gugur,” artinya, andai pun ayat-ayat jelas berupa potongan siksaan turun dari langit dan akan menimpa mereka, tentu “mereka akan mengatakan, ‘Itu adalah awan yang bertindih-tindih’,” artinya, ini adalah mendung yang bergumpal-gumpal seperti biasanya. Mereka tidak mempedulikan tanda-tanda kebesaran Allah yang mereka saksikan dan tidak mau menjadikannya sebagai pelajaran."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tur ayat 44: Dan di antara kemaksiatan yang paling maksiat dari mereka orang-orang musyrik dan dari pelanggaran mereka adalah jika mereka melihat adzab dengan yakin ke arah langit, pandangan mereka berpaling ke bumi dengan mengatakan : Ini adalah awan yang saling bertumpuk sebagiannya bagi sebagian yang lain, dengan kata lain mereka semestinya melihat bukti atas kebesaran Allah, dan menetapkan wujud Allah untuk merubah akal-akal mereka yang telah terkunci dan mata-mata mereka yang buta."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala berfirman menerangkan bahwa kaum musyrik yang mendustakan kebenaran telah melampaui batas dari kebenaran, tetap akan berada di atas kebatilan, dan bahwa jika setiap kebenaran ditegakkan dalilnya niscaya mereka tidak akan mengikutinya, bahkan akan menyelisihinya dan menentangnya. Sebagai azab. Yakni ini adalah awan biasa yang bertumpuk-tumpuk, mereka tidak peduli terhadap ayat-ayat yang ditunjukkan dan tidak mengambil pelajaran darinya. Oleh karena itu, untuk mereka ini tidak ada penawar yang dapat menyadarkannya selain azab. Allah Subhaanahu wa Ta'aala berfirman di ayat selanjutnya, “Maka biarkanlah mereka hingga mereka menemui hari (yang dijanjikan kepada) mereka, pada hari itu mereka dibinasakan,”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tur Ayat 44",
    "description": "Ayat-ayat berikut menerangkan keingkaran dan sikap kaum musyrik yang melampaui batas. Dan jika mereka melihat dengan mata kepala sendiri gumpalan-gumpalan awan berjatuhan dari langit ke bumi, mereka akan memandang remeh dan berkata, 'itu adalah awan yang bertumpuk-tumpuk sehingga membentuk butir-butir hujan yang tidak membahayakan. '45. Karena mereka meremehkan hal itu, maka biarkanlah mereka dalam kesesatannya, wahai nabi Muhammad, hingga mereka menemui hari jatuhnya ancaman yang dijanjikan kepada mereka. Pada hari itu, hari kiamat, mereka pasti dibinasakan sebagai balasan atas keingkaran mereka."
  }
]