[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tinggalkanlah (wahai Rasul) orang-orang musyrik itu hingga mereka bertemu dengan hari yang pada saat itu mereka dibinasakan, yaitu Hari Kiamat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "45. Maka tinggalkan mereka -wahai Rasul- dalam kebandelan dan pengingkaran mereka sehingga mereka menemui hari saat mereka disiksa, yaitu hari Kiamat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "45. فَذَرْهُمْ حَتَّىٰ يُلٰقُوا۟ يَوْمَهُمُ الَّذِى فِيهِ يُصْعَقُونَ (Maka biarkanlah mereka hingga mereka menemui hari (yang dijanjikan kepada) mereka yang pada hari itu mereka dibinasakan) Yakni hari kematian mereka atau hari kiamat. Makna (الصعقة) yakni kematian yang cepat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "45. Tinggalkanlah mereka wahai Rasulallah dalam kesesatan mereka, sampai mereka mati atau terbunuh dalam peperangan. Ash-Sha’iqu adalah mati karena terbunuh atau dibinasakan dengan cepat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Biarkanlah mereka} biarkanlah mereka {sehingga mereka menemui hari mereka dimana pada hari itu mereka dibinasakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "45. Mereka itu tidak memiliki penawar apa pun selain azab dan siksaan, karena itulah Allah berfirman, “Maka biarkanlah mereka hingga mereka menemui hari (yang dijanjikan kepada) mereka yang pada hari itu mereka dibinasakan,” yaitu pada Hari Kiamat, pada hari di mana mereka ditimpa azab yang pedihnya tidak terukur dan tergambarkan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tur ayat 45: Allah memerintahkan Rasul-Nya ﷺ agar meninggalkan mereka orang-orang musyrik untuk menyeru mereka dan mengurusi mereka, dan agar tidak tersibukkan dengan mereka. Dimana Nabi telah dakwahkan namun mereka tetap di atas kekafiran, sehingga datang hari yang mereka celaka di hari tersebut, dan kemudian mereka akan dibalas pada hari itu atas keburukan mereka, itulah hari kiamat. Ini adalah hiburan bagi Nabi ﷺ, dan bukan maksudnya terdapat larangan untuk mengingatkan dan berdakwah kepada mereka, akan tetapi Allah melarang untuk bersedih atas perlakuan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu hari Kiamat, dimana pada hari itu mereka ditimpa azab yang besar."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tur Ayat 45",
    "description": "Karena mereka meremehkan hal itu, maka biarkanlah mereka dalam kesesatannya, wahai nabi Muhammad, hingga mereka menemui hari jatuhnya ancaman yang dijanjikan kepada mereka. Pada hari itu, hari kiamat, mereka pasti dibinasakan sebagai balasan atas keingkaran mereka. 46. Balasan itu datang pada hari ketika tipu daya yang mereka upayakan tidak berguna sedikit pun bagi mereka, dan pada hari itu mereka juga tidak akan diberi pertolongan."
  }
]