[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Di hari itu, tipu daya mereka tidak bisa menolak azab Allah sedikit pun dari mereka, tidak ada yang menolong mereka dari azab Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "46. Hari yang ketika itu tipu daya mereka tidak berguna bagi mereka, baik sedikit maupun banyak, dan mereka juga tidak mendapat pertolongan dengan diselamatkan dari siksa."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "46. يَوْمَ لَا يُغْنِى عَنْهُمْ كَيْدُهُمْ شَيْـًٔا ((yaitu) hari ketika tidak berguna bagi mereka sedikitpun tipu daya mereka) Yakni pada hari itu tidak bermanfaat bagi mereka tipu daya yang mereka berikan kepada Rasulullah di dunia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "46. Hari dimana tidak ada yang dapat melindungi mereka dari azab, sebagaimana tipu daya mereka di dunia kepada Nabi SAW. Mereka juga tidak mampu mencegah azab Allah SWT di akhirat. bahkan mereka dikunci."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Pada hari (ketika) tipu daya mereka tidak berguna} tidak bisa menjaga mereka {sedikit pun bagi mereka dan mereka tidak akan diberi pertolongan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "46. “(Yaitu) hari ketika tidak berguna bagi mereka sedikit pun tipu daya mereka,” tidak sedikit dan tidak pula banyak, meski ketika di dunia mereka hidup dengan tipu daya dalam waktu yang singkat, namun pada Hari KIamat tipu daya mereka tidak berguna dan semua usaha mereka batil, “dan mereka tidak ditolong.”"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Dr. Abdul Malik bin Muhammad bin 'Abdurrahman al-Qaasim",
    "description": "46. يَوْمَ لَا يُغْنِى عَنْهُمْ كَيْدُهُمْ شَيْـًٔا ((yaitu) hari ketika tidak berguna bagi mereka sedikitpun tipu daya mereka) Yakni pada hari itu tidak bermanfaat bagi mereka tipu daya yang mereka berikan kepada Rasulullah di dunia. وَلَا هُمْ يُنصَرُونَ (dan mereka tidak ditolong) Yakni tidak ada yang dapat menghalangi azab yang menimpa mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tur ayat 46: 46-47. Pada hari yang menggoncangkan itu, tidaklah berguna tipuan mereka yang mereka berusaha menipu Rasul ﷺ di dunia. Dan mereka tidak ada penolong yang menolong mereka dari adzab Allah di akhirat. Kemudian Allah mengabarkan bahwa mereka yang dzalim kepada diri-diri mereka sendiri dengan kekufuran dan maksiat mereka akan di adzab di dunia bukan hanya di hari kiamat, akan tetapi mereka kebanyakan tidak mengetahui apa yang telah Allah siapkan bagi mereka di dunia dan akhirat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Baik sedikit maupun banyak, meskipun di dunia terkadang ada tipu daya dari mereka yang dapat mereka lakukan, namun dalam waktu yang sebentar saja, dan pada hari Kiamat semua tipu daya mereka akan lenyap, usaha mereka sia-sia, dan mereka tidak akan ditolong dari azab Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tur Ayat 46",
    "description": "Balasan itu datang pada hari ketika tipu daya yang mereka upayakan tidak berguna sedikit pun bagi mereka, dan pada hari itu mereka juga tidak akan diberi pertolongan. 47. Azab yang dikemukakan pada ayat sebelumnya diberikan kepada orang yang ingkar, dan sesungguhnya bagi orang-orang yang zalim, baik terhadap diri sendiri maupun orang lain, masih ada azab selain yang sudah disebutkan itu. Tetapi, sayangnya kebanyakan di antara mereka tidak mengetahui."
  }
]