[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang zhalim itu akan mendapatkan azab yang akan mereka terima di dunia sebelum azab di Hari Kiamat, berupa pembunuhan, penawanan, siksa alam kubur dan lainnya, tetapi kebanyakan dari mereka tidak mengetahui."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "47. Sesungguhnya bagi orang-orang yang menganiaya diri mereka sendiri dengan berbuat syirik dan kemaksiatan ada siksa sebelum siksa Akhirat; di dunia dibunuh dan ditawan lalu di barzakh disiksa dengan siksa kubur. Akan tetapi kebanyakan dari mereka tidak mengetahui hal itu, oleh karena itu mereka tetap lanjut dalam kekufuran mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "47. وَإِنَّ لِلَّذِينَ ظَلَمُوا۟ عَذَابًا دُونَ ذٰلِكَ (Dan sesungguhnya untuk orang-orang yang zalim ada azab selain daripada itu) Yakni azab sebelum azab tersebut, yaitu terbunuhnya mereka di perang Badar. Pendapat lain mengatakan yang dimaksud adalah musibah-musibah di dunia seperti penyakit dan hilangnya harta dan keturunan mereka. Dan pendapat lain mengatakan, yakni azab kubur."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "47. Sesungguhnya bagi orang-orang yang menzalimi dirinya sendiri dengan kekufuran itu ada azab di dunia sebelum azab di akhirat, yaitu pembantaian di perang Badar atau musibah lainnya berupa kelaparan dan kegersangan selama 7 tahun. Akan tetapi kebanyakan mereka terlalu bodoh sehingga tidak mengetahui bahwa itu adalah azab."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya bagi orang-orang yang zalim itu azab selain itu} azab di dunia sebelum azab akhirat {tetapi kebanyakan mereka tidak mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "47. Setelah Allah menyebutkan siksaan orang-orang zhalim di akhirat, selanjutnya Allah memberi kabar bahwa mereka itu mendapatkan siksaan sebelum Hari Kiamat, siksaan tersebut mencakup siksaan dunia dengan cara dibunuh, ditawan dana diusir dari negerinya dan siksaan kubur, “tetapi kebanyakan mereka tidak mengetahui,” artinya karena itulah mereka melakukan perbuatan yang menyebabkan mereka mendapatkan siksaan dan azab yang keras."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tur ayat 47: 46-47. Pada hari yang menggoncangkan itu, tidaklah berguna tipuan mereka yang mereka berusaha menipu Rasul ﷺ di dunia. Dan mereka tidak ada penolong yang menolong mereka dari adzab Allah di akhirat. Kemudian Allah mengabarkan bahwa mereka yang dzalim kepada diri-diri mereka sendiri dengan kekufuran dan maksiat mereka akan di adzab di dunia bukan hanya di hari kiamat, akan tetapi mereka kebanyakan tidak mengetahui apa yang telah Allah siapkan bagi mereka di dunia dan akhirat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala menyebutkan azab untuk orang-orang zalim pada hari Kiamat, maka Allah memberitahukan bahwa untuk mereka ada lagi azab selain azab pada hari Kiamat. Azab tersebut mencakup azab di dunia dengan terbunuh, tertawan, diusir, diazab dengan kelaparan, kemarau panjang, terbunuh pada perang Badar.dan azab di alam barzakh. Oleh karena itu, mereka tetap terus mengerjakan perbuatan yang mengharuskan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tur Ayat 47",
    "description": "Azab yang dikemukakan pada ayat sebelumnya diberikan kepada orang yang ingkar, dan sesungguhnya bagi orang-orang yang zalim, baik terhadap diri sendiri maupun orang lain, masih ada azab selain yang sudah disebutkan itu. Tetapi, sayangnya kebanyakan di antara mereka tidak mengetahui. 48. Wahai nabi Muhammad, hendaklah engkau mengetahui keadaan mereka yang seperti itu, dan bersabarlah menunggu ketetapan tuhanmu, karena sesungguhnya engkau selalu berada dalam pengawasan dan pemeliharaan kami. Berzikir dan bertasbihlah dengan memuji tuhanmu ketika engkau bangun pagi untuk melakukan kegiatan duniawi atau ukhrawi."
  }
]