[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "48-49. Sabarlah (wahai rasul) dalam menerima keputusan Tuhanmu dan perintahNya yang telah memikulkan beban kerasulan di pundakmu, atas gangguan yang kamu terima dari kaummu, karena sesungguhnya kamu berada di bawah penglihatan, perhatian, dan penjagaan Kami. Bertasbihlah dengan memuji Tuhanmu saat kamu berdiri shalat, dan saat kamu bangun dari tidur. Dan dari sebagian malam hari, bertasbihlah memuji Tuhanmu dan agungkanlah Dia, dan shalatlah karenaNya. Lakukanlah hal itu pada Shalat Subuh saat bintang-bintang redup. Dalam ayat ini terkandung dalil yang menetapkan sifat “dua mata” bagi Allah sesuai dengan keagunganNya tanpa menyamakanNya dengan makhluk atau menetapkan bentuk DzatNya, Mahasuci Allah dan segala puji bagiNya, sebagaimana hal tersebut ditetapkan oleh as-Sunnah dan disepakati oleh generasi salaf umat ini. Lafazh “mata” hadir disini dengan kata jamak untuk pengagungan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "48. Dan bersabarlah -wahai Rasul- atas takdir Rabbmu dan hukum syariat-Nya, sesungguhnya engkau dalam jangkauan penglihatan Kami dan penjagaan Kami. Dan bertasbihlah dengan memuji Rabbmu ketika engkau bangun dari tidurmu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "48-49. Hai Rasulullah, bersabarlah atas ketetapan Tuhanmu, karena kamu berada dalam pengawasan dan perlindungan Kami. Teruslah bertasbih dan bertahmid memuji Tuhanmu ketika kamu shalat dan ketika bangun tidur, dan di sebagian malam bertasbihlah memuji Tuhanmu, dan ketika shalat subuh saat bintang-bintang mulai menghilang dari pandangan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "48. فَإِنَّكَ بِأَعْيُنِنَا ۖ (maka sesungguhnya kamu berada dalam penglihatan Kami) Yakni dalam pengawasan dan perlindungan Kami, maka janganlah kamu mempedulikan mereka. وَسَبِّحْ بِحَمْدِ رَبِّكَ حِينَ تَقُومُ (dan bertasbihlah dengan memuji Tuhanmu ketika kamu bangun berdiri) Yakni berdiri dari tempat dudukmu, dengan mengucapkan do’a (سبحانك اللهم وبحمدك) setiap kali berdiri dari majlis."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "48. Bersabarlah wahai nabi atas ketentuan Tuhanmu dengan memberi (tenggang) waktu bagi mereka dan kamu menyampaikan risalahmu itu. Jangan terganggu oleh penolakan-penolakan mereka. Sesungguhnya kamu terjaga oleh penjagaan dan pemeliharaan Kami. Tetaplah mensucikan Tuhanmu dari segala sesuatu yang tidak sesuai denganNya. Dan rangkailah tasbihmu dengan tahmid dan syukur. Maka katakanlah: “Subhanallah wa bihamdihi”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bersabarlah pada ketetapan Tuhanmu} pada ketetapan Tuhanmu dalam menanggung risalahNya {karena sesungguhnya kamu berada dalam pengawasan Kami} dalam pengawasan dari Kami {Bertasbihlah dengan memuji Tuhanmu ketika kamu bangun} dari tidurmu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "48-49. Ketika Allah menjelaskan berbagai hujjah dan bukti atas kebatilan perkataan orang-orang yang mendustakan, Allah memerintah RasulNya agar tidak bersedih hati terhadap mereka dan agar tetap bersabar terhadap ketentuan RabbNya, baik yang bersifat qadari maupun syar’i dengan selalu menetapi dan istiqamah di atas ketentuan Allah, Allah menjanjikan RasulNya diberi pengawasan melalui FirmanNya, “Maka sesungguhnya kamu berada dalam (pengawasan) Mata Kami,” yakni, berada dalam pengawasan, penjagaan, serta perhatian Kami terhadap urusanmu. Allah juga memerintahkannya agar menjadikan kesabaran sebagai penolong dengan berdzikir dan beribadah. Allah berfirman, “Dan bertasbihlah memuji RabbMu ketika engkau berdiri,” yakni ketika engkau bangun tidur. Dalam ayat ini terdapat perintah qiyamul lail, atau kemungkinan maknanya adalah ketika engkau berdiri untuk shalat lima waktu, berdasarkan Firman Allah, “Dan di waktu bintang-bintang terbenam (di waktu fajar),” artinya pada penghujung malam di kala waktu shalat fajar masuk. Wallahu a’lam."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tur ayat 48: 48-49. Allah memerintahkan kepada Nabi-Nya ﷺ untuk bersabar atas celaan mereka orang-orang musyrik, dan tidak perlu memperdulikan mereka, dan agar menjalankan perintah dan larangan Allah, dan menyampaikan apa yang Allah utus. Sungguh yang dilihat Allah dari Nabi-Nya adalah amalannya, dan Allah melingkupi dan menjaga Nabi ﷺ. Kemudian Allah memerintahkan untuk bersabar dengan mensucikan-Nya dari apa yang tidak pantas bagi-Nya. Dan agar Nabi bertasbih ketika tidur atau ketika berada dalam majelis atau ketika mengerjakan shalat. Dan agar memperbanyak bertasbih dan shalat di sebagian malam, dan ketika bintang telah muncul membelakangi langit yaitu pada akhir malam dan sebelum shalat fajar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala menerangkan hujjah-hujjah dan bukti-bukti yang menunjukkan batilnya ucapan orang-orang yang mendustakan, maka Allah Subhaanahu wa Ta'aala memerintahkan Rasul-Nya shallallahu 'alaihi wa sallam agar tidak mempedulikan sedikit pun mereka serta bersabar terhadap ketetapan Tuhannya baik yang qadari (terhadap alam semesta) maupun syar’i (dalam agama) yaitu dengan tetap istiqamah di atasnya, dan Dia juga menjanjikan akan memberikan kecukupan kepada Beliau. Dan janganlah kamu bersempit dada. Yakni dalam pantauan dan penjagaan Kami. Maksudnya, hendaklah kamu bertasbih ketika bangun dari tidur atau bangun meninggalkan majlis, atau ketika berdiri hendak shalat. Ketika bangun dari tidur, yaitu sebagaimana dalam hadits berikut: عَنْ عُبَادَةَ بْنِ الصَّامِتِ عَنِ النَّبِىِّ صلى الله عليه وسلم قَالَ : « مَنْ تَعَارَّ مِنَ اللَّيْلِ : فَقَالَ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ ، لَهُ الْمُلْكُ ، وَلَهُ الْحَمْدُ ، وَهُوَ عَلَى كُلِّ شَىْءٍ قَدِيرٌ . الْحَمْدُ لِلَّهِ ، وَسُبْحَانَ اللَّهِ ، وَلاَ إِلَهَ إِلاَّ اللَّهُ ، وَاللَّهُ أَكْبَرُ ، وَلاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ . ثُمَّ قَالَ : اللَّهُمَّ اغْفِرْ لِى . أَوْ دَعَا اسْتُجِيبَ ، فَإِنْ تَوَضَّأَ وَصَلَّى قُبِلَتْ صَلاَتُهُ » . Dari ‘Ubadah bin Ash Shaamit: Dari Nabi shallallahu 'alaihi wa sallam, Beliau bersabda, “Barang siapa yang terbangun dari tidurnya, lalu mengucapkan: لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ ، لَهُ الْمُلْكُ ، وَلَهُ الْحَمْدُ ، وَهُوَ عَلَى كُلِّ شَىْءٍ قَدِيرٌ . الْحَمْدُ لِلَّهِ ، وَسُبْحَانَ اللَّهِ ، وَلاَ إِلَهَ إِلاَّ اللَّهُ ، وَاللَّهُ أَكْبَرُ ، وَلاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ “Tidak ada Tuhan yang berhak disembah selain Allah, tidak ada sekutu bagi-Nya. kepunyaan-Nya-lah kerajaan dan kepunyaan-Nya-lah segala pujian. Dia Mahakuasa terhadap segala sesuatu. Segala puji bagi Allah, Mahasuci Allah, Tidak ada Tuhan yang berhak disembah selain Allah, Allah Maha Besar dan tidak ada daya serta upaya kecuali dengan pertolongan Allah.” Kemudian berkata, “Ya Allah, ampunilah aku” atau dia berdoa, maka doanya akan dikabulkan. Jika dia berwudhu’ kemudian shalat, maka shalatnya akan diterima.” (HR. Bukhari) Ketika bangun meninggalkan masjid, yaitu dengan mengucapkan doa kaffaratul majlis. Sedangkan ketika bangun untuk shalat dengan membaca doa iftitah berikut: سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ تَبَارَكَ اسْمُكَ وَتَعَالَى جَدُّكَ وَلاَ إِلَهَ غَيْرُكَ . “Mahasuci Engkau ya Allah sambil memuji-Mu, Mahaberkah nama-Mu, Mahatinggi keagungan-Mu dan tidak ada Tuhan yang berhak disembah selain Engkau.” (Ini adalah doa iftitah Umar bin Khaththab radhiyallahu 'anhu sebagaimana yang diriwayatkan oleh Muslim)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tur Ayat 48",
    "description": "Wahai nabi Muhammad, hendaklah engkau mengetahui keadaan mereka yang seperti itu, dan bersabarlah menunggu ketetapan tuhanmu, karena sesungguhnya engkau selalu berada dalam pengawasan dan pemeliharaan kami. Berzikir dan bertasbihlah dengan memuji tuhanmu ketika engkau bangun pagi untuk melakukan kegiatan duniawi atau ukhrawi. 49. Dan selain itu, pada sebagian malam, ketika kebanyakan orang tidur, dekatkanlah dirimu kepada Allah, bertasbihlah kepada-Nya, dan berzikir serta bertasbihlah pada waktu terbenamnya bintang-bintang pada waktu fajar."
  }
]