[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-6. Allah bersumpah dengan Thur, yaitu gunung dimana Allah berbicara kepada Musa, juga dengan kitab yang tertulis, yaitu al-Quran dalam shuhuf-shuhuf yang terbuka, juga dengan Baitul Ma’mur di langit yang ramai oleh para malaikat yang selalu menghadirinya, juga dengan atap yang terangkat, yaitu langit terdekat, dan dengan lautan yang bergejolak yang penuh dengan air,"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Dan bersumpah dengan langit yang terangkat yang merupakan atap bumi."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. وَالسَّقْفِ الْمَرْفُوعِ (dan atap yang ditinggikan) Yakni langit. Allah menyebutnya dengan atap karena ia adalah atap bagi bumi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5-6. Dan demi langit yang diangkat tanpa tiang, dan demi lautan yang dipenuhi air yang didihkan oleh api pada hari kiamat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{demi atap yang ditinggikan} Aku bersumpah demi langit yang ditinggikan yang dijadikan sebagai atab bagi bumi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5. “Dan atap yang ditinggikan (langit),” yakni langit yang dijadikan Allah sebagai atap bagi semua makhuk dan sebagai bangunan bagi bumi, dari situlah cahaya dipancarkan ke bumi yang tanda-tandanya dijadikan petunjuk. Dari situlah Allah menurunkan hujan, rahmat, dan berbagai macam rizki."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tur ayat 5: Allah bersumpah dengan langit yang menjulang tinggi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Langit Allah Subhaanahu wa Ta'aala jadikan sebagai atap bagi bumi, dimana cahaya yang tampak di bumi berasal dari sana, tanda-tandanya dipakai sebagai petunjuk jalan, dan dari sana Allah Subhaanahu wa Ta'aala menurunkan hujan, rahmat dan berbagai rezeki."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tur Ayat 5",
    "description": "1-6. Surah a'-''riy't ditutup dengan penegasan jatuhnya ancaman Allah bagi mereka yang kafir. Surah at-t'r diawali dengan kepastian jatuhnya azab bagi mereka yang mengingkari ayat-ayat Allah. Penegasan tentang kepastian azab ini diawali dengan sumpah-sumpah Allah. Demi gunung sinai yang menjadi lokasi nabi musa menerima taurat, dan demi kitab Allah yang diwahyukan-Nya dan yang ditulis pada lembaran yang terbuka sehingga mudah dibaca dan dipahami maknanya, dan demi baitulma'mur, yaitu kakbah atau tempat yang menjadi lokasi para malaikat rukuk, sujud, dan tawaf, dan demi atap, yaitu langit, yang ditinggikan dan kukuh tanpa tiang penyangga, dan demi lautan yang penuh gelombang yang di dalam tanahnya terdapat api"
  }
]