[
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Dan bersumpah dengan lautan yang dipenuhi air."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. وَالْبَحْرِ الْمَسْجُورِ (dan laut yang di dalam tanahnya ada api) Yakni laut yang dinyalakan. Diriwayatkan bahwa lautan akan dinyalakan dengan api ketika hari kiamat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5-6. Dan demi langit yang diangkat tanpa tiang, dan demi lautan yang dipenuhi air yang didihkan oleh api pada hari kiamat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan demi lautan yang dipanaskan} Aku bersumpa demi lautan yang dipenuhi dengan air"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6. “Dan lautan yang diluapkan api”, yakni penuh air. Allah menahannya agar tidak meluap ke dataran bumi, meski secara alamiah, air bisa menutupi permukaan bumi, namun hikmah dan kebijaksanaan Allah mengharuskan air tersebut tertahan dan tidak bisa menggenangi seluruh permukaan bumi, agar berbagai jenis hewan bisa hidup. Ada yang menyatakan bahwa maksud dari kata ‘almasjur’ adalah dinyalakan, yakni, apa yang akan dinyalakan pada Hari Kiamat sehingga lautan menjadi lautan membara yang penuh dengan berbagai macam siksa."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tur ayat 6: Allah bersumpah dengan lautan yang berkobar padanya api yang menyala-nyala pada hari kiamat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni penuh airnya. Allah Subhaanahu wa Ta'aala memenuhkan laut dengan air dan menahannya agar tidak melimpah ke bumi, dimana secara tabiat akan membanjiri permukaan bumi, namun hikmah Allah menghendaki agar air itu tidak tumpah dan banjir agar makhluk yang tinggal di permukaan bumi dapat hidup. Ada pula yang menafsirkan “Wal bahril masjuur” dengan yang dinyalakan api dalam tanahnya, yakni akan menyalakan api pada hari Kiamat, sehingga menjadi api yang menyala-nyala. Semua ini, yakni perkara-perkara yang Allah bersumpah dengannya menunjukkan bahwa ia termasuk ayat-ayat Allah dan dalil yang menunjukkan keesaan-Nya, bukti kekuasaan-Nya dan berkuasanya Dia membangkitkan orang-orang yang telah mati. Oleh karena itulah, Allah Subhaanahu wa Ta'aala berfirman, “Sesungguhnya azab Tuhanmu pasti terjadi,” (Terj. Ath Thuur: 7), maksudnya pasti terjadi dan Allah tidak akan menyalahi janji-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tur Ayat 6",
    "description": "1-6. Surah a'-''riy't ditutup dengan penegasan jatuhnya ancaman Allah bagi mereka yang kafir. Surah at-t'r diawali dengan kepastian jatuhnya azab bagi mereka yang mengingkari ayat-ayat Allah. Penegasan tentang kepastian azab ini diawali dengan sumpah-sumpah Allah. Demi gunung sinai yang menjadi lokasi nabi musa menerima taurat, dan demi kitab Allah yang diwahyukan-Nya dan yang ditulis pada lembaran yang terbuka sehingga mudah dibaca dan dipahami maknanya, dan demi baitulma'mur, yaitu kakbah atau tempat yang menjadi lokasi para malaikat rukuk, sujud, dan tawaf, dan demi atap, yaitu langit, yang ditinggikan dan kukuh tanpa tiang penyangga, dan demi lautan yang penuh gelombang yang di dalam tanahnya terdapat api. 7-8. Sungguh, azab tuhanmu yang diancamkan kepada para pengingkar ayat-ayat dan ajaran-Nya pasti terjadi. Ketika itu, tidak ada sesuatu pun, baik manusia maupun makhluk lain, yang dapat menolak atau menghindarinya,"
  }
]