[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "7-10. sesungguhnya azab Tuhanmu (wahai Rasul) pasti akan menimpa orang-orang kafir, tidak ada yang menghalanginya saat ia datang. Hari yang saat itu langit bergerak, tatanannya rusak, penjuru-penjurunya goncang, itu adalah akhir hidup dunia. Gunung-gunung terangkat dari tempatnya, ia berjalan seperti awan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Sesungguhnya siksa Rabbmu -wahai Rasul- pasti akan menimpa orang-orang kafir, tidak ada keraguan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7-8. Sesungguhnya azab Tuhanmu wahai Nabi, akan terjadi pada hari kiamat bagi orang yang layak menerimanya, dan bukan hal yang mustahil. Tidak ada seorangpun yang mampu menghalangi atau mencegahnya agar tidak menimpa mereka yang layak (menerimanya)."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{sesungguhnya azab Tuhanmu pasti terjadi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7. Seluruh yang dijadikan obyek sumpah oleh Allah tersebut menunjukkan tanda-tanda kebesaran Allah, petunjuk atas keesaanNya serta sebagai bukti jelas atas KuasaNya untuk membangkitkan manusia yang sudah mati, karena itu Allah berfirman, “Sesungguhnya azab Rabbmu pasti terjadi,” yakni, pasti akan terjadi dan Allah tidak akan mengingkari janji dan FirmanNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tur ayat 7: 7-8. Allah kemudian mendatangkan jawaban bagi sumpah-Nya, Allah mengabarkan bahwa adzab Rabbmu wahai Nabi, tidak ada yang mencegah bagi siapa yang ditimpakan dengannya dari mereka orang-orang kafir yang mendustakan Rasul, tidak ada yang menghalanginya dengan penghalang apapun, dan tidak juga ada bagi mereka jalan keluar."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tur Ayat 7",
    "description": "7-8. Sungguh, azab tuhanmu yang diancamkan kepada para pengingkar ayat-ayat dan ajaran-Nya pasti terjadi"
  }
]