[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "7-10. sesungguhnya azab Tuhanmu (wahai Rasul) pasti akan menimpa orang-orang kafir, tidak ada yang menghalanginya saat ia datang. Hari yang saat itu langit bergerak, tatanannya rusak, penjuru-penjurunya goncang, itu adalah akhir hidup dunia. Gunung-gunung terangkat dari tempatnya, ia berjalan seperti awan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Orang kafir itu tidak mempunyai penolak yang bisa menolak siksa atas mereka dan menghalangi terjadinya siksa atas mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7-8. Sesungguhnya azab Tuhanmu wahai Nabi, akan terjadi pada hari kiamat bagi orang yang layak menerimanya, dan bukan hal yang mustahil. Tidak ada seorangpun yang mampu menghalangi atau mencegahnya agar tidak menimpa mereka yang layak (menerimanya)."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidak ada sesuatu apapun yang dapat menolaknya} yang menolak"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8. “Tidak seorang pun yang dapat menolaknya,” dan tidak ada yang dapat mencegahnya, karena Kuasa Allah tidak bisa dikalahkan oleh siapa pun, tidak akan bisa luput dari orang yang lari sekalipun."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tur ayat 8: 7-8. Allah kemudian mendatangkan jawaban bagi sumpah-Nya, Allah mengabarkan bahwa adzab Rabbmu wahai Nabi, tidak ada yang mencegah bagi siapa yang ditimpakan dengannya dari mereka orang-orang kafir yang mendustakan Rasul, tidak ada yang menghalanginya dengan penghalang apapun, dan tidak juga ada bagi mereka jalan keluar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Karena kekuasaan Allah tidak ada yang dapat melemahkannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tur Ayat 8",
    "description": "7-8. Sungguh, azab tuhanmu yang diancamkan kepada para pengingkar ayat-ayat dan ajaran-Nya pasti terjadi. Ketika itu, tidak ada sesuatu pun, baik manusia maupun makhluk lain, yang dapat menolak atau menghindarinya, 9-10. Siksa bagi para pengingkar itu akan datang pada hari ketika langit berguncang dan bergerak naik turun, kiri dan kanan dengan sekeras-kerasnya, dan gunung berjalan atau berpindah dari tempatnya bagaikan awan yang ditiup angin."
  }
]