[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "7-10. sesungguhnya azab Tuhanmu (wahai Rasul) pasti akan menimpa orang-orang kafir, tidak ada yang menghalanginya saat ia datang. Hari yang saat itu langit bergerak, tatanannya rusak, penjuru-penjurunya goncang, itu adalah akhir hidup dunia. Gunung-gunung terangkat dari tempatnya, ia berjalan seperti awan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Pada hari ketika langit bergerak dengan cepat dan bergoncang sebagai permulaan terjadinya hari Kiamat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. يَوْمَ تَمُورُ السَّمَآءُ مَوْرًا (pada hari ketika langit benar-benar bergoncang) Yakni lapisan-lapisan langit saling bergejolak pada saat hari kiamat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9. Hari dimana langit digerakkan dan diguncang dengan guncangan yang amat keras, yaitu hari kiamat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{pada hari (ketika) langit berguncang} bergetar {sekeras-kerasnya} sangat keras"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9. Kemudian Allah menyebutkan suasana di Hari Kiamat itu, di mana azab akan melanda, maka Allah berfirman, “Pada hari ketika langit benar-benar bergoncang,” artinya langit berputar dan bergoncang, gerakan itu tetap bertahan lama dan tidak bisa tenang."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tur ayat 9: Ketahuilah wahai manusia bahwa adzab yang nyata ini, yaitu pada hari yang terguncang padanya langit dan menjadi tidak teratur sebagaimana biasa, kemudian bergoncang dengan goncangan yang dahsyat pada hari itu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala menyebutkan sifat atau keadaan pada hari itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tur Ayat 9",
    "description": "9-10. Siksa bagi para pengingkar itu akan datang pada hari ketika langit berguncang dan bergerak naik turun, kiri dan kanan dengan sekeras-kerasnya, dan gunung berjalan atau berpindah dari tempatnya bagaikan awan yang ditiup angin"
  }
]