[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1. Segala apa yang ada di langit dan bumi menyucikan Allah dari apa yang tidak layak bagiNya. Allah Mahaperkasa, Yang tidak terkalahkan, juga Mahabijaksana dalam takdir, pengaturan, penciptaan dan penetapan syariatNya, Dia meletakkan segala urusan pada tempatnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Seluruh makhluk yang ada di langit dan di bumi menyucikan Allah dan membersihkan-Nya dari apa yang tidak pantas bagi-Nya, dan Dia Maha Perkasa, tidak ada seorang pun yang mampu mengalahkan-Nya, Maha Bijaksana dalam penciptaan-Nya, syariat-Nya dan takdir-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1. Allah menjelaskan kuasa-Nya Yang Maha Besar, banyaknya tasbih yang diucapkan para makhluk-Nya, dan luas kerajaan-Nya: Sungguh seluruh makhluk yang ada di tujuh langit dan bumi bertasbih dan bertahmid menyebut nama Tuhan mereka, Dia Maha Perkasa terhadap para makhluk-Nya dan Maha Bijaksana dalam mengatur urusan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Keutamaan: Diriwayatkan dari Ahmad dan Tirmidzi dari Ma’qal bin Yasar berkata: Rasul SAW berkata: barang siapa mengucap Aku berlindung kepada Allah dari godaan setan yang terkutuk kemudian membaca 3 ayat terakhir dari surat Alhasyr pada waktu pagi, maka Allah akan mengirimkan kepadanya 7000 malaikat yang senantiasa bershalawat padanya hingga sore datang. Jika pada hari itu dia meninggal, maka dia akan mati syahid, dan apabila dia membaca itu pada waktu sore maka juga seperti itu pula. Tirmidzi, hadis hasan gharib. 1. Allah akan mengeluarkan segala yang tidak sesuai dengan Dzat-Nya. Huruf lam di dalam lafadz lillah adalah tambahan. Segala sesuatu yang ada di langit dan bumi, Dia lah yang Maha Perkasa dan Meliputi segala sesuatu dalam kerajaan-Nya. Yang Maha Bijaksana dalam segala keputusan dan tindakan-Nya. Diriwayatkan dari Bukhari dari Ibnu Abbas bahwa surat Al anfal turun ketika perang Badr, dan surat Alhasyr turun kepada Bani Nadhir"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apa yang ada di langit dan yang ada di bumi bertasbih kepada Allah} mensucikan dan memuji Allah {Dialah Yang Maha perkasa lagi Maha bijaksana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1. Allah memulai surat ini dengan mengabarkan bahwa semua yang ada di langit dan di bumi bertasbih memuji Rabbnya dan memahasucikanNya dari segala sesuatu yang tidak layak bagi keluhuranNya. Semua yang ada di langit dan dibumi menyembah dan tunduk pada keagunganNya, karena Dia Mahaperkasa yang memaksa segala sesuatu. Tidak ada sesuatu pun yang bisa menghalangiNya. Semua makhluk yang sulit tunduk tidak ada yang bisa durhaka padaNya. Mahabijaksana dalam ciptaan serta urusanNya. Tidak menciptakan sesuatu pun dengan sia-sia. Tidak mensyariatkan sesuatu pun dengan sia-sia. Tidak mensyariatkan sesuatu pun yang tidak ada maslahatnya dan tidak melakukan apa pun kecuali berdasarkan hikmahNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Hasyr ayat 1: Surat ini diawali dengan pujian Allah dan kesucian-Nya atas apa yang tidak sesuai dengan dzat dan kemuliaan-Nya. Allah mengabarkan bahwa setiap yang di langit dan di bumi mensucikan Allah atas apa yang tidak sesuai dengan kemuliaan dan kebesaran-Nya; Allah Maha Gagah yang kuasa atas segala sesuatu dan menaklukkan segala sesuatu, pemilik hikmah yang kokoh. Kedua sifat Allah ini adalah kebaikan untuk mensucikan Allah. Pensucian seluruh makhluk kepada Allah adalah melalui lisan sesungguhnya dan lisan lainnya, dan jumhur ahli tahqiq sepakat dengan ini; Dan tidaklah mengherankan atas batu yang dapat berbicara, karena Rasul ﷺ berkata dalam hadits riwayat muslim dan tirmidzi : Sesungguhnya aku mengetahui batu di Mekkah yang berislam kepadaku. Dan Allah telah berfirman : وَلَـٰكِن لَّا تَفْقَهُونَ تَسْبِيحَهُمْ , yang artinya : tetapi kamu sekalian tidak mengerti tasbih mereka. {Al Isra : 44}."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Syaikh As Sa'diy menerangkan, bahwa surah ini adalah surah Bani Nadhir, dimana mereka adalah sekelompok besar dari kalangan orang-orang Yahudi yang tinggal bersebelahan dengan Madinah di saat Nabi shallallahu 'alaihi wa sallam dibangkitkan. Setelah Nabi shallallahu 'alaihi wa sallam diutus dan berhijrah ke Madinah, maka mereka kafir kepada Beliau bersama orang-orang Yahudi lainnya. Ketika Beliau shallallahu 'alaihi wa sallam telah tinggal di Madinah, maka Beliau berdamai dengan seluruh orang-orang Yahudi yang menjadi tetangga Beliau di Madinah. Kira-kira enam bulan setelah perang Badar berlalu, Nabi shallallahu 'alaihi wa sallam keluar menemui mereka (orang-orang Yahudi) dan berbicara dengan mereka agar mereka mau membantu Beliau dalam menuntut diyat dua orang dari Bani Killaab yang dibunuh oleh Amr bin Umayyah Adh Dhamuri, lalu mereka berkata, “Kami akan lakukan wahai Abul Qaasim! Duduklah bersama kami sehingga kami bisa memenuhi keperluanmu,” lalu sebagian mereka dengan sebagian yang lain diam-diam bermusyawarah untuk membunuh Nabi shallallahu 'alaihi wa sallam karena dijadikan indah oleh setan, mereka berkata, “Siapakah di antara kamu yang mau mengambil penggilingan ini lalu ia angkat kemudian menaruhnya di atas kepala Beliau untuk dipecahkan dengannya?” Maka orang yang paling celaka di antara mereka, yaitu ‘Amr bin Jahhasy berkata, “Saya,” maka Salam bin Misykam berkata, “Jangan kalian lakukan. Demi Allah, akan diberitahukan niat kalian itu dan hal itu merupakan pembatalan janji yang telah dilakukan di antara kita dengan Beliau.” Maka datanglah wahyu kepada Beliau dari Tuhannya mengenai niat jahat mereka itu. Segeralah Rasulullah shallallahu 'alaihi wa sallam bangun dan menuju Madinah lalu ditemui oleh para sahabat dan mereka berkata, “Engkau bersiap-siap, namun kami tidak menyadari,” maka Beliau shallallahu 'alaihi wa sallam memberitahukan kepada mereka niat orang-orang Yahudi itu. Kemudian Rasulullah shallallahu 'alaihi wa sallam mengirim orang untuk memberitahukan, “Keluarlah kamu (wahai orang-orang Yahudi) dari Madinah dan jangan tinggal bersamaku di sini, dan aku beri tangguh kepadamu selama sepuluh hari. Barang siapa yang ditemukan tetap di situ setelah pemberitahuan itu, maka akan dipenggal lehernya.” Lalu mereka tinggal beberapa hari untuk bersiap-siap dan seorang munafik bernama Abdullah bin Ubay bin Salul mengirim orang kepada mereka memberitahukan, “Janganlah kalian keluar dari tempat tinggalmu karena bersamaku ada 2.000 orang yang akan masuk ke bentengmu bersamamu, mereka siap mati untuk membelamu, Bani Quraizhah akan menolongmu, demikian pula sekutu kamu dari Ghatfan.” Maka Huyay bin Akhthab tokoh mereka senang dengan ucapan itu sehingga mengirimkan orang untuk mengatakan kepada Rasulullah shallallahu 'alaihi wa sallam, “Kami tidak akan keluar dari tempat tinggal kami. Oleh karena itu, lakukanlah apa yang hendak kamu lakukan.” Maka Rasulullah shallallahu 'alaihi wa sallam bertakbir, demikian pula para sahabatnya dan pergi berangkat menuju mereka, sedangkan Ali bin Abi Thalib membawa panji bendera, lalu mereka tinggal di dekat benteng mereka dengan melempari panah dan batu, sedangkan Bani Quraizhah tidak membantu mereka, dan Abdullah bin Ubay serta para sekutu mereka mengkhianati mereka, maka Rasulullah shallallahu 'alaihi wa sallam mengepung mereka, menebang pohon kurma mereka dan membakar, lalu mereka mengirimkan orang untuk memberitahukan bahwa mereka akan keluar dari Madinah.” Maka Beliau membiarkan mereka dengan syarat mereka harus keluar dari Madinah membawa diri dan anak keturunan mereka dan bahwa untuk mereka apa yang diangkut unta selain senjata. Maka Rasulullah shallallahu 'alaihi wa sallam memegang harta dan senjata mereka. Harta-harta Bani Nadhir ini khusus untuk Rasulullah shallallahu 'alaihi wa sallam untuk keperluan Beliau dan maslahat kaum muslimin dan Beliau tidak membagi seperlima, karena Allah Subhaanahu wa Ta'aala yang memberikan harta fa’i itu kepada Beliau, sedangkan kaum muslimin tidak bersusah payah mengerahkan kuda dan unta untuknya, dan Beliau shallallahu 'alaihi wa sallam mengusir mereka ke Khaibar yang di tengah-tengah mereka terdapat Huyay bin Akhthab tokoh mereka. Beliau shallallahu 'alaihi wa sallam telah menguasai tanah dan tempat tinggal mereka, mengambil senjata, sehingga terkumpul 50 baju besi, 50 tutup kepala dari besi dan 340 pedang, itulah kesimpulan kisah mereka sebagaimana diterangkan oleh Ahli Sejarah. Maka Allah Subhaanahu wa Ta'aala memulai surah ini dengan memberitahukan bahwa semua yang ada di langit dan di bumi bertasbih dengan memuji Tuhannya serta menyucikan-Nya dari segala yang tidak layak dengan keagungan-Nya, menyembah-Nya dan tunduk kepada kebesaran-Nya karena Allah Mahaperkasa yang menundukkan segala sesuatu sehingga tidak ada sesuatu pun yang menolaknya, dan Dia Mahabijaksana yang bijaksana dalam ciptaan-Nya dan dalam perintah-Nya, Dia tidaklah menciptakan sesuatu main-main dan tidaklah mensyariatkan hal yang tidak ada maslahatnya dan tidaklah melakukan kecuali yang di sana sejalan dengan hikmah-Nya. Termasuk di antaranya adalah Allah Subhaanahu wa Ta'aala menolong Rasul-Nya terhadap orang-orang kafir dari kalangan Ahli Kitab, yaitu Bani Nadhir ketika mereka melanggar perjanjian dengan Rasulullah shallallahu 'alaihi wa sallam sehingga Beliau mengusir mereka dari tempat tinggal mereka yang biasa mereka tempati dan mereka cintai. Pengusiran tersebut adalah pengusiran pertama yang ditetapkan Allah Subhaanahu wa Ta'aala untuk mereka melalui tangan Rasul-Nya Muhammad shallallahu 'alaihi wa sallam, maka mereka pun keluar menuju Khaibar. Ayat yang mulia ini juga menunjukkan bahwa mereka akan mendapat pengusiran lagi di samping ini dan ternyata demikian, yaitu mereka (sisa-sisa orang-orang Yahudi) diusir lagi dari Khaibar oleh Umar radhiyallahu 'anhu di zaman pemerintahannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hasyr Ayat 1",
    "description": "Apa yang ada di langit, bintang, bulan, planet, dan seluruh isi galaksi, dan apa yang ada di bumi, lautan, daratan, gunung, sungai, tumbuh-tumbuhan, hewan, dan lain-lain semuanya bertasbih kepada Allah, menyatakan kemahasucian Allah menurut caranya masing-masing sesuai dengan keadaan dan kejadiannya, sedangkan manusia tidak memahami tasbih makhluk-makhluk tersebut; dan dialah yang mahaperkasa, menciptakan dan menghancurkan jagat raya; mahabijaksana, dalam penciptaan dan pengaturan alam semesta. 2. Allah menyatakan bahwa dialah yang mengeluarkan dengan cara memerintahkan kepada rasulullah untuk mengusir orang-orang kafir di antara ahli kitab, yakni kaum yahudi bani nadir dan bani qainuqa', dua kabilah yahudi dari kampung halamannya di madinah yang sudah menetap di sana sejak sebelum kelahiran nabi. Peristiwa ini terjadi pada saat pengusiran yang pertama yang dilakukan rasulullah terhadap bani qainuqa' setelah perang badar. Pengusiran kedua adalah pengusiran terhadap bani nadir dan bani quraizah setelah perang ahzab. Pengusiran ketiga dilakukan oleh 'umar bin khattab terhadap semua kaum yahudi di madinah, karena pelanggaran mereka terhadap kesepakatan damai. Kamu tidak menyangka, bahwa mereka akan keluar dari madinah dengan mudah, karena sistem pertahanan mereka kuat dan memiliki sdm yang berkualitas. Mereka yakin bahwa Muhammad dan para pengikutnya tidak akan pernah sanggup mengeluarkan mereka dari madinah. Dan mereka pun yakin bahwa benteng-benteng mereka yang kuat dan strategis akan dapat mempertahankan mereka dari hukuman Allah yang dilancarkan kaum muslim kepada mereka. Maka Allah segera mendatangkan hukuman itu kepada mereka, melalui tangan-tangan kaum muslim, setelah bani qainuqa' menunjukan permusuhan kepada umat islam. Pada waktu yang sama, rencana bani nadir dan bani quraizah untuk membunuh rasulullah terbongkar dari arah yang tidak mereka sangka-sangka, karena mereka tidak mengira rasulullah akan bertindak cepat mengepung benteng mereka. Dan Allah menanamkan rasa takut ke dalam hati mereka, ketika rasulullah memberitahukan bahwa mereka akan diminta keluar dari madinah sehingga mereka dengan inisiatif sendiri memusnahkan rumah-rumah mereka dengan peralatan dan tangannya sendiri agar rumah-rumah itu tidak bisa digunakan oleh kaum muslim; dan rumah-rumah mereka pun dihancurkan oleh tangan orang-orang mukmin yang bertugas dalam operasi pembersihan ini. Maka ambillah pelajaran berharga dari peristiwa pengusiran kaum yahudi di madinah itu wahai orang-orang beriman yang mempunyai pandangan yang luas bahwa kehebatan benteng pertahanan musuh-Musuh Allah dan kerja sama mereka yang kuat bukan penghalang untuk bisa dikalahkan sehingga mereka merasakan kehinaan, terusir dari madinah."
  }
]