[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "10. Orang-orang beriman yang datang sesudah kaum Muhajirin dan Anshar angkatan pertama berkata, “Wahai Tuhan kami, ampunilah dosa-dosa kami. Ampunilah saudara-saudara kami seagama yang telah mendahului kami dalam beriman, dan jangan menjadikan di dalam hati kami hasad dan dengki kepada seorang pun dari orang-orang beriman. Wahai Tuhan kami, sesungguhnya Engkau merahmati hamba-hambaMu dengan rahmat yang luas di dunia dan akhirat. Dalam ayat ini terkandung dalil yang menunjukkan bahwa hendaklah setiap Muslim memuji para pendahulunya dengan kebaikan, mendoakan mereka, mencintai para sahabat Rasulullah, memuji mereka dan mendoakan semoga Allah meridhai mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Orang-orang yang datang sesudah mereka dan mengikuti mereka dengan baik hingga hari Kiamat, mereka berdoa, “Wahai Rabb kami, ampunilah kami dan saudara-saudara kami seagama yang telah mendahului kami dalam keimanan kepada Allah dan Rasul-Nya, dan janganlah Engkau jadikan di hati kami kedengkian terhadap seorang pun dari kalangan orang-orang yang beriman. Wahai Rabb kami, sesungguhnya Engkau Maha Penyantun dan Maha Penyayang kepada hamba-hamba-Mu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "10. Allah juga memuji orang-orang beriman yang ada di generasi setelah kaum Anshar dan Muhajirin. Mereka senantiasa memohon ampun dan berdoa bagi saudara-saudara mereka: “Ya Tuhan kami, ampunilah dosa-dosa kami, dan ampuni saudara-saudara kami seagama yang telah beriman sebelum kami. Dan janganlah Engkau masukkan kedengkian ke dalam hati kami terhadap orang yang beriman. Ya Tuhan kami, Engkau Maha Lembut dan Maha Pengasih terhadap orang-orang beriman.” Dan Allah mengabulkan doa mereka sebagaimana disebutkan dalam firman-Nya: وَنَزَعْنَا مَا فِى صُدُورِهِم مِّنْ غِلٍّ إِخْوَٰنًا عَلَىٰ سُرُرٍ مُّتَقَٰبِلِينَ Dan Kami lenyapkan segala rasa dendam yang berada dalam hati mereka, sedang mereka merasa bersaudara duduk berhadap-hadapan di atas dipan-dipan. [al-Hijr:47]."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. وَالَّذِينَ جَآءُو مِنۢ بَعْدِهِمْ (Dan orang-orang yang datang sesudah mereka) Mereka adalah para pengikut para sahabat hingga hari kiamat dalam kebaikan mereka. يَقُولُونَ رَبَّنَا اغْفِرْ لَنَا وَلِإِخْوٰنِنَا الَّذِينَ سَبَقُونَا بِالْإِيمٰنِ(mereka berdoa: “Ya Rabb kami, beri ampunlah kami dan saudara-saudara kami yang telah beriman lebih dulu dari kami) Yakni orang-orang yang mencintai kaum muhajirin dan anshar dan memohon ampun bagi mereka. وَلَا تَجْعَلْ فِى قُلُوبِنَا غِلًّا لِّلَّذِينَ ءَامَنُوا۟( dan janganlah Engkau membiarkan kedengkian dalam hati kami terhadap orang-orang yang beriman) Yakni tidak ada dalam hati mereka rasa benci, kemunafikan, atau hasad kepada mereka. Ini berarti mencakup para sahabat secara prioritas sebab mereka adalah orang-orang beriman yang paling mulia karena mereka adalah orang-orang yang paling pertama beriman. Maka barangsiapa yang mendapati dalam hatinya kebencian terhadap mereka seperti orang-orang syi’ah rafidhah, maka ia telah disesatkan oleh setan dan telah banyak bermaksiat kepada Allah karena memusuhi para kekasih-Nya dan orang-orang terbaik dari umat Nabi Muhammad; dan ia tidak mendapat hak untuk memperoleh bagian harta fa’i; termasuk juga orang yang mengolok-olok para sahabat atau mencaci dan menjelek-jelekkan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10. Harta fai’ juga diberikan kepada golongan ketiga, yaitu golong orang fakir yang datang sesudah kaum Muhajirin dan Anshar. Mereka adalah pengikut Muhajirin dan Anshar dengan baik sampai hari kiamat. Mereka berdoa: Wahai Tuhan kami, ampunkanlah dosa kami dan dosa saudara kami yang lebih dulu beriman. Jangan jadikan benci dan dengki bkersarang dalam hati kami kepada orang mukmin lain. Sesungguhnya Engkau Maha Penyantun terhadap hamba-Nya. Engkau yang menghilangkan pemicu turunnya bencana dan kesulitan. Engkau Maha Luas dalam Kasih-Mu kepada semua makhluk, dan Engkau Maha Meluaskan kebaikan dan anugerah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang datang sesudah mereka dan berdoa,“Ya Tuhan kami, ampunilah kami serta saudara-saudara kami yang telah beriman lebih dahulu daripada kami dan janganlah Engkau menjadikan dalam hati kami kedengkian} iri dan dengki {terhadap orang-orang yang beriman. Ya Tuhan kami, sesungguhnya Engkaulah Yang Maha Penyantun lagi Maha Penyayang”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "10. Kedua golongan mulia dan suci di atas adalah para sahabat yang mulia dan para imam bagi orang-orang utama. Mereka adalah sosok yang telah meraih predikat sebagai yang terdepan, nilai-nilai keutamaan dan sifat baik yang tidak bisa disaingi oleh orang-orang sebelum mereka. Mereka pun menjadi para pemimpin kaum Mukminin, Muslimin dan orang-orang bertakwa. Cukuplah bagi generasi setelah mereka mendapatkan kebaikan dengan berjalan di belakang mereka dan menjadikan petunjuk mereka sebagai pemimpin. Karena itulah Allah menyebut generasi-generasi setelah mereka, yaitu orang-orang yang mengikuti mereka dan seluruh orang yang ada setelah mereka seraya berfirman, “Dan orang-orang yang datang sesudah mereka,” yakni memberi nasihat untuk diri mereka sendiri dan seluruh kaum Muslimin, “Ya Rabb kami, beri ampunlah kami dan saudara-saudara kami yang telah beriman lebih dahulu dari kami.” Doa ini mencakup seluruh kaum Mukminin dari kalangan sahabat pendahulu dan orang-orang sebelum dan sesudah mereka. Inilah di antara salah satu keutamaan iman. Orang-orang Mukmin itu saling memberi manfaat bagi sesama dan saling mendoakan satu sama lain karena kebersamaan mereka dalam iman yang mengharuskan adanya ikatan persaudaraan di antara kaum Mukminin yang di antaranya adalah saling mendoakan satu sama lain dan saling mencintai satu lain. Karena itu, dalam doa ini Allah menafikan sifat dengki dari hati orang-orang yang beriman, baik yang sedikit maupun yang banyak. Karena sifat dengki tidak ada di hati, maka yang ada adalah kebalikannya, yaitu sifat saling mencintai, saling memberi pertolongan, nasihat dan lainnya untuk sesama Mukmin yang termasuk hak-hak orang yang beriman. Allah menyifati generasi-generasi setelah sahabat dengan keimanan, sebab perkataan orang-orang Mukmin itu, “dan saudara-saudara kami yang telah beriman lebih dahulu dari kami,” adalah dalil atas kebersamaan mereka dalam keimanan. Mereka adalah para pengikut sahabat dalam kaidah dan pondasi keimanan. Mereka adalah Ahlus Sunnah wal Jamaah di mana sifat sempurna ini hanya terwujud pada mereka. Allah juga menyebutkan sifat mereka dengan mengakui dosa-dosa serta meminta ampunan dari dosa-dosa serta saling memintakan ampunan satu sama lain serta usaha keras mereka untuk melenyapkan sifat dengki dan iri dari hati mereka terhadap sesama saudara seiman. Sebab doa mereka mengahruskan hal-hal yang telah kami sebut di atas yang mencakup rasa saling mencintai satu sama lain, mencintai orang lain seperti mencintai diri sendiri dan memberi nasihat pada orang lain, baik ketika saudaranya ada, tidak ada, masih hidup atau sudah mati. Ayat ini menunjukkan bahwa saling mendoakan satu sama lain adalah di antara salah satu hak kaum Mukminin. Kemudian doa mereka diakhiri dengan dua nama mulia yang menunjukkan sempurnanya rahmat Allah dan sempurnanya kasih sayang serta kebaikanNya terhadap kaum Mukminin yang di antaranya (bahkan termasuk yang paling agung) adalah memberi taufik pada kaum Mukminin untuk saling menunaikan hak sesama dan hak-hak hamba Allah. Ketiga golongan tersebut adalah golongan umat ini yang berhak mendapatkan harta rampasan perang yang alokasinya merujuk pada maslahat Islam. Mereka adalah kaum Muslimin dan ahli Islam. Semoga kita semua dimasukkan Allah dalam golongan mereka berkat karunia dan kemuliaanNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Hasyr ayat 10: Allah menyebutkan mereka yang datang setelah kaum muhajirin dan anshar yang mereka masuk islam setelah penaklukkan Mekkah, dan orang-orang yang mengikuti mereka dengan benar sampai hari kiamat, mereka bermunajat kepada Allah dengan berkata : Wahai Rabb kami, ampunilah kami dan saudara-saudara kami yang mereka mendahului kami dengan keimanan mereka, dan jangan engkau jadikan di hati-hati kami kebencian dan juga hasad, permusuhan, dan juga kemurkaan terhadap mereka saudara-saudara kami yang beriman, wahai Rabb kami, sesungguhnya Engkau Maha Penyantun lagi Maha Penyayang kepada mereka, maka kabulkan doa kami."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Untuk diri mereka dan seluruh kaum mukmin. Doa ini mengena kepada seluruh kaum mukmin yang terdahulu dari kalangan para sahabat, sebelum mereka dan setelah mereka. Hal ini termasuk keutamaan iman, dimana kaum mukmin dapat memperoleh manfaat dari keimanan sebagian mereka dari sebagian yang lain dan doa dari sebagian mereka kepada sebagian yang lain karena ikut serta dalam keimanan yang menghendaki untuk mengikat persaudaraan antara kaum mukmin, dimana di antara cabangnya adalah satu sama lain saling mendoakan dan saling mencintai. Oleh karena itulah, dalam doa ini Allah Subhaanahu wa Ta'aala menyebutkan penafian ghil (dengki dan dendam) baik sedikit maupun banyak, dimana apabila ghil itu tidak ada, maka akan tetap kebalikannya, yaitu kecintaan antara kaum mukmin, saling berwala (membela), menasihati dan lain sebagainya yang termasuk hak orang-orang mukmin. Dalam ayat ini Allah Subhaanahu wa Ta'aala menyifati generasi setelah sahabat dengan iman, karena ucapan mereka, “Yang telah beriman lebih dahulu dari kami” menunjukkan keikutsertaan mereka dengan keimanan, dan bahwa mereka mereka mengikuti para sahabat dalam beraqidah dan dalam beragama. Mereka ini adalah Ahlussunnah wal Jama’ah. Allah Subhaanahu wa Ta'aala juga menyifati mereka dengan mengakui dosa dan beristighfar darinya serta permohonan ampun mereka untuk saudara mereka, usaha mereka untuk menghilangkan rada iri dan dendam dari hati mereka terhadap saudara mereka kaum mukmin karena doa tersebut menghendaki demikian, dan agar mereka mencintai saudara mereka sebagaimana mereka mencintai diri mereka, bersikap tulus kepada mereka di waktu hadir maupun di waktu tidak hadir, di masa hidup maupun setelah mati. Ayat ini juga menunjukkan bahwa hal itu termasuk hak-hak kaum mukmin yang satu dengan yang lain. Selanjutnya mereka tutup doa mereka dengan dua nama Allah Yang Mulia yang menunjukkan sempurnanya rahmat Allah, sangat sayang, serta berbuat ihsan kepada mereka yang di antaranya adalah dengan memberi mereka taufiq untuk memenuhi hak Allah dan hak-hak hamba-Nya. Dalam ayat ini juga tersirat sikap yang harus kita lakukan terhadap para sahabat, yaitu mencintai mereka, mengucap taradhhiy (radhiyallahu 'anhum), menjaga lisan dari menjelekkan mereka, menyebutkan keutamaan mereka, menahan diri dari perselisihan yang terjadi di antara mereka, meyakini bahwa mereka tidak ma’shum dan bahwa perselisihan di antara mereka itu terjadi karena ijtihadnya, yang benar mendapatkan dua pahala dan yang salah mendapat satu pahala. Di samping itu, mereka (para sahabat) memiliki keutamaan dan kebaikan yang besar yang menghilangkan keburukan yang terjadi di antara mereka jika memang terjadi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hasyr Ayat 10",
    "description": "Sesudah menjelaskan keberhasilan muhajirin dan ansar membangun persaudaraan sejati atas dasar iman, Allah lalu menjelaskan karakter orang-orang beriman generasi sesudah mereka. Dan orang-orang beriman, berilmu, dan beramal saleh yang datang sesudah mereka dari generasi ke generasi hingga hari kiamat, mereka berdoa kepada Allah, 'ya tuhan kami, ampunilah dosa-dosa kami baik yang disengaja maupun yang tidak disengaja dan ampuni pula dosa-dosa saudara-saudara kami seiman yang telah beriman lebih dahulu dari kami, umat rasulullah maupun umat para nabi sebelumnya dan janganlah engkau tanamkan kedengkian dalam hati kami terhadap orang-orang yang beriman karena kedengkian itu menghapuskan amal saleh. Ya tuhan kami, sungguh, engkau maha penyantun kepada setiap hamba, maha penyayang kepada hamba yang beriman sehingga mereka mendapat kebaikan dunia dan akhirat. ' 11. Jika pada ayat sebelumnya, Allah menjelaskan persaudaraan sejati di antara muhajirin dan ansar dan sifat orang-orang beriman generasi sesudah mereka, pada ayat ini Allah menjelaskan sifat orang-orang munafik di madinah pada masa rasulullah. Tidakkah engkau memperhatikan orang-orang munafik seperti 'abdull'h bin ubay bin sal'l, wad'ah bin m'lik, suwaid, dan da'is yang berkata kepada saudara-saudaranya yang kafir di antara ahli kitab, yakni bani nadir yang sedang dikepung kaum muslim karena merencanakan untuk membunuh rasulullah, 'sungguh, jika kamu, wahai bani nadir, benar-benar diusir oleh Muhammad dari perkampungan kamu di madinah, niscaya kami pun akan keluar bersama kamu dari madinah sebagai bentuk solidaritas kami kepada anda; dan kami selama-lamanya tidak akan patuh kepada siapa pun demi kamu, yakni mendengar dan mematuhi perintah Muhammad; dan jika kamu diperangi Muhammad agar kamu keluar dari madinah, pasti kami akan membantumu melawan Muhammad. ' dan Allah menyaksikan, kebohongan janji orang-orang munafik terhadap bani nadir tersebut, baik sesudah maupun sebelum pengepungan kaum muslim terhadap bani nadir bahwa mereka, orang-orang munafik itu benar-benar pendusta, sebab janji mereka untuk menolong bani nadir itu tidak ditepati sehingga bani nadir menyerah kepada rasulullah untuk menerima hukuman diusir dari madinah."
  }
]