[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "11. Apakah kamu tidak melihat orang-orang munafik itu? Mereka berkata kepada saudara-saudara kafir mereka dari orang-orang Yahudi Bani an-Nadhir, “Bila Muhammad dan orang-orang yang bersamanya mengusir kalian dari negeri kalian, niscaya kami akan menyertai kalian. Kami tidak akan mendengar siapa pun yang meminta kami untuk tidak menolong kalian dan tidak keluar bersama kalian, niscaya kami membantu kalian melawan mereka.” Allah bersaksi bahwa sesungguhnya orang-orang munafik itu adalah orang-orang pendusta tentang apa yang mereka janjikan kepada orang-orang Yahudi Bani an-Nadhir itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Tidakkah engkau lihat -wahai Rasul- orang-orang yang menyembunyikan kekufuran dan menampakkan keimanan. Mereka berkata kepada saudara-saudara mereka dalam kekufuran dari kalangan orang-orang Yahudi, pengikut Taurat yang dipalsukan, “Tetaplah tinggal di rumah-rumah kalian, niscaya kami tidak akan menghinakan kalian, kami tidak akan menyerahkan kalian. Jika kaum muslimin mengeluarkan kalian dari rumah-rumah kalian, niscaya kami akan keluar bersama kalian sebagai bentuk tanggung jawab kami, dan kami tidak akan menaati seseorang yang ingin mencegah kami untuk keluar bersama kalian. Jika mereka memerangi kalian, niscaya kami akan membantu kalian melawan mereka.” Dan Allah menjadi saksi bahwa orang-orang munafik itu benar-benar pendusta dalam pengakuan mereka bahwa mereka akan keluar bersama orang-orang Yahudi jika kaum Yahudi diusir dan berperang bersama Yahudi jika kaum Yahudi diperangi."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "11. Hai Rasulullah, Tidakkah kamu melihat orang-orang munafik yang mendekatkan diri kepada saudara-saudara mereka dari kalangan Yahudi Bani Nadhir, dan memberi mereka janji dusta: “Sungguh jika Muhammad dan para sahabatnya mengeluarkan kalian dari tempat tinggal kalian, pasti kami akan keluar bersama kalian; dan kami tidak akan mentaati perintah Muhammad untuk memerangi kalian, dan kami tidak akan mendengar siapapun lagi yang memerintahkan untuk menghinakan kalian. Dan jika ada orang yang memerangi kalian, pasti kami akan menolong kalian.” Namun Allah bersaksi bahwa orang-orang munafik itu memberi janji dusta kepada Bani Nadhir. Ibnu Katsir berkata: Allah mengabarkan tentang orang-orang munafik seperti Abdullah bin Ubay dan semisalnya ketika mereka pergi menuju kaum Yahudi Bani Nadhir untuk menjanjikan mereka kesiapan memberi pertolongan; Allah berfirman: “Apakah kamu tidak memperhatikan orang-orang munafik yang berkata kepada saudara-saudara mereka yang kafir di antara ahli kitab: \"Sesungguhnya jika kamu diusir niscaya kamipun akan keluar bersamamu; dan kami selama-lamanya tidak akan patuh kepada siapapun untuk (menyusahkan) kamu, dan jika kamu diperangi pasti kami akan membantu kamu\". Kemudian Allah melanjutkan: “Dan Allah menyaksikan bahwa Sesungguhnya mereka benar-benar pendusta.” [al-Hasyr: 11]. Yakni mereka sungguh berdusta dalam janji itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "11. أَلَمْ تَرَ إِلَى الَّذِينَ نَافَقُوا۟ (Apakah kamu tidak memperhatikan orang-orang munafik) Mereka adalah Abdullah bin Ubay dan para sahabatnya, mereka mengirim surat kepada Bani Nadhir yang berbunyi: “Teguhkan diri kalian dan bertahanlah, karena kami tidak akan menyerahkan kalian, dan jika kalian diperangi maka kami akan berperang membela kalian, dan jika kalian diusir niscaya kami akan pergi bersama kalian. لَنَخْرُجَنَّ مَعَكُمْ (niscaya kamipun akan keluar bersamamu) Yakni kami akan keluar dari rumah kami untuk menemani kalian. وَلَا نُطِيعُ فِيكُمْ(dan kami tidak akan patuh untuk (menyusahkan) kamu) Yakni kami tidak akan patuh demi membela kalian. أَحَدًا(kepada siapapun) Yakni kepada siapapun yang ingin menghalangi kami untuk pergi bersama kalian. أَبَدًا(selama-lamanya) Meski dalam waktu yang lama. وَإِن قُوتِلْتُمْ لَنَنصُرَنَّكُمْ(dan jika kamu diperangi pasti kami akan membantu kamu) Yakni membantu kalian dalam melawan musuh kalian. Namun Allah membantah perkataan mereka dengan firman-Nya: وَاللهُ يَشْهَدُ إِنَّهُمْ لَكٰذِبُونَ(Dan Allah menyaksikan bahwa Sesungguhnya mereka benar-benar pendusta) Yakni mereka berdusta dalam janji yang mereka berikan kepada Bani Nadhir berupa kesiapan mereka untuk pergi bersama mereka dan menolong mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Wahai Nabi, tidakkah engkau memperhatikan orang-orang munafik yang menunjuk-nunjukkan keislaman mereka namun menyembunyikan kekafiran? Seperti Abdullah bin Ubay dan para temannya. Mereka berkata kepada teman kafir Yahudi mereka seperti Bani Nadhir dan lainnya: Demi Allah, jika kalian diusir dari kampung halaman kalian maka kami juga akan ikut bersama kalian. Kami tidak akan mematuhi perintah siapapun dari orang muslim untuk memerangi dan menelantarkan kalian. Apabila orang muslim memerangi kalian, maka kami akan membantu kalian. Allah telah bersaksi bahwa mereka adalah benar-benar pendusta atas perkataan mereka. Mereka juga sadar bahwa kelak itu semua tidak akan mereka lakukan. Assuddi berkata: Sekelompok Bani Quraidhah memeluk agama Islam, dan diantar mereka ada golongan orang munafik. Mereka berkata kepada bani Nadhir Jika kalian diusir... Maka turunlah ayat ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah kamu tidak memperhatikan orang-orang munafik. Mereka berkata kepada saudara-saudaranya yang ingkar di antara Ahlul kitab} saudara mereka yang ingkar dari orang-orang Yahudi Bani Nadhir {“Sungguh jika kalian diusir, kami pasti akan keluar bersama kalian dan kami selamanya tidak akan patuh kepada siapa pun demi kalian. Jika kalian diperangi, kami pasti menolong kalian” Allah bersaksi bahwa sesungguhnya mereka benar-benar orang-orang yang berdusta"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11. Kemudian Allah heran terhadap kondisi kaum munafik yang condong memberikan pertolongan dan loyalitas pada saudara-saudara mereka dari kalangan Ahli Kitab daripada menolong saudara-saudara mereka dari kalangan kaum Mukminin. “sesungguhnya jika kamu diusir, niscaya kami pun akan keluar bersama kamu; dan kami selama-lamanya tidak akan patuh kepada siapa pun untuk (menyusahkan) kamu,” maksudnya kami tidak akan menaati orang yang tidak memberi pertolongan pada kalian yang akan merendahkan dan menakutkan kami. “Dan jika kamu diperangi, pasti kami akan membantu kamu.’ Dan Allah menyaksikan, bahwa sesungguhnya mereka benar-benar pendusta” dalam janji ini yang membuat teman-teman mereka terpedaya, tidak lebih dari itu karena berdusta adalah sifat mereka. Menipu dan mengelabui sesuatu yang lekat dalam diri mereka, dan kemunafikan dan sikap pengecut adalah sifat yang selalu menyertai mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Hasyr ayat 11: Allah mengisahkan kisah Abdullah bin Ubay dan para pengikutnya dari orang-orang munafik yang mereka dengan orang-orang yahudi ada persahabatan dan hubungan, Allah berkata : Tidakkah engkau takjub wahai Nabi Allah atas urusan mereka yaitu orang-orang munafik, yang mereka menampakkan perselisihan dengan apa yang telah mereka sembunyikan !? Mereka (yahudi bani quraidzah dan nadhir) mengatakan kufur dengan kerisalahan Muhammad ﷺ; Mereka berkata : Sungguh jika kalian diusir maka kami juga akan ikut keluar bersama kalian, kami tidak akan taat kepada siapapun yang tidak menolong kalian, karna kami akan menolong kalian jika kalian diperangi dan direndahkan, dan jika kalian saling berperang maka kami akan membantu kalian. Sungguh Allah yang menjadi saksi bahwa orang-orang munafik ini pembohong atas apa yang telah mereka katakan dan atas apa yang telah mereka seru."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala heran terhadap keadaan kaum munafik yang memberikan semangat kepada saudara mereka dari kalangan Ahli Kitab untuk menolong dan membela mereka melawan kaum mukmin. Maksudnya, Bani Nadhir. Dalam janji mereka itu. Hal ini tidaklah mengherankan, karena dusta menjadi sifat mereka, menipu menjadi keseharian mereka, kemunafikan dan pengecut menjadi kebiasaan mereka. Oleh karena itu, Allah mendustakan mereka dengan firman-Nya di atas dan menerangkan kenyataan yang akan terjadi pada ayat selanjutnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hasyr Ayat 11",
    "description": "Jika pada ayat sebelumnya, Allah menjelaskan persaudaraan sejati di antara muhajirin dan ansar dan sifat orang-orang beriman generasi sesudah mereka, pada ayat ini Allah menjelaskan sifat orang-orang munafik di madinah pada masa rasulullah. Tidakkah engkau memperhatikan orang-orang munafik seperti 'abdull'h bin ubay bin sal'l, wad'ah bin m'lik, suwaid, dan da'is yang berkata kepada saudara-saudaranya yang kafir di antara ahli kitab, yakni bani nadir yang sedang dikepung kaum muslim karena merencanakan untuk membunuh rasulullah, 'sungguh, jika kamu, wahai bani nadir, benar-benar diusir oleh Muhammad dari perkampungan kamu di madinah, niscaya kami pun akan keluar bersama kamu dari madinah sebagai bentuk solidaritas kami kepada anda; dan kami selama-lamanya tidak akan patuh kepada siapa pun demi kamu, yakni mendengar dan mematuhi perintah Muhammad; dan jika kamu diperangi Muhammad agar kamu keluar dari madinah, pasti kami akan membantumu melawan Muhammad. ' dan Allah menyaksikan, kebohongan janji orang-orang munafik terhadap bani nadir tersebut, baik sesudah maupun sebelum pengepungan kaum muslim terhadap bani nadir bahwa mereka, orang-orang munafik itu benar-benar pendusta, sebab janji mereka untuk menolong bani nadir itu tidak ditepati sehingga bani nadir menyerah kepada rasulullah untuk menerima hukuman diusir dari madinah. 12. Orang-orang munafik itu adalah benar-benar pendusta. Allah menjelaskan kebohongan janji mereka terhadap bani nadir. Sungguh, jika mereka, bani nadir, diusir, dari madinah, orang-orang munafik itu tidak akan keluar dari madinah bersama mereka; dan jika mereka, bani nadir, diperangi oleh kaum muslim karena mereka berkhianat; mereka juga, orang-orang munafik itu, tidak akan menolong sekutu-Nya, bani nadir; dan kalau pun mereka menolongnya dengan mengerahkan pasukan, pastilah mereka, orang-orang munafik itu, akan berpaling lari ke belakang, berbalik arah untuk kembali ke tempat semula sehingga bantuan pasukan itu tidak terjadi. Kemudian nasib mereka di akhirat ketika mereka membutuhkan pertolongan Allah tidak akan mendapat pertolongan dalam bentuk apa pun sehingga mereka kekal dalam kerak neraka."
  }
]