[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "12. Bila orang-orang Yahudi itu diusir dari Madinah, orang-orang munafik tidak akan ikut bersama mereka. Bila orang-orang Yahudi itu diperangi, orang-orang munafik tidak akan membela mereka sebagaimana yang mereka janjikan. Bila mereka membantu, niscaya mereka akan lari tunggang langgang, kemudian Allah tidak akan menolong mereka, sebaliknya membiarkan dan menghinakan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Jika kaum muslimin mengusir orang-orang Yahudi maka orang-orang munafik tidak keluar bersama orang-orang Yahudi. Jika kaum muslimin memerangi orang-orang Yahudi maka orang-orang munafik tidak akan menolong mereka. Jika kaum munafik menolong Yahudi dan membantu mereka dalam melawan kaum muslimin, niscaya orang-orang munafik itu melarikan diri terbirit-birit dari mereka, kemudian kaum munafik itu tidak mendapat pertolongan, justru Allah menghinakan dan merendahkan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "12. Sungguh jika orang-orang Yahudi diusir dari tempat tinggal mereka, niscaya orang-orang munafik itu tidak akan keluar bersama mereka; dan sungguh jika orang-orang Yahudi diperangi niscaya orang-orang munafik itu tidak akan ikut berperang membela mereka; dan jikapun mereka berperang membela mereka, niscaya mereka akan segera lari dari peperangan, sehingga pertolongan mereka tidak berguna lagi."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "12. لَئِنْ أُخْرِجُوا۟ لَا يَخْرُجُونَ مَعَهُمْ وَلَئِن قُوتِلُوا۟ لَا يَنصُرُونَهُمْ (Sesungguhnya jika mereka diusir, orang-orang munafik itu tidak akan keluar bersama mereka, dan sesungguhnya jika mereka diperangi, niscaya mereka tidak akan menolongnya) Dan itulah yang kenyataannya, orang-orang munafik tidak mau keluar bersama orang-orang Yahudi yang diusir, yaitu Bani Nadhir dan orang-orang yang bersama mereka; orang-orang munafik itu juga tidak menolong orang-orang Yahudi yang diperangi, yaitu Bani Quraidzah dan penduduk Khaibar. وَلَئِن نَّصَرُوهُمْ لَيُوَلُّنَّ الْأَدْبٰرَ(sesungguhnya jika mereka menolongnya, niscaya mereka akan berpaling lari ke belakang) Yakni mereka akan kalah. ثُمَّ لَا يُنصَرُونَ (kemudian mereka tidak akan mendapat pertolongan) Yakni orang-orang munafik tidak akan menang setelah itu, namun Allah akan menghinakan mereka; dan kemunafikan mereka tidak akan berguna."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12. Demi Allah, apabila mereka diusir dari kampung halaman maka orang munafik itu tidak akan ikut bersama mereka. Juga jika mereka diperangi, mereka tidak akan pernah membantu mereka, sekalipun mereka dipaksa membantu pasti mereka terpaksa. Mereka akan kabur dan lari dan tertangkap. Kemudian mereka tidak akan menemukan penolong dari azab Allah. Allah akan menghinakan mereka, dan pertolongan orang munafik tidak akan berguna sama sekali"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika mereka benar-benar diusir, orang-orang itu tidak akan keluar bersama mereka. Jika mereka benar-benar diperangi, orang-orang itu tidak akan menolong mereka. Sekiranya mereka menolongnya} sekiranya mereka mampu untuk memberi pertolongan {niscaya orang-orang itu akan berpaling ke belakang, kemudian mereka tidak akan ditolong"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "12. karena itulah Allah mendustakan mereka dengan FirmanNya yang diberitahukan pada orang yang menjawab sesuai dengan Firman Allah, “Sesungguhnya jika mereka diusir,” dari negeri mereka, baik dengan cara pengusiran atau pengosongan, “orang-orang munafik itu tiada akan keluar bersama mereka,” karena kecintaan pada negeri mereka dan ketidaksabaran mereka dalam berperang, serta tidak menepati janji, “dan sungguh jika mereka diperangi; niscaya mereka tiada akan menolong mereka,” tapi mereka akan dipenuhi oleh sifat pengecut dan kegagalan serta akan berkhianat pada teman-teman mereka pada saat mereka diperlukan. “Dan sungguh jika mereka menolongnya,” andai saja demikian, “niscaya mereka akan berpaling lari ke belakang, kemudian mereka tiada akan mendapat pertolongan.” Maksudnya, mereka akan lari dari peperangan, dan tidak memberikan pertolongan, dan mereka pun tidak mendapatkan pertolongan dari Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Hasyr ayat 12: Sungguh Allah mendustkan mereka, dan mengabarkan bahwa seandainya yahudi itu dikeluarkan dari Madinah, maka mereka (orang-orang munafik) tidak akan mengikutinya, dan juga sebaliknya; Tidaklah orang-orang munafik yang dikeluarkan dan yahudi juga ikut keluar (dari bani nadhir), dan seandainya pun yahudi terbunuh. Orang-orang munafik tidak akan membenarkan janji mereka akan setia bersama temannya, sebaliknya juga demikian; Tidaklah bersama bani quraidzah ketika mereka terbunuh setelahnya. Dan yang sewajibnya (sebagaimana perkatan mereka) berdiri bersama mereka ketika berperang; Mereka tidak akan mungkin kokoh (dengan ucapan mereka), karena niscaya mereka akan berpaling dan tidak akan menolong dalam peperangan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Karena kecintaan mereka terhadap kampung halaman mereka, tidak sabar untuk berperang dan selalu mengingkari janji. Karena sikap pengecut dan penakut menguasai mereka. Oleh karena itu, mereka akan membiarkan saudara-saudara mereka dari kalangan Ahli Kitab. Yakni jika ditakdirkan mereka mau menolongnya, maka mereka akan lari ke belakang. Yaitu orang-orang Yahudi yang menjadi saudara-saudara mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hasyr Ayat 12",
    "description": "Orang-orang munafik itu adalah benar-benar pendusta. Allah menjelaskan kebohongan janji mereka terhadap bani nadir. Sungguh, jika mereka, bani nadir, diusir, dari madinah, orang-orang munafik itu tidak akan keluar dari madinah bersama mereka; dan jika mereka, bani nadir, diperangi oleh kaum muslim karena mereka berkhianat; mereka juga, orang-orang munafik itu, tidak akan menolong sekutu-Nya, bani nadir; dan kalau pun mereka menolongnya dengan mengerahkan pasukan, pastilah mereka, orang-orang munafik itu, akan berpaling lari ke belakang, berbalik arah untuk kembali ke tempat semula sehingga bantuan pasukan itu tidak terjadi. Kemudian nasib mereka di akhirat ketika mereka membutuhkan pertolongan Allah tidak akan mendapat pertolongan dalam bentuk apa pun sehingga mereka kekal dalam kerak neraka. 13. Orang munafik itu bersikap demikian karena kamu, kaum muslim, benar-benar lebih ditakuti dalam hati mereka, orang-orang munafik, daripada Allah. Mereka sangat takut kekufurannya diketahui oleh kaum muslim. Jika mereka benar-benar membantu bani nadir, maka permusuhannya kepada kaum muslim terbongkar. Yang demikian itu, sikap orang munafik yang lebih takut kepada manusia daripada takut kepada Allah, karena mereka orang-orang yang tidak mengerti bahwa mereka hanya bisa bersembunyi dari manusia, tetapi tidak bisa bersembunyi dari Allah."
  }
]