[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "13. Ketakutan orang-orang Yahudi dan orang-orang munafik kepada kalian (wahai orang-orang beriman) lebih besar dan lebih berat dalam dada mereka daripada ketakutan mereka kepada Allah. Hal itu karena mereka adalah orang-orang yang tidak mengerti keagungan Allah dan iman kepadaNya, serta tidak takut kepada azabNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "13. Sesungguhnya kalian -wahai orang-orang yang beriman- lebih ditakuti dalam hati orang-orang munafik dan Yahudi daripada Allah. Hal itu -besarnya rasa takut mereka terhadap kalian dan minimnya rasa takut mereka terhadap Allah- dikarenakan mereka itu kaum yang tidak paham dan tidak mengerti. Sebab jika mereka mengerti, niscaya mereka tahu bahwa Allah lebih pantas untuk ditakuti dan disegani, dan Dia lah yang menjadikan kalian menang atas mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "13. Hai orang-orang beriman, Sungguh kalian lebih berwibawa dan menakutkan di hati orang-orang munafik dan orang-orang Yahudi daripada ketakutan mereka kepada Allah. Ketakutan yang besar itu karena mereka tidak mengetahui kekuasaan dan siksaan Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "13. لَأَنتُمْ أَشَدُّ رَهْبَةً فِى صُدُورِهِم مِّنَ اللهِ ۚ (Sesungguhnya kamu dalam hati mereka lebih ditakuti daripada Allah) Yakni, wahai kaum muslimin, kalian ketakutan dalam hati orang-orang munafik kepada kalian lebih besar daripada ketakutan mereka kepada Allah. ذٰلِكَ بِأَنَّهُمْ قَوْمٌ لَّا يَفْقَهُونَ(Yang demikian itu karena mereka adalah kaum yang tidak mengerti) Seandainya mereka memahami niscaya mereka akan mengerti bahwa Allah-lah yang menguasai mereka, sehingga Dia lebih layak untuk ditakuti daripada kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13. Mereka orang munafik dan Yahudi bahkan lebih takut pada kalian kaum muslim, dari pada kepada Allah. Itu disebabkan karena mereka tidak tahu keagungan Allah, sehingga mereka lebih takut pada kaum muslim"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kalian benar-benar lebih ditakuti di dalam hati mereka daripada Allah. Hal itu disebabkan mereka kaum yang tidak mengerti"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "13. Penyebab yang mendorong mereka melakukan hal itu adalah karena kalian wahai orang-orang yang beriman, “dalam hati mereka lebih ditakuti daripada Allah.” Mereka lebih takut pada kalian melebihi Allah. Mereka lebih mengutamakan rasa takut pada makhluk yang sama sekali tidak memiliki kekuasaan atas diri sendiri dan juga atas orang lain, baik memberi manfaat atau mendatangkan mara bahaya daripada rasa takut pada Khaliq yang di TanganNya-lah kekuasaan mendatangkan mara bahaya, manfaat, memberi, dan menahan. “Yang demikian itu karena mereka adalah kaum yang tiada mengerti.” Mereka tidak mengerti tingkatan berbagai hal, mereka juga tidak mengetahui hakikat segala sesuatu. Mereka tidak bisa memikirkan akibat perbuatan. Seharusnya, puncak pemahaman adalah lebih mengutamakan rasa takut, pengharapan, cinta untuk Allah daripada yang selainNya. Yang lain hanya sebagai pengikut saja."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Hasyr ayat 13: Ketahuilah wahai seluruh kaum muslimin, sungguh kalian adalah orang yang paling takut daripada mereka orang-orang munafik dan yahudi kepada Allah yang menciptakan mereka dan menjadikan mereka ada. Dan ketakutan mereka kepada utusan Allah ﷺ dan para sahabatnya lebih ditakuti daripada ketakutan kepada Allah; Karena mereka adalah kaum yang tidak paham akan kekuasaan Allah yang besar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sebab yang menjadi mereka seperti itu adalah karena kaum mukmin lebih ditakuti mereka daripada Allah Subhaanahu wa Ta'aala. Mereka mengutamakan takut kepada makhluk yang tidak berkuasa memberikan manfaat dan menimpakana madharrat daripada takut kepada Allah Al Khaliq yang di Tangan-Nya manfaat dan madharrat, memberi dan mencegah. Tingkatan-tingkatan perkara. Demikian pula tidak mengetahui hakikat segala sesuatu, tidak tergambar oleh mereka akibatnya. Sesungguhnya orang yang mengerti adalah orang yang takutnya, harapnya dan cintanya kepada Allah Subhaanahu wa Ta'aala di atas segala sesuatu, bahkan yang lain mengikutinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hasyr Ayat 13",
    "description": "Orang munafik itu bersikap demikian karena kamu, kaum muslim, benar-benar lebih ditakuti dalam hati mereka, orang-orang munafik, daripada Allah. Mereka sangat takut kekufurannya diketahui oleh kaum muslim. Jika mereka benar-benar membantu bani nadir, maka permusuhannya kepada kaum muslim terbongkar. Yang demikian itu, sikap orang munafik yang lebih takut kepada manusia daripada takut kepada Allah, karena mereka orang-orang yang tidak mengerti bahwa mereka hanya bisa bersembunyi dari manusia, tetapi tidak bisa bersembunyi dari Allah. 14. Karena lebih takut kepada kaum muslim daripada kepada Allah, mereka, orang-orang munafik itu, tidak akan pernah berani memerangi kamu secara terbuka bersama-sama menggabungkan dua kekuatan, yaitu orang-orang munafik bani 'auf dan yahudi bani nadir, kecuali di negeri-negeri yang berbenteng agar mereka bisa berlindung di dalamnya atau di balik tembok dengan cara bergerilya. Permusuhan antara sesama mereka orang-orang munafik bani 'auf dan antara bani 'auf dengan yahudi bani nadir sangat hebat. Kamu, kaum muslim, jika melihat mereka sepintas, akan mengira bahwa mereka itu bersatu, padahal jika kamu memperhatikan keadaan mereka lebih dalam, kamu akan menemukan bahwa hati mereka terpecah belah. Yang demikian itu, perbedaan penampilan luar dan keadaan hati mereka, karena mereka orang-orang yang tidak mengerti bahwa inti kekuatan persatuan dan kesatuan itu tidak terletak pada penampilan, tetapi pada kesatuan rasa dan keterpautan hati dalam kekuatan iman."
  }
]