[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "14. Orang-orang Yahudi tidak menghadapi kalian dalam perang bersama-sama kecuali dalam sebuah perkampungan di balik benteng dengan dinding dan paritnya atau di belakang tembok yang melindungi mereka, karena mereka adalah orang-orang penakut, ketakutan bercokol kuat dalam jiwa mereka, dan karena permusuhan di antara mereka keras; kalian mengira mereka bersatu di atas satu kalimat, padahal hati mereka terpecah-pecah. Hal itu karena mereka adalah kaum yang tidak mengerti perintah Allah dan tidak merenungkan ayat-ayatNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Tidaklah orang-orang Yahudi dan orang-orang munafik memerangi kalian -wahai orang-orang yang beriman- secara bersama-sama, kecuali di tempat-tempat yang dibentengi dengan pagar-pagar atau di belakang tembok-tembok. Mereka tidak mampu menghadapi kalian karena rasa takut mereka. Permusuhan di antara mereka itu sangat kuat karena adanya pertikaian di antara mereka. Kamu mengira bahwa mereka sepakat dalam satu kata dan satu barisan. Kenyataannya hati mereka terpecah belah dan berselisih. Perselisihan dan pertikaian itu terjadi karena mereka tidak mengerti, sebab jika mereka mengerti niscaya mereka akan mengetahui kebenaran dan mengikutinya serta tidak berselisih tentangnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "14-15. Hai orang-orang beriman, orang-orang Yahudi tidak akan bersatu padu untuk memerangi kalian kecuali ketika mereka berada di tempat yang terlindungi oleh pagar-pagar dan parit, atau dari balik dinding untuk bersembunyi. Permusuhan di antara mereka sangat sengit; kamu mengira mereka bersatu, akan tetapi sebenarnya hati mereka terpecah belah. Keadaan mereka ini karena mereka tidak mengikuti kebenaran. Keadaan Bani Nadhir yang terusir dan terhina ini seperti keadaan orang-orang kafir Makkah pada perang Badar dan orang-orang Yahudi Bani Qainuqa’, mereka telah merasakan akibat dosa-dosa mereka, dan mereka akan mendapat azab yang menyakitkan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "14. لَا يُقٰتِلُونَكُمْ جَمِيعًا (Mereka tidak akan memerangi kamu dalam keadaan bersatu padu) Yakni tidak bersatu untuk memerangi kalian. إِلَّا فِى قُرًى مُّحَصَّنَة(kecuali dalam kampung-kampung yang berbenteng) Yakni dalam gang-gang dan pemukiman. أَوْ مِن وَرَآءِ جُدُرٍۭ ۚ( atau di balik tembok) Yakni di belakang tembok agar dapat melindungi mereka, hal ini karena sifat pengecut dan penakut yang mereka miliki. بَأْسُهُم بَيْنَهُمْ شَدِيدٌ ۚ( Permusuhan antara sesama mereka adalah sangat hebat) Yakni mereka saling berselisih dan berlaku keras satu sama lain. تَحْسَبُهُمْ جَمِيعًا وَقُلُوبُهُمْ شَتَّىٰ ۚ( Kamu kira mereka itu bersatu, sedang hati mereka berpecah belah) Yakni persatuan mereka hanya penampakan pada diri mereka saja, sedangkan hati mereka saling berselisih, baik itu perselisihan mereka dalam pendapat maupun dalam hawa nafsu mereka. ذٰلِكَ بِأَنَّهُمْ قَوْمٌ لَّا يَعْقِلُونَ(Yang demikian itu karena sesungguhnya mereka adalah kaum yang tidak mengerti) Seandainya mereka memikirkan niscaya mereka akan mengetahui kebenaran dan mengikutinya sehingga mereka dapat bersatu dan tidak berpecah belah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14. Mereka orang Yahudi tidak akan memerangimu secara bersama-sama dengan kelompok mereka, kecuali pada negeri yang dipenuhi dengan benteng dan parit-parit atau dari balik tembok karena besarnya rasa takut mereka. Mereka orang Yahudi saling memusuhi dan terpecah belah satu sama lain dengan sangat dahsyat. Karena Yahudi mempunyai agama sendiri sedangkan orang kafir adalah orang-orang yang musyrik. Kau sangka bahwa mereka adalah kelompok yang bersatu dan mufakat, padahal hati mereka terpecah belah karena perbedaan keyakinan dan kehendak mereka yang berubah-ubah. Juga karena mereka tidak mengerti kebenaran hakiki dan juga tidak tahu apa yang bermanfaat bagi mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka tidak akan memerangi kalian secara bersama-sama, kecuali di negeri-negeri yang memiliki benteng} yang dilindungi oleh benteng atau parit {atau di balik tembok} tembok {Permusuhan} peperangan {di antara mereka sangat hebat. Kamu mengira bahwa mereka itu bersatu, namun hati mereka terpecah belah} terpecah belah dan bertentangan {Hal itu karena mereka adalah kaum yang tidak berakal"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "14. “Mereka tiada akan memerangi kamu dalam keadaan bersatu padu,” maksudnya, dalam keadaan bersatu, “kecuali dalam kampung-kampung yang berbenteng atau di balik tembok.” Maksudnya, mereka tidak kuat memerangi kalian dan tidak bertekad untuk itu kecuali ketika mereka berada di dalam kawasan-kawasan yang memiliki benteng di dalam perkampungan atau ketika mereka berada di balik tembok dan benteng. ketika mereka berada dalam kondisi seperti itu, mereka akan mendapatkan perlindungan dan pertahanan di balik benteng dan tembok, dan bukan karena keberanian mereka. Ini termasuk celaan terbesar bagi mereka. “Permusuhan antara sesama mereka adalah sangat hebat.” Kelemahan mereka tidak terdapat pada diri dan kekuatan tetapi kelemahan mereka dikarenakan lemahnya iman serta tidak adanya kesatuan di antara mereka, karena itu Allah berfirman, “Kalian mengira mereka itu bersatu,” ketika kalian melihat mereka berkumpul dan saling bantu membantu, “sedang hati mereka berpecah belah.” Maksudnya, hati mereka saling membenci dan terpecah belah. “Yang demikian itu,” yang mewajibkan mereka memiliki sifat-sifat sebagaimana telah disebutkan sebelumnya, “Karena sesungguhnya mereka adalah kaum yang tiada mengerti.” Maksudnya, mereka tidak memiliki akal dan pikiran. Sebab andai mereka memiliki akal tentu lebih mengedepankan yang harus lebih dikedepankan daripada lainnya, tentu mereka tidak merelakan hal terburuk untuk diri mereka dan tentu mereka bersatu padu. Sehingga mereka akan saling menolong satu sama lain untuk kemaslahatan dan kepentingan mereka, baik dalam urusan dunia maupun akhirat. Hingga mereka pun seperti layaknya orang-orang yang mendapatkan kehinaan dari kalangan Ahli kitab, orang-orang yang dikalahkan oleh Allah melalui tangan utusanNya hingga mereka mengenyam kehinaan dalam kehidupan dunia dan tidak memberikan pertolongan pada orang yang mereka janjikan akan ditolong."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Hasyr ayat 14: Allah menyebutkan diantara sifat-sifat yahudi dan orang-orang munafik, yaitu memiliki sifat pecundang (penakut), Allah mengabarkan bahwa mereka takut menghadapi kaum muslimin (berhadap-hadapan) kalo sedang tidak berkumpul dalam satu perkumpulan dengan teman-temannya, yaitu kecuali mereka dalam satu kota yang telah dikelilingi benteng-benteng dengan bangunan kokoh dan terdapat parit-parit yang mengelilinginya, atau ada prajurit yang menjaga yang mereka bersembunyi di belakangnya karena sebab sifat penakutnya dan pecundang. Allah menjelaskan penyebab dari sifat pecundang dan takut ini disebabkan mereka ada musuh bagi sebagian yang lain; Dengan itu orang yang melihatnya merasa bahwa mereka bersatu dan satu visi, akan tetapi hakikatnya hati-hati mereka tercerai-berai, juga terdapat perbedaan dan tertekan disebabkan mereka adalah kaum yang tidak berpikir sesuatupun akan kebaikan diri mereka. Maka jika tertekan (depresi) hati mereka, akan muncul rasa takut dan bertambah rasa takutnya. Dan seandainya mereka berakal, sungguh mereka akan menyimpang dari kebenaran dan mengikuti kebenaran itu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni mereka tidak akan siap memerangi kamu kecuali jika mereka di negeri-negeri yang berbenteng atau di balik tembok, karena hal itu biasanya dapat melindungi mereka karena mereka bersandar kepada benteng dan tembok; bukan karena keberanian mereka. Hal ini termasuk celaan yang besar untuk mereka. Saling membenci dan bermusuhan. Kalau seandainya mereka mengerti dan memiliki akal tentu mereka akan mengutamakan yang lebih utama daripada yang kalah utama, mereka tidak akan ridha dengan bagian yang paling kurang dan tentu mereka bersatu, sehingga mereka akan saling tolong-menolong untuk maslahat bersama baik agama maupun dunia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hasyr Ayat 14",
    "description": "Karena lebih takut kepada kaum muslim daripada kepada Allah, mereka, orang-orang munafik itu, tidak akan pernah berani memerangi kamu secara terbuka bersama-sama menggabungkan dua kekuatan, yaitu orang-orang munafik bani 'auf dan yahudi bani nadir, kecuali di negeri-negeri yang berbenteng agar mereka bisa berlindung di dalamnya atau di balik tembok dengan cara bergerilya. Permusuhan antara sesama mereka orang-orang munafik bani 'auf dan antara bani 'auf dengan yahudi bani nadir sangat hebat. Kamu, kaum muslim, jika melihat mereka sepintas, akan mengira bahwa mereka itu bersatu, padahal jika kamu memperhatikan keadaan mereka lebih dalam, kamu akan menemukan bahwa hati mereka terpecah belah. Yang demikian itu, perbedaan penampilan luar dan keadaan hati mereka, karena mereka orang-orang yang tidak mengerti bahwa inti kekuatan persatuan dan kesatuan itu tidak terletak pada penampilan, tetapi pada kesatuan rasa dan keterpautan hati dalam kekuatan iman. 15. Pada awal surah ini dijelaskan bahwa bani qainuqa' diusir dari madinah pada hari sabtu bulan syawal, 20 bulan setelah nabi hijrah, karena mengkhianati perjanjian damai, menganiaya dan membunuh kaum muslim serta mengganggu keamanan kota madinah. Melalui ayat ini Allah menjelaskan nasib bani nadir di madinah seperti nasib orang-orang yang sebelum mereka, bani qainuqa', diusir dari madinah karena merencanakan pembunuhan rasulullah. Peristiwa ini terjadi belum lama berselang, tidak lama setelah perang badar. Rasulullah mengepung benteng tempat mereka bersembunyi; menebang pohon kurma yang berada di dekat benteng dan membakarnya sehingga mereka terpaksa keluar dari benteng tersebut dan diusir dari madinah. Dengan demikian, mereka telah merasakan akibat buruk perbuatan mereka mengkhianati perjanjian damai disebabkan perbuatan mereka sendiri, merencanakan pembunuhan rasulullah. Dan di akhirat, mereka akan mendapat azab yang pedih, kekal selama-lamanya di dalam neraka."
  }
]