[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "15. Perumpamaan orang-orang Yahudi dan apa yang menimpa mereka itu adalah seperti orang-orang kafir Quraisy dalam Perang Badar dan orang-orang Yahudi Bani Qainuqa’, mereka telah mencicipi akibat buruk dari kekafiran mereka dan permusuhan mereka kepada Rasulullah di dunia, dan di akhirat mereka akan mendapatkan azab yang pedih dan menyakitkan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Permisalan orang-orang Yahudi di dalam kekufuran mereka dan siksa yang menimpa mereka seperti orang-orang sebelum mereka dari kalangan orang-orang musyrik Makkah belum lama berselang. Mereka merasakan keburukan akibat kekufuran mereka; ada yang terbunuh dan ada yang tertawan pada perang Badar, dan bagi mereka siksa yang menyakitkan pada hari Kiamat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15. كَمَثَلِ الَّذِينَ مِن قَبْلِهِمْ ((Mereka adalah) seperti orang-orang sebelum mereka) Yaitu orang-orang musyrik. قَرِيبًا ۖ( yang belum lama) Yakni pada waktu yang belum lama. ذَاقُوا۟ وَبَالَ أَمْرِهِمْ(mereka telah merasai akibat buruk dari perbuatan mereka) Yakni akibat buruk dari kekafiran mereka di dunia dengan terbunuh pada perang Badar, dan perang ini terjadi enam bulan sebelum perang Bani Nadhir."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "15. Mereka (Yahudi) dan orang munafik seperti orang musyrik sebelum mereka yang dibinasakan dan diazab tidak lama berselang dalam medan Badr enam sebelum mereka diusir. Mereka merasakan balasan atas kekufuran mereka di dunia seperti dibinasakan dan lain-lain. Bagi mereka azab yang pedih di akhirat. Alwabal adalah bencana yang amat dahsyat. Diantaranya adalah hujan yang membahayakan atau menyakitkan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Seperti orang-orang sebelum mereka} perumpamaan orang-orang Yahudi itu seperti orang-orang kafir Quraisy pada perang Badar {yang belum lama. Mereka telah merasakan akibat buruk perbuatan mereka} kesudahan yang buruk dari kekufuran mereka {Bagi mereka itu azab yang pedih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "15. “(Mereka adalah) seperti orang-orang Yahudi yang belum lama sebelum mereka,” yakni kaum kafir Quraisy yang setan menampakan indah perbuatan-perbuatan mereka, dan Dia berkata \"Dan ketika syaitan menjadikan mereka memandang baik pekerjaan mereka dan mengatakan: \"Tidak ada seorang manusiapun yang dapat menang terhadapmu pada hari ini, dan sesungguhnya saya ini adalah pelindungmu\". Maka tatkala kedua pasukan itu telah dapat saling lihat melihat (berhadapan), syaitan itu balik ke belakang seraya berkata: \"Sesungguhnya saya berlepas diri daripada kamu, sesungguhnya saya dapat melihat apa yang kamu sekalian tidak dapat melihat; sesungguhnya saya takut kepada Allah\". Dan Allah sangat keras siksa-Nya. \" –Al anfal: 48 Mereka pun tertipu dan menipu orang lain. Mereka adalah orang-orang yang sama sekali tidak bisa memberikan manfaat sedikit pun dan tidak bisa menangkal siksaan mereka. Hingga tibalah peristiwa badar dengan segenap kesombongan dan kebanggan mereka. Mereka mengira bisa menuntaskan angan-angan mereka terhadap Rasulullah dan kaum Mukminin. Ternyata, Allah memberi pertolongan pada RasulNya dan kaum Mukminin. Para pembesar dan antek-antek kaum kafir Quraisy dibunuh dan ditawan. Ada juga yang melarikan diri. Dengan demikian, mereka merasakan akibat buruk perbuatan mereka dan ujung dari kesyirikan serta kekejian mereka. Ini yang berlaku di dunia, “dan bagi mereka,” siksaan Neraka di akhirat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Hasyr ayat 15: Ketahuilah wahai Nabi Allah, permisalan mereka (yahudi) dari bani nadhir adalah yang mengundang adzab Allah; Semisal dengan mereka dari kafir quraisy, yang mereka ketika di perang badr ditimpakan kekalahan, dan semisal dengan yahudi dari bani qaynuqa’ yang dikeluarkan dari Madinah disebabkan karena mereka berkhianat; Yang mereka dikeluarkan sebelum bani nadhir dengan rentang waktu yang tidak lama. Maka mereka semua ini telah merasakan hukuman akibat kekufuran mereka dan permusuhan mereka kepada Rasul ﷺ di dunia. Dan bersama mereka akan ada adzab yang pedih di akhirat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni orang-orang Yahudi yang terlantar dan dikhianati kawan-kawan mereka. Maksudnya, Yahudi Bani Qainuqa'. Ada pula yang menafsirkan dengan kaum musyrikin Mekah yang terbunuh dalam perang Badar, dimana hal itu terjadi sebelum pengusiran Bani Nadhir. Menurut Ibnu Katsir, bahwa yang lebih mirip dengan kebenaran adalah bahwa mereka ini adalah orang-orang Yahudi Bani Qainuqa’, dimana Rasulullah shallallahu 'alaihi wa sallam telah mengusir mereka sebelumnya. Maksud akibat buruk perbuatan mereka adalah mereka (orang-orang Yahudi Bani Qainuqa) diusir dari Madinah ke Syam. Atau jika tertuju kepada kaum musyrikin Mekah yang terbunuh dalam perang Badar adalah bahwa mereka kalah dalam perang Badar, tokoh-tokoh mereka tewas terbunuh, sebagiannya melarikan diri dan sebagian lagi tertawan, dan mereka merasakan akibat kesyirkkan dan kezaliman mereka. Ini merupakan azab untuk mereka di dunia, sedangkan di akhirat mereka mendapatkan azab yang pedih."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hasyr Ayat 15",
    "description": "Pada awal surah ini dijelaskan bahwa bani qainuqa' diusir dari madinah pada hari sabtu bulan syawal, 20 bulan setelah nabi hijrah, karena mengkhianati perjanjian damai, menganiaya dan membunuh kaum muslim serta mengganggu keamanan kota madinah. Melalui ayat ini Allah menjelaskan nasib bani nadir di madinah seperti nasib orang-orang yang sebelum mereka, bani qainuqa', diusir dari madinah karena merencanakan pembunuhan rasulullah. Peristiwa ini terjadi belum lama berselang, tidak lama setelah perang badar. Rasulullah mengepung benteng tempat mereka bersembunyi; menebang pohon kurma yang berada di dekat benteng dan membakarnya sehingga mereka terpaksa keluar dari benteng tersebut dan diusir dari madinah. Dengan demikian, mereka telah merasakan akibat buruk perbuatan mereka mengkhianati perjanjian damai disebabkan perbuatan mereka sendiri, merencanakan pembunuhan rasulullah. Dan di akhirat, mereka akan mendapat azab yang pedih, kekal selama-lamanya di dalam neraka. 16. Bujukan orang-orang munafik kepada bani nadir untuk bekerja sama melawan kaum muslim dan berjanji akan menolong bani nadir, jika diserang dan diusir seperti bujukan setan ketika ia berkata kepada manusia dengan meyakinkan, 'kafirlah kamu kepada Allah dan rasul-Nya!' kemudian ketika manusia itu mengikuti bujukan setan menjadi kafir kepada Allah dan rasul-Nya, ia, setan itu, berkata kepada orang-orang yang sudah berhasil dijerumuskan, 'sesungguhnya aku berlepas diri dari kamu, kamu sendiri yang harus mempertanggungjawabkan perbuatan kamu di hadapan Allah di akhirat, karena sesungguhnya aku sendiri sebenarnya takut kepada Allah, terutama saat diminta pertanggungjawaban di hadapan Allah, tuhan seluruh alam. '."
  }
]