[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "16. Perumpamaan orang-orang munafik yang mendorong orang-orang Yahudi untuk berperang dan menjanjikan kemenangan kepada mereka atas Rasulullah adalah seperti setan yang menghiasi kekafiran bagi manusia dan menyerukannya kepadanya, tetapi setelah dia kafir, setan berkata, “Sesungguhnya aku berlepas diri darimu, aku takut kepada Allah Tuhan alam semesta.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Permisalan mereka dalam hal pendengaran mereka dari orang-orang munafik seperti setan tatkala menjadikan kekufuran terasa indah untuk manusia. Namun setelah ia kafir dikarenakan setan telah menghiasi kekufuran untuknya, setan berkata, “Sesungguhnya aku berlepas diri darimu atas kekufuranmu, sesungguhnya aku takut kepada Allah, Rabb seluruh makhluk.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "16. Perumpamaan orang-orang munafik yang menipu orang-orang Yahudi Bani Nadhir dengan janji dusta, seperti setan yang menipu manusia dengan untuk menjadi kafir, namun pada akhirnya setan itu meninggalkannya seraya berkata: “Aku berlepas diri darimu, aku takut azab dari Allah, Pencipta seluruh alam.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15. كَمَثَلِ الَّذِينَ مِن قَبْلِهِمْ ((Mereka adalah) seperti orang-orang sebelum mereka) Yaitu orang-orang musyrik. قَرِيبًا ۖ( yang belum lama) Yakni pada waktu yang belum lama. ذَاقُوا۟ وَبَالَ أَمْرِهِمْ(mereka telah merasai akibat buruk dari perbuatan mereka) Yakni akibat buruk dari kekafiran mereka di dunia dengan terbunuh pada perang Badar, dan perang ini terjadi enam bulan sebelum perang Bani Nadhir."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16. Bisikan orang munafik kepada Yahudi itu seperti bisikan setan ketika menyuruh manusia: Kafirlah. Kemudian ketika manusia itu kafir kepada Tuhannya, setan berkata: Aku tidak ada urusan dengan kalian, sesungguhnya Aku takut kepada Allah Tuhan semesta alam"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Seperti setan} perumpamaan orang-orang munafik itu dalam janji mereka terhadap orang Yahudi untuk menolong dan membiarkan mereka itu seperti setan {ketika berkata kepada manusia,“Ingkarlah” Ketika orang itu ingkar, dia berkata,“Sesungguhnya aku berlepas diri darimu karena sesungguhnya aku takut kepada Allah, Tuhan semesta alam”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "16. Perumpamaan orang-orang munafik yang menipu teman-teman mereka dari kalangan ahli kitab itu adalah “seperti setan ketika berkata pada manusia, ‘Kafirlah kamu’.” Maksudnya, setan menghias kekufuran dan menjadikannya indah untuknya serta menyerunya padanya. Ketika ia telah kufur dan mendapatkan kesengsaraan, setan tidak lagi membawa manfaat bagi mereka yang telah memalingkannya dan menyeru pada ajakannya, setan berlepas diri darinya, “dia berkata, ‘Sesungguhnya aku berlepas diri darimu karena sesungguhnya aku takut kepada Allah, Rabb semesta alam’.” Maksudnya, aku tidak memiliki kekuasaan untuk menangkal siksaan darimu, aku sama sekali tidak berguna bagimu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Hasyr ayat 16: Ketahuilah wahai Nabi Allah, bahwa mereka ini yaitu orang-orang munafik yang menghiasi keburukan dan kefasikan bagi yahudi bani nadhir dan menjanjikan mereka untuk menolong mereka; Yang kemudian mereka berlepas diri dari janji mereka; Sebagaimana setan yang menghasut kafir Mekkah dan selain mereka yang kufur, maka ketika setan tersebut melihat adzab, ia berlepas diri dari mereka orang-orang kafir dan meninggalkan mereka. Ia (setan) berkata kepada mereka : Sesungguhnya aku takut dengan adzab Allah dan permusuhan-Nya jika aku berperang (membantu) kalian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ia menghias kekafiran dan mengajak kepadanya. Yakni aku tidak dapat menghilangkan azab yang menimpamu dan tidak dapat memberikan kebaikan kepadamu meskipun sedikit."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hasyr Ayat 16",
    "description": "Bujukan orang-orang munafik kepada bani nadir untuk bekerja sama melawan kaum muslim dan berjanji akan menolong bani nadir, jika diserang dan diusir seperti bujukan setan ketika ia berkata kepada manusia dengan meyakinkan, 'kafirlah kamu kepada Allah dan rasul-Nya!' kemudian ketika manusia itu mengikuti bujukan setan menjadi kafir kepada Allah dan rasul-Nya, ia, setan itu, berkata kepada orang-orang yang sudah berhasil dijerumuskan, 'sesungguhnya aku berlepas diri dari kamu, kamu sendiri yang harus mempertanggungjawabkan perbuatan kamu di hadapan Allah di akhirat, karena sesungguhnya aku sendiri sebenarnya takut kepada Allah, terutama saat diminta pertanggungjawaban di hadapan Allah, tuhan seluruh alam. '17. Maka kesudahan bagi keduanya, baik yang menggoda maupun yang digoda, bahwa keduanya masuk ke dalam neraka, karena perbuatan mereka sendiri. Mereka kekal di dalamnya selama-lamanya tanpa ada peluang keluar dari neraka. Demikianlah balasan Allah di akhirat bagi orang-orang zalim, yaitu orang-orang yang menganiaya diri sendiri dengan memilih menjadi manusia yang kafir, bukan manusia yang beriman."
  }
]