[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "18. Wahai orang-orang yang membenarkan Allah dan RasulNya, serta melaksanakan syariatNya, takutlah kalian kepada Allah, waspadalah hukumanNYa dengan melaksanakan apa yang Allah perintahkan kepada kalian dan meninggalkan apa yang Allah larang bagi kalian. Hendaknya setiap jiwa merenungkan apa yang telah dilakukannya berupa amal perbuatan untuk menghadapi Hari Kiamat. Sesungguhnya Allah Mahateliti terhadap apa yang kalian kerjakan, tidak ada sedikit pun dari amal kalian yang samar bagi Allah, dan Dia akan membalas kalian karenanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Wahai orang-orang yang beriman dan melaksanakan apa yang disyariatkan oleh Allah untuk mereka, bertakwalah kepada Allah dengan menjalankan segala perintah-Nya dan menjauhi segala larangan-Nya, dan hendaknya masing-masing jiwa memperhatikan apa yang telah disiapkannya dari amal saleh untuk hari Kiamat, dan bertakwalah kepada Allah. Sesungguhnya Allah Maha Mengetahui apa yang kalian kerjakan, tidak ada sesuatu pun dari amal kalian yang luput dari-Nya, dan Dia akan membalas kalian atas perbuatan tersebut."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "18-19. Allah memerintahkan hamba-hamba-Nya yang beriman untuk mentaati segala perintah-Nya dan menjauhi segala larangan-Nya, dan hendaklah setiap mereka mencermati kebaikan apa yang telah dia siapkan untuk menghadapi hari kiamat. Kemudian Allah mengulangi perintah-Nya agar mereka bertakwa kepada Allah, untuk menegaskan betapa pentingnya ketakwaan. Allah Maha Mengetahui segala perbuatan kalian di dunia. Dan Allah melarang mereka agar tidak menjadi seperti orang-orang lalai dari mengingat Allah, karena Allah akan membalas mereka dengan melalaikan diri mereka sendiri. Orang-orang yang jauh dari kebenaran itu adalah orang-orang yang menyelisihi perintah Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "18. يٰٓأَيُّهَا الَّذِينَ ءَامَنُوا۟ اتَّقُوا۟ اللهَ (Hai orang-orang yang beriman, bertakwalah kepada Allah) Yakni berhati-hatilah azab-Nya dengan menjalankan apa yang Dia perintahkan dan meninggalkan apa yang Dia larang. وَلْتَنظُرْ نَفْسٌ مَّا قَدَّمَتْ لِغَدٍ ۖ( dan hendaklah setiap diri memperhatikan apa yang telah diperbuatnya untuk hari esok (akhirat)) Yakni hendaklah kalian mencermati amalan apa yang kalian siapkan untuk hari kiamat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "18. Wahai orang-orang yang beriman, bertakwalah kalian kepada Allah dengan melaksanakan perintah dan meninggalkan larangan-Nya. Pada hari kiamat semua jiwa akan melihat segala amal baik yang telah dia kerjakan. Bertakwalah kepada Allah: sebagai penekanan, sungguh Allah Maha mengetahui segala perbuatab kalian. Tidak ada satu pun yang bisa tersembunyi dari pengawasan Allah. Allah Maha memberi balasan atas amal kalian"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, bertakwalah kepada Allah dan hendaklah setiap orang memperhatikan} hendaklah merenungi {apa yang telah dia perbuat untuk hari esok} untuk hari kiamat {Bertakwalah kepada Allah. Sesungguhnya Allah Maha Mengetahui terhadap apa yang kalian kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "18. Allah memerintahkan hamba-hambaNya yang beriman untuk menunaikan konsekuensi iman yaitu dengan bertakwa kepada Allah, baik dikala sepi maupun ramai dan di segala hal. Allah memerintahkan mereka untuk menjaga apa saja yang diperintahkan, baik yang berbentuk perintah, syariat, maupun batasan-batasanNya, serta memikirkan akibat baik dan buruk apa yang akan mereka dapatkan, serta apa yang mereka dapatkan dari amal perbuatan mereka yang bisa membawakan manfaat atau malapetaka bagi mereka di akhirat. Jika mereka meletakkan akhirat di hadapan mata dan sebagai kiblat hati mereka, maka mereka berkonsentrasi untuk menunaikan amalan-amalan akhirat serta berusaha dengan kuat memperbanyak amalan-amalan yang bisa menghantarkan mereka ke surga dengan membersihkannya dari berbagai hal yang bisa memutus dan menghalangi, yang mencegah mereka untuk mengerjakan atau melakukannya, jika mereka juga mengetahui bahwa “sesungguhnya Allah Maha Mengetahui apa yang kamu kerjakan,” amalan mereka tidaklah samar bagi Allah, tidak akan lenyap disisi Allah dan tidak akan dilalaikan, maka hal itu mengharuskan mereka untuk bersungguh-sungguh dalam beramal. Ayat ini adalah pangkal dalam hal muhasabah diri. Setiap orang harus selalu mengintrospeksi diri. Jika melihat adanya kekeliruan segera menyelesaikannya dengan cara melepaskan diri darinya, bertaubat secara sungguh-sungguh dan berpaling dari berbagai hal yang menghantarkan pada kekeliruan tersebut. Jika menilai dirinya bersikap sekenanya dalam menunaikan perintah-perintah Allah, ia akan mengerahkan segala kemampuannya dengan meminta pertolongan pada RabbNya untuk mengembangkan, dan menyempurnakannya, serta membandingkan antara karunia dan kebaikan Allah yang diberikan padanya dengan kemalasannya. Karena hal itu mengharuskannya merasa malu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Hasyr ayat 18: Allah menganjurkan bagi orang-orang yang beriman untuk bertakwa dan melihat akan adzab dan selalu mengintrospeksi atas amalan mereka, Allah berkata : Wahai orang-orang yang beriman kepada Allah dan Rasul-Nya ﷺ, beramallah kalian dengan syariat-Nya. Takutlah kalian dari adzab Allah dengan mengerjakan apa yang diperintah dan dilarang-Nya, dan agar memperhatikan setiap amalan yang terdahulu yang (akan dihisab) di hari kiamat. Kemudian Allah memerintahkan orang-orang yang beriman agar bertakwa untuk kedua kalinya. Dan Allah mengulangi kalimat takwa kaena pentingnya amalan tersebut. Ketahuilah bahwa Allah yang ada di langit mengetahui atas amalan-amalan kalian tanpa tersembunyi apa yang ada di bumi dan di langit. Dan kalian akan dibalas dengan sebab amalan-amalan kalian. Jika baik, maka akan dibalasan dengan kebaikan, jika buruk makan akan dibalas dengan keburukan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memerintahkan hamba-hamba-Nya yang mukmin untuk melakukan kehendak dari keimanan dan konsekwensinya yaitu tetap bertakwa kepada Allah Subhaanahu wa Ta'aala baik dalam keadaan rahasia maupun terang-terangan dan dalam setiap keadaan serta memperhatikan perintah Allah baik syariat-Nya maupun batasan-Nya serta memperhatikan apa yang dapat memberi mereka manfaat dan membuat mereka celaka serta memperhatikan hasil dari amal yang baik dan amal yang buruk pada hari Kiamat. Karena ketika mereka menjadikan akhirat di hadapan matanya dan di depan hatinya, maka mereka akan bersungguh-sungguh memperbanyak amal yang dapat membuat mereka berbahagia di sana, menyingkirkan penghalang yang dapat memberhentikan mereka dari melakukan perjalanan atau menghalangi mereka atau bahkan memalingkan mereka darnya. Demikian juga, ketika mereka mengetahui bahwa Allah Subhaanahu wa Ta'aala Mahateliti terhadap apa yang mereka kerjakan, dimana amal mereka tidak ada yang tersembunyi bagi-Nya dan tidak akan sia-sia serta diremehkan-Nya, maka yang demikian dapat membuat mereka semakin semangat beramal saleh. Ayat ini merupakan asas dalam meintrospeksi diri, dan bahwa sepatutnya seorang hamba memeriksa amal yang dikerjakannya, ketika ia melihat ada yang cacat, maka segera disusul dengan mencabutnya, bertobat secara tulus (taubatan nashuha) dan berpaling dari segala sebab yang dapat membawa dirinya kepada cacat tersebut. Demikian juga ketika ia melihat kekurangan pada dirinya dalam menjalankan perintah Allah, maka ia mengerahkan kemampuannya sambil meminta pertolongan kepada Tuhannya untuk dapat menyempurnakan kekurangan itu dan memperbaikinya serta mengukur antara nikmat-nikmat Allah dan ihsan-Nya yang banyak dengan kekurangan pada amalnya, dimana hal itu akan membuatnya semakin malu kepada-Nya. Sungguh rugi seorang yang lalai terhadap masalah ini dan mirip dengan orang-orang yang lupa kepada Allah; lalai dari mengingat-Nya serta lalai dari memenuhi hak-Nya dan mendatangi keuntungan terbatas bagi dirinya dan hawa nafsunya sehingga mereka tidak mendapatkan keberuntungan, bahkan Allah Subhaanahu wa Ta'aala menjadikan mereka lupa terhadap maslahat diri mereka, maka keadaan mereka menjadi melampaui batas, mereka pulang ke akhirat dengan membawa kerugian di dunia dan akhirat serta tertipu dengan tipuan yang sulit ditutupi, karena mereka adalah orang-orang yang fasik."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hasyr Ayat 18",
    "description": "Salah satu sifat orang munafik adalah menyatakan beriman kepada Allah dan rasul-Nya secara lisan, padahal mereka bukan orang beriman (lihat: surah al-baqarah/2:10) sehingga nasib mereka di akhirat kekal di dalam neraka. Pada ayat ini Allah mengingatkan orang beriman agar benar-benar bertakwa kepada Allah dan memperhatikan hari esok, akhirat. Wahai orang-orang yang beriman! kapan dan di mana saja kamu berada bertakwalah kepada Allah dengan sungguh-sungguh melakukan semua perintah Allah dan menjauhi semua larangan-Nya; dan hendaklah setiap orang siapa pun dia memperhatikan apa yang telah diperbuatnya untuk hari esok, yakni untuk hidup sesudah mati, di akhirat dengan berbuat kebaikan atas dasar iman, ditopang dengan ilmu dan hati yang ikhlas semata-mata mengharap rida Allah, sebab hidup di dunia ini sementara, sedangkan hidup di akhirat itu abadi; dan bertakwalah kepada Allah dengan menjaga hubungan baik dengan Allah, manusia dan alam. Sungguh, Allah mahateliti sekecil apa pun juga terhadap apa yang kamu kerjakan sehingga semua yang kamu lakukan berada dalam pengetahuan Allah (lihat: surah q'f/50: 18). 19. Allah mengingatkan orang berimaan dengan berfirman, 'dan janganlah kamu, wahai orang-orang beriman seperti orang-orang yang lupa kepada Allah, tidak menyadari bahwa Allah senantiasa mengawasi manusia dalam kehidupan ini sehingga Allah menjadikan mereka, karena pola hidup mereka yang hanya mencari kepuasaan, kelezatan, dan kenikmatan duniawi tanpa mempertimbangkan kebutuhan hidup sesudah mati, manusia yang lupa akan diri sendiri, yakni manusia yang tercabut dari akar kemanusiaannya. Mereka itulah, manusia yang lupa kepada Allah dan lupa kepada diri sendiri adalah orang-orang fasik, yaitu orang-orang yang bergelimang dosa dan perbuatan keji. '."
  }
]