[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "2. Dia- lah Allah Yang mengeluarkan orang-orang yang mengingkari kenabian Muhammad dari kalangan Ahli Kitab, yaitu orang-orang Yahudi Bani an-Nadhir, dari tempat-tempat tinggal mereka yang bertetangga dengan kaum Muslimin di Madinah. Ini adalah pengusiran pertama bagi mereka dari jazirah Arab ke Syam. Kalian (wahai kaum Muslimin) tidak menyangka bahwa mereka akan terusir dari negeri mereka dengan penuh kehinaan dan kerendahan, karena mereka memiliki kekuatan besar dan pertahanan yang kokoh. Orang-orang Yahudi menyangka bahwa benteng-benteng mereka bisa melindungi mereka dari azab Allah dan tidak seorang pun mampu menaklukannya. Tetapi keputusan Allah yang tidak mereka duga datang, Allah menyusupkan rasa takut yang mendalam ke dalam hati mereka. Mereka merusak rumah-rumah mereka dengan tangan-tangan mereka sendiri dan tangan-tangan kaum Mukminin. Ambillah pelajaran wahai orang-orang yang memiliki pandangan lurus dan akal yang kuat dari apa yang menimpa mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Dia lah yang mengusir Bani Naḍīr yang kafir terhadap Allah dan mendustakan Rasul-Nya, Muhammad -ṣallallāhu 'alaihi wa sallam- dari rumah-rumah mereka di Madinah, pada pengusiran mereka yang pertama dari Madinah ke negeri Syam. Mereka dari kalangan Yahudi, pemilik Taurat, setelah mereka mengingkari perjanjian mereka dan berpihak kepada orang-orang kafir. Allah mengusir mereka ke negeri Syam. Kalian tidak menyangka -wahai orang-orang yang beriman- bahwa mereka akan diusir dari rumah-rumah mereka karena kemuliaan dan kekuatan mereka. Dan mereka menyangka bahwa benteng-benteng mereka yang telah mereka bangun dengan kokoh akan mampu melindungi mereka dari siksa Allah dan balasan-Nya. Lalu datanglah kepada mereka siksa Allah dari sisi yang tidak mereka sangka kedatangannya, yaitu saat Allah memerintahkan Rasul-Nya untuk memerangi mereka dan mengusir mereka dari rumah-rumah mereka dan Allah memasukkan rasa takut yang amat sangat ke dalam hati mereka. Mereka merobohkan rumah-rumah mereka dengan tangan-tangan mereka sendiri dari dalam agar tidak di manfaatkan kaum muslimin dan kaum muslimin merobohkannya dari sisi luar. Maka ambillah pelajaran wahai orang-orang yang mempunyai wawasan dari apa yang menimpa mereka dikarenakan kekufuran mereka. Janganlah menjadi seperti mereka sehingga kalian mendapatkan balasan dan siksa sebagaimana yang ditimpakan kepada mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "2. Allah-lah yang mengusir orang-orang Yahudi Bani Nadhir yang mendustakan risalah Nabi dari tempat tinggal mereka -yang berada di sekitar kota Madinah- pada awal pengusiran mereka dari jazirah Arab menuju negeri Syam. Kalian menyangka -hai orang-orang beriman- mereka tidak akan keluar dari Madinah karena mereka memiliki pertahanan dan kekuatan yang besar; dan orang-orang Bani Nadhir itupun mengira benteng-benteng mereka dapat melindungi mereka dari serangan. Namun datanglah ketetapan Allah yang tidak pernah mereka perkirakan; Allah memasukkan ketakutan ke dalam hati mereka, sehingga mereka menghancurkan rumah-rumah mereka sendiri dari dalam, agar nantinya tidak dihuni oleh kaum muslimin; sedangkan kaum muslimin menghancurkan sisi-sisi lain dari rumah orang-orang Yahudi itu dari luar, agar mereka dapat memasuki benteng mereka. Maka jadikanlah ini sebagai pelajaran wahai orang-orang yang berakal sehat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. هُوَ الَّذِىٓ أَخْرَجَ الَّذِينَ كَفَرُوا۟ مِنْ أَهْلِ الْكِتٰبِ مِن دِيٰرِهِمْ لِأَوَّلِ الْحَشْرِ ۚ (Dialah yang mengeluarkan orang-orang kafir di antara ahli kitab dari kampung-kampung mereka pada saat pengusiran yang pertama) Mereka adalah Bani Nadhir, yang merupakan golongan orang-orang Yahudi dari keturunan nabi Harun; mereka mendatangi kota Madinah ketika terjadi fitnah pada Bani Israil. Mereka mengingkari perjanjian yang mereka buat dengan Nabi Muhammad dan berbalik melawannya bersama orang-orang musyrik. Maka Rasulullah mengepung mereka sampai mereka menyerah dan rela untuk diusir. Al-Kalby mengatakan: mereka adalah kaum pertama dari Ahli Kitab yang diusir dari jazirah Arab, kemudian kaum mereka yang terakhir diusir terjadi pada zaman kekhalifahan Umar bin Khattab. Pendapat lain mengatakan bahwa pengusiran yang terakhir adalah pengusiran seluruh manusia menuju padang mahsyar. مَا ظَنَنتُمْ أَن يَخْرُجُوا۟ ۖ( Kamu tidak menyangka, bahwa mereka akan keluar) Yakni hai kaum muslimin, kalian tidak menyangka bahwa Bani Nadhir keluar dari pemukiman mereka karena kemuliaan dan pertahanan mereka yang kuat. Sebab mereka dahulu memiliki benteng yang sangat kuat, tanah dan kebun kurma yang luas, serta memiliki pasukan yang kuat dan terlatih. وَظَنُّوٓا۟ أَنَّهُم مَّانِعَتُهُمْ حُصُونُهُم مِّنَ اللهِ(dan merekapun yakin, bahwa benteng-benteng mereka dapat mempertahankan mereka dari (siksa) Allah) Yakni dan Bani Nadhir mengira bahwa benteng mereka dapat melindungi mereka dari kekuatan Allah. فَأَتَىٰهُمُ اللهُ مِنْ حَيْثُ لَمْ يَحْتَسِبُوا۟ ۖ( maka Allah mendatangkan kepada mereka (hukuman) dari arah yang tidak mereka sangka-sangka) Yakni mereka didatangi ketetapan Allah dari arah yang tidak mereka kira sebelumnya, yaitu Allah memerintahkan nabi-Nya agar memerangi dan mengusir mereka, sedangkan mereka tidak menyangka bahwa hal itu akan sampai pada level itu, sebab mereka menganggap diri mereka lebih kuat dan perkasa. وَقَذَفَ فِى قُلُوبِهِمُ الرُّعْبَ ۚ( Dan Allah melemparkan ketakutan dalam hati mereka) Makna (الرعب) yakni ketakutan yang luar biasa. Rasulullah pernah bersabda: “Aku ditolong Allah dengan ketakutan (musuhku padaku) selama satu bulan perjalanan (sebelum bertemu denganku).” يُخْرِبُونَ بُيُوتَهُم بِأَيْدِيهِمْ وَأَيْدِى الْمُؤْمِنِينَ(mereka memusnahkan rumah-rumah mereka dengan tangan mereka sendiri dan tangan orang-orang mukmin) Hal ini karena ketika mereka telah yakin akan diusir, mereka merasa hasad terhadap kaum muslimin yang akan menempati rumah-rumah mereka, sehingga mereka merobohkan rumah mereka sendiri dari dalam sedangkan kaum muslimin merobohkannya dari luar. Az-Zuhri dan ‘Urwah bin Zubair berkata: setelah Rasulullah membuat perjanjian damai dengan mereka dengan membolehkan mereka membawa apa yang mampu dibawa oleh unta, mereka menyayangkan kayu atau tiang rumah mereka untuk ditinggal, sehingga mereka merobohkan rumah mereka dan membawa kayu atau tiang itu dengan unta mereka, sedangkan orang-orang beriman merobohkan sisanya. فَاعْتَبِرُوا۟ يٰٓأُو۟لِى الْأَبْصٰرِ(Maka ambillah (kejadian itu) untuk menjadi pelajaran, hai orang-orang yang mempunyai wawasan) Yakni ketahuilah bahwa Allah akan melakukan hal demikian kepada orang yang melanggar perjanjian dan menentang Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Maha Suci Allah yang telah mengeluarkan orang-orang kafir ahli kitab dari kampung halamannya. Yaitu Yahudi Bani Nadhir yang sebelumnya hidup bersama di Madinah. Kemudian Allah mengelurakan mereka dari kampung halamannya ke Khaibar. Setelah itu , pada zaman Umar kaum Yahudi juga diusir dari suku Khaibar. Mereka diusir dari wilayah Arab menuju Syam. Sebab mereka telah mengkhianati janji mereka kepada Nabi SAW. Mereka bersekutu dan bersatu dengan orang-orang musyrik. Sehingga rasul SAW memblokade mereka.ampai mereka bersedia keluar dari kampung halaman. Kalian wahai orang yang beriman tidak menyangka sebelumnya bahwa mereka akan keluar dari tempat mereka, karena sangat membangkangnya mereka. Mereka meyakini, bahwa blokade mereka mampu melindungi mereka dari azab dan murka Allah. Al hasun adalah benteng yang sangat kuat. Maka datanglah azab Allah, dan perintah mengusir mereka. Karena mereka tidak merasa terancam dengan azab Allah, sebab sangat percaya diri dengan kekuatan yang mereka punya. Kemudian Allah menancapkan rasa takut yang besar dalam hati mereka, dan ancaman memenuhi hati mereka. Mereka merusak rumah mereka dengan tangan mereka sendiri dari dalam agar tidak dihuni oleh orang muslim. Dan di sisi lain mereka menggunakan tangan orang-orang mukmin untuk merusak rumah mereka dari luar untuk menghilangkan jejak perbuatan mereka. Maka ambillah pelajaran dari mereka wahai orang mukmin, dan wahai orang yang mempunyai akal dan penglihatan hati. Al hasyr adalah mengusir/mengeluarkan semua penghuni suatu tempat ke tempat lain. Pengidhofahan yang pertama adalah idhofah yang bermakna lebih baik untuk bersabar. Artinya sabar adalah lebih baik, al hasyr yang pertama. Bashirah adalah cahaya hati"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dialah yang mengeluarkan orang-orang yang ingkar di antara Ahlul kitab} orang-orang Yahudi dari Bani Nadhir {dari kampung halaman mereka} tempat tinggal mereka di Madinah {pada saat pengusiran yang pertama} pada permulaan pengusiran mereka dari semenanjung Arab menuju Syam {Kalian tidak menyangka bahwa mereka akan keluar. Mereka pun yakin bahwa benteng-benteng mereka akan dapat menjaga mereka dari (azab) Allah. Maka (azab) Allah datang kepada mereka} maka azab Allah datang kepada mereka {dari arah yang tidak mereka sangka} yang tidak diwaspadai dalam benak mereka {Dia menanamkan} Dia meletakkan {rasa takut} rasa takut yang sangat dahsyat {di dalam hati mereka sehingga mereka menghancurkan rumah-rumah mereka dengan tangan mereka sendiri dan tangan orang-orang mukmin. Maka ambillah pelajaran} maka ambillah pelajaran {wahai orang-orang yang mempunyai penglihatan} wahai orang-orang yang memiliki penglihatan yang murni"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2. Dan diantaranya adalah pertolongan Allah bagi RasulNya terhadap orang-orang kafir dari Ahli Kitab Bani Nadhir ketika mereka ingkar janji terhadap Rasulullah, maka Allah mengusir mereka dari tempat tinggal dan tanah air yang mereka cintai. Dan pengusiran ini adalah awal pengusiran dan eksodus yang telah Allah tetapkan melalui tangan RasulNya, Muhammad, sehingga mereka pun pergi ke Khaibar. Ayat yang mulia ini menunjukkan bahwa akan ada pengusiran lain bagi mereka selain pengusiran tersebut, dan sungguh telah terjadi ketika Nabi mengusir mereka dari Khaibar, kemudian Umar juga mengusir yang tersisa dari mereka darinya. “Kamu tiada menyangka” wahai kaum Muslimin “bahwa mereka akan keluar” dari kampung-kampung mereka karena (adanya) benteng-benteng, pertahanan, dan kekuatan (yang mengitari mereka), “dan mereka pun yakin, bahwa benteng-benteng mereka akan dapat mempertahankan mereka dari siksaan Allah,” mereka merasa kagum sehingga menipu daya mereka, dan mereka beranggapan bahwa mereka tidak akan terjangkau serta tidak ada seorang pun yang dapat merobohkan pertahanan mereka. Namun takdir Allah ada di balik semua itu, benteng-benteng itu tidak berguna, dan kekuatan serta pertahanan mereka pun tidak bermanfaat sama sekali. Oleh karena itu Allah berfirman, “Maka Allah mendatangkan kepada mereka (hukuman) dari arah yang tidak mereka sangka-sangka,” maksudnya, dari perkara dan pintu yang tidak pernah sama sekali terbetik dalam benak mereka, di mana Allah “mencampakkan ketakutan ke dalam hati mereka,” yaitu ketakutan yang sangat, yang merupakan tentara Allah paling besar yang tidak dapat dikalahkan oleh banyaknya jumlah pasukan, perlengkapan perang, kekuatan maupun keperkasaan. Perkara yang mereka sangkakan, dan yang mereka yakini bahwasanya serangan akan menimpa mereka, jika memang dapat masuk, adalah melalui benteng-benteng yang mereka bertahan dengannya dan itulah yang mulanya membuat mereka tenang. Namun barangsiapa yang percaya kepada selain Allah, niscaya dia akan diterlantarkan, dan barangsiapa yang bersandar kepada selain Allah, maka bencanalah yang akan dia dapatkan. Datanglah kepada mereka perkara dari langit yang turun merasuki hati mereka yang merupakan tempat keteguhan dan kesabaran, atau sebaliknya tempat ketakutan dan kelemahan. Maka Allah menghilangkan kekuatan dan keperkasaannya, serta menaruhkan kelemahan dan ketakutan yang tidak ada kemampuan sedikitpun bagi mereka untuk menolaknya yang akan menjadi penolong bagi mereka. Oleh karena itu Dia berfirman, “Mereka memusnahkan rumah-rumah mereka dengan tangan mereka sendiri dan tangan orang-orang yang beriman.” Yang demikian itu karena mereka telah bersepakat dengan Nabi bahwa mereka dibolehkan membawa barang-barang yang dapat dibawa oleh unta mereka, maka mereka mencabut bagian-bagian dari bangunan-bangunan rumah yang mereka anggap bagus, sehingga mereka menguasakan orang-orang yang beriman untuk merobohkan rumah-rumah mereka dan menghancurkan benteng-benteng mereka disebabkan kelaliman mereka sendiri. (Jadi) mereka sendirilah yang berbuat kesalahan atas diri mereka dan menjadi faktor terbesar untuk menghancurkan mereka. “Maka ambillah (kejadian itu) untuk menjadi pelajaran, hai orang-orang yang mempunyai pandangan,” yakni pandangan yang cerdas dan akal yang sempurna, karena sesungguhnya dalam hal ini terdapat pelajaran yang dengannya dapat diketahui perbuatan Allah kepada orang-orang yang menentang kebenaran lagi mengikuti hawa nafsu, yaitu orang-orang yang keperkasaan, kekuatan, benteng-benteng mereka, pertahanan maupun perlindungan kepada mereka tidak dapat memberikan manfaat, tatkala datang perkara Allah, sampailah kepada mereka siksaan yang disebabkan oleh dosa-dosa mereka sendiri. Dan yang dijadikan sebagai sandaran adalah keumuman makna, bukan kekhususan sebab, sesungguhnya ayat ini menunjukkan adanya perintah untuk mengambil pelajaran, yaitu pelajaran bagi orang yang memiliki pandangan dengan pandangannya, mengqiyaskan sesuatu dengan sesuatu yang menyerupainya dan memikirkan apa yang terkandung dalam hukum-hukum berupa makna-makna dan hikmah yang merupakan tempat akal dan pikiran. Dengan demikian akal dapat sempurna, pandangan bercahaya, iman bertambah, dan tercapailah pemahaman yang hakiki."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Hasyr ayat 2: Allah mengabarkan bahwa Dialah yang mengeluarkan orang-orang kafir dari yahudi bani nadhir dari rumah-rumah mereka dimana mereka tinggal di sekitar Madinah. Dan ini merupakan awal pertama kali mereka dikeluarkan dari tanah Arab; Dimana mereka juga dikeluarkan dari tanah Syam. Kaum muslimin tidak menyangka bahwa bani nadhir dapat keluar dari negara mereka dengan mudah; Karena sebab benteng-benteng mereka yang banyak menjadi pelindung, mereka adalah ahli dalam hitung-menghitung, sampai-sampai mereka menyangka bahwa benteng-benteng mereka mampu menghalangi adzab Allah; Akan tetapi karena Allah Maha Kuat dan Kuasa, tidak ada yang menghalangi-Nya suatu penghalang dan tidak ada di hadapan-Nya yang mampu mencegah-Nya sesuatu apapun. Oleh sebab itu ditimpakan adzab Allah dan Kuasa-Nya kepada mereka, dari segi mereka juga tidak tahu dan terpikirkan dalam benak mereka. Allah timpakan kepanikan dan ketakutan dalam hati-hati mereka ketika datang Rasulullah ﷺ dan para sahabat-Nya kepada mereka, maka mereka tidak dapat melawan. Ketika mereka terusir dengan kekalahan mereka, mereka robohkan rumah-rumah mereka dari dalam, dan kaum muslimin meruntuhkannya dari luar; Mereka orang-orang yahudi adalah hasad dan memendam kebencian. Maka ambillah menjadi pelajaran wahai orang-orang yang memiliki ilmu dan akal. Dan ketahuilah bahwa tipu daya dan khianat akan merugikan pelakunya karena sebab dosanya sendiri. Pada penutup ayat ini Allah berfirman : فَٱعْتَبِرُوا۟, maka para ulama ahli fiqh menjadikan dalil kehujjahan qiyas."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu Bani Nadhir. Di Madinah. Merekalah orang-orang yang pertama dikumpulkan untuk diusir keluar dari Madinah menuju Syam dan diusir kembali oleh Umar radhiyallahu 'anhu dalam masa pemerintahannya. Wahai kaum mukmin. Karena kuatnya pertahanan mereka dan terhormatnya mereka di sana. Mereka merasa ujub dengan benteng-benteng mereka, bahwa benteng tersebut tidak akan dapat ditembus oleh seorang pun, padahal taqdir Allah Subhaanahu wa Ta'aala di atas semua itu, benteng, pertahanan dan kekuatan mereka tidak berguna sedikit pun bagi mereka di hadapan kekuasaan Allah Subhaanahu wa Ta'aala. Barang siapa yang percaya kepada selain Allah, maka dia akan ditelantarkan dan barang siapa yang cenderung kepada selain Allah, maka dia akan mendapatkan akibat yang buruk, maka mereka ditimpa perkara dari langit yang menimpa hati mereka, dimana hati merupakan tempat teguh dan sabar atau lemah dan kendur. Allah Subhaanahu wa Ta'aala menyingkirkan kekuatannya dan menggantikan dengan kelemahan dan ketakutan sehingga yang demikian merupakan pertolongan kepada kaum muslimin. Rasa takut yang Allah tanamkan ke dalam hati mereka adalah tentara-Nya yang paling besar, dimana tidak bermanfaat jumlah yang banyak dan perlengkapan bersamanya. Hal itu, karena sebelumnya mereka telah berjanji kepada Nabi shallallahu 'alaihi wa sallam bahwa untuk mereka apa yang diangkut oleh unta. Oleh karena itu, mereka robohkan atap-atap yang sebelumnya mereka pandang indah dan memberikan kekuasaan kepada orang-orang mukmin dengan merobohkan rumah dan benteng mereka. Yakni mempunyai pandangan yang dalam dan akal yang sempurna, karena dalam hal ini terdapat pelajaran yang dengannya diketahui tindakan Allah Subhaanahu wa Ta'aala terhadap orang-orang yang menentang kebenaran dan mengikuti hawa nafsu, dimana keperkasaan mereka tidak memberi manfaat apa-apa bagi mereka, demikian pula kekuatan mereka dan benteng yang mereka buat saat datang perkara Allah dan hukuman-Nya disebabkan dosa-dosa mereka. Sebagaimana ‘ibrah (yang dijadikan pelajaran) adalah berdasarkan keumuman lafaz bukan kekhususan sebab (Al ‘ibrah bi’umuumil lafzhi laa bikhushusis sabab), maka ayat ini terdapat dalil perintah I’tibar, yaitu mengambil pelajaran dari yang serupa untuk yang serupa dan sesuatu diqiaskan dengan yang semisalnya, demikian pula memikirkan hukum-hukum yang dikandungnya berupa makna-makna dan hikmah-hikmah yang menjadi pusat pemikiran. Dengan itulah akal menjadi tajam, bashirah (mata hati) menjadi bersinar dan iman menjadi bertambah dan tercapai pemahaman yang hakiki."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hasyr Ayat 2",
    "description": "Allah menyatakan bahwa dialah yang mengeluarkan dengan cara memerintahkan kepada rasulullah untuk mengusir orang-orang kafir di antara ahli kitab, yakni kaum yahudi bani nadir dan bani qainuqa', dua kabilah yahudi dari kampung halamannya di madinah yang sudah menetap di sana sejak sebelum kelahiran nabi. Peristiwa ini terjadi pada saat pengusiran yang pertama yang dilakukan rasulullah terhadap bani qainuqa' setelah perang badar. Pengusiran kedua adalah pengusiran terhadap bani nadir dan bani quraizah setelah perang ahzab. Pengusiran ketiga dilakukan oleh 'umar bin khattab terhadap semua kaum yahudi di madinah, karena pelanggaran mereka terhadap kesepakatan damai. Kamu tidak menyangka, bahwa mereka akan keluar dari madinah dengan mudah, karena sistem pertahanan mereka kuat dan memiliki sdm yang berkualitas. Mereka yakin bahwa Muhammad dan para pengikutnya tidak akan pernah sanggup mengeluarkan mereka dari madinah. Dan mereka pun yakin bahwa benteng-benteng mereka yang kuat dan strategis akan dapat mempertahankan mereka dari hukuman Allah yang dilancarkan kaum muslim kepada mereka. Maka Allah segera mendatangkan hukuman itu kepada mereka, melalui tangan-tangan kaum muslim, setelah bani qainuqa' menunjukan permusuhan kepada umat islam. Pada waktu yang sama, rencana bani nadir dan bani quraizah untuk membunuh rasulullah terbongkar dari arah yang tidak mereka sangka-sangka, karena mereka tidak mengira rasulullah akan bertindak cepat mengepung benteng mereka. Dan Allah menanamkan rasa takut ke dalam hati mereka, ketika rasulullah memberitahukan bahwa mereka akan diminta keluar dari madinah sehingga mereka dengan inisiatif sendiri memusnahkan rumah-rumah mereka dengan peralatan dan tangannya sendiri agar rumah-rumah itu tidak bisa digunakan oleh kaum muslim; dan rumah-rumah mereka pun dihancurkan oleh tangan orang-orang mukmin yang bertugas dalam operasi pembersihan ini. Maka ambillah pelajaran berharga dari peristiwa pengusiran kaum yahudi di madinah itu wahai orang-orang beriman yang mempunyai pandangan yang luas bahwa kehebatan benteng pertahanan musuh-Musuh Allah dan kerja sama mereka yang kuat bukan penghalang untuk bisa dikalahkan sehingga mereka merasakan kehinaan, terusir dari madinah. 3. Pengusiran yahudi itu bisa terjadi karena dua hal; kepemimpinan rasulullah yang tegas dan keridaan Allah terhadap kaum muslim. Dan sekiranya tidak karena persetujuan Allah yang telah menetapkan hukum sebab-akibat yang menjadi dasar pengusiran mereka, kabilah-kabilah yahudi dari madinah, pasti Allah tetap mengazab mereka dengan cara lain di dalam kehidupan dunia sebagai balasan atas pengkhianatan mereka. Dan di akhirat mereka tetap akan mendapat azab neraka yang pedih selama-lamanya."
  }
]