[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "20. Tidak sama para penghuni neraka yang disiksa dan para penduduk surga yang diberi nikmat. Para penduduk surga adalah orang-orang yang mendapatkan apa yang mereka cari, yang selamat dari segala apa yang dibenci."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "20. Tidaklah sama para penghuni Neraka dan para penghuni Surga. Justru mereka berbeda terkait balasan yang mereka terima sebagaimana berbedanya perbuatan mereka di dunia. Para penghuni Surga adalah orang-orang yang menang karena mereka memperoleh apa yang mereka cari dan selamat dari apa yang mereka hindari."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "20. Pada hari kiamat, tidak sama antara para penghuni neraka yang diazab dengan para penghuni surga yang mendapat kenikmatan. Para penghuni surga-lah yang mendapat kemenangan di dunia dan di akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "20. أَصْحٰبُ الْجَنَّةِ هُمُ الْفَآئِزُونَ (penghuni-penghuni jannah itulah orang-orang yang beruntung) Yakni berhasil meraih apa yang mereka harapkan dan selamat dari segala yang mereka benci."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20. Bagi Allah, pada hari kiamat tidak ada kesamaan sama sekali, antara penghuni neraka yang sedikit amal baiknya dengan penghuni surga yang melaksanakan perintah dan kewajiban mereka. Penghuni surga adalah orang yang beruntung karena mendapatkan berbagai kenikmatan dan keridhoan Allah. Mereka adalah orang-orang yang selamat dari azab Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Tidak sama para penghuni neraka dengan para penghuni surga. Penghuni-penghuni surga itulah orang-orang yang memperoleh kemenangan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "20. Lantas samakah orang yang memelihara ketakwaan terhadap Allah serta memikirkan apa yang akan dipersiapkan menghadapi Hari Akhirat esok sehingga akan mendapatkan surga yang penuh kenikmatan serta kehidupan yang nyaman bersama orang-orang yang dikaruniai Allah dari kalangan para nabi, orang-orang jujur, para syuhada dan orang-orang shalih; samakah orang yang bertakwa dengan orang yang lalai, tidak mengingat Allah serta melalaikan hak-hak Allah sehingga ia sengsara di dunia dan berhak mendapatkan siksaan di akhirat? Golongan pertama adalah orang-orang yang beruntung sedangkan golongan kedua adalah orang-orang yang rugi."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Hasyr ayat 20: Allah mengabarkan bahwa tidak sama antara penghuni neraka (dan mereka adalah orang-orang fasik yang melupakan Allah) dengan penghuni surga yang mereka bertakwa kepada Allah dan melaksanakan perintah-perintah-Nya dan menjauhi larangan-Nya. Ketahuilah bahwa penghuni surga mereka adalah orang-orang yang menang, sukses sesuai perintah Allah dan lolos dari apa yang Allah tidak senangi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya, apakah sama antara orang yang menjaga ketakwaan kepada Allah dan memperhatikan amal yang dilakukannya untuk menghadapi akhirat sehingga ia berhak mendapatkan surga dan kehidupan yang menyenangkan dengan orang-orang yang lalai dari mengingat Allah, melupakan hak-hak-Nya sehingga ia pun menjadi celaka di dunia dan berhak mendapatkan neraka di akhirat? Yang pertama memperoleh kemenangan, sedangkan yang kedua memperoleh kerugian."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hasyr Ayat 20",
    "description": "Manusia yang lupa kepada Allah hingga lupa terhadap diri sendiri adalah manusia yang bergelimang dosa dan akan menjadi penghuni neraka. Tidak sama para penghuni neraka, pola pikir, sikap dan perilakunya dengan para penghuni surga. Para penghuni surga itu adalah orang-orang beriman yang berusaha menyucikan jiwanya, mendekatkan diri kepada Allah, menjalani hidup dengan berbagi dan peduli. Mereka lah orang-orang yang memperoleh kemenangan mendapatkan surga karena keberhasilannya mengendalikan hawa nafsu dan tipu daya iblis dalam hidup dan kehidupan. 21. Allah menjelaskan bahwa Al-Qur'an diturunkan bagi manusia yang menggunakan nalar dan mengikuti hati nurani. Sekiranya kami turun-kan Al-Qur'an ini kepada sebuah gunung yang diberi akal, pikiran, dan perasaan seperti manusia; pasti kamu akan melihatnya tunduk terpecah belah disebabkan takut kepada Allah, karena gunung-gunung itu akan menggunakan nalar, rasa, dan nuraninya dalam memahami Al-Qur'an dan mengamalkannya. Dan perumpamaan-perumpamaan itu, yakni manusia yang kecil dan lemah dibandingkan dengan gunung yang begitu besar, tinggi dan keras; kami buat untuk manusia agar mereka berpikir bahwa gunung bisa menggunakan nalar, rasa dan nurani untuk memahami dan menerapkan Al-Qur'an hingga tunduk dan pecah karena takut kepada Allah. Mengapa manusia yang benar-benar memiliki nalar, rasa dan nurani tidak menggunakannya secara optimal dalam memahami dan menerapkan Al-Qur'an dalam kehidupan ini'."
  }
]