[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "21. Seandainya Kami menurunkan al-Quran ini kepada sebuah gunung dari gunung-gunung yang ada, lalu ia mengerti ancaman dan janji di dalamnya, niscaya kamu melihat gunung itu dengan kekuatan dan kekerasannya tunduk, merendah dan terbelah karena takut kepada Allah. perumpamaaan itu Kami buat dan jelaskan kepada manusia agar mereka memikirkan Kuasa Allah dan keagunganNya. Ayat ini mengandung dorongan untuk merenungkan al-Quran, memahami makna-maknanya, dan mengamalkannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Kalau sekiranya Kami turunkan Al-Qur`ān ini di atas gunung niscaya engkau akan melihat -wahai Rasul- gunung itu meski sangat keras menjadi tunduk dan hancur karena sangat ketakutan kepada Allah. Karena di dalam Al-Qur`ān itu terdapat nasihat-nasihat yang menakutkan dan ancaman yang keras. Permisalan ini Kami berikan kepada manusia agar mereka menggunakan akalnya, sehingga bisa mengambil pelajaran dari nasihat-nasihat dan pelajaran-pelajaran yang ada di dalam ayat-ayat Al-Qur`ān."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "21. Allah menyampaikan tentang kedudukan al-Qur’an dan keagungannya terhadap makhluk yang besar. Seandainya Allah menurunkannya kepada gunung yang besar, dan gunung itu memahami pelajaran dan peringatan yang ada di dalamnya, niscaya kamu akan melihat gunung yang keras itu akan tunduk dan hancur berkeping-keping karena ketakutannya kepada Allah. Demikianlah perumpamaan yang Kami jelaskan kepada para hamba, agar mereka memahami bentuk kekuatan dan keesaan Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "21. لَوْ أَنزَلْنَا هٰذَا الْقُرْءَانَ عَلَىٰ جَبَلٍ لَّرَأَيْتَهُۥ خٰشِعًا مُّتَصَدِّعًا مِّنْ خَشْيَةِ اللهِ ۚ (Kalau sekiranya Kami turunkan Al-Quran ini kepada sebuah gunung, pasti kamu akan melihatnya tunduk terpecah belah disebabkan ketakutannya kepada Allah) Yakni keagungan, kefasihan, dan kandungan al-Qur’an yang penuh pelajaran yang dapat melembutkan hati, dan jika ia diturunkan kepada salah satu gunung yang kamu lihat meski gunung itu sangat kuat dan keras niscaya akan hancur karena ketakutannya kepada Allah dan siksaa-Nya, dan karena kekhawatirannya tidak dapat menjalankan pengagungan firman Allah yang diwajibkan kepadanya. وَتِلْكَ الْأَمْثٰلُ نَضْرِبُهَا لِلنَّاسِ لَعَلَّهُمْ يَتَفَكَّرُونَ(Dan perumpamaan-perumpamaan itu Kami buat untuk manusia supaya mereka berfikir) Yakni dalam hal yang harus mereka fikirkan agar dapat mengambil pelajaran dan menjauhi larangan yang dikandungnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "21. Sekiranya Kami turunkan Alquran di atas gunung, dan gunung itu Kami jadikan memahami kandungannya juga nasehat dan keagungan Alquran. Maka engkau akan melihat gunung itu tunduk dan hancur sebab takut kepada Allah. Juga sebagai wujud pengagungan dan ketakutan kepada hukuman Allah. Permisalan di dalam Alquran tersebut dimaksudkan kepada manusia agar mereka senantiasa berfikir (koreksi diri), mengambil pelajaran dan bertaubat. Maksudnya adalah bahwa permisalan ini menunjukkan tentang kerasnya hati manusia, mereka meningalkan kekhusuan dalam mendengar dan menyimak ayat Alquran"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Seandainya Kami menurunkan Al-Qur’an ini kepada sebuah gunung, sungguh kamu akan melihatnya tunduk} tunduk {terpecah belah} terpecah {karena takut kepada Allah. Perumpamaan-perumpamaan itu Kami buat} Kami menjelaskannya {untuk manusia agar mereka berpikir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21. Ketika Allah memberi penjelasan pada para hanbaNya dan memberikan perintah serta larangan dalam kitabNya, maka ini mengharuskan mereka untuk segera menunaikan seruan dan doronganNya, meski seandainya hati mereka keras sekeras gunung yang kokoh. Karena al-Quran ini andai diturunkan di atas “sebuah gunung, pasti kamu akan melihatnya tunduk terpecah belah disebabkan takut kepada Allah.” Maksudnya, karena kesempurnaan pengaruhnya di hati, karena nasihat-nasihat al-quran adalah nasihat paling agung secara mutlak. Berbagai perintah dan larangan al-Quran berisikan hikmah dan maslahat yang selalu bersamaan. Perintah dan larangannya amat mudah bagi jiwa dan raga. Jauh dari segala sesuatu yang memberatkan. Tidak ada kontradiksi dan pertentangan, tidak ada sesuatu yang sulit dan menyimpang di dalam alQuran. Sesuai dengan segala waktu dan tempat serta cocok untuk setiap orang. Selanjutnya Allah memberitahukan bahwa Dia membuat perumpamaan untuk manusia dan menjelaskan halal dan haram dalam kitabNya untuk para hambaNya, agar mereka mau memikirkan dan merenungkan tanda-tanda kebesaran Allah. Karena dengan memikirkan tanda-tanda kebesaran Allah, seorang hamba akan mampu membuka berbagai perbendaharaan ilmu. Allah juga menjelaskan jalan kebaikan dan keburukan bagi para hambaNya, mendorong untuk berakhlak dan bersifat yang baik, dan melarang manusia dari berbagai akhlak buruk. Maka tidak ada yang lebih bermanfaat bagi seorang hamba daripada memikirkan dan merenungkan alQuran serta makna-maknanya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Hasyr ayat 21: Allah menyebutkan bahwa Al Qur’an ini adalah wadah yang berisi peringatan dan larangan, maka seandainya diturunkan kepada gunung, akan terpecah belah dan hancur karena sebab takut kepada Allah. Dan ketahuilah wahai manusia, permisalan ini dimisalkan kepada kalian agar kalian saling mengambil pelajaran untuk sampai kepada ridha Allah dan terlepas dari siksa neraka. Ini adalah himbauan akan kebesaran Al Qur’an dan besarnya dampaknya serta peringatan bagi orang-orang yang bermaksiat yaitu orang-orang kafir dan selain mereka, yang telingan mereka pura-pura tuli akan Al Qur’an."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala menerangkan kepada hamba-hamba-Nya apa yang telah Dia terangkan, demikian pula Dia telah menyebutkan perintah dan larangan, dimana hal ini mengharuskan mereka untuk bersegera kepada apa yang diserukan itu dan meskipun hati mereka dalam hal kerasnya seperti gunung, namun Al Qur’an ini karena dalam nasihatnya dan perintah-perintah dan larangan-larangannya mengandung hikmah dan maslahat, maka sekiranya diturunkan ke atas suatu gunung, tentu engkau akan melihat gunung tersebut tunduk terpecah belah karena takut kepada Allah Subhaanahu wa Ta'aala. Perintah-perintah itu perintah yang paling mudah bagi hati dan paling ringan bagi badan serta bersih dari taklif (pembebanan) yang berat dan menindas, dan perintah-perintah itu cocok di setiap waktu, tempat dan umat. Di penghujung ayat Allah Subhaanahu wa Ta'aala memberitahukan bahwa Dia membuat perumpamaan itu dan menerangkan yang halal dan yang haram kepada hamba-hamba-Nya adalah agar mereka memikirkan ayat-ayatnya dan mentadabburinya, karena dengan memikirkan dan mentadabburinya akan terbuka berbagai macam ilmu, menerangkan kepada seseorang jalan kebaikan dan keburukan, mendorongnya berakhlak mulia dan mencegahnya dari akhlak yang buruk, sehingga tidak ada yang paling memberikan manfaat bagi seorang hamba daripada memikirkan Al Qur’an dan mentadabburi maknanya. Dan ia dijadikan mampu membedakan seperti halnya manusia, sebagaimana disebutkan dalam tafsir Al Jalaalain."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hasyr Ayat 21",
    "description": "Allah menjelaskan bahwa Al-Qur'an diturunkan bagi manusia yang menggunakan nalar dan mengikuti hati nurani. Sekiranya kami turun-kan Al-Qur'an ini kepada sebuah gunung yang diberi akal, pikiran, dan perasaan seperti manusia; pasti kamu akan melihatnya tunduk terpecah belah disebabkan takut kepada Allah, karena gunung-gunung itu akan menggunakan nalar, rasa, dan nuraninya dalam memahami Al-Qur'an dan mengamalkannya. Dan perumpamaan-perumpamaan itu, yakni manusia yang kecil dan lemah dibandingkan dengan gunung yang begitu besar, tinggi dan keras; kami buat untuk manusia agar mereka berpikir bahwa gunung bisa menggunakan nalar, rasa dan nurani untuk memahami dan menerapkan Al-Qur'an hingga tunduk dan pecah karena takut kepada Allah. Mengapa manusia yang benar-benar memiliki nalar, rasa dan nurani tidak menggunakannya secara optimal dalam memahami dan menerapkan Al-Qur'an dalam kehidupan ini'22. Al-qur'an adalah wahyu Allah petunjuk bagi manusia. Pada ayat ini dan seterusnya hingga akhir surah, Allah menjelaskan al-asma' al-husna, nama-nama Allah yang indah. Apabila al-asma' al-'usna dipahami dan diresapkan secara mendalam ke dalam sanubari akan menguatkan keyakinan kepada-Nya. Dialah Allah tidak ada tuhan selain dia. Dia memperkenalkan nama-nama-Nya. Bila zat-Nya dipikirkan akan membingungkan, karena pikiran manusia tidak sanggup menjangkaunya; bila nama-Nya disebut akan menggetarkan hati yang beriman; bila sifat-Nya diuraikan akan mempesona; dan bila perbuatan-Nya diamati dengan cermat akan mengagumkan setiap manusia; karena itu tidak ada tuhan layak diibadati selain dia. Yang mengetahui yang gaib, karena pengetahuan-Nya tak terbatas; dan yang mengetahui yang nyata, karena pengetahuan-Nya meliputi zarrah. Dialah yang maha pengasih, yang kasih sayang-Nya tak mengenal batas; maha penyayang, yang rahmat-Nya kepada orang yang beriman sejak di dunia hingga di surga."
  }
]