[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "22. Allah adalah Tuhan Yang berhak disembah, Yang tidak ada Tuhan yang haq kecuali Dia, Yang mengetahui apa yang rahasia dan apa yang terang-terangan, mengetahui apa yang ghaib dan apa yang hadir, Dia Maha Pengasih yang rahmatNya meliputi segala sesuatu, juga Maha Penyayang kepada orang-orang yang beriman kepadaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "22-23. Dia lah Allah yang tiada sesembahan yang berhak disembah selain-Nya, Maha Mengetahui yang gaib dan yang nampak, tidak ada sesuatu pun dari hal itu yang luput dari-Nya. Maha Pengasih di dunia dan Akhirat serta Maha Penyayang di dunia dan Akhirat. Rahmat-Nya meliputi seluruh alam, Maharaja, Mahasuci dan bersih dari semua kekurangan, Mahaselamat dari semua aib, Yang membenarkan para Rasul-Nya dengan ayat-ayat yang jelas, Mahateliti atas amal perbuatan hamba-hamba-Nya, Maha Perkasa yang tidak ada sesuatu pun yang mengalahkan-Nya, Mahakuasa yang bisa memaksa segala sesuatu dengan kekuasaan-Nya dan Maha Memiliki segala keagungan. Mahasuci Allah dan Mahabersih dari apa yang disekutukan oleh orang-orang musyrik berupa berhala-berhala dan lainnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "22. Allah menjelaskan dalam tiga ayat terakhir ini beberapa asma’ul husna dan sifat-sifat Allah. Allah adalah Tuhan yang berhak disembah, tidak ada Tuhan selain Dia. Allah Maha Mengetahui segala yang tidak diketahui seluruh makhluk-Nya, Maha Mengetahui yang mereka saksikan dan ketahui; dan Dia Maha Pengasih bagi seluruh makhluk di dunia, dan Maha Penyayang bagi orang-orang beriman di dunia dan akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "22. عٰلِمُ الْغَيْبِ وَالشَّهٰدَةِ ۖ (Yang Mengetahui yang ghaib dan yang nyata) Yakni Allah mengetahui apa yang tersembunyi dari panca indra atau yang nampak."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "22. Dialah Allah, yang tidak ada Tuhan yang berhak disembah kecuali Dia. Tidak ada Tuhan selain Allah. Yang Maha Tahu atas segala yang ghaib, isi hati dan segala yang terlihat. Allah Maha Tahu atas segala yang berwujud materi maupun tidak. Kemahatahuan Allah meliputi segala yang ghaib maupun yang tampak. Yang Maha Luas sifat pengasih-Nya kepada para hamba-Nya, Maha Pengasih selamanya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dialah Allah Dzat Yang tidak ada tuhan selain Dia} Tidak ada yang layak disembah selain Dia {Dzat Yang Mengetahui yang ghaib dan yang nyata} Mengetahui apa yang ghaib dan yang tampak {Dialah Yang Maha Pengasih lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "22. Ayat-ayat mulia ini mencakup banyak nama-nama Allah yang baik dan sifat-sifatNya yang luhur. Agung perihalNya dan indah penjelasanNya. Allah memberitahukan bahwa sesungguhnya Dia adalah “Allah,” yang dipertuhankan dan disembah yang “tiada tuhan yang berhak disembah melainkan Dia,” karena sempurnanya keagungan Allah dan kebaikanNya serta pengaturanNya yang menyeluruh. Semua tuhan selain Allah adalah batil dan sama sekali tidak berhak disembah. Karena semua tuhan selain Allah amat memerlukan yang lain, lemah dan kurang, yang tidak memiliki kekuasaan atas dirinya sendiri maupun untuk yang lain. Selanjutnya Allah menyifati DiriNya dengan keumuman ilmu yang mencakup semua hal yang tidak nampak dari makhluk dan yang nampak (yang dapat dilihat oleh para makhluk). Allah juga menjelaskan rahmatNya yang menyeluruh yang mencakup segala hal dan sampai pada setiap yang hidup."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Hasyr ayat 22: Kemudian Allah tutup surat ini dengan sejumlah nama-nama Allah yang baik, yang Dia berhak memiliknya dan Maha Pengampun. Allah mengabarkan bahwa Allah yang menguasai hati, Dia yang diibadahi dengan benar tanpa sekutu, tidak ada Tuhan selain Dia tidak juga Rabb selain-Nya. Dia yang mengetahui yang tersembunyi dan yang nampak, mengetahui yang ghaib di mata manusia dan manusia tidak mengetahui yang ia saksikan dan tidak mengetahui ilmunya. Dialah Allah yang memiliki rahmat yang luas, yang umum; Dimana Dia maha luas atas segala sesuatunya dan yang sampai pada semua yang hidup, Dialah yang memiliki kasih sayang di dunia dan di akhirat yang merahmati keduanya. Para ulama menguatkan bahwa lafadz Allah ada nama yang agung, dan telah disebutkan di dalam Al Qur’an 2602 kali, yang semuanya kembali kepada Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini dan setelahnya mengandung banyak nama-nama Allah Subhaanahu wa Ta'aala yang indah dan sifat-sifat-Nya yang tinggi, agung perkaranya dan indah buktinya. Dia memberitahukan bahwa Allah Subhaanahu wa Ta'aala adalah Tuhan yang berhak disembah karena kesempurnaan-Nya, ihsan-Nya yang merata dan pengaturan-Nya yang menyeluruh. Oleh karena itu, segala sesembahan selain-Nya adalah batil; tidak berhak disembah karena keadaannya yang fakir, lemah dan memiliki banyak kekurangan serta tidak berkuasa apa-apa terhadap dirinya maupun selainnya. Selanjutnya Allah Subhaanahu wa Ta'aala menyifati Diri-Nya dengan pengetahuan-Nya yang menyeluruh baik yang gaib bagi makhluk maupun yang tidak gaib (tampak), demikian juga dengan meratanya rahmat-Nya yang mengena kepada segala sesuatu. Selanjutnya, Allah Subhaanahu wa Ta'aala mengulangi lagi uluhiyyah-Nya (keberhakan-Nya diibadahi, tidak selain-Nya), dan bahwa Dia yang memiliki segala sesuatu baik alam bagian atas, alam bagian bawah maupun penghuninya, semuanya milik Allah, butuh kepada-Nya dan diatur-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hasyr Ayat 22",
    "description": "Al-qur'an adalah wahyu Allah petunjuk bagi manusia. Pada ayat ini dan seterusnya hingga akhir surah, Allah menjelaskan al-asma' al-husna, nama-nama Allah yang indah. Apabila al-asma' al-'usna dipahami dan diresapkan secara mendalam ke dalam sanubari akan menguatkan keyakinan kepada-Nya. Dialah Allah tidak ada tuhan selain dia. Dia memperkenalkan nama-nama-Nya. Bila zat-Nya dipikirkan akan membingungkan, karena pikiran manusia tidak sanggup menjangkaunya; bila nama-Nya disebut akan menggetarkan hati yang beriman; bila sifat-Nya diuraikan akan mempesona; dan bila perbuatan-Nya diamati dengan cermat akan mengagumkan setiap manusia; karena itu tidak ada tuhan layak diibadati selain dia. Yang mengetahui yang gaib, karena pengetahuan-Nya tak terbatas; dan yang mengetahui yang nyata, karena pengetahuan-Nya meliputi zarrah. Dialah yang maha pengasih, yang kasih sayang-Nya tak mengenal batas; maha penyayang, yang rahmat-Nya kepada orang yang beriman sejak di dunia hingga di surga. 23. Dialah Allah tidak ada tuhan selain dia, tidak ada tuhan yang berhak diibadati selain dia. Maharaja, yang kekuasaan-Nya tak terbatas; yang mahasuci dari segala bentuk kekurangan; yang mahasejahtera, yang menjadi sumber kedamaian yang didambakan manusia; yang menjaga keamanan, yang pengayoman-Nya lengkap, sempurna, dan menyeluruh. Pemelihara keselamatan manusia, terutama di akhirat; yang mahaperkasa mencabut kekuasaan para penguasa dunia; yang mahakuasa menghentikan paksa ambisi para pecandu kekuasaan. Yang memiliki segala keagungan. Mahasuci Allah dari apa yang mereka persekutukan, karena Allah berbeda dengan seluruh makhluk ciptaan-Nya."
  }
]