[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "23. Dia- lah Allah, Tuhan yang berhak disembah, Yang tidak ada tuhan yang haq selainNya, Pemilik segala sesuatu, Yang bertindak terhadapnya tanpa ditolak dan dihalangi, Yang disucikan dari segala kekurangan, Yang selamat dari segala aib, Yang membenarkan para nabi dan RasulNya dengan apa Yang Dia mengutus mereka dengannya, yaitu ayat-ayat yang jelas, Yang mengawasi seluruh makhlukNya dalam seluruh amal perbuatan mereka, Yang Mahaperkasa Yang tidak terkalahkan, Yang Mahakuat Yang mengalahkan seluruh hambaNya, dan seluruh makhluk tunduk kepadaNya, Yang memiliki segala keagungan dan kebesaran, Mahasuci Allah dari segala apa yang mereka sekutukan denganNya dalam beribadah kepadaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "22-23. Dia lah Allah yang tiada sesembahan yang berhak disembah selain-Nya, Maha Mengetahui yang gaib dan yang nampak, tidak ada sesuatu pun dari hal itu yang luput dari-Nya. Maha Pengasih di dunia dan Akhirat serta Maha Penyayang di dunia dan Akhirat. Rahmat-Nya meliputi seluruh alam, Maharaja, Mahasuci dan bersih dari semua kekurangan, Mahaselamat dari semua aib, Yang membenarkan para Rasul-Nya dengan ayat-ayat yang jelas, Mahateliti atas amal perbuatan hamba-hamba-Nya, Maha Perkasa yang tidak ada sesuatu pun yang mengalahkan-Nya, Mahakuasa yang bisa memaksa segala sesuatu dengan kekuasaan-Nya dan Maha Memiliki segala keagungan. Mahasuci Allah dan Mahabersih dari apa yang disekutukan oleh orang-orang musyrik berupa berhala-berhala dan lainnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "23. Allah adalah Tuhan yang berhak disembah, tidak ada Tuhan selain Dia. Raja atas segalanya, Yang Mengatur seluruh makhluk-Nya, al-Quddus: Maha Suci dari segala kekurangan, as-Salam: Maha Selamat dari segala aib, al-Mu’min: Maha Membenarkan para rasul dan nabi-Nya dengan menampakkan berbagai mukjizat melalui tangan mereka, al-Muhaimin: Yang Maha Mengawasi segala-Nya, al-Aziz: Yang Maha Perkasa, al-Jabbar: Yang Maha Mengusai seluruh makhluk-Nya, al-Mutakabbir: Yang Maha Memiliki kebesaran dan keagungan. Maha Suci Allah dari segala sekutu yang mereka sandingkan dengan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "23. هُوَ اللهُ الَّذِى لَآ إِلٰهَ إِلَّا هُوَ (Dialah Allah Yang tiada Tuhan selain Dia) Allah mengulangi kalimat ini sebagai penekanan dan pengikraran. الْمَلِكُ الْقُدُّوسُ(Raja, Yang Maha Suci) Yakni suci dari segala aib yang tidak layak ada pada diri-Nya. Pendapat lain mengatakan maknanya adalah Allah tidak akan menzalimi makhluk-Nya. الْمُؤْمِنُ (Yang Mengaruniakan Keamanan) Yakni Yang memberi keamanan bagi hamba-Nya dari kezaliman. Pendapat lain mengatakan maknanya adalah Yang membenarkan rasul-rasul-Nya dengan memberi mereka mukjizat. الْمُهَيْمِنُ(Yang Maha Memelihara) Yakni yang menyaksikan dan mengawasi amal perbuatan hamba-hamba-Nya. الْعَزِيزُ(Yang Maha Perkasa) Yakni yang Maha perkasa dan kuasa yang tidak akan terkalahkan. الْجَبَّارُ(Yang Maha Kuasa) Yakni yang maha agung. Pendapat lain mengatakan maknanya adalah yang kekuatan-Nya tidak mampu dihadapi. الْمُتَكَبِّرُ ۚ( Yang Memiliki segala Kesombongan) Yakni Maha Tinggi dari segala kekurangan, dan Maha Agung dari segala yang tidak pantas bagi-Nya. dan sifat sombong pada Dzat Allah adalah pujian, sedangkan pada diri makhluk adalah keburukan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "23. Dialah Allah yang tidak ada Tuhan yang berhak disembah kecuali Dia. Allah Sang Penguasa segala sesuatu. Yang bersih dari segala kekurangan, dan Yang Suci dari segala aib. Bersih dari segala kekurangan dan aib. Bersih dari segala bahaya. Yang Maha Memberi keamanan untuk hamba-Nya dari kedhaliman. Yang Maha membenarkan risalah-Nya yang disampaikan. Penguasa Kerajaan Yang Maha Mengawasi hamba-Nya. Kekuasaan/Kekuatan-Nya menyelimuti segala sesuatu. Pemilik keagungan. Segala sesuatu tunduk kepada perintah-Nya. Yang Maha Besar dan Maha Luhur dan Tinggi dari segala cela. Allah bersih dari sebutan kaum musyrik yang menyatakan bahwa Allah mempunyai sekutu ataupun anak"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dialah Allah Dzaat Yang tidak ada tuhan selain Dia. Dia Dzat Yang Maha Merajai} Merajai segala sesuatu lagi mengaturnya {Yang Maha suci} Yang suci dari segala kekurangan {Yang Maha Sejahtera} Maha Bersih dari segala aib {Yang Maha Memberi keamanan} Yang membenarkan para rasul dan nabiNya dengan ayat-ayat yang terang {Maha Mengawasi} Mengawasi ciptaanNya dengan amal-amal mereka {Yang Maha perkasa} Maha Kuat lagi Maha Menaklukkan yang tidak bisa ditaklukkan {Yang Maha kuasa} Maka Kuasa dengan kekuasaanNya atas segala sesuatu {dan Dzat Yang Maha Memiliki segala keagungan} Dzat Yang memiliki segala kebesaran dan keagungan {Maha suci Allah} Maha suci Allah SWT {dari apa yang mereka persekutukan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "23. Kemudian Allah mengulangi lagi menyebutkan keumuman ketuhanan dan kemahaesaanNya dalam ketuhanan. Allah adalah raja segala raja. Alam yang ada di atas dan alam yang ada dibawah, semuanya adalah milik Allah, semuanya memerlukan bantuan Allah dan semuanya diatur oleh Allah “Yang Mahasuci, Yang Mahasejahtera,” maksudnya, Mahasuci dan Selamat dari berbagai aib, cela, dan segala sesuatu yang bisa mengurangi keagungan dan keluhuran. Karena kesucian itu menunjukkan bebasnya dari berbagai kekurangan serta MahaagungNya Allah dalam sifat-sifat dan keluhuranNya. “Yang Mengaruniakan keamanan,” maksudnya Yang membenarkan para rasul dan para nabiNya dan semua yang dibawa oleh mereka dengan berbagai tanda-tanda kebesaran, penjelasan yang nyata dan pasti, serta hujjah yang jelas. “Yang Mahaperkasa,” yang tidak terkalahkan dan terhalang, Dia-lah yang Maha menundukkan secara paksa segala sesuatu, segala sesuatu tunduk padaNya, “Yang Mahakuasa,” yang memaksa semua hambaNya, dan semua makhlukNya tunduk kepadaNya, yang membenahi segala yang rusak dan yang memberi kecukupan orang-orang miskin, “Yang Memiliki Segala Keagungan,” yang memiliki keagungan dan kebesaran. Jauh dari segala aib dan kezhaliman. “Mahasuci Allah dari apa yang mereka persekutukan.” Ini adalah pemahasucian secara umum dari segala sesuatu yang disifatkan oleh orang yang menyekutukan dan menentangNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Hasyr ayat 23: Kemudian untuk kedua kalinya Allah menegaskan bahwa Dialah Allah ayng tidak ada sesembahan yang berhak diibadahi dengan benar kecuali hanya Dia, tidak ada selain-Nya. Dan Allah mementingkan dan perhatian dalam permasalahan tauhid. Allah mengabarkan bahwa Dia adalah raja yang tidak akan hilang kerajaan-Nya. Dia yang menguasai atas perintah dan larangan bagi makhluk-Nya. Dialah raja yang bagi makhluk wajib taat dibawah kerajaan-Nya, kekuasaan-Nya dan keinginan-Nya. Dia yang suci dari segala keburukan dan disucikan dari segala kekurangan. Orang yang beriman, yang diberikan kenikmatan beribadah dengan rasa aman, iman dan ketenangan; Serta membenarkan kerisalahan Nabi yang menampakkan mukjizat. Dialah yang mengawasi, dengan keagungan-Nya dan kemuliaan-Nya atas seluruh makhluknya yang di antara mereka ada yang menjadi raja, pembesar, dan pemimpin. Dialah yang gagah, yang tidak ada sesuatupun yang mengalahkan dan menaklukkan-Nya. Dialah yang memiliki segala kebesaran yang memiliki kesombongan dan keagungan. Maka sucikanlah Allah dan sucikan karena kemuliaan dan keagungan-Nya, dalam ucapan dan perbuatan orang-orang yang menyekutukan Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dari segala yang tidak layak bagi-Nya. Yang selamat dari aib dan kekurangan; yang diagungkan dan dimuliakan. Bisa juga diartikan yang membenarkan para rasul-Nya dengan ayat dan mukjizat, dengan hujjah dan bukti. Dia tidak dapat dikalahkan, bahkan Dia menundukkan segala sesuatu dan segala sesuatu tunduk kepada-Nya. Dia menundukkan semua makhluk, menutupi hati orang yang sedih dan mengkayakan orang yang fakir. Dia memiliki kebesaran dan keagungan, Dia bersih dari segala aib, kekurangan dan kezaliman. Ini adalah pensucian-Nya secara umum dari segala sifat yang diberikan orang-orang musyrik untuk-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hasyr Ayat 23",
    "description": "Dialah Allah tidak ada tuhan selain dia, tidak ada tuhan yang berhak diibadati selain dia. Maharaja, yang kekuasaan-Nya tak terbatas; yang mahasuci dari segala bentuk kekurangan; yang mahasejahtera, yang menjadi sumber kedamaian yang didambakan manusia; yang menjaga keamanan, yang pengayoman-Nya lengkap, sempurna, dan menyeluruh. Pemelihara keselamatan manusia, terutama di akhirat; yang mahaperkasa mencabut kekuasaan para penguasa dunia; yang mahakuasa menghentikan paksa ambisi para pecandu kekuasaan. Yang memiliki segala keagungan. Mahasuci Allah dari apa yang mereka persekutukan, karena Allah berbeda dengan seluruh makhluk ciptaan-Nya. 24. Dialah Allah yang menciptakan seluruh makhluk dengan hikmah yang mengagumkan. Yang mengadakan segala sesuatu dari tiada menjadi ada. Yang membentuk rupa manusia ketika masih janin dalam rahim. Dia memiliki nama-nama yang indah yang menggambarkan sifat dan perbuatan-Nya yang mempesona. Apa yang di langit: bintang, bulan, planet, dan seluruh isi galaksi dan apa yang ada di bumi lautan, daratan, gunung, sungai, tumbuh-tumbuhan, hewan, dan lain-lain semuanya bertasbih kepada-Nya, tetapi manusia tidak memahami tas-bihnya. Dan dia-lah yang mahaperkasa menghentikan rencana dan harapan manusia dengan kematian. Mahabijaksana dalam memperlakukan manusia dan menata jagat raya."
  }
]