[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "24. Dia-lah Allah, Yang Maha Pencipta, Yang menetapkan takdir para makhluk, Yang membuat, mengadakan, dan menumbuhkan mereka sesuai dengan hikmahNya, Yang membentuk makhlukNya bagaimana Allah berkehendak. Milik Allah-lah Asma’ul Husna dan sifat-sifat yang tinggi, seluruh apa yang ada di langit dan di bumi bertasbih kepada Allah. Allah Maha perkasa, Pemilik hukuman berat atas musuh-musuhNya, Mahabijaksana dalam pengaturanNYa terhadap urusan makhlukNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. Dia lah Allah Yang Maha Pencipta yang menciptakan segala sesuatu, yang mengadakan segala sesuatu, Maha Pembentuk makhluk-makhluk-Nya sesuai dengan keinginan-Nya, Dia memiliki al-Asma`ul Husna (nama-nama yang Maha indah) yang mencakup seluruh sifat-sifat-Nya yang tinggi. Seluruh yang ada di langit dan di bumi menyucikan-Nya dari setiap kekurangan, Maha Perkasa yang tidak ada seorang pun yang mampu mengalahkan-Nya, Maha Bijaksana di dalam penciptaan-Nya, syariat-Nya dan takdir-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "24. Allah Maha Pencipta seluruh makhluk, Maha Membentuk ciptaan-Nya dengan bentuk yang Dia kehendaki. Dia memiliki banyak asma’ul husna; seluruh makhluk di tujuh langit dan bumi bertasbih dan bertahmid kepada-Nya. Dia Maha Perkasa dalam kerajaan-Nya dan Maha Bijaksana dalam mengatur urusan makhluk-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "24. هُوَ اللهُ الْخٰلِقُ (Dialah Allah Yang Menciptakan) Yakni yang mengatur segala sesuatu sesuai dengan kehendak-Nya. الْبَارِئُ (Yang Mengadakan) Yakni Maha Pencipta segala sesuatu. الْمُصَوِّرُ ۖ( Yang Membentuk Rupa) Yakni yang membentuk rupa dengan segala bentuknya yang berbeda-beda. لَهُ الْأَسْمَآءُ الْحُسْنَىٰ ۚ( Yang Mempunyai Asmaaul Husna) Telah dijelaskan kalimat ini sebelumnya pada surat al-A’raf: 180. يُسَبِّحُ لَهُۥ مَا فِى السَّمٰوٰتِ وَالْأَرْضِ ۖ( Bertasbih kepada-Nya apa yang di langit dan bumi) Yakni segala yang ada di langit dan bumi mengucapkan tasbih dengan lisan dan keadaan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "24. Allah Maha Memutuskan segala sesuatu sesuai kehendak-Nya, ini lah maksud dari ayat ini. Allah-lah Yang menumbuhkan segala sesuatu yang sebelumnya tidak ada. Artinya Allah-lah Yang menjadikan sesuatu ada dari ketidakadaannya, inilah makna dari Pencipta sebagai Yang Menumbuhkan. Allah Maha Memberi bentuk atas segala sesuatu atas kehendak-Nya. Allah memiliki nama-nama yang menunjukkan kesempurnaan dan ketinggian sifat luhur-Nya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dialah Allah Yang Maha Pencipta} Yang berkuasa atas segala sesuatu untuk menetapkan hukumNya {Yang Maha Mewujudkan dari yang tidak ada} Yang mengadakan sesuatu itu setelah tidak ada {dan Maha Yang Membentuk sesuatu. Dia memiliki nama-nama yang indah. Apa yang di langit dan di bumi senantiasa bertasbih kepadaNya. Dialah Yang Maha perkasa lagi Maha bijaksana}"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "24. “Dia-lah Allah Yang Menciptakan” semua makhluk, “Yang Mengadakan” bagi semua yang diadakan, “Yang Membentuk rupa” semua wujud. Nama-nama indah ini berkaitan dengan penciptaan, pengaturan, dan penetapan ukuran. Semua itu hanya Allah semata yang melakukannya, tidak ada satu sekutu pun yang menyertai Allah dalam hal itu. “Yang Mempunyai Nama-nama Yang Paling Baik.” Maksudnya, Dia memiliki nama-nama yang amat banyak sekali, yang tida dapat dihitung dan diketahui melainkan Dia sendiri. Meski demikian, semua namaNya indah. Maksudnya, sifat-sifat yang sempura bahkan menunjukkan sifat-sifat yang paling sempurna dan agung, tidak ada satu pun kekurangan pada masing-masingnya dari segala sisi. Di antara keindahannya, Allah menyukainya dan mencintai orang yang mencintainya serta mencintai hambaNya yang berdoa dan meminta dengan nama-nama indahNya. Dan di antara tanda kesempurnaan Allah adalah Dia memiliki nama-nama indah dan sifat-sifat agung. Semua makhluk yang ada di langit dan di bumi memerlukan bantuan Allah selamanya. Semuanya bertasbih memahasucikanNya dengan memujiNya. Mereka meminta kepadaNya segala yang mereka perlukan. Kemudian Allah memberi mereka karena kemuliaan dan karuniaNya sesuai rahmat dan hikmahNya. “Dan Dia-lah Yang Mahaperkasa lagi Mahabijaksana.” Yang tidaklah menginginkan sesuatu melainkan pasti terjadi dan tidaklah menciptakan sesuatu melainkan karena hikmah dan maslahat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Hasyr ayat 24: Allah mengabarkan bahwa Dia Tuhan yang menciptakan segala sesuatu. Dialah yang mengadakan dengan mewujudkan sesuatu yang baru. Yang ada tanpa ketiadaan, yang membentuk segala makhluk atas apa yang dikehendaki-Nya, yan memiliki nama dan sifat yang mulia. Allah disucikan dari sifat yang lemah dan kurang atas segala sesuatunya. Karena Dia yang maha kuat, tidak ada sesuatu yang mengalahkan. Yang maha menghakimi atas segala urusan yang Dia kerjakan. Dan telah datang dari hadits yang diriwayatkan dari Ahmad, Darimi dan Tirmidzi, yang dihasankan oleh Bihaqi dalam Syuaibul Iman : Barangsiapa yang mengucapkan ketika bertasbih sepuluh kali : Audzubillahis Sami’il Alim minasy Syaithanir Rajim, dan membaca ayat terakhir dalam surat Al Hasyr, maka Allah akan mengutus 70.000 malaikat yang bershalawat kepadanya (di pagi hari), sampai sore hari, dan jika ia mati pada hari itu, dia akan mati syahid. Dan yang membaca pada sore hari, maka keadaannya demikian juga. Selesai surat Al Hasyr pada pagi hari Ied dari bulan ramadhan 1434 H. Segala puji bagi Allah atas pertolongan-Nya, dan semoga shalawat dan salam atas Nabi kita Muhammad, dan kepada keluarganya dan sahabatnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Nama-nama ini terkait dengan menciptakan, mengatur dan menentukan, dimana semua itu hanya Allah Subhaanahu wa Ta'aala yang melakukan tanpa ada sekutu. Dia memiliki nama-nama yang banyak sekali, dimana tidak ada yang dapat menjumlahkannya selain Allah Subhaanahu wa Ta'aala. Meskpun begitu, semua nama-Nya adalah indah, sifat-sifat yang sempurna, bahkan menunjukkan sifat yang paling sempurna dan paling agung, dimana tidak ada kekurangan di sana dari berbagai sisi. Di antara indahnya adalah bahwa Allah Subhaanahu wa Ta'aala menyukainya, menyukai orang yang menyukainya dan menyukai orang-orang yang berdoa dan meminta dengan nama-nama itu. Demikian pula di antara sempurnanya dan bahwa Dia memiliki nama-nama yang indah dan sifat-sifat yang tinggi adalah bahwa semua yang ada di langit dan di bumi butuh terus kepada-Nya, bertasbih dengan memuji-Nya, meminta dipenuhi kebutuhannya, lalu Dia memberikan apa yang mereka minta itu dari karunia-Nya dan kemurahan-Nya yang dikehendaki oleh rahmat dan hikmah-Nya. Apa yang dikehendaki-Nya pasti terjadi dan hal itu tidak terjadi kecuali karena hikmah dan maslahat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hasyr Ayat 24",
    "description": "Dialah Allah yang menciptakan seluruh makhluk dengan hikmah yang mengagumkan. Yang mengadakan segala sesuatu dari tiada menjadi ada. Yang membentuk rupa manusia ketika masih janin dalam rahim. Dia memiliki nama-nama yang indah yang menggambarkan sifat dan perbuatan-Nya yang mempesona. Apa yang di langit: bintang, bulan, planet, dan seluruh isi galaksi dan apa yang ada di bumi lautan, daratan, gunung, sungai, tumbuh-tumbuhan, hewan, dan lain-lain semuanya bertasbih kepada-Nya, tetapi manusia tidak memahami tas-bihnya. Dan dia-lah yang mahaperkasa menghentikan rencana dan harapan manusia dengan kematian. Mahabijaksana dalam memperlakukan manusia dan menata jagat raya. 1. Wahai orang-orang yang beriman di mana pun dan kapan pun kamu hidup! janganlah kamu menjadikan musuh-ku, yaitu mereka yang menolak ajaran-ku, dan musuhmu yang membenci, menganiaya, berencana membunuh dan mengusir kamu dari tanah kelahiran kamu hanya karena kamu beriman kepada-ku sebagai teman setia sehingga kamu merasa perlu menyampaikan kepada mereka informasi tentang nabi Muhammad yang membahayakan islam dan kaum muslim, karena kasih sayang kamu kepada mereka, padahal mereka telah ingkar kepada kebenaran, menolak beriman kepada Al-Qur'an yang disampaikan kepada kamu melalui rasulullah. Mereka mengusir rasul dan kamu sendiri, ketika kamu bersama rasulullah berada di mekah sebelum hijrah ke madinah, tanpa ada alasan apa pun hanya karena kamu beriman kepada Allah, tuhan kamu, yang memelihara kamu dan seluruh jagat raya. Janganlah kamu berbuat demikan, bersahabat dengan orang-orang kafir dan membocorkan rahasia kepada mereka, jika kamu benar-benar keluar dari kota kelahiran kamu, mekah dan berhijrah ke madinah bersama rasul untuk berjihad pada jalan-ku guna mengharumkan islam dan kaum muslim. Kamu benar-benar pengkhianat, karena kamu memberitahukan secara rahasia informasi-informasi tentang nabi Muhammad kepada mereka, yang membahayakan islam dan kaum muslim serta keamanan negara madinah, karena kecintaan kamu kepada mereka, dan aku lebih mengetahui apa yang kamu sembunyikan dari rasul dan kaum muslim dan apa yang kamu nyatakan secara terbuka di hadapan publik. Dan barang siapa di antara kamu, wahai orang-orang beriman, melakukannya, membocorkan rahasia kepada orang-orang kafir, maka sungguh dia telah tersesat dari jalan yang lurus hingga bertobat dan kembali setia kepada ajaran islam."
  }
]