[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "3. Bila Allah tidak menetapkan mereka terusir dari negeri mereka dan memutuskannya, niscaya Allah menyiksa mereka di dunia dengan terbunuh dan ditawan, dan bagi mereka azab neraka di akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Dan kalau bukan karena Allah telah menentukan mereka keluar dan terusir dari rumah-rumah mereka niscaya Allah akan menyiksa mereka di dunia dengan dibunuh dan ditawan sebagaimana yang terjadi pada saudara-saudara mereka dari Bani Quraiẓah, dan bagi mereka di Akhirat siksa Neraka yang menunggu, mereka kekal di dalamnya selama-lamanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "3. Kalaulah Allah tidak menetapkan bagi orang-orang Yahudi itu untuk keluar dari tempat tinggal mereka, niscaya Allah akan mengazab mereka di dunia dengan terbunuh atau tertawan; dan di akhirat mereka akan mendapat azab neraka Jahannam. Ibnu Umar meriwayatkan bahwa orang-orang Yahudi Bani Nadhir dan Quraizhah memerangi Rasulullah; maka Rasulullah mengusir Bani Nadhir dari Madinah, dan memaafkan Bani Quraizhah dan membiarkan mereka tetap di Madinah hingga mereka kembali memerangi Rasulullah setelah itu; maka ditetapkan bagi mereka kaum lelaki harus dibunuh, sedangkan kaum wanita dan anak-anak, serta harta mereka dibagikan kepada kaum muslimin; kecuali sebagian di antara mereka yang bergabung dengan Rasulullah, maka beliau memberi jaminan keamanan bagi mereka dan akhirnya mereka masuk Islam. Rasulullah mengusir seluruh kaum Yahudi dari Madinah; Bani Qainuqa’ (yang merupakan kaum Abdullah bin Salam), Bani Haritsah, dan seluruh kaum Yahudi lainnya yang ada di Madinah. (Shahih Muslim 3/1387-1388, kitab jihad, bab pengusiran Kaum Yahudi dari Hijaz, no. 1766)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. وَلَوْلَآ أَن كَتَبَ اللهُ عَلَيْهِمُ الْجَلَآءَ لَعَذَّبَهُمْ فِى الدُّنْيَا ۖ (Dan jika tidaklah karena Allah telah menetapkan pengusiran terhadap mereka, benar-benar Allah mengazab mereka di dunia) Yakni kalaulah bukan karena Allah telah menetapkan bagi mereka untuk keluar dari pemukiman mereka niscaya Allah akan mengazab mereka di dunia dengan terbunuh dan tertawan sebagaimana yang Allah tetapkan bagi Bani Quraizhah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Adapun jika Allah tidak menetapkan untuk mengusir Yahudi Bani Nadhir dari kampung halaman/rumah mereka, maka Allah sudah pasti mengazab mereka di dunia dengan membinasakan dan mengutuk mereka. Sebagaimana yang terjadi pada Bani Quraidhoh. Allah juga akan mengazab mereka di akhirat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sekiranya bukan karena Allah telah menetapkan pengusiran terhadap mereka} pengusiran dari rumah mereka {Sungguh Dia telah mengazab mereka di dunia. Dan bagi mereka di akhirat azab neraka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3. Kemudian Allah mengabarkan kepada kita bahwasanya orang-orang Yahudi tidak mendapatkan semua hukuman yang menjadi hak mereka, dan bahwasanya Allah telah meringankannya atas mereka. Kalaulah bukan karena Allah telah menetapkan pengusiran yang mereka alami dan merupakan ketentuan Allah yang tidak mungkin dirubah, niscaya mereka akan mendapatkan azab pedih dunia, sesungguhnya mereka akan mendapatkan siksaan api neraka yang tidak ada yang mengetahui kedahsyatannya melainkan hanya Allah. Tidaklah terbetik dalam benak mereka bahwa siksaan mereka telah selesai dan tidak ada sisa azab sedikitpun, namun apa yang telah Allah siapkan bagi mereka berupa azab di akhirat adalah lebih besar dan lebih mengerikan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Hasyr ayat 3: Allah mengabarkan kalau lah bukan Allah telah mengusir mereka karena kuasa-Nya atas mereka; Sungguh mereka akan mendapatkan adzab Allah di dunia dengan dibunuh dan ditangkap sebagaimana yang dilakukan terhadap bani quraidzah, mereka di akhirat akan mendapatkan adzab pedih yang hina, dan tidaklah tahu kuasa Allah kecuali Allah sendiri."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala memberitahukan bahwa orang-orang Yahudi belum mendapatkan semua hukuman dan bahwa Allah Subhaanahu wa Ta'aala meringankan hal itu untuk mereka. Kalau bukan karena Allah Subhaanahu wa Ta'aala telah menetapkan pengusiran untuk mereka tentu mereka mendapatkan hukuman yang lain di dunia. Meskipun begitu, mereka tetap akan mendapatkan azab neraka di akhirat yang tidak mungkin diketahui dahsyatnya kecuali oleh Allah Subhaanahu wa Ta'aala. Oleh karena itu, janganlah mereka mengira bahwa hukuman untuk mereka telah selesai dan tidak ada lagi, bahkan azab yang Allah sediakan untuk mereka di akhirat lebih besar dan lebih merata. Hal itu, sebagaimana yang diterangkan dalam ayat selanjutnya karena mereka menentang Allah dan Rasul-Nya, memusuhi dan memerangi keduanya serta berusaha mendurhakai keduanya. Itulah kebiasan yang berlaku bagi orang-orang yang menentang keduanya, dan barang siapa menentang Allah, maka sesungguhnya Allah sangat keras hukuman-Nya. Dengan dibunuh dan ditawan sebagaimana yang Dia lakukan terhadap Bani Quraizhah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hasyr Ayat 3",
    "description": "Pengusiran yahudi itu bisa terjadi karena dua hal; kepemimpinan rasulullah yang tegas dan keridaan Allah terhadap kaum muslim. Dan sekiranya tidak karena persetujuan Allah yang telah menetapkan hukum sebab-akibat yang menjadi dasar pengusiran mereka, kabilah-kabilah yahudi dari madinah, pasti Allah tetap mengazab mereka dengan cara lain di dalam kehidupan dunia sebagai balasan atas pengkhianatan mereka. Dan di akhirat mereka tetap akan mendapat azab neraka yang pedih selama-lamanya. 4. Adapun yang demikian itu, perintah pengusiran bani qainuqa', bani nadir dan bani quraizah dari madinah, walaupun mereka sudah mengikat perjanjian damai dengan rasulullah, karena sesungguhnya mereka menentang Allah dengan menolak beriman dan menentang rasul-Nya dengan merencanakan untuk membunuh beliau, padahal mereka mengetahui bahwa nabi Muhammad itu utusan Allah. Barang siapa menentang Allah dengan membangkang, berkhianat, dan mengacau keamanan, maka sesungguhnya Allah sangat keras hukuman-Nya kepada mereka dengan pengusiran dan penghinaan, serta di akhirat dengan kekal di dalam neraka."
  }
]