[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "4. Apa yang menimpa orang-orang Yahudi di dunia dan azab yang menunggu mereka di akhirat, adalah karena mereka menyelisihi perintah Allah dan RasulNya dengan penyelisihan yang berat, mereka memerangi keduanya dan berusaha mendurhakai keduanya. Barangsiapa menyelisihi Allah dan RasulNya, maka sesungguhnya Allah memiliki hukuman yang keras."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Kejadian yang menimpa mereka itu terjadi karena mereka memusuhi Allah dan memusuhi Rasul-Nya dengan kekufuran dan pengingkaran mereka terhadap perjanjian-perjanjian. Barangsiapa memusuhi Allah sesungguhnya Allah sangat pedih siksa-Nya, maka mereka akan mendapatkan siksa-Nya yang pedih itu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "4. Balasan besar berupa pengusiran itu karena mereka selalu menentang perintah Allah dan Rasulullah. dan barangsiapa yang menentang perintah Allah dan Rasulullah maka siksa Allah baginya sangat berat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. بِأَنَّهُمْ شَآقُّوا۟ اللهَ وَرَسُولَهُۥ ۖ (karena Sesungguhnya mereka menentang Allah dan Rasul-Nya) Yakni akibat mereka memusuhi Allah dan Rasulullah, dan karena mereka melanggar perjanjian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Pengusiran itu sebab perbuatan mereka sendiri yang membangkang dan memusuhi perintah Allah dan rasul-Nya. Mereka juga berusaha membunuh nabi SAW. Orang-orang yang memusuhi dan durhaka kepada Allah sungguh akan di hukum dengan sangat pedih"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Yang demikian itu karena sesungguhnya mereka telah menentang} menentang {Allah dan RasulNya. Siapa saja yang menentang Allah, sesungguhnya Allah sangat keras hukumanNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4. “Yang demikian itu,” adalah karena mereka “menentang Allah dan RasulNya,” mereka memusuhi, memerangi dan berbuat kemaksiatan kepada keduanya. Siksaan ini adalah merupakan sunnah dan kepastian (yang Allah tetapkan) bagi siapa pun yang menentangNya. “Barangsiapa menentang Allah, maka sesungguhnya Allah sangat keras hukumanNya.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Hasyr ayat 4: Allah menjelaskan bahwasanya yang menimpa mereka dari pengepungan dan pengusiran, serta apa yang menunggu mereka di akhirat dari adzab neraka; Karena sebab permusuhan mereka yang keras kepada Allah dan Rasul-Nya ﷺ, serta pengkhianatan mereka dari perjanjian dan kesepakatan, dan barangsiapa yang memusuhi Allah dan memerangi Rasul-Nya ﷺ, maka sungguh adzab Allah sangat pedih."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hasyr Ayat 4",
    "description": "Adapun yang demikian itu, perintah pengusiran bani qainuqa', bani nadir dan bani quraizah dari madinah, walaupun mereka sudah mengikat perjanjian damai dengan rasulullah, karena sesungguhnya mereka menentang Allah dengan menolak beriman dan menentang rasul-Nya dengan merencanakan untuk membunuh beliau, padahal mereka mengetahui bahwa nabi Muhammad itu utusan Allah. Barang siapa menentang Allah dengan membangkang, berkhianat, dan mengacau keamanan, maka sesungguhnya Allah sangat keras hukuman-Nya kepada mereka dengan pengusiran dan penghinaan, serta di akhirat dengan kekal di dalam neraka. 5. Pengusiran kaum yahudi di madinah merupakan ketetapan Allah dan atas izin-Nya. Apa yang kamu tebang dan bakar di antara pohon kurma yang berada di dekat benteng yahudi atau yang kamu biarkan batang pohon kurma itu tumbuh berdiri di atas pokoknya, maka pada hakikatnya ide untuk melakukan itu muncul dengan izin Allah. Penebangan dan pembakaran pohon kurma, karena orang-orang yahudi itu bersembunyi di dalam benteng yang berada di balik pohon kurma. Mereka tidak akan pernah keluar dari benteng itu untuk menyerahkan diri kepada rasulullah kecuali setelah merasa sesak terkena asap; dan oleh sebab itu, perintah penebangan dan pembakaran pohon kurma itu karena dia hendak memberikan kehinaan kepada orang-orang fasik, yakni kaum yahudi di madinah yang mengacau keamanan, mengkhianati kesepakatan damai dengan kaum muslim, dan merencanakan pembunuhan terhadap rasulullah."
  }
]