[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "5. Apa yang kalian tebang (wahai orang-orang beriman) berupa pohon kurma atau kalian biarkan tegak di atas batangnya, tanpa kalian sentuh, maka semua itu dengan perintah dan izin Allah, agar dengan itu kalian menghinakan orang-orang yang tidak menaati Allah dan menyimpang dari perintah dan laranganNya, di mana Allah menguasakan kalian atas pohon kurma mereka dan membakarnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Pohon kurma yang kalian tebang -wahai orang-orang yang beriman- ketika memerangi Bani Naḍir atau kalian biarkan tetap berdiri pada akarnya adalah atas perintah Allah, bukan bagian dari kerusakan di muka bumi sebagaimana yang mereka kira, dan agar Allah menghinakan orang-orang yang keluar dari ketaatan terhadap Allah dari kalangan orang-orang Yahudi yang mengingkari perjanjian dan lebih memilih untuk berkhianat daripada menunaikan janji."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "5. Hai orang-orang beriman, Tidaklah kalian menebang pohon kurma atau membiarkannya tetap berdiri melainkan dengan perintah dan keridhaan dari Allah, dan itu untuk menghinakan orang-orang yang berpaling dari ketaatan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. مَا قَطَعْتُم مِّن لِّينَةٍ أَوْ تَرَكْتُمُوهَا قَآئِمَةً عَلَىٰٓ أُصُولِهَا فَبِإِذْنِ اللهِ (Apa saja yang kamu tebang dari pohon kurma (milik orang-orang kafir) atau yang kamu biarkan (tumbuh) berdiri di atas pokoknya, maka (semua itu) adalah dengan izin Allah) Sebagian kaum muslimin menebang pohon kurma milik orang-orang kafir saat perang melawan Bani Nadlir dengan tujuan untuk membuat mereka marah, maka Bani Nadlir mengatakan: “Hai Muhammad, bukankah kamu mengaku sebagai Nabi yang menginginkan perbaikan? Apakah menebang pohon kurma dan membakar pohon lainnya adalah sebuah perbaikan? Dan apakah kamu mendapati apa yang diturunkan kepadamu yang membolehkan untuk berbuat kerusakan di bumi?” Perkataan mereka itu kemudian menyusahkan hari Rasulullah dan kaum muslimin. Maka turunlah ayat ini. وَلِيُخْزِىَ الْفٰسِقِينَ (dan karena Dia hendak memberikan kehinaan kepada orang-orang fasik) Yakni untuk menghinakan orang-orang yang enggan melakukan ketaatan, yaitu orang-orang Yahudi dan menjadikan mereka marah dengan menebang dan membiarkan pohon-pohon milik mereka, sebab jika mereka melihat orang-orang beriman berbuat sesuka hati terhadap harta mereka maka akan bertambah kemarahan dan kehinaan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Tidak ada sebuah pohon kurma pun yang telah kalian potong saat kecamuk perang, ataupun yang kalian biarkan tetap tumbuh kecuali itu semua atas izin dan kehendak Allah. Begitu juga orang-orang yang membangkang dari ketaatan dan menyimpang dari syariat. Diriwayatkan dari Bukhari Muslim dari Ibnu Umar bahwa rasul membakar Bani Nadhir yaitu pepohonan mereka dan memotong tunas pohon kurma. Sehingga turunlah ayat ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apa yang kalian tebang di antara pohon kurma} pohon kurma {atau yang kalian biarkan berdiri di atas pokoknya} batangnya {dengan izin Allah dan karena Dia hendak menghinakan} hendak menghinakan {orang-orang fasik"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5. Dan ketika orang-orang Yahudi Bani Nadhir mencela Rasulullah dan kaum Muslimin karena menebang pohon kurma serta pepohonan yang lain, dan mereka menganggap bahwa hal itu adalah merupakan tindakan pengrusakan sehingga mereka pun mencela kaum Muslimin, maka Allah mengabarkan bahwa menebang pohon kurma atau membiarkannya (tumbuh), semua itu adalah dengan izin dan perintah dari Allah, “dan karena Dia hendak memberikan kehinaan kepada orang-orang fasik,” di mana mereka telah menguasakan kalian untuk menebang dan membakar pohon kurma mereka, agar hal itu menjadi siksaan dan kehinaan bagi mereka di dunia serta kerendahan yang dengannya diketahui betapa sempurnanya kelemahan mereka sehingga tidak mampu melindungi pohon kurma mereka yang merupakan materi kekuatan mereka. Kata ‘alliinatu’ adalah kata yang mencakup semua jenis pohon kurma menurut kemungkinan (makna bahasa Arab) yang paling benar dan paling tepat. Inilah kondisi Bani Nadhir, maka (saksikanlah) bagaimana Allah menghukum mereka di dunia."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Hasyr ayat 5: Dan ketika bani nadhir mencela Rasulullah ﷺ dan orang-orang muslim dalam penebangan pohon kurma, mereka menginginkan kehinaan bagi kaum muslimin dan membuat marah Rasulullah ﷺ; Allah mengabarkan bahwa apa yang dilakukan kaum muslimin dari menebang pohon kurma dan membakar sebagian pepohonan yang berbuah, maka itu semua adalah perintah Allah dan keinginan-Nya; Dimana Allah berkuasa atas penebangan yang dilakukan kaum muslimin dan pembakaran pohon kurma. Agar supaya membuat marah bani nadhir, dan juga supaya menjadi hukuman dan hinaan serta perendahan atas apa yang mereka khianati dari perjanjian (dengan kaum muslimin)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Imam Bukhari meriwayatkan dengan sanadnya yang sampai kepada Ibnu Umar radhiyallahu 'anhuma ia berkata: Rasulullah shallallahu 'alaihi wa sallam membakar pohon kurma milik Bani Nadhir dan menebangnya di Buwairah, maka turunlah ayat, “Apa yang kamu tebang di antara pohon kurma (milik orang-orang kafir) atau yang kamu biarkan (tumbuh) berdiri di atas pokoknya, maka (itu) terjadi dengan izin Allah;” Tirmidzi meriwayatkan dengan sanadnya yang sampai kepada Ibnu Abbas tentang firman Allah, “Apa yang kamu tebang di antara pohon kurma (milik orang-orang kafir) atau yang kamu biarkan (tumbuh) berdiri di atas pokoknya,” Ia berkata, “Liinah adalah pohon kurma.” (Firman-Nya), “dan karena Dia hendak memberikan kehinaan kepada orang-orang fasik.” Ia (Ibnu Abbas) berkata, “Yaitu meminta mereka turun dari benteng mereka.” Ibnu Abbas juga berkata, “Mereka (kaum muslimin) diperintahkan untuk menebang pohon kurma, lalu mereka merasa tidak enak dalam hatinya, mereka (kaum muslimin) berkata, “Kami telah menebang sebagian dan membiarkan sebagian. Kami akan bertanya kepada Rasulullah shallallahu 'alaihi wa sallam; apakah menebangnya mendapatkan pahala dan meninggalkannya mendapatkan dosa?” Maka Allah Subhaanahu wa Ta'aala menurunkan ayat, “Apa yang kamu tebang di antara pohon kurma (milik orang-orang kafir) atau yang kamu biarkan (tumbuh) berdiri di atas pokoknya, maka (itu) terjadi dengan izin Allah,…dst.” (Hadits ini menurut Syaikh Al Albani dalam Shahih At Tirmidzi 7/303, shahih isnadnya.) Wahai kaum muslimin. Maksudnya, pohon kurma milik musuh, untuk kepentingan dan siasat perang dapat ditebang atau dibiarkan tumbuh. Ketika Bani Nadhir mencela Rasulullah shallallahu 'alaihi wa sallam dan kaum muslimin karena menebang pohon kurma dan pepohonan lainnya dan mereka menganggap bahwa hal itu termasuk fasad (melakukan kerusakan) sehingga karena hal itu mereka mencela kaum muslimin, maka Allah Subhaanahu wa Ta'aala memberitahukan bahwa penebangan pohon itu atau tidak adalah dengan izin Allah Ta’ala dan perintah-Nya serta untuk menghinakan orang-orang fasik, dimana Dia telah memberikan kekuasaan kepada kaum muslimin untuk menebang pohon kurma mereka dan membakarnya agar hal itu menjadi peringatan bagi mereka serta kerendahan untuk mereka di dunia serta penghinaan yang dapat diketahui kelemahan mereka yang sempurna karena tidak dapat menyelamatkan pohon kurma mereka yang menjadi sumber makanan mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hasyr Ayat 5",
    "description": "Pengusiran kaum yahudi di madinah merupakan ketetapan Allah dan atas izin-Nya. Apa yang kamu tebang dan bakar di antara pohon kurma yang berada di dekat benteng yahudi atau yang kamu biarkan batang pohon kurma itu tumbuh berdiri di atas pokoknya, maka pada hakikatnya ide untuk melakukan itu muncul dengan izin Allah. Penebangan dan pembakaran pohon kurma, karena orang-orang yahudi itu bersembunyi di dalam benteng yang berada di balik pohon kurma. Mereka tidak akan pernah keluar dari benteng itu untuk menyerahkan diri kepada rasulullah kecuali setelah merasa sesak terkena asap; dan oleh sebab itu, perintah penebangan dan pembakaran pohon kurma itu karena dia hendak memberikan kehinaan kepada orang-orang fasik, yakni kaum yahudi di madinah yang mengacau keamanan, mengkhianati kesepakatan damai dengan kaum muslim, dan merencanakan pembunuhan terhadap rasulullah. 6. Pada ayat ini Allah menerangkan hukum fai', yakni rampasan perang yang ditinggalkan musuh setelah sebelumnya Allah menjelaskan bahwa rasulullah mengepung dan mengusir kaum yahudi di madinah. Mereka hanya dibolehkan membawa harta yang bisa dibawa oleh seekor unta. Dan harta rampasan berupa fai', yaitu yang diperoleh dari musuh tanpa terjadinya pertempuran, maka harta itu dari mereka, berasal dari musuh, diberikan oleh Allah kepada rasul-Nya untuk mengharumkan islam. Kamu tidak memerlukan kuda atau unta untuk mendapatkannya dalam pertempuran, tetapi Allah memberikan kekuasaan kepada rasul-rasul-Nya, termasuk kepada nabi Muhammad untuk mengalahkan siapa saja yang dia kehendaki di antara musuh-Musuh-Nya sehingga dengan kekuasaan ini rasulullah mendapatkan fai'. Dan Allah mahakuasa atas segala sesuatu sehingga bukanlah suatu yang sulit bagi Allah menolong rasul-Nya mengusir dan menghinakan kaum yahudi di madinah."
  }
]