[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "6. Apa yang Allah berikan sebagai fai’ kepada RasulNya dari harta orang-orang Yahudi Bani an-Nadhir, kalian tidak menyerangnya dengan pasukan berkuda dan berunta untuk mendapatkannya, tetapi Allah menguasakan RasulNya atas siapa yang Dia kehendaki dari musuh-musuhNya, lalu mereka menyerah tanpa perang. Harta fai’ adalah harta orang-orang kafir yang diambil tanpa perang. Allah Mahakuasa atas segala sesuatu, tidak ada sesuatu pun yang melemahkanNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Dan apa yang diberikan oleh Allah kepada Rasul-Nya dari harta kekayaan Bani Naḍir bukan karena upaya kalian dalam mendapatkannya dengan menunggangi kuda maupun unta dan tidak pula dengan kesusahan yang menimpa kalian, akan tetapi karena Allah menguasakan kepada Rasul-Nya atas orang-orang yang dikehendaki-Nya. Dan Allah telah menguasakan kepada Rasul-Nya atas Bani Naḍir dan menaklukkan negeri mereka dengan damai. Allah Mahakuasa atas segala sesuatu, tidak ada yang melemahkan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "6. Dan harta fai’ -harta rampasan dari orang-orang kafir tanpa melalui peperangan- yang Allah berikan kepada Rasulullah dari harta orang-orang Yahudi Bani Nadhir itu tidak perlu kalian menunggangi kuda atau unta untuk mendapatkannya; namun Allah menolong para Rasul-Nya dengan memasukkan ketakutan ke dalam hati musuh-musuh-Nya, sehingga mereka menyerah dengan sendirinya. Allah Maha Kuasa atas segalanya, tidak ada yang sulit bagi-Nya. Diriwayatkan dari Umar bin Khattab dalam hadits panjang, dan di dalamnya disebutkan: Allah mengkhususkan Rasulullah harta fai’ ini, tanpa memberikannya kepada selain beliau; kemudian Umar membaca ayat: وَمَآ أَفَآءَ ٱللَّهُ عَلَىٰ رَسُولِهِۦ مِنْهُمْ فَمَآ أَوْجَفْتُمْ عَلَيْهِ مِنْ خَيْلٍ وَلَا رِكَابٍ وَلَٰكِنَّ ٱللَّهَ يُسَلِّطُ رُسُلَهُۥ عَلَىٰ مَن يَشَآءُ ۚ وَٱللَّهُ عَلَىٰ كُلِّ شَىْءٍ قَدِيرٌ Harta ini khusus untuk Rasulullah, namun Demi Allah, beliau tidak mengambilnya untuk dirinya sendiri tanpa membagikannya kepada kalian. (Shahih al-Bukhari, bagian khumus (seperlima), bab bagian khumus, no. 3093)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. وَمَآ أَفَآءَ اللهُ عَلَىٰ رَسُولِهِۦ مِنْهُمْ فَمَآ أَوْجَفْتُمْ عَلَيْهِ مِنْ خَيْلٍ وَلَا رِكَابٍ (Dan apa saja harta rampasan (fa’i) yang diberikan Allah kepada Rasul-Nya (dari harta benda) mereka, maka untuk mendapatkan itu kamu tidak mengerahkan seekor kudapun dan (tidak pula) seekor untapun) Makna (الإيجاف) yakni penunggang kuda yang memacu kudanya. Yakni harta yang diberikan Allah bagi Rasulullah dari Bani Nadlir tidak didapatkan lewat pengerahan pasukan yang menunggang kuda dan unta, dan tidak pula dengan menghadapi kesulitan atau peperangan, sebab pemukiman mereka hanya sejauh dua mil dari Madinah dan Rasulullah menakhlukkannya dengan perjanjian damai dengan menarik harta mereka, oleh sebab itu Allah menjadikan harta Bani Nadlir khusus baginya, dan tidak dibagi kepada para pasukan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Allah tidak menjadikan harta rampasan atau Fai’ untuk rasul SAW sebagaimana harta Bani Nadhir. Dan arti Fai’ adalah harta rampasan dari orang kafir tanpa melalui peperangan, maka kalian tidak perlu tergesa-gesa untuk memerangi musuh dengan menunggangi kuda atau unta. Kalian tidak perlu bersusah payah untuk perang dan berkemelut dalam kesulitan, namun Allah telah melapangkan rasul-Nya untuk hamba-Nya yang Allah kehendaki. Ini dilakukan berkat rasa takut yang ditanamkan dalam hati orang kafir dan serah terima harta tanpa peperangan. Allah Maha Kuasa sepenuhnya terhadap apapun yang Allah kehendaki"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apa saja yang dianugerahkan Allah kepada RasulNya dari mereka} Apa saja yang dikembalikan oleh Allah atas RasulNya dari harta Bani Nadhir {maka kalian tidak (perlu) memacu} kalian menyegerakan {kuda atau unta} unta {Akan tetapi Allah memberikan kekuasaan kepada rasul-rasulNya atas siapa saja yang Dia kehendaki. Allah Maha kuasa atas segala sesuatu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6. Kemudian Allah menyebutkan tentang siapakah yang harta dan kekayaannya berpindah ke tangan Rasulullah. Allah berfirman, “Dan apa saja harta rampasan (fai’) yang diberikan Allah kepada RasulNya (dari harta benda) mereka,” “maka” sesungguhnya kalian wahai kaum Muslimin “tidak mengerahkan seekor kuda pun dan (tidak pula) seekor unta pun,” maksudnya kalian tidak mendatangkan ataupun mengumpulkan itu semua, artinya kalian tidak lelah untuk mendapatkannya, tidak mengerahkan jiwa raga kalian dan tidak juga kendaraan-kendaraan kalian, akan tetapi Allah memasukkan rasa takut ke dalam hati mereka, sehingga harta benda tersebut mendatangi kalian dengan sangat mudahnya. Oleh karena itu Allah berfirman, “Tetapi Allah yang memberikan kekuasaan kepada RasulNya terhadap siapa yang dikehendakiNya. Dan Allah Mahakuasa atas segala sesuatu.” Merupakan kesempurnaan Kuasa Allah, bahwasanya tidak ada sesuatu pun yang dapat menahannya dan tidak ada satu kekuatan pun yang berharga selain dariNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Hasyr ayat 6: Ketahuilah wahai orang-orang beriman, bahwasanya harta yang datang kepada kalian dari harta-harta milik yahudi bani nadhir, sungguh Allah telah mudahkan bagi kalian untuk mendapatkannya tanpa peperangan dan kesulitan, dan juga tanpa harus menaiki kuda perang dan unta. Dan itulah kekuasaan Allah yang diberikan untuk utusan-Nya ﷺ. Allah timpakan kepada hati-hati mereka rasa takut (dan itu adalah sebagian dari tentara Allah), maka mereka diserang dengan rasa takut. Allah menjadikan Rasul-Nya berkuasa atas apa yang dikehendaki-Nya. Allah Maha Kuasa atas segala sesuatunya, dan tidak ada yang mampu menghalangi-Nya di bumi maupun di langit."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Fai-i ialah harta rampasan yang diperoleh dari orang-orang kafir tanpa terjadinya pertempuran, misalnya harta yang mereka tinggal lari karena takut kepada kaum muslimin. Harta tersebut dinamakan fai’i yang artinya kembali, karena harta itu kembali dari orang-orang kafir yang tidak berhak memilikinya kepada kaum muslimin yang memiliki hak terhadapnya. Pembagian fa’i berlainan dengan pembagian ghanimah (harta rampasan yang diperoleh dari musuh setelah terjadi pertempuran). Pembagian Fai’i disebutkan pada ayat 7 surah ini, sedangkan pembagian ghanimah disebutkan dalam surah Al Anfaal ayat 41. Pembagian fa’i, berdasarkan ayat ke-7 surah Al Hasyr ini adalah dibagi menjadi lima bagian: - 1/5 untuk Allah dan Rasul-Nya shallallahu 'alaihi wa sallam yang kemudian dialihkan untuk maslahat kaum muslimin secara umum, - 1/5 untuk kerabat Rasulullah shallallahu 'alaihi wa sallam (Bani Hasyim dan Bani Muththalib), dimana antara laki-laki dan perempuannya disamaratakan. Bani Muththalib mendapatkan 1/5 bersama Bani Hasyim sedangkan Bani Abdi Manaf yang lain tidak, karena mereka (Bani Muththalib) ikut serta dengan Bani Hasyim dalam masuknya mereka ke dalam satu suku besar ketika orang-orang Quraisy mengadakan kesepakatan untuk menjauhi dan memusuhi mereka; mereka menolong Rasulullah shallallahu 'alaihi wa sallam berbeda dengan selain mereka. Oleh karena itu, Nabi shallallahu 'alaihi wa sallam menjelaskan tentang Bani Muththalib, “Sesungguhnya mereka tidak berpisah denganku di masa Jahiliyyah maupun Islam.” - 1/5 untuk anak-anak yatim yang fakir, yaitu anak-anak yang ditinggal wafat bapaknya sedangkan mereka belum baligh. - 1/5 untuk orang-orang miskin, dan - 1/5 lagi untuk Ibnus Sabil, yaitu orang asing yang terputus dalam perjalanan karena kehabisan bekal. Yakni kamu wahai kaum muslimin tidak perlu bersusah payah untuk memperolehnya; tidak perlu mengerahkan jiwa ragamu maupun hewan ternakmu. Oleh karena itu, tidak ada hak bagi kamu padanya dan hal itu khusus bagi Nabi shallallahu 'alaihi wa sallam dan orang-orang yang disebutkan bersama Beliau shallallahu 'alaihi wa sallam dalam ayat selanjutnya yang terdiri dari empat golongan, yaitu bahwa masing-masing mereka mendapatkan seperlima dan sisanya untuk Beliau shallallahu 'alaihi wa sallam, dimana Beliau shallallahu 'alaihi wa sallam bebas melakukan apa yang Beliau kehendaki, lalu Beliau memberikan di antaranya kepada kaum muhajirin dan tiga orang Anshar karena fakirnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hasyr Ayat 6",
    "description": "Pada ayat ini Allah menerangkan hukum fai', yakni rampasan perang yang ditinggalkan musuh setelah sebelumnya Allah menjelaskan bahwa rasulullah mengepung dan mengusir kaum yahudi di madinah. Mereka hanya dibolehkan membawa harta yang bisa dibawa oleh seekor unta. Dan harta rampasan berupa fai', yaitu yang diperoleh dari musuh tanpa terjadinya pertempuran, maka harta itu dari mereka, berasal dari musuh, diberikan oleh Allah kepada rasul-Nya untuk mengharumkan islam. Kamu tidak memerlukan kuda atau unta untuk mendapatkannya dalam pertempuran, tetapi Allah memberikan kekuasaan kepada rasul-rasul-Nya, termasuk kepada nabi Muhammad untuk mengalahkan siapa saja yang dia kehendaki di antara musuh-Musuh-Nya sehingga dengan kekuasaan ini rasulullah mendapatkan fai'. Dan Allah mahakuasa atas segala sesuatu sehingga bukanlah suatu yang sulit bagi Allah menolong rasul-Nya mengusir dan menghinakan kaum yahudi di madinah. 7. Allah lalu menjelaskan apa itu fai' dan peruntukannya. Harta rampasan dari mereka, musuh-Musuh Allah yang meninggalkan hartanya tanpa perlawanan, maka harta itu diberikan Allah kepada rasul-Nya yang berasal dari penduduk beberapa negeri seperti bani quraizah, bani nadir, penduduk fadak dan khaibar, penyalurannya adalah untuk Allah, untuk kepentingan fasilitas umum dan fasilitas sosial; untuk rasul guna menopang perjuangan islam; untuk kerabat rasul yang membutuhkan bantuan; untuk anak-anak yatim guna menopang pendidikan mereka; untuk orang-orang miskin agar bisa mengembangkan diri; dan untuk orang-orang yang dalam perjalanan guna mencari penghidupan yang lebih baik. Singkatnya, agar harta itu jangan hanya beredar di antara orang-orang kaya saja di antara kamu, tetapi harus memiliki fungsi sosial seperti air mengalir ke tempat yang lebih rendah sehingga bermanfaat bagi kaum duafa. Allah mengajarkan prinsip dalam mengamalkan islam: apa yang diberikan rasul kepadamu, perintah maupun anjuran dalam ibadah dan muamalah, maka terimalah sebagai pedoman dalam ber-islam. Dan apa yang dilarangnya bagimu, maka tinggalkanlah sebagai sesuatu yang harus dijauhi, karena di balik perintah dan larangan itu ada hikmah yang sangat berharga bagi manusia, dunia akhirat. Dan bertakwalah kepada Allah dengan melaksanakan semua perintah-Nya dan menjauhi semua larangan-Nya. Sungguh, Allah sangat keras hukuman-Nya bagi kaum yang menolak beriman kepada rasulullah padahal mereka mengetahui bahwa beliau sebenarnya utusan Allah seperti kaum yahudi di madinah."
  }
]