[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "7. Apa yang Allah berikan kepada RasulNya sebagai fai’ dari harta para penghuni negeri yang musyrik tanpa mengerahkan kuda dan unta, maka ia adalah milik Allah dan RasulNya. Ia didistribusikan untuk kemaslahatan umum kaum Muslimin, untuk para kerabat Rasulullah, yaitu Bani Hasyim dan Bani al-Muthalib, juga untuk anak-anak yatim, yaitu anak-anak miskin yang ditinggal wafat bapak-bapak mereka saat belum baligh, juga orang-orang miskin, yaitu orang-orang yang membutuhkan dan tidak memiliki apa yang mencukupi dan memenuhi kebuutuhan mereka, dan juga ibnu sabil, yaitu musafir yang bekalnya habis dan terputus dari hartanya. Hal ini agar harta tidak hanya beredar di tangan orang-orang kaya saja dan dihalangi dari orang-orang fakir dan miskin. Apa yang Rasullullah berikan kepada kalian berupa harta, atau apa yang Rasulullah syariatkan, maka ambillah ia, dan apa yang Rasul larang kalian untuk mengambil dan melakukannya, maka hentikanlah. Dan bertakwalah kepada Allah dengan melaksanakan perintah-perintahNya dan meninggalkan laranganNya. Sesungguhnya Allah Mahakeras azabNya bagi siapa yang mendurhakaiNya dan menyelisihi perintah dan laranganNYa. Ayat ini merupakan dasar dalam beramal sesuai dengan al-Quran dan as-Sunnah, baik perkataan, perbuatan, dan penetapan Nabi."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Harta rampasan dari penduduk negeri yang diberikan oleh Allah kepada Rasul-Nya tanpa didahului dengan peperangan, maka itu untuk Allah, diberikan kepada yang dikehendaki-Nya, untuk Rasul miliki, untuk kerabat beliau dari Bani Hasyim dan Bani al-Muṭṭalib sebagai ganti karena mereka tidak boleh menerima sedekah, untuk anak-anak yatim, untuk orang-orang fakir dan untuk orang asing (musafir) yang kehabisan bekal, agar harta itu tidak hanya berputar di antara orang-orang kaya saja tanpa melibatkan orang-orang fakir. Apa yang diberikan oleh Rasul kepada kalian dari harta rampasan perang maka terimalah -wahai orang-orang yang beriman-. Dan apa saja yang dilarang oleh Rasul terhadap kalian, maka tinggalkanlah! Bertakwalah kepada Allah dengan menjalankan segala perintah-Nya dan menjauhi segala larangan-Nya. Sesungguhnya Allah Maha keras siksa-Nya maka hati-hatilah terhadap siksa-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "7. Harta fai’ dari orang-orang kafir yang Allah berikan kepada Rasulullah adalah bagi Allah dan rasul-Nya, dan akan disalurkan untuk kemaslahatan kaum muslimin, untuk para kerabat Rasulullah dari Bani Hasyim dan Abdul Mutthalib, anak-anak yatim yang miskin, orang-orang fakir, dan para musafir yang habis perbekalannya. Pembagian ini agar harta tidak hanya berputar di kalangan orang-orang kaya saja. Dan pemberian atau syariat yang Rasulullah tetapkan, ambil dan laksanakanlah; sedangkan sesuatu yang Rasulullah larang untuk dilakukan atau diambil, maka jauhilah itu. Dan takutlah kalian kepada Allah dengan mentaati hukum-hukum-Nya; sungguh Allah Maha Berat siksaan-Nya bagi orang yang tidak taat. Umar bin Khattab berkata: Berkumpullah untuk memusyawarahkan perkara harta fai’ ini, sungguh aku membaca ayat-ayat al-Qur’an yang cukup bagiku (untuk perkara ini). Allah berfirman: وَمَآ أَفَآءَ ٱللَّهُ عَلَىٰ رَسُولِهِۦ مِنْهُمْ فَمَآ أَوْجَفْتُمْ عَلَيْهِ مِنْ خَيْلٍ وَلَا رِكَابٍ وَلَٰكِنَّ ٱللَّهَ يُسَلِّطُ رُسُلَهُۥ عَلَىٰ مَن يَشَآءُ ۚ وَٱللَّهُ عَلَىٰ كُلِّ شَىْءٍ قَدِيرٌ Dan apa saja harta rampasan (fai-i) yang diberikan Allah kepada Rasul-Nya (dari harta benda) mereka, maka untuk mendapatkan itu kamu tidak mengerahkan seekor kudapun dan (tidak pula) seekor untapun, tetapi Allah yang memberikan kekuasaan kepada Rasul-Nya terhadap apa saja yang dikehendaki-Nya. Dan Allah Maha Kuasa atas segala sesuatu. [al-Hasyr: 6] مَّآ أَفَآءَ ٱللَّهُ عَلَىٰ رَسُولِهِۦ مِنْ أَهْلِ ٱلْقُرَىٰ فَلِلَّهِ وَلِلرَّسُولِ وَلِذِى ٱلْقُرْبَىٰ وَٱلْيَتَٰمَىٰ وَٱلْمَسَٰكِينِ وَٱبْنِ ٱلسَّبِيلِ كَىْ لَا يَكُونَ دُولَةًۢ بَيْنَ ٱلْأَغْنِيَآءِ مِنكُمْ ۚ وَمَآ ءَاتَىٰكُمُ ٱلرَّسُولُ فَخُذُوهُ وَمَا نَهَىٰكُمْ عَنْهُ فَٱنتَهُوا۟ ۚ وَٱتَّقُوا۟ ٱللَّهَ ۖ إِنَّ ٱللَّهَ شَدِيدُ ٱلْعِقَابِ Apa saja harta rampasan (fai-i) yang diberikan Allah kepada Rasul-Nya (dari harta benda) yang berasal dari penduduk kota-kota maka adalah untuk Allah, untuk Rasul, kaum kerabat, anak-anak yatim, orang-orang miskin dan orang-orang yang dalam perjalanan, supaya harta itu jangan beredar di antara orang-orang kaya saja di antara kamu. Apa yang diberikan Rasul kepadamu, maka terimalah. Dan apa yang dilarangnya bagimu, maka tinggalkanlah. Dan bertakwalah kepada Allah. Sesungguhnya Allah amat keras hukumannya. [al-Hasyr: 7] Demi Allah, harta fai’ ini tidak untuk mereka saja. Kemudian Umar membaca ayat: لِلْفُقَرَآءِ ٱلْمُهَٰجِرِينَ ٱلَّذِينَ أُخْرِجُوا۟ مِن دِيَٰرِهِمْ وَأَمْوَٰلِهِمْ يَبْتَغُونَ فَضْلًا مِّنَ ٱللَّهِ وَرِضْوَٰنًا وَيَنصُرُونَ ٱللَّهَ وَرَسُولَهُۥٓ ۚ أُو۟لَٰٓئِكَ هُمُ ٱلصَّٰدِقُونَ (Juga) bagi orang fakir yang berhijrah yang diusir dari kampung halaman dan dari harta benda mereka (karena) mencari karunia dari Allah dan keridhaan-Nya dan mereka menolong Allah dan Rasul-Nya. Mereka itulah orang-orang yang benar. [al-Hasyr: 8] Demi Allah, harta fai’ ini juga tidak untuk mereka saja. Kemudian Umar membaca ayat: وَٱلَّذِينَ جَآءُو مِنۢ بَعْدِهِمْ يَقُولُونَ رَبَّنَا ٱغْفِرْ لَنَا وَلِإِخْوَٰنِنَا ٱلَّذِينَ سَبَقُونَا بِٱلْإِيمَٰنِ وَلَا تَجْعَلْ فِى قُلُوبِنَا غِلًّا لِّلَّذِينَ ءَامَنُوا۟ رَبَّنَآ إِنَّكَ رَءُوفٌ رَّحِيمٌ Dan orang-orang yang datang sesudah mereka (Muhajirin dan Anshor), mereka berdoa: \"Ya Rabb kami, beri ampunlah kami dan saudara-saudara kami yang telah beriman lebih dulu dari kami, dan janganlah Engkau membiarkan kedengkian dalam hati kami terhadap orang-orang yang beriman; Ya Rabb kami, Sesungguhnya Engkau Maha Penyantun lagi Maha Penyayang\". [al-Hasyr: 10] (Diriwayatkan oleh Ibnu Abi Syaibah dengan sanad hasan. Al-Mushannaf 7/639)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. مَّآ أَفَآءَ اللهُ عَلَىٰ رَسُولِهِۦ مِنْ أَهْلِ الْقُرَىٰ (Apa saja harta rampasan (fa’i) yang diberikan Allah kepada Rasul-Nya (dari harta benda) yang berasal dari penduduk kota-kota) Ini merupakan penjelasan tentang orang yang berhak mendapat harta rampasan setelah Allah menjelaskan bahwa itu milik Rasulullah. Harta rampasan (fa’i) adalah seluruh negeri yang ditakhlukkan Rasulullah dan kaum muslimin setelah beliau sampai hari kiamat tanpa melalui peperangan dan tidak membutuhkan pengerahan pasukan muslimin yang menunggang kuda atau unta, namun melalui perjanjian damai. فَلِلَّـهِ(maka adalah untuk Allah) Sehingga Allah memberi keputusan tentangnya sesuai dengan kehendak-Nya. وَلِلرَّسُولِ(untuk Rasul) Yakni untuk menjadi kepemilikan Rasulullah, kemudian diberikan untuk kemaslahatan kaum muslimin. وَلِذِى الْقُرْبَىٰ( kaum kerabat) Mereka adalah Bani Hasyim dan Bani Mutthalib, yakni orang-orang yang fakir di antara mereka saja, sebab mereka dilarang menerima harta sedekah, maka Allah memberi mereka hak untuk mendapatkan harta fa’i. وَالْيَتٰمَىٰ( anak-anak yatim) Mereka adalah anak-anak kecil yang ditinggal mati ayah mereka sebelum memasuki masa baligh. وَالْمَسٰكِينِ(orang-orang miskin) Yakni orang-orang fakir. وَابْنِ السَّبِيلِ(dan orang-orang yang dalam perjalanan) Yakni orang asing yang perbekalannya telah habis. كَىْ لَا يَكُونَ دُولَةًۢ بَيْنَ الْأَغْنِيَآءِ مِنكُمْ ۚ( supaya harta itu jangan beredar di antara orang-orang kaya saja di antara kamu) Sehingga orang-orang kaya dapat berkuasa atas orang-orang kafir. Namun Allah menjadikannya agar harta itu dapat berputar di antara mereka semua. وَمَآ ءَاتَىٰكُمُ الرَّسُولُ فَخُذُوهُ وَمَا نَهَىٰكُمْ عَنْهُ فَانتَهُوا۟ ۚ( Apa yang diberikan Rasul kepadamu, maka terimalah. Dan apa yang dilarangnya bagimu, maka tinggalkanlah) Yakni harta rampasan yang Allah berikan kepada kalian maka terimalah, dan harta yang Allah larang untuk kalian ambil maka janganlah kalian ambil."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Apa yang diberikan Allah (harta fai’) kepada rasul-Nya adalah untuk diberikan kepada rasul sendiri, keluarga dan kerabat rasul dari bani Hasyim dan Muthallib yaitu mereka yang dilarang menerima sedekah. Itu bermaksud untuk menjaga kemuliaan dan keluhuran mereka. Harta itu juga untuk diberikan kepada anak yatim yang tidak mempunyai ayah, juga kepada fakir miskin yang membutuhkan, dan anak jalanan: yaitu orang yang kehabisan bekal dalam perjalanan menuju kampung halaman mereka. Agar harta fai’ tidak hanya beredar pada golongan orang-orang kaya saja. Maka terima dan ambillah pemberian rasul. Allah tidak melarang kalian untuk menerima dan mengambilnya, maka terimalah. Bertakwalah kepada Allah dengan menjalankan perintah dan menjauhi larangan-Nya. Sesungguhnya Allah Maha Memberi Azab kepada siapapun yang durhaka dan membangkang-Nya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apa saja yang dianugerahkan Allah kepada RasulNya dari penduduk beberapa negeri adalah untuk Allah, Rasul, kerabat} orang-orang yang memiliki hubungan kekerabatan nabi SAW dari Bani Hasyim dan Bani Muthalib {anak yatim, orang miskin, dan orang yang dalam perjalanan} musafir asing yang habis perbekalannya {agar harta itu tidak beredar} agar harta itu tidak beredar {di antara orang-orang kaya saja di antara kalian. Apa saja yang diberikan Rasul kepada kalian, maka terimalah. Apa saja yang dilarang bagi kalian maka tinggalkanlah. Bertakwalah kepada Allah. Sesungguhnya Allah sangat keras hukumanNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7. Sedangkan pengertian (harta fai’) dalam istilah para ulama fikih, adalah harta orang-orang kafir yang diambil secara hak tanpa adanya peperangan, seperti halnya dengan harta-harta tersebut yang mereka tinggalkan karena takut kepada orang-orang Islam. Dinamakan harta Fai’ karena harta tersebut kembali dari orang-orang kafir yang tidak berhak memilikinya, kepada orang-orang Islam yang lebih berhal memilikinya. Dan hukum harta fai’ yang bersifat umum adalah sebagaimana disebutkan dalam FirmanNya, “apa saja harta rampasan (fai’) yang diberikan Allah kepada RasulNya yang berasal dari penduduk kota-kota,” secara umum baik yang ada di masa Rasulullah maupun setelahnya bagi pemimpin yang berkuasa dari kalangan umatnya sepeninggalnya, “maka adalah untuk Allah, Rasul, kerabat rasul, anak-anak yatim, orang-orang miskin, dan ibnu sabil.” Ayat ini serupa dengan ayat lain yang terdapat dalam Surat al-Anfal. Yaitu Firman Allah, “Ketahuilah, sesungguhnya apa saja yang dapat kamu peroleh sebagai rampasan perang, maka sesungguhnya seperlima untuk Allah, Rasul, kerabat Rasul, anak-anak yatim, orang-orang miskin dan ibnussabil,” -al-Anfal: 41- Harta rampasan fai’ ini dibagi untuk lima bagian; untuk Allah dan Rasulullah yang dialokasikan untuk keperluan kaum Muslimin secara umum, satu bagian lainnya untuk kerabat mereka yaitu Bani Hasyim dan Bani Muthalib di mana saja mereka berada, bagian pihak lelaki sama seperti bagian pihak perempuan. Adanya Bani Muthalib masuk dalam salah satu dari lima bagian ini bersama Bani Hasyim tanpa memasukkan Bani Abdi Manaf lainnya adalah karena mereka, Bani Muthalib bersama-sama dengan Bani Hasyim termasuk satu golongan ketika kaum Quraisy sepakat untuk memblokade dan memusuhi mereka, dan mereka bersatu padu menolong Rasulullah, tidak seperti Bani Manaf lainnya. Satu bagian lainnya diberikan untuk anak-anak yatim yang miskin. Anak yatim adalah anak yang ditinggalkan oleh ayahnya pada saat belum mencapai usia baligh. Satu bagian lainnya untuk orang-orang miskin. Satu bagian lainnya untuk Ibnu Sabil. Ibnu Sabil adalah orang-orang asing yang kehabisan bekal ketika berada di daerah orang lain. Allah menetapkan ketentuan tersebut dan hanya membatasi harta rampasan fai’ untuk golongan-golongan yang telah ditentukan itu agar “supaya harta itu jangan hanya beredar,” yakni beredar dan menjadi kekhususan “di antara orang-orang kaya saja di antara kamu.” Sebab andai Allah tidak menetapkan ketentuan di atas tentu hanya orang-orang kaya saja yang akan memutarkan uang dan orang-orang lemah tidak akan mendapatkan sedikit pun, yang mana hal itu akan menimbulkan kerusakan yang hanya diketahui oleh Allah. Sebagaimana dalam mengikuti perintah dan syariat Allah yang tidak termasuk dalam pembatasan di atas juga termasuk maslahat. Karena itulah Allah memerintahkan dengan kaidah menyeluruh dan pokok yang bersifat umum. Allah berfirman, “Apa yang diberikan Rasul kepadamu, maka terimalah ia dan apa yang dilarangnya bagimu, maka tinggalkanlah.” Ini mencakup pokok-pokok agama dan cabang-cabangnya, baik yang lahir maupun yang batin. Syariat yang dibawa oleh Rasulullah harus dilaksanakan dan diikuti. Tidak boleh mengedepankan perkataan orang lain dari sabda beliau. Kemudian Allah memerintahkan untuk bertakwa, yang dengannya hati, ruh, dunia, dan akhirat akan tegak. Dengan takwa akan diperoleh kebahagiaan abadi dan keberuntungan yang besar. Dan menyia-nyiakan takwa akan mengundang kesengsaraan dan siksaan abadi. Allah berfirman, “Dan bertakwalah kepada Allah. Sesungguhnya Allah sangat keras siksaNya,” bagi siapa saja yang tidak bertakwa dan lebih mengedepankan hawa nafsu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Hasyr ayat 7: Ketahuilah wahai orang-orang yang beriman, bahwa harta-harta yang didatangkan kepada Rasul ﷺ adalah sebagiannya milik orang-orang kota ini; Yaitu dari orang-orang yang tidak menaiki kuda oerang, unta dan merasa kepayahan; Maka harta-harta tersebut tidak dibagi sebagaimana ghanimah (harta rampasan perang); Akan tetapi semua itu milik Allah dan Rasul-Nya ﷺ yang menguasai dari sisi kebaikan; dan juga untuk kerabat dekat Rasul ﷺ, juga untuk anak-anak yatim yang membutuhkan, dan juga orang-orang miskin yang membutuhkan karena sengsara, juga untuk para musafir yang tidak memiliki harta sebagai bekal. Maka Kami lakukan demikian agar harta ini tidak berputar hanya pada orang-orang yang kaya yang ia manfaatkan sendiri, dan ia haramkan orang faqir menerima hartanya karena sebab merasa sangat butuh sekali. Kemudian Allah menjelaskan bahwa apa yang datang dari sisi Rasul ﷺ yang diperintahkan kepada seorang hamba, wajib untuk ditaati dan diikuti, tidak halal menyelisihinya, dan ini semua merupakan kesempurnaan pokok agama dan cabangya, secara dzahir dan batin. Taatilah Allah wahai manusia, dengan amalan yang diperintahkan-Nya dan menjauhi apa yang dilarang-Nya, karena sesungguhnya adzab Allah sangat pedih bagi siapa yang menyelisihi perintah dan larangan-Nya. Kesimpulan akhirnya adalah, bahwasanya sebab tidak dibaginya harta bagi seluruh orang-orang yang berperang yaitu ada dua sebab : Yang pertama, bahwa harta tersebut didapatkan tanpa melalui peperangan, dan yang kedua : Mencegah agar harta tidak berputar hanya dikalangan orang-orang kaya yang telah tercukupi kebutuhan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Baik Allah Subhaanahu wa Ta'aala memberikannya saat Rasulullah shallallahu 'alaihi wa sallam masih hidup ataupun setelahnya kepada orang yang menjadi pengganti Beliau dalam memerintah umatnya (pemerintah Islam). Yang terdiri dari Bani Hasyim dan Bani Muththalib. Orang yang membutuhkan. Allah Subhaanahu wa Ta'aala menetapkan fa’i untuk kelima asnaf (gololngan) ini adalah agar harta tidak hanya beredar di antara orang-orang kaya saja. Karena jika Dia tidak menetapkan demikian, maka harta itu hanya beredar di antara orang-orang kaya saja, sedangkan orang-orang lemah tidak memperolehnya dan tentu hal itu akan menimbulkan kerusakan yang besar yang hanya diketahui oleh Allah Subhaanahu wa Ta'aala, sebagaimana mengikuti perintah Allah dan syariat-Nya terdapat banyak maslahat. Oleh karena itulah, dalam ayat selanjutnya Allah Subhaanahu wa Ta'aala memerintahkan dengan kaidah yang menyeluruh dan dasar yang umum, firman-Nya, “Apa yang diberikan Rasul kepadamu, maka terimalah. Dan apa yang dilarangnya bagimu, maka tinggalkanlah.” Baik fa’i maupun lainnya. Ayat ini mencakup ushul (dasar-dasar) agama maupun furu’(cabang)nya, dan bahwa apa yang dibawa Rasulullah shallallahu 'alaihi wa sallam harud diambil oleh manusia dan tidak boleh menyelisihinya dan bahwa keputusan Rasulullah shallallahu 'alaihi wa sallam terhadap sesuatu sama seperti keputusan Allah Subhaanahu wa Ta'aala, dimana tidak ada alasan bagi seseorang untuk meninggalkannya, demikian pula tidak boleh mengedepankan ucapan seorang pun di atas ucapan Beliau. Selanjutnya Allah Subhaanahu wa Ta'aala memerintahkan untuk bertakwa kepada-Nya yang dengannya hati, ruh, dunia dan akhirat dimakmurkan, dan dengan takwa dicapai kebahagiaan yang abadi dan keberuntungan yang besar, sedangkan meninggalkannya merupakan kesengsaraan yang abadi dan azab yang kekal. Bagi orang yang meninggalkan ketakwaan dan mengutamakan mengikuti hawa nafsu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hasyr Ayat 7",
    "description": "Allah lalu menjelaskan apa itu fai' dan peruntukannya. Harta rampasan dari mereka, musuh-Musuh Allah yang meninggalkan hartanya tanpa perlawanan, maka harta itu diberikan Allah kepada rasul-Nya yang berasal dari penduduk beberapa negeri seperti bani quraizah, bani nadir, penduduk fadak dan khaibar, penyalurannya adalah untuk Allah, untuk kepentingan fasilitas umum dan fasilitas sosial; untuk rasul guna menopang perjuangan islam; untuk kerabat rasul yang membutuhkan bantuan; untuk anak-anak yatim guna menopang pendidikan mereka; untuk orang-orang miskin agar bisa mengembangkan diri; dan untuk orang-orang yang dalam perjalanan guna mencari penghidupan yang lebih baik. Singkatnya, agar harta itu jangan hanya beredar di antara orang-orang kaya saja di antara kamu, tetapi harus memiliki fungsi sosial seperti air mengalir ke tempat yang lebih rendah sehingga bermanfaat bagi kaum duafa. Allah mengajarkan prinsip dalam mengamalkan islam: apa yang diberikan rasul kepadamu, perintah maupun anjuran dalam ibadah dan muamalah, maka terimalah sebagai pedoman dalam ber-islam. Dan apa yang dilarangnya bagimu, maka tinggalkanlah sebagai sesuatu yang harus dijauhi, karena di balik perintah dan larangan itu ada hikmah yang sangat berharga bagi manusia, dunia akhirat. Dan bertakwalah kepada Allah dengan melaksanakan semua perintah-Nya dan menjauhi semua larangan-Nya. Sungguh, Allah sangat keras hukuman-Nya bagi kaum yang menolak beriman kepada rasulullah padahal mereka mengetahui bahwa beliau sebenarnya utusan Allah seperti kaum yahudi di madinah. 8. Selain disalurkan sebagaimana disebutkan pada ayat di atas, fai' juga disalurkan untuk orang-orang fakir yang berhijrah yaitu anak-anak yatim dan para duafa yang berhijrah bersama rasulullah ke madinah. Selain itu, fai' juga diberikan kepada orang-orang yang terusir dari kampung halamannya di mekah karena beriman dan berhijrah bersama nabi; dan fai' diberikan juga kepada muhajirin yang terpaksa harus meninggalkan harta bendanya di mekah karena hijrah bersama rasulullah ke madinah demi mencari karunia dari Allah dan keridaan-Nya, mengharumkan islam dan kaum muslim, dan demi menolong agama Allah agar bisa dilaksanakan dalam kehidupan ini dan demi menolong rasul-Nya dalam menunaikan misi kerasulan. Mereka itulah, orang-orang yang beriman dan berhijrah bersama rasulullah demi mengharumkan agama Allah dan rasul-Nya, orang-orang yang benar sikap, niat, dan langkahnya."
  }
]