[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "9. Orang-orang yang tinggal di Madinah, beriman sebelum orang-orang Muhajirin hijrah kepada mereka, yaitu kaum Anshar, mereka mencintai orang-orang Muhajirin dan membantu mereka dengan harta mereka. Mereka tidak menyimpan hasad apapun kepada orang-orang Muhajirin dari harta fai’ yang diberikan kepada mereka atau lainnnya, mereka mendahulukan orang-orang Muhajirin dan orang-orang yang membutuhkan atas diri mereka sendiri, sekalipun mereka juga miskin dan membutuhkan. Barangsiapa selamat dari kekikiran dan menahan harta yang lebih, maka mereka adalah orang-orang yang beruntung yang meraih apa yang mereka idam-idamkan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Dan golongan Ansar yang tinggal di Madinah sebelum kedatangan golongan Muhajirin dan memilih untuk beriman kepada Allah dan kepada Rasul-Nya, mereka mencintai orang-orang yang berhijrah kepada mereka dari Makkah. Tidak ada di dalam hati mereka rasa iri atau dengki terhadap golongan muhajirin di jalan Allah jika mereka (Muhajirin) diberi bagian dari harta rampasan perang, sementara mereka tidak mendapatkannya. Mereka mendahulukan kaum Muhajirin atas diri mereka sendiri dalam urusan harta duniawi, meskipun mereka sendiri dalam kondisi fakir dan susah. Dan barangsiapa dijaga Allah dari sifat tamak terhadap harta dalam dirinya lalu ia mengeluarkannya di jalan Allah, mereka itulah orang-orang yang menang dengan mendapatkan apa yang mereka inginkan dan selamat dari hal yang mereka hindari."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "9. Allah memuji para sahabat dari kalangan Anshar, penduduk Madinah: Mereka mencintai para sahabat dari kalangan Muhajirin, dan membagikan harta mereka bagi kaum Muhajirin. Tidak ada kaum Anshar yang memiliki rasa dengki atau amarah dalam diri mereka atas harta ghanimah yang diberikan kepada kaum Muhajirin. Mereka lebih mementingkan kaum Muhajirin dan orang-orang miskin daripada diri mereka, meskipun diri mereka sendiri membutuhkan dan kekurangan. Barangsiapa yang selamat dari kekikiran maka orang-orang yang memiliki derajat yang tinggi ini adalah orang-orang yang akan meraih kemenangan di dunia dan di akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. وَالَّذِينَ تَبَوَّءُو الدَّارَ وَالْإِيمٰنَ مِن قَبْلِهِمْ (Dan orang-orang yang telah menempati kota Madinah dan telah beriman (Anshor) sebelum (kedatangan) mereka (Muhajirin)) Mereka adalah orang-orang Anshar yang telah bermukim di Madinah sebelum kaum Muhajirin, mereka beriman kepada Allah dan Rasulullah. يُحِبُّونَ مَنْ هَاجَرَ إِلَيْهِمْ(mereka (Anshor) mencintai orang yang berhijrah kepada mereka (Muhajirin)) Yakni mereka berbuat baik kepada kaum Muhajirin dan membagi harta dan tempat tinggal bagi mereka. وَلَا يَجِدُونَ فِى صُدُورِهِمْ حَاجَةً(Dan mereka (Anshor) tiada menaruh keinginan dalam hati mereka) Yakni tidak ada rasa hasad, kemarahan, atau sakit hati. مِّمَّآ أُوتُوا۟( terhadap apa-apa yang diberikan kepada mereka (Muhajirin)) Yakni terhadap harta fa’i yang hanya diberikan kepada kaum Muhajirin, mereka rela menerima hal itu. Ketika itu kaum muhajirin tinggal di rumah-rumah kaum Anshar, setelah Rasulullah mendapatkan harta Bani Nadlir, beliau memanggil kaum Anshar dan berterima kasih kepada mereka karena telah menerima kaum anshar di rumah mereka dan membagi harta mereka dengan kaum muhajirin. Lalu beliau bersabda: “Jika kalian menghendaki, aku akan membagi harta fa’i yang diberikan Allah kepadaku dari Bani Nadlir ini antara kalian dengan kaum Muhajirin, namun kaum muhajirin harus tetap dibolehkan untuk tinggal bersama kalian dan ikut menikmati harta kalian; dan jika kalian menghendaki, maka aku akan memberikan harta fa’i ini kepada kaum Muhajirin dan agar mereka dapat meninggalkan rumah kalian.” Maka kaum Anshar merelakan pembagian harta fa’i itu untuk kaum Muhajirin dengan lapang dada. وَيُؤْثِرُونَ عَلَىٰٓ أَنفُسِهِمْ(dan mereka mengutamakan (orang-orang Muhajirin), atas diri mereka sendiri) Yakni mereka mendahulukan kaum Muhajirin dalam urusan duniawi. وَلَوْ كَانَ بِهِمْ خَصَاصَةٌ ۚ( sekalipun mereka dalam kesusahan) Yakni meski mereka sangat membutuhkan. وَمَن يُوقَ شُحَّ نَفْسِهِۦ فَأُو۟لٰٓئِكَ هُمُ الْمُفْلِحُونَ(Dan siapa yang dipelihara dari kekikiran dirinya, mereka itulah orang orang yang beruntung) Yakni barangsiapa yang dijauhkan Allah dari ketamakan dan kekikiran hawa nafsunya sehingga ia dapat menjalankan zakat atau menunaikan hak orang lain yang diwajibkan syari’at maka ia telah mendapat keberuntungan dan kemenangan. Sedangkan orang yang kikir dan tamak maka ia bukanlah orang yang beruntung."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9. Harta fai’ diberikan oleh orang-orang yang tinggal di madinah yaitu kaum Anshar. Mereka telah beriman, ridho dan ikhlas dalam berbuat hanya untuk mengharap ridho Allah. Sebelum kaum Muhajirin hijrah, kaum Anshar mereka telah mencintai orang mukmin yang hijrah kepada mereka. Dalam hati kaum Anshar tidak terdapat penyakit hati seperti iri dengki dan marah. Mereka sama sekali tidak iri terhadap harta fai’ yang diberikan kepada kaum Muhajirin. Mereka bahkan lebih mengutamakan saudara seiman mereka (kaum Muhajirin) dari pada kepentingan mereka sendiri, sekalipun sebenarnya mereka juga sangat membutuhkan harta itu. Mereka mencegah dan menjaga diri mereka dari sifat kikir, yaitu terlalu mencintai harta dan enggan untuk bersedekah. Merekalah orang-orang yang beruntung, mereka akan mendapatkan pahala baik di dunia maupun di akhirat dan kebahagiaan yang hakiki. Diriwayatkan dari Ibnu Mundzir dari Zaid Al Asham bahwa kaum Anshar berkata: Wahai Rasul, bagilah untuk kami dan saudara kami Muhajirin tanah ini menjadi dua. Rasul menjawab: Jangan, namun cukup berikanlah mereka bahan makanan, dan mungkin juga buah-buahan. Karena tanah ini adalah milik kalian. Kaum Anshar menjawab: Baiklah kami ridho. Maka Allah menurunkan ayat ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan orang-orang yang telah menempati kota} yang tinggal di Madinah {dan beriman sebelum (kedatangan) mereka, yang mencintai orang yang berhijrah kepada mereka. Mereka tidak mendapati keinginan} dengki dan kemarahan {di dalam hatinya terhadap apa yang diberikan} sesuatu yang diberikan kepada orang-orang yang berhijrah berupa harta rampasan dan lainnya {Mereka mengutamakan daripada dirinya sendiri} mereka mendahulukan orang-orang yang berhijrah dan orang yang membutuhkan daripada diri mereka sendiri {meskipun mempunyai keperluan yang mendesak} keperluan daan kebutuhan {Siapa saja yang dijaga} yang dijaga dan dijauhkan {dirinya dari kekikiran} kekirian dirinya yang sangat menginginkan hal itu {maka itulah orang-orang yang beruntung"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8-9. Allah kemudian menjelaskan hikmah dan sebab yang mengharuskan Allah memberikan harta rampasan perang untuk golongan-golongan yang ditetapkan tersebut, karena mereka adalah orang-orang yang berhak mendapatkan pertolongan, berhak mendapatkan bagian tersebut, dan harus disegerakan untuk diberikan pada mereka. Mereka berada di antara dua hijrah. Pertama, mereka telah meninggalkan semua yang dicintai seperti rumah, negeri, orang-orang tercinta, kekasih, dan harta demi Allah dan demi menolong Agama Allah dan mencintai Rasulullah. Mereka adalah orang-orang yang benar, yang berbuat sebagaimana tuntutan keimanan. Mereka membuktikan keimanan dengan amal baik serta ibadah-ibadah berat. Lain halnya orang yang mengaku beriman tapi tidak dibuktikan dengan berjihad dan berhijrah serta ibadah-ibadah lainnya. Kedua, mereka berada di kalangan kaum Anshar, Aus dan Khazraj, mereka adalah kaum yang beriman kepada Allah dan RasulNya secara taat dan sukarela. Mereka memberikan tempat berlindung untuk Rasulullah yang tidak mereka berikan pada kaum bangsawan maupun rakyat. Mereka menempati negeri hijrah dan iman hingga menjadi tempat orang-orang Mukmin dan kaum Muhajirin berlindung serta menjadi kediaman kaum Muslimin dalam penjagaannya pada saat seluruh negeri adalah negeri harbi (perang), syirik, dan buruk. Para penolong Agama senantiasa berlindung ke kaum Anshar, hingga Islam menyebar dan kuat serta bertambah dan berkembang sedikit demi sedikit hingga mereka mampu membuka hati manusia dengan ilmu, iman, dan al-Quran, serta mampu menaklukan berbagai negeri dengan senjata. Di antara sebagian besar sifat orang-orang yang disinggung ini adalah “mereka mencintai orang yang berhijrah kepada mereka,” karena kecintaan mereka kepada allah dan RasulNya, mereka mencintai orang-orang yang mencintaiNya dan menolong AgamaNya, “dan mereka tiada menaruh keinginan dalam hati mereka terhadap apa-apa yang diberikan kepada mereka (orang Muhajirin),” maksudnya mereka tidak menaruh sikap hasad terhadap kaum Muhajirin atas karunia yang diberikan Allah serta berbagai keutamaan dan sifat baik yang berhak mereka miliki. Ini menunjukkan bersihnya hati mereka dari sifat dengki, iri, dan hasad. Dan juga menunjukkan bahwa kaum Muhajirin lebih utama dari kaum Anshar, karena Allah terlebih dahulu menyebarkan bahwa kaum Anshar tidak menaruh keinginan dalam hati mereka terhadap apa pun yang diberikan Allah pada kaum Muhajirin. Hal ini menunjukkan bahwa Allah memberi mereka karunia yang tidak diberikan pada kaum Anshar dan juga pada yang lainnya, karena mereka menyatukan antara menolong Agama Allah dan hijrah. Firman Allah, “Dan mereka mengutamakan (orang-orang Muhajirin), atas diri mereka sendiri. Sekalipun mereka memerlukan (apa yang mereka berikan itu).” Maksudnya, di antara sifat-sifat kaum Anshar yang tidak bisa disaingi oleh yang lain dan menjadi karakteristik utama mereka adalah lebih mengutamakan orang lain daripada dirinya sendiri. Sifat ini merupakan puncak berbagai jenis kedermaan. Yaitu mengutamakan orang lain daripada diri sendiri, baik dalam hal harta maupun yang lainnya, padahal sebenarnya mereka juga memerlukannya bahkan sekalipun mereka amat memerlukannya. Siraf seperti altruisme (mengutamakan kepentingan orang lain) ini hanya dimiliki oleh orang yang mempunyai akhlak yang suci dan lebih mencintai Allah daripada mencintai keinginan diri dan berbagai kenikmatannya. Di antaranya adalah kisah seorang Anshar yang menjadi penyebab turunnya ayat ini ketika lebih mengutamakan tamunya dengan memberinya makanan sementara rela membiarkan diri dan keluarganya tidur dalam keadaan lapar. Kebalikan dari altruisme adalah egoisme. Altruisme adalah sifat terpuji sedangkan egoisme adalah sifat tercela, karena termasuk sifat-sifat kikir dan pelit. Siapa pun yang diberi karunia sifat altruisme, maka telah terjaga dari kekikiran diri. “Dan siapa yang dipelihara dari kekikiran dirinya, mereka itulah orang-orang yang beruntung.” Menjaga kekikiran diri mencakup menjaga diri dari kekikiran dalam seluruh hal yang diperintahkan. Sebab jika seorang hamba telah terjaga dari kekikiran dirinya, maka ia merelakan dirinya untuk menunaikan segala perintah Allah dan RasulNya. Pekerjaan yang dilakukan semata karena ketaatan dan ketundukan dengan kelapangan dada serta disenangi oleh jiwa, meski jiwanya menyeru dan ingin melakukannya. Orang yang terjaga dari kekikiran diri juga merelakan diri untuk mencurahkan harta di jalan Allah demi mencari keridhaanNya. Dengan demikian ia akan mendapatkan keberuntungan dan kemenangan. Lain halnya dengan orang yang tidak terjaga dari kekikiran dirinya. Bahkan diuji dengan bersifat kikir terhadap kebaikan yang justru menjadi pangkal dan asal-usul keburukan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Hasyr ayat 9: Allah menyebutkan kaum anshar dan memuji mereka dan mensucikan mereka. Allah menyebutkan bahwa mereka yang bertempat tinggal sebelum muhajirin datang, dan telah beriman sebelum muhajirin berpindah ke Madinah, dan sungguh mereka telah mencintai saudarnya dari kalangan muhajirin, mereka banyak menolong muhajirin, rela terhadap mereka, dan memberikan sebagian harta mereka kepada muhajirin, serta tidak didapati dalam dada-dada mereka sifat hasad, jengkel dan paksaan dari apa yang mereka berikan kepada saudara mereka dari kalangan muhajirin yang Allah telah karuniakan dan mengkhususkan dengannya; Bahkan mereka (anshar) mendahulukan saudaranya dari muhajirin atas diri-diri mereka sendiri pada segala sesuatunya dari kesenangan dunia dan kecintaan padanya, bahkan seandainya mereka dalam kondisi fakir dan butuh, mereka memberikan dari rezeki yang datang dari Allah. Dan mereka (anshar) jauh dari sifat bakhil; Mereka adalah termasuk orang-orang yang selamat, dan menang dengan kemenangan yang besar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Imam Bukhari meriwayatkan dengan sanadnya yang sampai kepada Abu Hurairah radhiyallahu 'anhu, bahwa ada seorang yang datang kepada Nabi shallallahu 'alaihi wa sallam, lalu Beliau meminta jamuan kepada istri-istrinya, namun istri-istrinya menjawab, “Kita tidak memiliki apa-apa selain air.” Maka Rasulullah shallallahu 'alaihi wa sallam bersabda, “Siapakah yang mau membawa orang ini (ke rumahnya) dan menjamunya?” Lalu salah seorang Anshar berkata, “Saya.” Maka ia pergi dengannya menemui istrinya, ia berkata, “Muliakanlah tamu Rasulullah shallallahu 'alaihi wa sallam.” Istrinya menjawab, “Kita tidak memiliki apa-apa selain makanan untuk anak-anakku.” Ia (suaminya) menjawab, “Siapkanlah makananmu, nyalakan lampu dan tidurkanlah anak-anakmu ketika mereka hendak makan malam.” Maka istrinya menyiapkan makanannya, menyalakan lampunya dan menidurkan anak-anaknya, lalu ia berdiri seakan-akan sedang memperbaiki lampunya, kemudian ia memadamkannya. Keduanya (Suami dan istri) seakan-akan memperlihatkan kepada tamunya bahwa keduanya makan, sehingga keduanya tidur malam dalam keadaan lapar. Ketika tiba pagi harinya, maka ia mendatangi Rasulullah shallallahu 'alaihi wa sallam, lalu Beliau bersabda, “Tadi malam Allah tertawa atau takjub melihat perbuatan kamu berdua.” Maka Allah Subhaanahu wa Ta'aala menurunkan ayat, “Dan mereka mengutamakan (Muhajirin), atas dirinya sendiri, meskipun mereka juga memerlukan. Dan siapa yang dijaga dirinya dari kekikiran, maka mereka itulah orang orang yang beruntung.” Di antara sifat mereka yang indah adalah bahwa mereka mencintai orang-orang yang berhijrah kepada mereka. Hal itu, karena mereka cinta karena Allah; mereka pun mencintai orang-orang yang mencintai-Nya dan membela agama-Nya. Ayat ini bisa juga diartikan, “Dan mereka tidak menaruh rasa iri dalam hati mereka terhadap apa yang diberikan kepada mereka (Muhajirin), “ berupa kelebihan dan keutamaan yang Allah berikan. Ayat ini menunjukkan selamatnya hati mereka (orang-orang Anshar) dan tidak adanya rasa dengki dan iri di hati mereka kepada kaum muhajirin. Ayat ini juga menunjukkan bahwa kaum muhajirin lebih utama dari kaum Anshar karena Allah Subhaanahu wa Ta'aala menyebutkan mereka lebih dahulu dan karena mereka menggabung antara membela dan berhijrah. Yakni di antara sifat orang-orang Anshar sehingga mereka unggul di atas yang lain adalah Iitsar, yaitu sikap mengutamakan orang lain daripada diri sendiri meskipun mereka membutuhkannya. Hal ini tidaklah muncul kecuali dari akhlak yang bersih serta mencintai Allah di atas kecintaan kepada apa yang disenangi jiwa. Kebalikan dari Iitsar adalah atsarah yang artinya mementingkan diri sendiri. Akhlak ini (atsarah) adalah akhlak tercela karena termasuk kebakhilan dan kekikiran, sedangkan orang yang diberi sikap iitsar, maka ia telah dijaga dari kekikiran dirinya. Kedua golongan yang disebutkan dalam ayat di atas (8 dan 9) yaitu golongan Muhajirin dan Anshar adalah kedua golongan yang utama lagi bersih. Mereka adalah para sahabat yang mulia yang menjadi para pemimpin kebaikan. Mereka mengumpulkan banyak kebaikan, kemuliaan dan kelebihan sehingga mendahului generasi setelah mereka dan menyusul generasi sebelum mereka. Generasi setelah mereka juga akan mendapatkan keutamaan jika berjalan mengikuti mereka (kaum Muhajirin dan Anshar) sebagaimana yang disebutkan dalam ayat selanjutnya. Dan dari tamak terhadap harta. Termasuk menjaga dari kekikiran diri adalah menjaga diri dari kekikiran dalam mengerjakan semua yang diperintahkan Allah, karena apabila seorang hamba dijaga dari kekikiran dirinya, maka ia akan melaksanakan perintah Allah dengan suka rela dan lapang dada dan dirinya rela meninggalkan apa yang dilarang Allah Subhaanahu wa Ta'aala meskipun ia menyukainya. Ia pun akan mengorbankan hartanya di jalan Allah dan mencari keridhaan-Nya. Dengan begitu tercapailah keberuntungan. Berbeda dengan orang yang ditimpa sikap kikir untuk berbuat baik, dimana hal ini merupakan sumber keburukan dan materinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hasyr Ayat 9",
    "description": "Muhajirin, menurut ayat sebelumnya, adalah orang-orang yang terusir dari kampung halamannya di mekah dan berhijrah bersama rasulullah ke madinah demi menolong Allah dan rasul-Nya. Pada ayat ini disebutkan sikap dan penerimaan kaum ansar terhadap muhajirin dengan cinta dan persaudaraan sejati. Dan orang-orang ansar, para penolong, yang telah menempati kota madinah jauh sebelum rasulullah hijrah ke kota ini. Dan mereka telah beriman kepada Allah dan rasul-Nya sebelum kedatangan mereka, muhajirin ke madinah. Mereka, para penolong itu, mencintai muhajirin, orang yang berhijrah ke tempat mereka, karena Allah. Dan mereka, orang-orang ansar, ketika membantu muhajirin yang berhijrah ke madinah dengan harta dan berbagai fasilitas, tidak menaruh keinginan dalam hati mereka benda-benda yang diberikan itu, karena penuh keikhlasan, terhadap apa yang diberikan kepada mereka, baik harta maupun tenaga. Dan mereka mengutamakan kepentingan para sahabat muhajirin atas dirinya sendiri, meskipun sebenarnya mereka juga memerlukan semua fasilitas yang diberikan itu. Sungguh ketentuan Allah menegaskan: dan siapa yang dijaga dirinya oleh Allah atas usaha dan perjuangan mereka dari kekikiran, maka mereka itulah orang-orang yang beruntung, karena berhasil melawan ego dan berhasil menjadi pribadi yang mulia. 10. Sesudah menjelaskan keberhasilan muhajirin dan ansar membangun persaudaraan sejati atas dasar iman, Allah lalu menjelaskan karakter orang-orang beriman generasi sesudah mereka. Dan orang-orang beriman, berilmu, dan beramal saleh yang datang sesudah mereka dari generasi ke generasi hingga hari kiamat, mereka berdoa kepada Allah, 'ya tuhan kami, ampunilah dosa-dosa kami baik yang disengaja maupun yang tidak disengaja dan ampuni pula dosa-dosa saudara-saudara kami seiman yang telah beriman lebih dahulu dari kami, umat rasulullah maupun umat para nabi sebelumnya dan janganlah engkau tanamkan kedengkian dalam hati kami terhadap orang-orang yang beriman karena kedengkian itu menghapuskan amal saleh. Ya tuhan kami, sungguh, engkau maha penyantun kepada setiap hamba, maha penyayang kepada hamba yang beriman sehingga mereka mendapat kebaikan dunia dan akhirat. '"
  }
]