[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tahukah kamu (wahai rasul) ,apa itu hawiyah (jahanam)?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Tahukah kamu -wahai Rasul- apakah dia?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. وَمَاۤ اَدۡرٰٮكَ مَا هِيَهۡ ؕ‏ (Tahukah kamu apakah neraka Hawiyah itu?) Pertanyaan ini digunakan untuk menakut-nakuti dan menjelaskan bahwa neraka ini tidak seperti yang dikenal karena tidak diketahui hakikatnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10-11. Apakah kamu mengetahui wahai manusia tentang neraka Hawiyah yang dapat menghancurkan(mu) ini? Dinamakan sebagai neraka Hawiyah karena dia jatuh sampai ke dasarnya. Dasar neraka Hawiyah adalah tempat yang sangat rendah (curam). Istifham itu digunakan untuk menakut-nakuti. Dan Ha’ pada {Hiyah} adalah Ha’ Sakat, yang dibubuhkan di akhir kata untuk tanda berhenti, lalu dia menunjukkan hubungan (dengan kata setelahnya). Sesungguhnya Hawiyah adalah neraka jahanam yang sangat panas."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apakah kamu apakah (neraka) itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8-11. “Dan adapun orang-orang yang lebih berat timbangan (kebaikan) nya,” dengan tidak memiliki kebaikan-kebaikan untuk menutupi keburukan-keburukan, “maka tempat kembalinya adalah Neraka Hawiyah,” yaitu tempat kembali dan tempat tinggalnya adalah neraka yang di antara namanya adalah Hawiyah. Neraka baginya menjadi seperti ibu yang selalu menemani,. Ada yang berpendapat bahwa makna ayat ini adalah induk otaknya beterbangan di neraka, yaitu dilemparkan ke dalam neraka dengan kondisi terjungkir. “Dan tahukah kamu apakah Neraka Hawiyah itu?” ini adalah pengagungan perihal neraka itu. Kemudian Allah menjelaskannya dengan FirmanNya, “(Yaitu) api yang sangat panas,” yaitu yang panasnya dahsyat. Panasnya melebihi sembilan puluh kali panasnya api dunia. Semoga kita dilindungi Allah darinya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Tahukah kamu wahai Rasul tentang \"Hawiyah\" itu ?"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "10-11. وَمَا أَدْرَاكَ مَا هِيَهْ \" Dan tahukah kamu apakah neraka Hawiyah itu? \" Ini adalah ungkapan pengagungan dan pembesaran untuk neraka hawiyah ini, ditanyakan apakah itu? Apakah anda tahu neraka itu. Sungguh dia adalah sesuatu yang besar, dia adalah neraka yang amat panas, yang derajat panasnya sampai pada puncak tertinggi. Nabi shallallaahu 'alaihi wa sallam telah bersabda tentangnya: إِنَّهاَ فُضِّلَتْ عَلَى نَارِ الدُّنْيَا بِتِسْعَةٍ وَسِتِّيْنَ جُزْءًا \"Neraka lebih panas dibanding api dunia dengan kelipatan sembilan pulh sembilan kali lipat\"(1) jika Anda memperhatikan api dunia semuanya, baik api kayu bakar atau daun atau api kompor atau yang lebih besar dari itu, maka tetap;ah api neraka lebih panas sembilan puluh sembilan kali lipat dari itu semua, nasalullaaha al-'aafiyah. Dalam ayat ini terkandung ancaman dan peringatan dari hari ini, dan bahwa manusia tidak akan keluar dari dua kondisi: Bisa jadi dia sesorang yang lebih berat kebaikan-kebaikannya atau dia menjadi orang yang lebih berat keburukan-keburukannya. Di dalamnya juga terdapat dalil yang menunjukkan bahwa pada hari kiamat akan ada timbangan-timbangan. Dan telah datang dalil-dalil yang menyebutkan bahwa itu adalah timbangan, apakah dia satu timbangan ataukah lebih dari satu? Sebagian ahli Ilmu mengatakan bahwa timbangan tersebut hanya satu, disebutkan dengan bentuk jamak karena menyesuaikan dengan yang ditimbang. Karena dengan timbangan tersebut ditimbang kabaikan-kebaikan dan keburukan-keburukan, dan ditimbang dengannya kebaikan-kebaikan fulan dan fulan, dan ditimbang juga dengannya kebaikan-kebaikan umat ini dan umat lainnya. Maka timbangan tersebut dibentuk dengan jamak karena disesuaikan dengan yang ditimbang, bukan karena jumlah timbangannya itu sendiri (yang jamak). Tetapi timbangan itu hanya satu saja. Sebagian Ahli Ilmu mengatakan bahwa timbangan tersebut banyak, setiap umat mempunyai timbangan sendiri, dan setiap amalan ada timbangan mizannya, oleh karenanya disebutkan dengan bentuk jamak. Dan yang paling nampak jelas wallaahu a'lam, timbangan tersebut hanya satu timbangan, tetapi dia disebutkan dengan jamak karena menyesuaikan dengan sesuatu yang ditimbang sesuai dengan amalan perbuatan, atau sesuai dengan umat-umat juga disesuaikan dengan person-person setiap orang. Di dalam ayat ini juga terkandung dalil yang menunjukkan bahwa manusia, apabila kebaikan-kebaikan dan keburukan-keburukannya seimbang, maka kondisinya ini tidak dijelaskan oleh ayat ini, akan tetapi Allah Ta'ala menjelaskan dalam surat al-A'raf bahwa mereka tidak akan masuk ke dalam neraka, akan tetapi mereka akan ditahan di tempat yang disebut dengan al-A'raaf, dan Allah Ta'ala menyebutkan apa-apa yang terjadi antara mereka dengan orang-orang yang beriman, dan mereka itu apa bila diperlihatkan kepada penduduk neraka mereka akan mengatakan رَبَّنَا لاَ تَجْعَلْنَا مَعَ الْقَوْمِ الظَّالِمِينَ \"Ya Tuhan kami janganlah jadikan kami bersama orang-orang yang zalim\" Kita meminta kepada Allah 'Azza Wa Jalla agar menjadikan kita termasuk orang yang lebih berat kebaikannya dari pada keburukannya, juga mengampuni kita dan memperlakukan kita dengan kemaafannya sesungguhnya Allah Maha Kuasa atas segala sesuatu. (1) Dikeluarkan oleh Bukhari (3265) dan Muslim (2843) dari hadits Abu Hurairah radhiyallaahu 'anhu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qari’ah ayat 10: 8-11. Allah mengabarkan bahwa barangsiapa yang timbangan amal keburukannya lebih dominan daripada kebaikannya, maka Allah tidak jadikan dirinya mendapat kebaikan, dan tempat kembalinya adalah dijebloskan (dilempar) ke dalam jahannam. Kemudian Allah bertanya dengan maksud tegas : Apakah engkau tahu wahai Nabi Allah apat itu Hawiyyah ? Maka Allah menjawab bahwa itu adalah neraka yang apinya telah dinyalakan, kemudian sampailah (orang yang masuk neraka) ini pada tujuan akhirnya (neraka). Ya Allah, kami meminta pada-Mu keselamatan atas diri kami dan saudara-saudara se-islam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kalimat ini untuk memperbesar perkaranya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qari’ah Ayat 10",
    "description": "Menggugah perhatian manusia tentang neraka hawiyah itu, Allah berfirman, 'dan tahukah kamu apakah neraka hawiyah itu''11. Neraka hawiyah itu adalah api yang sangat panas dan menjadikan apa saja yang masuk ke dalamnya hancur lebur dan leleh."
  }
]