[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Pada hari itu, manusia dalam banyaknya jumlah mereka, bercerai berainya mereka dan pergerakan mereka seperti laron yang berterbangan, yaitu laron yang berjatuhan kedalam api."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4 Pada hari itu hati manusia bergetar, mereka menjadi seperti anai-anai yang beterbangan dan berserakan ke sana sini."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "4-5. Pada hari yang sulit itu manusia berada dalam keadaan yang menakutkan, mereka seperti kupu-kupu yang berhamburan di bumi, mereka keluar dari kubur yang ada di timur dan barat bumi; hal ini karena mereka tidak memiliki kekuatan dan kebingungan, serta berjalan tanpa ada petunjuk, dan mereka keluar dalam waktu yang bersamaan. Gunung-gunung bergoncang hingga hancur berkeping-keping."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. يَوۡمَ يَكُوۡنُ النَّاسُ كَالۡفَرَاشِ الۡمَبۡثُوۡثِ (Pada hari itu manusia adalah seperti anai-anai yang bertebaran) Makna (الفراش) yakni serangga yang dapat terbang, sedangkan (المبثوث) yakni bertebaran. Yakni manusia ketika itu berjalan tanpa arah yang menentu, akibat kengerian yang terjadi sampai mereka dikumpulkan di padang mahsyar."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "4-5 1 ) . Penyandingan dua keadaan makhluk yang berbeda ketika hari kiamat itu datang, di dua ayat yang saling berdampingan ini, seakan-akan Allah memperingatkan bahwa pengaruh guncangan pada hari itu terhadap gunung-gunung menjadikannya seperti debu yang beterbangan, lalu bagaimana dengan manusia ketika mendengar guncangan itu yang penciptaan mereka jauh lebih kecil dibanding gunung-gunung itu ? Celaka dan celakalah anak Adam jika rahmat Allah tidak sampai kepada mereka ! 2 ) . Jika anda membanyangkan bagaimana peristiwa ini terjadi, ketika manusia keluar dari kubur mereka dengan keadaan yang amat buruk ini, maka kamu akan membayangkan perkara yang amat besar yang tidak ada lagi perkara yang jauh lebih besar dari peristiwa ini !"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Hari kiamat yaitu hari dimana manusia keluar dari kubur dan berkelana di atas wajah mereka seperti ngengat (hewan terbang kecil yang berkumpul pada malam hari di cahaya lampu) yang bertebaran. Mereka diumpamakan seperti ngengat karena kebingungan dan ketidaktahuan mereka terkait hukuman (yang akan mereka terima)"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Pada hari itu manusia seperti laron yang beterbangan} bertebaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4. “Pada hari itu manusia,” karena begitu dahsyatnya rasa takut dan ngeri, “adalah seperti anai-anai yang bertebaran,” atau seperti belalang-belalang yang beterbangan yang sebagiannya menumpuk seperti gelombang di atas sebagian yang lain, firosy adalah binatang yanga beterbangan di waktu malam yang beterbangan yang sebagiannya menumpuk seperti gelombang di atas sebagian yang lain tidak tahu hendak menuju kemana. Bila neraka dinyalakan, mereka berdesak-desakkan ke arahnya karena lemahnya pengetahuan mereka. Inilah kondisi manusia, orang-orang yang berakal."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ يَوْمَ يَكُونُ النَّاسُ } Pada hari itu manusia digiring dari kubur mereka menuju persidangan, mulai dari manusia pertama sampai manusia paing terakhir hidup didunia, tidak satupun dari mereka yang terlewatkan, Allah - عز وجل - berfirman : { خُشَّعًا أَبْصَارُهُمْ يَخْرُجُونَ مِنَ الْأَجْدَاثِ كَأَنَّهُمْ جَرَادٌ مُنْتَشِرٌ } ( Sambil menundukkan pandangan-pandangan mereka keluar dari kuburan seakan-akan mereka belalang yang beterbangan ) [ Al-Qomar : 7 ] , mereka dibangkitkan dengan keadaan mereka seperti laron yang berterbangan memenuhi bumi."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Kemudian Allah menjelaskan kapan hari kiamat itu terjadi? Allah Jalla wa 'Alaa berfirman: يَوْمَ يَكُونُ النَّاسُ كَالْفَرَاشِ الْمَبْثُوثِ \" Pada hari itu manusia seperti anai-anai yang bertebaran,\" Maknanya: bahwa hari itu terjadi pada waktu ketika manusia seperti anai-anai yang bertebaran ketika mereka keluar dari kuburan-kuburan mereka. Para ulama mengatakan: Mereka (manusia) menjedi seperti anai-anai yang bertebaran. Dan anai anai adalah serangga-serang kecil yang berkerumunan ketika ada api di malam hari, mereka sangat lemah, mereka hampir tidak mampu berjalan tanpa petunjuk, mereka berkerumunan, bahkan karena mereka lemah, mereka terjatuh ke api sedangkan ia tidak menyadarinya. Mereka (manusia pada hari kebangkitan) menyerupai anai-anai dalam kelemahan, kebingungan, kerumunan dan jalannya yang tanpa petunjuk. Dan al-Mabtsuts : maknanya adalah yang bertebaran, ini seperti dalam firman Allah Ta'ala: يَخْرُجُونَ مِنَ الْأَجْدَاثِ كَأَنَّهُمْ جَرَادٌ مُنْتَشِرٌ \" mereka keluar dari kuburan seakan-akan mereka belalang yang beterbangan,\"(QS. Al-Qamar: 7) jikalau anda membayangkan kejadian ini, manusia-manusia keluar dari kuburan merka dengan keadaan seperti ini, maka sungguh akan terbayang perkara besar yang tidak ada bandingannya. Seluruh alam dari Adam hingga terjadinya hari kiamat, semuanya keluar bak keluarnya satu orang dalam satu waktu, dari kuburan-kuburan yang dikeluarkan pada bagian timur bumi hingga bagian baratnya, dan yang tidak di kubur juga mseperti orang yang terlempar di tengah lautan, yang kemudian dimakan hiu, atau di padang rumput yang luas, yang dimakan binatang buas atau yang semisalnya. Mereka semua akan keluar dalam satu waktu, mereka keluar dan berjalan di bumi."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qari’ah ayat 4: Kemudian Allah menjelaskan sesuatu dari keadaan-keadaan hari kiamat (Al Qari’ah); Allah mengabarkan bahwa manusia pada hari kiamat dikeluarkan dari kubur-kubur mereka. Mereka ketakutan dan mereka seolah-olah seperti anai-anai yang bertebaran di sini dan di sana, sebagian dari mereka terombang-ambing atas sebagian yang lain. Mereka berlarian ke semua penjuru arah tidak beraturan karena sebab kengerian pada hari itu. Allah telah jelaskan dalam ayat yang lain : كَأَنَّهُمْ جَرَادٌۭ مُّنتَشِرٌۭ yang artinya : Mereka seakan-akan seperti belalang yang beterbangan, {Al Qamar : 7}. Dan belalang terbang menuju satu arah semisal kerumunan burung, dan boleh jadi pada hari kebangkitan, makhluk melewati banyak keadaan, dan maksudnya adalah (belalang) yang menyerupai manusia menuju ke satu titik (pada hari kebangkitan)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Karena dahsyatnya peristiwa pada hari itu. Karena kebingungan, sampai mereka dipanggil untuk dihisab."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qari’ah Ayat 4",
    "description": "Allah menggambarkan dahsyatnya hari kiamat melalui dua hal, yaitu keadaan manusia dan gunung-gunung. Pada hari kiamat itu manusia seperti laron yang beterbangan. Mereka berlarian tidak tentu arah, kacau balau, dan tidak lagi menghiraukan sekelilingnya. 5. Dan pada hari kiamat itu pula gunung-gunung seperti bulu yang dihambur-hamburkan. Gunung yang demikian kekar diempaskan sehingga menjadi abu, kemudian disapu oleh angin dahsyat hingga beterbangan, menjadikan bumi terhampar rata."
  }
]