[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan gunung-gunung seperti kapas yang berwarna warni yang diterbangkan oleh tangan, ia menjadi debu yang beterbangan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Gunung-gunung menjadi seperti bulu yang diterbangkan angin karena ringannya jalannya dan gerakannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. يَوۡمَ يَكُوۡنُ النَّاسُ كَالۡفَرَاشِ الۡمَبۡثُوۡثِ (Pada hari itu manusia adalah seperti anai-anai yang bertebaran) Makna (الفراش) yakni serangga yang dapat terbang, sedangkan (المبثوث) yakni bertebaran. Yakni manusia ketika itu berjalan tanpa arah yang menentu, akibat kengerian yang terjadi sampai mereka dikumpulkan di padang mahsyar."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "4-5 1 ) . Penyandingan dua keadaan makhluk yang berbeda ketika hari kiamat itu datang, di dua ayat yang saling berdampingan ini, seakan-akan Allah memperingatkan bahwa pengaruh guncangan pada hari itu terhadap gunung-gunung menjadikannya seperti debu yang beterbangan, lalu bagaimana dengan manusia ketika mendengar guncangan itu yang penciptaan mereka jauh lebih kecil dibanding gunung-gunung itu ? Celaka dan celakalah anak Adam jika rahmat Allah tidak sampai kepada mereka ! 2 ) . Jika anda membanyangkan bagaimana peristiwa ini terjadi, ketika manusia keluar dari kubur mereka dengan keadaan yang amat buruk ini, maka kamu akan membayangkan perkara yang amat besar yang tidak ada lagi perkara yang jauh lebih besar dari peristiwa ini !"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Gunung-gunung digambarkan seperti bulu domba yang (mudah) diurai karena ringan dan cepat dihamburkan. Semua itu mengandung ketakutan dan kekhawatiran"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan gunung-gunung seperti bulu} bulu {yang berhamburan} terpecah belah bagian-bagiannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5. Dan gunung-gunung yang diam dan kokoh menjadi, “seperti bulu yang dihambur-hamburkan,” yaitu seperti bulu yang diterbangkan, berubah menjadi amat lemah sekali yang bisa berhamburan hanya karena angin kecil. Allah berfirman : “Dan kamu lihat gunung-gunung itu, kamu sangka dia tetap di tempatnya, padahal ia berjalan sebagai jalannya awan (QS. an-naml. 88) Kemudian setelah itu berubah menjadi debu yang beterbangan lalu terhempas, hingga tidak tersisa sesuatu pun yang bisa dilihat. Pada saat itu, neraca amal ditegakkan dan manusia terbagi menjadi dua golongan; mereka yang berbahagia dan mereka yang celaka."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ وَتَكُونُ الْجِبَالُ } Gunung-gunung yang ketika didunia berdiri gagah dengan sangat kuat, dan tidak satupu manusia mampu menghancurkannya kecuali dengan kerja keras alat-alat berat, akan tetapi pada hari kiamat { كَالْعِهْنِ الْمَنْفُوشِ } gunung-gunung yang besar itu akan diterbangkan seperti bulu-bulu yang berterbangan di udara, gunung-gunung yang kokoh itu akan menjadi layu dan ringan, dan keadaannya kan menjadi seperti bulu-bulu yang berterbangan di udara. Seperti yang diketahui bagaimana sifat dari bulu yang sangat lemah dan ringan apalagi ketika tertiup oleh angin, gunung-gunung pun akan seperti itu ketika hari kiamat itu tiba, akan menjadi ringan, hal itu terjadi dikarekan keadaan yang sangat menakutkan dan kehancuran yang sangat dahsyat pada hari itu, jika keadaan makhluk yang besar seperti itu, lalu bagaimana dengan manusia sangat kecil dan lemah ?! Itulah hari kiamat, hari yang tidak satupun dari makhluk yang mampu menghindar darinya, maha kuasa Allah ﷻ dengan segala ciptaan dan ketentuannya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Sedangkan gunung-gunung adalah gunung-gunung yang kokoh dan kuat, akan menjadi كَالْعِهْنِ الْمَنْفُوشِ \" dan gunung-gunung seperti bulu yang dihambur-hamburkan.\" العِهْن[Al-'Ihni] adalah bulu, dikatakan juga bermakna: Kapas المَنْفُوْش [al-Manfusy]: bertebaran. Maknanya: Bahwa gunung-gunung itu yang sebelumnya kokoh menancap kuat, akan menjadi seperti kapas yang bertebaran, baik itu seperti kapas yang bertebaran dengan tanganmu atau dengan kipas, ia sangat ringan berterbangan dengan angin yang kecil sekali pun. Allah Ta'ala telah berfirman dalam ayat-ayat lainnya bahwa gunung akan menjadi seperti debu yang beterbangan: وَبُسَّتِ الْجِبَالُ بَسًّا (5) فَكَانَتْ هَبَاءً مُنْبَثًّا \" dan gunung-gunung dihancur luluhkan sehancur-hancurnya, maka jadilah dia debu yang beterbangan,\"(QS. Al-Waqi'ah: 5-6) dan dalam ayat ini Allah Jalla Wa 'Ala berfirman: وَتَكُونُ الْجِبَالُ كَالْعِهْنِ الْمَنْفُوشِ \" dan gunung-gunung seperti bulu yang dihambur-hamburkan \""
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qari’ah ayat 5: Allah menjelaskan bahwa gunung-gunung pada hari kiamat seperti bulu, dimana gunung-gunung menghilang (dari tempatnya), menjadi seperti bulu (kapas) yang terkoyak dan berhamburan bagian demi bagiannya dan beterbangan di udara."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang sebelumnya kokoh dan kuat menjadi sangat lemah sekali. Sehingga menjadi debu dan rata dengan tanah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qari’ah Ayat 5",
    "description": "Dan pada hari kiamat itu pula gunung-gunung seperti bulu yang dihambur-hamburkan. Gunung yang demikian kekar diempaskan sehingga menjadi abu, kemudian disapu oleh angin dahsyat hingga beterbangan, menjadikan bumi terhampar rata. 6-7. Maka adapun orang yang berat timbangan kebaikan-Nya, baik berupa ibadah ritual maupun sosial yang dikerjakan dengan ikhlas, maka dia berada dalam kehidupan yang memuaskan dan membahagiakan. Itulah surga yang penuh nikmat."
  }
]