[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "6-7. Maka barangsiapa timbangan kebaikannya lebih berat, Maka dia berada dalam kehidupan yang diridhai di dalam surga."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Maka dia berada dalam kehidupan yang memuaskan yang mereka dapati di dalam Surga."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. فَهُوَ فِىۡ عِيۡشَةٍ رَّاضِيَةٍ ؕ‏ (maka dia berada dalam kehidupan yang memuaskan) Yakni kehidupan yang memuaskan bagi orang tersebut. Dan yang dimaksud dengan kehidupan yakni segala kenikmatan yang ada di surga."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6-7. Adapun orang yang kebaikannya lebih berat daripada keburukannya maka dia di surga dalam kehidupan yang penurh keridhaan dan kebahagiaan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{maka dia berada dalam kehidupan yang menyenangkan} kehidupan yang diridhai di surga"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6-7. “Dan adapun orang-orang yang berat timbangan (kebaikan) nya,” yaitu yang kebaikan-kebaikannya lebih berat melebihi keburukan-keburukannya, “maka dia berada dalam kehidupan yang memuaskan,” di dalam surga penuh kenikmatan."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Orang-orang yang timbangan amalan kebaikannya lebih berat daripada amalan keburukannya, { فَهُوَ فِي عِيشَةٍ رَاضِيَةٍ } maka akan menjalani kehidupannya dengan penuh kebaikan dan memuaskan, dia ridho dengan amalan yang telah ia perbuat didunia, maka dengan amalan tersebut segala urusannya akan dimudahkan, dan dengannya pula dia akan bahagia. Maka sesorang tidak akan mengambil manfaat dari amalan dan segala kebaikan yang dilakukan oleh orang lain, bahkan orang-orang yang paling dekat dengannya sekalipun tidak mampu memberikan kepadanya, sebagai contoh : seseorang menginginkan satu kebaikan dari ayahnya, dan dari ibunya, dan dari saudaranya, serta kerabat-kerabat lainnya, mereka semua tidak akan mampu menjadi penolong untuknya pada hari kiamat, setiap orang akan sibuk dengan urusannya masing-masing, tidak akan melirik kepada orang-orang selainnya, setiap orang akan berkata : diriku.. diriku.. karena sesungguhnya untuk selamat dari fitnah hari kiamat tidak akan tercapai melainkan hanya dengan amalan shalih yang diperbuat oleh setiap manusia, tidak dengan harta, atau dengan jabatan, atau dengan kekuasaan dan kekuatan, dan tidak pula dengan garis keturunan yang terhormat dikalangan masyarakat, keselamatan di akhirat akan diraih hanya dengan amalan kebaikan. Maka tidak sebaiknya sesorang menggantungkan harapannya kepada orang lain, atau kepada teman-teman dan sahabatnya, juga tidak bergantung kepada sanak keluarga, kalaupun sekiranya dia mendapat dukungan dari sanak keluarganya ketika didunia, akan tetapi beda halnya ketika hari kiamat telah mengambil gilirannya untuk menghakimi seluruh ummat manusia, setiap orang akan bersama dengan malannya masing-masing, Allah - عز وجل - berfirman : { يَوْمَ يَفِرُّ الْمَرْءُ مِنْ أَخِيهِ , وَأُمِّهِ وَأَبِيهِ , وَصَاحِبَتِهِ وَبَنِيهِ , لِكُلِّ امْرِئٍ مِنْهُمْ يَوْمَئِذٍ شَأْنٌ يُغْنِيهِ } ( Pada hari ketika manusia lari dari saudaranya , Dari ibu dan bapaknya , Dari istri dan anak-anaknya , Setiap orang dari mereka pada hari itu mempunyai urusan yang cukup menyibukkannya. ) [ Abasa : 34-37 ] . Setiap jiwa akan sibuk dengan dirinya sendiri dan bertanya-tanya : apakah dia akan selamat atau tidak, Allah - تعالى - berfirman : { يَوْمَ لَا تَمْلِكُ نَفْسٌ لِنَفْسٍ شَيْئًا ۖ وَالْأَمْرُ يَوْمَئِذٍ لِلَّهِ } ( (Yaitu) hari (ketika) seseorang tidak berdaya sedikitpun untuk menolong orang lain. Dan segala urusan pada hari itu dalam kekuasaan Allah ) [ Al-Infitar : 19 ] . Dan Allah mengatakan : { وَاتَّقُوا يَوْمًا لَا تَجْزِي نَفْسٌ عَنْ نَفْسٍ شَيْئًا } ( Dan jagalah dirimu dari (azab) hari (kiamat, yang pada hari itu) seseorang tidak dapat membela orang lain ) [ Al-Baqarah : 48 ] ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "6-7. Allah Ta'ala membagi manusia menjadi dua golongan: Golongan pertama: Orang-orang yang timbangannya berat yaitu orang yang kebaikan-kebaikannya lebih berat dari pada keburukan-keburukannya. Yang kedua: Orang-orang yang timbangannya ringan, yaitu orang yang timbangan keburukannya lebih berat dari kebaikannya, atau orang yang pada dasarnya tidak memiliki kebaikan sama sekali seperti kondisinya orang kafir, Allah Ta'ala berfirman: فَأَمَّا مَنْ ثَقُلَتْ مَوَازِينُهُ (6) فَهُوَ فِي عِيشَةٍ رَاضِيَةٍ \"101:6. Dan adapun orang-orang yang berat timbangan (kebaikan) nya, maka dia berada dalam kehidupan yang memuaskan.\" Kata العِيشَة [al-'Iisyah] diambil dari kata العِيْش [al-'Iisyu] yang artinya kehidupan, dikatakan: عَاشَ الرَّجُلُ زَمَناً طَوِيْلًا ['Aasyar rajulu zamanan thawiilan: Laki-laki itu hidup dengan waktu yang panjang] makna ia menetap dan hidup di waktu yang lama. Kata العِيشَة [al-'Iisyah] di sini dengan bentuk wazan فِعْلَة [Fi'lah] yang menunjukkan keadaan (atau kondisi) bukan masdar. Sedangkan masdar yang menunjukkan perbuatan itu dilakukan sekali, katakanlah عَيْشَة ['Aisyah]. Sedangkan jika anda mengatakan 'Iisyah maka dia menunjukan kondisi atau keadaan (suatu perbuatan) Sebagaimana dikatakan oleh Ibnu Malik Rahimahullaah: وَفَعْلَةٌ لِمَرَّةٍ كَجَلْسَةٍ وَفِعْلَةٌ لِهَيْئَةٍ كَجِلْسَةٍ Dan bentuk فَعْلَةٌ [fa'latun] untuk menjelaskan sekali (pekerjaan itu dilakukan) seperti جَلْسَة [Jalsatin: Sekali duduk].. Sedangkan bentuk فِعْلَةٌ [fi'latun] untuk menjelaskan keadaan (perbuatan) seperti جِلْسَةٍ [Jilsatin: Keadaan duduk]. Makna (al-'Iisyah ar-radhiyah) adalah dia dalam keadaan hidup yang baik. رَاضِيَةٍ dikatakan bahwa kata ini adalah isim fa'il (kata yang menunjukkan pelaku perbuatan) yang bermakna isim maf'ul (kata yang menunjukkan yang dikenakan perbuatan), artinya: (kehidupan) yang diridhai di katakan juga: kata tersebut adalah isim fa'il yang menunjukkan penisbatan, artinya: (kehidupan) yang memiliki keridhoan (memuaskan). Kedua makna tadi sama saja. Maknanya yaitu: kehidupan yang baik yang tidak ada di dalamnya gangguan, kegaduhan dan kesusahan. Kehidupan yang sempurna dari segala sisinya. Yang dimaksud disini adalah kehidupan di surga, semoga Allah menjadikan kita di antara mereka. Inilah kehidupan yang tidak dinodai dengan kesulitan sedikit pun, mereka tidak akan keluar darinya, tidak akan merasa sedih dan takut. Pada puncak kehidupan yang ternikmat, terbaik dan kondisi termenyenangkan. Itulah kehidupan yang memuaskan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qari’ah ayat 7: 6-7. Allah mengabarkan bahwa siapa yang timbangan amalan kebaikannya lebih dominan, maka Allah tambahkan kebaikannya di atas keburukan. Dan ia dalam kehidupannya menjadi manusia yang diridhai masuk dalam surga, merasa nyaman pandangannya, dan dirinya bergembira."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qari’ah Ayat 7",
    "description": "6-7. Maka adapun orang yang berat timbangan kebaikan-Nya, baik berupa ibadah ritual maupun sosial yang dikerjakan dengan ikhlas, maka dia berada dalam kehidupan yang memuaskan dan membahagiakan. Itulah surga yang penuh nikmat. 8-9. Dan adapun orang yang ringan timbangan kebaikan-Nya dan kalah berat dibanding timbangan keburukannya karena lebih banyak berbuat maksiat dan kebatilan daripada taat dan kebajikan, maka tempat kembalinya adalah neraka hawiyah."
  }
]