[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "8-9. Dan barangsiapa timbangan kebaikannya lebih ringan dan keburukannya lebih berat, Tempat kembalinya adalah jahanam."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Adapun orang yang amal buruknya lebih berat daripada amal salehnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "8-11. Sedangkan golongan kedua akan sengsara dan berada dalam keadaan yang buruk; (ibu) tempat bagi mereka hanya neraka. Dan ungkapan ‘ibu’ di sini karena ia adalah tempat berlindung dan tempat kembali bagi anaknya. Dan apakah kamu mengetahui tempat kembali yang menunggu mereka? Itu merupakan hal yang besar, yaitu neraka yang selalu menyala-nyala, dan ia berbeda dengan api di dunia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8-9. Adapun orang yang keburukannya lebih berat daripada kebaikannya, maka tempat tinggalnya atau tempatnya kembali adalah neraka jahanam dan neraka itu disebut sebagai Ibunya, karena dia kembali kepadanya sebagaimana anak kecil yang kembali kepada ibunya. Ini sebagai bentuk ejekan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Adapun orang yang ringan timbangannya} keburukannya melebihi kebaikannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8-11. “Dan adapun orang-orang yang lebih berat timbangan (kebaikan) nya,” dengan tidak memiliki kebaikan-kebaikan untuk menutupi keburukan-keburukan, “maka tempat kembalinya adalah Neraka Hawiyah,” yaitu tempat kembali dan tempat tinggalnya adalah neraka yang di antara namanya adalah Hawiyah. Neraka baginya menjadi seperti ibu yang selalu menemani,. Ada yang berpendapat bahwa makna ayat ini adalah induk otaknya beterbangan di neraka, yaitu dilemparkan ke dalam neraka dengan kondisi terjungkir. “Dan tahukah kamu apakah Neraka Hawiyah itu?” ini adalah pengagungan perihal neraka itu. Kemudian Allah menjelaskannya dengan FirmanNya, “(Yaitu) api yang sangat panas,” yaitu yang panasnya dahsyat. Panasnya melebihi sembilan puluh kali panasnya api dunia. Semoga kita dilindungi Allah darinya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Dan adapun orang-orang yang timbangan keburukannya lebih berat ketimbang kebaikannya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَأَمَّا مَنْ خَفَّتْ مَوَازِينُهُ \" Dan adapun orang-orang yang ringan timbangan (kebaikan) nya,\" Bisa jadi di sini adalah orang kafir yang tidak memiliki kebaikan sama sekali, karena kebaikan-kebaikan orang kafir akan dibalas di dunia saja dan itu tidak akan bermanfaat di akhirat, atau bisa juga Muslim tetapi dia melampaui batas terhadap dirinya sehingga keburukan-keburukannya lebih banyak."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qari’ah ayat 8: 8-11. Allah mengabarkan bahwa barangsiapa yang timbangan amal keburukannya lebih dominan daripada kebaikannya, maka Allah tidak jadikan dirinya mendapat kebaikan, dan tempat kembalinya adalah dijebloskan (dilempar) ke dalam jahannam. Kemudian Allah bertanya dengan maksud tegas : Apakah engkau tahu wahai Nabi Allah apat itu Hawiyyah ? Maka Allah menjawab bahwa itu adalah neraka yang apinya telah dinyalakan, kemudian sampailah (orang yang masuk neraka) ini pada tujuan akhirnya (neraka). Ya Allah, kami meminta pada-Mu keselamatan atas diri kami dan saudara-saudara se-islam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qari’ah Ayat 8",
    "description": "8-9. Dan adapun orang yang ringan timbangan kebaikan-Nya dan kalah berat dibanding timbangan keburukannya karena lebih banyak berbuat maksiat dan kebatilan daripada taat dan kebajikan, maka tempat kembalinya adalah neraka hawiyah"
  }
]