[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "8-9. Dan barangsiapa timbangan kebaikannya lebih ringan dan keburukannya lebih berat, Tempat kembalinya adalah jahanam."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Maka rumah dan tempat tinggalnya pada hari Kiamat adalah Jahanam."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. فَهُوَ فِىۡ عِيۡشَةٍ رَّاضِيَةٍ ؕ‏ (maka dia berada dalam kehidupan yang memuaskan) Yakni kehidupan yang memuaskan bagi orang tersebut. Dan yang dimaksud dengan kehidupan yakni segala kenikmatan yang ada di surga."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8-9. Adapun orang yang keburukannya lebih berat daripada kebaikannya, maka tempat tinggalnya atau tempatnya kembali adalah neraka jahanam dan neraka itu disebut sebagai Ibunya, karena dia kembali kepadanya sebagaimana anak kecil yang kembali kepada ibunya. Ini sebagai bentuk ejekan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{maka tempat kembalinya adalah neraka Hawiyah} tempat tinggalnya adalah neraka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8-11. “Dan adapun orang-orang yang lebih berat timbangan (kebaikan) nya,” dengan tidak memiliki kebaikan-kebaikan untuk menutupi keburukan-keburukan, “maka tempat kembalinya adalah Neraka Hawiyah,” yaitu tempat kembali dan tempat tinggalnya adalah neraka yang di antara namanya adalah Hawiyah. Neraka baginya menjadi seperti ibu yang selalu menemani,. Ada yang berpendapat bahwa makna ayat ini adalah induk otaknya beterbangan di neraka, yaitu dilemparkan ke dalam neraka dengan kondisi terjungkir. “Dan tahukah kamu apakah Neraka Hawiyah itu?” ini adalah pengagungan perihal neraka itu. Kemudian Allah menjelaskannya dengan FirmanNya, “(Yaitu) api yang sangat panas,” yaitu yang panasnya dahsyat. Panasnya melebihi sembilan puluh kali panasnya api dunia. Semoga kita dilindungi Allah darinya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Menurut suatu pendapat, makna yang dimaksud ialah terjatuh ke dalam neraka dengan kepala di bawah, yaitu neraka Jahanam. Lalu diungkapkan dengan ummihi yang artinya otaknya. Hal yang semisal telah diriwayatkan dari Ibnu Abbas, Ikrimah, Abu Saleh, dan Qatadah. Qatadah mengatakan bahwa orang itu terjatuh ke dalam neraka dengan kepala di bawah. Hal yang sama dikatakan oleh Abu Saleh, bahwa mereka terjatuh ke dalam neraka dengan kepala di bawah. Menurut pendapat yang lain, makna yang dimaksud ialah tempat asal yang menjadi tempat kembalinya dan tempat ia berpulang adalah Hawiyah, yaitu nama lain dari neraka. Ibnu Jarir mengatakan bahwa sesungguhnya dikatakan Hawiyah sebagai tempat kembalinya, tiada lain karena tiada kembali baginya kecuali hanya kepadanya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "فَأُمُّهُ هَاوِيَةٌ \" maka tempat kembalinya adalah neraka Hawiyah.\" Umm di sini bermakna kesudahan akhirnya. Maknanya: yang menjadi tujuan akhirnya adalah hawiya. Hawiyah adalah di antara nama-nama neraka. Yakni: Bahwa tempat kembalinya adalah neraka jahannam, wal'iyaadzu billaah. Dikatakan juga: Bahwa maksud al-Umm disini adalah ujung kepala. Sehingga maknanya bahwa ia akan dilempar ke neraka dari atas ujung kepalanya, kita memohon kepada Allah agar diselamatkan darinya. Jika ayat ini memiliki kemungkinan dua makna tidak bisa dirajihkan dan tidak saling bertentangan kedua makna tersebut, maka ke dua makna ini bisa diberlakukan semua. Maka dimaknai: dia dilemparkan ke nereka dari atas kepalanya dan dia tidak memiliki tempat kembali kecuali ke neraka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qari’ah ayat 9: 8-11. Allah mengabarkan bahwa barangsiapa yang timbangan amal keburukannya lebih dominan daripada kebaikannya, maka Allah tidak jadikan dirinya mendapat kebaikan, dan tempat kembalinya adalah dijebloskan (dilempar) ke dalam jahannam. Kemudian Allah bertanya dengan maksud tegas : Apakah engkau tahu wahai Nabi Allah apat itu Hawiyyah ? Maka Allah menjawab bahwa itu adalah neraka yang apinya telah dinyalakan, kemudian sampailah (orang yang masuk neraka) ini pada tujuan akhirnya (neraka). Ya Allah, kami meminta pada-Mu keselamatan atas diri kami dan saudara-saudara se-islam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Hawiyah adalah salah satu nama neraka, dimana orang-orang yang ringan timbangan kebaikannya akan tinggal di sana. Ada pula yang berpendapat, bahwa maksudnya dia akan dilempar ke neraka secara jungkir balik (dengan kepala di bawah)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qari’ah Ayat 9",
    "description": "8-9. Dan adapun orang yang ringan timbangan kebaikan-Nya dan kalah berat dibanding timbangan keburukannya karena lebih banyak berbuat maksiat dan kebatilan daripada taat dan kebajikan, maka tempat kembalinya adalah neraka hawiyah. 10. Menggugah perhatian manusia tentang neraka hawiyah itu, Allah berfirman, 'dan tahukah kamu apakah neraka hawiyah itu''."
  }
]