[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ini adalah (penyataan) sikap berlepas diri dari Allah dan RasulNya, dan pengumuman untuk melepaskan diri dari perjanjian-perjanjian yang dahulu terjalin antara kaum muslimin dengan orang-orang musyrik."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Ini adalah pemutusan hubungan dari Allah dan rasul-Nya, dan pengumuman -wahai orang-orang muslim- tentang berakhirnya perjanjian-perjanjian yang kalian buat dengan orang-orang musyrik di jazirah Arab."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1-2. Setelah Allah menyebutkan dalam akhir surat al-anfal pembahasan tentang perjanjian, yang sekali waktu dengan membahas tentang pembatalannya dan orang yang ditakutkan akan berbuat khianat dalam perjanjian itu, dan di lain waktu dengan membahas tentang perintah untuk berpegang dengan perjanjian jika merasa aman dari pengkhianatan; maka Allah memulai surat at-Taubah dengan perintah untuk membatalkan perjanjian dengan orang-orang tertentu yang melanggar perjanjian atau ditakutkan akan melanggar perjanjian tersebut. Dan ini menjelaskan sindiran dari ayat-ayat yang membahas tentang saling tolong menolong dalam surat al-Anfal, bahwa satu golongan yang disebutkan dalam ayat tersebut tidak layak untuk memberi pertolongan kepada golongan yang lain. Allah berfirman: \"Ini merupakan pernyataan dari Allah dan rasul-Nya yang berlepas diri dari orang-orang musyrik yang menentang, yang kalian buat perjanjian dengan mereka.\" Kemudian firman Allah ditujukan bagi orang-orang beriman untuk menjelaskan apa yang harus mereka katakan kepada orang-orang musyrik ketika Allah dan rasul-Nya telah berlepas diri dari perjanjian mereka. Allah memerintahkan orang-orang beriman untuk berkata kepada mereka: \"Berjalanlah di muka bumi dengan rasa aman, karena tidak ada seorang muslimpun yang akan menyerang kalian selama 4 bulan. Dan ketahuilah bahwa kalian tidak akan mampu melemahkan Allah dan tidak akan dapat melarikan diri dari-Nya jika kalian tetap berbuat kesyirikan dan memusuhi Allah dan rasul-Nya. Namun Allah akan menjadikan orang-orang beriman menguasai kalian dan menolong mereka dengan kemenangan yang telah dijanjikan Allah; dan kesudahan yang baik adalah bagi orang-orang yang bertakwa. Telah berlaku sunnatullah bahwa kehinaan di dunia dan di akhirat akan menimpa orang-orang kafir yang memusuhi dan memerangi orang-orang beriman dan para rasul.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. بَرَآءَةٌ مِّنَ اللهِ وَرَسُولِهِۦٓ إِلَى الَّذِينَ عٰهَدتُّم ((Inilah pernyataan) pemutusan hubungan dari Allah dan Rasul-Nya (yang dihadapkan) kepada orang-orang musyrikin yang kamu (kaum muslimin) telah mengadakan perjanjian) Makna perjanjian ialah akad yang diikat dengan sumpah. Yakni ayat ini mengabarkan kepada kaum muslimin bahwa Allah dan Rasul-Nya telah berlepas dari perjanjian-perjanjian itu karena orang-orang kafir telah melanggarnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Ayat ini turun di Madinah satu tahun setelah Fathu Makkah pada tahun ke sembilan dari tahun Hijrah. Pada tahun perang Tabuk, tidak diawali basmalah, diawali dengan kesucian atau kebersihan Allah dan rasul-Nya dari orang-orang musyrik dan perintah untuk memerangi mereka, dan mengeluarkan mereka dari tanah Arab. 1 Inilah pernyataan pemutusan hubungan dari Allah dan Rasul-Nya yang dihadapkan kepada orang-orang musyrikin atas perjanjian yang telah diadakan perjanjian dengan kaum muslimin sebab mereka telah menghianati janji."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Pemutusan hubungan} ini adalah pembiaran {dari Allah dan RasulNya kepada orang-orang musyrik yang kalian telah mengadakan perjanjian dengan mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-2. “Inilah pernyataan pemutusan hubungan dari Allah dan RasulNya yang di hadapkan”, kepada seluruh orang-orang musyrik yang berada dalam perjanjian damai, bahwa mereka memiliki empat bulan untuk berkeliling dunia sesuka mereka dalam keadaan aman dari orang-orang Mukmin, dan setelah empat bulan tersebut tidak ada lagi perjanjian dan jaminan. Ini berlaku bagi mereka yang dalam perjanjian mutlak, tidak terbatas atau terbatas, dengan empat bulan atau kurang, adapun yang mempunyi perjanjian lebih dari empat bulan, maka wajib disempurnakan sampai akhir, jika tidak dikhawatirkan pengkhianatannya, dan mereka tidak memulai membatalkan penjanjian. Kemudian Allah memperingatkan orang-orang musyrik yang berada di dalam perjanjian, bahwa meskipun mereka aman, mereka tidak dapat melemahkan Allah dan mengelahanNya, barangsiapa diantara mereka yang terus berpegang dengan kesyirikan, maka Allah pasti akan menghinakannya. Hal ini termasuk pendorong bagi mereka untuk masuk Islam, kecuali orang-orang yang menyombongkan diri, dan menetang dan mengabaikan ancaman Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 1: Sebelum turunnya ayat ini ada perjanjian damai antara Nabi Muhammad shallallahu 'alaihi wa sallam dengan orang-orang musyrik. Di antara isi perjanjian itu adalah tidak ada peperangan antara Nabi Muhammad shallallahu 'alaihi wa sallam dengan orang-orang musyrik, dan bahwa kaum muslimin dibolehkan berhaji ke Makkah dan tawaf di Ka'bah. Kemudian Allah Subhaanahu wa Ta'aala membatalkan perjanjian itu dan mengizinkan kepada kaum muslimin memerangi kembali karena mereka melanggar perjanjian selain Bani Dhamurah dan Bani Kinanah. Turunlah ayat ini, dan kaum musyrik diberikan kesempatan selama empat bulan untuk berjalan di bumi sesuai yang mereka inginkan dalam keadaan aman. Para mufassir berkata, “Ketika Rasulullah shallallahu 'alaihi wa sallam keluar ke Tabuk, kaum munafik menyebarkan berita-berita yang menakutkan, sedangkan kaum musyrik membatalkan perjanjian yang terjadi antara mereka dengan Rasulullah shallallahu 'alaihi wa sallam, maka Allah Azza wa Jalla memerintahkan untuk membatalkan perjanjian mereka, yaitu dengan firman-Nya, “Wa imam takhaafanna min qaumin khiyaanah…dst.” (Al Anfaal: 58). Az Zajjaj berkata, “Baraa’ah, maksudnya Alah Ta’ala dan Rasul-Nya berlepas diri dari memberikan kepada mereka perjanjian dan dari memenuhinya jika mereka melanggarnya.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 1",
    "description": "Rasulullah telah melakukan beberapa perjanjian dengan kaum musyrik mekah, antara lain perjanjian agar kaum muslim tidak dihalangi untuk melaksanakan umrah, perjanjian untuk tidak melakukan perang di bulan-bulan haram (bulan-bulan mulia), dan perjanjian-perjanjian damai dengan kabilah-kabilah arab sampai waktu tertentu. Namun, pada akhirnya mereka merusak perjanjian tersebut. Maka, dengan turunnya surah at-taubah atau bara'ah ini, kaum muslim diperintahkan untuk tidak melakukan hubungan lagi dengan mereka. Karena itu, inilah pernyataan pemutusan hubungan dari Allah dan rasul-Nya kepada orang-orang musyrik yang kamu telah mengadakan perjanjian dengan mereka, namun mereka merusak perjanjian tersebut. 2namun begitu, mereka tetap diberi waktu untuk memikirkan kembali apakah memilih untuk masuk islam dengan memegang perjanjian bersama, atau berperang. Di samping itu, penundaan tersebut agar mereka bisa mempersiapkan diri, seandainya harus memilih untuk berperang, sehingga perang berjalan secara adil. Maka di saat gencatan senjata tersebut, berjalanlah kalian, wahai kaum musyrik, di bumi mekah, selama empat bulan yaitu mulai 10 zulhijah sampai dengan 10 rabi'ul akhir, dengan leluasa dan tanpa takut diserang oleh kaum muslimin, sebagaimana keadaan kalian sebelum pemutusan hubungan ini. Dan setelah lewat empat bulan, maka ketahuilah bahwa kalian tidak dapat melemahkan Allah, meski didukung oleh personil tentara dan persenjataan yang lengkap; dan dengan kekalahan tersebut serta menjadi ta-wanan sesungguhnya Allah hendak menghinakan orang-orang kafir di dunia. Bahkan, di akhirat kelak, jika tidak bertobat, kalian merasakan siksa yang pedih (lihat: surah az-zumar/39: 25-26). Ini sikap toleransi islam, pada satu sisi, dan menunjukkan keperkasaan islam, pada sisi yang lain. Demikian ini, agar tidak muncul tuduhan bahwa kaum mus-lim sengaja menyerang mereka secara tiba-tiba tanpa memberi kesem-patan berpikir atau mempersiapkan diri."
  }
]