[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang musyrik adalah musuh yang memerangi keimanan dan orang-orang yang menganutnya. Mereka tidak melakukan pertimbangan sama sekali terhadap hubungan kekerabatan dengan seorang mukminin dan perjanjiannya. Dan sikap mereka adalah memusuhi dan bertindak zhalim."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Mereka tidak mengacuhkan Allah, hubungan kekerabatan, dan perjanjian apa pun dalam memperlakukan orang mukmin. Karena mereka menyimpan rasa permusuhan kepadanya. Maka mereka melanggar batas-batas Allah, karena mereka adalah orang-orang yang zalim dan melampaui batas."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "10. Akibat kekafiran ini, mereka akan membunuh seorang mukmin jika mampu, tanpa mempedulikan hubungan kekerabatan yang seharusnya mereka jaga, dan tanpa mempedulikan perjanjian yang harus mereka tegakkan. Mereka adalah orang-orang yang jauh dari kebenaran dan sangat berbuat zalim."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. لَا يَرْقُبُونَ فِى مُؤْمِنٍ إِلًّا وَلَا ذِمَّةً ۚ (Mereka tidak memelihara (hubungan) kerabat terhadap orang-orang mukmin dan tidak (pula mengindahkan) perjanjian) Yakni mereka tidak memiliki kepedulian terhadap hak-hak orang-orang beriman baik itu hak karena hubungan kekerabatan maupun karena perjanjian yang mereka buat. وَأُو۟لٰٓئِكَ هُمُ الْمُعْتَدُونَ(Dan mereka itulah orang-orang yang melampaui batas) Yakni yang menyebrang dari yang halal menuju kepada yang haram dengan melanggar perjanjian. Atau maknanya adalah orang yang berlebihan sekali dalam melakukan kejahatan dan kedurhakaan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10 Mereka tidak memelihara hak-hak orang mukmin, juga tidak menjaga hubungan kerabat terhadap orang-orang mukmin dan tidak pula menepatiperjanjian. Dan mereka itulah orang-orang yang melampaui batas dan yang pertama mengadakan perjanjian. Ayat ini bukan pengulangan sebab ayat sebelumnya adalah untuk orang semua musyrik, adapun ayat ini khusus untuk Yahudi"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka tidak memelihara kekerabatan} tidak memelihara {dengan orang mukmin dan tidak pula perjanjian. Mereka itulah orang-orang yang melampaui batas} melampaui batas ketentuan Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "10. “mereka tidak memelihara hubungan kekerabatan terhadap orang-orang Mukmin dan tidak pula mengindahkan perjanjian.” Yakni karena permusuhan mereka terhadap keimanan dan orang-orang yang beriman. Pemicu yang membuat mereka membencimu dan memusuhimu adalah karena iman."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 10: Karena permusuhan mereka kepada keimanan dan orang-orangnya. Sebab yang menjadikan mereka memusuhi dan membencimu adalah iman, oleh karena itu bela agamamu dan tolonglah serta jadikanlah orang yang memusuhi iman sebagai musuhmu dan orang yang membela iman sebagai kawanmu, bersikaplah dengan memperhatikan ada iman atau tidak, dan jangan kamu jadikan cinta kasih dan permusuhan atas dasar hawa nafsu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 10",
    "description": "Mereka bukan saja memperjualbelikan ayat-ayat Allah, menghalanghalangi orang lain dari jalan Allah, bahkan mereka juga tidak memelihara hubungan kekerabatan dengan orang mukmin dan tidak pula mengindahkan perjanjian. Sikap mereka itulah bisa dianggap sebagai sikap orangorang yang melampaui batas. Namun, jika mereka bertobat dari perbuatan-perbuatan dosanya dan meninggalkan kekufuran dan kemusyrikan lalu masuk ke dalam islam, serta secara konsisten melaksanakan ajaran-ajaran islam dengan melaksanakan salat dan menunaikan zakat, maka berarti mereka itu adalah saudara-saudaramu seagama yang memiliki hak dan kewajiban yang sama untuk saling melindungi dan menyayangi. Kami menjelaskan ayat-ayat itu yang menjadi bukti wujud dan keesaan Allah bagi orangorang yang mengetahui, yakni mereka yang mau mengambil manfaat atas bukti-bukti tersebut. Melihat konteksnya, rangkaian ayat di atas berkenaan dengan perilaku buruk yahudi bani quraidhah. Meski begitu, ayat-ayat tersebut telah memberi ciri-ciri kefasikan yang sangat dibenci Allah, yaitu merusak atau mengkhianati perjanjian, tidak jujur, dan memutuskan hubungan kekerabatan."
  }
]