[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang yang mendahului orang-orang sejak pertama menuju keimanan kepada Allah dan rasulNya dari kalangan muhajirin yang berhijrah meninggalkan kaum mereka dan kerabat mereka, dan mereka berpindah menuju negeri islam, dan kaum anshar yang menolong rasulullah atas musuh-musuhnya dari orang-orang kafir, dan orang-orang yang mengikuti mereka dengan baik dalam keyakinan, ucapan-ucapan mereka dan perbuatan-perbuatan dalam rangka mencari keridhaan Allah . mereka itulah orang-orang yang Allah meridhai mereka karena ketaatan mereka kepada Allah dan rasulNya, dan mereka ridha kepada Allah karena Dia melimpahkan pada mereka pahala atas ketaatan mereka dan keimanan mereka, dan menyiapkan bagi mereka surga-surga yang mengalir di bawah istana-istana dan pohon-pohonnya sungai-sungai, mereka kekal di dalamya selamanya. Itulah keberuntungan yang besar. Di dalam ayat ini terdapat tazkiyah bagi para sahabat  , kredibilitas tinggi dan pujian bagi mereka. Oleh karena itu, penghormatan terhadap mereka termasuk di antara pokok-pokok iman."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "100. Orang-orang yang lebih dahulu beriman, baik dari kalangan kaum Muhajirin yang berhijrah meninggalkan rumah dan kampung halaman mereka menuju kepada Allah, maupun dari kalangan kaum Ansar yang menolong nabi-Nya -ṣallallāhu 'alaihi wa sallam-, dan orang-orang yang mengikuti jejak kaum Muhajirin dan Ansar yang beriman dengan baik dalam hal keyakinan, ucapan dan perbuatan, mereka telah Allah ridai dan Allah terima ketaatan mereka. Dan mereka pun rida kepada-Nya tatkala Dia memberi mereka ganjaran yang sangat besar dan menyiapkan surga-surga yang di bawah istana-istananya mengalir sungai-sungai untuk mereka tempati selama-lamanya. Balasan itu adalah keberuntungan yang sangat besar."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "100. Dan para sahabat yang pertama-tama beriman kepada Allah dan rasul-Nya, berhijrah ke negeri Islam, menolong saudara dan agama mereka, dan menjalani hidup mereka dengan perkataan dan perbuatan yang baik; maka Allah meridhai mereka atas amalan yang mereka lakukan, dan mereka meridhai Allah atas pahala besar yang diberikan kepada mereka. Allah telah menyiapkan bagi mereka surga-surga yang di dalamnya terdapat sungai-sungai yang mengalir di bawah istana-istana; mereka kekal di dalamnya. Kedudukan yang mulia itu merupakan karunia yang besar."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "100. وَالسّٰبِقُونَ الْأَوَّلُونَ مِنَ الْمُهٰجِرِينَ وَالْأَنصَارِ (Orang-orang yang terdahulu lagi yang pertama-tama (masuk Islam) dari golongan muhajirin dan anshar) Ini merupakan kesaksian dari Allah bagi orang-orang yang pertama-tama masuk islam dari kalangan sahabat Nabi, dan kabar gembira bagi mereka berupa surga dan kemenangan di akhirat. Dan ini juga merupakan kabar gembira bagi orang yang manempuh jalan mereka dan menjadikan mereka sebagai panutan dan teladan. orang-orang yang pertama-tama masuk islam adalah mereka yang mendapati sholat menghadap masjidil aqsha dan masjidil haram. Atau orang-orang yang ikut dalam baiat Ridhwan di Hudaibiyah. Keutamaan bagi orang-orang yang pertama-tama masuk islam ini karena keimanan mereka serta infak yang mereka lakukan sebelum kejayaan Islam. وَالَّذِينَ اتَّبَعُوهُم بِإِحْسٰنٍ(dan orang-orang yang mengikuti mereka dengan baik) Yakni orang-orang yang meneladani orang-orang yang pertama-tama masuk islam dari kaum Muhajirin dan Anshar. Mereka adalah generasi setelah para sahabat dan generasi-generasi setelahnya sampai hari kiamat apabila meneladani mereka dengan baik dalam perbuatan dan ucapan. رَّضِىَ اللهُ عَنْهُمْ(Allah ridha kepada mereka) Sehingga Allah menerima amal ketaatan mereka dan mengampuni kesalahan mereka serta tidak murka terhadap mereka. وَرَضُوا۟ عَنْهُ(dan merekapun ridha kepada Allah) Atas karunia Allah yang telah Dia berikan kepada mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "100. Orang-orang yang lebih dulu beriman, berhijrah, menolong dan berinfak yaitu sahabat Muhajirin, Anshar dan para pengikut mereka dalam keimanan dan memberi pertolongan dalam agama dan ketaatan. Allah suka dengan amal mereka dan tidak marah kepada mereka, begitu juga mereka ridha kepada Allah dengan apa yang dilimpahkan kepada mereka berupa nikmat, keutamaan. Dia (Allah) menyiapkan bagi mereka, surga yang mengalir sungai-sungai di bawah kebun-kebun dan ruang-ruangannya. Mereka menetap di dalamnya selama-lamanya. Keridhaan itu adalah kemenangan agung yang tidak dapat ditandingi kemenangan lain. Ini adalah pernyataan dan kabar gembira tentang surga dari Allah bagi para sahabat dan Tabi’in"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang terdahulu dan yang pertama di antara kaum Muhajirin, kaum Anshar dan orang-orang yang mengikuti mereka dengan baik, Allah meridhai mereka dan mereka pun ridha kepadaNya. Allah menyediakan bagi mereka surga-surga yang mengalir sungai-sungai di bawahnya. Mereka kekal di dalamnya selama-lamanya. Itulah kemenangan yang agung"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "100. As-Sabiqun adalah orang-orang yang mendahului umat ini kepada iman, hijrah, jihad, dan menegakkan Agama Allah, “di antara orang-orang Muhajirin”, \"(Juga) bagi orang fakir yang berhijrah yang diusir dari kampung halaman dan dari harta benda mereka (karena) mencari karunia dari Allah dan keridhaan-Nya dan mereka menolong Allah dan Rasul-Nya. Mereka itulah orang-orang yang benar.\"(Al-Hasyr:8). “dan orang-orang Anshar”, \"Dan orang-orang yang telah menempati kota Madinah dan telah beriman (Anshor) sebelum (kedatangan) mereka (Muhajirin), mereka (Anshor) 'mencintai' orang yang berhijrah kepada mereka (Muhajirin). Dan mereka (Anshor) tiada menaruh keinginan dalam hati mereka terhadap apa-apa yang diberikan kepada mereka (Muhajirin); dan mereka mengutamakan (orang-orang Muhajirin), atas diri mereka sendiri, sekalipun mereka dalam kesusahan. Dan siapa yang dipelihara dari kekikiran dirinya, mereka itulah orang orang yang beruntung\". (Al-Hasyr:9). “Dan orang-orang yang mengikuti mereka dengan baik”, dalam akidah, perkataan, dan perbuatan. Mereka itulah yang selamat dari celaan, mendapatkan pujian yang tinggi, dan kemuliaan terbaik dari Allah. “Allah ridha kepada mereka.” Dan ridha Allah lebih besar daripada nikmat Surga. “Dan mereka pun ridha kepada Allah dan Allah menyediiakan bagi mereka Surga-surga yang mengalir sungai-sungai di dalamnya,” yang mengalir ke pangkal-pangkal pohon dan kebun yang elok lagi indah dan tanaman yang mempesona. “Mereka kekal di dalamnya selama-lamanya.” Mereka tidak ingin berpindah darinya, dan tidak mencari penggantinya, karena apa pun yang mereka inginkan akan mereka dapatkan dan apa yang mereka harapkan pasti terlaksana. “Itulah kemenangan yang besar,” yang padanya terwujud bagi mereka semua yang disukai oleh jiwa, yang dinikmati oleh ruh, yang diinginkan oleh hati dan yang dihasrati oleh jasmani serta tertolak dari mereka segala yang tidak diinginkan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 100: Mereka adalah orang-orang yang lebih dulu dan bersegera beriman, berhijrah dan berjihad, serta menegakkan agama Allah. Ada yang mengatakan, bahwa mereka ini adalah para sahabat yang hadir dalam perang Badar, atau bisa maksudnya semua para sahabat. Yaitu para sahabat yang berhijrah dari Mekah ke Madinah; yang diusir dari kampung halaman dan dari harta benda mereka (karena) mencari karunia dari Allah dan keridhaan-Nya, dan mereka menolong agama Allah dan Rasul-Nya. Yaitu para sahabat yang menempati kota Madinah dan telah beriman sebelum (kedatangan) kaum muhajirin. Mereka mencintai kaum muhajirin dan lebih mengutamakan kaum muhajirin di atas diri mereka sendiri, meskipun mereka dalam kesusahan. Mereka mengikuti ‘Aqidah, ibadah, manhaj (cara beragama) kaum muhajirin dan Anshar. Yakni dengan memperbaiki amalan. di mana mereka berdoa, \"Ya Tuhan Kami, beri ampunlah kami dan saudara-saudara kami yang telah beriman lebih dulu dari kami, dan janganlah Engkau membiarkan kedengkian ada dalam hati Kami terhadap orang-orang yang beriman. Ya Tuhan kami, Sesungguhnya Engkau Maha Penyantun lagi Maha Penyayang.\" (lihat pula Al Hasyr: 8-10) Dan tidak ada keinginan di hati mereka untuk pindah, karena apa yang mereka inginkan ada dan apa yang mereka harapkan telah tersedia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 100",
    "description": "Ayat sebelumnya menjelaskan bahwa orang arab badui ada yang imannya lemah dan ada yang kuat, lalu Allah menjelaskan sekelompok orang yang imannya sangat kuat. Mereka adalah orang-orang yang terdahulu berhasil meraih dan melaksanakan kebajikan sebelum yang lainnya melaksanakan, lagi yang pertama-tama masuk islam di antara orang-orang muhajirin dari mekah ke habasyah (ethiopia) dan ke madinah, dan kaum ansar, yakni penduduk madinah yang menerima dan membela umat islam, dan orang-orang yang mengikuti mereka dengan baik dengan iman dan amal saleh serta mau berkorban untuk membela Allah dan rasul-Nya. Allah rida kepada mereka, yakni menerima amal saleh mereka dan mereka pun rida kepada Allah atas anugerah iman yang memenuhi hati mereka. Anugerah yang lebih besar lagi adalah Allah menyediakan bagi mereka surga-surga yang mengalir di bawahnya sungaisungai. Mereka kekal di dalamnya selama-lamanya. Itulah kemenangan yang agung. (lihat: surah al-wa'qi'ah/56: 10-14) dan di antara orang-orang arab badui yang tinggal di sekitarmu, ada orang-orang munafik. Dan di antara penduduk madinah (yahudi) ada juga orang-orang munafik, mereka sudah terbiasa licik dan berdusta, sehingga keterlaluan dan melampaui batas dalam kemunafikannya. Engkau wahai nabi Muhammad tidak mengetahui siapa mereka, karena begitu lihainya dan terlatihnya mereka dengan kemunafikan, tetapi kami mengetahuinya. Nanti mereka akan kami siksa dua kali, pertama: ketika terbongkarnya kemunafikan mereka, sehingga mereka malu dan terhina, dan kedua: ketika malaikat mencabut nyawa mereka dengan cara yang sangat kasar, (lihat: surah al-anfa'l/8: 50), kemudian mereka akan dikembalikan kepada azab yang besar kelak di akhirat."
  }
]