[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan diantara kaum yang hidup di sekitar Madinah ada orang-orang Arab badui yang munafik. Dan diantara penduduk Madinah ada orang-orang munafik yang hidup diatas kemunafikan. Dan mereka bertambah menjadi-jadi dalam kedurhakaan, lantaran seluk beluk mereka tersembunyi bagimu (wahai rasul).Kami mengetahui mereka, maka kami akan menyiksa mereka dua kali dengan dibunuh, ditawan dan dibongkar kedok mereka di dunia dan dengan siksaan kubur setelah kematian. Kemudian mereka akan dikembalikan pada hari kiamat menuju siksaan besar di nerka jahanam."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "101. Ada di antara orang-orang badui yang tinggal di sekitar Madinah ada orang-orang munafik, dan di antara penduduk Madinah ada orang-orang munafik yang gigih mempertahankan kemunafikan mereka. Kamu tidak mengetahui perihal mereka, wahai Rasul. Allah lah yang mengetahui perihal mereka. Allah akan menimpakan azab kepada mereka sebanyak dua kali. Pertama, Allah akan menimpakan azab-Nya di dunia dengan mengungkap kemunafikan mereka, membunuh mereka, dan menjadikan mereka sebagai tawanan perang. Kedua, Allah akan menimpakan azab kepada mereka di Akhirat dalam bentuk azab kubur. Kemudian pada hari Kiamat kelak mereka akan dikembalikan kepada azab yang sangat besar di dalam kerak Neraka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "101. Dan sebagian orang baduwi yang ada di sekitar Madinah adalah orang-orang munafik, demikian juga sebagian penduduk Madinah tetap dalam kemunafikan. Kamu tidak mengetahui mereka hai Rasulullah, karena mereka sangat pandai dalam menyembunyikan kemunafikan. Dan dengan keagungan dan kekuasaan Kami, Kami mengetahui mereka. Kami akan menazab mereka dua kali; di dunia dengan terbunuh di medan perang atau tertawan, dan ketika mereka mati dengan azab kubur, kemudian pada hari kiamat mereka akan dikumpulkan di neraka Jahannam dengan azab yang sangat pedih."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "101. وَمِمَّنْ حَوْلَكُم مِّنَ الْأَعْرَابِ مُنٰفِقُونَ ۖ (Di antara orang-orang Arab Badwi yang di sekelilingmu itu, ada orang-orang munafik) Mereka adalah orang-orang munafik yang tinggal di sekitar kota Madinah. وَمِنْ أَهْلِ الْمَدِينَةِ ۖ( dan (juga) di antara penduduk Madinah) Yakni orang-orang munafik yang tinggal di Madinah. مَرَدُوا۟ عَلَى النِّفَاقِ(Mereka keterlaluan dalam kemunafikannya) Yakni yang berlarut-larut dalam kemunafikan bahkan mereka menjadi sangat cerdik dalam melakukan kemunafikannya sehingga perbuatan mereka menjadi samar dan susah diketahui oleh Rasulullah, terlebih lagi oleh orang-orang beriman lainnya. لَا تَعْلَمُهُمْ ۖ نَحْنُ نَعْلَمُهُمْ ۚ (Kamu (Muhammad) tidak mengetahui mereka, (tetapi) Kamilah yang mengetahui mereka) Yakni kamu tidak mengetahui mereka secara personal karena mereka sangat cerdik dalam menyembunyikan kemunafikan mereka sehingga sangat susah diketahui oleh manusia dan tidak tampak kecuali oleh Allah. سَنُعَذِّبُهُم مَّرَّتَيْنِ (Nanti mereka akan Kami siksa dua kali) Yakni dengan terbongkarnya kemunafikan mereka serta azab yang ditimpakan kepada mereka di akhirat. Pendapat lain mengatakan yang dimaksud dengan dua kali adalah dengan musibah-musibah yang menimpa diri, harta, dan ana-anak mereka; serta azab kubur. ثُمَّ يُرَدُّونَ إِلَىٰ عَذَابٍ عَظِيمٍ (kemudian mereka akan dikembalikan kepada azab yang besar) Yakni ke neraka yang paling dalam, sebagaimana disebutkan dalam surat an-Nisa: 145."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "101. Dan sebagian orang Baduwi di sekitar Madinah itu munafik (mereka menampakkan keislaman dan menyembunyikan kekufuran) Seperti itulah sebagian penduduk Madinah yang mempraktekkan kemunafikan, sehingga perkara mereka disembunyikan dari Nabi SAW. Kamu tidak mengetahui kemahiran mereka dalam kemunafikan wahai Nabi. Kami akan memberitahu dan menyadarkanmu tentang mereka. Kami juga akan mengazab mereka dengan azab yang berlipat ganda berupa aib, ditampakkan kemunafikannya dan musibah yang bertumpuk-tumpuk serta akan dihukum ketika mati dalam kubur. Kemudian di akhirat mereka akan dikembalikan kepada azab yang dahsyat yaitu azab neraka di lantai paling bawah. Ayat ini turun terkait Abdullah bin Ubay, Jaddun bin Qays, Mu’attib bin Qusyair, Al-Jallas bin Suwaid, dan Abi Amir Ar-Rahib dari kabilah Juhainah, Muzainah, Asyja’, Aslam, Ghafar yang merupakan penduduk Madinah dan sekitarnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Di antara orang-orang Arab Badui yang di sekitar kalian ada orang-orang munafik. Di antara penduduk Madinah juga, mereka keterlaluan dalam kemunafikan} mereka melampaui batas dan menetap dalam kemunafikan {Kamu tidak mengetahui mereka, tetapi Kami mengetahuinya. Kami akan menyiksa mereka dua kali} satu kali di dunia dan satu kali di alam kubur {kemudian mereka akan dikembalikan kepada azab yang besar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "101. Allah berfirman, “Di antara orang-orang Arab Badui yang di sekelilingmu itu, ada orang-orang munafik, dan (juga) di antara penduduk Madinah”, juga terdapat orang-orang munafik. “Mereka keterlaluan dalam kemunafikannya.” Yakni, mereka terbiasa di atasnya (terus menerus) dan bertambah kuat kemunafikannya. “Kamu (Muhammad) tidak mengetahui mereka”, yaitu nama-nama mereka sehingga kamu bisa menghukum mereka atau kamu memperlakukan mereka sesuai dengan kemunafikannya, karena dalam hal itu Allah mempunyai hikmah yang mengagumkan. “(Tetapi) Kami-lah yang mengetahui mereka. Nanti mereka akan Kami siksa dua kali.” Ada kemungkinan dua kali itu adalah dua kali yang sebenarnya yaitu di dunia dan di akhirat. Di dunia dalam bentuk kecemasan, kesedihan, dan kebencian terhadap kemenangan dan keunggulan yang diraih oleh orang-orang Mukmin, dan di akhirat adalah azab neraka yang merupakan tempat terburuk. Ada kemungkinan bahwa maksudnya adalah Kami akan memberatkan azab atas mereka, melipatgandakannya dan mengulang-ulangnya atas mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 101: Maksudnya adalah orang-orang badui yang tingal di sekitar Madinah. Sehingga tidak bisa menyikapi mereka sesuai kemunafikannya, dan Allah memiliki hikmah yang besar dalam hal tersebut. Seperti dengan tertimpa kesedihan, duka cita dan dongkolnya hati ketika kemenangan diraih kaum mukmin, atau diazab ketika di kubur. Kata-kata “dua kali” ini bisa juga maksudnya bahwa Allah akan memperkeras siksa-Nya, melipatgandakannya dan mengulang-ulanginya. Di akhirat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 101",
    "description": "Dan di antara orang-orang arab badui yang tinggal di sekitarmu, ada orang-orang munafik. Dan di antara penduduk madinah (yahudi) ada juga orang-orang munafik, mereka sudah terbiasa licik dan berdusta, sehingga keterlaluan dan melampaui batas dalam kemunafikannya. Engkau wahai nabi Muhammad tidak mengetahui siapa mereka, karena begitu lihainya dan terlatihnya mereka dengan kemunafikan, tetapi kami mengetahuinya. Nanti mereka akan kami siksa dua kali, pertama: ketika terbongkarnya kemunafikan mereka, sehingga mereka malu dan terhina, dan kedua: ketika malaikat mencabut nyawa mereka dengan cara yang sangat kasar, (lihat: surah al-anfa'l/8: 50), kemudian mereka akan dikembalikan kepada azab yang besar kelak di akhirat. Dan ada pula orang lain yang berada di sekeliling kamu yang mengakui dosa-dosa mereka lalu bertobat atas dosa-dosa itu, tetapi mereka masih mencampuradukkan pekerjaan yang baik dengan pekerjaan lain yang buruk, dengan mereka taat dan beramal saleh dan pada waktu yang berbeda mereka masih berbuat jahat dan maksiat. Mudah-Mudahan Allah menerima tobat mereka jika mereka bertobat dengan sungguh-sungguh. Sesungguhnya Allah maha pengampun atas segala dosa, maha penyayang kepada orang yang berusaha tidak mengulangi kesalahannya."
  }
]