[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ada orang-orang yang lain dari penduduk Madinah dan penduduk sekitarnya yang mengakui dosa-dosa mereka dan menyesalinya, serta telah bertaubat darinya, mereka mencampuradukan amal shalih (berupa taubat, menyesal,mengakui dosa dan yang lainnya dari amal-amal sholeh) dengan perbuatan buruk lainnya, (yaitu tidak turut serta berangkat perang bersama rasulullah dan mengajarkan perbuatan buruk lainnya), mudah-mudahan Allah memberikan taufik kepada mereka untuk bertaubat dan menerimanya dari mereka. Sesungguhnya Allah maha pengampun bagi hamba-hambaNYa lagi mahapenyayang terhadap mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "102. Ada di antara penduduk Madinah, kaum lain yang tidak pergi ke medan perang tanpa alasan yang dibenarkan, kemudian mereka mengakui bahwa mereka tidak mempunyai alasan apa pun, dan mereka tidak mengemukakan alasan-alasan palsu. Mereka mencampur amal saleh di masa lalu seperti taat kepada Allah, memegang teguh syariat-Nya, dan berjihad di jalan-Nya dengan amal buruk. Mereka berharap Allah akan menerima tobat mereka dan memaafkan kesalahan mereka. Sesungguhnya Allah Maha Pengampun lagi Maha Penyayang bagi hamba-hamba-Nya yang bertobat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "102. Dan sekelompok penduduk Madinah dan sekitarnya mengakui dosa mereka dan bertaubat darinya; mereka mencampur antara amal baik berupa mengikuti jihad bersama Rasulullah, dengan amal buruk berupa tidak mengikuti perang Tabuk. Allah akan mengampuni mereka; Dia Maha Pengampun bagi hamba-hamba-Nya yang bertaubat, dan Maha Mengasihi mereka dengan menerima taubat mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "102. وَءَاخَرُونَ اعْتَرَفُوا۟ بِذُنُوبِهِمْ (Dan (ada pula) orang-orang lain yang mengakui dosa-dosa mereka) Yakni dan sebagian dari penduduk kota Madinah terdapat golongan lain, yaitu orang-orang yang tidak mengikuti perang tanpa uzur yang dibenarkan namun mereka kemudian menyesal telah melakukan itu dan mengakui bahwa mereka sebenarnya tidak memiliki uzur untuk tidak ikut perang, dan mereka tidak menajukan alasan-alasan bohong, bahkan mereka mengikat diri mereka pada tiang-tiang masjid dan bersumpah untuk tidak ada yang membuka ikatannya kecuali Rasulullah. خَلَطُوا۟ عَمَلًا صٰلِحًا(mereka mencampurbaurkan pekerjaan yang baik) Yakni perbuatan yang telah mereka kerjakan berupa menjalankan syariat-syariat islam dan pergi berjihad di peperangan yang lain. Yang dimaksud dengan pekerjaan yang buruk adalah ketidak ikutsertaan mereka dalam perang Tabuk. Namun mereka telah mengganti perbuatan buruk ini dengan melakukan perbuatan baik, yaitu dengan mengakui kesalahan dan bertaubat. عَسَى اللهُ أَن يَتُوبَ عَلَيْهِمْ ۚ (Mudah-mudahan Allah menerima taubat mereka) Ini merupakan harapan bagi orang-orang yang jujur dalam taubatnya, berupa penerimaan taubat mereka. إِنَّ اللهَ غَفُورٌ رَّحِيمٌ(Sesungguhnya Allah Maha Pengampun lagi maha Penyayang) Yakni mengampuni dosa-dosa dan memberi kemurahan kepada para hamba-Nya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Ditanyakan kepada Abu 'Utsman al-hindy (seorang tabi'in senior) : ayat apa dalam al-qur'an yang paling kamu harapkan ? beliau kemudian menjawab : firman Allah : { وَآخَرُونَ اعْتَرَفُوا بِذُنُوبِهِمْ خَلَطُوا عَمَلًا صَالِحًا وَآخَرَ سَيِّئًا عَسَى اللَّهُ أَنْ يَتُوبَ عَلَيْهِمْ ۚ إِنَّ اللَّهَ غَفُورٌ رَحِيمٌ } \"Dan (ada pula) orang-orang lain yang mengakui dosa-dosa mereka, mereka mencampurbaurkan pekerjaan yang baik dengan pekerjaan lain yang buruk. Mudah-mudahan Allah menerima taubat mereka. Sesungguhnya Allah Maha Pengampun lagi maha Penyayang\". 2 ). Apakah hatimu terasa sempit? atau kah syaithon telah menjadikanmu berputus asa dari rahmat Allah? Tadabburilah ayat ini : { وَآخَرُونَ اعْتَرَفُوا بِذُنُوبِهِمْ خَلَطُوا عَمَلًا صَالِحًا وَآخَرَ سَيِّئًا عَسَى اللَّهُ أَنْ يَتُوبَ عَلَيْهِمْ ۚ إِنَّ اللَّهَ غَفُورٌ رَحِيمٌ } Tidaklah ketakutan datang kepada seorang hamba, melainkan karena kemaksiatan dan dosa yang ia tekuni tanpa ada penyesalan terhadap apa yang telah berlaku pada dirinya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "102. Dan kelompok lain penduduk Madinah itu mundur untuk berjihad tanpa uzur dan mengakui kemaksiatan mereka dan mencampur amal shalih mereka, yaitu mengerjakan syariat Islam bersama amal buruk. Yaitu mundur dari perang Tabuk. Kemudian mereka bertaubat dari perbuatan ini, barangkali Allah menerima taubat mereka. Maka mereka itu dimaafkan Allah. Sesungguhnya Allah itu Maha Pengampun bagi orang yang bertaubat dan Maha Penyayang bagi orang yang berbuat baik dan menyerahkan diri. Ayat ini turun terkait Abu Lubabah dan 5 orang yang bersamanya. Mereka mengikatkan diri pada tiang-tiang masjid sampai rasulullah melepaskan dan memaafkan mereka, Lalu Allah SWT menurunkan ayat ini, lalu Nabi SAW melepaskan dan memaafkan mereka. Mereka berkata: “Wahai Rasulallah, inilah harta-harta kami, percayalah kepada kami dan mohonkanlah ampun untuk kami.” Lalu Nabi berkata: “Aku tidak diperintahkan untuk mengambil harta kalian sedikitpun.” Lalu Allah SWT menurunkan ayat {Khudz min Amwaalihim Shadaqatan} ayat selanjutnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan Orang-orang lain} dan di antara penduduk Madinah ada suatu kaum {yang mengakui} mengakui {dosa-dosa mereka. Mereka mencampur adukkan} mencampur {amal yang baik dengan amal lain yang buruk. Mudah-mudahan Allah menerima taubatnya. Sesungguhnya Allah Maha Pengampun lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "102. Allah berfirman, “Dan (ada pula) orang-orang lain”, yang di Madinah dan sekitarnya bahkan di negeri-negeri Islam yang lain “yang mengakui dosa-dosa mereka.” Yakni, mereka mengakuinya, menyesalinya, berusaha bertaubat darinya dan menyucikan dari kotorannya. “Mereka mencampur-baurkan pekerjaan yang baik dengan pekerjaan lain yang buruk.” Dan suatu amal bukanlah amal shalih kecuali jika seorang hamba mempunyai dasar tauhid dan iman yang mengeluarkan dari kekufuran dan kesyirikan yang merupakan syarat bagi seluruh amal shalih, mereka mencampuradukkan antara amal yang baik dengan amal yang buruk dalam bentuk keberaniannya melakukan sebagian yang diharamkan dan kelalaian melakukan sebagian kewajiban. Namun bersamaan dengan itu mereka mengakui itu dan berharap Allah mengampuninya. Mereka itu “mudah-mudahan Allah menerima taubat mereka.” Taubat Allah kepada hambaNya ada dua: pertama, memberi taufik kepada mereka untuk taubat, kedua, menerimanya setelah taubat itu dilakukan mereka. “Sesungguhnya Allah Maha Pengampun lagi Maha Penyayang”, yakni sifatNya adalah maghfirah dan rahmat di mana tidak ada makhluk yang terlepas darinya, bahkan tidak ada keberadaan alam langit dan bumi kecuali dengan keduanya. Seandainya Allah menyiksa manusia karena kezhaliman mereka, niscaya Dia tidak membiarkan satu pun binatang melata di muka bumi ini. \"Sesungguhnya Allah menahan langit dan bumi supaya jangan lenyap; dan sungguh jika keduanya akan lenyap tidak ada seorangpun yang dapat menahan keduanya selain Allah. Sesungguhnya Dia adalah Maha Penyantun lagi Maha Pengampun.\" (Fathir: 41). Di antara ampunanNya adalah bahwa orang-orang yang bersikap berlebihan-lebihan terhadap diri mereka, yang menghabiskan umur mereka dengan amal-amal buruk, jika mereka bertaubat dan kembali kepadaNya meski hanya sesaat sebelum mati, maka Allah akan memaafkan mereka dan mengampuni kesalahan mereka. Ayat ini menunjukkan bahwa orang yang mencampuradukkan antara keburukan dengan kebaikan, yang mengakui dan menyesali dosa-dosanya namun tidak bertaubat dengan taubat yang nasuha, maka dia berada di antara ketakutan dan harapan, dan dia lebih dekat kepada keselamatan. Adapun orang yang mencampuradukkan antara kebaikan dan keburukan yang tidak mengakui dan tidak menyesali kesalahan-kesalahan yang telah dilakukan, bahkan dia masih terus melakukan dosanya, maka sangat dikhawatirkan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 102: Mengakui, menyesali, berusaha untuk bertobat dan membersihkan diri dari noda-noda dosa dan maksiat. Seperti tidak ikut berperang, dsb. Seperti jihad mereka sebelum itu atau pengakuan mereka terhadap dosa, dsb. Yaitu tidak ikut berperang. Mereka mengerjakan yang baik dan yang buruk, berani berbuat maksiat dan lalai terhadap kewajiban, namun mengakui kesalahannya dan berharap kepada Allah agar Dia mengampuni mereka. Tobat dari Allah untuk hamba-hamba-NYa ada dua; diberi-Nya taufik untuk bertobat, dan diterimanya tobat itu dari mereka. Menurut riwayat, bahwa ayat ini turun berkenaan dengan Abu Lubabah dan kawan-kawannya yang mengikat diri mereka di tiang-tiang masjid ketika sampai kepada mereka wahyu yang turun berkenaan dengan orang-orang munafik. Mereka bersumpah, tidak ada yang boleh melepas ikatan mereka selain Nabi shallallahu ‘alaihi wa sallam, maka Nabi shallallahu ‘alaihi wa sallam yang membukanya. Setelah Rasulullah shallallahu 'alaihi wa sallam membukanya, mereka kemudian datang membawa hartanya dan berkata, “Wahai Rasulullah, inilah harta kami yang tertinggal darimu, maka sedekahkanlah, bersihkanlah kami dan mintakanlah ampunan untuk kami.” Rasulullah shallallahu 'alaihi wa sallam bersabda, “Aku tidak diperintahkan mengambil hartamu sedikit pun.” Maka Allah menurunkan ayat, “Khudz min amwaalihim shadaqah…dst.” (At Taubah: 103) Sedangkan selain mereka yang kurang begitu sungguh-sungguh dalam bertobat seperti halnya Abu Lubabah, yaitu Ka’ab bin Malik, Hilal bin Umayyah dan Maraarah bin Rabi’, maka Rasulullah shallallahu 'alaihi wa sallam bersikap diam terhadap mereka dan melarang para sahabat berbicara dan bergaul dengan mereka sampai rasa gelisah menimpa mereka dan bumi yang luas terasa sempit sebagaimana akan disebutkan kisahnya di ayat 118. Mereka bertiga tergolong orang-orang yang ikut perang Badar, sebagian orang ada yang berkata, “Mereka binasa.” Sedangkan yang lain berkata, “Mudah-mudahan Allah mengampuni mereka.” Kepada mereka ditangguhkan keputusan Allah, dan mereka tidak mengetahui; apakah mereka akan diazab atau diberi rahmat sehingga turun ayat 118 tentang diterimanya tobat mereka setelah berlalu 50 malam. Dia mengampuni dan menyayangi, di mana semua makhluk tidak lepas dari ampunan dan kasih sayang-Nya, bahkan dunia ini tidak akan tetap tanpa keduanya. Di antara ampunan-Nya adalah bahwa orang-orang yang telah berbuat dosa begitu banyak, yakni mereka yang mengisi umur mereka dengan perbuatan buruk, jika mereka bertobat meskipun tobatnya tidak jauh dari hari kematiannya, maka Allah akan memaafkannya dan menghapuskan kesalahannya. Ayat ini menunjukkan bahwa orang yang mencampur amal saleh dengan amal buruk, di mana ia mengakui dosanya dan menyesalinya berada di bawah rasa cemas dan harap, dan lebih dekat untuk selamat. Adaun orang yang mencampur amal baik dengan amal buruk, namun tidak mengakui kesalahan dan tidak menyesali perbuatannya, bahkan tetap di atas dosa, maka keadaannya sangat mengkhawatirkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 102",
    "description": "Dan ada pula orang lain yang berada di sekeliling kamu yang mengakui dosa-dosa mereka lalu bertobat atas dosa-dosa itu, tetapi mereka masih mencampuradukkan pekerjaan yang baik dengan pekerjaan lain yang buruk, dengan mereka taat dan beramal saleh dan pada waktu yang berbeda mereka masih berbuat jahat dan maksiat. Mudah-Mudahan Allah menerima tobat mereka jika mereka bertobat dengan sungguh-sungguh. Sesungguhnya Allah maha pengampun atas segala dosa, maha penyayang kepada orang yang berusaha tidak mengulangi kesalahannya. Pada ayat sebelumnya dijelaskan adanya sekelompok orang yang mengakui dosa-dosa mereka lalu bertobat kepada Allah. Karena penyebab dosa mereka adalah kecintaan kepada harta, maka dalam ayat ini dijelaskan tentang wujud tobat dan ketaatan diantaranya dengan menunaikan zakat. Diperintahkan kepada nabi Muhammad, ambillah zakat dari harta mereka, guna membersihkan jiwa mereka dari kekikiran dan cinta yang berlebihan terhadap harta, dan menyucikan hati agar tumbuh subur sifat-sifat kebaikan mereka, dan berdoalah untuk mereka. Sesungguhnya doamu itu menumbuhkan ketenteraman jiwa bagi mereka yang sudah lama gelisah dan cemas akibat dosa-dosa yang mereka kerjakan. Sampaikan kepada mereka bahwa Allah maha mendengar permohonan ampun dari hamba-Nya, maha mengetahui tulus atau tidaknya tobat mereka."
  }
]