[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ambilah (wahai nabi), dari sebagian harta benda orang-orang yang telah bertaubat yang mencampuradukan antara amal shalih dan perbuatan buruk lain, sedekah (zakat) yang membersihkan mereka dari kotoran dosa-dosa dan mengangkat mereka dari golongan orang-orang munafik menuju derajat orang-orang yang ikhlas, dan berdoalah kepada Allah bagi mereka untuk mengampuni dosa-dosa mereka, dan mintakanlah ampunan bagi mereka dari dosa-dosa itu. Sesungguhnya doamu dan permintaan ampunanmu akan menjadi rahmat dan ketenangan bagi mereka. Dan Allah maha mendengar tiap-tiap doa dan ucapan, maha mengetahui keadaan-keadaan hamba-hamba dan nita-niat mereka. Dan Dia akan memberikan balasan kepada setiap orang yang berbuat sesuai dengan perbuatannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "103. Ambillah -wahai Rasul- dari harta mereka sebagai zakat yang akan membersihkan mereka dari noda-noda maksiat serta dosa dan mengembangkan kebaikan mereka. Dan panjatkanlah doa untuk mereka setelah kamu mengambil zakat dari mereka. Sesungguhnya doamu adalah rahmat dan ketentraman bagi mereka. Dan Allah Maha Mendengar doamu lagi Maha Mengetahui amal perbuatan dan niat mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "103. Hai Rasulullah, Ambillah zakat dari orang-orang yang bertaubat dan mengakui kesalahan mereka itu, agar menyucikan mereka dari dosa-dosa dan menambah kebaikan mereka; sehingga mereka meraih keikhlasan kepada Allah. Allah Maha Mendengar segala doa dan perkataan, dan Maha Mengetahui segala taubat dan perbuatan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "103. خُذْ مِنْ أَمْوٰلِهِمْ صَدَقَةً (Ambillah zakat dari sebagian harta mereka) Terdapat pendapat mengatakan yang dimaksud adalah zakat yang wajib dikeluarkan. Dan pendapat lain mengatakan: ini merupakan sedekah yang hanya diwajibkan atas orang-orang yang mengakui kesalahannya tersebut, karena setelah penerimaan taubat mereka lalu mereka menawarkan harta mereka kepada Rasulullah, sehingga turun ayat ini yang memerintahkan Rasulullah untuk mengambil sebagian harta mereka, dan bukan seluruhnya. تُطَهِّرُهُمْ وَتُزَكِّيهِم بِهَا(dengan zakat itu kamu membersihkan dan mensucikan mereka) Yakni, kamu membersihkan mereka dari dosa-dosa mereka Wahai Muhammad dengan sedekah yang diambil dari mereka. Makna pembersihan disini adalah menghilangkan bekas-bekas dosa yang masih menempel pada mereka. Adapun pensucian adalah pembersihan yang lebih lagi. وَصَلِّ عَلَيْهِمْ ۖ( dan mendoalah untuk mereka) Yakni berdoalah bagi mereka setelah kami mengambil sebagian harta mereka. إِنَّ صَلَوٰتَكَ سَكَنٌ لَّهُمْ ۗ( Sesungguhnya doa kamu itu (menjadi) ketenteraman jiwa bagi mereka) Makna (السكن) yakni apa yang dapat menentramkan dan mendamaikan jiwa mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "103. Wahai nabi, ambillah sebagian harta-harta orang-orang muslim sebagai sedekah wajib, yang menjadi sebab penghapus dosa mereka, dan mendorong mereka untuk berbuat kebaikan. Maka doakanlah dan mintakanlah ampunan bagi mereka. Sesungguhnya doa dan permohonan ampunmu itu akan menjadi sebab keteguhan diri mereka. Allah itu Maha Mendengar pengakuan mereka dan doamu untuk mereka. Ayat tersebut bukan menunjukkan sebab khusus melainkan umum bagi seluruh harta dan seluruh manusia, karena ungkapannya menggunakan lafadz yang umum bukan khusus."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ambillah zakat dari sebagian harta mereka yang dapat menyucikan dan membersihkan mereka} zakat itu menumbuhkan kebaikan mereka {dan doakanlah mereka} doakanlah mereka {karena sesungguhnya doamu adalah ketenteraman bagi mereka} rahmat dan ketenangan bagi mereka {Allah Maha Mendengar lagi Maha Mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "103. Allah berfirman kepada RasulNya dan kepada orang yang menempati kedudukannya (pemimpin) seraya memerintahkannya dengan apa yang dapat menyucikan orang-orang Mukmin dan menyempurnakan iman mereka, “ambillah zakat dari sebagian harta mereka”, yakni zakat yang diwajibkan, “dengan zakat itu kamu membersihkan mereka dari dosa-dosa dan akhlak-akhlak tercela. “Dan menyucikan mereka,” yakni, menumbuhkan dan menambahkan akhlak-akhlak mereka yang baik dan amal mereka yang shalih, menambah pahala mereka di dunia dan di akhirat, menyuburkan harta mereka. “Dan berdoalah untuk mereka.” Yakni untuk orang-orang Mukmin secara umum dan secara khusus pada waktu mereka membayarkan zakatnya kepadamu. “Sesungguhnya doamu itu (menjadi) ketentraman jiwa bagi mereka.” Yakni ketenangan bagi hati mereka dan kegembiraan bagi mereka. “Dan Allah Maha Mendengar”, doamu dengan menerima dan mengabulkan, “lagi Maha Mengetahui”, tentang keadaan dan niat hamba-hambaNya, kemudian Dia akan membalas masing-masing pelaku sesuai dengan amalnya dan niatnya. Nabi melaksanakan perintah Allah, memerintahkan mereka bersedekah, serta mengutus amil-amil untuk mengambilnya, dan jika ada yang datang membawa zakatnya, maka Nabi mendoakan kebaikan untuknya dan mendoakan keberkahan atasnya. Ayat ini mengandung dalil diwajibkannya zakat pada semua harta. Jika harta tersebut diperdagangkan, maka ini jelas, karena ia adalah harta yang tumbuh dan menghasilkan, maka termasuk keadilan jika digunakan untuk menghibur orang-orang miskin dengan menunaikan zakat yang diwajibkan Allah kepadanya. Adapun selain harta perniagaan, jika harta itu berkembang seperti biji-bijian, buah-buahan, binatang ternak yang dimiliki agar ia beranak pinak, maka ia terkenal wajib zakat, jika tidak, maka tidak wajib zakat, karena jika hanya sekedar untuk dimiliki, maka ia tidak sama dengan harta yang biasanya dimiliki seseorang dengan tujuan-tujuan tertentu yang bersifat finansial, jadi ia dipalingkan dari tujuan tersebut kepada tujuan kepemilikan murni. Dalam ayat ini juga terkandung dalil bahwa seorang hamba tidak mungkin menyucikan dan membersihkan diri sebelum dia mengeluarkan zakat hartanya, dan tidak ada yang menggantikannya kecuali dengan membayarnya, karena kesucian dan kebersihan bergantung kepada mengeluarkannya. Dalam ayat ini juga terkandung dalil dianjurkannya bagi imam atau wakilnya agar mendoakan orang yang berzakat dengan keberkahan dan hendaknya doa tersebut diucapkan dengan suara keras di mana pembayar zakat itu dapat mendengarnya sehingga dia pun tenang. Dipahami suatu faidah dari makna ayat bahwa hendaknya kita memberikan kebahagiaan kepada seorang Mukmin dengan ucapan yang lembut, mendoakan kebaikan untuknya, dan hal lain semisalnya yang menyebabkan ketenangan jiwa dan ketentramannya. (Hendaknya menyemangati orang yang berinfak dan melakukan amal baik dengan mendoakannya, memujinya, dan semisalnya)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 103: Allah Subhaanahu wa Ta'aala memerintahkan Rasul-Nya dan orang yang menjadi penggantinya, seperti imam kaum muslimin untuk memungut zakat dari kaum mukmin demi membersihkan mereka dan menyempurnakan imannya. Maksudnya zakat itu membersihkan mereka dari dosa dan akhlak tercela, dari kekikiran, dan dari cinta yang berlebihan kepada harta benda. Zakat itu menyuburkan sifat-sifat kebaikan dalam hati mereka dan mengembangkan harta mereka. Yakni untuk kaum mukmin secara umum, dan kususnya kepada mereka yang menyerahkan zakat. Dalam ayat ini terdapat anjuran mendoakan mereka yang membayar zakat, baik oleh imam atau wakilnya, dan sebaiknya diperdengarkan agar hati orang yang menyerahkan zakat merasa tenteram. Ayat ini juga menunjukkan, bahwa dianjurkan menyampaikan kegembiraan di hati orang mukmin dan mendoakannya untuk menenangkan hatinya. Demikian juga agar kita menyemengatkan mereka yang berinfak dan beramal saleh dengan doa, pujian dsb. Dia mendengar doamu, mendengar yang akan menjadikan-Nya mengabulkan permohonan. Dia mengetahui keadaan hamba dan niat mereka, membalas masing-masing yang beramal sesuai amalnya dan sesuai niatnya. Terhadap perintah ini, Nabi shallallahu 'alaihi wa sallam melaksanakannya, Beliau menyuruh para sahabat berzakat dan mengirimkan petugas zakat untuk mengumpulkan zakat dari tempat yang jauh. Apabila ada orang yang datang kepada Beliau membawa zakatnya, maka Beliau mendoakannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 103",
    "description": "Pada ayat sebelumnya dijelaskan adanya sekelompok orang yang mengakui dosa-dosa mereka lalu bertobat kepada Allah. Karena penyebab dosa mereka adalah kecintaan kepada harta, maka dalam ayat ini dijelaskan tentang wujud tobat dan ketaatan diantaranya dengan menunaikan zakat. Diperintahkan kepada nabi Muhammad, ambillah zakat dari harta mereka, guna membersihkan jiwa mereka dari kekikiran dan cinta yang berlebihan terhadap harta, dan menyucikan hati agar tumbuh subur sifat-sifat kebaikan mereka, dan berdoalah untuk mereka. Sesungguhnya doamu itu menumbuhkan ketenteraman jiwa bagi mereka yang sudah lama gelisah dan cemas akibat dosa-dosa yang mereka kerjakan. Sampaikan kepada mereka bahwa Allah maha mendengar permohonan ampun dari hamba-Nya, maha mengetahui tulus atau tidaknya tobat mereka. Allah menegaskan dalam bentuk pertanyaan, tidakkah mereka mengetahui, bahwa Allah menerima tobat yang tulus dari hamba-hambanya dan menerima zakat mereka dengan memberinya pahala, dan tidakkah mereka mengetahui bahwa Allah maha penerima tobat orang-orang yang menyesali dosa yang telah mereka lakukan, lagi maha penyayang kepada mereka yang benar dalam tobatnya'."
  }
]