[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah tidak mengetahui orang-orang yang tidak turut dalam jihad dan orang-orang yang lainnya bahwa sesungguhnya Allah semata yang menerima taubat-taubat hamba-hambaNYa, dan menerima zakat-zakat serta memberikan pahalanya, dan sesungguhnya Allah, Dia lah Dzat yang maha menerima taubat hamba-hambaNya bila mereka mau kemabali taat kepadaNya, mahapenyayang kepada mereka apabila mereka berinabah(kembali) menuju keridhaannya?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "104. Hendaklah orang-orang yang tidak pergi ke medan jihad dan orang-orang yang bertobat kepada Allah itu tahu bahwa Allah menerima tobat dari hamba-hamba-Nya yang bertobat kepada-Nya dan (hendaklah mereka tahu) bahwa Allah menerima sedekah-sedekah kendati Dia sama sekali tidak membutuhkannya, dan memberikan pahala kepada orang-orang yang bersedekah sesuai dengan sedekahnya. Allah -Subḥānahu- Maha Menerima tobat lagi Maha Penyayang bagi hamba-hamba-Nya yang bertobat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "104. Tidakkah orang-orang yang enggan berjihad itu mengetahui keluasan rahmat dan karunia Allah. Allah menerima taubat hamba-hamba-Nya yang bertaubat, dan menerima sedekah dan zakat mereka dengan memberi mereka pahala. Dan tidakkah mereka mengetahui Allah Maha Menerima Taubat hamba-hamba-Nya dan Maha Luas rahmat-Nya bagi mereka?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "104. أَلَمْ يَعْلَمُوٓا۟ أَنَّ اللهَ هُوَ يَقْبَلُ التَّوْبَةَ (Tidaklah mereka mengetahui, bahwasanya Allah menerima taubat) Karena Allah Maha Kaya dari ketaatan hamba-hamba-Nya yang taat dan tidak peduli terhadap kemaksiatan hamba-hamba-Nya yang bermaksiat. وَيَأْخُذُ الصَّدَقٰتِ(dan menerima zakat) Yakni menerima zakat mereka. Dan ini merupakan kemuliaan yang besar bagi ketaatan ini dan bagi orang yang mengerjakannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "104. Apakah orang-orang yang bertaubat dan orang-orang mukmin itu tahu bahwa Allah menerima taubat yang benar dari hambaNya yang mau bertaubat, karena ketidakbutuhanNya dari ketaatan dan pengabaiannya terhadap kemaksiatan. Dan Allah menerima sedekah mereka dan melipatgandakan pahalanya. Dan sesungguhnya Allah itu Maha Menerima Taubat dan Maha Penyayang bagi orang yang bertaubat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidakkah mereka mengetahui bahwa Allah menerima taubat hamba-hambaNya dan menerima zakat} menerimaa zakat dan memberi pahala atas zakat tersebut {dan sesungguhnya Allah Maha Penerima taubat lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "104. Yakni, apakah mereka tidak mengetahui rahmat Allah yang luas dan karuniaNya yang menyeluruh, dan bahwa Dia “menerima taubat dari hamba-hambaNya”, yang bertaubat dari dosa apa pun, bahkan Dia berbahagia karena taubat hambaNya jika dia bertaubat dengan kebahagiaan yang besar, “dan menerima zakat”, dari mereka , yakni menerima, dan mengambilnya dengan Tangan KananNya. Maka Dia menumbuhkannya seperti seorang laki-laki menumbuhkan anak kudanya, sehingga satu biji kurma bisa menjadi seperti gunung yang besar. Lalu, bagaimana dengan yang lebih besar dan lebih banyak dari itu? “Dan bahwasanya Allah Maha Penerima taubat lagi Maha Penyayang?” yakni banyak mengampuni orang-orang yang bertaubat. Siapa yang bertaubat kepadaNya, maka Allah akan menerima taubatnya, meskipun kemaksiatan yang dilakukannya berulang-ulang. Dan Allah tidak akan merasa bosan memberi ampun kepada hamba-hambaNya sehingga mereka sendiri yang merasa bosan dan menolak kecuali menjauh dan menghindar dari pintuNya sambil berkawan dengan musuh mereka. “Maha Penyayang”, yang rahmatNya meliputi segala sesuatu dan Dia menetapkannya untuk orang-orang yang bertakwa, membayar zakat, beriman kepada ayat-ayatNya, dan mengikuti RasulNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 104: Pertanyaan ini adalah untuk menetapkan, dan tujuannya agar mendorong mereka bertobat dan bersedekah. Yakni tidakkah mereka menetahui luasnya rahmat Allah dan meratanya kepemurahan-Nya. Betapa pun besar dosanya, bahkan sangat gembira dengan tobat hamba-hamba-Nya. Dia menerima zakat itu dan mengambilnya dengan tangan kanan-Nya lalu mengembangkannya sebagaimana seseorang mengembangbiakkan anak kudanya, bahkan satu kurma bisa menjadi banyak seperti gunung yang besar. Rasulullah shallallahu 'alaihi wa sallam bersabda: مَا تَصَدَّقَ أَحَدٌ بِصَدَقَةٍ مِنْ طَيِّبٍ - وَلاَ يَقْبَلُ اللَّهُ إِلاَّ الطَّيِّبَ - إِلاَّ أَخَذَهَا الرَّحْمَنُ بِيَمِينِهِ وَإِنْ كَانَتْ تَمْرَةً فَتَرْبُو فِى كَفِّ الرَّحْمَنِ حَتَّى تَكُونَ أَعْظَمَ مِنَ الْجَبَلِ كَمَا يُرَبِّى أَحَدُكُمْ فَلُوَّهُ أَوْ فَصِيلَهُ “Tidaklah seseorang bersedekah dari yang baik –dan Allah tidak menerima kecuali dari yang baik- melainkan Allah akan mengambilnya dengan tangan kanan-Nya. Jika berupa satu buah kurma, maka akan berkembang di telapak tangan Ar Rahman sehingga besar melebihi gunung, sebagaimana salah seorang di antara kamu membesarkan anak kuda atau anak untanya.” (HR. Muslim) Ia banyak menerima tobat orang-orang yang bertobat. Oleh karena itu, barang siapa bertobat kepada-Nya, maka Dia akan menerimanya meskipun telah berulang kali melakukan kemaksiatan, dan Dia tidak pernah bosan menerima tobat hamba-Nya, maka janganlah bosan. Di mana rahmat-Nya meliputi segala sesuatu, dan ditetapkan rahmat itu di akhirat untuk orang-orang yang bertakwa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 104",
    "description": "Allah menegaskan dalam bentuk pertanyaan, tidakkah mereka mengetahui, bahwa Allah menerima tobat yang tulus dari hamba-hambanya dan menerima zakat mereka dengan memberinya pahala, dan tidakkah mereka mengetahui bahwa Allah maha penerima tobat orang-orang yang menyesali dosa yang telah mereka lakukan, lagi maha penyayang kepada mereka yang benar dalam tobatnya' dan katakanlah, kepada mereka yang bertobat, bekerjalah kamu, de-ngan berbagai pekerjaan yang mendatangkan manfaat, maka Allah akan melihat pekerjaanmu, yakni memberi penghargaan atas pekerjaanmu, begitu juga rasul-Nya dan orang-orang mukmin juga akan menyaksikan dan menilai pekerjaanmu, dan kamu akan dikembalikan, yakni meninggal dunia dan pada hari kebangkitan semua makhluk akan kembali kepada Allah yang mengetahui yang gaib dan yang nyata, lalu diberitakannya kepada kamu apa yang telah kamu kerjakan di dunia, baik yang kamu tampakkan atau yang kamu sembunyikan."
  }
]