[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan katakanlah (wahai nabi), kepada orang-orang yang telah ikut berjihad, ”berbuatlah kalian karena Allah dengan apa yang Dia ridoi dari ketaatan kepadaNya, dan menunaikan kewajibanNya dan menjauhi maksiat kepadaNya, maka Allah akan melihat amal kalian, begitu pula rasulNya dan kaum mukminin, dan jati diri kalian akan menjadi jelas urusan kalian. Dan kalian akan dikembalikan pada hari kiamat kepada dzat yang mengetahui perkara rahasia dan perkara nyata dari kalian, lalu Dia akan memberitakan kepada kalian tentang apa yang dahulu kalian kerjakan. Dalam ayat ini termuat peringatan dan ancaman bagi orang yang tetap bertahan di atas kebatilan dan keangkuhannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "105. Katakanlah -wahai Rasul- kepada orang-orang yang tidak pergi ke medan jihad dan bertobat dari dosanya, \"Tutupilah kerugian yang timbul dari kesalahan kalian di masa lalu, ikhlaskanlah amal kalian kepada Allah, dan lakukanlah hal-hal yang diridai-Nya. Maka Allah, rasul-Nya, dan orang-orang mukmin akan melihat amal perbuatan kalian dan kelak di hari Kiamat kalian akan dikembalikan kepada Tuhan kalian yang Maha Mengetahui segala sesuatu. Dia mengetahui apa saja yang kalian sembunyikan dan apa saja yang kalian perlihatkan. Dia akan memberitahukan kepada kalian apa yang telah kalian perbuat di dunia dan Dia akan memberikan balasan sesuai dengan amal perbuatan kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "105. Hai Rasulullah, katakanlah kepada orang-orang yang bertaubat itu dan kepada selain mereka: “Kerjakanlah kebaikan yang Allah perintahkan kepada kalian, karena amalan kalian akan ditunjukkan kepada Allah, dan Allah, Rasulullah, dan orang-orang beriman akan melihat amalan tersebut. Dan pada hari penghitungan kalian akan dikembalikan kepada Dzat yang mengetahui segala perbuatan kalian yang tersembunyi dan terang-terangan; kemudian Dia akan memberitahukan kepada kalian segala kebaikan dan keburukan yang telah kalian perbuat, lalu Dia akan membalas perbuatan itu.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "105. وَقُلِ اعْمَلُوا۟ فَسَيَرَى اللهُ عَمَلَكُمْ وَرَسُولُهُۥ وَالْمُؤْمِنُونَ ۖ (Dan Katakanlah: “Bekerjalah kamu, maka Allah dan Rasul-Nya serta orang-orang mukmin akan melihat pekerjaanmu itu) Kalimat ini ditujukan bagi orang-orang yang bertaubat tersebut dan selain mereka. Yakni bersegeralah untuk mengerjakan amalan-amalan kebaikan dan ikhlaslah dalam mengerjakannya semata-mata karena Allah. Dan amal yang baik akan diketahui oleh orang-orang beriman. وَسَتُرَدُّونَ(dan kamu akan dikembalikan) Setelah kematian. إِلَىٰ عٰلِمِ الْغَيْبِ وَالشَّهٰدَةِ(kepada (Allah) Yang Mengetahui akan yang ghaib dan yang nyata) Yakni kepada Allah, Dzat yang tak tersembunyi dari-Nya segala sesuatu, dan segala sesuatu itu sama bagi-Nya, baik itu kalian tampakkan kepada manusia maupun kalian sembunyikan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "105. Wahai rasul, katakanlah kepada orang-orang yang bertaubat: “Beramal baiklah dan ikhlaskanlah amal kalian kepada Allah, niscaya Dia (Allah), rasulallah dan orang-orang mukmin akan melihat amal kalian sebagai amal baik atau buruk, Dan setelah mati kalian akan dikembalikan kepada Dzat yang Maha Mengetahui yang ghaib dan yang tampak. Lalu Dia akan memberitahu kalian tentang amal kalian lalu membalas kalian atas amal tersebut.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Beramallah. Maka Allah, rasulNya, dan orang-orang mukmin akan melihat amal kalian. Kalian akan dikembalikan} kalian akan dikembalikan pada hari kiamat {kepada Dzat yang Maha Mengetahui yang ghaib dan yang nyata. Lalu Dia akan memberitakan kepada kalian apa yang selama ini kalian kerjakan.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "105. Allah berfirman, “Dan katakanlah”, kepada orang-orang munafik itu, “bekerjalah kamu”, dengan pekerjaan yang menurutmu sesuai, teruskan kebatilanmu, jangan mengira bahwa amalanmu itu akan samar atas Allah, “maka Allah dan RasulNya serta orang-orang Mukmin akan melihat pekerjaanmu itu.” Yakni, pekerjaanmu pasti akan terlihat dan terbukti. “Dan kamu akan dikembalikan kepada (Allah) Yang Maha Mengetahui akan yang ghaib dan yang nyata, lalu diberitakanNya kepadamu apa yang telah kamu kerjakan,” yang baik maupun yang buruk. Ini mengandung ancaman yang keras terhadap orang yang meneruskan kebatilannya, kezhalimannya, kesesatannya, dan penyimpangannya. Ada kemungkinan maknanya adalah bahwa apa pun yang kamu lakukan, baik maupun buruk, maka Allah akan melihatmu dan Dia akan menunjukannya pada RasulNya dan hamba-hambaNya yang beriman, meskipun ia adalah amalan batin."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 105: Kepada orang-orang munafik. Sesuka hatimu dan tetaplah di atas kebatilanmu, namun jangan kamu kira, bahwa yang demikian tersembunyi bagi-Nya. Dalam ayat ini terdapat ancaman bagi mereka yang tetap di atas kebatilan, kesesatan dan maksiatnya. Yakni amalmu akan semakin jelas. Makna ayat ini bisa juga, bahwa amal yang kamu lakukan baik atau buruk, maka Allah mengetahunya, demikian pula Rasul-Nya dan kaum mukmin meskipun tersembunyi. Dan diberikan balasan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 105",
    "description": "Dan katakanlah, kepada mereka yang bertobat, bekerjalah kamu, de-ngan berbagai pekerjaan yang mendatangkan manfaat, maka Allah akan melihat pekerjaanmu, yakni memberi penghargaan atas pekerjaanmu, begitu juga rasul-Nya dan orang-orang mukmin juga akan menyaksikan dan menilai pekerjaanmu, dan kamu akan dikembalikan, yakni meninggal dunia dan pada hari kebangkitan semua makhluk akan kembali kepada Allah yang mengetahui yang gaib dan yang nyata, lalu diberitakannya kepada kamu apa yang telah kamu kerjakan di dunia, baik yang kamu tampakkan atau yang kamu sembunyikan. Selain terdapat kelompok yang mengakui dosa-dosa mereka lalu dianjurkan untuk bertobat dan melakukan pekerjaan yang bermanfaat, ada pula orang-orang lain yang ditangguhkan sampai ada keputusan Allah; mungkin Allah akan mengazab mereka, karena mereka tetap dalam kedurhakaan, dan mungkin Allah akan menerima tobat mereka, jika mereka bertobat dengan sungguh-sungguh. Allah maha mengetahui orang yang bertobat secara tulus, mahabijaksana dalam menetapkan keputusannya."
  }
]