[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan diantara orang-orang yang tidak berangkat bersama kalian (wahai kaum mukminin), di perang tabuk ada orang-orang lain yang ditangguhkan, karena Allah akan memutuskan perkara kepada mereka dengan ketetapan yang akan diputuskannya. Mereka itu adalah orang-orang yang menyesali apa yang mereka perbuat. Mereka adalah murarah bin ar-rabi’, ka’ab bin malik, dan hilal bin umayyah, baik dengan menghukum mereka atau memaafkan mereka. Dan Allah mahamengetahui siapa yang berhak di hukum dan diberi maaf, juga mahabijaksana dalam semua perkataan dan perbuatannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "106. Ada di antara orang-orang yang tidak ikut serta dalam perang Tabuk, mereka tidak punya alasan yang dibenarkan. Mereka itu ditangguhkan urusannya dan diserahkan keputusan hukumnya kepada ketentuan Allah. Boleh jadi Allah akan menimpakan azab kepada mereka apabila mereka tidak bertobat atau Allah akan menerima tobat mereka apabila mereka bertobat kepada-Nya. Allah Maha Mengetahui siapa yang pantas mendapatkan hukuman-Nya dan siapa yang pantas mendapatkan ampunan-Nya. Dan Dia Maha Bijaksana dalam menetapkan syariat-Nya dan mengatur makhluk-Nya. Mereka itu adalah Murārah bin Rabī', Ka'b bin Mālik dan Hilāl bin Umayyah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "106. Dan sekelompok lain yang tidak mengikuti perang Tabuk ditangguhkan hingga datang ketetapan Allah bagi mereka. Mereka adalah Ka’ab bin Malik, Murarah bin Rabi’, dan Hilal bin Umayyah. Mereka akan diazab jika tidak bertaubat, atau diampuni jika mereka bertaubat dan memperbaiki amalan mereka; dan mereka memilih untuk bertaubat. Allah Maha Mengetahui taubat orang-orang yang sungguh-sungguh bertaubat, dan Maha Bijaksana dalam mengatur alam semesta."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "106. وَءَاخَرُونَ مُرْجَوْنَ لِأَمْرِ اللهِ (Dan ada (pula) orang-orang lain yang ditangguhkan sampai ada keputusan Allah) Mereka adalah orang-orang yang tidak mengikuti perang bersama Rasulullah dan tidak mempunyai alasan yang dibenarkan namun tidak termasuk orang-orang yang mengikat diri mereka di tiang-tiang masjid seperti yang dilakukan orang-orang selain mereka; mereka ini berjumlah tiga orang: Ka’ab bin Malik, Hilal bin Umayyah, dan Mararah bin Rabi’, mereka semua dari kaum Anshar, urusan mereka ditangguhkan. إِمَّا يُعَذِّبُهُمْ(adakalanya Allah akan mengazab mereka) Jika mereka tetap dalam keadaan mereka semula. وَإِمَّا يَتُوبُ عَلَيْهِمْ (dan adakalanya Allah akan menerima taubat mereka) Jika mereka bertaubat dengan taubat yang sebenarnya dan benar-benar ikhlas. Dan akan disebutkan di akhir surat bahwa Allah menerima taubat mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "106. Dan kelompok lainnya yang mundur itu adalah orang yang ditangguhkan hukumannya. Mereka itu adalah tiga golongan yang ditangguhkan taubatnya, baik mereka yang akan diazab Allah jika masih berada pada keadaan itu atau mereka yang mau bertaubat, berlaku baik dan ikhlas. Allah itu mengetahui apa yang dalam hati mereka dan Maha Bijaksana ketentuanNya terhadap mereka. Ayat ini diturunkan terkait Ka’b bin Malik, Hilal bin Umayyah dan Murarah bin Ar-Rabi’ dari kaum Anshar. Mereka mundur dari perang Tabuk karena malas bukan karena munafik."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ada orang-orang lain} di antara orang-orang yang tidak ikut perang Tabuk ada kaum {yang ditangguhkan} ditangguhkan {sampai ada keputusan Allah} hukum Allah {Barangkali Dia akan mengazab mereka dan mungkin Dia akan menerima taubat mereka. Allah Maha Mengetahui lagi Maha bijaksana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "106. “Dan (ada pula) orang-orang lain”, yang tidak berangkat berjihad, yang ditangguhkan “sampai ada keputusan Allah, adakalanya Allah akan mengazab mereka dan adakalanya Allah akan menerima taubat mereka.” Ini mengandung ancaman yang keras bagi orang-orang yang tidak berangkat berjihad dan anjuran kepada mereka agar menyesal dan bertaubat. “Dan Allah Maha Mengetahui”, keadaan dan niat hamba-hambaNya, “lagi Mahabijaksana.” Dia meletakkan segala sesuatu pada tempatnya dan mendudukannya pada posisinya. Jika hikmahNya menuntut mengampuni dan menerima taubat mereka, maka Dia akan mengampuni dan menerima taubat mereka, namun jika hikmahNya menuntut tidak memberi mereka taufik kepada taubat, maka Dia akan melakukan itu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 106: Dengan mematikan mereka tanpa bertobat. Mereka adalah Ka’ab bin Malik, Hilal bin Umayyah dan Maraarah bin Rabi’, Mereka tidak ikut berperang bukan karena kemunafikan, tetapi karena malas dan lebih cenderung kepada kehidupan yang menyenangkan. Keadaan hamba dan niat mereka. Dia meletakkan sesuatu pada tempatnya, jika hikmah (kebijaksanaan)-Nya menghendaki untuk mengampuni dan menerima tobat mereka, maka Dia akan mengampuni dan menerima tobat mereka, dan jika hikmah-Nya menghendaki untuk membiarkan mereka dan tidak memberi taufik mereka untuk bertobat, maka Dia melakukannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 106",
    "description": "Selain terdapat kelompok yang mengakui dosa-dosa mereka lalu dianjurkan untuk bertobat dan melakukan pekerjaan yang bermanfaat, ada pula orang-orang lain yang ditangguhkan sampai ada keputusan Allah; mungkin Allah akan mengazab mereka, karena mereka tetap dalam kedurhakaan, dan mungkin Allah akan menerima tobat mereka, jika mereka bertobat dengan sungguh-sungguh. Allah maha mengetahui orang yang bertobat secara tulus, mahabijaksana dalam menetapkan keputusannya. Sebagian manusia ada yang mengakui dosa-dosa mereka lalu bertobat dan melakukan pekerjaan yang bermanfaat, sehingga tobatnya diterima Allah, ada yang menangguhkan tobatnya sampai ada keputusan Allah, dan ada pula yang jahat dan terus bertambah jahat, misalnya orang-orang munafik. Hal ini terbukti di antara orang munafik itu ada yang mendirikan masjid untuk menimbulkan bencana pada orang-orang yang beriman, untuk kekafiran dan untuk memecah belah di antara orangorang yang beriman yang sudah mantap imannya, serta dengan tujuan menunggu kedatangan orang-orang yang telah memerangi Allah, yakni memerangi umat islam, dan rasul-Nya sejak dahulu. Mereka dengan pasti akan senantiasa bersumpah palsu dengan berkata, kami hanya menghendaki kebaikan dengan membangun masjid ini. Mereka tidak menyadari bahwa Allah maha mendengar dan Allah menjadi saksi, yakni mengetahui dengan pasti bahwa mereka itu pendusta dalam sumpahnya. Allah maha mengetahui segala yang tampak maupun yang tersembunyi dalam hati setiap orang."
  }
]