[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang munafik yang membangun masjid dengan tujuan menimbulkan mudarat bagi kaum Mukminin dan kekafiran kepada Allah dan memecah belah diantara kaum mukminin, supaya sebagian mereka shalat di masjid itu dan meninggalkan masjid Quba ‘ yang kaum muslimin mengerjakan shalat di dalamnya. Maka Akibatnya akan membuat kaum muslimin berpecah-belah dan tercerai-berai disebabkan hal tersebut,dan menunggu orang yang akan memerangi Allah dan RasulNya sebelumnya, (yaitu Abu Amir, sang pendeta yang fasik) supaya menjadi kesempatan untuk memperdayai kaum Muslimin. Dan orang-orang munafik itu benar-benar bersumpah bahwa mereka sesunguhnya tidak mengingikan pembangunan masjid itu kecuali sekedar kebaikan semata dan iba terhadap kaum muslimin dan melonggarkan orang-orang lemah lagi tidak berdaya untuk berjalan menuju masjid (Quba’). Dan Allah bersaksi bahwa sesngguhnya mereka itu benar-benar berdusta dalam sumpah yang mereka nyatakan. Dan sungguh masjid tersebut telah dihancurkan dan dibakar."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "107. Salah satu golongan orang-orang munafik ialah mereka yang mendirikan masjid bukan dalam rangka taat kepada Allah, melainkan bertujuan mengganggu orang-orang Islam dan mendukung orang-orang kafir dengan cara memperkuat barisan orang-orang munafik dan memecah belah barisan orang-orang mukmin, serta dalam rangka bersiap-siap dan menunggu orang-orang yang memerangi Allah dan rasul-Nya sebelum masjid itu didirikan. Orang-orang munafik itu benar-benar akan bersumpah di hadapan kalian, \"Sungguh, kami tidak punya maksud lain selain berbuat baik kepada orang-orang Islam.\" Namun Allah bersaksi bahwa mereka benar-benar berdusta dengan pengakuan mereka itu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "107. Dan orang-orang munafik yang mengkhianati Rasulullah dan orang-orang beriman, dan melakukan kejahatan yang sangat besar; pemimpin mereka adalah Midhlal Abu ‘Amir ar-Rahib yang memerintahkan mereka untuk mendirikan masjid Dhirar sebagai tempat menyusun tipu daya, menyebarkan fitnah, memecah belah kaum muslimin karena dapat memalingkan mereka dari masjid Quba’, dan sebagai tempat untuk menunggu kedatangan orang yang memerangi Allah dan Rasulullah sebelumnya -yaitu Abu ‘Amir ar-Rahib-. Mereka menegaskan perkataan dusta mereka dengan bersumpah bahwa mereka tidak bermaksud membangun masjid itu kecuali untuk kebaikan dan berbuat baik kepada orang-orang lemah yang tidak mampu berjalan menuju masjid Quba’. Namun Allah Maha Mengetahui kedustaan perkataan dan perbuatan mereka. Syeikh Ibnu Taimiyah berkata: “Masjid Quba’ didirikan atas dasar ketakwaan, namun masjid Nabawi didirikan dengan ketakwaan yang lebih besar daripada masjid Quba’, sebagaimana disebutkan dalam hadits Shahih ketika Rasulullah ditanya mengenai masjid yang didirikan atas dasar ketakwaan, maka beliau menjawab, ‘Masjidku ini’. Sehingga kedua masjid itu didirikan atas dasar ketakwaan, namun masjid Nabawi didirikan atas dasar ketakwaan yang lebih sempurna daripada masjid lainnya.” (Tafsir Syeikhul Islam Ibnu Taimiyah 3/447)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "107. وَالَّذِينَ اتَّخَذُوا۟ مَسْجِدًا ضِرَارًا (Dan (di antara orang-orang munafik itu) ada orang-orang yang mendirikan masjid untuk menimbulkan kemudharatan) Ini merupakan golongan lain dari orang-orang munafik, mereka membangun masjid ketika Rasulullah tidak ada di kota Madinah. Abu Amir ar-Rahib berkata kepada mereka: “bangunlah masjid kalian, dan siapkanlah kekuatan dan persenjataan semampu kalian karena aku akan pergi ke kaisar Ramawi dan akan membawa pasukan dari sana, kemudian aku akan mengusir Muhammad dan para sahabatnya”. Setelah mereka selesai membangun masjid, mereka mendatangi Rasulullah seraya berkata: “Wahai Rasulullah, kami telah membangun masjid untuk orang-orang yang sakit, memiliki uzur, dan untuk dipakai saat malam-malam musim dingin atau hujan; dan kami ingin agar engkau sholat di masjid tersebut untuk kami”. Rasulullah menjawab: “aku sedang dalam persiapan untuk safar, kalau nanti aku sudah kembali insyaAllah aku akan mendatangi kalian untuk sholat di masjid kalian”. Kemudian turun wahyu yang menjelaskan tipu daya mereka, maka setelah beliau kembali dari safar beliau memanggil dua orang seraya berkata: “pergilah ke masjid milik orang-orang zalim, lalu hancurkan dan bakarlah masjid itu”. Maka mereka pergi dengan bergegas, dan orang-orang zalim itu berada di dalam masjid; lalu dua utusan Rasulullah menghancurkan dan membakar masjid sehingga orang-orang zalim itu berlarian keluar masjid. ضِرَارًا (untuk kemudharatan) Yakni bertujuan untuk menimbulkan kemudharatan bagi orang-orang beriman. وَكُفْرًا (untuk kekafiran) Karena dengan membangunnya mereka ingin memperkuat orang-orang munafik. وَتَفْرِيقًۢا بَيْنَ الْمُؤْمِنِين(dan untuk memecah belah antara orang-orang mukmin) Mereka ingin agar orang-orang beriman tidak mendatangi masjid Quba’, sehingga jama’ahnya menjadi sedikit. Dan hal itu tentu saja menimbulkan terpecahnya persatuan dan kesatuan. وَإِرْصَادًا لِّمَنْ حَارَبَ اللهَ وَرَسُولَهُۥ (serta menunggu kedatangan orang-orang yang telah memerangi Allah dan Rasul-Nya) Yakni orang-orang munafik yang diantaranya adalah Abu Amir ar-Rahib. مِن قَبْلُ ۚ( sejak dahulu) Yakni sebelum dibangunnya masjid Dhirar. وَلَيَحْلِفُنَّ إِنْ أَرَدْنَآ إِلَّا الْحُسْنَىٰ ۖ( Mereka Sesungguhnya bersumpah: “Kami tidak menghendaki selain kebaikan”) Yakni untuk mengasihi kaum muslimin yang lemah. وَاللهُ يَشْهَدُ إِنَّهُمْ لَكٰذِبُونَ (Dan Allah menjadi saksi bahwa sesungguhnya mereka itu adalah pendusta) Yakni dusta dalam sumpah mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Ayat ini memberi isyarat bahwa setiap amalan manusia sekalipun ia baik, statusnya akan berubah karena niat pelakunya; yang baik menjadi terlarang, sebagaimana yang terjadi pada orang-orang yang mendirikan masjid dhiror pada zaman Rasulullah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "107. Dan di antara orang-orang munafik Madinah yang berjumlah 12, mereka membangun masjid kemudharatan yaitu kemudharatan untuk masjid Quba di sekeliling Madinah untuk menipu dan mendominasi mereka serta untuk membuat perpecahan dan perselisihan di antara orang-orang mukmin, seraya menunggu kedatangan orang yang memerangi Allah dan rasulNya sebelum membangun masjid tersebut, Yaitu Abu Amir Ar-Rahib yang meminta kaisar Roma untuk membantunya memerangi orang-orang muslim dan memerintahkan untuk membangun masjid ini. Dan sungguh orang-orang munafik itu bersumpah bahwa mereka tidak ingin membangun masjid kecuali untuk kebaikan dan memudahkan orang lemah dan yang terhalang hujan dan panas untuk menunaikan shalat. Allah menyaksikan kebohongan mereka dalam sumpah itu. Ayat ini turun terkait Bani Ghanam bin Auf dari Bani Khazraj yang membangun masjid kemudharatan sesuai perintah Abu Amir Ar-Rahib, karena iri dengan Bani Amr bin Auf dari Bani Aus yang membangun Masjid Quba. Mereka meminta Rasulallah SAW untuk menunaikan shalat di dalamnya sebagaimana beliau shalat di masjid Quba, lalu beliau uzur sampai kembali dari perang Tabuk dan menerima ayat Al-Qur’an terkait kabar Masjid Mudharat, lalu memerintahkan agar meruntuhkan dan membakarnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan orang-orang yang mendirikan} mendirikan {masjid untuk menimbulkan mudharat} untuk menimbulkan mudharat bagi orang-orang mukmin {kekufuran, dan perpecahan di antara orang-orang mukmin, serta untuk menunggu} untuk persiapan dan menunggu {kedatangan orang-orang telah memerangi Allah dan RasulNya sebelum itu} sebelum mereka membangun masjid yang menimbulkan kemudharatan {Mereka benar-benar bersumpah,“Kami tidak menghendaki} Kami tidak ingin membangun masjid itu {melainkan untuk kebaikan”} untuk bermurah hati kepada orang-orang muslim {Allah bersaksi bahwa sesungguhnya mereka itu benar-benar pendusta"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "107. Ada beberapa orang munafik dari penduduk Quba membangun masjid dekat masjid Quba dengan maksud memecah belah dan menanamkan benih fitnah di antara orang-orang yang beriman, dan mereka menyiapkannya untuk orang-orang yang mereka harapkan memerangi Allah dan RasulNya, sekaligus sebagai benteng jika ia diperlukan. Maka Allah membuka kebusukannya dan menampakkan rahasia mereka. “Dan (di antara orang-orang munafik itu) ada orang-orang yang mendirikan masjid untuk menimbulkan kemudaratan (pada orang-orang Mukmin).” Yakni, kemudaratan pada orang-orang Mukmin dan masjid yang mereka gunakan untuk berkumpul kepadanya, “untuk kekafiran.” Yakni maksud mereka adalah kekufuran, jika maksud selain mereka adalah untuk keimanan, “dan untuk memecah belah antara orang-orang Muknmin.” Yakni agar orang-orang Mukmin berpecah belah, berselisih, dan bersengketa, “dan menunggu kedatangan”, yakni menyiapkan “orang-orang yang telah memerangi Allah dan RasulNya sejak dahulu.” Yakni untuk membantu orang-orang yang memerangi Allah dan RasulNya yang telah lama memusuhi dengan keras, seperti Abu Amir ar-Rahib,salah seorang penduduk Madinah. Ketika Nabi hijrah ke Madinah, Abu Amir ini menolak beriman kepadanya, dia adalah orang ahli ibadah pada masa jahiliyah, maka dia pergi kepada orang-orang musyrik untuk meminta tolong kepada mereka memerangi Rasulullah, ketika keinginannya pada orang-orang musyrik tidak terpenuhi, maka dia berangkat ke kaisar Romawi dengan anggapan dia mau menolongnya, tetapi orang yang terlaknat ini mati di jalan, padahal sebelumnya dia dengan orang-orang munafik telah berjanji dan bersekutu (untuk menghancurkan kaum Muslimin). Di antara yang mereka siapkan untuknya adalah masjid dhirar, maka wahyu turun menyampaikan hal itu, lalu Nabi mengutus orang-orang untuk merobohkannya dan membakarnya. Masjid itu pun kemudian dirobohkan dan dibakar, dan setelah itu masjid tempat pembuangan sampah. Allah berfirman setelah menjelaskan tujuan buruk mereka pada masjid itu. “Mereka sesungguhnya bersumpah, ‘Kami tidak menghendaki”, dalam membangunnya “selain kebaikan.” Yakni, membantu orang yang lemah dan buta. “Dan Allah menjadi saksi bahwa sesungguhnya mereka itu adalah pendusta (dalam sampahnya).” Kesaksian Allah lebih benar daripada sumpah mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 107: Jumlah mereka ada dua belas orang. Karena mereka membangunnya atas perintah seorang pendeta Nasrani bernama Abu ‘Amir agar menjadi bentengnya, di mana orang-orang yang datang dari sisinya singgah di situ. Ia pergi untuk membawa tentara dari Kaisar untuk memerangi Nabi shallallahu 'alaihi wa sallam. Abu ‘Amir di masa jahiliah adalah seorang ahli ibadah, ketika Rasulullah shallallahu 'alaihi wa sallam hijrah ke Madinah, ia kafir kepada Beliau dan pergi menemui orang-orang musyrik guna meminta bantuan kepada mereka memerangi Rasulullah shallallahu 'alaihi wa sallam. Di mana sebagiannya ada yang shalat di Quba’, dan sebagian lagi ada yang shalat di masjid mereka, karena masjidnya berdekatan. Yang dimaksudkan dengan orang yang telah memerangi Allah dan Rasul-Nya sejak dahulu ialah Abu 'Amir, yang mereka tunggu-tunggu kedatangannya dari Syiria untuk datang ke masjid yang mereka dirikan itu, serta membawa tentara Romawi yang akan memerangi kaum muslimin. Akan tetapi kedatangan Abu 'Amir ini tidak jadi karena ia mati di Syiria. Kemudian masjid yang didirikan kaum munafik itu diruntuhkan atas perintah Rasulullah shallallahu 'alaihi wa sallam karena wahyu yang diterimanya setelah kembali dari perang Tabuk. Yakni karena kasihan terhadap orang miskin agar mereka tidak kehujanan atau kepanasan, dan untuk melapangkan kaum muslimin. Sedangkan persaksian Allah lebih benar daripada sumpah mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 107",
    "description": "Sebagian manusia ada yang mengakui dosa-dosa mereka lalu bertobat dan melakukan pekerjaan yang bermanfaat, sehingga tobatnya diterima Allah, ada yang menangguhkan tobatnya sampai ada keputusan Allah, dan ada pula yang jahat dan terus bertambah jahat, misalnya orang-orang munafik. Hal ini terbukti di antara orang munafik itu ada yang mendirikan masjid untuk menimbulkan bencana pada orang-orang yang beriman, untuk kekafiran dan untuk memecah belah di antara orangorang yang beriman yang sudah mantap imannya, serta dengan tujuan menunggu kedatangan orang-orang yang telah memerangi Allah, yakni memerangi umat islam, dan rasul-Nya sejak dahulu. Mereka dengan pasti akan senantiasa bersumpah palsu dengan berkata, kami hanya menghendaki kebaikan dengan membangun masjid ini. Mereka tidak menyadari bahwa Allah maha mendengar dan Allah menjadi saksi, yakni mengetahui dengan pasti bahwa mereka itu pendusta dalam sumpahnya. Allah maha mengetahui segala yang tampak maupun yang tersembunyi dalam hati setiap orang. Karena masjid tersebut dibangun dengan niat jahat, maka Allah melarang nabi Muhammad, janganlah engkau melaksanakan salat dan kegiatan apa pun di dalam masjid yang dibangun oleh orang-orang munafik itu untuk selama-lamanya. Sungguh, masjid yang didirikan atas dasar takwa, yakni ketulusan semata-mata karena Allah, sejak hari pertama dimulai pembangunannya, adalah lebih pantas, yakni wajar engkau melaksanakan salat di dalamnya. Di dalamnya ada orang-orang yang ingin, yakni senang membersihkan diri, jasmani dengan cara berwudu maupun rohani dengan cara bertobat dari dosa dan maksiat. Allah menyukai, melimpahkan karunia-Nya kepada orang-orang yang bersih di manapun mereka berada."
  }
]