[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Janganlah kamu berdiri (wahai Nabi) untuk shalat di dalam masjid itu selamanya. Sesungguhnya masjid yang di bangun di atas asas ketakwaan sejak hari pertama, (yaitu masjid Quba’), lebih pantas untuk kamu berdiri tegak sholat di dalamnya. Di dalam masjid ini, ada orang-orang yang menyukai bersuci dengan Air dari najis-najis dan kotoran-kotoran, sebagaimana mereka menyucikan diri dengan sikaf waro dan istigfar dari dosa-dosa dan kemaksiatan. Dan Allah mencintai orang-orang yang mensucikan diri. Dan apabila masjid quba di bangun diatas landasan ketakwaan sejak pertama, maka masjid rasulullah demikian pula, bahkan lebih patut berlandaskan ketakwaan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "108. Janganlah kamu -wahai Nabi- memenuhi ajakan orang-orang munafik untuk menunaikan salat di masjid yang memiliki kriteria semacam itu. Karena masjid Qubā` yang sejak awal didirikan atas dasar takwa lebih pantas untuk dijadikan tempat salat dibanding masjid yang didirikan atas dasar kekafiran itu. Di masjid Qubā` itu ada orang-orang yang gemar bersuci dari hadas dan najis dengan menggunakan air, serta gemar membersihkan diri mereka dari noda-noda maksiat dengan tobat dan istigfar. Allah mencintai orang-orang yang gemar membersihkan dirinya dari hadas, najis, dan dosa."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "108. Kemudian Allah melarang dengan tegas Rasulullah untuk mendirikan shalat di Masjid Dhirar yang didirikan untuk menyebarkan fitnah; dan Allah menjelaskan bahwa mendirikan shalat di Masjid Quba’ yang dirikan atas dasar ketakwaan pada hari pertama Rasulullah memasukinya pada saat dia berhijrah, lebih utama daripada shalat di Masjid Dhirar. Allah memuji orang-orang yang ada di Masjid Quba’, dengan menyebut mereka adalah orang-orang yang suka membersihkan diri dari dosa, dan bersuci dengan wudhu dan mandi untuk menghilangkan kotoran dan najis. Allah mencintai orang-orang yang senantiasa menjaga kebersihan jiwa dan raga mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "108. لَا تَقُمْ فِيهِ أَبَدًا ۚ (Janganlah kamu bersembahyang dalam mesjid itu selama-lamanya) Maksudnya adalah larangan bagi Rasulullah untuk shalat di dalam masjid itu. لَّمَسْجِدٌ أُسِّسَ عَلَى التَّقْوَىٰ مِنْ أَوَّلِ يَوْمٍ(Sesungguhnya mesjid yang didirikan atas dasar takwa (mesjid Quba), sejak hari pertama) Yakni masjid Quba’. Pendapat lain mengatakan, masjid Nabawi. Makna kalimat مِنْ أَوَّلِ يَوْمٍ yakni sejak hari pertama pembangunannya. أَحَقُّ أَن تَقُومَ فِيهِ ۚ( lebih patut kamu sholat di dalamnya) Yakni seandainya sholat didalam masjid milik orang-orang munafik dibolehkan, tentu shalat dan zikirmu lebih utama dilakukan disana. فِيهِ رِجَالٌ يُحِبُّونَ أَن يَتَطَهَّرُوا۟ ۚ( Di dalamnya mesjid itu ada orang-orang yang ingin membersihkan diri) Dengan berwudlu dan mandi. Mereka sangat peduli dan memperhatikan hal ini jika terdapat sesuatu yang mewajibkannya. وَاللهُ يُحِبُّ الْمُطَّهِّرِينَ(Dan sesungguhnya Allah menyukai orang-orang yang bersih) Bersih dari hadast dan dosa-dosa."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Perbuatan riya' dari orang-orang yang melakukan ibadah karena mengharap pandangan orang lain, menjadikan status masjid dhiror seperti tempat sampah : { لَا تَقُمْ فِيهِ أَبَدًا } \"Janganlah kamu bersembahyang dalam mesjid itu selama-lamanya\" dan keikhlasan orang-orang yang ikhlas akan megangkat derajat masjid itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "108. Wahai Rasulallah, jangan sampai kamu shalat di masjid orang-orang munafik. Sesungguhnya Masjid Quba yang dibangun atas dasar ketakwaan sejak hari pertama Nabi memasuki Madinah untuk berhijrah itu lebih utama untuk shalat di dalamnya daripada di masjid mudharat. Di dalamnya (masjid Quba) ada banyak laki-laki kaum Anshar yang suka bersuci dengan dua cara yaitu bersuci secara zhahir (dengan wudhu atau semacamnya) dan secara maknawi yaitu dengan menghapus dosa. Sesungguhnya Allah meridhai dan memberi imbalan bagi orang yang selalu bersuci. Ayat ini turun terkait penduduk Quba {Fihi Rijal} yang selalu bersuci dengan air baik laki-laki maupun perempuan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Janganlah kamu mendirikan shalat} shalat {di dalamnya selamanya. Sungguh masjid yang didirikan atas dasar takwa} Sungguh masjid yang dibangun yang semula atas dasar takwa, yaitu Masjid Quba {sejak hari pertama} sejak hari pertamaa diletaakkan dasarnya {lebih berhak kamu mendirikan shalat di dalamnya} lebih pantas kamu mendirikan shalat di sana {Di dalamnya ada orang-orang yang suka membersihkan diri. Allah menyukai orang-orang yang membersihkan diri} orang-orang yang membersihkan diri"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "108. “Janganlah kamu shalat di dalam masjid itu selama-lamanya.” Janganlah kamu shalat di masjid yang dibangun untuk dhirar tersebut selama-lamanya, karena Allah telah mencukupimu darinya dan kamu tidaklah memerlukannya. “Sesungguhnya masjid yang didirikan atas dasar takwa (masjid Quba), sejak hari pertama”, munculnya Islam di Quba, ia adalah masjid Quba yang didirikan di atas dasar keikhlasan menjalankan ketaatan kepada Allah, menegakkan dzikir kepadaNya, dan menegakkan syiar-syiar agamaNya, ia adalah masjid tua yang terkenal dengan itu. Masjid yang utama ini “adalah lebih patut kamu shalat di dalamnya,” juga beribadah dan berdzikir kepada Allah. Ia adalah masjid mulia, dan orang-orangnya juga mulia. Oleh karena itu Allah memuji mereka dengan FirmanNya, “Di dalamnya ada orang-orang yang ingin membersihkan diri”, dari dosa, menyucikan diri dari kotoran, najis, dan hadats. Dan seperti yang telah diketahui bahwa siapa yang menginginkan sesuatu, maka dia akan berusaha dan bersungguh-sungguh dalam apa yang dicintai, mereka pasti berusaha dengan sungguh-sungguh bersuci dari dosa-dosa, kotoran, dan hadats. Oleh karena itu mereka termasuk golongan pendahulu dalam Islam, mereka adalah orang-orang yang mendirikan shalat, memelihara jihad bersama Rasulullah, menegakkan syariat agama dan mereka termasuk orang-orang yang tidak menyelisihi Allah dan RasulNya. Setelah ayat ini turun yang berisi pujian atas bersucinya mereka, maka Nabi bertanya kepada mereka tentang cara mereka bersuci, mereka menjawab bahwa mereka memakai air (dalam bersuci ) setelah sebelumnya mereka memakai batu, maka Allah memuji perbuatan mereka. “Dan Allah menyukai orang-orang yang bersih”, bersih secara maknawi seperti menjauhi kesyirikan dan akhlak-akhlak yang buruk, bersih secara materi seperti menghilangkan najis dan mengangkat hadats."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 108: Yakni jangan shalat di masjid yang dibangun untuk menimbulkan bencana itu, karena sesungguhnya Allah tidak butuh kpadanya dan kamu tidak memerlukannya. Hal ini, karena kaum munafik sebelumnya meminta Nabi shallallahu 'alaihi wa sallam shalat di situ. Yakni hari pertama Rasulullah shallallahu 'alaihi wa sallam menempati Darulhijrah (Madinah). Mereka adalah orang-orang Anshar. Baik dari dosa yang menodai batin, maupun dari najis dan hadats yang menodai lahiriah mereka. Ibnu Khuzaimah meriwayatkan dalam shahihnya dari ‘Uwaimir bin Sa’idah, bahwa Rasulullah shallallahu 'alaihi wa sallam pernah mendatangi mereka di masjid Quba’ dan bersabda, “Sesungguhnya Allah telah memperbagus pujian-Nya untuk kamu dalam hal bersuci ketika menerangkan kisah masjidmu, lantas bersuci seperti apa yang kamu lakukan?” Mereka menjawab, “Demi Allah, wahai Rasulullah, kami sebenarnya tidak mengetahui apa-apa. Hanyasaja kami memiliki tetangga orang-orang Yahudi, di mana mereka membasuh dubur mereka setelah buang air besar, maka kami pun membasuh sebagaimana mereka.” Baik bersih maknawi, yaitu bersih dari syirk dan akhlak tercela, maupun bersih hissiy, yaitu bersih dari najis dan hadats."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 108",
    "description": "Karena masjid tersebut dibangun dengan niat jahat, maka Allah melarang nabi Muhammad, janganlah engkau melaksanakan salat dan kegiatan apa pun di dalam masjid yang dibangun oleh orang-orang munafik itu untuk selama-lamanya. Sungguh, masjid yang didirikan atas dasar takwa, yakni ketulusan semata-mata karena Allah, sejak hari pertama dimulai pembangunannya, adalah lebih pantas, yakni wajar engkau melaksanakan salat di dalamnya. Di dalamnya ada orang-orang yang ingin, yakni senang membersihkan diri, jasmani dengan cara berwudu maupun rohani dengan cara bertobat dari dosa dan maksiat. Allah menyukai, melimpahkan karunia-Nya kepada orang-orang yang bersih di manapun mereka berada. Setelah dijelaskan perbandingan masjid yang di bangun rasulullah dengan masjid yang dibangun orang-orang munafik, lalu dijelaskan akhir riwayat kedua masjid tersebut dan orang-orang yang membangunnya. Maka apakah orang-orang yang mendirikan bangunannya atas dasar takwa kepada Allah dan keridaan-Nya itu yang lebih baik, ataukah orang-orang yang mendirikan bangunannya atas dasar kedurhakaan kepada Allah, sehingga laksana mendirikan bangunan di tepi jurang yang runtuh, lalu bangunan itu roboh bersama-sama dengan dia, pembangunnya masuk ke dalam neraka jahanam' Allah tidak memberi petunjuk, tidak memberi bimbingan kepada orang-orang yang zalim, karena mereka tidak mau menerima petunjuk."
  }
]