[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidaklah sama orang yang membangun bangunannya di atas ketakwaan kepada Allah ,ketaatan kepadaNya dan dalam rangka mencari keridhaanNya, dengan orang yang membangun bangunannya di tepi jurang yang hampir-hampir runtuh. Dia membangun masjid demi melancarkan mudarat, kekafiran dan memecah belah kaum muslimin, maka tindakan itu menyeretnya jatuh terjerumus kedalam neraka jahanam. Dan Allah tidaklah memberikan hidayah kepada orang-orang yang berbuat zhalim lagi melampaui batas-batasNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "109. Apakah sama antara orang yang mendirikan bangunannya atas dasar takwa kepada Allah dengan menjalankan perintah-perintah-Nya dan menjauhi larangan-larangan-Nya, dan atas dasar rida kepada Allah seraya mengerjakan amal kebajikan seluas-luasnya, dengan orang yang mendirikan masjid untuk mengganggu orang-orang Islam, memperkuat barisan orang-orang kafir, dan memecah belah barisan orang-orang mukmin? Keduanya sungguh berbeda. Yang pertama bangunannya kuat, kokoh, dan tidak dikhawatirkan runtuh. Sedangkan yang satunya, ibarat orang yang mendirikan bangunan di tepi jurang yang rapuh, kemudian bangunan tersebut jatuh bersamanya ke dalam Neraka Jahanam. Allah tidak akan membimbing orang-orang yang zalim sebab kekafirannya, kemunafikan, dan lain-lain ke jalan yang benar."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "109.Tidak sama antara bangunan yang didirikan menggunakan asas yang kokoh, yaitu ketakwaan dan keridhaan Allah, dengan bangunan yang didirikan di tepi jurang yang retak dan hampir roboh. Mereka membangun masjid Dhirar yang membawa kemudharatan dan kekafiran, sehingga membuat mereka terjerumus ke dalam neraka Jahannam. Allah tidak akan memberi taufik kepada orang-orang yang memusuhi kaum muslimin dan agama."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "109. أَفَمَنْ أَسَّسَ بُنْيٰنَهُۥ (Maka apakah orang-orang yang mendirikan mesjidnya) Yakni barangsiapa yang mendirikan bangunannya seperti dibangunnya masjid Quba dengan pondasi yang kuat dan kokoh, yaitu ketakwaan dan keridhaan kepada Allah, lebih baik daripada orang yang mendirikan bangunannya dengan kebalikan dari itu semua. Makna (الجرف) yakni apa yang dapat hanyut oleh aliran air, yaitu sisi-sisi lembah yang hanyut terbawa air. Dan makna (الهاري) yakni hampir-hampir roboh. فَانْهَارَ بِهِۦ فِى نَارِ جَهَنَّمَ ۗ (lalu bangunannya itu jatuh bersama-sama dengan dia ke dalam neraka Jahannam) Yakni bangunan itu runtuh ke neraka bersama dengan orang yang membangunnya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Barangsiapa yang menginginkan tingginya bangunan yang ia dirikan, maka hendaklah memperkuat pondasi dan struktur bangunannya; karena inti dari kekuatan suatu bangunan ada pada pondasi dan baiknya perancangan struktur, sebagaimana halnya seseorang yang memiliki cita-cita yang tinggi harus memperbaiki asas untuk menggapai keinginanya, sedangkan orang jahil yang mendirikan bangunan tanpa pondasi, niscaya bangunan itu tidak akan tinggal lama dan akan segera runtuh : { أَفَمَنْ أَسَّسَ بُنْيَانَهُ عَلَىٰ تَقْوَىٰ مِنَ اللَّهِ وَرِضْوَانٍ خَيْرٌ أَمْ مَنْ أَسَّسَ بُنْيَانَهُ عَلَىٰ شَفَا جُرُفٍ هَارٍ فَانْهَارَ بِهِ فِي نَارِ جَهَنَّمَ } \"Maka apakah orang-orang yang mendirikan mesjidnya di atas dasar takwa kepada Allah dan keridhaan-(Nya) itu yang baik, ataukah orang-orang yang mendirikan bangunannya di tepi jurang yang runtuh, lalu bangunannya itu jatuh bersama-sama dengan dia ke dalam neraka Jahannam\". 2 ). Terungkapnya misi buruk ahli bathil, dan munculnya mereka diatas hakikat identitas yang mereka bawa, memberikan kemudahan bagi penebar kebenaran membangun misi diatas tanah yang kuat, dan pondasi yang perkasa, bukan diatas keraguan dan jurang yang runtuh, amatilah firman Allah : { أَفَمَنْ أَسَّسَ بُنْيَانَهُ عَلَىٰ تَقْوَىٰ مِنَ اللَّهِ وَرِضْوَانٍ خَيْرٌ أَمْ مَنْ أَسَّسَ بُنْيَانَهُ عَلَىٰ شَفَا جُرُفٍ } \"Maka apakah orang-orang yang mendirikan mesjidnya di atas dasar takwa kepada Allah dan keridhaan-(Nya) itu yang baik, ataukah orang-orang yang mendirikan bangunannya di tepi jurang yang runtuh\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "109. Tidak sama antara orang yang membangun bangunan atas dasar akidah yang kuat yaitu takwa dan ridha kepada Allah dan orang yang membuat masjid karena kemudharatan kekufuran serta rawan jatuh di atas lembah yang dilewati air dan cenderung mudah jatuh. Ketika masjid itu runtuh atau jatuh, niscaya akan jatuh juga orang yang membangunnya ke dalam neraka Jahanam. Allah itu tidak menolong orang-orang kafir yang berbuat kerusakan menuju jalan kebenaran dan kebahagiaan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apakah orang-orang yang mendirikan bangunannya atas dasar takwa kepada Allah dan untuk mencari ridhaNya itu lebih baik, ataukah orang-orang yang mendirikan bangunannya di sisi tepian} tepi {jurang yang nyaris runtuh} jurang yang hampir jatuh {lalu bangunan itu runtuh bersama-sama dengan dia} lalu jurang itu runtuh bersama bangunan dan orang yang membaangunnya {ke dalam neraka Jahanam. Allah tidak memberi petunjuk kepada kaum yang zalim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "109. Kemudian Allah membandingkan antara masjid-masjid sesuai dengan maksud para penghuninya dan kesesuaiannya dengan keridhaan Allah. Dia berfirman, “Maka apakah orang-orang yang mendirikan masjidnya di atas dasar takwa kepada Allah,” yakni di atas niat baik dan ikhlas, “dan keridhaan (Nya),” yakni ia sesuai dengan perintahNya, dia menggabungkan antara ikhlas dan mutaba’ah dalam amalnya, “itu yang baik, ataukah orang-orang yang mendirikan bangunannya di tepi”, yakni di ujung, “jurang yang runtuh”, yakni yang rapuh, hampir-hampir roboh, “lalu bangunannya itu jatuh bersama-sama dengannya ke dalam Neraka Jahanam? Dan Allah tidak memberikan petunjuk kepada orang-orang yang zhalim”, yakni, Allah tidak memberikan petunjuk kepada apa yang menjadi kemaslahatan agama dan dunia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 109: Di ayat ini, Allah Subhaanahu wa Ta'aala membedakan masjid sesuai tujuan pembangunannya, antara masjid yang dibangun dengan niat yang ikhlas dan mengikuti perintah-Nya dengan masjid yang dibangun bukan karena itu. Ini merupakan perumpamaaan bangunan yang tidak dibangun di atas takwa. Pertanyaan di ayat ini adalah untuk taqrir (menetapkan)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 109",
    "description": "Setelah dijelaskan perbandingan masjid yang di bangun rasulullah dengan masjid yang dibangun orang-orang munafik, lalu dijelaskan akhir riwayat kedua masjid tersebut dan orang-orang yang membangunnya. Maka apakah orang-orang yang mendirikan bangunannya atas dasar takwa kepada Allah dan keridaan-Nya itu yang lebih baik, ataukah orang-orang yang mendirikan bangunannya atas dasar kedurhakaan kepada Allah, sehingga laksana mendirikan bangunan di tepi jurang yang runtuh, lalu bangunan itu roboh bersama-sama dengan dia, pembangunnya masuk ke dalam neraka jahanam' Allah tidak memberi petunjuk, tidak memberi bimbingan kepada orang-orang yang zalim, karena mereka tidak mau menerima petunjuksepanjang masa bangunan yang mereka dirikan itu senantiasa menjadi penyebab keraguan dalam hati mereka, yakni kemunafikan, karena niat dan motivasi mereka buruk, sampai hati mereka hancur, yaitu sampai mereka mati, sehingga tidak dapat bertobat lagi. Dan Allah maha mengetahui, segala sesuatu, mahabijaksana dalam ketetapan-Nya."
  }
]