[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apabila mereka meninggalkan peribadaahan kepada selain Allah, dan mengucapkan kaliamat tauhid, serta berpegang teguh dengan syariat-syariat islam, seperti menegakan shalat, dan membayar zakat, maka sesungguhnya mereka itu saudara-saudara kalian dalam islam. Dan kami menerangkan ayat-ayat dan menjelaskannya bagi kaum yang mau mengambil manfaan darinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Jika kemudian mereka bertobat kepada Allah dari kekafiran dengan mengucapkan dua kalimat syahadat, mendirikan salat, dan membayarkan zakat harta mereka, maka mereka menjadi orang Islam dan menjadi saudara-saudara kalian yang seiman. Mereka mempunyai hak dan kewajiban yang sama dengan kalian. Dan kalian tidak boleh memerangi mereka, karena keislaman mereka telah melindungi darah, harta, serta kehormatan mereka. Kami menerangkan dan menjelaskan ayat-ayat Kami kepada orang-orang yang mengerti. Karena merekalah yang bisa mendapatkan manfaat darinya dan membagikan manfaat itu kepada orang lain."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "11. Jika orang-orang musyrik yang Aku perintahkan kalian memerangi mereka itu berhenti dari kesyirikan mereka, dan beriman kepada Allah dan rasul-Nya, bertaubat dan melakukan ketaatan dengan menegakkan shalat dengan menyempurnakan syarat dan rukunnya dan membayar zakat yang diwajibkan; maka mereka menjadi saudara seagama kalian, mereka memiliki hak dan kewajiban yang sama dengan kalian. Dan dengan persaudaraan ini, lenyaplah permusuhan antara kalian. Kami menjelaskan hujjjah dan dalil-dalil kami atas makhluk-makhluk Kami bagi kaum yang memahami apa yang Kami jelaskan dengan terperinci."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "11. فَإِن تَابُوا (Jika mereka bertaubat) Dari kesyirikan, kemudian berpegang teguh pada hukum-hukum Islam, meninggalkan berhala Laata dan Uzza, dan bersaksi bahwa tiada tuhan selain Allah dan Muhammad adalah utusan Allah. فَإِخْوٰنُكُمْ فِى الدِّينِ (maka (mereka itu) adalah saudara-saudaramu seagama) Yakni orang Islam seperti kalian yang tidak boleh untuk kalian perangi. Ibnu Abbas berkata: ayat ini mengharamkan untuk memerangi atau menumpahkan darah orang yang mengerjakan shalat (orang Islam)."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11 Jika mereka bertaubat dari kesyirikan, mendirikan sholat fardhu dan menunaikan zakat, maka mereka itu adalah saudara-saudaramu seagama, muslim layaknya kalian. Haram memerangi mereka. Dan Kami menjelaskan ayat-ayat itu bagi kaum yang mengetahui hakikat dan maksud dari syariat, serta mengetahui bahwa itu adalah aturan dari Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Jika mereka beraubat, menegakkan shalat, dan menunaikan zakat, mereka adalah saudara-saudara kalian dalam agama. Kami merincikan} menjelaskan {ayat-ayat itu bagi kaum yang mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11. Maka belalah agamamu, menangkalah ia, jadikan orang-orang yang memusuhinya adalah musuh, dan orang yang menolongnya sebagai kawan, jadikanlah ada dan tidak adanya hukum berkisar padanya, jangan jadikan loyalitas dan permusuhan bersifat emosional yang mengikuti kecenderungan syahwat dan nafsu yang selalu menyuruh kepada keburukan. Oleh karena itu “jika mereka bertaubat”, dari kesyirikan mereka dan kembali kepada iman, “mendirikan shalat dan menunaikan zakat, maka mereka itu adalah saudara-saudaramu seagama.” Lupakanlah permusuhan tatkala mereka masih dalam kesyirikan, agar kalian menjadi hamba-hamba Allah yang ikhlas, dengan ini seorang hamba menjadi hamba yang sebenarnya. Manakala Allah menjelaskan hukum-hukumNya yang agung dan menerangkan berbagi hukum, serta hikmah, Dia berfirman, “dan kami menjelaskan ayat-ayat itu”, yakni menerangkan dan merincinya “bagi kamu yang mengetahui”, kepada mereka ucapan di tujukan, dengan mereka hukum-hukum dan ayat-ayat diketahui, dan dengan mereka syariat dan agama Islam dikenal. Ya Allah, jadikanlah kami termasuk orang-orang yang mengetahui dan beramal dengan apa yang kami ketahui dengan rahmatMu, kedermawananMu, kemurahanMu, dan kebaikanMu, ya Rabbil ‘alamin."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 11: Dari perbuatan syirk mereka kepada iman (masuk Islam)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 11",
    "description": "Namun, jika mereka bertobat dari perbuatan-perbuatan dosanya dan meninggalkan kekufuran dan kemusyrikan lalu masuk ke dalam islam, serta secara konsisten melaksanakan ajaran-ajaran islam dengan melaksanakan salat dan menunaikan zakat, maka berarti mereka itu adalah saudara-saudaramu seagama yang memiliki hak dan kewajiban yang sama untuk saling melindungi dan menyayangi. Kami menjelaskan ayat-ayat itu yang menjadi bukti wujud dan keesaan Allah bagi orangorang yang mengetahui, yakni mereka yang mau mengambil manfaat atas bukti-bukti tersebut. Melihat konteksnya, rangkaian ayat di atas berkenaan dengan perilaku buruk yahudi bani quraidhah. Meski begitu, ayat-ayat tersebut telah memberi ciri-ciri kefasikan yang sangat dibenci Allah, yaitu merusak atau mengkhianati perjanjian, tidak jujur, dan memutuskan hubungan kekerabatan. Jika pilihan bertobat ternyata tidak mereka hiraukan dan mereka tetap menunjukkan sikap permusuhan kepada umat islam, maka ayat ini memberikan pilihan lain, yaitu berperang. Dan jika mereka melanggar sumpah setelah ada perjanjian dengan kamu, dan mencerca agamamu, baik melalui sikap maupun ucapan, maka perangilah pemimpin-pemimpin kafir itu. Sesungguhnya mereka adalah orang-orang yang tidak dapat dipegang janjinya, sehingga menjadi sangat wajar jika perjanjian dengan mereka tidak dilanjutkan. Kalaulah mereka terus mengganggu, maka perangilah mudah-Mudahan mereka berhenti mengganggu dan menganiaya siapa pun."
  }
]