[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan bangunan masjid orang-orang munafik yang mereka bangun senantiasa menjadi sumber yang memadorotkan masjid quba dan bentuk keraguan dan kemunafikan yang tertanam di hati mereka hingga hati mereka hancur berkeping-keping akibat dibunuh, mati atau dengan penyesalan mereka yang tiada terkira atau bertaubat kepada tuhan mereka, serta ketakutan mereka kepadaNYa dengan sebenar-benarnya. Dan Allah mahamengetahui keadaan orang-orang munafik berupa keragu-raguan dan tujuan yang mereka maksud dalam niat-niat mereka, juga mahabijaksana dalam pengaturan urusan-urusan dan makhluk-makhlukNy."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "110. Masjid yang mereka bangun dengan niat jahat itu senantiasa menjadi pangkal keraguan dan kemunafikan yang menancap kuat di dalam hati mereka hingga hati mereka tercabik-cabik oleh kematian atau tewas di ujung pedang. Dan Allah Maha Mengetahui amal perbuatan hamba-hamba-Nya, lagi Maha Bijaksana dalam memutuskan balasan yang setimpal atas kebaikan atau keburukan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "110. Pembangunan dan penghancuran masjid Dhirar masih menjadi sebab keraguan dan bertambahnya kemunafikan dalam hati mereka hingga mereka mati karena kegalauan, atau sampai mereka menyesali perbuatan mereka yang penuh dengan tipu daya. Allah Maha Mengetahui niat dan keadaan seseorang, dan Maha Bijaksana dalam perkataan dan perbuatan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "110. لَا يَزَالُ بُنْيٰنُهُمُ الَّذِى بَنَوْا۟ رِيبَةً فِى قُلُوبِهِمْ (Bangunan-bangunan yang mereka dirikan itu senantiasa menjadi pangkal keraguan dalam hati mereka) Yakni keraguan dan kemunafikan. Orang-orang yang membangun masjid Dhirar adalah orang-orang munafik yang ragu terhadap agama mereka, dan keraguan mereka bertambah ketika Rasulullah menghancurkan masjid mereka dan membatalkan tipu daya mereka untuk menguatkan kekafiran dan karena kebencian terhadap Islam. إِلَّآ أَن تَقَطَّعَ قُلُوبُهُمْ ۗ( kecuali bila hati mereka itu telah hancur) Baik itu dengan kematian atau dengan pedang."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Proyek keji yang dikerjakan oleh orang-orang jahat adalah menunjukkan kebusukan hati mereka, dan antara proyek itu dan hati mereka memiliki hubungan yang sangat kuat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "110. Bangunan orang-orang munafik berupa masjid mudharat dan penghancurannya masih menjadi sebab keragu-raguan, kebingungan dan bertambahnya kemunafikan. Sesungguhnya bangunan itu merupakan jelmaan tabiat kemunafikan dan kekufuran. Dan penghancurannya mengakibatkan munculnya resolusi atas kekufuran, kebencian terhadap Islam dan kesedihan yang berlarut-larut dalam hati mereka sampai mereka mati atau terbunuh karena gelisah dan bersedih. Allah itu Maha Mengetahui tindakan hamba-hambaNya dan Maha Bijaksana dalam mengatur ciptaanNya dan membalas mereka atas amalnya baik atau buruk."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bangunan} masjid {yang mereka dirikan senantiasa menjadi penyebab keraguan} keraguan dan kemunafikan {dalam hati mereka kecuali hati mereka terpotong-potong} hati mereka terpecah belah dengan kematian dan dengan pedang {Allah Maha Mengetahui lagi Maha bijaksana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "110. “Bangunan-bangunan yang mereka dirikan itu senantiasa menjadi pangkal keraguan dalam hati mereka”, yakni kebimbangan yang bersemayam di dalam hati mereka. “Kecuali bila hati mereka itu telah hancur”, dengan penyesalan yang paripurna, bertaubat kepada Allah, dan takut kepadaNya dengan sangat. Dengan itu Allah akan memaafkan mereka, namun jika tidak, maka bangunan mereka tidak menambah kecuali keraguan di atas keraguan mereka, dan kemunafikan di atas kemunafikan mereka. “Dan Allah Maha Mengetahui”, segala hal, yang lahir dan yang batin, yang samar dan yang terang, serta apa yang dirahasiakan dan ditimpakan oleh hamba-hambaNya. “Lagi Mahabijaksana.” Dia tidak melakukan, tidak menciptakan, tidak memerintahkan, dan tidak melarang kecuali apa yang menjadi tuntutan hikmahNya dan Dia memerintahkannya. oleh karena itu segala puji hanya milik Allah. Di dalam ayat-ayat ini terkandung beberapa faaidah: Di antaranya: Haram membangun masjid dengan tujuan memudaratkan masjid lain yang di dekatnya, dan wajib merobohkan masjid dhirar tersebut jika maksud orang-orang yang membangunnya telah diketahui. Di antaranya: Walaupun suatu amal itu adalah baik, ia bisa dirubah oleh niat sehingga berubah menjadi dilarang, sebagaimana niat orang-orang yang membangun masjid dhirar telah merubah amal mereka seperti yang anda lihat. Di antaranya: bahwa segala hal yang menyebabkan perpecahan di antara orang-orang yang beriman adalah termasuk kemaksiatan yang harus ditinggalkan dan dilenyapkan, sebagaimana segala hal yang menyebabkan persatuan dan kekompakan kaum Muslimin haruslah diikuti, diperintahkan, dan didorong, karena Allah menjelaskan alasan pembangunan masjid dhirar dengan tujuan yang harus dilarang ini, sebagaimana hal itu mewajibkan kekufuran dan peperangan melawan Allah dan RasulNya. Di antaranya: Larangan shalat di tempat kemaksiatan dan kewajiban menjauhinya. Di antaranya: Bahwa kemaksiatan dapat mempengaruhi tempat, sebagaimana kemaksiatan orang-orang munafik mempengaruhi masjid dhirar, sehingga turun larangan shalat di dalamnya. Begitu pula ketaatan berpengaruh pada tempat, sebagaimana ia berpengaruh pada masjid Quba. Sehingga Allah berfirman \"“Sesungguhnya masjid yang didirikan atas dasar takwa (masjid Quba), sejak hari pertama italah yang lebih berhaq dilaksanakan ibadah disana\" Oleh karenanya masjid Quba memiliki keutamaan yang tidak dimiliki selainnya, bahkan Nabi selalu mengunjungi masjid Quba setiap hari Sabtu untuk shalat di dalamnya dan Nabi menganjurkan shalat di dalamnya. Di antaranya: Disimpulkan dari pernyataan illat-illat yang disebutkan di dalam ayat ini, empat kaidah penting yakni: semua perbuatan yang memudaratkan orang Muslim, atau padanya terdapat kemaksiatan kepada Allah, karena kemaksiatan adalah cabang dari kekufuran, atau menimbulkan perpecahan di kalangan orang-orang yang beriman, atau mengandung dukungan kepada kelompok yang memusuhi Allah dan RasulNya, maka ia haram dan dilarang, dan begitu sebaliknya. Di antaranya: Bahwa amalan-amalan lahir yang ditimbulkan karena kemaksiatan kepada Allah, akan senantiasa menjauhkan pelakunya dari Allah, ia sama dengan terus menerus melakukan kemaksiatan, sehingga dia menyingkirkannya dan bertaubat darinya dengan taubat yang sempurna, di mana hatinya terasa hancur karena menyesal dan bersedih. Di antaranya: Jika masjid Quba adalah masjid yang didirikan di atas dasar takwa, maka masjid Nabawi yang beliau dirikan dengan tangannya yang penuh berkah, dan Nabi bekerja di dalamnya serta Allah memilihnya untuknya, adalah lebih utama dan lebih layak (untuk dinyatakan bahwa ia didirikan di atas dasar takwa). Di antaranya: Bahwa amal yang dilandasi oleh keikhlasan dan mutaba’ah adalah amal yang dibangun di atas takwa yang membawa pelakunya kepada Surga yang penuh kenikmatan. Dan amal yang dilandasi maksud yang buruk, bid’ah, dan kesesatan, adalah amal yang dibangun ditepi jurang yang runtuh, lalu bangunannya itu jatuh bersama-sama dengannya ke dalam Neraka Jahanam, dan Allah tidak memberi petunjuk kepada orang-orang zhalim."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 110: Yakni sampai mereka mati. Bisa juga maksudnya bahwa bangunan yang mereka bangun itu menjadi sebab keraguan dalam hati mereka, kecuali jika mereka menyesal dengan penyesalan yang dalam seakan-akan hati mereka tersayat-sayat, bertobat kepada Tuhannya, dan takut kepada-Nya dengan sesungguhnya, maka Allah akan memaafkan mereka. Jika mereka tidak bertobat, maka yang mereka bangun akan terus menambah keraguan dan kemunafikan di hati mereka, nas’alullahas salaamah wal ‘aafiyah. Dari ayat di atas dapat diambil kesimpulan: - Membuat masjid dengan maksud menimbulkan bencana bagi masjid sebelahnya adalah haram, dan bahwa masjid tersebut mesti dirobohkan jika diketahui maksud dari pembangunannya. - Amal, meskipun saleh dapat dirubah oleh niat sehingga berubah menjadi terlarang. - Setiap keadaan yang mengakibatkan perpecahan antara kaum mukmin termasuk maksiat yang mesti ditinggalkan dan disingkirkan, sebagaimana keadaan yang menjadikan kaum mukmin bersatu harus diikuti, dan didorong melakukannya. - Larangan shalat di tempat-tempat maksiat, menjauhinya dan tidak mendekatinya. - Maksat dapat mempengaruhi tempat, sebagaimana maksiat kaum munafik berpengaruh pada masjid dhirar dan terlarangnya melakukan shalat di sana. - Demikian pula, bahwa ketaatan juga mempengaruhi tempat sebagaimana pada masjid Quba’. Oleh karena itu, masjid Quba’ memiliki kelebihan di atas masjid yang lain sehingga Rasulullah shallallahu 'alaihi wa sallam sering mengunjungi masjid Quba’ setiap hari Sabtu untuk shalat di situ, dan mendorong untuk melakukan shalat di sana. Jika masjid Quba’ yang dibangun atas dasar takwa demikian mulianya, apalagi masjid yang dibangun langsung oleh Nabi shallallahu 'alaihi wa sallam, yaitu masjid Nabawi. - Setiap perbuatan, jika di dalamnya terdapat hal yang membahayakan seorang muslim, atau di dalamnya terdapat maksiat kepada Allah, atau memecah belah kaum mukmin, atau membantu musuh Allah dan Rasul-Nya, maka perbuatan iu haram dilakukan. - Amalan yang dibangun atas dasar ikhlas dan mengikuti sunnah Rasulullah shallallahu 'alaihi wa sallam itulah amal yang dibangun atas dasar takwa, sedangkan amalan yang dibangun dengan niat yang buruk dan tidak mengikuti sunnah (di atas bid’ah) merupakan amal yang diangun di atas tepi jurang yang hampir roboh. Dia tidaklah berbuat, mencipta, memerintah, dan melarang kecuali sesuai hikmah-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 110",
    "description": "Sepanjang masa bangunan yang mereka dirikan itu senantiasa menjadi penyebab keraguan dalam hati mereka, yakni kemunafikan, karena niat dan motivasi mereka buruk, sampai hati mereka hancur, yaitu sampai mereka mati, sehingga tidak dapat bertobat lagi. Dan Allah maha mengetahui, segala sesuatu, mahabijaksana dalam ketetapan-Nya. Setelah dijelaskan orang yang mendirikan bangunan atas landasan kedurhakaan kepada Allah, maka pembangunnya akan hancur bersama bangunannya tersebut, lalu Allah memberi perumpamaan jual beli antara Allah dengan pejuang di jalan-Nya sebagaimana tertera pada ayat berikut: sesungguhnya Allah membeli dari orang-orang mukmin, yakni menjanjikan secara pasti kepada mereka yang secara tulus berjuang di jalan Allah, baik berupa diri, yakni jiwa maupun harta mereka, maka dengan pasti Allah akan memberikan balasan surga untuk mereka. Mereka berperang di jalan Allah dengan harta bahkan jiwa; sehingga mereka mem-bunuh atau terbunuh. Masuknya mereka ke dalam surga adalah merupakan janji yang benar dari Allah sebagaimana tertulis di dalam taurat, injil, dan Al-Qur'an. Dan siapakah yang lebih menepati janjinya selain daripada Allah' pasti tidak ada. Maka bergembiralah dengan jual beli yang telah kamu lakukan itu, sehingga kamu mendapatkan surga, dan demikian itulah kemenangan yang agung."
  }
]