[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya Allah membeli dari kaum mukminin jiwa-jiwa mereka dengan imbalan mereka mendapatkan surga sebagai gantinya dan apa yang Dia sediakan di dalamnya berupa kenikmatan; karena pengorbanan mereka dengan jiwa raga dan harta benda mereka dalam memerangi musuh-musuhNya untuk meninggikan kalimatNya dan menampakan agamaNYa, lalu mereka membunuh dan dibunuh, sebagai janji dariNya secara pasti di dalam taurat yang diturunkan kepada musa dan injil yang diturunkan kepada isa ,serta al-qur’an yang di turunkan kepada Muhammad .tidak ada seorangpun yang lebih menepati janji daripada Allah bagi orang yang memenuhi perjanjiannya kepada Allah. maka tampaklah kegembiraan (wahai kaum mukminin), dengan perniagaan kalian yang kalian jalin dengan Allah dan dengan apa-apa yang dijanjikan Allah bagi kalian berupa surga dan keridhaan. Perniagaan tersebut, itulah keberuntungan yang besar."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "111. \"Sesungguhnya Allah membeli jiwa orang-orang mukmin -padahal sebenarnya mereka adalah milik-Nya, untuk menunjukkan kemurahan-Nya kepada mereka- dengan harga yang sangat mahal, yaitu Surga. Mereka berperang melawan orang-orang kafir supaya kalimat Allah menjadi yang paling tinggi, kemudian mereka membunuh orang-orang kafir dan dibunuh oleh orang-orang kafir. Allah menjanjikan hal itu dengan janji yang benar di dalam Taurat, kitab suci Musa, Injil, kitab suci Isa -‘Alaihimassalām- dan Al-Qur`ān, kitab suci Muhammad -ṣallallāhu 'alaihi wa sallam-. Tidak ada yang lebih menepati janjinya selain Allah -Subḥānahu-. Maka bergembiralah dan bersuka citalah -wahai orang-orang mukmin- dengan akad jual-beli yang kalian lakukan dengan Allah itu, karena kalian benar-benar mendapatkan keuntungan yang sangat besar darinya dan jual-beli itu merupakan keberuntungan yang sangat besar.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "111. Allah berjanji dengan janji yang benar, bahwa Dia membeli dari orang-orang beriman jiwa dan harta mereka dengan surga. Allah menjadikan pahala bagi para mujahid yang berperang demi meninggikan kalimat Allah sebagai janji yang benar yang tertulis dalam Taurat, Injil, dan al-Qur’an. Dan tidak ada yang lebih memenuhi janji daripada Allah. Maka bergembiralah dengan jual beli yang penuh berkah yang Allah lakukan kepada kalian ini. Jual beli yang agung dan mulia ini merupakan kemenangan yang tidak tertandingi oleh apapun."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "111. إِنَّ اللهَ اشْتَرَىٰ مِنَ الْمُؤْمِنِينَ أَنفُسَهُمْ وَأَمْوٰلَهُم (Sesungguhnya Allah telah membeli dari orang-orang mukmin diri dan harta mereka) Setelah Allah menyingkap tipu daya orang-orang munafik, kemudian Allah menjelaskan keutamaan berjihad. Orang-orang yang berjihad menjual diri mereka kepada Allah untuk mendapatkan surga, mereka mengerahkan diri dan harta mereka untuk berjihad, dan Allah mengerahkan bagi mereka surga. فَيَقْتُلُونَ وَيُقْتَلُونَ ۖ (lalu mereka membunuh atau terbunuh) Mereka mendahulukan membunuh orang-orang kafir dalam perang dan mengerahkan segala kemampuan mereka, jika mereka telah melakukan itu maka mereka berhak mendapatkan surga; dan jika mereka terbunuh setelah menantang kematian dengan masuk ke barisan orang-orang kafir maka mereka juga berhak mendapatkan surga. وَعْدًا عَلَيْهِ حَقًّا فِى التَّوْرَىٰةِ وَالْإِنجِيلِ وَالْقُرْءَانِ ۚ( janji yang benar dari Allah di dalam Taurat, Injil dan Al Quran) Ini merupakan kabar dari Allah bahwa para mujahidin berhak mendapatkan surga dengan janji dari Allah dalam kitab-kitab-Nya yang telah diturunkan, yaitu dalam Taurat, Injil, dan al-Qur’an. وَمَنْ أَوْفَىٰ بِعَهْدِهِۦ مِنَ اللهِ (Dan siapakah yang lebih menepati janjinya (selain) daripada Allah?) Yakni tidak ada yang yang lebih menepati janjinya daripada Allah. Dia-lah yang benar janji-Nya, dan tidak akan mengingkari. فَاسْتَبْشِرُوا۟ بِبَيْعِكُمُ الَّذِى بَايَعْتُم بِهِۦ ۚ (Maka bergembiralah dengan jual beli yang telah kamu lakukan itu) Yakni tunjukkanlah kebahagiaan dengan jual beli ini karena kalian telah memperoleh keuntungan yang tidak pernah didapatkan seorangpun kecuali orang yang melakukan seperti apa yang kalian lakukan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Hamba yang berakal tidak melihat pada dirinya sesuatu yang berharga kecuali hanya jannah yang akan menantinya. 2 ). Sesungguhnya telah merugi orang yang menjual rumah mereka dari surga dengan sesuatu yang lebih murah dan hina, sedangkan orang-orang beriman menjual diri dan harta mereka yang merupakan titipan dari Allah dan mereka menjadikannya jaminan untuk surga; dan sesungguhnya mereka itu akan menggapai kemenangan yang besar, Allah berfirman : { إِنَّ اللَّهَ اشْتَرَىٰ مِنَ الْمُؤْمِنِينَ أَنْفُسَهُمْ وَأَمْوَالَهُمْ بِأَنَّ لَهُمُ الْجَنَّةَ }."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "111. Setelah menerangkan aib orang-orang munafik, Allah menjelaskan keutamaan jihad, yaitu mengganti jiwa dan harta dengan surga. Sesungguhnya Allah memberi pahala para mujahid berupa surga. Mereka terbunuh karena meninggikan kalimat dan agama Allah. Mereka membunuh orang-orang kafir dalam perang atau mati syahid. Allah memberi mereka janji yang benar dan pasti berupa surga dalam kitab-kitabNya yang telah diturunkan, yaitu Taurat, Injil dan Al-Qur’an. Tidak ada yang lebih baik dalam berjanji dan menepatinya selain Allah yang tidak pernah mengingkari janji. Maka tampakkanlah rahasia-rahasiamu wahai para mujahid dengan perniagaan dan ganti rugi ini. Sesungguhnya itu adalah penawaran yang menguntungkan. Kemenangan surga tersebut adalah kemenangan agung yang tidak ada bandingnya. Ayat ini turun ketika 70 orang berjanji kepada Rasulallah SAW di tembok besar kedua untuk beribadah hanya kepada Allah dan meninggalkan kesyirikan, dan Allah membalas mereka sebagai mana mereka mengorbankan diri dan harta mereka. Dan bayarannya adalah surga. Mereka berkata: “Keuntungan perniagaan tidak membuat kami jauh dan menyerah, maksudnya kami tidak akan mengingkari janji dan tidak mengharapkan balasan dari janji tersebut.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya Allah membeli dari orang-orang mukmin diri dan harta mereka dengan surga bagi mereka. Mereka berperang di jalan Allah sehingga mereka membunuh atau terbunuh. Itulah janji yang benar dari Allah di dalam Taurat, Injil, dan Al-Qur’an. Siapakah yang lebih menepati} tidak ada yang lebih besar kesetiaannya {janji daripada Allah. Maka bergembiralah} maka tunjukkanlah kebahagiaan {dengan jual beli yang telah kalian lakukan itu. Demikian itulah kemenangan yang agung"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "111. Allah mengabarkan suatu berita yang benar dan menjanjikan janji yang benar dengan jual beli dan tukar menukar yang agung, yaitu bahwa Dia “membeli dari orang-orang Mukmin, diri dan harta mereka.” Diri dan harta tersebut adalah harga dan barang yang dijual “dengan memberikan Surga untuk mereka”, yang di dalamnya terdapat segala yang diinginkan oleh jiwa dan yang dinikmati oleh mata, dari berbagai bentuk kenikmatan, kesenangan, kebahagiaan, bidadari-bidadari yang jelita, dan tempat tinggal yang indah. Bentuk akad dan jual belinya adalah hendaknya mereka mengorbankan jiwa dan harta mereka untuk Allah dalam berjihad melawan musuh-musuhNya, untuk meninggikan kalimatNya dan menampakkan agamaNya. “Mereka berperang pada jalan Allah, lalu mereka membunuh atau terbunuh.” Akad dan jual beli ini dinyatakan Allah dengan ditegaskan dengan berbagai penegasan. “(Itu telah menjadi) janji yang benar dari Allah di dalam Taurat, Injil, dan al-Quran.” Yang merupakan kitab paling mulia, paling sempurna, dan paling tinggi, yang hadir di dunia, ia dibawa oleh para Rasul ulul azmi paling sempurna, dan semuanya sepakat di atas janji yang benar ini. “Dan siapakah yang lebih menepati janjinya (selain) daripada Allah? Maka bergembiralah”, wahai orang-orang Mukmin yang melaksanakan apa yang telah Allah janjikan “dengan jual beli yang telah kamu lakukan itu”, yakni agar kamu berbahagia dengan itu, agar sebagian menyampaikan berita kepada sebagian yang lain, dan sebagian mendorong sebagian yang lain. “Dan itulah kemenangan yang besar”, yang tidak ada keberuntungan yang lebih besar dan lebih mulia darinya, karena ia mengandung kebahagiaan abadi dan nikmat yang langgeng, serta keridhaan Allah yang lebih besar daripada kenikmatan Surga. Jika kamu ingin mengetahui kadar transaksi perdagangan tersebut, maka lihatlah kepada pembeli, siapa dia? Dia-lah Allah, lihatlah gantinya, yaitu ganti yang paling agung dan paling mulia, Surga yang penuh dengan segala kenikmatan, lihatlah kepada harga yang dibayarkan padanya, yaitu jiwa dan harta yang merupakan sesuatu yang paling dicintai oleh manusia, lihatlah kepada orang yang mana jual beli ini terjadi melalui kedua tangannya, yaitu Rasul paling mulia, dengan kitab apa ia dicatat? Dengan Kitab Allah yang termulia yang dibawa oleh makhluk termulia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 111: Untuk mengerahkan semua itu dalam ketaatan kepada-Nya, seperti berjihad melawan musuh-Nya demi menegakkan kalimat-Nya dan memenangkan agama-Nya. Semua kitab yang besar ini sepakat terhadap janji tersebut. Yakni tidak ada yang paling memenuhi janji selain Allah. Yakni hendaknya kalian bergembira, dan memberitakan kepada yang lain serta memberkan dorongan. Di mana tidak ada keberhasilan yang lebih besar dan lebih agung selainnya, karena keberhasilan tersebut mengandung kebahagiaan yang abadi, kesenangan yang kekal, dan keridhaan dari Allah yang merupakan nikmat surga yang paling besar. Jika anda ingin memperhatikan betapa besarnya jual beli ini, maka perhatikanlah siapa yang membeli, gantinya, dan apa yang dibeli? Pembelinya adalah Allah Azza wa Jalla, gantinya adalah surga, dan yang dibeli adalah jiwa dan harta yang merupakan sesuatu yang paling dicintai manusia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 111",
    "description": "Setelah dijelaskan orang yang mendirikan bangunan atas landasan kedurhakaan kepada Allah, maka pembangunnya akan hancur bersama bangunannya tersebut, lalu Allah memberi perumpamaan jual beli antara Allah dengan pejuang di jalan-Nya sebagaimana tertera pada ayat berikut: sesungguhnya Allah membeli dari orang-orang mukmin, yakni menjanjikan secara pasti kepada mereka yang secara tulus berjuang di jalan Allah, baik berupa diri, yakni jiwa maupun harta mereka, maka dengan pasti Allah akan memberikan balasan surga untuk mereka. Mereka berperang di jalan Allah dengan harta bahkan jiwa; sehingga mereka mem-bunuh atau terbunuh. Masuknya mereka ke dalam surga adalah merupakan janji yang benar dari Allah sebagaimana tertulis di dalam taurat, injil, dan Al-Qur'an. Dan siapakah yang lebih menepati janjinya selain daripada Allah' pasti tidak ada. Maka bergembiralah dengan jual beli yang telah kamu lakukan itu, sehingga kamu mendapatkan surga, dan demikian itulah kemenangan yang agung. Mereka itu adalah orang-orang yang bertobat baik karena melakukan dosa maupun tidak melakukan dosa, beribadah secara berkesinambungan, memuji Allah sebagai rasa syukur, mengembara untuk tujuan kebaikan, rukuk, sujud, yakni salat sebagai wujud tunduk dan patuh kepada Allah, menyuruh berbuat makruf dan mencegah dari yang mungkar dan yang memelihara, yakni melaksanakan hukum-hukum Allah. Dan gembirakanlah orang-orang yang beriman yang mempunyai sifat-sifat yang sudah disebutkan."
  }
]