[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan diantara sifat kaum mukminin yang mendapatkan berita gembira berupa masuk kedalam surga, bahwa mereka adalah orang-orang yang bertaubat, dan kembali dari apa yang dibenci Allah menuju perkara yang dicintai Allah dan diridhaiNya, yang mengikhlaskan ibadah bagi Allah semata dan sungguh-sungguhan dalam ketaatan kepadaNya, yang memuji Allah dalam seluruh perkara yang Allah menguji mereka, dari kabaikan maupun keburukan, orang-orang yang berpuasa , yang rukuk dalam shalat mereka, bersujud di dalamnya, yang memerintahkan manusia dengan perkara yang diperintahkan Allah dan rasulNya dan melarang mereka dari setiap perkara yang Allah dan rasulNya melarang mereka darinya, yang mengerjakan kewajiban-kewajiban Allah, berhenti pada batas perintah dan laranganNya, menjalankan ketaatan kepadaNya lagi berdiri pada rambu-rambuNya. dan berilah kabar gembira (wahai nabi), kepada orang-orang mukmin yang memiliki sifat-sifat demikian dengan keridhaan Allah dan surgaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "112. Orang-orang yang mendapatkan balasan tersebut ialah orang-orang yang kembali dari apa yang Allah benci dan murkai, kepada apa yang Allah cintai dan ridai. Yang senantiasa tunduk takut kepada Allah dan merendahkan diri di hadapan-Nya, sehingga bersungguh-sungguh menaati-Nya. Mereka selalu memuji Tuhan-Nya dalam setiap keadaan, berpuasa, menunaikan salat, menyuruh melaksanakan apa yang diperintahkan oleh Allah atau rasul-Nya, melarang apa yang dilarang oleh Allah dan rasul-Nya, menjaga perintah-perintah Allah dengan mengikutinya dan waspada terhadap larangan-larangan-Nya dengan cara menjauhinya. Dan sampaikanlah -wahai Rasul- kepada orang-orang mukmin yang memiliki sifat-sifat seperti itu bahwa Allah akan memudahkan urusan mereka di dunia dan di Akhirat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "112. Dan sifat-sifat orang-orang beriman yang mendapat kabar gembira akan masuk surga adalah: Mereka senantiasa bertaubat dari dosa-dosa, banyak beribadah dengan ikhlas, memuji Allah dalam keadaan senang maupun susah, melakukan perjalanan untuk menuntut ilmu atau berperang, ruku’ dan sujud dalam shalat, menyeru orang lain kepada kebaikan dan petunjuk, melarang berbuat kerusakan dan kesesatan, dan senantiasa menjaga kewajiban-kewajiban dari Allah. Hai Rasulullah, berilah kabar gembira bagi orang-orang beriman yang memiliki sifat-sifat tersebut bahwa mereka akan mendapatkan surga-surga yang dipenuhi kenikmatan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "112. التّٰٓئِبُونَ (Mereka itu adalah orang-orang yang bertaubat) Mereka adalah orang-orang yang kembali kepada ketaatan kepada Allah dari perbuatan yang menyelisihi ketaatan kepada-Nya. الْعٰبِدُونَ(yang beribadat) Mereka adalah orang-orang yang menegakkan ibadah yang diperintahkan mereka dengan keikhlasan. الْحٰمِدُونَ(yang memuji) Yakni orang-orang yang memuji Allah dalam keadaan susah maupun senang. السّٰٓئِحُونَ(yang melawat) Terdapat pendapat mengatakan, mereka adalah orang-orang yang berpuasa. Pendapat lain mengatakan mereka adalah orang-orang yang berjihad. الرّٰكِعُونَ السّٰجِدُونَ(yang ruku’, yang sujud) Ykni orang-orang yang mendirikan shalat. الْاٰمِرُونَ بِالْمَعْرُوفِ(yang menyuruh berbuat ma’ruf) Yakni perbuatan baik sesuai syariat. وَالنَّاهُونَ عَنِ الْمُنكَرِ(dan mencegah berbuat munkar) Yakni perbuatan yang dilarang dalam syariat. وَالْحٰفِظُونَ لِحُدُودِ اللهِ ۗ( dan yang memelihara hukum-hukum Allah) Yakni orang-orang yang senantiasa menjaga syariat-syariat Allah yang Dia turunkan dalam kitab-kitab-Nya atau melalui lisan para Rasul-Nya. وَبَشِّرِ الْمُؤْمِنِينَ(Dan berilah kabar gambira pada orang-orang mukmin itu) Yakni orang-orang yang memiliki sifiat-sifat yang telah disebutkan. Mereka diberi kabar gembira berupa kebaikan-kebaikan di sisi Allah bagi mereka. Ibnu Abbas berkata: barangsiapa yang meninggal dalam Sembilan keadaan ini maka ia telah mati di jalan Allah."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Diantara ciri-ciri utama seorang yang bertaubat disebutkan di akhir surah at-taubah, Allah berfirman : { التَّائِبُونَ الْعَابِدُونَ } \"Mereka itu adalah orang-orang yang bertaubat, yang beribadat\" maka sudah seharusnya bagi seorang yang bertaubat untuk menyibukkan dirinya dalam ibadah dan amalan amalan akhirat. jika tidak maka nafsu selalu bergejolak, kalau tidak disibukkan dengan kebenaran maka dia akan di sibukkan dengan keburukan. maka seharusnya bagi orang yang bertaubat untuk mengganti waktu-waktu itu kepada waktu yang penuh dengan ketaatan, mengganti langkah langkah kemaksiatan kepada langkah ketaatan, selalu menjaga waktunya, langkahnya, kata katanya, dan senantiasa menjaga dirinya dari perkara membahayakannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "112. Para Mujahid mukmin yang dijanjikan dengan surga itu adalah orang-orang yang bertaubat dari kemaksiatan, ikhlas beribadah karena Allah, memujiNya dalam setiap sesuatu baik senang maupun menderita, selalu berusaha atau berpuasa dan berpikir tentang ayat-ayat Allah, selalu ruku’ dan bersujud, memerintahkan apa yang diperintahkan syariat berupa keimanan, ketaatan, dan akhlak mulia, mencegah perbuatan yang dilarang syariat berupa kekufuran, kemaksiatan dan perbuatan keji, menjaga syariat dan menerapkan hukum. Wahai Nabi, berilah kabar gembira kepada orang-orang mukmin dengan surga. Ibnu Abbas berkata: “Barangsiapa meninggal dalam 9 keadaan ini maka dia meninggal dalam keadaan di jalan Allah SWT.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang bertaubat, beribadah, memuji, mengembara} berpuasa {rukuk dan sujud} shalat {menyuruh pada kebaikan dan mencegah kemungkaran, serta memelihara hukum-hukum Allah} mengerjakan perintah Allah dan menjauhi laranganNya {Sampaikanlah kabar gembira kepada orang-orang yang beriman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "112. Seolah-olah dikatakan, siapakah orang-orang Mukmin yang memperoleh berita gembira dari Allah dengan surga dan kemuliaan? Mereka itu adalah “orang-orang yang bertaubat”, yaitu orang-orang yang selalu bertaubat dari seluruh kesalahan dalam setiap waktu “yang beribadah”, yang memiliki sifat ubudiyah kepada Allah, terus menerus menaatiNya dengan melakukan perkara-perkara yang wajib dan yang dianjurkan setiap saat. Dengan itu seorang hamba termasuk orang-orang yang beribadah “yang memuji (Allah)”, dalam keadaan susah, senang, mudah maupun sulit, mengakui nikmat-nikmat Allah atasnya, baik yang lahir dan yang batin, yang memuji Allah dengan menyebut nikmat dan dan menyebut Pemberi nikmat di malam dan siang hari “yang merawat”, ia ditafsirkan dengan puasa atau dengan menuntut ilmu, ditafsirkan pula dengan merawatnya hati untuk mengetahui Allah, mencintaiNya, dan selalu kembali kepadaNya. Dan yang benar adalah bahwa ia adalah bepergian untuk ibadah seperti haji, umrah, jihad, mencari ilmu, silaturahim, dan lain-lain. “Yang rukuk, yang sujud.” Yakni orang-orang yang memperbanyak shalat yang berisi rukuk dan sujud “yang menyuruh berbuat ma’ruf,” termasuk didalamnya adalah yang wajib dan yang dianjurkan “dan mencegah berbuat mungkar”, yaitu semua yang dilarang oleh Allah dan RasulNya. “Dan yang memelihara hukum-hukum Allah”, dengan mempelajari hukum-hukum yang diturunkan Allah kepada RasulNya dan apa yang masuk ke dalam perintah, larangan, dan hukum-hukum yang lain, serta apa yang tidak masuk ke dalam perkara tersebut, dan mereka senantiasa melakukan (yang diperintahkan) dan meninggalkan (yang dilarang). “Dan berilah kabar gembira orang-orang Mukmin itu.” Tidak disebutkan dengan apa mereka digembirakan, agar ia mencakup pahala dunia, agama, dan akhirat yang merupakan buah dari iman. Berita gembira ini meliputi setiap Mukmin. Adapun kadar dan sifatnya, maka ia sesuai dengan keadaan dan keimanan seorang Mukmin dari segi lemah, kuat, dan penerapan terhadap konsekuensinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 112: Seakan-akan disebutkan sebelumnya, “Siapakah kaum mukmin yang memperoleh berita gembira dari Allah dengan masuk ke dalam surga dan memperoleh berbagai karamah (keutamaan) itu?” Dari syirk maupun dari kemunafikan atau yang senantiasa bertobat dari semua kemaksiatan di setiap waktu. Yang beribadah dengan ikhlas lillah. Mereka senantiasa taat dengan mengerjakan kewajiban dan mengerjakan perkara yang dianjurkan di setiap waktu. Dalam setiap keadaan, baik di waktu lapang maupun sempit, yang mengenali nikmat-nikmat yang diberikan Allah kepada mereka baik yang nampak mapun yang tersembunyi, yang menyanjung-Nya dengan menyebut nama-Nya dan mengingat-Nya di waktu malam dan siang. Maksudnya mengembara untuk ibadah seperti mencari ilmu, berjihad, berhaji, berumrah, silaturrahim, dsb. Ada pula yang menafsirkan dengan orang yang berpuasa. Yakni yang banyak melakukan shalat. Perbuatan yang ma’ruf mencakup perbuatan wajib maupun sunat. Yakni semua yang dilarang Allah Subhaanahu wa Ta'aala. Dengan mempelajarinya dan mengamalkannya. Dengan surga."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 112",
    "description": "Mereka itu adalah orang-orang yang bertobat baik karena melakukan dosa maupun tidak melakukan dosa, beribadah secara berkesinambungan, memuji Allah sebagai rasa syukur, mengembara untuk tujuan kebaikan, rukuk, sujud, yakni salat sebagai wujud tunduk dan patuh kepada Allah, menyuruh berbuat makruf dan mencegah dari yang mungkar dan yang memelihara, yakni melaksanakan hukum-hukum Allah. Dan gembirakanlah orang-orang yang beriman yang mempunyai sifat-sifat yang sudah disebutkan. Usai menjelaskan sifat-sifat orang yang bertobat, Allah lalu menjelaskan manusia yang tidak layak dimohonkan ampunan Allah. Tidak pantas, yakni tidak pernah dan tidak mungkin terjadi bagi nabi dan orang-orang yang beriman untuk memohonkan ampunan kepada Allah bagi orang-orang musyrik, sekalipun orang-orang musyrik itu kaum kerabat-Nya, setelah jelas bagi mereka dengan kematian mereka dalam kemusyrikan, bahwa orang-orang musyrik itu penghuni neraka jahanam."
  }
]