[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidak sepatutnya bagi nabi Muhammad dan orang-orang mukmin untuk berdoa memohonkan ampunan bagi orang-orang musyrik, meskipun mereka adalah karib kerabat sendiri, setelah mereka mati di atas kesyirikan kepada Allah dan penyembahan terhadap berhala-berhala, dan telah jelas bagi mereka bahwa orang-orang itu adalah para penghuni neraka jahanam, lantaran mati diatas kesyirikan. Dan Allah tidak akan mengampuni kaum musyrikin, sebagaimana Allah berfirman إِنَّ اللَّهَ لَا يَغْفِرُ أَنْ يُشْرَكَ بِهِ “sesungguhnya Allah tidak akan mengampuni perbuatan syirik” (QS : an-nisa 48) dan sebagaimana Allah berfirman, إِنَّهُ مَنْ يُشْرِكْ بِاللَّهِ فَقَدْ حَرَّمَ اللَّهُ عَلَيْهِ الْجَنَّةَ ”sesungguhnya orang yang mempersekutukan (sesuatu dengan Allah), maka pasti Allah mengharamkan surga baginya.” (QS : al-maidah 72)"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "113. Tidak sepatutnya bagi seorang nabi dan orang-orang mukmin memohonkan ampunan kepada Allah untuk orang-orang musyrik, walaupun mereka adalah kerabat dekatnya, setelah mereka mengetahui dengan jelas bahwa orang-orang musyrik itu adalah penghuni Neraka karena mereka meninggal dunia dalam kemusyrikan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "113. Tidak berhak seorang nabi atau orang beriman memintakan ampunan kepada Allah bagi orang-orang musyrik, meskipun mereka adalah kerabat mereka, setelah mereka mati dalam keadaan syirik dan setelah menjadi jelas mereka adalah penghuni neraka; sebab Allah mengharamkan surga bagi mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "113. مَا كَانَ لِلنَّبِىِّ وَالَّذِينَ ءَامَنُوٓا۟ أَن يَسْتَغْفِرُوا۟ لِلْمُشْرِكِينَ (Tiadalah sepatutnya bagi Nabi dan orang-orang yang beriman memintakan ampun (kepada Allah) bagi orang-orang musyrik) Ketika sakaratul maut mendatangi Abu Thalib, Rasulullah mendatanginya sedang Abu Jahal dan Abdullah bin Abi Umayyah berada di sampingnya. Kemudian Rasulullah bersabda: “wahai pamanku, katakanlah Laa ilaaha illa Allah, agar aku dapat membelamu di hadapan Allah. Maka Abu jahal dan Abdullah bin Abu Umayyah berkata: wahai Abu Thalib apakah kamu membenci agama Abdul Mutthalib? Dan Rasulullah pun terus menawarkan kalimat tauhid kepadanya. Namun Abu Jahal dan Abdullah bin Abu Umayyah tetap mengelabuhinya dengan perkataan mereka itu. Dan Abu Thalib berkata sebagai kalimat terakhirnya bahwa ia tetap diatas agama Abdul Mutthalib, dan enggan utntuk mengucapkan kalimat Laa ilaaha illaa Allah. Kemudian Rasulullah bersabda: “sungguh aku benar-benar akan memohonkannya ampun kepada Allah, sebelum aku dilarang untuk itu”. Maka turunlah ayat: مَا كَانَ لِلنَّبِىِّ وَالَّذِينَ ءَامَنُوٓا۟ أَن يَسْتَغْفِرُوا۟ لِلْمُشْرِكِين وَلَوْ كَانُوٓا۟ أُو۟لِى قُرْبَىٰ “Tiadalah sepatutnya bagi Nabi dan orang-orang yang beriman memintakan ampun (kepada Allah) bagi orang-orang musyrik walaupun orang-orang musyrik itu adalah kaum kerabat(nya)” Ayat ini mengandung perintah untuk memutus hubungan tolong menolong dengan orang-orang kafir, serta haramnya memohonkan ampun bagi mereka, dan berdoa bagi mereka, dan menyolati jenazah mereka karena terkandung didalamnya permohonan ampun bagi mereka. Dan hubungan kekerabatan seperti ini tidaklah memiliki makna sebagaimana firman Allah kepada nabi Nuh tentang anaknya: قال يا نوح إنه ليس من أهلك إنه عمل غير صالح “Allah berfirman: “Hai Nuh, sesungguhnya dia bukanlah termasuk keluargamu (yang dijanjikan akan diselamatkan), sesungguhnya (perbuatan)nya perbuatan yang tidak baik” مِنۢ بَعْدِ مَا تَبَيَّنَ لَهُمْ أَنَّهُمْ أَصْحٰبُ الْجَحِيمِ(sesudah jelas bagi mereka, bahwasanya orang-orang musyrik itu adalah penghuni neraka jahanam) Karena mereka mati diatas kesyirikan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "113. Tidak sepatutnya bagi Nabi dan orang-orang mukmin itu memintakan ampunan untuk orang-orang musyrik meskipun mereka itu kerabat mereka, setelah tampak bagi mereka bahwa orang-orang musyrik itu penduduk neraka dengan keadaan mereka atas kekufuran. Ayat ini diturunkan terkait laki-laki yang memohonkan ampun bagi orang tuanya yang musyrik. Hal itu termasuk dalam larangan memintakan ampunan bagi orang-orang kafir dan mendoakan mereka mendapat kebaikan dan rahmat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidak ada} tidak pantas {bagi Nabi dan orang-orang yang beriman untuk memohonkan ampunan bagi orang-orang musyrik meskipun mereka ini kerabat} kerabat bagi mereka {setelah jelas bagi mereka bahwa sesungguhnya mereka adalah penghuni neraka Jahim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "113. Yakni, tidak layak dan tidak pantas bagi Nabi dan orang-orang yang beriman kepadanya “memintakan ampun (kepada Allah) bagi orang-orang musyrik”, yakni orang yang kafir kepadaNya dan menyembah selainNya bersamaNya “walaupun orang-orang musyrik itu adalah kaum kerabat (nya), sesudah jelas bagi mereka, bahwasanya orang-orang musyrik itu, adalah penghuni Neraka jahanam.” Karena memintakan ampun untuk mereka dalam keadaan ini adalah salah dan tidak berguna, maka ia patut dilakukan Nabi dan orang-orang yang beriman, karena jika mereka mati di atas kesyirikan, atau diketahui bahwa mereka mati di atasnya, maka telah wajib atasnya siksa, wajib atasnya kekal di dalam Neraka, syafaat pemberi syafaat dan permohonan ampunan orang-orang yang meminta ampunan tidak berguna baginya. Di samping itu, Nabi dan orang-orang yang beriman harus menyesuaikan diri dengan Allah dalam kecintaan dan kemarahan, mencintai orang yang dicintai oleh Allah, dan memusuhi orang yang dimusuhi oleh Allah, sedangkan memohon ampun bagi orang yang jelas bahwa mereka adalah penghuni Neraka adalah bertentang dan bertabrakan dengan itu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 113: Ayat ini turun karena permohonan ampunan Nabi shallallahu 'alaihi wa sallam untuk pamannya Abi Thalib dan permohonan ampunan sebagian sahabat untuk kedua ibu bapaknya yang musyrik. Imam Bukhari meriwayatkan dari Sa’id bin Al Musayyib dari bapaknya, bahwa bapaknya memberitahukan kepadanya, “Ketika Abu Thalib akan wafat, Rasulullah shallallahu 'alaihi wa sallam datang, dan Beliau mendapatkan di dekatnya ada Abu Jahal bin Hisyam dan Abdullah bin Abu Umayyah bin Al Mughirah. Rasulullah shallallahu 'alaihi wa sallam bersabda kepada Abu Thalib, “Wahai pamanku, katakan “Laailaahaillallah” sebagai suatu kalimat yang aku akan menjadi saksi bagimu di hadapan Allah.” Abu Jahal dan Abu Umayyah pun berkata, “Wahai Abu Thalib, apakah kamu benci agama Abdul Muththalib?” Maka Rasulullah shallallahu 'alaihi wa sallam tidak henti-hentinya menawarkan kepadanya, sedangkan keduanya juga mengulangi kata-kata tadi, sehingga kata-kata Abu Thalib yang terakhir kepada mereka adalah bahwa dia di atas agama Abdul Muththalib, ia menolak mengucapkan, “Laailaahaillallah.” Rasulullah shallallahu 'alaihi wa sallam bersabda, “Demi Allah, sesungguhnya aku akan memohonkan ampunan untukmu selama aku tidak dilarang.” Maka Allah Ta’ala menurunkan ayat tentangnya tersebut. Hal itu, karena memohonkan ampunan dalam keadaan seperti ini tidak bermanfaat, karena mereka mati di atas syirk atau diketahui bahwa mereka mati di atasnya, di mana ketetapan azab sudah pasti bagi mereka dan mereka mesti kekal di neraka. Syafaat maupun permohonan ampun tidaklah bermanfaat. Di samping itu, Nabi dan orang-orang yang beriman seharusnya mengikuti Tuhan mereka dalam hal ridha dan bencinya, berwala’ (mencintai) kepada mereka yang dicintai Allah dan berbara’ (membenci) mereka yang dimusuhi Allah, sedangkan memintakan ampunan kepada orang yang telah jelas sebagai penghuni neraka adalah bertentangan dengan hal itu. Kalau pun pernah dilakukan oleh kekasih Allah, yaitu Nabi Ibrahim ‘alaihis salam maka hal itu karena janji yang telah diikrarkan kepada bapaknya, dan hal itu ketika ia belum mengetahui akhir hidup bapaknya. Ketika Ibrahim mengetahui bahwa bapaknya dalah musuh Allah, ia akan mati di atas kekafiran, dan manfaat maupun peringatan tidak bermanfaat baginya, maka ia berlepas diri darinya karena mengikuti Tuhannya dan beradab terhadap-Nya. Dengan mati di atas kekafiran."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 113",
    "description": "Usai menjelaskan sifat-sifat orang yang bertobat, Allah lalu menjelaskan manusia yang tidak layak dimohonkan ampunan Allah. Tidak pantas, yakni tidak pernah dan tidak mungkin terjadi bagi nabi dan orang-orang yang beriman untuk memohonkan ampunan kepada Allah bagi orang-orang musyrik, sekalipun orang-orang musyrik itu kaum kerabat-Nya, setelah jelas bagi mereka dengan kematian mereka dalam kemusyrikan, bahwa orang-orang musyrik itu penghuni neraka jahanam. Adapun permohonan ampunan ibrahim kepada Allah untuk bapaknya yang berbeda agama dengan dia, tidak lain hanyalah karena suatu janji yang telah diikrarkannya kepada bapaknya bahwa ibrahim akan memintakan ampunan untuk bapaknya (lihat: surah maryam/19: 47). Maka ketika jelas bagi ibrahim bahwa bapaknya adalah musuh Allah karena tetap dalam kemusyrikan dan kesesatan, maka ibrahim berlepas diri darinya walau dengan berat hati. Sungguh, ibrahim itu seorang yang sangat lembut hatinya, sangat takut kepada Allah lagi penyantun, yakni penyabar, mampu meredam kemarahan dan sikap buruk kepada orang lain."
  }
]