[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan bukanlah permohonan ampunan Ibrahim alaihisalam bagi bapaknya yang musyrik, kecuali sekedar memenuhi janji yang dia janjikan kepadanya semata, yaitu dalam firman Allah, سَأَسْتَغْفِرُ لَكَ رَبِّي ۖ إِنَّهُ كَانَ بِي حَفِيًّا ”aku akan memintakan ampun bagimu kepada tuhanku. Sesungguhnya Dia sangat baik kepadaku.” (Maryam 47) Lalu tatkala menjadi jelas bagi Ibrahim , bahwa ayahnya adalah musuh Allah, dan nasihat dan peringatan tidak berguna lagi baginya, dan dia akan mati sebagai orang kafir, Ibrahim meningalkannya dan meninggalkan permohonan ampunan baginya serta berlepas diri darinya. Sesungguhnya Ibrahim sangat besar ketundukannya kepada Allah dan banyak berlapangdada menghadapi apa yang keluar bersumber dari tingkah kaumnya berupa kekeliruan-kekeliruan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "114. Permohonan ampunan yang dilakukan Ibrahim untuk bapaknya tidak lain disebabkan oleh janji Ibrahim kepada bapaknya, bahwa ia benar-benar akan memohonkan ampunan kepada Allah untuk bapaknya agar mau menganut Islam. Kemudian tatkala Ibrahim mengetahui dengan jelas bahwa bapaknya adalah musuh Allah karena ia enggan menerima nasihat yang baik, atau karena ia mengetahui dari wahyu bahwa bapaknya akan mati sebagai orang kafir, maka Ibrahim berlepas diri darinya. Dan permohonan ampunan yang dilakukan oleh Ibrahim itu adalah hasil ijtihadnya sendiri, bukan melawan hukum yang Allah wahyukan kepadanya. Sesungguhnya Ibrahim -‘Alaihissalām-, sosok orang yang rajin berdoa kepada Allah dan suka memaafkan kaumnya yang berbuat semena-mena kepadanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "114. Nabi Ibrahim pernah memohonkan ampun bagi ayahnya, Azar karena dia telah menjanjikannya sebelumnya. Namun setelah jelas bagi Nabi Ibrahim bahwa ayahnya adalah musuh Allah kerena tetap dalam kekafiran; maka Nabi Ibrahim berlepas diri darinya dan tidak lagi memohonkan ampun baginya. Sesungguhnya Nabi Ibrahim banyak bertaubat, banyak berdoa dan memohon ampun kepada Allah, dan sangat sabar terhadap orang yang menyakitinya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "114. وَمَا كَانَ اسْتِغْفَارُ إِبْرٰهِيمَ لِأَبِيهِ إِلَّا عَن مَّوْعِدَةٍ وَعَدَهَآ إِيَّاهُ (Dan permintaan ampun dari Ibrahim (kepada Allah) untuk bapaknya tidak lain hanyalah karena suatu janji yang telah diikrarkannya kepada bapaknya itu) Ketika nabi Ibrahim berkata kepada Ayahnya “sungguh aku akan memohonkan ampun untukmu” (lihat surat al-Mumtahanah:4). Dan janjinya untuk memohonkan ampun untuk ayahnya sebelum jelas bahwa ia merupakan penghuni neraka dan termasuk musuh Allah. إِنَّ إِبْرٰهِيمَ لَأَوّٰهٌ (Sesungguhnya Ibrahim adalah seorang yang sangat lembut hatinya) Yakni tunduk dan patuh, yang apabila diingatkan tentang kesalahan-kesalahannya ia merasa bersalah dan terbebani, dengan mengatakan: ahh, duhai dosa-dosaku; aah, aku akan disiksa karena dosa-dosa itu. حَلِيمٌ (lagi penyantun) Yakni orang yang memaafkan kesalahan dan bersabar atas perbuatan buruk orang lain kepadanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "114. Tidaklah permohonan ampun Ibrahim untuk ayahnya yang kafir itu kecuali hanyalah janji terdahulu yang dia berikan untuk ayahnya sebelum dijelaskan bahwa dia (ayahnya) termasuk penduduk neraka dan musuh Allah dalam firmanNya {Laastaghfirunna laka} [QS Al-Mumtahanah 60/4], lalu ketika tampak bagi Ibrahim bahwa ayahnya adalah musuh Allah karena keteguhannya atas kekufuran, dia berlepas diri dan tidak memintakan ampun lagi untuknya. Sesungguhnya Ibrahim itu selalu memohon, meminta dan menunduk kepada Allah, pemaaf atas dosa, dan sabar atas penderitaan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan tidaklah permohonan ampun Ibrahim untuk bapaknya, melainkan karena suatu janji yang telah dia ikrarkan kepadanya} karena janji yang telah lalu dari Ibrahim kepada ayahnya untuk memohonkan ampun {Maka ketika jelas baginya bahwa dia} bapaknya {adalah musuh Allah, Ibrahim berlepas diri darinya. Sesungguhnya Ibrahim benar-benar orang yang sangat lembut} benar-benar orang yang sangat tunduk kepada Allah {lagi santun} suka memaafkan yang memberinya sesuatu yang buruk"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "114. Kalaupun ada istigfar dari Khalil ar-Rahman , Ibrahim (kepada Allah) untuk ayahnya, maka itu “tidak lain hanyalah karena suatu janji yang telah diikrarkannya kepada bapaknya itu.” Yaitu perkataannya, “Aku akan meminta ampun bagimu kepada Rabbku. Sesungguhnya Dia sangat baik kepadaku.” (Maryam:47). Hal itu sebelum Ibrahim mengetahui akhir hidup bapaknya. “Maka tatkala jelas” bagi Ibrahim bahwa bapaknya itu, “adalah musuh Allah”, mati di atas kekufuran, dan nasihat serta peringatan tidak berguna baginya, “maka Ibrahim berlepas diri darinya.” Menyesuaikan diri dengan Rabbnya dan beradab di hadapanNya. “Sesungguhnya Ibrahim adalah seorang yang sangat lembut hatinya”, yakni yang selalu kembali kepada Allah dalam segala perkara, banyak berdzikir, berdoa, istighfar, dan bertaubat kepadaNya. “Lagi penyantun.” Yakni, memiliki sifat kasih sayang kepada makhluk, memaafkan kesalahan mereka kepadanya, tidak terpicu oleh perbuatan bodoh orang yang bodoh, dan tidak membalas orang yang berbuat jahat kepadanya dengan kejahatan. Bapaknya berkata kepadanya, “Niscaya kamu akan kurajam.” (Maryam:46). Sedangkan Ibrahim menjawab, “Semoga keselamatan dilimpahkan kepadamu, aku akan meminta ampun bagimu kepada Rabbku.” (Maryam:47). Maka kamu harus mengikuti dan meneladani agama Ibrahim dalam segala sesuatu, kecuali ucapan Ibrahim kepada baapaknya, “Aku benar-benar akan memohonkan ampunan (kepada Allah) untukmu.” (Al-Mumtahanah:4). Sebagaimana Allah telah memperingatkan itu dan yang lainnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 114: Yaitu ketika Ibrahim berkata kepada bapaknya, “Aku akan memohonkan ampunan bagimu kepada Tuhanku.” (lihat Maryam: 47) dengan harapan bapaknya mau masuk Islam. Dengan mati di atas kekafiran. Dan tidak memohonkan ampunan untuknya. Sangat sering merendahkan diri dan berdoa, ia sangat sering kembali kepada Allah dalam segala urusan, banyak berdzikr, berdoa, beristighfar dan kembali kepada Tuhannya. Yakni sabar terhadap gangguan dan memaafkan orang lain. Oleh karena itu, ikutilah jejak langkah Nabi Ibrahim semuanya, selain dalam hal doa Ibrahim untuk bapaknya yang musyrik (lihat Al Mumtahanah: 4)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 114",
    "description": "Adapun permohonan ampunan ibrahim kepada Allah untuk bapaknya yang berbeda agama dengan dia, tidak lain hanyalah karena suatu janji yang telah diikrarkannya kepada bapaknya bahwa ibrahim akan memintakan ampunan untuk bapaknya (lihat: surah maryam/19: 47). Maka ketika jelas bagi ibrahim bahwa bapaknya adalah musuh Allah karena tetap dalam kemusyrikan dan kesesatan, maka ibrahim berlepas diri darinya walau dengan berat hati. Sungguh, ibrahim itu seorang yang sangat lembut hatinya, sangat takut kepada Allah lagi penyantun, yakni penyabar, mampu meredam kemarahan dan sikap buruk kepada orang lain. Dan Allah yang mahaadil, mahabijaksana sekali-kali tidak akan menyesatkan suatu kaum, setelah mereka diberi-Nya petunjuk dengan memeluk islam, sehingga dapat dijelaskan kepada mereka apa yang harus mereka jauhi. Apabila sudah dijelaskan apa yang harus dijauhi lalu mereka melanggar, maka Allah akan memberi hukuman akibat kedurhakaan itu. Sungguh, Allah maha mengetahui segala sesuatu yang terjadi di langit dan di bumi."
  }
]