[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Allah tidaklah menyesatkan satu kaum setelah melimpahkan hidayah dan taufik pada mereka hingga menjelaskan pada mereka dengan apa mereka harus takut kepadaNya dan apa yang mereka butuhkan dalam pokok-pokok agama maupun cabang-cabangnya. Sesungunya Allah mahamengetahui segala sesuatu. Sungguh Dia telah mengajarkan kepada kalian apa yang dahulu belum kalian ketahui dan menerangkan kepada kalian hal-hal yang dapat kalian ambil manfaatnya dan menegakkan hujjah di hadapan kalian dengan menyampaikan risalahNYa kepada kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "115. Allah tidak akan menjatuhkan vonis sesat kepada kaum yang telah diberi-Nya petunjuk sebelum Dia menjelaskan kepada mereka larangan-larangan yang harus mereka jauhi. Apabila mereka melanggar larangan-larangan itu setelah mereka mengetahuinya maka Allah akan menjatuhkan vonis sesat kepada mereka. Sesungguhnya Allah Maha Mengetahui segala sesuatu, tidak ada sesuatu pun yang luput dari pengetahuan-Nya dan Dia telah mengajarkan kepada kalian apa-apa yang dahulu tidak kalian ketahui."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "115. Jika Allah memberi hidayah kepada suatu kaum, maka sesungguhnya Dia akan menyempurnakan kebaikan bagi mereka dan menjelaskan syariat yang mereka butuhkan agar menjadi orang-orang yang bertakwa. Allah Maha Mengetahui segala sesuatu dan Maha Mengetahui orang yang berhak mendapat hidayah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "115. وَمَا كَانَ اللهُ لِيُضِلَّ قَوْمًۢا بَعْدَ إِذْ هَدَىٰهُمْ حَتَّىٰ يُبَيِّنَ لَهُم مَّا يَتَّقُونَ ۚ (Dan Allah sekali-kali tidak akan menyesatkan suatu kaum, sesudah Allah memberi petunjuk kepada mereka sehingga dijelaskan-Nya kepada mereka apa yang harus mereka jauhi) Yakni Allah tidak menimpakan kesesatan kepada suatu kaum setelah Dia memberi petunjuk bagi mereka kepada keislaman dan menjalankan syariat-syariatnya, selama mereka tidak melakukan suatu hal yang diharamkan dengan sengaja, setelah jelas bagi mereka bahwa hal itu diharamkan. Namun apabila hal tersebut belum jelas bagi mereka maka tidak ada dosa atas mereka dan mereka tidak akan disiksa karena hal itu. Yakni janganlah kalian memohonkan ampun bagi orang-orang musyrik meski mereka adalah kerabat kalian, karena hubungan kekerabatan tidak dapat memberi manfaat bagi mereka sebab telah dijelaskan kepada mereka apa yang menjadikan mereka bertakwa namun mereka tetap tidak mau bertakwa kepada Allah dan tidak pula beriman kepada-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "115. Dan tidaklah dalam ketentuan Allah itu berinteraksi dengan suatu kaum menggunakan cara muamalah orang-orang sesat, dimana Dia (Allah) serta merta menghukum mereka setelah memberi petunjuk mereka pada keimanan, sehingga Dia menjelaskan kepada mereka kewajiban untuk mewaspadai sesuatu yang haram. Sesungguhnya Allah Maha Mengetahui setiap sesuatu yang terjadi berupa keistiqamahan dan kemaksiatan, serta ampunan dan hukuman. Jika manusia tidak bertakwa kepada Tuhannya, niscaya Dia menentukan kesesatan atas mereka dan mereka layak menerimanya. Tidak ada dosa dan hukuman atas mereka sebelum adanya penjelasan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Allah sekali-kali tidak akan menyesatkan suatu kaum} tidak memutuskan suatu kesesatan atas suatu kaum {setelah Dia memberi mereka petunjuk} setelah Dia menuntun mereka menuju petunjuk {sampai Dia menjelaskan kepada mereka apa yang harus mereka jauhi} sesuatu yang harus mereka jauhi berupa hal-hal yang diharamkan syariat {Sesungguhnya Allah Maha Mengetahui segala sesuatu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "115. Yakni, bahwa Allah jika memberi nikmat hidayah kepada suatu kaum, dan DIa memerintahkan mereka meniti jalan yang lurus, maka Dia menyempurnakan kebaikanNYa kepada mereka, serta menjelaskan kepada mereka segala apa yang mereka perlukan dan buutuhkan. Dia tidak membiarkan mereka dalam keadaan sesat dan tidak mengetahui perkara agama mereka. Ini mengandung dalil atas kesempurnaan rahmatNYa dan bahwa syariatNYa meliputi segala apa yang oleh manusia dalam masalah pokok-pokok maupun cabang-cabangnya. Ada kemungkinan bahwa maksud dari hal itu adalah, “Dan Allah sekali-kali tidak akan menyesatkan suatu kaum, sesudah Allah memberi petunjuk kepada mereka hingga dijelaskanNYa kepada mereka apa yang harus mereka jauhi.” Jika Allah menjelaskan apa yang mesti mereka hindari, lalu mereka tidak tunduk kepadaNya, maka Dia menghukum mereka dengan kesesatan sebagai balasan atas penolakan mereka terhadap kebenaran yang jelas. Namun kemungkinan tafsir yang pertama itu lebih utama. “Sesungguhnya Allah Maha Mengetahui segala sesuatu.” Karena ilmuNYa yang sempurna dan menyeluruh, Dia mengajarkan kepadamu apa yang tidak kamu ketahui dan menjelaskan apa yang bermanfaat bagimu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 115: Kepada Islam. Maksudnya seorang hamba tidak akan diazab oleh Allah semata-mata karena kesesatannya, melainkan karena hamba itu melanggar perintah-perintah yang sudah diberitahukan kepadanya. Mereka telah diberitahukan amal yang harus mereka kerjakan, namun mereka malah melanggarnya, sehingga mereka pantas untuk disesatkan. Dalam ayat ini terdapat dalil yang menunjukkan sempurnanya rahmat-Nya, dan bahwa syari’at-Nya sangat sempurna menerangkan semua yang dibutuhkan manusia baik dalam masalah ushul (dasar-dasar) agama maupun dalam masalah furu’ (cabang). Dalam ayat ini juga terdapat ancaman, bahwa barang sapa yang telah diterangkan kepadanya jalan-jalan hidayah, namun tidak ditempuhnya, maka hukumannya adalah disesatkan sebagai balasan terhadap penolakannya terhadap kebenaran. Dia mengetahui siapa di antara mereka yang berhak diberi hidayah dan siapa yang berhak disesatkan-Nya. Karena sempurna ilmu-Nya, Dia mengajarkan kepada kamu apa saja yang belum kamu ketahui dan menerangkan hal yang bermanfaat bagimu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 115",
    "description": "Dan Allah yang mahaadil, mahabijaksana sekali-kali tidak akan menyesatkan suatu kaum, setelah mereka diberi-Nya petunjuk dengan memeluk islam, sehingga dapat dijelaskan kepada mereka apa yang harus mereka jauhi. Apabila sudah dijelaskan apa yang harus dijauhi lalu mereka melanggar, maka Allah akan memberi hukuman akibat kedurhakaan itu. Sungguh, Allah maha mengetahui segala sesuatu yang terjadi di langit dan di bumi. Sesungguhnya Allah memiliki kekuasaan di langit dan bumi serta apa yang ada di antara keduanya. Dia yang menciptakan, menghidupkan, memelihara dan mematikan bila ajalnya sudah sampai. Tidak ada pelindung yang menghindarkan mudarat dan penolong yang mendatangkan manfaat bagimu selain Allah."
  }
]