[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya Allah adalah pemilik langit dan bumi dan segala yang ada didalamnya, tidak ada sekutu bagiNya dalam penciptaan, pengaturan dan ibadah serta penetapan syariat. Dia menghidupkan siapa saja yang dikehendakiNya, dan Dia mematikan siapa yang dikehendakiNya. Dan kalian tidak memiliki siapapun selain Allah yang akan menangani urusan kalian, tidak ada penolong yang akan menolong kalian menghadapi musuh kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "116. Sesungguhnya Allah adalah pemilik kerajaan langit dan kerajaan bumi dan tidak ada sekutu bagi-Nya dalam kedua keraajan tersebut. Tidak ada sesuatu pun yang luput dari pengetahuan-Nya. Dia dapat menghidupkan siapa saja yang Dia kehendaki. Dia dapat mematikan siapa saja yang Dia kehendaki. Sedangkan kalian -wahai manusia- tidak mempunyai pengurus yang mengurus urusan-urusan kalian dan tidak mempunyai pelindung yang dapat melindungi kalian dari semua keburukan dan dari musuh-musuh kalian selain Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "116. Allah adalah pemilik kerajaan yang ada pada tujuh langit dan tujuh bumi, Dia menghidupkan dan mematikan siapa yang Dia kehendaki. Hai Manusia, tidak ada selain Allah yang dapat menolong kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "116. Sesungguhnya Allah itu Maha Merajai langit, bumi dan apa yang ada di antara keduanya. Miliknya juga kewenangan mutlak atas keduanya. Wahai manusia tidak ada satupun yang menjaga kalian, mengatur urusan kalian, menyelamatkan kalian di waktu sengsara, serta mencegah mara bahaya selain Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya hanya milik Allah kerajaan langit dan bumi. Dia menghidupkan dan mematikan. Tidak ada pelindung dan penolong bagi kalian selain Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "116. “Sesungguhnya kepunyaan Allah-lah kerajaan langit dan bumi. Dia menghidupkan dan mamatikan.” Yakni, Dia-lah Pemiliknya, yang mengatur hamba-hambaNYa dengan menghidupkan dan mematikan serta aturan-aturan ilahiyah yang lain. Jika tidak ada aturan takdirNya yang cacat maka bagaimana mungkin ada aturan agamaNya yang cacat, yang berkaitan dengan uluhiyahNYa dan Dia membiarkan hamba-hambaNya begitu saja atau membiarkan mereka tersesat dan bodoh, padahal itu adalah perhatian terbesar dariNYa kepada hamba-hambaNya, oleh karena itu Dia berfirman, “Dan sekali-kali tidak ada pelindung dan penolong bagimu selain Allah.” Yakni pelindung yang melindungimu dengan mendatangkan manfaat bagimu atau penolong yang menolak mudarat darimu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 116: Allah Subhaanahu wa Ta'aala yang yang memiliki langit dan bumi, Dia mengatur hamba-Nya, baik dengan menghidupkan maupun mematikan dan bentuk pengaturan ilahiyyah lainnya. Jika Dia tidak melalaikan pengaturan yang sifatnya qadari di alam semesta, lantas bagaimana mungkin Dia melalaikan pengaturan yang sifatnya agama yang terkait dengan ketuhanan-Nya dan membiarkan hamba-hamba-Nya begitu saja atau membiarkan hamba-hamba-Nya tersesat dan tidak tahu jalan, padahal yang demikian merupakan bentuk pengaturan yang paling agung?"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 116",
    "description": "Sesungguhnya Allah memiliki kekuasaan di langit dan bumi serta apa yang ada di antara keduanya. Dia yang menciptakan, menghidupkan, memelihara dan mematikan bila ajalnya sudah sampai. Tidak ada pelindung yang menghindarkan mudarat dan penolong yang mendatangkan manfaat bagimu selain Allah. Pada ayat ini dijelaskan salah satu wujud rahmat Allah. Sungguh, Allah telah menerima tobat nabi, orang-orang muhajirin dan orang-orang ansar, yang mengikuti nabi pada masa-masa sulit ketika perang tabuk yang terjadi antara kaum muslim dengan orang-orang romawi pada tahun ke-10 h, saat itu lagi musim paceklik dan cuaca sangat panas, setelah hati segolongan dari mereka hampir berpaling dari kebenaran akibat masa sulit yang mereka alami, kemudian Allah menerima tobat mereka. Sesungguhnya Allah maha pengasih kepada semua hamba-Nya, terlebih kepada orangorang yang bertobat, maha penyayang, yakni mencurahkan rahmat-Nya kepada mereka."
  }
]