[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sungguh Allah telah memberikan taufik kepada nabiNya, Muhammad untuk kembali(inabah) dan taat kepaadNya, dan Allah telah menerima taubat kaum muhajirin yang berhijrah meninggalkan kampung halaman mereka dan keluarga besar mereka menuju negeri islam. Dan Allah menerima taubat para penolong rasulullah (kaum anshar) yang keluar bersama beliau untuk memerangi musuh-musuh pada perang tabuk di musim yang sangat panas dan kekurangan perbekalan dan tunggangan. Sesungguhnya Allah telah menerima taubat mereka semua setelah sebagian hati mereka hampir-hampir melenceng dari kebenaran, lebih cenderung kepada santai dan berleha-leha. Akan tetapi Allah meneguhkan mereka dan menguatkan mereka, serta menerima taubat mereka, sesungguhnya Dia banyak sekali kasih sayangNya kepada mereka baik di dunia dan di akhirat. Dan diantara bentuk rahmatNya kepada mereka, adalah Dia melimpahkan karunia kepada mereka untuk bertaubat dan menerimanya dari mereka dan meneguhkan mereka di atasnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "117. Sungguh Allah telah menerima tobat Nabi Muhammad -ṣallallāhu 'alaihi wa sallam- tatkala ia mengizinkan orang-orang munafik untuk tidak ikut serta dalam perang Tabuk. Dan sungguh Allah telah menerima tobat kaum Muhajirin dan Ansar yang tidak mangkir darinya, melainkan ikut serta dalam perang Tabuk, meskipun cuaca sangat panas, perbekalan sangat sedikit dan musuh sangat kuat, setelah hati sebagian dari mereka berniat untuk meninggalkan perang akibat beratnya situasi yang sedang mereka hadapi. Kemudian Allah memberikan bimbingan untuk bertahan dan tetap pergi ke medan perang. Allah pun menerima tobat mereka, karena sesungguhnya Dia -Subḥānahu- Maha Penyantun lagi Maha Penyayang kepada mereka. Salah satu bentuk kasih sayang-Nya ialah Dia membimbing mereka untuk bertobat dan menerima tobat mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "117. Sungguh Allah telah mengaruniakan ketaatan kepada Nabi, dan mengampuni para sahabat dari kalangan Muhajirin dan Anshar yang mengikuti Rasulullah dalam perang Tabuk, meski cuaca sangat panas dan perjalanan sangat jauh; sehingga Allah tidak menghukum mereka karena melakukan beberapa kesalahan pada perang tersebut. Padahal hati mereka hampir berpaling dari kebenaran dan mereka hampir enggan mengikuti perang karena perjalanan yang berat, cuaca yang panas, dan perbekalan yang sedikit; namun dengan rahmat dan kelembutan Allah, Dia memberi mereka taufik untuk tetap teguh dan mengampuni mereka setelah mereka menyesal. Allah Maha Mengasihi dan Menyayangi hamba-hamba-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "117. لَّقَد تَّابَ اللهُ عَلَى النَّبِىِّ (Sesungguhnya Allah telah menerima taubat Nabi) Atas izin yang diberikannya bagi sebagian orang munafik untuk tidak ikut serta dalam perang Tabuk. Atau atas permohonan ampun yang beliau lakukan bagi orang-orang musyrik. وَالْمُهٰجِرِينَ وَالْأَنصَارِ(orang-orang muhajirin dan orang-orang anshar) Atas dosa-dosa yang telah mereka lakukan. الَّذِينَ اتَّبَعُوهُ(yang mengikuti Nabi) Yang sama sekali tidak tertinggal darinya. فِى سَاعَةِ الْعُسْرَةِ(dalam masa kesulitan) Dalam perang Tabuk. Ini merupakan sebab diterimanya taubat mereka; sebab mereka pergi untuk berjihad meski jarak yang jauh, musuh yang kuat yaitu bangsa Ramawi, pasukan yang sedikit, dan cuaca yang sangat terik; semua kesusahan ini mereka lalui dan beban berat ini mereka pikul di jalan Allah demi tersebarnya agama Islam, dan menguatkan daerah kekuasaannya, sehingga mereka berhak mendapat derajat yang tinggi, taubat yang diterima, dan juga ampunan. Semoga Allah senantiasa meridhai mereka dan menjadikan mereka ridha. مِنۢ بَعْدِ مَا كَادَ يَزِيغُ قُلُوبُ فَرِيقٍ مِّنْهُمْ(setelah hati segolongan dari mereka hampir berpaling) Dengan berencana untuk tidak ikut dalam perang karena mereka mendapat kesulitan yang besar. ثُمَّ تَابَ عَلَيْهِمْ ۚ( kemudian Allah menerima taubat mereka itu) Yakni taubat orang-orang yang hampir tidak ikut perang. Atau taubat orang-orang beriman semuanya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Jika dikatakan : kenapa taubat disebutkan secara berulang { ثُمَّ تَابَ عَلَيْهِمْ } padahal telah disebutkan pada permulaan ayat : { لَقَدْ تَابَ اللَّهُ عَلَى النَّبِيِّ } , sebagian ulama mengatakan bahwa : pada penyebutan pertama dari lafadz taubat adalah setelah disebutkannya dosa, yang merupakan murni karunia dari Allah, maka ketika disebutkan dosa disebutkan pula taubat, sebagai kabar bahwa taubah mereka diterima oleh Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "117. Sungguh Allah telah menerima taubat Nabi yang mengizinkan orang-orang munafik untuk mundur dalam jihad dan permintaan ampun untuk sebagian orang musyrik. Dia juga menerima taubat orang-orang Muhajirin dan Anshar yang berjihad bersama Nabi dan tidak mundur di waktu sengsara saat perang Tabuk, yang mana mereka melakukan kesalahan dan dosa di dalamnya, yaitu seusai hati mereka hampir menyimpang ketika mereka khawatir sehingga hendak mundur dari jihad di waktu peperangan yang berat dan kekurangan bekal dan air, sampai-sampai dua laki-laki berbagi satu buah kurma, lalu 10 laki-laki ikut berbagi atas 1 unta. Kemudian Allah menerima taubat mereka saat mereka masih teguh untuk beriman dengan benar setelah bertaubat. Sesungguhnya Allah itu Maha Pemurah lagi Maha Penyayang bagi orang-orang yang bertaubat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh Allah benar-benar telah menerima taubat Nabi} Allah memaafkan nabi Muhammad SAW karena dengan izinnya bagi orang-orang munafik untuk tinggal {kaum Muhajirin dan kaum Ansar yang mengikutinya pada masa-masa sulit} perang Tabuk {setelah hampir berpaling hati sekelompok dari mereka} hampir berpaling hati satu kelompok dari mereka untuk meninggalkan nabi Muhammad SAW {kemudian Allah menerima taubat mereka. Sesungguhnya Dia Maha Pengasih lagi Maha Penyayang kepada mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "117. Allah mengabarkan bahwa termasuk kebaikan dan kasih sayangNYa, “Allah telah menerima taubat Nabi”, Muhammad “dan orang-orang MUhajirin dan orang-orang Anshar.” Dia mengampuni kesalahan mereka, memudahkan kebaikan bagi mereka, dan mengangkat mereka ke darajat tertinggi, hal itu karena mereka melakukan amal yang sangat sulit dan sangat berat, oleh karena itu Dia berfirman, “Yang mengikuti Nabi dalam masa kesulitan”, yakni, berangkat bersama beliau untuk memerangi musuh di Perang Tabuk, di mana ia terjadi pada saat yang sangat panas, bekal dan kendaraan sedikit, dan banyaknya jumlah musuh, dimana itu mendorong orang untuk enggan berangkat perang, namun kemudian mereka memohon pertolongan kepada Allah dan tetap melakukan jihad tersebut, “setelah hati segolongan dari mereka hampir berpaling”, yakni hati mereka berbalik dan cenderung kepada ketenangan dan kenyamanan, akan tetapi Allah meneguhkan, mendukung, dan menguatkan mereka. Berpalingnya hati adalah penyelewengannya dari jalan yang lurus, jika penyelewengannya pada dasar agama, maka ia adalah kekufuran, jika pada syariatnya, maka hal itu menurut syariat di mana dia menyimpang darinya. Bisa dalam bentuk dial alai dalam menunaikannya, atau menunaikannya secara tidak syari. FirmanNya, “Kemudian Allah menerima taubat mereka itu.” Sesungguhnya Allah Maha Pengasih lagi Maha Penyayang kepada mereka.” Di antara kasih sayangNya adalah memberi mereka nikmat taubat dan menerimanya dari mereka serta meneguhkan mereka di atasnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 117: Allah Subhaanahu wa Ta'aala mengampuni ketergelinciran mereka, memperbanyak kebaikan, dan menaikkan mereka ke derajat yang tinggi disebabkan mereka mau melakukan perbuatan-perbuatan yang berat dilakukan. Yaitu di perang Tabuk, di mana ketika itu dua orang sampai berbagi dalam memakan satu buah kurma, dan sepuluh orang bergantian menunggangi seekor unta. Ketika itu, cuaca sangat panas, perbekalan dan kendaraan kurang, dan musuh berjumlah besar. Semua itu dapat membuat seseorang meninggalkan perang. Dengan tidak mengikuti Beliau karena keadaan yang begitu sulit. Berpalingnya hati adalah dengan berpaling dari jalan yang lurus, jika berpaling dalam hal yang menyangkut dasar agama, maka bisa menjadi kafir, namun jika berpalingnya dalam syari’at yang cabang (bukan ushul), maka keadaannya tergantung sejauh mana tingginya kedudukan syari’at itu. Berpaling tersebut bisa dengan tidak melakukannya atau melakukannya namun tidak sesuai syari’at. Dengan menjadikan mereka tetap kokoh. Di antara kasih sayang-Nya kepada mereka adalah dengan mengaruniakan mereka taufik untuk bertobat, menerimanya dan meneguhkan mereka di atasnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 117",
    "description": "Pada ayat ini dijelaskan salah satu wujud rahmat Allah. Sungguh, Allah telah menerima tobat nabi, orang-orang muhajirin dan orang-orang ansar, yang mengikuti nabi pada masa-masa sulit ketika perang tabuk yang terjadi antara kaum muslim dengan orang-orang romawi pada tahun ke-10 h, saat itu lagi musim paceklik dan cuaca sangat panas, setelah hati segolongan dari mereka hampir berpaling dari kebenaran akibat masa sulit yang mereka alami, kemudian Allah menerima tobat mereka. Sesungguhnya Allah maha pengasih kepada semua hamba-Nya, terlebih kepada orangorang yang bertobat, maha penyayang, yakni mencurahkan rahmat-Nya kepada mereka. Dan Allah juga memberi pengampunan terhadap tiga orang yang tidak mau ikut perang, yaitu ka'b bin ma'lik, hila'l bin umayyah, mura'rah bin rabi'ah yang ditinggalkan atas perintah Allah, yakni tidak diajak bicara oleh rasulullah dan kaum muslim. Hingga ketika bumi terasa sempit bagi mereka, padahal mereka tahu bumi itu luas dan jiwa mereka pun telah pula terasa sempit bagi mereka, serta mereka telah mengetahui dan yakin bahwa tidak ada tempat lari dari cobaan Allah, melainkan berlindung dan kembali kepada-Nya saja, ketika itulah kemudian Allah menerima tobat mereka agar mereka tetap dalam tobatnya. Sesungguhnya Allah maha penerima tobat orang yang sungguh-sungguh menyesali kesalahannya, maha penyayang terhadap semua hamba-Nya."
  }
]