[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Demikian pula, Allah menerima taubat tiga orang yang tertunda (diterimanya taubat mereka) dari kaum anshar, yaitu ka’ab bin malik, hilal bin umayyah dan murarah bin ar-rabi. Mereka bertiga tinggal tidak turut serta berperang bersama rasulullah dan mereka mengalami kesedihan yang amat mendalam, hingga bumi ini dengan segala keluasaannya terasa sempit bagi mereka, merasa gundah dan menyesal kerena tidak ikut berperang, dan bahkan jiwa mereka terasa sempit lantaran kegundahan yang mengenai mereka, dan mereka yakin tidak ada tempat berlindung dari hukuman Allah, kecuali padaNya. Dan Allah memberikan taufik kepada mereka untuk taat dan kembali menuju keadaan yang diridhai Allah . Sesungguhnya Allah maha menerima taubat dari hamba-hambaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "118. Sungguh Allah telah menerima tobat tiga orang, Ka'b bin Mālik, Murārah bin Rabī', dan Hilāl bin Umayyah yang sebelumnya ditangguhkan penerimaan tobat mereka, setelah mereka tidak pergi bersama Rasulullah -ṣallallāhu 'alaihi wa sallam- ke Tabuk, kemudian Nabi -ṣallallāhu 'alaihi wa sallam- memerintahkan kepada para sahabat untuk menjauhi mereka, dan mereka bertiga pun didera kesedihan dan kegelisahan yang luar biasa hingga bumi yang luas ini terasa sempit bagi mereka dan dada mereka tersiksa oleh rasa kesepian yang mencekam karena dijauhi oleh semua orang. Mereka tahu bahwasanya tidak ada tempat lari dari (siksaan) Allah, melainkan kepada-Nya saja. Maka Allah memberikan belas kasih-Nya kepada mereka dengan membimbing mereka bertobat, kemudian menerima tobat mereka. Sesungguhnya Dia Maha Menerima tobat lagi Maha Penyayang bagi hamba-hamba-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "118. Dan Allah mengampuni tiga sahabat, Ka’ab bin Malik, Murarah bin Rabi, dan Hilal bin Umayyah; yaitu tiga orang yang tidak ikut Rasulullah dalam perang Tabuk. Mereka sangat bersedih karena dicampakkan orang-orang beriman, hingga bumi yang luas terasa sempit bagi mereka, dan mereka merasa tidak akan selamat dari azab Allah melainkan dengan bertaubat dan memohon ampun. Maka Allah mengampuni mereka setelah berlalu 50 hari, agar mereka senantiasa beristiqamah dan bertaubat. Allah Maha Menerima taubat hamba-hamba-Nya yang bertaubat dan Maha Mengasihi mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "118. وَعَلَى الثَّلٰثَةِ الَّذِينَ خُلِّفُوا۟ (dan terhadap tiga orang yang ditangguhkan (penerimaan taubat) mereka) Yakni Allah juga menerima taubat bagi tiga orang yang tidak mengikuti perang. Yakni penerimaan taubat mereka diakhirkan dan tidak secara langsung karena mereka tidak memiliki alasan untuk tidak ikut berperang, sebagaimana telah diterima taubat orang-orang yang memiliki uzur untuk tidak ikut berperang, seperti yang telah disebutkan (lihat ayat 106) Rasulullah tidak menerima taubat secara langsung tiga orang tersebut, yaitu Ka’ab bin Malik, Mararah bin Rabi’, dan Hilal bin Umayyah, mereka semua dari kaum Anshar. Taubat mereka tidak diterima sampai turun ayat ini yang menjelaskan bahwa Allah telah menerima taubat mereka. حَتَّىٰٓ إِذَا ضَاقَتْ عَلَيْهِمُ الْأَرْضُ بِمَا رَحُبَتْ(hingga apabila bumi telah menjadi sempit bagi mereka, padahal bumi itu luas) Karena orang-orang menjauhi mereka dan tidak mau berbicara dengan salah satu dari mereka, sebab Rasulullah melarang orang-orang untuk berbicara dengan mereka. وَضَاقَتْ عَلَيْهِمْ أَنفُسُهُمْ(dan jiwa merekapun telah sempit (pula terasa) oleh mereka) Hati mereka terasa sempit sebab mereka merasa diasingkan dan tidak dipedulikan. وَظَنُّوٓا۟ أَن لَّا مَلْجَأَ مِنَ اللهِ إِلَّآ إِلَيْهِ(serta mereka telah mengetahui bahwa tidak ada tempat lari dari (siksa) Allah, melainkan kepada-Nya saja) Yakni mereka mengetahui bahwa tidak ada tempat lari kecuali kepada Allah dengan bertaubat dan beristighfar setelah mereka mengakui dosa mereka. ثُمَّ تَابَ عَلَيْهِمْ لِيَتُوبُوٓا۟ ۚ( Kemudian Allah menerima taubat mereka agar mereka tetap dalam taubatnya) Yakni Allah memberi mereka penerimaan taubat, dan rahmat, agar mereka beristiqamah di waktu yang akan datang, meski dosa-dosa mereka telah menumpuk namun mereka harus tetap bertaubat dan kembali kepada Allah. Dalam kisah penerimaan taubat tiga orang tersebut terdapat banyak pelajaran bagi orang-orang beriman, mereka jujur dihadapan Rasulullah, dan tidak mengemukakan alasan-alasan bohong, namun mereka mengakui bahwa mereka tidak memiliki alasan yang benar, dan mengaku mereka bersalah dengan ketidak ikutsertaan mereka dalam perang. Dan kisah ini telah banyak dijelaskan dalam kitab-kitab sejarah dan hadist, maka silakan merujuknya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Perhatikan ayat-ayat taubat berikut dikumpulkan dalam satu surah : { فَإِنْ تُبْتُمْ فَهُوَ خَيْرٌ لَكُمْ } \"Kemudian jika kamu (kaum musyrikin) bertobat, maka bertaubat itu lebih baik bagimu\" [ At-Taubah : 3 ] , { فَإِنْ تَابُوا وَأَقَامُوا الصَّلَاةَ وَآتَوُا الزَّكَاةَ فَخَلُّوا سَبِيلَهُمْ ۚ إِنَّ اللَّهَ غَفُورٌ رَحِيمٌ } \"Jika mereka bertaubat dan mendirikan sholat dan menunaikan zakat, maka berilah kebebasan kepada mereka untuk berjalan. Sesungguhnya Allah Maha Pengampun lagi maha Penyayang\" [ At-Taubah : 5 ] , { وَيَتُوبُ اللَّهُ عَلَىٰ مَنْ يَشَاءُ } \"Dan Allah menerima taubat orang yang dikehendaki-Nya\" [ At-Taubah : 15 ] , { عَسَى اللَّهُ أَنْ يَتُوبَ عَلَيْهِمْ ۚ إِنَّ اللَّهَ غَفُورٌ رَحِيمٌ } \"Mudah-mudahan Allah menerima taubat mereka. Sesungguhnya Allah Maha Pengampun lagi maha Penyayang\" [ At-taubah : 102 ] , { أَلَمْ يَعْلَمُوا أَنَّ اللَّهَ هُوَ يَقْبَلُ التَّوْبَةَ عَنْ عِبَادِهِ } \"Tidaklah mereka mengetahui, bahwasanya Allah menerima taubat dari hamba-hamba-Nya\" [ At-Taubah : 104 ] , { وَإِمَّا يَتُوبُ عَلَيْهِمْ } \"dan adakalanya Allah akan menerima taubat mereka\" [ At-Taubah : 106 ] , { التَّائِبُونَ الْعَابِدُونَ } \"Mereka itu adalah orang-orang yang bertaubat, yang beribadat\" [ At-Taubah : 1121 ] , { لَقَدْ تَابَ اللَّهُ } \"Sesungguhnya Allah telah menerima taubat\" [ AT-Taubah : 117 ] , { ثُمَّ تَابَ عَلَيْهِمْ لِيَتُوبُوا } \"Kemudian Allah menerima taubat mereka agar mereka tetap dalam taubatnya\" [ At-Taubah : 118 ] , maka apa yang menjadi penghalang bagi mereka yang menunda taubatnya ?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "118. Allah menerima taubat 3 orang yang mundur dari perang Tabuk karena malas, bukan munafik, yaitu Ka’b bin Malik, Hilal bin Umayyah dan Murarabin Ar-Rabi’. Taubat mereka tidak benar-benar diterima seketika sebagaimana taubatnya orang-orang yang mundur karena uzur, melainkan sampai bumi terasa sempit bagi mereka, dan hati mereka sesak karena sangat bingung, bersedih dan pusing, lalu mereka tahu bahwa tidak ada keselamatan dan perlindungan bagi mereka dari azab kecuali dengan bertaubat dan memohon ampunan . Lalu Allah membantu mereka untuk bertaubat supaya mereka termasuk sejumlah orang-orang yang bertaubat yang beristiqamah dan terus bertaubat. Sesungguhnya Allah itu Maha Menerima Taubat dan Maha Pengasih bagi orang-orang yang bertaubat. Ayat ini turun terkait perkata 3 orang tersebut. Di dalamnya terdapat pelajaran dan nasehat bagi orang-orang mukmin agar mempercayai janjinya dengan Allah, kembali dari dosa-dosa mereka dan mengakui bahwa kemunduran mereka itu tanpa adanya uzur"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Terhadap tiga orang} Dia menerima taubat tiga orang, yaitu Ka’b bin Malik, Hilal bin Umayyah, dam Murarah bin Ar-Rabi’ {yang ditinggalkan} diakhirkan penerimaan taubatnya {sehingga ketika bumi terasa sempit bagi mereka, padahal bumi itu luas} padahal bumi itu luas {dan jiwa mereka terasa sempit} dada mereka terasa sempit karena kesusahan dan keserakahan {serta mereka yakin} yakin {bahwa tidak ada tempat berlindung dari Allah melainkan kepadaNya saja, kemudian Allah menerima taubat mereka agar mereka tetap dalam taubatnya. Sesungguhnya Allah Maha Penerima Taubat lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "118. “Dan” begitu pula Allah telah menerima taubat “tiga orang yang ditangguhkan (penerimaan taubat) mereka”, mereka tidak berangkat berperang bersama kaum Muslimin di perang itu. Mereka adalah Ka’ab bin Malik dan kedua rekannya. Kisah mereka masyhur tercantum di kitab-kitab Shahih dan Sunan. “Hingga apabila”, mereka sangat bersedih, “bumi telah menjadi sempit bagi mereka, padahal bumi itu luas, “dan jiwa mereka pun telah sempit (pula terasa) oleh mereka,” yang merupakan sesuatu yang paling mereka cintai dari segala apa pun, bumi yang luas dan sesuatu yang dicintai serasa sempit padahal biasanya ia tidak demikian, hal itu tidak lain kecuali karena perkara yang berat yang telah sampai pada puncak beratnya dan sulitnya, sehingga ia sulit untuk diungkapkan, hal itu karena mereka mendahulukan ridha Allah dan ridha RasulNya daripada segala sesuatu. “Mereka telah mengetahui bahwa tidak ada tempat lari dari (siksa) Allah, melankan kepadaNya saja.” Yakni, mereka yakin dan mengetahui keadaan mereka bahwa tidak ada keselamatan dan perlindungan dari kesulitan kecuali hanya kepada Allah semata, tidak ada sekutu bagiNya. Terputuslah ketergantungan mereka dengan makhluk, mereka bergantung hanya kepada Allah, Rabb mereka, dan kembali kepadaNya. Mereka mengalami kesulitan ini selama lima puluh malam. “Kemudian Allah menerima taubat mereka.” Yakni mengizinkan dan membimbing mereka untuk taubat kepadaNya “agar mereka tetap dalam taubatnya.” Yakni, agar taubat tersebut dilakukan oleh mereka, sehingga kemudian Dia akan menerima taubat mereka. “Sesungguhnya Allah-lah Yang Maha Penerima taubat.” Yakni, banyak memaafkan, mengampuni, dan menerima taubat dari kesalahan-kesalahan dan berbagai kekurangan. “Lagi Maha Penyayang.” SifatNYa adalah rahmat yang agung yang selalu turun kepada hamba setiap saat dan waktu, di segala kesempatan yang menyebabkan perkara agama dan dunia mereka berdiri tegak dengannya. Dalam ayat-ayat ini terdapat dalil yang menunjukkan bahwa penerimaan taubat oleh Allah kepada seorang hamba adalah tujuan dan sasaran paling mulia dan paling tinggi, karena Allah menjadikannya sebagai akhir bagi hamba-hambaNya yang khusus, dan memberi mereka nikmat dengannya ketika mereka melakukan amalan-amalan yang dicintai dan diridhaiNya. Di antaranya: Kasih sayang Allah kepada mereka, serta peneguhan iman mereka pada waktu kesulitan dan musibah yang mencemaskan. Di antaranya: Bahwa ibadah yang berat bagi jiwa memiliki keistimewaan dan keutamaan di atas selainnya. Semakin berat kesulitannya maka akan semakin besar pahalanya. Di antaranya: Bahwa penerimaan taubat oleh Allah kepada hambaNya adalah berdasarkan penyesalannya yang mendalam. Sedangkan orang yang tidak peduli dengan dosa dan tidak merasa bersalah jika melakukannya, maka taubatnya pasti gagal, meski dia menyangkanya diterima. Di antaranya: Bahwa tanda kebaikan dan lenyapnya kesulitan adalah jika hati seorang hamba hanya bergantung kepada Allah secara sempurna dan terputus dari (mengharap kepada) makhluk. Di antaranya: Di antara kasih sayang Allah kepada tiga orang sahabat tersebut adalah Allah menyifati mereka dengan sifat yang bukan aib bagi mereka, Dia berfirman, “Mereka ditangguhkan.” Sebagai isyarat bahwa orang-orang Mukmin meninggalkan mereka atau ditunda dari orang yang taubatnya dipastikan ditolak atau diterima, dan bahwa mereka tidak berangkat bukan karena tidak menginginkan kebaikan. Oleh karena itu Allah tidak berfirman, (tidak berangkat). Di antaranya : Allah memberi nikmat kejujuran kepada mereka. Oleh karena itu Allah memerintahkan agar mereka diteladani."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 118: Imam Bukhari meriwayatkan dari Abdulah bin Ka’ab bin Malik, dia di antara anak Ka’ab yang menjadi penuntun Ka’ab ketika telah buta. Ia berkata, “Aku mendengar Ka’ab bin Malik bercerita tentang kisah Tabuk ketika ia tidak ikut berperang, ia berkata: Aku tidaklah meninggalkan Rasulullah shallallahu 'alaihi wa sallam di peperangan apa pun selain perang Tabuk, namun aku pernah tidak ikut pula perang Badar, tetapi Beliau tidak mencela orang yang meninggalkannya, hal itu karena Rasulullah shallallahu 'alaihi wa sallam keluar untuk mendatangi kafilah (dagang) Quraisy, namun akhirnya Allah mengumpulkan mereka dengan musuhnya tanpa perjanjian terlebih dahulu. Aku hadir bersama Rasulullah shallallahu 'alaihi wa sallam di malam ‘Aqabah ketika Beliau membai’at kami di atas Islam, dan aku tidak suka jika ada pengganti (yang melebihi) malam ‘Aqabah, yaitu perang Badar (menurutnya malam ‘Aqabah lebih afdhal daripada perang Badar), meskipun perang Badar lebih dikenang oleh manusia daripada malam ‘Aqabah. Cerita saya, bahwa saya tidaklah pernah lebih kuat dan lebih lapang daripada keadaan ketika saya meninggalkan perang itu. Demi Allah, sesungguhnya sebelum itu tidak ada dua kendaraan sama sekali, hingga saya berhasil mengumpulkan keduanya pada perang itu. Sudah menjadi kebiasaan Rasulullah shallallahu 'alaihi wa sallam, bahwa Beliau tidaklah hendak berperang kecuali menampakkan yang lain, termasuk dalam peperangan itu. Rasulullah shallallahu 'alaihi wa sallam berangkat di waktu yang sangat panas, menuju perjalanan yang jauh, padang pasir dan musuh yang banyak. Maka Beliau menerangkan kepada kaum muslimin hal yang sesungguhnya agar mereka mempersiapkan perlengkapan untuk perang itu dan memberitahukan arah mana yang hendak Beliau tuju. Kaum muslimin yang bersama Rasulullah shallallahu 'alaihi wa sallam jumlahnya banyak, dan mereka tidak terdaftar dalam buku induk. Ka’ab berkata, “Oleh karena itu, tidak ada yang ingin absen kecuali dia menduga bahwa yang demikian akan tersembunyi bagi Beliau, selama tidak turun wahyu Allah terhadapnya.” Rasulullah shallallahu 'alaihi wa sallam pergi berperang ketika buah-buah matang dan pohonnya rindang, maka bersiap-siaplah Rasulullah shallallahu 'alaihi wa sallam dengan kaum muslimin yang bersamanya. Aku pun pergi untuk ikut bersiap-siap bersama mereka, aku pulang, namun tidak melakukan apa-apa, maka aku berkata dalam hati, “Saya mampu melakukannya.” Hal itu berlangsung terus hingga mereka semakin siap, maka Rasulullah shallallahu 'alaihi wa sallam dan kaum muslimin berangkat sedangkan saya belum mempersiapkan apa-apa,” aku pun berkata, “Saya akan bersap-siap setelahnya sehari atau dua hari kemudian menyusul mereka.” Maka saya pergi setelah mereka jauh untuk bersiap-siap, saya pulang namun tidak melakukan apa-apa. Saya pergi lagi dan kembali namun belum melakukan apa-apa, dan terus menerus seperti itu sampai mereka semakin sepat dan (aaya) ketinggalan perang. Saya ingin berangkat dan menyusul mereka. Duhai, andai saja saya melakukannya, namun tidak ditaqdirkan buat saya, sehingga ketika saya keluar kepada orang-orang setelah kepergian Rasulullah shallallahu 'alaihi wa sallam, maka saya berkeliling di antara mereka, saya pun bersedih karena tidak melihat orang selain orang yang tercela karena kemunafikannya atau orang yang diberi uzur oleh Allah dari kalangan kaum dhu’afa. Rasulullah shallallahu 'alaihi wa sallam tidak menyebutku sampai tiba di Tabuk. Beliau pun bersabda ketika duduk di tengah-tengah manusia di Tabuk, “Apa yang dilakukan Ka’ab?” Maka seorang dari Bani Salamah berkata, “Wahai Rasulullah, ia tertahan oleh kedua burdahnya dan melihat sisi tubuhnya.” Mu’adz bin Jabal berkata, “Buruk sekali apa yang kamu katakan. Demi Allah, wahai Rasulullah, kami tidak mengetahui tentangnya selain kebaikan.” Maka Rasulullah shallallahu 'alaihi wa sallam diam. Ka’ab bin Malik berkata, “Ketika sampai berita kepadaku, bahwa Beliau sedang kembali pulang, maka aku pun bersedih. Aku mulai berpikir tentang berdusta dan berkata (dalam hati), “Bagaimana caranya agar aku dapat lolos dari kemarahan Beliau besok? Aku pun meminta bantuan untuk itu kepada keluargaku yang berpengalaman. Namun ketika disebutkan, bahwa Rasulullah shallallahu 'alaihi wa sallam menjelang tiba, maka hilanglah (pikiran) batil dariku, dan saya mengetahui bahwa saya tidak dapat lolos selamanya dengan sesuatu yang di sana terdapat dusta, maka saya bertekad untuk jujur. Rasulullah shallallahu 'alaihi wa sallam kemudian datang, dan Beliau biasanya apabila pulang dari safar, pergi ke masjid, lalu shalat di sana dua rak’at, kemudian duduk di hadapan manusia. Ketika Beliau sedang seperti itu, maka orang-orang yang tidak ikut berperang datang, dan mulai mengemukakan uzurnya serta bersumpah. Jumlah mereka ada delapan puluh orang lebih, maka Rasulullah shallallahu 'alaihi wa sallam menerima lahiriah mereka, membai’at mereka dan memintakan ampunan untuk mereka, serta menyerahkan rahasia mereka kepada Allah. Aku pun datang dan mengucapkan salam kepadanya, maka Beliau tersenyum dengan senyuman orang yang marah. Beliau bersabda, “Kemari!” maka aku pun datang sambil berjalan dan duduk di hadapannya, dan bersabda kepadaku, “Apa yang membuatmu tertinggal?” Bukankah kamu telah membeli kendaraanmu?” Aku menjawab, “Ya. Sesungguhnya aku demi Allah, jika aku duduk pada selain dirimu di antara penduduk dunia, aku yakin dapat lolos dari kemarahannya dengan suatu alasan. Aku telah diberi kelebihan berdebat, akan tetapi demi Allah, aku tahu bahwa jika aku menyampaikan kata-kata dusta pada hari ini kepadamu yang membuatmu ridha dengannya, tentu Allah akan menjadikan engkau marah kepadaku. Namun jika aku menyampaikan kata-kata jujur, maka engkau akan marah kepadaku. Sesungguhnya aku berharap ampunan dari Allah dengan kejujuran itu. Demi Allah, aku tidak memiliki uzur. Demi Allah, aku tidaklah lebih kuat dan lebih lapang daripada keadaan ketika aku meninggalkanmu.” Maka Rasulullah shallallahu 'alaihi wa sallam bersabda, “Adapun orang ini, maka dia benar. Bangunlah sampai Allah memberikan keputusan terhadapmu.” Aku pun berdiri dan beberapa orang Bani Salamah bangkit mengikutiku. Mereka berkata kepadaku, “Demi Allah, kami tidak mengetahui kamu melakukan dosa sebelum ini, ternyata kamu tidak berani mengajukan uzur kepada Rasulullah shallallahu 'alaihi wa sallam seperti uzur yang diajukan oleh orang-orang yang tidak tertinggal lainnya (kaum munafik). Padahal cukup bagi dosamu permohonan ampunan Rasulullah shallallahu 'alaihi wa sallam untukmu.” Demi Allah, mereka senantiasa mencelaku sampai aku ingin kembali dan berkata dusta. Lalu aku berkata kepada mereka, “Apakah ada orang yang mengalami seperti diriku?” Mereka menjawab, “Ya. Ada dua orang yang berkata seperti yang kamu ucapkan, kemudian dikatakan kepada keduanya seperti yang dikatakan kepadamu.” Aku pun berkata, “Siapa keduanya?” Mereka menjawab, “Muraarah bin Ar Rabii’ Al ‘Amriy dan Hilal bin Umayyah Al Waaqifiy.” Ternyata mereka menyebutkan kepadaku dua laki-laki saleh yang ikut perang Badar, di mana pada keduanya ada keteladanan. Maka aku pun tetap berjalan, ketika mereka menyebutkan kedua orang itu kepadaku. Kemudian Rasulullah shallallahu 'alaihi wa sallam melarang kaum muslimin berbicara dengan kami bertiga dari sekian banyak orang yang tertinggal dari perang.” Manusia pun menjauhi kami dan berubah sikap kepada kami, sehingga berubah pula bumi dalam diriku, yang mana bumi yang aku kenal, kami tetap seperti itu selama lima puluh malam. Sedangkan kedua teman saya, mereka merasa hina dan duduk di rumahnya sambil menangis. Adapun saya, maka saya adalah orang yang paling muda di antara mereka dan paling kuat. Aku keluar, ikut shalat bersama kaum muslimin, dan berkeliling di pasar, namun tidak ada yang mau berbicara denganku. Aku mendatangi Rasulullah shallallahu 'alaihi wa sallam mengucapkan salam kepadanya, sedangkan Beliau berada di tempat duduknya setelah shalat. Aku berkata dalam hati, “Apakah Beliau akan menggerakkan bibirnya untuk menjawab salamku atau tidak? Lalu saya shalat dekat dengan Beliau, sambil mencuri pandang kepada Beliau. Ketika saya memasuki shalat, maka Beliau memandangku. Namun ketika aku menoleh ke arahnya, maka Beliau berpaling dariku. Sehingga ketika ketidakramahan dari manusia berlangsung lama padaku, aku pun berjalan dan menaiki tembok Abu Qatadah, dia adalah putera pamanku dan manusia yang paling saya cintai. Aku pun mengucapkan salam kepadanya. Demi Allah, dia tidak menjawab salamku. Aku pun berkata, “Wahai Abu Qatadah, saya bertanya kepadamu dengan nama Allah, tahukah kamu bahwa aku cinta kepada Allah dan Rasul-Nya? Ia pun diam, dan aku mengulangi lagi dan bertanya kepadanya sambil bersumpah, namun ia tetap diam.” Ia pun berkata, “Allah dan Rasul-Nya lebih mengetahui.” Maka mengalirlah kedua mataku dan aku pun berpaling hingga aku memanjat tembok. Ketika saya berjalan di pasar Madinah, tiba-tiba ada seorang petani dari petani penduduk Syam yang datang membawa makanan yang ia jual di Madinah, ia berkata, “Siapa yang mau menunjukkanku kepada Ka’ab bin Malik?” Orang-orang segera memberi isyarat kepadanya (yakni kepadaku). Ketika ia datang kepadaku, ia menyerahkan surat dari raja Ghassan, dan ternyata isinya, “Amma ba’du, sesungguhnya telah sampai berita kepadaku, bahwa kawanmu telah bersikap kasar kepadamu, dan Allah tentu tidak akan menjadikanmu berada di negeri hina, juga tidak tersia-sia. Maka bergabunglah dengan kami, kami akan menolongmu.” Setelah membacanya, aku berkata, “Ini termasuk cobaan.” Aku pun pergi ke dapur, lalu aku bakar surat itu dengannya. Hingga ketika telah berlalu 40 malam dari 50 malam, tiba-tiba utusan Rasulullah shallallahu 'alaihi wa sallam datang kepadaku dan berkata, “Sesungguhnya Rasulullah shallallahu 'alaihi wa sallam memerintahkan kamu menjauhi istrimu.” Aku pun berkata, “Apakah aku talak? Atau apa yang harus aku lakukan?” Ia berkata, “Jauhi saja dan jangan dekati.” Beliau juga mengutus kepada kedua kawanku seperti itu. Aku pun berkata kepada istriku, “Kembalilah kepada keluargamu sehingga kamu tinggal bersama mereka sampai Allah menyelesaikan masalah ini.” Ka’ab berkata, “Lalu istri Hilal bin Umayyah datang kepada Rasulullah shallallahu 'alaihi wa sallam dan berkata, “Wahai Rasulullah, sesungguhnya Hilal bin Umayyah adalah orang yang sudah tua lagi tidak punya apa-apa, ia tidak punya lagi pelayannya, apakah engkau tidak suka kalau aku melayaninya?” Beliau menjawab, “Bukan begitu, tetapi jangan sampai ia mendekatimu.” Istrinya berkata, “Demi Allah, sesungguhnya ia tidak pernah bergerak kepada sesuatu. Demi Allah ia senantiasa menangis sejak hari itu hingga hari ini.” Lalu sebagian keluargaku berkata kepadaku, “Kalau sekiranya engkau meminta izin kepada Rasulullah shallallahu 'alaihi wa sallam tentang istrimu sebagaimana Beliau mengizinkan kepada istri Hilal bin Umayyah untuk melayaninya?” Aku pun berkata, “Demi Allah, aku tidak akan meminta izin kepada Rasulullah shallallahu 'alaihi wa sallam, dan aku tidak tahu apa yang dikatakan nanti oleh Rasulullah shallallahu 'alaihi wa sallam ketika aku meminta izin kepadanya, sedangkan saya seorang pemuda?” Maka setelah itu, saya tetap seperti itu sampai sepuluh malam sehingga genaplah lima puluh malam dari sejak Rasulullah shallallahu 'alaihi wa sallam melarang berbicara dengan kami. Ketika aku shalat Subuh pada malam yang kelima puluh, sedangkan aku berada di salah satu atap rumah kami. Ketika aku sedang duduk dalam keadaan yang disebutkan Allah itu, di mana diriku telah terasa sempit, dan bumi yang luas pun menjadi sempit bagiku, aku pun mendengar suara keras orang yang berteriak yang muncul dari atas gunung Sala’, “Wahai Ka’ab bin Malik, bergembiralah.” Maka aku pun tersungkur sujud, dan aku mengetahui bahwa kelegaan telah datang, kemudian Rasulullah shallallahu 'alaihi wa sallam memberitahukan tobat dari Allah kepada kami ketika telah selesai shalat Subuh. Lalu orang-orang datang memberi kabar gembira kepada kami, dan datang pula orang-orang memberi kabar gembira kepada dua sahabatku. Ada seseorang yang memacu kudanya dengan cepat kepadaku, dan ada lagi orang yang berlari kencang menujuku dari Bani Aslam, dia naik ke atas gunung, dan suara itu lebih cepat daripada kuda. Ketika telah datang kepadaku orang yang aku dengar suaranya memberi kabar gembira kepadaku, aku pun melepas kedua pakaianku dan memakaikan kepadanya karena kabar gembiranya. Demi Allah, padahal ketika itu aku tidak memiliki selainnya. Aku pun meminjam dua baju, dan aku pakai. Aku pun pergi kepada Rasulullah shallallahu 'alaihi wa sallam, lalu orang-orang mendatangiku secara berbondong-bondong, mereka mengucapkan selamat atau tobat saya. Mereka berkata, “Semoga tobat Allah membahagiakanmu.” Aku pun masuk ke masjid, tiba-tiba Rasulullah shallallahu 'alaihi wa sallam sedang duduk dengan dikerumuni manusia. Lalu Thalhah bin Ubaidillah berjalan cepat, menyalamiku dan mengucapkan selamat kepadaku. Demi Allah, tidak ada seorang pun dari kaum muhajirin yang bangkit kepadaku selainnya, dan aku tidak pernah melupakannya untuk Thalhah. Ka’ab melanjutkan kata-katanya, “Ketika aku mengucapkan salam kepada Rasulullah shallallahu 'alaihi wa sallam. Rasulullah shallallahu 'alaihi wa sallam bersabda kepadaku dalam keadaan mukanya berseri-seri karena senang, “Bergembiralah dengan hari terbaik yang pernah melewati hidupmu sejak kamu dilahirkan oleh ibumu.” Aku pun bertanya, “Apakah dari sisimu wahai Rasulullah ataukah dari sisi Allah?” Beliau menjawab, “Tidak, bahkan dari sisi Allah.” Rasulullah shallallahu 'alaihi wa sallam apabila senang, mukanya berseri-seri sehingga seperti satu potong rembulan, dan kami mengenali yang demikian dari Beliau. Ketika aku duduk di depannya, aku berkata, “Wahai Rasulullah, sesungguhnya di antara tobatku adalah saya akan mengeluarkan sedekah kepada Allah dan kepada Rasulullah dari harta saya.” Rasulullah shallallahu 'alaihi wa sallam bersabda, “Tahanlah sebagian hartamu, yang demikian lebih baik bagimu.” Aku pun berkata, “Sesungguhnya saya menahan bagian saya yang ada di Khaibar.” Saya juga berkata, “Wahai Rasulullah, sesungguhnya Allah menyelamatkanku karena kejujuran, dan termasuk (kesempurnaan) tobat saya adalah saya tidak berbicara kecuali benar selama aku masih hidup.” Demi Allah, aku tidak mengetahui seorang pun dari kaum muslimin yang diberi nikmat oleh Alah tentang kejujuran bicara sejak aku sebutkan hal itu kepada Rasulullah shallallahu 'alaihi wa sallam yang lebih baik dari nikmat yang diberikan-Nya kepadaku. Sejak aku sebutkan hal itu kepada Rasulullah shallallahu 'alaihi wa sallam aku tidak pernah sengaja berdusta sampai hari ini. Saya pun berharap kepada Allah agar Dia menjaga saya selama saya masih hidup, dan Allah pun menurunkan ayat kepada Rasul-Nya, “Laqad taaballahu ‘alan nabiyyi wal muhaajiriin…dst. Sampai ayat, “Wa kuunuu ma’ash shaadiqiin.” Demi Allah, Allah tidaklah memberi nikmat kepadaku suatu nikmat yang lebih besar setelah aku ditunjuki-Nya kepada Islam daripada kejujuranku kepada Rasulullah shallallahu 'alaihi wa sallam, di mana aku tidak berdusta kepadanya, yang membuatku binasa sebagaimana orang-orang yang berdusta binasa. Sesungguhnya Allah berfirman kepada mereka yang berdusta ketika Dia menurunkan wahyu dengan seburuk-buruk ucapan yang difirmankan-Nya kepada seseorang, “Sayahlifuuna billahi lakum idzanqalabtum ilaihim…dst. Sampai Fa innallaha laa yardhaa ‘anil qaumil faasiqiin.” Ka’ab berkata, “Kami bertiga ditangguhkan dari perkara orang-orang yang telah diterima oleh Rasulullah shallallahu 'alaihi wa sallam ketika mereka berani bersumpah kepada Beliau. Beliau membai’at mereka, memintakan ampunan dan menangguhkan urusan kami sehingga Allah memutuskannya. Oleh karena itulah, Allah berfirman, “Wa ‘alats tsalaatsatilladziina khullifuu…dst.” Dan yang disebutkan Allah itu bukan ketertinggalan kami dari peperangan, tetapi penangguhan oleh Nabi shallallahu 'alaihi wa sallam kepada kami dan pengakhiran Rasulullah shallallahu 'alaihi wa sallam terhadap urusan kami dari orang-orang yang telah bersumpah serta mengajukan uzurnya kepada Beliau dan Beliau telah menerimanya.” (HR. Bukhari) Bisa juga diartikan, “Ditangguhkan penerimaan tobatnya.” Dan arti ini lebih tepat sesuai hadits Ka’ab bin Malik. Mereka tidak memperoleh satu pun tempat yang bisa membuatnya merasa tenteram. Karena kesedihan yang mendalam disebabkan tobat mereka yang ditunda. Dengan memberi taufik kepada mereka untuk bertobat. Yakni banyak menerima tobat, memaafkan dan mengampuni ketergelinciran dan kemaksiatan. Rahmat-Nya senantiasa mengucur kepada semua hamba di setiap waktu, setiap saat dan di setiap detik, di mana dengannya urusan agama dan dunia mereka menjadi tegak. Ayat ini menunjukkan beberapa hal berikut: - Tobat dari Alah kepada hamba-Nya merupakan harapan yang paling tinggi, karena Allah menjadikannya sebagai batas terakhir bagi hamba-hamba pilihan-Nya, dan mengaruniakan mereka dengannya ketika mereka mengerjakan amalan yang dicintai dan diridhai-Nya. - Kelembutan Allah kepada mereka dan pengokohan-Nya terhadap iman mereka di saat-saat sulit. - Ibadah yang berat dilakukan jiwa memiliki kelebihan di atas ibadah yang lain, dan semakin besar kesulitan, maka semakin besar pula pahala. - Tobat dari Allah kepada hamba-Nya tergantung penyesalannya. - Tanda kebaikan adalah ketika hati bergantung kepada Allah secara sempurna dan lepas dari ketergantungan kepada makhluk.. - Di antara kelembutan Allah kepada tiga orang itu adalah menyebut mereka, namun bukan celaan bagi mereka, Dia berfirman dengan kata-kata, “Khulifuu” (ditangguhkan tobatnya atau tertinggal perang), tidak “takhallafuu” (meninggalkan perang). - Allah Subhaanahu wa Ta'aala mengaruniakan mereka bersikap jujur, oleh karenanya Dia memerintahkan yang lain mengikuti mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 118",
    "description": "Dan Allah juga memberi pengampunan terhadap tiga orang yang tidak mau ikut perang, yaitu ka'b bin ma'lik, hila'l bin umayyah, mura'rah bin rabi'ah yang ditinggalkan atas perintah Allah, yakni tidak diajak bicara oleh rasulullah dan kaum muslim. Hingga ketika bumi terasa sempit bagi mereka, padahal mereka tahu bumi itu luas dan jiwa mereka pun telah pula terasa sempit bagi mereka, serta mereka telah mengetahui dan yakin bahwa tidak ada tempat lari dari cobaan Allah, melainkan berlindung dan kembali kepada-Nya saja, ketika itulah kemudian Allah menerima tobat mereka agar mereka tetap dalam tobatnya. Sesungguhnya Allah maha penerima tobat orang yang sungguh-sungguh menyesali kesalahannya, maha penyayang terhadap semua hamba-Nya. Penegasan bahwa Allah maha penerima tobat diikuti dengan perintah: wahai orang-orang yang beriman! bertakwalah kepada Allah dengan sungguh-sungguh berupaya melaksanakan perintah-Nya dan menjauhi larangan-Nya, dan hendaklah kamu bersama dengan orang-orang yang benar, jujur dalam ucapan, perilaku dan perbuatannya."
  }
]