[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang yang briman kepada Allah dan rasulNya serta melaksanakan syariatNya, laksanakanlah perintah-perintah Allah dan jauhilah larangan-laranganNYa dalam segala yang kalian kerjakan dan kalian tinggalkan.Dan jadilah kalian bersama orang-orang yang benar dalam sumpah-sumpah mereka, janji-janji mereka dan dalam setiap urusan penting dari urusan-urusan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "119. Wahai orang-orang yang beriman kepada Allah, mengikuti rasul-Nya, dan menjalankan syariat-Nya, takutlah kepada Allah dengan menjalankan perintah-perintah-Nya dan menjauhi larangan-larangan-Nya. Dan bergabunglah bersama orang-orang yang jujur dalam keimanan, ucapan, dan perbuatannya. Karena tidak ada keselamatan bagi kalian kecuali di dalam kejujuran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "119. Allah berfirman kepada orang-orang beriman agar bertakwa kepada-Nya dengan menjalankan segala perintah dan menjauhi larangan-Nya, dan senantiasa jujur dalam janji, perkataan, dan perbuatan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "119. وَكُونُوا۟ مَعَ الصّٰدِقِينَ (dan hendaklah kamu bersama orang-orang yang benar) Terdapat isyarat bahwa tiga orang ini telah meraih penerimaan taubat dari Allah dengan kejujuran mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Allah memeritahkan kepada kita untuk senantiasa bersama orang-orang yang benar, Dia berfirman : { يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَكُونُوا مَعَ الصَّادِقِينَ } , maka betapa banyak diantara mereka yang merugi dengan mengabaikan ayat ini, sungguh kehinaan dan kerugian besar bagi mereka yang terjerumus ke dalam perangkap kebohongan orang-orang kafir."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "119. Wahai orang-orang mukmin, takutlah kepada Allah dengan melaksanakan perintahNya dan menjauhi laranganNya serta teruslah beriman dengan benar baik dalam perkataan maupun perbuatan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, bertakwalah kepada Allah dan tetaplah bersama orang-orang yang benar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "119. “Hai orang-orang yang beriman”, kepada Allah dan kepada apa yang diperintahkan oleh Allah agar diimani, jalankan apa yang menjadi konsekuensi iman, yaitu bertakwa kepada Allah, dengan menjauhi dan meninggalkan apa yang Dia larang. “Dan hendaklah kamu bersama orang-orang yang benar”, dalam ucapan, perbuatan, dan keadaan mereka, orang-orang yang perkataannya adalah benar, perbuatannya dan keadaannya tidak lain kecuali benar, bebas dari kemalasan dan kelesuan, selamat dari maksud-maksud buruk, mengandung keikhlasan dan niat yang baik, karena kejujuran mengantar kepada kebaikan, dan kebaikan mengantar kepada Surga. Allah berfirman, \"Ini adalah suatu hari yang bermanfaat bagi orang-orang yang benar kebenaran mereka. Bagi mereka surga yang dibawahnya mengalir sungai-sungai; mereka kekal di dalamnya selama-lamanya; Allah ridha terhadap-Nya. Itulah keberuntungan yang paling besar\".(Al-Maidah:119)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 119: Baik dalam perkataan, perbuatan, maupun keadaan, di mana hati mereka selamat dari niat buruk, berhati ikhlas dan berniat baik. Perlu diketahui. Bahwa kejujuran membawa kepada kebaikan, dan kebaikan membawa seseorang ke surga."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 119",
    "description": "Penegasan bahwa Allah maha penerima tobat diikuti dengan perintah: wahai orang-orang yang beriman! bertakwalah kepada Allah dengan sungguh-sungguh berupaya melaksanakan perintah-Nya dan menjauhi larangan-Nya, dan hendaklah kamu bersama dengan orang-orang yang benar, jujur dalam ucapan, perilaku dan perbuatannya. Ayat ini berisi kecaman terhadap orang-orang yang tidak ikut berperang dan memilih bersenang-senang di rumah mereka. Tidak pantas bagi penduduk madinah dan orang-orang arab badui yang berdiam di sekitar mereka, yaitu di sekitar kota madinah, tidak turut menyertai rasulullah pergi berperang, dan tidak pantas pula bagi mereka lebih mencintai diri mereka daripada mencintai diri rasul. Yang demikian itu tidak wajar, karena mereka tidak ditimpa kehausan karena panas terik dan sulitnya mendapatkan air, tidak kepayahan dan kelaparan karena terbatasnya makanan ketika berjuang di jalan Allah, dan tidak pula menginjak atau menduduki suatu tempat yang membangkitkan amarah orang-orang kafir lantaran keberanian dalam menegakkan kalimat Allah, dan tidak menimpakan suatu bencana kepada musuh, yakni menyebabkan musuh terluka atau terbunuh, kecuali semua itu akan dituliskan oleh malaikat bagi mereka sebagai suatu amal kebajikan yang layak mendapatkan pahala dari Allah. Sungguh, Allah tidak menyia-nyiakan pahala orang-orang yang berbuat baik."
  }
]