[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya pelanggaran mereka terhadap kandungan perjanjian-perjanjian yang telah kalian jalin kuat dengan mereka, dan mereka menampakan celaan terhadap agama islam, maka perangilah mereka. Sesungguhnya mereka itu pimpinan-pimpinan kesesatan, tidak ada perjanjian dan perlindungan bagi mereka, hingga mereka berhenti dari kekafiran mereka dan permusuhan mereka terhadap islam."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Jika orang-orang musyrik yang telah mengadakan perjanjian untuk tidak berperang dengan kalian sampai batas waktu tertentu itu melanggar perjanjian mereka, mencela dan menghina agama kalian, maka perangilah mereka. Mereka adalah para pemimpin dan pemuka kekafiran. Mereka tidak memiliki perjanjian yang dapat melindungi darah mereka. Perangilah mereka agar mereka berhenti dari kekafiran mereka, berhenti melanggar perjanjian mereka, dan berhenti menghina agama kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "12. Dan jika mereka melanggar perjanjian yang kalian sepakati dengan mereka, menghina agama kalian, dan menghalangi manusia dari agama tersebut dengan melakukan penuduhan terhadap al-Qur’an dan Rasulullah; maka perangilah mereka, karena mereka adalah pemimpin kekafiran, agar mereka berhenti dari kekafiran dan melanggar perjanjian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "12. وَإِن نَّكَثُوٓا۟ أَيْمٰنَهُم مِّنۢ بَعْدِ عَهْدِهِمْ (Jika mereka merusak sumpah (janji)nya sesudah mereka berjanji) Yakni apabila mereka melanggar perjanjian yang mereka sepakati dengan kaum muslimin yang mereka teguhkan dengan sumpah dan mereka juga mengolok agama Islam maka wajib bagi orang-orang beriman untuk memerangi mereka. أَئِمَّةَ الْكُفْرِ ۙ (pemimpin-pemimpin orang-orang kafir) Yakni para pemuka dan pemimpin mereka secara umum. إِنَّهُمْ لَآ أَيْمٰنَ لَهُمْ(karena sesungguhnya mereka itu adalah orang-orang (yang tidak dapat dipegang) janjinya) Yakni sumpah-sumpah orang-orang kafir yang melanggar meskipun secara hukum merupakan sumpah namun hakikatnya bukan merupakan sumpah yang dapat melindungi darah dan harta mereka. لَعَلَّهُمْ يَنتَهُونَ(agar supaya mereka berhenti) Yakni dari kekafiran dan pelanggaran mereka serta tuduhan mereka terhadap agama Islam."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12 Jika mereka merusak sumpah janjinya sesudah mereka berjanji untuk menepatinya, dan mereka mencerca agamamu, maka perangilah pemimpin-pemimpin orang-orang kafir itu, karena sesungguhnya mereka itu adalah orang-orang yang tidak dapat dipegang janjinya, agar supaya mereka berhenti dari kekufuran dan memerangi orang muslim. Dua ayat ini adalah pilihan untuk orang musyrik yaitu antara taubat atau perang"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika mereka melanggar} membatalkan {sumpah mereka} sumpah mereka {sesudah perjanjian mereka dan menistakan} menjelekkan {agama kalian, maka perangilah para pemimpin} para pemimpin {kekufuran itu. Sesungguhnya mereka adalah orang-orang yang tidak dapat dipegang sumpahnya} tidak ada sumpah mereka yang benar {agar mereka berhenti"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "12. Allah befirman setelah menjelaskan bahwa orang-orang musrik yang dalam perjanjian, jika mereka tetap memegang teguh perjanjian mereka, maka penuhilah perjanjian tersebut. “jika mereka merusak sumpah janjinya setelah mereka berjanji.” Yakni, mereka melanggarnya dan membatalkannya, lalu mereka memerangimu atau membantu memerangimu atau mengurusi isi perjanjianmu, “dan mereka mencerca agamamu,” yakni mencelanya dan menghinakannya, termasuk dalam hal itu adalah semua cercaan yang ditujukan kepada agama atau kepada Al-Qur’an, “maka perangilah pemimpin-pemimpin orang-orang kafir itu.” Yakni, para pembesarnya, para pemuka yang mencerca agama Allah, yang membantu agama setan. Mereka disebut secara khusus karena besarnya kejahatan mereka, dan karena selian mereka hanyalah pengikut, serta untuk menunjukan bahwa barangsiapa mencerca agama dan menantang untuk menolaknya, maka dia termasuk pemimpin kekufuran, “karena sesugguhnya mereka adalah orang-orang yang tidak dapat dipegang janjianya.” Yakni tiada perjajian yang selalu pegang teguh, tetapi sebaliknya, mereka selau memebatalkannya dan mengikarinya, tanpa bisa dipercaya “agar upaya mereka”, kerana kamu memeranginya “berhenti,” dari mencerca agamamu, dan mungkin memeluknya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 12: Seperti memerangi kamu atau membantu pihak lain memerangi kamu. Atau kepada Al Qur’an. Yakni mereka yang mencerca agama Allah dan membela jalan setan. Disebutkannya “pemimpin-pemimpin kafir itu” karena kejahatan mereka lebih besar daripada yang lain, dan lagi yang lain hanyalah mengikuti mereka. Demikian juga untuk menunjukkan bahwa orang yang mencerca agama termasuk pemimpin kekafiran. Dengan kamu memerangi mereka. Dari mencerca agamamu, bahkan bisa saja masuk ke agamamu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 12",
    "description": "Jika pilihan bertobat ternyata tidak mereka hiraukan dan mereka tetap menunjukkan sikap permusuhan kepada umat islam, maka ayat ini memberikan pilihan lain, yaitu berperang. Dan jika mereka melanggar sumpah setelah ada perjanjian dengan kamu, dan mencerca agamamu, baik melalui sikap maupun ucapan, maka perangilah pemimpin-pemimpin kafir itu. Sesungguhnya mereka adalah orang-orang yang tidak dapat dipegang janjinya, sehingga menjadi sangat wajar jika perjanjian dengan mereka tidak dilanjutkan. Kalaulah mereka terus mengganggu, maka perangilah mudah-Mudahan mereka berhenti mengganggu dan menganiaya siapa pun. Ayat sebelumnya memerintahkan kaum muslim untuk memerangi kaum musyrik yang merusak perjanjian, maka ayat-ayat berikut ini menjelaskan alasan memerangi mereka. Mengapa kamu tidak memerangi orang-orang yang melanggar sumpah janjinya, untuk tidak saling mengganggu selama sepuluh tahun, juga perjanjian-perjanjian lainnya yang sering mereka langgar, dan telah merencanakan untuk mengusir rasul, dari kediaman beliau bahkan mereka sangat bernafsu untuk membunuh beliau dan mereka yang pertama kali memerangi kamu seperti dalam perang badar' apakah kamu takut kepada mereka, hanya karena mereka didukung oleh kekuatan senjata dan pasukan yang banyak, padahal Allah-lah yang lebih berhak untuk kamu takuti, karena dialah yang mahaperkasa yang tidak mungkin dikalahkan oleh siapa pun jika memang kamu benar-benar orang-orang beriman dengan mantap."
  }
]