[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidak sepatutnya bagi penduduk kota rasulullah (Madinah) dan penduduk sekitar mereka dari pada penduduk pedalaman untuk lebih suka tetap tinggal di tengah keluarga dan rumah-rumah mereka, membiarkan rasulullah , dan mereka merasa lega untuk santai, sedang rasulullah berada dalam kepayahan dan kesulitan. Yang demikian itu, lantaran sesungguhnya tidaklah mereka tertimpa dalam perjalanan dan jihad mereka kehausan, keletihan, lapar di jalan Allah, dan tidaklah mereka menginjak suatu tempat yang dapat menyulut kemarahan orang-orang kafir karena keberadaan mereka disana, dan tidaklah mereka menimpakan pada musuh Allah dan musuh mereka pembunuhan dan kekalahan, kecuali dituliskan bagi mereka disebabkan semua itu sebagai pahala amal shalih. Sesungguhnya Allah tidak menyia-nyiakan pahala orang-orang yang berbuat kebaikan ang telah berbuat baik dengan kecekatan mereka dalam melaksanakan perintah Allah, dan pelaksanaan kewajiban mereka terhadap hak Allah dan hak makhlukNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "120. Tidak ada hak bagi penduduk Madinah dan orang-orang badui yang tinggal di sekitarnya untuk tidak bergabung bersama Rasulullah -ṣallallāhu 'alaihi wa sallam- apabila beliau berangkat ke medan jihad. Tidak sepatutnya mereka menyayangi dan melindungi nyawa mereka sendiri dengan merelakan nyawa nabi -ṣallallāhu 'alaihi wa sallam- terancam bahaya. Seharusnya mereka rela mengorbankan nyawa mereka untuk melindungi nyawa nabi. Hal itu karena setiap rasa haus, rasa letih, dan rasa lapar yang mereka rasakan di jalan Allah, setiap negeri yang mereka singgahi, yang aksi mereka itu memicu kemarahan orang-orang kafir, dan apa saja yang mereka dapatkan dari musuh, seperti keberhasilan mereka membunuh musuh atau menangkapnya, atau mengambil harta bendanya, atau kekalahan darinya, semuanya pasti dicatat oleh Allah sebagai pahala amal saleh yang diterima oleh-Nya dari mereka. Sesungguhnya Allah tidak akan menyia-nyiakan ganjaran orang-orang yang berbuat kebajikan. Dia pasti akan memberi mereka balasan yang sempurna dan bahkan memberikan tambahan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "120-121. Kemudian Allah menyampaikan kepada penduduk Madinah dari kalangan Muhajirin dan Anshar, dan orang-orang badui yang beragama Islam yang tinggal di sekitar Madinah, bahwa mereka tidak selayaknya enggan pergi berjihad dengan Rasulullah di jalan Allah, dan mencari kenyamanan diri sedangkan Rasulullah berada dalam kesulitan. Hal ini karena segala kesulitan yang mereka rasakan akan menjadi amal shalih mereka; sehingga tidaklah mereka merasakan kehausan, keletihan, dan kelaparan ketika berjihad di jalan Allah, menempati suatu tempat yang dapat memancing kemurkaan orang-orang kafir, dan terbunuh atau tertawan musuh, melainkan mereka akan mendapatkan pahalanya dan itu menjadi amalan yang mendekatkan mereka kepada Allah. Allah tidak akan menyia-nyiakan pahala orang-orang baik. Dan tidaklah mereka menginfakkan harta di jalan Allah, baik itu dengan harta yang banyak maupun sedikit, dan melewati suatu lembah atau negeri melainkan Allah akan memberi mereka pahala yang baik, agar Allah membalas mereka dengan balasan yang baling bai katas kebaikan mereka. Dari Ibnu ‘Abbas, ia berkata: ayat (إلا تنفروا يعذبكم عذابا أليما) dan ayat (ما كان لأهل المدينة) sampai at-Taubah: 121 (يعملون); ayat-ayat ini telah dinasakh (dihapus) dengan ayat setelahnya (وما كان المؤمنون لينفروا كافة). (Diriwayatkan oleh Abu Daud dalam as-Sunan, no. 2505, kitab jihad, bab nasakh kewajiban berjihad untuk seluruh muslimin menjadi sebagian muslimin. Al-Albani berkata: Ini adalah hadits hasan, Shahih Abu Daud 2/475-476, no. 2187)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "120. مَا كَانَ لِأَهْلِ الْمَدِينَةِ (Tidaklah sepatutnya bagi penduduk Madinah) Yakni tidak layak bagi penduduk Madinah. وَمَنْ حَوْلَهُم مِّنَ الْأَعْرَابِ(dan orang-orang Arab Badwi yang berdiam di sekitar mereka) Seperti suku Mazinah, Juhainah, dan Asyja’. أَن يَتَخَلَّفُوا۟ عَن رَّسُولِ اللهِ(tidak turut menyertai Rasulullah (berperang)) Yakni tidak layak bagi mereka untuk tidak ikut serta dalam perang Tabuk atau lainnya apabila Rasulullah pergi berperang. Berbeda dengan orang-orang Arab lainnya yang tidak diharuskan untuk pergi berperang, sebab mereka dekat dan bertetangga dengan Rasulullah sehingga lebih wajib untuk menolong dan mengikuti jejak Rasulullah. وَلَا يَرْغَبُوا۟ بِأَنفُسِهِمْ عَن نَّفْسِهِۦ ۚ( dan tidak patut (pula) bagi mereka lebih mencintai diri mereka daripada mencintai diri Rasul) Yakni mereka tidak layak untuk kikir dengan dirinya dan terus berusaha untuk melindungi diri mereka namun mereka tidak kikir dengan diri Rasulullah dan tidak mau berusaha melindunginya. Namun yang wajib mereka lakukan adalah memikul kesusahan bersamanya, berjihad bersamanya melawan musuh-musuh yang kuat, dan mengorbankan diri mereka demi diri Rasulullah. ذٰلِكَ(Yang demikian itu) Yakni kewajiban untuk mengikuti Rasulullah. Makna (الظمأ) yakni rasa haus. Makna (النصب) yakni rasa lelah. Makna (المخمصة) yakni rasa lapar yang berat sampai nampak terlihat isi perut. فِى سَبِيلِ الله (pada jalan Allah) Dalam ketaatan kepada Allah dan jihad melawan musuh-musuh-Nya. وَلَا يَطَـُٔونَ مَوْطِئًا يَغِيظُ الْكُفَّارَ (dan tidak (pula) menginjak suatu tempat yang membangkitkan amarah orang-orang kafir) Tidaklah mereka menginjak tempat orang-orang kafir dengan kaki-kaki mereka atau dengan kaki kuda-kuda mereka, yang menyebabkan kemarahan orang-orang kafir. وَلَا يَنَالُونَ مِنْ عَدُوٍّ نَّيْلًا(dan tidak menimpakan sesuatu bencana kepada musuh) Berupa pembunuhan, penyandraan, kekalahan, maupun harta rampasan. إِلَّا كُتِبَ لَهُم بِهِۦ عَمَلٌ صٰلِحٌ ۚ( melainkan dituliskanlah bagi mereka dengan yang demikian itu suatu amal saleh) Yakni amal baik yang diterima dan akan dibalas oleh Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "120. Tidak boleh dan tidak dibenarkan bagi penduduk Madinah dan sekitarnya berupa kaum Muhajirin dari orang-orang gurun seperti Bani Muzainah, Juhainah dan Asyja’ untuk mengabaikan Rasulallah SAW saat perang Tabuk atau perang lainnya. Dan sebaiknya mereka tidak terlalu mementingkan dan mencintai diri sendiri dengan penuh ketenangan, ketentraman dan penjagaan, serta mendahulukan untuk menjaga diri sendiri daripada Nabi SAW. Larangan untuk mundur itu karena mereka tidak menghadapi sesuatu berupa haus, lelah dan lapar karena mengharap ridha Allah, memuliakan agamanya dan berjihad melawan musuhNya. Dan mereka tidak menginjakkan kaki mereka atau kuda-kuda mereka pada tempat yang membuat orang kafir marah. Mereka juga tidak menimpakan apapun kepada musuh berupa harta, pembantaian dan tawanan kecuali dituliskan bagi mereka catatan amal mereka (mujahid) sebagai amal baik yang diterima dan mendapatkan imbalan yang berlimpah. Sesungguhnya Allah menjaga dan tidak menyempitkan imbalan atas amal orang-orang baik"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidak sepatutnya} tidak sepantasnya {bagi penduduk Madinah dan di sekitar mereka yaitu orang-orang Arab Badui} penduduk Badui {untuk tidak ikut dengan Rasulullah dan tidak pantas bagi mereka untuk lebih mencintai diri mereka daripada Rasul} mereka tidak ingin diri mereka mengalami kekurangan dan tertinggal, sedangkan Rasulullah SAW dalam kesusahan dan kelelahan {Demikian itu karena mereka tidak ditimpa kehausan} kehausan {kepayahan} kelelahan {dan kelaparan} kelaparan {di jalan Allah; dan tidak menginjak suatu tempat} tidak tinggal di suatu tempat tinggal {yang membuat marah} membuat marah dan membuat sedih {orang-orang kafir; dan tidak menimpakan} tidak menimpakan {kepada musuh suatu bencana} kematian, penawanan, harta rampasan, atau kekalahan {kecuali itu akan dituliskan bagi mereka sebagai suatu amal kebajikan. Sesungguhnya Allah tidak menyia-nyiakan pahala orang-orang yang berbuat baik"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "120. Allah berfirman mendorong penduduk Madinah dari orang-orang MUhajirin dan Anshar serta orang-orang Arab Badui yang telah masuk Islam dengan baik, “Tidaklah sepatutnya bagi penduduk Madinah dan orang-orang Arab Badui yang berdiam diri sekitar mereka, tidak turut menyertai Rasulullah (pergi berperang).” Yakni hal itu tidak layak dan tidak sesuai dengan keadaan mereka. “Dan tidak patut (pula) bagi mereka lebih mencintai diri mereka”, dalam keberadaannya, ketenangannya, dan ketentramannya “daripada mencintai diri Rasul”, yang mulia lagi suci, akan tetapi Nabi lebih berhak untuk dicintai orang-orang Mukmin daripada diri mereka sendiri, maka wajib atas setiap Muslim menebus dirinya untuk Nabi dan mendahulukan beliau di atas dirinya. Tanda penghormatan, kecintaan, dan keimanan yang sempurna kepada Rasul adalah selalu menyertai beliau pergi berperang. Kemudian Allah menyebutkan pahala yang mendorong kaum Mukminin untuk pergi berperang, maka Dia berfirman, “Yang demikian itu ialah karena mereka”, yaitu orang-orang yang berjihad di jalan Allah “tidaklah ditimpa kehausan, kepayahan”, yakni, kesulitan dan kesengsaraan, “dan kelaparan pada jalan Allah.” “Dan tidak (pula) menginjak suatu tempat yang membangkitkan amarah orang-orang kafir”, dengan menyerang daerah mereka dan menguasai negeri mereka “Dan tidak menimpakan sesuatu bencana kepada musuh,” seperti kemenangan atas pasukan musuh atau bala tentara atau harta rampasan perang, “melainkan dituliskanlah bagi mereka dengan yang demikian itu suatu amal shalih.” Karena ini adalah akibat yang timbul dari amal mereka. “Sesungguhnya Allah tidak menyia-nyiakan pahala orang-orang yang berbuat baik,” yaitu orang-orang yang berbuat baik dengan bersegera menjalankan perintah Allah, melaksanakan apa yang menjadi hakNya dan hak makhlukNya. Perbuatan-perbuatan ini adalah akibat dari amal mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 120: Yakni dilarangnya mereka berbuat begitu. Yaitu memasuki daerah mereka atau menguasainya. Membunuh, menawan atau mengambil harta rampasan perang dari mereka. Karena yang demikian merupakan atsar (bekas) dari amal mereka. Bahkan akan membalasnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 120",
    "description": "Ayat ini berisi kecaman terhadap orang-orang yang tidak ikut berperang dan memilih bersenang-senang di rumah mereka. Tidak pantas bagi penduduk madinah dan orang-orang arab badui yang berdiam di sekitar mereka, yaitu di sekitar kota madinah, tidak turut menyertai rasulullah pergi berperang, dan tidak pantas pula bagi mereka lebih mencintai diri mereka daripada mencintai diri rasul. Yang demikian itu tidak wajar, karena mereka tidak ditimpa kehausan karena panas terik dan sulitnya mendapatkan air, tidak kepayahan dan kelaparan karena terbatasnya makanan ketika berjuang di jalan Allah, dan tidak pula menginjak atau menduduki suatu tempat yang membangkitkan amarah orang-orang kafir lantaran keberanian dalam menegakkan kalimat Allah, dan tidak menimpakan suatu bencana kepada musuh, yakni menyebabkan musuh terluka atau terbunuh, kecuali semua itu akan dituliskan oleh malaikat bagi mereka sebagai suatu amal kebajikan yang layak mendapatkan pahala dari Allah. Sungguh, Allah tidak menyia-nyiakan pahala orang-orang yang berbuat baik dan tidaklah mereka memberikan infak, baik yang kecil maupun yang besar dan tidak pula melintasi suatu lembah dalam rangka pengabdian kepada Allah, kecuali akan dituliskan bagi mereka sebagai amal kebajikan, untuk diberi balasan oleh Allah dengan yang lebih baik dan berlipatganda daripada apa yang telah mereka kerjakan."
  }
]