[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan tidaklah mereka menginfakan nafkah yang kecil maupun besar di jalan Allah dan tidaklah mereka menyebrangi lembah dalam perjalanan mereka bersama rasulullah dalam jihadnya, kecuali dituliskan bagi mereka pahala amal mereka itu, agar Allah memberikan balasan bagi mereka dengan balasan terbaik yang diterima mereka atas amal sholeh mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "121. Setiap mereka mengeluarkan harta, baik sedikit maupun banyak, dan setiap kali mereka melewati lembah pasti pengorbanan dan perjalanan mereka itu akan dicatat sebagai amal baik mereka untuk diberikan balasan yang setimpal dan kelak di Akhirat Allah akan memberi mereka ganjaran yang terbaik atas apa yang telah mereka perbuat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "121. وَلَا يُنفِقُونَ نَفَقَةً (dan mereka tiada menafkahkan suatu nafkah) Meski dengan sesuatu yang kecil dan tak berharga. وَلَا يَقْطَعُونَ وَادِيًا (dan tidak melintasi suatu lembah) Lembah yaitu semua celah yang terdapat diantara dua gunung atau bukit. إِلَّا كُتِبَ لَهُمْ(melainkan dituliskan bagi mereka) Yakni dicatat bagi mereka amal yang telah mereka kerjakan seperti berinfak atau melakukan perjalanan untuk berjihad. لِيَجْزِيَهُمُ اللهُ(karena Allah akan memberi balasan kepada mereka) dengan amalan itu sesuatu yang lebih baik dari apa yang telah mereka kerjakan)"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "121. Mereka tidak memberikan nafkah di jalan Allah baik sedikit atau banyak dan tidak menyeberangi lembah antara dua gunung di perjalanan mereka kecuali dicatat bagi mereka pahala yang baik, supaya Allah membalas mereka atas amal itu dengan sebaik-baik balasan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka tidak berinfak, baik yang kecil maupun yang besar, dan tidak melintasi} melewati {suatu lembah, kecuali dituliskan bagi mereka karena Allah akan membalas mereka dengan yang lebih baik daripada apa yang telah mereka kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "121. Kemudian Dia berfirman, “Dan mereka tiada menafkahkan suatu nafkah yang kecil dan tidak (pula) yang besar dan tidak melintasi suatu lembah”, pada waktu mereka pergi untuk memerangi musuh “ melainkan dituliskan bagi mereka (amal shalih pula), karena Allah akan memberi balasan kepada mereka (dengan balasan) yang lebih baik dari apa yang telah mereka kerjakan”, dan dari amal-amal ini jika ia diikhlaskan dan dimurnikan hanya untuk Allah. Ayat-ayat ini mengandung dorongan dan anjuran yang kuat bagi jiwa agar pergi berjihad di jalan Allah dan berharap pahala dari kesulitan-kesullitan yang dialami padanya. Dengannya mereka akan mendapatkan kemuliaan dan ketinggian dan akibat yang ditimbulkan oleh amal seorang hamba adalah mendapatkan pahala yang besar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 121: Dalam ayat-ayat di atas terdapat dorongan dan membuat rindu jiwa untuk pergi berjihad di jalan Allah dan mencari pahala terhadap kesulitan yang mereka rasakan, dan bahwa hal itu meninggikan derajat mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 121",
    "description": "Dan tidaklah mereka memberikan infak, baik yang kecil maupun yang besar dan tidak pula melintasi suatu lembah dalam rangka pengabdian kepada Allah, kecuali akan dituliskan bagi mereka sebagai amal kebajikan, untuk diberi balasan oleh Allah dengan yang lebih baik dan berlipatganda daripada apa yang telah mereka kerjakan. Pada ayat sebelumnya dijelaskan tentang pahala yang dijanjikan Allah kepada orang-orang yang berbuat baik. Pada ayat ini dijelaskan tentang pentingnya pembagian tugas kerja dalam kehidupan bersama dengan penegasan tidak sepatutnya orang-orang mukmin itu semuanya pergi ke medan perang sehingga hal yang lainnya terabaikan. Mengapa tidak ada sebagian dari setiap golongan di antara mereka yang pergi untuk bersungguh-sungguh memperdalam pengetahuan agama mereka dan untuk memberi peringatan dengan menyebarluaskan pengetahuan tersebut kepada kaumnya apabila mereka telah kembali dari berperang atau tugas apa pun, pengetahuan agama ini penting agar mereka dapat menjaga dirinya dan berhati-hati agar tidak melakukan pelanggaran."
  }
]