[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan tidak patut bagi kaum mukminin semuanya keluar memerangi musuh mereka, sebagaimana yang tidak dibenarkan bagi mereka untuk tinggal semua. Mengapa tidak keluar untuk berperang dan berjihad dari setiap golongan sejumlah orang yang memadai dan mewujudkan mashlahat;tujuannya agar orang-orang yang tinggal bisa mendalami agama Allah dan mengetahui apa yang terbaru dari hokum-hukum agama Allah dan wahyu yang diturunkan pada rasulNya, agar mereka nanti memperingatkan kaum mereka dengan ilmu yang mereka pelajari tatkala mereka kembali kepada kaumnya itu. Mudah-mudahan mereka takut kepada siksaan Allah dengan menjalankan perintah-perintahNya dan menjauhi larangan-laranganNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "122. Tidak semestinya orang-orang mukmin itu berangkat semua ke medan perang, karena mereka bisa ditumpas habis apabila musuh mereka berhasil mengalahkan mereka. Semestinya sebagian dari mereka pergi ke medan jihad dan sisanya tinggal di rumah untuk menemani Rasulullah -ṣallallāhu 'alaihi wa sallam- dan memperdalam ilmu agama melalui ayat-ayat Al-Qur`ān dan ketentuan-ketentuan hukum syariat yang mereka dengar dari nabi -ṣallallāhu 'alaihi wa sallam-, kemudian mereka bisa mengajarkan ilmu yang telah mereka pelajari kepada kaum mereka setelah kembali ke rumah mereka, agar mereka dapat menghindari azab dan hukuman Allah dengan cara menjalankan perintah-perintah-Nya dan menjauhi larangan-larangan-Nya. Hal ini terkait dengan pasukan-pasukan yang dikirim oleh Rasulullah ke berbagai daerah dan beranggotakan sejumlah sahabat pilihan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "122. Umat Islam membutuhkan pemahaman agama dalam segala perkara, maka tidak seharusnya orang-orang beriman yang mampu berjihad pergi berjihad seluruhnya, dan meninggalkan kaum muslimin yang lain tanpa ada orang faqih yang dapat dipilih Imam untuk mengajarkan urusan agama mereka. Namun seharusnya setiap pasukan terdiri dari utusan setiap kabilah, dan beberapa orang tetap tinggal untuk belajar ilmu syariat, dan untuk memberi pelajaran dan peringatan kepada pasukan ketika telah kembali ke negeri mereka, agar mereka takut terhadap azab Allah jika menyelisihi perintah-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "122. وَمَا كَانَ الْمُؤْمِنُونَ لِيَنفِرُوا۟ كَآفَّةً ۚ (Tidak sepatutnya bagi mukminin itu pergi semuanya (ke medan perang)) Dan meninggalkan kota Madinah kosong. مِن كُلِّ فِرْقَةٍ مِّنْهُمْ طَآئِفَةٌ (dari tiap-tiap golongan di antara mereka beberapa orang) Yakni berangkat berperang sebagian dari tiap-tiap golongan. Dan selebihnya tetap tinggal. لِّيَتَفَقَّهُوا۟( untuk memperdalam pengetahuan mereka) Yakni orang-orang yang tidak ikut berperang itu agar memperdalam ilmu mereka. فِى الدِّينِ(tentang agama) Yakni sekelompok dari golongan ini pergi untuk berperang dan sisanya tetap tinggal di dalam negeri untuk menuntut ilmu dan agar mereka dapat mengajari para pasukan perang apabila telah kembali dari peperangan. Bisa juga maknanya adalah: agar orang-orang yang pergi bersama Rasulullah itu mendalami ilmu tentang agama lewat apa yang mereka dengarkan dari Rasulullah dan yang mereka pelajari dari beliau seperti al-Qur’an, hukum-hukum agama dalam jihad, perang, interaksi dengan orang lain, dan lain sebagainya; sehingga mereka dapat mengajarkan kaumnya setelah ia kembali."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Ayat ini memberikan pemahaman bahwasanya menjadi tugas seseorang yang faham masalah agama adalah : istiqomah diatasnya dan mendirikan segala syari'at yang ditetapkan, tidak untuk merasa tinggi diantara ummat manusia. 2 ). Pada ayat ini ada pesan yang cukup sederhana namun memberikan dampak faidah yang sangat penting, yaitu : semestinya setiap muslimin mempersiapkan segala mashlahat yang ia dapatkan untuk kebaikan seluruh ummat, dan mempersiapkan waktu untuk menebarkan kemaslahatan itu, senantiasa berusaha untuknya, dan tidak perpaling kepada hal-hal yang menjauhkannya darinya, agar semua kebaikan dapat dirasakan oleh semua ummat, dan kemaslahatan yang paling baik adalah kemashlahatan agama dan dunia mereka, sekalipun jalan yang ditempuh terdapat banyak hambatan, karena sesungguhnya kemashlahatan ini memberikan kebaikan yang begitu besar bagi ummat. 3 ). Menuntut ilmu dan memperdalam ilmu agama Allah adalah bagian daripada jihad; oleh karena itu Allah menyebut orang yang keluar untuk menuntut ilmu adalah satu bagian dari kelompok jihad itu, Allah berfirman : { فَلَوْلَا نَفَرَ مِنْ كُلِّ فِرْقَةٍ مِنْهُمْ طَائِفَةٌ لِيَتَفَقَّهُوا فِي الدِّينِ } \"engapa tidak pergi dari tiap-tiap golongan di antara mereka beberapa orang untuk memperdalam pengetahuan mereka tentang agama\" dan ayat ini terletak diantara ayat-ayat jihad dalam surah at-taubah, sebelumnya Allah mengatakan : { مَا كَانَ لِأَهْلِ الْمَدِينَةِ وَمَنْ حَوْلَهُمْ مِنَ الْأَعْرَابِ أَنْ يَتَخَلَّفُوا عَنْ رَسُولِ اللَّهِ } \"Tidaklah sepatutnya bagi penduduk Madinah dan orang-orang Arab Badwi yang berdiam di sekitar mereka, tidak turut menyertai Rasulullah (berperang)\" [120], dan ayat setelahnya adalah : { يَا أَيُّهَا الَّذِينَ آمَنُوا قَاتِلُوا الَّذِينَ يَلُونَكُمْ مِنَ الْكُفَّارِ } \"Hai orang-orang yang beriman, perangilah orang-orang kafir yang di sekitar kamu itu\" [123]."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "122. Selayaknya orang-orang mukmin tidak pergi untuk berperang semuanya (Dikatakan bahwa agar pergi mencari ilmu) dan meninggalkan Madinah dalam keadaan kosong, namun pergi dalam kelompok-kelompok dari masing-masing kafilah. Dan sisa kelompok lainnya tinggal (di Madinah) untuk belajar agama dan ilmu syariat, serta mengingatkan kaumnya ketika mereka kembali kepadanya agar diajari ilmu yang sudah mereka pelajari berupa hukum halal haram supaya mereka mewaspadai hukuman Allah dengan mengerjakan perintahNya dan menjauhi laranganNya. Ayat ini turun ketika orang mukmin sangat ingin berjihad saat rasulullah SAW mengutus satu pasukan, lalu mereka pergi dan meninggalkan Nabi SAW di Madinah bersama sedikit orang."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidak sepatutnya orang-orang mukmin pergi semuanya} pergi untuk berjihad semua {Mengapa tidak pergi} mengapa tidak berangkat {dari setiap golongan} kafilah {satu kelompok} kelompok {untuk memperdalam pengetahuan agama mereka dan memberi peringatan kepada kaumnya apabila mereka telah kembali, agar mereka dapat menjaga dirinya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "122. Allah berfirman memperingatkan hamba-hambaNya yang beriman tentang apa yang semestinya mereka lakukan, “Tidak sepatutnya bagi orang-orang yang Mukmin itu pergi semuanya (ke medan perang).” Yakni semuanya untuk memerangi musuh mereka. Karena hal itu sangat menyulitkan mereka dan mengakibatkan terbengkalainya kepentingan-kepentingan yang lain. “Mengapa tidak pergi dari tiap-tiap golongan di antara mereka,” yakni dari kota-kota, kabilah-kabilah, dan suku-suku, “beberapa orang”, yang dengannya maksud yang diinginkan tercapai, niscaya itu lebih baik. Kemudian Allah mengingatkan bahwa menetapnya sebagian dari mereka dengan tidak berangkat berperang mengandung kemaslahatan lain yang tidak terwujud jika mereka semua berangkat perang, Dia berfirman, “Untuk memperdalam pengetahuan mereka”, yakni orang-orang yang tidak berangkat “tentang agama dan untuk memberi peringatan kepada kaumnya apabila mereka telah kembali kepadanya.” Yakni agar mereka belajar ilmu syari, mengetahui makna-maknanya, memahami rahasia-rahasianya, dan mengajarkan kepada selain mereka, dan agar mereka dapat memberi peringatan kepada kaumnya jika mereka kembali kepadanya. Ini mengandung keterangan tentang keutamaan ilmu, khususnya pemahaman dalam agama, dan bahwa ia adalah perkara terpenting, bahwa siapa yang mempelajari ilmu, maka dia harus menyebarkannya dan mengajarkannya kepada manusia serta memberi nasihat kepada mereka dengannya, karena menyebarnya ilmu dari seorang alim adalah termasuk keberkahannya dan pahalanya yang berkembang. Adapun seorang alim yang hanya membatasi ilmu pada dirinya,tidak mendakwakannya kepada jalan Allah dengan hikmah dan nasihat yang baik, serta tidak mengajarkannya kepada orang-orang bodoh yang tidak mengerti, maka manfaat apa yang didapat oleh kaum Muslimin darinya? Apa hasil dari ilmunya? Akhirnya dia mati dan ilmunya pun mati bersamanya, dan ini adalah hasil dari orang yang diberi ilmu dan pemahaman oleh Allah tetapi tidak mau mengajarkannya. Ayat ini juga mengandung dalil, petunjuk, dan arahan yang sangat halus kepada satu faidah penting, yaitu bahwa hendaknya kaum Muslimin menyediakan orang-orang khusus yang dapat menunaikan setiap kepentingan umum mereka, yang berkonsentrasi dan bersungguh-sungguh dalam melaksanakannya, tanpa menengok kepada selainnya, agar kepentingan kaum Muslimin bisa terlaksana dan kebaikan mereka bisa terpenuhi, dan agar arah pandang serta target yang mereka tuju adalah satu, yaitu menegakkan kemaslahatan agama dan dunia mereka, walaupun jalanNya berbeda-beda, dan caranya bermacam-macam. Jadi, perbuatannya beraneka ragam, namun targetnya adalah satu, dan ini termasuk hikmah yang bersifat umum yang berguna dalam segala urusan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 122: Setelah mereka ditegur oleh Allah karena tidak ikut berperang, maka ketika Nabi shallallahu 'alaihi wa sallam mengirimkan sariyyah (pasukan kecil), semuanya ikut berangkat, kemudian turunlah ayat di atas. Ayat ini menunjukkan keutamaan ilmu syar’i, dan bahwa orang telah mempelajari ilmu hendaknya menyebarkannya di tengah-tengah hamba Allah, karena tersebarnya ilmu dari orang ‘alim (berilmu) termasuk keberkahannya dan pahalanya yang akan berkembang untuknya. Adapun jika dibatasi untuk dirinya saja dan tidak didakwahkannya di jalan Allah dengan hikmah dan nasehat yang baik serta tidak mengajarkan orang-orang bodoh hal-hal yang tidak mereka ketahui, maka apa hasil yang diperoleh dari ilmunya? Dirinya akan mati, ilmu dan buahnya pun mati, dan hal ini sungguh sayang bagi orang yang diberikan ilmu dan kepahaman. Dalam ayat ini juga terdapat petunjuk dan pengarahan, yakni bahwa kaum muslimin hendaknya membagi-bagi tugas, ada orang yang khusus mengisi waktunya untuk suau maslahat dan bersungguh-sungguh terhadapnya tidak berpindah kepada yang lain agar maslahat mereka tegak dan manfaat menjadi sempurna, meskipun jalur yang dilewati berbeda-beda, amal yang dilakukan tidak sama, namun tujuannya satu, yaitu menegakkan maslahat agama dan dunia mereka. Dengan menyampaikan ilmu kepada mereka. Dari siksaan Allah dengan melaksanakan perintah-Nya dan menjauhi larangan-Nya. Ibnu Abbas berkata, “Ayat ini khusus dengan sariyyah (pasukan kecil),” sedangkan ayat sebelumnya yang melarang seorang pun sahabat tidak ikut berperang adalah apabila Nabi shallallahu 'alaihi wa sallam ikut berperang (ghazwah)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 122",
    "description": "Pada ayat sebelumnya dijelaskan tentang pahala yang dijanjikan Allah kepada orang-orang yang berbuat baik. Pada ayat ini dijelaskan tentang pentingnya pembagian tugas kerja dalam kehidupan bersama dengan penegasan tidak sepatutnya orang-orang mukmin itu semuanya pergi ke medan perang sehingga hal yang lainnya terabaikan. Mengapa tidak ada sebagian dari setiap golongan di antara mereka yang pergi untuk bersungguh-sungguh memperdalam pengetahuan agama mereka dan untuk memberi peringatan dengan menyebarluaskan pengetahuan tersebut kepada kaumnya apabila mereka telah kembali dari berperang atau tugas apa pun, pengetahuan agama ini penting agar mereka dapat menjaga dirinya dan berhati-hati agar tidak melakukan pelanggaran. Setelah dijelaskan pentingnya memperdalam pengetahuan agama dan menyebarluaskannya kepada masyarakat luas, lalu dijelaskan sikap ketika menghadapi orang kafir yang memusuhi orang mukmin. Wahai orang-orang yang beriman! perangilah orang-orang kafir yang di sekitar kamu apabila mereka memerangi kamu, dan hendaklah mereka merasakan, mengetahui dan menyaksikan sikap tegas dan semangat juang yang tinggi darimu, dan ketahuilah bahwa Allah beserta orang-orang yang bertakwa. Oleh karena itu jangan pernah putus asa apalagi menyerah."
  }
]