[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang yang beriman kepada Allah dan rasulNya, serta melaksanakan syariatNya, mulailah memerangi golongan orang-orang kafir yang terdekat dengan negeri islam dan begitu selanjutnya, dan biarlah mereka mendapati pada diri kalian sikap tegas dan ketegasan. Dan ketahuilah bahwa sesungguhnya Allah bersama orang-orang yang bertakwa dengan dukungan dan pertolonganNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "123. Allah -Ta'ālā- memerintahkan kepada orang-orang mukmin agar memerangi orang-orang kafir yang ada di dekat mereka, karena keberadaan orang-orang kafir di dekat mereka itu merupakan ancaman bagi mereka. Allah juga memerintahkan kepada orang-orang mukmin agar memperlihatkan kekuatan dan ketangguhan mereka untuk menakut-nakuti orang-orang kafir dan melawan kejahatan mereka. Dan Allah -Ta'ālā- bersama dengan orang-orang mukmin yang bertakwa dengan pertolongan dan dukungan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "123. Allah memerintahkan orang-orang beriman untuk memerangi orang-orang kafir yang menjadi musuh mereka, dan menjelaskan agar memulai perang itu terhadap orang-orang kafir yang lebih dekat dengan negeri Islam terlebih dahulu, serta memerintahkan mereka untuk memperlakukan orang-orang kafir dengan penuh ketegasan dan keberanian, agar mereka berhenti dari kekafiran dan menganggu orang-orang beriman. Kemudian Allah menyebutkan pertolongan dan bantuan yang akan Dia berikan kepada orang-orang yang bertakwa."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "123. قٰتِلُوا۟ الَّذِينَ يَلُونَكُم مِّنَ الْكُفَّارِ(perangilah orang-orang kafir yang di sekitar kamu itu) Allah memerintahkan orang-orang beriman untuk bersungguh-sungguh dalam mererangi orang-orang kafir disekitar mereka. وَلْيَجِدُوا۟ فِيكُمْ غِلْظَةً ۚ( dan hendaklah mereka menemui kekerasan daripadamu) Allah memerintahkan mereka untuk memerangi orang-orang kafir yang berada di sekitar mereka dengan keras dan kuat. Berjihad diwajibkan dengan melawan seluruh orang-orang kafir, namun harus dimulai dengan orang-orang kafir yang tinggal paling dekat dengan para mujahidin. وَاعْلَمُوٓا۟ أَنَّ اللهَ مَعَ الْمُتَّقِينَ(dan ketahuilah, bahwasanya Allah bersama orang-orang yang bertakwa) Yakni Allah menolong orang yang bertakwa kepada-Nya dan berjihad di jalan-Nya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Dunia dan syaithon adalah dua musuh di luar dari dirimu.. sedangkan nafsu adalah musuhmu yang melekat dalam dirimu sendiri, dan diantara sunnah jihad adalah : { قَاتِلُوا الَّذِينَ يَلُونَكُمْ } \"perangilah orang-orang yang di sekitar kamu itu\" yakni perangilah nafsu yang melekat pada dirimu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "123. Wahai orang-orang mukmin, jika telah terpenuhi syarat dan ketentuan perang, maka mulailah memerangi orang-orang kafir terdekat dengan rumah-rumah Islam, dan dalam peperangan hendaklah mereka mendapatkan penderitaan dan kekerasan, serta keberanian dan kesabaran. Ketahuilah bahwa Allah itu bersama orang-orang yang bertakwa dengan memberi pertolongan, perlindungan dan bantuan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, perangilah orang-orang kafir di sekitar kalian} yang ada di sebelah kalian {dan hendaklah mereka merasakan dari kalin suatu sikap tegas} keras dan kuat {Ketahuilah sesungguhnya Allah bersama orang-orang yang bertakwa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "123. Ini adalah petunjuk lain: setelah Allah membimbing mereka untuk mengatur orang-orang yang terjun berperang, Dia kemudian membimbing mereka agar mulai memerangi orang-orang kafir yang paling dekat, lalu yang terdekat berikutnya, bersikap keras kepada mereka, tegas, berani, dan kokoh dalam memerangi mereka. “Dan ketahuilah, bahwasanya Allah beserta orang-orang yang bertakwa.” Yakni hendaknya kamu mengetahui bahwa pertolongan Allah datang sesuai dengan ketakwaaan, maka pegang teguhlah takwa secara terus menerus, niscaya Dia menolongmu dan membantumu melawan musuhmu. Keumuman pada Firman Allah, “Perangilah orang-orang kafir yang di sekitar kamu,” dikhususkan dari ayat ini dengan suatu keadaan ketika kemaslahatan ada pada memerangi orang-orang kafir yang jauh, dan jenis-jenis kemaslahatan (itu sendiri) sangatlah banyak."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 123: Ini pun termasuk pengarahan juga, yakni setelah diatur sapa yang berangkat berperang dan siapa yang belajar agama, maka Allah mengarahkan mereka dengan memulai yang bisa dilakukan, yaitu bersikap tegas, keras dalam berperang, berani dan teguh pendirian. Keumuman ini ditakhshis (dikhususkan), jika maslahat terletak dalam memerangi yang tidak di sekitar kita. Dengan memberikan pertolongan dan pembelaan. Oleh karena itu, hedaknya kamu mengetahui, bahwa pertolongan Allah turun bersama ketakwaan, oleh karenanya tetaplah bertakwa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 123",
    "description": "Setelah dijelaskan pentingnya memperdalam pengetahuan agama dan menyebarluaskannya kepada masyarakat luas, lalu dijelaskan sikap ketika menghadapi orang kafir yang memusuhi orang mukmin. Wahai orang-orang yang beriman! perangilah orang-orang kafir yang di sekitar kamu apabila mereka memerangi kamu, dan hendaklah mereka merasakan, mengetahui dan menyaksikan sikap tegas dan semangat juang yang tinggi darimu, dan ketahuilah bahwa Allah beserta orang-orang yang bertakwa. Oleh karena itu jangan pernah putus asa apalagi menyerah. Setelah dijelaskan kebolehan orang mukmin memerangi orang yang melakukan penyerangan, lalu dijelaskan perbedaan antara orang munafik dengan orang yang beriman apabila mendengar bacaan alqur'an. Dan apabila diturunkan suatu surah dari Al-Qur'an yang berisi ajakan beriman, maka di antara mereka, yakni orang-orang munafik ada yang berkata sebagai nada ejekan, siapakah di antara kamu, sesama munafik, yang bertambah imannya dengan turunnya surah ini' adapun orang-orang yang beriman, maka surah yang diturunkan ini menambah imannya yang selama ini sudah tertanam di dada mereka, dan mereka merasa gembira dengan bertambahnya pengetahuan mereka lantaran ayat-ayat tersebut."
  }
]