[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apabila Allah menurunkan satu surat dari surat-surat al-qur’an kepada rasulNya, maka ada dari orang-orang munafik yang berkata, (sebagai bentuk pengingkaran dan mengolok-olok), ”siapakah diantara kalian yang surat ini menambah imannya kepada Allah dan ayat-ayatNya? Maka adapun orang-orang yang beriman kepada Allah dan rosulNya, turunnya surat itu menambah keimanan mereka dengan mengetahuinya, mentadaburinya dan meyakininya serta mengamalkannya.Dan mereka bergembira dengan apa yang Allah berikan kepada mereka berupa keimanan dan keyakinan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "124. Apabila Allah menurunkan sebuah surah (Al-Qur`ān) kepada rasul-Nya -ṣallallāhu 'alaihi wa sallam-, maka sebagian orang munafik akan bertanya dengan nada mengejek dan menghina, \"Siapa di antara kalian yang imannya kepada ajaran yang dibawa Muhammad bertambah karena surah itu?\" Sedangkan orang-orang yang beriman kepada Allah dan percaya kepada rasul-Nya pasti turunnya surah itu akan menambah iman mereka yang sudah ada sebelumnya. Mereka pasti gembira dengan turunnya wahyu dari Allah, karena wahyu itu membawa banyak manfaat bagi mereka di dunia dan Akhirat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "124. Jika suatu surat al-Qur’an yang agung diturunkan, orang-orang munafik menghinanya dengan saling berkata di antara mereka: “Siapa di antara kalian yang bertambah keimanannya kepada Allah dengan turunnya surat ini?” Adapun orang-orang beriman, mereka bertambah keimanannya dengan turunnya surat ini, karena mengandung petunjuk dan tanda-tanda yang menunjukkan keagungan Allah; dan mereka berbahagia dengan turunnya cahaya dan pahala ini."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "124. وَإِذَا مَآ أُنزِلَتْ سُورَةٌ فَمِنْهُم (Dan apabila diturunkan suatu surat maka di antara mereka) Yakni diantara orang-orang munafik. مَّن يَقُولُ(ada yang berkata) Kepada sesama mereka. أَيُّكُمْ زَادَتْهُ هٰذِهِۦٓ( Siapakah di antara kamu dengan surat ini?) Yakni dengan surat yang turun ini. إِيمٰنًا ۚ( yang bertambah imannya) Mereka mengatakan demikian untuk mengolok-olok orang-orang beriman. فَأَمَّا الَّذِينَ ءَامَنُوا۟ فَزَادَتْهُمْ إِيمٰنًا(Adapun orang-orang yang beriman, maka surat ini menambah imannya) Yakni turunnya surat ini menambah keimanan mereka kepda Allah dan kepercayaan mereka kepada kitab dan kabar berita-Nya yang mengandung pelajaran dan bukti-bukti. Dan turunnya surat ini menambah tugas dan kewajiban dalam beramal dan berjihad sehingga bertambah pula amalan mereka dalam ketaatan kepada Allah. وَهُمْ يَسْتَبْشِرُونَ(dan mereka merasa gembira) Dengan turunnya wahyu ini dan manfaat duniawi dan ukhrawi yang terkandung didalamnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "124. Wahai Rasul, jika turun kepadamu surah Al-Qur’an, maka di antara orang-orang munafik ada yang berbicara kepada rekannya sembari mengejek: “Siapakah di antara kalian yang imannya kepada Allah melalui surah ini?” Adapun orang-orang mukmin maka surah ini menambah iman mereka kepada Allah dan kitabNya. Mereka bahagia dengan turunnya surah itu dan manfaat yang terkandung di dalamnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apabila diturunkan suatu surah, maka di antara mereka ada yang berkata,“Siapakah di antara kalian yang bertambah imannya dengan surah ini?” Adapun orang-orang yang beriman, maka surah ini menambah iman mereka dan mereka merasa gembira} gembira dengan turunnya Al-Qur’an"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "124. Allah berfirman menjelaskan keadaan orang-orang munafik dan orang-orang Mukmin pada saat turunnya al-Quran dan perbedaan antara kedua kelompok, Dia berfirman “Dan apabila diturunkan suatu surat”, yang berisi suatu perintah, larangan, berita tentang DiriNya yang mulia, dan tentang perkara-perkara ghaib, serta dorongan kepada jihad, “maka di antara mereka (orang-orang munafik) ada yang berkata, ‘Siapakah di antara kamu yang bertambah imannya dengan (turunnya) surat ini?’ yakni muncul pertanyaan tentang siapa yang bertambah imannya dari kedua kelompok itu. Allah berfirman menjelaskan kondisi sebenarnya, “adapun orang-orang yang beriman, maka surat ini menambah imannya”, dengan mengetahui, memahami, meyakini, dan mengamalkannya, serta keinginan kepada perbuatan baik dan menahan diri dari perbuatan buruk, “sedang mereka merasa gembira.” Yakni sebagian mereka menyampaikan berita gembira kepada sebagian yang lain dengan nikmat Allah kepada mereka dalam bentuk diturunkannya ayat-ayatNya, bimbingan kepada memahaminya dan mengamalkannya. Ini menunjukkan kelapangan dada mereka terhadap ayat-ayat Allah, ketenangan hati mereka, dan bersegeranya kepatuhan mereka dalam menanggapi ajakanNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 124: Dalam ayat ini Allah Subhaanahu wa Ta'aala menerangkan tentang keadaan orang-orang munafik dan keadaan orang-orang mukmin ketika turun ayat Al Qur’an. Yang berisi perintah, larangan, berita tentang Diri Allah, tentang perkara-perkara ghaib atau dorongan untuk berjihad. Kepada kawan-kawannya sambil mengolok-olok. Dalam ayat ini terdapat dalil, bahwa iman dapat bertambah dan berkurang. Ia bertambah dengan ketaatan dan berkurang dengan kemaksiatan. Baik dengan mengetahuinya, memahaminya, meyakininya, mengamalkannya, berkeinginan mengerjakan kebaikan, dan menahan diri dari mengerjakan keburukan. Ayat ini menunjukkan lapangnya dada mereka terhadap ayat-ayat Allah, hatinya tenteram dan segera tunduk."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 124",
    "description": "Setelah dijelaskan kebolehan orang mukmin memerangi orang yang melakukan penyerangan, lalu dijelaskan perbedaan antara orang munafik dengan orang yang beriman apabila mendengar bacaan alqur'an. Dan apabila diturunkan suatu surah dari Al-Qur'an yang berisi ajakan beriman, maka di antara mereka, yakni orang-orang munafik ada yang berkata sebagai nada ejekan, siapakah di antara kamu, sesama munafik, yang bertambah imannya dengan turunnya surah ini' adapun orang-orang yang beriman, maka surah yang diturunkan ini menambah imannya yang selama ini sudah tertanam di dada mereka, dan mereka merasa gembira dengan bertambahnya pengetahuan mereka lantaran ayat-ayat tersebut. Dan adapun orang-orang yang di dalam hatinya ada penyakit batin, seperti kekafiran, kemunafikan, keragu-raguan, dan sebagainya, maka dengan turunnya surah itu akan menambah kekotoran rohani, yakni kekafiran mereka yang telah ada selama ini dalam hati mereka dan mereka akan mati dalam keadaan kafir."
  }
]