[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sedangkan orang-orang yang didalam hati mereka terdapat kemunafikan dan keragu-raguan terhadap agama Allah, maka sesungguhnya turunnya surat itu akan menambah kemunafikan dan keragu-raguan pada mereka dari sebelumnya dari kemunafikan dan keragu-raguan yang ada pada mereka. Dan binasalah orang-orang tersebut.Dan mereka adalah orang-orang yang mengingkari Allah dan ayat-ayatNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "125. Sementara bagi orang-orang munafik turunnya ayat-ayat Al-Qur`ān yang berisi ketentuan-ketentuan hukum dan kisah-kisah nyata justru membuat mereka bertambah sakit hati dan keji, karena mereka mendustakan ayat-ayat tersebut. Maka sakit hati mereka akan bertambah dengan bertambahnya ayat-ayat Al-Qur`ān yang turun. Karena setiap ada ayat Al-Qur`ān yang turun mereka selalu meragukan apa yang terkandung di dalamnya dan mereka mati dalam kekafiran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "125. Sedangkan orang-orang munafik yang hatinya dipenuhi dengan keraguan, turunnya ayat ini hanya menambah keraguan dan kesesatan mereka. Dan mereka akan dibinasakan dalam keadaan mendustakan Allah dan ayat-ayat-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "125. وَأَمَّا الَّذِينَ فِى قُلُوبِهِم مَّرَضٌ (Dan adapun orang-orang yang di dalam hati mereka ada penyakit) Mereka adalah orang-orang munafik. فَزَادَتْهُمْ(maka dengan surat itu bertambahlah) Yakni dengan surat yang diturunkan ini. رِجْسًا إِلَىٰ رِجْسِهِمْ(kekafiran mereka, disamping kekafirannya (yang telah ada)) Yakni menambah kekafiran dan rusaknya kepercayaan mereka sehingga mereka semakin kokoh dalam kekafiran dan terus berlanjut didalamnya sampai mereka mati dalam keadaan kafir dan munafik."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Sesungguhnya hati orang-orang munafiq tidak akan menerima nasehat apapaun melainkan mereka akan semakin menjauh dari nasehat itu : { وَأَمَّا الَّذِينَ فِي قُلُوبِهِمْ مَرَضٌ فَزَادَتْهُمْ رِجْسًا إِلَىٰ رِجْسِهِمْ } \"Dan adapun orang-orang yang di dalam hati mereka ada penyakit, maka dengan surat itu bertambah kekafiran mereka, disamping kekafirannya (yang telah ada)\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "125. Adapun orang-orang munafik, maka surah yang turun itu menambah keraguan, kekufuran dan kemunafikan, serta kedengkian mereka, lalu mereka mati dalam kekufuran."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Adapun orang-orang yang di dalam hatinya ada penyakit} keraguan dan kemunafikan {maka itu akan menambah kekufuran} keraguan dan kekufuran {disamping kekufuran mereka (yang telah ada)} keraguan dan kekufuran mereka {dan mereka mati dalam keadaan kafir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "125. “Dan adapun orang-orang yang di dalam hati mereka ada penyakit”, yakni kebimbangan dan kemunafikan “maka dengan surat itu bertambah kekafiran mereka, di samping kekafirannya (yang telah ada).” Yakni menambahkan penyakit pada penyakit mereka (yang sudah ada), keraguan pada keraguan mereka (yang sudah ada), di mana mereka kufur kepadanya, menentangnya, dan berpaling darinya. Oleh karena itu penyakit mereka bertambah, yang menghantarkan mereka kepada kebinasaan, dan menjadikan hati mereka terkunci, sehingga “mereka mati dalam keadaan kafir.” Ini adalah hukuman bagi mereka karena mereka kafir kepada ayat-ayat Allah, dan mendurhakai RasulNya, maka Dia menimpakan kemunafikan ke dalam hati mereka sampai hari di mana mereka bertemu denganNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 125: Maksudnya penyakin batin seperti kekafiran, kemunafikan, keragu-raguan dan sebagainya Menambah penyakit yang telah ada dan menambah keraguan yang telah ada. Setelah sebelumnya hati mereka dicap. Yang demikian merupakan hukuman bagi mereka, karena mereka kafir kepada ayat-ayat Allah dan mendurhakai Rasul-Nya, maka Allah tanamkan kemunafikan di hati mereka sampai mereka bertemu dengan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 125",
    "description": "Dan adapun orang-orang yang di dalam hatinya ada penyakit batin, seperti kekafiran, kemunafikan, keragu-raguan, dan sebagainya, maka dengan turunnya surah itu akan menambah kekotoran rohani, yakni kekafiran mereka yang telah ada selama ini dalam hati mereka dan mereka akan mati dalam keadaan kafir. Dan tidakkah mereka orang-orang munafik dan kafir itu memperhatikan dengan saksama bahwa mereka diuji berupa penyakit, paceklik dan bencana alam yang terjadi sekali atau dua kali setiap tahun, namun mereka tidak juga bertobat dari kemunafikan dan kekafiran, dan tidak pula mengambil pelajaran dari berbag."
  }
]