[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidakkah orang-orang muanfik itu melihat bahwa sesungguhnya Allah menguji mereka dengan paceklik dan kesulitan hidup, dan dengan menampakan apa yang mereka sembunyikan berupa kemunafikan sekali atau dua kali dalam setiap tahun? kemudian meskipun demikian, mereka tidak mau bertaubat dari kekafiran dan kemunafikan mereka, dan mereka tidak mengambil pelajaran dan menjadikan sebagai peringatan dari apa yang mereka saksikan secara langsung dari ayat-ayat Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "126. Tidakkah orang-orang munafik itu mau mengambil pelajaran dari cobaan yang Allah berikan kepada mereka dengan membuka kedok mereka dan mengungkap kemunafikan mereka setiap tahun satu atau dua kali? Kemudian meskipun mereka tahu bahwa hanya Allah -Ta'ālā- yang melakukan hal itu kepada mereka, tetapi mereka tidak mau bertobat dari kekafiran mereka dan menanggalkan kemunafikan mereka dan mereka pun enggan mengambil pelajaran dari apa yang sedang menimpa mereka dan tidak mau mengakui bahwa itu semua berasal dari Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "126. Allah mengolok dan mengingkari orang-orang munafik: “Tidakkah mereka melihat, Allah telah menguji mereka dengan kekurangan, kesulitan, dan peperangan, serta berbagai peringatan sekali atau dua kali setiap tahunnya? Namun mereka tetap saja dalam kesesatan dan tidak bertaubat, dan tidak mengambil pelajaran dari musibah yang menimpa mereka.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "126. يُفْتَنُونَ (mereka diuji) Allah menguji mereka dengan kekeringan, kesusahan, dan berbagai penyakit. Atau Allah menguji mereka dengan memerintahkan mereka untuk pergi berjihad dan berperang bersama Rasulullah. ثُمَّ لَا يَتُوبُونَ(dan mereka tidak (juga) bertaubat) Disebabkan hal tersebut. وَلَا هُمْ يَذَّكَّرُونَ(dan tidak (pula) mengambil pelajaran) Ini merupakan sesuatu yang diherankan dari orang-orang munafik dan keteguhan mereka dalam kemunafikan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Orang-orang barat masih saja melanjutkan misi mereka untuk merusak negara-negara lain beserta penduduk-penduduknya, tidakkah mereka melihat bahwa misi buruk pemimpin-pemimpin mereka telah menghancurkan begitu banyak negara-negara arab sehingga satu persatu pemimpin-pemimpin negara-negara itu berjatuhan, kapan mereka akan memahami semua keadaan ini ? namun Al-qur'an memberikan jawabannya yang sempurna, Allah berfirman : { أَوَلَا يَرَوْنَ أَنَّهُمْ يُفْتَنُونَ فِي كُلِّ عَامٍ مَرَّةً أَوْ مَرَّتَيْنِ ثُمَّ لَا يَتُوبُونَ وَلَا هُمْ يَذَّكَّرُونَ } \"Dan tidaklah mereka (orang-orang munafik) memperhatikan bahwa mereka diuji sekali atau dua kali setiap tahun, dan mereka tidak (juga) bertaubat dan tidak (pula) mengambil pelajaran?\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "126. Apakah orang-orang munafik itu tidak melihat bahwa Allah menguji mereka dengan berjihad bersama Nabi SAW setiap tahun sebanyak sekali atau 2 kali? Lalu mereka tidak bertaubat dari kekufurna mereka dan tidak mengambil pelajaran dari rahasia-rahasia perkara mereka yang tampak, serta mencoba menaklukkan rasulallah SAW"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidakkah mereka melihat} orang-orang munafik itu melihat {bahwa mereka diuji} diuji dengan kegersangaan, kekeringan dan ujian-ujian lainnya {sekali atau dua kali setiap tahun} sebagian tahun sekali dan sebagian lainnya dua kalia {kemudian mereka tidak bertaubat dan tidak pula mengambil pelajaran} mengambil pelajaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "126. Allah berfirman mencela mereka yang terus menerus berpegang kepada kekufuran dan kemunafikan, “Dan tidakkah mereka (orang-orang munafik) memperhatikan bahwa mereka diuji sekali atau dua kali setiap tahun”, dengan penyakit dan musibah yang menimpa mereka dan dengan perintah-perintah ilahiyah yang maksudnya adalah menguji mereka. “Kemudian mereka tidak (juga) bertaubat”, dari keburukan yang mereka pegang. “Dan tidak (pula) mengambil pelajaran?” apa yang berguna bagi mereka maka mereka melakukannya dana pa yang merugikan mereka maka mereka menjauhinya. Allah menguji mereka sebagaimana ia adalah sunnahNYa pada umat-umat lain dengan kemakmuran dan kesullitan, serta dengan perintah dan larangan, agar mereka kembali kepadaNya, namun mereka tidak bertaubat dan tidak pula mengambil pelajaran. Ayat-ayat ini mengandung dalil bahwa iman itu bertambah dan berkurang, bahwa seorang hamba harus memupuk imannya dan menjaganya serta menumbuhkannya dan memperbaharuinya agar ia selalu meningkat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 126: Allah Subhaanahu wa Ta'aala berfirman mencela mereka karena terus menerus di atas kekafiran dan kemunafikan. Yang dimaksud dengan “diuji” di sini adalah musibah-musibah yang menimpa mereka seperti terbukanya rahasia tipu daya mereka, pengkhianatan mereka dan sifat mereka menyalahi janji. Yang lain mengatakan, bahwa yang dimaksud “diuji” adalah kemarau panjang dan berbagai penyakit. Ada pula yang berpendapat, bahwa mereka diuji pula dengan perintah-perintah untuk menguji mereka. Dari kemunafikannya. Dengan mengerjakan hal yang bermanfaat bagi mereka dan meninggalkan hal yang membahayakan mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 126",
    "description": "Dan tidakkah mereka orang-orang munafik dan kafir itu memperhatikan dengan saksama bahwa mereka diuji berupa penyakit, paceklik dan bencana alam yang terjadi sekali atau dua kali setiap tahun, namun mereka tidak juga bertobat dari kemunafikan dan kekafiran, dan tidak pula mengambil pelajaran dari berbagcemoohan orang munafik dan orang kafir tidak hanya dengan lisan tetapi juga perbuatan, yaitu, apabila diturunkan suatu surah, dari Al-Qur'an yang menggambarkan isi hati mereka dan membeberkan rahasia mereka, maka satu sama lain di antara mereka saling berpandangan dengan lirikan mata tanda mengejek sambil berkata, adakah seseorang dari kaum muslim yang melihat kamu ketika malakukan hal-hal yang kita rahasiakan, sehingga Muhammad mengetahui semuanya' setelah itu mereka pun pergi meninggalkan majelis nabi secara sembunyisembunyi. Mereka selalu ingin berpaling dari kebenaran, sehingga Allah memalingkan hati mereka dari mendengar dan mengikuti tuntunan Allah disebabkan mereka adalah kaum yang tidak memahami tuntunan tersebut."
  }
]