[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan tiap kali diturunkan surat, orang-orang munafik saling memberikan isyarat dengan mata mereka sebagai bentuk pengingkaran terhadap turunnya surat tersebut, olok-olokan dan amarah;lantaran turun di dalam kandungannya keterangan tentang keburukan-keburukan dan perbuatan-perbuatan mereka. kemudian mereka mengatakan “apakah ada seseorang yang melihat kalian bila kalian pergi meninggalkan rasul?” maka apabila tidak seorang pun memergoki mereka, mereka berdiri dan pergi dari sisi rasul karena takut terbongkar rahsia mereka. Allah memalingkan hati mereka dari keimanan, disebabkan mereka sesunggguhnya tidak memahami dan tidak merenunginya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "127. Apabila Allah menurunkan kepada rasul-Nya -ṣallallāhu 'alaihi wa sallam- suatu surah yang menceritakan hal ihwal orang-orang munafik, maka sebagian dari mereka memandang sebagian yang lain seraya berkata, \"Apakah ada orang yang melihat kalian?\" Jika tidak ada orang yang melihat mereka, maka mereka langsung pergi meninggalkan tempat itu. Ketahuilah bahwa Allah telah memalingkan hati mereka dari jalan kebenaran dan kebaikan, dan menghinakan mereka, karena mereka adalah kaum yang tidak mengerti."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "127. Orang-orang munafik terganggu dengan satu surat yang diturunkan untuk menyingkap rahasia mereka. Jika suatu surat al-Qur’an diturunkan yang menyebutkan aib-aib mereka, mereka saling melihat dengan penuh penghinaan dan kebencian. Dan jika sebagian mereka ingin berpaling dari majelis Rasulullah, mereka saling berucap: “Apakah ada orang beriman yang melihat kalian pergi?” kemudian mereka berpaling dari majelis itu. Allah akan memalingkan hati mereka dari kebaikan dan petunjuk, sebab mereka adalah kaum yang enggan mengikuti kebenaran."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "127. وَإِذَا مَآ أُنزِلَتْ سُورَةٌ نَّظَرَ بَعْضُهُمْ إِلَىٰ بَعْضٍ (Dan apabila diturunkan satu surat, sebagian mereka memandang kepada yang lain) Yakni sebagian orang munafik melihat ke sebagian yang lain seraya mengatakan “Adakah seseorang yang melihat kalian dari orang-orang beriman, agar kami dapat pergi dari tempat turunnya wahyu? Karena kami tidak tahan lagi untuk mendengarnya, dan agar kami dapat melancarkan tuduhan dan olokan yang kami hendaki. ثُمَّ انصَرَفُوا۟ ۚ( Sesudah itu merekapun pergi) Pergi dari tempat itu menuju rumah mereka. Atau mereka pergi dari tempat yang dapat mengantarkan kepada hidayah dan keimanan menuju tempat yang dapat mengantarkan mereka kepada kekafiran dan kemunafikan. صَرَفَ اللهُ قُلُوبَهُم(Allah telah memalingkan hati mereka) Yakni Allah memalingkan hati mereka dari kebaikan dan petunjuk lalu menghinakan mereka. بِأَنَّهُمْ قَوْمٌ لَّا يَفْقَهُونَ(disebabkan mereka adalah kaum yang tidak mengerti) Yakni mereka tidak memahami apa yang mereka dengarkan sebab mereka tidak mentadabburi dan tidak menilainya dengan objektif."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "127. Dan ketika turun surah yang menjelaskan aib-aib orang munafik, mereka saling memandang untuk mengisyaratkan agar pergi dari majlis rasulallah SAW sembari berkata: “Apakah ada salah satu orang mukmin yang melihat kalian saat melarikan diri atau menyelinap keluar”. Kemudian mereka pergi dari majelis itu sembari menyelinap kembali ke rumah mereka karena khawatir dengan aib mereka. Allah memalingkan hati mereka dari kebaikan, bimbingan, hidayah, dan iman karena mereka adalah kaum yang tidak memahami Al-Qur’an dengan penuh kesadaran dan keikhlasan. Mereka juga tidak menyadari kebenaran karena tidak mau tadabbur."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Ketika diturunkan suatu surah, mereka saling melihat satu sama lain,“Adakah seseorang yang melihat kalian” Kemudian mereka pergi. Allah memalingkan hati mereka karena mereka adalah kaum yang tidak memahami"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "127. Yakni, bahwa orang-orang munafik yang mewaspadai turunnya surat atas mereka, telah memberitahukan isi hati mereka, bahwa jika sebuah surat turun agar mereka beriman kepadanya dan mengamalkan isinya, “sebagian mereka memandang kepada sebagian yang lain”, dengan ketetapan hati untuk tidak mengamalkannya, mereka menunggu kesempatan bersembunyi dari pandangan orang-orang beriman, dan mereka berkata, “ ‘Adakah seorang dari (orang-orang Muslimin) yang meihat kamu?’ sesudah itu mereka pun pergi”, dengan sembunyi-sembunyi pulang dalam keadaan berpaling, maka Allah membalas mereka dengan hukuman sesuai dengan amal mereka. Sebagaimana mereka berpaling dari amal maka “Allah telah memalingkan hati mereka,” yakni menghalanginya dari kebenaran “disebabkan mereka adalah kaum yang tidak mengerti”, dengan pemahaman yang berguna bagi mereka, karena jika mereka itu memahami, niscaya mereka beriman kepada surat yang diturunkan dan tunduk kepada perintahnya. Yang dimaksud di sini adalah keengganan mereka yang sangat terhadap jihad dan syariat-syariat iman yang lain, sebagaimana Firman Allah, \"Maka apabila diturunkan suatu surat yang jelas maksudnya dan disebutkan di dalamnya (perintah) perang, kamu lihat orang-orang yang ada penyakit di dalam hatinya memandang kepadamu seperti pandangan orang yang pingsan karena takut mati, dan kecelakaanlah bagi mereka.\" (Muhammad:20)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 127: Kaum munafik sangat khawatir jika turun surat yang menerangkan apa yang disembunyikan dalam hati mereka. Ketika turun suatu surat agar mereka mengimaninya dan mengamalkan isinya, maka satu sama lain saling berpandangan dengan bertekad kuat untuk tidak mengamalkannya, dan menunggu saat-saat tidak terlihat oleh kaum mukmin dan mereka berkata, \"Adakah seseorang dari (kaum muslimin) yang melihat kamu?” sambil pergi dengan sembunyi-sembunyi di atas kemunafikannya dan berpaling, maka Allah membalas mereka karena tidak mau mengamalkannya dengan memalingkan hati mereka dari petunjuk. Dari petunjuk."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 127",
    "description": "Cemoohan orang munafik dan orang kafir tidak hanya dengan lisan tetapi juga perbuatan, yaitu, apabila diturunkan suatu surah, dari Al-Qur'an yang menggambarkan isi hati mereka dan membeberkan rahasia mereka, maka satu sama lain di antara mereka saling berpandangan dengan lirikan mata tanda mengejek sambil berkata, adakah seseorang dari kaum muslim yang melihat kamu ketika malakukan hal-hal yang kita rahasiakan, sehingga Muhammad mengetahui semuanya' setelah itu mereka pun pergi meninggalkan majelis nabi secara sembunyisembunyi. Mereka selalu ingin berpaling dari kebenaran, sehingga Allah memalingkan hati mereka dari mendengar dan mengikuti tuntunan Allah disebabkan mereka adalah kaum yang tidak memahami tuntunan tersebut. Ayat yang lalu diakhiri dengan penegasan bahwa hati orang munafik dipalingkan dari kebenaran karena sesungguhnya mereka tidak mau memahami kebenaran walaupun yang membawa kebenaran tersebut adalah nabi Muhammad yang sangat penyantun dan penyayang sebagaimana disebutkan dalam ayat berikut ini. Demi kebesaran dan keagungan tuhan, sungguh, telah datang kepadamu seorang rasul yang mulia dari kaummu sendiri sehingga tidak asing bagi kamu, sangat berat terasa olehnya penderitaan yang kamu alami baik derita lahir maupun batin, dia sangat menginginkan kebaikan, kabahagiaan dan keselamatan bagimu, yakni bagi kamu semua baik yang muslim maupun yang kafir, dia sangat penyantun dan penyayang, yakni memberi kebaikan secara melimpah melebihi kebutuhan maupun sesuai kebutuhan terhadap orang-orang yang beriman."
  }
]