[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sungguh telah datang kepada kalian wahai kaum mukminin, seorang rasul dari kaum kalian sendiri, yang merasa berat atas dirinya dengan apa yang kalian alami berupa keburukan dan kesulitan, amat antusias terhadap keimanan kalian dan kebaikan keadaan kalian. Dan dia kepada kaum muslimin banyak kasih dan sayang."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "128. Sungguh telah datang kepada kalian -wahai bangsa Arab- seorang rasul yang berasal dari bangsa kalian sendiri, ia orang Arab seperti kalian, ia merasa berat dengan sesuatu yang terasa berat bagi kalian pula, ia sangat peduli agar kalian mendapat hidayah serta ia sangat memperhatikan kalian, dan ia sangat penyantun lagi penyayang kepada orang-orang yang beriman."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "128. Hai orang-orang beriman, sungguh telah datang kepada kalian seorang Rasul yang agung dari kaum kalian; ujian dan cobaan yang menimpa kalian sangat terasa berat baginya; dia sangat ingin kalian mendapat keimanan dan keselamatan dari api neraka, dan dia sangat mengasihi dan mencintai orang-orang beriman."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "128. لَقَدْ جَآءَكُمْ (Sungguh telah datang kepadamu) Wahai orang-orang arab. رَسُولٌ(seorang Rasul) Yang diutus Allah kepada kalian, yang membawa tugas yang agung. مِّنْ أَنفُسِكُمْ(dari kaummu sendiri) Yang merupakan orang Arab, dan tidak ada dari suku-suku Arab kecuali mempunyai garis keturunan kepadanya baik itu suku Mudhar, Rabi’ah, atau Yaman; yakni kalian telah melahirkannya wahai orang-orang Arab. Al-Jazzaj berpendapat: ini merupakan kalimat yang ditujukan bagi seluruh penduduk bumi, yakni dia merupakan keturunan bani Adam yang diturunkan kepada mereka sebagai bentuk kasih sayang untuk mereka. عَزِيزٌ عَلَيْهِ مَا عَنِتُّمْ(berat terasa olehnya penderitaanmu) Makna (العنت) yakni kesusahan dan penderitaan orang-orang beriman baik itu di dunia maupun di akhirat. حَرِيصٌ عَلَيْكُم(sangat menginginkan (keimanan dan keselamatan) bagimu) Yakni sangat tidak meninginkan kalian masuk neraka, dan mengharapkan keimanan kalian. بِالْمُؤْمِنِينَ(terhadap orang-orang mukmin) Baik itu dari kalian wahai orang-orang Arab atau lainnya, ia sangat belas kasihan lagi penyayang."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "128. Wahai bangsa Arab sungguh telah datang kepada kalian seorang rasul dari golongan kalian yang terasa keras dan berat penderitaan kalian baginya, yaitu kepayahan dan penderitaan kalian oleh azab dunia atau akhirat, rasul yang sangat menginginkan keimanan kalian dan keluarnya kalian dari neraka, dan sangat mengasihi dan menyayangi orang-orang mukmin. Ra’fah itu lebih lembut dari rahmah, yang mana disertai dengan kelemah lembutan yang mampu menghilangkan sebab suatu musibah. Dan rahmat itu di dalamnya mengandung kebaikan dan pemberian"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh benar-benar telah datang kepada kalian seorang rasul dari kaum kalian} dari jenis kalian {Berat baginya} berat dan susah baginya {penderitaan kalian} sesuatu yang membuat kalian menderita {sangat menginginkan (keimanan) bagi kalian, belas kasihan dan penyayang terhadap orang-orang mukmin"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "128. Allah memberi nikmat kepada hamba-hambaNya yang beriman dalam bentuk diutusnya seorang Nabi yang ummi, yang termasuk dari kalangan mereka, mereka mengetahui keadaannya, memungkinkan mereka untuk mengambil keteladanan darinya, dan mereka tidak merasa rendah diri untuk tunduk kepadanya, dia sangat mengasihi mereka dan berusaha mewujudkan kebaikan mereka. “Berat terasa olehnya penderitaanmu.” Yakni perkara yang memberatkan dan menyulitkanmu juga memberatkannya. “Sangat menginginkan (keimanan dan keselamatan) bagimu.” Dia menyukai kebaikan bagimu, berusaha keras menyampaikannya kepadamu, bersungguh-sungguh memberimu hidayah kepada iman, membenci keburukan menimpamu, dan berusaha keras menjauhkannya darimu. “Amat belas kasihan lagi penyayang terhadap orang-orang Mukmin.” Yakni sangat belas kasih, naa sangat sayang kepada mereka melebihi ayah ibu mereka. Oleh karena itu haknya didahulukan di atas hak makhluk yang lain. Wajib atas umat ini untuk beriman kepadanya, menghormatinya, menghargainya dan mendukungnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 128: Oleh karena itu, hak Beliau harus didahulukan di atas semua hak makhluk, dan wajib bagi umatnya beriman kepadanya, memuliakannya, membantunya dan menghormatinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 128",
    "description": "Ayat yang lalu diakhiri dengan penegasan bahwa hati orang munafik dipalingkan dari kebenaran karena sesungguhnya mereka tidak mau memahami kebenaran walaupun yang membawa kebenaran tersebut adalah nabi Muhammad yang sangat penyantun dan penyayang sebagaimana disebutkan dalam ayat berikut ini. Demi kebesaran dan keagungan tuhan, sungguh, telah datang kepadamu seorang rasul yang mulia dari kaummu sendiri sehingga tidak asing bagi kamu, sangat berat terasa olehnya penderitaan yang kamu alami baik derita lahir maupun batin, dia sangat menginginkan kebaikan, kabahagiaan dan keselamatan bagimu, yakni bagi kamu semua baik yang muslim maupun yang kafir, dia sangat penyantun dan penyayang, yakni memberi kebaikan secara melimpah melebihi kebutuhan maupun sesuai kebutuhan terhadap orang-orang yang beriman. Maka jika mereka berpaling dari keimanan dan menolak mengikuti ajaranmu wahai nabi Muhammad, maka katakanlah kepada mereka cukuplah Allah bagiku, dia yang akan membela dan melindungiku; tidak ada tuhan yang berhak disembah selain dia. Hanya kepada-Nya aku bertawakal, yakni berserah diri setelah berusaha sekuat tenagaku, dan dia adalah tuhan yang memiliki, mencipta, dan mengatur 'arsy singgasana yang agung."
  }
]