[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka apabila kaum musyrikin dan orang-orang munafik tetap berpaling dari keimanan kepada mu (wahai rasul), maka katakanlah kepada mereka, ”cukuplah Allah bagiku, Dia akan memenuhi apa yang menjadi cita-citaku, tiada tuhan yang berhak di sembah kecuali Dia, kepadaNya lah aku bergantung. Dan kepadaNYa aku serahkan seluruh urusanku, sesungguhnya Dia penolong dan yang akan membantuku. Dia Robb pemilik arsy yang agung yang merupakan makhluk yang paling besar.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "129. Jika mereka berpaling darimu dan tidak mau beriman kepada ajaran yang kamu bawa, maka katakanlah -wahai Rasul- kepada mereka, \"Cukuplah bagiku Allah yang tiada tuhan yang berhak disembah selain Dia. Hanya kepada-Nya aku bersandar dan Dia -Subḥānahu- Penguasa 'Arsy yang agung.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "129. Hai Nabi, jika orang-orang kafir dan munafik berpaling dari keimanan kepadamu, maka katakanlah kepada mereka: “Cukuplah Allah sebagai penolongku, tidak ada Tuhan yang berhak disembah selain Dia, hanya kepada-Nya aku bersandar, Dia adalah pemilik ‘Arsy yang agung yang merupakan makhluk yang paling pesar.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "129. فَإِن تَوَلَّوْا۟ (Jika mereka berpaling) Yakni berpaling dari kalian dan tidak menerima dan mengamalkan apa yang kamu bawa. فَقُلْ(maka katakanlah) Wahai Muhammad. حَسْبِىَ اللهُ(Cukuplah Allah bagiku) Yakni cukuplah Allah bagiku yang Maha Esa, yang tidak bergantung kepada selain-Nya. عَلَيْهِ تَوَكَّلْتُ ۖ (Hanya kepada-Nya aku bertawakkal) Yakni aku serahkan segala urusanku. وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ(dan Dia adalah Tuhan yang memiliki ‘Arsy yang agung) Karena arsy merupakan makhluk yang paling besar dan agung."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "129. Wahai rasul, jika mereka menolak untuk beriman maka katakanlah kepada mereka: “Cukuplah Allah yang menjadi penolong dan penyelamatku. Dialah satu-satunya Tuhan yang aku serahi urusan-urusanku. Dialah Tuhan kursi yang lebih agung dari seluruh makhluk. Dan Arsy itu adalah makhluk yang tidak diketahui keagungan dan hakikatnya kecuali hanya Allah SWT yang tahu. Kami beriman atas apa yang terkandung dalam Al-Qur’an tanpa menyamakan dengan sesuatu yang sudah lazim.” Ditafsirkan oleh sabagian ulama’ bahwa Dialah pemilik kerajaan dan kewenangan yang menentukan dan mengatur atas setiap sesuatu dan perkara"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika mereka berpaling} berpaling dari keimanan {maka katakanlah,“Cukuplah bagiku} cukuplah bagiku {Allah. Tidak ada tuhan selain Dia. Hanya kepadaNya aku bertawakal} bergantung {dan Dia adalah Tuhan pemilik ‘Arsy yang agung.”}"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "129. “Jika” mereka beriman, maka itu adalah taufik untuk mereka dan jika “mereka berpaling” dari keimanan dan amal, maka tetaplah berjalan di atas jalanmu, teruslah berdakwah dan katakan, “CUkuplah Allah bagiku.” Yakni Allah yang mencukupiku segala apa yang aku perlukan. “Tidak ada tuhan yang berhak disembah selain Dia.” Yakni, tiada yang disembah dengan benar selainNYa. “Hanya kepadaNya aku bertawakal.” Yakni aku bersandar dan percaya kepadaNYa dalam meraih apa yang bermanfaat dan menolak apa yang mudarat. “Dan Dia adalah Rabb yang memiliki Arasy yang agung,” yang merupakan makhluk terbesar, jika Dia adalah Rabb bagi Arasy yang agung yang meliputi seluruh makhluk, maka Dia pasti Rabb bagi makhluk selainnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 129: Dalam meraih hal yang bermanfaat dan menghindarkan hal yang bermadharrat. Disebutan ‘Arsy secara khusus, karena ia merupakan makhluk Allah yang paling besar."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 129",
    "description": "Maka jika mereka berpaling dari keimanan dan menolak mengikuti ajaranmu wahai nabi Muhammad, maka katakanlah kepada mereka cukuplah Allah bagiku, dia yang akan membela dan melindungiku; tidak ada tuhan yang berhak disembah selain dia. Hanya kepada-Nya aku bertawakal, yakni berserah diri setelah berusaha sekuat tenagaku, dan dia adalah tuhan yang memiliki, mencipta, dan mengatur 'arsy singgasana yang agung. Alif lam ra. Hanya Allah yang mengetahui secara pasti makna huruf-huruf yang menjadi pembuka surah-surah dalam Al-Qur'an. Inilah ayatayat Al-Qur'an yang keseluruhannya penuh hikmah, yakni petunjuk yang hak dan terbaik bagi semua umat manusia. Apabila petunjuk tersebut diperhatikan dan dijalankan, maka akan mendatangkan kemaslahatan dan menghindarkan keburukan."
  }
]