[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "janganlah kalian ragu-ragu untuk memerangi kaum yang telah melanggar perjanjian-perjanjian mereka dan melakukan pengusiran terhadap rasul dari Makkah, sedang mereka itulah pihak yang memulai untuk mengganggu kalian terlebih dahulu. Apakah kalian takut kepada mereka dan takut berjumpa dengan mereka dalam pertempuran? Allah lah yang lebih pantas kalian takuti bila kalian benar-benar orang-orang mukmin."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "13. Mengapa kalian -wahai orang-orang mukmin- tidak memerangi orang-orang yang melanggar perjanjian mereka dan melakukan persekongkolan untuk mengusir Rasulullah -ṣallallāhu 'alaihi wa sallam- dari kota Makkah, dan mereka telah memulai perang dengan kalian ketika mereka membantu suku Bakr sekutu Quraisy untuk menyerang suku Khuzā’ah sekutu Rasulullah -ṣallallāhu 'alaihi wa sallam-? Apakah kalian takut kepada mereka sehingga kalian tidak berani berperang melawan mereka? Allah -Subḥānahu- lebih berhak kalian takuti jika kalian benar-benar beriman kepada-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "13. Setelah Allah memerintahkan untuk memerangi para pemimpin kekafiran, kemudian Allah menyebutkan sebab perintah tersebut: Pertama, karena mereka telah melanggar sumpah yang merea buat demi menegaskan perjanjian yang mereka sepakati dengan Rasulullah dan para sahabatnya untuk tidak saling berperang selama sepuluh tahun, sehingga kedua belah pihak dapat mendapat keamanan dan kebebasan dalam menjalankan agama. Kedua, karena mereka telah berusaha mengusir Rasulullah dari tanah kelahirannya, memenjarakannya agar tidak dapat menyampaikan risalah, atau membunuhnya dengan setiap kabilah kaum Quraisy mengutus utusan masing-masing untuk membunuhnya, agar penumpahan darahnya ditanggung semua kabilah, sehingga tidak dapat menuntut qishash. Ketiga, mereka yang memulai perang Badar dengan berkata ketika kafilah dagang mereka telah selamat: “Kita tidak akan pergi hingga dapat membinasakan Muhammad dan para sahabatnya.” Sehingga perkataan ini mematik semangat mereka untuk berperang. Setelah semua yang mereka lakukan ini, apakah kalian enggan memerangi mereka karena takut dari mereka? Sesungguhnya Allah lebih berhak untuk ditakuti jika perintah-Nya dilanggar dan musuh-Nya dibiarkan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "13. أَلَا تُقٰتِلُونَ قَوْمًا نَّكَثُوٓا۟ أَيْمٰنَهُمْ (Mengapakah kamu tidak memerangi orang-orang yang merusak sumpah (janjinya)) Ini murupakan dorongan untuk berperang dan penekanan dalam pelaksanaannya. Maka barangsiapa yang keadaannya seperti keadaan mereka yaitu yang melanggar perjanjian, pengusir Rasulullah dari Makkah, dan memulai peperangan, maka ia layak untuk diperangi, dan orang yang berlebihan dalam hal itu layak untuk diperolok. أَتَخْشَوْنَهُمْ ۚ (Mengapakah kamu takut kepada mereka) Yakni apakan kalian takut mendapat sesuatu yang tidak kalian harapkan dari mereka sehingga kalian tidak memerangi mereka. فَاللهُ أَحَقُّ أَن تَخْشَوْهُ إِن كُنتُم مُّؤْمِنِينَ (padahal Allah-lah yang berhak untuk kamu takuti, jika kamu benar-benar orang yang beriman) Karena Allah-lah yang sebenarnya dapat memberi manfaat dan mudharat. Dan salah satu tanda ketakutan kalian terhadap-Nya adalah dengan kalian memerangi orang yang Dia perintahkan untuk memeranginya. Dan janganlah kalian jadikan ketakutan kalian terhadap selain Allah seperti ketakutan kalian kepada Allah."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Dalam ayat dikatakan : { بَدَءُوكُمْ } \"yang pertama mulai memerangi kamu\"; sebagai peringatan bahwa orang yang memulai perkara lebih zholim."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13 Allah mengizinkan untuk memerangi kafir Makkah yang telah menghianati janji sebab tiga perkara: 1 Mengapa kamu tidak memerangi orang-orang yang merusak sumpah janjinya, 2 padahal mereka telah keras kemauannya untuk mengusir Rasul dan 3 merekalah yang pertama mulai memerangi kamu pada perang Badr, Khandak dan lainnya? Mengapakah kamu takut kepada mereka padahal Allah-lah yang berhak untuk kamu takuti, jika kamu benar-benar orang yang beriman kepada janji dan peringatan Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mengapa kalian tidak memerangi kaum yang melanggar sumpah-sumpah mereka, dan mereka sangat ingin} berusaha {mengusir Rasul dan mereka yang pertama kali memulai terhadap kalian} untuk berperang {Apakah kalian takut kepada mereka} apakah kalian takut terhadap mereka {Allahlah yang lebih berhak kalian takuti} untuk kalian tahuti hukumanNya {jika kalian benar-benar orang-orang mukmin"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "13. Kemudian Allah mendorong dan memacu orang-orang Mukmin agar memerangi mereka dengan meyebutkan sifat-sifat musuh yang mengharuskannya agar mereka di perangi. “mengapa engkau tidak memerangi orang-orang yang merusak janjinya, padahal mereka telah keras kemauannya mengusir Rasul”, yang seharusnya di hormati, dihargai, dan di muliakan, tapi mereka hendak mengusirnya dan mengasingkannya dari tanah kelahirannya, dan berusaha untuk itu sekuat tenaga, “dan mereka yang memulai memerangi kamu?” yang mana mereka membatalkan perjanjian dan membantu orang lain memerangimu, di mana hal itu ketika Qurais sementara mereka maaih terikat perjanjian damai membantu Bani Bakar sekutu mereka, memerangi Bani Khuza’ah sekutu Rasululoh, orang-orang Qurais berperang bersama Bani Bakar sebagaimana hal itu dijelaskan oleh buku-buku sirah. “Mengapa kamu takut kepada mereka”, sehingga kamu enggan memerangi mereka? “padahal Allah-lah yang berhak kamu takuti, jika kamu benar-benar orang yang beriman.” Allah memerintahkan agar kamu memerangi mereka. Dia sangat menekankan hal itu atasmu, jika kamu adalah orang yang beriman, maka laksanakanlah perintahkan Allah, dan janganlah kamu takut terhadap mereka sehingga kamu meninggalkan perintah Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 13: Allah Subhaanahu wa Ta'aala mendorong kaum mukmin memerangi mereka dengan menerangkan sifat yang ada pada musuh yang menghendaki untuk diperangi. Dari Mekah, saat mereka bermusyawarah di Darun Nadwah. Mereka (kaum Quraisy) membantu Bani Bakar memerangi suku Khuza’ah yang menjadi sekutumu, oleh karena itu apa yang menghalangimu untuk memerangi mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 13",
    "description": "Ayat sebelumnya memerintahkan kaum muslim untuk memerangi kaum musyrik yang merusak perjanjian, maka ayat-ayat berikut ini menjelaskan alasan memerangi mereka. Mengapa kamu tidak memerangi orang-orang yang melanggar sumpah janjinya, untuk tidak saling mengganggu selama sepuluh tahun, juga perjanjian-perjanjian lainnya yang sering mereka langgar, dan telah merencanakan untuk mengusir rasul, dari kediaman beliau bahkan mereka sangat bernafsu untuk membunuh beliau dan mereka yang pertama kali memerangi kamu seperti dalam perang badar' apakah kamu takut kepada mereka, hanya karena mereka didukung oleh kekuatan senjata dan pasukan yang banyak, padahal Allah-lah yang lebih berhak untuk kamu takuti, karena dialah yang mahaperkasa yang tidak mungkin dikalahkan oleh siapa pun jika memang kamu benar-benar orang-orang beriman dengan mantap. Atas tiga alasan di atas, yakni merusak perjanjian damai untuk tidak saling mengganggu, berencana untuk mengusir rasulullah dari tempat kediamannya, dan memulai untuk menyerang kaum muslimin, maka perangilah mereka, demi melaksanakan perintah Allah dan menggapai rida-Nya, bukan semata-mata untuk mengejar hal-hal yang bersifat duniawi seperti rampasan perang. Dengan begitu, niscaya Allah akan menyiksa mereka dengan perantaraan tanganmu, dan melalui peperangan itu pula dia akan menghina mereka dengan kekalahan dalam perang sehingga menjadi tawanan dan menolongmu dengan kemenangan atas mereka, serta melegakan hati orang-orang yang beriman, setelah mereka mengalami penyiksaan dari kaum musyrik mekah dalam waktu yang cukup lama yang akhirnya mereka bisa dikalahkan dan agama islam memperoleh kemuliaan."
  }
]