[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang mukmin, perangilah musuh-musuh Allah, niscaya Allah akan menyiksa mereka melalui tangan-tangan kalian dan menghinakan mereka dengan kekalahan dan kenistaan duniawi, dan memenangkan kalian atas mereka, dan meninggikan kalimatNya, serta mendatangkan rasa lega dengan kekalahan mereka di hati kalian yang telah tersusupi rasa kesedihan dan kecemasan akibat tipu daya kuam musyrikin."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Perangilah -wahai orang-orang mukmin- orang-orang musyrik itu. Karena jika kalian memerangi mereka niscaya Allah akan mengazab mereka melalui tangan kalian. Yaitu kalian akan membunuh dan menghinakan mereka dengan kekalahan dan menjadikan mereka sebagai tawanan perang. Allah akan menolong kalian untuk mengalahkan mereka dan memberikan kemenangan kepada kalian. Dan Allah akan memuaskan hati orang-orang mukmin yang belum pernah menyaksikan perang dengan apa yang dialami oleh musuh mereka, yaitu terbunuh, tertawan, dan kalah dari orang-orang mukmin, serta keberhasilan orang-orang mukmin mengalahkan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "14-15. Setelah Allah menyebutkan dalil-dalil yang mewajibkan untuk memerangi mereka dan menghilangkan syubhat-syubhat yang melarang memerangi mereka; maka kemudian Allah memerintahkan mereka dengan perintah yang tegas dan dibarengi dengan janji-Nya untuk menolong orang-orang beriman dan memenangkan mereka: “Perangilah mereka sebagaimana Aku perintahkan, karena jika kalian melaksanakan hal ini, niscaya Allah akan mengazab mereka melalui tangan kalian dan memberi kalian kemampuan untuk membunuh mereka dengan memotong leher mereka atau menusuk dada dan tenggorokan mereka. Dan Allah akan menghinakan mereka yang masih hidup dengan menjadikan mereka tertawan, tertindas, dan miskin. Allah akan memenangkan kalian hingga mereka tidak dapat bangkit kembali, serta mengobati sakit hati kalian karena dahulu mereka mengganggu, mengkhianati, dan menzalimi kalian. Adapun orang yang bertaubat dari mereka, maka Allah akan menerima taubat mereka dari kesyirikan dan memberi mereka taufik untuk beriman. Dia Maha Mengetahui kekuatan mereka yang tidak kalian ketahui, baik itu pada saat ini maupun di masa depan; dan Dia Maha Bijaksana dalam menetapkan hukum bagi mereka.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "14. قٰتِلُوهُمْ يُعَذِّبْهُمُ اللهُ بِأَيْدِيكُمْ (Perangilah mereka, niscaya Allah akan menghancurkan mereka dengan (perantaraan) tangan-tanganmu) Allah menjadikan dalam ayat ini beberapa faidah: 1. ayat ini mengabarkan bahwa azab Allah bagi orang-orang kafir lewat tangan orang-orang beriman dengan pembunuhan dan tawanan perang. 2. ayat ini mengabarkan bahwa Allah menghinakan mereka dengan menjadi tawanan perang. Dan pendapat lain mengatakan: dengan menurunkan kepada mereka kehinaan dan kerendahan. 3. ayat ini mengabarkan tentang kemenangan dan kejayaan orang-orang beriman atas orang-orang kafir. 4. ayat ini menunjukkan bahwa Allah melegakan orang-orang beriman yang belum mengikut peperangan dengan pererangan yang akan terjadi. 5. bahwa Allah melegakan hati orang-orang beriman dari kebencian terhadap orang-orang kafir dengan perintah memerangi mereka disebabkan pelanggaran perjanjian yang mereka lakukan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13 Allah mengizinkan untuk memerangi kafir Makkah yang telah menghianati janji sebab tiga perkara: 1 Mengapa kamu tidak memerangi orang-orang yang merusak sumpah janjinya, 2 padahal mereka telah keras kemauannya untuk mengusir Rasul dan 3 merekalah yang pertama mulai memerangi kamu pada perang Badr, Khandak dan lainnya? Mengapakah kamu takut kepada mereka padahal Allah-lah yang berhak untuk kamu takuti, jika kamu benar-benar orang yang beriman kepada janji dan peringatan Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Perangilah mereka. niscaya Allah akan mengazab mereka} membunuh mereka {melalui tangan-tangan kalian, menghinakan mereka} menghinakan mereka dengan kehancuran dan penawanan {dan memenangkan kalian atas mereka, serta melegakan hati kaum mukmin"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "14. Kemudian Allah memerintahkan orang-orang Mukmin agar memerangi mereka, dan menjelaskan manfaat yang timbul akibat perang dengan mereka. Semua itu adalah dorongan dan lecutan bagi orang-orang yang beriman agar mau memerangi mereka, Dia berfriman, “perangilah mereka, niscaya Allah akan menyiksa mereka dengan tangan-tanganmu”, dengan pembunuhan, “dan Allah menghinakan mereka”, jika Allah memenangkanmu atas mereka. Mereka adalah musuh yang memang hendak menghinakan diri mereka sendiri dan berusaha untuk itu. “Dan menolong kamu atas mareka.” Ini adalah janji dan kabar gembira dari Allah yang telah dia wujudkan. “Serta melegakan hati orang-orang yang beriman.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 14: Allah Subhaanahu wa Ta'aala memerintahkan kembali memerangi mereka dan menerangkan faedahnya. Membunuh mereka. Dengan menawan mereka. Ayat ini menunjukkan kecintaan Allah kepada hamba-hamba-Nya yang mukmin dan perhatian-Nya terhadap mereka, di mana Dia menjadikan termasuk maqaashid syar’iyyah (tujuan syari’at) adalah mengobati sakit hati kaum mukmin yang selama ini tertekan oleh ulah mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 14",
    "description": "Atas tiga alasan di atas, yakni merusak perjanjian damai untuk tidak saling mengganggu, berencana untuk mengusir rasulullah dari tempat kediamannya, dan memulai untuk menyerang kaum muslimin, maka perangilah mereka, demi melaksanakan perintah Allah dan menggapai rida-Nya, bukan semata-mata untuk mengejar hal-hal yang bersifat duniawi seperti rampasan perang. Dengan begitu, niscaya Allah akan menyiksa mereka dengan perantaraan tanganmu, dan melalui peperangan itu pula dia akan menghina mereka dengan kekalahan dalam perang sehingga menjadi tawanan dan menolongmu dengan kemenangan atas mereka, serta melegakan hati orang-orang yang beriman, setelah mereka mengalami penyiksaan dari kaum musyrik mekah dalam waktu yang cukup lama yang akhirnya mereka bisa dikalahkan dan agama islam memperoleh kemuliaan dan, selain itu, dia menghilangkan kemarahan hati mereka, orangorang mukmin, yang disebabkan penyiksaan yang begitu kejam terhadap mereka sejak di mekah. Namun begitu, jika mereka bertobat, maka akan diterima tobatnya dan mereka memiliki hak dan kewajiban yang sama dengan kalian. Demikian ini, karena Allah menerima tobat orang yang dia kehendaki jika memang secara tulus bertobat kepadanya. Allah maha mengetahui segala urusan hamba-hamba-Nya, mahabijaksana atas segala ketentuan syariat dan kebijakan-Nya."
  }
]