[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Dia juga akan menghilangkan amarah dari hati kaum mukminin. Dan orang yang bertaubat dari para penentang itu, maka sesungguhnya Allah akan menerima taubat orang yang dikehdakiNYa. Dan Allah maha mengetahui keseriusan kejujuran orang yang bertaubat, juga mahabijaksana dalam pengaturanNya, perbuatanNya dan peletakan ajaran-ajaran syariatNYa bagi hamba-hambaNYa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Allah menjauhkan amarah dari hati hamba-hamba-Nya yang beriman dengan kemenangan yang mereka peroleh atas musuh-musuh mereka. Dan Allah akan menerima pertobatan orang-orang kafir yang dikehendaki-Nya apabila mereka bertobat. Seperti yang terjadi pada sebagian penduduk Makkah pada waktu pembebasan kota Makkah. Dan Allah Maha Mengetahui kesungguhan mereka yang bertobat itu, lagi Maha Bijaksana dalam mengatur makhluk-Nya dan menetapkan syariat-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15. وَيَتُوبُ اللهُ عَلَىٰ مَن يَشَآءُ ۗ (Dan Allah menerima taubat orang yang dikehendaki-Nya) Sebagaimana yang terjadi pada sebagian penduduk Makkah di hari Fathul Makkah, mereka masuk Islam dengan keislaman yang baik."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "15 Pada ayat di atas ada 4 manfaat memerangi musuh, adapun di sini ada 5 manfaat yaitu menghilangkan panas hati orang-orang mukmin yang disakiti orang musyrik dengan penghianatan janji.. Dan Allah menerima taubat orang yang dikehendaki-Nya yang keislamannya bagus pada waktu Fathu Makkah. Allah maha Mengetahui lagi Maha Bijaksana dalam segala perbuatan-Nya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan menghilangkan kemarahan hati mereka} menghilangkan kemarahan dari hati orang-orang mukmin yang dinodai dengan keinginan balas dendam {Allah menerima taubat siapa pun yang Dia kehendaki. Allah Maha Mengetahui lagi Maha bijaksana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "15. “Dan menghilangkan panas hati orang Mukmin.” Karena dihati orang-orang Mukmin terdapat kebencian dan permusuhan terhadap mereka, yang mana mereka memerangi dan membunuh mereka berarti obat bagi kesedihan yang ada di dalam hati orang-orang Mukmin, dan penghilang bagi kebencian yang ada dalam hati mereka, karena mereka melihat musuh-musuh itu adalah orang-orang yang memerangi Allah dan RasulNya, berusaha memadamkan cahaya Allah. Ini menunjukan kecintaan Allah kepada orang-orang yang beriman dan perhatianNya terhadap mereka, sehingga Dia menjadikan diantara maksud tujuan syariatnya adalah mengobati apa yang ada di dalam hati mereka dan meredam kemarahan mereka. Kemudian Allah berfirman, “Dan Allah menerima taubat orang yang dikehendakinya,” dari kalangan orang-orang yang memerangi itu dengan memberi mereka taufik untuk masuk Islam, menghiasinya dalam hati mereka, dan menjadikan kekufuran, kefasikan, dan kemaksiatan dibenci oleh hati mereka. “Allah Maha Mengetahui dan Maha Bijaksana.” Allah meletakkan segala sesuatu pada tempatnya. Dia mengetahui orang-orang yang layak dengan iman lalu dia mewujudkannya kepadanya, dan siapa yang tidak layak maka dia membiarkannya dalam kesesatan dan kejahatan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 15: Dengan menjadikan sebagian mereka yang memerangi masuk Islam, seperti Abu Sufyan. Dia meletakkan segala sesuatu pada tempatnya, Dia mengetahui siapa yang layak memperoleh keimanan sehingga ditunjuk-Nya, dan siapa yang tidak layak memperolehnya sehingga dibiarkan-Nya tersesat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 15",
    "description": "Dan, selain itu, dia menghilangkan kemarahan hati mereka, orangorang mukmin, yang disebabkan penyiksaan yang begitu kejam terhadap mereka sejak di mekah. Namun begitu, jika mereka bertobat, maka akan diterima tobatnya dan mereka memiliki hak dan kewajiban yang sama dengan kalian. Demikian ini, karena Allah menerima tobat orang yang dia kehendaki jika memang secara tulus bertobat kepadanya. Allah maha mengetahui segala urusan hamba-hamba-Nya, mahabijaksana atas segala ketentuan syariat dan kebijakan-Nyaayat-ayat yang lalu menerangkan kewajiban kaum muslim untuk memerangi kaum musyrik yang merusak perjanjian damai dengan mereka, sedang ayat ini menegaskan alasannya bahwa perintah berperang itu demi membedakan mana yang berperang dengan ikhlas karena Allah dan yang mengharap duniawi semata. Apakah kamu, wahai kaum mukminin, mengira bahwa kamu akan dibiarkan begitu saja hanya gara-gara kamu mengaku sebagai orang mukmin (lihat: surah al'ankabut/29: 1-3), padahal Allah belum mengetahui kesungguhan keimanan kamu sebagai orang-orang yang berjihad di antara kamu dengan jihad yang sesungguhnya sehingga kaum musyrik tidak lagi berani merusak perjanjian dan mencerca agamamu, dan apakah juga telah terbukti bahwa kamu tidak mengambil kaum musyrik yang menjadi musuhmu itu sebagai teman yang setia selain Allah, rasul-Nya dan orang-orang yang beriman, sebab mereka akan selalu menciptakan kerusakan dan fitnah di antara kamu' sungguh, Allah mahateliti terhadap apa yang kamu kerjakan dan akan membalasnya dengan balasan yang setimpal."
  }
]