[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bukanlah termasuk urusan kaum musyrikin, memakmurkan masjid-masjid Allah, sedang mereka mengumumkan dengan terang-terangan kekafiran kepada Allah dan mereka mengadakan sekutu-sekutu bagiNya. Orang-orang musyrik itu telah terhapus amal-amal perbuatan mereka pada hari Kiamat, dan tempat kembali mereka adalah keabadian di dalam neraka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Tidak sepatutnya orang-orang musyrik memakmurkan masjid-masjid Allah dengan kegiatan-kegiatan ibadah dan ketaatan-ketaatan lainnya, sedangkan mereka mengakui kekafiran mereka secara terbuka. Amal perbuatan mereka itu sia-sia karena tidak memenuhi salah satu syarat diterimanya amal, yaitu iman. Dan kelak di hari Kiamat mereka akan masuk ke dalam Neraka dan menetap di dalamnya untuk selama-lamanya. Kecuali apabila mereka bertobat dari kemusyrikan mereka sebelum mereka meninggal dunia."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "17. Setelah Allah memperingatkan orang-orang beriman dari menjadikan orang-orang musyrik sebagai orang-orang terdekat yang mengetahui rahasia-rahasia; kemudian Allah menjelaskan bahwa orang-orang musyrik tersebut tidak layak melakukan kebaikan, selama mereka melakukan itu tidak didasarkan pada keimanan kepada Allah: “Tidak layak bagi orang-orang musyrik untuk memakmurkan masjid-masjid Allah yang diantaranya adalah Masjidil Haram dengan melakukan ibadah di sana, memberi pelayanan, atau menguasainya; sedangkan mereka telah bersaksi dengan perkataan dan perbuatan bahwa mereka adalah orang-orang kafir, dengan menyembah dan meminta syafaat kepada berhala-berhala. Orang-orang musyrik itu telah kafir kepada Allah dan risalah yang dibawa oleh Rasulullah. Amalan mereka telah terhapus, sehingga tidak ada kebaikan dalam diri mereka selama mereka tetap dalam kesyirikan dan akibat-akibat buruknya. Dan mereka akan masuk neraka, kekal selama-lamanya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "17. مَا كَانَ لِلْمُشْرِكِينَ أَن يَعْمُرُوا۟ مَسٰجِدَ اللهِ (Tidaklah pantas orang-orang musyrik itu memakmurkan mesjid-mesjid Allah) Yakni tidak layak bagi mereka untuk menjadikan masjid-masjid sebagai tempat ibadah mereka dan menjadi pelayan-pelayan dari masjid-masjid tersebut. شٰهِدِينَ عَلَىٰٓ أَنفُسِهِم بِالْكُفْرِ ۚ( sedang mereka mengakui bahwa mereka sendiri kafir) Dengan menunjukkan perbuatan kafir mereka seperti mendirikan patung-patung dan menyembahnya serta menjadikannya tuhan-tuhan. Lalu bagaimana mereka akan mengumpulkan hal ini dengan memakmurkan masjid-masjid yang menjadi urusan orang-orang beriman saja. Pendapat lain mengatakan yang dimaksud pengakuan mereka ini adalah perkataan mereka ketika berthawaf: “aku penuhi panggilan-Mu, tidak ada sekutu bagi-Mu kecuali sekutu milik-Mu, yang Engkau miliki sedang sekutu itu tidak memiliki. أُو۟لٰٓئِكَ حَبِطَتْ أَعْمٰلُهُمْ(Itulah orang-orang yang sia-sia pekerjaannya) Yang mereka bangga-banggakan dan yang mereka kira merupakan amalan-amalan yang baik yang telah mereka kerjakan, diantaranya adalah memakmurkan masjid-masjid. Yakni amalan-amalan mereka sirna tak tersisa."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17 Tidaklah pantas orang-orang musyrik itu memakmurkan masjid-masjid Allah baik secara maknawi dengan ibadah, iktikaf maupun ziyaroh. Sekalipun berupa materi dalam bangunan ataupun dengan bantuan, sedang mereka mengakui bahwa mereka sendiri kafir karena menyembah berhala. Itulah orang-orang yang akan mati dalam kesyirikan, sia-sia pekerjaannya, dan mereka kekal di dalam neraka. Al ‘Abbas berkata ketika perang Badr: Jika kalian tidak lebih dulu masuk Islam, hijrah dan jihad maka pasti kami yang akan memakmurkan masjidil haram, memberi minum para haji. Maka turunlah ayat ini, yang membawa maksud bahwa tidak diterima suatu yang syirik."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidaklah pantas} tidak sepatutnya {bagi orang-orang musyrik itu memakmurkan masjid-masjid Allah, dan mereka bersaksi} berikrar {bahwa diri mereka kafir. Itulah orang-orang yang sia-sia} sia-sia {amal mereka dan di dalam neraka mereka kekal"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17. Allah berfirman, “Tidaklah pantas”, yakni tidak semestinya dan tidak layak “orang-orang musyrik itu memakmurkan masjid-masjid Allah”, dengan ibadah, shalat dan ketaatan-ketaatan lainnya. Sementara mereka bersaksi dan mengakui bahwa diri mereka adalah kafir, dengan kesaksian keadaan dan fitrah mereka, serta pengetahuan banyak kalangan dari mereka bahwa mereka di atas kekufuran dan kebatilan. Jika mereka “mengakui bahwa mereka sendiri kafir,” tidak memiliki iman yang merupakan syarat diterimanya amal, bagaimana mereka mengklaim bahwa diri mereka adalah orang-orang yang memakmurkan masjid Allah, padahal mereka tidak mempunyai dasar dan amal mereka adalah batal. Oleh karena itu Allah berfirman, “Itulah orang-orang yang sia-sia pekerjaannya”, yakni batal dan sia-sia. “Dan mereka kekal di dalam neraka.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 17: Dengan masuk dan duduk di dalamnya atau dengan melakukan berbagai ibadah padahal mereka mengakui bahwa diri mereka adalah kafir; tidak beriman. Sedangkan syarat diterimanya amal adalah beriman."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 17",
    "description": "Rangkaian ayat-ayat di atas menunjukkan pembatalan perjanjian dengan kaum musyrik, sedang ayat ini menegaskan pembatalan amalamal mereka yang selalu mereka banggakan, seperti memakmurkan masjid. Tidaklah pantas bagi orang-orang musyrik, setelah penaklukan kota mekah, memakmurkan masjid Allah, yakni masjidilharam dan juga masjid-masjid yang lain, padahal mereka mengakui sendiri kalau mereka itu kafir. Sebab, tanpa didasari iman yang benar, maka amal mereka itu akan sia-sia belaka, dan justru kekufurannya itu menjadikan mereka kekal di dalam neraka sedangkan amal-amal baiknya tidak ada manfaatnya bagi mereka. (lihat: surah ibra'him/14: 18 dan an-nur/24: 38). Inilah kriteria mereka yang berhak memakmurkan masjid. Sesungguhnya yang paling berhak memakmurkan masjid Allah hanyalah orangorang yang beriman kepada Allah dan hari kemudian, serta tetap atau senantiasa melaksanakan salat, menunaikan zakat jika mampu dan tidak takut kepada siapa pun kecuali kepada Allah, maka mudah-Mudahan mereka termasuk orang-orang yang bisa diharapkan untuk selalu mendapat petunjuk ke jalan yang benar."
  }
]