[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidaklah memeberi perhatian terhadap rumah-rumah Allah dan memakmurkannya, kecuali orang-orang yang beriman kepada Allah dan Hari Akhir dan menegakan solat, membayar zakat dan tidak takut di jalan Allah kepada orang-orang yang mencaci. Orang-orang yang memakmurkan (masjid-masjid Allah) itulah orang-orang yang memperoleh hidayah menuju kebenaran."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Sesungguhnya yang berhak memakmurkan dan mengurus masjid-masjid Allah hanyalah orang-orang yang beriman kepada Allah semata dan tidak menyekutukan-Nya dengan sesuatu, mendirikan salat, membayar zakat, dan tidak takut kepada siapa pun selain Allah -Subḥānahu-. Mereka itulah orang-orang yang diharapkan mendapat petunjuk ke jalan yang lurus. Sedangkan orang-orang musyrik terlalu jauh dari harapan itu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "18. Sesungguhnya orang-orang yang berhak memakmurkan masjid-masjid adalah orang-orang yang beriman kepada Allah dan hanya beribadah dan bertawakkal kepada-Nya, beriman kepada hari akhir, mendirikan shalat wajib dengan menyempurnakan rukun dan syarat-syaratnya, menunaikan zakat bagi fakir miskin yang berhak mendapatkannya, dan hanya takut kepada Allah semata. Mereka adalah orang-orang yang memiliki derajat yang tinggi, yang senantiasa berharap dapat melakukan apa yang mendatangkan kecintaan dan keridhaan Allah dengan memakmurkan masjid-masjid secara lahir batin; sehingga mereka berhak mendapatkan balasan surga."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "18. إِنَّمَا يَعْمُرُ مَسٰجِدَ اللهِ مَنْ ءَامَنَ بِاللهِ وَالْيَوْمِ الْاٰخِرِ (Hanya yang memakmurkan masjid-masjid Allah ialah orang-orang yang beriman kepada Allah dan Hari kemudian) Yakni mereka merupakan orang-orang yang berkemampuan untuk memakmurkan masjid-masjid, dan bukan dari orang-orang musyrik dan kafir. وَلَمْ يَخْشَ (dan tidak takut) Kepada siapapun. إِلَّا اللهَ ۖ( selain kepada Allah) Maka barangsiapa yang beriman dan bertauhid yang menjalankan amal-amal shalih ini sebagaimana yang diperintahkan Allah maka ia berhak untuk menjadi orang-orang yang memakmurkan masjid-masjid, dan bukan orang yang tidak menjalankan amal-amal tersebut. فَعَسَىٰٓ أُو۟لٰٓئِكَ أَن يَكُونُوا۟ مِنَ الْمُهْتَدِينَ (maka merekalah orang-orang yang diharapkan termasuk golongan orang-orang yang mendapat petunjuk) Jika pemberian petunjuk kepada orang-orang yang beriman itu baru sekedar sesuatu yang diharapkan, lalu bagaimana dengan orang-orang kafir yang tidak memiliki sifat-sifat yang telah disebutkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "18 Hanya yang memakmurkan masjid-masjid Allah dengan ibadah dan khidmah ialah orang-orang yang beriman kepada Allah dan Hari akhir, serta tetap mendirikan shalat fardhu sesuai waktunya, menunaikan zakat kepada yang berhak dan tidak takut kepada siapapun selain kepada Allah, maka merekalah orang-orang yang diharapkan termasuk golongan orang-orang yang mendapat petunjuk kebenaran, kebaikan dan ridho Allah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya yang memakmurkan masjid-masjid Allah adalah orang yang beriman kepada Allah dan hari akhir, mendirikan shalat, menunaikan zakat, serta tidak takut kecuali kepada Allah. Mereka itulah yang diharapkan termasuk golongan orang-orang yang mendapat petunjuk"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "18. Kemudian Allah menyebutkan siapa orang-orang yang memakmurkan masjid Allah sebenarnya, Dia berfirman, “Hanyalah yang memakmurkan masjid-masjid Allah ialah orang-orang yang beriman kepada Allah dan Hari Kemudian, serta tetap mendirikan shalat”, yang wajib dan yang Sunnah dengan melaksanakan yang lahir dan yang batin darinya, “menunaikan zakat”, kepada yang berhak menerimanya, “dan tidak takut (kepada siapa pun) selain kepada Allah.” Yakni, Dia membatasi rasa takutnya hanya kepada Allah, sehingga dia menahan diri dari yang diharamkan Allah, dan tidak melalaikan hak-hak Allah yang wajib, maka Allah menyifati mereka dengan iman yang bermanfaat dan melakukan amal shalih yang intinya adalah shalat dan zakat, serta dengan rasa takut kepada Allah yang merupakan pokok semua kebaikan. Mereka itulah para pemakmur masjid dan ahlinya yang sebenar-benarnya. “Maka merekalah orang-orang yang diharapkan termasuk golongan orang-orang yang mendapat petunjuk”, jika dari Allah maka artinya adalah pasti terjadi. Adapun orang yang tidak beriman kepada Allah dan kepada Hari Akhir dan tidak memiliki rasa takut kepada Allah, maka dia bukan termasuk orang-orang yang memakmurkan masjid dan bukan pula ahlinya yang sebenarnya, meskipun dia mengaku dan mengklaim."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 18: Memakmurkan masjid terbagi dua; zhahir dan batin. Zhahir berkaitan dengan fisik (seperti bersih dan nyaman), sedangkan batin berkaitan dengan dzikrullah dan syi’ar-syi’ar Islam (seperti azan, shalat Jum’at, dan shalat berjama’ah, membaca Al Qur’an, berdzikr, beribadah, dsb.) dan kegiatan keagamaan (seperti pengajian dan pendalaman agama). Allah menyifati mereka dengan iman yang bermanfaat, mengerjakan amal saleh yang induknya adalah shalat dan zakat, dan memiliki rasa takut kepada Allah yang merupakan pangkal semua kebaikan. Karena rasa takut kepada Allah, mereka menjauhi yang dilarang-Nya dan memperhatikan hak-hak-Nya yang wajib. Mereka inilah yang pantas memakmurkannya. Adapun orang yang tidak beriman kepada Allah dan hari akhir, serta tidak memiliki rasa takut kepada Allah, maka mereka tidaklah pantas memakmurkan masjid-Nya meskipun mereka mengaku yang berhak memakmurkannya. Kata “mudah-mudahan” jika dari Allah berarti mesti."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 18",
    "description": "Inilah kriteria mereka yang berhak memakmurkan masjid. Sesungguhnya yang paling berhak memakmurkan masjid Allah hanyalah orangorang yang beriman kepada Allah dan hari kemudian, serta tetap atau senantiasa melaksanakan salat, menunaikan zakat jika mampu dan tidak takut kepada siapa pun kecuali kepada Allah, maka mudah-Mudahan mereka termasuk orang-orang yang bisa diharapkan untuk selalu mendapat petunjuk ke jalan yang benar. Ayat ini menerangkan keunggulan mereka yang beriman kepada Allah dan hari akhir dan berjihad di jalan Allah. Apakah kebiasaan kamu sekalian, wahai kaum musyrik, yang memberi minuman kepada orangorang yang mengerjakan haji dan mengurus masjidil-haram, kamu samakan dengan orang yang beriman kepada Allah dan hari kemudian serta berjihad di jalan Allah' mereka jelas-jelas tidak sama di sisi Allah, sebab itu semua dilakukan bukan atas dasar iman yang benar, justru perbuatan baik itu mereka iringi dengan kemusyrikan. Padahal, syirik adalah bentuk kezaliman yang terbesar, dan Allah tidak akan memberikan petunjuk, yakni bimbingan ke jalan yang benar, kepada orang-orang zalim."
  }
]