[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah kalian (wahai kaum), menjadikan tanggung jawab yang kalian laksanakan berupa memberi minum orang-orang yang mengerjakan haji dan memakmurkan Masjidil Haram setara dengan keimanan orang-orang yang beriman kepada Allah dan Hari akhir dan berjihad di jalan Allah? Tidaklah sama keadaan orang-orang mukminin dan keadaan orang-orang kafir di sisi Allah. Karena sesungguhnya Allah tidak menerima amalan tanpa di dasari oleh keimanan. Dan Allah tidak memberikan taufik untuk mengerjakan amal-amal kebaikan bagi kaum yang berbuat kezhaliman terhadap diri mereka dengan kekafiran."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Apakah kalian -wahai orang-orang musyrik- menganggap bahwa orang-orang yang menyediakan air minum bagi jamaah haji dan mengurus Masjidilharam itu sama dengan orang-orang yang beriman kepada Allah dan tidak menyekutukan-Nya dengan sesuatu, dan beriman kepada hari Kiamat, serta berjihad dengan jiwa dan hartanya untuk menjunjung tinggi kalimat Allah dan menjatuhkan kalimat orang-orang kafir. Apakah kalian beranggapan bahwa mereka memiliki keutamaan yang sama di sisi Allah? Mereka sama sekali tidak sama di sisi Allah. Dan Allah tidak akan membimbing orang-orang zalim yang berbuat syirik, walaupun mereka melakukan perbuatan yang baik, seperti menyediakan air minum bagi jamaah haji."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "19. Tidak pantas bagi kalian menjadikan keuatamaan orang-orang yang memberi minum orang yang ada di Masjidil Haram dan orang yang memakmurkannya, seperti keutamaan orang-orang yang beriman kepada Allah dan hari akhir, dan berjihad di jalan Allah. Hal ini karena meskipun memberi minum dan memakmurkan masjid merupakan amal kebaikan, akan tetapi itu tidak menandingi ketinggian derajat orang yang beriman dan berjihad. Allah tidak akan memberi petunjuk orang-orang zalim kepada kebenaran dalam amal perbuatan mereka, dan kepada keadilan dalam menilai amal perbuatan orang lain."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "19. أَجَعَلْتُمْ سِقَايَةَ الْحَآجِّ وَعِمَارَةَ الْمَسْجِدِ الْحَرَامِ (Apakah (orang-orang) yang memberi minuman orang-orang yang mengerjakan haji dan mengurus Masjidilharam) Allah mengingkari mereka yang telah menyamakan antara amal-amal yang mereka kerjakan di masa Jahiliyah yang nampak seperti amal-amal kebaikan meskipun tidak mendapat manfaat darinya dan antara keimanan orang-orang mukmin dan jihad mereka di jalan Allah. Orang-orang musyrik dahulu membangga-banggakan perbuatan mereka memberi minum para jamaah haji dan mengurus Baitullah dan mengunggulkannya atas amal yang dilakukan oleh orang-orang beriman. لَا يَسْتَوُۥنَ عِندَ اللهِ ۗ (Mereka tidak sama di sisi Allah) Yakni golongan yang kafir yang memberi minum jamaah haji dan mengurus Masjidil Haram tidak sama dengan golongan yang beriman kepada Allah dan hari akhir, yang berjihad di jalan Allah. Lalu bagaimana mereka mengaku bahwa mereka lebih mulia dalam amalan dan kedudukan daripada orang-orang beriman. وَاللهُ لَا يَهْدِى الْقَوْمَ الظّٰلِمِينَ(dan Allah tidak memberi petunjuk kepada kaum yang zalim) Allah menyebut mereka dengan orang-orang yang zalim, maka tidak berguna lagi bagi mereka pemakmuran Masjidil Haram sedikitpun. Kemudian Allah menjelaskan golongan yang lebih mulia pada ayat selanjutnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19 Apakah kalian wahai orang musyrik akan menjadikan orang-orang yang memberi minuman orang-orang yang mengerjakan haji dan mengurus Masjidilharam itu kamu samakan dengan orang-orang yang beriman kepada Allah dan hari kemudian serta bejihad di jalan Allah? Mereka dua kelompok itu tidak sama di sisi Allah; kafir dan mukmin, lalu bagaimana kalian merasa amal kalian lebih baik daripada orang-orang mukmin? Tidak ada kemanfaatan amal tanpa disertai iman, Allah tidak memberi taufik orang kafir dalam kebaikan, dan pemakmuran mereka terhadap masjidil haram tidak ada guna sama sekali. Ayat ini turun untuk menjawab orang musyrik yang sombong atas perbuatan mereka memberi minum dan berkhidmah di masjidil haram, mereka menyangka bahwa itu adalah hal terbaik yang dilakukan Qurays, dan dan melebihi amal orang-orang muslim. Ibnu Abbas menyangka seperti itusebelum masuk Islam"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah kalian menjadikan pemberian minuman orang yang menunaikan haji dan mengurus Masjidil haram itu seperti orang yang beriman kepada Allah dan hari akhir serta berjihad di jalan Allah. Mereka tidak sama di hadapan Allah. Allah tidak memberikan petunjuk} tidak memberi tuntunan {kepada kaum yang zalim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "19. Manakala terjadi perbedaan pandangan di antara sebagian kaum Muslimin, atau di antara sebagian kaum Muslimin, dengan sebagian kaum musyrikin tentang mana yang lebih utama antara memakmurkan Masjidil Haram dengan membangunnya, shalat dan ibadah di dalamnya serta memberi minum kepada jamaah haji, dengan iman kepada Allah dan jihad di jalanNya, maka Allah memberitahukan adanya perbedaan di antara keduanya, Dia berfirman, “Apakah (orang-orang) yang memberi minuman kepada orang-orang yang mengerjakan haji.” Yakni memberi mereka minum dari air zam-zam, sebagaimana sudah diketahui bahwa jika nama ini disebut secara mutlak maka maksudnya adalah itu, “dan mengurus Masjidil Haram, kamu samakan dengan orang-orang yang beriman kepada Allah dan Hari Kemudian serta berjihad di jalan Allah? Mereka tidak sama di sisi Allah”, jihad dan iman kepada Allah lebih utama dengan banyak derajat daripada memakmurkan Masjidil Haram dan memberi minum air zam-zam kepada jamaah, karena iman adalah dasar agama, dengannya amal ibadah diterima dan sifat-sifat menjadi suci bersih. Adapun jihad di jalan Allah, maka ia adalah puncak tertinggi agama Islam, yang dengannya agama Islam terjaga dan tersebar luas, dan dengannya kebenaran dimenangkan dan kebatilan dicampakkan. Adapun memakmurkan Masjidil Haram dan memberi minum untuk jamaah, walaupun ia adalah amal shalih, akan tetapi ia bergantung kepada iman, dan tidak terdapat padanya kemaslahatan seperti yang ada pada iman dan jihad di jalanNya, oleh karena itu Dia berfirman, “Mereka tidak sama di sisi Allah, dan Allah tidak memberikan petunjuk kepada kaum yang zhalim.” Yakni orang-orang yang sifat mereka adalah kezhaliman, yang tidak layak menerima sedikit pun kebaikan, justru tidak ada yang layak bagi mereka kecuali keburukan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 19: Ketika sebagian kaum muslimin berselisih, atau sebagian kaum muslimin dan sebagian kaum musyrik berselisih tentang mana yang lebih utama antara memakmurkan Masjidilharam (dengan membangunnya, shalat dan beribadah di sana serta memberi minum jama’ah haji) dengan beriman kepada Allah dan berjihad di jalan-Nya, maka Allah Subhaanahu wa Ta'aala memberitahukan bahwa beriman kepada Allah dan berjihad di jalan-Nya adalah lebih utama dengan beberapa derajat dari memberi minum jamaah haji dan memakmurkan Masjidilharam. Yang demikian adalah karena iman merupakan pondasi agama, dan dengannya amal akan tegak dan diterima. Adapun jihad di jalan Allah, maka ia adalah puncak agama, di mana dengannya agama Islam terjaga dan semakin meluas, kebenaran terbela dan kebatilan terkalahkan. Sedangkan memakmurkan Masjidilharam dan memberi minum jamaah haji meskipun sebagai amal salih, namun ia tergantung dengan adanya iman, dan di sana juga tidak terdapat maslahat yang sama seperti dalam masalah iman dan jihad. Imam Muslim meriwayatkan dari Nu’man bin Basyir, ia berkata, “Aku pernah berada di dekat mimbar Rasulullah shallallahu 'alaihi wa sallam, lalu ada seseorang yang berkata, “Aku tidak peduli lagi jika setelah Islam amalku hanya memberi minum orang yang naik haji.” Yang lain berkata, “Aku tidak peduli lagi jika setelah Islam amalku hanya mengurus Masjidilharam.”. Sedangkan yang lain lagi berkata, “Berjihad di jalan Allah lebih utama dari apa yang kamu katakan”, maka Umar membentak mereka dan berkata, “Janganlah kamu tinggikan suaramu di dekat mimbar Rasulullah shallallahu 'alaihi wa sallam,” sedangkan saat itu adalah hari Jum’at. Akan tetapi, apabila aku telah shalat Jum’at, aku akan masuk (menemui Beliau) dan bertanya kepada Beliau tentang masalah yang kamu perselisihkan, maka Allah menurunkan ayat, “Aja’altum siqaayatal hajji wa ‘imaaratal masjidil haram kaman aamana billahi wal yaumil aakhir…dst.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 19",
    "description": "Ayat ini menerangkan keunggulan mereka yang beriman kepada Allah dan hari akhir dan berjihad di jalan Allah. Apakah kebiasaan kamu sekalian, wahai kaum musyrik, yang memberi minuman kepada orangorang yang mengerjakan haji dan mengurus masjidil-haram, kamu samakan dengan orang yang beriman kepada Allah dan hari kemudian serta berjihad di jalan Allah' mereka jelas-jelas tidak sama di sisi Allah, sebab itu semua dilakukan bukan atas dasar iman yang benar, justru perbuatan baik itu mereka iringi dengan kemusyrikan. Padahal, syirik adalah bentuk kezaliman yang terbesar, dan Allah tidak akan memberikan petunjuk, yakni bimbingan ke jalan yang benar, kepada orang-orang zalim orang-orang yang beriman terutama kepada Allah dan hari akhir, dan berhijrah dengan meninggalkan hal-hal yang dilarang serta berjihad di jalan Allah, dengan harta dan jiwa mereka, adalah lebih tinggi derajatnya di sisi Allah dibanding orang-orang kafir itu meski mereka berbuat baik seperti memberi mi-num orang-orang yang haji dan memakmurkan masjidilharam. Mereka, yakni orang-orang yang beriman, berhijrah, dan berjihad, itulah orang-orang yang memperoleh kemenangan yang hakiki."
  }
]