[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka berjalanlah kalian (wahai kaum musyrikin), di muka bumi selama empat bulan, kalian bisa pergi kemana saja kalian suka dalam keadaan aman dari kaum mukminin. Dan ingatlah bahwa sesungguhnya kalian tidak akan lolos dari siksaan. Dan sesungguhnya Allah akan menghinakan orang-orang kafir dan membebaskan pada mereka kenistaan di dunia dan neraka di akhirat. Ayat ini berlaku pada kalangan yang menjalin perjanjian yang bersifat mutlak, bukan perjanjian yang berdurasi hingga waktu tertentu, atau golongan yang terikat dengan perjanjian selama kurang dari empat bulan sehingga dilengkapi masanya hingga empat bulan, atau pihak yang menjalin perjanjian kemudia dia melanggarnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Maka berjalanlah kalian -wahai orang-orang musyrik- di muka bumi dengan aman selama empat bulan. Setelah itu tidak ada lagi perjanjian dan jaminan keamanan bagi kalian. Yakinlah bahwa kalian tidak akan luput dari azab dan hukuman Allah jika kalian tetap melanjutkan kekafiran kalian kepada Allah. Dan yakinlah bahwa Allah akan menistakan orang-orang kafir dengan menjadikan mereka sebagai sasaran pembunuhan dan penawanan di dunia, dan memasukkan mereka ke dalam Neraka di hari Kiamat. Pengumuman ini juga mencakup orang-orang yang melanggar janji mereka dan orang-orang yang memiliki waktu perjanjian tak terbatas. Namun bagi mereka yang memiliki waktu perjanjian terbatas, meskipun batas waktunya lebih dari empat bulan, maka perjanjian tersebut harus dijalankan sampai batas waktu yang telah disepakati."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. فَسِيحُوا۟ فِى الْأَرْضِ أَرْبَعَةَ أَشْهُرٍ (Maka berjalanlah kamu (kaum musyrikin) di muka bumi selama empat bulan) Yakni setelah Allah memerintahkan untuk membatalkan perjanjian dengan orang-orang musyrik, Dia membolehkan mereka untuk melakukan perjalanan di muka bumi dan pergi ke tempat yang mereka inginkan serta mempersiapkan perang dalam empat bulan tersebut. Kemudian mereka akan di perangi oleh Allah, Rasulullah, dan orang-orang beriman, mereka akan dibunuh dimanapun mereka ditemui. Hal ini dimulai sejak hari haji besar sampai 10 Rabi’ul Akhir di tahun berikutnya. وَاعْلَمُوٓا۟ أَنَّكُمْ غَيْرُ مُعْجِزِى اللهِ (dan ketahuilah bahwa sesungguhnya kamu tidak akan dapat melemahkan Allah) Yakni ketahuilah bahwa penangguhan bagi mereka ini bukanlah kerena kelemahan, namun demi kemaslahatan, agar bertaubat orang yang ingin bertaubat. Maka janganlah kalian menyia-nyiakan Allah sedang kalian dalam ancaman mendapat kehinaan dari Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2 Katakanlah kepada kaum musyrikin: Maka berjalanlah kamu kaum musyrikin di muka bumi selama empat bulan, dimulai dari hari Haji akbar pada hari kesepuluh bulah Dzulhijjah tahun kesembilan hari penyampaian surat ini. Ketahuilah bahwa sesungguhnya kamu tidak akan dapat melemahkan Allah dengan lari darinya ketika Dia hendak menghukum kesyirikan kalian, dan sesungguhnya Allah menghinakan orang-orang kafir dan mengazab mereka di dunia dan akhirat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Berjalanlah} wahai orang-orang musyrik berjalanlah dengan aman {di bumi selama empat bulan dan ketahuilah bahwa kalian tidak dapat melemahkan} tidak dapat membuat lengah {Allah. Sesungguhnya Allah menghinakan} menghinakan {orang-orang kafir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-2. “Inilah pernyataan pemutusan hubungan dari Allah dan RasulNya yang di hadapkan”, kepada seluruh orang-orang musyrik yang berada dalam perjanjian damai, bahwa mereka memiliki empat bulan untuk berkeliling dunia sesuka mereka dalam keadaan aman dari orang-orang Mukmin, dan setelah empat bulan tersebut tidak ada lagi perjanjian dan jaminan. Ini berlaku bagi mereka yang dalam perjanjian mutlak, tidak terbatas atau terbatas, dengan empat bulan atau kurang, adapun yang mempunyi perjanjian lebih dari empat bulan, maka wajib disempurnakan sampai akhir, jika tidak dikhawatirkan pengkhianatannya, dan mereka tidak memulai membatalkan penjanjian. Kemudian Allah memperingatkan orang-orang musyrik yang berada di dalam perjanjian, bahwa meskipun mereka aman, mereka tidak dapat melemahkan Allah dan mengelahanNya, barangsiapa diantara mereka yang terus berpegang dengan kesyirikan, maka Allah pasti akan menghinakannya. Hal ini termasuk pendorong bagi mereka untuk masuk Islam, kecuali orang-orang yang menyombongkan diri, dan menetang dan mengabaikan ancaman Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 2: Dan setelah berlalu empat bulan, maka tidak ada keamanan lagi bagimu. Hal ini bagi mereka yang mengadakan perjanjian mutlak atau dibatasi sampai empat bulan atau kurang, adapun mereka yang mengadakan perjanjian lebih dari empat bulan, maka harus dipenuhi sampai habis waktunya jika tidak dikhawatirkan pengkhianatan darinya dan tidak memulai membatalkan perjanjian. Mereka yang diberi tangguh empat bulan itu ialah yang memungkiri janji dengan Nabi Muhammad shallallahu 'alaihi wa sallam. Adapun mereka yang tidak memungkiri janjinya, maka perjanjian itu diteruskan sampai berakhir masa yang ditentukan dalam perjanjian itu. Setelah masa itu berakhir, maka tidak ada lagi perdamaian dengan orang-orang musyrik. Allah memperingatkan kepada mereka yang mengikat perjanjian selama masa perjanjian berlangsung, bahwa meskipun mereka aman, namun sesungguhnya mereka tidak dapat melemahkan Allah dan tidak dapat lolos dari azab-Nya, dan siapa saja yang tetap di atas kesyirkannya, maka Allah akan menghinakannya. Hal inilah yang menyebabkan mereka masuk Islam, kecuali mereka yang keras hatinya dan tidak peduli terhadap ancaman Allah Azza wa Jalla. Di dunia dengan dihalalkan darahnya dan di akhirat dengan diazab dalam api neraka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 2",
    "description": "Namun begitu, mereka tetap diberi waktu untuk memikirkan kembali apakah memilih untuk masuk islam dengan memegang perjanjian bersama, atau berperang. Di samping itu, penundaan tersebut agar mereka bisa mempersiapkan diri, seandainya harus memilih untuk berperang, sehingga perang berjalan secara adil. Maka di saat gencatan senjata tersebut, berjalanlah kalian, wahai kaum musyrik, di bumi mekah, selama empat bulan yaitu mulai 10 zulhijah sampai dengan 10 rabi'ul akhir, dengan leluasa dan tanpa takut diserang oleh kaum muslimin, sebagaimana keadaan kalian sebelum pemutusan hubungan ini. Dan setelah lewat empat bulan, maka ketahuilah bahwa kalian tidak dapat melemahkan Allah, meski didukung oleh personil tentara dan persenjataan yang lengkap; dan dengan kekalahan tersebut serta menjadi ta-wanan sesungguhnya Allah hendak menghinakan orang-orang kafir di dunia. Bahkan, di akhirat kelak, jika tidak bertobat, kalian merasakan siksa yang pedih (lihat: surah az-zumar/39: 25-26). Ini sikap toleransi islam, pada satu sisi, dan menunjukkan keperkasaan islam, pada sisi yang lain. Demikian ini, agar tidak muncul tuduhan bahwa kaum mus-lim sengaja menyerang mereka secara tiba-tiba tanpa memberi kesem-patan berpikir atau mempersiapkan diri. Setelah ayat sebelumnya menyatakan pemutusan hubungan dengan kaum musyrik mekah, maka ayat ini menegaskan kembali maklumat ini serta menyebarluaskannya kepada semua orang dalam tenggang waktu empat bulan. Dan bahwa inilah satu maklumat atau pemberitahuan dari Allah dan rasul-Nya kepada umat manusia pada hari haji akbar yang terjadi pada tahun ke-9 hijriah, bahwa sesungguhnya Allah dan rasulnya berlepas diri dari orang-orang musyrik mekah berupa pemutusan hubungan perjanjian dengan mereka; dan begitu pula rasul-Nya melakukan hal yang sama. Kemudian Allah menegaskan kembali jika kalian, wahai kaum musyrik, bertobat, maka itu lebih baik bagi kalian di dunia dan akhirat; dan jika kalian berpaling dari keimanan yang benar atau tidak mau bertobat, maka ketahuilah bahwa kalian tidak dapat melemahkan atau lari dari azab Allah. Dan dengan demikian berilah kabar gembira kepada orang-orang kafir tersebut bahwa mereka akan mendapat azab yang pedih, baik di dunia ini sebagai tawanan atau terbunuh dan di akhirat kelak, yaitu dimasukkan ke dalam neraka."
  }
]