[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya mereka orang-orang mukmin yang berhijrah itu, bagi mereka berita gembira dari Tuhan mereka dengan rahmat yang luas dan keridhaan yang tdak ada kemurkaan setelah itu. Dan tempat kembali mereka adalah menuju surga yang abadi dan kenikmatan yang terus menerus."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Allah, Rabb mereka, menyampaikan kepada mereka sesuatu yang menyenangkan hati mereka, yaitu kasih sayang dan keridaan dari-Nya untuk mereka, sehingga Dia tidak akan pernah murka kepada mereka, dan Dia akan memasukkan mereka ke dalam surga-surga di mana mereka akan mendapatkan kenikmatan abadi yang tidak akan pernah berhenti."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "21-22. Setelah Allah menyebutkan balasan yang besar bagi mereka; kemudian Allah menjelaskan balasan tersebut: “Tuhan mereka memberi mereka kabar gembira melalui lisan Rasul-Nya dan lisan para malaikat ketika mereka meninggal dunia, bahwa mereka akan mendapatkan rahmat dan keridhaan-Nya yang tidak akan tercampur dengan kemurkaan-Nya, surga-surga yang mengalir di bawahnya sungai-sungai, dan dalam surga-surga itu mereka mendapat kenikmatan yang tidak akan habis karena begitu besar dan sempurna, mereka akan tinggal dalam surga-surga itu selama-lamanya. Sesungguhnya balasan atas keimanan dan amal shalih di sisi Allah yang diberikan kepada hamba-hamba-Nya tidak ada yang dapat mengukurnya kecuali Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "21. يُبَشِّرُهُمْ رَبُّهُم بِرَحْمَةٍ مِّنْهُ وَرِضْوٰنٍ وَجَنّٰتٍ لَّهُمْ فِيهَا نَعِيمٌ مُّقِيمٌ (Tuhan mereka menggembirakan mereka dengan memberikan rahmat dari pada-Nya, keridhaan dan surga, mereka memperoleh didalamnya kesenangan yang kekal) Kesenangan diatas apa yang disebutkan dan dibayangkan siapapun. Dan makna (النعيم المقيم) yakni yang kekal dan terus-menerus yang tak akan lepas dari pemiliknya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "21 Tuhan mereka memberi kabar gembira mereka dengan memberikan rahmat dari pada-Nya, keridhaan, yaitu ridho yang sempurna dari segala hal, itu adalah nikmat surga yang paling agung dan berupa surga-surga, mereka memperoleh kesenangan yang kekal di dalamnya dan tidak dipisahkan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tuhan mereka memberi kabar gembira kepada mereka dengan rahmat dariNya, keridaan, dan surga-surga. Bagi mereka di dalamnya itu kesenangan yang kekal} kekekalan yang tidak akan hilang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21. “Rabb mereka menggembirakan mereka”, sebagai rahmat, kemurahan, kebaikan, perhatian, dan kecintaan dariNya untuk mereka “dengan memberikan rahmat daripadaNya.” Dengannya Dia menghilangkan keburukan-keburukan dan menyampaikan kepada mereka semua kebaikan, “keridhaan” dariNya yang merupakan kenikmatan surga paling besar dan paling utama. Dia memberikan keridhaanNya, maka Dia tidak murka kepada mereka selamanya. “Dan Surga, mereka memperoleh di dalamnya kesenangan yang kekal.” Dari semua yang diinginkan oleh jiwa, yang dinikmati oleh mata yang tidak diketahui sifat dan kadarnya kecuali oleh Allah yang di antaranya adalah bahwa Allah menyediakan bagi para mujahidin di jalanNya seratus derajat, antara satu derajat dengan yang lainnya seperti antara langit dan bumi, seandainya semua makhluk berkumpul dalam satu derajat surga niscaya satu derajat surga itu mencukupi mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 21: Dia akan menghindarkan dari mereka semua keburukan dan akan menyampaikan kepada mereka semua kebaikan. Yang merupakan nikmat surga yang paling besar dan paling agung, Dia akan ridha kepada mereka dan tidak akan pernah murka selama-lamanya. Mereka memperoleh apa yang disenangi oleh jiwa mereka dan hal yang menyejukkan pandangan mereka, di mana tidak ada yang mengetahui sifat dan ukurannya selain Allah Subhaanahu wa Ta'aala. Di antaranya juga adalah Allah telah menyiapkan untuk orang-orang yang berjihad di jalan-Nya 100 derajat, di mana antara masing-masing derajat jaraknya sebagaimana antara langit dan bumi,"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 21",
    "description": "Inilah kemenangan dan keberuntungan hakiki yang mereka peroleh, yakni tuhan akan senantiasa menggembirakan mereka dengan memberikan rahmat yang sangat luas, dan mengistimewakan mereka dengan keridaan-Nya. Inilah balasan yang sesungguhnya. Dan, bukan hanya itu, di akhirat kelak mereka akan dimasukkan ke dalam surga. Mereka memperoleh kesenangan yang kekal di dalamnya. Lebih ditegaskan lagi bahwa mereka kekal di dalamnya selama-lamanya dan tidak akan dikeluarkan dari padanya. Sungguh, di sisi Allah terdapat pahala yang besar."
  }
]