[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka tinggal di dalam surga-surga itu dengan kekal , tanpa ada waktu penghujung lamanya mereka tinggal dan menikmati kenikmatan. Itu adalah balasan dari apa yang telah mereka perbuat dari berbagai macam ketaatan dan amal shalih di kehidupan dunia mereka. Sesungguhnya Allah di sisiNya terdapat pahala besar bagi orang-orang yang beriman dan beramal shalih dengan menjalankan perintah-perintahNya dan menjauhi larangan-laranganNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "22. Mereka tinggal di dalam surga itu tanpa batas akhir sebagai balasan atas amal saleh yang telah mereka kerjakan di dunia. Sesungguhnya di sisi Allah terdapat pahala yang sangat besar bagi orang-orang yang menjalankan perintah-perintah-Nya dan menjauhi larangan-larangan-Nya dengan ikhlas semata-mata karena (menjalankan) agama."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "22 mereka kekal di dalamnya selama-lamanya tanpa ada jeda maupun jangka waktu. Sesungguhnya di sisi Allah-lah pahala yang besar untuk orang-orang yang senantiasa taat kepada-Nya, tanpa-Nya semua adalah hina"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka kekal di dalamnya selama-lamanya. Sesungguhnya di sisi Allah pahala yang agung"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "22. “Mereka kekal di dalamnya selama-lamanya.” Mereka tidak berpindah darinya dan tidak mau meninggalkannya “Sesungguhnya di sisi Allah-lah pahala yang besar.” Banyaknya karunia Allah, kebesaran dan kebaikanNya tidaklah mengherankan atas Dzat yang cukup berkata kepada sesuatu, dengan Kun fayakun (jadilah, maka jadilah ia)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 22: Dan tidak ingin pindah daripadanya. Oleh karena itu, janganlah kamu heran terhadap balasan yang demikian besar itu, karena sesungguhnya di sisi Allah ada pahala yang besar."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 22",
    "description": "Lebih ditegaskan lagi bahwa mereka kekal di dalamnya selama-lamanya dan tidak akan dikeluarkan dari padanya. Sungguh, di sisi Allah terdapat pahala yang besar. Setelah ayat sebelumnya menerangkan keutamaan berjihad dan berhijrah serta tidak bergunanya amal kebaikan orang-orang musyrik, maka ayat ini lebih menegaskan lagi bahwa itu semua tidak akan sempurna kecuali kaum muslim berlepas diri dari kekuasaan kaum musyrik dan lebih mencintai Allah dan rasul-Nya daripada bapak, ibu, dan saudara-saudaranya. Wahai orang-orang yang beriman! janganlah kamu jadikan bapak-bapakmu dan saudara-saudaramu sebagai auliya' bentuk jamak dari kata waliy, yakni pemimpin, teman dekat, pelindung, atau sebagai apa saja yang kamu sering kali menyampaikan rahasia kepadanya dan kamu sekalian lebih mencintai mereka mengalahkan cintamu kepada Allah dan rasul-Nya, baik dengan cara memaksakan diri apalagi secara sukarela' jika mereka lebih menyukai kekafiran daripada keimanan. Barangsiapa di antara kamu yang menjadikan mereka wali, pelindung, teman dekat, pemimpin dan lain-lain, meski masih ada hubungan kekerabatan, maka mereka itulah orang-orang yang zalim karena meletakkan sesuatu bukan pada tempatnya, yakni dengan menjadikan wali kepada orang yang tidak tepat."
  }
]