[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang yang beriman kepada Allah dan RasulNya serta melaksanakan syariatNya, janganlah kalian menjadikan kaum kerabat kalian (seperti ayah, saudara dan yang lainnya) sebagai pemimpin-pemimpin yang kalian membocorkan kepada mereka rahasia-rahasia kaum muslimin dan bertukar pikiran dengan mereka dalam urusan-urusan kalian, selama mereka masih bertahan di atas kekafiran dan memusuhi islam. Dan barangsiapa yang menjadikan mereka sebagai pemimpin dan memberikan kasih sayang kepada mereka, sungguh dia telah bermaksiat kepada Allah dan menzhalimi diri sendiri dengan kezhaliman yang besar."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "23. Wahai orang-orang yang percaya kepada Allah dan mengikuti apa yang dibawa oleh rasul-Nya, janganlah kalian menjadikan bapak-bapak dan saudara-saudara kalian baik saudara kandung maupun lainnya sebagai sekutu-sekutu yang bahu-membahu dengan kalian dalam menyebarluaskan rahasia-rahasia orang mukmin dan bertukar pikiran dengan mereka, jika mereka lebih mengutamakan kekafiran daripada keimanan kepada Allah semata. Barangsiapa yang menjadikan mereka sebagai sekutu-sekutu sedangkan mereka tetap mempertahankan kekafiran mereka sembari menampakkan kasih sayang kepada mereka, maka ia telah durhaka kepada Allah dan menganiaya dirinya sendiri dengan menjerumuskannya ke jurang kebinasaan disebabkan perbuatan maksiat itu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "23. Karena saling tolong menolong atas dasar keturunan dan persaudaraan lebih kuat daripada tolong menolong atas dasar lain, maka Allah cukup menyebutkan dua hal tersebut dalam ayat ini. Allah melarang orang-orang beriman untuk menjadikan bapak dan saudara sebagai penolong apabila mereka lebih memilih jalan kesesatan dan kesyirikan. Dan barangsiapa yang menjadikan mereka penolong sedangkan mereka memiliki sifat tersebut maka dia adalah orang yang menzalimi diri sendiri dan golongannya, karena telah menjadikan tolong menolong bagi kaum yang seharusnya dia berlepas diri dari mereka, dan mencintai kaum yang seharusnya dia membenci mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "23. لَا تَتَّخِذُوٓا۟ ءَابَآءَكُمْ وَإِخْوٰنَكُمْ أَوْلِيَآءَ إِنِ اسْتَحَبُّوا۟ الْكُفْرَ عَلَى الْإِيمٰنِ ۚ (janganlah kamu jadikan bapa-bapa dan saudara-saudaramu menjadi wali(mu), jika mereka lebih mengutamakan kekafiran atas keimanan) Hukum ini terus berlaku hingga hari kiamat, ini menunjukkan pemutusan secara mutlak hubungan kesetiaan dan tolong menolong antara orang-orang beriman dengan orang-orang kafir. Ayat ini diturunkan sebagai dorongan untuk berhijrah dan tidak tinggal di negeri kafir serta larangan bagi orang-orang beriman untuk menjadikan para bapak dan saudara menjadi teman setia sehingga menjadi pengikut mereka apa bila mereka tetap dalam kekafiran dan menolak untuk masuk Islam. Kemudian Allah menetapkan bagi orang-orang yang menjadikan para bapak dan saudara yang lebih memilih kekafiran sebagai teman setia bahwa mereka adalah orang-orang yang zalim. Hal ini menunjukkan bahwa menjadikan orang yang demikian sebagai teman setia termasuk merupakan dosa yang paling besar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "23 Hai orang-orang beriman, janganlah kamu jadikan bapak-bapak dan saudara-saudaramu menjadi walimu atas rahasia kalian, jika mereka lebih mengutamakan kekafiran atas keimanan kepada Allah dan rasul-Nya dan siapa di antara kamu yang menjadikan mereka wali, dan lebih rela dari pada menjadikan orang mukmin sebagai wali maka mereka itulah orang-orang yang zalim atas diri mereka sendiri, dan ridho kepada pelaku kesyirikan. Ayat ini turun untuk orang yang mempengaruhi istri, keluarga dan anaknya dan duduk bersama mereka, dan tidak hijrah dari Makkah menuju Madinah, sebab menurut mereka itu melelahkan bagi mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, janganlah jadikan bapak-bapak kalian dan saudara-saudara kalian sebagai pelindung} teman akrab dan sahabat yang mana kalian bisa mengungkapkan kepada mereka rahasia-rahasia kalian {jika mereka lebih mencintai} memilih {kekufuran atas keimanan. Maka siapa pun di antara kalian yang menjadikan mereka pelindung, maka mereka itulah orang-orang yang zalim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "23. Allah berfirman, “Hai orang-orang yang beriman,” lakukanlah tuntutan iman dengan berwala’ kepada yang menunaikannya dan bermu’adah kepada yang tidak menunaikannya. Dan “janganlah kamu jadikan bapak-bapak dan saudara-saudaramu,” yang merupakan orang terdekat, lebih-lebih selainnya, janganlah kamu menjadikan mereka “pemimpin-pemimpinmu, jika mereka lebih mengutamakan.” Yakni memilih dengan sukarela “kekafiran atas keimanan, dan siapa di antara kamu yang menjadikan mereka pemimpin-pemimpinmu, maka mereka itulah orang-orang yang zhalim.” Karena mereka berani bermaksiat kepada Allah dan menjadikan musuh-musuh Allah sebagai pemimpin-pemimpin. Pada asalnya, arti al-Wilayah adalah kecintaan dan pertolongan, dan disini dinyatakan demikian karena menjadikan mereka pemimpin-pemimpin melazimkan sifat mendahulukan ketaatan dan kecintaan kepada mereka di atas ketaatan dan kecintaan kepada Allah dan RasulNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 23: Ada yang berpendapat, bahwa ayat ini turun berkenaan orang-orang tidak berhijrah karena mengutamakan keluarga dan harta perdagangan. Yakni kerjakanlah konsekwensi dari keimanan, yaitu dengan memberikan wala’ kepada orang yang mengerjakan keimanan itu dan memberikan baraa’ (sikap lepas diri) terhadap mereka yang tidak mengerjakannya. Meskipun mereka orang yang dekat denganmu. Karena mereka berani bermaksiat kepada Allah dan menjadikan musuh-musuh-Nya sebagai wali atau orang yang dicintai dan dibela, padahal yang demikian akan membuatnya menaati mereka meninggalkan ketaatan kepada Allah dan membuatnya lebih mencintai mereka daripada cinta kepada Allah dan Rasul-Nya. Pada ayat selanjutnya dipertegas lagi, bahwa cinta kepada Allah dan Rasul-Nya harus didahulukan di atas cinta kepada segala sesuatu serta menjadikan semuanya mengikuti cinta kepada Allah dan Rasul-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 23",
    "description": "Setelah ayat sebelumnya menerangkan keutamaan berjihad dan berhijrah serta tidak bergunanya amal kebaikan orang-orang musyrik, maka ayat ini lebih menegaskan lagi bahwa itu semua tidak akan sempurna kecuali kaum muslim berlepas diri dari kekuasaan kaum musyrik dan lebih mencintai Allah dan rasul-Nya daripada bapak, ibu, dan saudara-saudaranya. Wahai orang-orang yang beriman! janganlah kamu jadikan bapak-bapakmu dan saudara-saudaramu sebagai auliya' bentuk jamak dari kata waliy, yakni pemimpin, teman dekat, pelindung, atau sebagai apa saja yang kamu sering kali menyampaikan rahasia kepadanya dan kamu sekalian lebih mencintai mereka mengalahkan cintamu kepada Allah dan rasul-Nya, baik dengan cara memaksakan diri apalagi secara sukarela' jika mereka lebih menyukai kekafiran daripada keimanan. Barangsiapa di antara kamu yang menjadikan mereka wali, pelindung, teman dekat, pemimpin dan lain-lain, meski masih ada hubungan kekerabatan, maka mereka itulah orang-orang yang zalim karena meletakkan sesuatu bukan pada tempatnya, yakni dengan menjadikan wali kepada orang yang tidak tepat. Ayat ini turun berkenaan dengan keengganan sebagian kaum muslim untuk berhijrah ke madinah karena diberatkan oleh hal-hal yang bersifat duniawi. Padahal, hijrah merupakan wujud nyata kecintaan kaum mukmin kepada Allah dan rasul-Nya. Katakanlah, wahai rasul, jika bapak-bapakmu, anak-anakmu, saudara-saudaramu, istri-istrimu yang selalu mendampingimu, keluargamu yang selalu melindungimu, harta kekayaan yang kamu usahakan dengan susah payah, perdagangan yang kamu khawatirkan kerugiannya, dan rumah-rumah tempat tinggal yang ka-Mu sukai yang dibangun dengan biaya yang cukup besar, lebih kamu cintai daripada Allah dan rasul-Nya serta berjihad di jalan-Nya, maka tunggu-lah sampai Allah memberikan keputusan-Nya, dengan menurunkan hukuman-Nya yang tidak mungkin kamu elakkan. Padahal, hal itu merupakan sikap orang-orang fasik, karena keluar dari ketaatan kepada Allah dan rasul-Nya. Dan Allah tidak memberi petunjuk kepada orang-orang fasik."
  }
]