[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai Rasul) kepada kaum mukminin. “Sesungguhnya bila kalian lebih mengutamakan ayah-ayah, anak-anak, saudara-saudara, istri-istri, kaum kerabat dan harta benda dengan yang kalian kumpulkan dan perdagangan yang kalian khawatirkan tidak laku dan rumah-rumah nyaman yang kalian tinggali, bila kalian lebih mengutamakan semua itu daripada cinta kepada Allah dan cinta kepada RasulNya dan berjihad di jalanNya, maka tunggulah oleh kalian siksaan Allah balasanNya yang akan menimpa kalian.” Dan Allah tidak memberikan taufik kepada orang-orang yang keluar dari ketaatan kepadaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. Katakanlah -wahai Rasul-, “Jika bapak-bapak kalian -wahai orang-orang mukmin-, anak-anak kalian, saudara-saudara kalian, istri-istri kalian, karib kerabat kalian, harta benda yang kalian dapatkan, perniagaan yang kalian harapkan keuntungannya dan kalian takutkan kerugiannya, serta rumah-rumah yang menjadi tempat tinggal kesukaan kalian, jika semua itu lebih kalian cintai daripada Allah dan rasul-Nya, dan lebih kalian utamakan daripada berjihad di jalan Allah, maka tunggulah hukuman yang akan Allah turunkan kepada kalian. Dan Allah tidak akan membimbing orang-orang yang tidak taat kepada-Nya untuk mengerjakan sesuatu yang diridai oleh-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "24. Setelah Allah menjelaskan kelemahan iman mereka, maka kemudian Allah menjelaskan sebab dari hal itu dengan memerintahkan Rasulullah untuk berkata kepada mereka: “Jika kalian lebih memilih kenikmatan dan syahwat dunia yang berupa bapak, anak, saudara, istri, keluarga, harta, dan perniagaan, daripada memilih mencintai Allah dan rasul-Nya, dan jihad di jalan-Nya yang Allah telah menjanjikan di dalamnya berbagai kebahagiaan abadi di akhirat bagi kalian; maka tunggulah hingga datang siksaan dari Allah yang akan menimpa kalian di dunia maupun di akhirat. Allah tidak memberi petunjuk bagi orang-orang yang melanggar batas-batas agama.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "24. وَعَشِيرَتُكُمْ (kaum keluargamu) Yakni kerabat terdekat. وَأَمْوٰلٌ اقْتَرَفْتُمُوهَا(harta kekayaan yang kamu usahakan) Makna (الاقتراف) yakni pekerjaan. Makna (التجارة) yakni barang-barang yang mereka beli untuk dijual kembali dengan tujuan mendapatkan keuntungan. Makna (الكساد) yakni barang yang tidak terjual kerena telah lewat waktu penjualannya dikarenakan hijrah atau pergi meninggalkan negerinya. وَمَسٰكِنُ تَرْضَوْنَهَآ (dan tempat tinggal yang kamu sukai) Yakni tempat tinggal yang mereka sukai dan menakjubkan diri mereka, yang mereka sibukkan diri untuk melengkapi perabotannya sampai melegakan hati mereka. Makna ayat ini adalah jika hal-hal ini lebih kalian cintai daripada Allah dan Rasul-Nya dan daripada berjihad di jalan Allah sehingga hal-hal ini menyibukkan kalian dari kewajiban yang Allah tetapkan atas kalian dan dari perintah-perintah-Nya, serta hijrah dan jihad di jalan-Nya. فَتَرَبَّصُوا۟ (maka tunggulah) Maka tunggulah. حَتَّىٰ يَأْتِىَ اللهُ بِأَمْرِهِۦ ۗ( sampai Allah mendatangkan keputusan-Nya) Yakni sampai Allah mendatangkan keputusan-Nya untuk kalian serta siksaan untuk kalian sesuai dengan kehendak-Nya. Dalam ayat ini terdapat peringatan keras bagi orang-orang yang tidak mengikuti jihad dengan alasan yang dibuat-buat. Abu Dawud mengeluarkan hadist dari Ibnu Umar dari Rasulullah, Beliau bersabda: “Apabila kalian telah melakukan jual beli dengan system ‘iinah, menjadikan diri kalian berada di belakang ekor sapi, ridha dengan cocok tanam, dan meninggalkan jihad, maka Allah anak menjadikan kalian diliputi kehinaan yang tidak akan terangkat dari kalian sebelum kalian kembali kepada ajaran agama kalian”."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Ayat ini adalah salah satu ayat yang paking keras, menyerukan kepada manusia yang hampir tidak satupun dari mereka yang lepas darinya kecuali yang Allah membebaskan mereka dengan kelembutan-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "24 Wahai Nabi katakanlah kepada orang yang tidak hijrah dan memilih tinggal bersama keluarga mereka : “Jika bapak-bapak kalian, anak-anak kalian, saudara-saudara, isteri-isteri, dan kaum keluarga kalian, harta kekayaan yang kamu usahakan, perniagaan yang kamu khawatiri kerugiannya, dan tempat tinggal yang kamu sukai, lebih kamu cintai dari hijrah untuk meninggikan agama Allah dan taat kepada Allah dan Rasul-Nya dan berjihad di jalan-Nya untuk meninggikan kalimat-Nya, maka tunggulah sampai Allah mendatangkan keputusan-Nya”. Dan Allah tidak memberi petunjuk kepada orang-orang yang fasik. Ayat ini turun bersama ayat sebelumnya untuk mereka yang tidak mau hijrah menuju Madinah sebab lebih memilih keluarga dan perniagaannya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Jika bapak, anak-anak, saudara-saudara, pasangan-pasangan, dan keluarga kalian} kerabat kalian {harta kekayaan yang kalian usahakan} yang kalian usahakan {dan perniagaan yang kalian khawatirkan kerugiannya} kerugiannya {serta tempat tinggal yang kalian sukai} yang kalian sukai untuk tinggal di dalamnya {lebih kalian cintai daripada Allah dan RasulNya serta berjihad di jalanNya maka tunggulah} tunggulah {sampai Allah mendatangkan perintahNya.”} hukumanNya {Allah tidak memberi petunjuk kepada kaum yang fasik} orang-orang yang tidak taat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "24. Oleh karena itu Allah menyebutkan sebab yang melazimkan hal itu, yaitu bahwa kecintaan kepada Allah dan RasulNya wajib didahulukan di atas kecintaan kepada apa pun, dan menjadikan segala sesuatu menginduk kepadanya, Dia berfirman, “katakanlah, ‘Jika bapak-bapak’,” sama juga ibu-ibu, “saudara-saudara”, dalam nasab keluarga, “istri-istri, kaum keluargamu.” Yaitu kerabatmu secara umum. “dan harta kekayaan yang kamu usahakan”, dan kamu mendapatkannya dengan susah payah, ia disebutkan secara khusus karena ia paling dicintai oleh pemiliknya, dan tentu saja pemiliknya lebih semangat dalam menjaganya daripada orang yang mendapatkan harta tanpa usaha dan lelah “dan perniagaan yang kamu khawatiri kerugiannya.” Yakni khawatir menipis dan berkurang. Ini meliputi seluruh bentuk perniagaan dan usaha dalam berbagai bentuk perniagaan seperti emas, bejana, senjata, perabot, biji-bijian, hasil bumi, ternak, dan lain-lain. “Dan rumah-rumah tempat tinggal yang kamu sukai”, karena keindahannya, hiasannya, dan kesesuaiannya dengan hawa nafsumu, jika semua itu “adalah lebih kamu cintai daripada Allah dan RasulNya dan (dari) berjihad di jalanNya”, maka kamu adalah orang-orang fasik yang zhalim. “maka tunggulah”, azab yang akan menimpamu “sampai Allah mendatangkan keputusanNya”, yang tiada tertolak. “Dan Allah tidak memberi petunjuk kepada orang-orang fasik”, yaitu yang keluar dari ketaatan kepada Allah, yang mendahulukan salah satu perkara di atas, daripada kecintaan kepada Allah. Ayat yang mulia ini adalah dalil terbesar akan kewajiban mencintai Allah dan RasulNya, dan mendahulukannya di atas kecintaan kepada segala sesuatu selain keduaNya, serta ancaman keras dan kemarahan besar atas siapa saja yang salah satu dari yang disebutkan ini lebih dia cintai daripada Allah, RasulNya, dan jihad di jalanNya. Dan tandanya adalah bahwa jika dia dihadapkan pada dua perkara, yang pertama dicintai oleh Allah dan RasulNya dan dia tidak memiliki hasrat padanya, dan kedua dicintai dan diinginkan oleh nafsunya, akan tetapi ia mengakibatkan lenyapnya apa yang dicintai oleh Allah dan RasulNya atau menguranginya, maka jika dia mendahulukan apa yang diinginkan oleh nafsunya daripada apa yang dicintai Allah, berarti itu menunjukkan bahwa dia zhalim dan telah meninggalkan apa yang wajib atasnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 24: Sehingga kamu tidak berhijrah dan berjihad karena sebab itu. Yakni tunggulah hukuman yang akan menimpamu. Yang tidak dapat ditolak lagi. Yaitu mereka yang keluar dari ketaatan kepada Allah lagi mengutamakan semua yang disebutkan daripada kecintaan kepada Allah, Rasul-Nya dan berjihad di jalan-Nya. Contoh mengutamakan selain Allah dan Rasul-Nya adalah ketika dihadapkan kepadanya dua perkara; perkara yang pertama dicintai Alah dan Rasul-Nya sedangkan hawa nafsunya tidak ingin kepadanya, adapun yang kedua diiinginkan oleh hawa nafsunya, maka jika ia mengutamakan yang kedua, maka berarti ia mengutamakan selain Allah dan Rasul-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 24",
    "description": "Ayat ini turun berkenaan dengan keengganan sebagian kaum muslim untuk berhijrah ke madinah karena diberatkan oleh hal-hal yang bersifat duniawi. Padahal, hijrah merupakan wujud nyata kecintaan kaum mukmin kepada Allah dan rasul-Nya. Katakanlah, wahai rasul, jika bapak-bapakmu, anak-anakmu, saudara-saudaramu, istri-istrimu yang selalu mendampingimu, keluargamu yang selalu melindungimu, harta kekayaan yang kamu usahakan dengan susah payah, perdagangan yang kamu khawatirkan kerugiannya, dan rumah-rumah tempat tinggal yang ka-Mu sukai yang dibangun dengan biaya yang cukup besar, lebih kamu cintai daripada Allah dan rasul-Nya serta berjihad di jalan-Nya, maka tunggu-lah sampai Allah memberikan keputusan-Nya, dengan menurunkan hukuman-Nya yang tidak mungkin kamu elakkan. Padahal, hal itu merupakan sikap orang-orang fasik, karena keluar dari ketaatan kepada Allah dan rasul-Nya. Dan Allah tidak memberi petunjuk kepada orang-orang fasik. Ayat yang lalu menegaskan tentang larangan menjadikan orangorang kafir sebagai waliy yang biasanya disebabkan oleh kecintaan berlebihan kepada hal-hal duniawi sehingga iman menjadi tidak kukuh, maka ayat ini menunjukkan bukti nyata betapa kekuatan duniawi tidak lantas menjadikan umat mukmin memperoleh kemenangan. Sungguh, Allah telah menolong kamu, wahai kaum mukminin, di banyak medan perang ketika kamu lemah dan musuhmu kuat, dan ingatlah perang hunain, ketika itu jumlahmu yang besar telah membanggakan kamu, sebab kamu merasa tidak akan bisa dikalahan, sehingga kamu terlena, namun ternyata jumlah yang banyak itu sama sekali tidak berguna bagimu, sebab kenyataannya kamu dapat dikalahkan; dan akibat serangan musuh yang mendadak dan bertubi-tubi itu menjadikan bumi yang luas itu terasa sempit bagimu, kemudian serangan itu juga menjadikan kamu berbalik ke belakang dan lari tunggang-langgang meninggalkan rasulullah dan sahabat-sahabat yang masih setia mendampingi beliau."
  }
]