[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sengguhnya Allah telah menurunkan pertolonganNya kepada kalian dalam peperangan yang banyak, tatkala kalian menempuh usaha-usaha dan bertawakal kepada Allah. Dan pada hari perang Hunain kalian berkata, “hari ini kita tidak akan kalah karena jumlah pasukan yang sedikit.” Maka memperdayai kalian Jumlah pasukan yang banyak dan tidak mendatangkan manfaat bagi kalian, dan musuh-musuh berhasil memukul kalian, sehingga kalian tidak menemukan tempat berlindung di muka bumi yang luas ini. Kalian berlari-lari terpukul mundur."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "25. Sungguh Allah telah menolong kalian -wahai orang-orang mukmin- untuk mengalahkan orang-orang musyrik yang menjadi musuh kalian di banyak pertempuran, meskipun jumlah pasukan kalian sedikit dan peralatan perang kalian tidak kuat, tatkala kalian berserah diri kepada Allah, melakukan upaya-upaya yang diperlukan, dan tidak membanggakan banyaknya jumlah pasukan kalian, karena banyaknya jumlah pasukan bukanlah penentu kemenangan kalian atas musuh-musuh kalian. Sedangkan pada perang Ḥunain ketika kalian merasa bangga dengan banyaknya jumlah pasukan kalian hingga kalian berkata, “Hari ini kita tidak akan dikalahkan karena sedikitnya jumlah pasukan,” ternyata banyaknya jumlah pasukan yang kalian banggakan itu sama sekali tidak menguntungkan kalian, sehingga kalian dikalahkan oleh musuh kalian dan bumi yang luas ini terasa sempit bagi kalian, kemudian kalian melarikan diri dari musuh-musuh kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "25. Karena sebagian orang beriman tertipu dengan jumlah sehingga menjadikannya lalai dari tanda-tanda kekuasaan Allah, maka Dia menyebutkan kisah yang menjadi dalil kekuasaan-Nya, sehingga Dia dapat memberi kenikmatan kepada orang-orang beriman: “Hai orang-orang beriman, Sungguh Allah telah menolong kalian di banyak tempat peperangan yang kalian tinggali untuk bertempur melawan musuh, dan menolong kalian di banyak pertempuran antara kalian dengan musuh demi memenangkan agama-Nya; Allah juga telah menolong kalian pada parang Hunain, yaitu ketika kalian tertipu dengan jumlah kalian 12.000 pasukan, sedangkan jumlah orang-orang kafir hanya 4.000 pasukan saja. Sehingga seseorang dari kalian berkata, ‘Kita tidak akan terkalahkan akibat kekurangan pasukan’. Akan tetapi jumlah kalian itu tidak dapat memberi kalian manfaat, sehingga kalian dapat dikalahkan musuh pada awal peperangan, dan bumi yang luas ini terasa sempit bagi kalian, sehingga kalian tidak dapat menemukan tempat berlindung, dan sebagian dari kalian melarikan diri.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "25. لَقَدْ نَصَرَكُمُ اللهُ فِى مَوَاطِنَ كَثِيرَةٍ ۙ وَيَوْمَ حُنَيْنٍ ۙ (Sesungguhnya Allah telah menolong kamu (hai para mukminin) di medan peperangan yang banyak, dan (ingatlah) peperangan Hunain) Yakni dan Allah telah menolong kalian di perang Hunain. إِذْ أَعْجَبَتْكُمْ كَثْرَتُكُمْ(yaitu diwaktu kamu menjadi congkak karena banyaknya jumlah(mu)) Adapun sebelum perang Hunain, jumlah kaum muslimin cukup sedikit, sehingga jumlah mereka tidak menjadikan mereka angkuh. Hunain adalah nama sebuah lembah yang berada diantara kota Makkah dan Thaif. Di sana Rasulullah bersama kaum muslimin bertemu dengan pasukan orang-orang kafir dari Hawazin dan Thaif. Jumlah kaum muslimin ketika itu adalah 12.000 pasukan, sebagian dari mereka berkata: “kita tidak akan terkalahkan karena jumlah yang sedikit”. Namun mereka kemudian mengalami kekalahan, katika itu Rasulullah tetap teguh dalam peperangan bersama sedikit pasukan kaum muslimin, diantaranya Abu Bakar, Umar bin Khattab, paman beliau Abbas, dan Abu Sufyan bin Harist. Setelah itu pasukan muslimin kembali masuk ke medan perang sehingga mereka dapat meraih kemenangan dan kejayaan. وَضَاقَتْ عَلَيْكُمُ الْأَرْضُ بِمَا رَحُبَتْ (dan bumi yang luas itu telah terasa sempit olehmu) Maksudnya bahwa meskipun bumi merupakan tempat yang luas namun menjadi sempit bagi mereka karena ketakutan dan kekhawatiran. ثُمَّ وَلَّيْتُم مُّدْبِرِينَ(kemudian kamu lari kebelakang dengan bercerai-berai) Yakni kalian kalah dan melarikan diri kebelakang menjauhi musuh."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "25 Sesungguhnya Allah telah menolong kalian hai para mukmin di banyak medan peperangan meskipun kalian dalam keadaan lemah sedangkan musuh kalian lebih kuat.,Ingatlah peperangan Hunain, yaitu lembah di antara Thaif dan Makkah, diwaktu kamu menjadi congkak karena banyaknya jumlahmu, kalian berjumlah 12 ribu sedangkan musuh kalian hanya empat ribu. Kalian berkata: Kita tidak akan kalah karena sedikit. Maka jumlah yang banyak itu tidak memberi manfaat kepadamu sedikitpun, dan bumi yang luas itu telah terasa sempit olehmu, kemudian kamu meninggalkan rasul dan lari kebelakang dengan bercerai-berai. Seseorang berkata pada hari Hunain: Kami tidak akan kalah karena sedikit, mereka berjumlah 12 ribu, itu berat menurut Nabi. Maka Allah menurunkan ayat ini."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sungguh Allah telah menolong kalian di medan peperangan} medan perang {yang banyak dan pada hari perang Hunain ketika banyaknya jumlah kalian membuat kalian takjub. Lalu jumlah itu tidak memberi manfaat kepada kalian} jumlah banyak itu tidak memberi manfaat untuk kalian {sedikit pun dan bumi yang luas itu} yang luas {terasa sempit bagi kalian kemudian kalian lari berbalik ke belakang (25} kalian lari dalam keadaan kalah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Allah memberikan nikmat kepada hamba-hambaNya yang beriman dengan memberikan kemenangan di banyak peperangan, hingga pada perang Hunain di mana kaum Muslimin menghadapi tekanan kuat sehingga mereka berlari dan mundur yang membuat bumi yang luas itu seolah-olah menjadi sempit, hal itu ketika Nabi menaklukkan Makkah, Nabi mendengar bahwa Hawazin bersekutu untuk memerangi beliau, maka Nabi mendatangi mereka dengan sahabat-sahabat yang ikut berpartisipasi pada Fathu Makkah ditambah orang-orang Makkah yang dimaafkan oleh beliau dan masuk Islam, mereka semua berjumlah dua belas ribu orang, sedangkan orang-orang musyrik hanyalah empat ribu orang, sebagian kaum Muslimin terperdaya oleh jumlah mereka yang besar, sebagian dari mereka berkata, “Hari ini kita tidak akan mungkin dikalahkan oleh yang sedikit.” Manakala mereka bertemu dengan pasukan Hawazin, mereka menyerang kaum Muslimin secara serempak, sehingga kaum Muslimin terpukul mundur tanpa mempedulikan yang lain, yang tersisa bersama Rasulullah hanyalah sekitar seratus orang yang teguh bersamanya. Mereka ini berperang melawan orang-orang musyrik. Manakala Nabi melihat kondisi kaum Muslimin, beliau meminta Abbas bin Abdul Muthalib untuk menyeru orang-orang Anshar dan kaum Muslimin yang lain, “Wahai Ashhabus Samurah, wahai ahli surat Al-Baqarah.” Manakala kaum Muslimin mendengar suaranya, mereka kembali dengan serempak dan berperang melawan kaum musyrikin, maka Allah mengalahkan kaum musyrikin dengan kekalahan yang sangat telak dan kaum Muslimin pun menguasai negeri, wanita-wanita dan harta mereka. 25. Yaitu Firman Allah, “Sesungguhnya Allah telah menolong kamu (hai orang-orang Mukmin) di medan peperangan yang banyak, dan (ingatlah) peperangan Hunain.” Ia adalah nama tempat yang terletak di antara Makkah dan THaif, yang terjadi padanya perang tersebut. “Yaitu di waktu kamu menjadi congkak karena banyaknya jumlahmu, maka jumnlah yang banyak itu tidak memberi manfaat kepadamu sedikit pun.” Yakni jumlahmu yang banyak maupun sedikit, sama sekali tidak bisa membantumu. “Dan bumi yang luas itu telah terasa sempit olehmu”, karena kesedihan dan duka yang disebabkan oleh kekalahan kalian itu, padahal “bumi yang luas”, maksudnya, padahal tanah (tempat kalian berpijak) begitu lapang dan luas. “Kemudian kamu lari ke belakang dengan bercerai berai”, maksudnya, lari terdesak kalah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 25: Seperti pada perang Badar, Bani Quraizhah dan Bani Nadhir. Hunain adalah nama sebuah lembah yang berada di antara Mekah dan Tha’if. Ketika Nabi shallallahu 'alaihi wa sallam menaklukkan Mekah, Beliau mendengar bahwa kabilah Hawazin sedang berkumpul untuk memerangi Beliau, maka Beliau berangkat bersama para sahabat yang ikut menaklukkan Mekah serta bersama beberapa orang yang baru masuk Islam, sehingga jumlah mereka 12.000 orang (10.000 dari kaum muslimin yang berangkat dari Madinah untuk Fat-hu Makkah dan 2000 orang penduduk Makkah yang masih baru masuk Islam), sedangkan musuh berjumlah 4.000 orang. Lalu sebagian kaum muslimin merasa bangga dengan jumlah mereka sampai-sampai mereka berkata, “Pada hari ini kita tidak akan dikalahkan karena jumlah yang sedikit”. Pada hari Sabtu 6 Syawwal tahun 8 Hijriah, Beliau bersama pasukannya berangkat menuju ke tempat musuh. Orang-orang Hawazin dan Tsaqif telah memilih tempat yang strategis, yaitu tanah pegunungan yang berbukit-bukit dan berliku-liku. Mereka bersembunyi di balik bukit-bukit menunggu tentara kaum muslimin lewat di jalan sempit bawahnya. Ketika kaum muslimin tiba di tempat tersebut yang bernama lembah Hunain, datanglah serbuan yang mendadak dari musuh. Tentara kaum muslimin menjadi panik dan lari bercerai berai. Adapun Nabi shallallahu 'alaihi wa sallam tetap berada di atas bagalnya yang putih, dan tidak ada yang bersamanya selain urang lebih 100 orang yang tetap di tempatnya melawan kaum musyrik. Sedangkan Nabi shallallahu 'alaihi wa sallam sendiri mengarahkan bagalnya kepada kaum musyrik sambil berkata, “Saya Nabi tidak berdusta! Saya putera Abdul Muththalib.” Namun Abu Sufyan dan Abbas menahan bagal Beliau agar tidak segera maju. Kemudian Beliau berusaha menghimpun kembali pasukan kaum muslimin yang kacau balau itu. Beliau memerintahkan Abbas bin Abdul Muththalib seorang yang keras suaranya untuk menyeru kaum muslim. Beliau bersabda, “Wahai Abbas! Panggil orang-orang yang berbai’at di bawah pohon (Bai’atur ridhwan),” Lalu Abbas berkata dengan suara keras, “Di mana orang-orang yang berbai’at di bawah pohon (Bai’atur ridhwan)?”, maka ketika kaum muslimin mendengar suaranya, mereka pun berbalik seperti berbaliknya sapi mendatangi anak-anaknya, serangan pembalasan kemudian dilancarkan sampai musuh dapat dikalahkan. Sisa pasukan musuh yang kalah, melarikan diri ke Tha’if. Dalam benteng Tha’if inilah musuh mempertahankan diri. Beberapa waktu lamanya musuh mempertahankan diri, namun tidak berhasil juga ditundukkan. Akhirnya Nabi Muhammad shallallahu 'alaihi wa sallam pulang ke Ja’ranah, tempat tawanan dan rampasan-rampasan, meninggalkan benteng itu, tetapi sudah memblokir daerah sekitarnya. Di Ja’ranah Nabi Muhammad shallallahu 'alaihi wa sallam didatangi oleh delegasi (utusan) Hawazin. Mereka menyatakan tobat kepada Allah dan masuk Islam. Hawazin meminta kepada Nabi Muhammad shallallahu 'alaihi wa sallam agar harta benda dan kaum keluarga mereka yang ditawan dibebaskan dan dikembalikan kepada mereka. Rasulullah shallallahu 'alaihi wa sallam dan kaum muslimin tidak keberatan memenuhi permintaan mereka; semua tawanan dan rampasan dari mereka pun dikembalikan seluruhnya. Sedangkan penduduk Tha’if, karena tidak tahan menderita akibat pemblokiran kaum muslimin akhirnya mereka mengirimkan delegasi kepada Rasulullah shallallahu 'alaihi wa sallam untuk menyampaikan keinginan mereka memeluk Islam. Dengan demikian berakhirlah peperangan dengan kabilah Tsaqif itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 25",
    "description": "Ayat yang lalu menegaskan tentang larangan menjadikan orangorang kafir sebagai waliy yang biasanya disebabkan oleh kecintaan berlebihan kepada hal-hal duniawi sehingga iman menjadi tidak kukuh, maka ayat ini menunjukkan bukti nyata betapa kekuatan duniawi tidak lantas menjadikan umat mukmin memperoleh kemenangan. Sungguh, Allah telah menolong kamu, wahai kaum mukminin, di banyak medan perang ketika kamu lemah dan musuhmu kuat, dan ingatlah perang hunain, ketika itu jumlahmu yang besar telah membanggakan kamu, sebab kamu merasa tidak akan bisa dikalahan, sehingga kamu terlena, namun ternyata jumlah yang banyak itu sama sekali tidak berguna bagimu, sebab kenyataannya kamu dapat dikalahkan; dan akibat serangan musuh yang mendadak dan bertubi-tubi itu menjadikan bumi yang luas itu terasa sempit bagimu, kemudian serangan itu juga menjadikan kamu berbalik ke belakang dan lari tunggang-langgang meninggalkan rasulullah dan sahabat-sahabat yang masih setia mendampingi beliau. Pada perang hunain, mulanya kaum muslim mengalami kekalahan, namun kemudian atas rahmat Allah, dia menurunkan ketenangan berupa keimanan yang tulus dan kukuh, kepada rasul-Nya dan kepada orangorang yang beriman, sehingga mereka mampu mengatasi masalah yang sangat berat saat itu, dan dia menguatkan pasukan kaum mukmin yang tersisa itu dengan menurunkan bala tentara dari para malaikat yang tidak terlihat olehmu; dan sebagai hukuman, dia menimpakan azab kepada orang-orang kafir melalui penawanan, pembunuhan, perampasan perang, dan lain-lain. Itulah balasan bagi orang-orang kafir yang menutupnutupi kebenaran ilahi dan bahkan menentangnya."
  }
]