[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian Allah menurunkan ketentraman kepada RasulNya dan kepada kaum mukminin sehingga mereka bertahan kuat, dan Dia mengirimkan bantuan dengan bala tentara dari malaikat yang belum pernah mereka saksikan, kemudian mereka memenangkan mereka atas musuh-musuh mereka dengan menyiksa orang-orang kafir. Itulah hukuman Allah bagi orang yang menghalangi (orang lain) dari agamaNya lagi mendustakan RasulNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "26. Kemudian setelah kalian melarikan diri dari musuh kalian, Allah menurunkan rasa tenteram ke dalam hati rasul-Nya dan menurunkannya ke dalam hati orang-orang mukmin sehingga mereka bertahan di medan perang. Dan Allah juga menurunkan malaikat yang tidak terlihat oleh kalian. Dan Dia menghukum orang-orang kafir dengan apa yang menimpa mereka; terbunuh, tertawan, kehilangan harta benda, dan keluarga mereka. Balasan yang mereka terima itu merupakan balasan bagi orang-orang kafir yang mendustakan rasul mereka dan berpaling dari ajaran yang dibawanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "26-27. Namun setelah itu Allah menurunkan rasa tenang kepada Rasulullah dan para sahabatnya yang masih teguh bersamanya mengelilingi hewan tunggangannya, dan kepada orang-orang beriman yang lain; sehingga ketakutan dan kebingungan mereka hilang. Allah juga menurunkan para pasukan maaikat yang tidak dapat mereka lihat, namun dapat mereka rasakan dengan kembalinya keteguhan dan kekuatan mereka. Dan Allah mengazab orang-orang kafir dengan terbunuh dan tertawan; itulah balasan bagi orang-orang kafir di dunia selama mereka lebih memilih kekafiran daripada keimanan dan memerangi orang-orang beriman. Setelah balasan ini Allah mengampuni orang-orang kafir yang Dia kehendaki dengan memberi mereka hidayah Islam jika gelapnya kesyirikan belum mengelilingi mereka, dan hati mereka belum tertutup akibat kebebalan di atas kekafiran. Allah Maha Pengampun bagi mereka atas kekafiran dan kemaksiatan yang telah mereka lakukan, dan Maha Pengasih bagi mereka dengan memberi mereka karunia dan pahala."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "26. ثُمَّ أَنزَلَ اللهُ سَكِينَتَهُۥ عَلَىٰ رَسُولِهِۦ وَعَلَى الْمُؤْمِنِينَ (Kemudian Allah menurunkan ketenangan kepada Rasul-Nya dan kepada orang-orang yang beriman) Yakni Allah menurunkan apa yang menenangkan mereka agar ketakutan mereka hilang sehingga mereka mendapatkan keberanian untuk berperang melawan orang-orang musyrik. Yang dimaksud adalah mereka yang tetap teguh dalam perang dan kembali masuk ke medan perang setelah mereka mundur, yakni orang-orang Anshar. وَأَنزَلَ جُنُودًا لَّمْ تَرَوْهَا(dan Allah menurunkan bala tentara yang kamu tiada melihatnya) Yakni para malaikat. وَعَذَّبَ الَّذِينَ كَفَرُوا۟ ۚ( dan Allah menimpakan bencana kepada orang-orang yang kafir) Dengan kerugian korban jiwa, penawanan, harta yang dirampas, dan penyandraan keturunan yang menimpa mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Dalam dikatakan { وَعَلَى الْمُؤْمِنِينَ } \"dan kepada orang-orang yang beriman\" dan tidak dikatakan ( وَعَلَى المُؤْمِنِيْنَ ) \"dan kepada kalian\"; karena khitob ayat untuk jamaah, dan diantara mereka ada sebagian yang munafiq dan orang lemah imannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "26 Kemudian Allah menurunkan ketenangan kepada Rasul-Nya dan kepada orang-orang yang beriman, sehingga hati tidak gentar dan kembali berperang. Ketika Al Abbas memanggil mereka dan Allah menurunkan bala tentara yang tidak dapat kamu lihat, yaitu para malaikat untuk menguatkan ruh orang mukmin dan menimpakan bencana kepada orang-orang yang kafir dengan pembunuhan, tawanan dan harta mereka diambil dan demikianlah pembalasan kepada orang-orang yang kafir kepada Allah dan rasul-Nya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kemudian Allah menurunkan ketenanganNya} ketenangan dan keteguhan dariNya {kepada RasulNya dan kepada orang-orang mukmin, serta menurunkan bala tentara} para malaikat {yang tidak bisa kalian lihat, dan menyiksa orang-orang kafir. Itulah balasan terhadap orang-orang kafir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "26. “Kemudian Allah menurunkan ketenangan kepada RasulNya dan kepada orang-orang yang beriman.” Sakinah adalah apa yang Allah sematkan dalam hati dalam kondisi kesulitan, kegoncangan, dan ketakutan, yang dapat meneguhkannya, menentramkannya, dan menjadikannya tenang. Ia adalah salah satu nikmat besar Allah kepada hamba-hambaNya. “Dan Allah menurunkan bala tentara yang kamu tiada melihatnya.” Yaitu para malaikat, Allah menurunkan mereka untuk menolong kaum Muslimin pada perang Hunain yang meneguhkan dan memberi berita gembira kemenangan. “Dan Allah menimpakan bencana kepada orang-orang yang kafir”, dengan kekalahan, pembunuhan dan dikuasainya wanita, anak-anak dan harta mereka oleh kaum Muslimin. “Dan demikianlah pembalasan kepada orang-orang yang kafir.” Allah mengazab mereka di dunia kemudian di akhirat mereka digiring kepada azab yang sangat pedih."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 26: Dengan mengalahkan dan menjadikan mereka terbunuh, dan menjadikan kaum muslimin menguasai istri, anak dan harta mereka. Di dunia Allah mengazab mereka seperti yang sudah diterangkan, sedangkan di akhirat mereka dikembalikan kepada azab yang pedih. Na’uudzu billahi min dzaalik tsumma na’uudzu billah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 26",
    "description": "Pada perang hunain, mulanya kaum muslim mengalami kekalahan, namun kemudian atas rahmat Allah, dia menurunkan ketenangan berupa keimanan yang tulus dan kukuh, kepada rasul-Nya dan kepada orangorang yang beriman, sehingga mereka mampu mengatasi masalah yang sangat berat saat itu, dan dia menguatkan pasukan kaum mukmin yang tersisa itu dengan menurunkan bala tentara dari para malaikat yang tidak terlihat olehmu; dan sebagai hukuman, dia menimpakan azab kepada orang-orang kafir melalui penawanan, pembunuhan, perampasan perang, dan lain-lain. Itulah balasan bagi orang-orang kafir yang menutupnutupi kebenaran ilahi dan bahkan menentangnyameskipun dahulu mereka menentang agama islam, namun jika setelah itu mereka bertobat secara tulus, Allah akan menerima tobat orang yang dia kehendaki. Allah maha pengampun lagi maha penyayang kepada siapa saja yang bertobat kepada-Nya."
  }
]