[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan barang siapa kembali dari kekafiranya setelah itu dan masuk islam, maka sesungguhnya Allah akan menerima taubat siapa saja yang Dia kehendaki dari mereka, lalu dia akan mengampuni dosanya. Dan Allah Maha pengampun lagi Maha penyayang."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "27. Kemudian jika sesudah turunnya hukuman itu ada orang yang bertobat dari kekafiran dan kesesatannya, maka Allah akan menerima tobatnya. Dan Allah Maha Pengampun lagi Maha Penyayang bagi hamba-hamba-Nya yang bertobat setelah menganut ajaran kafir atau berbuat maksiat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "27. ثُمَّ يَتُوبُ اللهُ مِنۢ بَعْدِ ذٰلِكَ (Sesudah itu Allah menerima taubat) Yakni setelah diturunkan siksaan itu. عَلَىٰ مَن يَشَآءُ ۗ( dari orang-orang yang dikehendaki-Nya) Yang Allah berikan hidayah kepada mereka untuk masuk Islam."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "27. Lalu setelah menghukum orang-orang kafir ini dalam perang, Allah menerima taubat orang yang dikehendaki di antara para hambaNya yang mau bertaubat dan masuk Islam. Allah itu Maha Pengampun dan Maha Pengasih bagi dosa-dosa orang yang bertaubat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Setelah itu Allah menerima taubat orang yang Dia kehendaki. Allah Maha Pengampun lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "27. “kemudian Sesudah itu Allah menerima taubat dari orang-orang yang dikehendakiNya.” Allah mengampuni banyak orang yang kalah dalam perang ini, mereka datang kepada Nabi dengan menyatakan masuk Islam dan bertaubat, maka Nabi mengembalikan harta, istri, dan anak mereka. “Dan Allah Maha Pengampun lagi Maha Penyayang.” Yakni Pemilik ampunan yang luas dan rahmat yang menyeluruh. Mengampuni dosa-dosa besar bagi yang bertaubat dan menyayangi mereka dengan taufikNya kepada mereka untuk bertaubat dan melakukan ketaatan, serta Allah memaafkan kesalahan mereka dan menerima taubat mereka, maka janganlah seorang pun berputus asa dari rahmat dan ampunanNya, meski dia telah melakukan dosa dan kejahatan sebesar apa pun."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 27: Dengan menjadikan mereka masuk Islam dan mengembalikan kepada mereka harta rampasan yang sebelumnya diambil. Allah memiliki ampunan yang luas dan rahmat yang merata, Dia memaafkan dosa-dosa besar bagi orang-orang yang bertobat dan merahmati mereka dengan memberinya taufiq untuk bertobat dan taat, memaafkan tindakan buruk mereka dan menerima tobat mereka. Oleh karena itu, janganlah ada seorang yang berputus asa dari ampunan dan rahmat-Nya meskipun ia telah melakukan dosa yang demikian besar dan banyak."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 27",
    "description": "Meskipun dahulu mereka menentang agama islam, namun jika setelah itu mereka bertobat secara tulus, Allah akan menerima tobat orang yang dia kehendaki. Allah maha pengampun lagi maha penyayang kepada siapa saja yang bertobat kepada-Nya. Setelah ayat-ayat sebelumnya menunjukkan beberapa perintah, larangan, dan ketentuan-ketentuan yang berisi anjuran dan ancaman, maka ayat ini menunjukkan alasan mengapa kaum mukmin harus memutuskan hubungan dengan kaum musyrik. Wahai orang-orang yang beriman! sesungguhnya orang-orang musyrik yang sedemikian mantap kemusyrikannya, baik dari ucapan maupun perilakunya, itu najis, jiwa dan akidahnya kotor, karena itu janganlah mereka mendekati masjidilharam dan tanah haram di sekitarnya setelah tahun ini, yaitu akhir tahun 9 hijriah. Dan jika kamu khawatir menjadi miskin karena orang kafir tidak datang di musim haji dengan membawa barang dagangan, maka Allah nanti akan memberikan kekayaan berupa kecukupan rezeki kepadamu dari karunia-Nya, jika dia menghendaki, sesuai dengan ketetapan-Nya, yakni rezeki itu harus dicari dengan usaha yang optimal sesuai dengan sunatullah-Nya. Sesungguhnya Allah maha mengetahui segala makhluknya, mahabijaksana dalam segala ketentuan dan pengaturan-Nya."
  }
]