[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai sekalian kaum mukminin, sesungguhnya orang-orang musyrik adalah najis dan kotor, maka janganlah kalian memberikan kesempatan bagi mereka untuk mendekati Masjidil Haram setelah tahun kesembilan dari hijrah ini. Dan jika kalian khawatir akan kemiskinan karena terputusnya perniagaan mereka dari kalian, maka sesungguhnya Allah akan mengantikanya bagi kalian, dan mencukupi kalian melalui sebagian dari karuniaNya, jika Dia menghendaki. Sesungguhnya Allah Maha Mengetahui kebutuhan kalian, lagi Maha bijaksana dalam pengaturan urusan-urusan kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "28. Wahai orang-orang yang beriman kepada Allah dan rasul-Nya dan mengikuti apa yang disyariatkan-Nya untuk mereka, sesungguhnya orang-orang musyrik itu adalah najis. Karena di dalam diri mereka terkandung kekafiran, kezaliman, akhlak tercela, dan kebiasaan yang buruk. Maka jangan sampai mereka memasuki tanah suci Makkah, termasuk Masjidilharam, walaupun mereka bermaksud menunaikan ibadah haji atau umrah, setelah tahun ini, yaitu tahun 9 Hijriyah. Dan jika kalian -wahai orang-orang mukmin- takut miskin disebabkan terhentinya pasokan makanan dan masukan barang perdagangan lainnya, sesungguhnya Allah akan mencukupi kebutuhan kalian dari karunia-Nya jika Dia menghendaki. Sesungguhnya Allah Maha Mengetahui keadaan kalian lagi Maha Bijaksana dalam mengatur urusan kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "28. Sesuai dengan perintah-perintah dan larangan-larangan yang telah disebutkan sebelumnya, dan penjelasan tentang hikmah-hikmahnya; Allah menjelaskan sebab keharusan melawan dan menjauhi orang-orang musyrik dengan berfirman: Orang-orang musyrik itu najis dan memiliki kepercayaan yang rusak; mereka meyekutukan Allah dengan sesuatu yang tidak dapat mendatangkan manfaat atau mudharat. Maka janganlah kalian membiarkan mereka memasuki Masjidil Haram setelah tahun ini -tahun 9 Hijriyah-. Jika kalian takut menjadi miskin karena sedikitnya mendapatkan bahan pokok dan barang-barang dagangan yang dahulu didatangkan orang-orang musyrik, maka Allah akan memberi kalian rezeki dengan keberkahan-Nya; Dia Maha Mengetahui kekayaan atau kemiskinan yang akan terjadi bagi kalian di masa depan, dan Dia Maha Bijaksana dalam perintah dan larangan yang ditetapkan bagi kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "28. إِنَّمَا الْمُشْرِكُونَ نَجَسٌ (Sesungguhnya orang-orang yang musyrik itu najis) Yang dimaksud adalah kenajisan perbuatan syirik dan zalim, serta akhlak dan kebiasaan yang buruk, sebab Allah menghalalkan makanan mereka bagi orang beriman. Terdapat sebuah hadist menyebutkan bahwa Rasulullah makan, minum, dan berwudlu dengan menggunakan wadah-wadah mereka, dan Rasulullah memasukkan mereka ke masjidnya. فَلَا يَقْرَبُوا۟ الْمَسْجِدَ الْحَرَامَ(maka janganlah mereka mendekati Masjidilharam) Yakni janganlah mereka memasuki tanah haram kota Makkah dan diantaranya adalah Masjidil Haram. Dan jika mereka ingin mengerjakan ibadah haji atau umrah, maka hal itu tetap tidak diperbolehkan, ataupun untuk kepentingan apapun. Adapun hukum masuk masjid selain Masjidil Haram bagi mereka maka para ulama Madinah berpendapat bahwa orang musyrik dilarang memasuki masjid manapun karena mereka najis, sedangkan masjid-masjid itu bersih dan disucikan. Larangan bagi orang-orang musyrik untuk memasuki masjidil haram merupakan larangan bagi orang-orang beriman untuk memberi kesempatan kepada mereka untuk memasukinya. Dan pendapat yang benar bahwa orang kafir dilarang memasuki masjid selain masjidil haram kecuali apabila telah mendapat izin dari pemimpin atau salah seorang dari kaum muslimin. بَعْدَ عَامِهِمْ هٰذَا ۚ( sesudah tahun ini) Yakni pada tahun kesembilan hijriyah, yaitu tahun disaat Abu Bakar akan menunaikan ibadah haji pada musim haji. Dan larangan ini mulai berlaku pada tahun kesepuluh hijriyah. وَإِنْ خِفْتُمْ عَيْلَةً(Dan jika kamu khawatir menjadi miskin) Makna (العيلة) yakni kemiskinan. Ketika kaum muslimin melarang orang-orang musyrik untuk mengerjakan ibadah haji sedangkan orang-orang musyrik itu membawa banyak makanan dan barang dagangan, setan membisikkan ke dalam hati mereka kekhawatiran menjadi miskin dengan mengatakan “dari mana kita akan mencari penghidupan?”. Maka Allah menjanjikan untuk menjadikan mereka berkecukupan dengan karunia-Nya. فَسَوْفَ يُغْنِيكُمُ اللهُ مِن فَضْلِهِۦٓ( maka Allah nanti akan memberimu kekayaan kepadamu dari karunia-Nya) Ikrimah berkata: “Allah mencukupi mereka dengan turunnya hujan, tumbuh-tumbuhan, tanah yang subur, dan masuknya orang-orang Arab ke dalam agama Islam kemudian membawa ke kota Makkah barang-barang yang mencukupkan mereka, Allah juga mencukupkan mereka dengan harta fai’ dan menghalalkan bagi mereka harta Jizyah sebagaimana yang akan disebutkan dalam ayat selanjutnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "28. Wahai orang-orang yang beriman Sesungguhnya orang-orang musyrik itu najis keyakinannya dan kejam akibat kesyirikan, kezaliman dan keburukan akhlaknya, itu bukan najis materi. Maka mereka jangan sampai masuk wilayah suci Mekah dan Baitul Haram, meskipun untuk berhaji dan umrah setelah tahun ke 9 Hijriyyah, yang mana Abu Bakr berhaji pada tahun itu, maksudnya laranglah mereka untuk masuk. Dan jika kalian khawatir khawatir akibat terputusnya perniagaan mereka denganmu, maka Allah akan mengganti ketaatan kalian kepadaNya dengan kabaikan jika Dia menghendaki kalian kaya. Dan sungguh Dia membuat mereka kaya dengan penaklukkan, upeti, hujan, tumbuhan, dan logam. Sesungguhnya Allah Maha Mengetahui sesuatu yang baik untuk suatu keadaan dan Maha Bijaksana dalam perbuatan dan aturanNya. Ibnu Abbas berkata: “Orang-orang musyrik datang ke Baitullah dan ketika mereka dilarang untuk mendatangi Baitullah, orang orang muslim berkata: “Dari mana kami bisa makan?” Lalu Allah menurunkan ayat {Inkhiftum ‘ailah ..}”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, sesungguhnya orang-orang musyrik itu najis. Maka jangan sampai mereka mendekati Masjidil haram setelah tahun ini} tahun kesembilan setelah hijrah {Jika kalian khawatir pada kemiskinan} kefakiran {Allah nanti akan memberikan kekayaan kepada kalian dari karuniaNya jika Dia menghendaki. Sesungguhnya Allah Maha Mengetahui lagi Maha bijaksana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "28. Alllah berfirman, “Hai orang-orang yang beriman, sesungguhnya orang-orang musyrik itu”, yang menyekutukan Allah dengan sesuatu, “najis”, yakni kotor pada akidah dana mal mereka, najis mana yang lebih berat daripada orang yang menyembah tuhan-tuhan lain selain Allah yang tidak dapat mendatangkan manfaat, menolak mudarat, dan tidak berguna apapun. Sementara perbuatan mereka hanyalah berkisar antara memerangi Allah, menghalang-halangi dari jalan Allah, mendukung kebatilan, menolak kebenaran, dan berbuat kerusakan di muka bumi, bukan kebaikan? Maka kamu harus menyucikan rumah termulia dan tersuci dari mereka. “Maka janganlah mereka mendekati Masjidil Haram sesudah tahun ini.” Yakni tahun Sembilan hijriyah, ketika orang-orang berhaji dengan amir Abu Bakar ash-Shiddiq, dan Nabi mengutus sepupunya, Ali bin Abi THalib, agar mengumumkan pemutusan hubungan dari Allah kepada orang-orang musyrik pada hari haji akbar, maka dia mengumumkan bahwa setelah tahun ini orang-orang musyrik tidak boleh berhaji dan orang yang telanjang tidak boleh thawaf di Ka’bah. Najis yang dimaksud disini bukan najis badan, karena orang kafir adalah suci badannya sebagaimana yang lain, dengan dalil bahwa Allah menghalalkan menggauli istri yang Ahli KItab, dan tidak memerintahkannya agar mencuci apa yang terkenal darinya, dan kaum Muslimin sendiri bergaul dan bermuamalah dengan orang-orang kafir, dan tidak dinukil dari mereka bahwa mereka merasa jijik seperti mereka jijik terhadap benda najis, akan tetapi yang dimaksud di sini adalah najis maknawi, yaitu syirik mereka, sebagaimana tauhid dan iman adalah kesucian, maka syirik adalah najis. FirmanNya, “Dan jika kamu khawatir”, wahai kaum Muslimin “menjadi miskin”, akibat melarang orang-orang musyrik mendekati Masjidil Haram, di mana sarana-sarana dunia terputus darimu karena itu, “maka Allah nanti akan memberikan kekayaan kepadamu dari karuniaNya.” Rizki tidak terbatas pada satu pintu dan tempat saja, bahkan tidaklah satu pintu tertutup kecuali pintu-pintu lain yang banyak akan dibukakan, karena karunia Allah sangatlah luas, dan kemurahanNya amatlah besar, khususnya bagi yang meninggalkan sesuatu karena mengharap wajahNya yang mulia, karena sesungguhnya Allah adalah Dzat yang paling Pemurah diantara para pemurah, dan Allah telah membuktikan janjiNya dengan menjadikan kaum Muslimin berkecukupan dengan karuniaNya dan membentangkan rizki untuk mereka yang membuat mereka menjadi orang-orang kaya dan penguasa yang terkaya. FirmanNya, “JIka Dia menghendaki.” Mengaitkan karunia kekayaan dengan kehendakNya, karena kekayaan di dunia bukan termasuk konsekuensi iman dan tidak menunjukkan kecintaan Allah, oleh karenanya Allah menggantungkannya dengan kehendakNya, karena Allah memberikan dunia kepada yang Dia cintai dan kepada yang tidak Dia cintai dan Dia tidak menganugerahkan keimanan dan agama kecuali kepada yang Dia cintai. “Sesungguhnya Allah Maha Mengetahui lagi Mahabijaksana.” Yakni ilmuNya luas, mengetahui siapa yang layak diberi kekayaan dan siapa yang tak layak, meletakkan segala sesuatu pada tempatnya dan sesuai dengan posisinya. Ayat yang mulia ini, yakni FirmanNya, “Maka janganlah mereka mendekati Masjidil Haram sesudah tahun ini,” menunjukkan bahwa orang-orang musyrik sebelumnya adalah pemimpin dan penguasa di Baitul Haram, kemudian setelah Fathu Makkah kepemimpinan tersebut berpindah kepada Rasulullah dan orang-orang Mukmin, meski mereka tetap tinggal di Makkah Mukarramah, kemudian turunlah ayat ini. Dan ketika nabi hendak wafat, beliau meminta agar mereka diusir dari Hijaz, sehingga tidak ada dua agama padanya, semua itu demi menjauhkan orang kafir dari Masjidil Haram, ia termasuk ke dalam Firman Allah, “Maka janganlah mereka mendekati Masjidil Haram sesudah tahun ini.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 28: Dalam aqidah dan amalnya. Aqidah mereka syirk, sedangkan amal mereka adalah menentang Allah, menghalangi manusia dari jalan Allah, membela yang batil, menolak yang hak, mengadakan kerusakan di bumi dan tidak memperbaikinya. Oleh karena itu, hendaknya kamu bersihkan rumah yang paling mulia di muka bumi dari mereka itu (orang-orang musyrik). Perlu diketahui, bahwa najis di sini bukan berarti bahwa badan mereka bernajis, karena orang kafir sebagaimana yang lainnya suci badannya, alasannya karena Allah Ta’ala membolehkan menggauli wanita Ahli Kitab dan tidak memerintahkan untuk membasuh bagian yang terkena olehnya, demikian juga karena kaum muslimin senantiasa bersentuhan badan dengan orang-orang kafir, dan tidak ada nukilan bahwa mereka menganggapnya jijik sebagaimana mereka menganggap jijik barang najis. Oleh karena itu, najis di sini adalah najis maknawi karena perbuatan syirk, sebagaimana tauhid dan iman merupakan kesucian, sedangkan syirk adalah najis. Maksudnya tidak dibenarkan mengerjakan haji dan umrah. Menurut pendapat yang lain, bahwa kaum musyrikin itu tidak boleh masuk ke tanah Haram baik untuk keperluan haji dan umrah atau untuk keperluan yang lain. Maksudnya setelah tahun 9 Hijrah, ketika Abu Bakar memimpin jamaah haji kaum muslimin, dan ketika itu, Nabi shallallahu 'alaihi wa sallam mengutus Ali bin Abi Thalib untuk membacakan ayat “bara’ah” pada hari haji akbar, ia juga diperintahkan menyerukan bahwa, “Orang musyrik tidak boleh berhaji setelah tahun ini, dan tidak boleh bertawaf dengan telanjang.” Karena mencegah orang musyrikin mengerjakan haji dan umrah atau mendekati Masjidilharam, sehingga pencaharian orang-orang Muslim boleh jadi berkurang, dan kaum musyrikin tidak berbelanja lagi kepada kaum muslimin. Karena sesungguhnya rezeki-Nya tidak terbatas hanya melalui satu pintu, bahkan tidaklah satu pintu ditutup kecuali akan dibukakan pintu-pintu lainnya yang banyak, karena karunia Allah begitu luas terlebih bagi mereka yang meninggalkan sesuatu karena Allah, dan lagi Allah Subhaanahu wa Ta'aala telah mengayakan mereka dengan berbagai fath (penaklukkan) dan jizyah (pajak). Dan Allah Subhaanahu wa Ta'aala telah memenuhi janji-Nya, Dia telah mengayakan kaum muslimin dengan karunia-Nya dan membuka lebar-lebar rezeki kepada mereka, sehingga mereka menjadi orang-orang yang kaya. Kata-kata “Jika Dia menghendaki” menunjukkan pengkaitan kaya jika dikehendaki-Nya. Hal itu, karena kaya di dunia bukan termasuk lawazim (hal yang menempel) dengan keimanan, dan tidak menunjukkan kecintaan Allah. Oleh karena itu, Dia mengaitkannya dengan kata-kata “Jika Dia menghendaki”, karena sesungguhnya Allah memberikan dunia kepada orang yang Dia cintai dan orang yang tidak Dia cintai, dan tidak memberikan iman dan agama selain kepada orang yang Dia cintai. Ilmu-Nya meliputi segala sesuatu, Dia mengetahui orang yang layak menjadi kaya dan yang tidak layak, serta meletakkan sesuatu pada tempatnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 28",
    "description": "Setelah ayat-ayat sebelumnya menunjukkan beberapa perintah, larangan, dan ketentuan-ketentuan yang berisi anjuran dan ancaman, maka ayat ini menunjukkan alasan mengapa kaum mukmin harus memutuskan hubungan dengan kaum musyrik. Wahai orang-orang yang beriman! sesungguhnya orang-orang musyrik yang sedemikian mantap kemusyrikannya, baik dari ucapan maupun perilakunya, itu najis, jiwa dan akidahnya kotor, karena itu janganlah mereka mendekati masjidilharam dan tanah haram di sekitarnya setelah tahun ini, yaitu akhir tahun 9 hijriah. Dan jika kamu khawatir menjadi miskin karena orang kafir tidak datang di musim haji dengan membawa barang dagangan, maka Allah nanti akan memberikan kekayaan berupa kecukupan rezeki kepadamu dari karunia-Nya, jika dia menghendaki, sesuai dengan ketetapan-Nya, yakni rezeki itu harus dicari dengan usaha yang optimal sesuai dengan sunatullah-Nya. Sesungguhnya Allah maha mengetahui segala makhluknya, mahabijaksana dalam segala ketentuan dan pengaturan-Nya. Ayat yang lalu menjelaskan tuntunan-Nya terhadap kaum musyrik, maka ayat ini beralih kepada ahli kitab yang hendak memerangi orang-orang mukminin. Konteks ayat ini turun berkenaan dengan perang tabuk. Saat itu telah terdengar berita bahwa pasukan romawi akan menyerang dan berusaha menguasai daerah perbatasan tersebut, maka turunlah ayat ini sebagai perintah untuk memerangi mereka. Perangilah orang-orang yang tidak beriman kepada Allah dan hari kemudian yang terlebih dulu memerangimu, mereka yang tidak mengharamkan bahkan terus-menerus melakukan apa yang telah diharamkan Allah dan rasul-Nya dan mereka yang tidak beragama dengan agama yang benar, yakni agama islam, sementara di sisi lain mereka telah mempersiapkan diri untuk menyerang kaum mukminin. Padahal, mereka itu adalah orang-orang yang telah diberikan kitab yaitu kitab taurat dan injil yang menerangkan tentang Muhammad sebagai nabi dan rasul terakhir. Perangi mereka hingga sampai batas di mana mereka memilih untuk bersyahadat atau membayar jizyah, yakni kewajiban individu yang dipandang mampu agar memperoleh perlindungan, dengan patuh sedang mereka dalam keadaan tunduk terhadap segala ketentuan yang berlaku di wilayah di mana mereka tinggal."
  }
]