[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai kaum muslimin, perangilah orang-orang kafir yang tidak beriman kepada Allah dan tidak beriman kepada Hari kebangkitan dan pembalasan amal, dan tidak menjauhi apa yang dilarang oleh Allah dan RasulNya, serta tidak berkomitmen dengan syarriat-syariat islam, dari kalangan Yahudi dan Nasrani, sampai mereka mau membayar jizyah yang kalian wajibkan atas tangan mereka dengan tangan mereka sendiri dalam keadaan hina lagi rendah diri."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "29. Perangilah -wahai orang-orang mukmin- orang-orang kafir yang tidak beriman kepada Allah sebagai Rabb Yang tiada sekutu bagi-Nya dan tidak beriman kepada hari Kiamat, tidak menjauhi apa yang diharamkan bagi mereka oleh Allah dan rasul-Nya, seperti bangkai, daging babi, khamr, dan riba, dan tidak tunduk kepada syariat Allah, dari golongan Yahudi dan Nasrani, sampai mereka memberikan jizyah dengan tangan mereka sendiri sambil menunjukkan sikap yang rendah dan tunduk."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "29. Allah memerintahkan orang-orang beriman untuk memerangi orang-orang kafir dari kalangan Yahudi dan Nasrani ,yang tidak percaya bahwa Allah adalah Tuhan satu-satunya, dan tidak beriman kepada hari kebangkitan dan pembalasan, tidak menjauhkan diri dari apa yang diharamkan Allah dan rasul-Nya seperti bangkai, daging babi, khamr, dan riba, dan tidak tunduk kepada syariat yang telah ditetapkan Allah; hingga mereka membayar jizyah untuk kalian dengan tangan mereka dan dengan penuh kehinaan dan ketundukan; dengan syarat, mereka memiliki kemampuan dan kelapangan. Jika mereka telah membayar jizyah, maka wajib bagi kalian untuk memberi mereka keamanan dan perlindungan, serta kebebasan menjalankan agama mereka; dan wajib bagi kalian untuk memperlakukan mereka dengan adil, dan haram bagi kalian menzalimi dan menindas mereka dengan sesuatu yang tidak mampu mereka lakukan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "29. قٰتِلُوا۟ الَّذِينَ لَا يُؤْمِنُونَ بِاللهِ (Perangilah orang-orang yang tidak beriman kepada Allah) Allah menjelaskan dosa yang menjadikan seseorang berhak mendapat siksaan. وَلَا بِالْيَوْمِ الْاٰخِر(dan tidak (pula) kepada hari kemudian) Allah menekankan dosa yang menyangkut keyakinan seseorang. وَلَا يُحَرِّمُونَ مَا حَرَّمَ اللهُ وَرَسُولُهُۥ (dan mereka tidak mengharamkan apa yang diharamkan oleh Allah dan Rasul-Nya) Yakni berupa khamr, daging babi, bangkai, riba, zina, dan kemungkaran-kemungkaran lainnya yang dihalalkan oleh orang-orang kafir. وَلَا يَدِينُونَ دِينَ الْحَقِّ(dan tidak beragama dengan agama yang benar) Dalam potongan ayat ini terdapat isyarat pada penekanan tentang kemaksiatan yang disebabkan oleh kesesatan, kedurhakaan, dan keangkuhan untuk berserah diri. مِنَ الَّذِينَ أُوتُوا۟ الْكِتٰبَ((yaitu orang-orang) yang diberikan Al-Kitab kepada mereka) Ini merupakan penekanan sebagai hujjah bagi mereka, karena mereka mendapati sifaf-sifat Rasulullah tertulis dalam kitab Taurat dan Injil yang ada pada mereka. Kewajiban membayar jizyah juga berlaku bagi orang-orang majusi sebagaimana disebutkan dalam hadist: “perlakukanlah mereka seperti kalian memperlakukan para ahli kitab”. Imam Malik berpendapat dibolehkan mengambil harta jizyah dari seluruh golongan orang-orang kafir. حَتَّىٰ يُعْطُوا۟ الْجِزْيَةَ(sampai mereka membayar jizyah) Jizyah yakni sejumlah harta yang diwajibkan bagi orang kafir untuk membayarnya sebagai ganti atas kependudukan mereka di negeri Islam. Jumlah harta jizyah yang harus dibayarkan tergantung kepada keputusan Imam atau pemimpin kaum muslimin yang melakukan kesepakatan dengan mereka, atas setiap orang dewasa dari mereka diwajibkan membayar sejumlah harta tertentu. Pembayaran ini merupakan syarat dasar dalam perjanjian untuk menjadikan mereka termasuk orang kafir dzimmy. عَن يَدٍ(dari tangan mereka) Yakni dengan kerelaan membayar tanpa ada rasa enggan. Pendapat lain mengatakan maknanya adalah mereka harus membayarnya langsung dengan tangan mereka tanpa mewakilkan kepada orang lain. Yakni orang kafir dzimmy membayar jizyah dengan penuh kerendahan dan kahinaan, yang datang sendiri untuk menyerahkannya kepada petugas pengumpul jizyah yang merupakan orang Islam."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "29. Wahai orang-orang mukmin, perangilah orang-orang yang tidak beriman kepada Allah, akhirat dan apa yang ada di dalamnya yaitu hari penghisaban, hari pembalasan dan kehidupan selanjutnya, dan itu bukanlah hanya kehidupan ruh saja sebagaimana yang mereka ucapkan, dan orang-orang yang tidak mengharamkan barang haram yang diharamkan oleh Allah dan rasulNya seperti khamr dan riba, dan tidak mempercayai Islam yang merupakan agama yang haq, yaitu orang Yahudi dan Nasrani, sehingga mereka membayar upeti, yaitu upeti wajib bagi orang-orang yang mampu yang hidup di wilayah Islam, dan mereka itu memiliki kelapangan, kemampuan dan bisa berbuat taat tanpa dilarang, dan mereka itu tunduk kepada hukum Islam, menjalankan hukum-hukum Islam dan pemimpin kerajaan Islam. Ayat ini turun terkait Ahli Kitab Dan orang pertama yang membayar upeti sebelum wafatnya nabi SAW adalah para penebang kayu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Perangilah orang-orang yang tidak beriman kepada Allah dan hari akhir, tidak mengharamkan apa yang telah diharamkan oleh Allah dan RasuNya, dan tidak mengikuti agama yang benar, yaitu orang-orang yang telah diberikan kitab sampai mereka membayar jizyah dengan patuh} dengan tangan mereka sendiri {dan mereka tunduk} tunduk dan takluk"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "29. Ayat ini adalah perintah memerangi orang-orang kafir dari orang-orang Yahudi dan Nasrani dari “orang-orang yang tidak beriman kepada Allah dan tidak (pula) kepada Hari Kemudian,” dengan iman yang benar yang dibuktikan dengan perbuatan mereka. “Dan mereka tidak mengharamkan apa yang telah diharamkan oleh Allah.” Mereka tidak mengikuti syariatNya dalam mengharamkan yang haram, “dan tidak beragam dengan agama yang benar (agama Allah).” Yakni tidak memeluk agama yang benar, meskipun mereka mengklaim diri mereka beragama, karena ia bukanlah agama yang benar karena ia adalah agama yang telah diganti yang tidak disyariatkan oleh Allah sama sekali, atau ia adalah agama yang Mansukh (terhapus) yang disyariatkan lalu diganti dengan syariat Muhammad, maka setelah ia dinasakh tidak boleh dipegang lagi. Allah memerintahkan dan mendorong orang-orang beriman untuk memerangi mereka karena mereka menyeru manusia kepada kesesatan dan terjadi banyak mudarat terhadap manusia dari mereka, karena mereka adalah Ahli KItab. Dan titik akhir perang itu adalah “sampai mereka membayar jizyah.” Yakni harta yang dibayarkan sebagai imbalan atas tidak diperanginya mereka oleh Kaum Muslimin dan izin tinggal dengan aman terhadap diri dan harta mereka di tengah-tengah kaum Muslimin. Ia di ambil dari mereka setiap tahun, masing-masing berdasarkan kemampuannya, kaya, miskin, atau menengah, sebagaimana hal itu dilakukan oleh Amirul Mukmimin Umar bin al-Khattab dan selainnya. FirmanNya, “Dengan patuh” yakni, mereka membayarnya dalam keadaan rendah diri dan tanpa memiliki kekuasaan, mereka membayarnya dengan tangan mereka tanpa melalui pelayan atau perantara, dan ia tidak diterima kecuali melalui tangan mereka, “sedang mereka dalam keadaan tunduk.” Jika mereka dalam kondisi seperti ini, dan mereka meminta kaum Muslimin agar mereka dibiarkan dengan jizyah sedangkan mereka dibawah kendali dan kekuasaan kaum Muslimin, dalam kondisi aman dari fitnah dan keburukan mereka, menerima syarat yang diberlakukan oleh kaum Muslimin kepada mereka, di mana hal ini dapat menghilangkan kesombongan dan kekuasaan mereka dan memaksa mereka dan patuh, maka sang pimpinan atau wakilnya wajib memberikan jizyah atas mereka, jika tidak demikian, di mana mereka tidak menepati dan tidak memberikan jizyah dengan patuh dan tunduk, maka tidak boleh membiarkan mereka dengan jizyah, akan tetapi wajib diperangi. Ayat ini dijadikan dalil oleh jumhur ulama yang berkata bahwa jizyah tidak diambil kecuali dari Ahli KItab, karena Allah tidak menyebutkan tentang bolehnya mengambil jizyah kecuali dari mereka. Adapun selain mereka, maka yang ada hanyalah diperangi sampai mereka masuk Islam. Orang-orang Majusi diindukkan kepada Ahli KItab dalam hal pengambilan jizyah dari mereka dan pembiaran mereka di negeri kaum Muslimin, karena Nabi mengambilnya dari orang Majusi Hajar, kemudian Umar juga mengambilnya dari orang Majusi Persia. (HR Bukhori : 3157) Ada juga yang berpendapat, bahwa jizyah diambil dari semua orang kafir, baik dari Ahli Kitab maupun lainnya, karena ayat ini turun setelah selesainya perang melawan orang-orang Arab yang musyrik dan dimulainya perang melawan Ahli Kitab dan semisal mereka, maka pembatasan ini hanyalah sekedar penyampaian tentang kenyataan yang terjadi, tidak ada makna tersirat padanya, dan ini didukung dengan dalil bahwa orang-orang Majusi juga dituntut membayar jizyah, padahal mereka bukanlah Ahli Kitab, dan karena telah mutawatir dari kalangan sahabat dan orang-orang yang sesudah mereka, bahwa mereka menyerukan satu dari tiga perkara kepada orang-orang yang mereka perangi: Islam, atau jizyah, atau perang, tanpa ada perbedaan antara Ahli Kitab dan selainnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 29: Ayat ini memerintahkan untuk memerangi orang-orang kafir dari kalangan Yahudi dan Nasrani. Mereka tidak mengikuti syari’at-Nya dalam mengharamkan perkara-perkara haram, seperti menghalalkan khamr atau minuman keras. Karena agama mereka sudah dirubah atau sudah dimansukh dengan syari’at Nabi Muhammad shallallahu 'alaihi wa sallam, sedangkan berpegang dengan yang sudah dimansukh tidak boleh. Yaitu orang-orang Yahudi dan Nasrani. Jizyah ialah pajak per-kepala yang dipungut oleh pemerintah Islam dari orang-orang yang bukan Islam agar mereka tidak diperangi dan dapat mukim dengan aman di tengah-tengah kaum muslimin. Pajak tersebut diambil dari mereka setiap tahun sesuai keadaannya; kaya, miskin, atau pertengahan sebagaimana yang dilakukan Amirul Mukminin Umar bin Khaththab dan lainnya dari kalangan umara (pemerintah) kaum muslimin. Kata-kata ‘an yadin” bisa berarti patuh, dan bisa berarti bahwa mereka menyerahkannya dengan tangan mereka tanpa mewakilkan kepada yang lain atau menyerahkannya dalam keadaan hina. Yakni dalam keadaan hina dan tunduk kepada hukum Islam. Jika keadaan mereka seperti ini, mereka meminta kaum muslimin mengakui mereka dengan membayar jizyah, sedangkan mereka berada di bawah hukum dan keuasaan kaum muslimin, mereka juga tunduk kepada syarat-syarat yang diberlakukan kaum muslimin untuk menghilangkan ‘izzah mereka dan kesombongan mereka, maka wajib bagi imam atau wakilnya melakukan akad jizyah dengan mereka. Jumhur ulama berdalih dengan ayat ini, bahwa jizyah tidaklah diambil kecuali dari Ahli Kitab, karena Allah tidak menyebutkan pemungutan jizyah selain dari mereka. Adapun selain mereka, maka tidak disebutkan selain memerangi mereka sampai masuk Islam. Namun dihubungkan dengan Ahli Kitab dan dibiarkan tinggal di tengah kaum muslimin adalah orang-orang Majusi, karena Nabi shallallahu 'alaihi wa sallam mengambil jizyah dari Majusi Hajar, lalu Umar radhiyallahu 'anhu memungut pula dari orang-orang Persia yang beragama Majusi. Di antara ulama ada pula yang berpendapat, bahwa jizyah dipungut pula dari semua orang kafir, baik Ahli Kitab maupun selain mereka, karena ayat ini turun setelah selesai memerangi orang-orang Arab yang musyrik dan mulai memerangi Ahli Kitab dan yang semisal mereka sehingga batasan hanya kepada Ahli Kitab hanya bersifat pengabaran dengan kenyataan, dan tidak diambil mafhumnya. Hal ini ditunjukkan pula oleh pemungutan jizyah dari orang-orang Majusi padahal mereka bukan Ahli Kitab, demikian juga karena telah mutawatir dari kaum muslimin yang mereka terima dari para sahabat dan setelah mereka, bahwa mereka mengajak orang-orang yang mereka perangi kepada tiga hal; masuk Islam, membayar jizyah atau perang tanpa membedakan apakah mereka Ahli Kitab atau bukan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 29",
    "description": "Ayat yang lalu menjelaskan tuntunan-Nya terhadap kaum musyrik, maka ayat ini beralih kepada ahli kitab yang hendak memerangi orang-orang mukminin. Konteks ayat ini turun berkenaan dengan perang tabuk. Saat itu telah terdengar berita bahwa pasukan romawi akan menyerang dan berusaha menguasai daerah perbatasan tersebut, maka turunlah ayat ini sebagai perintah untuk memerangi mereka. Perangilah orang-orang yang tidak beriman kepada Allah dan hari kemudian yang terlebih dulu memerangimu, mereka yang tidak mengharamkan bahkan terus-menerus melakukan apa yang telah diharamkan Allah dan rasul-Nya dan mereka yang tidak beragama dengan agama yang benar, yakni agama islam, sementara di sisi lain mereka telah mempersiapkan diri untuk menyerang kaum mukminin. Padahal, mereka itu adalah orang-orang yang telah diberikan kitab yaitu kitab taurat dan injil yang menerangkan tentang Muhammad sebagai nabi dan rasul terakhir. Perangi mereka hingga sampai batas di mana mereka memilih untuk bersyahadat atau membayar jizyah, yakni kewajiban individu yang dipandang mampu agar memperoleh perlindungan, dengan patuh sedang mereka dalam keadaan tunduk terhadap segala ketentuan yang berlaku di wilayah di mana mereka tinggal. Ayat ini menerangkan sesatnya akidah ahli kitab. Dan orangorang yahudi berkata, uzair putra Allah, dan orang-orang nasrani berkata, al-masih putra Allah. Itulah ucapan yang keluar dari mulut mereka tanpa didasarkan pada dalil yang benar. Mereka meniru ucapan orang-orang kafir yang terdahulu, seperti perkataan musyrik mekkah bahwa malaikat adalah anak perempuan tuhan. Akibat ucapan dan keyakinan mereka yang sesat itulah Allah melaknat mereka. Memang, sungguh mengherankan bagaimana mung-kin mereka sampai berpaling dari agama yang benar, yaitu agama tau-hid, padahal para rasul telah datang kepada mereka silih berganti un-tuk menjelaskan tentang hal itu, juga dikuatkan dengan bukti-bukti rasional tentang keesaan Allah tersebut'"
  }
]