[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan juga pemberitahuan dari Allah dan rasulNya dan peringatan kepada seluruh umat manusia pada hari raya kurban bahwa sesungguhnya Allah berlepas diri dari kaum musyrikin, dan rasulNya berlepas diri pula dari mereka. Maka apabila kalian kembali (wahai kaum musyrikin) mau menerima kebenaran dan kalian tinggalkan kesyirikan, maka itu lebih baik bagi kalian. Dan apabila kalian berpaling dari kebenaran dan menolak untuk memeluk agama Allah, maka ketahuilah bahwa sesungguhnya kalian tidak akan pernah lolos dari siksaan Allah. Dan peringatkanlah (wahai rosul), orang-orang yang berpaling dari islam dengan siksaan Allah yang pedih."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Pengumuman dari Allah serta pengumuman dari rasul-Nya kepada seluruh manusia pada hari Iduladha, bahwasanya Allah -Subḥānahu- berlepas diri dari orang-orang musyrik, dan rasul-Nya juga berlepas diri dari mereka. Jika kalian -wahai orang-orang musyrik- bertobat dari kemusyrikan maka tobat kalian itu akan lebih baik bagi kalian. Dan jika kalian enggan bertobat maka yakinlah bahwa kalian tidak akan bisa melarikan diri dari Allah dan tidak akan luput dari hukuman-Nya. Dan sampaikanlah -wahai Rasul- kepada orang-orang yang ingkar kepada Allah tentang hal buruk yang akan menimpa mereka, yaitu azab sangat pedih yang menanti mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "3. Setelah Allah menyatakan berlepas diri dari mereka, kemudian Allah memerintahkan untuk menyampaikannya kepada orang banyak sebagai hujjah atas mereka, dengan mengatakan bahwa Allah dan rasul-Nya telah berlepas diri dari perjanjian-perjanjian dengan orang-orang musyrik dan dari segala kepercayaan mereka, dengan menyampaikannya pada waktu yang mudah untuk menyampaikan sesuatu yaitu ketika musim haji, pada hari penyembelihan sebagai penutup dari kewajiban ibadah haji, pada saat orang-orang yang melaksanakan haji berkumpul untuk menyempurnakan manasik di Mina. Kemudian Allah menegaskan apa yang harus mereka sampaikan tanpa menundanya dengan memerintahkan mereka berkata kepada orang-orang musyrik: \"Jika kalian bertaubat dari kesyirikan dan pengkhianatan kalian terhadap perjanjian, dan menerima hidayah Islam, maka hal itu lebih baik bagi kalian di dunia dan di akhirat, karena dalam hidayahnya terdapat kebahagiaan dunia akhirat. Namun jika kalian berpaling dari seruan untuk bertobat ini, maka ketahuilah bahwa kalian tidak akan dapat melarikan diri dari Allah dan tidak akan dapat selamat jadi ketetapan dan janji-Nya untuk menolong para rasul dan orang-orang beriman dengan kemenangan atas kalian.\" Hai Rasulallah, dan berilah kabar gembira berupa azab yang pedih di akhirat bagi orang yang mengingkari risalahmu dan tidak beriman kepada Allah, para malaikat, dan hari akhir."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. وَأَذٰنٌ (Dan (inilah) suatu permakluman) Yakni pemberitahuan secara umum. إِلَى النَّاسِ (kepada umat manusia) Yakni kepada seluruh umat manusia tanpa terkecuali. يَوْمَ الْحَجِّ الْأَكْبَر (pada hari haji besar) Yakni di hari ‘Idul Adha. Allah menyebutnya dengan sebutan ‘besar’ karena pada hari itu berkumpul orang-orang yang melaksanakan haji, atau karena hari itu adalah hari dikerjakannya sebagian besar manasik-manasik haji. Allah menjadikan pemberitahuan ini sebagai pemberitahuan yang umum dan jelas agar terbebas dari tuduhan pelanggaran perjanjian dan menjamin sampainya pemberitahuan ini kepada seluruh manusia. أَنَّ اللهَ بَرِىٓءٌ مِّنَ الْمُشْرِكِينَ ۙ (bahwa sesungguhnya Allah berlepas diri dari orang-orang musyrikin) Yakni telah berlepas diri dari orang-orang musyrik yang melanggar perjanjian. وَرَسُولُهُۥ ۚ( dan Rasul-Nya juga berlepas diri) Yakni Rasulullah juga berlepas diri dari mereka. فَإِن تُبْتُمْ (Kemudian jika kamu (kaum musyrikin) bertobat) Yakni bertaubat dari kekafiran. فَهُو (maka itu) Yakni pertaubatan itu. خَيْرٌ لَّكُمْ ۖ (lebih baik bagimu) Dari pada kekafiran yang kalian kerjakan. وَإِن تَوَلَّيْتُمْ(dan jika kamu berpaling) Yakni tetap berlanjut dalam kekafiran. فَاعْلَمُوٓا۟ أَنَّكُمْ غَيْرُ مُعْجِزِى اللهِ ۗ( maka ketahuilah bahwa sesungguhnya kamu tidak dapat melemahkan Allah) Yakni tidak akan bisa lolos dari-Nya. Namun Allah akan mendapatkan kalian dan membalas kalian atas amal-amal kalian."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Permakluman ini dinisbatkan kepada Allah dan rasul-Nya tanpa ada penisbatan kepada kaum muslimin; adalah karena ini merupakan syari'at dan hukum untuk kemaslahatan ummat manusia, maka tidak terjadi kecuali dari Allah melalui lisan rasul-Nya. 2 ). Seruan ini datang setelah 22 tahun dimulainya wahyu, ditutup dengan konteks yang bertentangan dengan ayat-ayat tauhid, dan ditujukan diantara orang-orang jahiliah yang tidak menginginkan perdamaian kecuali pertumpahan darah, merampas kebebasan dan mengubur kebenaran; maka apa yang mereka inginkan menghadapi balasan yang sesuai dengan aturan abadi : { فَأَمَّا الزَّبَدُ فَيَذْهَبُ جُفَاءً ۖ وَأَمَّا مَا يَنْفَعُ النَّاسَ فَيَمْكُثُ فِي الْأَرْضِ } \"Adapun buih itu, akan hilang sebagai sesuatu yang tak ada harganya; adapun yang memberi manfaat kepada manusia, maka ia tetap di bumi\" [ Ar-Ra'd : 17 ]."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3 Inilah suatu permakluman dari Allah dan Rasul-Nya kepada umat manusia pada hari Adha yaitu Haji akbar dimana kegiatan ibadah Haji telah sempurna secara kaffah. bahwa sesungguhnya Allah dan Rasul-Nya berlepas diri dari orang-orang musyrikin yang mengingkari perjanjian, dengan gencatan senjata selama empat bulan. Setelah itu boleh memerangi orang musyrik. Kemudian jika kamu kaum musyrikin bertobat dari kekufuran, maka bertaubat itu lebih baik bagimu daripada berpaling dan tetap dalam kesyirikan dan kekufuran, jika kalian menolak beriman dan taubat bahkan tetap dalam kekufuran maka ketahuilah bahwa sesungguhnya kamu tidak dapat menghindar dari azab Allah, bahkan azab itu akan menemui kalian. Dan beritakanlah kepada orang-orang kafir dan tidak beriman kepada risalahmu bahwa mereka akan mendapat) siksa yang pedih di akhirat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Suatu pemakluman} pemberitahuan {dari Allah dan RasulNya kepada manusia pada hari haji akbar} haji nahr {bahwa sesungguhnya Allah dan RasulNya berlepas diri dari orang-orang musyrik. Jika kalian bertaubat, maka itu lebih baik bagi kalian; dan jika kalian berpaling} berpaling dari taubat {ketahuilah bahwa kalian tidak dapat melemahkan Allah. Berilah kabar gembira kepada orang-orang kafir tentang azab yang pedih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3. Inilah janji kepada orang-orang Mukmin: bahwa Allah akan memenangkan agamaNya, meninggikan kalimatNya dan mengalahkan musuh-musuh mereka, yaitu orang-orang musyrik yang telah mengusir dan mengeluarkan Rasululoh dan para sahabatnya dari Makkah, dari Baitul Al-Haram, yang membuat mereka memiliki kekuasaan atasnya di tanah Hijaz. Allah memenangkan RasulNYa dan orang-orang yang beriman sampai Makkah dapat ditaklukan dan orang-orang musyrik menjadi terhina. Hukum dan kendali atas negera itu beralih ketangan orang-orang yang beriman. Maka Nabi meminta penyeru agar mengumpulkannya pada hari yang Akbar yaitu Hari penyembelihan, hari berkumpulnya manusia yang Muslim dan yang kafir dari segala penjuru Jazirah Arabia, dia mengumumkan bahwa Allah dan RasulNya berlepas diri dari orang-orang musyrik, mereka tidak lagi mempunyai perjanjian damai disisiNya, di mana saja mereka berada, maka akan diperangi dan dikatakan kepada mereka, “janganlah kamu mendekati Masjidil Haram sesudah tahun ini” itu terjadi pada tahun 9H, dan Abu Bakar yang memimpin haji ini, sedangkan yang mengumumkan pernyataan pemutusan hubungan pada hari penyembelihan adalah sepupu Rasulullah, Ali bin abi Thalib. Kemudian Allah mendorong orang-orang musyrik agar betaubat dan memperingatkan mereka agar meninggalkan kesyirikan yang mereka ikuti, “kemudian kaum Musrikin bertaubat, maka bertaubat itu lebih baik bagimu, dan jika kamu berpaling, maka ketahuilah bahwa sesungguhnya kamu tidak dapat melemahkan Allah.” Yakni kamu tidak mungkin berlepas diri dariNya, justru kamu dalam genggamanNya. Dia mampu menguasakan hamba-hambaNya yang beriman atasmu. “dan beritakanlah kepada orang-orang kafir bahwa mereka akan mendapatkan siksaan yang amat pedih.” Yakni, azab yang menyakitkan dan mengerikan di dunia dengan ditawan, dibunuh dan diusir dan di akhirat dengan api neraka dan itulah seburuk-buruk tempat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 3: Inilah janji Allah kepada kaum mukmin, Dia memenangkan agama-Nya, meninggikan kalimat-Nya serta mengecewakan musuh-musuh-Nya, yaitu kaum musyrik yang sebelumnya mengusir Rasulullah shallallahu 'alaihi wa sallam dan para sahabatnya dari Mekah. Allah menolong Rasul-Nya dan kaum mukmin sehingga Mekah dapat ditaklukkan, kaum musyrikin dihinakan dan kaum muslimin menjadi berkuasa di negeri itu. Pada hari haji akbar (hari nahar), yaitu waktu berkumpulnya manusia baik yang muslim maupun yang kafir dari semua jazirah Arab, Rasulullah shallallahu 'alaihi wa sallam memerintahkan penyerunya agar menyerukan kepada manusia, bahwa Allah dan Rasul-Nya berlepas diri dari kaum musyrik. Oleh karena itu, jika mereka ditemui, maka mereka akan dibunuh, dan dikatakan kepada mereka, “Janganlah kalian mendekati Masjidilharam setelah tahun ini (setelah tahun 9 H).” Para mufassir berbeda pendapat tentang yang dimaksud dengan haji akbar, ada yang mengatakan hari Nahar, ada yang mengatakan hari Arafah. Yang dimaksud dengan haji akbar di sini adalah haji yang terjadi pada tahun ke-9 Hijrah. Dan dari perjanjian yang dibuat dengan mereka. Nabi shallallahu 'alaihi wa sallam mengutus Ali pada tahun ke 9 Hiriah itu, lalu ia membacakan ayat di atas dengan keras pada hari Nahar (10 Dzulhijjah) di Mina, dan mengumumkan, bahwa orang musyrik tidak boleh lagi berhaji setelah tahun ini dan tidak boleh bertawaf di Baitullah dengan telanjang (sebagaimana dalam riwayat Bukhari). Dari kekafiran dengan masuk Islam. Yakni tidak dapat lolos dari-Nya, bahkan kamu dalam genggaman-Nya. Yaitu dengan dibunuh ketika di dunia, ditawan dan diusir, serta diazab dengan api neraka ketika di akhirat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 3",
    "description": "Setelah ayat sebelumnya menyatakan pemutusan hubungan dengan kaum musyrik mekah, maka ayat ini menegaskan kembali maklumat ini serta menyebarluaskannya kepada semua orang dalam tenggang waktu empat bulan. Dan bahwa inilah satu maklumat atau pemberitahuan dari Allah dan rasul-Nya kepada umat manusia pada hari haji akbar yang terjadi pada tahun ke-9 hijriah, bahwa sesungguhnya Allah dan rasulnya berlepas diri dari orang-orang musyrik mekah berupa pemutusan hubungan perjanjian dengan mereka; dan begitu pula rasul-Nya melakukan hal yang sama. Kemudian Allah menegaskan kembali jika kalian, wahai kaum musyrik, bertobat, maka itu lebih baik bagi kalian di dunia dan akhirat; dan jika kalian berpaling dari keimanan yang benar atau tidak mau bertobat, maka ketahuilah bahwa kalian tidak dapat melemahkan atau lari dari azab Allah. Dan dengan demikian berilah kabar gembira kepada orang-orang kafir tersebut bahwa mereka akan mendapat azab yang pedih, baik di dunia ini sebagai tawanan atau terbunuh dan di akhirat kelak, yaitu dimasukkan ke dalam neraka. -."
  }
]