[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sungguh kaum Yahudi telah berbuat syirik kepada Allah ketika mereka beranggapan bahwa Uzair adalah putra Allah, dan kaum Nasrani telah menyekutukan Allah ketika mereka mengklaim bahwa al-Masih adalah putra Allah. Pernyataan ini mereka ada-adakan dari diri mereka sendiri. Dengan itu, mereka menyerupai keyakinan kaum musyrikin sebelum mereka. Semoga Allah memerangi kaum musyrikin semuanya, sebab bagaimana mereka berpaling dari kebenaran menuju kebatilan?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "30. Sesungguhnya orang-orang Yahudi dan Nasrani itu semuanya adalah orang-orang musyrik. Orang-orang Yahudi menjadi musyrik ketika mereka beranggapan bahwa 'Uzair adalah anak Allah. Dan orang-orang Nasrani menjadi musyrik ketika mereka beranggapan bahwa Al-Masih Isa adalah anak Allah. Anggapan yang mereka buat-buat sendiri itu mereka ucapkan dengan mulut mereka tanpa dalil maupun argumen yang jelas. Ucapan mereka itu menyerupai ucapan orang-orang musyrik sebelum mereka yang mengatakan bahwa malaikat adalah anak perempuan Allah. Allah Mahatinggi dari itu semua dengan setinggi-tingginya. Semoga Allah membinasakan mereka. Bagaimana mungkin mereka berpaling dari kebenaran yang nyata kepada kebatilan?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "30. Allah mengabarkan bahwa orang-orang Yahudi dan Nasrani tidak berpegang dengan kitab mereka, dan mereka adalah orang-orang musyrik. Orang-orang Yahudi menyekutukan Allah dengan mengatakan Uzair adalah anak Allah; sedangkan orang-orang Nasrani menyekutukan Allah dengan mengatakan Isa al-Masih adalah anak Allah. Itu merupakan kedustaan yang mereka buat dengan mulut mereka tanpa memiliki landasan dalil dan bukti. Apa yang mereka katakan tersebut seperti perkataan orang-orang musyrik sebelum mereka: ‘Para malaikat adalah anak-anak perempuan Allah’. Maha Tinggi Allah dari yang mereka katakan. Semoga Allah membinasakan mereka; bagaimana mereka dapat berpaling dari kebenaran yang jelas menuju kebatilan?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "30. وَقَالَتِ الْيَهُودُ عُزَيْرٌ ابْنُ اللهِ (Orang-orang Yahudi berkata: “Uzair itu putera Allah”) Mereka mengatakan ini ketika ‘Uzair datang kepada mereka untuk membacakan Taurat dari hafalannya setelah mereka lupa terhadap kitab Taurat ini. وَقَالَتِ النَّصٰرَى الْمَسِيحُ ابْنُ اللهِ ۖ( dan orang-orang Nasrani berkata: “Al Masih itu putera Allah”) Mereka mengatakan ini setelah dia menghidupkan orang yang sudah mati, dan karena dia diciptakan tanpa seorang ayah. ذٰلِكَ قَوْلُهُم بِأَفْوٰهِهِمْ ۖ( Demikianlah itu ucapan mereka dengan mulut mereka) Yakni karena perkataan ini diucapkan tanpa penjelasan dan tanpa dikuatkan bukti maka itu hanya menjadi klaim yang diucapkan dari mulut belaka, tanpa memberi manfaat yang dapat diperhitungkan. يُضٰهِـُٔونَ قَوْلَ الَّذِينَ كَفَرُوا۟( mereka meniru perkataan orang-orang kafir yang terdahulu) Dengan perkataan ini mereka menyerupai para penyembah berhala yang berkata: Laata, ‘Uzza, dan Manaah merupakan anak-anak perempuan Allah sebagaimana para malaikat juga anak-anak perempuan Allah. قٰتَلَهُمُ اللهُ (semoga Allah memerangi mereka) Ini merupakan doa agar mereka binasa, karena siapa yang diperangi Allah niscaya ia akan binasa. Pendapat lain mengatakan maknanya adalah semoga Allah melaknat mereka. أَنَّىٰ يُؤْفَكُونَ (bagaimana mereka sampai berpaling) Yakni bagaimana mereka bisa berbelok dari kebenaran menuju kebathilan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "30. Orang-orang Yahudi berkata: “Uzair adalah anak Allah” dan orang Nasrani berkata: “Isa Al-Masih bin Maryam adalah anak Allah“ Semua itu hanya ucapan bukan bukti. Mereka meniru ucapan kufur dan bodoh ini dari ucapan orang-orang kafir sebelum mereka seperti penyembah berhala yang berkata: “Latta, Uzzza dan Manah adalah puteri-puteri Allah, begitu juga malaikat” Allah melaknat dan membinasakan mereka. Bagaimana bisa mereka menyimpang dari kebenaran dan menuju kebathilan dengan mendirikan dalil tentang keesaan Allah? Ayat ini turun terkait sekelompok kaum Yahudi yang berkataa kepada Nabi SAW: “Bagaimana bisa kami mengikutimu sedangkan kamu mengabaikan kiblat kami? Dan kamu tidak berkeyakinan bahwa Uzair adalah anak Allah” lalu Allah menurunkan ayat ini."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Orang-orang Yahudi berkata,“Uzair itu putra Allah”. dan orang-orang Nasrani berkata,“Al-Masih itu putra Allah”. Itulah ucapan mereka dengan mulut-mulut mereka. Mereka meniru} meniru {ucapan orang-orang kafir sebelumnya. Allah melaknat mereka} Allah melaknat mereka {bagaimana bisa mereka sampai berpaling} bagaimana bisa mereka menyimpang dari kebenaran menuju kebathilan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "30. Manakala Allah memerintahkan memerangi Ahli KItab, Dia menyebutkan dari ucapan mereka yang buruk, yang dapat mendorong orang-orang MUkmin yang mempunyai kecemburuan membela Rabb dan agamaNya, untuk memerangi mereka dengan sungguh-sungguh dan mengeluarkan segala daya untuk itu, Dia berfirman, “Orang-orang Yahudi berkata, ‘Uzair itu putra Allah’.” Meskipun ini bukanlah pendapat mayoritas mereka, akan tetapi ia diucapkan sekelompok dari mereka. Ini menunjukkan bahwa pada diri orang-orang Yahudi terdapat kejahatan dan kebusukan yang membuat mereka mengatakan ucapan yang merupakan kelancangan terhadap Allah dan pelecehan terhadap keagungan dan kebesaranNya. Dikatakan bahwa penyebab klaim mereka bahwa Uzair adalah putra Allah adalah manakala para raja menguasai Bani Israil dan mencerai beraikan mereka dengan buruk dan membunuh para pembawa Taurat, mereka mendapati Uzair menghapal Taurat atau menghapal mayoritas darinya, maka Uzair mendiktekan Taurat kepada mereka dari hapalannya dan mereka menulisnya, lalu mereka menganggapnya dengan anggapan yang buruk tersebut. Dan orang-orang Nasrani berkata Isa, “Putra Allah.” Allah berfirman, “Demikian itulah”, ucapan yang mereka ucapkan “dengan mulut mereka”, tanpa berpijak kepada bukti dan dalil, dan barangsiapa tidak peduli dengan apa yang diucapkan, maka tidak heran kalau dia mengucapkan apa pun, karena tidak ada akal dan agama yang mengerem ucapannya. Oleh karena itu DIa berfirman, “Mereka meniru”, yakni menyerupai dengan uacapan mereka itu “perkataan orang-orang kafir yang terdahulu.” Yakni ucapan orang-orang musyrik bahwa malaikat adalah anak wanita Allah, hati mereka serupa maka ucapan mereka pun sama-sama batilnya. “Dilaknati Allah lah mereka, bagaimana mereka sampai berpaling?” bagaimana mereka berpaling dari kebenaran murni dan sangat jelas kepada ucapan yang telah nyata kebatilannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 30: Setelah Allah Subhaanahu wa Ta'aala memerintahkan memerangi Ahli Kitab, Allah menyebutkan di antara perkataan mereka yang kotor yang mendorong kaum mukmin yang memiliki kecemburuan kepada Allah dan kepada agama mereka untuk memerangi mereka dan mengerahkan tenaga semampunya dala memerangi mereka. Ucapan ini meskipun tidak diucapkan oleh semua orang-orang Yahudi, namun diucapkan oleh sebagian mereka yang menunjukkan bahwa di dalam orang-orang Yahudi terdapat kekotoran dan keburukan yang membuat mereka berani berkata seperti ini dan mencacatkan keagungan Allah Subhaanahu wa Ta'aala. Ada yang berpendapat, bahwa sesbab mereka mengatakan Uzair putera Allah adalah karena ketika Allah memberikan kekuasaan kepada raja-raja untuk menguasa Bani Israil dan menghancurkan mereka sehancur-hancurnya, serta mereka bunuh para pemikul Taurat, lalu mereka menemukan ‘Uzair yang hapal kitab itu atau sebagian besarnya, lalu ia mengimla (mendikte)kan melalui hapalannya, dan orang-orang menyalinnya, maka mereka pun mengatakan kata-kata keji itu, Mahasuci Allah dari perkataan yang keji itu. Tanpa berdasar sama sekali. Yakni bertaqlid dengan mereka atau bertaqlid dengan orang-orang musyrik yang mengatakan bahwa para malaikat adalah puteri Allah, hati mereka sama sehingga ucapannya pun tidak jauh beda. Yakni bagaimana mereka bisa dipalingkan dari kebenaran padahal keterangan dan buktinya jelas. Sungguh aneh, mengapa umat yang besar bisa sepakat terhadap suatu perkataan yang jelas batilnya berdasarkan akal pikiran jika mereka mau berpikir. Sudah barang tentu, ada sebab yang membuat mereka berkata seperti itu, yaitu karena mereka menjadikan ulama mereka dan ahli ibadah mereka sebagai tuhan-tuhan selain Allah sebagaimana diterangkan dalam ayat selanjutnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 30",
    "description": "Ayat ini menerangkan sesatnya akidah ahli kitab. Dan orangorang yahudi berkata, uzair putra Allah, dan orang-orang nasrani berkata, al-masih putra Allah. Itulah ucapan yang keluar dari mulut mereka tanpa didasarkan pada dalil yang benar. Mereka meniru ucapan orang-orang kafir yang terdahulu, seperti perkataan musyrik mekkah bahwa malaikat adalah anak perempuan tuhan. Akibat ucapan dan keyakinan mereka yang sesat itulah Allah melaknat mereka. Memang, sungguh mengherankan bagaimana mung-kin mereka sampai berpaling dari agama yang benar, yaitu agama tau-hid, padahal para rasul telah datang kepada mereka silih berganti un-tuk menjelaskan tentang hal itu, juga dikuatkan dengan bukti-bukti rasional tentang keesaan Allah tersebut' tidak saja sesat akidah, mereka juga menjadikan orang-orang alim yahudi, dan rahib-rahibnya nasrani sebagai tuhan selain Allah, yaitu dengan mematuhi ajaran orang-orang alim dan para rahib itu dengan membabi buta, sekalipun mereka menyuruh berbuat maksiat, mengharamkan yang halal, dan menghalalkan yang haram, dan kaum nasrani juga menjadikan al-masih putra maryam sebagai tuhan; padahal mereka hanya disuruh menyembah tuhan yang maha esa; tidak ada tuhan selain dia. Mahasuci dia dari apa yang mereka persekutukan, baik menyangkut penyembahan, penciptaan, dan sifat-sifat-Nya."
  }
]