[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kaum Yahudi dan Nasrani telah menjadikan para ulama dan para ahli ibadah mereka sebagai tuhan-tuhan yang menggariskan hukum-hukum syariat bagi mereka, maka mereka memeganginya dengan teguh dan meninggalkan ajaran-ajaran Allah. Dan mereka telah menjadikan Al-masih isa putra Maryam sebagia sesembahan yang mereka sembah. Padahal sesungguhnya Allah telah memerintahkan mereka semua bertauhid dan beribadak kepada Tuhan Yang Satu, tiada sesembahan yang berhak di ibadahi kecuali Dia. Maha bersih dan Maha suci Allah dari apa yang dibuat-buat oleh pembela kesyirikan dan penganut kesesatan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "31. Orang-orang Yahudi menjadikan para ulama mereka dan orang-orang Nasrani menjadikan para rahib sebagai tuhan-tuhan selain Allah yang menghalalkan bagi mereka apa yang Allah haramkan dan mengharamkan bagi mereka apa yang Allah halalkan. Dan orang-orang Nasrani menjadikan Al-Masih Isa putra Maryam sebagai tuhan yang disembah bersama Allah. Padahal Allah tidak pernah menyuruh para ulama Yahudi, para rahib Nasrani, 'Uzair, dan Isa putra Maryam selain menyembah Allah semata dan tidak menyekutukan-Nya dengan sesuatu. Karena Allah -Subḥānahu- adalah Tuhan yang tunggal. Tidak ada yang berhak disembah selain Dia. Mahasuci Allah dari segala macam sekutu yang dikatakan oleh orang-orang musyrik dan lain-lain."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "31. Orang-orang Yahudi dan Nasrani berlebihan dalam bersikap terhadap para ulama, nabi, dan ahli ibadah mereka, sehingga menjadikan mereka sebagai tuhan selain Allah. Para ulama dan ahli ibadah mereka itu menghalalkan bagi mereka apa yang diharamkan Allah, dan mengharamkan apa yang dihalalkan Allah. Orang-orang Nasrani menjadikan Isa bin Maryam sebagai tuhan selain Allah. Padahal Allah tidak memerintahkan para ulama kaum Yahudi, para ahli ibadah kaum Nasrani, Uzair, dan Isa bin Maryam, melainkan untuk menyembah-Nya Semata tanpa menyekutukan-Nya dengan sesuatu apapun. Dia Maha Esa, tidak ada Tuhan yang berhak disembah selain Dia. Maha Suci Allah dari memiliki sekutu dalam sifat uluhiyah-Nya dengan berdoa kepada selain-Nya dan dalam sifat rububiyah-Nya dengan mentaati para pemimpin dalam menetapkan hukum tanpa izin-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "31. اتَّخَذُوٓا۟ أَحْبَارَهُمْ وَرُهْبٰنَهُمْ أَرْبَابًا مِّن دُونِ اللهِ (Mereka menjadikan orang-orang alimnya dan rahib-rahib mereka sebagai tuhan selain Allah) Dahulu jika orang-orang alim dan rahib-rahib mereka menghalalkan sesuatu maka mereka ikut menghalalkannya; dan jika mngharamkan sesuatu mereka ikut mengharamkannya. Mereka mentaati apa yang orang-orang alim dan rahib-rahib itu perintahkan dan larang meskipun menyelisihi hukum-hukum Allah, dan mereka menghapus hukum-hukum tersebut dari kitab-kitab-Nya, sehingga orang-orang Yahudi dan Nasrani seakan-akan menjadikan orang-orang alim dan rahib-rahib sebagai tuhan-tuhan karena mereka mentaati seperti ketaatan kepada tuhan. At-Tirmidzi mengeluarkan hadist dalam kitab sunannya dan menghukuminya sebagai hadist hasan dari ‘Ady bin Hatim, ia berkata: “aku mendatangi Rasulullah ketika beliau sedang membaca surat at-Taubah (اتَّخَذُوٓا۟ أَحْبَارَهُمْ وَرُهْبٰنَهُمْ أَرْبَابًا مِّن دُونِ اللهِ) lalu beliau berkata: sebenarnya mereka tidak menyembah orang-orang alim dan rahib-rahib mereka, namun apabila orang-orang alim dan rahib-rahib tersebut menghalalkan sesuatu maka mereka ikut menghalalkannya; dan jika mngharamkan sesuatu mereka ikut mengharamkannya”. وَالْمَسِيحَ ابْنَ مَرْيَمَ(dan (juga mereka mempertuhankan) Al Masih putera Maryam) Yakni orang-orang Nasrani menjadikannya sebagai tuhan yang disembah. Ayat ini mengisyaratkan bahwa orang-orang Yahudi tidak menjadikan ‘Uzair sebagai tuhan yang disembah. وَمَآ أُمِرُوٓا۟ إِلَّا لِيَعْبُدُوٓا۟ إِلٰهًا وٰحِدًا ۖ( padahal mereka hanya disuruh menyembah Tuhan yang Esa) Yakni orang-orang alim, rahib-rahib, Isa, dan ‘Uzair tidak diperintahkan kecuali untuk beribadah kepada Allah semata, maka bagaimana mereka bisa menjadi tuhan-tuhan? Atau bagaimana bisa pengikut-pengikut mereka menjadikan mereka sebagai tuhan-tuhan? سُبْحٰنَهُۥ عَمَّا يُشْرِكُونَ (Maha suci Allah dari apa yang mereka persekutukan) Sebagai penyucian untuk-Nya terhadap kesyirikan yang terjadi dalam ketaatan dan ibadah kepada-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "31. Orang-orang Yahudi menjadikan uskup-uskup mereka sebagai Tuhan selain Allah, begitu juga orang Nasrani menganggap pendeta mereka. Dimana Mereka menaati para uskup dan pendeta itu tentang segala yang mereka (pendeta dan uskup) halalkan dan haramkan. Dan orang-orang Nasrani mnenjadikan Isa sebagai anak Allah, Tuhan dan sesembahan, sedangkan Taurat dan Injil tidak memerintahkannya kecuali Tuhan yang Esa (Allah) bukan selainNya. Maha suci Allah dari apa yang mereka sekutukan berupa sekutu-sekutu yang ditaati dan disembah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka menjadikan para uskup mereka} orang-orang Yahudi menjadikan ulama’ mereka {dan para rahib mereka} orang-orang Nasrani menjadikan orang yang ahli ibadah di antara mereka {sebagai tuhan-tuhan selain Allah} sesembahan selain Allah. Mereka mengharamkan apa yang dihalalkan oleh Allah sehingga haram atas hal itu dan menghalalkan apa yang diharamkan oleh Allah sehingga mereka diperbolehkan atas itu {serta Al-Masih putra Maryam. Padahal mereka tidak diperintahkan kecuali untuk menyembah Tuhan Yang Maha Esa; tidak ada tuhan selain Dia. Maha suci Dia} Maha suci Dia {dari apa yang mereka persekutukan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "31. Ini, walaupun agak mengherankan jika ada umat besar bersepakat mengatakan endapat yang kebatilannya ditunjukkan oleh pemikiran ringan dan akal yang biasa-biasa saja, akan tetapi hal itu mempunyai sebab yaitu bahwa mereka “Menjadikan orang-orang alimnya,” yaitu ulama mereka, “dan rahib-rahib mereka,” yakni ahli ibadah yang berkonsentrasi hanya kepada ibadah “sebagai tuhan selain Allah.” Para alim dan rahib itu menghalalkan untuk mereka apa yang diharamkan Allah, lalu mereka mengikutinya, serta mensyariatkan syariat-syariat dan ucapan-ucapan yang bertentangan dengan agama para Rasul, dan mereka pun mengikutinya. Mereka juga bersikap berlebih-lebihan terhadap syiakh-syaikh dan ahli-ahli ibadah mereka dan mengagungkannya, menjadikan kuburan mereka sebagai tempat-tempat ibadah yang disembah selain Allah, serta dijadikan sebagai tempat untuk menyembelih kurban, berdoa, dan beristighatsah. “Dan (juga mereka mempertuhankan) al-Masih putra Maryam.” Mereka mengangkatnya sebagai tuhan selain Allah, mereka telah menyelisihi perintah Allah kepada mereka melalui lisan para RasulNya. “Padahal mereka hanya disuruh menyembah Rabb Yang Maha Esa, tidak ada Rabb (yang berhak disembah) selain Dia.” Agar mereka mengikhlaskan ibadah dan kecintaan dan doa, namun mereka mencampakkan perintah Allah dan menyekutukanNya dengan sesuatu yang Allah tidak menurunkan keterangan tentangnya. “Mahasuci Allah dari apa yang mereka persekutukan.” Mahasuci , Mahabersih, dan Mahatinggi keagunganNya dari kesyirikan dan kedustaan mereka, sesungguhnya perbuatan mereka itu berarti meremehkanNya dan menyifatiNya dengan apa yang tidak layak bagi keagunganNya, padahal Allah Mahatinggi dalam sifat dan perbuatanNya dari segala yang dinisbatkan kepadaNya yang bertentangan dengan kesucianNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 31: Maksudnya mereka mematuhi ajaran orang-orang alim dan rahib-rahib mereka dengan membabi buta, meskipun orang-orang alim dan rahib itu menyuruh berbuat maksiat atau mengharamkan yang halal atau mensyari’atkan sesuatu yang tidak disyari’atkan atau mengatakan kata-kata yang menyalai agama para rasul. Mereka juga berbuat ghuluw (berlebihan) terhadap para tokoh mereka dan memuliakan mereka secara berlebihan, serta menjadikan kuburan mereka sebagai sembahan-sembahan selain Allah, di mana kepadanya sembelihan, doa dan permohonan ditujukan. Inilah sebabnya mengapa Rasulullah shallallahu 'alaihi wa sallam melarang umatnya menjadikan kuburnya sebagai masjid. Dalam Taurat dan Injil, serta melalui lisan rasul-rasul."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 31",
    "description": "Tidak saja sesat akidah, mereka juga menjadikan orang-orang alim yahudi, dan rahib-rahibnya nasrani sebagai tuhan selain Allah, yaitu dengan mematuhi ajaran orang-orang alim dan para rahib itu dengan membabi buta, sekalipun mereka menyuruh berbuat maksiat, mengharamkan yang halal, dan menghalalkan yang haram, dan kaum nasrani juga menjadikan al-masih putra maryam sebagai tuhan; padahal mereka hanya disuruh menyembah tuhan yang maha esa; tidak ada tuhan selain dia. Mahasuci dia dari apa yang mereka persekutukan, baik menyangkut penyembahan, penciptaan, dan sifat-sifat-Nyadengan keyakinan dan akidah sesat yang tidak disadari itulah, mereka berusaha keras hendak memadamkan cahaya Allah, yaitu agama islam. Mereka akan melakukan dengan berbagai cara, baik dengan mulut, yakni ucapan-ucapan, maupun tindakan-tindakan, bahkan cara apa pun yang mereka yakini bisa memadamkan cahaya agama islam tersebut. Namun, Allah menolaknya, malah dia berkehendak menyempurnakan cahaya-Nya, yaitu dengan semakin meninggikan agama islam dan menolong rasulnya walaupun orang-orang kafir itu tidak menyukai islam menjadi besar."
  }
]