[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang kafir menghendaki dengan pendustaan mereka untuk menghilangkan agama islam dan membatalkan hujjah-hujjah Allah dan bukti-bukti nyata tentang keesaanNya yang dibawa oleh Muhammad . Dan Allah tidak menghendaki selain menyempurnakan agamaNYa dan menampakkannya serta meninggikan kalimatNya, meskipun orang-orang yang ingkar tidak menyukainya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "32. Orang-orang kafir itu dan orang-orang kafir lainnya ingin menghabisi dan merusak agama Islam dengan membuat berbagai macam kebohongan dan mendustakan ajaran yang dibawa oleh Muhammad -Ṣallallāhu ‘alaihi wa sallam. Dan mereka juga ingin merusak hujah-hujah yang jelas dan bukti-bukti yang nyata tentang keesaan Allah dan kebenaran agama yang dibawa oleh rasul-Nya. Tetapi Allah -Subḥānahu wa Ta'ālā- menolak keinginan mereka tersebut, sebab Dia ingin menyempurnakan, memenangkan, dan menjadikan agamanya unggul atas agama-agama lainnya, walaupun orang-orang kafir tidak menyukainya. Karena Allah yang menyempurnakannya, memenangkannya, dan menjadikannya unggul. Dan apabila Allah menghendaki sesuatu maka batallah apa yang dikehendaki oleh yang lain."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "32. Orang-orang Yahudi dan Nasrani ingin memadamkan cahaya Allah, yaitu agama Islam yang dibawa oleh setiap Rasul. Mereka ingin memadamkannya dengan tuduhan keji dan menghalanginya dengan kebatilan, seperti dengan perkataan mereka tentang Uzair dan Isa al-Masih dan hukum-hukum yang dibuat para pemimpin mereka sehingga ketauhidan menjadi kesyirikan. Namun Allah hanya menghendaki untuk menyempurnakan cahaya-Nya dengan mengutus Nabi Muhammad sebagai penutup para nabi dan utusan kepada seluruh manusia; dan menjadikan al-Qur’an sebagai mukjizat yang abadi dengan menjamin penjagaannya hingga akhir zaman; dan menjelaskan akidah-akidah dalam agama Islam yang manusia butuhkan dengan dalil-dalil. Demikianlah Allah memenangkan agama Islam, meski orang-orang yang ingkar itu tidak menyukainya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "32. يُرِيدُونَ أَن يُطْفِـُٔوا۟ نُورَ اللهِ بِأَفْوٰهِهِمْ (Mereka berkehendak memadamkan cahaya (agama) Allah dengan mulut (ucapan-ucapan) mereka) Ini merupakan kesesatan lainnya yang mereka lakukan, yaitu tuduhan-tuduhan bathil dan bantahan-bantahan sesat yang mereka ucapkan untuk melenyapkan kebenaran. وَيَأْبَى اللهُ إِلَّآ أَن يُتِمَّ نُورَهُۥ(dan Allah tidak menghendaki selain menyempurnakan cahaya-Nya) Yakni agama-Nya yang lurus yang menyinari orang-orang beriman ke jalan keselamatan dan kemenangan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Jika kamu melihat kebencian musuh-musuh Allah semakin keras kepada ummat islam, maka ingatlah firman Allah : { يُرِيدُونَ أَنْ يُطْفِئُوا نُورَ اللَّهِ بِأَفْوَاهِهِمْ وَيَأْبَى اللَّهُ إِلَّا أَنْ يُتِمَّ نُورَهُ وَلَوْ كَرِهَ الْكَافِرُونَ } \"Mereka berkehendak memadamkan cahaya (agama) Allah dengan mulut (ucapan-ucapan) mereka, dan Allah tidak menghendaki selain menyempurnakan cahaya-Nya, walaupun orang-orang yang kafir tidak menyukai\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "32. Dengan perkataan dan argumentasi palsu serta fitnah, para ahli kitab bermaksud memadamkan Al-Qur’an dan hidayahnya, serta Islam dan syariatnya. Dan Allah tidak berkehendak kecuali menampakkan dan meninggikan agamaNya yang lurus dan menyelamatkan rasulNya walaupun orang-orang kafir membenci hal tersebut"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka hendak memadamkan} memadamkan dan menghapus {cahaya Allah} agama Allah {dengan mulut-mulut mereka} dengan apa yang mereka ucapkan menggunakan lissan mereka {tetapi Allah menolaknya, justru menyempurnakan cahayaNya} meninggikan dan menampakkan agamaNya {walaupun orang-orang kafir itu tidak suka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "32. Maka ketika terbukti bahwa tidak ada hujjah atas apa yang mereka katakan, dan tidak ada bukti atas apa yang mereka letakkan, akan tetapi hanyalah ucapan dan kedustaan yang mereka ada-adakan, maka Allah mengabarkan bahwa, “mereka berkehendak,” dengan ini “memadamkan cahaya (agama) Allah dengan mulut (ucapan-ucapan) mereka.” Cahaya Allah adalah agamaNya yang dengannya Dia mengutus para Rasul dan menurunkan kitab-kitab. Allah menamakannya cahaya karena ia dijadikan sebagai cahaya penerang dalam kegelapan kebodohan dan agama-agama yang batil. Ia adalah ilmu dana mal dengan kebenaran, sedangkan selainnya adalah kebalikannya. Orang-orang Yahudi, Nasrani, dan orang-orang musyrikin lain yang menyerupai mereka ingin memadamkan cahaya Allah hanya dengan ucapan mereka yang sama sekali tak berdalil. “Dan Allah tidak menghendaki selain menyempurnakan cahayaNya”, karena itu adalah cahaya yang terang kuat, yang tidak mungkin bagi seluruh makhluk untuk memadamkannya meski mereka bersatu, sementara yang menurunkannya adalah pemegang ubun-ubun segenap hamba. Dan Dia menjamin menjaganya dari siapa pun yang ingin berbuat jahat kepadanya. Oleh karena itu, Dia berfirman, “Dan Allah tidak menghendaki selain menyempurnakan cahayaNya walaupun orang-orang kafir tidak menyukai,” dan berusaha dengan keras dalam menolak dan membatalkannya, sesungguhnya usaha mereka tidak akan memudaratkan kebenaran sedikit pun."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 32: Setelah jelas, bahwa mereka tidak memiliki hujjah terhadap apa yang mereka katakan dan tidak memiliki keterangan yang mereka jadikan sebaai pijakan, bahkan perkataan itu hanya semata-mata mengada-ada dan membuat kedustaan, maka dalam ayat ini Allah Subhaanahu wa Ta'aala memberitahukan, bahwa mereka ingin memadamkan cahaya Allah dengan mulut-mulutnya. Cahaya di sini adalah agama-Nya yang disampaikan oleh para rasul-Nya, dan yang disebutkan dalam kitab-kitab yang diturunkan-Nya, berupa syari’at dan penguatnya (bukti-buktinya). Allah menamainya sebagai cahaya, karena ia merupakan cahaya yang menerangi gelapnya kebodohan dan agama-agama yang batil. Agama tersebut mengandung pengetahuan terhadap kebenaran dan pengamalannya, adapun selainnya adalah kesesatan. Nah, orang-orang Yahudi, Nasrani dan orang-orang yang serupa dengan mereka yang terdiri dari kaum musyrik ingin memadamkan cahaya Allah melalui perkataan mereka yang sama sekali tidak memiliki dasar. Meskipun mereka berkumpul bersama untuk memadamkanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 32",
    "description": "Dengan keyakinan dan akidah sesat yang tidak disadari itulah, mereka berusaha keras hendak memadamkan cahaya Allah, yaitu agama islam. Mereka akan melakukan dengan berbagai cara, baik dengan mulut, yakni ucapan-ucapan, maupun tindakan-tindakan, bahkan cara apa pun yang mereka yakini bisa memadamkan cahaya agama islam tersebut. Namun, Allah menolaknya, malah dia berkehendak menyempurnakan cahaya-Nya, yaitu dengan semakin meninggikan agama islam dan menolong rasulnya walaupun orang-orang kafir itu tidak menyukai islam menjadi besar. Bukan saja dia meninggikan agama islam, tetapi dia juga yang telah mengutus rasul-Nya dengan membawa petunjuk, yakni Al-Qur'an, yang berisi berita-berita yang benar serta bukti-bukti nyata tentang keesaan Allah, dan agama yang benar, yakni sikap keberagamaan yang lurus yang membawa manfaat, baik di dunia maupun di akhirat, untuk diunggulkan atas segala agama baik agama-agama yang lebih dulu ada, maupun agama-agama baru yang diciptakan oleh manusia, walaupun terhadap kenyataan itu orang-orang musyrik tidak menyukai-Nya."
  }
]