[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Pada hari kiamat akan diletakkan lempengen-lempengan emas dan perak di dalam neraka. Apabila panasnya sudah membara, maka dibakarlah dengannya dahi-dahi, lambung-lambung, dan punggung-punggung mereka, dan dikatakan kepada mereka sebagai celaan bagi mereka, ”ini adalah harta yang dulu kalian tahan dan kalian menolak mengeluarkan hak-hak Allah darinya, maka rasakanlah siksaan pedih ini dikarenakan kalian menimbun dan menahannya,"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "35. Pada hari Kiamat nanti apa yang mereka kumpulkan dan tidak mereka bayarkan kewajibannya itu akan dipanaskan di dalam Neraka Jahanam. Kemudian jika sudah sangat panas akan diletakkan di kening mereka, di lambung mereka, dan di punggung mereka. Dan mereka akan dicela dengan kata-kata, \"Inilah harta kalian yang tidak kalian bayarkan kewajibannya. Maka rasakanlah akibat dari apa yang kalian kumpulkan dan tidak kalian tunaikan kewajibannya.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "35. Pada hari kiamat mereka akan dibakar di neraka Jahannam dengan apa yang mereka kumpulkan itu. Apabila harta itu telah menjadi sangat panas, maka akan diletakkan pada dahi, pinggang, dan punggung mereka; dan akan dikatakan kepada mereka sebagai olokan: “Inilah harta yang dahulu kalian kumpulkan, namun tidak kalian tunaikan zakatnya, maka rasakanlah akibatnya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "35. يَوْمَ يُحْمَىٰ عَلَيْهَا فِى نَارِ جَهَنَّمَ (pada hari dipanaskan emas perak itu dalam neraka jahannam) Yakni neraka dinyalakan dengan hal tersebut, dan ia memiliki panas yang tinggi. Mereka disiksa dengan siksaan yang sesuai dengan kemaksiatan mereka, yaitu dengan disetrika menggunakan harta mereka yang dipanaskan dengan panas yang paling tinggi. هٰذَا مَا كَنَزْتُمْ لِأَنفُسِكُمْ (Inilah harta bendamu yang kamu simpan untuk dirimu sendiri) Yakni akan dikatakan kepada mereka: “inilah harta yang kalian simpan untuk kalian ambil manfaatnya, dan inilah manfaatnya!”. Ini dikatakan sebagai bentuk olokan dan hinaan bagi mereka. فَذُوقُوا۟ مَا كُنتُمْ تَكْنِزُونَ(maka rasakanlah sekarang (akibat dari) apa yang kamu simpan itu) Yakni rasakanlah akibatnya. Ibnu Umar menanggapi ayat ini dengan mengatakan: “sesungguhnya hal ini berlaku sebelum disyariatkan zakat, setelah disyariatkan zakat Allah menjadikannya sebagai penyuci harta”. Kemudian ia melanjutkan “aku tidak peduli (berapa banyak hartaku) seandainya aku memiliki emas sebesar gunung Uhud maka aku telah mengetahui jumlahnya sehingga aku bisa mengeluarkan zakat darinya kemudian aku memakai sisanya untuk ketaatan kepada Allah."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Bagaimana mungkin seseorang menahan zakat dari hartanya sedangkan dia membaca firman Allah : { يَوْمَ يُحْمَىٰ عَلَيْهَا فِي نَارِ جَهَنَّمَ فَتُكْوَىٰ بِهَا جِبَاهُهُمْ وَجُنُوبُهُمْ وَظُهُورُهُمْ } \"Pada hari dipanaskan emas perak itu dalam neraka jahannam, lalu dibakar dengannya dahi mereka, lambung dan punggung mereka\" tidakkah mereka takut akan siksa dari Allah ?."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "35. Pada hari dimana harta yang mereka kumpulkan dalam neraka Jahanam yang sangat panas, lalu dahi, lambung dan punggung mereka dibakar dengannya (harta yang dipanaskan). Dan dikatakan kepada mereka dengan ejekan dan hinaan: “Inilah yang kalian timbun, silahkan kalian nikmati, lalu rasakanlah azab dan akibat dari harta yang kalian kumpulkan tanpa menunaikan zakatnya, karena setiap harta itu harus ditunaikan zakatnya, bukan ditimbun”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Pada hari ketika hal itu dipanaskan} timbunan itu dipanaskan {dalam neraka Jahanam lalu disetrikakan} dibakarkan {dengan timbunan itu pada dahi, lambung, dan punggung mereka. “Inilah apa yang dahulu kalian timbun} apa yang kalian kumpulkan {untuk diri sendiri. Maka rasakanlah apa yang selama ini kalian simpan”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "35. Kemudian Allah menafsirkannya dengan FirmanNya, “Pada hari dipanaskan” yaitu pada harta mereka “dalam Neraka Jahanam”, setiap dinar dan emas dipanaskan sedemikian rupa, “lalu dibakar dengannya dahi mereka, lambung dan punggung mereka,” pada Hari Kiamat. Setiap kali ia dingin, siksa itu dilakukan kembali pada hari yang lamanya seperti lima puluh ribu tahun (di dunia), maka dikatakan kepada mereka dengan celaan dan hinaan. “INilah harta bendamu yang kamu simpan untuk dirimu sendiri, maka rasakanlah sekarang (akibat dari) apa yang kamu simpan itu.” Allah tidak menzhalimimu, akan tetapi kamulah yang menzhalimi dirimu sendiri dan disiksa dengan kekayaan ini. Dalam dua ayat ini Allah menyebutkan penyimpangan manusia pada hartanya, yaitu dengan satu dari dua hal: bisa dengan membelanjakannya dalam kebatilan yang tidak bermanfaat apa pun, justru yang didapatkan hanyalah mudarat semata, seperti dengan membelanjakan harta dalam memuaskan nafsu dan kemaksiatan yang tidak mendukung ketaatan kepada Allah, dan mengeluarkannya untuk menghalang-halangi dari jalan Allah, bisa pula dengan tidak menafkahkannya pada hal yang bersifat wajib, dan larangan terhadap sesuatu merupakan perintah kepada kebalikannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 35: Rasulullah shallallahu 'alaihi wa sallam bersabda, مَا مِنْ صَاحِبِ ذَهَبٍ وَلَا فِضَّةٍ لاَ يُؤَدِّيْ مِنْهَا حَقَّهَا إِلاَّ إِذَا كاَنَ يَوْمُ اْلقِيَامَةِ صُفِّحَتْ لَهُ صَفَائِحُ مِنْ نَارٍ فَأُحْمِيَ عَلَيْهَا فِيْ نَارِ جَهَنَّمَ فَيُكْوَى بِهَا جَنْبُهُ وَجَبِيْنُهُ وَظَهْرُهُ كُلَّمَا بَرَدَتْ أُعِيْدَتْ لَهُ فِي يَوْمٍ كَانَ مِقْدَارُهُ خَمْسِيْنَ أَلْفَ سَنَةٍ حَتَّى يُقْضَى بَيْنَ اْلعِبَادِ “Tidaklah pemilik emas maupun perak yang enggan membayar zakatnya kecuali pada hari kiamat akan dibuatkan untuknya lempengan-lempengan dari api, lalu dipanaskan kemudian dibakarkan dahi, lambung dan punggungnya dengannya. Setiap kali menjadi dingin, maka diulangi lagi dalam sehari yang lamanya 50.000 tahun sampai diputuskan masalah di kalangan manusia.” (HR. Muslim) Dalam kedua ayat di atas, Allah Subhaanahu wa Ta'aala menyebutkan penyimpangan manusia dalam hartanya, yaitu dengan mengeluarkannya untuk yang batil, seperti untuk maksiat atau mengeluarkannya untuk menghalangi manusia dari jalan Allah, atau dengan menahan hartanya dengan tidak mengeluarkannya pada yang wajib, seperti zakat dan nafkah yang wajib."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 35",
    "description": "Ayat ini menjelaskan azab yang diancamkan kepada para pemimpin ahli kitab dan siapa saja yang kikir sebagaimana mereka. Ingatlah, pada hari ketika emas dan perak dipanaskan dalam neraka jahanam, lalu dengan itu disetrika dahi, lambung dan punggung mereka, yakni orang-orang kaya yang tidak dermawan, seraya dikatakan kepada mereka, inilah harta bendamu yang kamu simpan untuk dirimu sendiri. Dengan harta itu, bukan saja kamu tidak menunaikan zakatnya, namun juga tidak kamu manfaatkan untuk membantu mereka yang membutuhkan, maka rasakanlah akibat dari apa yang kamu simpan itu. Ancaman ini berlaku umum, yaitu ditujukan kepada siapa saja yang dikaruniai harta banyak namun kikir. Islam memang membolehkan umatnya untuk mengumpulkan harta sebanyak-banyaknya, tetapi pada saat yang sama ia juga harus bersifat dermawan. Setelah ayat yang lalu menjelaskan keburukan akidah para tokoh ahli kitab, maka ayat ini kembali menginformasikan keburukan perilaku kaum musyrik, yakni mengubah hukum Allah. Di antara hukum Allah yang diubah adalah menambah hitungan bulan dalam setahun. Ayat menyatakan, bahwa sesungguhnya jumlah bulan menurut Allah dalam satu tahun ialah dua belas bulan dengan mengikuti perputaran bulan, sebagaimana dalam ketetapan Allah sejak penciptaan alam ini, yakni pada waktu dia menciptakan langit dan bumi. Di antaranya, yakni dua belas bulan tersebut, ada empat bulan haram atau yang dimuliakan, yaitu zulqa'dah, zulhijjah, muharram, dan rajab. 1 itulah ketetapan agama yang lurus, yaitu bahwa empat bulan yang dimuliakan itu sesuai dengan sistem yang telah ditetapkan oleh Allah dan menjadi syariat agama-Nya, maka janganlah kamu menzalimi dirimu, baik melakukan peperangan (lihat : surah al-baqarah/2: 217), maupun perbuatan dosa lainnya, terlebih lagi dalam bulan yang empat itu, karena dosanya akan dilipatgandakan. Namun, larangan peperangan di bulan-bulan haram ini lalu dinasakh atau dihapus hukumnya dengan firman-Nya, dan perangilah kaum musyrik semuanya, sebagaimana mereka pun memerangi kamu semuanya di mana saja dan kapan saja meski bertepatan dengan empat bulan yang semestinya dilarang untuk berperang itu. Dan ketahuilah bahwa Allah beserta orang-orang yang takwa."
  }
]