[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya bilangan bulan-bulan dalam hukum Allah dan dalam catatan yang tertulis di lauhil mahfuzh ada dua belas bulan, pada hari Allah menciptakan langit dan bumi. Diantaranya ada empat bulan haram yang Allah mengharamkan peperangan di dalamnya, (yaitu bulan, dzulqadah, dzulhijjah, muharam, dan rajab). Demikianlah agama yang lurus. Maka janganlah kalian menzholimi diri kalian di dalam bulan-bulan tersebut lantaran tingkat keharamannya bertambah dan dikarenakan perbuatan zhalim padanya lebih parah dibandingkan bulan lainnya, bukan berarti kezhaliman di bulan lain boleh. Dan perangilah kaum musyrikin semuanya sebagaimana mereka telah memerangi kalian semua. Dan ketahuilah, bahwa sesungguhnya Allah bersama orang-orang yang bertakwa dengan dukungan dan pertolonganNYa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "36. Sesungguhnya jumlah bulan dalam setahun menurut keputusan dan ketentuan Allah ialah dua belas bulan. Tidak kurang dan tidak lebih. Itulah yang ditetapkan Allah di dalam Loh Mahfuz pada awal Dia menciptakan langit dan bumi. Di antara dua belas bulan itu ada empat bulan haram. Yaitu bulan-bulan yang di dalamnya perang diharamkan oleh Allah. Tiga bulan di antaranya berurutan, yakni Zulkaidah, Zulhijah dan Muharram, dan satu bulan terpisah, yakni Rajab. Hal tersebut yaitu jumlah bulan dalam setahun dan larangan berperang pada empat bulan di antaranya merupakan ajaran agama yang lurus. Maka janganlah kalian menzalimi diri sendiri dengan mengobarkan perang pada bulan-bulan haram itu dan menginjak-injak kehormatannya. Perangilah orang-orang musyrik semuanya sebagaimana mereka memerangi kalian semuanya. Dan ketahuilah bahwa Allah bersama dengan orang-orang yang takut kepada-Nya dengan menjalankan perintah-Nya dan menjauhi larangan-Nya melalui pertolongan dan dukungan-Nya. Dan jika Allah sudah bersamanya niscaya tidak ada seorang pun yang dapat mengalahkannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "36. Sesungguhnya jumlah bulan dalam satu tahun dalam ketetapan Allah adalah dua belas bulan. Allah menetapkannya di lauhul mahfuzh pada pertama kali diciptakannya langit dan bumi. Dan di antara dua belas bulan itu terdapat empat bulan haram, Allah mengharamkan peperangan pada waktu tersebut; yaitu tiga bulan berurutan, Dzulqa’dah, Dzulhijjah, dan Muharram; dan satu bulan lagi Rajab. Kabar agung yang disebutkan ini, berupa jumlah dua belas bulan dan pengharaman empat bulan di antaranya, adalah ketetapan agama yang lurus; maka janganlah kalian menzalimi diri kalian dengan melakukan peperangan pada empat bulan haram itu dan menodai kehormatannya. Dan perangilah orang-orang musyrik seluruhnya, sebagaimana mereka memerangi kalian semua. Dan ketahuilah bahwa Allah menyertai dengan pertolongan-Nya orang-orang yang bertakwa dengan menjalankan perintah-Nya dan menjauhi larangan-Nya, dan barangsiapa yang Allah menyertainya niscaya tidak akan dikalahkan siapapun."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "36. إِنَّ عِدَّةَ الشُّهُورِ (Sesungguhnya bilangan bulan) Yakni jumlah bulan dalam setahun. عِندَ اللهِ(pada sisi Allah) Yakni dalam ketatapan, qadha, dan hikmah Allah. اثْنَا عَشَرَ شَهْرًا فِى كِتٰبِ اللهِ(adalah dua belas bulan, dalam ketetapan Allah) Yakni yang ditetapkan Allah dalam kitab-Nya. يَوْمَ خَلَقَ السَّمٰوٰتِ وَالْأَرْضَ(di waktu Dia menciptakan langit dan bumi) Yakni yang tetap dalam ilmu-Nya diawal penciptaan alam semesta. مِنْهَآ أَرْبَعَةٌ حُرُمٌ ۚ( di antaranya empat bulan haram) Yakni bulan Dzul Qa’dah, Dzul Hijjah, Muharram, dan Rajab. Tiga bulan secara berturut-turut dan sebulan lainnya tersendiri. ذٰلِكَ الدِّينُ الْقَيِّمُ ۚ( Itulah (ketetapan) agama yang lurus) Yakni ketetapan jumlah bulan dengan jumlah sekian dan diantaranya terdapat empat bulan haram merupakan bagian dari agama yang lurus, perhitungan yang benar, dan jumlah yang sempurna. فَلَا تَظْلِمُوا۟ فِيهِنَّ أَنفُسَكُمْ ۚ( maka janganlah kamu menganiaya diri kamu dalam bulan yang empat itu) Yakni dalam bulan-bulan haram ini, dengan melakukan peperangan didalamnya dan melanggar kehormatannya. Larangan berperang di bulan-bulan haram masih berlaku dan tidak dinasakh dengan dalil dari ayat ini. وَقٰتِلُوا۟ الْمُشْرِكِينَ كَآفَّةً(dan perangilah kaum musyrikin itu semuanya) Yakni seluruhnya. كَمَا يُقٰتِلُونَكُمْ كَآفَّةً (sebagaimana merekapun memerangi kamu semuanya) Yakni seluruhnya. وَاعْلَمُوٓا۟ أَنَّ اللهَ مَعَ الْمُتَّقِينَ(dan ketahuilah bahwasanya Allah beserta orang-orang yang bertakwa) Yakni menolong dan meneguhkan mereka. Dan barangsiapa yang bersama Allah niscaya ia akan menang dan mendapat balasan yang baik."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Ibnu 'Abbas berkata : dari bulan-bulan itu Allah mengkhususkan empat bulan, yaitu : Dzul qa'dah, Dzul hijjah, Muharram, Rajab, Alla menjadikan mereka bulan-bulan yang suci dan kesuciannya begitu diagungkan, dan menjadikan dosa di dalamnya juga besar, sebagaiman Dia menjadikan amal shalih dan balasannya lebih besar. 2 ). Qhatdah berkata pada firman Allah tentang bulan-bulan haram : { فَلَا تَظْلِمُوا فِيهِنَّ أَنْفُسَكُمْ } \"maka janganlah kamu menganiaya diri kamu dalam bulan yang empat itu\" sesungguhnya kezhaliman pada bulan-bulan haram adalah kesalahan yang paling besar dibandingkan pada bulan-bulan lainnya, walaupun semua kezhaliman adalah dosa yang besar, namun Allah berhak membesarkan suatu perkara sesuka-Nya. 3 ). Sepuluh Dzul hijjah adalah hari-hari yang paling agung diantara bulan-bulan haram, dan diantara kezhaliman pada diri sendiri adalah : menyia-nyiakan hari itu dengan perbuatan yang tidak mendekatkan seseorang kepada Allah, Hasan al-bashri berkata : \"Saya berjumpa dengan kaum yang waktu mereka lebih berharga daripada dinar dan dirham yang kalian simpan\" 4 ). Bukanlah muslim yang sejati ketika masuk padanya bulan-bulan yang suci ini, namun ia tidak memanfaatkan kebaikan di dalamnya, melainkan ia merusakanya dengan maksiat, dan menantang ketentuan Allah. 5 ). Pernahkah kamu melihat orang yang menzhalimi dirinya sendiri ? ya.. kamu akan melihat orang yang menerobos kesucian satu zaman yang Allah telah melarang kezhaliman terjadi di dalamya, sedang mereka tidak peduli dengan larangan itu, maka sungguh kerugian dan kerusakan akan berlaku pada dirinya sendiri."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "36. Sesungguhnya jumlah bulan pada tahun qamariah dalam aturan dan ketentuan Allah itu 12 bulan yang telah ditetapkan dalam kitabNya (Lauhil Mahfudz) dan ilmunya tentang bulan-bulan itu tetap teguh sejak awal penciptaan alam. Di antara bulan-bulan ini, terdapat 4 bulan yang disucikan dan diagungkan dimana peperangan dilarang di dalamnya, kemudian pengharaman itu ditetapkan. Bulan-bulan itu adalah Dzulqa’dah, Dzulhijjah, Muharram, dan Rajab. 3 hal yang disebutkan berturut-turut dan satu disebutkan sendiri. Pembagian terkait bulan dan pengharaman (perang) dalam 4 bulan tersebut adalah ketetapan yang lurus dan perhitungan yang sudah benar, maka janganlah kalian menzalimi diri sendiri dalam bulan-bulan haram ini dengan memulai peperangan, dan tidak menghormatinya dengan berbuat maksiat karena sesungguhnya Allah mengagungkannya. Dan perangilah semua orang musyrik dalam peperangan yang disyariatkan sebagaimana mereka memerangi kalian semua. Dan ketahuilah bahwa Allah itu menolong dan membantu orang-orang yang bertakwa, dan barang siapa mendapat pertolongan dan dukungan Allah, niscaya dia akan menjadi pemenang. Keterangan ayat {Wa qaatilul musyrikiina…} adalah pembolehan memerangi mereka di semua bulan sampai tiba bulan-bulan haram, Ayat-ayat pengharaman perang pada bulan-bulan haram di surah Al-Baqarah [194, 217] dan surah Al-Maidah ayat 2 disalin lagi dalam ayat-ayat surah At-Taubah, karena diturunkan 2 tahun setelah surah Al-Baqarah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya bilangan} jumlah {bulan di sisi Allah iitu dua belas bulan, di dalam ketetapan Allah} Lauhil Mahfuz {pada hari ketika Dia menciptakan langit dan bumi, di antaranya ada empat bulan haram} empat bulan dimana Allah mengharamkan peperangan di dalamnya, yaitu Rajab, Dzulqa’dah, Dzulhijjah, dan Muharram {Itulah agama yang lurus} yang lurus {maka janganlah menzalimi diri kalian pada bulan itu, dan perangilah orang-orang musyrik semuanya} semuanya {sebagaimana mereka pun memerangi kalian semuanya. Ketahuilah bahwa sesungguhnya Allah bersama orang-orang yang bertakwa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "36. Allah berfirman, “Sesungguhnya bilangan bulan pada sisi Allah,” yakni dalam keputusan dan takdirNYa, “ialah dua belas bulan,” yaitu bulan-bulan yang dikenal ini “dalam ketetapan Allah,” yakni hukum takdirNya “di waktu Dia menciptakan langit dan bumi,” dan memberlakukan siang dan malam serta menentukan waktu-waktunya, lalu DIa membaginya menjadi dua belas bulan ini. “Dia antaranya empat bulan haram.” Yaitu Rajab, Dzulqa’dah, Dzulhijjah, dan Muharram, dinamakan Haram karena kesucian dan kehormatannya yang lebih dan karena diharamkannya perang di dalamnya. “Janganlah kamu menganiaya diri kamu dalam bulan yang empat itu.” Ada kemungkinan kata gantinya kembali kepada dua belas bulan itu, dan bahwa Allah menjelaskan bahwa Dia menjadikannya sebagai ukuran bagi manusia, dan agar ia diramaikan dengan ketaatan, agar Allah disyukuri karena nikmatNYa padanya, dan pemberlakuan bulan-bulan tersebut untuk kemaslahatan manusia, maka hendaknya kamu berhati-hati dalam menzhalimi diri sendiri di dalamnya. Ada kemungkinan pula kata gantinya kembali kepada empat bulan Haram, bahwa ini adalah larangan khusus bagi mereka dari berbuat aniaya di dalamnya, ditambah dengan larangan terhadap kezhaliman disetiap waktu, karena pengharamannya yang lebih di mana kezhaliman padanya lebih berat daripada di selainnya, dan di antaranya adalah larangan berperang di dalamnya menurut pendapat yang menyatakan bahwa pengharaman berperang di bulan-bulan Haram tidak di nasakh dalam rangka mengamalkan dalil-dalil yang umum yang mengharamkan perang di dalamnya, ada pula yang berkata bahwa pengharaman perang di bulan Haram telah dinasakh dengan mengambil keumuman Firman Allah, “Dan perangilah kaum musyrikin itu semuanya sebagaimana mereka pun memerangi kamu semuanya.” Yakni perangilah semua jenis orang-orang musyrik dan orang-orang yang kafir kepada Rabb semesta alam tanpa pandang bulu, akan tetapi anggaplah semuanya sebagai musuhmu sebagaimana mereka bersikap kepadamu, mereka menganggap orang-orang yang beriman sebagai musuh di mana mereka selalu ingin menimpakan keburukan kepadamu. Ada juga kemungkinan bahwa “Kaaffah” adalah hal dari wawu (pada kata qootiluu) jadi maknanya adalah perangilah olehmu semua orang-orang musyrik, jadi kewajiban berperang berlaku atas semua kaum Muslimin, dan menurut kemungkinan ini ia dinasakh oleh FirmanNya, \"Tidak sepatutnya bagi mukminin itu pergi semuanya (ke medan perang). Mengapa tidak pergi dari tiap-tiap golongan di antara mereka beberapa orang untuk memperdalam pengetahuan mereka tentang agama dan untuk memberi peringatan kepada kaumnya apabila mereka telah kembali kepadanya, supaya mereka itu dapat menjaga dirinya.\" (At-Taubah:122). “Dan ketahuilah bahwasanya Allah beserta orang-orang yang bertakwa,” dengan pertolonganNYa, kemenaganNYa, dan dukunganNYa. Hendaknya kamu selalu bertakwa dan taat kepada Allah dalam urusanmu yang rahasia dan yang terang-terangan, khususnya pada saat perang melawan orang-orang kafir, karena bisa jadi dalam kondisi tersebut seorang Mukmin meninggalkan ketakwaan kepada Allah dalam bersikap terhadap orang-orang kafir yang merupakan musuh yang memerangi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 36: Yakni dalam qadha’ dan qadar-Nya. Maksudnya dalam ketetapan qadari (ketentuan sejak zaman ajali)-Nya. Dan diperjalankan-Nya malam dan siang serta ditentukan waktu-waktunya lalu dibagi-Nya menjadi dua belas bulan. Yaitu bulan Rajab, Zulkaidah, Zulhijjah dan Muharram. Bulan ini dinamakan bulan haram (suci) untuk memperkuat kesuciannya dan haramnya berperang di bulan itu. Maksudnya janganlah kamu menganiaya dirimu dengan mengerjakan perbuatan yang dilarang atau melakukan maksiat pada bulan itu karena dosanya lebih besar, termasuk menganiaya diri adalah melanggar kehormatan bulan itu dengan mengadakan peperangan. Dhamir (kata ganti) dalam kata “fiihinna” kembalinya bisa kepada dua belas bulan itu atau kepada empat bulan itu. Jika kembalinya kepada dua belas bulan itu, maka maksudnya Allah Ta’ala menjadikan bulan-bulan itu sebagai ukuran waktu bagi hamba dan agar diisi dengan ketaatan dan sikap syukur kepada-Nya serta dijadikan-Nya untuk maslahat hamba, oleh karena itu hendaknya mereka berhati-hati dengan tidak berbuat zalim di bulan-bulan itu. Dhamir tersebut bisa juga kembalinya kepada empat bulan haram, yakni sebagai larangan bagi mereka berbuat zalim di bulan itu meskipun kezaliman di bulan apa saja terlarang, namun di bulan-bulan itu lebih terlarang lagi, termasuk di antara yang terlarang itu adalah berperang di bulan itu menurut mereka yang berpendapat bahwa berperang pada bulan haram tidak dimansukh keharamannya berdasarkan nash-nash umum yang melarang berperang pada bulan itu. Namun di antara ulama ada pula yang berpendapat, bahwa keharaman berperang pada bulan-bulan itu sudah mansukh berdasarkan keumuman ayat, “Wa qaatilul musyrikiina kaaffaf…dst.” Yakni perangilah semua orang musyrik dan kafir. Kata-kata “semuanya” atau kaffah bisa maksudnya semua orang musyrik atau kafir, dan bisa sebagai hal (keadaan), yakni perangilah orang-orang musyrik dalam keadaan bersama-sama oleh semua kaum mukmin. Namun makna seperti ini mansukh dengan ayat, “wa maa kaanal mu’minuuna liyanfiruu kaaffah…dst” (surat At Taubah: 122) Pada semua bulan. Dengan memberikan pertolongan dan bantuan. Oleh karena itu, tetaplah bertakwa kepada Allah baik dalam keadaan sembunyi-sembunyi maupun terang-terangan, terlebih ketika memerangi orang-orang kafir karena terkadang seorang mukmin meninggalkannya ketika menyikapi orang-orang kafir yang memerangi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 36",
    "description": "Setelah ayat yang lalu menjelaskan keburukan akidah para tokoh ahli kitab, maka ayat ini kembali menginformasikan keburukan perilaku kaum musyrik, yakni mengubah hukum Allah. Di antara hukum Allah yang diubah adalah menambah hitungan bulan dalam setahun. Ayat menyatakan, bahwa sesungguhnya jumlah bulan menurut Allah dalam satu tahun ialah dua belas bulan dengan mengikuti perputaran bulan, sebagaimana dalam ketetapan Allah sejak penciptaan alam ini, yakni pada waktu dia menciptakan langit dan bumi. Di antaranya, yakni dua belas bulan tersebut, ada empat bulan haram atau yang dimuliakan, yaitu zulqa'dah, zulhijjah, muharram, dan rajab. 1 itulah ketetapan agama yang lurus, yaitu bahwa empat bulan yang dimuliakan itu sesuai dengan sistem yang telah ditetapkan oleh Allah dan menjadi syariat agama-Nya, maka janganlah kamu menzalimi dirimu, baik melakukan peperangan (lihat : surah al-baqarah/2: 217), maupun perbuatan dosa lainnya, terlebih lagi dalam bulan yang empat itu, karena dosanya akan dilipatgandakan. Namun, larangan peperangan di bulan-bulan haram ini lalu dinasakh atau dihapus hukumnya dengan firman-Nya, dan perangilah kaum musyrik semuanya, sebagaimana mereka pun memerangi kamu semuanya di mana saja dan kapan saja meski bertepatan dengan empat bulan yang semestinya dilarang untuk berperang itu. Dan ketahuilah bahwa Allah beserta orang-orang yang takwa setelah menjelaskan jumlah bulan dalam setahun dan di antaranya ada empat bulan yang dimuliakan, maka ayat ini mengecam mereka yang menambah bilangan dan memutarbalikkan bulan-bulan haram atau mengundur-undurnya. Sesungguhnya pengunduran bulan haram, sebagaimana kebiasaan orang-orang arab saat itu yang secara sengaja mengganti posisi muharram dengan bulan safar agar bisa berperang, itu hanya menambah kekafiran di samping kekufuran yang selama ini mereka lakukan. Orang-orang kafir disesatkan oleh setan dan para pemuka-pemukanya dengan pengunduran itu, mereka menghalalkannya yakni mengundur-undurkannya suatu tahun dan mengharamkannya pada suatu tahun yang lain. Mereka melakukan pengunduran ini agar dapat menyesuaikan dengan bilangan bulan-bulan yang diharamkan Allah, sekaligus mereka menghalalkan apa yang diharamkan Allah, yakni berperang di bulan-bulan haram juga perbuatan dosa lainnya. Padahal, perbuatan-perbuatan buruk tersebut dijadikan terasa indah oleh setan bagi mereka. Dan Allah tidak memberi petunjuk, yakni bimbingan agar selalu berada di jalan yang benar, kepada orang-orang yang kafir, yaitu mereka yang terus-menerus berada di jalan kekufuran."
  }
]