[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya budaya yang dahulu dilakukan oleh bangsa arab dimasa jahiliyah, berupa penghormatan terhadap empat bulan dalam setahun, dengan menghormati jumlahnya yang empat saja, tanpa menentukannya dengan nama-nama bulan yang telah Allah haramkan, dimana mereka mengundurkan sebagiannya dan memajukan sebagian yang lain dan menggantikannya dengan bulan-bulan yang halal yang mereka kehendaki, sesuai dengan kebutuhan mereka terhadap peprangan, sesungguhnya tindakan tersebut merupakan bentuk tambahan dalam kekafiran. Dengan itu, setan menyesatkan orang-orang kafir. Mereka menghalalkan bulan-bulan yang mereka tunda pengharamannya dari bulan-bulan yang empat dalam satu tahun, dan mengharamkannya pada tahun yang lain, tujuannya agar mereka dapat menyelaraskannya dengan jumlah empat bulan, akiibatnya mereka menghalalkan apa yang diharamkan Allah. Setan telah menjadikan mereka memandang baik terhadap perbuatan-perbuatan buruk. Dan Allah tidak memberikan taufik kepada kaum kafir menuju kebenaran dan jalan lurus."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "37. Sesungguhnya menunda keharaman bulan haram ke bulan lain yang tidak haram dan menjadikannya sebagai penggantinya (seperti yang dilakukan oleh orang-orang Arab di masa Jahiliah) merupakan kekafiran yang menambah kekafiran mereka kepada Allah. Karena mereka telah mengingkari ketentuan hukum Allah tentang bulan-bulan haram. Kebiasaan buruk itu digunakan oleh setan untuk menyesatkan orang-orang yang ingkar kepada Allah. Mereka menghalalkan bulan haram selama setahun dengan cara menggantinya dengan bulan lain di luar bulan haram dan mempertahankan keharaman bulan haram selama setahun agar sesuai dengan jumlah bulan-bulan haram yang telah ditetapkan oleh Allah, walaupun nama-nama bulannya berbeda. Jadi setiap kali mereka menghalalkan satu bulan haram mereka mengharamkan satu bulan halal sebagai gantinya. Dengan demikian mereka menghalalkan bulan-bulan haram yang telah Allah tetapkan dan melanggar ketentuan hukum-Nya. Setan telah membuat banyak perbuatan buruk tampak baik di mata mereka sehingga mereka tergoda untuk melakukannya. Salah satunya ialah perbuatan mereka yang menunda pelaksanaan bulan haram ke bulan lainnya. Dan Allah tidak akan memberikan bimbingan-Nya kepada orang-orang kafir yang bersikeras mempertahankan kekafirannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "37. Sesungguhnya pemindahan pengharaman bulan Muharram ke bulan lainnya -sebagaimana yang dilakukan orang-orang arab pada masa jahiliyah- merupakan tambahan kekafiran setelah kekafiran mereka kepada Allah karena mereka mengingkari hukum-Nya pada bulan-bulan haram. Dengan bulan-bulan haram ini setan menyesatkan orang-orang yang kafir terhadap Allah, ketika setan membuat aturan yang buruk bagi mereka berupa penghalalan bulan haram pada suatu tahun dan menggantinya dengan bulan lain, dan membiarkan pengharamannya pada tahun lainnya. Ini mereka lakukan untuk menyesuaikan jumlah bulan yang diharamkan Allah, meskipun pada bulan yang berbeda. Mereka tidak mengharamkan suatu bulan melainkan dengan menghalalkan bulan yang lain sebagai gantinya, sehingga mereka dapat menghalalkan bulan yang telah Allah haramkan. Setan telah menghiasi perbuatan-perbuatan buruk, sehingga mereka melakukannya, semisal membuat riba nasi’ah. Allah tidak memberi taufik kepada orang-orang yang terus menerus di atas kekafiran mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "37. إِنَّمَا النَّسِىٓءُ (Sesungguhnya mengundur-undurkan bulan haram itu) Makna (النسيء) yakni mengakhirkan pengharaman suatu bulan ke bulan lainnya, dengan menghalalkan sebagian bulan haram dan mengharamkan bulan lain yang bukan termasuk bulan haram sebagai ganti dari bulan yang dihalalkan tersebut. Misalkan, menghalalkan bulan Muharram pada beberapa tahun kemudian mengharamkan bulan Safar sebagai gantinya. Dan terdapat pendapat lain dalam penafsiran kata (النسيء) ini. زِيَادَةٌ فِى الْكُفْرِ ۖ( adalah menambah kekafiran) Menambah kekafiran mereka kepada Allah, Rasul-Nya, hari kiamat. يُضَلُّ بِهِ الَّذِينَ كَفَرُوا۟( Disesatkan orang-orang yang kafir dengan mengundur-undurkan itu) Yakni orang yang mengada-adakan hal ini menjadikan mereka sesat dengan perbuatan yang buruk ini. يُحِلُّونَهُۥ عَامًا(mereka menghalalkannya pada suatu tahun) Dengan menggantinya dengan bulan yang lain yang bukan termasuk bulan haram. وَيُحَرِّمُونَهُۥ عَامًا(dan mengharamkannya pada tahun yang lain) Yakni menjaga kehormatan bulan ini dengan tidak menghalalkannya dengan berperang diwaktu tersebut. لِّيُوَاطِـُٔوا۟ عِدَّةَ مَا حَرَّمَ اللهُ(agar mereka dapat mempersesuaikan dengan bilangan yang Allah mengharamkannya) Yakni mereka tidak menghalalkan salah satu bulan kecuali dengan mengharamkan satu bulan yang lain agar jumlah bulan haram tetap empat bulan. Maka Allah mengingkari mereka yang menghalalkan apa yang Allah haramkan dan mengharamkan apa yang Allah halalkan sesuai dengan hawa nafsu mereka dengan melakukan peperangan di bulan-bulan yang telah mereka halalkan. فَيُحِلُّوا۟ مَا حَرَّمَ اللهُ ۚ( maka mereka menghalalkan apa yang diharamkan Allah) Yakni menghalalkan bulan-bulan haram yang telah mereka ganti dengan bulan lain. زُيِّنَ لَهُمْ سُوٓءُ أَعْمٰلِهِمْ ۗ((Syaitan) menjadikan mereka memandang perbuatan mereka yang buruk itu) Yakni setan menghiasi perbuatan buruk yang mereka lakukan, diantaranya adalah mengganti-ganti bulan haram. وَاللهُ لَا يَهْدِى الْقَوْمَ الْكٰفِرِينَ (Dan Allah tidak memberi petunjuk kepada orang-orang yang kafir) Yakni yang berlarut-larut dan terus-menerus dalam kekafiran mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "37. Sesungguhnya menangguhkan pengharaman suatu bulan ke bulan lainnya itu menambah kekufuran mereka terhadap hukum Allah, seusai mereka kufur terhadap Allah, kitab-kitabNya, rasul-rasulNya dan hari akhir, dan menyesatkan mereka dari apa yang ditetapkan tersebut. Mereka menghalalkan bulan peperangan pada suatu tahun dan mengharamkannya pada tahun lainnya supaya mereka bisa menyesuaikan pergantian ini dengan 4 bulan yang diharamkan oleh Allah, sehingga mereka menghalalkan apa yang diharamkan Allah berupa bulan-bulan haram yang mereka ganti dengan bulan lainnya, namun tetap menerapkan pengharaman 4 bulan dalam satu tahun. Setan menghiasi amal buruk mereka, sehingga beranggapan bahwa itu baik. Dan Allah tidak menyelamatkan orang-orang yang berpegang teguh pada kekufurannya. Abu Malik berkata: “Mereka menjadikan 1 tahun dengan 13 bulan, lalu menjadikan Safar sebagai bulan yang diharamkan (untuk perang), dan mengesahkannya sebagai bulan-bulan yang diharamkan, lalu Allah menurunkan ayat {Innaman nasii’u…}”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya pengunduran} penundaan pengharaman suatu bulan sampai bulan lainnya {itu hanya menambah kekufuran. Orang-orang kafir disesatkan dengan itu, mereka menghalalkannya satu tahun dan mengharamkannya pada satu tahun yang lain agar mereka dapat menyesuaikan} mencocokkan {dengan bilangan yang diharamkan Allah} jumlah bulan yang diharamkan oleh Allah yang jumlahnya ada 4 {sehingga mereka menghalalkan apa yang diharamkan Allah. Telah dihiasi} diperindah {bagi mereka perbuatan-perbuatan buruk mereka itu. Allah tidak memberi petunjuk kepada kaum yang kafir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "37. An-Nasi’ adalah apa yang dilakukan oleh orang-orang jahiliyah dalam bulan-bulan Haram, dan di antara bid’ah mereka yang bathil adalah bahwa manakala mereka merasa harus berperang di sebagian waktu dari bulan yang Haram, maka mereka memandang dengan pandangan mereka yang rusak perlunya menjaga bilangan bulan-bulan Haram yang mana Allah melarang berperang padanya, maka mereka menunda atau memajukan sebagian bulan Haram dengan menggantikannya dengan bulan halal sesuka hati mereka, jika ia telah diganti dengannya, maka mereka pun menghalalkan berperang di dalamnya dan menjadikan bulan yang halal, haram. Inilah yang dinyatakan oleh Allah bahwa ia adalah tambahan kekufuran dan kesesatan mereka, karena ia mengandung berbagai dampak negative: Di antaranya, bahwa mereka mengada-ngadakan hal tersebut dari diri mereka sendiri dan menjadikannya sama dengan syarat dan agama Allah, padahal Allah dan RasulNya berlepas diri darinya. Di antaranya, bahwa mereka memutarbalikkan agama, menjadikan yang halal haram dan yang haram halal. Di antaranya, bahwa mereka mengelabui Allah –menurut klaim mereka- dan mengelabui hamba-hambaNya serta merancukan agama mereka. Mereka memakai tipuan dan kebohongan dalam agama Allah. Di antaranya, juga bahwa adat-adat yang bertentangan dengan syariat yang tersu dilakukan berakibat hilangnya (nilai) keburukan adat itu dari jiwa, bahkan bisa jadi ia dikira baik, maka terjadilah kesesatan dan kebatilan. Oleh karena itu Allah berfirman, “Orang-orang yang kafir disesatkan dengan mengundur-undurkan itu, mereka menghalalkannya pada suatu tahun dan mengharamkannya pada tahun yang lain, agar mereka dapat menyesuaikan dengan bilangan yang Allah mengharamkannya.” Yakni agar mereka menyesuaikan bilangannya. “Maka mereka menghalkan apa yang diharamkan Allah. (Setan) menjadikan mereka memandang baik perbuatan mereka yang buruk itu.” Yakni setang menjadikan amal buruk mereka seakan-akan indah, maka mereka pun memandangnya indah keyakinan yang disematkan oleh setan seolah-olah indah di dalam hati mereka. “Dan Allah tidak memberi petunjuk kepada orang-orang yang kafir,” orang-orang yang kekufuran dan pendustaan telah tercetak di dalam hati mereka. Kalaupun semua ayat Allah datang kepada mereka niscaya mereka tetap tidak beriman."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 37: Bulan Rajab, Zulkaidah, Zulhijjah, dan Muharram adalah bulan-bulan yang dihormati dan dalam bulan-bulan tersebut tidak boleh diadakan peperangan. Tetapi peraturan ini dilanggar oleh mereka dengan mengadakan peperangan di bulan Muharram, dan menjadikan bulan Safar sebagai bulan yang dihormati untuk mengganti bulan Muharram itu. Meskipun bilangan bulan-bulan yang disucikan itu empat bulan juga. tetapi dengan perbuatan itu, tata tertib di Jazirah Arab menjadi kacau dan lalu lintas perdagangan terganggu. Kerusakan lainnya adalah: - Merupakan perkara bid’ah, dan mereka menjadikannya sebagai agama, padahal Allah dan Rasul-Nya berlepas diri daripadanya. - Mereka telah mengubah agama, dengan menjadikan bulan yang haram sebagai bulan halal dan menjadikan bulan halal sebagai bulan haram. - Mereka memalsukan ajaran Allah dan melakukan tipuan serta helat (cari kesempatan) dalam agama Allah. - Kebiasaan melanggar syari’at jika terus menerus dilakukan, maka kejelekannya akan hilang dari jiwa dan akan berganti menjadi indah. Karena perbuatan itulah mereka menjadi sesat. Karena kufurnya mereka kepada hukum Allah Ta’ala. Yakni dengan menghalalkan satu bulan haram dan mengharamkan bulan yang lain sebagai gantinya. Yakni orang-orang yang dalam hatinya sudah tercelup oleh kekafiran dan sikap mendustakan, oleh karena itu setiap kali datang kepada mereka ayat Allah, mereka tidak beriman juga."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 37",
    "description": "Setelah menjelaskan jumlah bulan dalam setahun dan di antaranya ada empat bulan yang dimuliakan, maka ayat ini mengecam mereka yang menambah bilangan dan memutarbalikkan bulan-bulan haram atau mengundur-undurnya. Sesungguhnya pengunduran bulan haram, sebagaimana kebiasaan orang-orang arab saat itu yang secara sengaja mengganti posisi muharram dengan bulan safar agar bisa berperang, itu hanya menambah kekafiran di samping kekufuran yang selama ini mereka lakukan. Orang-orang kafir disesatkan oleh setan dan para pemuka-pemukanya dengan pengunduran itu, mereka menghalalkannya yakni mengundur-undurkannya suatu tahun dan mengharamkannya pada suatu tahun yang lain. Mereka melakukan pengunduran ini agar dapat menyesuaikan dengan bilangan bulan-bulan yang diharamkan Allah, sekaligus mereka menghalalkan apa yang diharamkan Allah, yakni berperang di bulan-bulan haram juga perbuatan dosa lainnya. Padahal, perbuatan-perbuatan buruk tersebut dijadikan terasa indah oleh setan bagi mereka. Dan Allah tidak memberi petunjuk, yakni bimbingan agar selalu berada di jalan yang benar, kepada orang-orang yang kafir, yaitu mereka yang terus-menerus berada di jalan kekufuran ayat yang lalu memerintahkan untuk memerangi kaum musyrik yang menyerang mereka di mana saja dan kapan saja, maka ayat ini menje-laskan salah satu peperangan itu, yakni perang tabuk yang terjadi pada tahun ke-9 hijriah. Wahai orang-orang yang beriman! mengapa kalian bermalas-malasan apabila dikatakan kepada kamu, berangkatlah untuk berperang di jalan Allah. Dengan adanya perintah perang ini kamu me-rasa berat dan ingin tinggal di tempatmu karena takut menghadapi musuh dengan jumlah yang lebih besar ditambah kondisi yang sangat panas, sementara itu pohon kurma sudah mulai berbuah' apakah kamu lebih menyenangi kehidupan di dunia yang sementara dan tidak kekal daripada kehidupan di akhirat yang kekal abadi' padahal kenikmatan hidup di dunia ini, sebanyak apa pun jika dibandingkan dengan kehidupan di akhirat hanyalah sedikit dan tidak berguna."
  }
]