[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang yang beriman kepada Allah dan rasulNya serta melaksanakan syariatNya, mengapa kalian bila diserukan kepada kalian, ”keluarlah kalian menuju jihad di jalan Allah untuk memerangi musuh-musuh kalian.” kalian bermalas-malasan dan tetap berada di rumah-rumah kalian? apakah kalian lebih mengutamakan kesenangan-kesenangan duniawi daripada kenikmatan akhirat? Maka apa yang kalian bersenang-senang dengannya di dunia ini adalah sedikit lagi akan fana. Sedangkan kenikmatan akhirat yang disediakan Allah bagi kaum Mukminin yang berjihad, amat banyak lagi abadi."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "38. Wahai orang-orang yang percaya kepada Allah dan rasul-Nya dan menjalankan syariat-Nya, kenapa kalian jika kalian diajak berjihad di jalan Allah untuk berperang melawan musuh, kalian menjadi malas dan memilih tinggal di rumah? Apakah kalian merasa puas dengan kesenangan hidup di dunia yang sementara dan kenikmatannya yang terbatas dan mengabaikan kenikmatan hidup di Akhirat yang kekal dan abadi yang disiapkan oleh Allah untuk orang-orang yang berjihad di jalan-Nya? Kesenangan hidup di dunia terlalu kecil bila dibandingkan dengan kesenangan hidup di Akhirat? Jadi, bagaimana mungkin orang yang berakal sehat memilih sesuatu yang sementara dibanding sesuatu yang kekal, dan mengutamakan sesuatu yang kecil dibanding sesuatu yang besar?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "38. Setelah Allah menjelaskan kepada orang-orang beriman perkara jihad dan menghilangkan segala alasan yang dapat mereka pakai, kemudian Allah mengolok keengganan mereka untuk berperang bersama Rasulullah: Hai orang-orang yang beriman kepada Allah dan rasul-Nya, dan menjalankan syariat-Nya; mengapa jika kalian diseru untuk berjihad di jalan Allah untuk memerangi musuh kalian, kalian berlambat-lambat dan ingin untuk tetap di rumah kalian? Apakah kalian telah ridha dengan kenikmatan dunia yang fana sebagai ganti dari kenikmatan akhirat yang kekal yang telah Allah siapkan bagi orang-orang yang berjihad di jalan-Nya? kenikmatan dunia jika dibandingkan dengan kenikmatan akhirat sangatlah kecil, bagaimana orang yang berakal lebih memilih yang fana daripada yang kekal, dan yang kecil daripada yang besar?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "38. يٰٓأَيُّهَا الَّذِينَ ءَامَنُوا۟ مَا لَكُمْ إِذَا قِيلَ لَكُمُ انفِرُوا۟ فِى سَبِيلِ اللهِ (Hai orang-orang yang beriman, apakah sebabnya bila dikatakan kepadamu: “Berangkatlah (untuk berperang) pada jalan Allah”) Ayat ini diturunkan sebagai teguran bagi orang yang tidak mengikuti perang Tabuk bersama Rasulullah. Perang ini terjadi pada tahun kesembilah hijriyah, setahun setelah penakhlukkan kota Makkah. Makna (النفير) yakni pergi berperang. اثَّاقَلْتُمْ إِلَى الْأَرْضِ ۚ( kamu merasa berat dan ingin tinggal di tempatmu) Kata اثاقلتم berasal dari kata تثاقلتم, yakni berlambat-lambat dan lebih berharap untuk tinggal di tempat kalian. أَرَضِيتُم بِالْحَيَوٰةِ الدُّنْيَا(Apakah kamu puas dengan kehidupan di dunia) Yakni dengan kenikmatan dunia sebagai ganti dari kenikmatan akhirat. Padahal kenikmatan akhirat diraih dengan berjihad dan pergi berperang di jalan Allah. مِنَ الْاٰخِرَةِ ۚ( sebagai ganti kehidupan di akhirat) Yakni sebagai ganti dari kenikmatan akhirat. فَمَا مَتٰعُ الْحَيَوٰةِ الدُّنْيَا فِى الْاٰخِرَةِ إِلَّا قَلِيلٌ(Padahal kenikmatan hidup di dunia ini (dibandingkan dengan kehidupan) diakhirat hanyalah sedikit) Yakni hina dan tidak layak untuk dipedulikan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "38. Wahai orang-orang mukmin, apa yang kalian dapatkan ketika diminta untuk pergi (keluar untuk berperang), lalu kalian keberatan, yaitu lamban untuk jihad di jalan Allah, dan kalian lebih memilih untuk tetap berada di dalam rumah kalian? Apakah kalian puas dengan kenikmatan dunia sebagai ganti akhirat dan kenikmatannya yang abadi? Dan tidaklah kenikmatan dunia dibanding kenikmatan akhirat itu kecuali hina dan tidak penting. Mujahid berkata: “Peristiwa ini terjadi ketika mereka diperintahkan untuk perang Tabuk setelah penaklukan Mekah dan perang Hunain di waktu musim panas saat buah-buahan sedang lezat-lezatnya. Mereka ingin berteduh meskipun jalan keluar telah terbuka bagi mereka, lalu Allah menurunkan ayat ini”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, mengapa ketika dikatakan kepada kalian, “Berangkatlah} keluarlah untuk berperang {di jalan Allah,” kalian merasa berat dan cenderung pada dunia} kalian keberatan dan cenderung untuk tetap diam di negeri kalian {Apakah kalian lebih menyukai kehidupan dunia daripada akhirat. Tidaklah kenikmatan kehidupan dunia (dibandingkan) di akhirat kecuali hanya sedikit"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "38. Ketahuilah bahwa banyak ayat di dalam surat yang mulia ini turun pada perang Tabuk, ketika Nabi menyiapkan kaum Muslimin untuk memerangi Romawi, sementara waktu itu adalah musim panas, bekal minim dan kehidupan sulit, maka sebagiam kaum Muslimin meresa berat yang membuat Allah menegur dan mendorong mereka, Dia berfirman, “Hai orang-orang yang beriman”, tidakkah kalian tahu tuntunan keimanan dan sebab keyakinan adalah bersegera melaksanakan perintah Allah dan berlomba-lomba menuju ridhaNya, berjihad melawan musuhnya dan memenangkan agamamu? “ Apakah sebabnya apabila dikatakan kepada kamu, ‘berangkatlah untuk berperang di jalan Allah,’ kamu merasa berat dan ingin tinggal ditempatmu?” yakni, kamu bermalas-malasan, cenderung dan condong kepada keselamatan dan enak-enakan. “Apakah kamu puas dengan kehidupan di dunia sebagai ganti kehidupan di akhirat?” yakni keadaanmu tidak lain kecuali sama dengan keadaan orang-orang yang rela dengan dunia dan mengejarnya tanpa peduli terhadap akhirat, seolah-olah dia tidak beriman kepadanya. “padahal kenikmatan hidup di dunia ini”, yang kamu condong kepadannya dan kamu dahulukan atas akhirat “hanyalah sedikit.” Segala urusan, mana yang lebih berhak untuk di dahulukan? Bukankah dunia dari awal sampai ujung tiada bandingannya dengan akhirat? Bepakah umur manusia yang sangar pendek itu sehingga dia menjadikannya tujuan akhir, sehingga seluruh usahanya, pikirannya, tindak tanduknya,yang ambisinya tidak lebih kecuali untuk dunia yang pendek yang penuh dengan polusi yang sarat dengan marabahaya? Dengan dasar apakah kamu mementingkannya di atas kehidupan akhirat, yang padanya terdapat seluruh nikmat, yang padanya terdapat seleluruh apa yang di inginkan oleh jiwa dan di nikmati oleh mata dan kamu pun kekal di dalamnya? Demi Allah, tidak akan mendahulukan dunia di atas akhirat orang yang imannya mantap di hatinya, pikirannya matang di kepalanya, yang termasuk sebagai Ulil Albab (orang-orang yang berakal)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 38: Ayat ini turun ketika Nabi shallallahu 'alaihi wa sallam mengajak para sahabat untuk perang Tabuk, sedangkan mereka dalam keadaan sulit dan kesusahan, udara sangat panas, dan perbekalan sedikit sehingga yang demikian terasa berat bagi mereka. Yakni tidakkah kamu mengerjakan konsekwensi keimanan dan penguat keyakinan, yaitu segera melakukan perintah Allah, mencari keridhaan-Nya dan berjihad untuk melawan musuh-musuh-Nya dan membela agama-Nya. Pertanyaan ini sebagai celaan dan teguran kepada mereka. Yang hati kamu cenderung kepadanya dan lebih mengutamakannya di atas akhirat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 38",
    "description": "Ayat yang lalu memerintahkan untuk memerangi kaum musyrik yang menyerang mereka di mana saja dan kapan saja, maka ayat ini menje-laskan salah satu peperangan itu, yakni perang tabuk yang terjadi pada tahun ke-9 hijriah. Wahai orang-orang yang beriman! mengapa kalian bermalas-malasan apabila dikatakan kepada kamu, berangkatlah untuk berperang di jalan Allah. Dengan adanya perintah perang ini kamu me-rasa berat dan ingin tinggal di tempatmu karena takut menghadapi musuh dengan jumlah yang lebih besar ditambah kondisi yang sangat panas, sementara itu pohon kurma sudah mulai berbuah' apakah kamu lebih menyenangi kehidupan di dunia yang sementara dan tidak kekal daripada kehidupan di akhirat yang kekal abadi' padahal kenikmatan hidup di dunia ini, sebanyak apa pun jika dibandingkan dengan kehidupan di akhirat hanyalah sedikit dan tidak bergunamereka bukan saja dikecam, namun juga diancam jika tidak berangkat perang. Karena itu, Allah menegaskan bahwa jika kenikmatan duniawi telah memberatkanmu sehingga kamu tidak berangkat untuk berperang beserta rasulullah, padahal kamu tidak ada halangan untuk itu, maka niscaya Allah akan menghukum kamu baik di dunia dengan kehinaan atau dikucilkan mau-pun di akhirat kelak dengan azab yang pedih, dan menggantikan kamu dengan kaum yang lain yang lebih baik, lebih kuat dan lebih taat, dan ketahuilah, bahwa keengganan kamu untuk berperang dan bahkan ketidaktaatanmu terhadap semua perintah Allah itu tidak akan meru-gikan-Nya sedikit pun (lihat: surah ibra'him/14: 8). Dan Allah mahakuasa atas segala sesuatu."
  }
]