[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bila kalian tidak berangkat wahai kaum mukminin, menuju peperangan melawan musuh kalian, niscaya Allah akan menimpakan siksaan pada kalian, dan akan mendatangkan kaum lain yang akan mau berangkat perang ketika mereka diseru untuk berangkat perang dan taat kepada Allah dan rasulNya. Dan kalian tidak akan memberikan mudarat kepada Allah sama sekali lantaran kalian berpaling dari berjihad. Dia mahkaya, sedang kalian butuh kepadaNYa. Dan apa yang dikehendaki Allah pasti akan terjadi. Dan Allah maha kuasa atas segala sesuatu, yaitu untuk memenangkan agamaNya dan nabiNya tanpa peran serta kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "39. Jika kalian -wahai orang-orang mukmin- tidak mau pergi berjihad di jalan Allah untuk berperang melawan musuh, niscaya Allah akan menghukum kalian dengan kekalahan, kehinaan, dan lain-lain. Dan Allah akan mengganti kalian dengan orang-orang yang taat kepada Allah, yang apabila mereka diajak pergi berjihad, mereka pasti berangkat. Dan Allah sama sekali tidak merugi dengan sikap kalian yang melanggar perintah-Nya, karena Dia sama sekali tidak membutuhkan kalian, sedangkan kalian sangat membutuhkan-Nya. Dan Allah Mahakuasa atas segala sesuatu. Tidak ada sesuatu yang dapat melemahkan-Nya. Dia sanggup menolong agama-Nya dan Nabi-Nya tanpa kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "39. Setelah Allah mendorong orang-orang beriman untuk berjihad dengan pahala akhirat, kemudian Allah mendorong mereka dengan hal lain yang dapat menguatkan semangat mereka: “Hai orang-orang beriman, jika kalian tidak pergi berjihad di jalan Allah untuk memerangi musuh kalian, niscaya Allah akan menghukum kalian dengan kehinaan, ketertindasan, dan lain sebagainya; dan mengganti kalian dengan kaum lain yang mentaati Allah, jika diperintah untuk berjihad maka mereka akan berjihad. Pelanggaran kalian terhadap perintah Allah tidak akan mendatangkan mudharat sedikitpun bagi-Nya. Dia tidak membutuhkan kalian, namun kalianlah yang membutuhkan-Nya. Dia berkuasa atas segala sesuatu, tidak ada yang tidak dapat dilakukan-Nya. Dia berkuasa untuk menolong agama dan nabi-Nya tanpa kekuatan kalian.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "39. إِلَّا تَنفِرُوا۟ يُعَذِّبْكُمْ (Jika kamu tidak berangkat untuk berperang, niscaya Allah menyiksa kamu) Yakni apabila kalian meninggalkan jihad maka kalian akan diazab Allah dengan tekanan dan kehinaan yang menimpa kalian وَيَسْتَبْدِلْ قَوْمًا غَيْرَكُمْ (dan digantinya (kamu) dengan kaum yang lain) Yakni kaum yang menolong Rasulullah dan memiliki negeri kekuasaan. وَلَا تَضُرُّوهُ شَيْـًٔا ۗ( dan kamu tidak akan dapat memberi kemudharatan kepada-Nya sedikitpun) Yang tidak mematuhi perintah-Nya untuk pergi berperang. Atau kalian tidak akan memberi kemudharatan sedikitpun kepada Rasulullah dengan tidak menolongnya dan pergi berperang bersamamu. وَاللهُ عَلَىٰ كُلِّ شَىْءٍ قَدِيرٌ(Allah Maha Kuasa atas segala sesuatu) Dan termasuk dalam kuasa-Nya adalah mengazab kalian, mengganti kalian dengan kaum lain, serta menolong Rasul-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "39. Jika kalian tidak berangkat dan keluar untuk berjihad, niscaya Allah akan mengazab kalian dengan azab yang pedih di dunia dengan dihinakan, lalu mendatangkan kaum lain sebagai pengganti kalian yang menaati Allah dan menyelamatkan agamaNya dan negeriNya. Dan kalian tidak bisa memberi mudharat kepada Allah dan nabiNya sedikitpun dengan tidak menunaikan perintah dan memberi pertolongan. Allah itu berkuasa atas setiap sesuatu di antaranya adalah menyelamatkan agama dan nabiNya. Ibnu Abbas berkata: “Rasulallah SAW meminta orang-orang Arab untuk berangkat (perang), lalu mereka keberatan. Kemudian Allah menurunkan ayat {illaa tanfiruu yu’adzibkum ‘adzaban aliiman} Lalu hujan ditahan untuk turun atas mereka dan ini merupakan azab bagi mereka”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika kalian tidak berangkat} jika kalian tidak keluar untuk berjihad di jalan Allah {niscaya Allah akan menghukum kalian dengan azab yang pedih serta menggantikan kalian dengan kaum lain, dan kalian tidak akan merugikanNya sedikit pun. Allah Maha kuasa atas segala sesuatu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "39. Kemudian Allah mengancam mereka jika mereka tetap malas berjihad, Dia berfirman, “jika kamu tidak berangkat untuk berperang, niscaya Allah menyiksa kamu dengan siksa yang pedih”, di dunia dan akhirat, karena tidak berangkat untuk berjihad dalam kondisi yang menuntut keberangkatan, termasuk dosa besar yang menyebabkan azab yang berat, karena ia mengandung mudarat besar, orang yang tertinggal dengan senjata telah durhaka kepada Allah, melakukan laranganNya, tidak membentu menolong agama Allah, tidak membela kitab dan syariat Allah, tidak membantu saudara yang seiman dan melawan musuh yang hendak menghabisi mereka dan mematikan agama mereka, hal itu bisa melemahkan sebagian orang yang telah ikut berjihad melawan musuh Allah, maka orang yang demikian ini berhak memperoleh ancaman keras dari Allah, Dia berfirman, “jika kamu tidak berangkat untuk berperang, niscaya Allah menyiksa kamu dengan siksa yang pedih dan digantinya kamu dengan kaum yang lain”, yang tidak sama dengan kaum “dan kamu tidak akan dapat memberi kemudaratan kepadaNya sedikitpun.” Karena Allah telah menjamin untuk memenakan agamaNya dan kalimatNya, tidak ada bedanya kamu mejalankan perintah Allah atau kamu mencampakkannya di belakang punggungmu. “Allah Mahakuasa atas segala seusatu.” Tidak ada seusatupun yang menghalang-halangiNya dari apa yang diinginkanNya dan tidak ada sesuatupun yang dapat mengalahkanNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 39: Di dunia dan akhirat, karena tidak berangkat padahal sebelumnya diminta untuk berangkat termasuk dosa-dosa besar yang menghendaki pelakunya mendapatkan siksa yang pedih, di mana dalam sikap tersebut terdapat banyak madharat (bahaya), di antaranya adalah sama saja telah mendurhakai Allah Ta’ala dan mengerjakan larangan-Nya, tidak membantu membela agama Allah, tidak membantu saudaranya kaum muslimin yang hendak dibinasakan oleh musuh-musuh mereka, bahkan terkadang sikap mereka akan diikuti oleh orang-orang yang lemah dan melemahkan semangat orang-orang yang berjihad. Oleh karenanya, orang yang seperti ini keadaannya layak memperoleh ancaman tersebut. Bisa juga kata “nya” di sini kembalinya kepada Nabi shallallahu 'alaihi wa sallam, yakni kamu tidak dapat merugikan Beliau sedikit pun, karena Allah penolong agamanya, atau kembalinya kepada Allah, sehingga kamu tidak dapat merugikan-Nya sedikit pun, karena Dia telah menjamin akan menolong agama-Nya dan akan meninggikan kalimat-Nya. Di antaranya dengan menolong agama dan Nabi-Nya dan tidak ada seorang pun yang dapat melemahkan dan mengalahkan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 39",
    "description": "Mereka bukan saja dikecam, namun juga diancam jika tidak berangkat perang. Karena itu, Allah menegaskan bahwa jika kenikmatan duniawi telah memberatkanmu sehingga kamu tidak berangkat untuk berperang beserta rasulullah, padahal kamu tidak ada halangan untuk itu, maka niscaya Allah akan menghukum kamu baik di dunia dengan kehinaan atau dikucilkan mau-pun di akhirat kelak dengan azab yang pedih, dan menggantikan kamu dengan kaum yang lain yang lebih baik, lebih kuat dan lebih taat, dan ketahuilah, bahwa keengganan kamu untuk berperang dan bahkan ketidaktaatanmu terhadap semua perintah Allah itu tidak akan meru-gikan-Nya sedikit pun (lihat: surah ibra'him/14: 8). Dan Allah mahakuasa atas segala sesuatujangan pernah menduga kalau Allah dan rasulullah membutuhkan pertolonganmu untuk mengalahkan musuh-Musuh-Nya. Tentu saja tidak. Karena itu, jika kamu tidak menolongnya, yakni nabi Muhammad dalam perang tabuk, sesungguhnya Allah telah menolong dan menguatkan-Nya, antara lain menolong beliau ketika orang-orang kafir mengusirnya dari mekah, sedang saat itu dia salah seorang dari dua orang, yakni beliau hanya ditemani abu bakar. Situasi saat itu benar-benar menegangkan, yaitu ketika keduanya berada dalam gua dan orang-orang kafir ada di sekitarnya, maka ketika itu Allah menguatkan jiwa beliau sehingga dengan penuh keyakinan dia berkata kepada sahabatnya, abu bakar, jangan engkau bersedih, sesungguhnya Allah bersama kita dan menolong serta melindungi kita. Sebagai bentuk pertolongan Allah, maka Allah menurunkan ketenangan kepadanya, yakni nabi Muhammad, sehingga mampu menghadapi situasi yang sangat sulit tersebut dan bahkan membantu beliau dengan bala tentara, berupa malaikat-malaikat yang tidak terlihat olehmu, dan dia menjadikan seruan orang-orang kafir kepada kedurhakaan dan kemusyrikan itu rendah, sebab usaha mereka untuk mematikan api islam bahkan membunuh rasulullah ternyata gagal. Dan bahkan sebaliknya, kalimat Allah, yakni agama islam, itulah yang tinggi. Demikian ini, karena Allah mahaperkasa, lagi mahabijaksana."
  }
]