[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dikecualikan dari hukum tersebut, orang-orang musyrik yang telah masuk kedalam perjanjian damai dengan kalian sehingga waktu tertentu dan mereka tidak mengkhianati perjanjian, serta tidak membantu siapaun untuk memerangi kalian dari musuh. Maka sempurnakanlah perjanjian dengan mereka hingga waktunya berakhir. Sesungguhnya Allah mencintai orang-orang yang bertakwa, yang menjalankan perkara yang diperintahkan kepada mereka dan menghindari perbuatan syirik dan khianat dan perbuatan lainnya dari kemaksiatan-kemaksiatan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Kecuali orang-orang musyrik yang membuat perjanjian dengan kalian lalu mereka menepati janji mereka dan tidak pernah melanggarnya. Mereka ini mendapat pengecualian dari ketentuan hukum di atas. Untuk kondisi mereka tersebut, penuhilah perjanjian mereka sampai batas waktunya berakhir. Sesungguhnya Allah mencintai orang-orang yang bertakwa kepada Allah dengan menjalankan perintah-perintah-Nya, termasuk menepati janji, dan menjauhi larangan-larangan-Nya, termasuk mengkhianati janji."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "4. Setelah Allah menyatakan kepada mereka telah berlepas diri dari orang-orang musyrik dan menetapkan waktu disampaikannya pernyataan ini, sedangkan yang dimaksud dengan melepas diri dari mereka adalah mereka tidak lagi memiliki perjanjian; maka kemudian Allah mengecualikan sebagian orang yang memiliki perjanjian dengan orang-orang beriman: \"Janganlah kalian biarkan orang yang melanggar perjanjian melebihi 4 bulan kecuali bagi orang-orang yang tidak melanggar perjanjian dengan kalian, maka janganlah kalian perlakukan mereka seperti orang yang melanggar; namun sempurnakanlah perjanjian itu sampai waktu yang telah ditentukan, dengan syarat mereka tidak menyelisihi syarat-syarat perjanjian, tidak membahayakan kalian, dan tidak menolong musuh kalian untuk memerangi kalian. Karena maksud dari perjanjian itu adalah agar dua pihak yang membuat perjanjian itu tidak saling berperang dan keduanya memiliki kebebasan saling berinteraksi. Sesungguhnya Allah mencintai orang-orang bertaqwa yang menjauhkan diri dari melanggar perjanjian dan segala keburukan yang merusak aturan dan menghalangi penegakan keadilan.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. إِلَّا الَّذِينَ عٰهَدتُّم مِّنَ الْمُشْرِكِينَ ثُمَّ لَمْ يَنقُصُوكُمْ شَيْـًٔا (kecuali orang-orang musyrikin yang kamu telah mengadakan perjanjian (dengan mereka) dan mereka tidak mengurangi sesuatu pun) Yakni tidak melanggar perjanjian kalian. Ayat ini menunjukkan bahwa diantara orang yang melakukan perjanjian terdapat orang yang tidak memenuhi perjanjian tersebut, sehingga Allah mengizinkan Rasul-Nya untuk membatalkan perjanjian dengan orang yang telah melanggarnya, dan memerintahkannya untuk memenuhi perjanjian orang yang tidak melanggar sampai batas waktu yang telah ditentukan. وَلَمْ يُظٰهِرُوا۟ عَلَيْكُمْ أَحَدًا(dan tidak (pula) mereka membantu seseorang yang memusuhi kamu) Yakni tidak membantu musuh—musuh kalian untuk memerangi kalian. فأتموا عهدهم إلى مدتهم (maka terhadap mereka itu penuhilah janjinya) Yakni laksanakanlah perjanjian kalian dengan mereka secara sempurna. إِلَىٰ مُدَّتِهِمْ ۚ (sampai batas waktunya) Yakni sampai waktu yang telah kalian sepakati apabila lebih dari empat bulan. إِنَّ اللهَ يُحِبُّ الْمُتَّقِينَ (Sesungguhnya Allah menyukai orang-orang yang bertakwa) Yakni orang-orang yang bertakwa kepada Allah dalam apa yang diharamkan atas mereka sehingga mereka memenuhi perjanjian yang mereka buat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4 Kecuali orang-orang musyrikin yang kamu telah mengadakan perjanjian dengan mereka dan mereka tidak mengurangi sesuatu pun dari isi perjanjianmu dan tidak pula membantu seseorang yang memusuhimu seperti bani Dhomroh dan bani Kinanah, maka penuhilah janjinya terhadap mereka sampai batas waktunya. Sesungguhnya Allah menyukai orang-orang yang bertakwa dan menepati janjinya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kecuali atas orang-orang musyrik yang telah mengadakan perjanjian dengan kalian dan mereka tidak mengurangi} tidak membatalkan perjanjian mereka {sedikit pun dan mereka tidak membantu seseorang pun yang memusuhi kalian. Maka terhadap mereka itu penuhilah janjinya sampai batas waktunya} sampai waktu yang kalian sepakati bersama mereka {Sesungguhnya Allah menyukai orang-orang yang bertakwa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4. Yakni pemutusan hubungan yang sempurna dan mutlak kepada seluruh orang-orang musrik itu. “kecuali orang-orang musrikin yang kamu telah mengadakan perjanjian dengan mereka”, mereka tetap dalam perjanjian mereka dan tidak terjadi dari mereka sesuatu yang mengharuskan pembatalan, mereka tidak mengurangi sesuatupun dari sisi perjanjian denganmu, tidak membantu orang lain melawanmu; untuk mereka itu, sempurnakanlah perajanjian dengan mereka sampai batasnya, baik pendek atau panjang, karena Islam tidak memerintahkan berkhianat, akan tetapi Islam mengajarkan memenuhi janji. “sesungguhnya Allah menyukai orang-orang yang bertakwa.” Orang-orang yang melakukan apa yang diperintahkan, menjauhi syirik, khianat dan dosa-dosa lain."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 4: Dengan memenuhi janji."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 4",
    "description": "-ayat ini memerintahkan apa yang seharusnya dilakukan oleh kaum muslim setelah habisnya masa tenggang tersebut. Apabila telah habis bulan-bulan haram, yakni masa tenggang waktu empat bulan yang diberi kepada kaum musyrik itu, maka perangilah orang-orang musyrik di mana saja kalian temui saat itu, baik di luar tanah haram maupun di wilayah tanah haram, tangkaplah dan kepunglah mereka, dan awasilah di tempat pengintaian sehingga mereka tidak mampu bergerak dan meloloskan diri. Jika mereka bertobat dari kemusyrikan dan kekufuran yang membuat mereka memerangi umat islam, dan memenuhi ketentuanketentuan agama secara konsekuen, seperti mendirikan salat serta menunaikan zakat, maka berilah kebebasan kepada mereka, dan jangan ditangkap atau diawasi gerak-geriknya lagi. Sebab jika mereka benar-benar bertobat, Allah akan mengampuni dosa-dosanya. Sungguh, Allah maha pengampun, maha penyayang."
  }
]