[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai sekalain sahabat-sahabat rasululllah ! Bila kalian tidak berangkat berperang bersamanya ketika kalian diminta berangkat, dan bila kalian tidak menolongnya, maka sungguh Allah telah menguatkannya dan menolongnya pada hari orang-orang kafir dari suku quraisy mengusirnya dari negerinya (Makkah), dan dia salah seorang dari dua orang (dia dan abu bakar shidi ), dan mereka memaksa kedunya untuk berlindung di dalam gunung gua tsur di Makkah, di mana dia tinggal di dalamnya selama tiga hari tiga malam, ketika dia berkata kepada sahabtnya (abu bakar) yang dia lihat ketakutan mengkhawatirkannya, ”janganlah bersedih . Sesungguhnya Allah bersama kita dengan pertolongan dan dukunganNya.” Maka Allah menurunkan ketenangan di hati rasulullah dan menolongnya dengan bala tentara yang tidak terlihat oleh siapapun dari kalangan manusia. Mereka adalah para malaikat. Maka Allah menyelamatkannya dari musuhnya dan Allah menghinakan musuh-musuhnya, dan menjadikan slogan orang-orang kafir rendah. Dan kalimat Allah itulah yang paling tinggi, yaitu dengan meninggikan agama islam. Dan Allah mahaperkasa dalam kekuasaanNYa, maha bijaksana dalam pengaturan urusan-urusan hamba-hambaNya. Di dalam ayat ini terdapat petunjuk keutamaan besar bagi abu bakar ."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "40. Apabila kalian -wahai orang-orang mukmin- tidak mau menolong Rasulullah -ṣallallāhu 'alaihi wa sallam- maupun menjawab seruannya untuk berjihad di jalan Allah, Maka sebenarnya Allah telah menolongnya tanpa kalian, di saat orang-orang musyrik mengusirnya dan Abu Bakr -Raḍiallāhu ‘anhu-. Ketika itu keduanya bersembunyi di dalam Gua Ṡūr untuk menghindari kejaran orang-orang kafir. Yaitu ketika Rasulullah -ṣallallāhu 'alaihi wa sallam- bersabda kepada sahabatnya, Abu Bakr Ṣiddīq tatkala ia mencemaskan beliau, kalau-kalau orang-orang musyrik berhasil menemukan beliau, \"Jangan bersedih. Sesungguhnya Allah bersama kita melalui dukungan dan pertolongan-Nya.\" Kemudian Allah menurunkan ketenteraman ke dalam hati Rasulullah, dan juga menurunkan bala tentara yang tidak bisa mereka lihat, yakni para malaikat, untuk mendukung beliau. Dan Allah pun menjadikan kalimat orang-orang musyrik jatuh ke tingkat terbawah dan membuat kalimat Allah naik ke tingkat tertinggi ketika dia menjunjung tinggi agama Islam. Dan Allah Maha Perkasa di dalam Żāt-Nya, kekuasaan-Nya, dan kerajaan-Nya, tidak ada seorang pun yang dapat mengalahkan-Nya, lagi Maha Bijaksana dalam pengaturan-Nya, ketetapan-Nya, dan ketentuan syariat-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "40. Allah kembali memberi dorongan bagi mereka untuk berjihad, dengan menyatakan bahwa Dia telah menjamin pertolongan-Nya bagi Rasulullah dalam melawan musuh-musuh agama, baik itu mereka menolongnya maupun tidak; dan Allah telah melakukan itu pada saat yang paling genting: “Hai orang-orang beriman, jika kalian tidak menolong Rasulullah dan menjawab seruan jihadnya, maka sungguh Allah telah menolongnya pada saat dia dan Abu bakar dikejar orang-orang musyrik, ketika mereka berdua bersembunyi di gua Tsur dari orang-orang kafir yang mencari mereka. Ketika itu Abu Bakar ash-Shiddiq khawatir Rasulullah mereka tangkap, maka Rasulullah berkata: “Janganlah bersedih, karena Allah menyertai kita dengan bantuan dan pertolongan-Nya.” Maka Allah menurunkan ketenangan ke dalam hati Rasulullah dan menguatkan mereka dengan bala tentara yang tidak dapat kalian lihat, yaitu para malaikat; dan Allah menjadikan orang-orang kafir menjadi rendah dan kalimat Allah senantiasa tinggi. Allah Maha Perkasa dalam Dzat dan kekuasaan-Nya, dan Maha Bijaksana dalam pengaturan dan ketetapan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "40. إِلَّا تَنصُرُوهُ (Jikalau kamu tidak menolongnya (Muhammad)) Yakni apabila kalian tidak menolong Rasulullah maka Allah yang akan menjaminnya. فَقَدْ نَصَرَهُ اللهُ(maka sesungguhnya Allah telah menolongnya) Pada beberapa peperangan, dan ditolong atas musuhnya dengan kemenangan. Atau dia akan ditolong oleh orang yang mau menolongnya saat tidak ada yang bersamanya kecuali seorang saja ketika dia diusir oleh orang-orang kafir. ثَانِىَ اثْنَيْنِ (salah seorang dari dua orang) Keduanya adalah Rasulullah dan Abu Bakar as-Shiddiq. إِذْ هُمَا فِى الْغَارِ(ketika keduanya berada dalam gua) Yakni gua yang ada di atas bukit yang bernama Tsur, yaitu bukit yang terletak di dekat kota Makkah. إِذْ يَقُولُ لِصٰحِبِهِۦ (di waktu dia berkata kepada temannya) Yaitu kepada Abu Bakar. لَا تَحْزَنْ إِنَّ اللهَ مَعَنَا ۖ (Janganlah kamu berduka cita, sesungguhnya Allah beserta kita) Dan barangsiapa yang bersama Allah maka ia tidak akan terkalahkan, dan barangsiapa yang tidak terkalahkan maka tidak perlu baginya untuk bersedih. فَأَنزَلَ اللهُ سَكِينَتَهُۥ عَلَيْهِ(Maka Allah menurunkan keterangan-Nya kepada) Yakni Allah menenangkan hatinya sehingga ketakutan yang ada padanya hilang dan merasa aman. وَأَيَّدَهُۥ بِجُنُودٍ لَّمْ تَرَوْهَا(dan membantunya dengan tentara yang kamu tidak melihatnya) Yakni dengan para malaikat sebagaimana yang terjadi pada perang Badar. وَجَعَلَ كَلِمَةَ الَّذِينَ كَفَرُوا۟ السُّفْلَىٰ ۗ( dan menjadikan kalimat orang-orang kafir itu rendah) Yakni kalimat kesyirikan. Sehingga negeri orang-orang musyrik hancur. وَكَلِمَةُ اللهِ هِىَ الْعُلْيَا ۗ( Dan kalimat Allah itulah yang tinggi) Yakni kalimat tauhid dan dakwah Islam, sifat yang selalu ada padanya adalah bahwa ia selalu diatas segala kalimat. Dan agama Islam selalu tinggi dan tidak ada yang mengunggulinya. وَاللهُ عَزِيزٌ حَكِيمٌ (Allah Maha Perkasa lagi Maha Bijaksana) Yakni yang perkasa dan penguasa, tidak melakukan sesuatu kecuali dengan yang mengandung hikmah dan kebenaran."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). { إِلَّا تَنْصُرُوهُ فَقَدْ نَصَرَهُ اللَّهُ } \"Jikalau kamu tidak menolongnya (Muhammad) maka sesungguhnya Allah telah menolongnya\" lihatlah bagaimana Allah menjadikan keluarnya Nabi dari Makkah, bahkan beliau dikeluarkan; adalah kemenangan yang nyata bagi beliau, kemudian Allah menurunkan kepadanya ketenangan dan bala tentara yang melindunginya, dan menjadikan perkataan orang-orang berada dalam kehinaan. 2 ). Siapapun yang sepakat dengan Rasulullah pada perkara yang diselisihi oleh golongan selainnya, maka dia termasuk orang-orang yang mengikutinya, dan baginya jatah pada firman Allah : { لَا تَحْزَنْ إِنَّ اللَّهَ مَعَنَا } \"Janganlah kamu berduka cita, sesungguhnya Allah beserta kita\" Dan sesungguhnya kebersamaan Allah dengan hamba-Nya yang pasti menghasilkan kemenangan, adalah akan terus datang hingga hari kiamat. 3 ). { إِذْ يَقُولُ لِصَاحِبِهِ لَا تَحْزَنْ إِنَّ اللَّهَ مَعَنَا } di waktu dia berkata kepada temannya: \"Janganlah kamu berduka cita, sesungguhnya Allah beserta kita\" perhatikan pada ayat ini Allah mengatakan { لَا تَحْزَنْ } , dan Dia tidak mengatakan ( لَا تَخَفْ ) \"janganlah kamu merasa takut\" karena apa yang ditimpa oleh sahabat yang bersama Rasulullah ketika itu adalah kesedihannya kepada Rasulullah yang menjadikannya tidak peduli akan ketakutan terhadap dirinya sendiri."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "40. Jika kalian tidak menolong nabi Allah, Maka Allahlah yang menolong dan menjaminnya, sebagaimana yang terjadi saat orang-orang kafir mengusirnya dari Mekah, yaitu menyebabkan dia keluar dan dia salah satu dari dua orang (Rasulallah dan Abu Bakar) ketika berada di dalam gua atau lubang di gunung Tsur di dekat Mekah dengan jarak satu jam, saat itu Rasulullah berkata kepada sahabatnya, Abu Bakar: “Jangan menyerah terhadap kesedihan dan perjuangkanlah dirimu, sesungguhnya Allah bersama kita, (yaitu dengan menolong dan mendukungnya)” Lalu Allah menurunkan ketenangan dan keamanan atas diri rasulullah, membutakan mata orang-orang musyrik darinya, dan mendukungnya dengan pasukan-pasukan malaikat yang tidak bisa kalian lihat sebagaimana yang terjadi di perang Badar, serta membuat ajakan orang-orang kafir untuk berbuat syirik, kufur dan membunuh itu digagalkan dan dibatalkan, dan kalimah tauhid serta Islamlah yang menang. Allah itu Maha Kuasa lagi Maha Kuat di kerajaanNya, serta Maha Bijaksana dalam penciptaanNya, sehingga tidak bertindak kecuali mengandung hikmah dan kebenaran."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika kalian tidak menolongnya} jika kalian tidak menolong Rasulullah SAW {sungguh Allah telah menolongnya, (yaitu) ketika orang-orang kafir mengusirnya (dari Makkah, sedangkan dia adalah salah satu dari dua orang} salah satu dari dua orang, dan orang yang kedua adalah Abu Bakar Ash-Shiddiq {ketika keduanya berada dalam gua} gua Tsur {ketika dia berkata kepada sahabatnya} kepada Abu Bakar Ash-Shiddiq {“Janganlah bersedih, sesungguhnya Allah bersama kita” Lalu Allah menurunkan ketenangan} ketenangan {kepadanya dan memperkuatnya dengan bala tentara} para malaikat {yang tidak kalian lihat, dan Dia menjadikan seruan orang-orang kafir itu seruan yang paling rendah} yang dikalahkan dan ditaklukkan {Firman Allah itulah yang paling tinggi} yang tinggi dan menaklukkan {Allah Maha perkasa lagi Maha bijaksana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "40. Jikalau kamu tidak menolong RasulNya, Muhammad maka sesungguhnya Allah Maha Kaya (tidak memerlukan sesuatupun) darimu, dan kamu tidak akan memudarkanNya sama sekali. Dia menolongnya dalam kondisi yang paling sulit dan paling lemah, “yaitu ketika orang-orang kafir musyrikin Makkah mengeluarkannya dari Makkah.” Ketikan mereka hendak membunuhnya dengan serius dan sungguh-sungguh, maka mereka telah memaksanya keluar. “sedang dia salah seorang dari dua orang.” Dia dan Abu Bakar ash- Shidiq “ketika keduanya berada di dalam gua.” Ketikka keduanya lari dari Makkah dan berlindung di gua Tsur di bagian bawah Makkah, keduanya bersembunyi sampai pencarian kaum musrikin terhadapnya mengendur, keduanya dalam kondisi yang sulit, sempit, dan berat, manakala musuh ada di setiap penjuru mencari keduanya untuk di bunuh, lalu Allah menurunkan pertolonganNya kepada keduanya yang tidak diduga-duga “di waktu dia berkata,” yakni Nabi “kepada sahabatnya”, Abu Bakar ketika dia bersedih dan sangat cemas, “janganlah kamu berduka cita, sesunggunya Allah berserta kita.” Dengan bantuan, pertolongannya, dan dukunganNya. “Maka Allah menurunkan ketenangannya kepada Muhammad”, yang keteguhan, ketentraman, dan kedamaian yang meneguhkan hati. Oleh karena itu manakala sahabatnya cemas, dia menenagkannya dengan ucapannya, ‘janganglah kamu berduka cita, sesungguhnya Allah bersama kita.” “dan membantunya dengan tentara yang kamu tidak melihatnya”, yaitu para malaikat yang mulia yang dijadikan sebagai penjaga oleh Allah baginya. “Dan Allah jadikan seruan orang-orang kafir itulah yang rendah.” Yakni kalah dan terhinakan. Orang-orang kafir dengan kemarahanya mengira mampu membunuh Muhammad untuk mengobati kebenciannya, mereka mengupayakan segala cara untuk itu, akan tetapi Allah menipu mereka dan menggagalkan keinginana mereka, bahkan mereka sedikitpun tidak mendapatkan apa-apa yang mereka inginkan. Allah menolong RasulNya dengan menolongNya. Inilah pertolongan yang disebutkan di tempat ini, karena pertolongan Allah itu ada dua macam: yaitu pertolongan bagi kaum Muslimin manakala mereka berperang melawan musuh mereka. Allah menyempurnakan apa yang mereka cari dan inginkan sehingga merekapun mengusasai musuh dan menang atas mereka. Yang kedua adalah pertolongan bagi orang tertindas dimana musuh yang kuat hendak mencelakakannya, pertolongan Allah kepadanya adalah dalam bentuk menolak keinginan musuh darinya dan menggagalkannya. Bisa jadi jenis pertolongan yang kedua ini lebih bermanfaat, dan pertolongan Allah kepada RasulNya ketika orang-orang kafir mengusirnya sedang dia adalah salah satu dari dua orang yang termasuk jenis yang kedua FirmanNya, “dan kalimat Allah itulah yang tinggi.” Yakni kalimat takdirnya dan kalimat diniyahnya yang mengungguli kalimat selainnya, yang di antara firmanNya, Dan Kami selalu berkewajiban menolong orang-orang yang beriman. (Ar-Rum:47). Sesungguhnya Kami menolong rasul-rasul Kami dan orang-orang yang beriman dalam kehidupan dunia dan pada hari berdirinya saksi-saksi (hari kiamat),(Al-Mu’min:51). Dan sesungguhnya tentara Kami itulah yang pasti menang, (Ash-Shaffat:173). Agama Allah-lah yang unggul di atas agama yang lain dengan hujjah-hujjah yang jelas, ayat-ayat yang mengagumkan, dan kekuatan yang unggul. “Allah Mahaperkasa”, tidak ada yang dapat mengalahkanNya dan tidak ada yang mampu berlari dariNya, “Lagi bijaksana.” Meletakkan segala sesuatu pada tempatnya dan menunda kemenangan golonganNya sampai batas waktu tertentu sesuai dengan tuntunan hikmah ilahiyah. Di dalam ayat yang mulia ini terdapat penjelasan tetang keutamaan Abu Bakar Ash-shidiq dengan satu keunggulan yang tidak di raih oleh sipapun dari umat ini, yaitu keberuntungan meraih keistimewaan yang mulia dan persahabatn yang luhur. Dan kaum muslimin telah sepakat bahwa dia-lah yang di maksud dalam ayat. Ini oleh karena itu mereka mengategorikan orang yang mengingkari Abu Bakar sebagai sahabat Nabi adalah kafir, karena dia mengingkari Al-Qur’an yang secara nyata menegaskan hal itu. Di dalam ayat ini juga terdapat penjelasan tentang keutamaan ‘sakinah’ bahwa ia termasuk kesempurnaan nikmat Allah kepada seorang hamba dalam masa-masa sulit dan mencekam yang menjadikan hati takut, dan bahwa ia akan didapat sesuai dengan ma’rifat seorang hamba kepada Rabbnya dan kepercayaannya kepada janjiNya yang benar, dan sesuai dengan iman serta keberaniannya. Di dalamnya juga terdapat penjelasan bahwa kecemasan bisa merasuki hamba-hamba Allah yang shiddiqin, meskipun yang lebih baik bagi seorang hamba jika tertimpa olehnya agar berusaha melenyapkannya, karena ia dapat melemahkan hati dan menggembosi semangat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 40: Maka Allah tidak butuh kepada kamu, karena sesungguhnya Allah telah menolongnya dalam keadaan yang paling sempit. Orang-orang kafir telah sepakat untuk membunuh Nabi shallallahu 'alaihi wa sallam, maka Allah Subhaanahu wa Ta'aala memberitahukan maksud jahat orang-orang kafir itu kepada Beliau. Oleh karena itu beliau keluar dengan ditemani oleh Abu Bakar dari Mekah ke Madinah, dan dalam perjalanannya ke sana Beliau bersembunyi di sebuah gua di bukit Tsur. Beliau dan Abu Bakar tinggal di sana agar pencarian terhadap Beliau mereda, di mana ketika itu musuh menyebar di berbagai tempat untuk menangkap Beliau, namun Allah Subhaanahu wa Ta'aala menjaga Beliau. Yang satu lagi adalah Abu Bakar Ash Shiddiq. Maksud ayat ini adalah bahwa dalam keadaan seperti itu Allah telah menolongnya, dan sudah barang tentu akan menolong Beliau pula dalam keadaan yang lain dan tidak akan membiarkannya. Yaitu Abu Bakar Ash Shiddiq saat ia berkata kepada Beliau ketika melihat kaki-kaki kaum musyrik, “Jika sekiranya salah seorang di antara mereka melihat ke bawah kakinya tentu ia akan melihat kita,” Maka Beliau menjawab, “Janganlah engkau bersedih, sesungguhnya Allah bersama kita.” Ayat ini menunjukkan pentingnya ketenangan dan bahwa ia termasuk pelengkap nikmat Allah kepada hamba-Nya terutama di saat-saat menegangkan, dan bahwa ketenangan itu akan diperoleh sesuai sejauh mana pengetahuan seorang hamba terhadap Tuhannya, keyakinannya terhadap janji-Nya, dan sesuai keimanan dan keberanian yang ada dalam dirinya. Bisa juga kepada Abu Bakar radhiyallahu 'anhu. Yaitu para malaikat yang menjaga Beliau. Yaitu seruan atau dakwah syirknya. Orang-orang kafir menyangka bahwa mereka akan berhasil menangkap Rasulullah shallallahu 'alaihi wa sallam dan membunuhnya, mereka kerahkan daya upaya agar tercapai maksud mereka, namun Allah Subhaanahu wa Ta'aala menjadikan mereka kecewa dan maksud mereka tidak tercapai. Ini merupakan pertolongan Allah kepada Beliau shallallahu 'alaihi wa sallam, karena pertolongan Allah dapat berupa menolong kaum muslimin dalam usaha mereka mengalahkan musuh seperti dalam peperangan, dan bisa berupa menolong orang yang lemah dengan menghindarkan gangguan musuh darinya. Yakni seruan tauhid. Ada pula yang mengartikan dengan kalimat qadari-Nya dan kalimat agama-Nya, seperti ayat, “Dan Kami berkewajiban menolong orang-orang yang beriman.” (Terj. Ar Ruum: 47), ayat, “Sesungguhnya Kami menolong rasul-rasul Kami dan orang-orang yang beriman dalam kehidupan dunia dan pada hari berdirinya saksi-saksi (hari kiamat),” (terj. Ghaafir: 51) dan ayat, “Dan sesungguhnya tentara Kami itulah yang pasti menang,” (Ash Shaffaat: 173) Maksud tentara Kami di sini adalah Rasul beserta pengikut-pengikutnya. Oleh karena itu, agama Allah itulah yang akan menang di atas semua agama dengan hujjah yang jelas dan bukti yang nyata. Dia menempatkan sesuatu pada tempatnya, Dia memiliki hikmah menunda kemenangan hamba-Nya sampai tiba watu yang dikehendaki oleh kebijaksanaan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 40",
    "description": "Jangan pernah menduga kalau Allah dan rasulullah membutuhkan pertolonganmu untuk mengalahkan musuh-Musuh-Nya. Tentu saja tidak. Karena itu, jika kamu tidak menolongnya, yakni nabi Muhammad dalam perang tabuk, sesungguhnya Allah telah menolong dan menguatkan-Nya, antara lain menolong beliau ketika orang-orang kafir mengusirnya dari mekah, sedang saat itu dia salah seorang dari dua orang, yakni beliau hanya ditemani abu bakar. Situasi saat itu benar-benar menegangkan, yaitu ketika keduanya berada dalam gua dan orang-orang kafir ada di sekitarnya, maka ketika itu Allah menguatkan jiwa beliau sehingga dengan penuh keyakinan dia berkata kepada sahabatnya, abu bakar, jangan engkau bersedih, sesungguhnya Allah bersama kita dan menolong serta melindungi kita. Sebagai bentuk pertolongan Allah, maka Allah menurunkan ketenangan kepadanya, yakni nabi Muhammad, sehingga mampu menghadapi situasi yang sangat sulit tersebut dan bahkan membantu beliau dengan bala tentara, berupa malaikat-malaikat yang tidak terlihat olehmu, dan dia menjadikan seruan orang-orang kafir kepada kedurhakaan dan kemusyrikan itu rendah, sebab usaha mereka untuk mematikan api islam bahkan membunuh rasulullah ternyata gagal. Dan bahkan sebaliknya, kalimat Allah, yakni agama islam, itulah yang tinggi. Demikian ini, karena Allah mahaperkasa, lagi mahabijaksana. Setelah Allah mengecam sekaligus mengancam mereka yang enggan berperang, serta menegaskan bahwa Allah akan senantiasa menolong orang-orang mukmin, maka ayat ini menguatkan perintah berperang yang semata-mata demi kemaslahatan. Berangkatlah kamu ke medan perang dengan penuh semangat, baik dengan rasa ringan maupun dengan rasa berat, kondisi kuat atau lemah, kondisi longgar maupun sempit, masing-masing sesuai dengan kadar kemampuannya, dan berjihadlah dengan harta dan jiwamu di jalan Allah. Yang demikian itu adalah lebih baik bagimu jika kamu mengetahui tujuan berjihad di jalan Allah itu, antara lain, terlindunginya kaum lemah, melawan kezaliman, juga menjaga jalan dakwah dari perilaku zalim musuh-Musuh isla."
  }
]