[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Keluarlah kalian (wahai kaum Mukminin), untuk berjihad di jalan Allah, baik para pemuda maupun orang-orang yang sudah tua, dalam kondisi sulit maupun mudah, dalam seperti apapun keadaan kalian. Dan infakkanlah harta benda kalian di jalan Allah dan perangilah oleh kalian dengan tangan-tangan kalian untuk meniggikan kalimat Allah. Keluar dan infak tersebut lebih baik bagi kalian dalam keadaan kalian dan harta kalian daripada merasa berat, tidak berinfak serta tidak tidak ambil bagian dalam perang, bila kalian memang termasuk orang-orang yang mengetahui keutamaan jihad dan pahalanya da sisi Allah, maka laksanakanlah apa yang diperintahkan kepada kalian dan penuhilah seruan Allah dan RasulNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "41. Berangkatlah kalian -wahai orang-orang mukmin- ke medan jihad fi sabilillah dalam keadaan sulit maupun mudah, dalam usia muda maupun tua, dalam keadaan ringan maupun berat. Dan berjihadlah dengan harta dan diri kalian. Karena berjihad dengan harta dan jiwa itu lebih bermanfaat bagi kehidupan dunia dan Akhirat dibanding duduk berpangku tangan dan mengharapkan keselamatan bagi harta dan jiwa kalian. Jika kalian mengetahui hal itu maka usahakanlah dengan sekuat tenaga."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "41. Setelah Allah mengancam orang-orang yang tidak pergi berjihad bersama Rasulullah dan merasa berat untuk pergi, kemudian Allah melanjutkannya dengan perintah yang sangat tegas, dengan mewajibkan jihad bagi setiap orang, sehingga tidak ada alasan bagi siapapun untuk tidak ikut berjihad; Dia berfirman: “Hai orang-orang beriman, pergilah berjihad, baik itu dalam keadaan mudah ataupun sulit, masih muda maupun sudah tua. Berjihadlah di jalan Allah dengan harta dan jiwa kalian. Pergi berjihad di jalan Allah dengan jiwa dan harta lebih berguna bagi kalian di dunia dan di akhirat daripada duduk di rumah mencari keselamatan jiwa dan harta. Adapun dalam perkara agama, maka tidak ada kebahagiaan melainkan bagi orang yang menolong kebenaran dan menegakkan keadilan; sedangkan dalam perkara agama, maka tidak ada kemuliaan dan kejayaan bagi umat melainkan dengan kekuatan dan persiapan perang yang merupakan cara untuk melawan musuh. Hal ini jika kalian mengetahui ilmu yang dapat mendorong untuk mengamalkannya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "41. انفِرُوا۟ خِفَافًا وَثِقَالًا (Berangkatlah kamu baik dalam keadaan merasa ringan maupun berat) Baik dalam keadaan semangat maupun tidak, miskin maupun kaya, muda maupun tua, berjalan kaki maupun naik kuda, mempunyai tanggungan keluarga nafkah maupun tidak. وَجٰهِدُوا۟ بِأَمْوٰلِكُمْ وَأَنفُسِكُمْ فِى سَبِيلِ اللهِ ۚ( dan berjihadlah kamu dengan harta dan dirimu di jalan Allah) Hukum berjihad adalah fardhu kifayah, namun jika musuh tidak dapat dihadapi kecuali oleh seluruh kaum muslimin di suatu negeri maka wajib bagi mereka semua untuk ikut berjihad karena hukumnya menjadi wajib ain. ذٰلِكُمْ (Yang demikian itu) Yakni perintah pergi berjihad itu. خَيْرٌ لَّكُمْ (adalah lebih baik bagimu) Yakni terdapat kebaikan yang besar bagi kalian. Atau lebih baik daripada tetap tinggal dan tidak pergi berperang."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "41. Wahai orang-orang mukmin, keluarlah kalian semua untuk berjihad di jalan Allah dengan semangat maupun tidak, dengan kuda-kuda dan para lelaki, berjalan dan berkendara. Berjihadlah dengan sebenar-benarnya menggunakan harta dan jiwa untuk menolong agama Allah. perintah untuk keluar dan jihad itu lebih baik dan lebih agung bagi kalian di dunia dan akhirat, jika kalian mengetahuinya. Dan sesungguhnya dalam jihad itu mengandung kemuliaan dunia dan kebahagiaan akhirat. Ayat ini turun terkait orang-orang yang ingin uzur karena sibuk bekerja, lalu Allah menolak untuk memaafkan mereka kecuali mereka pergi untuk melakukan kewajiban mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Berangkatlah kamu baik dengan rasa ringan maupun dengan rasa berat} baik yang mudan maupun tua, yang rajin maupun yang malas, yang berkendara maupun berjalan, yang miskin maupun yang kaya {dan berjihadlah dengan harta dan jiwa kalian di jalan Allah. Yang demikian itu adalah lebih baik bagi kalian jika kalian mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "41. Allah berfirman kepada hamba-hambaNya yang beriman, mendorong mereka untuk berjihad di jalanNya. Dia berfirman, “Berangkatlah kamu baik dalam keadaan merasa ringan ataupun merasa berat”, dalam kondisi sulit maupun mudah, semangat maupun terpaksa, panas maupun dingin, dan dalam semua kondisi. “Dan berjihadlah dengan harta dan dirimu di jalan Allah.” Yakni keluarkan dayamu untuk itu, berikanlah kemampuanmu dalam harta dan jiwa. Ini adalah dalil bahwa sebagaimana jihad itu wajib pada jiwa, ia juga wajib pada harta, sesuai dengan tuntutan situasi dan kondisi, kemudian Dia berfirman, “Yang demikian itu adalah lebih baik bagimu jika kamu mengetahui.” Yakni, jihad dengan jiwa dan harta adalah lebih baik bagimu daripada berpangku tangan, karena ia mengandung ridha Allah dan kemenangan dengan derajat yang tinggi disisiNya, serta membantu agamaNya dan masuk ke dalam golongan dan tentaraNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 41: Yakni baik dalam keadaan semangat atau tidak, dalam keadaan kuat atau lemah, dalam keadaan kaya atau miskin dan dalam semua keadaan. Menurut penyusun Tafsir Al Jalaalain ayat ini dimansukh dengan ayat, “Laisa ‘aladh dhu’afaa…dst” (At Taubah: 91). Berjihad dengan jiwa dan harta lebih baik dari berdiam di tempat, karena di sana terdapat keridhaan Allah, memperoleh derajat yang tinggi di sisi-Nya, membela agama Allah, dan masuk ke dalam barisan tentara-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 41",
    "description": "Setelah Allah mengecam sekaligus mengancam mereka yang enggan berperang, serta menegaskan bahwa Allah akan senantiasa menolong orang-orang mukmin, maka ayat ini menguatkan perintah berperang yang semata-mata demi kemaslahatan. Berangkatlah kamu ke medan perang dengan penuh semangat, baik dengan rasa ringan maupun dengan rasa berat, kondisi kuat atau lemah, kondisi longgar maupun sempit, masing-masing sesuai dengan kadar kemampuannya, dan berjihadlah dengan harta dan jiwamu di jalan Allah. Yang demikian itu adalah lebih baik bagimu jika kamu mengetahui tujuan berjihad di jalan Allah itu, antara lain, terlindunginya kaum lemah, melawan kezaliman, juga menjaga jalan dakwah dari perilaku zalim musuh-Musuh islaayat sebelumnya mendorong kaum mukmin untuk berjihad, sekaligus mengecam mereka yang merasa keberatan, maka ayat ini turun berkenaan dengan sikap kaum munafik yang enggan berangkat ke perang tabuk. Sekiranya yang kamu serukan kepada kaum munafik, dalam perkiraan mereka, ada keuntungan duniawi yang jelas serta mudah diperoleh dan perjalanan yang tidak seberapa jauh lagi tidak sulit, juga ditambah udara yang tidak terlalu panas, niscaya mereka akan mengikutimu meskipun tidak dengan sepenuh hati. Akan tetapi, mereka akan enggan berangkat perang jika tempat yang dituju itu terasa sangat jauh bagi mereka. Bahkan untuk membangun alasan agar ketidakberangkatan mereka ke medan perang dianggap benar, mereka tanpa merasa bersalah akan bersumpah dengan nama Allah, padahal sebenarnya bohong, jikalau kami sanggup niscaya kami berangkat bersamamu. Padahal sumpah palsu mereka untuk tidak turut berperang itu telah membinasakan diri sendiri, karena kebohongan yang ditutuptutupi padahal Allah mengetahui bahwa mereka benar-benar orang-orang yang berdusta. Inilah salah satu karakter orang munafik, yaitu tidak siap menanggung derita dalam melaksanakan perintah Allah."
  }
]