[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah mencela sekelompok dari golongan kaum munafik yang meminta izin kepada Rasulullah untuk tidak ambil bagian dalam perang Tabuk, untuk menerangkan bahwa seandainya tujuan keluar mereka adalah menuju harta rampasan yang berada di tempat yang dekat lagi mudah dicapai,dan perjalanan yang tidak berta pastilah mereka akan mengikutimu. Akan tetapi, karena mereka diseru untuk memerangi kekuatan Romawi yang berada di perbatasan negri Syam pada musim panas, merekapun mundur dan tidak ikut berangkat. Dan mereka akan mengajukan alasan ketidak berangkatan mereka dengan bersumpah bahwa sesungguhnya mereka tidak mampu melakukan hal itu. Mereka telah membinasakan diri mereka dengan kedustaan dan kemunafikan, dan Allah mengetahui bahwa sesungguhnya mereka itu benar-benar dusta dalam alasan-alasan yang mereka ungkapkan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "42. Sekiranya apa yang kamu serukan kepada orang-orang munafik yang meminta izin kepadamu untuk tidak pergi ke medan perang itu adalah untuk mengambil rampasan perang yang mudah dan perjalanan yang tidak berat, niscaya mereka mau mengikuti seruanmu, -wahai Nabi-. Akan tetapi karena jarak yang kamu serukan kepada mereka untuk ditempuh agar sampai ke tempat musuh itu sangat jauh, maka mereka memilih tinggal di rumah. Dan orang-orang munafik yang meminta izin kepadamu untuk tidak pergi ke medan jihad itu akan bersumpah dengan nama Allah ketika kamu kembali kepada mereka dan berkata, “Seandainya kami bisa pergi ke medan jihad bersama kalian, pasti kami pergi bersama kalian.” Mereka mencelakakan diri mereka sendiri dengan menjadikannya sebagai sasaran hukuman Allah akibat keengganan mereka pergi ke medan jihad dan akibat iman mereka yang palsu ini. Dan Allah mengetahui dengan pasti perihal kebohongan mereka dalam pengakuan dan iman mereka itu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "42. Setelah Allah mendorong mereka untuk berjihad di jalan-Nya dan menjelaskan bahwa sebagian mereka merasa berat untuk melakukannya, maka kemudian Allah menjelaskan bahwa sebagian mereka tidak ikut berjihad dan mulai menungkapkan berbagai macam alasan yang dibuat-buat; mereka meminta izin Rasulullah agar tetap duduk di rumah dan tidak ikut berjihad. Allah berfirman: “Hai Nabi, seandainya apa yang kamu serukan kepada orang-orang munafik yang meminta izin itu merupakan untuk mengambil harta ghanimah dengan mudah dan perjalanan yang tidak memberatkan, niscaya mereka akan mengikutimu. Akan tetapi bagi mereka perjalanan itu sangat jauh untuk sampai kepada musuh, sehingga mereka enggan pergi berjihad. Sungguh orang-orang munafik yang meminta izin itu akan bersumpah dengan nama Allah ketika kamu kembali dari berjihad, ‘Seandainya kami mampu untuk pergi barsama kalian ke medan jihad, niscaya kami akan pergi’. Mereka telah membinasakan diri mereka dengan mendatangkannya kepada azab Allah akibat sumpah dusta mereka. Allah Maha Mengetahui bahwa mereka berdusta dalam ucapan dan sumpah itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "42. لَوْ كَانَ عَرَضًا قَرِيبًا (Kalau yang kamu serukan kepada mereka itu keuntungan yang mudah diperoleh) Seandainya apa yang diserukan itu merupakan harta ghanimah yang berada di tempat yang tidak jauh. وَسَفَرًا قَاصِدًا(dan perjalanan yang tidak seberapa jauh) Yakni pertengahan, tidak dekat dan tidak pula jauh. لَّاتَّبَعُوكَ(pastilah mereka mengikutimu) Yakni mereka yang tidak ikut berperang bersamamu itu niscaya akan berangkat bersamamu. وَلٰكِنۢ بَعُدَتْ عَلَيْهِمُ الشُّقَّةُ ۚ( tetapi tempat yang dituju itu amat jauh terasa oleh mereka) Yakni menuju ke tempat perang Tabuk. Karena perjalanan ke sana sangat jauh dan berat. وَسَيَحْلِفُونَ بِاللهِ(Mereka akan bersumpah dengan (nama) Allah) Yakni mereka yang tidak ikut perang Tabuk bersamamu itu akan bersumpah dengan mengatakan: “Jikalau kami sanggup tentulah kami berangkat bersama-samamu”. لَوِ اسْتَطَعْنَا لَخَرَجْنَا مَعَكُمْ(“Jikalau kami sanggup tentulah kami berangkat bersama-samamu”) Yakni seandainya kami mampu untuk pergi dan mempunyai apa yang kami butuhkan untuk pergi niscaya kami akan pergi bersama kalian. يُهْلِكُونَ أَنفُسَهُمْ(Mereka membinasakan diri mereka sendiri) Karena siapa yang bersumpah dengan sumpah dusta maka ia telah membinasakan dirinya. وَاللهُ يَعْلَمُ إِنَّهُمْ لَكٰذِبُونَ(dan Allah mengetahui bahwa sesungguhnya mereka benar-benar orang-orang yang berdusta) Yakni berdusta dalam sumpah yang mereka ucapkan kepada kalian. Mereka sebenarnya memiliki kemampuan untuk pergi berperang namun mereka memperlambat diri mereka dan enggan untuk berjihad."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ لَوِ اسْتَطَعْنَا لَخَرَجْنَا مَعَكُمْ } \"Jikalau kami sanggup tentulah kami berangkat bersama-samamu\" Kalimat ini juga dikatakan pada perang yang sama pada kaum yang mereka adalah : { تَوَلَّوْا وَأَعْيُنُهُمْ تَفِيضُ مِنَ الدَّمْعِ حَزَنًا أَلَّا يَجِدُوا مَا يُنْفِقُونَ } \"lalu mereka kembali, sedang mata mereka bercucuran air mata karena kesedihan, lantaran mereka tidak memperoleh apa yang akan mereka nafkahkan\". [ At-Taubah : 92 ]. Orang gagal tidak akan baik hanya dengan permohonan maaf!."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "42. Wahai rasul, kalau perintah yang kamu serukan itu kenikmatan dunia yang mudah diterima dan perjalanan yang mudah lagi normal, sungguh mereka akn berjalan bersamamu, yaitu orang-orang yang mengundurkan diri, namun mereka mengundurkan diri untuk pergi mengikuti perang Tabuk sedangkan telah terbuka jalan bagi mereka di waktu yang longgar. Dan mereka akan bersumpah demi Allah ketika kalian kembali dengan berkata: “Andai saja memungkinkan bagi kami untuk keluar menemui musuh, sungguh kami akan keluar bersama kalian” Mereka membinasakan diri sendiri dengan bersumpah palsu. Dan Allah mengetahui bahwa mereka berdusta dalam keimanannya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika kamu serukan kepada mereka keuntungan yang mudah} harta rampasan yang mudah didapat {dan perjalanan yang tidak seberapa jauh} yang mudah lagi jaraknya sedang dan tidak ada kesulitan di dalamnya {niscaya mereka mengikutimu} mereka akan keluar bersamamu {Akan tetapi, bagi mereka jaraknya} jaraknya {itu terasa sangat jauh. Mereka akan bersumpah dengan (nama) Allah,“Seandainya kami sanggup niscaya kami berangkat bersama kalian.” Mereka membinasakan diri sendiri} dengan sumpah palsu {dan Allah mengetahui sesungguhnya mereka adalah para pembohong"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "42. “Kalau”, keluarnya mereka itu untuk mencari keuntungan yang mudah untuk didapatkan atau manfaat dunia yang mudah untuk diraih, atau bepergiannya adalah, “Perjalanan yang tidak berapa jauh,” yakni mudah lagi dekat, “pastilah mereka mengikutimu”, karena tidak adanya kesulitan yang berarti. “Tetapi tempat yang dituju itu amatlah jauh terasa oleh mereka.” Jaraknya bagi mereka adalah jauh. Perjalanannya bagi mereka adalah sulit. Oleh karena itu, mereka merasa berat untuk mengikutimu. Ini bukanlah tanda penghambaan, akan tetapi seorang hamba yang hakiki yang benar-benar beribadah kepada Allah dalam kondisi apa pun. “Mereka akan bersumpah dengan (nama) Allah, ‘Jikalau kami sanggup tentulah kami berangkat bersama-samamu’. “ yakni mereka akan bersumpah bahwa tidak keluarnya mereka disebabkan oleh suatu alasan, dan bahwa mereka memang tidak mampu melakukan itu. “Mereka membinasakan diri mereka sendiri”, dengan duduk, berpangku tangan, berdusta, dan mengatakan sesuatu yang tidak sesuai dengan keyataannya. “Dan Allah mengetahui bahwa sesungguhnya mereka benar-benar orang-orang yang berdusta.” Sindiran ini hanyalah untuk orang-orang munafik yang tidak berpasrtisipasi bersama Nabi dalam perang Tabuk, lalu mereka menyampaikan alasan-alasan dusta, maka Nabi memaafkan mereka hanya dengan alasan yang mereka sampaikan, tanpa menguji mereka agar diketahui yang berdusta dan yang jujur, oleh karena itu Allah menegur Rasulullah atas ketergesa-gesaan beliau dalam memaklumi mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 42: Ayat ini turun berkenaan dengan orang-orang munafik yang tidak ikut berjihad. Karena hendak memperoleh ghanimah. Sehingga mereka tidak ikut. Padahal seorang hamba yang hakiki harus menuruti perintah Allah dalam setiap keadaan. Ketika kamu kembali kepada mereka. Mereka bersumpah, bahwa ketidakberangkatan mereka untuk berperang karena memiliki banyak uzur dan bahwa mereka tidak sanggup berangkat. Yakni mereka membinasakan dirinya dengan duduk tidak berperang, dengan dusta dan dengan memberitakan yang tidak sesuai dengan kenyataan. Celaan ini ditujukan kepada orang-orang munafik yang tidak ikut berperang bersama Rasulullah shallallahu 'alaihi wa sallam dalam perang Tabuk, mereka menyebutkan uzur-uzur yang dusta, lalu Nabi shallallahu 'alaihi wa sallam memaafkan mereka tanpa mengetes mereka terlebih dahulu sehingga diketahui siapa yang benar uzurnya dan siapa yang berdusta. Oleh karena sikap pemaafan dari Beliau terhadap mereka yang mengemukakan uzur tanpa dibuktikan lebih dulu, maka Allah Subhaanahu wa Ta'aala menegur Beliau dengan ayat selanjutnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 42",
    "description": "Ayat sebelumnya mendorong kaum mukmin untuk berjihad, sekaligus mengecam mereka yang merasa keberatan, maka ayat ini turun berkenaan dengan sikap kaum munafik yang enggan berangkat ke perang tabuk. Sekiranya yang kamu serukan kepada kaum munafik, dalam perkiraan mereka, ada keuntungan duniawi yang jelas serta mudah diperoleh dan perjalanan yang tidak seberapa jauh lagi tidak sulit, juga ditambah udara yang tidak terlalu panas, niscaya mereka akan mengikutimu meskipun tidak dengan sepenuh hati. Akan tetapi, mereka akan enggan berangkat perang jika tempat yang dituju itu terasa sangat jauh bagi mereka. Bahkan untuk membangun alasan agar ketidakberangkatan mereka ke medan perang dianggap benar, mereka tanpa merasa bersalah akan bersumpah dengan nama Allah, padahal sebenarnya bohong, jikalau kami sanggup niscaya kami berangkat bersamamu. Padahal sumpah palsu mereka untuk tidak turut berperang itu telah membinasakan diri sendiri, karena kebohongan yang ditutuptutupi padahal Allah mengetahui bahwa mereka benar-benar orang-orang yang berdusta. Inilah salah satu karakter orang munafik, yaitu tidak siap menanggung derita dalam melaksanakan perintah Allah. Orang-orang munafik benar-benar lihai dalam membuat berbagai alasan agar diizinkan untuk tidak berperang. Akhirnya, beliau mengizinkan mereka untuk tidak ikut berperang, maka ayat ini memberi teguran halus kepada beliau. Allah memaafkanmu, wahai nabi, mengapa engkau memberi izin kepada mereka untuk tidak pergi berperang, sebelum jelas bagimu orang-orang yang benar-benar berhalangan sehingga bisa dimaklumi untuk tidak ikut pergi berperang dan sebelum engkau mengetahui orang-orang yang berdusta dengan membuat-buat alasan yang tidak benar dan mengada-ada'"
  }
]