[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah memaafkanmu (wahai nabi), atas apa yang terjadi padamu berupa meninggalkan sikap yang lebih utama dam sempurna, yaitu dengan memberikan izin begi orang-orang munafik untuk tidak ikut berjihad, dengan alasan apapun kamu mengizinkan mereka untuk tidak ikut serta dalam peperangan tersebut, sehingga nampak menjadi jelas bagimu orang-orang yang jujur dalam menganjukan alasan ketidakikutnya dan mengetahui orang-orang yang berdusta dalam hal itu?."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "43. Mudah-mudahan Allah mengampunimu -wahai Rasul- atas ijtihadmu yang mengizinkan mereka untuk tidak pergi ke medan jihad. Mengapa kamu mengizinkan mereka (melakukan hal itu)? Supaya jelas siapa di antara mereka yang jujur dalam menyampaikan alasan-alasannya dan siapa yang berdusta. Kemudian kamu bisa memberikan izin (untuk tidak pergi ke medan perang) kepada mereka yang jujur dan bukan mereka yang berdusta."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "43. Kemudian Allah menegur Rasulullah yang telah memberi izin kepada orang-orang munafik untuk tidak ikut berjihad: “Hai Rasulullah, semoga Allah mengampunimu karena telah mengizinkan mereka tidak ikut berjihad; mengapa kamu mengizinkan mereka? Sedangkan belum jelas bagimu siapa yang benar alasannya dan siapa yang berdusta. Sehingga kamu dapat memberi izin kepada yang jujur, tanpa mengizinkan yang berdusta.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "43. عَفَا اللهُ عَنكَ لِمَ أَذِنتَ لَهُمْ (Semoga Allah memaafkanmu. Mengapa kamu memberi izin kepada mereka) Ini merupakan teguran Allah untuk Rasul-Nya karena setiap ada orang yang munafik yang meminta izin untuk tidak mengikuti peperangan beliau selalu mengizinkan. Yakni mengapa kamu terburu-buru memberi izin untuk mereka agar tidak mengikuti jihad dengan berbagai alasan yang mereka kemukakan kepadamu, mengapa kamu tidak bersabar sampai jelas siapa yang benar dalam alasannya dan siapa yang berbohong."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Mauroq al-'Ajali berkata : pernahkah kamu mendengar satu paringatan yang lebih baik dari ini ? diawali dengan maaf sebelum peringatan dilontarkan. 2 ). Diantara kelembutan ayat-ayat yang di dalamnya terdapat peringatan kepada Nabi, bahwa kamu mendapati ayat-ayat peringatan dan semisalnya, melainkan kamu akan menemukan ada ampunan dan kasih sayang di dalamnya, dalam surah at-Taubah : { عَفَا اللَّهُ عَنْكَ لِمَ أَذِنْتَ لَهُمْ } \"Semoga Allah memaafkanmu. Mengapa kamu memberi izin kepada mereka\", dan dalam al-Anfal 69 : { وَاتَّقُوا اللَّهَ ۚ إِنَّ اللَّهَ غَفُورٌ رَحِيمٌ } \"dan bertakwalah kepada Allah; sesungguhnya Allah Maha Pengampun lagi Maha Penyayang\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "43. Wahai Rasul, Allah memaafkanmu atas perijinanmu terhadap mereka untuk mengundurkan diri dari perang Tabuk. Kamu lambat laun akan mengetahui orang-orang yang sungguh-sungguh dalam uzurnya dan orang-orang yang berdusta di antara mereka yang tidak uzur sama sekali. Ayat ini turun terkait ijin orang-orang munafik selain perkara wahyu sebelumnya, yang mana mereka mengabaikan ayat sebelumnya. Dan Allah memberikan maaf sebagai suatu teguran"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah memaafkanmu. Mengapa kamu memberi izin kepada mereka sehingga jelas bagimu orang-orang yang jujur lalu kamu mengetahui orang-orang yang berdusta."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "43. Allah berfirman kepada RasulNya “Semoga Allah memaafkanmu.” Yakni mengampuni dan memaklumi apa yang kamu lakukan. “Mengapa kamu memberi izin kepada mereka,” untuk tidak pergi berperang, “Sebelum jelas bagimu orang-orang yang benar (dalam keudzurannya) dan sebelum kamu ketahui orang-orang yang berdusta?” dengan menguji mereka agar terbukti mana yang dusta dan mana yang benar sehingga kamu memaafkan siapa yang berhak dimaafkan dan siapa yang tidak."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 43: Didahulukan kata “memaafkan” untuk menenangkan hati Beliau. Yakni terhadap sikapmu itu. Bahwa ia tidak berhalangan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 43",
    "description": "Orang-orang munafik benar-benar lihai dalam membuat berbagai alasan agar diizinkan untuk tidak berperang. Akhirnya, beliau mengizinkan mereka untuk tidak ikut berperang, maka ayat ini memberi teguran halus kepada beliau. Allah memaafkanmu, wahai nabi, mengapa engkau memberi izin kepada mereka untuk tidak pergi berperang, sebelum jelas bagimu orang-orang yang benar-benar berhalangan sehingga bisa dimaklumi untuk tidak ikut pergi berperang dan sebelum engkau mengetahui orang-orang yang berdusta dengan membuat-buat alasan yang tidak benar dan mengada-ada' sebab orang-orang yang beriman kepada Allah dan hari kemudian akan senantiasa patuh untuk melaksanakan segala perintah Allah dan rasulnya, sehingga mereka tidak akan mungkin meminta izin kepadamu untuk tidak ikut berjihad. Bahkan sebaliknya, mereka selalu siap untuk berjihad dengan harta dan jiwa mereka. Sebab mereka mengetahui manfaat jihad, yaitu sebagai pintu gerbang mencapai kejayaan duniawi dan kebahagiaan ukhrawi. Inilah salah satu ciri ketakwaan, dan Allah mengetahui orang-orang yang bertakwa, yaitu mereka yang menjauhi apa saja yang bisa melahirkan murka Allah dan melaksanakan apa saja yang bisa mendatangkan rida-Nya, yang karenanya dia akan membalasnya dengan balasan yang berlipat di akhirat kelak."
  }
]