[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bukanlah termasuk orang-orang yang beriman kepada Allah dan RasulNya dan Hari Akhir, meminta izin kepadamu (wahai Nabi), untuk tidak ikut serta dalam jihad di jalan Allah dengan jiwa dan harta benda. Itu hanyalah sipat orang-orang muanfik dan Allah Maha Mngetahui orang yang takut kepadaNya, lalu bertakwa kepadaNya dengan menjalankan kewajiban-kawajiban dariNya dan menjauhi larangan-laranganNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "44. Sedangkan orang-orang yang benar-benar beriman kepada Allah dan hari Kiamat tidak akan meminta izin kepadamu -wahai Rasul- untuk tidak pergi ke medan jihad fi sabilillah dengan harta dan jiwa mereka. Mereka selalu siaga kapan saja mereka diminta pergi ke medan jihad dan selalu siap berjihad dengan harta dan jiwa mereka. Dan Allah Maha Mengetahui hamba-hamba-Nya yang bertakwa, yang tidak meminta izin (untuk tidak pergi ke medan jihad) kecuali benar-benar ada uzur (halangan) yang menghalangi keberangkatan mereka bersamamu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "44. Hai Rasulallah, bukan sifat orang-orang yang beriman kepada Allah dan hari kiamat dengan keimanan yang benar, yang meminta izin kepadamu agar dapat tidak mengikuti jihad di jalan Allah dengan harta dan jiwa mereka; namun sifat mereka adalah senantiasa siap pergi berjihad jika diminta, baik itu dengan harta maupun jiwa mereka. Allah Maha Mengetahui hamba-hamba-Nya yang bertakwa, yang tidak meminta izin kepadamu kecuali karena memiliki alasan yang benar yang menghalangi mereka pergi berjihad bersamamu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "44. لَا يَسْتَـْٔذِنُكَ الَّذِينَ يُؤْمِنُونَ بِاللهِ وَالْيَوْمِ الْاٰخِرِ أَنْ يُجٰهِدُوا۟ بِأَمْوٰلِهِمْ وَأَنفُسِهِمْ (Orang-orang yang beriman kepada Allah dan hari kemudian, tidak akan meminta izin kepadamu untuk tidak ikut berjihad dengan harta dan diri mereka) Yakni orang-orang beriman tidak akan meminta izin kepadamu, namun sikap mereka adalah bergegas dalam menjawab seruanmu tanpa duduk dan menunggu izin darimu, terlebih lagi meminta izin kepadamu untuk tidak ikut berperang. وَاللهُ عَلِيمٌۢ بِالْمُتَّقِينَ (Dan Allah mengetahui orang-orang yang bertakwa) Mereka adalah orang-orang yang tidak meminta izin kepada Rasulullah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "44. Biasanya orang-orang mukmin tidak akan meminta ijin kepadamu dalam berjihad, melainkan mereka akan bergegas melakukan perintah yang diberikan. Dan Allah itu mengawasi keadaan orang-orang yang bertakwa yang takut kepada Allah, sehingga mereka menaati perintah-perintahNya. Mereka itulah orang yang tidak meminta ijin untuk mengundurkan diri"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidak akan meminta izin kepadamu} untuk tidak ikut berjihad {orang-orang yang beriman kepada Allah dan hari akhir untuk berjihad dengan harta dan jiwa mereka. Allah Maha Mengetahui orang-orang yang bertakwa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "44. Kemudian Allah memberitahukan bahwa orang-orang yang beriman kepada Allah dan Hari Akhir tidak akan meminta izin untuk tidak pergi berjihad dengan harta dan jiwa mereka, karena mereka memiliki semangat kepada kebaikan yang membuat mereka terdorong untuk berjihad tanpa memerlukan adanya pendorong, apalagi mereka meminta izin untuk tidak berjihad tanpa alasan. “dan Allah mengetahui orang-orang yang bertakwa.” Maka Dia membalas mereka dengan ketakwaan yang mereka lakukan. Dan diantara ilmu Allah yang di berikan kepada orang-orang yang bertakwa adalah bahwa Dia menyatakan bahwa di antara tanda-tandanya adalah mereka meminta izin untuk tidak berjihad."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 44: Yakni tidak mungkin mereka meminta izin untuk tidak berjihad padahal dalam hati mereka terdapat kecintaan kepada kebaikan dan keimanan, yang membuat mereka ingin berjihad. Oleh karenanya Dia memberitahukan, bahwa orang-orang yang bertakwa tidak akan meminta izin kepadamu untuk tidak berjihad."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 44",
    "description": "Sebab orang-orang yang beriman kepada Allah dan hari kemudian akan senantiasa patuh untuk melaksanakan segala perintah Allah dan rasulnya, sehingga mereka tidak akan mungkin meminta izin kepadamu untuk tidak ikut berjihad. Bahkan sebaliknya, mereka selalu siap untuk berjihad dengan harta dan jiwa mereka. Sebab mereka mengetahui manfaat jihad, yaitu sebagai pintu gerbang mencapai kejayaan duniawi dan kebahagiaan ukhrawi. Inilah salah satu ciri ketakwaan, dan Allah mengetahui orang-orang yang bertakwa, yaitu mereka yang menjauhi apa saja yang bisa melahirkan murka Allah dan melaksanakan apa saja yang bisa mendatangkan rida-Nya, yang karenanya dia akan membalasnya dengan balasan yang berlipat di akhirat kelak. Sesungguhnya yang akan meminta izin kepadamu, wahai nabi Muhammad, hanyalah orang-orang munafik yang sejatinya tidak beriman kepada Allah, mereka tidak mengenal keagungan-Nya dan juga tidak beriman kepada hari kemudian sehingga tidak terdorong untuk meraih kebahagiaan akhirat, dan bahkan hati mereka ragu atas balasan Allah di akhirat kepada para mujahid, karena itu mereka selalu bimbang dalam keraguan, sehingga terkadang ikut berperang namun pada kali lain tidak ikut, tergantung keadaan serta ada atau tidaknya keuntungan duniawi di balik perintah berperang tersebut."
  }
]