[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang yang mengajukan izin untuk tidak ikut serta dalam berjihad hanyalah orang-orang yang tidak percaya kepada Allah dan Hari Akhir, dan tidak mengerjakan amal shalih, dan hati mereka ragu-ragu terhadap kebenaran risalah yang kamu bawa (wahai Nabi), berupa islam dan syariat-syariatnya. Dan mereka dalam keraguan-keraguan mereka kebingungan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "45. Sesungguhnya orang-orang yang meminta izin kepadamu -wahai Rasul- untuk tidak pergi ke medan jihad fi sabilillah ialah orang-orang munafik. Yaitu orang-orang yang tidak beriman kepada Allah dan tidak beriman kepada hari Kiamat dan hati mereka diselimuti keraguan terhadap agama Allah. Mereka terombang-ambing oleh kebimbangan mereka tanpa bisa menemukan jalan yang benar."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "45. Hai Rasulallah, sesungguhnya orang-orang yang meminta izin kepadamu untuk tidak ikut berjihad di jalan Allah adalah orang-orang munafik yang tidak beriman kepada Allah dan hari kiamat; mereka memiliki keraguan terhadap agama Allah sehingga mereka kebingungan dan tidak mendapat petunjuk menuju kebenaran."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "45. إِنَّمَا يَسْتَـْٔذِنُكَ (Sesungguhnya yang akan meminta izin kepadamu) Untuk tidak ikut serta dalam berjihad. الَّذِينَ لَا يُؤْمِنُونَ بِاللهِ وَالْيَوْمِ الْأٰ خِرِ (hanyalah orang-orang yang tidak beriman kepada Allah dan hari kemudian) Mereka adalah orang-orang munafik. Disini disebutkan keimanan kepada Allah dan hari kemudian karena keduanya merupakan pendorong untuk berjihad di jalan Allah. وَارْتَابَتْ قُلُوبُهُمْ (dan hati mereka ragu-ragu) Makna (الريب) yakni keraguan. فَهُمْ فِى رَيْبِهِمْ يَتَرَدَّدُونَ(karena itu mereka selalu bimbang dalam keraguannya) Yakni kebingungan. Mereka yang meminta izin kepadamu tanpa alasan yang dibenarkan bukanlah termasuk orang-orang beriman, akan tetapi mereka adalah orang-orang yang ragu dan kebingungan terhadap agamanya, yang tidak mendapat petunjuk ke jalan yang benar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "45. Sesungguhnya orang yang meminta ijin kepadamu untuk mengundurkan diri dari jihad adalah orang-orang yang tidak beriman kepada Allah dan akhiratNya. Mereka itulah orang-orang munafik. Dan keimanan adalah kebaikan yang mendorong untuk berjihad. Sesungguhnya mereka itu hatinya ragu terhadap agama (Islam), dan dalam keraguan itu mereka bingung dan gelisah (memilih) antara kekkufuan dan keimanan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya yang meminta izin kepadamu adalah orang-orang yang tidak beriman kepada Allah dan hari akhir, dan hati mereka ragu} ragu {maka mereka selalu bimbang} bingung {dalam keraguan mereka} dalam keraguan mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "45. “Seungguhnya yang akan meminta izin kepadamu, hanyalah orang-orang yang tidak beriman kepada Allah dan Hari Kemudian, dan hati mereka ragu-ragu.” Yakni, mereka tidak memiliki iman yang sempurna dan keyakinan yang benar. Oleh karena itu, keinginan mereka kepada kebaikan pun minim mereka takut berperang, mereka harus meminta izin untuk tidak berperang. “karena itu mereka selalu bimbang dalam keraguannya.” Yakni selalu dalam kebimbangan dan kebingungannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 45: Yakni mereka yang tidak memiliki iman yang sempurna dan keyakinan yang benar, sehingga keinginan mereka kepada kebaikan sangat sedikit dan takut berperang."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 45",
    "description": "Sesungguhnya yang akan meminta izin kepadamu, wahai nabi Muhammad, hanyalah orang-orang munafik yang sejatinya tidak beriman kepada Allah, mereka tidak mengenal keagungan-Nya dan juga tidak beriman kepada hari kemudian sehingga tidak terdorong untuk meraih kebahagiaan akhirat, dan bahkan hati mereka ragu atas balasan Allah di akhirat kepada para mujahid, karena itu mereka selalu bimbang dalam keraguan, sehingga terkadang ikut berperang namun pada kali lain tidak ikut, tergantung keadaan serta ada atau tidaknya keuntungan duniawi di balik perintah berperang tersebut. Ayat sebelumnya menjelaskan perbedaan antara kaum mukmin dan munafik dalam menyikapi perintah berperang, maka ayat ini menyebutkan salah satu ciri orang munafik. Dan seandainya mereka, kaum munafik, mau berangkat untuk berperang, niscaya mereka akan menyiapkan persiapan untuk keberangkatan itu sebagaimana orang-orang mukmin yang lain, namun hal itu tidak akan pernah mereka lakukan, karena sejak awal mereka memang tidak ingin berangkat berperang. Akan tetapi seandainya mereka berangkat berperang dengan kondisi jiwa semacam itu justru hanya akan menciptakan kekacauan dalam barisan umat muslim dan melemahkan jiwanya, karena itu Allah tidak menyukai keberangkatan mereka untuk berperang beserta kaum mukminin, maka dia melemahkan keinginan dan niat mereka untuk berangkat ke medan perang, dan seakan dikatakan dalam hati mereka, jangan berangkat ke medan perang dan tinggAllah kamu bersama orang-orang yang tinggal itu, yakni bersama anak-anak, para wanita, dan orang-orang tua. '"
  }
]