[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sekiranya orang-orang munafik itu memang berkehendak keluar bersamamu (wahai nabi) menuju jihad, pastilah mereka akan bersiap-siap menyongsongnya dengan perbekalan dan kendaraan. Akan tetapi, Allah tidak meyukai mereka ikut keluar (berangkat), sehingga amat beratlah bagi mereka untuk keluar, sebagai ketatapan Qadha’ dan Qadhar, meskipun memerintahkan mereka untuk itu dalam syariat. Dan dikatakan kepada mereka, “Tinggalah kalian bersama orang-orang yang tinggal seperti orang-orang yang sakit, orang-orang yang lemah dan kaum wanita serta anak-anak."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "46. Seandainya mereka jujur dengan pengakuan mereka bahwa mereka ingin pergi ke medan jihad fi sabilillah bersamamu tentu mereka telah bersiap-siap untuk itu dengan menyiapkan perlengkapan perang mereka. Akan tetapi Allah tidak merestui kepergian mereka bersamamu. Mereka pun merasa berat untuk pergi berjihad hingga akhirnya mereka lebih memilih tinggal di rumah masing-masing."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "46. Seandainya mereka benar bahwa mereka ingin pergi berjihad bersamamu di jalan Allah, niscaya mereka akan menyiapkan bekalnya. Akan tetapi Allah tidak menyukai kepergian mereka bersamamu, sehingga membuat mereka terlambat pergi, untuk menghinakan mereka; dikatakan kepada mereka: \"Duduklah kalian di rumah bersama para wanita, anak-anak, dan orang-orang sakit.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "46. وَلَوْ أَرَادُوا۟ الْخُرُوجَ لَأَعَدُّوا۟ لَهُۥ عُدَّةً (Dan jika mereka mau berangkat, tentulah mereka menyiapkan persiapan untuk keberangkatan itu) Yakni seandainya mereka benar dalam pengakuan mereka niscaya mereka tidak akan berhenti menyiapkan persiapan perang sebelum terjadinya perang sebagaimana persiapan yang dilakukan orang-orang beriman, namun sebenarnya mereka tidak menginginkan untuk ikut berperang, oleh sebab itu mereka tidak menyiapkan diri untuk berperang dengan mempersiapkan perbekalan, hewan tunggangan, dan persenjataan. وَلٰكِن كَرِهَ اللهُ انۢبِعَاثَهُمْ فَثَبَّطَهُمْ(tetapi Allah tidak menyukai keberangkatan mereka, maka Allah melemahkan keinginan mereka) Yakni Allah menghalangi mereka untuk pergi bersamamu dan menghinakan mereka, sebab mereka berkata: “jika Rasulullah tidak mengizinkan kami untuk tidak ikut berperang maka kami akan membuat kerusakan dan mengajak orang-orang beriman lainnya untuk tidak ikut berperang. وَقِيلَ اقْعُدُوا۟( dan dikatakan kepada mereka: “Tinggallah kamu) Allah memasukkan ke dalam hati mereka keinginan untuk tidak ikut berperang sebagai penghinaan bagi mereka. مَعَ الْقٰعِدِينَ(bersama orang-orang yang tinggal itu”) Yakni bersama orang-orang yang tidak mampu untuk berperang seperti orang buta, sakit-sakitan, para wanita, dan anak-anak. Dan ini merupakan penghinaan dan pelecehan bagi mereka secara jelas."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Baiknya persiapan untuk sauatu pertemuan adalah kunci segala amalan shalih, dan merupakan kebiasaan orang-orang shalih { وَلَوْ أَرَادُوا الْخُرُوجَ لَأَعَدُّوا لَهُ عُدَّةً } \"Dan jika mereka mau berangkat, tentulah mereka menyiapkan persiapan untuk keberangkatan itu\". 2 ). Sebelum datangnya bulan ramadhan; maka sebaiknya setiap muslim lebih mentdabburi ayat ini : { وَلَوْ أَرَادُوا الْخُرُوجَ لَأَعَدُّوا لَهُ عُدَّةً } , dan diantara persiapan yang paling baik dari seorang hamba untuk memasuki bulan yang suci ini adalah : membersihkan hati dari segala dosa -dan ini merupakan hak Allah atas hamba-Nya- dan dari segala kebencian dan kedengkian yang terjadi diantara sesama manusia, jika tidak dihawatirkan akan terjadi pada diri seorang hamba yang dimaksudkan pada akhir ayat ini : { وَلَٰكِنْ كَرِهَ اللَّهُ انْبِعَاثَهُمْ } \"tetapi Allah tidak menyukai keberangkatan mereka\" dan sesungguhnya Allah tidak sekali-kali menganiaya seorangpun dari hamba-Nya. 3 ). Jika kamu dihalangi untuk melakukan ketaatan, maka tetaplah kamu diatas ketaatan itu walau dalam ketakutan daripada engkau termasuk orang-orang yang dicampakkan oleh Allah, dan dilemahkan oleh-Nya dari ketaatan sebagaimana yang terjadi pada orang-orang munafiq yang dilemahkan keinginan mereka untuk keluar di jalan jihad."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "46. Kalaupun mereka menginginkan kebenaran dan keluar bersamamu untuk berjihad, niscaya mereka sudah mempersiapkannya di beberapa kesempatan, yaitu mempersiapkan pedang, perlengkapan perang, bekal dan kendaraan, namun Allah tidak suka kepergian mereka bersamamu dan tujuan mereka, sehingga Dia menahan dan merintangi mereka untuk keluar dengan memberi ketakutan dan kemalasan. Dikatakan kepada mereka: “Diamlah di rumah-rumah kalian bersama orang-orang yang uzur dan orang-orang yang cacat, yaitu orang buta, orang lemah, orang yang sakit, para wanita dan anak-anak” Hal ini mengandung tujuan untuk mencela dan menghinakan mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Seandainya mereka mau berangkat, niscaya mereka membuat persiapan untuk keberangkatan itu} mereka telah bersiap-siap untuk itu {Namun Allah tidak menyukai} membenci {keberangkatan mereka} keberangkatan mereka bersamamu {maka Dia melemahkan keinginan mereka} maka Dia membuat berat keberangkatan itu kepada mereka dan membuat mereka malas terhadap hal itu {dan dikatakan,“Tinggallah} tinggalkanlah jihad {bersama orang-orang yang tinggal”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "46. Allah berfirman menjelaskan bahwa orang-orang yang tidak ikut serta dalam berjihad dari kalangan orang-orang munafik, telah Nampak dari mereka indikasi-indikasi tidak ingin berjihad sama sekali, dan bahwa alasan yang mereka ajukan adalah batil, karena alasan yang benar adalah penghalang yang menghalangi jika seorang hamba telah mengeluarkan upayanya dan berusaha melakukan sebab-sebab yang dengannya dia bisa keluar berjihad lalu dia terhalangi oleh penghalang yang syar’I inilah yang di anggap sebagai alasan, adapun orang-orang munafik itu seandainya “mereka mau berangkat, tentulah mereka menyiapkan persiapan untuk keberangkatan itu.” Yakni, mereka pasti bersiap-siap dan melakukan sarana-sarana yang membantu, akan tetapi karena mereka tidak melakukan persiapan, maka terbuktilah bahwa memang mereka tidak ingin berangkat. “Tetapi Allah tidak menyukai keberangkatan mereka”, bersamamu kepada jihad, “maka Allah melemahkan keinginan mereka”, dengan qadha dan qadarnya, meskipun Dia telah memerintahkan mereka dan mendorong mereka untuk keluar berjihad dan menjadikan mereka mampu untuk itu akan tetapi dengan hikmahNya Dia tidak berkenan membantu mereka, Dia membiarkan dan melemahkan niat mereka, “dan dikatakan kepada mereka, ‘Tinggallah kamu bersama orang-orang yang tinggal itu’.” Dari kalangan para wanita dan orang-orang yang berhalangan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 46: Allah Subhaanahu wa Ta'aala menerangkan bahwa mereka yang tidak ikut berperang, yakni dari kalangan kaum munafik sesungguhnya telah nampak pada lahiriah mereka qarinah (tanda) yang menunjukkan bahwa mereka tidak memiliki keinginan untuk pergi berperang, dan bahwa uzur yang mereka kemukakan adalah batil, karena uzur yang sesungguhnya adalah penghalang yang menghalangi seseorang ketika seseorang telah bersusah payah untuk berangkat, kemudian ada penghalang syar’i. Inilah orang yang diberi uzur, sedangkan orang-orang munafik itu sebelumnya sengaja tidak mempersiapkan apa-apa yang menunjukkan bahwa mereka tidak ingin berangkat. Dalam qadar-Nya yang terdahulu maupun qadha’-Nya (ketika terjadinya), meskipun Dia telah memerintahkan mereka dan mendorong mereka untuk keluar serta menjadikan mereka sanggup, akan tetapi Allah dengan hikmah-Nya tidak membantu mereka, bahkan membiarkan dan melemahkan semangat mereka. Yaitu orang-orang yang sakit, wanita dan anak-anak."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 46",
    "description": "Ayat sebelumnya menjelaskan perbedaan antara kaum mukmin dan munafik dalam menyikapi perintah berperang, maka ayat ini menyebutkan salah satu ciri orang munafik. Dan seandainya mereka, kaum munafik, mau berangkat untuk berperang, niscaya mereka akan menyiapkan persiapan untuk keberangkatan itu sebagaimana orang-orang mukmin yang lain, namun hal itu tidak akan pernah mereka lakukan, karena sejak awal mereka memang tidak ingin berangkat berperang. Akan tetapi seandainya mereka berangkat berperang dengan kondisi jiwa semacam itu justru hanya akan menciptakan kekacauan dalam barisan umat muslim dan melemahkan jiwanya, karena itu Allah tidak menyukai keberangkatan mereka untuk berperang beserta kaum mukminin, maka dia melemahkan keinginan dan niat mereka untuk berangkat ke medan perang, dan seakan dikatakan dalam hati mereka, jangan berangkat ke medan perang dan tinggAllah kamu bersama orang-orang yang tinggal itu, yakni bersama anak-anak, para wanita, dan orang-orang tua. ' bahkan seandainya mereka berangkat berperang bersamamu, niscaya mereka tidak akan menambah kekuatan-Mu, malah keberadaan mereka hanya akan membuat kekacauan serta melemahkan mental kaum muslim, dan seandainya mereka memiliki kesempatan, tentu mereka akan bergegas maju ke depan dan menyusup di celah-celah barisanmu untuk mengadakan kekacauan serta menciptakan permusuhan di antara kamu; sedang di antara kamu, wahai kaum muslimin, ada orang-orang yang sangat suka mendengarkan perkataan mereka, baik karena keluguan atau ketidaktahuan mereka, disebabkan sikap baik mereka; padahal mereka suka berlaku zalim. Jika demikian, pasti Allah mengetahui orangorang yang zalim."
  }
]