[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sekiranya orang-orang munafik keluar bersamamu (wahai orang-orang mukmin) untuk berjihad, pastilah mereka akan menyebarkan kecemasan pada kaum muslimin, keburukan dan kerusakan. Dan pastilah mereka akan segera melancarkan adu bomba dan kebencian diantara kalian. Mereka hendak mengacaukan kalian dengan mengikis semangat jihad kalian di jalan Allah. Dan di tengah kalian (wahai kaum mukminin), ada mata-mata mereka yang dapat ikut mendengar berita-berita kalian dan akan mengirimkanya kepada mereka. Dan Allah Maha Mangetahui orang-orang munafik yang berbuat kezhaliaman dan akan memberikan balasan kepada mereka atas tindakan tersebut."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "47. \"Sikap orang-orang munafik itu akan lebih baik bila tidak ikut pergi bersama kalian (ke medan jihad). Karena apabila mereka pergi bersama kalian mereka hanya akan merusak suasana dengan ulah mereka yang mengabaikan kalian dan melontarkan kata-kata yang mengganggu keyakinan kalian. Dan mereka pasti akan bergerak cepat di tengah-tengah barisan kalian untuk mengadu domba dan memecah-belah persatuan kalian. Dan di antara kalian -wahai orang-orang mukmin- ada orang-orang yang mau mendengar isu-isu yang mereka hembuskan, kemudian menerimanya dan menyebarkannya. Maka timbullah perselisihan di antara kalian. Allah Maha Mengetahui orang-orang zalim dari kalangan orang-orang munafik yang menghembuskan isu-isu dan keragu-raguan di antara orang-orang mukmin.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "47. Karena ketidakikutsertaan mereka dapat menimbulkan kesedihan bagi orang-orang beriman, maka Allah menenangkan mereka dengan menyatakan bahwa kepergian mereka lebih banyak mudaratnya daripada ketidakikutsertaan mereka. Allah berfirman: \"Lebih baik orang-orang munafik itu tidak pergi bersama kalian, sebab jika mereka pergi bersama kalian maka mereka hanya menambah kerusakan, karena mereka akan melemahkan semangat dan menyebar syubhat dan fitnah untuk memecah-belah kalian. Hal ini karena di antara kalian terdapat orang-orang yang masih mendengar dan mempercayai kebohongan yang mereka sebarkan, sehingga terjadi perselisihan di antara kalian. Allah Maha Mengetahui orang-orang zalim dari kalangan munafikin yang menyebarkan fitnah dan keraguan di antara orang-orang beriman.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "47. لَوْ خَرَجُوا۟ فِيكُم مَّا زَادُوكُمْ إِلَّا خَبَالًا (Jika mereka berangkat bersama-sama kamu, niscaya mereka tidak menambah kamu selain dari kerusakan belaka) Ini merupakan penghiburan bagi orang-orang beriman atas ketidak-ikutsertaan orang-orang munafik. Makna (الخبال) yakni berbuat kerusakan, menyebarkan berita bohong, dan menimbulkan perselisihan. وَلَأَوْضَعُوا۟ خِلٰلَكُمْ(dan tentu mereka akan bergegas maju ke muka di celah-celah barisanmu) Mereka pasti akan berusaha untuk membuat kerusakan diantara kalian dengan kobohongan-kobohongan yang merusak hubungan antar sesama. يَبْغُونَكُمُ الْفِتْنَةَ(untuk mengadakan kekacauan di antara kamu) Dalam hubungan diantara kalian dengan mengadakan perpecahan dan kerusakan. وَفِيكُمْ سَمّٰعُونَ لَهُمْ ۗ( sedang di antara kamu ada orang-orang yang amat suka mendengarkan perkataan mereka) Yakni dan diantara kalian terdapat orang yang mendengar kebohongan yang mereka katakan kemudian menerimanya dan menyebarkannya, sehingga timbul perpecahan diantara kalian dan kerusakan hubungan diantara kalian. وَاللهُ عَلِيمٌۢ بِالظّٰلِمِينَ(Dan Allah mengetahui orang-orang yang zalim) Dan mengetahui apa yang terjadi dengan mereka seandainya mereka ikut pergi bersama kalian. Oleh sebab itu, jatuhlah ketetapan sesuai dengan hikmah-Nya yang luas bahwa mereka tidak pergi bersama kalian. Orang-orang yang tidak ikut serta dalam perang merupakan para pemuka suku ‘Aus dan Khazraj, diantaranya adalah Abdullah bin Ubay; dan sebagian orang yang ikut pergi bersamamu dari kaum Anshar terdapat orang yang mendengar perkataan para pemuka suku tersebut karena kewibawaan mereka dalam kaumnya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Diantara kebiasaan orang-orang munafiq adalah : { وَلَأَوْضَعُوا خِلَالَكُمْ يَبْغُونَكُمُ الْفِتْنَةَ } \"dan tentu mereka akan bergegas maju ke muka di celah-celah barisanmu, untuk mengadakan kekacauan di antara kamu\" mereka berjalan dengan terengah-engah untuk menghancurkan benteng perdamaian, dan memasang ranjau dalam hati-hati kaum muslimin."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "47. Jika orang-orang munafik itu keluar bersamamu untuk berjihad, niscaya tidak ada yang bertambah bagimu kecuali kerusakan, keburukan, fitnah, namimah dan kemudharatan. Dan sungguh mereka akan bergegas dalam berjalan atau menyelipkan namimah di antara kalian. Mereka ingin membujuk kalian dengan menebar pertentangan dan menyampaikan ketakutan di barisan-barisan kalian sendiri, sedangkan di antara kalian ada kaum lemah yang suka menyimak kebohongan mereka. Dan Allah itu Maha Mengetahui orang-orang yang menzalimi diri sendiri dan keadaan mereka baik yang tampak maupun tersembunyi, maka sebaiknya mereka tidak berangkat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Seandainya mereka berangkat bersama kalian} bersama kalian {niscaya mereka tidak menambah kalian, melainkan membuat kekacauan} kerusakan dan keburukan {dan mereka tentu mereka membuat kekacauan melalui celah-celah kalian} tentu mereka akan bergegas berjalan di antara kalian dengan membuat fitnah {mereka ingin kalian kacau} mereka urusan kalian terganggu dan pandangan kalian kacau {sedang di antara kalian ada orang-orang yang suka mendengarkan mereka} orang-orang yang mendengarkan perkataan mereka dan menaati mereka {Dan Allah mengetahui orang-orang yang zalim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "47. Kemudian Allah menyebutkan hikmahNya dalam hal ini. “jika mereka berangkat bersama-sama kamu, niscaya mereka tidak menambah kamu selain kerusakan belaka”, yakni kekurangan, “dan tentu mereka akan bergegas maju ke muka bumi di celah-celah barisanmu”, yakni, mereka akan menyulur fitnah dan keburukan di antaramu dan memecah belah pasukanmu “untuk mengadakan kekacauan di antaramu.” Yakni mereka berkeinginan yang keras memicu fitnah dan memicu permusuhan di antaramu. “Sedang di antaramu ada orang-orang”, yakni memenuhi panggilan mereka dan tertipu oleh mereka. Jika mereka berkeinginan keras untuk menelantarkanmu dan ingin menanamkan keburukan di antaramu, serta melemahkan barisanmu di depan musuhmu sedangkan di antaramu ada yang menerima ucapan mereka dan mendengarnya, maka bagaimana menurutmu dengan keburukan yang terjadi dan akibat pahit yang timbul jika mereka berangkat bersama orang-orang yang beriman? Milik Allah-lah hikmah yang sempurna manakala dia melemahkan niat mereka dan mencegah mereka keluar bersama hamba-hambaNya yang beriman karena kasih sayangNya kepada hamba-hambaNya agar mereka tidak di susupi orang-orang yang tidak berguna malah membahayakan. “Dan Allah mengetahui orang-orang yang zhalim.” Maka mereka memberitahu hamba-hambaNya bagaimana mewaspadai mereka dan menjelaskan dampak negatif akibat berteman dengan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 47: Dan mengadakan perselisihan di antara kamu. Mereka adalah orang-orang yang kurang akal. Allah memiliki hikmah yang sempurna mengapa Dia menjadikan kaum munafik tidak ikut berperang, karena mereka senang membiarkan kaum mukmin, mengadakan kekacauan dan melemahkan hati kaum mukmin ketika melawan orang-orang kafir, dan lagi di tengah-tengah kaum mukmin ada orang yang mudah tertipu oleh kata-kata manis mereka. Jika mereka ikut berperang, tentu akan timbul kekacauan di barisan kaum mukmin. Oleh karena itu, pada ayat selanjutnya Allah Subhaanahu wa Ta'aala menerangkan bahwa sebelum ini, mereka juga sudah berusaha membuat kekacauan, yakni ketika Rasulullah shallallahu 'alaihi wa sallam pertama kali hijrah ke Madinah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 47",
    "description": "Bahkan seandainya mereka berangkat berperang bersamamu, niscaya mereka tidak akan menambah kekuatan-Mu, malah keberadaan mereka hanya akan membuat kekacauan serta melemahkan mental kaum muslim, dan seandainya mereka memiliki kesempatan, tentu mereka akan bergegas maju ke depan dan menyusup di celah-celah barisanmu untuk mengadakan kekacauan serta menciptakan permusuhan di antara kamu; sedang di antara kamu, wahai kaum muslimin, ada orang-orang yang sangat suka mendengarkan perkataan mereka, baik karena keluguan atau ketidaktahuan mereka, disebabkan sikap baik mereka; padahal mereka suka berlaku zalim. Jika demikian, pasti Allah mengetahui orangorang yang zalim. Bukan hanya saat itu, sungguh, sebelum itu mereka, kaum munafik, memang sudah berusaha membuat kekacauan, melemahkan mental kaum muslim dan bahkan mengatur berbagai macam tipu daya bagimu dengan memutarbalikkan persoalan dan memutar otak untuk memadamkan api islam, hingga datanglah kebenaran, pertolongan Allah, dan menanglah urusan, yakni agama, Allah, padahal dengan kenyataan itu mereka tidak menyukainya."
  }
]