[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang munafik berusaha mencari cara untuk menyimpangkan kaum mukminin dari agama mereka dan menghalangi mereka dari jalan Allah sebelum perang tabuk dan terbongkarnya jati diri mereka. Dan mereka melancarkan berbagai usaha terhadapmu (wahai nabi), untuk menghapuskan risalah yang kamu bawa, sebagaimana yang telah mereka perbuat pada perang uhud dan perang khandaq, dan mereka telah mengatur rencana jahat kepadamu hingga akhirnya datanglah pertolongan dari sisi Allah, dan Dia menguatkan tentaraNya dan memenangkan agamaNYa, sedang mereka amat membenci kejadian tersebut."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "48. Sungguh orang-orang munafik itu telah berusaha keras untuk membuat kerusakan dengan memecah belah persatuan dan kesatuan orang-orang mukmin sebelum perang Tabuk. Mereka melancarkan berbagai macam tipu daya kepadamu -wahai Rasul- untuk menggoyahkan semangat jihadmu sampai pertolongan dan dukungan Allah datang kepadamu, dan Allah memenangkan agama-Nya serta mengalahkan musuh-musuh-Nya, sedangkan orang-orang kafir tidak menyukai hal itu. Karena orang-orang kafir itu menginginkan agar kebatilan dapat mengalahkan kebenaran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "48. Kemudian Allah menyebutkan bentuk lain dari tipu daya orang-orang munafik dan kerusakan hati mereka, dengan berfirman: \"Sungguh orang-orang munafik itu telah berusaha untuk membuat kerusakan dengan memecah belah persatuan dan kesatuan orang-orang beriman sebelum terjadinya perang Tabuk. Hai Rasulullah, mereka telah melakukan berbagai tipu daya terhadapmu agar tipu daya itu dapat melemahkan sikapmu dalam berjihad; hingga datanglah pertolongan Allah bagimu, sehingga Allah memenangkan agama-Nya dan menaklukkan musuh-musuh-Nya, sedangkan orang-orang munafik itu tidak menyukai kemenangan tersebut karena mereka mengharapkan kemenangan kebatilan atas kebenaran.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "48. لَقَدِ ابْتَغَوُا۟ الْفِتْنَةَ مِن قَبْلُ (esungguhnya dari dahulupun mereka telah mencari-cari kekacauan) Mereka telah berharap untuk dapat berbuat kerusakan, kekacauan, dan perselisihan diantara orang-orang beriman, serta mencerai-beraikan persatuan mereka sebelum peperangan ini. وَقَلَّبُوا۟ لَكَ الْأُمُورَ(dan mereka mengatur pelbagai macam tipu daya untuk (merusakkan)mu) Yakni membuat berbagai tipu daya dengan harapan salah satunya dapat mengenaimu sehingga keteguhanmu untuk berjihad menjadi kendor. حَتَّىٰ جَآءَ الْحَقُّ(hingga datanglah kebenaran (pertolongan Allah)) Yakni pertolongan dan penguatan bagimu. وَظَهَرَ أَمْرُ اللهِ (dan menanglah agama Allah) Yakni dengan memuliakan agama-Nya, meninggikan syariat-Nya, dan mengalahkan musuh-musuh-Nya. وَهُمْ كٰرِهُونَ (padahal mereka tidak menyukainya) Yakni kekalahan mereka merupakan suatu keterpaksaan bagi mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "48. Sungguh orang-orang munafik itu memberi ketakutan tentang musuh, mencari kerusakan, memberi pertentangan-pertangan di antara orang-orang mukmin sebelum perang Tabuk, memikirkan rencana konspirasi dan muslihat kepadamu wahai Nabi, dan membolak-balik pandangan mereka supaya mereka bisa memilih sesuatu yang bisa membahayakan kalian, serta mencari pandangan untuk membatalkan dakwah dan agamamu sehingga datang kepadamu pertolongan dan dukungan Tuhan, lalu meninggikan agama dan syariat Allah meskipun mereka ingin merendahkannya. Dan mereka membenci kemenangan agama ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh mereka benar-benar menginginkan kekacauan} menginginkan kekacauan, menimbulkan perbedaan dan memecah belah pendapat {sebelumnya} sebelum perang Tabuk {mereka membolak-balik berbagai urusan} mereka menyusun tipu daya dan muslihat {untukmu, sehingga datanglah kebenaran} pertolongan {dan menanglah urusan Allah} agama Allah {dan mereka adalah orang-orang yang tidak menyukainya (48)"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "48. kemudian Allah menyebutkan bahwa mereka bahwa mereka telah menanam keburukan sebelumnya, Dia berfirman, “Sesungguhnya dari dahulu pun mereka telah mencari-cari kekacauan.” Yakni ketika kamu hijrah ke Madinah, mereka berusaha sekuat tenaga, “dan mereka mengatur berbagai macam tipu daya untuk merusakkanmu.” Yakni mereka memutar otak dan membuat tipu daya untuk membatalkan dakwahmu dan menghinakan agamamu, dan mereka tidak lalai dalam melakukan hal itu. “hingga datanglah pertolongan Allah, dan menanglah agama Allah, padahal mereka tidak menyukainya.” Maka batallah tipu daya mereka dan terkikislah kebatilan mereka, maka orang yang seperti mereka memang pantas di waspadai oleh hamba-hamba Allah yang beriman dan agar orang-orang yang beriman tidak peduli dengan ketidakberangkatan mereka untuk berjihad."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 48: Tipu daya mereka pun kalah dan sia-sia. Mereka pun masuk ke dalam agama Islam di luarnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 48",
    "description": "Bukan hanya saat itu, sungguh, sebelum itu mereka, kaum munafik, memang sudah berusaha membuat kekacauan, melemahkan mental kaum muslim dan bahkan mengatur berbagai macam tipu daya bagimu dengan memutarbalikkan persoalan dan memutar otak untuk memadamkan api islam, hingga datanglah kebenaran, pertolongan Allah, dan menanglah urusan, yakni agama, Allah, padahal dengan kenyataan itu mereka tidak menyukainya. Ayat ini membeberkan sifat orang munafik yang lain, yakni berpura-pura. Dan di antara mereka ada orang yang berkata, berilah aku izin untuk tidak pergi berperang karena ada uzur pada diriku, dan janganlah engkau, wahai Muhammad, menjadikan aku terjerumus ke dalam kesulitan terutama terhadap anak istriku jika tetap pergi ke medan perang. Lalu Allah menegaskan kalau mereka sebenarnya berpura-pura. Ketahuilah, wahai nabi Muhammad, bahwa sungguh dengan sikap kepurapuraannya itu, sesungguhnya mereka telah terjerumus ke dalam kemunafikan dan kekufuran. Dan sungguh tempat mereka kelak di jahanam, dan jahanam akan selalu meliputi orang-orang yang kafir."
  }
]