[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan diantara orang-orang munafik ada orang yang meminta izin untuk tidak pergi berjihad, dan mengatakan, ”janganlah kamu menjerumuskanku dalam cobaan dengan apa yang nanti muncul saat aku ikut keluar berupa fitnah wanita.” Sesungguhnya mereka telah terjerumus dalam fitnah kemunafikan yang besar, maka sesungguhnya neraka jahanam benar-benar meliputi orang-orang yang kafir kepada Allah dan hari akhir, tidak ada seorangpun dari mereka yang dapat lolos."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "49. Dan di antara orang-orang munafik ada orang yang menyampaikan alasan-alasan yang dibuat-buat. Ia berkata, \"Ya Rasulullah, izinkanlah kami untuk tidak pergi ke medan jihad. Janganlah kamu membebaniku dengan keharusan pergi (ke medan jihad) bersamamu, agar aku tidak jatuh ke dalam perbuatan dosa karena tergoda oleh pesona wanita-wanita musuh (Romawi) apabila aku melihat mereka.\" Ingatlah, sesungguhnya mereka telah terjerumus ke dalam malapetaka yang jauh lebih besar dari apa yang mereka kira. Yaitu malapetaka kemunafikan dan enggan pergi ke medan jihad. Sesungguhnya kelak di hari Kiamat Neraka Jahanam benar-benar akan mengurung orang-orang kafir. Tidak ada satu pun dari mereka yang akan luput dari siksanya. Dan mereka tidak akan menemukan tempat berlindung dari azabnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "49. Setelah Allah menyebutkan bahwa sebagian orang munafik akan meminta izin untuk tidak ikut berjihad sebelum mereka mengucapkan alasan-alasannya, maka Allah mengungkapkan hal itu: \"Di antara orang-orang munafik itu ada yang meminta izin dengan berbagai alasan, dia berkata: 'Ya Rasulallah, izinkanlah aku untuk tidak mengikuti jihad, dan janganlah kamu mewajibkanku untuk ikut, agar aku tidak mendapatkan dosa karena tergoda oleh wanita-wanita Romawi yang aku lihat disana.' Ketahuilah, sungguh mereka telah jatuh ke dalam dosa yang lebih besar daripada yang mereka katakan itu, yaitu dosa kemunafikan. Sungguh neraka jahanam akan meliputi orang-orang kafir pada hari kiamat, dan tidak akan ada yang dapat lari darinya.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "49. وَمِنْهُم (Di antara mereka) Yakni orang-orang munafik. مَّن يَقُولُ(ada orang yang berkata) Yakni orang yang berkata kepada Rasulullah “Berilah saya izin untuk tidak pergi berperang. وَلَا تَفْتِنِّىٓ ۚ( dan janganlah kamu menjadikan saya terjerumus dalam fitnah) Ibnu Abbas berkata: ketika Rasulullah hendak pergi ke perang Tabuk, Beliau berkata kepada Jadd bin Qais: “Hai Jadd, bagaimana menurutmu tentang berperang melawan bani Ashfar?”. Maka ia menjawab: “Wahai Rasulullah, aku adalah orang yang menyukai perempuan, jika aku melihat perempuan-perempuan dari bani Ashfar –yakni para perempuan Ramawi— maka aku akan terfitnah, oleh sebab itu izinkanlah aku untuk tidak ikut berperang agar aku tidak terjerumus kedalam fitnah”. Pendapat lain mengatakan maknanya adalah janganlah kamu menjerumuskanku kedalam dosa, karena jika kamu tidak mengizinkan aku maka aku tidak akan ikut tanpa izin darimu. أَلَا فِى الْفِتْنَةِ سَقَطُوا۟ (Ketahuilah bahwa mereka telah terjerumus ke dalam fitnah) Yakni kedalam fitnah yang sama, yaitu fitnah tidak ikut berjihad dan mengajukan alasan bohong."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Tidak semua yang mengaku telah terhindar dari fitnah adalah orang benar, bahkan diantara yang mengaku adalah orang munafiq dan takut."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "49. Wahai Rasul, di antara orang-orang munafik itu ada yang berkata kepadamu: “Ijinkanlah aku untuk mengundurkan diri dari jihad dan janganlah menempatkanku dalam fitnah, yaitu dosa dengan tidak memberiku ijin, karena aku akan terjerumus dalam dosa jika aku mengundurkan diri tanpa seijinmu” Ingatlah, sesungguhnya mereka itu terjerumus dalam fitnah dengan mengundurkan diri dari jihad, munafik dan mengajukan uzur palsu. Sesungguhnya neraka Jahanam itu mengelilingi seluruh orang-orang kafir, sehingga mereka tidak bisa lari darinya. Ibnu Abbas berkata: “Ketika Nabi SAW hendak pergi untuk perang Tabuk, beliau berbicara kepada Jaddun bin Qays: ”Apa pendapatmu terkait berperang melawan Bani Ashfar yaitu Romawi?” Lalu dia menjawab: “Wahai Rasulallah, sesungguhnya aku adalah seseorang yang memiliki banyak wanita, dan ketika aku melihat wanita-wanita Bani Ashfar maka sungguh aku akan terpikat, maka berilah aku ijin dan janganlah engkau menempatkanku dalam fitnah” lalu turunlah ayat ini”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Di antara mereka} di antara orang-orang munafik {ada orang yang berkata,“Berilah aku izin} untuk tidak ikut berjihad {dan janganlah menjerumuskan aku ke dalam fitnah”} jangan menjerumuskanku ke dalam fitnah wanita-wanita Romawi dengan berangkat bersamamu {Ketahuilah, bahwa mereka telah terjerumus} terjerumus {ke dalam fitnah} fitnah kemunafikan dan meninggalkan jihad {Sesungguhnya neraka Jahanam benar-benar meliputi orang-orang kafir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "49. Yakni, dari kalangan orang-orang yang munafik itu yang meminta izin untuk berangkat dengan memberi alasan yang aneh, dia berkata, “Berilah saya izin”, tidak pergi berperang, “dan janganlah kamu menjadikan saya terjerumus kedalam firnah”, dengan keluar jihad, karena jika aku keluar untuk jihad dan melihat wanita Bani al-Ashfar maka aku tidak bisa menahan diri, sebagaimana hal itu di ucapkan oleh al-Jad bin Qais, padahal maksud mereka adalah semoga Allah menimpakan keburukan kepadanya adalah nifak dan riya, dengan mengatakan bahwa tujuanku baik karena kalau aku keluar berperang berarti fitnah yang menjebloskan diri kepada keburukan, sedangkan kalau aku tidak keluar maka itu berarti keselamatan dan keterjagaan dari keburukan. Allah berfirman menjelaskan kedustaan perkataan ini, “Ketahuilah, bahwa mereka telah terjerumus ke dalam fitnah.” Seandaianya maksud ucapan itu adalah benar, maka penolakan berangkat jihad tetap saja saja mengakibatkan kerugian besar dan fitnah yang besar yang pasti terjadi, yaitu kemaksiatan kepada Allah dan kepada Rasulnya serta keberanian kepada dosa yang besar lagi berat. Adapun kerugian berangkat jihad maka ia lebih kecil di bandingkan dengan keberangkatan, padahal ia belum terjadi. Namun maksud orang tersebut hanyalah penolakan terhadap jihad, tidak lain. Oleh karena itu Allah mengancamnya dengan firmanNya. “dan sesungguhnya Jahanam itu benar-benar meliputi orang-orang yang kafir.” Mereka tidak mungkin selamat, berlari, dan menghindar darinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 49: Yakni di antara kaum munafik ada pula yang mengemukakan uzur yang lebih aneh lagi untuk tidak berperang ke Tabuk. Orang ini bernama Al Jad bin Qais, Nabi shallallahu 'alaihi wa sallam bersabda kepadanya, “Maukah kamu berperang melawan Bani Ashfar?” Ia menjawab, “Saya sangat suka dengan wanita. Saya khawatir, ketika melihat wanita Bani Ashfar, saya tidak bisa bersabar sehingga tergoda.” Yakni, padahal dengan tidak berperang itu mereka terjatuh ke dalam fitnah yang besar, yaitu bermaksiat kepada Allah dan Rasul-Nya serta mengerjakan dosa yang besar. Sedangkan pergi berperang, kalau pun ada mafsadatnya, namun sangat kecil dibanding dengan tidak berperang, ini pun kalau ada."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 49",
    "description": "Ayat ini membeberkan sifat orang munafik yang lain, yakni berpura-pura. Dan di antara mereka ada orang yang berkata, berilah aku izin untuk tidak pergi berperang karena ada uzur pada diriku, dan janganlah engkau, wahai Muhammad, menjadikan aku terjerumus ke dalam kesulitan terutama terhadap anak istriku jika tetap pergi ke medan perang. Lalu Allah menegaskan kalau mereka sebenarnya berpura-pura. Ketahuilah, wahai nabi Muhammad, bahwa sungguh dengan sikap kepurapuraannya itu, sesungguhnya mereka telah terjerumus ke dalam kemunafikan dan kekufuran. Dan sungguh tempat mereka kelak di jahanam, dan jahanam akan selalu meliputi orang-orang yang kafir. Sifat munafik yang lain adalah bahwa jika engkau, wahai nabi Muhammad, mendapat kebaikan seperti kemenangan dalam peperangan, juga kebaikan-kebaikan yang lain, mereka, kaum munafikin, tidak senang; tetapi jika engkau ditimpa bencana, yakni kekalahan dalam peperangan, mereka berkata kepada engkau juga kepada kaum muslim yang lain, sungguh, sejak semula kami telah mengetahui kalau kamu akan mengalami kekalahan, karena itu kami mengambil sikap berhati-hati dan mempertimbangkan secara masak-masak, makanya kami putuskan untuk tidak ikut pergi berperang. Dan, dengan ucapannya itu, mereka berpaling dengan lega dan gembira karena merasa telah berhasil mengelabui rasulullah dan orang-orang mukmin."
  }
]