[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudia apabila telah berakhir masa empat bulan yang mana kalian memberikan keamanan kepada orang-orang musyrik itu, maka umumkanlah peperangan melawan musuh-musuh Allah di manapun mereka berada, dan bidiklah mereka dengan mengepung mereka dalam benteng-benteng mereka dan intailah mereka di jalan-jalan mereka. Apabila mereka kembali dari kekafiran mereka dan masuk kedalam islam, serta komitmen dengan syariat-syariatnya seperti melaksanakan shalat dan menunaikan zakat, maka biarkanlah mereka; sebab mereka sesungguhnya telah menjelma menjadi saudara-saudara kalian dalam islam. Sesungguhnya Allah mahapengampun terhadap orang-orang yang bertaubat kepadaNya, lagi mahapenyayang terhadap mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Apabila bulan-bulan haram (yaitu Zulkaidah, Zulhijah, Muharram, dan Rajab) di mana kalian memberikan jaminan keamanan kepada musuh-musuh kalian telah berakhir, maka bunuhlah orang-orang musyrik di mana pun kalian menemukan mereka, kepunglah mereka di benteng-benteng mereka, dan intailah mereka di jalan-jalan mereka. Jika mereka bertobat kepada Allah dari kemusyrikan mereka, mendirikan salat, dan membayarkan zakat harta mereka, maka mereka menjadi saudara-saudara kalian dalam agama Islam dan (oleh sebab itu) berhentilah memerangi mereka. Sesungguhnya Allah Maha Pengampun lagi Maha Penyayang bagi hamba-hamba-Nya yang bertobat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "5. Setelah Allah menyebutkan pernyataan secara umum bahwa Dia berlepas diri dari perjanjian-perjanjian orang-orang musyrik dan dari segala kepercayaan dan kesesatan mereka, kemudian Allah melanjutkannya dengan menyebutkan apa yang harus dilakukan orang-orang beriman jika batas waktu perjanjian telah selesai. Allah memerintahkan orang-orang beriman jika 4 bulan diharamkannya memerangi orang-orang musyrik itu telah berlalu, maka perlakukanlah mereka dengan segala sesuatu yang sesuai dengan kemaslahatan peperangan; karena keadaan perang antara kalian dengan mereka telah kembali dengan berakhirnya masa damai yang kalian berikan bagi mereka. Hal-hal yang harus kalian lakukan adalah: Pertama, bunuhlah mereka dimanapun kalian menemui mereka, baik itu ketika di tanah haram maupun di tempat lain. Kedua, tangkaplah mereka sebagai tawanan. Ketiga, kepunglah mereka hingga tidak dapat keluar dan melarikan diri, sampai mereka menyerah dan dan mengalah dengan syarat atau tanpa syarat. Keempat, mengawasi mereka dari setiap tempat yang memungkinkan untuk melihat gerak-gerik mereka. Jika mereka bertaubat dari kesyirikan yang membuat mereka memusuhi dan memerangi kalian, memasuki agama Islam dengan mengucapkan dua kalimat syahadat, mendirikan salat wajib lima waktu sebagaimana yang kalian kerjakan, dan menunaikan zakat yang diwajibkan atas mereka; maka biarkanlah mereka mendapat kebebasan dengan tidak lagi memerangi mereka jika dahulu mereka adalah orang-orang yang memerangi kalian, tidak mengepung mereka jika mereka adalah orang-orang yang terkepung, tidak diawasi pergerakan mereka ketika menuju Baitul haram dan lainnya jika mereka adalah orang-orang yang mendapat pengawasan. Allah Maha mengampuni kesyirikan dan keburukan-keburukan yang telah mereka lakukan dan Maha mengasihi mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. فَإِذَا انسَلَخَ الْأَشْهُرُ الْحُرُمُ (Apabila sudah habis bulan-bulan Haram itu) Yakni empat bulan yang Allah jadikan sebagai waktu penangguhan mereka. Bulan-bulan ini disebut dengan bulan-bulan haram karena Allah mengharamkan orang-orang beriman untuk menumpahkan darah dan menghadapi orang-orang musyrik. فَاقْتُلُوا۟ الْمُشْرِكِينَ(maka bunuhlah orang-orang musyrikin itu) Yakni perangilah mereka sampai kalian membunuh mereka, dengan tetap memperhatikan apa yang disyariatkan Allah dalam memerangi orang-orang kafir. وَخُذُوهُمْ (dan tangkaplah mereka) Yakni tawanlah mereka; karena orang yang tertangkap merupakan tawanan. وَاحْصُرُوهُمْ(Kepunglah mereka) Yakni halangilah mereka agar tidak masuk ke dalam negeri kaum muslimin kecuali dengan izin. وَاقْعُدُوا۟ لَهُمْ كُلَّ مَرْصَدٍ ۚ (dan intailah ditempat pengintaian) Makna (المرصد) yakni tempat untuk mengintai musuh. Yakni menetapkah di tempat-tempat kalian mengintai mereka. Ayat ini mengandung perintah untuk membunuh orang-orang musyrik seluruhnya setelah berlalunya bulan-bulan Haram kecuali orang-orang yang disebutkan dalam sunnah yaitu wanita, bayi, orang lemah yang sudah tidak mampu berperang, dan para ahli kitab yang membayar jizyah. Terdapat pendapat mengatakan bahwa ayat ini menasakh semua ayat yang menyebutkan perintah untuk berpaling dan meninggalkan orang-orang musyrik serta perintah bersabar dalam menghadapi kezaliman mereka. فَخَلُّوا۟ سَبِيلَهُمْ ۚ (maka berilah kebebasan kepada mereka) Yakni biarkanlah mereka bebas, maka jangan kalian tawan, kepung, atau bunuh mereka apabila telah bertaubat dan melaksanakan apa yang telah disebutkan dalam ayat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5 Apabila sudah habis bulan-bulan empat yang Allah tunda itu, yaitu yang disebut bulan haram untuk mengharamkan darah orang musyrik, maka bunuhlah orang-orang musyrikin itu dimana saja kamu jumpai mereka, pada saat halal maupun haram, tawanlah mereka dan tangkaplah mereka. Cegahlah mereka keluar negeri Islam kecuali atas izin. Kepunglah mereka dan intailah pergerakan ditempat pengintaian. Jika mereka bertaubat dan mendirikan sholat dan menunaikan zakat, maka berilah kebebasan kepada mereka untuk berjalan serta jangan menyakiti mereka, sebab mereka telah menjafi orang-orang yang selamat. Sesungguhnya Allah Maha Pengampun kepada orang-orang yang taubat lagi maha Penyayang."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apabila telah berlalu} telah lewat {bulan-bulan haram} empat bulan yang mana kalian memberi keamanan kepada orang-orang musyrik {bunuhlah orang-orang musyrik di mana saja kalian temui. Tangkaplah mereka} tawanlah mereka {dan kepunglah mereka} kepunglah di benteng mereka {serta awasilah di setiap tempat pengintaian} di setiap jalan {Jika mereka bertaubat dan mendirikan shalat serta menunaikan zakat, berilah mereka kebebasan} berilah mereka jalan dan janganlah menghalangi mereka {Sesungguhnya Allah Maha Pengampun lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5. Allah berfirman, “Apabila sudah habis bulan-bulan itu,” yang padanya diharamkan memerangi orang-orang musrik yang dalam perjanjian, yaitu bulan-bulan berkeliling yang berjumlah empat, dan selesainya jangka waktu bagi yang mempunyi jangkan waktu lebih dari itu, maka tanggung jawab telah tebebas dari mereka. “maka bunuhlah orang-orang musrik dimana saja kamu menemui mereka”, di tempat dan waktu apa-pun. “dan tangkaplah mereka,” sebagai tawanan, “ kepunglah mereka,” yakni persempit gerak mereka, jangan biarkan mereka begerak leluasa dari bumi Allah yang dijadikannya sebagai tempat ibadah bagi hamba—hambaNya. Mereka tidaklah layak untuk tinggal di dalamnya, dan tidak berhak atasnya sejengkalpun karena bumi ini adalah bumi Allah, sedangkan mereka adalah musuh-musuhNya yang menangtangNya dan RasulNya, mereka adalah orang-orang yang selalu berusaha agar bumi Allah bersih dari agamanya, padahal Allah menolak pada selain menyempurnakan cahayaNya meskipun orang-orang kafir membencinya. “dan intailah tempat pengintaian.” Yakni, disetiap kesempatan dan tempat yang mereka lewati, bersiap siagalah dalam berjihad melawan mereka, keluarkan segala usahamu dalam hal ini, dan teruslah bersikap demikian kepada mereka sehingga mereka bertaubat dari kesyirikan mereka. “jika mereka bertaubat”, dari kesyirikan mereka, “dan mendirikan shalat.” Yakni melaksanakannya dengan semestinya, “dan menunaikan zakat,” kepada yang berhak menerimanya, “ maka berilah kebebasan kepada mereka.” Yakni, biarkanlah mereka, adapun seterusnya, berikan kepada mereka seperti apa yang menjadi hakmu dan bebankanlah kepada atas mereka seperti apa yang menjadi kewajibanmu. “Sesungguhnya Allah Maha Penyayang Lagi Maha Pengampun.” Dia mengampuni syirik dan dosa yang lebih rendah darinya bagi orang-orang yang taubat, dan menyayangi mereka dengan memberi taufik kepada taubat lalu menerimanya dari mereka. Di dalam ayat ini terkandung bahwa barangsiapa yang tidak mau melaksanakan shalat atau zakat, maka dia diperangi sampai mau melaksanakannya, seperti yang dilakukan oleh Abu Bakar Ash-Shiddiq."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 5: Yang dimaksud dengan bulan Haram di sini adalah masa 4 bulan yang diberi tangguh kepada kamu musyrik itu (mereka yang mengadakan perjanjian tidak diperangi), Yaitu dimulai dari tanggal 10 Zulhijjah (hari turunnya ayat ini) sampai dengan 10 Rabi'ul akhir. Di tanah halal atau di tanah haram. Dengan menawannya. Di benteng mereka sampai mereka terbunuh atau masuk Islam. Jangan biarkan mereka leluasa di negeri dan bumi Allah yang sesungguhnya Dia jadikan sebagai tempat ibadah bagi hamba-hamba-Nya. Bumi ini milik Allah, tidak pantas ditempati oleh musuh-Nya; yaitu orang-orang yang ingin menghilangkan agama-Nya dari bumi ini. Di jalan yang mereka lalui serta tetap teruslah bersikap seperti ini agar mereka bertobat dari perbuatan syirknya. Maksudnya keamanan mereka menjadi terjamin. Berdasarkan ayat ini, maka barang siapa yang enggan melaksanakan shalat dan menunaikan zakat, ia harus diperangi sampai mau melakukannya sebagaimana yang dilakukan Abu Bakar Ash Shiddiq radhiyallahu 'anhu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 5",
    "description": "Ayat ini memerintahkan apa yang seharusnya dilakukan oleh kaum muslim setelah habisnya masa tenggang tersebut. Apabila telah habis bulan-bulan haram, yakni masa tenggang waktu empat bulan yang diberi kepada kaum musyrik itu, maka perangilah orang-orang musyrik di mana saja kalian temui saat itu, baik di luar tanah haram maupun di wilayah tanah haram, tangkaplah dan kepunglah mereka, dan awasilah di tempat pengintaian sehingga mereka tidak mampu bergerak dan meloloskan diri. Jika mereka bertobat dari kemusyrikan dan kekufuran yang membuat mereka memerangi umat islam, dan memenuhi ketentuanketentuan agama secara konsekuen, seperti mendirikan salat serta menunaikan zakat, maka berilah kebebasan kepada mereka, dan jangan ditangkap atau diawasi gerak-geriknya lagi. Sebab jika mereka benar-benar bertobat, Allah akan mengampuni dosa-dosanya. Sungguh, Allah maha pengampun, maha penyayang. Meski Allah mewajibkan kaum muslim untuk menyerang kaum musyrik setelah habis masa tenggang waktu atau disebabkan mereka merusak perjanjian, hal itu bukan berarti mereka tidak punya kesempatan untuk memperoleh perlindungan keamanan sedikit pun. Dan jika di antara kaum musyrik ada yang meminta perlindungan kepadamu, setelah habisnya masa tenggang waktu empat bulan, maka lindungilah agar dia dapat mendengar firman Allah sehingga dengan begitu diharapkan mereka tertarik dan bisa insaf. Namun begitu, kamu tidak boleh memaksanya jika ternyata dia tidak mau masuk islam. Bahkan, setelah dia tinggal bersama kaum muslim beberapa lama kemudian dia minta pulang ke tempat asalnya, maka antarkanlah dia ke tempat yang aman baginya. Demikian itu karena sesungguhnya mereka kaum yang tidak mengetahui tentang kebenaran islam."
  }
]