[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Jika menimpa kepada kamu (wahai nabi) kebahagiaan dan harta rampasan perang, niscaya orang-orang munafik akan bersedih. Dan apabila kamu ditimpa keburukan berupa kekalahan dan kesulitan hidup, mereka akan berkata, ”kami adalah orang-orang yang berpikiran matang dan cakap dalam perencanaan urusan. Dan sesungguhnya kami telah mengambil antisipasi bagi diri kami dengan tidak ikut berperang dengan Muhammad.” Mereka berpaling dalam keadaan riang gembira atas apa yang telah mereka perbuat dan atas apa yang menimpamu berupa keburukan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "50. Jika kamu -wahai Rasul- mendapatkan nikmat dari Allah berupa sesuatu yang menyenangkan hatimu, seperti kemenangan atau rampasan perang, mereka pasti tidak menyukainya dan merasa sedih karenanya. Dan jika kamu ditimpa musibah, seperti mengalami kesulitan atau dikalahkan oleh lawan, orang-orang munafik itu akan berkata, \"Kami telah berhati-hati untuk diri kami. Dan kami telah mengambil keputusan yang tegas ketika kami tidak pergi ke medan perang bersama orang-orang mukmin. Kemudian mereka mengalami apa yang mereka alami, yaitu terbunuh dan tertawan oleh musuh.\" Lalu orang-orang munafik itu pulang ke rumah keluarga mereka dengan suka cita karena mereka pulang dengan selamat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "50. Kemudian Allah menyebutkan bentuk lain dari tipu daya orang-orang munafik dan kerusakan hati mereka, Allah berfirman: \"Hai Rasulullah, jika kamu mendapatkan kenikmatan dari Allah yang dapat membuatmu senang, berupa kemenangan atau harta ghanimah, niscaya mereka tidak menyukainya dan merasa sedih. Dan jika kamu mendapatkan musibah berupa kesulitan atau kekalahan dari musuh, niscaya mereka akan berkata, 'kami telah mengambil kewaspadaan dengan tidak pergi berperang sebagaimana orang-orang beriman itu pergi, sehingga mereka terbunuh dan tertawan'. Kemudian orang-orang munafik itu pergi ke keluarga mereka dengan penuh kebahagiaan karena selamat dari apa yang menimpa orang-orang beriman.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "50. إِن تُصِبْكَ حَسَنَةٌ تَسُؤْهُمْ ۖ (Jika kamu mendapat suatu kebaikan, mereka menjadi tidak senang karenanya) Makna kebaikan disini adalah harta ghanimah dan kemenangan. وَإِن تُصِبْكَ مُصِيبَةٌ(dan jika kamu ditimpa oleh sesuatu bencana) Yakni luka-luka atau terbunuh di jalan Allah. يَقُولُوا۟ قَدْ أَخَذْنَآ أَمْرَنَا مِن قَبْلُ(mereka berkata: “Sesungguhnya kami sebelumnya telah memperhatikan urusan kami (tidak pergi perang)”) Yakni kami telah berhati-hati terhadap diri kami dan telah bertindak tegas sehingga kami tidak ikut pergi ke medan perang seperti yang orang-orang beriman lakukan sehingga mereka tertimpa musibah ini. وَيَتَوَلَّوا۟ وَّهُمْ فَرِحُونَ (dan mereka berpaling dengan rasa gembira) Atas keselamatan mereka dan musibah yang menimpa orang-orang beriman."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "50. Wahai Nabi, jika kamu menerima kebaikan berupa pertolongan dan rampasan perang, maka kamu akan membuat sedih orang-orang munafik, dan jika kamu ditimpa musibah berupa kemalangan atau penderitaan, mereka akan berkata: “Kami berusaha menjaga diri, menjauhi bahaya dan mempersiapkan diri sebelum terjadinya musibah tersebut.” Mereka menunjukkan rasa gembira atas keselamatan mereka dan apa yang dialami olehmu dan orang-orang mukmin, yaitu kekalahan. Penyebab turunnya yaitu bahwa orang-orang munafik yang mengundurkan diri di Madinah membuat kabar buruk tentang Nabi SAW dengan berasumsi bahwa Nabi dan sahabat-sahabatnya kalah, namun ketika sampai kepada mereka kabar tentang keselamatan nabi dan sahabatnya, hal tersebut membuat mereka bersedih."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika kamu mendapat kebaikan} kemenangan dan harta rampasan {itu menyakitkan mereka} membuat mereka sedih Namun jika kamu ditimpa bencana} luka dan kekalahan {mereka berkata,“Sungguh kami telah mengambil tindakan kami sebelumnya} tindakan hati-hati kami ketika meninggalkan jihad sebelum musibah ini terjadi {dan mereka berpaling} mereka berlalu {dengan gembira} senang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "50. Allah menjelaskan bahwa orang-orang munafik itu adalah musuh yang sebenarnya yang murni membenci agama, “jika kamu mendapat satu kebaikan”, seperti kemenangan dan keunggulan di atas musuh, “mereka menjadi tidak senang karenanya.” Yakni membuat mereka bersedih dan gundah gulana. “dan jika kamu di timpa oleh sesuatu bencana”, seperti kamu kalah dari musuhmu, “mereka berkata”, dengan membanggakan diri mereka yang selamat karena tidak ikut berperang bersamamu, “sesunggunya dari sebelumnya telah memperhatikan urusan kami”, kami telah berhati-hati dan melakukan apa yang membuat kami selamat dari musibah seperti ini. “Dan mereka berpaling dengan rasa gembira”, dengan musibahmu dan ketidakikutsertaan mereka bersamamu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 50: Seperti kemenangan dan ghanimah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 50",
    "description": "Sifat munafik yang lain adalah bahwa jika engkau, wahai nabi Muhammad, mendapat kebaikan seperti kemenangan dalam peperangan, juga kebaikan-kebaikan yang lain, mereka, kaum munafikin, tidak senang; tetapi jika engkau ditimpa bencana, yakni kekalahan dalam peperangan, mereka berkata kepada engkau juga kepada kaum muslim yang lain, sungguh, sejak semula kami telah mengetahui kalau kamu akan mengalami kekalahan, karena itu kami mengambil sikap berhati-hati dan mempertimbangkan secara masak-masak, makanya kami putuskan untuk tidak ikut pergi berperang. Dan, dengan ucapannya itu, mereka berpaling dengan lega dan gembira karena merasa telah berhasil mengelabui rasulullah dan orang-orang mukmin. Karena itu, beliau diperintah untuk menanggapi ucapan mereka. Katakanlah, wahai nabi Muhammad, kepada orang-orang munafik itu, kami tidak akan mengucapkan sebagaimana apa yang kalian ucapkan, sebab menurut keyakinan kami tidak akan menimpa kami, kebaikan maupun keburukan, kekalahan maupun kemenangan, melainkan apa yang telah ditetapkan Allah di lauh mahfudh bagi kami. Demikian ini, agar kami tidak merasa berbangga diri ketika berhasil dan tidak merasa sesak dada kami ketika tidak berhasil. (lihat pula surah al-a'adid/57: 22-23). Sebagai seorang mukmin, kami sadar bahwa Allah tidak mungkin menyengsarakan kami, sebab dialah pelindung kami, dan hanya kepada Allahlah hendaknya orang-orang yang beriman dengan keimanan yang mantap bertawakkal setelah sebelumnya berusaha secara maksimal."
  }
]