[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sebab tidak diterimanya infak-infak mereka adalah bahwa sesungguhnya mereka menyembunyikan (di dalam hati mereka) kekufuran kepada Allah dan pendustaan kepada rasulNya, Muhammad , dan tidak mengerjakan shalat kecuali mereka merasa berat. Dan mereka tidak menginfakkan harta mereka keculai mereka tidak menyukainya, maka mereka tidak mengharapkan pahala dari kewajiban-kewajiban ini dan tidak takut saat meninggalkannya mendapatkan siksaan dikarenakan kekafiran mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "54. Tidak ada alasan yang membuat infak mereka itu tidak diterima oleh Allah selain tiga hal, mereka ingkar kepada Allah dan rasul-Nya, mereka malas dan berat ketika melaksanakan salat, dan mereka tidak menginfakkan harta mereka dengan sukarela, melainkan karena terpaksa. Hal itu karena mereka tidak mengharapkan pahala dalam menunaikan salat mereka dan dalam menginfakkan harta mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "54. Infak mereka tidak diterima karena tiga hal: Karena kekafiran mereka terhadap Allah dan rasulnya; rasa malas dan berat untuk menjalankan shalat; dan mereka tidak berinfak secara sukarela, namun karena terpaksa. Mereka tidak mengharapkan pahala dari shalat dan infak yang mereka lakukan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "54. وَمَا مَنَعَهُمْ أَن تُقْبَلَ مِنْهُمْ نَفَقٰتُهُمْ (Dan tidak ada yang menghalangi mereka untuk diterima dari mereka nafkah-nafkahnya) Allah menjadikan penghalang diterimanya infak mereka karena tiga hal: 1. karena kekafiran mereka. 2. karena meraka tidak menjalankan shalat dalam keadaan apapun kecuali dengan kemalasan dan rasa berat, sebab mereka tidak mengharapkan pahala dan tidak takut terhadap siksa sehingga shalat mereka tidak lain hanyalah untuk riya’. 3. karena mereka tidak menginfakkan harta mereka kecuali dengan penuh keengganan, mereka tidak berinfak dengan kerelaan karena menganggap infak membuang-buang harta, sebab mereka tidak mengimani apa yang dijanjikan Allah bagi Rasul-Nya dan hamba-hamba-Nya yang beriman dan berjihad."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Allah berfirman tentang orang munafiq : { وَلَا يَأْتُونَ الصَّلَاةَ إِلَّا وَهُمْ كُسَالَىٰ } \"dan mereka tidak mengerjakan sembahyang, melainkan dengan malas\" Ibnu 'Abbas berkata : Jika bersama jamaaah dia shalat dan ketika menyendiri ia tidak mengerjakan shalat, bahkan ketika ia mengerjakan shalat sedikitpun ia tidak mengharap balasan darinya, dan ia tidak takut kepada ancaman ketika ia meninggalkan shalat. 2 ). Pada firman Allah tentang orang-orang munafiq : { وَلَا يَأْتُونَ الصَّلَاةَ إِلَّا وَهُمْ كُسَالَىٰ وَلَا يُنْفِقُونَ إِلَّا وَهُمْ كَارِهُونَ } \"dan mereka tidak mengerjakan sembahyang, melainkan dengan malas dan tidak (pula) menafkahkan (harta) mereka, melainkan dengan rasa enggan\" adalah peringatan bagi orang-orang beriman agar mereka mendirikan shalat dengan penuh semangat dan dengan hati yang lapang. dan ketika ia mengeluarkan hartanya senantiasa berlapang dada."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "54. Tidak ada larangan untuk menerima nafkah mereka kecuali karena 3 perkara, yaitu kufur kepada Allah dan rasulnya, mereka tidak shalat melainkan dengan malas dan berat hati karena mereka tidak mengharapkan pahala dan tidak takut terhadap hukuman, mereka shalat hanya untuk pamer, dan mereka tidak menafkahkan sedikitpun harta mereka untuk jihad dan urusan lainnya melainkan dengan penuh kebencian bukan ketaatan, Karena mereka beranggapan bahwa menafkahkan harta itu merugikan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidak ada yang menghalangi infak mereka untuk diterima kecuali karena sesungguhnya mereka adalah orang-orang yang ingkar kepada Allah dan RasulNya dan mereka tidak melaksanakan shalat, melainkan dengan malas} berat hati {dan tidak berinfak melainkan dengan terpaksa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": ". 54. Kemudian Allah menjelaskan sifat kefasikan mereka dan perbuatan mereka, Dia berfirman, “dan tidak ada yang menghalangi mereka untuk di terima dari mereka nafkah-nafkahnya melainkan karena mereka kafir kepada Allah dan RasulNya.” Padahal semua amal, syarat di terimanya adalah iman, sedangkan mereka itu tidak beriman dan tidak beramal shalih, bahkan shalat yang menjadi amal jasmani yang paling utama, mereka lakukan dengan malas-malasan. “Dan mereka tidak mengerjakan shalat, melainkan dengan malas.” Yakni, mereka berat hampir tidak melakukannya karena beratnya shalat bagi mereka. “Dan tidak pula menafkankah harta mereka, melainkan dengan rasa enggan”, tanpa kelapangan dada dan ketenangan jiwa. Ini adalah celaan yang mendalam bagi siapa saja yang melakukan seperti apa yang mereka lakukan, dan bahwa seorang hamba seharusnya tidak mendatangi shalat kecuali dalam keadaan semangat jasmani dan rohani, dan tidak berinfak kecuali dengan dada yang lapang dan jiwa yang tenang berharap balasan pahalanya dari sisi Allah yang semata dan tidak menyerupai orang-orang munafik. kemudian Allah menyebutkan bahwa mereka bahwa mereka telah menanam keburukan sebelumnya, Dia berfirman, “Sesungguhnya dari dahulu pun mereka telah mencari-cari kekacauan.” Yakni ketika kamu hijrah ke Madinah, mereka berusaha sekuat tenaga, “dan mereka mengatur berbagai macam tipu daya untuk merusakkanmu.” Yakni mereka memutar otak dan membuat tipu daya untuk membatalkan dakwahmu dan menghinakan agamamu, dan mereka tidak lalai dalam melakukan hal itu. “hingga datanglah pertolongan Allah, dan menanglah agama Allah, padahal mereka tidak menyukainya.” Maka batallah tipu daya mereka dan terkikislah kebatilan mereka, maka orang yang seperti mereka memang pantas di waspadai oleh hamba-hamba Allah yang beriman dan agar orang-orang yang beriman tidak peduli dengan ketidakberangkatan mereka untuk berjihad."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 54: Sedangkan iman merupakan syarat diterimanya amal. Mereka menganggap infak sebagai kerugian. Dalam ayat ini terdapat peringatan bagi kaum mukmin agar tidak menyerupai mereka, seperti malas beribadah, infak dengan hati yang kesal, dsb. Faedah/catatan: Perlu diketahui, bahwa nifak terbagi dua: q Nifaq Akbar (Nifaq I’tiqaadiy) Nifaq Akbar yaitu menampakkan keislaman di luar dan menyembunyikan kekafiran di dalam dirinya. Nifaq ini mengeluarkan seseorang dari Islam, dan Allah mengancam pelakunya dengan neraka di lapisan paling bawah. Nifak Akbar ini ada beberapa macam bentuknya, ada yang berupa mendustakan Nabi shallallahu 'alaihi wa sallam, ada yang berupa mendustakan apa yang Beliau shallallahu 'alaihi wa sallam bawa, ada yang berupa membenci Nabi shallallahu 'alaihi wa sallam, ada yang berupa membenci apa yang dibawa Nabi shallallahu 'alaihi wa sallam, ada yang berupa senang jika agama Islam tidak berkembang dan ada yang berupa tidak suka jika agama Islam menang. q Nifaq Ashghar/kecil (nifaq ‘amali) Nifaq Ashghar adalah nifak yang kaitannya dengan amalan, di mana amal tersebut biasanya dilakukan oleh orang-orang munafik. Nifak ini tidak mengeluarkan dari Islam, namun bisa menjadi jembatan ke arah Nifaq Akbar. Contoh Nifaq Ashghar adalah jika dipercaya khianat, jika berbicara berdusta, jika berjanji mengingkari, jika bertengkar melakukan tindakan yang kejam, tidak mau mengerjakan shalat berjamaah, menunda-nunda shalat hingga hampir habis waktuya, malas beribadah, sangat berat melakukan shalat terlebih shalat Subuh dan 'Isya, dsb."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 54",
    "description": "Selanjutnya disebutkan alasan ditolaknya infak orang-orang munafik. Dan yang menghalang-halangi infak mereka, kaum munafik, untuk diterima adalah karena mereka kafir kepada Allah dan rasul-Nya dan mereka tidak melaksanakan salat dengan penuh ketaatan melainkan dengan malas, tidak senang, atau kurang peduli, dan mereka tidak pula menginfakkan harta, melainkan dengan rasa enggan atau terpaksa, karena mereka tidak yakin terhadap limpahan pahala dari Allah di akhirat kelak bagi mereka yang melakukan kebaikan atas dasar keikhlasan. Setelah ayat sebelumnya menjelaskan tertolaknya amal perbuatan baik orang-orang munafik, seperti salat dan menginfakkan harta, maka ayat ini memperingatkan kaum mukmin agar tidak menganggap baik kekayaan dan kekuasaan duniawi yang dianugerahkan kepada mereka, apalagi sampai mengaguminya. Maka karena itu, janganlah harta dan anak-anak mereka, yakni kaum munafik, membuatmu kagum sehingga menjadikanmu menaati perintahnya dan mendengar ucapannya padahal penuh kebohongan dan justru akan menjerumuskanmu ke jurang kenistaan, seperti dijelaskan pada surah al-Muna'fiqun/63: 4. Memang benar, banyaknya harta dan anak bisa saja menjadi indikasi kebaikan jika menyebabkan pemiliknya menjadi baik dan taat kepada Allah. Namun, sesungguhnya maksud Allah dengan itu, yakni karunia harta dan anak bagi orang-orang munafik, sejatinya adalah untuk menyiksa mereka dalam kehidupan dunia, sebab dengan itu mereka semakin berat hatinya meninggalkan dunia dan senantiasa merasa takut kehilangan apa yang mereka miliki, dan yang lebih menyakitkan adalah kelak mereka akan mati dalam keadaan kafir serta tempat menetap mereka adalah neraka."
  }
]