[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka janganlah membuatmu kagum kekayaan orang-orang munafik itu, begitu pula anak-anak mereka. Sesungguhnya Allah hendak menyiksa mereka dengan itu di kehidupan dunia dengan kelelahan dalam menghasilkannya dan bencana-bencana yang menimpanya, lantaran mereka tidak mengharapkan pahalanya dari sisi Allah, dan nyawa mereka keluar lalu mereka mati di atas kekafiran mereka kepada Allah dan rasulNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "55. Oleh karena itu jangan sekali-kali kamu -wahai Rasul- terkecoh dan terpesona oleh kekayaan dan keturunan orang-orang munafik. Karena kekayaan dan keturunan mereka itu akan berakhir dengan buruk. Sebab, Allah akan menjadikannya sebagai siksaan bagi mereka. Yaitu dengan membuat mereka bekerja keras dan bersusah payah untuk mendapatkannya. Dan dengan menurunkan berbagai musibah terhadapnya hingga ajal menjemput mereka dalam keadaan kafir. Kemudian Allah akan menyiksa mereka secara kekal di dalam kerak Neraka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "55. Setelah lenyap manfaat harta mereka di akhirat, Allah menjelaskan keburukan yang ada dalam harta mereka, yang mereka kira adalah kebaikan: Hai Rasulallah, janganlah kamu takjub terhadap harta dan keturunan orang-orang munafik, karena kesudahan harta dan anak-anak mereka itu sangat buruk bagi mereka. Allah menjadikannya azab bagi mereka dengan kesusahan dan kelelahan dalam mencarinya, musibah-musibah yang datang darinya hingga Allah mencabut nyawa mereka dalam keadaan kafir, lalu Allah akan mengazab mereka di kerak api neraka selama-lamanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "55. فَلَا تُعْجِبْكَ أَمْوٰلُهُمْ وَلَآ أَوْلٰدُهُمْ ۚ (Maka janganlah harta benda dan anak-anak mereka menarik hatimu) Janganlah kalian menganggap bahwa harta dan keturunan mereka baik untuk mereka. إِنَّمَا يُرِيدُ اللهُ لِيُعَذِّبَهُم بِهَا فِى الْحَيَوٰةِ الدُّنْيَا(Sesungguhnya Allah menghendaki dengan (memberi) harta benda dan anak-anak itu untuk menyiksa mereka dalam kehidupan di dunia) Yakni karena kesudahan mereka dalam harta dan keturunan mereka sangatlah pedih sebab mereka tidak bersyukur kepada Tuhan mereka yang telah mengaruniakannya dan meniinggalkan kewajiban mereka membayat zakat dan memberi sedekah yang layak. وَتَزْهَقَ أَنفُسُهُمْ وَهُمْ كٰفِرُونَ(dan kelak akan melayang nyawa mereka, sedang mereka dalam keadaan kafir) Yakni Allah menghendaki untuk mencabut nyawa mereka saat mereka dalam keadaan kafir, sebab mereka tidak menerima apa yang dibawa oleh para nabi dan keteguhan mereka dalam kekafiran serta keberlanjutan mereka dalam kesesatan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Ketika kamu melihat orang-orang kafir ditambahkan oleh Allah harta mereka janganlah kamu tertipu dengan hal itu, karena sesungguhnya yang terjadi pada mereka adalah tambahan azab di dunia dan diakhirat : { فَلَا تُعْجِبْكَ أَمْوَالُهُمْ وَلَا أَوْلَادُهُمْ ۚ إِنَّمَا يُرِيدُ اللَّهُ لِيُعَذِّبَهُمْ بِهَا } \"Maka janganlah harta benda dan anak-anak mereka menarik hatimu. Sesungguhnya Allah menghendaki dengan (memberi) harta benda dan anak-anak itu untuk menyiksa mereka\" karena dengan kekafiran mereka tidak sama sekali memperbanyak harta mereka di sisi Allah melainkan hanya sementara dan pasti mereka akan merugi : { وَلَا يَزِيدُ الْكَافِرِينَ كُفْرُهُمْ عِنْدَ رَبِّهِمْ إِلَّا مَقْتًا ۖ وَلَا يَزِيدُ الْكَافِرِينَ كُفْرُهُمْ إِلَّا خَسَارًا } \"Dan kekafiran orang-orang yang kafir itu tidak lain hanyalah akan menambah kemurkaan pada sisi Tuhannya dan kekafiran orang-orang yang kafir itu tidak lain hanyalah akan menambah kerugian mereka belaka\" [ Fatir : 39 ]."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "55. Maka janganlah kamu menyukai apa yang ada di sisi orang-orang munafik berupa harta benda dan anak. Sesungguhnya hal itu menjadi sebab musibah dan azab di dunia, yaitu kepedulian terhadap mereka, kegelisahan, kesedihan dan tanggungan atas penderitaan, membuat mereka mengabaikan rasa syukur dan kewajiban atas harta benda berupa zakat dan sedekah. Akhir kehidupan mereka menghancurkan ruh atau kematian mereka sendiri dengan memberi penderitaan dalam keadaan kufur, lalu mereka diazab di akhirat. Mereka merugi di dunia dan akhirat. Ini adalah bujukan bagi mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka janganlah harta dan anak-anak mereka membuatmu kagum. Sesungguhnya Allah hendak menyiksa mereka dengan itu dalam kehidupan dunia dan nyawa mereka akan keluar} dan nyawa mereka akan keluar {sedangkan mereka dalam keadaan kafir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "55. Allah berfirman, janganlah kamu kagum terhadap harta dan anak-anak orang-orang munafik itu, karena tidak ghibtah padanya, kesialan pertama mereka adalah bahwa mereka mendahulukannya di atas keridhaan Allah dan mereka durhaka kepada Allah karenanya. “Sesungguhnya Allah menghendaki dengan (memberi) harta benda dan anak-anak itu untuk menyiksa mereka dalam kehidupan di dunia.” Yang dimaksud dengan azab di sini adalah kesulitan dalam mendapatkannya, usaha yang mati-matian dalam hal itu, serta kecemasan hati dan keletihan tubuh yang mereka dapatkan, sekiranya kenikmatan mereka diukur dengan kesulitannya maka ia tidaklah sebanding, manakala harta tersebut melenakkan mereka dari Allah dan dzikir kepadaNya, maka Ia menjadi azab atas mereka bahkan di dunia, dan di antara akibat buruk yang berbahaya adalah bahwa hati mereka selalu bergantung kepadanya dan keinginan mereka tidak lepas darinya, ia menjadi tujuan akhir dan target final mereka, di hati mereka tidak lagi ada bagian akhirat, yang hal itu mengharuskan mereka berpindah dari dunia. “Dan kelak akan melayang nyawa mereka, sedang mereka dalam keadaan kafir.” Adakah hukuman yang lebih besar daripada hukuman yang mengakibatkan kesengsaraan dan kerugian yang abadi dan terus menerus?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 55: Karena yang demikian hanya sebagai istidraj (lihat pula surat Al An’am: 44). Di mana mereka merasakan kepayahan dan penderitaan dalam mengumpulkan dan memperolehnya, oleh karenanya jika kesenangan itu dihadapkan dengan penderitaan, maka kesenangan itu tidak ada apa-apanya. Sehingga Allah akan mengazabnya di akhirat dengan azab yang pedih."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 55",
    "description": "Setelah ayat sebelumnya menjelaskan tertolaknya amal perbuatan baik orang-orang munafik, seperti salat dan menginfakkan harta, maka ayat ini memperingatkan kaum mukmin agar tidak menganggap baik kekayaan dan kekuasaan duniawi yang dianugerahkan kepada mereka, apalagi sampai mengaguminya. Maka karena itu, janganlah harta dan anak-anak mereka, yakni kaum munafik, membuatmu kagum sehingga menjadikanmu menaati perintahnya dan mendengar ucapannya padahal penuh kebohongan dan justru akan menjerumuskanmu ke jurang kenistaan, seperti dijelaskan pada surah al-Muna'fiqun/63: 4. Memang benar, banyaknya harta dan anak bisa saja menjadi indikasi kebaikan jika menyebabkan pemiliknya menjadi baik dan taat kepada Allah. Namun, sesungguhnya maksud Allah dengan itu, yakni karunia harta dan anak bagi orang-orang munafik, sejatinya adalah untuk menyiksa mereka dalam kehidupan dunia, sebab dengan itu mereka semakin berat hatinya meninggalkan dunia dan senantiasa merasa takut kehilangan apa yang mereka miliki, dan yang lebih menyakitkan adalah kelak mereka akan mati dalam keadaan kafir serta tempat menetap mereka adalah neraka. Ayat sebelumnya memperingatkan agar umat islam tidak merasa takjub terhadap kekayaan kaum munafik, maka ayat ini menginformasikan tentang kebusukan hati mereka. Mereka, orang-orang munafik, akan terus-menerus bersumpah dengan nama Allah bahwa sesungguhnya mereka termasuk golonganmu; namun sumpah itu hanyalah untuk mengelabui orang-orang mukmin. Karena itu, janganlah kalian mempercayai sumpah mereka, sebab sejatinya mereka bukanlah dari golonganmu, tetapi mereka adalah orang-orang yang sangat takut diperlakukan seperti orang-orang musyrik, makanya mereka tutupi kemunafikan mereka itu dengan sumpah."
  }
]