[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang munafik bersumpah dengan nama Allah di hadapan kalian (wahai kaum mukminin), dengan dusta dan kepalsuan, bahwa mereka itu bagian dari kalian, padahal mereka bukan bagian dari kalian, akan tetapi mereka adalah kaum yang penakut lalu bersumpah untuk menutupi jati diri mereka di hadapan kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "56. Orang-orang munafik itu mengucapkan sumpah palsu di hadapan kalian -wahai orang-orang mukmin- bahwa mereka adalah bagian dari kalian. Padahal di dalam batin mereka tidaklah demikian adanya, walaupun mereka menyatakan bahwa mereka adalah bagian dari kalian. Akan tetapi mereka adalah orang-orang yang penakut. Mereka adalah orang-orang pengecut di medan perang. Mereka takut dibunuh atau dijadikan tawanan perang seperti yang terjadi pada orang-orang musyrik. Oleh karena itulah mereka menyatakan keislaman mereka untuk menyembunyikan jati diri mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "56. Hai orang-orang beriman, orang-orang munafik itu akan bersumpah kepada kalian dengan sumpah bohong bahwa mereka adalah bagian dari kalian. Namun sebenarnya mereka bukan bagian dari kalian meskipun mereka menempatkan diri sebagai bagian dari kalian. Mereka adalah kaum yang penakut, Mereka takut untuk berperang, serta takut terbunuh dan tertawan sebagaimana yang menimpa orang-orang musyrik, sehingga mereka menampakkan keislaman untuk melindungi diri."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "56. وَيَحْلِفُونَ بِاللهِ إِنَّهُمْ لَمِنكُمْ (Dan mereka (orang-orang munafik) bersumpah dengan (nama) Allah, bahwa sesungguhnya mereka termasuk golonganmu) Yakni termasuk dari golongan kalian dalam agama Islam. وَمَا هُم مِّنكُمْ (padahal mereka bukanlah dari golonganmu) Kecuali dari sisi yang nampak saja, namun secara bathin tidak seperti itu. وَلٰكِنَّهُمْ قَوْمٌ يَفْرَقُونَ (akan tetapi mereka adalah orang-orang yang sangat takut) Yakni takut untuk bertempur menghadapi musuh. Pendapat lain mengatakan, yang dimaksud adalah mereka takut akan menimpa mereka apa yang telah menimpa orang-orang musyrik berupa terbunuh atau tertawan; oleh sebab itu mereka menunjukkan kepada kalian keislaman untuk tipu daya dan bukan benar-benar ber-Islam."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "56. Mereka bersumpah palsu demi Allah bahwa mereka termasuk orang-orang mukmin. Pada hakikatnya mereka bukan termasuk orang-orang mukmin. Keislaman mereka hanya secara zhahir, namun tidak ada iman dalam hati mereka. Mereka adalah kaum yang sangat takut jika bermuamalah layaknya orang-orang musyrik, sehingga mereka bersumpah karena takut dan untuk menutupinya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka bersumpah dengan (nama) Allah bahwa sesungguhnya mereka termasuk golongan kalian} termasuk dalam golongan orang-orang muslim {padahal mereka bukanlah dari golongan kalian, tetapi mereka adalah kaum yang sangat takut} mereka takut diperlakukan seperti halnya yang diperlakukan terhadap orang-orang musyrik berupa peperangan dan penawanan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "56. “Dan mereka (orang-orang munafik) bersumpah dengan (Nama) Allah, bahwa sesungguhnya mereka termasuk golonganmu, padahal mereka bukanlah dari golonganmu, akan tetapi mereka”, tujuan mereka dalam bersumpah adalah bahwa mereka “adalah orang-orang yang sangat takut (kepadamu).” Yakni takut serangan. Di hati mereka tidak ada keberanian yang mendorong mereka menunjukkan jati diri mereka, mereka takut jika mereka menunjukkan keadaan mereka kepadamu, mereka takut kamu berlepas diri dari mereka yang akibatnya musuh mengincar mereka dari segala penjuru. Adapun keadaan orang yang kuat hatinya lagi teguh jiwanya, maka dia tidak takut menyatakan keadaan dirinya, baik atau buruk, akan tetapi orang-orang munafik itu memang berbaju dengan pakaian ketakutan dan bermantel kebohongan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 56: Mereka takut jika kamu memberlakukan mereka seperti terhadap orang-orang kafir, sehingga mereka bersumpah sebagai taqiyah (menjaga diri)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 56",
    "description": "Ayat sebelumnya memperingatkan agar umat islam tidak merasa takjub terhadap kekayaan kaum munafik, maka ayat ini menginformasikan tentang kebusukan hati mereka. Mereka, orang-orang munafik, akan terus-menerus bersumpah dengan nama Allah bahwa sesungguhnya mereka termasuk golonganmu; namun sumpah itu hanyalah untuk mengelabui orang-orang mukmin. Karena itu, janganlah kalian mempercayai sumpah mereka, sebab sejatinya mereka bukanlah dari golonganmu, tetapi mereka adalah orang-orang yang sangat takut diperlakukan seperti orang-orang musyrik, makanya mereka tutupi kemunafikan mereka itu dengan sumpah. Karena itu, sekiranya mereka memperoleh tempat perlindungan, guagua, lubang-lubang dalam tanah atau tempat-tempat persembunyian di mana saja, niscaya mereka akan segera pergi atau lari ke sana dengan secepat-cepatnya meski harus berkorban harta dan melalui jalan yang cukup sulit. Inilah sifat dan sikap orang-orang yang hidupnya penuh dengan kemunafikan."
  }
]