[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Seandainya orang-orang munafik itu mendapatkan tempat aman dan benteng pertahanan yang sanggup melindungi mereka atau gua di gunung yang memberi mereka tempat tinggal, atau lubang di dalam tanah yang menyelamatkan mereka dari kalian, pastilah mereka akan beranjak kesana dengan bersegera."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "57. Sekiranya orang-orang munafik itu menemukan tempat berlindung seperti benteng yang dapat mereka jadikan sebagai tempat untuk melindungi diri mereka, atau menemukan gua di gunung yang dapat mereka jadikan sebagai tempat persembunyian, atau menemukan terowongan yang dapat mereka masuki, tentu mereka akan berlindung di sana dan masuk ke dalamnya secepat mungkin."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "57. Seandainya orang-orang munafik itu menemukan tempat berlindung bagi diri mereka, menemukan gua di pegunungan untuk bersembunyi, atau lubang yang dapat mereka masuki; niscaya mereka akan segera memasukinya dengan cepat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "57. لَوْ يَجِدُونَ مَلْجَـًٔا (Jikalau mereka memperoleh tempat perlindungan) Berupa benteng atau sebagainya untuk melindungi diri mereka dari kalian. أَوْ مَغٰرٰتٍ(atau gua-gua) Agar mereka dapat bersembunyi dari kalian supaya kalian tidak memaksa mereka untuk pergi berperang bersama kalian. أَوْ مُدَّخَلًا(atau lobang-lobang) Agar mereka dapat memasukinya. لَّوَلَّوْا۟ إِلَيْهِ(niscaya mereka pergi kepadanya) Yakni mengungsikan diri mereka disana dan masuk ke dalamnya. وَهُمْ يَجْمَحُونَ(dengan secepat-cepatnya) Yakni dengan secepat-cepatnya tanpa ada sesuatupun yang dapat menghalangi mereka, seperti kuda yang berlari kencang yang tidak terhalang tali kekangnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "57. Jika mereka menemukan benteng untuk berlindung, gua atau lubang untuk bersembunyi dari kalian agar tidak kalian ajak berangkat untuk berperang, atau tempat yang bisa mereka masuki, niscaya mereka akan mendatanginya. Mereka akan bergegas memasukinya dengan tidak teratur lagi tidak terbendung layaknya kuda yang susah dikendalikan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Seandainya mereka mendapat tempat berlindung} benteng {gua-gua} gua-gua yang ada di gunung {atau lubang-lubang} lubang di dalam tanag {niscaya mereka pergi ke sana} mereka pergi ke sana dalam keadaan lari {dengan secepatnya} dengan cepat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "57. Kemudian Allah menyebutkan besarnya ketakutan mereka, Dia berfirman, “JIkalau mereka memperoleh tempat perlindungan”, sebagai tempat berlindung pada saat datangnya kesulitan “atau gua-gua” yang bisa mereka masuki dan tinggali “atau lubang-lubang (dalam tanah),” yaitu tempat persembunyian untuk membentengi diri mereka, “niscaya mereka pergi kepadanya dengan secepat-cepatnya”, yakni dengan cepat dan bergegas. Mereka tidak memiliki keteguhan yang membuat mereka tenang."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 57: Sambil menaruh kebencian dan dendam kepada kaum mukmin."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 57",
    "description": "Karena itu, sekiranya mereka memperoleh tempat perlindungan, guagua, lubang-lubang dalam tanah atau tempat-tempat persembunyian di mana saja, niscaya mereka akan segera pergi atau lari ke sana dengan secepat-cepatnya meski harus berkorban harta dan melalui jalan yang cukup sulit. Inilah sifat dan sikap orang-orang yang hidupnya penuh dengan kemunafikan. Ayat ini masih menginformasikan keburukan sifat dan sikap kaum munafik, yaitu bahwa di antara mereka ada yang mencelamu, wahai rasulullah, tentang pembagian sedekah, zakat, juga ganimah atau rampasan perang. Demikian ini, karena pengakuan iman tersebut hanyalah sebagai taktik untuk memperoleh kenikmatan duniawi. Karena itulah, jika mereka diberi bagian, baik dari zakat, infak, sedekah, maupun ganimah, mereka bersenang hati, puas bahkan memuji-Mujimu sebagai orang yang berbuat adil. Dan, sebaliknya, jika mereka tidak diberi bagian atau diberi bagian namun jumlahnya lebih sedikit daripada yang lain, tibatiba mereka marah, menunjukkan sikap penuh kebencian dan bahkan berani mencelamu tidak berbuat adil."
  }
]