[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan diantara orang-orang munafik ada orang yang mencelamu dalam pembagian sedekah. Kemudian bila ada bagian yang mereka dapatkan darinya, mereka akan rido dan diam saja. Dan apabila tidak ada bagian darinya yang mendatangi mereka, mereka akan murka kepadamu dan mencelamu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "58. Dan sebagian dari orang-orang munafik itu mencelamu -wahai Rasul- dalam pembagian zakat tatkala mereka tidak mendapatkan apa yang mereka inginkan. Jika kamu memberi mereka apa yang mereka minta, mereka suka kepadamu. Tetapi jika kamu tidak memberi mereka apa yang mereka minta, mereka akan menunjukkan kekecewaan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "58. Hai Rasulullah, sebagian orang-orang munafik mengkritikmu dalam pembagian harta sedekah, ketika mereka tidak mendapatkan bagian yang sesuai dengan keinginan mereka; Jika kamu memberi mereka sesuai yang mereka minta niscaya mereka akan puas terhadapmu, namun jika kamu tidak memberi mereka seperti yang mereka minta niscaya mereka akan mengeluh dan menggerutu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "58. وَمِنْهُم مَّن يَلْمِزُكَ فِى الصَّدَقٰتِ (Dan di antara mereka ada orang yang mencelamu tentang (distribusi) zakat) Yakni diantara orang-orang munafik itu terdapat golongan yang mencelamu dalam hal pembagian zakat. فَإِنْ أُعْطُوا۟ مِنْهَا(jika mereka diberi sebahagian dari padanya) Yakni sebagian dari sedekah dengan bagian yang sesuai keinginan mereka. رَضُوا۟( mereka bersenang hati) Atas apa yang dilakukan Rasulullah, dan mereka tidak mencelanya. Sebab mereka tidak mengharapkan kecuali kenikmatan dunia tanpa ada landasan agama sedikitpun. وَإِن لَّمْ يُعْطَوْا۟ مِنْهَآ(dan jika mereka tidak diberi sebahagian dari padanya) Sesuai dengan apa yang mereka inginkan dan minta. إِذَا هُمْ يَسْخَطُونَ(dengan serta merta mereka menjadi marah) Menunjukkan kekesalan dan ketidakrelaan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Seorang mukmin yang baik seharusnya tidak berkecil hati dan bersedih dengan hilangnya bagian yang ia miliki dari dunia ini, maka ketika ia dilalaikan dalam penetapan jabatan, atau jumlah gaji yang begitu rendah, dan semua itu tidak akan memenuhi cakrawala ini meskipun dengan teriakan dan kerusuhan; karena sesungguhnya marah kepada dunia dengan cara yang hina ini, adalah kebiasaan orang-orang munafiq yang dijelaskan oleh firman Allah : { وَمِنْهُمْ مَنْ يَلْمِزُكَ فِي الصَّدَقَاتِ فَإِنْ أُعْطُوا مِنْهَا رَضُوا وَإِنْ لَمْ يُعْطَوْا مِنْهَا إِذَا هُمْ يَسْخَطُونَ } \"Dan di antara mereka ada orang yang mencelamu tentang (distribusi) zakat; jika mereka diberi sebahagian dari padanya, mereka bersenang hati, dan jika mereka tidak diberi sebahagian dari padanya, dengan serta merta mereka menjadi marah\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "58. Dan sebagian orang-orang munafik itu mencelamu wahai Nabi terkait pembagian sedekah. Jika kamu memberi mereka sedekah dengan jumlah yang mereka sukai, niscaya mereka akan meridhaimu dalam pembagian itu, namun jika tidak, mereka akan marah, mengkritik dan menghujat keadilan dan pembagianmu. Ayat ini turun terkait Dzil Khuwaishirah At-Tamimiy saat berkata: “Adillah wahai rasulallah”, Lalu Nabi berabda: “Kalau aku tidak adil, siapa lagi yang akan adil?”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Di antara mereka} di antara orang-orang munafik {ada yang mencelamu} mencelamu {dalam hal sedekah} dalam pembagiaan sedekah {Jika mereka diberi sebagian darinya, mereka senang, dan jika mereka tidak diberi sebagian darinya, serta merta mereka marah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "58. Yakni di antara orang-orang munafik itu ada yang mencelamu dan mengkritikmu dalam pembagian zakat, akan tetapi kritikannya bukan untuk tujuan yang benar maupun pandangan yang lurus, akan tetapi tujuannya hanyalah agar mereka diberi. “JIka mereka diberi sebagian darinya, mereka bersenang hati, dan jika mereka tidak diberi sebagian darinya, dengan serta merta mereka menjadi marah.” Tidak selayaknya bagi seorang hamba mengikutkan rela dan marahnya kepada hawa nafsunya yang bersifat dunia dan tujuannya yang rusak, justru yang semestinya adalah hendaknya hawa nafsunya mengikuti ridha Rabbnya. Sebagaimana sabda Nabi Sholallohu alaihi wasallam \"tidak beriman salah seorang diantara kalian sampai hawa nafsunya mengikuti apa yang aku dating dengannya\" HR. Ibnu Abi Ashim"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 58: Imam Bukhari meriwayatkan dari Abu Sa’id, ia berkata: Ketika Nabi shallallahu 'alaihi wa sallam membagi-bagikan (zakat), Abdullah bin Dzul Khuwaishirah At Tamimi datang dan berkata, “Berlaku adillah, wahai Rasulullah!” Beliau menjawab, “Celaka kamu, siapakah yang akan berlaku adil jika saya tidak berlaku adil?” Umar bin Khaththab berkata, “Biarkanlah saya memenggal lehernya.” Beliau menjawab, “Biarkanlah dia, karena dia memiliki kawan-kawan yang kamu akan merasakan shalatmu sedikit jika dibanding shalatnya, demikian pula puasamu dibanding mereka. Mereka lepas dari agama sebagaimana lepasnya panah (tembus keluar) dari binatang buruannya. Dilihat bulu panahnya, maka tidak terdapat apa-apa, dilihat mata panahnya, maka tidak terlihat apa-apa, dilihat rishaf(tempat dimasukkan mata panah)nya ternyata tidak ada apa-apa, dilihat anak panahnya, maka tidak terlihat apa-apa, padahal telah melewati kotoran hewan dan darahnya (namun tidak membekas apa-apa pada panah itu). Tanda-tanda mereka adalah bahwa salah satu tangannya --atau bersabda: “Salah satu dadanya seperti dada wanita-- atau seperti sepotong daging yang bergoyang-goyang. Mereka keluar ketika terjadi perpecahan di antara manusia.” Abu Sa’id berkata, “Aku bersaksi, bahwa aku mendengar dari Nabi shallallahu 'alaihi wa sallam, dan aku bersaksi bahwa Ali memerangi mereka, sedangkan saya ikut bersamanya. Dihadapkan orang yang disebutkan sifatnya itu oleh Nabi shallallahu 'alaihi wa sallam. Tentang orang itulah turun ayat, “Wa minhum may yalmizuka fish shadaqaat…dst.” Celaan tersebut dimaksudkan agar mereka mendapatkan bagian, padahal keadaan seperti ini tidak patut ada dalam diri seorang hamba, di mana senang dan marahnya mengikuti hawa nafsunya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 58",
    "description": "Ayat ini masih menginformasikan keburukan sifat dan sikap kaum munafik, yaitu bahwa di antara mereka ada yang mencelamu, wahai rasulullah, tentang pembagian sedekah, zakat, juga ganimah atau rampasan perang. Demikian ini, karena pengakuan iman tersebut hanyalah sebagai taktik untuk memperoleh kenikmatan duniawi. Karena itulah, jika mereka diberi bagian, baik dari zakat, infak, sedekah, maupun ganimah, mereka bersenang hati, puas bahkan memuji-Mujimu sebagai orang yang berbuat adil. Dan, sebaliknya, jika mereka tidak diberi bagian atau diberi bagian namun jumlahnya lebih sedikit daripada yang lain, tibatiba mereka marah, menunjukkan sikap penuh kebencian dan bahkan berani mencelamu tidak berbuat adilpadahal, sekiranya mereka benar-benar rida atau menerimanya dengan puas dengan apa yang diberikan kepada mereka oleh Allah dan rasul-Nya, dan berkata, cukuplah Allah bagi kami sebagai sandaran hidup kami, sebab Allah pasti akan memberikan kepada kami sebagian dari karunianya dan juga rasul-Nya dengan memberi bagian kepada kami, baik dari zakat maupun ganimah, dan sesungguhnya kami orang-orang yang ber-harap kepada Allah, maka alangkah baik dan indahnya seandainya mereka bersikap seperti itu. Namun, kenyataannya mereka tidak melakukan demikian."
  }
]